{
  "title": {
    "text": "RFC 7536 - Large-Scale Broadband Measurement Use Cases",
    "ja": "RFC 7536 - 大規模ブロードバンド測定ユースケース"
  },
  "number": 7536,
  "created_at": "2019-10-30 02:08:09.938414+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                        M. Linsner\nRequest for Comments: 7536                                 Cisco Systems\nCategory: Informational                                       P. Eardley\nISSN: 2070-1721                                             T. Burbridge\n                                                                      BT\n                                                             F. Sorensen\n                                                                    Nkom\n                                                                May 2015",
      "raw": true
    },
    {
      "indent": 14,
      "text": "Large-Scale Broadband Measurement Use Cases",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "Measuring broadband performance on a large scale is important for network diagnostics by providers and users, as well as for public policy. Understanding the various scenarios and users of measuring broadband performance is essential to development of the Large-scale Measurement of Broadband Performance (LMAP) framework, information model, and protocol. This document details two use cases that can assist in developing that framework. The details of the measurement metrics themselves are beyond the scope of this document.",
      "ja": "大規模でブロードバンドのパフォーマンスを測定することは、プロバイダとユーザによるネットワーク診断のための重要なだけでなく、公共政策のためです。ブロードバンド性能を測定する様々なシナリオとユーザーを理解するブロードバンド性能（LMAP）フレームワーク、情報モデル、およびプロトコルの大規模測定の開発に不可欠です。この文書では、そのフレームワークの開発を支援することができます2つの使用例を詳述します。測定指標そのものの詳細は、このドキュメントの範囲を超えています。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 IESGによって承認されていないすべての文書がインターネットStandardのどんなレベルの候補です。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7536.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7536で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2015 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2015 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n2. Use Cases .......................................................3\n   2.1. Internet Service Provider (ISP) Use Case ...................3\n   2.2. Regulator Use Case .........................................4\n3. Details of ISP Use Case .........................................5\n   3.1. Understanding the Quality Experienced by Customers .........5\n   3.2. Understanding the Impact and Operation of New Devices\n        and Technology .............................................6\n   3.3. Design and Planning ........................................6\n   3.4. Monitoring Service Level Agreements ........................7\n   3.5. Identifying, Isolating, and Fixing Network Problems ........7\n4. Details of Regulator Use Case ...................................8\n   4.1. Providing Transparent Performance Information ..............8\n   4.2. Measuring Broadband Deployment .............................9\n   4.3. Monitoring Traffic Management Practices ...................10\n5. Implementation Options .........................................10\n6. Conclusions ....................................................12\n7. Security Considerations ........................................13\n8. Informative References .........................................15\nContributors ......................................................17\nAuthors' Addresses ................................................17",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "This document describes two use cases for the Large-scale Measurement of Broadband Performance (LMAP). The use cases contained in this document are (1) the Internet Service Provider Use Case and (2) the Regulator Use Case. In the first, a network operator wants to understand the performance of the network and the quality experienced by customers, while in the second, a regulator wants to provide information on the performance of the ISPs in their jurisdiction. There are other use cases that are not the focus of the initial LMAP work (for example, end users would like to use measurements to help identify problems in their home network and to monitor the performance of their broadband provider); it is expected that the same mechanisms are applicable.",
      "ja": "この文書では、ブロードバンドのパフォーマンス（LMAP）の大規模測定のための2つの使用例を示します。この文書に含まれるユースケースは、（1）インターネット・サービス・プロバイダユースケースと、（2）レギュレータユースケースです。第二に、レギュレータはその管轄内のISPの性能に関する情報を提供したいと考えつつ、第1に、ネットワークオペレータは、ネットワークのパフォーマンスと顧客が経験した品質を理解したいと考えています。初期LMAP作業の焦点（例えば、エンドユーザーが自分のホームネットワーク内の問題を特定し、そのブロードバンドプロバイダのパフォーマンスを監視するために役立つように測定値を使用したいと思います）ではない他の使用例があります。同じメカニズムが適用可能であることが期待されています。"
    },
    {
      "indent": 3,
      "text": "Large-scale measurements raise several security concerns, including privacy issues. These are summarized in Section 7 and considered in further detail in [Framework].",
      "ja": "大規模測定は、プライバシーの問題など、いくつかのセキュリティ上の問題を、提起します。これらは、第7節にまとめて、[フレームワーク]でさらに詳細に検討されています。"
    },
    {
      "indent": 0,
      "text": "2. Use Cases",
      "section_title": true,
      "ja": "2.ユースケース"
    },
    {
      "indent": 3,
      "text": "From the LMAP perspective, there is no difference between fixed service and mobile (cellular) service used for Internet access. Hence, like measurements will take place on both fixed and mobile networks. Fixed services include technologies like Digital Subscriber Line (DSL), Cable, and Carrier Ethernet. Mobile services include all those advertised as 2G, 3G, 4G, and Long Term Evolution (LTE). A metric defined to measure end-to-end services will execute similarly on all access technologies. Other metrics may be access technology specific. The LMAP architecture covers both IPv4 and IPv6 networks.",
      "ja": "LMAPの観点から、固定サービスとインターネットアクセスのために使用される移動（セルラー）サービスとの間の違いはありません。したがって、のような測定値は、両方の固定およびモバイルネットワーク上で行われます。固定サービスは、デジタル加入者線（DSL）、ケーブル、およびキャリアイーサネットのような技術が含まれます。モバイルサービスは、2G、3G、4G、およびロングタームエボリューション（LTE）としてアドバタイズされたすべてのものが挙げられます。エンドツーエンドのサービスを測定するために定義されたメトリックは、すべてのアクセス技術にも同様に実行されます。その他のメトリックは、特定のアクセス技術です。 LMAPアーキテクチャは、IPv4とIPv6ネットワークの両方をカバーします。"
    },
    {
      "indent": 0,
      "text": "2.1. Internet Service Provider (ISP) Use Case",
      "section_title": true,
      "ja": "2.1。インターネットサービスプロバイダ（ISP）ユースケース"
    },
    {
      "indent": 3,
      "text": "A network operator needs to understand the performance of their networks, the performance of the suppliers (downstream and upstream networks), the performance of Internet access services, and the impact that such performance has on the experience of their customers. Largely, the processes that ISPs operate (which are based on network measurement) include:",
      "ja": "ネットワークオペレータは、そのネットワークのパフォーマンス、取引先（下流と上流のネットワーク）のパフォーマンス、インターネット・アクセス・サービスのパフォーマンス、および、そのようなパフォーマンスが顧客の経験に与える影響を理解する必要があります。主に、（ネットワーク測定に基づいている）ISPが動作するプロセスが含まれます。"
    },
    {
      "indent": 3,
      "text": "o Identifying, isolating, and fixing problems, which may be in the network, with the service provider, or in the end-user equipment. Such problems may be common to a point in the network topology (e.g., a single exchange), common to a vendor or equipment type (e.g., line card or home gateway), or unique to a single user line (e.g., copper access). Part of this process may also be helping users understand whether the problem exists in their home network or with a third-party application service instead of with their broadband (BB) product.",
      "ja": "、同定、単離、及びネットワーク内の、サービスプロバイダに、またはエンドユーザ機器であってもよい問題を、固定O。このような問題は、ネットワークトポロジー（例えば、単一の交換）のポイントに共通のベンダーや機器の種類（例えば、ラインカードまたはホームゲートウェイ）に共通の、または単一のユーザライン（例えば、銅アクセス）に固有であってもよいです。このプロセスの一部は、ユーザーが問題を自分のホームネットワーク内またはサードパーティのアプリケーションサービスではなく、彼らのブロードバンド（BB）製品に存在するかどうかを理解する手助けすることができます。"
    },
    {
      "indent": 3,
      "text": "o Design and planning. Through monitoring the end-user experience, the ISP can design and plan their network to ensure specified levels of user experience. Services may be moved closer to end users, services upgraded, the impact of QoS assessed, or more capacity deployed at certain locations. Service Level Agreements (SLAs) may be defined at network or product boundaries.",
      "ja": "O設計と計画。エンドユーザーエクスペリエンスを監視を通じて、ISPはデザインとユーザーエクスペリエンスの指定されたレベルを確保するために、彼らのネットワークを計画することができます。サービスは、サービスのアップグレードは、QoSのの影響を評価し、またはそれ以上の容量が一定の場所で展開され、エンドユーザーに近づけることができます。サービスレベル契約（SLA）は、ネットワークまたは製品の境界で定義することができます。"
    },
    {
      "indent": 3,
      "text": "o Understanding the quality experienced by customers. The network operator would like to gain better insight into the end-to-end performance experienced by its customers. \"End-to-end\" could, for instance, incorporate home and enterprise networks, and the impact of peering, caching, and Content Delivery Networks (CDNs).",
      "ja": "Oの顧客が経験した品質を理解します。ネットワークオペレータは、顧客が経験したエンド・ツー・エンドのパフォーマンスに優れた洞察を得るしたいと思います。 「エンド・ツー・エンド」、例えば、家庭組み込み、エンタープライズ・ネットワーク、および、ピアリングキャッシング、コンテンツ配信ネットワーク（CDN）の影響を与える可能性があります。"
    },
    {
      "indent": 3,
      "text": "o Understanding the impact and operation of new devices and technology. As a new product is deployed, or a new technology introduced into the network, it is essential that its operation and its impact are measured. This also helps to quantify the advantage that the new technology is bringing and support the business case for larger roll-out.",
      "ja": "O新しいデバイスや技術の影響や動作を理解します。新製品が展開され、または新しい技術がネットワークに導入されると、その動作およびその影響が測定されていることが不可欠です。これはまた、新しい技術がもたらしているという利点を定量化し、より大きなロールアウトのためのビジネスケースをサポートするのに役立ちます。"
    },
    {
      "indent": 0,
      "text": "2.2. Regulator Use Case",
      "section_title": true,
      "ja": "2.2。レギュレータユースケース"
    },
    {
      "indent": 3,
      "text": "A regulator may want to evaluate the performance of the Internet access services offered by operators.",
      "ja": "レギュレータは、事業者が提供するインターネット接続サービスの性能を評価することをお勧めします。"
    },
    {
      "indent": 3,
      "text": "While each jurisdiction responds to distinct consumer, industry, and regulatory concerns, much commonality exists in the need to produce datasets that can be used to compare multiple Internet access service providers, diverse technical solutions, geographic and regional distributions, and marketed and provisioned levels and combinations of broadband Internet access services.",
      "ja": "各管轄が明確な消費者、産業、および規制当局の懸念に対応しながら、多くの共通点は、複数のインターネット・アクセス・サービス・プロバイダーを比較するために使用することができ、データセット、多様な技術的解決策、地理的および地域的分布、および販売およびプロビジョニングレベルを生成することが必要に存在し、ブロードバンドインターネットアクセスサービスの組み合わせ。"
    },
    {
      "indent": 3,
      "text": "Regulators may want to publish performance measures of different ISPs as background information for end users. They may also want to track the growth of high-speed broadband deployment, or to monitor the traffic management practices of Internet providers.",
      "ja": "規制当局は、エンドユーザーのための背景情報として、異なるISPのパフォーマンス指標を公開することもできます。彼らはまた、高速ブロードバンドの展開の成長を追跡するために、またはインターネットプロバイダのトラフィック管理の実践を監視することもできます。"
    },
    {
      "indent": 3,
      "text": "A regulator's role in the development and enforcement of broadband Internet access service policies requires that the measurement approaches meet a high level of verifiability, accuracy, and provider-independence to support valid and meaningful comparisons of Internet access service performance. Standards can help regulators' shared needs for scalable, cost-effective, scientifically robust solutions to the measurement and collection of broadband Internet access service performance information.",
      "ja": "ブロードバンドインターネットアクセスサービスポリシーの開発と実施におけるレギュレータの役割は、測定アプローチは、インターネット接続サービスのパフォーマンスの有効かつ意味のある比較をサポートするための検証可能性、正確性、およびプロバイダ独立性の高いレベルを満たすことが必要です。規格は、ブロードバンドインターネット接続サービスのパフォーマンス情報の測定とコレクションにスケーラブルで、費用対効果の高い、科学的に堅牢なソリューションのための規制当局の共有のニーズを助けることができます。"
    },
    {
      "indent": 0,
      "text": "3. Details of ISP Use Case",
      "section_title": true,
      "ja": "ISPユースケースの3.詳細"
    },
    {
      "indent": 0,
      "text": "3.1. Understanding the Quality Experienced by Customers",
      "section_title": true,
      "ja": "3.1。お客様が経験した品質を理解します"
    },
    {
      "indent": 3,
      "text": "Operators want to understand the quality of experience (QoE) of their broadband customers. The understanding can be gained through a \"panel\", i.e., measurement probes deployed to several customers. A probe is a device or piece of software that makes measurements and reports the results, under the control of the measurement system. Implementation options are discussed in Section 5. The panel needs to include a representative sample of the operator's technologies and broadband speeds. For instance, it might encompass speeds ranging from below 8 Mbps to over 100 Mbps. The operator would like the end-to-end view of the service, rather than just the access portion. This involves relating the pure network parameters to something like a 'mean opinion score' [MOS], which will be service dependent (for instance, web-browsing QoE is largely determined by latency above a few Mbps).",
      "ja": "事業者は、ブロードバンド顧客体感品質（QoE）理解したいです。理解はすなわち、測定プローブは、複数の顧客に展開、「パネル」を通じて得ることができます。プローブは、装置又は測定システムの制御下で、測定を行い、結果を報告するソフトウェアの一部です。実装オプションは、パネルは、オペレータの技術やブロードバンド速度の代表的なサンプルが含まれている必要があり5節で議論されています。例えば、それは100以上のMbpsに8 Mbpsの下からの範囲の速度を包含することがあります。オペレータではなく、単にアクセス部分よりも、サービスのエンド・ツー・エンドのビューをしたいと思います。これは、（例えば、ウェブ・ブラウジングのQoEが大きく、数Mbpsの上記の待ち時間によって決定される）サービス依存する「平均オピニオンスコア」[MOS]、のようなものに純粋なネットワークパラメータを関連付ける必要とします。"
    },
    {
      "indent": 3,
      "text": "An operator will also want compound metrics such as \"reliability\", which might involve packet loss, DNS failures, retraining of the line, video streaming under-runs, etc.",
      "ja": "また、オペレータは、アンダーランパケット損失、DNS障害、ラインの再訓練、ビデオストリーミングを伴うかもしれない、そのような「信頼性」などの化合物メトリクス、などをお勧めします"
    },
    {
      "indent": 3,
      "text": "The operator really wants to understand the end-to-end service experience. However, the home network (Ethernet, Wi-Fi, powerline) is highly variable and outside its control. To date, operators (and regulators) have instead measured performance from the home gateway. However, mobile operators clearly must include the wireless link in the measurement.",
      "ja": "オペレータは、実際にエンドツーエンドのサービスの経験を理解したいと考えています。しかし、ホームネットワーク（イーサネット、のWi-Fi、電力線）は非常に多様であり、そのコントロール外。現在までに、事業者（および規制当局が）代わりに、ホームゲートウェイからのパフォーマンスを測定しました。しかし、携帯電話事業者は明らかに、測定中に無線リンクを含める必要があります。"
    },
    {
      "indent": 3,
      "text": "Active measurements are the most obvious approach, i.e., special measurement traffic is sent by -- and to -- the probe. In order not to degrade the service of the customer, the measurement data should only be sent when the user is silent, and it shouldn't reduce the customer's data allowance. The other approach is passive measurements on the customer's ordinary traffic; the advantage is that it measures what the customer actually does, but it creates extra variability (different traffic mixes give different results) and, in particular, it raises privacy concerns. [RFC6973] discusses privacy considerations for Internet protocols in general, while [Framework] discusses them specifically for large-scale measurement systems.",
      "ja": "とに -   - プローブアクティブ測定は、最も明白なアプローチ、すなわち、特殊な測定トラフィックがで送信されます。顧客のサービスを劣化させないためには、測定データは、ユーザが沈黙しているときにのみ送信する必要があり、それが顧客のデータの手当を減らすべきではありません。他のアプローチは、顧客の通常のトラフィック上のパッシブ測定です。利点は、顧客が実際に何を測定し、それは余分な変動を作成します（異なるトラフィックミックスは異なる結果を与える）と、特に、それはプライバシーの問題を提起するということです。 【フレームワークは】大規模な測定システムのために特別にそれらを説明しながら、[RFC6973]は、一般に、インターネットプロトコルのためのプライバシーの考慮事項について説明します。"
    },
    {
      "indent": 3,
      "text": "From an operator's viewpoint, understanding customer experience enables it to offer better services. Also, simple metrics can be more easily understood by senior managers who make investment decisions and by sales and marketing.",
      "ja": "オペレータの観点から、顧客体験を理解することは、より良いサービスを提供できるようになります。また、簡単な指標がより簡単に投資判断を行う上級管理職によって、販売およびマーケティングによって理解することができます。"
    },
    {
      "indent": 0,
      "text": "3.2. Understanding the Impact and Operation of New Devices and Technology",
      "ja": "3.2。新しいデバイスと技術のインパクトと動作を理解します"
    },
    {
      "indent": 3,
      "text": "Another type of measurement is to test new capabilities before they are rolled out. For example, the operator may want to:",
      "ja": "測定のもう一つのタイプは、彼らがロールアウトされる前に、新機能をテストすることです。例えば、オペレータは、したいことがあります。"
    },
    {
      "indent": 3,
      "text": "o Check whether a customer can be upgraded to a new broadband option.",
      "ja": "O、顧客が新しいブロードバンドオプションにアップグレードすることができるかどうかを確認してください。"
    },
    {
      "indent": 3,
      "text": "o Understand the impact of IPv6 before it is made available to customers. Questions such as these could be assessed: Will v6 packets get through? What will the latency be to major websites? What transition mechanisms will be most appropriate?",
      "ja": "それが顧客に提供される前に、OのIPv6の影響を理解します。このような質問を評価することができます。パケットは介して取得V6のだろうか？レイテンシは、主要なウェブサイトには何になりますか？最も適切な何の移行メカニズムになりますか？"
    },
    {
      "indent": 3,
      "text": "o Check whether a new capability can be signaled using TCP options (how often it will be blocked by a middlebox -- along the lines of the experiments described in [Extend-TCP]).",
      "ja": "（ -  [拡張-TCP]をに記載した実験の線に沿って、それがミドルによってブロックされる頻度）O新機能はTCPオプションを使用してシグナリングすることができるかどうかを確認してください。"
    },
    {
      "indent": 3,
      "text": "o Investigate a QoS mechanism (e.g., checking whether Diffserv markings are respected on some path).",
      "ja": "O QoSメカニズムを調査（例えば、Diffservのマーキングは、いくつかの経路上に尊重されているかどうかをチェックします）。"
    },
    {
      "indent": 0,
      "text": "3.3. Design and Planning",
      "section_title": true,
      "ja": "3.3。デザインと計画"
    },
    {
      "indent": 3,
      "text": "Operators can use large-scale measurements to help with their network planning -- proactive activities to improve the network.",
      "ja": "事業者は、彼らのネットワーク計画を支援するために大規模な測定を使用することができます - 積極的な活動をネットワークを改善すること。"
    },
    {
      "indent": 3,
      "text": "For example, by probing from several different vantage points the operator can see that a particular group of customers has performance below that expected during peak hours, which should help with capacity planning. Naturally, operators already have tools to help with this -- a network element reports its individual utilization (and perhaps other parameters). However, making measurements across a path rather than at a point may make it easier to understand the network. There may also be parameters like bufferbloat that aren't currently reported by equipment and/or that are intrinsically path metrics.",
      "ja": "例えば、いくつかの異なる見晴らしの良いポイントからプローブすることにより、オペレータは、顧客の特定のグループは、キャパシティプランニングに役立つはずピーク時間、中に予想される以下の性能を有していることがわかります。当然のことながら、事業者はすでにこれを支援するためのツールを持っている - ネットワーク要素は、その個々の利用（そしておそらく他のパラメータ）を報告します。しかし、パス全体ではなく点での測定を行うことは、それが簡単にネットワークを理解することがあります。また、本質的にパスメトリックおよび/または現在の機器によって報告されていないbufferbloatのようなパラメータがあるかもしれません。"
    },
    {
      "indent": 3,
      "text": "With information gained from measurement results, capacity planning and network design can be more effective. Such planning typically uses simulations to emulate the measured performance of the current network and understand the likely impact of new capacity and potential changes to the topology. Simulations, informed by data from a limited panel of probes, can help quantify the advantage that a new technology brings and support the business case for larger roll-out.",
      "ja": "測定結果から得られた情報により、キャパシティプランニングおよびネットワークの設計は、より効果的にすることができます。そのような計画は、一般的に、現在のネットワークの測定された性能をエミュレートし、新しい容量やトポロジへの潜在的な変更の可能性への影響を理解するためにシミュレーションを使用しています。プローブの限定されたパネルからのデータによって知らさシミュレーションは、新しいテクノロジーがもたらすメリットを定量化し、より大きなロールアウトのためのビジネスケースをサポートすることができます。"
    },
    {
      "indent": 3,
      "text": "It may also be possible to use probes to run stress tests for risk analysis. For example, an operator could run a carefully controlled and limited experiment in which probing is used to assess the potential impact if some new application becomes popular.",
      "ja": "また、リスク分析のためのストレステストを実行するためのプローブを使用することも可能です。例えば、オペレータは、プロービングがいくつかの新しいアプリケーションが人気になった場合の潜在的な影響を評価するために使用されている慎重に制御し、限られた実験を実行することができます。"
    },
    {
      "indent": 0,
      "text": "3.4. Monitoring Service Level Agreements",
      "section_title": true,
      "ja": "3.4。サービスレベル契約の監視"
    },
    {
      "indent": 3,
      "text": "Another example is that the operator may want to monitor performance where there is a Service Level Agreement (SLA). This could be with its own customers; in particular, enterprises may have an SLA. The operator can proactively spot when the service is degrading near the point of the SLA limit and get information that will enable more informed conversations with the customer at contract renewal.",
      "ja": "別の例では、オペレータがサービスレベル契約（SLA）があるパフォーマンスを監視することです。これは、独自の顧客となり得ます。特に、企業はSLAを有していてもよいです。オペレータは、積極的にサービスがSLAの限界の地点の近くに低下されたときに発見し、契約更新時に、顧客とのより多くの情報に会話を可能にする情報を得ることができます。"
    },
    {
      "indent": 3,
      "text": "An operator may also want to monitor the performance of its suppliers, to check whether they meet their SLA or to compare two suppliers if it is dual-sourcing. This could include its transit operator, CDNs, peering, video source, or local network provider for a global operator in countries where it doesn't have its own network. A virtual operator may monitor the whole underlying network.",
      "ja": "オペレータはまた、彼らは彼らのSLAを満たすかどうかを確認するか、それはデュアルソーシングの場合は2つのサプライヤを比較するために、そのサプライヤーのパフォーマンスを監視することもできます。これは、輸送事業者、のCDN、ピアリング、ビデオソース、またはそれは、独自のネットワークを持っていない国でのグローバルな事業者のためのローカルネットワークプロバイダを含めることができます。仮想オペレータは、全体の基盤となるネットワークを監視することができます。"
    },
    {
      "indent": 3,
      "text": "Through a better understanding of its own network and its suppliers, the operator should be able to focus investment more effectively -- in the right place at the right time with the right technology.",
      "ja": "適切な場所に適切なタイミングで適切な技術で - 優れた独自のネットワークの理解とそのサプライヤーを通じて、オペレータは、より効果的に投資を集中することができるはずです。"
    },
    {
      "indent": 0,
      "text": "3.5. Identifying, Isolating, and Fixing Network Problems",
      "section_title": true,
      "ja": "3.5。 、同定、単離、およびネットワークの問題を修正"
    },
    {
      "indent": 3,
      "text": "Operators can use large-scale measurements to help identify a fault more rapidly and decide how to solve it.",
      "ja": "オペレータは、より迅速に障害を特定し、それを解決する方法を決定するのを助けるために大規模な測定を使用することができます。"
    },
    {
      "indent": 3,
      "text": "Operators already have Test and Diagnostic tools, where a network element reports some problem or failure to a management system. However, many issues are not caused by a point failure but something wider and so will trigger too many alarms, while other issues will cause degradation rather than failure and so not trigger any alarm. Large-scale measurements can help provide a more nuanced view that helps network management to identify and fix problems more rapidly and accurately. The network management tools may use simulations to emulate the network and so help identify a fault and assess possible solutions.",
      "ja": "オペレータは、既にネットワーク要素は、管理システムに何らかの問題や失敗を報告するテストおよび診断ツールを持っています。しかし、多くの問題は、ポイント故障はなく、より広い何かによって引き起こされていないので、他の問題ではなく、障害よりも劣化の原因となるので、任意のアラームをトリガしませんが、あまりにも多くのアラームがトリガされます。大規模な測定がより迅速かつ正確に問題を特定し、修正するために、ネットワーク管理を支援し、より微妙なビューを提供することができます。ネットワーク管理ツールは、ネットワークをエミュレートするためにシミュレーションを使用し、その障害を識別するのに役立つと考えられる解決策を評価することができます。"
    },
    {
      "indent": 3,
      "text": "An operator can obtain useful information without measuring the performance on every broadband line. By measuring a subset, the operator can identify problems that affect a group of customers. For example, the issue could be at a shared point in the network topology (such as an exchange), or common to a vendor, or equipment type; for instance, [IETF85-Plenary] describes a case where a particular home gateway upgrade had caused a (mistaken!) drop in line rate.",
      "ja": "オペレータは、すべてのブロードバンド回線のパフォーマンスを測定することなく、有用な情報を入手することができます。サブセットを測定することにより、オペレータは顧客のグループに影響を与える問題を特定することができます。たとえば、問題は、共有（Exchangeなど）、ネットワークトポロジの点、またはベンダー、または機器のタイプに共通であってもよいです。たとえば、[IETF85-本会議は、特定のホームゲートウェイのアップグレードはラインレートで（誤解！）低下の原因となっていた場合について説明します。"
    },
    {
      "indent": 3,
      "text": "A more extensive deployment of the measurement capability to every broadband line would enable an operator to identify issues unique to a single customer. Overall, large-scale measurements can help an operator fix the fault more rapidly and/or allow the affected customers to be informed of what's happening. More accurate information enables the operator to reassure customers and take more rapid and effective action to cure the problem.",
      "ja": "すべてのブロードバンド回線に測定機能のより広範な展開は、単一の顧客に固有の問題を識別するための作業を可能にします。全体的に、大規模な測定は、オペレータがより迅速に障害を修正および/または影響を受けた顧客は何が起こっているかを知らせることができるようにすることができます。より正確な情報は、顧客を安心して問題を治すために、より迅速かつ効果的な行動を取るためにオペレータを可能にします。"
    },
    {
      "indent": 3,
      "text": "Often, customers experience poor broadband due to problems in the home network -- the ISP's network is fine. For example, they may have moved too far away from their wireless access point. Anecdotally, a large fraction of customer calls about fixed BB problems are due to in-home wireless issues. These issues are expensive and frustrating for an operator, as they are extremely hard to diagnose and solve. The operator would like to narrow down whether the problem is in the home (a problem with the home network, edge device, or home gateway), in the operator's network, or with an application service. The operator would like two capabilities: firstly, self-help tools that customers use to improve their own service or understand its performance better -- for example, to reposition their devices for better Wi-Fi coverage; and secondly, on-demand tests that the operator can run instantly, so that the call center person answering the phone (or e-chat) could trigger a test and get the result while the customer is still in an online session.",
      "ja": "多くの場合、顧客は、ホームネットワーク内の問題に起因する貧困層のブロードバンドを体験 -  ISPのネットワークは大丈夫です。例えば、彼らはあまりにも遠く離れて無線アクセスポイントから移動している可能性があります。ちなみに、顧客の大部分は、およそ固定BBの問題は、家庭内の無線の問題に起因している呼び出します。これらの問題は、彼らが診断し、解決することが非常に困難なように、オペレータのために高価で、イライラしています。オペレータは、オペレータのネットワーク内、またはアプリケーションサービスと、問題は、ホーム（家庭内ネットワーク、エッジデバイス、またはホームゲートウェイとの問題）であるか否かを絞り込むたいです。演算子は2つの機能をしたいと思います：第一に、顧客は自分のサービスの向上やより良い性能を把握するために使用するセルフヘルプツール - 例えば、より良いのWi-Fiのカバレッジのために自分のデバイスを再配置することを。そして第二に、オンデマンドの顧客がオンラインセッションにまだある間、コールセンターの電話に答える人（またはE-チャットが）テストをトリガし、結果を得ることができるように、オペレータは、即座に実行できることをテストします。"
    },
    {
      "indent": 0,
      "text": "4. Details of Regulator Use Case",
      "section_title": true,
      "ja": "レギュレータユースケースの4.詳細"
    },
    {
      "indent": 0,
      "text": "4.1. Providing Transparent Performance Information",
      "section_title": true,
      "ja": "4.1。透明なパフォーマンス情報の提供"
    },
    {
      "indent": 3,
      "text": "Some regulators publish information about the quality of the various Internet access services provided in their national market. Quality information about service offers could include speed, delay, and jitter. Such information can be published to facilitate end users' choice of service provider and offer. Regulators may check the accuracy of the marketing claims of Internet service providers and may also encourage ISPs to all use the same metrics in their service level contracts. The goal of these transparency mechanisms is to promote competition for end users and potentially also help content, application, service, and device providers develop their Internet offerings.",
      "ja": "いくつかの規制当局は、自国の市場に提供される様々なインターネット・アクセス・サービスの品質に関する情報を公開します。サービスの提供に関する品質情報は、速度、遅延、およびジッタを含めることができます。このような情報は、サービスプロバイダとオファーのエンドユーザーの選択を容易にするために公開することができます。規制当局は、インターネットサービスプロバイダのマーケティングの特許請求の範囲の精度を確認することができ、また、すべてのサービスレベル契約に同じメトリックを使用するのISPを奨励することがあります。これらの透明性メカニズムの目標は、エンドユーザーのための競争を促進し、潜在的に、コンテンツ、アプリケーション、サービス、およびデバイスプロバイダがインターネットの提供の開発を支援することです。"
    },
    {
      "indent": 3,
      "text": "The published information needs to be:",
      "ja": "公開された情報は、する必要があります："
    },
    {
      "indent": 3,
      "text": "o Accurate - the measurement results must be correct and not influenced by errors or side effects. The results should be reproducible and consistent over time.",
      "ja": "正確なO  - 測定結果が正しいとエラーや副作用の影響を受けないでなければなりません。結果は再現性があり、時間をかけて一貫している必要があります。"
    },
    {
      "indent": 3,
      "text": "o Comparable - common metrics should be used across different ISPs and service offerings, and over time, so that measurement results can be compared.",
      "ja": "O匹敵 - 測定結果を比較することができるように共通のメトリックは、異なるISPとサービス提供を横切る、時間の経過とともに使用されるべきです。"
    },
    {
      "indent": 3,
      "text": "o Meaningful - the metrics used for measurements need to reflect what end users value about their broadband Internet access service.",
      "ja": "O有意義 - 測定のために使用されるメトリックは、ブロードバンドインターネット接続サービスについてどのようなエンドユーザーの価値を反映する必要があります。"
    },
    {
      "indent": 3,
      "text": "o Reliable - the number and distribution of measurement agents, and the statistical processing of the raw measurement data, need to be appropriate.",
      "ja": "O信頼性 - 数と計測剤の分布、および生の測定データの統計処理は、適切である必要があります。"
    },
    {
      "indent": 3,
      "text": "In practical terms, the regulators may measure network performance from users towards multiple content and application providers, including dedicated test measurement servers. Measurement probes are distributed to a 'panel' of selected end users. The panel covers all the operators and packages in the market, spread over urban, suburban, and rural areas, and often includes both fixed and mobile Internet access. Periodic tests running on the probes can, for example, measure actual speed at peak and off-peak hours, but can also measure other detailed quality metrics like delay and jitter. Collected data goes afterwards through statistical analysis, deriving estimates for the whole population. Summary information, such as a service quality index, is published regularly, perhaps alongside more detailed information.",
      "ja": "実用的な面では、規制当局は、専用の試験測定サーバなど、複数のコンテンツおよびアプリケーションプロバイダに対するユーザーからのネットワークパフォーマンスを測定することができます。測定プローブは、選択されたエンドユーザの「パネル」に分配されます。パネルは、都市郊外、および農村地域に広がって、市場内のすべての演算子とパッケージをカバーし、多くの場合、固定およびモバイル・インターネット・アクセスの両方を含んでいます。プローブ上で実行されている定期的な試験は、例えば、時間のピーク時とオフピーク実際の速度を測定することができるだけでなく、遅延やジッタのような他の詳細な品質メトリックを測定することができます。収集されたデータは、全人口の推定値を導出する、統計的な分析を通じて、その後行きます。そのようなサービスの質の指標として要約情報は、おそらく、より詳細な情報と一緒に、定期的に出版されています。"
    },
    {
      "indent": 3,
      "text": "The regulator can also facilitate end users to monitor the performance of their own broadband Internet access service. They might use this information to check that the performance meets that specified in their contract or to understand whether their current subscription is the most appropriate.",
      "ja": "レギュレータは、独自のブロードバンドインターネットアクセスサービスのパフォーマンスを監視するために、エンドユーザーを容易にすることができます。彼らはパフォーマンスが彼らの契約で指定されたか、現在のサブスクリプションが最も適切であるかどうかを理解することを満たしていることを確認するために、この情報を使用することがあります。"
    },
    {
      "indent": 0,
      "text": "4.2. Measuring Broadband Deployment",
      "section_title": true,
      "ja": "4.2。ブロードバンドの展開を測定します"
    },
    {
      "indent": 3,
      "text": "Regulators may also want to monitor the improvement over time of actual broadband Internet access performance in a specific country or a region. The motivation is often to evaluate the effect of the stimulated growth over time, when government has set a strategic goal for high-speed broadband deployment, whether in absolute terms or benchmarked against other countries. An example of such an initiative is [DAE]. The actual measurements can be made in the same way as described in Section 4.1.",
      "ja": "規制当局はまた、特定の国または地域における実際のブロードバンド・インターネット・アクセス性能の経時改善を監視することもできます。動機は、政府が絶対的にかどうか、高速ブロードバンドの展開のための戦略的な目標を設定したり、他の国をベンチマークした時間にわたって刺激成長の効果を評価することが多いです。そのような取り組みの例は、[DAE]です。実際の測定は、セクション4.1で説明したのと同じ方法で行うことができます。"
    },
    {
      "indent": 0,
      "text": "4.3. Monitoring Traffic Management Practices",
      "section_title": true,
      "ja": "4.3。トラフィック管理慣行の監視"
    },
    {
      "indent": 3,
      "text": "A regulator may want to monitor traffic management practices or compare the performance of Internet access service with specialized services offered in parallel to, but separate from, Internet access service (for example, IPTV). A regulator could monitor for departures from application agnosticism such as blocking or throttling of traffic from specific applications, or preferential treatment of specific applications. A measurement system could send, or passively monitor, application-specific traffic and then measure in detail the transfer of the different packets. While it is relatively easy to measure port blocking, how to detect other types of differentiated treatment is a research topic in itself. The \"Glasnost: Enabling End Users to Detect Traffic Differentiation\" paper [M-Labs_NSDI-2010] and follow-on tool \"Glasnost\" [Glasnost] provide an example of work in this area.",
      "ja": "レギュレータは、トラフィック管理慣行を監視するかに平行で提供専門的なサービスと、インターネット・アクセス・サービスのパフォーマンスを比較したいのですが、インターネット・アクセス・サービス（例えば、IPTV）から分離することができます。レギュレータは、特定のアプリケーション、または特定のアプリケーションの優遇から遮断またはトラフィックの絞りなどのアプリケーション不可知論からの逸脱のために監視することができます。測定システムは、異なるパケットの転送を送信し、または受動的に監視し、アプリケーション固有のトラフィック、次に詳細に測定することができます。それはポートブロッキングを測定することは比較的簡単ですが、どのように差別化治療の他の種類を検出することは、それ自体での研究テーマです。 ：紙[M-Labs_NSDI-2010]「グラスノスチトラフィック分化を検出するために、エンドユーザーを有効にする」とフォローオンツール「グラスノスチ」[グラスノスチ]この分野での作業の例を提供します。"
    },
    {
      "indent": 3,
      "text": "A regulator could also monitor the performance of the broadband service over time, to try and detect if the specialized service is provided at the expense of the Internet access service. Comparison between ISPs or between different countries may also be relevant for this kind of evaluation.",
      "ja": "レギュレータも試してみて、専門的なサービスはインターネット接続サービスを犠牲にして提供されるかどうかを検出するために、時間をかけてブロードバンドサービスのパフォーマンスを監視することができます。 ISP間や異なる国間の比較も評価この種の関連する可能性があります。"
    },
    {
      "indent": 3,
      "text": "The motivation for a regulator monitoring such traffic management practices is that regulatory approaches related to net neutrality and the open Internet have been introduced in some jurisdictions. Examples of such efforts are the Internet policy as outlined by the Body of European Regulators for Electronic Communications guidelines for quality of service [BEREC-Guidelines] and the US FCC's \"Preserving the Open Internet\" Report and Order [FCC-R&O]. Although legal challenges can change the status of policy, the take-away for LMAP purposes is that policy-makers are looking for measurement solutions to assist them in discovering biased treatment of traffic flows. The exact definitions and requirements vary from one jurisdiction to another.",
      "ja": "そのようなトラフィック管理の実践を監視レギュレータのための動機は、ネットの中立性とオープンなインターネットに関連する規制のアプローチは、いくつかの国で導入されているということです。電子通信サービスの品質に関するガイドライン[BEREC-ガイドライン]と米国のFCCの「オープンインターネットの保存」報告書と発注[FCC-R＆O]欧州規制当局のボディによって概説されているような取り組みの例としては、インターネットの方針です。訴訟は、ポリシーのステータスを変更することができますが、LMAPの目的のために持ち帰りは、政策立案者は、トラフィックの偏った治療流れを発見して、それらを支援するために計測ソリューションを探しているということです。正確な定義や要件は、1つの管轄ごとに異なります。"
    },
    {
      "indent": 0,
      "text": "5. Implementation Options",
      "section_title": true,
      "ja": "5.実装オプション"
    },
    {
      "indent": 3,
      "text": "There are several ways of implementing a measurement system. The choice may be influenced by the details of the particular use case and what the most important criteria are for the regulator, ISP, or third party operating the measurement system.",
      "ja": "測定システムを実装するにはいくつかの方法があります。選択は、特定のユースケースの詳細と、どのような最も重要な基準は、測定システムを動作させるレギュレータ、ISP、または第三者のためのものによって影響され得ます。"
    },
    {
      "indent": 3,
      "text": "One type of probe is a special hardware device that is connected directly to the home gateway. The devices are deployed to a carefully selected panel of end users, and they perform measurements according to a defined schedule. The schedule can run throughout the day, to allow continuous assessment of the network. Careful design ensures that measurements do not detrimentally impact the home user experience or corrupt the results by testing when the user is also using the broadband line. The system is therefore tightly controlled by the operator of the measurement system. One advantage of this approach is that it is possible to get reliable benchmarks for the performance of a network with only a few devices. One disadvantage is that it would be expensive to deploy hardware devices on a mass scale sufficient to understand the performance of the network at the granularity of a single broadband user.",
      "ja": "プローブの一つのタイプは、ホームゲートウェイに直接接続されている特別なハードウェアデバイスです。デバイスは、エンドユーザーの慎重に選択されたパネルに配備され、それらが定義されたスケジュールに従って測定を実行しています。スケジュールは、ネットワークの継続的な評価を可能にするために、一日を通して実行することができます。慎重な設計により、ユーザはまた、ブロードバンド回線を利用しているときの測定値が悪影響テストして、ホームユーザーエクスペリエンスや破損した結果に影響を与えないことを保証します。システムは、したがって、しっかり測定システムのオペレータによって制御されます。このアプローチの利点の一つは、唯一のいくつかのデバイスとネットワークのパフォーマンスのための信頼性のベンチマークを取得することが可能であるということです。 1つの欠点は、単一のブロードバンドユーザーの粒度でネットワークのパフォーマンスを理解するのに十分な質量スケールのハードウェアデバイスを展開する高価になるということです。"
    },
    {
      "indent": 3,
      "text": "Another type of probe involves implementing the measurement capability as a webpage or an \"app\" that end users are encouraged to download onto their mobile phone or computing device. Measurements are triggered by the end user; for example, the user interface may have a button to \"test my broadband now.\" One advantage of this approach is that the performance is measured to the end user, rather than to the home gateway, and so includes the home network. Another difference is that the system is much more loosely controlled, as the panel of end users and the schedule of tests are determined by the end users themselves rather than the measurement system. While this approach makes it easier to make measurements on a large scale, it is harder to get comparable benchmarks, as the measurements are affected by the home network; also, the population is self-selecting and so potentially biased towards those who think they have a problem. This could be alleviated by encouraging widespread downloading of the app and careful post-processing of the results to reduce biases.",
      "ja": "プローブのもう一つのタイプは、ウェブページやエンドユーザーが自分の携帯電話やコンピューティングデバイス上にダウンロードすることが奨励されていることを「アプリ」として測定機能を実装する必要。測定は、エンドユーザによってトリガされます。例えば、ユーザインタフェースは、「今、私のブロードバンドをテストします。」ボタンを有することができますこのアプローチの一つの利点は、パフォーマンスがエンドユーザーにではなく、ホームゲートウェイに測定されることであるので、ホームネットワークを含みます。別の相違点は、エンドユーザーのパネル及び試験のスケジュールは、エンドユーザー自身ではなく、測定システムによって決定されるように、システムは、はるかに緩やかに制御されることです。このアプローチは、それが簡単に大規模に測定を行うことになりますが、測定がホームネットワークの影響を受けているとして、比較可能なベンチマークを取得するには困難です。また、人口が自己選択であるので、潜在的に、彼らは問題を抱えていると思う人たちに偏っ。これは、バイアスを減らすために、結果のアプリと慎重な後処理の広範囲のダウンロードを促進することで軽減することができます。"
    },
    {
      "indent": 3,
      "text": "There are several other possibilities. For example, as a variant on the first approach, the measurement capability could be implemented as software embedded in the home gateway, which would make it more viable to have the capability on every user line. As a variant on the second approach, the end user could initiate measurements in response to a request from the measurement system.",
      "ja": "他のいくつかの可能性があります。例えば、最初のアプローチの変形として、測定機能は、それがより実行可能なすべてのユーザーのライン上の機能を持つようになるだろうホームゲートウェイに組み込まれたソフトウェアとして実現することができます。第二のアプローチで変形例として、エンドユーザは、測定システムからの要求に応じて、測定を開始することができます。"
    },
    {
      "indent": 3,
      "text": "The operator of the measurement system should be careful to ensure that measurements do not detrimentally impact users. Potential issues include the following:",
      "ja": "測定システムのオペレータは、測定が有害ユーザに影響を与えないように注意しなければなりません。潜在的な問題には次のものがあります。"
    },
    {
      "indent": 3,
      "text": "* Measurement traffic generated on a particular user's line may impact that end user's quality of experience. The danger is greater for measurements that generate a lot of traffic over a lengthy period.",
      "ja": "特定のユーザーのライン上に生成された*測定トラフィックは、経験のそのエンドユーザーの品質に影響を与える可能性があります。危険なのは、長い期間にわたって多くのトラフィックを生成する測定のために大きいです。"
    },
    {
      "indent": 3,
      "text": "* The measurement traffic may impact that particular user's bill or traffic cap.",
      "ja": "*測定トラフィックは、その特定のユーザの請求書や交通キャップに影響を与える可能性があります。"
    },
    {
      "indent": 3,
      "text": "* The measurement traffic from several end users may, in combination, congest a shared link.",
      "ja": "*いくつかのエンドユーザーからの測定トラフィックは、組み合わせて、共有リンクを混雑します。"
    },
    {
      "indent": 3,
      "text": "* The traffic associated with the control and reporting of measurements may overload the network. The danger is greater where the traffic associated with many end users is synchronized.",
      "ja": "*測定の制御および報告に関連するトラフィックは、ネットワークに過負荷をかけてもよいです。危険なのは、多くのエンドユーザに関連するトラフィックが同期されているところも大きいです。"
    },
    {
      "indent": 0,
      "text": "6. Conclusions",
      "section_title": true,
      "ja": "6.結論"
    },
    {
      "indent": 3,
      "text": "Large-scale measurements of broadband performance are useful for both network operators and regulators. Network operators would like to use measurements to help them better understand the quality experienced by their customers, identify problems in the network, and design network improvements. Regulators would like to use measurements to help promote competition between network operators, stimulate the growth of broadband access, and monitor 'net neutrality'. There are other use cases that are not the focus of the initial LMAP charter (although it is expected that the mechanisms developed would be readily applied); for example, end users would like to use measurements to help identify problems in their home network and to monitor the performance of their broadband provider.",
      "ja": "広帯域性能の大規模な測定は、ネットワーク事業者および規制当局の両方に有用です。ネットワークオペレータは、彼らがより良い顧客が経験した品質を理解するための測定値を使用して、ネットワークの問題、およびデザイン・ネットワークの改善を確認したいと思います。規制当局は、ネットワーク事業者間の競争を促進するための測定値を使用してブロードバンド・アクセスの成長を刺激し、「ネット中立性」を監視したいと思います。初期LMAPチャーターの焦点（開発メカニズムが容易に適用されることが予想されるが）ではない他のユースケースがあります。例えば、エンドユーザーが自分のホームネットワーク内の問題を特定し、そのブロードバンドプロバイダのパフォーマンスを監視するために役立つように測定値を使用したいと思います。"
    },
    {
      "indent": 3,
      "text": "From consideration of the various use cases, several common themes emerge, while there are also some detailed differences. These characteristics guide the development of LMAP's framework, information model, and protocol.",
      "ja": "また、いくつかの詳細な違いがある一方で、様々なユースケースを考慮して、いくつかの共通のテーマは、出現します。これらの特性は、LMAPのフレームワーク、情報モデル、およびプロトコルの発展を導きます。"
    },
    {
      "indent": 3,
      "text": "A measurement capability is needed across a wide number of heterogeneous environments. Tests may be needed in the home network, in the ISP's network, or beyond; they may be measuring a fixed or wireless network; they may measure just the access network or across several networks.",
      "ja": "測定機能は、異種環境の広い数全体に必要とされています。テストは、ISPのネットワークで、またはを超えて、ホームネットワークで必要とすることができます。それらは固定または無線ネットワークを測定することができます。彼らは、アクセスネットワークまたは複数のネットワークを介しを測定することができます。"
    },
    {
      "indent": 3,
      "text": "There is a role for both standardized and non-standardized measurements. For example, a regulator would like to publish standardized performance metrics for all network operators, while an ISP may need their own tests to understand some feature special to their network. Most use cases need active measurements, which create and measure specific test traffic, but some need passive measurements of the end user's traffic.",
      "ja": "標準化と非標準の両方の測定のための役割があります。例えば、レギュレータは、ISPが自社のネットワークへの特別ないくつかの機能を理解するために、独自のテストを必要とするかもしれないが、すべてのネットワーク事業者のための標準化されたパフォーマンスメトリックを公開したいと思います。ほとんどのユースケースを作成して、特定のテストトラフィックを測定アクティブ測定を必要とするが、いくつかは、エンドユーザーのトラフィックの受動的な測定を必要とします。"
    },
    {
      "indent": 3,
      "text": "Regardless of the tests being operated, there needs to be a way to demand or schedule the tests. Most use cases need a regular schedule of measurements, but sometimes ad hoc testing is needed -- for example, for troubleshooting. It needs to be ensured that measurements do not affect the user experience and are not affected by user traffic (unless desired). In addition, there needs to be a common way to collect the results. Standardization of this control and reporting functionality allows the operator of a measurement system to buy the various components from different vendors.",
      "ja": "かかわらず、テストが操作されるの需要やテストのスケジュールを設定する方法が必要です。ほとんどのユースケースは、測定の定期的なスケジュールを必要とするが、時には臨時検査が必要とされている - たとえば、トラブルシューティングのために。これは、測定は、ユーザーエクスペリエンスに影響を与えませんし、（必要な場合を除き）ユーザトラフィックに影響されないことを保証する必要があります。また、結果を収集する一般的な方法が必要です。このコントロールおよびレポート機能の標準化は、測定システムのオペレータは、異なるベンダーからさまざまなコンポーネントを購入することができます。"
    },
    {
      "indent": 3,
      "text": "After the measurement results are collected, they need to be understood and analyzed. Often, it is sufficient to measure only a small subset of end users, but per-line fault diagnosis requires the ability to test every individual line. Analysis requires accurate definition and understanding of where the test points are, as well as contextual information about the topology, line, product, and the subscriber's contract. The actual analysis of results is beyond the scope of LMAP, as is the key challenge of how to integrate the measurement system into a network operator's existing tools for diagnostics and network planning.",
      "ja": "測定結果が収集された後、彼らは理解して分析する必要があります。多くの場合、エンドユーザーの小さなサブセットのみを測定するのに十分であるが、1ラインずつの故障診断は、すべての個々のラインをテストする能力が必要です。分析は、正確な定義とテストポイントがどこにあるかを理解するだけでなく、トポロジー、ライン、製品、および加入者の契約に関するコンテキスト情報を必要とします。診断およびネットワーク計画のためのネットワークオペレータの既存のツールに測定システムを統合する方法の重要な課題があると結果の実際の分析は、LMAPの範囲を超えています。"
    },
    {
      "indent": 3,
      "text": "Finally, the test data, along with any associated network, product, or subscriber contract data, is commercial or private information and needs to be protected.",
      "ja": "最後に、関連するすべてのネットワーク、製品、または加入者の契約データと一緒にテストデータは、商用またはプライベート情報であり、保護される必要があります。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "ja": "7.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "Large-scale measurements raise several potential security, privacy (data protection) [RFC6973], and business sensitivity issues:",
      "ja": "大規模測定は、いくつかの潜在的なセキュリティ、プライバシー（データ保護）[RFC6973]、およびビジネス感度の問題を提起します："
    },
    {
      "indent": 3,
      "text": "1. A malicious party may try to gain control of probes to launch DoS (Denial of Service) attacks at a target. A DoS attack could be targeted at a particular end user or set of end users, a certain network, or a specific service provider.",
      "ja": "1.悪意のあるパーティは、ターゲットでのDoS（サービス拒否）攻撃を開始するためのプローブの制御を獲得しようとするかもしれません。 DoS攻撃は、特定のエンドユーザをターゲットまたはエンドユーザーが、特定のネットワーク、または特定のサービスプロバイダの設定することができます。"
    },
    {
      "indent": 3,
      "text": "2. A malicious party may try to gain control of probes to create a platform for pervasive monitoring [RFC7258] or for more targeted monitoring. [RFC7258] summarizes the threats as follows: \"An attack may change the content of the communication, record the content or external characteristics of the communication, or through correlation with other communication events, reveal information the parties did not intend to be revealed.\" For example, a malicious party could distribute to the probes a new measurement test that recorded (and later reported) information of maleficent interest. Similar concerns also arise if the measurement results are intercepted or corrupted.",
      "ja": "2.悪意のあるパーティが普及し、監視[RFC7258]のために以上の対象モニタリングのためのプラットフォームを作成するためのプローブの制御を獲得しようとするかもしれません。次のように[RFC7258]は脅威をまとめた：「攻撃は、通信の内容を変更するコンテンツや通信の外部特性を記録し、または他の通信イベントとの相関によって、当事者が明らかにされることを意図していなかった情報を明らかにすることができます」たとえば、悪意のあるパーティは、プローブにマレフィセントの関心のある情報を記録（およびそれ以降の報告）新しい測定試験を配布することができます。測定結果が傍受または破損している場合、同様の懸念も生じます。"
    },
    {
      "indent": 6,
      "text": "* From the end user's perspective, the concerns include a malicious party monitoring the traffic they send and receive, who they communicate with, the websites they visit, and such information about their behavior as when they are at home and the location of their devices. Some of the concerns may be greater when the probe is on the end user's device rather than on their home gateway.",
      "ja": "*エンドユーザーの視点からは、懸念は、彼らはとの通信、彼らが送受信するトラフィックを監視し、悪質なパーティ、彼らが訪問ウェブサイト、彼らは家とそのデバイスの位置にあるときのように彼らの行動について、このような情報が含まれています。プローブは、エンドユーザーのデバイス上ではなく、彼らのホームゲートウェイ上にあるときの懸念のいくつかは大きくてもよいです。"
    },
    {
      "indent": 6,
      "text": "* From the network operator's perspective, the concerns include the leakage of commercially sensitive information about the design and operation of their network, their customers, and suppliers. Some threats are indirect; for example, the attacker could reconnoiter potential weaknesses, such as open ports and paths through the network, which enabled it to launch an attack later.",
      "ja": "*ネットワークオペレータの観点から、懸念が彼らのネットワーク、顧客、およびサプライヤの設計と運用に関する商業機密情報の漏洩を含んでいます。いくつかの脅威は、間接的です。例えば、攻撃者は、このような後に攻撃を開始するためにそれを有効にネットワークを介して開いているポートやパス、などの潜在的な弱点を、偵察できました。"
    },
    {
      "indent": 6,
      "text": "* From the regulator's perspective, the concerns include distortion of the measurement tests or alteration of the measurement results. Also, a malicious network operator could try to identify the broadband lines that the regulator was measuring and prioritize that traffic (\"game the system\").",
      "ja": "*レギュレータの観点からは、懸念が測定試験や測定結果の改ざんの歪みを含んでいます。また、悪質なネットワークオペレータは、（「システムのゲーム」）レギュレータが測定されたブロードバンド回線を識別し、そのトラフィックを優先しようとすることができます。"
    },
    {
      "indent": 3,
      "text": "3. Another potential issue is a measurement system that does not obtain the end user's informed consent, fails to specify a specific purpose in the consent, or uses the collected information for secondary uses beyond those specified.",
      "ja": "3.別の潜在的な問題は、エンドユーザーのインフォームドコンセントを取得していない測定システムは、同意に特定の目的を指定するために失敗した場合、または指定されたもの以外の二次利用のために収集した情報を使用しています。"
    },
    {
      "indent": 3,
      "text": "4. Another potential issue is a measurement system that does not indicate who is responsible for the collection and processing of personal data and who is responsible for fulfilling the rights of users. The responsible party (often termed the \"data controller\") should, as good practice, consider such issues as defining:",
      "ja": "4.別の潜在的な問題は、個人データの収集と処理のために責任があると誰がユーザーの権利を満たすための責任者を示すものではありません測定システムです。責任者（多くの場合、「データコントローラ」と呼ばれる）は、良いプラクティスとして、定義するような問題を考慮する必要があります。"
    },
    {
      "indent": 6,
      "text": "o the purpose for which the data is collected and used,",
      "ja": "Oデータが収集され、使用される目的、"
    },
    {
      "indent": 6,
      "text": "o how the data is stored, accessed, and processed,",
      "ja": "Oデータは、格納されたアクセス、およびどのように処理されますか、"
    },
    {
      "indent": 6,
      "text": "o how long the data is retained, and",
      "ja": "Oデータが保持されているどのくらいの時間、および"
    },
    {
      "indent": 6,
      "text": "o how the end user can view, update, and even delete their personal data.",
      "ja": "Oどのようにエンドユーザは、表示の更新、さらには自分の個人データを削除することができます。"
    },
    {
      "indent": 6,
      "text": "If anonymized personal data is shared with a third party, the data controller should consider the possibility that the third party can de-anonymize it by combining it with other information.",
      "ja": "匿名化個人データが第三者と共有されている場合、データコントローラは、第三者が他の情報と組み合わせることにより、それを脱匿名化することができるという可能性を考慮すべきです。"
    },
    {
      "indent": 3,
      "text": "These security and privacy issues will need to be considered carefully by any measurement system. In the context of LMAP, [Framework] considers them further, along with some potential mitigations. Other LMAP documents will specify one or more protocols that enable the measurement system to instruct a probe about what measurements to make and that enable the probe to report the measurement results. Those documents will need to discuss solutions to the security and privacy issues. However, the protocol documents will not consider the actual usage of the measurement information. Many use cases can be envisaged, and earlier in this document we described some likely ones for the network operator and regulator.",
      "ja": "これらのセキュリティとプライバシーの問題は、任意の測定システムによって慎重に検討する必要があります。 LMAPの文脈において、[フレームワークは、いくつかの潜在的な緩和策とともに、さらに、それらを考慮しています。その他LMAPの文書が作成する内容測定に関するプローブを指示し、その測定結果を報告するためのプローブを有効にするには、測定システムを可能にする1つまたは複数のプロトコルを指定します。これらのドキュメントは、セキュリティとプライバシーの問題への解決策を議論する必要があります。しかし、プロトコルドキュメントは、測定情報の実際の使用状況を考慮しています。多くのユースケースを想定することができ、そしてこのドキュメントでは、我々はネットワークオペレータとレギュレータのためにいくつかの可能性の高いものを説明しました。"
    },
    {
      "indent": 0,
      "text": "8. Informative References",
      "section_title": true,
      "ja": "8.参考文献"
    },
    {
      "indent": 3,
      "text": "[IETF85-Plenary] Crawford, S., \"Large-Scale Active Measurement of Broadband Networks\", 'example' from slide 18, November 2012, <http://www.ietf.org/proceedings/85/slides/ slides-85-iesg-opsandtech-7.pdf>.",
      "ja": "スライド18から[IETF85-ナリー]クロフォード、S.、 \"ブロードバンドネットワークの大規模活性測定\"、 '一例'、2012年11月、<http://www.ietf.org/proceedings/85/slides/ slides- 85-IESG-opsandtech-7.pdf>。"
    },
    {
      "indent": 3,
      "text": "[Extend-TCP] Honda, M., Nishida, Y., Raiciu, C., Greenhalgh, A., Handley, M., and H. Tokuda, \"Is it Still Possible to Extend TCP?\", Proceedings of IETF 82, November 2011, <http://www.ietf.org/proceedings/82/slides/IRTF-1.pdf>.",
      "ja": "[拡張-TCPを]ホンダ、M.、西田、Y.、Raiciu、C.、グリーンハル、A.、ハンドリー、M.、およびH.徳田は、 \"TCPを拡張することは可能ですか？\"、IETF 82の議事録、2011年11月、<http://www.ietf.org/proceedings/82/slides/IRTF-1.pdf>。"
    },
    {
      "indent": 3,
      "text": "[Framework] Eardley, P., Morton, A., Bagnulo, M., Burbridge, T., Aitken, P., and A. Akhter, \"A framework for Large-Scale Measurement of Broadband Performance (LMAP)\", Work in Progress, draft-ietf-lmap-framework-14, April 2015.",
      "ja": "【フレームワーク】Eardley、P.、モートン、A.、Bagnulo、M.、バーブリッジ、T.、エイトケン、P.、およびA. Akhter、 \"ブロードバンドパフォーマンス（LMAP）の大規模測定のためのフレームワーク\"、ワーク進行中、ドラフト-IETF-LMAPフレームワーク-14、2015年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC6973] Cooper, A., Tschofenig, H., Aboba, B., Peterson, J., Morris, J., Hansen, M., and R. Smith, \"Privacy Considerations for Internet Protocols\", RFC 6973, July 2013, <http://www.rfc-editor.org/info/rfc6973>.",
      "ja": "[RFC6973]クーパー、A.、Tschofenig、H.、Aboba、B.、ピーターソン、J.、モリス、J.、ハンセン、M.、およびR.スミス、 \"インターネットプロトコルのためのプライバシーの考慮事項\"、RFC 6973、2011 2013年、<http://www.rfc-editor.org/info/rfc6973>。"
    },
    {
      "indent": 3,
      "text": "[RFC7258] Farrell, S. and H. Tschofenig, \"Pervasive Monitoring Is an Attack\", BCP 188, RFC 7258, May 2014, <http://www.rfc-editor.org/info/rfc7258>.",
      "ja": "[RFC7258]ファレル、S.およびH. Tschofenig、 \"パーベイシブモニタリングが攻撃である\"、BCP 188、RFC 7258、2014年5月、<http://www.rfc-editor.org/info/rfc7258>。"
    },
    {
      "indent": 3,
      "text": "[FCC-R&O] United States Federal Communications Commission, \"Preserving the Open Internet; Broadband Industries Practices: Report and Order\", FCC 10-201, December 2010, <http://hraunfoss.fcc.gov/edocs_public/attachmatch/ FCC-10-201A1.pdf>.",
      "ja": "[FCC-R＆O]米国連邦通信委員会、 \"オープンインターネットの保全、ブロードバンド産業プラクティス：報告書と注文\"、FCC 10-201、2010年12月、<http://hraunfoss.fcc.gov/edocs_public/attachmatch/ FCC -10-201A1.pdf>。"
    },
    {
      "indent": 3,
      "text": "[BEREC-Guidelines] Body of European Regulators for Electronic Communications, \"BEREC Guidelines for quality of service in the scope of net neutrality\", <http://berec.europa.eu/eng/ document_register/subject_matter/berec/download/0/ 1101-berec-guidelines-for-quality-of-service-_0.pdf>.",
      "ja": "[BEREC-ガイドライン]電子通信のための欧州の規制当局のボディ、「ネットの中立性の範囲におけるサービス品質のためのBERECガイドライン」、<http://berec.europa.eu/eng/ document_register / subject_matter / berec /ダウンロード/ 0 / 1101-berec  - ガイドライン - のための品質のサービス-_0.pdf>。"
    },
    {
      "indent": 3,
      "text": "[M-Labs_NSDI-2010] M-Lab, \"Glasnost: Enabling End Users to Detect Traffic Differentiation\", <http://www.measurementlab.net/ download/AMIfv945ljiJXzG-fgUrZSTu2hs1xRl5Oh-rpGQMWL305BNQh-BSq5oBoYU4a7zqXOvrztpJhK9gwk5unOe-fOzj4X-vOQz_HRrnYU-aFd0rv332RDReRfOYkJuagysstN3GZ__lQHTS8_ UHJTWkrwyqIUjffVeDxQ/>.",
      "ja": "[M-Labs_NSDI-2010] M-Labの、<http://www.measurementlab.net/ダウンロード/ AMIfv945ljiJXzG-fgUrZSTu2hs1xRl5Oh-rpGQMWL305BNQh-BSq5oBoYU4a7zqXOvrztpJhK9gwk5unOe-fOzj4X-vOQz_HRrnYU-aFd0rv332RDReRfOYkJuagysstN3GZ__lQHTS8_ UHJTWkrwyqIUjffVeDxQ、 \"グラスノスチ交通分化を検出するために、エンドユーザーの有効化\" />。"
    },
    {
      "indent": 3,
      "text": "[Glasnost] M-Lab tool \"Glasnost\", <http://mlab-live.appspot.com/ tools/glasnost>.",
      "ja": "[音量] M-Labのツール \"ボリューム\"、<http://mlab-live.appspot.com/ツール/音量>。"
    },
    {
      "indent": 3,
      "text": "[MOS] Wikipedia, \"Mean Opinion Score\", January 2015, <http://en.wikipedia.org/w/index.php? title=Mean_opinion_score&oldid=644494161>.",
      "ja": "[MOS]ウィキペディア、 \"平均オピニオン評点\"、2015年1月、<http://en.wikipedia.org/w/index.php？タイトル= Mean_opinion_score＆oldid = 644494161>。"
    },
    {
      "indent": 3,
      "text": "[DAE] Digital Agenda for Europe, COM(2010)245 final, \"Communication from the Commission to the European Parliament, the Council, the European Economic and Social Committee and the Committee of the Regions\", <http://eur-lex.europa.eu/legal-content/EN/TXT/ PDF/?uri=CELEX:52010DC0245&from=EN>.",
      "ja": "[DAE]欧州デジタルアジェンダ、COM（2010）245最後の、「欧州議会の委員会、理事会、経済社会評議会と地域委員会からのコミュニケーション」<のhttp：// EUR-LEX ？.europa.eu /リーガルコンテンツ/ EN / TXT / PDF / URI = CELEX：52010DC0245＆= ENから>。"
    },
    {
      "indent": 0,
      "text": "Contributors",
      "ja": "協力者"
    },
    {
      "indent": 3,
      "text": "The information in this document is partially derived from text written by the following contributors:",
      "ja": "このドキュメントの情報は、部分的に、次の貢献者によって書かれたテキストから導出されます。"
    },
    {
      "indent": 6,
      "text": "James Miller jamesmilleresquire@gmail.com",
      "ja": "ジェームズ・ミラーjamesmilleresquire@gmail.com"
    },
    {
      "indent": 6,
      "text": "Rachel Huang rachel.huang@huawei.com",
      "ja": "レイチェル黄レイチェル。華為黄@ .COM"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Marc Linsner Cisco Systems, Inc. Marco Island, FL United States",
      "ja": "マルク・Linsnerシスコシステムズ、株式会社マルコアイランド、フロリダ州、米国"
    },
    {
      "indent": 3,
      "text": "EMail: mlinsner@cisco.com",
      "ja": "メールアドレス：mlinsner@cisco.com"
    },
    {
      "indent": 3,
      "text": "Philip Eardley BT B54 Room 77, Adastral Park, Martlesham Ipswich, IP5 3RE United Kingdom",
      "ja": "フィリップEardley BT B54ルーム77、Adastral公園、Martleshamイプスウィッチ、IP5 3REイギリス"
    },
    {
      "indent": 3,
      "text": "EMail: philip.eardley@bt.com",
      "ja": "メールアドレス：philip.eardley@bt.com"
    },
    {
      "indent": 3,
      "text": "Trevor Burbridge BT B54 Room 70, Adastral Park, Martlesham Ipswich, IP5 3RE United Kingdom",
      "ja": "トレバー・バーブリッジBT B54ルーム70、Adastral公園、Martleshamイプスウィッチ、IP5 3REイギリス"
    },
    {
      "indent": 3,
      "text": "EMail: trevor.burbridge@bt.com",
      "ja": "メールアドレス：trevor.burbridge@bt.com"
    },
    {
      "indent": 3,
      "text": "Frode Sorensen Norwegian Communications Authority (Nkom) Lillesand Norway",
      "ja": "フローデ・ソレンセンノルウェーの通信局（Nkom）Lillesandノルウェー"
    },
    {
      "indent": 3,
      "text": "EMail: frode.sorensen@nkom.no",
      "ja": "メールアドレス：frode.sorensen@nkom.no"
    }
  ]
}