{
  "title": {
    "text": "RFC 6094 - Summary of Cryptographic Authentication Algorithm Implementation Requirements for Routing Protocols",
    "ja": "RFC 6094 - ルーティングプロトコルの暗号化認証アルゴリズム実装要件の概要"
  },
  "number": 6094,
  "created_at": "2019-10-28 03:43:42.153944+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         M. Bhatia\nRequest for Comments: 6094                                Alcatel-Lucent\nCategory: Informational                                        V. Manral\nISSN: 2070-1721                                              IP Infusion\n                                                           February 2011",
      "raw": true
    },
    {
      "indent": 4,
      "text": "Summary of Cryptographic Authentication Algorithm Implementation\n               Requirements for Routing Protocols",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "The routing protocols Open Shortest Path First version 2 (OSPFv2), Intermediate System to Intermediate System (IS-IS), and Routing Information Protocol (RIP) currently define cleartext and MD5 (Message Digest 5) methods for authenticating protocol packets. Recently, effort has been made to add support for the SHA (Secure Hash Algorithm) family of hash functions for the purpose of authenticating routing protocol packets for RIP, IS-IS, and OSPF.",
      "ja": "ルーティングプロトコルオープン最短パス優先バージョン2（OSPFv2の）、中間システム（IS-IS）の中間システム、及びルーティング情報プロトコル（RIP）は、現在プロトコルパケットを認証するためのクリアテキストやMD5（メッセージダイジェスト5）メソッドを定義します。最近、努力は、IS-IS、OSPFおよびRIPのルーティング・プロトコル・パケットを認証するためにSHAのサポートハッシュ関数（セキュアハッシュアルゴリズム）ファミリーを追加するためになされたもの。"
    },
    {
      "indent": 3,
      "text": "To encourage interoperability between disparate implementations, it is imperative that we specify the expected minimal set of algorithms, thereby ensuring that there is at least one algorithm that all implementations will have in common.",
      "ja": "本質的に異なる実装間の相互運用性を促進するために、我々がそれによってすべての実装に共通しているのだろう少なくとも一つのアルゴリズムが存在することを保証し、アルゴリズムの期待最小セットを指定することが不可欠です。"
    },
    {
      "indent": 3,
      "text": "Similarly, RIP for IPv6 (RIPng) and OSPFv3 support IPsec algorithms for authenticating their protocol packets.",
      "ja": "同様に、それらのプロトコルパケットを認証するためのIPv6（RIPngの）とのOSPFv3支持IPsecアルゴリズムのためのRIP。"
    },
    {
      "indent": 3,
      "text": "This document examines the current set of available algorithms, with interoperability and effective cryptographic authentication protection being the principal considerations. Cryptographic authentication of these routing protocols requires the availability of the same algorithms in disparate implementations. It is desirable that newly specified algorithms should be implemented and available in routing protocol implementations because they may be promoted to requirements at some future time.",
      "ja": "この文書では、相互運用性と効果的な暗号認証の保護が主な検討事項であることと、利用可能なアルゴリズムの現在のセットを調べます。これらのルーティングプロトコルの暗号化認証は、異なる実装において同じアルゴリズムの可用性を必要とします。彼らはいくつかの将来の時点で要件に昇格することができるので、新たに指定されたアルゴリズムが実装され、ルーティングプロトコルの実装で利用できることが望ましいです。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 IESGによって承認されていないすべての文書がインターネットStandardのどんなレベルの候補です。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6094.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6094で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2011 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2011 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n2. Intermediate System to Intermediate System (IS-IS) ..............4\n   2.1. Authentication Scheme Selection ............................4\n   2.2. Authentication Algorithm Selection .........................5\n3. Open Shortest Path First Version 2 (OSPFv2) .....................5\n   3.1. Authentication Scheme Selection ............................6\n   3.2. Authentication Algorithm Selection .........................6\n4. Open Shortest Path First Version 3 (OSPFv3) .....................7\n5. Routing Information Protocol Version 2 (RIPv2) ..................7\n   5.1. Authentication Scheme Selection ............................7\n   5.2. Authentication Algorithm Selection .........................8\n6. Routing Information Protocol for IPv6 (RIPng) ...................8\n7. Security Considerations .........................................9\n8. Acknowledgements ................................................9\n9. References .....................................................10\n   9.1. Normative References ......................................10\n   9.2. Informative References ....................................10",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "Most routing protocols include three different types of authentication schemes: Null authentication, cleartext password, and cryptographic authentication. Null authentication is equivalent to having no authentication scheme at all.",
      "ja": "ヌル認証、平文パスワード、および暗号化認証：ほとんどのルーティングプロトコルは、認証方式の異なる3種類があります。ヌル認証はまったく認証スキームを持っていないことと同じです。"
    },
    {
      "indent": 3,
      "text": "In a cleartext scheme, also known as a \"simple password\" scheme, the password is exchanged completely unprotected, and anyone with physical access to the network can learn the password and compromise the integrity of the routing domain. The simple password scheme protects against accidental establishment of routing sessions in a given domain, but beyond that it offers no additional protection.",
      "ja": "また、「単純なパスワード」方式として知られている平文の方式では、パスワードは完全に無防備に交換され、ネットワークに物理的にアクセスできる者は誰でも、パスワードを学び、ルーティングドメインの完全性を損なうことができます。単純なパスワード方式は、特定のドメイン内のルーティングセッションの不慮の設立から保護し、それを超えて、それは追加の保護を提供しています。"
    },
    {
      "indent": 3,
      "text": "In a cryptographic authentication scheme, routers share a secret key that is used to generate a message authentication code for each of the protocol packets. Today, routing protocols that implement message authentication codes often use a Keyed-MD5 [RFC1321] digest. The recent escalating series of attacks on MD5 raise concerns about its remaining useful lifetime.",
      "ja": "暗号認証方式では、ルータは、プロトコルパケットのそれぞれに対するメッセージ認証コードを生成するために使用される秘密鍵を共有します。今日では、メッセージ認証コードを実装するルーティングプロトコルは、多くの場合、キー付き-MD5 [RFC1321]ダイジェストを使用します。 MD5に対する攻撃の最近のエスカレートシリーズは、その残りの有効寿命についての懸念を提起します。"
    },
    {
      "indent": 3,
      "text": "These attacks may not necessarily result in direct vulnerabilities for Keyed-MD5 digests as message authentication codes because the colliding message may not correspond to a syntactically correct protocol packet. The known collision, pre-image, and second pre-image attacks [RFC4270] on MD5 may not increase the effectiveness of the key recovery attacks on HMAC-MD5. Regardless, there is a need felt to deprecate MD5 [RFC1321] as the basis for the Hashed Message Authentication Code (HMAC) algorithm in favor of stronger digest algorithms.",
      "ja": "衝突メッセージが構文的に正しいプロトコルパケットに対応しない可能性があるため、キー付き-MD5メッセージ認証コードとして消化のためにこれらの攻撃は、必ずしも直接の脆弱性をもたらさないかもしれません。 MD5で既知の衝突、プレ画像、および第2のプリイメージ攻撃[RFC4270]はHMAC-MD5のキー回復攻撃の有効性を増加させてもよいです。関係なく、必要性が強くダイジェストアルゴリズムの有利なハッシュメッセージ認証コード（HMAC）アルゴリズムの基礎としてMD5 [RFC1321]を廃止する感じがあります。"
    },
    {
      "indent": 3,
      "text": "In light of these considerations, there are proposals to replace HMAC-MD5 with keyed HMAC-SHA [SHS] digests where HMAC-MD5 is currently mandated in RIPv2 [RFC2453] IS-IS [ISO] [RFC1195], and Keyed-MD5 in OSPFv2 [RFC2328].",
      "ja": "これらの考慮事項に照らして、HMAC-MD5は現在、RIPv2の[RFC2453]で義務付けられているキー付きHMAC-SHA [SHS]ダイジェストでHMAC-MD5を交換する提案がある[RFC1195] [ISO] IS-IS、およびキー入力-MD5 OSPFv2の[RFC2328]。"
    },
    {
      "indent": 3,
      "text": "OSPFv3 [RFC5340] and RIPng [RFC2080] rely on the IPv6 Authentication Header (AH) [RFC4302] and IPv6 Encapsulating Security Payload (ESP) [RFC4303] in order to provide integrity, authentication, and/or confidentiality.",
      "ja": "OSPFv3の[RFC5340]とRIPngの[RFC2080]は整合性、認証、および/または機密性を提供するために、IPv6の認証ヘッダー（AH）[RFC4302]とIPv6カプセル化セキュリティペイロード（ESP）[RFC4303]に依存しています。"
    },
    {
      "indent": 3,
      "text": "However, the nature of cryptography is that algorithmic improvement is an ongoing process, as is the exploration and refinement of attack vectors. An algorithm believed to be strong today may be demonstrated to be weak tomorrow. Given this, the choice of preferred algorithm should favor the minimization of the likelihood of it being compromised quickly.",
      "ja": "しかし、暗号の性質は、攻撃ベクトルの探索と洗練があるとして、アルゴリズムの改善は、継続的なプロセスであるということです。今日の強いものと考えられたアルゴリズムは、明日弱いことが証明することができます。この与えられ、好ましいアルゴリズムの選択は、それがすぐに侵害される可能性の最小化を優先すべきです。"
    },
    {
      "indent": 3,
      "text": "It should be recognized that preferred algorithm(s) will change over time to adapt to the evolving threats. At any particular time, the mandatory-to-implement algorithm(s) might not be specified in the base protocol specification. As protocols are extended, the preference for presently stronger algorithms presents a problem regarding the question of interoperability of existing and future implementations with respect to standards, and also regarding operational preference for the configuration as deployed.",
      "ja": "好ましいアルゴリズム（s）は、進化する脅威に適応するための時間をかけて変化することを認識すべきです。任意の特定の時点で、強制的に実装アルゴリズム（複数可）は、基本プロトコル仕様で指定されない場合があります。プロトコルが拡張されたように、現在強力なアルゴリズムのための好みが基準に関しては、既存および将来の実装の相互運用性の問題に関する問題を提示し、また展開されたような構成のための操作の好みに関する。"
    },
    {
      "indent": 3,
      "text": "It is expected that an implementation should support the changing of security (authentication) keys. Changing the symmetric key used in any HMAC algorithm on a periodic basis is good security practice. Operators need to plan for this.",
      "ja": "実装は、セキュリティ（認証）鍵の変更をサポートする必要があることを期待されています。定期的に任意のHMACアルゴリズムで使用される対称鍵を変更すると、優れたセキュリティの実践です。オペレータは、このために計画する必要があります。"
    },
    {
      "indent": 3,
      "text": "Implementations can support in-service key change so that no control packets are lost. During an in-service/in-band key change, more than one key can be active for receiving packets for a session. Some protocols support a key identifier that allows the two peers of a session to have multiple keys simultaneously for a session.",
      "ja": "何の制御パケットが失われないように、実装は、サービス中のキーの変更をサポートすることができます。インサービス/インバンドキーの変更時には、複数のキーは、セッションのパケットを受信するためにアクティブにすることができます。一部のプロトコルは、セッションの2つのピアがセッションのために同時に複数のキーを持つことができますキー識別子をサポートしています。"
    },
    {
      "indent": 3,
      "text": "However, these protocols currently manage keys manually (i.e., via operator intervention) or dynamically based on some timer or security protocol.",
      "ja": "しかしながら、これらのプロトコルは、現在、いくつかのタイマーやセキュリティプロトコルに基づいて手動で（すなわち、オペレータの介入を介して）又は動的にキーを管理します。"
    },
    {
      "indent": 0,
      "text": "2. Intermediate System to Intermediate System (IS-IS)",
      "section_title": true,
      "ja": "中間システム（IS-IS）2.中間システム"
    },
    {
      "indent": 3,
      "text": "The IS-IS specification allows for authentication of its Protocol Data Units (PDUs) via the authentication TLV (TLV 10) in the PDU. The base specification [ISO] had provisions only for cleartext passwords. [RFC5304] extends the authentication capabilities by providing cryptographic authentication for IS-IS PDUs. It mandates support for HMAC-MD5.",
      "ja": "仕様では、IS-PDUにおける認証TLV（TLV 10）を介して、そのプロトコルデータユニット（PDU）の認証を可能にします。基本仕様[ISO]は唯一の平文パスワードの規定を持っていました。 [RFC5304]はIS-IS PDUに対して暗号認証を提供することにより、認証機能を拡張します。これは、HMAC-MD5のサポートを義務付け。"
    },
    {
      "indent": 3,
      "text": "[RFC5310] adds support for the use of any cryptographic hash function for authenticating IS-IS PDUs. In addition to this, [RFC5310] also details how IS-IS can use the HMAC construct along with the Secure Hash Algorithm (SHA) family of cryptographic hash functions to secure IS-IS PDUs.",
      "ja": "[RFC5310]はIS-IS PDUを認証するための任意の暗号化ハッシュ関数を使用するためのサポートを追加します。これに加えて、[RFC5310]はまた、IS-ISは、どのように確保するために暗号ハッシュ関数のファミリーは、IS-IS PDUのセキュアハッシュアルゴリズム（SHA）と共に構築HMACを使用することができ詳細。"
    },
    {
      "indent": 0,
      "text": "2.1. Authentication Scheme Selection",
      "section_title": true,
      "ja": "2.1。認証スキームの選択"
    },
    {
      "indent": 3,
      "text": "In order for IS-IS implementations to securely interoperate, they must support one or more authentication schemes in common. This section specifies the preference for standards-conformant IS-IS implementations that use accepted authentication schemes.",
      "ja": "しっかりと相互運用するIS-ISの実装ためには、彼らが共通内の1つまたは複数の認証方式をサポートしている必要があります。このセクションでは、標準規格準拠のための好みが認められた認証方式を使用する実装IS-ISを指定します。"
    },
    {
      "indent": 3,
      "text": "The earliest interoperability requirement for authentication as stated by [ISO] [RFC1195] required all implementations to support a",
      "ja": "[ISO] [RFC1195]で述べたように、認証のための最も初期の相互運用性の要件がサポートするすべての実装を必要と"
    },
    {
      "indent": 3,
      "text": "cleartext password. This authentication scheme's utility is limited to precluding the accidental introduction of a new IS into a broadcast domain. Operators should not use this scheme, as it provides no protection against an attacker with access to the broadcast domain: anyone can determine the secret password through inspection of the PDU. This mechanism does not provide any significant level of security and should be avoided.",
      "ja": "平文パスワード。この認証方式のユーティリティが新しいの偶然の導入は、ブロードキャストドメインにIS妨げに制限されています。それはブロードキャストドメインへのアクセス権を持つ攻撃者に対する保護を提供しないようオペレータは、この方式を使うべきではありません。誰もがPDUの検査を通じて秘密のパスワードを決定することができます。このメカニズムは、セキュリティの大幅なレベルを提供していませんし、避けるべきです。"
    },
    {
      "indent": 3,
      "text": "[RFC5304] defined the cryptographic authentication scheme for IS-IS. HMAC-MD5 was the only algorithm specified; hence, it is mandated. [RFC5310] defined a generic cryptographic scheme and added support for additional algorithms. Implementations should support [RFC5310], as it defines the generic cryptographic authentication scheme.",
      "ja": "[RFC5304]はIS-ISのための暗号認証方式を定義しました。 HMAC-MD5は、指定されたアルゴリズムだけでした。したがって、それが義務付けられています。 [RFC5310]は、一般的な暗号化方式を定義し、追加のアルゴリズムのサポートを追加しました。それは、一般的な暗号認証方式を定義するよう実装は、[RFC5310]をサポートする必要があります。"
    },
    {
      "indent": 0,
      "text": "2.2. Authentication Algorithm Selection",
      "section_title": true,
      "ja": "2.2。認証アルゴリズムの選択"
    },
    {
      "indent": 3,
      "text": "For IS-IS implementations to securely interoperate, they must have support for one or more authentication algorithms in common.",
      "ja": "IS-ISの実装がしっかりと相互運用するために、彼らは共通で1つ以上の認証アルゴリズムをサポートしている必要があります。"
    },
    {
      "indent": 3,
      "text": "This section details the authentication algorithm requirements for standards-conformant IS-IS implementations.",
      "ja": "このセクションでは、実装IS-IS規格準拠の認証アルゴリズムの要件を詳しく説明しています。"
    },
    {
      "indent": 3,
      "text": "The following are the available options for authentication algorithms:",
      "ja": "以下は、認証アルゴリズムで使用可能なオプションは次のとおりです。"
    },
    {
      "indent": 3,
      "text": "o [RFC5304] mandates the use of HMAC-MD5.",
      "ja": "O [RFC5304]はHMAC-MD5の使用を義務付け。"
    },
    {
      "indent": 3,
      "text": "o [RFC5310] does not require a particular algorithm but instead supports any digest algorithm (i.e., cryptographic hash functions).",
      "ja": "O [RFC5310]特定のアルゴリズムを必要とする代わりに、任意のダイジェストアルゴリズム（即ち、暗号ハッシュ関数）をサポートしていません。"
    },
    {
      "indent": 3,
      "text": "As noted earlier, there is a desire to deprecate MD5. IS-IS implementations will likely migrate to an authentication scheme supported by [RFC5310], because it is algorithm agnostic. Possible digest algorithms include SHA-1, SHA-224, SHA-256, SHA-384, and SHA-512. Picking at least one mandatory-to-implement algorithm is imperative to ensuring interoperability.",
      "ja": "先に述べたように、MD5を廃止することが望まれています。それは、アルゴリズムとらわれないので、実装はおそらく、[RFC5310]でサポートされている認証方式に移行しますIS-IS。可能なダイジェストアルゴリズムはSHA-1、SHA-224、SHA-256、SHA-384およびSHA-512を含みます。少なくとも一つの実装に必須のアルゴリズムを選ぶことは、相互運用性を確保することが不可欠です。"
    },
    {
      "indent": 0,
      "text": "3. Open Shortest Path First Version 2 (OSPFv2)",
      "section_title": true,
      "ja": "3.オープン最短パスファーストバージョン2（OSPFv2の）"
    },
    {
      "indent": 3,
      "text": "[RFC2328] includes three different types of authentication schemes: Null authentication, cleartext password (defined as \"simple password\" in [RFC2328]), and cryptographic authentication. Null authentication is semantically equivalent to no authentication.",
      "ja": "ヌル認証（[RFC2328]の「単純なパスワード」として定義される）平文パスワード、および暗号化認証：[RFC2328]は、認証方式の3種類を含みます。ヌル認証では、認証なしに意味的に等価です。"
    },
    {
      "indent": 3,
      "text": "In the cryptographic authentication scheme, the OSPFv2 routers on a common network/subnet are configured with a shared secret that is used to generate a Keyed-MD5 digest for each packet. A monotonically increasing sequence number scheme is used to protect against replay attacks.",
      "ja": "暗号認証方式では、共通のネットワーク/サブネット上のOSPFv2ルータは、パケット毎に鍵付き-MD5ダイジェストを生成するために使用される共有秘密を使用して構成されています。単調に増加するシーケンス番号方式は、リプレイ攻撃から保護するために使用されています。"
    },
    {
      "indent": 3,
      "text": "[RFC5709] adds support for the use of the SHA family of hash algorithms for authentication of OSPFv2 packets.",
      "ja": "[RFC5709]はOSPFv2のパケットの認証のためのハッシュアルゴリズムのSHAファミリを使用するためのサポートを追加します。"
    },
    {
      "indent": 0,
      "text": "3.1. Authentication Scheme Selection",
      "section_title": true,
      "ja": "3.1。認証スキームの選択"
    },
    {
      "indent": 3,
      "text": "For OSPF implementations to securely interoperate, they must have one or more authentication schemes in common.",
      "ja": "OSPFの実装はしっかりと相互運用するために、彼らは共通で1つ以上の認証スキームを持っている必要があります。"
    },
    {
      "indent": 3,
      "text": "While all implementations will have Null authentication since it's mandated by [RFC2328], its use is not appropriate in any context where the operator wishes to authenticate OSPFv2 packets in their network.",
      "ja": "それは[RFC2328]で義務付けられていますので、すべての実装がNull認証を持っていますが、その使用は、オペレータがそのネットワークでのOSPFv2パケットを認証することを希望する任意の文脈では適切ではありません。"
    },
    {
      "indent": 3,
      "text": "While all implementations will also support a cleartext password since it's mandated by [RFC2328], its use is only appropriate when the operator wants to preclude the accidental introduction of a router into the domain. This scheme is patently not useful when an operator wants to authenticate the OSPFv2 packets.",
      "ja": "それは[RFC2328]で義務付けられていますので、すべての実装にも平文パスワードをサポートしていますが、その使用は、オペレータがドメインにルータの偶然の導入を排除しようとする場合にのみ適切です。オペレータは、OSPFv2のパケットを認証したい場合は、この方式では、あきらかに有用ではありません。"
    },
    {
      "indent": 3,
      "text": "Cryptographic authentication is a mandatory scheme defined in [RFC2328], and all conformant implementations must support this.",
      "ja": "暗号認証は[RFC2328]で定義された必須の方式で、すべての準拠実装がこれをサポートしなければなりません。"
    },
    {
      "indent": 0,
      "text": "3.2. Authentication Algorithm Selection",
      "section_title": true,
      "ja": "3.2。認証アルゴリズムの選択"
    },
    {
      "indent": 3,
      "text": "For OSPFv2 implementations to securely interoperate, they must support one or more cryptographic authentication algorithms in common.",
      "ja": "OSPFv2の実装がしっかりと相互運用するために、彼らは共通で1つ以上の暗号認証アルゴリズムをサポートしている必要があります。"
    },
    {
      "indent": 3,
      "text": "The following are the available options for authentication algorithms:",
      "ja": "以下は、認証アルゴリズムで使用可能なオプションは次のとおりです。"
    },
    {
      "indent": 3,
      "text": "o [RFC2328] specifies the use of Keyed-MD5.",
      "ja": "O [RFC2328]は鍵付きMD5の使用を指定します。"
    },
    {
      "indent": 3,
      "text": "o [RFC5709] specifies the use of HMAC-SHA-1, HMAC-SHA-256, HMAC-SHA-384, and HMAC-SHA-512, and also mandates support for HMAC-SHA-256 (HMAC-SHA-1 is optional).",
      "ja": "O [RFC5709]はHMAC-SHA-1、HMAC-SHA-256、HMAC-SHA-384、およびHMAC-SHA-512の使用を指定し、また、HMAC-SHA-256のためのサポートを義務付け（HMAC-SHA-1でありますオプション）。"
    },
    {
      "indent": 3,
      "text": "As noted earlier, there is a desire to deprecate MD5. Some alternatives for MD5 are listed in [RFC5709].",
      "ja": "先に述べたように、MD5を廃止することが望まれています。 MD5のためのいくつかの選択肢は、[RFC5709]に記載されています。"
    },
    {
      "indent": 3,
      "text": "Possible digest algorithms include SHA-1, SHA-256, SHA-384, and SHA-512. Picking one mandatory-to-implement algorithm is imperative to ensuring interoperability.",
      "ja": "可能なダイジェストアルゴリズムはSHA-1、SHA-256、SHA-384およびSHA-512を含みます。 1実装に必須のアルゴリズムを選ぶことは、相互運用性を確保することが不可欠です。"
    },
    {
      "indent": 0,
      "text": "4. Open Shortest Path First Version 3 (OSPFv3)",
      "section_title": true,
      "ja": "4.オープン最短パスファーストバージョン3（OSPFv3の）"
    },
    {
      "indent": 3,
      "text": "OSPFv3 [RFC5340] relies on the IPv6 Authentication Header (AH) [RFC4302] and IPv6 Encapsulating Security Payload (ESP) [RFC4303] in order to provide integrity, authentication, and/or confidentiality.",
      "ja": "OSPFv3は[RFC5340]は整合性、認証、および/または機密性を提供するために、IPv6の認証ヘッダー（AH）[RFC4302]とIPv6カプセル化セキュリティペイロード（ESP）[RFC4303]に依存しています。"
    },
    {
      "indent": 3,
      "text": "[RFC4552] mandates the use of ESP for authenticating OSPFv3 packets. The implementations could also provide support for using AH to protect these packets.",
      "ja": "[RFC4552]はOSPFv3のパケットを認証するためのESPの使用を義務付け。実装はまた、これらのパケットを保護するためにAHを使用するためのサポートを提供することができます。"
    },
    {
      "indent": 3,
      "text": "The algorithm requirements for AH and ESP are described in [RFC4835] as follows:",
      "ja": "次のようにAHとESPのためのアルゴリズムの要件は[RFC4835]に記載されています。"
    },
    {
      "indent": 3,
      "text": "o [RFC2404] mandates HMAC-SHA-1-96.",
      "ja": "O [RFC2404]義務HMAC-SHA-1-96。"
    },
    {
      "indent": 3,
      "text": "o [RFC3566] indicates AES-XCBC-MAC-96 as a \"should\", but it's likely that this will be mandated at some future time.",
      "ja": "O [RFC3566]は、「べき」として、AES-XCBC-MAC-96を示し、それは、これは、いくつかの将来の時点で義務付けされる可能性があります。"
    },
    {
      "indent": 0,
      "text": "5. Routing Information Protocol Version 2 (RIPv2)",
      "section_title": true,
      "ja": "5.ルーティング情報プロトコルバージョン2（RIPv2の）"
    },
    {
      "indent": 3,
      "text": "RIPv2, originally specified in [RFC1388] and then in [RFC1723], has been updated and published as STD 56, [RFC2453]. If the Address Family Identifier of the first (and only the first) entry in the RIPv2 message is 0xFFFF, then the remainder of the entry contains the authentication information. The [RFC2453] version of the protocol provides for authenticating packets using a cleartext password (defined as \"simple password\" in [RFC2453]) not more than 16 octets in length.",
      "ja": "元々[RFC1388]で指定し、[RFC1723]に、更新されたとSTD 56、[RFC2453]として公開RIPv2の、。 RIPv2のメッセージ内の最初の（そして唯一の最初の）エントリのアドレスファミリ識別子が0xFFFFである場合、エントリの残りの部分は、認証情報を含みます。プロトコルの[RFC2453]バージョンは、（[RFC2453]の「単純なパスワード」として定義される）平文パスワード長さ以上16個のオクテットを使用してパケットを認証することを提供します。"
    },
    {
      "indent": 3,
      "text": "[RFC2082] added support for Keyed-MD5 authentication, where a digest is appended to the end of the RIP packet. [RFC4822] obsoleted [RFC2082] and added the SHA family of hash algorithms to the list of cryptographic authentications that can be used to protect RIPv2, whereas [RFC2082] previously specified only the use of Keyed-MD5.",
      "ja": "[RFC2082]はダイジェストがRIPパケットの末尾に付加されている鍵付き-MD5認証のサポートを追加しました。 [RFC4822]廃止[RFC2082]及び[RFC2082]は以前に鍵付き-MD5の使用のみを指定し、一方、RIPv2のを保護するために使用可能な暗号認証のリストにハッシュアルゴリズムのSHAファミリを加えました。"
    },
    {
      "indent": 0,
      "text": "5.1. Authentication Scheme Selection",
      "section_title": true,
      "ja": "5.1。認証スキームの選択"
    },
    {
      "indent": 3,
      "text": "For RIPv2 implementations to securely interoperate, they must support one or more authentication schemes in common.",
      "ja": "RIPv2の実装がしっかりと相互運用するために、彼らは共通で1つ以上の認証方式をサポートしている必要があります。"
    },
    {
      "indent": 3,
      "text": "While all implementations will support a cleartext password since it's mandated by [RFC2453], its use is only appropriate when the operator wants to preclude the accidental introduction of a router into the domain. This scheme is patently not useful when an operator wants to authenticate the RIPv2 packets.",
      "ja": "それは[RFC2453]で義務付けられていますので、すべての実装が平文パスワードをサポートしていますが、その使用は、オペレータがドメインにルータの偶然の導入を排除しようとする場合にのみ適切です。オペレータは、RIPv2のパケットを認証したい場合は、この方式では、あきらかに有用ではありません。"
    },
    {
      "indent": 3,
      "text": "[RFC2082] mandates the use of an authentication scheme that uses Keyed-MD5. However, [RFC2082] has been obsoleted by [RFC4822]. Compliant implementations must provide support for an authentication scheme that uses Keyed-MD5 but should recognize that this is superseded by cryptographic authentication as defined in [RFC4822].",
      "ja": "[RFC2082]はキー付き-MD5を使用する認証スキームを使用することを義務付け。ただし、[RFC2082]は[RFC4822]で廃止されました。対応する実装は、キー付き-MD5を使用するが、[RFC4822]で定義されるように、これは暗号認証に取って代わられることを認識すべき認証方式のためのサポートを提供しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Implementations should provide support for [RFC4822], as it specifies the RIPv2 cryptographic authentication schemes.",
      "ja": "それはRIPv2の暗号認証方式を指定するよう実装は、[RFC4822]のサポートを提供する必要があります。"
    },
    {
      "indent": 0,
      "text": "5.2. Authentication Algorithm Selection",
      "section_title": true,
      "ja": "5.2。認証アルゴリズムの選択"
    },
    {
      "indent": 3,
      "text": "For RIPv2 implementations to securely interoperate, they must support one or more authentication algorithms in common.",
      "ja": "RIPv2の実装がしっかりと相互運用するために、彼らは共通で1つ以上の認証アルゴリズムをサポートしている必要があります。"
    },
    {
      "indent": 3,
      "text": "The following are the available options for authentication algorithms:",
      "ja": "以下は、認証アルゴリズムで使用可能なオプションは次のとおりです。"
    },
    {
      "indent": 3,
      "text": "o [RFC2082] specifies the use of Keyed-MD5.",
      "ja": "O [RFC2082]は鍵付きMD5の使用を指定します。"
    },
    {
      "indent": 3,
      "text": "o [RFC4822] specifies the use of Keyed-MD5, HMAC-SHA-1, HMAC-SHA-256, HMAC-SHA-384, and HMAC-SHA-512.",
      "ja": "O [RFC4822]は鍵付き-MD5、HMAC-SHA-1、HMAC-SHA-256、HMAC-SHA-384、およびHMAC-SHA-512の使用を指定します。"
    },
    {
      "indent": 3,
      "text": "As noted earlier, there is a desire to deprecate MD5. Some alternatives for MD5 are listed in [RFC4822]. Possible digest algorithms include SHA-1, SHA-256, SHA-384, and SHA-512. Picking one mandatory-to-implement algorithm is imperative to ensuring interoperability.",
      "ja": "先に述べたように、MD5を廃止することが望まれています。 MD5のためのいくつかの選択肢は、[RFC4822]に記載されています。可能なダイジェストアルゴリズムはSHA-1、SHA-256、SHA-384およびSHA-512を含みます。 1実装に必須のアルゴリズムを選ぶことは、相互運用性を確保することが不可欠です。"
    },
    {
      "indent": 0,
      "text": "6. Routing Information Protocol for IPv6 (RIPng)",
      "section_title": true,
      "ja": "IPv6の6.ルーティング情報プロトコル（RIPngの）"
    },
    {
      "indent": 3,
      "text": "RIPng [RFC2080] relies on the IPv6 Authentication Header (AH) [RFC4302] and IPv6 Encapsulating Security Payload (ESP) [RFC4303] in order to provide integrity, authentication, and/or confidentiality.",
      "ja": "RIPngの[RFC2080]は整合性、認証、および/または機密性を提供するために、IPv6の認証ヘッダー（AH）[RFC4302]とIPv6カプセル化セキュリティペイロード（ESP）[RFC4303]に依存しています。"
    },
    {
      "indent": 3,
      "text": "The algorithm requirements for AH and ESP are described in [RFC4835] as follows:",
      "ja": "次のようにAHとESPのためのアルゴリズムの要件は[RFC4835]に記載されています。"
    },
    {
      "indent": 3,
      "text": "o [RFC2404] mandates HMAC-SHA-1-96.",
      "ja": "O [RFC2404]義務HMAC-SHA-1-96。"
    },
    {
      "indent": 3,
      "text": "o [RFC3566] indicates AES-XCBC-MAC-96 as a \"should\", but it's likely that this will be mandated at some future time.",
      "ja": "O [RFC3566]は、「べき」として、AES-XCBC-MAC-96を示し、それは、これは、いくつかの将来の時点で義務付けされる可能性があります。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "ja": "7.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "The cryptographic mechanisms referenced in this document provide only authentication algorithms. These algorithms do not provide confidentiality. Encrypting the content of the packet and thereby providing confidentiality is not considered in the definition of the routing protocols.",
      "ja": "このドキュメントで参照暗号化メカニズムは、認証アルゴリズムを提供しています。これらのアルゴリズムは、機密性を提供していません。パケットの内容を暗号化し、それにより機密性を提供するルーティングプロトコルの定義において考慮されていません。"
    },
    {
      "indent": 3,
      "text": "The cryptographic strength of the HMAC depends upon the cryptographic strength of the underlying hash function and on the size and quality of the key. The feasibility of attacking the integrity of routing protocol messages protected by keyed digests may be significantly more limited than that of other data; however, preference for one family of algorithms over another may also change independently of the perceived risk to a particular protocol.",
      "ja": "HMACの暗号の強さは、基礎となるハッシュ関数の暗号強度に、キーの大きさと品質に依存します。キー付き消化によって保護ルーティングプロトコルメッセージの完全性を攻撃する可能性は、他のデータよりも著しくより限定してもよいです。しかしながら、他の上のアルゴリズムの一つの家族のための好みは、特定のプロトコルに独立知覚リスクの変化してもよいです。"
    },
    {
      "indent": 3,
      "text": "To ensure greater security, the keys used should be changed periodically, and implementations must be able to store and use more than one key at the same time. Operational experience suggests that the lack of periodic rekeying is a source of significant exposure and that the lifespan of shared keys in the network is frequently measured in years.",
      "ja": "より高いセキュリティを確保するために、使用されるキーは定期的に変更する必要があり、実装は、同時に複数のキーを格納して使用することができなければなりません。運用経験は、定期的な再入力の欠如が重要な曝露源であることを、ネットワーク内の共有鍵の寿命が頻繁年に測定されることを示唆しています。"
    },
    {
      "indent": 3,
      "text": "While simple password schemes are well represented in the document series and in conformant implementations of the protocols, the inability to offer either integrity or identity protection are sufficient reason to strongly discourage their use.",
      "ja": "単純なパスワードスキームはよく文書の直列およびプロトコルの準拠実装で表現されますが、整合性やアイデンティティ保護のいずれかを提供できないことが強く、その使用を阻止するのに十分な理由です。"
    },
    {
      "indent": 3,
      "text": "This document concerns itself with the selection of cryptographic algorithms for use in the authentication of routing protocol packets being exchanged between adjacent routing processes. The cryptographic algorithms identified in this document are not known to be broken at the current time, and ongoing cryptographic research so far leads us to believe that they will likely remain secure in the foreseeable future. We expect that new revisions of this document will be issued in the future to reflect current thinking on the algorithms that various routing protocols should employ to ensure interoperability between disparate implementations.",
      "ja": "ルーティングプロトコルパケットの認証に使用するための暗号化アルゴリズムの選択と、この文書の問題自体は、隣接ルーティングプロセス間で交換されます。この文書で特定された暗号アルゴリズムは、現在の時点で破断することが知られており、継続的な暗号研究はこれまでのところ、彼らはおそらく近い将来における安全なままであることを信じるように私たちをリードされていません。私たちは、この文書の新しいリビジョンがさまざまなルーティングプロトコルは、異なる実装間の相互運用性を確保するために採用すべきアルゴリズムの現在の考え方を反映するために将来的に発行されることを期待しています。"
    },
    {
      "indent": 0,
      "text": "8. Acknowledgements",
      "section_title": true,
      "ja": "8.謝辞"
    },
    {
      "indent": 3,
      "text": "We would like to thank Joel Jaeggli, Sean Turner, and Adrian Farrel for their comments and feedback on this document, which resulted in significant improvement of the same.",
      "ja": "私たちは、同じの大幅な改善をもたらした、このドキュメントの彼らのコメントやフィードバックのためにジョエルJaeggli、ショーン・ターナー、およびエードリアンファレルに感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "ja": "9.参考文献"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "ja": "9.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[ISO] \"Intermediate system to Intermediate system routing information exchange protocol for use in conjunction with the protocol for providing the connectionless-mode network service\", ISO/IEC 10589:1992 (ISO 8473).",
      "ja": "[ISO]「コネクションレスモードのネットワークサービスを提供するためのプロトコルと一緒に使用するための情報交換プロトコルをルーティング中間システムへの中間システム」、ISO / IEC 10589：1992（ISO 8473）。"
    },
    {
      "indent": 3,
      "text": "[RFC1195] Callon, R., \"Use of OSI IS-IS for routing in TCP/IP and dual environments\", RFC 1195, December 1990.",
      "ja": "[RFC1195] Callon、R.は、RFC 1195、1990年12月 \"OSIの使用は、TCP / IPやデュアル環境でのルーティングのためIS-IS\"。"
    },
    {
      "indent": 3,
      "text": "[RFC2080] Malkin, G. and R. Minnear, \"RIPng for IPv6\", RFC 2080, January 1997.",
      "ja": "[RFC2080]マルキン、G.およびR. Minnear、 \"IPv6のためのRIPng\"、RFC 2080、1997年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC2328] Moy, J., \"OSPF Version 2\", STD 54, RFC 2328, April 1998.",
      "ja": "[RFC2328]モイ、J.、 \"OSPFバージョン2\"、STD 54、RFC 2328、1998年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2453] Malkin, G., \"RIP Version 2\", STD 56, RFC 2453, November 1998.",
      "ja": "[RFC2453]マルキン、G.、 \"RIPバージョン2\"、STD 56、RFC 2453、1998年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC4822] Atkinson, R. and M. Fanto, \"RIPv2 Cryptographic Authentication\", RFC 4822, February 2007.",
      "ja": "[RFC4822]アトキンソン、R.とM. Fanto、 \"RIPv2の暗号化認証\"、RFC 4822、2007年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC4835] Manral, V., \"Cryptographic Algorithm Implementation Requirements for Encapsulating Security Payload (ESP) and Authentication Header (AH)\", RFC 4835, April 2007.",
      "ja": "[RFC4835] Manral、V.、RFC 4835、2007年4月 \"カプセル化セキュリティペイロード（ESP）と認証ヘッダー（AH）のための暗号アルゴリズム実装要件\"。"
    },
    {
      "indent": 3,
      "text": "[RFC5304] Li, T. and R. Atkinson, \"IS-IS Cryptographic Authentication\", RFC 5304, October 2008.",
      "ja": "[RFC5304]李、T.、およびR.アトキンソンは、 \"IS-IS暗号認証\"、RFC 5304、2008年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC5310] Bhatia, M., Manral, V., Li, T., Atkinson, R., White, R., and M. Fanto, \"IS-IS Generic Cryptographic Authentication\", RFC 5310, February 2009.",
      "ja": "[RFC5310]はバティア、M.、Manral、V.は、李、T.、アトキンソン、R.、ホワイト、R.、およびM. Fantoは、 \"IS-ISジェネリック暗号認証\"、RFC 5310、2009年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC5340] Coltun, R., Ferguson, D., Moy, J., and A. Lindem, \"OSPF for IPv6\", RFC 5340, July 2008.",
      "ja": "[RFC5340] Coltun、R.、ファーガソン、D.、モイ、J.、およびA. Lindem、 \"IPv6のためのOSPF\"、RFC 5340、2008年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC5709] Bhatia, M., Manral, V., Fanto, M., White, R., Barnes, M., Li, T., and R. Atkinson, \"OSPFv2 HMAC-SHA Cryptographic Authentication\", RFC 5709, October 2009.",
      "ja": "[RFC5709] Bhatiaは、M.、Manral、V.、Fanto、M.、ホワイト、R.、バーンズ、M.、李、T.、およびR.アトキンソン、 \"OSPFv2のHMAC-SHA暗号化認証\"、RFC 5709、 2009年10月。"
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "ja": "9.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC1321] Rivest, R., \"The MD5 Message-Digest Algorithm\", RFC 1321, April 1992.",
      "ja": "[RFC1321]のRivest、R.、 \"MD5メッセージダイジェストアルゴリズム\"、RFC 1321、1992年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC1388] Malkin, G., \"RIP Version 2 Carrying Additional Information\", RFC 1388, January 1993.",
      "ja": "[RFC1388]マルキン、G.、 \"追加情報キャリングRIPバージョン2\"、RFC 1388、1993年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC1723] Malkin, G., \"RIP Version 2 - Carrying Additional Information\", RFC 1723, November 1994.",
      "ja": "[RFC1723]マルキン、G.、 \"RIPバージョン2  - キャリング追加情報\"、RFC 1723、1994年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC2082] Baker, F. and R. Atkinson, \"RIP-2 MD5 Authentication\", RFC 2082, January 1997.",
      "ja": "[RFC2082]ベーカー、F.とR.アトキンソン、 \"RIP-2 MD5認証\"、RFC 2082、1997年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC2404] Madson, C. and R. Glenn, \"The Use of HMAC-SHA-1-96 within ESP and AH\", RFC 2404, November 1998.",
      "ja": "[RFC2404] Madson、C.とR.グレン、 \"ESPおよびAH内のHMAC-SHA-1-96の使用\"、RFC 2404、1998年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC3566] Frankel, S. and H. Herbert, \"The AES-XCBC-MAC-96 Algorithm and Its Use With IPsec\", RFC 3566, September 2003.",
      "ja": "[RFC3566]フランケル、S.およびH.ハーバート、 \"AES-XCBC-MAC-96アルゴリズムとIPsecでの使用\"、RFC 3566、2003年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC4270] Hoffman, P. and B. Schneier, \"Attacks on Cryptographic Hashes in Internet Protocols\", RFC 4270, November 2005.",
      "ja": "[RFC4270]ホフマン、P.とB.シュナイアー、 \"インターネットプロトコルで暗号化ハッシュに対する攻撃\"、RFC 4270、2005年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC4302] Kent, S., \"IP Authentication Header\", RFC 4302, December 2005.",
      "ja": "[RFC4302]ケント、S.、 \"IP認証ヘッダー\"、RFC 4302、2005年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC4303] Kent, S., \"IP Encapsulating Security Payload (ESP)\", RFC 4303, December 2005.",
      "ja": "[RFC4303]ケント、S.、 \"IPカプセル化セキュリティペイロード（ESP）\"、RFC 4303、2005年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC4552] Gupta, M. and N. Melam, \"Authentication/Confidentiality for OSPFv3\", RFC 4552, June 2006.",
      "ja": "[RFC4552]グプタ、M.およびN.メラム、 \"OSPFv3のための認証/機密性\"、RFC 4552、2006年6月。"
    },
    {
      "indent": 3,
      "text": "[SHS] \"Secure Hash Standard (SHS)\", National Institute of Standards and Technology (NIST) FIPS Publication 180-3, October 2008.",
      "ja": "[SHS] \"セキュアハッシュ規格（SHS）\"、米国国立標準技術研究所（NIST）が発行180-3、2008年10月FIPS。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Manav Bhatia Alcatel-Lucent Bangalore India",
      "ja": "Manavバティアアルカテル・ルーセントバンガロールインド"
    },
    {
      "indent": 3,
      "text": "EMail: manav.bhatia@alcatel-lucent.com",
      "ja": "メールアドレス：manav.bhatia@alcatel-lucent.com"
    },
    {
      "indent": 3,
      "text": "Vishwas Manral IP Infusion 1188 E. Arques Ave. Sunnyvale, CA 94089 USA",
      "ja": "信仰Mnrlしかし1188 MEをInfosion。アルクアヴェ..サニーベール、94089それ"
    },
    {
      "indent": 3,
      "text": "Phone: 408-400-1900 EMail: vishwas@ipinfusion.com",
      "ja": "電話：408-400-1900 Eメール：vishwas@ipinfusion.com"
    }
  ]
}