{
  "title": {
    "text": "RFC 4109 - Algorithms for Internet Key Exchange version 1 (IKEv1)",
    "ja": "RFC 4109 - インターネット鍵交換バージョン1のアルゴリズム（IKEv1の）"
  },
  "number": 4109,
  "created_at": "2019-10-19 22:00:21.441839+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                         P. Hoffman\nRequest for Comments: 4109                                VPN Consortium\nUpdates: 2409                                                   May 2005\nCategory: Standards Track",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 9,
      "text": "Algorithms for Internet Key Exchange version 1 (IKEv1)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "ja": "著作権（C）インターネット協会（2005）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "The required and suggested algorithms in the original Internet Key Exchange version 1 (IKEv1) specification do not reflect the current reality of the IPsec market requirements. The original specification allows weak security and suggests algorithms that are thinly implemented. This document updates RFC 2409, the original specification, and is intended for all IKEv1 implementations deployed today.",
      "ja": "オリジナルのインターネット鍵交換バージョン1（のIKEv1）仕様で必要と提案したアルゴリズムは、IPsec市場の要求の現在の現実を反映していません。元の仕様は、弱いセキュリティを可能にし、薄く実装されるアルゴリズムを提案しています。このドキュメントの更新RFC 2409、元の仕様、今日デプロイされたすべてのIKEv1実装を対象としています。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "The original IKEv1 definition, [RFC2409], has a set of MUST-level and SHOULD-level requirements that do not match the needs of IPsec users. This document updates RFC 2409 by changing the algorithm requirements defined there.",
      "ja": "オリジナルのIKEv1の定義、[RFC2409]は、IPsecのユーザーのニーズに合致していないMUSTレベルおよびSHOULDレベルの要件のセットがあります。この文書では、そこに定義されたアルゴリズムの要件を変更することにより、RFC 2409を更新します。"
    },
    {
      "indent": 3,
      "text": "The keywords MUST, MUST NOT, REQUIRED, SHALL, SHALL NOT, SHOULD, SHOULD NOT, RECOMMENDED, MAY, and OPTIONAL, when they appear in this document, are to be interpreted as described in [RFC2119].",
      "ja": "彼らは、この文書に表示される[RFC2119]で説明したように解釈される際のキーワードは、REQUIREDは、、、、、MAY、推奨、およびオプションのすべきでないないものとものとしてはなりませんしなければなりません。"
    },
    {
      "indent": 0,
      "text": "2. Old Algorithm Requirements",
      "section_title": true,
      "ja": "2.旧アルゴリズムの要件"
    },
    {
      "indent": 3,
      "text": "RFC 2409 has the following MUST-level and SHOULD-level requirements:",
      "ja": "RFC 2409には、以下のMUSTレベルおよびSHOULDレベルの要件があります。"
    },
    {
      "indent": 3,
      "text": "o DES for encryption MUST be supported. o MD5 and SHA-1 for hashing and HMAC functions MUST be supported. o Pre-shared secrets for authentication MUST be supported. o Diffie-Hellman MODP group 1 (discrete log 768 bits) MUST be supported. o TripleDES for encryption SHOULD be supported. o Tiger for hashing SHOULD be supported. o DSA and RSA for authentication with signatures SHOULD be supported. o RSA for authentication with encryption SHOULD be supported. o Diffie-Hellman MODP group 2 (discrete log 1024 bits) SHOULD be supported.",
      "ja": "O暗号化のためのDESをサポートしなければなりません。 O MD5とSHA-1ハッシュ及びHMAC関数のをサポートしなければなりません。 O認証に事前共有秘密をサポートしなければなりません。 Oディフィー・ヘルマンMODPグループ1（離散対数768ビット）をサポートしなければなりません。 O暗号化のトリプルDESがサポートされる必要があります。 Oハッシュのためのタイガーは、サポートされる必要があります。 O署名による認証のためのDSAおよびRSAがサポートされるべきです。 Oの暗号化と認証のためのRSAは、サポートされる必要があります。 Oディフィー・ヘルマンMODPグループ2（離散対数1024ビット）がサポートされる必要があります。"
    },
    {
      "indent": 3,
      "text": "RFC 2409 gives two conflicting requirement levels for Diffie-Hellman MODP groups with elliptic curves. Section 4 of that specification says that \"IKE implementations ... MAY support ECP and EC2N groups\", but Sections 6.3 and 6.4 say that MODP groups 3 and 4 for EC2N groups SHOULD be supported.",
      "ja": "RFC 2409は、楕円曲線とのディフィー - ヘルマンMODPグループのための2つの相反する要求レベルを与えます。その仕様の第4章では、「IKE実装は... ECPとEC2Nグループをサポートするかもしれ」と言っていますが、セクション6.3と6.4はEC2NグループのためのMODPグループ3と4がサポートされるべきであると言います。"
    },
    {
      "indent": 0,
      "text": "3. New Algorithm Requirements",
      "section_title": true,
      "ja": "3.新しいアルゴリズムの要件"
    },
    {
      "indent": 3,
      "text": "The new requirements for IKEv1 are listed here. Note that some of the requirements are the same as those in RFC 2409, whereas others are changed.",
      "ja": "IKEv1のための新たな要件はここに記載されています。他の人が変更されたのに対し、要件のいくつかは、RFC 2409と同じであることに留意されたいです。"
    },
    {
      "indent": 3,
      "text": "o TripleDES for encryption MUST be supported. o AES-128 in CBC mode [RFC3602] for encryption SHOULD be supported. o SHA-1 for hashing and HMAC functions MUST be supported. o Pre-shared secrets for authentication MUST be supported. o AES-128 in XCBC mode for PRF functions ([RFC3566] and [RFC3664]) SHOULD be supported. o Diffie-Hellman MODP group 2 (discrete log 1024 bits) MUST be supported.",
      "ja": "O暗号化のトリプルDESをサポートしなければなりません。暗号化のために[RFC3602]はサポートされてくださいCBCモードのAES-128、O。 O SHA-1ハッシュ及びHMAC関数のをサポートしなければなりません。 O認証に事前共有秘密をサポートしなければなりません。 O PRF関数のXCBCモード（[RFC3566]及び[RFC3664]）でAES-128がサポートされてください。 Oディフィー・ヘルマンMODPグループ2（離散対数1024ビット）をサポートしなければなりません。"
    },
    {
      "indent": 3,
      "text": "o Diffie-Hellman MODP group 14 (discrete log 2048 bits) [RFC3526] SHOULD be supported. o RSA for authentication with signatures SHOULD be supported.",
      "ja": "Oディフィー・ヘルマンMODP群14（離散対数2048ビット）[RFC3526]はサポートされる必要があります。 O署名による認証のためのRSAは、サポートされる必要があります。"
    },
    {
      "indent": 3,
      "text": "If additional updates are made to IKEv1 in the future, then it is very likely that implementation of AES-128 in CBC mode for encryption will become mandatory.",
      "ja": "追加の更新が将来のIKEv1に行われた場合、暗号化のためのCBCモードのAES-128の実装が必須になる可能性が非常に高いです。"
    },
    {
      "indent": 3,
      "text": "The other algorithms that were listed at MUST-level and SHOULD-level in RFC 2409 are now MAY-level. This includes DES for encryption, MD5 and Tiger for hashing, Diffie-Hellman MODP group 1, Diffie-Hellman MODP groups with elliptic curves, DSA for authentication with signatures, and RSA for authentication with encryption.",
      "ja": "RFC 2409でMUSTレベルおよびSHOULDレベルで列挙された他のアルゴリズム月レベルになりました。これは、暗号化と認証のための暗号化、MD5およびタイガーハッシングのため、署名と認証のためのDiffie-HellmanのMODPグループ1、楕円曲線とのディフィー - ヘルマンMODP基、DSA及びRSAのためのDESを含みます。"
    },
    {
      "indent": 3,
      "text": "DES for encryption, MD5 for hashing, and Diffie-Hellman MODP group 1 are dropped to MAY due to cryptographic weakness.",
      "ja": "暗号化のためのDES、ハッシュのためのMD5、およびDiffie-HellmanのMODPグループ1が原因暗号弱点にMAYに低下しています。"
    },
    {
      "indent": 3,
      "text": "Tiger for hashing, Diffie-Hellman MODP groups with elliptic curves, DSA for authentication with signatures, and RSA for authentication with encryption are dropped due to lack of any significant deployment and interoperability.",
      "ja": "ハッシュのためのタイガーは、楕円を使用したDiffie-Hellman MODPグループは、DSAは、暗号化と認証のための署名と認証、およびRSAのために起因する大規模に展開し、相互運用性の欠如にドロップされます。"
    },
    {
      "indent": 0,
      "text": "4. Summary",
      "section_title": true,
      "ja": "4.まとめ"
    },
    {
      "indent": 6,
      "text": "Algorithm                     RFC 2409    This document\n------------------------------------------------------------------\nDES for encryption            MUST        MAY (crypto weakness)\nTripleDES for encryption      SHOULD      MUST\nAES-128 for encryption        N/A         SHOULD\nMD5 for hashing and HMAC      MUST        MAY (crypto weakness)\nSHA1 for hashing and HMAC     MUST        MUST\nTiger for hashing             SHOULD      MAY (lack of deployment)\nAES-XCBC-MAC-96 for PRF       N/A         SHOULD\nPre-shared secrets            MUST        MUST\nRSA with signatures           SHOULD      SHOULD\nDSA with signatures           SHOULD      MAY (lack of deployment)\nRSA with encryption           SHOULD      MAY (lack of deployment)\nD-H Group 1 (768)             MUST        MAY (crypto weakness)\nD-H Group 2 (1024)            SHOULD      MUST\nD-H Group 14 (2048)           N/A         SHOULD\nD-H elliptic curves           SHOULD      MAY (lack of deployment)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "This document is all about security. All the algorithms that are either MUST-level or SHOULD-level in the \"new algorithm requirements\" section of this document are believed to be robust and secure at the time of this writing.",
      "ja": "この文書では、すべてのセキュリティについてです。レベルないと、この文書の「新しいアルゴリズムの要件」セクションにあるべきであるレベルのいずれかであるすべてのアルゴリズムは、この記事の執筆時点で、堅牢かつ安全であると考えられています。"
    },
    {
      "indent": 0,
      "text": "6. Normative References",
      "section_title": true,
      "ja": "6.引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2409] Harkins, D. and D. Carrel, \"The Internet Key Exchange (IKE)\", RFC 2409, November 1998.",
      "ja": "[RFC2409]ハーキンとD.とD.カレル、 \"インターネットキー交換（IKE）\"、RFC 2409、1998年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC3526] Kivinen, T. and M. Kojo, \"More Modular Exponential (MODP) Diffie-Hellman groups for Internet Key Exchange (IKE)\", RFC 3526, May 2003.",
      "ja": "[RFC3526] Kivinen、T.およびM.古城、 \"インターネット鍵交換のためのより多くのモジュラー指数（MODP）のDiffie-Hellmanグループ（IKE）\"、RFC 3526、2003年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC3566] Frankel, S. and H. Herbert, \"The AES-XCBC-MAC-96 Algorithm and Its Use With IPsec\", RFC 3566, September 2003.",
      "ja": "[RFC3566]フランケル、S.およびH.ハーバート、 \"AES-XCBC-MAC-96アルゴリズムとIPsecでの使用\"、RFC 3566、2003年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC3602] Frankel, S., Glenn, R., and S. Kelly, \"The AES-CBC Cipher Algorithm and Its Use with IPsec\", RFC 3602, September 2003.",
      "ja": "[RFC3602]フランケル、S.、グレン、R.、およびS.ケリー、 \"AES-CBC暗号アルゴリズムおよびIPSecでの使用\"、RFC 3602、2003年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC3664] Hoffman, P., \"The AES-XCBC-PRF-128 Algorithm for the Internet Key Exchange Protocol (IKE)\", RFC 3664, January 2004.",
      "ja": "[RFC3664]ホフマン、P.、 \"インターネット鍵交換プロトコルのためのAES-XCBC-PRF-128アルゴリズム（IKE）\"、RFC 3664、2004年1月。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Paul Hoffman VPN Consortium 127 Segre Place Santa Cruz, CA 95060 US",
      "ja": "ポール・ホフマンVPNコンソーシアム127セグレ場所サンタクルス、CA 95060米国"
    },
    {
      "indent": 3,
      "text": "EMail: paul.hoffman@vpnc.org",
      "ja": "メールアドレス：paul.hoffman@vpnc.org"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "ja": "著作権（C）インターネット協会（2005）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "この文書では、BCP 78に含まれる権利と許可と制限の適用を受けており、その中の記載を除いて、作者は彼らのすべての権利を保有します。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とCONTRIBUTOR「そのまま」、ORGANIZATION HE / SHEが表すまたはインターネットソサエティおよびインターネット・エンジニアリング・タスク・フォース放棄すべての保証、明示または、（もしあれば）後援ISに設けられています。黙示、情報の利用は、特定の目的に対する権利または商品性または適合性の黙示の保証を侵害しない任意の保証含むがこれらに限定されません。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、本書またはそのような権限下で、ライセンスがたりないかもしれない程度に記載された技術の実装や使用に関係すると主張される可能性があります任意の知的財産権やその他の権利の有効性または範囲に関していかなる位置を取りません利用可能です。またそれは、それがどのような権利を確認する独自の取り組みを行ったことを示すものでもありません。 RFC文書の権利に関する手続きの情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IPRの開示のコピーが利用できるようにIETF事務局とライセンスの保証に行われた、または本仕様の実装者または利用者がそのような所有権の使用のための一般的なライセンスまたは許可を取得するために作られた試みの結果を得ることができますhttp://www.ietf.org/iprのIETFのオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、その注意にこの標準を実装するために必要とされる技術をカバーすることができる任意の著作権、特許または特許出願、またはその他の所有権を持ってすべての利害関係者を招待します。 ietf-ipr@ietf.orgのIETFに情報を記述してください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "了承"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}