{
  "title": {
    "text": "RFC 3113 - 3GPP-IETF Standardization Collaboration",
    "ja": "RFC 3113 - 3GPP-IETF標準化コラボレーション"
  },
  "number": 3113,
  "created_at": "2019-10-23 21:13:26.369603+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                      K. Rosenbrock\nRequest for Comments: 3113                                3GPP PCG Chair\nCategory: Informational                                      R. Sanmugam\n                                                                Ericsson\n                                                              S. Bradner\n                                                      Harvard University\n                                                              J. Klensin\n                                                                    AT&T\n                                                               June 2001",
      "raw": true
    },
    {
      "indent": 16,
      "text": "3GPP-IETF Standardization Collaboration",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモはインターネットコミュニティのための情報を提供します。それはどんな種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2001). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2001）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document describes the standardization collaboration between 3GPP and IETF.",
      "ja": "このドキュメントは、3GPPとIETFの間の標準化の共同作業について説明します。"
    },
    {
      "indent": 0,
      "text": "1. Conventions used in this document",
      "section_title": true,
      "ja": "この文書で使用されている1.表記"
    },
    {
      "indent": 3,
      "text": "This document uses significant terminology that is specialized to IETF, 3GPP, or their areas of work. See Appendix A for definitions of acronyms. The organizational definitions can be found in their respective web-sites.",
      "ja": "この文書は、IETF、3GPP、または仕事の彼らの領域に特化した重要な用語を使用しています。頭字語の定義については、付録Aを参照してください。組織の定義は、それぞれのウェブサイトで見つけることができます。"
    },
    {
      "indent": 0,
      "text": "2. Introduction",
      "section_title": true,
      "ja": "2.はじめに"
    },
    {
      "indent": 3,
      "text": "This document contains a set of principles and guidelines that serves as the basis for establishing the collaboration between 3GPP and IETF, with the objective of securing timely development of technical specification that facilitate maximum interoperability with existing (fixed and mobile) Internet systems, devices, and protocols.",
      "ja": "この文書では、既存の（固定およびモバイル）、インターネットシステム、デバイスとの最大の相互運用性を容易にする技術仕様のタイムリーな開発を確保する目的で、3GPPおよびIETFの間の連携を確立するための基礎となる原則とガイドラインのセットが含まれ、そしてプロトコル。"
    },
    {
      "indent": 3,
      "text": "Each organization will operate according to their own rules and procedures including rules governing IPR policy, specification elaboration, approval and maintenance.",
      "ja": "各組織は、IPRポリシー、仕様策定、承認および保守を管理する規則を含む独自のルールや手順に従って動作します。"
    },
    {
      "indent": 0,
      "text": "3. Reasons For Collaboration",
      "section_title": true,
      "ja": "コラボレーションのための3つの理由"
    },
    {
      "indent": 0,
      "text": "3.1 3GPP use of IETF Internet Standards",
      "section_title": true,
      "ja": "IETFインターネット標準の3.1 3GPPの使用"
    },
    {
      "indent": 3,
      "text": "In the further development of 3GPP specifications, the benefit of adopting Internet specifications has been identified.",
      "ja": "3GPP仕様のさらなる発展では、インターネットの仕様を採用することの利点は、同定されています。"
    },
    {
      "indent": 3,
      "text": "The preferred 3GPP approach is to use the Internet standards unchanged, if feasible. In any case, 3GPP has no intention to duplicate work performed in IETF.",
      "ja": "好適3GPPのアプローチが可能な場合には、そのままインターネット標準を使用することです。いずれにせよ、3GPPは、IETFで行われた作業を複製する意思がありません。"
    },
    {
      "indent": 3,
      "text": "However, while this document recognizes the importance of 3GPP interoperability with the existing Internet and hence the use of IETF standards, 3GPP recognizes that additions or modifications might be needed in order to make the IETF internet specification fulfill the needs of 3GPP. In such cases, 3GPP will take its concerns directly to the appropriate IETF working groups for resolution, or to an appropriate Area Director if no appropriate working group can be found.",
      "ja": "この文書は、既存のインターネットので、IETF標準の使用で、3GPPの相互運用性の重要性を認識しながら、しかし、3GPPは、追加や変更は、IETFインターネット仕様は、3GPPのニーズを満たすようにするために必要となる可能性があることを認識しています。何の適切なワーキンググループが見つからない場合は、このようなケースでは、3GPPは、解決のために、または適切なエリアディレクターに適切なIETFワーキンググループに直接その懸念がかかります。"
    },
    {
      "indent": 0,
      "text": "3.2 IETF access to 3GPP Wireless expertise",
      "section_title": true,
      "ja": "3GPPワイヤレスの専門知識へのアクセス3.2 IETF"
    },
    {
      "indent": 3,
      "text": "The technical work in 3GPP is organized in Technical Specification Groups TSGs each with their area of responsibilities. TSG-RAN and TSG-GERAN are responsible for the Radio Access networks based on UTRAN and GERAN and thus the experts in the areas of the characteristics of the physical transport. TSG CN is responsible for the Mobility Management and other core network protocol and functionalities. TSG-T is responsible for Terminal aspects and applications. TSG-SA is responsible for the service and system aspects including the overall architecture, security and O&M aspects. Contacts for the TSGs can be found on the 3GPP web-site http://www.3gpp.org/.",
      "ja": "3GPPにおける技術的な仕事は、責任の彼らの面積と各技術仕様グループのTSGに編成されています。 TSG-RAN及びTSG-GERANは、UTRANおよびGERANに基づいて、無線アクセスネットワークと物理的輸送の特性の領域におけるこのよう専門家の責任です。 TSG CNは、移動性管理およびその他のコア・ネットワーク・プロトコルと機能を担当しています。 TSG-Tは、ターミナルの側面およびアプリケーションの責任です。 TSG-SAは、全体的なアーキテクチャ、セキュリティ、およびO＆M側面を含めたサービスやシステムの側面を担当しています。 TSGのための連絡先は、3GPPのウェブサイトのhttp://www.3gpp.org/で見つけることができます。"
    },
    {
      "indent": 0,
      "text": "4. Document Sharing",
      "section_title": true,
      "ja": "4.ドキュメントの共有"
    },
    {
      "indent": 3,
      "text": "Both 3GPP and IETF encourage the sharing of draft documents that are of mutual interest.",
      "ja": "3GPPとIETFの両方が相互に関心のあるドラフト文書の共有を奨励します。"
    },
    {
      "indent": 3,
      "text": "3GPP documents are available on its official web-site (http://www.3gpp.org/) and is open to anyone. IETF documents, including preliminary working documents (\"Internet Drafts\") are available on its web-site (http://www.ietf.org/) and various shadow sites.",
      "ja": "3GPP文書は、公式ウェブサイト（http://www.3gpp.org/）で利用可能であり、誰にでも開かれています。予備的な作業文書（「インターネットドラフト」）を含むIETF文書は、そのウェブサイト（http://www.ietf.org/）と、様々な影のサイトでご利用いただけます。"
    },
    {
      "indent": 3,
      "text": "IETF representatives can obtain information about the 3GPP document and web-site structures by contacting the relevant 3GPP contact points indicated at the 3GPP web-site http://www.3gpp.org/.",
      "ja": "IETF代表は、3GPPのウェブサイトhttp://www.3gpp.org/で示さ関連する3GPPの接点を接触させることにより、3GPPのドキュメントやWebサイトの構造に関する情報を得ることができます。"
    },
    {
      "indent": 3,
      "text": "3GPP representatives can obtain information about the IETF document and web-site structures by contacting the relevant IETF contact points (the Area Directors indicated at the IETF web-site http://www.ietf.org/).",
      "ja": "3GPPの代表は、関連するIETFの接触点（IETFウェブサイトhttp://www.ietf.org/で示さAreaディレクター）を接触させることによって、IETF文書、ウェブサイトの構造に関する情報を得ることができます。"
    },
    {
      "indent": 0,
      "text": "5. Communication",
      "section_title": true,
      "ja": "5.コミュニケーション"
    },
    {
      "indent": 3,
      "text": "Whenever possible, informal communication at working level is encouraged.",
      "ja": "可能な限り、実務レベルでの非公式なコミュニケーションを奨励しています。"
    },
    {
      "indent": 3,
      "text": "The vast majority of the technical discussions and decision making in both IETF and 3GPP is done over mailing lists. Both 3GPP and IETF web sites contain information concerning the associated mailing lists.",
      "ja": "IETFおよび3GPPの両方で技術的な議論と意思決定の大半は、メーリングリスト上で行われます。 3GPPおよびIETFのWebサイトの両方が関連するメーリングリストに関する情報が含まれています。"
    },
    {
      "indent": 3,
      "text": "It is recommended that interested individuals subscribe to and participate in these lists.",
      "ja": "関心のある個人が購読し、これらのリストに参加することをお勧めします。"
    },
    {
      "indent": 3,
      "text": "When deemed necessary, formal communication between 3GPP and IETF is also permitted. Relevant IETF Area Directors and 3GPP technical leadership are encouraged and authorized to facilitate such communications when needed.",
      "ja": "必要と思われるときに、3GPP及びIETFの間の正式な通信も許可されています。関連IETFエリアの取締役および3GPP技術リーダーシップを奨励し、必要なときに、このような通信を容易にするために許可されています。"
    },
    {
      "indent": 0,
      "text": "6. Rapporteurs/coordinators",
      "section_title": true,
      "ja": "6.報告者/コーディネーター"
    },
    {
      "indent": 0,
      "text": "6.1 IETF coordination support in 3GPP",
      "section_title": true,
      "ja": "3GPPで6.1 IETFの連携をサポート"
    },
    {
      "indent": 3,
      "text": "An IETF rapporteur function is established in 3GPP TSG-SA.",
      "ja": "IETF報告者機能は、3GPP TSG-SAで確立されています。"
    },
    {
      "indent": 3,
      "text": "The individual(s) appointed to undertake the responsibility of this function should be the initial contact point in 3GPP for matters pertaining to the 3GPP-IETF cooperation. Of course, the chairman of TSG-SA can always be contacted.",
      "ja": "この機能の責任を引き受けるために任命され、個々の（単数または複数）は、3GPP-IETFの協力に関する事項について、3GPPにおける最初の接触点でなければなりません。もちろん、TSG-SAの会長を常に接触させることができます。"
    },
    {
      "indent": 3,
      "text": "The 3GPP-IETF rapporteur function, therefore, is expected to work with the concerned working groups and TSGs and support the interaction between 3GPP and IETF.",
      "ja": "3GPP-IETF報告者機能、従って、当該ワーキンググループとのTSGで動作し、3GPPおよびIETFの間の相互作用をサポートすることが期待されます。"
    },
    {
      "indent": 0,
      "text": "6.2 3GPP Liaison in IETF",
      "section_title": true,
      "ja": "IETFで6.2 3GPPリエゾン"
    },
    {
      "indent": 3,
      "text": "The preferred way for organizations to work with IETF is through the working groups. However, IETF has a limited number of liaison relationships with other organizations when conditions warrant the appointment of a specific person.",
      "ja": "組織がIETFで作業するための好ましい方法は、ワーキンググループを介して行われます。条件は、特定の人物の任命を保証ただし、IETFは、他の組織とのリエゾン関係の数が限られています。"
    },
    {
      "indent": 3,
      "text": "The appointment, by the IAB, of a specific person to function as a \"3GPP liaison\" is proposed.",
      "ja": "「3GPPのリエゾン」として機能させるには、特定の人物が提案されているのIABによって任命、、。"
    },
    {
      "indent": 3,
      "text": "The role of the 3GPP Liaison is to act as an initial contact point in IETF for administrative aspects of this collaboration that cannot easily be handled in other ways (e.g., at a technical level by interactions with IETF Working Groups or Area Directors). It is agreed that the role does not carry the expectation of attendance at 3GPP meetings or participation in 3GPP administrative processes and anticipated that all liaison efforts assigned to this individual will be carried out by electronic mail. It is understood that the liaison will not have the ability to make exceptions to, or special provisions for, IETF policies and procedures.",
      "ja": "3GPPリエゾンの役割が容易（IETFワーキンググループ又はエリアディレクターとの相互作用により、技術的なレベルで、例えば）他の方法で処理することができないこのコラボレーションの管理態様についてIETFにおける初期接触点として作用することです。役割は、3GPP管理プロセスにおける3GPPの会議や参加の出席の期待を運ばないことに合意し、この個人に割り当てられているすべての連絡努力が電子メールで行われることが予想されます。リエゾンがに例外を作る能力、または、IETF方針と手続きのための特別な規定を持っていないことが理解されます。"
    },
    {
      "indent": 0,
      "text": "9. Participation",
      "section_title": true,
      "ja": "9.参加"
    },
    {
      "indent": 3,
      "text": "In order to assist the information flow between the organizations, the IETF can on per case basis appoint a rapporteur to participate and represent IETF at 3GPP technical meetings.",
      "ja": "組織間の情報の流れを支援するために、IETFは、ケースごとに参加し、3GPP技術会議でIETFを代表する報告者を任命することができます。"
    },
    {
      "indent": 3,
      "text": "IETF meetings are open to any interested individuals.",
      "ja": "IETFミーティングは、利害関係者に開放されています。"
    },
    {
      "indent": 3,
      "text": "3GPP partners (OPs, MRPs) or individual members can participate in any of the IETF meetings, in accordance with the existing IETF procedures.",
      "ja": "3GPPパートナー（OPS、MRPの）または個々のメンバーは、既存のIETF手順に従って、IETF会合のいずれかに参加することができます。"
    },
    {
      "indent": 0,
      "text": "8. Security Considerations",
      "section_title": true,
      "ja": "8.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "This type of non-protocol document does not directly affect the security of the Internet.",
      "ja": "非プロトコルドキュメントのこのタイプは、直接インターネットのセキュリティに影響を与えません。"
    },
    {
      "indent": 0,
      "text": "9. Authors' Addresses",
      "section_title": true,
      "ja": "9.著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Questions about this memo can be directed to:",
      "ja": "このメモに関する質問に向けることができます。"
    },
    {
      "indent": 3,
      "text": "Karl Heinz Rosenbrock ETSI 06921 Sophia Antipolis CEDEX France",
      "ja": "カール・ハインツ・ローゼンETSI、06921ソフィアアンティポリスセデックスフランス"
    },
    {
      "indent": 3,
      "text": "Phone: +33 492 94 4212 EMail: rosenbrock@etsi.fr",
      "ja": "電話：+33 492 94 4212 Eメール：rosenbrock@etsi.fr"
    },
    {
      "indent": 3,
      "text": "Raj Sanmugam Director, Systems and Technology Ericsson Canada Inc. 8400 Decarie Blvd TMR, Quebec H4P 2N2",
      "ja": "ラジSanmugamディレクター、システム＆テクノロジー・エリクソン・カナダ社8400 DecarieブルバードTMR、ケベックH4P 2N2"
    },
    {
      "indent": 3,
      "text": "Phone: +1 514 345 7862 Email: Raj.Sanmugam@ericsson.ca",
      "ja": "電話：+1 514 345 7862 Eメール：Raj.Sanmugam@ericsson.ca"
    },
    {
      "indent": 3,
      "text": "Scott Bradner Harvard University Cambridge, MA 02138 USA",
      "ja": "スコット・ブラッドナーハーバード大学、ケンブリッジ、MA 02138 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 617 495 3864 EMail: sob@harvard.edu",
      "ja": "電話：+1 617 495 3864 Eメール：sob@harvard.edu"
    },
    {
      "indent": 3,
      "text": "John C. Klensin AT&T Labs 99 Bedford St Boston, MA 02111 USA",
      "ja": "ジョンC. Klensin AT＆T Labsの99ベッドフォードセントボストン、MA 02111 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 617 513 7285 EMail: Klensin+iab@jck.com",
      "ja": "電話：+1 617 513 7285 Eメール：Klensin+iab@jck.com"
    },
    {
      "indent": 3,
      "text": "Note: Changes to the contents of this memo requires the approval from 3GPP PCG: EMail: 3GPPContact@etsi.fr",
      "ja": "注意：このメモの内容への変更は、3GPP PCGからの承認を必要とします。Eメール：3GPPContact@etsi.fr"
    },
    {
      "indent": 0,
      "text": "Appendix A: Acronyms",
      "ja": "付録A：略語"
    },
    {
      "indent": 0,
      "text": "Glossary Of Acronyms:",
      "ja": "頭字語の用語集："
    },
    {
      "indent": 3,
      "text": "3GPP Third Generation Partnership Project BCP Best Current Practice IAB Internet Architecture Board IESG Internet Engineering Steering Group IETF Internet Engineering Task Force IPR Intellectual Property rights MRP Market Representation Partner OP Organizational Partner O&M Operation and Maintenance PCG Project coordination Group RFC Request for Comments TSG Technical Specification Group TSG-SA TSG Services and systems aspects TSG-CN TSG Core Network TSG-RAN TSG Radio Access Network TSG-GERAN TSG GSM Radio Access Network TSG-T TSG Terminals UTRAN Universal Terrestrial Radio Access Network WWW World Wide Web",
      "ja": "コメントTSG技術仕様グループのために3GPP第三世代パートナーシッププロジェクトBCP最も良い現在の練習IABインターネットアーキテクチャ委員会IESGインターネット技術ステアリンググループIETFインターネットエンジニアリングタスクフォースの知的財産権知的財産権MRP市場​​表現パートナーOP組織パートナーO＆M運用・保守PCGプロジェクトコーディネーショングループRFCリクエストTSG-SA TSGサービスやシステムの側面TSG-CN TSGコアネットワークTSG-RAN TSG無線アクセス・ネットワークTSG-GERAN TSG GSM無線アクセスネットワークTSG-T TSG端子UTRANユニバーサル地上無線アクセスネットワークWWWワールド・ワイド・ウェブ"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2001). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2001）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "了承"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}