{
  "title": {
    "text": "RFC 5453 - Reserved IPv6 Interface Identifiers",
    "ja": "RFC 5453 - 予約IPv6インタフェース識別子"
  },
  "number": 5453,
  "created_at": "2019-10-28 06:20:47.386853+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                        S. Krishnan\nRequest for Comments: 5453                                      Ericsson\nCategory: Standards Track                                  February 2009",
      "raw": true
    },
    {
      "indent": 18,
      "text": "Reserved IPv6 Interface Identifiers",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2009 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2009 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/ license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/ライセンス情報）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "Interface identifiers in IPv6 unicast addresses are used to identify interfaces on a link. They are required to be unique within a subnet. Several RFCs have specified interface identifiers or identifier ranges that have a special meaning attached to them. An IPv6 node autoconfiguring an interface identifier in these ranges will encounter unexpected consequences. Since there is no centralized repository for such reserved identifiers, this document aims to create one.",
      "ja": "IPv6ユニキャストアドレスのインタフェース識別子は、リンク上のインターフェイスを識別するために使用されます。これらは、サブネット内で一意であることが要求されています。いくつかのRFCは、それらに接続特別な意味を持つインタフェース識別子または識別子の範囲を指定しています。これらの範囲内のインタフェース識別子を自動設定IPv6ノードは、予期しない結果が発生します。このように予約識別子のための中央リポジトリがありませんので、このドキュメントは1を作成することを目指しています。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n   1.1. Applicability ..............................................2\n   1.2. Requirements Notation ......................................3\n2. Issues with Reusing Reserved Interface Identifiers ..............3\n   2.1. Possible Solutions .........................................3\n3. IANA Considerations .............................................3\n4. Acknowledgements ................................................4\n5. Security Considerations .........................................4\n6. References ......................................................5\n   6.1. Normative References .......................................5\n   6.2. Informative References .....................................5\nAppendix A. List of Potentially Affected RFCs ......................6",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "An IPv6 unicast address is composed of two parts: a subnet prefix and an interface identifier (IID) that identifies a unique interface within the subnet prefix. The structure of an IPv6 unicast address is depicted in \"IPv6 Addressing Architecture\" [RFC4291] and is replicated here for clarity.",
      "ja": "サブネットプレフィックスとサブネットプレフィックス内で一意のインターフェースを識別するインターフェース識別子（IID）：IPv6ユニキャストアドレスは、2つの部分から構成されています。 IPv6ユニキャストアドレスの構造は、「IPv6アドレス指定アーキテクチャ」[RFC4291]に示され、明確にするためにここで複製されます。"
    },
    {
      "indent": 3,
      "text": "|          n bits               |           128-n bits            |\n+-------------------------------+---------------------------------+\n|       subnet prefix           |           interface ID          |\n+-------------------------------+---------------------------------+",
      "raw": true
    },
    {
      "indent": 19,
      "text": "Figure 1: IPv6 Unicast Address Format",
      "ja": "図1：IPv6ユニキャストアドレス形式"
    },
    {
      "indent": 3,
      "text": "For all unicast addresses, except those that start with the binary value 000, Interface IDs are required to be 64 bits long and to be constructed in Modified EUI-64 format [RFC4291]. Examples of mechanisms that generate interface identifiers without a unique token include Cryptographically Generated Addresses [RFC3972], Privacy Addresses [RFC4941], Hash-Based Addresses [HBA], etc. Non-unique interface identifiers can also be allocated using managed address assignment mechanisms like DHCPv6 (Dynamic Host Configuration Protocol for IPv6) [RFC3315].",
      "ja": "すべてのユニキャストアドレスの場合、バイナリ値000で始まるものを除いて、インタフェースIDは64ビット長であり、かつ変形EUI-64フォーマット[RFC4291]に構成する必要があります。ユニークなトークンなしインタフェース識別子を生成する機構の例には、非固有のインターフェース識別子も同様に管理アドレス割り当て機構を使用して割り当てることができる暗号化生成アドレス[RFC3972]、プライバシーアドレス[RFC4941]、ハッシュベースアドレス[HBA]を含みますDHCPv6の（IPv6の動的ホスト構成プロトコル）[RFC3315]。"
    },
    {
      "indent": 0,
      "text": "1.1. Applicability",
      "section_title": true,
      "ja": "1.1。適用性"
    },
    {
      "indent": 3,
      "text": "This document applies only to interface identifiers that are formed in the modified EUI-64 format as defined in Appendix A of [RFC4291]. All other types of interface identifiers are out of its scope.",
      "ja": "この文書は、[RFC4291]の付録Aで定義されるように修飾されたEUI-64フォーマットに形成されているインタフェース識別子に適用されます。インタフェース識別子の他のすべての種類は、その範囲外です。"
    },
    {
      "indent": 0,
      "text": "1.2. Requirements Notation",
      "section_title": true,
      "ja": "1.2。要件表記"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. Issues with Reusing Reserved Interface Identifiers",
      "section_title": true,
      "ja": "再利用予約インタフェース識別子2.問題"
    },
    {
      "indent": 3,
      "text": "Let us assume a node comes up with an interface identifier that has been reserved for use in some other capacity, e.g., an IPv6 node that uses temporary IPv6 addresses [RFC4941] comes up with an IID of fdff:ffff:ffff:ffff. This node will receive requests from all nodes that are requesting a service from a Mobile IPv6 home agent since the above-mentioned interface identifier has been reserved in [RFC2526] to serve as a MIPv6 home agent's anycast address. At best, this is an annoyance to the node that came up with this address. At worst, another node on the link would be denied service and may not look for other methods of acquiring a home agent. Thus, such reserved interface identifiers MUST NOT be used for autonomous autoconfiguration or for managed address configuration.",
      "ja": "私たちは、ノードを想定してみましょういくつかの他の容量で使用するために予約されたインタフェース識別子を思い付く、例えば、一時的なIPv6アドレスを使用してIPv6ノード[RFC4941]はfdffのIIDを思い付く：FFFF：FFFF：FFFF。このノードは、上述したインタフェース識別子は、[RFC2526]に予約されているので、MIPv6のホームエージェントのエニーキャストアドレスとして機能するモバイルIPv6ホームエージェントからサービスを要求しているすべてのノードからの要求を受信します。せいぜい、これは、このアドレスを思い付いたノードに迷惑です。最悪の場合、リンク上の別のノードがサービスを拒否されるだろうし、ホームエージェントを取得する他の方法を探していないことがあります。したがって、このような予約インターフェース識別子は、自律自動設定または管理対象アドレス設定に使用してはいけません。"
    },
    {
      "indent": 0,
      "text": "2.1. Possible Solutions",
      "section_title": true,
      "ja": "2.1。可能な解決策"
    },
    {
      "indent": 3,
      "text": "There are two possible ways to go about avoiding usage of these reserved interface identifiers. One of them would be to add a normative reference to each specification that reserves an interface identifier. The other would be to create an IANA registry for such interface identifiers. There are two disadvantages to the normative reference approach. Firstly, this approach does not scale well because the number of such specifications that would need to be updated is large. Secondly, the maturity level of the document reserving the IID might be lower than the one prohibited from using it; this will cause a downward reference problem. Therefore, the better solution is to create an IANA registry for this purpose.",
      "ja": "これらの予約インターフェース識別子の使用を避けることについて移動する2つの方法があります。それらの一つは、インターフェース識別子を留保各明細書に規定の参照を追加することであろう。他には、このようなインタフェース識別子のIANAレジストリを作成することです。引用規格のアプローチには2つの欠点があります。更新する必要があるだろう、このような仕様の数が多いので、まず、このアプローチはうまくスケールしません。第二に、IIDを予約文書の成熟度レベルは、それを使用することを禁止よりも低いかもしれません。これは、方向基準の問題が発生します。そのため、よりよい解決策は、この目的のためにIANAレジストリを作成することです。"
    },
    {
      "indent": 0,
      "text": "3. IANA Considerations",
      "section_title": true,
      "ja": "3. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document creates an IANA registry for reserved IPv6 interface identifiers. Initial values for the reserved IPv6 interface identifiers are given below.",
      "ja": "この文書では、予約されたIPv6インタフェース識別子のIANAレジストリを作成します。予約されたIPv6インタフェース識別子の初期値を以下に示します。"
    },
    {
      "indent": 3,
      "text": "+-----------------------------------------+-------------------------+\n|        Interface Identifier Range       |       Description       |\n+-----------------------------------------+-------------------------+\n|           0000:0000:0000:0000           |  Subnet-Router Anycast  |\n|                                         |        [RFC4291]        |\n|                                         |                         |\n| FDFF:FFFF:FFFF:FF80-FDFF:FFFF:FFFF:FFFF | Reserved Subnet Anycast |\n|                                         |    Addresses[RFC2526]   |\n+-----------------------------------------+-------------------------+",
      "raw": true
    },
    {
      "indent": 23,
      "text": "Table 1: Current Assignments",
      "ja": "表1：現在の割り当て"
    },
    {
      "indent": 3,
      "text": "It is possible that implementations might predate a specific assignment from this registry and hence not be cognizant of the reserved nature of the interface identifier. Hence, future assignments from this registry are discouraged. Future assignments, if any, are to be made through Standards Action [RFC5226]. Assignments consist of a single interface identifier or a range of interface identifiers.",
      "ja": "実装は、このレジストリから特定の割り当てに先行し、従ってインタフェース識別子の予約性質を認識しないかもしれない可能性があります。したがって、このレジストリから将来の割り当ては落胆されています。今後の割り当ては、もしあれば、標準アクション[RFC5226]を介して行われるべきです。割り当ては、単一のインタフェース識別子またはインタフェース識別子の範囲から成ります。"
    },
    {
      "indent": 3,
      "text": "NOTE: The address :: (all zeros in the interface identifier field) is used as the unspecified address and ::/0 is used as a default route indicator, as specified in [RFC5156]. These uses do not conflict with the reserved interface identifiers defined here, since the reserved identifiers defined in this document are used for avoiding conflicts with stateless address autoconfiguration that utilizes a 64-bit prefix length.",
      "ja": "注：[RFC5156]で指定されるように未指定アドレスと:: / 0は、デフォルトルートの指標として使用されるように、アドレス::（インタフェース識別子フィールドにすべてゼロ）が使用されます。この文書で定義された予約済みの識別子が64ビットのプレフィックス長を利用ステートレスアドレス自動設定との競合を回避するために使用されているので、これらの使用は、ここで定義された予約インタフェース識別子と競合しません。"
    },
    {
      "indent": 0,
      "text": "4. Acknowledgements",
      "section_title": true,
      "ja": "4.謝辞"
    },
    {
      "indent": 3,
      "text": "The author would like to thank Alain Durand, Alex Petrescu, Bernie Volz, Bob Hinden, Christian Huitema, Fred Templin, Jordi Palet Martinez, Pekka Savola, Remi Denis-Courmount, Tim Enos, Ed Jankiewicz, Brian Carpenter, Alfred Hoenes, Jari Arkko, Pasi Eronen, Tim Polk, Lars Eggert, Derek Atkins, and Robert Sparks for reviewing this document and suggesting changes.",
      "ja": "著者はアラン・デュラン、アレックスペトレスク、バーニーフォルツ、ボブHindenとクリスチャンのHuitema、フレッド・テンプリン、ジョルディPaletマルティネス、ペッカSavola、レミデニス・Courmount、ティム・エノス、エドJankiewicz、ブライアン・カーペンター、アルフレッドHoenes、ヤリArkkoに感謝したいと思います、この文書を見直し、変更を示唆ためのパシEronen、ティムポーク、ラースEggertの、デレク・アトキンス、そしてロバート・スパークス。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "By utilizing one of the reserved interface identifiers, an IPv6 node might receive requests that it is not authorized to receive. Information that creates or updates a registration in this registry needs to be authenticated and authorized by the IANA based on the instructions set forth by [RFC5226].",
      "ja": "予約済みのインターフェイス識別子のいずれかを利用することにより、IPv6ノードは、受信することを許可されていない要求を受信することがあります。このレジストリに登録を作成したり、更新情報は、[RFC5226]で定める指示に基づいて、IANAによって認証され、承認される必要があります。"
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "ja": "6.参照"
    },
    {
      "indent": 0,
      "text": "6.1. Normative References",
      "section_title": true,
      "ja": "6.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2526] Johnson, D. and S. Deering, \"Reserved IPv6 Subnet Anycast Addresses\", RFC 2526, March 1999.",
      "ja": "[RFC2526]ジョンソン、D.とS.デアリング、 \"予約済みのIPv6サブネットエニーキャストアドレス\"、RFC 2526、1999年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC4291] Hinden, R. and S. Deering, \"IP Version 6 Addressing Architecture\", RFC 4291, February 2006.",
      "ja": "[RFC4291] HindenとR.とS.デアリング、 \"IPバージョン6アドレッシング体系\"、RFC 4291、2006年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC5226] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 5226, May 2008.",
      "ja": "[RFC5226] Narten氏、T.とH. Alvestrand、 \"RFCsにIANA問題部に書くためのガイドライン\"、BCP 26、RFC 5226、2008年5月。"
    },
    {
      "indent": 0,
      "text": "6.2. Informative References",
      "section_title": true,
      "ja": "6.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[HBA] Bagnulo, M., \"Hash Based Addresses (HBA)\", Work in Progress, October 2006.",
      "ja": "[HBA] Bagnulo、M.、 \"ハッシュベースのアドレス（HBA）\"、進歩、2006年10月に作業。"
    },
    {
      "indent": 3,
      "text": "[RFC3315] Droms, R., Ed., Bound, J., Volz, B., Lemon, T., Perkins, C., and M. Carney, \"Dynamic Host Configuration Protocol for IPv6 (DHCPv6)\", RFC 3315, July 2003.",
      "ja": "[RFC3315] Droms、R.、編、バウンド、J.、フォルツ、B.、レモン、T.、パーキンス、C.、およびM.カーニー、 \"IPv6のための動的ホスト構成プロトコル（DHCPv6）\"、RFC 3315 、2003年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC3972] Aura, T., \"Cryptographically Generated Addresses (CGA)\", RFC 3972, March 2005.",
      "ja": "[RFC3972]オーラ、T.、 \"暗号的に生成されたアドレス（CGA）\"、RFC 3972、2005年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC4941] Narten, T., Draves, R., and S. Krishnan, \"Privacy Extensions for Stateless Address Autoconfiguration in IPv6\", RFC 4941, September 2007.",
      "ja": "[RFC4941] Narten氏、T.、Draves、R.、およびS.クリシュナン、 \"IPv6におけるステートレスアドレス自動設定のための個人情報保護の拡張\"、RFC 4941、2007年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC5156] Blanchet, M., \"Special-Use IPv6 Addresses\", RFC 5156, April 2008.",
      "ja": "[RFC5156]ブランシェ、M.、 \"特殊用途のIPv6アドレス\"、RFC 5156、2008年4月。"
    },
    {
      "indent": 0,
      "text": "Appendix A. List of Potentially Affected RFCs",
      "ja": "影響を受ける可能性のRFCの付録A.一覧"
    },
    {
      "indent": 3,
      "text": "Implementations of the following RFCs need to be aware of the reserved interface identifier ranges when they allocate new addresses. Future revisions of these RFCs should ensure that this is either already sufficiently clear or that the text is amended to take this into account.",
      "ja": "次のRFCの実装は、彼らが新しいアドレスを割り当てる予約済みのインタフェース識別子の範囲を認識する必要があります。これらのRFCの今後の改正は、これはすでに十分に明確またはテキストがこれを考慮に入れるように修正されていることのいずれかであることを確認する必要があります。"
    },
    {
      "indent": 3,
      "text": "o RFC 2590 - Transmission of IPv6 Packets over Frame Relay Networks Specification",
      "ja": "OのRFC 2590  - フレームリレーネットワーク仕様の上のIPv6パケットのトランスミッション"
    },
    {
      "indent": 3,
      "text": "o RFC 3315 - Dynamic Host Configuration Protocol for IPv6 (DHCPv6)",
      "ja": "OのRFC 3315  -  IPv6の動的ホスト構成プロトコル（DHCPv6）"
    },
    {
      "indent": 3,
      "text": "o RFC 3972 - Cryptographically Generated Addresses (CGA)",
      "ja": "入出力RFC 3972  - 暗号化生成アドレス（CGA）"
    },
    {
      "indent": 3,
      "text": "o RFC 4489 - A Method for Generating Link-Scoped IPv6 Multicast Addresses",
      "ja": "OのRFC 4489  - の生成リンクスコープのIPv6マルチキャストアドレスのための方法"
    },
    {
      "indent": 3,
      "text": "o RFC 4862 - IPv6 Stateless Address Autoconfiguration",
      "ja": "OのRFC 4862  -  IPv6のステートレスアドレス自動設定"
    },
    {
      "indent": 3,
      "text": "o RFC 4941 - Privacy Extensions for Stateless Address Autoconfiguration in IPv6",
      "ja": "OのRFC 4941  -  IPv6におけるステートレスアドレス自動設定のための個人情報保護の拡張"
    },
    {
      "indent": 3,
      "text": "o RFC 4982 - Support for Multiple Hash Algorithms in Cryptographically Generated Addresses (CGAs)",
      "ja": "O RFC 4982  - 暗号的に生成されたアドレス（CGAs）内の複数のハッシュアルゴリズムのサポート"
    },
    {
      "indent": 3,
      "text": "o RFC 5072 - IP Version 6 over PPP",
      "ja": "OのRFC 5072  -  PPP上でのIPバージョン6"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Suresh Krishnan Ericsson 8400 Decarie Blvd. Town of Mount Royal, QC Canada",
      "ja": "スレシュクリシュナンエリクソン8400 Decarie大通りマウントロイヤル、QCカナダの町"
    },
    {
      "indent": 3,
      "text": "Phone: +1 514 345 7900 x42871 EMail: suresh.krishnan@ericsson.com",
      "ja": "電話：+1 514 345 7900 x42871メール：suresh.krishnan@ericsson.com"
    }
  ]
}