{
  "title": {
    "text": "RFC 5703 - Sieve Email Filtering: MIME Part Tests, Iteration, Extraction, Replacement, and Enclosure",
    "ja": "RFC 5703 - ふるいメールフィルタリング：MIMEパートのテスト、反復、抽出、置換、およびエンクロージャ"
  },
  "number": 5703,
  "created_at": "2019-10-27 16:41:15.702328+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                          T. Hansen\nRequest for Comments: 5703                             AT&T Laboratories\nCategory: Standards Track                                       C. Daboo\n                                                              Apple Inc.\n                                                            October 2009",
      "raw": true
    },
    {
      "indent": 5,
      "text": "Sieve Email Filtering: MIME Part Tests, Iteration, Extraction,\n                  Replacement, and Enclosure",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document defines extensions to the Sieve email filtering language to permit analysis and manipulation of the MIME body parts of an email message.",
      "ja": "この文書は、電子メールメッセージのMIMEボディパーツの分析と操作を可能にするために、ふるいのメールフィルタリング言語に拡張を定義します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2009 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2009 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクション4.eに記載されており、BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 3,
      "text": "This document may contain material from IETF Documents or IETF Contributions published or made publicly available before November 10, 2008. The person(s) controlling the copyright in some of this material may not have granted the IETF Trust the right to allow modifications of such material outside the IETF Standards Process. Without obtaining an adequate license from the person(s) controlling the copyright in such materials, this document may not be modified outside the IETF Standards Process, and derivative works of it may not be created outside the IETF Standards Process, except to format it for publication as an RFC or to translate it into languages other than English.",
      "ja": "この材料の一部がIETFトラストにこのような材料の変更を許可する権利を与えられていない可能性がありますにこの文書は、2008年、IETFドキュメントまたは11月10日以前に発行または公開さIETF貢献から著作権を支配する者（複数可）材料を含んでいてもよいですIETF標準化プロセスの外。そのような材料の著作権を管理者（単数または複数）から適切なライセンスを取得することなく、この文書は、IETF標準化過程の外側修正されないかもしれません、そして、それの派生物は、IETF標準化過程の外側に作成されない場合があり、それをフォーマットする以外出版RFCとして、英語以外の言語に翻訳します。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Conventions Used in This Document ...............................3\n3. Sieve Loops: Actions \"foreverypart\" and \"break\" .................3\n4. Changes to Sieve Tests ..........................................4\n   4.1. Test \"header\" ..............................................4\n   4.2. Test \"address\" .............................................7\n   4.3. Test \"exists\" ..............................................8\n5. Action \"replace\" ................................................8\n6. Action \"enclose\" ...............................................10\n7. Action \"extracttext\" ...........................................11\n8. Sieve Capability Strings .......................................11\n9. Examples .......................................................12\n   9.1. Example 1 .................................................12\n   9.2. Example 2 .................................................12\n   9.3. Example 3 .................................................13\n10. Acknowledgements ..............................................13\n11. Security Considerations .......................................14\n12. IANA Considerations ...........................................14\n   12.1. foreverypart capability ..................................15\n   12.2. mime capability ..........................................15\n   12.3. replace capability .......................................15\n   12.4. enclose capability .......................................16\n   12.5. extracttext capability ...................................16\n13. References ....................................................16\n   13.1. Normative References .....................................16\n   13.2. Informative References ...................................17",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "MIME messages ([RFC2045]) are often complex objects, consisting of many parts and sub-parts. This Sieve ([RFC5228]) extension defines mechanisms for performing tests on MIME body parts, looping through the MIME body parts, extracting information from a MIME body part, changing the contents of a MIME body part, and enclosing the entire message within a wrapper.",
      "ja": "MIMEメッセージ（[RFC2045]）は多くの部品及びサブ部からなる、しばしば複雑なオブジェクトです。このふるい（[RFC5228]）拡張は、MIME本体部分にテストを実行するMIME本体部分をループ、MIME本体部から情報を抽出し、MIME本体部の内容を変更し、ラッパー内にメッセージ全体を封入するためのメカニズムを定義します。"
    },
    {
      "indent": 0,
      "text": "2. Conventions Used in This Document",
      "section_title": true,
      "ja": "この文書で使用される2.表記"
    },
    {
      "indent": 3,
      "text": "Conventions for notations are as in [RFC5228], Section 1.1.",
      "ja": "表記の規則は、[RFC5228]、セクション1.1のようにしています。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "3. Sieve Loops: Actions \"foreverypart\" and \"break\"",
      "section_title": true,
      "ja": "3.ふるいループ：アクション「foreverypart」と「休憩」"
    },
    {
      "indent": 3,
      "text": "The base Sieve language has no looping mechanism. Given that messages may contain multiple parts, in order to support filters that apply to any and all parts, we introduce a new control command: \"foreverypart\", which is an iterator that walks though every MIME part of a message, including nested parts, depth first, and applies the commands in the specified block to each of them. The iterator will start with the first MIME part (as its current context) and will execute a command block (Sieve commands enclosed by {...}). Upon completion of this command block, the iterator advances to the next MIME part (as its current context) and executes the same command block again.",
      "ja": "ベースふるい言語は何のループメカニズムを持っていません。メッセージは任意およびすべての部分に適用するフィルタをサポートするために、複数の部品を含むことができることを考えると、我々は新しい制御コマンド紹介：「foreverypart」、ネストされた部品を含む、メッセージのすべてのMIMEパートかかわら歩くイテレータです、深さ第一、及びそれらのそれぞれに指定されたブロック内のコマンドを適用します。反復子は、（その現在のコンテキストとして）最初のMIME部分で開始し、コマンドブロック（{...}で囲まれたふるいコマンド）を実行します。このコマンドは、ブロックが完了すると、反復子は、（現在のコンテキストとして）次のMIMEパートに移行して、再度同じコマンドブロックを実行します。"
    },
    {
      "indent": 3,
      "text": "The iterator can be terminated prematurely by a new Sieve control command, \"break\".",
      "ja": "反復子は、「休憩」、新しいふるい制御コマンドによって途中で終了することができます。"
    },
    {
      "indent": 3,
      "text": "Usage: foreverypart [\":name\" string] block",
      "ja": "使用方法：foreverypart [ \"：名\" の文字列]ブロック"
    },
    {
      "indent": 3,
      "text": "Usage: break [\":name\" string];",
      "ja": "使用方法：ブレーク[ \"：名\" の文字列];"
    },
    {
      "indent": 3,
      "text": "\"foreverypart\" commands can be nested inside other \"foreverypart\" commands. When this occurs, the nested \"foreverypart\" iterates over the MIME parts contained within the MIME part currently being targeted by the nearest enclosing \"foreverypart\" command. (That is, the inner loop only operates on children of the bodypart currently accessed by the outer loop.) If that MIME part is a terminal MIME part (i.e., does not contain other MIME parts), then the nested \"foreverypart\" loop is simply ignored.",
      "ja": "「foreverypart」コマンドは、他の「foreverypart」コマンド内にネストすることができます。これが発生すると、現在のMIMEパートに含まれるMIME部分の上に、ネストされた「foreverypart」繰り返し処理は、コマンド「foreverypart」最も内側の標的とされています。 （すなわち、内側ループのみ現在アウターループによってアクセスされるボディ部の子で動作する。）そのMIME部分は（すなわち、他のMIME部分を含まない）、端末MIMEの一部である場合、ネストされた「foreverypart」ループであります単に無視。"
    },
    {
      "indent": 3,
      "text": "Sieve implementations MAY limit the number of nested loops that occur within one another; however, they MUST support at least one nested loop inside another loop.",
      "ja": "ふるいの実装が互いに内で発生するネストされたループの数を制限することができます。しかし、彼らは別のループ内の少なくとも一つのネストされたループをサポートしなければなりません。"
    },
    {
      "indent": 3,
      "text": "If a name is given to a \"break\" command, it terminates the closest enclosing loop with the identical matching name. (If a nested \"foreverypart\" name is the same as a \"foreverypart\" name in an outer level, the outer level name is hidden.) It is an error if there is no enclosing loop with that name.",
      "ja": "名前は「ブレーク」コマンドに指定されている場合は、同じ名前が一致する最も近い外側のループを終了します。 （ネストされた「foreverypart」名は、外側のレベルにおいて「foreverypart」名前と同じである場合、外側のレベルの名前は隠されている。）その名前の外側のループが存在しない場合は、エラーです。"
    },
    {
      "indent": 3,
      "text": "If no name is given in a \"break\" command (i.e., the \":name\" parameter is omitted), the break command terminates the closest enclosing loop.",
      "ja": "名前が（すなわち、「：名」パラメータが省略されている）「ブレイク」コマンドで指定されていない場合は、breakコマンドは、最も近い外側のループを終了します。"
    },
    {
      "indent": 0,
      "text": "4. Changes to Sieve Tests",
      "section_title": true,
      "ja": "ふるいテスト4.変更"
    },
    {
      "indent": 3,
      "text": "This specification extends the base Sieve \"header\", \"address\", and \"exists\" tests to support targeting those tests at a specific MIME part or at all MIME parts in the enclosing scope.",
      "ja": "この仕様は、ベースふるい「ヘッダ」、「アドレス」を延びており、特定のMIME部分に又は封入スコープ内のすべてのMIME部分にこれらのテストを標的サポートするためのテストを「存在します」。"
    },
    {
      "indent": 0,
      "text": "4.1. Test \"header\"",
      "section_title": true,
      "ja": "4.1。試験「ヘッダ」"
    },
    {
      "indent": 3,
      "text": "The \"header\" test is extended with the addition of new \":mime\" and \":anychild\" tagged arguments and their associated options.",
      "ja": "引数とそれに関連するオプションをタグ付け：「anychild」：「MIME」と「ヘッダ」試験は、新規の追加により拡張されます。"
    },
    {
      "indent": 3,
      "text": "Usage: header [\":mime\"] [\":anychild\"] [MIMEOPTS] [COMPARATOR] [MATCH-TYPE] <header-names: string-list> <key-list: string-list>",
      "ja": "用法：ヘッダ[ \"：MIME\"] [ \"：anychild\"] [MIMEOPTS] [コンパレータ] [MATCH-TYPE <ヘッダー名：文字列リスト> <キーリスト：文字列リスト>"
    },
    {
      "indent": 6,
      "text": "The definition of [MIMEOPTS] is:",
      "ja": "[MIMEOPTS]の定義は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "Syntax: \":type\" / \":subtype\" / \":contenttype\" / \":param\" <param-list: string-list>",
      "ja": "構文： \"：タイプ\" / \"：サブタイプ\" / \"：ContentTypeを\" / \"：PARAM\" の<param-リスト：文字列のリスト>"
    },
    {
      "indent": 3,
      "text": "When the \":mime\" tagged argument is present in the \"header\" test, it will parse the MIME header lines in the message so that tests can be performed on specific elements. The \":anychild\" tagged argument may only appear when the \":mime\" tagged argument is present, and only modifies the semantics of the \":mime\" tagged argument. That is, presence of the \":anychild\" in absence of \":mime\" is an error.",
      "ja": "場合「：MIME」タグ付けされた引数は「ヘッダ」テスト中に存在する試験は、特定の要素に対して行うことができるように、メッセージにMIMEヘッダ行を解析します。 「：anychild」ときの引数にのみ表示されることがタグ付け「：パントマイム」タグ付き引数が存在し、唯一のセマンティクス変更「：パントマイム」タグ付き引数を。 「：パントマイム」の不在下で：「anychild」エラーであることはの存在、です。"
    },
    {
      "indent": 3,
      "text": "When used outside the context of a \"foreverypart\" iterator, and without an \":anychild\" tagged argument, the \"header\" test will examine only the outer top-level [RFC5322] headers of the message.",
      "ja": "「foreverypart」イテレータのコンテキスト外で使用される、とすることなく、場合：引数タグ付け「anychild」、「ヘッダ」試験は、外側の最上位[RFC5322]メッセージのヘッダーを検討します。"
    },
    {
      "indent": 3,
      "text": "When used inside the context of a \"foreverypart\" iterator, and without an \":anychild\" tagged argument, the \"header\" test will examine the headers associated with the current MIME part context from the loop.",
      "ja": "「foreverypart」イテレータの文脈内で使用、およびなしの場合：引数タグ付け「anychild」、「ヘッダ」テストは、ループから現在のMIMEパートコンテキストに関連付けられたヘッダを検討します。"
    },
    {
      "indent": 3,
      "text": "When used outside the context of a \"foreverypart\" iterator, and with an \":anychild\" tagged argument, the \"header\" test will examine all MIME body parts and return true if any of them satisfies the test.",
      "ja": "とを有する、「foreverypart」イテレータのコンテキスト外で使用される場合、「：anychild」タグ付けされた引数、「ヘッダ」テストは、すべてのMIME本体部分を検査し、それらのいずれかがテストを満たす場合trueを返します。"
    },
    {
      "indent": 3,
      "text": "When used inside the context of a \"foreverypart\" iterator, and with an \":anychild\" tagged argument, the \"header\" test will examine the current MIME part context and all its nested MIME body parts, returning true if any of them satisfies the test.",
      "ja": "「foreverypart」イテレータのコンテキスト内部、およびで使用される場合、「：anychild」タグ付けされた引数、「ヘッダ」試験は、それらのいずれかが満足する場合にtrueを返し、現在のMIMEパートコンテキストおよびそのすべてのネストされたMIMEボディ部を検討しますテスト。"
    },
    {
      "indent": 3,
      "text": "The \"header\" test with the \":mime\" tagged argument can test various aspects of certain structured MIME headers. Implementations SHOULD support desegmentation, decoding, and charset translation of parameter values encoded according to [RFC2231] as part of this test. Additionally, [RFC2047] describes a process whereby [RFC5322] headers can be encoded in various ways. That encoding is not strictly allowed in MIME parameters; however, in practice, it has been used in many email implementations. So, Sieve implementations MAY decode [RFC2047]-encoded words in parameter values as part of this test.",
      "ja": "有する「ヘッダ」試験：タグ付けされた引数「MIME」は、特定の構造MIMEヘッダの様々な側面をテストすることができます。実装は、このテストの一部としてdesegmentation、復号化、および[RFC2231]に従って符号化パラメータ値の文字セット変換をサポートしなければなりません。また、[RFC2047]は[RFC5322]ヘッダーは、様々な方法で符号化することができる方法を記載しています。そのエンコーディングは、厳密にMIMEパラメータで許可されていません。しかし、実際には、多くの電子メールの実装に使用されてきました。だから、ふるいの実装は、このテストの一部として、パラメータ値に[RFC2047]エンコードさワードを復号することができます。"
    },
    {
      "indent": 3,
      "text": "These options are available:",
      "ja": "これらのオプションを使用できます。"
    },
    {
      "indent": 3,
      "text": ":type for a \"Content-Type\" MIME header field, parses and tests the value of the MIME type specified in the header; for a \"Content-Disposition\" MIME header field, parses and tests the value of the disposition specified in the header; for other MIME headers, uses a blank string for the test.",
      "ja": "「コンテンツタイプ」MIMEヘッダフィールドの型、解析し、ヘッダで指定されたMIMEタイプの値をテストします。 「コンテンツの廃棄」MIMEヘッダフィールドのために、解析し、ヘッダで指定された配置の値をテストします。他のMIMEヘッダのために、テストのために空の文字列を使用しています。"
    },
    {
      "indent": 3,
      "text": ":subtype for a \"Content-Type\" MIME header field, parses and tests the value of the MIME subtype specified in the header; for a \"Content-Disposition\" MIME header field, uses a blank string for the test; for other MIME headers, uses a blank string for the test.",
      "ja": "「コンテンツタイプ」MIMEヘッダフィールドのためのサブタイプは、解析し、ヘッダで指定されたMIMEサブタイプの値をテストします。 「コンテンツの廃棄」MIMEヘッダフィールドのために、試験のために空の文字列を使用します。他のMIMEヘッダのために、テストのために空の文字列を使用しています。"
    },
    {
      "indent": 3,
      "text": ":contenttype for a \"Content-Type\" MIME header field, parses and tests the combined value of the MIME type and subtype specified in the header; for a \"Content-Disposition\" MIME header field, behaves the same as the \":type\" option; for other MIME headers, uses a blank string for the test.",
      "ja": "「コンテンツタイプ」MIMEヘッダフィールドのContentType、解析し、ヘッダで指定されたMIMEタイプとサブタイプの合成値をテストし、 「タイプ」「コンテンツの廃棄」MIMEヘッダフィールドのために、と同じように動作オプション。他のMIMEヘッダのために、テストのために空の文字列を使用しています。"
    },
    {
      "indent": 3,
      "text": ":param parses the header looking for MIME parameters in the header. The supplied string-list lists the names of any parameters to be tested. If any one named parameter value matches any of the test string values, the test will return true.",
      "ja": "：PARAMは、ヘッダ内のMIMEパラメータを探しているヘッダを解析します。与えられた文字列リストをテストするための任意のパラメータの名前が表示されます。いずれかの名前付きパラメータの値はテスト文字列値のいずれかと一致した場合、テストはtrueを返します。"
    },
    {
      "indent": 3,
      "text": "When the \":count\" option from [RFC5231] is used, the following applies:",
      "ja": "「：数」場合は[RFC5231]からオプションを使用する場合、以下が適用されます。"
    },
    {
      "indent": 3,
      "text": "a. for \":type\", \":subtype\", or \":contenttype\", return a count of the number of headers that parsed successfully",
      "ja": "A。 「：タイプ」、「：サブタイプ」、または「：ContentTypeを」ため、正常に解析ヘッダの数のカウントを返します"
    },
    {
      "indent": 3,
      "text": "b. for \":param\", return a count of the number of parameters with the given name that were found",
      "ja": "B。以下のために「：PARAM」、見つかった、指定された名前を持つパラメータの数を返します"
    },
    {
      "indent": 3,
      "text": "Example:",
      "ja": "例："
    },
    {
      "indent": 3,
      "text": "require [\"mime\", \"fileinto\"];",
      "ja": "[ \"MIME\"、 \"のfileinto\"]が必要です。"
    },
    {
      "indent": 3,
      "text": "if header :mime :type \"Content-Type\" \"image\" { fileinto \"INBOX.images\"; }",
      "ja": "MIME： \"INBOX.images \"{のfileinto\" タイプ \"のContent-Type\"\" 画像、ヘッダもし}"
    },
    {
      "indent": 3,
      "text": "In this example, any message that contains a MIME image type part at the top-level is saved to the mailbox \"INBOX.images\".",
      "ja": "この例では、トップレベルのMIME画像型部分を含む任意のメッセージは、メールボックス「INBOX.images」に保存されています。"
    },
    {
      "indent": 3,
      "text": "Example:",
      "ja": "例："
    },
    {
      "indent": 3,
      "text": "require [\"mime\", \"fileinto\"];",
      "ja": "[ \"MIME\"、 \"のfileinto\"]が必要です。"
    },
    {
      "indent": 3,
      "text": "if header :mime :anychild :contenttype \"Content-Type\" \"text/html\" { fileinto \"INBOX.html\"; }",
      "ja": "\"ContentTypeを \"コンテンツタイプ\" \"text / htmlのINBOX.html\"{のfileinto\"; MIME：anychildヘッダもし}"
    },
    {
      "indent": 3,
      "text": "In this example, any message that contains any MIME part with a content-type of \"text/html\" is saved to the mailbox \"INBOX.html\".",
      "ja": "この例では、「text / htmlの」のコンテンツタイプを持つMIMEパートを含む任意のメッセージは、メールボックス「INBOX.html」に保存されます。"
    },
    {
      "indent": 3,
      "text": "Example:",
      "ja": "例："
    },
    {
      "indent": 3,
      "text": "require [\"mime\", \"foreverypart\", \"fileinto\"];",
      "ja": "[ \"MIME\"、 \"foreverypart\"、 \"のfileinto\"]を必要とします。"
    },
    {
      "indent": 3,
      "text": "foreverypart\n{\n    if allof (\n      header :mime :param \"filename\" :contains\n         \"Content-Disposition\" \"important\",\n      header :mime :subtype \"Content-Type\" \"pdf\",\n      size :over \"100K\")\n    {\n        fileinto \"INBOX.important\";\n        break;\n    }\n}",
      "raw": true
    },
    {
      "indent": 3,
      "text": "In this example, any message that contains a MIME part that has a content-disposition with a filename parameter containing the text \"important\", has a content-subtype of \"pdf\" and is bigger than 100 Kb is saved to the mailbox \"INBOX.important\".",
      "ja": "この例では、「重要な」テキストを含むファイル名パラメータを使用したコンテンツ・配置を持つMIMEパートを含む任意のメッセージは、「PDF」のコンテンツのサブタイプがあり、100 KBがメールボックス「INBOXに保存されているよりも大きいです。重要\"。"
    },
    {
      "indent": 0,
      "text": "4.2. Test \"address\"",
      "section_title": true,
      "ja": "4.2。テスト「アドレス」"
    },
    {
      "indent": 3,
      "text": "The \"address\" test is extended with the addition of new \":mime\" and \":anychild\" tagged arguments and their associated options.",
      "ja": "引数とそれに関連するオプションをタグ付け：「anychild」：「パントマイム」と「アドレス」のテストは、新しいを追加して拡張されます。"
    },
    {
      "indent": 3,
      "text": "Usage: address [\":mime\"] [\":anychild\"] [COMPARATOR] [ADDRESS-PART] [MATCH-TYPE] <header-list: string-list> <key-list: string-list>",
      "ja": "使用方法：アドレス[ \"：MIME\"] [ \"：anychild\"] [コンパレータ] [ADDRESS-PART] [MATCH-TYPE <ヘッダリスト：文字列リスト> <キーリスト：文字列リスト>"
    },
    {
      "indent": 3,
      "text": "When the \":mime\" tagged argument is present in the \"address\" test, it will parse the MIME header lines as if they were standard address header lines in a message so that tests can be performed on specific elements.",
      "ja": "場合：引数タグ付けされた「MIME」と「住所」テスト中に存在する試験は、特定の要素に対して行うことができるように、彼らは、メッセージ内の標準アドレスヘッダ行であるかのように、MIMEヘッダ行を解析します。"
    },
    {
      "indent": 3,
      "text": "The behavior of the \":anychild\" tagged argument and the interaction with the \"foreverypart\" iterator is the same as for the extended \"header\" test in Section 4.1.",
      "ja": "挙動「：anychild」タグ付けされた引数と「foreverypart」イテレータとの相互作用は、セクション4.1で拡張された「ヘッダ」試験の場合と同じです。"
    },
    {
      "indent": 3,
      "text": "That is,",
      "ja": "あれは、"
    },
    {
      "indent": 6,
      "text": "the use of \"address\" when both the \":mime\" and \":anychild\" tagged arguments are omitted is the test defined in [RFC5228], i.e., it will *only* operate on top-level header fields, whether or not it is inside \"foreverypart\".",
      "ja": "「MIME」と「住所」の両方の使用「：anychild」が省略されている引数は、[RFC5228]で定義された試験、すなわち、それは*のみ*最上位のヘッダーフィールドに動作するでタグ付けされたか否か内部の「foreverypart」です。"
    },
    {
      "indent": 6,
      "text": "the use of \"address\" with \":mime\" and no \":anychild\" operates on the current MIME part only (or on the top-level header fields, if outside \"foreverypart\").",
      "ja": "「MIME」なし「：anychild」と「住所」の使用は、のみ（または最上位ヘッダフィールドに、外部「foreverypart」であれば）現在のMIME部分に動作します。"
    },
    {
      "indent": 6,
      "text": "the use of \"address\" with \":mime\" and \":anychild\" operates on the current MIME part and all of its descendants.",
      "ja": "「：パントマイム」と「：anychild」と「アドレス」を使用すると、現在のMIMEパートとその子孫のすべてで動作します。"
    },
    {
      "indent": 3,
      "text": "Example:",
      "ja": "例："
    },
    {
      "indent": 3,
      "text": "require [\"mime\", \"fileinto\"];",
      "ja": "[ \"MIME\"、 \"のfileinto\"]が必要です。"
    },
    {
      "indent": 3,
      "text": "if address :mime :is :all \"content-from\" \"tim@example.com\" { fileinto \"INBOX.part-from-tim\"; }",
      "ja": "アドレス場合：MIMEは：であり：INBOX.part-から-ティム \" \"のfileinto {\" 全て\" \"コンテンツから\" tim@example.com。 }"
    },
    {
      "indent": 3,
      "text": "In this example, any message that contains a MIME Content-From header at the top-level matching the text \"tim@example.com\" is saved to the mailbox \"INBOX.part-from-tim\".",
      "ja": "この例では、最上位の一致するテキスト「tim@example.com」でのMIMEコンテンツからヘッダを含む任意のメッセージがメールボックス「INBOX.part-から-ティム」に保存されています。"
    },
    {
      "indent": 0,
      "text": "4.3. Test \"exists\"",
      "section_title": true,
      "ja": "4.3。テストは「存在します」"
    },
    {
      "indent": 3,
      "text": "The \"exists\" test is extended with the addition of the new \":mime\" and \":anychild\" tagged arguments and their associated options.",
      "ja": "引数とそれに関連するオプションをタグ付け：「anychild」：「パントマイム」と「存在」テストは、新しいを追加して拡張されます。"
    },
    {
      "indent": 3,
      "text": "Usage: exists [\":mime\"] [\":anychild\"] <header-names: string-list>",
      "ja": "用法：[ \"：MIMEを\"]が存在する[ \"：anychild\" <ヘッダー名：文字列リスト>"
    },
    {
      "indent": 3,
      "text": "When the \":mime\" tagged argument is present in the \"exists\" test, the test is extended to check for the existence of MIME headers in MIME parts.",
      "ja": "場合：引数タグ付けされた「MIME」が「存在する」テストで存在する、試験は、MIME部分にMIMEヘッダの存在をチェックするように拡張されます。"
    },
    {
      "indent": 3,
      "text": "The behavior of the \":anychild\" tagged argument and the interaction with the \"foreverypart\" iterator is the same as for the extended \"header\" test Section 4.1.",
      "ja": "挙動「：anychild」タグ付けされた引数と「foreverypart」イテレータとの相互作用は、拡張された「ヘッダ」試験セクション4.1の場合と同じです。"
    },
    {
      "indent": 3,
      "text": "That is,",
      "ja": "あれは、"
    },
    {
      "indent": 6,
      "text": "the use of \"exists\" when both the \":mime\" and \":anychild\" tagged arguments are omitted is the test defined in [RFC5228], i.e., it will *only* operate on top-level header fields, whether or not it is inside \"foreverypart\".",
      "ja": "「MIME」と「：anychild」引数が省略されているタグ付けされた[RFC5228]で定義された試験である、すなわち、それは*のみ*、それかどうかにかかわらず、最上位のヘッダフィールドで動作する両方の場合に、「存在」の使用内部の「foreverypart」です。"
    },
    {
      "indent": 6,
      "text": "the use of \"exists\" with \":mime\" and no \":anychild\" operates on the current MIME part only (or on the top-level header fields, if outside \"foreverypart\").",
      "ja": "のみ（または最上位ヘッダフィールドに、外部「foreverypart」であれば）現在のMIME部分に動作する：いいえ：「MIME」と「anychild」の使用は、で「存在します」。"
    },
    {
      "indent": 6,
      "text": "the use of \"exists\" with \":mime\" and \":anychild\" operates on the current MIME part and all of its descendants.",
      "ja": "現在のMIME部分とその子孫のすべてで動作する「：：パントマイム」と「anychild」の使用はで「存在します」。"
    },
    {
      "indent": 3,
      "text": "Example:",
      "ja": "例："
    },
    {
      "indent": 3,
      "text": "require [\"mime\", \"fileinto\"];",
      "ja": "[ \"MIME\"、 \"のfileinto\"]が必要です。"
    },
    {
      "indent": 3,
      "text": "if exists :mime :anychild \"content-md5\" { fileinto \"INBOX.md5\"; }",
      "ja": "場合は存在：MIME：anychild \"コンテンツ-MD5\" { \"INBOX.md5\" のfileinto。 }"
    },
    {
      "indent": 3,
      "text": "In this example, any message that contains a MIME Content-MD5 header in any MIME part is saved to the mailbox \"INBOX.md5\".",
      "ja": "この例では、任意のMIME部分のMIMEのContent-MD5ヘッダを含む任意のメッセージは、メールボックス「INBOX.md5」に保存されています。"
    },
    {
      "indent": 0,
      "text": "5. Action \"replace\"",
      "section_title": true,
      "ja": "5.アクション「置き換え」"
    },
    {
      "indent": 3,
      "text": "Usage: replace [\":mime\"] [\":subject\" string] [\":from\" string] <replacement: string>",
      "ja": "使用方法：置き換える[ \"：パントマイム\"] [ \"：件名\" 文字列] [ \"：から\" 文字列] <交換：文字列>"
    },
    {
      "indent": 3,
      "text": "The \"replace\" command is defined to allow a MIME part to be replaced with the text supplied in the command.",
      "ja": "「置き換え」コマンドは、MIME部分がコマンドで提供されるテキストに置き換えできるように定義されています。"
    },
    {
      "indent": 3,
      "text": "When used in the context of a \"foreverypart\" iterator, the MIME part to be replaced is the \"current\" MIME part. If the current MIME context is a multipart MIME part, the entire multipart MIME part is replaced, which would alter the MIME structure of the message by eliminating all of the children of the multipart part. (Replacing a non-multipart MIME part within a \"foreverypart\" loop context does not alter the overall message structure.) If the MIME structure is altered, the change takes effect immediately: the \"foreverypart\" iterator that is executing does not go into the no-longer existing body parts, and subsequent \"foreverypart\" iterators would use the new message structure.",
      "ja": "「foreverypart」イテレータの文脈で使用される場合、交換するMIME部分は、「現在」のMIME部分です。現在のMIMEコンテキストはマルチパートMIME一部である場合、全体のマルチパートMIME部分は、マルチパートの子のすべてを排除することによって、メッセージのMIME構造を変化させるであろう、置換されています。 （「foreverypart」ループ・コンテキスト内で非マルチパートMIMEの一部を置換する全体的なメッセージ構造を変更しない。）MIME構造が変更された場合、変更はすぐに有効になります。実行している「foreverypart」イテレータに入りません無もはや既存の車体部品、およびそれに続く「foreverypart」イテレータは、新しいメッセージ構造を使用します。"
    },
    {
      "indent": 3,
      "text": "When used outside the context of a \"foreverypart\" loop, the MIME part to be replaced is the entire message.",
      "ja": "「foreverypart」ループのコンテキスト外で使用される場合、交換するMIME部分はメッセージ全体です。"
    },
    {
      "indent": 3,
      "text": "If the \":mime\" parameter is not specified, the replacement string is a text/plain part in UTF-8 [RFC3629].",
      "ja": "「：パントマイム」場合はパラメータが指定されていない、置換文字列はUTF-8 [RFC3629]でtext / plainの一部です。"
    },
    {
      "indent": 3,
      "text": "If the \":mime\" parameter is specified, then the replacement string is, in fact, a MIME entity as defined in [RFC2045], Section 2.4, including both MIME headers and content.",
      "ja": "「MIME」場合、パラメータが指定され、その後、置換文字列であり、実際には、MIMEヘッダとコンテンツの両方を含む、[RFC2045]で定義されるようにMIMEエンティティ、セクション2.4、。"
    },
    {
      "indent": 3,
      "text": "If the entire message is being replaced, the optional \":subject\" parameter specifies a subject line to attach to the message that is generated. UTF-8 characters can be used in the string argument; implementations MUST convert the string to [RFC2047]-encoded words if and only if non-ASCII characters are present. If the \":subject\" parameter is used, implementations MUST preserve any previous Subject header as an Original-Subject header. Implementations MUST preserve all other header fields from the original message with the exception of those relating to the MIME structure that is being replaced.",
      "ja": "メッセージ全体が交換されている場合は、オプションの「：件名」パラメータは、生成されたメッセージに添付する件名を指定します。 UTF-8文字は、文字列引数で使用することができます。非ASCII文字が存在している場合にだけ実装は、[RFC2047]エンコードさ言葉に文字列を変換する必要があります。 「被験者」場合のパラメータが使用され、実装は、オリジナル・件名ヘッダとして以前件名ヘッダを保存しなければなりません。実装は、置換されているMIME構造に関連するものを除いて、元のメッセージからすべての他のヘッダフィールドを保存しなければなりません。"
    },
    {
      "indent": 3,
      "text": "If the entire message is being replaced, as an indication that the message is no longer as created by the original author of the message, the optional \":from\" parameter may be used to specify an alternate address to use in the From field of the message that is generated. The string must specify a valid [RFC5322] mailbox-list. Implementations SHOULD check the syntax and generate an error when a syntactically invalid \":from\" parameter is specified. Implementations MAY also impose restrictions on what addresses can be specified in a \":from\" parameter; it is suggested that values that fail such a validity check simply be ignored rather than causing the \"replace\" action to fail. If the From header is changed, implementations MUST preserve the previous From header as an Original-From header.",
      "ja": "全体のメッセージは、メッセージの元の作成者によって作成されたメッセージがもはやであることを示すものとして、任意に置換されている場合は「：から」パラメータはのフィールドで使用する代替アドレスを指定するために使用することができます生成されるメッセージ。文字列が有効な[RFC5322]メールボックスのリストを指定する必要があります。実装は、構文をチェックして、構文的に無効なときにエラーを生成する必要があります「：から」パラメータが指定されています。また、実装はアドレスで指定することができるものに制限課すことがあります。パラメータ「からの」;このような妥当性チェックに失敗した値は、単に、むしろ「置き換え」アクションが失敗する原因よりも無視されることが示唆されます。ヘッダから変更された場合、実装は、原稿からヘッダなどのヘッダから以前に保存しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Implementations that support the \"editheader\" extension [RFC5293] MUST ensure that any Original-Subject or Original-From headers added by the system cannot be modified or removed. Implementations MAY prevent the addition of Original-Subject and Orignal-From headers via the \"editheader\" extension.",
      "ja": "「editheader」拡張[RFC5293]をサポートする実装は、任意の対象原稿または原稿からシステムによって追加されたヘッダが変更または削除されないことを保証しなければなりません。実装は、元の件名とのorignal-からヘッダを経由して「editheader」拡張子の追加を防ぐことができます。"
    },
    {
      "indent": 3,
      "text": "If \":mime\" is specified and either \":subject\" or \":from\" is specified, the \":subject:\" or \":from\" parameter MUST be ignored. This SHOULD be flagged as a compilation error.",
      "ja": "場合は「：パントマイム」に指定されており、いずれかの「：対象」または「：から」指定され、「：件名：」または「：から」パラメータは無視しなければなりません。これは、コンパイルエラーとしてフラグ付けされるべきである（SHOULD）。"
    },
    {
      "indent": 0,
      "text": "6. Action \"enclose\"",
      "section_title": true,
      "ja": "6.アクション「囲み」"
    },
    {
      "indent": 3,
      "text": "Usage: enclose <:subject string> <:headers string-list> string",
      "ja": "使用方法：<：対象文字列> <：ヘッダ文字列リスト>の文字列を囲みます"
    },
    {
      "indent": 3,
      "text": "A new Sieve action command is defined to allow an entire message to be enclosed as an attachment to a new message. After enclosure, subsequent actions affecting the message header or content, as well as tests operating on the MIME structure or accessing MIME header fields, use the newly created message instead of the original message; this means that any use of a \"replace\" action or other similar actions should be executed before the \"enclose\" action.",
      "ja": "新しいふるいアクションコマンドは、全体のメッセージが新しいメッセージの添付ファイルとして封入することができるように定義されます。エンクロージャ後、後続のアクションではなく、元のメッセージの新しく作成されたメッセージを使用して、同様に試験がMIME構造上で動作又はMIMEヘッダフィールドにアクセスし、メッセージヘッダーまたはコンテンツに影響を与えます。これは、「置き換え」アクションまたは他の同様のアクションのいずれかの使用は、「囲み」アクションの前に実行されなければならないことを意味しています。"
    },
    {
      "indent": 3,
      "text": "If multiple \"enclose\" actions are executed by a script, the message is enclosed multiple times. (If a Sieve script desires to choose between different enclosures, or wants to delay the enclosure to the end of the script, it can use variables with appropriate tests [RFC5229].)",
      "ja": "複数の「囲み」アクションがスクリプトによって実行された場合は、メッセージが複数回囲まれています。 （Sieveスクリプトは、異なる筐体間で選択することを望む、またはスクリプトの最後にエンクロージャを遅らせたい場合は、適切な試験[RFC5229]の変数を使用することができます。）"
    },
    {
      "indent": 3,
      "text": "This action does not affect messages that are forwarded via a \"redirect\" action.",
      "ja": "このアクションは、「リダイレクト」アクションを介して転送されるメッセージには影響しません。"
    },
    {
      "indent": 3,
      "text": "Specifically, the original message becomes a multipart/mixed message with two parts: a text/plain portion with the string argument as its body, and a message/rfc822 portion with the original message enclosed. The Content-Type: header field becomes multipart/mixed. The optional Subject: header is specified by the \":subject\" argument; if not present, the subject will be taken from the enclosed message. Any headers specified by \":headers\" are copied from the old message into the new message. If not specified by \":headers\", Date: and From: headers should be synthesized to reflect the current date and the user running the Sieve action.",
      "ja": "その本体として文字列引数、および添付元のメッセージのメッセージ/ RFC822部分とtext / plainの部分：具体的には、元のメッセージは、次の2つの部分と混合/マルチパートメッセージになります。 Content-Type：ヘッダフィールドは、混合/マルチなります。オプションの件名：「被験者」ヘッダで指定される引数。存在しない場合、被験者は、同封のメッセージから取得されます。で指定した任意のヘッダ「：ヘッダーには、」新しいメッセージに古いメッセージからコピーされます。で指定されていない場合は「：ヘッダ」、日付：から：ヘッダは、現在の日付とSieveアクションを実行しているユーザーを反映するために合成されなければなりません。"
    },
    {
      "indent": 0,
      "text": "7. Action \"extracttext\"",
      "section_title": true,
      "ja": "7.アクション \"extracttext\""
    },
    {
      "indent": 3,
      "text": "Usage: extracttext [MODIFIER] [\":first\" number] <varname: string>",
      "ja": "用法：extracttext [MODIFIER] [ \"：最初の\" 数] <VARNAME：文字列>"
    },
    {
      "indent": 3,
      "text": "The \"extracttext\" action may be used within the context of a \"foreverypart\" loop and is used to store text into a variable as defined by [RFC5229]. Servers MUST support transcoding of any textual body part into UTF-8 for use with this action. This requires decoding any transfer encoding as well as transcoding from the indicated character set into UTF-8. It stores at most \":first\" characters of the transcoded content of the current MIME body part in the variable identified by varname. If the \":first\" parameter is not present, the whole content of the current MIME body part is stored. In either case, the actually stored data MAY be truncated to conform to implementation specific limit on variable length and/or on MIME body part length. If the transfer encoding or character set is unrecognized by the implementation or recognized but invalid, an empty string will result.",
      "ja": "「extracttext」アクション「はforeverypart」ループと[RFC5229]で定義されるような変数にテキストを格納するために使用されるの文脈内で使用されてもよいです。サーバはこのアクションで使用するためにUTF-8に任意のテキストのボディ部のトランスコーディングをサポートしなければなりません。これは、UTF-8に設定示す文字から任意の転送エンコーディングならびにトランスコードを復号化が必要です。それは、ほとんどの店「：最初の」VARNAMEによって識別される変数の現在のMIMEボディ部のトランスコード内容の文字を。 「：最初の」場合はパラメータが存在しない場合、現在のMIMEボディ部の全体の内容が保存されています。いずれの場合においても、実際に格納されたデータは、可変長で実装固有の限界および/またはMIME本体部長さに適合するように切り捨てられる場合があります。転送エンコーディングや文字セットが実装によって認識できないか、認識していても無効である場合、空の文字列が発生します。"
    },
    {
      "indent": 3,
      "text": "If \"extracttext\" is used outside the context of a \"foreverypart\" loop, the action will set the variable identified by varname to the empty string. This SHOULD be flagged as a compilation error.",
      "ja": "「extracttextは」「foreverypart」ループのコンテキスト外で使用されている場合は、アクションは空の文字列にvarnameということで識別される変数を設定します。これは、コンパイルエラーとしてフラグ付けされるべきである（SHOULD）。"
    },
    {
      "indent": 3,
      "text": "Modifiers are applied on the extracted text before it is stored in the variable.",
      "ja": "それは、変数に格納される前に修飾子は、抽出されたテキストに適用されます。"
    },
    {
      "indent": 0,
      "text": "8. Sieve Capability Strings",
      "section_title": true,
      "ja": "8.ふるい能力の文字列"
    },
    {
      "indent": 3,
      "text": "A Sieve implementation that defines the \"foreverypart\" and \"break\" actions will advertise the capability string \"foreverypart\".",
      "ja": "「foreverypart」と「休憩」アクションを定義ふるいの実装は、能力、文字列「foreverypart」をアドバタイズします。"
    },
    {
      "indent": 3,
      "text": "A Sieve implementation that defines the \":mime\" and \":anychild\" tagged arguments to the \"header\", \"address\", and \"exists\" commands will advertise the capability string \"mime\".",
      "ja": "「MIME」と定義ふるいの実装「：anychild」は、「ヘッダ」、「住所」、およびコマンドは能力ストリングをアドバタイズします「有り」「MIME」に引数をタグ付けされました。"
    },
    {
      "indent": 3,
      "text": "A Sieve implementation that defines the \"replace\" action will advertise the capability string \"replace\".",
      "ja": "アクションを「置き換え」を定義ふるいの実装では、「置換」機能の文字列をアドバタイズします。"
    },
    {
      "indent": 3,
      "text": "A Sieve implementation that defines the \"enclose\" action will advertise the capability string \"enclose\".",
      "ja": "「同封」アクションは機能文字列をアドバタイズします定義ふるいの実装では、「囲み」。"
    },
    {
      "indent": 3,
      "text": "A Sieve implementation that defines the \"extracttext\" action will advertise the capability string \"extracttext\". Note that to be useful, the \"extracttext\" action also requires the \"variables\" [RFC5229] and \"foreverypart\" capabilities.",
      "ja": "機能文字列「extracttextを」アドバタイズします「extracttext」アクションを定義ふるいの実装。有用であることなお、「extracttext」アクションも、「変数」[RFC5229]と「foreverypart」機能を必要とします。"
    },
    {
      "indent": 0,
      "text": "9. Examples",
      "section_title": true,
      "ja": "9.例"
    },
    {
      "indent": 0,
      "text": "9.1. Example 1",
      "section_title": true,
      "ja": "9.1。例1"
    },
    {
      "indent": 3,
      "text": "Consider a Sieve script to replace some of the Windows executable attachments in a message. (The actual list of executable types and extensions is considerably longer and constantly changing. The tests shown here are an example only.) Such a script might look like this:",
      "ja": "メッセージ内のWindows実行ファイルの添付ファイルの一部を置き換えるためにSieveスクリプトを考えてみましょう。 （。。実行ファイルの種類と拡張子の実際のリストはかなり長いですし、常に変化し、ここで示したテストはあくまでも一例です）このようなスクリプトは次のようになります。"
    },
    {
      "indent": 3,
      "text": "require [ \"foreverypart\", \"mime\", \"replace\" ];\nforeverypart\n{\n  if anyof (\n         header :mime :contenttype :is\n           \"Content-Type\" \"application/exe\",\n         header :mime :param \"filename\"\n           :matches [\"Content-Type\", \"Content-Disposition\"] \"*.com\" )\n  {\n    replace \"Executable attachment removed by user filter\";\n  }\n}",
      "raw": true
    },
    {
      "indent": 0,
      "text": "9.2. Example 2",
      "section_title": true,
      "ja": "9.2。例2"
    },
    {
      "indent": 3,
      "text": "Consider a Sieve script to warn the user about some of the executable attachment types. (The actual list of executable types and extensions is considerably longer and constantly changing. The tests shown here are an example only.) Such a script might look like this:",
      "ja": "実行可能な添付ファイルの種類のいくつかについてユーザーに警告するためにSieveスクリプトを考えてみましょう。 （。。実行ファイルの種類と拡張子の実際のリストはかなり長いですし、常に変化し、ここで示したテストはあくまでも一例です）このようなスクリプトは次のようになります。"
    },
    {
      "indent": 3,
      "text": "require [ \"foreverypart\", \"mime\", \"enclose\" ];",
      "ja": "[ \"foreverypart\"、 \"パントマイム\"、 \"囲み\"]が必要です。"
    },
    {
      "indent": 3,
      "text": "foreverypart { if header :mime :param \"filename\" :matches [\"Content-Type\", \"Content-Disposition\"] [\"*.com\", \"*.exe\", \"*.vbs\", \"*.scr\", \"*.pif\", \"*.hta\", \"*.bat\", \"*.zip\" ] { # these attachment types are executable enclose :subject \"Warning\" :text WARNING! The enclosed message contains executable attachments. These attachment types may contain a computer virus program that can infect your computer and potentially damage your data.",
      "ja": "foreverypart {もし、ヘッダ：MIME：PARAM \"ファイル名\"：マッチ[ \"コンテンツタイプ\"、 \"コンテンツの廃棄\"] [ \"* .COM\"、 \"* .EXE\"、 \"* .VBS\"、 \"* .SCR\" 、 \"* .PIF\"、 \"* .HTA\" は、 \"*。bat\" と、 \"* .zipファイル\"] {＃これらの添付ファイルの種類は、実行可能同封されている：件名 \"警告\"：テキストWARNING！囲まれたメッセージは、実行可能な添付ファイルが含まれています。これらの添付ファイルの種類は、お使いのコンピュータに感染し、潜在的にあなたのデータに損傷を与えることができるコンピュータウイルスプログラムが含まれていてもよいです。"
    },
    {
      "indent": 3,
      "text": "Before clicking on these message attachments, you should verify with the sender that this message was sent by them and not a computer virus.",
      "ja": "これらのメッセージの添付ファイルをクリックする前に、このメッセージは、コンピュータウイルスをそれらによって送信されていなかった送信者に確認してください。"
    },
    {
      "indent": 3,
      "text": ".\n;\n    break;\n  }\n}",
      "raw": true
    },
    {
      "indent": 0,
      "text": "9.3. Example 3",
      "section_title": true,
      "ja": "9.3。例3"
    },
    {
      "indent": 3,
      "text": "A Sieve script to extract subject and text out of messages from the boss might look like this:",
      "ja": "上司からのメッセージのうち、件名とテキストを抽出するためにSieveスクリプトは次のようになります。"
    },
    {
      "indent": 3,
      "text": "require [\"mime\", \"variables\", \"extracttext\"];",
      "ja": "[ \"MIME\"、 \"変数\"、 \"extracttext\"]が必要です。"
    },
    {
      "indent": 3,
      "text": "if header :contains \"from\" \"boss@example.org\" { # :matches is used to get the value of the Subject header if header :matches \"Subject\" \"*\" { set \"subject\" \"${1}\"; }",
      "ja": "ヘッダがあれば：boss@example.org「「から」含有」{＃：マッチは、ヘッダ場合件名ヘッダの値を取得するために使用される：マッチ「テーマ」「*」{「$ {1}」「対象」に設定。 }"
    },
    {
      "indent": 5,
      "text": "# extract the first 100 characters of the first text/* part\nforeverypart\n{\n  if header :mime :type :is \"Content-Type\" \"text\"\n  {\n    extracttext :first 100 \"msgcontent\";\n    break;\n  }\n}",
      "raw": true
    },
    {
      "indent": 3,
      "text": " # if it's not a 'for your information' message if not header :contains \"subject\" \"FYI:\" { # do something using ${subject} and ${msgcontent} # such as sending a notification using a # notification extension } }",
      "ja": "＃それはヘッダでない場合は、「あなたの情報のために」というメッセージがない場合は：FYI「件名」、「含まれています：」{＃何か使用して$ {対象}と、このような＃通知の拡張機能を使用して通知を送信するように$ {msgcontent}＃}}"
    },
    {
      "indent": 0,
      "text": "10. Acknowledgements",
      "section_title": true,
      "ja": "10.謝辞"
    },
    {
      "indent": 3,
      "text": "Comments from members of the MTA Filters Working Group, in particular Ned Freed, Kjetil Torgrim Homme, Mark Mallett, Alexey Melnikov, Aaron Stone, and Nigel Swinson are gratefully acknowledged.",
      "ja": "MTAのメンバーからのコメントはワーキンググループ、特にネッド・フリード、はKjetil Torgrimオム、マーク・マレット、アレクセイ・メルニコフ、アーロン・ストーン、そしてナイジェルSwinsonは深く感謝しているフィルタリングします。"
    },
    {
      "indent": 0,
      "text": "11. Security Considerations",
      "section_title": true,
      "ja": "11.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "The \"enclose\" action creates an entirely new message, as compared to just redirecting or forwarding the existing message. Therefore, any site policies applicable to message submission should be enforced.",
      "ja": "「囲み」アクションは、単に既存のメッセージをリダイレクトまたは転送と比較して、全く新しいメッセージを作成します。そのため、メッセージの提出に適用任意のサイトポリシーが適用されなければなりません。"
    },
    {
      "indent": 3,
      "text": "The looping specification specified here provides easier access to information about the message contents, which may also be achieved through other sieve tests. This is not believed to raise any additional security issues beyond those for the Sieve \"envelope\" and \"body\" [RFC5173] tests.",
      "ja": "ここで指定されたループ仕様は、他のふるい試験を介して達成することができるメッセージの内容に関する情報に簡単にアクセスを提供します。これをふるい、「エンベロープ」と「身体」[RFC5173]テスト用のものを超えて追加のセキュリティ上の問題を提起することは考えられません。"
    },
    {
      "indent": 3,
      "text": "Any change in message content may interfere with digital signature mechanisms that include that content in the signed material. In particular, using \"replace\" makes direct changes to the body content and will affect the body hash included in Domain Keys Identified Mail (DKIM) signatures [RFC4871], or the message signature used for Secure MIME (S/MIME) [RFC3851], Pretty Good Privacy (PGP) [RFC1991] or OpenPGP [RFC4880].",
      "ja": "メッセージ内容の変更は、署名された材料で、そのコンテンツを含むデジタル署名メカニズムを妨害する可能性があります。具体的には、「交換」を使用して本文の内容に直接変更を行い、本体ハッシュドメインキーでセキュアMIME（S / MIME）[RFC3851]のために使用される識別メール（DKIM）署名[RFC4871]、またはメッセージの署名を含ま影響しますプリティグッドプライバシー（PGP）[RFC1991]かのOpenPGP [RFC4880]。"
    },
    {
      "indent": 3,
      "text": "It is not possible to examine the MIME structure of decrypted content in a multipart/encrypted MIME part.",
      "ja": "マルチパート/暗号化されたMIME部分に復号化されたコンテンツのMIME構造を調べることはできません。"
    },
    {
      "indent": 3,
      "text": "When \"enclose\" is used on a message containing a multipart/signed MIME part, the Sieve implementation MUST ensure that the original message is copied octet-for-octet to maintain the validity of the digital signature.",
      "ja": "「囲む」マルチパート/署名されたMIMEパートを含むメッセージで使用される場合、ふるいの実装では、元のメッセージは、デジタル署名の有効性を維持するためにオクテットのためのオクテットをコピーしていることを確認しなければなりません。"
    },
    {
      "indent": 3,
      "text": "The system MUST be sized and restricted in such a manner that even malicious use of MIME part matching does not deny service to other users of the host system.",
      "ja": "システムは、サイズやMIMEパートマッチングのも、悪質な使用は、ホストシステムの他のユーザーにサービスを否定するものではないように制限しなければなりません。"
    },
    {
      "indent": 3,
      "text": "All of the security considerations given in the base Sieve specification also apply to these extensions.",
      "ja": "基本ふるい仕様で与えられたセキュリティ上の考慮事項のすべては、これらの拡張機能に適用されます。"
    },
    {
      "indent": 0,
      "text": "12. IANA Considerations",
      "section_title": true,
      "ja": "12. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "The Original-Subject and Original-From headers have been registered in the Permanent Message Header Fields registry.",
      "ja": " - 元の件名とオリジナル-からヘッダは永久メッセージヘッダフィールドのレジストリに登録されています。"
    },
    {
      "indent": 3,
      "text": "The following templates specify the IANA registrations of the Sieve extensions specified in this document. This information has been added to the IANA registry of Sieve Extensions (currently found at http://www.iana.org).",
      "ja": "以下のテンプレートは、この文書で指定されたSieve拡張のIANA登録を指定します。この情報は、（現在http://www.iana.orgで発見）ふるい拡張のIANAレジストリに追加されました。"
    },
    {
      "indent": 0,
      "text": "12.1. foreverypart capability",
      "section_title": true,
      "ja": "12.1。 foreverypart機能"
    },
    {
      "indent": 3,
      "text": "To: iana@iana.org Subject: Registration of new Sieve extension",
      "ja": "To：iana@iana.org件名：新しいふるい拡張の登録"
    },
    {
      "indent": 3,
      "text": "Capability name: foreverypart Description: adds the \"foreverypart\" and \"break\" actions for iterating through MIME parts of a message.",
      "ja": "能力名：foreverypart説明：「foreverypart」とのメッセージのMIME部分を反復処理するための「休憩」アクションを追加します。"
    },
    {
      "indent": 3,
      "text": "RFC number: RFC 5703 Contact address: The Sieve discussion list <ietf-mta-filters@imc.org>.",
      "ja": "RFC番号：RFC 5703連絡先アドレス：ふるいディスカッションリスト<ietf-mta-filters@imc.org>。"
    },
    {
      "indent": 0,
      "text": "12.2. mime capability",
      "section_title": true,
      "ja": "12.2。 MIME機能"
    },
    {
      "indent": 3,
      "text": "To: iana@iana.org Subject: Registration of new Sieve extension",
      "ja": "To：iana@iana.org件名：新しいふるい拡張の登録"
    },
    {
      "indent": 3,
      "text": "Capability name: mime Description: adds the \":mime\" and \":anychild\" tagged arguments to the \"header\", \"address\", and \"exists\" tests. Adds the \":type\", \":subtype\", \":contenttype\", and \":param\" options when \":mime\" is used with the \"header\" test.",
      "ja": "機能名：MIME説明：「：MIME」と「：anychild」「ヘッダ」、「アドレス」に引数をタグ付けし、そしてテストを「存在」を加算します。追加「タイプ」、「サブタイプ」、「：のContentType」、及び「：PARAM」オプションと、「：MIME」は、「ヘッダ」試験で使用されています。"
    },
    {
      "indent": 3,
      "text": "RFC number: RFC 5703 Contact address: The Sieve discussion list <ietf-mta-filters@imc.org>.",
      "ja": "RFC番号：RFC 5703連絡先アドレス：ふるいディスカッションリスト<ietf-mta-filters@imc.org>。"
    },
    {
      "indent": 0,
      "text": "12.3. replace capability",
      "section_title": true,
      "ja": "12.3。機能を置き換えます"
    },
    {
      "indent": 3,
      "text": "To: iana@iana.org Subject: Registration of new Sieve extension",
      "ja": "To：iana@iana.org件名：新しいふるい拡張の登録"
    },
    {
      "indent": 3,
      "text": "Capability name: replace Description: adds the \"replace\" action for replacing a MIME body part of a message.",
      "ja": "能力名：説明を置き換えるには：メッセージのMIMEボディ部を交換するための「置き換え」アクションを追加します。"
    },
    {
      "indent": 3,
      "text": "RFC number: RFC 5703 Contact address: The Sieve discussion list <ietf-mta-filters@imc.org>.",
      "ja": "RFC番号：RFC 5703連絡先アドレス：ふるいディスカッションリスト<ietf-mta-filters@imc.org>。"
    },
    {
      "indent": 0,
      "text": "12.4. enclose capability",
      "section_title": true,
      "ja": "12.4。機能を同封"
    },
    {
      "indent": 3,
      "text": "To: iana@iana.org Subject: Registration of new Sieve extension",
      "ja": "To：iana@iana.org件名：新しいふるい拡張の登録"
    },
    {
      "indent": 3,
      "text": "Capability name: enclose Description: adds the \"enclose\" action for enclosing a message with a wrapper.",
      "ja": "能力名：説明を囲みは：ラッパーでメッセージを囲むための「同封」アクションを追加します。"
    },
    {
      "indent": 3,
      "text": "RFC number: RFC 5703 Contact address: The Sieve discussion list <ietf-mta-filters@imc.org>.",
      "ja": "RFC番号：RFC 5703連絡先アドレス：ふるいディスカッションリスト<ietf-mta-filters@imc.org>。"
    },
    {
      "indent": 0,
      "text": "12.5. extracttext capability",
      "section_title": true,
      "ja": "12.5。 extracttext機能"
    },
    {
      "indent": 3,
      "text": "To: iana@iana.org Subject: Registration of new Sieve extension",
      "ja": "To：iana@iana.org件名：新しいふるい拡張の登録"
    },
    {
      "indent": 3,
      "text": "Capability name: extracttext Description: adds the \"extracttext\" action for extracting text from a",
      "ja": "能力名：extracttext説明：からテキストを抽出するための「extracttext」アクションを追加します"
    },
    {
      "indent": 3,
      "text": "MIME body part.",
      "ja": "MIMEボディ部。"
    },
    {
      "indent": 3,
      "text": "RFC number: RFC 5703 Contact address: The Sieve discussion list <ietf-mta-filters@imc.org>.",
      "ja": "RFC番号：RFC 5703連絡先アドレス：ふるいディスカッションリスト<ietf-mta-filters@imc.org>。"
    },
    {
      "indent": 0,
      "text": "13. References",
      "section_title": true,
      "ja": "13.参考文献"
    },
    {
      "indent": 0,
      "text": "13.1. Normative References",
      "section_title": true,
      "ja": "13.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2045] Freed, N. and N. Borenstein, \"Multipurpose Internet Mail Extensions (MIME) Part One: Format of Internet Message Bodies\", RFC 2045, November 1996.",
      "ja": "[RFC2045]解放され、N.とN. Borenstein、 \"マルチパーパスインターネットメールエクステンション（MIME）第一部：インターネットメッセージ本体のフォーマット\"、RFC 2045、1996年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC2047] Moore, K., \"MIME (Multipurpose Internet Mail Extensions) Part Three: Message Header Extensions for Non-ASCII Text\", RFC 2047, November 1996.",
      "ja": "[RFC2047]ムーア、K.、 \"MIME（多目的インターネットメール拡張）パート3：非ASCIIテキストのためのメッセージヘッダの拡張\"、RFC 2047、1996年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2231] Freed, N. and K. Moore, \"MIME Parameter Value and Encoded Word Extensions: Character Sets, Languages, and Continuations\", RFC 2231, November 1997.",
      "ja": "[RFC2231]解放され、N.とK.ムーア、 \"MIMEパラメータ値およびエンコードされたWordの機能拡張：文字セット、言語、および継続の\"、RFC 2231、1997年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC3629] Yergeau, F., \"UTF-8, a transformation format of ISO 10646\", STD 63, RFC 3629, November 2003.",
      "ja": "[RFC3629] Yergeau、F.、 \"UTF-8、ISO 10646の変換フォーマット\"、STD 63、RFC 3629、2003年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC5173] Degener, J. and P. Guenther, \"Sieve Email Filtering: Body Extension\", RFC 5173, April 2008.",
      "ja": "[RFC5173] Degener、J.とP.ギュンター、 \"ふるいメールフィルタリング：ボディ延長\"、RFC 5173、2008年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC5228] Guenther, P. and T. Showalter, \"Sieve: An Email Filtering Language\", RFC 5228, January 2008.",
      "ja": "[RFC5228]ギュンター、P.およびT.ショーウォルター監督、 \"ふるい：メールフィルタリング言語\"、RFC 5228、2008年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC5229] Homme, K., \"Sieve Email Filtering: Variables Extension\", RFC 5229, January 2008.",
      "ja": "[RFC5229]オム、K.、 \"ふるいメールフィルタリング：変数の拡張\"、RFC 5229、2008年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC5231] Segmuller, W. and B. Leiba, \"Sieve Email Filtering: Relational Extension\", RFC 5231, January 2008.",
      "ja": "[RFC5231] Segmuller、W.及びB. Leiba、 \"ふるいメールフィルタリング：リレーショナル拡張\"、RFC 5231、2008年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC5293] Degener, J. and P. Guenther, \"Sieve Email Filtering: Editheader Extension\", RFC 5293, August 2008.",
      "ja": "[RFC5293] Degener、J.とP.ギュンター、 \"ふるいメールフィルタリング：Editheader拡張\"、RFC 5293、2008年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC5322] Resnick, P., Ed., \"Internet Message Format\", RFC 5322, October 2008.",
      "ja": "[RFC5322]レズニック、P.、エド。、 \"インターネットメッセージ形式\"、RFC 5322、2008年10月。"
    },
    {
      "indent": 0,
      "text": "13.2. Informative References",
      "section_title": true,
      "ja": "13.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC1991] Atkins, D., Stallings, W., and P. Zimmermann, \"PGP Message Exchange Formats\", RFC 1991, August 1996.",
      "ja": "[RFC1991]アトキンス、D.、ストーリングス、W.、およびP.ツィンマーマン、 \"PGPメッセージ交換フォーマット\"、RFC 1991、1996年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC3851] Ramsdell, B., \"Secure/Multipurpose Internet Mail Extensions (S/MIME) Version 3.1 Message Specification\", RFC 3851, July 2004.",
      "ja": "[RFC3851] Ramsdell、B.、 \"/セキュア多目的インターネットメール拡張（S / MIME）バージョン3.1メッセージ仕様\"、RFC 3851、2004年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC4871] Allman, E., Callas, J., Delany, M., Libbey, M., Fenton, J., and M. Thomas, \"DomainKeys Identified Mail (DKIM) Signatures\", RFC 4871, May 2007.",
      "ja": "[RFC4871]オールマン、E.、カラス、J.、デラニー、M.、リビー、M.、フェントン、J.、およびM.トーマス、 \"ドメインキーを識別メール（DKIM）署名\"、RFC 4871、2007年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC4880] Callas, J., Donnerhacke, L., Finney, H., Shaw, D., and R. Thayer, \"OpenPGP Message Format\", RFC 4880, November 2007.",
      "ja": "[RFC4880]カラス、J.、Donnerhacke、L.、フィニー、H.、ショー、D.、およびR.セイヤー、 \"OpenPGPのメッセージフォーマット\"、RFC 4880、2007年11月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Tony Hansen AT&T Laboratories 200 Laurel Ave. Middletown, NJ 07748 USA",
      "ja": "トニー・ハンセンAT＆T研究所200ローレルアベニュー。ミドルタウン、NJ 07748 USA"
    },
    {
      "indent": 3,
      "text": "EMail: tony+sieveloop@maillennium.att.com",
      "ja": "メールアドレス：tony+sieveloop@maillennium.att.com"
    },
    {
      "indent": 3,
      "text": "Cyrus Daboo Apple Inc. 1 Infinite Loop Cupertino, CA 95014 USA",
      "ja": "サイラスDabooされたApple Inc. 1無限ループクパチーノ、CA 95014 USA"
    },
    {
      "indent": 3,
      "text": "EMail: cyrus@daboo.name URI: http://www.apple.com/",
      "ja": "電子メール：cyrus@daboo.name URI：http://www.apple.com/"
    }
  ]
}