{
  "title": {
    "text": "RFC 3311 - The Session Initiation Protocol (SIP) UPDATE Method",
    "ja": "RFC 3311 - セッション開始プロトコル（SIP）UPDATEメソッド"
  },
  "number": 3311,
  "created_at": "2019-10-26 16:33:32.684312+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                       J. Rosenberg\nRequest for Comments: 3311                                   dynamicsoft\nCategory: Standards Track                                 September 2002",
      "raw": true
    },
    {
      "indent": 10,
      "text": "The Session Initiation Protocol (SIP) UPDATE Method",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2002). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2002）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This specification defines the new UPDATE method for the Session Initiation Protocol (SIP). UPDATE allows a client to update parameters of a session (such as the set of media streams and their codecs) but has no impact on the state of a dialog. In that sense, it is like a re-INVITE, but unlike re-INVITE, it can be sent before the initial INVITE has been completed. This makes it very useful for updating session parameters within early dialogs.",
      "ja": "この仕様は、セッション開始プロトコル（SIP）のための新しいUPDATEメソッドを定義します。 UPDATEは、クライアントが（例えば、メディアストリームとそのコーデックのセットなど）セッションのパラメータを更新することを可能にするが、ダイアログの状態に影響を及ぼしません。再INVITEのようなその意味で、それはあるが、初期INVITEを完了する前に再INVITEとは異なり、それが送信することができます。これはearlyダイアログ内セッションパラメータを更新するための、それは非常に便利になります。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1    Introduction ..............................................    2\n2    Terminology ...............................................    3\n3    Overview of Operation .....................................    3\n4    Determining Support for this Extension ....................    3\n5    UPDATE Handling ...........................................    4\n5.1  Sending an UPDATE .........................................    4\n5.2  Receiving an UPDATE .......................................    5\n5.3  Processing the UPDATE Response ............................    6\n6    Proxy Behavior ............................................    7\n7    Definition of the UPDATE method ...........................    7\n8    Example Call Flow .........................................    7\n9    Security Considerations ...................................   11\n10   IANA Considerations .......................................   11\n11   Notice Regarding Intellectual Property Rights .............   11\n12   Normative References ......................................   11\n13   Acknowledgements ..........................................   12\n14   Author's Address ..........................................   12\n15   Full Copyright Statement ..................................   13",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1 Introduction",
      "ja": "1はじめに"
    },
    {
      "indent": 3,
      "text": "The Session Initiation Protocol (SIP) [1] defines the INVITE method for the initiation and modification of sessions. However, this method actually affects two important pieces of state. It impacts the session (the media streams SIP sets up) and also the dialog (the state that SIP itself defines). While this is reasonable in many cases, there are important scenarios in which this coupling causes complications.",
      "ja": "セッション開始プロトコル（SIP）[1]はセッションの開始および修正のためにINVITEメソッドを定義します。しかし、この方法では、実際に状態の二つの重要な部分に影響を与えます。その影響セッション（メディアはSIPが設定ストリーム）ともダイアログ（SIP自身が定義した状態）。これは多くの場合、合理的であるが、このカップリングは、合併症を引き起こすのに重要なシナリオがあります。"
    },
    {
      "indent": 3,
      "text": "The primary difficulty is when aspects of the session need to be modified before the initial INVITE has been answered. An example of this situation is \"early media\", a condition where the session is established, for the purpose of conveying progress of the call, but before the INVITE itself is accepted. It is important that either caller or callee be able to modify the characteristics of that session (putting the early media on hold, for example), before the call is answered. However, a re-INVITE cannot be used for this purpose, because the re-INVITE has an impact on the state of the dialog, in addition to the session.",
      "ja": "セッションの側面が初期が回答されているINVITE前に変更する必要がある場合に主要な困難があります。このような状況の例は、コールの進行状況を伝えるために、「初期メディア」、セッションが確立された状態であるが、それ自体をINVITEが受け入れられる前に。コールが応答される前に、（例えば、保留に初期メディアを入れて）、呼び出し元または呼び出し先のどちらかが、そのセッションの特性を変更することができることが重要です。セッションに加えて、ダイアログの状態に影響を与える再INVITEしかし、この目的のために使用することができない再INVITE。"
    },
    {
      "indent": 3,
      "text": "As a result, a solution is needed that allows the caller or callee to provide updated session information before a final response to the initial INVITE request is generated. The UPDATE method, defined here, fulfills that need. It can be sent by a UA within a dialog (early or confirmed) to update session parameters without impacting the dialog state itself.",
      "ja": "その結果、溶液は、呼び出し元または呼び出し先が初期INVITE要求が発生すると、最終的な応答の前に更新されたセッション情報を提供することを可能にすることが必要です。ここで定義されたUPDATEメソッドは、その必要性を満たすものです。対話状態自体に影響を与えることなく、セッションパラメータを更新する（早いか確認）ダイアログ内UAによって送信することができます。"
    },
    {
      "indent": 0,
      "text": "2 Terminology",
      "ja": "2用語"
    },
    {
      "indent": 3,
      "text": "In this document, the key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" are to be interpreted as described in BCP 14, RFC 2119 [2] and indicate requirement levels for compliant SIP implementations.",
      "ja": "この文書では、キーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、 \"NOT SHALL\"、 \"推奨\"、 \"すべきではない\" \"べきである\" \"ないものと\"、 \"MAY\"、および \"オプション\" BCP 14、RFC 2119に記載されているように[2]に解釈されるべきであり、準拠SIP実装の要求レベルを示します。"
    },
    {
      "indent": 0,
      "text": "3 Overview of Operation",
      "ja": "操作の3の概要"
    },
    {
      "indent": 3,
      "text": "Operation of this extension is straightforward. The caller begins with an INVITE transaction, which proceeds normally. Once a dialog is established, either early or confirmed, the caller can generate an UPDATE method that contains an SDP offer [3] for the purposes of updating the session. The response to the UPDATE method contains the answer. Similarly, once a dialog is established, the callee can send an UPDATE with an offer, and the caller places its answer in the 2xx to the UPDATE. The Allow header field is used to indicate support for the UPDATE method. There are additional constraints on when UPDATE can be used, based on the restrictions of the offer/answer model.",
      "ja": "この拡張機能の操作は簡単です。呼び出し側は正常に進行INVITEトランザクション、から始まります。ダイアログが早いか、確認のいずれか、確立されると、呼び出し側は、セッションを更新する目的で、SDPのオファー[3]を含んでUPDATEメソッドを生成することができます。 UPDATEメソッドへの応答は、答えが含まれています。ダイアログが確立されると同様に、呼び出し先が提供してUPDATEを送信することができ、かつ、発信者はUPDATEへの2xxでその答えを置きます。許可ヘッダフィールドは、UPDATEメソッドのサポートを示すために使用されます。 UPDATEはオファー/アンサーモデルの制限に基づいて、使用することができたときに追加の制約があります。"
    },
    {
      "indent": 0,
      "text": "4 Determining Support for this Extension",
      "ja": "4この拡張機能のサポートを決定"
    },
    {
      "indent": 3,
      "text": "The initiation of a session operates as specified in RFC 3261 [1]. However, a UAC compliant to this specification SHOULD also include an Allow header field in the INVITE request, listing the method UPDATE, to indicate its ability to receive an UPDATE request.",
      "ja": "セッションの開始は、RFC 3261で指定されるように動作する[1]。しかしながら、本明細書にUACの対応はまた、方法の更新をリスト、INVITE要求のヘッダフィールドを許可更新要求を受信する能力を示すために含まれるべきです。"
    },
    {
      "indent": 3,
      "text": "When a UAS compliant to this specification receives an INVITE request for a new dialog, and generates a reliable provisional response containing SDP, that response SHOULD contain an Allow header field that lists the UPDATE method. This informs the caller that the callee is capable of receiving an UPDATE request at any time. An unreliable provisional response MAY contain an Allow header field listing the UPDATE method, and a 2xx response SHOULD contain an Allow header field listing the UPDATE method.",
      "ja": "この仕様に準拠するUASは、新しいダイアログのINVITE要求を受信し、SDPを含む信頼できる暫定的な応答を生成するとき、その応答は、Updateメソッドを一覧表示できるようにヘッダーフィールドを含むべきです。これは、被呼者がいつでも更新要求を受信することができる発呼者に通知します。信頼性のない暫定応答はUPDATEメソッドをリストするAllowヘッダーフィールドを含んでいてもよく、2xx応答はUPDATEメソッドをリストするAllowヘッダーフィールドを含むべきです。"
    },
    {
      "indent": 3,
      "text": "Responses are processed normally as per RFC 3261 [1], and in the case of reliable provisional responses, according to [4]. It is important to note that a reliable provisional response will always create an early dialog at the UAC. Creation of this dialog is necessary in order to receive UPDATE requests from the callee.",
      "ja": "応答は、[4]によれば、[1]、および信頼性のある暫定応答の場合にRFC 3261に従って正常に処理されます。信頼性のある暫定応答は常にUACで早期にダイアログを作成することに注意することが重要です。このダイアログの作成は、呼び出し先からの更新要求を受信するために必要です。"
    },
    {
      "indent": 3,
      "text": "If the response contains an Allow header field containing the value \"UPDATE\", the UAC knows that the callee supports UPDATE, and the UAC is allowed to follow the procedures of Section 5.1.",
      "ja": "応答が値「UPDATE」を含むAllowヘッダーフィールドが含まれている場合、UACは、呼び出し先がUPDATEをサポートしていることを知っており、UACは、5.1節の手順に従うことを許可されています。"
    },
    {
      "indent": 0,
      "text": "5 UPDATE Handling",
      "ja": "5 UPDATEの処理"
    },
    {
      "indent": 0,
      "text": "5.1 Sending an UPDATE",
      "section_title": true,
      "ja": "5.1 UPDATEを送信"
    },
    {
      "indent": 3,
      "text": "The UPDATE request is constructed as would any other request within an existing dialog, as described in Section 12.2.1 of RFC 3261. It MAY be sent for both early and confirmed dialogs, and MAY be sent by either caller or callee. Although UPDATE can be used on confirmed dialogs, it is RECOMMENDED that a re-INVITE be used instead. This is because an UPDATE needs to be answered immediately, ruling out the possibility of user approval. Such approval will frequently be needed, and is possible with a re-INVITE.",
      "ja": "RFC 3261のセクション12.2.1で説明したようにUPDATE要求は、既存のダイアログ内の他の要求と同じように構築されたそれは、両方の早期のために送信され、ダイアログを確認し、呼び出し元または呼び出し先のどちらかによって送られるかもしれないかもしれません。 UPDATEが確認ダイアログ上で使用することができますが、再INVITE代わりに使用することをお勧めします。 UPDATEは、ユーザーの承認の可能性を排除し、即座に回答する必要があるためです。そのような承認は、頻繁に必要な、と再INVITEで可能であることになります。"
    },
    {
      "indent": 3,
      "text": "The UAC MAY add optional headers for the UPDATE request, as defined in Tables 1 and 2.",
      "ja": "表1および2に記載のUACは、UPDATE要求のオプションヘッダを加えるかもしれ。"
    },
    {
      "indent": 3,
      "text": "UPDATE is a target refresh request. As specified in RFC 3261 [1], this means that it can update the remote target of a dialog. If a UA uses an UPDATE request or response to modify the remote target while an INVITE transaction is in progress, and it is a UAS for that INVITE transaction, it MUST place the same value into the Contact header field of the 2xx to the INVITE that it placed into the UPDATE request or response.",
      "ja": "UPDATEはターゲットリフレッシュ要求です。 RFC 3261で指定されるように[1]、これはダイアログのリモートターゲットを更新することができることを意味します。 UAは、トランザクションが進行中のINVITEながら遠隔ターゲットを変更するUPDATE要求または応答を使用し、そしてそれは、INVITEトランザクションのUASである場合に、そのINVITEへの2xxのContactヘッダフィールドに同じ値を置かなければなりませんそれはUPDATE要求または応答に入れました。"
    },
    {
      "indent": 3,
      "text": "The rules for inclusion of offers and answers in SIP messages as defined in Section 13.2.1 of RFC 3261 still apply. These rules exist to guarantee a consistent view of the session state. This means that, for the caller:",
      "ja": "RFC 3261のセクション13.2.1で定義されたSIPメッセージにオファーとアンサーを含めるための規則が適用されます。これらのルールは、セッション状態の一貫したビューを保証するために存在します。これは、発信者のために、ということを意味します。"
    },
    {
      "indent": 6,
      "text": "o If the UPDATE is being sent before completion of the initial INVITE transaction, and the initial INVITE contained an offer, the UPDATE can contain an offer if the callee generated an answer in a reliable provisional response, and the caller has received answers to any other offers it sent in either PRACK or UPDATE, and has generated answers for any offers it received in an UPDATE from the callee.",
      "ja": "O UPDATEは、INVITEトランザクションの初期の完了前に送信され、そして初期の申し出を含まINVITE呼び出し先が信頼性のある暫定応答で答えを生成し、呼び出し元が、他の回答を受信した場合、UPDATEは申し出を含めることができる場合それはPRACKまたはUPDATEのいずれかで送信されていますし、それが呼び出し先からUPDATEで受信したすべての申し出のための答えを生成しました。"
    },
    {
      "indent": 6,
      "text": "o If the UPDATE is being sent before completion of the initial INVITE transaction, and the initial INVITE did not contain an offer, the UPDATE can contain an offer if the callee generated an offer in a reliable provisional response, and the UAC generated an answer in the corresponding PRACK. Of course, it can't send an UPDATE if it has not received answers to any other offers it sent in either PRACK or UPDATE, or has not generated answers for any other offers it received in an UPDATE from the callee.",
      "ja": "O UPDATEは最初のINVITEトランザクションの完了前に送信され、初期には提供が含まれていなかった呼び出し先が信頼性のある暫定応答中のオファーを生成し、UACがで答えを生成した場合、UPDATEを提示申し出を含めることができINVITE場合対応するPRACK。もちろん、それは他のどのへの回答を受信して​​いない場合には、UPDATEを送信することはできません、それはPRACKまたはUPDATEのいずれかで送信された、またはそれが呼び出し先からUPDATEで受信し、他の申し出のための答えを生成していない提供しています。"
    },
    {
      "indent": 6,
      "text": "o If the UPDATE is being sent after the completion of the initial INVITE transaction, it cannot contain an offer if the caller has generated or received offers in a re-INVITE or UPDATE which have not been answered.",
      "ja": "UPDATEが最初のINVITEトランザクションの完了後に送信されている場合は、発信者が回答されていない再INVITEまたはUPDATEでオファーを生成または受信した場合には、O、それは申し出を含めることはできません。"
    },
    {
      "indent": 3,
      "text": "and for the callee:",
      "ja": "そして、呼び出し先のために："
    },
    {
      "indent": 6,
      "text": "o If the UPDATE is being sent before the completion of the INVITE transaction, and the initial INVITE contained an offer, the UPDATE cannot be sent with an offer unless the callee has generated an answer in a reliable provisional response, has received a PRACK for that reliable provisional response, has not received any requests (PRACK or UPDATE) with offers that it has not answered, and has not sent any UPDATE requests containing offers that have not been answered.",
      "ja": "そのためにPRACKを受信した、O UPDATEが、INVITEトランザクションの完了前に送信されている場合は、初期には、呼び出し先が信頼性のある暫定応答で答えが生成されていない限り、UPDATEが提供して送信することはできません、申し出を含まINVITE信頼性のある暫定応答は、それが答えていない、と回答されていないオファーを含むいかなるUPDATEリクエストを送信していない申し出ですべての要求（PRACKまたはUPDATE）を受信して​​いません。"
    },
    {
      "indent": 6,
      "text": "o If the UPDATE is being sent before completion of the INVITE transaction, and the initial INVITE did not contain an offer, the UPDATE cannot be sent with an offer unless the callee has sent an offer in a reliable provisional response, received an answer in a PRACK, and has not received any UPDATE requests with offers that it has not answered, and has not sent any UPDATE requests containing offers that have not been answered.",
      "ja": "で答えを受け、O UPDATEが、INVITEトランザクションの完了前に送信されている場合は、呼び出し先が信頼性のある暫定応答中のオファーを送っていない限り、初期には、申し出を含んでいなかったINVITE、UPDATEを提供して送信することはできませんPRACK、それが答えていない、と回答されていないオファーを含むいかなるUPDATEリクエストを送信していない申し出で任意のUPDATE要求を受信して​​いません。"
    },
    {
      "indent": 6,
      "text": "o If the UPDATE is being sent after the completion of the initial INVITE transaction, it cannot be sent with an offer if the callee has generated or received offers in a re-INVITE or UPDATE which have not been answered.",
      "ja": "UPDATEが最初のINVITEトランザクションの完了後に送信されている場合は呼び出し先が回答されていない再INVITEまたはUPDATEでオファーを生成または受信した場合には、O、それが提供して送信することはできません。"
    },
    {
      "indent": 0,
      "text": "5.2 Receiving an UPDATE",
      "section_title": true,
      "ja": "5.2 UPDATEを受け取ります"
    },
    {
      "indent": 3,
      "text": "The UPDATE is processed as any other mid-dialog target refresh request, as described in Section 12.2.2 of RFC 3261 [1]. If the request is generally acceptable, processing continues as described below. This processing is nearly identical to that of Section 14.2 of RFC 3261 [1], but generalized for the case of UPDATE.",
      "ja": "RFC 3261のセクション12.2.2に記載されているように更新は、任意の他の中間ダイアログターゲットリフレッシュ要求として処理されている[1]。要求は、一般的に許容可能である場合、以下に記載されるように、処理が継続されます。この処理は、[1] RFC 3261のセクション14.2とほぼ同じであるが、UPDATEの場合について一般化。"
    },
    {
      "indent": 3,
      "text": "A UAS that receives an UPDATE before it has generated a final response to a previous UPDATE on the same dialog MUST return a 500 response to the new UPDATE, and MUST include a Retry-After header field with a randomly chosen value between 0 and 10 seconds.",
      "ja": "それは新しい更新する500応答を返さなければならない同じダイアログで前回の更新に最終応答を生成した、0と10秒の間でランダムに選択された値と再試行後ヘッダフィールドを含まなければならない前に、UPDATEを受信するUAS 。"
    },
    {
      "indent": 3,
      "text": "If an UPDATE is received that contains an offer, and the UAS has generated an offer (in an UPDATE, PRACK or INVITE) to which it has not yet received an answer, the UAS MUST reject the UPDATE with a 491 response. Similarly, if an UPDATE is received that contains an offer, and the UAS has received an offer (in an UPDATE, PRACK, or INVITE) to which it has not yet generated an answer, the UAS MUST reject the UPDATE with a 500 response, and MUST include a Retry-After header field with a randomly chosen value between 0 and 10 seconds.",
      "ja": "UPDATEが提供が含まれている受信され、UASはそれはまだ答えを受信して​​いないために（UPDATE、PRACKまたはINVITE）のオファーを生成した場合、UASは491応答でUPDATEを拒絶しなければなりません。 UPDATEオファーが含まれて受信された場合同様に、UASは、UASは500応答とUPDATEを拒絶しなければなりません、それはまだ答えを生成していないために（UPDATE、PRACK、またはINVITEに）提供を受けました、 0と10秒の間でランダムに選択された値と再試行の後ヘッダフィールドを含まなければなりません。"
    },
    {
      "indent": 3,
      "text": "If a UA receives an UPDATE for an existing dialog, it MUST check any version identifiers in the session description or, if there are no version identifiers, the content of the session description to see if it has changed. If the session description has changed, the UAS MUST adjust the session parameters accordingly and generate an answer in the 2xx response. However, unlike a re-INVITE, the UPDATE MUST be responded to promptly, and therefore the user cannot generally be prompted to approve the session changes. If the UAS cannot change the session parameters without prompting the user, it SHOULD reject the request with a 504 response. If the new session description is not acceptable, the UAS can reject it by returning a 488 (Not Acceptable Here) response for the UPDATE. This response SHOULD include a Warning header field.",
      "ja": "UAが既存のダイアログのUPDATEを受信した場合、何のバージョン識別子が存在しない場合は、それが変更されているかどうかを確認するために、セッション記述の内容をセッション記述における任意のバージョン識別子をチェックしたりしなければなりません。セッション記述が変更された場合、UASはそれに応じてセッションパラメータを調整し、2xx応答で答えを発生させなければなりません。再INVITEとは異なりただし、UPDATEは、速やかに対応しなければならないので、ユーザは、一般的にセッションの変更を承認するように指示することはできません。 UASは、ユーザーにメッセージを表示せずにセッションパラメータを変更できない場合、それは504応答でリクエストを拒否すべきです。新しいセッション記述が許容されていない場合、UASはUPDATEのための488（ここでは許容できない）応答を返すことで、それを拒否することができます。この応答は、警告ヘッダフィールドを含むべきです。"
    },
    {
      "indent": 0,
      "text": "5.3 Processing the UPDATE Response",
      "section_title": true,
      "ja": "5.3更新応答を処理"
    },
    {
      "indent": 3,
      "text": "Processing of the UPDATE response at the UAC follows the rules in Section 12.2.1.2 of RFC 3261 [1] for a target refresh request. Once that processing is complete, it continues as specified below. This processing is nearly identical to the processing of Section 14.1 of RFC 3261 [1], but generalized for UPDATE.",
      "ja": "UACで更新応答の処理は、ターゲットリフレッシュ要求のための[1] RFC 3261のセクション12.2.1.2のルールに従います。その処理が完了すると、以下のように指定、それが続いています。この処理は、RFC 3261のセクション14.1の処理とほぼ同一である[1]が、更新のために一般化。"
    },
    {
      "indent": 3,
      "text": "If a UA receives a non-2xx final response to a UPDATE, the session parameters MUST remain unchanged, as if no UPDATE had been issued. Note that, as stated in Section 12.2.1 of RFC 3261 [1], if the non-2xx final response is a 481 (Call/Transaction Does Not Exist), or a 408 (Request Timeout), or no response at all is received for the UPDATE (that is, a timeout is returned by the UPDATE client transaction), the UAC will terminate the dialog.",
      "ja": "UAがUPDATEに対する非2xxの最終応答を受信した場合は何もUPDATEが発行されなかったかのように、セッションパラメータは、変わらないままでなければなりません。 RFC 3261のセクション12.2.1で述べたように、非2xxの最終応答が481であれば、[1]、なお（コール/トランザクションが存在しない）、または408（要求タイムアウト）、または全く応答がありませんUPDATEのために受信（つまり、タイムアウトがUPDATEクライアントトランザクションによって返される）、UACはダイアログを終了します。"
    },
    {
      "indent": 3,
      "text": "If a UAC receives a 491 response to a UPDATE, it SHOULD start a timer with a value T chosen as follows:",
      "ja": "UACがUPDATEに491応答を受信した場合、それは次のように選択した値Tとタイマーを開始する必要があります。"
    },
    {
      "indent": 6,
      "text": "1. If the UAC is the owner of the Call-ID of the dialog ID (meaning it generated the value), T has a randomly chosen value between 2.1 and 4 seconds in units of 10 ms.",
      "ja": "1. UACは、コールID（それは値を生成意味する）ダイアログIDの所有者である場合、Tは、10ミリ秒の単位で2.1と4秒の間でランダムに選択された値を有します。"
    },
    {
      "indent": 6,
      "text": "2. If the UAC is not the owner of the Call-ID of the dialog ID, T has a randomly chosen value between 0 and 2 seconds in units of 10 ms.",
      "ja": "UACは、ダイアログIDのコールIDの所有者でない場合は2を、Tは10ミリ秒の単位で0〜2秒の間でランダムに選択された値を有しています。"
    },
    {
      "indent": 3,
      "text": "When the timer fires, the UAC SHOULD attempt the UPDATE once more, if it still desires for that session modification to take place. For example, if the call was already hung up with a BYE, the UPDATE would not take place.",
      "ja": "それはまだ場所を取るために、そのセッションの修正のために希望する場合ときにタイマーが起動、UACは、複数回UPDATEを試みるべきです。コールがすでにBYEでハングアップした場合たとえば、UPDATEは起こらないだろう。"
    },
    {
      "indent": 0,
      "text": "6 Proxy Behavior",
      "ja": "6プロキシ動作"
    },
    {
      "indent": 3,
      "text": "Proxy processing of the UPDATE request is identical to any other non-INVITE request.",
      "ja": "UPDATE要求のプロキシ処理は、他の非INVITEリクエストと同一です。"
    },
    {
      "indent": 0,
      "text": "7 Definition of the UPDATE method",
      "ja": "UPDATEメソッドの定義7"
    },
    {
      "indent": 3,
      "text": "The semantics of the UPDATE method are described in detail above. This extension adds another value to the Method BNF described in RFC 3261:",
      "ja": "UPDATEメソッドの意味は上記で詳細に説明されています。この拡張は、RFC 3261に記載された方法BNFに別の値を追加します。"
    },
    {
      "indent": 9,
      "text": "UPDATEm  =  %x55.50.44.41.54.45 ; UPDATE in caps\nMethod   =  INVITEm / ACKm / OPTIONSm / BYEm\n            / CANCELm / REGISTERm / UPDATEm\n            / extension-method",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Table 1 extends Table 2 of RFC 3261 for the UPDATE method.",
      "ja": "表1は、UPDATEメソッドは、RFC 3261の表2を拡張します。"
    },
    {
      "indent": 3,
      "text": "Table 2 updates Table 3 of RFC 3261 for the UPDATE method.",
      "ja": "UPDATEメソッドのRFC 3261の表2更新表3。"
    },
    {
      "indent": 0,
      "text": "8 Example Call Flow",
      "ja": "8例コールフロー"
    },
    {
      "indent": 3,
      "text": "This section presents an example call flow using the UPDATE method. The flow is shown in Figure 1. The caller sends an initial INVITE (1) which contains an offer. The callee generates a 180 response (2) with an answer to that offer. With the completion of an offer/answer exchange, the session is established, although the dialog is still in the early state. The caller generates a PRACK (3) to acknowledge the 180, and the PRACK is answered with a 200 OK (4). The caller decides to update some aspect of the session - to put it on hold, for example. So, they generate an UPDATE request (5) with a new offer. This offer is answered in the 200 response to the UPDATE (6). Shortly thereafter, the callee decides to update some aspect of the session, so it generates an UPDATE request (7) with an offer, and the answer is sent in the 200 response (8). Finally, the callee answers the call, resulting in a 200 OK response to the INVITE (9), and then an ACK (10). Neither the 200 OK to the INVITE, nor the ACK, will contain SDP.",
      "ja": "このセクションでは、UPDATEメソッドを使用する例のコールフローを示しています。フローは、発信者が最初の（1）オファーを含むINVITEを送信する図1に示​​されています。被呼側は、そのオファーに回答180レスポンス（2）を生成します。ダイアログが早い状態のままですが、オファー/アンサー交換が完了すると、セッションが確立されます。呼び出し側は、PRACK（3）180を確認するために生成し、PRACKは、200 OKで応答される（4）。例えば、保留にそれを置くために - 呼び出し側は、セッションのいくつかの側面を更新することを決定します。だから、彼らは新しいオファーを含むUPDATE要求（5）を生成します。このオファーは、UPDATE（6）に200応答で答えています。その後すぐに、被呼者は、それが提供してUPDATE要求（7）を生成するように、セッションのいくつかの局面を更新することを決定し、そしてその答えは200応答（8）に送られます。最後に、被呼者は200 OK応答をもたらす、呼に応答（9）INVITE、次いでACK（10）。どちらも、INVITEに対する200 OK、またACKは、SDPが含まれていません。"
    },
    {
      "indent": 15,
      "text": "Header field          where   proxy  UPDATE\n____________________________________________\nAccept                  R              o\nAccept                 2xx             o\nAccept                 415             c\nAccept-Encoding         R              o\nAccept-Encoding        2xx             o\nAccept-Encoding        415             c\nAccept-Language         R              o\nAccept-Language        2xx             o\nAccept-Language        415             c\nAlert-Info                             -\nAllow                   R              o\nAllow                  2xx             o\nAllow                   r              o\nAllow                  405             m\nAllow-Events           (1)             -\nAuthentication-Info    2xx             o\nAuthorization           R              o\nCall-ID                 c       r      m\nCall-Info                      ar      o\nContact                 R              m\nContact                1xx             o\nContact                2xx             m\nContact                3xx      d      o\nContact                485             o\nContent-Disposition                    o\nContent-Encoding                       o\nContent-Language                       o\nContent-Length                 ar      t\nContent-Type                           *\nCSeq                    c       r      m\nDate                            a      o\nError-Info           300-699    a      o\nEvent                  (1)             -\nExpires                                -\nFrom                    c       r      m\nIn-Reply-To                            -\nMax-Forwards            R      amr     m\nMin-Expires                            -\nMIME-Version                           o\nOrganization                   ar      o",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Table 1: Summary of header fields, A--O ; (1) defined in [5].",
      "ja": "表1：ヘッダーフィールドの概要、A  -  O。 （1）で定義された[5]。"
    },
    {
      "indent": 11,
      "text": "Header field              where       proxy  UPDATE\n____________________________________________________\nPriority                                       -\nProxy-Authenticate         407         ar      m\nProxy-Authenticate         401         ar      o\nProxy-Authorization         R          dr      o\nProxy-Require               R          ar      o\nRAck                        R                  -\nRecord-Route                R          ar      o\nRecord-Route             2xx,18x       mr      o\nReply-To                                       -\nRequire                                ar      c\nRetry-After          404,413,480,486           o\n                         500,503               o\n                         600,603               o\nRoute                       R          adr     c\nRSeq                        -                  -\nServer                      r                  o\nSubject                     -                  -\nSubscription-State         (1)                 -\nSupported                   R                  o\nSupported                  2xx                 o\nTimestamp                                      o\nTo                          c           r      m\nUnsupported                420                 m\nUser-Agent                                     o\nVia                         R          amr     m\nVia                        rc          dr      m\nWarning                     r                  o\nWWW-Authenticate           401         ar      m\nWWW-Authenticate           407         ar      o",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Table 2: Summary of header fields, P--Z.",
      "ja": "表2：ヘッダフィールドの概要、P  -  Z。"
    },
    {
      "indent": 16,
      "text": "Caller                        Callee\n   |                             |\n   |                             |\n   |(1) INVITE with offer 1      |\n   |---------------------------->|\n   |                             |\n   |                             |\n   |(2) 180 with answer 1        |\n   |<----------------------------|\n   |                             |\n   |                             |\n   |(3) PRACK                    |\n   |---------------------------->|\n   |                             |\n   |                             |\n   |(4) 200 PRACK                |\n   |<----------------------------|\n   |                             |\n   |                             |\n   |(5) UPDATE with offer 2      |\n   |---------------------------->|\n   |                             |\n   |                             |\n   |(6) 200 UPDATE with answer 2 |\n   |<----------------------------|\n   |                             |\n   |                             |\n   |(7) UPDATE with offer 3      |\n   |<----------------------------|\n   |                             |\n   |                             |\n   |(8) 200 UPDATE with answer 3 |\n   |---------------------------->|\n   |                             |\n   |                             |\n   |(9) 200 INVITE               |\n   |<----------------------------|\n   |                             |\n   |                             |\n   |(10) ACK                     |\n   |---------------------------->|\n   |                             |\n   |                             |\n   |                             |\n   |                             |",
      "raw": true
    },
    {
      "indent": 21,
      "text": "Figure 1: UPDATE Call Flow",
      "ja": "図1：UPDATEコールフロー"
    },
    {
      "indent": 0,
      "text": "9 Security Considerations",
      "ja": "9セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "The security considerations for UPDATE are identical to those for re-INVITE. It is important that the UPDATE be integrity protected and authenticated as coming from the same source as the entity on the other end of the dialog. RFC 3261 [1] discusses security mechanisms for achieving these functions.",
      "ja": "UPDATEのためのセキュリティの考慮事項は、再INVITEのためのものと同じです。 UPDATEが、完全性を保護し、ダイアログのもう一方の端のエンティティと同じソースから来るとして認証することが重要です。 RFC 3261 [1]は、これらの機能を実現するためのセキュリティ・メカニズムを説明します。"
    },
    {
      "indent": 0,
      "text": "10 IANA Considerations",
      "ja": "10のIANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "As per Section 27.4 of RFC 3261 [1], this specification serves as a registration for the SIP UPDATE request method. The information to be added to the registry is:",
      "ja": "RFC 3261のセクション27.4に従って[1]、本明細書は、SIP UPDATE要求方法のための登録として機能します。レジストリに追加される情報は以下のとおりです。"
    },
    {
      "indent": 6,
      "text": "RFC 3311: This specification serves as the RFC for registering the UPDATE request method.",
      "ja": "RFC 3311：この仕様は、UPDATEリクエストメソッドを登録するためのRFCとして機能します。"
    },
    {
      "indent": 6,
      "text": "Method Name: UPDATE",
      "ja": "メソッド名：UPDATE"
    },
    {
      "indent": 6,
      "text": "Reason Phrase: Not applicable.",
      "ja": "理由フレーズ：該当事項はありません。"
    },
    {
      "indent": 0,
      "text": "11 Notice Regarding Intellectual Property Rights",
      "ja": "知的財産権に関する11お知らせ"
    },
    {
      "indent": 6,
      "text": "The IETF has been notified of intellectual property rights claimed\nin regard to some or all of the specification contained in this\ndocument.  For more information consult the online list of claimed\nrights.",
      "raw": true
    },
    {
      "indent": 0,
      "text": "12 Normative References",
      "ja": "12の引用規格"
    },
    {
      "indent": 3,
      "text": "[1] Rosenberg, J., Schulzrinne, H., Camarillo, G., Johnston, A., Peterson, J., Sparks, R., Handley, M. and E. Schooler, \"SIP: Session Initiation Protocol\", RFC 3261, June 2002.",
      "ja": "[1]ローゼンバーグ、J.、Schulzrinneと、H.、カマリロ、G.、ジョンストン、A.、ピーターソン、J.、スパークス、R.、ハンドレー、M.、およびE.学生、 \"SIP：セッション開始プロトコル\"、 RFC 3261、2002年6月。"
    },
    {
      "indent": 3,
      "text": "[2] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[2]ブラドナーのは、S.は、BCP 14、RFC 2119、1997年3月の \"RFCsにおける使用のためのレベルを示すために\"。"
    },
    {
      "indent": 3,
      "text": "[3] Rosenberg, J. and H. Schulzrinne, \"An Offer/Answer Model with the Session Description Protocol (SDP)\", RFC 3264, June 2002.",
      "ja": "[3]ローゼンバーグ、J.、およびH. Schulzrinneと、RFC 3264、2002年6月 \"セッション記述プロトコル（SDP）とのオファー/アンサーモデル\"。"
    },
    {
      "indent": 3,
      "text": "[4] Rosenberg, J. and H. Schulzrinne, \"Reliability of Provisional Responses in the Session Initiation Protocol (SIP)\", RFC 3262, June 2002.",
      "ja": "[4]、RFC 3262、2002年6月ローゼンバーグ、J.、およびH. Schulzrinneと、 \"セッション開始プロトコル（SIP）における暫定的な応答の信頼性\"。"
    },
    {
      "indent": 3,
      "text": "[5] Roach, A.B., \"Session Initiation Protocol (SIP)-Specific Event Notification\", RFC 3265, June 2002.",
      "ja": "[5]ローチ、A.B.、 \"セッション開始プロトコル（SIP）特異的イベント通知\"、RFC 3265、2002年6月。"
    },
    {
      "indent": 0,
      "text": "13 Acknowledgements",
      "ja": "13の謝辞"
    },
    {
      "indent": 3,
      "text": "The author would like to thank Jo Hornsby, Markus Isomaki, Rohan Mahy, and Bob Penfield for their comments.",
      "ja": "作者は彼らのコメントのためにジョー・ホーンズビー、マルクスIsomaki、ローハンマーイ、ボブペンフィールドに感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "14 Author's Address",
      "ja": "14著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Jonathan Rosenberg dynamicsoft 72 Eagle Rock Avenue First Floor East Hanover, NJ 07936",
      "ja": "72イーグルロックアベニューまず階イーストハノーバー、NJ 07936 dynamicsoftジョナサン・ローゼンバーグ"
    },
    {
      "indent": 3,
      "text": "EMail: jdrosen@dynamicsoft.com",
      "ja": "メールアドレス：jdrosen@dynamicsoft.com"
    },
    {
      "indent": 0,
      "text": "15 Full Copyright Statement",
      "ja": "15完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2002). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2002）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "了承"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}