{
  "title": {
    "text": "RFC 3317 - Differentiated Services Quality of Service Policy Information Base",
    "ja": "RFC 3317 - サービスポリシー情報ベースの差別化サービスの品質"
  },
  "number": 3317,
  "created_at": "2019-10-26 19:19:49.524449+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                            K. Chan\nRequest for Comments: 3317                               Nortel Networks\nCategory: Informational                                        R. Sahita\n                                                                 S. Hahn\n                                                                   Intel\n                                                           K. McCloghrie\n                                                           Cisco Systems\n                                                              March 2003",
      "raw": true
    },
    {
      "indent": 2,
      "text": "Differentiated Services Quality of Service Policy Information Base",
      "ja": "サービスポリシー情報ベースの差別化サービスの品質"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモはインターネットコミュニティのための情報を提供します。それはどんな種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2003）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document describes a Policy Information Base (PIB) for a device implementing the Differentiated Services Architecture. The provisioning classes defined here provide policy control over resources implementing the Differentiated Services Architecture. These provisioning classes can be used with other none Differentiated Services provisioning classes (defined in other PIBs) to provide for a comprehensive policy controlled mapping of service requirement to device resource capability and usage.",
      "ja": "この文書では、差別化サービスアーキテクチャを実装するデバイスのポリシー情報ベース（PIB）について説明します。ここで定義されたプロビジョニング・クラスは、差別化サービスアーキテクチャを実装するリソースをポリシー制御を提供します。これらのプロビジョニング・クラスは、デバイスのリソース能力および使用へのサービス要求の包括的なポリシー制御されたマッピングを提供するために、（他のPIBで定義された）クラスをプロビジョニングその他なし差別化サービスで使用することができます。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "Conventions used in this document...................................3\n1. Glossary.........................................................3\n2. Introduction.....................................................3\n3. Relationship to the DiffServ Informal Management Model...........3\n  3.1. PIB Overview.................................................4\n4. Structure of the PIB.............................................6\n  4.1. General Conventions..........................................6\n  4.2. DiffServ Data Paths..........................................7\n    4.2.1. Data Path PRC............................................7\n  4.3. Classifiers..................................................8\n    4.3.1. Classifier PRC...........................................9\n    4.3.2. Classifier Element PRC...................................9\n  4.4. Meters.......................................................9\n    4.4.1. Meter PRC...............................................10\n    4.4.2. Token-Bucket Parameter PRC..............................10\n  4.5. Actions.....................................................10\n    4.5.1. DSCP Mark Action PRC....................................11\n  4.6. Queueing Elements...........................................11\n    4.6.1. Algorithmic Dropper PRC.................................11\n    4.6.2. Random Dropper PRC......................................12\n    4.6.3. Queues and Schedulers...................................14\n  4.7. Specifying Device Capabilities..............................16\n5. PIB Usage Example...............................................17\n  5.1. Data Path Example...........................................17\n  5.2. Classifier and Classifier Element Example...................18\n  5.3. Meter Example...............................................21\n  5.4. Action Example..............................................21\n  5.5. Dropper Examples............................................22\n    5.5.1. Tail Dropper Example....................................22\n    5.5.2. Single Queue Random Dropper Example.....................23\n    5.5.3. Multiple Queue Random Dropper Example...................23\n  5.6.   Queue and Scheduler Example...............................26\n6. Summary of the DiffServ PIB.....................................27\n7. PIB Operational Overview........................................28\n8. PIB Definition..................................................29\n9. Acknowledgments.................................................90\n10. Security Considerations........................................90\n11. Intellectual Property Considerations...........................91\n12. IANA Considerations............................................91\n13. Normative References...........................................92\n14. Authors' Addresses.............................................95\n15. Full Copyright Statement.......................................96",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Conventions used in this document",
      "ja": "この文書で使用されている表記"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "1. Glossary",
      "section_title": true,
      "ja": "1.用語集"
    },
    {
      "indent": 3,
      "text": "PRC Provisioning Class. A type of policy data. See [POLTERM]. PRI Provisioning Instance. An instance of a PRC. See [POLTERM]. PIB Policy Information Base. The database of policy information. See [POLTERM]. PDP Policy Decision Point. See [RAP-FRAMEWORK]. PEP Policy Enforcement Point. See [RAP-FRAMEWORK]. PRID Provisioning Instance Identifier. Uniquely identifies an instance of a PRC.",
      "ja": "PRCプロビジョニングクラス。ポリシーデータのタイプ。 [POLTERM]を参照してください。 PRIのプロビジョニングインスタンス。 PRCのインスタンス。 [POLTERM]を参照してください。 PIBポリシー情報ベース。ポリシー情報のデータベース。 [POLTERM]を参照してください。 PDPポリシー決定ポイント。 [RAP-FRAMEWORK]を参照してください。 PEPポリシー実行ポイント。 [RAP-FRAMEWORK]を参照してください。 PRIDプロビジョニングインスタンス識別子。一意PRCのインスタンスを識別する。"
    },
    {
      "indent": 0,
      "text": "2. Introduction",
      "section_title": true,
      "ja": "2.はじめに"
    },
    {
      "indent": 3,
      "text": "[SPPI] describes a structure for specifying policy information that can then be transmitted to a network device for the purpose of configuring policy at that device. The model underlying this structure is one of well-defined provisioning classes and instances of these classes residing in a virtual information store called the Policy Information Base (PIB).",
      "ja": "[SPPI]そのデバイスにポリシーを構成するためにネットワーク装置に送信することができるポリシー情報を指定するための構成について説明します。このような構成の基礎となるモデルは、明確に定義されたプロビジョニング・クラスおよびポリシー情報ベース（PIB）と呼ばれる仮想情報ストアに存在するこれらのクラスのインスタンスの一つです。"
    },
    {
      "indent": 3,
      "text": "This document specifies a set of provisioning classes specifically for configuring QoS Policy for Differentiated Services [DSARCH].",
      "ja": "この文書では、特に差別化サービス[DSARCH]のためのQoSポリシーを設定するためのプロビジョニングクラスのセットを指定します。"
    },
    {
      "indent": 3,
      "text": "One way to provision policy is by means of the COPS protocol [COPS], with the extensions for provisioning [COPS-PR]. This protocol supports multiple clients, each of which may provision policy for a specific policy domain such as QoS. The PRCs defined in this DiffServ QoS PIB are intended for use by the COPS-PR diffServ client type. Furthermore, these PRCs are in addition to any other PIBs that may be defined for the diffServ client type in the future, as well as the PRCs defined in the Framework PIB [FR-PIB].",
      "ja": "プロビジョニングポリシーの一つの方法は、[COPS-PR]をプロビジョニングするための拡張と、COPSプロトコル[COPS]によるものです。このプロトコルは、QoSなどの特定のポリシー・ドメインのための各月のプロビジョニングポリシー複数のクライアントをサポートしています。このDiffServのQoSのPIBで定義されているのPRCsはCOPS-PRのDiffServクライアントの種類によって使用することを意図しています。さらに、これらのPRCsは将来のDiffServクライアントタイプ、ならびにフレームワークPIB [FR-PIB]で定義された位相応答曲線のために定義することができる任意の他のPIBに加えています。"
    },
    {
      "indent": 0,
      "text": "3. Relationship to the DiffServ Informal Management Model",
      "section_title": true,
      "ja": "DiffServの非公式の管理モデル3.関係"
    },
    {
      "indent": 3,
      "text": "This PIB is designed according to the Differentiated Services Informal Management Model documented in [MODEL]. The model describes the way that ingress and egress interfaces of a 'n'-port router are modeled. It describes the configuration and management of a DiffServ interface in terms of a Traffic Conditioning Block (TCB) which contains, by definition, zero or more classifiers, meters, actions, algorithmic droppers, queues and schedulers. These elements are arranged according to the QoS policy being expressed, and are always in that order. Traffic may be classified; classified traffic may be metered; each stream of traffic identified by a combination of classifiers and meters may have some set of actions performed on it; it may have dropping algorithms applied and it may ultimately be stored into a queue before being scheduled out to its next destination, either onto a link or to another TCB. When the treatment for a given packet must have any of those elements repeated in a way that breaks the permitted sequence {classifier, meter, action, algorithmic dropper, queue, scheduler}, this must be modeled by cascading multiple TCBs.",
      "ja": "このPIBは、[MODEL]で文書化差別化サービス非公式の管理モデルに基づいて設計されています。モデルは「N'-ポートルータの入力および出力インタフェースは、モデル化される方法を説明します。それは定義、ゼロまたはそれ以上の分類器、計器、アクション、アルゴリズム点滴、キューおよびスケジューラによって、含まトラフィックコンディショニングブロック（TCB）の観点でのDiffServインタフェースの構成および管理について説明します。これらの要素は、発現されたQoSポリシーに従って配置され、そのために常にされています。トラフィックは分類することができます。分類されたトラフィックを計量することができます。クラシファイアとメーターとの組み合わせによって識別されたトラフィックの各ストリームは、その上に実行される動作のいくつかのセットを有していてもよいです。リンク上または別のTCBのいずれか、それが適用されたアルゴリズムをドロップしている場合があり、それが最終的に次の目的地に出スケジュールされる前にキューに格納されてもよいです。所与のパケットに対する処理が許可シーケンス{クラシファイア、メーター、アクション、アルゴリズムの点滴器、キュー、スケジューラ}を破るように繰り返されるこれらの要素のいずれかを有していなければならない場合、これは複数のTCBをカスケード接続することによってモデル化されなければなりません。"
    },
    {
      "indent": 3,
      "text": "The PIB represents this cascade by following the \"Next\" attributes of the various elements. They indicate what the next step in DiffServ processing will be, whether it be a classifier, meter, action, algorithmic dropper, queue, scheduler or a decision to now forward a packet.",
      "ja": "PIBは、様々な要素の「次」の属性に従うことによって、このカスケードを表します。彼らはそれがクラシファイア、メーター、アクション、アルゴリズムのドロッパー、キュー、スケジューラや今パケットを転送することを決定することかどうか、DiffServの処理の次のステップがどうなるかを示しています。"
    },
    {
      "indent": 3,
      "text": "The PIB models the individual elements that make up the TCBs. The higher level concept of a TCB is not required in the parameterization or in the linking together of the individual elements, hence it is not used in the PIB itself and is only mentioned in the text for relating the PIB with the [MODEL]. The actual distinguishing of which TCB a specific element is a part of is not needed for the instrumentation of a device to support the functionalities of DiffServ, but it is useful for conceptual reasons. By not using the TCB concept, this PIB allows any grouping of elements to construct TCBs, using rules indicated by the [MODEL]. This will minimize changes to this PIB if rules in [MODEL] change.",
      "ja": "PIBモデルのTCBを構成する個々の要素。 TCBのより高いレベルの概念は、したがってそれはPIB自体で使用されていない、パラメータ、または一緒に、個々の要素の結合に必要とされないとのみ[MODEL]とPIBを関連付けるためのテキストに記載されています。実際の区別は、特定の要素がのDiffServの機能をサポートするデバイスの計測のために必要とされないの一部であるTCBが、それは概念的な理由のために有用です。 TCBの概念を使用しないことにより、このPIBは[MODEL]で示される規則を使用して、要素の任意のグループ化のTCBを構築することを可能にします。 [MODEL]の変化の規則場合、これは、このPIBへの変更を最小限に抑えることができます。"
    },
    {
      "indent": 3,
      "text": "The notion of a Data Path is used in this PIB to indicate the DiffServ processing a packet may experience. This Data Path is distinguished based on the Role Combination, Capability Set, and the Direction of the flow the packet is part of. A Data Path Table Entry indicates the first of possibly multiple elements that will apply DiffServ treatment to the packet.",
      "ja": "データパスの概念は、パケットを処理したDiffServに発生する可能性を示すために、このPIBで使用されています。このデータパスは、役割の組み合わせ、能力セット、およびパケットが属する流れの方向に基づいて区別されます。データパステーブルエントリは、パケットのDiffServに処理を適用する可能性の複数の要素の最初を示します。"
    },
    {
      "indent": 0,
      "text": "3.1. PIB Overview",
      "section_title": true,
      "ja": "3.1。スケジュール概要"
    },
    {
      "indent": 3,
      "text": "This PIB is structured based on the need to configure the sequential DiffServ treatments being applied to a packet, and the parameterization of these treatments. These two aspects of the configuration are kept separate throughout the design of the PIB, and are fulfilled using separate tables and data definitions.",
      "ja": "このPIBは、パケットに適用されているシーケンシャルのDiffServトリートメント、これらの処理のパラメータを設定する必要性に基づいて構成されています。コンフィギュレーションのこれらの2つの局面がPIBの設計を通じて別々に維持され、そして別々のテーブルやデータ定義を使用して満たされています。"
    },
    {
      "indent": 3,
      "text": "In addition, the PIB includes tables describing the capabilities and limitations of the device using a general extensible framework.",
      "ja": "また、PIBは、一般的な拡張可能なフレームワークを使用して、デバイスの能力および制限を記述するテーブルを含みます。"
    },
    {
      "indent": 3,
      "text": "These tables are reported to the PDP and assist the PDP with the configuration of functional elements that can be realized by the device.",
      "ja": "これらのテーブルは、PDPに報告し、デバイスによって実現することができる機能要素の構成でPDPを支援しています。"
    },
    {
      "indent": 3,
      "text": "This capabilities and limitations exchange allows a single or multiple devices to support many different variations of a functional datapath element. Allowing diverse methods of providing a general functional datapath element.",
      "ja": "この能力と限界交換は、単一または複数のデバイスが機能データパス要素の多くの異なるバリエーションをサポートすることを可能にします。一般的な機能データパス要素を提供する多様な方法を可能にします。"
    },
    {
      "indent": 3,
      "text": "In this PIB, the ingress and egress portions of a router are configured independently but in the same manner. The difference is distinguished by an attribute in a table describing the start of the data path. Each interface performs some or all of the following high-level functions:",
      "ja": "このPIBでは、ルータの入口および出口部分は、独立して同じように構成されています。差分は、データパスの開始を記述したテーブル内の属性によって区別されます。各インターフェースは、以下の高レベルの機能の一部または全部を行います。"
    },
    {
      "indent": 3,
      "text": "- Classify each packet according to some set of rules.",
      "ja": " - ルールのいくつかのセットに従って各パケットを分類。"
    },
    {
      "indent": 3,
      "text": "- Determine whether the data stream the packet is part of is within or outside its metering parameters.",
      "ja": " - データパケットの一部がその計量パラメータ内又は外であるストリームかどうかを確認。"
    },
    {
      "indent": 3,
      "text": "- Perform a set of resulting actions such as counting and marking of the traffic with a Differentiated Services Code Point (DSCP) as defined in [DSFIELD].",
      "ja": " - そのようなカウントなどのアクションを得て、[DSFIELD]で定義されるように差別化サービスコードポイント（DSCP）とトラフィックのマーキングのセットを実行します。"
    },
    {
      "indent": 3,
      "text": "- Apply the appropriate drop policy, either simple or complex algorithmic drop functionality.",
      "ja": " - 適切なドロップポリシーを適用し、いずれかの単純または複雑なアルゴリズムドロップ機能。"
    },
    {
      "indent": 3,
      "text": "- Enqueue the traffic for output in the appropriate queue, whose scheduler may shape the traffic or simply forward it with some minimum rate or maximum latency.",
      "ja": " - スケジューラトラフィックをシェーピングまたは単に前方にある最小レートまたは最大待ち時間を有することができる適切なキューに出力するためにトラフィックをエンキュー。"
    },
    {
      "indent": 3,
      "text": "The PIB therefore contains the following elements:",
      "ja": "PIBは、したがって、次の要素が含まれます。"
    },
    {
      "indent": 3,
      "text": "Data Path Table This describes the starting point of DiffServ data paths within a single DiffServ device. This class describes interface role combination and interface direction specific data paths.",
      "ja": "このデータパステーブルは、単一のDiffServデバイス内のDiffServデータパスの開始点を記載しています。このクラスは、インターフェイスの役割の組み合わせとインタフェース方向特定データパスを記述する。"
    },
    {
      "indent": 3,
      "text": "Classifier Tables A general extensible framework for specifying a group of filters.",
      "ja": "クラシファイア表フィルタのグループを指定するための一般的な拡張可能なフレームワーク。"
    },
    {
      "indent": 3,
      "text": "Meter Tables A general extensible framework and one example of a parameterization table - TBParam table, applicable for Simple Token Bucket Meter, Average Rate Meter, Single Rate Three Color Meter, Two Rate Three Color Meter, and Sliding Window Three Color Meter.",
      "ja": "単純トークンバケットメートル、平均レートメートル、シングルレート3色計、二つレート3色計、およびスライディングウィンドウ三色計に適用TBParamテーブル、 - メータテーブル一般的な拡張可能なフレームワークと一つパラメータテーブルの一例。"
    },
    {
      "indent": 3,
      "text": "Action Tables A general extensible framework and example of parameterization tables for Mark action. The \"multiplexer\" and \"null\" actions described in [MODEL] are accomplished implicitly by means of the Prid structures of the other elements.",
      "ja": "アクションテーブル一般的な拡張可能なフレームワークとマークアクションのパラメータテーブルの一例。 「マルチプレクサ」と[MODEL]に記載の「ヌル」アクションは、他の要素のPRID構造によって暗黙的に達成されます。"
    },
    {
      "indent": 3,
      "text": "Algorithmic Dropper Tables A general extensible framework for describing the dropper functional datapath element. This includes the absolute dropper and other queue measurement dependent algorithmic droppers.",
      "ja": "アルゴリズムドロッパーテーブルドロッパー機能データパス要素を記述するための一般的な拡張可能なフレームワークを。これは、絶対的な点滴器および他のキューの測定に依存するアルゴリズムの点滴を含みます。"
    },
    {
      "indent": 3,
      "text": "Queue and Scheduler Tables A general extensible framework for parameterizing queuing and scheduler systems. Notice Shaper is considered as a type of scheduler and is included here.",
      "ja": "キューおよびスケジューラ表キューイングおよびスケジューリングシステムをパラメータ化するための一般的な拡張可能なフレームワーク。お知らせシェイパーは、スケジューラの種類としてみなされ、ここに含まれます。"
    },
    {
      "indent": 3,
      "text": "Capabilities Tables A general extensible framework for defining the capabilities and limitations of the elements listed above. The capability tables allow intelligent configuration of the elements by a PDP.",
      "ja": "機能テーブル上記列挙された要素の機能および制限を定義するための一般的な拡張可能なフレームワーク。能力テーブルは、PDPによって要素のインテリジェントな構成を可能にします。"
    },
    {
      "indent": 0,
      "text": "4. Structure of the PIB",
      "section_title": true,
      "ja": "PIBの4構造"
    },
    {
      "indent": 0,
      "text": "4.1. General Conventions",
      "section_title": true,
      "ja": "4.1。一般規則"
    },
    {
      "indent": 3,
      "text": "The PIB consists of PRCs that represent functional elements in the data path (e.g., classifiers, meters, actions), and classes that specify parameters that apply to a certain type of functional element (e.g., a Token Bucket meter or a Mark action). Parameters are typically specified in a separate PRC to enable the use of parameter classes by multiple policies.",
      "ja": "PIBは、機能データ経路の要素（例えば、分類、メートル、アクション）、および機能的要素（例えば、トークンバケットメータ又はマーク作用）の特定のタイプに適用されるパラメータを指定するクラスを表す位相応答曲線から成ります。パラメータは、通常、複数のポリシーによるパラメータクラスの使用を可能にするために別々のPRCに指定されています。"
    },
    {
      "indent": 3,
      "text": "Functional element PRCs use the Prid TC (defined in [SPPI]) to indicate indirection. A Prid is an object identifier that is used to specify an instance of a PRC in another table. A Prid is used to point to parameter PRC that applies to a functional element, such as which filter should be used for a classifier element. A Prid is also used to specify an instance of a functional element PRC that describes what treatment should be applied next for a packet in the data path.",
      "ja": "機能素子位相応答曲線は、間接を示すために（[SPPI]で定義される）PRID TCを使用します。 PRIDは、別のテーブル内のPRCのインスタンスを指定するために使用されるオブジェクト識別子です。 PRIDは、フィルタは、分類子要素のために使用されるべきこのようなどのように機能素子に適用PRCのパラメータを指すために使用されます。 PRIDは、データパスにおけるパケットのための次の適用されるべき処理について説明機能要素PRCのインスタンスを指定するために使用されます。"
    },
    {
      "indent": 3,
      "text": "Note that the use of Prids to specify parameter PRCs allows the same functional element PRC to be extended with a number of different types of parameter PRC's. In addition, using Prids to indicate the next functional datapath element allows the elements to be ordered in any way.",
      "ja": "パラメーター位相応答曲線を指定するPridsの使用は、同一の機能要素PRCパラメータPRCの異なる種類の数に拡張することを可能にすることに留意されたいです。また、次の機能データパス要素を示すためにPridsを使用する要素は、どのような方法で注文することを可能にします。"
    },
    {
      "indent": 0,
      "text": "4.2. DiffServ Data Paths",
      "section_title": true,
      "ja": "4.2。 DiffServのデータパス"
    },
    {
      "indent": 3,
      "text": "This part of the PIB provides instrumentation for connecting the DiffServ Functional Elements within a single DiffServ device. Please refer to [MODEL] for discussions on the valid sequencing and grouping of DiffServ Functional Elements. Given some basic information, e.g., the interface capability, role combination and direction, the first DiffServ Functional Element is determined. Subsequent DiffServ Functional Elements are provided by the \"Next\" pointer attribute of each entry of data path tables. A description of how this \"Next\" pointer is used in each table is provided in their respective DESCRIPTION clauses.",
      "ja": "PIBのこの部分は、単一のDiffServデバイス内のDiffServ機能要素を接続するための機器を提供します。 DiffServの機能要素の有効なシーケンシングおよびグループ化に関する議論のための[MODEL]を参照してください。いくつかの基本的な情報、例えば、インタフェース能力、役割の組み合わせおよび方向を考えると、最初のDiffServ機能要素が決定されます。後続のDiffServ機能要素は、データパステーブルの各エントリの「次」ポインタ属性によって提供されます。この「次の」ポインタが各テーブルに使用される方法の説明は、それぞれの記述節で提供されます。"
    },
    {
      "indent": 0,
      "text": "4.2.1. Data Path PRC",
      "section_title": true,
      "ja": "4.2.1。データパスPRC"
    },
    {
      "indent": 3,
      "text": "The Data Path PRC provides the DiffServ treatment starting points for all packets of this DiffServ device. Each instance of this PRC specifies the interface capability, role combination and direction for the packet flow. There should be at most two entries for each instance (interface type, role combination, interface capability), one for ingress and one for egress. Each instance provides the first DiffServ Functional Element that each packet, at a specific interface (identified by the roles assigned to the interface) traveling in a specific relative direction, should experience. Notice this class is interface specific, with the use of interface type capability set and RoleCombination. To indicate explicitly that there are no DiffServ treatments for a particular interface type capability set, role combination and direction, an instance of the Data Path PRC can be created with zeroDotZero in the dsDataPathStart attribute. This situation can also be indicated implicitly by not supplying an instance of a Data Path PRC for that particular interface type capability set, role combination and direction. The explicit/implicit selection is up to the implementation. This means that the PEP should perform normal IP device processing when zeroDotZero is used in the dsDataPathStart attribute, or when the entry does not exist. Normal IP device processing will depend on the device; for example, this can be forwarding the packet.",
      "ja": "データパスPRCこのDiffServのデバイスのすべてのパケットのためのDiffServ処理の開始点を提供します。このPRCの各インスタンスは、パケットフローのためのインタフェース機能、役割の組み合わせと方向を指定します。インスタンスごとに最大2つのエントリ（インターフェイスタイプ、役割の組み合わせ、インターフェース機能）、入口用と出口のための1があるはずです。各インスタンスは、各パケットは、特定の相対方向に移動（インターフェースに割り当てられた役割によって識別される）特定の界面において、発生すべきであることを最初のDiffServ機能素子を提供します。このクラスは、インターフェイスタイプの能力セットとRoleCombinationを使用して、インターフェイス固有のものです注意してください。特定のインターフェイスタイプの能力セット、役割の組み合わせと方向のためのDiffServの治療が存在しないことを明確に示すために、データパスPRCのインスタンスはdsDataPathStart属性でのzeroDotZeroを使用して作成することができます。この状況は、その特定のインタフェースタイプ能力セット、ロールの組合せと方向のためのデータパスPRCのインスタンスを供給しないことによって暗黙的に示すことができます。明示的/暗黙の選択は実装次第です。これは、のzeroDotZeroはdsDataPathStart属性で使用されている場合、またはエントリが存在しない場合PEPは、通常のIPデバイスの処理を行う必要があることを意味します。通常のIPデバイス処理は、デバイスに依存します。例えば、これは、パケットを転送することができます。"
    },
    {
      "indent": 3,
      "text": "Based on implementation experience of network devices where data path functional elements are implemented in separate physical processors or application specific integrated circuits, separated by switch fabric, it seems that more complex notions of data path are required within the network device to correlate the different physically separate data path functional elements. For example, ingress processing may have determined a specific ingress flow that gets aggregated with other ingress flows at an egress data path functional element. Some of the information determined at the ingress data path functional element may need to be used by the egress data path functional element. In numerous implementations, such information has been carried by adding it to the frame/memory block used to carry the flow within the network device; some implementers have called such information a \"preamble\" or a \"frame descriptor\". Different implementations use different formats for such information. Initially, one may think such information has implementation details within the network device that does not need to be exposed outside of the network device. But from Policy Control point of view, such information will be very useful in determining network resource usage feedback from the network device to the policy server. This is accomplished by using the Internal Label Marker and Filter PRCs defined in [FR-PIB].",
      "ja": "データ経路機能要素は、別個の物理プロセッサまたは特定用途向け集積回路に実装されるネットワークデバイスの実装経験に基づいて、スイッチファブリックによって分離され、データ・パスのより複雑な概念は、異なる物理的に分離を相関させるためにネットワーク装置内で必要とされると思われますデータ経路機能要素。例えば、イングレス処理は、出力データ経路機能要素で流れる他の入口と凝集します特定の入口の流れを決定してもよいです。イングレスデータパス機能要素で決定された情報の一部は、出力データ経路機能要素によって使用される必要があるかもしれません。多数の実装では、そのような情報は、ネットワークデバイス内の流れを運ぶために使用されるフレーム/メモリブロックにそれを添加することにより実施されました。いくつかの実装は、「前文」や「フレーム記述子」そのような情報を求めています。異なる実装は、このような情報については、異なるフォーマットを使用します。最初は、一つは、そのような情報は、ネットワーク機器の外部に露出する必要はありませんネットワーク機器内の実装の詳細を持っていると思うことがあります。しかし、ビューのポリシー制御の観点から、そのような情報には、ポリシーサーバにネットワークデバイスからネットワークリソースの使用状況のフィードバックを決定する上で非常に有用であろう。これは、[FR-PIB]で定義された内部ラベルマーカーおよびフィルタ位相応答曲線を使用することによって達成されます。"
    },
    {
      "indent": 0,
      "text": "4.3. Classifiers",
      "section_title": true,
      "ja": "4.3。クラシファイア"
    },
    {
      "indent": 3,
      "text": "The classifier and classifier element tables determine how traffic is sorted out. They identify separable classes of traffic, by reference to appropriate filters, which may select anything from an individual micro-flow to aggregates identified by DSCP.",
      "ja": "クラシファイアとクラシファイア要素テーブルは、トラフィックが整理される方法を決定します。彼らは、DSCPで識別される集合体に個々のマイクロフローから何かを選択することが適切なフィルタを参照することによって、トラフィックの分離可能なクラスを識別します。"
    },
    {
      "indent": 3,
      "text": "The classification is used to send these separate streams to appropriate Meter, Action, Algorithmic Dropper, Queue and Scheduler elements. For example, to indicate a multi-stage meter, sub-classes of traffic may be sent to different meter stages: e.g., in an implementation of the Assured Forwarding (AF) PHB [AF-PHB], AF11 traffic might be sent to the first meter, AF12 traffic might be sent to the second and AF13 traffic sent to the second meter stage's out-of-profile action.",
      "ja": "分類はメーター、アクション、アルゴリズムドロッパー、キューおよびスケジューラ要素を適切なために、これらの別個のストリームを送信するために使用されます。例えば、多段計を示すために、トラフィックのサブクラスは、異なるメーターステージに送られてもよい：例えば、保証転送（AF）PHB [AF-PHB]の実装では、AF11トラフィックがに送信されるかもしれません第一メートル、AF12のトラフィックは、二メートルの段階のアウトオブプロファイルアクションに送信された第2及びAF13トラフィックに送信される可能性があります。"
    },
    {
      "indent": 3,
      "text": "The concept of a classifier is the same as described in [MODEL]. The structure of the classifier and classifier element tables, is the same as the classifier described in [MODEL]. Classifier elements have an associated precedence order solely for the purpose of resolving ambiguity between overlapping filters. A filter with higher values of precedence are compared first; the order of tests for entries of the same precedence is unimportant.",
      "ja": "分類器の概念は、[MODEL]に記載のものと同じです。クラシファイアとクラシファイア要素テーブルの構造は、[MODEL]で説明した分類器と同じです。クラシファイア要素は、単にオーバーラップフィルタ間のあいまいさを解決するために、関連する優先順位を持っています。優先順位の高い値を有するフィルタは、最初に比較されます。同じ優先順位のエントリのためのテストの順序は重要ではありません。"
    },
    {
      "indent": 3,
      "text": "A datapath may consist of more than one classifier. There may be an overlap of filter specification between filters of different classifiers. The first classifier functional datapath element encountered, as determined by the sequencing of diffserv functional datapath elements, will be used first.",
      "ja": "データパスは、複数の分類器から構成されてもよいです。異なる分類のフィルタ間のフィルタ仕様の重なりがあってもよいです。 DiffServの機能データパス要素の配列決定によって決定されるような機能データパス要素は、遭遇した最初の分類器は、最初に使用されるであろう。"
    },
    {
      "indent": 3,
      "text": "An important form of classifier is \"everything else\": the final stage of the classifier i.e., the one with the lowest precedence, must be \"complete\" since the result of an incomplete classifier is not necessarily deterministic - see [MODEL] section 4.1.2.",
      "ja": "分類器の重要な形態は、「他のすべて」です：クラシファイアすなわち、最も優先順位の低い1の最終段階不完全な分類器の結果は必ずしも確定的ではないので、「完全」でなければならない -  [MODEL]セクション4.1を参照してください。 2。"
    },
    {
      "indent": 3,
      "text": "When a classifier PRC is instantiated at the PEP, it should always have at least one classifier element table entry, the \"everything else\" classifier element, with its filter matching all IP packets. This \"everything else\" classifier element should be created by the PDP as part of the classifier setup. The PDP has full control of all classifier PRIs instantiated at the PEP.",
      "ja": "分類器PRCは、PEPでインスタンス化されると、それは常にそのフィルタは、すべてのIPパケットを照合して、少なくとも一つのクラシファイア要素テーブルのエントリ、「他のすべて」クラシファイア要素を持っている必要があります。この「他のすべて」クラシファイア要素は、分類器のセットアップの一部として、PDPによって作成されなければなりません。 PDPは、PEPでインスタンスすべての分類器のPRIの完全な制御を持っています。"
    },
    {
      "indent": 3,
      "text": "The definition of the actual filter to be used by the classifier is referenced via a Prid: this enables the use of any sort of filter table that one might wish to design, standard or proprietary. No filters are defined in this PIB. However, standard filters for IP packets are defined in the Framework PIB [FR-PIB].",
      "ja": "分類器によって使用される実際のフィルタの定義は、PRIDを介して参照されます。これは1つが、標準または独自の設計を必要とするかもしれないフィルタテーブルの任意の並べ替えの使用を可能にします。何フィルタはこのPIBで定義されていません。しかし、IPパケットのための標準的なフィルタは、フレームワークPIB [FR-PIB]で定義されています。"
    },
    {
      "indent": 0,
      "text": "4.3.1. Classifier PRC",
      "section_title": true,
      "ja": "4.3.1。分類器PRC"
    },
    {
      "indent": 3,
      "text": "Classifiers, used in various ingress and egress interfaces, are organized by the instances of the Classifier PRC. A data path entry points to a classifier entry. A classifier entry identifies a list of classifier elements. A classifier element effectively includes the filter entry, and points to a \"next\" classifier entry or some other data path functional element.",
      "ja": "様々な入力および出力インタフェースで使用される分類は、分類PRCのインスタンスによって編成されます。データ・パス・エントリは分類子エントリを指します。分類子エントリーはクラシファイア要素のリストを識別する。クラシファイア要素を効果的にフィルタエントリを含み、そして「次の」分類子エントリーまたはいくつかの他のデータ経路機能要素を指します。"
    },
    {
      "indent": 0,
      "text": "4.3.2. Classifier Element PRC",
      "section_title": true,
      "ja": "4.3.2。分類子要素のPRC"
    },
    {
      "indent": 3,
      "text": "Classifier elements point to the filters which identify various classes of traffic. The separation between the \"classifier element\" and the \"filter\" allows us to use many different kinds of filters with the same essential semantics of \"an identified set of traffic\". The traffic matching the filter corresponding to a classifier element is given to the \"next\" data path functional element identified in the classifier element.",
      "ja": "クラシファイア要素は、トラフィックのさまざまなクラスを識別するフィルタを指します。 「クラシファイア要素」と「フィルタ」間の分離は、私たちは、「トラフィックの識別セット」の同じ基本的なセマンティクスでフィルタの多くの異なる種類を使用することができます。クラシファイア要素に対応するフィルタに一致するトラフィックを分類子要素で識別された「次の」データ経路機能要素に与えられます。"
    },
    {
      "indent": 3,
      "text": "An example of a filter that may be pointed to by a Classifier Element PRI is the frwkIpFilter PRC, defined in [FR-PIB].",
      "ja": "分類要素PRIによって指されることができるフィルタの例は、[FR-PIB]で定義され、frwkIpFilter PRCです。"
    },
    {
      "indent": 0,
      "text": "4.4. Meters",
      "section_title": true,
      "ja": "4.4。メーター"
    },
    {
      "indent": 3,
      "text": "A meter, according to [MODEL] section 5, measures the rate at which packets composing a stream of traffic pass it, compares this rate to some set of thresholds, and produces some number (two or more) of potential results. A given packet is said to \"conform\" to the meter if, at the time the packet is being looked at, the stream appears to be within the meter's profile. PIB syntax makes it easiest to define this as a sequence of one or more cascaded pass/fail tests, modeled here as if-then-else constructs. It is important to understand that this way of modeling does not imply anything about the implementation being \"sequential\": multi-rate/multi-profile meters, e.g., those designed to support [SRTCM], [TRTCM], or [TSWTCM] can still be",
      "ja": "メータは、[MODEL]セクション5によれば、それを通るトラフィックのストリームを構成するパケットする速度を測定するしきい値のいくつかのセットにこのレートを比較し、潜在的な結果のいくつかの数（複数）を生成します。与えられたパケットは、パケットを見ている時に、ストリームは、メーターのプロフィール内にあるように見える、あればメーターに「準拠」と言われています。 PIBの構文は、それが最も簡単な一つの配列としてこれを定義する以上のカスケード接続パス/のif-then-else構文として、ここでモデル化テストを、失敗します。マルチレート/マルチプロファイルメーター、例えば、[SRTCM]をサポートするために設計されたもの、[TRTCM]、または[TSWTCM]は、次のことができます。モデリングのこの方法は、実装が「シーケンシャル」であることについては何も意味しないことを理解することが重要ですまだあること"
    },
    {
      "indent": 3,
      "text": "modeled this way even if they, of necessity, share information between the stages: the stages are introduced merely as a notational convenience in order to simplify the PIB structure.",
      "ja": "ステージはPIB構造を簡略化するために表記上の便宜としてのみ導入されている：それらは、必然的に、段階間で情報を共有する場合でも、この方法をモデル化しました。"
    },
    {
      "indent": 0,
      "text": "4.4.1. Meter PRC",
      "section_title": true,
      "ja": "4.4.1。メーターPRC"
    },
    {
      "indent": 3,
      "text": "The generic meter PRC is used as a base for all more specific forms of meter. The definition of parameters specific to the type of meter used is referenced via a pointer to an instance of a PRC containing those specifics. This enables the use of any sort of specific meter table that one might wish to design, standard or proprietary. One specific meter table is defined in this PIB module. Other meter tables may be defined in other PIB modules.",
      "ja": "ジェネリックメートルPRCは、メートルのすべてのより具体的な形のベースとして使用されています。使用される計器のタイプに固有のパラメータの定義は、これらの詳細を含むPRCのインスタンスへのポインタを介して参照されます。これは、1つは、標準または独自の設計を必要とするかもしれない特定のメーターテーブルの任意の並べ替えの使用を可能にします。一つの具体的なメートルのテーブルは、このPIBモジュールで定義されています。その他メートルのテーブルは、他のPIBモジュールで定義されていてもよいです。"
    },
    {
      "indent": 0,
      "text": "4.4.2. Token-Bucket Parameter PRC",
      "section_title": true,
      "ja": "4.4.2。トークンバケットパラメータPRC"
    },
    {
      "indent": 3,
      "text": "This is included as an example of a common type of meter. Entries in this class are referenced from the dsMeterSpecific attributes of meter PRC instances. The parameters are represented by a rate dsTBParamRate, a burst size dsTBParamBurstSize, and an interval dsTBparamInterval. The type of meter being parameterized is indicated by the dsTBParamType attribute. This is used to determine how the rate, burst, and rate interval parameters are used. Additional meter parameterization classes can be defined in other PIBs when necessary.",
      "ja": "これは、計器の一般的なタイプの例として含まれます。このクラスのエントリはメートルPRCインスタンスのdsMeterSpecific属性から参照されています。パラメータは速度dsTBParamRate、バーストサイズdsTBParamBurstSize、及び間隔dsTBparamIntervalで表されます。メーターの種類はdsTBParamType属性によって示されるパラメータ化されています。これは、速度は、バースト、及びレート間隔パラメータが使用されている方法を決定するために使用されます。追加メーターのパラメータ設定に必要なクラスが他のPIBで定義することができます。"
    },
    {
      "indent": 0,
      "text": "4.5. Actions",
      "section_title": true,
      "ja": "4.5。行動"
    },
    {
      "indent": 3,
      "text": "Actions include \"no action\", \"mark the traffic with a DSCP\" or \"specific action\". Other tasks such as \"shape the traffic\" or \"drop based on some algorithm\" are handled in other functional datapath elements rather than in actions. The \"multiplexer\", \"replicator\", and \"null\" actions described in [MODEL] are accomplished implicitly through various combinations of the other elements.",
      "ja": "アクションは、「何のアクション」、「DSCPを持つトラフィックをマークする」または「特定のアクション」を含んでいません。そのような「形状トラフィック」または「いくつかのアルゴリズムに基づいて、ドロップ」などの他のタスクは、他の機能データパス要素ではなく、アクションで処理されます。 「マルチプレクサ」、「リプリケータ」、および[MODEL]に記載の「ヌル」アクションは、他の要素の様々な組合せを介して暗黙的に達成されます。"
    },
    {
      "indent": 3,
      "text": "This PIB uses the Action PRC dsActionTable to organize one Action's relationship with the element(s) before and after it. It allows Actions to be cascaded to enable that multiple Actions be applied to a single traffic stream by using each entry's dsActionNext attribute. The dsActionNext attribute of the last action entry in the chain points to the next element in the TCB, if any, e.g., a Queueing element. It may also point at a next TCB.",
      "ja": "このPIBは、その前後の要素（複数可）と1つのアクションの関係を整理するためにアクションPRC dsActionTableを使用しています。これは、アクションが複数のアクションは、各エントリのdsActionNext属性を使用して、単一のトラフィックストリームに適用されることを可能にするためにカスケード接続することができます。 TCB内の次の要素への連鎖点における最後のアクション項目のdsActionNext属性、もしあれば、例えば、キュ​​ー要素。それはまた次のTCBを指すことがあります。"
    },
    {
      "indent": 3,
      "text": "The parameters needed for the Action element will depend on the type of Action to be taken. Hence the PIB allows for specific Action Tables for the different Action types. This flexibility allows additional Actions to be specified in other PIBs and also allows for the use of proprietary Actions without impact on those defined here.",
      "ja": "アクション要素のために必要なパラメータがとるべき行動の種類に依存します。したがってPIBは異なるアクションタイプのための特定のアクションテーブルを可能にします。この柔軟性は、追加のアクションは、他のPIBで指定することができます。また、ここで定義されたものに影響を与えることなく、独自のアクションを使用することができます。"
    },
    {
      "indent": 3,
      "text": "One may consider packet dropping as an Action element. Packet dropping is handled by the Algorithmic Dropper datapath functional element.",
      "ja": "一つは、アクション要素として、パケット廃棄を考慮することができます。パケット落ちがアルゴリズムドロッパーデータパス機能要素によって処理されます。"
    },
    {
      "indent": 0,
      "text": "4.5.1. DSCP Mark Action PRC",
      "section_title": true,
      "ja": "4.5.1。 DSCPマーク・アクションPRC"
    },
    {
      "indent": 3,
      "text": "This Action is applied to traffic in order to mark it with a DiffServ Codepoint (DSCP) value, specified in the dsDscpMarkActTable.",
      "ja": "このアクションは、dsDscpMarkActTableに指定されたDiffServコードポイント（DSCP）値、でそれをマークするために、トラフィックに適用されます。"
    },
    {
      "indent": 0,
      "text": "4.6. Queueing Elements",
      "section_title": true,
      "ja": "4.6。キューの要素"
    },
    {
      "indent": 3,
      "text": "These include Algorithmic Droppers, Queues and Schedulers, which are all inter-related in their use of queueing techniques.",
      "ja": "これらは、すべての技術をキューイングの利用には、相互に関連しているアルゴリズムのドロッパー、キューとスケジューラが含まれます。"
    },
    {
      "indent": 0,
      "text": "4.6.1. Algorithmic Dropper PRC",
      "section_title": true,
      "ja": "4.6.1。アルゴリズムのドロッパーPRC"
    },
    {
      "indent": 3,
      "text": "Algorithmic Droppers are represented in this PIB by instances of the Algorithmic Dropper PRC. An Algorithmic Dropper is assumed to operate indiscriminately on all packets that are presented at its input; all traffic separation should be done by classifiers and meters preceding it.",
      "ja": "アルゴリズムのドロッパーは、アルゴリズムのドロッパーPRCのインスタンスで、このPIBで表現されています。アルゴリズムドロッパーは、その入力において提示されるすべてのパケットに対して無差別に動作すると仮定されます。すべてのトラフィックの分離は、それに先行するクラシファイアとメーターが行ってください。"
    },
    {
      "indent": 3,
      "text": "Algorithmic Dropper includes many types of droppers, from the simple always dropper to the more complex random dropper. This is indicated by the dsAlgDropType attribute.",
      "ja": "シンプルはいつもより複雑なランダムスポイトにスポイトからアルゴリズムのドロッパーは、ドロッパーの多くの種類が含まれています。これはdsAlgDropType属性によって示されています。"
    },
    {
      "indent": 3,
      "text": "Algorithmic Droppers have a close relationship with queuing; each Algorithmic Dropper Table entry contains a dsAlgDropQMeasure attribute, indicating which queue's state affects the calculation of the Algorithmic Dropper. Each entry also contains a dsAlgDropNext attribute that indicates to which queue the Algorithmic Dropper sinks its traffic.",
      "ja": "アルゴリズムのドロッパーは、キューイングと密接な関係を持っています。各アルゴリズムのドロッパー表のエントリはキューの状態はアルゴリズムドロッパーの計算に影響を与えたかを示す、dsAlgDropQMeasure属性が含まれています。各エントリには、また、アルゴリズムのドロッパーは、そのトラフィックをシンクキューイングするかを示しdsAlgDropNext属性が含まれています。"
    },
    {
      "indent": 3,
      "text": "Algorithmic Droppers may also contain a pointer to a specific detail of the drop algorithm, dsAlgDropSpecific. This PIB defines the detail for three drop algorithms: Tail Drop, Head Drop, and Random Drop; other algorithms are outside the scope of this PIB module, but the general framework is intended to allow for their inclusion via other PIB modules.",
      "ja": "アルゴリズムドロッパーも降下アルゴリズム、dsAlgDropSpecificの具体的な内容へのポインタを含んでいてもよいです。このPIBは、3つのドロップアルゴリズムのために詳細を定義します。テールドロップ、ヘッドドロップ、およびランダムドロップ。他のアルゴリズムは、このPIBモジュールの範囲外であるが、一般的なフレームワークは、他のPIBモジュールを介して、それらの包含を可能にするために意図されています。"
    },
    {
      "indent": 3,
      "text": "One generally-applicable parameter of a dropper is the specification of a queue-depth threshold at which some drop action is to start. This is represented in this PIB, as a base attribute, dsAlgDropQThreshold, of the Algorithmic Dropper entry. The attribute, dsAlgDropQMeasure, specifies which queue's depth dsAlgDropQThreshold is to be compared against.",
      "ja": "スポイトの一つの一般的に適用可能なパラメータには、いくつかのドロップアクションを開始することとなるのキューの深さのしきい値の仕様です。これは、アルゴリズムドロッパーエントリのベース属性、dsAlgDropQThreshold、として、このPIBに示されています。属性、dsAlgDropQMeasureは、比較対象となるキューの深さdsAlgDropQThreshold指定します。"
    },
    {
      "indent": 3,
      "text": "o An Always Dropper drops every packet presented to it. This type of dropper does not require any other parameter.",
      "ja": "O常にドロッパーは、それに提示されるすべてのパケットを廃棄します。スポイトのこのタイプは、他のパラメータを必要としません。"
    },
    {
      "indent": 3,
      "text": "o A Tail Dropper requires the specification of a maximum queue depth threshold: when the queue pointed at by dsAlgDropQMeasure reaches that depth threshold, dsAlgDropQThreshold, any new traffic arriving at the dropper is discarded. This algorithm uses only parameters that are part of the dsAlgDropEntry.",
      "ja": "Oテールスポイトは、最大キュー深度しきい値を指定する必要があり：キューがdsAlgDropQMeasureは、その深さのしきい値に達したが指すとき、dsAlgDropQThreshold、スポイトに到着するすべての新しいトラフィックは破棄されます。このアルゴリズムは、dsAlgDropEntryの一部であるパラメータのみを使用しています。"
    },
    {
      "indent": 3,
      "text": "o A Head Dropper requires the specification of a maximum queue depth threshold: when the queue pointed at by dsAlgDropQMeasure reaches that depth threshold, dsAlgDropQThreshold, traffic currently at the head of the queue is discarded. This algorithm uses only parameters that are part of the dsAlgDropEntry.",
      "ja": "ヘッドドロッパーは最大キューの深さ閾値の指定が必要（O）キューはdsAlgDropQMeasureによって指し示さ場合深さ閾値、dsAlgDropQThresholdが、現在キューの先頭にトラフィックが廃棄されることに達します。このアルゴリズムは、dsAlgDropEntryの一部であるパラメータのみを使用しています。"
    },
    {
      "indent": 3,
      "text": "o Random Droppers are recommended as a way to control congestion, in [QUEUEMGMT] and called for in the [AF-PHB]. Various implementations exist, that agree on marking or dropping just enough traffic to communicate with TCP-like protocols about congestion avoidance, but differ markedly on their specific parameters. This PIB attempts to offer a minimal set of controls for any random dropper, but expects that vendors will augment the PRC with additional controls and status in accordance with their implementation. This algorithm requires additional parameters on top of those in dsAlgDropEntry; these are discussed below.",
      "ja": "[AF-PHB]中のOランダムドロッパーは、輻輳を制御する方法として推奨されている[QUEUEMGMT]およびを求めました。様々な実装が輻輳回避についてはTCPのようなプロトコルと通信するだけの十分なトラフィックをマーキングまたはドロップするには同意するが、その特定のパラメータに著しく異なること、存在します。このPIBは、任意のランダムスポイトのコントロールの最小セットを提供しようとしますが、ベンダーがその実施に合わせて、追加の制御およびステータスでPRCを強化することを期待しています。このアルゴリズムは、dsAlgDropEntryのものの上に追加のパラメータを必要とします。これらは、以下で議論されています。"
    },
    {
      "indent": 3,
      "text": "A Dropper Type of other is provided for the implementation of dropper types not defined here. When the Dropper Type is other, its full specification will need to be provided by another PRC referenced by dsAlgDropSpecific. A Dropper Type of Multiple Queue Random Dropper is also provided; please reference section 5.5.3 of this document for more details.",
      "ja": "他のスポイトタイプは、ここで定義されていないスポイトタイプの実装のために提供されます。スポイトタイプが他の場合は、その完全な仕様は、dsAlgDropSpecificで参照される他のPRCによって提供されている必要があります。複数のキューランダムドロッパーのドロッパー型も提供されます。詳細については、このドキュメントのセクション5.5.3を参照してください。"
    },
    {
      "indent": 0,
      "text": "4.6.2. Random Dropper PRC",
      "section_title": true,
      "ja": "4.6.2。ランダムドロッパーPRC"
    },
    {
      "indent": 3,
      "text": "One example of a random dropper is a RED-like dropper. An example of the representation chosen in this PIB for this element is shown in Figure 1.",
      "ja": "ランダムスポイトの一例は、REDのようなドロッパーです。この要素は、このPIBで選択された表現の例が図1に示されています。"
    },
    {
      "indent": 3,
      "text": "Random droppers often have their drop probability function described as a plot of drop probability (P) against averaged queue length (Q). (Qmin, Pmin) then defines the start of the characteristic plot. Normally Pmin=0, meaning that with average queue length below Qmin, there will be no drops. (Qmax, Pmax) defines a \"knee\" on the plot, after which point the drop probability become more progressive (greater slope). (Qclip, 1) defines the queue length at which all packets will be dropped. Notice this is different from Tail Drop because this uses an averaged queue length. Although it is possible for Qclip = Qmax.",
      "ja": "ランダムドロッパーは、多くの場合、彼らのドロップ確率関数は、平均待ち行列の長さ（Q）に対するドロップ確率（P）のプロットとして説明しています。 （Qminを、値Pmin）を特性プロットの開始を定義します。通常、Pminの= 0は、Qminの下の平均キュー長と、何滴がないことを意味します。 （Qmaxと、Pmaxが）廃棄確率がより累進なった時点以降のプロットの「膝」、（大きな傾き）を定義します。 （Qclipは、1）すべてのパケットが廃棄されるのキュー長を規定します。これは、平均キューの長さを使用していますので、これはテールドロップと異なっている注意してください。それはQclip = Qmaxのために可能ではあるが。"
    },
    {
      "indent": 3,
      "text": "In the PIB module, dsRandomDropMinThreshBytes and dsRandomDropMinThreshPkts represent Qmin. dsRandomDropMaxThreshBytes and dsRandomDropMaxThreshPkts represent Qmax. dsAlgDropQThreshold represents Qclip. dsRandomDropProbMax represents Pmax. This PIB does not represent Pmin (assumed to be zero unless otherwise represented).",
      "ja": "PIBモジュールにおいて、dsRandomDropMinThreshBytesとdsRandomDropMinThreshPktsはQminをを表します。 dsRandomDropMaxThreshBytesとdsRandomDropMaxThreshPktsはQmaxとを表しています。 dsAlgDropQThresholdはQclipを表します。 dsRandomDropProbMaxはPmaxとを表しています。このPIBはPminを（別段示されない限りゼロであると仮定）を表すものではありません。"
    },
    {
      "indent": 3,
      "text": "In addition, since message memory is finite, queues generally have some upper bound above which they are incapable of storing additional traffic. Normally this number is equal to Qclip, specified by dsAlgDropQThreshold.",
      "ja": "メッセージメモリが有限であるため、また、キューは、一般的に、彼らは追加のトラフィックを保存することができないその上にバインドされ、いくつかの上部を持っています。通常、この数はdsAlgDropQThresholdで指定Qclip、に等しいです。"
    },
    {
      "indent": 3,
      "text": "Each random dropper specification is associated with a queue. This allows multiple drop processes (of same or different types) to be associated with the same queue, as different PHB implementations may require. This also allows for sequences of multiple droppers if necessary.",
      "ja": "各ランダムドロッパー仕様は、キューに関連付けられています。異なるPHBの実装が必要な場合があり、これは、同じキューに関連付けられる（同じまたは異なるタイプの）複数のドロッププロセスを可能にします。必要な場合にも、複数のドロッパーのシーケンスが可能になります。"
    },
    {
      "indent": 5,
      "text": "    +-----------------+                    +-------+\n    |AlgDrop          |                    |Queue  |\n--->| Next   ---------+-+----------------->| Next -+-->\n    | QMeasure -------+-+                  | ...   |\n    | QThreshold      |                    +-------+\n    | Type=randomDrop |   +----------------+\n    | Specific -------+-->|RandomDrop      |\n    +-----------------+   | MinThreshBytes |\n                          | MaxThreshBytes |\n                          | ProbMax        |\n                          | Weight         |\n                          | SamplingRate   |\n                          +----------------+",
      "raw": true
    },
    {
      "indent": 7,
      "text": "Figure 1: Example Use of the RandomDropTable for Random Droppers",
      "ja": "図1：ランダムドロッパーためRandomDropTableの使用例"
    },
    {
      "indent": 3,
      "text": "The calculation of a smoothed queue length may also have an important bearing on the behavior of the dropper: parameters may include the sampling interval or rate, and the weight of each sample. The performance may be very sensitive to the values of these parameters and a wide range of possible values may be required due to a wide range of link speeds. Most algorithms include a sample weight, represented here by dsRandomDropWeight. The availability of dsRandomDropSamplingRate as readable is important; the information provided by the Sampling Rate is essential to the configuration of dsRandomDropWeight. Having the Sampling Rate be configurable is also helpful, because as line speed increases, the ability to have queue sampling be less frequent than packet arrival is needed. Note however that there is ongoing research on this topic, see e.g., [ACTQMGMT] and [AQMROUTER].",
      "ja": "平滑化されたキューの長さの計算はまた、点滴器の挙動に重要なベアリングを有していてもよい：パラメータは、サンプリング間隔又はレート、および各試料の重量を含むことができます。性能は、これらのパラメータの値とにより、リンク速度の広い範囲のために必要とされ得る可能な値の広い範囲に非常に敏感であってもよいです。ほとんどのアルゴリズムはdsRandomDropWeightでここに示されたサンプルの重量が含まれます。読みやすいようdsRandomDropSamplingRateの可用性が重要です。サンプリングレートによって提供される情報はdsRandomDropWeightの構成に必要不可欠です。回線速度が増加すると、キューのサンプリングがパケットの到着よりも少ない頻度が持っている能力が必要とされているため、サンプリングレートが設定可能で持つことは、も便利です。 、[AQMROUTER] [ACTQMGMT]、例えば参照およびしかし、このトピックに関する現在進行中の研究があることに注意してください。"
    },
    {
      "indent": 3,
      "text": "Additional parameters may be added in an enterprise PIB module, e.g., by using AUGMENTS on this class, to handle aspects of random drop algorithms that are not standardized here.",
      "ja": "追加のパラメータは、ここでは標準化されていないランダムドロップアルゴリズムの側面を処理するために、このクラスにAUGMENTSを用いて、例えば、企業のPIBモジュールで添加することができます。"
    },
    {
      "indent": 3,
      "text": "NOTE: Deterministic Droppers can be viewed as a special case of Random Droppers with the drop probability restricted to 0 and 1. Hence Deterministic Droppers might be described by a Random Dropper with Pmin = 0, Pmax = 1, Qmin = Qmax = Qclip, the averaged queue length at which dropping occurs.",
      "ja": "注：確定ドロッパーは、したがって確定ドロッパーがPminを= 0とランダムスポイトによって説明されるかもしれない0と1に制限ドロップ確率でランダムドロッパーの特別なケースとして見ることができる、のPmax = 1、Qminを= Qmaxの= Qclip、ドロップが発生するキューの長さを平均しました。"
    },
    {
      "indent": 0,
      "text": "4.6.3. Queues and Schedulers",
      "section_title": true,
      "ja": "4.6.3。キューおよびスケジューラ"
    },
    {
      "indent": 3,
      "text": "The Queue PRC models simple FIFO queues, as described in [MODEL] section 7.1.1. The Scheduler PRC allows flexibility in constructing both simple and somewhat more complex queueing hierarchies from those queues. Of course, since TCBs can be cascaded multiple times on an interface, even more complex hierarchies can be constructed that way also.",
      "ja": "キューPRCモデル単純なFIFOキュー、[MODEL]セクション7.1.1に記載したように。スケジューラPRCは、それらのキューから、シンプルで多少複雑なキューイング階層の両方を構築する上で柔軟に行うことができます。 TCBは、インターフェイス上で複数回をカスケード接続することができますので、もちろん、もっと複雑な階層にもそのように構築することができます。"
    },
    {
      "indent": 3,
      "text": "Queue PRC instances are pointed at by the \"next\" attributes of the upstream elements e.g., dsMeterSucceedNext. Note that multiple upstream elements may direct their traffic to the same Queue PRI. For example, the Assured Forwarding PHB suggests that all traffic marked AF11, AF12, or AF13 be placed in the same queue after metering, without reordering. This would be represented by having the dsMeterSucceedNext of each upstream meter point at the same Queue PRI.",
      "ja": "キューPRCインスタンスはdsMeterSucceedNext、例えば上流の要素の「次」の属性によって指し示されています。複数の上流の要素が同じキューPRIへのトラフィックを指示することができることに注意してください。例えば、保証転送PHBは、すべてのトラフィックが並べ替えなくて、計量後に同じキューに入れることがAF11、AF12、AF13またはをマークしていることを示唆しています。これは、同じキューPRIの各上流メーターポイントのdsMeterSucceedNextを有することによって表現されます。"
    },
    {
      "indent": 3,
      "text": "NOTE: Queue and Scheduler PRIs are for data path description; they both use Scheduler Parameterization Table entries for diffserv treatment parameterization.",
      "ja": "注：キューとスケジューラのPRIは、データパスの説明のためのものです。彼らは両方のDiffServ処理パラメータ設定のためのスケジューラのパラメータ設定テーブルのエントリを使用します。"
    },
    {
      "indent": 3,
      "text": "A Queue Table entry specifies the scheduler it wants service from by use of its Next pointer.",
      "ja": "キュー表のエントリは、その次のポインタを使用することによってからサービスを望んでいるスケジューラを指定します。"
    },
    {
      "indent": 3,
      "text": "Each Scheduler Table entry represents the algorithm in use for servicing the one or more queues that feed it. [MODEL] section 7.1.2 describes a scheduler with multiple inputs: this is represented in the PIB by having the scheduling parameters be associated with each input. In this way, sets of Queues can be grouped together as inputs to the same Scheduler. This class serves to represent the example scheduler described in the [MODEL]: other more complex representations might be created outside of this PIB.",
      "ja": "各スケジューラテーブルエントリは、それを養う1つ以上のキューにサービスを提供するため、使用中のアルゴリズムを表します。 [MODEL]セクション7.1.2は、複数の入力を持つスケジューラを説明：これは、スケジューリングパラメータを各入力に関連付けることを有することにより、PIBに表されています。このように、キューのセットが同じスケジューラへの入力として一緒にグループ化することができます。このクラスは、[MODEL]で説明した例スケジューラを表すのに役立つ：他のより複雑な表現がこのPIBの外で作成されるかもしれません。"
    },
    {
      "indent": 3,
      "text": "Both the Queue PRC and the Scheduler PRC use instances of the Scheduler Parameterization PRC to specify diffserv treatment parameterization. Scheduler Parameter PRC instances are used to parameterize each input that feeds into a scheduler. The inputs can be a mixture of Queue PRI's and Scheduler PRI's. Scheduler Parameter PRI's can be used/reused by one or more Queue and/or Scheduler Table entries.",
      "ja": "キューPRCおよびスケジューラPRCの両方がDiffServの処理パラメータを指定するスケジューラパラメータ化PRCのインスタンスを使用します。スケジューラパラメータPRCのインスタンスは、スケジューラに供給各入力をパラメータ化するために使用されています。入力は、キューPRIのスケジューラPRIのの混合物であることができます。スケジューラパラメータPRIのは、一個の以上のキューおよび/またはスケジューラテーブルのエントリで再利用/使用することができます。"
    },
    {
      "indent": 3,
      "text": "For representing a Strict Priority scheduler, each scheduler input is assigned a priority with respect to all the other inputs feeding the same scheduler, with default values for the other parameters. A higher-priority input which contains traffic that is not being delayed for shaping will be serviced before a lower-priority input.",
      "ja": "完全優先スケジューラを表すために、各スケジューラ入力は、他のパラメータのデフォルト値と同じスケジューラを供給するほかのすべての入力に対して優先順位が割り当てられます。成形のために遅延されていないトラフィックが含まれ、より高い優先度の入力は低い優先順位の入力の前にサービスされます。"
    },
    {
      "indent": 3,
      "text": "For Weighted Scheduling methods e.g., WFQ, WRR, the \"weight\" of a given scheduler input is represented with a Minimum Service Rate leaky-bucket profile that provides a guaranteed minimum bandwidth to that input, if required. This is represented by a rate dsMinRateAbsolute; the classical weight is the ratio between that rate and the interface speed, or perhaps the ratio between that rate and the sum of the configured rates for classes. Alternatively, the rate may be represented by a relative value, as a fraction of the interface's current line rate, dsMinRateRelative to assist in cases where line rates are variable or where a higher-level policy might be expressed in terms of fractions of network resources. The two rate parameters are inter-related and changes in one may be reflected in the other.",
      "ja": "必要に応じて加重スケジューリング方法のために、例えば、WFQ、WRR、所与スケジューラ入力の「重み」は、その入力に最低保証帯域幅を提供最小サービスレートリーキーバケットプロファイルで表されています。これは、レートdsMinRateAbsoluteで表されます。古典的な量は、その速度とインターフェイス速度、又はおそらくその速度およびクラスの構成率の和との比との比です。代替的に、速度は、線速度が可変であるか、またはより高いレベルのポリシーは、ネットワークリソースの画分で表現されるかもしれない場合には支援するインタフェースの現在の回線速度、dsMinRateRelativeの割合として、相対値で表すことができます。 2つのレートのパラメータが相互に関連している一つの変化は、他にも反映されてもよいです。"
    },
    {
      "indent": 3,
      "text": "For weighted scheduling methods, one can say loosely, that WRR focuses on meeting bandwidth sharing, without concern for relative delay amongst the queues, where WFQ control both queue service order and amount of traffic serviced, providing meeting bandwidth sharing and relative delay ordering amongst the queues.",
      "ja": "加重スケジューリング方式の場合、1は、間会議帯域幅の共有と相対的な遅延の順序を提供し、WRRはWFQがキューサービスのため、交通サービスの量の両方を制御キューの中での相対的な遅延を気にせず、会議の帯域幅の共有に焦点を当てていることを、緩く言うことができますキュー。"
    },
    {
      "indent": 3,
      "text": "A queue or scheduled set of queues (which is an input to a scheduler) may also be capable of acting as a non-work-conserving [MODEL] traffic shaper: this is done by defining a Maximum Service Rate leaky-bucket profile in order to limit the scheduler bandwidth available to that input. This is represented by a rate dsMaxRateAbsolute; the classical weight is the ratio between that rate and the interface speed, or perhaps the ratio between that rate and the sum of the configured rates for classes. Alternatively, the rate may, be represented by a relative value, as a fraction of the interface's current line rate, dsMaxRateRelative. There was discussion in the working group about alternative modeling approaches, such as defining a shaping action or a shaping element. We did not take this approach because shaping is in fact something a scheduler does to its inputs, (which we model as a queue with a maximum rate or a scheduler whose output has a maximum rate) and we felt it was simpler and more elegant to simply describe it in that context. Additionally, multi-rate shaper [SHAPER] can be represented by the use of multiple dsMaxRateTable entries.",
      "ja": "（スケジューラに入力されている）、キューまたはキューのスケジュールされたセットは、非作業保存[MODEL]トラフィックシェーパーとして機能することが可能である：これは順に最大サービスレートリーキーバケットプロファイルを定義することによって行われますその入力に利用できるスケジューラ帯域幅を制限します。これは、レートdsMaxRateAbsoluteで表されます。古典的な量は、その速度とインターフェイス速度、又はおそらくその速度およびクラスの構成率の和との比との比です。代替的に、速度は、インタフェースの現在の回線速度、dsMaxRateRelativeの割合として、相対値で表すことができます。このようシェーピングアクションまたは造形要素を定義するなどの代替のモデリング手法に関するワーキンググループでの議論がありました。シェーピングは実際には、スケジューラは、その入力にないものですので、私たちは（私たちは、その出力が最大速度を持っている最大レートまたはスケジューラでキューとしてモデル化している）、このアプローチを取ることはありませんでしたし、我々はそれが簡単で、よりエレガントだと感じました単にその文脈でそれを説明します。また、マルチレート整形器[整形器】複数dsMaxRateTableエントリを使用することによって表現することができます。"
    },
    {
      "indent": 3,
      "text": "Other types of priority and weighted scheduling methods can be defined using existing parameters in dsMinRateEntry. NOTE: dsSchedulerMethod uses AutonomousType syntax, with the different types of scheduling methods defined as OBJECT-IDENTITY. Future scheduling methods may be defined in other PIBs. This requires an OBJECT-IDENTITY definition, a description of how the existing objects are reused, if they are, and any new objects they require.",
      "ja": "優先順位および加重スケジューリング方法の他のタイプのdsMinRateEntryで既存のパラメータを使用して定義することができます。注：dsSchedulerMethodはOBJECT-IDENTITYとして定義されたスケジューリング方式の異なる種類で、AutonomousTypeの構文を使用しています。将来のスケジューリング方法は、他のPIBで定義されてもよいです。これは、彼らがある場合は、OBJECT-IDENTITYの定義、既存のオブジェクトを再利用する方法の説明を必要とし、彼らが必要とする新しいオブジェクト。"
    },
    {
      "indent": 3,
      "text": "NOTE: Hierarchical schedulers can be parameterized using this PIB by having Scheduler Table entries feeds into Scheduler Table entry.",
      "ja": "注：階層的なスケジューラは、スケジューラテーブルのエントリを持っていることによって、このPIBを使用してパラメータ化することができ、スケジューラ表のエントリにフィード。"
    },
    {
      "indent": 0,
      "text": "4.7. Specifying Device Capabilities",
      "section_title": true,
      "ja": "4.7。デバイス機能を指定します"
    },
    {
      "indent": 3,
      "text": "The DiffServ PIB uses the Base PRC classes frwkPrcSupportTable and frwkCompLimitsTable defined in [FR-PIB] to specify what PRC's are supported by a PEP and to specify any limitations on that support. The PIB also uses the capability PRC's frwkCapabilitySetTable and frwkIfRoleComboTable defined in [FR-PIB] to specify the device's capability sets, interface types, and role combinations. Each instance of the capability PRC frwkCapabilitySetTable contains an OID that points to an instance of a PRC that describes some capability of that interface type. The DiffServ PIB defines several of these capability PRCs, that assist the PDP with the configuration of DiffServ functional elements that can be implemented by the device. Each of these capability PRCs contains a direction attribute that specifies the direction for which the capability applies. This attribute is defined in a base capability PRC, which is extended by each specific capability PRC.",
      "ja": "DiffServのPIBは、[FR-PIB]で定義された基本PRCクラスfrwkPrcSupportTableとfrwkCompLimitsTableはPRCのは、PEPによってサポートされているものを指定すると、その支持体上の任意の制限を指定するには、使用しています。 PIBはまた、PRCのfrwkCapabilitySetTableとfrwkIfRoleComboTableは、デバイスの機能セット、インターフェイスタイプ、および役割の組み合わせを指定する[FR-PIB]で定義された機能を使用します。能力PRC frwkCapabilitySetTableの各インスタンスは、そのインターフェイスのタイプのいくつかの能力を記述するPRCのインスタンスを指すOIDを含んでいます。 DiffServのPIBは、そのデバイスによって実現することができるDiffServの機能要素の構成でPDPを助ける、これらの能力の位相応答曲線のいくつかを定義します。これらの機能のPRCsは、それぞれの能力を適用する方向を指定する方向属性が含まれています。この属性は、それぞれの特定の能力PRCによって拡張された塩基性PRCに定義されています。"
    },
    {
      "indent": 3,
      "text": "Classification capabilities, which specify the information elements the device can use to classify traffic, are reported using the dsIfClassificationCaps PRC. Metering capabilities, which indicate what the device can do with out-of-profile packets, are specified using the dsIfMeteringCaps PRC. Scheduling capabilities, such as the number of inputs supported, are reported using the dsIfSchedulingCaps PRC. Algorithmic drop capabilities, such as the types of algorithms supported, are reported using the dsIfAlgDropCaps PRC. Queue capabilities, such as the maximum number of queues, are reported using the dsIfQueueCaps PRC. Maximum Rate capabilities, such as the maximum number of max rate Levels, are reported using the dsIfMaxRateCaps PRC.",
      "ja": "デバイスがトラフィックを分類するために使用できる情報要素を指定する分類機能は、dsIfClassificationCaps PRCを使用して報告しています。デバイスは、プロファイル外のパケットで何ができるかを示している測光機能は、dsIfMeteringCaps PRCを使用して指定されています。そのようなサポートされている入力の数などのスケジューリング機能は、dsIfSchedulingCaps PRCを使用して報告されています。そのようなサポートされるアルゴリズムのタイプなどのアルゴリズムドロップ機能は、dsIfAlgDropCaps PRCを使用して報告されています。そのようなキューの最大数としてキュー機能は、dsIfQueueCaps PRCを使用して報告されています。そのような最大レートレベルの最大数として最大レート機能は、dsIfMaxRateCaps PRCを使用して報告しています。"
    },
    {
      "indent": 3,
      "text": "Two PRC's are defined to allow specification of the element linkage capabilities of the PEP. The dsIfElmDepthCaps PRC indicates the maximum number of functional datapath elements that can be linked consecutively in a datapath. The dsIfElmLinkCaps PRC indicates what functional datapath elements may follow a specific type of element in a datapath.",
      "ja": "二つのPRCのは、PEPの要素結合機能の仕様を許可するように定義されています。 dsIfElmDepthCaps PRCは、データパスに連続連結することができる機能データパス要素の最大数を示しています。 dsIfElmLinkCaps PRCは、機能データパス要素はデータパス内の要素の特定のタイプに従うことができるかを示します。"
    },
    {
      "indent": 3,
      "text": "The capability reporting classes in the DiffServ and Framework PIB are meant to allow the PEP to indicate some general guidelines about what the device can do. They are intended to be an aid to the PDP when it constructs policy for the PEP. These classes do not necessarily allow the PEP to indicate every possible configuration that it can or cannot support. If a PEP receives a policy that it cannot implement, it must notify the PDP with a failure report. Currently [COPS-PR] error handling mechanism as specified in [COPS-PR] sections 4.4, 4.5, and 4.6 completely handles all known error cases of this PIB; hence no additional methods or PRCs need to be specified here.",
      "ja": "DiffServのとフレームワークPIBの機能レポートクラスは、PEPは、デバイスが何ができるかについてのいくつかの一般的なガイドラインを示すことができるように意図されています。彼らはそれがPEPのためのポリシーを作成するときPDPへの援助であることを意図しています。これらのクラスは必ずしもPEPはそれがまたはサポートできないことができるすべての可能な構成を示すことができません。 PEPは、それが実装できないポリシーを受信した場合、それはエラーレポートとPDPに通知しなければなりません。現在[COPS-PR] [COPS-PR]セクション4.4、4.5、で指定され、4.6が完全にこのPIBのすべての既知のエラーケースを扱うように機構をエラー処理。したがって、追加のメソッドやのPRCsは、ここで指定する必要はありません。"
    },
    {
      "indent": 0,
      "text": "5. PIB Usage Example",
      "section_title": true,
      "ja": "5. PIBの使用例"
    },
    {
      "indent": 3,
      "text": "This section provides some examples on how the different table entries of this PIB may be used together for a DiffServ Device. The usage of each individual attribute is defined within the PIB module itself. For the figures, all the PIB table entry and attribute names are assumed to have \"ds\" as their first common initial part of the name, with the table entry name assumed to be their second common initial part of the name. \"0.0\" is being used to mean zeroDotZero. And for Scheduler Method \"= X\" means \"using the OID of diffServSchedulerX\".",
      "ja": "このセクションでは、このPIBの異なるテーブルエントリはDiffServのデバイスのために一緒に使用することができる方法のいくつかの例を提供します。各個々の属性の使用は、PIBモジュール自体内で定義されています。数字の場合は、すべてのPIBテーブルエントリおよび属性名は、名前の彼らの第2の共通の初期の部分であると想定テーブルエントリ名で、名前の彼らの最初の一般的な初期の部分として、「DS」を持っていると想定されています。 「0.0」のzeroDotZeroを意味するために使用されています。そして、スケジューラ方法「= X」の手段のために「diffServSchedulerXのOIDを使用して」。"
    },
    {
      "indent": 0,
      "text": "5.1. Data Path Example",
      "section_title": true,
      "ja": "5.1。データパスの例"
    },
    {
      "indent": 3,
      "text": "Notice Each entry of the DataPath table is used for a specific interface type handling a flow in a specific direction for a specific functional role-combination. For our example, we just define one such entry.",
      "ja": "特定の機能的役割の組み合わせのために特定の方向に流れを処理する特定のインターフェイスタイプのために使用されるデータパステーブルの各エントリに注目してください。この例では、我々はただ一つ、このようなエントリを定義します。"
    },
    {
      "indent": 6,
      "text": "+---------------------+\n|DataPath             |\n| CapSetName =\"IfCap1\"|\n| Roles = \"A+B\"       |\n| IfDirection=Ingress |    +---------+\n| Start --------------+--->|Clfr     |\n+---------------------+    | Id=Dept |\n                           +---------+",
      "raw": true
    },
    {
      "indent": 24,
      "text": "Figure 2: DataPath Usage Example",
      "ja": "図2：データパスの使用例"
    },
    {
      "indent": 3,
      "text": "In Figure 2, we are using IfCap1 to indicate interface type with capability set 1 handling ingress flow for functional roles of \"A+B\". We are using classifier for departments to lead us into the Classifier Example below.",
      "ja": "図2において、我々は、能力が「A + B」の機能的役割の1つのハンドリング入口流量を設定してIfCap1インターフェイスタイプを示すために使用されています。部門は、以下の分類子の例に私たちをリードするために私たちは、分類器を使用しています。"
    },
    {
      "indent": 0,
      "text": "5.2. Classifier and Classifier Element Example",
      "section_title": true,
      "ja": "5.2。クラシファイアとクラシファイア要素例"
    },
    {
      "indent": 3,
      "text": "We want to show how a multilevel classifier can be built using the classifier tables provided by this PIB. Notice we didn't go into details on the filters because they are not defined by this PIB. Continuing in the Data Path example from the previous section, lets say we want to perform the following classification functionality to do flow separation based on department and application type:",
      "ja": "私たちは、マルチレベル分類器がこのPIBが提供する分類子テーブルを使用して構築することができる方法を示したいと思います。彼らはこのPIBで定義されていないので、我々は、フィルタの詳細には触れませんでした注意してください。前のセクションからのデータパスの例で続けると、我々は、部門やアプリケーションの種類に基づいて、流れの分離を行うには、次の分類機能を実行したい言うことができます："
    },
    {
      "indent": 6,
      "text": "if (Dept1) then take Dept1-action { if (Appl1) then take Dept1-Appl1-action. if (Appl2) then take Dept1-Appl2-action. if (Appl3) then take Dept1-Appl3-action.",
      "ja": "（APPL1）を次にDEPT1-APPL1アクションを取る場合（DEPT1）を{DEPT1アクションを取る場合。 （APPL2）をDEPT1-APPL2-行動を取る場合。 （Appl3）をDEPT1-Appl3-行動を取る場合。"
    },
    {
      "indent": 6,
      "text": "} if (Dept2) then take Dept2-action { if (Appl1) then take Dept2-Appl1-action. if (Appl2) then take Dept2-Appl2-action. if (Appl3) then take Dept2-Appl3-action. } if (Dept3) then take Dept3-action { if (Appl1) then take Dept3-Appl1-action. if (Appl2) then take Dept3-Appl2-action. if (Appl3) then take Dept3-Appl3-action. }",
      "ja": "（APPL1）を次にDEPT2-APPL1アクションを取る場合}（DEPT2）場合、{DEPT2アクションを取ります。 （APPL2）をDEPT2-APPL2-行動を取る場合。 （Appl3）をDEPT2-Appl3-行動を取る場合。 （APPL1）を次にDept3-APPL1アクションを取る場合}（Dept3）場合、{Dept3アクションを取ります。 （APPL2）をDept3-APPL2-行動を取る場合。 （Appl3）をDept3-Appl3-行動を取る場合。 }"
    },
    {
      "indent": 3,
      "text": "The above classification logic is translated into the following PIB table entries, with two levels of classifications.",
      "ja": "上記分類論理は、分類2つのレベルで、次のPUBテーブルエントリに変換されます。"
    },
    {
      "indent": 3,
      "text": "First for department:",
      "ja": "部門のためのファースト："
    },
    {
      "indent": 3,
      "text": "+---------+\n|Clfr     |\n| Id=Dept |\n+---------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "+-------------+      +-----------+\n|ClfrElement  |  +-->|Clfr       |\n| Id=Dept1    |  |   | Id=D1Appl |\n| ClfrId=Dept |  |   +-----------+\n| Preced=NA   |  |\n| Next -------+--+   +------------+\n| Specific ---+----->|Filter Dept1|\n+-------------+      +------------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "+-------------+      +-----------+\n|ClfrElement  |  +-->|Clfr       |\n| Id=Dept2    |  |   | Id=D2Appl |\n| ClfrId=Dept |  |   +-----------+\n| Preced=NA   |  |\n| Next -------+--+   +------------+\n| Specific ---+----->|Filter Dept2|\n+-------------+      +------------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "+-------------+      +-----------+\n|ClfrElement  |  +-->|Clfr       |\n| Id=Dept3    |  |   | Id=D3Appl |\n| ClfrId=Dept |  |   +-----------+\n| Preced=NA   |  |\n| Next -------+--+   +------------+\n| Specific ---+----->|Filter Dept3|\n+-------------+      +------------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Second for application:",
      "ja": "アプリケーションのための第二："
    },
    {
      "indent": 3,
      "text": "+-----------+\n|Clfr       |\n| Id=D1Appl |\n+-----------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "+---------------+                     +--------------+\n|ClfrElement    |  +----------------->|Meter         |\n| Id=D1Appl1    |  |                  | Id=D1A1Rate1 |\n| ClfrId=D1Appl |  |                  | SucceedNext -+--->...\n| Preced=NA     |  |                  | FailNext ----+--->...\n| Next ---------+--+  +------------+  | Specific ----+--->...\n| Specific -----+---->|Filter Appl1|  +--------------+\n+---------------+     +------------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "+---------------+                     +--------------+\n|ClfrElement    |  +----------------->|Meter         |\n| Id=D1Appl2    |  |                  | Id=D1A2Rate1 |\n| ClfrId=D1Appl |  |                  | SucceedNext -+--->...\n| Preced=NA     |  |                  | FailNext ----+--->...\n| Next ---------+--+  +------------+  | Specific ----+--->...\n| Specific -----+---->|Filter Appl2|  +--------------+\n+---------------+     +------------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "+---------------+                     +--------------+\n|ClfrElement    |  +----------------->|Meter         |\n| Id=D1Appl3    |  |                  | Id=D1A3Rate1 |\n| ClfrId=D1Appl |  |                  | SucceedNext -+--->...\n| Preced=NA     |  |                  | FailNext ----+--->...\n| Next ---------+--+  +------------+  | Specific ----+--->...\n| Specific -----+---->|Filter Appl3|  +--------------+\n+---------------+     +------------+",
      "raw": true
    },
    {
      "indent": 20,
      "text": "Figure 3: Classifier Usage Example",
      "ja": "図3：クラシファイアの使用例"
    },
    {
      "indent": 3,
      "text": "The application classifiers for department 2 and 3 will be very much like the application classifier for department 1 shown above. Notice in this example, Filters for Appl1, Appl2, and Appl3 are reusable across the application classifiers.",
      "ja": "部門2及び3のアプリケーション分類は非常に上に示した部門1のアプリケーション分類子のようになります。この例では注意してください、APPL1、APPL2、およびAppl3のフィルタは、アプリケーションの分類間で再利用可能です。"
    },
    {
      "indent": 3,
      "text": "This classifier and classifier element example assume the next differentiated services functional datapath element is Meter and leads us into the Meter Example section.",
      "ja": "このクラシファイアとクラシファイア要素の例は次の差別化サービス機能データパス要素はメーターで、メーターの例セクションに私たちをリード前提としています。"
    },
    {
      "indent": 0,
      "text": "5.3. Meter Example",
      "section_title": true,
      "ja": "5.3。メーターの例"
    },
    {
      "indent": 3,
      "text": "A single rate simple Meter may be easy to envision, hence we will do a Two Rate Three Color [TRTCM] example, using two Meter table entries and two TBParam table entries.",
      "ja": "シングルレートシンプルなメーターは、したがって、我々は2メートルのテーブルエントリと2つのTBParamテーブルエントリを使用して、2つのレート3色[TRTCM]の例を尽くします、想像しやすいかもしれません。"
    },
    {
      "indent": 3,
      "text": "+--------------+    +---------+     +--------------+    +----------+\n|Meter         | +->|Action   |  +->| Meter        | +->|Action    |\n| Id=D1A1Rate1 | |  | Id=Green|  |  | Id=D1A1Rate2 | |  | Id=Yellow|\n| SucceedNext -+-+  +---------+  |  | SucceedNext -+-+  +----------+\n| FailNext ----+-----------------+  | FailNext ----+--+  +-------+\n| Specific -+  |                    | Specific -+  |  +->|Action |\n+-----------+--+                    +-----------+--+     | Id=Red|\n            |                                   |        +-------+\n            |  +------------+                   |  +------------+\n            +->|TBParam     |                   +->|TBParam     |\n               | Type=TRTCM |                      | Type=TRTCM |\n               | Rate       |                      | Rate       |\n               | BurstSize  |                      | BurstSize  |\n               | Interval   |                      | Interval   |\n               +------------+                      +------------+",
      "raw": true
    },
    {
      "indent": 23,
      "text": "Figure 4: Meter Usage Example",
      "ja": "図4：メーター使用例"
    },
    {
      "indent": 3,
      "text": "For [TRTCM], the first level TBParam entry is used for Committed Information Rate and Committed Burst Size Token Bucket, and the second level TBParam entry is used for Peak Information Rate and Peak Burst Size Token Bucket.",
      "ja": "【TRTCM]のため、第一レベルTBParamエントリは、認定情​​報速度と認定バーストサイズトークンバケットに使用され、第二レベルTBParamエントリは、ピーク情報速度とピークバーストサイズトークンバケットのために使用されます。"
    },
    {
      "indent": 3,
      "text": "The other meters needed for this example will depend on the service class each classified flow uses. But their construction will be similar to the example given here. The TBParam table entries can be shared by multiple Meter table entries.",
      "ja": "この例のために必要な他のメーターは、各分類フローが使用するサービスのクラスに依存するであろう。しかし、彼らの建設は、ここに挙げた例のようになります。 TBParamテーブルのエントリは、複数のメーターテーブルエントリで共有することができます。"
    },
    {
      "indent": 3,
      "text": "In this example the differentiated services functional datapath element following Meter is Action, detailed in the following section.",
      "ja": "この例ではメーター以下差別化サービス機能データパス要素は、次のセクションで詳述するアクションです。"
    },
    {
      "indent": 0,
      "text": "5.4. Action Example",
      "section_title": true,
      "ja": "5.4。アクションの例"
    },
    {
      "indent": 3,
      "text": "Typically, Mark Action will be used; we will continue using the \"Action, Id=Green\" branch off the Meter example.",
      "ja": "一般的に、マーク・アクションが使用されます。私たちは、メーターの例オフ「アクション、ID =グリーン」ブランチを使用していきます。"
    },
    {
      "indent": 3,
      "text": "Recall this is the D1A1Rate1 SucceedNext branch, meaning the flow belongs to Department 1 Application 1, within the committed rate and burst size limits for this flow. We would like to Mark this flow with a specific DSCP and also with a device internal label.",
      "ja": "流れは、このフローの認定速度とバーストサイズ制限内、部門1アプリケーション1に属している意味、これはD1A1Rate1 SucceedNextブランチです思い出してください。私たちは、特定のDSCPとしても、デバイス内部のラベルで、この流れをマークしたいと思います。"
    },
    {
      "indent": 3,
      "text": "+-----------+                     +-----------+  +--->AlgDropAF11\n|Action     |  +----------------->|Action     |  |\n| Next -----+--+  +------------+  | Next -----+--+ +-------------+\n| Specific -+---->|DscpMarkAct |  | Specific -+--->|ILabelMarker |\n+-----------+     | Dscp=AF11  |  +-----------+    | ILabel=D1A1 |\n                  +------------+                   +-------------+",
      "raw": true
    },
    {
      "indent": 22,
      "text": "Figure 5: Action Usage Example",
      "ja": "図5：アクションの使用例"
    },
    {
      "indent": 3,
      "text": "This example uses the frwkILabelMarker PRC defined in [FR-PIB], showing the device internal label being used to indicate the micro flow that feeds into the aggregated AF flow. This device internal label may be used for flow accounting purposes and/or other data path treatments.",
      "ja": "この例では、集約されたAFフローに供給するマイクロ流を示すために使用されるデバイス内部のラベルを示し、[FR-PIB]で定義されたfrwkILabelMarker PRCを使用します。このデバイス内部のラベルは、フロー会計目的および/または他のデータ・パスの治療のために使用することができます。"
    },
    {
      "indent": 0,
      "text": "5.5. Dropper Examples",
      "section_title": true,
      "ja": "5.5。スポイト例"
    },
    {
      "indent": 3,
      "text": "The Dropper examples below will continue from the Action example above for AF11 flow. We will provide three different dropper setups, from simple to complex. The examples below may include some queuing structures; they are here only to show the relationship of the droppers to queuing and are not complete. Queuing examples are provided in later sections.",
      "ja": "スポイトの例を以下にAF11の流れのための上記のアクションの例から継続されます。私たちは、単純なものから複雑なものまで、三つの異なるドロッパーセットアップを提供します。以下の実施例は、いくつかのキューイング構造を含むことができます。彼らは唯一のキューイングへのドロッパーの関係を示すためにここにいると、完全ではありません。キューイングの例は後のセクションで提供されています。"
    },
    {
      "indent": 0,
      "text": "5.5.1. Tail Dropper Example",
      "section_title": true,
      "ja": "5.5.1。テールドロッパー例"
    },
    {
      "indent": 3,
      "text": "The Tail Dropper is one of the simplest. For this example we just want to drop part of the flow that exceeds the queue's buffering capacity, 2 Mbytes.",
      "ja": "テールドロッパーは、最も簡単なの一つです。この例では、私たちはただキューの緩衝能、2Mバイトを超える流れの一部をドロップします。"
    },
    {
      "indent": 3,
      "text": "+--------------------+       +------+\n|AlgDrop             |    +->|Q AF1 |\n| Id=AF11            |    |  +------+\n| Type=tailDrop      |    |\n| Next --------------+-+--+\n| QMeasure ----------+-+\n| QThreshold=2Mbytes |\n| Specific=0.0       |\n+--------------------+",
      "raw": true
    },
    {
      "indent": 19,
      "text": "Figure 6: Tail Dropper Usage Example",
      "ja": "図6：テールドロッパーの使用例"
    },
    {
      "indent": 0,
      "text": "5.5.2. Single Queue Random Dropper Example",
      "section_title": true,
      "ja": "5.5.2。シングルキューランダムスポイト例"
    },
    {
      "indent": 3,
      "text": "The use of Random Dropper will introduce the usage of dsRandomDropEntry as in the example below.",
      "ja": "ランダムスポイトの使用については、以下の例のようにdsRandomDropEntryの使い方を紹介します。"
    },
    {
      "indent": 3,
      "text": "+-----------------+       +------+\n|AlgDrop          |    +->|Q AF1 |\n| Id=AF11         |    |  +------+\n| Type=randomDrop |    |\n| Next -----------+-+--+\n| QMeasure -------+-+\n| QThreshold      |   +----------------+\n| Specific -------+-->|RandomDrop      |\n+-----------------+   | MinThreshBytes |\n                      | MinThreshPkts  |\n                      | MaxThreshBytes |\n                      | MaxThreshPkts  |\n                      | ProbMax        |\n                      | Weight         |\n                      | SamplingRate   |\n                      +----------------+",
      "raw": true
    },
    {
      "indent": 12,
      "text": "Figure 7: Single Queue Random Dropper Usage Example",
      "ja": "図7：シングルキューランダムスポイトの使用例"
    },
    {
      "indent": 3,
      "text": "Notice for Random Dropper, dsAlgDropQThreshold contains the maximum average queue length, Qclip, for the queue being measured as indicated by dsAlgDropQMeasure, the rest of the Random Dropper parameters are specified by dsRandomDropEntry as referenced by dsAlgDropSpecific. In this example, both dsAlgDropNext and dsAlgDropQMeasure references the same queue. This is the simple case but dsAlgDropQMeasure may reference another queue for PEP implementation supporting this feature.",
      "ja": "ランダムドロッパー、dsAlgDropQThresholdための通知はdsAlgDropQMeasureによって示されるようにdsAlgDropSpecificによって参照されるようなランダムドロッパーパラメータの残りはdsRandomDropEntryによって指定され、測定されたキューに、最大平均キュー長、Qclipを含んでいます。この例では、dsAlgDropNextとdsAlgDropQMeasureの両方が同じキューを参照します。これは、単純なケースですが、dsAlgDropQMeasureは、この機能をサポートしているPEPの実装のための別のキューを参照することがあります。"
    },
    {
      "indent": 0,
      "text": "5.5.3. Multiple Queue Random Dropper Example",
      "section_title": true,
      "ja": "5.5.3。複数のキューランダムスポイト例"
    },
    {
      "indent": 3,
      "text": "When network device implementation requires measuring multiple queues in determining the behavior of a drop algorithm, the existing PRCs defined in this PIB will be sufficient for the simple case, as indicated by this example.",
      "ja": "ネットワークデバイスの実装は、ドロップアルゴリズムの挙動を決定する際に複数のキューを測定する必要とする場合、このPIBで定義された既存の位相応答曲線は、この例で示されるように、単純なケースのために十分であろう。"
    },
    {
      "indent": 3,
      "text": "+-------------+                                         +------+\n|AlgDrop      | +----------------+-------------------+->|Q_AF1 |\n| Id=AF11     | |                |                   |  +------+\n| Type=mQDrop | |                |                   |\n| Next -------+-+ +------------+ |    +------------+ |\n| QMeasure ---+-->|MQAlgDrop   | | +->|MQAlgDrop   | |\n| QThreshold  |   | Id=AF11A   | | |  | Id=AF11B   | |\n| Specific    |   | Type       | | |  | Type       | |\n+-------------+   | Next ------+-+ |  | Next ------+-+\n                  | ExceedNext +---+  | ExceedNext |   +------+\n                  | QMeasure --+-+    | QMeasure --+-->|Q_AF2 |\n                  | QThreshold | |    | QThreshold |   +------+\n                  | Specific + | |    | Specific + |\n                  +----------+-+ |    +----------+-+\n                             |   |           +---+\n                      +------+   |  +------+ |\n                      |          +->|Q_AF1 | |\n                      |             +------+ |\n                      |                      |\n                      |  +----------------+  |  +----------------+\n                      +->|RandomDrop      |  +->|RandomDrop      |\n                         | MinThreshBytes |     | MinThreshBytes |\n                         | MinThreshPkts  |     | MinThreshPkts  |\n                         | MaxThreshBytes |     | MaxThreshBytes |\n                         | MaxThreshPkts  |     | MaxThreshPkts  |\n                         | ProbMax        |     | ProbMax        |\n                         | Weight         |     | Weight         |\n                         | SamplingRate   |     | SamplingRate   |\n                         +----------------+     +----------------+",
      "raw": true
    },
    {
      "indent": 11,
      "text": "Figure 8: Multiple Queue Random Dropper Usage Example",
      "ja": "図8：複数のキューランダムスポイトの使用例"
    },
    {
      "indent": 3,
      "text": "For this example, we have two queues, Q_AF1 and Q_AF2, sharing the same buffer resources. We want to make sure the common buffer resource is sufficient to service the AF11 traffic, and we want to measure the two queues for determining the drop algorithm for AF11 traffic feeding into Q_AF1. Notice mQDrop is used for dsAlgDropType of dsAlgDropEntry to indicate Multiple Queue Dropping Algorithm.",
      "ja": "この例では、同じバッファ資源を共有する、2つのキュー、Q_AF1とQ_AF2を持っています。私たちは、共通のバッファリソースがAF11のトラフィックにサービスを提供するのに十分であることを確認したい、と我々はQ_AF1に供給AF11トラフィックのドロップアルゴリズムを決定するための2つのキューを測定したいです。お知らせmQDropは、複数のキューの削除アルゴリズムを示すためにdsAlgDropEntryのdsAlgDropTypeのために使用されています。"
    },
    {
      "indent": 3,
      "text": "The common shared buffer resource is indicated by the use of dsAlgDropEntry, with their attributes used as follows:",
      "ja": "その属性を使用して次のように共通の共有バッファリソースは、dsAlgDropEntryの使用によって示されています。"
    },
    {
      "indent": 3,
      "text": "- dsAlgDropType indicates the algorithm used, mQDrop. - dsAlgDropNext is used to indicate the next functional data path element to handle the flow when no drop occurs. - dsAlgDropQMeasure is used as the anchor for the list of dsMQAlgDropEntry, one for each queue being measured.",
      "ja": " -  dsAlgDropTypeはmQDrop、使用するアルゴリズムを示します。 -  dsAlgDropNextには、ドロップが発生していない場合のフローを処理するために、次の機能データパス要素を示すために使用されます。 -  dsAlgDropQMeasureはdsMQAlgDropEntry、測定されているキューごとに1のリストのためのアンカーとして使用されています。"
    },
    {
      "indent": 3,
      "text": "- dsAlgDropQThreshold is used to indicate the size of the shared buffer pool. - dsAlgDropSpecific can be used to reference instances of additional PRC (not defined in this PIB) if more parameters are required to describe the common shared buffer resource.",
      "ja": " -  dsAlgDropQThresholdは、共有バッファプールの大きさを示すために使用されます。 -  dsAlgDropSpecificは、複数のパラメータが共通の共有バッファリソースを記述するために必要とされる場合は、追加のPRC（このPIBで定義されていない）のインスタンスを参照するために使用することができます。"
    },
    {
      "indent": 3,
      "text": "For this example, there are two subsequent dsMQAlgDropEntrys, one for each queue being measured, with its attributes used as follows:",
      "ja": "この例では、二つの連続dsMQAlgDropEntrys、次のように使用されるその属性と、測定される各キューのための1つがあります。"
    },
    {
      "indent": 3,
      "text": "- dsMQAlgDropType indicates the algorithm used, for this example, both dsMQAlgDropType uses randomDrop. - dsMQAlgDropQMeasure indicates the queue being measured. - dsMQAlgDropNext indicates the next functional data path element to handle the flow when no drop occurs. - dsMQAlgDropExceedNext is used to indicate the next queue's dsMQAlgDropEntry. With the use of zeroDotZero to indicate the last queue. - dsMQAlgDropQMeasure is used to indicate the queue being measured. For this example, Q_AF1 and Q_AF2 are the two queues used. - dsAlgDropQThreshold is used as in single queue Random Dropper. - dsAlgDropSpecific is used to reference the PRID that describes the dropper parameters as in its normal usage. For this example both dsAlgDropSpecifics reference dsRandomDropEntrys.",
      "ja": " -  dsMQAlgDropTypeは、この例では、両方のdsMQAlgDropTypeはrandomDropを使用して、使用されるアルゴリズムを示します。 -  dsMQAlgDropQMeasureは測定されているキューを示します。 -  dsMQAlgDropNextには、ドロップが発生していない場合のフローを処理するために、次の機能データパス要素を示しています。 -  dsMQAlgDropExceedNextは次のキューのdsMQAlgDropEntryを示すために使用されます。 zeroDotZeroを使用すると、最後のキューを示します。 -  dsMQAlgDropQMeasureが測定されたキューを示すために使用されます。この例では、Q_AF1とQ_AF2は使用2つのキューです。 -  dsAlgDropQThresholdは、単一のキューランダムスポイトのように使用されています。 -  dsAlgDropSpecificは、その通常の使用のようにスポイトパラメータを示しPRIDを参照するために使用されます。この例では、両方のdsAlgDropSpecificsはdsRandomDropEntrysを参照します。"
    },
    {
      "indent": 3,
      "text": "Notice the anchoring dsAlgDropEntry and the two dsMQAlgDropEntrys all have their Next attribute pointing to Q_AF1. This indicates:",
      "ja": "アンカーdsAlgDropEntryと2 dsMQAlgDropEntrysすべてがQ_AF1を指している彼らの次の属性を持って注意してください。これは示しています。"
    },
    {
      "indent": 3,
      "text": "- If the packet does not need to be checked with the individual queue's drop processing because of abundance of common shared buffer resources, then the packet is sent to Q_AF1. - If the packet is not dropped due to current Q_AF1 conditions, then it is sent to Q_AF1. - If the packet is not dropped due to current Q_AF2 conditions, then it is sent to Q_AF1.",
      "ja": " - パケットがあるため、共通の共有バッファ資源の豊富の個々のキューのドロップ処理で確認する必要がない場合、パケットはQ_AF1に送信されます。 - パケットが現在のQ_AF1条件が原因で廃棄されていない場合、それはQ_AF1に送信されます。 - パケットが現在のQ_AF2条件が原因で廃棄されていない場合、それはQ_AF1に送信されます。"
    },
    {
      "indent": 3,
      "text": "This example also uses two dsRandomDropEntrys for the two queues it measures. Their attribute usage is the same as if for single queue random dropper.",
      "ja": "また、この例では、それが測定2つのキューのための2つdsRandomDropEntrysを使用しています。その属性の使用方法は、単一のキューランダムスポイトのための場合と同じです。"
    },
    {
      "indent": 3,
      "text": "Other more complex result combinations can be achieved by specifying a new PRC and referencing this new PRC with the dsAlgDropSpecific of the anchoring dsAlgDropEntry. A more simple usage can also be achieved when a single set of drop parameters are used for all queues being measured. This, again, can be referenced by the anchoring of dsAlgDropSpecific. These are not defined in this PIB.",
      "ja": "他のより複雑な結果の組み合わせは、新しいPRCを指定し、アンカーdsAlgDropEntryのdsAlgDropSpecificで、この新しいPRCを参照することによって達成することができます。液滴パラメータの単一のセットが測定されているすべてのキューのために使用される場合、より簡単な使用も達成することができます。これは、再び、dsAlgDropSpecificのアンカーで参照することができます。これらは、このPIBで定義されていません。"
    },
    {
      "indent": 0,
      "text": "5.6. Queue and Scheduler Example",
      "section_title": true,
      "ja": "5.6。キューとスケジューラの例"
    },
    {
      "indent": 3,
      "text": "The queue and scheduler example will continue from the dropper example in the previous section, concentrating in the queue and scheduler DiffServ datapath functional elements. Notice a shaper is constructed using queue and scheduler with MaxRate parameters.",
      "ja": "キューおよびスケジューラの例では、キューとスケジューラのDiffServデータパス機能要素に集中し、前のセクションでドロッパー例から継続されます。シェイパーはMAXRATEパラメータでキューとスケジューラを使用して構成されている注意してください。"
    },
    {
      "indent": 3,
      "text": "     +------------+                           +-----------------+\n---->|Q           |                        +->|Scheduler        |\n     | Id=EF      |                        |  | Id=DiffServ     |\n     | Next ------+------------------------+  | Next=0.0        |\n     | MinRate ---+--+                     |  | Method=Priority |\n     | MaxRate -+ |  |   +----------+      |  | MinRate=0.0     |\n     +----------+-+  +-->|MinRate   |      |  | MaxRate=0.0     |\n                |        | Priority |      |  +-----------------+\n     +----------+        | Absolute |      |\n     |                   | Relative |      |\n     |  +-----------+    +----------+      |\n     +->|MaxRate    |                      |\n        | Level     |                      |\n        | Absolute  |                      |\n        | Relative  |                      |\n        | Threshold |                      |\n        +-----------+                      +-------------+\n                                                         |\n     +----------+                        +------------+  |\n---->|Q         |                    +-->|Scheduler   |  |\n     | Id=AF1   |                    |   | Id=AF      |  |\n     | Next ----+--------------------+   | Next ------+--+\n     | MinRate -+-+                  |   | Method=WRR |\n     | MaxRate  | |  +----------+    |   | MinRate -+ |\n     +----------+ +->|MinRate   |    |   | MaxRate  | |\n                     | Priority |    |   +----------+-+\n                     | Absolute |    |              |\n                     | Relative |    |   +----------+\n                     +----------+    |   |\n     +----------+                    |   |  +------------+\n---->|Q         |                    |   +->|MinRate     |\n     | Id=AF2   |                    |      | Priority   |\n     | Next ----+--------------------+      | Absolute   |\n     | MinRate -+-+                  |      | Relative   |\n     | MaxRate  | |  +----------+    |      +------------+\n     +----------+ +->|MinRate   |    |\n                     | Priority |    |\n                     | Absolute |    |\n                     | Relative |    |\n                     +----------+    |",
      "raw": true
    },
    {
      "indent": 3,
      "text": "     +----------+                    |\n---->|Q         |                    |\n     | Id=AF3   |                    |\n     | Next ----+--------------------+\n     | MinRate -+-+\n     | MaxRate  | |  +----------+\n     +----------+ +->|MinRate   |\n                     | Priority |\n                     | Absolute |\n                     | Relative |\n                     +----------+",
      "raw": true
    },
    {
      "indent": 16,
      "text": "Figure 9: Queue and Scheduler Usage Example",
      "ja": "図9：キューおよびスケジューラの使用例"
    },
    {
      "indent": 3,
      "text": "This example shows the queuing system for handling EF, AF1, AF2, and AF3 traffic. It is assumed that AF11, AF12, and AF13 traffic feeds into Queue AF1. And likewise for AF2x and AF3x traffic.",
      "ja": "この例では、EF、AF1、AF2、AF3とトラフィックを処理するためのキューイング・システムを示しています。 AF11、AF12、AF13とトラフィックがキューAF1に供給するものとします。そして、同様にAF2xとAF3xトラフィックのため。"
    },
    {
      "indent": 3,
      "text": "The AF1, AF2, and AF3 Queues are serviced by the AF Scheduler using a Weighed Round Robin method. The AF Scheduler will service each of the queues feeding into it based on the minimum rate parameters of each queue.",
      "ja": "AF1、AF2およびAF3キューを秤量ラウンドロビン方式を用いたAFスケジューラによってサービスされています。 AFスケジューラは、各キューの最小レートパラメータに基づいて、それへの供給の各キューにサービスを提供します。"
    },
    {
      "indent": 3,
      "text": "The AF and EF traffic are serviced by the DiffServ Scheduler using a Strict Priority method. The DiffServ Scheduler will service each of its inputs based on their priority parameter.",
      "ja": "AFとEFトラフィックが完全優先方式を使用してのDiffServスケジューラによってサービスされています。 DiffServのスケジューラは、優先順位のパラメータに基づいて、その入力の各サービスを提供します。"
    },
    {
      "indent": 3,
      "text": "Notice there is an upper bound to the servicing of EF traffic by the DiffServ Scheduler. This is accomplished with the use of maximum rate parameters. The DiffServ Scheduler uses both the maximum rate and priority parameters when servicing the EF Queue.",
      "ja": "DiffServのスケジューラによるEFトラフィックのサービスに上限があることに注意してください。これは、最大速度パラメータを使用することで達成されます。 DiffServのスケジューラは、最大速度とEFキューをサービス優先パラメータの両方を使用します。"
    },
    {
      "indent": 3,
      "text": "The DiffServ Scheduler is the last DiffServ datapath functional element in this datapath. It uses zeroDotZero in its Next attribute.",
      "ja": "DiffServのスケジューラは、このデータパスの最後のDiffServデータパス機能要素です。それは次の属性でのzeroDotZeroを使用しています。"
    },
    {
      "indent": 0,
      "text": "6. Summary of the DiffServ PIB",
      "section_title": true,
      "ja": "DiffServのPIBの6.まとめ"
    },
    {
      "indent": 3,
      "text": "The DiffServ PIB consists of one module containing the base PRCs for setting DiffServ policy, queues, classifiers, meters, etc., and also contains capability PRC's that allow a PEP to specify its device characteristics to the PDP. This module contains two groups that are summarized in this section.",
      "ja": "DiffServのPIBはDiffServポリシー、キュー、クラシファイア、メーターなどを設定するための基地位相応答曲線を含む一つのモジュールで構成され、また、PDPには、そのデバイスの特性を指定するためのPEPを可能PRCの能力を含んでいます。このモジュールは、このセクションにまとめられている二つのグループが含まれています。"
    },
    {
      "indent": 3,
      "text": "DiffServ Capabilities Group This group consists of PRCs to indicate to the PDP the types of interface supported on the PEP in terms of their DiffServ capabilities and PRCs that the PDP can install in order to configure these interfaces (queues, scheduling parameters, buffer sizes, etc.) to affect the desired policy. This group describes capabilities in terms of the types of interfaces and takes configuration in terms of interface types and role combinations [FR-PIB]; it does not deal with individual interfaces on the device.",
      "ja": "PDPは、これらのインタフェースを構成するためにインストールできることを自分のDiffServ機能とのPRCsの面でPDPにPEPでサポートインターフェイスの種類を示すために、このグループはのPRCsで構成されていたDiffServ機能のグループ（キュー、スケジューリングパラメータ、バッファサイズなど。）は、所望の政策に影響を与えます。このグループは、インターフェイスの種類の点で機能を記述し、インターフェイスタイプおよび役割の組み合わせ[FR-PIB]の点で構成をとります。それは、デバイス上の個々のインターフェイスを扱っていません。"
    },
    {
      "indent": 3,
      "text": "DiffServ Policy Group This group contains configurations of the functional elements that comprise the DiffServ policy that applies to an interface and the specific parameters that describe those elements. This group contains classifiers, meters, actions, droppers, queues and schedulers. This group also contains the PRC that associates the datapath elements with role combinations.",
      "ja": "DiffServの政策グループは、このグループはインターフェイスおよびそれらの要素を記述し、特定のパラメータに適用されるDiffServポリシーを構成する機能要素の構成が含まれています。このグループはクラシファイア、メーター、アクション、ドロッパー、キューとスケジューラが含まれています。このグループは、役割の組み合わせでデータパス要素を関連付けPRCが含まれています。"
    },
    {
      "indent": 0,
      "text": "7. PIB Operational Overview",
      "section_title": true,
      "ja": "7. STARTの動作の概要"
    },
    {
      "indent": 3,
      "text": "This section provides an operational overview of configuring DiffServ QoS policy.",
      "ja": "このセクションでは、DiffServのQoSポリシーの設定の動作概要を説明します。"
    },
    {
      "indent": 3,
      "text": "After the initial PEP to PDP communication setup, using [COPS-PR] for example, the PEP will provide to the PDP the PIB Provisioning classes (PRCs), interface types, and interface type capabilities it supports.",
      "ja": "PDP通信設定に初期PEP後、例えば[COPS-PR]を使用して、PEPは、PDPにそれがサポートPIBプロビジョニングクラス（位相応答曲線）、インターフェイスタイプ、インターフェイスタイプの機能を提供します。"
    },
    {
      "indent": 3,
      "text": "The PRCs supported by the PEP are reported to the PDP in the PRC Support Table, frwkPrcSupportTable, defined in the framework PIB [FR-PIB]. Each instance of the frwkPrcSupportTable indicates a PRC that the PEP understands and for which the PDP can send class instances as part of the policy information.",
      "ja": "PEPによってサポートされる位相応答曲線は、フレームワークPIB [FR-PIB]で定義されたPRCサポート表でPDP、frwkPrcSupportTable、に報告されています。 frwkPrcSupportTableの各インスタンスは、PEPが理解PRCを示し、そのためPDPはポリシー情報の一部として、クラスのインスタンスを送信することができます。"
    },
    {
      "indent": 3,
      "text": "The capabilities of interface types the PEP supports are described by rows in the capability set table, frwkCapabilitySetTable. Each row, or instance of this class contains a pointer to an instance of a PRC that describes the capabilities of the interface type. The capability objects may reside in the dsIfClassifierCapsTable, the dsIfMeteringCapsTable, the dsIfSchedulerCapsTable, the dsIfElmDepthCapsTable, the dsIfElmLinkCapsTable, or in a table defined in another PIB.",
      "ja": "インターフェイスタイプの機能は、PEPの支持体は、機能セット、テーブル、frwkCapabilitySetTable内の行によって記述されています。各行、またはこのクラスのインスタンスは、インタフェースタイプの機能について説明PRCのインスタンスへのポインタを含みます。能力オブジェクトはdsIfClassifierCapsTable、dsIfMeteringCapsTable、dsIfSchedulerCapsTable、dsIfElmDepthCapsTable、dsIfElmLinkCapsTableで、または他のPIBで定義されたテーブル内に存在してもよいです。"
    },
    {
      "indent": 3,
      "text": "The PDP, with knowledge of the PEP's capabilities, then provides the PEP with administrative domain and interface-type-specific policy information.",
      "ja": "PDPは、PEPの能力の知識を持って、その後、管理ドメインおよびインタフェース・タイプ固有のポリシー情報とPEPを提供します。"
    },
    {
      "indent": 3,
      "text": "Instances of the dsDataPathTable are used to specify the first element in the set of functional elements applied to an interface type. Each instance of the dsDataPathTable applies to an interface type defined by its roles and direction (ingress or egress).",
      "ja": "dsDataPathTableのインスタンスは、インタフェースタイプに適用される機能要素の集合内の最初の要素を指定するために使用されます。 dsDataPathTableの各インスタンスは、その役割によって定義されたインターフェイスタイプおよび方向（入力または出力）に適用されます。"
    },
    {
      "indent": 0,
      "text": "8. PIB Definition",
      "section_title": true,
      "ja": "8.スケジュールの定義"
    },
    {
      "indent": 0,
      "text": "DIFFSERV-PIB PIB-DEFINITIONS ::= BEGIN",
      "raw": true
    },
    {
      "indent": 0,
      "text": "IMPORTS Unsigned32, MODULE-IDENTITY, MODULE-COMPLIANCE, OBJECT-TYPE, OBJECT-GROUP, pib FROM COPS-PR-SPPI InstanceId, Prid, TagId, TagReferenceId FROM COPS-PR-SPPI-TC zeroDotZero FROM SNMPv2-SMI AutonomousType FROM SNMPv2-TC SnmpAdminString FROM SNMP-FRAMEWORK-MIB RoleCombination, PrcIdentifierOid, PrcIdentifierOidOrZero, AttrIdentifier FROM FRAMEWORK-TC-PIB Dscp FROM DIFFSERV-DSCP-TC IfDirection FROM DIFFSERV-MIB BurstSize FROM INTEGRATED-SERVICES-MIB;",
      "ja": "輸入Unsigned32の、MODULE-IDENTITY、MODULE-COMPLIANCE、OBJECT-TYPE、オブジェクト・グループ、SNMPv2- FROM SNMPv2の-SMI AutonomousTypeのFROM COPS-PR-SPPI-TCのzeroDotZero FROM COPS-PR-SPPIのInstanceId、PRID、TAGID、TagReferenceId FROM PIB DIFFSERV-DSCP-TC IfDirection FROM INTEGRATED-SERVICES-MIBからDIFFSERV-MIB BurstSize由来のフレームワーク-TC-PIBもDscp FROM SNMP-FRAMEWORK-MIB RoleCombination、PrcIdentifierOid、PrcIdentifierOidOrZero、AttrIdentifier FROM TCれるSnmpAdminString。"
    },
    {
      "indent": 0,
      "text": "dsPolicyPib MODULE-IDENTITY SUBJECT-CATEGORIES { diffServ (2) } -- DiffServ QoS COPS Client Type LAST-UPDATED \"200302180000Z\" -- 18 Feb 2003 ORGANIZATION \"IETF DIFFSERV WG\" CONTACT-INFO \" Keith McCloghrie Cisco Systems, Inc. 170 West Tasman Drive, San Jose, CA 95134-1706 USA Phone: +1 408 526 5260 Email: kzm@cisco.com",
      "ja": "dsPolicyPibのMODULE-IDENTITYの主題カテゴリー{のDiffServ（2）}  -  DiffServのQoSのCOPSクライアントタイプLAST-UPDATED \"200302180000Z\"  -  2003年2月18日ORGANIZATION \"IETF DIFFSERV WG\" CONTACT-INFO「キースMcCloghrieシスコシステムズ、株式会社170西タスマン・ドライブ、サンノゼ、CA 95134-1706 USA電話：+1 408 526 5260 Eメール：kzm@cisco.com"
    },
    {
      "indent": 18,
      "text": "John Seligson\nNortel Networks, Inc.\n4401 Great America Parkway\nSanta Clara, CA 95054 USA\nPhone: +1 408 495 2992\nEmail: jseligso@nortelnetworks.com",
      "raw": true
    },
    {
      "indent": 18,
      "text": "Kwok Ho Chan Nortel Networks, Inc.",
      "ja": "クォックホーチャンノーテルネットワークス株式会社"
    },
    {
      "indent": 18,
      "text": "600 Technology Park Drive Billerica, MA 01821 USA Phone: +1 978 288 8175 Email: khchan@nortelnetworks.com",
      "ja": "600テクノロジーパークドライブビレリカ、MA 01821 USA電話：+1 978 288 8175 Eメール：khchan@nortelnetworks.com"
    },
    {
      "indent": 4,
      "text": " Differentiated Services Working Group: diffserv@ietf.org\" DESCRIPTION \"The PIB module containing a set of provisioning classes that describe quality of service (QoS) policies for DiffServ. It includes general classes that may be extended by other PIB specifications as well as a set of PIB classes related to IP processing.",
      "ja": "差別化サービスワーキンググループ：diffserv@ietf.org「DESCRIPTION」DiffServのためのサービス品質（QoS）を記述するクラスポリシーのプロビジョニングのセットを含むPIBモジュール。これは、他のPIB仕様ならびにIP処理に関するPIBクラスのセットによって拡張することができる一般的なクラスを含みます。"
    },
    {
      "indent": 9,
      "text": "Copyright (C) The Internet Society (2003). This version of\nthis PIB module is part of RFC 3317; see the RFC itself for\nfull legal notices.\"",
      "raw": true
    },
    {
      "indent": 4,
      "text": "REVISION \"200302180000Z\"        -- 18 Feb 2003\nDESCRIPTION\n     \"Initial version, published as RFC 3317.\"\n::= { pib 4 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsCapabilityClasses    OBJECT IDENTIFIER ::= { dsPolicyPib 1 }\ndsPolicyClasses        OBJECT IDENTIFIER ::= { dsPolicyPib 2 }\ndsPolicyPibConformance OBJECT IDENTIFIER ::= { dsPolicyPib 3 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "-- -- Interface Type Capabilities Group --",
      "ja": " -   - インタフェースタイプ機能グループ - "
    },
    {
      "indent": 0,
      "text": "-- -- Interface Type Capability Tables -- -- The Interface type capability tables define capabilities that may -- be associated with interfaces of a specific type. -- This PIB defines capability tables for DiffServ Functionalities. --",
      "ja": " -   - インタフェースタイプ機能テーブル -   - 特定のタイプのインターフェイスに関連付けられる - インタフェースタイプ能力テーブルできる機能を定義します。 - このPIBはDiffServの机能のための能力テーブルを定義します。 - "
    },
    {
      "indent": 0,
      "text": "-- -- The Base Capability Table --",
      "ja": " -   - 基本能力テーブル - "
    },
    {
      "indent": 0,
      "text": "dsBaseIfCapsTable OBJECT-TYPE SYNTAX SEQUENCE OF DsBaseIfCapsEntry PIB-ACCESS notify STATUS current DESCRIPTION",
      "ja": "DsBaseIfCapsEntry PIB-ACCESS OF dsBaseIfCapsTable OBJECT-TYPE構文配列ステータス現在の説明に通知します"
    },
    {
      "indent": 4,
      "text": "  \"The Base Interface Type Capability class.  This class\n   represents a generic capability supported by a device in the\n   ingress, egress, or both directions.\"\n::= { dsCapabilityClasses 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsBaseIfCapsEntry OBJECT-TYPE SYNTAX DsBaseIfCapsEntry STATUS current DESCRIPTION \"An instance of this class describes the dsBaseIfCaps class.\"",
      "ja": "dsBaseIfCapsEntryのOBJECT-TYPE SYNTAX DsBaseIfCapsEntryのステータス現在の説明は「このクラスのインスタンスは、dsBaseIfCapsクラスについて説明します。」"
    },
    {
      "indent": 0,
      "text": "    PIB-INDEX { dsBaseIfCapsPrid }\n::= { dsBaseIfCapsTable 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "DsBaseIfCapsEntry ::= SEQUENCE {\n        dsBaseIfCapsPrid           InstanceId,\n        dsBaseIfCapsDirection      INTEGER\n}",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsBaseIfCapsPrid OBJECT-TYPE\n    SYNTAX         InstanceId\n    STATUS         current\n    DESCRIPTION\n        \"An arbitrary integer index that uniquely identifies an\n        instance of the class.\"\n    ::= { dsBaseIfCapsEntry 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsBaseIfCapsDirection OBJECT-TYPE\n    SYNTAX         INTEGER {\n                        inbound(1),\n                        outbound(2),\n                        inAndOut(3)\n                   }\n    STATUS         current\n    DESCRIPTION\n      \"This object specifies the direction(s) for which the\n      capability applies. A value of 'inbound(1)' means the\n      capability applies only to the ingress direction.  A value of\n      'outbound(2)' means the capability applies only to the egress\n      direction.  A value of 'inAndOut(3)' means the capability\n      applies to both directions.\"\n    ::= { dsBaseIfCapsEntry 2 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "--\n-- The Classification Capability Table\n-- dsIfClassificationCapsTable OBJECT-TYPE\n    SYNTAX         SEQUENCE OF DsIfClassificationCapsEntry\n    PIB-ACCESS     notify\n    STATUS         current\n    DESCRIPTION\n        \"This class specifies the classification capabilities of\n        a Capability Set.\"\n    ::= { dsCapabilityClasses 2 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsIfClassificationCapsEntry OBJECT-TYPE SYNTAX DsIfClassificationCapsEntry STATUS current DESCRIPTION \"An instance of this class describes the classification capabilities of a Capability Set.\"",
      "ja": "dsIfClassificationCapsEntryのOBJECT-TYPE SYNTAX DsIfClassificationCapsEntryのステータス現在の説明は「このクラスのインスタンスは、能力セットの分類機能を説明しています。」"
    },
    {
      "indent": 4,
      "text": "EXTENDS { dsBaseIfCapsEntry }\nUNIQUENESS { dsBaseIfCapsDirection,\n             dsIfClassificationCapsSpec }\n::= { dsIfClassificationCapsTable 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "DsIfClassificationCapsEntry ::= SEQUENCE {\n        dsIfClassificationCapsSpec BITS\n}",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsIfClassificationCapsSpec OBJECT-TYPE SYNTAX BITS { ipSrcAddrClassification(0), -- indicates the ability to classify based on -- IP source addresses ipDstAddrClassification(1), -- indicates the ability to classify based on -- IP destination addresses ipProtoClassification(2), -- indicates the ability to classify based on -- IP protocol numbers ipDscpClassification(3), -- indicates the ability to classify based on -- IP DSCP ipL4Classification(4), -- indicates the ability to classify based on -- IP layer 4 port numbers for UDP and TCP ipV6FlowID(5) -- indicates the ability to classify based on -- IPv6 FlowIDs. }",
      "ja": "dsIfClassificationCapsSpec OBJECT-TYPE構文BITS {ipSrcAddrClassification（0）、 - に基づいて分類する能力を示す -  IPソースはipDstAddrClassificationに対処（1）、 - に基づいて分類する能力を示す -  IP宛先はipProtoClassification（2）アドレス、 -  IPプロトコル番号ipDscpClassification（3）、 -   - に基づいて分類する能力を示す -  IP DSCP ipL4Classification（4）、 - に基づいて分類する能力を示す -  IPレイヤに基づいて分類する能力を示しますUDPおよびTCP ipV6FlowID 4つのポート番号（5） -  IPv6のFlowIDs  - に基づいて分類する能力を示します。 }"
    },
    {
      "indent": 4,
      "text": "STATUS         current\nDESCRIPTION\n  \"Bit set of supported classification capabilities.  In\n  addition to these capabilities, other PIBs may define other\n  capabilities that can then be specified in addition to the\n  ones specified here (or instead of the ones specified here if\n  none of these are specified).\"\n::= { dsIfClassificationCapsEntry 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "-- -- Metering Capabilities --",
      "ja": " -   - 測光機能 - "
    },
    {
      "indent": 0,
      "text": "dsIfMeteringCapsTable OBJECT-TYPE\n    SYNTAX         SEQUENCE OF DsIfMeteringCapsEntry\n    PIB-ACCESS     notify\n    STATUS         current\n    DESCRIPTION\n        \"This class specifies the metering capabilities of a\n        Capability Set.\"\n    ::= { dsCapabilityClasses 3 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsIfMeteringCapsEntry OBJECT-TYPE SYNTAX DsIfMeteringCapsEntry STATUS current DESCRIPTION \"An instance of this class describes the metering capabilities of a Capability Set.\"",
      "ja": "dsIfMeteringCapsEntryのOBJECT-TYPE SYNTAX DsIfMeteringCapsEntryのステータス現在の説明は「このクラスのインスタンスは、能力セットの計量機能について説明します。」"
    },
    {
      "indent": 4,
      "text": "EXTENDS { dsBaseIfCapsEntry }\nUNIQUENESS { dsBaseIfCapsDirection,\n             dsIfMeteringCapsSpec }\n::= { dsIfMeteringCapsTable 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "DsIfMeteringCapsEntry ::= SEQUENCE {\n        dsIfMeteringCapsSpec       BITS\n}",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsIfMeteringCapsSpec OBJECT-TYPE SYNTAX BITS { zeroNotUsed(0), simpleTokenBucket(1), avgRate(2), srTCMBlind(3), srTCMAware(4), trTCMBlind(5), trTCMAware(6), tswTCM(7)",
      "ja": "dsIfMeteringCapsSpec OBJECT-TYPE構文BITS {zeroNotUsed（0）、simpleTokenBucket（1）、avgRate（2）、srTCMBlind（3）、srTCMAware（4）、trTCMBlind（5）、trTCMAware（6）、tswTCM（7）"
    },
    {
      "indent": 4,
      "text": "             }\nSTATUS       current\nDESCRIPTION\n  \"Bit set of supported metering capabilities.  As with\n  classification capabilities, these metering capabilities may\n  be augmented by capabilities specified in other PRCs (in other\n  PIBs).\"\n::= { dsIfMeteringCapsEntry 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "-- -- Algorithmic Dropper Capabilities --",
      "ja": " -   - アルゴリズムスポイト機能 - "
    },
    {
      "indent": 0,
      "text": "dsIfAlgDropCapsTable OBJECT-TYPE SYNTAX SEQUENCE OF DsIfAlgDropCapsEntry PIB-ACCESS notify STATUS current DESCRIPTION \"This class specifies the algorithmic dropper capabilities of a Capability Set.",
      "ja": "DsIfAlgDropCapsEntry PIB-ACCESS OF dsIfAlgDropCapsTable OBJECT-TYPE構文配列ステータス現在の説明は「このクラスは能力セットのアルゴリズムスポイト機能を指定する通知します。"
    },
    {
      "indent": 4,
      "text": "    This capability table indicates the types of algorithmic\n    drop supported by a Capability Set for a specific flow\n    direction.\n    Additional capabilities affecting the drop functionalities\n    are determined based on queue capabilities associated with\n    specific instance of a dropper, hence not specified by\n    this class.\"\n::= { dsCapabilityClasses 4 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsIfAlgDropCapsEntry OBJECT-TYPE\n    SYNTAX         DsIfAlgDropCapsEntry\n    STATUS         current\n    DESCRIPTION\n        \"An instance of this class describes the algorithmic dropper\n        capabilities of a Capability Set.\"\n    EXTENDS { dsBaseIfCapsEntry }\n    UNIQUENESS { dsBaseIfCapsDirection,\n                 dsIfAlgDropCapsType,\n                 dsIfAlgDropCapsMQCount }\n    ::= { dsIfAlgDropCapsTable 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "DsIfAlgDropCapsEntry ::= SEQUENCE {\n        dsIfAlgDropCapsType                BITS,\n        dsIfAlgDropCapsMQCount             Unsigned32\n}",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsIfAlgDropCapsType OBJECT-TYPE",
      "ja": "dsIfAlgDropCapsTypeのOBJECT-TYPE"
    },
    {
      "indent": 4,
      "text": "SYNTAX      BITS {\n                 zeroNotUsed(0),\n                 oneNotUsed(1),\n                 tailDrop(2),\n                 headDrop(3),\n                 randomDrop(4),\n                 alwaysDrop(5),\n                 mQDrop(6) }\nSTATUS      current\nDESCRIPTION\n  \"The type of algorithm that droppers associated with queues\n  may use.",
      "raw": true
    },
    {
      "indent": 4,
      "text": "  The tailDrop(2) algorithm means that packets are dropped from\n  the tail of the queue when the associated queue's MaxQueueSize\n  is exceeded.  The headDrop(3) algorithm means that packets are\n  dropped from the head of the queue when the associated queue's\n  MaxQueueSize is exceeded. The randomDrop(4) algorithm means\n  that an algorithm is executed which may randomly\n  drop the packet, or  drop  other  packet(s) from  the  queue\n  in  its place.  The specifics of the algorithm may be\n  proprietary.  However, parameters would be specified in the\n  dsRandomDropTable.  The alwaysDrop(5) will drop every packet\n  presented to it.  The mQDrop(6) algorithm will drop packets\n  based on measurement from multiple queues.\"\n::= { dsIfAlgDropCapsEntry 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsIfAlgDropCapsMQCount OBJECT-TYPE\n    SYNTAX      Unsigned32  (1..4294967295)\n    STATUS      current\n    DESCRIPTION\n      \"Indicates the number of queues measured for the drop\n      algorithm.\n      This attribute is ignored when alwaysDrop(5) algorithm is\n      used.  This attribute contains the value of 1 for all drop\n      algorithm types except for mQDrop(6), where this attribute\n      is used to indicate the maximum number of dsMQAlgDropEntry\n      that can be chained together.\"\n    ::= { dsIfAlgDropCapsEntry 2 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "-- -- Queue Capabilities --",
      "ja": " -   - キュー機能 - "
    },
    {
      "indent": 0,
      "text": "dsIfQueueCapsTable OBJECT-TYPE SYNTAX SEQUENCE OF DsIfQueueCapsEntry PIB-ACCESS notify STATUS current",
      "ja": "DsIfQueueCapsEntry PIB-ACCESS OF dsIfQueueCapsTable OBJECT-TYPE構文配列ステータス現在の通知します"
    },
    {
      "indent": 4,
      "text": "DESCRIPTION\n    \"This class specifies the queueing capabilities of a\n    Capability Set.\"\n::= { dsCapabilityClasses 5 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsIfQueueCapsEntry OBJECT-TYPE\n    SYNTAX         DsIfQueueCapsEntry\n    STATUS         current\n    DESCRIPTION\n        \"An instance of this class describes the queue\n        capabilities of a Capability Set.\"\n    EXTENDS { dsBaseIfCapsEntry }\n    UNIQUENESS { dsBaseIfCapsDirection,\n                 dsIfQueueCapsMinQueueSize,\n                 dsIfQueueCapsMaxQueueSize,\n                 dsIfQueueCapsTotalQueueSize }\n    ::= { dsIfQueueCapsTable 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "DsIfQueueCapsEntry ::= SEQUENCE {\n        dsIfQueueCapsMinQueueSize          Unsigned32,\n        dsIfQueueCapsMaxQueueSize          Unsigned32,\n        dsIfQueueCapsTotalQueueSize        Unsigned32\n}",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsIfQueueCapsMinQueueSize OBJECT-TYPE\n    SYNTAX      Unsigned32  (0..4294967295)\n    UNITS       \"Bytes\"\n    STATUS      current\n    DESCRIPTION\n        \"Some interfaces may allow the size of a queue to be\n        configured.  This attribute specifies the minimum size that\n        can be configured for a queue, specified in bytes.\n        dsIfQueueCapsMinQueueSize must be less than or equals to\n        dsIfQueueCapsMaxQueueSize when both are specified.\n        A zero value indicates not specified.\"\n    ::= { dsIfQueueCapsEntry 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsIfQueueCapsMaxQueueSize OBJECT-TYPE SYNTAX Unsigned32 (0..4294967295) UNITS \"Bytes\" STATUS current DESCRIPTION \"Some interfaces may allow the size of a queue to be configured. This attribute specifies the maximum size that can be configured for a queue, specified in bytes. dsIfQueueCapsMinQueueSize must be less than or equals to dsIfQueueCapsMaxQueueSize when both are specified. A zero value indicates not specified.\"",
      "ja": "dsIfQueueCapsMaxQueueSizeのOBJECT-TYPE構文Unsigned32（0 4294967295）UNITS「バイト」ステータス現在の説明「いくつかのインターフェイスは、キューのサイズを設定することを可能にすることができる。この属性は、バイト単位で指定されたキューのために構成することができる最大サイズを指定します両方が指定されている場合。dsIfQueueCapsMinQueueSizeはdsIfQueueCapsMaxQueueSizeより小さいか等しくなければならない。ゼロの値が指定されていない示しています。」"
    },
    {
      "indent": 4,
      "text": "::= { dsIfQueueCapsEntry 2 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsIfQueueCapsTotalQueueSize OBJECT-TYPE\n    SYNTAX      Unsigned32  (0..4294967295)\n    UNITS       \"Bytes\"\n    STATUS      current\n    DESCRIPTION\n        \"Some interfaces may have a limited buffer space to be\n        shared amongst all queues of that interface while also\n        allowing the size of each queue to be configurable.  To\n        prevent the situation where the PDP configures the sizes of\n        the queues in excess of the total buffer available to the\n        interface, the PEP can report the total buffer space in\n        bytes available with this capability.\n        A zero value indicates not specified.\"\n    ::= { dsIfQueueCapsEntry 3 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "-- -- Scheduler Capabilities --",
      "ja": " -   - スケジューラの機能 - "
    },
    {
      "indent": 0,
      "text": "dsIfSchedulerCapsTable OBJECT-TYPE\n    SYNTAX         SEQUENCE OF DsIfSchedulerCapsEntry\n    PIB-ACCESS     notify\n    STATUS         current\n    DESCRIPTION\n      \"This class specifies the scheduler capabilities of a\n      Capability Set.\"\n    ::= { dsCapabilityClasses 6 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsIfSchedulerCapsEntry OBJECT-TYPE\n    SYNTAX         DsIfSchedulerCapsEntry\n    STATUS         current\n    DESCRIPTION\n      \"An instance of this class describes the scheduler\n      capabilities of a Capability Set.\"\n    EXTENDS { dsBaseIfCapsEntry }\n    UNIQUENESS { dsBaseIfCapsDirection,\n                 dsIfSchedulerCapsServiceDisc,\n                 dsIfSchedulerCapsMaxInputs }\n    ::= { dsIfSchedulerCapsTable 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "DsIfSchedulerCapsEntry ::= SEQUENCE {\n        dsIfSchedulerCapsServiceDisc      AutonomousType,\n        dsIfSchedulerCapsMaxInputs        Unsigned32,\n        dsIfSchedulerCapsMinMaxRate       INTEGER\n} dsIfSchedulerCapsServiceDisc OBJECT-TYPE\n    SYNTAX      AutonomousType\n    STATUS      current\n    DESCRIPTION\n      \"The scheduling discipline for which the set of capabilities\n      specified in this object apply. Object identifiers for several\n      general purpose and well-known scheduling disciplines are\n      shared with and defined in the DiffServ MIB.",
      "raw": true
    },
    {
      "indent": 4,
      "text": "  These include diffServSchedulerPriority,\n  diffServSchedulerWRR, diffServSchedulerWFQ.\"\n::= { dsIfSchedulerCapsEntry 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsIfSchedulerCapsMaxInputs OBJECT-TYPE\n    SYNTAX      Unsigned32  (0..4294967295)\n    STATUS      current\n    DESCRIPTION\n      \"The maximum number of queues and/or schedulers that can\n      feed into a scheduler indicated by this capability entry.\n      A value of zero means there is no maximum.\"\n    ::= { dsIfSchedulerCapsEntry 2 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsIfSchedulerCapsMinMaxRate OBJECT-TYPE\n    SYNTAX      INTEGER {\n                      minRate(1),\n                      maxRate(2),\n                      minAndMaxRates(3)\n                }\n    STATUS      current\n    DESCRIPTION\n      \"Scheduler capability indicating ability to handle inputs\n      with minimum rate, maximum rate, or both.\"\n    ::= { dsIfSchedulerCapsEntry 3 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "-- -- Maximum Rate Capabilities --",
      "ja": " -   - 最大レート機能 - "
    },
    {
      "indent": 0,
      "text": "dsIfMaxRateCapsTable OBJECT-TYPE\n    SYNTAX         SEQUENCE OF DsIfMaxRateCapsEntry\n    PIB-ACCESS     notify\n    STATUS         current\n    DESCRIPTION\n        \"This class specifies the maximum rate capabilities of a\n        Capability Set.\"\n    ::= { dsCapabilityClasses 7 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsIfMaxRateCapsEntry OBJECT-TYPE",
      "ja": "dsIfMaxRateCapsEntryのOBJECT-TYPE"
    },
    {
      "indent": 4,
      "text": "SYNTAX         DsIfMaxRateCapsEntry\nSTATUS         current\nDESCRIPTION\n    \"An instance of this class describes the maximum rate\n    capabilities of a Capability Set.\"\nEXTENDS { dsBaseIfCapsEntry }\nUNIQUENESS { dsBaseIfCapsDirection,\n             dsIfMaxRateCapsMaxLevels }\n::= { dsIfMaxRateCapsTable 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "DsIfMaxRateCapsEntry ::= SEQUENCE {\n        dsIfMaxRateCapsMaxLevels           Unsigned32\n}",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsIfMaxRateCapsMaxLevels OBJECT-TYPE\n    SYNTAX      Unsigned32  (1..4294967295)\n    STATUS      current\n    DESCRIPTION\n        \"The maximum number of levels a maximum rate specification\n        may have for this Capability Set and flow direction.\"\n    ::= { dsIfMaxRateCapsEntry 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "-- -- DataPath Element Linkage Capabilities --",
      "ja": " -   - データパス要素の連携機能 - "
    },
    {
      "indent": 0,
      "text": "-- -- DataPath Element Cascade Depth --",
      "ja": " -   - データパス要素カスケードの深さ - "
    },
    {
      "indent": 0,
      "text": "dsIfElmDepthCapsTable OBJECT-TYPE\n    SYNTAX         SEQUENCE OF DsIfElmDepthCapsEntry\n    PIB-ACCESS     notify\n    STATUS         current\n    DESCRIPTION\n        \"This class specifies the number of elements of the same\n        type that can be cascaded together in a datapath.\"\n    ::= { dsCapabilityClasses 8 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsIfElmDepthCapsEntry OBJECT-TYPE SYNTAX DsIfElmDepthCapsEntry STATUS current DESCRIPTION \"An instance of this class describes the cascade depth for a particular functional datapath element PRC. A functional datapath element not represented in this class can be assumed to have no specific maximum depth.\"",
      "ja": "dsIfElmDepthCapsEntryのOBJECT-TYPE SYNTAX DsIfElmDepthCapsEntry STATUSの現在の記述、「このクラスのインスタンスは、特定の機能データパス要素PRC用カスケードの深さを記載している。このクラスには示されていない機能データパス要素には固有の最大の深さを有していないと仮定することができます」。"
    },
    {
      "indent": 4,
      "text": "EXTENDS { dsBaseIfCapsEntry }\nUNIQUENESS { dsBaseIfCapsDirection,\n             dsIfElmDepthCapsPrc }\n::= { dsIfElmDepthCapsTable 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "DsIfElmDepthCapsEntry ::= SEQUENCE {\n        dsIfElmDepthCapsPrc                PrcIdentifierOid,\n        dsIfElmDepthCapsCascadeMax         Unsigned32\n}",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsIfElmDepthCapsPrc OBJECT-TYPE\n    SYNTAX         PrcIdentifierOid\n    STATUS         current\n    DESCRIPTION\n      \"The object identifier of a PRC that represents a functional\n      datapath element.  This may be one of:  dsClfrElementEntry,\n      dsMeterEntry, dsActionEntry, dsAlgDropEntry, dsQEntry, or\n      dsSchedulerEntry.\n      There may not be more than one instance of this class with\n      the same value of dsIfElmDepthCapsPrc and same value of\n      dsBaseIfCapsDirection.  Must not contain the value of\n      zeroDotZero.\"\n    ::= { dsIfElmDepthCapsEntry 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsIfElmDepthCapsCascadeMax OBJECT-TYPE\n    SYNTAX         Unsigned32  (0..4294967295)\n    STATUS         current\n    DESCRIPTION\n      \"The maximum number of elements of type dsIfElmDepthCapsPrc\n      that can be linked consecutively in a data path.  A value of\n      zero indicates there is no specific maximum.\"\n    ::= { dsIfElmDepthCapsEntry 2 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "-- -- DataPath Element Linkage Types --",
      "ja": " -   - データパス要素リンケージの種類 - "
    },
    {
      "indent": 0,
      "text": "dsIfElmLinkCapsTable OBJECT-TYPE\n    SYNTAX         SEQUENCE OF DsIfElmLinkCapsEntry\n    PIB-ACCESS     notify\n    STATUS         current\n    DESCRIPTION\n        \"This class specifies what types of datapath functional\n        elements may be used as the next downstream element for\n        a specific type of functional element.\"\n    ::= { dsCapabilityClasses 9 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsIfElmLinkCapsEntry OBJECT-TYPE",
      "ja": "dsIfElmLinkCapsEntryのOBJECT-TYPE"
    },
    {
      "indent": 4,
      "text": "SYNTAX         DsIfElmLinkCapsEntry\nSTATUS         current\nDESCRIPTION\n    \"An instance of this class specifies a PRC that may\n     be used as the next functional element after a specific\n     type of element in a data path.\"\nEXTENDS { dsBaseIfCapsEntry }\nUNIQUENESS { dsBaseIfCapsDirection,\n             dsIfElmLinkCapsPrc,\n             dsIfElmLinkCapsAttr,\n             dsIfElmLinkCapsNextPrc }\n::= { dsIfElmLinkCapsTable 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "DsIfElmLinkCapsEntry ::= SEQUENCE {\n        dsIfElmLinkCapsPrc               PrcIdentifierOid,\n        dsIfElmLinkCapsAttr              AttrIdentifier,\n        dsIfElmLinkCapsNextPrc           PrcIdentifierOidOrZero\n}",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsIfElmLinkCapsPrc OBJECT-TYPE\n    SYNTAX         PrcIdentifierOid\n    STATUS         current\n    DESCRIPTION\n      \" The object identifier of a PRC that represents a functional\n      datapath element.  This may be one of:  dsClfrElementEntry,\n      dsMeterEntry, dsActionEntry, dsAlgDropEntry, dsQEntry, or\n      dsSchedulerEntry.\n      This must not have the value zeroDotZero.\"\n    ::= { dsIfElmLinkCapsEntry 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsIfElmLinkCapsAttr OBJECT-TYPE\n    SYNTAX         AttrIdentifier\n    STATUS         current\n    DESCRIPTION\n      \"The value represents the attribute in the PRC\n      indicated by dsIfElmLinkCapsPrc that is used to\n      specify the next functional element in the datapath.\"\n    ::= { dsIfElmLinkCapsEntry 2 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsIfElmLinkCapsNextPrc OBJECT-TYPE SYNTAX PrcIdentifierOidOrZero STATUS current DESCRIPTION \"The value is the OID of a PRC table entry from which instances can be referenced by the attribute indicated by dsIfElmLinkCapsPrc and dsIfElmLinkAttr.",
      "ja": "dsIfElmLinkCapsNextPrc OBJECT-TYPE SYNTAX PrcIdentifierOidOrZeroのステータス現在の説明は「値がインスタンスがdsIfElmLinkCapsPrcとdsIfElmLinkAttrで示される属性によって参照可能なPRCテーブルエントリのOIDです。"
    },
    {
      "indent": 6,
      "text": "For example, suppose a meter's success output can be an action or another meter, and the fail output can only be\nan action.  This can be expressed as follows:",
      "raw": true
    },
    {
      "indent": 6,
      "text": "Prid Prc Attr NextPrc 1 dsMeterEntry dsMeterSucceedNext dsActionEntry 2 dsMeterEntry dsMeterSucceedNext dsMeterEntry 3 dsMeterEntry dsMeterFailNext dsActionEntry.",
      "ja": "PRID PrcをAttrのNextPrc 1 dsMeterEntry dsMeterSucceedNext dsActionEntry 2 dsMeterEntry dsMeterSucceedNext dsMeterEntry 3 dsMeterEntry dsMeterFailNext dsActionEntry。"
    },
    {
      "indent": 4,
      "text": "  zeroDotZero is a valid value for this attribute to\n  specify that the PRC specified in dsIfElmLinkCapsPrc\n  is the last functional data path element.\"\n::= { dsIfElmLinkCapsEntry 3 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "-- -- Policy Classes --",
      "ja": " -   - ポリシーのクラス - "
    },
    {
      "indent": 0,
      "text": "-- -- Data Path Table --",
      "ja": " -   - データパス表 - "
    },
    {
      "indent": 0,
      "text": "dsDataPathTable OBJECT-TYPE SYNTAX SEQUENCE OF DsDataPathEntry PIB-ACCESS install STATUS current DESCRIPTION \"The data path table indicates the start of functional data paths in this device.",
      "ja": "DsDataPathEntry PIB-ACCESS OF dsDataPathTable OBJECT-TYPE構文配列ステータス現在の説明のインストール「データパステーブルは、このデバイスにおける機能データ経路の開始を示します。"
    },
    {
      "indent": 4,
      "text": "   The Data Path Table enumerates the Differentiated\n   Services Functional Data Paths within this device.\n   Each entry specifies the first functional datapath\n   element to process data flow for each specific datapath.\n   Each datapath is defined by the interface set's capability\n   set name, role combination, and direction. This class can\n   therefore have up to two entries for each interface set,\n   ingress and egress.\"\n::= { dsPolicyClasses 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsDataPathEntry OBJECT-TYPE\n    SYNTAX       DsDataPathEntry\n    STATUS       current\n    DESCRIPTION\n       \"Each entry in this class indicates the start of a single\n       functional data path, defined by its capability set name,\n       role combination and traffic direction.  The first\n       functional datapath element to handle traffic for each\n       data path is defined by the dsDataPathStart attribute of each table entry.\n       Notice for each entry:\n       1. dsDataPathCapSetName must reference an existing capability\n          set name in frwkCapabilitySetTable [FR-PIB].\n       2. dsDataPathRoles must reference existing Role Combination\n          in frwkIfRoleComboTable [FR-PIB].\n       3. dsDataPathStart must reference an existing entry in a\n          functional data path element table.\n       If any one or more of these three requirements is not\n       satisfied, the dsDataPathEntry will not be installed.\"\n    PIB-INDEX { dsDataPathPrid }\n    UNIQUENESS { dsDataPathCapSetName,\n                 dsDataPathRoles,\n                 dsDataPathIfDirection }\n    ::= { dsDataPathTable 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "DsDataPathEntry ::= SEQUENCE  {\n    dsDataPathPrid           InstanceId,\n    dsDataPathCapSetName     SnmpAdminString,\n    dsDataPathRoles          RoleCombination,\n    dsDataPathIfDirection    IfDirection,\n    dsDataPathStart          Prid\n}",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsDataPathPrid OBJECT-TYPE\n    SYNTAX       InstanceId\n    STATUS       current\n    DESCRIPTION\n       \"An arbitrary integer index that uniquely identifies an\n        instance of the class.\"\n    ::= { dsDataPathEntry 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsDataPathCapSetName OBJECT-TYPE\n    SYNTAX       SnmpAdminString\n    STATUS       current\n    DESCRIPTION\n       \"The capability set associated with this data path entry.\n        The capability set name specified by this attribute\n        must exist in the frwkCapabilitySetTable [FR-PIB]\n        prior to association with an instance of this class.\"\n    ::= { dsDataPathEntry 2 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsDataPathRoles OBJECT-TYPE\n    SYNTAX       RoleCombination\n    STATUS       current\n    DESCRIPTION\n       \"The interfaces to which this data path entry applies,\n        specified in terms of roles.  There must exist an entry in the frwkIfRoleComboTable [FR-PIB] specifying\n        this role combination, together with the capability\n        set specified by dsDataPathCapSetName, prior to\n        association with an instance of this class.\"\n    ::= { dsDataPathEntry 3 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsDataPathIfDirection OBJECT-TYPE\n    SYNTAX       IfDirection\n    STATUS       current\n    DESCRIPTION\n       \"Specifies the direction for which this data path\n       entry applies.\"\n    ::= { dsDataPathEntry 4 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsDataPathStart OBJECT-TYPE SYNTAX Prid STATUS current DESCRIPTION \"This selects the first functional datapath element to handle traffic for this data path. This Prid should point to an instance of one of: dsClfrEntry dsMeterEntry dsActionEntry dsAlgDropEntry dsQEntry",
      "ja": "dsDataPathStart OBJECT-TYPE SYNTAX PRIDステータス現在の説明は「これは、このデータ・パスのトラフィックを処理するための第一の機能データパス要素を選択し、このPRIDのいずれかのインスタンスを指すべきである：。dsClfrEntry dsMeterEntry dsActionEntry dsAlgDropEntry dsQEntry"
    },
    {
      "indent": 4,
      "text": "   The PRI pointed to must exist prior to the installation of\n   this datapath start element.\"\n::= { dsDataPathEntry 5 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "-- -- Classifiers -- -- Classifier allows multiple classifier elements, of same or -- different types, to be used together. -- A classifier must completely classify all packets presented to -- it. This means all traffic handled by a classifier must match -- at least one classifier element within the classifier, -- with the classifier element parameters specified by a filter. -- It is the PDP's responsibility to create a _catch all_ classifier -- element and filter that matches all packet. This _catch all_ -- classifier element should have the lowest Precedence value. -- -- If there is ambiguity between classifier elements of different -- classifier, classifier linkage order indicates their precedence; -- the first classifier in the link is applied to the traffic first. --",
      "ja": " -   - 分類子 -   - 一緒に使用される異なるタイプ、 - クラシファイア同じ又は、複数の分類子要素を可能にします。 - それは - 分類器が完全に提示されたすべてのパケットを分類しなければなりません。分類器内の少なくとも一つの分類子要素を、 -   - フィルタによって指定された分類器の素子パラメータでこれは分類器によって処理されるすべてのトラフィックが一致しなければならないことを意味します。 - すべてのパケットに一致する要素及びフィルタ -  _catch ALL_分類器を作成するためのPDPの責任です。この_catch ALL_  - クラシファイア要素は、最低の優先順位値を持つ必要があります。別の分類子要素間のあいまいさがある場合 -   -   - 分類器は、分類器の連結順序は、それらの優先順位を示しています。 - リンクの最初の分類器は、最初のトラフィックに適用されます。 - "
    },
    {
      "indent": 0,
      "text": "-- Each entry in the classifier table represents a classifier, with -- classifier element table handling the fan-out functionality of a -- classifier, and filter table defining the classification -- patterns. --",
      "ja": " - クラシファイア要素テーブルのファンアウト機能処理 -   - 分類を定義する分類器、およびフィルタテーブルを - パターン分類子テーブルの各エントリは分類器とを表します。 - "
    },
    {
      "indent": 0,
      "text": "-- -- Classifier Table --",
      "ja": " -   - クラシファイアテーブル - "
    },
    {
      "indent": 0,
      "text": "dsClfrTable OBJECT-TYPE SYNTAX SEQUENCE OF DsClfrEntry PIB-ACCESS install STATUS current DESCRIPTION \"This table enumerates all the DiffServ classifier functional data path elements of this device. The actual classification definitions are detailed in dsClfrElementTable entries belonging to each classifier. Each classifier is referenced by its classifier elements using its classifier ID.",
      "ja": "DsClfrEntry PIB-ACCESSがSTATUS現在の説明は「この表には、このデバイスのすべてのDiffServクラシファイア機能データパス要素を列挙する。実際の分類の定義は、各分類子に属するdsClfrElementTableエントリに詳述されている。各分類器がによって参照されるインストールOF dsClfrTable OBJECT-TYPE構文配列その分類器のIDを使用して、その分類子要素。"
    },
    {
      "indent": 7,
      "text": "An entry in this table, referenced by an upstream functional\ndata path element or a datapath table entry, is the entry\npoint to the classifier functional data path element.",
      "raw": true
    },
    {
      "indent": 4,
      "text": "   The dsClfrId of each entry is used to organize all\n   classifier elements belonging to the same classifier.\"\nREFERENCE\n    \"An Informal Management Model for Diffserv Routers,\n    RFC 3290, section 4.1\"\n::= { dsPolicyClasses 2 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsClfrEntry OBJECT-TYPE\n    SYNTAX       DsClfrEntry\n    STATUS       current\n    DESCRIPTION\n       \"An entry in the classifier table describes a single\n       classifier. Each classifier element belonging to this\n       classifier must have its dsClfrElementClfrId attribute equal\n       to dsClfrId.\"\n    PIB-INDEX { dsClfrPrid }\n    UNIQUENESS { dsClfrId }\n    ::= { dsClfrTable 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "DsClfrEntry ::= SEQUENCE  {\n    dsClfrPrid            InstanceId,\n    dsClfrId              TagReferenceId\n} dsClfrPrid OBJECT-TYPE\n    SYNTAX       InstanceId\n    STATUS       current\n    DESCRIPTION\n       \"An arbitrary integer index that uniquely identifies an\n        instance of the class.\"\n    ::= { dsClfrEntry 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsClfrId OBJECT-TYPE\n    SYNTAX       TagReferenceId\n    PIB-TAG      { dsClfrElementClfrId }\n    STATUS       current\n    DESCRIPTION\n       \"Identifies a Classifier.  A  Classifier must be\n       complete, this means all traffic handled by a\n       Classifier must match at least  one  Classifier\n       Element within  the  Classifier.\"\n    ::= { dsClfrEntry 2 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "-- -- Classifier Element Table --",
      "ja": " -   - クラシファイアエレメント表 - "
    },
    {
      "indent": 0,
      "text": "dsClfrElementTable OBJECT-TYPE SYNTAX SEQUENCE OF DsClfrElementEntry PIB-ACCESS install STATUS current DESCRIPTION \"Entries in the classifier element table serves as the anchor for each classification pattern, defined in filter table entries. Each classifier element table entry also specifies the subsequent downstream diffserv functional datapath element when the classification pattern is satisfied. Hence the classifier element table enumerates the relationship between classification patterns and subsequent downstream diffserv functional data path elements, describing one branch of the fan-out characteristic of a classifier indicated in [Model].",
      "ja": "DsClfrElementEntry PIB-ACCESS OF dsClfrElementTable OBJECT-TYPE構文配列はフィルタテーブルのエントリに定義された各分類パターンのためのアンカーとして機能クラシファイア要素テーブルのステータス現在の説明」エントリをインストール各クラシファイア要素テーブル・エントリは、その後の下流のDiffServ機能データパスを指定し分類パターンが満たされる要素。したがってクラシファイア要素テーブルは、[モデル]に示される分級機のファンアウト特性の一方の分岐を記述、分類パターンとそれに続く下流のDiffServ機能データパス要素間の関係を列挙する。"
    },
    {
      "indent": 7,
      "text": "Classification parameters are defined by entries of filter\ntables pointed to by dsClfrElementSpecific.  There can be\nfilter tables of different types, and they can be inter-mixed\nand used within a classifier. An example of a filter table is\nthe frwkIpFilterTable [FR-PIB], for IP Multi-Field\nClassifiers (MFCs).",
      "raw": true
    },
    {
      "indent": 4,
      "text": "   If there is ambiguity between classifier elements of the same\n   classifier, then dsClfrElementPrecedence needs to be used.\"\n::= { dsPolicyClasses 3 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsClfrElementEntry OBJECT-TYPE\n    SYNTAX       DsClfrElementEntry\n    STATUS       current\n    DESCRIPTION\n       \"An entry in the classifier element table describes a\n       single element of the classifier.\"\n    PIB-INDEX { dsClfrElementPrid }\n    UNIQUENESS { dsClfrElementClfrId,\n                 dsClfrElementPrecedence,\n                 dsClfrElementSpecific }\n    ::= { dsClfrElementTable 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "DsClfrElementEntry ::= SEQUENCE  {\n    dsClfrElementPrid        InstanceId,\n    dsClfrElementClfrId      TagId,\n    dsClfrElementPrecedence  Unsigned32,\n    dsClfrElementNext        Prid,\n    dsClfrElementSpecific    Prid\n}",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsClfrElementPrid OBJECT-TYPE\n    SYNTAX       InstanceId\n    STATUS       current\n    DESCRIPTION\n       \"An arbitrary integer index that uniquely identifies an\n        instance of the class.\"\n    ::= { dsClfrElementEntry 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsClfrElementClfrId OBJECT-TYPE SYNTAX TagId STATUS current DESCRIPTION \"A classifier is composed of one or more classifier elements. Each classifier element belonging to the same classifier uses the same classifier ID.",
      "ja": "dsClfrElementClfrIdのOBJECT-TYPE SYNTAX TAGIDステータス現在の説明は「分類器は、一つ以上の分類子要素で構成されている。同じ分類子に属する各分類子要素は、同じ分類器IDを使用します。"
    },
    {
      "indent": 4,
      "text": "    Hence, A classifier Id identifies which classifier\n    this classifier element is a part of. This must be\n    the value of dsClfrId attribute for an existing\n    instance of dsClfrEntry.\"\n::= { dsClfrElementEntry 2 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsClfrElementPrecedence OBJECT-TYPE SYNTAX Unsigned32 (1..4294967295)",
      "ja": "dsClfrElementPrecedenceのOBJECT-TYPE構文Unsigned32（1 4294967295）"
    },
    {
      "indent": 4,
      "text": "STATUS       current\nDESCRIPTION\n   \"The relative order in which classifier elements are\n   applied: higher numbers represent classifier elements\n   with higher precedence.  Classifier elements with the\n   same precedence must be unambiguous i.e., they must\n   define non-overlapping patterns, and are considered to\n   be applied  simultaneously  to the traffic stream.\n   Classifier elements with different precedence may\n   overlap in their filters: the classifier element with\n   the highest precedence that matches is taken.",
      "raw": true
    },
    {
      "indent": 4,
      "text": "   On a given interface, there must be a complete\n   classifier in place at all times in the ingress\n   direction.  This means that there will always be one\n   or more filters that match every possible pattern\n   that could be presented in an incoming packet.\n   There is no such requirement in the egress direction.\"\n::= { dsClfrElementEntry 3 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsClfrElementNext OBJECT-TYPE SYNTAX Prid STATUS current DESCRIPTION \"This attribute provides one branch of the fan-out functionality of a classifier described in Diffserv Model section 4.1.",
      "ja": "dsClfrElementNext OBJECT-TYPE SYNTAX PRIDのステータス現在の説明は「このアトリビュートは、Diffservのモデル4.1節で説明した分類器のファンアウト機能の1つのブランチを提供します。"
    },
    {
      "indent": 7,
      "text": "This selects the next diffserv functional datapath\nelement  to  handle traffic for this data path.",
      "raw": true
    },
    {
      "indent": 4,
      "text": "   A value of zeroDotZero marks the end of DiffServ processing\n   for this data path.  Any other value must point to a\n   valid (pre-existing) instance of one of:\n     dsClfrEntry\n     dsMeterEntry\n     dsActionEntry\n     dsAlgDropEntry\n     dsQEntry.\"\nDEFVAL      { zeroDotZero }\n::= { dsClfrElementEntry 4 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsClfrElementSpecific OBJECT-TYPE SYNTAX Prid STATUS current DESCRIPTION \"A pointer to a valid entry in another table that describes the applicable classification filter, e.g., an entry in frwkIpFilterTable (Framework PIB).",
      "ja": "dsClfrElementSpecific OBJECT-TYPE SYNTAX PRIDのステータス現在の説明「適用分類フィルタを記載している別のテーブル内の有効なエントリ、例えばへのポインタ、frwkIpFilterTable（フレームワークPIB）のエントリ。"
    },
    {
      "indent": 7,
      "text": "The PRI pointed to must exist prior to the installation of\nthis classifier element.",
      "raw": true
    },
    {
      "indent": 4,
      "text": "   The value zeroDotZero is interpreted  to  match  any-\n   thing  not  matched  by another classifier element - only one\n   such entry  may exist for each classifier.\"\n::= { dsClfrElementEntry 5 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "-- -- Meters -- -- This PIB supports a variety of Meters. It includes a -- specific definition for Meters whose parameter set can -- be modeled using Token Bucket parameters. -- Other metering parameter sets can be defined by other PIBs. -- -- Multiple meter elements may be logically cascaded -- using their dsMeterSucceedNext and dsMeterFailNext pointers if -- required. -- One example of this might be for an AF PHB implementation -- that uses multiple level conformance meters. -- -- Cascading of individual meter elements in the PIB is intended -- to be functionally equivalent to multiple level conformance -- determination of a packet. The sequential nature of the -- representation is merely a notational convenience for this PIB. -- -- srTCM meters (RFC 2697) can be specified using two sets of -- dsMeterEntry and dsTBParamEntry. First set specifies the -- Committed Information Rate and Committed Burst Size -- token-bucket. Second set specifies the Excess Burst -- Size token-bucket. -- -- trTCM meters (RFC 2698) can be specified using two sets of -- dsMeterEntry and dsTBParamEntry. First set specifies the -- Committed Information Rate and Committed Burst Size -- token-bucket. Second set specifies the Peak Information -- Rate and Peak Burst Size token-bucket. -- -- tswTCM meters (RFC 2859) can be specified using two sets of -- dsMeterEntry and dsTBParamEntry. First set specifies the -- Committed Target Rate token-bucket. Second set specifies the -- Peak Target Rate token-bucket. dsTBParamInterval in each -- token bucket reflects the Average Interval.",
      "ja": " -   - メーター -   - このPIBは、メーターの様々なサポートしています。トークン・バケット・パラメータを使用してモデル化 - パラメータセットできメーターのための具体的な定義 - それは含まれています。 - その他の計量パラメータセットは、他のPIBによって定義することができます。 -   - 必要 - あればそのdsMeterSucceedNextとdsMeterFailNextポインタを使用して - 複数のメーターの要素は、論理的にカスケード接続することができます。 - 複数レベルの適合メーターを使用 - この一例は、AF PHBの実装のためかもしれません。 -   - 複数レベルの適合性と機能的に同等であること -   -  PIBの個々の計器要素のカスケードが意図されているパケットの決意。シーケンシャルな性質 - 表現は、このPIBのための簡便な表記法です。 -   -  dsMeterEntryとdsTBParamEntry  -  srTCMメーター（RFC 2697）は、二組を使用して指定することができます。認定情報レートおよび認定バーストサイズ -   - トークンバケット最初のセットを指定します。サイズトークンバケット - 第2のセットは超過バーストを指定します。 -   -  dsMeterEntryとdsTBParamEntry  -  trTCMメーター（RFC 2698）は、二組を使用して指定することができます。認定情報レートおよび認定バーストサイズ -   - トークンバケット最初のセットを指定します。レートとピークバーストサイズ、トークンバケット - 第2のセットは、ピークの情報を指定します。 -   -  dsMeterEntryとdsTBParamEntry  -  tswTCMメーター（RFC 2859）は、二組を使用して指定することができます。コミットターゲットレートトークンバケット - 最初のセットを指定します。ピーク目標レートトークンバケット - 第2のセットが指定されます。各dsTBParamInterval  - トークンバケットは、平均間隔を反映しています。"
    },
    {
      "indent": 0,
      "text": "dsMeterTable OBJECT-TYPE",
      "ja": "dsMeterTable OBJECT-TYPE"
    },
    {
      "indent": 4,
      "text": "SYNTAX       SEQUENCE OF DsMeterEntry\nPIB-ACCESS   install\nSTATUS       current\nDESCRIPTION\n   \"This class enumerates specific meters that a system\n   may use to police a stream of traffic. The traffic\n   stream to be metered is determined by the element(s)\n   upstream of the meter i.e., by the object(s) that\n   point to each entry in this class. This may include\n   all traffic on an interface.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "    Specific meter details are to be found in table entry\n    referenced by dsMeterSpecific.\"\nREFERENCE\n    \"An Informal Management Model for Diffserv Routers,\n    RFC 3290, section 5\"\n ::= { dsPolicyClasses 4 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsMeterEntry OBJECT-TYPE\n    SYNTAX       DsMeterEntry\n    STATUS       current\n    DESCRIPTION\n       \"An entry in the meter table describes a single\n       conformance level of a meter.\"\n    PIB-INDEX { dsMeterPrid }\n    UNIQUENESS { dsMeterSucceedNext,\n                 dsMeterFailNext,\n                 dsMeterSpecific }\n    ::= { dsMeterTable 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "DsMeterEntry ::= SEQUENCE  {\n    dsMeterPrid              InstanceId,\n    dsMeterSucceedNext       Prid,\n    dsMeterFailNext          Prid,\n    dsMeterSpecific          Prid\n}",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsMeterPrid OBJECT-TYPE\n    SYNTAX       InstanceId\n    STATUS       current\n    DESCRIPTION\n       \"An arbitrary integer index that uniquely identifies an\n        instance of the class.\"\n    ::= { dsMeterEntry 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsMeterSucceedNext OBJECT-TYPE SYNTAX Prid STATUS current",
      "ja": "dsMeterSucceedNextのOBJECT-TYPE SYNTAX PRIDのSTATUSの現在"
    },
    {
      "indent": 4,
      "text": "DESCRIPTION\n   \"If the traffic does conform, this selects  the  next\n   diffserv functional datapath element to handle\n   traffic for this data path.",
      "raw": true
    },
    {
      "indent": 4,
      "text": "   The value zeroDotZero in this variable indicates no\n   further DiffServ treatment is performed on traffic of\n   this datapath.  Any other value must point to a valid\n   (pre-existing) instance of one of:\n     dsClfrEntry\n     dsMeterEntry\n     dsActionEntry\n     dsAlgDropEntry\n     dsQEntry.\"\nDEFVAL      { zeroDotZero }\n::= { dsMeterEntry 2 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsMeterFailNext OBJECT-TYPE SYNTAX Prid STATUS current DESCRIPTION \"If the traffic does not conform, this selects the next diffserv functional datapath element to handle traffic for this data path.",
      "ja": "dsMeterFailNextのOBJECT-TYPE SYNTAX PRIDステータス現在の説明は「トラフィックが準拠していない場合、これは、このデータパスのトラフィックを処理するために、次のdiffserv機能的なdatapath要素を選択します。"
    },
    {
      "indent": 4,
      "text": "   The value zeroDotZero in this variable indicates no\n   further DiffServ treatment is performed on traffic of\n   this datapath.  Any other value must point to a valid\n   (pre-existing) instance of one of:\n     dsClfrEntry\n     dsMeterEntry\n     dsActionEntry\n     dsAlgDropEntry\n     dsQEntry.\"\nDEFVAL      { zeroDotZero }\n::= { dsMeterEntry 3 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsMeterSpecific OBJECT-TYPE SYNTAX Prid STATUS current DESCRIPTION \"This indicates the behaviour of the meter by point-ing to an entry containing detailed parameters. Note that entries in that specific table must be managed explicitly.",
      "ja": "dsMeterSpecific OBJECT-TYPE SYNTAX PRIDステータス現在の説明は「これは、詳細なパラメータを含むエントリにポイント-INGのことでメーターの動作を示しています。その特定のテーブルのエントリが明示的に管理しなければならないことに注意してください。"
    },
    {
      "indent": 7,
      "text": "For example, dsMeterSpecific may point to an\nentry in dsTBMeterTable, which contains an instance of a single set of Token Bucket parameters.",
      "raw": true
    },
    {
      "indent": 4,
      "text": "   The PRI pointed to must exist prior to installing this\n   Meter datapath element.\"\n::= { dsMeterEntry 4 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "-- -- Token-Bucket Parameter Table -- -- Each entry in the Token Bucket Parameter Table parameterizes -- a single token bucket. Multiple token buckets can be -- used together to parameterize multiple levels of -- conformance. -- -- Note that an entry in the Token Bucket Parameter Table can -- be shared, pointed to, by multiple dsMeterTable entries. --",
      "ja": " -   - トークンバケットパラメータ表 -   - トークンバケットパラメータテーブルの各エントリには、パラメータ化 - 単一のトークンバケットを。複数のトークンバケットをすることができる - 準拠 - 複数のレベルをパラメータ化するために一緒に使用されます。 -   - トークンバケットパラメータテーブル内のエントリができることに注意してください - 共有することが、複数dsMeterTableエントリによって、指し示さ。 - "
    },
    {
      "indent": 0,
      "text": "dsTBParamTable OBJECT-TYPE\n    SYNTAX       SEQUENCE OF DsTBParamEntry\n    PIB-ACCESS   install\n    STATUS       current\n    DESCRIPTION\n       \"This table enumerates token-bucket meter parameter sets\n       that a system may use to police a stream of traffic.\n       Such parameter sets are modelled here as each having a single\n       rate and a single burst size.  Multiple entries are used\n       when multiple rates/burst sizes are needed.\"\n    REFERENCE\n        \"An Informal Management Model for Diffserv Routers,\n        RFC 3290, section 5.1\"\n    ::= { dsPolicyClasses 5 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsTBParamEntry OBJECT-TYPE\n    SYNTAX       DsTBParamEntry\n    STATUS       current\n    DESCRIPTION\n       \"An entry that describes a single token-bucket\n       parameter set.\"\n    PIB-INDEX { dsTBParamPrid }\n    UNIQUENESS { dsTBParamType,\n                 dsTBParamRate,\n                 dsTBParamBurstSize,\n                 dsTBParamInterval }\n    ::= { dsTBParamTable 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "DsTBParamEntry ::= SEQUENCE  {\n    dsTBParamPrid            InstanceId, dsTBParamType            AutonomousType,\n    dsTBParamRate            Unsigned32,\n    dsTBParamBurstSize       BurstSize,\n    dsTBParamInterval        Unsigned32\n}",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsTBParamPrid OBJECT-TYPE\n    SYNTAX       InstanceId\n    STATUS       current\n    DESCRIPTION\n       \"An arbitrary integer index that uniquely identifies an\n        instance of the class.\"\n    ::= { dsTBParamEntry 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsTBParamType OBJECT-TYPE SYNTAX AutonomousType STATUS current DESCRIPTION \"The Metering algorithm associated with the Token-Bucket parameters. zeroDotZero indicates this is unknown.",
      "ja": "dsTBParamType OBJECT-TYPE SYNTAX AutonomousTypeのステータス現在の説明「トークンバケットパラメータに関連付けられた測光アルゴリズム。のzeroDotZeroはこれが不明であることを示します。"
    },
    {
      "indent": 6,
      "text": "Standard values for generic algorithms are as follows:",
      "ja": "次のように一般的なアルゴリズムのための標準値は次のとおりです。"
    },
    {
      "indent": 6,
      "text": "diffServTBParamSimpleTokenBucket, diffServTBParamAvgRate, diffServTBParamSrTCMBlind, diffServTBParamSrTCMAware, diffServTBParamTrTCMBlind, diffServTBParamTrTCMAware, diffServTBParamTswTCM",
      "ja": "diffServTBParamSimpleTokenBucket、diffServTBParamAvgRate、diffServTBParamSrTCMBlind、diffServTBParamSrTCMAware、diffServTBParamTrTCMBlind、diffServTBParamTrTCMAware、diffServTBParamTswTCM"
    },
    {
      "indent": 4,
      "text": "  These are specified in the DiffServ MIB.\"\nREFERENCE\n    \"An Informal Management Model for Diffserv Routers,\n    RFC 3290, section 5.1\"\n::= { dsTBParamEntry 2 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsTBParamRate OBJECT-TYPE\n    SYNTAX       Unsigned32  (1..4294967295)\n    UNITS        \"kilobits per second\"\n    STATUS       current\n    DESCRIPTION\n       \"The token-bucket rate, in kilobits per second\n       (kbps).  This attribute is used for:\n       1. CIR in RFC 2697 for srTCM\n       2. CIR and PIR in RFC 2698 for trTCM\n       3. CTR and PTR in RFC 2859 for TSWTCM\n       4. AverageRate in RFC 3290, section 5.1.1\"\n    ::= { dsTBParamEntry 3 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsTBParamBurstSize OBJECT-TYPE\n    SYNTAX       BurstSize\n    UNITS        \"Bytes\"\n    STATUS       current\n    DESCRIPTION\n       \"The maximum number of bytes in a single transmission\n       burst.  This attribute is used for:\n       1. CBS and EBS in RFC 2697 for srTCM\n       2. CBS and PBS in RFC 2698 for trTCM\n       3. Burst Size in RFC 3290, section 5.\"\n    ::= { dsTBParamEntry 4 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsTBParamInterval OBJECT-TYPE\n    SYNTAX       Unsigned32  (1..4294967295)\n    UNITS        \"microseconds\"\n    STATUS       current\n    DESCRIPTION\n       \"The time interval used with the token bucket.  For:\n       1. Average Rate Meter, RFC 3290, section 5.1.1,\n         -Delta.\n       2. Simple Token Bucket Meter, RFC 3290, section \n          5.1.3, - time interval t.\n       3. RFC 2859  TSWTCM, -  AVG_INTERVAL.\n       4. RFC 2697 srTCM, RFC 2698 trTCM, - token\n          bucket update time interval.\"\n    ::= { dsTBParamEntry 5 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "-- -- Actions --",
      "ja": " -   -  行動  - "
    },
    {
      "indent": 0,
      "text": "-- -- The Action Table allows enumeration of the different -- types of actions to be applied to a traffic flow. --",
      "ja": " -   - トラフィックフローに適用するアクションのタイプ - アクション表は、異なる列挙することができます。 - "
    },
    {
      "indent": 0,
      "text": "dsActionTable OBJECT-TYPE SYNTAX SEQUENCE OF DsActionEntry PIB-ACCESS install STATUS current DESCRIPTION \"The Action Table enumerates actions that can be per-formed to a stream of traffic. Multiple actions can be concatenated.",
      "ja": "DsActionEntry PIB-ACCESS OF dsActionTable OBJECT-TYPE構文配列ステータス現在の説明は「アクションテーブルがあたりに形成されたトラフィックのストリームに可能なアクションを列挙してインストールします。複数のアクションは、連結することができます。"
    },
    {
      "indent": 7,
      "text": "Specific actions are indicated by dsAction-\nSpecific which points to an entry of a specific\naction type parameterizing the action in detail.\"",
      "raw": true
    },
    {
      "indent": 4,
      "text": "REFERENCE\n    \"An Informal Management Model for Diffserv Routers,\n    RFC 3290, section 6.\"\n::= { dsPolicyClasses 6 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsActionEntry OBJECT-TYPE\n    SYNTAX       DsActionEntry\n    STATUS       current\n    DESCRIPTION\n       \"Each entry in the action table allows description of\n       one specific action to be applied to traffic.\"\n    PIB-INDEX { dsActionPrid }\n    UNIQUENESS { dsActionNext,\n                 dsActionSpecific }\n    ::= { dsActionTable 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "DsActionEntry ::= SEQUENCE  {\n    dsActionPrid              InstanceId,\n    dsActionNext              Prid,\n    dsActionSpecific          Prid\n}",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsActionPrid OBJECT-TYPE\n    SYNTAX       InstanceId\n    STATUS       current\n    DESCRIPTION\n       \"An arbitrary integer index that uniquely identifies an\n        instance of the class.\"\n    ::= { dsActionEntry 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsActionNext OBJECT-TYPE SYNTAX Prid STATUS current DESCRIPTION \"This selects the next diffserv functional datapath element to handle traffic for this data path.",
      "ja": "dsActionNext OBJECT-TYPE SYNTAX PRIDステータス現在の説明は「これは、このデータパスのトラフィックを処理するために、次のdiffserv機能的なdatapath要素を選択します。"
    },
    {
      "indent": 4,
      "text": "   The value zeroDotZero in this variable indicates no\n   further DiffServ treatment is performed on traffic of\n   this datapath.  Any other value must point to a valid\n   (pre-existing) instance of one of:\n     dsClfrEntry\n     dsMeterEntry\n     dsActionEntry\n     dsAlgDropEntry\n     dsQEntry.\"\nDEFVAL      { zeroDotZero }\n::= { dsActionEntry 2 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsActionSpecific OBJECT-TYPE SYNTAX Prid STATUS current DESCRIPTION \"A pointer to an object instance providing additional information for the type of action indicated by this action table entry.",
      "ja": "dsActionSpecificのOBJECT-TYPE SYNTAX PRID STATUSの現在の記述、「このアクションテーブルエントリによって示される行動の種類のための追加情報を提供するオブジェクト・インスタンスへのポインタ。"
    },
    {
      "indent": 7,
      "text": "For the standard actions defined by this PIB module,\nthis should point to an instance of dsDscpMarkActEntry.\nFor other actions, it may point to an instance of a\nPRC defined in some other PIB.",
      "raw": true
    },
    {
      "indent": 4,
      "text": "   The PRI pointed to must exist prior to installing this\n   action datapath entry.\"\n::= { dsActionEntry 3 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "-- DSCP Mark Action Table -- -- Rows of this class are pointed to by dsActionSpecific -- to provide detailed parameters specific to the DSCP -- Mark action. -- This class should at most contain one entry for each supported -- DSCP value. These entries should be reused by different -- dsActionEntry in same or different data paths. --",
      "ja": " -  DSCPマーク・アクション表 -   - このクラスの行はdsActionSpecificによって指され - マーク・アクション -  DSCPに固有の詳細なパラメータを提供します。 -  DSCP値 - このクラスは、最大でそれぞれに1つのエントリサポートが含まれている必要があります。同じまたは異なるデータパスにdsActionEntry  - これらのエントリは、異なるによって再利用されるべきです。 - "
    },
    {
      "indent": 0,
      "text": "dsDscpMarkActTable OBJECT-TYPE\n    SYNTAX       SEQUENCE OF DsDscpMarkActEntry\n    PIB-ACCESS   install\n    STATUS       current\n    DESCRIPTION\n       \"This class enumerates specific DSCPs used for marking or\n       remarking the DSCP field of IP packets. The entries of this\n       table may be referenced by a dsActionSpecific attribute.\"\n    REFERENCE\n        \"An Informal Management Model for Diffserv Routers,\n        RFC 3290, section 6.1\"\n    ::= { dsPolicyClasses 7 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsDscpMarkActEntry OBJECT-TYPE SYNTAX DsDscpMarkActEntry STATUS current DESCRIPTION \"An entry in the DSCP mark action table that describes a single DSCP used for marking.\" PIB-INDEX { dsDscpMarkActPrid }",
      "ja": "dsDscpMarkActEntryのOBJECT-TYPE SYNTAX DsDscpMarkActEntryステータス現在の説明「単一DSCPマーキングに使用説明DSCPマークアクションテーブルのエントリ」。 PIB-INDEX {dsDscpMarkActPrid}"
    },
    {
      "indent": 4,
      "text": "UNIQUENESS { dsDscpMarkActDscp }\n::= { dsDscpMarkActTable 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "DsDscpMarkActEntry ::= SEQUENCE  {\n    dsDscpMarkActPrid          InstanceId,\n    dsDscpMarkActDscp          Dscp\n}",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsDscpMarkActPrid OBJECT-TYPE\n    SYNTAX       InstanceId\n    STATUS       current\n    DESCRIPTION\n       \"An arbitrary integer index that uniquely identifies an\n        instance of the class.\"\n    ::= { dsDscpMarkActEntry 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsDscpMarkActDscp OBJECT-TYPE\n    SYNTAX       Dscp\n    STATUS       current\n    DESCRIPTION\n       \"The DSCP that this Action uses for marking/remarking\n       traffic.  Note that a DSCP value of -1 is not permit-\n       ted in this class.  It is quite possible that the\n       only packets subject to this Action are already\n       marked with this DSCP.  Note also that DiffServ may\n       result in packet remarking both on ingress to a net-\n       work and on egress from it and it is quite possible\n       that ingress and egress would occur in the same\n       router.\"\n    ::= { dsDscpMarkActEntry 2 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "-- -- Algorithmic Drop Table --",
      "ja": " -   - アルゴリズムドロップテーブル - "
    },
    {
      "indent": 0,
      "text": "-- Algorithmic Drop Table is the entry point for the Algorithmic -- Dropper functional data path element.",
      "ja": " - ドロッパー機能データパス要素 - アルゴリズムドロップ表はアルゴリズムのエントリポイントです。"
    },
    {
      "indent": 0,
      "text": "-- For a simple algorithmic dropper, a single algorithmic drop entry -- will be sufficient to parameterize the dropper.",
      "ja": " - 単純なアルゴリズムの点滴器の場合、単一のアルゴリズムドロップエントリは - ドロッパーをパラメータ化するのに十分であろう。"
    },
    {
      "indent": 0,
      "text": "-- For more complex algorithmic dropper, the dsAlgDropSpecific -- attribute can be used to reference an entry in a parameter table, -- e.g., dsRandomDropTable for random dropper.",
      "ja": " - より複雑なアルゴリズム点滴器について、dsAlgDropSpecific  - 属性は、パラメータテーブル内のエントリを参照するのに使用することができる - 例えば、dsRandomDropTableランダムドロッパーため。"
    },
    {
      "indent": 0,
      "text": "-- For yet more complex dropper, for example, dropper that measures -- multiple queues, each queue with its own algorithm, can use a -- dsAlgDropTable entry as the entry point for Algorithmic Dropper",
      "ja": " - さらにより複雑な点滴器には、例えば、測定ドロッパー - アルゴリズムドロッパーのエントリポイントとしてdsAlgDropTable入力 - 複数のキュー、独自のアルゴリズムで各キューは、使用することができ"
    },
    {
      "indent": 0,
      "text": "-- functional data path element, leaving the dropper parameters -- for each queue be specified by entries of dsMQAlgDropTable. -- In such usage, the anchoring dsAlgDropEntry's dsAlgDropType -- should be mQDrop, and its dsAlgDropQMeasure should reference -- the subsequent dsMQAlgDropEntry's, its dsAlgDropSpecific -- should be used to reference parameters applicable to all the -- queues being measured. -- The subsequent dsMQAlgDropEntry's will provide the parameters, -- one for each queue being measured. The dsMQAlgDropEntry's are -- chained using their dsMQAlgDropNext attributes. --",
      "ja": " - 機能データパス要素、ドロッパーパラメータを残す - 各キューのはdsMQAlgDropTableのエントリによって指定されます。 -  mQDropであるべきであり、そのdsAlgDropQMeasureが参照すべきである -   - このような使用、アンカーdsAlgDropEntryのdsAlgDropTypeでdsMQAlgDropEntry年代以降、そのdsAlgDropSpecificは - キューが測定される - に該当するすべてのパラメータを参照するために使用されるべきです。 -  dsMQAlgDropEntry年代以降のは、パラメータを提供します - キューごとに1が測定されています。 dsMQAlgDropEntryさんがされている - 彼らのdsMQAlgDropNext属性を使用してチェーン。 - "
    },
    {
      "indent": 0,
      "text": "dsAlgDropTable OBJECT-TYPE\n    SYNTAX       SEQUENCE OF DsAlgDropEntry\n    PIB-ACCESS   install\n    STATUS       current\n    DESCRIPTION\n       \"The algorithmic drop table contains entries describ-\n       ing a functional data path element that drops\n       packets according to some algorithm.\"\n    REFERENCE\n        \"An Informal Management Model for Diffserv Routers,\n        RFC 3290, section 7.1.3\"\n    ::= { dsPolicyClasses 8 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsAlgDropEntry OBJECT-TYPE\n    SYNTAX       DsAlgDropEntry\n    STATUS       current\n    DESCRIPTION\n       \"An entry describes a process that drops packets\n       according to some algorithm.  Further details of the\n       algorithm type are to be found in dsAlgDropType\n       and with more detail parameter entry pointed to by\n       dsAlgDropSpecific when necessary.\"\n    PIB-INDEX { dsAlgDropPrid }\n    UNIQUENESS { dsAlgDropType,\n                 dsAlgDropNext,\n                 dsAlgDropQMeasure,\n                 dsAlgDropQThreshold,\n                 dsAlgDropSpecific }\n    ::= { dsAlgDropTable 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "DsAlgDropEntry ::= SEQUENCE  {\n    dsAlgDropPrid             InstanceId,\n    dsAlgDropType             INTEGER,\n    dsAlgDropNext             Prid,\n    dsAlgDropQMeasure         Prid,\n    dsAlgDropQThreshold       Unsigned32, dsAlgDropSpecific         Prid\n}",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsAlgDropPrid OBJECT-TYPE\n    SYNTAX       InstanceId\n    STATUS       current\n    DESCRIPTION\n       \"An arbitrary integer index that uniquely identifies an\n        instance of the class.\"\n    ::= { dsAlgDropEntry 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsAlgDropType OBJECT-TYPE SYNTAX INTEGER { other(1), tailDrop(2), headDrop(3), randomDrop(4), alwaysDrop(5), mQDrop(6) } STATUS current DESCRIPTION \"The type of algorithm used by this dropper. A value of tailDrop(2), headDrop(3), or alwaysDrop(5) represents an algorithm that is completely specified by this PIB.",
      "ja": "dsAlgDropType OBJECT-TYPE SYNTAX INTEGER {他の（1）、tailDrop（2）、headDrop（3）、randomDrop（4）、alwaysDrop（5）、mQDrop（6）}ステータス現在の説明「このドロッパーによって使用されるアルゴリズムのタイプ。 tailDropの値が（2）、headDrop（3）、又はalwaysDrop（5）完全にこのPIBによって指定されるアルゴリズムを表します。"
    },
    {
      "indent": 7,
      "text": "A value of other(1) indicates that the specifics of\nthe drop algorithm are specified in some other PIB\nmodule, and that the dsAlgDropSpecific attribute\npoints to an instance of a PRC in that PIB that\nspecifies the information necessary to implement the\nalgorithm.",
      "raw": true
    },
    {
      "indent": 7,
      "text": "The tailDrop(2) algorithm is described as follows: dsAlgDropQThreshold represents the depth of the queue, pointed to by dsAlgDropQMeasure, at which all newly arriving packets will be dropped.",
      "ja": "次のようにtailDrop（2）アルゴリズムが記載されている：dsAlgDropQThresholdは、キューの深さを示し、すべての新しく到着パケットが廃棄されるでdsAlgDropQMeasure、によって指さ。"
    },
    {
      "indent": 7,
      "text": "The headDrop(3) algorithm is described as follows: if a packet arrives when the current depth of the queue, pointed to by dsAlgDropQMeasure, is at dsAlgDropQThreshold, packets currently at the head of the queue are dropped to make room for the new packet to be enqueued at the tail of the queue.",
      "ja": "次のようにheadDrop（3）アルゴリズムが記述されている：キューの現在の深さは、dsAlgDropQMeasureによって指されたときにパケットが到着した場合、dsAlgDropQThresholdであり、キューの先頭にある現在のパケットがに新しいパケットのための余地を作るためにドロップされますキューの末尾にエンキューします。"
    },
    {
      "indent": 7,
      "text": "The randomDrop(4) algorithm is described as follows: on packet arrival, an algorithm is executed which may randomly drop the packet, or drop other packet(s) from the queue in its place. The specifics of the algorithm may be proprietary. For this algorithm, dsAlgDropSpecific points to a dsRandomDropEntry that describes the algorithm. For this algorithm, dsAlgQThreshold is understood to be the absolute maximum size of the queue and additional parameters are described in dsRandomDropTable.",
      "ja": "、パケット到着時にアルゴリズムは、ランダムにパケットをドロップするか、またはその代わりに、待ち行列からの他のパケット（複数可）をドロップする可能性が実行される次のようrandomDrop（4）アルゴリズムが記載されています。アルゴリズムの詳細は独自のかもしれません。このアルゴリズムでは、dsAlgDropSpecificはアルゴリズムを記述dsRandomDropEntryを指します。このアルゴリズムでは、dsAlgQThresholdキューの絶対最大サイズであると理解され、追加のパラメータがdsRandomDropTableに記載されています。"
    },
    {
      "indent": 7,
      "text": "The alwaysDrop(5) algorithm always drops packets. In this case, the other configuration values in this Entry are not meaningful; The queue is not used, therefore, dsAlgDropNext, dsAlgDropQMeasure, and dsAlgDropSpecific should be all set to zeroDotZero.",
      "ja": "alwaysDropは（5）のアルゴリズムは常にパケットを廃棄します。この場合、このエントリ内の他の設定値は意味がありません。キューが使用されていないので、dsAlgDropNextは、dsAlgDropQMeasure、およびdsAlgDropSpecificは、すべてのzeroDotZeroに設定する必要があります。"
    },
    {
      "indent": 7,
      "text": "The mQDrop(6) algorithm measures multiple queues for the drop algorithm. The queues measured are represented by having dsAlgDropQMeasure referencing a dsMQAlgDropEntry. Each of the chained dsMQAlgDropEntry is used to describe the drop algorithm for one of the measured queues.\"",
      "ja": "mQDropは（6）アルゴリズムは、ドロップアルゴリズムのための複数のキューを測定します。測定されたキューはdsMQAlgDropEntryを参照dsAlgDropQMeasureを持つことによって表現されます。チェーンdsMQAlgDropEntryのそれぞれが測定されたキューのいずれかのドロップアルゴリズムを記述するために使用されています。」"
    },
    {
      "indent": 4,
      "text": "::= { dsAlgDropEntry 2 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsAlgDropNext OBJECT-TYPE SYNTAX Prid STATUS current DESCRIPTION \"This selects the next diffserv functional datapath element to handle traffic for this data path.",
      "ja": "dsAlgDropNext OBJECT-TYPE SYNTAX PRIDステータス現在の説明は「これは、このデータパスのトラフィックを処理するために、次のdiffserv機能的なdatapath要素を選択します。"
    },
    {
      "indent": 7,
      "text": "The value zeroDotZero in this attribute indicates no\nfurther DiffServ treatment is performed on traffic of\nthis datapath.  Any other value must point to a valid\n(pre-existing) instance of one of:\n  dsClfrEntry\n  dsMeterEntry\n  dsActionEntry\n  dsAlgDropEntry\n  dsQEntry.",
      "raw": true
    },
    {
      "indent": 4,
      "text": "   When dsAlgDropType is alwaysDrop(5), this attribute is\n   Ignored.\"\nDEFVAL      { zeroDotZero }\n::= { dsAlgDropEntry 3 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsAlgDropQMeasure OBJECT-TYPE SYNTAX Prid STATUS current DESCRIPTION",
      "ja": "dsAlgDropQMeasureのOBJECT-TYPE SYNTAX PRIDステータス現在の説明"
    },
    {
      "indent": 7,
      "text": "\"Points to a PRI to indicate the queues that a drop algorithm\nis to monitor when deciding whether to drop a packet.",
      "raw": true
    },
    {
      "indent": 7,
      "text": "For alwaysDrop(5), this attribute should be zeroDotZero. For tailDrop(2), headDrop(3), randomDrop(4), this should point to an entry in the dsQTable. For mQDrop(6), this should point to a dsMQAlgDropEntry that Describe one of the queues being measured for multiple queue dropper.",
      "ja": "alwaysDrop（5）の場合、この属性はのzeroDotZeroでなければなりません。 tailDrop（2）、headDrop（3）、randomDrop（4）、これはdsQTableのエントリを指す必要があります。 mQDrop（6）、これは、複数のキュー・ドロッパのために測定されるキューのいずれかを説明dsMQAlgDropEntryを指すべきです。"
    },
    {
      "indent": 4,
      "text": "   The PRI pointed to must exist prior to installing\n   this dropper element.\"\n::= { dsAlgDropEntry 4 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsAlgDropQThreshold OBJECT-TYPE SYNTAX Unsigned32 (1..4294967295) UNITS \"Bytes\" STATUS current DESCRIPTION \"A threshold on the depth in bytes of the queue being measured at which a trigger is generated to the drop-ping algorithm, unless dsAlgDropType is alwaysDrop(5) where this attribute is ignored.",
      "ja": "dsAlgDropQThresholdのOBJECT-TYPE構文Unsigned32（1 4294967295）UNITS「バイト」ステータス現在の説明「dsAlgDropTypeはalwaysDrop（ない限りトリガーは、ドロップピングアルゴリズムに生成された測定されているキューのバイト単位の深さに閾値5）ここで、この属性は無視されます。"
    },
    {
      "indent": 4,
      "text": "   For the tailDrop(2) or headDrop(3) algorithms, this\n   represents the depth of the queue, pointed to by\n   dsAlgDropQMeasure, at which the drop action\n   will take place. Other algorithms will need to define\n   their own semantics for this threshold.\"\n::= { dsAlgDropEntry 5 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsAlgDropSpecific OBJECT-TYPE SYNTAX Prid STATUS current DESCRIPTION \"Points to a table entry that provides further detail regarding a drop algorithm. The PRI pointed to must exist prior to installing this dropper element.",
      "ja": "ドロップアルゴリズムに関するさらなる詳細を提供するテーブルエントリにdsAlgDropSpecific OBJECT-TYPE SYNTAX PRID STATUSの現在の記述、「ポイント。PRIは、従来、このドロッパー要素を取り付けるに存在しなければならないと指摘しました。"
    },
    {
      "indent": 7,
      "text": "Entries with dsAlgDropType equal to other(1) must\nhave this point to an instance of a PRC defined\nin another PIB module.",
      "raw": true
    },
    {
      "indent": 7,
      "text": "Entries with dsAlgDropType equal to random-Drop(4) must have this point to an entry in dsRandomDropTable.",
      "ja": "ランダムドロップ（4）に等しいdsAlgDropType持つエントリはdsRandomDropTableのエントリにこの点を有していなければなりません。"
    },
    {
      "indent": 7,
      "text": "Entries with dsAlgDropType equal to mQDrop(6) can use this attribute to reference parameters that is used by all the queues of the multiple queues being measured.",
      "ja": "mQDropに等しいdsAlgDropType持つエントリ（6）測定される複数のキューのすべてのキューで使用されたパラメータを参照するためにこの属性を使用することができます。"
    },
    {
      "indent": 4,
      "text": "   For all other algorithms, this should take the value\n   zeroDotZero.\"\n::= { dsAlgDropEntry 6 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "-- -- Multiple Queue Algorithmic Drop Table -- -- Entries of this table should be referenced by dsAlgDropQMeasure -- when dsAlgDropType is mQDrop(6) for droppers measuring multiple -- queues for its drop algorithm. -- Each entry of the table is used to describe the drop algorithm -- for a single queue within the multiple queues being measured. -- -- Entries of this table, dsMQAlgDropEntry, is extended from -- dsAlgDropEntry, with usage of corresponding parameters the same -- except: -- dsAlgDropNext is used to point to the next diffserv -- functional data path element when the packet is not dropped. -- dsMQAlgDropExceedNext is used to point to the next -- dsMQAlgDropEntry for chaining together the multiple -- dsMQAlgDropEntry's for the multiple queues being measured. --",
      "ja": " -   - 複数のキューアルゴリズムドロップ表 -   - このテーブルのエントリdsAlgDropQMeasureによって参照されるべきである - その降下アルゴリズムのキュー -  dsAlgDropTypeがmQDropある場合（6）複数の測定ドロッパため。 - 測定されている複数のキュー内の単一のキューの - テーブルの各エントリは、ドロップアルゴリズムを記述するために使用されます。 -   - 同一の対応するパラメータの使用とdsAlgDropEntry、 -   - このテーブルのエントリ、dsMQAlgDropEntryは、より拡張され以外は： - パケットである場合、機能データ経路要素 -  dsAlgDropNextは次のDiffServを指すように使用されドロップされません。 - 測定されている複数のキューのためdsMQAlgDropEntryの - 一緒に複数の連鎖するためdsMQAlgDropEntry  -  dsMQAlgDropExceedNextは、次を指すために使用されます。 - "
    },
    {
      "indent": 0,
      "text": "dsMQAlgDropTable OBJECT-TYPE\n    SYNTAX       SEQUENCE OF DsMQAlgDropEntry\n    PIB-ACCESS   install\n    STATUS       current\n    DESCRIPTION\n       \"The multiple queue algorithmic drop table contains entries\n       describing each queue being measured for the multiple queue\n       algorithmic dropper.\"\n    ::= { dsPolicyClasses 9 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsMQAlgDropEntry OBJECT-TYPE SYNTAX DsMQAlgDropEntry STATUS current DESCRIPTION \"An entry describes a process that drops packets according to some algorithm. Each entry is used for each of the multiple queues being measured. Each entry extends the basic dsAlgDropEntry with adding of a dsMQAlgDropExceedNext attribute.",
      "ja": "dsMQAlgDropEntry OBJECT-TYPE SYNTAX DsMQAlgDropEntryステータス現在の説明「エントリは、いくつかのアルゴリズムに従ってパケットを廃棄方法が記載されている。各エントリは、測定される複数のキューのそれぞれのために使用される。各エントリはdsMQAlgDropExceedNext属性の追加と基本dsAlgDropEntryを拡張します。"
    },
    {
      "indent": 4,
      "text": "   Further details of the algorithm type are to be found in\n   dsAlgDropType and with more detail parameter entry pointed to by dsMQAlgDropSpecific when necessary.\"\nEXTENDS { dsAlgDropEntry }\nUNIQUENESS { dsMQAlgDropExceedNext }\n::= { dsMQAlgDropTable 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "DsMQAlgDropEntry ::= SEQUENCE  {\n    dsMQAlgDropExceedNext     Prid\n}",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsMQAlgDropExceedNext OBJECT-TYPE\n    SYNTAX       Prid\n    STATUS       current\n    DESCRIPTION\n       \"Used for linking of multiple dsMQAlgDropEntry for mQDrop.\n       A value of zeroDotZero indicates this is the last of a\n       chain of dsMQAlgDropEntry.\"\n    DEFVAL      { zeroDotZero }\n    ::= { dsMQAlgDropEntry 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "-- -- Random Drop Table --",
      "ja": " -   - ランダムドロップテーブル - "
    },
    {
      "indent": 0,
      "text": "dsRandomDropTable OBJECT-TYPE\n    SYNTAX       SEQUENCE OF DsRandomDropEntry\n    PIB-ACCESS   install\n    STATUS       current\n    DESCRIPTION\n       \"The random drop table contains entries describing a\n       process that drops packets randomly. Entries in this\n       table is intended to be pointed to by dsAlgDropSpecific\n       when dsAlgDropType is randomDrop(4).\"\n    REFERENCE\n        \"An Informal Management Model for Diffserv Routers,\n        RFC 3290, section 7.1.3\"\n    ::= { dsPolicyClasses 10 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsRandomDropEntry OBJECT-TYPE\n    SYNTAX       DsRandomDropEntry\n    STATUS       current\n    DESCRIPTION\n       \"An entry describes a process that drops packets\n       according to a random algorithm.\"\n    PIB-INDEX { dsRandomDropPrid }\n    UNIQUENESS { dsRandomDropMinThreshBytes,\n                 dsRandomDropMinThreshPkts,\n                 dsRandomDropMaxThreshBytes,\n                 dsRandomDropMaxThreshPkts, dsRandomDropProbMax,\n                 dsRandomDropWeight,\n                 dsRandomDropSamplingRate\n               }\n    ::= { dsRandomDropTable 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "DsRandomDropEntry ::= SEQUENCE  {\n    dsRandomDropPrid             InstanceId,\n    dsRandomDropMinThreshBytes   Unsigned32,\n    dsRandomDropMinThreshPkts    Unsigned32,\n    dsRandomDropMaxThreshBytes   Unsigned32,\n    dsRandomDropMaxThreshPkts    Unsigned32,\n    dsRandomDropProbMax          Unsigned32,\n    dsRandomDropWeight           Unsigned32,\n    dsRandomDropSamplingRate     Unsigned32\n}",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsRandomDropPrid OBJECT-TYPE\n    SYNTAX       InstanceId\n    STATUS       current\n    DESCRIPTION\n       \"An arbitrary integer index that uniquely identifies an\n        instance of the class.\"\n    ::= { dsRandomDropEntry 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsRandomDropMinThreshBytes OBJECT-TYPE\n    SYNTAX       Unsigned32  (1..4294967295)\n    UNITS        \"bytes\"\n    STATUS       current\n    DESCRIPTION\n       \"The average queue depth in bytes, beyond which traffic has a\n       non-zero probability of being dropped.\"\n     ::= { dsRandomDropEntry 2 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsRandomDropMinThreshPkts OBJECT-TYPE\n    SYNTAX       Unsigned32  (1..4294967295)\n    UNITS        \"packets\"\n    STATUS       current\n    DESCRIPTION\n      \"The average queue depth in packets, beyond which traffic has\n      a non-zero probability of being dropped.\"\n    ::= { dsRandomDropEntry 3 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsRandomDropMaxThreshBytes OBJECT-TYPE SYNTAX Unsigned32 (1..4294967295) UNITS \"bytes\" STATUS current DESCRIPTION",
      "ja": "dsRandomDropMaxThreshBytes OBJECT-TYPE構文Unsigned32（1 4294967295）UNITS \"バイト\" STATUSの現在の記述"
    },
    {
      "indent": 4,
      "text": "  \"The average queue depth beyond which traffic has a\n  probability indicated by dsRandomDropProbMax of being dropped\n  or marked.  Note that this differs from the physical queue\n  limit, which is stored in dsAlgDropQThreshold.\"\n::= { dsRandomDropEntry 4 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsRandomDropMaxThreshPkts OBJECT-TYPE\n    SYNTAX       Unsigned32  (1..4294967295)\n    UNITS        \"packets\"\n    STATUS       current\n    DESCRIPTION\n      \"The average queue depth beyond which traffic has a\n      probability indicated by dsRandomDropProbMax of being dropped\n      or marked.  Note that this differs from the physical queue\n      limit, which is stored in dsAlgDropQThreshold.\"\n    ::= { dsRandomDropEntry 5 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsRandomDropProbMax OBJECT-TYPE SYNTAX Unsigned32 (0..1000) STATUS current DESCRIPTION \"The worst case random drop probability, expressed in drops per thousand packets.",
      "ja": "dsRandomDropProbMaxのOBJECT-TYPE構文Unsigned32（0..1000）STATUS現在の記述、「最悪の場合のランダムな廃棄確率は、千のパケットあたりの滴中で発現しました。"
    },
    {
      "indent": 4,
      "text": "  For example, if every packet may be dropped in the worst case\n  (100%), this has the value 1000. Alternatively, if in the\n  worst case one percent (1%) of traffic may be dropped, it has\n  the value 10.\"\n::= { dsRandomDropEntry 6 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsRandomDropWeight OBJECT-TYPE SYNTAX Unsigned32 (0..4294967295) STATUS current DESCRIPTION \"The weighting of past history in affecting the Exponentially Weighted Moving Average function which calculates the current average queue depth. The equation uses dsRandomDropWeight/MaxValue as the coefficient for the new sample in the equation, and (MaxValue - dsRandomDropWeight)/MaxValue as the coefficient of the old value, where, MaxValue is determined via capability reported by the PEP.",
      "ja": "dsRandomDropWeight OBJECT-TYPE構文Unsigned32（0 4294967295）ステータス現在の説明「現在の平均キュー深度を算出する指数加重移動平均機能に影響を与えるにおける過去の歴史の重み。式は、新しいサンプルの係数としてdsRandomDropWeight / MaxValueをを使用し式、及び（MaxValueを -  dsRandomDropWeight）中/ MaxValueをはPEPによって報告された能力を介して決定される、古い値の係数としてMaxValueを。"
    },
    {
      "indent": 4,
      "text": "  Implementations may further limit the values of\n  dsRandomDropWeight via the capability tables.\"\n::= { dsRandomDropEntry 7 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsRandomDropSamplingRate OBJECT-TYPE",
      "ja": "dsRandomDropSamplingRateのOBJECT-TYPE"
    },
    {
      "indent": 4,
      "text": "SYNTAX       Unsigned32  (0..1000000)\nSTATUS       current\nDESCRIPTION\n  \"The number of times per second the queue is sampled for queue\n  average calculation. A value of zero means the queue is\n  sampled approximately each time a packet is enqueued (or\n  dequeued).\"\n::= { dsRandomDropEntry 8 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "-- -- Queue Table --",
      "ja": " -   - キュー表 - "
    },
    {
      "indent": 0,
      "text": "-- -- An entry of dsQTable represents a FIFO queue diffserv -- functional data path element as described in [MODEL] section -- 7.1.1. -- Notice the specification of scheduling parameters for a queue -- as part of the input to a scheduler functional data path -- element as described in [MODEL] section 7.1.2. This allows -- building of hierarchical queuing/scheduling. -- A queue therefore is parameterized by: -- 1. Which scheduler will service this queue, dsQNext. -- 2. How the scheduler will service this queue, with respect -- to all the other queues the same scheduler needs to service, -- dsQMinRate and dsQMaxRate. -- -- Notice one or more upstream diffserv functional data path element -- may share, point to, a dsQTable entry as described in [MODEL] -- section 7.1.1. --",
      "ja": "7.1.1  -  [MODEL]セクションに記載したように機能データパスエレメント -   -   -  dsQTableのエントリは、FIFOキューのDiffServを表します。 - キューのスケジューリングパラメータの仕様に注意してください - スケジューラ機能データ経路への入力の一部として - 要素を[MODEL]セクション7.1.2に記載したように。これが可能に - 階層型キューイング/スケジューリングの建物。 - それゆえによってパラメータ化されるキュー： -  1.どのスケジューラはこのキュー、dsQNextにサービスを提供します。 -  2.どのようにスケジューラは関連して、このキューにサービスを提供します -  dsQMinRateとdsQMaxRate  - 他のすべてのキューに同じスケジューラはサービスに必要。 -   - お知らせ一つ以上の上流のDiffServ機能データパス要素 - セクション7.1.1  -  [MODEL]で説明したように、点がdsQTableエントリを共有することができます。 - "
    },
    {
      "indent": 0,
      "text": "dsQTable OBJECT-TYPE\n    SYNTAX       SEQUENCE OF DsQEntry\n    PIB-ACCESS   install\n    STATUS       current\n    DESCRIPTION\n    \"The Queue Table enumerates the queues.\"\n    ::= { dsPolicyClasses 11 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsQEntry OBJECT-TYPE SYNTAX DsQEntry STATUS current DESCRIPTION \"An entry in the Queue Table describes a single queue as a functional data path element.\" PIB-INDEX { dsQPrid } UNIQUENESS { dsQNext,",
      "ja": "dsQEntryのOBJECT-TYPE SYNTAX DsQEntryステータス現在の説明は「キュー・テーブルのエントリは、機能データパス要素として単一のキューを記載しています。」 PIB-INDEX {dsQPrid} UNIQUENESS {dsQNext、"
    },
    {
      "indent": 4,
      "text": "             dsQMinRate,\n             dsQMaxRate }\n::= { dsQTable 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "DsQEntry ::= SEQUENCE  {\n    dsQPrid                    InstanceId,\n    dsQNext                    Prid,\n    dsQMinRate                 Prid,\n    dsQMaxRate                 Prid\n}",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsQPrid OBJECT-TYPE\n    SYNTAX       InstanceId\n    STATUS       current\n    DESCRIPTION\n        \"An arbitrary integer index that uniquely identifies an\n        instance of the class.\"\n    ::= { dsQEntry 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsQNext OBJECT-TYPE SYNTAX Prid STATUS current DESCRIPTION \"This selects the next diffserv scheduler. This must point to a dsSchedulerEntry.",
      "ja": "dsQNext OBJECT-TYPE SYNTAX PRIDステータス現在の説明は「これは、次のDiffServスケジューラを選択します。これはdsSchedulerEntryを指している必要があります。"
    },
    {
      "indent": 4,
      "text": "   A value of zeroDotZero in this attribute indicates an\n   incomplete dsQEntry instance.  In such a case, the entry\n   has no operational effect, since it has no parameters to\n   give it meaning.\"\n::= { dsQEntry 2 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsQMinRate OBJECT-TYPE\n    SYNTAX       Prid\n    STATUS       current\n    DESCRIPTION\n       \"This Prid indicates the entry in dsMinRateTable\n       the scheduler, pointed to by dsQNext, should use to service\n       this queue.\n       If this value is zeroDotZero\n       then minimum rate and priority is unspecified.\n       If this value is not zeroDotZero then the instance pointed to\n       must exist prior to installing this entry.\"\n    ::= { dsQEntry 3 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsQMaxRate OBJECT-TYPE SYNTAX Prid STATUS current",
      "ja": "dsQMaxRateのOBJECT-TYPE SYNTAX PRIDのSTATUSの現在"
    },
    {
      "indent": 4,
      "text": "DESCRIPTION\n   \"This Prid indicates the entry in dsMaxRateTable\n   the scheduler, pointed to by dsQNext, should use to service\n   this queue.\n   If this value is zeroDotZero, then the maximum rate is the\n   line speed of the interface.\n   If this value is not zeroDotZero, then the instance pointed\n   to must exist prior to installing this entry.\"\n::= { dsQEntry 4 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "-- -- Scheduler Table -- -- -- The Scheduler Table is used for representing packet schedulers: -- it provides flexibility for multiple scheduling algorithms, each -- servicing multiple queues, to be used on the same -- logical/physical interface of a data path. -- -- Notice the servicing parameters the scheduler uses is -- specified by each of its upstream functional data path elements, -- queues or schedulers of this PIB. -- The coordination and coherency between the servicing parameters -- of the scheduler's upstream functional data path elements must -- be maintained for the scheduler to function correctly. -- -- The dsSchedulerMinRate and dsSchedulerMaxRate attributes are -- used for specifying the servicing parameters for output of a -- scheduler when its downstream functional data path element -- is another scheduler. -- This is used for building hierarchical queue/scheduler. -- -- More discussion of the scheduler functional data path element -- is in [MODEL] section 7.1.2. --",
      "ja": " -   - スケジューラ表 -   -   - スケジューラテーブルはパケットスケジューラを表すために使用される： - それは、複数のスケジューリングアルゴリズムのための柔軟性を提供し、各 - 複数のキューをサービスし、同じで使用する - 論理/物理データパスのインターフェース。 -   - キューまたはこのPIBのスケジューラ - その上流機能データパス要素の各々によって指定 - スケジューラが使用するサービス・パラメータに注目してください。 - サービス・パラメータの間の調整と一貫 - スケジューラが正しく機能するために維持される - スケジューラの上流の機能データパス要素がなければなりません。 -   -  dsSchedulerMinRateとdsSchedulerMaxRate属性がある - その下流の機能データパス要素が場合スケジューラ -   - 別のスケジューラでの出力のためのサービスパラメータを指定するために使用されます。 - これは、階層的なキュー/スケジューラを構築するために使用されます。 -   - スケジューラ機能データパス要素の詳細な議論は、 -  [MODEL]セクション7.1.2です。 - "
    },
    {
      "indent": 0,
      "text": "dsSchedulerTable OBJECT-TYPE SYNTAX SEQUENCE OF DsSchedulerEntry PIB-ACCESS install STATUS current DESCRIPTION \"The Scheduler Table enumerates packet schedulers. Multiple scheduling algorithms can be used on a given datapath, with each algorithm described by one dsSchedulerEntry.\" REFERENCE \"An Informal Management Model for Diffserv Routers, RFC 3290, section 7.1.2\"",
      "ja": "DsSchedulerEntry PIB-ACCESS OF dsSchedulerTable OBJECT-TYPE構文配列は「スケジューラ表は、パケットスケジューラを列挙する。複数のスケジューリングアルゴリズムは、一つdsSchedulerEntryによって説明した各アルゴリズムを用いて、与えられたデータパス上で使用することができる。」STATUSの現在の記述をインストールREFERENCE「はDiffservルータのための非公式の管理モデル、RFC 3290、セクション7.1.2」"
    },
    {
      "indent": 4,
      "text": "::= { dsPolicyClasses 12 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsSchedulerEntry OBJECT-TYPE\n    SYNTAX       DsSchedulerEntry\n    STATUS       current\n    DESCRIPTION\n       \"An entry in the Scheduler Table describing a single\n       instance of a scheduling algorithm.\"\n    PIB-INDEX { dsSchedulerPrid }\n    UNIQUENESS { dsSchedulerNext,\n                 dsSchedulerMethod,\n                 dsSchedulerMinRate,\n                 dsSchedulerMaxRate }\n    ::= { dsSchedulerTable 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "DsSchedulerEntry ::= SEQUENCE  {\n    dsSchedulerPrid                 InstanceId,\n    dsSchedulerNext                 Prid,\n    dsSchedulerMethod               AutonomousType,\n    dsSchedulerMinRate              Prid,\n    dsSchedulerMaxRate              Prid\n}",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsSchedulerPrid OBJECT-TYPE\n    SYNTAX       InstanceId\n    STATUS       current\n    DESCRIPTION\n        \"An arbitrary integer index that uniquely identifies an\n        instance of the class.\"\n    ::= { dsSchedulerEntry 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsSchedulerNext OBJECT-TYPE SYNTAX Prid STATUS current DESCRIPTION \"This selects the next diffserv functional datapath element to handle traffic for this data path.",
      "ja": "dsSchedulerNext OBJECT-TYPE SYNTAX PRIDステータス現在の説明は「これは、このデータパスのトラフィックを処理するために、次のdiffserv機能的なdatapath要素を選択します。"
    },
    {
      "indent": 7,
      "text": "This attribute normally have a value of zeroDotZero to\nindicate no further DiffServ treatment is performed on\ntraffic of this datapath.  The use of zeroDotZero is the\nnormal usage for the last functional datapath element.\nAny value other than zeroDotZero must point to a valid\n(pre-existing) instance of one of:\n  dsSchedulerEntry\n  dsQEntry,",
      "raw": true
    },
    {
      "indent": 7,
      "text": "or:",
      "ja": "または："
    },
    {
      "indent": 9,
      "text": "dsClfrEntry dsMeterEntry dsActionEntry dsAlgDropEntry",
      "ja": "dsClfrEntry dsMeterEntry dsActionEntry dsAlgDropEntry"
    },
    {
      "indent": 4,
      "text": "   This points to another dsSchedulerEntry\n   for implementation of multiple scheduler methods for\n   the same data path, and for implementation of\n   hierarchical schedulers.\"\nDEFVAL       { zeroDotZero }\n::= { dsSchedulerEntry 2 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsSchedulerMethod OBJECT-TYPE\n    SYNTAX       AutonomousType\n    STATUS       current\n    DESCRIPTION\n      \"The scheduling algorithm used by this Scheduler.\n      Standard values for generic algorithms:\n        diffServSchedulerPriority,\n        diffServSchedulerWRR,\n        diffServSchedulerWFQ\n      are specified in the DiffServ MIB.\n      Additional values may be further specified in other PIBs.\n      A value of zeroDotZero indicates this is unknown.\"\n    REFERENCE\n        \"An Informal Management Model for Diffserv Routers,\n        RFC 3290, section 7.1.2\"\n    ::= { dsSchedulerEntry 3 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsSchedulerMinRate OBJECT-TYPE SYNTAX Prid STATUS current DESCRIPTION \"This Prid indicates the entry in dsMinRateTable which indicates the priority or minimum output rate from this scheduler. This attribute is used only when there is more than one level of scheduler.",
      "ja": "dsSchedulerMinRateのOBJECT-TYPE SYNTAX PRIDステータス現在の説明は「このPRIDこのスケジューラから優先または最小出力レートを示しdsMinRateTableのエントリを示している。スケジューラの複数のレベルがある場合にのみ、この属性が使用されます。"
    },
    {
      "indent": 4,
      "text": "   When it has the value zeroDotZero, it indicates that no\n   Minimum rate or priority is imposed.\"\nDEFVAL      { zeroDotZero }\n::= { dsSchedulerEntry 4 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsSchedulerMaxRate OBJECT-TYPE SYNTAX Prid STATUS current DESCRIPTION \"This Prid indicates the entry in dsMaxRateTable",
      "ja": "dsSchedulerMaxRateのOBJECT-TYPE SYNTAX PRIDステータス現在の説明は「このPRIDはdsMaxRateTableのエントリを示し、"
    },
    {
      "indent": 7,
      "text": "which indicates the maximum output rate from this scheduler.\nWhen more than one maximum rate applies (e.g., a multi-rate\nshaper is used), it points to the first of the rate entries.\nThis attribute is only used when there is more than one level\nof scheduler.",
      "raw": true
    },
    {
      "indent": 4,
      "text": "   When it has the value zeroDotZero, it indicates that no\n   Maximum rate is imposed.\"\n DEFVAL      { zeroDotZero }\n::= { dsSchedulerEntry 5 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "-- -- Minimum Rate Parameters Table -- -- The parameters used by a scheduler for its inputs or outputs are -- maintained separately from the Queue or Scheduler table entries -- for reusability reasons and so that they may be used by both -- queues and schedulers. This follows the approach for separation -- of data path elements from parameterization that is used -- throughout this PIB. -- Use of these Minimum Rate Parameter Table entries by Queues and -- Schedulers allows the modeling of hierarchical scheduling -- systems. -- -- Specifically, a Scheduler has one or more inputs and one output. -- Any queue feeding a scheduler, or any scheduler which feeds a -- second scheduler, might specify a minimum transfer rate by -- pointing to a Minimum Rate Parameter Table entry. -- -- The dsMinRatePriority/Absolute/Relative attributes are used as -- parameters to the work-conserving portion of a scheduler: -- \"work-conserving\" implies that the scheduler can continue to emit -- data as long as there is data available at its input(s). This -- has the effect of guaranteeing a certain priority relative to -- other scheduler inputs and/or a certain minimum proportion of the -- available output bandwidth. Properly configured, this means a -- certain minimum rate, which may be exceeded should traffic be -- available should there be spare bandwidth after all other classes -- have had opportunities to consume their own minimum rates. --",
      "ja": " -   - 最小レートパラメータ表 -   - その入力または出力のためにスケジューラによって使用されるパラメータはさ - キューまたはスケジューラ・テーブル・エントリは別に維持 - 再利用の理由で、それらは両方で使用することができるように -  - キューとスケジューラ。このPIB全体 - 使用されるパラメータからのデータパス要素の - これは、分離のためのアプローチに従います。 - キューとすることにより、これらの最小レートパラメータテーブルエントリの使用 - システム - スケジューラは、階層型スケジューリングのモデリングを可能にします。 -   - 具体的には、スケジューラは、1つまたは複数の入力と1つの出力を有しています。 - スケジューラを供給する任意のキュー、またはフィード任意スケジューラ - 最小レートパラメータテーブルエントリを指し示す - 第2のスケジューラは、によって最小転送レートを指定するかもしれません。 -   -  dsMinRatePriority /絶対/相対属性として使用されている - スケジューラの作業保存部へのパラメータ： - 「作業節約」はスケジューラが放出し続けることができることを意味する - データを限りがあるとしてその入力（S）で利用可能なデータ。これは、 - 他のスケジューラ入力及び/又は特定の最小割合 -   - 利用可能な出力帯域幅に特定の優先度の相対を保証する効果を有します。トラフィックがあるべき超過することができる特定の最小レート、 -   - 利用可能なすべての他のクラスの後に予備の帯域幅がなければならない - 適切に構成され、これは、自分自身の最小速度を消費する機会がありました。 - "
    },
    {
      "indent": 0,
      "text": "dsMinRateTable OBJECT-TYPE\n    SYNTAX       SEQUENCE OF DsMinRateEntry\n    PIB-ACCESS   install\n    STATUS       current\n    DESCRIPTION\n       \"The Minimum Rate Table enumerates individual\n       sets of scheduling parameter that can be used/reused by Queues and Schedulers.\"\n    ::= { dsPolicyClasses 13 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsMinRateEntry OBJECT-TYPE\n    SYNTAX       DsMinRateEntry\n    STATUS       current\n    DESCRIPTION\n       \"An entry in the Minimum Rate Table describes\n       a single set of scheduling parameter for use by\n       queues and schedulers.\"\n    PIB-INDEX { dsMinRatePrid }\n    UNIQUENESS { dsMinRatePriority,\n                 dsMinRateAbsolute,\n                 dsMinRateRelative }\n    ::= { dsMinRateTable 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "DsMinRateEntry ::= SEQUENCE  {\n    dsMinRatePrid            InstanceId,\n    dsMinRatePriority        Unsigned32,\n    dsMinRateAbsolute        Unsigned32,\n    dsMinRateRelative        Unsigned32\n}",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsMinRatePrid OBJECT-TYPE\n    SYNTAX       InstanceId\n    STATUS       current\n    DESCRIPTION\n        \"An arbitrary integer index that uniquely identifies an\n        instance of the class.\"\n    ::= { dsMinRateEntry 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsMinRatePriority OBJECT-TYPE\n    SYNTAX       Unsigned32 (1..4294967295)\n    STATUS       current\n    DESCRIPTION\n      \"The priority of this input to the associated scheduler,\n      relative to the scheduler's other inputs. Higher Priority\n      value indicates the associated queue/scheduler will get\n      service first before others with lower Priority values.\"\n    ::= { dsMinRateEntry 2 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsMinRateAbsolute OBJECT-TYPE SYNTAX Unsigned32 (1..4294967295) UNITS \"kilobits per second\" STATUS current DESCRIPTION \"The minimum absolute rate, in kilobits/sec, that a downstream scheduler element should allocate to this queue. If the value is zero, then there is effectively no minimum rate guarantee. If the value is non-zero, the scheduler will assure the servicing of this queue to at least this rate.",
      "ja": "dsMinRateAbsoluteのOBJECT-TYPE構文Unsigned32（1 4294967295）UNITS「はキロビット毎秒」ステータス現在の説明「キロビット/秒の最小絶対速度、下流スケジューラ要素は、このキューに割り当てる必要があること。値がゼロである場合、次いで最低帯域保証が効果的にありません。値がゼロでない場合、スケジューラは、少なくともこのレートにこのキューのサービスを保証します。"
    },
    {
      "indent": 6,
      "text": "Note that this attribute's value is coupled to that\nof dsMinRateRelative:  changes to one will affect the value\nof the other.",
      "raw": true
    },
    {
      "indent": 6,
      "text": "[IFMIB] defines ifSpeed as Gauge32 in units of bits per second, and ifHighSpeed as Gauge32 in units of 1,000,000 bits per second. This yields the following equations:",
      "ja": "【IFMIB】毎秒1,000,000ビット単位でのifSpeedは、毎秒ビット単位でGauge32として定義し、Gauge32としてifHighSpeed。これは、以下の式が得られます。"
    },
    {
      "indent": 6,
      "text": "RateRelative = [ (RateAbsolute * 1000) / ifSpeed ] * 1,000",
      "ja": "RateRelative = [（RateAbsolute * 1000）/のifSpeed] *千"
    },
    {
      "indent": 6,
      "text": "Where, 1000 is for converting kbps used by RateAbsolute to bps used by ifSpeed, 1,000 is for 'in units of 1/1,000 of 1' for RateRelative.",
      "ja": "1000のifSpeedによって使用bpsにRateAbsoluteで使用kbps単位を変換するためのものである場合、1000はRateRelativeための「1の1 / 1,000単位」のためのものです。"
    },
    {
      "indent": 6,
      "text": "or, if appropriate:",
      "ja": "または、適切な場合："
    },
    {
      "indent": 6,
      "text": "RateRelative = { [ (RateAbsolute * 1000) / 1,000,000 ] / ifHIghSpeed } * 1,000",
      "ja": "RateRelative = {[（RateAbsolute * 1000）/ 1,000,000] /} *千ifHIghSpeed"
    },
    {
      "indent": 4,
      "text": "  Where, 1000 and 1,000,000 is for converting kbps used by\n  RateAbsolute to 1 million bps used by ifHighSpeed, 1,000 is\n  for 'in units of 1/1,000 of 1' for RateRelative.\"\nREFERENCE\n    \"ifSpeed, ifHighSpeed from the IF-MIB, RFC 2863.\"\n::= { dsMinRateEntry 3 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsMinRateRelative OBJECT-TYPE SYNTAX Unsigned32 (1..4294967295) STATUS current DESCRIPTION \"The minimum rate that a downstream scheduler element should allocate to this queue, relative to the max-imum rate of the interface as reported by ifSpeed or ifHighSpeed, in units of 1/1,000 of 1. If the value is zero, then there is effectively no minimum rate guarantee. If the value is non-zero, the scheduler will assure the servicing of this queue to at least this rate.",
      "ja": "dsMinRateRelative OBJECT-TYPE構文Unsigned32（1 4294967295）STATUS現在の記述「のifSpeedまたはifHighSpeedによって報告されるダウンストリームスケジューラ要素が単位で、インタフェースのMAX-IMUMレートに対してこのキューに割り当てる必要があることを最小レート値がゼロである場合は1の1 / 1,000、次に有効最低レート保証はありません。値がゼロでない場合、スケジューラは、少なくともこの速度にこのキューのサービスを保証します。"
    },
    {
      "indent": 6,
      "text": "Note that this attribute's value is coupled to that\nof dsMinRateAbsolute:  changes to one will\naffect the value of the other.",
      "raw": true
    },
    {
      "indent": 6,
      "text": "[IFMIB] defines ifSpeed as Gauge32 in units of bits per second, and ifHighSpeed as Gauge32 in units of 1,000,000 bits per second. This yields the following equations:",
      "ja": "【IFMIB】毎秒1,000,000ビット単位でのifSpeedは、毎秒ビット単位でGauge32として定義し、Gauge32としてifHighSpeed。これは、以下の式が得られます。"
    },
    {
      "indent": 6,
      "text": "RateRelative = [ (RateAbsolute * 1000) / ifSpeed ] * 1,000",
      "ja": "RateRelative = [（RateAbsolute * 1000）/のifSpeed] *千"
    },
    {
      "indent": 6,
      "text": "Where, 1000 is for converting kbps used by RateAbsolute to bps used by ifSpeed, 1,000 is for 'in units of 1/1,000 of 1' for RateRelative.",
      "ja": "1000のifSpeedによって使用bpsにRateAbsoluteで使用kbps単位を変換するためのものである場合、1000はRateRelativeための「1の1 / 1,000単位」のためのものです。"
    },
    {
      "indent": 6,
      "text": "or, if appropriate:",
      "ja": "または、適切な場合："
    },
    {
      "indent": 6,
      "text": "RateRelative = { [ (RateAbsolute * 1000) / 1,000,000 ] / ifHIghSpeed } * 1,000",
      "ja": "RateRelative = {[（RateAbsolute * 1000）/ 1,000,000] /} *千ifHIghSpeed"
    },
    {
      "indent": 4,
      "text": "  Where, 1000 and 1,000,000 is for converting kbps used by\n  RateAbsolute to 1 million bps used by ifHighSpeed, 1,000 is\n  for 'in units of 1/1,000 of 1' for RateRelative.\"\nREFERENCE\n    \"ifSpeed, ifHighSpeed from the IF-MIB, RFC 2863.\"\n::= { dsMinRateEntry 4 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "-- -- Maximum Rate Parameters Table -- -- The parameters used by a scheduler for its inputs or outputs are -- maintained separately from the Queue or Scheduler table entries -- for reusability reasons and so that they may be used by both -- queues and schedulers. This follows the approach for separation -- of data path elements from parameterization that is used -- throughout this PIB. -- -- Use of these Maximum Rate Parameter Table entries by Queues and -- Schedulers allows the modeling of hierarchical scheduling -- systems. -- -- Specifically, a Scheduler has one or more inputs and one output. -- Any queue feeding a scheduler, or any scheduler which feeds a -- second scheduler, might specify a maximum transfer rate by -- pointing to a Maximum Rate Parameter Table entry. Multi-rate -- shapers, such as a Dual Leaky Bucket algorithm, specify their -- rates using multiple Maximum Rate Parameter Entries with the same -- dsMaxRateId but different dsMaxRateLevels. -- -- The dsMaxRateLevel/Absolute/Relative attributes are used as",
      "ja": " -   - 最大レートパラメータ表 -   - その入力または出力のためにスケジューラによって使用されるパラメータはさ - キューまたはスケジューラ・テーブル・エントリは別に維持 - 再利用の理由で、それらは両方で使用することができるように -  - キューとスケジューラ。このPIB全体 - 使用されるパラメータからのデータパス要素の - これは、分離のためのアプローチに従います。 -   - キューとすることにより、これらの最大速度パラメータテーブルエントリの使用 - システム - スケジューラは、階層型スケジューリングのモデリングを可能にします。 -   - 具体的には、スケジューラは、1つまたは複数の入力と1つの出力を有しています。 - スケジューラを供給する任意のキュー、またはフィード任意スケジューラ - 最大レートパラメータテーブルエントリを指し示す - 第2のスケジューラは、によって最大転送レートを指定するかもしれません。マルチレート -  dsMaxRateIdが異なるdsMaxRateLevels  - 同じで複数の最大速度パラメータのエントリを使用して宿泊料金 - このような二重リーキーバケットアルゴリズムとしてシェイパーは、自分を指定します。 -   -  dsMaxRateLevel /絶対/相対属性は次のように使用されています"
    },
    {
      "indent": 0,
      "text": "-- parameters to the non-work-conserving portion of a scheduler: -- non-work-conserving implies that the scheduler may sometimes not -- emit a packet, even if there is data available at its input(s). -- This has the effect of limiting the servicing of the -- queue/scheduler input or output, in effect performing shaping of -- the packet stream passing through the queue/scheduler, as -- described in the Informal Differentiated Services Model -- section 7.2. --",
      "ja": " - スケジューラの非作業保存部へのパラメータ： - その入力（S）で利用可能なデータがあっても、パケットを発する - 非作業保存は、スケジューラが時々ないかもしれないことを意味します。 - 非公式差別化サービスモデルで記述 - として、キュー/スケジューラを通過するパケットストリーム - の整形を行う効果は、キュー/スケジューラ入力または出力 - これは、サービスを制限する効果を有します - セクション7.2。 - "
    },
    {
      "indent": 0,
      "text": "dsMaxRateTable OBJECT-TYPE\n    SYNTAX       SEQUENCE OF DsMaxRateEntry\n    PIB-ACCESS   install\n    STATUS       current\n    DESCRIPTION\n       \"The Maximum Rate Table enumerates individual\n       sets of scheduling parameter that can be used/reused\n       by Queues and Schedulers.\"\n    ::= { dsPolicyClasses 14 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsMaxRateEntry OBJECT-TYPE\n    SYNTAX       DsMaxRateEntry\n    STATUS       current\n    DESCRIPTION\n       \"An entry in the Maximum Rate Table describes\n       a single set of scheduling parameter for use by\n       queues and schedulers.\"\n    PIB-INDEX { dsMaxRatePrid }\n    UNIQUENESS { dsMaxRateId,\n                 dsMaxRateLevel,\n                 dsMaxRateAbsolute,\n                 dsMaxRateRelative,\n                 dsMaxRateThreshold }\n    ::= { dsMaxRateTable 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "DsMaxRateEntry ::= SEQUENCE  {\n    dsMaxRatePrid            InstanceId,\n    dsMaxRateId              Unsigned32,\n    dsMaxRateLevel           Unsigned32,\n    dsMaxRateAbsolute        Unsigned32,\n    dsMaxRateRelative        Unsigned32,\n    dsMaxRateThreshold       BurstSize\n}",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsMaxRatePrid OBJECT-TYPE SYNTAX InstanceId STATUS current DESCRIPTION",
      "ja": "dsMaxRatePrid OBJECT-TYPE SYNTAXのInstanceIdステータス現在の説明"
    },
    {
      "indent": 4,
      "text": "    \"An arbitrary integer index that uniquely identifies an\n    instance of the class.\"\n::= { dsMaxRateEntry 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsMaxRateId OBJECT-TYPE\n    SYNTAX       Unsigned32  (0..4294967295)\n    STATUS       current\n    DESCRIPTION\n      \"An identifier used together with dsMaxRateLevel for\n      representing a multi-rate shaper.  This attribute is used for\n      associating all the rate attributes of a multi-rate shaper.\n      Each dsMaxRateEntry of a multi-rate shaper must have the same\n      value in this attribute.  The different rates of a multi-rate\n      shaper is identified using dsMaxRateLevel.\n      This attribute uses the value of zero to indicate this\n      attribute is not used, for single rate shaper.\"\n    DEFVAL { 0 }\n    ::= { dsMaxRateEntry 2 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsMaxRateLevel OBJECT-TYPE\n    SYNTAX       Unsigned32 (1..32)\n    STATUS       current\n    DESCRIPTION\n      \"An index that indicates which level of a multi-rate shaper is\n      being given its parameters. A multi-rate shaper has some\n      number of rate levels. Frame Relay's dual rate specification\n      refers to a 'committed' and an 'excess' rate; ATM's dual rate\n      specification refers to a 'mean' and a 'peak' rate. This table\n      is generalized to support an arbitrary number of rates. The\n      committed or mean rate is level 1, the peak rate (if any) is\n      the highest level rate configured, and if there are other\n      rates they are distributed in monotonically increasing order\n      between them.\n      When the entry is used for a single rate shaper, this\n      attribute contains a value of one.\"\n    DEFVAL { 1 }\n    ::= { dsMaxRateEntry 3 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsMaxRateAbsolute OBJECT-TYPE SYNTAX Unsigned32 (1..4294967295) UNITS \"kilobits per second\" STATUS current DESCRIPTION \"The maximum rate in kilobits/sec that a downstream scheduler element should allocate to this queue. If the value is zero, then there is effectively no max-imum rate limit and that the scheduler should attempt to be work-conserving for this queue. If the value is non-zero, the scheduler will limit the servicing of this queue to, at most, this rate in a non-work-conserving manner.",
      "ja": "下流スケジューラ要素がこのキューに割り当てる必要があること。値がゼロの場合dsMaxRateAbsoluteのOBJECT-TYPEの構文Unsigned32 STATUS現在の記述（1 4294967295）UNITS「毎秒キロビット」「キロビット/秒の最大速度は、次いで、効果的がありますノーMAX-IMUMレート制限およびスケジューラは作業保存このキューのためであることを試みなければならない。値がゼロでない場合、スケジューラは、非作業で、最大で、この割合をこのキューのサービスを制限すること-conserving方法。"
    },
    {
      "indent": 6,
      "text": "Note that this attribute's value is coupled to that\nof dsMaxRateRelative:  changes to one will\naffect the value of the other.",
      "raw": true
    },
    {
      "indent": 6,
      "text": "[IFMIB] defines ifSpeed as Gauge32 in units of bits per second, and ifHighSpeed as Gauge32 in units of 1,000,000 bits per second. This yields the following equations:",
      "ja": "【IFMIB】毎秒1,000,000ビット単位でのifSpeedは、毎秒ビット単位でGauge32として定義し、Gauge32としてifHighSpeed。これは、以下の式が得られます。"
    },
    {
      "indent": 6,
      "text": "RateRelative = [ (RateAbsolute * 1000) / ifSpeed ] * 1,000",
      "ja": "RateRelative = [（RateAbsolute * 1000）/のifSpeed] *千"
    },
    {
      "indent": 6,
      "text": "Where, 1000 is for converting kbps used by RateAbsolute to bps used by ifSpeed, 1,000 is for 'in units of 1/1,000 of 1' for RateRelative.",
      "ja": "1000のifSpeedによって使用bpsにRateAbsoluteで使用kbps単位を変換するためのものである場合、1000はRateRelativeための「1の1 / 1,000単位」のためのものです。"
    },
    {
      "indent": 6,
      "text": "or, if appropriate:",
      "ja": "または、適切な場合："
    },
    {
      "indent": 6,
      "text": "RateRelative = { [ (RateAbsolute * 1000) / 1,000,000 ] / ifHIghSpeed } * 1,000",
      "ja": "RateRelative = {[（RateAbsolute * 1000）/ 1,000,000] /} *千ifHIghSpeed"
    },
    {
      "indent": 4,
      "text": "  Where, 1000 and 1,000,000 is for converting kbps used by\n  RateAbsolute to 1 million bps used by ifHighSpeed, 1,000 is\n  for 'in units of 1/1,000 of 1' for RateRelative.\"\n::= { dsMaxRateEntry 4 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsMaxRateRelative OBJECT-TYPE SYNTAX Unsigned32 (1..4294967295) STATUS current DESCRIPTION \"The maximum rate that a downstream scheduler element should allocate to this queue, relative to the max-imum rate of the interface as reported by ifSpeed or ifHighSpeed, in units of 1/1,000 of 1. If the value is zero, then there is effectively no maximum rate limit and the scheduler should attempt to be work-conserving for this queue. If the value is non-zero, the scheduler will limit the servicing of this queue to, at most, this rate in a non-work-conserving manner.",
      "ja": "dsMaxRateRelative OBJECT-TYPE構文Unsigned32（1 4294967295）STATUS現在の記述「のifSpeedまたはifHighSpeedによって報告されるダウンストリームスケジューラ要素が単位で、インターフェースの最大速度に対して、このキューに割り当てる必要があることを最大速度値がゼロである場合は1の1 / 1,000、次に有効全く最大レート制限がないとスケジューラーがワーク節約このキューにあることを試みるべきである。値がゼロでない場合、スケジューラは、このサービスを制限しますキューイングし、最大で、非作業保存方法でこの割合。"
    },
    {
      "indent": 6,
      "text": "Note that this attribute's value is coupled to that\nof dsMaxRateAbsolute:  changes to one will\naffect the value of the other.",
      "raw": true
    },
    {
      "indent": 6,
      "text": "[IFMIB] defines ifSpeed as Gauge32 in units of bits per second, and ifHighSpeed as Gauge32 in units of 1,000,000 bits per second. This yields the following equations:",
      "ja": "【IFMIB】毎秒1,000,000ビット単位でのifSpeedは、毎秒ビット単位でGauge32として定義し、Gauge32としてifHighSpeed。これは、以下の式が得られます。"
    },
    {
      "indent": 6,
      "text": "RateRelative = [ (RateAbsolute * 1000) / ifSpeed ] * 1,000",
      "ja": "RateRelative = [（RateAbsolute * 1000）/のifSpeed] *千"
    },
    {
      "indent": 6,
      "text": "Where, 1000 is for converting kbps used by RateAbsolute to bps used by ifSpeed, 1,000 is for 'in units of 1/1,000 of 1' for RateRelative.",
      "ja": "1000のifSpeedによって使用bpsにRateAbsoluteで使用kbps単位を変換するためのものである場合、1000はRateRelativeための「1の1 / 1,000単位」のためのものです。"
    },
    {
      "indent": 6,
      "text": "or, if appropriate:",
      "ja": "または、適切な場合："
    },
    {
      "indent": 6,
      "text": "RateRelative = { [ (RateAbsolute * 1000) / 1,000,000 ] / ifHIghSpeed } * 1,000",
      "ja": "RateRelative = {[（RateAbsolute * 1000）/ 1,000,000] /} *千ifHIghSpeed"
    },
    {
      "indent": 4,
      "text": "  Where, 1000 and 1,000,000 is for converting kbps used by\n  RateAbsolute to 1 million bps used by ifHighSpeed, 1,000 is\n  for 'in units of 1/1,000 of 1' for RateRelative.\"\nREFERENCE\n    \"ifSpeed, ifHighSpeed from the IF-MIB, RFC 2863.\"\n::= { dsMaxRateEntry 5 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsMaxRateThreshold OBJECT-TYPE\n    SYNTAX       BurstSize\n    UNITS        \"Bytes\"\n    STATUS       current\n    DESCRIPTION\n      \"The number of bytes of queue depth at which the rate of a\n      multi-rate scheduler will increase to the next output rate. In\n      the last PRI for such a shaper, this threshold is\n      ignored and by convention is zero.\"\n    REFERENCE\n        \"Adaptive Rate Shaper, RFC 2963\"\n ::= { dsMaxRateEntry 6 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "-- -- Conformance Section --",
      "ja": " -   - 適合セクション - "
    },
    {
      "indent": 0,
      "text": "dsPolicyPibCompliances\n                OBJECT IDENTIFIER ::= { dsPolicyPibConformance 1 }\ndsPolicyPibGroups\n                OBJECT IDENTIFIER ::= { dsPolicyPibConformance 2 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsPolicyPibCompliance MODULE-COMPLIANCE",
      "ja": "dsPolicyPibComplianceのMODULE-コンプライアンス"
    },
    {
      "indent": 4,
      "text": "STATUS  current\nDESCRIPTION\n        \"Describes the requirements for conformance to the\n        QoS Policy PIB.\"",
      "raw": true
    },
    {
      "indent": 4,
      "text": "MODULE FRAMEWORK-PIB MANDATORY-GROUPS { frwkPrcSupportGroup, frwkPibIncarnationGroup, frwkDeviceIdGroup, frwkCompLimitsGroup, frwkCapabilitySetGroup, frwkRoleComboGroup, frwkIfRoleComboGroup, frwkBaseFilterGroup, frwkIpFilterGroup }",
      "ja": "MODULEのFRAMEWORK-PIB MANDATORY-GROUPS {frwkPrcSupportGroup、frwkPibIncarnationGroup、frwkDeviceIdGroup、frwkCompLimitsGroup、frwkCapabilitySetGroup、frwkRoleComboGroup、frwkIfRoleComboGroup、frwkBaseFilterGroup、frwkIpFilterGroup}"
    },
    {
      "indent": 4,
      "text": "OBJECT frwkPibIncarnationLongevity PIB-MIN-ACCESS notify DESCRIPTION \"Install support is required if policy expiration is to be supported.\"",
      "ja": "OBJECT frwkPibIncarnationLongevity PIB-MIN-ACCESS説明は「政策の有効期限がサポートされる場合、サポートが必要なインストールします。」を通知"
    },
    {
      "indent": 4,
      "text": "OBJECT frwkPibIncarnationTtl PIB-MIN-ACCESS notify DESCRIPTION \"Install support is required if policy expiration is to be supported.\"",
      "ja": "OBJECT frwkPibIncarnationTtl PIB-MIN-ACCESS説明は「政策の有効期限がサポートされる場合、サポートが必要なインストールします。」を通知"
    },
    {
      "indent": 4,
      "text": "MODULE DIFFSERV-PIB -- this module MANDATORY-GROUPS { dsPibBaseIfCapsGroup, dsPibIfClassificationCapsGroup, dsPibIfAlgDropCapsGroup, dsPibIfQueueCapsGroup, dsPibIfSchedulerCapsGroup, dsPibIfMaxRateCapsGroup, dsPibIfElmDepthCapsGroup, dsPibIfElmLinkCapsGroup, dsPibDataPathGroup, dsPibClfrGroup, dsPibClfrElementGroup, dsPibActionGroup, dsPibAlgDropGroup, dsPibQGroup, dsPibSchedulerGroup, dsPibMinRateGroup, dsPibMaxRateGroup }",
      "ja": "MODULE DIFFSERV-PIB  - このモジュールMANDATORY-GROUPS {dsPibBaseIfCapsGroup、dsPibIfClassificationCapsGroup、dsPibIfAlgDropCapsGroup、dsPibIfQueueCapsGroup、dsPibIfSchedulerCapsGroup、dsPibIfMaxRateCapsGroup、dsPibIfElmDepthCapsGroup、dsPibIfElmLinkCapsGroup、dsPibDataPathGroup、dsPibClfrGroup、dsPibClfrElementGroup、dsPibActionGroup、dsPibAlgDropGroup、dsPibQGroup、dsPibSchedulerGroup、dsPibMinRateGroup、dsPibMaxRateGroup}"
    },
    {
      "indent": 4,
      "text": "GROUP dsPibIfMeteringCapsGroup DESCRIPTION \"This group is mandatory for devices that implement metering functions.\"",
      "ja": "GROUP dsPibIfMeteringCapsGroup DESCRIPTION「このグループは計量機能を実装するデバイスのために必須です。」"
    },
    {
      "indent": 4,
      "text": "GROUP dsPibMeterGroup DESCRIPTION \"This group is mandatory for devices that implement metering functions.\"",
      "ja": "GROUP dsPibMeterGroup DESCRIPTION「このグループは計量機能を実装するデバイスのために必須です。」"
    },
    {
      "indent": 4,
      "text": "GROUP dsPibTBParamGroup DESCRIPTION \"This group is mandatory for devices that implement token-bucket metering functions.\"",
      "ja": "GROUP dsPibTBParamGroup説明は「このグループは、トークンバケットメータリング機能を実装するデバイスのために必須です。」"
    },
    {
      "indent": 4,
      "text": "GROUP dsPibDscpMarkActGroup DESCRIPTION \"This group is mandatory for devices that implement DSCP-Marking functions.\"",
      "ja": "GROUP dsPibDscpMarkActGroup DESCRIPTION「このグループはDSCPマーキング機能を実装するデバイスのために必須です。」"
    },
    {
      "indent": 4,
      "text": "GROUP dsPibMQAlgDropGroup DESCRIPTION \"This group is mandatory for devices that implement Multiple Queue Measured Algorithmic Drop functions.\"",
      "ja": "GROUP dsPibMQAlgDropGroup DESCRIPTION「このグループは複数のキュー測定アルゴリズムドロップ機能を実装するデバイスのために必須です。」"
    },
    {
      "indent": 4,
      "text": "GROUP dsPibRandomDropGroup DESCRIPTION \"This group is mandatory for devices that implement Random Drop functions.\"",
      "ja": "GROUP dsPibRandomDropGroup DESCRIPTION「このグループはランダムドロップ機能を実装するデバイスのために必須です。」"
    },
    {
      "indent": 4,
      "text": "OBJECT dsClfrId PIB-MIN-ACCESS not-accessible DESCRIPTION \"Install support is not required.\"",
      "ja": "OBJECT dsClfrId PIB-MIN-ACCESSアクセス不可能な説明は \"支援が必要とされていませんインストールします。\""
    },
    {
      "indent": 4,
      "text": "OBJECT dsClfrElementClfrId PIB-MIN-ACCESS not-accessible DESCRIPTION \"Install support is not required.\"",
      "ja": "OBJECT dsClfrElementClfrId PIB-MIN-ACCESSアクセス不可能な説明は \"支援が必要とされていませんインストールします。\""
    },
    {
      "indent": 4,
      "text": "OBJECT dsClfrElementPrecedence PIB-MIN-ACCESS not-accessible DESCRIPTION \"Install support is not required.\"",
      "ja": "OBJECT dsClfrElementPrecedence PIB-MIN-ACCESSアクセス不可能な説明は \"支援が必要とされていませんインストールします。\""
    },
    {
      "indent": 4,
      "text": "OBJECT dsClfrElementNext PIB-MIN-ACCESS not-accessible",
      "ja": "OBJECT dsClfrElementNext PIB-MIN-ACCESSアクセス不可能"
    },
    {
      "indent": 4,
      "text": "DESCRIPTION \"Install support is not required.\"",
      "ja": "DESCRIPTION「インストールサポートは必要ありません。」"
    },
    {
      "indent": 4,
      "text": "OBJECT dsClfrElementSpecific PIB-MIN-ACCESS not-accessible DESCRIPTION \"Install support is not required.\"",
      "ja": "OBJECT dsClfrElementSpecific PIB-MIN-ACCESSアクセス不可能な説明は \"支援が必要とされていませんインストールします。\""
    },
    {
      "indent": 4,
      "text": "OBJECT dsMeterSucceedNext PIB-MIN-ACCESS not-accessible DESCRIPTION \"Install support is not required.\"",
      "ja": "OBJECT dsMeterSucceedNext PIB-MIN-ACCESSアクセス不可能な説明は \"支援が必要とされていませんインストールします。\""
    },
    {
      "indent": 4,
      "text": "OBJECT dsMeterFailNext PIB-MIN-ACCESS not-accessible DESCRIPTION \"Install support is not required.\"",
      "ja": "OBJECT dsMeterFailNext PIB-MIN-ACCESSアクセス不可能な説明は \"支援が必要とされていませんインストールします。\""
    },
    {
      "indent": 4,
      "text": "OBJECT dsMeterSpecific PIB-MIN-ACCESS not-accessible DESCRIPTION \"Install support is not required.\"",
      "ja": "OBJECT dsMeterSpecific PIB-MIN-ACCESSアクセス不可能な説明は \"支援が必要とされていませんインストールします。\""
    },
    {
      "indent": 4,
      "text": "OBJECT dsTBParamType PIB-MIN-ACCESS not-accessible DESCRIPTION \"Install support is not required.\"",
      "ja": "OBJECT dsTBParamType PIB-MIN-ACCESSアクセス不可能な説明は \"支援が必要とされていませんインストールします。\""
    },
    {
      "indent": 4,
      "text": "OBJECT dsTBParamRate PIB-MIN-ACCESS not-accessible DESCRIPTION \"Install support is not required.\"",
      "ja": "OBJECT dsTBParamRate PIB-MIN-ACCESSアクセス不可能な説明は \"支援が必要とされていませんインストールします。\""
    },
    {
      "indent": 4,
      "text": "OBJECT dsTBParamBurstSize PIB-MIN-ACCESS not-accessible DESCRIPTION \"Install support is not required.\"",
      "ja": "OBJECT dsTBParamBurstSize PIB-MIN-ACCESSアクセス不可能な説明は \"支援が必要とされていませんインストールします。\""
    },
    {
      "indent": 4,
      "text": "OBJECT dsTBParamInterval PIB-MIN-ACCESS not-accessible DESCRIPTION \"Install support is not required.\"",
      "ja": "OBJECT dsTBParamInterval PIB-MIN-ACCESSアクセス不可能な説明は \"支援が必要とされていませんインストールします。\""
    },
    {
      "indent": 4,
      "text": "OBJECT dsActionNext PIB-MIN-ACCESS not-accessible DESCRIPTION \"Install support is not required.\"",
      "ja": "OBJECT dsActionNext PIB-MIN-ACCESSアクセス不可能な説明は \"支援が必要とされていませんインストールします。\""
    },
    {
      "indent": 4,
      "text": "OBJECT dsActionSpecific PIB-MIN-ACCESS not-accessible DESCRIPTION \"Install support is not required.\"",
      "ja": "OBJECT dsActionSpecific PIB-MIN-ACCESSアクセス不可能な説明は \"支援が必要とされていませんインストールします。\""
    },
    {
      "indent": 4,
      "text": "OBJECT dsAlgDropType PIB-MIN-ACCESS not-accessible DESCRIPTION \"Install support is not required.\"",
      "ja": "OBJECT dsAlgDropType PIB-MIN-ACCESSアクセス不可能な説明は \"支援が必要とされていませんインストールします。\""
    },
    {
      "indent": 4,
      "text": "OBJECT dsAlgDropNext PIB-MIN-ACCESS not-accessible DESCRIPTION \"Install support is not required.\"",
      "ja": "OBJECT dsAlgDropNext PIB-MIN-ACCESSアクセス不可能な説明は \"支援が必要とされていませんインストールします。\""
    },
    {
      "indent": 4,
      "text": "OBJECT dsAlgDropQMeasure PIB-MIN-ACCESS not-accessible DESCRIPTION \"Install support is not required.\"",
      "ja": "OBJECT dsAlgDropQMeasure PIB-MIN-ACCESSアクセス不可能な説明は \"支援が必要とされていませんインストールします。\""
    },
    {
      "indent": 4,
      "text": "OBJECT dsAlgDropQThreshold PIB-MIN-ACCESS not-accessible DESCRIPTION \"Install support is not required.\"",
      "ja": "OBJECT dsAlgDropQThreshold PIB-MIN-ACCESSアクセス不可能な説明は \"支援が必要とされていませんインストールします。\""
    },
    {
      "indent": 4,
      "text": "OBJECT dsAlgDropSpecific PIB-MIN-ACCESS not-accessible DESCRIPTION \"Install support is not required.\"",
      "ja": "OBJECT dsAlgDropSpecific PIB-MIN-ACCESSアクセス不可能な説明は \"支援が必要とされていませんインストールします。\""
    },
    {
      "indent": 4,
      "text": "OBJECT dsRandomDropMinThreshBytes PIB-MIN-ACCESS not-accessible DESCRIPTION \"Install support is not required.\"",
      "ja": "OBJECT dsRandomDropMinThreshBytes PIB-MIN-ACCESSアクセス不可能な説明は \"支援が必要とされていませんインストールします。\""
    },
    {
      "indent": 4,
      "text": "OBJECT dsRandomDropMinThreshPkts PIB-MIN-ACCESS not-accessible DESCRIPTION \"Install support is not required.\"",
      "ja": "OBJECT dsRandomDropMinThreshPkts PIB-MIN-ACCESSアクセス不可能な説明は \"支援が必要とされていませんインストールします。\""
    },
    {
      "indent": 4,
      "text": "OBJECT dsRandomDropMaxThreshBytes PIB-MIN-ACCESS not-accessible DESCRIPTION \"Install support is not required.\"",
      "ja": "OBJECT dsRandomDropMaxThreshBytes PIB-MIN-ACCESSアクセス不可能な説明は \"支援が必要とされていませんインストールします。\""
    },
    {
      "indent": 4,
      "text": "OBJECT dsRandomDropMaxThreshPkts PIB-MIN-ACCESS not-accessible DESCRIPTION",
      "ja": "OBJECT dsRandomDropMaxThreshPkts PIB-MIN-ACCESSアクセス不可能な説明"
    },
    {
      "indent": 7,
      "text": "\"Install support is not required.\"",
      "ja": "「インストールサポートは必要ありません。」"
    },
    {
      "indent": 4,
      "text": "OBJECT dsRandomDropProbMax PIB-MIN-ACCESS not-accessible DESCRIPTION \"Install support is not required.\"",
      "ja": "OBJECT dsRandomDropProbMax PIB-MIN-ACCESSアクセス不可能な説明は \"支援が必要とされていませんインストールします。\""
    },
    {
      "indent": 4,
      "text": "OBJECT dsRandomDropWeight PIB-MIN-ACCESS not-accessible DESCRIPTION \"Install support is not required.\"",
      "ja": "OBJECT dsRandomDropWeight PIB-MIN-ACCESSアクセス不可能な説明は \"支援が必要とされていませんインストールします。\""
    },
    {
      "indent": 4,
      "text": "OBJECT dsRandomDropSamplingRate PIB-MIN-ACCESS not-accessible DESCRIPTION \"Install support is not required.\"",
      "ja": "OBJECT dsRandomDropSamplingRate PIB-MIN-ACCESSアクセス不可能な説明は \"支援が必要とされていませんインストールします。\""
    },
    {
      "indent": 4,
      "text": "OBJECT dsQNext PIB-MIN-ACCESS not-accessible DESCRIPTION \"Install support is not required.\"",
      "ja": "OBJECT dsQNext PIB-MIN-ACCESSアクセス不可能な説明は \"支援が必要とされていませんインストールします。\""
    },
    {
      "indent": 4,
      "text": "OBJECT dsQMinRate PIB-MIN-ACCESS not-accessible DESCRIPTION \"Install support is not required.\"",
      "ja": "OBJECT dsQMinRate PIB-MIN-ACCESSアクセス不可能な説明は \"支援が必要とされていませんインストールします。\""
    },
    {
      "indent": 4,
      "text": "OBJECT dsQMaxRate PIB-MIN-ACCESS not-accessible DESCRIPTION \"Install support is not required.\"",
      "ja": "OBJECT dsQMaxRate PIB-MIN-ACCESSアクセス不可能な説明は \"支援が必要とされていませんインストールします。\""
    },
    {
      "indent": 4,
      "text": "OBJECT dsSchedulerNext PIB-MIN-ACCESS not-accessible DESCRIPTION \"Install support is not required.\"",
      "ja": "OBJECT dsSchedulerNext PIB-MIN-ACCESSアクセス不可能な説明は \"支援が必要とされていませんインストールします。\""
    },
    {
      "indent": 4,
      "text": "OBJECT dsSchedulerMethod PIB-MIN-ACCESS not-accessible DESCRIPTION \"Install support is not required.\"",
      "ja": "OBJECT dsSchedulerMethod PIB-MIN-ACCESSアクセス不可能な説明は \"支援が必要とされていませんインストールします。\""
    },
    {
      "indent": 4,
      "text": "OBJECT dsSchedulerMinRate PIB-MIN-ACCESS not-accessible DESCRIPTION \"Install support is not required.\"",
      "ja": "OBJECT dsSchedulerMinRate PIB-MIN-ACCESSアクセス不可能な説明は \"支援が必要とされていませんインストールします。\""
    },
    {
      "indent": 4,
      "text": "OBJECT dsSchedulerMaxRate",
      "ja": "OBJECTのdsSchedulerMaxRate"
    },
    {
      "indent": 4,
      "text": "PIB-MIN-ACCESS not-accessible DESCRIPTION \"Install support is not required.\"",
      "ja": "PIB-MIN-ACCESSアクセス不可能な説明は「サポートをインストールする必要はありません。」"
    },
    {
      "indent": 4,
      "text": "OBJECT dsMinRatePriority PIB-MIN-ACCESS not-accessible DESCRIPTION \"Install support is not required.\"",
      "ja": "OBJECT dsMinRatePriority PIB-MIN-ACCESSアクセス不可能な説明は \"支援が必要とされていませんインストールします。\""
    },
    {
      "indent": 4,
      "text": "OBJECT dsMinRateAbsolute PIB-MIN-ACCESS not-accessible DESCRIPTION \"Install support is not required.\"",
      "ja": "OBJECT dsMinRateAbsolute PIB-MIN-ACCESSアクセス不可能な説明は \"支援が必要とされていませんインストールします。\""
    },
    {
      "indent": 4,
      "text": "OBJECT dsMinRateRelative PIB-MIN-ACCESS not-accessible DESCRIPTION \"Install support is not required.\"",
      "ja": "OBJECT dsMinRateRelative PIB-MIN-ACCESSアクセス不可能な説明は \"支援が必要とされていませんインストールします。\""
    },
    {
      "indent": 4,
      "text": "OBJECT dsMaxRateId PIB-MIN-ACCESS not-accessible DESCRIPTION \"Install support is not required.\"",
      "ja": "OBJECT dsMaxRateId PIB-MIN-ACCESSアクセス不可能な説明は \"支援が必要とされていませんインストールします。\""
    },
    {
      "indent": 4,
      "text": "OBJECT dsMaxRateLevel PIB-MIN-ACCESS not-accessible DESCRIPTION \"Install support is not required.\"",
      "ja": "OBJECT dsMaxRateLevel PIB-MIN-ACCESSアクセス不可能な説明は \"支援が必要とされていませんインストールします。\""
    },
    {
      "indent": 4,
      "text": "OBJECT dsMaxRateAbsolute PIB-MIN-ACCESS not-accessible DESCRIPTION \"Install support is not required.\"",
      "ja": "OBJECT dsMaxRateAbsolute PIB-MIN-ACCESSアクセス不可能な説明は \"支援が必要とされていませんインストールします。\""
    },
    {
      "indent": 4,
      "text": "OBJECT dsMaxRateRelative PIB-MIN-ACCESS not-accessible DESCRIPTION \"Install support is not required.\"",
      "ja": "OBJECT dsMaxRateRelative PIB-MIN-ACCESSアクセス不可能な説明は \"支援が必要とされていませんインストールします。\""
    },
    {
      "indent": 4,
      "text": "OBJECT dsMaxRateThreshold PIB-MIN-ACCESS not-accessible DESCRIPTION \"Install support is not required.\"",
      "ja": "OBJECT dsMaxRateThreshold PIB-MIN-ACCESSアクセス不可能な説明は \"支援が必要とされていませんインストールします。\""
    },
    {
      "indent": 4,
      "text": "::= { dsPolicyPibCompliances 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsPibBaseIfCapsGroup OBJECT-GROUP OBJECTS {",
      "ja": "dsPibBaseIfCapsGroupオブジェクト・グループオブジェクト{"
    },
    {
      "indent": 4,
      "text": "    dsBaseIfCapsPrid, dsBaseIfCapsDirection\n}\nSTATUS current\nDESCRIPTION\n   \"The Base Interface Capability Group defines the PIB\n   Objects that describe the base for interface capabilities.\"\n::= { dsPolicyPibGroups 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsPibIfClassificationCapsGroup OBJECT-GROUP\n    OBJECTS {\n        dsIfClassificationCapsSpec\n    }\n    STATUS current\n    DESCRIPTION\n       \"The Classification Capability Group defines the PIB\n       Objects that describe the classification capabilities.\"\n    ::= { dsPolicyPibGroups 2 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsPibIfMeteringCapsGroup OBJECT-GROUP\n    OBJECTS {\n        dsIfMeteringCapsSpec\n    }\n    STATUS current\n    DESCRIPTION\n       \"The Metering Capability Group defines the PIB\n       Objects that describe the metering capabilities.\"\n    ::= { dsPolicyPibGroups 3 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsPibIfAlgDropCapsGroup OBJECT-GROUP\n    OBJECTS {\n        dsIfAlgDropCapsType, dsIfAlgDropCapsMQCount\n    }\n    STATUS current\n    DESCRIPTION\n       \"The Algorithmic Dropper Capability Group defines the\n       PIB Objects that describe the algorithmic dropper\n       capabilities.\"\n    ::= { dsPolicyPibGroups 4 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsPibIfQueueCapsGroup OBJECT-GROUP OBJECTS { dsIfQueueCapsMinQueueSize, dsIfQueueCapsMaxQueueSize, dsIfQueueCapsTotalQueueSize } STATUS current DESCRIPTION \"The Queueing Capability Group defines the PIB Objects that describe the queueing capabilities.\"",
      "ja": "dsPibIfQueueCapsGroupオブジェクト・グループオブジェクト{dsIfQueueCapsMinQueueSize、dsIfQueueCapsMaxQueueSize、dsIfQueueCapsTotalQueueSize}ステータス現在の説明「キューイング機能グループがキューイング機能を記述するPIBオブジェクトを定義します。」"
    },
    {
      "indent": 4,
      "text": "::= { dsPolicyPibGroups 5 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsPibIfSchedulerCapsGroup OBJECT-GROUP\n    OBJECTS {\n        dsIfSchedulerCapsServiceDisc, dsIfSchedulerCapsMaxInputs,\n        dsIfSchedulerCapsMinMaxRate\n    }\n    STATUS current\n    DESCRIPTION\n       \"The Scheduler Capability Group defines the PIB\n       Objects that describe the scheduler capabilities.\"\n    ::= { dsPolicyPibGroups 6 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsPibIfMaxRateCapsGroup OBJECT-GROUP\n    OBJECTS {\n        dsIfMaxRateCapsMaxLevels\n    }\n    STATUS current\n    DESCRIPTION\n       \"The Max Rate Capability Group defines the PIB\n       Objects that describe the max rate capabilities.\"\n    ::= { dsPolicyPibGroups 7 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsPibIfElmDepthCapsGroup OBJECT-GROUP\n    OBJECTS {\n        dsIfElmDepthCapsPrc, dsIfElmDepthCapsCascadeMax\n    }\n    STATUS current\n    DESCRIPTION\n       \"The DataPath Element Depth Capability Group defines the PIB\n       Objects that describe the datapath element depth\n       capabilities.\"\n    ::= { dsPolicyPibGroups 8 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsPibIfElmLinkCapsGroup OBJECT-GROUP\n    OBJECTS {\n        dsIfElmLinkCapsPrc, dsIfElmLinkCapsAttr,\n        dsIfElmLinkCapsNextPrc\n    }\n    STATUS current\n    DESCRIPTION\n       \"The DataPath Element Linkage Capability Group defines the\n       PIB Objects that describe the datapath element linkage\n       capabilities.\"\n    ::= { dsPolicyPibGroups 9 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsPibDataPathGroup OBJECT-GROUP OBJECTS {",
      "ja": "dsPibDataPathGroupオブジェクト・グループオブジェクト{"
    },
    {
      "indent": 4,
      "text": "    dsDataPathPrid, dsDataPathCapSetName,\n    dsDataPathRoles, dsDataPathIfDirection,\n    dsDataPathStart\n}\nSTATUS current\nDESCRIPTION\n   \"The Data Path Group defines the PIB Objects that\n   describe a data path.\"\n::= { dsPolicyPibGroups 10 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsPibClfrGroup OBJECT-GROUP\n    OBJECTS {\n        dsClfrPrid, dsClfrId\n    }\n    STATUS current\n    DESCRIPTION\n       \"The Classifier Group defines the PIB Objects that\n       describe a generic classifier.\"\n    ::= { dsPolicyPibGroups 11 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsPibClfrElementGroup OBJECT-GROUP\n    OBJECTS {\n        dsClfrElementPrid, dsClfrElementClfrId,\n        dsClfrElementPrecedence, dsClfrElementNext,\n        dsClfrElementSpecific\n    }\n    STATUS current\n    DESCRIPTION\n       \"The Classifier Group defines the PIB Objects that\n       describe a generic classifier.\"\n    ::= { dsPolicyPibGroups 12 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsPibMeterGroup OBJECT-GROUP\n    OBJECTS {\n        dsMeterPrid, dsMeterSucceedNext,\n        dsMeterFailNext, dsMeterSpecific\n    }\n    STATUS current\n    DESCRIPTION\n       \"The Meter Group defines the objects used in describ-\n       ing a generic meter element.\"\n    ::= { dsPolicyPibGroups 13 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsPibTBParamGroup OBJECT-GROUP OBJECTS { dsTBParamPrid, dsTBParamType, dsTBParamRate, dsTBParamBurstSize, dsTBParamInterval }",
      "ja": "dsPibTBParamGroupオブジェクト・グループオブジェクト{dsTBParamPrid、dsTBParamType、dsTBParamRate、dsTBParamBurstSize、dsTBParamInterval}"
    },
    {
      "indent": 4,
      "text": "STATUS current\nDESCRIPTION\n   \"The Token-Bucket Parameter Group defines the objects\n   used in describing a single-rate token bucket meter\n   element.\"\n::= { dsPolicyPibGroups 14 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsPibActionGroup OBJECT-GROUP\n    OBJECTS {\n        dsActionPrid, dsActionNext, dsActionSpecific\n    }\n    STATUS current\n    DESCRIPTION\n       \"The  Action Group defines the objects used in\n       describing a generic action element.\"\n    ::= { dsPolicyPibGroups 15 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsPibDscpMarkActGroup OBJECT-GROUP\n    OBJECTS {\n        dsDscpMarkActPrid, dsDscpMarkActDscp\n    }\n    STATUS current\n    DESCRIPTION\n       \"The DSCP Mark Action Group defines the objects used\n       in describing a DSCP Marking Action element.\"\n    ::= { dsPolicyPibGroups 16 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsPibAlgDropGroup OBJECT-GROUP\n    OBJECTS {\n        dsAlgDropPrid, dsAlgDropType, dsAlgDropNext,\n        dsAlgDropQMeasure, dsAlgDropQThreshold,\n        dsAlgDropSpecific\n    }\n    STATUS current\n    DESCRIPTION\n       \"The Algorithmic Drop Group contains the objects that\n       describe algorithmic dropper operation and configura-\n       tion.\"\n    ::= { dsPolicyPibGroups 17 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsPibMQAlgDropGroup OBJECT-GROUP\n    OBJECTS {\n        dsMQAlgDropExceedNext\n    }\n    STATUS current\n    DESCRIPTION\n       \"The Multiple Queue Measured Algorithmic Drop Group\n       contains the objects that describe multiple queue measured algorithmic dropper operation and configuration.\"\n    ::= { dsPolicyPibGroups 18 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsPibRandomDropGroup OBJECT-GROUP\n    OBJECTS {\n        dsRandomDropPrid,\n        dsRandomDropMinThreshBytes,\n        dsRandomDropMinThreshPkts,\n        dsRandomDropMaxThreshBytes,\n        dsRandomDropMaxThreshPkts,\n        dsRandomDropProbMax,\n        dsRandomDropWeight,\n        dsRandomDropSamplingRate\n    }\n    STATUS current\n    DESCRIPTION\n       \"The Random Drop Group augments the Algorithmic Drop Group\n       for random dropper operation and configuration.\"\n    ::= { dsPolicyPibGroups 19 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsPibQGroup OBJECT-GROUP\n    OBJECTS {\n        dsQPrid, dsQNext, dsQMinRate, dsQMaxRate\n    }\n    STATUS current\n    DESCRIPTION\n       \"The Queue Group contains the objects that describe\n       an interface type's queues.\"\n    ::= { dsPolicyPibGroups 20 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsPibSchedulerGroup OBJECT-GROUP\n    OBJECTS {\n        dsSchedulerPrid, dsSchedulerNext, dsSchedulerMethod,\n        dsSchedulerMinRate, dsSchedulerMaxRate\n    }\n    STATUS current\n    DESCRIPTION\n       \"The Scheduler Group contains the objects that\n       describe packet schedulers on interface types.\"\n    ::= { dsPolicyPibGroups 21 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsPibMinRateGroup OBJECT-GROUP OBJECTS { dsMinRatePrid, dsMinRatePriority, dsMinRateAbsolute, dsMinRateRelative } STATUS current DESCRIPTION",
      "ja": "dsPibMinRateGroupオブジェクト・グループオブジェクト{dsMinRatePrid、dsMinRatePriority、dsMinRateAbsolute、dsMinRateRelative} STATUSの現在の記述"
    },
    {
      "indent": 4,
      "text": "   \"The Minimum Rate Group contains the objects\n   that describe packet schedulers' parameters on interface\n   types.\"\n::= { dsPolicyPibGroups 22 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "dsPibMaxRateGroup OBJECT-GROUP\n    OBJECTS {\n        dsMaxRatePrid, dsMaxRateId, dsMaxRateLevel,\n        dsMaxRateAbsolute, dsMaxRateRelative,\n        dsMaxRateThreshold\n    }\n    STATUS current\n    DESCRIPTION\n       \"The Maximum Rate Group contains the objects\n       that describe packet schedulers' parameters on interface\n       types.\"\n    ::= { dsPolicyPibGroups 23 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "END",
      "ja": "終わり"
    },
    {
      "indent": 0,
      "text": "9. Acknowledgments",
      "section_title": true,
      "ja": "9.謝辞"
    },
    {
      "indent": 3,
      "text": "Early versions of this specification were also co-authored by Michael Fine, John Seligson, Carol Bell, Andrew Smith, and Francis Reichmeyer.",
      "ja": "この仕様の初期のバージョンでも、マイケルファイン、ジョンSeligson、キャロル・ベル、アンドリュー・スミス、フランシスReichmeyerによる共著しました。"
    },
    {
      "indent": 3,
      "text": "This PIB builds on all the work that has gone into the Informal Management Model for DiffServ Routers and Management Information Base for the Differentiated Services Architecture.",
      "ja": "このPIBはDiffServのルータと差別化サービスアーキテクチャのための管理情報ベースのための非公式管理モデルに入ったすべての作業に基づいています。"
    },
    {
      "indent": 3,
      "text": "It has been developed with the active involvement of many people, but most notably Diana Rawlins, Martin Bokaemper, Walter Weiss, and Bert Wijnen.",
      "ja": "それは、多くの人々の積極的な関与で開発されてきたが、最も顕著なダイアナローリンズ、マーティンBokaemper、ウォルター・ワイス、およびバートWijnen。"
    },
    {
      "indent": 0,
      "text": "10. Security Considerations",
      "section_title": true,
      "ja": "10.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "The information contained in a PIB when transported by the COPS protocol [COPS-PR] may be sensitive, and its function of provisioning a PEP requires that only authorized communication take place.",
      "ja": "COPSプロトコル[COPS-PR]によって搬送場合PIBに含まれる情報は敏感であってもよく、PEPプロビジョニングその機能は、正規の通信が行われることを必要とします。"
    },
    {
      "indent": 3,
      "text": "In this PIB, there are no PRCs which are sensitive in their own right, such as passwords or monetary amounts. But there are a number of PRCs in this PIB that may contain information that may be sensitive from a business perspective, in that they may represent a customer's service contract or the filters that the service provider chooses to apply to a customer's traffic. These PRCs have a PIB-ACCESS clause of install: dsDataPathTable, dsClfrTable, dsClfrElementTable, dsMeterTable, dsTBParamTable, dsActionTable, dsDscpMarkActTable, dsAlgDropTable, dsMQAlgDropTable, dsRandomDropTable, dsQTable, dsSchedulerTable, dsMinRateTable, dsMaxRateTable",
      "ja": "このPIBでは、パスワードや金額など、独自の権利で敏感です何のPRCsは、存在しません。しかし、彼らは顧客のサービス契約またはサービスプロバイダは、顧客のトラフィックに適用することを選択したフィルタを表すことができるという点で、ビジネスの観点から、感受性がある可能性がある情報が含まれていてもよい。このPIBでのPRCsの数があります。 dsDataPathTable、dsClfrTable、dsClfrElementTable、dsMeterTable、dsTBParamTable、dsActionTable、dsDscpMarkActTable、dsAlgDropTable、dsMQAlgDropTable、dsRandomDropTable、dsQTable、dsSchedulerTable、dsMinRateTable、dsMaxRateTable：これらのPRCsは、インストールのPIB-ACCESS節を持っています"
    },
    {
      "indent": 3,
      "text": "Malicious altering of the above PRCs may affect the DiffServ behavior of the device being provisioned.",
      "ja": "上記位相応答曲線の悪意のある変更は、プロビジョニングされているデバイスのDiffServの挙動に影響を及ぼし得ます。"
    },
    {
      "indent": 3,
      "text": "Malicious access of the above PRCs exposes policy information concerning how the device is provisioned.",
      "ja": "上記のPRCsの悪意のあるアクセスは、デバイスがプロビジョニングされる方法に関するポリシー情報を公開します。"
    },
    {
      "indent": 3,
      "text": "This PIB also contain PRCs with PIB-ACCESS clause of notify:",
      "ja": "このPIBはまた、通知のPIB-ACCESS句とのPRCsが含まれています。"
    },
    {
      "indent": 3,
      "text": "dsBaseIfCapsTAble, dsIfClassificationCapsTable, dsIfMeteringCapsTable, dsIfAlgDropCapsTable, dsIfQueueCapsTable, dsIfSchedulerCapsTable, dsIfMaxRateCapsTable, dsIfElmDepthCapsTable, dsIfElmLinkCapsTable",
      "ja": "dsBaseIfCapsTAble、dsIfClassificationCapsTable、dsIfMeteringCapsTable、dsIfAlgDropCapsTable、dsIfQueueCapsTable、dsIfSchedulerCapsTable、dsIfMaxRateCapsTable、dsIfElmDepthCapsTable、dsIfElmLinkCapsTable"
    },
    {
      "indent": 3,
      "text": "Malicious access of the above PRCs exposes information concerning the device being provisioned.",
      "ja": "上記位相応答曲線の悪意のあるアクセスがプロビジョニングされているデバイスに関する情報を公開します。"
    },
    {
      "indent": 3,
      "text": "The use of IPSEC between PDP and PEP, as described in [COPS], provides the necessary protection.",
      "ja": "PDPとPEP間のIPsecの使用は、[COPS]で説明したように、必要な保護を提供します。"
    },
    {
      "indent": 0,
      "text": "11. Intellectual Property Considerations",
      "section_title": true,
      "ja": "11.知的財産権に関する注意事項"
    },
    {
      "indent": 3,
      "text": "The IETF has been notified of intellectual property rights claimed in regard to some or all of the specification contained in this document. For more information consult the online list of claimed rights.",
      "ja": "IETFは、この文書に含まれる仕様の一部またはすべてについて記載知的財産権について通知されています。詳細については、要求された権利のオンラインリストを参照してください。"
    },
    {
      "indent": 0,
      "text": "12. IANA Considerations",
      "section_title": true,
      "ja": "12. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document describes the dsPolicyPib Policy Information Base (PIB) modules for standardization under the \"pib\" branch registered with IANA. The IANA has assigned a PIB number (4) under the \"pib\" branch.",
      "ja": "この文書は、IANAに登録された「PIB」ブランチの下に標準化のためのdsPolicyPibポリシー情報ベース（PIB）のモジュールについて説明します。 IANAは、「PIB」ブランチの下PIB番号（4）を割り当てました。"
    },
    {
      "indent": 3,
      "text": "[SPPI] PIB SUBJECT-CATEGORIES are mapped to COPS Client Types. IANA Considerations for SUBJECT-CATEGORIES follow the same requirements as specified in [COPS] IANA Considerations for COPS Client Types. The DiffServ QoS PIB defines a new COPS Client Type in the Standards space. The IANA has assigned a COPS client type diffServ (2) as described in [COPS] IANA Considerations. IANA has updated the registry (http://www.iana.org/assignments/cops-parameters) for COPS Client Types as a result.",
      "ja": "[SPPI] PIBのSUBJECT-カテゴリはクライアントタイプをCOPSにマップされます。 COPSクライアントタイプのために[COPS] IANAの考慮事項に指定されている主題カテゴリのIANAの考慮事項は、同じ要件に従ってください。 DiffServのQoSのPIBは、基準空間に新しいCOPSクライアントタイプを定義します。 [COPS] IANAの考慮事項に記載されているようにIANAはCOPSクライアントタイプのDiffServ（2）を割り当てています。 IANAは、結果としてCOPSクライアントタイプのレジストリ（http://www.iana.org/assignments/cops-parameters）を更新しました。"
    },
    {
      "indent": 0,
      "text": "13. Normative References",
      "section_title": true,
      "ja": "13.引用規格"
    },
    {
      "indent": 3,
      "text": "[COPS] Boyle, J., Cohen, R., Durham, D., Herzog, S., Rajan, R. and A. Sastry, \"The COPS (Common Open Policy Service) Protocol\", RFC 2748, January 2000.",
      "ja": "[COPS]ボイル、J.、コーエン、R.、ダーラム、D.、ヘルツォーク、S.、ラジャン、R.とA. Sastry、 \"COPS（コモンオープンポリシーサービス）プロトコル\"、RFC 2748、2000年1月。"
    },
    {
      "indent": 3,
      "text": "[COPS-PR] Chan, K., Durham, D., Gai, S., Herzog, S., McCloghrie, K., Reichmeyer, F., Seligson, J., Smith, A. and R. Yavatkar, \"COPS Usage for Policy Provisioning\", RFC 3084, March 2001.",
      "ja": "[COPS-PR]チャン、K.、ダラム、D.、ガイ、S.、ハーツォグ、S.、McCloghrie、K.、Reichmeyer、F.、Seligson、J.、スミス、A.及びR. Yavatkar、 \"ポリシープロビジョニングのためのCOPS使用法」、RFC 3084、2001年3月。"
    },
    {
      "indent": 3,
      "text": "[SPPI] McCloghrie, K., Fine, M., Seligson, J., Chan, K., Hahn, S., Sahita, R., Smith, A. and F. Reichmeyer, \"Structure of Policy Provisioning Information\", RFC 3159, August 2001.",
      "ja": "[SPPI] McCloghrie、K.、ファイン、M.、Seligson、J.、チャン、K.、ハーン、S.、Sahita、R.、スミス、A.及びF. Reichmeyer、 \"ポリシーのプロビジョニング情報の構造\"、 RFC 3159、2001年8月。"
    },
    {
      "indent": 3,
      "text": "[DSARCH] Carlson, M., Weiss, W., Blake, S., Wang, Z., Black, D. and E. Davies, \"An Architecture for Differentiated Services\", RFC 2475, December 1998.",
      "ja": "[DSARCH]カールソン、M.、ワイス、W.、ブレイク、S.、王、Z.、ブラック、D.およびE.デイヴィス、 \"差別化サービスのためのアーキテクチャ\"、RFC 2475、1998年12月。"
    },
    {
      "indent": 3,
      "text": "[DSFIELD] Nichols, K., Blake, S., Baker, F. and D. Black, \"Definition of the Differentiated Services Field (DS Field) in the IPv4 and IPv6 Headers\", RFC 2474, December 1998.",
      "ja": "[DSFIELD]ニコルズ、K.、ブレイク、S.、ベイカー、F.とD.黒、 \"IPv4とIPv6ヘッダーとの差別化されたサービス分野（DS分野）の定義\"、RFC 2474、1998年12月。"
    },
    {
      "indent": 3,
      "text": "[FR-PIB] Fine, M., McCloghrie, K., Seligson, J., Chan, K., Hahn, S., Sahita, R., Smith, A. and F. Reichmeyer, \"Framework Policy Information Base\", RFC 3318, March 2003.",
      "ja": "[FR-PIB]ファイン、M.、McCloghrie、K.、Seligson、J.、チャン、K.、ハーン、S.、Sahita、R.、スミス、A.及びF. Reichmeyer、 \"フレームワーク方針情報基地\" 、RFC 3318、2003年3月。"
    },
    {
      "indent": 3,
      "text": "[RAP-FRAMEWORK] Yavatkar, R. and D. Pendarakis, \"A Framework for Policy-based Admission Control\", RFC 2753, January 2000.",
      "ja": "[RAP-FRAMEWORK] Yavatkar、R.とD. Pendarakis、 \"ポリシーベースのアドミッション制御のためのフレームワーク\"、RFC 2753、2000年1月。"
    },
    {
      "indent": 3,
      "text": "[SNMP-SMI] McCloghrie, K., Perkins, D., Schoenwaelder, J., Case, J., Rose, M. and S. Waldbusser, \"Structure of Management Information Version 2 (SMIv2)\", STD 58, RFC 2578, April 1999.",
      "ja": "[SNMP-SMI] McCloghrie、K.、パーキンス、D.、Schoenwaelder、J.、ケース、J.、ローズ、M.およびS. Waldbusser、 \"経営情報バージョン2（SMIv2）の構造\"、STD 58、RFC 2578年、1999年4月。"
    },
    {
      "indent": 3,
      "text": "[MODEL] Bernet, Y., Blake, S., Grossman, D. and A. Smith \"An Informal Management Model for Diffserv Routers\", RFC 3290, May 2002.",
      "ja": "[MODEL] Bernet、Y.、ブレイク、S.、グロスマン、D.とA.スミス \"のDiffservルータのための非公式の管理モデル\"、RFC 3290、2002年5月。"
    },
    {
      "indent": 3,
      "text": "[IFMIB] McCloghrie, K. and F. Kastenholz, \"The Interfaces Group MIB\", RFC 2863, June 2000.",
      "ja": "[IFMIB] McCloghrie、K.およびF. Kastenholzと、 \"インターフェイスグループMIB\"、RFC 2863、2000年6月。"
    },
    {
      "indent": 3,
      "text": "[DS-MIB] Baker, F., Chan, K. and A. Smith, \"Management Information Base for the Differentiated Services Architecture\", RFC 3289, May 2002.",
      "ja": "[DS-MIB]ベイカー、F.、チャン、K.とA.スミス、 \"差別化サービスアーキテクチャのための管理情報ベース\"、RFC 3289、2002年5月。"
    },
    {
      "indent": 3,
      "text": "[ACTQMGMT] Firoiu, V. and M. Borden, \"A Study of Active Queue Management for Congestion Control\", March 2000, In IEEE Infocom 2000, http://www.ieee-infocom.org/ 2000/papers/405.pdf",
      "ja": "http://www.ieee-infocom.org/ 2000 /論文/ 405 IEEEインフォコム2000では、[ACTQMGMT] Firoiu、V.とM.ボーデン、 \"輻輳制御のためのアクティブキュー管理の研究\"、2000年3月、。 PDF"
    },
    {
      "indent": 3,
      "text": "[AQMROUTER] Misra, V., Gong, W. and D. Towsley, \"Fluid-based analysis of a network of AQM routers supporting TCP flows with an application to RED\", In SIGCOMM 2000, http://www.acm.org/sigcomm/sigcomm2000/conf/paper/ sigcomm2000-4-3.ps.gz",
      "ja": "//www.acm：[AQMROUTER] Misraの、V.、ゴング、W.及びD. Towsley、HTTP、SIGCOMM 2000年、 \"TCPを支持AQMルータのネットワークの流体ベースの解析では赤にアプリケーションと流れます\"。 ORG / SIGCOMM / sigcomm2000 / confに/紙/ sigcomm2000-4-3.ps.gz"
    },
    {
      "indent": 3,
      "text": "[AF-PHB] Heinanen, J., Baker, F., Weiss, W. and J. Wroclawski, \"Assured Forwarding PHB Group\", RFC 2597, June 1999.",
      "ja": "[AF-PHB] Heinanen、J.、ベーカー、F.、ワイス、W.及びJ. Wroclawski、 \"保証転送PHBグループ\"、RFC 2597、1999年6月。"
    },
    {
      "indent": 3,
      "text": "[EF-PHB] Jacobson, V., Nichols, K. and K. Poduri, \"An Expedited Forwarding PHB\", RFC 2598, June 1999.",
      "ja": "[EF-PHB]ジェーコブソン、V.、ニコルズ、K.及びK. Poduri、 \"緊急転送PHB\"、RFC 2598、1999年6月。"
    },
    {
      "indent": 3,
      "text": "[INTSERVMIB] Baker, F., Krawczyk, J. and A. Sastry, \"Integrated Services Management Information Base using SMIv2\", RFC 2213, September 1997.",
      "ja": "[INTSERVMIB]ベイカー、F.、Krawczyk、J.およびA. Sastry、 \"SMIv2のを使用してサービス統合型管理情報ベース\"、RFC 2213、1997年9月。"
    },
    {
      "indent": 3,
      "text": "[QUEUEMGMT] Braden, B., Clark, D., Crowcroft, J., Davie, B., Deering, S., Estrin, D., Floyd, S., Jacobson, V., Minshall, G., Partridge, C., Peterson, L., Ramakrishnan, K., Shenker, S., Wroclawski, J. and L. Zhang, \"Recommendations on Queue Management and Congestion Avoidance in the Internet\", RFC 2309, April 1998.",
      "ja": "【QUEUEMGMT]ブレーデン、B.、クラーク、D.、クロウクロフト、J.、デイビー、B.、デアリング、S.、Estrin、D.、フロイド、S.、ヤコブソン、V.、Minshall、G.、ヤマウズラ、 C.、ピーターソン、L.、ラマクリシュナン、K.、Shenker、S.、Wroclawski、J.とL.チャン、 \"インターネットの待ち行列管理と輻輳回避の推薦\"、RFC 2309、1998年4月。"
    },
    {
      "indent": 3,
      "text": "[SRTCM] Heinanen, J. and R. Guerin, \"A Single Rate Three Color Marker\", RFC 2697, September 1999.",
      "ja": "[SRTCM] Heinanen、J.とR.ゲラン、 \"シングルレート3カラーマーカー\"、RFC 2697、1999年9月。"
    },
    {
      "indent": 3,
      "text": "[TRTCM] Heinanen, J. and R. Guerin, \"A Two Rate Three Color Marker\", RFC 2698, September 1999.",
      "ja": "[TRTCM] Heinanen、J.とR.ゲラン、 \"二つのレート3カラーマーカー\"、RFC 2698、1999年9月。"
    },
    {
      "indent": 3,
      "text": "[TSWTCM] Fang, W., Seddigh, N. and B. Nandy, \"A Time Sliding Window Three Colour Marker\", RFC 2859, June 2000.",
      "ja": "[TSWTCM]牙、W.、Seddigh、N.およびB. Nandy、 \"ウィンドウスリーカラーマーカーをスライド式時間\"、RFC 2859、2000年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC2026] Bradner, S., \"The Internet Standards Process -- Revision 3\", BCP 9, RFC 2026, October 1996.",
      "ja": "[RFC2026]ブラドナーの、S.、 \"インターネット標準化プロセス - リビジョン3\"、BCP 9、RFC 2026、1996年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2579] McCloghrie, K., Perkins, D., Schoenwaelder, J., Case, J., Rose, M. and S. Waldbusser, \"Textual Conventions for SMIv2\", STD 58, RFC 2579, April 1999.",
      "ja": "[RFC2579] McCloghrie、K.、パーキンス、D.、Schoenwaelder、J.、ケース、J.、ローズ、M.およびS. Waldbusser、 \"SMIv2のためのテキストの表記法\"、STD 58、RFC 2579、1999年4月。"
    },
    {
      "indent": 3,
      "text": "[SHAPER] Bonaventure, O. and S. De Cnodder, \"A Rate Adaptive Shaper for Differentiated Services\", RFC 2963, October 2000.",
      "ja": "[シェイパー]ボナベンチャー、O.およびS.デCnodder、 \"差別化サービスのためのレート適応シェイパー\"、RFC 2963、2000年10月。"
    },
    {
      "indent": 3,
      "text": "[POLTERM] Westerinen, A., Schnizlein, J., Strassner, J., Scherling, M., Quinn, B., Herzog, S., Huynh, A., Carlson, M., Perry, J. and S. Waldbusser, \"Terminology for Policy-Based Management\", RFC 3198, November 2001.",
      "ja": "【POLTERM] Westerinen、A.、Schnizlein、J.、Strassner、J.、Scherling、M.、クイン、B.、ヘルツォーク、S.、フイン、A.、カールソン、M.、ペリー、J.、およびS. Waldbusser、 \"ポリシーベースの管理のための用語\"、RFC 3198、2001年11月。"
    },
    {
      "indent": 0,
      "text": "14. Authors' Addresses",
      "section_title": true,
      "ja": "14.著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Kwok Ho Chan Nortel Networks, Inc. 600 Technology Park Drive Billerica, MA 01821 USA",
      "ja": "クォックホーチャンノーテルネットワークス株式会社600テクノロジーパークドライブビレリカ、MA 01821 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 978 288 8175 EMail: khchan@nortelnetworks.com",
      "ja": "電話：+1 978 288 8175 Eメール：khchan@nortelnetworks.com"
    },
    {
      "indent": 3,
      "text": "Ravi Sahita Intel Labs. 2111 NE 25th Avenue Hillsboro, OR 97124 USA",
      "ja": "ラヴィSahitaインテル・ラボ。 2111 NE 25日アベニューヒルズボロ、OR 97124 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 503 712 1554 EMail: ravi.sahita@intel.com",
      "ja": "電話：+1 503 712 1554 Eメール：ravi.sahita@intel.com"
    },
    {
      "indent": 3,
      "text": "Scott Hahn Intel 2111 NE 25th Avenue Hillsboro, OR 97124 USA",
      "ja": "スコット・ハーンインテル2111 NE 25日アベニューヒルズボロ、OR 97124 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 503 264 8231 EMail: scott.hahn@intel.com",
      "ja": "電話：+1 503 264 8231 Eメール：scott.hahn@intel.com"
    },
    {
      "indent": 3,
      "text": "Keith McCloghrie Cisco Systems, Inc. 170 West Tasman Drive San Jose, CA 95134-1706 USA",
      "ja": "キースMcCloghrieシスコシステムズ、株式会社170西タスマン・ドライブサンノゼ、CA 95134-1706 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 408 526 5260 EMail: kzm@cisco.com",
      "ja": "電話：+1 408 526 5260 Eメール：kzm@cisco.com"
    },
    {
      "indent": 0,
      "text": "15. Full Copyright Statement",
      "section_title": true,
      "ja": "15.完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2003）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "了承"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}