{
  "title": {
    "text": "RFC 7676 - IPv6 Support for Generic Routing Encapsulation (GRE)",
    "ja": "RFC 7676 - ジェネリックルーティングカプセル化のためのIPv6サポート（GRE）"
  },
  "number": 7676,
  "created_at": "2019-11-01 02:16:54.485860+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                      C. Pignataro\nRequest for Comments: 7676                                 Cisco Systems\nCategory: Standards Track                                      R. Bonica\nISSN: 2070-1721                                         Juniper Networks\n                                                             S. Krishnan\n                                                                Ericsson\n                                                            October 2015",
      "raw": true
    },
    {
      "indent": 10,
      "text": "IPv6 Support for Generic Routing Encapsulation (GRE)",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "Generic Routing Encapsulation (GRE) can be used to carry any network-layer payload protocol over any network-layer delivery protocol. Currently, GRE procedures are specified for IPv4, used as either the payload or delivery protocol. However, GRE procedures are not specified for IPv6.",
      "ja": "汎用ルーティングカプセル化（GRE）は、任意のネットワーク層配信プロトコル上の任意のネットワーク層ペイロードプロトコルを運ぶために使用することができます。現在、GRE手順は、IPv4のための指定されたペイロードまたは配信プロトコルのいずれかとして使用されます。しかし、GREの手順は、IPv6用に指定されていません。"
    },
    {
      "indent": 3,
      "text": "This document specifies GRE procedures for IPv6, used as either the payload or delivery protocol.",
      "ja": "この文書は、ペイロードまたは配信プロトコルのいずれかとして使用されるIPv6のGRE手順を、指定します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7676.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7676で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2015 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2015 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   3\n  1.1.  Requirements Language . . . . . . . . . . . . . . . . . .   3\n  1.2.  Terminology . . . . . . . . . . . . . . . . . . . . . . .   3\n2.  GRE Header Fields . . . . . . . . . . . . . . . . . . . . . .   4\n  2.1.  Checksum Present  . . . . . . . . . . . . . . . . . . . .   4\n3.  IPv6 as GRE Payload . . . . . . . . . . . . . . . . . . . . .   5\n  3.1.  GRE Protocol Type Considerations  . . . . . . . . . . . .   5\n  3.2.  MTU Considerations  . . . . . . . . . . . . . . . . . . .   5\n  3.3.  Fragmentation Considerations  . . . . . . . . . . . . . .   5\n4.  IPv6 as GRE Delivery Protocol . . . . . . . . . . . . . . . .   6\n  4.1.  Next Header Considerations  . . . . . . . . . . . . . . .   6\n  4.2.  Checksum Considerations . . . . . . . . . . . . . . . . .   6\n  4.3.  MTU Considerations  . . . . . . . . . . . . . . . . . . .   8\n5.  Security Considerations . . . . . . . . . . . . . . . . . . .   8\n6.  References  . . . . . . . . . . . . . . . . . . . . . . . . .   8\n  6.1.  Normative References  . . . . . . . . . . . . . . . . . .   8\n  6.2.  Informative References  . . . . . . . . . . . . . . . . .   9\nAcknowledgements  . . . . . . . . . . . . . . . . . . . . . . . .  10\nAuthors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  11",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "Generic Routing Encapsulation (GRE) [RFC2784] [RFC2890] can be used to carry any network-layer payload protocol over any network-layer delivery protocol. Currently, GRE procedures are specified for IPv4 [RFC791], used as either the payload or delivery protocol. However, GRE procedures are not specified for IPv6 [RFC2460].",
      "ja": "総称ルーティングカプセル化（GRE）[RFC2784]、[RFC2890]は、任意のネットワーク層配信プロトコル上の任意のネットワーク層ペイロードプロトコルを運ぶために使用することができます。現在、GRE手順は、IPv4の[RFC791]、ペイロードまたは配信プロトコルのいずれかとして使用するために指定されています。しかし、GREの手順は、IPv6 [RFC2460]に指定されていません。"
    },
    {
      "indent": 3,
      "text": "This document specifies GRE procedures for IPv6, used as either the payload or delivery protocol. Like RFC 2784, this document describes how GRE has been implemented by several vendors.",
      "ja": "この文書は、ペイロードまたは配信プロトコルのいずれかとして使用されるIPv6のGRE手順を、指定します。 RFC 2784と同様に、このドキュメントはGREが複数のベンダーによって実施されている方法を説明します。"
    },
    {
      "indent": 0,
      "text": "1.1. Requirements Language",
      "section_title": true,
      "ja": "1.1。要件言語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "1.2. Terminology",
      "section_title": true,
      "ja": "1.2。用語"
    },
    {
      "indent": 3,
      "text": "The following terms are used in this document:",
      "ja": "次の用語はこの文書で使用されています。"
    },
    {
      "indent": 3,
      "text": "o GRE delivery header: An IPv4 or IPv6 header whose source address represents the GRE ingress node and whose destination address represents the GRE egress node. The GRE delivery header encapsulates a GRE header.",
      "ja": "O GRE配信ヘッダ：そのソースアドレスと宛先アドレスGREの出口ノードを表すGREの入口ノードを表し、IPv4またはIPv6ヘッダ。 GRE配信ヘッダは、GREヘッダーをカプセル化します。"
    },
    {
      "indent": 3,
      "text": "o GRE header: The GRE protocol header. The GRE header is encapsulated in the GRE delivery header and encapsulates the GRE payload.",
      "ja": "O GREヘッダー：GREプロトコルヘッダ。 GREヘッダーはGRE配信ヘッダにカプセル化され、GREペイロードをカプセル化しています。"
    },
    {
      "indent": 3,
      "text": "o GRE payload: A network-layer packet that is encapsulated by the GRE header.",
      "ja": "O GREペイロード：GREヘッダでカプセル化されたネットワーク層パケット。"
    },
    {
      "indent": 3,
      "text": "o GRE overhead: The combined size of the GRE delivery header and the GRE header, measured in octets.",
      "ja": "O GREオーバーヘッド：GRE配信ヘッダおよびGREヘッダの合計サイズ、オクテット単位で測定。"
    },
    {
      "indent": 3,
      "text": "o Path MTU (PMTU): The minimum MTU of all the links in a path between a source node and a destination node. If the source and destination node are connected through Equal-Cost Multipath (ECMP), the PMTU is equal to the minimum link MTU of all links contributing to the multipath.",
      "ja": "OパスMTU（PMTU）：ソースノードと宛先ノードの間の経路内のすべてのリンクの最小MTU。送信元および宛先ノードが等価コストマルチパス（ECMP）を介して接続されている場合、PMTUは、マルチパスに貢献するすべてのリンクの最小リンクMTUに等しいです。"
    },
    {
      "indent": 3,
      "text": "o Path MTU Discovery (PMTUD): A procedure for dynamically discovering the PMTU between two nodes on the Internet. PMTUD procedures for IPv6 are defined in [RFC1981].",
      "ja": "OパスMTU探索（PMTUD）：動的にインターネット上の2つのノード間のPMTUを発見するための手順。 IPv6のPMTUD手順は[RFC1981]で定義されています。"
    },
    {
      "indent": 3,
      "text": "o GRE MTU (GMTU): The maximum transmission unit, i.e., maximum packet size in octets, that can be conveyed over a GRE tunnel without fragmentation of any kind. The GMTU is equal to the PMTU associated with the path between the GRE ingress and the GRE egress, minus the GRE overhead.",
      "ja": "O GRE MTU（GMTU）：任意の種類の断片化することなく、GREトンネルを介して搬送することができる最大送信単位、オクテットすなわち、最大パケットサイズ、。 GMTUは、GREの入力およびGRE出力、マイナスGREオーバーヘッドとの間の経路に関連PMTUに等しいです。"
    },
    {
      "indent": 0,
      "text": "2. GRE Header Fields",
      "section_title": true,
      "ja": "2. GREヘッダフィールド"
    },
    {
      "indent": 3,
      "text": "This document does not change the GRE header format or any behaviors specified by RFC 2784 or RFC 2890.",
      "ja": "この文書では、GREヘッダーのフォーマットまたはRFC 2784またはRFC 2890で指定された任意の行動を変化させません。"
    },
    {
      "indent": 0,
      "text": "2.1. Checksum Present",
      "section_title": true,
      "ja": "2.1。チェックサムプレゼント"
    },
    {
      "indent": 3,
      "text": "The GRE ingress node SHOULD set the Checksum Present field in the GRE header to zero. However, implementations MAY support a configuration option that causes the GRE ingress node to set the Checksum Present field to one.",
      "ja": "GREの入口ノードがゼロにGREヘッダ内のチェックサム現フィールドを設定する必要があります。しかし、実装は1つにチェックサム現在のフィールドを設定するためのGREの入口ノードの原因となる設定オプションをサポートしてもよい（MAY）。"
    },
    {
      "indent": 3,
      "text": "As per Section 2.2 of RFC 2784, the GRE egress node uses the Checksum Present field to calculate the length of the GRE header. If the Checksum Present field is set to one, the GRE egress node MUST use the GRE Checksum to verify the integrity of the GRE header and payload.",
      "ja": "RFC 2784のセクション2.2に従って、GREの出口ノードは、GREヘッダーの長さを計算するチェックサム現在フィールドを使用します。チェックサム現フィールドが1に設定されている場合、GREの出口ノードは、GREヘッダーとペイロードの整合性を検証するためにGREチェックサムを使用しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Setting the Checksum Present field to zero reduces the computational cost of GRE encapsulation and decapsulation. In many cases, the GRE Checksum is partially redundant with other checksums. For example:",
      "ja": "ゼロにチェックサム現在のフィールドを設定すると、GREカプセル化およびカプセル化解除の計算コストを削減します。多くの場合、GREチェックサムは、他のチェックサムと部分的に重複しています。例えば："
    },
    {
      "indent": 3,
      "text": "o If the payload protocol is IPv4, the IPv4 header is protected by both the GRE Checksum and the IPv4 Checksum.",
      "ja": "ペイロードプロトコルがIPv4である場合、O、IPv4ヘッダがGREチェックサムとIPv4チェックサムの両方によって保護されています。"
    },
    {
      "indent": 3,
      "text": "o If the payload carries TCP [RFC793], the TCP pseudo header, TCP header, and TCP payload are protected by both the GRE Checksum and TCP Checksum.",
      "ja": "ペイロードはTCP [RFC793]を搬送する場合、O、TCP疑似ヘッダ、TCPヘッダ、およびTCPペイロードはGREチェックサムとTCPチェックサムの両方によって保護されています。"
    },
    {
      "indent": 3,
      "text": "o If the payload carries UDP [RFC768], the UDP pseudo header, UDP header, and UDP payload are protected by both the GRE Checksum and UDP Checksum.",
      "ja": "ペイロードを運ぶ場合、O UDPは、[RFC768]、UDP疑似ヘッダ、UDPヘッダ、及びUDPペイロードはGREチェックサムとUDPチェックサムの両方によって保護されています。"
    },
    {
      "indent": 3,
      "text": "However, if the GRE Checksum Present field is set to zero, the GRE header is not protected by any checksum. Furthermore, depending on which of the above-mentioned conditions are true, selected portions of the GRE payload will not be protected by any checksum.",
      "ja": "GREチェックサム現フィールドがゼロに設定されている場合は、GREヘッダはチェックサムによって保護されていません。また、上記条件のどれに応じて任意のチェックサムによって保護されないGREペイロードの真の、選択された部分です。"
    },
    {
      "indent": 3,
      "text": "Network operators should evaluate risk factors in their networks and configure GRE ingress nodes appropriately.",
      "ja": "ネットワークオペレータはそのネットワークにリスク要因を評価し、適切にGREの入口ノードを構成する必要があります。"
    },
    {
      "indent": 0,
      "text": "3. IPv6 as GRE Payload",
      "section_title": true,
      "ja": "GREペイロードとして3. IPv6の"
    },
    {
      "indent": 3,
      "text": "The following considerations apply to GRE tunnels that carry an IPv6 payload.",
      "ja": "次の考慮事項は、IPv6ペイロードを運ぶGREトンネルに適用されます。"
    },
    {
      "indent": 0,
      "text": "3.1. GRE Protocol Type Considerations",
      "section_title": true,
      "ja": "3.1。 GREプロトコルタイプの考慮事項"
    },
    {
      "indent": 3,
      "text": "The Protocol Type field in the GRE header MUST be set to Ether Type [RFC7042] 0x86DD (IPv6).",
      "ja": "GREヘッダ内のプロトコルタイプフィールドは、イーサタイプ[RFC7042] 0x86DD（IPv6）のに設定しなければなりません。"
    },
    {
      "indent": 0,
      "text": "3.2. MTU Considerations",
      "section_title": true,
      "ja": "3.2。 MTUの考慮事項"
    },
    {
      "indent": 3,
      "text": "A GRE tunnel MUST be able to carry a 1280-octet IPv6 packet from ingress to egress, without fragmenting the payload packet. All GRE tunnels with a GMTU of 1280 octets or greater satisfy this requirement. GRE tunnels that can fragment and reassemble delivery packets also satisfy this requirement, regardless of their GMTU. However, the ability to fragment and reassemble delivery packets is not a requirement of this specification. This specification requires only that GRE ingress nodes refrain from activating GRE tunnels that do not satisfy the above-mentioned requirement.",
      "ja": "GREトンネルは、ペイロードパケットを断片化することなく、出口に入口から1280オクテットのIPv6パケットを運ぶことができなければなりません。 1280オクテット以上のGMTUを持つすべてのGREトンネルは、この要件を満たします。送達パケットを断片化と再構築することができるGREトンネルもかかわらずGMTUの、この要件を満たします。しかしながら、送達パケットを断片化と再構築する能力は、この仕様の要件ではありません。この仕様は、GREの入口ノードは、上記の要件を満たしていないGREトンネルを活性化控えることだけです。"
    },
    {
      "indent": 3,
      "text": "Before activating a GRE tunnel and periodically thereafter, the GRE ingress node MUST verify the tunnel's ability to carry a 1280-octet IPv6 payload packet from ingress to egress, without fragmenting the payload. Having executed those procedures, the GRE ingress node MUST activate or deactivate the tunnel accordingly.",
      "ja": "GREトンネルを活性化する前およびその後定期的に、GREの入口ノードは、ペイロードを断片化することなく、出口に入口から1280オクテットのIPv6ペイロードパケットを運ぶために、トンネルの能力を確認しなければなりません。これらの手順を実行した、GREの入口ノードは、それに応じてトンネルを有効または無効にする必要があります。"
    },
    {
      "indent": 3,
      "text": "Implementation details regarding the above-mentioned verification procedures are beyond the scope of this document. However, a GRE ingress node can verify tunnel capabilities by sending a 1280-octet IPv6 packet addressed to itself through the tunnel under test.",
      "ja": "上記の検証手順に関する実装の詳細は、このドキュメントの範囲を超えています。しかしながら、GREの入口ノードは、試験下のトンネルを介して自分宛1280オクテットのIPv6パケットを送信することによってトンネルの機能を検証することができます。"
    },
    {
      "indent": 3,
      "text": "Many existing implementations [RFC7588] do not support the above-mentioned verification procedures. Unless deployed in environments where the GMTU is guaranteed to be greater than 1280, these implementations MUST be configured so that the GRE endpoints can fragment and reassemble the GRE delivery packet.",
      "ja": "多くの既存の実装[RFC7588]は、上記の検証手順をサポートしていません。 GMTUが1280より大きいことが保証されている環境に展開しない限り、GREのエンドポイントはGRE配信パケットを断片化と再構築することができるように、これらの実装を設定する必要があります。"
    },
    {
      "indent": 0,
      "text": "3.3. Fragmentation Considerations",
      "section_title": true,
      "ja": "3.3。断片化の考慮事項"
    },
    {
      "indent": 3,
      "text": "When the GRE ingress receives an IPv6 payload packet whose length is less than or equal to the GMTU, it can encapsulate and forward the packet without fragmentation of any kind. In this case, the GRE ingress router MUST NOT fragment the payload or delivery packets.",
      "ja": "GREの進入は、その長さGMTU以下であるIPv6のペイロードパケットを受信すると、カプセル化し、任意の種類の断片化することなく、パケットを転送することができます。この場合、GREの入口ルータは、ペイロードまたは送達パケットを断片化してはいけません。"
    },
    {
      "indent": 3,
      "text": "When the GRE ingress receives an IPv6 payload packet whose length is greater than the GMTU, and the GMTU is greater than or equal to 1280 octets, the GRE ingress router MUST:",
      "ja": "GREの進入は、その長さGMTUより大きいIPv6のペイロードパケットを受信し、GMTUは以上1280個のオクテットに等しい場合、GREの入口ルータ必要があります。"
    },
    {
      "indent": 3,
      "text": "o discard the IPv6 payload packet",
      "ja": "OのIPv6ペイロードパケットを破棄"
    },
    {
      "indent": 3,
      "text": "o send an ICMPv6 Packet Too Big (PTB) [RFC4443] message to the IPv6 payload packet source. The MTU field in the ICMPv6 PTB message is set to the GMTU.",
      "ja": "OのIPv6ペイロードパケットソースにのICMPv6パケット過大（PTB）[RFC4443]メッセージを送信します。 ICMPv6のPTBメッセージでMTUフィールドはGMTUに設定されています。"
    },
    {
      "indent": 3,
      "text": "When the GRE ingress receives an IPv6 payload packet whose length is greater than the GMTU, and the GMTU is less than 1280 octets, the GRE ingress router MUST:",
      "ja": "GREの進入は、その長さGMTUより大きいIPv6のペイロードパケットを受信し、GMTU未満1280オクテットである場合、GREの入口ルータ必要があります。"
    },
    {
      "indent": 3,
      "text": "o encapsulate the entire IPv6 packet in a single GRE header and IP delivery header",
      "ja": "O単一GREヘッダとIP配信ヘッダーの全体IPv6パケットをカプセル化します"
    },
    {
      "indent": 3,
      "text": "o fragment the delivery header, so that it can be reassembled by the GRE egress",
      "ja": "それはGRE出力によって再組立てすることができるように、O、配信ヘッダを断片"
    },
    {
      "indent": 0,
      "text": "4. IPv6 as GRE Delivery Protocol",
      "section_title": true,
      "ja": "4. IPv6のGRE配信プロトコルとして"
    },
    {
      "indent": 3,
      "text": "The following considerations apply when the delivery protocol is IPv6.",
      "ja": "配信プロトコルがIPv6である場合は、次の考慮事項が適用されます。"
    },
    {
      "indent": 0,
      "text": "4.1. Next Header Considerations",
      "section_title": true,
      "ja": "4.1。次ヘッダの考慮事項"
    },
    {
      "indent": 3,
      "text": "When the GRE delivery protocol is IPv6, the GRE header MAY immediately follow the GRE delivery header. Alternatively, IPv6 extension headers MAY be inserted between the GRE delivery header and the GRE header.",
      "ja": "GRE配信プロトコルがIPv6である場合、GREヘッダは直ちにGRE配信ヘッダに従うことができます。あるいは、IPv6拡張ヘッダはGRE配信ヘッダおよびGREヘッダとの間に挿入してもよいです。"
    },
    {
      "indent": 3,
      "text": "If the GRE header immediately follows the GRE delivery header, the Next Header field in the IPv6 header of the GRE delivery packet MUST be set to 47. If extension headers are inserted between the GRE delivery header and the GRE header, the Next Header field in the last IPv6 extension header MUST be set to 47.",
      "ja": "GREヘッダが直ちにGRE配信ヘッダの後に続く場合は拡張ヘッダがGRE配信ヘッダおよびGREヘッダ、次ヘッダフィールドの間に挿入されている場合、GRE配信パケットのIPv6ヘッダーの次ヘッダフィールドが47に設定しなければなりません最後IPv6拡張ヘッダは、47に設定しなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.2. Checksum Considerations",
      "section_title": true,
      "ja": "4.2。チェックサムの考慮事項"
    },
    {
      "indent": 3,
      "text": "As stated in [RFC2784], the GRE header can contain a checksum. If present, the GRE header checksum can be used to detect corruption of the GRE header and GRE payload.",
      "ja": "[RFC2784]に記載されているように、GREヘッダーはチェックサムを含むことができます。存在する場合、GREヘッダのチェックサムは、GREヘッダーとGREペイロードの破損を検出するために使用することができます。"
    },
    {
      "indent": 3,
      "text": "The GRE header checksum cannot be used to detect corruption of the IPv6 delivery header. Furthermore, the IPv6 delivery header does not contain a checksum of its own. Therefore, no available checksum can be used to detect corruption of the IPv6 delivery header.",
      "ja": "GREヘッダチェックサムは、IPv6配信ヘッダの破損を検出するために使用することができません。また、IPv6の送達ヘッダは、独自のチェックサムが含まれていません。したがって、利用可能なチェックサムは、IPv6配信ヘッダの破損を検出するために使用することができません。"
    },
    {
      "indent": 3,
      "text": "In one failure scenario, the destination address in the IPv6 delivery header is corrupted. As a result, the IPv6 delivery packet is delivered to a node other than the intended GRE egress node. Depending upon the state and configuration of that node, it will either:",
      "ja": "1つの障害シナリオでは、IPv6の送達ヘッダ内の宛先アドレスが破損しています。その結果、IPv6の送出パケットは、意図GRE出力ノード以外のノードに配信されます。そのノードの状態や構成に応じて、それはどちらかでしょう："
    },
    {
      "indent": 3,
      "text": "a. Drop the packet",
      "ja": "A。パケットをドロップ"
    },
    {
      "indent": 3,
      "text": "b. Decapsulate the payload and forward it to its intended destination",
      "ja": "B。ペイロードをデカプセル化し、その目的の宛先に転送し"
    },
    {
      "indent": 3,
      "text": "c. Decapsulate the payload and forward it to a node other than its intended destination.",
      "ja": "C。ペイロードをデカプセル化し、その意図された宛先以外のノードに転送します。"
    },
    {
      "indent": 3,
      "text": "Behaviors a) and b) are acceptable. Behavior c) is not acceptable.",
      "ja": "行動a）およびb）が許容されます。行動c）は受け入れられません。"
    },
    {
      "indent": 3,
      "text": "Behavior c) is possible only when the following conditions are true:",
      "ja": "行動c）は、次の条件に該当する場合のみ可能です。"
    },
    {
      "indent": 3,
      "text": "1. The intended GRE egress node is a Virtual Private Network (VPN) Provider Edge (PE) router.",
      "ja": "1.意図GREの出口ノードは、仮想プライベートネットワーク（VPN）プロバイダーエッジ（PE）ルータです。"
    },
    {
      "indent": 3,
      "text": "2. The node to which the GRE delivery packet is mistakenly delivered is also a VPN PE router.",
      "ja": "2. GRE配信パケットが誤って配信されたノードは、VPN PEルータです。"
    },
    {
      "indent": 3,
      "text": "3. VPNs are attached to both of the above-mentioned nodes. At least two of these VPN's number hosts are from a non-unique (e.g., [RFC1918]) address space.",
      "ja": "3. VPNは、上述したノードの両方に取り付けられています。これらのVPNの数のホストの少なくとも2つは、非固有の（例えば、[RFC1918]）アドレス空間からのものです。"
    },
    {
      "indent": 3,
      "text": "4. The intended GRE egress node maintains state that causes it to decapsulate the packet and forward the payload to its intended destination",
      "ja": "4.意図GREの出口ノードは、パケットをデカプセル化し、その意図された宛先へのペイロードを転送させる状態を維持します"
    },
    {
      "indent": 3,
      "text": "5. The node to which the GRE delivery packet is mistakenly delivered maintains state that causes it to decapsulate the packet and forward the payload to an identically numbered host in another VPN.",
      "ja": "5. GRE配信パケットが誤って配信されたノードは、パケットをデカプセル化し、別のVPNで同じ番号ホストにペイロードを転送させる状態を維持します。"
    },
    {
      "indent": 3,
      "text": "While the failure scenario described above is extremely unlikely, a single misdelivered packet can adversely impact applications running on the node to which the packet is misdelivered. Furthermore, leaking packets across VPN boundaries also constitutes a security breach. The risk associated with behavior c) could be mitigated with end-to-end authentication of the payload.",
      "ja": "上述の障害シナリオは極めてまれであるが、単一の誤配送パケットに悪影響パケットが誤配送されたノード上で実行中のアプリケーションに影響を与えることができます。さらに、VPNの境界を越えてパケットをリークしても、セキュリティ侵害を構成しています。行動Cに関連するリスク）は、ペイロードのエンドツーエンド認証で緩和することができます。"
    },
    {
      "indent": 3,
      "text": "Before deploying GRE over IPv6, network operators should consider the likelihood of behavior c) in their network. GRE over IPv6 MUST NOT be deployed other than where the network operator deems the risk associated with behavior c) to be acceptable.",
      "ja": "IPv6の上でGREを展開する前に、ネットワークオペレータは、ネットワーク内の）行動cの可能性を検討すべきです。 IPv6を介しGREは、ネットワークオペレータが許容される）行動Cに関連するリスクを認める場合以外に展開してはいけません。"
    },
    {
      "indent": 0,
      "text": "4.3. MTU Considerations",
      "section_title": true,
      "ja": "4.3。 MTUの考慮事項"
    },
    {
      "indent": 3,
      "text": "By default, the GRE ingress node cannot fragment the IPv6 delivery header. However, implementations MAY support an optional configuration in which the GRE ingress node can fragment the IPv6 delivery header.",
      "ja": "デフォルトでは、GREの入口ノードは、IPv6配信ヘッダを断片化することができません。しかし、実装は、GREの入口ノードがIPv6配信ヘッダを断片化可能なオプションの構成をサポートするかもしれません。"
    },
    {
      "indent": 3,
      "text": "Also by default, the GRE egress node cannot reassemble the IPv6 delivery header. However, implementations MAY support an optional configuration in which the GRE egress node can reassemble the IPv6 delivery header.",
      "ja": "また、デフォルトでは、GREの出口ノードは、IPv6配信ヘッダを再構築することができません。しかし、実装は、GREの出口ノードは、IPv6配信ヘッダを再構成可能なオプションの構成をサポートするかもしれません。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "The Security Considerations section of [RFC4023] identifies threats encountered when MPLS is delivered over GRE. These threats apply to any GRE payload. As stated in RFC 4023, these various threats can be mitigated through options such as authenticating and/or encrypting the delivery packet using IPsec [RFC4301]. Alternatively, when the payload is IPv6, these threats can also be mitigated by authenticating and/or encrypting the payload using IPsec, instead of the delivery packet. Otherwise, the current specification introduces no security considerations beyond those mentioned in RFC 2784.",
      "ja": "[RFC4023]のSecurity Considerations部は、MPLSはGRE経由で配信されたときに遭遇する脅威を識別します。これらの脅威は、任意のGREペイロードに適用されます。 RFC 4023に記載されているように、これらの様々な脅威は、認証および/またはIPsecの[RFC4301]を使用して送達パケットを暗号化するなどのオプションを軽減することができます。ペイロードがIPv6である場合あるいは、これらの脅威はまた、認証および/または代わりの送達パケットのIPsecを使用して、ペイロードを暗号化することにより緩和することができます。それ以外の場合は、現在の仕様はRFC 2784に記載されたもの以外のいかなるセキュリティ問題も紹介しません。"
    },
    {
      "indent": 3,
      "text": "More generally, security considerations for IPv6 are discussed in [RFC4942]. Operational security for IPv6 is discussed in [OPSEC-V6], and security concerns for tunnels in general are discussed in [RFC6169].",
      "ja": "より一般的には、IPv6のセキュリティの考慮事項は、[RFC4942]で議論されています。 IPv6の運用上のセキュリティは[OPSEC-V6]で議論され、そして一般的にトンネルのセキュリティ上の懸念は、[RFC6169]に記載されています。"
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "ja": "6.参照"
    },
    {
      "indent": 0,
      "text": "6.1. Normative References",
      "section_title": true,
      "ja": "6.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC768] Postel, J., \"User Datagram Protocol\", STD 6, RFC 768, DOI 10.17487/RFC0768, August 1980, <http://www.rfc-editor.org/info/rfc768>.",
      "ja": "[RFC768]ポステル、J.、 \"ユーザ・データグラム・プロトコル\"、STD 6、RFC 768、DOI 10.17487 / RFC0768、1980年8月、<http://www.rfc-editor.org/info/rfc768>。"
    },
    {
      "indent": 3,
      "text": "[RFC791] Postel, J., \"Internet Protocol\", STD 5, RFC 791, DOI 10.17487/RFC0791, September 1981, <http://www.rfc-editor.org/info/rfc791>.",
      "ja": "[RFC791]ポステル、J.、 \"インターネットプロトコル\"、STD 5、RFC 791、DOI 10.17487 / RFC0791、1981年9月、<http://www.rfc-editor.org/info/rfc791>。"
    },
    {
      "indent": 3,
      "text": "[RFC793] Postel, J., \"Transmission Control Protocol\", STD 7, RFC 793, DOI 10.17487/RFC0793, September 1981, <http://www.rfc-editor.org/info/rfc793>.",
      "ja": "[RFC793]ポステル、J.、 \"伝送制御プロトコル\"、STD 7、RFC 793、DOI 10.17487 / RFC0793、1981年9月、<http://www.rfc-editor.org/info/rfc793>。"
    },
    {
      "indent": 3,
      "text": "[RFC1981] McCann, J., Deering, S., and J. Mogul, \"Path MTU Discovery for IP version 6\", RFC 1981, DOI 10.17487/RFC1981, August 1996, <http://www.rfc-editor.org/info/rfc1981>.",
      "ja": "[RFC1981]マッキャン、J.、デアリング、S.、およびJ.ムガール人、RFC 1981 \"IPバージョン6のパスMTUディスカバリー\"、DOI 10.17487 / RFC1981、1996年8月、<のhttp：//www.rfc-editor。組織/情報/ rfc1981>。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<http://www.rfc-editor.org/info/ RFC2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC2460] Deering, S. and R. Hinden, \"Internet Protocol, Version 6 (IPv6) Specification\", RFC 2460, DOI 10.17487/RFC2460, December 1998, <http://www.rfc-editor.org/info/rfc2460>.",
      "ja": "[RFC2460]デアリング、S.とR. Hindenと \"インターネットプロトコル、バージョン6（IPv6）の仕様\"、RFC 2460、DOI 10.17487 / RFC2460、1998年12月、<http://www.rfc-editor.org/info/ RFC2460>。"
    },
    {
      "indent": 3,
      "text": "[RFC2784] Farinacci, D., Li, T., Hanks, S., Meyer, D., and P. Traina, \"Generic Routing Encapsulation (GRE)\", RFC 2784, DOI 10.17487/RFC2784, March 2000, <http://www.rfc-editor.org/info/rfc2784>.",
      "ja": "[RFC2784]ファリナッチ、D.、李、T.、ハンクス、S.、マイヤー、D.、およびP. Trainaの、 \"総称ルーティングカプセル化（GRE）\"、RFC 2784、DOI 10.17487 / RFC2784、2000年3月、<HTTP ：//www.rfc-editor.org/info/rfc2784>。"
    },
    {
      "indent": 3,
      "text": "[RFC2890] Dommety, G., \"Key and Sequence Number Extensions to GRE\", RFC 2890, DOI 10.17487/RFC2890, September 2000, <http://www.rfc-editor.org/info/rfc2890>.",
      "ja": "[RFC2890] Dommety、G.、 \"GREのキーと一連番号拡大\"、RFC 2890、DOI 10.17487 / RFC2890、2000年9月、<http://www.rfc-editor.org/info/rfc2890>。"
    },
    {
      "indent": 3,
      "text": "[RFC4023] Worster, T., Rekhter, Y., and E. Rosen, Ed., \"Encapsulating MPLS in IP or Generic Routing Encapsulation (GRE)\", RFC 4023, DOI 10.17487/RFC4023, March 2005, <http://www.rfc-editor.org/info/rfc4023>.",
      "ja": "[RFC4023] Worster、T.、Rekhter、Y.、およびE.ローゼン、エド、 \"IP又は総称ルーティングカプセル化（GRE）でカプセル化MPLS\"、RFC 4023、DOI 10.17487 / RFC4023、2005年3月<HTTP：/ /www.rfc-editor.org/info/rfc4023>。"
    },
    {
      "indent": 3,
      "text": "[RFC4301] Kent, S. and K. Seo, \"Security Architecture for the Internet Protocol\", RFC 4301, DOI 10.17487/RFC4301, December 2005, <http://www.rfc-editor.org/info/rfc4301>.",
      "ja": "[RFC4301]ケント、S.とK. Seo、 \"インターネットプロトコルのためのセキュリティアーキテクチャ\"、RFC 4301、DOI 10.17487 / RFC4301、2005年12月、<http://www.rfc-editor.org/info/rfc4301>。"
    },
    {
      "indent": 3,
      "text": "[RFC4443] Conta, A., Deering, S., and M. Gupta, Ed., \"Internet Control Message Protocol (ICMPv6) for the Internet Protocol Version 6 (IPv6) Specification\", RFC 4443, DOI 10.17487/RFC4443, March 2006, <http://www.rfc-editor.org/info/rfc4443>.",
      "ja": "[RFC4443]コンタ、A.、デアリング、S.、およびM.グプタ編、 \"インターネット制御メッセージプロトコル（ICMPv6の）インターネットプロトコルバージョン6（IPv6）の仕様は、\"、RFC 4443、DOI 10.17487 / RFC4443、マーチ2006年、<http://www.rfc-editor.org/info/rfc4443>。"
    },
    {
      "indent": 0,
      "text": "6.2. Informative References",
      "section_title": true,
      "ja": "6.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[OPSEC-V6] Chittimaneni, K., Kaeo, M., and E. Vyncke, \"Operational Security Considerations for IPv6 Networks\", Work in Progress, draft-ietf-opsec-v6-07, September 2015.",
      "ja": "[OPSEC-V6] Chittimaneni、K.、Kaeoの、M.、およびE. Vyncke、 \"IPv6のネットワークの運用セキュリティの考慮事項\" が進行中で働いて、ドラフト-IETF-OPSEC-v6-07、2015年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC1918] Rekhter, Y., Moskowitz, B., Karrenberg, D., de Groot, G., and E. Lear, \"Address Allocation for Private Internets\", BCP 5, RFC 1918, DOI 10.17487/RFC1918, February 1996, <http://www.rfc-editor.org/info/rfc1918>.",
      "ja": "[RFC1918] Rekhter、Y.、モスコウィッツ、B.、Karrenberg、D.、デ・グルート、G.、およびE.リア、 \"個人的なインターネットのための配分\"、BCP 5、RFC 1918、DOI 10.17487 / RFC1918、1996年2月に、<http://www.rfc-editor.org/info/rfc1918>。"
    },
    {
      "indent": 3,
      "text": "[RFC4942] Davies, E., Krishnan, S., and P. Savola, \"IPv6 Transition/ Co-existence Security Considerations\", RFC 4942, DOI 10.17487/RFC4942, September 2007, <http://www.rfc-editor.org/info/rfc4942>.",
      "ja": "[RFC4942]デイヴィス、E.、クリシュナン、S.、およびP. Savola、 \"IPv6移行/共存のセキュリティの考慮事項\"、RFC 4942、DOI 10.17487 / RFC4942、2007年9月、<のhttp：//www.rfc-editor .ORG /情報/ rfc4942>。"
    },
    {
      "indent": 3,
      "text": "[RFC6169] Krishnan, S., Thaler, D., and J. Hoagland, \"Security Concerns with IP Tunneling\", RFC 6169, DOI 10.17487/RFC6169, April 2011, <http://www.rfc-editor.org/info/rfc6169>.",
      "ja": "[RFC6169]クリシュナン、S.、ターラー、D.、およびJ.ホーグランド、 \"IPトンネリングとセキュリティの懸念\"、RFC 6169、DOI 10.17487 / RFC6169、2011年4月、<http://www.rfc-editor.org/情報/ rfc6169>。"
    },
    {
      "indent": 3,
      "text": "[RFC7042] Eastlake 3rd, D. and J. Abley, \"IANA Considerations and IETF Protocol and Documentation Usage for IEEE 802 Parameters\", BCP 141, RFC 7042, DOI 10.17487/RFC7042, October 2013, <http://www.rfc-editor.org/info/rfc7042>.",
      "ja": "[RFC7042]イーストレーク3日、D.およびJ. Abley、 \"IANAの考慮事項とIETFプロトコルとIEEE 802個のパラメータのドキュメントの使用法\" を、BCP 141、RFC 7042、DOI 10.17487 / RFC7042、2013年10月、<HTTP：//www.rfc -editor.org/info/rfc7042>。"
    },
    {
      "indent": 3,
      "text": "[RFC7588] Bonica, R., Pignataro, C., and J. Touch, \"A Widely Deployed Solution to the Generic Routing Encapsulation (GRE) Fragmentation Problem\", RFC 7588, DOI 10.17487/RFC7588, July 2015, <http://www.rfc-editor.org/info/rfc7588>.",
      "ja": "[RFC7588] Bonica、R.、Pignataro、C.、およびJ.タッチ、DOI 10.17487 / RFC7588、2015年7月、<HTTP、RFC 7588、 \"総称ルーティングカプセル化（GRE）フラグメンテーション問題に広く展開されているソリューション\"：/ /www.rfc-editor.org/info/rfc7588>。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Fred Baker, Stewart Bryant, Benoit Claise, Ben Campbell, Carlos Jesus Bernardos Cano, Spencer Dawkins, Dino Farinacci, David Farmer, Brian Haberman, Tom Herbert, Kathleen Moriarty, Fred Templin, Joe Touch, Andrew Yourtchenko, and Lucy Yong for their thorough review and useful comments.",
      "ja": "著者は、フレッド・ベイカー、スチュワートブライアント、ブノワClaise、ベン・キャンベル、カルロス・イエスBernardosカノ、スペンサードーキンスディノファリナッチ、デビッド・ファーマー、ブライアンハーバーマン、トム・ハーバート、キャスリーン・モリアーティ、フレッド・テンプリン、ジョー・タッチ、アンドリューYourtchenkoに感謝したいと思いますそして彼らの徹底的な見直しと有益なコメントのためのルーシーヨンジュン。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Carlos Pignataro Cisco Systems 7200-12 Kit Creek Road Research Triangle Park, North Carolina 27709 United States",
      "ja": "カルロスPignataroシスコシステムズ7200から12キットクリーク道路リサーチトライアングルパーク、ノースカロライナ27709米国"
    },
    {
      "indent": 3,
      "text": "Email: cpignata@cisco.com",
      "ja": "メール：cpignata@cisco.com"
    },
    {
      "indent": 3,
      "text": "Ron Bonica Juniper Networks 2251 Corporate Park Drive Herndon, Virginia United States",
      "ja": "ロンBonicaジュニパーネットワークスの2251年コーポレートパークドライブハーンドン、バージニア州、米国"
    },
    {
      "indent": 3,
      "text": "Email: rbonica@juniper.net",
      "ja": "メール：rbonica@juniper.net"
    },
    {
      "indent": 3,
      "text": "Suresh Krishnan Ericsson 8400 Decarie Blvd. Town of Mount Royal, QC Canada",
      "ja": "スレシュクリシュナンエリクソン8400 Decarie大通りマウントロイヤル、QCカナダの町"
    },
    {
      "indent": 3,
      "text": "Phone: +1 514 345 7900 x42871 Email: suresh.krishnan@ericsson.com",
      "ja": "電話：+1 514 345 7900 x42871電子メール：suresh.krishnan@ericsson.com"
    }
  ]
}