{
  "title": {
    "text": "RFC 6703 - Reporting IP Network Performance Metrics: Different Points of View",
    "ja": "RFC 6703 - IPネットワークのパフォーマンス・メトリックをレポート：異なる視点を"
  },
  "number": 6703,
  "created_at": "2019-10-29 10:29:36.195470+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         A. Morton\nRequest for Comments: 6703                               G. Ramachandran\nCategory: Informational                                      G. Maguluri\nISSN: 2070-1721                                                AT&T Labs\n                                                             August 2012",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Reporting IP Network Performance Metrics: Different Points of View",
      "ja": "IPネットワークのパフォーマンス・メトリックをレポート：異なる視点を"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "Consumers of IP network performance metrics have many different uses in mind. This memo provides \"long-term\" reporting considerations (e.g., hours, days, weeks, or months, as opposed to 10 seconds), based on analysis of the points of view of two key audiences. It describes how these audience categories affect the selection of metric parameters and options when seeking information that serves their needs.",
      "ja": "IPネットワーク・パフォーマンス・メトリックの消費者は、心の中で、さまざまな用途があります。このメモは、次の2人の主要観客の視点の分析に基づいて、（10秒に対立するものとして、例えば、時間、日、週、または月）「長期」報告配慮を提供します。それは彼らのニーズに応える情報を求めているときに、これらの聴衆のカテゴリはメトリックパラメータとオプションの選択に影響を与える方法を説明します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 IESGによって承認されていないすべての文書がインターネットStandardのどんなレベルの候補です。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6703.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6703で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2012 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2012 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 3,
      "text": "This document may contain material from IETF Documents or IETF Contributions published or made publicly available before November 10, 2008. The person(s) controlling the copyright in some of this material may not have granted the IETF Trust the right to allow modifications of such material outside the IETF Standards Process. Without obtaining an adequate license from the person(s) controlling the copyright in such materials, this document may not be modified outside the IETF Standards Process, and derivative works of it may not be created outside the IETF Standards Process, except to format it for publication as an RFC or to translate it into languages other than English.",
      "ja": "この材料の一部がIETFトラストにこのような材料の変更を許可する権利を与えられていない可能性がありますにこの文書は、2008年、IETFドキュメントまたは11月10日以前に発行または公開さIETF貢献から著作権を支配する者（複数可）材料を含んでいてもよいですIETF標準化プロセスの外。そのような材料の著作権を管理者（単数または複数）から適切なライセンスを取得することなく、この文書は、IETF標準化過程の外側修正されないかもしれません、そして、それの派生物は、IETF標準化過程の外側に作成されない場合があり、それをフォーマットする以外出版RFCとして、英語以外の言語に翻訳します。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................4\n2. Purpose and Scope ...............................................4\n3. Reporting Results ...............................................5\n   3.1. Overview of Metric Statistics ..............................5\n   3.2. Long-Term Reporting Considerations .........................6\n4. Effect of POV on the Loss Metric ................................8\n   4.1. Loss Threshold .............................................8\n        4.1.1. Network Characterization ............................8\n        4.1.2. Application Performance ............................11\n   4.2. Errored Packet Designation ................................11\n   4.3. Causes of Lost Packets ....................................11\n   4.4. Summary for Loss ..........................................12\n5. Effect of POV on the Delay Metric ..............................12\n   5.1. Treatment of Lost Packets .................................12\n        5.1.1. Application Performance ............................13\n        5.1.2. Network Characterization ...........................13\n        5.1.3. Delay Variation ....................................14\n        5.1.4. Reordering .........................................15\n   5.2. Preferred Statistics ......................................15\n   5.3. Summary for Delay .........................................16\n6. Reporting Raw Capacity Metrics .................................16\n   6.1. Type-P Parameter ..........................................17\n   6.2. A priori Factors ..........................................17\n   6.3. IP-Layer Capacity .........................................17\n   6.4. IP-Layer Utilization ......................................18\n   6.5. IP-Layer Available Capacity ...............................18\n   6.6. Variability in Utilization and Available Capacity .........19\n        6.6.1. General Summary of Variability .....................19\n7. Reporting Restricted Capacity Metrics ..........................20\n   7.1. Type-P Parameter and Type-C Parameter .....................21\n   7.2. A Priori Factors ..........................................21\n   7.3. Measurement Interval ......................................22\n   7.4. Bulk Transfer Capacity Reporting ..........................22\n   7.5. Variability in Bulk Transfer Capacity .....................23\n8. Reporting on Test Streams and Sample Size ......................23\n   8.1. Test Stream Characteristics ...............................23\n   8.2. Sample Size ...............................................24\n9. Security Considerations ........................................25\n10. Acknowledgements ..............................................25\n11. References ....................................................25\n   11.1. Normative References .....................................25\n   11.2. Informative References ...................................26",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "When designing measurements of IP networks and presenting a result, knowledge of the audience is a key consideration. To present a useful and relevant portrait of network conditions, one must answer the following question:",
      "ja": "IPネットワークの測定を設計し、その結果を提示すると、観客の知識は重要な検討事項です。ネットワーク条件の有用かつ関連の肖像画を提示するためには、次の質問に答える必要があります。"
    },
    {
      "indent": 3,
      "text": "\"How will the results be used?\"",
      "ja": "「どのような結果が使用されます？」"
    },
    {
      "indent": 3,
      "text": "There are two main audience categories for the report of results:",
      "ja": "結果のレポートには主に2つの観客カテゴリがあります。"
    },
    {
      "indent": 3,
      "text": "1. Network Characterization - describes conditions in an IP network for quality assurance, troubleshooting, modeling, Service Level Agreements (SLAs), etc. This point of view (POV) looks inward toward the network where the report consumer intends their actions.",
      "ja": "1.ネットワーク特性評価 - 品質保証、トラブルシューティング、モデリング、サービスレベル契約（SLA）などのビュー（POV）のこのポイントのIPネットワーク内の状況を説明し、レポート消費者が彼らの行動を意図したネットワークに向かって内側に見えます。"
    },
    {
      "indent": 3,
      "text": "2. Application Performance Estimation - describes the network conditions in a way that facilitates determining effects on user applications, and ultimately the users themselves. This POV looks outward, toward the user(s), accepting the network as is. This report consumer intends to estimate a network-dependent aspect of performance or design some aspect of an application's accommodation of the network. (These are *not* application metrics; they are defined at the IP layer.)",
      "ja": "2.アプリケーションの性能評価 - ユーザのアプリケーションへの影響を決定する容易な方法でネットワークの状態を説明し、そして最終的にはユーザー自身。このPOVは、そのままネットワークを受け付け、ユーザ（複数可）に向かって、外側に見えます。このレポートの消費者は、パフォーマンスのネットワーク依存の様相を推定またはネットワークのアプリケーションのご宿泊のいくつかの側面を設計する予定。 （これらは*ない*アプリケーションの指標であり、それらは、IPレイヤで定義されています。）"
    },
    {
      "indent": 3,
      "text": "This memo considers how these different POVs affect both the measurement design (parameters and options of the metrics) and statistics reported when serving the report consumer's needs.",
      "ja": "このメモは、これらの異なるのPOVはレポートの消費者のニーズにサービスを提供する際に報告された測定設計（パラメータおよびメトリックのオプション）と統計の両方にどのように影響するかを考えています。"
    },
    {
      "indent": 3,
      "text": "The IP Performance Metrics (IPPM) Framework [RFC2330] and other RFCs describing IPPM provide a background for this memo.",
      "ja": "IPパフォーマンス・メトリック（IPPM）フレームワーク[RFC2330]及びIPPMを説明する他のRFCは、このメモの背景を提供します。"
    },
    {
      "indent": 0,
      "text": "2. Purpose and Scope",
      "section_title": true,
      "ja": "2.目的と範囲"
    },
    {
      "indent": 3,
      "text": "The purpose of this memo is to clearly delineate two POVs for using measurements and describe their effects on the test design, including the selection of metric parameters and reporting the results.",
      "ja": "このメモの目的は明確に測定を使用するための2つのPOVを描くとメトリックパラメータの選択を含めて、その結果を報告し、テスト設計にその効果を説明することです。"
    },
    {
      "indent": 3,
      "text": "The scope of this memo primarily covers the test design and reporting of the loss and delay metrics [RFC2680] [RFC2679]. It will also discuss the delay variation [RFC3393] and reordering metrics [RFC4737] where applicable.",
      "ja": "このメモの範囲は主に損失及び遅延メトリクス[RFC2680]、[RFC2679]の試験設計及び報告をカバーします。また、遅延変動[RFC3393]と並べ替えメトリック[RFC4737]適用について説明します。"
    },
    {
      "indent": 3,
      "text": "With capacity metrics growing in relevance to the industry, the memo also covers POV and reporting considerations for metrics resulting from the Bulk Transfer Capacity Framework [RFC3148] and Network Capacity Definitions [RFC5136]. These memos effectively describe two different categories of metrics:",
      "ja": "容量指標は、業界との関連性で成長すると、メモはまた、POVをカバーし、バルク転送能力フレームワーク[RFC3148]とネットワーク容量の定義[RFC5136]から生じたメトリックの考慮事項を報告します。これらのメモは、効果的にメトリクスの二つの異なるカテゴリを説明します。"
    },
    {
      "indent": 3,
      "text": "o Restricted [RFC3148]: includes restrictions of congestion control and the notion of unique data bits delivered, and",
      "ja": "O制限[RFC3148]：輻輳制御の制限と配信ユニークなデータビットの概念を含み、そして"
    },
    {
      "indent": 3,
      "text": "o Raw [RFC5136]: uses a definition of raw capacity without the restrictions of data uniqueness or congestion awareness.",
      "ja": "O生の[RFC5136]：データの一意性や混雑意識の制限なしで生の容量の定義を使用しています。"
    },
    {
      "indent": 3,
      "text": "It might seem, at first glance, that each of these metrics has an obvious audience (raw = network characterization, restricted = application performance), but reality is more complex and consistent with the overall topic of capacity measurement and reporting. For example, TCP is usually used in restricted capacity measurement methods, while UDP appears in raw capacity measurement. The raw and restricted capacity metrics will be treated in separate sections, although they share one common reporting issue: representing variability in capacity metric results as part of a long-term report.",
      "ja": "これらのメトリックのそれぞれが明らかに観客（生=ネットワークの特性、制限=アプリケーションのパフォーマンスを）持っていることを、一見、見えるかもしれませんが、現実はもっと複雑で、容量の測定および報告の全体的な話題と一致しています。 UDPは、生の容量測定に表示されている間たとえば、TCPは通常、制限された容量測定方法に使用されています。彼らは一つの共通のレポート問題を共有するものの、生と制限された容量のメトリックは、別のセクションで扱われます：長期的な報告書の一部として、容量計量結果の変動を表します。"
    },
    {
      "indent": 3,
      "text": "Sampling, or the design of the active packet stream that is the basis for the measurements, is also discussed.",
      "ja": "サンプリング、または測定のための基礎であるアクティブパケットストリームの設計は、また議論されています。"
    },
    {
      "indent": 0,
      "text": "3. Reporting Results",
      "section_title": true,
      "ja": "3.レポートの結果"
    },
    {
      "indent": 3,
      "text": "This section gives an overview of recommendations, followed by additional considerations for reporting results in the \"long term\", based on the discussion and conclusions of the major sections that follow.",
      "ja": "このセクションでは、議論と続く主要なセクションの結論に基づいて、「長期」で結果を報告するための追加の考慮事項が続き、お薦めの概要を説明します。"
    },
    {
      "indent": 0,
      "text": "3.1. Overview of Metric Statistics",
      "section_title": true,
      "ja": "3.1。メトリック統計の概要"
    },
    {
      "indent": 3,
      "text": "This section gives an overview of reporting recommendations for all the metrics considered in this memo.",
      "ja": "このセクションでは、このメモで考慮されるすべてのメトリックのための提言を報告の概要を説明します。"
    },
    {
      "indent": 3,
      "text": "The minimal report on measurements must include both loss and delay metrics.",
      "ja": "測定上の最小限のレポートでは、損失や遅延メトリックの両方を含める必要があります。"
    },
    {
      "indent": 3,
      "text": "For packet loss, the loss ratio defined in [RFC2680] is a sufficient starting point -- especially the existing guidance for setting the loss threshold waiting time. In Section 4.1.1, we have calculated a waiting time -- 51 seconds -- that should be sufficient to differentiate between packets that are truly lost or have long finite delays under general measurement circumstances. Knowledge of specific conditions can help to reduce this threshold, and a waiting time of approximately 50 seconds is considered to be manageable in practice.",
      "ja": "損失しきい値待機時間を設定するため、特に既存のガイダンス - パケット損失のために、[RFC2680]で定義された損失率が十分出発点です。 51秒 -   - 本当に失われたり、一般的な測定状況下で長い有限の遅延を持っているパケットを区別するのに十分であるべきで4.1.1項では、待機時間を計算しています。特定の条件の知識がこのしきい値を減らすのに役立つことができ、約50秒の待機時間は、実際に管理可能であると考えられています。"
    },
    {
      "indent": 3,
      "text": "We note that a loss ratio calculated according to [Y.1540] would exclude errored packets from the numerator. In practice, the difference between these two loss metrics is small, if any, depending on whether the last link prior to the Destination contributes errored packets.",
      "ja": "私たちは、[Y.1540]に従って計算損失率は、分子からエラーのあるパケットを排除することに注意してください。実際には、これらの二つの損失指標との違いは、前の宛先への最後のリンクはエラーのあるパケットを貢献するかどうかに応じて、いずれかの場合には、小さいです。"
    },
    {
      "indent": 3,
      "text": "For packet delay, we recommend providing both the mean delay and the median delay with lost packets designated as undefined (as permitted by [RFC2679]). Both statistics are based on a conditional distribution, and the condition is packet arrival prior to a waiting time dT, where dT has been set to take maximum packet lifetimes into account, as discussed above for loss. Using a long dT helps to ensure that delay distributions are not truncated.",
      "ja": "パケット遅延のために、我々は、平均遅延と（[RFC2679]で許可さ）未定義として指定し、失われたパケットと遅延中央値の両方を提供するお勧めします。両方の統計は、条件付き分布に基づいて、条件は、損失のため上述したようにDTは、アカウントに最大パケット寿命を取るように設定された待機時間dTを、前パケット到着あるれます。長いのdTを使用すると、その遅延分布が切り捨てられていないことを確認するのに役立ちます。"
    },
    {
      "indent": 3,
      "text": "For Packet Delay Variation (PDV), the minimum delay of the conditional distribution should be used as the reference delay for computing PDV according to [Y.1540] or [RFC5481] and [RFC3393]. A useful value to report is a \"pseudo\" range of delay variation based on calculating the difference between a high percentile of delay and the minimum delay. For example, the 99.9th percentile minus the minimum will give a value that can be compared with objectives in [Y.1541].",
      "ja": "パケット遅延変動（PDV）のために、条件付き分布の最小遅延は、[Y.1540]または[RFC5481]及び[RFC3393]に従ってPDVを計算するための基準遅延として使用されるべきです。報告するための有用な値は、遅延と最小遅延の高いパーセンタイルの間の差を計算することに基づいて、遅延変動の「擬似」範囲です。例えば、99.9thパーセンタイルマイナス最小[Y. 1541]における目標と比較することができる値を与えます。"
    },
    {
      "indent": 3,
      "text": "For both raw capacity and restricted capacity, reporting the variability in a useful way is identified as the main challenge. The min, max, and range statistics are suggested along with a ratio of max to min and moving averages. In the end, a simple plot of the singleton results over time may succeed where summary metrics fail or may serve to confirm that the summaries are valid.",
      "ja": "便利な方法の変動を報告し、両方の生の容量や制限容量については、主な課題として特定されます。 MIN、MAX、および範囲統計は平均値をMinと移動する最大の割合と一緒に提案されています。概要メトリックが失敗するか、または要約が有効であることを確認するために役立つことができる場所を最後に、時間をかけてシングルトン結果の簡単なプロットが成功する可能性があります。"
    },
    {
      "indent": 0,
      "text": "3.2. Long-Term Reporting Considerations",
      "section_title": true,
      "ja": "3.2。長期レポートの考慮事項"
    },
    {
      "indent": 3,
      "text": "[IPPM-RPT] describes methods to conduct measurements and report the results on a near-immediate time scale (10 seconds, which we consider to be \"short-term\").",
      "ja": "[IPPM-RPT]は（私たちは、「短期的」であると考える10秒）の測定を実施し、ほぼ即時の時間スケールでの結果を報告する方法を説明します。"
    },
    {
      "indent": 3,
      "text": "Measurement intervals and reporting intervals need not be the same length. Sometimes, the user is only concerned with the performance levels achieved over a relatively long interval of time (e.g., days, weeks, or months, as opposed to 10 seconds). However, there can be risks involved with running a measurement continuously over a long period without recording intermediate results: o Temporary power failure may cause loss of all results to date.",
      "ja": "測定間隔と報告間隔が同じ長さである必要はありません。時々、ユーザは、（10秒とは対照的に、例えば、数日、数週間、または数ヶ月）時間の比較的長い間隔にわたって達成される性能レベルを有する唯一の懸念です。しかし、中間結果を記録せずに長期間にわたって継続的に測定を実行に関与するリスクがあることができます：一時的な停電oをこれまでにすべての結果の損失を引き起こす可能性があります。"
    },
    {
      "indent": 3,
      "text": "o Measurement system timing synchronization signals may experience a temporary outage, causing subsets of measurements to be in error or invalid.",
      "ja": "O計測システムのタイミング同期信号は、エラーまたは無効であると測定のサブセットを引き起こし、一時的な停止を経験し得ます。"
    },
    {
      "indent": 3,
      "text": "o Maintenance on the measurement system or on its connectivity to the network under test may be necessary.",
      "ja": "O計測システムまたはテスト中のネットワークへの接続上のメンテナンスが必要であってもよいです。"
    },
    {
      "indent": 3,
      "text": "For these and other reasons, such as",
      "ja": "など、これらおよびその他の理由により、"
    },
    {
      "indent": 3,
      "text": "o the constraint to collect measurements on intervals similar to user session length,",
      "ja": "ユーザセッションの長さと同様の間隔で測定値を収集するための制約O、"
    },
    {
      "indent": 3,
      "text": "o the dual use of measurements in monitoring activities where results are needed on a period of a few minutes, or",
      "ja": "結果は数分の間に必要とされているモニタリング活動での測定、または二重の使用O"
    },
    {
      "indent": 3,
      "text": "o the ability to inspect results of a single measurement interval for deeper analysis,",
      "ja": "より深い分析のための単一の測定間隔の結果を検査する能力はO、"
    },
    {
      "indent": 3,
      "text": "there is value in conducting measurements on intervals that are much shorter than the reporting interval.",
      "ja": "レポート間隔よりもはるかに短い時間間隔で測定を行う価値があります。"
    },
    {
      "indent": 3,
      "text": "There are several approaches for aggregating a series of measurement results over time in order to make a statement about the longer reporting interval. One approach requires the storage of all metric singletons collected throughout the reporting interval, even though the measurement interval stops and starts many times.",
      "ja": "長い報告間隔についてのステートメントを作るために時間をかけて測定結果のシリーズを集約するためのいくつかのアプローチがあります。一つのアプローチは、測定間隔が停止し、何度も起動していても、レポート期間を通じて収集されたすべてのメトリックシングルトンのストレージを必要とします。"
    },
    {
      "indent": 3,
      "text": "Another approach is described in [RFC5835] as \"temporal aggregation\". This approach would estimate the results for the reporting interval based on combining many individual short-term measurement interval statistics to yield a long-term result. The result would ideally appear in the same form as though a continuous measurement had been conducted. A memo addressing the details of temporal aggregation is yet to be prepared.",
      "ja": "別のアプローチは、「一時的な集合」と[RFC5835]に記載されています。このアプローチは、長期的な結果を得るために多くの個々の短期測定間隔の統計を組み合わせることに基づくレポート間隔の結果を推定します。連続測定が行われたかのように、結果は、理想的には同じ形式で表示されます。時間的な凝集の詳細を扱うメモがまだ準備されるべきです。"
    },
    {
      "indent": 3,
      "text": "Yet another approach requires a numerical objective for the metric, and the results of each measurement interval are compared with the objective. Every measurement interval where the results meet the objective contribute to the fraction of time with performance as specified. When the reporting interval contains many measurement intervals, it is possible to present the results as \"metric A was less than or equal to objective X during Y% of time\".",
      "ja": "さらに別のアプローチは、メトリックの数値目標を必要とし、各測定間隔の結果は、目的と比較されます。指定されたとおりの結果が目的を満たすすべての測定間隔は、パフォーマンスと時間の割合に貢献します。報告間隔は、多くの測定間隔を含む場合、「メトリックAは、以下の時間のY％の間目的Xに等しかった」として結果を提示することが可能です。"
    },
    {
      "indent": 6,
      "text": "NOTE that numerical thresholds of acceptability are not set in IETF performance work and are therefore excluded from the scope of this memo.",
      "ja": "合否の数値しきい値はIETFパフォーマンスの仕事に設定されていないため、このメモの範囲から除外されることに注意してください。"
    },
    {
      "indent": 3,
      "text": "In all measurements, it is important to avoid unintended synchronization with network events. This topic is treated in [RFC2330] for Poisson-distributed inter-packet time streams and in [RFC3432] for Periodic streams. Both avoid synchronization by using random start times.",
      "ja": "すべての測定では、ネットワークイベントとの意図しない同期を避けることが重要です。このトピックでは、ポアソン分布パケット間時間の流れおよび周期的な流れのために[RFC3432]の[RFC2330]で処理されます。どちらもランダム開始時間を使って同期を避けます。"
    },
    {
      "indent": 3,
      "text": "There are network conditions where it is simply more useful to report the connectivity status of the Source-Destination path, and to distinguish time intervals where connectivity can be demonstrated from other time intervals (where connectivity does not appear to exist). [RFC2678] specifies a number of one-way and two-way connectivity metrics of increasing complexity. In this memo, we recommend that long-term reporting of loss, delay, and other metrics be limited to time intervals where connectivity can be demonstrated, and that other intervals be summarized as the percent of time where connectivity does not appear to exist. We note that this same approach has been adopted in ITU-T Recommendation [Y.1540] where performance parameters are only valid during periods of service \"availability\" (evaluated according to a function based on packet loss, and sustained periods of loss ratio greater than a threshold are declared \"unavailable\").",
      "ja": "ソース・デスティネーションパスの接続状況を報告する、との接続は（接続が存在していないよう）他の時間間隔から発揮させることができる時間間隔を区別するために、単により有用であるネットワーク条件があります。 [RFC2678]は増加する複雑さの一方向および双方向接続メトリックの数を指定します。このメモでは、我々は損失、遅延、およびその他のメトリックの長期レポートは接続が立証することができ、かつ、他の区間は接続が存在していないよう時間のパーセントとしてまとめることが時間間隔に制限されることをお勧めします。我々は、パケット損失に基づく関数に従って評価「可用性」（、及び損失率以上の持続期間、この同じアプローチは、性能パラメータは、サービスの期間中にのみ有効であるITU-T勧告[Y.1540]で採用されていることに注意してくださいしきい値よりも）「利用できない」と宣言しています。"
    },
    {
      "indent": 0,
      "text": "4. Effect of POV on the Loss Metric",
      "section_title": true,
      "ja": "損失メトリックのPOVの4及ぼす影響"
    },
    {
      "indent": 3,
      "text": "This section describes the ways in which the loss metric can be tuned to reflect the preferences of the two audience categories, or different POVs. The waiting time before declaring that a packet is lost -- the loss threshold -- is one area where there would appear to be a difference, but the ability to post-process the results may resolve it.",
      "ja": "このセクションでは、損失メトリックは2つの観客カテゴリ、または異なるのPOVの好みを反映するように調整することができる方法を説明します。損失しきい値を -   - パケットが失われたことを宣言するまでの待ち時間は1つの違いがあるように思われるエリアが、結果はそれを解決することができるプロセスを投稿する機能です。"
    },
    {
      "indent": 0,
      "text": "4.1. Loss Threshold",
      "section_title": true,
      "ja": "4.1。損失しきい値"
    },
    {
      "indent": 3,
      "text": "RFC 2680 [RFC2680] defines the concept of a waiting time for packets to arrive, beyond which they are declared lost. The text of the RFC declines to recommend a value, instead saying that \"good engineering, including an understanding of packet lifetimes, will be needed in practice\". Later, in the methodology, they give reasons for waiting \"a reasonable period of time\" and leave the definition of \"reasonable\" intentionally vague. Below, we estimate a practical bound on waiting time.",
      "ja": "RFC 2680 [RFC2680]は、彼らが失われたと宣言されているを超えて到着するパケットのための待機時間の概念を定義します。 RFCのテキストではなく、「パケット寿命の理解など、優れたエンジニアリングは、実際に必要とされるであろう」と言って、値をお勧めを拒否します。その後、方法論では、彼らは、「合理的な期間を」待機の理由を与え、意図的にあいまいな「合理的」の定義を残します。以下に、私たちは時間を待っているの実用的な限界を推定します。"
    },
    {
      "indent": 0,
      "text": "4.1.1. Network Characterization",
      "section_title": true,
      "ja": "4.1.1。ネットワーク特性評価"
    },
    {
      "indent": 3,
      "text": "Practical measurement experience has shown that unusual network circumstances can cause long delays. One such circumstance is when routing loops form during IGP re-convergence following a failure or drastic link cost change. Packets will loop between two routers until new routes are installed or until the IPv4 Time-to-Live (TTL) field (or the IPv6 Hop Limit) decrements to zero. Very long delays on the order of several seconds have been measured [Casner] [Cia03].",
      "ja": "実際の測定の経験は珍しいネットワークの状況が長い遅延を引き起こす可能性があることを示しています。ルーティングループが故障または大幅なリンクコスト変更次のIGPの再収束時形成する場合そのような状況です。パケットは、2つのルータ間のループ新しいルートがインストールされるまで、またはIPv4生存時間（TTL）フィールド（またはIPv6ホップ限界）がゼロにデクリメントされるまでになります。数秒程度の非常に長い遅延は、[Casner] [Cia03]測定されています。"
    },
    {
      "indent": 3,
      "text": "Therefore, network characterization activities prefer a long waiting time in order to distinguish these events from other causes of loss (such as packet discard at a full queue, or tail drop). This way, the metric design helps to distinguish more reliably between packets that might yet arrive and those that are no longer traversing the network.",
      "ja": "そのため、ネットワークの特性評価活動は、（フルキューのパケット廃棄、またはテールドロップなど）の損失の他の原因から、これらのイベントを区別するために、長い待ち時間を好みます。この方法では、メトリックデザインがまだ到着し、もはやネットワークを通過しているものかもしれませんパケット間より確実に区別するのに役立ちます。"
    },
    {
      "indent": 3,
      "text": "It is possible to calculate a worst-case waiting time, assuming that a routing loop is the cause. We model the path between Source and Destination as a series of delays in links (t) and queues (q), as these are the dominant contributors to delay (in active measurement, the Source and Destination hosts contribute minimal delay). The normal path delay, D, across n queues (where TTL is decremented at a node with a queue) and n+1 links without encountering a loop, is",
      "ja": "ルーティングループが原因であると仮定し、最悪の場合の待機時間を算出することが可能です。我々は、これらが遅延する支配的な要因であるとして（アクティブ測定では、送信元と送信先のホストが最小の遅延に貢献）、リンク（t）とキュー（Q）における遅延のシリーズとして送信元と宛先の間のパスをモデル化します。通常パス（TTLがキューのノードにデクリメントされる）、n個のキューを横切る遅延、D、およびn +ループに遭遇することなく1つのリンクは、あります"
    },
    {
      "indent": 8,
      "text": "Path model with n=5\n  Source --- q1 --- q2 --- q3 --- q4 --- q5 --- Destination\n         t0     t1     t2     t3     t4     t5",
      "raw": true
    },
    {
      "indent": 24,
      "text": "           n\n          ---\n          \\\nD = t  +   >  (t  +  q)\n     0    /     i     i\n          ---\n         i = 1",
      "raw": true
    },
    {
      "indent": 24,
      "text": "Figure 1: Normal Path Delay",
      "ja": "図1：通常のパス遅延"
    },
    {
      "indent": 3,
      "text": "and the time spent in the loop with L queues is",
      "ja": "そして、L・キューとループに費やされる時間があります"
    },
    {
      "indent": 12,
      "text": "Path model with n=5 and L=3\nTime in one loop = (qx+tx + qy+ty + qz+tz)",
      "raw": true
    },
    {
      "indent": 14,
      "text": "                     qy -- qz\n                      |  ?/exit?\n                     qx--/\\\nSrc --- q1 --- q2 ---/    q3 --- q4 --- q5 --- Dst\n    t0     t1     t2         t3     t4     t5",
      "raw": true
    },
    {
      "indent": 17,
      "text": "      j + L-1\n       ---\n       \\                          (TTL - n)\nR = C   >  (t  +  q)  where C   = ---------\n       /     i     i         max      L\n       ---\n       i=j",
      "raw": true
    },
    {
      "indent": 16,
      "text": "Figure 2: Delay Due to Rotations in a Loop",
      "ja": "図2：ループ内ローテーションによる遅延"
    },
    {
      "indent": 3,
      "text": "where n is the total number of queues in the non-loop path (with n+1 links), j is the queue number where the loop begins, C is the number of times a packet circles the loop, and TTL is the packet's initial Time-to-Live value at the Source (or Hop Count in IPv6).",
      "ja": "nは（N + 1つのリンクとの）非ループ経路内のキューの合計数であり、jはループが開始キュー番号であり、Cは、回数パケット円ループであり、TTLは、パケットの最初でありますソースのタイム・ツー・ライブ値（またはホップは、IPv6でカウント）。"
    },
    {
      "indent": 3,
      "text": "If we take the delays of all links and queues as 100 ms each, the TTL=255, the number of queues n=5, and the queues in the loop L=4, then using C_max:",
      "ja": "我々は、100ミリ秒毎、TTL = 255、キューの数N = 5と、ループL = 4のキューなどのすべてのリンクの遅延とキューを取る場合、C_MAXを使用："
    },
    {
      "indent": 6,
      "text": "D = 1.1 seconds and R ~= 50 seconds, and D + R ~= 51.1 seconds",
      "ja": "D = 1.1秒、R〜= 50秒、およびD + R〜= 51.1秒"
    },
    {
      "indent": 3,
      "text": "We note that the link delays of 100 ms would span most continents, and a constant queue length of 100 ms is also very generous. When a loop occurs, it is almost certain to be resolved in 10 seconds or less. The value calculated above is an upper limit for almost any real-world circumstance.",
      "ja": "私たちは、100ミリ秒のリンク遅延はほとんどの大陸にまたがることに注意してください、と100ミリ秒の一定のキューの長さも非常に寛大です。ループが発生した場合、10秒以下で解決することがほぼ確実です。上記の計算値は、ほぼすべての現実世界の状況の上限です。"
    },
    {
      "indent": 3,
      "text": "A waiting time threshold parameter, dT, set consistent with this calculation, would not truncate the delay distribution (possibly causing a change in its mathematical properties), because the packets that might arrive have been given sufficient time to traverse the network.",
      "ja": "到着する可能性があり、パケットがネットワークを通過するのに十分な時間を与えられているため、この計算と一致して設定された待機時間閾値パラメータ、dtは、（おそらくはその数学的特性の変化を引き起こす）遅延分布を切り捨てません。"
    },
    {
      "indent": 3,
      "text": "It is worth noting that packets that are stored and deliberately forwarded at a much later time constitute a replay attack on the measurement system and are beyond the scope of normal performance reporting.",
      "ja": "それは保存され、故意にずっと後の時点で転送されたパケットは、測定システムのリプレイ攻撃を構成し、通常のパフォーマンス・レポートの範囲を超えていることは注目に値します。"
    },
    {
      "indent": 0,
      "text": "4.1.2. Application Performance",
      "section_title": true,
      "ja": "4.1.2。アプリケーションのパフォーマンス"
    },
    {
      "indent": 3,
      "text": "Fortunately, application performance estimation activities are not adversely affected by the long estimated limit on waiting time, because most applications will use shorter time thresholds. Although the designer's tendency might be to set the loss threshold at a value equivalent to a particular application's threshold, this specific threshold can be applied when post-processing the measurements. A shorter waiting time can be enforced by locating packets with delays longer than the application's threshold and re-designating such packets as lost. Thus, the measurement system can use a single loss waiting time and support both application and network performance POVs simultaneously.",
      "ja": "ほとんどのアプリケーションでは、短い時間のしきい値を使用しますので、幸いなことに、アプリケーションのパフォーマンス推定活動に悪影響、待ち時間の長い推定制限の影響を受けません。デザイナーの傾向は、特定のアプリケーションのしきい値に相当する値での損失しきい値を設定することがあるかもしれないが、測定結果を後処理する場合、この特定のしきい値を適用することができます。短い待ち時間が失われたとして、アプリケーションのしきい値よりも長い遅延と再指定などのパケットを持つパケットを配置することにより実施することができます。したがって、測定システムは、単一の損失待ち時間を使用することができると同時に、アプリケーションおよびネットワークパフォーマンスのPOVをサポートします。"
    },
    {
      "indent": 0,
      "text": "4.2. Errored Packet Designation",
      "section_title": true,
      "ja": "4.2。エラーが発生したパケット指定"
    },
    {
      "indent": 3,
      "text": "RFC 2680 designates packets that arrive containing errors as lost packets. Many packets that are corrupted by bit errors are discarded within the network and do not reach their intended destination.",
      "ja": "RFC 2680は、失われたパケットとしてエラーを含む到着するパケットを指定します。ビットエラーによって破壊され、多くのパケットがネットワーク内で破棄され、その目的の宛先に到達しません。"
    },
    {
      "indent": 3,
      "text": "This is consistent with applications that would check the payload integrity at higher layers and discard the packet. However, some applications prefer to deal with errored payloads on their own, and even a corrupted payload is better than no packet at all.",
      "ja": "これは、上位層でのペイロードの整合性をチェックして、パケットを破棄しますアプリケーションと一致しています。ただし、一部のアプリケーションでは、独自に、エラーが発生ペイロードに対処することを好む、とさえ破損したペイロードはまったくのパケットよりも優れています。"
    },
    {
      "indent": 3,
      "text": "To address this possibility, and to make network characterization more complete, distinguishing between packets that do not arrive (lost) and errored packets that arrive (conditionally lost) is recommended.",
      "ja": "この可能性に対処するため、およびネットワークの特性をより完全にするために、到着しないパケット（紛失）と（条件付きで失われた）到着し、エラーが発生するパケットを区別することは推奨されます。"
    },
    {
      "indent": 0,
      "text": "4.3. Causes of Lost Packets",
      "section_title": true,
      "ja": "4.3。失われたパケットの原因"
    },
    {
      "indent": 3,
      "text": "Although many measurement systems use a waiting time to determine whether or not a packet is lost, most of the waiting is in vain. The packets are no longer traversing the network and have not reached their destination.",
      "ja": "多くの測定システムは、パケットが失われたかどうかを判断するために待機している時間を使用していますが、待ち時間のほとんどは無駄です。パケットは、もはやネットワークを通過されていないとその先に達していません。"
    },
    {
      "indent": 3,
      "text": "There are many causes of packet loss, including the following:",
      "ja": "以下を含むパケット損失の多くの原因があります："
    },
    {
      "indent": 3,
      "text": "1. Queue drop, or discard",
      "section_title": true,
      "ja": "1.キュードロップ、または破棄"
    },
    {
      "indent": 3,
      "text": "2. Corruption of the IP header, or other essential header information",
      "ja": "2. IPヘッダの破損、または他の必須のヘッダ情報"
    },
    {
      "indent": 3,
      "text": "3. TTL expiration (or use of a TTL value that is too small)",
      "section_title": true,
      "ja": "3. TTLの期限切れ（又は小さすぎるTTL値を使用）"
    },
    {
      "indent": 3,
      "text": "4. Link or router failure",
      "section_title": true,
      "ja": "4.リンクやルータの故障"
    },
    {
      "indent": 3,
      "text": "5. Layers below the Source-to-Destination IP layer can discard packets that fail error checking, and link-layer checksums often cover the entire packet",
      "ja": "送信元から宛先IP層の下5.レイヤーは、エラーチェックに失敗したパケットを破棄することができ、およびリンク層のチェックサムは、多くの場合、パケット全体をカバー"
    },
    {
      "indent": 3,
      "text": "It is reasonable to consider a packet that has not arrived after a large amount of time to be lost (due to one of the causes above) because packets do not \"live forever\" in the network or have infinite delay.",
      "ja": "多くの時間が失われることの後にパケットがネットワークに「永遠に生きる」または無限の遅延を持っていないので（原因上記の原因の一つに）到着していないパケットを考慮することが妥当です。"
    },
    {
      "indent": 0,
      "text": "4.4. Summary for Loss",
      "section_title": true,
      "ja": "4.4。損失の概要"
    },
    {
      "indent": 3,
      "text": "Given that measurement post-processing is possible (even encouraged in the definitions of IPPM), measurements of loss can easily serve both POVs:",
      "ja": "測定後処理（さえIPPMの定義に奨励）可能であることを考えると、損失の測定が容易に両方のPOVを果たすことができます。"
    },
    {
      "indent": 3,
      "text": "o Use a long waiting time to serve network characterization and revise results for specific application delay thresholds as needed.",
      "ja": "Oネットワークの特性を提供し、必要に応じて、特定のアプリケーションの遅延しきい値の結果を修正するために、長い待ち時間を使用してください。"
    },
    {
      "indent": 3,
      "text": "o Distinguish between errored packets and lost packets when possible to aid network characterization, and combine the results for application performance if appropriate.",
      "ja": "Oネットワークの特性を支援するために可能な場合はエラーが発生したパケットと失われたパケットを区別し、適切な場合には、アプリケーションのパフォーマンスのために結果を組み合わせます。"
    },
    {
      "indent": 0,
      "text": "5. Effect of POV on the Delay Metric",
      "section_title": true,
      "ja": "遅延メトリックにPOV 5.影響"
    },
    {
      "indent": 3,
      "text": "This section describes the ways in which the delay metric can be tuned to reflect the preferences of the two consumer categories, or different POVs.",
      "ja": "このセクションでは、遅延メトリックは、2つの消費者のカテゴリ、または異なるのPOVの好みを反映するように調整することができる方法を説明します。"
    },
    {
      "indent": 0,
      "text": "5.1. Treatment of Lost Packets",
      "section_title": true,
      "ja": "5.1。失われたパケットの治療"
    },
    {
      "indent": 3,
      "text": "The delay metric [RFC2679] specifies the treatment of packets that do not successfully traverse the network: their delay is undefined.",
      "ja": "遅延メトリック[RFC2679]は成功裏にネットワークを通過していないパケットの治療を指定しています。彼らの遅延が定義されていません。"
    },
    {
      "indent": 6,
      "text": ">>The *Type-P-One-way-Delay* from Src to Dst at T is undefined (informally, infinite)<< means that Src sent the first bit of a Type-P packet to Dst at wire-time T and that Dst did not receive that packet.",
      "ja": ">> *タイプP-ワンウェイ遅延TでのSrcからDSTの*が未定義<< SRCはワイヤ時間TでDSTのタイプPのパケットの最初のビットを送信したことを意味する（非公式に、無限大）をとDSTはそのパケットを受信しなかったこと。"
    },
    {
      "indent": 3,
      "text": "It is an accepted but informal practice to assign infinite delay to lost packets. We next look at how these two different treatments align with the needs of measurement consumers who wish to characterize networks or estimate application performance. Also, we look at the way that lost packets have been treated in other metrics: delay variation and reordering.",
      "ja": "失われたパケットへの無限の遅延を割り当てるために受け入れられますが、非公式の練習です。私たちは、次のこれらの二つの異なる処理がネットワークや見積アプリケーションのパフォーマンスを特徴付けるしたい測定消費者のニーズに合わせ方法を見て。遅延変動や並べ替え：また、我々は他のメトリックで処理されたパケットを失った方法を見てください。"
    },
    {
      "indent": 0,
      "text": "5.1.1. Application Performance",
      "section_title": true,
      "ja": "5.1.1。アプリケーションのパフォーマンス"
    },
    {
      "indent": 3,
      "text": "Applications need to perform different functions, dependent on whether or not each packet arrives within some finite tolerance. In other words, a receiver's packet processing takes only one of two alternative directions (a \"fork\" in the road):",
      "ja": "アプリケーションは、各パケットは、ある有限の許容範囲内に到着したかどうかに依存して、異なる機能を実行する必要があります。換言すれば、受信機のパケット処理は、二つの別の方向（道路の「フォーク」）のいずれか一方のみを取ります。"
    },
    {
      "indent": 3,
      "text": "o Packets that arrive within expected tolerance are handled by removing headers, restoring smooth delivery timing (as in a de-jitter buffer), restoring sending order, checking for errors in payloads, and many other operations.",
      "ja": "O予想許容範囲内に到着するパケットは、ヘッダを除去（デジッタバッファのように）滑らかな配信タイミングを回復、送信順序を復元する、ペイロード、および多くの他の動作のエラーをチェックすることによって処理されます。"
    },
    {
      "indent": 3,
      "text": "o Packets that do not arrive when expected lead to attempted recovery from the apparent loss, such as retransmission requests, loss concealment, or forward error correction to replace the missing packet.",
      "ja": "Oこのよう欠落パケットを交換する再送要求、損失の隠蔽、または前方誤り訂正などの見かけの損失、から試行回復への期待リードに到着しないパケット。"
    },
    {
      "indent": 3,
      "text": "So, it is important to maintain a distinction between packets that actually arrive and those that do not. Therefore, it is preferable to leave the delay of lost packets undefined and to characterize the delay distribution as a conditional distribution (conditioned on arrival).",
      "ja": "だから、実際に到着したパケットとそうでないものの区別を維持することが重要です。したがって、未定義失われたパケットの遅延を残すようにし、（到着を条件）条件付き分布として遅延分布を特徴づけることが好ましいです。"
    },
    {
      "indent": 0,
      "text": "5.1.2. Network Characterization",
      "section_title": true,
      "ja": "5.1.2。ネットワーク特性評価"
    },
    {
      "indent": 3,
      "text": "In this discussion, we assume that both loss and delay metrics will be reported for network characterization (at least).",
      "ja": "この議論では、我々は両方の損失と遅延のメトリックは、（少なくとも）ネットワークの特性のために報告されることを想定しています。"
    },
    {
      "indent": 3,
      "text": "Assume that packets that do not arrive are reported as lost, usually as a fraction of all sent packets. If these lost packets are assigned an undefined delay, then the network's inability to deliver them (in a timely way) is relegated only in the loss metric when we report statistics on the delay distribution conditioned on the event of packet arrival (within the loss waiting time threshold). We can say that the delay and loss metrics are orthogonal in that they convey non-overlapping information about the network under test. This is a valuable property whose absence is discussed below.",
      "ja": "通常、すべての送信されたパケットの割合として、失われたとして到着しないパケットが報告されているものとします。これらの失われたパケットは、その後、未定義の遅延、（タイムリーな方法で）それらを提供するために、ネットワークのできないことが割り当てられている場合、我々は損失の待機中に（パケット到着のイベントを条件と遅延分布の統計をレポート損失メトリックにのみ追いやられます時間しきい値）。我々は、彼らがテスト中のネットワークに関する、非重複情報を伝えることで遅延や損失指標が直交していると言うことができます。これは、その不在以下で議論される貴重な財産です。"
    },
    {
      "indent": 3,
      "text": "However, if we assign infinite delay to all lost packets, then",
      "ja": "しかし、我々はすべて失われたパケットに無限の遅延を割り当てた場合、その後、"
    },
    {
      "indent": 3,
      "text": "o The delay metric results are influenced both by packets that arrive and those that do not.",
      "ja": "遅延oを計量結果が到着したパケットとそうでないものの両方によって影響されます。"
    },
    {
      "indent": 3,
      "text": "o The delay singleton and the loss singleton do not appear to be orthogonal (delay is finite when loss=0; delay is infinite when loss=1).",
      "ja": "O遅延シングルトンと損失シングルトンが直交するようには見えない（損失= 0のとき、遅延は有限であり、遅延が無限である場合損失= 1）。"
    },
    {
      "indent": 3,
      "text": "o The network is penalized in both the loss and delay metrics, effectively double-counting the lost packets.",
      "ja": "Oネットワークが効果的に失われたパケットをダブルカウントし、損失および遅延の両方のメトリックに献上します"
    },
    {
      "indent": 3,
      "text": "As further evidence of overlap, consider the Cumulative Distribution Function (CDF) of delay when the value \"positive infinity\" is assigned to all lost packets. Figure 3 shows a CDF where a small fraction of packets are lost.",
      "ja": "値「正の無限大は」失われたすべてのパケットに割り当てられたときの重なりのさらなる証拠として、遅延の累積分布関数（CDF）を検討してください。図3は、パケットの小部分が失われCDFを示しています。"
    },
    {
      "indent": 17,
      "text": "1 | - - - - - - - - - - - - - - - - - -+\n  |                                    |\n  |          _..----''''''''''''''''''''\n  |      ,-''\n  |    ,'\n  |   /                         Mass at\n  |  /                          +infinity\n  | /                           = fraction\n  ||                            lost\n  |/\n0 |_____________________________________",
      "raw": true
    },
    {
      "indent": 19,
      "text": "0 Delay +o0",
      "ja": "0ディレイ+ O0"
    },
    {
      "indent": 11,
      "text": "Figure 3: Cumulative Distribution Function for Delay When Loss = +Infinity",
      "ja": "図3：遅延損失= +無限大の累積分布関数"
    },
    {
      "indent": 3,
      "text": "We note that a delay CDF that is conditioned on packet arrival would not exhibit this apparent overlap with loss.",
      "ja": "私たちは、パケット到着時に調整された遅延CDFは損失のこの明らかなオーバーラップを示さないことに注意してください。"
    },
    {
      "indent": 3,
      "text": "Although infinity is a familiar mathematical concept, it is somewhat disconcerting to see any time-related metric reported as infinity. Questions are bound to arise and tend to detract from the goal of informing the consumer with a performance report.",
      "ja": "無限大は、おなじみの数学的な考え方ですが、無限大として報告された時間に関連するメトリックを見るために多少当惑です。質問は生じ、パフォーマンスレポートを消費者に知らせるという目標を損なう傾向があるためにバインドされています。"
    },
    {
      "indent": 0,
      "text": "5.1.3. Delay Variation",
      "section_title": true,
      "ja": "5.1.3。遅延変動"
    },
    {
      "indent": 3,
      "text": "[RFC3393] excludes lost packets from samples, effectively assigning an undefined delay to packets that do not arrive in a reasonable time. Section 4.1 of [RFC3393] describes this specification and its rationale (ipdv = inter-packet delay variation in the quote below).",
      "ja": "[RFC3393]除外を効果的に合理的な時間内に到着しないパケットに未定義の遅延を割り当てる、試料からのパケットを失いました。 [RFC3393]のセクション4.1は、本明細書及びその根拠（以下引用でIPDV =パケット間の遅延変動）について説明します。"
    },
    {
      "indent": 6,
      "text": "The treatment of lost packets as having \"infinite\" or \"undefined\" delay complicates the derivation of statistics for ipdv. Specifically, when packets in the measurement sequence are lost, simple statistics such as sample mean cannot be computed. One possible approach to handling this problem is to reduce the event space by conditioning. That is, we consider conditional statistics; namely we estimate the mean ipdv (or other derivative statistic) conditioned on the event that selected packet pairs arrive at the Destination (within the given timeout). While this itself is not without problems (what happens, for example, when every other packet is lost), it offers a way to make some (valid) statements about ipdv, at the same time avoiding events with undefined outcomes.",
      "ja": "「無限」または「未定義」遅延を持つように失われたパケットの処理がIPDVの統計情報の導出を複雑にしています。測定シーケンス内のパケットが失われたときに具体的に、このようなサンプルの平均値などの簡単な統計情報を計算することができません。この問題を扱うための1つの可能なアプローチは、コンディショニングによってイベントスペースを削減することです。つまり、我々は条件付きの統計を検討します。つまり、私たちは、パケットペアは、（与えられたタイムアウト時間内）目的地に到着し、選択したイベントに条件付け平均IPDV（またはその他の派生統計値）を推定します。これ自体は問題（他のすべてのパケットが失われた場合、例えば、何が起こるか）がないわけではありませんが、それは同時に、未定義の結果とイベントを避け、IPDVに関するいくつかの（有効な）文を作るための方法を提供しています。"
    },
    {
      "indent": 3,
      "text": "We note that the argument above applies to all forms of packet delay variation that can be constructed using the \"selection function\" concept of [RFC3393]. In recent work, the two main forms of delay variation metrics have been compared, and the results are summarized in [RFC5481].",
      "ja": "私たちは、上記の引数は、[RFC3393]の「選択機能」の概念を用いて構築することができるパケット遅延変動のあらゆる形態に適用されることに注意してください。最近の研究では、遅延変動指標の二つの主な形態が比較され、その結果は、[RFC5481]にまとめられています。"
    },
    {
      "indent": 0,
      "text": "5.1.4. Reordering",
      "section_title": true,
      "ja": "5.1.4。並べ替え"
    },
    {
      "indent": 3,
      "text": "[RFC4737] defines metrics that are based on evaluation of packet arrival order and that include a waiting time before declaring that a packet is lost (to exclude the packet from further processing).",
      "ja": "[RFC4737]は、パケットの到着順序の評価に基づいており、（さらなる処理からパケットを除外するために）パケットが失われることを宣言するまでの待機時間が含まれるメトリックを定義します。"
    },
    {
      "indent": 3,
      "text": "If packets are assigned a delay value, then the reordering metric would declare any packets with infinite delay to be reordered, because their sequence numbers will surely be less than the \"Next Expected\" threshold when (or if) they arrive. But this practice would fail to maintain orthogonality between the reordering metric and the loss metric. Confusion can be avoided by designating the delay of non-arriving packets as undefined and reserving delay values only for packets that arrive within a sufficiently long waiting time.",
      "ja": "パケットが遅延値を割り当てられている場合は、並べ替えメトリックは（または場合）が届いたとき、そのシーケンス番号が確実に「次に予想される」閾値未満となりますので、並べ替えられるために無限の遅延で任意のパケットを宣言します。しかし、このような行為は、並べ替えメトリックと損失メトリック間の直交性を維持するために失敗します。混乱は、十分に長い待機時間内に到着するパケットの未定義と予約遅延値などの非到着パケットの遅延を指定することによって回避することができます。"
    },
    {
      "indent": 0,
      "text": "5.2. Preferred Statistics",
      "section_title": true,
      "ja": "5.2。優先統計"
    },
    {
      "indent": 3,
      "text": "Today in network characterization, the sample mean is one statistic that is almost ubiquitously reported. It is easily computed and understood by virtually everyone in this audience category. Also, the sample is usually filtered on packet arrival, so that the mean is based on a conditional distribution.",
      "ja": "今日のネットワークの特性で、標本平均は、ほぼ普遍的に報告された1つの統計があります。これは、簡単に計算して、この視聴者のカテゴリーのほぼ全員が理解されます。平均値が条件付き分布に基づいているように、また、試料は、通常、パケット到着時に濾過します。"
    },
    {
      "indent": 3,
      "text": "The median is another statistic that summarizes a distribution, having somewhat different properties from the sample mean. The median is stable in distributions with a few outliers or without them. However, the median's stability prevents it from indicating when a large fraction of the distribution changes value. 50% or more values would need to change for the median to capture the change.",
      "ja": "中央値は、サンプルの平均から幾分異なる特性を有する、分布を要約する別の統計です。中央値は、いくつかの外れ値としたりすることなく、ディストリビューションに安定しています。しかし、中央値の安定性は、分布の大部分が値を変更するときを示すのを防ぎます。 50％以上の値が変更をキャプチャするために中央値に変更する必要があります。"
    },
    {
      "indent": 3,
      "text": "Both the median and sample mean have difficulty with bimodal distributions. The median will reside in only one of the modes, and the mean may not lie in either mode range. For this and other reasons, additional statistics such as the minimum, maximum, and 95th percentile have value when summarizing a distribution.",
      "ja": "中央値とサンプルの両方が二峰性の分布との難しさを持っている意味します。中央値は、一つだけのモードに常駐し、平均値は、いずれかのモードの範囲内にない場合があります。分布を要約すると、この及び他の理由のために、そのような最小値、最大値、および95パーセンタイルのような追加の統計値を有しています。"
    },
    {
      "indent": 3,
      "text": "When both the sample mean and median are available, a comparison will sometimes be informative, because these two statistics are equal only under unusual circumstances, such as when the delay distribution is perfectly symmetrical.",
      "ja": "サンプルの平均および中央値の両方が利用可能である場合にこれらの二つの統計のみ、そのような遅延分布が完全に対称である場合など、異常な状況下で等しいので、比較は、時々、有益であろう。"
    },
    {
      "indent": 3,
      "text": "Also, these statistics are generally useful from the application performance POV, so there is a common set that should satisfy audiences.",
      "ja": "また、これらの統計は、アプリケーションのパフォーマンスのPOVから一般的に有用なので、観客を満足させなければならない一般的なセットがあります。"
    },
    {
      "indent": 3,
      "text": "Plots of the delay distribution may also be useful when single-value statistics indicate that new conditions are present. An empirically derived probability distribution function will usually describe multiple modes more efficiently than any other form of result.",
      "ja": "単一値の統計情報は、新しい条件が存在することを示す場合、遅延分布のプロットもまた有用であり得ます。経験的に導出された確率分布関数は、通常、複数のモードよりも効率的に結果の任意の他の形態を説明します。"
    },
    {
      "indent": 0,
      "text": "5.3. Summary for Delay",
      "section_title": true,
      "ja": "5.3。遅延のための概要"
    },
    {
      "indent": 3,
      "text": "From the perspectives of",
      "ja": "の観点から、"
    },
    {
      "indent": 3,
      "text": "1. application/receiver analysis, where subsequent processing depends on whether the packet arrives or times out,",
      "ja": "その後の処理は、パケットが到着して又は回かに依存1.アプリケーション/レシーバ分析、"
    },
    {
      "indent": 3,
      "text": "2. straightforward network characterization without double-counting defects, and",
      "ja": "ダブルカウント欠陥のない2.簡単なネットワークの特性、および"
    },
    {
      "indent": 3,
      "text": "3. consistency with delay variation and reordering metric definitions,",
      "ja": "3.遅延変動や並べ替えメトリックの定義との整合性、"
    },
    {
      "indent": 3,
      "text": "the most efficient practice is to distinguish between packets that are truly lost and those that are delayed packets with a sufficiently long waiting time, and to designate the delay of non-arriving packets as undefined.",
      "ja": "最も効率的な練習は本当に失われたパケットと十分に長い待ち時間のパケットを遅らせているものを区別するために、および未定義などの非到着するパケットの遅延を指定することです。"
    },
    {
      "indent": 0,
      "text": "6. Reporting Raw Capacity Metrics",
      "section_title": true,
      "ja": "6.生の容量のメトリックを報告"
    },
    {
      "indent": 3,
      "text": "Raw capacity refers to the metrics defined in [RFC5136], which do not include restrictions such as data uniqueness or flow-control response to congestion.",
      "ja": "生能力は、データの一意性又は輻輳フロー制御応答として制限を含まない[RFC5136]で定義されたメトリックを指します。"
    },
    {
      "indent": 3,
      "text": "The metrics considered are IP-layer capacity, utilization (or used capacity), and available capacity, for individual links and complete paths. These three metrics form a triad: knowing one metric constrains the other two (within their allowed range), and knowing two determines the third. The link metrics have another key aspect in common: they are single-measurement-point metrics at the egress of a link. The path capacity and available capacity are derived by examining the set of single-point link measurements and taking the minimum value.",
      "ja": "考えメトリックは、個々のリンクとの完全なパスのため、IP層の容量、利用率（または使用容量）であり、使用可能な容量。これら三つのメトリックは、トライアドを形成する：1つのメトリックを知ること（その許容範囲内で）他の二つを制約し、2つを知ること三分の一を決定します。リンクメトリックは共通で別の重要な側面を持っている：彼らは、リンクの出口での単一の測定点の測定基準です。パス容量と利用可能容量は、シングルポイント・リンク測定値のセットを調べ、最小値をとることによって導出されます。"
    },
    {
      "indent": 0,
      "text": "6.1. Type-P Parameter",
      "section_title": true,
      "ja": "6.1。タイプPパラメータ"
    },
    {
      "indent": 3,
      "text": "The concept of \"packets of Type-P\" is defined in [RFC2330]. The Type-P categorization has critical relevance in all forms of capacity measurement and reporting. The ability to categorize packets based on header fields for assignment to different queues and scheduling mechanisms is now commonplace. When unused resources are shared across queues, the conditions in all packet categories will affect capacity and related measurements. This is one source of variability in the results that all audiences would prefer to see reported in a useful and easily understood way.",
      "ja": "「タイプPのパケット」の概念は、[RFC2330]で定義されています。タイプPの分類は、容量の測定および報告のすべての形態の重要な関連性を持っています。異なるキューおよびスケジューリングメカニズムへの割り当てのためのヘッダフィールドに基づいてパケットを分類する能力は、今や一般的です。未使用のリソースは、キュー間で共有されている場合は、すべてのパケットのカテゴリの条件は、容量および関連の測定に影響を与えます。これは、すべての観客が有用で報告し、簡単な方法を理解見ることを好む結果のばらつきの一つのソースです。"
    },
    {
      "indent": 3,
      "text": "Communication of Type-P within the One-Way Active Measurement Protocol (OWAMP) and the Two-Way Active Measurement Protocol (TWAMP) is essentially confined to the Diffserv Code Point (DSCP) [RFC4656]. DSCP is the most common qualifier for Type-P.",
      "ja": "ワンウェイアクティブな測定プロトコル（OWAMP）および双方向アクティブ測定プロトコル（TWAMP）内のタイプPの通信は、本質的にDiffservのコードポイント（DSCP）[RFC4656]に制限されます。 DSCPは、Type-Pのための最も一般的な修飾子です。"
    },
    {
      "indent": 3,
      "text": "Each audience will have a set of Type-P qualifications and value combinations that are of interest. Measurements and reports should have the flexibility to report per-type and aggregate performance.",
      "ja": "各オーディエンスは、関心のあるタイプ-P資格と値の組み合わせのセットを持っています。測定とレポートがあたりの型および集計のパフォーマンスを報告する柔軟性を持っている必要があります。"
    },
    {
      "indent": 0,
      "text": "6.2. A priori Factors",
      "section_title": true,
      "ja": "6.2。演繹的要因"
    },
    {
      "indent": 3,
      "text": "The audience for network characterization may have detailed information about each link that comprises a complete path (due to ownership, for example), or some of the links in the path but not others, or none of the links.",
      "ja": "ネットワークの特性のための視聴者は、（例えば、所有権に起因する）の完全なパスを構成する各リンクについての詳細な情報を持っている、またはパス内のリンクではなく、他の、またはリンクのいずれの一部もよいです。"
    },
    {
      "indent": 3,
      "text": "There are cases where the measurement audience only has information on one of the links (the local access link) and wishes to measure one or more of the raw capacity metrics. This scenario is quite common and has spawned a substantial number of experimental measurement methods (e.g., http://www.caida.org/tools/taxonomy/). Many of these methods respect that their users want a result fairly quickly and in one trial. Thus, the measurement interval is kept short (a few seconds to a minute). For long-term reporting, a sample of short-term results needs to be summarized.",
      "ja": "測定観客はリンクのみの1（ローカルアクセスリンク）の情報を持っており、生の容量のメトリックの1つまたは複数を測定したい場合があります。このシナリオでは、非常に一般的であり、実験的測定法（例えば、http://www.caida.org/tools/taxonomy/）のかなりの数を生み出しました。これらの方法の多くは、そのユーザーはかなり迅速かつ1件の試験で結果を望んでいることを尊重しています。このように、測定間隔を（分の数秒）短く保たれます。長期的な報告のために、短期的な結果のサンプルを要約する必要があります。"
    },
    {
      "indent": 0,
      "text": "6.3. IP-Layer Capacity",
      "section_title": true,
      "ja": "6.3。 IP-重層容量"
    },
    {
      "indent": 3,
      "text": "For links, this metric's theoretical maximum value can be determined from the physical-layer bit rate and the bit rate reduction due to the layers between the physical layer and IP. When measured, this metric takes additional factors into account, such as the ability of the sending device to process and forward traffic under various conditions. For example, the arrival of routing updates may spawn high-priority processes that reduce the sending rate temporarily.",
      "ja": "リンクについては、このメトリックの理論上の最大値は、物理層のビットレートと物理層との間のIP層に起因するビットレートの減少から決定することができます。測定された場合、このメトリックは、様々な条件下でトラフィックを処理し、転送する送信装置の能力として、アカウントに追加の因子を取ります。例えば、ルーティング更新の到着は、一時的に送信レートを低下させる優先度の高いプロセスを生成してもよいです。"
    },
    {
      "indent": 3,
      "text": "Thus, the measured capacity of a link will be variable, and the maximum capacity observed applies to a specific time, time interval, and other relevant circumstances.",
      "ja": "したがって、リンクの測定された容量が可変となり、観察された最大容量は、特定の時間、時間間隔、および他の関連する状況にも適用されます。"
    },
    {
      "indent": 3,
      "text": "For paths composed of a series of links, it is easy to see how the sources of variability for the results grow with each link in the path. Variability of results will be discussed in more detail below.",
      "ja": "一連のリンクで構成パスの場合、結果のための変動のソースはパス内の各リンクに育つかを確認することは容易です。結果の変動性は、以下でより詳細に説明します。"
    },
    {
      "indent": 0,
      "text": "6.4. IP-Layer Utilization",
      "section_title": true,
      "ja": "6.4。 IPレイヤの活用"
    },
    {
      "indent": 3,
      "text": "The ideal metric definition of link utilization [RFC5136] is based on the actual usage (bits successfully received during a time interval) and the maximum capacity for the same interval.",
      "ja": "リンク利用率[RFC5136]の理想的なメトリックの定義は、実際の使用状況（ビットが正常に時間間隔中に受信した）と同じ間隔の最大容量に基づいています。"
    },
    {
      "indent": 3,
      "text": "In practice, link utilization can be calculated by counting the IP-layer (or other layer) octets received over a time interval and dividing by the theoretical maximum number of octets that could have been delivered in the same interval. A commonly used time interval is 5 minutes, and this interval has been sufficient to support network operations and design for some time. 5 minutes is somewhat long compared with the expected download time for web pages but short with respect to large file transfers and TV program viewing. It is fair to say that considerable variability is concealed by reporting a single (average) utilization value for each 5-minute interval. Some performance management systems have begun to make 1-minute averages available.",
      "ja": "実際には、リンク利用はオクテット時間間隔にわたって受信されたIP-層（または他の層）をカウントし、同じ間隔で配信されている可能性がオクテットの理論上の最大数で割ることによって計算することができます。一般的に使用される時間間隔は5分であり、この間隔は、いくつかの時間のために、ネットワークの運用と設計をサポートするのに十分なされています。 5分はやや長い予想されるダウンロードWebページのための時間が、大容量のファイル転送やテレビ番組の視聴に関して短いと比較されます。かなりのばらつきが各5分間隔のための単一の（平均）の利用価値を報告することによって隠されていると言うことは公正です。いくつかのパフォーマンス管理システムは、1分間の平均値を利用できるようにし始めています。"
    },
    {
      "indent": 3,
      "text": "There is also a limit on the smallest useful measurement interval. Intervals on the order of the serialization time for a single Maximum Transmission Unit (MTU) packet will observe on/off behavior and report 100% or 0%. The smallest interval needs to be some multiple of MTU serialization time for averaging to be effective.",
      "ja": "最小の便利な測定間隔の制限もあります。単一の最大伝送ユニット（MTU）パケットの直列化時間程度の間隔は/オフ動作を上観察し、100％または0％を報告します。最小間隔は、有効であるために平均化するMTUシリアル化時間の倍数である必要があります。"
    },
    {
      "indent": 0,
      "text": "6.5. IP-Layer Available Capacity",
      "section_title": true,
      "ja": "6.5。 IPレイヤ空き容量"
    },
    {
      "indent": 3,
      "text": "The available capacity of a link can be calculated using the capacity and utilization metrics.",
      "ja": "リンクの利用可能な容量は、容量と使用率メト​​リックを使用して計算することができます。"
    },
    {
      "indent": 3,
      "text": "When available capacity of a link or path is estimated through some measurement technique, the following parameters should be reported:",
      "ja": "リンクまたはパスの利用可能容量は、いくつかの測定手法により推定されたときに、以下のパラメータが報告されるべきです。"
    },
    {
      "indent": 3,
      "text": "o Name and reference to the exact method of measurement",
      "ja": "O名と測定の正確な方法を参照"
    },
    {
      "indent": 3,
      "text": "o IP packet length, octets (including IP header)",
      "ja": "（IPヘッダーを含む）O IPパケット長、オクテット"
    },
    {
      "indent": 3,
      "text": "o Maximum capacity that can be assessed in the measurement configuration",
      "ja": "測定設定で評価することができるO定員"
    },
    {
      "indent": 3,
      "text": "o Time duration of the measurement",
      "ja": "測定のO継続時間"
    },
    {
      "indent": 3,
      "text": "o All other parameters specific to the measurement method",
      "ja": "測定方法に固有の他のすべてのパラメータO"
    },
    {
      "indent": 3,
      "text": "Many methods of available capacity measurement have a maximum capacity that they can measure, and this maximum may be less than the actual available capacity of the link or path. Therefore, it is important to know the capacity value beyond which there will be no measured improvement.",
      "ja": "利用可能な容量測定の多くの方法は、それらが測定できる最大容量を有しており、この最大値は、リンクまたはパスの実際の使用可能容量未満であってもよいです。したがって、測定の改善は存在しませんそれを超える容量値を知ることが重要です。"
    },
    {
      "indent": 3,
      "text": "The application performance estimation audience may have a desired target capacity value and simply wish to assess whether there is sufficient available capacity. This case simplifies the measurement of link and path capacity to some degree, as long as the measurable maximum exceeds the target capacity.",
      "ja": "アプリケーションのパフォーマンス推定観客は、所望の目標容量値を持っており、単純に十分な空き容量があるかどうかを評価することを望むかもしれません。この場合であれば測定可能な最大の目標容量を超えるように、ある程度リンク及びパス容量の測定を簡略化します。"
    },
    {
      "indent": 0,
      "text": "6.6. Variability in Utilization and Available Capacity",
      "section_title": true,
      "ja": "6.6。利用と利用可能な容量の変動"
    },
    {
      "indent": 3,
      "text": "As with most metrics and measurements, assessing the consistency or variability in the results gives the user an intuitive feel for the degree (or confidence) that any one value is representative of other results, or the spread of the underlying distribution of the singleton measurements.",
      "ja": "最も指標と測定結果の一貫性やばらつきを評価する場合と同様に、ユーザにいずれかの値が他の結果の代表的な、またはシングルトン測定の基礎となる分布の広がりであること度（または信頼）のための直感的な感じを与えます。"
    },
    {
      "indent": 3,
      "text": "How can utilization be measured and summarized to describe the potential variability in a useful way?",
      "ja": "どのように利用率が測定され、有用な方法で潜在的な変動を記述するためにまとめることができますか？"
    },
    {
      "indent": 3,
      "text": "How can the variability in available capacity estimates be reported, so that the confidence in the results is also conveyed?",
      "ja": "結果の信頼性も搬送されるように、利用可能容量推定値の変動が、どのように報告することができますか？"
    },
    {
      "indent": 3,
      "text": "We suggest some methods below.",
      "ja": "私たちは、以下のいくつかの方法を提案します。"
    },
    {
      "indent": 0,
      "text": "6.6.1. General Summary of Variability",
      "section_title": true,
      "ja": "6.6.1。変動の一般的な概要"
    },
    {
      "indent": 3,
      "text": "With a set of singleton utilization or available capacity estimates, each representing a time interval needed to ascertain the estimate, we seek to describe the variation over the set of singletons as though reporting summary statistics of a distribution. Three useful summary statistics are",
      "ja": "シングルトンの利用または利用可能な容量の推定値のセットでは、各推定値を確認するために必要な時間間隔を表す、我々は、分布の要約統計量を報告しているかのようにシングルトンのセットでバリエーションを記述しようとしています。便利な3つの要約統計量は、"
    },
    {
      "indent": 3,
      "text": "o Minimum,",
      "ja": "最小O、"
    },
    {
      "indent": 3,
      "text": "o Maximum, and",
      "ja": "O最大、および"
    },
    {
      "indent": 3,
      "text": "o Range",
      "ja": "お らんげ"
    },
    {
      "indent": 3,
      "text": "An alternate way to represent the range is as a ratio of maximum to minimum value. This enables an easily understandable statistic to describe the range observed. For example, when maximum = 3*minimum, then the max/min ratio is 3, and users may see variability of this order. On the other hand, capacity estimates with a max/min ratio near 1 are quite consistent and near the central measure or statistic reported.",
      "ja": "範囲を表現する別の方法は、最小値と最大値の比としてあります。これは、観察された範囲を説明するための分かりやすい統計を可能にします。例えば、最大= 3 *の最小値は、その後、最大/最小比は3であり、ユーザはこの程度の変動性を見ることができます。一方、1に近い最大/最小比容量の推定値は非常に一貫して報告された中央の尺度又は統計近くにあります。"
    },
    {
      "indent": 3,
      "text": "For an ongoing series of singleton estimates, a moving average of n estimates may provide a single value estimate to more easily distinguish substantial changes in performance over time. For example, in a window of n singletons observed in time interval t, a percentage change of x% is declared to be a substantial change and reported as an exception.",
      "ja": "シングルトン推定の継続的な一連のために、n個の推定の移動平均は、より容易に、経時的性能における実質的な変化を区別するために単一の値の見積もりを提供することができます。例えば、時間間隔tで観察されたN個のシングルトンのウィンドウ内に、X％の変化率は、実質的な変化であると宣言され、例外として報告されました。"
    },
    {
      "indent": 3,
      "text": "Often, the most informative summary of the results is a two-axis plot rather than a table of statistics, where time is plotted on the x-axis and the singleton value on the y-axis. The time-series plot can illustrate sudden changes in an otherwise stable range, identify bi-modality easily, and help quickly assess correlation with other time-series. Plots of frequency of the singleton values are likewise useful tools to visualize the variation.",
      "ja": "多くの場合、結果の最も有益な要約は、二軸プロットではなく、時間がx軸とy軸上のシングルトン値にプロットされている統計情報の表です。時系列プロットは、そうでない場合は安定した範囲で急激な変化を示して簡単に双方向モダリティを特定し、他の時系列との相関を評価する迅速助けることができます。シングルトン値の周波数のプロットは、同様の変化を可視化するための便利なツールです。"
    },
    {
      "indent": 0,
      "text": "7. Reporting Restricted Capacity Metrics",
      "section_title": true,
      "ja": "7.報告制限容量のメトリック"
    },
    {
      "indent": 3,
      "text": "Restricted capacity refers to the metrics defined in [RFC3148], which include criteria of data uniqueness or flow-control response to congestion.",
      "ja": "制限された容量は、データの一意性又は輻輳フロー制御応答の基準を含む[RFC3148]で定義されたメトリックを指します。"
    },
    {
      "indent": 3,
      "text": "One primary metric considered is Bulk Transfer Capacity (BTC) for complete paths. [RFC3148] defines BTC as",
      "ja": "考える一つの主要なメトリックは、完全なパスのバルク転送容量（BTC）です。 [RFC3148]はBTCなどを定義します"
    },
    {
      "indent": 6,
      "text": "BTC = data_sent / elapsed_time",
      "ja": "BTC = data_sent /のelapsed_time"
    },
    {
      "indent": 3,
      "text": "for a connection with congestion-aware flow control, where data_sent is the total number of unique payload bits (no headers).",
      "ja": "data_sentは、固有のペイロード・ビット（NOヘッダ）の総数である渋滞対応フロー制御、と接続するため。"
    },
    {
      "indent": 3,
      "text": "We note that this definition *differs* from the raw capacity definition in Section 2.3.1 of [RFC5136], where IP-layer capacity *includes* all bits in the IP header and payload. This means that restricted capacity BTC is already operating at a disadvantage when compared to the raw capacity at layers below TCP. Further, there are cases where one IP layer is encapsulated in another IP layer or other form of tunneling protocol, designating more and more of the fundamental transport capacity as header bits that are pure overhead to the BTC measurement.",
      "ja": "我々は、この定義*はIP層容量は* IPヘッダとペイロード内のすべてのビットを含む[RFC5136]のセクション2.3.1に生容量定義から*異なることに注意してください。これは、TCP下の層で、生の容量と比較して、制限容量BTCはすでに不利で動作していることを意味します。さらに、あるIP層はBTC測定に純粋なオーバーヘッドであるヘッダビットと基本的な輸送能力のより多くを指定し、別のIP層又はトンネリングプロトコルの他の形態で封入されている場合があります。"
    },
    {
      "indent": 3,
      "text": "We also note that raw and restricted capacity metrics are not orthogonal in the sense defined in Section 5.1.2 above. The information they convey about the network under test is certainly overlapping, but they reveal two different and important aspects of performance.",
      "ja": "我々はまた、生と制限された容量のメトリックは、上記の5.1.2項で定義された意味での直交していないことに注意してください。彼らはテスト中のネットワークについて伝える情報は確かに重複しているが、彼らは、パフォーマンスの2つの異なる重要な側面を明らかにしました。"
    },
    {
      "indent": 3,
      "text": "When thinking about the triad of raw capacity metrics, BTC is most akin to the \"IP-Type-P Available Path Capacity\", at least in the eyes of a network user who seeks to know what transmission performance a path might support.",
      "ja": "RAW容量指標のトライアドについて考えるとき、BTCは、少なくともパスをサポートする場合がありますどのような伝送性能を知るしようとするネットワークユーザの目には、「IP-タイプ-P使用可能なパスの容量」に最も似ています。"
    },
    {
      "indent": 0,
      "text": "7.1. Type-P Parameter and Type-C Parameter",
      "section_title": true,
      "ja": "7.1。タイプPパラメータおよびタイプCパラメータ"
    },
    {
      "indent": 3,
      "text": "The concept of \"packets of Type-P\" is defined in [RFC2330]. The considerations for restricted capacity are identical to the raw capacity section on this topic, with the addition that the various fields and options in the TCP header must be included in the description.",
      "ja": "「タイプPのパケット」の概念は、[RFC2330]で定義されています。制限された容量のための考慮事項は、TCPヘッダ内の様々なフィールドとオプションが記述に含まれなければならないことを添加し、このトピックに関する生の容量部と同一です。"
    },
    {
      "indent": 3,
      "text": "The vast array of TCP flow-control options are not well captured by Type-P, because they do not exist in the TCP header bits. Therefore, we introduce a new notion here: TCP Configuration of \"Type-C\". The elements of Type-C describe all of the settings for TCP options and congestion control algorithm variables, including the main form of congestion control in use. Readers should consider the parameters and variables of [RFC3148] and [RFC6349] when constructing Type-C.",
      "ja": "それらはTCPヘッダービットに存在しないため、TCPフロー制御オプションの広大な配列はよく、タイプPによって捕捉されません。 TCP設定の「タイプC」の：そのため、私たちはここに新しい概念を導入します。タイプCの要素は、使用中の輻輳制御のメインフォームを含むTCPオプションと輻輳制御アルゴリズム変数の設定のすべてを記載します。読者は[RFC3148]と[RFC6349]の構築タイプCのパラメータと変数を考慮すべきです。"
    },
    {
      "indent": 0,
      "text": "7.2. A Priori Factors",
      "section_title": true,
      "ja": "7.2。プリオリ要因"
    },
    {
      "indent": 3,
      "text": "The audience for network characterization may have detailed information about each link that comprises a complete path (due to ownership, for example), or some of the links in the path but not others, or none of the links.",
      "ja": "ネットワークの特性のための視聴者は、（例えば、所有権に起因する）の完全なパスを構成する各リンクについての詳細な情報を持っている、またはパス内のリンクではなく、他の、またはリンクのいずれの一部もよいです。"
    },
    {
      "indent": 3,
      "text": "There are cases where the measurement audience only has information on one of the links (the local access link) and wishes to measure one or more BTC metrics. The discussion in Section 6.2 applies here as well.",
      "ja": "測定観客はリンクのみの1（ローカルアクセスリンク）の情報を持っており、一つ以上のBTCのメトリックを測定したい場合があります。 6.2節での議論はここにも適用されます。"
    },
    {
      "indent": 0,
      "text": "7.3. Measurement Interval",
      "section_title": true,
      "ja": "7.3。測定間隔"
    },
    {
      "indent": 3,
      "text": "There are limits on a useful measurement interval for BTC. Three factors that influence the interval duration are listed below:",
      "ja": "BTCのための便利な測定間隔の制限があります。インターバル期間に影響を与える3つの要因が、以下に記載されています："
    },
    {
      "indent": 3,
      "text": "1. Measurements may choose to include or exclude the 3-way handshake of TCP connection establishment, which requires at least 1.5 * RTT (round-trip time) and contains both the delay of the path and the host processing time for responses. However, user experience includes the 3-way handshake for all new TCP connections.",
      "ja": "1.測定は少なくとも1.5 * RTT（ラウンドトリップ時間）を必要とするTCP接続確立の3ウェイハンドシェイクを、含めるか除外するかを選択してパスの遅延と応答のためにホスト処理時間の両方を含むことができます。しかし、ユーザーエクスペリエンスは、すべての新しいTCP接続のための3ウェイハンドシェイクが含まれています。"
    },
    {
      "indent": 3,
      "text": "2. Measurements may choose to include or exclude Slow-Start, preferring instead to focus on a portion of the transfer that represents \"equilibrium\" (which needs to be defined for particular circumstances if used). However, user experience includes the Slow-Start for all new TCP connections.",
      "ja": "2.測定は、（使用される場合、特定の状況のた​​めに定義する必要があります）、「均衡」を表す転送の部分に集中する代わりに好む、スロースタートを含めるか除外するかを選択することができます。しかし、ユーザーエクスペリエンスは、すべての新しいTCP接続のためのスロースタートが含まれています。"
    },
    {
      "indent": 3,
      "text": "3. Measurements may choose to use a fixed block of data to transfer, where the size of the block has a relationship to the file size of the application of interest. This approach yields variable size measurement intervals, where a path with faster BTC is measured for less time than a path with slower BTC, and this has implications when path impairments are time-varying, or transient. Users are likely to turn their immediate attention elsewhere when a very large file must be transferred; thus, they do not directly experience such a long transfer -- they see the result (success or failure) and possibly an objective measurement of the transfer time (which will likely include the 3-way handshake, Slow-Start, and application file management processing time as well as the BTC).",
      "ja": "3.測定は、ブロックのサイズは、対象のアプリケーションのファイルサイズとの関係を有する場合、転送するデータの固定ブロックを使用することを選択することができます。このアプローチは、より高速BTCのパスが遅いBTCのパスよりも短い時間で測定される可変サイズの測定間隔をもたらし、パス障害が時間的に変化する、または一過性である場合、これは意味を有しています。非常に大きなファイルを転送しなければならない場合、ユーザーは他の場所で彼らの即時の注意を向ける可能性があります。このように、彼らは直接、このような長い転送を経験していない - 彼らはおそらく結果（成功または失敗）と転送時間の客観的な測定を（おそらく3ウェイハンドシェイク、スロースタート、およびアプリケーションファイルの管理が含まれる参照します処理時間だけでなく、BTC）。"
    },
    {
      "indent": 3,
      "text": "Individual measurement intervals may be short or long, but there is a need to report the results on a long-term basis that captures the BTC variability experienced between each interval. Consistent BTC is a valuable commodity along with the value attained.",
      "ja": "個々の測定間隔が短いか長いかもしれませんが、各インターバルの間に経験BTCの変動を捉え長期的に結果を報告する必要があります。一貫性のあるBTCは達成値と一緒に貴重な商品です。"
    },
    {
      "indent": 0,
      "text": "7.4. Bulk Transfer Capacity Reporting",
      "section_title": true,
      "ja": "7.4。バルク転送能力レポート"
    },
    {
      "indent": 3,
      "text": "When BTC of a link or path is estimated through some measurement technique, the following parameters should be reported:",
      "ja": "リンクまたはパスのBTCは、いくつかの測定手法により推定されたときに、以下のパラメータが報告されるべきです。"
    },
    {
      "indent": 3,
      "text": "o Name and reference to the exact method of measurement",
      "ja": "O名と測定の正確な方法を参照"
    },
    {
      "indent": 3,
      "text": "o Maximum Transmission Unit (MTU)",
      "ja": "O最大伝送単位（MTU）"
    },
    {
      "indent": 3,
      "text": "o Maximum BTC that can be assessed in the measurement configuration",
      "ja": "測定設定で評価することができる最大BTC O"
    },
    {
      "indent": 3,
      "text": "o Time and duration of the measurement o Number of BTC connections used simultaneously",
      "ja": "O時間と同時に使用BTC接続の測定O数の期間"
    },
    {
      "indent": 3,
      "text": "o *All* other parameters specific to the measurement method, especially the congestion control algorithm in use",
      "ja": "測定方法に固有のO *全て*他のパラメータ、使用中、特に輻輳制御アルゴリズム"
    },
    {
      "indent": 3,
      "text": "See also [RFC6349].",
      "ja": "また、[RFC6349]を参照してください。"
    },
    {
      "indent": 3,
      "text": "Many methods of BTC measurement have a maximum capacity that they can measure, and this maximum may be less than the available capacity of the link or path. Therefore, it is important to specify the measured BTC value beyond which there will be no measured improvement.",
      "ja": "BTC測定の多くの方法は、それらが測定できる最大容量を有しており、この最大値は、リンクまたはパスの利用可能な容量未満であってもよいです。したがって、測定の改善は行われません、それを超える測定BTC値を指定することが重要です。"
    },
    {
      "indent": 3,
      "text": "The application performance estimation audience may have a desired target capacity value and simply wish to assess whether there is sufficient BTC. This case simplifies the measurement of link and path capacity to some degree, as long as the measurable maximum exceeds the target capacity.",
      "ja": "アプリケーションのパフォーマンス推定観客は、所望の目標容量値を持っており、単に十分BTCがあるかどうかを評価することを望むかもしれません。この場合であれば測定可能な最大の目標容量を超えるように、ある程度リンク及びパス容量の測定を簡略化します。"
    },
    {
      "indent": 0,
      "text": "7.5. Variability in Bulk Transfer Capacity",
      "section_title": true,
      "ja": "7.5。バルク転送容量の変動"
    },
    {
      "indent": 3,
      "text": "As with most metrics and measurements, assessing the consistency or variability in the results gives the user an intuitive feel for the degree (or confidence) that any one value is representative of other results, or the underlying distribution from which these singleton measurements have come.",
      "ja": "最も指標と測定結果の一貫性やばらつきを評価する場合と同様に、ユーザにいずれかの値が他の結果の代表的な、又はこれらシングルトン測定が来ているから、基礎となる分布であること度（または信頼）のための直感的な感じを与えます。"
    },
    {
      "indent": 3,
      "text": "With two questions looming --",
      "ja": "二つの質問が迫り来ると - "
    },
    {
      "indent": 3,
      "text": "1. What ways can BTC be measured and summarized to describe the potential variability in a useful way?",
      "ja": "1.どのような方法BTCを測定すると、便利な方法で潜在的な変動を記述するためにまとめることができますか？"
    },
    {
      "indent": 3,
      "text": "2. How can the variability in BTC estimates be reported, so that the confidence in the results is also conveyed?",
      "ja": "結果の信頼性をも搬送されるように2がどのようにBTC見積りの変動は、報告することができますか？"
    },
    {
      "indent": 3,
      "text": "-- we suggest the methods listed in Section 6.6.1 above, and the additional results presentations given in [RFC6349].",
      "ja": " - 私たちは、上記セクション6.6.1に記載された方法、および[RFC6349]で与えられた追加の結果発表を示唆しています。"
    },
    {
      "indent": 0,
      "text": "8. Reporting on Test Streams and Sample Size",
      "section_title": true,
      "ja": "8.テストストリーム上のレポートとサンプルサイズ"
    },
    {
      "indent": 3,
      "text": "This section discusses two key aspects of measurement that are sometimes omitted from the report: the description of the test stream on which the measurements are based, and the sample size.",
      "ja": "測定の基礎となるテストストリームの記述、及びサンプルサイズ：このセクションでは、時々レポートから省略されている測定の二つの重要な側面を説明します。"
    },
    {
      "indent": 0,
      "text": "8.1. Test Stream Characteristics",
      "section_title": true,
      "ja": "8.1。テストストリーム特性"
    },
    {
      "indent": 3,
      "text": "Network characterization has traditionally used Poisson-distributed inter-packet spacing, as this provides an unbiased sample. The average inter-packet spacing may be selected to allow observation of specific network phenomena. Other test streams are designed to sample some property of the network, such as the presence of congestion, link bandwidth, or packet reordering.",
      "ja": "これは公正なサンプルを提供するようにネットワークの特性は、伝統的に、ポアソン分布パケット間間隔を使用してきました。平均のパケット間間隔は、特定のネットワーク現象の観察を可能にするように選択することができます。他のテストストリームは、輻輳、リンクの帯域幅、またはパケットの並べ替えが存在するように、ネットワークのいくつかの性質をサンプリングするように設計されています。"
    },
    {
      "indent": 3,
      "text": "If measuring a network in order to make inferences about applications or receiver performance, then there are usually efficiencies derived from a test stream that has similar characteristics to the sender. In some cases, it is essential to synthesize the sender stream, as with BTC estimates. In other cases, it may be sufficient to sample with a \"known bias\", e.g., a Periodic stream to estimate real-time application performance.",
      "ja": "アプリケーションまたはレシーバ性能に関する推論を行うためにネットワークを測定する場合、送信側と同様の特性を有するテストストリームに由来する効率が通常存在します。いくつかのケースでは、BTCの見積りと同様に、送信者のストリームを合成することが不可欠です。他の場合には、リアルタイムアプリケーションのパフォーマンスを推定するために、例えば、「既知のバイアス」の周期ストリームをサンプリングするために十分であり得ます。"
    },
    {
      "indent": 0,
      "text": "8.2. Sample Size",
      "section_title": true,
      "ja": "8.2。サンプルサイズ"
    },
    {
      "indent": 3,
      "text": "Sample size is directly related to the accuracy of the results and plays a critical role in the report. Even if only the sample size (in terms of number of packets) is given for each value or summary statistic, it imparts a notion of the confidence in the result.",
      "ja": "サンプルサイズは、結果の精度に直接関係すると報告書に重要な役割を果たしています。 （パケットの数の点で）のみのサンプルサイズは、各値または要約統計量のために与えられているとしても、それは結果の信頼性の概念を与えます。"
    },
    {
      "indent": 3,
      "text": "In practice, the sample size will be selected taking both statistical and practical factors into account. Among these factors are the following:",
      "ja": "実際には、サンプルサイズを考慮に統計的かつ実用的な要因を取って選択されます。これらの要因は、次のものがあります"
    },
    {
      "indent": 3,
      "text": "1. The estimated variability of the quantity being measured.",
      "section_title": true,
      "ja": "1.量の推定変動が測定されます。"
    },
    {
      "indent": 3,
      "text": "2. The desired confidence in the result (although this may be dependent on assumption of the underlying distribution of the measured quantity).",
      "ja": "2.結果において所望の信頼度（これは、測定量の基礎となる分布の仮定に依存してもよいです）。"
    },
    {
      "indent": 3,
      "text": "3. The effects of active measurement traffic on user traffic.",
      "section_title": true,
      "ja": "ユーザトラフィック上のアクティブな測定トラフィックの3効果。"
    },
    {
      "indent": 3,
      "text": "A sample size may sometimes be referred to as \"large\". This is a relative and qualitative term. It is preferable to describe what one is attempting to achieve with his sample. For example, stating an implication may be helpful: this sample is large enough that a single outlying value at ten times the \"typical\" sample mean (the mean without the outlying value) would influence the mean by no more than X.",
      "ja": "サンプルサイズは、時々、「大」と呼ぶことができます。これは、相対的および定性的な用語です。 1つが彼のサンプルを達成しようとしているかを説明するのが好ましいです。例えば、含意を述べることは役に立つかもしれ：このサンプルでは、​​10回「典型的な」サンプル平均（外れ値なしの平均値）で、単一の外れ値がXよりもこれ以上で平均に影響を与えるだろうと十分な大きさであります"
    },
    {
      "indent": 3,
      "text": "The Appendix of [RFC2330] indicates that a sample size of 128 singletons worked well for goodness-of-fit testing, while a much larger size (8192 singletons) almost always failed.",
      "ja": "[RFC2330]の付録は、はるかに大きなサイズ（8192シングルトン）はほとんど常に失敗しながら128のシングルトンのサンプルサイズは、適合度テストのためによく働いたことを示しています。"
    },
    {
      "indent": 0,
      "text": "9. Security Considerations",
      "section_title": true,
      "ja": "9.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "The security considerations that apply to any active measurement of live networks are relevant here as well. See the Security Considerations section of [RFC4656] for mandatory-to-implement security features that intend to mitigate attacks.",
      "ja": "ライブネットワークの任意のアクティブな測定に適用するセキュリティ上の考慮事項はここにも関連しています。攻撃を軽減しようとする実装に必須のセキュリティ機能のために[RFC4656]のセキュリティの考慮事項のセクションを参照してください。"
    },
    {
      "indent": 3,
      "text": "Measurement systems conducting long-term measurements are more exposed to threats as a by-product of ports open longer to perform their task, and more easily detected measurement activity on those ports. Further, use of long packet waiting times affords an attacker a better opportunity to prepare and launch a replay attack.",
      "ja": "長期的な測定を行う測定システムは、より多くのそれらのタスクを実行するために、より長いオープンポートの副産物としての脅威にさらされると、より容易にそれらのポート上の測定アクティビティが検出されます。さらに、長いパケット待ち時間の使用は、攻撃者は、リプレイ攻撃を準備して起動するためのより良い機会を提供します。"
    },
    {
      "indent": 0,
      "text": "10. Acknowledgements",
      "section_title": true,
      "ja": "10.謝辞"
    },
    {
      "indent": 3,
      "text": "The authors thank Phil Chimento for his suggestion to employ conditional distributions for delay, Steve Konish Jr. for his careful review and suggestions, Dave McDysan and Don McLachlan for useful comments based on their long experience with measurement and reporting, Daniel Genin for his observation of non-orthogonality between raw and restricted capacity metrics (and for noticing our previous omission of this fact), and Matt Zekauskas for suggestions on organizing the memo for easier consumption.",
      "ja": "著者は、彼の観察のための測定と報告との長年の経験、ダニエル下忍に基づく有益なコメントのためデーブMcDysanとドン・マクラクラン、彼の慎重な検討と提案のために遅れ、スティーブKonishジュニアのための条件付き分布を採用する彼の提案のためのフィルChimentoに感謝します生と制限された容量の指標との間の非直交性（および、この事実を私たちの前の省略に気付い用）、およびマットZekauskas容易に消費のためにメモを整理する上での提案のため。"
    },
    {
      "indent": 0,
      "text": "11. References",
      "section_title": true,
      "ja": "11.参考文献"
    },
    {
      "indent": 0,
      "text": "11.1. Normative References",
      "section_title": true,
      "ja": "11.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2330] Paxson, V., Almes, G., Mahdavi, J., and M. Mathis, \"Framework for IP Performance Metrics\", RFC 2330, May 1998.",
      "ja": "[RFC2330]パクソン、V.、Almes、G.、Mahdavi、J.、およびM.マティス、 \"IPパフォーマンス・メトリックのためのフレームワーク\"、RFC 2330、1998年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC2678] Mahdavi, J. and V. Paxson, \"IPPM Metrics for Measuring Connectivity\", RFC 2678, September 1999.",
      "ja": "\"接続の測定IPPMメトリック\" [RFC2678] Mahdavi、J.およびV.パクソン、RFC 2678、1999年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC2679] Almes, G., Kalidindi, S., and M. Zekauskas, \"A One-way Delay Metric for IPPM\", RFC 2679, September 1999.",
      "ja": "[RFC2679] Almes、G.、Kalidindi、S.、およびM. Zekauskas、 \"一方向IPPMの遅延メトリック\"、RFC 2679、1999年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC2680] Almes, G., Kalidindi, S., and M. Zekauskas, \"A One-way Packet Loss Metric for IPPM\", RFC 2680, September 1999.",
      "ja": "[RFC2680] Almes、G.、Kalidindi、S.、およびM. Zekauskas、 \"IPPMための一方向パケット損失メトリック\"、RFC 2680、1999年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC3148] Mathis, M. and M. Allman, \"A Framework for Defining Empirical Bulk Transfer Capacity Metrics\", RFC 3148, July 2001.",
      "ja": "[RFC3148]マティス、M.およびM.オールマン、「実証バルク転送容量のメトリックを定義するためのフレームワーク」、RFC 3148、2001年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC3393] Demichelis, C. and P. Chimento, \"IP Packet Delay Variation Metric for IP Performance Metrics (IPPM)\", RFC 3393, November 2002.",
      "ja": "[RFC3393]デミチェリス、C.およびP. Chimento、 \"IPパフォーマンス・メトリックのためのIPパケット遅延変動メトリック（IPPM）\"、RFC 3393、2002年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC3432] Raisanen, V., Grotefeld, G., and A. Morton, \"Network performance measurement with periodic streams\", RFC 3432, November 2002.",
      "ja": "[RFC3432] Raisanen、V.、Grotefeld、G.、およびA.モートン、 \"定期的なストリームとのネットワークパフォーマンスの測定\"、RFC 3432、2002年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC4656] Shalunov, S., Teitelbaum, B., Karp, A., Boote, J., and M. Zekauskas, \"A One-way Active Measurement Protocol (OWAMP)\", RFC 4656, September 2006.",
      "ja": "[RFC4656] Shalunov、S.、Teitelbaum、B.、カープ、A.、BOOTE、J.、およびM. Zekauskas、 \"ワンウェイアクティブな測定プロトコル（OWAMP）\"、RFC 4656、2006年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC4737] Morton, A., Ciavattone, L., Ramachandran, G., Shalunov, S., and J. Perser, \"Packet Reordering Metrics\", RFC 4737, November 2006.",
      "ja": "[RFC4737]モートン、A.、Ciavattone、L.、ラマチャンドラン、G.、Shalunov、S.、およびJ. Perser、 \"パケット並べ替えメトリック\"、RFC 4737、2006年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC5136] Chimento, P. and J. Ishac, \"Defining Network Capacity\", RFC 5136, February 2008.",
      "ja": "[RFC5136] Chimento、P.およびJ. Ishac、 \"定義ネットワーク容量\"、RFC 5136、2008年2月。"
    },
    {
      "indent": 0,
      "text": "11.2. Informative References",
      "section_title": true,
      "ja": "11.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[Casner] Casner, S., Alaettinoglu, C., and C. Kuan, \"A Fine-Grained View of High-Performance Networking\", NANOG 22 Conf., May 20-22 2001, <http://www.nanog.org/presentations/archive/index.php>.",
      "ja": "[Casner] Casner、S.、Alaettinoglu、C.、およびC.クアン、 \"高性能ネットワーキングのファイングレイン・ビュー\"、NANOG 22コンファレンス、月20-22 2001年、<のhttp：。//www.nanog .ORG /プレゼンテーション/アーカイブ/ index.phpを>。"
    },
    {
      "indent": 3,
      "text": "[Cia03] Ciavattone, L., Morton, A., and G. Ramachandran, \"Standardized Active Measurements on a Tier 1 IP Backbone\", IEEE Communications Magazine, Vol. 41 No. 6, pp. 90-97, June 2003.",
      "ja": "【Cia03] Ciavattone、L.、モートン、A.、およびG.ラマチャンドラン、 \"ティア1のIPバックボーン上の標準化された活性の測定\"、IEEE通信誌、巻。 41第6号、PP。90-97 2003年6月。"
    },
    {
      "indent": 3,
      "text": "[IPPM-RPT] Shalunov, S. and M. Swany, \"Reporting IP Performance Metrics to Users\", Work in Progress, March 2011.",
      "ja": "[IPPM-RPT] Shalunov、S.とM.スワニー、 \"ユーザーにIPパフォーマンス・メトリックの報告\"、進歩、2011年3月に作業が。"
    },
    {
      "indent": 3,
      "text": "[RFC5481] Morton, A. and B. Claise, \"Packet Delay Variation Applicability Statement\", RFC 5481, March 2009.",
      "ja": "[RFC5481]モートン、A.およびB. Claise、 \"パケット遅延変動の適用に関する声明\"、RFC 5481、2009年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC5835] Morton, A., Ed., and S. Van den Berghe, Ed., \"Framework for Metric Composition\", RFC 5835, April 2010.",
      "ja": "[RFC5835]モートン、A.編、及びS.ヴァンデンベルグフ編、 \"メトリック組成物のためのフレームワーク\"、RFC 5835、2010年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC6349] Constantine, B., Forget, G., Geib, R., and R. Schrage, \"Framework for TCP Throughput Testing\", RFC 6349, August 2011.",
      "ja": "[RFC6349]コンスタンティン、B.、忘れて、G.、Geib、R.、およびR. Schrage、 \"TCPスループットテストのための枠組み\"、RFC 6349、2011年8月。"
    },
    {
      "indent": 3,
      "text": "[Y.1540] International Telecommunication Union, \"Internet protocol data communication service - IP packet transfer and availability performance parameters\", ITU-T Recommendation Y.1540, March 2011.",
      "ja": "[Y.1540]国際電気通信連合、「インターネットプロトコルデータ通信サービス -  IPパケット転送および可用性の性能パラメータ」、ITU-T勧告Y.1540、2011年3月。"
    },
    {
      "indent": 3,
      "text": "[Y.1541] International Telecommunication Union, \"Network performance objectives for IP-based services\", ITU-T Recommendation Y.1541, December 2011.",
      "ja": "[Y. 1541]国際電気通信連合、ITU-T勧告Y. 1541、2011年12月「IPベースのサービスのためのネットワークの性能目標」。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Al Morton AT&T Labs 200 Laurel Avenue South Middletown, NJ 07748 USA",
      "ja": "アルモートンAT＆T Labsの200ローレルアベニュー南ミドルタウン、NJ 07748 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 732 420 1571 Fax: +1 732 368 1192 EMail: acmorton@att.com URI: http://home.comcast.net/~acmacm/",
      "ja": "電話：+1 732 420 1571ファックス：+1 732 368 1192 Eメール：acmorton@att.com URI：http://home.comcast.net/~acmacm/"
    },
    {
      "indent": 3,
      "text": "Gomathi Ramachandran AT&T Labs 200 Laurel Avenue South Middletown, New Jersey 07748 USA",
      "ja": "GomathiラマチャンドランAT＆T Labsの200ローレルアベニュー南ミドルタウン、ニュージャージー07748 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 732 420 2353 EMail: gomathi@att.com",
      "ja": "電話：+1 732 420 2353 Eメール：gomathi@att.com"
    },
    {
      "indent": 3,
      "text": "Ganga Maguluri AT&T Labs 200 Laurel Avenue South Middletown, New Jersey 07748 USA",
      "ja": "ガンガーMaguluri AT＆T Labsの200ローレルアベニュー南ミドルタウン、ニュージャージー07748 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 732 420 2486 EMail: gmaguluri@att.com",
      "ja": "電話：+1 732 420 2486 Eメール：gmaguluri@att.com"
    }
  ]
}