{
  "title": {
    "text": "RFC 6777 - Label Switched Path (LSP) Data Path Delay Metrics in Generalized MPLS and MPLS Traffic Engineering (MPLS-TE) Networks",
    "ja": "RFC 6777 - ラベルスイッチパス（LSP）データパスは一般MPLSおよびMPLSトラフィックエンジニアリングにおける遅延メトリック（MPLS-TE）ネットワーク"
  },
  "number": 6777,
  "created_at": "2019-10-30 18:00:53.003316+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                       W. Sun, Ed.\nRequest for Comments: 6777                                          SJTU\nCategory: Standards Track                                  G. Zhang, Ed.\nISSN: 2070-1721                                                     CATR\n                                                                  J. Gao\n                                                                  Huawei\n                                                                  G. Xie\n                                                            UC Riverside\n                                                              R. Papneja\n                                                                  Huawei\n                                                           November 2012",
      "raw": true
    },
    {
      "indent": 1,
      "text": "Label Switched Path (LSP) Data Path Delay Metrics in Generalized MPLS and MPLS Traffic Engineering (MPLS-TE) Networks",
      "ja": "ラベルスイッチパス（LSP）データパスは一般MPLSおよびMPLSトラフィックエンジニアリングにおける遅延メトリック（MPLS-TE）ネットワーク"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "When setting up a Label Switched Path (LSP) in Generalized MPLS (GMPLS) and MPLS Traffic Engineering (MPLS-TE) networks, the completion of the signaling process does not necessarily mean that the cross-connection along the LSP has been programmed accordingly and in a timely manner. Meanwhile, the completion of the signaling process may be used by LSP users or applications that control their use as an indication that the data path has become usable. The existence of the inconsistency between the signaling messages and cross-connection programming, and the possible failure of cross-connection programming, if not properly treated, will result in data loss or even application failure. Characterization of this performance can thus help designers to improve the way in which LSPs are used and to make applications or tools that depend on and use LSPs more robust. This document defines a series of performance metrics to evaluate the connectivity of the data path in the signaling process.",
      "ja": "汎用MPLS（GMPLS）及びMPLSトラフィックエンジニアリング（MPLS-TE）ネットワークにおいてラベルスイッチパス（LSP）を設定する際に、シグナリング処理の完了は、必ずしもLSPに沿って相互接続はそれに応じてプログラムされていることを意味しないとはやくて。一方、シグナリング処理の完了は、データ・パスが使用可能になったことの表示としてのそれらの使用を制御するLSPユーザーまたはアプリケーションによって使用されてもよいです。シグナリングメッセージとクロスコネクトプログラミングの間の矛盾、およびクロスコネクトプログラミングの可能な故障の存在は、適切に処理されていない場合、データの損失、あるいはアプリケーションの障害をもたらします。このパフォーマンスの特性は、このように、設計者はLSPのが使用されている方法を改善し、依存すると、より堅牢なLSPを使用するアプリケーションやツールを作るのを助けることができます。この文書では、シグナリング処理におけるデータ経路の接続性を評価するためのパフォーマンス・メトリックの系列を定義します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6777.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6777で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2012 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2012 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................4\n2. Conventions Used in This Document ...............................5\n3. Overview of Performance Metrics .................................5\n4. Terms Used in This Document .....................................6\n5. A Singleton Definition for RRFD .................................7\n   5.1. Motivation .................................................7\n   5.2. Metric Name ................................................7\n   5.3. Metric Parameters ..........................................7\n   5.4. Metric Units ...............................................7\n   5.5. Definition .................................................8\n   5.6. Discussion .................................................8\n   5.7. Methodologies ..............................................9\n6. A Singleton Definition for RSRD ................................10\n   6.1. Motivation ................................................10\n   6.2. Metric Name ...............................................10\n   6.3. Metric Parameters .........................................10\n   6.4. Metric Units ..............................................11\n   6.5. Definition ................................................11\n   6.6. Discussion ................................................11\n   6.7. Methodologies .............................................12\n7. A Singleton Definition for PRFD ................................13\n   7.1. Motivation ................................................13\n   7.2. Metric Name ...............................................13\n   7.3. Metric Parameters .........................................13\n   7.4. Metric Units ..............................................13\n   7.5. Definition ................................................14\n   7.6. Discussion ................................................14\n   7.7. Methodologies .............................................15",
      "raw": true
    },
    {
      "indent": 3,
      "text": "8. A Singleton Definition for PSFD ................................16\n   8.1. Motivation ................................................16\n   8.2. Metric Name ...............................................16\n   8.3. Metric Parameters .........................................16\n   8.4. Metric Units ..............................................16\n   8.5. Definition ................................................17\n   8.6. Discussion ................................................17\n   8.7. Methodologies .............................................18\n9. A Singleton Definition for PSRD ................................19\n   9.1. Motivation ................................................19\n   9.2. Metric Name ...............................................19\n   9.3. Metric Parameters .........................................19\n   9.4. Metric Units ..............................................19\n   9.5. Definition ................................................20\n   9.6. Discussion ................................................20\n   9.7. Methodologies .............................................21\n10. A Definition for Samples of Data Path Delay ...................22\n   10.1. Metric Name ..............................................22\n   10.2. Metric Parameters ........................................22\n   10.3. Metric Units .............................................22\n   10.4. Definition ...............................................22\n   10.5. Discussion ...............................................23\n   10.6. Methodologies ............................................23\n   10.7. Typical Testing Cases ....................................23\n        10.7.1. With No LSP in the Network ........................23\n        10.7.2. With a Number of LSPs in the Network ..............24\n11. Some Statistics Definitions for Metrics to Report .............24\n   11.1. The Minimum of the Metric ................................24\n   11.2. The Median of the Metric .................................24\n   11.3. The Percentile of the Metric .............................24\n   11.4. Failure Probability ......................................25\n        11.4.1. Failure Count .....................................25\n        11.4.2. Failure Ratio .....................................25\n12. Security Considerations .......................................25\n13. References ....................................................26\n   13.1. Normative References .....................................26\n   13.2. Informative References ...................................26\nAppendix A. Acknowledgements ......................................27\nAppendix B. Contributors ..........................................28",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "Label Switched Paths (LSPs) are established, controlled, and allocated for use by management tools or directly by the components that use them. In this document, we call such management tools and the components that use LSPs \"applications\". Such applications may be Network Management Systems (NMSs); hardware or software components that forward data onto virtual links; programs or tools that use dedicated links; or any other user of an LSP.",
      "ja": "ラベルは、確立制御、および管理ツールによって、またはそれらを直接使用するコンポーネントで使用するために割り当てられたスイッチパス（LSP）。この文書では、我々は、このような管理ツールとのLSP「アプリケーション」を使用してコンポーネントを呼び出します。このようなアプリケーションは、ネットワーク管理システム（NMSは）であってもよいです。仮想リンク上にデータを転送するハードウェアまたはソフトウェアコンポーネント。専用リンクを使用するプログラムやツール。またはLSPの他のユーザー。"
    },
    {
      "indent": 3,
      "text": "Ideally, the completion of the signaling process means that the signaled LSP is ready to carry traffic. However, in actual implementations, vendors may choose to program the cross-connection in a pipelined manner, so that the overall LSP provisioning delay can be reduced. In such situations, the data path may not be ready for use instantly after the signaling process completes. Implementation deficiency may also cause inconsistency between the signaling process and data path provisioning. For example, if the data plane fails to program the cross-connection accordingly but does not manage to report this to the control plane, the signaling process may complete successfully while the corresponding data path will never become functional at all.",
      "ja": "理想的には、シグナリング処理の完了が通知LSPのトラフィックを伝送する準備ができていることを意味します。しかし、実際の実装では、ベンダは、全体的なLSPプロビジョニング遅延を低減することができるように、パイプライン方式で相互接続をプログラムすることを選択することができます。そのような状況では、データ・パスは、シグナリングプロセスが完了した後に即座に使用できる状態ではないかもしれません。実装の欠乏はまた、シグナリングプロセスとデータ・パス・プロビジョニングの間に矛盾が発生することがあります。データプレーンは、それに応じてクロス接続をプログラムするために失敗したが、コントロールプレーンにこれを報告して管理していない場合は、対応するデータパスがまったく機能になることは決してありませんしながら、例えば、シグナリングプロセスが正常に完了する可能性があります。"
    },
    {
      "indent": 3,
      "text": "On the other hand, the completion of the signaling process may be used in many cases as an indication of data path connectivity. For example, when invoking through the User-Network Interface (UNI) [RFC4208], a client device or an application may use the reception of the correct Resv message as an indication that the data path is fully functional and start to transmit traffic. This will result in data loss or even application failure.",
      "ja": "一方、シグナリング処理の完了は、データパス接続性の指標として多くの場合に使用することができます。例えば、ユーザネットワークインタフェース（UNI）[RFC4208]、クライアントデバイスを介して呼び出すとき、またはアプリケーションがデータパスは完全に機能的であることを示すものとして正しいResvメッセージの受信を使用して、トラフィックの送信を開始することができます。これは、データの損失、あるいはアプリケーションの障害になります。"
    },
    {
      "indent": 3,
      "text": "Although RSVP(-TE) specifications have suggested that the cross-connections are programmed before signaling messages are propagated upstream, it is still worthwhile to verify the conformance of an implementation and measure the delay, when necessary.",
      "ja": "RSVP（-TE）仕様は、シグナリングメッセージが上流に伝播される前にクロスコネクトがプログラムされていることを示唆しているが、実装の適合性を検証し、必要なときに遅延を測定することは価値があります。"
    },
    {
      "indent": 3,
      "text": "This document defines a series of performance metrics to evaluate the connectivity of the data path during the signaling process. The metrics defined in this document complement the control plane metrics defined in [RFC5814]. These metrics can be used to verify the conformance of implementations against related specifications, as elaborated in [RFC6383]. They also can be used to build more robust applications.",
      "ja": "この文書では、シグナリング処理時のデータパスの接続性を評価するパフォーマンス・メトリックの系列を定義します。この文書で定義されたメトリックは、[RFC5814]で定義された制御プレーン・メトリックを補完します。 [RFC6383]に詳しく述べたようにこれらの指標は、関連する仕様に対する実装の適合性を検証するために使用することができます。彼らはまた、より堅牢なアプリケーションを構築するために使用することができます。"
    },
    {
      "indent": 0,
      "text": "2. Conventions Used in This Document",
      "section_title": true,
      "ja": "この文書で使用される2.表記"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "3. Overview of Performance Metrics",
      "section_title": true,
      "ja": "パフォーマンス・メトリックの3概要"
    },
    {
      "indent": 3,
      "text": "In this memo, we define five performance metrics to characterize the performance of data path provisioning with GMPLS/MPLS-TE signaling. These metrics complement the metrics defined in [RFC5814], in the sense that the completion of the signaling process for an LSP and the programming of cross-connections along the LSP may not be consistent. The performance metrics in [RFC5814] characterize the performance of LSP provisioning from the pure signaling point of view, while the metric in this document takes into account the validity of the data path.",
      "ja": "このメモでは、GMPLS / MPLS-TEシグナリングとプロビジョニングデータパスの性能を特徴付けるために5つのパフォーマンス・メトリックを定義します。これらのメトリックは、LSPとLSPに沿って相互接続のプログラミングのためのシグナリング処理の完了が一貫しないかもしれないという意味で、[RFC5814]で定義されたメトリックを補完します。この文書に記載されているメトリックは、アカウントへのデータパスの有効性をとりつつ、[RFC5814]でのパフォーマンス・メトリックは、ビューの純粋なシグナリングポイントからのLSPのプロビジョニングの性能を特徴付けます。"
    },
    {
      "indent": 3,
      "text": "The five metrics are:",
      "ja": "5つのメトリックは、次のとおりです。"
    },
    {
      "indent": 3,
      "text": "o Resv Received, Forward Data (RRFD) - the delay between the point when the Resv message is received by the ingress node and the forward data path becomes ready for use.",
      "ja": "Resvメッセージが入口ノードによって受信され、フォワードデータ経路が使用可能となる時点の間の遅延 -  OたResvは、順方向データ（RRFD）を受けました。"
    },
    {
      "indent": 3,
      "text": "o Resv Sent, Reverse Data (RSRD) - the delay between the point when the Resv message is sent by the egress node and the reverse data path becomes ready for use.",
      "ja": "OのResv送信され、逆方向データ（RSRD） -  Resvメッセージが出口ノードによって送信され、逆方向データ・パスが使用可能な状態となっている点との間の遅延。"
    },
    {
      "indent": 3,
      "text": "o PATH Received, Forward Data (PRFD) - the delay between the point when the PATH message is received by the egress node and the forward data path becomes ready for use.",
      "ja": "、順方向データ（PRFD）を受信Oパス -  PATHメッセージが出口ノードによって受信され、フォワードデータ経路が使用可能となる時点の間の遅延。"
    },
    {
      "indent": 3,
      "text": "o PATH Sent, Forward Data (PSFD) - the delay between the point when the PATH message is sent by the ingress node and the forward data path becomes ready for use.",
      "ja": "O PATH送信され、順方向データ（PSFD） -  PATHメッセージが入口ノードによって送信された順方向データ・パスが使用可能な状態となっている点との間の遅延。"
    },
    {
      "indent": 3,
      "text": "o PATH Sent, Reverse Data (PSRD) - the delay between the point when the PATH message is sent by the ingress node and the reverse data path becomes ready for use.",
      "ja": "O PATH送信され、逆方向データ（PSRD） -  PATHメッセージが入口ノードによって送信され、逆方向データ・パスが使用可能な状態となっている点との間の遅延。"
    },
    {
      "indent": 3,
      "text": "As in [RFC5814], we continue to use the structures and notions introduced and discussed in the IP Performance Metrics (IPPM) Framework documents [RFC2330] [RFC2679] [RFC2681]. The reader is assumed to be familiar with the notions in those documents. The reader is also assumed to be familiar with the definitions in [RFC5814].",
      "ja": "[RFC5814]のように、私たちは、IPパフォーマンス・メトリック（IPPM）の枠組み文書[RFC2330] [RFC2679] [RFC2681]で導入され、議論の構造と概念を継続して使用します。読者はそれらの文書における概念に精通していることを想定しています。読者はまた、[RFC5814]の定義に精通していると仮定されます。"
    },
    {
      "indent": 0,
      "text": "4. Terms Used in This Document",
      "section_title": true,
      "ja": "この文書で使用される4.利用規約"
    },
    {
      "indent": 3,
      "text": "o Forward data path - the data path from the ingress node to the egress node. Instances of a forward data path include the data path of a unidirectional LSP and a data path from the ingress node to the egress node in a bidirectional LSP.",
      "ja": "O転送データパス - 出口ノードへの入口ノードからのデータ・パス。順方向データ・パスのインスタンスは、一方向LSPのデータパスおよび双方向LSPにおける出口ノードへの入口ノードからのデータ・パスを含みます。"
    },
    {
      "indent": 3,
      "text": "o Reverse data path - the data path from the egress node to the ingress node in a bidirectional LSP.",
      "ja": "Oデータパスを逆 - 双方向LSPにおける入口ノードへの出口ノードからのデータ・パスを。"
    },
    {
      "indent": 3,
      "text": "o Data path delay - the time needed to complete the data path configuration, in relation to the signaling process. Five types of data path delay are defined in this document, namely RRFD, RSRD, PRFD, PSFD, and PSRD. Data path delay as used in this document must be distinguished from the transmission delay along the data path, i.e., the time needed to transmit traffic from one side of the data path to the other.",
      "ja": "Oデータパス遅延 - シグナリングプロセスに関連して、データパスの設定を完了するのに必要な時間。データパス遅延の5種類、すなわちRRFD、RSRD、PRFD、PSFD、およびPSRD、このドキュメントで定義されています。本書で使用されるデータパス遅延がデータ経路に沿って伝送遅延とは区別されなければならない、即ち、他へのデータパスの一方の側からのトラフィックを送信するのに必要な時間。"
    },
    {
      "indent": 3,
      "text": "o Error-free signal - data-plane-specific indication of connectivity of the data path. For example, for interfaces capable of packet switching, the reception of the first error-free packet from one side of the LSP to the other may be used as the error-free signal. For Synchronous Digital Hierarchy/Synchronous Optical Network (SDH/SONET) cross-connects, the disappearance of alarm can be used as the error-free signal. Throughout this document, we will use \"error-free signal\" as a general term. An implementation must choose a proper data path signal that is specific to the data path technology being tested.",
      "ja": "Oエラーフリー信号 - データパスの接続性のデータプレーン固有指示。例えば、パケット交換可能なインターフェースのための、他のLSPの一方の側から第エラーフリーパケットの受信は、エラーフリー信号として使用することができます。同期デジタルハイアラーキ/同期光ネットワーク（SDH / SONET）クロスコネクトの場合は、アラームの消失は、エラーのない信号として使用することができます。このドキュメントでは、我々は一般的な用語として「誤りのない信号」を使用します。実装は、テストされているデータパス技術に固有の適切なデータパス信号を選択する必要があります。"
    },
    {
      "indent": 3,
      "text": "o Ingress/egress node - in this memo, an ingress/egress node means a measurement endpoint with both control plane and data plane features. Typically, the control plane part on an ingress/egress node interacts with the control plane of the network under test. The data plane part of an ingress/egress node will generate data path signals and send the signal to the data plane of the network under test, or receive data path signals from the network under test.",
      "ja": "O入口/出口ノード - このメモでは、入口/出口ノードは、制御プレーンとデータプレーンの両方の機能を有する測定エンドポイントを意味します。典型的には、入口/出口ノード上の制御プレーン部は、被試験ネットワークの制御プレーンと相互作用します。入口/出口ノードのデータプレーン部は、データパス信号を生成し、被試験ネットワークのデータプレーンに信号を送ったり、テスト中のネットワークからのデータパス信号を受信することになります。"
    },
    {
      "indent": 0,
      "text": "5. A Singleton Definition for RRFD",
      "section_title": true,
      "ja": "RRFD 5. Aシングルトンの定義"
    },
    {
      "indent": 3,
      "text": "This part defines a metric for forward data path delay when an LSP is set up.",
      "ja": "この部分は、LSPがセットアップされる順方向データ・パス遅延のメトリックを定義します。"
    },
    {
      "indent": 3,
      "text": "As described in [RFC6383], the completion of the RSVP-TE signaling process does not necessarily mean that the cross-connections along the LSP being set up are in place and ready to carry traffic. This metric defines the time difference between the reception of a Resv message by the ingress node and the completion of the cross-connection programming along the forward data path.",
      "ja": "[RFC6383]に記載されているように、RSVP-TEシグナリングプロセスの完了は必ずしもLSPに沿って相互接続が設定されていることを意味するものではない場所で、トラフィックを伝送する準備ができています。このメトリックは、入口ノードによってResvメッセージの受信および転送データの経路に沿ってクロスコネクトプログラミングの完了の間の時間差を定義します。"
    },
    {
      "indent": 0,
      "text": "5.1. Motivation",
      "section_title": true,
      "ja": "5.1。動機"
    },
    {
      "indent": 3,
      "text": "RRFD is useful for the following reasons:",
      "ja": "RRFDは、次のような理由のために有用です。"
    },
    {
      "indent": 3,
      "text": "o For the reasons described in [RFC6383], the data path may not be ready for use instantly after the completion of the RSVP-TE signaling process. The delay itself is part of the implementation performance.",
      "ja": "O [RFC6383]に記載の理由により、データ・パスは、RSVP-TEシグナリングプロセスの完了後、即座に使用できる状態ではないかもしれません。遅延自体は実装性能の一部です。"
    },
    {
      "indent": 3,
      "text": "o The completion of the signaling process may be used by application designers as an indication of data path connectivity. The existence of this delay and the potential failure of cross-connection programming, if not properly treated, will result in data loss or application failure. The typical value of this delay can thus help designers to improve the application model.",
      "ja": "Oシグナリング処理の完了は、データパス接続性の指標として、アプリケーション設計者によって使用されてもよいです。この遅延とクロスコネクトプログラミングの潜在的な故障の存在は、適切に処理されていない場合、データの損失やアプリケーションの失敗をもたらすであろう。この遅延の典型的な値は、このように、設計者はアプリケーションモデルを向上させることができます。"
    },
    {
      "indent": 0,
      "text": "5.2. Metric Name",
      "section_title": true,
      "ja": "5.2。メトリック名"
    },
    {
      "indent": 3,
      "text": "RRFD = Resv Received, Forward Data path",
      "ja": "RRFD =のResvは、順方向データ・パスを受け取りました"
    },
    {
      "indent": 0,
      "text": "5.3. Metric Parameters",
      "section_title": true,
      "ja": "5.3。メトリックパラメータ"
    },
    {
      "indent": 3,
      "text": "o ID0, the ingress Label Switching Router (LSR) ID",
      "ja": "O ID0、イングレスラベルスイッチルータ（LSR）ID"
    },
    {
      "indent": 3,
      "text": "o ID1, the egress LSR ID",
      "ja": "ID1、出口LSR ID O"
    },
    {
      "indent": 3,
      "text": "o T, a time when the setup is attempted",
      "ja": "O T、セットアップが試みられる時間"
    },
    {
      "indent": 0,
      "text": "5.4. Metric Units",
      "section_title": true,
      "ja": "5.4。メートル法"
    },
    {
      "indent": 3,
      "text": "The value of RRFD is either a real number of milliseconds or undefined.",
      "ja": "RRFDの値はミリ秒単位または未定義の実数のいずれかです。"
    },
    {
      "indent": 0,
      "text": "5.5. Definition",
      "section_title": true,
      "ja": "5.5。定義"
    },
    {
      "indent": 3,
      "text": "For a real number dT,",
      "ja": "実数dTのために、"
    },
    {
      "indent": 6,
      "text": "RRFD from ingress node ID0 to egress node ID1 at T is dT",
      "ja": "Tにおける入口ノードID0から出口ノードID1にRRFDはdTのあります"
    },
    {
      "indent": 3,
      "text": "means that",
      "ja": "という意味です"
    },
    {
      "indent": 3,
      "text": "o ingress node ID0 sends a PATH message to egress node ID1,",
      "ja": "Oの入口ノードID0は、出口ノードID1にPATHメッセージを送信します"
    },
    {
      "indent": 3,
      "text": "o the last bit of the corresponding Resv message is received by ingress node ID0 at T, and",
      "ja": "対応するResvメッセージの最後のビットがTで入口ノードID0によって受信され、O、及び"
    },
    {
      "indent": 3,
      "text": "o an error-free signal is received by egress node ID1 by using a data-plane-specific test pattern at T+dT.",
      "ja": "Oエラーのない信号は、T + dTのでデータプレーン固有のテストパターンを使用して出口ノードID1によって受信されます。"
    },
    {
      "indent": 0,
      "text": "5.6. Discussion",
      "section_title": true,
      "ja": "5.6。討論"
    },
    {
      "indent": 3,
      "text": "The following issues are likely to come up in practice:",
      "ja": "次の問題は、実際に出てくる可能性があります。"
    },
    {
      "indent": 3,
      "text": "o The accuracy of RRFD depends on the clock resolution of both the ingress node and egress node. Clock synchronization between the ingress node and egress node is required.",
      "ja": "O RRFDの精度は、入口ノードと出口ノードの両方のクロックの分解能に依存します。入口ノードと出口ノード間のクロック同期が必要です。"
    },
    {
      "indent": 3,
      "text": "o The accuracy of RRFD is also dependent on how the error-free signal is received and may differ significantly when the underlying data plane technology is different. For instance, for an LSP between a pair of Ethernet interfaces, the ingress node may use a rate-based method to verify the connectivity of the data path and use the reception of the first error-free frame as the error-free signal. In this case, the interval between two successive frames has a significant impact on accuracy. It is RECOMMENDED that the ingress node use small intervals, under the condition that the injected traffic does not exceed the capacity of the forward data path. The value of such intervals MUST be reported.",
      "ja": "O RRFDの精度は、エラーのない信号が受信され、基礎となるデータプレーン技術が異なる場合に大きく異なる可能性がどのように依存しています。例えば、イーサネットインターフェイスのペア間のLSPのために、レートベースの方法を使用することができる入口ノードは、データパスの接続を確認し、エラーのない信号として第1のエラーのないフレームの受信を使用します。この場合、2つの連続するフレーム間の間隔は、精度に大きな影響を有します。入口ノードが注入されたトラフィックは、順方向データ・パスの容量を超えないことを条件に、小さな間隔を使用することをお勧めします。このような間隔の値を報告しなければなりません。"
    },
    {
      "indent": 3,
      "text": "o The accuracy of RRFD is also dependent on the time needed to propagate the error-free signal from the ingress node to the egress node. A typical value for propagating the error-free signal from the ingress node to the egress node under the same measurement setup MAY be reported. The methodology to obtain such values is outside the scope of this document.",
      "ja": "O RRFDの精度はまた、出口ノードへの入口ノードからエラーのない信号を伝播するのに必要な時間に依存します。同じ測定セットアップの下に出口ノードへの入口ノードからエラーのない信号を伝播するための典型的な値は報告されてもよいです。このような値を得るための方法は、この文書の範囲外です。"
    },
    {
      "indent": 3,
      "text": "o The accuracy of this metric is also dependent on the physical-layer serialization/deserialization of the test signal for certain data path technologies. For instance, for an LSP between a pair of low-speed Ethernet interfaces, the time needed to serialize/ deserialize a large frame may not be negligible. In this case, it is RECOMMENDED that the ingress node use small frames. The average length of the frame MAY be reported.",
      "ja": "このメトリックの精度oを、特定のデータ・パス技術のテスト信号の物理層シリアライズ/デシリアライズに依存しています。例えば、低速イーサネットインターフェイスのペア間のLSPのために、大きいフレームを逆シリアル化/シリアル化するために必要な時間は無視できないかもしれません。この場合、入口ノードは、小さなフレームを使用することをお勧めします。フレームの平均長さが報告されてもよいです。"
    },
    {
      "indent": 3,
      "text": "o It is possible that under some implementations, a node may program the cross-connection before it sends a PATH message further downstream, and the data path may be ready for use before a Resv message reaches the ingress node. In such cases, RRFD can be a negative value. It is RECOMMENDED that a PRFD measurement be carried out to further characterize the forward data path delay when a negative RRFD value is observed.",
      "ja": "Oさらに下流PATHメッセージを送信し、Resvメッセージが入口ノードに到達する前にデータパスが使用可能な状態とすることができる前に、いくつかの実装下で、ノードは、クロス接続をプログラムすることが可能です。このような場合、RRFDは負の値とすることができます。 PRFD測定が負RRFD値が観測されたときに、さらに順方向データ・パス遅延を特徴付けるために行うことが推奨されます。"
    },
    {
      "indent": 3,
      "text": "o If an error-free signal is received by the egress node before a PATH message is sent on the ingress node, an error MUST be reported and the measurement SHOULD terminate.",
      "ja": "PATHメッセージが入口ノードに送信される前に、エラーのない信号を出口ノードによって受信された場合、O、エラーを報告しなければならなくて、測定を終了すべき。"
    },
    {
      "indent": 3,
      "text": "o If the corresponding Resv message is received but no error-free signal is received by the egress node within a reasonable period of time, i.e., a threshold, RRFD MUST be treated as undefined. The value of the threshold MUST be reported.",
      "ja": "対応するResvメッセージが受信されるが、エラーのない信号が合理的な期間内に出口ノードによって受信されない場合、O、すなわち、閾値は、RRFDは未定義として扱わなければなりません。しきい値の値は報告しなければなりません。"
    },
    {
      "indent": 3,
      "text": "o If the LSP setup fails, this metric value MUST NOT be counted.",
      "ja": "LSPのセットアップが失敗した場合、O、このメトリック値がカウントされてはなりません。"
    },
    {
      "indent": 0,
      "text": "5.7. Methodologies",
      "section_title": true,
      "ja": "5.7。方法論"
    },
    {
      "indent": 3,
      "text": "Generally, the methodology would proceed as follows:",
      "ja": "次のように一般的に、方法論は進行します。"
    },
    {
      "indent": 3,
      "text": "o Make sure that the network has enough resources to set up the requested LSP.",
      "ja": "Oネットワークが要求されたLSPを設定するために十分なリソースを持っていることを確認します。"
    },
    {
      "indent": 3,
      "text": "o Start the data path measurement and/or monitoring procedures on the ingress node and egress node. If an error-free signal is received by the egress node before a PATH message is sent, report an error and terminate the measurement.",
      "ja": "Oデータパス測定を開始及び/又は入口ノードと出口ノード上の手順を監視します。 PATHメッセージが送信される前に、エラーのない信号を出口ノードによって受信された場合、エラーを報告し、測定を終了します。"
    },
    {
      "indent": 3,
      "text": "o At the ingress node, form the PATH message according to the LSP requirements and send the message towards the egress node.",
      "ja": "O入口ノードにおいて、LSPの要件に応じてPATHメッセージを形成し、出口ノードに向けてメッセージを送信します。"
    },
    {
      "indent": 3,
      "text": "o Upon receiving the last bit of the corresponding Resv message, take the timestamp (T1) on the ingress node as soon as possible.",
      "ja": "O対応するResvメッセージの最後のビットを受信すると、できるだけ早く入口ノードのタイムスタンプ（T1）を取ります。"
    },
    {
      "indent": 3,
      "text": "o When an error-free signal is observed on the egress node, take the timestamp (T2) as soon as possible. An estimate of RRFD (T2 - T1) can be computed.",
      "ja": "エラーフリー信号が出口ノードで観察すると、O、できるだけ早くタイムスタンプ（T2）を取ります。 RRFD（T2  -  T1）の推定値を計算することができます。"
    },
    {
      "indent": 3,
      "text": "o If the corresponding Resv message arrives but no error-free signal is received within a reasonable period of time by the ingress node, RRFD is deemed to be undefined.",
      "ja": "対応するResvメッセージが到着したが、エラーのない信号を入口ノードによって合理的な期間内に受信されない場合、O、RRFDは不定すると考えられます。"
    },
    {
      "indent": 3,
      "text": "o If the LSP setup fails, RRFD is not counted.",
      "ja": "LSPのセットアップが失敗した場合、O、RRFDはカウントされません。"
    },
    {
      "indent": 0,
      "text": "6. A Singleton Definition for RSRD",
      "section_title": true,
      "ja": "RSRD 6. Aシングルトンの定義"
    },
    {
      "indent": 3,
      "text": "This part defines a metric for reverse data path delay when an LSP is set up.",
      "ja": "この部分は、LSPがセットアップされ、逆方向データパス遅延のメトリックを定義します。"
    },
    {
      "indent": 3,
      "text": "As described in [RFC6383], the completion of the RSVP-TE signaling process does not necessarily mean that the cross-connections along the LSP being set up are in place and ready to carry traffic. This metric defines the time difference between the completion of the signaling process and the completion of the cross-connection programming along the reverse data path. This metric MAY be used together with RRFD to characterize the data path delay of a bidirectional LSP.",
      "ja": "[RFC6383]に記載されているように、RSVP-TEシグナリングプロセスの完了は必ずしもLSPに沿って相互接続が設定されていることを意味するものではない場所で、トラフィックを伝送する準備ができています。このメトリックは、シグナリング処理の完了と逆方向データ経路に沿ってクロスコネクトプログラミングの完了の間の時間差を定義します。このメトリックは、双方向LSPのデータパス遅延を特徴付けるためにRRFDを併用してもよいです。"
    },
    {
      "indent": 0,
      "text": "6.1. Motivation",
      "section_title": true,
      "ja": "6.1。動機"
    },
    {
      "indent": 3,
      "text": "RSRD is useful for the following reasons:",
      "ja": "RSRDは、次のような理由のために有用です。"
    },
    {
      "indent": 3,
      "text": "o For the reasons described in [RFC6383], the data path may not be ready for use instantly after the completion of the RSVP-TE signaling process. The delay itself is part of the implementation performance.",
      "ja": "O [RFC6383]に記載の理由により、データ・パスは、RSVP-TEシグナリングプロセスの完了後、即座に使用できる状態ではないかもしれません。遅延自体は実装性能の一部です。"
    },
    {
      "indent": 3,
      "text": "o The completion of the signaling process may be used by application designers as an indication of data path connectivity. The existence of this delay and the possible failure of cross-connection programming, if not properly treated, will result in data loss or application failure. The typical value of this delay can thus help designers to improve the application model.",
      "ja": "Oシグナリング処理の完了は、データパス接続性の指標として、アプリケーション設計者によって使用されてもよいです。この遅延とクロスコネクトプログラミングの可能な故障の存在は、適切に処理されていない場合、データの損失やアプリケーションの失敗をもたらすであろう。この遅延の典型的な値は、このように、設計者はアプリケーションモデルを向上させることができます。"
    },
    {
      "indent": 0,
      "text": "6.2. Metric Name",
      "section_title": true,
      "ja": "6.2。メトリック名"
    },
    {
      "indent": 3,
      "text": "RSRD = Resv Sent, Reverse Data path",
      "ja": "RSRD =のResv送信され、逆方向データ・パス"
    },
    {
      "indent": 0,
      "text": "6.3. Metric Parameters",
      "section_title": true,
      "ja": "6.3。メトリックパラメータ"
    },
    {
      "indent": 3,
      "text": "o ID0, the ingress LSR ID",
      "ja": "O ID0、イングレスLSR ID"
    },
    {
      "indent": 3,
      "text": "o ID1, the egress LSR ID",
      "ja": "ID1、出口LSR ID O"
    },
    {
      "indent": 3,
      "text": "o T, a time when the setup is attempted",
      "ja": "O T、セットアップが試みられる時間"
    },
    {
      "indent": 0,
      "text": "6.4. Metric Units",
      "section_title": true,
      "ja": "6.4。メートル法"
    },
    {
      "indent": 3,
      "text": "The value of RSRD is either a real number of milliseconds or undefined.",
      "ja": "RSRDの値はミリ秒単位または未定義の実数のいずれかです。"
    },
    {
      "indent": 0,
      "text": "6.5. Definition",
      "section_title": true,
      "ja": "6.5。定義"
    },
    {
      "indent": 3,
      "text": "For a real number dT,",
      "ja": "実数dTのために、"
    },
    {
      "indent": 6,
      "text": "RSRD from ingress node ID0 to egress node ID1 at T is dT",
      "ja": "Tにおける入口ノードID0から出口ノードID1にRSRDはdTのあります"
    },
    {
      "indent": 3,
      "text": "means that",
      "ja": "という意味です"
    },
    {
      "indent": 3,
      "text": "o ingress node ID0 sends a PATH message to egress node ID1,",
      "ja": "Oの入口ノードID0は、出口ノードID1にPATHメッセージを送信します"
    },
    {
      "indent": 3,
      "text": "o the last bit of the corresponding Resv message is sent by egress node ID1 at T, and",
      "ja": "対応するResvメッセージの最後のビットがTで出口ノードID1によって送信され、O、及び"
    },
    {
      "indent": 3,
      "text": "o an error-free signal is received by the ingress node ID0 using a data-plane-specific test pattern at T+dT.",
      "ja": "Oエラーのない信号は、T + dTのでデータプレーン固有のテストパターンを用いて、入口ノードID0によって受信されます。"
    },
    {
      "indent": 0,
      "text": "6.6. Discussion",
      "section_title": true,
      "ja": "6.6。討論"
    },
    {
      "indent": 3,
      "text": "The following issues are likely to come up in practice:",
      "ja": "次の問題は、実際に出てくる可能性があります。"
    },
    {
      "indent": 3,
      "text": "o The accuracy of RSRD depends on the clock resolution of both the ingress node and egress node. Clock synchronization between the ingress node and egress node is required.",
      "ja": "O RSRDの精度は、入口ノードと出口ノードの両方のクロックの分解能に依存します。入口ノードと出口ノード間のクロック同期が必要です。"
    },
    {
      "indent": 3,
      "text": "o The accuracy of RSRD is also dependent on how the error-free signal is received and may differ significantly when the underlying data plane technology is different. For instance, for an LSP between a pair of Ethernet interfaces, the egress node (sometimes the tester) may use a rate-based method to verify the connectivity of the data path and use the reception of the first error-free frame as the error-free signal. In this case, the interval between two successive frames has a significant impact on accuracy. It is RECOMMENDED in this case that the egress node use small intervals, under the condition that the injected traffic does not exceed the capacity of the reverse data path. The value of the interval MUST be reported.",
      "ja": "O RSRDの精度は、エラーのない信号が受信され、基礎となるデータプレーン技術が異なる場合に大きく異なる可能性がどのように依存しています。例えば、イーサネットインターフェイスのペア間のLSPのために、出口ノード（時にはテスタ）は、データ経路の接続性を検証し、エラーとして最初のエラーなしフレームの受信を使用するレートに基づく方法を使用することができますフリー信号。この場合、2つの連続するフレーム間の間隔は、精度に大きな影響を有します。これは、出口ノードが注入されたトラフィックは、逆方向データパスの容量を超えないことを条件に、小さな間隔を使用し、この場合に推奨されます。インターバルの値が報告されなければなりません。"
    },
    {
      "indent": 3,
      "text": "o The accuracy of RSRD is also dependent on the time needed to propagate the error-free signal from the egress node to the ingress node. A typical value for propagating the error-free signal from the egress node to the ingress node under the same measurement setup MAY be reported. The methodology to obtain such values is outside the scope of this document.",
      "ja": "O RSRDの精度はまた、入口ノードに出口ノードからエラーのない信号を伝播するのに必要な時間に依存します。同じ測定セットアップの下で入口ノードへの出口ノードからエラーのない信号を伝播するための典型的な値は報告されてもよいです。このような値を得るための方法は、この文書の範囲外です。"
    },
    {
      "indent": 3,
      "text": "o The accuracy of this metric is also dependent on the physical-layer serialization/deserialization of the test signal for certain data path technologies. For instance, for an LSP between a pair of low-speed Ethernet interfaces, the time needed to serialize/ deserialize a large frame may not be negligible. In this case, it is RECOMMENDED that the egress node use small frames. The average length of the frame MAY be reported.",
      "ja": "このメトリックの精度oを、特定のデータ・パス技術のテスト信号の物理層シリアライズ/デシリアライズに依存しています。例えば、低速イーサネットインターフェイスのペア間のLSPのために、大きいフレームを逆シリアル化/シリアル化するために必要な時間は無視できないかもしれません。この場合、出口ノードは、小さなフレームを使用することをお勧めします。フレームの平均長さが報告されてもよいです。"
    },
    {
      "indent": 3,
      "text": "o If the corresponding Resv message is sent but no error-free signal is received by the ingress node within a reasonable period of time, i.e., a threshold, RSRD MUST be treated as undefined. The value of the threshold MUST be reported.",
      "ja": "合理的な期間内に入口ノードによって対応するResvメッセージが送信されるが、エラーのない信号が受信されない場合、O、すなわち、閾値は、RSRDは未定義として扱わなければなりません。しきい値の値は報告しなければなりません。"
    },
    {
      "indent": 3,
      "text": "o If an error-free signal is received before a PATH message is sent on the ingress node, an error MUST be reported and the measurement SHOULD terminate.",
      "ja": "PATHメッセージが入口ノードに送信される前に、エラーのない信号を受信した場合、O、エラーが報告されなければならないと測定が終了すべき。"
    },
    {
      "indent": 3,
      "text": "o If the LSP setup fails, this metric value MUST NOT be counted.",
      "ja": "LSPのセットアップが失敗した場合、O、このメトリック値がカウントされてはなりません。"
    },
    {
      "indent": 0,
      "text": "6.7. Methodologies",
      "section_title": true,
      "ja": "6.7。方法論"
    },
    {
      "indent": 3,
      "text": "Generally, the methodology would proceed as follows:",
      "ja": "次のように一般的に、方法論は進行します。"
    },
    {
      "indent": 3,
      "text": "o Make sure that the network has enough resources to set up the requested LSP.",
      "ja": "Oネットワークが要求されたLSPを設定するために十分なリソースを持っていることを確認します。"
    },
    {
      "indent": 3,
      "text": "o Start the data path measurement and/or monitoring procedures on the ingress node and egress node. If an error-free signal is received by the ingress node before a PATH message is sent, report an error and terminate the measurement.",
      "ja": "Oデータパス測定を開始及び/又は入口ノードと出口ノード上の手順を監視します。 PATHメッセージが送信される前に、エラーのない信号を入口ノードによって受信された場合、エラーを報告し、測定を終了します。"
    },
    {
      "indent": 3,
      "text": "o At the ingress node, form the PATH message according to the LSP requirements and send the message towards the egress node.",
      "ja": "O入口ノードにおいて、LSPの要件に応じてPATHメッセージを形成し、出口ノードに向けてメッセージを送信します。"
    },
    {
      "indent": 3,
      "text": "o Upon sending the last bit of the corresponding Resv message, take the timestamp (T1) on the egress node as soon as possible.",
      "ja": "O対応するResvメッセージの最後のビットを送信すると、できるだけ早く出口ノードのタイムスタンプ（T1）を取ります。"
    },
    {
      "indent": 3,
      "text": "o When an error-free signal is observed on the ingress node, take the timestamp (T2) as soon as possible. An estimate of RSRD (T2 - T1) can be computed.",
      "ja": "エラーのない信号を入口ノードで観察すると、O、できるだけ早くタイムスタンプ（T2）を取ります。 RSRD（T2  -  T1）の推定値を計算することができます。"
    },
    {
      "indent": 3,
      "text": "o If the LSP setup fails, RSRD is not counted.",
      "ja": "LSPのセットアップが失敗した場合、O、RSRDはカウントされません。"
    },
    {
      "indent": 3,
      "text": "o If no error-free signal is received within a reasonable period of time by the ingress node, RSRD is deemed to be undefined.",
      "ja": "エラーのない信号を入口ノードによって合理的な期間内に受信されない場合、O、RSRDは不定すると考えられます。"
    },
    {
      "indent": 0,
      "text": "7. A Singleton Definition for PRFD",
      "section_title": true,
      "ja": "PRFD 7. Aシングルトンの定義"
    },
    {
      "indent": 3,
      "text": "This part defines a metric for forward data path delay when an LSP is set up.",
      "ja": "この部分は、LSPがセットアップされる順方向データ・パス遅延のメトリックを定義します。"
    },
    {
      "indent": 3,
      "text": "In an RSVP-TE implementation, when setting up an LSP, each node may choose to program the cross-connection before it sends a PATH message further downstream. In this case, the forward data path may become ready for use before the signaling process completes, i.e., before the Resv message reaches the ingress node. This metric can be used to identify such an implementation practice and give useful information to application designers.",
      "ja": "LSPを設定するときにRSVP-TEの実装では、各ノードは、それがさらに下流PATHメッセージを送信する前に相互接続をプログラムすることを選択することができます。シグナリング処理が完了する前にResvメッセージが入口ノードに到達する前に、この場合には、順方向データ・パスは、すなわち、使用可能な状態になることができます。このメトリックは、このような実装の練習を識別し、アプリケーションの設計者に有用な情報を与えるために使用することができます。"
    },
    {
      "indent": 0,
      "text": "7.1. Motivation",
      "section_title": true,
      "ja": "7.1。動機"
    },
    {
      "indent": 3,
      "text": "PRFD is useful for the following reasons:",
      "ja": "PRFDは、次のような理由のために有用です。"
    },
    {
      "indent": 3,
      "text": "o PRFD can be used to identify an RSVP-TE implementation practice in which cross-connections are programmed before a PATH message is sent downstream.",
      "ja": "O PRFDは、PATHメッセージがダウンストリーム送信される前にクロスコネクトがプログラムされたRSVP-TEの実装練習を識別するために使用することができます。"
    },
    {
      "indent": 3,
      "text": "o The value of PRFD may also help application designers to fine-tune their application model.",
      "ja": "O PRFDの値は、アプリケーションの設計者は微調整するのを助けることができる彼らのアプリケーションモデルを。"
    },
    {
      "indent": 0,
      "text": "7.2. Metric Name",
      "section_title": true,
      "ja": "7.2。メトリック名"
    },
    {
      "indent": 3,
      "text": "PRFD = PATH Received, Forward Data path",
      "ja": "PRFD = PATH受信し、順方向データ・パス"
    },
    {
      "indent": 0,
      "text": "7.3. Metric Parameters",
      "section_title": true,
      "ja": "7.3。メトリックパラメータ"
    },
    {
      "indent": 3,
      "text": "o ID0, the ingress LSR ID",
      "ja": "O ID0、イングレスLSR ID"
    },
    {
      "indent": 3,
      "text": "o ID1, the egress LSR ID",
      "ja": "ID1、出口LSR ID O"
    },
    {
      "indent": 3,
      "text": "o T, a time when the setup is attempted",
      "ja": "O T、セットアップが試みられる時間"
    },
    {
      "indent": 0,
      "text": "7.4. Metric Units",
      "section_title": true,
      "ja": "7.4。メートル法"
    },
    {
      "indent": 3,
      "text": "The value of PRFD is either a real number of milliseconds or undefined.",
      "ja": "PRFDの値はミリ秒単位または未定義の実数のいずれかです。"
    },
    {
      "indent": 0,
      "text": "7.5. Definition",
      "section_title": true,
      "ja": "7.5。定義"
    },
    {
      "indent": 3,
      "text": "For a real number dT,",
      "ja": "実数dTのために、"
    },
    {
      "indent": 6,
      "text": "PRFD from ingress node ID0 to egress node ID1 at T is dT",
      "ja": "Tにおける入口ノードID0から出口ノードID1にPRFDはdTのあります"
    },
    {
      "indent": 3,
      "text": "means that",
      "ja": "という意味です"
    },
    {
      "indent": 3,
      "text": "o ingress node ID0 sends a PATH message to egress node ID1,",
      "ja": "Oの入口ノードID0は、出口ノードID1にPATHメッセージを送信します"
    },
    {
      "indent": 3,
      "text": "o the last bit of the PATH message is received by egress node ID1 at T, and",
      "ja": "PATHメッセージの最後のビットがTで出口ノードID1によって受信され、O、及び"
    },
    {
      "indent": 3,
      "text": "o an error-free signal is received by the egress node ID1 using a data-plane-specific test pattern at T+dT.",
      "ja": "Oエラーのない信号は、T + dTのでデータプレーン固有のテストパターンを使用して出口ノードID1によって受信されます。"
    },
    {
      "indent": 0,
      "text": "7.6. Discussion",
      "section_title": true,
      "ja": "7.6。討論"
    },
    {
      "indent": 3,
      "text": "The following issues are likely to come up in practice:",
      "ja": "次の問題は、実際に出てくる可能性があります。"
    },
    {
      "indent": 3,
      "text": "o The accuracy of PRFD depends on the clock resolution of the egress node. Clock synchronization between the ingress node and egress node is not required.",
      "ja": "O PRFDの精度は、出口ノードのクロックの分解能に依存します。入口ノードと出口ノード間のクロック同期が必要とされていません。"
    },
    {
      "indent": 3,
      "text": "o The accuracy of PRFD is also dependent on how the error-free signal is received and may differ significantly when the underlying data plane technology is different. For instance, for an LSP between a pair of Ethernet interfaces, the egress node (sometimes the tester) may use a rate-based method to verify the connectivity of the data path and use the reception of the first error-free frame as the error-free signal. In this case, the interval between two successive frames has a significant impact on accuracy. It is RECOMMENDED in this case that the ingress node use small intervals, under the condition that the injected traffic does not exceed the capacity of the forward data path. The value of the interval MUST be reported.",
      "ja": "O PRFDの精度は、エラーのない信号が受信され、基礎となるデータプレーン技術が異なる場合に大きく異なる可能性がどのように依存しています。例えば、イーサネットインターフェイスのペア間のLSPのために、出口ノード（時にはテスタ）は、データ経路の接続性を検証し、エラーとして最初のエラーなしフレームの受信を使用するレートに基づく方法を使用することができますフリー信号。この場合、2つの連続するフレーム間の間隔は、精度に大きな影響を有します。これは、入口ノードが注入されたトラフィックは、順方向データ・パスの容量を超えないことを条件に、小さな間隔を使用し、この場合に推奨されます。インターバルの値が報告されなければなりません。"
    },
    {
      "indent": 3,
      "text": "o The accuracy of PRFD is also dependent on the time needed to propagate the error-free signal from the ingress node to the egress node. A typical value for propagating the error-free signal from the ingress node to the egress node under the same measurement setup MAY be reported. The methodology to obtain such values is outside the scope of this document.",
      "ja": "O PRFDの精度はまた、出口ノードへの入口ノードからエラーのない信号を伝播するのに必要な時間に依存します。同じ測定セットアップの下に出口ノードへの入口ノードからエラーのない信号を伝播するための典型的な値は報告されてもよいです。このような値を得るための方法は、この文書の範囲外です。"
    },
    {
      "indent": 3,
      "text": "o The accuracy of this metric is also dependent on the physical-layer serialization/deserialization of the test signal for certain data path technologies. For instance, for an LSP between a pair of low-speed Ethernet interfaces, the time needed to serialize/ deserialize a large frame may not be negligible. In this case, it is RECOMMENDED that the ingress node use small frames. The average length of the frame MAY be reported.",
      "ja": "このメトリックの精度oを、特定のデータ・パス技術のテスト信号の物理層シリアライズ/デシリアライズに依存しています。例えば、低速イーサネットインターフェイスのペア間のLSPのために、大きいフレームを逆シリアル化/シリアル化するために必要な時間は無視できないかもしれません。この場合、入口ノードは、小さなフレームを使用することをお勧めします。フレームの平均長さが報告されてもよいです。"
    },
    {
      "indent": 3,
      "text": "o If an error-free signal is received before a PATH message is sent, an error MUST be reported and the measurement SHOULD terminate.",
      "ja": "PATHメッセージが送信される前に、エラーのない信号を受信した場合、O、エラーが報告されなければならないと測定が終了すべき。"
    },
    {
      "indent": 3,
      "text": "o If the LSP setup fails, this metric value MUST NOT be counted.",
      "ja": "LSPのセットアップが失敗した場合、O、このメトリック値がカウントされてはなりません。"
    },
    {
      "indent": 3,
      "text": "o This metric SHOULD be used together with RRFD. It is RECOMMENDED that a PRFD measurement be carried out after a negative RRFD value has already been observed.",
      "ja": "Oこのメトリックは、RRFDと一緒に使用してください。負のRRFD値が既に観察された後PRFD測定を行うことが推奨されます。"
    },
    {
      "indent": 0,
      "text": "7.7. Methodologies",
      "section_title": true,
      "ja": "7.7。方法論"
    },
    {
      "indent": 3,
      "text": "Generally, the methodology would proceed as follows:",
      "ja": "次のように一般的に、方法論は進行します。"
    },
    {
      "indent": 3,
      "text": "o Make sure that the network has enough resources to set up the requested LSP.",
      "ja": "Oネットワークが要求されたLSPを設定するために十分なリソースを持っていることを確認します。"
    },
    {
      "indent": 3,
      "text": "o Start the data path measurement and/or monitoring procedures on the ingress node and egress node. If an error-free signal is received by the egress node before a PATH message is sent, report an error and terminate the measurement.",
      "ja": "Oデータパス測定を開始及び/又は入口ノードと出口ノード上の手順を監視します。 PATHメッセージが送信される前に、エラーのない信号を出口ノードによって受信された場合、エラーを報告し、測定を終了します。"
    },
    {
      "indent": 3,
      "text": "o At the ingress node, form the PATH message according to the LSP requirements and send the message towards the egress node.",
      "ja": "O入口ノードにおいて、LSPの要件に応じてPATHメッセージを形成し、出口ノードに向けてメッセージを送信します。"
    },
    {
      "indent": 3,
      "text": "o Upon receiving the last bit of the PATH message, take the timestamp (T1) on the egress node as soon as possible.",
      "ja": "O PATHメッセージの最後のビットを受信すると、できるだけ早く出口ノードのタイムスタンプ（T1）を取ります。"
    },
    {
      "indent": 3,
      "text": "o When an error-free signal is observed on the egress node, take the timestamp (T2) as soon as possible. An estimate of PRFD (T2 - T1) can be computed.",
      "ja": "エラーフリー信号が出口ノードで観察すると、O、できるだけ早くタイムスタンプ（T2）を取ります。 PRFD（T2  -  T1）の推定値を計算することができます。"
    },
    {
      "indent": 3,
      "text": "o If the LSP setup fails, PRFD is not counted.",
      "ja": "LSPのセットアップが失敗した場合、O、PRFDはカウントされません。"
    },
    {
      "indent": 3,
      "text": "o If no error-free signal is received within a reasonable period of time by the egress node, PRFD is deemed to be undefined.",
      "ja": "エラーフリー信号が出口ノードによって合理的な期間内に受信されない場合、O、PRFDは不定すると考えられます。"
    },
    {
      "indent": 0,
      "text": "8. A Singleton Definition for PSFD",
      "section_title": true,
      "ja": "PSFD 8. Aシングルトンの定義"
    },
    {
      "indent": 3,
      "text": "This part defines a metric for forward data path delay when an LSP is set up.",
      "ja": "この部分は、LSPがセットアップされる順方向データ・パス遅延のメトリックを定義します。"
    },
    {
      "indent": 3,
      "text": "As described in [RFC6383], the completion of the RSVP-TE signaling process does not necessarily mean that the cross-connections along the LSP being set up are in place and ready to carry traffic. This metric defines the time difference between the point when the PATH message is sent by the ingress node and the completion of the cross-connection programming along the LSP forward data path.",
      "ja": "[RFC6383]に記載されているように、RSVP-TEシグナリングプロセスの完了は必ずしもLSPに沿って相互接続が設定されていることを意味するものではない場所で、トラフィックを伝送する準備ができています。このメトリックは、PATHメッセージが入口ノードとLSPフォワードデータ経路に沿ってクロスコネクトプログラミングの完了によって送信された時点との時間差を定義します。"
    },
    {
      "indent": 0,
      "text": "8.1. Motivation",
      "section_title": true,
      "ja": "8.1。動機"
    },
    {
      "indent": 3,
      "text": "PSFD is useful for the following reasons:",
      "ja": "PSFDは、次のような理由のために有用です。"
    },
    {
      "indent": 3,
      "text": "o For the reasons described in [RFC6383], the data path setup delay may not be consistent with the control plane LSP setup delay. The data path setup delay metric is more precise for LSP setup performance measurement.",
      "ja": "O [RFC6383]に記載の理由により、データパス設定遅延は、制御プレーンLSPセットアップ遅延と一致しないかもしれません。データパス設定遅延メトリックは、LSPセットアップ性能測定のために、より正確です。"
    },
    {
      "indent": 3,
      "text": "o The completion of the signaling process may be used by application designers as an indication of data path connectivity. The difference between the control plane setup delay and data path delay, and the potential failure of cross-connection programming, if not properly treated, will result in data loss or application failure. This metric can thus help designers to improve the application model.",
      "ja": "Oシグナリング処理の完了は、データパス接続性の指標として、アプリケーション設計者によって使用されてもよいです。制御プレーンのセットアップ遅延及びデータパス遅延、及び相互接続のプログラミングの潜在的な故障との差は、適切に処理されていない場合、データの損失やアプリケーションの失敗をもたらすであろう。このメトリックは、このように、設計者はアプリケーションモデルを向上させることができます。"
    },
    {
      "indent": 0,
      "text": "8.2. Metric Name",
      "section_title": true,
      "ja": "8.2。メトリック名"
    },
    {
      "indent": 3,
      "text": "PSFD = PATH Sent, Forward Data path",
      "ja": "PSFD = PATH送信され、順方向データ・パス"
    },
    {
      "indent": 0,
      "text": "8.3. Metric Parameters",
      "section_title": true,
      "ja": "8.3。メトリックパラメータ"
    },
    {
      "indent": 3,
      "text": "o ID0, the ingress LSR ID",
      "ja": "O ID0、イングレスLSR ID"
    },
    {
      "indent": 3,
      "text": "o ID1, the egress LSR ID",
      "ja": "ID1、出口LSR ID O"
    },
    {
      "indent": 3,
      "text": "o T, a time when the setup is attempted",
      "ja": "O T、セットアップが試みられる時間"
    },
    {
      "indent": 0,
      "text": "8.4. Metric Units",
      "section_title": true,
      "ja": "8.4。メートル法"
    },
    {
      "indent": 3,
      "text": "The value of PSFD is either a real number of milliseconds or undefined.",
      "ja": "PSFDの値はミリ秒単位または未定義の実数のいずれかです。"
    },
    {
      "indent": 0,
      "text": "8.5. Definition",
      "section_title": true,
      "ja": "8.5。定義"
    },
    {
      "indent": 3,
      "text": "For a real number dT,",
      "ja": "実数dTのために、"
    },
    {
      "indent": 6,
      "text": "PSFD from ingress node ID0 to egress node ID1 at T is dT",
      "ja": "Tにおける入口ノードID0から出口ノードID1にPSFDはdTのあります"
    },
    {
      "indent": 3,
      "text": "means that",
      "ja": "という意味です"
    },
    {
      "indent": 3,
      "text": "o ingress node ID0 sends the first bit of a PATH message to egress node ID1 at T, and",
      "ja": "O入口ノードID0はTで出口ノードID1にPATHメッセージの最初のビットを送信し、そして"
    },
    {
      "indent": 3,
      "text": "o an error-free signal is received by the egress node ID1 using a data-plane-specific test pattern at T+dT.",
      "ja": "Oエラーのない信号は、T + dTのでデータプレーン固有のテストパターンを使用して出口ノードID1によって受信されます。"
    },
    {
      "indent": 0,
      "text": "8.6. Discussion",
      "section_title": true,
      "ja": "8.6。討論"
    },
    {
      "indent": 3,
      "text": "The following issues are likely to come up in practice:",
      "ja": "次の問題は、実際に出てくる可能性があります。"
    },
    {
      "indent": 3,
      "text": "o The accuracy of PSFD depends on the clock resolution of both the ingress node and egress node. Clock synchronization between the ingress node and egress node is required.",
      "ja": "O PSFDの精度は、入口ノードと出口ノードの両方のクロックの分解能に依存します。入口ノードと出口ノード間のクロック同期が必要です。"
    },
    {
      "indent": 3,
      "text": "o The accuracy of PSFD is also dependent on how the error-free signal is received and may differ significantly when the underlying data plane technology is different. For instance, for an LSP between a pair of Ethernet interfaces, the ingress node may use a rate-based method to verify the connectivity of the data path and use the reception of the first error-free frame as the error-free signal. In this case, the interval between two successive frames has a significant impact on accuracy. It is RECOMMENDED that the ingress node use small intervals, under the condition that the injected traffic does not exceed the capacity of the forward data path. The value of the interval MUST be reported.",
      "ja": "O PSFDの精度は、エラーのない信号が受信され、基礎となるデータプレーン技術が異なる場合に大きく異なる可能性がどのように依存しています。例えば、イーサネットインターフェイスのペア間のLSPのために、レートベースの方法を使用することができる入口ノードは、データパスの接続を確認し、エラーのない信号として第1のエラーのないフレームの受信を使用します。この場合、2つの連続するフレーム間の間隔は、精度に大きな影響を有します。入口ノードが注入されたトラフィックは、順方向データ・パスの容量を超えないことを条件に、小さな間隔を使用することをお勧めします。インターバルの値が報告されなければなりません。"
    },
    {
      "indent": 3,
      "text": "o The accuracy of PSFD is also dependent on the time needed to propagate the error-free signal from the ingress node to the egress node. A typical value for propagating the error-free signal from the ingress node to the egress node under the same measurement setup MAY be reported. The methodology to obtain such values is outside the scope of this document.",
      "ja": "O PSFDの精度はまた、出口ノードへの入口ノードからエラーのない信号を伝播するのに必要な時間に依存します。同じ測定セットアップの下に出口ノードへの入口ノードからエラーのない信号を伝播するための典型的な値は報告されてもよいです。このような値を得るための方法は、この文書の範囲外です。"
    },
    {
      "indent": 3,
      "text": "o The accuracy of this metric is also dependent on the physical-layer serialization/deserialization of the test signal for certain data path technologies. For instance, for an LSP between a pair of low-speed Ethernet interfaces, the time needed to serialize/ deserialize a large frame may not be negligible. In this case, it is RECOMMENDED that the ingress node use small frames. The average length of the frame MAY be reported.",
      "ja": "このメトリックの精度oを、特定のデータ・パス技術のテスト信号の物理層シリアライズ/デシリアライズに依存しています。例えば、低速イーサネットインターフェイスのペア間のLSPのために、大きいフレームを逆シリアル化/シリアル化するために必要な時間は無視できないかもしれません。この場合、入口ノードは、小さなフレームを使用することをお勧めします。フレームの平均長さが報告されてもよいです。"
    },
    {
      "indent": 3,
      "text": "o If an error-free signal is received before a PATH message is sent, an error MUST be reported and the measurement SHOULD terminate.",
      "ja": "PATHメッセージが送信される前に、エラーのない信号を受信した場合、O、エラーが報告されなければならないと測定が終了すべき。"
    },
    {
      "indent": 3,
      "text": "o If the LSP setup fails, this metric value MUST NOT be counted.",
      "ja": "LSPのセットアップが失敗した場合、O、このメトリック値がカウントされてはなりません。"
    },
    {
      "indent": 3,
      "text": "o If the PATH message is sent by the ingress node but no error-free signal is received by the egress node within a reasonable period of time, i.e., a threshold, PSFD MUST be treated as undefined. The value of the threshold MUST be reported.",
      "ja": "PATHメッセージが入口ノードによって送信されるが、エラーのない信号が合理的な期間内に出口ノードによって受信されない場合、O、すなわち、閾値は、PSFDは未定義として扱わなければなりません。しきい値の値は報告しなければなりません。"
    },
    {
      "indent": 0,
      "text": "8.7. Methodologies",
      "section_title": true,
      "ja": "8.7。方法論"
    },
    {
      "indent": 3,
      "text": "Generally, the methodology would proceed as follows:",
      "ja": "次のように一般的に、方法論は進行します。"
    },
    {
      "indent": 3,
      "text": "o Make sure that the network has enough resources to set up the requested LSP.",
      "ja": "Oネットワークが要求されたLSPを設定するために十分なリソースを持っていることを確認します。"
    },
    {
      "indent": 3,
      "text": "o Start the data path measurement and/or monitoring procedures on the ingress node and egress node. If an error-free signal is received by the egress node before a PATH message is sent, report an error and terminate the measurement.",
      "ja": "Oデータパス測定を開始及び/又は入口ノードと出口ノード上の手順を監視します。 PATHメッセージが送信される前に、エラーのない信号を出口ノードによって受信された場合、エラーを報告し、測定を終了します。"
    },
    {
      "indent": 3,
      "text": "o At the ingress node, form the PATH message according to the LSP requirements and send the message towards the egress node. A timestamp (T1) may be stored locally in the ingress node when the PATH message packet is sent towards the egress node.",
      "ja": "O入口ノードにおいて、LSPの要件に応じてPATHメッセージを形成し、出口ノードに向けてメッセージを送信します。 PATHメッセージパケットが出口ノードに向けて送信されたときのタイムスタンプ（T1）が入口ノードにローカルに格納されてもよいです。"
    },
    {
      "indent": 3,
      "text": "o When an error-free signal is observed on the egress node, take the timestamp (T2) as soon as possible. An estimate of PSFD (T2 - T1) can be computed.",
      "ja": "エラーフリー信号が出口ノードで観察すると、O、できるだけ早くタイムスタンプ（T2）を取ります。 PSFD（T2  -  T1）の推定値を計算することができます。"
    },
    {
      "indent": 3,
      "text": "o If the LSP setup fails, PSFD is not counted.",
      "ja": "LSPのセットアップが失敗した場合、O、PSFDはカウントされません。"
    },
    {
      "indent": 3,
      "text": "o If no error-free signal is received within a reasonable period of time by the egress node, PSFD is deemed to be undefined.",
      "ja": "エラーフリー信号が出口ノードによって合理的な期間内に受信されない場合、O、PSFDは不定すると考えられます。"
    },
    {
      "indent": 0,
      "text": "9. A Singleton Definition for PSRD",
      "section_title": true,
      "ja": "PSRD 9. Aシングルトンの定義"
    },
    {
      "indent": 3,
      "text": "This part defines a metric for reverse data path delay when an LSP is set up.",
      "ja": "この部分は、LSPがセットアップされ、逆方向データパス遅延のメトリックを定義します。"
    },
    {
      "indent": 3,
      "text": "This metric defines the time difference between the point when the ingress node sends the PATH message and the completion of the cross-connection programming along the LSP reverse data path. This metric MAY be used together with PSFD to characterize the data path delay of a bidirectional LSP.",
      "ja": "このメトリックは、入口ノードは、PATHメッセージとLSP逆方向データ経路に沿ってクロスコネクトプログラミングの完了を送信する時点との時間差を定義します。このメトリックは、双方向LSPのデータパス遅延を特徴付けるためにPSFDを併用してもよいです。"
    },
    {
      "indent": 0,
      "text": "9.1. Motivation",
      "section_title": true,
      "ja": "9.1。動機"
    },
    {
      "indent": 3,
      "text": "PSRD is useful for the following reasons:",
      "ja": "PSRDは、次のような理由のために有用です。"
    },
    {
      "indent": 3,
      "text": "o For the reasons described in [RFC6383], the data path setup delay may not be consistent with the control plane LSP setup delay. The data path setup delay metric is more precise for LSP setup performance measurement.",
      "ja": "O [RFC6383]に記載の理由により、データパス設定遅延は、制御プレーンLSPセットアップ遅延と一致しないかもしれません。データパス設定遅延メトリックは、LSPセットアップ性能測定のために、より正確です。"
    },
    {
      "indent": 3,
      "text": "o The completion of the signaling process may be used by application designers as an indication of data path connectivity. The difference between the control plane setup delay and data path delay, and the potential failure of cross-connection programming, if not properly treated, will result in data loss or application failure. This metric can thus help designers to improve the application model.",
      "ja": "Oシグナリング処理の完了は、データパス接続性の指標として、アプリケーション設計者によって使用されてもよいです。制御プレーンのセットアップ遅延及びデータパス遅延、及び相互接続のプログラミングの潜在的な故障との差は、適切に処理されていない場合、データの損失やアプリケーションの失敗をもたらすであろう。このメトリックは、このように、設計者はアプリケーションモデルを向上させることができます。"
    },
    {
      "indent": 0,
      "text": "9.2. Metric Name",
      "section_title": true,
      "ja": "9.2。メトリック名"
    },
    {
      "indent": 3,
      "text": "PSRD = PATH Sent, Reverse Data path",
      "ja": "PSRD = PATH送信され、逆方向データ・パス"
    },
    {
      "indent": 0,
      "text": "9.3. Metric Parameters",
      "section_title": true,
      "ja": "9.3。メトリックパラメータ"
    },
    {
      "indent": 3,
      "text": "o ID0, the ingress LSR ID",
      "ja": "O ID0、イングレスLSR ID"
    },
    {
      "indent": 3,
      "text": "o ID1, the egress LSR ID",
      "ja": "ID1、出口LSR ID O"
    },
    {
      "indent": 3,
      "text": "o T, a time when the setup is attempted",
      "ja": "O T、セットアップが試みられる時間"
    },
    {
      "indent": 0,
      "text": "9.4. Metric Units",
      "section_title": true,
      "ja": "9.4。メートル法"
    },
    {
      "indent": 3,
      "text": "The value of PSRD is either a real number of milliseconds or undefined.",
      "ja": "PSRDの値はミリ秒単位または未定義の実数のいずれかです。"
    },
    {
      "indent": 0,
      "text": "9.5. Definition",
      "section_title": true,
      "ja": "9.5。定義"
    },
    {
      "indent": 3,
      "text": "For a real number dT,",
      "ja": "実数dTのために、"
    },
    {
      "indent": 6,
      "text": "PSRD from ingress node ID0 to egress node ID1 at T is dT",
      "ja": "Tにおける入口ノードID0から出口ノードID1にPSRDはdTのあります"
    },
    {
      "indent": 3,
      "text": "means that",
      "ja": "という意味です"
    },
    {
      "indent": 3,
      "text": "o ingress node ID0 sends the first bit of a PATH message to egress node ID1 at T, and",
      "ja": "O入口ノードID0はTで出口ノードID1にPATHメッセージの最初のビットを送信し、そして"
    },
    {
      "indent": 3,
      "text": "o an error-free signal is received through the reverse data path by the ingress node ID0 using a data-plane-specific test pattern at T+dT.",
      "ja": "Oエラーフリー信号は、T + dTのでデータプレーン固有のテストパターンを用いて、入口ノードID0によって逆方向データパスを介して受信されます。"
    },
    {
      "indent": 0,
      "text": "9.6. Discussion",
      "section_title": true,
      "ja": "9.6。討論"
    },
    {
      "indent": 3,
      "text": "The following issues are likely to come up in practice:",
      "ja": "次の問題は、実際に出てくる可能性があります。"
    },
    {
      "indent": 3,
      "text": "o The accuracy of PSRD depends on the clock resolution of the ingress node. Clock synchronization between the ingress node and egress node is not required.",
      "ja": "O PSRDの精度は、入口ノードのクロックの分解能に依存します。入口ノードと出口ノード間のクロック同期が必要とされていません。"
    },
    {
      "indent": 3,
      "text": "o The accuracy of PSRD is also dependent on how the error-free signal is received and may differ significantly when the underlying data plane technology is different. For instance, for an LSP between a pair of Ethernet interfaces, the egress node may use a rate-based method to verify the connectivity of the data path and use the reception of the first error-free frame as the error-free signal. In this case, the interval between two successive frames has a significant impact on accuracy. It is RECOMMENDED that the egress node use small intervals, under the condition that the injected traffic does not exceed the capacity of the forward data path. The value of the interval MUST be reported.",
      "ja": "O PSRDの精度は、エラーのない信号が受信され、基礎となるデータプレーン技術が異なる場合に大きく異なる可能性がどのように依存しています。例えば、イーサネットインターフェイスのペア間のLSPのために、レートベースの方法を使用することができる出口ノードは、データパスの接続を確認し、エラーのない信号として第1のエラーのないフレームの受信を使用します。この場合、2つの連続するフレーム間の間隔は、精度に大きな影響を有します。出口ノードが注入されたトラフィックは、順方向データ・パスの容量を超えないことを条件に、小さな間隔を使用することをお勧めします。インターバルの値が報告されなければなりません。"
    },
    {
      "indent": 3,
      "text": "o The accuracy of PSRD is also dependent on the time needed to propagate the error-free signal from the egress node to the ingress node. A typical value for propagating the error-free signal from the egress node to the ingress node under the same measurement setup MAY be reported. The methodology to obtain such values is outside the scope of this document.",
      "ja": "O PSRDの精度はまた、入口ノードに出口ノードからエラーのない信号を伝播するのに必要な時間に依存します。同じ測定セットアップの下で入口ノードへの出口ノードからエラーのない信号を伝播するための典型的な値は報告されてもよいです。このような値を得るための方法は、この文書の範囲外です。"
    },
    {
      "indent": 3,
      "text": "o The accuracy of this metric is also dependent on the physical-layer serialization/deserialization of the test signal for certain data path technologies. For instance, for an LSP between a pair of low-speed Ethernet interfaces, the time needed to serialize/ deserialize a large frame may not be negligible. In this case, it is RECOMMENDED that the egress node use small frames. The average length of the frame MAY be reported.",
      "ja": "このメトリックの精度oを、特定のデータ・パス技術のテスト信号の物理層シリアライズ/デシリアライズに依存しています。例えば、低速イーサネットインターフェイスのペア間のLSPのために、大きいフレームを逆シリアル化/シリアル化するために必要な時間は無視できないかもしれません。この場合、出口ノードは、小さなフレームを使用することをお勧めします。フレームの平均長さが報告されてもよいです。"
    },
    {
      "indent": 3,
      "text": "o If an error-free signal is received before a PATH message is sent, an error MUST be reported and the measurement SHOULD terminate.",
      "ja": "PATHメッセージが送信される前に、エラーのない信号を受信した場合、O、エラーが報告されなければならないと測定が終了すべき。"
    },
    {
      "indent": 3,
      "text": "o If the LSP setup fails, this metric value MUST NOT be counted.",
      "ja": "LSPのセットアップが失敗した場合、O、このメトリック値がカウントされてはなりません。"
    },
    {
      "indent": 3,
      "text": "o If the PATH message is sent by the ingress node but no error-free signal is received by the ingress node within a reasonable period of time, i.e., a threshold, PSRD MUST be treated as undefined. The value of the threshold MUST be reported.",
      "ja": "PATHメッセージが入口ノードによって送信されるが、エラーのない信号が合理的な期間内に入口ノードによって受信されない場合、O、すなわち、閾値は、PSRDは未定義として扱わなければなりません。しきい値の値は報告しなければなりません。"
    },
    {
      "indent": 0,
      "text": "9.7. Methodologies",
      "section_title": true,
      "ja": "9.7。方法論"
    },
    {
      "indent": 3,
      "text": "Generally, the methodology would proceed as follows:",
      "ja": "次のように一般的に、方法論は進行します。"
    },
    {
      "indent": 3,
      "text": "o Make sure that the network has enough resources to set up the requested LSP.",
      "ja": "Oネットワークが要求されたLSPを設定するために十分なリソースを持っていることを確認します。"
    },
    {
      "indent": 3,
      "text": "o Start the data path measurement and/or monitoring procedures on the ingress node and egress node. If an error-free signal is received by the egress node before a PATH message is sent, report an error and terminate the measurement.",
      "ja": "Oデータパス測定を開始及び/又は入口ノードと出口ノード上の手順を監視します。 PATHメッセージが送信される前に、エラーのない信号を出口ノードによって受信された場合、エラーを報告し、測定を終了します。"
    },
    {
      "indent": 3,
      "text": "o At the ingress node, form the PATH message according to the LSP requirements and send the message towards the egress node. A timestamp (T1) may be stored locally in the ingress node when the PATH message packet is sent towards the egress node.",
      "ja": "O入口ノードにおいて、LSPの要件に応じてPATHメッセージを形成し、出口ノードに向けてメッセージを送信します。 PATHメッセージパケットが出口ノードに向けて送信されたときのタイムスタンプ（T1）が入口ノードにローカルに格納されてもよいです。"
    },
    {
      "indent": 3,
      "text": "o When an error-free signal is observed on the ingress node, take the timestamp (T2) as soon as possible. An estimate of PSRD (T2 - T1) can be computed.",
      "ja": "エラーのない信号を入口ノードで観察すると、O、できるだけ早くタイムスタンプ（T2）を取ります。 PSRD（T2  -  T1）の推定値を計算することができます。"
    },
    {
      "indent": 3,
      "text": "o If the LSP setup fails, PSRD is not counted.",
      "ja": "LSPのセットアップが失敗した場合、O、PSRDはカウントされません。"
    },
    {
      "indent": 3,
      "text": "o If no error-free signal is received within a reasonable period of time by the ingress node, PSRD is deemed to be undefined.",
      "ja": "エラーのない信号を入口ノードによって合理的な期間内に受信されない場合、O、PSRDは不定すると考えられます。"
    },
    {
      "indent": 0,
      "text": "10. A Definition for Samples of Data Path Delay",
      "section_title": true,
      "ja": "10.データパス遅延のサンプルのための定義"
    },
    {
      "indent": 3,
      "text": "In Sections 5, 6, 7, 8, and 9, we defined the singleton metrics of data path delay. Now, we define how to get one particular sample of such a delay. Sampling is done to select a particular portion of singleton values of the given parameters. As in [RFC2330], we use Poisson sampling as an example.",
      "ja": "セクション5、6、7、8、および9において、我々は、データパス遅延のシングルトンメトリックを定義しました。今、私たちは、このような遅延の一つの特定のサンプルを取得する方法を定義します。サンプリングは、指定されたパラメータのシングルトン値の特定の部分を選択するために行われます。 [RFC2330]のように、私たちは、一例として、ポアソンサンプリングを使用します。"
    },
    {
      "indent": 0,
      "text": "10.1. Metric Name",
      "section_title": true,
      "ja": "10.1。メトリック名"
    },
    {
      "indent": 3,
      "text": "Type <X> data path delay sample, where X is either RRFD, RSRD, PRFD, PSFD, or PSRD.",
      "ja": "、XはいずれかRRFD、RSRD、PRFD、PSFD、又はPSRDを<X>データパス遅延サンプルを入力します。"
    },
    {
      "indent": 0,
      "text": "10.2. Metric Parameters",
      "section_title": true,
      "ja": "10.2。メトリックパラメータ"
    },
    {
      "indent": 3,
      "text": "o ID0, the ingress LSR ID",
      "ja": "O ID0、イングレスLSR ID"
    },
    {
      "indent": 3,
      "text": "o ID1, the egress LSR ID",
      "ja": "ID1、出口LSR ID O"
    },
    {
      "indent": 3,
      "text": "o T0, a time",
      "ja": "T0、時間O"
    },
    {
      "indent": 3,
      "text": "o Tf, a time",
      "ja": "O Tfは、時間"
    },
    {
      "indent": 3,
      "text": "o Lambda, a rate in reciprocal milliseconds",
      "ja": "Oラムダ、相互のミリ秒単位の割合"
    },
    {
      "indent": 3,
      "text": "o Th, the LSP holding time",
      "ja": "OのTh、LSP保持時間"
    },
    {
      "indent": 3,
      "text": "o Td, the maximum waiting time for successful LSP setup",
      "ja": "O Tdと、成功したLSP設定のための最大待機時間"
    },
    {
      "indent": 3,
      "text": "o Ts, the maximum waiting time for an error-free signal",
      "ja": "O Tsと、エラーのない信号の最大待機時間"
    },
    {
      "indent": 0,
      "text": "10.3. Metric Units",
      "section_title": true,
      "ja": "10.3。メートル法"
    },
    {
      "indent": 3,
      "text": "A sequence of pairs; the elements of each pair are:",
      "ja": "ペアの配列;各対の要素は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "o T, a time when setup is attempted",
      "ja": "O T、セットアップが試みられる時間"
    },
    {
      "indent": 3,
      "text": "o dT, either a real number of milliseconds or undefined",
      "ja": "O dTの、いずれかのミリ秒または未定義の実数"
    },
    {
      "indent": 0,
      "text": "10.4. Definition",
      "section_title": true,
      "ja": "10.4。定義"
    },
    {
      "indent": 3,
      "text": "Given T0, Tf, and Lambda, compute a pseudo-random Poisson process beginning at or before T0, with average arrival rate Lambda, and ending at or after Tf. Those time values greater than or equal to T0 and less than or equal to Tf are then selected. At each of the times in this process, we obtain the value of a data path delay sample of type <X> at this time. The value of the sample is the sequence made up of the resulting <time, type <X> data path delay> pairs. If there are no such pairs, the sequence is of length zero and the sample is said to be empty.",
      "ja": "T0、Tfは、およびラムダ考えると、擬似ランダムポアソン過程の平均到着率ラムダを、T0で以前に開始する、とのTfで以降に終了を計算します。これらの時間は、以上T0に等しく、以下のTfに等しいが、選択された値。このプロセスの時間の各々で、我々はこの時点でタイプ<X>のデータパス遅延サンプルの値を得ます。サンプルの値が得られるから成っ配列<時間、タイプ<X>データパス遅延>対です。そのようなペアが存在しない場合、配列の長さはゼロであり、試料は、空であると言われます。"
    },
    {
      "indent": 0,
      "text": "10.5. Discussion",
      "section_title": true,
      "ja": "10.5。討論"
    },
    {
      "indent": 3,
      "text": "The following issues are likely to come up in practice:",
      "ja": "次の問題は、実際に出てくる可能性があります。"
    },
    {
      "indent": 3,
      "text": "o The parameters Lambda, Th, and Td should be carefully chosen, as explained in the discussions for LSP setup delay (see [RFC5814]).",
      "ja": "パラメータλ、ThのO、及び（[RFC5814]を参照）LSPセットアップ遅延の議論で説明したようにTdが慎重に選択されるべきです。"
    },
    {
      "indent": 3,
      "text": "o The parameter Ts should be carefully chosen and MUST be reported along with the LSP forward/reverse data path delay sample.",
      "ja": "パラメータoをTsは注意深く選択されるべきであり、LSP順方向/逆方向データパス遅延サンプルと一緒に報告されなければなりません。"
    },
    {
      "indent": 0,
      "text": "10.6. Methodologies",
      "section_title": true,
      "ja": "10.6。方法論"
    },
    {
      "indent": 3,
      "text": "Generally, the methodology would proceed as follows:",
      "ja": "次のように一般的に、方法論は進行します。"
    },
    {
      "indent": 3,
      "text": "o Select specific times, using the specified Poisson arrival process.",
      "ja": "O指定ポアソン到着プロセスを使用して、特定の時刻を選択します。"
    },
    {
      "indent": 3,
      "text": "o Set up the LSP and obtain the value of type <X> data path delay.",
      "ja": "O LSPを設定し、タイプ<X>データパス遅延の値を取得します。"
    },
    {
      "indent": 3,
      "text": "o Release the LSP after Th, and wait for the next Poisson arrival process.",
      "ja": "O Thの後にLSPを離すと、次のポアソン到着過程を待ちます。"
    },
    {
      "indent": 0,
      "text": "10.7. Typical Testing Cases",
      "section_title": true,
      "ja": "10.7。典型的なテストケース"
    },
    {
      "indent": 0,
      "text": "10.7.1. With No LSP in the Network",
      "section_title": true,
      "ja": "10.7.1。ネットワークではありませんLSPと"
    },
    {
      "indent": 0,
      "text": "10.7.1.1. Motivation",
      "section_title": true,
      "ja": "10.7.1.1。動機"
    },
    {
      "indent": 3,
      "text": "Data path delay with no LSP in the network is important because this reflects the inherent delay of a device implementation. The minimum value provides an indication of the delay that will likely be experienced when an LSP data path is configured under light traffic load.",
      "ja": "これはデバイスの実装の固有の遅延を反映するため、ネットワーク内のないLSPとのデータパス遅延が重要です。最小値は、LSPデータパスは、光トラフィック負荷の下で設定されたときに可能性が高い経験する遅延の指示を提供します。"
    },
    {
      "indent": 0,
      "text": "10.7.1.2. Methodologies",
      "section_title": true,
      "ja": "10.7.1.2。方法論"
    },
    {
      "indent": 3,
      "text": "Make sure that there is no LSP in the network, and proceed with the methodologies described in Section 10.6.",
      "ja": "ネットワークにはLSPが存在しないことを確認し、10.6項で説明した方法論を進めます。"
    },
    {
      "indent": 0,
      "text": "10.7.2. With a Number of LSPs in the Network",
      "section_title": true,
      "ja": "10.7.2。ネットワークにおけるLSPの数と"
    },
    {
      "indent": 0,
      "text": "10.7.2.1. Motivation",
      "section_title": true,
      "ja": "10.7.2.1。動機"
    },
    {
      "indent": 3,
      "text": "Data path delay with a number of LSPs in the network is important because it reflects the performance of an operational network with considerable load. This delay may vary significantly as the number of existing LSPs varies. It can be used as a scalability metric of a device implementation.",
      "ja": "それはかなりの負荷と運用ネットワークのパフォーマンスを反映しているため、ネットワーク内のLSPの数とデータパス遅延が重要です。既存のLSPの数が変化するように、この遅延は大幅に変えることができます。これは、デバイスの実装のスケーラビリティメトリックとして使用することができます。"
    },
    {
      "indent": 0,
      "text": "10.7.2.2. Methodologies",
      "section_title": true,
      "ja": "10.7.2.2。方法論"
    },
    {
      "indent": 3,
      "text": "o Set up the required number of LSPs.",
      "ja": "O LSPの必要な数を設定します。"
    },
    {
      "indent": 3,
      "text": "o Wait until the network reaches a stable state.",
      "ja": "ネットワークが安定状態に到達するまでO待ちます。"
    },
    {
      "indent": 3,
      "text": "o Then proceed with the methodologies described in Section 10.6.",
      "ja": "Oそして、セクション10.6で説明した方法論を進めます。"
    },
    {
      "indent": 0,
      "text": "11. Some Statistics Definitions for Metrics to Report",
      "section_title": true,
      "ja": "11.メトリックがレポートするためのいくつかの統計の定義"
    },
    {
      "indent": 3,
      "text": "Given the samples of the performance metric, we now offer several statistics of these samples to report. From these statistics, we can draw some useful conclusions regarding a GMPLS network. The value of these metrics is either a real number of milliseconds or undefined. In the following discussion, we only consider the finite values.",
      "ja": "パフォーマンス・メトリックのサンプルを考えると、我々は今、報告するこれらのサンプルのいくつかの統計情報を提供します。これらの統計から、我々はGMPLSネットワークに関するいくつかの有用な結論を引き出すことができます。これらのメトリックの値はミリ秒単位または未定義の実数のいずれかです。以下の議論では、我々は有限の値を検討してください。"
    },
    {
      "indent": 0,
      "text": "11.1. The Minimum of the Metric",
      "section_title": true,
      "ja": "11.1。メトリックの最小"
    },
    {
      "indent": 3,
      "text": "The minimum of the metric is the minimum of all the dT values in the sample. In computing this, undefined values SHOULD be treated as infinitely large. Note that this means that the minimum could thus be undefined if all the dT values are undefined. In addition, the metric minimum SHOULD be set to undefined if the sample is empty.",
      "ja": "メトリックの最小値は、試料中のすべてのdT値の最小値です。この計算では、未定義の値が無限大として扱われるべきです。これは、すべてのdT値が未定義であれば、最低は、このように未定義することができることを意味することに注意してください。サンプルが空の場合に加えて、メトリックの最小値は未定義に設定されるべきです。"
    },
    {
      "indent": 0,
      "text": "11.2. The Median of the Metric",
      "section_title": true,
      "ja": "11.2。メトリックの中央値"
    },
    {
      "indent": 3,
      "text": "The median of the metric is the median of the dT values in the given sample. In computing the median, the undefined values MUST NOT be included. The median SHOULD be set to undefined if all the dT values are undefined, or if the sample is empty. When the number of defined values in the given sample is small, the metric median may not be typical and SHOULD be used carefully.",
      "ja": "メトリックの中央値は、所与の試料中のdT値の中央値です。中央値の計算では、未定義の値が含まれてはいけません。すべてのdT値が未定義であれば、中央値はundefinedに設定されるべきである（SHOULD）、またはサンプルが空の場合。所与の試料中の定義された値の数が少ない場合には、メトリックの中央値は、典型的ではないかもしれないし、慎重に使用するべきです。"
    },
    {
      "indent": 0,
      "text": "11.3. The Percentile of the Metric",
      "section_title": true,
      "ja": "11.3。メトリックのパーセンタイル"
    },
    {
      "indent": 3,
      "text": "The \"empirical distribution function\" (EDF) of a set of scalar measurements is a function F(x), which, for any x, gives the fractional proportion of the total measurements that were <= x.",
      "ja": "スカラー測定値のセットの「経験分布関数」（EDF）は、任意のxに対して、<= xであった総測定値の分数割合を与え、関数F（x）は、。"
    },
    {
      "indent": 3,
      "text": "Given a percentage X, the Xth percentile of the metric means the smallest value of x for which F(x) >= X. In computing the percentile, undefined values MUST NOT be included.",
      "ja": "割合Xが与えられると、メトリックのX番目のパーセンタイルは、F（x）は> =パーセンタイルを計算する際に、Xは、未定義の値を含んではいけませんそのため、xの最小値を意味します。"
    },
    {
      "indent": 3,
      "text": "See [RFC2330] for further details.",
      "ja": "詳細については、[RFC2330]を参照してください。"
    },
    {
      "indent": 0,
      "text": "11.4. Failure Probability",
      "section_title": true,
      "ja": "11.4。故障確率"
    },
    {
      "indent": 3,
      "text": "Given the samples of the performance metric, we now offer two statistics of failure events of these samples to report: Failure Count and Failure Ratio. The two statistics can be applied to both the forward data path and reverse data path. For example, when a sample of RRFD has been obtained, the forward data path failure statistics can be obtained, while a sample of RSRD can be used to calculate the reverse data path failure statistics. Detailed definitions of Failure Count and Failure Ratio are given below.",
      "ja": "障害カウントや不良率：パフォーマンス・メトリックのサンプルを考えると、我々は今、報告するこれらのサンプルの失敗イベントの2つの統計情報を提供します。 2つの統計は、順方向データ・パス及び逆方向データパスの両方に適用することができます。 RRFDの試料が得られた場合RSRDのサンプルが逆方向データパス障害統計を計算するために使用することができるが、例えば、フォワードデータ経路障害統計情報を得ることができます。障害カウントと不良率の詳細な定義は以下の通りです。"
    },
    {
      "indent": 0,
      "text": "11.4.1. Failure Count",
      "section_title": true,
      "ja": "11.4.1。障害カウント"
    },
    {
      "indent": 3,
      "text": "Failure Count is defined as the number of the undefined value of the corresponding performance metric in a sample. The value of Failure Count is an integer.",
      "ja": "故障カウントは、サンプル中の対応する性能メトリックの不定値の数として定義されます。障害カウントの値は整数です。"
    },
    {
      "indent": 0,
      "text": "11.4.2. Failure Ratio",
      "section_title": true,
      "ja": "11.4.2。不良率"
    },
    {
      "indent": 3,
      "text": "Failure Ratio is the percentage of the number of failure events to the total number of requests in a sample. Here, a failure event means that the signaling completes with no error, while no error-free signal is observed. The calculation for Failure Ratio is defined as follows:",
      "ja": "不良率は、試料中の要求の合計数に対する障害イベントの数の割合です。ここでは、障害イベントには、エラーのない信号が観測されない間、シグナリングが、エラーなしで完了することを意味します。次のように不良率の計算は定義されています。"
    },
    {
      "indent": 3,
      "text": "Failure Ratio = Number of undefined value/(Number of valid metric values + Number of undefined value) * 100%.",
      "ja": "不良率=未定義値/数（有効なメトリック値+未定義の値の数の数）* 100％。"
    },
    {
      "indent": 0,
      "text": "12. Security Considerations",
      "section_title": true,
      "ja": "12.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "In the control plane, since the measurement endpoints must be conformant to signaling specifications and behave as normal signaling endpoints, it will not incur security issues other than normal LSP provisioning. However, the measurement parameters must be carefully selected so that the measurements inject trivial amounts of additional traffic into the networks they measure. If they inject \"too much\" traffic, they can skew the results of the measurement and in extreme cases cause congestion and denial of service.",
      "ja": "測定エンドポイントがシグナリング仕様に準拠し、通常のシグナリングエンドポイントとして動作しなければならないので、制御プレーンでは、それは通常のLSPプロビジョニング以外のセキュリティ上の問題が発生しないであろう。測定は、彼らが測定ネットワークに追加トラフィックの些細な量を注入するようにしかし、測定パラメータを慎重に選択する必要があります。彼らは「あまりにも多くの」トラフィックを注入した場合、彼らは測定の結果を歪曲し、極端な場合にはサービスの混雑や拒否を引き起こす可能性があります。"
    },
    {
      "indent": 3,
      "text": "In the data plane, the measurement endpoint MUST use a signal that is consistent with what is specified in the control plane. For example, in a packet switched case, the traffic injected into the data plane",
      "ja": "データプレーンにおいては、測定エンドポイントは、制御プレーンで指定されたものと一致している信号を使用しなければなりません。例えば、パケットのトラフィックはデータ・プレーン内に注入、ケースを切り替えます"
    },
    {
      "indent": 3,
      "text": "MUST NOT exceed the specified rate in the corresponding LSP setup request. In a wavelength switched case, the measurement endpoint MUST use the specified or negotiated lambda with appropriate power.",
      "ja": "対応するLSP設定要求で指定されたレートを超えてはなりません。波長切り替える場合に、測定エンドポイントは、適切な電力で指定またはネゴシエートラムダを使用しなければなりません。"
    },
    {
      "indent": 3,
      "text": "The security considerations pertaining to the original RSVP protocol [RFC2205] and its TE extensions [RFC3209] also remain relevant.",
      "ja": "オリジナルのRSVPプロトコル[RFC2205]とそのTE拡張[RFC3209]に関連するセキュリティ上の考慮事項は、関連するまま。"
    },
    {
      "indent": 0,
      "text": "13. References",
      "section_title": true,
      "ja": "13.参考文献"
    },
    {
      "indent": 0,
      "text": "13.1. Normative References",
      "section_title": true,
      "ja": "13.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2205] Braden, B., Zhang, L., Berson, S., Herzog, S., and S. Jamin, \"Resource ReSerVation Protocol (RSVP) -- Version 1 Functional Specification\", RFC 2205, September 1997.",
      "ja": "[RFC2205]ブレーデン、B.、チャン、L.、Berson氏、S.、ハーツォグ、S.、およびS.ヤミン、 \"リソース予約プロトコル（RSVP） - バージョン1機能仕様\"、RFC 2205、1997年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC2679] Almes, G., Kalidindi, S., and M. Zekauskas, \"A One-way Delay Metric for IPPM\", RFC 2679, September 1999.",
      "ja": "[RFC2679] Almes、G.、Kalidindi、S.、およびM. Zekauskas、 \"一方向IPPMの遅延メトリック\"、RFC 2679、1999年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC2681] Almes, G., Kalidindi, S., and M. Zekauskas, \"A Round-trip Delay Metric for IPPM\", RFC 2681, September 1999.",
      "ja": "[RFC2681] Almes、G.、Kalidindi、S.、およびM. Zekauskas、 \"IPPMのラウンドトリップ遅延メトリック\"、RFC 2681、1999年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC3209] Awduche, D., Berger, L., Gan, D., Li, T., Srinivasan, V., and G. Swallow, \"RSVP-TE: Extensions to RSVP for LSP Tunnels\", RFC 3209, December 2001.",
      "ja": "[RFC3209] Awduche、D.、バーガー、L.、ガン、D.、李、T.、スリニヴァサン、V.、およびG.ツバメ、 \"RSVP-TE：LSPトンネルのためのRSVPの拡張\"、RFC 3209年12月2001。"
    },
    {
      "indent": 0,
      "text": "13.2. Informative References",
      "section_title": true,
      "ja": "13.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC2330] Paxson, V., Almes, G., Mahdavi, J., and M. Mathis, \"Framework for IP Performance Metrics\", RFC 2330, May 1998.",
      "ja": "[RFC2330]パクソン、V.、Almes、G.、Mahdavi、J.、およびM.マティス、 \"IPパフォーマンス・メトリックのためのフレームワーク\"、RFC 2330、1998年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC4208] Swallow, G., Drake, J., Ishimatsu, H., and Y. Rekhter, \"Generalized Multiprotocol Label Switching (GMPLS) User-Network Interface (UNI): Resource ReserVation Protocol-Traffic Engineering (RSVP-TE) Support for the Overlay Model\", RFC 4208, October 2005.",
      "ja": "[RFC4208]ツバメ、G.、ドレイク、J.、石松、H.、およびY. Rekhter、「一般化マルチプロトコルラベルスイッチング（GMPLS）ユーザネットワークインタフェース（UNI）：リソース予約プロトコル - トラフィックエンジニアリング（RSVP-TE）オーバレイモデルのサポート」、RFC 4208、2005年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC5814] Sun, W. and G. Zhang, \"Label Switched Path (LSP) Dynamic Provisioning Performance Metrics in Generalized MPLS Networks\", RFC 5814, March 2010.",
      "ja": "[RFC5814]日、W.およびG.張、 \"ラベルスイッチパス一般化MPLSネットワークにおける（LSP）ダイナミックプロビジョニングパフォーマンス・メトリック\"、RFC 5814、2010月。"
    },
    {
      "indent": 3,
      "text": "[RFC6383] Shiomoto, K. and A. Farrel, \"Advice on When It Is Safe to Start Sending Data on Label Switched Paths Established Using RSVP-TE\", RFC 6383, September 2011.",
      "ja": "[RFC6383] Shiomoto、K.とA.ファレル、「RSVP-TEを使用して確立ラベル上のデータの送信を開始しても安全ですときのアドバイスは、スイッチパス」、RFC 6383、2011年9月。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Acknowledgements",
      "ja": "付録A.謝辞"
    },
    {
      "indent": 3,
      "text": "We wish to thank Adrian Farrel, Lou Berger, and Al Morton for their comments and help. We also wish to thank Klaas Wierenga and Alexey Melnikov for their reviews.",
      "ja": "我々は彼らのコメント、助けをエードリアンファレル、ルー・バーガー、およびアルモートンに感謝したいです。我々はまた、彼らのレビューのためにクラースWierengaとアレクセイ・メルニコフに感謝したいです。"
    },
    {
      "indent": 3,
      "text": "This document contains ideas as well as text that have appeared in existing IETF documents. The authors wish to thank G. Almes, S. Kalidindi, and M. Zekauskas.",
      "ja": "この文書では、アイデアだけでなく、既存のIETF文書に登場したテキストが含まれています。著者はG. Almes、S. Kalidindi、およびM. Zekauskasに感謝したいです。"
    },
    {
      "indent": 3,
      "text": "We also wish to thank Weisheng Hu, Yaohui Jin, and Wei Guo in the state key laboratory of advanced optical communication systems and networks for their valuable comments. We also wish to thank the National Natural Science Foundation of China (NSFC) and the 863 program of China for their support.",
      "ja": "我々はまた、彼らの貴重なコメントのための先進的な光通信システムやネットワークの状態キーの研究室でWeisheng胡、Yaohuiジン、および魏郭に感謝したいです。また、中国の国家自然科学基金（NSFC）と彼らのサポートのための中国の863プログラムに感謝したいです。"
    },
    {
      "indent": 0,
      "text": "Appendix B. Contributors",
      "ja": "付録B.協力者"
    },
    {
      "indent": 3,
      "text": "Bin Gu IXIA Oriental Kenzo Plaza 8M, 48 Dongzhimen Wai Street Dongcheng District Beijing 200240 China",
      "ja": "ビン区IXIAオリエンタル健三プラザ8M、48東直門ワイストリート東城区北京200240中国"
    },
    {
      "indent": 3,
      "text": "Phone: +86 13611590766 EMail: BGu@ixiacom.com",
      "ja": "電話：+86 13611590766 Eメール：BGu@ixiacom.com"
    },
    {
      "indent": 3,
      "text": "Xueqin Wei Fiberhome Telecommunication Technology Co., Ltd. Wuhan China",
      "ja": "X UEプロ魏繊維家庭の通信技術の共同。、株式会社武漢中国"
    },
    {
      "indent": 3,
      "text": "Phone: +86 13871127882 EMail: xqwei@fiberhome.com.cn",
      "ja": "電話：+86 13871127882 Eメール：xqwei@fiberhome.com.cn"
    },
    {
      "indent": 3,
      "text": "Tomohiro Otani KDDI R&D Laboratories, Inc. 2-1-15 Ohara Kamifukuoka Saitama 356-8502 Japan",
      "ja": "ともひろ おたに Ｋっぢ Ｒ＆Ｄ ぁぼらとりえｓ、 いんｃ。 ２ー１ー１５ おはら かみふくおか さいたま ３５６ー８５０２ じゃぱん"
    },
    {
      "indent": 3,
      "text": "Phone: +81-49-278-7357 EMail: tm-otani@kddi.com",
      "ja": "電話：+ 81-49-278-7357 Eメール：tm-otani@kddi.com"
    },
    {
      "indent": 3,
      "text": "Ruiquan Jing China Telecom Beijing Research Institute 118 Xizhimenwai Avenue Beijing 100035 China",
      "ja": "道北京100035中国外バウチャーのRu私ジン中国テレコム北京研究所場合は118のξ値"
    },
    {
      "indent": 3,
      "text": "Phone: +86-10-58552000 EMail: jingrq@ctbri.com.cn",
      "ja": "電話：+ 86-10-58552000 Eメール：jingrq@ctbri.com.cn"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Weiqiang Sun (editor) Shanghai Jiao Tong University 800 Dongchuan Road Shanghai 200240 China",
      "ja": "魏強い日（エディタ）道路上海200240中国経由上海J I AOトング大学800洞"
    },
    {
      "indent": 3,
      "text": "Phone: +86 21 3420 5359 EMail: sun.weiqiang@gmail.com",
      "ja": "電話：+86 21 3420 5359 Eメール：sun.weiqiang@gmail.com"
    },
    {
      "indent": 3,
      "text": "Guoying Zhang (editor) China Academy of Telecommunication Research, MIIT, China No. 52 Hua Yuan Bei Lu, Haidian District Beijing 100191 China",
      "ja": "GU Oべき張（エディタ）電気通信研究の中国アカデミー、MI IT、中国なし。52 HU元もIL U、H低ポイント地区北京100191中国"
    },
    {
      "indent": 3,
      "text": "Phone: +86 1062300103 EMail: zhangguoying@catr.cn",
      "ja": "電話：+86 1062300103 Eメール：zhangguoying@catr.cn"
    },
    {
      "indent": 3,
      "text": "Jianhua Gao Huawei Technologies Co., Ltd. China",
      "ja": "G Jイアン花ああああUAは、技術の共同で、株式会社中国"
    },
    {
      "indent": 3,
      "text": "Phone: +86 755 28973237 EMail: gjhhit@huawei.com",
      "ja": "電話：+86 755 28973237 Eメール：gjhhit@huawei.com"
    },
    {
      "indent": 3,
      "text": "Guowu Xie University of California, Riverside 900 University Ave. Riverside, CA 92521 USA",
      "ja": "カリフォルニア、リバーサイド900大学のAVああ。リバーサイド、CA 92521 USAのGU O 5 X IE大学"
    },
    {
      "indent": 3,
      "text": "Phone: +1 951 237 8825 EMail: xieg@cs.ucr.edu",
      "ja": "電話：+1 951 237 8825 Eメール：xieg@cs.ucr.edu"
    },
    {
      "indent": 3,
      "text": "Rajiv Papneja Huawei Technologies Santa Clara, CA 95050 Reston, VA 20190 USA",
      "ja": "ラジブPapneja華為技術SANTAレストン95050のCLARA、および20190それ"
    },
    {
      "indent": 3,
      "text": "EMail: rajiv.papneja@huawei.com",
      "ja": "メールアドレス：rajiv.papneja@huawei.com"
    }
  ]
}