{
  "title": {
    "text": "RFC 4061 - Benchmarking Basic OSPF Single Router Control Plane Convergence",
    "ja": "RFC 4061 - ベンチマークの基本的なOSPFシングルルータコントロールプレーンのコンバージェンス"
  },
  "number": 4061,
  "created_at": "2019-10-19 10:14:07.223200+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                          V. Manral\nRequest for Comments: 4061                                  SiNett Corp.\nCategory: Informational                                         R. White\n                                                           Cisco Systems\n                                                               A. Shaikh\n                                                    AT&T Labs (Research)\n                                                              April 2005",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "Benchmarking Basic OSPF Single Router Control Plane Convergence",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモはインターネットコミュニティのための情報を提供します。それはどんな種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "ja": "著作権（C）インターネット協会（2005）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document provides suggestions for measuring OSPF single router control plane convergence. Its initial emphasis is on the control plane of a single OSPF router. We do not address forwarding plane performance.",
      "ja": "この文書では、OSPF、単一のルータコントロールプレーンのコンバージェンスを測定するための提案を提供します。その最初の重点は、単一のOSPFルータの制御プレーン上にあります。私たちは、フォワーディングプレーンのパフォーマンスに対応していません。"
    },
    {
      "indent": 3,
      "text": "NOTE: In this document, the word \"convergence\" relates to single router control plane convergence only.",
      "ja": "注：このドキュメントでは、単語「収束」は、単一のルータ制御プレーンのコンバージェンスに関するものです。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction....................................................2\n2.  Specification of Requirements...................................2\n3.  Overview and Scope..............................................3\n4.  Reference Topologies............................................4\n5.  Basic Performance Tests.........................................5\n    5.1.  Time Required to Process an LSA...........................5\n    5.2.  Flooding Time.............................................6\n    5.3.  Shortest Path First Computation Time......................6\n6.  Basic Intra-area OSPF Tests.....................................8\n    6.1.  Forming Adjacencies on Point-to-Point Links\n          (Initialization)..........................................9\n    6.2.  Forming Adjacencies on Point-to-Point Links...............9\n    6.3.  Forming Adjacencies with Information Already in the\n          Database.................................................10\n    6.4.  Designated Router Election Time on a Broadcast Network...11",
      "raw": true,
      "ja": "1.はじめに\n要件の2仕様\n3.概要と適用範囲\n4.リファレンストポロジ\n5.基本的な性能試験\n    5.1。時間がLSAを処理するために必要な\n    5.2。フラッディング時間\n    5.3。最短パス優先計算時間\n6.基本的なイントラエリアOSPFテスト\n    6.1。ポイントツーポイントリンク上の隣接関係を形成します\n          （初期化）\n    6.2。ポイントツーポイントリンク上の隣接関係を形成します\n    6.3。にすでに情報との隣接関係を形成します\n          データベース\n    6.4。ブロードキャストネットワーク... 11にルータ選挙の時間を指定"
    },
    {
      "indent": 3,
      "text": "    6.5.  Initial Convergence Time on a Broadcast Network,\n          Test 1...................................................11\n    6.6.  Initial Convergence Time on a Broadcast Network,\n          Test 2...................................................12\n    6.7.  Link Down with Layer Two Detection.......................12\n    6.8.  Link Down with Layer Three Detection.....................13\n7.  Security Considerations........................................13\n8.  Acknowledgements...............................................13\n9.  Normative References...........................................14\n10. Informative References.........................................14\nAuthors' Addresses.................................................15\nFull Copyright Statement...........................................16",
      "raw": true,
      "ja": "6.5。ブロードキャストネットワーク上の初期収束時間、\n          テスト1\n    6.6。ブロードキャストネットワーク上の初期収束時間、\n          テスト2\n    6.7。レイヤ二つの検出とダウンリンク\n    6.8。レイヤ3つの検出とダウンリンク\n7.セキュリティの考慮事項\n8.謝辞\n9.引用規格\n10.参考文献\n著者のアドレス\n完全な著作権声明"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "There is a growing interest in routing protocol convergence testing, with many people looking at various tests to determine how long it takes for a network to converge after various conditions occur. The major problem with this sort of testing is that the framework of the tests has a major impact on the results; for instance, determining when a network is converged, what parts of the router's operation are considered within the testing, and other such things will have a major impact on the apparent performance that routing protocols provide.",
      "ja": "様々な条件が発生した後にネットワークが収束するのにかかる時間を決定するために様々なテストを見て多くの人とのルーティングプロトコルのコンバージェンステストへの関心の高まりは、あります。試験のこの種の主な問題は、テストのフレームワークは結果に大きな影響を有することです。例えば、ネットワークが収束している場合を決定、ルータの操作のどのような部分は、テスト内であると考えられる、およびその他のようなものは、ルーティングプロトコルが提供することが明らかにパフォーマンスに大きな影響を持つことになります。"
    },
    {
      "indent": 3,
      "text": "This document attempts to provide a framework for Open Shortest Path First [OSPF] performance testing, and to provide some tests for measuring some aspects of OSPF performance. The motivation of the document is to provide a set of tests that can provide the user comparable data from various vendors with which to evaluate the OSPF protocol performance on the devices.",
      "ja": "この文書では、オープンショーテストパスファースト[OSPF]性能試験のためのフレームワークを提供しよう、とOSPF性能のいくつかの側面を測定するためのいくつかのテストを提供します。文書の動機は、デバイス上のOSPFプロトコルの性能を評価するとともに、様々なベンダーからユーザに匹敵するデータを提供することができる一連のテストを提供することです。"
    },
    {
      "indent": 0,
      "text": "2. Specification of Requirements",
      "section_title": true,
      "ja": "要件の2仕様"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119]. RFC 2119 key words in this document are used to ensure methodological control, which is very important in the specification of benchmarks. This document does not specify a network-related protocol.",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。この文書に記載されているRFC 2119個のキーワードは、ベンチマークの仕様で非常に重要である方法論的な制御を、確実にするために使用されています。この文書では、ネットワーク関連のプロトコルを指定しません。"
    },
    {
      "indent": 0,
      "text": "3. Overview and Scope",
      "section_title": true,
      "ja": "3.概要と適用範囲"
    },
    {
      "indent": 3,
      "text": "Although this document describes a specific set of tests aimed at characterizing the single router control plane convergence performance of OSPF processes in routers or other boxes that incorporate OSPF functionality, a key objective is to propose methodologies that produce directly comparable convergence-related measurements.",
      "ja": "この文書は、ルータやOSPFの機能を組み込む他のボックスにOSPFプロセスの単一ルータ制御プレーンの収束性能を特徴付けることを目的とした試験の特定のセットを記載しているが、主な目的は、直接比較収束関連測定値を生成する方法を提案することです。"
    },
    {
      "indent": 3,
      "text": "The following considerations are outside the scope of this document:",
      "ja": "次の考慮事項は、この文書の範囲外です。"
    },
    {
      "indent": 3,
      "text": "o The interactions of convergence and forwarding; testing is restricted to events occurring within the control plane. Forwarding performance is the primary focus in [INTERCONNECT], and it is expected to be dealt with in work that ensues from [FIB-TERM].",
      "ja": "収束および転送の相互作用がOであり;テストでは、制御プレーン内で発生するイベントに制限されています。パフォーマンスを転送する[INTERCONNECT]における主要な焦点であり、[FIB-TERM]から行なわれる作業で対処されることが期待されます。"
    },
    {
      "indent": 3,
      "text": "o Inter-area route generation, AS-external route generation, and simultaneous traffic on the control and data paths within the DUT. Although the tests outlined in this document measure SPF time, flooding times, and other aspects of OSPF convergence performance, this document does not provide tests for measuring external or summary route generation, route translation, or other OSPF inter-area and external routing performance. These areas are expected to be dealt with in a later document.",
      "ja": "Oインター領域経路生成、AS-外部ルートの生成、及びDUT内の制御及びデータパスの同時トラフィック。このドキュメント対策SPF時間、浸水時間、およびOSPFの収束性能の他の側面で概説したテストが、この文書は、外部またはサマリールート生成、ルート翻訳、または他のOSPFエリア間および外部ルーティング性能を測定するためのテストを提供していません。これらの領域は、後に文書で対処されることが期待されます。"
    },
    {
      "indent": 6,
      "text": "The tests should be run more than once, since a single test run cannot be relied on to produce statistically sound results. The number of test runs and any variations between the tests should be recorded in the test results (see [TERM] for more information on what items should be recorded in the test results).",
      "ja": "単一のテストの実行が統計的に健全な結果を生成するために頼ることができないので、テストでは、複数回実行する必要があります。テストの実行とテストの間の任意のバリエーションの数は、テスト結果に記録されなければならない（試験結果に記録されるべきアイテムの詳細については、[TERM]を参照）。"
    },
    {
      "indent": 0,
      "text": "4. Reference Topologies",
      "section_title": true,
      "ja": "4.リファレンストポロジ"
    },
    {
      "indent": 3,
      "text": "Several reference topologies that are used throughout the tests are described in the remaining sections of this document. All of the topologies have been collectively placed in one section to avoid repetition.",
      "ja": "試験全体を通して使用されるいくつかの参照トポロジは、この文書の残りのセクションに記載されています。トポロジのすべてを一括して繰り返しを避けるために、1つのセクションに配置されています。"
    },
    {
      "indent": 3,
      "text": "o Reference Topology 1 (Emulated Topology)",
      "ja": "O参考トポロジ1（エミュレートされたトポロジ）"
    },
    {
      "indent": 6,
      "text": "                     (                   )\nDUT----Generator----(  emulated topology  )\n                     (                   )",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "A simple back-to-back configuration. It's assumed that the link between the generator and the DUT is a point-to-point link, while the connections within the generator represent some emulated topology.",
      "ja": "シンプルなバックツーバック設定。発電機内部の接続は、いくつかのエミュレートされたトポロジーを表しながら、発電機とDUTとの間のリンクは、ポイントツーポイントリンクであることを想定しています。"
    },
    {
      "indent": 3,
      "text": "o Reference Topology 2 (Generator and Collector)",
      "ja": "Oリファレンストポロジ2（ジェネレータとコレクタ）"
    },
    {
      "indent": 6,
      "text": "                                  (                   )\nCollector-----DUT-----Generator--(  emulated topology  )\n       \\              /           (                   )\n        \\------------/",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "All routers are connected through point-to-point links. The cost of all links is assumed to be the same unless otherwise noted.",
      "ja": "すべてのルータは、ポイントツーポイントリンクを介して接続されています。特に断りのない限り、全てのリンクのコストは同じであると仮定されます。"
    },
    {
      "indent": 3,
      "text": "o Reference Topology 3 (Broadcast Network)",
      "ja": "Oリファレンストポロジ3（ブロードキャストネットワーク）"
    },
    {
      "indent": 6,
      "text": "DUT     R1     R2\n |      |      |\n-+------+------+-----.....",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "Any number of routers could be included on the common broadcast network.",
      "ja": "ルータの任意の数は、一般的なブロードキャストネットワーク上で含めることができます。"
    },
    {
      "indent": 3,
      "text": "o Reference Topology 4 (Parallel Links)",
      "ja": "Oリファレンストポロジ4（パラレルリンク）"
    },
    {
      "indent": 6,
      "text": "  /--(link 1)-----\\           (                   )\nDUT               Generator--(  emulated topology  )\n  \\--(link 2)-----/           (                   )",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "In all cases the tests and topologies are designed to allow performance measurements to be taken all on a single device, whether this is the DUT or some other device in the network. This eliminates the need for synchronized clocks within the test networks.",
      "ja": "全ての場合においてテスト、トポロジが、これはDUT又はネットワーク内の他のデバイスであるか否かを、性能測定値は全て、単一の装置で撮影できるように設計されています。これは、テストネットワーク内で同期したクロックが不要になります。"
    },
    {
      "indent": 0,
      "text": "5. Basic Performance Tests",
      "section_title": true,
      "ja": "5.基本的な性能試験"
    },
    {
      "indent": 3,
      "text": "These tests will measure aspects of the OSPF implementation as a process on the device under test, including",
      "ja": "これらの試験には、被試験デバイス上のプロセスとして、OSPFの実装の側面を測定します"
    },
    {
      "indent": 3,
      "text": "o time required to process an LSA,",
      "ja": "O時間がLSAを処理するのに必要な、"
    },
    {
      "indent": 3,
      "text": "o flooding time, and",
      "ja": "O浸水時間、および"
    },
    {
      "indent": 3,
      "text": "o Shortest Path First computation.",
      "ja": "O最短パス優先計算。"
    },
    {
      "indent": 0,
      "text": "5.1. Time Required to Process an LSA",
      "section_title": true,
      "ja": "5.1。時間がLSAを処理するために必要な"
    },
    {
      "indent": 3,
      "text": "o Using reference topology 1 (Emulated Topology), begin with all links up and a full adjacency established between the DUT and the generator.",
      "ja": "参照トポロジー1（エミュレートトポロジ）を使用してO、すべてのリンクアップとDUTとジェネレータとの間に確立された完全な隣接関係で始まります。"
    },
    {
      "indent": 6,
      "text": "Note: The generator does not have direct knowledge of the state of the adjacency on the DUT. The fact that the adjacency may be in Full state on the generator does not mean that the DUT is ready. It may still (and is likely to) be requesting LSAs from the generator. This process, involving processing of requested LSAs, will affect the results of the test. The generator should either wait until it sees the DUT's router-LSA listing the adjacency with the generator or introduce a configurable delay before starting the test.",
      "ja": "注意：発電機は、DUT上の隣接関係の状態の直接的な知識を持っていません。隣接関係は、発電機の完全な状態であってもよいという事実は、DUTの準備ができていることを意味するものではありません。それはまだ（とする可能性がある）発電機からのLSAを要求することができます。要求されたLSAの処理を伴うこのプロセスは、テストの結果に影響を与えます。発電機は、発電機との隣接関係をリストDUTのルータLSAを見るまで待つか、テストを開始する前に、設定可能な遅延を導入すべきであるのいずれか。"
    },
    {
      "indent": 3,
      "text": "o Send an LSA that is already in the DUT (a duplicate LSA), note the time difference between when the LSA is sent and when the ack is received. This measures the time taken to propagate the LSA and the ack, as well as the processing time of the duplicate LSA. This is dupLSAprocTime.",
      "ja": "O DUT（重複LSA）に既に存在するLSAを送信し、LSAが送信されると、ACKを受信したときの間の時間差に注意してください。これは、LSAとACKだけでなく、重複したLSAの処理時間を伝播するのにかかる時間を測定します。これはdupLSAprocTimeです。"
    },
    {
      "indent": 3,
      "text": "o Send a new LSA from the generator to the DUT, followed immediately by a duplicate LSA (LSA that already resides in the database of DUT, but not the same as the one just sent).",
      "ja": "O DUTへの発電機から新しいLSAを送信し、重複したLSAの直後に（すでにDUTのデータベースに存在するLSAが、ちょうど送られたものと同じではありません）。"
    },
    {
      "indent": 3,
      "text": "o The DUT will acknowledge this second LSA immediately; note the time of this acknowledgement. This is newLSAprocTime.",
      "ja": "O DUTは、この第2のLSAをすぐに認めるだろう。この確認応答の時間に注意してください。これはnewLSAprocTimeです。"
    },
    {
      "indent": 6,
      "text": "The amount of time required for an OSPF implementation to process the new LSA can be computed by subtracting dupLSAprocTime from newLSAprocTime.",
      "ja": "新しいLSAを処理するためのOSPFの実装に必要な時間の量はnewLSAprocTimeからdupLSAprocTimeを減算することによって計算することができます。"
    },
    {
      "indent": 6,
      "text": "Note: The duplicate LSA cannot be the same as the one just sent because of the MinLSInterval restriction [OSPF]. This test is taken from [BLACKBOX].",
      "ja": "注：重複LSAは単にためMinLSInterval制限[OSPF]の送信と同じにすることはできません。この試験は、[BLACKBOX]から取られます。"
    },
    {
      "indent": 6,
      "text": "Note: This time may or may not include the time required to perform flooding-related operations, depending on when the implementation sends the ack: before it floods the LSA further, or after it does, or anywhere in between. In other words, this measurement may not mean the same thing in all implementations.",
      "ja": "注意：それはさらにLSAをフラッディングする前に、またはそれがないの後、またはどこかの間に：この時間はしてもしなくてもよい実装がACKを送信するときに応じて、洪水関連の操作を実行するのに必要な時間を含んでいてもよいです。言い換えれば、この測定は、すべての実装で同じことを意味しない場合があります。"
    },
    {
      "indent": 0,
      "text": "5.2. Flooding Time",
      "section_title": true,
      "ja": "5.2。フラッディング時間"
    },
    {
      "indent": 3,
      "text": "o Using reference topology 2 (Generator and Collector), enable OSPF on all links and allow the devices to build full adjacencies. Configure the collector so that it will block all flooding toward the DUT (but so that it continues receiving advertisements from the DUT).",
      "ja": "参照トポロジー2（ジェネレータおよびコレクタ）を使用してO、すべてのリンクでOSPFを有効にし、デバイスがフル隣接関係を構築することができます。それはDUTに向かってすべてのフラッディングをブロックするようにコレクタを設定する（それはDUTからの広告を受信し続けるように）。"
    },
    {
      "indent": 3,
      "text": "o Inject a new set of LSAs from the generator toward the collector and the DUT.",
      "ja": "Oコレクタに向かって発生し、DUTからのLSAの新しいセットを注入します。"
    },
    {
      "indent": 3,
      "text": "o On the collector, note the time the flooding is complete across the link to the generator. Also note the time the flooding is complete across the link from the DUT.",
      "ja": "集電体の上にO、洪水が発生器へのリンクを介して完了している時間に注意してください。また、洪水がDUTからのリンク全体で完了する時間に注意してください。"
    },
    {
      "indent": 3,
      "text": "The time from when the last LSA is received on the collector from the generator to when the last LSA is received on the collector from the DUT should be measured during this test. This time is important in link state protocols, since the loop-free nature of the network is reliant on the speed at which revised topology information is flooded.",
      "ja": "最後LSAが最後のLSAは、DUTからコレクタで受信されたときに発電機からの集電体上に受信されたときからの時間は、この試験の間に測定されるべきです。ネットワークのループのない性質が改訂されたトポロジ情報が氾濫している速度に依存しているので、この時間は、リンク状態プロトコルで重要です。"
    },
    {
      "indent": 3,
      "text": "Depending on the number of LSAs flooded, the sizes of the LSAs, the number of LSUs, and the rate of flooding, these numbers could vary by some amount. The settings and variances of these numbers should be reported with the test results.",
      "ja": "浸水LSAの数に応じて、LSAの大きさ、のLSUの数、および洪水の割合は、これらの数字は、いくつかの量によって変化することができます。これらの数値の設定と分散は、テスト結果を報告しなければなりません。"
    },
    {
      "indent": 0,
      "text": "5.3. Shortest Path First Computation Time",
      "section_title": true,
      "ja": "5.3。最短パス優先計算時間"
    },
    {
      "indent": 3,
      "text": "o Use reference topology 1 (Emulated Topology), beginning with the DUT and the generator fully adjacent.",
      "ja": "O DUTと完全に隣接する発電機で始まる、参照トポロジー1（エミュレートトポロジ）を使用。"
    },
    {
      "indent": 3,
      "text": "o The default SPF timer on the DUT should be set to 0 so that any new LSA that arrives immediately results in the SPF calculation [BLACKBOX].",
      "ja": "O DUT上のデフォルトSPFタイマーが0に設定する必要がありますので、すぐに到着し、新しいLSAはSPF計算[BLACKBOX]になりこと。"
    },
    {
      "indent": 3,
      "text": "o The generator should inject a set of LSAs toward the DUT; the DUT should be allowed to converge and install all best paths in the local routing table, etc.",
      "ja": "Oジェネレータは、DUTに向かってLSAのセットを注入しなければなりません。 DUTはなど、ローカルルーティングテーブル内のすべての最高のパスを収束し、インストールを許可する必要があり"
    },
    {
      "indent": 3,
      "text": "o Send an LSA that is already in the DUT (a duplicate LSA), note the time difference between when the LSA is sent and when the ack is received. This measures the time taken to propagate the LSA and the ack, as well as the processing time of the duplicate LSA. This is dupLSAprocTime.",
      "ja": "O DUT（重複LSA）に既に存在するLSAを送信し、LSAが送信されると、ACKを受信したときの間の時間差に注意してください。これは、LSAとACKだけでなく、重複したLSAの処理時間を伝播するのにかかる時間を測定します。これはdupLSAprocTimeです。"
    },
    {
      "indent": 3,
      "text": "o Change the link cost between the generator and the emulated network it is advertising, and transmit the new LSA to the DUT.",
      "ja": "O発電機とそれが宣伝され、エミュレートネットワークとの間のリンクのコストを変更し、DUTに新しいLSAを送信します。"
    },
    {
      "indent": 3,
      "text": "o Immediately inject another LSA that is a duplicate of some other LSA the generator has previously injected (preferably a stub network someplace within the emulated network).",
      "ja": "O直ちに発電機が以前に注入しているいくつかの他のLSA（エミュレートされたネットワーク内で、好ましくは、スタブネットワークどこか）の複製である別のLSAを注入します。"
    },
    {
      "indent": 6,
      "text": "Note: The generator should make sure that outbound LSA packing is not performed for the duplicate LSAs and that they are always sent in a separate Link-state Update packet. Otherwise, if the LSA carrying the topology change and the duplicate LSA are in the same packet, the SPF starts after the duplicate LSA is acked.",
      "ja": "注意：発電機は、発信LSAパッキングが重複したLSAのために、彼らは常に別のリンクステートアップデートパケットで送信されるように行われていないことを確認する必要があります。トポロジの変更を運ぶLSAおよび重複LSAが同じパケットである場合、重複したLSAがACKされた後、それ以外の場合は、SPFが開始されます。"
    },
    {
      "indent": 3,
      "text": "o Measure the time between transmitting the second (duplicate) LSA and the acknowledgement for that LSA; this is the totalSPFtime. The total time required to run SPF can be computed by subtracting dupLSAprocTime from totalSPFtime.",
      "ja": "O秒（重複）LSAとそのLSAに対する肯定応答を送信するまでの時間を測定します。これはtotalSPFtimeです。 SPFを実行するために必要な合計時間がtotalSPFtimeからdupLSAprocTimeを差し引いて計算することができます。"
    },
    {
      "indent": 3,
      "text": "The accuracy of this test is crucially dependent on the amount of time between the transmissions of the first and second LSAs. If too much time elapsed, the test is meaningless because the SPF run will complete before the second (duplicate) LSA is received. If the time elapsed is less, then both LSAs will be handled before the SPF run is scheduled and started, and thus the measurement would only be for the handling of the duplicate LSA.",
      "ja": "この試験の精度は、第一及び第二のLSAの送信間の時間の量に決定的に依存しています。あまりにも多くの時間が経過した場合は、2番目の（重複）LSAを受信する前に、SPFの実行が完了しますので、テストは無意味です。経過時間が少ない場合、両方のLSAはSPFの実行がスケジュールされる前に処理して起動し、したがって測定は、重複するLSAの取り扱いのためになることでしょう。"
    },
    {
      "indent": 3,
      "text": "This test is also specified in [BLACKBOX].",
      "ja": "この試験はまた、[BLACKBOX]で指定されています。"
    },
    {
      "indent": 3,
      "text": "Note: This test may not be accurate on systems that implement OSPF as a multithreaded process, where the flooding takes place in a separate process (or on a different processor) than shortest path first computations.",
      "ja": "注：この試験は、最短パス優先計算よりフラッディングが別のプロセスで（または異なるプロセッサ上で）行われるマルチスレッド・プロセスとしてOSPFを実装するシステムでは正確ではないかもしれません。"
    },
    {
      "indent": 3,
      "text": "It is also possible to measure the SPF time using white box tests (using output supplied by the OSPF software implementer), such as the following:",
      "ja": "次のような、（OSPFソフトウェア実装によって供給される出力を使用して）ホワイトボックステストを使用して、SPF時間を測定することも可能です。"
    },
    {
      "indent": 3,
      "text": "o Using reference topology 1 (Emulated Topology), establish a full adjacency between the generator and the DUT.",
      "ja": "参照トポロジー1（エミュレートトポロジ）を使用してO、ジェネレータとDUTとの間の完全な隣接関係を確立します。"
    },
    {
      "indent": 3,
      "text": "o Inject a set of LSAs from the generator toward the DUT. Allow the DUT to stabilize and install all best paths in the routing table, etc.",
      "ja": "O DUTに向かって発生器からのLSAのセットを注入。 DUTは、ルーティングテーブル内のすべての最高のパスを安定してインストールすることを許可する、など"
    },
    {
      "indent": 3,
      "text": "o Change the link cost between the DUT and the generator (or the link between the generator and the emulated network it is advertising), such that a full SPF is required to run, although only one piece of information is changed.",
      "ja": "O情報の一つだけが変更されたものの、フルSPFは、実行するために必要であることなど、DUTとジェネレータ（または発電機とそれが宣伝され、エミュレートネットワークとの間のリンク）との間のリンクのコストを変更します。"
    },
    {
      "indent": 3,
      "text": "o Measure the amount of time required for the DUT to compute a new shortest path tree as a result of the topology changes injected by the generator. These measurements should be taken using available show and debug information on the DUT.",
      "ja": "Oジェネレータによって注入トポロジの変更の結果として、新たな最短経路ツリーを計算するために、DUTのために必要な時間の量を測定します。これらの測定は、DUTで利用可能なショーやデバッグ情報を使用して撮影する必要があります。"
    },
    {
      "indent": 3,
      "text": "Several caveats MUST be mentioned when a white box method of measuring SPF time is used. For instance, such white box tests are only applicable when testing various versions or variations within a single implementation of the OSPF protocol. Further, the same set of commands MUST be used in each iteration of such a test to ensure consistent results.",
      "ja": "SPFの時間を測定するホワイトボックス方式が使用される場合、いくつかの注意点を記載しなければなりません。 OSPFプロトコルの単一の実装内の様々なバージョンまたはバリエーションをテストする場合、例えば、そのようなホワイトボックステストのみ適用可能です。さらに、コマンドの同じセットは、一貫した結果を保証するために、そのような試験の各反復で使用されなければなりません。"
    },
    {
      "indent": 3,
      "text": "There is an interesting relationship between the SPF times reported by white box (internal) testing and black box (external) testing; each of these two types of tests may be used as a \"sanity check\" on the other by comparing results.",
      "ja": "ホワイトボックス（内部）テストとブラックボックス（外部）テストによって報告されたSPF時間の間の興味深い関係があります。試験のこれらの2つのタイプのそれぞれの結果を比較することによって、他の「健全性チェック」として使用することができます。"
    },
    {
      "indent": 3,
      "text": "See [CONSIDERATIONS] for further discussion.",
      "ja": "さらなる議論のための[考察]を参照してください。"
    },
    {
      "indent": 0,
      "text": "6. Basic Intra-area OSPF Tests",
      "section_title": true,
      "ja": "6.基本的なイントラエリアOSPFテスト"
    },
    {
      "indent": 3,
      "text": "These tests measure the performance of an OSPF implementation for basic intra-area tasks, including:",
      "ja": "：これらのテストには、基本的なエリア内のタスクのためのOSPFの実装のパフォーマンスを測定します"
    },
    {
      "indent": 3,
      "text": "o Forming Adjacencies on Point-to-Point Link (Initialization)",
      "ja": "（初期化）ポイントツーポイントリンク上の隣接関係を形成するO"
    },
    {
      "indent": 3,
      "text": "o Forming Adjacencies on Point-to-Point Links",
      "ja": "ポイントツーポイントリンク上の隣接関係を形成するO"
    },
    {
      "indent": 3,
      "text": "o Link Up with Information Already in the Database",
      "ja": "Oすでにデータベース内の情報とリンク"
    },
    {
      "indent": 3,
      "text": "o Initial convergence Time on a Designated Router Electing (Broadcast) Network",
      "ja": "指定ルータ選出（ブロードキャスト）ネットワーク上のO初期収束時間"
    },
    {
      "indent": 3,
      "text": "o Link Down with Layer 2 Detection",
      "ja": "Oレイヤ2検出とダウンリンク"
    },
    {
      "indent": 3,
      "text": "o Link Down with Layer 3 Detection",
      "ja": "Oレイヤ3検出とダウンリンク"
    },
    {
      "indent": 3,
      "text": "o Designated Router Election Time on A Broadcast Network",
      "ja": "O Aブロードキャストネットワーク上のルータ選挙の時間を指定"
    },
    {
      "indent": 0,
      "text": "6.1. Forming Adjacencies on Point-to-Point Link (Initialization)",
      "section_title": true,
      "ja": "6.1。ポイントツーポイントリンク上の隣接関係を形成する（初期化）"
    },
    {
      "indent": 3,
      "text": "This test measures the time required to form an OSPF adjacency from the time a layer two (data link) connection is formed between two devices running OSPF.",
      "ja": "このテストでは、レイヤ2（データリンク）接続がOSPFを実行している2つのデバイス間に形成された時点からOSPF隣接関係を形成するのに必要な時間を測定します。"
    },
    {
      "indent": 3,
      "text": "o Use reference topology 1 (Emulated Topology), beginning with the link between the generator and DUT disabled on the DUT. OSPF should be configured and operating on both devices.",
      "ja": "O DUTで無効に発電機とDUTの間のリンクで始まる、参照トポロジー1（エミュレートトポロジ）を使用します。 OSPFが構成され、両方のデバイス上で動作する必要があります。"
    },
    {
      "indent": 3,
      "text": "o Inject a set of LSAs from the generator toward the DUT.",
      "ja": "O DUTに向かって発生器からのLSAのセットを注入。"
    },
    {
      "indent": 3,
      "text": "o Bring the link up at the DUT, noting the time when the link carrier is established on the generator.",
      "ja": "Oリンクキャリアが発電機に設立された時間に注意して、DUTのリンクを起動します。"
    },
    {
      "indent": 3,
      "text": "o Note the time when the acknowledgement for the last LSA transmitted from the DUT is received on the generator.",
      "ja": "O DUTから送信された最後のLSAのための肯定応答が発生で受信される時間に注意してください。"
    },
    {
      "indent": 3,
      "text": "The time between the carrier establishment and the acknowledgement for the last LSA transmitted by the generator should be taken as the total amount of time required for the OSPF process on the DUT to react to a link up event with the set of LSAs injected, including the time required for the operating system to notify the OSPF process about the link up, etc. The acknowledgement for the last LSA transmitted is used instead of the last acknowledgement received in order to prevent timing skews due to retransmitted acknowledgements or LSAs.",
      "ja": "キャリア確立および発生器によって送信された最後のLSAのための確認応答との間の時間を含む、注入LSAのセットとリンクアップイベントに反応するようにDUT上のOSPFプロセスに必要な時間の合計として解釈されるべきです最後の確認応答がスキュータイミングを防止するために、受信されたの等伝達最後LSAに対する肯定応答リンクアップ、についてOSPFプロセスに通知するオペレーティングシステムのために必要な時間が原因再送肯定応答またはLSAの代わりに使用されます。"
    },
    {
      "indent": 0,
      "text": "6.2. Forming Adjacencies on Point-to-Point Links",
      "section_title": true,
      "ja": "6.2。ポイントツーポイントリンク上の隣接関係を形成します"
    },
    {
      "indent": 3,
      "text": "This test measures the time required to form an adjacency from the time the first communication occurs between two devices running OSPF.",
      "ja": "このテストは、第1の通信は、OSPFを実行している2つのデバイス間で発生した時点から隣接関係を形成するのに必要な時間を測定します。"
    },
    {
      "indent": 3,
      "text": "o Using reference topology 1 (Emulated Topology), configure the DUT and the generator so that traffic can be passed along the link between them.",
      "ja": "トラフィックは、それらの間のリンクに沿って通過することができるように、参照トポロジー1（エミュレートトポロジ）を使用してO、DUTとジェネレータを設定。"
    },
    {
      "indent": 3,
      "text": "o Configure the generator so that OSPF is running on the point-to-point link toward the DUT, and inject a set of LSAs.",
      "ja": "O OSPFは、DUTに向かってポイントツーポイントリンク上で実行されているように、発電機を構成し、LSAのセットを注入します。"
    },
    {
      "indent": 3,
      "text": "o Configure the DUT so that OSPF is initialized, but not running on the point-to-point link between the DUT and the generator.",
      "ja": "O OSPFが初期化されるようにDUTを設定しますが、DUTと発電機間のポイントツーポイントリンク上で動作していません。"
    },
    {
      "indent": 3,
      "text": "o Enable OSPF on the interface between the DUT and the generator on the DUT.",
      "ja": "O DUTとDUT上の発電機との間のインターフェイス上でOSPFを有効にします。"
    },
    {
      "indent": 3,
      "text": "o Note the time of the first hello received from the DUT on the generator.",
      "ja": "Oジェネレータ上のDUTから受信した最初のハローの時間に注意してください。"
    },
    {
      "indent": 3,
      "text": "o Note the time of the acknowledgement from the DUT for the last LSA transmitted on the generator.",
      "ja": "O発電機に送信される最後のLSAのためのDUTからの確認応答の時間に注意してください。"
    },
    {
      "indent": 3,
      "text": "The time between the first hello received and the acknowledgement for the last LSA transmitted by the generator should be taken as the total amount of time required for the OSPF process on the DUT to build a FULL neighbor adjacency with the set of LSAs injected. The acknowledgement for the last LSA transmitted is used instead of the last acknowledgement received in order to prevent timing skews due to retransmitted acknowledgements or LSAs.",
      "ja": "最初のハローとの間の時間は、受信され、発電機によって送信された最後のLSAに対する肯定応答は、注入されたLSAのセットと完全ネイバー隣接関係を構築するためにDUT上のOSPFプロセスに必要な時間の合計として解釈されるべきです。送信された最後のLSAのための肯定応答を用いる代わりにタイミングを防止するために、受信された最後の確認応答が原因再送肯定応答またはのLSAにスキューされます。"
    },
    {
      "indent": 0,
      "text": "6.3. Forming Adjacencies with Information Already in the Database",
      "section_title": true,
      "ja": "6.3。データベースにすでに情報との隣接関係を形成します"
    },
    {
      "indent": 3,
      "text": "o Using reference topology 2 (Generator and Collector), configure all three devices to run OSPF.",
      "ja": "参照トポロジー2（ジェネレータとコレクタ）を使用して、O、OSPFを実行するためにすべての3つの装置を構成します。"
    },
    {
      "indent": 3,
      "text": "o Configure the DUT so that the link between the DUT and the generator is disabled.",
      "ja": "DUTと発電機との間のリンクが無効になっているように、O DUTを設定します。"
    },
    {
      "indent": 3,
      "text": "o Inject a set of LSAs into the network from the generator; the DUT should receive these LSAs through normal flooding from the collector.",
      "ja": "OジェネレータからネットワークへのLSAのセットを注入。 DUTは、コレクタから通常の洪水を介してこれらのLSAを受けるべきです。"
    },
    {
      "indent": 3,
      "text": "o Enable the link between the DUT and the generator.",
      "ja": "DUTCHと発電機との間のリンクを有効にします。"
    },
    {
      "indent": 3,
      "text": "o Note the time of the first hello received from the DUT on the generator.",
      "ja": "Oジェネレータ上のDUTから受信した最初のハローの時間に注意してください。"
    },
    {
      "indent": 3,
      "text": "o Note the time of the last DBD (Database Description) received on the generator.",
      "ja": "O最後のDBD（データベース記述）の時間を注意ジェネレータで受信しました。"
    },
    {
      "indent": 3,
      "text": "o Note the time of the acknowledgement from the DUT for the last LSA transmitted on the generator.",
      "ja": "O発電機に送信される最後のLSAのためのDUTからの確認応答の時間に注意してください。"
    },
    {
      "indent": 3,
      "text": "The time between the hello received by the generator from the DUT and the acknowledgement for the last LSA transmitted by the generator should be taken as the total amount of time required for the OSPF process on the DUT to build a FULL neighbor adjacency with the set of LSAs injected. In this test, the DUT is already aware of the entire network topology, so the time required should only include the processing of DBDs exchanged when in EXCHANGE state, the time to build a new router LSA containing the new connection information, and the time required to flood and acknowledge this new router LSA.",
      "ja": "DUTから発電機および発電機によって送信された最後のLSAに対する肯定応答によって受信されたハローの間の時間は、一組のFULLネイバー隣接関係を構築するためにDUT上のOSPFプロセスに必要な時間の合計として解釈されるべきですLSAは、注入されました。このテストでは、DUTは、すでに全体のネットワークトポロジを認識しているので、必要な時間は、ときにのみEXCHANGE状態でのDBDの処理は、新しい接続情報を含む新しいルータLSAを構築するための時間を交換し、時間が必要含める必要があります洪水と、この新しいルータLSAを確認します。"
    },
    {
      "indent": 3,
      "text": "The acknowledgement for the last LSA transmitted is used instead of the last acknowledgement received in order to prevent timing skews due to retransmitted acknowledgements or LSAs.",
      "ja": "送信された最後のLSAのための肯定応答を用いる代わりにタイミングを防止するために、受信された最後の確認応答が原因再送肯定応答またはのLSAにスキューされます。"
    },
    {
      "indent": 0,
      "text": "6.4. Designated Router Election Time on a Broadcast Network",
      "section_title": true,
      "ja": "6.4。ブロードキャストネットワーク上のルータ選挙の時間を指定"
    },
    {
      "indent": 3,
      "text": "o Using reference topology 3 (Broadcast Network), configure R1 to be the designated router on the link, and the DUT to be the backup designated router.",
      "ja": "参照トポロジ3（ブロードキャストネットワーク）を使用してO、リンク上の指定ルータ、バックアップ指定ルータすべきDUTようにR1を設定します。"
    },
    {
      "indent": 3,
      "text": "o Enable OSPF on the common broadcast link on all the routers in the test bed.",
      "ja": "Oテストベッド内のすべてのルータに共通のブロードキャストリンク上でOSPFを有効にします。"
    },
    {
      "indent": 3,
      "text": "o Disable the broadcast link on R1.",
      "ja": "O R1上のブロードキャストリンクを無効にします。"
    },
    {
      "indent": 3,
      "text": "o Note the time of the last hello received from R1 on R2.",
      "ja": "O R2上のR1から受信した最後のハローの時間に注意してください。"
    },
    {
      "indent": 3,
      "text": "o Note the time of the first network LSA generated by the DUT as received on R2.",
      "ja": "O R2で受信されるようDUTによって生成された第1のネットワークLSAの時間に注意してください。"
    },
    {
      "indent": 3,
      "text": "The time between the last hello received on R2 and the first network LSA generated by the DUT should be taken as the amount of time required for the DUT to complete a designated router election computation. Note that this test includes the dead interval timer at the DUT, so this time may be factored out, or the hello and dead intervals may be reduced to lessen these timers' impact on the overall test times. All changed timers, the number of routers connected to the link, and other variable factors should be noted in the test results.",
      "ja": "最後のハローの間の時間は、R2で受信し、DUTによって生成された第1のネットワークLSAは、指定ルータ選挙計算を完了するためのDUTのために必要な時間として解釈されるべきです。このテストは、DUTのデッドインターバルタイマーが含まれているので、この時間は因数分解することができる、またはハローとデッド間隔は、全体的なテスト時間にこれらのタイマー影響を軽減するために減少させることができることに注意してください。すべての変更タイマー、リンクに接続されたルータの数、およびその他の変動要因は、試験結果に留意すべきです。"
    },
    {
      "indent": 3,
      "text": "Note: If R1 sends a \"goodbye hello\", typically a hello with its neighbor list empty, in the process of shutting down its interface, using the time when this hello is received instead of the time when the last one was would provide a more accurate measurement.",
      "ja": "注：R1は「ハローさようなら」を送信した場合、通常は空のその隣接リストとハローは、そのインターフェイスをシャットダウンする過程で、このハローはなく、最後の1があった時間の受信された時刻を使用すると、より多くを提供します正確な測定。"
    },
    {
      "indent": 0,
      "text": "6.5. Initial Convergence Time on a Broadcast Network, Test 1",
      "section_title": true,
      "ja": "6.5。ブロードキャストネットワーク、テスト1の初期収束時間"
    },
    {
      "indent": 3,
      "text": "o Using reference topology 3 (Broadcast Network), begin with the DUT connected to the network with OSPF enabled. OSPF should be enabled on R1, but the broadcast link should be disabled.",
      "ja": "参照トポロジ3（ブロードキャストネットワーク）を使用してO、OSPFを有効にして、ネットワークに接続されたDUTから始まります。 OSPFはR1で有効にする必要がありますが、ブロードキャストリンクを無効にする必要があります。"
    },
    {
      "indent": 3,
      "text": "o Enable the broadcast link between R1 and the DUT. Note the time of the first hello received by R1.",
      "ja": "O R1とDUT間のブロードキャストリンクを有効にします。 R1で受信した最初のハローの時間に注意してください。"
    },
    {
      "indent": 3,
      "text": "o Note the time when the first network LSA is flooded by the DUT at R1.",
      "ja": "O最初のネットワークLSAがR1でDUTによってフラッディングされた時間に注意してください。"
    },
    {
      "indent": 3,
      "text": "o The difference between the first hello and the first network LSA is the time required by the DUT to converge on this new topology.",
      "ja": "最初のハローと最初のネットワークLSA間の差は、この新しいトポロジで収束するDUTによって必要な時間であるO。"
    },
    {
      "indent": 3,
      "text": "This test assumes that the DUT will be the designated router on the broadcast link. A similar test could be designed to test the convergence time when the DUT is not the designated router.",
      "ja": "このテストでは、DUTがブロードキャストリンクの代表ルータになることを前提としています。 DUTが指定ルータでない場合にも同様のテストでは、収束時間をテストするために設計することができます。"
    },
    {
      "indent": 3,
      "text": "This test maybe performed with a varying number of devices attached to the broadcast network, and with varying sets of LSAs being advertised to the DUT from the routers attached to the broadcast network. Variations in the LSA sets and other factors should be noted in the test results.",
      "ja": "この試験は、多分ブロードキャストネットワークに接続されたデバイスの様々な数を用いて行われ、LSAのセットを変えて、放送ネットワークに接続されているルータからDUTにアドバタイズされます。 LSAセットと他の要因の変化は、試験結果に留意すべきです。"
    },
    {
      "indent": 3,
      "text": "The time required to elect a designated router, as measured in Section 6.4, above, may be subtracted from the results of this test to provide just the convergence time across a broadcast network.",
      "ja": "指定ルータを選出するために必要な時間は、6.4で測定した、上記放送ネットワークを介してだけ収束時間を提供するために、この試験の結果から差し引かれてもよいです。"
    },
    {
      "indent": 3,
      "text": "Note that although all the other tests in this document include route calculation time in the convergence time, as described in [TERM], this test may not include route calculation time in the resulting measured convergence time, because initial route calculation may occur after the first network LSA is flooded.",
      "ja": "初期のルート計算が最初の後に発生する可能性があるため、この文書内の他のすべての試験は、[TERM]で説明したように、収束時間でルート計算時間を含んでいるが、この試験は、得られた測定された収束時間でルート計算時間を含まなくてもよいことに留意されたいですネットワークLSAをフラッディングされます。"
    },
    {
      "indent": 0,
      "text": "6.6. Initial Convergence Time on a Broadcast Network, Test 2",
      "section_title": true,
      "ja": "6.6。ブロードキャストネットワーク、テスト2の初期収束時間"
    },
    {
      "indent": 3,
      "text": "o Using reference topology 3 (Broadcast Network), begin with the DUT connected to the network with OSPF enabled. OSPF should be enabled on R1, but the broadcast link should be disabled.",
      "ja": "参照トポロジ3（ブロードキャストネットワーク）を使用してO、OSPFを有効にして、ネットワークに接続されたDUTから始まります。 OSPFはR1で有効にする必要がありますが、ブロードキャストリンクを無効にする必要があります。"
    },
    {
      "indent": 3,
      "text": "o Enable the broadcast link between R1 and the DUT. Note the time of the first hello transmitted by the DUT with a designated router listed.",
      "ja": "O R1とDUT間のブロードキャストリンクを有効にします。記載されている指定されたルータとDUTによって送信された第1のハローの時間に注意してください。"
    },
    {
      "indent": 3,
      "text": "o Note the time when the first network LSA is flooded by the DUT at R1.",
      "ja": "O最初のネットワークLSAがR1でDUTによってフラッディングされた時間に注意してください。"
    },
    {
      "indent": 3,
      "text": "o The time difference between the first hello with a designated router lists and the first network LSA is the period required by the DUT to converge on this new topology.",
      "ja": "O指定ルータリストと最初のネットワークLSAの最初のハロー間の時間差は、この新しいトポロジで収束するDUTで必要とされる期間です。"
    },
    {
      "indent": 0,
      "text": "6.7. Link Down with Layer 2 Detection",
      "section_title": true,
      "ja": "6.7。レイヤ2検出とダウンリンク"
    },
    {
      "indent": 3,
      "text": "o Using reference topology 4 (Parallel Links), begin with OSPF in the Full state between the generator and the DUT. Both links should be point-to-point links with the ability to notify the operating system immediately upon link failure.",
      "ja": "参照トポロジー4（平行リンク）を使用してO、ジェネレータとDUTの間の完全な状態でOSPFで始まります。両方のリンクは、リンク障害時に直ちにオペレーティングシステムに通知する能力を持つポイントツーポイントリンクでなければなりません。"
    },
    {
      "indent": 3,
      "text": "o Disable link 1; this should be done in such a way that the keepalive timers at the data link layer will have no impact on the DUT recognizing the link failure (the operating system in the DUT should recognize this link failure immediately). Disconnecting the cable on the generator end would be one possibility; shutting the link down would be another.",
      "ja": "Oリンク1を無効にしてください。これは、データリンク層でのキープアライブタイマーは、リンク障害（DUTにおけるオペレーティングシステムはすぐにこのリンク障害を認識すべきである）を認識するDUTに影響を与えないような方法で行われるべきです。発電機端にケーブルを切断することは、1つの可能性であろう。リンクダウンをシャットダウンすると、別のだろう。"
    },
    {
      "indent": 3,
      "text": "o Note the time of the link failure on the generator.",
      "ja": "Oジェネレータのリンク障害時に注意してください。"
    },
    {
      "indent": 3,
      "text": "o At the generator, note the time of the receipt of the new router LSA from the DUT notifying the generator of the link 2 failure.",
      "ja": "発電機では、O、リンク2の故障の発電機を通知するDUTからの新しいルータLSAの受信の時間に注意してください。"
    },
    {
      "indent": 6,
      "text": "The difference in the time between the initial link failure and the receipt of the LSA on the generator across link 2 should be taken as the time required for an OSPF implementation to recognize and process a link failure, including the time required to generate and flood an LSA describing the link down event to an adjacent neighbor.",
      "ja": "初期リンク障害およびリンク2の両端に発生LSAの受信の間の時間差が発生するのに必要な時間と洪水ANを含む、リンク障害を認識し、処理するOSPFの実装に必要な時間として解釈されるべきです隣接ネイバーにリンクダウンイベントを記述したLSA。"
    },
    {
      "indent": 0,
      "text": "6.8. Link Down with Layer 3 Detection",
      "section_title": true,
      "ja": "6.8。レイヤ3の検出とダウンリンク"
    },
    {
      "indent": 3,
      "text": "o Using reference topology 4 (Parallel Links), begin with OSPF in the Full state between the generator and the DUT.",
      "ja": "参照トポロジー4（平行リンク）を使用してO、ジェネレータとDUTの間の完全な状態でOSPFで始まります。"
    },
    {
      "indent": 3,
      "text": "o Disable OSPF processing on link 1 from the generator. This should be done in such a way that it does not affect link status; the DUT MUST note the failure of the adjacency through the dead interval.",
      "ja": "Oジェネレータからリンク1にOSPF処理を無効にします。これは、リンクの状態に影響を与えないような方法で行われるべきです。 DUTは、デッドインターバルを通じて隣接関係の失敗を注意しなければなりません。"
    },
    {
      "indent": 3,
      "text": "o At the generator, note the time of the receipt of the new router LSA from the DUT notifying the generator of the link 2 failure.",
      "ja": "発電機では、O、リンク2の故障の発電機を通知するDUTからの新しいルータLSAの受信の時間に注意してください。"
    },
    {
      "indent": 3,
      "text": "The difference in the time between the initial link failure and the receipt of the LSA on the generator across link 2 should be taken as the time required for an OSPF implementation to recognize and process an adjacency failure.",
      "ja": "初期リンク障害およびリンク2の両端に発生LSAの受信の間の時間差が隣接障害を認識し、処理するOSPFの実装に必要な時間として解釈されるべきです。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "ja": "7.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document does not modify the underlying security considerations in [OSPF].",
      "ja": "この文書では、[OSPF]で基本的なセキュリティの考慮事項を変更しません。"
    },
    {
      "indent": 0,
      "text": "8. Acknowledgements",
      "section_title": true,
      "ja": "8.謝辞"
    },
    {
      "indent": 3,
      "text": "Thanks to Howard Berkowitz (hcb@clark.net) for his encouragement and support. Thanks also to Alex Zinin (zinin@psg.net), Gurpreet Singh (Gurpreet.Singh@SpirentCom.com), and Yasuhiro Ohara (yasu@sfc.wide.ad.jp) for their comments.",
      "ja": "彼の励ましと支援のためのハワード・バーコウィッツ（hcb@clark.net）に感謝します。また、アレックスジニン（zinin@psg.net）、ガプリート・シン（Gurpreet.Singh@SpirentCom.com）、および康弘大原彼らのコメントについて（yasu@sfc.wide.ad.jp）に感謝します。"
    },
    {
      "indent": 0,
      "text": "9. Normative References",
      "section_title": true,
      "ja": "9.引用規格"
    },
    {
      "indent": 3,
      "text": "[OSPF] Moy, J., \"OSPF Version 2\", STD 54, RFC 2328, April 1998.",
      "ja": "[OSPF]モイ、J.、 \"OSPFバージョン2\"、STD 54、RFC 2328、1998年4月。"
    },
    {
      "indent": 3,
      "text": "[TERM] Manral, V., White, R., and A. Shaikh, \"OSPF Benchmarking Terminology and Concepts\", RFC 4062, April 2005.",
      "ja": "[TERM] Manral、V.、ホワイト、R.、およびA.シェイク、 \"OSPFベンチマークの用語と概念\"、RFC 4062、2005年4月。"
    },
    {
      "indent": 3,
      "text": "[CONSIDERATIONS] Manral, V., White, R., and A. Shaikh, \"Considerations When Using Basic OSPF Convergence Benchmarks\", RFC 4063, April 2005.",
      "ja": "[考察] Manral、V.、ホワイト、R.、およびA.シェイク、 \"留意事項基本的なOSPFコンバージェンスのベンチマークの使用\"、RFC 4063、2005年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 0,
      "text": "10. Informative References",
      "section_title": true,
      "ja": "10.参考文献"
    },
    {
      "indent": 3,
      "text": "[INTERCONNECT] Bradner, S. and J. McQuaid, \"Benchmarking Methodology for Network Interconnect Devices\", RFC 2544, March 1999.",
      "ja": "、RFC 2544、1999年3月 \"ネットワーク相互接続デバイスのためのベンチマーキング方法論\" [相互接続]ブラドナー、S.とJ. McQuaid、。"
    },
    {
      "indent": 3,
      "text": "[FIB-TERM] Trotter, G., \"Terminology for Forwarding Information Base (FIB) based Router Performance\", RFC 3222, December 2001.",
      "ja": "[FIB-TERM]トロッター、G.、 \"転送情報ベース（FIB）ベースのルータのパフォーマンスのための用語\"、RFC 3222、2001年12月。"
    },
    {
      "indent": 3,
      "text": "[BLACKBOX] Shaikh, A. and Greenberg, A., \"Experience in Black-box OSPF measurement\", Proc. ACM SIGCOMM Internet Measurement Workshop (IMW), November 2001",
      "ja": "[BLACKBOX] Shaikhさん、A.及びグリーンバーグ、A.、 \"ブラックボックスOSPF測定の経験\"、PROC。 ACM SIGCOMMインターネット測定ワークショップ（IMW）、2001年11月"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Vishwas Manral SiNett Corp, Ground Floor, Embassy Icon Annexe, 2/1, Infantry Road, Bangalore, India",
      "ja": "Vishwas Manral SiNett社、階、大使館アイコン別館、2/1、歩兵ロード、バンガロール、インド"
    },
    {
      "indent": 3,
      "text": "EMail: vishwas@sinett.com",
      "ja": "メールアドレス：vishwas@sinett.com"
    },
    {
      "indent": 3,
      "text": "Russ White Cisco Systems, Inc. 7025 Kit Creek Rd. Research Triangle Park, NC 27709",
      "ja": "ラスホワイトシスコシステムズ株式会社7025キットクリークRdを。リサーチトライアングルパーク、NC 27709"
    },
    {
      "indent": 3,
      "text": "EMail: riw@cisco.com",
      "ja": "メールアドレス：riw@cisco.com"
    },
    {
      "indent": 3,
      "text": "Aman Shaikh AT&T Labs (Research) 180 Park Av, PO Box 971 Florham Park, NJ 07932",
      "ja": "アマンシェイクAT＆T Labs社（リサーチ）180公園のAv、私書箱971フローラムパーク、NJ 07932"
    },
    {
      "indent": 3,
      "text": "EMail: ashaikh@research.att.com",
      "ja": "メールアドレス：ashaikh@research.att.com"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "ja": "著作権（C）インターネット協会（2005）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "この文書では、BCP 78に含まれる権利と許可と制限の適用を受けており、その中の記載を除いて、作者は彼らのすべての権利を保有します。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とCONTRIBUTOR「そのまま」、ORGANIZATION HE / SHEが表すまたはインターネットソサエティおよびインターネット・エンジニアリング・タスク・フォース放棄すべての保証、明示または、（もしあれば）後援ISに設けられています。黙示、情報の利用は、特定の目的に対する権利または商品性または適合性の黙示の保証を侵害しない任意の保証含むがこれらに限定されません。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、本書またはそのような権限下で、ライセンスがたりないかもしれない程度に記載された技術の実装や使用に関係すると主張される可能性があります任意の知的財産権やその他の権利の有効性または範囲に関していかなる位置を取りません利用可能です。またそれは、それがどのような権利を確認する独自の取り組みを行ったことを示すものでもありません。 RFC文書の権利に関する手続きの情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IPRの開示のコピーが利用できるようにIETF事務局とライセンスの保証に行われた、または本仕様の実装者または利用者がそのような所有権の使用のための一般的なライセンスまたは許可を取得するために作られた試みの結果を得ることができますhttp://www.ietf.org/iprのIETFのオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、その注意にこの標準を実装するために必要とされる技術をカバーすることができる任意の著作権、特許または特許出願、またはその他の所有権を持ってすべての利害関係者を招待します。 ietf-ipr@ietf.orgのIETFに情報を記述してください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "了承"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}