{
  "title": {
    "text": "RFC 4760 - Multiprotocol Extensions for BGP-4",
    "ja": "RFC 4760 - BGP-4のためのマルチプロトコル拡張機能"
  },
  "number": 4760,
  "created_at": "2019-10-26 02:29:54.198984+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                           T. Bates\nRequest for Comments: 4760                                 Cisco Systems\nObsoletes: 2858                                               R. Chandra\nCategory: Standards Track                                  Sonoa Systems\n                                                                 D. Katz\n                                                              Y. Rekhter\n                                                        Juniper Networks\n                                                            January 2007",
      "raw": true
    },
    {
      "indent": 19,
      "text": "Multiprotocol Extensions for BGP-4",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The IETF Trust (2007).",
      "ja": "著作権（C）IETFトラスト（2007）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document defines extensions to BGP-4 to enable it to carry routing information for multiple Network Layer protocols (e.g., IPv6, IPX, L3VPN, etc.). The extensions are backward compatible - a router that supports the extensions can interoperate with a router that doesn't support the extensions.",
      "ja": "この文書は、複数のネットワーク層プロトコル（例えば、IPv6の、IPX、L3VPN、等）のためのルーティング情報を搬送することを可能にするために、BGP-4への拡張を定義します。拡張子は、下位互換性がある - の拡張をサポートしていないルータと相互運用できる機能拡張をサポートするルータ。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "The only three pieces of information carried by BGP-4 [BGP-4] that are IPv4 specific are (a) the NEXT_HOP attribute (expressed as an IPv4 address), (b) AGGREGATOR (contains an IPv4 address), and (c) NLRI (expressed as IPv4 address prefixes). This document assumes that any BGP speaker (including the one that supports multiprotocol capabilities defined in this document) has to have an IPv4 address (which will be used, among other things, in the AGGREGATOR attribute). Therefore, to enable BGP-4 to support routing for multiple Network Layer protocols, the only two things that have to be added to BGP-4 are (a) the ability to associate a particular Network Layer protocol with the next hop information, and (b) the ability to associate a particular Network Layer protocol with NLRI. To identify individual Network Layer protocols associated with the next hop information and semantics of NLRI, this document uses a combination of Address Family, as defined in [IANA-AF], and Subsequent Address Family (as described in this document).",
      "ja": "IPv4の特異的であるBGP-4によって搬送される情報のわずか3個の[BGP-4]は、（a）NEXT_HOP属性（IPv4アドレスとして表される）、（b）は、アグリゲータ（IPv4アドレスが含まれている）、及び（c） NLRI（IPv4アドレスプレフィックスとして表されます）。この文書では、（この文書で定義されたマルチプロトコル機能をサポートしているものを含む）すべてのBGPスピーカーは、（AGGREGATOR属性で、とりわけ、使用される）IPv4アドレスを持つ必要があることを前提としています。したがって、複数のネットワーク層プロトコル、BGP-4に追加されなければならない2つだけのルーティングをサポートするために、BGP-4を有効にしている（A）（次のホップ情報を特定のネットワーク層プロトコルを関連付け、および能力B）NLRIで、特定のネットワーク層プロトコルを関連付ける機能。 NLRIの次ホップ情報及びセマンティクスに関連する個々のネットワーク層プロトコルを識別するために、[IANA-AF]で定義されるように、このドキュメントは、アドレスファミリの組み合わせを使用し、次のアドレスファミリー（この文書に記載されているように）。"
    },
    {
      "indent": 3,
      "text": "One could further observe that the next hop information (the information provided by the NEXT_HOP attribute) is meaningful (and necessary) only in conjunction with the advertisements of reachable destinations - in conjunction with the advertisements of unreachable destinations (withdrawing routes from service), the next hop information is meaningless. This suggests that the advertisement of reachable destinations should be grouped with the advertisement of the next hop to be used for these destinations, and that the advertisement of reachable destinations should be segregated from the advertisement of unreachable destinations.",
      "ja": "一つはさらにのみ到達可能な目的地の広告に関連して（および必要）次のホップ情報（NEXT_HOP属性によって提供される情報）は意味があることを観察することができた - （サービスからのルートを引き出す）到達不能な目的地の広告と連動して、ネクストホップ情報は無意味です。これは、到達可能な目的地の広告がこれらの宛先に使用するネクストホップの広告をグループ化する必要があることを示唆し、到達可能な目的地の広告が到達不能の送信先の広告から分離する必要があること。"
    },
    {
      "indent": 3,
      "text": "To provide backward compatibility, as well as to simplify introduction of the multiprotocol capabilities into BGP-4, this document uses two new attributes, Multiprotocol Reachable NLRI (MP_REACH_NLRI) and Multiprotocol Unreachable NLRI (MP_UNREACH_NLRI). The first one (MP_REACH_NLRI) is used to carry the set of reachable destinations together with the next hop information to be used for forwarding to these destinations. The second one (MP_UNREACH_NLRI) is used to carry the set of unreachable destinations. Both of these attributes are optional and non-transitive. This way, a BGP speaker that doesn't support the multiprotocol capabilities will just ignore the information carried in these attributes and will not pass it to other BGP speakers.",
      "ja": "後方互換性を提供するために、だけでなく、BGP-4にマルチ機能の導入を簡素化するために、このドキュメントでは、2つの新しい属性、マルチプロトコル到達可能NLRI（MP_REACH_NLRI）およびマルチプロトコル到達不能NLRI（MP_UNREACH_NLRI）を使用しています。最初のもの（MP_REACH_NLRI）は、これらの宛先に転送するために使用される次のホップ情報と一緒に届いている目的地のセットを運ぶために使用されます。第1（MP_UNREACH_NLRI）が到達不能な目的地のセットを運ぶために使用されます。これらの属性の両方は別売と非推移しています。この方法では、マルチプロトコル機能をサポートしていないBGPスピーカは、ちょうどこれらの属性で運ばれた情報を無視し、他のBGPスピーカにそれを渡しません。"
    },
    {
      "indent": 0,
      "text": "2. Specification of Requirements",
      "section_title": true,
      "ja": "要件の2仕様"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "ja": "この文書のキーワード \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", および \"OPTIONAL\" はRFC 2119 [RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "3. Multiprotocol Reachable NLRI - MP_REACH_NLRI (Type Code 14):",
      "section_title": true,
      "ja": "3.マルチ届いNLRI  -  MP_REACH_NLRI（タイプコード14）："
    },
    {
      "indent": 3,
      "text": "This is an optional non-transitive attribute that can be used for the following purposes:",
      "ja": "これは、次の目的で使用することができ、オプションの非推移属性です。"
    },
    {
      "indent": 3,
      "text": "(a) to advertise a feasible route to a peer",
      "ja": "（a）は、ピアに実現可能なルートをアドバタイズします"
    },
    {
      "indent": 3,
      "text": "(b) to permit a router to advertise the Network Layer address of the router that should be used as the next hop to the destinations listed in the Network Layer Reachability Information field of the MP_NLRI attribute.",
      "ja": "（b）はMP_NLRI属性のネットワーク・レイヤ到着可能性情報フィールドに記載された宛先へのネクストホップとして使用されるべきルータのネットワーク層アドレスをアドバタイズするルーターを許可します。"
    },
    {
      "indent": 3,
      "text": "The attribute is encoded as shown below:",
      "ja": "以下に示すように属性が符号化されます。"
    },
    {
      "indent": 8,
      "text": "+---------------------------------------------------------+\n| Address Family Identifier (2 octets)                    |\n+---------------------------------------------------------+\n| Subsequent Address Family Identifier (1 octet)          |\n+---------------------------------------------------------+\n| Length of Next Hop Network Address (1 octet)            |\n+---------------------------------------------------------+\n| Network Address of Next Hop (variable)                  |\n+---------------------------------------------------------+\n| Reserved (1 octet)                                      |\n+---------------------------------------------------------+\n| Network Layer Reachability Information (variable)       |\n+---------------------------------------------------------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The use and meaning of these fields are as follows:",
      "ja": "次のようにこれらのフィールドを使用すると意味は以下のとおりです。"
    },
    {
      "indent": 6,
      "text": "Address Family Identifier (AFI):",
      "ja": "ファミリ識別子（AFI）のアドレス："
    },
    {
      "indent": 9,
      "text": "This field in combination with the Subsequent Address Family Identifier field identifies the set of Network Layer protocols to which the address carried in the Next Hop field must belong, the way in which the address of the next hop is encoded, and the semantics of the Network Layer Reachability Information that follows. If the Next Hop is allowed to be from more than one Network Layer protocol, the encoding of the Next Hop MUST provide a way to determine its Network Layer protocol.",
      "ja": "次のアドレスファミリ識別子フィールドと組み合わせて、このフィールドには、次のホップフィールドで運ばれたアドレスが属している必要がありますするネットワーク層プロトコルのセット、ネクストホップのアドレスがエンコードされる方法、およびネットワークのセマンティクスを識別します次のレイヤ到達可能性情報。ネクストホップが複数のネットワーク層プロトコルであることが許可されている場合、ネクストホップの符号化は、ネットワーク層プロトコルを決定するための方法を提供しなければなりません。"
    },
    {
      "indent": 9,
      "text": "Presently defined values for the Address Family Identifier field are specified in the IANA's Address Family Numbers registry [IANA-AF].",
      "ja": "アドレスファミリ識別子フィールドに現在定義された値は、[IANA-AF] IANAのアドレスファミリ番号レジストリで指定されています。"
    },
    {
      "indent": 6,
      "text": "Subsequent Address Family Identifier (SAFI):",
      "ja": "次のアドレスファミリ識別子（SAFI）："
    },
    {
      "indent": 9,
      "text": "This field in combination with the Address Family Identifier field identifies the set of Network Layer protocols to which the address carried in the Next Hop must belong, the way in which the address of the next hop is encoded, and the semantics of the Network Layer Reachability Information that follows. If the Next Hop is allowed to be from more than one Network Layer protocol, the encoding of the Next Hop MUST provide a way to determine its Network Layer protocol.",
      "ja": "アドレスファミリ識別子フィールドと組み合わせて、このフィールドには、次のホップで運ばれたアドレスが属している必要がありますするネットワーク層プロトコルのセット、ネクストホップのアドレスがエンコードされる方法、およびネットワーク層到達可能性のセマンティクスを識別します以下の情報。ネクストホップが複数のネットワーク層プロトコルであることが許可されている場合、ネクストホップの符号化は、ネットワーク層プロトコルを決定するための方法を提供しなければなりません。"
    },
    {
      "indent": 6,
      "text": "Length of Next Hop Network Address:",
      "ja": "ネクストホップネットワークアドレスの長さ："
    },
    {
      "indent": 9,
      "text": "A 1-octet field whose value expresses the length of the \"Network Address of Next Hop\" field, measured in octets.",
      "ja": "その値は1オクテットフィールドは、オクテット単位で測定されたフィールド「ネクストホップのネットワークアドレス」の長さを表します。"
    },
    {
      "indent": 6,
      "text": "Network Address of Next Hop:",
      "ja": "ネクストホップのネットワークアドレス："
    },
    {
      "indent": 9,
      "text": "A variable-length field that contains the Network Address of the next router on the path to the destination system. The Network Layer protocol associated with the Network Address of the Next Hop is identified by a combination of <AFI, SAFI> carried in the attribute.",
      "ja": "デスティネーション・システムへのパス上の次のルータのネットワークアドレスが含まれている可変長フィールド。ネクストホップのネットワークアドレスに関連付けられたネットワーク層プロトコルは、属性で運ば<AFI、SAFI>の組み合わせによって識別されます。"
    },
    {
      "indent": 6,
      "text": "Reserved:",
      "ja": "予約："
    },
    {
      "indent": 9,
      "text": "A 1 octet field that MUST be set to 0, and SHOULD be ignored upon receipt.",
      "ja": "0に設定しなければなりません、そして受信時に無視されるべき1つのオクテットフィールド。"
    },
    {
      "indent": 6,
      "text": "Network Layer Reachability Information (NLRI):",
      "ja": "ネットワーク層到達可能性情報（NLRI）："
    },
    {
      "indent": 9,
      "text": "A variable length field that lists NLRI for the feasible routes that are being advertised in this attribute. The semantics of NLRI is identified by a combination of <AFI, SAFI> carried in the attribute.",
      "ja": "この属性で宣伝されている可能ルートにNLRIをリストし可変長フィールド。 NLRIの意味は属性で運ば<AFI、SAFI>の組み合わせによって識別されます。"
    },
    {
      "indent": 9,
      "text": "When the Subsequent Address Family Identifier field is set to one of the values defined in this document, each NLRI is encoded as specified in the \"NLRI encoding\" section of this document.",
      "ja": "次のアドレスファミリ識別子フィールドは、この文書で定義された値のいずれかに設定されている場合、各NLRIは、この文書の「NLRIエンコード」セクションで指定されるように符号化されます。"
    },
    {
      "indent": 3,
      "text": "The next hop information carried in the MP_REACH_NLRI path attribute defines the Network Layer address of the router that SHOULD be used as the next hop to the destinations listed in the MP_NLRI attribute in the UPDATE message.",
      "ja": "MP_REACH_NLRIパス属性で運ば次ホップ情報は、UPDATEメッセージ中MP_NLRI属性に列挙された宛先へのネクストホップとして使用されるべきルータのネットワーク層アドレスを定義します。"
    },
    {
      "indent": 3,
      "text": "The rules for the next hop information are the same as the rules for the information carried in the NEXT_HOP BGP attribute (see Section 5.1.3 of [BGP-4]).",
      "ja": "ネクストホップ情報の規則は（[BGP-4]のセクション5.1.3を参照）NEXT_HOP BGP属性で搬送される情報のための規則と同じです。"
    },
    {
      "indent": 3,
      "text": "An UPDATE message that carries the MP_REACH_NLRI MUST also carry the ORIGIN and the AS_PATH attributes (both in EBGP and in IBGP exchanges). Moreover, in IBGP exchanges such a message MUST also carry the LOCAL_PREF attribute.",
      "ja": "MP_REACH_NLRIを運ぶUPDATEメッセージは、（EBGPおよびIBGP交換の両方で）ORIGINとAS_PATH属性を運ばなければなりません。また、IBGP交換にそのようなメッセージは、LOCAL_PREF属性を運ばなければなりません。"
    },
    {
      "indent": 3,
      "text": "An UPDATE message that carries no NLRI, other than the one encoded in the MP_REACH_NLRI attribute, SHOULD NOT carry the NEXT_HOP attribute. If such a message contains the NEXT_HOP attribute, the BGP speaker that receives the message SHOULD ignore this attribute.",
      "ja": "何のNLRIを運ばないUPDATEメッセージは、MP_REACH_NLRI属性でエンコードされたもの以外の、NEXT_HOP属性を運ぶべきではありません。このようなメッセージがNEXT_HOP属性が含まれている場合は、メッセージを受信したBGPスピーカはこの属性を無視します。"
    },
    {
      "indent": 3,
      "text": "An UPDATE message SHOULD NOT include the same address prefix (of the same <AFI, SAFI>) in more than one of the following fields: WITHDRAWN ROUTES field, Network Reachability Information fields, MP_REACH_NLRI field, and MP_UNREACH_NLRI field. The processing of an UPDATE message in this form is undefined.",
      "ja": "WITHDRAWN ROUTES分野、ネットワーク到達可能性情報フィールド、MP_REACH_NLRIフィールド、およびMP_UNREACH_NLRIフィールド：UPDATEメッセージは、次のフィールドの複数で（同じ<AFI、SAFI>の）同じアドレスプレフィックスを含めるべきではありません。この形式のUPDATEメッセージの処理は未定義です。"
    },
    {
      "indent": 0,
      "text": "4. Multiprotocol Unreachable NLRI - MP_UNREACH_NLRI (Type Code 15):",
      "section_title": true,
      "ja": "4.マルチプロトコル到達不能NLRI  -  MP_UNREACH_NLRI（タイプコード15）："
    },
    {
      "indent": 3,
      "text": "This is an optional non-transitive attribute that can be used for the purpose of withdrawing multiple unfeasible routes from service.",
      "ja": "これは、サービスからの複数不可能ルートを吸引する目的で使用することができる任意の非推移的な属性です。"
    },
    {
      "indent": 3,
      "text": "The attribute is encoded as shown below:",
      "ja": "以下に示すように属性が符号化されます。"
    },
    {
      "indent": 8,
      "text": "+---------------------------------------------------------+\n| Address Family Identifier (2 octets)                    |\n+---------------------------------------------------------+\n| Subsequent Address Family Identifier (1 octet)          |\n+---------------------------------------------------------+\n| Withdrawn Routes (variable)                             |\n+---------------------------------------------------------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The use and the meaning of these fields are as follows:",
      "ja": "次のように使用し、これらのフィールドの意味は以下のとおりです。"
    },
    {
      "indent": 6,
      "text": "Address Family Identifier (AFI):",
      "ja": "ファミリ識別子（AFI）のアドレス："
    },
    {
      "indent": 9,
      "text": "This field in combination with the Subsequent Address Family Identifier field identifies the set of Network Layer protocols to which the address carried in the Next Hop field must belong, the way in which the address of the next hop is encoded, and the semantics of the Network Layer Reachability Information that follows. If the Next Hop is allowed to be from more than one Network Layer protocol, the encoding of the Next Hop MUST provide a way to determine its Network Layer protocol.",
      "ja": "次のアドレスファミリ識別子フィールドと組み合わせて、このフィールドには、次のホップフィールドで運ばれたアドレスが属している必要がありますするネットワーク層プロトコルのセット、ネクストホップのアドレスがエンコードされる方法、およびネットワークのセマンティクスを識別します次のレイヤ到達可能性情報。ネクストホップが複数のネットワーク層プロトコルであることが許可されている場合、ネクストホップの符号化は、ネットワーク層プロトコルを決定するための方法を提供しなければなりません。"
    },
    {
      "indent": 9,
      "text": "Presently defined values for the Address Family Identifier field are specified in the IANA's Address Family Numbers registry [IANA-AF].",
      "ja": "アドレスファミリ識別子フィールドに現在定義された値は、[IANA-AF] IANAのアドレスファミリ番号レジストリで指定されています。"
    },
    {
      "indent": 6,
      "text": "Subsequent Address Family Identifier (SAFI):",
      "ja": "次のアドレスファミリ識別子（SAFI）："
    },
    {
      "indent": 9,
      "text": "This field in combination with the Address Family Identifier field identifies the set of Network Layer protocols to which the address carried in the Next Hop must belong, the way in which the address of the next hop is encoded, and the semantics of the Network Layer Reachability Information that follows. If the Next Hop is allowed to be from more than one Network Layer protocol, the encoding of the Next Hop MUST provide a way to determine its Network Layer protocol.",
      "ja": "アドレスファミリ識別子フィールドと組み合わせて、このフィールドには、次のホップで運ばれたアドレスが属している必要がありますするネットワーク層プロトコルのセット、ネクストホップのアドレスがエンコードされる方法、およびネットワーク層到達可能性のセマンティクスを識別します以下の情報。ネクストホップが複数のネットワーク層プロトコルであることが許可されている場合、ネクストホップの符号化は、ネットワーク層プロトコルを決定するための方法を提供しなければなりません。"
    },
    {
      "indent": 6,
      "text": "Withdrawn Routes Network Layer Reachability Information:",
      "ja": "取り下げルートのネットワーク層到達可能性情報："
    },
    {
      "indent": 9,
      "text": "A variable-length field that lists NLRI for the routes that are being withdrawn from service. The semantics of NLRI is identified by a combination of <AFI, SAFI> carried in the attribute.",
      "ja": "サービスから引き出されているルートのNLRIをリストし可変長フィールド。 NLRIの意味は属性で運ば<AFI、SAFI>の組み合わせによって識別されます。"
    },
    {
      "indent": 9,
      "text": "When the Subsequent Address Family Identifier field is set to one of the values defined in this document, each NLRI is encoded as specified in the \"NLRI encoding\" section of this document.",
      "ja": "次のアドレスファミリ識別子フィールドは、この文書で定義された値のいずれかに設定されている場合、各NLRIは、この文書の「NLRIエンコード」セクションで指定されるように符号化されます。"
    },
    {
      "indent": 3,
      "text": "An UPDATE message that contains the MP_UNREACH_NLRI is not required to carry any other path attributes.",
      "ja": "MP_UNREACH_NLRIが含まれているUPDATEメッセージは、他のパス属性を運ぶために必要とされていません。"
    },
    {
      "indent": 0,
      "text": "5. NLRI Encoding",
      "section_title": true,
      "ja": "5. NLRIエンコーディング"
    },
    {
      "indent": 3,
      "text": "The Network Layer Reachability information is encoded as one or more 2-tuples of the form <length, prefix>, whose fields are described below:",
      "ja": "ネットワーク層到達可能性情報は、1つまたは複数のフィールドを以下に説明する形態<長さ、プレフィックス>の2タプルとして符号化されます。"
    },
    {
      "indent": 23,
      "text": "+---------------------------+\n|   Length (1 octet)        |\n+---------------------------+\n|   Prefix (variable)       |\n+---------------------------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The use and the meaning of these fields are as follows:",
      "ja": "次のように使用し、これらのフィールドの意味は以下のとおりです。"
    },
    {
      "indent": 3,
      "text": "a) Length:",
      "ja": "A）長さ："
    },
    {
      "indent": 6,
      "text": "The Length field indicates the length, in bits, of the address prefix. A length of zero indicates a prefix that matches all (as specified by the address family) addresses (with prefix, itself, of zero octets).",
      "ja": "Lengthフィールドは、アドレスプレフィックスのビットの長さを、示しています。ゼロの長さ（ゼロオクテットのプレフィックス、自体で）全て（アドレスファミリーによって指定された）アドレスに一致するプレフィックスを示しています。"
    },
    {
      "indent": 3,
      "text": "b) Prefix:",
      "ja": "b）の接頭辞："
    },
    {
      "indent": 6,
      "text": "The Prefix field contains an address prefix followed by enough trailing bits to make the end of the field fall on an octet boundary. Note that the value of trailing bits is irrelevant.",
      "ja": "Prefixフィールドは、オクテット境界上のフィールドの秋の終わりを作るのに十分な末尾のビットに続くアドレスプレフィックスが含まれています。後続のビットの値は無関係であることに留意されたいです。"
    },
    {
      "indent": 0,
      "text": "6. Subsequent Address Family Identifier",
      "section_title": true,
      "ja": "6.次のアドレスファミリ識別子"
    },
    {
      "indent": 3,
      "text": "This document defines the following values for the Subsequent Address Family Identifier field carried in the MP_REACH_NLRI and MP_UNREACH_NLRI attributes:",
      "ja": "この文書は、MP_REACH_NLRIとMP_UNREACH_NLRI属性で運ば次のアドレスファミリ識別子フィールドに次の値を定義します。"
    },
    {
      "indent": 6,
      "text": "1 - Network Layer Reachability Information used for unicast forwarding",
      "ja": "1  - ネットワーク層到達可能性情報は、ユニキャスト転送に使用しました"
    },
    {
      "indent": 6,
      "text": "2 - Network Layer Reachability Information used for multicast forwarding",
      "ja": "2  - ネットワーク層到達可能性情報は、マルチキャスト転送のために使用さ"
    },
    {
      "indent": 3,
      "text": "An implementation MAY support all, some, or none of the Subsequent Address Family Identifier values defined in this document.",
      "ja": "実装はすべて、いくつか、またはこのドキュメントで定義された次のアドレスファミリ識別子値のどれをサポートするかもしれません。"
    },
    {
      "indent": 0,
      "text": "7. Error Handling",
      "section_title": true,
      "ja": "7.エラー処理"
    },
    {
      "indent": 3,
      "text": "If a BGP speaker receives from a neighbor an UPDATE message that contains the MP_REACH_NLRI or MP_UNREACH_NLRI attribute, and if the speaker determines that the attribute is incorrect, the speaker MUST delete all the BGP routes received from that neighbor whose AFI/SAFI is the same as the one carried in the incorrect MP_REACH_NLRI or MP_UNREACH_NLRI attribute. For the duration of the BGP session over which the UPDATE message was received, the speaker then SHOULD ignore all the subsequent routes with that AFI/SAFI received over that session.",
      "ja": "BGPスピーカーが隣人からMP_REACH_NLRIかMP_UNREACH_NLRI属性を含むUPDATEメッセージを受信し、スピーカーは属性が誤っていると判断した場合、スピーカーは、そのAFI / SAFIが同じであるネイバーから受信したすべてのBGPルートを削除する必要がある場合間違ったMP_REACH_NLRIかMP_UNREACH_NLRI属性で運ば1。 UPDATEメッセージを受信した上BGPセッションの間、スピーカーは、次いでAFI / SAFIはそのセッションを介して受信したものと後続のすべてのルートを無視すべきです。"
    },
    {
      "indent": 3,
      "text": "In addition, the speaker MAY terminate the BGP session over which the UPDATE message was received. The session SHOULD be terminated with the Notification message code/subcode indicating \"UPDATE Message Error\"/\"Optional Attribute Error\".",
      "ja": "また、スピーカは、UPDATEメッセージを受信した上BGPセッションを終了することができます。セッションは、「UPDATEメッセージエラー」/「オプション属性エラー」を示す通知メッセージコード/サブコードで終端する必要があります。"
    },
    {
      "indent": 0,
      "text": "8. Use of BGP Capability Advertisement",
      "section_title": true,
      "ja": "BGP能力広告の8."
    },
    {
      "indent": 3,
      "text": "A BGP speaker that uses Multiprotocol Extensions SHOULD use the Capability Advertisement procedures [BGP-CAP] to determine whether the speaker could use Multiprotocol Extensions with a particular peer.",
      "ja": "マルチプロトコル拡張を使用するBGPスピーカは、スピーカが特定のピアとのマルチプロトコル拡張機能を使用できるかどうかを決定する能力広告手順[BGP-CAP]を使用すべきです。"
    },
    {
      "indent": 3,
      "text": "The fields in the Capabilities Optional Parameter are set as follows. The Capability Code field is set to 1 (which indicates Multiprotocol Extensions capabilities). The Capability Length field is set to 4. The Capability Value field is defined as:",
      "ja": "次のように能力任意パラメータのフィールドが設定されています。能力コードフィールドは、（マルチプロトコル拡張機能を示す）1に設定されています。機能長フィールドは4に設定されている能力値フィールドは次のように定義されています。"
    },
    {
      "indent": 21,
      "text": "0       7      15      23      31\n+-------+-------+-------+-------+\n|      AFI      | Res.  | SAFI  |\n+-------+-------+-------+-------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The use and meaning of this field is as follow:",
      "ja": "このフィールドの使用と意味は以下の通りです："
    },
    {
      "indent": 6,
      "text": "AFI - Address Family Identifier (16 bit), encoded the same way as in the Multiprotocol Extensions",
      "ja": "AFIは、 - アドレスファミリー識別子（16ビット）は、マルチプロトコルの拡張と同様に符号化されました"
    },
    {
      "indent": 6,
      "text": "Res. - Reserved (8 bit) field. SHOULD be set to 0 by the sender and ignored by the receiver.",
      "ja": "RES。 - 予約（8ビット）フィールド。送信者によって0に設定され、受信機によって無視されるべきです。"
    },
    {
      "indent": 10,
      "text": "Note that not setting the field value to 0 may create issues\nfor a receiver not ignoring the field.  In addition, this\ndefinition is problematic if it is ever attempted to redefine\nthe field.",
      "raw": true
    },
    {
      "indent": 6,
      "text": "SAFI - Subsequent Address Family Identifier (8 bit), encoded the same way as in the Multiprotocol Extensions.",
      "ja": "サフィ - 次のアドレスファミリー識別子（8ビット）、マルチプロトコル拡張と同様に符号化されました。"
    },
    {
      "indent": 3,
      "text": "A speaker that supports multiple <AFI, SAFI> tuples includes them as multiple Capabilities in the Capabilities Optional Parameter.",
      "ja": "複数の<AFI、SAFI>タプルをサポートしていますスピーカーは、彼らに能力任意パラメータのように複数の機能が含まれています。"
    },
    {
      "indent": 3,
      "text": "To have a bi-directional exchange of routing information for a particular <AFI, SAFI> between a pair of BGP speakers, each such speaker MUST advertise to the other (via the Capability Advertisement mechanism) the capability to support that particular <AFI, SAFI> route.",
      "ja": "BGPスピーカの対の間に特定の<AFI、SAFI>のためのルーティング情報の双方向の交換を持つように、そのような各スピーカは、その特定の<AFI、サフィをサポートするために、（能力広告機構を介して）他の能力をアドバタイズしなければなりません>ルート。"
    },
    {
      "indent": 0,
      "text": "9. IANA Considerations",
      "section_title": true,
      "ja": "9. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "As specified in this document, the MP_REACH_NLRI and MP_UNREACH_NLRI attributes contain the Subsequence Address Family Identifier (SAFI) field. The SAFI name space is defined in this document. The IANA registered and maintains values for the SAFI namespace as follows:",
      "ja": "この文書で指定されているように、MP_REACH_NLRIとMP_UNREACH_NLRI属性は、サブシーケンスアドレスファミリ識別子（SAFI）フィールドが含まれています。 SAFIの名前空間は、この文書で定義されています。 IANAが登録され、次のようにSAFI名前空間の値を維持します。"
    },
    {
      "indent": 6,
      "text": "- SAFI values 1 and 2 are assigned in this document.",
      "ja": " -  SAFI値1及び2は、この文書に割り当てられています。"
    },
    {
      "indent": 6,
      "text": "- SAFI value 3 is reserved. It was assigned by RFC 2858 for a use that was never fully implemented, so it is deprecated by this document.",
      "ja": " -  SAFI値3は予約されています。これは完全には実装されていませんでした使用のためにRFC 2858によ​​って割り当てられたので、それは、この文書で推奨されていません。"
    },
    {
      "indent": 6,
      "text": "- SAFI values 5 through 63 are to be assigned by IANA using either the Standards Action process, defined in [RFC2434], or the Early IANA Allocation process, defined in [RFC4020].",
      "ja": " -  SAFIは[RFC4020]で定義され、[RFC2434]で定義された標準化行動プロセス、または早期IANA割当処理のいずれかを使用してIANAによって割り当てられるべきである5〜63値。"
    },
    {
      "indent": 6,
      "text": "- SAFI values 67 through 127 are to be assigned by IANA, using the \"First Come First Served\" policy, defined in RFC 2434.",
      "ja": " -  SAFIは、RFC 2434で定義された「まず最初に配信是非」ポリシーを使用して、127を通る67はIANAによって割り当てられる値。"
    },
    {
      "indent": 6,
      "text": "- SAFI values 0 and 255 are reserved.",
      "ja": " -  SAFI値0と255は予約されています。"
    },
    {
      "indent": 6,
      "text": "- SAFI values 128 through 240 are part of the previous \"private use\" range. At the time of approval of this document, the unused values were provided to IANA by the Routing Area Director. These unused values, namely, 130, 131, 135 through 139, and 141 through 240, are considered reserved in order to avoid conflicts.",
      "ja": " -  SAFI 240を介して、128は、前「私的使用」の範囲の一部である値。この文書の承認の時には、未使用の値は、ルーティングエリアディレクターによってIANAに提供されました。これらの未使用の値、139を介して、即ち、130、131、135、及び240を介して、141は、衝突を避けるために予約であると考えられます。"
    },
    {
      "indent": 6,
      "text": "- SAFI values 241 through 254 are for \"private use\", and values in this range are not to be assigned by IANA.",
      "ja": " -  SAFIは〜254 241は、「私的使用」のためにされている値、およびこの範囲内の値は、IANAによって割り当てられることはありません。"
    },
    {
      "indent": 1,
      "text": "10. Comparison with",
      "section_title": true,
      "ja": "10.比較"
    },
    {
      "indent": 3,
      "text": "This document makes the use of the next hop information consistent with the information carried in the NEXT_HOP BGP path attribute.",
      "ja": "この文書では、NEXT_HOP BGPパス属性で運ばれた情報と一致し、次のホップ情報を利用します。"
    },
    {
      "indent": 3,
      "text": "This document removes the definition of SAFI 3 and deprecates SAFI 3.",
      "ja": "この文書では、SAFI 3の定義を削除し、SAFI 3を非難します。"
    },
    {
      "indent": 3,
      "text": "This document changes partitioning of the SAFI space. Specifically, in RFC 2858 SAFI values 128 through 240 were part of the \"private use\" range. This document specifies that of this range, allocations that are currently in use are to be recognized by IANA, and that unused values, namely 130, 131, 135 through 139, and 141 through 240, should be considered reserved.",
      "ja": "この文書では、SAFIスペースのパーティションを変更します。具体的には、RFC 2858にSAFI 240を介して、128が「私的使用」の範囲の一部された値。この文書では、この範囲を、現在使用中の割り当てはIANAによって認識されることを指定し、未使用の値、すなわち130、131、139を介して135、及び240を介して、141は、予約された考慮すべきである。その"
    },
    {
      "indent": 3,
      "text": "This document renames the Number of SNPAs field to Reserved and removes the rest of the SNPA-related information from the MP_REACH_NLRI attribute.",
      "ja": "この文書では、予約にSNPAsフィールドの数の名前を変更し、MP_REACH_NLRI属性からSNPA関連情報の残りの部分を削除します。"
    },
    {
      "indent": 1,
      "text": "11. Comparison with",
      "section_title": true,
      "ja": "と11の比較"
    },
    {
      "indent": 3,
      "text": "This document restricts the MP_REACH_NLRI attribute to carry only a single instance of <AFI, SAFI, Next Hop Information, ...>.",
      "ja": "この文書は、MP_REACH_NLRIは<AFI、SAFI、ネクストホップ情報、...>の単一インスタンスのみを運ぶために属性を制限します。"
    },
    {
      "indent": 3,
      "text": "This document restricts the MP_UNREACH_NLRI attribute to carry only a single instance of <AFI, SAFI, ...>.",
      "ja": "この文書では、MP_UNREACH_NLRIは<AFI、SAFI、...>の単一インスタンスのみを運ぶために属性を制限します。"
    },
    {
      "indent": 3,
      "text": "This document clarifies handling of an UPDATE message that carries no NLRI, other than the one encoded in the MP_REACH_NLRI attribute.",
      "ja": "この文書は、MP_REACH_NLRI属性で符号化以外の何NLRIを運ばないUPDATEメッセージの取り扱いを明確にしています。"
    },
    {
      "indent": 3,
      "text": "This document clarifies error handling in the presence of MP_REACH_NLRI or MP_UNREACH_NLRI attributes.",
      "ja": "この文書は、MP_REACH_NLRIかMP_UNREACH_NLRI属性の存在下でのエラー処理を明確にしています。"
    },
    {
      "indent": 3,
      "text": "This document specifies the use of BGP Capabilities Advertisements in conjunction with multi-protocol extensions.",
      "ja": "この文書では、マルチプロトコル拡張と一緒にBGP機能の広告の使用を指定します。"
    },
    {
      "indent": 3,
      "text": "Finally, this document includes the \"IANA Consideration\" section.",
      "ja": "最後に、この文書では、「IANAの考察」のセクションを含んでいます。"
    },
    {
      "indent": 0,
      "text": "12. Security Considerations",
      "section_title": true,
      "ja": "12.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "This extension to BGP does not change the underlying security issues inherent in the existing BGP.",
      "ja": "BGPへのこの拡張は、既存のBGPに固有の基本的なセキュリティ問題を変更しません。"
    },
    {
      "indent": 0,
      "text": "13. Acknowledgements",
      "section_title": true,
      "ja": "13.謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank members of the IDR Working Group for their review and comments.",
      "ja": "作者は彼らのレビューとコメントをIDR作業部会のメンバーに感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "14. Normative References",
      "section_title": true,
      "ja": "14.引用規格"
    },
    {
      "indent": 3,
      "text": "[BGP-CAP] Chandra, R. and J. Scudder, \"Capabilities Advertisement with BGP-4\", RFC 3392, November 2002.",
      "ja": "[BGP-CAP]チャンドラ、R.及びJ.スカダー、 \"BGP-4との機能広告\"、RFC 3392、2002年11月。"
    },
    {
      "indent": 3,
      "text": "[BGP-4] Rekhter, Y., Li, T., and S. Hares, \"A Border Gateway Protocol 4 (BGP-4)\", RFC 4271, January 2006.",
      "ja": "[BGP-4] Rekhter、Y.、李、T.、およびS.野兎、 \"ボーダーゲートウェイプロトコル4（BGP-4）\"、RFC 4271、2006年1月。"
    },
    {
      "indent": 3,
      "text": "[IANA-AF] \"Address Family Numbers\", Reachable from http://www.iana.org/numbers.html",
      "ja": "[IANA-AF] \"アドレスファミリ番号\"、http://www.iana.org/numbers.htmlから到達可能"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2434] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 2434, October 1998.",
      "ja": "[RFC2434] Narten氏、T.とH. Alvestrand、 \"RFCsにIANA問題部に書くためのガイドライン\"、BCP 26、RFC 2434、1998年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC4020] Kompella, K. and A. Zinin, \"Early IANA Allocation of Standards Track Code Points\", BCP 100, RFC 4020, February 2005.",
      "ja": "[RFC4020] Kompella、K.とA.ジニン、 \"標準化過程のコードポイントの初期のIANA配分\"、BCP 100、RFC 4020、2005年2月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Tony Bates Cisco Systems, Inc. EMail: tbates@cisco.com",
      "ja": "トニー・ベイツシスコシステムズ、株式会社Eメール：tbates@cisco.com"
    },
    {
      "indent": 3,
      "text": "Ravi Chandra Sonoa Systems EMail: rchandra@sonoasystems.com",
      "ja": "ラヴィチャンドラSonoaシステムズ電子メール：rchandra@sonoasystems.com"
    },
    {
      "indent": 3,
      "text": "Dave Katz Juniper Networks, Inc. EMail: dkatz@juniper.net",
      "ja": "デイブ・カッツジュニパーネットワークス、株式会社Eメール：dkatz@juniper.net"
    },
    {
      "indent": 3,
      "text": "Yakov Rekhter Juniper Networks, Inc. EMail: yakov@juniper.net",
      "ja": "ヤコフ・レックタージュニパーネットワークス、株式会社Eメール：yakov@juniper.net"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The IETF Trust (2007).",
      "ja": "著作権（C）IETFトラスト（2007）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "この文書では、BCP 78に含まれる権利と許可と制限の適用を受けており、その中の記載を除いて、作者は彼らのすべての権利を保有します。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE IETF TRUST AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とCONTRIBUTOR「そのまま」、ORGANIZATION HE / SHEが表すまたはインターネットSOCIETY、（もしあれば）を後援し、IETF TRUST ANDインターネットエンジニアリングタスクフォース放棄ALLに設けられています。保証は、明示または黙示、この情報の利用および特定目的に対する権利または商品性または適合性の黙示の保証を侵害しない任意の保証がこれらに限定されません。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、本書またはそのような権限下で、ライセンスがたりないかもしれない程度に記載された技術の実装や使用に関係すると主張される可能性があります任意の知的財産権やその他の権利の有効性または範囲に関していかなる位置を取りません利用可能です。またそれは、それがどのような権利を確認する独自の取り組みを行ったことを示すものでもありません。 RFC文書の権利に関する手続きの情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IPRの開示のコピーが利用できるようにIETF事務局とライセンスの保証に行われた、または本仕様の実装者または利用者がそのような所有権の使用のための一般的なライセンスまたは許可を取得するために作られた試みの結果を得ることができますhttp://www.ietf.org/iprのIETFのオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、その注意にこの標準を実装するために必要とされる技術をカバーすることができる任意の著作権、特許または特許出願、またはその他の所有権を持ってすべての利害関係者を招待します。 ietf-ipr@ietf.orgのIETFに情報を記述してください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}