{
  "title": {
    "text": "RFC 4248 - The telnet URI Scheme",
    "ja": "RFC 4248 - telnetのURIスキーム"
  },
  "number": 4248,
  "created_at": "2019-10-22 12:52:36.160479+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                         P. Hoffman\nRequest for Comments: 4248                                VPN Consortium\nObsoletes: 1738                                             October 2005\nCategory: Standards Track",
      "raw": true
    },
    {
      "indent": 25,
      "text": "The telnet URI Scheme",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "ja": "著作権（C）インターネット協会（2005）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document specifies the telnet Uniform Resource Identifier (URI) scheme that was originally specified in RFC 1738. The purpose of this document is to allow RFC 1738 to be made obsolete while keeping the information about the scheme on standards track.",
      "ja": "この文書では、もともとこの文書の目的は、標準化トラックのスキームについての情報を維持しながら、RFC 1738は廃止行うことができるようにすることですRFC 1738で指定されたのtelnetのURI（Uniform Resource Identifier）スキームを指定します。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "URIs were previously defined in [RFC2396], which was updated by [RFC3986]. Those documents also specify how to define schemes for URIs.",
      "ja": "URIは、以前に[RFC3986]で更新された[RFC2396]で定義されました。これらの文書はまた、URIのスキームを定義する方法を指定します。"
    },
    {
      "indent": 3,
      "text": "The first definition for many URI schemes appeared in [RFC1738]. Because that document has been made obsolete, this document copies the telnet URI scheme from it to allow that material to remain on standards track.",
      "ja": "多くのURIスキームのための最初の定義は、[RFC1738]に登場しました。その文書が廃止されたため、このドキュメントのコピーのtelnet URIスキームは、それから、その材料が標準化過程の上とどまることを可能にします。"
    },
    {
      "indent": 0,
      "text": "2. Scheme Definition",
      "section_title": true,
      "ja": "2.スキームの定義"
    },
    {
      "indent": 3,
      "text": "The Telnet URL scheme is used to designate interactive services that may be accessed by the Telnet protocol [STD8].",
      "ja": "Telnet URLスキームはTelnetプロトコル[STD8]によってアクセスすることができる双方向サービスを指定するために使用されます。"
    },
    {
      "indent": 3,
      "text": "A telnet URL takes the form:",
      "ja": "telnet URLは次の形式をとります。"
    },
    {
      "indent": 3,
      "text": "telnet://<user>:<password>@<host>:<port>/",
      "ja": "telnetの：// <ユーザー>：<パスワード> @ <ホスト>：<ポート> /"
    },
    {
      "indent": 3,
      "text": "The final \"/\" character may be omitted. If :<port> is omitted, the port defaults to 23. The :<password> can be omitted, as well as the whole <user>:<password> part. Few implementations handle the user name and password very well, if at all.",
      "ja": "最後の「/」文字を省略することができます。もし：<ポート>省略され、23のポートのデフォルト値：<パスワード>は省略することができるだけでなく、全体を<ユーザー>：<パスワード>の部分。すべてであれば、いくつかの実装は、非常によく、ユーザー名とパスワードを処理します。"
    },
    {
      "indent": 3,
      "text": "This URL does not designate a data object, but rather an interactive service. Remote interactive services vary widely in the means by which they allow remote logins; in practice, the <user> and <password> supplied are advisory only: clients accessing a telnet URL merely advise the user of the suggested username and password.",
      "ja": "このURLはデータオブジェクトではなく、インタラクティブなサービスを指定しません。リモート双方向サービスは、彼らがリモートログインを許可する手段で大きく異なります。実際には、<ユーザー>と<パスワード>が供給されるだけ助言されます。telnetのURLにアクセスしているクライアントは、単に提案し、ユーザー名とパスワードの利用者に助言します。"
    },
    {
      "indent": 3,
      "text": "Many RFCs have added various services to the Telnet protocol for better authentication, encryption of traffic, or both. Those RFCs have not specified new URI schemes for Telnet to invoke those services (along the lines of \"https\" being a different URI scheme from \"http\"). Some modern telnet clients attempt to invoke those more-secure versions of Telnet when resolving a \"telnet\" URL.",
      "ja": "多くのRFCは、より良い認証、トラフィックの暗号化、またはその両方のためのTelnetプロトコルへの様々なサービスを追加しました。これらのRFCは、（「HTTP」とは異なるURIスキームが「https」の線に沿って）、それらのサービスを呼び出すためにTelnetの新しいURIスキームを指定していません。最近の一部のTelnetクライアントは、「telnetの」URLを解決するときのTelnetのそれらよりセキュアなバージョンを起動しようとします。"
    },
    {
      "indent": 0,
      "text": "3. Security Considerations",
      "section_title": true,
      "ja": "3.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "There are many security considerations for URI schemes discussed in [RFC3986].",
      "ja": "[RFC3986]で議論URIスキームのための多くのセキュリティの考慮事項があります。"
    },
    {
      "indent": 3,
      "text": "The Telnet protocol normally uses passwords in the clear for authentication, and normally offers no privacy. In normal telnet, both the user's identity and their password are exposed without any protection; after that, the contents of the entire Telnet session is exposed without any protection.",
      "ja": "Telnetプロトコルは、通常、認証のための明確でパスワードを使用しており、通常は何のプライバシーを提供しています。通常のtelnetでは、両方のユーザーのIDとそのパスワードは、任意の保護なしで公開されています。その後、全体のTelnetセッションの内容は、任意の保護なしで公開されます。"
    },
    {
      "indent": 3,
      "text": "Many extensions have been made to Telnet to make it more secure in different ways. In particular, [RFC2941] gives a framework based on a telnet option that many other security extensions have leveraged off of. These extensions are certainly worthwhile methods for reducing the obvious problems with exposing the user's name, password, and plaintext of the session in the clear.",
      "ja": "多くの拡張機能は、さまざまな方法でそれをより安全にするためのTelnetに行われています。特に、[RFC2941]は、他の多くのセキュリティ拡張機能がオフの活用されていることのtelnetオプションに基づいたフレームワークを提供します。これらの拡張機能は、確かに明確なセッションのユーザ名、パスワード、および平文を暴露すると明らかな問題を軽減するための価値のある方法です。"
    },
    {
      "indent": 3,
      "text": "Although some modern telnet clients attempt to invoke those more-secure versions of Telnet when resolving a \"telnet\" URL, other telnet clients do not, so a user cannot rely on this type of security unless it is explicitly enabled and the results of the security negotiation are checked.",
      "ja": "「telnetの」URLを解決するときに、いくつかの近代的なtelnetクライアントがTelnetのそれらよりセキュアなバージョンを起動しようとしますが、他のTelnetクライアントは、それが明示的に有効とセキュリティの結果されていない限り、ユーザがセキュリティのこのタイプに頼ることができない、しないでください交渉がチェックされます。"
    },
    {
      "indent": 0,
      "text": "4. Normative References",
      "section_title": true,
      "ja": "4.引用規格"
    },
    {
      "indent": 3,
      "text": "[STD8] Postel, J. and J. Reynolds, \"Telnet Protocol Specification\", STD 8, RFC 854, May 1983.",
      "ja": "【STD8]ポステル、J.、およびJ.レイノルズ、 \"テルネットプロトコル仕様\"、STD 8、RFC 854、1983年5月。"
    },
    {
      "indent": 0,
      "text": "5. Informative References",
      "section_title": true,
      "ja": "5.参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC1738] Berners-Lee, T., Masinter, L., and M. McCahill, \"Uniform Resource Locators (URL)\", RFC 1738, December 1994.",
      "ja": "[RFC1738]バーナーズ=リー、T.、Masinter、L.、およびM. McCahill、 \"ユニフォームリソースロケータ（URL）\"、RFC 1738、1994年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC2396] Berners-Lee, T., Fielding, R., and L. Masinter, \"Uniform Resource Identifiers (URI): Generic Syntax\", RFC 2396, August 1998.",
      "ja": "[RFC2396]バーナーズ=リー、T.、フィールディング、R.、およびL. Masinter、 \"統一資源識別子（URI）：一般的な構文\"、RFC 2396、1998年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC2941] Ts'o, T. and J. Altman, \"Telnet Authentication Option\", RFC 2941, September 2000.",
      "ja": "[RFC2941] Ts'oさん、T.及びJ.アルトマン、 \"Telnetの認証オプション\"、RFC 2941、2000年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC3986] Berners-Lee, T., Fielding, R., and L. Masinter, \"Uniform Resource Identifier (URI): Generic Syntax\", STD 66, RFC 3986, January 2005.",
      "ja": "[RFC3986]バーナーズ - リー、T.、フィールディング、R.、およびL. Masinter、 \"ユニフォームリソース識別子（URI）：汎用構文\"、STD 66、RFC 3986、2005年1月。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Paul Hoffman VPN Consortium 127 Segre Place Santa Cruz, CA 95060 US",
      "ja": "ポール・ホフマンVPNコンソーシアム127セグレ場所サンタクルス、CA 95060米国"
    },
    {
      "indent": 3,
      "text": "EMail: paul.hoffman@vpnc.org",
      "ja": "メールアドレス：paul.hoffman@vpnc.org"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "ja": "著作権（C）インターネット協会（2005）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "この文書では、BCP 78に含まれる権利と許可と制限の適用を受けており、その中の記載を除いて、作者は彼らのすべての権利を保有します。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とCONTRIBUTOR「そのまま」、ORGANIZATION HE / SHEが表すまたはインターネットソサエティおよびインターネット・エンジニアリング・タスク・フォース放棄すべての保証、明示または、（もしあれば）後援ISに設けられています。黙示、情報の利用は、特定の目的に対する権利または商品性または適合性の黙示の保証を侵害しない任意の保証含むがこれらに限定されません。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、本書またはそのような権限下で、ライセンスがたりないかもしれない程度に記載された技術の実装や使用に関係すると主張される可能性があります任意の知的財産権やその他の権利の有効性または範囲に関していかなる位置を取りません利用可能です。またそれは、それがどのような権利を確認する独自の取り組みを行ったことを示すものでもありません。 RFC文書の権利に関する手続きの情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IPRの開示のコピーが利用できるようにIETF事務局とライセンスの保証に行われた、または本仕様の実装者または利用者がそのような所有権の使用のための一般的なライセンスまたは許可を取得するために作られた試みの結果を得ることができますhttp://www.ietf.org/iprのIETFのオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、その注意にこの標準を実装するために必要とされる技術をカバーすることができる任意の著作権、特許または特許出願、またはその他の所有権を持ってすべての利害関係者を招待します。 ietf-ipr@ietf.orgのIETFに情報を記述してください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}