{
  "title": {
    "text": "RFC 4892 - Requirements for a Mechanism Identifying a Name Server Instance",
    "ja": "RFC 4892 - 名前サーバーインスタンスを識別するメカニズムの要件"
  },
  "number": 4892,
  "created_at": "2023-05-17 19:17:52.585910+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                           S. Woolf\nRequest for Comments: 4892             Internet Systems Consortium, Inc.\nCategory: Informational                                        D. Conrad\n                                                                   ICANN\n                                                               June 2007",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "Requirements for a Mechanism Identifying a Name Server Instance",
      "ja": "名前サーバーインスタンスを識別するメカニズムの要件"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモは、インターネットコミュニティに情報を提供します。いかなる種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The IETF Trust (2007).",
      "ja": "著作権（c）The IETF Trust（2007）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "With the increased use of DNS anycast, load balancing, and other mechanisms allowing more than one DNS name server to share a single IP address, it is sometimes difficult to tell which of a pool of name servers has answered a particular query. A standardized mechanism to determine the identity of a name server responding to a particular query would be useful, particularly as a diagnostic aid for administrators. Existing ad hoc mechanisms for addressing this need have some shortcomings, not the least of which is the lack of prior analysis of exactly how such a mechanism should be designed and deployed. This document describes the existing convention used in some widely deployed implementations of the DNS protocol, including advantages and disadvantages, and discusses some attributes of an improved mechanism.",
      "ja": "DNS Anycast、ロードバランシング、およびその他のメカニズムの使用が増加し、複数のDNS Name Serverが単一のIPアドレスを共有できるようにするため、名前サーバーのプールが特定のクエリに応答したものを伝えるのが難しい場合があります。特定のクエリに応答する名前サーバーのIDを決定するための標準化されたメカニズムは、特に管理者の診断援助として役立ちます。このニーズに対処するための既存のアドホックメカニズムには、いくつかの欠点がありますが、少なくともそのようなメカニズムをどのように設計および展開するかについての事前の分析がないことです。このドキュメントでは、DNSプロトコルの広く展開されているいくつかの実装で使用される既存の条約について説明し、利点や短所を含む、改善されたメカニズムのいくつかの属性について説明します。"
    },
    {
      "indent": 0,
      "text": "1. Introduction and Rationale",
      "section_title": true,
      "ja": "1. 紹介と根拠"
    },
    {
      "indent": 3,
      "text": "Identifying which name server is responding to queries is often useful, particularly in attempting to diagnose name server difficulties. This is most obviously useful for authoritative nameservers in the attempt to diagnose the source or prevalence of inaccurate data, but can also conceivably be useful for caching resolvers in similar and other situations. Furthermore, the ability to identify which server is responding to a query has become more useful as DNS has become more critical to more Internet users, and as network and server deployment topologies have become more complex.",
      "ja": "特に名前サーバーの難しさを診断しようとする際には、多くの場合、クエリに応答している名前サーバーを特定することがしばしば役立ちます。これは、不正確なデータのソースまたは有病率を診断しようとする試みにおいて、権威ある名前サーバーにとって最も明らかに役立ちますが、同様の状況や他の状況でのレゾルバーのキャッシュにも役立つ可能性があります。さらに、DNSがより多くのインターネットユーザーにとってより重要になり、ネットワークとサーバーの展開トポロジがより複雑になるにつれて、どのサーバーがクエリに応答しているかを識別する機能がより有用になりました。"
    },
    {
      "indent": 3,
      "text": "The conventional means for determining which of several possible servers is answering a query has traditionally been based on the use of the server's IP address as a unique identifier. However, the modern Internet has seen the deployment of various load balancing, fault-tolerance, or attack-resistance schemes such as shared use of unicast IP addresses as documented in [RFC3258]. An unfortunate side effect of these schemes has been to make the use of IP addresses as identifiers associated with DNS (or any other) service somewhat problematic. Specifically, multiple dedicated DNS queries may not go to the same server even though sent to the same IP address. Non-DNS methods such as ICMP ping, TCP connections, or non-DNS UDP packets (such as those generated by tools like \"traceroute\"), etc., may well be even less certain to reach the same server as the one which receives the DNS queries.",
      "ja": "いくつかの可能なサーバーのどれがクエリに応答しているかを判断するための従来の手段は、従来、一意の識別子としてサーバーのIPアドレスの使用に基づいていました。しかし、最新のインターネットでは、[RFC3258]に記載されているユニキャストIPアドレスの共有使用など、さまざまな負荷分散、断層トレランス、または攻撃耐性スキームの展開が見られました。これらのスキームの不幸な副作用は、DNS（またはその他の）サービスに関連する識別子としてIPアドレスをいくらか問題とすることです。具体的には、同じIPアドレスに送信されても、複数の専用DNSクエリは同じサーバーに移動しない場合があります。ICMP Ping、TCP接続、非DNS UDPパケット（「Traceroute」などのツールによって生成されるものなど）などの非DNSメソッドは、受信したサーバーと同じサーバーに到達することはさらに確実ではない場合があります。DNSクエリ。"
    },
    {
      "indent": 3,
      "text": "There is a well-known and frequently-used technique for determining an identity for a nameserver more specific than the possibly-non-unique \"server that answered the query I sent to IP address A.B.C.D\". The widespread use of the existing convention suggests a need for a documented, interoperable means of querying the identity of a nameserver that may be part of an anycast or load-balancing cluster. At the same time, however, it also has some drawbacks that argue against standardizing it as it's been practiced so far.",
      "ja": "IPアドレスA.B.C.Dに送信したクエリに応答した可能性のない「非ユニーク」サーバーよりも具体的な名前サーバーのアイデンティティを決定するためのよく知られている頻繁に使用される手法があります。既存の条約の広範な使用は、アーカストまたは負荷バランスのクラスターの一部である可能性のある名前サーバーのIDを照会する文書化された相互運用可能な手段の必要性を示唆しています。しかし同時に、これまでに実践されているように標準化することに反対するいくつかの欠点もあります。"
    },
    {
      "indent": 0,
      "text": "2. Existing Conventions",
      "section_title": true,
      "ja": "2. 既存の慣習"
    },
    {
      "indent": 3,
      "text": "For some time, the commonly deployed Berkeley Internet Name Domain (BIND) implementation of the DNS protocol suite from the Internet Systems Consortium [BIND] has supported a way of identifying a particular server via the use of a standards-compliant, if somewhat unusual, DNS query. Specifically, a query to a recent BIND server for a TXT resource record in class 3 (CHAOS) for the domain name \"HOSTNAME.BIND.\" will return a string that can be configured by the name server administrator to provide a unique identifier for the responding server. (The value defaults to the result of a gethostname() call). This mechanism, which is an extension of the BIND convention of using CHAOS class TXT RR queries to sub-domains of the \"BIND.\" domain for version information, has been copied by several name server vendors.",
      "ja": "しばらくの間、インターネットシステムコンソーシアムからのDNSプロトコルスイートの一般的に展開されているバークレーインターネット名ドメイン（BIND）実装[BIND]は、標準に準拠している場合、やや珍しい場合、特定のサーバーを識別する方法をサポートしています。DNSクエリ。具体的には、ドメイン名「hostname.bind」のクラス3（chaos）のTXTリソースレコードの最近のBindサーバーへのクエリ。Name Server Administratorによって構成できる文字列を返して、Responsing Serverに一意の識別子を提供します。（値は、gethostname（）callの結果にデフォルトです）。このメカニズムは、カオスクラスTXT RRクエリを「バインド」のサブドメインに使用するバインド条約の拡張です。バージョン情報のドメインは、いくつかの名前サーバーベンダーによってコピーされています。"
    },
    {
      "indent": 3,
      "text": "A refinement to the BIND-based mechanism, which dropped the implementation-specific label, replaces \"BIND.\" with \"SERVER.\". Thus the query label to learn the unique name of a server may appear as \"ID.SERVER.\".",
      "ja": "実装固有のラベルを削除したバインドベースのメカニズムの改良は、「Bind」に取って代わります。「サーバー」で。したがって、サーバーの一意の名前を学習するクエリラベルは、「id.server」として表示される場合があります。"
    },
    {
      "indent": 3,
      "text": "(For reference, the other well-known name used by recent versions of BIND within the CHAOS class \"BIND.\" domain is \"VERSION.BIND.\". A query for a CHAOS TXT RR for this name will return an administratively defined string which defaults to the software version of the server responding. This is, however, not generally implemented by other vendors.)",
      "ja": "（参照のために、Chaosクラス内のBind of Bindの最近のバージョンで使用されている他の有名な名前「Bind。」ドメインは「version.bind。」です。デフォルトは、サーバーのソフトウェアバージョンに応答します。ただし、これは一般に他のベンダーによって実装されていません。）"
    },
    {
      "indent": 0,
      "text": "2.1. Advantages",
      "section_title": true,
      "ja": "2.1. 利点"
    },
    {
      "indent": 3,
      "text": "There are several valuable attributes to this mechanism, which account for its usefulness.",
      "ja": "このメカニズムには、その有用性を説明するいくつかの貴重な属性があります。"
    },
    {
      "indent": 3,
      "text": "1. The \"HOSTNAME.BIND.\" or \"ID.SERVER.\" query response mechanism is within the DNS protocol itself. An identification mechanism that relies on the DNS protocol is more likely to be successful (although not guaranteed) in going to the same system as a \"normal\" DNS query.",
      "ja": "1. 「hostname.bind」。または「id.server」。クエリ応答メカニズムは、DNSプロトコル自体内にあります。DNSプロトコルに依存する識別メカニズムは、「通常の」DNSクエリと同じシステムに移動することで成功する可能性が高くなります（保証されていませんが）。"
    },
    {
      "indent": 3,
      "text": "2. Since the identity information is requested and returned within the DNS protocol, it doesn't require allowing any other query mechanism to the server, such as holes in firewalls for otherwise-unallowed ICMP Echo requests. Thus it is likely to reach the same server over a path subject to the same routing, resource, and security policy as the query, without any special exceptions to site security policy.",
      "ja": "2. ID情報が要求され、DNSプロトコル内で返されるため、それ以外の場合は不注意なICMPエコーリクエストのファイアウォールの穴など、サーバーに他のクエリメカニズムを許可する必要はありません。したがって、サイトセキュリティポリシーに特別な例外なしに、同じルーティング、リソース、およびセキュリティポリシーの対象となるパス上で同じサーバーに到達する可能性があります。"
    },
    {
      "indent": 3,
      "text": "3. It is simple to configure. An administrator can easily turn on this feature and control the results of the relevant query.",
      "ja": "3. 構成は簡単です。管理者は、この機能を簡単にオンにし、関連するクエリの結果を制御できます。"
    },
    {
      "indent": 3,
      "text": "4. It allows the administrator complete control of what information is given out in the response, minimizing passive leakage of implementation or configuration details. Such details are often considered sensitive by infrastructure operators.",
      "ja": "4. これにより、管理者は応答で提供される情報を完全に制御し、実装または構成の詳細の受動的な漏れを最小限に抑えることができます。このような詳細は、多くの場合、インフラストラクチャオペレーターによって敏感であると見なされます。"
    },
    {
      "indent": 0,
      "text": "2.2. Disadvantages",
      "section_title": true,
      "ja": "2.2. 短所"
    },
    {
      "indent": 3,
      "text": "At the same time, there are some serious drawbacks to the CHAOS/TXT query mechanism that argue against standardizing it as it currently operates.",
      "ja": "同時に、カオス/TXTクエリメカニズムには、現在動作している標準化に反対する重大な欠点があります。"
    },
    {
      "indent": 3,
      "text": "1. It requires an additional query to correlate between the answer to a DNS query under normal conditions and the supposed identity of the server receiving the query. There are a number of situations in which this simply isn't reliable.",
      "ja": "1. 通常の条件下でのDNSクエリへの回答とクエリを受信するサーバーの想定されるIDとの間に相関するために、追加のクエリが必要です。これが単に信頼できない状況はいくつかあります。"
    },
    {
      "indent": 3,
      "text": "2. It reserves an entire class in the DNS (CHAOS) for what amounts to one zone. While CHAOS class is defined in [RFC1034] and [RFC1035], it's not clear that supporting it solely for this purpose is a good use of the namespace or of implementation effort.",
      "ja": "2. DNS（Chaos）のクラス全体を1つのゾーンに相当します。Chaosクラスは[RFC1034]および[RFC1035]で定義されていますが、この目的のためだけにそれをサポートすることが名前空間または実装の努力の有効な使用であることは明らかではありません。"
    },
    {
      "indent": 3,
      "text": "3. The initial and still common form, using \"BIND.\", is implementation specific. BIND is one DNS implementation. At the time of this writing, it is probably most prevalent for authoritative servers. This does not justify standardizing on its ad hoc solution to a problem shared across many operators and implementors. Meanwhile, the aforementioned refinement changes the query label but preserves the ad hoc CHAOS/TXT mechanism.",
      "ja": "3. 「bind」を使用する初期およびまだ一般的な形式は、実装固有です。Bindは1つのDNS実装です。この執筆時点では、おそらく権威あるサーバーで最も一般的です。これは、多くのオペレーターと実装者に共有される問題に対するアドホックソリューションの標準化を正当化するものではありません。一方、前述の洗練はクエリラベルを変更しますが、アドホックカオス/TXTメカニズムを保持します。"
    },
    {
      "indent": 3,
      "text": "4. There is no convention or shared understanding of what information an answer to such a query for a server identity could or should contain, including a possible encoding or authentication mechanism.",
      "ja": "4. サーバーのアイデンティティに対するそのようなクエリに対する答えが、可能なエンコードまたは認証メカニズムを含め、どの情報に封じ込められるか、または封じ込めるべきかについての慣習や共有の理解はありません。"
    },
    {
      "indent": 3,
      "text": "5. Hypothetically, since DNSSEC has been defined to cover all DNS classes, the TXT RRs returned in response to the \"ID.SERVER.\" query could be signed, which has the advantages described in [RFC4033]. However, since DNSSEC deployment for the CHAOS class is neither existent nor foreseeable, and since the \"ID.SERVER.\" TXT RR is expected to be unique per server, this would be impossible in practice.",
      "ja": "5. 仮説的に、DNSSECはすべてのDNSクラスをカバーするように定義されているため、TXT RRSは「Id.Server」に応じて返されます。クエリに署名することができますが、これには[RFC4033]で説明されている利点があります。ただし、ChaosクラスのDNSSECの展開は存在しておらず、予見可能ではなく、「Id.Server」以来です。TXT RRはサーバーごとに一意であると予想されますが、これは実際には不可能です。"
    },
    {
      "indent": 3,
      "text": "The first of the listed disadvantages may be technically the most serious. It argues for an attempt to design a good answer to the problem, \"I need to know what nameserver is answering my queries\", not simply a convenient one.",
      "ja": "リストされている最初の欠点は、技術的に最も深刻な場合があります。それは、問題に対する良い答えを設計する試みを主張しています。「名前サーバーが私のクエリに答えていることを知る必要があります」だけでなく、単に便利なものではありません。"
    },
    {
      "indent": 0,
      "text": "3. Characteristics of an Implementation Neutral Convention",
      "section_title": true,
      "ja": "3. 実装中立条約の特性"
    },
    {
      "indent": 3,
      "text": "The discussion above of advantages and disadvantages to the \"HOSTNAME.BIND.\" mechanism suggest some requirements for a better solution to the server identification problem. These are summarized here as guidelines for any effort to provide appropriate protocol extensions:",
      "ja": "上記の議論「hostname.bind」の利点と短所。メカニズムは、サーバー識別の問題に対するより良い解決策のためのいくつかの要件を示唆しています。これらは、適切なプロトコル拡張を提供するためのあらゆる努力のガイドラインとしてここで要約されています。"
    },
    {
      "indent": 3,
      "text": "1. The mechanism adopted must be in-band for the DNS protocol. That is, it needs to allow the query for the server's identifying information to be part of a normal, operational query. It should also permit a separate, dedicated query for the server's identifying information. But it should preserve the ability of the CHAOS/TXT query-based mechanism to work through firewalls and in other situations where only DNS can be relied upon to reach the server of interest.",
      "ja": "1. 採用されたメカニズムは、DNSプロトコルの帯域内でなければなりません。つまり、サーバーの識別情報のクエリを通常の運用クエリの一部にする必要があります。また、サーバーの識別情報の個別の専用クエリを許可する必要があります。ただし、Firewallやその他の状況では、DNSのみが関心のあるサーバーに到達できる他の状況で動作するChaos/TXTクエリベースのメカニズムの能力を維持する必要があります。"
    },
    {
      "indent": 3,
      "text": "2. The new mechanism should not require dedicated namespaces or other reserved values outside of the existing protocol mechanisms for these, i.e., the OPT pseudo-RR. In particular, it should not propagate the existing drawback of requiring support for a CLASS and top level domain in the authoritative server (or the querying tool) to be useful.",
      "ja": "2. 新しいメカニズムは、これらの既存のプロトコルメカニズム、つまりOPT pseudo-RRの外側の専用の名前空間またはその他の予約値を必要としないはずです。特に、権威あるサーバー（またはクエリツール）のクラスおよびトップレベルのドメインをサポートすることを要求するという既存の欠点を伝播して、役立ちます。"
    },
    {
      "indent": 3,
      "text": "3. Support for the identification functionality should be easy to implement and easy to enable. It must be easy to disable and should lend itself to access controls on who can query for it.",
      "ja": "3. 識別機能のサポートは、実装しやすく、有効にするのが簡単でなければなりません。無効にするのは簡単で、誰がそれを照会できるかについてのコントロールにアクセスするために自分自身を貸す必要があります。"
    },
    {
      "indent": 3,
      "text": "4. It should be possible to return a unique identifier for a server without requiring the exposure of information that may be non-public and considered sensitive by the operator, such as a hostname or unicast IP address maintained for administrative purposes.",
      "ja": "4. 管理目的で維持されているホスト名やユニキャストIPアドレスなど、非公開であり、オペレーターが敏感であると見なす可能性のある情報の露出を必要とせずに、サーバーの一意の識別子を返すことができるはずです。"
    },
    {
      "indent": 3,
      "text": "5. It should be possible to authenticate the received data by some mechanism analogous to those provided by DNSSEC. In this context, the need could be met by including encryption options in the specification of a new mechanism.",
      "ja": "5. DNSSECが提供するメカニズムに類似したメカニズムによって受信されたデータを認証できるはずです。これに関連して、新しいメカニズムの仕様に暗号化オプションを含めることにより、必要性を満たすことができます。"
    },
    {
      "indent": 3,
      "text": "6. The identification mechanism should not be implementation-specific.",
      "ja": "6. 識別メカニズムは、実装固有のものであってはなりません。"
    },
    {
      "indent": 0,
      "text": "4. IANA Considerations",
      "section_title": true,
      "ja": "4. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document proposes no specific IANA action. Protocol extensions, if any, to meet the requirements described are out of scope for this document. A proposed extension, specified and adopted by normal IETF process, is described in [NSID], including relevant IANA action.",
      "ja": "このドキュメントは、特定のIANAアクションを提案していません。このドキュメントの要件を満たすためのプロトコル拡張は、ある場合は、ある場合は、ある場合は、ある場合は拡張機能があります。通常のIETFプロセスによって指定および採用された提案された拡張機能は、関連するIANAアクションを含む[NSID]で説明されています。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "Providing identifying information as to which server is responding to a particular query from a particular location in the Internet can be seen as information leakage and thus a security risk. This motivates the suggestion above that a new mechanism for server identification allow the administrator to disable the functionality altogether or partially restrict availability of the data. It also suggests that the server identification data should not be readily correlated with a hostname or unicast IP address that may be considered private to the nameserver operator's management infrastructure.",
      "ja": "インターネット内の特定の場所からの特定のクエリにどのサーバーが応答しているかに関する識別情報を提供することは、情報漏れ、したがってセキュリティリスクと見なすことができます。これにより、サーバー識別のための新しいメカニズムにより、管理者が機能を完全に無効にするか、データの可用性を部分的に制限できるという上記の提案が動機付けられています。また、サーバー識別データを、名前サーバーオペレーターの管理インフラストラクチャにプライベートと見なされるホスト名またはユニキャストIPアドレスと容易に相関させてはならないことも示唆しています。"
    },
    {
      "indent": 3,
      "text": "Propagation of protocol or service meta-data can sometimes expose the application to denial of service or other attack. As the DNS is a critically important infrastructure service for the production Internet, extra care needs to be taken against this risk for designers, implementors, and operators of a new mechanism for server identification.",
      "ja": "プロトコルまたはサービスメタデータの伝播は、サービスの拒否またはその他の攻撃に応用することがあります。DNSは、生産インターネットにとって非常に重要なインフラストラクチャサービスであるため、サーバー識別のための新しいメカニズムの設計者、実装者、およびオペレーターにこのリスクに反して、余分な注意を払う必要があります。"
    },
    {
      "indent": 3,
      "text": "Both authentication and confidentiality of server identification data are potentially of interest to administrators -- that is, operators may wish to make such data available and reliable to themselves and their chosen associates only. This constraint would imply both an ability to authenticate it to themselves and to keep it private from arbitrary other parties, which leads to characteristics 4 and 5 of an improved solution.",
      "ja": "サーバー識別データの認証と機密性の両方は、管理者にとって潜在的に興味深いものです。つまり、オペレーターは、そのようなデータを自分自身と選択した仲間のみに利用可能にし、信頼できるようにすることを希望する場合があります。この制約は、それを自分自身に認証する能力と、改善されたソリューションの特性4と5につながるarbitrary意的な他の関係者からプライベートに保つ能力の両方を意味します。"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgements",
      "section_title": true,
      "ja": "6. 謝辞"
    },
    {
      "indent": 3,
      "text": "The technique for host identification documented here was initially implemented by Paul Vixie of the Internet Software Consortium in the Berkeley Internet Name Daemon package. Comments and questions on earlier versions were provided by Bob Halley, Brian Wellington, Andreas Gustafsson, Ted Hardie, Chris Yarnell, Randy Bush, and members of the ICANN Root Server System Advisory Committee. The newest version takes a significantly different direction from previous versions, owing to discussion among contributors to the DNSOP working group and others, particularly Olafur Gudmundsson, Ed Lewis, Bill Manning, Sam Weiler, and Rob Austein.",
      "ja": "ここに文書化されたホスト識別の手法は、最初にバークレーのインターネット名DaemonパッケージにあるインターネットソフトウェアコンソーシアムのPaul Vixieによって実装されました。以前のバージョンに関するコメントと質問は、ボブ・ハレー、ブライアン・ウェリントン、アンドレアス・グスタフソン、テッド・ハーディ、クリス・ヤーネル、ランディ・ブッシュ、およびICANNルートサーバーシステムアドバイザリー委員会のメンバーによって提供されました。最新のバージョンは、DNSOPワーキンググループや他のグループ、特にOlafur Gudmundsson、Ed Lewis、Bill Manning、Sam Weiler、およびRob Austeinへの貢献者の間で議論されているため、以前のバージョンとは大きく異なる方向を帯びています。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7. 参考文献"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "ja": "7.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC1034] Mockapetris, P., \"Domain Names - Concepts and Facilities\", STD 13, RFC 1034, November 1987.",
      "ja": "[RFC1034] Mockapetris、P。、「ドメイン名 - 概念と施設」、STD 13、RFC 1034、1987年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC1035] Mockapetris, P., \"Domain Names - Implementation and Specification\", STD 13, RFC 1035, November 1987.",
      "ja": "[RFC1035] Mockapetris、P。、「ドメイン名 - 実装と仕様」、STD 13、RFC 1035、1987年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC3258] Hardie, T., \"Distributing Authoritative Name Servers via Shared Unicast Addresses\", RFC 3258, April 2002.",
      "ja": "[RFC3258] Hardie、T。、「共有ユニキャストアドレスを介した権威ある名前サーバーの配布」、RFC 3258、2002年4月。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "ja": "7.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[BIND] ISC, \"BIND 9 Configuration Reference\".",
      "ja": "[バインド] ISC、「バインド9構成リファレンス」。"
    },
    {
      "indent": 3,
      "text": "[NSID] Austein, R., \"DNS Name Server Identifier Option (NSID)\", Work in Progress, June 2006.",
      "ja": "[NSID] Austein、R。、「DNS Name Server Identifier Option（NSID）」、2006年6月の作業。"
    },
    {
      "indent": 3,
      "text": "[RFC4033] Arends, R., Austein, R., Larson, M., Massey, D., and S. Rose, \"DNS Security Introduction and Requirements\", RFC 4033, March 2005.",
      "ja": "[RFC4033] Arends、R.、Austein、R.、Larson、M.、Massey、D。、およびS. Rose、「DNSセキュリティの紹介と要件」、RFC 4033、2005年3月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Suzanne Woolf Internet Systems Consortium, Inc. 950 Charter Street Redwood City, CA 94063 US",
      "ja": "Suzanne Woolf Internet Systems Consortium、Inc。950 Charter Street Redwood City、CA 94063 US"
    },
    {
      "indent": 3,
      "text": "Phone: +1 650 423-1333\nEMail: woolf@isc.org\nURI:   http://www.isc.org/",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "David Conrad ICANN 4676 Admiralty Way Marina del Rey, CA 90292 US",
      "ja": "David Conrad Icann 4676 Admiralty Way Marina Del Rey、CA 90292 US"
    },
    {
      "indent": 3,
      "text": "Phone: +1 310 823 9358\nEMail: david.conrad@icann.org\nURI:   http://www.iana.org/",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The IETF Trust (2007).",
      "ja": "著作権（c）The IETF Trust（2007）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "この文書は、BCP 78に含まれる権利、ライセンス、および制限の対象となり、そこに記載されている場合を除き、著者はすべての権利を保持しています。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE IETF TRUST AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "このドキュメントとここに含まれる情報は、「現状のまま」に基づいて提供され、貢献者、彼/彼女が代表する組織（もしあれば）、インターネット協会、IETFトラスト、インターネットエンジニアリングタスクフォースがすべてを否認します。明示的または黙示的な保証。ここでの情報の使用は、特定の目的に対する商品性または適合性の権利または暗黙の保証を侵害しないという保証を含むがこれらに限定されない。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、知的財産権またはその他の権利の有効性または範囲に関して、本書に記載されている技術の実装または使用、またはそのような権利に基づくライセンスに基づくライセンスの範囲に関連すると主張される可能性のある他の権利に関しては、立場を取得しません。利用可能になります。また、そのような権利を特定するために独立した努力をしたことも表明していません。RFCドキュメントの権利に関する手順に関する情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IETF事務局に行われたIPR開示のコピーと、利用可能にするライセンスの保証、またはこの仕様の実装者またはユーザーによるそのような独自の権利の使用のための一般的なライセンスまたは許可を取得するための試みの結果を取得できます。http://www.ietf.org/iprのIETFオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、関心のある当事者に、著作権、特許、または特許出願、またはこの基準を実装するために必要なテクノロジーをカバーする可能性のあるその他の独自の権利を注意深く招待します。ietf-ipr@ietf.orgのIETFへの情報をお問い合わせください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFCエディター機能の資金は現在、インターネット協会によって提供されています。"
    }
  ]
}