{
  "title": {
    "text": "RFC 4312 - The Camellia Cipher Algorithm and Its Use With IPsec",
    "ja": "RFC 4312 - 椿暗号アルゴリズムとIPsecでの使用"
  },
  "number": 4312,
  "created_at": "2019-10-23 09:22:15.641289+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                            A. Kato\nRequest for Comments: 4312                      NTT Software Corporation\nCategory: Standards Track                                      S. Moriai\n                                        Sony Computer Entertainment Inc.\n                                                                M. Kanda\n                              Nippon Telegraph and Telephone Corporation\n                                                           December 2005",
      "raw": true
    },
    {
      "indent": 10,
      "text": "The Camellia Cipher Algorithm and Its Use With IPsec",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "ja": "著作権（C）インターネット協会（2005）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document describes the use of the Camellia block cipher algorithm in Cipher Block Chaining Mode, with an explicit Initialization Vector, as a confidentiality mechanism within the context of the IPsec Encapsulating Security Payload (ESP).",
      "ja": "この文書では、IPsecカプセル化セキュリティペイロード（ESP）のコンテキスト内で機密性の仕組みとして、明示的な初期化ベクトルと、暗号ブロック連鎖モードで椿ブロック暗号アルゴリズムの使用を記載しています。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "This document describes the use of the Camellia block cipher algorithm in Cipher Block Chaining Mode, with an explicit Initialization Vector, as a confidentiality mechanism within the context of the IPsec Encapsulating Security Payload (ESP).",
      "ja": "この文書では、IPsecカプセル化セキュリティペイロード（ESP）のコンテキスト内で機密性の仕組みとして、明示的な初期化ベクトルと、暗号ブロック連鎖モードで椿ブロック暗号アルゴリズムの使用を記載しています。"
    },
    {
      "indent": 3,
      "text": "Camellia was selected as a recommended cryptographic primitive by the EU NESSIE (New European Schemes for Signatures, Integrity and Encryption) project [NESSIE] and was included in the list of cryptographic techniques for Japanese e-Government systems that was selected by the Japan CRYPTREC (Cryptography Research, Evaluation Committees) [CRYPTREC]. Camellia has been submitted to several other standardization bodies, such as ISO (ISO/IEC 18033) and the IETF S/MIME Mail Security Working Group [Camellia-CMS].",
      "ja": "椿は、プロジェクト[NESSIE]（署名、整合性と暗号化のための新しいヨーロッパのスキーム）EU NESSIEの推奨する暗号プリミティブとして選ばれた、日本CRYPTREC（によって選択された日本の電子政府システムのための暗号技術のリストに含まれていました暗号技術、評価委員会）[CRYPTREC]。椿は、ISO（ISO / IEC 18033）およびIETF S / MIMEメールのセキュリティワーキンググループ[椿-CMS]など、いくつかの他の標準化団体に提出されました。"
    },
    {
      "indent": 3,
      "text": "Camellia supports 128-bit block size and 128-, 192-, and 256-bit key lengths, i.e., the same interface specifications as the Advanced Encryption Standard (AES) [AES].",
      "ja": "椿は、128ビットのブロックサイズと128、192、および256ビットの鍵長、即ち、高度暗号化標準（AES）[AES]と同じインタフェース仕様をサポートします。"
    },
    {
      "indent": 3,
      "text": "Camellia is a symmetric cipher with a Feistel structure. Camillia was developed jointly by NTT and Mitsubishi Electric Corporation in 2000. It was designed to withstand all known cryptanalytic attacks, and it has been scrutinized by worldwide cryptographic experts. Camellia is suitable for implementation in software and hardware, offering encryption speed in software and hardware implementations that is comparable to AES.",
      "ja": "椿はFeistel構造を持つ対称暗号です。 Camilliaは、それはすべての既知の暗号解読の攻撃に耐えるように設計されていた2000年にNTTと三菱電機が共同で開発した、そしてそれは、世界中の暗号専門家によって精査されています。椿は、AESと同等であること、ソフトウェアとハ​​ードウェア実装で暗号化速度を提供し、ソフトウェアとハ​​ードウェアでの実装に適しています。"
    },
    {
      "indent": 3,
      "text": "The Camellia homepage [Camellia-Web] contains a wealth of information about camellia, including detailed specification, security analysis, performance figures, reference implementation, test vectors, and intellectual property information.",
      "ja": "椿のホームページ[椿-ウェブ]詳細な仕様、セキュリティ分析、パフォーマンスの数値、リファレンス実装、テストベクトル、および知的財産情報を含め、椿に関する情報が豊富に含まれています。"
    },
    {
      "indent": 3,
      "text": "The remainder of this document specifies the use of Camellia within the context of IPsec ESP. For further information on how the various pieces of ESP fit together to provide security services, please refer to [ARCH], [ESP], and [ROAD].",
      "ja": "このドキュメントの残りの部分では、IPsec ESPの文脈の中で椿の使用を指定します。 ESPの各種セキュリティサービスを提供するために一緒に収まる方法の詳細については、[ARCH]、[ESP]、および[ROAD]を参照してください。"
    },
    {
      "indent": 0,
      "text": "1.1. Specification of Requirements",
      "section_title": true,
      "ja": "1.1. 要件の仕様"
    },
    {
      "indent": 3,
      "text": "The keywords \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" that appear in this document are to be interpreted as described in [RFC-2119].",
      "ja": "この文書に表示されたキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、 \"SHALL\"、 \"SHOULD\"、 \"ないもの\"、 \"推奨\" \"ない（SHOULD NOT）\"、 \"MAY\"、および \"オプション\" [RFC-2119]に記載されているように解釈されるべきです。"
    },
    {
      "indent": 0,
      "text": "2. The Camellia Cipher Algorithm",
      "section_title": true,
      "ja": "2.椿暗号アルゴリズム"
    },
    {
      "indent": 3,
      "text": "All symmetric block cipher algorithms share common characteristics and variables, including mode, key size, weak keys, block size, and rounds. The following sections contain descriptions of the relevant characteristics of Camellia.",
      "ja": "すべての対称ブロック暗号アルゴリズムは、モード、鍵サイズ、弱鍵、ブロックサイズ、およびラウンドを含む、共通の特性と変数を共有します。次のセクションでは、椿の関連する特性の説明が含まれています。"
    },
    {
      "indent": 3,
      "text": "The algorithm specification and object identifiers are described in [Camellia-Desc].",
      "ja": "アルゴリズム仕様とオブジェクト識別子は、[椿-DESC]に記載されています。"
    },
    {
      "indent": 0,
      "text": "2.1. Mode",
      "section_title": true,
      "ja": "2.1. モード"
    },
    {
      "indent": 3,
      "text": "NIST has defined five modes of operation for AES and other FIPS-approved ciphers [SP800-38a]: CBC (Cipher Block Chaining), ECB (Electronic CodeBook), CFB (Cipher FeedBack), OFB (Output FeedBack), and CTR (Counter). The CBC mode is well defined and well understood for symmetric ciphers, and it is currently required for all other ESP ciphers. This document specifies the use of the Camellia cipher in CBC mode within ESP. This mode requires an Initialization Vector (IV) size that is the same as the block size. Use of a randomly generated IV prevents generation of identical cipher text from packets that have identical data spanning the first block of the cipher algorithm's block size.",
      "ja": "CBC（暗号ブロック連鎖）、ECB（電子ブック）、CFB（暗号フィードバック）、OFB（出力フィードバック）、及びCTR（カウンター：NISTは、AES及び他のFIPS承認の暗号[SP800-38a]のための操作の5つのモードが定義されています）。 CBCモードでは、明確に定義され、よく対称暗号のために理解され、それは現在、他のすべてのESP暗号のために必要とされます。この文書では、ESP内のCBCモードの椿暗号の使用を指定します。このモードは、ブロックサイズと同じで初期化ベクトル（IV）のサイズを必要とします。ランダムに生成されたIVの使用は、暗号アルゴリズムのブロックサイズの最初のブロックにまたがる同一のデータを持つパケットから、同一の暗号文の生成を防ぐことができます。"
    },
    {
      "indent": 3,
      "text": "The CBC IV is XOR'd with the first plaintext block before it is encrypted. Then, for successive blocks, the previous cipher text block is XOR'd with the current plain text before it is encrypted. More information on CBC mode can be obtained in [SP800-38a, CRYPTO-S].",
      "ja": "CBC IVは、それが暗号化される前に、最初の平文ブロックとのXORをとります。それが暗号化される前に続いて、連続するブロックのために、前の暗号文ブロックは、現在、プレーンテキストとのXORをとります。 CBCモードの詳細は[SP800-38a、CRYPTO-S]で得ることができます。"
    },
    {
      "indent": 0,
      "text": "2.2. Key Size",
      "section_title": true,
      "ja": "2.2. キーサイズ"
    },
    {
      "indent": 3,
      "text": "Camellia supports three key sizes: 128 bits, 192 bits, and 256 bits. The default key size is 128 bits, and all implementations MUST support this key size. Implementations MAY also support key sizes of 192 bits and 256 bits.",
      "ja": "128ビット、192ビット、256ビット：椿は3つの主要なサイズをサポートしています。デフォルトのキーサイズは128ビットであり、すべての実装がこのキーサイズをサポートしなければなりません。また、実装は192ビット、256ビットのキーサイズをサポートするかもしれません。"
    },
    {
      "indent": 3,
      "text": "Camellia uses a different number of rounds for each of the defined key sizes. When a 128-bit key is used, implementations MUST use 18 rounds. When a 192-bit key is used, implementations MUST use 24 rounds. When a 256-bit key is used, implementations MUST use 24 rounds.",
      "ja": "椿は、定義された鍵サイズのそれぞれについてラウンドの異なる番号を使用します。 128ビットのキーを使用した場合、実装は18ラウンドを使用しなければなりません。 192ビットの鍵を使用した場合、実装は24ラウンドを使用しなければなりません。 256ビットの鍵を使用した場合、実装は24ラウンドを使用しなければなりません。"
    },
    {
      "indent": 0,
      "text": "2.3. Weak Keys",
      "section_title": true,
      "ja": "2.3. 弱い鍵"
    },
    {
      "indent": 3,
      "text": "At the time of writing this document, there are no known weak keys for Camellia.",
      "ja": "この文書を書いている時点では、ツバキのための既知の弱いキーが存在しません。"
    },
    {
      "indent": 0,
      "text": "2.4. Block Size and Padding",
      "section_title": true,
      "ja": "2.4. ブロックサイズとパディング"
    },
    {
      "indent": 3,
      "text": "Camellia uses a block size of sixteen octets (128 bits).",
      "ja": "椿は、16個のオクテット（128ビット）のブロックサイズを使用します。"
    },
    {
      "indent": 3,
      "text": "Padding is required by the algorithms to maintain a 16-octet (128-bit) block size. Padding MUST be added, as specified in [ESP], such that the data to be encrypted (which includes the ESP Pad Length and Next Header fields) is a multiple of 16 octets.",
      "ja": "パディングは、16オクテット（128ビット）のブロック・サイズを維持するためにアルゴリズムによって必要とされます。 [ESP]で指定されるようにパディングが追加されなければならない、（ESPパッド長と次ヘッダフィールドを含む）データを暗号化するように16オクテットの倍数です。"
    },
    {
      "indent": 3,
      "text": "Because of the algorithm-specific padding requirement, no additional padding is required to ensure that the ciphertext terminates on a 4-octet boundary. That is, maintaining a 16-octet block size guarantees that the ESP Pad Length and Next Header fields will be right-aligned within a 4-octet word). Additional padding MAY be included, as specified in [ESP], as long as the 16-octet block size is maintained.",
      "ja": "そのため、アルゴリズム固有のパディングの要件のため、追加のパディングは暗号文が4オクテット境界で終了していることを保証するために必要とされません。すなわち）ESPパッドの長さと次ヘッダフィールドは4オクテットワード内で右に整列されることが16オクテットブロックサイズ保証を維持すること、です。 [ESP]で指定されるように、追加のパディングがあれば、16オクテットのブロックサイズが維持されるように、含まれてもよいです。"
    },
    {
      "indent": 0,
      "text": "2.5. Performance",
      "section_title": true,
      "ja": "2.5. 演奏"
    },
    {
      "indent": 3,
      "text": "Performance figures of Camellia are available at [Camellia-Web]. This web site also includes performance comparison with the AES cipher and other AES finalists. The NESSIE project [NESSIE] has reported performance of Optimized Implementations independently.",
      "ja": "椿のパフォーマンス実績は、[椿-ウェブ]でご利用いただけます。このウェブサイトはまた、AES暗号と他のAESのファイナリストとの性能比較を含んでいます。 NESSIEプロジェクト[NESSIE]は独立して最適化の実装のパフォーマンスを報告しています。"
    },
    {
      "indent": 0,
      "text": "3. ESP Payload",
      "section_title": true,
      "ja": "3. ESPペイロード"
    },
    {
      "indent": 3,
      "text": "The ESP payload is made up of the IV followed by raw cipher-text. Thus, the payload field, as defined in [ESP], is broken down according to the following diagram:",
      "ja": "ESPペイロードは、生の暗号文に続くIVで構成されています。したがって、[ESP]で定義されるようにペイロードフィールドは、以下の図に従って分解されます。"
    },
    {
      "indent": 3,
      "text": "+---------------+---------------+---------------+---------------+\n|                                                               |\n+               Initialization Vector (16 octets)               +\n|                                                               |\n+---------------+---------------+---------------+---------------+\n|                                                               |\n~ Encrypted Payload (variable length, a multiple of 16 octets)  ~\n|                                                               |\n+---------------------------------------------------------------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The IV field MUST be the same size as the block size of the cipher algorithm being used. The IV MUST be chosen at random, and MUST be unpredictable.",
      "ja": "IVフィールドが使用されている暗号アルゴリズムのブロックサイズと同じサイズでなければなりません。 IVはランダムに選択されなければならない、と予測不可能でなければなりません。"
    },
    {
      "indent": 3,
      "text": "Including the IV in each datagram ensures that each received datagram can be decrypted, even when some datagrams are dropped or re-ordered in transit.",
      "ja": "各データグラムにIVを含むことは、それぞれがいくつかのデータグラムを落としたり輸送中に再注文された場合でも、データグラムを解読することができる受信ことを保証します。"
    },
    {
      "indent": 3,
      "text": "To avoid CBC encryption of very similar plaintext blocks in different packets, implementations MUST NOT use a counter or other low Hamming-distance source for IVs.",
      "ja": "異なるパケットの非常に似通った平文ブロックのCBC暗号化を避けるために、実装は、カウンターやのIVのための他の低ハミング距離のソースを使用してはなりません。"
    },
    {
      "indent": 0,
      "text": "3.1. ESP Algorithmic Interactions",
      "section_title": true,
      "ja": "3.1.  ESPアルゴリズムの相互作用"
    },
    {
      "indent": 3,
      "text": "Currently, there are no known issues regarding interactions between the Camellia and other aspects of ESP, such as the use of certain authentication schemes.",
      "ja": "現在、特定の認証スキームの使用など椿やESPの他の側面の間の相互作用、に関する既知の問題はありません。"
    },
    {
      "indent": 0,
      "text": "3.2. Keying Material",
      "section_title": true,
      "ja": "3.2. 鍵材料"
    },
    {
      "indent": 3,
      "text": "The minimum number of bits sent from the key exchange protocol to the ESP algorithm must be greater than or equal to the key size. The cipher's encryption and decryption key is taken from the first 128, 192, or 256 bits of the keying material.",
      "ja": "ESPアルゴリズムに鍵交換プロトコルから送信されたビットの最小数は、キーのサイズより大きいか等しくなければなりません。暗号の暗号化および復号化鍵を鍵素材の最初の128、192、または256ビットから取り出されます。"
    },
    {
      "indent": 0,
      "text": "4. Interaction with Internet Key Exchange []",
      "section_title": true,
      "ja": "インターネット鍵交換4.インタラクション[]"
    },
    {
      "indent": 3,
      "text": "Camellia was designed to follow the same API as the AES cipher. Therefore, this section defines only Phase 1 Identifier and Phase 2 Identifier. Any other consideration related to interaction with IKE is the same as that of the AES cipher. Details can be found in [AES-IPSEC].",
      "ja": "椿は、AES暗号と同じAPIを追跡するために設計されました。したがって、このセクションは、フェーズ1の識別子及びフェーズ2の識別子を定義します。 IKEとの相互作用に関連する任意の他の考慮事項は、AES暗号の場合と同様です。詳細は[AES-IPSEC]で見つけることができます。"
    },
    {
      "indent": 0,
      "text": "4.1. Phase 1 Identifier",
      "section_title": true,
      "ja": "4.1. フェーズ1つの識別子"
    },
    {
      "indent": 3,
      "text": "For Phase 1 negotiations, IANA has assigned an Encryption Algorithm ID of 8 for CAMELLIA-CBC.",
      "ja": "フェーズ1つのネゴシエーションのために、IANAがcamellia-CBCのための8の暗号化アルゴリズムIDが割り当てられています。"
    },
    {
      "indent": 0,
      "text": "4.2. Phase 2 Identifier",
      "section_title": true,
      "ja": "4.2. フェーズ2の識別子"
    },
    {
      "indent": 3,
      "text": "For Phase 2 negotiations, IANA has assigned an ESP Transform Identifier of 22 for ESP_CAMELLIA.",
      "ja": "フェーズ2つのネゴシエーションのために、IANAは、ESPはESP_CAMELLIAための22の識別子を変換割り当てました。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "Implementations are encouraged to use the largest key sizes they can, taking into account performance considerations for their particular hardware and software configuration. Note that encryption necessarily affects both sides of a secure channel, so such consideration must take into account not only the client side, but also the server. However, a key size of 128 bits is considered secure for the foreseeable future.",
      "ja": "実装は、彼らは、彼らの特定のハードウェアおよびソフトウェアの構成のためのアカウントのパフォーマンスに関する考慮事項を考慮することができ、最大のキーサイズを使用することをお勧めします。こうした配慮は、アカウントにクライアント側でなく、サーバーだけでなくを取る必要がありますので、その暗号化が必ずしも、安全なチャネルの両側に影響します。しかし、128ビットのキーサイズは、予見可能な将来のために安全であると考えています。"
    },
    {
      "indent": 3,
      "text": "No security problem has been found on Camellia [CRYPTREC][NESSIE].",
      "ja": "セキュリティ上の問題は椿[CRYPTREC] [NESSIE]で発見されていなかったん。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has assigned Encryption Algorithm ID = 8 to CAMELLIA-CBC.",
      "ja": "IANAがcamellia-CBCに暗号化アルゴリズムID = 8を割り当てています。"
    },
    {
      "indent": 3,
      "text": "IANA has assigned ESP Transform Identifier = 22 to ESP_CAMELLIA.",
      "ja": "IANAは、ESP ESP_CAMELLIAに識別子= 22を変換割り当てました。"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgements",
      "section_title": true,
      "ja": "7.謝辞"
    },
    {
      "indent": 4,
      "text": "Portions of this text were unabashedly borrowed from [AES-IPSEC].\nThis work was done when the first author worked for NTT.",
      "raw": true
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8.参照文献"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "ja": "8.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[Camellia-Desc] Matsui, M., Nakajima, J., and S. Moriai, \"A Description of the Camellia Encryption Algorithm\", RFC 3713, April 2004.",
      "ja": "[椿-DESC]松井、M.、中島、J.、およびS. Moriai、 \"椿暗号化アルゴリズムの説明\"、RFC 3713、2004年4月。"
    },
    {
      "indent": 3,
      "text": "[ESP] Kent, S., \"IP Encapsulating Security Payload (ESP)\", RFC 4303, December 2005.",
      "ja": "[ESP]ケント、S.、 \"IPカプセル化セキュリティペイロード（ESP）\"、RFC 4303、2005年12月。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "ja": "8.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[AES] NIST, FIPS PUB 197, \"Advanced Encryption Standard (AES),\" November 2001. http://csrc.nist.gov/publications/fips/fips197/ fips-197.{ps,pdf}.",
      "ja": "[AES] NIST、FIPSパブ197、 \"高度暗号化標準（AES）、\" 2001年11月http://csrc.nist.gov/publications/fips/fips197/ FIPS-197 {PS、PDF}。"
    },
    {
      "indent": 3,
      "text": "[AES-IPSEC] Frankel, S., Glenn, R., and S. Kelly, \"The AES-CBC Cipher Algorithm and Its Use With IPsec,\" RFC 3602, September 2003.",
      "ja": "[AES-IPSEC]フランケル、S.、グレン、R.、およびS.ケリー、 \"AES-CBC暗号アルゴリズムおよびIPSecでの使用、\" RFC 3602、2003年9月。"
    },
    {
      "indent": 3,
      "text": "[ARCH] Kent, S. and R. Atkinson, \"Security Architecture for the Internet Protocol\", RFC 2401, November 1998.",
      "ja": "[ARCH]ケント、S.とR.アトキンソン、 \"インターネットプロトコルのためのセキュリティー体系\"、RFC 2401、1998年11月。"
    },
    {
      "indent": 3,
      "text": "[Camellia-CMS] Moriai, S. and A. Kato, \"Use of the Camellia Encryption Algorithm in Cryptographic Message Syntax (CMS)\", RFC 3657, January 2004.",
      "ja": "[椿-CMS] Moriai、S.およびA.加藤、 \"暗号メッセージ構文（CMS）で椿暗号化アルゴリズムの使用\"、RFC 3657、2004年1月。"
    },
    {
      "indent": 3,
      "text": "[Camellia-Web] Camellia web site: http://info.isl.ntt.co.jp/camellia/.",
      "ja": "[椿-ウェブ]カメリアウェブサイト：http://info.isl.ntt.co.jp/camellia/。"
    },
    {
      "indent": 3,
      "text": "[CRYPTO-S] Schneier, B., \"Applied Cryptography Second Edition\", John Wiley & Sons, New York, NY, 1995, ISBN 0-471- 12845-7.",
      "ja": "[CRYPTO-S]シュナイアー、B.、 \"応用暗号第二版\"、John Wiley＆Sons、ニューヨーク、NY、1995、ISBN 0-471- 12845から7。"
    },
    {
      "indent": 3,
      "text": "[CRYPTREC] Information-technology Promotion Agency (IPA), Japan, CRYPTREC. http://www.ipa.go.jp/security/enc/CRYPTREC/ index-e.html.",
      "ja": "[CRYPTREC]情報処理推進機構（IPA）、日本、CRYPTREC。 http://www.ipa.go.jp/security/enc/CRYPTREC/インデックスe.html。"
    },
    {
      "indent": 3,
      "text": "[IKE] Harkins, D. and D. Carrel, \"The Internet Key Exchange (IKE)\", RFC 2409, November 1998.",
      "ja": "[IKE]ハーキンとD.とD.カレル、 \"インターネットキー交換（IKE）\"、RFC 2409、1998年11月。"
    },
    {
      "indent": 3,
      "text": "[SP800-38a] Dworkin, M., \"Recommendation for Block Cipher Modes of Operation - Methods and Techniques\", NIST Special Publication 800-38A, December 2001.",
      "ja": "、は、NIST Special Publication 800-38A、2001年12月 -  [SP800-38a] Dworkin、M.、 \"方法と技術の動作のブロック暗号モードのための勧告\"。"
    },
    {
      "indent": 3,
      "text": "[NESSIE] The NESSIE project (New European Schemes for Signatures, Integrity and Encryption), http://www.cosic.esat.kuleuven.ac.be/nessie/.",
      "ja": "、http://www.cosic.esat.kuleuven.ac.be/nessie/ [NESSIE] NESSIEプロジェクト（署名、整合性と暗号化のための新しいヨーロッパのスキーム）。"
    },
    {
      "indent": 3,
      "text": "[ROAD] Thayer, R., Doraswamy, N., and R. Glenn, \"IP Security Document Roadmap\", RFC 2411, November 1998.",
      "ja": "[ROAD]セイヤー、R.、Doraswamy、N.、およびR.グレン、 \"IPセキュリティドキュメントロードマップ\"、RFC 2411、1998年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC-2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC-2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Akihiro Kato NTT Software Corporation",
      "ja": "あきひろ かと んっｔ そｆとぁれ こｒぽらちおん"
    },
    {
      "indent": 3,
      "text": "Phone: +81-45-212-7934 Fax: +81-45-212-7410 EMail: akato@po.ntts.co.jp",
      "ja": "電話：+ 81-45-212-7934ファックス：+ 81-45-212-7410 Eメール：akato@po.ntts.co.jp"
    },
    {
      "indent": 3,
      "text": "Shiho Moriai Sony Computer Entertainment Inc.",
      "ja": "しほ もりあい そｎｙ こｍぷてｒ えんてｒたいんめんｔ いんｃ。"
    },
    {
      "indent": 3,
      "text": "Phone: +81-3-6438-7523 Fax: +81-3-6438-8629 EMail: camellia@isl.ntt.co.jp (Camellia team) shiho@rd.scei.sony.co.jp (Shiho Moriai)",
      "ja": "Ｐほね： ＋８１ー３ー６４３８ー７５２３ ふぁｘ： ＋８１ー３ー６４３８ー８６２９ えまいｌ： かめっぃあ＠いｓｌ。んっｔ。こ。ｊｐ （かめっぃあ てあｍ） しほ＠ｒｄ。ｓせい。そｎｙ。こ。ｊｐ （しほ もりあい）"
    },
    {
      "indent": 3,
      "text": "Masayuki Kanda Nippon Telegraph and Telephone Corporation",
      "ja": "日本電信電話株式会社神田masayiki"
    },
    {
      "indent": 3,
      "text": "Phone: +81-46-859-2437 Fax: +81-46-859-3365 EMail: kanda@isl.ntt.co.jp",
      "ja": "電話：+ 81-46-859-2437ファックス：+ 81-46-859-3365 Eメール：kanda@isl.ntt.co.jp"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "ja": "著作権（C）インターネット協会（2005）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "この文書では、BCP 78に含まれる権利と許可と制限の適用を受けており、その中の記載を除いて、作者は彼らのすべての権利を保有します。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とCONTRIBUTOR「そのまま」、ORGANIZATION HE / SHEが表すまたはインターネットソサエティおよびインターネット・エンジニアリング・タスク・フォース放棄すべての保証、明示または、（もしあれば）後援ISに設けられています。黙示、情報の利用は、特定の目的に対する権利または商品性または適合性の黙示の保証を侵害しない任意の保証含むがこれらに限定されません。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、本書またはそのような権限下で、ライセンスがたりないかもしれない程度に記載された技術の実装や使用に関係すると主張される可能性があります任意の知的財産権やその他の権利の有効性または範囲に関していかなる位置を取りません利用可能です。またそれは、それがどのような権利を確認する独自の取り組みを行ったことを示すものでもありません。 RFC文書の権利に関する手続きの情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IPRの開示のコピーが利用できるようにIETF事務局とライセンスの保証に行われた、または本仕様の実装者または利用者がそのような所有権の使用のための一般的なライセンスまたは許可を取得するために作られた試みの結果を得ることができますhttp://www.ietf.org/iprのIETFのオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、その注意にこの標準を実装するために必要とされる技術をカバーすることができる任意の著作権、特許または特許出願、またはその他の所有権を持ってすべての利害関係者を招待します。 ietf-ipr@ietf.orgのIETFに情報を記述してください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}