{
  "title": {
    "text": "RFC 4838 - Delay-Tolerant Networking Architecture",
    "ja": "RFC 4838 - 遅延耐性ネットワークアーキテクチャ"
  },
  "number": 4838,
  "created_at": "2019-10-27 07:35:40.841236+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                            V. Cerf\nRequest for Comments: 4838              Google/Jet Propulsion Laboratory\nCategory: Informational                                      S. Burleigh\n                                                                A. Hooke\n                                                            L. Torgerson\n                                          NASA/Jet Propulsion Laboratory\n                                                                R. Durst\n                                                                K. Scott\n                                                   The MITRE Corporation\n                                                                 K. Fall\n                                                       Intel Corporation\n                                                                H. Weiss\n                                                            SPARTA, Inc.\n                                                              April 2007",
      "raw": true
    },
    {
      "indent": 16,
      "text": "Delay-Tolerant Networking Architecture",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモはインターネットコミュニティのための情報を提供します。それはどんな種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The IETF Trust (2007).",
      "ja": "著作権（C）IETFトラスト（2007）。"
    },
    {
      "indent": 0,
      "text": "IESG Note",
      "ja": "IESG注意"
    },
    {
      "indent": 3,
      "text": "This RFC is a product of the Internet Research Task Force and is not a candidate for any level of Internet Standard. The IRTF publishes the results of Internet-related research and development activities. These results might not be suitable for deployment on the public Internet.",
      "ja": "このRFCはインターネットリサーチタスクフォースの製品であり、インターネットStandardのどんなレベルの候補ではありません。 IRTFはインターネット関連の研究開発活動の成果を公表しています。これらの結果は、公共のインターネット上での展開に適していない可能性があります。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document describes an architecture for delay-tolerant and disruption-tolerant networks, and is an evolution of the architecture originally designed for the Interplanetary Internet, a communication system envisioned to provide Internet-like services across interplanetary distances in support of deep space exploration. This document describes an architecture that addresses a variety of problems with internetworks having operational and performance characteristics that make conventional (Internet-like) networking approaches either unworkable or impractical. We define a message-oriented overlay that exists above the transport (or other) layers of the networks it interconnects. The document presents a motivation for the architecture, an architectural overview, review of state management required for its operation, and a discussion of application design issues. This document represents the consensus of the IRTF DTN research group and has been widely reviewed by that group.",
      "ja": "この文書では、遅延トレラントと混乱トレラント・ネットワークのアーキテクチャを説明し、もともと惑星間インターネットのために設計されたアーキテクチャ、深宇宙探査の支援に惑星間の距離間で、インターネットのようなサービスを提供するために、想定される通信システムの進化です。この文書は、従来の（インターネットのような）ネットワークが実行不可能または非現実的のいずれかで接近する動作および性能特性を有するインターネットワークと様々な問題に対処するアーキテクチャを説明しています。我々は、トランスポート（または他の）は、相互接続ネットワークの層の上に存在し、メッセージ指向のオーバーレイを定義します。文書は、アーキテクチャの動機、アーキテクチャの概要、その動作に必要な状態管理の見直し、およびアプリケーションの設計上の問題の議論を提示しています。この文書では、IRTF DTNの研究グループのコンセンサスを表し、広くそのグループによって検討されています。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n2. Why an Architecture for Delay-Tolerant Networking? ..............4\n3. DTN Architectural Description ...................................5\n   3.1. Virtual Message Switching Using Store-and-Forward\n        Operation ..................................................5\n   3.2. Nodes and Endpoints ........................................7\n   3.3. Endpoint Identifiers (EIDs) and Registrations ..............8\n   3.4. Anycast and Multicast .....................................10\n   3.5. Priority Classes ..........................................10\n   3.6. Postal-Style Delivery Options and Administrative Records ..11\n   3.7. Primary Bundle Fields .....................................15\n   3.8. Routing and Forwarding ....................................16\n   3.9. Fragmentation and Reassembly ..............................18\n   3.10. Reliability and Custody Transfer .........................19\n   3.11. DTN Support for Proxies and Application Layer Gateways ...21\n   3.12. Timestamps and Time Synchronization ......................22\n   3.13. Congestion and Flow Control at the Bundle Layer ..........22\n   3.14. Security .................................................23\n4. State Management Considerations ................................25\n   4.1. Application Registration State ............................25\n   4.2. Custody Transfer State ....................................26\n   4.3. Bundle Routing and Forwarding State .......................26\n   4.4. Security-Related State ....................................27\n   4.5. Policy and Configuration State ............................27\n5. Application Structuring Issues .................................28\n6. Convergence Layer Considerations for Use of Underlying\n   Protocols ......................................................28\n7. Summary ........................................................29\n8. Security Considerations ........................................29\n9. IANA Considerations ............................................30\n10. Normative References ..........................................30\n11. Informative References ........................................30\n12. Acknowledgments ...............................................32",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "This document describes an architecture for delay and disruption-tolerant interoperable networking (DTN). The architecture embraces the concepts of occasionally-connected networks that may suffer from frequent partitions and that may be comprised of more than one divergent set of protocols or protocol families. The basis for this architecture lies with that of the Interplanetary Internet, which focused primarily on the issue of deep space communication in high-delay environments. We expect the DTN architecture described here to be utilized in various operational environments, including those subject to disruption and disconnection and those with high-delay; the case of deep space is one specialized example of these, and is being pursued as a specialization of this architecture (See [IPN01] and [SB03] for more details).",
      "ja": "この文書では、遅延及び中断トレラント相互運用可能なネットワーク（DTN）のためのアーキテクチャを説明しています。アーキテクチャは、頻繁なパーティションに苦しむことがあり、時折、接続されたネットワークの概念を包含し、それは、プロトコルまたはプロトコルファミリの複数の発散組から構成されてもよいです。このアーキテクチャの基礎は、高遅延環境における深宇宙通信の問題に主に焦点を当てた惑星間インターネットのことです。我々は、ここで説明DTNアーキテクチャは破壊および切断を受けたもの、高遅延を有するものを含む様々な動作環境で利用されることを期待します。深宇宙の場合は、（[IPN01]及び詳細は[SB03]参照）、これらの特殊な例であり、このアーキテクチャの専門として進められています。"
    },
    {
      "indent": 3,
      "text": "Other networks to which we believe this architecture applies include sensor-based networks using scheduled intermittent connectivity, terrestrial wireless networks that cannot ordinarily maintain end-to-end connectivity, satellite networks with moderate delays and periodic connectivity, and underwater acoustic networks with moderate delays and frequent interruptions due to environmental factors. A DTN tutorial [FW03], aimed at introducing DTN and the types of networks for which it is designed, is available to introduce new readers to the fundamental concepts and motivation. More technical descriptions may be found in [KF03], [JFP04], [JDPF05], and [WJMF05].",
      "ja": "私たちは、このアーキテクチャは、スケジュール断続的な接続、通常、エンド・ツー・エンドの接続性を維持することはできません地上波無線ネットワーク、適度な遅延や定期的な接続と衛星ネットワーク、および中等度の遅れと水中音響ネットワークを用いたセンサベースのネットワークを含む適用と信じているために、他のネットワークと環境要因による頻繁な中断。 DTN、それが設計されているネットワークのタイプを導入することを目的とDTNチュートリアル[FW03]は、基本的な概念および動機に新しい読者を導入するために利用可能です。より技術的な記述は[WJMF05] [JDPF05]、[JFP04]、[KF03]に見出されてもよく。"
    },
    {
      "indent": 3,
      "text": "We define an end-to-end message-oriented overlay called the \"bundle layer\" that exists at a layer above the transport (or other) layers of the networks on which it is hosted and below applications. Devices implementing the bundle layer are called DTN nodes. The bundle layer forms an overlay that employs persistent storage to help combat network interruption. It includes a hop-by-hop transfer of reliable delivery responsibility and optional end-to-end acknowledgement. It also includes a number of diagnostic and management features. For interoperability, it uses a flexible naming scheme (based on Uniform Resource Identifiers [RFC3986]) capable of encapsulating different naming and addressing schemes in the same overall naming syntax. It also has a basic security model, optionally enabled, aimed at protecting infrastructure from unauthorized use.",
      "ja": "我々は、それがアプリケーションの下にホストされたネットワークの層のエンドツーエンドメッセージ指向のオーバーレイは、トランスポート（または他の）の上の層に存在する「バンドル層」と呼ばれる定義します。バンドル層を実装するデバイスは、DTNノードと呼ばれます。バンドル層は、戦闘のネットワークの中断を支援するために永続ストレージを採用してオーバーレイを形成しています。それは信頼性の高い配信の責任のホップバイホップ転送とオプションのエンドツーエンドの確認応答を含んでいます。それはまた、診断および管理機能が多数含まれています。相互運用性のために、異なる命名をカプセル化し、同一の全体的な命名構文のスキームに対処することができる（統一リソース識別子[RFC3986]に基づいて）フレキシブル命名方式を使用します。また、基本的なセキュリティモデル、必要に応じて、有効な不正使用からインフラストラクチャを保護することを目的としています。"
    },
    {
      "indent": 3,
      "text": "The bundle layer provides functionality similar to the internet layer of gateways described in the original ARPANET/Internet designs [CK74]. It differs from ARPANET gateways, however, because it is layer-agnostic and is focused on virtual message forwarding rather than packet switching. However, both generally provide interoperability between underlying protocols specific to one environment and those protocols specific to another, and both provide a store-and-forward forwarding service (with the bundle layer employing persistent storage for its store and forward function).",
      "ja": "バンドル層は、元のARPANET /インターネットデザイン[CK74]に記載のゲートウェイのインターネット層と同様の機能を提供します。それが層にとらわれないで、仮想メッセージ転送ではなく、パケット交換に焦点を当てているので、しかし、ARPANETのゲートウェイとは異なります。しかし、両方は、一般に、1つの環境及び他に特定それらのプロトコルに固有の基本的なプロトコル間の相互運用性を提供し、両方が（そのストアアンドフォワード機能のための永続的なストレージを使用するバンドル層で）ストア・アンド・フォワード転送サービスを提供します。"
    },
    {
      "indent": 3,
      "text": "In a sense, the DTN architecture provides a common method for interconnecting heterogeneous gateways or proxies that employ store-and-forward message routing to overcome communication disruptions. It provides services similar to electronic mail, but with enhanced naming, routing, and security capabilities. Nodes unable to support the full capabilities required by this architecture may be supported by application-layer proxies acting as DTN applications.",
      "ja": "ある意味では、DTNアーキテクチャは、異種のゲートウェイまたは通信の中断を克服するためのストアアンドフォワードメッセージルーティングを使用するプロキシを相互接続するための一般的な方法を提供します。これは、電子メールと同様のサービスを提供していますが、強化命名、ルーティング、およびセキュリティ機能を備えました。このアーキテクチャにより、必要なすべての機能をサポートすることができないノードは、DTNアプリケーションとして動作するアプリケーション層のプロキシによってサポートすることができます。"
    },
    {
      "indent": 0,
      "text": "2. Why an Architecture for Delay-Tolerant Networking?",
      "section_title": true,
      "ja": "2.なぜ遅延耐性ネットワークのためのアーキテクチャ？"
    },
    {
      "indent": 3,
      "text": "Our motivation for pursuing an architecture for delay tolerant networking stems from several factors. These factors are summarized below; much more detail on their rationale can be explored in [SB03], [KF03], and [DFS02].",
      "ja": "遅延耐性ネットワークのアーキテクチャを追求するために私たちの動機はいくつかの要因から生じます。これらの要因は以下のとおりです。その根拠に多くの詳細は[SB03]、[KF03]で検討し、[DFS02]することができます。"
    },
    {
      "indent": 3,
      "text": "The existing Internet protocols do not work well for some environments, due to some fundamental assumptions built into the Internet architecture:",
      "ja": "既存のインターネットプロトコルが原因インターネットアーキテクチャに組み込まれているいくつかの基本的な仮定に、一部の環境ではうまく機能しません。"
    },
    {
      "indent": 3,
      "text": "- that an end-to-end path between source and destination exists for the duration of a communication session",
      "ja": " - 送信元と宛先との間のエンドツーエンドパスは、通信セッションの期間が存在すること"
    },
    {
      "indent": 3,
      "text": "- (for reliable communication) that retransmissions based on timely and stable feedback from data receivers is an effective means for repairing errors",
      "ja": " - （信頼性の高い通信のための）データ受信機からタイムリーかつ安定したフィードバックに基づいて再送信がエラーを修復するための有効な手段であること"
    },
    {
      "indent": 3,
      "text": "- that end-to-end loss is relatively small",
      "ja": " - エンドツーエンドの損失が比較的小さいこと"
    },
    {
      "indent": 3,
      "text": "- that all routers and end stations support the TCP/IP protocols",
      "ja": " - すべてのルータとエンドステーションは、TCP / IPプロトコルをサポートしていること"
    },
    {
      "indent": 3,
      "text": "- that applications need not worry about communication performance",
      "ja": " - アプリケーションは、通信性能を心配する必要がないこと"
    },
    {
      "indent": 3,
      "text": "- that endpoint-based security mechanisms are sufficient for meeting most security concerns",
      "ja": " - エンドポイントベースのセキュリティ・メカニズムは、ほとんどのセキュリティ上の懸念を満たすのに十分であることを"
    },
    {
      "indent": 3,
      "text": "- that packet switching is the most appropriate abstraction for interoperability and performance",
      "ja": " - パケット交換は、相互運用性とパフォーマンスのための最も適切な抽象化であること"
    },
    {
      "indent": 3,
      "text": "- that selecting a single route between sender and receiver is sufficient for achieving acceptable communication performance",
      "ja": " - 送信者と受信者との間の単一の経路を選択することは許容される通信性能を達成するために十分であること"
    },
    {
      "indent": 3,
      "text": "The DTN architecture is conceived to relax most of these assumptions, based on a number of design principles that are summarized here (and further discussed in [KF03]):",
      "ja": "DTNアーキテクチャは、ここに要約（さらに[KF03]で議論される）の設計原理の数に基づいて、これらの仮定の大部分を緩和するために考案されています。"
    },
    {
      "indent": 3,
      "text": "- Use variable-length (possibly long) messages (not streams or limited-sized packets) as the communication abstraction to help enhance the ability of the network to make good scheduling/path selection decisions when possible.",
      "ja": " - 通信の抽象化として使用可変長（おそらく長い）メッセージ（ないストリームや限られたサイズのパケット）の可能な優れたスケジューリング/パス選択決定を行うためのネットワークの能力を高めるのに役立ちます。"
    },
    {
      "indent": 3,
      "text": "- Use a naming syntax that supports a wide range of naming and addressing conventions to enhance interoperability.",
      "ja": " - 相互運用性を強化するための命名規則とアドレスの広い範囲をサポートして命名構文を使用します。"
    },
    {
      "indent": 3,
      "text": "- Use storage within the network to support store-and-forward operation over multiple paths, and over potentially long timescales (i.e., to support operation in environments where many and/or no end-to-end paths may ever exist); do not require end-to-end reliability.",
      "ja": " - ネットワーク内で使用するストレージは、（多くの及び/又は全くのエンドツーエンドパスがこれまで存在してもよい環境での動作をサポートするために、すなわち、）複数の経路、及びオーバー潜在的に長い時間スケールにわたってストア・アンド・フォワード動作をサポートします。エンドツーエンドの信頼性を必要としません。"
    },
    {
      "indent": 3,
      "text": "- Provide security mechanisms that protect the infrastructure from unauthorized use by discarding traffic as quickly as possible.",
      "ja": " - 可能な限り迅速にトラフィックを破棄することにより、不正使用からインフラストラクチャを保護するセキュリティメカニズムを提供します。"
    },
    {
      "indent": 3,
      "text": "- Provide coarse-grained classes of service, delivery options, and a way to express the useful lifetime of data to allow the network to better deliver data in serving the needs of applications.",
      "ja": " - サービス、配信オプション、およびネットワークは、より良いアプリケーションのニーズに応えるデータを提供できるようにするために、データの有効寿命を表現する方法の粗粒のクラスを提供します。"
    },
    {
      "indent": 3,
      "text": "The use of the bundle layer is guided not only by its own design principles, but also by a few application design principles:",
      "ja": "バンドル層の使用は、独自の設計原理によって、だけでなく、いくつかのアプリケーションの設計原理ではないだけに案内されます。"
    },
    {
      "indent": 3,
      "text": "- Applications should minimize the number of round-trip exchanges.",
      "ja": " - アプリケーションは、往復交換の回数を最小限に抑える必要があります。"
    },
    {
      "indent": 3,
      "text": "- Applications should cope with restarts after failure while network transactions remain pending.",
      "ja": " - ネットワークトランザクションが保留中のままでアプリケーションが失敗した後の再起動に対処する必要があります。"
    },
    {
      "indent": 3,
      "text": "- Applications should inform the network of the useful life and relative importance of data to be delivered.",
      "ja": " - アプリケーションは、耐用年数のネットワークと配信されるデータの相対的な重要性を通知する必要があります。"
    },
    {
      "indent": 3,
      "text": "These issues are discussed in further detail in Section 5.",
      "ja": "これらの問題は、第5節でさらに詳細に議論されています。"
    },
    {
      "indent": 0,
      "text": "3. DTN Architectural Description",
      "section_title": true,
      "ja": "3. DTNアーキテクチャの説明"
    },
    {
      "indent": 3,
      "text": "The previous section summarized the design principles that guide the definition of the DTN architecture. This section presents a description of the major features of the architecture resulting from design decisions guided by the aforementioned design principles.",
      "ja": "前のセクションでは、DTNアーキテクチャの定義を導く設計原理をまとめました。このセクションでは、前述の設計原理によって導かれた設計上の決定から生じたアーキテクチャの主な機能の説明を提示しています。"
    },
    {
      "indent": 0,
      "text": "3.1. Virtual Message Switching Using Store-and-Forward Operation",
      "section_title": true,
      "ja": "3.1. 仮想メッセージストアアンドフォワード操作によるスイッチング"
    },
    {
      "indent": 3,
      "text": "A DTN-enabled application sends messages of arbitrary length, also called Application Data Units or ADUs [CT90], which are subject to any implementation limitations. The relative order of ADUs might not be preserved. ADUs are typically sent by and delivered to applications in complete units, although a system interface that behaves differently is not precluded.",
      "ja": "DTN対応アプリケーションは、任意の実装の制限の対象となるアプリケーションデータユニットまたはのADU [CT90]を、と呼ばれる、任意の長さのメッセージを送信します。 ADUの相対的な順序は保持されないことがあります。 ADUは、典型的には、によって送信され、異なる動作システムインタフェースが排除されていないが、完全な単位でアプリケーションに配信されます。"
    },
    {
      "indent": 3,
      "text": "ADUs are transformed by the bundle layer into one or more protocol data units called \"bundles\", which are forwarded by DTN nodes. Bundles have a defined format containing two or more \"blocks\" of data. Each block may contain either application data or other information used to deliver the containing bundle to its destination(s). Blocks serve the purpose of holding information typically found in the header or payload portion of protocol data units in other protocol architectures. The term \"block\" is used instead of \"header\" because blocks may not appear at the beginning of a bundle due to particular processing requirements (e.g., digital signatures).",
      "ja": "ADUはDTNノードによって転送される「バンドル」と呼ばれる1つ以上のプロトコルデータユニット、の中にバンドル層によって変換されます。バンドルは、データの2つ以上の「ブロック」を含む定義された形式を持っています。各ブロックは、アプリケーションデータまたはその宛先（複数可）を含有するバンドルを送達するために使用される他の情報のいずれかを含むことができます。ブロックは、典型的には、他のプロトコルアーキテクチャにおけるプロトコルデータユニットのヘッダ又はペイロード部分に見出される情報を保持する目的を果たします。ブロックは、原因特定の処理要件（例えば、デジタル署名）に束の先頭に表示されない可能性があるため、「ブロック」という用語の代わりに「ヘッダ」を使用します。"
    },
    {
      "indent": 3,
      "text": "Bundles may be split up (\"fragmented\") into multiple constituent bundles (also called \"fragments\" or \"bundle fragments\") during transmission. Fragments are themselves bundles, and may be further fragmented. Two or more fragments may be reassembled anywhere in the network, forming a new bundle.",
      "ja": "バンドル伝送中に複数の構成バンドル（別名「断片」または「バンドルフラグメント」）に（「断片化」）に分割されてもよいです。フラグメントは自身のバンドルであり、さらに断片化されたかもしれません。二つ以上の断片を、新しいバンドルを形成し、ネットワーク内のどこにでも再組み立てすることができます。"
    },
    {
      "indent": 3,
      "text": "Bundle sources and destinations are identified by (variable-length) Endpoint Identifiers (EIDs, described below), which identify the original sender and final destination(s) of bundles, respectively. Bundles also contain a \"report-to\" EID used when special operations are requested to direct diagnostic output to an arbitrary entity (e.g., other than the source). An EID may refer to one or more DTN nodes (i.e., for multicast destinations or \"report-to\" destinations).",
      "ja": "バンドルソースおよび宛先は、それぞれ、束の元の送信者と最終的な宛先を識別する（可変長）エンドポイント識別子（後述のEID）、（S）によって識別されます。バンドルは、「レポートする」特別な操作は（ソース以外例えば、他の）任意のエンティティに診断出力を向けるように要求されたときEIDが使用を含みます。 EIDは、（マルチキャスト宛先または「レポートする」地域に、すなわち、）は、1つ以上のDTNノードを指すことができます。"
    },
    {
      "indent": 3,
      "text": "While IP networks are based on \"store-and-forward\" operation, there is an assumption that the \"storing\" will not persist for more than a modest amount of time, on the order of the queuing and transmission delay. In contrast, the DTN architecture does not expect that network links are always available or reliable, and instead expects that nodes may choose to store bundles for some time. We anticipate that most DTN nodes will use some form of persistent storage for this -- disk, flash memory, etc. -- and that stored bundles will survive system restarts.",
      "ja": "IPネットワークは、「ストアアンドフォワード」操作に基づいているが、「保存」キューイングおよび送信遅延のために、時間の適度な量以上持続しないという仮定があります。これとは対照的に、DTNアーキテクチャは、ネットワークリンクが常に利用可能か、信頼性があることを期待して、代わりにノードがいくつかの時間のためにバンドルを保存することを選択することを期待していません。ディスク、フラッシュメモリなど -   - と保存されたバンドルは、システムの再起動を生き残ることを私たちは、ほとんどのDTNノードは、いくつかの本のための永続ストレージのフォームを使用することを期待しています。"
    },
    {
      "indent": 3,
      "text": "Bundles contain an originating timestamp, useful life indicator, a class of service designator, and a length. This information provides bundle-layer routing with a priori knowledge of the size and performance requirements of requested data transfers. When there is a significant amount of queuing that can occur in the network (as is the case in the DTN version of store-and-forward), the advantage provided by knowing this information may be significant for making scheduling and path selection decisions [JFP04]. An alternative abstraction (i.e., of stream-based delivery based on packets) would make such scheduling much more difficult. Although packets provide some of the same benefits as bundles, larger aggregates provide a way for the network to apply scheduling and buffer management to units of data that are more useful to applications.",
      "ja": "バンドルは、発信タイムスタンプ、耐用年数インジケーター、サービス指定子のクラス、および長さを含んでいます。この情報は、要求されたデータ転送のサイズと性能要件の先験的知識とバンドル層ルーティングを提供します。 （ストアアンドフォワードのDTNバージョンの場合のように）ネットワーク内で発生する可能性がキューイングのかなりの量が存在する場合、この情報を知ることによって提供される利点は、スケジューリングおよび経路選択決定を行うために重要であり得る[JFP04 ]。 （すなわち、パケットに基づいて、ストリームベースの送達）別の抽象化は、そのようなスケジューリングがはるかに困難になるだろう。パケットがバンドルと同じ利点のいくつかを提供しますが、より大きな凝集体は、アプリケーションに対してより有用されているデータの単位にスケジューリングおよびバッファ管理を適用するネットワークのための方法を提供します。"
    },
    {
      "indent": 3,
      "text": "An essential element of the bundle-based style of forwarding is that bundles have a place to wait in a queue until a communication opportunity (\"contact\") is available. This highlights the following assumptions:",
      "ja": "転送のバンドルベースのスタイルの重要な要素は、バンドルが通信機会（「接触」）が使用可能になるまでキューで待機する場所を持っているということです。これは、以下の仮定を強調します："
    },
    {
      "indent": 3,
      "text": "1. that storage is available and well-distributed throughout the network,",
      "ja": "1.そのストレージが利用可能であり、ネットワーク全体によく分散します、"
    },
    {
      "indent": 3,
      "text": "2. that storage is sufficiently persistent and robust to store bundles until forwarding can occur, and",
      "ja": "2.そのストレージ、転送が発生することができるまで格納束に十分に持続的かつ堅牢であり、そして"
    },
    {
      "indent": 3,
      "text": "3. (implicitly) that this \"store-and-forward\" model is a better choice than attempting to effect continuous connectivity or other alternatives.",
      "ja": "3.（暗黙的に）この「ストアアンドフォワード」モデルは、継続的な接続または他の選択肢を達成するためにしようとするよりも良い選択であること。"
    },
    {
      "indent": 3,
      "text": "For a network to effectively support the DTN architecture, these assumptions must be considered and must be found to hold. Even so, the inclusion of long-term storage as a fundamental aspect of the DTN architecture poses new problems, especially with respect to congestion management and denial-of-service mitigation. Node storage in essence represents a new resource that must be managed and protected. Much of the research in DTN revolves around exploring these issues. Congestion is discussed in Section 3.13, and security mechanisms, including methods for DTN nodes to protect themselves from handling unauthorized traffic from other nodes, are discussed in [DTNSEC] and [DTNSOV].",
      "ja": "ネットワークが効果的にDTNアーキテクチャをサポートするために、これらの仮定を考慮しなければならないと保持するために見つけなければなりません。たとえそうであっても、DTNアーキテクチャの基本的な側面としての長期保存の包含は、特に輻輳管理及びサービス拒否緩和に関して、新たな問題を提起します。本質的にはノードのストレージを管理し、保護しなければならない新しいリソースを表します。 DTNにおける研究の多くは、これらの問題を探求中心に展開します。輻輳は、セクション3.13で説明され、他のノードからの不正なトラフィックを処理から身を守るためのDTNノードのための方法を含むセキュリティメカニズムは、[DTNSOV] [DTNSEC]で論じられています。"
    },
    {
      "indent": 0,
      "text": "3.2. Nodes and Endpoints",
      "section_title": true,
      "ja": "3.2. ノードおよびエンドポイント"
    },
    {
      "indent": 3,
      "text": "A DTN node (or simply \"node\" in this document) is an engine for sending and receiving bundles -- an implementation of the bundle layer. Applications utilize DTN nodes to send or receive ADUs carried in bundles (applications also use DTN nodes when acting as report-to destinations for diagnostic information carried in bundles). Nodes may be members of groups called \"DTN endpoints\". A DTN endpoint is therefore a set of DTN nodes. A bundle is considered to have been successfully delivered to a DTN endpoint when some minimum subset of the nodes in the endpoint has received the bundle without error. This subset is called the \"minimum reception group\" (MRG) of the endpoint. The MRG of an endpoint may refer to one node (unicast), one of a group of nodes (anycast), or all of a group of nodes (multicast and broadcast). A single node may be in the MRG of multiple endpoints.",
      "ja": "バンドル層の実装 -  DTNノード（または本書で単に「ノード」）バンドルを送信および受信するためのエンジンです。アプリケーションは、のADUを送信または受信するDTNノードを利用（レポートへのバンドルで運ばれた診断情報の宛先として動作するときのアプリケーションもDTNノードを使用）のバンドルで運ば。ノードは、「DTNエンドポイント」と呼ばれるグループのメンバーであってもよいです。 DTNエンドポイントは、したがって、DTNノードの集合です。バンドルは、エンドポイントにおけるノードの一部最小サブセットがエラーなしバンドルを受信したときに正常DTNエンドポイントに配信されたと考えられます。このサブセットは、エンドポイントの「最小受信基」（MRG）と呼ばれます。終点のMRG 1つのノード（ユニキャスト）、ノード（エニーキャスト）のグループの1つ、またはノードのグループ（マルチキャストおよびブロードキャスト）の全てを参照することができます。単一のノードが複数のエンドポイントのMRGであってもよいです。"
    },
    {
      "indent": 0,
      "text": "3.3. Endpoint Identifiers (EIDs) and Registrations",
      "section_title": true,
      "ja": "3.3. エンドポイント識別子（のEID）と登録"
    },
    {
      "indent": 3,
      "text": "An Endpoint Identifier (EID) is a name, expressed using the general syntax of URIs (see below), that identifies a DTN endpoint. Using an EID, a node is able to determine the MRG of the DTN endpoint named by the EID. Each node is also required to have at least one EID that uniquely identifies it.",
      "ja": "エンドポイント識別子（EID）の名で、DTNエンドポイントを識別するURIの一般的な構文を（下記参照）を用いて発現させました。 EIDを使用して、ノードがEIDによって指定DTN終点のMRGを決定することができます。各ノードはまた、一意に識別する少なくとも一つのEIDが要求されます。"
    },
    {
      "indent": 3,
      "text": "Applications send ADUs destined for an EID, and may arrange for ADUs sent to a particular EID to be delivered to them. Depending on the construction of the EID being used (see below), there may be a provision for wildcarding some portion of an EID, which is often useful for diagnostic and routing purposes.",
      "ja": "アプリケーションは、のADUは、EIDのために運命、とのADUは彼らに配信されるように、特定のEIDに送ら手配も送ります。 （下記参照）を使用してEIDの構成に応じて、多くの場合、診断およびルーティングの目的のために有用であるEIDの一部をワイルドカードのための規定があってもよいです。"
    },
    {
      "indent": 3,
      "text": "An application's desire to receive ADUs destined for a particular EID is called a \"registration\", and in general is maintained persistently by a DTN node. This allows application registration information to survive application and operating system restarts.",
      "ja": "特定のEID宛てのADUを受け取るために、アプリケーションの願望は「登録」と呼ばれ、一般的にDTNノードによって永続的に維持されています。これは、アプリケーションとオペレーティングシステムの再起動を生き残るためにアプリケーションの登録情報を可能にします。"
    },
    {
      "indent": 3,
      "text": "An application's attempt to establish a registration is not guaranteed to succeed. For example, an application could request to register itself to receive ADUs by specifying an Endpoint ID that is uninterpretable or unavailable to the DTN node servicing the request. Such requests are likely to fail.",
      "ja": "登録を確立するために、アプリケーションの試みは成功するために保証されません。例えば、アプリケーションが要求をサービスDTNノードに解釈できない、または利用できないエンドポイントIDを指定してのADUを受信するように自身を登録するように要求することができます。このような要求は失敗する可能性があります。"
    },
    {
      "indent": 0,
      "text": "3.3.1. URI Schemes",
      "section_title": true,
      "ja": "3.3.1.  URIスキーム"
    },
    {
      "indent": 3,
      "text": "Each Endpoint ID is expressed syntactically as a Uniform Resource Identifier (URI) [RFC3986]. The URI syntax has been designed as a way to express names or addresses for a wide range of purposes, and is therefore useful for constructing names for DTN endpoints.",
      "ja": "各エンドポイントIDは、ユニフォームリソース識別子（URI）[RFC3986]として構文的に表現されます。 URIの構文は、目的の広い範囲の名前またはアドレスを表現する方法として設計されており、DTNエンドポイントの名前を構築するために有用であるされています。"
    },
    {
      "indent": 3,
      "text": "In URI terminology, each URI begins with a scheme name. The scheme name is an element of the set of globally-managed scheme names maintained by IANA [ISCHEMES]. Lexically following the scheme name in a URI is a series of characters constrained by the syntax defined by the scheme. This portion of the URI is called the scheme-specific part (SSP), and can be quite general. (See, as one example, the URI scheme for SNMP [RFC4088]). Note that scheme-specific syntactical and semantic restrictions may be more constraining than the basic rules of RFC 3986. Section 3.1 of RFC 3986 provides guidance on the syntax of scheme names.",
      "ja": "URIの用語では、各URIはスキーム名で始まります。スキーム名は[ISCHEMES] IANAによって維持、グローバル管理のスキーム名の集合の要素です。字句スキームによって定義された構文によって制約一連の文字は、URIにスキーム名をされて、次の。 URIのこの部分は、スキーマ固有部分（SSP）と呼ばれ、非常に一般的であることができます。 （一例として、SNMPのURIスキーム[RFC4088]を参照）。そのスキーム特有の構文と意味上の制限は、RFC 3986のRFC 3986のセクション3.1スキーム名の構文上のガイダンスを提供する基本的なルールよりも制約することも注意してください。"
    },
    {
      "indent": 3,
      "text": "URI schemes are a key concept in the DTN architecture, and evolved from an earlier concept called regions, which were tied more closely to assumptions of the network topology. Using URIs, significant flexibility is attained in the structuring of EIDs. They might, for example, be constructed based on DNS names, or might look like",
      "ja": "URIスキームは、DTNアーキテクチャの重要な概念であり、ネットワークトポロジの仮定により密接に結びついた領域と呼ばれる以前の概念から進化しました。 URIを使用して、大幅な柔軟性がのEIDの構造で達成されます。これらは、例えば、DNS名に基づいて構築される可能性があります、またはのようになります。"
    },
    {
      "indent": 3,
      "text": "\"expressions of interest\" or forms of database-like queries as in a directed diffusion-routed network [IGE00] or in intentional naming [WSBL99]. As names, EIDs are not required to be related to routing or topological organization. Such a relationship is not prohibited, however, and in some environments using EIDs this way may be advantageous.",
      "ja": "「関心表明」または[IGE00]監督拡散ルーティングネットワーク内として、あるいは意図的な命名でのデータベースのようなクエリの形式[WSBL99]。名前通り、のEIDは、ルーティングまたはトポロジー的組織に関連する必要はありません。このような関係は、しかしながら、禁止されていない、とのEIDを使用して、いくつかの環境では、この方法は有利であり得ます。"
    },
    {
      "indent": 3,
      "text": "A single EID may refer to an endpoint containing more than one DTN node, as suggested above. It is the responsibility of a scheme designer to define how to interpret the SSP of an EID so as to determine whether it refers to a unicast, multicast, or anycast set of nodes. See Section 3.4 for more details.",
      "ja": "上記で示唆したように、単一のEIDは、複数のDTNノードを含むエンドポイントを指すことができます。ユニキャスト、マルチキャスト、またはノードのエニーキャストセットを指すかどうかを決定するようにEIDのSSPを解釈する方法を定義する方式設計者の責任です。詳細は、3.4節を参照してください。"
    },
    {
      "indent": 3,
      "text": "URIs are constructed based on rules specified in RFC 3986, using the US-ASCII character set. However, note this excerpt from RFC 3986, Section 1.2.1, on dealing with characters that cannot be represented by US-ASCII: \"Percent-encoded octets (Section 2.1) may be used within a URI to represent characters outside the range of the US-ASCII coded character set if this representation is allowed by the scheme or by the protocol element in which the URI is referenced. Such a definition should specify the character encoding used to map those characters to octets prior to being percent-encoded for the URI\".",
      "ja": "URIはUS-ASCII文字セットを使用して、RFC 3986で指定されたルールに基づいて構築されています。 「パーセントエンコードされたオクテット（2.1節）は範囲外の文字を表現するためにURI内で使用することができる。しかし、US-ASCIIで表現できない文字を扱うには、RFC 3986、セクション1.2.1からこの抜粋の点に注意してください。この表現は、スキームによって、またはURIが参照されているプロトコル要素によって許可されている場合。このような定義は、前URIのパーセントエンコードさオクテットにそれらの文字をマッピングするために使用される文字コードを指定する必要が設​​定US-ASCII符号化文字」。"
    },
    {
      "indent": 0,
      "text": "3.3.2. Late Binding",
      "section_title": true,
      "ja": "3.3.2. レイトバインディング"
    },
    {
      "indent": 3,
      "text": "Binding means interpreting the SSP of an EID for the purpose of carrying an associated message towards a destination. For example, binding might require mapping an EID to a next-hop EID or to a lower-layer address for transmission. \"Late binding\" means that the binding of a bundle's destination to a particular set of destination identifiers or addresses does not necessarily happen at the bundle source. Because the destination EID is potentially re-interpreted at each hop, the binding may occur at the source, during transit, or possibly at the destination(s). This contrasts with the name-to-address binding of Internet communications where a DNS lookup at the source fixes the IP address of the destination node before data is sent. Such a circumstance would be considered \"early binding\" because the name-to-address translation is performed prior to data being sent into the network.",
      "ja": "先に向けて関連するメッセージを運ぶためにEIDのSSPを解釈結合手段。例えば、結合は、ネクストホップEIDまたは送信のために下位層アドレスにEIDをマッピングする必要があります。 「レイトバインディングは、」宛先識別子またはアドレスの特定のセットへのバンドルの先の結合は必ずしもバンドル源で発生しないことを意味します。宛先EIDを潜在的に各ホップで再解釈されているので、結合がソースで、輸送中、または場合によって宛先（複数可）で行うことができます。これは、データが送信される前に、元のDNSルックアップは、宛先ノードのIPアドレスを固定し、インターネット通信の結合名前とアドレスとは対照的です。名前からアドレスへの変換を前にネットワークに送信されるデータに対して行われるので、このような状況は「早期バインディング」と考えられます。"
    },
    {
      "indent": 3,
      "text": "In a frequently-disconnected network, late binding may be advantageous because the transit time of a message may exceed the validity time of a binding, making binding at the source impossible or invalid. Furthermore, use of name-based routing with late binding may reduce the amount of administrative (mapping) information that must propagate through the network, and may also limit the scope of mapping synchronization requirements to a local topological neighborhood where changes are made.",
      "ja": "メッセージの通過時間が不可能または無効なソースに結合作り、結合の有効時間を超える可能性があるため、頻繁に切断されたネットワークでは、遅延バインディングは、有利であり得ます。また、遅延バインディングと名前ベースのルーティングを使用することは、ネットワークを介して伝搬しなければならない管理（マッピング）情報の量を減らすことができ、また、変更が行われたローカルトポロジー近傍にマッピング同期要件の範囲を制限することができます。"
    },
    {
      "indent": 0,
      "text": "3.4. Anycast and Multicast",
      "section_title": true,
      "ja": "3.4. エニーキャストとマルチキャスト"
    },
    {
      "indent": 3,
      "text": "As mentioned above, an EID may refer to an endpoint containing one or more DTN nodes. When referring to a group of size greater than one, the delivery semantics may be of either the anycast or multicast variety (broadcast is considered to be of the multicast variety). For anycast group delivery, a bundle is delivered to one node among a group of potentially many nodes, and for multicast delivery it is intended to be delivered to all of them, subject to the normal DTN class of service and maximum useful lifetime semantics.",
      "ja": "上述したように、EIDは、一つ以上のDTNノードを含むエンドポイントを指すことができます。 1よりも大きいサイズのグループに言及する場合、配信セマンティクスは、エニーキャスト又はマルチキャストさまざま（ブロードキャストマルチキャスト多様であると考えられる）のいずれかであってもよいです。エニーキャストグループの送達のために、バンドルは、潜在的に多数のノードのグループのうち、一つのノードに配信され、およびマルチキャスト配信のために、サービス及び最大有効寿命セマンティクスの正常DTNクラスの対象、それらの全てに配信されることが意図されます。"
    },
    {
      "indent": 3,
      "text": "Multicast group delivery in a DTN presents an unfamiliar issue with respect to group membership. In relatively low-delay networks, such as the Internet, nodes may be considered to be part of the group if they have expressed interest to join it \"recently\". In a DTN, however, nodes may wish to receive data sent to a group during an interval of time earlier than when they are actually able to receive it [ZAZ05]. More precisely, an application expresses its desire to receive data sent to EID e at time t. Prior to this, during the interval [t0, t1], t > t1, data may have been generated for group e. For the application to receive any of this data, the data must be available a potentially long time after senders have ceased sending to the group. Thus, the data may need to be stored within the network in order to support temporal group semantics of this kind. How to design and implement this remains a research issue, as it is likely to be at least as hard as problems related to reliable multicast.",
      "ja": "DTNにおけるマルチキャストグループの配信は、グループメンバーシップに関して不慣れな問題を提示しています。彼らは、「最近」に参加する関心を表明している場合は、インターネットのような比較的低遅延ネットワークにおいて、ノードは、グループの一部であると考えることができます。 DTNでは、しかし、ノードは、彼らが実際に[ZAZ05]を受信することが可能である場合よりも前の時間間隔中にグループに送信されたデータを受信することを望むかもしれません。より正確には、アプリケーションは、時刻tにおけるEID eに送信されたデータを受信するためにその願望を表現しています。これに先立って、区間[T0、T1]、T> t1の間、データは、グループEのために生成されていてもよいです。アプリケーションは、このデータのいずれかを受信するために、データは送信者がグループに送信し終わった後に、潜在的に長い時間利用可能でなければなりません。したがって、データは、この種の時間的グループセマンティクスをサポートするために、ネットワーク内に格納する必要があるかもしれません。どのように設計し、信頼性の高いマルチキャストに関連する問題と少なくとも同じハードである可能性が高いとして、これは、研究課題のまま実装します。"
    },
    {
      "indent": 0,
      "text": "3.5. Priority Classes",
      "section_title": true,
      "ja": "3.5. 優先度クラス"
    },
    {
      "indent": 3,
      "text": "The DTN architecture offers *relative* measures of priority (low, medium, high) for delivering ADUs. These priorities differentiate traffic based upon an application's desire to affect the delivery urgency for ADUs, and are carried in bundle blocks generated by the bundle layer based on information specified by the application.",
      "ja": "DTNアーキテクチャはのADUを提供するための優先順位の*相対*対策を（低、中、高）を提供しています。これらの優先順位は、のADUの配信緊急性に影響を与えるアプリケーションの要望に基づいてトラフィックを差別化し、アプリケーションによって指定された情報に基づいて、バンドル層によって生成された束のブロックに運ばれます。"
    },
    {
      "indent": 3,
      "text": "The (U.S. or similar) Postal Service provides a strong metaphor for the priority classes offered by the forwarding abstraction offered by the DTN architecture. Traffic is generally not interactive and is often one-way. There are generally no strong guarantees of timely delivery, yet there are some forms of class of service, reliability, and security.",
      "ja": "（米国または類似の）郵便サービスは、DTNアーキテクチャによって提供される転送抽象化が提供する優先クラスの強力なメタファーを提供します。トラフィックは、一般的に、インタラクティブではなく、多くの場合、一方通行です。タイムリーな配信の強い保証は一般的にありません、まだサービス、信頼性、およびセキュリティのクラスのいくつかの形態があります。"
    },
    {
      "indent": 3,
      "text": "We have defined three relative priority classes to date. These priority classes typically imply some relative scheduling prioritization among bundles in queue at a sender:",
      "ja": "我々はこれまでに3つの相対的な優先順位クラスを定義しています。これらの優先順位クラスは、一般的に、送信側では、キュー内のバンドルの中でいくつかの相対的なスケジューリング優先順位付けを意味します："
    },
    {
      "indent": 3,
      "text": "- Bulk - Bulk bundles are shipped on a \"least effort\" basis. No bundles of this class will be shipped until all bundles of other classes bound for the same destination and originating from the same source have been shipped.",
      "ja": " - バルク - バルクバンドルは「少なくとも努力」ベースで出荷されています。同じソースから同じ宛先と発信元のためにバインドされ、他のクラスのすべてのバンドルが出荷されるまで、このクラスのどのバンドルが同梱されません。"
    },
    {
      "indent": 3,
      "text": "- Normal - Normal-class bundles are shipped prior to any bulk-class bundles and are otherwise the same as bulk bundles.",
      "ja": " - 正常 - 正常クラス束は前の任意のバルククラスバンドルに出荷され、そうでなければ、バルクバンドルと同じであるれます。"
    },
    {
      "indent": 3,
      "text": "- Expedited - Expedited bundles, in general, are shipped prior to bundles of other classes and are otherwise the same.",
      "ja": " - 速め - 速め束は、一般的に、他のクラスのバンドルの前に出荷され、そうでなければ同一であるれます。"
    },
    {
      "indent": 3,
      "text": "Applications specify their requested priority class and data lifetime (see below) for each ADU they send. This information, coupled with policy applied at DTN nodes that select how messages are forwarded and which routing algorithms are in use, affects the overall likelihood and timeliness of ADU delivery.",
      "ja": "アプリケーションは、彼らが送る各ADUのために（下記参照）、その要求された優先度クラスとデータの有効期間を指定します。メッセージが転送されたルーティングアルゴリズムが使用されている方法を選択DTNノードに適用されるポリシーと結合され、この情報は、ADU送達の全体的な可能性と適時性に影響を与えます。"
    },
    {
      "indent": 3,
      "text": "The priority class of a bundle is only required to relate to other bundles from the same source. This means that a high priority bundle from one source may not be delivered faster (or with some other superior quality of service) than a medium priority bundle from a different source. It does mean that a high priority bundle from one source will be handled preferentially to a lower priority bundle sent from the same source.",
      "ja": "バンドルの優先度クラスは、同じソースから他のバンドルに関係することが要求されます。これは、1つのソースから優先度の高い束が速く（またはサービスの他のいくつかの優れた品質を有する）異なるソースからのメディア優先束より配信されないことを意味します。これは、1つのソースから優先度の高い束が同一のソースから送信された優先度の低いバンドルに優先的に処理されることを意味しません。"
    },
    {
      "indent": 3,
      "text": "Depending on a particular DTN node's forwarding/scheduling policy, priority may or may not be enforced across different sources. That is, in some DTN nodes, expedited bundles might always be sent prior to any bulk bundles, irrespective of source. Many variations are possible.",
      "ja": "特定のDTNノードの転送/スケジューリング・ポリシーに応じて、優先順位は、または異なるソースを横切って適用してもしなくてもよいです。それは、いくつかのDTNノードに、迅速なバンドルは常にかかわらず、ソースの、任意のバルクバンドルの前に送信される可能性がありますされています。多くの変形が可能です。"
    },
    {
      "indent": 0,
      "text": "3.6. Postal-Style Delivery Options and Administrative Records",
      "section_title": true,
      "ja": "3.6. 郵便スタイル配信オプションと管理レコード"
    },
    {
      "indent": 3,
      "text": "Continuing with the postal analogy, the DTN architecture supports several delivery options that may be selected by an application when it requests the transmission of an ADU. In addition, the architecture defines two types of administrative records: \"status reports\" and \"signals\". These records are bundles that provide information about the delivery of other bundles, and are used in conjunction with the delivery options.",
      "ja": "郵便アナロジーを続けると、DTNアーキテクチャは、それはADUの送信を要求したときに、アプリケーションによって選択することができ、いくつかの配信オプションをサポートしています。 「ステータスレポート」と「シグナル」：また、アーキテクチャは、行政記録の2種類が定義されています。これらのレコードは、他のバンドルの配信に関する情報を提供し、配信オプションと組み合わせて使用​​されているバンドルされています。"
    },
    {
      "indent": 0,
      "text": "3.6.1. Delivery Options",
      "section_title": true,
      "ja": "3.6.1. 配送オプション"
    },
    {
      "indent": 3,
      "text": "We have defined eight delivery options. Applications sending an ADU (the \"subject ADU\") may request any combination of the following, which are carried in each of the bundles produced (\"sent bundles\") by the bundle layer resulting from the application's request to send the subject ADU:",
      "ja": "私たちは、8つの配信オプションを定義しています。 ADU（「被写体ADU」）を送信するアプリケーションは、対象ADUを送信するアプリケーションの要求に起因するバンドル層によって生成されるバンドル（「送信バンドル」）のそれぞれにおいて実行される次のいずれかの組み合わせを要求することができます。"
    },
    {
      "indent": 3,
      "text": "- Custody Transfer Requested - requests sent bundles be delivered with enhanced reliability using custody transfer procedures. Sent bundles will be transmitted by the bundle layer using reliable transfer protocols (if available), and the responsibility for reliable delivery of the bundle to its destination(s) may move among one or more \"custodians\" in the network. This capability is described in more detail in Section 3.10.",
      "ja": " - 管理転送要求 - バンドルを送信された要求は、親権転送手順を使用して高い信頼性で配信されます。 （利用可能な場合）、送信されたバンドルは、信頼性の高い転送プロトコルを使用して、バンドル層によって送信され、その宛先（複数可）へ束の信頼できる配信の責任は、ネットワーク内の1つ以上の「カストディアン」の間で移動することができます。この機能は、3.10節でより詳細に記載されています。"
    },
    {
      "indent": 3,
      "text": "- Source Node Custody Acceptance Required - requires the source DTN node to provide custody transfer for the sent bundles. If custody transfer is not available at the source when this delivery option is requested, the requested transmission fails. This provides a means for applications to insist that the source DTN node take custody of the sent bundles (e.g., by storing them in persistent storage).",
      "ja": " - ソースノードカストディ受け入れ必須 - 送られたバンドルの管理転送を提供するために、ソースDTNノードが必要です。親権の転送は、この配信オプションが要求されたソースでは使用できない場合は、要求された送信が失敗します。これは、ソースDTNノードが（永続ストレージに格納することにより、例えば、）送信されたバンドルの保管を取ると主張するアプリケーションのための手段を提供します。"
    },
    {
      "indent": 3,
      "text": "- Report When Bundle Delivered - requests a (single) Bundle Delivery Status Report be generated when the subject ADU is delivered to its intended recipient(s). This request is also known as \"return-receipt\".",
      "ja": " - 対象ADUは、その意図された受信者に配信されている場合（シングル）バンドル配信ステータスレポートを生成することを要求 - バンドル配信レポート。この要求はまた、「リターン領収書」として知られています。"
    },
    {
      "indent": 3,
      "text": "- Report When Bundle Acknowledged by Application - requests an Acknowledgement Status Report be generated when the subject ADU is acknowledged by a receiving application. This only happens by action of the receiving application, and differs from the Bundle Delivery Status Report. It is intended for cases where the application may be acting as a form of application layer gateway and wishes to indicate the status of a protocol operation external to DTN back to the requesting source. See Section 11 for more details.",
      "ja": " - バンドルは、アプリケーションによってADIはレポート - 対象ADUは、受信側アプリケーションによって確認されたときに承認ステータスレポートが生成されることが要求されます。これは、受信側アプリケーションの作用によって起こり、およびバンドル配信ステータスレポートとは異なります。これは、アプリケーションは、アプリケーション層ゲートウェイの形態として作用し、バック要求元にDTN外部プロトコルの動作の状態を示すことを望むことができる場合のために意図されています。詳細については、セクション11を参照してください。"
    },
    {
      "indent": 3,
      "text": "- Report When Bundle Received - requests a Bundle Reception Status Report be generated when each sent bundle arrives at a DTN node. This is designed primarily for diagnostic purposes.",
      "ja": " - レポートバンドルは、受信 - 送信された各バンドルがDTNノードに到着したときバンドルレセプションステータスレポートが生成されることが要求されます。これは主に、診断目的のために設計されています。"
    },
    {
      "indent": 3,
      "text": "- Report When Bundle Custody Accepted - requests a Custody Acceptance Status Report be generated when each sent bundle has been accepted using custody transfer. This is designed primarily for diagnostic purposes.",
      "ja": " - レポートバンドルカストディが受け入れ - それぞれ送られたバンドルが親権転送を使用して受理されたとき、カストディ受け入れステータスレポートが生成されることが要求されます。これは主に、診断目的のために設計されています。"
    },
    {
      "indent": 3,
      "text": "- Report When Bundle Forwarded - requests a Bundle Forwarding Status Report be generated when each sent bundle departs a DTN node after forwarding. This is designed primarily for diagnostic purposes.",
      "ja": " - 各送信されたバンドルは、転送後にDTNノードを出発する際にバンドル転送ステータスレポートを生成することを要求 - バンドルが転送された報告書。これは主に、診断目的のために設計されています。"
    },
    {
      "indent": 3,
      "text": "- Report When Bundle Deleted - requests a Bundle Deletion Status Report be generated when each sent bundle is deleted at a DTN node. This is designed primarily for diagnostic purposes.",
      "ja": " - 各送信されたバンドルがDTNノードで削除されたときにバンドル削除ステータスレポートが生成されることを要求 - バンドル削除されたレポート。これは主に、診断目的のために設計されています。"
    },
    {
      "indent": 3,
      "text": "The first four delivery options are designed for ordinary use by applications. The last four are designed primarily for diagnostic purposes and their use may be restricted or limited in environments subject to congestion or attack.",
      "ja": "最初の4つの配信オプションは、アプリケーションによって、通常の使用のために設計されています。最後の4は、主に診断目的のために設計されており、それらの使用は制限されているか、輻輳や攻撃の対象に環境に制限することができます。"
    },
    {
      "indent": 3,
      "text": "If the security procedures defined in [DTNSEC] are also enabled, then three additional delivery options become available:",
      "ja": "[DTNSEC]で定義されたセキュリティ手順も有効になっている場合は、次の3つの追加の配信オプションが利用可能になります："
    },
    {
      "indent": 3,
      "text": "- Confidentiality Required - requires the subject ADU be made secret from parties other than the source and the members of the destination EID.",
      "ja": " - 機密性は必須では - 対象のADUは、送信元と送信先のEIDのメンバー以外の者から秘密にすることが必要です。"
    },
    {
      "indent": 3,
      "text": "- Authentication Required - requires all non-mutable fields in the bundle blocks of the sent bundles (i.e., those which do not change as the bundle is forwarded) be made strongly verifiable (i.e., cryptographically strong). This protects several fields, including the source and destination EIDs and the bundle's data. See Section 3.7 and [BSPEC] for more details.",
      "ja": " - 認証が必要ですが、 - 送られたバンドルのバンドル・ブロック内のすべての非可変フィールドを必要とする（すなわち、バンドルとして変更しないものが転送されます）（すなわち、暗号的に強い）強く検証作られます。これは、送信元と送信先のEIDと、バンドルのデータを含むいくつかのフィールドを、保護します。詳細はセクション3.7と[BSPEC]を参照してください。"
    },
    {
      "indent": 3,
      "text": "- Error Detection Required - requires modifications to the non-mutable fields of each sent bundle be made detectable with high probability at each destination.",
      "ja": " - エラー検出必須 - 各宛先に高い確率で検出可能にすることが、各送信バンドルの非可変フィールドへの変更を必要とします。"
    },
    {
      "indent": 0,
      "text": "3.6.2. Administrative Records: Bundle Status Reports and Custody Signals",
      "ja": "3.6.2. 行政レコード：バンドルステータスレポートやカストディ信号"
    },
    {
      "indent": 3,
      "text": "Administrative records are used to report status information or error conditions related to the bundle layer. There are two types of administrative records defined: bundle status reports (BSRs) and custody signals. Administrative records correspond (approximately) to messages in the ICMP protocol in IP [RFC792]. In ICMP, however, messages are returned to the source. In DTN, they are instead directed to the report-to EID for BSRs and the EID of the current custodian for custody signals, which might differ from the source's EID. Administrative records are sent as bundles with a source EID set to one of the EIDs associated with the DTN node generating the administrative record. In some cases, arrival of a single bundle or bundle fragment may elicit multiple administrative records (e.g., in the case where a bundle is replicated for multicast forwarding).",
      "ja": "管理レコードは、バンドル層に関連するステータス情報やエラー状況を報告するために使用されています。バンドルステータスレポート（BSRの）と親権信号：定義された管理レコードの2種類があります。管理レコードは、[RFC792] IPでICMPプロトコルのメッセージに（略）一致します。 ICMPには、しかし、メッセージは元に戻されます。 DTNでは、彼らは代わりにBSRのためのEIDのレポートおよびソースのEIDと異なる場合があり親権信号の現在の管理人のEIDに向けられています。管理レコードは、管理記録を生成DTNノードに関連付けられているのEIDのいずれかに設定ソースEIDとバンドルとして送信されます。いくつかの場合において、単一のバンドルの到着またはその断片をバンドル（例えば、バンドルがマルチキャスト転送のために複製される場合に）複数の管理レコードを誘発することができます。"
    },
    {
      "indent": 3,
      "text": "The following BSRs are currently defined (also see [BSPEC] for more details):",
      "ja": "以下のBSRは、現在（さらに詳しくは[BSPEC]参照）に定義されます："
    },
    {
      "indent": 3,
      "text": "- Bundle Reception - sent when a bundle arrives at a DTN node. Generation of this message may be limited by local policy.",
      "ja": " - バンドルレセプション - バンドルがDTNノードに到着したときに送信。このメッセージの生成は、ローカルポリシーによって制限され得ます。"
    },
    {
      "indent": 3,
      "text": "- Custody Acceptance - sent when a node has accepted custody of a bundle with the Custody Transfer Requested option set. Generation of this message may be limited by local policy.",
      "ja": " - カストディ受け入れ - ノードは、カストディ転送要求されたオプションが設定されたバンドルの親権を受け入れたときに送信されます。このメッセージの生成は、ローカルポリシーによって制限され得ます。"
    },
    {
      "indent": 3,
      "text": "- Bundle Forwarded - sent when a bundle containing a Report When Bundle Forwarded option departs from a DTN node after having been forwarded. Generation of this message may be limited by local policy.",
      "ja": " - バンドル転送された - 送られたバンドル転送されたオプションが転送された後にDTNノードから出発するとレポートを含むバンドル。このメッセージの生成は、ローカルポリシーによって制限され得ます。"
    },
    {
      "indent": 3,
      "text": "- Bundle Deletion - sent from a DTN node when a bundle containing a Report When Bundle Deleted option is discarded. This can happen for several reasons, such as expiration. Generation of this message may be limited by local policy but is required in cases where the deletion is performed by a bundle's current custodian.",
      "ja": " - バンドルの削除 - バンドル削除されたオプションが破棄されると、バンドルは、レポートを含むとき、DTNノードから送信されました。これは、有効期限など、いくつかの理由で発生する可能性があります。このメッセージの生成はローカルポリシーによって制限されるかもしれませんが、削除は、バンドルの現在の管理人によって行われる場合に必要とされます。"
    },
    {
      "indent": 3,
      "text": "- Bundle Delivery - sent from a final recipient's (destination) node when a complete ADU comprising sent bundles containing Report When Bundle Delivered options is consumed by an application.",
      "ja": " - 束排出 - バンドルオプションを送達された場合にレポートを含む送信されたバンドルを含む、完全なADUがアプリケーションによって消費されたときに、最終的な受信者（宛先）ノードから送られてきました。"
    },
    {
      "indent": 3,
      "text": "- Acknowledged by application - sent from a final recipient's (destination) node when a complete ADU comprising sent bundles containing Application Acknowledgment options has been processed by an application. This generally involves specific action on the receiving application's part.",
      "ja": "アプリケーション肯定応答オプションを含む送信されたバンドルを含む、完全なADUがアプリケーションによって処理された場合、最終的な受信者（宛先）ノードから送信された -   - アプリケーションによって認めました。これは、一般的に、受信アプリケーションの一部に特定のアクションを必要とします。"
    },
    {
      "indent": 3,
      "text": "In addition to the status reports, the custody signal is currently defined to indicate the status of a custody transfer. These are sent to the current-custodian EID contained in an arriving bundle:",
      "ja": "ステータスレポートに加えて、親権信号は、現在保管転送のステータスを示すために定義されています。これらは、到着したバンドルに含まれている現在、管理人のEIDに送信されます。"
    },
    {
      "indent": 3,
      "text": "- Custody Signal - indicates that custody has been successfully transferred. This signal appears as a Boolean indicator, and may therefore indicate either a successful or a failed custody transfer attempt.",
      "ja": " - カストディシグナル - 親権が正常に転送されたことを示します。この信号は、ブール指標として表示されますので、成功したか失敗した親権転送の試行のいずれかを示す場合があります。"
    },
    {
      "indent": 3,
      "text": "Administrative records must reference a received bundle. This is accomplished by a method for uniquely identifying bundles based on a transmission timestamp and sequence number discussed in Section 3.12.",
      "ja": "管理レコードが受信バンドルを参照する必要があります。これは一意3.12節で説明した送信タイムスタンプとシーケンス番号に基づいてバンドルを同定するための方法によって達成されます。"
    },
    {
      "indent": 0,
      "text": "3.7. Primary Bundle Fields",
      "section_title": true,
      "ja": "3.7. プライマリバンドルフィールド"
    },
    {
      "indent": 3,
      "text": "The bundles carried between and among DTN nodes obey a standard bundle protocol specified in [BSPEC]. Here we provide an overview of most of the fields carried with every bundle. The protocol is designed with a mandatory primary block, an optional payload block (which contains the ADU data itself), and a set of optional extension blocks. Blocks may be cascaded in a way similar to extension headers in IPv6. The following selected fields are all present in the primary block, and therefore are present for every bundle and fragment:",
      "ja": "DTNノード間との間で行わバンドルは[BSPEC]で指定された標準バンドルプロトコルに従います。ここでは、すべてのバンドルに運ばフィールドのほとんどの概要を説明します。プロトコルは必須の主要ブロック、（ADUデータ自体を含む）の任意のペイロード・ブロック、および任意の拡張ブロックのセットで設計されています。ブロックは、IPv6における拡張ヘッダと同様にカスケード接続することができます。次の選択されたフィールドは、すべての主要ブロックに存在するので、すべてのバンドルと断片のために存在しています。"
    },
    {
      "indent": 3,
      "text": "- Creation Timestamp - a concatenation of the bundle's creation time and a monotonically increasing sequence number such that the creation timestamp is guaranteed to be unique for each ADU originating from the same source. The creation timestamp is based on the time-of-day an application requested an ADU to be sent (not when the corresponding bundle(s) are sent into the network). DTN nodes are assumed to have a basic time synchronization capability (see Section 3.12).",
      "ja": " - 作成タイムスタンプ - バンドルの作成時刻の連結および作成タイムスタンプは同じ源に由来する各ADUに対して一意であることが保証されるように単調に増加するシーケンス番号。作成タイムスタンプは時刻アプリケーションが（対応バンドル（S）がネットワークに送信されていない場合）送信するADUの要求に基づいています。 DTNノードは、（3.12節を参照）基本的な時刻同期機能を有しているものとされています。"
    },
    {
      "indent": 3,
      "text": "- Lifespan - the time-of-day at which the message is no longer useful. If a bundle is stored in the network (including the source's DTN node) when its lifespan is reached, it may be discarded. The lifespan of a bundle is expressed as an offset relative to its creation time.",
      "ja": " - 寿命 - 時刻メッセージはもはや有用ですで。バンドルは（ソースのDTNノードを含む）ネットワークに格納されている場合、その寿命に達したとき、それは廃棄されてもよいです。バンドルの寿命は、その作成時に相対オフセットとして表現されます。"
    },
    {
      "indent": 3,
      "text": "- Class of Service Flags - indicates the delivery options and priority class for the bundle. Priority classes may be one of bulk, normal, or expedited. See Section 3.6.1.",
      "ja": " - サービスの旗のクラスは - バンドルの配信オプションと優先度クラスを示します。優先順位クラスは、バルク、通常、または優先のものであってもよいです。セクション3.6.1を参照してください。"
    },
    {
      "indent": 3,
      "text": "- Source EID - EID of the source (the first sender).",
      "ja": " - ソースEID  - ソースのEID（最初の送信者）。"
    },
    {
      "indent": 3,
      "text": "- Destination EID - EID of the destination (the final intended recipient(s)).",
      "ja": " - 宛先EID  - 先のEID（最終的な意図された受信者（単数または複数））。"
    },
    {
      "indent": 3,
      "text": "- Report-To Endpoint ID - an EID identifying where reports (return-receipt, route-tracing functions) should be sent. This may or may not identify the same endpoint as the Source EID.",
      "ja": " - レポートからエンドポイントID  - レポート（リターンレシート、経路トレース機能）が送信されるべきであるEID識別する。これは、あるいはソースEIDと同じエンドポイントを特定しない場合があります。"
    },
    {
      "indent": 3,
      "text": "- Custodian EID - EID of the current custodian of a bundle (if any).",
      "ja": " - カストディアンEID  - 束（もしあれば）の現在のカストディアンのEID。"
    },
    {
      "indent": 3,
      "text": "The payload block indicates information about the contained payload (e.g., its length) and the payload itself. In addition to the fields found in the primary and payload blocks, each bundle may have fields in additional blocks carried with each bundle. See [BSPEC] for additional details.",
      "ja": "ペイロードブロックは、含まれるペイロード（例えば、その長さ）とペイロード自体に関する情報を示しています。プライマリおよびペイロードブロックに見出されるフィールドに加えて、各バンドルは、各バンドルで実施追加ブロック内のフィールドを有していてもよいです。詳細については、[BSPEC]を参照してください。"
    },
    {
      "indent": 0,
      "text": "3.8. Routing and Forwarding",
      "section_title": true,
      "ja": "3.8. ルーティングおよびフォワーディング"
    },
    {
      "indent": 3,
      "text": "The DTN architecture provides a framework for routing and forwarding at the bundle layer for unicast, anycast, and multicast messages. Because nodes in a DTN network might be interconnected using more than one type of underlying network technology, a DTN network is best described abstractly using a *multigraph* (a graph where vertices may be interconnected with more than one edge). Edges in this graph are, in general, time-varying with respect to their delay and capacity and directional because of the possibility of one-way connectivity. When an edge has zero capacity, it is considered to not be connected.",
      "ja": "DTNアーキテクチャは、ユニキャスト、エニーキャスト、マルチキャストメッセージのバンドル層でルーティングおよび転送するためのフレームワークを提供します。 DTNネットワーク内のノードは、基礎となるネットワーク技術の複数のタイプを使用して相互接続されるかもしれないので、DTNネットワークは最良*のマルチグラフ×（頂点が複数のエッジと相互接続することができるグラフ）を用いて抽象的に記述されています。このグラフのエッジがあるため、一方向の接続の可能性を、それらの遅延と容量と方向に関して、一般的に、時間的に変化しています。エッジがゼロ容量を有する場合、接続されていないと考えられます。"
    },
    {
      "indent": 3,
      "text": "Because edges in a DTN graph may have significant delay, it is important to distinguish where time is measured when expressing an edge's capacity or delay. We adopt the convention of expressing capacity and delay as functions of time where time is measured at the point where data is inserted into a network edge. For example, consider an edge having capacity C(t) and delay D(t) at time t. If B bits are placed in this edge at time t, they completely arrive by time t + D(t) + (1/C(t))*B. We assume C(t) and D(t) do not change significantly during the interval [t, t+D(t)+(1/C(t))*B].",
      "ja": "DTNグラフのエッジは大きな遅延を有することができるので、時間が測定されるエッジの容量や遅延を表現する場合に区別することが重要です。我々は、時間データがネットワークエッジに挿入されている点で測定された時間の関数として容量及び遅延を発現する規則を採用します。例えば、時刻tにおけるエッジを有する容量C（t）と遅延D（t）を考えます。 Bビットが時刻tにおいて、このエッジに配置されている場合、それらは完全に時刻t + D（T）+（1 / C（T））* Bで到着します。我々は、C（t）及びD（t）は区間[T、T + D（T）+（1 / C（T））* B]中に著しく変化しないと仮定する。"
    },
    {
      "indent": 3,
      "text": "Because edges may vary between positive and zero capacity, it is possible to describe a period of time (interval) during which the capacity is strictly positive, and the delay and capacity can be considered to be constant [AF03]. This period of time is called a \"contact\". In addition, the product of the capacity and the interval is known as a contact's \"volume\". If contacts and their volumes are known ahead of time, intelligent routing and forwarding decisions can be made (optimally for small networks) [JFP04]. Optimally using a contact's volume, however, requires the ability to divide large ADUs and bundles into smaller routable units. This is provided by DTN fragmentation (see Section 3.9).",
      "ja": "エッジが正のゼロ容量の間で変化し得るので、容量が厳密に正である時間（インターバル）の期間を記述することができ、遅延および容量は[AF03]一定とみなすことができます。この期間は「接触」と呼ばれています。また、容量の積との間隔は、連絡先の「ボリューム」として知られています。連絡先とそのボリュームが事前に知られている場合は、インテリジェントなルーティングおよび転送の決定は、（最適小規模ネットワーク用）[JFP04]行うことができます。最適連絡先のボリュームを使用して、しかし、小さなルーティング可能な単位に大型のADUとバンドルを分割する能力を必要とします。これは、DTNの断片化によって提供される（3.9節を参照してください）。"
    },
    {
      "indent": 3,
      "text": "When delivery paths through a DTN graph are lossy or contact intervals and volumes are not known precisely ahead of time, routing computations become especially challenging. How to handle these situations is an active area of work in the (emerging) research area of delay tolerant networking.",
      "ja": "DTNグラフを介して配信経路が非可逆であるか、またはコンタクト間隔及びボリュームが正確に前もって知られていない場合、ルーティング計算は、特に挑戦的になります。これらの状況を処理する方法遅延耐性ネットワークの（新たな）研究領域における研究の活発な領域です。"
    },
    {
      "indent": 0,
      "text": "3.8.1. Types of Contacts",
      "section_title": true,
      "ja": "3.8.1. コンタクトの種類"
    },
    {
      "indent": 3,
      "text": "Contacts typically fall into one of several categories, based largely on the predictability of their performance characteristics and whether some action is required to bring them into existence. To date, the following major types of contacts have been defined:",
      "ja": "連絡先は通常、主に彼らのパフォーマンス特性の予測可能にし、いくつかのアクションが存在するようにそれらをもたらすために必要とされているかどうかに基づく、いくつかのカテゴリのいずれかに該当します。現在までに、連絡先の次の主要なタイプが定義されています。"
    },
    {
      "indent": 3,
      "text": "Persistent Contacts",
      "ja": "永続的なコンタクト"
    },
    {
      "indent": 6,
      "text": "Persistent contacts are always available (i.e., no connection-initiation action is required to instantiate a persistent contact). An 'always-on' Internet connection such as a DSL or Cable Modem connection would be a representative of this class.",
      "ja": "永続的な接点は、常に利用可能な（すなわち、何も接続開始アクションが永続的接触をインスタンス化するために必要とされない）です。 DSLやケーブルモデム接続などのインターネットの常時オン」の接続は、このクラスの代表になります。"
    },
    {
      "indent": 3,
      "text": "On-Demand Contacts",
      "ja": "オンデマンドコンタクト"
    },
    {
      "indent": 6,
      "text": "On-Demand contacts require some action in order to instantiate, but then function as persistent contacts until terminated. A dial-up connection is an example of an On-Demand contact (at least, from the viewpoint of the dialer; it may be viewed as an Opportunistic Contact, below, from the viewpoint of the dial-up service provider).",
      "ja": "オンデマンド連絡先はインスタンス化するために、何らかのアクションを必要とするが、その後、終了されるまで、永続的な接点を機能します。ダイヤルアップ接続は、オンデマンドコンタクトの一例である（ダイヤラの観点から、少なくとも、;それはダイヤルアップサービスプロバイダの観点から、以下、便宜的接触と見なすことができます）。"
    },
    {
      "indent": 3,
      "text": "Intermittent - Scheduled Contacts",
      "ja": "断続的 - スケジュールコンタクト"
    },
    {
      "indent": 6,
      "text": "A scheduled contact is an agreement to establish a contact at a particular time, for a particular duration. An example of a scheduled contact is a link with a low-earth orbiting satellite. A node's list of contacts with the satellite can be constructed from the satellite's schedule of view times, capacities, and latencies. Note that for networks with substantial delays, the notion of the \"particular time\" is delay-dependent. For example, a single scheduled contact between Earth and Mars would not be at the same instant in each location, but would instead be offset by the (non-negligible) propagation delay.",
      "ja": "スケジュールされた連絡先は、特定の期間に、特定の時間に接触を確立する契約です。スケジュールされた連絡先の例では、低地球軌道衛星とのリンクです。衛星との接触のノードのリストが表示時間、容量、およびレイテンシの衛星のスケジュールから構築することができます。大幅な遅延とネットワークのために、「特定の時間」の概念が遅延依存であることに注意してください。例えば、地球と火星の間の単一のスケジュールの接触は、各位置において同じ瞬間ではないが、その代わりに（無視できない）伝搬遅延によってオフセットされるであろう。"
    },
    {
      "indent": 3,
      "text": "Intermittent - Opportunistic Contacts",
      "ja": "断続的 - 日和見コンタクト"
    },
    {
      "indent": 6,
      "text": "Opportunistic contacts are not scheduled, but rather present themselves unexpectedly. For example, an unscheduled aircraft flying overhead and beaconing, advertising its availability for communication, would present an opportunistic contact. Another type of opportunistic contact might be via an infrared or Bluetooth communication link between a personal digital assistant (PDA) and a kiosk in an airport concourse. The opportunistic contact begins as the PDA is brought near the kiosk, lasting an undetermined amount of time (i.e., until the link is lost or terminated).",
      "ja": "日和見の連絡先は、スケジュールではなく、予期せずに自分自身を提示されていません。例えば、予定外の航空機が頭上飛行やビーコン、通信のためにその可用性を宣伝し、日和見接触を提示します。日和見接触のもう一つのタイプは、携帯情報端末（PDA）、空港のコンコース内売店の間に赤外線やBluetooth通信リンクを介してであるかもしれません。 （リンクが失われたり、終了するまで、すなわち）PDAは時間の不確定な量を持続し、キオスクの近くにもたらされるよう日和見接触が開始されます。"
    },
    {
      "indent": 3,
      "text": "Intermittent - Predicted Contacts",
      "ja": "断続的 - 予測コンタクト"
    },
    {
      "indent": 6,
      "text": "Predicted contacts are based on no fixed schedule, but rather are predictions of likely contact times and durations based on a history of previously observed contacts or some other information. Given a great enough confidence in a predicted contact, routes may be chosen based on this information. This is an active research area, and a few approaches having been proposed [LFC05].",
      "ja": "予測接点が固定されていないスケジュールに基づいているのではなく、以前に観察された連絡先の歴史や他のいくつかの情報に基づいて可能性の接触時間および期間の予測があります。予測接触に大きな自信を与え、ルートはこの情報に基づいて選択することができます。これは、活発な研究領域であり、いくつかのアプローチは[LFC05]提案されてきました。"
    },
    {
      "indent": 0,
      "text": "3.9. Fragmentation and Reassembly",
      "section_title": true,
      "ja": "3.9. フラグメンテーションおよび再構成"
    },
    {
      "indent": 3,
      "text": "DTN fragmentation and reassembly are designed to improve the efficiency of bundle transfers by ensuring that contact volumes are fully utilized and by avoiding retransmission of partially-forwarded bundles. There are two forms of DTN fragmentation/reassembly:",
      "ja": "DTN断片化と再アセンブリは、コンタクトボリュームが完全に利用されることを確実にすることによって、および部分的に転送バンドルの再送を回避することによって、バンドルの転送効率を向上させるために設計されています。 DTNの断片化/再構築の2つの形式があります。"
    },
    {
      "indent": 3,
      "text": "Proactive Fragmentation",
      "ja": "積極的なフラグメンテーション"
    },
    {
      "indent": 6,
      "text": "A DTN node may divide a block of application data into multiple smaller blocks and transmit each such block as an independent bundle. In this case, the *final destination(s)* are responsible for extracting the smaller blocks from incoming bundles and reassembling them into the original larger bundle and, ultimately, ADU. This approach is called proactive fragmentation because it is used primarily when contact volumes are known (or predicted) in advance.",
      "ja": "DTNノードは、複数の小さなブロックにアプリケーションデータのブロックを分割し、独立した束として、そのような各ブロックを送信することができます。この場合、*最終的な宛先（S）*着信バンドルから小さなブロックを抽出し、元の大きな束と、最終的には、ADUにそれらを再組み立てする責任があります。連絡先ボリュームが事前に知られている（または予測）されたとき、それは主に使用されているので、このアプローチは、積極的な断片化と呼ばれています。"
    },
    {
      "indent": 3,
      "text": "Reactive Fragmentation",
      "ja": "反応フラグメンテーション"
    },
    {
      "indent": 6,
      "text": "DTN nodes sharing an edge in the DTN graph may fragment a bundle cooperatively when a bundle is only partially transferred. In this case, the receiving bundle layer modifies the incoming bundle to indicate it is a fragment, and forwards it normally. The previous- hop sender may learn (via convergence-layer protocols, see Section 6) that only a portion of the bundle was delivered to the next hop, and send the remaining portion(s) when subsequent contacts become available (possibly to different next-hops if routing changes). This is called reactive fragmentation because the fragmentation process occurs after an attempted transmission has taken place.",
      "ja": "束が部分的にのみ転送される場合DTNグラフのエッジを共有するDTNノードが協働してバンドルを断片化することができます。この場合、受信バンドル層は、それが断片であることを示すために、着信バンドルを変更し、通常、それを転送します。 previous-ホップ送信者は、バンドルの一部のみが次のホップに配信されたこと（収束層プロトコルを介して、第6章を参照のこと）学び、その後の接触はおそらく異なる次の（利用可能になったとき、残りの部分（複数可）を送信してもよいです-hops）ルーティングが変更された場合。断片化プロセスが試みられ、送信が行われた後に発生するので、これは反応性の断片化と呼ばれています。"
    },
    {
      "indent": 6,
      "text": "As an example, consider a ground station G, and two store-and-forward satellites S1 and S2, in opposite low-earth orbit. While G is transmitting a large bundle to S1, a reliable transport layer protocol below the bundle layer at each indicates the transmission has terminated, but that half the transfer has completed successfully. In this case, G can form a smaller bundle fragment consisting of the second half of the original bundle and forward it to S2 when available. In addition, S1 (now out of range of G) can form a new bundle consisting of the first half of the original bundle and forward it to whatever next hop(s) it deems appropriate.",
      "ja": "一例として、逆の低地球軌道における地上局Gと、2つのストアアンドフォワード衛星S1とS2を考えます。 GがS1に大きなバンドルを送信している間、それぞれにバンドル層の下信頼性トランスポート層プロトコルは、送信が終了したが、その半分は、転送が正常に完了したことを示します。この場合、Gは、原稿束の後半からなる小さなバンドル断片を形成することができ、利用可能な場合S2にそれを転送します。それが適切と判断（複数可）に加えて、（今Gの範囲外）S1は、原稿束の最初の半分からなる新たな束を形成することができ、どのような次のホップに転送します。"
    },
    {
      "indent": 3,
      "text": "The reactive fragmentation capability is not required to be available in every DTN implementation, as it requires a certain level of support from underlying protocols that may not be present, and presents significant challenges with respect to handling digital signatures and authentication codes on messages. When a signed message is only partially received, most message authentication codes will fail. When DTN security is present and enabled, it may therefore be necessary to proactively fragment large bundles into smaller units that are more convenient for digital signatures.",
      "ja": "それは存在しないかもしれないプロトコルを根底からの支援の特定のレベルを必要とし、メッセージのデジタル署名および認証コードを処理に対して重要な課題を提示するように反応フラグメンテーション機能は、すべてのDTN実装で利用可能である必要はありません。署名されたメッセージは、部分的にしか受信されると、ほとんどのメッセージ認証コードが失敗します。 DTNセキュリティが存在し、有効にすると、したがって積極的デジタル署名のためのより便利でより小さな単位に大きなバンドルを断片化する必要があるかもしれません。"
    },
    {
      "indent": 3,
      "text": "Even if reactive fragmentation is not present in an implementation, the ability to reassemble fragments at a destination is required in order to support DTN fragmentation. Furthermore, for contacts with volumes that are small compared to typical bundle sizes, some incremental delivery approach must be used (e.g., checkpoint/restart) to prevent data delivery livelock. Reactive fragmentation is one such approach, but other protocol layers could potentially handle this issue as well.",
      "ja": "反応性断片化が実装に存在しない場合であっても、目的地にフラグメントを再構成する能力はDTN断片化をサポートするために必要とされます。さらに、一般的なバンドルサイズに比べて小さい容量との接触のために、いくつかのインクリメンタル送達アプローチは、データ配信ライブロックを防止するために（例えば、チェックポイント/リスタート）を使用しなければなりません。反応フラグメンテーションは、そのようなアプローチであるが、他のプロトコル層は、潜在的にも、この問題を扱うことができます。"
    },
    {
      "indent": 0,
      "text": "3.10. Reliability and Custody Transfer",
      "section_title": true,
      "ja": "3.10. 信頼性とカストディ転送"
    },
    {
      "indent": 3,
      "text": "The most basic service provided by the bundle layer is unacknowledged, prioritized (but not guaranteed) unicast message delivery. It also provides two options for enhancing delivery reliability: end-to-end acknowledgments and custody transfer. Applications wishing to implement their own end-to-end message reliability mechanisms are free to utilize the acknowledgment. The custody transfer feature of the DTN architecture only specifies a coarse-grained retransmission capability, described next.",
      "ja": "バンドル層によって提供される最も基本的なサービスは、ユニキャストメッセージ配信の優先順位付け、未確認（しかし保証されない）です。エンドツーエンドの承認および管理転送：それはまた、配信の信頼性を向上させるための2つのオプションが用意されています。自分のエンド・ツー・エンドのメッセージの信頼性メカニズムを実装したいアプリケーションは、確認応答を利用するのは自由です。 DTNアーキテクチャの親権転送機能は、次に説明する粒度の粗い再送機能を、指定します。"
    },
    {
      "indent": 3,
      "text": "Transmission of bundles with the Custody Transfer Requested option specified generally involves moving the responsibility for reliable delivery of an ADU's bundles among different DTN nodes in the network. For unicast delivery, this will typically involve moving bundles \"closer\" (in terms of some routing metric) to their ultimate destination(s), and retransmitting when necessary. The nodes receiving these bundles along the way (and agreeing to accept the reliable delivery responsibility) are called \"custodians\". The movement of a bundle (and its delivery responsibility) from one node to another is called a \"custody transfer\". It is analogous to a database commit transaction [FHM03]. The exact meaning and design of custody transfer for multicast and anycast delivery remains to be fully explored.",
      "ja": "一般的に、指定管理転送要求されたオプションとバンドルの送信は、ネットワーク内の異なるDTNノード間でADUのバンドルの信頼性の高い配信のための責任を動かす必要とします。ユニキャスト配信のために、これは、典型的には、その最終的な宛先（複数可）に「より近い」（いくつかのルーティング・メトリックの観点で）バンドルを移動し、必要なときに再送含むであろう。道に沿ってこれらのバンドルを受信（および信頼性の高い配信の責任を受け入れることに同意）のノードは、「カストディアン」と呼ばれています。バンドル（およびその送達責任）別のノードからの移動は、「管理輸送」と呼ばれます。 [FHM03]トランザクションをコミットデータベースに似ています。マルチキャストおよびエニーキャスト配信のための管理転送の正確な意味とデザインが完全に探求されないままです。"
    },
    {
      "indent": 3,
      "text": "Custody transfer allows the source to delegate retransmission responsibility and recover its retransmission-related resources relatively soon after sending a bundle (on the order of the minimum round-trip time to the first bundle hop(s)). Not all nodes in a DTN are required by the DTN architecture to accept custody transfers, so it is not a true 'hop-by-hop' mechanism. For example, some nodes may have sufficient storage resources to sometimes act as custodians, but may elect to not offer such services when congested or running low on power.",
      "ja": "カストディ転送は、ソースが（最初のバンドルのホップ（S）に、最小ラウンドトリップ時間のオーダー）バンドルを送信した後、比較的すぐに再送責任を委譲し、その再送信に関連したリソースを回復することができます。それが真の「ホップバイホップ」メカニズムではありませんので、DTNしていないすべてのノードは、親権転送を受け入れるようにDTNアーキテクチャによって必要とされています。例えば、いくつかのノードは、時々、カストディアンとして機能するのに十分なストレージリソースを持っているかもしれませんが、時に混雑したり、電源が不足している、そのようなサービスを提供しないことを選択することがあります。"
    },
    {
      "indent": 3,
      "text": "The existence of custodians can alter the way DTN routing is performed. In some circumstances, it may be beneficial to move a bundle to a custodian as quickly as possible even if the custodian is further away (in terms of distance, time or some routing metric) from the bundle's final destination(s) than some other reachable node. Designing a system with this capability involves constructing more than one routing graph, and is an area of continued research.",
      "ja": "カストディアンの存在はDTNルーティングが行われる方法を変えることができます。いくつかの状況では、カストディアンが遠く（距離、時間、またはいくつかのルーティングメトリックの点で）バンドルの最終的な宛先（複数可）から他のいくつかの到達よりであっても、可能な限り迅速にカストディアンにバンドルを移動することが有益であり得ますノード。この機能を使用してシステムを設計することは、複数のルーティング・グラフを構築することを含む、および継続的な研究の領域です。"
    },
    {
      "indent": 3,
      "text": "Custody transfer in DTN not only provides a method for tracking bundles that require special handling and identifying DTN nodes that participate in custody transfer, it also provides a (weak) mechanism for enhancing the reliability of message delivery. Generally speaking, custody transfer relies on underlying reliable delivery protocols of the networks that it operates over to provide the primary means of reliable transfer from one bundle node to the next (set). However, when custody transfer is requested, the bundle layer provides an additional coarse-grained timeout and retransmission mechanism and an accompanying (bundle-layer) custodian-to-custodian acknowledgment signaling mechanism. When an application does *not* request custody transfer, this bundle layer timeout and retransmission mechanism is typically not employed, and successful bundle layer delivery depends solely on the reliability mechanisms of the underlying protocols.",
      "ja": "DTNにおける管理輸送だけでなく、特別な処理を必要とバンドルを追跡し、管理輸送に関与DTNノードを同定するための方法を提供し、それはまた、メッセージ配信の信頼性を高めるため（弱）機構を提供します。一般的に言えば、管理輸送は、それが次の（セット）、1つのバンドルノードから信頼性の高い転送の主要な手段を提供することで動作ネットワークの基礎となる信頼できる配信プロトコルに依存しています。しかしながら、保管転送が要求された場合、バンドル層は、付加的な粗粒のタイムアウトおよび再送信機構および付随（バンドル層）カストディアン・ツー・カストディアン確認応答シグナリングメカニズムを提供します。アプリケーションは*ありません*リクエストの管理転送を行う場合は、このバンドル層のタイムアウトおよび再送信機構が一般的に用いられていない、と成功バンドル層の配信は、基礎となるプロトコルの信頼性メカニズムのみに依存しています。"
    },
    {
      "indent": 3,
      "text": "When a node accepts custody for a bundle that contains the Custody Transfer Requested option, a Custody Transfer Accepted Signal is sent by the bundle layer to the Current Custodian EID contained in the primary bundle block. In addition, the Current Custodian EID is updated to contain one of the forwarding node's (unicast) EIDs before the bundle is forwarded.",
      "ja": "ノードが管理転送要求されたオプションが含まれているバンドルの親権を受け付けると、信号受け入れカストディ転送が主バンドルブロックに含まれている現在のカストディアンEIDにバンドル層によって送信されます。また、現在のカストディアンEIDは、バンドルが転送される前に、転送ノードの（ユニキャスト）のEIDのいずれかを含むように更新されます。"
    },
    {
      "indent": 3,
      "text": "When an application requests an ADU to be delivered with custody transfer, the request is advisory. In some circumstances, a source of a bundle for which custody transfer has been requested may not be able to provide this service. In such circumstances, the subject bundle may traverse multiple DTN nodes before it obtains a custodian. Bundles in this condition are specially marked with their Current Custodian EID field set to a null endpoint. In cases where applications wish to require the source to take custody of the bundle, they may supply the Source Node Custody Acceptance Required delivery option. This may be useful to applications that desire a continuous \"chain\" of custody or that wish to exit after being ensured their data is safely held in a custodian.",
      "ja": "アプリケーションは、親権転送に配信するADUを要求すると、要求は顧問です。いくつかの状況では、親権転送が要求されたバンドルのソースは、このサービスを提供することができないかもしれません。それはカストディアンを取得する前に、このような状況では、対象バンドルは、複数のDTNノードを横断することができます。この条件でのバンドルは、特別にnullをエンドポイントに設定され、現在のカストディアンEIDフィールドでマークされています。アプリケーションがバンドルの親権を取るためにソースを要求したい場合には、彼らは、ソースノードカストディ受け入れに必要な配信オプションを供給することができます。これは、親権の連続「連鎖」または自分のデータを安全に管理人に保持されて確保された後に終了するには、その願いを望むアプリケーションに有用である可能性があります。"
    },
    {
      "indent": 3,
      "text": "In a DTN network where one or more custodian-to-custodian hops are strictly one directional (and cannot be reversed), the DTN custody transfer mechanism will be affected over such hops due to the lack of any way to receive a custody signal (or any other information) back across the path, resulting in the expiration of the bundle at the ingress to the one-way hop. This situation does not necessarily mean the bundle has been lost; nodes on the other side of the hop may continue to transfer custody, and the bundle may be delivered successfully to its destination(s). However, in this circumstance a source that has requested to receive expiration BSRs for this bundle will receive an expiration report for the bundle, and possibly conclude (incorrectly) that the bundle has been discarded and not delivered. Although this problem cannot be fully solved in this situation, a mechanism is provided to help ameliorate the seemingly incorrect information that may be reported when the bundle expires after having been transferred over a one-way hop. This is accomplished by the node at the ingress to the one-way hop reporting the existence of a known one-way path using a variant of a bundle status report. These types of reports are provided if the subject bundle requests the report using the 'Report When Bundle Forwarded' delivery option.",
      "ja": "一つ以上のカストディアン・ツー・カストディアンホップが厳密指向一つである（そして逆にすることができない）DTNネットワークにおいて、DTN管理輸送機構は、保管信号を受信するように何らかの方法がないためにそのようなホップにわたって影響を受けることになる（または一方向ホップへの入口におけるバンドルの満了をもたらすバックパスを横切る任意の他の情報）。この状況は、必ずしもバンドルが失われたという意味ではありません。ホップの反対側のノードは、親権を転送し続けることができる、とバンドルは、その宛先（複数可）に正常に配信されても​​よいです。バンドルが破棄されていない配信されたことを（誤って）しかし、この状況では、このバンドルの有効期限のBSRを受信するように要求したソースは、バンドルの有効期限レポートを受信する、そしておそらく結論します。この問題は完全にこのような状況では解決することはできませんが、メカニズムがバンドルは、一方向のホップを介して転送された後に期限切れになったときに報告することができる一見誤った情報を改善するために提供されます。これは、バンドル状態報告の変異体を用いた公知の一方向パスの存在を報告一方向ホップへの入口でのノードによって達成されます。対象バンドルが配信オプション「をバンドルが転送された場合は報告書」を使用してレポートを要求した場合、レポートのこれらのタイプは提供されています。"
    },
    {
      "indent": 0,
      "text": "3.11. DTN Support for Proxies and Application Layer Gateways",
      "section_title": true,
      "ja": "3.11. プロキシとアプリケーション層ゲートウェイのためのDTNサポート"
    },
    {
      "indent": 3,
      "text": "One of the aims of DTN is to provide a common method for interconnecting application layer gateways and proxies. In cases where existing Internet applications can be made to tolerate delays, local proxies can be constructed to benefit from the existing communication capabilities provided by DTN [S05, T02]. Making such proxies compatible with DTN reduces the burden on the proxy author from being concerned with how to implement routing and reliability management and allows existing TCP/IP-based applications to operate unmodified over a DTN-based network.",
      "ja": "DTNの目的の一つは、アプリケーション層ゲートウェイとプロキシを相互接続するための一般的な方法を提供することです。既存のインターネットアプリケーションは、遅延を許容させることができる場合には、ローカルプロキシはDTN [S05、T02]によって提供される既存の通信能力の恩恵を受けるように構成することができます。 DTNこのようなプロキシは互換作ることルーティングと信頼性管理を実装する方法に関係しているから、プロキシ作成者の負担を軽減し、既存のTCP / IPベースのアプリケーションがDTNベースのネットワークを介して修飾されていない動作することを可能にします。"
    },
    {
      "indent": 3,
      "text": "When DTN is used to provide a form of tunnel encapsulation for other protocols, it can be used in constructing overlay networks comprised of application layer gateways. The application acknowledgment capability is designed for such circumstances. This provides a common way for remote application layer gateways to signal the success or failure of non-DTN protocol operations initiated as a result of receiving DTN ADUs. Without this capability, such indicators would have to be implemented by applications themselves in non-standard ways.",
      "ja": "DTNは、他のプロトコルのトンネルカプセル化の形態を提供するために使用される場合には、アプリケーション層ゲートウェイから構成されるオーバーレイネットワークを構築する際に使用することができます。アプリケーションの確認機能は、このような事情のために設計されています。これは、リモートアプリケーション層ゲートウェイはDTNのADUを受信した結果として開始非DTNプロトコル操作の成功または失敗を通知するための共通の方法を提供します。この能力がなければ、そのような指標は、非標準的な方法でアプリケーション自体で実装しなければならないであろう。"
    },
    {
      "indent": 0,
      "text": "3.12. Timestamps and Time Synchronization",
      "section_title": true,
      "ja": "3.12. タイムスタンプと時刻同期"
    },
    {
      "indent": 3,
      "text": "The DTN architecture depends on time synchronization among DTN nodes (supported by external, non-DTN protocols) for four primary purposes: bundle and fragment identification, routing with scheduled or predicted contacts, bundle expiration time computations, and application registration expiration.",
      "ja": "バンドルおよび断片識別、予定または予測接点とルーティング、有効期限の計算をバンドルし、アプリケーション登録の有効期限：DTNアーキテクチャは、4つの主な目的のために（外部の、非DTNプロトコルでサポートされている）DTNノード間の時刻同期に依存します。"
    },
    {
      "indent": 3,
      "text": "Bundle identification and expiration are supported by placing a creation timestamp and an explicit expiration field (expressed in seconds after the source timestamp) in each bundle. The origination timestamps on arriving bundles are made available to consuming applications in ADUs they receive by some system interface function. Each set of bundles corresponding to an ADU is required to contain a timestamp unique to the sender's EID. The EID, timestamp, and data offset/length information together uniquely identify a bundle. Unique bundle identification is used for a number of purposes, including custody transfer and reassembly of bundle fragments.",
      "ja": "バンドル識別および有効期限は、各バンドル内（ソースタイムスタンプの秒で表される）の作成タイムスタンプと、明示的な有効期限フィールドを配置することによって支持されています。到着バンドル上の発信タイムスタンプは、彼らはいくつかのシステム・インターフェース機能により受信のADU内のアプリケーションを消費に利用できるようになります。 ADUに対応するバンドルの各セットは、送信者のEIDにユニークなタイムスタンプを含有することが要求されます。 EID、タイムスタンプ、およびデータオフセット/長さ情報は、一緒に一意バンドルを識別する。ユニークなバンドル識別がバンドル断片の保管転送や再構築など、目的の数、のために使用されています。"
    },
    {
      "indent": 3,
      "text": "Time is also used in conjunction with application registrations. When an application expresses its desire to receive ADUs destined for a particular EID, this registration is only maintained for a finite period of time, and may be specified by the application. For multicast registrations, an application may also specify a time range or \"interest interval\" for its registration. In this case, traffic sent to the specified EID any time during the specified interval will eventually be delivered to the application (unless such traffic has expired due to the expiration time provided by the application at the source or some other reason prevents such delivery).",
      "ja": "時間は、アプリケーションの登録と併せて使用されています。アプリケーションが特定のEID宛てのADUを受信するための欲求を表現するとき、この登録は、時間の有限の期間にわたって維持され、アプリケーションによって指定されてもよいです。マルチキャスト登録のために、アプリケーションは、その登録のための時間範囲または「利息期間」を指定することもできます。この場合、トラフィックが（例えばトラフィックが原因ソースまたはそのような送達を防止する何らかの理由でアプリケーションによって提供される有効期限に期限が切れていない場合）指定された間隔の間の任意の時間は、最終的にアプリケーションに配信される指定されたEIDに送られます。"
    },
    {
      "indent": 0,
      "text": "3.13. Congestion and Flow Control at the Bundle Layer",
      "section_title": true,
      "ja": "3.13. バンドル層で輻輳およびフロー制御"
    },
    {
      "indent": 3,
      "text": "The subject of congestion control and flow control at the bundle layer is one on which the authors of this document have not yet reached complete consensus. We have unresolved concerns about the efficiency and efficacy of congestion and flow control schemes implemented across long and/or highly variable delay environments, especially with the custody transfer mechanism that may require nodes to retain bundles for long periods of time.",
      "ja": "バンドル層での輻輳制御とフロー制御の対象は、この文書の著者は、まだ完全な合意に達していないその上で一つです。我々は、特に長期間の束を保持するノードを必要とし得る保管搬送機構と、長い及び/又は高度に可変遅延環境にわたって実施渋滞とフロー制御スキームの効率および有効性についての未解決の問題を有します。"
    },
    {
      "indent": 3,
      "text": "For the purposes of this document, we define \"flow control\" as a means of assuring that the average rate at which a sending node transmits data to a receiving node does not exceed the average rate at which the receiving node is prepared to receive data from that sender. (Note that this is a generalized notion of flow control, rather than one that applies only to end-to-end communication.) We define \"congestion control\" as a means of assuring that the aggregate rate at which all traffic sources inject data into a network does not exceed the maximum aggregate rate at which the network can deliver data to destination nodes over time. If flow control is propagated backward from congested nodes toward traffic sources, then the flow control mechanism can be used as at least a partial solution to the problem of congestion as well.",
      "ja": "本文書の目的のために、我々は、送信ノードが受信ノードにデータを送信する時の平均速度は、受信ノードからデータを受信する準備された平均レートを超えないことを保証する手段として、「フロー制御」を定義しますその送信者。 （これは一般的なフロー制御の概念ではなく、唯一のエンドツーエンドの通信を適用するものであることに留意されたい。）我々は、すべてのトラフィックソースがにデータを注入れる集約レートを確保する手段として、「輻輳制御」を定義しますネットワークは、ネットワークが経時宛先ノードにデータを配信することができる最大凝集率を超えません。フロー制御は、トラフィックソースに向かって輻輳ノードから後方に伝播される場合、フロー制御メカニズムは、同様に、輻輳の問題に少なくとも部分的な解決策として使用することができます。"
    },
    {
      "indent": 3,
      "text": "DTN flow control decisions must be made within the bundle layer itself based on information about resources (in this case, primarily persistent storage) available within the bundle node. When storage resources become scarce, a DTN node has only a certain degree of freedom in handling the situation. It can always discard bundles which have expired -- an activity DTN nodes should perform regularly in any case. If it ordinarily is willing to accept custody for bundles, it can cease doing so. If storage resources are available elsewhere in the network, it may be able to make use of them in some way for bundle storage. It can also discard bundles which have not expired but for which it has not accepted custody. A node must avoid discarding bundles for which it has accepted custody, and do so only as a last resort. Determining when a node should engage in or cease to engage in custody transfers is a resource allocation and scheduling problem of current research interest.",
      "ja": "DTNフロー制御の決定は、バンドルノード内で利用可能な（この場合は、主に永続的ストレージ）リソースに関する情報に基づいて、バンドル層自体の中で行われなければなりません。ストレージリソースが不足した場合、DTNノードは状況の取り扱いの自由だけである程度を持っています。 DTNノードがどのような場合には、定期的に実行する必要があるアクティビティを - それは常に期限が切れたバンドルを破棄することができます。それは通常のバンドルのための親権受け入れる意志があるならば、それはそうすることをやめることができます。ストレージリソースをネットワークの他の場所で利用可能な場合は、バンドルストレージのためのいくつかの方法でそれらを使用することができるかもしれません。また、有効期限が切れていないが、そのためにそれが親権を受け入れていないバンドルを破棄することができます。ノードは、それが親権を受け入れたためにバンドルを破棄回避し、最後の手段としてのみ行う必要があります。ノードが従事するまたは親権移転に従事するのをやめるべき時を決定することは、現在の研究関心の資源配分とスケジューリングの問題です。"
    },
    {
      "indent": 3,
      "text": "In addition to the bundle layer mechanisms described above, a DTN node may be able to avail itself of support from lower-layer protocols in affecting its own resource utilization. For example, a DTN node receiving a bundle using TCP/IP might intentionally slow down its receiving rate by performing read operations less frequently in order to reduce its offered load. This is possible because TCP provides its own flow control, so reducing the application data consumption rate could effectively implement a form of hop-by-hop flow control. Unfortunately, it may also lead to head-of-line blocking issues, depending on the nature of bundle multiplexing within a TCP connection. A protocol with more relaxed ordering constraints (e.g. SCTP [RFC2960]) might be preferable in such circumstances.",
      "ja": "上記バンドル層メカニズムに加えて、DTNノードは、自身のリソース利用率に影響を与えるで下位層プロトコルから支持体自体が役に立つことができるかもしれません。例えば、TCPを使用してバンドルを受信DTNノードは/ IPは、意図的にその提供された負荷を低減するために、より少ない頻度で読み出し動作を行うことにより、その受信速度を遅くする可能性があります。 TCPはとても効果的にホップバイホップフロー制御の形態を実装することができ、アプリケーションデータ消費率を低下させる、独自のフロー制御を提供するので、これは可能です。残念ながら、それはまた、TCP接続内のバンドルの多重化の性質に応じて、ヘッドオブラインブロッキングの問題につながる可能性があります。よりリラックスオーダリング制約のあるプロトコル（例えばSCTP [RFC2960]）は、このような状況では好ましいかもしれません。"
    },
    {
      "indent": 3,
      "text": "Congestion control is an ongoing research topic.",
      "ja": "輻輳制御は、現在進行中の研究テーマです。"
    },
    {
      "indent": 0,
      "text": "3.14. Security",
      "section_title": true,
      "ja": "3.14. セキュリティ"
    },
    {
      "indent": 3,
      "text": "The possibility of severe resource scarcity in some delay-tolerant networks dictates that some form of authentication and access control to the network itself is required in many circumstances. It is not acceptable for an unauthorized user to flood the network with traffic easily, possibly denying service to authorized users. In many cases it is also not acceptable for unauthorized traffic to be forwarded over certain network links at all. This is especially true for exotic, mission-critical links. In light of these considerations, several goals are established for the security component of the DTN architecture:",
      "ja": "いくつかの遅延トレラントネットワークにおける厳しい資源不足の可能性は、ネットワーク自体に認証およびアクセス制御のいくつかのフォームは、多くの状況において必要とされることを指示します。不正なユーザはおそらく許可されたユーザへのサービス拒否攻撃、簡単にトラフィックでネットワークをあふれさせることは許されません。不正なトラフィックがすべてで、特定のネットワークリンク上で転送されるために多くの場合、それはまた、許容可能ではありません。これは、エキゾチックな、ミッションクリティカルなリンクについては特にそうです。これらの点を考慮して、いくつかの目標がDTNアーキテクチャのセキュリティコンポーネントのために確立されています。"
    },
    {
      "indent": 3,
      "text": "- Promptly prevent unauthorized applications from having their data carried through or stored in the DTN.",
      "ja": " - 速やかにデータを通って運ばまたはDTNに格納されていることから、不正なアプリケーションを防ぎます。"
    },
    {
      "indent": 3,
      "text": "- Prevent unauthorized applications from asserting control over the DTN infrastructure.",
      "ja": " -  DTNインフラストラクチャの管理を主張するから、不正なアプリケーションを防止します。"
    },
    {
      "indent": 3,
      "text": "- Prevent otherwise authorized applications from sending bundles at a rate or class of service for which they lack permission.",
      "ja": " - 彼らは許可を欠くためにレートまたはサービスのクラスでバンドルを送信するからそうでない場合は許可されたアプリケーションを防止します。"
    },
    {
      "indent": 3,
      "text": "- Promptly discard bundles that are damaged or improperly modified in transit.",
      "ja": " - 速やか破損または不正に中に変更されているバンドルを捨てます。"
    },
    {
      "indent": 3,
      "text": "- Promptly detect and de-authorize compromised entities.",
      "ja": " - 妥協の実体を速やかに検出し、デオーソライズ。"
    },
    {
      "indent": 3,
      "text": "Many existing authentication and access control protocols designed for operation in low-delay, connected environments may not perform well in DTNs. In particular, updating access control lists and revoking (\"blacklisting\") credentials may be especially difficult. Also, approaches that require frequent access to centralized servers to complete an authentication or authorization transaction are not attractive. The consequences of these difficulties include delays in the onset of communication, delays in detecting and recovering from system compromise, and delays in completing transactions due to inappropriate access control or authentication settings.",
      "ja": "低遅延、接続された環境で動作するように設計され、多くの既存の認証とアクセス制御プロトコルはDTNsではうまく動作しない場合があります。具体的には、アクセス制御リストを更新し、（「ブラックリスト」）資格証明書を失効することは特に難しいかもしれません。また、認証または認可トランザクションを完了するために、中央サーバへの頻繁なアクセスを必要とするアプローチは魅力的ではありません。これらの困難の結果は、通信の発症の遅延、システムが侵害からの検出と回復の遅れ、不適切なアクセス制御や認証の設定に起因する取引を完了するの遅れがあります。"
    },
    {
      "indent": 3,
      "text": "To help satisfy these security requirements in light of the challenges, the DTN architecture adopts a standard but optionally deployed security architecture [DTNSEC] that utilizes hop-by-hop and end-to-end authentication and integrity mechanisms. The purpose of using both approaches is to be able to handle access control for data forwarding and storage separately from application-layer data integrity. While the end-to-end mechanism provides authentication for a principal such as a user (of which there may be many), the hop-by-hop mechanism is intended to authenticate DTN nodes as legitimate transceivers of bundles to each-other. Note that it is conceivable to construct a DTN in which only a subset of the nodes participate in the security mechanisms, resulting in a secure DTN overlay existing atop an insecure DTN overlay. This idea is relatively new and is still being explored.",
      "ja": "課題の光の中でこれらのセキュリティ要件を満たす支援するために、DTNアーキテクチャは、標準を採用していますが、必要に応じて展開されたセキュリティアーキテクチャ[DTNSEC]ホップバイホップとエンドツーエンドの認証と完全性メカニズムを利用しています。両方のアプローチを使用する目的は、アプリケーション層のデータの整合性とは別に、データ転送および記憶装置に対するアクセス制御を扱うことができることです。エンド・ツー・エンド機構は、ユーザ（その多くが存在してもよい）としてプリンシパルの認証を提供するが、ホップバイホップ機構はそれぞれ、他のバンドルの正当トランシーバとしてDTNノードを認証することを意図しています。ノードのサブセットのみが、安全でないDTNオーバレイの上に既存のセキュアDTNオーバーレイをもたらす、セキュリティ・メカニズムに参加するDTNを構築することが考えられることに留意されたいです。このアイデアは、比較的新しく、まだ検討されています。"
    },
    {
      "indent": 3,
      "text": "In accordance with the goals listed above, DTN nodes discard traffic as early as possible if authentication or access control checks fail. This approach meets the goals of removing unwanted traffic from being forwarded over specific high-value links, but also has the associated benefit of making denial-of-service attacks considerably harder to mount more generally, as compared with conventional Internet routers. However, the obvious cost for this capability is potentially larger computation and credential storage overhead required at DTN nodes.",
      "ja": "上記の目的に応じて、DTNノードは、できるだけ早期に認証やアクセス制御チェックが失敗した場合、トラフィックを破棄します。このアプローチは、特定の付加価値の高いリンク上で転送されることから、不要なトラフィックを除去する目標を達成するだけでなく、従来のインターネットルータと比較して、より一般的にマウントするサービス拒否攻撃はかなり難しくなっての関連する利点を持っています。しかしながら、この機能のための明白なコストがDTNノードで必要と潜在的により大きな計算及び認証情報ストレージのオーバーヘッドがあります。"
    },
    {
      "indent": 3,
      "text": "For more detailed information on DTN security provisions, refer to [DTNSEC] and [DTNSOV].",
      "ja": "DTNセキュリティ規定の詳細については、[DTNSOV] [DTNSEC]を参照して。"
    },
    {
      "indent": 0,
      "text": "4. State Management Considerations",
      "section_title": true,
      "ja": "4.状態管理の考慮事項"
    },
    {
      "indent": 3,
      "text": "An important aspect of any networking architecture is its management of state. This section describes the state managed at the bundle layer and discusses how it is established and removed.",
      "ja": "任意のネットワークアーキテクチャの重要な側面は、国家の経営です。このセクションでは、バンドル層で管理された状態を説明し、それが確立して除去する方法について説明します。"
    },
    {
      "indent": 0,
      "text": "4.1. Application Registration State",
      "section_title": true,
      "ja": "4.1. アプリケーション登録状態"
    },
    {
      "indent": 3,
      "text": "In long/variable delay environments, an asynchronous application interface seems most appropriate. Such interfaces typically include methods for applications to register callback actions when certain triggering events occur (e.g., when ADUs arrive). These registrations create state information called application registration state.",
      "ja": "長い/可変遅延環境では、非同期アプリケーションインタフェースは、最も適切と思われます。そのようなインターフェースは、典型的には、特定のトリガイベントが発生したときにアプリケーションがコールバック・アクションを登録するための方法（例えば、のADUが到着したとき）が挙げられます。これらの登録は、アプリケーションの登録状態と呼ばれる状態情報を作成します。"
    },
    {
      "indent": 3,
      "text": "Application registration state is typically created by explicit request of the application, and is removed by a separate explicit request, but may also be removed by an application-specified timer (it is thus \"firm\" state). In most cases, there must be a provision for retaining this state across application and operating system termination/restart conditions because a client/server bundle round-trip time may exceed the requesting application's execution time (or hosting system's uptime). In cases where applications are not automatically restarted but application registration state remains persistent, a method must be provided to indicate to the system what action to perform when the triggering event occurs (e.g., restarting some application, ignoring the event, etc.).",
      "ja": "アプリケーション登録状態は、典型的には、アプリケーションの明示的な要求によって作成され、別の明示的な要求により除去されるだけでなく、アプリケーションが指定したタイマーによって除去することができる（従って、ある「強固な」状態）。ほとんどの場合、クライアント/サーバー・バンドルラウンドトリップ時間が要求しているアプリケーションの実行時間を超える可能性があるため、アプリケーションとオペレーティングシステムの停止/再始動条件間で、この状態を維持する（またはシステムの稼働時間をホスティング）引当金がなければなりません。アプリケーションは自動的に再起動が、アプリケーションの登録状態が永続ままされていない場合には、方法は、トリガイベントが発生したときに実行する処理をシステムに知らせるために提供されなければならない（例えば、など、イベントを無視して、いくつかのアプリケーションを再起動します）。"
    },
    {
      "indent": 3,
      "text": "To initiate a registration and thereby establish application registration state, an application specifies an Endpoint ID for which it wishes to receive ADUs, along with an optional time value indicating how long the registration should remain active. This operation is somewhat analogous to the bind() operation in the common sockets API.",
      "ja": "登録を開始することにより、アプリケーション登録状態を確立するために、アプリケーションは、登録がアクティブなままでなければならない時間の長さを示す任意の時間値と共に、のADUを受信することを望むのエンドポイントIDを指定します。この操作は、一般的なソケットAPIにバインド（）オペレーションに幾分類似しています。"
    },
    {
      "indent": 3,
      "text": "For registrations to groups (i.e., joins), a time interval may also be specified. The time interval refers to the range of origination times of ADUs sent to the specified EID. See Section 3.4 above for more details.",
      "ja": "グループ（すなわち、参加）に登録するために、時間間隔を指定することもできます。時間間隔は、指定されたEIDに送らのADUの発信時刻の範囲を指します。詳細は、上記の3.4節を参照してください。"
    },
    {
      "indent": 0,
      "text": "4.2. Custody Transfer State",
      "section_title": true,
      "ja": "4.2. 親権転送状態"
    },
    {
      "indent": 3,
      "text": "Custody transfer state includes information required to keep account of bundles for which a node has taken custody, as well as the protocol state related to transferring custody for one or more of them. The accounting-related state is created when a bundle is received. Custody transfer retransmission state is created when a transfer of custody is initiated by forwarding a bundle with the custody transfer requested delivery option specified. Retransmission state and accounting state may be released upon receipt of one or more Custody Transfer Succeeded signals, indicating custody has been moved. In addition, the bundle's expiration time (possibly mitigated by local policy) provides an upper bound on the time when this state is purged from the system in the event that it is not purged explicitly due to receipt of a signal.",
      "ja": "保管転送状態は、それらの1つ以上のための保管の転送に関連するノードが親権を取っているためバンドルのアカウントを維持するために必要な情報、ならびにプロトコル状態を含みます。バンドルを受信したときに、会計関連の状態が作成されます。親権の転送が指定管理転送要求された配信オプションでバンドルを転送することによって開始されたときに親権転送再送状態が作成されます。再送状態と会計状態が親権が移動されたことを示す、一つ以上の管理転送成功信号を受信したときに放出されてもよいです。加えて、（おそらくローカルポリシーによって緩和）バンドルの有効期限は、この状態は、それが起因する信号の受信に明示的にパージされない場合にシステムからパージされる時間の上限を提供します。"
    },
    {
      "indent": 0,
      "text": "4.3. Bundle Routing and Forwarding State",
      "section_title": true,
      "ja": "4.3. バンドルルーティングおよびフォワーディングステート"
    },
    {
      "indent": 3,
      "text": "As with the Internet architecture, we distinguish between routing and forwarding. Routing refers to the execution of a (possibly distributed) algorithm for computing routing paths according to some objective function (see [JFP04], for example). Forwarding refers to the act of moving a bundle from one DTN node to another. Routing makes use of routing state (the RIB, or routing information base), while forwarding makes use of state derived from routing, and is maintained as forwarding state (the FIB, or forwarding information base). The structure of the FIB and the rules for maintaining it are implementation choices. In some DTNs, exchange of information used to update state in the RIB may take place on network paths distinct from those where exchange of application data takes place.",
      "ja": "インターネットアーキテクチャと同じように、私たちは、ルーティングおよび転送を区別します。ルーティングは、いくつかの目的関数に従ってルーティング経路を計算するための（おそらく分散）アルゴリズム（例えば、[JFP04]参照）の実行を指します。転送は、別のDTNノードからバンドルを移動させる行為を指します。転送はルーティングに由来する状態を利用して、フォワーディング状態（FIB、または転送情報ベース）として維持されている間ルーティングは、状態（RIB、またはルーティング情報ベース）ルーティングを使用します。 FIBの構造と、それを維持するための規則は、実装の選択です。一部DTNsでは、RIBの状態を更新するために使用される情報の交換は、アプリケーションデータの交換が行われる場合、それらは異なるネットワーク経路上で行うことができます。"
    },
    {
      "indent": 3,
      "text": "The maintenance of state in the RIB is dependent on the type of routing algorithm being used. A routing algorithm may consider requested class of service and the location of potential custodians (for custody transfer, see section 3.10), and this information will tend to increase the size of the RIB. The separation between FIB and RIB is not required by this document, as these are implementation details to be decided by system implementers. The choice of routing algorithms is still under study.",
      "ja": "RIBにおける状態の維持は、使用されているルーティングアルゴリズムのタイプに依存しています。ルーティングアルゴリズムは、（管理転送のために、セクション3.10を参照）サービスおよび潜在的なカストディアンの場所のクラスを要求し検討すること、およびこの情報はRIBのサイズを大きくする傾向があります。これらの実装の詳細は、システムの実装によって決定されるようにFIBとリブとの間の分離は、このドキュメントによって必要とされません。ルーティングアルゴリズムの選択はまだ検討中です。"
    },
    {
      "indent": 3,
      "text": "Bundles may occupy queues in nodes for a considerable amount of time. For unicast or anycast delivery, the amount of time is likely to be the interval between when a bundle arrives at a node and when it can be forwarded to its next hop. For multicast delivery of bundles, this could be significantly longer, up to a bundle's expiration time. This situation occurs when multicast delivery is utilized in such a way that nodes joining a group can obtain information previously sent to the group. In such cases, some nodes may act as \"archivers\" that provide copies of bundles to new participants that have already been delivered to other participants.",
      "ja": "バンドルには、かなりの時間のために、ノードのキューを占有することができます。ユニキャストまたはエニーキャスト配信のために、時間の量は、その次のホップに転送することができるときにバンドルがノードに到着したときとの間の間隔である可能性が高いです。バンドルのマルチキャスト配信のために、これはアップバンドルの有効期限を、大幅に長くすることができます。マルチキャスト配信が以前のグループに送信された情報を得ることができるグループに参加するノードように利用される場合、このような状況が発生します。このような場合には、いくつかのノードは、既に他の参加者に配信された新しい参加者にバンドルのコピーを提供し、「アーカイバ」として作用することができます。"
    },
    {
      "indent": 0,
      "text": "4.4. Security-Related State",
      "section_title": true,
      "ja": "4.4. セキュリティ関連の状態"
    },
    {
      "indent": 3,
      "text": "The DTN security approach described in [DTNSEC], when used, requires maintenance of state in all DTN nodes that use it. All such nodes are required to store their own private information (including their own policy and authentication material) and a block of information used to verify credentials. Furthermore, in most cases, DTN nodes will cache some public information (and possibly the credentials) of their next-hop (bundle) neighbors. All cached information has expiration times, and nodes are responsible for acquiring and distributing updates of public information and credentials prior to the expiration of the old set (in order to avoid a disruption in network service).",
      "ja": "【DTNSEC]で説明DTNセキュリティアプローチは、使用される場合、それを使用するすべてのDTNノードにおける状態の維持を必要とします。すべてのそのようなノードは、自分のプライベート（自分のポリシーと認証材料を含む）の情報と資格情報を確認するために使用される情報のブロックを格納するのに必要とされます。さらに、ほとんどの場合、DTNノードはその次のホップ（バンドル）隣人のいくつかの公開情報（そしておそらく資格情報）をキャッシュします。すべてのキャッシュされた情報は有効期限があり、ノードが（ネットワークサービスの中断を避けるために）を取得し、公開情報と古いセットの満了前に資格証明書の更新を配布する責任があります。"
    },
    {
      "indent": 3,
      "text": "In addition to basic end-to-end and hop-by-hop authentication, access control may be used in a DTN by one or more mechanisms such as capabilities or access control lists (ACLs). ACLs would represent another block of state present in any node that wishes to enforce security policy. ACLs are typically initialized at node configuration time and may be updated dynamically by DTN bundles or by some out of band technique. Capabilities or credentials may be revoked, requiring the maintenance of a revocation list (\"black list\", another form of state) to check for invalid authentication material that has already been distributed.",
      "ja": "基本的なエンド・エンドへとホップバイホップ認証に加えて、アクセス制御は、機能やアクセス制御リスト（ACL）などの1つまたは複数のメカニズムによってDTNに使用することができます。 ACLは、セキュリティポリシーを適用することを望む任意のノードに存在する状態の別のブロックを表すことになります。 ACLは、典型的には、ノード構成時に初期化され、DTNバンドルによって、またはバンド技術のいくつかの実施によって動的に更新されてもよいです。能力または資格情報が既に配布された無効な認証マテリアルをチェックする失効リスト（「ブラックリスト」、状態の別の形）のメンテナンスを必要とする、取り消すことができます。"
    },
    {
      "indent": 3,
      "text": "Some DTNs may implement security boundaries enforced by selected nodes in the network, where end-to-end credentials may be checked in addition to checking the hop-by-hop credentials. (Doing so may require routing to be adjusted to ensure all bundles comprising each ADU pass through these points.) Public information used to verify end-to-end authentication will typically be cached at these points.",
      "ja": "いくつかのDTNsは、エンドツーエンドの資格情報がホップバイホップの資格情報をチェックする以外に確認することができるネットワーク、で選択したノードによって強制セキュリティ境界を実装することができます。 （そうする各ADUを含むすべてのバンドルは、これらの点を通る保証するように調整されるルーティングを必要とするかもしれない。）エンド・ツー・エンドの認証を検証するために使用される公開情報は、典型的には、これらの点でキャッシュされるであろう。"
    },
    {
      "indent": 0,
      "text": "4.5. Policy and Configuration State",
      "section_title": true,
      "ja": "4.5. ポリシーと設定の状態"
    },
    {
      "indent": 3,
      "text": "DTN nodes will contain some amount of configuration and policy information. Such information may alter the behavior of bundle forwarding. Examples of policy state include the types of cryptographic algorithms and access control procedures to use if DTN security is employed, whether nodes may become custodians, what types of convergence layer (see Section 6) and routing protocols are in use, how bundles of differing priorities should be scheduled, where and for how long bundles and other data is stored, what status reports may be generated or at what rate, etc.",
      "ja": "DTNノードは、設定とポリシー情報の一部量を含んでいます。そのような情報は、バンドルの転送の動作を変更することができます。ポリシーの状態の例は、DTNセキュリティが使用される場合、ノードは、カストディアンになることができるかどうか、使用する暗号アルゴリズムとアクセス制御手順のタイプを含む、収束層の種類（セクション6を参照）、ルーティングプロトコルは、どのように、使用中に異なる優先度の束でありますそしてどのくらいのバンドルおよびその他のデータが格納されているため、どのような状況レポートを生成することができるか、どのような割合で、などの場合には、スケジュールする必要があります"
    },
    {
      "indent": 0,
      "text": "5. Application Structuring Issues",
      "section_title": true,
      "ja": "5.アプリケーション構造化の問題"
    },
    {
      "indent": 3,
      "text": "DTN bundle delivery is intended to operate in a delay-tolerant fashion over a broad range of network types. This does not mean there *must* be large delays in the network; it means there *may* be very significant delays (including extended periods of disconnection between sender and intended recipient(s)). The DTN protocols are delay tolerant, so applications using them must also be delay tolerant in order to operate effectively in environments subject to significant delay or disruption.",
      "ja": "DTNバンドル配信は、ネットワークタイプの広い範囲にわたって遅延トレラント方式で動作するように意図されています。これは必見*ネットワークで大きな遅延も*が意味するものではありません。それはそこに意味*かもしれない*（送信者と意図された受信者間の断線の延長期間を含む）することは非常に重大な遅延。 DTNプロトコルは遅延寛容であるので、それらを使用するアプリケーションはまた、大幅な遅延や中断の対象環境で効率的に動作させるためには寛容遅延しなければなりません。"
    },
    {
      "indent": 3,
      "text": "The communication primitives provided by the DTN architecture are based on asynchronous, message-oriented communication which differs from conversational request/response communication. In general, applications should attempt to include enough information in an ADU so that it may be treated as an independent unit of work by the network and receiver(s). The goal is to minimize synchronous interchanges between applications that are separated by a network characterized by long and possibly highly variable delays. A single file transfer request message, for example, might include authentication information, file location information, and requested file operation (thus \"bundling\" this information together). Comparing this style of operation to a classic FTP transfer, one sees that the bundled model can complete in one round trip, whereas an FTP file \"put\" operation can take as many as eight round trips to get to a point where file data can flow [DFS02].",
      "ja": "DTNアーキテクチャによって提供される通信プリミティブは、会話要求/応答通信と異なる非同期メッセージ指向の通信に基づいています。一般に、アプリケーションは、ネットワークと受信側（S）で作業の独立したユニットとして扱うことができるようにADUに十分な情報を含むことを試みるべきです。目標は、長い、おそらく非常に可変遅延によって特徴付けられるネットワークによって分離されているアプリケーション間の同期インターチェンジを最小にすることです。単一のファイル転送要求メッセージは、例えば、（このように一緒にこの情報を「バンドル」）、認証情報、ファイル位置情報、及び要求されたファイル操作を含むかもしれません。 FTPファイル操作を「置く」は、ファイルデータが流れることができるポイントを取得するなど、多くの8つのラウンドトリップを取ることができ、一方、古典的なFTP転送に操作のこのスタイルを比較すると、1は、バンドルモデルが1回のラウンドトリップで完了できることを見ています[DFS02]。"
    },
    {
      "indent": 3,
      "text": "Delay-tolerant applications must consider additional factors beyond the conversational implications of long delay paths. For example, an application may terminate (voluntarily or not) between the time it sends a message and the time it expects a response. If this possibility has been anticipated, the application can be \"re-instantiated\" with state information saved in persistent storage. This is an implementation issue, but also an application design consideration.",
      "ja": "遅延トレラントアプリケーションは、長い遅延パスの会話の意味を超えて、追加の要因を考慮する必要があります。例えば、アプリケーションは、メッセージを送信し、時間は応答を期待（自発的に又はない）時間の間に終了することができます。この可能性が期待されている場合は、アプリケーションが永続ストレージに保存された状態情報を「再インスタンス化」することができます。これは、実装の問題ではなく、アプリケーションの設計上の考慮事項です。"
    },
    {
      "indent": 3,
      "text": "Some consideration of delay-tolerant application design can result in applications that work reasonably well in low-delay environments, and that do not suffer extraordinarily in high or highly-variable delay environments.",
      "ja": "遅延トレラントアプリケーション設計のいくつかの考慮事項は、低遅延環境で合理的にうまく動作するアプリケーションにつながることができ、それが高いか、高可変遅延環境では非常に苦しむことはありません。"
    },
    {
      "indent": 0,
      "text": "6. Convergence Layer Considerations for Use of Underlying Protocols",
      "section_title": true,
      "ja": "基礎となるプロトコルの使用6.コンバージェンスレイヤの考慮事項"
    },
    {
      "indent": 3,
      "text": "Implementation experience with the DTN architecture has revealed an important architectural construct and interface for DTN nodes [DBFJHP04]. Not all underlying protocols in different protocol families provide the same exact functionality, so some additional adaptation or augmentation on a per-protocol or per-protocol-family basis may be required. This adaptation is accomplished by a set of convergence layers placed between the bundle layer and underlying protocols. The convergence layers manage the protocol-specific details of interfacing with particular underlying protocols and present a consistent interface to the bundle layer.",
      "ja": "DTNアーキテクチャと実装経験は、[DBFJHP04] DTNノードのための重要な建築構造物とインタフェースを明らかにしました。ない異なるプロトコルファミリ内のすべての基本的なプロトコルは、プロトコルごとに、まったく同じ機能なので、いくつかの追加適応や増強を提供するか、またはプロトコルごとのファミリー基礎が必要になることがあります。この適応は、バンドル層とその下にあるプロトコルとの間に配置された収束層のセットによって達成されます。収束層は、特定の基本的なプロトコルとインタフェースのプロトコル固有の詳細を管理し、バンドル層に一貫したインタフェースを提示します。"
    },
    {
      "indent": 3,
      "text": "The complexity of one convergence layer may vary substantially from another, depending on the type of underlying protocol it adapts. For example, a TCP/IP convergence layer for use in the Internet might only have to add message boundaries to TCP streams, whereas a convergence layer for some network where no reliable transport protocol exists might be considerably more complex (e.g., it might have to implement reliability, fragmentation, flow-control, etc.) if reliable delivery is to be offered to the bundle layer.",
      "ja": "1つの収束層の複雑さは、それが適応する基本的なプロトコルの種類に応じて、互いに実質的に変化してもよいです。例えば、インターネットでの使用のためのTCP / IPコンバージェンス層のみTCPストリームにメッセージ境界を追加する必要があります、信頼できるトランスポートプロトコルが存在しない、いくつかのネットワークのコンバージェンス層はかなり多くの例（複雑であるかもしれない一方で、それが持っているかもしれません信頼できる配信がバンドル層に提供される場合、信頼性、フラグメンテーション、フロー制御、等）を実装します。"
    },
    {
      "indent": 3,
      "text": "As convergence layers implement protocols above and beyond the basic bundle protocol specified in [BSPEC], they will be defined in their own documents (in a fashion similar to the way encapsulations for IP datagrams are specified on a per-underlying-protocol basis, such as in RFC 894 [RFC894]).",
      "ja": "収束層は[BSPEC]で指定された基本的なバンドルプロトコル上記以降のプロトコルを実装したように、彼らは、このような、IPデータグラムのためのカプセル化が当たり基礎となるプロトコルごとに指定されている方法と同様の方法で（自分の文書で定義されますRFC 894 [RFC894]）です。"
    },
    {
      "indent": 0,
      "text": "7. Summary",
      "section_title": true,
      "ja": "7.まとめ"
    },
    {
      "indent": 3,
      "text": "The DTN architecture addresses many of the problems of heterogeneous networks that must operate in environments subject to long delays and discontinuous end-to-end connectivity. It is based on asynchronous messaging and uses postal mail as a model of service classes and delivery semantics. It accommodates many different forms of connectivity, including scheduled, predicted, and opportunistically connected delivery paths. It introduces a novel approach to end-to-end reliability across frequently partitioned and unreliable networks. It also proposes a model for securing the network infrastructure against unauthorized access.",
      "ja": "DTNアーキテクチャは、長い遅延や不連続なエンド・ツー・エンドの接続の対象環境で動作しなければならない異種ネットワークの問題の多くを解決します。これは、非同期メッセージングに基づいて、サービスクラスと配信セマンティクスのモデルとして郵便を使用します。これは、スケジュールされた、予測、及び日和見接続された配信経路を含む接続の多くの異なる形態を、収容します。これは、エンドツーエンドのために頻繁に分割され、信頼性の低いネットワーク全体の信頼性を新たなアプローチを紹介します。また、不正アクセスに対するネットワークインフラストラクチャを確保するためのモデルを提案しています。"
    },
    {
      "indent": 3,
      "text": "It is our belief that this architecture is applicable to many different types of challenged environments.",
      "ja": "これは、このアーキテクチャは挑戦環境の多くの異なる種類に適用可能であることは私たちの信念です。"
    },
    {
      "indent": 0,
      "text": "8. Security Considerations",
      "section_title": true,
      "ja": "8.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "Security is an integral concern for the design of the Delay Tolerant Network Architecture, but its use is optional. Sections 3.6.1, 3.14, and 4.4 of this document present some factors to consider for securing the DTN architecture, but separate documents [DTNSOV] and [DTNSEC] define the security architecture in much more detail.",
      "ja": "セキュリティは、遅延耐性ネットワークアーキテクチャの設計に不可欠な関心事であるが、その使用は任意です。セクション3.6.1、3.14、及びこの文書の4.4 [DTNSOVいくつかDTNアーキテクチャを確保するために考慮すべき要素が、別の文書を提示し、[DTNSEC】一層詳細にセキュリティアーキテクチャを定義します。"
    },
    {
      "indent": 0,
      "text": "9. IANA Considerations",
      "section_title": true,
      "ja": "9. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document specifies the architecture for Delay Tolerant Networking, which uses Internet-standard URIs for its Endpoint Identifiers. URIs intended for use with DTN should be compliant with the guidelines given in [RFC3986].",
      "ja": "この文書では、そのエンドポイント識別子のためのインターネット標準のURIを使用して遅延耐性ネットワークのためのアーキテクチャを指定します。 DTNでの使用を意図URIは、[RFC3986]で与えられたガイドラインに準拠する必要があります。"
    },
    {
      "indent": 0,
      "text": "10. Normative References",
      "section_title": true,
      "ja": "10.引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC3986] Berners-Lee, T., Fielding, R., and L. Masinter, \"Uniform Resource Identifier (URI): Generic Syntax\", STD 66, RFC 3986, January 2005.",
      "ja": "[RFC3986]バーナーズ - リー、T.、フィールディング、R.、およびL. Masinter、 \"ユニフォームリソース識別子（URI）：汎用構文\"、STD 66、RFC 3986、2005年1月。"
    },
    {
      "indent": 0,
      "text": "11. Informative References",
      "section_title": true,
      "ja": "11.参考文献"
    },
    {
      "indent": 3,
      "text": "[IPN01] InterPlaNetary Internet Project, Internet Society IPN Special Interest Group, http://www.ipnsig.org.",
      "ja": "[IPN01]惑星間インターネット事業、インターネット協会IPNスペシャル・インタレスト・グループ、http://www.ipnsig.org。"
    },
    {
      "indent": 3,
      "text": "[SB03] S. Burleigh, et al., \"Delay-Tolerant Networking - An Approach to Interplanetary Internet\", IEEE Communications Magazine, July 2003.",
      "ja": "[SB03] S.バーリー、ら、「遅延耐性ネットワーク - 惑星間インターネットへのアプローチ」。、IEEEコミュニケーションズ・マガジン、2003年7月。"
    },
    {
      "indent": 3,
      "text": "[FW03] F. Warthman, \"Delay-Tolerant Networks (DTNs): A Tutorial v1.1\", Wartham Associates, 2003. Available from http://www.dtnrg.org.",
      "ja": "[FW03] F. Warthman、 \"ディレイトレラント・ネットワーク（DTNs）：チュートリアルV1.1\"、Warthamアソシエイツ、http://www.dtnrg.orgから利用可能な2003年。"
    },
    {
      "indent": 3,
      "text": "[KF03] K. Fall, \"A Delay-Tolerant Network Architecture for Challenged Internets\", Proceedings SIGCOMM, Aug 2003.",
      "ja": "[KF03] K.秋、「チャレンジインターネットのための遅延・トレラント・ネットワーク・アーキテクチャ」、議事SIGCOMM、2003年8月。"
    },
    {
      "indent": 3,
      "text": "[JFP04] S. Jain, K. Fall, R. Patra, \"Routing in a Delay Tolerant Network\", Proceedings SIGCOMM, Aug/Sep 2004.",
      "ja": "[JFP04] S.ジャイナ教、K.秋、R.パトラ、 \"遅延耐性ネットワークにおけるルーティング\"、議事SIGCOMM、2004年8月/ 9月"
    },
    {
      "indent": 3,
      "text": "[DFS02] R. Durst, P. Feighery, K. Scott, \"Why not use the Standard Internet Suite for the Interplanetary Internet?\", MITRE White Paper, 2002. Available from http://www.ipnsig.org/reports/TCP_IP.pdf.",
      "ja": "http://www.ipnsig.org/reports/から[DFS02] R.ダースト、P. Feighery、K.スコット、「なぜ惑星間インターネットのための標準的なインターネットスイートを使用しない？」、MITER白書、2002年には、利用可能なTCP_IP.pdf。"
    },
    {
      "indent": 3,
      "text": "[CK74] V. Cerf, R. Kahn, \"A Protocol for Packet Network Intercommunication\", IEEE Trans. on Comm., COM-22(5), May 1974.",
      "ja": "[CK74] V.サーフ、R.カーン、 \"パケットネットワーク相互通信のためのプロトコル\"、IEEEトランス。 Commの上。、COM-22（5）、1974年5月。"
    },
    {
      "indent": 3,
      "text": "[IGE00] C. Intanagonwiwat, R. Govindan, D. Estrin, \"Directed Diffusion: A Scalable and Robust Communication Paradigm for Sensor Networks\", Proceedings MobiCOM, Aug 2000.",
      "ja": "[IGE00] C. Intanagonwiwat、R.ゴヴィンダン、D. Estrin、 \"監督の拡散：センサネットワークのためのスケーラブルかつ堅牢なコミュニケーションパラダイム\"、議事モビコム、2000年8月。"
    },
    {
      "indent": 3,
      "text": "[WSBL99] W. Adjie-Winoto, E. Schwartz, H. Balakrishnan, J. Lilley, \"The Design and Implementation of an Intentional Naming System\", Proc. 17th ACM SOSP, Kiawah Island, SC, Dec. 1999.",
      "ja": "【WSBL99] W. Adjie-Winoto、E.シュワルツ、H.バラクリシュナン、J.リリー、PROC \"意図的命名システムの設計と実装\"。第17回ACM SOSP、カイワーアイランド、サウスカロライナ州、1999年12月。"
    },
    {
      "indent": 3,
      "text": "[CT90] D. Clark, D. Tennenhouse, \"Architectural Considerations for a New Generation of Protocols\", Proceedings SIGCOMM, 1990.",
      "ja": "[CT90] D.クラーク、D. Tennenhouse、 \"プロトコルの新世代のための建築に関する注意事項\"、議事SIGCOMM、1990。"
    },
    {
      "indent": 3,
      "text": "[ISCHEMES] IANA, Uniform Resource Identifer (URI) Schemes, http://www.iana.org/assignments/uri-schemes.html.",
      "ja": "【ISCHEMES] IANA、ユニフォームリソース識別子です（URI）スキーム、http://www.iana.org/assignments/uri-schemes.html。"
    },
    {
      "indent": 3,
      "text": "[JDPF05] S. Jain, M. Demmer, R. Patra, K. Fall, \"Using Redundancy to Cope with Failures in a Delay Tolerant Network\", Proceedings SIGCOMM, 2005.",
      "ja": "【JDPF05] S. Jainさん、M. Demmer、R.パトラ、K.秋、議事SIGCOMM 2005 \"遅延トレラントネットワークにおける障害に対処するための冗長性を使用します\"。"
    },
    {
      "indent": 3,
      "text": "[WJMF05] Y. Wang, S. Jain, M. Martonosi, K. Fall, \"Erasure Coding Based Routing in Opportunistic Networks\", Proceedings SIGCOMM Workshop on Delay Tolerant Networks, 2005.",
      "ja": "ディレイトレラントネットワーク、2005 [WJMF05] Y.ワング、S。ジェイン、M. Martonosi、K.秋、「日和見ネットワークにおけるベースルーティングコーディング消去」、議事SIGCOMMワークショップ。"
    },
    {
      "indent": 3,
      "text": "[ZAZ05] W. Zhao, M. Ammar, E. Zegura, \"Multicast in Delay Tolerant Networks\", Proceedings SIGCOMM Workshop on Delay Tolerant Networks, 2005.",
      "ja": "[ZAZ05] W.趙、M.アマル、E. Zegura、 \"遅延耐性ネットワークにおけるマルチキャスト\"、ディレイトレラントネットワークス、2005年議事SIGCOMMワークショップ。"
    },
    {
      "indent": 3,
      "text": "[LFC05] J. Leguay, T. Friedman, V. Conan, \"DTN Routing in a Mobility Pattern Space\", Proceedings SIGCOMM Workshop on Delay Tolerant Networks, 2005.",
      "ja": "[LFC05] J. Leguay、T.フリードマン、V.コナン、 \"モビリティのパターンスペースにおけるDTNルーティング\"、ディレイトレラントネットワークス、2005年議事SIGCOMMワークショップ。"
    },
    {
      "indent": 3,
      "text": "[AF03] J. Alonso, K. Fall, \"A Linear Programming Formulation of Flows over Time with Piecewise Constant Capacity and Transit Times\", Intel Research Technical Report IRB-TR-03-007, June 2003.",
      "ja": "[AF03] J.アロンソ、K.秋、「区分定数容量と時間をかけて流れの線形計画製剤と配達所要時間」、インテル・リサーチテクニカルレポートIRB-TR-03から007、2003年6月。"
    },
    {
      "indent": 3,
      "text": "[FHM03] K. Fall, W. Hong, S. Madden, \"Custody Transfer for Reliable Delivery in Delay Tolerant Networks\", Intel Research Technical Report IRB-TR-03-030, July 2003.",
      "ja": "[FHM03] K.秋、W.香港、S.マッデン、「遅延耐性ネットワークにおける信頼性の高い配信のためのカストディ転送」、インテル・リサーチテクニカルレポートIRB-TR-03から030、2003年7月。"
    },
    {
      "indent": 3,
      "text": "[BSPEC] K. Scott, S. Burleigh, \"Bundle Protocol Specification\", Work in Progress, December 2006.",
      "ja": "[BSPEC] K.スコット、S.バーリー、 \"バンドルプロトコル仕様\"、進歩、2006年12月に作業。"
    },
    {
      "indent": 3,
      "text": "[DTNSEC] S. Symington, S. Farrell, H. Weiss, \"Bundle Security Protocol Specification\", Work in Progress, October 2006.",
      "ja": "[DTNSEC] S.シミントン、S.ファレル、H.ワイス、 \"バンドルセキュリティプロトコル仕様\"、進歩、2006年10月に作業。"
    },
    {
      "indent": 3,
      "text": "[DTNSOV] S. Farrell, S. Symington, H. Weiss, \"Delay-Tolerant Networking Security Overview\", Work in Progress, October 2006.",
      "ja": "[DTNSOV] S.ファレル、S.シミントン、H.ワイス、「遅延耐性ネットワークセキュリティの概要」、進歩、2006年10月に作業。"
    },
    {
      "indent": 3,
      "text": "[DBFJHP04] M. Demmer, E. Brewer, K. Fall, S. Jain, M. Ho, R. Patra, \"Implementing Delay Tolerant Networking\", Intel Research Technical Report IRB-TR-04-020, Dec. 2004.",
      "ja": "[DBFJHP04] M. Demmer、E.ブリューワー、K.秋、S.ジャイナ教、M.ホー、R.パトラ、インテル・リサーチテクニカルレポートIRB-TR-04から020、2004年12月 \"遅延耐性ネットワークの実装\"。"
    },
    {
      "indent": 3,
      "text": "[RFC792] Postel, J., \"Internet Control Message Protocol\", STD 5, RFC 792, September 1981.",
      "ja": "[RFC792]ポステル、J.、 \"インターネット制御メッセージプロトコル\"、STD 5、RFC 792、1981年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC894] Hornig, C., \"A Standard for the Transmission of IP Datagrams over Ethernet Networks\", STD 41, RFC 894, April 1 1984.",
      "ja": "\"イーサネット・ネットワーク上のIPデータグラムの送信の規格\" [RFC894] Hornig、C.、STD 41、RFC 894、1984年4月1日。"
    },
    {
      "indent": 3,
      "text": "[RFC2960] Stewart, R., Xie, Q., Morneault, K., Sharp, C., Schwarzbauer, H., Taylor, T., Rytina, I., Kalla, M., Zhang, L., and V. Paxson, \"Stream Control Transmission Protocol\", RFC 2960, October 2000.",
      "ja": "[RFC2960]スチュワート、R.、謝、Q.、Morneault、K.、シャープ、C.、Schwarzbauer、H.、テイラー、T.、Rytina、I.、カラ、M.、チャン、L.、およびV 。パクソン、 \"ストリーム制御伝送プロトコル\"、RFC 2960、2000年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC4088] Black, D., McCloghrie, K., and J. Schoenwaelder, \"Uniform Resource Identifier (URI) Scheme for the Simple Network Management Protocol (SNMP)\", RFC 4088, June 2005.",
      "ja": "[RFC4088]ブラック、D.、McCloghrie、K.、およびJ. Schoenwaelder、 \"統一資源識別子（URI）簡易ネットワーク管理プロトコル（SNMP）のためのスキーム\"、RFC 4088、2005年6月。"
    },
    {
      "indent": 3,
      "text": "[S05] K. Scott, \"Disruption Tolerant Networking Proxies for On-the-Move Tactical Networks\", Proc. MILCOM 2005 (unclassified track), Oct. 2005.",
      "ja": "[S05] K.スコット、「オン・移動戦術ネットワークの破壊トレラントネットワークプロキシ」、PROC。 MILCOM 2005（未分類トラック）、2005年10月。"
    },
    {
      "indent": 3,
      "text": "[T02] W. Thies, et al., \"Searching the World Wide Web in Low-Connectivity Communities\", Proc. WWW Conference (Global Community track), May 2002.",
      "ja": "[T02] W.ティース、ら、Proc、「低接続コミュニティにおけるワールド・ワイド・ウェブを検索」。 WWW会議（グローバル・コミュニティ・トラック）、2002年5月。"
    },
    {
      "indent": 0,
      "text": "12. Acknowledgments",
      "section_title": true,
      "ja": "12.謝辞"
    },
    {
      "indent": 3,
      "text": "John Wroclawski, David Mills, Greg Miller, James P. G. Sterbenz, Joe Touch, Steven Low, Lloyd Wood, Robert Braden, Deborah Estrin, Stephen Farrell, Melissa Ho, Ting Liu, Mike Demmer, Jakob Ericsson, Susan Symington, Andrei Gurtov, Avri Doria, Tom Henderson, Mark Allman, Michael Welzl, and Craig Partridge all contributed useful thoughts and criticisms to versions of this document. We are grateful for their time and participation.",
      "ja": "ジョンWroclawski、デビッド・ミルズ、グレッグ・ミラー、ジェームス・PG Sterbenz、ジョー・タッチ、スティーブン・ロー、ロイド・ウッド、ロバート・ブレーデン、デボラ・エストリン、スティーブン・ファレル、メリッサ・ホー、ティン劉、マイク・Demmer、ヤコブ・エリクソン、スーザンシミントン、アンドレイGurtov、Avriドリア、トム・ヘンダーソン、マーク・オールマン、マイケル・Welzl、とクレイグ・パートリッジのすべては、このドキュメントのバージョンに有益な思考や批判を貢献しました。私たちは、自分の時間と参加のために感謝しています。"
    },
    {
      "indent": 3,
      "text": "This work was performed in part under DOD Contract DAA-B07-00-CC201, DARPA AO H912; JPL Task Plan No. 80-5045, DARPA AO H870; and NASA Contract NAS7-1407.",
      "ja": "この作業は、DOD契約DAA-B07-00-CC201、DARPA AO H912の下部分で行いました。 JPLタスクプラン番号80から5045、DARPA AO H870。そしてNASA契約NAS7-1407。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Dr. Vinton G. Cerf Google Corporation Suite 384 13800 Coppermine Rd. Herndon, VA 20171 Phone: +1 (703) 234-1823 Fax: +1 (703) 848-0727 EMail: vint@google.com",
      "ja": "博士ヴィントンG.サーフグーグル株式会社スイート384 13800 CoppermineとRdを。ハーンドン、VA 20171電話：+1（703）234から1823ファックス：+1（703）848から0727 Eメール：vint@google.com"
    },
    {
      "indent": 3,
      "text": "Scott C. Burleigh Jet Propulsion Laboratory 4800 Oak Grove Drive M/S: 179-206 Pasadena, CA 91109-8099 Phone: +1 (818) 393-3353 Fax: +1 (818) 354-1075 EMail: Scott.Burleigh@jpl.nasa.gov",
      "ja": "スコットC.バーレイジェット推進研究所4800オークグローブドライブM / S：179から206パサデナ、CA 91109から8099電話：+1（818）393から3353ファックス：+1（818）354から1075 Eメール：Scott.Burleigh @ jpl.nasa.gov"
    },
    {
      "indent": 3,
      "text": "Robert C. Durst The MITRE Corporation 7515 Colshire Blvd., M/S H440 McLean, VA 22102 Phone: +1 (703) 983-7535 Fax: +1 (703) 983-7142 EMail: durst@mitre.org",
      "ja": "ロバートC.ダーストザ・MITRE社7515 Colshireブルバード、M / S H440マクリーン、VA 22102電話：+1（703）983から7535ファックス：+1（703）983から7142 Eメール：durst@mitre.org"
    },
    {
      "indent": 3,
      "text": "Dr. Kevin Fall Intel Research, Berkeley 2150 Shattuck Ave., #1300 Berkeley, CA 94704 Phone: +1 (510) 495-3014 Fax: +1 (510) 495-3049 EMail: kfall@intel.com",
      "ja": "博士ケビンは、インテル・リサーチ、バークレイ秋2150シャタックアベニュー、＃1300バークレー、CA 94704電話：+1（510）495から3014ファックス：+1（510）495から3049 Eメール：kfall@intel.com"
    },
    {
      "indent": 3,
      "text": "Adrian J. Hooke Jet Propulsion Laboratory 4800 Oak Grove Drive M/S: 303-400 Pasadena, CA 91109-8099 Phone: +1 (818) 354-3063 Fax: +1 (818) 393-3575 EMail: Adrian.Hooke@jpl.nasa.gov",
      "ja": "エイドリアン・J.フックジェット推進研究所4800オークグローブドライブM / S：303から400パサデナ、CA 91109から8099電話：+1（818）354から3063ファックス：+1（818）393から3575 Eメール：Adrian.Hooke @ jpl.nasa.gov"
    },
    {
      "indent": 3,
      "text": "Dr. Keith L. Scott The MITRE Corporation 7515 Colshire Blvd., M/S H440 McLean, VA 22102 Phone: +1 (703) 983-6547 Fax: +1 (703) 983-7142 EMail: kscott@mitre.org",
      "ja": "博士キース・L.スコット・ザ・MITRE社7515 Colshireブルバード、M / S H440マクリーン、VA 22102電話：+1（703）983から6547ファックス：+1（703）983から7142 Eメール：kscott@mitre.org"
    },
    {
      "indent": 3,
      "text": "Leigh Torgerson Jet Propulsion Laboratory 4800 Oak Grove Drive M/S: 238-412 Pasadena, CA 91109-8099 Phone: +1 (818) 393-0695 Fax: +1 (818) 354-6825 EMail: ltorgerson@jpl.nasa.gov",
      "ja": "リーTorgersonジェット推進研究所4800オークグローブドライブM / S：238から412パサデナ、CA 91109から8099電話：+1（818）393から0695ファックス：+1（818）354から6825 Eメール：ltorgerson@jpl.nasa。 GOV"
    },
    {
      "indent": 3,
      "text": "Howard S. Weiss SPARTA, Inc. 7075 Samuel Morse Drive Columbia, MD 21046 Phone: +1 (410) 872-1515 x201 Fax: +1 (410) 872-8079 EMail: howard.weiss@sparta.com",
      "ja": "ハワードS.ワイスSPARTA、Inc.の7075サミュエル・モールスドライブコロンビア、MD 21046電話：+1（410）872から1515 X201ファックス：+1（410）872から8079 Eメール：howard.weiss@sparta.com"
    },
    {
      "indent": 3,
      "text": "Please refer comments to dtn-interest@mailman.dtnrg.org. The Delay Tolerant Networking Research Group (DTNRG) web site is located at http://www.dtnrg.org.",
      "ja": "dtn-interest@mailman.dtnrg.orgにコメントを参照してください。遅延耐性ネットワーク研究会（DTNRG）のウェブサイトはhttp://www.dtnrg.orgに位置しています。"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The IETF Trust (2007).",
      "ja": "著作権（C）IETFトラスト（2007）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "この文書では、BCP 78に含まれる権利と許可と制限の適用を受けており、その中の記載を除いて、作者は彼らのすべての権利を保有します。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE IETF TRUST AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とCONTRIBUTOR「そのまま」、ORGANIZATION HE / SHEが表すまたはインターネットSOCIETY、（もしあれば）を後援し、IETF TRUST ANDインターネットエンジニアリングタスクフォース放棄ALLに設けられています。保証は、明示または黙示、この情報の利用および特定目的に対する権利または商品性または適合性の黙示の保証を侵害しない任意の保証がこれらに限定されません。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、本書またはそのような権限下で、ライセンスがたりないかもしれない程度に記載された技術の実装や使用に関係すると主張される可能性があります任意の知的財産権やその他の権利の有効性または範囲に関していかなる位置を取りません利用可能です。またそれは、それがどのような権利を確認する独自の取り組みを行ったことを示すものでもありません。 RFC文書の権利に関する手続きの情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IPRの開示のコピーが利用できるようにIETF事務局とライセンスの保証に行われた、または本仕様の実装者または利用者がそのような所有権の使用のための一般的なライセンスまたは許可を取得するために作られた試みの結果を得ることができますhttp://www.ietf.org/iprのIETFのオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、その注意にこの標準を実装するために必要とされる技術をカバーすることができる任意の著作権、特許または特許出願、またはその他の所有権を持ってすべての利害関係者を招待します。 ietf-ipr@ietf.orgのIETFに情報を記述してください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}