{
  "title": {
    "text": "RFC 4007 - IPv6 Scoped Address Architecture",
    "ja": "RFC 4007 - IPv6スコープアドレスアーキテクチャ"
  },
  "number": 4007,
  "created_at": "2023-08-22 07:17:23.670570+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                         S. Deering\nRequest for Comments: 4007                                 Cisco Systems\nCategory: Standards Track                                    B. Haberman\n                                                      Johns Hopkins Univ\n                                                               T. Jinmei\n                                                                 Toshiba\n                                                             E. Nordmark\n                                                        Sun Microsystems\n                                                                 B. Zill\n                                                               Microsoft\n                                                              March 2005",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 20,
      "text": "IPv6 Scoped Address Architecture",
      "ja": "IPv6スコープアドレスアーキテクチャ"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "このドキュメントは、インターネットコミュニティのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態とステータスについては、「インターネット公式プロトコル標準」（STD 1）の現在のエディションを参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "ja": "Copyright（c）The Internet Society（2005）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document specifies the architectural characteristics, expected behavior, textual representation, and usage of IPv6 addresses of different scopes. According to a decision in the IPv6 working group, this document intentionally avoids the syntax and usage of unicast site-local addresses.",
      "ja": "このドキュメントは、さまざまなスコープのIPv6アドレスのアーキテクチャの特性、予想される動作、テキスト表現、および使用法を指定します。IPv6ワーキンググループの決定によると、このドキュメントは、ユニキャストサイトローカルアドレスの構文と使用を意図的に回避します。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . .   2\n2.  Definitions  . . . . . . . . . . . . . . . . . . . . . . . .   3\n3.  Basic Terminology  . . . . . . . . . . . . . . . . . . . . .   3\n4.  Address Scope  . . . . . . . . . . . . . . . . . . . . . . .   3\n5.  Scope Zones  . . . . . . . . . . . . . . . . . . . . . . . .   4\n6.  Zone Indices . . . . . . . . . . . . . . . . . . . . . . . .   6\n7.  Sending Packets  . . . . . . . . . . . . . . . . . . . . . .  11\n8.  Receiving Packets  . . . . . . . . . . . . . . . . . . . . .  11\n9.  Forwarding . . . . . . . . . . . . . . . . . . . . . . . . .  11\n10. Routing  . . . . . . . . . . . . . . . . . . . . . . . . . .  13\n11. Textual Representation . . . . . . . . . . . . . . . . . . .  15\n    11.1.  Non-Global Addresses  . . . . . . . . . . . . . . . .  15\n    11.2.  The <zone_id> Part. . . . . . . . . . . . . . . . . .  15\n    11.3.  Examples. . . . . . . . . . . . . . . . . . . . . . .  17\n    11.4.  Usage Examples. . . . . . . . . . . . . . . . . . . .  17\n    11.5.  Related API . . . . . . . . . . . . . . . . . . . . .  18\n    11.6.  Omitting Zone Indices . . . . . . . . . . . . . . . .  18\n    11.7.  Combinations of Delimiter Characters. . . . . . . . .  18\n12. Security Considerations  . . . . . . . . . . . . . . . . . .  19\n13. Contributors . . . . . . . . . . . . . . . . . . . . . . . .  20\n14. Acknowledgements . . . . . . . . . . . . . . . . . . . . . .  20\n15. References . . . . . . . . . . . . . . . . . . . . . . . . .  20\n    15.1. Normative References . . . . . . . . . . . . . . . . .  20\n    15.2. Informative References . . . . . . . . . . . . . . . .  21\nAuthors' Addresses . . . . . . . . . . . . . . . . . . . . . . .  22\nFull Copyright Statement . . . . . . . . . . . . . . . . . . . .  24",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "Internet Protocol version 6 includes support for addresses of different \"scope\"; that is, both global and non-global (e.g., link-local) addresses. Although non-global addressing has been introduced operationally in the IPv4 Internet, both in the use of private address space (\"net 10\", etc.) and with administratively scoped multicast addresses, the design of IPv6 formally incorporates the notion of address scope into its base architecture. This document specifies the architectural characteristics, expected behavior, textual representation, and usage of IPv6 addresses of different scopes.",
      "ja": "インターネットプロトコルバージョン6には、異なる「スコープ」のアドレスのサポートが含まれています。つまり、グローバルと非グローバル（リンクローカルなど）の両方のアドレスの両方です。非グロバルアドレス指定は、プライベートアドレススペース（「ネット10」など）の使用と管理上スコープマルチキャストアドレスの両方で、IPv4インターネットで運用上導入されていますが、IPv6の設計は、アドレス範囲の概念を正式に組み込んでいます。そのベースアーキテクチャ。このドキュメントは、さまざまなスコープのIPv6アドレスのアーキテクチャの特性、予想される動作、テキスト表現、および使用法を指定します。"
    },
    {
      "indent": 3,
      "text": "Though the current address architecture specification [1] defines unicast site-local addresses, the IPv6 working group decided to deprecate the syntax and the usage [5] and is now investigating other forms of local IPv6 addressing. The usage of any new forms of local addresses will be documented elsewhere in the future. Thus, this document intentionally focuses on link-local and multicast scopes only.",
      "ja": "現在のアドレスアーキテクチャ仕様[1]はユニキャストサイトローカルアドレスを定義していますが、IPv6ワーキンググループは構文と使用状況[5]を非難することを決定し、現在、ローカルIPv6アドレス指定の他の形式を調査しています。ローカルアドレスの新しい形式の使用は、将来他の場所で文書化されます。したがって、このドキュメントは、意図的にLink-LocalおよびMulticastスコープのみに焦点を当てています。"
    },
    {
      "indent": 0,
      "text": "2. Definitions",
      "section_title": true,
      "ja": "2. 定義"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [2].",
      "ja": "「必須」、「そうしない」、「必須」、「shall」、「shall \"、\" ingle \"、\" should \"、\" not \"、\" becommended \"、\" bay \"、および「optional」は、[2]に記載されているように解釈される。"
    },
    {
      "indent": 0,
      "text": "3. Basic Terminology",
      "section_title": true,
      "ja": "3. 基本的な用語"
    },
    {
      "indent": 3,
      "text": "The terms link, interface, node, host, and router are defined in [3]. The definitions of unicast address scopes (link-local and global) and multicast address scopes (interface-local, link-local, etc.) are contained in [1].",
      "ja": "[3]で、リンク、インターフェイス、ノード、ホスト、およびルーターという用語が定義されています。ユニキャストアドレススコープ（リンクローカルおよびグローバル）およびマルチキャストアドレススコープ（インターフェイスローカル、リンクローカルなど）の定義は[1]に含まれています。"
    },
    {
      "indent": 0,
      "text": "4. Address Scope",
      "section_title": true,
      "ja": "4. アドレス範囲"
    },
    {
      "indent": 3,
      "text": "Every IPv6 address other than the unspecified address has a specific scope; that is, a topological span within which the address may be used as a unique identifier for an interface or set of interfaces. The scope of an address is encoded as part of the address, as specified in [1].",
      "ja": "不特定のアドレス以外のすべてのIPv6アドレスには、特定の範囲があります。つまり、アドレスがインターフェイスまたはインターフェイスのセットの一意の識別子として使用されるトポロジースパンです。アドレスの範囲は、[1]で指定されているように、アドレスの一部としてエンコードされます。"
    },
    {
      "indent": 3,
      "text": "For unicast addresses, this document discusses two defined scopes:",
      "ja": "ユニキャストアドレスについては、このドキュメントでは、2つの定義されたスコープについて説明します。"
    },
    {
      "indent": 3,
      "text": "o Link-local scope, for uniquely identifying interfaces within (i.e., attached to) a single link only.",
      "ja": "o 単一のリンクのみを単独で識別する（つまり、接続されている）のためのリンクローカルスコープ。"
    },
    {
      "indent": 3,
      "text": "o Global scope, for uniquely identifying interfaces anywhere in the Internet.",
      "ja": "o インターネット内のどこでもインターフェイスを一意に識別するためのグローバル範囲。"
    },
    {
      "indent": 3,
      "text": "The IPv6 unicast loopback address, ::1, is treated as having link-local scope within an imaginary link to which a virtual \"loopback interface\" is attached.",
      "ja": "IPv6ユニキャストループバックアドレス:: 1は、仮想「ループバックインターフェイス」が添付されている虚数リンク内にリンクローカルスコープを持つものとして扱われます。"
    },
    {
      "indent": 3,
      "text": "The unspecified address, ::, is a special case. It does not have any scope because it must never be assigned to any node according to [1]. Note, however, that an implementation might use an implementation dependent semantics for the unspecified address and may want to allow the unspecified address to have specific scopes. For example, implementations often use the unspecified address to represent \"any\" address in APIs. In this case, implementations may regard the unspecified address with a given particular scope as representing the notion of \"any address in the scope\". This document does not prohibit such a usage, as long as it is limited within the implementation.",
      "ja": "不特定のアドレス::は、特別なケースです。[1]に従ってノードに割り当てられてはならないため、スコープはありません。ただし、実装では、不特定のアドレスに実装依存セマンティクスを使用する場合があり、不特定のアドレスに特定のスコープがあることを許可する場合があることに注意してください。たとえば、実装は、不特定のアドレスを使用して、APIの「任意の」アドレスを表すことがよくあります。この場合、実装は、特定の特定の範囲を持つ不特定のアドレスを、「範囲内の任意のアドレス」の概念を表すものと見なす場合があります。このドキュメントは、実装内で制限されている限り、このような使用法を禁止していません。"
    },
    {
      "indent": 3,
      "text": "[1] defines IPv6 addresses with embedded IPv4 addresses as being part of global addresses. Thus, those addresses have global scope, with regard to the IPv6 scoped address architecture. However, an implementation may use those addresses as if they had other scopes for convenience. For instance, [6] assigns link-local scope to IPv4 auto-configured link-local addresses (the addresses from the prefix 169.254.0.0/16 [7]) and converts those addresses into IPv4-mapped IPv6 addresses in order to perform destination address selection among IPv4 and IPv6 addresses. This would implicitly mean that the IPv4-mapped IPv6 addresses equivalent to the IPv4 auto-configuration link-local addresses have link-local scope. This document does not preclude such a usage, as long as it is limited within the implementation.",
      "ja": "[1] 埋め込まれたIPv4アドレスを使用してIPv6アドレスをグローバルアドレスの一部として定義します。したがって、これらのアドレスは、IPv6スコープアドレスアーキテクチャに関して、グローバルな範囲を持っています。ただし、実装では、これらのアドレスが便利なために他のスコープがあるかのように使用する場合があります。たとえば、[6]は、リンクローカルスコープをIPv4自動構成リンクローカルアドレス（プレフィックス169.254.0.0/16 [7]のアドレス）に割り当て、これらのアドレスをIPv4-Mapped IPv6アドレスに変換し、宛先を実行するために変換します。IPv4およびIPv6アドレス間のアドレス選択。これは、IPv4-Mapped IPv6アドレスがIPv4 Auto-Configuration Link-Localアドレスに相当するLink-Local Scopeに相当することを暗黙的に意味します。このドキュメントは、実装内で制限されている限り、そのような使用を排除しません。"
    },
    {
      "indent": 3,
      "text": "Anycast addresses [1] are allocated from the unicast address space and have the same scope properties as unicast addresses. All statements in this document regarding unicast apply equally to anycast.",
      "ja": "Anycastアドレス[1]は、ユニキャストアドレススペースから割り当てられ、ユニキャストアドレスと同じスコーププロパティを持っています。Unicastに関するこのドキュメントのすべてのステートメントは、Anycastに等しく適用されます。"
    },
    {
      "indent": 3,
      "text": "For multicast addresses, there are fourteen possible scopes, ranging from interface-local to global (including link-local). The interface-local scope spans a single interface only; a multicast address of interface-local scope is useful only for loopback delivery of multicasts within a single node; for example, as a form of inter-process communication within a computer. Unlike the unicast loopback address, interface-local multicast addresses may be assigned to any interface.",
      "ja": "マルチキャストアドレスの場合、インターフェイスローカルからグローバル（Link-Localを含む）に至るまで、14の可能なスコープがあります。インターフェイスローカルスコープは、単一のインターフェイスのみに及びます。インターフェイスローカルスコープのマルチキャストアドレスは、単一のノード内のマルチキャストのループバック配信にのみ役立ちます。たとえば、コンピューター内のプロセス間通信の形式として。ユニキャストループバックアドレスとは異なり、インターフェイスローカルマルチキャストアドレスは任意のインターフェイスに割り当てられる場合があります。"
    },
    {
      "indent": 3,
      "text": "There is a size relationship among scopes:",
      "ja": "スコープの間にはサイズの関係があります："
    },
    {
      "indent": 3,
      "text": "o For unicast scopes, link-local is a smaller scope than global.",
      "ja": "o ユニキャストスコープの場合、Link-Localはグローバルよりも小さい範囲です。"
    },
    {
      "indent": 3,
      "text": "o For multicast scopes, scopes with lesser values in the \"scop\" subfield of the multicast address (Section 2.7 of [1]) are smaller than scopes with greater values, with interface-local being the smallest and global being the largest.",
      "ja": "o マルチキャストスコープの場合、マルチキャストアドレスの「SCOP」サブフィールド（[1]のセクション2.7）の値が低いスコープは、値が大きいスコープよりも小さく、インターフェイスローカルは最小でグローバルです。"
    },
    {
      "indent": 3,
      "text": "However, two scopes of different size may cover the exact same region of topology. For example, a (multicast) site may consist of a single link, in which both link-local and site-local scope effectively cover the same topological span.",
      "ja": "ただし、異なるサイズの2つのスコープは、まったく同じトポロジー領域をカバーする場合があります。たとえば、（マルチキャスト）サイトは単一のリンクで構成され、リンクローカルとサイトローカルスコープの両方が同じトポロジースパンを効果的にカバーしています。"
    },
    {
      "indent": 0,
      "text": "5. Scope Zones",
      "section_title": true,
      "ja": "5. スコープゾーン"
    },
    {
      "indent": 3,
      "text": "A scope zone, or simply a zone, is a connected region of topology of a given scope. For example, the set of links connected by routers within a particular (multicast) site, and the interfaces attached to those links, comprise a single zone of multicast site-local scope.",
      "ja": "スコープゾーン、または単にゾーンは、特定のスコープのトポロジーの接続領域です。たとえば、特定の（マルチキャスト）サイト内のルーターで接続されたリンクのセットと、それらのリンクに接続されたインターフェイスは、マルチキャストサイトローカルスコープの単一のゾーンを構成します。"
    },
    {
      "indent": 3,
      "text": "Note that a zone is a particular instance of a topological region (e.g., Alice's site or Bob's site), whereas a scope is the size of a topological region (e.g., a site or a link).",
      "ja": "ゾーンはトポロジー領域（アリスのサイトやボブのサイトなど）の特定のインスタンスであり、スコープはトポロジー領域（サイトやリンクなど）のサイズであることに注意してください。"
    },
    {
      "indent": 3,
      "text": "The zone to which a particular non-global address pertains is not encoded in the address itself but determined by context, such as the interface from which it is sent or received. Thus, addresses of a given (non-global) scope may be re-used in different zones of that scope. For example, two different physical links may each contain a node with the link-local address fe80::1.",
      "ja": "特定の非グローバルアドレスが関係するゾーンは、アドレス自体にエンコードされていませんが、送信または受信されるインターフェイスなどのコンテキストによって決定されます。したがって、特定の（非グロバル）スコープのアドレスは、その範囲の異なるゾーンで再利用される場合があります。たとえば、2つの異なる物理リンクには、それぞれリンクローカルアドレスFE80 :: 1のノードを含めることができます。"
    },
    {
      "indent": 3,
      "text": "Zones of the different scopes are instantiated as follows:",
      "ja": "さまざまなスコープのゾーンは、次のようにインスタンス化されます。"
    },
    {
      "indent": 3,
      "text": "o Each interface on a node comprises a single zone of interface-local scope (for multicast only).",
      "ja": "o ノード上の各インターフェイスは、インターフェイスローカルスコープの単一のゾーン（マルチキャストのみ）を含む。"
    },
    {
      "indent": 3,
      "text": "o Each link and the interfaces attached to that link comprise a single zone of link-local scope (for both unicast and multicast).",
      "ja": "o そのリンクに接続されている各リンクとインターフェイスは、リンクローカルスコープの単一ゾーン（ユニキャストとマルチキャストの両方）を構成します。"
    },
    {
      "indent": 3,
      "text": "o There is a single zone of global scope (for both unicast and multicast) comprising all the links and interfaces in the Internet.",
      "ja": "o インターネット内のすべてのリンクとインターフェイスを含む、グローバルスコープ（ユニキャストとマルチキャストの両方）の単一のゾーンがあります。"
    },
    {
      "indent": 3,
      "text": "o The boundaries of zones of a scope other than interface-local, link-local, and global must be defined and configured by network administrators.",
      "ja": "o インターフェイスローカル、リンクローカル、グローバル以外のスコープのゾーンの境界は、ネットワーク管理者によって定義および構成する必要があります。"
    },
    {
      "indent": 3,
      "text": "Zone boundaries are relatively static features, not changing in response to short-term changes in topology. Thus, the requirement that the topology within a zone be \"connected\" is intended to include links and interfaces that may only be occasionally connected. For example, a residential node or network that obtains Internet access by dial-up to an employer's (multicast) site may be treated as part of the employer's (multicast) site-local zone even when the dial-up link is disconnected. Similarly, a failure of a router, interface, or link that causes a zone to become partitioned does not split that zone into multiple zones. Rather, the different partitions are still considered to belong to the same zone.",
      "ja": "ゾーン境界は比較的静的な特徴であり、トポロジの短期的な変化に応じて変化しません。したがって、ゾーン内のトポロジーが「接続」されるという要件には、たまに接続されたリンクとインターフェイスを含めることを目的としています。たとえば、雇用主の（マルチキャスト）サイトへのダイヤルアップによるインターネットアクセスを取得する住宅ノードまたはネットワークは、ダイヤルアップリンクが切断されている場合でも、雇用主の（マルチキャスト）サイトローカルゾーンの一部として扱われる場合があります。同様に、ゾーンを分割する原因となるルーター、インターフェイス、またはリンクの障害は、そのゾーンを複数のゾーンに分割しません。むしろ、異なるパーティションはまだ同じゾーンに属していると考えられています。"
    },
    {
      "indent": 3,
      "text": "Zones have the following additional properties:",
      "ja": "ゾーンには次の追加プロパティがあります。"
    },
    {
      "indent": 3,
      "text": "o Zone boundaries cut through nodes, not links. (Note that the global zone has no boundary, and the boundary of an interface-local zone encloses just a single interface.)",
      "ja": "o ゾーン境界は、リンクではなくノードを切り抜けます。（グローバルゾーンには境界がなく、インターフェイスローカルゾーンの境界には単一のインターフェイスのみが囲まれていることに注意してください。）"
    },
    {
      "indent": 3,
      "text": "o Zones of the same scope cannot overlap; i.e., they can have no links or interfaces in common.",
      "ja": "o 同じスコープのゾーンはオーバーラップできません。つまり、リンクやインターフェイスを共通することはできません。"
    },
    {
      "indent": 3,
      "text": "o A zone of a given scope (less than global) falls completely within zones of larger scope. That is, a smaller scope zone cannot include more topology than would any larger scope zone with which it shares any links or interfaces.",
      "ja": "o 特定のスコープのゾーン（グローバル未満）は、より大きなスコープのゾーン内に完全に収まります。つまり、より小さなスコープゾーンには、リンクまたはインターフェイスを共有するより大きなスコープゾーンよりも多くのトポロジを含めることはできません。"
    },
    {
      "indent": 3,
      "text": "o Each zone is required to be \"convex\" from a routing perspective; i.e., packets sent from one interface to any other in the same zone are never routed outside the zone. Note, however, that if a zone contains a tunneled link (e.g., an IPv6-over-IPv6 tunnel link [8]), a lower layer network of the tunnel can be located outside the zone without breaking the convexity property.",
      "ja": "o 各ゾーンは、ルーティングの観点から「凸」である必要があります。つまり、同じゾーン内の1つのインターフェイスから他のインターフェイスに送信されたパケットは、ゾーンの外側にルーティングされることはありません。ただし、ゾーンにトンネル付きリンクが含まれている場合（たとえば、IPv6-over-IPv6トンネルリンク[8]）、トンネルの下層ネットワークは、凸性プロパティを破ることなくゾーンの外側に配置できることに注意してください。"
    },
    {
      "indent": 3,
      "text": "Each interface belongs to exactly one zone of each possible scope. Note that this means that an interface belongs to a scope zone regardless of what kind of unicast address the interface has or of which multicast groups the node joins on the interface.",
      "ja": "各インターフェイスは、可能な各スコープの正確な1つのゾーンに属します。これは、インターフェイスがインターフェイスにどのようなユニキャストアドレスがあるか、ノードがインターフェイスに結合するマルチキャストグループに関係なく、スコープゾーンに属することを意味することに注意してください。"
    },
    {
      "indent": 0,
      "text": "6. Zone Indices",
      "section_title": true,
      "ja": "6. ゾーンインデックス"
    },
    {
      "indent": 3,
      "text": "Because the same non-global address may be in use in more than one zone of the same scope (e.g., the use of link-local address fe80::1 in two separate physical links) and a node may have interfaces attached to different zones of the same scope (e.g., a router normally has multiple interfaces attached to different links), a node requires an internal means to identify to which zone a non-global address belongs. This is accomplished by assigning, within the node, a distinct \"zone index\" to each zone of the same scope to which that node is attached, and by allowing all internal uses of an address to be qualified by a zone index.",
      "ja": "同じスコープの複数のゾーンで同じ非グロバルアドレスが使用されている可能性があるため（たとえば、リンクローカルアドレスFE80 :: 1の2つの別々の物理リンクの使用）、ノードには異なるゾーンに接続されている可能性があります。同じスコープ（例えば、ルーターには通常、異なるリンクに複数のインターフェイスが接続されている）のうち、ノードには、非グロバルアドレスが属するゾーンを識別するための内部手段が必要です。これは、ノード内で、そのノードが添付されている同じスコープの各ゾーンへの異なる「ゾーンインデックス」を割り当て、アドレスのすべての内部使用をゾーンインデックスによって資格を付けることを許可することによって達成されます。"
    },
    {
      "indent": 3,
      "text": "The assignment of zone indices is illustrated in the example in the figure below:",
      "ja": "ゾーンインデックスの割り当ては、以下の図の例に示されています。"
    },
    {
      "indent": 6,
      "text": " ---------------------------------------------------------------\n| a node                                                        |\n|                                                               |\n|                                                               |\n|                                                               |\n|                                                               |\n|                                                               |\n|                                                               |\n|  /--link1--\\ /--------link2--------\\ /--link3--\\ /--link4--\\  |\n|                                                               |\n|  /--intf1--\\ /--intf2--\\ /--intf3--\\ /--intf4--\\ /--intf5--\\  |\n ---------------------------------------------------------------\n        :           |           |           |           |\n        :           |           |           |           |\n        :           |           |           |           |\n    (imaginary    =================      a point-       a\n     loopback        an Ethernet         to-point     tunnel\n       link)                               link",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 19,
      "text": "Figure 1: Zone Indices Example",
      "ja": "図1：ゾーンインデックスの例"
    },
    {
      "indent": 3,
      "text": "This example node has five interfaces:",
      "ja": "この例ノードには5つのインターフェイスがあります。"
    },
    {
      "indent": 6,
      "text": "A loopback interface to the imaginary loopback link (a phantom link that goes nowhere).",
      "ja": "虚数ループバックリンクへのループバックインターフェイス（どこにも行きません）。"
    },
    {
      "indent": 6,
      "text": "Two interfaces to the same Ethernet link.",
      "ja": "同じイーサネットリンクへの2つのインターフェイス。"
    },
    {
      "indent": 6,
      "text": "An interface to a point-to-point link.",
      "ja": "ポイントツーポイントリンクへのインターフェイス。"
    },
    {
      "indent": 6,
      "text": "A tunnel interface (e.g., the abstract endpoint of an IPv6-over-IPv6 tunnel [8], presumably established over either the Ethernet or the point-to-point link).",
      "ja": "トンネルインターフェイス（たとえば、おそらくイーサネットまたはポイントツーポイントリンクのいずれかに確立されたIPv6-over-IPV6トンネル[8]の要約エンドポイント）。"
    },
    {
      "indent": 3,
      "text": "It is thus attached to five interface-local zones, identified by the interface indices 1 through 5.",
      "ja": "したがって、インターフェイスインデックス1〜5で識別される5つのインターフェイスローカルゾーンに取り付けられています。"
    },
    {
      "indent": 3,
      "text": "Because the two Ethernet interfaces are attached to the same link, the node is only attached to four link-local zones, identified by link indices 1 through 4. Also note that even if the tunnel interface is established over the Ethernet, the tunnel link gets its own link index, which is different from the index of the Ethernet link zone.",
      "ja": "2つのイーサネットインターフェイスは同じリンクに接続されているため、ノードは4つのリンクローカルゾーンにのみ接続され、リンクインデックス1から4で識別されます。イーサネットリンクゾーンのインデックスとは異なる独自のリンクインデックス。"
    },
    {
      "indent": 3,
      "text": "Each zone index of a particular scope should contain enough information to indicate the scope, so that all indices of all scopes are unique within the node and zone indices themselves can be used for a dedicated purpose. Usage of the index to identify an entry in the Management Information Base (MIB) is an example of the dedicated purpose. The actual representation to encode the scope is implementation dependent and is out of scope of this document. Within this document, indices are simply represented in a format such as \"link index 2\" for readability.",
      "ja": "特定のスコープの各ゾーンインデックスには、スコープを示すのに十分な情報を含める必要があります。そのため、すべてのスコープのすべてのインデックスがノード内で一意であり、ゾーンインデックス自体が専用の目的に使用できます。インデックスの使用管理情報ベース（MIB）のエントリを識別することは、専用の目的の例です。スコープをエンコードする実際の表現は実装依存であり、このドキュメントの範囲外です。このドキュメント内では、インデックスは、読みやすさのための「リンクインデックス2」などの形式で単純に表されます。"
    },
    {
      "indent": 3,
      "text": "The zone indices are strictly local to the node. For example, the node on the other end of the point-to-point link may well use entirely different interface and link index values for that link.",
      "ja": "ゾーンインデックスは、ノードに厳密にローカルです。たとえば、ポイントツーポイントリンクの反対側のノードは、そのリンクのまったく異なるインターフェイスとリンクインデックス値を使用する場合があります。"
    },
    {
      "indent": 3,
      "text": "An implementation should also support the concept of a \"default\" zone for each scope. And, when supported, the index value zero at each scope SHOULD be reserved to mean \"use the default zone\". Unlike other zone indices, the default index does not contain any scope, and the scope is determined by the address that the default index accompanies. An implementation may additionally define a separate default zone for each scope. Those default indices can also be used as the zone qualifier for an address for which the node is attached to only one zone; e.g., when using global addresses.",
      "ja": "実装は、各スコープの「デフォルト」ゾーンの概念もサポートする必要があります。また、サポートされる場合、各スコープでのインデックス値ゼロは、「デフォルトゾーンを使用する」を意味するように予約する必要があります。他のゾーンインデックスとは異なり、デフォルトのインデックスにはスコープが含まれておらず、スコープはデフォルトインデックスに付随するアドレスによって決定されます。実装は、各スコープの個別のデフォルトゾーンをさらに定義する場合があります。これらのデフォルトインデックスは、ノードが1つのゾーンのみに接続されているアドレスのゾーン予選としても使用できます。たとえば、グローバルアドレスを使用する場合。"
    },
    {
      "indent": 3,
      "text": "At present, there is no way for a node to automatically determine which of its interfaces belong to the same zones; e.g., the same link or the same multicast scope zone larger than interface. In the future, protocols may be developed to determine that information. In the absence of such protocols, an implementation must provide a means for manual assignment and/or reassignment of zone indices. Furthermore, to avoid performing manual configuration in most cases, an implementation should, by default, initially assign zone indices only as follows:",
      "ja": "現在、ノードが同じゾーンに属するインターフェイスのどれを自動的に決定する方法はありません。たとえば、同じリンクまたはインターフェイスよりも大きい同じマルチキャストスコープゾーン。将来的には、その情報を決定するためにプロトコルが開発される可能性があります。このようなプロトコルがない場合、実装はゾーンインデックスの手動割り当ておよび/または再割り当ての手段を提供する必要があります。さらに、ほとんどの場合、手動構成の実行を避けるために、実装はデフォルトで最初にゾーンインデックスを次のように割り当てる必要があります。"
    },
    {
      "indent": 3,
      "text": "o A unique interface index for each interface.",
      "ja": "o 各インターフェイスの一意のインターフェイスインデックス。"
    },
    {
      "indent": 3,
      "text": "o A unique link index for each interface.",
      "ja": "o 各インターフェイスの一意のリンクインデックス。"
    },
    {
      "indent": 3,
      "text": "Then manual configuration would only be necessary for the less common cases of nodes with multiple interfaces to a single link or of those with interfaces to zones of different (multicast-only) scopes.",
      "ja": "次に、単一のリンクへの複数のインターフェイスを持つノードのあまり一般的でないケース、または異なる（マルチキャストのみの）スコープのゾーンへのインターフェイスを持つノードのあまり一般的でないケースでのみ、手動構成が必要です。"
    },
    {
      "indent": 3,
      "text": "Thus, the default zone index assignments for the example node from Figure 1 would be as illustrated in Figure 2, below. Manual configuration would then be required to, for example, assign the same link index to the two Ethernet interfaces, as shown in Figure 1.",
      "ja": "したがって、図1のサンプルノードのデフォルトゾーンインデックス割り当ては、以下の図2に示すとおりです。たとえば、図1に示すように、2つのイーサネットインターフェイスに同じリンクインデックスを割り当てるために、手動構成が必要になります。"
    },
    {
      "indent": 6,
      "text": " ---------------------------------------------------------------\n| a node                                                        |\n|                                                               |\n|                                                               |\n|                                                               |\n|                                                               |\n|                                                               |\n|  /--link1--\\ /--link2--\\ /--link3--\\ /--link4--\\ /--link5--\\  |\n|                                                               |\n|  /--intf1--\\ /--intf2--\\ /--intf3--\\ /--intf4--\\ /--intf5--\\  |\n ---------------------------------------------------------------\n        :           |           |           |           |\n        :           |           |           |           |\n        :           |           |           |           |\n    (imaginary    =================      a point-       a\n     loopback        an Ethernet         to-point     tunnel\n       link)                               link",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 13,
      "text": "Figure 2: Example of Default Zone Indices",
      "ja": "図2：デフォルトゾーンインデックスの例"
    },
    {
      "indent": 3,
      "text": "As well as initially assigning zone indices, as specified above, an implementation should automatically select a default zone for each scope for which there is more than one choice, to be used whenever an address is specified without a zone index (or with a zone index of zero). For instance, in the example shown in Figure 2, the implementation might automatically select intf2 and link2 as the default zones for each of those two scopes. (One possible selection algorithm is to choose the first zone that includes an interface other than the loopback interface as the default for each scope.) A means must also be provided to assign the default zone for a scope manually, overriding any automatic assignment.",
      "ja": "上記で指定したように、最初にゾーンインデックスを割り当てるだけでなく、実装は、ゾーンインデックスなし（またはゾーンインデックスを使用してアドレスが指定されている場合はいつでも、複数の選択肢がある各スコープのデフォルトゾーンを自動的に選択する必要があります。ゼロ）。たとえば、図2に示す例では、実装は、これら2つのスコープのそれぞれのデフォルトゾーンとしてintf2とlink2を自動的に選択する場合があります。（可能な選択アルゴリズムの1つは、各スコープのデフォルトとしてループバックインターフェイス以外のインターフェイスを含む最初のゾーンを選択することです。）手動でスコープのデフォルトゾーンを割り当て、自動割り当てをオーバーライドするための手段も提供する必要があります。"
    },
    {
      "indent": 3,
      "text": "The unicast loopback address, ::1, may not be assigned to any interface other than the loopback interface. Therefore, it is recommended that, whenever ::1 is specified without a zone index or with the default zone index, it be interpreted as belonging to the loopback link-local zone, regardless of which link-local zone has been selected as the default. If this is done, then for nodes with only a single non-loopback interface (e.g., a single Ethernet interface), the common case, link-local addresses need not be qualified with a zone index. The unqualified address ::1 would always refer to the link-local zone containing the loopback interface. All other unqualified link-local addresses would refer to the link-local zone containing the non-loopback interface (as long as the default link-local zone was set to be the zone containing the non-loopback interface).",
      "ja": "ユニキャストループバックアドレス:: 1は、ループバックインターフェイス以外のインターフェイスに割り当てられない場合があります。したがって、:: 1がゾーンインデックスなしで、またはデフォルトゾーンインデックスなしで指定される場合は、デフォルトとして選択されたリンクローカルゾーンが選択されている場合、ループバックリンク局所に属すると解釈されることをお勧めします。。これが行われた場合、単一の非ループバックインターフェイスのみ（単一のイーサネットインターフェイスなど）のみのノードの場合、リンクローカルアドレスをゾーンインデックスで適格にする必要はありません。資格のないアドレス:: 1は、常にループバックインターフェイスを含むリンクローカルゾーンを参照します。他のすべての資格のないリンクローカルアドレスは、非ループバックインターフェイスを含むリンクローカルゾーンを指します（デフォルトのリンクローカルゾーンが非ループバックインターフェイスを含むゾーンに設定されている限り）。"
    },
    {
      "indent": 3,
      "text": "Because of the requirement that a zone of a given scope fall completely within zones of larger scope (see Section 5, above), two interfaces assigned to different zones of scope S must also be assigned to different zones of all scopes smaller than S. Thus, the manual assignment of distinct zone indices for one scope may require the automatic assignment of distinct zone indices for smaller scopes. For example, suppose that distinct multicast site-local indices 1 and 2 are manually assigned in Figure 1 and that site 1 contains links 1, 2, and 3, but site 2 only contains link 4. This configuration would cause the automatic creation of corresponding admin-local (i.e., multicast \"scop\" value 4) indices 1 and 2, because admin-local scope is smaller than site-local scope.",
      "ja": "特定のスコープのゾーンがより大きなスコープのゾーン内に完全に収まるという要件のため（上記のセクション5を参照）、スコープSの異なるゾーンに割り当てられた2つのインターフェイスも、Sより小さいすべてのスコープの異なるゾーンに割り当てなければなりません。、1つのスコープの個別のゾーンインデックスを手動で割り当てるには、より小さなスコープの個別のゾーンインデックスの自動割り当てが必要になる場合があります。たとえば、異なるマルチキャストサイトローカルインデックス1と2が図1に手動で割り当てられており、サイト1にはリンク1、2、および3が含まれているが、サイト2にはリンク4のみが含まれているとします。Admin-Local Scopeはサイトローカルスコープよりも小さいため、Admin-Local（つまり、マルチキャスト「Scop」値4）インデックス1と2です。"
    },
    {
      "indent": 3,
      "text": "With the above considerations, the complete set of zone indices for our example node from Figure 1, with the additional configurations here, is shown in Figure 3, below.",
      "ja": "上記の考慮事項により、図1のサンプルノードのゾーンインデックスの完全なセットを、ここに追加の構成を以下に示します。"
    },
    {
      "indent": 6,
      "text": " ---------------------------------------------------------------\n| a node                                                        |\n|                                                               |\n|                                                               |\n|                                                               |\n|                                                               |\n|                                                               |\n|  /--------------------site1--------------------\\ /--site2--\\  |\n|                                                               |\n|  /-------------------admin1--------------------\\ /-admin2--\\  |\n|                                                               |\n|  /--link1--\\ /--------link2--------\\ /--link3--\\ /--link4--\\  |\n|                                                               |\n|  /--intf1--\\ /--intf2--\\ /--intf3--\\ /--intf4--\\ /--intf5--\\  |\n ---------------------------------------------------------------\n        :           |           |           |           |\n        :           |           |           |           |\n        :           |           |           |           |\n    (imaginary    =================      a point-       a\n     loopback        an Ethernet         to-point     tunnel\n       link)                               link",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 14,
      "text": "Figure 3: Complete Zone Indices Example",
      "ja": "図3：完全なゾーンインデックスの例"
    },
    {
      "indent": 3,
      "text": "Although the above examples show the zones being assigned index values sequentially for each scope, starting at one, the zone index values are arbitrary. An implementation may label a zone with any value it chooses, as long as the index value of each zone of all scopes is unique within the node. Zero SHOULD be reserved to represent the default zone. Implementations choosing to follow the recommended basic API [10] will want to restrict their index values to those that can be represented by the sin6_scope_id field of the sockaddr_in6 structure.",
      "ja": "上記の例は、各スコープに対してインデックス値が順番に割り当てられているゾーンを示していますが、1つから始まりますが、ゾーンインデックス値は任意です。実装は、すべてのスコープの各ゾーンのインデックス値がノード内で一意である限り、選択した任意の値でゾーンにラベルを付けることができます。ゼロは、デフォルトゾーンを表すために予約する必要があります。推奨される基本的なAPI [10]に従うことを選択する実装は、SOCKADDR_IN6構造のSIN6_SCOPE_IDフィールドで表現できるものにインデックス値を制限したいと考えています。"
    },
    {
      "indent": 0,
      "text": "7. Sending Packets",
      "section_title": true,
      "ja": "7. パケットの送信"
    },
    {
      "indent": 3,
      "text": "When an upper-layer protocol sends a packet to a non-global destination address, it must have a means of identifying the intended zone to the IPv6 layer for cases in which the node is attached to more than one zone of the destination address's scope.",
      "ja": "上層層プロトコルがパケットを非グロールの宛先アドレスに送信する場合、ノードが宛先アドレスの範囲の複数のゾーンに接続されている場合、意図したゾーンをIPv6層に識別する手段が必要です。"
    },
    {
      "indent": 3,
      "text": "Although identification of an outgoing interface is sufficient to identify an intended zone (because each interface is attached to no more than one zone of each scope), in many cases that is more specific than desired. For example, when sending to a link-local unicast address from a node that has more than one interface to the intended link (an unusual configuration), the upper layer protocol may not care which of those interfaces is used for the transmission. Rather, it would prefer to leave that choice to the routing function in the IP layer. Thus, the upper-layer requires the ability to specify a zone index, when sending to a non-global, non-loopback destination address.",
      "ja": "発信インターフェイスの識別は、意図したゾーンを識別するのに十分です（各インターフェイスは各スコープの1つのゾーンに添付されているため）、多くの場合、目的よりも具体的です。たとえば、意図したリンク（異常な構成）に複数のインターフェイスを持つノードからリンクローカルユニキャストアドレスに送信する場合、上層プロトコルは、それらのインターフェイスのどれが送信に使用されるかを気にしない場合があります。むしろ、IPレイヤーのルーティング関数にその選択を残すことを好むでしょう。したがって、上層層は、非グロバルではない非ループバックの宛先アドレスに送信するときに、ゾーンインデックスを指定する機能を必要とします。"
    },
    {
      "indent": 0,
      "text": "8. Receiving Packets",
      "section_title": true,
      "ja": "8. 受信パケット"
    },
    {
      "indent": 3,
      "text": "When an upper-layer protocol receives a packet containing a non-global source or destination address, the zone to which that address pertains can be determined from the arrival interface, because the arrival interface can be attached to only one zone of the same scope as that of the address under consideration. However, it is recommended that the IP layer convey to the upper layer the correct zone indices for the arriving source and destination addresses, in addition to the arrival interface identifier.",
      "ja": "上層層プロトコルが非グローバルソースまたは宛先アドレスを含むパケットを受信した場合、そのアドレスが到着インターフェイスから決定するゾーンは、到着インターフェイスを同じスコープの1つのゾーンのみに接続できるため、到着インターフェイスから決定できます。検討中の住所のそれ。ただし、IPレイヤーは、到着インターフェイス識別子に加えて、到着したソースおよび宛先アドレスの正しいゾーンインデックスを上層に伝えることをお勧めします。"
    },
    {
      "indent": 0,
      "text": "9. Forwarding",
      "section_title": true,
      "ja": "9. 転送"
    },
    {
      "indent": 3,
      "text": "When a router receives a packet addressed to a node other than itself, it must take the zone of the destination and source addresses into account as follows:",
      "ja": "ルーターがそれ自体以外のノードにアドレス指定されたパケットを受信した場合、宛先のゾーンとソースアドレスのゾーンを次のように考慮する必要があります。"
    },
    {
      "indent": 3,
      "text": "o The zone of the destination address is determined by the scope of the address and arrival interface of the packet. The next-hop interface is chosen by looking up the destination address in a (conceptual) routing table specific to that zone (see Section 10). That routing table is restricted to refer to interfaces belonging to that zone.",
      "ja": "o 宛先アドレスのゾーンは、パケットのアドレスと到着インターフェイスの範囲によって決定されます。Next-Hopインターフェイスは、そのゾーンに固有の（概念的な）ルーティングテーブルで宛先アドレスを調べることにより選択されます（セクション10を参照）。そのルーティングテーブルは、そのゾーンに属するインターフェイスを参照することに制限されています。"
    },
    {
      "indent": 3,
      "text": "o After the next-hop interface is chosen, the zone of the source address is considered. As with the destination address, the zone of the source address is determined by the scope of the address and arrival interface of the packet. If transmitting the packet on the chosen next-hop interface would cause the packet to leave the zone of the source address, i.e., cross a zone boundary of the scope of the source address, then the packet is discarded. Additionally, if the packet's destination address is a unicast address, an ICMP Destination Unreachable message [4] with Code 2 (\"beyond scope of source address\") is sent to the source of the original packet. Note that Code 2 is currently left as unassigned in [4], but the IANA will re-assign the value for the new purpose, and [4] will be revised with this change.",
      "ja": "o Next-Hopインターフェイスが選択された後、ソースアドレスのゾーンが考慮されます。宛先アドレスと同様に、ソースアドレスのゾーンは、アドレスの範囲とパケットの到着インターフェイスによって決定されます。選択したNext-Hopインターフェイスでパケットを送信すると、パケットがソースアドレスのゾーンを離れると、つまり、ソースアドレスの範囲のゾーン境界を越えて、パケットが破棄されます。さらに、パケットの宛先アドレスがユニキャストアドレスである場合、コード2（「ソースアドレスの範囲を超えて」）を備えたICMP宛先の到達不可能なメッセージ[4]が元のパケットのソースに送信されます。現在、コード2は[4]では割り当てられていないままであることに注意してください。ただし、IANAは新しい目的の価値を再割り当てし、[4]はこの変更で改訂されます。"
    },
    {
      "indent": 3,
      "text": "Note that even if unicast site-local addresses are deprecated, the above procedure still applies to link-local addresses. Thus, if a router receives a packet with a link-local destination address that is not one of the router's own link-local addresses on the arrival link, the router is expected to try to forward the packet to the destination on that link (subject to successful determination of the destination's link-layer address via the Neighbor Discovery protocol [9]). The forwarded packet may be transmitted back through the arrival interface, or through any other interface attached to the same link.",
      "ja": "ユニキャストサイトローカルアドレスが非推奨されている場合でも、上記の手順は依然としてLink-Localアドレスに適用されることに注意してください。したがって、ルーターが到着リンクにルーター自身のリンクローカルアドレスの1つではないリンクローカル宛先アドレスを持つパケットを受信した場合、ルーターはそのリンクの宛先にパケットを転送しようと予想されます（件名近隣ディスカバリープロトコル[9]）を介した目的地のリンク層アドレスの決定を成功させるため。転送されたパケットは、到着インターフェイスを介して、または同じリンクに接続された他のインターフェイスを介して送信される場合があります。"
    },
    {
      "indent": 3,
      "text": "A node that receives a packet addressed to itself and containing a Routing Header with more than zero Segments Left (Section 4.4 of [3]) first checks the scope of the next address in the Routing Header. If the scope of the next address is smaller than the scope of the original destination address, the node MUST discard the packet. Otherwise, it swaps the original destination address with the next address in the Routing Header. Then the above forwarding rules apply as follows:",
      "ja": "それ自体にアドレス指定されたパケットを受信し、残りがゼロ以上のセグメントを超えるルーティングヘッダーを含むノード（[3]のセクション4.4）は、最初にルーティングヘッダーの次のアドレスの範囲をチェックします。次のアドレスの範囲が元の宛先アドレスの範囲よりも小さい場合、ノードはパケットを破棄する必要があります。それ以外の場合は、元の宛先アドレスをルーティングヘッダーの次のアドレスと交換します。次に、上記の転送ルールが次のように適用されます。"
    },
    {
      "indent": 3,
      "text": "o The zone of the new destination address is determined by the scope of the next address and the arrival interface of the packet. The next-hop interface is chosen as per the first bullet of the rules above.",
      "ja": "o 新しい宛先アドレスのゾーンは、次のアドレスの範囲とパケットの到着インターフェイスによって決定されます。Next-Hopインターフェイスは、上記のルールの最初の弾丸に従って選択されます。"
    },
    {
      "indent": 3,
      "text": "o After the next-hop interface is chosen, the zone of the source address is considered as per the second bullet of the rules above.",
      "ja": "o Next-Hopインターフェイスが選択された後、ソースアドレスのゾーンは、上記のルールの2番目の箇条書きに従って考慮されます。"
    },
    {
      "indent": 3,
      "text": "This check about the scope of the next address ensures that when a packet arrives at its final destination, if that destination is link-local, then the receiving node can know that the packet originated on-link. This will help the receiving node send a \"response\" packet with the final destination of the received packet as the source address without breaking its source zone.",
      "ja": "次のアドレスの範囲に関するこのチェックにより、パケットが最終目的地に到着すると、その宛先がリンクローカルである場合、受信ノードはパケットがオンリンクで発生したことを知ることができます。これにより、受信ノードは、ソースゾーンを壊すことなく、受信パケットの最終宛先とともに「応答」パケットを送信するのに役立ちます。"
    },
    {
      "indent": 3,
      "text": "Note that it is possible, though generally inadvisable, to use a Routing Header to convey a non-global address across its associated zone boundary in the previously used next address field. For example, consider a case in which a link-border node (e.g., a router) receives a packet with the destination being a link-local address, and the source address a global address. If the packet contains a Routing Header where the next address is a global address, the next-hop interface to the global address may belong to a different link than that of the original destination. This is allowed because the scope of the next address is not smaller than the scope of the original destination.",
      "ja": "一般的には容認できませんが、ルーティングヘッダーを使用して、以前に使用された次のアドレスフィールドの関連するゾーン境界に非グローバルアドレスを伝えることができることに注意してください。たとえば、リンクボーダーノード（ルーターなど）が宛先がリンクローカルアドレスであるパケットを受け取り、ソースアドレスがグローバルアドレスを受信する場合を検討してください。パケットに次のアドレスがグローバルアドレスであるルーティングヘッダーが含まれている場合、グローバルアドレスへのネクストホップインターフェイスは、元の宛先のリンクとは異なるリンクに属している可能性があります。次のアドレスの範囲は、元の宛先の範囲よりも小さくないため、これは許可されます。"
    },
    {
      "indent": 0,
      "text": "10. Routing",
      "section_title": true,
      "ja": "10. ルーティング"
    },
    {
      "indent": 3,
      "text": "Note that as unicast site-local addresses are deprecated, and link-local addresses do not need routing, the discussion in this section only applies to multicast scoped routing.",
      "ja": "ユニキャストサイトローカルアドレスは非推奨であり、Link-Localアドレスはルーティングを必要としないため、このセクションの議論はマルチキャストスコープルーティングにのみ適用されます。"
    },
    {
      "indent": 3,
      "text": "When a routing protocol determines that it is operating on a zone boundary, it MUST protect inter-zone integrity and maintain intra-zone connectivity.",
      "ja": "ルーティングプロトコルがゾーン境界で動作していると判断した場合、ゾーン間の完全性を保護し、ゾーン内の接続性を維持する必要があります。"
    },
    {
      "indent": 3,
      "text": "To maintain connectivity, the routing protocol must be able to create forwarding information for the global groups and for all the scoped groups for each of its attached zones. The most straightforward way of doing this is to create (conceptual) forwarding tables for each specific zone.",
      "ja": "接続性を維持するには、ルーティングプロトコルは、グローバルグループと、接続された各ゾーンのすべてのスコープグループの転送情報を作成できる必要があります。これを行う最も簡単な方法は、特定のゾーンごとに（概念的な）転送テーブルを作成することです。"
    },
    {
      "indent": 3,
      "text": "To protect inter-zone integrity, routers must be selective in the group information shared with neighboring routers. Routers routinely exchange routing information with neighboring routers. When a router is transmitting this routing information, it must not include any information about zones other than the zones assigned to the interface used to transmit the information.",
      "ja": "ゾーン間の完全性を保護するには、隣接するルーターと共有されるグループ情報でルーターを選択する必要があります。ルーターは、隣接するルーターとルーティング情報を日常的に交換します。ルーターがこのルーティング情報を送信している場合、情報の送信に使用されるインターフェイスに割り当てられたゾーン以外のゾーンに関する情報を含めてはなりません。"
    },
    {
      "indent": 9,
      "text": "                *                                 *\n                *                                 *\n                *   ===========    Organization X *\n                *    |       |                    *\n                *    |       |                    *\n              +-*----|-------|------+             *\n              | *  intf1   intf2    |             *\n              | *                   |             *\n              | *             intf3 ---           *\n              | *                   |             *\n              | ***********************************\n              |                     |\n              |        Router       |\n              |                     |\n**********************       **********************\n              |       *     *       |\n   Org. Y   --- intf4  *   *  intf5 ---   Org. Z\n              |       *     *       |\n**********************       **********************\n              +---------------------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 13,
      "text": "Figure 4: Multi-Organization Multicast Router",
      "ja": "図4：マルチ編成マルチキャストルーター"
    },
    {
      "indent": 3,
      "text": "As an example, the router in Figure 4 must exchange routing information on five interfaces. The information exchanged is as follows (for simplicity, multicast scopes smaller or larger than the organization scope except global are not considered here):",
      "ja": "例として、図4のルーターは、5つのインターフェイスでルーティング情報を交換する必要があります。交換される情報は次のとおりです（簡単にするために、グローバルを除く組織の範囲よりも小さいまたは大きいマルチキャストスコープは、ここでは考慮されていません）："
    },
    {
      "indent": 3,
      "text": "o Interface 1 * All global groups * All organization groups learned from Interfaces 1, 2, and 3",
      "ja": "o インターフェイス1 *すべてのグローバルグループ *インターフェイス1、2、および3から学習したすべての組織グループ"
    },
    {
      "indent": 3,
      "text": "o Interface 2 * All global groups * All organization groups learned from Interfaces 1, 2, and 3",
      "ja": "o インターフェイス2 *すべてのグローバルグループ *インターフェイス1、2、および3から学習したすべての組織グループ"
    },
    {
      "indent": 3,
      "text": "o Interface 3 * All global groups * All organization groups learned from Interfaces 1, 2, and 3",
      "ja": "o インターフェイス3 *すべてのグローバルグループ *インターフェイス1、2、および3から学習したすべての組織グループ"
    },
    {
      "indent": 3,
      "text": "o Interface 4 * All global groups * All organization groups learned from Interface 4",
      "ja": "o インターフェイス4 *すべてのグローバルグループ *インターフェイスから学習したすべての組織グループ4"
    },
    {
      "indent": 3,
      "text": "o Interface 5 * All global groups * All organization groups learned from Interface 5",
      "ja": "o インターフェイス5 *すべてのグローバルグループ *インターフェイスから学習したすべての組織グループ5"
    },
    {
      "indent": 3,
      "text": "By imposing route exchange rules, zone integrity is maintained by keeping all zone-specific routing information contained within the zone.",
      "ja": "ルート交換ルールを課すことにより、ゾーンの完全性は、ゾーン内に含まれるすべてのゾーン固有のルーティング情報を保持することにより維持されます。"
    },
    {
      "indent": 0,
      "text": "11. Textual Representation",
      "section_title": true,
      "ja": "11. テキスト表現"
    },
    {
      "indent": 3,
      "text": "As already mentioned, to specify an IPv6 non-global address without ambiguity, an intended scope zone should be specified as well. As a common notation to specify the scope zone, an implementation SHOULD support the following format:",
      "ja": "すでに述べたように、あいまいさのないIPv6非グローバルアドレスを指定するには、意図したスコープゾーンも指定する必要があります。スコープゾーンを指定する一般的な表記として、実装は次の形式をサポートする必要があります。"
    },
    {
      "indent": 12,
      "text": "<address>%<zone_id>",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "where",
      "ja": "ただし"
    },
    {
      "indent": 6,
      "text": "<address> is a literal IPv6 address,",
      "ja": "<アドレス>は文字通りのIPv6アドレスです。"
    },
    {
      "indent": 6,
      "text": "<zone_id> is a string identifying the zone of the address, and",
      "ja": "<ZONE_ID>は、アドレスのゾーンを識別する文字列であり、"
    },
    {
      "indent": 6,
      "text": "`%' is a delimiter character to distinguish between <address> and <zone_id>.",
      "ja": "`％ 'は、<アドレス>と<Zone_id>を区別するための区切り文字です。"
    },
    {
      "indent": 3,
      "text": "The following subsections describe detailed definitions, concrete examples, and additional notes of the format.",
      "ja": "次のサブセクションでは、詳細な定義、具体的な例、および形式の追加メモについて説明します。"
    },
    {
      "indent": 0,
      "text": "11.1. Non-Global Addresses",
      "section_title": true,
      "ja": "11.1. 非グローバルアドレス"
    },
    {
      "indent": 3,
      "text": "The format applies to all kinds of unicast and multicast addresses of non-global scope except the unspecified address, which does not have a scope. The format is meaningless and should not be used for global addresses. The loopback address belongs to the trivial link; i.e., the link attached to the loopback interface. Thus the format should not be used for the loopback address, either. This document does not specify the usage of the format when the <address> is the unspecified address, as the address does not have a scope. This document, however, does not prohibit an implementation from using the format for those special addresses for implementation dependent purposes.",
      "ja": "このフォーマットは、スコープがない不特定のアドレスを除き、非グロール範囲のあらゆる種類のユニキャストおよびマルチキャストアドレスに適用されます。形式は無意味であり、グローバルアドレスには使用しないでください。ループバックアドレスは、些細なリンクに属します。つまり、ループバックインターフェイスに接続されたリンク。したがって、フォーマットもループバックアドレスに使用しないでください。このドキュメントでは、<アドレス>が不特定のアドレスである場合、アドレスにはスコープがないため、形式の使用を指定しません。ただし、このドキュメントでは、実装に依存する目的でこれらの特別なアドレスに形式を使用することを実装することは禁止されていません。"
    },
    {
      "indent": 0,
      "text": "11.2. The <zone_id> Part",
      "section_title": true,
      "ja": "11.2. <ZONE_ID>パーツ"
    },
    {
      "indent": 3,
      "text": "In the textual representation, the <zone_id> part should be able to identify a particular zone of the address's scope. Although a zone index is expected to contain enough information to determine the scope and to be unique among all scopes as described in Section 6, the <zone_id> part of this format does not have to contain the scope. This is because the <address> part should specify the appropriate scope. This also means that the <zone_id> part does not have to be unique among all scopes.",
      "ja": "テキスト表現では、<Zone_id>パーツはアドレスの範囲の特定のゾーンを識別できるはずです。ゾーンインデックスには、セクション6で説明されているように、スコープを決定し、すべてのスコープの中で一意になるのに十分な情報が含まれると予想されますが、この形式の<ZONE_ID>の部分ではスコープを含める必要はありません。これは、<アドレス>パーツが適切な範囲を指定する必要があるためです。これはまた、<Zone_id>パーツがすべてのスコープの中で一意である必要がないことを意味します。"
    },
    {
      "indent": 3,
      "text": "With this loosened property, an implementation can use a convenient representation as <zone_id>. For example, to represent link index 2, the implementation can simply use \"2\" as <zone_id>, which would be more readable than other representations that contain the \"link\" scope.",
      "ja": "この緩んだプロパティを使用すると、実装は便利な表現を<Zone_id>として使用できます。たとえば、リンクインデックス2を表すために、実装は「2」を<Zone_id>として単純に使用できます。これは、「リンク」スコープを含む他の表現よりも読みやすくなります。"
    },
    {
      "indent": 3,
      "text": "When an implementation interprets the format, it should construct the \"full\" zone index, which contains the scope, from the <zone_id> part and the scope specified by the <address> part. (Remember that a zone index itself should contain the scope, as specified in Section 6.)",
      "ja": "実装がフォーマットを解釈する場合、<Zone_id>パーツからスコープを含む「フル」ゾーンインデックスと<アドレス>パーツで指定されたスコープを構築する必要があります。（セクション6で指定されているように、ゾーンインデックス自体にはスコープを含める必要があることを忘れないでください）"
    },
    {
      "indent": 3,
      "text": "An implementation SHOULD support at least numerical indices that are non-negative decimal integers as <zone_id>. The default zone index, which should typically be 0 (see Section 6), is included in the integers. When <zone_id> is the default, the delimiter characters \"%\" and <zone_id> can be omitted. Similarly, if a textual representation of an IPv6 address is given without a zone index, it should be interpreted as <address>%<default ID>, where <default ID> is the default zone index of the scope that <address> has.",
      "ja": "実装は、<Zone_id>のように非陰性小数の整数である少なくとも数値インデックスをサポートする必要があります。通常、0（セクション6を参照）であるデフォルトゾーンインデックスは、整数に含まれています。<Zone_id>がデフォルトの場合、Delimiter文字「％」と<Zone_id>は省略できます。同様に、IPv6アドレスのテキスト表現がゾーンインデックスなしで指定されている場合、<destord>％<default id>として解釈する必要があります。ここで、<デフォルトID>は<アドレス>が持っているスコープのデフォルトゾーンインデックスです。"
    },
    {
      "indent": 3,
      "text": "An implementation MAY support other kinds of non-null strings as <zone_id>. However, the strings must not conflict with the delimiter character. The precise format and semantics of additional strings is implementation dependent.",
      "ja": "実装は、他の種類の非ヌル文字列を<ZONE_ID>としてサポートする場合があります。ただし、文字列は区切り文字と矛盾してはなりません。追加の文字列の正確な形式とセマンティクスは、実装依存です。"
    },
    {
      "indent": 3,
      "text": "One possible candidate for these strings would be interface names, as interfaces uniquely disambiguate any scopes. In particular, interface names can be used as \"default identifiers\" for interfaces and links, because by default there is a one-to-one mapping between interfaces and each of those scopes as described in Section 6.",
      "ja": "これらの文字列の可能な候補の1つは、インターフェイスがスコープを独自に明確にしているため、インターフェイス名です。特に、インターフェイス名は、インターフェイスとリンクの「デフォルト識別子」として使用できます。デフォルトでは、セクション6で説明されているように、インターフェイスとそれらの各スコープの間に1対1のマッピングがあるためです。"
    },
    {
      "indent": 3,
      "text": "An implementation could also use interface names as <zone_id> for scopes larger than links, but there might be some confusion in this use. For example, when more than one interface belongs to the same (multicast) site, a user would be confused about which interface should be used. Also, a mapping function from an address to a name would encounter the same kind of problem when it prints an address with an interface name as a zone index. This document does not specify how these cases should be treated and leaves it implementation dependent.",
      "ja": "実装では、リンクよりも大きいスコープのインターフェイス名として<Zone_id>として使用することもできますが、この使用には混乱があるかもしれません。たとえば、複数のインターフェイスが同じ（マルチキャスト）サイトに属している場合、ユーザーはどのインターフェイスを使用するかについて混乱します。また、アドレスから名前までのマッピング関数は、ゾーンインデックスとしてインターフェイス名を持つアドレスを印刷すると、同じ種類の問題に遭遇します。このドキュメントでは、これらのケースをどのように扱うべきかを指定しておらず、実装に依存するままにします。"
    },
    {
      "indent": 3,
      "text": "It cannot be assumed that indices are common across all nodes in a zone (see Section 6). Hence, the format MUST be used only within a node and MUST NOT be sent on the wire unless every node that interprets the format agrees on the semantics.",
      "ja": "ゾーン内のすべてのノードでインデックスが一般的であると想定することはできません（セクション6を参照）。したがって、形式はノード内でのみ使用する必要があり、セマンティクスで形式を解釈するすべてのノードを解釈しない限り、ワイヤに送信しないでください。"
    },
    {
      "indent": 0,
      "text": "11.3. Examples",
      "section_title": true,
      "ja": "11.3. 例"
    },
    {
      "indent": 3,
      "text": "The following addresses",
      "ja": "次のアドレス"
    },
    {
      "indent": 13,
      "text": "fe80::1234 (on the 1st link of the node)\nff02::5678 (on the 5th link of the node)\nff08::9abc (on the 10th organization of the node)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "would be represented as follows:",
      "ja": "次のように表されます。"
    },
    {
      "indent": 13,
      "text": "fe80::1234%1\nff02::5678%5\nff08::9abc%10",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "(Here we assume a natural translation from a zone index to the <zone_id> part, where the Nth zone of any scope is translated into \"N\".)",
      "ja": "（ここでは、ゾーンインデックスから<ZONE_ID>パーツへの自然な翻訳を想定しています。ここでは、任意のスコープのnthゾーンが「n」に変換されます。）"
    },
    {
      "indent": 3,
      "text": "If we use interface names as <zone_id>, those addresses could also be represented as follows:",
      "ja": "インターフェイス名を<ZONE_ID>として使用する場合、これらのアドレスは次のように表現できます。"
    },
    {
      "indent": 12,
      "text": "fe80::1234%ne0\nff02::5678%pvc1.3\nff08::9abc%interface10",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "where the interface \"ne0\" belongs to the 1st link, \"pvc1.3\" belongs to the 5th link, and \"interface10\" belongs to the 10th organization.",
      "ja": "インターフェイス「NE0」が最初のリンクに属し、「PVC1.3」は5番目のリンクに属し、「Interface10」は10番目の組織に属します。"
    },
    {
      "indent": 0,
      "text": "11.4. Usage Examples",
      "section_title": true,
      "ja": "11.4. 使用例"
    },
    {
      "indent": 3,
      "text": "Applications that are supposed to be used in end hosts such as telnet, ftp, and ssh may not explicitly support the notion of address scope, especially of link-local addresses. However, an expert user (e.g., a network administrator) sometimes has to give even link-local addresses to such applications.",
      "ja": "Telnet、FTP、SSHなどの最終ホストで使用されるはずのアプリケーションは、特にLink-Localアドレスのアドレス範囲の概念を明示的にサポートしていない場合があります。ただし、エキスパートユーザー（ネットワーク管理者など）は、そのようなアプリケーションにLink-Localアドレスさえも与える必要がある場合があります。"
    },
    {
      "indent": 3,
      "text": "Here is a concrete example. Consider a multi-linked router called \"R1\" that has at least two point-to-point interfaces (links). Each of the interfaces is connected to another router, \"R2\" and \"R3\", respectively. Also assume that the point-to-point interfaces have link-local addresses only.",
      "ja": "これが具体的な例です。少なくとも2つのポイントツーポイントインターフェイス（リンク）を備えた「R1」と呼ばれるマルチリンクルーターを考えてみましょう。各インターフェイスは、それぞれ別のルーター「R2」と「R3」に接続されています。また、ポイントツーポイントインターフェイスにはリンクローカルアドレスのみがあると仮定します。"
    },
    {
      "indent": 3,
      "text": "Now suppose that the routing system on R2 hangs up and has to be reinvoked. In this situation, we may not be able to use a global address of R2, because this is routing trouble and we cannot expect to have enough routes for global reachability to R2.",
      "ja": "ここで、R2のルーティングシステムが電話を切って再爆撃する必要があると仮定します。この状況では、R2のグローバルアドレスを使用できない可能性があります。これはルーティングトラブルであり、R2へのグローバルな到達可能性に十分なルートがあるとは期待できないからです。"
    },
    {
      "indent": 3,
      "text": "Hence, we have to login R1 first and then try to login R2 by using link-local addresses. In this case, we have to give the link-local address of R2 to, for example, telnet. Here we assume the address is fe80::2.",
      "ja": "したがって、最初にR1をログインしてから、Link-Localアドレスを使用してR2をログインする必要があります。この場合、たとえばTelnetにR2のリンクローカルアドレスを指定する必要があります。ここでは、アドレスがFe80 :: 2であると仮定します。"
    },
    {
      "indent": 3,
      "text": "Note that we cannot just type",
      "ja": "入力できないことに注意してください"
    },
    {
      "indent": 12,
      "text": "% telnet fe80::2",
      "ja": "％telnet fe80 :: 2"
    },
    {
      "indent": 3,
      "text": "here, since R1 has more than one link and hence the telnet command cannot detect which link it should try to use for connecting. Instead, we should type the link-local address with the link index as follows:",
      "ja": "ここでは、R1には複数のリンクがあるため、Telnetコマンドは接続に使用しようとするリンクを検出できません。代わりに、次のように、リンクインデックスにリンクローカルアドレスを入力する必要があります。"
    },
    {
      "indent": 12,
      "text": "% telnet fe80::2%3",
      "ja": "％telnet fe80 :: 2％3"
    },
    {
      "indent": 3,
      "text": "where \"3\" after the delimiter character `%' corresponds to the link index of the point-to-point link.",
      "ja": "ここで、区切り文字「％」の後の「3」は、ポイントツーポイントリンクのリンクインデックスに対応します。"
    },
    {
      "indent": 0,
      "text": "11.5. Related API",
      "section_title": true,
      "ja": "11.5. 関連API"
    },
    {
      "indent": 3,
      "text": "An extension to the recommended basic API defines how the format for non-global addresses should be treated in library functions that translate a nodename to an address, or vice versa [11].",
      "ja": "推奨される基本的なAPIの拡張は、ノーデナムをアドレスに変換するライブラリ関数で、またはその逆に翻訳するライブラリ関数で扱う方法を定義します[11]。"
    },
    {
      "indent": 0,
      "text": "11.6. Omitting Zone Indices",
      "section_title": true,
      "ja": "11.6. ゾーンインデックスを省略します"
    },
    {
      "indent": 3,
      "text": "The format defined in this document does not intend to invalidate the original format for non-global addresses; that is, the format without the zone index portion. As described in Section 6, in some common cases with the notion of the default zone index, there can be no ambiguity about scope zones. In such an environment, the implementation can omit the \"%<zone_id>\" part. As a result, it can act as though it did not support the extended format at all.",
      "ja": "このドキュメントで定義されている形式は、非グローバルアドレスの元の形式を無効にするつもりはありません。つまり、ゾーンインデックス部分のない形式です。セクション6で説明されているように、デフォルトゾーンインデックスの概念を伴ういくつかの一般的なケースでは、スコープゾーンについて曖昧さはありません。このような環境では、実装は「％<Zone_id>」部分を省略できます。その結果、拡張形式をまったくサポートしていないかのように動作する可能性があります。"
    },
    {
      "indent": 0,
      "text": "11.7. Combinations of Delimiter Characters",
      "section_title": true,
      "ja": "11.7. デリミッター文字の組み合わせ"
    },
    {
      "indent": 3,
      "text": "There are other kinds of delimiter characters defined for IPv6 addresses. In this subsection, we describe how they should be combined with the format for non-global addresses.",
      "ja": "IPv6アドレス用に定義されている他の種類のデリミタ文字があります。このサブセクションでは、それらをグローバル以外のアドレスの形式と組み合わせる方法について説明します。"
    },
    {
      "indent": 3,
      "text": "The IPv6 addressing architecture [1] also defines the syntax of IPv6 prefixes. If the address portion of a prefix is non-global and its scope zone should be disambiguated, the address portion SHOULD be in the format. For example, a link-local prefix fe80::/64 on the second link can be represented as follows:",
      "ja": "IPv6アドレス指定アーキテクチャ[1]は、IPv6プレフィックスの構文も定義しています。接頭辞のアドレス部分がグロバル以外で、そのスコープゾーンを曖昧にしておく必要がある場合、アドレス部分は形式である必要があります。たとえば、2番目のリンクのリンクローカルプレフィックスFE80 ::/64は、次のように表現できます。"
    },
    {
      "indent": 12,
      "text": "fe80::%2/64",
      "ja": "Fe80 ::％2/64"
    },
    {
      "indent": 3,
      "text": "In this combination, it is important to place the zone index portion before the prefix length when we consider parsing the format by a name-to-address library function [11]. That is, we can first separate the address with the zone index from the prefix length, and just pass the former to the library function.",
      "ja": "この組み合わせでは、名前からアドレスへのライブラリ関数[11]で形式を解析することを検討する場合、プレフィックスの長さの前にゾーンインデックス部分を配置することが重要です。つまり、最初にアドレスをゾーンインデックスで接頭辞の長さから分離し、前者をライブラリ関数に渡すだけです。"
    },
    {
      "indent": 3,
      "text": "The preferred format for literal IPv6 addresses in URLs is also defined [12]. When a user types the preferred format for an IPv6 non-global address whose zone should be explicitly specified, the user could use the format for the non-global address combined with the preferred format.",
      "ja": "URLのリテラルIPv6アドレスの優先形式も定義されています[12]。ユーザーがゾーンを明示的に指定する必要があるIPv6非グローバルアドレスの優先形式を入力すると、ユーザーは優先形式と組み合わせた非グロバルアドレスに形式を使用できます。"
    },
    {
      "indent": 3,
      "text": "However, the typed URL is often sent on the wire, and it would cause confusion if an application did not strip the <zone_id> portion before sending. Note that the applications should not need to care about which kind of addresses they're using, much less parse or strip out the <zone_id> portion of the address.",
      "ja": "ただし、タイプされたURLはしばしばワイヤーに送信され、送信する前にアプリケーションが<ZONE_ID>部分を剥がさなかった場合に混乱を引き起こします。アプリケーションは、使用しているアドレスの種類を気にする必要はないことに注意してください。"
    },
    {
      "indent": 3,
      "text": "Also, the format for non-global addresses might conflict with the URI syntax [13], since the syntax defines the delimiter character (`%') as the escape character. This conflict would require, for example, that the <zone_id> part for zone 1 with the delimiter be represented as '%251'. It also means that we could not simply copy a non-escaped format from other sources as input to the URI parser. Additionally, if the URI parser does not convert the escaped format before passing it to a name-to-address library, the conversion will fail. All these issues would decrease the benefit of the textual representation described in this section.",
      "ja": "また、構文はデリミタ文字（ `％ '）をエスケープ文字として定義するため、非グロバルアドレスの形式はURI構文と競合する可能性があります[13]。この競合には、たとえば、区切り文字を備えたゾーン1の<Zone_id>パーツが「％251」として表されることが必要です。また、URIパーサーへの入力として、他のソースから非エスケープ形式を単にコピーできなかったことを意味します。さらに、URIパーサーが名前からアドレスへのライブラリに渡す前に脱出形式を変換しない場合、変換は失敗します。これらの問題はすべて、このセクションで説明されているテキスト表現の利点を減らします。"
    },
    {
      "indent": 3,
      "text": "Hence, this document does not specify how the format for non-global addresses should be combined with the preferred format for literal IPv6 addresses. In any case, it is recommended to use an FQDN instead of a literal IPv6 address in a URL, whenever an FQDN is available.",
      "ja": "したがって、このドキュメントでは、非グローバルアドレスの形式をリテラルIPv6アドレスの優先形式と組み合わせる方法を指定していません。いずれにせよ、FQDNが利用可能な場合はいつでも、URL内のリテラルIPv6アドレスの代わりにFQDNを使用することをお勧めします。"
    },
    {
      "indent": 0,
      "text": "12. Security Considerations",
      "section_title": true,
      "ja": "12. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "A limited scope address without a zone index has security implications and cannot be used for some security contexts. For example, a link-local address cannot be used in a traffic selector of a security association established by Internet Key Exchange (IKE) when the IKE messages are carried over global addresses. Also, a link-local address without a zone index cannot be used in access control lists.",
      "ja": "ゾーンインデックスのない限られたスコープアドレスにはセキュリティの影響があり、一部のセキュリティコンテキストには使用できません。たとえば、IKEメッセージがグローバルアドレスに掲載されている場合、インターネットキーエクスチェンジ（IKE）によって確立されたセキュリティ協会のトラフィックセレクターでは、リンクローカルアドレスを使用することはできません。また、ゾーンインデックスのないリンクローカルアドレスは、アクセス制御リストでは使用できません。"
    },
    {
      "indent": 3,
      "text": "The routing section of this document specifies a set of guidelines whereby routers can prevent zone-specific information from leaking out of each zone. If, for example, multicast site boundary routers allow site routing information to be forwarded outside of the site, the integrity of the site could be compromised.",
      "ja": "このドキュメントのルーティングセクションは、ルーターがゾーン固有の情報が各ゾーンから漏れなくなるのを防ぐことができる一連のガイドラインを指定します。たとえば、マルチキャストサイトの境界ルーターがサイトのルーティング情報をサイトの外側に転送できる場合、サイトの整合性が損なわれる可能性があります。"
    },
    {
      "indent": 3,
      "text": "Since the use of the textual representation of non-global addresses is restricted to use within a single node, it does not create a security vulnerability from outside the node. However, a malicious node might send a packet that contains a textual IPv6 non-global address with a zone index, intending to deceive the receiving node about the zone of the non-global address. Thus, an implementation should be careful when it receives packets that contain textual non-global addresses as data.",
      "ja": "非グロバルアドレスのテキスト表現の使用は、単一のノード内での使用に制限されているため、ノードの外部からセキュリティの脆弱性を作成しません。ただし、悪意のあるノードは、ゾーンインデックスを備えたテキストIPv6非グローバルアドレスを含むパケットを送信する場合があり、非グロバルアドレスのゾーンに関する受信ノードを欺くことを目的としています。したがって、テキストの非グローバルアドレスをデータとして含むパケットを受信する場合、実装は注意する必要があります。"
    },
    {
      "indent": 0,
      "text": "13. Contributors",
      "section_title": true,
      "ja": "13. 貢献者"
    },
    {
      "indent": 3,
      "text": "This document is a combination of several separate efforts. Atsushi Onoe took a significant role in one of them and deeply contributed to the content of Section 11 as a co-author of a separate proposal.",
      "ja": "このドキュメントは、いくつかの個別の努力の組み合わせです。Atushi Onoeはその1つで重要な役割を果たし、別の提案の共著者としてセクション11の内容に深く貢献しました。"
    },
    {
      "indent": 0,
      "text": "14. Acknowledgements",
      "section_title": true,
      "ja": "14. 謝辞"
    },
    {
      "indent": 3,
      "text": "Many members of the IPv6 working group provided useful comments and feedback on this document. In particular, Margaret Wasserman and Bob Hinden led the working group to make a consensus on IPv6 local addressing. Richard Draves proposed an additional rule to process Routing header containing scoped addresses. Dave Thaler and Francis Dupont gave valuable suggestions to define semantics of zone indices in terms of related API. Pekka Savola reviewed a version of the document very carefully and made detailed comments about serious problems. Steve Bellovin, Ted Hardie, Bert Wijnen, and Timothy Gleeson reviewed and helped improve the document during the preparation for publication.",
      "ja": "IPv6ワーキンググループの多くのメンバーは、このドキュメントに関する有用なコメントとフィードバックを提供しました。特に、マーガレット・ワッサーマンとボブ・ヒンデンは、ワーキンググループを主導し、IPv6ローカルアドレス指定についてコンセンサスを行いました。リチャードドラヴェスは、スコープアドレスを含むルーティングヘッダーを処理するための追加のルールを提案しました。Dave ThalerとFrancis Dupontは、関連するAPIの観点からゾーンインデックスのセマンティクスを定義するために貴重な提案をしました。Pekka Savolaは、ドキュメントのバージョンを非常に慎重にレビューし、深刻な問題について詳細なコメントをしました。Steve Bellovin、Ted Hardie、Bert Wijnen、およびTimothy Gleesonは、出版の準備中に文書の改善をレビューし、改善しました。"
    },
    {
      "indent": 0,
      "text": "15. References",
      "section_title": true,
      "ja": "15. 参考文献"
    },
    {
      "indent": 0,
      "text": "15.1. Normative References",
      "section_title": true,
      "ja": "15.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[1] Hinden, R. and S. Deering, \"Internet Protocol Version 6 (IPv6) Addressing Architecture\", RFC 3513, April 2003.",
      "ja": "[1] Hinden、R。and S. Deering、「インターネットプロトコルバージョン6（IPv6）アドレス指定アーキテクチャ」、RFC 3513、2003年4月。"
    },
    {
      "indent": 3,
      "text": "[2] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[2] Bradner、S。、「要件レベルを示すためにRFCで使用するためのキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[3] Deering, S. and R. Hinden, \"Internet Protocol, Version 6 (IPv6) Specification\", RFC 2460, December 1998.",
      "ja": "[3] Deering、S。and R. Hinden、「インターネットプロトコル、バージョン6（IPv6）仕様」、RFC 2460、1998年12月。"
    },
    {
      "indent": 3,
      "text": "[4] Conta, A. and S. Deering, \"Internet Control Message Protocol (ICMPv6) for the Internet Protocol Version 6 (IPv6) Specification\", RFC 2463, December 1998.",
      "ja": "[4] Conta、A。およびS. Deering、「インターネットプロトコルバージョン6（IPv6）仕様のインターネット制御メッセージプロトコル（ICMPV6）」、RFC 2463、1998年12月。"
    },
    {
      "indent": 0,
      "text": "15.2. Informative References",
      "section_title": true,
      "ja": "15.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[5] Huitema, C. and B. Carpenter, \"Deprecating Site Local Addresses\", RFC 3879, September 2004.",
      "ja": "[5] Huitema、C。and B. Carpenter、「現場の地元住所」、RFC 3879、2004年9月。"
    },
    {
      "indent": 3,
      "text": "[6] Draves, R., \"Default Address Selection for Internet Protocol version 6 (IPv6)\", RFC 3484, February 2003.",
      "ja": "[6] Draves、R。、「インターネットプロトコルバージョン6（IPv6）のデフォルトアドレス選択」、RFC 3484、2003年2月。"
    },
    {
      "indent": 3,
      "text": "[7] Cheshire, S., Aboba, B., and E. Guttman, \"Dynamic Configuration of Link-Local IPv4 Addresses\", Work in Progress.",
      "ja": "[7] Cheshire、S.、Aboba、B。、およびE. Guttman、「Link-Local IPv4アドレスの動的な構成」、進行中の作業。"
    },
    {
      "indent": 3,
      "text": "[8] Conta, A. and S. Deering, \"Generic Packet Tunneling in IPv6 Specification\", RFC 2473, December 1998.",
      "ja": "[8] Conta、A。and S. Deering、「IPv6仕様における一般的なパケットトンネル」、RFC 2473、1998年12月。"
    },
    {
      "indent": 3,
      "text": "[9] Narten, T., Nordmark, E., and W. Simpson, \"Neighbor Discovery for IP Version 6 (IPv6)\", RFC 2461, December 1998.",
      "ja": "[9] Narten、T.、Nordmark、E。、およびW. Simpson、「IPバージョン6の近隣発見（IPv6）」、RFC 2461、1998年12月。"
    },
    {
      "indent": 3,
      "text": "[10] Gilligan, R., Thomson, S., Bound, J., McCann, J., and W. Stevens, \"Basic Socket Interface Extensions for IPv6\", RFC 3493, February 2003.",
      "ja": "[10] Gilligan、R.、Thomson、S.、Bound、J.、McCann、J。、およびW. Stevens、「IPv6用の基本ソケットインターフェイス拡張」、RFC 3493、2003年2月。"
    },
    {
      "indent": 3,
      "text": "[11] Gilligan, R., \"Scoped Address Extensions to the IPv6 Basic Socket API\", Work in Progress, July 2002.",
      "ja": "[11] Gilligan、R。、「Scoped Address Extensions in the IPv6 Basic Socket API」、2002年7月、進行中の作業。"
    },
    {
      "indent": 3,
      "text": "[12] Hinden, R., Carpenter, B., and L. Masinter, \"Format for Literal IPv6 Addresses in URL's\", RFC 2732, December 1999.",
      "ja": "[12] Hinden、R.、Carpenter、B。、およびL. Masinter、「URLのリテラルIPv6アドレスの形式」、RFC 2732、1999年12月。"
    },
    {
      "indent": 3,
      "text": "[13] Berners-Lee, T., Fielding, R., and L. Masinter, \"Uniform Resource Identifiers (URI): Generic Syntax\", RFC 3986, January 2005.",
      "ja": "[13] Berners-Lee、T.、Fielding、R。、およびL. Masinter、「ユニフォームリソース識別子（URI）：Generic Syntax」、RFC 3986、2005年1月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Stephen E. Deering Cisco Systems, Inc. 170 West Tasman Drive San Jose, CA 95134-1706 USA",
      "ja": "Stephen E. Deering Cisco Systems、Inc。170 West Tasman Drive San Jose、CA 95134-1706 USA"
    },
    {
      "indent": 3,
      "text": "Brian Haberman Johns Hopkins University Applied Physics Laboratory 11100 Johns Hopkins Road Laurel, MD 20723-6099 USA",
      "ja": "ブライアン・ハーバーマン・ジョンズ・ホプキンス大学応用物理学研究所11100ジョンズ・ホプキンス・ロード・ローレル、メリーランド州20723-6099 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1-443-778-1319\nEMail: brian@innovationslab.net",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Tatuya Jinmei Corporate Research & Development Center, Toshiba Corporation 1 Komukai Toshiba-cho, Saiwai-ku Kawasaki-shi, Kanagawa 212-8582 Japan",
      "ja": "Tatuya Jinmei Corporate Research＆Development Center、Toshiba Corporation 1 Komukai Toshiba-Cho、Saiwai-Ku Kawasaki-Shi、Kanagawa 212-8582日本"
    },
    {
      "indent": 3,
      "text": "Phone: +81-44-549-2230\nFax:   +81-44-520-1841\nEMail: jinmei@isl.rdc.toshiba.co.jp",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Erik Nordmark 17 Network Circle Menlo Park, CA 94025 USA",
      "ja": "Erik Nordmark 17 Network Circle Menlo Park、CA 94025 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 650 786 2921 Fax: +1 650 786 5896 EMail: Erik.Nordmark@sun.com Brian D. Zill Microsoft Research One Microsoft Way Redmond, WA 98052-6399 USA",
      "ja": "電話：1 650 786 2921ファックス：1 650 786 5896メール：erik.nordmark@sun.com Brian D. Zill Microsoft Research One Microsoft Way Redmond、WA 98052-6399 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1-425-703-3568\nFax:   +1-425-936-7329\nEMail: bzill@microsoft.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "ja": "Copyright（c）The Internet Society（2005）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "この文書は、BCP 78に含まれる権利、ライセンス、および制限の対象となり、そこに記載されている場合を除き、著者はすべての権利を保持しています。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "このドキュメントとここに含まれる情報は、「現状のまま」に基づいて提供されています。また、貢献者、彼/彼女が代表する組織（もしあれば）が後援する組織、インターネット協会とインターネット工学タスクフォースは、すべての保証、明示的または明示的、またはすべての保証を否認します。本書の情報の使用が、商品性または特定の目的に対する適合性の権利または黙示的な保証を侵害しないという保証を含むがこれらに限定されないことを含む。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、知的財産権またはその他の権利の有効性または範囲に関して、この文書に記載されている技術の実装または使用、またはそのような権利に基づくライセンスがどの程度であるかについての使用に関連すると主張する可能性があるという立場はありません。利用可能になります。また、そのような権利を特定するために独立した努力をしたことも表明していません。RFCドキュメントの権利に関する手順に関する情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IETF事務局に行われたIPR開示のコピーと、利用可能にするライセンスの保証、またはこの仕様の実装者またはユーザーによるそのような独自の権利の使用のための一般的なライセンスまたは許可を取得しようとする試みの結果を取得できます。http://www.ietf.org/iprのIETFオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、関心のある当事者に、著作権、特許、または特許出願、またはこの基準を実装するために必要な技術をカバーする可能性のあるその他の独自の権利を注意深く招待するよう招待しています。ietf-ipr@ietf.orgのIETFへの情報をお問い合わせください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFCエディター機能の資金は現在、インターネット協会によって提供されています。"
    }
  ]
}