{
  "title": {
    "text": "RFC 4569 - Internet Assigned Number Authority (IANA) Registration of the Message Media Feature Tag",
    "ja": "RFC 4569 - メッセージメディア特徴タグのインターネット割り当て番号機関（IANA）登録"
  },
  "number": 4569,
  "created_at": "2019-10-23 10:38:38.913476+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                       G. Camarillo\nRequest for Comments: 4569                                      Ericsson\nCategory: Informational                                        July 2006",
      "raw": true
    },
    {
      "indent": 8,
      "text": "Internet Assigned Numbers Authority (IANA) Registration\n            of the Message Media Feature Tag",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモはインターネットコミュニティのための情報を提供します。それはどんな種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2006).",
      "ja": "著作権（C）インターネット協会（2006）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document registers with the IANA a new media feature tag associated with the 'message' media type. This media feature tag indicates that a particular device supports 'message' as a streaming media type. Media feature tags can be used to route calls to devices that support certain features.",
      "ja": "この文書は、IANAで「メッセージのメディアタイプに関連付けられた新しいメディア特徴タグを登録します。このメディア特徴タグは、特定のデバイスがストリーミングメディアタイプとして「メッセージ」をサポートしていることを示しています。メディア特徴タグは、特定の機能をサポートするデバイスへのコールをルーティングするために使用することができます。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Security Considerations .........................................2\n3. IANA Considerations .............................................2\n4. Acknowledgements ................................................3\n5. Normative References ............................................3",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "The Session Description Protocol (SDP) specification [5] defines a number of media types. RFC 3840 [4] registers with the IANA media feature tags associated with all those media types except for the 'message' media type. This document registers a new media feature tag that is associated with the 'message' media type.",
      "ja": "セッション記述プロトコル（SDP）仕様[5]メディアタイプの数を定義します。 RFC 3840 [4]「メッセージ」メディアタイプを除くすべてのそれらのメディアタイプに関連付けられたIANAメディア特徴タグに登録します。この文書では、「メッセージのメディアタイプに関連付けられている新しいメディア特徴タグを登録します。"
    },
    {
      "indent": 3,
      "text": "The reason why the 'message' media feature tag was not registered by RFC 3840 was that when RFC 3840 was published, the SDP specification was RFC 2327 [1]. RFC 3840 defined media feature tags for all the media types defined by RFC 2327. However, RFC 2327 did not define the 'message' media type. This media type was defined by the revised SDP specification [5], which was published after RFC 3840.",
      "ja": "「メッセージ」メディア特徴タグは、RFC 3840によって登録されなかった理由は、RFC 3840が発行されたときに、SDP仕様はRFC 2327であったことであった[1]。 RFC 2327で定義されたすべてのメディアタイプのためのRFC 3840個のに定義メディア特徴タグはしかし、RFC 2327には、「メッセージのメディアタイプを定義していませんでした。このメディアタイプは、RFC 3840の後に公開された改訂されたSDP仕様[5]で定義されました。"
    },
    {
      "indent": 0,
      "text": "2. Security Considerations",
      "section_title": true,
      "ja": "2.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "Section 11.1 of RFC 3840 [4] discusses security considerations related to the use of media feature tags.",
      "ja": "RFC 3840のセクション11.1は、[4]メディア特徴タグの使用に関連するセキュリティの考慮事項について説明します。"
    },
    {
      "indent": 0,
      "text": "3. IANA Considerations",
      "section_title": true,
      "ja": "3. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This specification registers a new media feature tag in the SIP [3] tree per the procedures defined in RFC 2506 [2] and RFC 3840 [4].",
      "ja": "この仕様は、RFC 2506で定義された手順に従ってSIP [3]ツリーに新しいメディア特徴タグを登録する[2]及びRFC 3840 [4]。"
    },
    {
      "indent": 6,
      "text": "Media feature tag name: sip.message",
      "ja": "メディアフィーチャータグ名：sip.message"
    },
    {
      "indent": 6,
      "text": "ASN.1 Identifier: 21",
      "ja": "ASN.1識別子：21"
    },
    {
      "indent": 6,
      "text": "Summary of the media feature indicated by this tag: This feature tag indicates that the device supports message as a streaming media type.",
      "ja": "このタグで示されるメディアフィーチャーの概要：このフィーチャータグは、デバイスがストリーミングメディアタイプとしてメッセージをサポートしていることを示しています。"
    },
    {
      "indent": 6,
      "text": "Values appropriate for use with this feature tag: Boolean.",
      "ja": "ブール：この機能タグで使用するための適切な値。"
    },
    {
      "indent": 6,
      "text": "The feature tag is intended primarily for use in the following applications, protocols, services, or negotiation mechanisms: This feature tag is most useful in a communications application for describing the capabilities of a device, such as a phone or PDA.",
      "ja": "フィーチャータグは、主に以下のアプリケーション、プロトコル、サービス、または交渉メカニズムにおける使用のために意図されています。この機能タグは、このような携帯電話やPDAなどのデバイスの機能を記述するための通信アプリケーションに最も有用です。"
    },
    {
      "indent": 6,
      "text": "Examples of typical use: Routing a call to a phone that can support session-based instant messaging.",
      "ja": "典型的な使用例：セッションベースのインスタントメッセージングをサポートすることができます携帯電話に通話をルーティング。"
    },
    {
      "indent": 6,
      "text": "Related standards or documents: RFC 4569.",
      "ja": "関連する規格または文書：RFC 4569。"
    },
    {
      "indent": 6,
      "text": "Security Considerations: Security considerations for this media feature tag are discussed in Section 11.1 of RFC 3840.",
      "ja": "セキュリティの考慮：このメディアフィーチャータグに関するセキュリティの考慮事項は、RFC 3840のセクション11.1で議論されています。"
    },
    {
      "indent": 0,
      "text": "4. Acknowledgements",
      "section_title": true,
      "ja": "4.謝辞"
    },
    {
      "indent": 3,
      "text": "The need for this registration was discussed with Jonathan Rosenberg, Colin Perkins, and Jon Peterson.",
      "ja": "この登録の必要はジョナサンローゼンバーグ、コリンパーキンス、およびジョンピーターソンで議論されました。"
    },
    {
      "indent": 0,
      "text": "5. Normative References",
      "section_title": true,
      "ja": "5.引用規格"
    },
    {
      "indent": 3,
      "text": "[1] Handley, M. and V. Jacobson, \"SDP: Session Description Protocol\", RFC 2327, April 1998.",
      "ja": "[1]ハンドレー、M.およびV. Jacobsonの \"SDP：セッション記述プロトコル\"、RFC 2327、1998年4月。"
    },
    {
      "indent": 3,
      "text": "[2] Holtman, K., Mutz, A., and T. Hardie, \"Media Feature Tag Registration Procedure\", BCP 31, RFC 2506, March 1999.",
      "ja": "[2] Holtman、K.、MUTZ、A.、およびT.ハーディ、 \"メディア特徴タグの登録手順\"、BCP 31、RFC 2506、1999年3月。"
    },
    {
      "indent": 3,
      "text": "[3] Rosenberg, J., Schulzrinne, H., Camarillo, G., Johnston, A., Peterson, J., Sparks, R., Handley, M., and E. Schooler, \"SIP: Session Initiation Protocol\", RFC 3261, June 2002.",
      "ja": "[3]ローゼンバーグ、J.、Schulzrinneと、H.、カマリロ、G.、ジョンストン、A.、ピーターソン、J.、スパークス、R.、ハンドレー、M.、およびE.学生、 \"SIP：セッション開始プロトコル\" 、RFC 3261、2002年6月。"
    },
    {
      "indent": 3,
      "text": "[4] Rosenberg, J., Schulzrinne, H., and P. Kyzivat, \"Indicating User Agent Capabilities in the Session Initiation Protocol (SIP)\", RFC 3840, August 2004.",
      "ja": "[4]ローゼンバーグ、J.、Schulzrinneと、H.、およびP. Kyzivatを、RFC 3840、2004年8月 \"セッション開始プロトコル（SIP）におけるユーザエージェント能力を示します\"。"
    },
    {
      "indent": 3,
      "text": "[5] Handley, M., Jacobson, V., and C. Perkins, \"SDP: Session Description Protocol\", RFC 4566, July 2006.",
      "ja": "[5]ハンドリー、M.、ヤコブソン、V.、およびC.パーキンス、 \"SDP：セッション記述プロトコル\"、RFC 4566、2006年7月。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Gonzalo Camarillo Ericsson Hirsalantie 11 Jorvas 02420 Finland",
      "ja": "ゴンサロ・カマリロエリクソンHirsalantie 11 Jorvas 02420フィンランド"
    },
    {
      "indent": 3,
      "text": "EMail: Gonzalo.Camarillo@ericsson.com",
      "ja": "メールアドレス：Gonzalo.Camarillo@ericsson.com"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2006).",
      "ja": "著作権（C）インターネット協会（2006）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "この文書では、BCP 78に含まれる権利と許可と制限の適用を受けており、その中の記載を除いて、作者は彼らのすべての権利を保有します。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とCONTRIBUTOR「そのまま」、ORGANIZATION HE / SHEが表すまたはインターネットソサエティおよびインターネット・エンジニアリング・タスク・フォース放棄すべての保証、明示または、（もしあれば）後援ISに設けられています。黙示、情報の利用は、特定の目的に対する権利または商品性または適合性の黙示の保証を侵害しない任意の保証含むがこれらに限定されません。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、本書またはそのような権限下で、ライセンスがたりないかもしれない程度に記載された技術の実装や使用に関係すると主張される可能性があります任意の知的財産権やその他の権利の有効性または範囲に関していかなる位置を取りません利用可能です。またそれは、それがどのような権利を確認する独自の取り組みを行ったことを示すものでもありません。 RFC文書の権利に関する手続きの情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IPRの開示のコピーが利用できるようにIETF事務局とライセンスの保証に行われた、または本仕様の実装者または利用者がそのような所有権の使用のための一般的なライセンスまたは許可を取得するために作られた試みの結果を得ることができますhttp://www.ietf.org/iprのIETFのオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、その注意にこの標準を実装するために必要とされる技術をカバーすることができる任意の著作権、特許または特許出願、またはその他の所有権を持ってすべての利害関係者を招待します。 ietf-ipr@ietf.orgのIETFに情報を記述してください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is provided by the IETF Administrative Support Activity (IASA).",
      "ja": "RFCエディタ機能のための資金は、IETF管理サポート活動（IASA）によって提供されます。"
    }
  ]
}