{
  "title": {
    "text": "RFC 4448 - Encapsulation Methods for Transport of Ethernet over MPLS Networks",
    "ja": "RFC 4448 - MPLSネットワーク上のイーサネットの輸送のためのカプセル化方法"
  },
  "number": 4448,
  "created_at": "2023-07-05 09:17:16.965262+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                    L. Martini, Ed.\nRequest for Comments: 4448                                      E. Rosen\nCategory: Standards Track                            Cisco Systems, Inc.\n                                                             N. El-Aawar\n                                             Level 3 Communications, LLC\n                                                                G. Heron\n                                                                 Tellabs\n                                                              April 2006",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Encapsulation Methods for Transport of Ethernet over MPLS Networks",
      "ja": "MPLSネットワーク上のイーサネットの輸送のためのカプセル化方法"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "このドキュメントは、インターネットコミュニティのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態とステータスについては、「インターネット公式プロトコル標準」（STD 1）の現在のエディションを参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2006).",
      "ja": "Copyright（c）The Internet Society（2006）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "An Ethernet pseudowire (PW) is used to carry Ethernet/802.3 Protocol Data Units (PDUs) over an MPLS network. This enables service providers to offer \"emulated\" Ethernet services over existing MPLS networks. This document specifies the encapsulation of Ethernet/802.3 PDUs within a pseudowire. It also specifies the procedures for using a PW to provide a \"point-to-point Ethernet\" service.",
      "ja": "Ethernet Pseudowire（PW）は、MPLSネットワークを介してイーサネット/802.3プロトコルデータユニット（PDU）を運ぶために使用されます。これにより、サービスプロバイダーは、既存のMPLSネットワークで「エミュレート」イーサネットサービスを提供できます。このドキュメントは、擬似ワイヤ内のイーサネット/802.3 PDUのカプセル化を指定します。また、PWを使用して「ポイントツーポイントイーサネット」サービスを提供する手順を指定します。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n2. Specification of Requirements ...................................6\n3. Applicability Statement .........................................6\n4. Details Specific to Particular Emulated Services ................7\n   4.1. Ethernet Tagged Mode .......................................7\n   4.2. Ethernet Raw Mode ..........................................8\n   4.3. Ethernet-Specific Interface Parameter LDP Sub-TLV ..........8\n   4.4. Generic Procedures .........................................9\n        4.4.1. Raw Mode vs. Tagged Mode ............................9\n        4.4.2. MTU Management on the PE/CE Links ..................11\n        4.4.3. Frame Ordering .....................................11\n        4.4.4. Frame Error Processing .............................11\n        4.4.5. IEEE 802.3x Flow Control Interworking ..............11\n   4.5. Management ................................................12\n   4.6. The Control Word ..........................................12\n   4.7. QoS Considerations ........................................13\n5. Security Considerations ........................................14\n6. PSN MTU Requirements ...........................................14\n7. Normative References ...........................................15\n8. Informative References .........................................15\n9. Significant Contributors .......................................17\nAppendix A. Interoperability Guidelines ...........................20\n   A.1. Configuration Options .....................................20\n   A.2. IEEE 802.3x Flow Control Considerations ...................21\nAppendix B. QoS Details ...........................................21\n   B.1. Adaptation of 802.1Q CoS to PSN CoS .......................22\n   B.2. Drop Precedence ...........................................23",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "An Ethernet pseudowire (PW) allows Ethernet/802.3 [802.3] Protocol Data Units (PDUs) to be carried over a Multi-Protocol Label Switched [MPLS-ARCH] network. In addressing the issues associated with carrying an Ethernet PDU over a packet switched network (PSN), this document assumes that a pseudowire (PW) has been set up by using a control protocol such as the one as described in [PWE3-CTRL]. The design of Ethernet pseudowire described in this document conforms to the pseudowire architecture described in [RFC3985]. It is also assumed in the remainder of this document that the reader is familiar with RFC 3985.",
      "ja": "Ethernet Pseudowire（PW）により、Ethernet/802.3 [802.3]プロトコルデータユニット（PDU）は、[MPLS-ARCH]ネットワークを切り替えたマルチプロトコルラベルを介して運ばれます。パケットスイッチネットワーク（PSN）を介してイーサネットPDUを運ぶことに関連する問題に対処する際に、このドキュメントは、[PWE3-CTRL]に記載されているようなコントロールプロトコルを使用して、擬似ワイヤ（PW）がセットアップされていることを前提としています。このドキュメントで説明されているイーサネットの擬似ワイヤの設計は、[RFC3985]に記載されている擬似化アーキテクチャに適合しています。また、このドキュメントの残りの部分では、読者がRFC 3985に精通していると想定されています。"
    },
    {
      "indent": 3,
      "text": "The Pseudowire Emulation Edge-to-Edge (PWE3) Ethernet PDU consists of the Destination Address, Source Address, Length/Type, MAC Client Data, and padding extracted from a MAC frame as a concatenated octet sequence in their original order [PDU].",
      "ja": "Pseudowire Emulation Edge-to-Edge（PWE3）Ethernet PDUは、宛先アドレス、ソースアドレス、長さ/タイプ、Macクライアントデータ、およびMacフレームから抽出されたパディングで構成されており、元の順序[PDU]の連結されたオクテットシーケンスとして抽出されます。"
    },
    {
      "indent": 3,
      "text": "In addition to the Ethernet PDU format used within the pseudowire, this document discusses:",
      "ja": "Pseudowire内で使用されているイーサネットPDU形式に加えて、このドキュメントで説明します。"
    },
    {
      "indent": 6,
      "text": "- Procedures for using a PW in order to provide a pair of Customer Edge (CE) routers with an emulated (point-to-point) Ethernet service, including the procedures for the processing of Provider Edge (PE)-bound and CE-bound Ethernet PDUs [RFC3985]",
      "ja": "- PWを使用して、プロバイダーエッジ（PE）バウンドおよびCEバウンドイーサネットの処理手順を含む、エミュレート（ポイントツーポイント）イーサネットサービスを備えた顧客エッジ（CE）ルーターを提供するための手順pdus [rfc3985]"
    },
    {
      "indent": 6,
      "text": "- Ethernet-specific quality of service (QoS) and security considerations",
      "ja": "- イーサネット固有のサービス品質（QOS）およびセキュリティ上の考慮事項"
    },
    {
      "indent": 6,
      "text": "- Inter-domain transport considerations for Ethernet PW",
      "ja": "- イーサネットPWのドメイン間輸送に関する考慮事項"
    },
    {
      "indent": 3,
      "text": "The following two figures describe the reference models that are derived from [RFC3985] to support the Ethernet PW emulated services.",
      "ja": "次の2つの図は、イーサネットPWエミュレートサービスをサポートするために[RFC3985]から派生した参照モデルを説明しています。"
    },
    {
      "indent": 6,
      "text": "      |<-------------- Emulated Service ---------------->|\n      |                                                  |\n      |          |<------- Pseudowire ------->|          |\n      |          |                            |          |\n      |          |    |<-- PSN Tunnel -->|    |          |\n      | PW End   V    V                  V    V  PW End  |\n      V Service  +----+                  +----+  Service V\n+-----+    |     | PE1|==================| PE2|     |    +-----+\n|     |----------|............PW1.............|----------|     |\n| CE1 |    |     |    |                  |    |     |    | CE2 |\n|     |----------|............PW2.............|----------|     |\n+-----+  ^ |     |    |==================|    |     | ^  +-----+\n      ^  |       +----+                  +----+     | |  ^\n      |  |   Provider Edge 1         Provider Edge 2  |  |\n      |  |                                            |  |\nCustomer |                                            | Customer\nEdge 1   |                                            | Edge 2\n         |                                            |\n         |                                            |\nAttachment Circuit (AC)                    Attachment Circuit (AC)\nnative Ethernet service                    native Ethernet service",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 9,
      "text": "Figure 1: PWE3 Ethernet/VLAN Interface Reference Configuration",
      "ja": "図1：PWE3イーサネット/VLANインターフェイス参照構成"
    },
    {
      "indent": 3,
      "text": "The \"emulated service\" shown in Figure 1 is, strictly speaking, a bridged LAN; the PEs have MAC interfaces, consume MAC control frames, etc. However, the procedures specified herein only support the case in which there are two CEs on the \"emulated LAN\". Hence we refer to this service as \"emulated point-to-point Ethernet\". Specification of the procedures for using pseudowires to emulate LANs with more than two CEs are out of the scope of the current document.",
      "ja": "図1に示す「エミュレートサービス」は、厳密に言えば、橋渡しされたLANです。PESにはMACインターフェイスがあり、MACコントロールフレームを消費します。ただし、ここで指定された手順は、「エミュレートされたLAN」に2つのCESがあるケースのみをサポートしています。したがって、このサービスを「エミュレートポイントツーポイントイーサネット」と呼びます。Pseudowiresを使用して2つ以上のCEでLANをエミュレートする手順の仕様は、現在のドキュメントの範囲外です。"
    },
    {
      "indent": 3,
      "text": "+-------------+                                +-------------+\n|  Emulated   |                                |  Emulated   |\n|  Ethernet   |                                |  Ethernet   |\n| (including  |         Emulated Service       | (including  |\n|  VLAN)      |<==============================>|  VLAN)      |\n|  Services   |                                |  Services   |\n+-------------+           Pseudowire           +-------------+\n|Demultiplexer|<==============================>|Demultiplexer|\n+-------------+                                +-------------+\n|    PSN      |            PSN Tunnel          |    PSN      |\n|   MPLS      |<==============================>|   MPLS      |\n+-------------+                                +-------------+\n|  Physical   |                                |  Physical   |\n+-----+-------+                                +-----+-------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 9,
      "text": "Figure 2: Ethernet PWE3 Protocol Stack Reference Model",
      "ja": "図2：イーサネットPWE3プロトコルスタックリファレンスモデル"
    },
    {
      "indent": 3,
      "text": "For the purpose of this document, PE1 will be defined as the ingress router, and PE2 as the egress router. A layer 2 PDU will be received at PE1, encapsulated at PE1, transported, decapsulated at PE2, and transmitted out on the attachment circuit of PE2.",
      "ja": "このドキュメントの目的のために、PE1はイングレスルーターとして、PE2は出力ルーターとして定義されます。層2 PDUはPE1で受信され、PE1でカプセル化され、輸送され、PE2で脱カプセル化され、PE2の付着回路に送信されます。"
    },
    {
      "indent": 3,
      "text": "An Ethernet PW emulates a single Ethernet link between exactly two endpoints. The mechanisms described in this document are agnostic to that which is beneath the \"Pseudowire\" level in Figure 2, concerning itself only with the \"Emulated Service\" portion of the stack.",
      "ja": "イーサネットPWは、正確に2つのエンドポイント間の単一のイーサネットリンクをエミュレートします。このドキュメントに記載されているメカニズムは、図2の「擬似」レベルの下にあるものとは異なり、スタックの「エミュレートされたサービス」部分とのみです。"
    },
    {
      "indent": 3,
      "text": "The following reference model describes the termination point of each end of the PW within the PE:",
      "ja": "次の参照モデルは、PE内のPWの各端の終了点について説明します。"
    },
    {
      "indent": 3,
      "text": "        +-----------------------------------+\n        |                PE                 |\n+---+   +-+  +-----+  +------+  +------+  +-+\n|   |   |P|  |     |  |PW ter|  | PSN  |  |P|\n|   |<==|h|<=| NSP |<=|minati|<=|Tunnel|<=|h|<== From PSN\n|   |   |y|  |     |  |on    |  |      |  |y|\n| C |   +-+  +-----+  +------+  +------+  +-+\n| E |   |                                   |\n|   |   +-+  +-----+  +------+  +------+  +-+\n|   |   |P|  |     |  |PW ter|  | PSN  |  |P|\n|   |==>|h|=>| NSP |=>|minati|=>|Tunnel|=>|h|==> To PSN\n|   |   |y|  |     |  |on    |  |      |  |y|\n+---+   +-+  +-----+  +------+  +------+  +-+\n        |                                   |\n        +-----------------------------------+\n                    ^         ^         ^\n                    |         |         |\n                    A         B         C",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 11,
      "text": "Figure 3: PW Reference Diagram",
      "ja": "図3：PW参照図"
    },
    {
      "indent": 3,
      "text": "The PW terminates at a logical port within the PE, defined at point B in the above diagram. This port provides an Ethernet MAC service that will deliver each Ethernet frame that is received at point A, unaltered, to the point A in the corresponding PE at the other end of the PW.",
      "ja": "PWは、上記の図のポイントBで定義されているPE内の論理ポートで終了します。このポートは、PWの反対側の対応するPEのポイントAでポイントAで受信される各イーサネットフレームを配信するイーサネットMACサービスを提供します。"
    },
    {
      "indent": 3,
      "text": "The Native Service Processing (NSP) function includes frame processing that is required for the Ethernet frames that are forwarded to the PW termination point. Such functions may include stripping, overwriting or adding VLAN tags, physical port multiplexing and demultiplexing, PW-PW bridging, L2 encapsulation, shaping, policing, etc. These functions are specific to the Ethernet technology, and may not be required for the PW emulation service.",
      "ja": "ネイティブサービス処理（NSP）関数には、PW終端ポイントに転送されるイーサネットフレームに必要なフレーム処理が含まれます。このような機能には、ストリッピング、上書きまたはVLANタグの追加、物理的なポートの多重化と再脱直、PW-PWブリッジング、L2カプセル化、シェーピング、ポリシングなどが含まれます。これらの機能はイーサネットテクノロジーに固有であり、PWエミュレーションには必要ない場合があります。サービス。"
    },
    {
      "indent": 3,
      "text": "The points to the left of A, including the physical layer between the CE and PE, and any adaptation (NSP) functions between it and the PW terminations, are outside of the scope of PWE3 and are not defined here.",
      "ja": "Aの左側のポイント（CEとPEの間の物理層、およびITとPW終端の間の任意の適応（NSP）が機能する）は、PWE3の範囲外であり、ここでは定義されていません。"
    },
    {
      "indent": 3,
      "text": "\"PW Termination\", between A and B, represents the operations for setting up and maintaining the PW, and for encapsulating and decapsulating the Ethernet frames as necessary to transmit them across the MPLS network.",
      "ja": "AとBの間の「PW終了」は、PWのセットアップと維持、およびMPLSネットワーク全体でそれらを送信するために必要に応じてイーサネットフレームをカプセル化および脱カプセル化するための操作を表します。"
    },
    {
      "indent": 3,
      "text": "An Ethernet PW operates in one of two modes: \"raw mode\" or \"tagged mode\". In tagged mode, each frame MUST contain at least one 802.1Q [802.1Q] VLAN tag, and the tag value is meaningful to the NSPs at the two PW termination points. That is, the two PW termination points must have some agreement (signaled or manually configured) on how to process the tag. On a raw mode PW, a frame MAY contain an 802.1Q VLAN tag, but if it does, the tag is not meaningful to the NSPs, and passes transparently through them.",
      "ja": "イーサネットPWは、「RAWモード」または「タグ付きモード」の2つのモードのいずれかで動作します。タグ付きモードでは、各フレームには少なくとも1つの802.1Q [802.1Q] VLANタグを含める必要があり、タグ値は2つのPW終端ポイントのNSPにとって意味があります。つまり、2つのPW終端ポイントには、タグの処理方法に関する合意（信号または手動で構成された）が必要です。RAWモードPWでは、フレームには802.1Q VLANタグが含まれている場合がありますが、もしそうなら、タグはNSPにとって意味がなく、それらを透過的に通過します。"
    },
    {
      "indent": 3,
      "text": "Additional terminology relevant to pseudowires and Layer 2 Virtual Private Networking may be found in [RFC4026].",
      "ja": "擬似動物とレイヤー2の仮想プライベートネットワーキングに関連する追加の用語は、[RFC4026]に記載されている場合があります。"
    },
    {
      "indent": 0,
      "text": "2. Specification of Requirements",
      "section_title": true,
      "ja": "2. 要件の仕様"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "ja": "この文書のキーワード \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", および \"OPTIONAL\" はRFC 2119 [RFC2119]で説明されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "3. Applicability Statement",
      "section_title": true,
      "ja": "3. アプリケーションステートメント"
    },
    {
      "indent": 3,
      "text": "The Ethernet PW emulation allows a service provider to offer a \"port to port\" Ethernet-based service across an MPLS packet switched network (PSN) while the Ethernet VLAN PW emulation allows an \"Ethernet VLAN to VLAN\" based service across an MPLS packet switched network (PSN).",
      "ja": "イーサネットPWエミュレーションにより、サービスプロバイダーは、MPLSパケットスイッチネットワーク（PSN）にわたって「ポート」イーサネットベースのサービスを提供できます。ネットワーク（PSN）。"
    },
    {
      "indent": 3,
      "text": "The Ethernet or Ethernet VLAN PW has the following characteristics in relationship to the respective native service:",
      "ja": "イーサネットまたはイーサネットVLAN PWには、それぞれのネイティブサービスとの関係に次の特性があります。"
    },
    {
      "indent": 6,
      "text": "- An Ethernet PW connects two Ethernet ACs while an Ethernet VLAN PW connects two Ethernet VLAN ACs, supporting bidirectional transport of variable length Ethernet frames. The ingress Native Service Processing (NSP) function strips the preamble and frame check sequence (FCS) from the Ethernet frame and transports the frame in its entirety across the PW. This is done regardless of the presence of the 802.1Q tag in the frame. The egress NSP function receives the Ethernet frame from the PW and regenerates the preamble or FCS before forwarding the frame to the attachment circuit. Since the FCS is not transported across either Ethernet or Ethernet VLAN PWs, payload integrity transparency may be lost. The OPTIONAL method described in [FCS] can be used to achieve payload integrity transparency on Ethernet or Ethernet VLAN PWs.",
      "ja": "- イーサネットPWは2つのイーサネットACSを接続し、イーサネットVLAN PWは2つのイーサネットVLAN ACSを接続し、可変長さイーサネットフレームの双方向輸送をサポートします。Ingress Native Service Processing（NSP）機能は、イーサネットフレームからプリアンブルとフレームチェックシーケンス（FCS）をストリップし、PW全体にフレーム全体を輸送します。これは、フレーム内の802.1Qタグの存在に関係なく行われます。出力NSP関数は、PWからイーサネットフレームを受信し、アタッチメント回路にフレームを転送する前にプリアンブルまたはFCSを再生します。FCSはイーサネットまたはイーサネットVLAN PWのいずれにも輸送されないため、ペイロードの整合性の透明性が失われる可能性があります。[FCS]で説明されているオプションの方法は、イーサネットまたはイーサネットVLAN PWSのペイロード整合性の透明性を実現するために使用できます。"
    },
    {
      "indent": 6,
      "text": "- For an Ethernet VLAN PW, VLAN tag rewrite can be achieved by NSP at the egress PE, which is outside the scope of this document.",
      "ja": "- イーサネットVLAN PWの場合、VLANタグの書き換えは、このドキュメントの範囲外の出力PEでNSPによって達成できます。"
    },
    {
      "indent": 6,
      "text": "- The Ethernet or Ethernet VLAN PW only supports homogeneous Ethernet frame type across the PW; both ends of the PW must be either tagged or untagged. Heterogeneous frame type support achieved with NSP functionality is outside the scope of this document.",
      "ja": "- イーサネットまたはイーサネットVLAN PWは、PW全体の均一なイーサネットフレームタイプのみをサポートしています。PWの両端は、タグ付けされていないか、塗装されていない必要があります。NSP機能で達成される不均一なフレームタイプのサポートは、このドキュメントの範囲外です。"
    },
    {
      "indent": 6,
      "text": "- Ethernet port or Ethernet VLAN status notification is provided using the PW Status TLV in the Label Distribution Protocol (LDP) status notification message. Loss of connectivity between PEs can be detected by the LDP session closing, or by using [VCCV] mechanisms. The PE can convey these indications back to its attached Remote System.",
      "ja": "- イーサネットポートまたはイーサネットVLANステータス通知は、ラベル分布プロトコル（LDP）ステータス通知メッセージのPWステータスTLVを使用して提供されます。PE間の接続の喪失は、LDPセッションの閉鎖または[VCCV]メカニズムを使用することで検出できます。PEは、これらの適応症を添付のリモートシステムに伝えることができます。"
    },
    {
      "indent": 6,
      "text": "- The maximum frame size that can be supported is limited by the PSN MTU minus the MPLS header size, unless fragmentation and reassembly are used [FRAG].",
      "ja": "- サポートできる最大フレームサイズは、断片化と再組み立てが使用されない限り、PSN MTUからMPLSヘッダーサイズを差し引いて制限されます[frag]。"
    },
    {
      "indent": 6,
      "text": "- The packet switched network may reorder, duplicate, or silently drop packets. Sequencing MAY be enabled in the Ethernet or Ethernet VLAN PW to detect lost, duplicate, or out-of-order packets on a per-PW basis.",
      "ja": "- パケットスイッチネットワークは、パケットを再注文、複製、または静かにドロップする場合があります。シーケンスをイーサネットまたはイーサネットVLAN PWで有効にして、PWごとに失われた、複製、または順序外のパケットを検出できます。"
    },
    {
      "indent": 6,
      "text": "- The faithfulness of an Ethernet or Ethernet VLAN PW may be increased by leveraging Quality of Service features of the PEs and the underlying PSN. (See Section 4.7, \"QoS Considerations\".)",
      "ja": "- イーサネットまたはイーサネットVLAN PWの忠実さは、PESおよび基礎となるPSNのサービス品質機能を活用することにより、増加する可能性があります。（セクション4.7を参照してください、「QoS考慮事項」。）"
    },
    {
      "indent": 0,
      "text": "4. Details Specific to Particular Emulated Services",
      "section_title": true,
      "ja": "4. 特定のエミュレートサービスに固有の詳細"
    },
    {
      "indent": 0,
      "text": "4.1. Ethernet Tagged Mode",
      "section_title": true,
      "ja": "4.1. イーサネットタグ付きモード"
    },
    {
      "indent": 3,
      "text": "The Ethernet frame will be encapsulated according to the procedures defined later in this document for tagged mode. It should be noted that if the VLAN identifier is modified by the egress PE, the Ethernet spanning tree protocol might fail to work properly. If this issue is of significance, the VLAN identifier MUST be selected in such a way that it matches on the attachment circuits at both ends of the PW.",
      "ja": "イーサネットフレームは、タグ付きモードのこのドキュメントの後半で定義された手順に従ってカプセル化されます。VLAN識別子が出力PEによって変更された場合、イーサネットスパニングツリープロトコルが適切に機能しない可能性があることに注意する必要があります。この問題が重要な場合、VLAN識別子は、PWの両端のアタッチメント回路で一致するように選択する必要があります。"
    },
    {
      "indent": 3,
      "text": "If the PE detects a failure on the Ethernet physical port, or the port is administratively disabled, it MUST send a PW status notification message for all PWs associated with the port.",
      "ja": "PEがイーサネットの物理ポートの障害を検出する場合、またはポートが管理上無効になっている場合、ポートに関連付けられたすべてのPWにPWステータス通知メッセージを送信する必要があります。"
    },
    {
      "indent": 3,
      "text": "This mode uses service-delimiting tags to map input Ethernet frames to respective PWs and corresponds to PW type 0x0004 \"Ethernet Tagged Mode\" [IANA].",
      "ja": "このモードでは、サービスを削除するタグを使用して、入力イーサネットフレームをそれぞれのPWSにマッピングし、PWタイプ0x0004「イーサネットタグ付きモード」[IANA]に対応します。"
    },
    {
      "indent": 0,
      "text": "4.2. Ethernet Raw Mode",
      "section_title": true,
      "ja": "4.2. イーサネット生モード"
    },
    {
      "indent": 3,
      "text": "The Ethernet frame will be encapsulated according to the procedures defined later in this document for raw mode. If the PE detects a failure on the Ethernet input port, or the port is administratively disabled, the PE MUST send an appropriate PW status notification message to the corresponding remote PE.",
      "ja": "イーサネットフレームは、このドキュメントでRAWモードのために定義された手順に従ってカプセル化されます。PEがイーサネット入力ポートの障害を検出する場合、またはポートが管理上無効になっている場合、PEは対応するリモートPEに適切なPWステータス通知メッセージを送信する必要があります。"
    },
    {
      "indent": 3,
      "text": "In this mode, all Ethernet frames received on the attachment circuit of PE1 will be transmitted to PE2 on a single PW. This service corresponds to PW type 0x0005 \"Ethernet\" [IANA].",
      "ja": "このモードでは、PE1のアタッチメント回路で受信したすべてのイーサネットフレームは、単一のPWでPE2に送信されます。このサービスは、PWタイプ0x0005「イーサネット」[IANA]に対応しています。"
    },
    {
      "indent": 0,
      "text": "4.3. Ethernet-Specific Interface Parameter LDP Sub-TLV",
      "section_title": true,
      "ja": "4.3. イーサネット固有のインターフェイスパラメーターLDP Sub-TLV"
    },
    {
      "indent": 3,
      "text": "This LDP sub-Type Length Value [LDP] specifies interface-specific parameters. When applicable, it MUST be used to validate that the PEs, and the ingress and egress ports at the edges of the circuit, have the necessary capabilities to interoperate with each other. The Interface parameter TLV is defined in [PWE3-CTRL], the IANA registry with initial values for interface parameter sub-TLV types is defined in [IANA], but the Ethernet-specific interface parameters are specified as follows:",
      "ja": "このLDPサブタイプの長さ値[LDP]は、インターフェイス固有のパラメーターを指定します。該当する場合は、回路の端にあるPES、および侵入ポートと出口ポートが互いに相互運用するために必要な機能があることを検証するために使用する必要があります。インターフェイスパラメーターTLVは[PWE3-CTRL]で定義され、インターフェイスパラメーターサブTLV型の初期値を持つIANAレジストリは[IANA]で定義されますが、イーサネット固有のインターフェイスパラメーターは次のように指定されています。"
    },
    {
      "indent": 6,
      "text": "- 0x06 Requested VLAN ID Sub-TLV",
      "ja": "- 0x06は、VLAN ID sub-tlvを要求しました"
    },
    {
      "indent": 8,
      "text": "An Optional 16-bit value indicating the requested VLAN ID. This parameter MUST be used by a PE that is incapable of rewriting the 802.1Q Ethernet VLAN tag on output. If the ingress PE receives this request, it MUST rewrite the VLAN ID contained inside the VLAN Tag at the input to match the requested VLAN ID. If this is not possible, and the VLAN ID does not already match the configured ingress VLAN ID, the PW MUST not be enabled. This parameter is applicable only to PW type 0x0004.",
      "ja": "要求されたVLAN IDを示すオプションの16ビット値。このパラメーターは、出力で802.1QイーサネットVLANタグを書き換えることができないPEで使用する必要があります。Ingress PEがこのリクエストを受信した場合、要求されたVLAN IDと一致するように、入力のVLANタグ内に含まれるVLAN IDを書き換える必要があります。これが不可能であり、VLAN IDが構成されたIngress VLAN IDとまだ一致していない場合、PWを有効にする必要はありません。このパラメーターは、PWタイプ0x0004にのみ適用されます。"
    },
    {
      "indent": 0,
      "text": "4.4. Generic Procedures",
      "section_title": true,
      "ja": "4.4. 一般的な手順"
    },
    {
      "indent": 3,
      "text": "When the NSP/Forwarder hands a frame to the PW termination function:",
      "ja": "NSP/フォワーダーがPW終端関数にフレームを渡すとき："
    },
    {
      "indent": 6,
      "text": "- The preamble (if any) and FCS are stripped off.",
      "ja": "- 前文（もしあれば）とFCは剥奪されます。"
    },
    {
      "indent": 6,
      "text": "- The control word as defined in Section 4.6, \"The Control Word\", is, if necessary, prepended to the resulting frame. The conditions under which the control word is or is not used are specified below.",
      "ja": "- セクション4.6で定義されているコントロールワード「コントロールワード」は、必要に応じて、結果のフレームに加えられます。制御単語が使用されている、または使用されていない条件を以下に指定します。"
    },
    {
      "indent": 6,
      "text": "- The proper pseudowire demultiplexer (PW Label) is prepended to the resulting packet.",
      "ja": "- 適切なPseudowire Demultiplexer（PWラベル）は、結果のパケットに加えられます。"
    },
    {
      "indent": 6,
      "text": "- The proper tunnel encapsulation is prepended to the resulting packet.",
      "ja": "- 適切なトンネルのカプセル化は、結果のパケットに加えられます。"
    },
    {
      "indent": 6,
      "text": "- The packet is transmitted.",
      "ja": "- パケットが送信されます。"
    },
    {
      "indent": 3,
      "text": "The way in which the proper tunnel encapsulation and pseudowire demultiplexer is chosen depends on the procedures that were used to set up the pseudowire.",
      "ja": "適切なトンネルのカプセル化と擬似ワイヤーのデマルティプレクサーが選択される方法は、擬似ワイヤのセットアップに使用された手順に依存します。"
    },
    {
      "indent": 3,
      "text": "The tunnel encapsulation depends on how the MPLS PSN is set up. This can include no label, one label, or multiple labels. The proper pseudowire demultiplexer is an MPLS label whose value is determined by the PW setup and maintenance protocols.",
      "ja": "トンネルのカプセル化は、MPLS PSNのセットアップ方法によって異なります。これには、ラベルなし、1つのラベル、または複数のラベルが含まれます。適切なPseudowire Demultiplexerは、PWのセットアップとメンテナンスプロトコルによって値が決定されるMPLSラベルです。"
    },
    {
      "indent": 3,
      "text": "When a packet arrives over a PW, the tunnel encapsulation and PW demultiplexer are stripped off. If the control word is present, it is processed and stripped off. The resulting frame is then handed to the Forwarder/NSP. Regeneration of the FCS is considered to be an NSP responsibility.",
      "ja": "パケットがPWに到着すると、トンネルのカプセル化とPW Demultiplexerが剥奪されます。コントロールワードが存在する場合、処理されて剥奪されます。結果のフレームは、フォワーダー/NSPに渡されます。FCSの再生は、NSPの責任と見なされます。"
    },
    {
      "indent": 0,
      "text": "4.4.1. Raw Mode vs. Tagged Mode",
      "section_title": true,
      "ja": "4.4.1. RAWモードとタグ付きモード"
    },
    {
      "indent": 3,
      "text": "When the PE receives an Ethernet frame, and the frame has a VLAN tag, we can distinguish two cases:",
      "ja": "PEがイーサネットフレームを受信し、フレームにVLANタグがある場合、2つのケースを区別できます。"
    },
    {
      "indent": 6,
      "text": "1. The tag is service-delimiting. This means that the tag was placed on the frame by some piece of service provider-operated equipment, and the tag is used by the service provider to distinguish the traffic. For example, LANs from different customers might be attached to the same service provider switch, which applies VLAN tags to distinguish one customer's traffic from another's, and then forwards the frames to the PE.",
      "ja": "1. タグはサービス削除です。これは、タグがいくつかのサービスプロバイダーで操作された機器によってフレームに配置され、タグはサービスプロバイダーがトラフィックを区別するために使用されることを意味します。たとえば、さまざまな顧客のLANが同じサービスプロバイダースイッチに接続される場合があります。これは、VLANタグを適用して、ある顧客のトラフィックを別の顧客のトラフィックを区別し、フレームをPEに転送します。"
    },
    {
      "indent": 6,
      "text": "2. The tag is not service-delimiting. This means that the tag was placed in the frame by a piece of customer equipment, and is not meaningful to the PE.",
      "ja": "2. タグはサービス削除ではありません。これは、タグが顧客機器によってフレームに配置され、PEにとって意味がないことを意味します。"
    },
    {
      "indent": 3,
      "text": "Whether or not the tag is service-delimiting is determined by local configuration on the PE.",
      "ja": "タグがサービス削除であるかどうかは、PEのローカル構成によって決定されます。"
    },
    {
      "indent": 3,
      "text": "If an Ethernet PW is operating in raw mode, service-delimiting tags are NEVER sent over the PW. If a service-delimiting tag is present when the frame is received from the attachment circuit by the PE, it MUST be stripped (by the NSP) from the frame before the frame is sent to the PW.",
      "ja": "イーサネットPWがRAWモードで動作している場合、サービスを削除するタグはPWを介して送信されることはありません。フレームがPEによってアタッチメント回路からフレームを受信したときにサービスを削除するタグが存在する場合、フレームがPWに送信される前に、フレームから（NSPによって）削除する必要があります。"
    },
    {
      "indent": 3,
      "text": "If an Ethernet PW is operating in tagged mode, every frame sent on the PW MUST have a service-delimiting VLAN tag. If the frame as received by the PE from the attachment circuit does not have a service-delimiting VLAN tag, the PE must prepend the frame with a dummy VLAN tag before sending the frame on the PW. This is the default operating mode. This is the only REQUIRED mode.",
      "ja": "イーサネットPWがタグ付きモードで動作している場合、PWで送信されるすべてのフレームには、サービスを決定するVLANタグが必要です。アタッチメント回路からPEが受信したフレームにサービスを削除するVLANタグがない場合、PEはPWにフレームを送信する前にダミーVLANタグでフレームを準備する必要があります。これはデフォルトの動作モードです。これが唯一の必要なモードです。"
    },
    {
      "indent": 3,
      "text": "In both modes, non-service-delimiting tags are passed transparently across the PW as part of the payload. It should be noted that a single Ethernet packet may contain more than one tag. At most, one of these tags may be service-delimiting. In any case, the NSP function may only inspect the outermost tag for the purpose of adapting the Ethernet frame to the pseudowire.",
      "ja": "両方のモードで、ペイロードの一部として、非サービスを削除するタグがPWに透過的に渡されます。単一のイーサネットパケットには複数のタグが含まれている場合があることに注意してください。せいぜい、これらのタグの1つはサービス削除です。いずれにせよ、NSP関数は、イーサネットフレームを擬似ワイヤに適応させる目的でのみ、最も外側のタグを検査することができます。"
    },
    {
      "indent": 3,
      "text": "In both modes, the service-delimiting tag values have only local significance, i.e., are meaningful only at a particular PE-CE interface. When tagged mode is used, the PE that receives a frame from the PW may rewrite the tag value, or may strip the tag entirely, or may leave the tag unchanged, depending on its configuration. When raw mode is used, the PE that receives a frame may or may not need to add a service-delimiting tag before transmitting the frame on the attachment circuit; however, it MUST not rewrite or remove any tags that are already present.",
      "ja": "両方のモードで、サービスを削減するタグ値は局所的な重要性のみを持っています。つまり、特定のPE-CEインターフェイスでのみ意味があります。タグ付けされたモードを使用すると、PWからフレームを受信するPEは、タグ値を書き換えたり、タグを完全に剥がすことがあります。また、構成に応じてタグを変更しない場合があります。RAWモードを使用すると、フレームを受信するPEは、アタッチメント回路にフレームを送信する前に、サービスを削除するタグを追加する必要がある場合としない場合があります。ただし、すでに存在しているタグを書き換えたり削除したりしてはなりません。"
    },
    {
      "indent": 3,
      "text": "The following table illustrates the operations that might be performed at input from the attachment circuit:",
      "ja": "次の表は、アタッチメント回路からの入力で実行される可能性のある操作を示しています。"
    },
    {
      "indent": 3,
      "text": "+-----------------------------------------------------------+\n|       Tag-> |  service delimiting | non service delimiting|\n|-------------+---------------------+-----------------------|\n|   Raw Mode  | 1st VLAN Tag Removed| no operation performed|\n|-------------+---------------------+-----------------------|\n| Tagged Mode | NO OP or Tag Added  |     Tag Added         |\n+-----------------------------------------------------------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "4.4.2. MTU Management on the PE/CE Links",
      "section_title": true,
      "ja": "4.4.2. PE/CEリンクのMTU管理"
    },
    {
      "indent": 3,
      "text": "The Ethernet PW MUST NOT be enabled unless it is known that the MTUs of the CE-PE links are the same at both ends of the PW. If an egress router receives an encapsulated layer 2 PDU whose payload length (i.e., the length of the PDU itself without any of the encapsulation headers) exceeds the MTU of the destination layer 2 interface, the PDU MUST be dropped.",
      "ja": "CE-PEリンクのMTUがPWの両端で同じであることがわかっていない限り、イーサネットPWを有効にしてはなりません。出力ルーターがカプセル化されたレイヤー2 PDUを受信し、そのペイロード長（つまり、カプセル化ヘッダーのいずれかのないPDU自体の長さ）が宛先レイヤー2インターフェイスのMTUを超える場合、PDUをドロップする必要があります。"
    },
    {
      "indent": 0,
      "text": "4.4.3. Frame Ordering",
      "section_title": true,
      "ja": "4.4.3. フレームの順序付け"
    },
    {
      "indent": 3,
      "text": "In general, applications running over Ethernet do not require strict frame ordering. However, the IEEE definition of 802.3 [802.3] requires that frames from the same conversation in the context of link aggregation (clause 43) are delivered in sequence. Moreover, the PSN cannot (in the general case) be assumed to provide or to guarantee frame ordering. An Ethernet PW can, through use of the control word, provide strict frame ordering. If this option is enabled, any frames that get misordered by the PSN will be dropped or reordered by the receiving PW endpoint. If strict frame ordering is a requirement for a particular PW, this option MUST be enabled.",
      "ja": "一般に、イーサネットを介して実行されるアプリケーションでは、厳格なフレームの順序付けは必要ありません。ただし、802.3 [802.3]のIEEE定義では、リンク集約のコンテキスト（43項）のコンテキストで同じ会話からのフレームが順番に配信されることが必要です。さらに、PSNは（一般的な場合）フレームの順序付けを提供または保証すると想定することはできません。イーサネットPWは、コントロールワードを使用することで、厳格なフレームの順序付けを提供できます。このオプションが有効になっている場合、PSNによって誤った順序付けられるフレームは、受信PWエンドポイントによって削除または再注文されます。厳密なフレーム順序が特定のPWの要件である場合、このオプションを有効にする必要があります。"
    },
    {
      "indent": 0,
      "text": "4.4.4. Frame Error Processing",
      "section_title": true,
      "ja": "4.4.4. フレームエラー処理"
    },
    {
      "indent": 3,
      "text": "An encapsulated Ethernet frame traversing a pseudowire may be dropped, corrupted, or delivered out-of-order. As described in [PWE3-REQ], frame loss, corruption, and out-of-order delivery are considered to be a \"generalized bit error\" of the pseudowire. PW frames that are corrupted will be detected at the PSN layer and dropped.",
      "ja": "擬似ワイヤを走行するカプセル化されたイーサネットフレームは、注文外にドロップ、破損、または配信される場合があります。[PWE3-REQ]で説明されているように、フレームの損失、腐敗、および秩序外の配信は、擬似ワイヤの「一般化されたビット誤差」と見なされます。破損したPWフレームは、PSNレイヤーで検出され、ドロップされます。"
    },
    {
      "indent": 3,
      "text": "At the ingress of the PW, the native Ethernet frame error processing mechanisms MUST be enabled. Therefore, if a PE device receives an Ethernet frame containing hardware-level Cyclic Redundancy Check (CRC) errors, framing errors, or a runt condition, the frame MUST be discarded on input. Note that defining this processing is part of the NSP function and is outside the scope of this document.",
      "ja": "PWの侵入では、ネイティブのイーサネットフレームエラー処理メカニズムを有効にする必要があります。したがって、PEデバイスがハードウェアレベルの環状冗長チェック（CRC）エラー、フレーミングエラー、またはRunt条件を含むイーサネットフレームを受信する場合、入力時にフレームを破棄する必要があります。この処理を定義することは、NSP関数の一部であり、このドキュメントの範囲外であることに注意してください。"
    },
    {
      "indent": 0,
      "text": "4.4.5. IEEE 802.3x Flow Control Interworking",
      "section_title": true,
      "ja": "4.4.5. IEEE 802.3xフロー制御インターワーキング"
    },
    {
      "indent": 3,
      "text": "In a standard Ethernet network, the flow control mechanism is optional and typically configured between the two nodes on a point-to-point link (e.g., between the CE and the PE). IEEE 802.3x PAUSE frames MUST NOT be carried across the PW. See Appendix A for notes on CE-PE flow control.",
      "ja": "標準のイーサネットネットワークでは、フロー制御メカニズムはオプションであり、通常、ポイントツーポイントリンク上の2つのノード間で構成されます（たとえば、CEとPEの間）。IEEE 802.3x PauseフレームをPWを介して運んではいけません。CE-PEフロー制御に関するメモについては、付録Aを参照してください。"
    },
    {
      "indent": 0,
      "text": "4.5. Management",
      "section_title": true,
      "ja": "4.5. 管理"
    },
    {
      "indent": 3,
      "text": "The Ethernet PW management model follows the general PW management model defined in [RFC3985] and [PWE3-MIB]. Many common PW management facilities are provided here, with no additional Ethernet specifics necessary. Ethernet-specific parameters are defined in an additional MIB module, [PW-MIB].",
      "ja": "イーサネットPW管理モデルは、[RFC3985]および[PWE3-MIB]で定義されている一般的なPW管理モデルに従います。多くの一般的なPW管理施設がここに提供されており、追加のイーサネットの詳細は必要ありません。イーサネット固有のパラメーターは、追加のMIBモジュール[PW-MIB]で定義されます。"
    },
    {
      "indent": 0,
      "text": "4.6. The Control Word",
      "section_title": true,
      "ja": "4.6. コントロールワード"
    },
    {
      "indent": 3,
      "text": "The control word defined in this section is based on the Generic PW MPLS Control Word as defined in [PWE3-CW]. It provides the ability to sequence individual frames on the PW, avoidance of equal-cost multiple-path load-balancing (ECMP) [RFC2992], and Operations and Management (OAM) mechanisms including VCCV [VCCV].",
      "ja": "このセクションで定義されているコントロールワードは、[PWE3-CW]で定義されている一般的なPW MPLSコントロールワードに基づいています。PWで個々のフレームをシーケンスする機能、等コストの多重パス負荷分散（ECMP）[RFC2992]の回避、およびVCCV [VCCV]を含む運用および管理（OAM）メカニズムを提供します。"
    },
    {
      "indent": 3,
      "text": "[PWE3-CW] states, \"If a PW is sensitive to packet misordering and is being carried over an MPLS PSN that uses the contents of the MPLS payload to select the ECMP path, it MUST employ a mechanism which prevents packet misordering.\" This is necessary because ECMP implementations may examine the first nibble after the MPLS label stack to determine whether the labelled packet is IP or not. Thus, if the source MAC address of an Ethernet frame carried over the PW without a control word present begins with 0x4 or 0x6, it could be mistaken for an IPv4 or IPv6 packet. This could, depending on the configuration and topology of the MPLS network, lead to a situation where all packets for a given PW do not follow the same path. This may increase out-of-order frames on a given PW, or cause OAM packets to follow a different path than actual traffic (see Section 4.4.3, \"Frame Ordering\").",
      "ja": "[PWE3-CW]は、「PWがパケットの誤用に敏感であり、MPLSペイロードの内容を使用してECMPパスを選択するMPLS PSNの上に運ばれている場合、パケットの誤順を防ぐメカニズムを使用する必要があります。」これは、ECMP実装がMPLSラベルスタックの後の最初のナブルを調べて、ラベル付きパケットがIPであるかどうかを判断する可能性があるためです。したがって、コントロールワードの存在なしにPWのソースMACアドレスが0x4または0x6で始まる場合、IPv4またはIPv6パケットと間違えられる可能性があります。これは、MPLSネットワークの構成とトポロジに応じて、特定のPWのすべてのパケットが同じパスに従わない状況につながる可能性があります。これにより、特定のPWの注文外のフレームが増加するか、OAMパケットが実際のトラフィックとは異なるパスに従うことがあります（セクション4.4.3、「フレームの順序付け」を参照）。"
    },
    {
      "indent": 3,
      "text": "The features that the control word provides may not be needed for a given Ethernet PW. For example, ECMP may not be present or active on a given MPLS network, strict frame sequencing may not be required, etc. If this is the case, the control word provides little value and is therefore optional. Early Ethernet PW implementations have been deployed that do not include a control word or the ability to process one if present. To aid in backwards compatibility, future implementations MUST be able to send and receive frames without the control word present.",
      "ja": "制御ワードが提供する機能は、特定のイーサネットPWには必要ない場合があります。たとえば、特定のMPLSネットワークにECMPが存在したりアクティブになったりしない場合があり、厳密なフレームシーケンスは必要ない場合があります。これが当てはまる場合、コントロールワードはほとんど値を提供しないため、オプションです。コントロールワードや存在する場合は1つを処理する能力を含まない初期のイーサネットPW実装が展開されています。逆方向の互換性を支援するには、将来の実装は、コントロールワードが存在せずにフレームを送信および受信できる必要があります。"
    },
    {
      "indent": 3,
      "text": "In all cases, the egress PE MUST be aware of whether the ingress PE will send a control word over a specific PW. This may be achieved by configuration of the PEs, or by signaling, as defined in [PWE3-CTRL].",
      "ja": "すべての場合において、出口PEは、入り口PEが特定のPWに対してコントロールワードを送信するかどうかを認識する必要があります。これは、[PWE3-CTRL]で定義されているように、PEの構成またはシグナリングによって達成される場合があります。"
    },
    {
      "indent": 3,
      "text": "The control word is defined as follows:",
      "ja": "コントロールワードは次のように定義されています。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|0 0 0 0|   Reserved            |       Sequence Number         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "In the above diagram, the first 4 bits MUST be set to 0 to indicate PW data. The rest of the first 16 bits are reserved for future use. They MUST be set to 0 when transmitting, and MUST be ignored upon receipt.",
      "ja": "上記の図では、PWデータを示すために最初の4ビットを0に設定する必要があります。最初の16ビットの残りは、将来の使用のために予約されています。送信時には0に設定する必要があり、受領時に無視する必要があります。"
    },
    {
      "indent": 3,
      "text": "The next 16 bits provide a sequence number that can be used to guarantee ordered frame delivery. The processing of the sequence number field is OPTIONAL.",
      "ja": "次の16ビットは、順序付けられたフレーム配信を保証するために使用できるシーケンス番号を提供します。シーケンス番号フィールドの処理はオプションです。"
    },
    {
      "indent": 3,
      "text": "The sequence number space is a 16-bit, unsigned circular space. The sequence number value 0 is used to indicate that the sequence number check algorithm is not used. The sequence number processing algorithm is found in [PWE3-CW].",
      "ja": "シーケンス番号スペースは、16ビットの署名されていない円形スペースです。シーケンス番号値0は、シーケンス番号チェックアルゴリズムが使用されていないことを示すために使用されます。シーケンス番号処理アルゴリズムは[PWE3-CW]にあります。"
    },
    {
      "indent": 0,
      "text": "4.7. QoS Considerations",
      "section_title": true,
      "ja": "4.7. QoSの考慮事項"
    },
    {
      "indent": 3,
      "text": "The ingress PE MAY consider the user priority (PRI) field [802.1Q] of the VLAN tag header when determining the value to be placed in a QoS field of the encapsulating protocol (e.g., the EXP fields of the MPLS label stack). In a similar way, the egress PE MAY consider the QoS field of the encapsulating protocol (e.g., the EXP fields of the MPLS label stack) when queuing the frame for transmission towards the CE.",
      "ja": "Ingress PEは、カプセル化プロトコルのQoSフィールドに配置される値を決定する際に、VLANタグヘッダーのユーザー優先度（PRI）フィールド[802.1Q]を考慮することができます（例：MPLSラベルスタックのEXPフィールド）。同様に、出力PEは、CEに送信するためのフレームをキューイングするときに、カプセル化プロトコルのQOSフィールド（例：MPLSラベルスタックのEXPフィールド）を考慮する場合があります。"
    },
    {
      "indent": 3,
      "text": "A PE MUST support the ability to carry the Ethernet PW as a best-effort service over the MPLS PSN. PRI bits are kept transparent between PE devices, regardless of the QoS support of the PSN.",
      "ja": "PEは、MPLS PSNを介したベストエフォートサービスとしてイーサネットPWを運ぶ機能をサポートする必要があります。PSNのQoSサポートに関係なく、PRIビットはPEデバイス間で透明に保たれます。"
    },
    {
      "indent": 3,
      "text": "If an 802.1Q VLAN field is added at the PE, a default PRI setting of zero MUST be supported, a configured default value is recommended, or the value may be mapped from the QoS field of the PSN, as referred to above.",
      "ja": "PEに802.1Q VLANフィールドが追加されている場合、ゼロのデフォルトのPRI設定をサポートする必要があります。構成されたデフォルト値が推奨されるか、上記のようにPSNのQOSフィールドから値をマッピングする必要があります。"
    },
    {
      "indent": 3,
      "text": "A PE may support additional QoS support by means of one or more of the following methods:",
      "ja": "PEは、次の方法の1つ以上によって追加のQoSサポートをサポートする場合があります。"
    },
    {
      "indent": 6,
      "text": " i. One class of service (CoS) per PW End Service (PWES), mapped to a single CoS PW at the PSN. ii. Multiple CoS per PWES mapped to a single PW with multiple CoS at the PSN. iii. Multiple CoS per PWES mapped to multiple PWs at the PSN.",
      "ja": "私。PWエンドサービス（PWES）ごとに1つのクラスのサービス（COS）は、PSNで単一のCOS PWにマッピングされました。ii。PSNに複数のCOSを使用して、単一のPWにマッピングされたPWESあたりの複数のCOS。iii。PSNで複数のPWにマッピングされたPWESあたりの複数のCOS。"
    },
    {
      "indent": 3,
      "text": "Examples of the cases above and details of the service mapping considerations are described in Appendix B.",
      "ja": "上記のケースの例とサービスマッピングの考慮事項の詳細については、付録Bで説明します。"
    },
    {
      "indent": 3,
      "text": "The PW guaranteed rate at the MPLS PSN level is PW service provider policy based on agreement with the customer, and may be different from the Ethernet physical port rate.",
      "ja": "MPLS PSNレベルでのPW保証レートは、顧客との合意に基づくPWサービスプロバイダーポリシーであり、イーサネットの物理ポートレートとは異なる場合があります。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "The Ethernet pseudowire type is subject to all of the general security considerations discussed in [RFC3985] and [PWE3-CTRL].",
      "ja": "イーサネットの擬似ワイヤタイプは、[RFC3985]および[PWE3-CTRL]で説明されているすべての一般的なセキュリティ上の考慮事項の対象となります。"
    },
    {
      "indent": 3,
      "text": "The Ethernet pseudowire is transported on an MPLS PSN; therefore, the security of the pseudowire itself will only be as good as the security of the MPLS PSN. The MPLS PSN can be secured by various methods, as described in [MPLS-ARCH].",
      "ja": "イーサネットの擬似ワイヤーは、MPLS PSNで輸送されます。したがって、擬似ワイヤー自体のセキュリティは、MPLS PSNのセキュリティと同じくらい良いものになります。MPLS PSNは、[MPLS-ARCH]に記載されているように、さまざまな方法で保護できます。"
    },
    {
      "indent": 3,
      "text": "Security achieved by access control of MAC addresses is out of the scope of this document. Additional security requirements related to the use of PW in a switching (virtual bridging) environment are not discussed here as they are not within the scope of this document.",
      "ja": "MACアドレスのアクセス制御によって達成されるセキュリティは、このドキュメントの範囲外です。スイッチング（仮想ブリッジング）環境でのPWの使用に関連する追加のセキュリティ要件は、このドキュメントの範囲内ではないため、ここでは説明されていません。"
    },
    {
      "indent": 0,
      "text": "6. PSN MTU Requirements",
      "section_title": true,
      "ja": "6. PSN MTU要件"
    },
    {
      "indent": 3,
      "text": "The MPLS PSN MUST be configured with an MTU that is large enough to transport a maximum-sized Ethernet frame that has been encapsulated with a control word, a pseudowire demultiplexer, and a tunnel encapsulation. With MPLS used as the tunneling protocol, for example, this is likely to be 8 or more bytes greater than the largest frame size. The methodology described in [FRAG] MAY be used to fragment encapsulated frames that exceed the PSN MTU. However, if [FRAG] is not used and if the ingress router determines that an encapsulated layer 2 PDU exceeds the MTU of the PSN tunnel through which it must be sent, the PDU MUST be dropped.",
      "ja": "MPLS PSNは、コントロールワード、擬似ワイヤーの非gultiplexer、トンネルのカプセル化でカプセル化された最大サイズのイーサネットフレームを輸送するのに十分な大きさのMTUで構成する必要があります。たとえば、MPLSがトンネルプロトコルとして使用されている場合、これは最大のフレームサイズよりも8つ以上のバイトである可能性があります。[frag]で説明されている方法論は、PSN MTUを超えるカプセル化されたフレームをフラグメントするために使用できます。ただし、[フラグ]が使用されておらず、侵入ルーターがカプセル化されたレイヤー2 PDUが送信する必要があるPSNトンネルのMTUを超えると判断した場合、PDUをドロップする必要があります。"
    },
    {
      "indent": 0,
      "text": "7. Normative References",
      "section_title": true,
      "ja": "7. 引用文献"
    },
    {
      "indent": 3,
      "text": "[PWE3-CW] Bryant, S., Swallow, G., and D. McPherson, \"Pseudowire Emulation Edge-to-Edge (PWE3) Control Word for Use over an MPLS PSN\", RFC 4385, February 2006.",
      "ja": "[PWE3-CW] Bryant、S.、Swallow、G。、およびD. McPherson、「Pseudowire Emulation Edge-to-Edge（PWE3）がMPLS PSNを介して使用する単語を制御する」、RFC 4385、2006年2月。"
    },
    {
      "indent": 3,
      "text": "[IANA] Martini, L., \"IANA Allocations for Pseudowire Edge to Edge Emulation (PWE3)\", BCP 116, RFC 4446, April 2006.",
      "ja": "[IANA] Martini、L。、「Pseudowire Edge to Edge Emulation（PWE3）のIANAの割り当て」、BCP 116、RFC 4446、2006年4月。"
    },
    {
      "indent": 3,
      "text": "[PWE3-CTRL] Martini, L., El-Aawar, N., Heron, G., Rosen, E., Tappan, D., and T. Smith, \"Pseudowire Setup and Maintenance using the Label Distribution Protocol (LDP)\", RFC 4447, April 2006.",
      "ja": "[PWE3-Ctrl] Martini、L.、El-Aawar、N.、Heron、G.、Rosen、E.、Tappan、D。、およびT. Smith、「Pseudowire Setup and Maintenanceを使用したラベル分布プロトコル（LDP）\"、RFC 4447、2006年4月。"
    },
    {
      "indent": 3,
      "text": "[MPLS-ARCH] Rosen, E., Viswanathan, A., and R. Callon, \"Multiprotocol Label Switching Architecture\", RFC 3031, January 2001.",
      "ja": "[MPLS-ARCH] Rosen、E.、Viswanathan、A。、およびR. Callon、「Multiprotocolラベルスイッチングアーキテクチャ」、RFC 3031、2001年1月。"
    },
    {
      "indent": 3,
      "text": "[802.3] IEEE802.3-2005, ISO/IEC 8802-3: 2000 (E), \"IEEE Standard for Information technology -- Telecommunications and information exchange between systems -- Local and metropolitan area networks -- Specific requirements -- Part 3: Carrier Sense Multiple Access with Collision Detection (CSMA/CD) Access Method and Physical Layer Specifications\", 2005.",
      "ja": "[802.3] IEEE802.3-2005、ISO/IEC 8802-3：2000（e）、「情報技術のIEEE標準 - システム間の通信と情報交換 - ローカルおよびメトロポリタンエリアネットワーク - 特定の要件 - パート3：キャリアセンス衝突検出による複数アクセス（CSMA/CD）アクセス方法と物理層の仕様」、2005年。"
    },
    {
      "indent": 3,
      "text": "[802.1Q] ANSI/IEEE Standard 802.1Q-2005, \"IEEE Standards for Local and Metropolitan Area Networks: Virtual Bridged Local Area Networks\", 2005.",
      "ja": "[802.1Q] ANSI/IEEE標準802.1Q-2005、「ローカルおよびメトロポリタンエリアネットワークのIEEE標準：仮想ブリッジ型ローカルエリアネットワーク」、2005年。"
    },
    {
      "indent": 3,
      "text": "[PDU] IEEE Std 802.3, 1998 Edition, \"Part 3: Carrier sense multiple access with collision detection (CSMA/CD) access method and physical layer specifications\" figure 3.1, 1998",
      "ja": "[PDU] IEEE STD 802.3、1998 Edition、 \"パート3：キャリアセンス衝突検出による複数アクセス（CSMA/CD）アクセス方法と物理層の仕様\"図3.1、1998"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119] Bradner、S。、「要件レベルを示すためにRFCで使用するためのキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 0,
      "text": "8. Informative References",
      "section_title": true,
      "ja": "8. 参考引用"
    },
    {
      "indent": 3,
      "text": "[RFC3985] Bryant, S. and P. Pate, \"Pseudo Wire Emulation Edge-to-Edge (PWE3) Architecture\", RFC 3985, March 2005.",
      "ja": "[RFC3985] Bryant、S。およびP. Pate、「Pseudo Wire Emulation Edge-to-Edge（PWE3）アーキテクチャ」、RFC 3985、2005年3月。"
    },
    {
      "indent": 3,
      "text": "[PW-MIB] Zelig, D. and T. Nadeau, \"Ethernet Pseudo Wire (PW) Management Information Base\", Work in Progress, February 2006.",
      "ja": "[Pw-Mib] Zelig、D。およびT. Nadeau、「イーサネット擬似ワイヤ（PW）管理情報ベース」、2006年2月、Work in Progress。"
    },
    {
      "indent": 3,
      "text": "[PWE3-REQ] Xiao, X., McPherson, D., and P. Pate, \"Requirements for Pseudo-Wire Emulation Edge-to-Edge (PWE3)\", RFC 3916, September 2004.",
      "ja": "[PWE3-REQ] Xiao、X.、McPherson、D。、およびP. Pate、「擬似ワイヤーエミュレーションエッジとエッジ（PWE3）の要件」、RFC 3916、2004年9月。"
    },
    {
      "indent": 3,
      "text": "[PWE3-MIB] Zelig, D., Ed. and T. Nadeau, Ed., \"Pseudo Wire (PW) Management Information Base\", Work in Progress, February 2006.",
      "ja": "[PWE3-MIB] Zelig、D.、ed。およびT. Nadeau編、「Pseudo Wire（PW）管理情報ベース」、Work in Progress、2006年2月。"
    },
    {
      "indent": 3,
      "text": "[LDP] Andersson, L., Doolan, P., Feldman, N., Fredette, A., and B. Thomas, \"LDP Specification\", RFC 3036, January 2001.",
      "ja": "[LDP] Andersson、L.、Doolan、P.、Feldman、N.、Fredette、A。、およびB. Thomas、「LDP仕様」、RFC 3036、2001年1月。"
    },
    {
      "indent": 3,
      "text": "[FRAG] Malis, A. and W. Townsley, \"PWE3 Fragmentation and Reassembly\", Work in Progress, February 2005.",
      "ja": "[frag] Malis、A。and W. Townsley、「PWE3の断片化と再組み立て」、2005年2月の作業。"
    },
    {
      "indent": 3,
      "text": "[FCS] Malis, A., Allan, D., and N. Del Regno, \"PWE3 Frame Check Sequence Retention\", Work in Progress, September 2005.",
      "ja": "[FCS] Malis、A.、Allan、D。、およびN. Del Regno、「PWE3フレームチェックシーケンス保持」、2005年9月、進行中の作業。"
    },
    {
      "indent": 3,
      "text": "[VCCV] Nadeau, T., Ed. and R. Aggarwal, Ed., \"Pseudo Wire Virtual Circuit Connectivity Verification (VCCV)\", Work in Progress, August 2005.",
      "ja": "[VCCV] Nadeau、T.、ed。およびR. Aggarwal、ed。、「Pseudo Wire Virtual Cunnectivity Verification（VCCV）」、2005年8月の作業。"
    },
    {
      "indent": 3,
      "text": "[RFC2992] Hopps, C., \"Analysis of an Equal-Cost Multi-Path Algorithm\", RFC 2992, November 2000.",
      "ja": "[RFC2992] Hopps、C。、「等コストのマルチパスアルゴリズムの分析」、RFC 2992、2000年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC4026] Andersson, L. and T. Madsen, \"Provider Provisioned Virtual Private Network (VPN) Terminology\", RFC 4026, March 2005.",
      "ja": "[RFC4026] Andersson、L。およびT. Madsen、「プロバイダープロビジョニング仮想プライベートネットワーク（VPN）用語」、RFC 4026、2005年3月。"
    },
    {
      "indent": 3,
      "text": "[L2TPv3] Lau, J., Townsley, M., and I. Goyret, \"Layer Two Tunneling Protocol - Version 3 (L2TPv3)\", RFC 3931, March 2005.",
      "ja": "[L2TPV3] Lau、J.、Townsley、M。、およびI. Goyret、「レイヤー2つのトンネルプロトコル - バージョン3（L2TPV3）」、RFC 3931、2005年3月。"
    },
    {
      "indent": 0,
      "text": "9. Significant Contributors",
      "section_title": true,
      "ja": "9. 重要な貢献者"
    },
    {
      "indent": 3,
      "text": "Andrew G. Malis Tellabs 90 Rio Robles Dr. San Jose, CA 95134",
      "ja": "Andrew G. Malis Tellabs 90 Rio Robles Dr. San Jose、CA 95134"
    },
    {
      "indent": 3,
      "text": "EMail: Andy.Malis@tellabs.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Dan Tappan Cisco Systems, Inc. 1414 Massachusetts Avenue Boxborough, MA 01719",
      "ja": "Dan Tappan Cisco Systems、Inc。1414 Massachusetts Avenue Boxborough、MA 01719"
    },
    {
      "indent": 3,
      "text": "EMail: tappan@cisco.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Steve Vogelsang ECI Telecom Omega Corporate Center 1300 Omega Drive Pittsburgh, PA 15205",
      "ja": "Steve Vogelsang ECI Telecom Omega Corporate Center 1300 Omega Drive Pittsburgh、PA 15205"
    },
    {
      "indent": 3,
      "text": "EMail: stephen.vogelsang@ecitele.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Vinai Sirkay Reliance Infocomm Dhirubai Ambani Knowledge City Navi Mumbai 400 709 India",
      "ja": "Vinai Sirkay Reliance Infocomm Dhirubai Ambani Knowledge City Navi Mumbai 400 709 India"
    },
    {
      "indent": 3,
      "text": "EMail: vinai@sirkay.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Vasile Radoaca Nortel Networks 600 Technology Park Billerica MA 01821",
      "ja": "Vasile Radoaca Nortel Networks 600 Technology Park Billerica MA 01821"
    },
    {
      "indent": 3,
      "text": "EMail: vasile@nortelnetworks.com\n   Chris Liljenstolpe\nAlcatel\n11600 Sallie Mae Dr.\n9th Floor\nReston, VA 20193",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "EMail: chris.liljenstolpe@alcatel.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Kireeti Kompella Juniper Networks 1194 N. Mathilda Ave Sunnyvale, CA 94089",
      "ja": "Kireeti Kompella Juniper Networks 1194 N. Mathilda Ave Sunnyvale、CA 94089"
    },
    {
      "indent": 3,
      "text": "EMail: kireeti@juniper.net",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Tricci So Nortel Networks 3500 Carling Ave., Nepean, Ontario, Canada, K2H 8E9.",
      "ja": "Tricci So Nortel Networks 3500 Carling Ave.、Nepean、オンタリオ州、カナダ、K2H 8E9。"
    },
    {
      "indent": 3,
      "text": "EMail: tso@nortelnetworks.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "XiPeng Xiao Riverstone Networks 5200 Great America Parkway Santa Clara, CA 95054",
      "ja": "Xipeng Xiao Riverstone Networks 5200 Great America Parkway Santa Clara、CA 95054"
    },
    {
      "indent": 3,
      "text": "EMail: xxiao@riverstonenet.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Christopher O. Flores T-Systems 10700 Parkridge Boulevard Reston, VA 20191 USA",
      "ja": "Christopher O. Flores T-Systems 10700 Parkridge Boulevard Reston、VA 20191 USA"
    },
    {
      "indent": 3,
      "text": "EMail: christopher.flores@usa.telekom.de",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "David Zelig Corrigent Systems 126, Yigal Alon St. Tel Aviv, ISRAEL",
      "ja": "David Zelig Corrigent Systems 126、Yigal Alon St. Tel Aviv、イスラエル"
    },
    {
      "indent": 3,
      "text": "EMail: davidz@corrigent.com\n   Raj Sharma\nLuminous Networks, Inc.\n10460 Bubb Road\nCupertino, CA 95014",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "EMail: raj@luminous.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Nick Tingle TiMetra Networks 274 Ferguson Drive Mountain View, CA 94043",
      "ja": "Nick Tingle Timetra Networks 274 Ferguson Drive Mountain View、CA 94043"
    },
    {
      "indent": 3,
      "text": "EMail: nick@timetra.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Sunil Khandekar TiMetra Networks 274 Ferguson Drive Mountain View, CA 94043",
      "ja": "Sunil Khandekar Timetra Networks 274 Ferguson Drive Mountain View、CA 94043"
    },
    {
      "indent": 3,
      "text": "EMail: sunil@timetra.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Loa Andersson TLA-group",
      "ja": "Loa Andersson TLA-Group"
    },
    {
      "indent": 3,
      "text": "EMail: loa@pi.se",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Appendix A. Interoperability Guidelines",
      "section_title": true,
      "ja": "付録A. 相互運用性ガイドライン"
    },
    {
      "indent": 0,
      "text": "A.1. Configuration Options",
      "section_title": true,
      "ja": "A.1. 構成オプション"
    },
    {
      "indent": 3,
      "text": "The following is a list of the configuration options for a point-to-point Ethernet PW based on the reference points of Figure 3:",
      "ja": "以下は、図3の参照ポイントに基づいて、ポイントツーポイントイーサネットPWの構成オプションのリストです。"
    },
    {
      "indent": 3,
      "text": "--------------|---------------|---------------|------------------\nService and   |  Encap on C   |Operation at B | Remarks\nEncap on A    |               |ingress/egress |\n--------------|---------------|---------------|------------------\n1) Raw        | Raw - Same as |               |\n              | A             |               |\n              |               |               |\n--------------|---------------|---------------|------------------\n2) Tag1       | Tag2          |Optional change| VLAN can be\n              |               |of VLAN value  | 0-4095\n              |               |               | Change allowed in\n              |               |               | both directions\n--------------|---------------|---------------|------------------\n3) No Tag     | Tag           |Add/remove Tag | Tag can be\n              |               |field          | 0-4095\n              |               |               | (note i)\n              |               |               |\n--------------|---------------|---------------|------------------\n4) Tag        | No Tag        |Remove/add Tag | (note ii)\n              |               |field          |\n              |               |               |\n              |               |               |\n--------------|---------------|---------------|------------------",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 22,
      "text": "Figure 4: Configuration Options",
      "ja": "図4：構成オプション"
    },
    {
      "indent": 3,
      "text": "Allowed combinations:",
      "ja": "許可された組み合わせ："
    },
    {
      "indent": 3,
      "text": "Raw and other services are not allowed on the same NSP virtual port (A). All other combinations are allowed, except that conflicting VLANs on (A) are not allowed. Note that in most point-to-point PW applications the NSP virtual port is the same entity as the physical port.",
      "ja": "RAWおよびその他のサービスは、同じNSP仮想ポート（a）では許可されていません。他のすべての組み合わせは許可されていますが、（a）の矛盾するVLANが許可されていないことを除きます。ほとんどのポイントツーポイントPWアプリケーションでは、NSP仮想ポートは物理ポートと同じエンティティであることに注意してください。"
    },
    {
      "indent": 3,
      "text": "Notes:",
      "ja": "ノート："
    },
    {
      "indent": 8,
      "text": "i. Mode #3 MAY be limited to adding VLAN NULL only, since change of VLAN or association to specific VLAN can be done at the PW CE-bound side.",
      "ja": "i. モード＃3は、VLANまたは特定のVLANへの関連性の変更をPW CEバウンド側で行うことができるため、VLAN NULLのみを追加することに限定される場合があります。"
    },
    {
      "indent": 7,
      "text": "ii. Mode #4 exists in layer 2 switches, but is not recommended when operating with PW since it may not preserve the user's PRI bits. If there is a need to remove the VLAN tag (for TLS at the other end of the PW), it is recommended to use mode #2 with tag2=0 (NULL VLAN) on the PW and use mode #3 at the other end of the PW.",
      "ja": "ii。モード＃4はレイヤー2スイッチに存在しますが、PWで操作する場合はユーザーのPRIビットを保存できない可能性があるため、お勧めしません。VLANタグを削除する必要がある場合（PWの反対側のTLSの場合）、PWでTAG2 = 0（NULL VLAN）でモード＃2を使用し、反対側でモード＃3を使用することをお勧めします。PWの。"
    },
    {
      "indent": 0,
      "text": "A.2. IEEE 802.3x Flow Control Considerations",
      "section_title": true,
      "ja": "A.2. IEEE 802.3xフロー制御の考慮事項"
    },
    {
      "indent": 3,
      "text": "If the receiving node becomes congested, it can send a special frame, called the PAUSE frame, to the source node at the opposite end of the connection. The implementation MUST provide a mechanism for terminating PAUSE frames locally (i.e., at the local PE). It MUST operate as follows: PAUSE frames received on a local Ethernet port SHOULD cause the PE device to buffer, or to discard, further Ethernet frames for that port until the PAUSE condition is cleared. Optionally, the PE MAY simply discard PAUSE frames.",
      "ja": "受信ノードが混雑している場合、接続の反対側のソースノードに、一時停止フレームと呼ばれる特別なフレームを送信できます。実装は、ローカルで一時停止フレームを終了するメカニズムを提供する必要があります（つまり、ローカルPEで）。次のように動作する必要があります。ローカルイーサネットポートで受信した一時停止フレームは、PEデバイスをバッファーにしたり、そのポートのさらなるイーサネットフレームを廃棄したりする必要があります。オプションで、PEは単に一時停止フレームを破棄する場合があります。"
    },
    {
      "indent": 3,
      "text": "If the PE device wishes to pause data received on a local Ethernet port (perhaps because its own buffers are filling up or because it has received notification of congestion within the PSN), then it MAY issue a PAUSE frame on the local Ethernet port, but MUST clear this condition when willing to receive more data.",
      "ja": "PEデバイスがローカルイーサネットポートで受信したデータを一時停止したい場合（おそらく、独自のバッファがいっぱいになっているため、またはPSN内の輻輳の通知を受け取ったため）、ローカルイーサネットポートで一時停止フレームを発行する可能性がありますが、より多くのデータを受け取る意思がある場合は、この状態をクリアする必要があります。"
    },
    {
      "indent": 0,
      "text": "Appendix B. QoS Details",
      "section_title": true,
      "ja": "付録B. QoSの詳細"
    },
    {
      "indent": 3,
      "text": "Section 4.7, \"QoS Considerations\", describes various modes for supporting PW QOS over the PSN. Examples of the above for a point-to-point VLAN service are:",
      "ja": "セクション4.7「QoS考慮事項」は、PSNを介したPW QOをサポートするためのさまざまなモードについて説明しています。上記のポイントツーポイントVLANサービスの例は次のとおりです。"
    },
    {
      "indent": 6,
      "text": "- The classification to the PW is based on VLAN field, but the user PRI bits are mapped to different CoS markings (and network behavior) at the PW level. An example of this is a PW mapped to an E-LSP in an MPLS network.",
      "ja": "- PWへの分類はVLANフィールドに基づいていますが、ユーザーPRIビットはPWレベルで異なるCOSマーキング（およびネットワークの動作）にマッピングされます。この例は、MPLSネットワークのE-LSPにマッピングされたPWです。"
    },
    {
      "indent": 6,
      "text": "- The classification to the PW is based on VLAN field and the PRI bits, and frames with different PRI bits are mapped to different PWs. An example is to map a PWES to different L-LSPs in MPLS PSN in order to support multiple CoS over an L-LSP-capable network, or to map a PWES to multiple L2TPv3 sessions [L2TPv3].",
      "ja": "- PWへの分類はVLANフィールドとPRIビットに基づいており、異なるPRIビットのフレームは異なるPWにマッピングされます。例としては、MPLS PSNの異なるLSPにPWEをマッピングして、L-LSP対応ネットワーク上で複数のCOSをサポートするか、PWEを複数のL2TPV3セッション[L2TPV3]にマッピングすることです。"
    },
    {
      "indent": 8,
      "text": "The specific value to be assigned at the PSN for various CoS is out of the scope of this document.",
      "ja": "さまざまなCOSに対してPSNに割り当てる特定の値は、このドキュメントの範囲外です。"
    },
    {
      "indent": 0,
      "text": "B.1. Adaptation of 802.1Q CoS to PSN CoS",
      "section_title": true,
      "ja": "B.1. PSN Cosへの802.1Q Cosの適応"
    },
    {
      "indent": 3,
      "text": "It is not required that the PSN will have the same CoS definition of CoS as defined in [802.1Q], and the mapping of 802.1Q CoS to PSN CoS is application specific and depends on the agreement between the customer and the PW provider. However, the following principles adopted from 802.1Q, Table 8-2, MUST be met when applying the set of PSN CoS based on user's PRI bits.",
      "ja": "PSNは[802.1Q]で定義されているCOSのCOS定義と同じCOS定義を持ち、PSN COSへの802.1Q COSのマッピングはアプリケーション固有であり、顧客とPWプロバイダー間の契約に依存します。ただし、ユーザーのPRIビットに基づいてPSN COSのセットを適用する場合、802.1Q（表8-2）から採用された次の原則を満たす必要があります。"
    },
    {
      "indent": 3,
      "text": "             ----------------------------------\n             |#of available classes of service|\n-------------||---+---+---+---+---+---+---+---|\nUser         || 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 |\nPriority     ||   |   |   |   |   |   |   |   |\n===============================================\n0 Best Effort|| 0 | 0 | 0 | 1 | 1 | 1 | 1 | 2 |\n(Default)    ||   |   |   |   |   |   |   |   |\n------------ ||---+---+---+---+---+---+---+---|\n1 Background || 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |\n             ||   |   |   |   |   |   |   |   |\n------------ ||---+---+---+---+---+---+---+---|\n2 Spare      || 0 | 0 | 0 | 0 | 0 | 0 | 0 | 1 |\n             ||   |   |   |   |   |   |   |   |\n------------ ||---+---+---+---+---+---+---+---|\n3 Excellent  || 0 | 0 | 0 | 1 | 1 | 2 | 2 | 3 |\nEffort       ||   |   |   |   |   |   |   |   |\n------------ ||---+---+---+---+---+---+---+---|\n4 Controlled || 0 | 1 | 1 | 2 | 2 | 3 | 3 | 4 |\nLoad         ||   |   |   |   |   |   |   |   |\n------------ ||---+---+---+---+---+---+---+---|\n5 Interactive|| 0 | 1 | 1 | 2 | 3 | 4 | 4 | 5 |\nMultimedia   ||   |   |   |   |   |   |   |   |\n------------ ||---+---+---+---+---+---+---+---|\n6 Interactive|| 0 | 1 | 2 | 3 | 4 | 5 | 5 | 6 |\nVoice        ||   |   |   |   |   |   |   |   |\n------------ ||---+---+---+---+---+---+---+---|\n7 Network    || 0 | 1 | 2 | 3 | 4 | 5 | 6 | 7 |\nControl      ||   |   |   |   |   |   |   |   |\n------------ ||---+---+---+---+---+---+---+---|",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 21,
      "text": "Figure 5: IEEE 802.1Q CoS Mapping",
      "ja": "図5：IEEE 802.1Q COSマッピング"
    },
    {
      "indent": 0,
      "text": "B.2. Drop Precedence",
      "section_title": true,
      "ja": "B.2. 優先順位を落とします"
    },
    {
      "indent": 3,
      "text": "The 802.1P standard does not support drop precedence; therefore, from the PW PE-bound point of view there is no mapping required. It is, however, possible to mark different drop precedence for different PW frames based on the operator policy and required network behavior. This functionality is not discussed further here.",
      "ja": "802.1p標準は、ドロップの優先順位をサポートしていません。したがって、PW PEバウンドの観点からは、マッピングは必要ありません。ただし、オペレーターポリシーと必要なネットワーク動作に基づいて、異なるPWフレームで異なるドロップの優先順位をマークすることは可能です。この機能についてはこれ以上説明していません。"
    },
    {
      "indent": 3,
      "text": "PSN QoS support and signaling of QoS are out of the scope of this document.",
      "ja": "PSN QOSサポートとQOSのシグナリングは、このドキュメントの範囲外です。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Luca Martini, Editor Cisco Systems, Inc. 9155 East Nichols Avenue, Suite 400 Englewood, CO, 80112",
      "ja": "Luca Martini、編集者Cisco Systems、Inc。9155 East Nichols Avenue、Suite 400 Englewood、Co、80112"
    },
    {
      "indent": 3,
      "text": "EMail: lmartini@cisco.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Nasser El-Aawar Level 3 Communications, LLC. 1025 Eldorado Blvd. Broomfield, CO, 80021",
      "ja": "Nasser El-Aawarレベル3 Communications、LLC。1025 Eldorado Blvd.コロラド州ブルームフィールド、80021"
    },
    {
      "indent": 3,
      "text": "EMail: nna@level3.net",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Giles Heron Tellabs Abbey Place 24-28 Easton Street High Wycombe Bucks HP11 1NT UK",
      "ja": "ジャイルズ・ヘロン・テラブズ修道院プレイス24-28イーストン・ストリート高ワイコム・バックスHP11 1NT UK"
    },
    {
      "indent": 3,
      "text": "EMail: giles.heron@tellabs.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Eric C. Rosen Cisco Systems, Inc. 1414 Massachusetts Avenue Boxborough, MA 01719",
      "ja": "エリックC.ローゼンシスコシステムズ、1414マサチューセッツアベニューボックスボロー、マサチューセッツ州01719"
    },
    {
      "indent": 3,
      "text": "EMail: erosen@cisco.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2006).",
      "ja": "Copyright（c）The Internet Society（2006）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "この文書は、BCP 78に含まれる権利、ライセンス、および制限の対象となり、そこに記載されている場合を除き、著者はすべての権利を保持しています。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "このドキュメントとここに含まれる情報は、「現状のまま」に基づいて提供されています。また、貢献者、彼/彼女が代表する組織（もしあれば）が後援する組織、インターネット協会とインターネット工学タスクフォースは、すべての保証、明示的または明示的、またはすべての保証を否認します。本書の情報の使用が、商品性または特定の目的に対する適合性の権利または黙示的な保証を侵害しないという保証を含むがこれらに限定されないことを含む。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、知的財産権またはその他の権利の有効性または範囲に関して、この文書に記載されている技術の実装または使用、またはそのような権利に基づくライセンスがどの程度であるかについての使用に関連すると主張する可能性があるという立場はありません。利用可能になります。また、そのような権利を特定するために独立した努力をしたことも表明していません。RFCドキュメントの権利に関する手順に関する情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IETF事務局に行われたIPR開示のコピーと、利用可能にするライセンスの保証、またはこの仕様の実装者またはユーザーによるそのような独自の権利の使用のための一般的なライセンスまたは許可を取得しようとする試みの結果を取得できます。http://www.ietf.org/iprのIETFオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、関心のある当事者に、著作権、特許、または特許出願、またはこの基準を実装するために必要なテクノロジーをカバーする可能性のあるその他の独自の権利を注意深く招待します。ietf-ipr@ietf.orgのIETFへの情報をお問い合わせください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is provided by the IETF Administrative Support Activity (IASA).",
      "ja": "RFCエディター機能の資金は、IETF管理サポートアクティビティ（IASA）によって提供されます。"
    }
  ]
}