{
  "title": {
    "text": "RFC 4133 - Entity MIB (Version 3)",
    "ja": "RFC 4133 - エンティティMIB（バージョン3）"
  },
  "number": 4133,
  "created_at": "2019-10-20 06:34:33.460440+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                         A. Bierman\nRequest for Comments: 4133                                 K. McCloghrie\nObsoletes: 2737                                      Cisco Systems, Inc.\nCategory: Standards Track                                    August 2005",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 25,
      "text": "Entity MIB (Version 3)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "ja": "著作権（C）インターネット協会（2005）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This memo defines a portion of the Management Information Base (MIB) for use with network management protocols in the Internet community. In particular, it describes managed objects used for managing multiple logical and physical entities managed by a single SNMP agent. This document specifies version 3 of the Entity MIB, which obsoletes version 2 (RFC 2737).",
      "ja": "このメモは、インターネットコミュニティでのネットワーク管理プロトコルで使用するための管理情報ベース（MIB）の一部を定義します。特に、それは1つのSNMPエージェントによって管理される複数の論理的および物理的なエンティティを管理するために使用される管理オブジェクトについて説明します。このドキュメントでは、バージョン2（RFC 2737）を廃止エンティティMIBのバージョン3を指定します。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. The SNMP Management Framework ...................................3\n2. Overview ........................................................3\n   2.1. Terms ......................................................4\n   2.2. Relationship to Community Strings ..........................5\n   2.3. Relationship to SNMP Contexts ..............................5\n   2.4. Relationship to Proxy Mechanisms ...........................6\n   2.5. Relationship to a Chassis MIB ..............................6\n   2.6. Relationship to the Interfaces MIB .........................6\n   2.7. Relationship to the Other MIBs .............................7\n   2.8. Relationship to Naming Scopes ..............................7\n   2.9. Multiple Instances of the Entity MIB .......................7\n   2.10. Re-Configuration of Entities ..............................8\n   2.11. Textual Convention Change .................................8\n   2.12. MIB Structure .............................................8\n         2.12.1. entityPhysical Group ..............................9\n         2.12.2. entityLogical Group ..............................11\n         2.12.3. entityMapping Group ..............................11\n         2.12.4. entityGeneral Group ..............................12\n         2.12.5. entityNotifications Group ........................12\n   2.13. Multiple Agents ..........................................12\n   2.14. Changes Since RFC 2037 ...................................12\n         2.14.1. Textual Conventions ..............................12\n         2.14.2. New entPhysicalTable Objects .....................13\n         2.14.3. New entLogicalTable Objects ......................13\n         2.14.4. Bug Fixes ........................................13\n   2.15. Changes Since RFC 2737 ...................................13\n         2.15.1. Textual Conventions ..............................13\n         2.15.2. New Objects ......................................14\n         2.15.3. Bug Fixes ........................................14\n3. Definitions ....................................................14\n4. Usage Examples .................................................44\n   4.1. Router/Bridge .............................................44\n   4.2. Repeaters .................................................50\n5. Security Considerations ........................................57\n6. IANA Considerations ............................................58\n7. Acknowledgements ...............................................59\n8. References .....................................................59\n   8.1. Normative References ......................................59\n   8.2. Informative References ....................................59",
      "raw": true,
      "ja": "1. SNMP管理フレームワーク\n2.概要\n   2.1。条項\n   2.2。コミュニティストリングとの関係\n   2.3。 SNMPコンテキストとの関係\n   2.4。プロキシのメカニズムとの関係\n   2.5。シャーシMIBとの関係\n   2.6。インタフェースMIBとの関係\n   2.7。その他のMIBとの関係\n   2.8。命名スコープとの関係\n   2.9。エンティティMIBの複数インスタンス\n   2.10。エンティティの再設定\n   2.11。テキストの表記法の変更\n   2.12。 MIBの構造\n         2.12.1。 entityPhysicalグループ\n         2.12.2。 entityLogicalグループ\n         2.12.3。 entityMappingグループグループ\n         2.12.4。 entityGeneralグループ\n         2.12.5。 entityNotificationsグループ\n   2.13。複数のエージェント\n   2.14。 RFC 2037からの変更\n         2.14.1。テキストの表記法\n         2.14.2。新しいのentPhysicalTableオブジェクト\n         2.14.3。新entLogicalTableオブジェクト\n         2.14.4。バグの修正\n   2.15。 RFC 2737からの変更\n         2.15.1。テキストの表記法\n         2.15.2。新しいオブジェクト\n         2.15.3。バグの修正\n3.定義\n4.使用例\n   4.1。ルータ/ブリッジ\n   4.2。リピータ\n5.セキュリティについての考慮事項\n6. IANAの考慮事項\n7.謝辞\n8.参照文献\n   8.1。引用規格\n   8.2。参考文献"
    },
    {
      "indent": 0,
      "text": "1. The SNMP Management Framework",
      "section_title": true,
      "ja": "1. SNMP管理フレームワーク"
    },
    {
      "indent": 3,
      "text": "For a detailed overview of the documents that describe the current Internet-Standard Management Framework, please refer to section 7 of RFC 3410 [RFC3410].",
      "ja": "現在のインターネット標準の管理フレームワークを記述したドキュメントの詳細な概要については、RFC 3410 [RFC3410]のセクション7を参照してください。"
    },
    {
      "indent": 3,
      "text": "Managed objects are accessed via a virtual information store, termed the Management Information Base or MIB. MIB objects are generally accessed through the Simple Network Management Protocol (SNMP). Objects in the MIB are defined using the mechanisms defined in the Structure of Management Information (SMI). This memo specifies a MIB module that is compliant to the SMIv2, which is described in STD 58, RFC 2578 [RFC2578], STD 58, RFC 2579 [RFC2579] and STD 58, RFC 2580 [RFC2580].",
      "ja": "管理対象オブジェクトが仮想情報店を介してアクセスされ、管理情報ベースまたはMIBと呼ばれます。 MIBオブジェクトは、一般的に簡易ネットワーク管理プロトコル（SNMP）を介してアクセスされます。 MIBのオブジェクトは、管理情報（SMI）の構造で定義されたメカニズムを使用して定義されています。このメモは、STD 58、RFC 2578 [RFC2578]、STD 58、RFC 2579 [RFC2579]とSTD 58、RFC 2580 [RFC2580]に記載されているSMIv2のに準拠しているMIBモジュールを指定します。"
    },
    {
      "indent": 0,
      "text": "2. Overview",
      "section_title": true,
      "ja": "2.概要"
    },
    {
      "indent": 3,
      "text": "There is a need for a standardized way of representing a single agent, which supports multiple instances of one MIB. This is presently true for at least 3 standard MIBs, and is likely to become true for more and more MIBs as time passes. For example:",
      "ja": "1つのMIBの複数のインスタンスをサポートする単一のエージェントを、表現の標準化された方法が必要です。これは、少なくとも3つの標準MIBのために現在真であり、時間が経過するにつれて、より多くのMIBのための真になりそうです。例えば："
    },
    {
      "indent": 3,
      "text": "- multiple instances of a bridge supported within a single device that has a single agent;",
      "ja": " - 単一の薬剤を有する単一の装置内に支持ブリッジの複数のインスタンス。"
    },
    {
      "indent": 3,
      "text": "- multiple repeaters supported by a single agent;",
      "ja": " - 単一のエージェントによってサポートされる複数のリピータ。"
    },
    {
      "indent": 3,
      "text": "- multiple OSPF backbone areas, each operating as part of its own Autonomous System, and each identified by the same area-id (e.g., 0.0.0.0), supported inside a single router with one agent.",
      "ja": " - 複数OSPFバックボーン領域は、それぞれが独自の自律システムの一部として動作し、それぞれが同じエリアIDによって識別される（例えば、0.0.0.0）、一つの薬剤を有する単一のルータの内側に支持されています。"
    },
    {
      "indent": 3,
      "text": "The single agent present in each of these cases implies a relationship binds these entities. Effectively, there is some \"overall\" physical entity which houses the sum of the things managed by that one agent, i.e., there are multiple \"logical\" entities within a single physical entity. Sometimes, the overall physical entity contains multiple (smaller) physical entities, and each logical entity is associated with a particular physical entity. Sometimes, the overall physical entity is a \"compound\" of multiple physical entities (e.g., a stack of stackable hubs).",
      "ja": "これらの各場合に存在する単一のエージェントは、これらのエンティティの関係をバインドすることを意味します。事実上、その1つのエージェントで管理されるものの合計を収容するいくつかの「全体的な」物理的実体がある、すなわち、単一の物理エンティティ内に複数の「論理」の実体があります。時々、全体的な物理的なエンティティは、複数の（より小さい）の物理エンティティを含み、各論理エンティティは、特定の物理的なエンティティに関連付けられています。時々、全体的な物理的なエンティティは、複数の物理エンティティ（例えば、積み重ね可能なハブのスタック）の「化合物」です。"
    },
    {
      "indent": 3,
      "text": "What is needed is a way to determine exactly which logical entities are managed by the agent (with some version of SNMP) in order to communicate with the agent about a particular logical entity. When different logical entities are associated with different physical entities within the overall physical entity, it is also useful to be able to use this information to distinguish between logical entities.",
      "ja": "必要なものは、特定の論理エンティティについてのエージェントと通信するために、論理的なエンティティは（SNMPのいくつかのバージョンで）エージェントによって管理されているかを正確に決定する方法です。異なる論理エンティティが全体的な物理的実体内の異なる物理エンティティに関連付けられている場合、論理エンティティを区別するためにこの情報を使用できるようにも有用です。"
    },
    {
      "indent": 3,
      "text": "In these situations, there is no need for varbinds for multiple logical entities to be referenced in the same SNMP message (although that might be useful in the future). Rather, it is sufficient, and in some situations preferable, to have the context/community in the message identify the logical entity to which the varbinds apply.",
      "ja": "このような状況では、（それが将来的に役に立つかもしれませんが）同じSNMPメッセージで参照される複数の論理的なエンティティのためのvarbindは必要ありません。むしろ、それは十分であり、好ましい状況では、持っているメッセージのコンテキスト/コミュニティは変数バインドが適用される論理エンティティを識別する。"
    },
    {
      "indent": 3,
      "text": "Version 2 of this MIB addresses new requirements, which have emerged since the publication of the first Entity MIB (RFC 2037 [RFC2037]). There is a need for a standardized way of providing non-volatile, administratively-assigned identifiers for physical components represented with the Entity MIB. There is also a need to align the Entity MIB with the SNMPv3 administrative framework (STD 62, RFC 3411 [RFC3411]). Implementation experience has shown that additional physical component attributes are also desirable.",
      "ja": "このMIBのバージョン2は、第1のエンティティMIB（RFC 2037 [RFC2037]）の出版以降出現した新たな要件を対処します。エンティティMIBで表さ物理的なコンポーネントのための非揮発性、管理上割り当てられた識別子を提供する標準化された方法が必要です。 SNMPv3の管理フレームワーク（STD 62、RFC 3411 [RFC3411]）を持つエンティティMIBを整列させる必要もあります。実装経験は、追加の物理コンポーネント属性も望ましいものであることが示されています。"
    },
    {
      "indent": 3,
      "text": "Version 3 of this MIB addresses new requirements, which have emerged since the publication of the second Entity MIB (RFC 2737 [RFC2737]). There is a need to identify physical entities that are central processing units (CPUs) and a need to provide a textual convention that identifies an entPhysicalIndex value or zero, where the value zero has application-specific semantics. Two new objects have been added to the entPhysicalTable to identify the manufacturing date and provide additional URIs for a particular physical entity.",
      "ja": "このMIBのバージョン3は、第2のエンティティMIB（RFC 2737 [RFC2737]）の出版以降出現した新たな要件を対処します。中央処理装置（CPU）と、値ゼロは、アプリケーション固有の意味を有するのentPhysicalIndex値またはゼロを識別するテキストの表記法を、提供することが必要である物理的実体を同定する必要があります。二つの新しいオブジェクトは、製造日を特定し、特定の物理的なエンティティのための追加のURIを提供するのentPhysicalTableに追加されました。"
    },
    {
      "indent": 0,
      "text": "2.1. Terms",
      "section_title": true,
      "ja": "2.1. 条項"
    },
    {
      "indent": 3,
      "text": "Some new terms are used throughout this document:",
      "ja": "いくつかの新しい用語が本書全体で使用されています。"
    },
    {
      "indent": 3,
      "text": "- Naming Scope A \"naming scope\" represents the set of information that may be potentially accessed through a single SNMP operation. All instances within the naming scope share the same unique identifier space. For SNMPv1, a naming scope is identified by the value of the associated 'entLogicalCommunity' instance. For SNMPv3, the term 'context' is used instead of 'naming scope'. The complete definition of an SNMP context can be found in section 3.3.1 of RFC 3411 [RFC3411].",
      "ja": " - 「スコープネーミング」ネーミングスコープA潜在的に単一のSNMP操作を介してアクセスすることができる情報の集合を表します。命名スコープ内のすべてのインスタンスが同じ一意の識別子空間を共有しています。 SNMPv1のために、命名範囲は、関連する「entLogicalCommunity」インスタンスの値によって識別されます。 SNMPv3のために、用語「コンテキストは」の代わりに「命名スコープ」が使用されています。 SNMPコンテキストの完全な定義は、RFC 3411 [RFC3411]のセクション3.3.1に見出すことができます。"
    },
    {
      "indent": 3,
      "text": "- Multi-Scoped Object A MIB object, for which identical instance values identify different managed information in different naming scopes, is called a \"multi-scoped\" MIB object.",
      "ja": " - マルチスコープMIBオブジェクトをオブジェクト、同じインスタンスの値が異なる命名スコープに異なる管理情報を識別するため、「マルチスコープ」MIBオブジェクトと呼ばれます。"
    },
    {
      "indent": 3,
      "text": "- Single-Scoped Object A MIB object, for which identical instance values identify the same managed information in different naming scopes, is called a \"single-scoped\" MIB object.",
      "ja": " - シングルスコープが同じインスタンスの値が異なる命名スコープ内の同じ管理情報を識別対象のMIBオブジェクトを、オブジェクト、「単一スコープ」MIBオブジェクトと呼ばれます。"
    },
    {
      "indent": 3,
      "text": "- Logical Entity A managed system contains one or more logical entities, each represented by at most one instantiation of each of a particular set of MIB objects. A set of management functions is associated with each logical entity. Examples of logical entities include routers, bridges, print-servers, etc.",
      "ja": " - 論理エンティティAは、システムが1つまたは複数の論理エンティティ、MIBオブジェクトの特定のセットのそれぞれの最大1つのインスタンスで表される各が含まれて管理されます。管理機能のセットは、各論理エンティティに関連付けられます。論理エンティティの例としては、ルータ、ブリッジ、プリント・サーバなどが含まれます"
    },
    {
      "indent": 3,
      "text": "- Physical Entity A \"physical entity\" or \"physical component\" represents an identifiable physical resource within a managed system. Zero or more logical entities may utilize a physical resource at any given time. Determining which physical components are represented by an agent in the EntPhysicalTable is an implementation-specific matter. Typically, physical resources (e.g., communications ports, backplanes, sensors, daughter-cards, power supplies, the overall chassis), which can be managed via functions associated with one or more logical entities, are included in the MIB.",
      "ja": " - 物理エンティティA「物理的実体」または「物理的な構成要素は、」管理されたシステム内の識別可能な物理リソースを表します。ゼロ個以上の論理エンティティは、任意の時点で物理リソースを利用することができます。物理的成分はentPhysicalTableのエージェントによって表されるかを決定することは、実装に固有の問題です。典型的には、一つ以上の論理エンティティに関連付けられた機能を介して管理することができる物理リソース（例えば、通信ポート、バックプレーン、センサ、ドーターカード、電源装置、シャーシ全体）は、MIBに含まれています。"
    },
    {
      "indent": 3,
      "text": "- Containment Tree Each physical component may be modeled as 'contained' within another physical component. A \"containment-tree\" is the conceptual sequence of entPhysicalIndex values that uniquely specifies the exact physical location of a physical component within the managed system. It is generated by 'following and recording' each 'entPhysicalContainedIn' instance 'up the tree towards the root', until a value of zero indicating no further containment is found.",
      "ja": " - 封じ込めツリーは、各物理コンポーネントが別の物理的構成要素内に「含まれる」としてモデル化することができます。 「包含ツリー」が一意に管理されたシステム内の物理コンポーネントの正確な物理的位置を特定のentPhysicalIndex値の概念的な配列です。さらなる封じ込めがないことを示すゼロの値が発見されるまでは、「以下と記録」「ルートに向かってツリーアップ」はそれぞれ「entPhysicalContainedIn」インスタンスによって生成されます。"
    },
    {
      "indent": 0,
      "text": "2.2. Relationship to Community Strings",
      "section_title": true,
      "ja": "2.2. コミュニティストリングとの関係"
    },
    {
      "indent": 3,
      "text": "For community-based SNMP, differentiating logical entities is one (but not the only) purpose of the community string (RFC 1157 [RFC1157]). This is accommodated by representing each community string as a logical entity.",
      "ja": "コミュニティベースのSNMPのために、論理的なエンティティを区別することはコミュニティ文字列（RFC 1157 [RFC1157]）の1（だけでなく）目的です。これは、論理的なエンティティとして各コミュニティストリングを表すことによって収容されています。"
    },
    {
      "indent": 3,
      "text": "Note that different logical entities may share the same naming scope and, therefore, the same values of entLogicalCommunity. This is possible, providing they have no need for the same instance of a MIB object to represent different managed information.",
      "ja": "entLogicalCommunityの同じ値、従って、異なる論理エンティティが同じ命名スコープを共有してもよいことに留意されたいと。これは、彼らが別の管理された情報を表現するためのMIBオブジェクトの同じインスタンスを必要としない提供し、可能です。"
    },
    {
      "indent": 0,
      "text": "2.3. Relationship to SNMP Contexts",
      "section_title": true,
      "ja": "2.3.  SNMPコンテキストとの関係"
    },
    {
      "indent": 3,
      "text": "Version 2 of the Entity MIB contains support for associating SNMPv3 contexts with logical entities. Two new MIB objects, defining an SnmpEngineID and ContextName pair, are used together to identify an SNMP context associated with a logical entity. This context can be used (in conjunction with the entLogicalTAddress and entLogicalTDomain MIB objects) to send SNMPv3 messages on behalf of a particular logical entity.",
      "ja": "エンティティMIBのバージョン2は、論理的なエンティティとのSNMPv3コンテキストを関連付けるためのサポートが含まれています。 snmpEngineIDとのcontextNameペアを規定する2つの新たなMIBオブジェクトは、論理的なエンティティに関連付けられたSNMPコンテキストを識別するために一緒に使用されます。このコンテキストは、特定の論理エンティティの代わりにSNMPv3メッセージを送信する（entLogicalTAddressとentLogicalTDomain MIBオブジェクトに関連して）使用することができます。"
    },
    {
      "indent": 0,
      "text": "2.4. Relationship to Proxy Mechanisms",
      "section_title": true,
      "ja": "2.4. プロキシのメカニズムとの関係"
    },
    {
      "indent": 3,
      "text": "The Entity MIB is designed to allow functional component discovery. The administrative relationships between different logical entities are not visible in any Entity MIB tables. A Network Management System (NMS) cannot determine whether MIB instances in different naming scopes are realized locally or remotely (e.g., via some proxy mechanism) by examining any particular Entity MIB objects.",
      "ja": "エンティティMIBは、機能性成分の検出を許可するように設計されています。別の論理エンティティ間の行政関係はどのエンティティMIBテーブルには表示されません。ネットワーク管理システム（NMS）は、任意の特定のエンティティMIBオブジェクトを調べることによって、異なる命名スコープにおけるMIBのインスタンスが（いくつかのプロキシ機構を介して、例えば）ローカルまたはリモートで実現されるかどうかを決定することができません。"
    },
    {
      "indent": 3,
      "text": "The management of administrative framework functions is not an explicit goal of the Entity MIB WG at this time. This new area of functionality may be revisited after some operational experience with the Entity MIB is gained.",
      "ja": "管理フレームワーク機能の管理は、この時点では、エンティティMIB WGの明確な目標ではありません。エンティティMIBといくつかの運用経験が獲得された後、この機能の新しい領域が再訪することができます。"
    },
    {
      "indent": 3,
      "text": "Note that for community-based versions of SNMP, a network administrator will likely be able to associate community strings with naming scopes that have proprietary mechanisms, as a matter of configuration. There are no mechanisms for managing naming scopes defined in this MIB.",
      "ja": "SNMPのコミュニティベースのバージョンのために、ネットワーク管理者は、おそらく設定の問題として、独自のメカニズムを持っているスコープを命名して、コミュニティストリングを関連付けることができるようになりますので注意してください。このMIBで定義された名前のスコープを管理するためのメカニズムはありません。"
    },
    {
      "indent": 0,
      "text": "2.5. Relationship to a Chassis MIB",
      "section_title": true,
      "ja": "2.5. シャーシMIBとの関係"
    },
    {
      "indent": 3,
      "text": "Some readers may recall that a previous IETF working group attempted to define a Chassis MIB. No consensus was reached by that working group, possibly because its scope was too broad. As such, it is not the purpose of this MIB to be a \"Chassis MIB replacement\", nor is it within the scope of this MIB to contain all the information which might be necessary to manage a \"chassis\". On the other hand, the entities represented by an implementation of this MIB might well be contained in a chassis.",
      "ja": "一部の読者は、以前のIETFワーキンググループは、シャーシMIBを定義しようとしたことを思い出すことがあります。コンセンサスは、その範囲が広すぎた可能性があるため、そのワーキンググループによって到達しませんでした。このように、「シャーシMIBの交換」になるこのMIBの目的ではない、またそれは、「シャーシ」を管理するのに必要であるかもしれないすべての情報が含まれているために、このMIBの範囲内です。一方、このMIBの実装によって表される実体はよくシャーシに含まれている可能性があります。"
    },
    {
      "indent": 0,
      "text": "2.6. Relationship to the Interfaces MIB",
      "section_title": true,
      "ja": "2.6. インタフェースMIBとの関係"
    },
    {
      "indent": 3,
      "text": "The Entity MIB contains a mapping table identifying physical components that have 'external values' (e.g., ifIndex) associated with them within a given naming scope. This table can be used to identify the physical location of each interface in the ifTable (RFC 2863 [RFC2863]). Because ifIndex values in different contexts are not related to one another, the interface to physical component associations are relative to the same logical entity within the agent.",
      "ja": "エンティティMIBは、与えられた命名範囲内でそれらに関連付けられた「外部値」（例えば、ifIndexの）を有する物理的な構成要素を識別するマッピングテーブルを含みます。このテーブルはifTableの各インタフェース（RFC 2863 [RFC2863]）の物理的位置を識別するために使用することができます。異なるコンテキストでifIndex値が互いに関連していないので、物理的構成要素の関連付けへのインターフェースは、エージェント内の同じ論理エンティティに対するものです。"
    },
    {
      "indent": 3,
      "text": "The Entity MIB also contains 'entPhysicalName' and 'entPhysicalAlias' objects, which approximate the semantics of the 'ifName' and 'ifAlias' objects (respectively) from the Interfaces MIB [RFC2863], for all types of physical components.",
      "ja": "エンティティMIBはまた、物理的構成要素のすべてのタイプのために、インタフェースMIB [RFC2863]から「のifName」と「ifAlias」オブジェクト（それぞれ）のセマンティクスを近似「のentPhysicalName」と「のentPhysicalAlias」オブジェクトを含んでいます。"
    },
    {
      "indent": 0,
      "text": "2.7. Relationship to the Other MIBs",
      "section_title": true,
      "ja": "2.7. その他のMIBとの関係"
    },
    {
      "indent": 3,
      "text": "The Entity MIB contains a mapping table identifying physical components that have identifiers from other standard MIBs associated with them. For example, this table can be used along with the physical mapping table to identify the physical location of each repeater port in the rptrPortTable, or each interface in the ifTable.",
      "ja": "エンティティMIBは、それらに関連付けられている他の標準MIBから識別子を有する物理的な構成要素を識別するマッピングテーブルを含みます。例えば、このテーブルはrptrPortTableにおける各中継ポートの物理的位置、またはifTableの各インタフェースを識別するために、物理的マッピングテーブルと共に使用することができます。"
    },
    {
      "indent": 0,
      "text": "2.8. Relationship to Naming Scopes",
      "section_title": true,
      "ja": "2.8. 命名スコープとの関係"
    },
    {
      "indent": 3,
      "text": "There is some question as to which MIB objects may be returned within a given naming scope. MIB objects which are not multi-scoped within a managed system are likely to ignore context information in implementation. In such a case, it is likely such objects will be returned in all naming scopes (e.g., not just the 'default' naming scope or the SNMPv3 default context).",
      "ja": "これにMIBオブジェクトが与えられた命名範囲内で返されることがありますよう、いくつかの質問があります。管理対象システム内のマルチスコープでないMIBオブジェクトが実装にコンテキスト情報を無視する可能性があります。このような場合には、おそらく、そのようなオブジェクトは、すべての命名スコープ（例えば、だけでなく、「デフォルト」命名範囲またはSNMPv3のデフォルトコンテキスト）に返されるです。"
    },
    {
      "indent": 3,
      "text": "For example, a community string used to access the management information for logical device 'bridge2' may allow access to all the non-bridge related objects in the 'default' naming scope, as well as a second instance of the Bridge MIB (RFC 1493 [RFC1493]).",
      "ja": "例えば、論理デバイスのbridge2 'の管理情報にアクセスするために使用されるコミュニティ文字列は、すべての範囲を命名「デフォルト」における非ブリッジ関連オブジェクト、ならびにブリッジMIB（RFC 1493の2番目のインスタンスへのアクセスを可能にすることができます[RFC1493]）。"
    },
    {
      "indent": 3,
      "text": "The isolation of single-scoped MIB objects by the agent is an implementation-specific matter. An agent may wish to limit the objects returned in a particular naming scope to only the multi-scoped objects in that naming scope (e.g., system group and the Bridge MIB). In this case, all single-scoped management information would belong to a common naming scope (e.g., 'default'), which itself may contain some multi-scoped objects (e.g., system group).",
      "ja": "エージェントによって単一スコープMIBオブジェクトの単離は、実装固有の問題です。エージェントは、その命名スコープ（例えば、システムのグループとブリッジMIB）でのみマルチスコープオブジェクトに特定の命名スコープで返されるオブジェクトを制限することを望むかもしれません。この場合には、全て単一スコープ管理情報自体は、いくつかのマルチスコープオブジェクト（例えば、システム・グループ）を含んでいてもよい一般的な命名スコープ（例えば、「デフォルト」）に属することになります。"
    },
    {
      "indent": 0,
      "text": "2.9. Multiple Instances of the Entity MIB",
      "section_title": true,
      "ja": "2.9. エンティティMIBの複数インスタンス"
    },
    {
      "indent": 3,
      "text": "It is possible that more than one agent may exist in a managed system. In such cases, multiple instances of the Entity MIB (representing the same managed objects) may be available to an NMS.",
      "ja": "複数のエージェントが管理対象システム内に存在する可能性があります。このような場合には、エンティティMIBの複数のインスタンス（同じ管理オブジェクトを表す）は、NMSに利用可能であってもよいです。"
    },
    {
      "indent": 3,
      "text": "In order to reduce complexity for agent implementation, multiple instances of the Entity MIB are not required to be equivalent or even consistent. An NMS may be able to 'align' instances returned by different agents by examining the columns of each table, but vendor-specific identifiers and (especially) index values are likely to be different. Each agent may be managing different subsets of the entire chassis as well.",
      "ja": "エージェント実装のための複雑さを軽減するために、エンティティMIBの複数のインスタンスは同等、あるいは一貫性のあることが要求されていません。 NMSは、各テーブルの列を調べることによって、異なる薬剤によって返される「整列」のインスタンスにできるかもしれないが、ベンダ固有の識別子は、（特に）インデックス値は異なる可能性があります。各エージェントは、同様に、シャーシ全体の異なるサブセットを管理することができます。"
    },
    {
      "indent": 3,
      "text": "When all of a physically-modular device is represented by a single agent, the entry (for which entPhysicalContainedIn has the value zero) would likely have 'chassis' as the value of its entPhysicalClass. Alternatively, for an agent on a module where the agent represents only the physical entities on that module (not those on other modules), the entry (for which entPhysicalContainedIn has the value zero) would likely have 'module' as the value of its entPhysicalClass.",
      "ja": "物理的にモジュラーデバイスの全てが単一のエージェントによって表される場合、（entPhysicalContainedInはゼロの値を持っている）エントリは、おそらくそのentPhysicalClassの値として「シャーシ」を有することになります。あるいは、薬剤はそのモジュールにのみ物理エンティティ（他のモジュールではないもの）を表し、モジュール上のエージェントのために、（entPhysicalContainedInはゼロの値を持っている）エントリは、おそらくそのentPhysicalClassの値として「モジュール」を有するであろう。"
    },
    {
      "indent": 3,
      "text": "An agent implementation of the entLogicalTable is not required to contain information about logical entities managed primarily by other agents. That is, the entLogicalTAddress and entLogicalTDomain objects in the entLogicalTable are provided to support an historical multiplexing mechanism, not to identify other SNMP agents.",
      "ja": "entLogicalTableのエージェントの実装は、主に他のエージェントによって管理される論理エンティティについての情報を含むために必要とされていません。すなわち、entLogicalTableでentLogicalTAddressとentLogicalTDomainオブジェクトは、他のSNMPエージェントを同定するのではなく、歴史的な多重化メカニズムをサポートするために提供されます。"
    },
    {
      "indent": 3,
      "text": "Note that the Entity MIB is a single-scoped MIB, in the event an agent represents the MIB in different naming scopes.",
      "ja": "エンティティMIBエージェントが異なる命名スコープでMIBを表した場合に、単一スコープMIBであることに注意してください。"
    },
    {
      "indent": 0,
      "text": "2.10. Re-Configuration of Entities",
      "section_title": true,
      "ja": "2.10. エンティティの再設定"
    },
    {
      "indent": 3,
      "text": "Most of the MIB objects defined in this MIB have, at most, a read-only MAX-ACCESS clause. This is a conscious decision by the working group to limit this MIB's scope. The second version of the Entity MIB allows a network administrator to configure some common attributes of physical components.",
      "ja": "このMIBで定義されたMIBオブジェクトのほとんどは、最大で、読み取り専用MAX-ACCESS節を持っています。これは、このMIBの範囲を限定するワーキンググループによる意識的な決定です。エンティティMIBの第二のバージョンは、ネットワーク管理者は、物理的なコンポーネントのいくつかの共通の属性を設定することができます。"
    },
    {
      "indent": 0,
      "text": "2.11. Textual Convention Change",
      "section_title": true,
      "ja": "2.11. テキストの表記法の変更"
    },
    {
      "indent": 3,
      "text": "Version 1 of the Entity MIB contains three MIB objects defined with the (now obsolete) DisplayString textual convention. In version 2 of the Entity MIB, the syntax for these objects has been updated to use the (now preferred) SnmpAdminString textual convention.",
      "ja": "エンティティMIBのバージョン1は、（現在は廃止）のDisplayStringテキストの表記法で定義された3つのMIBオブジェクトが含まれています。エンティティMIBのバージョン2では、これらのオブジェクトの構文は（今優先）れるSnmpAdminStringテキストの表記法を使用するように更新されました。"
    },
    {
      "indent": 3,
      "text": "The working group realizes that this change is not strictly supported by SMIv2. In our judgment, the alternative of deprecating the old objects and defining new objects would have a more adverse impact on backward compatibility and interoperability, given the particular semantics of these objects.",
      "ja": "ワーキンググループは、この変更は、厳密にSMIv2のでサポートされていないことを実現しています。当方の判断では、古いオブジェクトを非推奨と新しいオブジェクトを定義する代わりに、これらのオブジェクトの特定の意味論与えられ、下位互換性と相互運用性に関する詳細不利な影響を与えるだろう。"
    },
    {
      "indent": 0,
      "text": "2.12. MIB Structure",
      "section_title": true,
      "ja": "2.12.  MIBの構造"
    },
    {
      "indent": 3,
      "text": "The Entity MIB contains five groups of MIB objects:",
      "ja": "エンティティMIBは、MIBオブジェクトの5つのグループが含まれています。"
    },
    {
      "indent": 3,
      "text": "- entityPhysical group Describes the physical entities managed by a single agent.",
      "ja": " -  entityPhysicalグループは、単一のエージェントで管理される物理エンティティを記述します。"
    },
    {
      "indent": 3,
      "text": "- entityLogical group Describes the logical entities managed by a single agent.",
      "ja": " -  entityLogicalグループは、単一のエージェントで管理される論理エンティティを記述します。"
    },
    {
      "indent": 3,
      "text": "- entityMapping group Describes the associations between the physical entities, logical entities, interfaces, and non-interface ports managed by a single agent.",
      "ja": " -  entityMappingグループのグループは、単一のエージェントによって管理される物理エンティティ、論理エンティティ、インタフェース、および非インタフェースポートとの間の関連を記述する。"
    },
    {
      "indent": 3,
      "text": "- entityGeneral group Describes general system attributes shared by potentially all types of entities managed by a single agent.",
      "ja": " -  entityGeneralグループは、1つのエージェントで管理されるほぼすべてのタイプのエンティティが共有する一般的なシステム属性を記述します。"
    },
    {
      "indent": 3,
      "text": "- entityNotifications group Contains status indication notifications.",
      "ja": " -  entityNotificationsグループは、ステータス表示通知が含まれています。"
    },
    {
      "indent": 0,
      "text": "2.12.1. entityPhysical Group",
      "section_title": true,
      "ja": "2.12.1.  entityPhysicalグループ"
    },
    {
      "indent": 3,
      "text": "This group contains a single table to identify physical system components, called the entPhysicalTable.",
      "ja": "このグループは、entPhysicalTableのと呼ばれる物理的なシステム構成要素を識別するために単一のテーブルを含みます。"
    },
    {
      "indent": 3,
      "text": "The entPhysicalTable contains one row per physical entity, and must always contain at least one row for an \"overall\" physical entity, which should have an entPhysicalClass value of 'stack(11)', 'chassis(3)' or 'module(9)'.",
      "ja": "entPhysicalTableの物理エンティティごとに1行を含み、常にのentPhysicalClassの値を有するべきである「全体的な」は、物理的実体、「スタック（11）」、「シャーシ（3）」または「モジュール（9ための少なくとも一つの列を含んでいなければなりません「）。"
    },
    {
      "indent": 3,
      "text": "Each row is indexed by an arbitrary, small integer, and contains a description and type of the physical entity. It also optionally contains the index number of another entPhysicalEntry, indicating a containment relationship between the two.",
      "ja": "各行は、任意の、小さな整数によって索引付け、および物理的なエンティティの記述およびタイプが含まれます。それはまた、必要に応じて両者間の包含関係を示す、別のentPhysicalEntryのインデックス番号を含みます。"
    },
    {
      "indent": 3,
      "text": "Version 2 of the Entity MIB provides additional MIB objects for each physical entity. Some common read-only attributes have been added, as well as three writable string objects.",
      "ja": "エンティティMIBのバージョン2は、それぞれの物理的なエンティティのための追加MIBオブジェクトを提供します。いくつかの一般的な読み取り専用の属性が追加さだけでなく、3つの書き込み可能な文字列オブジェクトされています。"
    },
    {
      "indent": 3,
      "text": "- entPhysicalAlias This string can be used by an NMS as a non-volatile identifier for the physical component. Maintaining a non-volatile string for every physical component represented in the entPhysicalTable can be costly and unnecessary. An agent may algorithmically generate 'entPhysicalAlias' strings for particular entries (e.g., based on the entPhysicalClass value).",
      "ja": " - のentPhysicalAliasこの文字列は、物理的なコンポーネントのための非揮発性識別子としてNMSによって使用することができます。 entPhysicalTableに示されるすべての物理的なコンポーネントのための非揮発性ストリングを維持することは費用がかかり、不要とすることができます。エージェントは、アルゴリズム特定のエントリ（例えば、entPhysicalClassの値に基づいて）のために「のentPhysicalAlias」文字列を生成することができます。"
    },
    {
      "indent": 3,
      "text": "- entPhysicalAssetID This string is provided to store a user-specific asset identifier for removable physical components. In order to reduce the non-volatile storage needed by a particular agent, a network administrator should only assign asset identifiers to physical entities that are field-replaceable (i.e., not permanently contained within another physical entity).",
      "ja": " -  entPhysicalAssetIDこの文字列は、取り外し可能な物理的構成要素のためのユーザ固有の資産識別子を記憶するために設けられています。特定のエージェントが必要とする不揮発性記憶装置を低減するために、ネットワーク管理者は、現場交換可能（すなわち、永久的に別の物理エンティティ内に含まれていない）である物理エンティティに資産識別子を割り当てるべきです。"
    },
    {
      "indent": 3,
      "text": "- entPhysicalSerialNum This string is provided to store a vendor-specific serial number string for physical components. This writable object is used when an agent cannot identify the serial numbers of all installed physical entities, and a network administrator wishes to configure the non-volatile serial number strings manually (via an NMS application).",
      "ja": " - のentPhysicalSerialNumこの文字列は、物理コンポーネントのベンダー固有のシリアル番号文字列を格納するために設けられています。エージェントがインストールされているすべての物理エンティティのシリアル番号を識別できない場合、この書き込み可能なオブジェクトが使用され、ネットワーク管理者は、（NMSアプリケーションを介して）手動で不揮発性のシリアル番号文字列を設定することを望みます。"
    },
    {
      "indent": 3,
      "text": "Version 3 of the Entity MIB provides two additional MIB objects for each physical entity:",
      "ja": "エンティティMIBのバージョン3は、それぞれの物理的なエンティティのための2つの追加MIBオブジェクトを提供します。"
    },
    {
      "indent": 3,
      "text": "- entPhysicalMfgDate This object contains the date of manufacturing of the managed entity. If the manufacturing date is unknown or not supported the object is not instantiated. The special value '0000000000000000'H may also be returned in this case.",
      "ja": " -  entPhysicalMfgDateこのオブジェクトは、管理対象エンティティの製造日が含まれています。製造日が不明であるか、サポートされていない場合は、オブジェクトがインスタンス化されていません。特殊な値「0000000000000000'Hは、この場合にも返されることがあります。"
    },
    {
      "indent": 3,
      "text": "- entPhysicalUris This object provides additional identification information about the physical entity.",
      "ja": " -  entPhysicalUrisこのオブジェクトは物理的なエンティティに関する追加の識別情報を提供します。"
    },
    {
      "indent": 5,
      "text": "This object contains one or more Uniform Resource Identifiers (URIs) and, therefore, the syntax of this object must conform to RFC 3986 [RFC3986] section 2. Uniform Resource Names (URNs), RFC 3406 [RFC3406], are resource identifiers with the specific requirements for enabling location independent identification of a resource, as well as longevity of reference. URNs are part of the larger URI family with the specific goal of providing persistent naming of resources. URI schemes and URN name spaces are registered by IANA (see http://www.iana.org/assignments/uri-schemes and http://www.iana.org/assignments/urn-namespaces).",
      "ja": "このオブジェクトは、1つまたは複数のUniform Resource Identifier（URI）を含んでおり、従って、このオブジェクトの構文は、RFC 3986に準拠している必要があり、[RFC3986]セクション2ユニフォームリソース名（のURN）、RFC 3406 [RFC3406]とリソース識別子であります位置独立のリソースの識別、ならびに参照の寿命を可能にするための特定の要件。 URNのは、資源の持続的な命名を提供するという具体的な目標を持つ大規模URIファミリーの一部です。 URIスキームとURN名前空間はIANA（http://www.iana.org/assignments/uri-schemesとhttp://www.iana.org/assignments/urn-namespacesを参照）によって登録されています。"
    },
    {
      "indent": 5,
      "text": "For example, the entPhysicalUris object may be used to encode a URI containing a Common Language Equipment Identifier (CLEI) URN for the managed physical entity. The URN name space for CLEIs is defined in [RFC4152], and the CLEI format is defined in [T1.213][T1.213a]. For example, an entPhysicalUris instance may have the value of",
      "ja": "例えば、entPhysicalUrisオブジェクトが管理される物理エンティティの共通言語機器識別子（CLEI）URNを含むURIを符号化するために使用されてもよいです。 【T1.213a] CLEIsためのURN名前空間は[RFC4152]で定義され、およびCLEIフォーマットは[T1.213]で定義されています。例えば、entPhysicalUrisインスタンスは、の値を有していてもよいです"
    },
    {
      "indent": 8,
      "text": "URN:CLEI:D4CE18B7AA",
      "ja": "URN：GLUE：D4CE18B7AA"
    },
    {
      "indent": 5,
      "text": "[RFC3986] and [RFC4152] identify this as a URI in the CLEI URN name space. The specific CLEI code, D4CE18B7AA, is based on the example provided in [T1.213a].",
      "ja": "[RFC3986]及び[RFC4152]はCLEI URNの名前空間内のURIとしてこれを識別する。特定CLEIコード、D4CE18B7AAは、[T1.213a]に提供された例に基づいています。"
    },
    {
      "indent": 5,
      "text": "Multiple URIs may be present and are separated by white space characters. Leading and trailing white space characters are ignored.",
      "ja": "複数のURIが存在してもよいし、空白文字によって分離されます。先頭と末尾の空白文字は無視されます。"
    },
    {
      "indent": 5,
      "text": "If no additional identification information is known about the physical entity or supported, the object is not instantiated.",
      "ja": "追加の識別情報が物理的なエンティティについて知られていない、またはサポートされている場合、オブジェクトがインスタンス化されていません。"
    },
    {
      "indent": 0,
      "text": "2.12.2. entityLogical Group",
      "section_title": true,
      "ja": "2.12.2.  entityLogicalグループ"
    },
    {
      "indent": 3,
      "text": "This group contains a single table to identify logical entities, called the entLogicalTable.",
      "ja": "このグループはentLogicalTableと呼ばれる、論理的なエンティティを識別するための単一のテーブルが含まれています。"
    },
    {
      "indent": 3,
      "text": "The entLogicalTable contains one row per logical entity. Each row is indexed by an arbitrary, small integer and contains a name, description, and type of the logical entity. It also contains information to allow access to the MIB information for the logical entity. This includes SNMP versions that use a community name (with some form of implied context representation) and SNMP versions that use the SNMP ARCH [RFC3411] method of context identification.",
      "ja": "entLogicalTable論理エンティティごとに1つの行を含んでいます。各行は、任意の、小さな整数によって索引付けおよび論理エンティティの名前、説明、およびタイプが含まれます。また、論理的なエンティティのためのMIB情報へのアクセスを許可するための情報が含まれています。これは、コンテキスト識別のSNMP ARCH [RFC3411]の方法を使用するSNMPバージョン（暗黙のコンテキスト表現の何らかの形で）コミュニティ名を使用するSNMPバージョンを含みます。"
    },
    {
      "indent": 3,
      "text": "If an agent represents multiple logical entities with this MIB, then this group must be implemented for all logical entities known to the agent.",
      "ja": "エージェントはこのMIBと複数の論理エンティティを表す場合、このグループはエージェントに知られているすべての論理エンティティのために実装する必要があります。"
    },
    {
      "indent": 3,
      "text": "If an agent represents a single logical entity, or multiple logical entities within a single naming scope, then implementation of this group may be omitted by the agent.",
      "ja": "エージェントは、単一の論理エンティティ、または単一の命名範囲内の複数の論理エンティティを表す場合、このグループの実装は、エージェントによって省略してもよいです。"
    },
    {
      "indent": 0,
      "text": "2.12.3. entityMapping Group",
      "section_title": true,
      "ja": "2.12.3.  entityMappingグループグループ"
    },
    {
      "indent": 3,
      "text": "This group contains three tables to identify associations between different system components.",
      "ja": "このグループには、異なるシステムコンポーネント間の関連付けを識別するために、3つのテーブルを含んでいます。"
    },
    {
      "indent": 3,
      "text": "- entLPMappingTable This table contains mappings between entLogicalIndex values (logical entities) and entPhysicalIndex values (the physical components supporting that entity). A logical entity can map to more than one physical component, and more than one logical entity can map to (share) the same physical component. If an agent represents a single logical entity, or multiple logical entities within a single naming scope, then implementation of this table may be omitted by the agent.",
      "ja": " -  entLPMappingTableこのテーブルはentLogicalIndex値（論理エンティティ）とのentPhysicalIndex値（そのエンティティをサポートする物理的構成要素）との間のマッピングを含みます。論理エンティティは、複数の物理コンポーネントにマップすることができ、複数の論理エンティティは、（株）は、同じ物理的コンポーネントにマップすることができます。エージェントは、単一の論理エンティティ、または単一の命名範囲内の複数の論理エンティティを表す場合、この表の実装は、エージェントによって省略してもよいです。"
    },
    {
      "indent": 3,
      "text": "- entAliasMappingTable This table contains mappings between entLogicalIndex, entPhysicalIndex pairs, and 'alias' object identifier values. This allows resources managed with other MIBs (e.g., repeater ports, bridge ports, physical and logical interfaces) to be identified in the physical entity hierarchy. Note that each alias identifier is only relevant in a particular naming scope. If an agent represents a single logical entity, or multiple logical entities within a single naming scope, then implementation of this table may be omitted by the agent.",
      "ja": " -  entAliasMappingTableのこのテーブルはentLogicalIndex、のentPhysicalIndex対、および「エイリアス」オブジェクト識別子の値との間のマッピングを含みます。これは、他のMIB（例えば、リピータポート、ブリッジポート、物理的および論理的インターフェース）で管理されるリソースは、物理的なエンティティの階層内で識別されることを可能にします。各エイリアス識別子は特定の命名範囲にのみ関連することに注意してください。エージェントは、単一の論理エンティティ、または単一の命名範囲内の複数の論理エンティティを表す場合、この表の実装は、エージェントによって省略してもよいです。"
    },
    {
      "indent": 3,
      "text": "- entPhysicalContainsTable This table contains simple mappings between 'entPhysicalContainedIn' values for each container/'containee' relationship in the managed system. The indexing of this table allows an NMS to quickly discover the 'entPhysicalIndex' values for all children of a given physical entity.",
      "ja": " -  entPhysicalContainsTableはこのテーブルには、管理対象システムの各コンテナ/「containee」の関係のための「entPhysicalContainedIn」値の間の単純なマッピングが含まれています。このテーブルのインデックスは、NMSはすぐに与えられた物理的なエンティティのすべての子供たちのための「ますentPhysicalIndex」の値を発見することができます。"
    },
    {
      "indent": 0,
      "text": "2.12.4. entityGeneral Group",
      "section_title": true,
      "ja": "2.12.4.  entityGeneralグループ"
    },
    {
      "indent": 3,
      "text": "This group contains general information relating to the other object groups.",
      "ja": "このグループは、他のオブジェクトグループに関する一般的な情報が含まれています。"
    },
    {
      "indent": 3,
      "text": "At this time, the entGeneral group contains a single scalar object (entLastChangeTime), which represents the value of sysUptime when any part of the Entity MIB configuration last changed.",
      "ja": "このとき、entGeneral基は、エンティティMIBの構成のいずれかの部分が最後に変更sysUpTimeの値を表す単一のスカラオブジェクト（entLastChangeTime）を含みます。"
    },
    {
      "indent": 0,
      "text": "2.12.5. entityNotifications Group",
      "section_title": true,
      "ja": "2.12.5.  entityNotificationsグループ"
    },
    {
      "indent": 3,
      "text": "This group contains notification definitions relating to the overall status of the Entity MIB instantiation.",
      "ja": "このグループは、エンティティMIBインスタンスの全体的な状態に関する通知の定義が含まれています。"
    },
    {
      "indent": 0,
      "text": "2.13. Multiple Agents",
      "section_title": true,
      "ja": "2.13. 複数のエージェント"
    },
    {
      "indent": 3,
      "text": "Even though a primary motivation for this MIB is to represent the multiple logical entities supported by a single agent, another motivation is to represent multiple logical entities supported by multiple agents (in the same \"overall\" physical entity). Indeed, it is implicit in the SNMP architecture that the number of agents is transparent to a network management station.",
      "ja": "このMIBのための主要な動機は、単一のエージェントによってサポートされる複数の論理エンティティを表すためであっても、別の動機は（同じ「全体的な」物理的実体に）複数のエージェントによってサポートされる複数の論理エンティティを表すことです。確かに、それはエージェントの数は、ネットワーク管理ステーションに透明であるSNMPアーキテクチャにおける暗黙的です。"
    },
    {
      "indent": 3,
      "text": "However, there is no agreement at this time as to the degree of cooperation that should be expected for agent implementations. Therefore, multiple agents within the same managed system are free to implement the Entity MIB independently. (For more information, refer to Section 2.9, \"Multiple Instances of the Entity MIB\".)",
      "ja": "しかし、エージェントの実装のために期待されるべき協力の度合いとして、現時点では合意はありません。そのため、同じ管理システム内の複数のエージェントは、独立して、エンティティMIBを実装するのは自由です。 （詳細については、セクション2.9、「エンティティMIBの複数のインスタンス」を参照。）"
    },
    {
      "indent": 0,
      "text": "2.14. Changes Since ",
      "section_title": true,
      "ja": "2.14. 変化するため"
    },
    {
      "indent": 0,
      "text": "2.14.1. Textual Conventions",
      "section_title": true,
      "ja": "2.14.1. テキストの表記法"
    },
    {
      "indent": 3,
      "text": "The PhysicalClass TC text has been clarified, and a new enumeration to support 'stackable' components has been added. The SnmpEngineIdOrNone TC has been added to support SNMPv3.",
      "ja": "PhysicalClass TCテキストが明らかにされている、と「スタック可能な」コンポーネントをサポートするための新しい列挙が追加されました。 SnmpEngineIdOrNone TCにSNMPv3をサポートするために追加されました。"
    },
    {
      "indent": 0,
      "text": "2.14.2. New entPhysicalTable Objects",
      "section_title": true,
      "ja": "2.14.2. 新しいのentPhysicalTableオブジェクト"
    },
    {
      "indent": 3,
      "text": "The entPhysicalHardwareRev, entPhysicalFirmwareRev, and entPhysicalSoftwareRev objects have been added for revision identification.",
      "ja": "するentPhysicalHardwareRev、entPhysicalFirmwareRev、及びentPhysicalSoftwareRevオブジェクトが改訂識別のために追加されています。"
    },
    {
      "indent": 3,
      "text": "The entPhysicalSerialNum, entPhysicalMfgName, entPhysicalModelName, and entPhysicalIsFru objects have been added for better vendor identification for physical components. In the event the agent cannot identify this information, the entPhysicalSerialNum object can be set by a management station.",
      "ja": "entPhysicalSerialNum、entPhysicalMfgName、entPhysicalModelName、及びentPhysicalIsFruオブジェクトの物理的なコンポーネントのためのより良いベンダーの識別のために追加されています。イベントでは、薬剤は、この情報を特定できない、のentPhysicalSerialNumオブジェクトが管理ステーションによって設定することができます。"
    },
    {
      "indent": 3,
      "text": "The entPhysicalAlias and entPhysicalAssetID objects have been added for better user component identification. These objects are intended to be set by a management station and preserved by the agent across restarts.",
      "ja": "entPhysicalAliasとentPhysicalAssetIDオブジェクトは、より良いユーザ・コンポーネント識別のために追加されています。これらのオブジェクトは、管理ステーションによって設定され、再起動を横切るエージェントによって保存されることが意図されます。"
    },
    {
      "indent": 0,
      "text": "2.14.3. New entLogicalTable Objects",
      "section_title": true,
      "ja": "2.14.3. 新entLogicalTableオブジェクト"
    },
    {
      "indent": 3,
      "text": "The entLogicalContextEngineID and entLogicalContextName objects have been added to provide an SNMP context for SNMPv3 access on behalf of a logical entity.",
      "ja": "entLogicalContextEngineIDとentLogicalContextNameオブジェクトは論理エンティティに代わってSNMPv3のアクセスのためのSNMPコンテキストを提供するために追加されました。"
    },
    {
      "indent": 0,
      "text": "2.14.4. Bug Fixes",
      "section_title": true,
      "ja": "2.14.4. バグの修正"
    },
    {
      "indent": 3,
      "text": "A bug was fixed in the entLogicalCommunity object. The subrange was incorrect (1..255) and is now (0..255). The description clause has also been clarified. This object is now deprecated.",
      "ja": "バグがentLogicalCommunityオブジェクトで修正されました。サブレンジが間違っていました（1 255）と（0 255）になりました。記述句も明らかにされています。このオブジェクトは廃止されます。"
    },
    {
      "indent": 3,
      "text": "The entLastChangeTime object description has been changed to generalize the events that cause an update to the last change timestamp.",
      "ja": "entLastChangeTimeオブジェクトの記述は、最後の変更のタイムスタンプの更新を引き起こす事象を一般化するために変更されました。"
    },
    {
      "indent": 3,
      "text": "The syntax was changed from DisplayString to SnmpAdminString for the entPhysicalDescr, entPhysicalName, and entLogicalDescr objects.",
      "ja": "構文はするentPhysicalDescr、のentPhysicalName、およびentLogicalDescrオブジェクトに対してれるSnmpAdminStringへのDisplayStringから変更されました。"
    },
    {
      "indent": 0,
      "text": "2.15. Changes Since ",
      "section_title": true,
      "ja": "2.15. 変化するため"
    },
    {
      "indent": 0,
      "text": "2.15.1. Textual Conventions",
      "section_title": true,
      "ja": "2.15.1. テキストの表記法"
    },
    {
      "indent": 3,
      "text": "The PhysicalIndexOrZero TC has been added to allow objects to reference an entPhysicalIndex value or zero. The PhysicalClass TC has been extended to support a new enumeration for central processing units.",
      "ja": "PhysicalIndexOrZero TCは、オブジェクトがますentPhysicalIndex値またはゼロを参照できるようにするために追加されています。 PhysicalClass TCは、中央処理装置のための新たな列挙をサポートするように拡張されました。"
    },
    {
      "indent": 0,
      "text": "2.15.2. New Objects",
      "section_title": true,
      "ja": "2.15.2. 新しいオブジェクト"
    },
    {
      "indent": 3,
      "text": "The entPhysicalMfgDate object has been added to the entPhysicalTable to provide the date of manufacturing of the managed entity.",
      "ja": "entPhysicalMfgDateオブジェクトは、管理対象エンティティの製造日を提供するのentPhysicalTableに追加されました。"
    },
    {
      "indent": 3,
      "text": "The entPhysicalUris object has been added to the entPhysicalTable to provide additional identification information about the physical entity, such as a Common Language Equipment Identifier (CLEI) URN.",
      "ja": "entPhysicalUrisオブジェクトは、共通言語機器識別子（CLEI）URNとして、物理的なエンティティに関する追加の識別情報を提供するためのentPhysicalTableに追加されています。"
    },
    {
      "indent": 0,
      "text": "2.15.3. Bug Fixes",
      "section_title": true,
      "ja": "2.15.3. バグの修正"
    },
    {
      "indent": 3,
      "text": "The syntax was changed from INTEGER to Integer32 for the entPhysicalParentRelPos, entLogicalIndex, and entAliasLogicalIndexOrZero objects, and from INTEGER to PhysicalIndexOrZero for the entPhysicalContainedIn object.",
      "ja": "構文はentPhysicalParentRelPosは、entLogicalIndex、およびentAliasLogicalIndexOrZeroオブジェクトの構文Integer32にINTEGERから変更され、entPhysicalContainedInオブジェクトのPhysicalIndexOrZeroへのINTEGERかられました。"
    },
    {
      "indent": 0,
      "text": "3. Definitions",
      "section_title": true,
      "ja": "3.定義"
    },
    {
      "indent": 0,
      "text": "ENTITY-MIB DEFINITIONS ::= BEGIN",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "IMPORTS MODULE-IDENTITY, OBJECT-TYPE, mib-2, NOTIFICATION-TYPE, Integer32 FROM SNMPv2-SMI TDomain, TAddress, TEXTUAL-CONVENTION, AutonomousType, RowPointer, TimeStamp, TruthValue, DateAndTime FROM SNMPv2-TC MODULE-COMPLIANCE, OBJECT-GROUP, NOTIFICATION-GROUP FROM SNMPv2-CONF SnmpAdminString FROM SNMP-FRAMEWORK-MIB;",
      "ja": "輸入MODULE-IDENTITY、OBJECT-TYPE、MIB-2、NOTIFICATION-TYPE、Integer32のSNMPv2の-SMIのTDomain、TAddress、テキストの表記法、AutonomousTypeの、RowPointer、タイムスタンプのTruthValue、のDateAndTimeのSNMPv2-TCのMODULE-COMPLIANCE FROM、オブジェクト群からSNMP-FRAMEWORK-MIBからのSNMPv2-CONFのFROMれるSnmpAdminString、NOTIFICATION-GROUP;"
    },
    {
      "indent": 0,
      "text": "entityMIB MODULE-IDENTITY LAST-UPDATED \"200508100000Z\" ORGANIZATION \"IETF ENTMIB Working Group\" CONTACT-INFO \" WG E-mail: entmib@ietf.org Mailing list subscription info: http://www.ietf.org/mailman/listinfo/entmib",
      "ja": "entityMIB MODULE-IDENTITY LAST-UPDATED \"200508100000Z\" ORGANIZATION \"IETF ENTMIBワーキンググループ\" CONTACT-INFO「WG Eメール：entmib@ietf.orgメーリングリストの購読情報：http://www.ietf.org/mailman/listinfo/ entmib"
    },
    {
      "indent": 21,
      "text": "Andy Bierman\nietf@andybierman.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 21,
      "text": "Keith McCloghrie Cisco Systems Inc. 170 West Tasman Drive San Jose, CA 95134",
      "ja": "キースMcCloghrieシスコシステムズ株式会社170西タスマン・ドライブサンノゼ、CA 95134"
    },
    {
      "indent": 21,
      "text": "+1 408-526-5260 kzm@cisco.com\"",
      "ja": "＋１ ４０８ー５２６ー５２６０ ｋｚｍ＠しｓこ。こｍ”"
    },
    {
      "indent": 4,
      "text": "DESCRIPTION \"The MIB module for representing multiple logical entities supported by a single SNMP agent.",
      "ja": "DESCRIPTION「1つのSNMPエージェントがサポートする複数の論理エンティティを表すためのMIBモジュール。"
    },
    {
      "indent": 12,
      "text": "Copyright (C) The Internet Society (2005).  This\nversion of this MIB module is part of RFC 4133; see\nthe RFC itself for full legal notices.\"",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "REVISION \"200508100000Z\" DESCRIPTION \"Initial Version of Entity MIB (Version 3). This revision obsoletes RFC 2737. Additions: - cpu(12) enumeration added to PhysicalClass TC - DISPLAY-HINT clause to PhysicalIndex TC - PhysicalIndexOrZero TC - entPhysicalMfgDate object - entPhysicalUris object Changes: - entPhysicalContainedIn SYNTAX changed from INTEGER to PhysicalIndexOrZero",
      "ja": "。REVISION \"200508100000Z\" DESCRIPTION「エンティティMIB（バージョン3）の最初のバージョンは、この改訂は、RFC 2737の追加を時代遅れ： -  CPU（12）列挙PhysicalClass TCに追加 -  PhysicalIndexOrZero TC  -   -  PhysicalIndex TCにDISPLAY-HINT句entPhysicalMfgDateオブジェクト -  entPhysicalUrisオブジェクトの変更点： -  entPhysicalContainedIn SYNTAXがPhysicalIndexOrZeroにINTEGERから変更"
    },
    {
      "indent": 13,
      "text": "This version published as RFC 4133.\"",
      "ja": "このバージョンでは、「RFC 4133として公開します"
    },
    {
      "indent": 4,
      "text": "REVISION \"199912070000Z\" DESCRIPTION \"Initial Version of Entity MIB (Version 2). This revision obsoletes RFC 2037. This version published as RFC 2737.\"",
      "ja": "REVISION「199912070000Z」DESCRIPTION「エンティティMIBの初期バージョン（バージョン2）。この改正は、RFC 2737として発行され、このバージョンはRFC 2037を廃止」"
    },
    {
      "indent": 4,
      "text": "REVISION        \"199610310000Z\"\nDESCRIPTION\n        \"Initial version (version 1), published as\n         RFC 2037.\"\n::= { mib-2 47 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "entityMIBObjects OBJECT IDENTIFIER ::= { entityMIB 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- MIB contains four groups\nentityPhysical OBJECT IDENTIFIER ::= { entityMIBObjects 1 }\nentityLogical  OBJECT IDENTIFIER ::= { entityMIBObjects 2 }\nentityMapping  OBJECT IDENTIFIER ::= { entityMIBObjects 3 }\nentityGeneral  OBJECT IDENTIFIER ::= { entityMIBObjects 4 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- Textual Conventions\nPhysicalIndex ::= TEXTUAL-CONVENTION\n    DISPLAY-HINT      \"d\"\n    STATUS            current\n    DESCRIPTION\n            \"An arbitrary value that uniquely identifies the physical\n            entity.  The value should be a small, positive integer.\n            Index values for different physical entities are not\n            necessarily contiguous.\"\n    SYNTAX Integer32 (1..2147483647)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "PhysicalIndexOrZero ::= TEXTUAL-CONVENTION\n    DISPLAY-HINT      \"d\"\n    STATUS            current\n    DESCRIPTION\n            \"This textual convention is an extension of the\n            PhysicalIndex convention, which defines a greater than zero\n            value used to identify a physical entity.  This extension\n            permits the additional value of zero.  The semantics of the\n            value zero are object-specific and must, therefore, be\n            defined as part of the description of any object that uses\n            this syntax.  Examples of the usage of this extension are\n            situations where none or all physical entities need to be\n            referenced.\"\n    SYNTAX Integer32 (0..2147483647)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "PhysicalClass ::= TEXTUAL-CONVENTION\n    STATUS            current\n    DESCRIPTION\n            \"An enumerated value which provides an indication of the\n            general hardware type of a particular physical entity.\n            There are no restrictions as to the number of\n            entPhysicalEntries of each entPhysicalClass, which must be\n            instantiated by an agent.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 12,
      "text": "The enumeration 'other' is applicable if the physical entity\nclass is known, but does not match any of the supported\nvalues.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 12,
      "text": "The enumeration 'unknown' is applicable if the physical entity class is unknown to the agent.",
      "ja": "物理的なエンティティクラスがエージェントに不明な場合は「不明」列挙が適用されます。"
    },
    {
      "indent": 12,
      "text": "The enumeration 'chassis' is applicable if the physical entity class is an overall container for networking equipment. Any class of physical entity, except a stack, may be contained within a chassis; and a chassis may only be contained within a stack.",
      "ja": "物理エンティティ・クラスがネットワーク機器の全体的なコンテナである場合列挙「シャーシ」は適用されます。物理的なエンティティの任意のクラスは、スタックを除いて、シャーシ内に含まれてもよいです。そしてシャーシは、スタック内に含まれ得ます。"
    },
    {
      "indent": 12,
      "text": "The enumeration 'backplane' is applicable if the physical entity class is some sort of device for aggregating and forwarding networking traffic, such as a shared backplane in a modular ethernet switch. Note that an agent may model a backplane as a single physical entity, which is actually implemented as multiple discrete physical components (within a chassis or stack).",
      "ja": "物理的なエンティティクラスは、モジュラーイーサネット・スイッチ内の共用バックプレーンのようなネットワーク・トラフィックを集約し、転送するための装置のいくつかの並べ替えである場合列挙「バックプレーン」は適用可能です。エージェントが実際に（シャーシまたはスタック内の）複数の個別の物理的コンポーネントとして実装されている単一の物理エンティティとしてバックプレーンをモデル化することができることに留意されたいです。"
    },
    {
      "indent": 12,
      "text": "The enumeration 'container' is applicable if the physical entity class is capable of containing one or more removable physical entities, possibly of different types. For example, each (empty or full) slot in a chassis will be modeled as a container. Note that all removable physical entities should be modeled within a container entity, such as field-replaceable modules, fans, or power supplies. Note that all known containers should be modeled by the agent, including empty containers.",
      "ja": "物理的なエンティティクラスはおそらく、異なるタイプの1つまたは複数のリムーバブル物理エンティティを含むことができる場合列挙「コンテナ」は適用されます。例えば、シャーシ内の各（空またはフル）スロットがコンテナとしてモデル化されるであろう。すべてのリムーバブル物理エンティティは、現場交換可能モジュール、ファン、または電源として、コンテナ・エンティティ内でモデル化されるべきであることに留意されたいです。すべての既知の容器は空のコンテナを含め、エージェントによってモデル化する必要があることに注意してください。"
    },
    {
      "indent": 12,
      "text": "The enumeration 'powerSupply' is applicable if the physical entity class is a power-supplying component.",
      "ja": "物理的なエンティティクラスが電源供給コンポーネントである場合列挙「電源」が適用可能です。"
    },
    {
      "indent": 12,
      "text": "The enumeration 'fan' is applicable if the physical entity class is a fan or other heat-reduction component.",
      "ja": "物理的なエンティティクラスがファン又は他の熱還元成分である場合列挙「ファン」が適用可能です。"
    },
    {
      "indent": 12,
      "text": "The enumeration 'sensor' is applicable if the physical entity class is some sort of sensor, such as a temperature sensor within a router chassis.",
      "ja": "物理的なエンティティクラスは、ルータシャーシ内の温度センサとして、センサのいくつかの並べ替えである場合列挙「センサー」は適用されます。"
    },
    {
      "indent": 12,
      "text": "The enumeration 'module' is applicable if the physical entity class is some sort of self-contained sub-system. If the enumeration 'module' is removable, then it should be modeled within a container entity, otherwise it should be modeled directly within another physical entity (e.g., a chassis or another module).",
      "ja": "物理的なエンティティクラスが自己完結型のサブシステムのいくつかの並べ替えである場合列挙「モジュール」は適用されます。列挙「モジュール」は取り外し可能である場合、それはそうでなければ、別の物理的なエンティティ（例えば、シャーシまたは他のモジュール）内で直接モデル化されなければならない、容器エンティティ内でモデル化されるべきです。"
    },
    {
      "indent": 12,
      "text": "The enumeration 'port' is applicable if the physical entity class is some sort of networking port, capable of receiving and/or transmitting networking traffic.",
      "ja": "物理的なエンティティクラスが受信および/またはネットワーク・トラフィックを送信することができるネットワーク・ポートのいくつかの並べ替え、ある場合列挙「ポート」は適用されます。"
    },
    {
      "indent": 12,
      "text": "The enumeration 'stack' is applicable if the physical entity class is some sort of super-container (possibly virtual), intended to group together multiple chassis entities. A stack may be realized by a 'virtual' cable, a real interconnect cable, attached to multiple chassis, or may in fact be comprised of multiple interconnect cables. A stack should not be modeled within any other physical entities, but a stack may be contained within another stack. Only chassis entities should be contained within a stack.",
      "ja": "物理的なエンティティクラスが一緒にグループ化複数のシャーシエンティティに意図され、スーパーコンテナ（おそらく仮想）のいくつかの並べ替えである場合列挙「スタック」は適用されます。スタックは、複数のシャーシに取り付けられて、「仮想」ケーブル、実際の相互接続ケーブルによって実現されてもよいし、実際には、複数の相互接続ケーブルで構成されてもよいです。スタックは、他の物理エンティティ内でモデル化されるべきではなく、スタックは他のスタック内に含まれてもよいです。唯一のシャーシエンティティは、スタック内に含まれるべきです。"
    },
    {
      "indent": 4,
      "text": " The enumeration 'cpu' is applicable if the physical entity class is some sort of central processing unit.\" SYNTAX INTEGER { other(1), unknown(2), chassis(3), backplane(4), container(5), -- e.g., chassis slot or daughter-card holder powerSupply(6), fan(7), sensor(8), module(9), -- e.g., plug-in card or daughter-card port(10), stack(11), -- e.g., stack of multiple chassis entities cpu(12) }",
      "ja": " - 物理的なエンティティクラスが中央処理装置のいくつかの並べ替えが」SYNTAX INTEGER {他の（1）、不明（2）、シャーシ（3）、バックプレーン（4）、容器（5）、列挙 'CPU' が適用され - 例えば、シャーシスロットまたはドーターカードホルダ電源（6）、ファン（7）、センサ（8）は、モジュール（9）、 - 例えば、プラグインカードまたはドーターカードポート（10）、スタック（11 ）、 - 例えば、複数のシャーシエンティティのCPUのスタック（12）}"
    },
    {
      "indent": 0,
      "text": "SnmpEngineIdOrNone ::= TEXTUAL-CONVENTION\n    STATUS            current\n    DESCRIPTION\n            \"A specially formatted SnmpEngineID string for use with the\n            Entity MIB.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 12,
      "text": "If an instance of an object of SYNTAX SnmpEngineIdOrNone has\na non-zero length, then the object encoding and semantics\nare defined by the SnmpEngineID textual convention (see STD\n62, RFC 3411 [RFC3411]).",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": " If an instance of an object of SYNTAX SnmpEngineIdOrNone contains a zero-length string, then no appropriate SnmpEngineID is associated with the logical entity (i.e., SNMPv3 is not supported).\" SYNTAX OCTET STRING (SIZE(0..32)) -- empty string or SnmpEngineID",
      "ja": "。SYNTAX SnmpEngineIdOrNoneのオブジェクトのインスタンスは、長さゼロの文字列が含まれている場合、何も適切なのsnmpEngineIDは論理エンティティ（すなわち、SNMPv3のがサポートされていない）」構文オクテットSTRING（SIZE（0 32））に関連付けられていません - 空の文字列またはのsnmpEngineID"
    },
    {
      "indent": 0,
      "text": "--           The Physical Entity Table\nentPhysicalTable OBJECT-TYPE\n    SYNTAX      SEQUENCE OF EntPhysicalEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n            \"This table contains one row per physical entity.  There is\n            always at least one row for an 'overall' physical entity.\"\n    ::= { entityPhysical 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "entPhysicalEntry OBJECT-TYPE SYNTAX EntPhysicalEntry MAX-ACCESS not-accessible",
      "ja": "entPhysicalEntryのOBJECT-TYPE SYNTAX EntPhysicalEntryアクセス不可能なMAX-ACCESS"
    },
    {
      "indent": 4,
      "text": "STATUS      current\nDESCRIPTION\n        \"Information about a particular physical entity.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "        Each entry provides objects (entPhysicalDescr,\n        entPhysicalVendorType, and entPhysicalClass) to help an NMS\n        identify and characterize the entry, and objects\n        (entPhysicalContainedIn and entPhysicalParentRelPos) to help\n        an NMS relate the particular entry to other entries in this\n        table.\"\nINDEX   { entPhysicalIndex }\n::= { entPhysicalTable 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "EntPhysicalEntry ::= SEQUENCE {\n      entPhysicalIndex          PhysicalIndex,\n      entPhysicalDescr          SnmpAdminString,\n      entPhysicalVendorType     AutonomousType,\n      entPhysicalContainedIn    PhysicalIndexOrZero,\n      entPhysicalClass          PhysicalClass,\n      entPhysicalParentRelPos   Integer32,\n      entPhysicalName           SnmpAdminString,\n      entPhysicalHardwareRev    SnmpAdminString,\n      entPhysicalFirmwareRev    SnmpAdminString,\n      entPhysicalSoftwareRev    SnmpAdminString,\n      entPhysicalSerialNum      SnmpAdminString,\n      entPhysicalMfgName        SnmpAdminString,\n      entPhysicalModelName      SnmpAdminString,\n      entPhysicalAlias          SnmpAdminString,\n      entPhysicalAssetID        SnmpAdminString,\n      entPhysicalIsFRU          TruthValue,\n      entPhysicalMfgDate        DateAndTime,\n      entPhysicalUris           OCTET STRING",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "}",
      "ja": "｝"
    },
    {
      "indent": 0,
      "text": "entPhysicalIndex    OBJECT-TYPE\n    SYNTAX      PhysicalIndex\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n            \"The index for this entry.\"\n    ::= { entPhysicalEntry 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "entPhysicalDescr OBJECT-TYPE SYNTAX SnmpAdminString MAX-ACCESS read-only STATUS current DESCRIPTION",
      "ja": "するentPhysicalDescr OBJECT-TYPE SYNTAXれるSnmpAdminString MAX-ACCESS read-onlyステータス現在の説明"
    },
    {
      "indent": 4,
      "text": "        \"A textual description of physical entity.  This object\n        should contain a string that identifies the manufacturer's\n        name for the physical entity, and should be set to a\n        distinct value for each version or model of the physical\n        entity.\"\n::= { entPhysicalEntry 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "entPhysicalVendorType OBJECT-TYPE SYNTAX AutonomousType MAX-ACCESS read-only STATUS current DESCRIPTION \"An indication of the vendor-specific hardware type of the physical entity. Note that this is different from the definition of MIB-II's sysObjectID.",
      "ja": "entPhysicalVendorType OBJECT-TYPE構文AutonomousTypeのMAX-ACCESS read-only説明「物理的なエンティティのベンダー固有のハードウェアタイプの表示。これはMIB-IIののsysObjectIDの定義とは異なることに留意されたいです。"
    },
    {
      "indent": 12,
      "text": "An agent should set this object to an enterprise-specific\nregistration identifier value indicating the specific\nequipment type in detail.  The associated instance of\nentPhysicalClass is used to indicate the general type of\nhardware device.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "        If no vendor-specific registration identifier exists for\n        this physical entity, or the value is unknown by this agent,\n        then the value { 0 0 } is returned.\"\n::= { entPhysicalEntry 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "entPhysicalContainedIn OBJECT-TYPE SYNTAX PhysicalIndexOrZero MAX-ACCESS read-only STATUS current DESCRIPTION \"The value of entPhysicalIndex for the physical entity which 'contains' this physical entity. A value of zero indicates this physical entity is not contained in any other physical entity. Note that the set of 'containment' relationships define a strict hierarchy; that is, recursion is not allowed.",
      "ja": "entPhysicalContainedIn OBJECT-TYPE構文PhysicalIndexOrZero MAX-ACCESS read-only説明「この物理エンティティを 『含む』物理エンティティのためのentPhysicalIndexの値。ゼロの値は、この物理エンティティが任意の他の物理的実体に含まれていないことを示します。注意「包含」関係のセットが厳密な階層を定義すること、つまり、再帰は許されません。"
    },
    {
      "indent": 4,
      "text": "        In the event that a physical entity is contained by more\n        than one physical entity (e.g., double-wide modules), this\n        object should identify the containing entity with the lowest\n        value of entPhysicalIndex.\"\n::= { entPhysicalEntry 4 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "entPhysicalClass OBJECT-TYPE SYNTAX PhysicalClass MAX-ACCESS read-only",
      "ja": "entPhysicalClassがOBJECT-TYPE構文PhysicalClass MAX-ACCESS読み取り専用"
    },
    {
      "indent": 4,
      "text": "STATUS      current\nDESCRIPTION\n        \"An indication of the general hardware type of the physical\n        entity.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 12,
      "text": "An agent should set this object to the standard enumeration\nvalue that most accurately indicates the general class of\nthe physical entity, or the primary class if there is more\nthan one entity.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "        If no appropriate standard registration identifier exists\n        for this physical entity, then the value 'other(1)' is\n        returned.  If the value is unknown by this agent, then the\n        value 'unknown(2)' is returned.\"\n::= { entPhysicalEntry 5 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "entPhysicalParentRelPos OBJECT-TYPE SYNTAX Integer32 (-1..2147483647) MAX-ACCESS read-only STATUS current DESCRIPTION \"An indication of the relative position of this 'child' component among all its 'sibling' components. Sibling components are defined as entPhysicalEntries that share the same instance values of each of the entPhysicalContainedIn and entPhysicalClass objects.",
      "ja": "（注）entPhysicalParentRelPos OBJECT-TYPE構文Integer32（-1..2147483647）MAX-ACCESS read-only説明「すべての 『兄弟』の構成要素のうち、この 『子』コンポーネントの相対位置の表示は。兄弟コンポーネントがそのするentPhysicalEntriesとして定義されentPhysicalContainedInおよびentPhysicalClassが各オブジェクトの同じインスタンス値を共有します。"
    },
    {
      "indent": 12,
      "text": "An NMS can use this object to identify the relative ordering\nfor all sibling components of a particular parent\n(identified by the entPhysicalContainedIn instance in each\nsibling entry).",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 12,
      "text": "If possible, this value should match any external labeling of the physical component. For example, for a container (e.g., card slot) labeled as 'slot #3', entPhysicalParentRelPos should have the value '3'. Note that the entPhysicalEntry for the module plugged in slot 3 should have an entPhysicalParentRelPos value of '1'.",
      "ja": "可能な場合、この値は、物理的なコンポーネントの任意の外部ラベルと一致する必要があります。例えば、「スロット＃3」とラベルされた容器（例えば、カードスロット）のために、entPhysicalParentRelPosは、値を有するべきである「3」。スロット3に差し込まれたモジュールのentPhysicalEntryが「1」のentPhysicalParentRelPosが値を有するべきであることに留意されたいです。"
    },
    {
      "indent": 12,
      "text": "If the physical position of this component does not match any external numbering or clearly visible ordering, then user documentation or other external reference material should be used to determine the parent-relative position. If this is not possible, then the agent should assign a consistent (but possibly arbitrary) ordering to a given set of 'sibling' components, perhaps based on internal representation of the components.",
      "ja": "このコンポーネントの物理的位置は、任意の外部の番号又ははっきりと目に見える順序と一致しない場合、ユーザマニュアルや他の外部標準物質は親相対的な位置を決定するために使用されるべきです。これが不可能な場合、エージェントは、おそらくコンポーネントの内部表現に基づいて、「兄弟」の構成要素の所与のセットに注文一致（しかしおそらく任意）を割り当てなければなりません。"
    },
    {
      "indent": 12,
      "text": "If the agent cannot determine the parent-relative position for some reason, or if the associated value of entPhysicalContainedIn is '0', then the value '-1' is returned. Otherwise, a non-negative integer is returned, indicating the parent-relative position of this physical entity.",
      "ja": "エージェントが何らかの理由で親の相対位置を決定できない場合、またはentPhysicalContainedInの関連値が「0」である場合、その値を「-1」が返されます。そうでない場合には、負でない整数は、この物理エンティティの親相対的な位置を示す、戻されます。"
    },
    {
      "indent": 12,
      "text": "Parent-relative ordering normally starts from '1' and continues to 'N', where 'N' represents the highest positioned child entity. However, if the physical entities (e.g., slots) are labeled from a starting position of zero, then the first sibling should be associated with an entPhysicalParentRelPos value of '0'. Note that this ordering may be sparse or dense, depending on agent implementation.",
      "ja": "親相対的順序は、通常、「1」から始まり、「N」は最高位置決め子エンティティを表す「N」に続きます。物理的なエンティティ（例えば、スロット）がゼロの開始位置から、標識されている場合は、最初の兄弟は、「0」の（注）entPhysicalParentRelPos値に関連付けられるべきです。この順序は、エージェントの実装によって、スパースまたは密であってもよいことに注意してください。"
    },
    {
      "indent": 12,
      "text": "The actual values returned are not globally meaningful, as each 'parent' component may use different numbering algorithms. The ordering is only meaningful among siblings of the same parent component.",
      "ja": "各「親」コンポーネントが異なる番号付けアルゴリズムを使用することができるように返される実際の値は、グローバルに有意義ではありません。順序は同じ親コンポーネントの兄弟の中でのみ意味があります。"
    },
    {
      "indent": 4,
      "text": "        The agent should retain parent-relative position values\n        across reboots, either through algorithmic assignment or use\n        of non-volatile storage.\"\n::= { entPhysicalEntry 6 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "entPhysicalName OBJECT-TYPE SYNTAX SnmpAdminString MAX-ACCESS read-only STATUS current DESCRIPTION \"The textual name of the physical entity. The value of this object should be the name of the component as assigned by the local device and should be suitable for use in commands entered at the device's `console'. This might be a text name (e.g., `console') or a simple component number (e.g., port or module number, such as `1'), depending on the physical component naming syntax of the device.",
      "ja": "entPhysicalNameのOBJECT-TYPE SYNTAXれるSnmpAdminString MAX-ACCESS read-only説明「物理的なエンティティのテキスト名。このオブジェクトの値は、ローカルデバイスによって割り当てられたコンポーネントの名前であるべきであり、コマンドで使用するのに適していなければなりませんデバイスの `コンソールで入力された」。これは、テキストの名前かもしれません（例えば、`コンソール 『）または単純なコンポーネント番号（例えば、ポートまたはモジュール番号など、` 1』）の命名構文物理コンポーネントに応じて、端末。"
    },
    {
      "indent": 12,
      "text": "If there is no local name, or if this object is otherwise\nnot applicable, then this object contains a zero-length\nstring.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "        Note that the value of entPhysicalName for two physical\n        entities will be the same in the event that the console\n        interface does not distinguish between them, e.g., slot-1\n        and the card in slot-1.\"\n::= { entPhysicalEntry 7 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "entPhysicalHardwareRev OBJECT-TYPE SYNTAX SnmpAdminString MAX-ACCESS read-only STATUS current DESCRIPTION \"The vendor-specific hardware revision string for the physical entity. The preferred value is the hardware revision identifier actually printed on the component itself (if present).",
      "ja": "するentPhysicalHardwareRev OBJECT-TYPE構文れるSnmpAdminString MAX-ACCESS read-only説明「物理的なエンティティのベンダー固有のハードウェア・リビジョン・ストリングは、好ましい値は、実際にコンポーネント自体（存在する場合）上に印刷されたハードウェア・リビジョン識別子です。"
    },
    {
      "indent": 12,
      "text": "Note that if revision information is stored internally in a\nnon-printable (e.g., binary) format, then the agent must\nconvert such information to a printable format, in an\nimplementation-specific manner.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "        If no specific hardware revision string is associated with\n        the physical component, or if this information is unknown to\n        the agent, then this object will contain a zero-length\n        string.\"\n::= { entPhysicalEntry 8 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "entPhysicalFirmwareRev OBJECT-TYPE SYNTAX SnmpAdminString MAX-ACCESS read-only STATUS current DESCRIPTION \"The vendor-specific firmware revision string for the physical entity.",
      "ja": "entPhysicalFirmwareRevのOBJECT-TYPE SYNTAXれるSnmpAdminString MAX-ACCESS read-onlyステータス現在の説明「物理的なエンティティのベンダー固有のファームウェアのリビジョン文字列。"
    },
    {
      "indent": 12,
      "text": "Note that if revision information is stored internally in a\nnon-printable (e.g., binary) format, then the agent must\nconvert such information to a printable format, in an\nimplementation-specific manner.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "        If no specific firmware programs are associated with the\n        physical component, or if this information is unknown to the\n        agent, then this object will contain a zero-length string.\"\n::= { entPhysicalEntry 9 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "entPhysicalSoftwareRev OBJECT-TYPE SYNTAX SnmpAdminString MAX-ACCESS read-only STATUS current DESCRIPTION \"The vendor-specific software revision string for the physical entity.",
      "ja": "entPhysicalSoftwareRevのOBJECT-TYPE SYNTAXれるSnmpAdminString MAX-ACCESS read-onlyステータス現在の説明「物理的なエンティティのベンダー固有のソフトウェアのリビジョン文字列。"
    },
    {
      "indent": 12,
      "text": "Note that if revision information is stored internally in a non-printable (e.g., binary) format, then the agent must\nconvert such information to a printable format, in an\nimplementation-specific manner.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "        If no specific software programs are associated with the\n        physical component, or if this information is unknown to the\n        agent, then this object will contain a zero-length string.\"\n::= { entPhysicalEntry 10 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "entPhysicalSerialNum OBJECT-TYPE SYNTAX SnmpAdminString (SIZE (0..32)) MAX-ACCESS read-write STATUS current DESCRIPTION \"The vendor-specific serial number string for the physical entity. The preferred value is the serial number string actually printed on the component itself (if present).",
      "ja": "entPhysicalSerialNum OBJECT-TYPE SYNTAXれるSnmpAdminString（SIZE（0 32））MAX-ACCESS読み取りと書き込みステータス現在の説明「物理的なエンティティのベンダー固有のシリアル番号文字列。好ましい値は、実際のコンポーネントに印刷されたシリアル番号文字列であります自体（存在する場合）。"
    },
    {
      "indent": 12,
      "text": "On the first instantiation of an physical entity, the value\nof entPhysicalSerialNum associated with that entity is set\nto the correct vendor-assigned serial number, if this\ninformation is available to the agent.  If a serial number\nis unknown or non-existent, the entPhysicalSerialNum will be\nset to a zero-length string instead.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 12,
      "text": "Note that implementations that can correctly identify the serial numbers of all installed physical entities do not need to provide write access to the entPhysicalSerialNum object. Agents which cannot provide non-volatile storage for the entPhysicalSerialNum strings are not required to implement write access for this object.",
      "ja": "正しくインストールされているすべての物理的なエンティティのシリアル番号を識別できる実装がのentPhysicalSerialNumオブジェクトに書き込みアクセスを提供する必要はないことに注意してください。 entPhysicalSerialNum文字列のための不揮発性ストレージを提供できないエージェントは、このオブジェクトに対する書き込みアクセスを実現するために必要とされていません。"
    },
    {
      "indent": 12,
      "text": "Not every physical component will have a serial number, or even need one. Physical entities for which the associated value of the entPhysicalIsFRU object is equal to 'false(2)' (e.g., the repeater ports within a repeater module), do not need their own unique serial number. An agent does not have to provide write access for such entities, and may return a zero-length string.",
      "ja": "すべての物理的なコンポーネントは、シリアル番号を持っている、あるいは更に必要性1がありません。 entPhysicalIsFRUオブジェクトの値が「偽（2）」（例えば、リピータモジュール内のリピータポート）、独自のシリアル番号を必要としないに等しくされている物理的なエンティティ。エージェントは、このようなエンティティに書き込みアクセスを提供する必要はありません。また、長さゼロの文字列を返すことがあります。"
    },
    {
      "indent": 4,
      "text": "        If write access is implemented for an instance of\n        entPhysicalSerialNum, and a value is written into the\n        instance, the agent must retain the supplied value in the\n        entPhysicalSerialNum instance (associated with the same\n        physical entity) for as long as that entity remains\n        instantiated.  This includes instantiations across all\n        re-initializations/reboots of the network management system,\n        including those resulting in a change of the physical entity's entPhysicalIndex value.\"\n::= { entPhysicalEntry 11 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "entPhysicalMfgName OBJECT-TYPE SYNTAX SnmpAdminString MAX-ACCESS read-only STATUS current DESCRIPTION \"The name of the manufacturer of this physical component. The preferred value is the manufacturer name string actually printed on the component itself (if present).",
      "ja": "entPhysicalMfgName OBJECT-TYPE構文れるSnmpAdminString MAX-ACCESS read-only説明「この物理コンポーネントの製造者の名前。好ましい値は、実際にコンポーネント自体（存在する場合）上に印刷され、製造業者名文字列です。"
    },
    {
      "indent": 12,
      "text": "Note that comparisons between instances of the\nentPhysicalModelName, entPhysicalFirmwareRev,\nentPhysicalSoftwareRev, and the entPhysicalSerialNum\nobjects, are only meaningful amongst entPhysicalEntries with\nthe same value of entPhysicalMfgName.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "        If the manufacturer name string associated with the physical\n        component is unknown to the agent, then this object will\n        contain a zero-length string.\"\n::= { entPhysicalEntry 12 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "entPhysicalModelName OBJECT-TYPE SYNTAX SnmpAdminString MAX-ACCESS read-only STATUS current DESCRIPTION \"The vendor-specific model name identifier string associated with this physical component. The preferred value is the customer-visible part number, which may be printed on the component itself.",
      "ja": "entPhysicalModelName OBJECT-TYPE構文れるSnmpAdminString MAX-ACCESS read-only説明「この物理コンポーネントに関連付けられたベンダー固有のモデル名識別子ストリング。好ましい値は、コンポーネント自体の上に印刷することができる顧客可視部分の数、です。"
    },
    {
      "indent": 4,
      "text": "        If the model name string associated with the physical\n        component is unknown to the agent, then this object will\n        contain a zero-length string.\"\n::= { entPhysicalEntry 13 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "entPhysicalAlias OBJECT-TYPE SYNTAX SnmpAdminString (SIZE (0..32)) MAX-ACCESS read-write STATUS current DESCRIPTION \"This object is an 'alias' name for the physical entity, as specified by a network manager, and provides a non-volatile 'handle' for the physical entity.",
      "ja": "entPhysicalAliasのOBJECT-TYPE SYNTAXれるSnmpAdminString（SIZE（0 32））MAX-ACCESS読み取りと書き込みステータス現在の説明は「このオブジェクトは、ネットワーク管理者によって指定されるように、物理的なエンティティの 『エイリアス』の名前であり、そして非を提供物理的なエンティティのための不揮発性「ハンドル」を提供します。"
    },
    {
      "indent": 12,
      "text": "On the first instantiation of a physical entity, the value of entPhysicalAlias associated with that entity is set to\nthe zero-length string.  However, the agent may set the\nvalue to a locally unique default value, instead of a\nzero-length string.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "        If write access is implemented for an instance of\n        entPhysicalAlias, and a value is written into the instance,\n        the agent must retain the supplied value in the\n        entPhysicalAlias instance (associated with the same physical\n        entity) for as long as that entity remains instantiated.\n        This includes instantiations across all\n        re-initializations/reboots of the network management system,\n        including those resulting in a change of the physical\n        entity's entPhysicalIndex value.\"\n::= { entPhysicalEntry 14 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "entPhysicalAssetID OBJECT-TYPE SYNTAX SnmpAdminString (SIZE (0..32)) MAX-ACCESS read-write STATUS current DESCRIPTION \"This object is a user-assigned asset tracking identifier (as specified by a network manager) for the physical entity, and provides non-volatile storage of this information.",
      "ja": "entPhysicalAssetID OBJECT-TYPE構文れるSnmpAdminString（SIZE（0 32））MAX-ACCESS読み取りと書き込みステータス現在の説明は「このオブジェクトは、物理的なエンティティのユーザに割り当てられた資産追跡識別子（ネットワーク管理者によって指定される）であり、そして提供この情報の不揮発性記憶装置。"
    },
    {
      "indent": 12,
      "text": "On the first instantiation of a physical entity, the value\nof entPhysicalAssetID associated with that entity is set to\nthe zero-length string.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 12,
      "text": "Not every physical component will have an asset tracking identifier, or even need one. Physical entities for which the associated value of the entPhysicalIsFRU object is equal to 'false(2)' (e.g., the repeater ports within a repeater module), do not need their own unique asset tracking identifier. An agent does not have to provide write access for such entities, and may instead return a zero-length string.",
      "ja": "すべての物理的なコンポーネントは、資産追跡識別子を持っている、あるいは更に必要性1がありません。 entPhysicalIsFRUオブジェクトの値が「偽（2）」（例えば、リピータモジュール内のリピータポート）、独自の資産追跡識別子を必要としないに等しくされている物理的なエンティティ。エージェントは、このようなエンティティに書き込みアクセスを提供する必要はありません、代わりに長さゼロの文字列を返すことがあります。"
    },
    {
      "indent": 12,
      "text": "If write access is implemented for an instance of entPhysicalAssetID, and a value is written into the instance, the agent must retain the supplied value in the entPhysicalAssetID instance (associated with the same physical entity) for as long as that entity remains instantiated. This includes instantiations across all re-initializations/reboots of the network management system, including those resulting in a change of the physical entity's entPhysicalIndex value.",
      "ja": "書き込みアクセスがentPhysicalAssetIDのインスタンスのために実装され、その値がインスタンスに書き込まれている場合、エージェントがあれば、そのエンティティがインスタンス化されたままであるため（同じ物理エンティティに関連付けられた）entPhysicalAssetIDインスタンスに供給された値を保持しなければなりません。これは物理的なエンティティのentPhysicalIndex値の変化をもたらすものを含む、ネットワーク管理システムのすべての再初期化/再起動、両端のインスタンスを含みます。"
    },
    {
      "indent": 4,
      "text": "        If no asset tracking information is associated with the\n        physical component, then this object will contain a\n        zero-length string.\"\n::= { entPhysicalEntry 15 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "entPhysicalIsFRU OBJECT-TYPE\n    SYNTAX      TruthValue\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"This object indicates whether or not this physical entity\n            is considered a 'field replaceable unit' by the vendor.  If\n            this object contains the value 'true(1)' then this\n            entPhysicalEntry identifies a field replaceable unit.  For\n            all entPhysicalEntries that represent components\n            permanently contained within a field replaceable unit, the\n            value 'false(2)' should be returned for this object.\"\n    ::= { entPhysicalEntry 16 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "entPhysicalMfgDate  OBJECT-TYPE\n    SYNTAX      DateAndTime\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"This object contains the date of manufacturing of the\n            managed entity.  If the manufacturing date is unknown or not\n            supported, the object is not instantiated.  The special\n            value '0000000000000000'H may also be returned in this\n            case.\"\n    ::= { entPhysicalEntry 17 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "entPhysicalUris OBJECT-TYPE SYNTAX OCTET STRING MAX-ACCESS read-write STATUS current DESCRIPTION \"This object contains additional identification information about the physical entity. The object contains URIs and, therefore, the syntax of this object must conform to RFC 3986, section 2.",
      "ja": "entPhysicalUris OBJECT-TYPE構文オクテット文字列MAX-ACCESS読み取りと書き込みステータス現在の説明は「このオブジェクトは物理的なエンティティに関する追加の識別情報が含まれている。オブジェクトはURIを含んでおり、従って、このオブジェクトの構文は、RFC 3986、セクション2に準拠しなければなりません。"
    },
    {
      "indent": 12,
      "text": "Multiple URIs may be present and are separated by white\nspace characters.  Leading and trailing white space\ncharacters are ignored.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": " If no additional identification information is known about the physical entity or supported, the object is not instantiated. A zero length octet string may also be returned in this case.\" REFERENCE \"RFC 3986, Uniform Resource Identifiers (URI): Generic Syntax, section 2, August 1998.\"",
      "ja": "追加の識別情報が物理的なエンティティについて知られていない、またはサポートされている場合、オブジェクトがインスタンス化されていません。長さゼロオクテットストリングはまた、この場合に戻すことができる「基準 『RFC 3986、ユニフォームリソース識別子（URI）：汎用構文、セクション2、1998年8月』"
    },
    {
      "indent": 4,
      "text": "::= { entPhysicalEntry 18 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "--           The Logical Entity Table\nentLogicalTable OBJECT-TYPE\n    SYNTAX      SEQUENCE OF EntLogicalEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n            \"This table contains one row per logical entity.  For agents\n            that implement more than one naming scope, at least one\n            entry must exist.  Agents which instantiate all MIB objects\n            within a single naming scope are not required to implement\n            this table.\"\n    ::= { entityLogical 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "entLogicalEntry       OBJECT-TYPE\n    SYNTAX      EntLogicalEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n            \"Information about a particular logical entity.  Entities\n            may be managed by this agent or other SNMP agents (possibly)\n            in the same chassis.\"\n    INDEX       { entLogicalIndex }\n    ::= { entLogicalTable 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "EntLogicalEntry ::= SEQUENCE {\n      entLogicalIndex            Integer32,\n      entLogicalDescr            SnmpAdminString,\n      entLogicalType             AutonomousType,\n      entLogicalCommunity        OCTET STRING,\n      entLogicalTAddress         TAddress,\n      entLogicalTDomain          TDomain,\n      entLogicalContextEngineID  SnmpEngineIdOrNone,\n      entLogicalContextName      SnmpAdminString\n}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "entLogicalIndex OBJECT-TYPE SYNTAX Integer32 (1..2147483647) MAX-ACCESS not-accessible STATUS current DESCRIPTION",
      "ja": "entLogicalIndexのOBJECT-TYPE構文Integer32（1 2147483647）MAX-ACCESSステータス現在の説明"
    },
    {
      "indent": 4,
      "text": "        \"The value of this object uniquely identifies the logical\n        entity.  The value should be a small positive integer; index\n        values for different logical entities are not necessarily\n        contiguous.\"\n::= { entLogicalEntry 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "entLogicalDescr OBJECT-TYPE\n    SYNTAX      SnmpAdminString\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"A textual description of the logical entity.  This object\n            should contain a string that identifies the manufacturer's\n            name for the logical entity, and should be set to a distinct\n            value for each version of the logical entity.\"\n    ::= { entLogicalEntry 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "entLogicalType OBJECT-TYPE\n    SYNTAX      AutonomousType\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"An indication of the type of logical entity.  This will\n            typically be the OBJECT IDENTIFIER name of the node in the\n            SMI's naming hierarchy which represents the major MIB\n            module, or the majority of the MIB modules, supported by the\n            logical entity.  For example:\n               a logical entity of a regular host/router -> mib-2\n               a logical entity of a 802.1d bridge -> dot1dBridge\n               a logical entity of a 802.3 repeater -> snmpDot3RptrMgmt\n            If an appropriate node in the SMI's naming hierarchy cannot\n            be identified, the value 'mib-2' should be used.\"\n    ::= { entLogicalEntry 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "entLogicalCommunity OBJECT-TYPE SYNTAX OCTET STRING (SIZE (0..255)) MAX-ACCESS read-only STATUS deprecated DESCRIPTION \"An SNMPv1 or SNMPv2C community-string, which can be used to access detailed management information for this logical entity. The agent should allow read access with this community string (to an appropriate subset of all managed objects) and may also return a community string based on the privileges of the request used to read this object. Note that an agent may return a community string with read-only privileges, even if this object is accessed with a read-write community string. However, the agent must take care not to return a community string that allows more privileges than the community string used to access this object.",
      "ja": "DESCRIPTION「この論理エンティティの詳細な管理情報にアクセスするために使用することができSNMPv1またはSNMPv2Cのコミュニティストリング、非推奨entLogicalCommunityのOBJECT-TYPE構文オクテットSTRING（SIZE（0 255））MAX-ACCESS read-onlyステータス。エージェント（すべての管理対象オブジェクトの適切なサブセットに）このコミュニティストリングで読み取りアクセスを許可する必要があり、また、このオブジェクトを読み取るために使用される要求の権限に基づいて、コミュニティストリングを返すことがあります。エージェントは読み取りとコミュニティ文字列を返すことに注意してください唯一の権限は、このオブジェクトが読み書きコミュニティストリングでアクセスされた場合でも。しかし、エージェントはこのオブジェクトにアクセスするために使用されるコミュニティ文字列よりも多くの権限を許可するコミュニティストリングを返すしないように注意する必要があります。"
    },
    {
      "indent": 12,
      "text": "A compliant SNMP agent may wish to conserve naming scopes by\nrepresenting multiple logical entities in a single 'default'\nnaming scope.  This is possible when the logical entities,\nrepresented by the same value of entLogicalCommunity, have\nno object instances in common.  For example, 'bridge1' and\n'repeater1' may be part of the main naming scope, but at\nleast one additional community string is needed to represent\n'bridge2' and 'repeater2'.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 12,
      "text": "Logical entities 'bridge1' and 'repeater1' would be represented by sysOREntries associated with the 'default' naming scope.",
      "ja": "論理エンティティのbridge1 'と「repeater1は」範囲に名前を付ける「デフォルト」に関連したsysOREntriesで表されます。"
    },
    {
      "indent": 12,
      "text": "For agents not accessible via SNMPv1 or SNMPv2C, the value of this object is the empty string. This object may also contain an empty string if a community string has not yet been assigned by the agent, or if no community string with suitable access rights can be returned for a particular SNMP request.",
      "ja": "SNMPv1またはSNMPv2Cに経由でアクセス可能ではないエージェントの場合、このオブジェクトの値は空の文字列です。コミュニティストリングは、まだエージェントによって割り当てられていない場合、このオブジェクトは、空の文字列を含むことができ、または適切なアクセス権とはコミュニティ文字列は、特定のSNMP要求に対して返されないことができるかどうか。"
    },
    {
      "indent": 4,
      "text": "        Note that this object is deprecated.  Agents which implement\n        SNMPv3 access should use the entLogicalContextEngineID and\n        entLogicalContextName objects to identify the context\n        associated with each logical entity.  SNMPv3 agents may\n        return a zero-length string for this object, or may continue\n        to return a community string (e.g., tri-lingual agent\n        support).\"\n::= { entLogicalEntry 4 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "entLogicalTAddress OBJECT-TYPE SYNTAX TAddress MAX-ACCESS read-only STATUS current DESCRIPTION \"The transport service address by which the logical entity receives network management traffic, formatted according to the corresponding value of entLogicalTDomain.",
      "ja": "entLogicalTDomainの対応する値に従ってフォーマットentLogicalTAddress OBJECT-TYPE構文TAddress MAX-ACCESS read-only説明「論理エンティティは、ネットワーク管理トラフィックを受信することにより、輸送サービスアドレス。"
    },
    {
      "indent": 12,
      "text": "For snmpUDPDomain, a TAddress is 6 octets long: the initial\n4 octets contain the IP-address in network-byte order and\nthe last 2 contain the UDP port in network-byte order.\nConsult 'Transport Mappings for the Simple Network\nManagement Protocol' (STD 62, RFC 3417 [RFC3417]) for\nfurther information on snmpUDPDomain.\"",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "::= { entLogicalEntry 5 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "entLogicalTDomain OBJECT-TYPE\n    SYNTAX      TDomain\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"Indicates the kind of transport service by which the\n            logical entity receives network management traffic.\n            Possible values for this object are presently found in the\n            Transport Mappings for Simple Network Management Protocol'\n            (STD 62, RFC 3417 [RFC3417]).\"\n    ::= { entLogicalEntry 6 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "entLogicalContextEngineID OBJECT-TYPE SYNTAX SnmpEngineIdOrNone MAX-ACCESS read-only STATUS current DESCRIPTION \"The authoritative contextEngineID that can be used to send an SNMP message concerning information held by this logical entity, to the address specified by the associated 'entLogicalTAddress/entLogicalTDomain' pair.",
      "ja": "entLogicalContextEngineID OBJECT-TYPE構文SnmpEngineIdOrNone MAX-ACCESS read-only説明「関連 『entLogicalTAddress / entLogicalTDomain』対によって指定されたアドレスに、この論理エンティティによって保持された情報に関するSNMPメッセージを送信するために使用することができる権威contextEngineID。"
    },
    {
      "indent": 12,
      "text": "This object, together with the associated\nentLogicalContextName object, defines the context associated\nwith a particular logical entity, and allows access to SNMP\nengines identified by a contextEngineId and contextName\npair.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "        If no value has been configured by the agent, a zero-length\n        string is returned, or the agent may choose not to\n        instantiate this object at all.\"\n::= { entLogicalEntry 7 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "entLogicalContextName OBJECT-TYPE SYNTAX SnmpAdminString MAX-ACCESS read-only STATUS current DESCRIPTION \"The contextName that can be used to send an SNMP message concerning information held by this logical entity, to the address specified by the associated 'entLogicalTAddress/entLogicalTDomain' pair.",
      "ja": "entLogicalContextName OBJECT-TYPE構文れるSnmpAdminString MAX-ACCESS read-only説明「関連 『entLogicalTAddress / entLogicalTDomain』対によって指定されたアドレスに、この論理エンティティによって保持された情報に関するSNMPメッセージを送信するために使用することができるのcontextName。"
    },
    {
      "indent": 12,
      "text": "This object, together with the associated\nentLogicalContextEngineID object, defines the context\nassociated with a particular logical entity, and allows access to SNMP engines identified by a contextEngineId and\ncontextName pair.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "        If no value has been configured by the agent, a zero-length\n        string is returned, or the agent may choose not to\n        instantiate this object at all.\"\n::= { entLogicalEntry 8 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "entLPMappingTable OBJECT-TYPE SYNTAX SEQUENCE OF EntLPMappingEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"This table contains zero or more rows of logical entity to physical equipment associations. For each logical entity known by this agent, there are zero or more mappings to the physical resources, which are used to realize that logical entity.",
      "ja": "EntLPMappingEntry MAX-ACCESSステータス現在の説明のentLPMappingTable OBJECT-TYPE構文配列は「この表物理的機器協会への論理エンティティのゼロ以上の行が含まれています。このエージェントによって知られている各論理エンティティについて、ゼロ以上のマッピングが存在しますその論理エンティティを実現するために使用される物理リソース、。"
    },
    {
      "indent": 12,
      "text": "An agent should limit the number and nature of entries in\nthis table such that only meaningful and non-redundant\ninformation is returned.  For example, in a system that\ncontains a single power supply, mappings between logical\nentities and the power supply are not useful and should not\nbe included.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 12,
      "text": "Also, only the most appropriate physical component, which is closest to the root of a particular containment tree, should be identified in an entLPMapping entry.",
      "ja": "また、特定の包含ツリーのルートに最も近い唯一の最も適切な物理的成分は、entLPMappingエントリにおいて識別されるべきです。"
    },
    {
      "indent": 12,
      "text": "For example, suppose a bridge is realized on a particular module, and all ports on that module are ports on this bridge. A mapping between the bridge and the module would be useful, but additional mappings between the bridge and each of the ports on that module would be redundant (because the entPhysicalContainedIn hierarchy can provide the same information). On the other hand, if more than one bridge were utilizing ports on this module, then mappings between each bridge and the ports it used would be appropriate.",
      "ja": "例えば、ブリッジは、特定のモジュールで実現されていると、そのモジュールのすべてのポートは、このブリッジのポートです。ブリッジとモジュールとの間のマッピングが有用であろうが、（entPhysicalContainedIn階層は同じ情報を提供することができるので）、ブリッジとそのモジュール上のポートのそれぞれの間に追加のマッピングは冗長になります。複数のブリッジがこのモジュール上のポートを利用した一方、各ブリッジ及びそれが使用されるポートとの間のマッピングは適切であろう。"
    },
    {
      "indent": 4,
      "text": "        Also, in the case of a single backplane repeater, a mapping\n        for the backplane to the single repeater entity is not\n        necessary.\"\n::= { entityMapping 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "entLPMappingEntry OBJECT-TYPE SYNTAX EntLPMappingEntry MAX-ACCESS not-accessible",
      "ja": "entLPMappingEntryのOBJECT-TYPE SYNTAX EntLPMappingEntryアクセス不可能なMAX-ACCESS"
    },
    {
      "indent": 4,
      "text": "STATUS      current\nDESCRIPTION\n        \"Information about a particular logical entity to physical\n        equipment association.  Note that the nature of the\n        association is not specifically identified in this entry.\n        It is expected that sufficient information exists in the\n        MIBs used to manage a particular logical entity to infer how\n        physical component information is utilized.\"\nINDEX       { entLogicalIndex, entLPPhysicalIndex }\n::= { entLPMappingTable 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "EntLPMappingEntry ::= SEQUENCE {\n      entLPPhysicalIndex         PhysicalIndex\n}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "entLPPhysicalIndex OBJECT-TYPE\n    SYNTAX      PhysicalIndex\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"The value of this object identifies the index value of a\n            particular entPhysicalEntry associated with the indicated\n            entLogicalEntity.\"\n    ::= { entLPMappingEntry 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- logical entity/component to alias table\nentAliasMappingTable OBJECT-TYPE\n    SYNTAX      SEQUENCE OF EntAliasMappingEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n            \"This table contains zero or more rows, representing\n            mappings of logical entity and physical component to\n            external MIB identifiers.  Each physical port in the system\n            may be associated with a mapping to an external identifier,\n            which itself is associated with a particular logical\n            entity's naming scope.  A 'wildcard' mechanism is provided\n            to indicate that an identifier is associated with more than\n            one logical entity.\"\n    ::= { entityMapping 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "entAliasMappingEntry OBJECT-TYPE SYNTAX EntAliasMappingEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"Information about a particular physical equipment, logical entity to external identifier binding. Each logical entity/physical component pair may be associated with one alias mapping. The logical entity index may also be used as a 'wildcard' (refer to the entAliasLogicalIndexOrZero object DESCRIPTION clause for details.)",
      "ja": "結合外部識別子にentAliasMappingEntry特定の物理的機器、論理エンティティ約OBJECT-TYPE構文EntAliasMappingEntry MAX-ACCESSステータス現在の説明は「情報。各論理エンティティ/物理コンポーネント対は1つのエイリアスマッピングに関連付けることができる。論理エンティティインデックスよいですまた、「ワイルドカード」として使用すること（詳細はentAliasLogicalIndexOrZeroオブジェクト記述節を参照。）"
    },
    {
      "indent": 4,
      "text": "        Note that only entPhysicalIndex values that represent\n        physical ports (i.e., associated entPhysicalClass value is\n        'port(10)') are permitted to exist in this table.\"\nINDEX { entPhysicalIndex, entAliasLogicalIndexOrZero }\n::= { entAliasMappingTable 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "EntAliasMappingEntry ::= SEQUENCE {\n      entAliasLogicalIndexOrZero        Integer32,\n      entAliasMappingIdentifier         RowPointer\n}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "entAliasLogicalIndexOrZero OBJECT-TYPE SYNTAX Integer32 (0..2147483647) MAX-ACCESS not-accessible STATUS current DESCRIPTION \"The value of this object identifies the logical entity that defines the naming scope for the associated instance of the 'entAliasMappingIdentifier' object.",
      "ja": "entAliasLogicalIndexOrZero OBJECT-TYPE構文Integer32（0 2147483647）MAX-ACCESSステータス現在の説明は「このオブジェクトの値は 『entAliasMappingIdentifier』オブジェクトの関連インスタンスの命名範囲を定義する論理エンティティを識別する。"
    },
    {
      "indent": 12,
      "text": "If this object has a non-zero value, then it identifies the\nlogical entity named by the same value of entLogicalIndex.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 12,
      "text": "If this object has a value of zero, then the mapping between the physical component and the alias identifier for this entAliasMapping entry is associated with all unspecified logical entities. That is, a value of zero (the default mapping) identifies any logical entity that does not have an explicit entry in this table for a particular entPhysicalIndex/entAliasMappingIdentifier pair.",
      "ja": "このオブジェクトはゼロの値を有する場合、このentAliasMappingエントリの物理的コンポーネントとエイリアス識別子間のマッピングは、すべての不特定の論理エンティティに関連付けられています。すなわち、ゼロ（デフォルトマッピング）の値であり、特定のentPhysicalIndex / entAliasMappingIdentifierペアのこの表の明示的なエントリを持たない任意の論理エンティティを識別する。"
    },
    {
      "indent": 12,
      "text": "For example, to indicate that a particular interface (e.g., physical component 33) is identified by the same value of ifIndex for all logical entities, the following instance might exist:",
      "ja": "例えば、特定のインターフェース（例えば、物理的構成要素33）すべての論理エンティティのためのifIndexの同じ値によって識別されるが、次のインスタンスが存在する可能性があることを示します。"
    },
    {
      "indent": 20,
      "text": "entAliasMappingIdentifier.33.0 = ifIndex.5",
      "ja": "entAliasMappingIdentifier.33.0 = ifIndex.5"
    },
    {
      "indent": 12,
      "text": "In the event an entPhysicalEntry is associated differently for some logical entities, additional entAliasMapping entries may exist, e.g.:",
      "ja": "entPhysicalEntryいくつかの論理エンティティに対して異なる関連付けられている場合には、追加のentAliasMappingエントリは、例えば存在することができます："
    },
    {
      "indent": 20,
      "text": "entAliasMappingIdentifier.33.0 = ifIndex.6\nentAliasMappingIdentifier.33.4 =  ifIndex.1\nentAliasMappingIdentifier.33.5 =  ifIndex.1\nentAliasMappingIdentifier.33.10 = ifIndex.12",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "        Note that entries with non-zero entAliasLogicalIndexOrZero\n        index values have precedence over zero-indexed entries.  In\n        this example, all logical entities except 4, 5, and 10,\n        associate physical entity 33 with ifIndex.6.\"\n::= { entAliasMappingEntry 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "entAliasMappingIdentifier OBJECT-TYPE SYNTAX RowPointer MAX-ACCESS read-only STATUS current DESCRIPTION \"The value of this object identifies a particular conceptual row associated with the indicated entPhysicalIndex and entLogicalIndex pair.",
      "ja": "entAliasMappingIdentifier OBJECT-TYPE SYNTAX RowPointer MAX-ACCESS read-only説明は「このオブジェクトの値が示されますentPhysicalIndexとentLogicalIndex対に関連する特定の概念的な列を識別する。"
    },
    {
      "indent": 12,
      "text": "Because only physical ports are modeled in this table, only\nentries that represent interfaces or ports are allowed.  If\nan ifEntry exists on behalf of a particular physical port,\nthen this object should identify the associated 'ifEntry'.\nFor repeater ports, the appropriate row in the\n'rptrPortGroupTable' should be identified instead.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 12,
      "text": "For example, suppose a physical port was represented by entPhysicalEntry.3, entLogicalEntry.15 existed for a repeater, and entLogicalEntry.22 existed for a bridge. Then there might be two related instances of entAliasMappingIdentifier: entAliasMappingIdentifier.3.15 == rptrPortGroupIndex.5.2 entAliasMappingIdentifier.3.22 == ifIndex.17 It is possible that other mappings (besides interfaces and repeater ports) may be defined in the future, as required.",
      "ja": "例えば、物理ポートがentPhysicalEntry.3で表現されたと仮定し、entLogicalEntry.15はリピータのために存在していた、とentLogicalEntry.22は、ブリッジのために存在していました。次いでentAliasMappingIdentifierの二つの関連インスタンスがあるかもしれません：entAliasMappingIdentifier.3.15 == rptrPortGroupIndex.5.2 entAliasMappingIdentifier.3.22 == ifIndex.17必要に応じて（インターフェースとリピータポートに加えて）他のマッピングは、将来に定義される可能性があります。"
    },
    {
      "indent": 4,
      "text": "        Bridge ports are identified by examining the Bridge MIB and\n        appropriate ifEntries associated with each 'dot1dBasePort',\n        and are thus not represented in this table.\"\n::= { entAliasMappingEntry 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- physical mapping table entPhysicalContainsTable OBJECT-TYPE SYNTAX SEQUENCE OF EntPhysicalContainsEntry MAX-ACCESS not-accessible STATUS current",
      "ja": " -  EntPhysicalContainsEntry MAX-ACCESSステータスの現在の物理的マッピングテーブルentPhysicalContainsTableはOBJECT-TYPE構文配列"
    },
    {
      "indent": 4,
      "text": "DESCRIPTION\n        \"A table that exposes the container/'containee'\n        relationships between physical entities.  This table\n        provides all the information found by constructing the\n        virtual containment tree for a given entPhysicalTable, but\n        in a more direct format.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "        In the event a physical entity is contained by more than one\n        other physical entity (e.g., double-wide modules), this\n        table should include these additional mappings, which cannot\n        be represented in the entPhysicalTable virtual containment\n        tree.\"\n::= { entityMapping 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "entPhysicalContainsEntry OBJECT-TYPE\n    SYNTAX      EntPhysicalContainsEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n            \"A single container/'containee' relationship.\"\n    INDEX       { entPhysicalIndex, entPhysicalChildIndex }\n    ::= { entPhysicalContainsTable 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "EntPhysicalContainsEntry ::= SEQUENCE {\n      entPhysicalChildIndex     PhysicalIndex\n}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "entPhysicalChildIndex OBJECT-TYPE\n    SYNTAX      PhysicalIndex\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"The value of entPhysicalIndex for the contained physical\n            entity.\"\n    ::= { entPhysicalContainsEntry 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- last change time stamp for the whole MIB entLastChangeTime OBJECT-TYPE SYNTAX TimeStamp MAX-ACCESS read-only STATUS current DESCRIPTION \"The value of sysUpTime at the time a conceptual row is created, modified, or deleted in any of these tables: - entPhysicalTable - entLogicalTable - entLPMappingTable - entAliasMappingTable",
      "ja": " - 全体MIB entLastChangeTimeのOBJECT-TYPE構文タイムスタンプMAX-ACCESS read-only説明「概念的な列は、これらのテーブルのいずれかで作成、変更、または削除されたときのsysUpTimeの値の最後の変更時間スタンプ： - entPhysicalTable  -  entLogicalTable  -  entLPMappingTable  -  entAliasMappingTableの"
    },
    {
      "indent": 4,
      "text": "                - entPhysicalContainsTable\n        \"\n::= { entityGeneral 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- Entity MIB Trap Definitions\nentityMIBTraps      OBJECT IDENTIFIER ::= { entityMIB 2 }\nentityMIBTrapPrefix OBJECT IDENTIFIER ::= { entityMIBTraps 0 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "entConfigChange NOTIFICATION-TYPE STATUS current DESCRIPTION \"An entConfigChange notification is generated when the value of entLastChangeTime changes. It can be utilized by an NMS to trigger logical/physical entity table maintenance polls.",
      "ja": "entConfigChange NOTIFICATION-TYPEステータス現在の説明「entLastChangeTimeの値が変化した場合entConfigChange通知が生成される。論理/物理エンティティテーブルメンテナンスポーリングをトリガーするためにNMSによって利用することができます。"
    },
    {
      "indent": 12,
      "text": "An agent should not generate more than one entConfigChange\n'notification-event' in a given time interval (five seconds\nis the suggested default).  A 'notification-event' is the\ntransmission of a single trap or inform PDU to a list of\nnotification destinations.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 12,
      "text": "If additional configuration changes occur within the throttling period, then notification-events for these changes should be suppressed by the agent until the current throttling period expires. At the end of a throttling period, one notification-event should be generated if any configuration changes occurred since the start of the throttling period. In such a case, another throttling period is started right away.",
      "ja": "追加の構成変更が調整期間内に発生した場合、現在のスロットリング期間が満了するまで、これらの変更の通知イベントはエージェントによって抑制されるべきです。構成の変更は、スロットリング期間の開始以降に発生した場合にスロットリング期間の終了時に、1つの通知イベントが生成されなければなりません。そのような場合には、別のスロットリング期間がすぐに開始されます。"
    },
    {
      "indent": 3,
      "text": "         An NMS should periodically check the value of\n         entLastChangeTime to detect any missed entConfigChange\n         notification-events, e.g., due to throttling or transmission\n         loss.\"\n::= { entityMIBTrapPrefix 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- conformance information\nentityConformance OBJECT IDENTIFIER ::= { entityMIB 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "entityCompliances OBJECT IDENTIFIER ::= { entityConformance 1 }\nentityGroups      OBJECT IDENTIFIER ::= { entityConformance 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- compliance statements entityCompliance MODULE-COMPLIANCE STATUS deprecated",
      "ja": " - 非推奨のコンプライアンスステートメントのentityCompliance MODULE-COMPLIANCEステータス"
    },
    {
      "indent": 4,
      "text": "DESCRIPTION\n        \"The compliance statement for SNMP entities that implement\n        version 1 of the Entity MIB.\"\nMODULE  -- this module\n    MANDATORY-GROUPS {\n                       entityPhysicalGroup,\n                       entityLogicalGroup,\n                       entityMappingGroup,\n                       entityGeneralGroup,\n                       entityNotificationsGroup\n    }\n::= { entityCompliances 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "entity2Compliance MODULE-COMPLIANCE STATUS deprecated DESCRIPTION \"The compliance statement for SNMP entities that implement version 2 of the Entity MIB.\" MODULE -- this module MANDATORY-GROUPS { entityPhysicalGroup, entityPhysical2Group, entityGeneralGroup, entityNotificationsGroup } GROUP entityLogical2Group DESCRIPTION \"Implementation of this group is not mandatory for agents that model all MIB object instances within a single naming scope.\"",
      "ja": "entity2Compliance MODULE-COMPLIANCEステータス非難された説明「エンティティMIBのバージョン2を実装するSNMPエンティティのための準拠宣言。」 MODULE  - このモジュールMANDATORY-GROUPS {entityPhysicalGroup、entityPhysical2Group、entityGeneralGroup、entityNotificationsGroup} GROUP entityLogical2Group DESCRIPTION \"このグループの実装は、単一の命名範囲内のモデルは、すべてのMIBオブジェクトインスタンスそのエージェントのために必須ではありません。\""
    },
    {
      "indent": 8,
      "text": "GROUP entityMappingGroup\nDESCRIPTION\n    \"Implementation of the entPhysicalContainsTable is mandatory\n    for all agents.  Implementation of the entLPMappingTable and\n    entAliasMappingTables are not mandatory for agents that\n    model all MIB object instances within a single naming scope.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 12,
      "text": "Note that the entAliasMappingTable may be useful for all\nagents; however, implementation of the entityLogicalGroup or\nentityLogical2Group is required to support this table.\"",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 8,
      "text": "OBJECT entPhysicalSerialNum MIN-ACCESS not-accessible DESCRIPTION \"Read and write access is not required for agents that cannot identify serial number information for physical entities, and/or cannot provide non-volatile storage for",
      "ja": "OBJECTのentPhysicalSerialNum MIN-ACCESSアクセス不可能な説明は「読み取りおよび物理的なエンティティのシリアル番号情報を識別することができないエージェントに必要とされていないアクセスを書き込み、および/またはのための不揮発性ストレージを提供することはできません"
    },
    {
      "indent": 12,
      "text": "NMS-assigned serial numbers.",
      "ja": "シリアル番号をNMSが割り当てました。"
    },
    {
      "indent": 12,
      "text": "Write access is not required for agents that can identify serial number information for physical entities, but cannot provide non-volatile storage for NMS-assigned serial numbers.",
      "ja": "書き込みアクセスは、物理的なエンティティのシリアル番号情報を識別することができる薬剤のために必須ではありませんが、NMSが割り当てたシリアル番号に不揮発性ストレージを提供することはできません。"
    },
    {
      "indent": 12,
      "text": "Write access is not required for physical entities for which the associated value of the entPhysicalIsFRU object is equal to 'false(2)'.\"",
      "ja": "アクセスがentPhysicalIsFRUオブジェクトの値が「偽（2）」に等しくされている物理的なエンティティのために必要とされていない書きます。」"
    },
    {
      "indent": 8,
      "text": "OBJECT entPhysicalAlias MIN-ACCESS read-only DESCRIPTION \"Write access is required only if the associated entPhysicalClass value is equal to 'chassis(3)'.\"",
      "ja": "OBJECTののentPhysicalAlias MIN-ACCESS読み取り専用説明「書き込みアクセスは、関連するentPhysicalClassの値が 『筐体（3）』に等しい場合にのみ必要です。」"
    },
    {
      "indent": 8,
      "text": "OBJECT entPhysicalAssetID MIN-ACCESS not-accessible DESCRIPTION \"Read and write access is not required for agents that cannot provide non-volatile storage for NMS-assigned asset identifiers.",
      "ja": "OBJECT entPhysicalAssetID MIN-アクセス不可能な説明は「読み取りおよび書き込みアクセスがNMS-割り当てられた資産識別子のための不揮発性ストレージを提供できないエージェントは必要ありません。"
    },
    {
      "indent": 12,
      "text": "Write access is not required for physical entities for which\nthe associated value of the entPhysicalIsFRU object is equal\nto 'false(2)'.\"",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 8,
      "text": "OBJECT entPhysicalClass SYNTAX INTEGER { other(1), unknown(2), chassis(3), backplane(4), container(5), powerSupply(6), fan(7), sensor(8), module(9), port(10), stack(11) } DESCRIPTION \"Implementation of the 'cpu(12)' enumeration is not required.\"",
      "ja": "OBJECT entPhysicalClassのSYNTAX INTEGER {他の（1）、不明（2）、シャーシ（3）、バックプレーン（4）、容器（5）、電源（6）、ファン（7）、センサ（8）は、モジュール（9）、ポート（10）、スタック（11）} DESCRIPTION \" 'CPU（12）' の実装列挙は必要ありません。\""
    },
    {
      "indent": 4,
      "text": "::= { entityCompliances 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "entity3Compliance MODULE-COMPLIANCE STATUS current DESCRIPTION \"The compliance statement for SNMP entities that implement version 3 of the Entity MIB.\" MODULE -- this module MANDATORY-GROUPS { entityPhysicalGroup, entityPhysical2Group, entityPhysical3Group, entityGeneralGroup, entityNotificationsGroup } GROUP entityLogical2Group DESCRIPTION \"Implementation of this group is not mandatory for agents that model all MIB object instances within a single naming scope.\"",
      "ja": "entity3Compliance MODULE-COMPLIANCEステータス現在の説明「エンティティMIBのバージョン3を実装するSNMPエンティティのための準拠宣言。」 MODULE  - このモジュールMANDATORY-GROUPS {entityPhysicalGroup、entityPhysical2Group、entityPhysical3Group、entityGeneralGroup、entityNotificationsGroup} GROUP entityLogical2Group DESCRIPTION \"このグループの実装は、単一の命名範囲内のモデルは、すべてのMIBオブジェクトインスタンスそのエージェントのために必須ではありません。\""
    },
    {
      "indent": 8,
      "text": "GROUP entityMappingGroup\nDESCRIPTION\n    \"Implementation of the entPhysicalContainsTable is mandatory\n    for all agents.  Implementation of the entLPMappingTable and\n    entAliasMappingTables are not mandatory for agents that\n    model all MIB object instances within a single naming scope.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 12,
      "text": "Note that the entAliasMappingTable may be useful for all\nagents; however, implementation of the entityLogicalGroup or\nentityLogical2Group is required to support this table.\"",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 8,
      "text": "OBJECT entPhysicalSerialNum MIN-ACCESS not-accessible DESCRIPTION \"Read and write access is not required for agents that cannot identify serial number information for physical entities, and/or cannot provide non-volatile storage for NMS-assigned serial numbers.",
      "ja": "OBJECTのentPhysicalSerialNum MIN-ACCESSアクセス不可能説明「読み取りおよび書き込みアクセスが物理的なエンティティのシリアル番号情報を識別することができない、および/またはNMSが割り当てたシリアル番号の不揮発性ストレージを提供できないエージェントは必要ありません。"
    },
    {
      "indent": 12,
      "text": "Write access is not required for agents that can identify\nserial number information for physical entities, but cannot\nprovide non-volatile storage for NMS-assigned serial\nnumbers.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 12,
      "text": "Write access is not required for physical entities for which the associated value of the entPhysicalIsFRU object is equal to 'false(2)'.\"",
      "ja": "アクセスがentPhysicalIsFRUオブジェクトの値が「偽（2）」に等しくされている物理的なエンティティのために必要とされていない書きます。」"
    },
    {
      "indent": 8,
      "text": "OBJECT entPhysicalAlias",
      "ja": "OBJECTののentPhysicalAlias"
    },
    {
      "indent": 8,
      "text": "MIN-ACCESS read-only DESCRIPTION \"Write access is required only if the associated entPhysicalClass value is equal to 'chassis(3)'.\"",
      "ja": "MIN-ACCESS読み取り専用説明「書き込みアクセスは、関連するentPhysicalClassの値が 『筐体（3）』に等しい場合にのみ必要です。」"
    },
    {
      "indent": 8,
      "text": "OBJECT entPhysicalAssetID MIN-ACCESS not-accessible DESCRIPTION \"Read and write access is not required for agents that cannot provide non-volatile storage for NMS-assigned asset identifiers.",
      "ja": "OBJECT entPhysicalAssetID MIN-アクセス不可能な説明は「読み取りおよび書き込みアクセスがNMS-割り当てられた資産識別子のための不揮発性ストレージを提供できないエージェントは必要ありません。"
    },
    {
      "indent": 4,
      "text": "        Write access is not required for physical entities for which\n        the associated value of entPhysicalIsFRU is equal to\n        'false(2)'.\"\n::= { entityCompliances 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- MIB groupings\nentityPhysicalGroup    OBJECT-GROUP\n    OBJECTS {\n              entPhysicalDescr,\n              entPhysicalVendorType,\n              entPhysicalContainedIn,\n              entPhysicalClass,\n              entPhysicalParentRelPos,\n              entPhysicalName\n            }\n    STATUS  current\n    DESCRIPTION\n            \"The collection of objects used to represent physical\n            system components, for which a single agent provides\n            management information.\"\n    ::= { entityGroups 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "entityLogicalGroup OBJECT-GROUP OBJECTS { entLogicalDescr, entLogicalType, entLogicalCommunity, entLogicalTAddress, entLogicalTDomain } STATUS deprecated DESCRIPTION \"The collection of objects used to represent the list of logical entities, for which a single agent provides management information.\"",
      "ja": "entityLogicalGroupオブジェクト・グループオブジェクト{entLogicalDescr、entLogicalType、entLogicalCommunity、entLogicalTAddress、entLogicalTDomain}ステータス非難された説明「単一エージェントが管理情報を提供するための論理エンティティのリストを表すために使用されるオブジェクトの収集」。"
    },
    {
      "indent": 4,
      "text": "::= { entityGroups 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "entityMappingGroup    OBJECT-GROUP\n    OBJECTS {\n              entLPPhysicalIndex,\n              entAliasMappingIdentifier,\n              entPhysicalChildIndex\n            }\n    STATUS  current\n    DESCRIPTION\n            \"The collection of objects used to represent the\n            associations between multiple logical entities, physical\n            components, interfaces, and port identifiers, for which a\n            single agent provides management information.\"\n    ::= { entityGroups 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "entityGeneralGroup    OBJECT-GROUP\n    OBJECTS {\n              entLastChangeTime\n            }\n    STATUS  current\n    DESCRIPTION\n            \"The collection of objects used to represent general entity\n            information, for which a single agent provides management\n            information.\"\n    ::= { entityGroups 4 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "entityNotificationsGroup NOTIFICATION-GROUP\n    NOTIFICATIONS { entConfigChange }\n    STATUS        current\n    DESCRIPTION\n            \"The collection of notifications used to indicate Entity MIB\n            data consistency and general status information.\"\n    ::= { entityGroups 5 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "entityPhysical2Group OBJECT-GROUP OBJECTS { entPhysicalHardwareRev, entPhysicalFirmwareRev, entPhysicalSoftwareRev, entPhysicalSerialNum, entPhysicalMfgName, entPhysicalModelName, entPhysicalAlias, entPhysicalAssetID, entPhysicalIsFRU } STATUS current",
      "ja": "entityPhysical2Groupオブジェクト・グループオブジェクト{するentPhysicalHardwareRev、entPhysicalFirmwareRev、entPhysicalSoftwareRev、のentPhysicalSerialNum、entPhysicalMfgName、entPhysicalModelName、のentPhysicalAlias、entPhysicalAssetID、entPhysicalIsFRU} STATUS電流"
    },
    {
      "indent": 4,
      "text": "DESCRIPTION\n        \"The collection of objects used to represent physical\n        system components, for which a single agent provides\n        management information.  This group augments the objects\n        contained in the entityPhysicalGroup.\"\n::= { entityGroups 6 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "entityLogical2Group    OBJECT-GROUP\n    OBJECTS {\n              entLogicalDescr,\n              entLogicalType,\n              entLogicalTAddress,\n              entLogicalTDomain,\n              entLogicalContextEngineID,\n              entLogicalContextName\n            }\n    STATUS  current\n    DESCRIPTION\n            \"The collection of objects used to represent the\n            list of logical entities, for which a single SNMP entity\n            provides management information.\"\n    ::= { entityGroups 7 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "entityPhysical3Group    OBJECT-GROUP\n    OBJECTS {\n              entPhysicalMfgDate,\n              entPhysicalUris\n            }\n    STATUS  current\n    DESCRIPTION\n            \"The collection of objects used to represent physical\n            system components, for which a single agent provides\n            management information.  This group augments the objects\n            contained in the entityPhysicalGroup.\"\n    ::= { entityGroups 8 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "END",
      "ja": "終わり"
    },
    {
      "indent": 0,
      "text": "4. Usage Examples",
      "section_title": true,
      "ja": "4.使用例"
    },
    {
      "indent": 3,
      "text": "The following sections iterate the instance values for two example networking devices. These examples are kept simple to make them more understandable. Auxiliary components such as fans, sensors, empty slots, and sub-modules are not shown, but might be modeled in real implementations.",
      "ja": "以下のセクションでは、2つの例示のネットワークデバイスのインスタンスの値を繰り返します。これらの例は、それらをより理解しやすくするために、単純な保持されます。このようなファンは、センサ、空きスロット、およびサブモジュールのような補助成分は示されていないが、実際の実装でモデル化されるかもしれません。"
    },
    {
      "indent": 0,
      "text": "4.1. Router/Bridge",
      "section_title": true,
      "ja": "4.1. ルータ/ブリッジ"
    },
    {
      "indent": 3,
      "text": "The first example is a router containing two slots. Each slot contains a 3 port router/bridge module. Each port is represented in the ifTable. There are two logical instances of OSPF running and two logical bridges:",
      "ja": "最初の例では、2つのスロットを含むルータです。各スロットは、3ポートルータ/ブリッジモジュールを含んでいます。各ポートはifTableで表されます。 OSPFの実行の二つの論理インスタンスと二つの論理橋があります。"
    },
    {
      "indent": 4,
      "text": "Physical entities -- entPhysicalTable: 1 Field-replaceable physical chassis: entPhysicalDescr.1 == 'Acme Chassis Model 100' entPhysicalVendorType.1 == acmeProducts.chassisTypes.1 entPhysicalContainedIn.1 == 0 entPhysicalClass.1 == chassis(3) entPhysicalParentRelPos.1 == 0 entPhysicalName.1 == '100-A' entPhysicalHardwareRev.1 == 'A(1.00.02)' entPhysicalSoftwareRev.1 == '' entPhysicalFirmwareRev.1 == '' entPhysicalSerialNum.1 == 'C100076544' entPhysicalMfgName.1 == 'Acme' entPhysicalModelName.1 == '100' entPhysicalAlias.1 == 'cl-SJ17-3-006:rack1:rtr-U3' entPhysicalAssetID.1 == '0007372293' entPhysicalIsFRU.1 == true(1) entPhysicalMfgDate.1 == '2002-5-26,13:30:30.0,-4:0' entPhysicalUris.1 == 'URN:CLEI:CNME120ARA' 2 slots within the chassis: entPhysicalDescr.2 == 'Acme Chassis Slot Type AA' entPhysicalVendorType.2 == acmeProducts.slotTypes.1 entPhysicalContainedIn.2 == 1 entPhysicalClass.2 == container(5) entPhysicalParentRelPos.2 == 1 entPhysicalName.2 == 'S1' entPhysicalHardwareRev.2 == 'B(1.00.01)' entPhysicalSoftwareRev.2 == '' entPhysicalFirmwareRev.2 == '' entPhysicalSerialNum.2 == '' entPhysicalMfgName.2 == 'Acme' entPhysicalModelName.2 == 'AA' entPhysicalAlias.2 == '' entPhysicalAssetID.2 == '' entPhysicalIsFRU.2 == false(2) entPhysicalMfgDate.2 == '2002-7-26,12:22:12.0,-4:0' entPhysicalUris.2 == 'URN:CLEI:CNME123ARA'",
      "ja": "物理的なエンティティ - のentPhysicalTable：1つのフィールド交換可能な物理的シャーシ：entPhysicalDescr.1 == 'アクメシャーシモデル100' entPhysicalVendorType.1 == acmeProducts.chassisTypes.1 entPhysicalContainedIn.1 == 0 entPhysicalClass.1 ==シャーシ（3）（注）entPhysicalParentRelPos .1 == 0 entPhysicalName.1 == '100' entPhysicalHardwareRev.1 == '（1.00.02）' entPhysicalSoftwareRev.1 == '' entPhysicalFirmwareRev.1 == '' entPhysicalSerialNum.1 == 'C100076544' entPhysicalMfgName.1 == 'アクメ' entPhysicalModelName.1 == '100' entPhysicalAlias.1 == 'CL-SJ17-3-006：RACK1：RTR-U3' entPhysicalAssetID.1 == '0007372293' entPhysicalIsFRU.1 ==真（1）entPhysicalMfgDate.1 == '2002-5-26,13：30：30.0、-4：0' entPhysicalUris.1 == 'URN：CLEI：CNME120ARA' シャーシ内の2つのスロット：entPhysicalDescr.2 == ' ACMEシャーシのスロットタイプAA」entPhysicalVendorType.2 == acmeProducts.slotTypes.1 entPhysicalContainedIn.2 == 1 entPhysicalClass.2 ==容器（5）entPhysicalParentRelPos.2 == 1 entPhysicalName.2 == 'S1' entPhysicalHardwareRev.2 =='B（1.00.01）' entPhysicalSoftwareRev.2 == '' entPhysicalFirmwareRev.2 == '' entPhysicalSerialNum.2 == '' entPhysicalMfgName.2 == 'アクメ' entPhysicalModelName.2 == 'AA' entPhysicalAlias.2 == 'entPhysicalAssetID.2 == '' entPhysicalIsFRU.2 ==（2）entPhysicalMfgDate.2 ==偽 '2002-7-26,12：22：12.0、-4：0' entPhysicalUris.2 ==「URN：CLEI ：CNME123ARA」"
    },
    {
      "indent": 9,
      "text": "entPhysicalDescr.3 ==             'Acme Chassis Slot Type AA'\nentPhysicalVendorType.3 =         acmeProducts.slotTypes.1\nentPhysicalContainedIn.3 ==       1\nentPhysicalClass.3 ==             container(5)\nentPhysicalParentRelPos.3 ==      2\nentPhysicalName.3 ==              'S2'\nentPhysicalHardwareRev.3 ==       '1.00.07'\nentPhysicalSoftwareRev.3 ==       ''\nentPhysicalFirmwareRev.3 ==       ''\nentPhysicalSerialNum.3 ==         ''\nentPhysicalMfgName.3 ==           'Acme'\nentPhysicalModelName.3 ==         'AA'\nentPhysicalAlias.3 ==             ''\nentPhysicalAssetID.3 ==           ''\nentPhysicalIsFRU.3 ==             false(2)\nentPhysicalMfgDate.3 ==           '2002-7-26,12:12:12.0,-4:0'\nentPhysicalUris.3 ==              'URN:CLEI:CNME123ARA'",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 7,
      "text": "2 Field-replaceable modules: Slot 1 contains a module with 3 ports: entPhysicalDescr.4 == 'Acme Router-100' entPhysicalVendorType.4 == acmeProducts.moduleTypes.14 entPhysicalContainedIn.4 == 2 entPhysicalClass.4 == module(9) entPhysicalParentRelPos.4 == 1 entPhysicalName.4 == 'M1' entPhysicalHardwareRev.4 == '1.00.07' entPhysicalSoftwareRev.4 == '1.4.1' entPhysicalFirmwareRev.4 == 'A(1.1)' entPhysicalSerialNum.4 == 'C100087363' entPhysicalMfgName.4 == 'Acme' entPhysicalModelName.4 == 'R100-FE' entPhysicalAlias.4 == 'rtr-U3:m1:SJ17-3-eng' entPhysicalAssetID.4 == '0007372462' entPhysicalIsFRU.4 == true(1) entPhysicalMfgDate.4 == '2003-7-18,13:30:30.0,-4:0' entPhysicalUris.4 == 'URN:CLEI:CNRU123CAA'",
      "ja": "2フィールド交換可能なモジュール：スロット1は3つのポートとモジュールが含ま：entPhysicalDescr.4 == 'アクメルータ-100' entPhysicalVendorType.4 == acmeProducts.moduleTypes.14 entPhysicalContainedIn.4 == 2 entPhysicalClass.4 ==モジュール（9 ）entPhysicalParentRelPos.4 == 1 entPhysicalName.4 == 'M1' entPhysicalHardwareRev.4 == '1.00.07' entPhysicalSoftwareRev.4 == '1.4.1' entPhysicalFirmwareRev.4 == '（1.1）' entPhysicalSerialNum.4 = = 'C100087363' entPhysicalMfgName.4 == 'アクメ' entPhysicalModelName.4 == 'R100-FE' entPhysicalAlias.4 == 'RTR-U3：M1：SJ17-3-ENG' entPhysicalAssetID.4 == '0007372462' entPhysicalIsFRU。 4 ==真（1）entPhysicalMfgDate.4 == '2003-7-18,13：30：30.0、-4：0' entPhysicalUris.4 == 'URN：CLEI：CNRU123CAA'"
    },
    {
      "indent": 9,
      "text": "entPhysicalDescr.5 == 'Acme Ethernet-100 Port' entPhysicalVendorType.5 == acmeProducts.portTypes.2 entPhysicalContainedIn.5 == 4 entPhysicalClass.5 == port(10) entPhysicalParentRelPos.5 == 1 entPhysicalName.5 == 'P1' entPhysicalHardwareRev.5 == 'G(1.02)' entPhysicalSoftwareRev.5 == '' entPhysicalFirmwareRev.5 == '1.1' entPhysicalSerialNum.5 == '' entPhysicalMfgName.5 == 'Acme' entPhysicalModelName.5 == 'FE-100' entPhysicalAlias.5 == '' entPhysicalAssetID.5 == '' entPhysicalIsFRU.5 == false(2) entPhysicalMfgDate.5 == '2003-7-18,14:20:22.0,-4:0' entPhysicalUris.5 == 'URN:CLEI:CNMES23ARA'",
      "ja": "entPhysicalDescr.5 == 'アクメイーサネットポート100' entPhysicalVendorType.5 == acmeProducts.portTypes.2 entPhysicalContainedIn.5の== 4 entPhysicalClass.5 ==ポート（10）entPhysicalParentRelPos.5 == 1 entPhysicalName.5 ==「P1 'entPhysicalHardwareRev.5 == 'G（1.02）' entPhysicalSoftwareRev.5 == '' entPhysicalFirmwareRev.5 == '1.1' entPhysicalSerialNum.5 == '' entPhysicalMfgName.5 == 'アクメ' entPhysicalModelName.5 ==' FE- 100' entPhysicalAlias.5 == '' entPhysicalAssetID.5 == '' entPhysicalIsFRU.5 ==偽（2）entPhysicalMfgDate.5 == '2003-7-18,14：20：22.0、-4：0' entPhysicalUris。 5 == 'URN：CLEI：CNMES23ARA'"
    },
    {
      "indent": 9,
      "text": "entPhysicalDescr.6 == 'Acme Ethernet-100 Port' entPhysicalVendorType.6 == acmeProducts.portTypes.2 entPhysicalContainedIn.6 == 4 entPhysicalClass.6 == port(10) entPhysicalParentRelPos.6 == 2 entPhysicalName.6 == 'P2' entPhysicalHardwareRev.6 == 'G(1.02)' entPhysicalSoftwareRev.6 == '' entPhysicalFirmwareRev.6 == '1.1' entPhysicalSerialNum.6 == '' entPhysicalMfgName.6 == 'Acme' entPhysicalModelName.6 == 'FE-100' entPhysicalAlias.6 == '' entPhysicalAssetID.6 == '' entPhysicalIsFRU.6 == false(2) entPhysicalMfgDate.6 == '2003-7-19,10:15:15.0,-4:0' entPhysicalUris.6 == 'URN:CLEI:CNMES23ARA'",
      "ja": "entPhysicalDescr.6 == 'アクメイーサネットポート100' entPhysicalVendorType.6 == acmeProducts.portTypes.2 entPhysicalContainedIn.6の== 4 entPhysicalClass.6 ==ポート（10）entPhysicalParentRelPos.6 == 2 entPhysicalName.6 ==「P2 'entPhysicalHardwareRev.6 == 'G（1.02）' entPhysicalSoftwareRev.6 == '' entPhysicalFirmwareRev.6 == '1.1' entPhysicalSerialNum.6 == '' entPhysicalMfgName.6 == 'アクメ' entPhysicalModelName.6 ==' FE- 100' entPhysicalAlias.6 == '' entPhysicalAssetID.6 == '' entPhysicalIsFRU.6 ==偽（2）entPhysicalMfgDate.6 == '2003-7-19,10：15：15.0、-4：0' entPhysicalUris。 6 == 'URN：CLEI：CNMES23ARA'"
    },
    {
      "indent": 9,
      "text": "entPhysicalDescr.7 == 'Acme Router-100 FDDI-Port' entPhysicalVendorType.7 == acmeProducts.portTypes.3 entPhysicalContainedIn.7 == 4 entPhysicalClass.7 == port(10) entPhysicalParentRelPos.7 == 3 entPhysicalName.7 == 'P3' entPhysicalHardwareRev.7 == 'B(1.03)' entPhysicalSoftwareRev.7 == '2.5.1' entPhysicalFirmwareRev.7 == '2.5F' entPhysicalSerialNum.7 == '' entPhysicalMfgName.7 == 'Acme' entPhysicalModelName.7 == 'FDDI-100' entPhysicalAlias.7 == '' entPhysicalAssetID.7 == '' entPhysicalIsFRU.7 == false(2)",
      "ja": "entPhysicalDescr.7 == 'アクメルータ-100 FDDIポート' entPhysicalVendorType.7 == acmeProducts.portTypes.3 entPhysicalContainedIn.7の== 4 entPhysicalClass.7 ==ポート（10）entPhysicalParentRelPos.7 == 3 entPhysicalName.7 == 'P3' entPhysicalHardwareRev.7 == 'B（1.03）' entPhysicalSoftwareRev.7 == '2.5.1' entPhysicalFirmwareRev.7 == '2.5F' entPhysicalSerialNum.7 == '' entPhysicalMfgName.7 == 'アクメ' entPhysicalModelName。 7 == 'FDDI-100' entPhysicalAlias.7 == '' entPhysicalAssetID.7 == '' entPhysicalIsFRU.7 == FALSE（2）"
    },
    {
      "indent": 6,
      "text": "Slot 2 contains another 3-port module: entPhysicalDescr.8 == 'Acme Router-100 Comm Module' entPhysicalVendorType.8 == acmeProducts.moduleTypes.15 entPhysicalContainedIn.8 == 3 entPhysicalClass.8 == module(9) entPhysicalParentRelPos.8 == 1 entPhysicalName.8 == 'M2' entPhysicalHardwareRev.8 == '2.01.00' entPhysicalSoftwareRev.8 == '3.0.7' entPhysicalFirmwareRev.8 == 'A(1.2)' entPhysicalSerialNum.8 == 'C100098732' entPhysicalMfgName.8 == 'Acme' entPhysicalModelName.8 == 'C100' entPhysicalAlias.8 == 'rtr-U3:m2:SJ17-2-eng' entPhysicalAssetID.8 == '0007373982' entPhysicalIsFRU.8 == true(1) entPhysicalMfgDate.8 == '2002-5-26,13:30:15.0,-4:0' entPhysicalUris.8 == 'URN:CLEI:CNRT321MAA'",
      "ja": "スロット2は、別の3ポートモジュールが含ま：entPhysicalDescr.8 == 'アクメルータ-100 Commのモジュール' entPhysicalVendorType.8 == acmeProducts.moduleTypes.15 entPhysicalContainedIn.8の== 3 entPhysicalClass.8 ==モジュール（9）entPhysicalParentRelPos.8 == 1 entPhysicalName.8 == 'M2' entPhysicalHardwareRev.8 == '2.01.00' entPhysicalSoftwareRev.8 == '3.0.7' entPhysicalFirmwareRev.8 == '（1.2）' entPhysicalSerialNum.8 == 'C100098732' entPhysicalMfgName.8 == 'アクメ' entPhysicalModelName.8 == 'C100' entPhysicalAlias.8 == 'RTR-U3：M2：SJ17-2-ENG' entPhysicalAssetID.8 == '0007373982' entPhysicalIsFRU.8 ==真（1 ）entPhysicalMfgDate.8 == '2002-5-26,13：30：15.0、-4：0' entPhysicalUris.8 == 'URN：CLEI：CNRT321MAA'"
    },
    {
      "indent": 9,
      "text": "entPhysicalDescr.9 == 'Acme Fddi-100 Port' entPhysicalVendorType.9 == acmeProducts.portTypes.5 entPhysicalContainedIn.9 == 8 entPhysicalClass.9 == port(10) entPhysicalParentRelPos.9 == 1 entPhysicalName.9 == 'FDDI Primary' entPhysicalHardwareRev.9 == 'CC(1.07)' entPhysicalSoftwareRev.9 == '2.0.34' entPhysicalFirmwareRev.9 == '1.1' entPhysicalSerialNum.9 == '' entPhysicalMfgName.9 == 'Acme' entPhysicalModelName.9 == 'FDDI-100' entPhysicalAlias.9 == '' entPhysicalAssetID.9 == '' entPhysicalIsFRU.9 == false(2)",
      "ja": "entPhysicalDescr.9 == 'アクメFDDI-100ポート' entPhysicalVendorType.9 == acmeProducts.portTypes.5 entPhysicalContainedIn.9の== 8 entPhysicalClass.9 ==ポート（10）entPhysicalParentRelPos.9 == 1 entPhysicalName.9 ==「FDDI原発」entPhysicalHardwareRev.9 == 'CC（1.07）' entPhysicalSoftwareRev.9 == '2.0.34' entPhysicalFirmwareRev.9 == '1.1' entPhysicalSerialNum.9 == '' entPhysicalMfgName.9 == 'アクメ' entPhysicalModelName.9 = = 'FDDI-100' entPhysicalAlias.9 == '' entPhysicalAssetID.9 == '' entPhysicalIsFRU.9 == FALSE（2）"
    },
    {
      "indent": 9,
      "text": "entPhysicalDescr.10 == 'Acme Ethernet-100 Port' entPhysicalVendorType.10 == acmeProducts.portTypes.2 entPhysicalContainedIn.10 == 8 entPhysicalClass.10 == port(10) entPhysicalParentRelPos.10 == 2 entPhysicalName.10 == 'Ethernet A' entPhysicalHardwareRev.10 == 'G(1.04)' entPhysicalSoftwareRev.10 == '' entPhysicalFirmwareRev.10 == '1.3' entPhysicalSerialNum.10 == '' entPhysicalMfgName.10 == 'Acme' entPhysicalModelName.10 == 'FE-100' entPhysicalAlias.10 == '' entPhysicalAssetID.10 == '' entPhysicalIsFRU.10 == false(2) entPhysicalMfgDate.10 == '2002-7-26,13:30:15.0,-4:0' entPhysicalUris.10 == 'URN:CLEI:CNMES23ARA'",
      "ja": "entPhysicalDescr.10 == 'アクメイーサネットポート100' entPhysicalVendorType.10 == acmeProducts.portTypes.2 entPhysicalContainedIn.10 == 8 entPhysicalClass.10 ==ポート（10）entPhysicalParentRelPos.10 == 2 entPhysicalName.10 ==「イーサネット'entPhysicalHardwareRev.10 == 'G（1.04）' entPhysicalSoftwareRev.10 == '' entPhysicalFirmwareRev.10 == '1.3' entPhysicalSerialNum.10 == '' entPhysicalMfgName.10 == 'アクメ' entPhysicalModelName.10 ==' FE -100' entPhysicalAlias.10 == '' entPhysicalAssetID.10 == '' entPhysicalIsFRU.10 ==偽（2）entPhysicalMfgDate.10 == '2002-7-26,13：30：15.0、-4：0' entPhysicalUris 0.10 == 'URN：CLEI：CNMES23ARA'"
    },
    {
      "indent": 9,
      "text": "entPhysicalDescr.11 == 'Acme Ethernet-100 Port' entPhysicalVendorType.11 == acmeProducts.portTypes.2 entPhysicalContainedIn.11 == 8 entPhysicalClass.11 == port(10) entPhysicalParentRelPos.11 == 3 entPhysicalName.11 == 'Ethernet B' entPhysicalHardwareRev.11 == 'G(1.04)' entPhysicalSoftwareRev.11 == '' entPhysicalFirmwareRev.11 == '1.3' entPhysicalSerialNum.11 == '' entPhysicalMfgName.11 == 'Acme' entPhysicalModelName.11 == 'FE-100' entPhysicalAlias.11 == '' entPhysicalAssetID.11 == '' entPhysicalIsFRU.11 == false(2) entPhysicalMfgDate.11 == '2002-8-16,15:35:15.0,-4:0' entPhysicalUris.11 == 'URN:CLEI:CNMES23ARA'",
      "ja": "entPhysicalDescr.11 == 'アクメイーサネットポート100' entPhysicalVendorType.11 == acmeProducts.portTypes.2 entPhysicalContainedIn.11 == 8 entPhysicalClass.11 ==ポート（10）entPhysicalParentRelPos.11の== 3 entPhysicalName.11 ==「イーサネットB 'entPhysicalHardwareRev.11 == 'G（1.04）' entPhysicalSoftwareRev.11 == '' entPhysicalFirmwareRev.11 == '1.3' entPhysicalSerialNum.11 == '' entPhysicalMfgName.11 == 'アクメ' entPhysicalModelName.11 ==' FE -100' entPhysicalAlias.11 == '' entPhysicalAssetID.11 == '' entPhysicalIsFRU.11 ==偽（2）entPhysicalMfgDate.11 == '2002-8-16,15：35：15.0、-4：0' entPhysicalUris 0.11 == 'URN：CLEI：CNMES23ARA'"
    },
    {
      "indent": 6,
      "text": "Logical entities -- entLogicalTable; no SNMPv3 support 2 OSPF instances: entLogicalDescr.1 == 'Acme OSPF v1.1' entLogicalType.1 == ospf entLogicalCommunity.1 == 'public-ospf1' entLogicalTAddress.1 == 192.0.2.1:161 entLogicalTDomain.1 == snmpUDPDomain entLogicalContextEngineID.1 == '' entLogicalContextName.1 == ''",
      "ja": "論理エンティティ -  entLogicalTable。ノーSNMPv3のサポート2 OSPFインスタンス：entLogicalDescr.1 == 'アクメOSPF v1.1の' entLogicalType.1 == OSPF entLogicalCommunity.1 == '公開OSPF1' entLogicalTAddress.1の== 192.0.2.1:161 entLogicalTDomain.1 == snmpUDPDomain entLogicalContextEngineID.1 == '' entLogicalContextName.1 == ''"
    },
    {
      "indent": 9,
      "text": "entLogicalDescr.2 == 'Acme OSPF v1.1' entLogicalType.2 == ospf entLogicalCommunity.2 == 'public-ospf2' entLogicalTAddress.2 == 192.0.2.1:161 entLogicalTDomain.2 == snmpUDPDomain entLogicalContextEngineID.2 == '' entLogicalContextName.2 == ''",
      "ja": "entLogicalDescr.2 == 'アクメOSPF v1.1の' entLogicalType.2 == OSPF entLogicalCommunity.2 == '公開OSPF2' entLogicalTAddress.2 == 192.0.2.1:161 entLogicalTDomain.2 == snmpUDPDomain entLogicalContextEngineID.2 == ' 「entLogicalContextName.2 == ''"
    },
    {
      "indent": 7,
      "text": "2 logical bridges: entLogicalDescr.3 == 'Acme Bridge v2.1.1' entLogicalType.3 == dot1dBridge entLogicalCommunity.3 == 'public-bridge1' entLogicalTAddress.3 == 192.0.2.1:161 entLogicalTDomain.3 == snmpUDPDomain entLogicalContextEngineID.3 == '' entLogicalContextName.3 == ''",
      "ja": "2つの論理ブリッジ：entLogicalDescr.3 == 'アクメ橋V2.1.1' entLogicalType.3 == dot1dBridge entLogicalCommunity.3 == '公開bridge1' entLogicalTAddress.3 == 192.0.2.1:161 entLogicalTDomain.3 == snmpUDPDomain entLogicalContextEngineID。 3 == '' entLogicalContextName.3 == ''"
    },
    {
      "indent": 9,
      "text": "entLogicalDescr.4 == 'Acme Bridge v2.1.1' entLogicalType.4 == dot1dBridge entLogicalCommunity.4 == 'public-bridge2' entLogicalTAddress.4 == 192.0.2.1:161 entLogicalTDomain.4 == snmpUDPDomain entLogicalContextEngineID.4 == '' entLogicalContextName.4 == ''",
      "ja": "entLogicalDescr.4 == 'アクメ橋2.1.1' entLogicalType.4 == dot1dBridge entLogicalCommunity.4 == '公開bridge2は' entLogicalTAddress.4 == 192.0.2.1:161 entLogicalTDomain.4 == snmpUDPDomain entLogicalContextEngineID.4 == ' 「entLogicalContextName.4 == ''"
    },
    {
      "indent": 3,
      "text": "Logical to Physical Mappings: 1st OSPF instance: uses module 1-port 1 entLPPhysicalIndex.1.5 == 5",
      "ja": "第一OSPFインスタンス：物理マッピングへの論理モジュール1ポート1 entLPPhysicalIndex.1.5の== 5を使用しています"
    },
    {
      "indent": 5,
      "text": "2nd OSPF instance: uses module 2-port 1 entLPPhysicalIndex.2.9 == 9",
      "ja": "2 OSPFインスタンス：== 9モジュール2ポート1 entLPPhysicalIndex.2.9を使用"
    },
    {
      "indent": 5,
      "text": "1st bridge group: uses module 1, all ports",
      "ja": "第1ブリッジグループは：モジュール1、すべてのポートを使用します"
    },
    {
      "indent": 5,
      "text": "[ed. -- Note that these mappings are included in the table because another logical entity (1st OSPF) utilizes one of the ports. If this were not the case, then a single mapping to the module (e.g., entLPPhysicalIndex.3.4) would be present instead.] entLPPhysicalIndex.3.5 == 5 entLPPhysicalIndex.3.6 == 6 entLPPhysicalIndex.3.7 == 7",
      "ja": "[編。 - 別の論理エンティティ（第1 OSPF）はポートのいずれかを利用するので、これらのマッピングがテーブルに含まれていることに留意されたいです。この場合、モジュール（例えば、entLPPhysicalIndex.3.4）に単一のマッピングがなかった場合に代わりに存在するであろう。] entLPPhysicalIndex.3.5の== 5 entLPPhysicalIndex.3.6の== 6 entLPPhysicalIndex.3.7 == 7"
    },
    {
      "indent": 5,
      "text": "2nd bridge group: uses module 2, all ports entLPPhysicalIndex.4.9 == 9 entLPPhysicalIndex.4.10 == 10 entLPPhysicalIndex.4.11 == 11",
      "ja": "第2のブリッジグループ：モジュール2、全てのポートentLPPhysicalIndex.4.9 == 9 entLPPhysicalIndex.4.10 == 10 entLPPhysicalIndex.4.11の== 11を使用"
    },
    {
      "indent": 3,
      "text": "Physical to Logical to MIB Alias Mappings -- entAliasMappingTable: Example 1: ifIndex values are global to all logical entities entAliasMappingIdentifier.5.0 == ifIndex.1 entAliasMappingIdentifier.6.0 == ifIndex.2 entAliasMappingIdentifier.7.0 == ifIndex.3 entAliasMappingIdentifier.9.0 == ifIndex.4 entAliasMappingIdentifier.10.0 == ifIndex.5 entAliasMappingIdentifier.11.0 == ifIndex.6",
      "ja": "MIBエイリアスマッピングに論理的に物理 -  entAliasMappingTableの例1：ifIndex値は、すべての論理エンティティにグローバルでentAliasMappingIdentifier.5.0 == ifIndex.1 entAliasMappingIdentifier.6.0 == ifIndex.2 entAliasMappingIdentifier.7.0 == ifIndex.3 entAliasMappingIdentifier.9.0 = = ifIndex.4 entAliasMappingIdentifier.10.0 == ifIndex.5 entAliasMappingIdentifier.11.0 == ifIndex.6"
    },
    {
      "indent": 3,
      "text": " Example 2: ifIndex values are not shared by all logical entities; (Bridge-1 uses ifIndex values 101 - 103 and Bridge-2 uses ifIndex values 204-206.) entAliasMappingIdentifier.5.0 == ifIndex.1 entAliasMappingIdentifier.5.3 == ifIndex.101 entAliasMappingIdentifier.6.0 == ifIndex.2 entAliasMappingIdentifier.6.3 == ifIndex.102 entAliasMappingIdentifier.7.0 == ifIndex.3 entAliasMappingIdentifier.7.3 == ifIndex.103 entAliasMappingIdentifier.9.0 == ifIndex.4 entAliasMappingIdentifier.9.4 == ifIndex.204 entAliasMappingIdentifier.10.0 == ifIndex.5 entAliasMappingIdentifier.10.4 == ifIndex.205 entAliasMappingIdentifier.11.0 == ifIndex.6 entAliasMappingIdentifier.11.4 == ifIndex.206",
      "ja": "例2：ifIndex値は、すべての論理エンティティで共有されていません。 （ブリッジ1のifIndex 101値使用 -  103及びブリッジ2のifIndexは204~206値使用）entAliasMappingIdentifier.5.0 == ifIndex.1 entAliasMappingIdentifier.5.3 == ifIndex.101 entAliasMappingIdentifier.6.0 == ifIndex.2 entAliasMappingIdentifier.6.3 = = ifIndex.102 entAliasMappingIdentifier.7.0 == ifIndex.3 entAliasMappingIdentifier.7.3 == ifIndex.103 entAliasMappingIdentifier.9.0 == ifIndex.4 entAliasMappingIdentifier.9.4 == ifIndex.204 entAliasMappingIdentifier.10.0 == ifIndex.5 entAliasMappingIdentifier.10.4 ==のifIndex 0.205 entAliasMappingIdentifier.11.0 == ifIndex.6 entAliasMappingIdentifier.11.4 == ifIndex.206"
    },
    {
      "indent": 3,
      "text": "Physical Containment Tree -- entPhysicalContainsTable chassis has two containers: entPhysicalChildIndex.1.2 == 2 entPhysicalChildIndex.1.3 == 3",
      "ja": "entPhysicalChildIndex.1.2 == 2 entPhysicalChildIndex.1.3 == 3： - 物理的封じ込めツリーentPhysicalContainsTableはシャーシには二つの容器を持っています"
    },
    {
      "indent": 5,
      "text": "container 1 has a module: entPhysicalChildIndex.2.4 == 4",
      "ja": "== 4 entPhysicalChildIndex.2.4：容器1はモジュールを有します"
    },
    {
      "indent": 5,
      "text": "container 2 has a module: entPhysicalChildIndex.3.8 == 8",
      "ja": "== 8 entPhysicalChildIndex.3.8：容器2は、モジュールを有します"
    },
    {
      "indent": 5,
      "text": "module 1 has 3 ports: entPhysicalChildIndex.4.5 == 5 entPhysicalChildIndex.4.6 == 6 entPhysicalChildIndex.4.7 == 7",
      "ja": "entPhysicalChildIndex.4.5の== 5 entPhysicalChildIndex.4.6の== 6 entPhysicalChildIndex.4.7 == 7：モジュール1は、3つのポートを有します"
    },
    {
      "indent": 5,
      "text": "module 2 has 3 ports: entPhysicalChildIndex.8.9 == 9 entPhysicalChildIndex.8.10 == 10 entPhysicalChildIndex.8.11 == 11",
      "ja": "entPhysicalChildIndex.8.9の== 9 entPhysicalChildIndex.8.10 == 10 entPhysicalChildIndex.8.11 == 11：モジュール2は、3つのポートを有します"
    },
    {
      "indent": 0,
      "text": "4.2. Repeaters",
      "section_title": true,
      "ja": "4.2. リピータ"
    },
    {
      "indent": 3,
      "text": "The second example is a 3-slot Hub with 2 backplane ethernet segments. Slot three is empty, and the remaining slots contain ethernet repeater modules.",
      "ja": "第二の例は、2バックプレーンイーサネットセグメントで3スロットハブです。スロット3は空であり、そして残りのスロットは、イーサネットリピータモジュールを含みます。"
    },
    {
      "indent": 3,
      "text": "Note that this example assumes an older Repeater MIB implementation, (RFC 1516 [RFC1516]) rather than the new Repeater MIB (RFC 2108 [RFC2108]). The new version contains an object called 'rptrPortRptrId', which should be used to identify repeater port groupings, rather than using community strings or contexts.",
      "ja": "むしろ新しいリピータMIB（RFC 2108 [RFC2108]）よりも、この例では、古いリピータMIBの実装を想定している、（RFC 1516 [RFC1516]）。新バージョンではなく、コミュニティストリングまたはコンテキストを使用するよりも、リピータポートのグループを識別するために使用されなければならない「rptrPortRptrId」と呼ばれるオブジェクトが含まれています。"
    },
    {
      "indent": 3,
      "text": "Physical entities -- entPhysicalTable: 1 Field-replaceable physical chassis: entPhysicalDescr.1 == 'Acme Chassis Model 110' entPhysicalVendorType.1 == acmeProducts.chassisTypes.2 entPhysicalContainedIn.1 == 0 entPhysicalClass.1 == chassis(3) entPhysicalParentRelPos.1 ==0 entPhysicalName.1 == '110-B' entPhysicalHardwareRev.1 == 'A(1.02.00)' entPhysicalSoftwareRev.1 == '' entPhysicalFirmwareRev.1 == '' entPhysicalSerialNum.1 == 'C100079294' entPhysicalMfgName.1 == 'Acme' entPhysicalModelName.1 == '110' entPhysicalAlias.1 == 'bldg09:floor1:rptr18:0067eea0229f' entPhysicalAssetID.1 == '0007386327' entPhysicalIsFRU.1 == true(1)",
      "ja": "物理的なエンティティ - のentPhysicalTable：1つのフィールド交換可能な物理的シャーシ：entPhysicalDescr.1 == 'アクメシャーシモデル110' entPhysicalVendorType.1 == acmeProducts.chassisTypes.2 entPhysicalContainedIn.1 == 0 entPhysicalClass.1 ==シャーシ（3）（注）entPhysicalParentRelPos .1 == 0 entPhysicalName.1 == '110-B' entPhysicalHardwareRev.1 == '（1.02.00）' entPhysicalSoftwareRev.1 == '' entPhysicalFirmwareRev.1 == '' entPhysicalSerialNum.1 == 'C100079294' entPhysicalMfgName.1 == 'アクメ' entPhysicalModelName.1 == '110' entPhysicalAlias.1 == 'bldg09：floor1：rptr18：0067eea0229f' entPhysicalAssetID.1 == '0007386327' entPhysicalIsFRU.1 ==真（1）"
    },
    {
      "indent": 6,
      "text": "2 Chassis Ethernet Backplanes: entPhysicalDescr.2 == 'Acme Ethernet Backplane Type A' entPhysicalVendorType.2 == acmeProducts.backplaneTypes.1 entPhysicalContainedIn.2 == 1 entPhysicalClass.2 == backplane(4) entPhysicalParentRelPos.2 == 1 entPhysicalName.2 == 'B1' entPhysicalHardwareRev.2 == 'A(2.04.01)' entPhysicalSoftwareRev.2 == '' entPhysicalFirmwareRev.2 == '' entPhysicalSerialNum.2 == '' entPhysicalMfgName.2 == 'Acme' entPhysicalModelName.2 == 'BK-A' entPhysicalAlias.2 == '' entPhysicalAssetID.2 == '' entPhysicalIsFRU.2 == false(2)",
      "ja": "2つのシャーシイーサネットバックプレーン：entPhysicalDescr.2 == 'アクメイーサネットバックプレーンタイプA' entPhysicalVendorType.2 == acmeProducts.backplaneTypes.1 entPhysicalContainedIn.2 == 1 entPhysicalClass.2 ==バックプレーン（4）entPhysicalParentRelPos.2 == 1のentPhysicalName。 == '（2.04.01）' entPhysicalSoftwareRev.2 == '' entPhysicalFirmwareRev.2 == '' entPhysicalSerialNum.2 == '' entPhysicalMfgName.2 == 'アクメ' entPhysicalModelName 2 == 'B1' entPhysicalHardwareRev.2。 2 == 'BK-A' entPhysicalAlias.2 == '' entPhysicalAssetID.2 == '' entPhysicalIsFRU.2 == FALSE（2）"
    },
    {
      "indent": 9,
      "text": "entPhysicalDescr.3 == 'Acme Ethernet Backplane Type A' entPhysicalVendorType.3 == acmeProducts.backplaneTypes.1 entPhysicalContainedIn.3 == 1 entPhysicalClass.3 == backplane(4) entPhysicalParentRelPos.3 == 2 entPhysicalName.3 == 'B2' entPhysicalHardwareRev.3 == 'A(2.04.01)' entPhysicalSoftwareRev.3 == '' entPhysicalFirmwareRev.3 == '' entPhysicalSerialNum.3 == '' entPhysicalMfgName.3 == 'Acme' entPhysicalModelName.3 == 'BK-A' entPhysicalAlias.3 == '' entPhysicalAssetID.3 == '' entPhysicalIsFRU.3 == false(2)",
      "ja": "entPhysicalDescr.3 == 'アクメイーサネットバックプレーンタイプA' entPhysicalVendorType.3 == acmeProducts.backplaneTypes.1 entPhysicalContainedIn.3 == 1 entPhysicalClass.3 ==バックプレーン（4）entPhysicalParentRelPos.3 == 2 entPhysicalName.3 ==「B2 'entPhysicalHardwareRev.3 == '（2.04.01）' entPhysicalSoftwareRev.3 == '' entPhysicalFirmwareRev.3 == '' entPhysicalSerialNum.3 == '' entPhysicalMfgName.3 == 'アクメ' entPhysicalModelName.3 ==' BK -A」entPhysicalAlias.3 == '' entPhysicalAssetID.3 == '' entPhysicalIsFRU.3 ==偽（2）"
    },
    {
      "indent": 6,
      "text": "3 slots within the chassis: entPhysicalDescr.4 == 'Acme Hub Slot Type RB' entPhysicalVendorType.4 == acmeProducts.slotTypes.5 entPhysicalContainedIn.4 == 1 entPhysicalClass.4 == container(5) entPhysicalParentRelPos.4 == 1 entPhysicalName.4 == 'Slot 1' entPhysicalHardwareRev.4 == 'B(1.00.03)' entPhysicalSoftwareRev.4 == '' entPhysicalFirmwareRev.4 == '' entPhysicalSerialNum.4 == '' entPhysicalMfgName.4 == 'Acme' entPhysicalModelName.4 == 'RB' entPhysicalAlias.4 == '' entPhysicalAssetID.4 == '' entPhysicalIsFRU.4 == false(2)",
      "ja": "シャーシ内のスロット3：entPhysicalDescr.4 == 'アクメハブスロットタイプRB' entPhysicalVendorType.4 == acmeProducts.slotTypes.5 entPhysicalContainedIn.4 == 1 entPhysicalClass.4 ==容器（5）entPhysicalParentRelPos.4 == 1つのentPhysicalName 0.4 == 'スロット1' entPhysicalHardwareRev.4 == 'B（1.00.03）' entPhysicalSoftwareRev.4 == '' entPhysicalFirmwareRev.4 == '' entPhysicalSerialNum.4 == '' entPhysicalMfgName.4 == 'アクメ' entPhysicalModelName.4 == 'RB' entPhysicalAlias.4 == '' entPhysicalAssetID.4 == '' entPhysicalIsFRU.4 ==偽（2）"
    },
    {
      "indent": 9,
      "text": "entPhysicalDescr.5 == 'Acme Hub Slot Type RB' entPhysicalVendorType.5 == acmeProducts.slotTypes.5 entPhysicalContainedIn.5 == 1 entPhysicalClass.5 == container(5) entPhysicalParentRelPos.5 == 2 entPhysicalName.5 == 'Slot 2' entPhysicalHardwareRev.5 == 'B(1.00.03)' entPhysicalSoftwareRev.5 == '' entPhysicalFirmwareRev.5 == '' entPhysicalSerialNum.5 == '' entPhysicalMfgName.5 == 'Acme' entPhysicalModelName.5 == 'RB' entPhysicalAlias.5 == '' entPhysicalAssetID.5 == '' entPhysicalIsFRU.5 == false(2)",
      "ja": "entPhysicalDescr.5 == 'アクメハブスロットタイプRB' entPhysicalVendorType.5 == acmeProducts.slotTypes.5 entPhysicalContainedIn.5 == 1 entPhysicalClass.5 ==容器（5）entPhysicalParentRelPos.5 == 2 entPhysicalName.5 ==「スロット2' entPhysicalHardwareRev.5 == 'B（1.00.03）' entPhysicalSoftwareRev.5 == '' entPhysicalFirmwareRev.5 == '' entPhysicalSerialNum.5 == '' entPhysicalMfgName.5 == 'アクメ' entPhysicalModelName.5 == ' RB」entPhysicalAlias.5 == '' entPhysicalAssetID.5 == '' entPhysicalIsFRU.5 ==偽（2）"
    },
    {
      "indent": 9,
      "text": "entPhysicalDescr.6 == 'Acme Hub Slot Type RB' entPhysicalVendorType.6 == acmeProducts.slotTypes.5 entPhysicalContainedIn.6 == 1 entPhysicalClass.6 == container(5) entPhysicalParentRelPos.6 == 3 entPhysicalName.6 == 'Slot 3' entPhysicalHardwareRev.6 == 'B(1.00.03)' entPhysicalSoftwareRev.6 == '' entPhysicalFirmwareRev.6 == '' entPhysicalSerialNum.6 == '' entPhysicalMfgName.6 == 'Acme' entPhysicalModelName.6 == 'RB' entPhysicalAlias.6 == '' entPhysicalAssetID.6 == '' entPhysicalIsFRU.6 == false(2)",
      "ja": "entPhysicalDescr.6 == 'アクメハブスロットタイプRB' entPhysicalVendorType.6 == acmeProducts.slotTypes.5 entPhysicalContainedIn.6 == 1 entPhysicalClass.6 ==容器（5）entPhysicalParentRelPos.6の== 3 entPhysicalName.6 ==「スロット3' entPhysicalHardwareRev.6 == 'B（1.00.03）' entPhysicalSoftwareRev.6 == '' entPhysicalFirmwareRev.6 == '' entPhysicalSerialNum.6 == '' entPhysicalMfgName.6 == 'アクメ' entPhysicalModelName.6 == ' RB」entPhysicalAlias.6 == '' entPhysicalAssetID.6 == '' entPhysicalIsFRU.6 ==偽（2）"
    },
    {
      "indent": 6,
      "text": "Slot 1 contains a plug-in module with 4 10-BaseT ports: entPhysicalDescr.7 == 'Acme 10Base-T Module 114' entPhysicalVendorType.7 == acmeProducts.moduleTypes.32 entPhysicalContainedIn.7 == 4 entPhysicalClass.7 == module(9) entPhysicalParentRelPos.7 == 1 entPhysicalName.7 == 'M1' entPhysicalHardwareRev.7 == 'A(1.02.01)' entPhysicalSoftwareRev.7 == '1.7.2' entPhysicalFirmwareRev.7 == 'A(1.5)' entPhysicalSerialNum.7 == 'C100096244' entPhysicalMfgName.7 == 'Acme' entPhysicalModelName.7 = '114' entPhysicalAlias.7 == 'bldg09:floor1:eng' entPhysicalAssetID.7 == '0007962951' entPhysicalIsFRU.7 == true(1)",
      "ja": "スロット1は、プラグイン4 10-BaseTのポートを備えたモジュールが含ま：entPhysicalDescr.7 == 'アクメ10BASE-Tモジュール114' entPhysicalVendorType.7 == acmeProducts.moduleTypes.32 entPhysicalContainedIn.7の== 4 entPhysicalClass.7 ==モジュール（9）entPhysicalParentRelPos.7 == 1 entPhysicalName.7 == 'M1' entPhysicalHardwareRev.7 == '（1.02.01）' entPhysicalSoftwareRev.7 == '1.7.2' entPhysicalFirmwareRev.7 ==「（1.5） 「entPhysicalSerialNum.7 == 'C100096244' entPhysicalMfgName.7 == 'アクメ' entPhysicalModelName.7 = '114' entPhysicalAlias.7 == 'bldg09：floor1：ENG' entPhysicalAssetID.7 == '0007962951' entPhysicalIsFRU.7 ==真（1）"
    },
    {
      "indent": 9,
      "text": "entPhysicalDescr.8 == 'Acme 10Base-T Port RB' entPhysicalVendorType.8 == acmeProducts.portTypes.10 entPhysicalContainedIn.8 == 7 entPhysicalClass.8 == port(10) entPhysicalParentRelPos.8 == 1 entPhysicalName.8 == 'Ethernet-A' entPhysicalHardwareRev.8 == 'A(1.04F)' entPhysicalSoftwareRev.8 == '' entPhysicalFirmwareRev.8 == '1.4' entPhysicalSerialNum.8 == '' entPhysicalMfgName.8 == 'Acme' entPhysicalModelName.8 == 'RB' entPhysicalAlias.8 == '' entPhysicalAssetID.8 == '' entPhysicalIsFRU.8 == false(2)",
      "ja": "entPhysicalDescr.8 == 'アクメ10BASE-TポートRB' entPhysicalVendorType.8 == acmeProducts.portTypes.10 entPhysicalContainedIn.8の== 7 entPhysicalClass.8 ==ポート（10）entPhysicalParentRelPos.8 == 1 entPhysicalName.8 == 'イーサネット-A」entPhysicalHardwareRev.8 == '（1.04F）' entPhysicalSoftwareRev.8 == '' entPhysicalFirmwareRev.8 == '1.4' entPhysicalSerialNum.8 == '' entPhysicalMfgName.8 == 'アクメ' entPhysicalModelName.8 = = 'RB' entPhysicalAlias.8 == '' entPhysicalAssetID.8 == '' entPhysicalIsFRU.8 == FALSE（2）"
    },
    {
      "indent": 9,
      "text": "entPhysicalDescr.9 == 'Acme 10Base-T Port RB' entPhysicalVendorType.9 == acmeProducts.portTypes.10 entPhysicalContainedIn.9 == 7 entPhysicalClass.9 == port(10) entPhysicalParentRelPos.9 == 2 entPhysicalName.9 == 'Ethernet-B' entPhysicalHardwareRev.9 == 'A(1.04F)' entPhysicalSoftwareRev.9 == '' entPhysicalFirmwareRev.9 == '1.4' entPhysicalSerialNum.9 == '' entPhysicalMfgName.9 == 'Acme' entPhysicalModelName.9 = 'RB' entPhysicalAlias.9 == '' entPhysicalAssetID.9 == '' entPhysicalIsFRU.9 == false(2) entPhysicalDescr.10 == 'Acme 10Base-T Port RB' entPhysicalVendorType.10 == acmeProducts.portTypes.10 entPhysicalContainedIn.10 == 7 entPhysicalClass.10 == port(10) entPhysicalParentRelPos.10 == 3 entPhysicalName.10 == 'Ethernet-C' entPhysicalHardwareRev.10 == 'B(1.02.07)' entPhysicalSoftwareRev.10 == '' entPhysicalFirmwareRev.10 == '1.4' entPhysicalSerialNum.10 == '' entPhysicalMfgName.10 == 'Acme' entPhysicalModelName.10 == 'RB' entPhysicalAlias.10 == '' entPhysicalAssetID.10 == '' entPhysicalIsFRU.10 == false(2)",
      "ja": "entPhysicalDescr.9 == 'アクメ10BASE-TポートRB' entPhysicalVendorType.9 == acmeProducts.portTypes.10 entPhysicalContainedIn.9の== 7 entPhysicalClass.9 ==ポート（10）entPhysicalParentRelPos.9 == 2 entPhysicalName.9 == 'イーサネット-B」entPhysicalHardwareRev.9 == '（1.04F）' entPhysicalSoftwareRev.9 == '' entPhysicalFirmwareRev.9 == '1.4' entPhysicalSerialNum.9 == '' entPhysicalMfgName.9 == 'アクメ' entPhysicalModelName.9 = 'RB' entPhysicalAlias.9 == '' entPhysicalAssetID.9 == '' entPhysicalIsFRU.9 ==偽（2）entPhysicalDescr.10 == 'アクメの10Base-TポートRB' entPhysicalVendorType.10 == acmeProducts.portTypes.10 entPhysicalContainedIn 0.10 == 7 entPhysicalClass.10 ==ポート（10）entPhysicalParentRelPos.10 == 3 entPhysicalName.10 == 'イーサネット-C' entPhysicalHardwareRev.10 == 'B（1.02.07）' entPhysicalSoftwareRev.10 == '' entPhysicalFirmwareRev.10 == '1.4' entPhysicalSerialNum.10 == '' entPhysicalMfgName.10 == 'アクメ' entPhysicalModelName.10 == 'RB' entPhysicalAlias.10 == '' entPhysicalAssetID.10 == '' entPhysica lIsFRU.10 ==偽（2）"
    },
    {
      "indent": 9,
      "text": "entPhysicalDescr.11 == 'Acme 10Base-T Port RB' entPhysicalVendorType.11 == acmeProducts.portTypes.10 entPhysicalContainedIn.11 == 7 entPhysicalClass.11 == port(10) entPhysicalParentRelPos.11 == 4 entPhysicalName.11 == 'Ethernet-D' entPhysicalHardwareRev.11 == 'B(1.02.07)' entPhysicalSoftwareRev.11 == '' entPhysicalFirmwareRev.11 == '1.4' entPhysicalSerialNum.11 == '' entPhysicalMfgName.11 == 'Acme' entPhysicalModelName.11 == 'RB' entPhysicalAlias.11 == '' entPhysicalAssetID.11 == '' entPhysicalIsFRU.11 == false(2)",
      "ja": "entPhysicalDescr.11 == 'アクメ10BASE-TポートRB' entPhysicalVendorType.11 == acmeProducts.portTypes.10 entPhysicalContainedIn.11の== 7 entPhysicalClass.11 ==ポート（10）entPhysicalParentRelPos.11 == 4 entPhysicalName.11 == 'イーサネット-D」entPhysicalHardwareRev.11 == 'B（1.02.07）' entPhysicalSoftwareRev.11 == '' entPhysicalFirmwareRev.11 == '1.4' entPhysicalSerialNum.11 == '' entPhysicalMfgName.11 == 'アクメ' entPhysicalModelName.11 == 'RB' entPhysicalAlias.11 == '' entPhysicalAssetID.11 == '' entPhysicalIsFRU.11 == FALSE（2）"
    },
    {
      "indent": 6,
      "text": "Slot 2 contains another ethernet module with 2 ports. entPhysicalDescr.12 == 'Acme 10Base-T Module Model 4' entPhysicalVendorType.12 == acmeProducts.moduleTypes.30 entPhysicalContainedIn.12 = 5 entPhysicalClass.12 == module(9) entPhysicalParentRelPos.12 == 1 entPhysicalName.12 == 'M2' entPhysicalHardwareRev.12 == 'A(1.01.07)' entPhysicalSoftwareRev.12 == '1.8.4' entPhysicalFirmwareRev.12 == 'A(1.8)' entPhysicalSerialNum.12 == 'C100102384' entPhysicalMfgName.12 == 'Acme' entPhysicalModelName.12 == '4' entPhysicalAlias.12 == 'bldg09:floor1:devtest' entPhysicalAssetID.12 == '0007968462' entPhysicalIsFRU.12 == true(1) entPhysicalDescr.13 == 'Acme 802.3 AUI Port' entPhysicalVendorType.13 == acmeProducts.portTypes.11 entPhysicalContainedIn.13 == 12 entPhysicalClass.13 == port(10) entPhysicalParentRelPos.13 == 1 entPhysicalName.13 == 'AUI' entPhysicalHardwareRev.13 == 'A(1.06F)' entPhysicalSoftwareRev.13 == '' entPhysicalFirmwareRev.13 == '1.5' entPhysicalSerialNum.13 == '' entPhysicalMfgName.13 == 'Acme' entPhysicalModelName.13 == '' entPhysicalAlias.13 == '' entPhysicalAssetID.13 == '' entPhysicalIsFRU.13 == false(2)",
      "ja": "スロット2には、2つのポートを持つ別のイーサネットモジュールが含まれています。 entPhysicalDescr.12 == 'アクメ10BASE-Tモジュールモデル4' entPhysicalVendorType.12 == acmeProducts.moduleTypes.30 entPhysicalContainedIn.12 = 5 entPhysicalClass.12 ==モジュール（9）entPhysicalParentRelPos.12 == 1 entPhysicalName.12 == ' M2' entPhysicalHardwareRev.12 == '（1.01.07）' entPhysicalSoftwareRev.12 == '1.8.4' entPhysicalFirmwareRev.12 == 'A（1.8）' entPhysicalSerialNum.12 == 'C100102384' entPhysicalMfgName.12 == ' ACME」entPhysicalModelName.12 == '4' entPhysicalAlias.12 == 'bldg09：floor1：devtest' entPhysicalAssetID.12 == '0007968462' entPhysicalIsFRU.12 ==真（1）entPhysicalDescr.13 == 'ACME 802.3 AUIポート' entPhysicalVendorType.13 == acmeProducts.portTypes.11 entPhysicalContainedIn.13 == 12 entPhysicalClass.13 ==ポート（10）entPhysicalParentRelPos.13 == 1 entPhysicalName.13 == 'AUI' entPhysicalHardwareRev.13 ==「A（1.06F） 「entPhysicalSoftwareRev.13 == '' entPhysicalFirmwareRev.13 == '1.5' entPhysicalSerialNum.13 == '' entPhysicalMfgName.13 == 'アクメ' entPhysicalModelName.13 == '' entPhysica lAlias.13 == '' entPhysicalAssetID.13 == '' entPhysicalIsFRU.13 ==偽（2）"
    },
    {
      "indent": 9,
      "text": "entPhysicalDescr.14 == 'Acme 10Base-T Port RD' entPhysicalVendorType.14 == acmeProducts.portTypes.14 entPhysicalContainedIn.14 == 12 entPhysicalClass.14 == port(10) entPhysicalParentRelPos.14 == 2 entPhysicalName.14 == 'E2' entPhysicalHardwareRev.14 == 'B(1.01.02)' entPhysicalSoftwareRev.14 == '' entPhysicalFirmwareRev.14 == '2.1' entPhysicalSerialNum.14 == '' entPhysicalMfgName.14 == 'Acme' entPhysicalModelName.14 == '' entPhysicalAlias.14 == '' entPhysicalAssetID.14 == '' entPhysicalIsFRU.14 == false(2)",
      "ja": "entPhysicalDescr.14 == 'アクメ10BASE-TポートRD' entPhysicalVendorType.14 == acmeProducts.portTypes.14 entPhysicalContainedIn.14 == 12 entPhysicalClass.14 ==ポート（10）entPhysicalParentRelPos.14 == 2 entPhysicalName.14 == ' E2' entPhysicalHardwareRev.14 == 'B（1.01.02）' entPhysicalSoftwareRev.14 == '' entPhysicalFirmwareRev.14 == '2.1' entPhysicalSerialNum.14 == '' entPhysicalMfgName.14 == 'アクメ' entPhysicalModelName.14 == '' entPhysicalAlias.14 == '' entPhysicalAssetID.14 == '' entPhysicalIsFRU.14 ==偽（2）"
    },
    {
      "indent": 3,
      "text": "Logical entities -- entLogicalTable; with SNMPv3 support Repeater 1--comprised of any ports attached to backplane 1 entLogicalDescr.1 == 'Acme repeater v3.1' entLogicalType.1 == snmpDot3RptrMgt entLogicalCommunity.1 'public-repeater1' entLogicalTAddress.1 == 192.0.2.1:161 entLogicalTDomain.1 == snmpUDPDomain entLogicalContextEngineID.1 == '80000777017c7d7e7f'H entLogicalContextName.1 == 'repeater1'",
      "ja": "論理エンティティ -  entLogicalTable。 SNMPv3のサポートリピータ1  - バックプレーン1 entLogicalDescr.1に接続されているすべてのポートで構成== 'アクメリピータV3.1' entLogicalType.1 == snmpDot3RptrMgt entLogicalCommunity.1 '公開repeater1' entLogicalTAddress.1 == 192.0.2.1： 161 entLogicalTDomain.1 == snmpUDPDomain entLogicalContextEngineID.1 ==「80000777017c7d7e7f'H entLogicalContextName.1 == 'repeater1'"
    },
    {
      "indent": 6,
      "text": "Repeater 2--comprised of any ports attached to backplane 2: entLogicalDescr.2 == 'Acme repeater v3.1' entLogicalType.2 == snmpDot3RptrMgt entLogicalCommunity.2 == 'public-repeater2' entLogicalTAddress.2 == 192.0.2.1:161 entLogicalTDomain.2 == snmpUDPDomain entLogicalContextEngineID.2 == '80000777017c7d7e7f'H entLogicalContextName.2 == 'repeater2'",
      "ja": "リピータ2  - バックプレーン2に接続されているすべてのポートで構成される：entLogicalDescr.2 == 'アクメリピータV3.1' entLogicalType.2 == snmpDot3RptrMgt entLogicalCommunity.2 == '公開repeater2' entLogicalTAddress.2 == 192.0.2.1： 161 entLogicalTDomain.2 == snmpUDPDomain entLogicalContextEngineID.2 ==「80000777017c7d7e7f'H entLogicalContextName.2 == 'repeater2'"
    },
    {
      "indent": 3,
      "text": "Logical to Physical Mappings -- entLPMappingTable:",
      "ja": "物理的マッピングへの論理 -  entLPマッピングテーブル："
    },
    {
      "indent": 5,
      "text": "repeater1 uses backplane 1, slot 1-ports 1 & 2, slot 2-port 1 [ed. -- Note that a mapping to the module is not included, because this example represents a port-switchable hub. Even though all ports on the module could belong to the same repeater as a matter of configuration, the LP port mappings should not be replaced dynamically with a single mapping for the module (e.g., entLPPhysicalIndex.1.7). If all ports on the module shared a single backplane connection, then a single mapping for the module would be more appropriate.]",
      "ja": "repeater1は、バックプレーン1、スロット1ポート1＆2、スロット2ポート1 [ED使用します。 - この例では、ポート切替可能なハブを表しているので、モジュールへのマッピングが含まれていないことに留意されたいです。モジュール上のすべてのポートは、設定の問題と同じリピーターに属している可能性にもかかわらず、LPポートマッピングはモジュール（例えば、entLPPhysicalIndex.1.7）のための単一のマッピングを動的に置き換えるべきではありません。モジュール上のすべてのポートが単一のバックプレーン接続を共有している場合、モジュールのための単一のマッピングがより適切であろう。]"
    },
    {
      "indent": 8,
      "text": "entLPPhysicalIndex.1.2 == 2 entLPPhysicalIndex.1.8 == 8 entLPPhysicalIndex.1.9 == 9 entLPPhysicalIndex.1.13 == 13",
      "ja": "entLPPhysicalIndex.1.2 == 2 entLPPhysicalIndex.1.8 == 8 entLPPhysicalIndex.1.9の== 9 entLPPhysicalIndex.1.13の== 13"
    },
    {
      "indent": 5,
      "text": "repeater2 uses backplane 2, slot 1-ports 3 & 4, slot 2-port 2 entLPPhysicalIndex.2.3 == 3 entLPPhysicalIndex.2.10 == 10 entLPPhysicalIndex.2.11 == 11 entLPPhysicalIndex.2.14 == 14",
      "ja": "repeater2は、スロット1ポート3＆4、スロット2ポート2 entLPPhysicalIndex.2.3の== 3 entLPPhysicalIndex.2.10 == 10 entLPPhysicalIndex.2.11 == 11 entLPPhysicalIndex.2.14 == 14、バックプレーン2を使用します"
    },
    {
      "indent": 3,
      "text": "Physical to Logical to MIB Alias Mappings -- entAliasMappingTable: Repeater Port Identifier values are shared by both repeaters: entAliasMappingIdentifier.8.0 == rptrPortGroupIndex.1.1 entAliasMappingIdentifier.9.0 == rptrPortGroupIndex.1.2 entAliasMappingIdentifier.10.0 == rptrPortGroupIndex.1.3 entAliasMappingIdentifier.11.0 == rptrPortGroupIndex.1.4 entAliasMappingIdentifier.13.0 == rptrPortGroupIndex.2.1 entAliasMappingIdentifier.14.0 == rptrPortGroupIndex.2.2",
      "ja": "MIBエイリアスマッピングに論理的に物理 -  entAliasMappingTableの：リピータポート識別子の値は、両方のリピータによって共有されている：entAliasMappingIdentifier.8.0 == rptrPortGroupIndex.1.1 entAliasMappingIdentifier.9.0 == rptrPortGroupIndex.1.2 entAliasMappingIdentifier.10.0 == rptrPortGroupIndex.1.3 entAliasMappingIdentifier.11.0 == rptrPortGroupIndex.1.4 entAliasMappingIdentifier.13.0 == rptrPortGroupIndex.2.1 entAliasMappingIdentifier.14.0 == rptrPortGroupIndex.2.2"
    },
    {
      "indent": 3,
      "text": "Physical Containment Tree -- entPhysicalContainsTable chassis has two backplanes and three containers: entPhysicalChildIndex.1.2 == 2 entPhysicalChildIndex.1.3 == 3 entPhysicalChildIndex.1.4 == 4 entPhysicalChildIndex.1.5 == 5 entPhysicalChildIndex.1.6 == 6",
      "ja": "entPhysicalChildIndex.1.2 == 2 entPhysicalChildIndex.1.3の== 3 entPhysicalChildIndex.1.4の== 4 entPhysicalChildIndex.1.5 == 5 entPhysicalChildIndex.1.6 == 6： - 物理的な包含ツリーentPhysicalContainsTableはシャーシは、二つのバックプレーンと3つの容器を有します"
    },
    {
      "indent": 5,
      "text": "container 1 has a module: entPhysicalChildIndex.4.7 == 7",
      "ja": "== 7 entPhysicalChildIndex.4.7：容器1はモジュールを有します"
    },
    {
      "indent": 5,
      "text": "container 2 has a module entPhysicalChildIndex.5.12 == 12",
      "ja": "容器2は、モジュールentPhysicalChildIndex.5.12 == 12を有しています"
    },
    {
      "indent": 5,
      "text": "[ed. -- in this example, container 3 is empty.]",
      "ja": "[編。 - この例では、容器3は空です]。"
    },
    {
      "indent": 5,
      "text": "module 1 has 4 ports: entPhysicalChildIndex.7.8 == 8 entPhysicalChildIndex.7.9 == 9 entPhysicalChildIndex.7.10 == 10 entPhysicalChildIndex.7.11 == 11",
      "ja": "entPhysicalChildIndex.7.8 == 8 entPhysicalChildIndex.7.9の== 9 entPhysicalChildIndex.7.10 == 10 entPhysicalChildIndex.7.11 == 11：モジュール1は、4つのポートを有しています"
    },
    {
      "indent": 5,
      "text": "module 2 has 2 ports: entPhysicalChildIndex.12.13 == 13 entPhysicalChildIndex.12.14 == 14",
      "ja": "entPhysicalChildIndex.12.13 == 13 entPhysicalChildIndex.12.14 == 14：モジュール2は、2つのポートを有しています"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "There are a number of management objects defined in this MIB that have a MAX-ACCESS clause of read-write and/or read-create. Such objects may be considered sensitive or vulnerable in some network environments. The support for SET operations in a non-secure environment without proper protection can have a negative effect on network operations.",
      "ja": "読み書きおよび/またはリード作成のMAX-ACCESS節を持っているこのMIBで定義された管理オブジェクトの数があります。そのようなオブジェクトは、いくつかのネットワーク環境に敏感又は脆弱と考えることができます。適切な保護のない非安全な環境におけるSET操作のサポートはネットワーク操作のときにマイナスの影響を与える可能性があります。"
    },
    {
      "indent": 3,
      "text": "There are a number of managed objects in this MIB that may contain sensitive information. These are:",
      "ja": "機密情報を含むことができ、このMIBの管理対象オブジェクトの数があります。これらは："
    },
    {
      "indent": 3,
      "text": "entPhysicalDescr entPhysicalVendorType entPhysicalHardwareRev entPhysicalFirmwareRev entPhysicalSoftwareRev entPhysicalSerialNum entPhysicalMfgName entPhysicalModelName",
      "ja": "するentPhysicalDescrのentPhysicalVendorTypeするentPhysicalHardwareRev entPhysicalFirmwareRev entPhysicalSoftwareRevのentPhysicalSerialNum entPhysicalMfgName entPhysicalModelName"
    },
    {
      "indent": 6,
      "text": "These objects expose information about the physical entities within a managed system, which may be used to identify the vendor, model, and version information of each system component.",
      "ja": "これらのオブジェクトは、各システムコンポーネントのベンダー、モデル、およびバージョン情報を識別するために使用することができる管理システム内の物理エンティティに関する情報を公開します。"
    },
    {
      "indent": 3,
      "text": "entPhysicalAssetID",
      "ja": "entPhysicalAssetID"
    },
    {
      "indent": 6,
      "text": "This object can allow asset identifiers for various system components to be exposed, in the event this MIB object is actually configured by an NMS application.",
      "ja": "このオブジェクトは、イベントでは、このMIBオブジェクトが、実際にNMSアプリケーションによって構成され、様々なシステム構成要素の資産識別子が露出されることを可能にすることができます。"
    },
    {
      "indent": 3,
      "text": "entLogicalDescr entLogicalType",
      "ja": "entLogicalDescr entLogicalType"
    },
    {
      "indent": 6,
      "text": "These objects expose the type of logical entities present in the managed system.",
      "ja": "これらのオブジェクトは、管理対象システム内に存在する論理的なエンティティのタイプを公開します。"
    },
    {
      "indent": 3,
      "text": "entLogicalCommunity",
      "ja": "entLogicalCommunity"
    },
    {
      "indent": 6,
      "text": "This object exposes community names associated with particular logical entities within the system.",
      "ja": "このオブジェクトは、システム内の特定の論理エンティティに関連付けられたコミュニティ名を公開します。"
    },
    {
      "indent": 3,
      "text": "entLogicalTAddress entLogicalTDomain",
      "ja": "entLogicalTAddress entLogicalTDomain"
    },
    {
      "indent": 6,
      "text": "These objects expose network addresses that can be used to communicate with an SNMP agent on behalf of particular logical entities within the system.",
      "ja": "これらのオブジェクトは、システム内の特定の論理エンティティに代わってSNMPエージェントと通信するために使用できるネットワークアドレスを公開します。"
    },
    {
      "indent": 3,
      "text": "entLogicalContextEngineID entLogicalContextName",
      "ja": "entLogicalContextEngineID entLogicalContextName"
    },
    {
      "indent": 6,
      "text": "These objects identify the authoritative SNMP engine that contains information on behalf of particular logical entities within the system.",
      "ja": "これらのオブジェクトは、システム内の特定の論理エンティティに代わって情報が含まれている正式のSNMPエンジンを特定します。"
    },
    {
      "indent": 3,
      "text": "It is thus important to control even GET access to these objects and possibly to even encrypt the values of these object when sending them over the network via SNMP. Not all versions of SNMP provide features for such a secure environment.",
      "ja": "それも、これらのオブジェクトへのアクセスを取得し、おそらくSNMPを通してネットワークの上にそれらを送信するときにも、これらのオブジェクトの値を暗号化するために制御することが重要です。 SNMPのすべてのバージョンは、このような安全な環境のための機能を提供していません。"
    },
    {
      "indent": 3,
      "text": "SNMPv1 by itself is not a secure environment. Even if the network itself is secure (for example by using IPSec), even then, there is no control as to who on the secure network is allowed to access and GET/SET (read/change/create/delete) the objects in this MIB.",
      "ja": "それ自体でSNMPv1が安全な環境ではありません。ネットワーク自体が（IPSecを使用することにより、例えば）安全であっても、その後も、安全なネットワーク上で/ SETにアクセスし、GETだれに許容されているかのように何の制御（読み取り/変更/作成/削除）この内のオブジェクトが存在しませんMIB。"
    },
    {
      "indent": 3,
      "text": "It is recommended that the implementers consider the security features as provided by the SNMPv3 framework. Specifically, the use of the User-based Security Model RFC 3414 [RFC3414] and the View-based Access Control Model RFC 3415 [RFC3415] is recommended.",
      "ja": "SNMPv3フレームワークで提供するように実装は、セキュリティ機能を検討することをお勧めします。具体的には、ユーザベースセキュリティモデルのRFC 3414 [RFC3414]とビューベースアクセス制御モデルRFC 3415 [RFC3415]の使用が推奨されます。"
    },
    {
      "indent": 3,
      "text": "It is then a customer/user responsibility to ensure that the SNMP entity giving access to an instance of this MIB, is properly configured to give access to the objects only to those principals (users) that have legitimate rights to indeed GET or SET (change/create/delete) them.",
      "ja": "このMIBのインスタンスへのアクセスを与えるSNMP実体が、適切にのみプリンシパル（ユーザ）にオブジェクトへのアクセスを提供するように設定されていることを確認するために、顧客/ユーザーの責任実際にGETまたはSET（変化への正当な権利を有することです/）/削除、それらを作成します。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "The MIB module in this document uses the following IANA-assigned OBJECT IDENTIFIER values recorded in the SMI Numbers registry:",
      "ja": "この文書に記載されているMIBモジュールはSMI番号のレジストリに記録されている以下のIANAによって割り当てられたオブジェクト識別子の値を使用します。"
    },
    {
      "indent": 14,
      "text": "Descriptor        OBJECT IDENTIFIER value\n----------        -----------------------\nentityMIB         { mib-2 47 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "7. Acknowledgements",
      "section_title": true,
      "ja": "7.謝辞"
    },
    {
      "indent": 3,
      "text": "This memo has been produced by the IETF's Entity MIB working group.",
      "ja": "このメモはIETFのエンティティMIBワーキンググループによって作成されました。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8.参照文献"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "ja": "8.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2578] McCloghrie, K., Perkins, D., and J. Schoenwaelder, \"Structure of Management Information Version 2 (SMIv2)\", STD 58, RFC 2578, April 1999.",
      "ja": "[RFC2578] McCloghrie、K.、パーキンス、D.、およびJ. Schoenwaelder、STD 58 \"経営情報バージョン2（SMIv2）の構造\"、RFC 2578、1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2579] McCloghrie, K., Perkins, D., and J. Schoenwaelder, \"Textual Conventions for SMIv2\", STD 58, RFC 2579, April 1999.",
      "ja": "[RFC2579] McCloghrie、K.、パーキンス、D.、およびJ. Schoenwaelder、 \"SMIv2のためのテキストの表記法\"、STD 58、RFC 2579、1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2580] McCloghrie, K., Perkins, D., and J. Schoenwaelder, \"Conformance Statements for SMIv2\", STD 58, RFC 2580, April 1999.",
      "ja": "[RFC2580] McCloghrie、K.、パーキンス、D.、およびJ. Schoenwaelder、 \"SMIv2のための適合性宣言\"、STD 58、RFC 2580、1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC3411] Harrington, D., Presuhn, R., and B. Wijnen, \"An Architecture for Describing Simple Network Management Protocol (SNMP) Management Frameworks\", STD 62, RFC 3411, December 2002.",
      "ja": "[RFC3411]ハリントン、D.、Presuhn、R.、およびB. Wijnenの、STD 62、RFC 3411、2002年12月 \"簡易ネットワーク管理プロトコル（SNMP）管理フレームワークを記述するためのアーキテクチャ\"。"
    },
    {
      "indent": 3,
      "text": "[RFC3417] Presuhn, R., \"Transport Mappings for the Simple Network Management Protocol (SNMP)\", STD 62, RFC 3417, December 2002.",
      "ja": "[RFC3417] Presuhn、R.、 \"簡易ネットワーク管理プロトコルのためのマッピングを輸送します（SNMP）\"、STD 62、RFC 3417、2002年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC3986] Berners-Lee, T., Fielding, R., and L. Masinter, \"Uniform Resource Identifier (URI): Generic Syntax\", STD 66, RFC 3986, January 2005.",
      "ja": "[RFC3986]バーナーズ - リー、T.、フィールディング、R.、およびL. Masinter、 \"ユニフォームリソース識別子（URI）：汎用構文\"、STD 66、RFC 3986、2005年1月。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "ja": "8.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC1157] Case, J., Fedor, M., Schoffstall, M., and J. Davin, \"Simple Network Management Protocol\", STD 15, RFC 1157, May 1990.",
      "ja": "[RFC1157]ケース、J.、ヒョードル、M.、Schoffstall、M.、およびJ.デーヴィン、 \"簡単なネットワーク管理プロトコル\"、STD 15、RFC 1157、1990年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC1493] Decker, E., Langille, P., Rijsinghani, A., and K. McCloghrie, \"Definitions of Managed Objects for Bridges\", RFC 1493, July 1993.",
      "ja": "[RFC1493]デッカー、E.、Langille、P.、Rijsinghani、A.、およびK. McCloghrie、 \"ブリッジのための管理オブジェクトの定義\"、RFC 1493、1993年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC1516] McMaster, D. and K. McCloghrie, \"Definitions of Managed Objects for IEEE 802.3 Repeater Devices\", RFC 1516, September 1993.",
      "ja": "[RFC1516]マクマスター、D.及びK. McCloghrie、RFC 1516、1993年9月 \"IEEE 802.3リピータデバイスのための管理オブジェクトの定義\"。"
    },
    {
      "indent": 3,
      "text": "[RFC2037] McCloghrie, K. and A. Bierman, \"Entity MIB using SMIv2\", RFC 2037, October 1996.",
      "ja": "[RFC2037] McCloghrie、K.とA. Bierman、 \"SMIv2のを使用してエンティティMIB\"、RFC 2037、1996年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC2108] de Graaf, K., Romascanu, D., McMaster, D., and K. McCloghrie, \"Definitions of Managed Objects for IEEE 802.3 Repeater Devices using SMIv2\", RFC 2108, February 1997.",
      "ja": "[RFC2108]グラーフ、K.、Romascanu、D.、マクマスター、D.、およびK. McCloghrieド、RFC 2108、1997年2月 \"SMIv2のを使用してIEEE 802.3リピータデバイスのための管理オブジェクトの定義\"。"
    },
    {
      "indent": 3,
      "text": "[RFC2737] McCloghrie, K. and A. Bierman, \"Entity MIB (Version 2)\", RFC 2737, December 1999.",
      "ja": "[RFC2737] McCloghrie、K.およびA. Bierman、 \"エンティティMIB（第2版）\"、RFC 2737、1999年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC2863] McCloghrie, K. and F. Kastenholz, \"The Interfaces Group MIB\", RFC 2863, June 2000.",
      "ja": "[RFC2863] McCloghrie、K.およびF. Kastenholzと、 \"インターフェイスグループMIB\"、RFC 2863、2000年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC3406] Daigle, L., van Gulik, D., Iannella, R., and P. Faltstrom, \"Uniform Resource Names (URN) Namespace Definition Mechanisms\", BCP 66, RFC 3406, October 2002.",
      "ja": "[RFC3406] Daigle氏、L.、バンGulik、D.、Iannella、R.、およびP. Faltstrom、 \"統一リソース名（URN）名前空間定義メカニズム\"、BCP 66、RFC 3406、2002年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC3410] Case, J., Mundy, R., Partain, D., and B. Stewart, \"Introduction and Applicability Statements for Internet-Standard Management Framework\", RFC 3410, December 2002.",
      "ja": "[RFC3410]ケース、J.、マンディ、R.、パーテイン、D.、およびB.スチュワート、 \"インターネット標準の管理フレームワークのための序論と適用性声明\"、RFC 3410、2002年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC3414] Blumenthal, U. and B. Wijnen, \"User-based Security Model (USM) for version 3 of the Simple Network Management Protocol (SNMPv3)\", STD 62, RFC 3414, December 2002.",
      "ja": "、STD 62、RFC 3414、2002年12月 \"簡易ネットワーク管理プロトコル（SNMPv3の）のバージョン3のためのユーザベースセキュリティモデル（USM）\" [RFC3414]ブルーメンソール、U.とB. Wijnenの、。"
    },
    {
      "indent": 3,
      "text": "[RFC3415] Wijnen, B., Presuhn, R., and K. McCloghrie, \"View-based Access Control Model (VACM) for the Simple Network Management Protocol (SNMP)\", STD 62, RFC 3415, December 2002.",
      "ja": "[RFC3415] Wijnenの、B.、Presuhn、R.、およびK. McCloghrie、 \"簡易ネットワーク管理プロトコルのためのビューベースアクセス制御モデル（VACM）（SNMP）\"、STD 62、RFC 3415、2002年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC4152] Tesink, K. and R. Fox, \"A Uniform Resource Name (URN) Namespace for the CLEI Code\", RFC 4152, August 2005.",
      "ja": "[RFC4152] Tesink、K.とR.フォックス、 \"CLEIコード用ユニフォームリソース名（URN）名前空間\"、RFC 4152、2005年8月。"
    },
    {
      "indent": 3,
      "text": "[T1.213] ATIS T1.213-2001, \"Coded Identification of Equipment Entities in the North American Telecommunications System for Information Exchange\", 2001, www.ansi.org.",
      "ja": "[T1.213] ATIS T1.213-2001、「情報交換のための北アメリカの通信システムにおける機器エンティティの符号化識別」、2001年、www.ansi.org。"
    },
    {
      "indent": 3,
      "text": "[T1.213a] ATIS T1.213a, \"Supplement to T1.213-2001, Coded Identification of Equipment Entities in the North American Telecommunications System for Information Exchange, to correct the representation of the Basic Code in Figure B.1\", 2001, www.ansi.org.",
      "ja": "[T1.213a] ATIS T1.213a、「図B.1中の基本コードの表現を修正するT1.213-2001の補足、情報交換のための北アメリカの通信システムにおける機器エンティティの符号化識別、」2001年、www.ansi.org。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Andy Bierman",
      "ja": "アンディBierman"
    },
    {
      "indent": 3,
      "text": "EMail: ietf@andybierman.com",
      "ja": "メールアドレス：ietf@andybierman.com"
    },
    {
      "indent": 3,
      "text": "Keith McCloghrie Cisco Systems, Inc. 170 West Tasman Drive San Jose, CA 95134 USA",
      "ja": "キースMcCloghrieシスコシステムズ、株式会社170西タスマン・ドライブサンノゼ、CA 95134 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 408-526-5260 EMail: kzm@cisco.com",
      "ja": "電話：+1 408-526-5260電子メール：kzm@cisco.com"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "ja": "著作権（C）インターネット協会（2005）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "この文書では、BCP 78に含まれる権利と許可と制限の適用を受けており、その中の記載を除いて、作者は彼らのすべての権利を保有します。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とCONTRIBUTOR「そのまま」、ORGANIZATION HE / SHEが表すまたはインターネットソサエティおよびインターネット・エンジニアリング・タスク・フォース放棄すべての保証、明示または、（もしあれば）後援ISに設けられています。黙示、情報の利用は、特定の目的に対する権利または商品性または適合性の黙示の保証を侵害しない任意の保証含むがこれらに限定されません。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、本書またはそのような権限下で、ライセンスがたりないかもしれない程度に記載された技術の実装や使用に関係すると主張される可能性があります任意の知的財産権やその他の権利の有効性または範囲に関していかなる位置を取りません利用可能です。またそれは、それがどのような権利を確認する独自の取り組みを行ったことを示すものでもありません。 RFC文書の権利に関する手続きの情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IPRの開示のコピーが利用できるようにIETF事務局とライセンスの保証に行われた、または本仕様の実装者または利用者がそのような所有権の使用のための一般的なライセンスまたは許可を取得するために作られた試みの結果を得ることができますhttp://www.ietf.org/iprのIETFのオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、その注意にこの標準を実装するために必要とされる技術をカバーすることができる任意の著作権、特許または特許出願、またはその他の所有権を持ってすべての利害関係者を招待します。 ietf-ipr@ietf.orgのIETFに情報を記述してください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}