{
  "title": {
    "text": "RFC 4089 - IAB and IESG Recommendation for IETF Administrative Restructuring",
    "ja": "RFC 4089 - IETF管理再構築に関するIABおよびIESGの推奨"
  },
  "number": 4089,
  "created_at": "2023-08-11 05:17:32.219706+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                 S. Hollenbeck, Ed.\nRequest for Comments: 4089                                  IAB and IESG\nCategory: Informational                                         May 2005",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "IAB and IESG Recommendation for IETF Administrative Restructuring",
      "ja": "IETF管理再構築に関するIABおよびIESGの推奨"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモは、インターネットコミュニティに情報を提供します。いかなる種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "ja": "Copyright（c）The Internet Society（2005）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document describes a joint recommendation of the Internet Architecture Board and the Internet Engineering Steering Group for administrative restructuring of the Internet Engineering Task Force. The IETF Chair declared that the IETF had consensus to follow this recommendation on November 11, 2004. Further work has been done to revise and refine the structures proposed. The recommendation is being published for the record.",
      "ja": "このドキュメントでは、インターネットエンジニアリングタスクフォースの管理再構築に関するインターネットアーキテクチャボードとインターネットエンジニアリングステアリンググループの共同推奨について説明します。IETF議長は、IETFが2004年11月11日にこの勧告に従うためのコンセンサスがあることを宣言しました。推奨事項はレコード用に公開されています。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  2\n2.  The Process That Produced This Recommendation  . . . . . . . .  2\n3.  Recommendation . . . . . . . . . . . . . . . . . . . . . . . .  3\n4.  Arguments That Had Particular Weight in the Discussions  . . .  4\n    4.1.  Focusing on Scenarios C and O  . . . . . . . . . . . . .  4\n    4.2.  Why We Chose Scenario O  . . . . . . . . . . . . . . . .  5\n5.  IANA Considerations  . . . . . . . . . . . . . . . . . . . . .  6\n6.  Security Considerations  . . . . . . . . . . . . . . . . . . .  6\n7.  Acknowledgements . . . . . . . . . . . . . . . . . . . . . . .  6\nAppendix: Scenario C . . . . . . . . . . . . . . . . . . . . . . .  7\nAppendix: Scenario O . . . . . . . . . . . . . . . . . . . . . . . 37\nInformative References . . . . . . . . . . . . . . . . . . . . . . 54",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The Internet Engineering Task Force (IETF) has a need for administrative support functions. The debate and dialogue of 2003 and 2004 has led to the belief that the way these functions are provided needs to be changed.",
      "ja": "インターネットエンジニアリングタスクフォース（IETF）には、管理サポート機能が必要です。2003年と2004年の議論と対話は、これらの機能が提供される方法を変更する必要があるという信念につながりました。"
    },
    {
      "indent": 3,
      "text": "This document gives the recommendation of the Internet Engineering Steering Group (IESG) and Internet Architecture Board (IAB) on what the next step in that change process should be, and some of the background and reasoning behind this recommendation.",
      "ja": "このドキュメントは、その変更プロセスの次のステップと、この推奨の背後にある背景と推論のいくつかについて、インターネットエンジニアリングステアリンググループ（IESG）とインターネットアーキテクチャボード（IAB）の推奨事項を提供します。"
    },
    {
      "indent": 0,
      "text": "2. The Process That Produced This Recommendation",
      "section_title": true,
      "ja": "2. この推奨事項を作成したプロセス"
    },
    {
      "indent": 3,
      "text": "During several months in 2004, the Internet Architecture Board (IAB) and the Internet Engineering Steering Group (IESG) worked together to consider several different options for restructuring the Internet Engineering Task Force (IETF) administrative functions. The goal of this effort was to produce a recommendation for consideration by and approval of the IETF community. The rationale for this effort is described in RFC 3716 [1]. Much background work and several detailed proposals for community consideration are provided in a report prepared by a consultant titled \"IETF Administrative Support Functions\" [2].",
      "ja": "2004年の数ヶ月間、インターネットアーキテクチャボード（IAB）とインターネットエンジニアリングステアリンググループ（IESG）は、インターネットエンジニアリングタスクフォース（IETF）の管理機能を再構築するためのいくつかの異なるオプションを検討するために協力しました。この取り組みの目標は、IETFコミュニティの検討と承認の推奨事項を作成することでした。この取り組みの理論的根拠は、RFC 3716 [1]に記載されています。「IETF管理サポート機能」というタイトルのコンサルタントが作成したレポートでは、多くのバックグラウンドワークとコミュニティ検討のためのいくつかの詳細な提案が提供されています[2]。"
    },
    {
      "indent": 3,
      "text": "The consultant's report included several possible scenarios for administrative restructuring (named scenario A, B, C, and D). As discussion took place within the IETF community, it became clear that some of the scenarios had features that appeared more promising than others, but that we did not have enough of a concrete proposal to crystallize opinions into a consensus for action. Members of the IESG and IAB took on the task of working out more complete descriptions of two of the scenarios. They were:",
      "ja": "コンサルタントのレポートには、管理再構築のためのいくつかの可能なシナリオが含まれていました（名前付きシナリオA、B、C、およびD）。IETFコミュニティ内で議論が行われたため、一部のシナリオには他のシナリオよりも有望であると思われる機能があることが明らかになりましたが、意見を行動のコンセンサスに結晶化するのに十分な具体的な提案がなかったことが明らかになりました。IESGとIABのメンバーは、2つのシナリオのより完全な説明を解決するというタスクを引き受けました。彼らはいた："
    },
    {
      "indent": 3,
      "text": "o Scenario C (section 4.4 of the report) describes when \"administrative support functions for the IETF are legally housed in a focused, incorporated institution\" with close ties to the Internet Society (ISOC). Scenario C is included here as the first appendix.",
      "ja": "o シナリオC（レポートのセクション4.4）は、「IETFの管理サポート機能が、インターネット社会（ISOC）と密接な関係を持つ「IETFの管理サポート機能が焦点を絞った組み込まれた機関に法的に収容されている」と説明しています。ここには、最初の付録としてシナリオCが含まれています。"
    },
    {
      "indent": 3,
      "text": "o A new scenario, called Scenario O, that includes features derived from scenarios A and B (sections 4.2 and 4.3 of the report), focusing on the formalization of the ISOC/IETF relationship while housing administrative support functions for the IETF within ISOC. Scenario O is included here as the second appendix.",
      "ja": "o シナリオoと呼ばれる新しいシナリオは、シナリオAとB（レポートのセクション4.2および4.3）から派生した機能を含み、ISOC内のIETFの管理サポート機能を収容するISOC/IETF関係の形式化に焦点を当てています。ここには、2番目の付録としてシナリオoが含まれています。"
    },
    {
      "indent": 3,
      "text": "These descriptions were not intended to close off discussion of other scenarios, but to focus discussion on what appeared to be two independent loci of support.",
      "ja": "これらの説明は、他のシナリオの議論を締めくくることではなく、2つの独立したサポートの遺伝子座と思われるものについて議論を集中することを目的としていました。"
    },
    {
      "indent": 3,
      "text": "Both scenarios were presented to the IETF community as mail notes (Scenario C [3], Scenario O [4]) sent to the IETF discussion list. IETF participants' opinions, while quite divided on the subject, seemed to indicate a preference for Scenario O as a \"lower risk operation\", but some participants indicated that they felt unable to give an informed opinion, disagreed with the process, or declared the subject out of their field of competence. This discussion garnered perhaps 40 participants who contributed on the list.",
      "ja": "両方のシナリオは、IETFコミュニティにIETFコミュニティに提示されました（シナリオC [3]、シナリオO [4]）IETFディスカッションリストに送信されました。IETF参加者の意見は、このテーマに非常に分かれていますが、シナリオoの好みを「リスクの低い操作」として示しているように見えましたが、一部の参加者は、情報に基づいた意見を述べることができないと感じたり、プロセスに反対したり、宣言したことを示しました。能力の分野の対象。この議論は、おそらくリストに貢献した40人の参加者を獲得しました。"
    },
    {
      "indent": 3,
      "text": "The IETF Chair then requested an informal poll of IETF opinion. People interested in participating in the poll were directed to a web site where their opinions could be noted, including whether they wanted to state an opinion or not. The raw poll results [5] were also shared with the community via a mail note to the IETF discussion list.",
      "ja": "IETF議長は、IETF意見の非公式の世論調査を要求しました。世論調査に参加することに興味がある人は、意見を述べたいかどうかなど、意見を述べることができるWebサイトに送られました。生の世論調査結果[5]は、IETFディスカッションリストへのメールメモを介してコミュニティと共有されました。"
    },
    {
      "indent": 3,
      "text": "The poll sparked additional discussion on the list, and not all participants agreed with the methodology of the poll. Taken with the discussion, though, the IESG and IAB members believe that there is a stronger indication of community support for change based on Scenario O than on other scenarios. The IESG and IAB members believe that Scenario O can be a workable basis for further progress, even if it is not the first preference for all members. Taken together, this has led to the IESG/IAB recommendation given below.",
      "ja": "世論調査はリストに関する追加の議論を引き起こし、すべての参加者が世論調査の方法論に同意したわけではありません。ただし、IESGとIABのメンバーは、他のシナリオよりもシナリオoに基づいて、変化に対するコミュニティのサポートのより強い兆候があると考えています。IESGとIABメンバーは、たとえそれがすべてのメンバーにとって最初の好みではない場合でも、シナリオOはさらなる進歩の実行可能な基盤になる可能性があると考えています。まとめると、これにより、以下に示すIESG/IABの推奨が発生しました。"
    },
    {
      "indent": 0,
      "text": "3. Recommendation",
      "section_title": true,
      "ja": "3. おすすめ"
    },
    {
      "indent": 3,
      "text": "The collective recommendation of the IAB and IESG was presented to the IETF community of Friday 8 October 2004 via a mail note [6] sent to the IETF mailing list:",
      "ja": "IABとIESGの集合的な勧告は、2004年10月8日金曜日のIETFコミュニティに、IETFメーリングリストに送信されたメールメモ[6]を介して提示されました。"
    },
    {
      "indent": 6,
      "text": "\"IETF folks,",
      "ja": "「IETFの人々、"
    },
    {
      "indent": 6,
      "text": "The IESG and IAB have been considering the input from the IETF community on the next steps going forward in IETF administrative restructuring.",
      "ja": "IESGとIABは、IETF管理再編で今後の次のステップについて、IETFコミュニティからの入力を検討しています。"
    },
    {
      "indent": 6,
      "text": "It appears clear to us that the community mostly sees scenario O as the lower-risk scenario, and the one that gives us the greatest probability of successfully doing what we have to do.",
      "ja": "コミュニティは、主にシナリオを低リスクのシナリオと見なしていること、そして私たちがしなければならないことを成功させる可能性が最も高いシナリオと見なされていることは明らかです。"
    },
    {
      "indent": 6,
      "text": "Based on this, the IESG and the IAB make the following recommendation:",
      "ja": "これに基づいて、IESGとIABは次の推奨事項を作成します。"
    },
    {
      "indent": 13,
      "text": "We recommend that the IETF pursue scenario O, with the understanding that further work is needed to define the roles and responsibilities of the IETF, the IAOC and the ISOC BoT under this scenario.",
      "ja": "IETFは、このシナリオの下でIETF、IAOC、およびISOCボットの役割と責任を定義するためにさらなる作業が必要であるという理解で、シナリオoを追求することをお勧めします。"
    },
    {
      "indent": 6,
      "text": "The \"BCP section\" of the scenario O note will be pulled out and published as an internet-draft. We'd like to put this description to the IETF community for a formal Last Call before the November IETF meeting, if possible.",
      "ja": "シナリオoノートの「BCPセクション」が引き出され、インターネットドラフトとして公開されます。可能であれば、IETF会議の前に正式な最後の呼び出しのために、この説明をIETFコミュニティに提出したいと思います。"
    },
    {
      "indent": 6,
      "text": "Also, as noted in the recommendation above, there are a number of points where we need to work out in more detail how the system is going to work - who takes decisions, who accepts those decisions, and what conflict resolution mechanisms may be necessary, and so on. The IAB and IESG are drafting a document that will describe the finer level of detail as to the respective roles and responsibilities of each of the players. We will publish this as an internet-draft shortly.",
      "ja": "また、上記の勧告に記載されているように、システムがどのように機能するか、誰が決定を下し、それらの決定を受け入れるか、どの紛争解決メカニズムが必要なのか、より詳細に解決する必要がある多くのポイントがあります。等々。IABとIESGは、各プレイヤーのそれぞれの役割と責任に関する詳細レベルの詳細を説明するドキュメントを起草しています。これをまもなくインターネットドラフトとして公開します。"
    },
    {
      "indent": 6,
      "text": "We will continue to work intensely on this!\"",
      "ja": "私たちはこれに激しく働き続けます！」"
    },
    {
      "indent": 0,
      "text": "4. Arguments That Had Particular Weight in the Discussions",
      "section_title": true,
      "ja": "4. 議論で特に重みを持っていた議論"
    },
    {
      "indent": 0,
      "text": "4.1. Focusing on Scenarios C and O",
      "section_title": true,
      "ja": "4.1. シナリオCおよびOに焦点を当てています"
    },
    {
      "indent": 3,
      "text": "The IETF list was presented with four scenarios in the consultant report [2], which should be read for the full context. In slogan form, they might be rendered as",
      "ja": "IETFリストには、コンサルタントレポート[2]に4つのシナリオが表示されました。これは、完全なコンテキストについて読み取る必要があります。スローガン形式では、それらはとしてレンダリングされる可能性があります"
    },
    {
      "indent": 3,
      "text": "o A: Leave it to ISOC.",
      "ja": "o A：ISOCに任せます。"
    },
    {
      "indent": 3,
      "text": "o B: Increase IETF control of ISOC, and use ISOC to do it.",
      "ja": "o B：ISOCのIETF制御を増やし、ISOCを使用してそれを行います。"
    },
    {
      "indent": 3,
      "text": "o C: Isolate the functions, let ISOC gather money, share control.",
      "ja": "o C：関数を分離し、ISOCにお金を集め、コントロールを共有します。"
    },
    {
      "indent": 3,
      "text": "o D: Cut the IETF off from ISOC and do it ourselves.",
      "ja": "o D：IETFをISOCから切り取り、自分でやります。"
    },
    {
      "indent": 3,
      "text": "On the list, there seemed to be very few who were comfortable with the idea that \"we\" (for some version of \"we\") could \"do it ourselves\" as envisioned in Scenario D. There was also considerable worry about the risk associated with Scenario C, especially with regard to financial stability, and that the perceived danger of problems would cause sponsors to withhold funding, thus precipitating problems even if there was no other reason for them. Scenario C spoke strongly to those who worried about a possible conflict of interest between ISOC and the IETF community at some future date - \"we don't know what ISOC will turn into\" was the capsule summary.",
      "ja": "リストには、シナリオDで想定されているように、「私たち」（「私たち」のいくつかのバージョン）が「自分でやる」ことができるという考えに満足している人はほとんどいなかったようです。シナリオCは、特に財政的安定性に関して、そして問題の危険性が認識されているため、スポンサーが資金を源泉徴収し、他の理由がなくても問題を引き起こします。シナリオCは、ISOCとIETFコミュニティとの間の利益相反の可能性を将来の日付で心配している人々に強く語っています。"
    },
    {
      "indent": 3,
      "text": "Scenario A worried people because it did not seem to acknowledge the IETF community's ability to determine if its needs were being met and what could be done if they were not. The phrase \"replace existing problematic structures by ISOC\" was perhaps a capsule summary. However, Scenario B's list of possible mechanisms for involving IETF community directly in ISOC's operations was not viewed as acceptable or in balance with the full scope of ISOC's activities. Members of the IAB & IESG developed Scenario O, a solution scenario that put the administrative activity within ISOC, but aimed to provide a means for the IETF to provide oversight and control of that specific activity within ISOC. Its name is derived from the classification of blood types -- \"neither A nor B\".",
      "ja": "シナリオは、IETFコミュニティのニーズが満たされているかどうか、そうでない場合に何ができるかを判断する能力を認めていないように見えるため、心配している人です。「既存の問題のある構造をISOCに置き換える」というフレーズは、おそらくカプセルの要約でした。ただし、ISOCの運用に直接IETFコミュニティを直接関与させるための可能なメカニズムのシナリオBのリストは、ISOCの活動の完全な範囲と容認できる、またはバランスをとっているとは見なされませんでした。IAB＆IESGのメンバーは、管理活動をISOC内に配置するソリューションシナリオであるシナリオOを開発しましたが、IETFがISOC内でその特定のアクティビティの監視と制御を提供する手段を提供することを目的としています。その名前は、血液型の分類から派生しています - 「AまたはBのどちらも」。"
    },
    {
      "indent": 3,
      "text": "Thus, the decision to focus on C and O as \"alternatives to be worked out in detail\" was made.",
      "ja": "したがって、CとOに焦点を合わせるという決定は、「詳細に解決される代替案」として行われました。"
    },
    {
      "indent": 0,
      "text": "4.2. Why We Chose Scenario O",
      "section_title": true,
      "ja": "4.2. シナリオを選んだ理由o"
    },
    {
      "indent": 3,
      "text": "Capsule summary: It might be possible to make either scenario work. But Scenario O could be made to work faster, and less painfully.",
      "ja": "カプセルの概要：いずれかのシナリオを機能させることができるかもしれません。しかし、シナリオoは、より速く、そしてあまり痛みを伴わないように作られる可能性があります。"
    },
    {
      "indent": 3,
      "text": "The ISOC Board of Trustees was significantly worried that scenario C would make fundraising more difficult, which would necessarily affect its ability to support the IETF.",
      "ja": "ISOC理事会は、シナリオCが資金調達をより困難にすることを大幅に心配していました。これは必然的にIETFをサポートする能力に影響を与えます。"
    },
    {
      "indent": 3,
      "text": "The question of tax status for the new corporation was debated at some length on the list; legal counsel indicated that a corporation that did the IETF work (Scenario D) would probably be easy to get classified as 501(c)(3) (a type of non-profit corporation defined by U.S. Internal Revenue Service (IRS) regulations). However, a corporation that did only administrative support functions, as scenario C envisioned, would have more problems. In all cases, the process of determining this would take months, and could be dragged out longer if we were unlucky.",
      "ja": "新しい企業の税務ステータスの問題は、リストについてある程度議論されました。法律顧問は、IETF作業（シナリオD）を行った企業は、おそらく501（c）（3）（米国内国歳入庁（IRS）規制で定義された非営利企業の一種）に分類できるようになる可能性があることを示しました。ただし、シナリオCが想定しているように、管理サポート機能のみを行った企業は、より多くの問題を抱えています。すべての場合において、これを決定するプロセスには数か月かかり、不運であればもっと長く引きずられる可能性があります。"
    },
    {
      "indent": 3,
      "text": "The community feedback, in addition to contributing many well-formed and well-argued points to the discussion, gave a powerful indication on where it was possible to get IETF consensus:",
      "ja": "コミュニティのフィードバックは、議論に多くの適切に形成された礼儀正しいポイントを提供することに加えて、IETFのコンセンサスを得ることができる場所についての強力な兆候を与えました。"
    },
    {
      "indent": 3,
      "text": "o It seemed possible to garner IETF consensus around Scenario O; the people arguing for Scenario C indicated that they \"could live with\" the alternative.",
      "ja": "o シナリオoを中心にIETFのコンセンサスを獲得することが可能であると思われます。シナリオCを主張している人々は、彼らが代替手段と「一緒に暮らすことができる」ことを示しました。"
    },
    {
      "indent": 3,
      "text": "o It seemed much more difficult to garner IETF consensus around Scenario C; many people arguing against it indicated that they were firmly convinced that it was the wrong choice for the IETF.",
      "ja": "o シナリオcをめぐるIETFのコンセンサスを獲得することは、はるかに難しいと思われました。それに反対する多くの人々は、IETFにとって間違った選択であると固く確信していることを示しました。"
    },
    {
      "indent": 3,
      "text": "The IETF is based on the idea that the consensus process, when it works, comes up with reasonable decisions. We concluded that the apparent drift of community consensus was a reasonable basis for the IESG/IAB recommendations.",
      "ja": "IETFは、コンセンサスプロセスが機能するとき、合理的な決定を出すという考えに基づいています。コミュニティコンセンサスの明らかなドリフトは、IESG/IABの推奨事項の合理的な根拠であると結論付けました。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "ja": "5. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document does not require any IANA actions. However, the IETF administrative restructuring process is likely to affect how the relationship between the IETF and the IANA is managed.",
      "ja": "このドキュメントでは、IANAアクションは必要ありません。ただし、IETFの管理再構築プロセスは、IETFとIANAの関係が管理される方法に影響を与える可能性があります。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "This document does not introduce any security considerations for the operation of the Internet. However, administrative restructuring introduces several areas of risk to the future of the IETF. The risks and their mitigation strategies are described in the scenarios as appended to this document.",
      "ja": "このドキュメントでは、インターネットの運用に関するセキュリティ上の考慮事項は導入されていません。ただし、管理再構築により、IETFの将来にリスクのあるいくつかの領域が導入されます。リスクとその緩和戦略は、このドキュメントに追加されたシナリオで説明されています。"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgements",
      "section_title": true,
      "ja": "7. 謝辞"
    },
    {
      "indent": 3,
      "text": "This document is a collective work of the members of the IAB and the IESG. Members of the IAB at the time of this writing include Bernard Aboba, Harald Alvestrand, Rob Austein, Leslie Daigle, Patrik Faltstrom, Sally Floyd, Mark Handley, Bob Hinden, Geoff Huston, Jun-ichiro Itojun Hagano, Eric Rescorla, Pete Resnick, and Jonathan Rosenberg. Members of the IESG at the time of this writing include Harald Alvestrand, Steve Bellovin, Bill Fenner, Ted Hardie, Scott Hollenbeck, Russ Housley, David Kessens, Allison Mankin, Thomas Narten, Jon Peterson, Margaret Wasserman, Bert Wijnen, and Alex Zinin.",
      "ja": "このドキュメントは、IABとIESGのメンバーの集合的な仕事です。この執筆時点でのIABのメンバーには、バーナードアボバ、ハラルドアルベスランド、ロブオーストイン、レスリーデイグル、パトリックファートストローム、サリーフロイド、マークハンドリー、ボブヒンデン、ジェフヒューストン、ジュンチーロイトジュンハガノ、エリックレスカノ、ペテーレニック、ジョナサン・ローゼンバーグ。この執筆時点でのIESGのメンバーには、ハラルド・アルベスランド、スティーブ・ベロヴィン、ビル・フェナー、テッド・ハーディ、スコット・ホレンベック、ラス・ヒューズリー、デビッド・ケッセン、アリソン・マンキン、トーマス・ナルテン、ジョン・ピーターソン、マーガレット・ワッサーマン、ベルト・ウィジネン、アレックス・ジニニニン。"
    },
    {
      "indent": 3,
      "text": "The administrative restructuring effort cannot succeed without community support and participation. Thus, the IAB and IESG wish to acknowledge the collective contributions of members of the IETF community who have participated in the discussion of this topic.",
      "ja": "管理的な再編の取り組みは、コミュニティのサポートと参加なしでは成功することはできません。したがって、IABとIESGは、このトピックの議論に参加したIETFコミュニティのメンバーの集合的な貢献を認めたいと考えています。"
    },
    {
      "indent": 0,
      "text": "Appendix: Scenario C",
      "ja": "付録：シナリオc"
    },
    {
      "indent": 3,
      "text": "This Appendix reproduces the contents of an Internet-Draft defining Scenario C, as it was posted on 20 September 2004. A table of contents has been removed from this copy and the text has been reformatted to fit within IETF publication guidelines. Each line is prefixed with \"C>>\".",
      "ja": "この付録は、2004年9月20日に投稿されたため、シナリオCを定義するインターネットドラフトの内容を再現しています。このコピーから目次が削除され、IETFの出版ガイドラインに適合するようにテキストが再フォーマットされています。各行には「C >>」が付いています。"
    },
    {
      "indent": 0,
      "text": "C>>                                                           B. Wijnen\nC>>                                                  LucentTechnologies\nC>>                                                       H. Alvestrand\nC>>                                                       Cisco Systems\nC>>                                                          P. Resnick\nC>>                                               QUALCOMM Incorporated\nC>>                                                  September 20, 2004\nC>>\nC>>  AdminRest Scenario C: An IETF Administrative Support Foundation as\nC>>                an Independent Nonprofit Corporation\nC>>\nC>> Abstract\nC>>\nC>>    This document defines a proposal for an IETF Administrative\nC>>    Support Foundation (IASF) as an independent not-for-profit\nC>>    corporation as a means for providing focused support for IETF\nC>>    community activities. It proposes the creation of an IASF Board\nC>>    of Trustees (BoT) that is mainly selected by and accountable to\nC>>    the IETF community and would provide oversight for the IETF\nC>>    Administrative Support Foundation. The IASF will also establish\nC>>    and maintain a strong relationship with the Internet Society\nC>>    (ISOC) and the current relationships between IETF and ISOC will\nC>>    basically be left unchanged.\nC>>\nC>>    In order to allow the community to properly evaluate this\nC>>    scenario, some draft Articles of Incorporation and draft Bylaws\nC>>    for the IASF are included.  Some draft BCP wording for the IASF,\nC>>    IETF and ISOC relationships is also included.\nC>>\nC>>    1.  Overview of Scenario C\nC>>\nC>>    This document follows from two previous documents.  [RFC3716]\nC>>    defined the overall parameters and criteria for an administrative\nC>>    restructuring.  [I-D.malamud-consultant-report] provided an\nC>>    analysis of the implications of several of the suggested\nC>>    strategies.  This document picks one strategy and develops it\nC>>    further.\nC>>\nC>>    In order to provide the most focused and effective administrative\nC>>    support to the IETF community, this updated scenario C proposes a\nC>>    new and well-defined legal entity to support the IETF\nC>>    administrative functions.  The name of that new entity is \"The\nC>>    IETF Administrative Support Foundation\" (IASF).\nC>>\nC>>    First, it is important to understand that the IETF has been\nC>>    organized as an Activity of the Internet Society (ISOC) and as\nC>>    such represents the \"Standards and Protocols\" pillar of ISOC.\nC>>    Under this proposal, the IETF would continue to be an integral\nC>>    part of the Standards and Protocols pillar of ISOC.  ISOC\nC>>    currently provides these important functions to the IETF:\nC>>\nC>>    1.  Standards Process Functions. ISOC plays a fundamental role in\nC>>        the IETF Standards Process, including appointment of the\nC>>        Nominating Committee (Nomcom) chair, confirmation of IAB\nC>>        members, confirmation of documents that describe the\nC>>        standards processes, and acting as the last resort in the\nC>>        appeals process.  These Standards Process Functions are\nC>>        defined in [RFC2026], [RFC2028], [RFC2031], and [RFC3677].\nC>>\nC>>    2.  IETF Fund Raising Functions. ISOC provides the fund raising\nC>>        function as one source for financial support the IETF.\nC>>\nC>>    3.  Administration Functions. ISOC provides administrative and\nC>>        financial functions, managing the contract with the RFC\nC>>        Editor, providing insurance for selected IETF participants,\nC>>        and administering a discretionary fund for use by the IAB and\nC>>        the IETF Chairs.\nC>>\nC>>    The administrative restructuring of the IETF proposed in this\nC>>    document keeps that basic relationship between IETF and ISOC.\nC>>    Specifically, the recommendation does not propose any changes to\nC>>    the \"Standards Process Functions\" or to the \"IETF Fund Raising\nC>>    Functions\".\nC>>\nC>>    Under the \"Administration Functions\", ISOC both funds and\nC>>    administers some (as stated above) parts of the IETF\nC>>    Administrative Support Functions.  Some of the funds (like for\nC>>    the RFC-Editor) go directly to the contractor who executes the\nC>>    administrative function.  The streamlining of the administrative\nC>>    support for the IETF ultimately intends to put the complete\nC>>    Administrative Support Functions under the newly recommended\nC>>    IASF.  This means that we recommend that ultimately, ISOC funds\nC>>    for the IETF will be transferred to the IASF, which will then\nC>>    administer all the contracts and payments according to an\nC>>    approved yearly budget.  The details of that process will be\nC>>    documented in a Memorandum of Understanding (MoU) between ISOC,\nC>>    IETF and IASF.\nC>>\nC>>    This updated AdminRest Scenario C aims to provide the following:\nC>>\nC>>    o  A continued close relationship between IETF and ISOC.\nC>>\nC>>    o  A well defined legal entity within which the IETF can define\nC>>       the administrative activity in terms of IETF community needs.\nC>>\nC>>    o  A Board of Trustees with operational oversight that is\nC>>       accountable to the IETF community.\nC>>\nC>>    o  Continued separation between the IETF standards activity and\nC>>       any fund-raising for standards work.\nC>>\nC>>    o  A close and well defined relationship between IASF and ISOC,\nC>>       documented in a BCP (or MoU).\nC>>\nC>>    o  Appropriate ISOC oversight of its standards activities funds\nC>>       via a yearly budget approval and open reporting of funds\nC>>       spent.\nC>>\nC>>    In scenario C, it is intended that the IETF Administrative\nC>>    Support Foundation will be a tax-exempt not-for-profit\nC>>    corporation as defined by Articles of Incorporation and a set of\nC>>    Bylaws.  These will describe the scope and purpose of the IASF\nC>>    and they also define the structure and responsibility of the\nC>>    Board of Trustees (BoT), a body that is mainly selected by the\nC>>    IETF and which is responsible for overseeing the IASF.  A draft\nC>>    of the Articles of Incorporation and Bylaws is included in the\nC>>    next sections of this document.\nC>>\nC>>    Scenario C allows us (IETF) to establish IETF control over our\nC>>    administrative support functions in terms of determining that\nC>>    they meet the community's needs, and adjusting them from time to\nC>>    time using IETF processes.  This is to address the pressing\nC>>    administrative issues outlined in [RFC3716].\nC>>\nC>>    Scenario C also encourages us (the IETF) to regularly evaluate\nC>>    that we do want to continue the relationships with ISOC and the\nC>>    contracts with our services providers (contractors).  It is based\nC>>    on the premise that we prefer to actively maintain relationships\nC>>    with other organizations and service providers instead of being\nC>>    bound to such relationships based on poorly defined and poorly\nC>>    documented historical facts.  A draft BCP for the relationship\nC>>    between ISOC, IETF and IASF is included as a separate section in\nC>>    this document.\nC>>\nC>>    Scenario C does however bring the burden of creating a new legal\nC>>    entity (IASF) and such an undertaking is also not without risks.\nC>>    It will need careful planning and execution.  Migration from the\nC>>    current structure to this new structure is probably also somewhat\nC>>    more costly and time and labour consuming.  The sections below\nC>>    try to show how that would be achieved and outlines what further\nC>>    steps are needed to provide more detail if this scenario is\nC>>    chosen.\nC>>\nC>> 2.  Work Plan for the IETF Administrative Support Foundation\nC>>\nC>>    This section gives the work plan for the IETF Administrative\nC>>    Support Foundation (IASF) for the remainder of 2004 and the year\nC>>    2005.\nC>>\nC>> 2.1  Workplan goals\nC>>\nC>>    The work plan below is intended to satisfy three goals:\nC>>\nC>>    o  Satisfy the IETF's need for support functions in 2005\nC>>\nC>>    o  Operate with a positive account balance throughout 2005\nC>>\nC>>    o  Start building up a fund inside the IASF to serve as a buffer\nC>>       against budgetary emergencies in later years (such as meetings\nC>>       with a severe cost overrun, or force-majeure cancellations).\nC>>\nC>>    The fund target is 6 months of operating revenue, and the target\nC>>    for building up the fund is 3 years.  The budgeted set-aside for\nC>>    the fund should thus be approximately 17% of operating revenue.\nC>>\nC>> 2.2  Incorporation process\nC>>\nC>>    There are 3 things that need to be in place before that\nC>>    corporation can be considered viable at all:\nC>>\nC>>    o  IETF consensus on the plan\nC>>\nC>>    o  ISOC agreement on a reasonable support contract\nC>>\nC>>    o  Assurance that the corporation will have tax-exempt status\nC>>\nC>>    Once this document has been discussed in the IETF, and the IESG\nC>>    and IAB gauges that rough consensus seems reached, the IETF\nC>>    leadership will take the following actions:\nC>>\nC>>    o  Publish a Last Call on this document (to determine plan\nC>>       consensus).\nC>>\nC>>    o  Choose a negotiating team to negotiate the ISOC contract.\nC>>\nC>>    o  Choose an executive search team to find the IASF\nC>>       Administrative Director (IAD).\nC>>\nC>>    o  Consult with legal counsel to determine how best to achieve\nC>>       tax-exempt status; this will affect the bylaws and articles of\nC>>       incorporation.\nC>>\nC>>    When the Last Call is over, the IESG will consider whether there\nC>>    is still consensus, and if there is, approve this document for\nC>>    publication.  Once that happens, it will take the following\nC>>    steps:\nC>>\nC>>    o  As soon as negotiations conclude, publish a Last Call on the\nC>>       ISOC contract.\nC>>\nC>>    o  As soon as drafting of legal documents is completed, publish a\nC>>       Last Call on the Bylaws and Articles of Incorporation, and ask\nC>>       the Nomcom to start the process of selecting Nomcom-selected\nC>>       board representatives.\nC>>\nC>>\nC>>    These Last Calls are \"speak now\" Last Calls - if someone wishes\nC>>    to challenge the IETF consensus to go ahead with these actions,\nC>>    knowing what the formal documents will look like, this is their\nC>>    last chance.\nC>>\nC>>    When these Last Calls are over, the IETF chair, the IAB chair and\nC>>    the ISOC President will jointly file the articles of\nC>>    incorporation, and the IESG, IAB and ISOC will fill their board\nC>>    seats.\nC>>\nC>>    Note: This document does not say when a Request for Information\nC>>    (RFI) for IETF support services such as meeting planning is sent\nC>>    out. Advice is sought on the earliest point where this can be\nC>>    done.\nC>>\nC>> 2.3  Contract establishment\nC>>\nC>>    The most important activity for late 2004/early 2005 is to\nC>>    finalize contracts for the support of the IETF.  This includes:\nC>>\nC>>    o  Funding\nC>>\nC>>    o  Technical infrastructure\nC>>\nC>>    o  Meeting management\nC>>\nC>>    o  Clerk's office\nC>>\nC>>    o  RFC Editor\nC>>\nC>>    o  IANA\nC>>\nC>>    There appears to be consensus in the IETF community that these\nC>>    functions, whether they are offered for free, remunerated or\nC>>    arranged for other consideration, should be under contract.\nC>>\nC>>    The contract for funding is expected to be with ISOC, and should\nC>>    be finalized before IASF is established.\nC>>\nC>>    The contract for technical infrastructure is expected to be an\nC>>    RFP, published in November of 2004, with responses being\nC>>    evaluated in December 2004, and services rendered from a mutually\nC>>    agreed date early in 2005.\nC>>\nC>>    The contract for meeting management will be influenced by the\nC>>    need to have stable agreements for the 2005 meetings at an early\nC>>    date.  This indicates that IASF will honor a pre-IASF agreement\nC>>    to have these meeting contracts signed by Foretec (if that can be\nC>>    achieved).\nC>>\nC>>    It is not clear how the contract for the clerk's office is to be\nC>>    managed at the time of this writing.\nC>>\nC>>    The contract for the RFC Editor is expected to be with ISI, and\nC>>    is expected to be a continuation of the current contract with\nC>>    ISOC, which runs until the end of 2005.\nC>>\nC>>    The contract with IANA will replace or augment the current MoU\nC>>    between the IETF and ICANN.  In its simplest form, it would\nC>>    simply be a reconfirmation of the duties of ICANN under the MoU.\nC>>\nC>> 2.4  Performance evaluation\nC>>\nC>>    The second task of the IASF is to make sure the IETF gets the\nC>>    support it needs.  The IASF will work together with the IETF\nC>>    community to make an effort to identify whether or not the IETF's\nC>>    needs are being met, and to coordinate improvements with the\nC>>    contractors.  This is an ongoing activity.\nC>>\nC>> 2.5  Budgeting for 2006\nC>>\nC>>    In June 2005, the IASF will start the yearly budgeting process\nC>>    with ISOC, as specified in the ISOC contract, leading to a work\nC>>    plan and budget for 2006.\nC>>\nC>> 2.6  Reporting\nC>>\nC>>    The IASF will present monthly updates on its economic status.\nC>>    These will be delivered to ISOC as part of the ISOC contract, and\nC>>    also be made publicly available so that the IETF community can\nC>>    inspect them.\nC>>\nC>> 3.  Details of the IETF Administrative Support Foundation\nC>>\nC>>    This section contains details about the proposal to change how\nC>>    the day-to-day IETF administrative support functions are\nC>>    provided.  This recommendation is based on the  initial\nC>>    description of \"Scenario C\" in the \"Administrative Support\nC>>    Analysis\" [I-D.malamud-consultant-report] provided by Carl\nC>>    Malamud.  It is further based on discussion in the IESG and IAB\nC>>    and on feedback on Carl's document as received on the IETF\nC>>    mailing list.  Further justifications, reasoning and motivations\nC>>    are given in Appendix A. Risk Analysis is done in Appendix C.\nC>>\nC>>    This document recommends to create a well defined and legal\nC>>    entity called \"The IETF Administrative Support Foundation\"\nC>>\nC>>    (IASF).  The name intends to clearly express that this new legal\nC>>    entity has only one single function, namely to provide the\nC>>    administrative support of the IETF Standardization and Protocol\nC>>    Development activities.  This entity will ultimately manage and\nC>>    administer all the administrative functions that are needed to\nC>>    support the IETF - the Standardization and Protocol Development\nC>>    activity of ISOC.\nC>>\nC>> 3.1  Organizational Form and Legal Domicile\nC>>\nC>>    The consultant report [I-D.malamud-consultant-report] contains a\nC>>    writeup on various choices in terms of how and where to\nC>>    incorporate. This recommendation has made the choice to\nC>>    incorporate in the US in the state of Virginia.  Some detail can\nC>>    be found in Appendix B.\nC>>\nC>>    In this scenario, administrative support functions for the IETF\nC>>    are legally housed in a focused, incorporated institution\nC>>    (although the Administrative Director might be physically housed\nC>>    within the Internet Society).\nC>>\nC>>    This scenario defines a number of concrete linkages with the\nC>>    Internet Society, which supplement the current close\nC>>    interconnection of the IETF community with ISOC.  The\nC>>    relationship is to be documented in a MoU (initial text is in\nC>>    Section 4).\nC>>\nC>> 3.2  Draft Core Principles\nC>>\nC>> 3.2.1  Principles of Establishment and Governance\nC>>\nC>>    The following principles are to be respected for the\nC>>    establishment and governance of the IETF Administrative Support\nC>>    Foundation (IASF) and are the basis for the Draft Articles of\nC>>    Incorporation as in Section 6.1 and the Draft Bylaws as in\nC>>    Section 6.2:\nC>>\nC>>    1.  The IASF shall be governed by a Board of Trustees (BoT), who\nC>>        shall be responsible for the fiscal, legal, and\nC>>        administrative infrastructure that supports the activities of\nC>>        the IETF.\nC>>\nC>>    2.  The governance of the IETF, the standards process, and all\nC>>        other aspects of how we make our standards are defined in the\nC>>        procedural Best Current Practice (BCP) RFC series, which will\nC>>        be explicitly referenced in the organization documents of the\nC>>        IASF.\nC>>\nC>>    3.  The IASF shall be transparent and responsible to the IETF.\nC>>\nC>>    4.  The BoT shall appoint a Secretary and a Treasurer, who need\nC>>        not be members of the BoT.  The IETF Administrative Director\nC>>        (IAD) of the IASF shall provide staff support to the BoT.\nC>>\nC>>    5.  The BoT shall be composed to strike a balance between\nC>>        \"outside\" and \"inside\" directors.  The IESG and IAB will each\nC>>        select a representative to serve as a voting member of the\nC>>        BoT. Mechanisms such as the Nominating Committee (Nomcom) and\nC>>        the appointment of certain seats by the ISOC fulfill the\nC>>        outside director obligations.\nC>>\nC>>    6.  IAB, IESG and ISOC will have liaisons to the BoT in order to\nC>>        have a good basis for interaction.\nC>>\nC>>    The BoT will have strong governance over a limited scope of\nC>>    activities (e.g., the fiscal, legal, and administrative\nC>>    infrastructure that are the charter of the IASF) but will have no\nC>>    authority over the IETF standards process.  In this board\nC>>    composition, the ISOC and Nomcom appointments ensure that outside\nC>>    directors with no perceived conflicts of interest are on the\nC>>    board.\nC>>\nC>>    All nominating bodies should make strong fiscal, legal, and\nC>>    administrative acumen essential selection criteria for this\nC>>    position.\nC>>\nC>>    IAB and IESG representatives will serve for one year.  For other\nC>>    appointments, a term proposed for the nominated positions is\nC>>    three years with staggered appointments.  However, the nominating\nC>>    body might have the power to change their appointee during their\nC>>    term.\nC>>\nC>>    All members of the BoT selected by the IETF are subject to the\nC>>    same recall procedures in effect for the IETF leadership such as\nC>>    members of the IAB and IESG.\nC>>\nC>> 3.2.2  Principles of Operation of the IETF Administrative Support\nC>>       Foundation\nC>>\nC>>    The following are general principles for the operation of the\nC>>    IASF:\nC>>\nC>>    1.  The IASF shall employ an IETF Administrative Director (IAD)\nC>>        of the IASF, who shall be hired by the BoT with the advice\nC>>        and consent of the IESG and IAB.\nC>>\nC>>    2.  All support services shall be contracted in an open and\nC>>        transparent manner.\nC>>\nC>>    3.  The IAD shall submit a proposed annual budget to the BoT at\nC>>        least 90 days before the beginning of the fiscal year.  Such\nC>>        budget shall be developed with the advice and consent of the\nC>>        IAB and IESG.\nC>>\nC>>    4.  The IAD shall serve on the BoT as a non-voting, ex-officio\nC>>        member.\nC>>\nC>>    5.  The BoT shall select a professional audit firm and shall\nC>>        commission an audit immediately upon the close of each fiscal\nC>>        year.\nC>>\nC>>    6.  The IASF will conduct financial reporting in a fully\nC>>        transparent fashion.  Audits shall be conducted promptly and\nC>>        published.  Tax returns shall be published.  Detailed\nC>>        financial statements will be published on a regular basis,\nC>>        including timely reports on the financial results of IETF\nC>>        meetings.\nC>>\nC>> 4.  Draft MoU between ISOC, IETF and IETF Administrative Support\nC>>    Foundation\nC>>\nC>> 4.1  Form and Scope of the Agreement\nC>>\nC>>    This section presents some principles to be incorporated in a\nC>>    draft MoU/Contract between the Internet Society (ISOC) and the\nC>>    IETF Administrative Support Foundation (IASF), detailing the work\nC>>    each is expected to perform, the responsibilities each has, and\nC>>    the means by which these functions are accomplished.  This\nC>>    MoU/Contract shall be published as an RFC.\nC>>\nC>>    The MoU/Contract will specify the responsibilities of the\nC>>    Internet Society, including:\nC>>\nC>>    o  Reaffirmation of the Standards Process Function that ISOC\nC>>       performs for the IETF.\nC>>\nC>>    o  Continuation of the Fund Raising Function that ISOC conducts,\nC>>       in which a single, unified campaign is used to solicit\nC>>       corporate, individual,  and other organizational donations for\nC>>       funding of the 3 Pillars.\nC>>\nC>>    o  Disbursement of funds to the IASF according to the agreed-upon\nC>>       budgets and processes as specified in this agreement.\nC>>\nC>>    o  Verification that IASF spends these funds to support the work\nC>>       of the IETF, within the scope described in the IASF bylaws.\nC>>\nC>>    Responsibilities of IASF:\nC>>\nC>>    o  Determine, in cooperation with the IETF, the support functions\nC>>       that are needed for the IETF, and can be achieved within\nC>>       available funds.\nC>>\nC>>    o  Enter into contracts for these support functions.\nC>>\nC>>    o  Supervise these contracts and ensure that they are being\nC>>       performed in the best interest of the IETF, within a\nC>>       reasonable budget and with agreed-upon performance.\nC>>\nC>> 4.2  Cooperation mechanism\nC>>\nC>>    IASF and ISOC agree that they will perform a budgeting procedure\nC>>    each year, comprising the following steps:\nC>>\nC>>    o  IASF puts together a budget proposal to ISOC, and presents it\nC>>       in June.  This will specify the functions that need to be\nC>>       performed, the cost of each, the expected revenue from IETF\nC>>       meeting participation, and how much is being requested for\nC>>       ISOC to contribute.\nC>>\nC>>    o  By the end of August, ISOC will give a budget number to IASF\nC>>       that says how much ISOC is willing to contribute to support\nC>>       the functions described in the IASF budget.\nC>>\nC>>    o  Before November 1, ISOC and IASF will agree on a budget, an\nC>>       ISOC contribution, and a disbursement schedule.\nC>>\nC>>    o  If either party sees that there is reason to change the\nC>>       budget, they can start a negotiation to do so at any time.  On\nC>>       mutual agreement to a change, payments are modified\nC>>       accordingly.\nC>>\nC>>    o  ISOC may withhold funds if IASF fails to account for its\nC>>       expenditures, if it determines that IASF has departed\nC>>       significantly from its budgeted expenditures without agreement\nC>>       with ISOC to do so, or if ISOC determines that IASF is\nC>>       spending funds in violation of its bylaws.\nC>>\nC>> 4.3  Promises Not to Do Things\nC>>\nC>>    This section lays out things that would constitute interference\nC>>    in each others' business, or things that are Just Plain Wrong.\nC>>\nC>>    In legal terms, these are called \"covenants.\"\nC>>\nC>>    ISOC will not place requirements on how IASF does business,\nC>>    except on reporting.  It will, for instance, not attempt to\nC>>    influence IASF choice of contractors or choice of meeting\nC>>    sponsors.  This restriction is meant to enforce the separation\nC>>    between fund raising and the actual operation of the standards\nC>>    process.\nC>>\nC>>    IASF will not ask companies for money.  IASF may ask for sponsors\nC>>    for IETF events, per tradition, and may accept zero-cost provider\nC>>    contracts or in-kind donations, but ISOC is the organization\nC>>    charged with fundraising.\nC>>\nC>>    Neither ISOC nor IASF will attempt to influence technical\nC>>    decisions of the IETF standards process.\nC>>\nC>> 4.4  Initial contribution\nC>>\nC>>    The Internet Society has already allocated $700,000 in transition\nC>>    funds.  As part of the formation process, this section sets out a\nC>>    way that a 2005 allocation of funds and an initial contribution\nC>>    for startup can be decided upon.  NOTE: This section is a GUESS!\nC>>    Its purpose is to give some sense of where we're at.\nC>>\nC>>    If this plan is pursued, one of the first activities is to put\nC>>    together a detailed 2005 budget, including an analysis of cash\nC>>    flow and balance sheets to make sure that the organization is\nC>>    properly funded and will be solvent throughout the year.  This\nC>>    planning process should project out 3 years and show how the\nC>>    organization will be able to accumulate the appropriate cash\nC>>    reserve to make sure operations can continue in a stable manner.\nC>>\nC>>    An initial estimate is for an on-going annual contribution of USD\nC>>    900.000 to IASF in 2005.  In addition, ISOC will contribute an\nC>>    additional USD 600.000 as an initial fund to start up IASF,\nC>>    payable after the Board of Trustees is seated and this contract\nC>>    is signed and approved by the IETF.\nC>>\nC>>    ISOC commits to this ongoing level of contribution (USD 75.000\nC>>    per month) for the lifetime of this contract, unless modified by\nC>>    mutual agreement.\nC>>\nC>> 4.5  Termination, law and so on\nC>>\nC>>    This agreement may be terminated by either party for any reason\nC>>    on 12 months' notice.\nC>>\nC>>    The parties may reach mutual agreement on a shorter termination\nC>>    period.\nC>>\nC>>    All conflicts under this agreement are to be adjudicated under\nC>>    the laws of the United States and the State of Virginia, however\nC>>    the parties may also agree to arbitration, mediation or any other\nC>>    conflict resolution mechanisms.\nC>>\nC>> 5.  Notes and Explanations\nC>>\nC>>    This is where we put down why things are the way they are.\nC>>\nC>> 5.1  Type of legal instrument\nC>>\nC>>    This document is styled as a contract - an agreement between two\nC>>    parties, enforceable under law.  An alternate formulation would\nC>>    be a Memorandum of Understanding - but we want it to be clear to\nC>>    everyone that the parties stand behind their responsibilities\nC>>    under this document.  At the moment, the authors see no\nC>>    compelling arguments for not making it a contract.  In either\nC>>    case, the document is published as an RFC.\nC>>\nC>> 5.2  Power Balance\nC>>\nC>>    As written, it is designed to make it easy to do the right thing\nC>>    as long as the parties agree what that is, to make it clear that\nC>>    ISOC will continue to pay money as long as IASF does the Right\nC>>    Thing (and reports what it's doing), and that ISOC can stop the\nC>>    show quickly if it's clear that IASF is not doing the Right\nC>>    Thing.\nC>>\nC>> 5.3  Budget figures\nC>>\nC>>    The main purpose of the numbers is to make it clear that there\nC>>    WILL be numbers in this contract, and that it WILL represent a\nC>>    solid commitment by ISOC.  The numbers are \"subject to change\nC>>    without notice\" while this contract is negotiated.\nC>>\nC>> 6.  Draft Incorporating Documents for the IETF Administrative\nC>>    Support Foundation\nC>>\nC>> 6.1  Draft Articles of Incorporation\nC>>\nC>>    This section contains standard, pro-forma Articles of\nC>>    Incorporation. Note well that tax lawyers often make significant\nC>>    alterations to standard Articles as they consider a 501(c)(3)\nC>>    application.  They are included here merely as a sample for\nC>>    illustrative purposes only.\nC>>\nC>>    'Commonwealth of Virginia -- State Corporation Commission'|\nC>>    'Articles of Incorporation -- Virginia Nonstock Corporation'|\nC>>    Form SCC819, 07/ 03 [1] ------\nC>>\nC>>    The undersigned, pursuant to Chapter 10 of Title 13.1 of the Code\nC>>    of Virginia, [Virginia] state(s) as follows:\nC>>\nC>>    1.  The name of the corporation is The IETF Administrative\nC>>        Support Foundation.\nC>>\nC>>    2.  The corporation shall have no members.\nC>>\nC>>    3.  The purpose of the corporation is to manage and administer\nC>>        all the administrative functions for the IETF - the\nC>>        Standardization and Protocol Development activity of the\nC>>        Internet Society.\nC>>\nC>>    4.  The Trustees of the corporation shall be elected or appointed\nC>>        as specified in Article IV (Section 6.2.5) of the Bylaws.\nC>>\nC>>    5.  Name and agent:\nC>>\nC>>        A.  The name of the corporation's initial registered agent\nC>>            is: XXX\nC>>\nC>>        B.  The initial registered agent is a domestic or foreign\nC>>            stock or nonstock corporation, limited liability company,\nC>>            or registered limited liability partnership authorized to\nC>>            transact business in Virginia.\nC>>\nC>>    6.  The initial Trustees are: XXX\nC>>\nC>>    7.  The incorporators are: XXX\nC>>\nC>> 6.2  Draft Bylaws of the IETF Administrative Support Foundation\nC>>\nC>>    As with the Draft Articles, the Draft Bylaws included here are a\nC>>    pro-forma, standard version.  Substantial alteration may be\nC>>    required as legal counsel reviews the specific nature of an\nC>>    incorporation.\nC>>\nC>> 6.2.1  Article I: Organization\nC>>\nC>>    The name of the Corporation shall be The IETF Administrative\nC>>    Support Foundation (which is hereinafter also referred to as the\nC>>    \"IASF\").\nC>>\nC>> 6.2.2  Article II: Purpose\nC>>\nC>>    *Section 1: Purpose.* The IASF shall be operated exclusively for\nC>>    nonprofit educational, charitable, and scientific purposes,\nC>>    including, without limitation, the purposes stated in the IASF's\nC>>    Articles of Incorporation.\nC>>\nC>>    *Section 2: Restrictions.* No part of the net earnings of the\nC>>    IASF shall inure to the benefit of, or be distributable to,\nC>>    private persons, except that the IASF shall be authorized and\nC>>    empowered to pay reasonable compensation for services rendered,\nC>>    and to make payments and distributions in furtherance of the\nC>>    purposes set forth in Article II, Section 1 hereof.  Any other\nC>>    provision of these Bylaws to the contrary notwithstanding, the\nC>>    IASF shall not carry on any activities not permitted to be\nC>>    carried on by a corporation exempt from Federal Income Tax under\nC>>    Section 501(a) and Section 501(c)(3) of the Code.  These Bylaws\nC>>    shall not be altered or amended in derogation of the provisions\nC>>    of this Section.\nC>>\nC>> 6.2.3  Article III: Members\nC>>\nC>>    The IASF shall have no members and no stockholders.\nC>>\nC>> 6.2.4  Article IV: Offices\nC>>\nC>>    The office of the IASF shall be as determined from time to time\nC>>    by the Board of Trustees (BoT) within or outside of the State of\nC>>    Virginia.\nC>>\nC>> 6.2.5  Article V: Board of Trustees\nC>>\nC>>    *Section 1: Authority and Responsibilities.* The power,\nC>>    authority, property, and affairs of the IASF shall at all times\nC>>    be exclusively exercised, controlled, and conducted by or under\nC>>    the authority of the Board of Trustees (BoT) subject to any\nC>>    limitations set forth in the Articles of Incorporation and in\nC>>    accordance with the Virginia Nonstock Corporation Act as it now\nC>>    exists or hereafter may be amended.\nC>>\nC>>    *Section 2: Board of Trustees Composition.* The Board of Trustees\nC>>    shall consist of seven (7) Trustees.\nC>>\nC>>       One (1) Trustee will be selected by the IAB.\nC>>\nC>>       One (1) Trustee will be selected by the IESG.\nC>>\nC>>       Two (2) Trustees will be selected by the Internet Society.\nC>>\nC>>       Three (3) Trustees will be selected by the IETF community.\nC>>\nC>>    The IAB chair and IETF chair will functions as liaisons from the\nC>>    IAB and IESG respectively to the Board of Trustees.  The chair\nC>>    and president of the Internet Society will function as liaisons\nC>>    from the ISOC to the Board of Trustees.\nC>>\nC>>    *Section 3: Terms.* The term of office of IESG and IAB Selected\nC>>    Trustees shall be one (1) year or until their successors have\nC>>    been selected and assume office.  The term of office of otherwise\nC>>    Selected Trustees shall be three (3) years or until their\nC>>    successors have been selected and assume office.  Selected\nC>>    Trustees may be selected to serve multiple terms.\nC>>\nC>>    *Section 4: Selection of the Board of Trustee*\nC>>\nC>>    1.  *Selection of IESG and IAB Selected Trustees.* The IESG and\nC>>        IAB shall each select one representative Trustee, who is not\nC>>        at the same time an IESG or IAB member.\nC>>\nC>>    2.  *Selection of otherwise Selected Trustees.* Three (3) IETF\nC>>        Selected Trustees shall be selected by the IETF nominations\nC>>        process (as defined in [RFC3777] or its successor) and\nC>>        confirmed by the IESG.  Two ISOC Selected Trustees shall be\nC>>        selected by the Internet Society using means of their own\nC>>        choosing.\nC>>\nC>>    3.  *Resignation.* A Selected Trustee may resign by delivering\nC>>        his resignation in writing to the IASF at its principal\nC>>        office or to the Secretary of the IASF.  Such resignation\nC>>        shall be effective upon its receipt or upon such date (if\nC>>        any) as is stated in such resignation, unless otherwise\nC>>        determined by the Board.\nC>>\nC>>    4.  *Removal.* A Selected Trustee selected by the IETF\nC>>        nominations process may be removed from office at any time\nC>>        using the procedures specified in [RFC3777] or its successor.\nC>>        A Selected Trustee selected by the Internet Society may be\nC>>        removed by the Internet Society using means of their own\nC>>        choosing.\nC>>\nC>>    5.  *Vacancies.* Any vacancy in the Board of Trustees shall be\nC>>        filled using the procedures set forth above on the\nC>>        composition of the Board of Trustees.  The Trustees shall\nC>>        have and may exercise all of their powers notwithstanding the\nC>>        existence of one or more vacancies in their number.\nC>>\nC>>    *Section 5: Quorum.* A majority (i.e.  fifty (50) percent plus\nC>>    one (1)) of the Trustees shall constitute a quorum for the\nC>>    transaction of business.  Unless otherwise stated in these\nC>>\nC>>    Bylaws, decisions of the Board of Trustees shall be made by the\nC>>    concurrence of a majority of members of the Board of Trustees\nC>>    present and voting.  If at any meeting there is no quorum\nC>>    present, the Board must not transact business.\nC>>\nC>>    *Section 6: Compensation and Reimbursement.* No member of the\nC>>    Board of Trustees may receive compensation for his or her\nC>>    services as a Trustee.  A Trustee shall, at their request, be\nC>>    reimbursed for actual, necessary and reasonable travel and\nC>>    subsistence expenses incurred by them in performance of their\nC>>    duties.\nC>>\nC>>    *Section 7: Meetings.* The Board of Trustees shall meet at least\nC>>    twice annually.\nC>>\nC>>    1.  *Written notice, waiver, action.* Wherever the text below\nC>>        speaks of \"written\" it is also permitted to use e-mail.\nC>>\nC>>    2.  *Annual Meeting.* The Board of Trustees shall hold a public\nC>>        Annual Meeting at a time and place associated with the first\nC>>        IETF meeting each year.  This Annual meeting shall be open to\nC>>        all IETF attendees except that the parts of the meeting\nC>>        dealing with personnel issues may be held in executive\nC>>        session.\nC>>\nC>>    3.  *Meeting Types, Methods, and Notice.* Meetings of the Board\nC>>        may be held from time to time at such intervals and at such\nC>>        places as may be fixed by the Board.  Meetings of the Board\nC>>        may be held only in person or via teleconference.  Notice of\nC>>        all regular meetings of the Board shall be delivered to each\nC>>        Trustee by e-mail or by postal mail and announced on the\nC>>        IETF-Announce list at least ten (10) calendar days before the\nC>>        meeting.  Special meetings of the Board may be called for any\nC>>        purpose at any time by the Chairman of the Board or by any\nC>>        three (3) Trustees. Notice of any special meeting shall state\nC>>        the purpose of the meeting.  A Trustee may waive notice of a\nC>>        meeting of the Board of Trustees by submitting a signed,\nC>>        written waiver of notice, either before or after the meeting.\nC>>        A Trustee's attendance at or participation in a meeting\nC>>        waives any required notice of the meeting unless at the start\nC>>        of such meeting or promptly upon arrival the Trustee objects\nC>>        to holding the meeting or transacting business at the\nC>>        meeting, and does not thereafter vote for or assent to action\nC>>        taken at the meeting.\nC>>\nC>>    4.  *Actions Taken By the Board of Trustees Without Meeting.* Any\nC>>        action required or permitted to be taken at any meeting of\nC>>        the Board of Trustees may be taken without a meeting if all\nC>>\nC>>        Trustees consent in writing to such action.  Such action\nC>>        shall be evidenced by written consents approving the lack of\nC>>        a meeting, signed by each Trustee.\nC>>\nC>>    *Section 8: Board Committees.* The Trustees may elect or appoint\nC>>    one or more committees (including but not limited to an Executive\nC>>    Committee) and may delegate to any such committee or committees\nC>>    any or all of their powers, provided that any committee to which\nC>>    the powers of the Trustees are delegated shall consist solely of\nC>>    Trustees.  Committees shall conduct their affairs in the same\nC>>    manner as is provided in these By Laws for the Trustees.  The\nC>>    members of any committee shall remain in office at the pleasure\nC>>    of the Board of Trustees.\nC>>\nC>>    *Section 9: Trustee Member Conflict of Interest.*\nC>>\nC>>    1.  As set forth in Section 9(3) below, a Trustee of the IETF\nC>>        Administrative Support Foundation (IASF) who has a personal\nC>>        interest in a transaction, as defined below, may not\nC>>        participate in any discussion of that transaction by the\nC>>        Trustees of The IASF and may not vote to determine whether to\nC>>        authorize, approve, or ratify that transaction except as\nC>>        specifically described below. For purposes of these Bylaws, a\nC>>        \"personal interest\" is defined as any act that will provide,\nC>>        directly or indirectly, a financial benefit or a disparate\nC>>        benefit individually to the Trustee, or to a company he or\nC>>        she is employed by, has a significant financial interest in,\nC>>        or represents in any fashion.  However, policies under\nC>>        consideration by the IASF are likely to have an impact on the\nC>>        business of every Trustee.  It is expected that most policy\nC>>        decisions will have a direct or indirect impact on the\nC>>        Trustee's company, but such a non-individualized interest\nC>>        does not constitute a \"personal interest\" as used in these\nC>>        Bylaws.  A \"transaction\" with The IASF for purposes of these\nC>>        Bylaws is a contract or consultancy in which the Trustee has\nC>>        a direct or indirect financial benefit, or a policy under\nC>>        consideration that will have a disparate and unusual impact\nC>>        on a business with which the Trustee is directly or\nC>>        indirectly associated.\nC>>\nC>>    2.  The mere existence of a personal interest by a Trustee of The\nC>>        IASF in a transaction with the IASF shall not invalidate the\nC>>        IASF's ability to enter that transaction so long as the\nC>>        following conditions are met: (i) the material facts of the\nC>>        personal nature of the transaction with The IASF and the\nC>>        Trustee's interest in the transaction with the IASF are fully\nC>>        disclosed to the Board of Trustees of the IASF, either by the\nC>>        Trustee having a direct or indirect personal interest in the\nC>>\nC>>        transaction with the IASF, or are brought to the attention of\nC>>        the Board by a third party; or (ii) the BoT of the IASF, by a\nC>>        vote of the Trustees (without a conflict of interest) of the\nC>>        IASF vote to authorize, approve, or ratify a transaction with\nC>>        the IASF; or (iii) the transaction with the IASF in which the\nC>>        direct or indirect personal interest of a IASF Trustee was\nC>>        disclosed to the BoT of The IASF and was determined by the\nC>>        BoT of the IASF entitled to vote on the matter is determined\nC>>        by the BoT voting to be in the IASF's interests,\nC>>        notwithstanding the personal interest of the non-voting\nC>>        Trustee.\nC>>\nC>>    3.  In determining whether a conflict of interest exists, the BoT\nC>>        of the IASF has the prerogative, upon review of all facts and\nC>>        circumstances, to make its own determination of whether a\nC>>        conflict of interest exists and how it is appropriate to\nC>>        proceed. A Trustee who perceives the possibility of a\nC>>        conflict of interest for him or herself, or for another Board\nC>>        member, may raise this issue at any point prior to a vote on\nC>>        any issue.  Any Trustee who perceives a possible conflict of\nC>>        interest may present justification with respect to whether or\nC>>        not a conflict of interest exists, but the entire Board, with\nC>>        the exception of the Trustee having the potential conflict of\nC>>        interest, shall make the final determination to proceed in\nC>>        such a matter.  If the BoT finds there is a conflict of\nC>>        interest, the Trustee with the conflict may be excluded by\nC>>        the Chair of the Board from that portion of any meeting where\nC>>        a substantive discussion or decision to engage or not in such\nC>>        a transaction is made, except that he or she may provide any\nC>>        information that will assist the Trustees in such a matter\nC>>        before leaving such a meeting.\nC>>\nC>>    *Section 10.  Approval of Meeting Minutes.* Minutes of the BoT of\nC>>    the IASF must be approved by a procedure adopted by the board and\nC>>    published on the IASF web site.\nC>>\nC>> 6.2.6  Article VI: Officers\nC>>\nC>>    *Section 1: Number.* The officers of the IASF shall consist of a\nC>>    Chairman of the Board, a Treasurer and a Secretary, and such\nC>>    other inferior officers as the BoT may determine.\nC>>\nC>>    *Section 2: Election Term of Office and Qualifications.* All\nC>>    officers shall be elected annually by the vote of a majority of\nC>>    the Board of Trustees present and voting (excluding abstentions)\nC>>    at the Annual Meeting.  The Treasurer and Secretary need not be\nC>>    members of the Board.  The Chair of the IETF nor the chair of the\nC>>    IAB shall be the Chairman of the Board of the IASF.\nC>>\nC>>    *Section 3: Resignation.* An officer may resign by delivering his\nC>>    written resignation to the IASF at its principal office or to the\nC>>    Chair or Secretary.  Such resignation shall be effective upon\nC>>    receipt or upon such date (if any) as is stated in such\nC>>    resignation, unless otherwise determined by the Board.\nC>>\nC>>    *Section 4: Removal.* The BoT may remove any officer with or\nC>>    without cause by a vote of a majority of the entire number of\nC>>    Trustees then in office, at a meeting of the BoT called for that\nC>>    purpose.  An officer may be removed for cause only if notice of\nC>>    such action shall have been given to all of the Trustees prior to\nC>>    the meeting at which such action is to be taken and if the\nC>>    officer so to be removed shall have been given reasonable notice\nC>>    and opportunity to be heard by the BoT.\nC>>\nC>>    *Section 5: Vacancies.* In case any elected officer position of\nC>>    the IASF becomes vacant, the majority of the Trustees in office,\nC>>    although less than a quorum, may elect an officer to fill such\nC>>    vacancy at the next meeting of the BoT, and the officer so\nC>>    elected shall hold office and serve until the next Annual\nC>>    Meeting.\nC>>\nC>>    *Section 6: Chairman of the Board.* The Chairman of the Board\nC>>    shall, when present, preside at all meetings of the BoT of the\nC>>    IASF.  If the Chairman is not available to preside over a\nC>>    meeting, the majority of the Trustees present shall select\nC>>    another Trustee to preside at that meeting only.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "C>> C>> *Section 7: Treasurer.* The Treasurer shall have the custody of C>> all funds, property, and securities of the IASF, subject to such C>> regulations as may be imposed by the Board of Trustees. He or C>> she may be required to give bond for the faithful performance of C>> his or her duties, in such sum and with such sureties as the BoT C>> may require or as required by law, whichever is greater. When C>> necessary or proper, he or she may endorse on behalf of the IASF C>> for collection, checks, notes and other obligations, and shall C>> deposit same to the credit of the IASF at such bank or banks or C>> depository as the BoT may designate. He or she shall make or C>> cause to be made such payments as may be necessary or proper to C>> be made on behalf of the IASF. He or she shall enter or cause to C>> be entered regularly on the books of the IASF to be kept by him C>> or her for that purpose, full and accurate account of all monies C>> and obligations received and paid or incurred by him or her for C>> or on account of the IASF, and shall exhibit such books at all C>> reasonable times to any Trustee on application at the offices of C>> the IASF incident to the Office of Treasurer, subject to the C>> control of the BoT. Certain duties of the Treasurer as may be C>> specified by the BoT may be delegated by the Treasurer. C>> C>> *Section 8: Secretary.* The Secretary shall have charge of such C>> books, records, documents, and papers as the BoT may determine, C>> and shall have custody of the corporate seal. The Secretary C>> shall keep, or cause to be kept the minutes of all meetings of C>> the BoT. The Secretary may sign, with the Chairman, in the name C>> and on behalf of the IASF, any contracts or agreements, and he or C>> she may affix the corporate seal of the IASF. He or she, in C>> general, performs all the duties incident to the Office of C>> Secretary, subject to the supervision and control of the Board of C>> Trustees, and shall do and perform such other duties as may be C>> assigned to him or her by the BoT or the Chairman of the BoT. C>> Certain duties of the Secretary as may be specified by the BoT C>> may be delegated by the Secretary. C>> C>> *Section 9: Other Powers and Duties.* Each officer shall have in C>> addition to the duties and powers specifically set forth in these C>> By Laws, such duties and powers as are customarily incident to C>> his office, and such duties and powers as the Trustees may from C>> time to time designate. C>>\u0007\u0007\u0007C>> 6.2.7 Article VII: Amendments C>> C>> *Section 1: By Laws.* These By Laws may be amended by an C>> affirmative vote of a majority of the Trustees then in office C>> (excluding abstentions) at a regular meeting of the board or a C>> meeting of the board called for that purpose as long as the C>> proposed changes are made available to all trustees and posted to C>> the IETF Announce list at least 30 days before any such meeting. C>> C>> *Section 2: Articles of Incorporation.* The Articles of C>> Incorporation of the IASF may be amended by an affirmative vote C>> of two-thirds of the BoT then in office at a regular meeting of C>> the board or a meeting of the board called for that purpose as C>> long as the proposed changes are made available to all trustees C>> and posted to the IETF Announce list at least 30 days before any C>> such meeting. C>> C>> 6.2.8 Article VIII: Dissolution C>> C>> Upon the dissolution of the IASF, the IASF, after paying or C>> making provisions for the payment of all of the liabilities of C>> the IASF, dispose of all of the assets of the IASF exclusively C>> for the exempt purposes of the IASF in such manner or to such C>> organization or organizations operated exclusively for social C>> welfare or charitable purposes. Any such assets not so disposed C>> of shall be disposed of by a court of competent jurisdiction of C>> the county in which the principal office of the organization is C>> then located, exclusively for such purposes. In the event of a C>> C>> sale or dissolution of the corporation, the surplus funds of the C>> corporation shall not inure to the benefit of, or be C>> distributable to, its Trustees, officers, or other private C>> persons. C>> C>> 6.2.9 Article IX: Miscellaneous Provisions C>> C>> *Section 1: Fiscal Year.* The fiscal year of the IASF shall be C>> from January 1 to December 31 of each year. C>> C>> *Section 2: Execution of Instruments.* All checks, deeds, leases, C>> transfers, contracts, bonds, notes and other obligations C>> authorized to be executed by an officer of the IASF in its behalf C>> shall be signed by the Chairman of the Board or the Treasurer, or C>> as the Trustees otherwise determine. A certificate by the C>> Secretary as to any action taken by the BoT shall as to all C>> persons who rely thereon in good faith be conclusive evidence of C>> such action. C>>\u0007\u0007\u0007C>> *Section 3: Severability.* Any determination that any provision C>> of these By-Laws is for any reason inapplicable, illegal or C>> ineffective shall not affect or invalidate any other provision of C>> these By-Laws. C>> C>> *Section 4: Articles of Incorporation.* All references in these C>> By Laws to the Articles of Incorporation shall be deemed to refer C>> to the Articles of Incorporation of the IASF, as amended and in C>> effect from time to time. C>> C>> *Section 5: Gender.* Whenever used herein, the singular number C>> shall include the plural, the plural shall include the singular, C>> and the use of any gender shall include all genders. C>> C>> *Section 6: Successor Provisions.* All references herein: (1) to C>> the Internal Revenue Code shall be deemed to refer to the C>> Internal Revenue Code of 1986, as now in force or hereafter C>> amended; (2) to the Code of the State of Virginia, or any Chapter C>> thereof, shall be deemed to refer to such Code or Chapter as now C>> in force or hereafter amended; (3) the particular sections of the C>> Internal Revenue Code or such Code shall be deemed to refer to C>> similar or successor provisions hereafter adopted; and (4) to the C>> Request for Comment Series shall be deemed to refer to the C>> Request for Comment Series as they are now in force or hereafter C>> amended. C>> C>> 7. Acknowledgment of Contributions and Reviews C>> C>> A lot of text was taken from the report from Carl Malamud. C>> C>> Further review was done by various IESG and IAB members. Carl C>> Malamud also reviewed this document and helped with making the C>> text better English and easier to read. C>> C>> This document was created with \"xml2rfc\" C>> <http://xml.resource.org/> using the format specified C>> in [RFC2629]. C>> C>> 8. IANA Considerations C>> C>> This documents requires no action from IANA. C>>\u0007\u0007\u0007C>> 9. Security Considerations C>> C>> This document describes a scenario for the structure of the C>> IETF's administrative support activities. It introduces no C>> security considerations for the Internet. C>> C>> Safety considerations for the integrity of the standards process C>> are outlined in Appendix C. C>> C>> 10. References C>> C>> 10.1 Normative References C>> C>> [RFC2026] Bradner, S., \"The Internet Standards Process -- C>> Revision 3\", BCP 9, RFC 2026, October 1996. C>> C>> [RFC2028] Hovey, R. and S. Bradner, \"The Organizations Involved C>> in the IETF Standards Process\", BCP 11, RFC 2028, C>> October 1996. C>> C>> [RFC2031] Huizer, E., \"IETF-ISOC relationship\", RFC 2031, C>> October 1996. C>> C>> [RFC3677] Daigle, L. and Internet Architecture Board, \"IETF ISOC C>> Board of Trustee Appointment Procedures\", BCP 77, RFC C>> 3677, December 2003. C>> C>> [RFC3716] Advisory, IAB., \"The IETF in the Large: Administration C>> and Execution\", RFC 3716, March 2004. C>> C>> [RFC3777] Galvin, J., \"IAB and IESG Selection, Confirmation, and C>> Recall Process: Operation of the Nominating and Recall C>> Committees\", BCP 10, RFC 3777, June 2004. C>> C>> [Virginia] State of Virginia, \"Title 13.1: Corporations, Limited C>> Liability Companies, Business Trusts\", Undated, C>> C>> <http://leg1.state.va.us/cgi-C>> bin/legp504.exe?000+cod+TOC1301000> . C>> C>> 10.2 Informative References C>> C>> [I-D.ietf-xmpp-core] Saint-Andre, P., \"Extensible Messaging and C>> Presence Protocol (XMPP): Core\", draft-ietf-xmpp-C>> core-24 (work in progress), May 2004. C>>\u0007\u0007\u0007C>> [I-D.malamud-consultant-report] Malamud, C., \"IETF Administrative C>> Support Functions\", draft-malamud-consultant-report-01 C>> (work in progress), September 2004. C>> C>> [RFC2629] Rose, M., \"Writing I-Ds and RFCs using XML\", RFC 2629, C>> June 1999. C>> C>> URIs C>> C>> [1] <http://www.state.va.us/cgi-bin/scc-C>> clerkdl.pl?scc819&Articles_of_Incorporation_-_Nonstock_Corpo C>> ration> C>> C>> Authors' Addresses C>> C>> Bert Wijnen C>> Lucent Technologies C>> Schagen 33 C>> 3461 GL Linschoten C>> Netherlands C>> Phone: +31-348-407-775 C>> EMail: bwijnen at lucent.com C>> C>> Harald Tveit Alvestrand C>> Cisco Systems C>> Weidemanns vei 27 C>> Trondheim 7043 C>> Norway C>> EMail: harald at alvestrand.no C>> C>> Peter W. Resnick C>> QUALCOMM Incorporated C>> 5775 Morehouse Drive C>> San Diego, CA 92121-1714 C>> US C>> EMail: presnick at qualcomm.com C>>\u0007\u0007\u0007C>> Appendix A. Justification, Reasoning and Motivations C>> C>> C>> Quite a bit of the proposals from the consultant report have been C>> incorporated in this recommendation. However, a number of C>> changes have been made. In this section we try to explain which C>> changes were made and why. C>> C>> A.1 Changes to the name of the administrative entity C>> C>> In order to make it very clear that the new and legal C>> administrative entity is separate from the ISOC IETF activity C>> that deals with standardization and protocol development, this C>> recommendation uses \"The IETF Administrative Support Foundation\" C>> as the name for the corporation to be created. C>> C>> A.2 Domicile C>> C>> Various questions have been raised if the choice of Domicile C>> should be further investigated. In order to make progress this C>> document recommends to make a definite choice now and go for a US C>> based not-for-profit corporation in the state of Virginia. C>> Further investigation would most probably delay the whole process C>> by at least half a year. C>> C>> A.3 Changes to the composition of the BoT C>> C>> The consultant report had a proposal for Position-based Trustees, C>> which would automatically make the IAB chair and the IETF chair C>> voting members of the Board of Trustees (BoT) of the IETF C>> Administrative Support Foundation. There was discussion on the C>> IETF mailing list that those people are not selected because of C>> their business acumen but rather for their technical leadership. C>> We do not want to change those criteria. Another concern was C>> that this might generate a conflict of interest as well. So this C>> recommendation has made the IAB and IETF chairs liaisons to the C>> BoT. C>> C>> Instead of making IAB and IESG chairs voting Trustees, this C>> recommendation specifies that IAB and IESG can each select an C>> outside (i.e. not a member of IAB or IESG) person as a voting C>> Trustee. C>> C>> The selection of three (3) IETF selected Trustees has not changed C>> in this recommendation. However, there is a concern that the C>> current composition of the Nomcom is not tailored to selecting C>> people for this position. So over time a different process may C>> need to be defined for selecting those Trustees.",
      "ja": "c >> c >> *セクション7：会計係。 *会計係は、評議員会によって課される可能性のあるC >>規制の対象となるIASFのすべての資金、財産、および証券の監護権を有するものとします。。彼またはc >>彼女は、c >>職務の忠実なパフォーマンスに対して絆を与える必要があるかもしれません。c >>必要または適切な場合、彼または彼女は、IASF C >>を徴収、チェック、メモ、およびその他の義務のために承認することができます。c >>ボットが指定する可能性のある堆積物。彼または彼女は、IASFに代わってc >>を行う必要がある、または適切であるような支払いを行うか、c >>しなければならない。彼または彼女は、その目的のために彼によって保持されるIASFの本に定期的に入力またはc >>を定期的に入力するものとします。C >>またはIASFのために彼または彼女によって発生し、C >> c >>財務担当者の事務所へのIASFインシデントの事務所での申請に関する受託者に、すべてのC >>の合理的な時間にそのような本を展示するものとします。c >>ボットの制御。ボットによって指定されているC >>のように、会計係の特定の義務は、会計係によって委任される場合があります。c >> c >> *セクション8：秘書。 *秘書は、ボットが決定できるように、そのようなc >>帳簿、記録、文書、および論文を告発するものとする。秘書C >>は、c >>ボットのすべての会議の議事録を維持するか、または維持する必要があります。秘書は、議長とc >>に署名し、IASFに代わって契約または契約を締結することができ、彼またはC >>はIASFの企業シールを貼り付けることができます。彼または彼女は、c >>将軍で、C >>秘書の事務所にすべての職務事件を実行し、C >>評議員会の監督と支配を条件とし、そのような他の職務を遂行し、実行するものとするc >>ボットまたはボットの議長によって彼または彼女に割り当てられました。c >>ボットC >>によって指定される可能性のある長官の特定の義務は、秘書によって委任される場合があります。c >> c >> *セクション9：その他の権限と義務。 *各役員は、これらのc >>に特別に定められた義務と権限に加えて、法律、義務と権限に追加されます。c >>彼のオフィス、および受託者との義務と権限は、c >>時々指定される可能性があります。c >> c >> 6.2.7記事VII：修正c >> c >> *セクション1：法律によって。これらは、法律によって修正される場合があります。オフィスC >>で（棄権を除く）理事会の定期的な会議またはC >> c >>提案された変更がすべての受託者が利用できる限り、その目的を求めて委員会の会議でc >>IETFは、そのような会議の少なくとも30日前にリストを発表します。c >> c >> *セクション2：法人化の記事。 * C >> IASFの組み込みの記事は、ボットの3分の2の肯定的な投票C >>によって修正される場合があります。c >>理事会または理事会の会議は、提案された変更がすべての受託者C >>が利用できるようになり、IETFに掲載されている限り、その目的のためにC >>を呼びました。ミーティング。C >> C >> 6.2.8記事VIII：解散C >> C >> IASFの解散時、IASF、C>IASFは、IASFのすべての資産を、IASFの免除目的のために、またはそのようなC >>福祉または慈善目的のみで運営されている組織または組織をそのようなC >>組織または組織のみで処分します。そのように処分されていないそのような資産は、C >>の有能な管轄権の裁判所によって処分されます。c >> c >>企業の販売または解散の場合、C >>企業の余剰資金は、その受託者、役員、またはその他の利益を得ることができないか、C >>の利益を得ることができないものとします。プライベートc >>人。C >> C >> 6.2.9記事IX：その他の規定C >> C >> *セクション1：会計年度。 * IASFの会計年度は、毎年1月1日から12月31日までC >>でなければなりません。c >> c >> *セクション2：機器の実行。 *すべてのチェック、行為、リース、c >>転送、契約、債券、メモ、その他の義務c >>C>に代わって、理事会の議長または会計係によって署名され、それ以外の場合は受託者が決定するようにC >>によって署名されるものとします。c >>ボットが取った訴訟に関する秘書による証明書は、誠実にそこに依存しているすべてのc >> c >>そのような行動の決定的な証拠となるものとする。c >> c >> *セクション3：困難。 *これらの条例の規定c >>は、何らかの理由で適用可能であるという決定、イリノイ州"
    },
    {
      "indent": 0,
      "text": "C>> C>> In order to balance the ISOC and IETF people present at the BoT C>> meetings, this recommendation also specifies that the chair and C>> C>> president of ISOC also function as liaisons to the BoT of the C>> IETF Administrative Support Foundation. C>> C>> Appendix B. Domicile of the IETF Administrative Support Foundation C>> C>> A U.S. non-profit, non-member corporation is being recommended. C>> This recommendation is based on simple considerations of C>> expediency and pragmatism: a transition will be simplest and C>> least risky (in the short term). The reasoning is as follows: C>> C>> o Administrative support for the IETF is currently enmeshed in a C>> series of relationships with other institutions, most of which C>> are also U.S.-chartered non-profit organizations. Any change C>> in the institutional status of administrative support C>> functions will require familiarity with U.S. nonprofit law. C>> Incorporation in another country would require familiarity C>> with those laws as well. Thus, the incorporation expenses C>> would be higher and the process would take longer. C>> C>> o U.S. law has a strong concept of \"nexus,\" which is a C>> determination of when a foreign organization has enough C>> relationship to U.S. law to fall under the jurisdiction of a C>> U.S. court. Because of a long history of operating in the C>> U.S., numerous meetings in the U.S., and the large number of C>> U.S. residents who are participants and leaders, we feel it is C>> likely that U.S. courts would find nexus in relation to our C>> US-based activities, even if the IETF administrative support C>> organization was incorporated in another country. In other C>> words, incorporating in a country besides the U.S. does not C>> necessarily free the support organization from any perceived C>> vagaries of U.S. law. C>> C>> o Incorporating in a country other than the US may have tax C>> implications if the Internet Society is providing funding C>> support. C>> C>> o It is very likely that the IETF Administrative Support C>> Foundation would be deemed to clearly fall under the C>> \"scientific\" and \"educational\" grounds for classification as a C>> tax-exempt charity under section 501(c)(3) of the IRS code, so C>> a tax-exempt application should be quite straight-forward. C>> C>> o The incorporation laws of the U.S. states being considered do C>> not require that any members of the Board of Trustees be of a\u0007\u0007\u0007C>> certain nationality or state residency (e.g., there are no C>> \"local director\" requirements). The U.S. Dept. of Commerce C>> foreign-controlled organization reporting requirements apply C>> only to \"business enterprises\", and do not apply to non-profit C>> C>> entities such as an IETF administrative support organization. C>> C>> Since this document recommends incorporating in the U.S., C>> Virginia is the logical pick as the state of domicile to allow C>> the IETF administrative support organization to make use of ISOC C>> headquarters to house its single employee (though the employee C>> might be able to be housed at the Internet Society even if the C>> incorporation were elsewhere, for example the ISOC Geneva C>> office). C>> C>> Appendix C. Risk Analysis C>> C>> This scenario (as do all scenarios) has some risks. This section C>> tries to enumerate the sort of risks that we recognize and C>> summarizes why we think we can accept the risk or what kind of C>> action we think we can take if the risk indeed materializes into C>> a problem. C>> C>> C.1 US Domicile risks C>> C>> As explained in [I-D.malamud-consultant-report], incorporating in C>> the US carries two specific risks: the perception of the IETF C>> being a US-based organization and the potential for (or C>> perception of) governmental interference. C>> C>> The IETF is an international organization. However, even now, C>> the fact that the IETF standards processes are run in English and C>> that many of its current support organizations are US-based C>> leaves an impression that the IETF is too US-centric. C>> Incorporating the new administrative entity in the US may add to C>> that perception. C>> C>> Also, the IETF history is based in US federal government research C>> and funding. Though IETF is long separated from those C>> beginnings, even in the past few years there have been C>> interactions between the US government and the IETF that have C>> concerned people. Incorporating the administrative entity in the C>> US may invite more US governmental interference in the standards C>> activity of the IETF, or at the very least may leave the C>> perception that the US government might get involved. C>> C>> Both of these are serious problems, but we think there is C>> justification for and at least one mitigation to these risks. Of\u0007\u0007\u0007C>> course, the primary reason to consider US incorporation is C>> expedience (See section 4.4.1.1 of [I-D.malamud-consultant-C>> report]). We agree that the expedience makes US incorporation C>> worth the risk. But incorporating in multiple domiciles would C>> significantly mitigate the risk. Assuming we go down the path of C>> C>> US incorporation, we would like legal counsel to advise on the C>> possibility of incorporating in other domiciles (specifically C>> Switzerland and The Netherlands) at a later date after US C>> incorporation has been completed. If this is (as we suspect) C>> indeed possible, we think this would be the best way to go C>> forward. C>> C>> C.2 Non-profit status risk C>> C>> One of the risks pointed out to incorporation was the potential C>> that we would not get non-profit status, and that we must C>> therefore preserve some money in escrow for tax liability C>> purposes. Estimates for the time it will take to get such status C>> can be several months or even longer in some cases. C>> C>> It is important to point out that the tax liability is based on C>> profits, not on gross revenues. If the IASF is only taking in C>> enough money to cover expenses, there would be very little tax C>> liability. However, if more revenue is brought in than is spent, C>> for example to build up an endowment or operating reserve, that C>> \"profit\" is potentially taxable if non-profit status is not C>> granted. C>> C>> To mitigate this risk, the corporation could be created and non-C>> profit status applied for first, and operation of the corporation C>> would only begin after non-profit status was obtained. The IETF C>> would use an interim plan for continued operations until that C>> time. This way, no money would need to be in escrow during the C>> process of applying for non-profit status. However, that seems C>> an excessively cautious path to take given what appears to be the C>> fairly clear non-profit nature of the IETF. C>> C>> Commencing operations while the non-profit application is being C>> considered, but being careful about balancing revenue with C>> expenses and keeping an appropriate escrow account seems like a C>> prudent task. Further, any fund raising campaigns that result in C>> shifts to the balance sheet of the IASF should be conducted C>> cautiously until non-profit status is granted. C>>\u0007\u0007\u0007C>> C.3 Execution risks C>> C>> It is important that the execution goes well. Risks that we are C>> aware of include: C>> C>> o we can't hire a good IAD C>> C>> o we fail to project cash flow properly and go insolvent C>> C>> o we can't cut a deal with Foretec and have no 2005 meetings C>> C>> o we get bad lawyers and they take too long and charge too much C>> C>> o isoc runs out of money and doesn't tell us early enough C>> C>> In order to mitigate these problems we have a proposed work plan C>> included in this document. It is important that we get review of C>> this work plan by as many eyes as we can get, to make sure we C>> have considered all the possible steps that need to be taken. C>> C>> C.4 Insolvency risk C>> C>> Improper management controls and procedures or other imprudent C>> fiscal or administrative practices could expose the IETF to a C>> risk of insolvency. Careful selection of trustees, a process of C>> budget approval, and a methodical system of fiscal controls are C>> necessary to minimize this risk. C>> C>> C.5 Legal risks C>> C>> Improper formulation of the legal framework underlying the IETF C>> may expose the institution and individuals in leadership C>> positions to potential legal risks. Any such risk under this C>> plan appears to be equivalent to the risk faced by the community C>> under the current legal framework. This risk is further C>> mitigated by a thorough review by legal counsel, and by use of C>> insurance coverage. C>> C>> The legal exposure is best minimized by a careful adherence to C>> our procedures and processes, as defined by the Best Current C>> Practice Series. A carefully stated process, such as the BCP C>> documents that govern the selection of leadership positions and C>> define the standards process are the best insurance against legal C>> exposure, provided care is taken to stick to the process C>> standards that have been set. Adherence to a public rule book and C>> a fully open process are the most effective mechanisms the IETF C>> community can use.",
      "ja": "c >> c >>ボットC >>会議に存在するISOCとIETFの人々のバランスをとるために、この推奨事項は、椅子とC >> C >> ISOCの社長も、ボットのボットのリエゾンとして機能することも指定しています。C >> IETF管理サポート財団。C >> C >>付録B. IETF管理サポート財団の居住地c >> C >>米国の非営利団体、非会員企業が推奨されています。c >>この推奨は、C >>便宜と実用主義の単純な考慮事項に基づいています。遷移は最も単純で、c >>が最も危険ではありません（短期的には）。推論は次のとおりです。C>> C >> O IETFの管理サポートは現在、他の機関とのC >>一連の関係で巻き込まれており、そのほとんどは米国の非営利組織でもあります。管理サポートの制度的ステータスの変更c >> c >>機能には、米国の非営利法に精通する必要があります。c >>他の国に組み込むには、これらの法律にも親しみやすさが必要になります。したがって、設立費用c >>は高くなり、プロセスには時間がかかります。c >> c >> o米国の法律には、「ネクサス」の強力な概念があります。これは、外国組織が十分なc >> c >> c >>米国の管轄権に該当する場合の決定です。裁判所。C >>米国での活動の長い歴史のため、米国での多数の会議、および多くのC >>参加者でありリーダーである米国の住民は、米国の裁判所が結びつきを見つける可能性が高いと感じています。IETF管理サポートC >>組織が他の国に組み込まれていても、私たちのC >>米国ベースの活動に関連して。他のc >>単語では、米国以外の国に組み込むことは、必ずしも米国の法律のあいまいさからサポート組織を解放しません。c >> c >> o米国以外の国に組み込むことは、インターネット協会が資金調達を提供している場合、税c >>の影響を持っている可能性があります。c >> c >> o IETF管理サポートc >>財団は、C >>分類のための「科学的」および「教育的」根拠に明確に該当するとみなされる可能性が非常に高い>>免税慈善団体として分類IRSコードのセクション501（c）（3）に基づいて、C >>非課税アプリケーションは非常に簡単でなければなりません。c >> c >> o米国の編集法は、検討されているc >>評議員会のメンバーがc >>特定の国籍または国家の居住者を務める必要はありません（例えば、ありません。C >>「ローカルディレクター」の要件）。米国商務省C >>外国制御された組織の報告要件は、C >>を「企業」にのみ適用し、非営利C >> C >> IETF管理サポート組織などのエンティティには適用されません。C >> C >>このドキュメントは米国に組み込むことを推奨しているため、C >>バージニア州は、C >> IETF管理サポート組織がISOC C >>本部を使用するためのIETF管理サポート組織を許可する居住地として論理的な選択です。単一の従業員（ただし、従業員のc >>は、たとえc >>の取り込みが他の場所にあったとしても、インターネット社会に収容できる場合があります。C >> C >>付録C.リスク分析C >> C >>このシナリオ（すべてのシナリオと同様に）にはいくつかのリスクがあります。このセクションc >>は、私たちが認識しているリスクの種類を列挙しようとします。C>>は、リスクを受け入れることができると考える理由、またはリスクが実際にCに実現した場合に取ることができると思うアクションの種類をまとめています。問題。c >> c >> C.1米国の居住リスクc >> c >> [i-d.malamud-consultant-report]で説明されているように、c >>に組み込まれている米国には2つの特定のリスクがあります。IETFC>の認識>米国を拠点とする組織であり、政府の干渉の可能性（またはC >>認識）。C >> C >> IETFは国際組織です。ただし、今でも、c >> IETF標準プロセスが英語で実行され、C >>の現在のサポート組織の多くが米国ベースのC >>であるという事実は、IETFが米国中心であるという印象を残しています。c >>米国に新しい管理エンティティを組み込むと、C >>その認識が追加される場合があります。C >> C >> IETF履歴は、米国連邦政府の研究C >>および資金に基づいています。IETFはこれらのC >>の開始から長い間分離されていますが、過去数年でさえ、米国政府とC >>関係者がいるIETFとの間にC >>相互作用がありました。C >>米国に管理エンティティを組み込むことは、IETFの基準c >>活動における米国政府の干渉をより多く招待する場合があります。少なくとも、米国政府が関与する可能性があるという認識が残る場合があります。c >> c >>これらはどちらも深刻な問題ですが、これらのリスクに対するc >>正当性があり、少なくとも1つの緩和があると思います。C >>コースの主な理由は、C >> Expedienceです（[i-D.Malamud-Consultant-C >>レポート]のセクション4.4.1.1を参照）。私たちは、私たちは私たちにリスクに値するC >>を取り入れていることに同意します。しかし、組み込む"
    },
    {
      "indent": 0,
      "text": "Appendix: Scenario O",
      "ja": "付録：シナリオo"
    },
    {
      "indent": 3,
      "text": "This Appendix reproduces the contents of an Internet-Draft defining Scenario O, as it was posted on 20 September 2004. A table of contents has been removed from this copy and the text has been reformatted to fit within IETF publication guidelines. Each line is prefixed with \"O>>\".",
      "ja": "この付録は、2004年9月20日に投稿されたため、シナリオoを定義するインターネットドラフトの内容を再現しています。このコピーから目次が削除され、IETFの出版ガイドラインに適合するようにテキストが再フォーマットされています。各行には「o >>」が付いています。"
    },
    {
      "indent": 0,
      "text": "O>> L. Daigle O>> VeriSign O>> M. Wasserman O>> ThingMagic O>> September 20, 2004 O>> O>> AdminRest Scenario O: An IETF-Directed Activity Housed Under the O>> Internet Society (ISOC) Legal Umbrella O>> O>> Abstract O>> O>> This document defines an alternative proposal for the structure O>> of the IETF's administrative support activity (IASA) -- an IETF-O>> defined and directed activity that operates within the ISOC legal O>> umbrella. It proposes the creation of an IETF Administrative O>> Oversight Committee (IAOC) that is selected by and accountable to O>> the IETF community. This committee would provide oversight for O>> the IETF administrative support activity, which would be housed O>> within the ISOC legal umbrella. In order to allow the community O>> to properly evaluate this scenario, some draft BCP wording is O>> included. O>> O>> 1. Overview of Scenario O O>> O>> IETF community discussions of the scenarios for administrative O>> restructuring presented in Carl Malamud's consultant report [I-O>> D.malamud-consultant-report] have led to the identification of a O>> potentially viable alternative that is not included in that O>> report -- an IETF-defined and directed administrative support O>> function housed under the ISOC legal umbrella (called \"IASA\" O>> hereafter). This new scenario retains some properties of the O>> original ISOC-based scenarios, Scenarios A and B. However, this O>> new scenario aims to provide: O>> O>> o continued close relationship with ISOC O>> O>> o a clear basis from which the IETF can define (and, over time, O>> refine) the administrative activity in terms of IETF community O>> needs, using existing IETF/ISOC processes O>>\u0007\u0007\u0007O>> o an operational oversight board that is accountable to the IETF O>> community O>> O>> o continued separation between the IETF standards activity and O>> any fund-raising for standards work (within ISOC) O>> O>> o appropriate ISOC oversight of its standards activities funds O>> O>> This scenario is nicknamed \"Scenario O\" -- it is derived from, O>> but does not entirely encompass, Scenario A or Scenario B. O>> O>> In Scenario O, the IETF administrative support function would be O>> defined in a BCP that would be created via the IETF standards O>> process [RFC2026] and approved by the ISOC Board of Trustees. O>> This BCP would describe the scope of an IETF Administrative O>> Support Activity (IASA) and would define the structure and O>> responsibilities of the IETF Administrative Oversight Committee O>> (IAOC), an IETF-selected body responsible for overseeing the O>> IASA. Like the Internet Architecture Board (IAB), the IASA would O>> be housed within the ISOC legal umbrella. The BCP would also O>> describe ISOC's responsibilities within this scenario, including O>> requirements for financial accounting and transparency. A draft O>> of this BCP is included in the next section of this document. O>> O>> Scenario O allows us to establish IETF control over our O>> administrative support functions in terms of determining that O>> they meet the community's needs, and adjusting them from time to O>> time using IETF processes. At the same time, it does not require O>> that the IETF community determine, create and undertake the risks O>> associated with an appropriate corporate structure (with similar O>> financial infrastructure and tax-exempt status to ISOC's) in O>> order to solve the pressing administrative issues outlined in O>> [RFC3716]. This proposal also defines the boundaries of the IASA O>> so that it could be encapsulated and moved elsewhere at some O>> future date, should that ever be desirable. O>> O>> 2. Draft of Administrative Support BCP O>> O>> This section proposes draft text for a BCP that would define the O>> scope and structure of the IASA. Although this text would O>> require further refinement within the IETF community, this O>> section is intended to be clear and complete enough to allow the O>> community to reach a well-informed opinion regarding this O>> scenario. O>>\u0007\u0007\u0007O>> 2.1 Definition of the IETF Administrative Support Activity (IASA) O>> O>> The IETF undertakes its technical activities as an ongoing, open, O>> consensus-based process. The Internet Society has long been a O>> part of the IETF's standards process, and this document does not O>> affect the ISOC-IETF working relationship concerning standards O>> development or communication of technical advice. The purpose of O>> this memo is to define an administrative support activity that is O>> responsive to the IETF technical community's needs, as well as O>> consistent with ISOC's operational, financial and fiduciary O>> requirements while supporting the IETF technical activity. O>> O>> The IETF Administrative Support Activity (IASA) provides O>> administrative support for the technical work of the IETF. This O>> O>> includes, as appropriate, undertaking or contracting for the O>> work described in (currently, [RFC3716] but the eventual BCP O>> should include the detail as an appendix), covering IETF document O>> and data management, IETF meetings, any operational agreements or O>> contracts with the RFC Editor and IANA. This provides the O>> administrative backdrop required to support the IETF standards O>> process and to support the IETF organized technical activities, O>> including the IESG, IAB and working groups. This includes the O>> financial activities associated with such IETF support O>> (collecting IETF meeting fees, payment of invoices, appropriate O>> financial management, etc). The IASA is responsible for ensuring O>> that the IETF's administrative activities are done and done well; O>> it is not the expectation that the IASA will undertake the work O>> directly, but rather contract the work from others, and manage O>> the contractual relationships in line with key operating O>> principles such as efficiency, transparency and cost O>> effectiveness. O>> O>> The IASA is distinct from other IETF-related technical functions, O>> such as the RFC editor, the Internet Assigned Numbers Authority O>> (IANA), and the IETF standards process itself. The IASA is not O>> intended to have any influence on the technical decisions of the O>> IETF or on the technical contents of IETF work. O>> O>> 2.1.1 Structure of the IASA O>> O>> The IASA will be structured to allow accountability to the IETF O>> community. It will determine the ongoing success of the activity O>> in meeting IETF community needs laid out in this BCP, as well as O>> ISOC oversight of its financial and resource contributions. The O>> supervisory body defined for this will be called the IETF O>> Administrative Oversight Committee (IAOC). The IAOC will consist O>> of volunteers, all chosen directly or indirectly by the IETF\u0007\u0007\u0007O>> community, as well as appropriate ex officio appointments from O>> ISOC and IETF leadership. The IAOC will be accountable to the O>> IETF community for the effectiveness, efficiency and transparency O>> of the IASA. O>> O>> The IASA will initially consist of a single full-time employee of O>> ISOC, the IETF Administrative Director (IAD). The IAD will O>> require a variety of financial, legal and administrative support, O>> and it is expected that this support will be provided by ISOC O>> support staff following an expense and/or allocation model TBD. O>> O>> Although the IAD will be a full-time ISOC employee, he will work O>> under the direction of the IAOC. The IAD will be selected by a O>> committee of the IAOC, consisting minimally of the ISOC President O>> and the IETF Chair. This same committee will be responsible for O>> periodically reviewing the performance of the IAD and determining O>> any changes to his employment and compensation. In certain cases O>> (to be defined clearly -- chiefly cases where the ISOC employee O>> is determined to have contravened basic ISOC policies), the ISOC O>> President may make summary decisions, to be reviewed by the O>> hiring committee after the fact. O>> O>> The IAD will be responsible for administering the IETF finances, O>> managing a separate bank account for the IASA, and establishing O>> and administering the IASA budget. To perform these activities, O>> the IAD is expected to have signing authority comparable to other O>> ISOC director-level employees. Generally, expenses or agreements O>> outside that authority to be approved for financial soundness as O>> determined by ISOC policy. The joint expectation is that ISOC's O>> policies will be consistent with allowing the IAD to carry out O>> IASA work effectively and efficiently. Should the IAOC have O>> concerns about that, the IAOC and ISOC commit to working out O>> other policies that are mutually agreeable. O>> O>> The IAD will also fill the role of the IETF Executive Director, O>> as described in various IETF process BCPs. All other O>> administrative functions will be outsourced via well-defined O>> contracts. The IAD will be responsible for negotiating and O>> maintaining those contracts, as well as providing any O>> coordination that is necessary to make sure the IETF O>> administrative support functions are properly covered. O>> O>> 2.1.2 IAD Responsibilities O>> O>> The day to day responsibilities of the IAD will focus on managing O>> contracts with the entities providing the work supporting the O>> IETF technical activity. O>>\u0007\u0007\u0007O>> The IAD will provide regular (monthly and quarterly) reports to O>> the IAOC and ISOC. O>> O>> All contracts will be negotiated by the IAD (with input from any O>> other appropriate bodies), and reviewed by the IAOC. The O>> contracts will be executed by ISOC, on behalf of the IETF, after O>> whatever review ISOC requires (e.g., legal, Board of Trustees). O>> O>> The IAD will prepare an annual budget, which will be reviewed and O>> approved by the IAOC. The IAD will be responsible for presenting O>> this budget to the ISOC Board of Trustees, as part of ISOC's O>> annual financial planning process. The partnering is such that O>> the IAOC is responsible for ensuring the suitability of the O>> budget for meeting the IETF community's needs, but it does not O>> bear fiduciary responsibility; the ISOC board needs to review and O>> O>> understand the budget and planned activity in have enough detail O>> of the budget and proposed plans to properly carry out its O>> fiduciary responsibility. O>> O>> 2.1.3 IAOC Responsibilities O>> O>> The role of the IAOC is to provide appropriate input to the IAD, O>> and oversight of the IASA functioning. The IAOC is not expected O>> to be regularly engaged in IASA work, but rather to provide O>> appropriate approval and oversight. O>> O>> Therefore, the IAOC's responsibilities are: O>> O>> o Select the IAD, as described above. O>> O>> o Review the IAD's financial reports, and provide approval of O>> the IAD's budget proposals in terms of fitness for IETF O>> purposes. O>> O>> o Review IASA functioning with respect to meeting the IETF O>> community's working needs. O>> O>> The IAOC's role is to review, not carry out the work of, the IAD O>> and IASA. As such, it is expected the IAOC will have monthly O>> teleconferences and periodic face to face meetings, probably O>> coincident with IETF plenary meetings, consistent with ensuring O>> an efficient and effective operation. O>>\u0007\u0007\u0007O>> 2.1.4 IASA Funding O>> O>> The IASA is supported financially in 3 ways: O>> O>> 1. IETF meeting revenues. The IAD, in consultation with the O>> IAOC, sets the meeting fees as part of the budgeting process. O>> All meeting revenues go to the IASA. O>> O>> 2. Designated ISOC donations. The IETF and IASA do no specific O>> fund raising activities; this maintains separation between O>> fundraising and standards activities. Any organization O>> interested in supporting the IETF activity will continue to O>> be directed to ISOC, and any funds ISOC receives specifically O>> for IETF activities (as part of an ISOC program that allows O>> for specific designation) will be put in the IASA bank O>> account for IASA management. O>> O>> 3. Other ISOC support. ISOC will deposit in the IASA account, O>> each quarter, the funds committed to providing as part of the O>> IASA budget (where the meeting revenues and specific O>> O>> donations do not cover the budget). These funds may come O>> from member fees or from other revenue streams ISOC may O>> create. O>> O>> Note that the goal is to achieve and maintain a viable IETF O>> support function based on meeting fees and specified donations, O>> and the IAOC and ISOC are expected to work together to attain O>> that goal. (I.e., dropping the meeting fees to $0 and expecting O>> ISOC to pick up the slack is not desirable; nor is raising the O>> meeting fees to prohibitive levels to fund all non-meeting-O>> related activities!). O>> O>> Also, in normal operating circumstances, the IASA would look to O>> have a 6 month operating reserve for its activities. Rather than O>> having the IASA attempt to accrue that in its bank account, the O>> IASA looks to ISOC to build and provide that operational reserve O>> (through whatever mechanism instrument ISOC deems appropriate -- O>> line of credit, financial reserves, etc). Such reserves do not O>> appear instantaneously; the goal is to reach that level of O>> reserve by 3 years after the creation of the IASA. It is not O>> expected that any funds associated with such reserve will be held O>> in the IASA bank account. O>>\u0007\u0007\u0007O>> 2.2 IAOC Membership, Selection and Accountability O>> O>> Note: This section is particularly subject to change as we work O>> to find the best way to achieve the key principles. The key O>> principles being adhered to are that while this should be O>> reasonably separate from IETF Standards process management: O>> O>> o the IETF and IAB Chairs need to be involved to a level that O>> permits them to be involved in and oversee the aspects O>> pertinent to their roles in managing the technical work (e.g., O>> the IAB looks after the RFC Editor relationship) O>> O>> o the IETF and IAB Chairs must not be critical path to getting O>> decisions to and through the IASA. O>> O>> The current draft, below, therefore makes the IETF Chair ex O>> officio voting member of the IAOC, and the IAB Chair a non-voting O>> liaison. Future versions may change either or both, depending on O>> what makes sense to the IETF community in its deliberations. O>> O>> The IAOC will consist of seven voting members who will be O>> selected as follows: O>> O>> o 2 members chosen by the IETF Nominations Committee (NomCom) O>> O>> o 1 member chosen by the IESG O>> O>> o 1 member chosen by the IAB O>> O>> o 1 member chosen by the ISOC Board of Trustees O>> O>> o The IETF Chair (ex officio) O>> O>> o The ISOC President/CEO (ex officio) O>> O>> There will also be two non-voting, ex officio liaisons: O>> O>> o The IAB Chair O>> O>> o The IETF Administrative Director O>> O>> The voting members of the IAOC will choose their own chair each O>> year using a consensus mechanism of its choosing. Any appointed O>> voting member of the IAOC may serve as the IAOC Chair (i.e., not O>> the IETF Chair or the ISOC President/CEO). The role of the IAOC O>> Chair is to organize the IAOC. The IAOC Chair has no formal O>> duties for representing the IAOC, except as directed by IAOC O>> consensus.",
      "ja": "O >> L. Daigle O >> Verisign O >> M. Wasserman O >> ThingMagic O >> 2004年9月20日o >> o >> adminrestシナリオo：o >>インターネット社会の下にあるietf-directedアクティビティ（ISOC）法的傘o >> o >>抽象o >> o >>このドキュメントは、IETFの管理サポート活動（IASA）の構造o >>の代替提案を定義しています -  IETF-O >>ISOCリーガルo >>傘内で動作するアクティビティ。IETFコミュニティによって選択され、説明責任があるIETF管理o >>監視委員会（IAOC）の作成を提案します。この委員会は、IETF管理サポート活動の監視を提供します。これは、ISOCの法的傘内にo >>を収容します。コミュニティo >>がこのシナリオを適切に評価できるようにするために、BCPの文言ドラフトの一部が含まれています。o >> o >> 1.シナリオの概要o o >> o >> IETF管理o >> Carl Malamudのコンサルタントレポートで提示された再構築のコミュニティディスカッション[I-O >> D.Malamud-Consultant-Report]はo >> o >>そのo >>レポートに含まれていない潜在的に実行可能な代替手段の識別 -  IETF定義および指示された管理サポートo >> ISOCリーガル傘下にある機能（「IASA」o >>以下）。この新しいシナリオは、O >>元のISOCベースのシナリオ、シナリオAおよびBのプロパティを保持しています。ただし、このO >>新しいシナリオは、次のことを目的としています。>> o IETFがIETFコミュニティO >>ニーズの観点から管理活動を定義できる（そして時間の経過とともに洗練する）ことができる明確な根拠。o IETFに責任を負う運用監視委員会o >>コミュニティo >> o >> o IETF標準アクティビティとo >>標準作業の資金調達（ISOC内）o >> o >>o標準活動の適切なISOC監視資金o >> o >>このシナリオは「シナリオo」と呼ばれています。それは、o >>から派生していますが、完全に含まれていません、シナリオAまたはシナリオB. o >> o> o>>シナリオoでは、IETF管理サポート機能は、IETF標準o >>プロセス[RFC2026]を介して作成され、ISOC理事会によって承認されるBCPで定義されます。o >>このBCPは、IETF管理o o >>サポートアクティビティ（IASA）の範囲を記述し、IETF管理監視委員会o >>（IAOC）の構造とo >>責任を定義します。o >> iasaを監督するため。インターネットアーキテクチャボード（IAB）と同様に、IASAはISOCの法的傘に収容されます。また、BCPは、財務会計と透明性の要件を含む、このシナリオ内でのISOCの責任を説明します。このBCPのドラフトo >>は、このドキュメントの次のセクションに含まれています。o >> o >>シナリオo o o >> o >>がコミュニティのニーズを満たし、IETFプロセスを使用して時間からO >>時間に合わせて調整するという点で、O >>管理サポート機能をIETF制御することができます。同時に、IETFコミュニティが、O >>のリスクを決定、作成、および実施する必要はありません。>> O >> [RFC3716]で概説されている差し迫った管理上の問題を解決するため。この提案は、IASA o >>の境界も定義しているため、将来の日付でカプセル化して他の場所に移動できるようにします。o >> o >> 2.管理サポートのドラフトBCP o >> o >>このセクションでは、IASAのo >> scopeと構造を定義するBCPのドラフトテキストを提案します。このテキストはo >> IETFコミュニティ内でさらに洗練する必要がありますが、このo >>セクションは、O >>コミュニティがこのo >>シナリオに関して十分な情報に基づいた意見に到達できるように、明確かつ完全にすることを目的としています。o >> o >> 2.1 IETF管理サポートアクティビティ（IASA）o >> o >> IETFの定義は、継続的なオープン、O >>コンセンサスベースのプロセスとしての技術活動を実施しています。インターネット協会は長い間IETFの標準プロセスの一部であり、この文書は、標準o >>技術的アドバイスの開発またはコミュニケーションに関するISOC-IITFの協力関係に影響しません。O >>このメモの目的は、IETF技術コミュニティのニーズに対応するO >>の管理サポート活動を定義することと、IETFをサポートしながらISOCの運用、財務、受託者O >>要件と一致するO >>技術活動。o >> o >> IETF管理サポートアクティビティ（IASA）は、IETFの技術作業に対する管理サポートを提供します。このo >> o >>は、必要に応じて、（現在、[rfc3716]に記載されているo >>作業の実施または契約を含むが、最終的なbcp o >>には詳細をAとして含める必要があります。"
    },
    {
      "indent": 0,
      "text": "O>> O>> The members of the IAOC will typically serve two year terms. O>> Initially, the IESG and ISOC Board will make one-year O>> appointments, the IAB will make a two-year appointment, and the O>> Nomcom will make one one-year appointment and one two-year O>> appointment to establish a pattern where approximately half of O>> the IAOC is selected each term. O>> O>> The two NomCom selected members will be selected using the O>> procedures described in RFC 3777. For the initial selection, the O>> IESG will provide the list of desired qualifications for these O>> positions. In later years, this list will be provided by the O>> IAOC. O>> O>> While there are no hard rules regarding how the IAB and the IESG O>> should select members of the IAOC, it is not expected that they O>> will typically choose current IAB or IESG members, if only to O>> avoid overloading existing leadership. However, they should O>> choose people who are familiar with the administrative support O>> needs of the IAB, the IESG and/or the IETF standards process. It O>> is suggested that a fairly open process be followed for these O>> selections, perhaps with an open call for nominations and/or a O>> period of public comment on the candidates. The IAB and IESG are O>> encouraged to look at the procedure for IAB selection of ISOC O>> Trustees for an example of how this might work. O>> O>> Although the IAB and IESG will choose some members of the IAOC, O>> those members will not directly represent the bodies that chose O>> them. All members of the IAOC are accountable directly to the O>> IETF community. To receive direct feedback from the community, O>> the IAOC will hold an open meeting at least once per year at an O>> IETF meeting. This may take the form of an open IAOC plenary or O>> a working meeting held during an IETF meeting slot. The form and O>> contents of this meeting are left to the discretion of the IAOC O>> Chair. O>> O>> Decisions of IAOC members or the entire IAOC are subject to O>> appeal using the procedures described in RFC 2026. The initial O>> appeal of an individual decision will go to the full IAOC. O>> Appeals of IAOC decisions will go to the IESG and continue up the O>> chain as necessary (to the IAB and the ISOC Board). The IAOC O>> will play no role (aside from possible administrative support) in O>> appeals of WG Chair, IESG or IAB decisions. O>>\u0007\u0007\u0007O>> In the event that an IAOC member abrogates his duties or acts O>> against the bests interests of the IETF community, IAOC members O>> are subject to recall using the recall procedure defined in RFC O>> 3777. IAB and IESG-appointed members of the IAOC are not subject O>> to recall by their appointing bodies. O>> O>> 2.3 IASA Budget Process O>> O>> While the IASA sets a budget for the IETF's administrative needs, O>> its budget process clearly needs to be closely coordinated with O>> ISOC's. The specific timeline will be established each year, O>> before the second IETF meeting. A general annual timeline for O>> budgeting will be: O>> O>> July 1 The IAD presents a budget proposal (for the following O>> fiscal year, with 3 year projections) to the IAOC. O>> O>> August 1 The IAOC approves the budget proposal for IETF purposes, O>> after any appropriate revisions. As the ISOC President is O>> part of the IAOC, the IAOC should have a preliminary O>> indication of how the budget will fit with ISOC's own O>> budgetary expectations. The budget proposal is passed to the O>> ISOC Board of Trustees for review in accordance with their O>> fiduciary duty. O>> O>> September 1 The ISOC Board of Trustees approves the budget O>> proposal provisionally. During the next 2 months, the budget O>> may be revised to be integrated in ISOC's overall budgeting O>> process. O>> O>> O>> November 1 Final budget to the ISOC Board for approval. O>> O>> The IAD will provide monthly accountings of expenses, and will O>> update forecasts of expenditures quarterly. This may necessitate O>> the adjustment of the IASA budget. The revised budget will need O>> to be approved by the IAOC and ISOC Board of Trustees. O>> O>> 2.4 Relationship of the IAOC to Existing IETF Leadership O>> O>> The IAOC will be directly accountable to the IETF Community. O>> However, the nature of the IAOC's work will involve treating the O>> IESG and IAB as internal customers. The IAOC should not consider O>> its work successful unless the IESG and IAB are satisfied with O>> the administrative support that they are receiving. O>>\u0007\u0007\u0007O>> 2.5 ISOC Responsibilities for IASA O>> O>> Within ISOC, support for the IASA should be structured to meet O>> the following goals: O>> O>> Transparency: The IETF community should have complete visibility O>> into the financial and legal structure of the ISOC standards O>> activity. In particular, the IETF community should have access O>> to a detailed budget for the entire standards activity, O>> quarterly financial reports and audited annual financials. In O>> addition, key contract material and MOUs should be publicly O>> available. Most of these goals are already met by ISOC today. O>> The IAOC will be responsible for providing the IETF community O>> with regular overviews of the state of affairs. O>> O>> Unification: As part of this arrangement, ISOC's sponsorship of O>> the RFC Editor, IAB and IESG, as well as insurance coverage O>> for the IETF will be managed as part of the IASA under the O>> IAOC. O>> O>> Independence: The IASA should be financially and legally distinct O>> from other ISOC activities. IETF meeting fees should be O>> deposited in a separate IETF-specific bank account and used to O>> fund the IASA under the direction and oversight of the IAOC. O>> Any fees or payments collected from IETF meeting sponsors O>> should also be deposited into this account. This account will O>> be administered by the IAD and used to fund the IASA in O>> accordance with a budget and policies that are developed as O>> described above. O>> O>> Support: ISOC may, from time to time, choose to transfer other O>> funds into this account to fund IETF administrative projects O>> or to cover IETF meeting revenue shortfalls. There may also O>> O>> be cases where ISOC chooses to loan money to the IASA to help O>> with temporary cash flow issues. These cases should be O>> carefully documented and tracked on both sides. ISOC will O>> work to provide the 6 month operational reserve for IASA O>> functioning described above. O>> O>> Removability: While there is no current plan to transfer the O>> legal and financial home of the IASA to another corporation, O>> the IASA should be structured to enable a clean transition in O>> the event that the IETF community decides, through BCP O>> publication, that such a transition is required. In that O>> case, the IAOC will give ISOC a minimum six months notice O>> before the transition formally occurs. During that period, O>> the IAOC and ISOC will work together to create a smooth\u0007\u0007\u0007O>> transition that does not result in any significant service O>> outages or missed IETF meetings. All contracts that are O>> executed by ISOC as part of the IASA should either include a O>> clause allowing termination or transfer by ISOC with six O>> months notice, or should be transferrable to another O>> corporation in the event that the IASA is transitioned away O>> from ISOC in the future. Any accrued funds, and IETF-specific O>> intellectual property rights (concerning administrative data O>> and/ or tools) would also be expected to be transitioned to O>> any new entity, as well. O>> O>> Within the constraints outlined above, all other details of how O>> to structure this activity within ISOC (as a cost center, a O>> department or a formal subsidiary) should be determined by ISOC O>> in consultation with the IAOC. O>> O>> 3. Workplan for Formalizing the IETF Administrative Support O>> Activity O>> O>> This section proposes a workplan and schedule for formalizing the O>> IETF administrative support activity (IASA) for the remainder of O>> 2004 and 2005. O>> O>> 3.1 Workplan Goals O>> O>> This workplan is intended to satisfy four goals: O>> O>> o Satisfy the IETF's need for support functions through 2005, O>> with a careful transition that minimizes the risk of O>> substantial disruption to the IETF standards process. O>> O>> o Establish IETF community consensus and ISOC approval of a BCP O>> formalizing the IASA as described in this scenario before any O>> actions are taken that will have long term effects (hiring, O>> O>> contacts, etc.) O>> O>> o Make sure that decisions with long term impact, such as hiring O>> the IAD and establishing contracts for administrative support, O>> are made by people chosen for that purpose who will be O>> responsible to the community for the effectiveness of this O>> effort (the IAD and members of the IAOC) -- not by our already O>> overloaded technical leadership. O>> O>> o Within the above constraints, move as quickly as possible O>> towards a well-defined administrative support structure that O>> is transparent and accountable to the IETF community. O>>\u0007\u0007\u0007O>> 3.2 Workplan Overview O>> O>> There are three major elements to this workplan which can, to O>> some degree, take place in parallel after we establish IETF O>> community consensus to pursue Scenario O: O>> O>> o Finalizing the BCP text and getting it approved by the IETF O>> community and ISOC. O>> O>> o Selecting IASA leadership. This includes appointing an O>> interim IAOC, recruiting the IAD, and eventually appointing O>> the full IAOC. O>> O>> o Negotiating agreements with service providers. This includes O>> determining the structure and work flow of the IASA, deciding O>> which portions of the IASA should be staffed via an open O>> request for proposals (RFP) process, and issuing a RFP for O>> those portions, as well as establishing sole source contracts O>> or MOUs for other portions of the IASA. O>> O>> Each of the three items listed above is described in more detail O>> in the following sections. O>> O>> 3.3 Approval by the IETF Community and ISOC O>> O>> In scenario O, the IASA is formalized in a BCP that is approved O>> by the IETF community and accepted by the ISOC Board of Trustees. O>> There are three steps in this process: O>> O>> 1. Establishment of IETF community consensus that we should O>> pursue Scenario O as defined in a joint IAB/IESG O>> recommendation based on this proposal. This consensus will O>> be established through community discussion and a formal two-O>> week consensus call issued by the IETF chair on the IETF O>> mailing list. O>> O>> 2. Establishment of IETF community consensus on a BCP that O>> formalizes the IASA as described. This consensus would be O>> established through public discussion, a four week IETF Last O>> Call and IESG review and approval. O>> O>> 3. ISOC approval of the BCP and acceptance of ISOC's O>> responsibilities as described therein. This approval and O>> acceptance would be signified by an ISOC Board resolution. O>> O>> The timeline for these three stages is rather long, but there is O>> significant progress that can be made in other areas once we have O>> established IETF community consensus to pursue this scenario.",
      "ja": "o >> o >> IAOCのメンバーは通常、2年間の任期を提供します。o >>最初に、IESGとISOCボードは1年間のo >>任命を行い、IABは2年間の任命を行い、O >> nomcomは1年間の任命と1つの2年間のo>を行います。> o >> IAOCの約半分が各用語が選択されているパターンを確立するための任命。o >> o >> 2人のNOMCOM選択されたメンバーは、RFC 3777で説明されているO >>手順を使用して選択されます。最初の選択のために、O >> IESGはこれらのO >>ポジションの望ましい資格のリストを提供します。後年、このリストはO >> IAOCによって提供されます。o >> o >> IABとIESG O >>がIAOCのメンバーを選択する方法に関して難しいルールはありませんが、通常、現在のIABまたはIESGメンバーを選択することは予想されません。o >>既存のリーダーシップの過負荷を避けます。ただし、IAB、IESG、および/またはIETF標準プロセスの管理サポートに精通している人を選択する必要があります。これらのo >>選択のためのかなりオープンなプロセスに従うことが示唆されています。おそらく、候補者に対するノミネートの公開呼び出しおよび/またはo >>のパブリックコメントの期間があります。IABとIESGは、これがどのように機能するかの例については、IABのISOC O >>受託者の選択手順を検討することを奨励されています。o >> o >> IABとIESGはIAOCの一部のメンバーを選択しますが、O >>これらのメンバーはO >>を選択した体を直接表しません。IAOCのすべてのメンバーは、O >> IETFコミュニティに直接責任を負います。コミュニティから直接フィードバックを受け取るために、O >> IAOCは、O >> IETF会議で少なくとも年に1回はオープンミーティングを開催します。これにより、IETF会議スロット中に開催された開いたIAOCプレナリーまたはO >>の形式が得られる場合があります。この会議のフォームとo >>の内容は、IAOC o >>椅子の裁量に任されています。o >> o >> IAOCメンバーまたはIAOC全体の決定は、RFC 2026で説明されている手順を使用してO >>控訴の対象となります。O >> IAOCの決定の控訴は、IESGに送られ、必要に応じてo >>チェーンを継続します（IABおよびISOCボードに）。IAOC o >>は、WG議長、IESG、またはIABの決定の控訴で（可能な管理サポートを除いて）役割を果たしません。o >> o >> IAOCメンバーが自分の義務を廃止したり、IETFコミュニティの最善の利益に対して行為をしたりした場合、IAOCメンバーo >>>> 3777. IAOCのIABとIESGに任命されたメンバーは、任命された団体で想起する対象ではありません。o >> o >> 2.3 IASA予算プロセスo >> o >> IASAはIETFの管理ニーズの予算を設定していますが、O >>その予算プロセスは、O >> ISOCと密接に調整する必要があることは明らかに必要です。特定のタイムラインは、2回目のIETF会議の前に毎年確立されます。o >>予算編成の一般的な年間タイムラインは次のとおりです。o>> o >> 7月1日IADは、IAOCに予算提案（次のo >>会計年度、3年の予測）を提示します。o >> o >> 8月1日IAOCは、適切な改訂後、IETF目的で予算提案を承認します。ISOC社長はIAOCの一部であるため、IAOCは予備的なO >>予算がISOC独自のO >>予算の期待にどのように適合するかを示す必要があります。予算提案は、o >>受託者義務に従って審査のためにo >> ISOC評議員会に渡されます。o >> o >> 9月1日ISOC理事会は、予算を承認しますo >>提案を暫定的に。次の2か月間、予算o >>は、ISOCの全体的な予算編成o >>プロセスに統合されるように改訂される場合があります。o >> o >> o >> 11月1日承認のためにISOC委員会への最終予算。o >> o >> IADは毎月の費用のアカウントを提供し、o >>四半期ごとの支出の予測を更新します。これには、IASA予算の調整が必要になる場合があります。改訂された予算では、IAOCおよびISOC理事会によってO >>を承認する必要があります。o >> o >> 2.4 IAOCと既存のIETFリーダーシップとの関係o >> o >> IAOCは、IETFコミュニティに直接責任を負います。O >>ただし、IAOCの作業の性質には、O >> IESGとIABを内部顧客として扱うことが含まれます。IAOCは、IESGとIABが受け取っている管理サポートに満足していない限り、O >>の作業を成功させないでください。o >> o >> 2.5 IASAのISOC責任o >> o >> ISOC内で、IASAのサポートはO >>次の目標を満たすように構成する必要があります：o >> o >>透明性：IETFコミュニティISOC標準o >>アクティビティの財務および法的構造を完全に可視化する必要があります。特に、IETFコミュニティは、標準活動全体の詳細な予算にアクセスできるようにする必要があります。O >>追加で、キー契約資料とMous"
    },
    {
      "indent": 0,
      "text": "O>> O>> 3.4 Selecting IASA Leadership O>> O>> Once we have IETF consensus to pursue this scenario, we can O>> appoint an interim IAOC to begin working on the IASA transition. O>> The interim IAOC could do substantial work on non-binding tasks, O>> such as beginning the recruitment process for an IAD, determining O>> the structure of the IASA work, issuing RFPs and negotiating O>> potential agreements with service providers. The interim IAOC O>> would not be empowered to make binding agreements, but could work O>> appropriate consultants and advisors to make a lot of progress O>> towards determining the initial structure and work flow of the O>> IASA. O>> O>> Because the IETF Nominations Commitee (NomCom) process for new O>> positions will consume a lot of resources and take a long time to O>> complete, we propose that the interim IAOC consist of: O>> O>> o 1 IESG selected member O>> O>> o 1 IAB selected member O>> O>> o 1 ISOC selected member O>> O>> o The IETF Chair O>> O>> o The ISOC President/CEO O>> O>> The IAB chair will serve as a liaison, as described above. O>> O>> The IESG and ISOC Board appointments will be expected to serve O>> until the first IETF meeting of 2006, and the IAB appointment O>> will be expected to serve until the first IETF meeting of 2007, O>> assuming that the BCP is approved and the IAOC continues to have O>> appointed members from these bodies. O>> O>> O>> After all of the interim IAOC members are selected, they will O>> choose an interim IAOC chair from among the appointed members. O>> O>> When the BCP is approved, if the BCP indicates that there will be O>> NomCom selected IAOC members they will be chosen at that time. O>> Any adjustments to appointed members based on the BCP contents O>> will also be made at that time. The IAOC will transition from O>> interim to non-interim status when all non-interim members are O>> seated. A new, non-interim chair selection process will then O>> commence. O>>\u0007\u0007\u0007O>> 3.5 Recruiting the IETF Administrative Director O>> O>> The interim IAOC should appoint an IAD selection committee to O>> recruit and select the IETF Administrative Director. This O>> committee will consist entirely of IAOC members or liaisons, and O>> will, at minimum, include the IETF chair and the ISOC President. O>> If the IAOC chooses, this committee could include the entire O>> IAOC. O>> O>> The IAD selection committee should determine a job description O>> for the IAD, in consultation with other IETF leaders and the IETF O>> community. Once the job description is established, the IAD O>> selection committee should recruiting candidates for the O>> position. O>> O>> Although the interim IAOC is not empowered to hire the IAD as a O>> full-time employee, it might be possible for the IAOC to ask ISOC O>> to engage the potential IAD as a consultant to help with other O>> tasks during the interim period. O>> O>> 3.6 Establishing Agreement with Service Providers O>> O>> The most important activity of the IAOC during late 2004 and O>> early 2005 will be to determine the structure and work flow of O>> the IASA and to establish contracts or other agreements with O>> service providers to do the required work. This work includes O>> the following functions as defined in the consultant's report: O>> O>> o Technical infrastructure O>> O>> o Meeting management O>> O>> o Clerk's office O>> O>> o RFC Editor services to support IETF standards publication O>> O>> o IANA services to support IETF standards publication O>> O>> The interim IAOC should work with IETF leaders and other O>> knowledgeable members of the community to determine the structure O>> and work flow required for the IASA activity and make O>> corresponding adjustments to the above list, if necessary. The O>> interim IAOC can also identify which areas of IASA work should O>> continue to be provided by existing IETF service providers, and O>> work with those providers to establish proposed contracts or O>> agreements for later approval by the non-interim IAOC. The IAOC O>> can also choose to start an RFP process for any services that O>> they believe should be filled through an open RFP process.",
      "ja": "o >> o >> 3.4 IASAリーダーシップの選択o >> o >>このシナリオを追求するためのIETFコンセンサスがあったら、o >>暫定的なIAOCを任命して、IASA移行の作業を開始できます。o >>暫定的なIAOCは、IADの採用プロセスを開始し、o >> IASA作業の構造を決定し、RFPを発行し、O >>潜在的な契約を交渉するなど、非拘束力のないタスクでかなりの作業を行うことができます。サービスプロバイダー。暫定的なIAOC O >>は、拘束力のある契約を結ぶことはできませんが、O >> IASAの初期構造とワークフローの決定に向けて多くの進歩を遂げるために、適切なコンサルタントとアドバイザーが機能する可能性があります。o >> o >>新しいo >>ポジションのIETFノミネート（nomcom）プロセスは、多くのリソースを消費し、O >>を完了するまでに長い時間がかかるため、暫定IAOCは次のことを提案します。o >> o 1 iesg選択したメンバーo >> o >> o 1 iab選択メンバーo >> o >> o/CEO O >> O >> IAB椅子は、上記のようにリエゾンとして機能します。o >> o >> IESGおよびISOCボードの任命は、2006年の最初のIETF会議までo >>にサービスを提供すると予想されます。> BCPが承認され、IAOCがこれらの団体から任命されたメンバーを継続し続けていると仮定します。o >> o >> o >>すべての暫定IAOCメンバーが選択された後、任命されたメンバーの中で暫定的な椅子を選択します。o >> o >> BCPが承認された場合、BCPがo >> nomcomが選択したIAOCメンバーがあることを示す場合、その時点で選択されます。o >> BCPの内容に基づいた任命されたメンバーへの調整o >>もその時点で行われます。IAOCは、すべての非インタリムメンバーがo >>座っている場合、o >>暫定状態から非interimステータスに移行します。新しい、非インタリムの椅子選択プロセスが開始されます。o >> o >> 3.5 IETF管理ディレクターの採用o >> o >>暫定IAOCは、IETF管理ディレクターを募集して選択するためにIAD選択委員会を任命する必要があります。このo >>委員会は、完全にIAOCメンバーまたはリエゾンで構成され、O >>は少なくともIETF議長とISOC会長を含みます。O >> IAOCが選択した場合、この委員会にはO >> IAOC全体を含めることができます。o >> o >> IAD選択委員会は、他のIETFリーダーおよびIETF o >>コミュニティと協議して、IADの職務記述書o >>を決定する必要があります。職務記述書が確立されたら、IAD O >>選択委員会は、o >>ポジションの候補者を募集する必要があります。o >> o >>暫定IAOCはIADをO >>フルタイムの従業員として雇う権限を与えられていませんが、IAOCがISOC o >>に潜在的なIADをコンサルタントとして支援するように依頼することが可能かもしれません暫定期間中の他のo >>タスク。o >> o >> 3.6サービスプロバイダーとの合意の確立o >> o >> 2004年後半およびO >> 2005年初頭のIAOCの最も重要なアクティビティは、o >> IASAおよびIASAの構造とワークフローを決定することです。必要な作業を行うために、o >>サービスプロバイダーとの契約またはその他の契約を確立する。この作業には、コンサルタントのレポートで定義されている次の機能が含まれます。o>> o >> o技術インフラストラクチャo >> o >> o会議管理o >> o >> o書記官のオフィスo >> o >> oIETF標準の公開をサポートするためのRFCエディターサービスo >> o >> o iANAサービスIETF標準パブリケーションo >> o >> o >> IETFリーダーや他のo >>コミュニティの知識豊富なメンバーと協力して構造を決定する必要がありますO >>およびIASAアクティビティに必要なワークフローと、必要に応じて、上記のリストに対応する調整を行います。O >>暫定IAOCは、既存のIETFサービスプロバイダーによってo >>のどの領域が提供されるべきかを特定することもできます。非インタリムIAOC。IAOC o >>は、O >>オープンRFPプロセスを通じて記入する必要があると考えているサービスのRFPプロセスを開始することもできます。"
    },
    {
      "indent": 0,
      "text": "O>> O>> 3.7 Establishing a 2005 Operating Budget O>> O>> Because the ISOC 2005 budgeting process will be finalized before O>> the non-interim IAOC is seated, the interim IAOC should work with O>> the ISOC staff and President to establish a proposed 2005 O>> operating budget for the IASA. Since this will happen in advance O>> of full knowledge regarding the costs of 2005 operations, it may O>> be subject to significant adjustment later. O>> O>> 3.8 Proposed Schedule for IASA Transition O>> O>> As described above, the three stages of the IETF community and O>> ISOC approval process will take some time. If the community O>> chooses scenario O and we reach quick consensus on the details, O>> an optimistic schedule for this approval would be: O>> O>> 1. IETF discussion of this proposal and other scenarios through O>> 1-Oct-2005. IAB/IESG discusses this proposal with ISOC O>> Board. O>> O>> 2. IAB/IESG joint recommendation issued on 8-Oct-04, including O>> full BCP proposal. O>> O>> 3. Community discussion of the joint IAB/IESG recommendation O>> through 22-Oct-04. O>> O>> 4. Two-week community consensus call issued on the IETF list on O>> 23-Oct-04 regarding rough community consensus to pursue this O>> direction and appoint an interim IAOC -- extends through O>> IETF 61. IAOC selecting bodies begin search, based on O>> expected community consensus. O>> O>> 5. Rough community consensus declared on 8-Nov-04 to pursue O>> Scenario O and appoint the interim IAOC. O>> O>> 6. Interim IAOC seated on 15-Nov-04. Interim IAOC begins O>> interim work outlined above, including establishment of O>> O>> estimated 2005 budget and IAD recruitment. O>> O>> 7. BCP text discussed by community, IETF leadership and ISOC O>> Board until we have something that represents rough O>> community consensus that is acceptable to all. We hope that O>> this could be completed by 6-Dec-04. O>> O>> 8. Four week IETF Last Call issued for BCP on 6-Dec-04 -- O>> extends through 3-Jan-04.",
      "ja": "o >> o >> 3.7 2005年の運営予算の確立o >> o >> ISOC 2005予算編成プロセスはo >>非interim IAOCが着席する前に確定するため、暫定IAOCはo >> ISOCで動作するはずですIASAの2005年提案を設立するスタッフと社長。これは、2005年の運用のコストに関する完全な知識について事前に発生するため、後で重要な調整を受ける可能性があります。o >> o >> 3.8 IASA遷移の提案スケジュールo >> o >>上記のように、IETFコミュニティとo >> ISOC承認プロセスの3つの段階には時間がかかります。コミュニティo >>がシナリオoを選択し、詳細について迅速なコンセンサスに達する場合、o >>この承認の楽観的なスケジュールは次のとおりです。o>> o >> 1.この提案およびその他のシナリオのIETFの議論は、o >>2005年1月。IAB/IESGは、この提案についてISOC O >>ボードで説明します。o >> o >> 2. o >>完全なBCP提案を含む8-OCT-04で発行されたIAB/IESG共同推奨。o >> o >> 3.共同IAB/IESG推奨事項のコミュニティディスカッションo >> 22-OCT-04から。o >> o >> 4.このo >>この方向を追求し、暫定的なIAOCを任命するための大まかなコミュニティコンセンサスに関して、o >> 23-OCT-04のIETFリストで発行された2週間のコミュニティコンセンサスコール -  o>を介して拡張> IETF 61. IAOCは、o >>予想されるコミュニティコンセンサスに基づいて、検索を開始します。o >> o >> 5. o >>シナリオoを追求し、暫定的なIAOCを任命するために8 nov-04で宣言された大まかなコミュニティコンセンサス。o >> o >> 6. 04-Nov-04に座った暫定IAOC。暫定的なIAOCは、O >> O >>の設立を含む、上記で概説した暫定的な作業を開始します。o >> o >> 7.コミュニティ、IETFリーダーシップ、ISOC O >>ボードが議論したBCPテキストは、すべての人に受け入れられる大まかなO >>コミュニティコンセンサスを表すものがあります。O >>これが6-dec-04までに完了することを願っています。o >> o >> 8. 6-DEC-04でBCPに対して発行された4週間のIETF最後のコール-O >>は3-Jan-04まで拡張されます。"
    },
    {
      "indent": 0,
      "text": "O>>\nO>>    9.  Simultaneous IESG and ISOC Board approvals by 17-Jan-04.\nO>>\nO>>    10.  IAD officially hired in Jan 2005.\nO>>\nO>>    11.  NomCom seats IAOC members at the first IETF of 2005, moving\nO>>         the IAOC from interim to non-interim status.\nO>>\nO>>    12.  Formal agreements with all service providers in-place by\nO>>         June 2005.\nO>>\nO>> 4.  Security Considerations\nO>>\nO>>    This document describes a scenario for the structure of the\nO>>    IETF's administrative support activities.  It introduces no\nO>>    security considerations for the Internet.\nO>>\nO>> 5.  IANA Considerations\nO>>\nO>>    This document has no IANA considerations in the traditional\nO>>    sense. As part of the extended IETF family, though, IANA may be\nO>>    interested in the contents.\nO>>\nO>> 6.  Acknowledgements\nO>>\nO>>    Most of the ideas in this document are not new, and many of them\nO>>    did not originate with the authors.  This scenario represents a\nO>>    combination of ideas discussed within the IAB, the IESG and the\nO>>    IETF Community.\nO>>\nO>>    This document was written using the xml2rfc tool described in RFC\nO>>    2629 [RFC2629].\nO>>\nO>> 7.  References\nO>>\nO>> 7.1  Normative References\nO>>\nO>>    [I-D.malamud-consultant-report] Malamud, C., \"IETF Administrative\nO>>               Support Functions\", draft-malamud-consultant-report-01\nO>>\nO>>               (work in progress), September 2004.\nO>>\nO>>    [RFC2026]  Bradner, S., \"The Internet Standards Process --\nO>>               Revision 3\", BCP 9, RFC 2026, October 1996.\nO>>\nO>>    [RFC3716]  Advisory, IAB., \"The IETF in the Large: Administration\nO>>               and Execution\", RFC 3716, March 2004.\nO>>\nO>> 7.2  Informative References\nO>>\nO>>    [RFC2629]  Rose, M., \"Writing I-Ds and RFCs using XML\", RFC 2629,\nO>>               June 1999.\nO>>\nO>>    [RFC3667]  Bradner, S., \"IETF Rights in Contributions\", BCP 78,\nO>>               RFC 3667, February 2004.\nO>>\nO>>    [RFC3668]  Bradner, S., \"Intellectual Property Rights in IETF\nO>>               Technology\", BCP 79, RFC 3668, February 2004.\nO>>\nO>> Authors' Addresses\nO>>\nO>>    Leslie Daigle\nO>>    VeriSign\nO>>    EMail: leslie at verisignlabs.com, leslie at thinkingcat.com\nO>>\nO>>    Margaret Wasserman\nO>>    ThingMagic\nO>>    One Broadway, 14th Floor\nO>>    Cambridge, MA 02142 USA\nO>>\nO>>    Phone: +1 617 758-4177\nO>>    EMail: margaret at thingmagic.com\nO>>    URI: http://www.thingmagic.com\nInformative References",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[1] IAB Advisory Committee, \"The IETF in the Large: Administration and Execution\", RFC 3716, March 2004.",
      "ja": "[1] IAB諮問委員会、「大規模なIETF：管理と実行」、RFC 3716、2004年3月。"
    },
    {
      "indent": 3,
      "text": "[2] Malamud, C., \"IETF Administrative Support Functions\", Work in Progress, September 2004.",
      "ja": "[2] Malamud、C。、「IETF管理サポート機能」、2004年9月、進行中の作業。"
    },
    {
      "indent": 3,
      "text": "[3] <http://www.ietf.org/mail-archive/web/ietf/current/ msg31321.html>",
      "ja": "[3] <http://www.ietf.org/mail-archive/web/ietf/current/ msg31321.html>"
    },
    {
      "indent": 3,
      "text": "[4] <http://www.ietf.org/mail-archive/web/ietf/current/ msg31326.html>",
      "ja": "[4] <http://www.ietf.org/mail-archive/web/ietf/current/ msg31326.html>"
    },
    {
      "indent": 3,
      "text": "[5] <http://www.ietf.org/mail-archive/web/ietf/current/ msg31493.html>",
      "ja": "[5] <http://www.ietf.org/mail-archive/web/ietf/current/ msg31493.html>"
    },
    {
      "indent": 3,
      "text": "[6] <http://www.ietf.org/mail-archive/web/ietf/current/ msg31609.html>",
      "ja": "[6] <http://www.ietf.org/mail-archive/web/ietf/current/ msg31609.html>"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者の連絡先"
    },
    {
      "indent": 3,
      "text": "Scott Hollenbeck, Editor IAB and IESG",
      "ja": "Scott Hollenbeck、編集者IABおよびIESG"
    },
    {
      "indent": 3,
      "text": "EMail: sah@428cobrajet.net",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "ja": "Copyright（c）The Internet Society（2005）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "この文書は、BCP 78に含まれる権利、ライセンス、および制限の対象となり、そこに記載されている場合を除き、著者はすべての権利を保持しています。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "このドキュメントとここに含まれる情報は、「現状のまま」に基づいて提供されています。また、貢献者、彼/彼女が代表する組織（もしあれば）が後援する組織、インターネット協会とインターネット工学タスクフォースは、すべての保証、明示的または明示的、またはすべての保証を否認します。本書の情報の使用が、商品性または特定の目的に対する適合性の権利または黙示的な保証を侵害しないという保証を含むがこれらに限定されないことを含む。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、知的財産権またはその他の権利の有効性または範囲に関して、本書に記載されている技術の実装または使用、またはそのような権利に基づくライセンスに基づくライセンスの範囲に関連すると主張される可能性のある他の権利に関しては、立場を取得しません。利用可能になります。また、そのような権利を特定するために独立した努力をしたことも表明していません。RFCドキュメントの権利に関する手順に関する情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IETF事務局に行われたIPR開示のコピーと、利用可能にするライセンスの保証、またはこの仕様の実装者またはユーザーによるそのような独自の権利の使用のための一般的なライセンスまたは許可を取得するための試みの結果を取得できます。http://www.ietf.org/iprのIETFオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、関心のある当事者に、著作権、特許、または特許出願、またはこの基準を実装するために必要な技術をカバーする可能性のあるその他の独自の権利を注意深く招待するよう招待しています。ietf-ipr@ietf.orgのIETFへの情報をお問い合わせください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFCエディター機能の資金は現在、インターネット協会によって提供されています。"
    }
  ]
}