{
  "title": {
    "text": "RFC 4729 - A Uniform Resource Name (URN) Namespace for  the Near Field Communication (NFC) Forum",
    "ja": "RFC 4729 - 近距離フィールドコミュニケーション（NFC）フォーラムのためのユニフォームリソース名（URN）名前空間"
  },
  "number": 4729,
  "created_at": "2023-06-03 17:17:39.611550+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                            M. Abel\nRequest for Comments: 4729                                     NFC Forum\nCategory: Informational                                    November 2006",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 14,
      "text": "A Uniform Resource Name (URN) Namespace for the Near Field Communication (NFC) Forum",
      "ja": "近距離フィールドコミュニケーション（NFC）フォーラムのためのユニフォームリソース名（URN）名前空間"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモは、インターネットコミュニティに情報を提供します。いかなる種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The IETF Trust (2006).",
      "ja": "Copyright（c）The IETF Trust（2006）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document describes the Namespace Identifier (NID) for Uniform Resource Name (URN) resources published by the Near Field Communication (NFC) Forum. The NFC Forum defines and manages resources that utilize this URN identification model. Management activities for these and other resource types are provided by the NFC Forum Technical Committee.",
      "ja": "このドキュメントでは、近視場通信（NFC）フォーラムが発行したユニフォームリソース名（URN）リソースの名前空間識別子（NID）について説明します。NFCフォーラムは、このURN識別モデルを利用するリソースを定義および管理します。これらおよびその他のリソースタイプの管理活動は、NFCフォーラム技術委員会によって提供されます。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. URN Specification for \"nfc\" NID .................................2\n3. Examples ........................................................5\n4. Namespace Considerations ........................................5\n5. Community Considerations ........................................5\n6. Security Considerations .........................................6\n7. IANA Considerations .............................................6\n8. Informative References ..........................................6\nAcknowledgments ....................................................6",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The NFC Forum is a specification development body developing technologies related to near-field communications. This activity is supported by a membership comprised of chip vendors, smart card vendors, equipment vendors, software developers, finance and banking service providers, content providers, and other interested companies.",
      "ja": "NFCフォーラムは、近距離の通信に関連する仕様開発機関を開発する技術を開発するものです。このアクティビティは、チップベンダー、スマートカードベンダー、機器ベンダー、ソフトウェア開発者、金融および銀行サービスプロバイダー、コンテンツプロバイダー、その他の利害関係者で構成されるメンバーシップによってサポートされています。"
    },
    {
      "indent": 3,
      "text": "Some of the technologies being developed by the NFC Forum need namespaces that are managed so that they are unique and persistent. To ensure that the uniqueness is absolute, the registration of a specific NID for use by the NFC Forum was deemed appropriate. Therefore, a full and complete registration will follow the namespace specification process as defined in [RFC3406].",
      "ja": "NFCフォーラムによって開発されているテクノロジーのいくつかは、ユニークで永続的なように管理される名前空間が必要です。一意性が絶対的であることを確認するために、NFCフォーラムで使用するための特定のNIDの登録が適切であると見なされました。したがって、完全かつ完全な登録は、[RFC3406]で定義されている名前空間仕様プロセスに従います。"
    },
    {
      "indent": 0,
      "text": "2. URN Specification for \"nfc\" NID",
      "section_title": true,
      "ja": "2. 「NFC」NIDのURN仕様"
    },
    {
      "indent": 3,
      "text": "Namespace ID:",
      "ja": "名前空間ID："
    },
    {
      "indent": 6,
      "text": "nfc",
      "ja": "NFC"
    },
    {
      "indent": 3,
      "text": "Registration Information:",
      "ja": "登録情報："
    },
    {
      "indent": 6,
      "text": "Registration version number: 1 Registration date: 2006-05-17",
      "ja": "登録バージョン番号：1登録日：2006-05-17"
    },
    {
      "indent": 3,
      "text": "Declared registrant of the namespace:",
      "ja": ""
    },
    {
      "indent": 6,
      "text": "Registering organization Name: Near Field Communication Forum, Inc. Address: 401 Edgewater Place, Suite 600 Wakefield, MA 01880",
      "ja": "登録組織名：近いフィールドコミュニケーションフォーラム、Inc。"
    },
    {
      "indent": 6,
      "text": "Designated contact Role: Technical Program Manager Email: TPM@nfc-forum.org",
      "ja": "指定された連絡先の役割：テクニカルプログラムマネージャーメール：tpm@nfc-forum.org"
    },
    {
      "indent": 3,
      "text": "Declaration of syntactic structure:",
      "ja": "構文構造の宣言："
    },
    {
      "indent": 6,
      "text": "The Namespace Specific String (NSS) of all URNs that use the \"nfc\" NID will have the following structure:",
      "ja": "「NFC」NIDを使用するすべてのURNの名前空間固有の文字列（NSS）には、次の構造があります。"
    },
    {
      "indent": 6,
      "text": "urn:nfc:{NFCresource}:{ResourceSpecificString}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "Where the \"{NFCresource}\" is a US-ASCII string that conforms to the URN syntax requirements [RFC2141] and defines a specific class of resource. Each resource class has a specific labeling scheme that is covered by \"{ResourceSpecificString}\" which also conforms to the naming requirements of [RFC2141].",
      "ja": "「{nfcresource}」は、URN構文要件[RFC2141]に適合し、特定のクラスのリソースを定義するUS-ASCII文字列です。各リソースクラスには、[RFC2141]の命名要件にも適合する「{resourcespecificstring}」でカバーされる特定のラベル付けスキームがあります。"
    },
    {
      "indent": 6,
      "text": "NFC Forum working groups will manage the assignment of NFC resources and the specific registration values assigned for each resource class. The Technical Committee will coordinate creation of new resource class assignments based on community need.",
      "ja": "NFCフォーラムワーキンググループは、NFCリソースの割り当てと、各リソースクラスに割り当てられた特定の登録値を管理します。技術委員会は、コミュニティのニーズに基づいて、新しいリソースクラスの割り当ての作成を調整します。"
    },
    {
      "indent": 3,
      "text": "Relevant ancillary documentation:",
      "ja": "関連する補助文書："
    },
    {
      "indent": 6,
      "text": "The NFC Forum publishes specifications describing the use of near-field communication for interoperable exchange of information between devices in close proximity. Among these specifications are the designation of new data types, schema, XML elements and attributes, protocols, and other formally named items intended for machine parsing. Interested parties are referred to the NFC Forum web site where these publications will be made available to the community:",
      "ja": "NFCフォーラムは、近接してデバイス間の情報交換のための近距離フィールド通信の使用を説明する仕様を公開しています。これらの仕様には、新しいデータ型、スキーマ、XML要素と属性、プロトコル、およびマシンの解析を目的としたその他の正式に指定されたアイテムの指定があります。利害関係者は、これらの出版物がコミュニティが利用できるようになるNFCフォーラムのWebサイトに紹介されます。"
    },
    {
      "indent": 6,
      "text": "http://www.nfc-forum.org/",
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Identifier uniqueness considerations:",
      "ja": "識別子の一意性の考慮事項："
    },
    {
      "indent": 6,
      "text": "The NFC Forum working groups and Technical Committee will ensure uniqueness of resource names assigned by the NFC Forum within the resource classes for which they are responsible.",
      "ja": "NFCフォーラムワーキンググループおよび技術委員会は、責任を負うリソースクラス内のNFCフォーラムによって割り当てられたリソース名の独自性を確保します。"
    },
    {
      "indent": 6,
      "text": "When authority and responsibility for assignment of names with a resource class are delegated to an external organization, commitment to adhere to the uniqueness requirements of the assigned resource names will be a pre-condition of such delegation.",
      "ja": "リソースクラスを持つ名前の割り当てに対する権限と責任が外部組織に委任される場合、割り当てられたリソース名の一意性要件を遵守するというコミットメントは、そのような委任の事前条件になります。"
    },
    {
      "indent": 6,
      "text": "The structure of the NFC Forum namespace into resource classes will further ensure isolation of names in each class from names in other classes.",
      "ja": "NFCフォーラムの名前空間のリソースクラスへの構造により、他のクラスの名前から各クラスの名前の分離がさらに保証されます。"
    },
    {
      "indent": 6,
      "text": "It is anticipated that some resource classes may be open to self-assignment by any interested individual or organization. To ensure a degree of uniqueness for these self-assigned resource names, fully-qualified domain names will be factored into the name to distinguish the naming authorities.",
      "ja": "一部のリソースクラスは、関心のある個人または組織が自己割り当てすることに開かれている可能性があります。これらの自己割り当てされたリソース名のある程度の独自性を確保するために、命名当局を区別するために、完全に資格のあるドメイン名が名前に倒されます。"
    },
    {
      "indent": 6,
      "text": "It should be understood that due to the flexibility of the domain name system and the underlying market-based forces that allow for ownership transfer and abandonment of domain names, no guarantee of long-term uniqueness or persistence can be made for this class of resource names beyond that made for the domain names themselves.",
      "ja": "ドメイン名システムの柔軟性と、ドメイン名の所有権の移転と放棄を可能にする基礎となる市場ベースの力により、このクラスのリソース名に対して長期的な独自性や持続性の保証はできないことを理解する必要があります。それを超えて、ドメイン名自体のために作られました。"
    },
    {
      "indent": 3,
      "text": "Identifier persistence considerations:",
      "ja": "識別子の持続性の考慮事項："
    },
    {
      "indent": 6,
      "text": "The NFC Forum will not reassign names and will thus guarantee the persistence of names beyond the expected lifetime of the named resource. NFC Forum does not anticipate operating a name resolution service for the assigned names and does not anticipate any other usability issues of the assigned names beyond those for any other naturally aging technology.",
      "ja": "NFCフォーラムは名前を再割り当てしないため、指定されたリソースの予想される寿命を超えて名前の永続性を保証します。NFCフォーラムは、割り当てられた名前の名前解像度サービスを操作することを予想せず、他の自然な高齢化テクノロジーのものを超えて、割り当てられた名前の他のユーザビリティの問題を予測していません。"
    },
    {
      "indent": 3,
      "text": "Process of identifier assignment:",
      "ja": "識別子割り当てのプロセス："
    },
    {
      "indent": 6,
      "text": "The NFC Forum will provide procedures for registration of each class of resource that it maintains. Each such resource may have three types of registration activities:",
      "ja": "NFCフォーラムは、維持されている各クラスのリソースの登録の手順を提供します。このようなリソースには、3種類の登録アクティビティがあります。"
    },
    {
      "indent": 6,
      "text": "1) Registered names associated with NFC Forum specifications or services; 2) Registration of names or resource classes for other entities; 3) Name models for use in experimental purposes.",
      "ja": "1) NFCフォーラムの仕様またはサービスに関連付けられた登録名。2）他のエンティティの名前またはリソースクラスの登録。3）実験目的で使用するモデルに名前を付けます。"
    },
    {
      "indent": 3,
      "text": "Process for identifier resolution:",
      "ja": "識別子解像度のプロセス："
    },
    {
      "indent": 6,
      "text": "The namespace is not listed with a Resolution Discovery System (RDS); this is not relevant.",
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Rules for Lexical Equivalence:",
      "ja": "語彙の等価性のルール："
    },
    {
      "indent": 6,
      "text": "No special considerations; the rules for lexical equivalence of [RFC2141] apply.",
      "ja": "特別な考慮事項はありません。[RFC2141]の語彙等価性のルールが適用されます。"
    },
    {
      "indent": 3,
      "text": "Conformance with URN Syntax:",
      "ja": "urn構文への適合："
    },
    {
      "indent": 6,
      "text": "No special considerations.",
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Validation mechanism:",
      "ja": "検証メカニズム："
    },
    {
      "indent": 6,
      "text": "None specified. URN assignment and registration will be handled by procedures implemented in support of NFC Forum activities.",
      "ja": "何も指定されていません。URNの割り当てと登録は、NFCフォーラム活動をサポートするために実装された手順によって処理されます。"
    },
    {
      "indent": 3,
      "text": "Scope:",
      "ja": "範囲："
    },
    {
      "indent": 6,
      "text": "Global",
      "ja": "グローバル"
    },
    {
      "indent": 0,
      "text": "3. Examples",
      "section_title": true,
      "ja": "3. 例"
    },
    {
      "indent": 3,
      "text": "The following examples are representative URNs that could be assigned by the NFC Forum. They may not be the actual strings that would be assigned:",
      "ja": "次の例は、NFCフォーラムで割り当てることができる代表的なURNです。それらは、割り当てられる実際の文字列ではないかもしれません："
    },
    {
      "indent": 6,
      "text": "urn:nfc:wkt:Uri Defines the well-known type identifier used to identify URI bookmark data objects defined by the NFC Forum and exchanged by NFC devices.",
      "ja": "URN：NFC：WKT：URIは、NFCフォーラムによって定義され、NFCデバイスによって交換されるURIブックマークデータオブジェクトを識別するために使用されるよく知られている型識別子を定義します。"
    },
    {
      "indent": 6,
      "text": "urn:nfc:schema:manifest Declares an XML namespace for elements and attributes, used in an XML schema to describe an NFC Forum data transfer manifest.",
      "ja": "URN：NFC：スキーマ：MANIFESTは、NFCフォーラムデータ転送マニフェストを説明するためにXMLスキーマで使用される要素と属性のXMLネームスペースを宣言します。"
    },
    {
      "indent": 0,
      "text": "4. Namespace Considerations",
      "section_title": true,
      "ja": "4. 名前空間の考慮事項"
    },
    {
      "indent": 3,
      "text": "The NFC Forum is developing a variety of communication protocol and data exchange specifications. Some of these specifications depend upon supporting information (e.g., data descriptions, attributes, schema, etc.) to be fully specified. For proper operation, descriptions of the needed supporting information must exist and be available in a unique, reliable, and persistent manner. These dependencies provide the basis of need for namespaces, in one form or another.",
      "ja": "NFCフォーラムは、さまざまな通信プロトコルとデータ交換の仕様を開発しています。これらの仕様の一部は、完全に指定される情報（データの説明、属性、スキーマなど）のサポート情報（例：データの説明、属性、スキーマなど）に依存します。適切な操作のために、必要なサポート情報の説明が存在する必要があり、ユニークで信頼性が高く、持続的な方法で利用可能でなければなりません。これらの依存関係は、何らかの形で名前空間の必要性の基礎を提供します。"
    },
    {
      "indent": 3,
      "text": "As type information is relayed across NFC Forum protocols, the need for compact, machine-parsed type identification of data and meta-content, with the attributes of uniqueness and reliability mentioned above, becomes imperative for proper interoperation across widely varied implementations.",
      "ja": "タイプ情報がNFCフォーラムプロトコル全体で中継されるため、上記の独自性と信頼性の属性を使用して、コンパクトな機械型データとメタコンテンツの識別の必要性が、広く変化する実装全体で適切な相互操作に不可欠になります。"
    },
    {
      "indent": 3,
      "text": "As the NFC Forum work is ongoing and covers many technical areas, the possibility of using various other namespace repositories has been deemed impractical. Each data object, description, or schema as defined in the NFC Forum could possibly be related to multiple different other namespaces, so further conflicts of association might occur. Thus, the intent is to utilize the requested URN namespace to manage NFC Forum-defined objects, descriptions, and schema.",
      "ja": "NFCフォーラムの作業は進行中であり、多くの技術分野をカバーしているため、他のさまざまな名前空間リポジトリを使用する可能性は非現実的であると考えられています。NFCフォーラムで定義されている各データオブジェクト、説明、またはスキーマは、複数の異なる他の名前空間に関連している可能性があるため、さらなる矛盾が発生する可能性があります。したがって、目的は、要求されたURNネームスペースを利用して、NFCフォーラム定義のオブジェクト、説明、およびスキーマを管理することです。"
    },
    {
      "indent": 0,
      "text": "5. Community Considerations",
      "section_title": true,
      "ja": "5. コミュニティの考慮事項"
    },
    {
      "indent": 3,
      "text": "The objects and descriptions required for specifications produced and published by the NFC Forum are generally available for use by other organizations. The NFC Forum will provide access and support for name requests by these external organizations. This support can be enabled in a timely and responsive fashion as new objects and descriptions are produced.",
      "ja": "NFCフォーラムによって作成および公開された仕様に必要なオブジェクトと説明は、一般に他の組織で使用できます。NFCフォーラムは、これらの外部組織による名前の要求へのアクセスとサポートを提供します。このサポートは、新しいオブジェクトと説明が作成されるため、タイムリーで応答性の高い方法で有効にできます。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "There are no additional security considerations other than those normally associated with the use and resolution of URNs in general.",
      "ja": "一般的にurの使用と解像度に通常関連するもの以外に、追加のセキュリティ上の考慮事項はありません。"
    },
    {
      "indent": 0,
      "text": "7. IANA Considerations",
      "section_title": true,
      "ja": "7. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "The requested NID (nfc) has been entered into the IANA registry for URN NIDs.",
      "ja": "要求されたNID（NFC）は、URN NIDのIANAレジストリに入力されました。"
    },
    {
      "indent": 0,
      "text": "8. Informative References",
      "section_title": true,
      "ja": "8. 参考引用"
    },
    {
      "indent": 3,
      "text": "[RFC2141] Moats, R., \"URN Syntax\", RFC 2141, May 1997.",
      "ja": "[RFC2141] Moats、R。、「Urn Syntax」、RFC 2141、1997年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC3406] Daigle, L., van Gulik, D., Iannella, R., and P. Faltstrom, \"Uniform Resource Names (URN) Namespace Definition Mechanisms\", BCP 66, RFC 3406, October 2002.",
      "ja": "[RFC3406] Daigle、L.、Van Gulik、D.、Iannella、R。、およびP. Faltstrom、「ユニフォームリソース名（URN）名前空間定義メカニズム」、BCP 66、RFC 3406、2002年10月。"
    },
    {
      "indent": 0,
      "text": "Acknowledgments",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "The author wishes to express thanks to Dwight Smith (Motorola) for his guidance on the URN registration process and for providing, by example, a registration that was worthy of emulation.",
      "ja": "著者は、URN登録プロセスに関するガイダンスと、たとえば、エミュレーションに値する登録を提供してくれたドワイトスミス（モトローラ）に感謝したいと考えています。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者の連絡先"
    },
    {
      "indent": 3,
      "text": "Miller Abel Technical Committee Delegate, NFC Forum Microsoft Corporation One Microsoft Way Redmond, WA 98052",
      "ja": "Miller Abel Technical Committee Delegate、NFC Forum Microsoft Corporation One Microsoft Way Redmond、WA 98052"
    },
    {
      "indent": 3,
      "text": "EMail: TPM@nfc-forum.org",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The IETF Trust (2006).",
      "ja": "Copyright（c）The IETF Trust（2006）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "この文書は、BCP 78に含まれる権利、ライセンス、および制限の対象となり、そこに記載されている場合を除き、著者はすべての権利を保持しています。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE IETF TRUST, AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "このドキュメントとここに含まれる情報は、「現状」に基づいて提供され、貢献者、彼/彼女が代表する組織（もしあれば）、インターネット協会、IETFトラスト、インターネットエンジニアリングタスクフォースは免責明示的または暗示されたすべての保証。ここでの情報の使用が、商品性または特定の目的に対する適合性の権利または黙示的な保証を侵害しないという保証を含むがこれらに限定されない。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、知的財産権またはその他の権利の有効性または範囲に関して、この文書に記載されている技術の実装または使用、またはそのような権利に基づくライセンスがどの程度であるかについての使用に関連すると主張する可能性があるという立場はありません。利用可能になります。また、そのような権利を特定するために独立した努力をしたことも表明していません。RFCドキュメントの権利に関する手順に関する情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IETF事務局に行われたIPR開示のコピーと、利用可能にするライセンスの保証、またはこの仕様の実装者またはユーザーによるそのような独自の権利の使用のための一般的なライセンスまたは許可を取得するための試みの結果を取得できます。http://www.ietf.org/iprのIETFオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、関心のある当事者に、著作権、特許、または特許出願、またはこの基準を実装するために必要なテクノロジーをカバーする可能性のあるその他の独自の権利を注意深く招待します。ietf-ipr@ietf.orgのIETFへの情報をお問い合わせください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFCエディター機能の資金は現在、インターネット協会によって提供されています。"
    }
  ]
}