{
  "title": {
    "text": "RFC 4056 - Use of the RSASSA-PSS Signature Algorithm in Cryptographic Message Syntax (CMS)",
    "ja": "RFC 4056 - 暗号メッセージ構文（CMS）でのRSASSA-PSS署名アルゴリズムの使用"
  },
  "number": 4056,
  "created_at": "2019-10-19 09:39:27.823239+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                          J. Schaad\nRequest for Comments: 4056                       Soaring Hawk Consulting\nCategory: Standards Track                                      June 2005",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 15,
      "text": "Use of the RSASSA-PSS Signature Algorithm\n  in Cryptographic Message Syntax (CMS)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "ja": "著作権（C）インターネット協会（2005）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document specifies the conventions for using the RSASSA-PSS (RSA Probabilistic Signature Scheme) digital signature algorithm with the Cryptographic Message Syntax (CMS).",
      "ja": "この文書は、暗号メッセージ構文（CMS）とRSASSA-PSS（RSA確率署名方式）のデジタル署名アルゴリズムを使用するための規則を指定します。"
    },
    {
      "indent": 0,
      "text": "1. Overview",
      "section_title": true,
      "ja": "1。概要"
    },
    {
      "indent": 3,
      "text": "This document specifies the conventions for using the RSA Probabilistic Signature Scheme (RSASSA-PSS) [P1v2.1] digital signature algorithm with the Cryptographic Message Syntax [CMS] signed-data content type.",
      "ja": "この文書では、RSA確率署名方式（RSASSA-PSS）暗号メッセージ構文[CMS]署名されたデータのコンテンツタイプの[P1v2.1デジタル署名アルゴリズムを使用するための規則を指定します。"
    },
    {
      "indent": 3,
      "text": "CMS values are generated using ASN.1 [X.208-88], using the Basic Encoding Rules (BER) [X.209-88] and the Distinguished Encoding Rules (DER) [X.509-88].",
      "ja": "CMS値は、基本符号化規則（BER）[X.209-88]と識別符号化規則（DER）[X.509-88]を使用して、ASN.1 [X.208-88]を用いて生成されます。"
    },
    {
      "indent": 3,
      "text": "This document is written to be used in conjunction with RFC 4055 [RSA-ALGS]. All of the ASN.1 structures referenced in this document are defined in RFC 4055.",
      "ja": "この文書は、RFC 4055 [RSA-のALG]と組み合わせて使用​​するように書かれています。このドキュメントで参照ASN.1構造の全ては、RFC 4055で定義されています。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [STDWORDS].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はありますRFC 2119 [STDWORDS]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "1.1. PSS Algorithm",
      "section_title": true,
      "ja": "1.1。 PSSアルゴリズム"
    },
    {
      "indent": 3,
      "text": "Although there are no known defects with the PKCS #1 v1.5 [P1v1.5] signature algorithm, RSASSA-PSS [P1v2.1] was developed in an effort to have more mathematically provable security. PKCS #1 v1.5 signatures were developed in an ad hoc manner; RSASSA-PSS was developed based on mathematical foundations.",
      "ja": "PKCS＃1 V1.5 [P1v1.5]署名アルゴリズムと既知の欠陥が存在しないが、RSASSA-PSS [P1v2.1】より数学的に証明可能なセキュリティを持ってしようとして開発されました。 PKCS＃1 V1.5署名はアドホックな方法で開発されました。 RSASSA-PSSは、数学的基礎に基づいて開発されました。"
    },
    {
      "indent": 0,
      "text": "2. Algorithm Identifiers and Parameters",
      "section_title": true,
      "ja": "2.アルゴリズムの識別子とパラメータ"
    },
    {
      "indent": 0,
      "text": "2.1. Certificate Identifiers",
      "section_title": true,
      "ja": "2.1。証明書の識別子"
    },
    {
      "indent": 3,
      "text": "The RSASSA-PSS signature algorithm is defined in RFC 3447 [P1v2.1]. Conventions for encoding the public key are defined in RFC 4055 [RSA-ALGS].",
      "ja": "RSASSA-PSS署名アルゴリズムは、RFC 3447 [P1v2.1]で定義されています。公開鍵を符号化するための規則は、RFC 4055 [RSA-のALG]で定義されています。"
    },
    {
      "indent": 3,
      "text": "Two algorithm identifiers for RSA subject public keys in certificates are used. These are:",
      "ja": "RSAの主題のための二つのアルゴリズム識別子は、証明書内の公開鍵が使用されています。これらは："
    },
    {
      "indent": 6,
      "text": "rsaEncryption OBJECT IDENTIFIER ::= { pkcs-1 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "and",
      "ja": "そして"
    },
    {
      "indent": 6,
      "text": "id-RSASSA-PSS OBJECT IDENTIFIER ::= { pkcs-1 10 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "When the rsaEncryption algorithm identifier is used for a public key, the AlgorithmIdentifier parameters field MUST contain NULL. Complete details can be found in [RSA-ALGS].",
      "ja": "rsaEncryptionアルゴリズム識別子は、公開鍵を使用した場合、AlgorithmIdentifierパラメタ分野はNULLを含まなければなりません。完全な詳細は、[RSA-のALG]で見つけることができます。"
    },
    {
      "indent": 3,
      "text": "When the id-RSASSA-PSS algorithm identifier is used for a public key, the AlgorithmIdentifier parameters field MUST either be absent or contain RSASSA-PSS-params. Again, complete details can be found in [RSA-ALGS].",
      "ja": "ID-RSASSA-PSSアルゴリズム識別子が公開鍵のために使用されるとき、AlgorithmIdentifierパラメタ分野は存在しないか、RSASSA-PSS-paramsはを含む必要があります。ここでも、完全な詳細は、[RSA-のALG]で見つけることができます。"
    },
    {
      "indent": 3,
      "text": "In both cases, the RSA public key, which is composed of a modulus and a public exponent, MUST be encoded using the RSAPublicKey type. The output of this encoding is carried in the certificate subject public key.",
      "ja": "両方の場合において、弾性率および公開指数で構成されているRSA公開鍵は、のRSAPublicKeyタイプを用いて符号化されなければなりません。このエンコーディングの出力は、証明書のサブジェクトの公開鍵で運ばれます。"
    },
    {
      "indent": 9,
      "text": "RSAPublicKey ::= SEQUENCE {\n   modulus INTEGER, -- n\n   publicExponent INTEGER } -- e",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "2.2. Signature Identifiers",
      "section_title": true,
      "ja": "2.2。署名の識別子"
    },
    {
      "indent": 3,
      "text": "The algorithm identifier for RSASAA-PSS signatures is:",
      "ja": "RSASAA-PSS署名アルゴリズムの識別子です。"
    },
    {
      "indent": 6,
      "text": "id-RSASSA-PSS OBJECT IDENTIFIER ::= {pkcs-1 10 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "When the id-RSASSA-PSS algorithm identifier is used for a signature, the AlgorithmIdentifier parameters field MUST contain RSASSA-PSS-params. Information about RSASSA-PSS-params can be found in [RSA-ALGS].",
      "ja": "ID-RSASSA-PSSアルゴリズム識別子を署名するために使用されるとき、AlgorithmIdentifierパラメタ分野はRSASSA-PSS-paramsはを含まなければなりません。 RSASSA-PSS-のparamsに関する情報は、[RSA-のALG]で見つけることができます。"
    },
    {
      "indent": 3,
      "text": "When signing, the RSA algorithm generates a single value, and that value is used directly as the signature value.",
      "ja": "署名するとき、RSAアルゴリズムは、単一の値を生成し、その値を署名値として直接使用されます。"
    },
    {
      "indent": 0,
      "text": "3. Signed-data Conventions",
      "section_title": true,
      "ja": "3.署名データの表記"
    },
    {
      "indent": 3,
      "text": "digestAlgorithms SHOULD contain the one-way hash function used to compute the message digest on the eContent value.",
      "ja": "digestAlgorithmsは、e-コンテンツの値にメッセージダイジェストを計算するために使用される一方向ハッシュ関数を含むべきです。"
    },
    {
      "indent": 3,
      "text": "The same one-way hash function SHOULD be used for computing the message digest on both the eContent and the signedAttributes value if signedAttributes exist.",
      "ja": "同一方向ハッシュ関数は、メッセージsignedAttributesの存在する場合e-コンテンツとsignedAttributesの値の両方にダイジェストを計算するために使用されるべきです。"
    },
    {
      "indent": 3,
      "text": "The same one-way hash function MUST be used for computing the message digest on the signedAttributes and as the hashAlgorithm in the RSA-PSS-params structure.",
      "ja": "同一方向ハッシュ関数は、メッセージRSA-PSS-paramsは構造内signedAttributesの上及びhashAlgorithmとしてダイジェストを計算するために使用されなければなりません。"
    },
    {
      "indent": 3,
      "text": "signatureAlgorithm MUST contain id-RSASSA-PSS. The algorithm parameters field MUST contain RSASSA-PSS-params.",
      "ja": "signatureAlgorithmは、ID-RSASSA-PSSを含まなければなりません。アルゴリズムパラメータフィールドはRSASSA-PSS-のparamsを含まなければなりません。"
    },
    {
      "indent": 3,
      "text": "signature contains the single value resulting from the signing operation.",
      "ja": "署名は、署名操作に起因する単一値を含みます。"
    },
    {
      "indent": 3,
      "text": "If the subjectPublicKeyInfo algorithm identifier for the public key in the certificate is id-RSASSA-PSS and the parameters field is present, the following additional steps MUST be done as part of signature validation:",
      "ja": "証明書の公開鍵のためのSubjectPublicKeyInfoでアルゴリズム識別子がID-RSASSA-PSSおよびパラメータフィールドが存在している場合、次の追加のステップは、署名検証の一部として行われなければなりません。"
    },
    {
      "indent": 3,
      "text": "1. The hashAlgorithm field in the certificate subjectPublicKey.algorithm parameters and the signatureAlgorithm parameters MUST be the same.",
      "ja": "1.証明書subjectPublicKey.algorithmパラメータとのsignatureAlgorithmパラメータのhashAlgorithmフィールドは同じでなければなりません。"
    },
    {
      "indent": 3,
      "text": "2. The maskGenAlgorithm field in the certificate subjectPublicKey.algorithm parameters and the signatureAlgorithm parameters MUST be the same.",
      "ja": "2.証明書subjectPublicKey.algorithmパラメータとのsignatureAlgorithmパラメータのmaskGenAlgorithmフィールドは同じでなければなりません。"
    },
    {
      "indent": 3,
      "text": "3. The saltLength in the signatureAlgorithm parameters MUST be greater or equal to the saltLength in the certificate subjectPublicKey.algorithm parameters.",
      "ja": "3.のsignatureAlgorithmパラメータのsaltLengthが大きいか又は証明書subjectPublicKey.algorithmパラメータのsaltLengthに等しくなければなりません。"
    },
    {
      "indent": 3,
      "text": "4. The trailerField in the certificate subjectPublicKey.algorithm parameters and signatureAlgorithm parameters MUST be the same.",
      "ja": "4.証明書subjectPublicKey.algorithmパラメータとのsignatureAlgorithmパラメータのtrailerFieldは同じでなければなりません。"
    },
    {
      "indent": 3,
      "text": "In doing the above comparisons, default values are considered to be the same as extant values. If any of the above four steps is not true, the signature checking algorithm MUST fail validation.",
      "ja": "上記の比較を行うには、デフォルト値が現存の値と同じであると考えられています。上記の4つのステップのいずれかが真でない場合、署名チェックアルゴリズムは、検証が失敗しなければなりません。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "Implementations must protect the RSA private key. Compromise of the RSA private key may result in the ability to forge signatures.",
      "ja": "実装はRSA秘密鍵を保護しなければなりません。 RSA秘密鍵の危殆は、署名を偽造する能力をもたらすことができます。"
    },
    {
      "indent": 3,
      "text": "The generation of RSA private key relies on random numbers. The use of inadequate pseudo-random number generators (PRNGs) to generate these values can result in little or no security. An attacker may find it much easier to reproduce the PRNG environment that produced the keys, searching the resulting small set of possibilities, rather than brute force searching the whole key space. The generation of quality random numbers is difficult. RFC 1750 [RANDOM] offers important guidance in this area.",
      "ja": "RSA秘密鍵の生成は、乱数に依存しています。これらの値を生成するために不十分な疑似乱数発生器（のPRNG）の使用は、ほとんどまたは全くセキュリティをもたらすことができます。攻撃者はそれをはるかに簡単に全体のキースペースを検索結果として起こる小さい可能性はなく、ブルートフォースを探し、キーを生成PRNG環境を再現するかもしれません。品質の乱数の生成が困難です。 RFC 1750 [RANDOM]はこの領域で重要な指導を提供しています。"
    },
    {
      "indent": 3,
      "text": "Using the same private key for different algorithms has the potential of allowing an attacker to get extra information about the key. It is strongly suggested that the same key not be used for both the PKCS #1 v1.5 and RSASSA-PSS signature algorithms.",
      "ja": "異なるアルゴリズムのために同じ秘密鍵を使用すると、攻撃者は、キーに関する追加情報を取得することを可能にする可能性を秘めています。強く、同じキーがPKCS＃1 V1.5とRSASSA-PSS署名アルゴリズムの両方に使用されていないことが示唆されました。"
    },
    {
      "indent": 3,
      "text": "When computing signatures, the same hash function should be used for all operations. This reduces the number of failure points in the signature process.",
      "ja": "署名を計算するとき、同一のハッシュ関数は、すべての操作に使用されるべきです。これは、署名プロセスの障害点の数を減少させます。"
    },
    {
      "indent": 3,
      "text": "The parameter checking procedures outlined in section 3 are of special importance. It is possible to forge signatures by changing (especially to weaker values) these parameter values. Signers using this algorithm should take care that only one set of parameter values is used as this decreases the possibility of leaking information.",
      "ja": "セクション3で概説した手順を確認するパラメータが特に重要です。これらのパラメータ値（特に弱い値に）変更することにより、署名を偽造することが可能です。これは、情報が漏洩する可能性を減少させるように、このアルゴリズムを用いて、署名者は、パラメータ値の一組のみが使用されて世話をするべきです。"
    },
    {
      "indent": 0,
      "text": "5. Normative References",
      "section_title": true,
      "ja": "5.引用規格"
    },
    {
      "indent": 3,
      "text": "[CMS] Housley, R., \"Cryptographic Message Syntax (CMS)\", RFC 3852, July 2004.",
      "ja": "[CMS] Housley氏、R.、 \"暗号メッセージ構文（CMS）\"、RFC 3852、2004年7月。"
    },
    {
      "indent": 3,
      "text": "[P1v2.1] Jonsson, J. and B. Kaliski, \"Public-Key Cryptography Standards (PKCS) #1: RSA Cryptography Specifications Version 2.1\", RFC 3447, February 2003.",
      "ja": "[P1v2.1]ジョンソン、J.とB. Kaliski、 \"公開鍵暗号規格（PKCS）＃1：RSA暗号仕様バージョン2.1\"、RFC 3447、2003年2月。"
    },
    {
      "indent": 3,
      "text": "[RSA-ALGS] Schaad, J., Kaliski, B., and R. Housley, \"Additional Algorithms and Identifiers for RSA Cryptography for use in the Internet X.509 Public Key Infrastructure Certificate and Certificate Revocation List (CRL) Profile\", RFC 4055, June 2005.",
      "ja": "[RSA-のALG] Schaad、J.、Kaliski、B.、およびR. Housley氏、「インターネットX.509公開鍵暗号基盤証明書と証明書失効リスト（CRL）プロフィールで使用するRSA暗号のための追加のアルゴリズムと識別子」、 RFC 4055、2005年6月。"
    },
    {
      "indent": 3,
      "text": "[STDWORDS] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[STDWORDS]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[X.208-88] CCITT Recommendation X.208: Specification of Abstract Syntax Notation One (ASN.1), 1998.",
      "ja": "【X.208-88] CCITT勧告X.208：抽象構文記法1（ASN.1）、1998年仕様。"
    },
    {
      "indent": 3,
      "text": "[X.209-88] CCITT Recommendation X.209: Specification of Basic Encoding Rules for Abstract Syntax Notation One (ASN.1), 1988.",
      "ja": "[X.209-88] CCITT勧告X. 209：抽象構文記法1（ASN.1）、1988年のための基本的な符号化規則の仕様。"
    },
    {
      "indent": 3,
      "text": "[X.509-88] CCITT Recommendation X.509: The Directory Authentication Framework, 1988.",
      "ja": "[X.509-88] CCITT勧告X.509：ディレクトリ認証フレームワーク、1988。"
    },
    {
      "indent": 0,
      "text": "6. Informative References",
      "section_title": true,
      "ja": "6.参考文献"
    },
    {
      "indent": 3,
      "text": "[P1v1.5] Kaliski, B., \"PKCS #1: RSA Encryption Version 1.5\", RFC 2313, March 1998.",
      "ja": "[P1v1.5] Kaliski、B.、 \"PKCS＃1：RSA暗号化バージョン1.5\"、RFC 2313、1998年3月。"
    },
    {
      "indent": 3,
      "text": "[RANDOM] Eastlake 3rd, D., Crocker, S., and J. Schiller, \"Randomness Recommendations for Security\", RFC 1750, December 1994.",
      "ja": "[RANDOM]イーストレーク第3、D.、クロッカー、S.、およびJ.シラー、 \"セキュリティのためのランダム性に関する推奨事項\"、RFC 1750、1994年12月。"
    },
    {
      "indent": 0,
      "text": "Author' Address",
      "ja": "著者の住所"
    },
    {
      "indent": 3,
      "text": "Jim Schaad Soaring Hawk Consulting PO Box 675 Gold Bar, WA 98251",
      "ja": "ジムSchaad高騰ホークコンサルティング私書箱675ゴールドバー、WA 98251"
    },
    {
      "indent": 3,
      "text": "EMail: jimsch@exmsft.com",
      "ja": "メールアドレス：jimsch@exmsft.com"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "ja": "著作権（C）インターネット協会（2005）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "この文書では、BCP 78に含まれる権利と許可と制限の適用を受けており、その中の記載を除いて、作者は彼らのすべての権利を保有します。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とCONTRIBUTOR「そのまま」、ORGANIZATION HE / SHEが表すまたはインターネットソサエティおよびインターネット・エンジニアリング・タスク・フォース放棄すべての保証、明示または、（もしあれば）後援ISに設けられています。黙示、情報の利用は、特定の目的に対する権利または商品性または適合性の黙示の保証を侵害しない任意の保証含むがこれらに限定されません。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、本書またはそのような権限下で、ライセンスがたりないかもしれない程度に記載された技術の実装や使用に関係すると主張される可能性があります任意の知的財産権やその他の権利の有効性または範囲に関していかなる位置を取りません利用可能です。またそれは、それがどのような権利を確認する独自の取り組みを行ったことを示すものでもありません。 RFC文書の権利に関する手続きの情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IPRの開示のコピーが利用できるようにIETF事務局とライセンスの保証に行われた、または本仕様の実装者または利用者がそのような所有権の使用のための一般的なライセンスまたは許可を取得するために作られた試みの結果を得ることができますhttp://www.ietf.org/iprのIETFのオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、その注意にこの標準を実装するために必要とされる技術をカバーすることができる任意の著作権、特許または特許出願、またはその他の所有権を持ってすべての利害関係者を招待します。 ietf-ipr@ietf.orgのIETFに情報を記述してください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "了承"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}