{
  "title": {
    "text": "RFC 4246 - International Standard Audiovisual Number (ISAN) URN Definition",
    "ja": "RFC 4246 - 国際標準視聴覚番号（ISAN）URN定義"
  },
  "number": 4246,
  "created_at": "2019-10-23 20:16:23.290512+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                           M. Dolan\nRequest for Comments: 4246                                           TBT\nCategory: Informational                                    February 2006",
      "raw": true
    },
    {
      "indent": 4,
      "text": "International Standard Audiovisual Number (ISAN) URN Definition",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモは、インターネットコミュニティに情報を提供します。 いかなる種類のインターネット標準も指定していません。 このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2006).",
      "ja": "著作権（C）インターネット協会（2006）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "The International Standard Audiovisual Number (ISAN) is a standard numbering system for the unique and international identification of audiovisual works. This document is the definition of the formal Uniform Resource Name (URN) Namespace Identifier (NID) for ISAN.",
      "ja": "国際標準視聴覚番号（ISAN）は、視聴覚作品を一意かつ国際的に識別するための標準的な番号付けシステムです。 このドキュメントは、ISANの正式なUniform Resource Name（URN）名前空間識別子（NID）の定義です。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. URN Namespace Definition Template ...............................2\n3. Formal Syntax ...................................................4\n4. Security Considerations .........................................4\n5. Namespace Considerations ........................................4\n6. Community Considerations ........................................4\n7. IANA Considerations .............................................5\n8. References ......................................................5\n   8.1. Normative References .......................................5\n   8.2. Informative References .....................................5",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "This document is the definition of the formal Uniform Resource Name (URN) Namespace Identifier (NID) for ISAN.",
      "ja": "このドキュメントは、ISANの正式なUniform Resource Name（URN）名前空間識別子（NID）の定義です。"
    },
    {
      "indent": 0,
      "text": "2. URN Namespace Definition Template",
      "section_title": true,
      "ja": "2. URN名前空間定義テンプレート"
    },
    {
      "indent": 3,
      "text": "The following template is provided in accordance with [RFC3406].",
      "ja": "[RFC3406]に従って、次のテンプレートが提供されます。"
    },
    {
      "indent": 3,
      "text": "Namespace ID:",
      "ja": "名前空間ID："
    },
    {
      "indent": 6,
      "text": "ISAN",
      "ja": "ISAN"
    },
    {
      "indent": 3,
      "text": "Registration Information:",
      "ja": "登録情報："
    },
    {
      "indent": 6,
      "text": "Version: 1",
      "ja": "バージョン：1"
    },
    {
      "indent": 6,
      "text": "Date: 2004 11 22",
      "ja": "日付：2004 11 22"
    },
    {
      "indent": 3,
      "text": "Declared registrant of the namespace:",
      "ja": "名前空間の宣言された登録者："
    },
    {
      "indent": 6,
      "text": "Name: ISAN International Agency Address: 26 rue de St Jean, CH-1203 Geneva, Switzerland",
      "ja": "名前：ISAN International Agency住所：26 rue de St Jean、CH-1203 Geneva、Switzerland"
    },
    {
      "indent": 6,
      "text": "Contact: Mr. Patrick Attallah, Managing Director",
      "ja": "連絡先：パトリックアッタラー、マネージングディレクター"
    },
    {
      "indent": 3,
      "text": "Declaration of structure:",
      "ja": "構造の宣言："
    },
    {
      "indent": 6,
      "text": "The identifier structure is as follows:",
      "ja": "識別子の構造は次のとおりです。"
    },
    {
      "indent": 9,
      "text": "URN:ISAN:<ISAN-NSS>",
      "ja": "URN：ISAN：<ISAN-NSS>"
    },
    {
      "indent": 6,
      "text": "Where ISAN-NSS is conformant to URN syntax requirements defined in [RFC2141] and is further constrained by [ISO15706] and in this document. There are two forms, one with the version extension and one without. The formal BNF is defined in section 2 below. Examples of the two forms are:",
      "ja": "ISAN-NSSは[RFC2141]で定義されているURN構文要件に準拠しており、[ISO15706]およびこのドキュメントでさらに制約されています。 2つの形式があります。1つはバージョン拡張あり、もう1つはありません。 正式なBNFは、以下のセクション2で定義されています。 2つの形式の例は次のとおりです。"
    },
    {
      "indent": 9,
      "text": "URN:ISAN:0123-1230-3210-2310-1",
      "ja": "URN：ISAN：0123-1230-3210-2310-1"
    },
    {
      "indent": 9,
      "text": "URN:ISAN:1881-66C7-3420-6541-9-9F3A-0245-U",
      "ja": "URN：ISAN：1881-66C7-3420-6541-9-9F3A-0245-U"
    },
    {
      "indent": 3,
      "text": "Relevant ancillary documentation:",
      "ja": "関連する補助ドキュメント："
    },
    {
      "indent": 6,
      "text": "ISAN, its syntax, uses and its processes are defined in [ISO15706].",
      "ja": "ISAN、その構文、使用法、およびそのプロセスは[ISO15706]で定義されています。"
    },
    {
      "indent": 3,
      "text": "Identifier uniqueness considerations:",
      "ja": "識別子の一意性に関する考慮事項："
    },
    {
      "indent": 6,
      "text": "Uniqueness is guaranteed by the ISAN International Agency that issues the numbers. Numbers are not re-assigned.",
      "ja": "一意性は、番号を発行するISAN国際機関によって保証されています。 番号は再割り当てされません。"
    },
    {
      "indent": 3,
      "text": "Identifier persistence considerations:",
      "ja": "識別子の永続性に関する考慮事項："
    },
    {
      "indent": 6,
      "text": "Persistence is guaranteed by ISO Registration Authority processes and contracts with the ISAN International Agency.",
      "ja": "永続性は、ISO登録機関のプロセスおよびISAN国際機関との契約によって保証されています。"
    },
    {
      "indent": 3,
      "text": "Process of identifier assignment:",
      "ja": "識別子の割り当てプロセス："
    },
    {
      "indent": 6,
      "text": "The details of the assignment process are defined from time to time by the ISAN International Agency. However, in general, any approved entity can request an ISAN number by providing the required metadata information and paying the registration fee. The ISAN International Agency may delegate to regional or market-based Registration Agencies for portions of the registration process.",
      "ja": "割り当てプロセスの詳細は、ISAN国際機関によって随時定義されます。 ただし、一般に、承認されたエンティティは、必要なメタデータ情報を提供して登録料を支払うことにより、ISAN番号を要求できます。 ISAN国際機関は、登録プロセスの一部を地域または市場ベースの登録機関に委任する場合があります。"
    },
    {
      "indent": 3,
      "text": "Process for identifier resolution:",
      "ja": "識別子解決のプロセス："
    },
    {
      "indent": 6,
      "text": "ISAN numbers are resolved by a direct or indirect lookup with the ISAN International Agency. At this writing, a non-commercial, manual system is available online at http://www.isan.org. The resolution procedures may be modified from time to time by the ISAN International Agency.",
      "ja": "ISAN番号は、ISAN国際機関との直接または間接的な検索によって解決されます。 この記事の執筆時点では、非営利の手動システムがhttp://www.isan.orgからオンラインで入手できます。 解決手順は、ISAN国際機関によって随時変更される場合があります。"
    },
    {
      "indent": 3,
      "text": "Rules for Lexical Equivalence:",
      "ja": "語彙の同等性のルール："
    },
    {
      "indent": 6,
      "text": "The ISAN-NSS is unique by the nature of the ISAN International Agency's number management. The ISAN-NSS is case-insensitive. Upper and lower case characters are treated as identical.",
      "ja": "ISAN-NSSは、ISAN国際機関の番号管理の性質によって独特です。 ISAN-NSSは大文字と小文字を区別しません。 大文字と小文字は同じものとして扱われます。"
    },
    {
      "indent": 3,
      "text": "Conformance with URN Syntax:",
      "ja": "URN構文への準拠："
    },
    {
      "indent": 6,
      "text": "No special considerations. The syntax is fully conformant with [RFC2141].",
      "ja": "特別な考慮事項はありません。 構文は[RFC2141]に完全に準拠しています。"
    },
    {
      "indent": 3,
      "text": "Validation mechanism:",
      "ja": "検証メカニズム："
    },
    {
      "indent": 6,
      "text": "The check digits provide syntax integrity. Lookup is via online and offline services provided by the ISAN International Agency.",
      "ja": "チェックディジットは構文の整合性を提供します。 検索は、ISAN International Agencyが提供するオンラインおよびオフラインのサービスを介して行われます。"
    },
    {
      "indent": 3,
      "text": "Scope: Global.",
      "ja": "範囲：グローバル。"
    },
    {
      "indent": 0,
      "text": "3. Formal Syntax",
      "section_title": true,
      "ja": "3.正式な構文"
    },
    {
      "indent": 3,
      "text": "The following syntax specification uses an augmented Backus-Naur Form (BNF) and elements defined in the URN Syntax [RFC2141]. This syntax here is derived from the syntax definition in [ISO15706], constrained to prohibit the space character as a separator.",
      "ja": "次の構文仕様では、拡張バッカスナウア形式（BNF）とURN構文[RFC2141]で定義されている要素を使用しています。 この構文は、[ISO15706]の構文定義から派生しており、区切り文字としてスペース文字を禁止するように制約されています。"
    },
    {
      "indent": 6,
      "text": "<ISAN-NSS>     ::= <root> <episode> [version]",
      "raw": true
    },
    {
      "indent": 6,
      "text": "<root>         ::= 3*(<hexnum> \"-\")",
      "raw": true
    },
    {
      "indent": 6,
      "text": "<episode>      ::= <hexnum> \"-\" <check>",
      "raw": true
    },
    {
      "indent": 6,
      "text": "<version>      ::= 2*(\"-\" <hexnum>) \"-\" <check>",
      "raw": true
    },
    {
      "indent": 6,
      "text": "<hexnum>       ::= 4*(<hex>)",
      "raw": true
    },
    {
      "indent": 6,
      "text": "<check>        ::= <upper> | <lower> | <number>",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Note that <hex>, <upper>, <lower>, and <number> are defined in [RFC2141].",
      "ja": "<hex>、<upper>、<lower>、および<number>が[RFC2141]で定義されていることに注意してください。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4.セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "This document only defines the syntax and resolution authority for the ISAN numbers. Details of the resolution process and the security of the assignment and resolution system processes are defined external to this document by the ISAN International Agency and thus outside the scope of this document.",
      "ja": "このドキュメントでは、ISAN番号の構文と解決機関のみを定義しています。 解決プロセスの詳細と、割り当ておよび解決システムプロセスのセキュリティは、ISAN国際機関によってこのドキュメントの外部で定義されているため、このドキュメントの範囲外です。"
    },
    {
      "indent": 0,
      "text": "5. Namespace Considerations",
      "section_title": true,
      "ja": "5.名前空間に関する考慮事項"
    },
    {
      "indent": 3,
      "text": "ISAN is an external numbering system managed by an external agency established by ISO. While URN namespaces may exist for which any generic numbering system can be encoded, there is currently no direct encoding for ISAN. An example of such a namespace is the MPEG-21 system.",
      "ja": "ISANは、ISOによって設立された外部機関によって管理される外部番号システムです。 一般的な番号付けシステムをエンコードできるURN名前空間が存在する場合がありますが、現在のところISANの直接エンコードはありません。 このような名前空間の例は、MPEG-21システムです。"
    },
    {
      "indent": 3,
      "text": "ISAN numbers are reserved for use in identifying audiovisual works for which there is a moving visual component, or components related to such a work (e.g. subtitling track).",
      "ja": "ISAN番号は、動いているビジュアルコンポーネント、またはそのような作品に関連するコンポーネント（字幕トラックなど）がある視聴覚作品の識別に使用するために予約されています。"
    },
    {
      "indent": 0,
      "text": "6. Community Considerations",
      "section_title": true,
      "ja": "6.コミュニティの考慮事項"
    },
    {
      "indent": 3,
      "text": "The primary registrants for ISAN numbers are the producers and studios of audiovisual works (movies and television shows). While the system is not constrained to \"major\" works (any bona fide entity can register any work), the primary benefits of its use come from works that are widely distributed. The users of the ISAN system range from the studios themselves to film and video archives and libraries, rights administrators, program guide services, and audience measurement services. Its potential for use in the Internet community is as an identifier for streaming media.",
      "ja": "ISAN番号の主な登録者は、視聴覚作品（映画やテレビ番組）のプロデューサーとスタジオです。 システムは「主要な」作品に制約されませんが（真正なエンティティはどの作品も登録できます）、その使用の主な利点は広く配布されている作品に由来します。 ISANシステムのユーザーは、スタジオ自体から映画およびビデオのアーカイブとライブラリ、権利管理者、番組ガイドサービス、視聴者測定サービスにまで及びます。 インターネットコミュニティで使用できる可能性は、ストリーミングメディアの識別子としてのものです。"
    },
    {
      "indent": 0,
      "text": "7. IANA Considerations",
      "section_title": true,
      "ja": "7. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document defines a URN NID registration that is to be entered into the IANA registry of URN NIDs. It specifically requests the NID, \"ISAN\".",
      "ja": "このドキュメントは、URN NIDのIANAレジストリに入力されるURN NID登録を定義します。 具体的には、NID「ISAN」を要求します。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8.参照"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "ja": "8.1.  規範的参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC2141] Moats, R., \"URN Syntax\", RFC 2141, May 1997.",
      "ja": "[RFC2141] Moats、R。、「URN構文」、RFC 2141、1997年5月。"
    },
    {
      "indent": 3,
      "text": "[ISO15706] ISO 15706, Information and documentation - International Standard Audiovisual Number (ISAN)",
      "ja": "[ISO15706] ISO 15706、情報および文書-国際標準視聴覚番号（ISAN）"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "ja": "8.2.  参考資料"
    },
    {
      "indent": 3,
      "text": "[RFC3406] Daigle, L., van Gulik, D., Iannella, R., and P. Faltstrom, \"Uniform Resource Names (URN) Namespace Definition Mechanisms\", BCP 66, RFC 3406, October 2002.",
      "ja": "[RFC3406] Daigle、L.、van Gulik、D.、Iannella、R。、およびP. Faltstrom、「Uniform Resource Names（URN）Namespace Definition Mechanisms」、BCP 66、RFC 3406、2002年10月。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者の住所"
    },
    {
      "indent": 3,
      "text": "Michael Dolan TBT PO Box 190 Del Mar, CA 92014 USA",
      "ja": "Michael Dolan TBT PO Box 190カリフォルニア州デル2014年9月9日米国"
    },
    {
      "indent": 3,
      "text": "EMail: md.1@newtbt.com",
      "ja": "メール：md.1@newtbt.com"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2006).",
      "ja": "著作権（C）インターネット協会（2006）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "この文書は、BCP 78に含まれる権利、ライセンス、および制限の対象となります。また、そこに記載されている場合を除き、著者はすべての権利を保持します。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "本書および本書に含まれる情報は、「現状のまま」提供され、寄稿者、代表者または代表者（もしあれば）、インターネット協会およびインターネットエンジニアリングタスクフォースは、すべての保証を放棄します 黙示的であるが、ここに記載されている情報の使用が商品性または特定の目的への適合性の黙示的保証を侵害しないという保証に限定されない。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、本書に記載されている技術の実装または使用に関連すると主張される可能性のある知的財産権またはその他の権利の有効性または範囲、またはそのような権利の下でのライセンスの有無に関して、立場をとりません。 利用可能 また、そのような権利を特定するための独立した努力を行ったことを表明するものでもありません。 RFC文書の権利に関する手順に関する情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IETF事務局に行われたIPR開示のコピーおよび利用可能になるライセンスの保証、またはこの仕様の実装者またはユーザーによる一般的なライセンスまたはそのような所有権の使用許可の取得を試みた結果を取得できます。 IETFオンラインIPRリポジトリ（http://www.ietf.org/ipr）から。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、この標準を実装するために必要となる可能性のある技術を対象とする著作権、特許、特許出願、またはその他の所有権に注意を喚起するよう、あらゆる利害関係者を招待します。 IETFのietf-ipr@ietf.orgに情報を送信してください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is provided by the IETF Administrative Support Activity (IASA).",
      "ja": "RFC Editor機能の資金は、IETF Administrative Support Activity（IASA）によって提供されます。"
    }
  ]
}