{
  "title": {
    "text": "RFC 4973 - OSPF-xTE: Experimental Extension to OSPF for Traffic Engineering",
    "ja": "RFC 4973 - OSPF-XTE：トラフィックエンジニアリングのためのOSPFへの実験的な拡張"
  },
  "number": 4973,
  "created_at": "2019-10-29 18:00:38.746152+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                       P. Srisuresh\nRequest for Comments: 4973                                Kazeon Systems\nCategory: Experimental                                         P. Joseph\n                                                              Consultant\n                                                               July 2007",
      "raw": true
    },
    {
      "indent": 4,
      "text": "OSPF-xTE: Experimental Extension to OSPF for Traffic Engineering",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This memo defines an Experimental Protocol for the Internet community. It does not specify an Internet standard of any kind. Discussion and suggestions for improvement are requested. Distribution of this memo is unlimited.",
      "ja": "このメモはインターネットコミュニティのためにExperimentalプロトコルを定義します。それはどんな種類のインターネット標準を指定しません。改善のための議論や提案が要求されています。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The IETF Trust (2007).",
      "ja": "著作権（C）IETFトラスト（2007）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document defines OSPF-xTE, an experimental traffic engineering (TE) extension to the link-state routing protocol OSPF. OSPF-xTE defines new TE Link State Advertisements (LSAs) to disseminate TE metrics within an autonomous System (AS), which may consist of multiple areas. When an AS consists of TE and non-TE nodes, OSPF-xTE ensures that non-TE nodes in the AS are unaffected by the TE LSAs. OSPF-xTE generates a stand-alone TE Link State Database (TE-LSDB), distinct from the native OSPF LSDB, for computation of TE circuit paths. OSPF-xTE is versatile and extendible to non-packet networks such as Synchronous Optical Network (SONET) / Time Division Multiplexing (TDM) and optical networks.",
      "ja": "この文書では、OSPF-XTE、リンクステートルーティングプロトコルOSPFに実験的トラフィ​​ックエンジニアリング（TE）拡張を定義します。 OSPF-XTEは、複数の領域から成ることができる自律システム（AS）内にTEメトリックを広めるために、新しいTEリンクステートアドバタイズメント（LSA）を定義します。 ASは、TEと非TEノードからなる場合、OSPF-XTEは、AS内の非TEノードがTEのLSAによって影響を受けないことを保証します。 OSPF-XTEは、TE回路パスの計算のために、ネイティブOSPF LSDBは異なるスタンドアロンTEリンク状態データベース（LSDB-TE）を生成します。 OSPF-XTEは、同期光ネットワーク（SONET）/時分割多重（TDM）と光ネットワークなどの非パケットネットワークへの汎用性と拡張です。"
    },
    {
      "indent": 0,
      "text": "IESG Note",
      "ja": "IESG注意"
    },
    {
      "indent": 3,
      "text": "The content of this RFC was at one time considered by the IETF, and therefore it may resemble a current IETF work in progress or a published IETF work. This RFC is not a candidate for any level of Internet Standard. The IETF disclaims any knowledge of the fitness of this RFC for any purpose and in particular notes that the decision to publish is not based on IETF review for such things as security, congestion control, or inappropriate interaction with deployed protocols. The RFC Editor has chosen to publish this document at its discretion. Readers of this RFC should exercise caution in evaluating its value for implementation and deployment. See RFC 3932 for more information.",
      "ja": "このRFCの内容は、IETFによって考慮一度だったので、それが進行または公開されたIETF仕事で現在IETFの作業に似ていてもよいです。このRFCはインターネットStandardのどんなレベルの候補ではありません。 IETFは、いかなる目的のためにと、公開する決定が展開されたプロトコルとセキュリティ、輻輳制御、または不適切な相互作用のようなもののためにIETFレビューに基づいていない特定のノートに、このRFCのフィットネスの知識を負いません。 RFC Editorはその裁量でこの文書を公開することを選択しました。このRFCの読者は実現と展開のためにその値を評価する際に警戒する必要があります。詳細については、RFC 3932を参照してください。"
    },
    {
      "indent": 3,
      "text": "See RFC 3630 for the IETF consensus protocol for OSPF Traffic Engineering. The OSPF WG position at the time of publication is that although this proposal has some useful properties, the protocol in RFC 3630 is sufficient for the traffic engineering needs that have been identified so far, and the cost of migrating to this proposal exceeds its benefits.",
      "ja": "OSPFトラフィックエンジニアリングのためのIETFコンセンサスプロトコルについては、RFC 3630を参照してください。発行時点でOSPF WGの位置は、この提案は、いくつかの有用な性質を有しているが、RFC 3630でのプロトコルは、これまでに同定されているトラフィックエンジニアリングのニーズに十分であり、この提案への移行のコストがその便益を超えていることです。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n2. Principles of Traffic Engineering ...............................3\n3. Terminology .....................................................5\n   3.1. Native OSPF Terms ..........................................5\n   3.2. OSPF-xTE Terms .............................................6\n4. Motivations behind the Design of OSPF-xTE .......................9\n   4.1. Scalable Design ............................................9\n   4.2. Operable in Mixed and Peer Networks ........................9\n   4.3. Efficient in Flooding Reach ................................9\n   4.4. Ability to Reserve TE-Exclusive Links .....................10\n   4.5. Extensible Design .........................................11\n   4.6. Unified for Packet and Non-Packet Networks ................11\n   4.7. Networks Benefiting from the OSPF-xTE Design ..............11\n5. OSPF-xTE Solution Overview .....................................12\n   5.1. OSPF-xTE Solution .........................................12\n   5.2. Assumptions ...............................................13\n6. Strategy for Transition of Opaque LSAs to OSPF-xTE .............14\n7. OSPF-xTE Router Adjacency -- TE Topology Discovery .............14\n   7.1. The OSPF-xTE Router Adjacency .............................14\n   7.2. The Hello Protocol ........................................15\n   7.3. The Designated Router .....................................15\n   7.4. The Backup Designated Router ..............................15\n   7.5. Flooding and the Synchronization of Databases .............16\n   7.6. The Graph of Adjacencies ..................................16\n8. TE LSAs for Packet Network .....................................18\n   8.1. TE-Router LSA (0x81) ......................................18\n        8.1.1. Router-TE Flags: TE Capabilities of the Router .....19\n        8.1.2. Router-TE TLVs .....................................20\n        8.1.3. Link-TE Flags: TE Capabilities of a Link ...........22\n        8.1.4. Link-TE TLVs .......................................23\n   8.2. TE-Incremental-Link-Update LSA (0x8d) .....................26\n   8.3. TE-Circuit-Path LSA (0x8C) ................................28\n   8.4. TE-Summary LSAs ...........................................31\n        8.4.1. TE-Summary Network LSA (0x83) ......................32\n        8.4.2. TE-Summary Router LSA (0x84) .......................33\n   8.5. TE-AS-external LSAs (0x85) ................................34\n9. TE LSAs for Non-Packet Network .................................36\n   9.1. TE-Router LSA (0x81) ......................................36\n        9.1.1. Router-TE flags - TE Capabilities of a Router ......37",
      "raw": true
    },
    {
      "indent": 3,
      "text": "        9.1.2. Link-TE Options: TE Capabilities of a TE Link ......38\n   9.2. TE-positional-ring-network LSA (0x82) .....................38\n   9.3. TE-Router-Proxy LSA (0x8e) ................................40\n10. Abstract Topology Representation with TE Support ..............42\n11. Changes to Data Structures in OSPF-xTE Nodes ..................44\n   11.1. Changes to Router Data Structure .........................44\n   11.2. Two Sets of Neighbors ....................................44\n   11.3. Changes to Interface Data Structure ......................44\n12. IANA Considerations ...........................................45\n   12.1. TE LSA Type Values .......................................45\n   12.2. TE TLV Tag Values ........................................46\n13. Acknowledgements ..............................................46\n14. Security Considerations .......................................47\n15. Normative References ..........................................48\n16. Informative References ........................................48",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "This document defines OSPF-xTE, an experimental traffic engineering (TE) extension to the link-state routing protocol OSPF. The objective of OSPF-xTE is to discover TE network topology and disseminate TE metrics within an autonomous system (AS). A stand-alone TE Link State Database (TE-LSDB), different from the native OSPF LSDB, is created to facilitate computation of TE circuit paths. Devising algorithms to compute TE circuit paths is not an objective of this document.",
      "ja": "この文書では、OSPF-XTE、リンクステートルーティングプロトコルOSPFに実験的トラフィ​​ックエンジニアリング（TE）拡張を定義します。 OSPF-XTEの目的は、TEネットワークトポロジを検出し、自律システム（AS）内TE測定基準を普及させることです。スタンドアロンのTEリンクステートデータベース（TE-LSDB）、ネイティブのOSPF LSDBは異なる、TEの回路経路の計算を容易にするために作成されています。 TE回路パスを計算するためのアルゴリズムを考案することは、この文書の目的ではありません。"
    },
    {
      "indent": 3,
      "text": "OSPF-xTE is different from the Opaque-LSA-based approach outlined in [OPQLSA-TE]. Section 4 describes the motivations behind the design of OSPF-xTE. Section 6 outlines a transition path for those currently using [OPQLSA-TE] for intra-area and wish to extend this using OSPF-xTE across the AS.",
      "ja": "OSPF-XTEは[OPQLSA-TE]に概説不透明LSAベースのアプローチとは異なります。第4章では、OSPF-XTEのデザインの背後にある動機を説明しています。セクション6は、現在イントラ領域に対して[OPQLSA-TE]を使用してASを横断この使用OSPF-XTEを拡張することを望む人のための遷移経路を概説します。"
    },
    {
      "indent": 3,
      "text": "Readers interested in TE extensions for packet networks alone may skip section 9.0.",
      "ja": "単独のパケットネットワークのためのTE拡張に関心のある読者は、セクション9.0をスキップすることがあります。"
    },
    {
      "indent": 0,
      "text": "2. Principles of Traffic Engineering",
      "section_title": true,
      "ja": "トラフィックエンジニアリングの2原則"
    },
    {
      "indent": 3,
      "text": "The objective of traffic engineering (TE) is to set up circuit path(s) between a pair of nodes or links and to forward traffic of a certain forwarding equivalency class (FEC) through the circuit path. Only unicast circuit paths are considered in this section; multicast variations are outside the scope.",
      "ja": "トラフィックエンジニアリングの目的（TE）は、ノードまたはリンクの対の間の回路パス（S）を設定すると、回路経路を介して特定の転送等価クラス（FEC）のトラフィックを転送することです。のみユニキャスト回路パスは、このセクションで考慮されます。マルチキャスト変動が範囲外です。"
    },
    {
      "indent": 3,
      "text": "A traffic engineered circuit path is unidirectional and may be identified by the tuple: (FEC, TE circuit parameters, origin node/link, destination node/link).",
      "ja": "トラヒックエンジニアリング回路パスは、単方向であり、タプルによって識別することができる：（FEC、TE回路パラメータ、起点ノード/リンク、宛先ノード/リンク）。"
    },
    {
      "indent": 3,
      "text": "A forwarding equivalency class (FEC) is a grouping of traffic that is forwarded in the same manner by a node. An FEC may be classified based on a number of criteria, as follows:",
      "ja": "転送等価クラス（FEC）は、ノードによって同じ方法で転送されるトラフィックのグループです。次のようにFECは、多くの基準に基づいて分類することができます。"
    },
    {
      "indent": 8,
      "text": "a) traffic arriving on a specific interface,\nb) traffic arriving at a certain time of day,\nc) traffic meeting a certain packet based classification\n   criteria (ex: based on a match of the fields in the IP and\n   transport headers within a packet),\nd) traffic in a certain priority class,\ne) traffic arriving on a specific set of TDM (Synchronous\n   Transport Signal (STS)) circuits on an interface, or\nf) traffic arriving on a certain wavelength of an interface.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Discerning traffic based on the FEC criteria is mandatory for Label Edge Routers (LERs). The intermediate Label-Switched Routers (LSRs) are transparent to the traffic content. LSRs are only responsible for maintaining the circuit for its lifetime. This document will not address definition of FEC criteria, the mapping of an FEC to circuit, or the associated signaling to set up circuits. [MPLS-TE] and [GMPLS-TE] address the FEC criteria. [RSVP-TE] and [CR-LDP] address signaling protocols to set up circuits.",
      "ja": "FECの基準に基づいてトラフィックを目の肥えたことはラベルエッジルータ（LERは）必須です。中間ラベルスイッチルータ（LSRの）は、トラフィックのコンテンツに対して透過的です。 LSRは、その寿命のための回路を維持するための唯一の責任を負います。この文書では、FECの基準、回路へのFECのマッピング、または回路をセットアップするための関連シグナリングの定義に対応していません。 [MPLS-TE]と[GMPLS-TE]はFEC基準に対処します。 [RSVP-TE]及び[CR-LDP]アドレスシグナリングプロトコルは、回線を設定します。"
    },
    {
      "indent": 3,
      "text": "This document is concerned with the collection of TE metrics for all the TE enforceable nodes and links within an autonomous system. TE metrics for a node may include the following.",
      "ja": "この文書では、自律システム内のすべてのTE強制力のあるノードとリンクのためのTEのメトリックの収集と懸念しています。ノードのTEメトリックは以下のものが挙げられます。"
    },
    {
      "indent": 8,
      "text": "a) Ability to perform traffic prioritization,\nb) Ability to provision bandwidth on interfaces,\nc) Support for Constrained Shortest Path First (CSPF)\n   algorithms,\nd) Support for certain TE-Circuit switch type, and\ne) Support for a certain type of automatic protection switching.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "TE metrics for a link may include the following.",
      "ja": "リンクのTE測定基準は、以下のものが挙げられます。"
    },
    {
      "indent": 8,
      "text": "a) available bandwidth,\nb) reliability of the link,\nc) color assigned to the link,\nd) cost of bandwidth usage on the link, and\ne) membership in a Shared Risk Link Group (SRLG).",
      "raw": true
    },
    {
      "indent": 3,
      "text": "A number of CSPF (Constraint-based Shortest Path First) algorithms may be used to dynamically set up TE circuit paths in a TE network.",
      "ja": "CSPFの数（制約ベースの最短パス優先）アルゴリズムを動的TEネットワークにおけるTE回路パスを設定するために使用することができます。"
    },
    {
      "indent": 3,
      "text": "OSPF-xTE mandates that the originating and the terminating entities of a TE circuit path be identifiable by IP addresses.",
      "ja": "発信及びTE回路パスの終端エンティティはIPアドレスによって識別可能OSPF-XTEの義務。"
    },
    {
      "indent": 0,
      "text": "3. Terminology",
      "section_title": true,
      "ja": "3.用語"
    },
    {
      "indent": 3,
      "text": "Definitions of the majority of the terms used in the context of the OSPF protocol may be found in [OSPF-V2]. MPLS and traffic engineering terms may be found in [MPLS-ARCH]. RSVP-TE and CR-LDP signaling-specific terms may be found in [RSVP-TE] and [CR-LDP], respectively.",
      "ja": "OSPFプロトコルの文脈で使用される用語の大部分の定義は、[OSPF-V2]に見出すことができます。 MPLSおよびトラフィックエンジニアリングの観点からは、[MPLS-ARCH]で見ることができます。 RSVP-TEやCR-LDPシグナリング特定の用語は、それぞれ、[RSVP-TE]及び[CR-LDP]に見出すことができます。"
    },
    {
      "indent": 3,
      "text": "The following subsections describe the native OSPF terms and the OSPF-xTE terms used within this document.",
      "ja": "以下のサブセクションでは、ネイティブのOSPFの用語と本書内で使用されるOSPF-XTEの用語を説明します。"
    },
    {
      "indent": 0,
      "text": "3.1. Native OSPF Terms",
      "section_title": true,
      "ja": "3.1. ネイティブのOSPF規約"
    },
    {
      "indent": 3,
      "text": "o Native node (Non-TE node)",
      "ja": "お なちゔぇ ので （のんーて ので）"
    },
    {
      "indent": 7,
      "text": "A native or non-TE node is an OSPF router that is capable of IP\npacket forwarding but does not take part in a TE network.  A\nnative OSPF node forwards IP traffic using the shortest-path\nforwarding algorithm and does not run the OSPF-xTE extensions.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "o Native link (Non-TE link)",
      "ja": "ネイティブまたはリンク（非TEリンク）"
    },
    {
      "indent": 7,
      "text": "A native (or non-TE) link is a network attachment to a TE or\nnon-TE node used for IP packet traversal.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "o Native OSPF network (Non-TE network)",
      "ja": "ネイティブまたはOSPFネットワーク（非TEネットワーク）"
    },
    {
      "indent": 7,
      "text": "A native OSPF network refers to an OSPF network that does not\nsupport TE.  \"Non-TE network\", \"native-OSPF network\", and \"non-TE\ntopology\" are used synonymously throughout the document.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "o LSP",
      "ja": "ああlespi"
    },
    {
      "indent": 7,
      "text": "LSP stands for \"Label-Switched Path\".  An LSP is a TE circuit\npath in a packet network.  The terms \"LSP\" and \"TE circuit path\"\nare used synonymously in the context of packet networks.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "o LSA",
      "ja": "LSA O"
    },
    {
      "indent": 7,
      "text": "LSA stands for OSPF \"Link State Advertisement\".",
      "ja": "LSAは、OSPF、「リンクステートアドバタイズメント」の略です。"
    },
    {
      "indent": 3,
      "text": "o LSDB",
      "ja": "お ＬＳＤＢ"
    },
    {
      "indent": 7,
      "text": "LSDB stands for \"Link State Database\".  An LSDB contains a\nrepresentation of the topology of a network.  A native LSDB,\nconstituted of native OSPF LSAs, represents the topology of a\nnative IP network.  The TE-LSDB, on the other hand, is\nconstituted of TE LSAs and is a representation of the TE network\ntopology.",
      "raw": true
    },
    {
      "indent": 0,
      "text": "3.2. OSPF-xTE Terms",
      "section_title": true,
      "ja": "3.2.  OSPF-XTE規約"
    },
    {
      "indent": 3,
      "text": "o TE node",
      "ja": "お て ので"
    },
    {
      "indent": 7,
      "text": "A TE node is a node in the traffic engineering (TE) network.  A\nTE node has a minimum of one TE link attached to it.  Associated\nwith each TE node is a set of supported TE metrics.  A TE node\nmay also participate in a native IP network.",
      "raw": true
    },
    {
      "indent": 7,
      "text": "In a SONET/TDM or photonic cross-connect network, a TE node is not required to be an OSPF-xTE node. An external OSPF-xTE node may act as proxy for the TE nodes that cannot be routers themselves.",
      "ja": "SONET / TDMまたは光クロスコネクトネットワークでは、TEノードは、OSPF-XTEノードである必要はありません。外部OSPF-XTEノードは、ルータ自体することができないTEノードのためのプロキシとして働くことができます。"
    },
    {
      "indent": 3,
      "text": "o TE link",
      "ja": "O TEリンク"
    },
    {
      "indent": 7,
      "text": "A TE link is a network attachment point to a TE node and is\nintended for traffic engineering use.  Associated with each TE\nlink is a set of supported TE metrics.  A TE link may also\noptionally carry native IP traffic.",
      "raw": true
    },
    {
      "indent": 7,
      "text": "Of the various links attached to a TE node, only the links that take part in a traffic-engineered network are called TE links.",
      "ja": "TEノードに接続された様々なリンクのうち、トラフィックエンジニアリングネットワークに参加する唯一のリンクは、TEリンクと呼ばれています。"
    },
    {
      "indent": 3,
      "text": "o TE circuit path",
      "ja": "O TE回路パス"
    },
    {
      "indent": 7,
      "text": "A TE circuit path is a unidirectional data path that is defined\nby a list of TE nodes connected to each other through TE links.\nA TE circuit path is also often referred simply as a circuit path\nor a circuit.",
      "raw": true
    },
    {
      "indent": 7,
      "text": "For the purposes of OSPF-xTE, the originating and terminating entities of a TE circuit path must be identifiable by their IP addresses. As a general rule, all nodes and links party to a traffic-engineered network should be uniquely identifiable by an IP address.",
      "ja": "OSPF-XTEの目的のためには、TE回路パスの起点と終端エンティティは、IPアドレスによって識別可能でなければなりません。一般的なルールとして、トラフィックエンジニアリングネットワークへのすべてのノードとリンク当事者がIPアドレスによって一意に識別する必要があります。"
    },
    {
      "indent": 3,
      "text": "o OSPF-xTE node (OSPF-xTE router)",
      "ja": "O OSPF n番目のノード（OSPF n番目のルータ）"
    },
    {
      "indent": 7,
      "text": "An OSPF-xTE node is a TE node that runs the OSPF routing protocol\nand the OSPF-xTE extensions described in this document.  An\nautonomous system (AS) may consist of a combination of native and\nOSPF-xTE nodes.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "o TE Control network",
      "ja": "TE制御ネットワーク"
    },
    {
      "indent": 7,
      "text": "The IP network used by the OSPF-xTE nodes for OSPF-xTE\ncommunication is referred as the TE control network or simply the\ncontrol network.  The control network can be independent of the\nTE data network.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "o TE network (TE topology)",
      "ja": "Sネットワーク（トポロジー）"
    },
    {
      "indent": 7,
      "text": "A TE network is a network of connected TE nodes and TE links, for\nthe purpose of setting up one or more TE circuit paths.  The\nterms \"TE network\", \"TE data network\", and \"TE topology\" are used\nsynonymously throughout the document.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "o Packet-TE network (Packet network)",
      "ja": "Oパケットネットワーク（パケット網）"
    },
    {
      "indent": 7,
      "text": "A packet-TE network is a TE network in which the nodes switch\nMPLS packets.  An MPLS packet is defined in [MPLS-TE] as a packet\nwith an MPLS header, followed by data octets.  The intermediary\nnode(s) of a circuit path in a packet-TE network perform MPLS\nlabel swapping to emulate the circuit.",
      "raw": true
    },
    {
      "indent": 7,
      "text": "Unless specified otherwise, the term \"packet network\" is used throughout the document to refer to a packet-TE network.",
      "ja": "特に指定しない限り、用語「パケット・ネットワークは、」パケット-TEネットワークを参照するために、文書全体で使用されます。"
    },
    {
      "indent": 3,
      "text": "o Non-packet-TE network (Non-packet network)",
      "ja": "O非パケットネットワーク（非パケット網）"
    },
    {
      "indent": 7,
      "text": "A non-packet-TE network is a TE network in which the nodes switch\nnon-packet entities such as STS time slots, Lambda wavelengths,\nor simply interfaces.",
      "raw": true
    },
    {
      "indent": 7,
      "text": "SONET/TDM and fiber cross-connect networks are examples of non-packet-TE networks. Circuit emulation in these networks is accomplished by the switch fabric in the intermediary nodes (based on TDM time slot, fiber interface, or Lambda).",
      "ja": "SONET / TDM及び繊維クロスコネクトネットワークは非パケットTEネットワークの一例です。これらのネットワークで回線エミュレーションは（TDMタイムスロット、ファイバインターフェイス、またはラムダに基づく）の中間ノードのスイッチ・ファブリックによって達成されます。"
    },
    {
      "indent": 7,
      "text": "Unless specified otherwise, the term non-packet network is used throughout the document to refer a non-packet-TE network.",
      "ja": "特に指定しない限り、用語非パケット・ネットワークは、非パケットTEネットワークを参照するために、文書全体で使用されます。"
    },
    {
      "indent": 3,
      "text": "o Mixed network",
      "ja": "Oミックスネットワーク"
    },
    {
      "indent": 7,
      "text": "A mixed network is a network that is constituted of both packet-\nTE and non-TE networks.  Traffic in the network is strictly\ndatagram oriented, i.e., IP datagrams or MPLS packets.  Routers\nin a mixed network may be TE or native nodes.",
      "raw": true
    },
    {
      "indent": 7,
      "text": "OSPF-xTE is usable within a packet network or a mixed network.",
      "ja": "OSPF-XTEは、パケット・ネットワークまたは混合ネットワーク内で使用可能です。"
    },
    {
      "indent": 3,
      "text": "o Peer network",
      "ja": "Oピアネットワーク"
    },
    {
      "indent": 7,
      "text": "A peer network is a network that is constituted of packet-TE and\nnon-packet-TE networks combined.  In a peer network, a TE node\ncould potentially support TE links for the packet as well as\nnon-packet data.",
      "raw": true
    },
    {
      "indent": 7,
      "text": "OSPF-xTE is usable within a packet network or a non-packet network or a peer network, which is a combination of the two.",
      "ja": "OSPF-XTEは、パケット・ネットワークまたは非パケット・ネットワークまたはその2つの組合せであるピア・ネットワーク内で使用可能です。"
    },
    {
      "indent": 3,
      "text": "o CSPF",
      "ja": "お ＣＳＰＦ"
    },
    {
      "indent": 7,
      "text": "CSPF stands for \"Constrained Shortest Path First\".  Given a TE\nLSDB and a set of constraints that must be satisfied to form a\ncircuit path, there may be several CSPF algorithms to obtain a TE\ncircuit path that meets the criteria.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "o TLV",
      "ja": "TLV"
    },
    {
      "indent": 7,
      "text": "A TLV stands for a data object in the form: Tag-Length-Value.\nAll TLVs are assumed to be of the following format, unless\nspecified otherwise.  The Tag and Length are 16 bits wide each.\nThe Length includes the 4 octets required for Tag and Length\nspecification.  All TLVs described in this document are padded to\n32-bit alignment.  Any padding required for alignment will not be\na part of the length field, however.  TLVs are used to describe\ntraffic engineering characteristics of the TE nodes, TE links,\nand TE circuit paths.",
      "raw": true
    },
    {
      "indent": 7,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|            Tag                |     Length (4 or more)        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                            Value ....                         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                            ....                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "o Router-TE TLVs (Router TLVs)",
      "ja": "Oルータ-TEのTLV（ルータのTLV）"
    },
    {
      "indent": 7,
      "text": "TLVs used to describe the TE capabilities of a TE node.",
      "ja": "TLVがTEノードのTE能力を記述するために使用されます。"
    },
    {
      "indent": 3,
      "text": "o Link-TE TLVs (Link TLVs)",
      "ja": "Oリンク-TEのTLV（リンクのTLV）"
    },
    {
      "indent": 7,
      "text": "TLVs used to describe the TE capabilities of a TE link.",
      "ja": "TLVがTEリンクのTE能力を記述するために使用されます。"
    },
    {
      "indent": 0,
      "text": "4. Motivations behind the Design of OSPF-xTE",
      "section_title": true,
      "ja": "OSPF-XTEのデザインの背後にある動機4"
    },
    {
      "indent": 3,
      "text": "There are several motivations that led to the design of OSPF-xTE. OSPF-xTE is scalable, efficient, and usable across a variety of network topologies. These motivations are explained in detail in the following subsections. The last subsection lists real-world network scenarios that benefit from the OSPF-xTE.",
      "ja": "OSPF-XTEのデザインにつながったいくつかの動機があります。 OSPF-XTEは、ネットワークトポロジの種々横切って、スケーラブルで効率的、かつ使用可能です。これらの動機は、以下のサブセクションで詳細に説明されています。最後のサブセクションでは、OSPF-XTEの恩恵を受け、実世界のネットワークシナリオを示しています。"
    },
    {
      "indent": 0,
      "text": "4.1. Scalable Design",
      "section_title": true,
      "ja": "4.1. スケーラブルな設計"
    },
    {
      "indent": 3,
      "text": "In OSPF-xTE, an area-level abstraction provides the scaling required for the TE topology in a large autonomous system (AS). An OSPF-xTE area border router will advertise summary LSAs for TE and non-TE topologies independent of each other. Readers may refer to section 10 for a topological view of the AS from the perspective of a OSPF-xTE node in an area.",
      "ja": "OSPF-XTEでは、領域レベルの抽象化は、大規模な自律システム（AS）のTEトポロジーに必要なスケーリングを提供します。 OSPF-XTEエリア境界ルータは、互いに独立してTEと非TEトポロジのサマリーLSAをアドバタイズします。読者は、エリア内のOSPF-XTEノードの観点からASのトポロジービューのセクション10を参照してもよいです。"
    },
    {
      "indent": 3,
      "text": "[OPQLSA-TE], on the other hand, is designed for intra-area and is not scalable to AS-wide scope.",
      "ja": "[OPQLSA-TE]は、一方で、イントラ領域用に設計されており、AS-広い範囲にスケーラブルではありません。"
    },
    {
      "indent": 0,
      "text": "4.2. Operable in Mixed and Peer Networks",
      "section_title": true,
      "ja": "4.2. 混合し、Peerネットワークで動作可能"
    },
    {
      "indent": 3,
      "text": "OSPF-xTE assumes that an AS may be constituted of coexisting TE and non-TE networks. OSPF-xTE dynamically discovers TE topology and the associated TE metrics of the nodes and links that form the TE network. As such, OSPF-xTE generates a stand-alone TE-LSDB that is fully representative of the TE network. Stand-alone TE-LSDB allows for speedy TE computations.",
      "ja": "OSPF-XTEは、ASがTEと非TEネットワークを共存から構成されてもよいことを想定しています。 OSPF-XTE動的TEトポロジーとTEネットワークを形成するノードおよびリンクの関連するTEメトリックを発見します。このように、OSPF-TE XTEはネットワークの完全表すスタンドアロンTE-LSDBを生成します。スタンドアローンTE-LSDBは、迅速なTEの計算が可能になります。"
    },
    {
      "indent": 3,
      "text": "[OPQLSA-TE] is designed for packet networks and is not suitable for mixes and peer networks. TE-LSDB in [OPQLSA-TE] is derived from the combination of Opaque LSAs and native LSDB. Further, the TE-LSDB thus derived has no knowledge of the TE capabilities of the routers in the network.",
      "ja": "[OPQLSA-TE]はパケットネットワーク用に設計されており、ミックスとピアネットワークには適していないれます。 [OPQLSA-TE]においてTE-LSDBは不透明LSAとネイティブLSDBの組み合わせから誘導されます。さらに、このように誘導されたTE-LSDBは、ネットワーク内のルータのTE能力の知識を持ちません。"
    },
    {
      "indent": 0,
      "text": "4.3. Efficient in Flooding Reach",
      "section_title": true,
      "ja": "4.3. フラッディングリーチで効率的な"
    },
    {
      "indent": 3,
      "text": "OSPF-xTE is able to identify the TE topology in a mixed network and to limit the flooding of TE LSAs to only the TE nodes. Non-TE nodes are not bombarded with TE LSAs.",
      "ja": "OSPF-XTEは、混合ネットワークにおけるTEトポロジを識別するだけTEノードへTE LSAのフラッディングを制限することが可能です。非TEノードはTEのLSAが殺到していません。"
    },
    {
      "indent": 3,
      "text": "In a TE network, a subset of the TE metrics may be prone to rapid change, while others remain largely unchanged. Changes in TE metrics must be communicated at the earliest throughout the network to ensure that the TE-LSDB is up-to-date within the network. As a general rule, a TE network is likely to generate significantly more control traffic than a native network. The excess traffic is almost directly proportional to the rate at which TE circuits are set up and torn down within the TE network. The TE database synchronization should occur much quicker compared to the aggregate circuit set up and tear-down rates. OSPF-xTE defines TE-Incremental-Link-update LSA (section 8.2) to advertise only a subset of the metrics that are prone to rapid changes.",
      "ja": "他のものは大きく変化しないままTEネットワークでは、TEメトリックのサブセットは、急激に変化する傾向があってもよいです。 TE測定基準の変化はTE-LSDBは、最新のネットワーク内であることを保証するために、ネットワーク全体早くても伝達されなければなりません。一般的なルールとして、TEネットワークはネイティブネットワークよりも大幅に制御トラフィックを生成する可能性があります。過剰トラフィックは、TE回路を設定し、TEネットワーク内で切断された速度にほぼ正比例します。 TEデータベースの同期は、集約設定回路とティアダウン率に比べてはるかに迅速に起こるべきです。 OSPF-XTEは、急速な変化を起こしやすいメトリックのサブセットのみをアドバタイズするTE-インクリメンタルリンク更新LSA（セクション8.2）を定義します。"
    },
    {
      "indent": 3,
      "text": "The more frequent and wider the flooding, the larger the number of retransmissions and acknowledgements. The same information (needed or not) may reach a router through multiple links. Even if the router did not forward the information past the node, it would still have to send acknowledgements across all the various links on which the LSAs tried to converge. It is undesirable to flood non-TE nodes with TE information.",
      "ja": "再送信と確認応答の数が大きいほど、洪水より頻繁に、より広いです。同じ情報（必要かどうかは）複数のリンクを介してルータに達する可能性があります。ルータはノード過去の情報を転送していなかったとしても、それはまだのLSAが収束しようとしているすべてのさまざまなリンク間で確認応答を送信する必要があります。 TE情報と非TEノードをあふれさせることは望ましくありません。"
    },
    {
      "indent": 0,
      "text": "4.4. Ability to Reserve TE-Exclusive Links",
      "section_title": true,
      "ja": "4.4.  TE-専用リンクを予約する機能"
    },
    {
      "indent": 3,
      "text": "OSPF-xTE draws a clear distinction between TE and non-TE links. A TE link may be configured to permit TE traffic alone, and not permit best-effort IP traffic on the link. This permits TE enforceability on the TE links.",
      "ja": "OSPF-XTEはTEと非TEリンクの間に明確な区別を描画します。 TEリンクは単独のTEトラフィックを許可するように設定し、リンク上のベストエフォート型のIPトラフィックを許可しないことがあります。これは、TEリンクのTEの執行が可能となります。"
    },
    {
      "indent": 3,
      "text": "When links of a TE topology do not overlap the links of a native IP network, OSPF-xTE allows for virtual isolation of the two networks. Best-effort IP network and TE network often have different service requirements. Keeping the two networks physically isolated can be expensive. Combining the two networks into a single physically connected network will bring economies of scale, while service enforceability can be maintained individually for each of the TE and non-TE sections of the network.",
      "ja": "TEトポロジのリンクがネイティブIPネットワークのリンクを重ならない場合は、OSPF-XTEは、2つのネットワークの仮想分離することができます。ベストエフォート型のIPネットワークとTEネットワークは、多くの場合、異なるサービス要件を持っています。物理的に分離された2つのネットワークを維持することは高価なことができます。サービス執行ネットワークのTEと非TEセクションの各々に対して個別に維持することができるが、単一の物理的に接続されたネットワークに2つのネットワークを組み合わせることにより、規模の経済をもたらします。"
    },
    {
      "indent": 3,
      "text": "[OPQLSA-TE] does not support the ability to isolate best-effort IP traffic from TE traffic on a link. All links are subject to best-effort IP traffic. An OSPF router could potentially select a TE link to be its least cost link and inundate the link with best-effort IP traffic, thereby rendering the link unusable for TE purposes.",
      "ja": "[OPQLSA-TE]は、リンク上でTEトラフィックからベストエフォート型のIPトラフィックを分離する機能をサポートしていません。すべてのリンクは、ベストエフォート型のIPトラフィックの対象となっています。 OSPFルータは、潜在的にその最小コストのリンクであって、それによってTEの目的のために使用できなくリンクをレンダリングし、ベストエフォート型のIPトラフィックとのリンクを水浸しするTEリンクを選択することができます。"
    },
    {
      "indent": 0,
      "text": "4.5. Extensible Design",
      "section_title": true,
      "ja": "4.5. 拡張可能な設計"
    },
    {
      "indent": 3,
      "text": "The OSPF-xTE design is based on the tried-and-tested OSPF paradigm, and it inherits all the benefits of OSPF, present and future. TE LSAs are extensible, just as the native OSPF on which OSPF-xTE is founded are extensible.",
      "ja": "OSPF-XTEのデザインをテストしようとした - と -  OSPFパラダイムに基づいて、それはOSPF、現在および将来のすべての利点を継承しています。 TEのLSAは、OSPF-XTEが設立されているネイティブのOSPFは拡張されているのと同様に、拡張可能です。"
    },
    {
      "indent": 0,
      "text": "4.6. Unified for Packet and Non-Packet Networks",
      "section_title": true,
      "ja": "4.6. パケットと非パケットネットワークのための統一"
    },
    {
      "indent": 3,
      "text": "OSPF-xTE is usable within a packet network or a non-packet network or a combination peer network.",
      "ja": "OSPF-XTEは、パケット・ネットワークまたは非パケットネットワークまたは組み合わせピアネットワーク内で使用可能です。"
    },
    {
      "indent": 3,
      "text": "Signaling protocols such as RSVP and LDP work the same across packet and non-packet networks. Signaling protocols merely need the TE characteristics of nodes and links so they can signal the nodes to formulate TE circuit paths. In a peer network, the underlying control protocol must be capable of providing a unified LSDB for all TE nodes (nodes with packet-TE links as well as non-packet-TE links) in the network. OSPF-xTE meets this requirement.",
      "ja": "そのようなRSVPおよびLDPなどのシグナリングプロトコルはパケットと非パケットネットワーク上で同一の動作します。それらは、TE回路パスを処方するノードに信号を送ることができるように、シグナリングプロトコルは単に、ノードとリンクのTEの特性を必要とします。ピア・ネットワークでは、基礎となる制御プロトコルは、すべてのTEノードネットワークにおける（パケット-TEリンク並びに非パケットTEリンクとノード）のための統一されたLSDBを提供することができなければなりません。 OSPF-XTEは、この要件を満たしています。"
    },
    {
      "indent": 0,
      "text": "4.7. Networks Benefiting from the OSPF-xTE Design",
      "section_title": true,
      "ja": "4.7.  OSPF-XTEデザインの恩恵を受けネットワーク"
    },
    {
      "indent": 3,
      "text": "Below are examples of some real-world network scenarios that benefit from OSPF-xTE.",
      "ja": "以下は、OSPF-XTEの恩恵を受けるいくつかの実世界のネットワークシナリオの例があります。"
    },
    {
      "indent": 3,
      "text": "o IP providers transitioning to provide TE services",
      "ja": "O IPプロバイダは、TEサービスを提供するために、移行します"
    },
    {
      "indent": 7,
      "text": "Providers needing to support MPLS-based TE in their IP network\nmay choose to transition gradually.  They may add new TE links or\nconvert existing links into TE links within an area first and\nprogressively advance to offering MPLS in the entire AS.",
      "raw": true
    },
    {
      "indent": 7,
      "text": "Not all routers will support TE extensions at the same time during the migration process. Use of TE-specific LSAs and their flooding to OSPF-xTE only nodes will allow the vendor to introduce MPLS TE without destabilizing the existing network. The native OSPF-LSDB will remain undisturbed while newer TE links are added to the network.",
      "ja": "いないすべてのルータは、移行プロセス中に同時にTE拡張をサポートします。 TE-特定のLSAとOSPF-XTEのみのノードへの洪水の利用は、ベンダーが既存のネットワークを不安定にすることなく、MPLS TEを導入することができます。新しいTEリンクがネットワークに追加されている間、ネイティブのOSPF-LSDBは邪魔されずに残ります。"
    },
    {
      "indent": 3,
      "text": "o Providers offering best-effort-IP & TE services",
      "ja": "ベストエフォート-IP＆TEサービスを提供するOプロバイダ"
    },
    {
      "indent": 7,
      "text": "Providers choosing to offer both best-effort-IP and TE based\npacket services simultaneously on the same physically connected\nnetwork will benefit from the OSPF-xTE design.  By maintaining\nindependent LSDBs for each type of service, TE links are not\ncannibalized in a mixed network.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "o Large TE networks",
      "ja": "O大TEネットワーク"
    },
    {
      "indent": 7,
      "text": "The OSPF-xTE design is advantageous in large TE networks that\nrequire the AS to be sub-divided into multiple areas.  OSPF-xTE\npermits inter-area exchange of TE information, which ensures that\nall nodes in the AS have up-to-date, AS-wide, TE reachability\nknowledge.  This in turn will make TE circuit setup predictable\nand computationally bounded.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "o Non-Packet Networks and Peer Networks",
      "ja": "非パケットネットワークとピア・ネットワークO"
    },
    {
      "indent": 7,
      "text": "Vendors may also use OSPF-xTE for their non-packet TE networks.\nOSPF-xTE defines the following functions in support of non-packet\nTE networks.\n (a) \"Positional-Ring\" type network LSAs.\n (b) Router proxying -- allowing a router to advertise on behalf\n       of other nodes (that are not packet/OSPF-capable).",
      "raw": true
    },
    {
      "indent": 0,
      "text": "5. OSPF-xTE Solution Overview",
      "section_title": true,
      "ja": "5. OSPF-XTEソリューションの概要"
    },
    {
      "indent": 0,
      "text": "5.1. OSPF-xTE Solution",
      "section_title": true,
      "ja": "5.1.  OSPF n番目のソリューション"
    },
    {
      "indent": 3,
      "text": "Locally-scoped Opaque LSA (type 9) is used to discovery the TE topology within a network. Section 7.1 describes in detail the use of type 9 Opaque LSA for TE topology discovery. TE LSAs are designed for use by the OSPF-xTE nodes. Section 8.0 describes the TE LSAs in detail. Changes required of the OSPF data structures to support OSPF-xTE are described in section 11.0. A new TE-neighbors data structure will be used to advertise TE LSAs along TE topology.",
      "ja": "ローカルスコープのオペークLSA（タイプ9）は、ネットワーク内のTEトポロジ発見するために使用されます。セクション7.1を詳細にTEトポロジ発見のためのタイプ9不透明LSAの使用を記載しています。 TEのLSAはOSPF-XTEノードで使用するために設計されています。セクション8.0を詳細にTE LSAを説明します。 OSPF-XTEをサポートするために、OSPFデータ構造の必要な変更は、セクション11.0で説明されています。新しいTE-隣人データ構造は、TEトポロジに沿ってTE LSAを宣伝するために使用されます。"
    },
    {
      "indent": 3,
      "text": "An OSPF-xTE node will have a native LSDB and a TE-LSDB, while a native OSPF node will have just a native LSDB. Consider the OSPF area, constituted of OSPF-xTE and native OSPF routers, shown in Figure 1. Nodes RT1, RT2, RT3, and RT6 are OSPF-xTE routers with TE and non-TE link attachments. Nodes RT4 and RT5 are native OSPF routers with no TE links. When the LSA database is synchronized, all nodes will share the same native LSDB. OSPF-xTE nodes alone will have the additional TE-LSDB.",
      "ja": "ネイティブのOSPFノードだけでネイティブのLSDBを持つことになりますしながら、OSPF-XTEノードは、ネイティブのLSDBとTE-LSDBを持つことになります。 OSPFエリアを考慮し、図1のノードRT1、RT2、RT3、及びRT6に示す、OSPF-XTEおよびネイティブのOSPFルータから構成されるTEと非TEリンク添付ファイル付きOSPF-XTEルータです。ノードRT4とRT5は無いTEリンクを持つネイティブのOSPFルータです。 LSAデータベースが同期されている場合、すべてのノードが同じネイティブLSDBを共有します。単独のOSPF-XTEノードは追加のTE-LSDBを持つことになります。"
    },
    {
      "indent": 9,
      "text": "     +---+\n     |   |--------------------------------------+\n     |RT6|\\\\                                    |\n     +---+  \\\\                                  |\n      ||      \\\\                                |\n      ||        \\\\                              |\n      ||          \\\\                            |\n      ||          +---+                         |\n      ||          |   |----------------+        |\n      ||          |RT1|\\\\              |        |\n      ||          +---+  \\\\            |        |\n      ||          //|      \\\\          |        |\n      ||        //  |        \\\\        |        |\n      ||      //    |          \\\\      |        |\n     +---+  //      |            \\\\  +---+      |\n     |RT2|//        |              \\\\|RT3|------+\n     |   |----------|----------------|   |\n     +---+          |                +---+\n                    |                  |\n                    |                  |\n                    |                  |\n                  +---+              +---+\n                  |RT5|--------------|RT4|\n                  +---+              +---+\nLegend:\n     --   Native (non-TE) network link\n     |    Native (non-TE) network link\n     \\\\   TE network link\n     ||   TE network link",
      "raw": true
    },
    {
      "indent": 13,
      "text": "Figure 1. A (TE + native) OSPF Network Topology",
      "ja": "図1 A（TE +ネイティブ）OSPFネットワークトポロジ"
    },
    {
      "indent": 0,
      "text": "5.2. Assumptions",
      "section_title": true,
      "ja": "5.2. 仮定"
    },
    {
      "indent": 3,
      "text": "OSPF-xTE is an extension to the native OSPF protocol and does not mandate changes to the existing OSPF. OSPF-xTE design makes the following assumptions.",
      "ja": "OSPF-XTEは、ネイティブのOSPFプロトコルを拡張し、既存のOSPFへの変更を強制しません。 OSPF-XTEの設計は、次のように仮定します。"
    },
    {
      "indent": 3,
      "text": "(1) An OSPF-xTE node will need to establish router adjacency with at least one other OSPF-xTE node in the area in order for the router's TE database to be synchronized within the area. Failing this, the OSPF router will not be in the TE calculations of other TE routers in the area.",
      "ja": "（1）OSPF-XTEノードは、ルータのTEデータベースが領域内同期するために、エリア内の少なくとも1つの他のOSPF-XTEノードとルータの隣接関係を確立する必要があります。これに失敗すると、OSPFルータは、エリア内の他のTEルータのTE計算になりません。"
    },
    {
      "indent": 8,
      "text": "It is the responsibility of the network administrator(s) to\nensure connectedness of the TE network.  Otherwise, there can be\ndisjoint TE topologies within a network.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "(2) OSPF-xTE nodes must advertise the link state of its TE links. TE links are not obligated to support native IP traffic. Hence, an OSPF-xTE node cannot be required to synchronize its link-state database with neighbors on all its links. The only requirement is to have the TE LSDB synchronized across all OSPF-xTE nodes in the area.",
      "ja": "（2）OSPF-XTEのノードは、そのTEリンクのリンク状態を広告しなければなりません。 TEリンクはネイティブIPトラフィックをサポートする義務はありません。したがって、OSPF-XTEノードは、そのすべてのリンク上のネイバーとのリンクステートデータベースを同期させるために必要とすることはできません。唯一の要件は、TE LSDBはエリア内のすべてのOSPF-XTEノード間で同期させることです。"
    },
    {
      "indent": 3,
      "text": "(3) A link in a packet network may be designated as a TE link or a native-IP link or both. For example, a link may be used for both TE and non-TE traffic, as long as the link is under subscribed in bandwidth for TE traffic (for example, 50% of the link capacity is set aside for TE traffic).",
      "ja": "（3）パケット・ネットワーク内のリンクは、TEリンクまたはネイティブIPリンクまたはその両方として指定することができます。たとえば、リンクがあれば、TEトラフィックの帯域幅に加入下リンクであるように（例えば、リンク容量の50％がTEトラフィックのために確保されている）、TEと非TEトラフィックの両方のために使用することができます。"
    },
    {
      "indent": 3,
      "text": "(4) Non-packet TE sub-topologies must have a minimum of one node running OSPF-xTE protocol. For example, a SONET/SDH TDM ring must have a minimum of one Gateway Network Element (GNE) running OSPF-xTE. The OSPF-xTE node will advertise on behalf of all the TE nodes in the ring.",
      "ja": "（4）非パケットTEサブトポロジはOSPF-XTEプロトコルを実行しているノードの最小値を有していなければなりません。例えば、SONET / SDHのTDMリングは、OSPF-XTEを実行つのゲートウェイネットワーク要素（GNE）の最小値を有していなければなりません。 OSPF-XTEノードは、リング内のすべてのTEノードの代わりに広告を掲載します。"
    },
    {
      "indent": 0,
      "text": "6. Strategy for Transition of Opaque LSAs to OSPF-xTE",
      "section_title": true,
      "ja": "OSPF-XTEに不透明LSAの推移6.戦略"
    },
    {
      "indent": 3,
      "text": "Below is a strategy to transition implementations currently using Opaque LSAs ([OPQLSA-TE]) within an area to adapt OSPF-xTE in a gradual fashion across the AS.",
      "ja": "以下AS横切って緩やかな様式でOSPF-XTEを適応させるために現在エリア内不透明LSAを（[OPQLSA-TE]）を使用して実装を移行するための戦略です。"
    },
    {
      "indent": 3,
      "text": "(1) Use [OPQLSA-TE] within an area. Derive TE topology within the area from the combination of Opaque LSAs and native LSDB.",
      "ja": "（1）領域内[OPQLSA-TE]を使用。不透明LSAとネイティブのLSDBの組み合わせからエリア内にTEトポロジを導き出します。"
    },
    {
      "indent": 3,
      "text": "(2) Use TE-Summary LSAs and TE-AS-external LSAs for inter-area communication. Use the TE topology within an area to summarize the TE networks in the area and advertise the same to all TE nodes in the backbone. The TE-ABRs (TE area border routers) on the backbone area will in turn advertise these summaries within their connected areas.",
      "ja": "（2）使用TE-要約LSAとエリア間の通信のためのTE-AS-外部LSA。エリア内のTEネットワークを要約し、バックボーン内のすべてのTEノードに同じことを宣伝するためにエリア内のTEトポロジを使用してください。バックボーンエリアにTE-のABR（TEエリア境界ルータ）は、今度は自分の連結領域内でこれらの要約をアドバタイズします。"
    },
    {
      "indent": 0,
      "text": "7. OSPF-xTE Router Adjacency -- TE Topology Discovery",
      "section_title": true,
      "ja": "7. OSPF-XTEルータ隣接 -  TEトポロジ探索"
    },
    {
      "indent": 3,
      "text": "OSPF creates adjacencies between neighboring routers for the purpose of exchanging routing information. The following subsections describe the use of locally-scoped Opaque LSAs to discover OSPF-xTE neighboring routers. The capability is used as the basis to build a TE topology.",
      "ja": "OSPFルーティング情報を交換するために、隣接ルータとの間の隣接関係を作成します。以下のサブセクションでは、OSPF-XTE隣接ルータを発見するローカルスコープオペークLSAの使用を記載しています。機能は、TEトポロジを構築するための基礎として使用されます。"
    },
    {
      "indent": 0,
      "text": "7.1. The OSPF-xTE Router Adjacency",
      "section_title": true,
      "ja": "7.1.  OSPF-XTEルータ隣接"
    },
    {
      "indent": 3,
      "text": "OSPF uses the options field in the Hello packet to advertise optional router capabilities [OSPF-V2]. However, all the bits in this field have been allocated and there is no way to advertise OSPF-xTE capability using the options field at this time. This document proposes using local-scope Opaque LSA (OPAQUE-9 LSA) to advertise support for OSPF-xTE and establish OSPF-xTE adjacency. In order to exchange Opaque LSAs, the neighboring routers must have the O-bit (Opaque option bit) set in the options field.",
      "ja": "OSPFは、オプションのルータ機能[OSPF-V2]を宣伝するためにHelloパケットのオプションフィールドを使用しています。しかし、この分野のすべてのビットが割り当てられていると、この時点でオプションのフィールドを使用したOSPF-XTEの機能をアドバタイズする方法はありません。この文書では、OSPF-XTEをサポートすることを通知し、OSPF-XTEの隣接関係を確立するために、ローカル・スコープ不透明LSA（OPAQUE-9 LSA）を使用することを提案しています。オペークLSAを交換するために、隣接ルータは、オプションフィールドに設定Oビット（不透明オプションビット）を有していなければなりません。"
    },
    {
      "indent": 3,
      "text": "[OSPF-CAP] proposes a format for exchanging router capabilities via OPAQUE-9 LSA. Routers supporting OSPF-xTE will be required to set the \"OSPF Experimental TE\" bit within the \"router capabilities\" field. Two routers will not become TE neighbors unless they share a common network link on which both routers advertise support for OSPF-xTE. Routers that do not support OSPF-xTE may simply ignore the advertisement.",
      "ja": "[OSPF-CAP]はOPAQUE-9 LSAを介してルータの機能を交換するためのフォーマットを提案しています。 OSPF-XTEをサポートするルータは「ルータ機能」フィールド内の「OSPF実験TE」ビットをセットする必要があります。彼らは両方のルータがOSPF-XTEのサポートを宣伝れている一般的なネットワークリンクを共有しない限り、2台のルータがTE隣人になることはありません。 OSPF-XTEをサポートしていないルータは、単に広告を無視することができます。"
    },
    {
      "indent": 0,
      "text": "7.2. The Hello Protocol",
      "section_title": true,
      "ja": "7.2.  Helloプロトコル"
    },
    {
      "indent": 3,
      "text": "The Hello protocol is primarily responsible for dynamically establishing and maintaining neighbor adjacencies. In a TE network, it is not required for all links and neighbors to establish adjacency using this protocol. OSPF-xTE router adjacency between two routers is established using the method described in the previous section.",
      "ja": "こんにちはプロトコルは、動的にネイバー隣接関係を確立し、維持するために主に責任があります。 TEネットワークでは、このプロトコルを使用して隣接関係を確立するために、すべてのリンクや隣人のために必要とされていません。 2つのルータ間OSPF-XTEルータ隣接関係は、前のセクションで説明した方法を使用して確立されます。"
    },
    {
      "indent": 3,
      "text": "For non-broadcast multi-access (NBMA) and broadcast networks, the HELLO protocol is responsible for electing the Designated Router and the Backup Designated Router. Routers supporting the TE option shall be given a higher precedence for becoming a designated router over those that do not support TE.",
      "ja": "非ブロードキャストマルチアクセス（NBMA）とブロードキャストネットワークでは、ハロープロトコルが指定ルータとルータを指定されたバックアップを選出する責任があります。 TEオプションをサポートしているルータはTEをサポートしていないものの上に指定ルータになるための高い優先順位を与えなければなりません。"
    },
    {
      "indent": 0,
      "text": "7.3. The Designated Router",
      "section_title": true,
      "ja": "7.3. 指定ルータ"
    },
    {
      "indent": 3,
      "text": "When a router's non-TE link first becomes functional, it checks to see whether there is currently a Designated Router for the network. If there is one, it accepts that Designated Router, regardless of its router priority, so long as the current designated router is TE compliant. Otherwise, the router itself becomes Designated Router if it has the highest Router Priority on the network and is TE compliant.",
      "ja": "ルータの非TEリンクが第一機能になると、それは現在のネットワークの代表ルータが存在するかどうかをチェックします。 1があれば、それはルータを指定することを受け入れ、関係なく、そのルータプライオリティの、現在の指定ルータとして限りは、TE準拠しています。それは、ネットワーク上の最高のルータの優先順位を持ち、TE準拠であればそうでない場合は、ルータ自体が指定ルータになります。"
    },
    {
      "indent": 3,
      "text": "OSPF-xTE must be implemented on the most robust routers, as they become likely candidates to take on the role as Designated Router.",
      "ja": "彼らは指定ルータとしての役割を引き受けるために有望な候補になるとOSPF-XTEは、最も堅牢なルータに実装する必要があります。"
    },
    {
      "indent": 0,
      "text": "7.4. The Backup Designated Router",
      "section_title": true,
      "ja": "7.4. バックアップ代表ルータ"
    },
    {
      "indent": 3,
      "text": "The Backup Designated Router is also elected by the Hello Protocol. Each Hello Packet has a field that specifies the Backup Designated Router for the network. Once again, TE-compliance must be weighed in conjunction with router priority in electing the Backup Designated Router.",
      "ja": "バックアップ指定ルータもHelloプロトコルによって選出されます。各helloパケットは、ネットワークのバックアップ指定ルータを指定するフィールドがあります。もう一度、TE-コンプライアンスは、ルータを指定されたバックアップを選出して、ルータの優先順位と併せて検討する必要があります。"
    },
    {
      "indent": 0,
      "text": "7.5. Flooding and the Synchronization of Databases",
      "section_title": true,
      "ja": "7.5. 洪水とデータベースの同期"
    },
    {
      "indent": 3,
      "text": "In OSPF, adjacent routers within an area are required to synchronize their databases. However, a more concise requirement is that all routers in an area must converge on the same LSDB. As stated in item 2 of section 5.2, a basic assertion of OSPF-xTE is that the links used by the OSPF-xTE control network for flooding must not be required to match the links used by the data network for real-time data forwarding. For instance, it should not be required to send OSPF-xTE messages over a TE link that is configured to reject non-TE traffic. However, the control network must be set up such that a minimum of one path exists between any two OSPF or OSPF-xTE routers within the network, for flooding purposes. This revised control network connectivity requirement does not jeopardize convergence of LSDB within an area.",
      "ja": "OSPFでは、エリア内の隣接ルータは、そのデータベースを同期するために必要とされています。しかし、より簡潔な要件は、エリア内のすべてのルータが同じLSDBに収束しなければならないということです。セクション5.2の項目2で述べたように、OSPF-XTEの基本的な主張は、フラッディングのためのOSPF-XTE制御ネットワークで使用されるリンクは、リアルタイムのデータ転送のためのデータネットワークで使用されるリンクを一致させるために必要とされてはならないということです。例えば、非TEトラフィックを拒否するように構成されたTEリンク上でOSPF-XTEメッセージを送信するために要求されるべきではありません。しかし、制御ネットワークは、一つのパスの最小フラッディング目的のために、ネットワーク内の任意の二つのOSPFまたはOSPF-XTEルータ間に存在するように設定されなければなりません。この改訂された制御ネットワーク接続の要件は、エリア内LSDBの収束を危うくしません。"
    },
    {
      "indent": 3,
      "text": "In a mixed network, where some of the neighbors are TE compliant and others are not, the designated OSPF-xTE router will exchange different sets of LSAs with its neighbors. TE LSAs are exchanged only with the TE neighbors. Native LSAs are exchanged with all neighbors (TE and non-TE alike). Restricting the scope of TE LSA flooding to just the OSPF-xTE nodes will not affect the native nodes that coexist with the OSPF-xTE nodes.",
      "ja": "隣人のいくつかは、TEに準拠しており、他はありませんされて混合ネットワークでは、指定されたOSPF-XTEルータはその隣人とLSAの異なるセットを交換します。 TEのLSAは唯一のTE隣人と交換されています。ネイティブLSAは、すべてのネイバー（TEと非TE似）と交換されています。ちょうどOSPF-XTEノードがOSPF-XTEノードと共存ネイティブのノードには影響しませんし、TE LSAフラッディングの範囲を制限します。"
    },
    {
      "indent": 3,
      "text": "The control traffic for a TE network (i.e., TE LSA advertisement) is likely to be higher than that of a native OSPF network. This is because the TE metrics may vary with each TE circuit setup and the corresponding state change must be advertised at the earliest, not exceeding the MinLSInterval of 5 seconds. To minimize advertising repetitive content, OSPF-xTE defines a new TE-incremental-Link-update LSA (section 8.2) that would advertise just the TLVs that changed for a link.",
      "ja": "TEネットワークの制御トラフィック（すなわち、TE LSA広告）は、ネイティブのOSPFネットワークのより高い可能性があります。 TEメトリックは各TE回路の設定に応じて変化することができ、対応する状態変化が5秒MinLSIntervalを超えない、最も早くにアドバタイズされなければならないからです。広告繰り返しコンテンツを最小限に抑えるために、OSPF-XTEは、リンク用に変更だけでTLVを宣伝する新しいTE-インクリメンタルリンク更新LSA（セクション8.2）を定義します。"
    },
    {
      "indent": 3,
      "text": "The OSPFIGP-TE well-known multicast address 224.0.0.24 has been assigned by IANA for the exchange of TE-compliant database descriptors during database synchronization.",
      "ja": "OSPFIGP-TEのよく知られたマルチキャストアドレス224.0.0.24は、データベースの同期中にTE-準拠のデータベース記述子の交換のためにIANAによって割り当てられています。"
    },
    {
      "indent": 0,
      "text": "7.6. The Graph of Adjacencies",
      "section_title": true,
      "ja": "7.6. 隣接関係のグラフ"
    },
    {
      "indent": 3,
      "text": "If two routers have multiple networks in common, they may have multiple adjacencies between them. The adjacency may be one of two types - native OSPF adjacency and TE adjacency. OSPF-xTE routers will form both types of adjacency.",
      "ja": "2つのルータに共通して複数のネットワークを持っている場合は、それらの間の複数の隣接関係を有することができます。ネイティブのOSPF隣接およびTE隣接 - 隣接関係は、2つのタイプのものであってもよいです。 OSPF-XTEルータは隣接の両方のタイプを形成することになります。"
    },
    {
      "indent": 3,
      "text": "Two types of adjacency graphs are possible, depending on whether a Designated Router is elected for the network. On physical point-to-point networks, point-to-multipoint networks, and virtual links, neighboring routers become adjacent whenever they can communicate directly. The adjacency can be either (a) TE-compliant or (b) native. In contrast, on broadcast and NBMA networks the designated router and the backup designated router may maintain two sets of adjacency. The remaining routers will form either TE-compliant or native adjacency.",
      "ja": "隣接グラフの二つのタイプは、指定されたルータがネットワークのために選出されているかどうかに応じて、可能です。それらは直接通信することができるときはいつでも物理的ポイントツーポイントネットワークでは、ポイントツーマルチポイントネットワーク、仮想リンク、隣接ルータは、隣接なります。隣接関係は、（a）はTE準拠または（b）天然のいずれであってもよいです。これとは対照的に、放送とNBMAネットワーク上の指定ルータとバックアップ指定ルータは隣接の二組を維持することができます。残りのルータはTE準拠またはネイティブのいずれかの隣接関係を形成することになります。"
    },
    {
      "indent": 3,
      "text": "In the broadcast network in Figure 2, routers RT7 and RT3 are chosen as the Designated and Backup Designated Routers, respectively. Routers RT3, RT4 and RT7 are TE-compliant, but RT5 and RT6 are not. So RT4 will have TE-compliant adjacency with the designated and backup routers, while RT5 and RT6 will only have native adjacency with the Designated and Backup Designated Routers.",
      "ja": "図2の放送ネットワークでは、ルータRT7とRT3は、それぞれ指定され、バックアップ指定ルータとして選択されます。ルータRT3、RT4およびRT7はTEに準拠していますが、RT5とRT6はありません。 RT5とRT6を指定してバックアップ指定ルータとネイティブの隣接関係を持っているだけだろうしながら、そうRT4は、指定されたとバックアップルータとTE準拠の隣接関係を持つことになります。"
    },
    {
      "indent": 16,
      "text": "Network Adjacency",
      "ja": "ネットワークの隣接関係"
    },
    {
      "indent": 9,
      "text": "+---+            +---+\n|RT1|------------|RT2|            o-----------------o\n+---+    N1      +---+           RT1               RT2",
      "raw": true
    },
    {
      "indent": 9,
      "text": "                                        RT7\n                                         o:::::\n   +---+   +---+   +---+                /|    :\n   |RT7|   |RT3|   |RT4|               / |    :\n   +---+   +---+   +---+              /  |    :\n     |       |       |               /   |    :\n+-----------------------+        RT5o RT6o    oRT4\n   N2    |       |                   *   *    ;\n       +---+   +---+                  *  *    ;\n       |RT5|   |RT6|                   * *    ;\n       +---+   +---+                    **    ;\n                                         o;;;;;\n                                        RT3",
      "raw": true
    },
    {
      "indent": 28,
      "text": "Adjacency Legend:",
      "ja": "隣接凡例："
    },
    {
      "indent": 31,
      "text": "----- Native adjacency (primary)\n***** Native adjacency (backup)\n::::: TE-compliant adjacency (primary)\n;;;;; TE-compliant adjacency (backup)",
      "raw": true
    },
    {
      "indent": 9,
      "text": "Figure 2. Two Adjacency Graphs with TE-Compliant Routers",
      "ja": "TE-準拠ルータと図2.2つの隣接グラフ"
    },
    {
      "indent": 0,
      "text": "8. TE LSAs for Packet Network",
      "section_title": true,
      "ja": "パケットネットワークのための8 TEのLSA"
    },
    {
      "indent": 3,
      "text": "The OSPFv2 protocol currently has a total of 11 LSA types. LSA types 1 through 5 are defined in [OSPF-V2]. LSA types 6, 7, and 8 are defined in [MOSPF], [NSSA], and [BGP-OSPF], respectively. LSA types 9 through 11 are defined in [OPAQUE].",
      "ja": "OSPFv2のプロトコルは、現在、11のLSAタイプの合計を有します。 LSAタイプ1〜5は、[OSPF-V2]で定義されています。 LSAタイプ6,7、および8は、それぞれ、[MOSPF]、[NSSA]、および[BGP-OSPF]で定義されています。 LSAタイプ9〜11は、[OPAQUE]で定義されています。"
    },
    {
      "indent": 3,
      "text": "Each LSA type has a unique flooding scope. Opaque LSA types 9 through 11 are general purpose LSAs, with flooding scope set to link-local, area-local, and AS-wide (except stub areas) respectively.",
      "ja": "各LSAタイプは、独自の氾濫範囲を持っています。オペークLSAタイプ9〜11は、それぞれ、（スタブエリアを除く）リンクローカルエリアローカル、およびAS-ワイドに設定氾濫範囲で、汎用のLSAです。"
    },
    {
      "indent": 3,
      "text": "In the following subsections, we define new LSAs for traffic engineering (TE) use. The values for the new TE LSA types are assigned with the high bit of the LSA-type octet set to 1. The new TE LSAs are largely modeled after the existing LSAs for content format and have a unique flooding scope.",
      "ja": "以下のサブセクションでは、我々は、トラフィックエンジニアリング（TE）の使用のための新しいLSAを定義します。新しいTE LSAタイプの値は、新規のTEのLSAは、主コンテンツフォーマットのための既存のLSAをモデルにした、ユニークな氾濫範囲を有している1に設定LSA型オクテットの高いビットが割り当てられます。"
    },
    {
      "indent": 3,
      "text": "TE-router LSA is defined to advertise TE characteristics of an OSPF-xTE router and all the TE links attached to the router. TE-incremental-Link-Update LSA is defined to advertise incremental updates to the metrics of a TE link. Flooding scope for both these LSAs is restricted to an area.",
      "ja": "TE-ルータLSAは、OSPF-XTEルータやルータに接続されているすべてのTEリンクのTEの特性を宣伝するために定義されています。 TE-インクリメンタル・リンクアップデートLSAは、TEリンクのメトリクスに増分更新を宣伝するために定義されています。両方のこれらのLSAのための氾濫範囲は領域に制限されています。"
    },
    {
      "indent": 3,
      "text": "TE-Summary network and router LSAs are defined to advertise the reachability of area-specific TE networks and area border routers (along with router TE characteristics) to external areas. Flooding scope of the TE-Summary LSAs is the TE topology in the entire AS less the non-backbone area for which the advertising router is an ABR. Just as with native OSPF summary LSAs, the TE-Summary LSAs do not reveal the topological details of an area to external areas.",
      "ja": "TE-概要ネットワークとルータLSAは領域特異TEネットワークと外部領域への（ルータTE特性と共に）エリア境界ルータの到達可能性を宣伝するために定義されています。 TE-サマリーLSAのフラッディングスコープは、広告ルータがABRであるため少ない非バックボーンエリアAS全体でのTEトポロジです。ただ、ネイティブのOSPF集約LSAと同様に、TE-サマリLSAは、外部領域への領域の位相的な詳細を明らかにしません。"
    },
    {
      "indent": 3,
      "text": "TE-AS-external LSA and TE-Circuit-Path LSA are defined to advertise AS external network reachability and pre-engineered TE circuits, respectively. While flooding scope for both these LSAs can be the entire AS, flooding scope for the pre-engineered TE circuit LSA may optionally be restricted to just the TE topology within an area.",
      "ja": "TE-AS外部LSAとTE-回路パスLSAは、それぞれ、AS外部のネットワーク到達可能性と事前設計TE回路を宣伝するために定義されています。これらのLSAは全体ASすることができ、両方のスコープをフラッディングしながら、予め操作TE LSA回路用の氾濫範囲は、必要に応じてエリア内だけTEトポロジに制限されてもよいです。"
    },
    {
      "indent": 0,
      "text": "8.1. TE-Router LSA (0x81)",
      "section_title": true,
      "ja": "8.1.  TE-ルータLSA（0x81と）"
    },
    {
      "indent": 3,
      "text": "The TE-router LSA (0x81) is modeled after the router LSA and has the same flooding scope as the router LSA. However, the scope is restricted to only the OSPF-xTE nodes within the area. The TE router LSA describes the TE metrics of the router as well as the TE links attached to the router. Below is the format of the TE-router LSA. Unless specified explicitly otherwise, the fields carry the same meaning as they do in a router LSA. Only the differences are explained below. Router-TE flags, Router-TE TLVs, Link-TE options, and Link-TE TLVs are each described in the following sub-sections.",
      "ja": "TE-ルータLSA（0x81と）は、ルータLSAをモデルとルータLSAと同一の氾濫範囲を有しています。しかしながら、範囲は領域内のみOSPF-XTEノードに制限されています。 TEルータLSAは、ルータのTE測定基準だけでなく、ルータに接続されているTEリンクについて説明します。以下は、TE-ルータLSAのフォーマットがあります。明示的に別段の定めがない限り、フィールドは、ルータLSAで、彼らがそうであるように同じ意味を運びます。唯一の相違点は、以下に説明されています。ルータ-TEフラグ、ルータ-TEのTLV、リンクTEオプション、およびリンク-TEのTLVは、それぞれ以下のサブセクションで説明されています。"
    },
    {
      "indent": 7,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|            LS age             |     Options   |     0x81      |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                        Link State ID                          |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     Advertising Router                        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     LS sequence number                        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         LS checksum           |             length            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|    0    |V|E|B|      0        |       Router-TE flags         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|  Router-TE flags (contd.)     |       Router-TE TLVs          |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     ....                                      |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     ....      |            # of TE links      |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                          Link ID                              |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                         Link Data                             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Type      |        0      |    Link-TE flags              |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|   Link-TE flags (contd.)      |  Zero or more Link-TE TLVs    |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                          Link ID                              |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                         Link Data                             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                              ...                              |",
      "raw": true
    },
    {
      "indent": 0,
      "text": "8.1.1. Router-TE Flags: TE Capabilities of the Router",
      "section_title": true,
      "ja": "8.1.1. ルータ-TEフラグ：ルータのTE機能"
    },
    {
      "indent": 3,
      "text": "The following flags are used to describe the TE capabilities of an OSPF-xTE router. The remaining bits of the 32-bit word are reserved for future use.",
      "ja": "以下のフラグは、OSPF-XTEルータのTE能力を記述するために使用されています。 32ビット・ワードの残りのビットは将来の使用のために予約されています。"
    },
    {
      "indent": 7,
      "text": "+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|L|L|P| | | |                                             |L|S|C|\n|S|E|S| | | |                                             |S|I|S|\n|R|R|C| | | |                                             |P|G|P|\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|<---- Boolean TE flags ------->|<- TE flags pointing to TLVs ->|",
      "raw": true
    },
    {
      "indent": 7,
      "text": "Bit LSR - When set, the router is considered to have LSR (Label-Switched Router) capability.",
      "ja": "ビットLSRは - 設定すると、ルータは、LSR（ラベルスイッチルータ）の能力を有すると考えられます。"
    },
    {
      "indent": 7,
      "text": "Bit LER - When set, the router is considered to have LER capability. All MPLS border routers will be required to have LER capability. Setting both the LER and E bits indicates an AS Boundary router with LER capability. Setting both the LER and B bits indicates an area border router with LER capability.",
      "ja": "ビットLER  - 設定すると、ルータはLERの機能を有すると考えられます。すべてのMPLS境界ルータはLER能力が要求されます。 LERとEビットの両方を設定すると、LERの機能を持つAS境界ルータを示します。 LERとBビットの両方を設定すると、LER能力を有するエリアボーダルータを示しています。"
    },
    {
      "indent": 7,
      "text": "Bit PSC - Indicates the node is packet-switch capable.",
      "ja": "ビットPSCは - ノードがパケット交換が可能であることを示します。"
    },
    {
      "indent": 7,
      "text": "Bit LSP - An MPLS Label switch TLV TE-NODE-TLV-MPLS-SWITCHING follows. This is applicable only when the PSC flag is set.",
      "ja": "ビットLSP  -  TLV TE-NODE-TLV-MPLS-スイッチングは、次のMPLSラベルスイッチ。これは、PSCフラグが設定されている場合にのみ適用されます。"
    },
    {
      "indent": 7,
      "text": "Bit SIG - An MPLS Signaling-protocol-support TLV TE-NODE-TLV-MPLS-SIG-PROTOCOLS follows.",
      "ja": "ビットSIG  -  TLV TE-NODE-TLV-MPLS-SIG-プロトコルは、次のMPLSシグナリング・プロトコルをサポート。"
    },
    {
      "indent": 7,
      "text": "BIT CSPF - A CSPF algorithm support TLV TE-NODE-TLV-CSPF-ALG follows.",
      "ja": "BIT CSPF  -  CSPFアルゴリズムのサポートTLV TE-NODE-TLV-CSPF-ALGは、以下の通りです。"
    },
    {
      "indent": 0,
      "text": "8.1.2. Router-TE TLVs",
      "section_title": true,
      "ja": "8.1.2. ルータ-TEのTLV"
    },
    {
      "indent": 3,
      "text": "The following Router-TE TLVs are defined.",
      "ja": "次のルータ-TE TLVが定義されています。"
    },
    {
      "indent": 0,
      "text": "8.1.2.1. TE-NODE-TLV-MPLS-SWITCHING",
      "section_title": true,
      "ja": "8.1.2.1。 TE-NODE-TLV-MPLSスイッチング"
    },
    {
      "indent": 3,
      "text": "MPLS switching TLV is applicable only for packet switched nodes. The TLV specifies the MPLS packet switching capabilities of the TE node.",
      "ja": "MPLSスイッチングTLVは、パケットがノードの切り替えのみ適用されます。 TLVは、TEノードの機能を切り替えるMPLSパケットを指定します。"
    },
    {
      "indent": 7,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|            Tag = 0x8001       |     Length = 6                |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n| Label Depth   |  QOS          |                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Label Depth is the depth of label stack the node is capable of processing on its ingress interfaces. An octet is used to represent label depth. A default value of 1 is assumed when the TLV is not listed. Label depth is relevant when an LER has to pop multiple labels off the MPLS stack.",
      "ja": "ラベルの深さは、その入力インターフェイス上のノードが処理することが可能なラベルスタックの深さです。オクテットは、ラベルの深さを表すために使用されます。 TLVがリストされていないとき、1のデフォルト値が仮定されます。 LERは、MPLSのスタックから複数のラベルをポップしなければならないときラベルの深さが関連しています。"
    },
    {
      "indent": 3,
      "text": "QOS is a single-octet field that may be assigned '1' or '0'. Nodes supporting QOS are able to interpret the EXP bits in the MPLS header to prioritize multiple classes of traffic through the same LSP.",
      "ja": "QOSは、「1」割り当てることができる単一のオクテットフィールドであるか、「0」。 QoSをサポートするノードが同じLSPを通過するトラフィックの複数のクラスを優先するためにMPLSヘッダ内EXPビットを解釈することができます。"
    },
    {
      "indent": 0,
      "text": "8.1.2.2. TE-NODE-TLV-MPLS-SIG-PROTOCOLS",
      "section_title": true,
      "ja": "8.1.2.2。 TE-NODE-TLV-MPLS-SIG-PROTOCOLS"
    },
    {
      "indent": 3,
      "text": "MPLS signaling protocols TLV lists all the signaling protocol supported by the node. An octet is used to list each signaling protocol supported.",
      "ja": "TLVは、ノードによってサポートされるすべてのシグナリングプロトコルを示していますシグナリングプロトコルMPLS。オクテットは、サポートされる各シグナリングプロトコルを一覧表示するために使用されます。"
    },
    {
      "indent": 7,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|            Tag = 0x8002       |     Length = 5, 6 or 7        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|   Protocol-1  |   ...         |      ....                     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "RSVP-TE protocol is represented as 1, CR-LDP as 2, and LDP as 3. These are the only permitted signaling protocols at this time.",
      "ja": "RSVP-TEプロトコルはこれらのみ現時点でシグナリングプロトコルが許可されている3として2として1、CR-LDPとして表され、LDPれます。"
    },
    {
      "indent": 0,
      "text": "8.1.2.3. TE-NODE-TLV-CSPF-ALGORITHMS",
      "section_title": true,
      "ja": "8.1.2.3。 TE-NODE-TLV-CSPF-ALGORITHMS"
    },
    {
      "indent": 3,
      "text": "The CSPF algorithms TLV lists all the CSPF algorithm codes supported. Support for CSPF algorithms makes the node eligible to compute complete or partial circuit paths. Support for CSPF algorithms can also be beneficial in knowing whether or not a node is capable of expanding loose routes (in an MPLS signaling request) into a detailed circuit path.",
      "ja": "CSPFは、TLVがサポートされているすべてのCSPFアルゴリズムのコードを示しますアルゴリズム。 CSPFアルゴリズムのサポートは、完全または部分的な回路経路を計算するノードが対象となります。 CSPFアルゴリズムのサポートは、ノードが詳細な回路パスに（MPLSシグナリング要求に）緩いルートを拡大することが可能であるか否かを知ることに有益であり得ます。"
    },
    {
      "indent": 3,
      "text": "Two octets are used to list each CSPF algorithm code. The algorithm codes may be vendor defined and unique within an Autonomous System. If the node supports 'n' CSPF algorithms, the Length would be (4 + 4 * ((n+1)/2)) octets.",
      "ja": "2つのオクテットは、各CSPFアルゴリズムのコードをリストするために使用されています。アルゴリズムコードは、ベンダー自律システム内で定義され、一意であってもよいです。ノードが 'N' CSPFアルゴリズムをサポートしている場合、長さは（4 + 4 *（（N + 1）/ 2））オクテットであろう。"
    },
    {
      "indent": 7,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|            Tag = 0x8003       |     Length = 4(1 + (n+1)/2)   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                    CSPF-1     |      ....                     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                    CSPF-n     |                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "8.1.2.4. TE-NODE-TLV-NULL",
      "section_title": true,
      "ja": "8.1.2.4。 TE-NODE-TLV-NULL"
    },
    {
      "indent": 3,
      "text": "When a TE-Router or a TE link has multiple TLVs to describe the metrics, the NULL TLV is used to terminate the TLV list.",
      "ja": "TE-ルータまたはTEリンクメトリックを記述するために複数のTLVを有する場合、NULL TLVは、TLVリストを終了するために使用されます。"
    },
    {
      "indent": 7,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|            Tag = 0x8888       |     Length = 4                |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "8.1.3. Link-TE Flags: TE Capabilities of a Link",
      "section_title": true,
      "ja": "8.1.3. リンク-TEフラグ：リンクのTE機能"
    },
    {
      "indent": 3,
      "text": "The following flags are used to describe the TE capabilities of a link. The remaining bits of the 32-bit word are reserved for future use.",
      "ja": "以下のフラグは、リンクのTE能力を記述するために使用されています。 32ビット・ワードの残りのビットは将来の使用のために予約されています。"
    },
    {
      "indent": 7,
      "text": "+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|T|N|P| | | |D|                                         |S|L|B|C|\n|E|T|K| | | |B|                                         |R|U|W|O|\n| |E|T| | | |S|                                         |L|G| |L|\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|<---- Boolean TE flags ------->|<- TE flags pointing to TLVs ->|",
      "raw": true
    },
    {
      "indent": 7,
      "text": "Bit TE - Indicates whether TE is permitted on the link. A link can be denied for TE use by setting the flag to 0.",
      "ja": "TEビット -  TEはリンク上で許可されているかどうかを示します。リンクが0にフラグを設定することにより、TE使用のために拒否することができます。"
    },
    {
      "indent": 7,
      "text": "Bit NTE - Indicates whether non-TE traffic is permitted on the TE link. This flag is relevant only when the TE flag is set.",
      "ja": "ビットNTEは - 非TEトラフィックがTEリンクに許可されているかどうかを示します。このフラグは、TEフラグが設定されている場合のみ必要です。"
    },
    {
      "indent": 7,
      "text": "Bit PKT - Indicates whether or not the link is capable of IP packet processing.",
      "ja": "ビットPKTは - リンクがIPパケット処理が可能であるかどうかを示します。"
    },
    {
      "indent": 7,
      "text": "Bit DBS - Indicates whether or not database synchronization is permitted on this link.",
      "ja": "ビットDBSは - データベースの同期は、このリンク上で許可されているかどうかを示します。"
    },
    {
      "indent": 7,
      "text": "Bit SRLG - Shared Risk Link Group TLV TE-LINK-TLV-SRLG follows.",
      "ja": "ビットSRLG  - 共有リスクリンクグループTLV TE-LINK-TLV-SRLGは、以下の通りです。"
    },
    {
      "indent": 7,
      "text": "Bit LUG - Link Usage Cost Metric TLV TE-LINK-TLV-LUG follows.",
      "ja": "ビットLUG  - リンク使用コストメトリックTLV TE-LINK-TLV-LUGは、以下の通りです。"
    },
    {
      "indent": 7,
      "text": "Bit BW - One or more Link Bandwidth TLVs follow.",
      "ja": "ビットBW  -  1つの以上のリンク帯域幅のTLVは以下の通り。"
    },
    {
      "indent": 7,
      "text": "Bit COL - Link Color TLV TE-LINK-TLV-COLOR follows.",
      "ja": "ビットCOL  - リンクの色TLV TE-LINK-TLV-COLORは、以下の通りです。"
    },
    {
      "indent": 0,
      "text": "8.1.4. Link-TE TLVs",
      "section_title": true,
      "ja": "8.1.4. リンク-TEのTLV"
    },
    {
      "indent": 0,
      "text": "8.1.4.1. TE-LINK-TLV-SRLG",
      "section_title": true,
      "ja": "8.1.4.1。 TE-LINK-TLV-SRLG"
    },
    {
      "indent": 3,
      "text": "The SRLG describes the list of Shared Risk Link Groups (SRLG) the link belongs to. Two octets are used to list each SRLG. If the link belongs to 'n' SRLGs, the Length would be (4 + 4 * ((n+1)/2)) octets.",
      "ja": "SRLGは、リンクが属する共有リスクリンクグループ（SRLG）のリストを示します。 2つのオクテットは、各SRLGをリストするために使用されています。リンクが 'N' にSRLGs属している場合、長さは（4 + 4 *（（N + 1）/ 2））オクテットであろう。"
    },
    {
      "indent": 7,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|            Tag = 0x0001       |     Length = 4(1 + (n+1)/2)   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                    SRLG-1     |      ....                     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                    SRLG-n     |                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "8.1.4.2 TE-LINK-TLV-BANDWIDTH-MAX",
      "section_title": true,
      "ja": "8.1.4.2 TE-LINK-TLV帯域幅-MAX"
    },
    {
      "indent": 3,
      "text": "The Bandwidth TLV specifies the maximum bandwidth of the link, as follows.",
      "ja": "次のように帯域幅のTLVは、リンクの最大帯域幅を指定します。"
    },
    {
      "indent": 7,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|            Tag = 0x0002       |     Length = 8                |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                      Maximum Bandwidth                        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Bandwidth is expressed in units of 32 bytes/sec (256 bits/sec). A 32-bit field for bandwidth would permit specification not exceeding 1 terabit/sec.",
      "ja": "帯域幅は32のバイト/秒（256ビット/秒）の単位で表されます。帯域幅のための32ビットのフィールドは、1テラビット/秒を超えない仕様を可能にします。"
    },
    {
      "indent": 3,
      "text": "Maximum Bandwidth is the maximum link capacity expressed in bandwidth units. Portions or all of this bandwidth may be used for TE use.",
      "ja": "最大帯域幅は、帯域幅の単位で表される最大リンク容量です。一部またはこのすべての帯域幅は、TEの使用のために使用することができます。"
    },
    {
      "indent": 0,
      "text": "8.1.4.3. TE-LINK-TLV-BANDWIDTH-MAX-FOR-TE",
      "section_title": true,
      "ja": "8.1.4.3。 TE-LINK-TLV-帯域幅MAX-FOR-TE"
    },
    {
      "indent": 3,
      "text": "The Bandwidth TLV specifies the maximum bandwidth available for TE use, as follows.",
      "ja": "次のように帯域幅のTLVは、TEの使用のために利用可能な最大帯域幅を指定します。"
    },
    {
      "indent": 7,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|            Tag = 0x0003       |     Length = 8                |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|              Maximum Bandwidth available for TE use           |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Bandwidth is expressed in units of 32 bytes/sec (256 bits/sec). A 32-bit field for bandwidth would permit specification not exceeding 1 terabit/sec.",
      "ja": "帯域幅は32のバイト/秒（256ビット/秒）の単位で表されます。帯域幅のための32ビットのフィールドは、1テラビット/秒を超えない仕様を可能にします。"
    },
    {
      "indent": 3,
      "text": "\"Maximum Bandwidth available for TE use\" is the total reservable bandwidth on the link for use by all the TE circuit paths traversing the link. The link is oversubscribed when this field is more than the Maximum Bandwidth. When the field is less than the Maximum Bandwidth, the remaining bandwidth on the link may be used for non-TE traffic in a mixed network.",
      "ja": "「TEの使用可能な最大帯域幅は、」リンクを通過するすべてのTE回路パスが使用するためのリンク上の合計予約可能帯域幅です。このフィールドは、最大帯域幅を超えているときに、リンクがオーバーサブスクライブです。フィールドは、最大帯域幅より小さい場合、リンク上の残りの帯域幅は、混合ネットワーク中の非TEトラフィックのために使用することができます。"
    },
    {
      "indent": 0,
      "text": "8.1.4.4. TE-LINK-TLV-BANDWIDTH-TE",
      "section_title": true,
      "ja": "8.1.4.4。 TE-LINK-TLV帯域幅-TE"
    },
    {
      "indent": 3,
      "text": "The Bandwidth TLV specifies the bandwidth reserved for TE as follows.",
      "ja": "帯域幅のTLVは、次のようにTEのために確保された帯域幅を指定します。"
    },
    {
      "indent": 7,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|            Tag = 0x0004       |     Length = 8                |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                      TE Bandwidth subscribed                  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Bandwidth is expressed in units of 32 bytes/sec (256 bits/sec). A 32-bit field for bandwidth would permit specification not exceeding 1 terabit/sec.",
      "ja": "帯域幅は32のバイト/秒（256ビット/秒）の単位で表されます。帯域幅のための32ビットのフィールドは、1テラビット/秒を超えない仕様を可能にします。"
    },
    {
      "indent": 3,
      "text": "\"TE Bandwidth subscribed\" is the bandwidth that is currently subscribed from of the link. \"TE Bandwidth subscribed\" must be less than the \"Maximum bandwidth available for TE use\". New TE circuit paths are able to claim no more than the difference between the two bandwidths for reservation.",
      "ja": "「TE帯域幅が加入し、」現在のリンクのから購読されている帯域幅があります。 「TEを使用するために利用できる最大帯域幅」未満でなければなりません「TE帯域幅は、サブスクライブ」。新しいTE回路パスは、予約のための2つの帯域幅の間の差以下で主張しないことが可能です。"
    },
    {
      "indent": 0,
      "text": "8.1.4.5. TE-LINK-TLV-LUG",
      "section_title": true,
      "ja": "8.1.4.5。 TE-LINK-TLV-広く"
    },
    {
      "indent": 3,
      "text": "The link usage cost TLV specifies bandwidth unit usage cost, TE circuit set-up cost, and any time constraints for setup and teardown of TE circuits on the link.",
      "ja": "リンク使用コストTLVは、帯域幅ユニットの使用コスト、TE回路のセットアップコスト、およびリンク上のTE回路のセットアップとティアダウンのための任意の時間の制約を指定します。"
    },
    {
      "indent": 7,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|            Tag = 0x0005       |     Length = 28               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                      Bandwidth unit usage cost                |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                      TE circuit set-up cost                   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                      TE circuit set-up time constraint        |\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                      TE circuit tear-down time constraint     |\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Circuit Setup time constraint",
      "ja": "回路のセットアップ時間の制約"
    },
    {
      "indent": 7,
      "text": "This 64-bit number specifies the time at or after which a TE-\ncircuit path may be set up on the link.  The set-up time\nconstraint is specified as the number of seconds from the start\nof January 1, 1970 UTC.  A reserved value of 0 implies no circuit\nsetup time constraint.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Circuit Teardown time constraint",
      "ja": "回路ティアダウン時間の制約"
    },
    {
      "indent": 7,
      "text": "This 64-bit number specifies the time at or before which all TE-\ncircuit paths using the link must be torn down.  The teardown\ntime constraint is specified as the number of seconds from the\nstart of January 1 1970 UTC.  A reserved value of 0 implies no\ncircuit teardown time constraint.",
      "raw": true
    },
    {
      "indent": 0,
      "text": "8.1.4.6. TE-LINK-TLV-COLOR",
      "section_title": true,
      "ja": "8.1.4.6。 TE-LINK-TLV-COLOR"
    },
    {
      "indent": 3,
      "text": "The color TLV is similar to the SRLG TLV, in that an Autonomous System may choose to issue colors to a TE link meeting certain criteria. The color TLV can be used to specify one or more colors assigned to the link as follows. Two octets are used to list each color. If the link belongs to 'n' number of colors, the Length would be (4 + 4 * ((n+1)/2)) octets.",
      "ja": "色TLVは、その中で自律システムは、一定の基準を満たすTEリンクに色を発行することを選択することができ、SRLG TLVに似ています。カラーTLVは以下のようにリンクに割り当てられた1つ以上の色を指定するために使用することができます。 2つのオクテットは、各色のリストを表示するために使用されています。リンクは、色の 'n' 個の数に属している場合、長さは（4 + 4 *（（N + 1）/ 2））オクテットであろう。"
    },
    {
      "indent": 7,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|            Tag = 0x0006       |     Length = 4(1 + (n+1)/2)   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                    Color-1    |      ....                     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                    Color-n    |                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "8.1.4.7. TE-LINK-TLV-NULL",
      "section_title": true,
      "ja": "8.1.4.7。 TE-LINK-TLV-ヌル"
    },
    {
      "indent": 3,
      "text": "When a TE link has multiple TLVs to describe its metrics, the NULL TLV is used to terminate the TLV list. The TE-LINK-TLV-NULL is same as the TE-NODE-TLV-NULL described in section 8.1.2.4",
      "ja": "TEリンクはそのメトリックを記述するために、複数のTLVを持っている場合は、NULL TLVは、TLVリストを終了するために使用されます。 TE-LINK-TLV-NULLは、TE-NODE-TLV-NULLは、セクション8.1.2.4に記載したのと同じです"
    },
    {
      "indent": 0,
      "text": "8.2. TE-Incremental-Link-Update LSA (0x8d)",
      "section_title": true,
      "ja": "8.2.  TE-インクリメンタル・リンクアップデートLSA（0x8d）"
    },
    {
      "indent": 3,
      "text": "A significant difference between a native OSPF network and a TE network is that the latter may be subject to frequent real-time circuit pinning and is likely to undergo TE-state updates. Some links might undergo changes more frequently than others. Flooding the network with TE-router LSAs at the aggregated speed of all link metric changes is simply not desirable. A smaller in size TE-incremental-link-update LSA is designed to advertise only the incremental link updates.",
      "ja": "ネイティブOSPFネットワークとTEネットワークとの間に有意な差は、後者が頻繁リアルタイム回路ピンニングを受ける可能性があるということであるとTE-状態更新を受ける可能性があります。いくつかのリンクは、他の人よりも頻繁に変化を受けるかもしれません。すべてのリンクのメトリックの変更の凝集速度でTE-ルータLSAとネットワークをフラッディングは、単に好ましくない。小型TE-インクリメンタルリンク更新LSAだけインクリメンタルリンクの更新を宣伝するために設計されています。"
    },
    {
      "indent": 3,
      "text": "A TE-incremental-link-update LSA will be advertised as frequently as the link state is changed (not exceeding once every MinLSInterval seconds). The TE link sequence is largely the advertisement of a sub-portion of router LSA. The sequence number on this will be incremented with the TE-router LSA's sequence as the basis. When an updated TE-router LSA is advertised within 30 minutes of the previous advertisement, the updated TE-router LSA will assume a sequence number that is larger than the most frequently updated of its links.",
      "ja": "TE-インクリメンタルリンク更新LSAは、リンク状態と同じ頻度でアドバタイズされます（一度MinLSInterval秒を超えない）に変更されます。 TEリンクシーケンスは、主に、ルータLSAのサブ部分の広告です。この上のシーケンス番号を基礎として、TE-ルータLSAのシーケンスでインクリメントされます。更新TE-ルータLSAは、前回広告の30分以内に公示された場合、更新されたTE-ルータLSAは、最も頻繁にそのリンクの更新よりも大きいシーケンス番号を想定します。"
    },
    {
      "indent": 3,
      "text": "Below is the format of the TE-incremental-link-update LSA.",
      "ja": "以下は、TE-インクリメンタルリンク更新LSAのフォーマットがあります。"
    },
    {
      "indent": 7,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|            LS age             |     Options   |     0x8d      |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                        Link State ID (same as Link ID)        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     Advertising Router                        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     LS sequence number                        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         LS checksum           |             length            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                         Link Data                             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Type      |        0      |    Link-TE options            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Link-TE options           | Zero or more Link-TE TLVs     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     # TOS     |                            metric             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                              ...                              |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|      TOS      |        0      |          TOS  metric          |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Link State ID",
      "ja": "リンクステートID"
    },
    {
      "indent": 7,
      "text": "This would be exactly the same as would have been specified for\nLink ID, for a link within the router LSA.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Link Data",
      "ja": "リンクデータ"
    },
    {
      "indent": 7,
      "text": "This specifies the router ID the link belongs to.  In majority of\ncases, this would be same as the advertising router.  This choice\nfor Link Data is primarily to facilitate proxy advertisement for\nincremental link updates.",
      "raw": true
    },
    {
      "indent": 7,
      "text": "Suppose that a proxy router LSA was used to advertise the TE-router LSA of a SONET/TDM node, and that the proxy router is now required to advertise incremental-link-update for the same SONET/TDM node. Specifying the actual router-ID to which the link in the incremental-link-update LSA belongs helps receiving nodes in finding the exact match for the LSA in their database.",
      "ja": "プロキシルータLSAは、SONET / TDMノードのTE-ルータLSAをアドバタイズするために使用される、プロキシルータは現在同じSONET / TDMノードのインクリメンタルリンク更新をアドバタイズする必要があるということであったと仮定する。インクリメンタルリンク更新LSA内のリンク属するが、そのデータベースにLSAのための完全な一致を見つけるの受信ノード役立つために、実際のルータIDを指定します。"
    },
    {
      "indent": 7,
      "text": "The tuple of (LS Type, LSA ID, Advertising router) uniquely identifies the LSA and replaces LSAs of the same tuple with an older sequence number. However, there is an exception to this rule in the context of TE-link-update LSA. TE-Link-update LSA will initially assume the sequence number of the TE-router LSA it belongs to. Further, when a new TE-router LSA update with a larger sequence number is advertised, the newer sequence number is assumed by all the link LSAs.",
      "ja": "（LSタイプ、LSA ID、広告ルータ）のタプルは一意にLSAを識別し、古いシーケンス番号と同じ組のLSAを置き換えます。しかし、TE-リンクアップデートLSAのコンテキストで、この規則の例外があります。 TE-リンクアップデートLSAは、最初にそれが属するTE-ルータLSAのシーケンス番号を想定します。より大きなシーケンス番号を持つ新しいTE-ルータLSAの更新が公示されたときにまた、新しいシーケンス番号は、すべてのリンクのLSAが想定されます。"
    },
    {
      "indent": 0,
      "text": "8.3. TE-Circuit-Path LSA (0x8C)",
      "section_title": true,
      "ja": "8.3.  TE-回路パスLSA（0x8C）"
    },
    {
      "indent": 3,
      "text": "TE-Circuit-path LSA (next page) may be used to advertise the availability of pre-engineered TE circuit path(s) originating from any router in the network. The flooding scope may be area-wide or AS-wide. Fields are as follows.",
      "ja": "TE-回路パスLSA（次ページ）は、ネットワーク内の任意のルータからプレ操作TE回路パス（複数の）元の可用性を宣伝するために使用することができます。氾濫範囲はエリア全体またはAS-広いかもしれません。次のようにフィールドがあります。"
    },
    {
      "indent": 3,
      "text": "Link State ID",
      "ja": "リンクステートID"
    },
    {
      "indent": 3,
      "text": "The ID of the far-end router or the far-end link-ID to which the TE circuit path(s) is being advertised.",
      "ja": "TE回路パス（S）への遠端ルータまたは遠端リンクIDのIDをアドバタイズしています。"
    },
    {
      "indent": 3,
      "text": "TE-circuit-path(s) flags",
      "ja": "TE-回路パス（S）フラグ"
    },
    {
      "indent": 7,
      "text": "Bit G - When set, the flooding scope is set to be AS-wide.\n        Otherwise, the flooding scope is set to be area-wide.",
      "raw": true
    },
    {
      "indent": 7,
      "text": "Bit E - When set, the advertised Link-State ID is an AS boundary router (E is for external). The advertising router and the Link State ID belong to the same area.",
      "ja": "ビットE  - セット、宣伝リンクステートIDは、AS境界ルータ（Eは外部のためである）です。広告ルータおよびリンクステートIDは、同じ領域に属します。"
    },
    {
      "indent": 7,
      "text": "Bit B - When set, the advertised Link State ID is an area border router (B is for Border)",
      "ja": "ビットB  - セット、宣伝リンクステートIDがエリアボーダルータ（Bボーダーのためです）"
    },
    {
      "indent": 7,
      "text": "Bit D - When set, this indicates that the duration of circuit path validity follows.",
      "ja": "ビットD  - 設定した場合、これは、回路パスの有効期間が続くことを示しています。"
    },
    {
      "indent": 7,
      "text": "Bit S - When set, this indicates that setup time of the circuit path follows.",
      "ja": "ビットS  - 設定すると、これは、回路パスの設定時間が続くことを示しています。"
    },
    {
      "indent": 7,
      "text": "Bit T - When set, this indicates that teardown time of the circuit path follows.",
      "ja": "ビットTは、 - 設定されている場合、これは、回路パスのティアダウン時間が続くことを示しています。"
    },
    {
      "indent": 7,
      "text": "CktType - This 4-bit field specifies the circuit type of the Forward Equivalency Class (FEC).",
      "ja": "CktType  - この4ビットのフィールドは、転送等価クラス（FEC）の回路タイプを指定します。"
    },
    {
      "indent": 16,
      "text": "0x01 - Origin is Router, Destination is Router.\n0x02 - Origin is Link,   Destination is Link.\n0x04 - Origin is Router, Destination is Link.\n0x08 - Origin is Link,   Destination is Router.",
      "raw": true
    },
    {
      "indent": 7,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|            LS age             |     Options   |      0x84     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                       Link State ID                           |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     Advertising Router                        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     LS sequence number                        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         LS checksum           |             Length            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|      0    |G|E|B|D|S|T|CktType| Circuit Duration (Optional)   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                 Circuit Duration cont...                      |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n| Circuit Duration cont..       | Circuit Setup time (Optional) |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                 Circuit Setup time cont...                    |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n| Circuit Setup time cont..     |Circuit Teardown time(Optional)|\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                 Circuit Teardown time cont...                 |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n| Circuit Teardown time cont..  |  No. of TE Circuit Paths      |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                          Circuit-TE ID                        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                         Circuit-TE Data                       |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Type      |        0      |    Circuit-TE flags           |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|   Circuit-TE flags (contd.)   |  Zero or more Circuit-TE TLVs |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                          Circuit-TE ID                        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                         Circuit-TE Data                       |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                              ...                              |",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Circuit Duration (Optional)",
      "ja": "回路の所要時間（オプション）"
    },
    {
      "indent": 7,
      "text": "This 64-bit number specifies the seconds from the time of the LSA\nadvertisement for which the pre-engineered circuit path will be\nvalid.  This field is specified only when the D-bit is set in the\nTE-circuit-path flags.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Circuit Setup time (Optional)",
      "ja": "回路のセットアップ時間（オプション）"
    },
    {
      "indent": 7,
      "text": "This 64-bit number specifies the time at which the TE circuit\npath may be set up.  This field is specified only when the S-bit\nis set in the TE-circuit-path flags.  The set-up time is\nspecified as the number of seconds from the start of January 1,\n1970 UTC.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Circuit Teardown time (Optional)",
      "ja": "回路ティアダウン時間（オプション）"
    },
    {
      "indent": 7,
      "text": "This 64-bit number specifies the time at which the TE circuit\npath may be torn down.  This field is specified only when the\nT-bit is set in the TE-circuit-path flags.  The teardown time is\nspecified as the number of seconds from the start of January 1\n1970 UTC.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "No. of TE Circuit Paths",
      "ja": "回線パスの番号"
    },
    {
      "indent": 7,
      "text": "This specifies the number of pre-engineered TE circuit paths\nbetween the advertising router and the router specified in the\nLink State ID.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Circuit-TE ID",
      "ja": "回路-TE ID"
    },
    {
      "indent": 7,
      "text": "This is the ID of the far-end router for a given TE circuit path\nsegment.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Circuit-TE Data",
      "ja": "回路-TEデータ"
    },
    {
      "indent": 7,
      "text": "This is the virtual link identifier on the near-end router for a\ngiven TE circuit path segment.  This can be a private interface\nor handle the near-end router uses to identify the virtual link.",
      "raw": true
    },
    {
      "indent": 7,
      "text": "The sequence of (Circuit-TE ID, Circuit-TE Data) pairs lists the end-point nodes and links in the LSA as a series.",
      "ja": "（回路-TE ID、回線TEデータ）ペアのシーケンスは一連のLSAにおける終点ノードとリンクを示しています。"
    },
    {
      "indent": 3,
      "text": "Circuit-TE flags",
      "ja": "回路-TEフラグ"
    },
    {
      "indent": 7,
      "text": "This lists the zero or more TE-link TLVs that all member elements\nof the LSP meet.",
      "raw": true
    },
    {
      "indent": 0,
      "text": "8.4. TE-Summary LSAs",
      "section_title": true,
      "ja": "8.4.  TE-サマリーLSA"
    },
    {
      "indent": 3,
      "text": "TE-Summary LSAs are Type 0x83 and 0x84 LSAs. These LSAs are originated by area border routers. A TE-Summary-network LSA (0x83) describes the reachability of TE networks in a non-backbone area, advertised by the area border router. A Type 0x84 summary LSA describes the reachability of area border routers and AS border routers and their TE capabilities.",
      "ja": "TE-サマリーLSAは、Type 0x83のと0x84のLSAをしています。これらのLSAはエリア境界ルータによって発信されています。 TE-概要 - ネットワークLSA（0x83の）は、エリア境界ルータによってアドバタイズ非バックボーンエリアでのTEネットワークの到達可能性を、説明しています。タイプ0x84の要約LSAは、エリア境界ルータの到達可能性を説明し、境界ルータとそのTE機能AS。"
    },
    {
      "indent": 3,
      "text": "One of the benefits of having multiple areas within an AS is that frequent TE advertisements within the area do not impact outside the area. Only the TE abstractions befitting the external areas are advertised.",
      "ja": "AS内の複数の領域を持つことの利点の一つは、エリア内で頻繁にTEの広告はエリア外に影響を与えないということです。外部領域にふさわしい唯一のTEの抽象化が宣伝されています。"
    },
    {
      "indent": 0,
      "text": "8.4.1. TE-Summary Network LSA (0x83)",
      "section_title": true,
      "ja": "8.4.1.  TE-概要ネットワークLSA（0x83の）"
    },
    {
      "indent": 3,
      "text": "A TE-Summary network LSA may be used to advertise reachability of TE-networks accessible to areas external to the originating area. The content and the flooding scope of a TE-Summary LSA is different from that of a native Summary LSA.",
      "ja": "TE-要約ネットワークLSAは、元の領域の外部の領域へのアクセスTE-ネットワークの到達可能性を宣伝するために使用することができます。コンテンツおよびTE-要約LSAの氾濫範囲は、天然の概要LSAとは異なります。"
    },
    {
      "indent": 3,
      "text": "The scope of flooding for a TE-Summary network LSA is AS-wide, with the exception of the originating area and the stub areas. The area border router for each non-backbone area is responsible for advertising the reachability of backbone networks into the area.",
      "ja": "TE-概要ネットワークLSAのための氾濫の範囲は、元の面積の例外とスタブエリアで、AS-広いです。各非バックボーンエリアのエリア境界ルータは、エリアにバックボーンネットワークの到達可能性を宣伝する責任があります。"
    },
    {
      "indent": 3,
      "text": "Unlike a native-summary network LSA, a TE-Summary network LSA does not advertise summary costs to reach networks within an area. This is because TE parameters are not necessarily additive or comparable. The parameters can be varied in their expression. For example, a TE-Summary network LSA will not summarize a network whose links do not fall under an SRLG (Shared-Risk Link Group). This way, the TE-Summary LSA merely advertises the reachability of TE networks within an area. The specific circuit paths can be computed by the ABR. Pre-engineered circuit paths are advertised using TE-Circuit-path LSAs(refer to Section 8.3).",
      "ja": "ネイティブ要約ネットワークLSAとは異なり、TE-概要ネットワークLSAは、エリア内のネットワークに到達するために要約コストをアドバタイズしません。 TEパラメータは、必ずしも添加剤又は比較できないためです。パラメータは、その発現に変化させることができます。例えば、TE-概要ネットワークLSAは、そのリンクのSRLG（共有リスクリンクグループ）に該当しないネットワークを要約しません。この方法では、TE-要約LSAは、単にエリア内のTEネットワークの到達可能性をアドバタイズします。特定の回路パスはABRによって計算することができます。プリ操作回路パスは（セクション8.3参照）TE-回路パスのLSAを使用してアドバタイズされます。"
    },
    {
      "indent": 7,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|            LS age             |     Options   |    0x83       |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                  Link State ID  (IP Network Number)           |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|            Advertising Router (Area Border Router)            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     LS sequence number                        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         LS checksum           |            Length             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                         Network Mask                          |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                         Area-ID                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "8.4.2. TE-Summary Router LSA (0x84)",
      "section_title": true,
      "ja": "8.4.2.  TE-概要ルータLSA（0x84の）"
    },
    {
      "indent": 4,
      "text": "A TE-Summary router LSA may be used to advertise the availability of\narea border routers (ABRs) and AS border routers (ASBRs) that are\nTE-capable.  The TE-Summary router LSAs are originated by the Area\nBorder Routers.  The scope of flooding for the TE-Summary router LSA\nis the non-backbone area the advertising ABR belongs to.",
      "raw": true
    },
    {
      "indent": 7,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|            LS age             |     Options   |      0x84     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     Link State ID                             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     Advertising Router (ABR)                  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     LS sequence number                        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         LS checksum           |             Length            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|    0      |E|B|      0        |       No. of Areas            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     Area-ID                                   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                       ...                                     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                   Router-TE flags                             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                   Router-TE TLVs                              |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     ....                                      |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Link State ID",
      "ja": "リンクステートID"
    },
    {
      "indent": 7,
      "text": "The ID of the area border router or the AS border router whose TE\ncapability is being advertised.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Advertising Router",
      "ja": "広告ルータ"
    },
    {
      "indent": 7,
      "text": "The ABR that advertises its TE capabilities (and the OSPF areas\nit belongs to) or the TE capabilities of an ASBR within one of\nthe areas for which the ABR is a border router.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "No. of Areas",
      "ja": "エリアの番号"
    },
    {
      "indent": 7,
      "text": "Specifies the number of OSPF areas the link state ID belongs to.",
      "ja": "リンクステートIDが属するOSPF領域の数を指定します。"
    },
    {
      "indent": 3,
      "text": "Area-ID",
      "ja": "エリア-ID"
    },
    {
      "indent": 7,
      "text": "Specifies the OSPF area(s) the link state ID belongs to.  When\nthe link state ID is same as the advertising router ID, the\nArea-ID lists all the areas the ABR belongs to.  In the case the\nlink state ID is an ASBR, the Area-ID simply lists the area the\nASBR belongs to.  The advertising router is assumed to be the ABR\nfrom the same area the ASBR is located in.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Summary-router-TE flags",
      "ja": "概要ルータ-TEフラグ"
    },
    {
      "indent": 7,
      "text": "Bit E - When set, the advertised Link-State ID is an AS boundary\n        router (E is for external).  The advertising router and\n        the Link State ID belong to the same area.",
      "raw": true
    },
    {
      "indent": 7,
      "text": "Bit B - When set, the advertised Link state ID is an Area border router (B is for Border)",
      "ja": "ビットB  - セット、広告を出してリンクステートIDは、エリア境界ルータである（Bがボーダーのためです）"
    },
    {
      "indent": 3,
      "text": "Router-TE flags, Router-TE TLVs",
      "ja": "ルータ-TEフラグ、ルータ-TEのTLV"
    },
    {
      "indent": 7,
      "text": "TE capabilities of the link-state-ID router.",
      "ja": "リンクステート-IDルータのTE機能を提供します。"
    },
    {
      "indent": 7,
      "text": "TE Flags and TE TLVs are as applicable to the ABR/ASBR specified in the link state ID. The semantics is same as specified in the Router-TE LSA.",
      "ja": "TEフラグとTEのTLVはリンクステートIDで指定されたABR / ASBRにとして適用されます。セマンティクスは、ルータ-TE LSAで指定されたと同じです。"
    },
    {
      "indent": 0,
      "text": "8.5. TE-AS-external LSAs (0x85)",
      "section_title": true,
      "ja": "8.5.  TE-AS-外部LSA（0x85）"
    },
    {
      "indent": 3,
      "text": "TE-AS-external LSAs are the Type 0x85 LSAs. This is modeled after AS-external LSA format and flooding scope. TE-AS-external LSAs are originated by AS boundary routers with TE extensions, and describe the TE networks and pre-engineered circuit paths external to the AS. As with AS-external LSA, the flooding scope of the TE-AS-external LSA is AS-wide, with the exception of stub areas.",
      "ja": "TE-AS-外部LSAは、0x85のLSAタイプです。これは、AS外部LSAのフォーマットや洪水の範囲をモデルにしています。 TE-AS-外部LSAをTE拡張子を持つAS境界ルータによって発信され、TEネットワークとASの外部プリ操作回路パスを記述しています。 AS外部LSAと同様に、TE-AS外部LSAの氾濫範囲は、スタブエリアを除いて、AS-広いです。"
    },
    {
      "indent": 7,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|            LS age             |     Options   |      0x85     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                        Link State ID                          |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     Advertising Router                        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     LS sequence number                        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         LS checksum           |             length            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                         Network Mask                          |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                       Forwarding address                      |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                      External Route Tag                       |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|  #  of Virtual TE links       |                 0             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                      Link-TE flags                            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                      Link-TE TLVs                             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                              ...                              |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                      TE-Forwarding address                    |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                      External Route TE Tag                    |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                              ...                              |",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Network Mask",
      "ja": "ネットワークマスク"
    },
    {
      "indent": 8,
      "text": "The IP address mask for the advertised TE destination.  For\nexample, this can be used to specify access to a specific TE\nnode or TE link with an mask of 0xffffffff.  This can also be\nused to specify access to an aggregated set of destinations\nusing a different mask.  ex: 0xff000000.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Link-TE flags, Link-TE TLVs",
      "ja": "リンクTEフラグ、リンク-TEのTLV"
    },
    {
      "indent": 8,
      "text": "The TE attributes of this route.  These fields are optional and\nare provided only when one or more pre-engineered circuits can\nbe specified with the advertisement.  Without these fields, the\nLSA will simply state TE reachability info.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Forwarding address",
      "ja": "転送先アドレス"
    },
    {
      "indent": 8,
      "text": "Data traffic for the advertised destination will be forwarded to\nthis address.  If the Forwarding address is set to 0.0.0.0, data\ntraffic will be forwarded instead to the LSA's originator (i.e.,\nthe responsible AS boundary router).",
      "raw": true
    },
    {
      "indent": 3,
      "text": "External Route Tag",
      "ja": "外部ルートタグ"
    },
    {
      "indent": 8,
      "text": "A 32-bit field attached to each external route.  This is not\nused by the OSPF protocol itself.  It may be used to communicate\ninformation between AS boundary routers; the precise nature of\nsuch information is outside the scope of this specification.",
      "raw": true
    },
    {
      "indent": 0,
      "text": "9. TE LSAs for Non-Packet Network",
      "section_title": true,
      "ja": "非パケットネットワークのための9 TEのLSA"
    },
    {
      "indent": 3,
      "text": "A non-packet network would use the TE LSAs described in the previous section for a packet network with some variations. These variations are described in the following subsections.",
      "ja": "非パケットネットワークは、いくつかのバリエーションとパケットネットワークのための前のセクションで説明したTE LSAを使用します。これらの変動は、以下のサブセクションに記載されています。"
    },
    {
      "indent": 3,
      "text": "Two new LSAs, TE-Positional-ring-network LSA and TE-Router-Proxy LSA are defined for use in non-packet TE networks.",
      "ja": "二つの新しいLSAを、TE-定位置-リングネットワークLSAとTE-ルータプロキシLSAは、非パケットTEネットワークで使用するために定義されています。"
    },
    {
      "indent": 3,
      "text": "Readers may refer to [SONET-SDH] for a detailed description of the terms used in the context of SONET/SDH TDM networks,",
      "ja": "読者は、SONET / SDHのTDMネットワークの文脈で使用される用語の詳細については、[SONET、SDH]を参照することができます"
    },
    {
      "indent": 0,
      "text": "9.1. TE-Router LSA (0x81)",
      "section_title": true,
      "ja": "9.1.  TE-ルータLSA（0x81と）"
    },
    {
      "indent": 3,
      "text": "The following fields are used to describe each router link (i.e., interface). Each router link is typed (see the below Type field). The Type field indicates the kind of link being described.",
      "ja": "次のフィールドは、各ルータのリンク（すなわち、インタフェース）を記述するために使用されます。各ルータのリンクは（下のTypeフィールドを参照）が入力されます。 Typeフィールドは、記述されているリンクの種類を示します。"
    },
    {
      "indent": 3,
      "text": "Type",
      "ja": "タイプ"
    },
    {
      "indent": 8,
      "text": "A new link type \"Positional-Ring Type\" (value 5) is defined.\nThis is essentially a connection to a TDM-Ring.  TDM ring\nnetwork is different from LAN/NBMA transit network in that nodes\non the TDM ring do not necessarily have a terminating path\nbetween themselves.  Second, the order of links is important in\ndetermining the circuit path.  Third, the protection switching\nand the number of fibers from a node going into a ring are\ndetermined by the ring characteristics, for example, 2-fiber vs.\n4-fiber ring and Unidirectional Path Switched Ring (UPSR) vs.\nBidirectional Line Switched Ring (BLSR).",
      "raw": true
    },
    {
      "indent": 15,
      "text": "Type   Description\n__________________________________________________\n1      Point-to-point connection to another router\n2      Connection to a transit network\n3      Connection to a stub network\n4      Virtual link\n5      Positional-Ring type.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Link ID",
      "ja": "リンクID"
    },
    {
      "indent": 8,
      "text": "Identifies the object that this router link connects to.  Value\ndepends on the link's Type.  For a positional-ring type, the\nLink ID shall be IP Network/Subnet number just as the case with\na broadcast transit network.  The following table summarizes the\nupdated Link ID values.",
      "raw": true
    },
    {
      "indent": 15,
      "text": "Type   Link ID\n______________________________________\n1      Neighboring router's Router ID\n2      IP address of Designated Router\n3      IP network/subnet number\n4      Neighboring router's Router ID\n5      IP network/subnet number",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Link Data",
      "ja": "リンクデータ"
    },
    {
      "indent": 8,
      "text": "This depends on the link's Type field.  For type-5 links, this\nspecifies the router interface's IP address.",
      "raw": true
    },
    {
      "indent": 0,
      "text": "9.1.1 Router-TE flags - TE Capabilities of a Router",
      "section_title": true,
      "ja": "9.1.1ルータ-TEフラグ - ルータのTE機能"
    },
    {
      "indent": 3,
      "text": "Flags specific to non-packet TE nodes are described below.",
      "ja": "非パケットTEノードに固有のフラグは以下の通りです。"
    },
    {
      "indent": 7,
      "text": "+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|L|L|P|T|L|F|                                           |S|S|S|C|\n|S|E|S|D|S|S|                                           |T|E|I|S|\n|R|R|C|M|C|C|                                           |A|L|G|P|\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|<---- Boolean TE flags ------->|<- TE flags pointing to TLVs ->|",
      "raw": true
    },
    {
      "indent": 7,
      "text": "Bit TDM - Indicates the node is TDM circuit switch capable.",
      "ja": "ビットTDM  - ノードができるTDM回路のスイッチであることを示します。"
    },
    {
      "indent": 7,
      "text": "Bit LSC - Indicates the node is capable of Lambda switching.",
      "ja": "ビットLSC  - ノードはラムダスイッチングが可能であることを示します。"
    },
    {
      "indent": 7,
      "text": "Bit FSC - Indicates the node is capable of fiber-switching (can also be a non-fiber link type).",
      "ja": "ビットFSC  - ノードがファイバスイッチング（非ファイバ・リンク・タイプであることができる）ことが可能であることを示します。"
    },
    {
      "indent": 0,
      "text": "9.1.2 Link-TE Options: TE Capabilities of a TE Link",
      "section_title": true,
      "ja": "9.1.2リンク-TEオプション：TEリンクのTE機能"
    },
    {
      "indent": 7,
      "text": "+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|T|N|P|T|L|F|D|                                         |S|L|B|C|\n|E|T|K|D|S|S|B|                                         |R|U|W|O|\n| |E|T|M|C|C|S|                                         |L|G|A|L|\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|<---- Boolean TE flags ------->|<- TE flags pointing to TLVs ->|",
      "raw": true
    },
    {
      "indent": 7,
      "text": "TDM, LSC, FSC bits - Same as defined for router TE options.",
      "ja": "TDM、LSC、FSCビット - ルータTEオプションについて定義したのと同じ。"
    },
    {
      "indent": 0,
      "text": "9.2. TE-positional-ring-network LSA (0x82)",
      "section_title": true,
      "ja": "9.2.  TE-位置リングネットワークのLSA（0x82と）"
    },
    {
      "indent": 3,
      "text": "Network LSA is adequate for packet TE networks. A new TE-positional-ring-network LSA is defined to represent type-5 link networks, found in non-packet networks such as SONET/SDH TDM rings. A type-5 ring is a collection of network elements (NEs) forming a closed loop. Each NE is connected to two adjacent NEs via a duplex connection to provide redundancy in the ring. The sequence in which the NEs are placed on the Ring is pertinent. The NE that provides the OSPF-xTE functionality is termed the Gateway Network Element (GNE). The GNE selection criteria is outside the scope of this document. The GNE is also termed the Designated Router for the ring.",
      "ja": "ネットワークLSAは、パケットTEネットワークに適しています。新しいTE-位置リング・ネットワークLSAは、、SONET / SDHのTDMリングなどの非パケット・ネットワークに見られるタイプ5リンクネットワークを表すように定義されます。 5型リングは、閉ループを形成するネットワーク要素（NE）の集合です。各NEは、リングの冗長性を提供するために二重接続を介して隣接NEに接続されています。 NEがリング上に配置される順序は適切です。 OSPF-XTE機能を提供NEは、ゲートウェイネットワーク要素（GNE）と呼ばれます。 GNEの選択基準は、この文書の範囲外です。 GNEはまた、リングのためのDesignated Routerと呼ばれます。"
    },
    {
      "indent": 3,
      "text": "The TE-positional-ring-network LSA (0x82) is modeled after the network LSA and has the same flooding scope as the network LSA amongst the OSPF-xTE nodes within the area. Below is the format of the TE-Positional-Ring-network LSA. Unless specified explicitly otherwise, the fields carry the same meaning as they do in a network LSA. Only the differences are explained below.",
      "ja": "TE-位置リングネットワークのLSA（0x82と）は、ネットワークLSAをモデルとエリア内のOSPF-XTEノード間ネットワークLSAと同じ氾濫範囲を有しています。以下は、TE-定位置-リングネットワークLSAのフォーマットがあります。明示的に別段の定めがない限り、フィールドはネットワークLSAには、彼らがそうであるように同じ意味を運びます。唯一の相違点は、以下に説明されています。"
    },
    {
      "indent": 3,
      "text": "A TE-positional-ring-network LSA is originated for each Positional-Ring type network in the area. The tuple of (Link State ID, Network Mask) below uniquely represents a ring. The TE option must be set in the Options flag while propagating the LSA.",
      "ja": "TE-位置リング・ネットワークLSAは、エリア内の各定位置リング型ネットワークのために発信されます。以下（リンク状態ID、ネットワークマスク）のタプルは一意環を表します。 LSAを伝播しながら、TEオプションは、オプションのフラグに設定する必要があります。"
    },
    {
      "indent": 7,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|            LS age             |      Options  |     0x82      |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                        Link State ID                          |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     Advertising Router                        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     LS sequence number                        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         LS checksum           |             length            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                         Network Mask                          |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|  Ring Type    | Capacity Unit |        Reserved               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                           Ring capacity                       |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                   Network Element Node Id                     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                              ...                              |",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Link State ID",
      "ja": "リンクステートID"
    },
    {
      "indent": 8,
      "text": "This is the IP interface address of the network's Gateway\nNetwork Element, which is also the designated router.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Advertising Router",
      "ja": "広告ルータ"
    },
    {
      "indent": 8,
      "text": "Router ID of the network's Designated Router.",
      "ja": "ネットワークの指定ルータのルータID。"
    },
    {
      "indent": 3,
      "text": "Ring type",
      "ja": "リングタイプ"
    },
    {
      "indent": 8,
      "text": "There are 8 types of SONET/SDH rings defined as follows.",
      "ja": "次のように定義されたSONET / SDHリングの8つのタイプがあります。"
    },
    {
      "indent": 8,
      "text": "1 - A Unidirectional Line Switched 2-fiber ring (2-fiber ULSR) 2 - A Bidirectional Line switched 2-fiber ring (2-fiber BLSR) 3 - A Unidirectional Path Switched 2-fiber ring (2-fiber UPSR) 4 - A Bidirectional Path switched 2-fiber ring (2-fiber BPSR) 5 - A Unidirectional Line Switched 4-fiber ring (4-fiber ULSR) 6 - A Bidirectional Line switched 4-fiber ring (4-fiber BLSR) 7 - A Unidirectional Path Switched 4-fiber ring (4-fiber UPSR) 8 - A Bidirectional Path switched 4-fiber ring (4-fiber BPSR)",
      "ja": "双方向ラインは、2ファイバリング（2ファイバBLSR）3を切り替え -   -  1  - 単方向ライン2ファイバリング（2-ファイバULSR）2スイッチ一方向パス2ファイバリング（2ファイバUPSR）4スイッチ - スイッチバックパスは、2ファイバリングを交換（2ファイバBPSR）5  - 単方向ラインスイッチ4ファイバリング（4-ファイバULSR）6  - 双方向回線切り替え4ファイバリング（4ファイバBLSR）7  - 単方向パススイッチ4ファイバリング（4ファイバUPSR）8  - 双方向パスは、4ファイバリング（4-ファイバBPSR）切り替え"
    },
    {
      "indent": 3,
      "text": "Capacity Unit",
      "ja": "キャパシティ・ユニット"
    },
    {
      "indent": 8,
      "text": "Two units are currently defined, as follows.",
      "ja": "次のように2つのユニットが現在、定義されています。"
    },
    {
      "indent": 8,
      "text": "1 - Synchronous Transport Signal (STS), which is the basic signal rate for SONET signals. The rate of an STS signal is 51.84 Mbps",
      "ja": "1  -  SONET信号の基本信号速度で同期転送信号（STS）。 STS信号のレートは51.84 Mbpsです"
    },
    {
      "indent": 8,
      "text": "2 - Synchronous Transport Multiplexer (STM), which is the basic signal rate for SDH signals. The rate of an STM signal is 155.52 Mbps",
      "ja": "2  -  SDH信号の基本信号速度で同期転送マルチプレクサ（STM）。 STM信号の速度は155.52 Mbpsです"
    },
    {
      "indent": 3,
      "text": "Ring capacity",
      "ja": "リング能力"
    },
    {
      "indent": 8,
      "text": "Ring capacity expressed in number of Capacity Units.",
      "ja": "リング容量はキャパシティー・ユニットの数で表しました。"
    },
    {
      "indent": 3,
      "text": "Network Element Node Id",
      "ja": "ネットワーク要素ノードID"
    },
    {
      "indent": 8,
      "text": "The Router ID of each of the routers in the positional-ring\nnetwork.  The list must start with the designated router as the\nfirst element.  The Network Elements (NEs) must be listed in\nstrict clockwise order as they appear on the ring, starting with\nthe Gateway Network Element (GNE).  The number of NEs in the\nring can be deduced from the LSA header's length field.",
      "raw": true
    },
    {
      "indent": 0,
      "text": "9.3. TE-Router-Proxy LSA (0x8e)",
      "section_title": true,
      "ja": "9.3.  TE-ルータプロキシLSA（0x8Eが）"
    },
    {
      "indent": 3,
      "text": "This is a variation to the TE-router LSA in that the TE-router LSA is not advertised by the network element, but rather by a trusted TE-router Proxy. This is typically the scenario in a non-packet TE network, where some of the nodes do not have OSPF functionality and count on a helper node to do the advertisement for them. One such example would be the SONET/SDH Add-Drop Multiplexer (ADM) nodes in a TDM ring. The nodes may principally depend upon the GNE (Gateway Network Element) to do the advertisement for them. TE-router-Proxy LSA shall not be used to advertise area border routers and/or AS border routers.",
      "ja": "TE-ルータLSAは、ネットワーク要素によってではなく、信頼されたTE-ルータプロキシによってアドバタイズされていないという点で、これは、TE-ルータLSAにバリエーションです。これは、一部のノードは、OSPFの機能を持っており、彼らのために広告を行うためにヘルパーノードにカウントされません非パケットTEネットワークで一般的なシナリオです。その一例は、SONET / SDHであろうアドドロップマルチプレクサ（ADM）TDMリング内のノードを。ノードは、主に彼らのために広告を行うためにGNE（ゲートウェイネットワーク要素）に依存し得ます。 TE-ルータプロキシLSAは、および/または境界ルータとしてエリア境界ルータを宣伝するために使用してはなりません。"
    },
    {
      "indent": 7,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|            LS age             |     Options   |     0x8e      |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|      Link State ID  (Router ID of the TE Network Element)     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     Advertising Router                        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     LS sequence number                        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         LS checksum           |             length            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                 0             |       Router-TE flags         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|  Router-TE flags (contd.)     |       Router-TE TLVs          |\n+---------------------------------------------------------------+\n|                     ....                                      |\n+---------------------------------------------------------------+\n|                     ....      |      # of TE links            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                          Link ID                              |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                         Link Data                             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Type      |        0      |    Link-TE options            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|   Link-TE flags               |  Zero or more Link-TE TLVs    |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                          Link ID                              |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                         Link Data                             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                              ...                              |",
      "raw": true
    },
    {
      "indent": 0,
      "text": "10. Abstract Topology Representation with TE Support",
      "section_title": true,
      "ja": "TEのサポートと10抽象表現トポロジ"
    },
    {
      "indent": 3,
      "text": "Below, we consider a TE network composed of three OSPF areas, Area-1, Area-2 and Area-3, attached together through the backbone area. Area-1 an has a single area border router, ABR-A1 and no ASBRs. Area-2 has an area border router ABR-A2 and an AS border router ASBR-S1. Area-3 has two area border routers ABR-A2 and ABR-A3 and an AS border router ASBR-S2. The following network also assumes a pre-engineered TE circuit path between ABR-A1 and ABR-A2; between ABR-A1 and ABR-A3; between ABR-A2 and ASBR-S1; and between ABR-A3 and ASBR-S2.",
      "ja": "以下では、バックボーンエリアを介して一緒に取り付けた3つのOSPFエリア、エリア-1、エリア2とエリア-3からなるTEネットワークを考えます。エリア-1 ANは、単一のエリア境界ルータ、ABR-A1およびなしのASBRがあります。エリア-2は、エリア境界ルータABR-A2およびAS境界ルータASBR-S1を持っています。エリア-3は、2つの領域の境界線を持っていることはABR-A2およびABR-A3およびAS境界ルータASBR-S2をルータなどがあります。次のネットワークはまた、ABR-A1およびABR-A2との間の事前操作TE回路経路を想定します。 ABR-A1およびABR-A3の間; ABR-A2とASBR-S1の間;およびABR-A3とASBR-S2の間です。"
    },
    {
      "indent": 3,
      "text": "The following figure is an inter-area topology abstraction from the perspective of routers in Area-1. The abstraction illustrates reachability of TE networks and nodes within area to the external areas in the same AS and to the external ASes. The abstraction also illustrates pre-engineered TE circuit paths advertised by ABRs and ASBRs.",
      "ja": "次の図は、エリア1のルータの観点から、エリア間のトポロジーの抽象化です。抽象化は、同じASに外部の領域に、外部のASにエリア内にTEネットワークノードの到達可能性を示します。抽象ものABRとのASBRによってアドバタイズ予備操作TE回路パスを示します。"
    },
    {
      "indent": 3,
      "text": "                       +-------+\n                       |Area-1 |\n                       +-------+\n+-------------+            |\n|Reachable TE |       +--------+\n|networks in  |-------| ABR-A1 |\n|backbone area|       +--------+\n+-------------+          | | |\n          +--------------+ | +-----------------+\n          |                |                   |\n+-----------------+        |            +-----------------+\n|Pre-engineered TE|    +----------+     |Pre-engineered TE|\n|circuit path(s)  |    | Backbone |     |circuit path(s)  |\n|to ABR-A2        |    | Area     |     |to ABR-A3        |\n+-----------------+    +----------+     +-----------------+\n          |               |   |                 |\n          +----------+    |   +--------------+  |\n+-----------+        |    |                  |  |     +-----------+\n|Reachable  |      +--------+             +--------+  |Reachable  |\n|TE networks|------| ABR-A2 |             | ABR-A3 |--|TE networks|\n|in Area A2 |      +--------+             +--------+  |in Area A3 |\n+-----------+       | | | |                   | |     +-----------+\n      +-------------+ | | +-----------------+ | +----------+\n      |               | +-----------+       | |            |\n+-----------+ +--------------+      |       | |    +--------------+\n|Reachable  | |Pre-engineered|      |       | |    |Pre-engineered|\n|TE networks| |TE Ckt path(s)|  +------+  +------+ |TE Ckt path(s)|\n|in Area A3 | |to ASBR-S1    |  |Area-2|  |Area-3| |to ASBR-S2    |\n+-----------+ +--------------+  +------+  +------+ +--------------+\n                       |            |       |              |\n                       |   +--------+       |  +-----------+\n+-------------+        |   |                |  |\n|AS external  |    +---------+          +---------+\n|TE-network   |----| ASBR-S1 |          | ASBR-S2 |\n|reachability |    +---------+          +---------+\n|from ASBR-S1 |        |                    |  |\n+-------------+    +---+            +-------+  +-----------+\n                   |                |                     |\n       +-----------------+   +-------------+   +-----------------+\n       |Pre-engineered TE|   |AS External  |   |Pre-engineered TE|\n       |circuit path(s)  |   |TE-Network   |   |circuit path(s)  |\n       |reachable from   |   |reachability |   |reachable from   |\n       |ASBR-S1          |   |from ASBR-S2 |   |ASBR-S2          |\n       +-----------------+   +-------------+   +-----------------+",
      "raw": true
    },
    {
      "indent": 7,
      "text": "Figure 3: Inter-Area Abstraction as viewed by Area-1 TE-routers",
      "ja": "図3：エリア間抽象エリア-1 TE-ルータによって見られるように"
    },
    {
      "indent": 0,
      "text": "11. Changes to Data Structures in OSPF-xTE Nodes",
      "section_title": true,
      "ja": "OSPF-XTEノード内のデータ構造への変更11"
    },
    {
      "indent": 0,
      "text": "11.1. Changes to Router Data Structure",
      "section_title": true,
      "ja": "11.1. ルータのデータ構造への変更"
    },
    {
      "indent": 3,
      "text": "An OSPF-xTE router must be able to include the router-TE capabilities (as specified in section 8.1) in the router data structure. OSPF-xTE routers providing proxy service to other TE routers must also track the router and associated interface data structures for all the TE client nodes for which the proxy service is being provided. Presumably, the interaction between the Proxy server and the proxy clients is out-of-band.",
      "ja": "OSPF-XTEルータは、ルータデータ構造内（セクション8.1で指定されるように）ルータ-TE能力を含むことができなければなりません。他のTEルータにプロキシサービスを提供するOSPF-XTEルータは、プロキシサービスが提供されているすべてのTEクライアント・ノードのためのルータ及び関連するインタフェースデータ構造を追跡しなければなりません。おそらく、プロキシサーバーとプロキシクライアントの間の相互作用は、アウト・オブ・バンドです。"
    },
    {
      "indent": 0,
      "text": "11.2. Two Sets of Neighbors",
      "section_title": true,
      "ja": "11.2. 隣人の二組"
    },
    {
      "indent": 3,
      "text": "Two sets of neighbor data structures are required. TE-neighbors set is used to advertise TE LSAs. Only the TE nodes will be members of the TE-neighbor set. Native neighbors set will be used to advertise native LSAs. All neighboring nodes supporting non-TE links are part of the Native neighbors set.",
      "ja": "隣人データ構造の二組が必要とされています。セットTE-隣人はTE LSAを宣伝するために使用されます。唯一のTEノードは、TE-ネイバーセットのメンバーになります。設定ネイティブ隣人はネイティブLSAを宣伝するために使用されます。非TEリンクをサポートしているすべての隣接ノードが設定され、ネイティブの隣人の一部です。"
    },
    {
      "indent": 0,
      "text": "11.3. Changes to Interface Data Structure",
      "section_title": true,
      "ja": "11.3. インタフェースのデータ構造の変更"
    },
    {
      "indent": 3,
      "text": "The following new fields are introduced to the interface data structure.",
      "ja": "以下の新しいフィールドは、インタフェースデータ構造に導入されています。"
    },
    {
      "indent": 3,
      "text": "TePermitted",
      "ja": "TePermitted"
    },
    {
      "indent": 7,
      "text": "If the value of the flag is TRUE, the interface may be advertised\nas a TE-enabled interface.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "NonTePermitted",
      "ja": "NonTePermitted"
    },
    {
      "indent": 7,
      "text": "If the value of the flag is TRUE, the interface permits non-TE\ntraffic on the interface.  Specifically, this is applicable to\npacket networks, where data links may permit both TE and IP\npackets.  For FSC and LSC TE networks, this flag is set to FALSE.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "FloodingPermitted",
      "ja": "FloodingPermitted"
    },
    {
      "indent": 7,
      "text": "If the value of the flag is TRUE, the interface may be used for\nOSPF and OSPF-xTE packet exchange to synchronize the LSDB across\nall adjacent neighbors.  This is TRUE by default to all\nNonTePermitted interfaces that are enabled for OSPF.  However, it\nis possible to set this to FALSE for some of the interfaces.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "TE-TLVs",
      "ja": "TE-のTLV"
    },
    {
      "indent": 7,
      "text": "Each interface may define any number of TLVS that describe the\nlink characteristics.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The following existing fields in Interface data structure will take on additional values to support TE extensions.",
      "ja": "インタフェースデータ構造で、以下の既存のフィールドには、TE拡張をサポートするために追加の値を取ります。"
    },
    {
      "indent": 3,
      "text": "Type",
      "ja": "タイプ"
    },
    {
      "indent": 7,
      "text": "The OSPF interface type can also be of type \"Positional-Ring\".\nThe Positional-Ring type is different from other types (such as\nbroadcast and NBMA) in that the exact location of the nodes on\nthe ring is relevant, even though they are all on the same ring.\nSONET ADM ring is a good example of this.  Complete ring\npositional-ring description may be provided by the GNE on a ring\nas a TE-network LSA for the ring.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "List of Neighbors",
      "ja": "隣人のリスト"
    },
    {
      "indent": 7,
      "text": "The list may be statically defined for an interface without\nrequiring the use of Hello protocol.",
      "raw": true
    },
    {
      "indent": 0,
      "text": "12. IANA Considerations",
      "section_title": true,
      "ja": "12. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "The IANA has assigned multicast address 224.0.0.24 to OSPFIGP-TE for the exchange of TE database descriptors.",
      "ja": "IANAは、TEデータベース記述子の交換のためOSPFIGP-TEにマルチキャストアドレス224.0.0.24を割り当てました。"
    },
    {
      "indent": 3,
      "text": "TE LSA types and TE TLVs will be maintained by the IANA, using the following criteria.",
      "ja": "TE LSAタイプとTEのTLVは、以下の基準を使用して、IANAによって維持されます。"
    },
    {
      "indent": 0,
      "text": "12.1. TE LSA Type Values",
      "section_title": true,
      "ja": "12.1.  TE LSAタイプの値"
    },
    {
      "indent": 3,
      "text": "LSA type is an 8-bit field required by each LSA. TE LSA types will have the high bit set to 1. TE LSAs can range from 0x80 through 0xFF. The following values are defined in sections 8.0 and 9.0. The remaining values are available for assignment by the IANA with IETF Consensus [RFC2434].",
      "ja": "LSAタイプは、各LSAによって必要とされる8ビットのフィールドです。 TE LSAタイプは0x80から0xFFのからを通しての範囲とすることができる1 TEのLSAに高いビットセットを有することになります。以下の値はセクション8.0および9.0で定義されています。残りの値は、IETFコンセンサス[RFC2434]とIANAによって割り当てのために利用可能です。"
    },
    {
      "indent": 6,
      "text": "TE LSA Type                        Value\n_________________________________________\nTE-Router LSA                      0x81\nTE-Positional-ring-network LSA     0x82\nTE-Summary Network LSA             0x83\nTE-Summary router LSA              0x84\nTE-AS-external LSAs                0x85\nTE-Circuit-paths LSA               0x8C\nTE-incremental-link-Update LSA     0x8d\nTE-Router-Proxy LSA                0x8e",
      "raw": true
    },
    {
      "indent": 0,
      "text": "12.2. TE TLV Tag Values",
      "section_title": true,
      "ja": "12.2.  TE TLVタグ値"
    },
    {
      "indent": 3,
      "text": "TLV type is a 16-bit field required by each TE TLV. TLV type shall be unique across the router and link TLVs. A TLV type can range from 0x0001 through 0xFFFF. TLV type 0 is reserved and unassigned. The following TLV types are defined in sections 8.0 and 9.0. The remaining values are available for assignment by the IANA with IETF Consensus [RFC2434].",
      "ja": "TLVのタイプは、各TE TLVによって必要とされる16ビットのフィールドです。 TLVタイプは、ルータおよびリンクTLVの間で一意でなければなりません。 TLVタイプが0x0001のから0xFFFFのを通しての範囲とすることができます。 TLVタイプ0は予約済みと未割り当てています。以下のTLVタイプは、セクション8.0と9.0で定義されています。残りの値は、IETFコンセンサス[RFC2434]とIANAによって割り当てのために利用可能です。"
    },
    {
      "indent": 3,
      "text": "TE TLV Tag                         Reference       Value\n                                   Section\n_________________________________________________________",
      "raw": true
    },
    {
      "indent": 3,
      "text": "TE-LINK-TLV-SRLG Section 8.1.4.1 0x0001 TE-LINK-TLV-BANDWIDTH-MAX Section 8.1.4.2 0x0002 TE-LINK-TLV-BANDWIDTH-MAX-FOR-TE Section 8.1.4.3 0x0003 TE-LINK-TLV-BANDWIDTH-TE Section 8.1.4.4 0x0004 TE-LINK-TLV-LUG Section 8.1.4.5 0x0005 TE-LINK-TLV-COLOR Section 8.1.4.6 0x0006 TE-LINK-TLV-NULL Section 8.1.4.7 0x8888 TE-NODE-TLV-MPLS-SWITCHING Section 8.1.2.1 0x8001 TE-NODE-TLV-MPLS-SIG-PROTOCOLS Section 8.1.2.2 0x8002 TE-NODE-TLV-CSPF-ALG Section 8.1.2.3 0x8003 TE-NODE-TLV-NULL Section 8.1.2.4 0x8888",
      "ja": "TE-LINK-TLV-SRLGのセクション8.1.4.1は0x0001 TE-LINK-TLV帯域幅-MAX節8.1.4.2 0×0002 TE-LINK-TLV-帯域幅MAX-FOR-TEセクション8.1.4.3 0x0003 TE-LINK-TLV-帯域幅-TEセクション8.1.4.4 0x0004はTE-LINK-TLV-LUGセクション8.1.4.5 0x0005 TE-LINK-TLV-COLORセクション8.1.4.6 0x0006 TE-LINK-TLV-NULL節8.1.4.7 0x8888 TE-NODE-TLV- MPLS-切替部8.1.2.1 0x8001 TE-NODE-TLV-MPLS-SIG-プロトコルセクション8.1.2.2 0x8002 TE-NODE-TLV-CSPF-ALGセクション8.1.2.3 0x8003 TE-NODE-TLV-NULL節8.1.2.4 0x8888"
    },
    {
      "indent": 0,
      "text": "13. Acknowledgements",
      "section_title": true,
      "ja": "13.謝辞"
    },
    {
      "indent": 3,
      "text": "The authors wish to specially thank Chitti Babu and his team for implementing the protocol specified in a packet network and verifying several portions of the specification in a mixed packet network. The authors also wish to thank Vishwas Manral, Riyad Hartani, and Tricci So for their valuable comments and feedback on the document. Lastly, the authors wish to thank Alex Zinin and Mike Shand for their document (now defunct) titled \"Flooding optimizations in link state routing protocols\". The document provided inspiration to the authors to be sensitive to the high flooding rate, likely in TE networks.",
      "ja": "著者は、特別なパケットネットワークで指定されたプロトコルを実装し、混合パケットネットワークにおける仕様のいくつかの部分を検証するためのチッティ・バブーと彼のチームに感謝したいです。作者は、ドキュメント上の貴重なコメントやフィードバックのためVishwas Manral、リヤードHartani、およびTricciので感謝したいです。最後に、著者はそのドキュメント（今は亡き）タイトル「リンクステートルーティングプロトコルにおける洪水の最適化」のためにアレックスジニンとマイクシャンドに感謝したいです。文書は、TEネットワークの可能性が高い洪水率、に敏感であることが作者にインスピレーションを与えました。"
    },
    {
      "indent": 0,
      "text": "14. Security Considerations",
      "section_title": true,
      "ja": "14.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "Security considerations for the base OSPF protocol are covered in [OSPF-V2] and [SEC-OSPF]. This memo does not create any new security issues for the OSPF protocol. Security measures applied to the native OSPF (refer [SEC-OSPF]) are directly applicable to the TE LSAs described in the document. Discussed below are the security considerations in processing TE LSAs.",
      "ja": "ベースOSPFプロトコルのためのセキュリティ上の考慮事項は、[OSPF-V2]と[SEC-OSPF]で覆われています。このメモはOSPFプロトコルのための新たなセキュリティ問題を作成しません。ネイティブOSPF（参照[SEC-OSPF]）に適用されるセキュリティ対策は、文書に記載されたTEのLSAに直接適用可能です。処理TEのLSAのセキュリティの考慮事項は以下の通りであります。"
    },
    {
      "indent": 3,
      "text": "Secure communication between OSPF-xTE nodes has a number of components. Authorization, authentication, integrity and confidentiality. Authorization refers to whether a particular OSPF-xTE node is authorized to receive or propagate the TE LSAs to its neighbors. Failing the authorization process might indicate a resource theft attempt or unauthorized resource advertisement. In either case, the OSPF-xTE nodes should take proper measures to audit/log such attempts so as to alert the administrator to take necessary action. OSPF-xTE nodes may refuse to communicate with the neighboring nodes that fail to prompt the required credentials.",
      "ja": "OSPF-XTEノード間の安全な通信は、構成要素の数を有しています。認可、認証、完全性と機密性。許可は、特定のOSPF-XTEノードが受信またはその近傍にTE LSAを伝播することが許可されているかどうかを指します。承認プロセスを失敗すると、リソースの盗難の試みや不正なリソース広告を示している可能性があります。いずれの場合においても、OSPF-XTEノードは、必要な行動を取るために管理者に警告するように/そのような試みを監査ログに適切な措置をとるべきです。 OSPF-XTEノードは、必要な資格情報を要求することができない隣接ノードと通信することを拒否してもよいです。"
    },
    {
      "indent": 3,
      "text": "Authentication refers to confirming the identity of an originator for the datagrams received from the originator. Lack of strong credentials for authentication of OSPF-xTE LSAs can seriously jeopardize the TE service rendered by the network. A consequence of not authenticating a neighbor would be that an attacker could spoof the identity of a \"legitimate\" OSPF-xTE node and manipulate the state, and the TE database including the topology and metrics collected. This could potentially cause denial-of-service on the TE network. Another consequence of not authenticating is that an attacker could pose as OSPF-xTE neighbor and respond in a manner that would divert TE data to the attacker.",
      "ja": "認証は、発信者から受信したデータグラムのための発信者の身元を確認することをいいます。 OSPF-XTE LSAの認証のための強力な資格情報の欠如は深刻なネットワークによってレンダリングTEサービスを危うくすることができます。隣人を認証しない結果は、攻撃者が「正当」OSPF-XTEノードのアイデンティティを偽装し、状態を操作し、そして収集トポロジ及びメトリックを含むTEデータベースができることであろう。これは、潜在的にTEネットワーク上でサービス拒否を引き起こす可能性があります。認証ではない別の結果は、攻撃者がOSPF-XTEの隣人として提起し、攻撃者にTEのデータを流用う方法で応答可能性があることです。"
    },
    {
      "indent": 3,
      "text": "Integrity is required to ensure that an OSPF-xTE message has not been accidentally or maliciously altered or destroyed. The result of a lack of data integrity enforcement in an untrusted environment could be that an imposter will alter the messages sent by a legitimate adjacent neighbor and bring the OSPF-xTE on a node and the whole network to a halt or cause a denial of service for the TE circuit paths effected by the alteration.",
      "ja": "整合性は、OSPF-XTEメッセージが誤って又は故意変更または破壊されていないことを確認する必要があります。信頼されていない環境でのデータの整合性の施行の欠如の結果は、詐欺師は、正当な隣接隣人によって送信されたメッセージを変更し、停止したノードとネットワーク全体にOSPF-XTEを持参またはサービス拒否を引き起こすことかもしれません改変によってもたらさTE回路パスの。"
    },
    {
      "indent": 3,
      "text": "Confidentiality of OSPF-xTE messages ensures that the TE LSAs are accessible only to the authorized entities. When OSPF-xTE is deployed in an untrusted environment, lack of confidentiality will allow an intruder to perform traffic flow analysis and snoop the TE control network to monitor the traffic metrics and the rate at which circuit paths are being setup and torn-down. The intruder could cannibalize a lesser secure OSPF-xTE node and destroy or compromise the state and TE-LSDB on the node. Needless to say, the least secure",
      "ja": "OSPF-XTEメッセージの機密性は、TE LSAのが唯一認可エンティティにアクセス可能であることを保証します。 OSPF-XTEは信頼できない環境の中で展開されている場合は、機密性の欠如は、侵入者がトラフィックフロー分析を実行し、トラフィックメトリックと回路パスがセットアップと引き裂かダウンされる速度を監視するために、TE制御ネットワークをスヌープすることができます。侵入者はあまり共食いOSPF-XTEのノードを確保し、破壊するか、ノード上の状態とTE-LSDBを危険にさらす可能性があります。最も安全性、言うまでもなく"
    },
    {
      "indent": 3,
      "text": "OSPF-xTE will become the Achilles heel and make the TE network vulnerable to security attacks.",
      "ja": "OSPF-XTEはアキレス腱になると、セキュリティ攻撃にTEネットワークが脆弱になります。"
    },
    {
      "indent": 0,
      "text": "15. Normative References",
      "section_title": true,
      "ja": "15.引用規格"
    },
    {
      "indent": 3,
      "text": "[MPLS-ARCH] Rosen, E., Viswanathan, A., and R. Callon, \"Multiprotocol Label Switching Architecture\", RFC 3031, Jaunary 2001.",
      "ja": "[MPLS-ARCH]ローゼン、E.、Viswanathanの、A.、およびR. Callonは、RFC 3031、2001 Jaunary、 \"マルチプロトコルラベルは、スイッチングアーキテクチャ\"。"
    },
    {
      "indent": 3,
      "text": "[MPLS-TE] Awduche, D., Malcolm, J., Agogbua, J., O'Dell, M., and J. McManus, \"Requirements for Traffic Engineering Over MPLS\", RFC 2702, September 1999.",
      "ja": "[MPLS-TE] Awduche、D.、マルコム、J.、Agogbua、J.、オデル、M.、およびJ.マクマナス、 \"トラフィックエンジニアリングオーバーMPLSのための要件\"、RFC 2702、1999年9月。"
    },
    {
      "indent": 3,
      "text": "[OSPF-V2] Moy, J., \"OSPF Version 2\", STD 54, RFC 2328, April 1998.",
      "ja": "[OSPF-V2]モイ、J.、 \"OSPFバージョン2\"、STD 54、RFC 2328、1998年4月。"
    },
    {
      "indent": 3,
      "text": "[SEC-OSPF] Murphy, S., Badger, M., and B. Wellington, \"OSPF with Digital Signatures\", RFC 2154, June 1997.",
      "ja": "[SEC-OSPF]マーフィー、S.、アナグマ、M.、およびB.ウェリントン、 \"デジタル署名とOSPF\"、RFC 2154、1997年6月。"
    },
    {
      "indent": 3,
      "text": "[OSPF-CAP] Lindem, A., Ed., Shen, N., Vasseur, J., Aggarwal, R., and S. Schaffer, \"Extensions to OSPF for Advertising Optional Router Capabilities\", RFC 4970, July 2007.",
      "ja": "[OSPF-CAP] Lindem、A.編、シェン、N.、Vasseur、J.、アガルワル、R.、およびS.シェーファー、 \"広告オプションのルータの機能のためのOSPFへの拡張\"、RFC 4970、2007年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC2434] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 2434, October 1998.",
      "ja": "[RFC2434] Narten氏、T.とH. Alvestrand、 \"RFCsにIANA問題部に書くためのガイドライン\"、BCP 26、RFC 2434、1998年10月。"
    },
    {
      "indent": 0,
      "text": "16. Informative References",
      "section_title": true,
      "ja": "16.参考文献"
    },
    {
      "indent": 3,
      "text": "[BGP-OSPF] Ferguson, D., \"The OSPF External Attribute LSA\", unpublished.",
      "ja": "[BGP-OSPF]ファーガソン、D.、未発表、 \"OSPF外部LSA属性\"。"
    },
    {
      "indent": 3,
      "text": "[CR-LDP] Jamoussi, B., Andersson, L., Callon, R., Dantu, R., Wu, L., Doolan, P., Worster, T., Feldman, N., Fredette, A., Girish, M., Gray, E., Heinanen, J., Kilty, T., and A. Malis, \"Constraint-Based LSP Setup using LDP\", RFC 3212, January 2002.",
      "ja": "[CR-LDP] Jamoussi、B.、アンダーソン、L.、Callon、R.、Dantu、R.、ウー、L.、Doolan、P.、Worster、T.、フェルドマン、N.、Fredette、A.、 Girish、M.、グレー、E.、Heinanen、J.、Kilty、T.、およびA. Malis、 \"LDPを使用して、制約ベースLSPセットアップ\"、RFC 3212、2002年1月。"
    },
    {
      "indent": 3,
      "text": "[GMPLS-TE] Berger, L., \"Generalized Multi-Protocol Label Switching (GMPLS) Signaling Functional Description\", RFC 3471, January 2003.",
      "ja": "[GMPLS-TE]バーガー、L.、 \"一般化されたマルチプロトコルラベルスイッチング（GMPLS）機能説明シグナリング\"、RFC 3471、2003年1月。"
    },
    {
      "indent": 3,
      "text": "[MOSPF] Moy, J., \"Multicast Extensions to OSPF\", RFC 1584, March 1994.",
      "ja": "[MOSPF]モイ、J.、 \"OSPFへのマルチキャスト拡張機能\"、RFC 1584、1994年3月。"
    },
    {
      "indent": 3,
      "text": "[NSSA] Murphy, P., \"The OSPF Not-So-Stubby Area (NSSA) Option\", RFC 3101, January 2003.",
      "ja": "[NSSA]マーフィー、P.、 \"OSPFない準スタブエリア（NSSA）オプション\"、RFC 3101、2003年1月。"
    },
    {
      "indent": 3,
      "text": "[OPAQUE] Coltun, R., \"The OSPF Opaque LSA Option\", RFC 2370, July 1998.",
      "ja": "[OPAQUE] Coltun、R.、 \"OSPF Opaque LSAオプション\"、RFC 2370、1998年7月。"
    },
    {
      "indent": 3,
      "text": "[OPQLSA-TE] Katz, D., Yeung, D., and K. Kompella, \"Traffic Engineering Extensions to OSPF\", RFC 3630, September 2003.",
      "ja": "[OPQLSA-TE]カッツ、D.、ヨン、D.、およびK. Kompella、 \"OSPFへのトラフィックエンジニアリングの拡張\"、RFC 3630、2003年9月。"
    },
    {
      "indent": 3,
      "text": "[RSVP-TE] Awduche, D., Berger, L., Gan, D., Li, T., Srinivasan, V., and G. Swallow, \"RSVP-TE: Extensions to RSVP for LSP Tunnels\", RFC 3209, December 2001.",
      "ja": "[RSVP-TE] Awduche、D.、バーガー、L.、ガン、D.、李、T.、スリニヴァサン、V.、およびG.ツバメ、 \"RSVP-TE：ExtensionsがLSPトンネルのためのRSVPする\"、RFC 3209 、2001年12月。"
    },
    {
      "indent": 3,
      "text": "[SONET-SDH] Chow, M.-C., \"Understanding SONET/SDH Standards and Applications\", Holmdel, N.J.: Andan Publisher, 1995.",
      "ja": "[SONET-SDH]チョウ、M.-C.、 \"SONET / SDH規格とアプリケーションの理解\"、ホルムデル、N.J：Andan出版社、1995。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Pyda Srisuresh Kazeon Systems, Inc. 1161 San Antonio Rd. Mountain View, CA 94043 U.S.A.",
      "ja": "Pyda Srisuresh Kazeon Systems、Inc.の1161年サンアントニオRdを。マウンテンビュー、CA 94043 U.S.A."
    },
    {
      "indent": 3,
      "text": "Phone: (408) 836-4773 EMail: srisuresh@yahoo.com",
      "ja": "電話：（408）836-4773 Eメール：srisuresh@yahoo.com"
    },
    {
      "indent": 3,
      "text": "Paul Joseph Consultant 10100 Torre Avenue, # 121 Cupertino, CA 95014 U.S.A.",
      "ja": "ポール・ジョセフ・コンサルタント10100トーレ・アベニュー、＃121クパチーノ、CA 95014 U.S.A."
    },
    {
      "indent": 3,
      "text": "Phone: (408) 777-8493 EMail: paul_95014@yahoo.com",
      "ja": "電話：（408）777-8493 Eメール：paul_95014@yahoo.com"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The IETF Trust (2007).",
      "ja": "著作権（C）IETFトラスト（2007）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78 and at www.rfc-editor.org/copyright.html, and except as set forth therein, the authors retain all their rights.",
      "ja": "この文書では、BCP 78に及びwww.rfc-editor.org/copyright.htmlに含まれる権利と許可と制限の適用を受けており、その中の記載を除いて、作者は彼らのすべての権利を保有します。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE IETF TRUST AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とCONTRIBUTOR「そのまま」、ORGANIZATION HE / SHEが表すまたはインターネットSOCIETY、（もしあれば）を後援し、IETF TRUST ANDインターネットエンジニアリングタスクフォース放棄ALLに設けられています。保証は、明示または黙示、この情報の利用および特定目的に対する権利または商品性または適合性の黙示の保証を侵害しない任意の保証がこれらに限定されません。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、本書またはそのような権限下で、ライセンスがたりないかもしれない程度に記載された技術の実装や使用に関係すると主張される可能性があります任意の知的財産権やその他の権利の有効性または範囲に関していかなる位置を取りません利用可能です。またそれは、それがどのような権利を確認する独自の取り組みを行ったことを示すものでもありません。 RFC文書の権利に関する手続きの情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IPRの開示のコピーが利用できるようにIETF事務局とライセンスの保証に行われた、または本仕様の実装者または利用者がそのような所有権の使用のための一般的なライセンスまたは許可を取得するために作られた試みの結果を得ることができますhttp://www.ietf.org/iprのIETFのオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、その注意にこの標準を実装するために必要とされる技術をカバーすることができる任意の著作権、特許または特許出願、またはその他の所有権を持ってすべての利害関係者を招待します。 ietf-ipr@ietf.orgのIETFに情報を記述してください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}