{
  "title": {
    "text": "RFC 4645 - Initial Language Subtag Registry",
    "ja": "RFC 4645 - 初期の言語サブタグレジストリ"
  },
  "number": 4645,
  "created_at": "2019-10-24 07:58:39.690110+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                      D. Ewell, Ed.\nRequest for Comments: 4645                                    Consultant\nCategory: Informational                                   September 2006",
      "raw": true
    },
    {
      "indent": 20,
      "text": "Initial Language Subtag Registry",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモはインターネットコミュニティのための情報を提供します。それはどんな種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2006).",
      "ja": "著作権（C）インターネット協会（2006）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This memo defined the initial contents of the IANA Language Subtag Registry for use in forming tags for the identification of languages. Since the contents of this memo only served as a starting point for the registry, its actual contents have been removed before publication to avoid confusion.",
      "ja": "このメモは、言語を識別するためのタグを形成する際に使用するためのIANA言語サブタグレジストリの初期内容を定義しました。このメモの内容は唯一のレジストリのための出発点として役立っているので、その実際の内容は、混乱を避けるために、出版前に削除されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Initialization of the Registry ..................................2\n3. Initial Registry Contents .......................................5\n4. Omitted Code Elements ...........................................5\n5. Security Considerations .........................................5\n6. IANA Considerations .............................................5\n7. References ......................................................6\n   7.1. Normative References .......................................6\n   7.2. Informative References .....................................6",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "[RFC4646] provides for a Language Subtag Registry and describes its format. This memo defines the initial contents of the IANA Language Subtag Registry, using the criteria described in Section 2.",
      "ja": "[RFC4646]は言語サブタグレジストリを提供し、そのフォーマットを記述する。このメモは、セクション2で説明した基準を使用して、IANA言語サブタグレジストリの初期内容を定義します。"
    },
    {
      "indent": 3,
      "text": "The Language Subtag Registry is formatted in a modified record-jar text format, as described in [record-jar]. The specific format of the registry, and the definition and intended purpose of each of the fields, are described in [RFC4646].",
      "ja": "[記録JAR]に記載されているように言語サブタグレジストリは、変更されたレコード・ジャーテキスト形式でフォーマットされています。レジストリの特定の形式、および定義と各フィールドの意図する目的は、[RFC4646]に記載されています。"
    },
    {
      "indent": 3,
      "text": "The registry is expected to change over time, as new subtags are registered and existing subtags are modified or deprecated. The process of updating the registry is described in Section 3 of [RFC4646]. This memo does not define the permanent contents of the registry and should not be represented as doing so.",
      "ja": "新しいサブタグが登録されており、既存のサブタグが変更または廃止されて、レジストリは、時間の経過とともに変化することが予想されます。レジストリを更新する処理は、[RFC4646]のセクション3に記載されています。このメモは、レジストリの永久的な内容を定義しないと、そうすることとして表現するべきではありません。"
    },
    {
      "indent": 3,
      "text": "Many of the subtags defined in this registry are based on code elements defined in [ISO639-1], [ISO639-2], [ISO15924], [ISO3166-1], and [UN_M.49]. This registry is not a mirror of the code lists defined by these standards and should not be used as one.",
      "ja": "このレジストリに定義されたサブタグの多くは、[ISO639-1]、[ISO639-2]、[ISO15924]、[ISO3166-1]、および[UN_M.49]で定義されたコード要素に基づいています。このレジストリは、これらの規格で定義されたコードのリストのミラーではなく、一つとして使用すべきではありません。"
    },
    {
      "indent": 0,
      "text": "2. Initialization of the Registry",
      "section_title": true,
      "ja": "レジストリの2.初期化"
    },
    {
      "indent": 3,
      "text": "Section 3.7 of [RFC4646] requires that the LTRU working group create an initial version of the Language Subtag Registry and populate it with the initial set of subtags. This involves converting the entries from the existing IANA language tag registry defined by [RFC3066] to the new format, as well as defining valid subtags from various source standards. This section describes the process that was used to create the initial registry entries.",
      "ja": "[RFC4646]のセクション3.7はLTRUワーキンググループは、言語サブタグレジストリの初期バージョンを作成し、サブタグの初期セットを移入する必要があります。これは、新しい形式に[RFC3066]で定義された既存のIANA言語タグレジストリからエントリを変換、ならびに様々なソース規格から有効なサブタグを定義することを含みます。このセクションでは、最初のレジストリエントリを作成するために使用されたプロセスについて説明します。"
    },
    {
      "indent": 3,
      "text": "The initial set of records was based on the following standards: [ISO639-1], [ISO639-2], [ISO15924], and [ISO3166-1]. The following criteria were used to select and format the records of the subtags included in the initial Language Subtag Registry (hereafter \"ILSR\"):",
      "ja": "[ISO3166-1] [ISO639-1]、[ISO639-2]、[ISO15924]、および：レコードの最初のセットは、以下の規格に基づいていました。以下の基準は、初期言語サブタグレジストリ（以下「ILSR」）に含まサブタグのレコードを選択してフォーマットするために使用しました："
    },
    {
      "indent": 6,
      "text": "1. For each source standard, the date of the standard referenced in [RFC1766] was selected as the starting date. Code elements that were valid on that date in the selected standard were added to the ILSR. Code elements that were previously assigned, but that were vacated or withdrawn before that date, were not added to the ILSR.",
      "ja": "各ソース標準の1は、[RFC1766]で参照標準の日付は、開始日として選択しました。選択された標準で、その日に有効であったコード要素はILSRに加えられました。以前に割り当てられていたが、それはその日の前に空いた又は取り下げられたコード要素は、ILSRに追加されませんでした。"
    },
    {
      "indent": 6,
      "text": "2. For each successive change to the standard, any additional assignments up to the date of the adoption of [RFC4646] were added to the ILSR. Values that have been withdrawn are marked as deprecated, but not removed. Changes in meaning or assignment of a subtag were permitted during this process (for example, the [ISO3166-1] code element 'CS' was originally assigned to Czechoslovakia and is now assigned to Serbia and Montenegro).",
      "ja": "標準の各連続変化について2は、[RFC4646]の適用日までの任意の追加の割り当てはILSRに加えました。撤回された値は、非推奨としてマークされますが、削除されません。サブタグの意味又は割り当ての変更（例えば、[ISO3166-1]コード​​要素「CS」は元々チェコスロバキアに割り当てられ、現在セルビアとモンテネグロに割り当てられている）は、このプロセスの間に許されました。"
    },
    {
      "indent": 3,
      "text": "Code elements from [UN_M.49] were also included in the ILSR using the criteria above, with the following additional rules:",
      "ja": "【UN_M.49]からコード要素はまた、以下の追加の規則と、上記の基準を使用してILSRに含まれていました。"
    },
    {
      "indent": 6,
      "text": "3. UN numeric code elements assigned to \"macro-geographical (continental)\" regions as of the date of adoption of [RFC4646] were added to the ILSR and thereby made valid for use in language tags.",
      "ja": "[RFC4646] ILSRに加え、それによって言語タグに使用するのに有効とされたの適用日のような「マクロ地理的（大陸）」領域に割り当てられた3 UN数値コード要素。"
    },
    {
      "indent": 6,
      "text": "4. The UN numeric code elements for \"economic groupings\" or \"other groupings,\" and the alphanumeric code elements in Appendix X of the UN document, were not added to the ILSR.",
      "ja": "4.「経済グループ」または「他のグループ、」国連文書の付録Xでの英数字コード要素のための国連数字コード要素は、ILSRに追加されませんでした。"
    },
    {
      "indent": 6,
      "text": "5. The UN numeric code elements for countries or areas not associated with an assigned [ISO3166-1] alpha-2 code element were not added to the ILSR. These values are listed in Section 4 and may be requested for registration by individuals using the process defined in [RFC4646] and according to the rules described therein. Listing of these code elements in this section is not a guarantee of future registration.",
      "ja": "前記割り当てられた[ISO3166-1]α-2コード要素に関連付けられていない国または地域のための国連数字コード要素はILSRに添加しませんでした。これらの値は、セクション4に記載されていると[RFC4646]で定義されたプロセスを使用し、そこに記載されているルールに従って個人が登録を要求してもよいです。このセクションでは、これらのコード要素のリストは、今後の登録を保証するものではありません。"
    },
    {
      "indent": 6,
      "text": "6. Code elements that were withdrawn, vacated, or deprecated from [UN_M.49] as of the date of adoption of [RFC4646] were not added to the ILSR.",
      "ja": "6.コード取り出した要素、空いた、または[RFC4646]の採用の日付のようUN_M.49]から非推奨はILSRに加えませんでした。"
    },
    {
      "indent": 3,
      "text": "Using the initial set of subtags described above, the tags in the [RFC3066] registry were evaluated as follows:",
      "ja": "次のように上記サブタグの初期セットを使用して、[RFC3066]レジストリ内のタグを評価しました。"
    },
    {
      "indent": 6,
      "text": "7. Tags in the [RFC3066] registry that were not deprecated, consisted entirely of subtags already in this document, and have the correct form and format for tags defined by [RFC4646] were converted to records of type \"redundant\" in the ILSR. For example, \"zh-Hant\" is now defined by [RFC4646] because 'zh' is an [ISO639-1] code element and 'Hant' is an [ISO15924] code element, and both are defined as subtags in the ILSR.",
      "ja": "非推奨されなかった[RFC3066]レジストリ7.タグは、既に本書で完全サブタグからなり、ILSRの「冗長」タイプのレコードに変換した[RFC4646]で定義されたタグの正しい形式およびフォーマットを有します。 「ZHは」[ISO639-1]コード​​要素であり、「ハントが」[ISO15924]コード要素であり、両者はILSRにサブタグとして定義されている。ので、例えば、「ZH-ハント」は今[RFC4646]で定義されます"
    },
    {
      "indent": 6,
      "text": "8. Tags in the [RFC3066] registry that contained one or more subtags that either did not match the valid registration pattern or were not otherwise defined by [RFC4646] were converted to corresponding records of type \"grandfathered\" in the ILSR. These records cannot become type \"redundant\" except by revision of [RFC4646], but may have a \"Deprecated\" and",
      "ja": "いずれかが有効な登録パターンと一致しませんでしたか、そうでない場合は[RFC4646]で定義されていなかった一つ以上のサブタグが含ま[RFC3066]レジストリ8.タグはILSRに「適用除外」タイプのレコードを対応するに変換しました。これらのレコードは、[RFC4646]の改正による場合を除いてタイプ「冗長」になることはできませんが、「非推奨」とを有することができます"
    },
    {
      "indent": 10,
      "text": "\"Preferred-Value\" field added to them if a subsequent subtag\nassignment or combination of assignments renders the tag\nobsolete.",
      "raw": true
    },
    {
      "indent": 6,
      "text": "9. Tags in the [RFC3066] registry that had a notation that they were deprecated were converted to records of type \"grandfathered\" in the ILSR. The record for the grandfathered entry contains a \"Deprecated\" field with the most appropriate date that can be determined for when the [RFC3066] record was deprecated. The \"Comments\" field may optionally contain a reason for the deprecation. The \"Preferred-Value\" field contains a tag that replaces the value. For example, the [RFC3066] tag \"art-lojban\" is deprecated and thus appears as a grandfathered tag in the ILSR. Its \"Deprecated\" field contains the deprecation date (in this case \"2003-09-02\") and the \"Preferred-Value\" field the value \"jbo\".",
      "ja": "彼らは非推奨された表記法を持っていた[RFC3066]レジストリ9.タグはILSRに「適用除外」タイプのレコードに変換しました。適用除外エントリのレコードには、[RFC3066]のレコードは廃止されたときのために決定することができる最も適切な日付で、「非推奨」フィールドが含まれています。 「コメント」欄には、必要に応じて、非推奨の理由が含まれていてもよいです。 「優先-値」フィールドに値を置き換えたタグが含まれています。例えば、[RFC3066]タグ「は、当該技術分野においてロジバン」は廃止され、したがって、ILSRに適用除外タグとして現れます。その「非推奨」フィールドは、（この場合は「2003年9月2日」で）非推奨の日付と「プリファード・バリュー」値「JBOを」フィールドが含まれています。"
    },
    {
      "indent": 6,
      "text": "10. The remaining tags in the [RFC3066] registry are not deprecated and have a format consistent with language tags as defined by [RFC4646] but contain subtags that are not defined in the ILSR. These subtags are eligible for registration as variants. The ILSR contains appropriate variant records for the following list of subtags, and the registered [RFC3066] tags containing these subtags were entered into the ILSR as type \"redundant\":",
      "ja": "10 [RFC3066]レジストリ内の残りのタグは非推奨と言語タグと一致するフォーマットを持っている[RFC4646]で定義されているようしかしILSRで定義されていないサブタグを含むされていません。これらのサブタグは、バリアントとして登録の対象となります。 ILSRは、サブタグの以下のリストのための適切なバリアントレコードが含まれ、これらのサブタグを含む登録[RFC3066]タグは「冗長」タイプとしてILSRに入力しました。"
    },
    {
      "indent": 10,
      "text": "1901 (use with Prefix: de)",
      "ja": "1901（接頭辞の使用：デ）"
    },
    {
      "indent": 10,
      "text": "1996 (use with Prefix: de)",
      "ja": "1996（接頭辞の使用：デ）"
    },
    {
      "indent": 10,
      "text": "nedis (use with Prefix: sl)",
      "ja": "nedis（接頭辞の使用：SL）"
    },
    {
      "indent": 10,
      "text": "rozaj (use with Prefix: sl)",
      "ja": "rozaj（接頭辞の使用：SL）"
    },
    {
      "indent": 6,
      "text": "11. All remaining [RFC3066] registered tags were converted to records of type \"grandfathered\" in the ILSR. Interested parties may use the registration process in [RFC4646] to attempt to register the variant subtags not already present in the Language Subtag Registry. If all of the subtags in the original tag become fully defined by the resulting registrations, then the original tag is superseded. Such tags will have their record changed from type \"grandfathered\" to type \"redundant\" in the registry. Note that previous approval of a tag under [RFC3066] is not a guarantee of approval of a variant subtag under [RFC4646]. The existing [RFC3066] tag maintains its validity, but the original reason for its registration might have become obsolete.",
      "ja": "11.すべての残り[RFC3066]登録されたタグはILSRに「適用除外」タイプのレコードに変換しました。利害関係者は、言語サブタグレジストリ内に既に存在していないバリアントサブタグを登録しようとするために、[RFC4646]で登録プロセスを使用することができます。元のタグ内のサブタグのすべてが完全に得登録によって定義されるようになっている場合、元のタグが取って代わられています。このようなタグは、彼らのレコードは、レジストリに「冗長」と入力して「適用除外」タイプに変更されます。 [RFC3066]の下のタグの前の承認は、[RFC4646]の下の変種サブタグの承認を保証するものではないことに注意してください。既存の[RFC3066]タグは、その妥当性を維持するが、その登録のためのオリジナルの理由は、時代遅れになっている場合があります。"
    },
    {
      "indent": 0,
      "text": "3. Initial Registry Contents",
      "section_title": true,
      "ja": "3.初期のレジストリ内容"
    },
    {
      "indent": 3,
      "text": "The remainder of this section specified the initial set of records for the registry. This material was deleted on publication of this memo, to avoid any potential confusion with the registry itself. The IANA language subtag registry can be found at <http://www.iana.org/numbers.html> under \"Language Tags\".",
      "ja": "このセクションの残りの部分は、レジストリのレコードの初期セットを指定しました。この材料は、レジストリ自体に任意の潜在的な混乱を避けるために、このメモの公表に削除されました。 IANA言語サブタグレジストリは、<http://www.iana.org/numbers.html>「言語タグ」の下で見つけることができます。"
    },
    {
      "indent": 0,
      "text": "4. Omitted Code Elements",
      "section_title": true,
      "ja": "4.省略コード要素"
    },
    {
      "indent": 3,
      "text": "The following code elements from [UN_M.49] were not associated with [ISO3166-1] alpha-2 code elements. Consequently, they were not assigned as subtags in the initial Language Subtag Registry, but were valid candidates for registration as region subtags, using the process in [RFC4646]:",
      "ja": "【UN_M.49]から次のコード要素が[ISO3166-1]α-2コード要素に関連付けられていませんでした。その結果、彼らは最初の言語サブタグレジストリ内のサブタグとして割り当てられなかったが、[RFC4646]でプロセスを使用して、地域サブタグとして登録のための有効な候補者でした。"
    },
    {
      "indent": 6,
      "text": "830 Channel Islands 831 Guernsey 832 Jersey 833 Isle of Man",
      "ja": "男の830チャネル諸島ガーンジー831 832 833ジャージー島"
    },
    {
      "indent": 3,
      "text": "The last three became ineligible for registration in April, 2006, when the [ISO3166-1] code elements GG, JE, and IM were assigned as region subtags.",
      "ja": "最後の3つは[ISO3166-1]コード​​要素GG、JE、およびIMは、地域サブタグとして割り当てられていた2006年4月に登録の対象外となりました。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "This document specifies the initial contents to be used by IANA in populating the Language Subtag Registry. For security considerations relevant to that registry and the use of language tags, see [RFC4646].",
      "ja": "この文書では、言語サブタグレジストリを取り込むにIANAによって使用される初期内容を指定します。そのレジストリと言語タグの使用に関連するセキュリティ上の考慮事項については、[RFC4646]を参照してください。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document points to the initial content for the Language Subtag Registry which is maintained by the IANA. The IANA language subtag registry can be found at <http://www.iana.org/numbers.html> under \"Language Tags\". For details on the procedures for the format and ongoing maintenance of this registry, see [RFC4646].",
      "ja": "IANAによって維持されている言語サブタグレジストリの初期コンテンツこの文書ポイント。 IANA言語サブタグレジストリは、<http://www.iana.org/numbers.html>「言語タグ」の下で見つけることができます。フォーマットと、このレジストリの継続的なメンテナンスのための手順の詳細については、[RFC4646]を参照してください。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7.参考"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "ja": "7.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC4646] Phillips, A., Ed. and M. Davis, Ed., \"Tags for Identifying Languages\", BCP 47, RFC 4646, September 2006.",
      "ja": "[RFC4646]フィリップス、A.編。そして、M.デイヴィス、エド。、 \"言語を識別するためのタグ\"、BCP 47、RFC 4646、2006年9月。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "ja": "7.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[ISO15924] International Organization for Standardization, \"ISO 15924:2004. Information and documentation -- Codes for the representation of names of scripts\", January 2004.",
      "ja": "[ISO15924]国際標準化機構、「ISO 15924：2004の情報とドキュメンテーション - スクリプトの名前の表現のためのコード。」、2004年1月。"
    },
    {
      "indent": 3,
      "text": "[ISO3166-1] International Organization for Standardization, \"ISO 3166:1988. Codes for the representation of names of countries, 3rd edition\", August 1988.",
      "ja": "[ISO3166-1]国際標準化機構、「ISO 3166：国の名前、第3版の表現のための1988コード」、1988年8月。"
    },
    {
      "indent": 3,
      "text": "[ISO639-1] International Organization for Standardization, \"ISO 639-1:2002. Codes for the representation of names of languages -- Part 1: Alpha-2 code\", 2002.",
      "ja": "[ISO639-1]標準化、国際機関「ISO 639-1：2002の言語の名前の表現のためのコード - パート1：アルファ2コード」、2002年。"
    },
    {
      "indent": 3,
      "text": "[ISO639-2] International Organization for Standardization, \"ISO 639-2:1998. Codes for the representation of names of languages -- Part 2: Alpha-3 code, first edition\", 1998.",
      "ja": "[ISO639-2]国際標準化のための組織「ISO 639-2：1998の言語の名前の表現のためのコード - パート2：アルファ3コード、初版」、1998年。"
    },
    {
      "indent": 3,
      "text": "[RFC1766] Alvestrand, H., \"Tags for the Identification of Languages\", RFC 1766, March 1995.",
      "ja": "[RFC1766] Alvestrand、H.、 \"言語識別のためのタグ\"、RFC 1766、1995年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3066] Alvestrand, H., \"Tags for the Identification of Languages\", BCP 47, RFC 3066, January 2001.",
      "ja": "[RFC3066] Alvestrand、H.、 \"言語識別のためのタグ\"、BCP 47、RFC 3066、2001年1月。"
    },
    {
      "indent": 3,
      "text": "[UN_M.49] Statistics Division, United Nations, \"Standard Country or Area Codes for Statistical Use\", UN Standard Country or Area Codes for Statistical Use, Revision 4 (United Nations publication, Sales No. 98.XVII.9, June 1999.",
      "ja": "「統計の使用のための標準的な国または地域コード」[UN_M.49]統計課、国際連合、統計利用、リビジョン4（国連出版、販売号98.XVII.9、1999年6月のための国連標準の国または地域コード。"
    },
    {
      "indent": 3,
      "text": "[record-jar] Raymond, E., \"The Art of Unix Programming\", 2003.",
      "ja": "[記録ジャー]レイモンド、E.、 \"UNIXプログラミングのアート\"、2003年。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Doug Ewell (Editor) Consultant",
      "ja": "ダグイーウェル（編集）コンサルタント"
    },
    {
      "indent": 3,
      "text": "EMail: dewell@adelphia.net URI: http://users.adelphia.net/~dewell",
      "ja": "電子メール：dewell@adelphia.net URI：http://users.adelphia.net/~dewell"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2006).",
      "ja": "著作権（C）インターネット協会（2006）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "この文書では、BCP 78に含まれる権利と許可と制限の適用を受けており、その中の記載を除いて、作者は彼らのすべての権利を保有します。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とCONTRIBUTOR「そのまま」、ORGANIZATION HE / SHEが表すまたはインターネットソサエティおよびインターネット・エンジニアリング・タスク・フォース放棄すべての保証、明示または、（もしあれば）後援ISに設けられています。黙示、情報の利用は、特定の目的に対する権利または商品性または適合性の黙示の保証を侵害しない任意の保証含むがこれらに限定されません。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、本書またはそのような権限下で、ライセンスがたりないかもしれない程度に記載された技術の実装や使用に関係すると主張される可能性があります任意の知的財産権やその他の権利の有効性または範囲に関していかなる位置を取りません利用可能です。またそれは、それがどのような権利を確認する独自の取り組みを行ったことを示すものでもありません。 RFC文書の権利に関する手続きの情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IPRの開示のコピーが利用できるようにIETF事務局とライセンスの保証に行われた、または本仕様の実装者または利用者がそのような所有権の使用のための一般的なライセンスまたは許可を取得するために作られた試みの結果を得ることができますhttp://www.ietf.org/iprのIETFのオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、その注意にこの標準を実装するために必要とされる技術をカバーすることができる任意の著作権、特許または特許出願、またはその他の所有権を持ってすべての利害関係者を招待します。 ietf-ipr@ietf.orgのIETFに情報を記述してください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is provided by the IETF Administrative Support Activity (IASA).",
      "ja": "RFCエディタ機能のための資金は、IETF管理サポート活動（IASA）によって提供されます。"
    }
  ]
}