{
  "title": {
    "text": "RFC 4510 - Lightweight Directory Access Protocol (LDAP): Technical Specification Road Map",
    "ja": "RFC 4510 - LDAP（Lightweight Directory Access Protocol）：技術仕様のロードマップ"
  },
  "number": 4510,
  "created_at": "2019-10-21 22:57:17.074898+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                   K. Zeilenga, Ed.\nRequest for Comments: 4510                           OpenLDAP Foundation\nObsoletes: 2251, 2252, 2253, 2254, 2255,                       June 2006\n           2256, 2829, 2830, 3377, 3771\nCategory: Standards Track",
      "raw": true
    },
    {
      "indent": 13,
      "text": "Lightweight Directory Access Protocol (LDAP):\n       Technical Specification Road Map",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2006).",
      "ja": "著作権（C）インターネット協会（2006）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "The Lightweight Directory Access Protocol (LDAP) is an Internet protocol for accessing distributed directory services that act in accordance with X.500 data and service models. This document provides a road map of the LDAP Technical Specification.",
      "ja": "LDAP（Lightweight Directory Access Protocol）はX.500データとサービスモデルに従って行動分散ディレクトリサービスにアクセスするためのインターネットプロトコルです。このドキュメントは、LDAP技術仕様のロードマップを提供します。"
    },
    {
      "indent": 0,
      "text": "1. The LDAP Technical Specification",
      "section_title": true,
      "ja": "1. LDAP技術仕様"
    },
    {
      "indent": 3,
      "text": "The technical specification detailing version 3 of the Lightweight Directory Access Protocol (LDAP), an Internet Protocol, consists of this document and the following documents:",
      "ja": "ライトウェイトディレクトリアクセスプロトコル（LDAP）のバージョン3を詳述技術仕様は、インターネット・プロトコルは、このドキュメントと次のドキュメントで構成されています。"
    },
    {
      "indent": 6,
      "text": "LDAP: The Protocol [RFC4511] LDAP: Directory Information Models [RFC4512] LDAP: Authentication Methods and Security Mechanisms [RFC4513] LDAP: String Representation of Distinguished Names [RFC4514] LDAP: String Representation of Search Filters [RFC4515] LDAP: Uniform Resource Locator [RFC4516] LDAP: Syntaxes and Matching Rules [RFC4517] LDAP: Internationalized String Preparation [RFC4518] LDAP: Schema for User Applications [RFC4519]",
      "ja": "LDAP：プロトコル[RFC4511] LDAP：ディレクトリ情報モデル[RFC4512] LDAP：認証方法とセキュリティメカニズム[RFC4513] LDAP：識別名の文字列表現[RFC4514] LDAP：検索フィルタの文字列表現[RFC4515] LDAP：ユニフォームリソースロケータ[RFC4516] LDAP：構文と一致規則[RFC4517] LDAP：国際化文字列の準備[RFC4518] LDAP：ユーザー・アプリケーション用のスキーマ[RFC4519]"
    },
    {
      "indent": 3,
      "text": "The terms \"LDAP\" and \"LDAPv3\" are commonly used to refer informally to the protocol specified by this technical specification. The LDAP suite, as defined here, should be formally identified in other documents by a normative reference to this document.",
      "ja": "用語「LDAP」と「LDAPv3のは、」一般的に、この技術仕様書で指定されたプロトコルを非公式に参照するために使用されています。 LDAPスイートは、ここで定義されるように、正式にこの文書を引用規格によって他の文書に特定されるべきです。"
    },
    {
      "indent": 3,
      "text": "LDAP is an extensible protocol. Extensions to LDAP may be specified in other documents. Nomenclature denoting such combinations of LDAP-plus-extensions is not defined by this document but may be defined in some future document(s). Extensions are expected to be truly optional. Considerations for the LDAP extensions described in BCP 118, RFC 4521 [RFC4521] fully apply to this revision of the LDAP Technical Specification.",
      "ja": "LDAPは、拡張可能なプロトコルです。 LDAPへの拡張は、他の文書で指定することができます。 LDAPプラス拡張のような組合せを表す命名法は、この文書で定義されていませんが、いくつかの将来の文書で定義されてもよいです。拡張機能は本当にオプションであると予想されます。 BCP 118で説明したLDAPの拡張のための考慮事項は、RFC 4521 [RFC4521]は、完全にLDAP技術仕様のこのリビジョンに適用されます。"
    },
    {
      "indent": 3,
      "text": "IANA (Internet Assigned Numbers Authority) considerations for LDAP described in BCP 64, RFC 4520 [RFC4520] apply fully to this revision of the LDAP technical specification.",
      "ja": "IANA（Internet Assigned Numbers Authority）BCP 64で説明したLDAPへの配慮、RFC 4520 [RFC4520]はLDAP技術仕様のこのリビジョンに完全に適用されます。"
    },
    {
      "indent": 0,
      "text": "1.1. Conventions",
      "section_title": true,
      "ja": "1.1。表記"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14 [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はありますBCP 14 [RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. Relationship to X.500",
      "section_title": true,
      "ja": "X.500 2.関係"
    },
    {
      "indent": 3,
      "text": "This technical specification defines LDAP in terms of [X.500] as an X.500 access mechanism. An LDAP server MUST act in accordance with the X.500 (1993) series of International Telecommunication Union - Telecommunication Standardization (ITU-T) Recommendations when providing the service. However, it is not required that an LDAP server make use of any X.500 protocols in providing this service. For example, LDAP can be mapped onto any other directory system so long as the X.500 data and service models [X.501][X.511], as used in LDAP, are not violated in the LDAP interface.",
      "ja": "この技術仕様書はX.500アクセス機構として[X.500]の観点からLDAPを定義します。電気通信標準（ITU-T）勧告サービスを提供する -  LDAPサーバは、国際電気通信連合のX.500（1993）シリーズに従って行動しなければなりません。しかし、LDAPサーバがこのサービスを提供する任意のX.500プロトコルを利用することは必要とされません。 LDAPで使用されるように、例えば、LDAPは、X.500データとサービスモデル[X.501] [X.511]限り、任意の他のディレクトリシステムにマッピングすることができ、LDAPインタフェースに違反していません。"
    },
    {
      "indent": 3,
      "text": "This technical specification explicitly incorporates portions of X.500(93). Later revisions of X.500 do not automatically apply to this technical specification.",
      "ja": "この技術仕様書は、明示的にX.500（93）の部分が組み込まれています。 X.500の新しいリビジョンは自動的にこの技術仕様書には適用されません。"
    },
    {
      "indent": 0,
      "text": "3. Relationship to Obsolete Specifications",
      "section_title": true,
      "ja": "廃止された仕様に3.の関係"
    },
    {
      "indent": 3,
      "text": "This technical specification, as defined in Section 1, obsoletes entirely the previously defined LDAP technical specification defined in RFC 3377 (and consisting of RFCs 2251-2256, 2829, 2830, 3771, and 3377 itself). The technical specification was significantly reorganized.",
      "ja": "セクション1に定義されるように、この技術仕様は、完全に以前に定義されたLDAP技術RFC 3377で定義された仕様（およびRFC 2251から2256、2829、2830、3771から成る、および3377自体）を廃止します。技術仕様を大幅に再編されました。"
    },
    {
      "indent": 3,
      "text": "This document replaces RFC 3377 as well as Section 3.3 of RFC 2251. [RFC4512] replaces portions of RFC 2251, RFC 2252, and RFC 2256. [RFC4511] replaces the majority RFC 2251, portions of RFC 2252, and all of RFC 3771. [RFC4513] replaces RFC 2829, RFC 2830, and portions of RFC 2251. [RFC4517] replaces the majority of RFC 2252 and portions of RFC 2256. [RFC4519] replaces the majority of RFC 2256. [RFC4514] replaces RFC 2253. [RFC4515] replaces RFC 2254. [RFC4516] replaces RFC 2255.",
      "ja": "この文書は、RFC 3377置き換えならびにRFC 2251のセクション3.3 [RFC4512]は、RFC 2251の部分、RFC 2252、およびRFC 2256 [RFC4511]を置き換える多数RFC 2251、RFC 2252の部分、及びRFC 3771のすべてを置き換えます。 [RFC4513]はRFC 2829、RFC 2830、およびRFC 2251の部分を置き換える[RFC4517]は、RFC 2252及びRFC 2256 [RFC4519]の部分の大部分を置き換えるRFC 2256の大部分を置き換える[RFC4514]は、RFC 2253 [RFC4515に取って代わります] RFC 2254 [RFC4516]はRFC 2255を置き換える置き換えます。"
    },
    {
      "indent": 3,
      "text": "[RFC4518] is new to this revision of the LDAP technical specification.",
      "ja": "[RFC4518]はLDAP技術仕様のこの改正に新しいです。"
    },
    {
      "indent": 3,
      "text": "Each document of this specification contains appendices summarizing changes to all sections of the specifications they replace. Appendix A.1 of this document details changes made to RFC 3377. Appendix A.2 of this document details changes made to Section 3.3 of RFC 2251.",
      "ja": "この仕様の各文書は、彼らが交換する仕様のすべてのセクションへの変更をまとめた付録が含まれています。このドキュメントの付録A.1がRFCに加えられた変更の詳細を、このドキュメントの3377.付録A.2は、RFC 2251のセクション3.3に加えられた変更を詳述します。"
    },
    {
      "indent": 3,
      "text": "Additionally, portions of this technical specification update and/or replace a number of other documents not listed above. These relationships are discussed in the documents detailing these portions of this technical specification.",
      "ja": "また、本技術仕様書の更新の部分および/または上記に記載されていない他のドキュメントの数を交換してください。これらの関係は、この技術仕様書のこれらの部分を詳述した文書で説明されています。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "LDAP security considerations are discussed in each document comprising the technical specification.",
      "ja": "LDAPセキュリティの考慮事項は、技術仕様を構成する各文書で説明されています。"
    },
    {
      "indent": 0,
      "text": "5. Acknowledgements",
      "section_title": true,
      "ja": "5.謝辞"
    },
    {
      "indent": 3,
      "text": "This document is based largely on RFC 3377 by J. Hodges and R. Morgan, a product of the LDAPBIS and LDAPEXT Working Groups. The document also borrows from RFC 2251 by M. Wahl, T. Howes, and S. Kille, a product of the ASID Working Group.",
      "ja": "この文書は、主にJ.ホッジスとR.モルガン、LDAPBISとLDAPEXTワーキンググループの製品により、RFC 3377に基づいています。文書はまた、M.ワール、T.ハウズ、およびS. Kille、ASID作業部会の積によってRFC 2251から借用します。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the IETF LDAPBIS Working Group.",
      "ja": "この文書は、IETF LDAPBISワーキンググループの製品です。"
    },
    {
      "indent": 0,
      "text": "6. Normative References",
      "section_title": true,
      "ja": "6.引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC4511] Sermersheim, J., Ed., \"Lightweight Directory Access Protocol (LDAP): The Protocol\", RFC 4511, June 2006.",
      "ja": "[RFC4511] Sermersheim、J.、エド、 \"ライトウェイトディレクトリアクセスプロトコル（LDAP）：プロトコル\"、RFC 4511、2006年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC4512] Zeilenga, K., \"Lightweight Directory Access Protocol (LDAP): Directory Information Models\", RFC 4512, June 2006.",
      "ja": "[RFC4512] Zeilenga、K.、 \"ライトウェイトディレクトリアクセスプロトコル（LDAP）：ディレクトリ情報モデル\"、RFC 4512、2006年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC4513] Harrison, R., Ed., \"Lightweight Directory Access Protocol (LDAP): Authentication Methods and Security Mechanisms\", RFC 4513, June 2006.",
      "ja": "[RFC4513]ハリソン、R.、エド、 \"ライトウェイトディレクトリアクセスプロトコル（LDAP）：認証方法とセキュリティメカニズム\"。、RFC 4513、2006年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC4514] Zeilenga, K., Ed., \"Lightweight Directory Access Protocol (LDAP): String Representation of Distinguished Names\", RFC 4514, June 2006.",
      "ja": "[RFC4514] Zeilenga、K.、エド、 \"ライトウェイトディレクトリアクセスプロトコル（LDAP）：識別名の文字列表現\"。、RFC 4514、2006年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC4515] Smith, M., Ed. and T. Howes, \"Lightweight Directory Access Protocol (LDAP): String Representation of Search Filters\", RFC 4515, June 2006.",
      "ja": "[RFC4515]スミス、M.、エド。そして、T.ハウズ、「ライトウェイトディレクトリアクセスプロトコル（LDAP）：検索フィルタの文字列表現」、RFC 4515、2006年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC4516] Smith, M., Ed. and T. Howes, \"Lightweight Directory Access Protocol (LDAP): Uniform Resource Locator\", RFC 4516, June 2006.",
      "ja": "[RFC4516]スミス、M.、エド。そして、T.ハウズ、 \"ライトウェイトディレクトリアクセスプロトコル（LDAP）：ユニフォームリソースロケータ\"、RFC 4516、2006年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC4517] Legg, S., Ed., \"Lightweight Directory Access Protocol (LDAP): Syntaxes and Matching Rules\", RFC 4517, June 2006.",
      "ja": "[RFC4517]レッグ、S.​​、エド、 \"ライトウェイトディレクトリアクセスプロトコル（LDAP）：構文と一致規則\"、RFC 4517、2006年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC4518] Zeilenga, K., \"Lightweight Directory Access Protocol (LDAP): Internationalized String Preparation\", RFC 4518, June 2006.",
      "ja": "[RFC4518] Zeilenga、K.、 \"ライトウェイトディレクトリアクセスプロトコル（LDAP）：国際化文字列の準備\"、RFC 4518、2006年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC4519] Sciberras, A., Ed., \"Lightweight Directory Access Protocol (LDAP): Schema for User Applications\", RFC 4519, June 2006.",
      "ja": "[RFC4519] Sciberras、A.、エド、 \"ライトウェイトディレクトリアクセスプロトコル（LDAP）：ユーザー・アプリケーションのためのスキーマ\"。、RFC 4519、2006年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC4520] Zeilenga, K., \"Internet Assigned Numbers Authority (IANA) Considerations for the Lightweight Directory Access Protocol (LDAP)\", BCP 64, RFC 4520, June 2006.",
      "ja": "[RFC4520] Zeilenga、K.、 \"IANA（Internet Assigned Numbers Authority）のライトウェイトディレクトリアクセスプロトコル（LDAP）に関する考慮事項\"、BCP 64、RFC 4520、2006年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC4521] Zeilenga, K., \"Considerations for LDAP Extensions\", BCP 118, RFC 4521, June 2006.",
      "ja": "[RFC4521] Zeilenga、K.、 \"LDAP拡張のための考慮事項\"、BCP 118、RFC 4521、2006年6月。"
    },
    {
      "indent": 3,
      "text": "[X.500] International Telecommunication Union - Telecommunication Standardization Sector, \"The Directory -- Overview of concepts, models and services\", X.500(1993) (also ISO/IEC 9594-1:1994).",
      "ja": "[X.500]国際電気通信連合 - 電気通信標準化部門、 \"ディレクトリ - 概念、モデルとサービスの概要\"、X.500（1993）（また、ISO / IEC 9594から1：1994）。"
    },
    {
      "indent": 3,
      "text": "[X.501] International Telecommunication Union - Telecommunication Standardization Sector, \"The Directory -- Models\", X.501(1993) (also ISO/IEC 9594- 2:1994).",
      "ja": "[X.501]国際電気通信連合 - 電気通信標準化部門、 \"ディレクトリ - モデル\"、X.501（1993）（また、ISO / IEC 9594- 2：1994）。"
    },
    {
      "indent": 3,
      "text": "[X.511] International Telecommunication Union - Telecommunication Standardization Sector, \"The Directory: Abstract Service Definition\", X.511(1993) (also ISO/IEC 9594-3:1993).",
      "ja": "[X.511]国際電気通信連合 - 電気通信標準化部門、 \"ディレクトリ：抽象サービス定義\"、X.511（1993）（また、ISO / IEC 9594から3：1993）。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Changes to Previous Documents",
      "ja": "付録A.前の文書に変更します"
    },
    {
      "indent": 3,
      "text": "This appendix outlines changes this document makes relative to the documents it replaces (in whole or in part).",
      "ja": "この付録では、この文書は、それが（全体的にまたは部分的に）代わる書類に対する相対行う変更の概要を説明します。"
    },
    {
      "indent": 1,
      "text": "A.1. Changes to",
      "ja": "A.1。への変更"
    },
    {
      "indent": 3,
      "text": "This document is nearly a complete rewrite of RFC 3377 as much of the material of RFC 3377 is no longer applicable. The changes include redefining the terms \"LDAP\" and \"LDAPv3\" to refer to this revision of the technical specification.",
      "ja": "このドキュメントは、ほぼRFC 3377の材料の限りRFC 3377の完全な書き換えは、もはや適用されません。変更内容は、技術仕様のこのリビジョンを参照するために、「LDAP」と「LDAPv3のを」という用語を再定義しています。"
    },
    {
      "indent": 1,
      "text": "A.2. Changes to",
      "ja": "A.2。への変更"
    },
    {
      "indent": 3,
      "text": "The section was modified slightly (the word \"document\" was replaced with \"technical specification\") to clarify that it applies to the entire LDAP technical specification.",
      "ja": "セクションが若干変更されたことが全体のLDAP技術仕様に適用されることを明確にする（言葉「文書」は、「技術仕様」に置き換えました）。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Kurt D. Zeilenga OpenLDAP Foundation",
      "ja": "クルトD. ZeilengaのOpenLDAP財団"
    },
    {
      "indent": 3,
      "text": "EMail: Kurt@OpenLDAP.org",
      "ja": "メールアドレス：Kurt@OpenLDAP.org"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2006).",
      "ja": "著作権（C）インターネット協会（2006）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "この文書では、BCP 78に含まれる権利と許可と制限の適用を受けており、その中の記載を除いて、作者は彼らのすべての権利を保有します。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とCONTRIBUTOR「そのまま」、ORGANIZATION HE / SHEが表すまたはインターネットソサエティおよびインターネット・エンジニアリング・タスク・フォース放棄すべての保証、明示または、（もしあれば）後援ISに設けられています。黙示、情報の利用は、特定の目的に対する権利または商品性または適合性の黙示の保証を侵害しない任意の保証含むがこれらに限定されません。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、本書またはそのような権限下で、ライセンスがたりないかもしれない程度に記載された技術の実装や使用に関係すると主張される可能性があります任意の知的財産権やその他の権利の有効性または範囲に関していかなる位置を取りません利用可能です。またそれは、それがどのような権利を確認する独自の取り組みを行ったことを示すものでもありません。 RFC文書の権利に関する手続きの情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IPRの開示のコピーが利用できるようにIETF事務局とライセンスの保証に行われた、または本仕様の実装者または利用者がそのような所有権の使用のための一般的なライセンスまたは許可を取得するために作られた試みの結果を得ることができますhttp://www.ietf.org/iprのIETFのオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、その注意にこの標準を実装するために必要とされる技術をカバーすることができる任意の著作権、特許または特許出願、またはその他の所有権を持ってすべての利害関係者を招待します。 ietf-ipr@ietf.orgのIETFに情報を記述してください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "了承"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is provided by the IETF Administrative Support Activity (IASA).",
      "ja": "RFCエディタ機能のための資金は、IETF管理サポート活動（IASA）によって提供されます。"
    }
  ]
}