{
  "title": {
    "text": "RFC 4197 - Requirements for Edge-to-Edge Emulation of Time Division Multiplexed (TDM) Circuits over Packet Switching Networks",
    "ja": "RFC 4197 - パケット交換網の上に端から端時分割多重のエミュレーション（TDM）回路の要件"
  },
  "number": 4197,
  "created_at": "2019-10-21 20:45:00.077192+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                          M. Riegel\nRequest for Comments: 4197                                    Siemens AG\nCategory: Informational                                     October 2005",
      "raw": true
    },
    {
      "indent": 13,
      "text": " Requirements for Edge-to-Edge Emulation of\nTime Division Multiplexed (TDM) Circuits over\n          Packet Switching Networks",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモはインターネットコミュニティのための情報を提供します。それはどんな種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "ja": "著作権（C）インターネット協会（2005）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document defines the specific requirements for edge-to-edge emulation of circuits carrying Time Division Multiplexed (TDM) digital signals of the Plesiochronous Digital Hierarchy as well as the Synchronous Optical NETwork/Synchronous Digital Hierarchy over packet-switched networks. It is aligned to the common architecture for Pseudo Wire Emulation Edge-to-Edge (PWE3). It makes references to the generic requirements for PWE3 where applicable and complements them by defining requirements originating from specifics of TDM circuits.",
      "ja": "この文書では、時分割多重（TDM）、プレシオクロナスデジタル階層のデジタル信号ならびにパケット交換ネットワークを介した同期光ネットワーク/同期デジタル階層を運ぶ回路のエッジツーエッジエミュレーションのための特定の要件を定義します。これは、擬似ワイヤエミュレーションエッジ・ツー・エッジ（PWE3）のための共通のアーキテクチャに整列されます。それは、適用およびTDM回路の仕様に起因する要件を定義することによって、それらを補完PWE3するための一般的な要件への参照を行います。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n   1.1. TDM Circuits Belonging to the PDH Hierarchy ................3\n        1.1.1. TDM Structure and Transport Modes ...................4\n   1.2. SONET/SDH Circuits .........................................4\n2. Motivation ......................................................5\n3. Terminology .....................................................6\n4. Reference Models ................................................7\n   4.1. Generic PWE3 Models ........................................7\n   4.2. Clock Recovery .............................................7\n   4.3. Network Synchronization Reference Model ....................8\n        4.3.1. Synchronous Network Scenarios ......................10\n        4.3.2. Relative Network Scenario ..........................12\n        4.3.3. Adaptive Network Scenario ..........................12\n5. Emulated Services ..............................................13\n   5.1. Structure-Agnostic Transport of Signals out of the\n        PDH Hierarchy .............................................13\n   5.2. Structure-Aware Transport of Signals out of the\n        PDH Hierarchy .............................................14\n   5.3. Structure-Aware Transport of SONET/SDH Circuits ...........14\n6. Generic Requirements ...........................................14\n   6.1. Relevant Common PW Requirements ...........................14\n   6.2. Common Circuit Payload Requirements .......................15\n   6.3. General Design Issues .....................................16\n7. Service-Specific Requirements ..................................16\n   7.1. Connectivity ..............................................16\n   7.2. Network Synchronization ...................................16\n   7.3. Robustness ................................................16\n        7.3.1. Packet loss ........................................17\n        7.3.2. Out-of-order delivery ..............................17\n   7.4. CE Signaling ..............................................17\n   7.5. PSN Bandwidth Utilization .................................18\n   7.6. Packet Delay Variation ....................................19\n   7.7. Compatibility with the Existing PSN Infrastructure ........19\n   7.8. Congestion Control ........................................19\n   7.9. Fault Detection and Handling ..............................20\n   7.10. Performance Monitoring ...................................20\n8. Security Considerations ........................................20\n9. References .....................................................20\n   9.1. Normative References ......................................20\n   9.2. Informative References ....................................21\n10. Contributors Section ..........................................22",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "This document defines the specific requirements for edge-to-edge emulation of circuits carrying Time Division Multiplexed (TDM) digital signals of the Plesiochronous Digital Hierarchy (PDH) as well as the Synchronous Optical NETwork (SONET)/Synchronous Digital Hierarchy (SDH) over Packet-Switched Networks (PSN). It is aligned to the common architecture for Pseudo Wire Emulation Edge-to-Edge (PWE3) as defined in [RFC3985]. It makes references to requirements in [RFC3916] where applicable and complements [RFC3916] by defining requirements originating from specifics of TDM circuits.",
      "ja": "この文書では、時分割多重（TDM）、プレシオクロナスデジタルハイアラーキ（PDH）ならびに同期光ネットワーク（SONET）/同期デジタル階層（SDH）上のデジタル信号を搬送する回路のエッジツーエッジエミュレーションのための特定の要件を定義しますパケット交換ネットワーク（PSN）。これは、擬似ワイヤエミュレーションエッジ・ツー・エッジ（PWE3）[RFC3985]で定義されるようにするための共通のアーキテクチャに整列されます。これは、TDM回路の仕様に起因する要件を定義することによって、[RFC3916]該当する場合と補完[RFC3916]で要件への参照を行います。"
    },
    {
      "indent": 3,
      "text": "The term \"TDM\" will be used in this documents as a general descriptor for the synchronous bit streams belonging to either the PDH or the SONET/SDH hierarchies.",
      "ja": "用語「TDMは」PDHまたはSONET / SDH階層のいずれかに属する同期ビットストリームのための一般的な記述として、このドキュメントで使用されます。"
    },
    {
      "indent": 0,
      "text": "1.1. TDM Circuits Belonging to the PDH Hierarchy",
      "section_title": true,
      "ja": "1.1。 PDH階層に属するTDM回路"
    },
    {
      "indent": 3,
      "text": "The bit rates traditionally used in various regions of the world are detailed in the normative reference [G.702]. For example, in North America, the T1 bit stream of 1.544 Mbps and the T3 bit stream of 44.736 Mbps are mandated, while in Europe, the E1 bit stream of 2.048 Mbps and the E3 bit stream of 34.368 Mbps are utilized.",
      "ja": "伝統的に、世界の様々な地域で使用されるビットレートは、引用規格[G.702]に詳述されています。ヨーロッパでは、2.048 MbpsののE1ビットストリームと34.368 MbpsでのE3のビットストリームが利用されている間、例えば、北米では、1.544 MbpsののT1ビットストリームと44.736 MbpsでのT3ビットストリームは、義務付けられています。"
    },
    {
      "indent": 3,
      "text": "Although TDM can be used to carry unstructured bit streams at the rates defined in [G.702], there is a standardized method of carrying bit streams in larger units called frames, each frame contains the same number of bits.",
      "ja": "TDMは[G.702]で定義された速度で非構造化ビットストリームを運ぶために使用することができるが、フレームと呼ばれるより大きな単位でビットストリームを搬送する標準化された方法があり、各フレームは、同じ数のビットを含んでいます。"
    },
    {
      "indent": 3,
      "text": "Related to the sampling frequency of voice traffic the bitrate is always a multiple of 8000, hence the T1 frame consists of 193 bits and the E1 frame of 256 bits. The number of bits in a frame is called the frame size.",
      "ja": "音声トラフィックのサンプリング周波数に関連するビットレートが常に8000の倍数であり、したがってT1フレームは193ビットと256ビットのE1フレームから成ります。フレーム内のビット数は、フレームサイズと呼ばれます。"
    },
    {
      "indent": 3,
      "text": "The framing is imposed by introducing a periodic pattern into the bit stream to identify the boundaries of the frames (e.g., 1 framing bit per T1 frame, a sequence of 8 framing bits per E1 frame). The details of how these framing bits are generated and used are elucidated in [G.704], [G.706], and [G.751]. Unframed TDM has all bits available for payload.",
      "ja": "フレーミングは、フレームの境界を識別するために、ビットストリームに周期的なパターンを導入することにより課される（例えば、T1フレームあたり1フレーミングビット、E1フレーム当たり8フレーミングビットのシーケンス）。これらのフレーミングビットが生成され、使用方法の詳細は[G.704]、[G.706]、および[G.751]に説明されています。非フレームTDMは、ペイロードのために利用可能なすべてのビットを持っています。"
    },
    {
      "indent": 3,
      "text": "Framed TDM is often used to multiplex multiple channels (e.g., voice channels each consisting of 8000 8-bit-samples per second) in a sequence of \"timeslots\" recurring in the same position in each frame. This multiplexing is called \"channelized TDM\" and introduces additional structure.",
      "ja": "枠TDMは、多くの場合、各フレームの同じ位置に繰り返し「タイムスロット」の順序で（例えば、音声チャネルは、それぞれ、毎秒8000の8ビット・サンプルからなる）複数のチャネルを多重化するために使用されます。この多重化は、「チャネライズドTDM」と呼ばれ、追加の構造を紹介しています。"
    },
    {
      "indent": 3,
      "text": "In some cases, framing also defines groups of consecutive frames called multiframes. Such grouping imposes an additional level of structure on the TDM bit-stream.",
      "ja": "いくつかのケースでは、フレーミングもマルチフレームと呼ばれる連続したフレームのグループを定義します。そのようなグループ化は、TDMビットストリーム上の構造の付加的なレベルを課します。"
    },
    {
      "indent": 0,
      "text": "1.1.1. TDM Structure and Transport Modes",
      "section_title": true,
      "ja": "1.1.1。 TDM構造と輸送モード"
    },
    {
      "indent": 3,
      "text": "Unstructured TDM: TDM that consists of a raw bit-stream of rate defined in [G.702], with all bits available for payload.",
      "ja": "非構造化TDM：ペイロードのために利用可能なすべてのビットが[G.702]で定義されたレートの生ビットストリームから成り、TDM。"
    },
    {
      "indent": 3,
      "text": "Structured TDM: TDM with one or more levels of structure delineation, including frames, channelization, and multiframes (e.g., as defined in [G.704], [G.751], and [T1.107]).",
      "ja": "（[G.704]で定義されるように、例えば、[G.751]、および[T1.107]）のフレーム、チャネル、およびマルチフレームを含む構造の描写の1つまたは複数のレベルを有するTDM：構造化されたTDM。"
    },
    {
      "indent": 3,
      "text": "Structure-Agnostic Transport: Transport of unstructured TDM, or of structured TDM when the structure is deemed inconsequential from the transport point of view. In structure-agnostic transport, any structural overhead that may be present is transparently transported along with the payload data, and the encapsulation provides no mechanisms for its location or utilization.",
      "ja": "構造に依存しないトランスポート：非構造化TDMの、または構造化TDMのトランスポート構造がビューの輸送の観点から重要でないとみなされます。構造に依存しないトランスポートでは、存在し得る任意の構造オーバーヘッドは透過ペイロードデータと共に搬送され、カプセル化は、その場所又は使用のためのメカニズムを提供していません。"
    },
    {
      "indent": 3,
      "text": "Structure-Aware Transport: Transport of structured TDM taking at least some level of the structure into account. In structure-aware transport, there is no guarantee that all bits of the TDM bit-stream will be transported over the PSN network (specifically, the synchronization bits and related overhead may be stripped at ingress and usually will be regenerated at egress) or that transported bits will be situated in the packet in their original order (but in this case, bit order is usually recovered at egress; one known exception is loss of multiframe synchronization between the TDM data and CAS bits introduced by a digital cross-connect acting as a Native Service Processing (NSP) block, see [TR-NWT-170]).",
      "ja": "構造-Awareの交通：構造化TDMの輸送を考慮に構造の少なくともいくつかのレベルを取ります。構造認識輸送において、TDMビットストリームのすべてのビットがPSNネットワーク（具体的には、同期ビット及び関連するオーバーヘッドは、入口でストリッピングすることができ、通常出力で再生される）、またはその上に輸送される保証はありません搬送ビットは元の順序でパケットに配置される（この場合には、ビットの順序は、通常、出口で回収される。つの既知の例外によって導入TDMデータとCASビット間のマルチフレーム同期の損失であるとして作用するデジタルクロスコネクトネイティブサービス処理（NSP）ブロック）[TR-NWT-170]を参照してください。"
    },
    {
      "indent": 0,
      "text": "1.2. SONET/SDH Circuits",
      "section_title": true,
      "ja": "1.2。 SONET / SDH回線"
    },
    {
      "indent": 3,
      "text": "The term SONET refers to the North American Synchronous Optical NETwork as specified by [T1.105]. It is based on the concept of a Nx783 byte payload container repeated every 125us. This payload is referred to as an STS-1 SPE and may be concatenated into higher bandwidth circuits (e.g., STS-Nc) or sub-divided into lower bandwidth circuits (Virtual Tributaries). The higher bandwidth concatenated circuits can be used to carry anything from IP Packets to ATM cells to Digital Video Signals. Individual STS-1 SPEs are frequently used to carry individual DS3 or E3 TDM circuits. When the 783 byte containers are sub-divided for lower rate payloads, they are frequently used to carry individual T1 or E1 TDM circuits.",
      "ja": "[T1.105]で指定されている用語SONETは北アメリカの同期光ネットワークを指します。それは、すべての125usを繰り返しNx783バイトのペイロード・コンテナの概念に基づいています。このペイロードはSTS-1 SPEと呼ばれ、より高い帯域幅の回路に連結（例えば、STS-NC）または低帯域幅回路（仮想支流）に細分されてもよいです。より高い帯域幅の連結回路は、デジタル映像信号にATMセルをするIPパケットから何かを運ぶために使用することができます。個々のSTS-1 SPEは、しばしば、個々のDS3またはE3のTDM回線を運ぶために使用されます。 783個のバイトの容器が低レートペイロードのためにサブ分割されている場合、それらはしばしば、個々のT1またはE1のTDM回線を運ぶために使用されます。"
    },
    {
      "indent": 3,
      "text": "The Synchronous Digital Hierarchy (SDH) is the international equivalent and enhancement of SONET and is specified by [G.707].",
      "ja": "同期デジタルハイアラーキ（SDH）は、SONETの国際同等と強化され、[G.707]で指定されています。"
    },
    {
      "indent": 3,
      "text": "Both SONET and SDH include a substantial amount of transport overhead that is used for performance monitoring, fault isolation, and other maintenance functions along different types of optical or electrical spans. This also includes a pointer-based mechanism for carrying payloads asynchronously. In addition, the payload area includes dedicated overhead for end-to-end performance monitoring, fault isolation, and maintenance for the service being carried. If the main payload area is sub-divided into lower rate circuits (such as T1/E1), additional overhead is included for end-to-end monitoring of the individual T1/E1 circuits.",
      "ja": "SONETとSDHの両方は、実質的なパフォーマンス監視のために使用されるトランスポート・オーバヘッドの量、障害分離、および光学的または電気的スパンの異なるタイプに沿った他の保守機能を含みます。これはまた、非同期ペイロードを運ぶためのポインタベースの機構を含みます。また、ペイロード領域は、エンドツーエンドのパフォーマンス監視、障害分離、及び運ばれるサービスの維持のための専用のオーバーヘッドを含みます。メインペイロード領域は、（例えば、T1 / E1など）低レート回路にサブ分割されている場合、追加のオーバーヘッドは、個々のT1 / E1回線のエンドツーエンドの監視のために含まれています。"
    },
    {
      "indent": 3,
      "text": "This document discusses the requirements for emulation of SONET/SDH services. These services include end-to-end emulation of the SONET payload (STS-1 SPE), emulation of concatenated payloads (STS-Nc SPE), as well as emulation of a variety of sub-STS-1 rate circuits jointly referred to as Virtual Tributaries (VT) and their SDH analogs.",
      "ja": "この文書では、SONET / SDHサービスのエミュレーションのための要件について説明します。これらのサービスは、SONETペイロード（STS-1 SPE）、連結ペイロード（STS-NC SPE）のエミュレーションのエンドツーエンドのエミュレーションを含む、ならびにサブSTS-1レート回路の種々のエミュレーションは共同と称される仮想支流（VT）とそのSDHアナログ。"
    },
    {
      "indent": 0,
      "text": "2. Motivation",
      "section_title": true,
      "ja": "2.動機"
    },
    {
      "indent": 3,
      "text": "[RFC3916] specifies common requirements for edge-to-edge emulation of circuits of various types. However, these requirements, as well as references in [RFC3985], do not cover specifics of PWs carrying TDM circuits.",
      "ja": "[RFC3916]は、様々なタイプの回路のエッジツーエッジエミュレーションのための一般的な要件を指定します。しかし、これらの要件だけでなく、[RFC3985]での参照は、TDM回線を運ぶのPW仕様をカバーしていません。"
    },
    {
      "indent": 3,
      "text": "The need for a specific document to complement [RFC3916] addressing of edge-to-edge emulation of TDM circuits arises from the following:",
      "ja": "TDM回線のエッジツーエッジエミュレーションのアドレッシング補完する特定のドキュメントの必要[RFC3916]は以下から生じます。"
    },
    {
      "indent": 3,
      "text": "o Specifics of the TDM circuits. For example,",
      "ja": "TDM回線のO細目。例えば、"
    },
    {
      "indent": 6,
      "text": "* the need for balance between the clock of ingress and egress attachment circuits in each direction of the Pseudo Wire (PW),",
      "ja": "*疑似ワイヤ（PW）の各方向に出入りアタッチメント回路のクロックとの間のバランスの必要性を、"
    },
    {
      "indent": 6,
      "text": "* the need to maintain jitter and wander of the clock of the egress end service, within the limits imposed by the appropriate normative documents, in the presence of the packet delay variation produced by the PSN.",
      "ja": "* PSNによって生成されたパケット遅延変動の存在下で、適切な規範文書によって課される制限内で、出口エンドサービスのクロックのジッタとワンダーを維持する必要があります。"
    },
    {
      "indent": 3,
      "text": "o Specifics of applications using TDM circuits. For example, voice applications,",
      "ja": "TDM回線を使用したアプリケーションのO細目。例えば、音声アプリケーション、"
    },
    {
      "indent": 6,
      "text": "* put special emphasis on minimization of one-way delay, and",
      "ja": "*一方向遅延の最小化に重点を置き、"
    },
    {
      "indent": 6,
      "text": "* are relatively tolerant to errors in data.",
      "ja": "*データのエラーに比較的寛容です。"
    },
    {
      "indent": 3,
      "text": "o Other applications might have different specifics. For example, transport of signaling information",
      "ja": "O他のアプリケーションは異なる仕様を持っているかもしれません。シグナリング情報の例については、輸送"
    },
    {
      "indent": 6,
      "text": "* is relatively tolerant to one-way delay, and",
      "ja": "*一方向遅延に比較的寛容であり、かつ"
    },
    {
      "indent": 6,
      "text": "* is sensitive to errors in transmitted data.",
      "ja": "*送信データのエラーに敏感です。"
    },
    {
      "indent": 3,
      "text": "o Specifics of the customers' expectations regarding end-to-end behavior of services that contain emulated TDM circuits. For example, experience with carrying such services over SONET/SDH networks increases the need for",
      "ja": "エミュレートされたTDM回線が含まれているサービスのエンド・ツー・エンドの行動に関する顧客の期待のO細目。例えば、SONET / SDHネットワーク上でこのようなサービスを運ぶの経験は、の必要性を増加させます"
    },
    {
      "indent": 6,
      "text": "* isolation of problems introduced by the PSN from those occurring beyond the PSN bounds,",
      "ja": "* PSNの境界を越えて発生したものの中からPSNにより導入された問題の単離、"
    },
    {
      "indent": 6,
      "text": "* sensitivity to misconnection,",
      "ja": "*誤接続に対する感度、"
    },
    {
      "indent": 6,
      "text": "* sensitivity to unexpected connection termination, etc.",
      "ja": "*予期しない接続終了に対する感度など"
    },
    {
      "indent": 0,
      "text": "3. Terminology",
      "section_title": true,
      "ja": "3.用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 3,
      "text": "The terms defined in [RFC3985], Section 1.4 are used consistently. However some terms and acronyms are used in conjunction with the TDM services. In particular:",
      "ja": "[RFC3985]で定義された用語は、セクション1.4を一貫して使用されます。しかし、いくつかの用語および略語は、TDMサービスと組み合わせて使用​​されています。特に："
    },
    {
      "indent": 3,
      "text": "TDM networks employ Channel-Associated Signaling (CAS) or Common Channel Signaling (CCS) to supervise and advertise status of telephony applications, provide alerts to these applications (as to requests to connect or disconnect), and to transfer routing and addressing information. These signals must be reliably transported over the PSNs for the telephony end-systems to function properly.",
      "ja": "TDMネットワークは、チャネル関連信号（CAS）または共通線信号（CCS）が監督し、テレフォニーアプリケーションの状態を宣伝、（接続要求または切断するなど）、これらのアプリケーションへのアラートを提供し、ルーティングおよびアドレッシング情報を転送するために採用しています。テレフォニーエンドシステムが正しく機能するためにこれらの信号は確実のPSN上で輸送されなければなりません。"
    },
    {
      "indent": 3,
      "text": "CAS (Channel-Associated Signaling) CAS is carried in the same T1 or E1 frame as the voice signals, but not in the speech band. Since CAS signaling may be transferred at a rate slower than the TDM traffic in a timeslot, one need not update all the CAS bits in every TDM frame. Hence, CAS systems cycle through all the signaling bits only after some number of TDM frames, which defines a new structure known as a multiframe or superframe. Common multiframes are 12, 16, or 24 frames in length, corresponding to 1.5, 2, and 3 milliseconds in duration.",
      "ja": "CAS（チャネル連携信号）CASはなく、音声帯域で、音声信号と同じT1またはE1フレームで運ばれます。 CASシグナリングがタイムスロットにおけるTDMトラフィックよりも遅い速度で転送することができるので、一つはすべてのTDMフレーム内のすべてのCASビットを更新する必要はありません。したがって、唯一のマルチフレームまたはスーパーフレームと呼ばれる新しい構造を定義TDMフレームのいくつかの数、結局シグナリングビットを介してCASシステムサイクル。一般的なマルチフレームは、12、16、または長さが24のフレーム、1.5に対応する、2、および期間で3ミリ秒です。"
    },
    {
      "indent": 3,
      "text": "CCS (Common Channel Signaling) CCS signaling uses a separate digital channel to carry asynchronous messages pertaining to the state of telephony applications over related TDM timeslots of a TDM trunk. This channel may be physically situated in one or more adjacent timeslots of the same TDM trunk (trunk associated CCS) or may be transported over an entirely separate network.",
      "ja": "CCS（共通線信号）CCSシグナリングは、TDMトランクの関連TDMタイムスロットを超えるテレフォニーアプリケーションの状態に関係する非同期メッセージを運ぶために別々のデジタル・チャネルを使用しています。このチャネルは、物理的に同一のTDMトランク（トランク関連CCS）の一個の以上の隣接するタイムスロットに位置してもよいし、全く別のネットワークを介して転送されてもよいです。"
    },
    {
      "indent": 6,
      "text": "CCS is typically HDLC-based, with idle codes or keep-alive messages being sent until a signaling event (e.g., on-hook or off-hook) occurs. Examples of HDLC-based CCS systems are SS7 [Q.700] and ISDN PRI signaling [Q.931].",
      "ja": "CCSは、アイドルコードまたはシグナリング事象（例えば、オンフックまたはオフフック）が発生するまで送信されるキープアライブメッセージを用いて、典型的にはHDLCベースです。 HDLCベースのCCSシステムの例は、[931]をシグナリングSS7 [Q.700]とISDN PRIです。"
    },
    {
      "indent": 3,
      "text": "Note: For the TDM network, we use the terms \"jitter\" and \"wander\" as defined in [G.810] to describe short- and long-term variance of the significant instants of the digital signal, while for the PSN we use the term packet delay variation (PDV) (see [RFC3393]).",
      "ja": "注：TDMネットワークでは、我々は、「ジッター」という用語を使用して、[G.810]で定義されるようにデジタル信号の有意瞬間の短期および長期の変動を説明するために「さまよう」、PSNのために我々が使用している間用語パケット遅延変動（PDV）（[RFC3393]を参照）。"
    },
    {
      "indent": 0,
      "text": "4. Reference Models",
      "section_title": true,
      "ja": "4.参照モデル"
    },
    {
      "indent": 0,
      "text": "4.1. Generic PWE3 Models",
      "section_title": true,
      "ja": "4.1。ジェネリックPWE3モデル"
    },
    {
      "indent": 3,
      "text": "Generic models that have been defined in [RFC3985] in sections",
      "ja": "セクションで、[RFC3985]で定義されている一般的なモデル"
    },
    {
      "indent": 3,
      "text": "- 4.1 (Network Reference Model), - 4.2 (PWE3 Pre-processing), - 4.3 (Maintenance Reference Model), - 4.4 (Protocol Stack Reference Model) and - 4.5 (Pre-processing Extension to Protocol Stack Reference Model).",
      "ja": " -  4.1（ネットワーク参照モデル）、 -  4.2（PWE3前処理）、 -  4.3（メンテナンス参照モデル）、 -  4.4（プロトコルスタック参照モデル）、および -  4.5（プロトコルスタック参照モデルに前処理拡張機能）。"
    },
    {
      "indent": 3,
      "text": "They are fully applicable for the purposes of this document without modification.",
      "ja": "彼らは変更せずに、この文書の目的のために完全に適用されます。"
    },
    {
      "indent": 3,
      "text": "All the services considered in this document represent special cases of the Bit-stream and Structured bit-stream payload type defined in Section 3.3 of [RFC3985].",
      "ja": "本書で考慮されるすべてのサービスは、[RFC3985]のセクション3.3で定義されたビットストリームと構造化ビットストリームペイロードタイプの特別な場合を表します。"
    },
    {
      "indent": 0,
      "text": "4.2. Clock Recovery",
      "section_title": true,
      "ja": "4.2。クロック・リカバリ"
    },
    {
      "indent": 3,
      "text": "Clock recovery is extraction of the transmission bit timing information from the delivered packet stream. Extraction of this information from a highly jittered source, such as a packet stream, may be a complex task.",
      "ja": "クロック・リカバリは、配信パケットストリームからの送信ビットタイミング情報の抽出です。そのようなパケットストリームのような高ジッタ源からの情報の抽出は、複雑なタスクであってもよいです。"
    },
    {
      "indent": 0,
      "text": "4.3. Network Synchronization Reference Model",
      "section_title": true,
      "ja": "4.3。ネットワーク同期リファレンスモデル"
    },
    {
      "indent": 3,
      "text": "Figure 1 shows a generic network synchronization reference model.",
      "ja": "図1は、一般的なネットワーク同期基準モデルを示しています。"
    },
    {
      "indent": 3,
      "text": "       +---------------+               +---------------+\n       |      PE1      |               |      PE2      |\n    K  |   +--+        |               |        +--+   |  G\n    |  |   | J|        |               |        | H|   |  |\n    v  |   v  |        |               |        v  |   |  v\n+---+  | +-+  +-+  +-+ |  +--+   +--+  | +-+  +-+  +-+ |  +---+\n|   |  | |P|  |D|  |P| |  |  |   |  |  | |P|  |E|  |P| |  |   |\n|   |<===|h|<:|e|<:|h|<:::|  |<::|  |<:::|h|<:|n|<=|h|<===|   |\n|   |  | |y|  |c|  |y| |  |  |   |  |  | |y|  |c|  |y| |  |   |\n| C |  | +-+  +-+  +-+ |  |  |   |  |  | +-+  +-+  +-+ |  | C |\n| E |  |               |  |S1|   |S2|  |               |  | E |\n| 1 |  | +-+  +-+  +-+ |  |  |   |  |  | +-+  +-+  +-+ |  | 2 |\n|   |  | |P|  |E|  |P| |  |  |   |  |  | |P|  |D|  |P| |  |   |\n|   |===>|h|=>|n|:>|h|:::>|  |::>|  |:::>|h|:>|e|=>|h|===>|   |\n|   |  | |y|  |c|  |y| |  |  |   |  |  | |y|  |c|  |y| |  |   |\n+---+  | +-+  +-+  +-+ |  +--+   +--+  | +-+  +-+  +-+ |  +---+\n ^  ^  |   |  ^        |               |        |  ^   |  ^  ^\n |  |  |   |B |        |<------+------>|        |  |   |  |  |\n |  A  |   +--+        |       |       |        +--+-E |  F  |\n |     +---------------+      +-+      +---------------+     |\n |             ^              |I|               ^            |\n |             |              +-+               |            |\n |             C                                D            |\n +-----------------------------L-----------------------------+",
      "raw": true
    },
    {
      "indent": 7,
      "text": "Figure 1: The Network Synchronization Reference Model",
      "ja": "図1：ネットワーク同期リファレンスモデル"
    },
    {
      "indent": 3,
      "text": "The following notation is used in Figure 1:",
      "ja": "以下の表記は、図1で使用されています。"
    },
    {
      "indent": 3,
      "text": "CE1, CE2 Customer edge devices terminating TDM circuits to be emulated.",
      "ja": "エミュレートされるTDM回線終端CE1、CE2カスタマエッジデバイス。"
    },
    {
      "indent": 3,
      "text": "PE1, PE2 Provider edge devices adapting these end services to PW.",
      "ja": "PE1、PE2 PWにこれらのエンドサービスを適応プロバイダーエッジデバイス。"
    },
    {
      "indent": 3,
      "text": "S1, S2 Provider core routers.",
      "ja": "S1、S2プロバイダーコアルータ。"
    },
    {
      "indent": 3,
      "text": "Phy Physical interface terminating the TDM circuit.",
      "ja": "TDM回路を終端PHY物理インタフェース。"
    },
    {
      "indent": 3,
      "text": "Enc PSN-bound interface of the PW, where the encapsulation takes place.",
      "ja": "カプセル化が行わPW、ののENC PSN-バインドされたインターフェース。"
    },
    {
      "indent": 3,
      "text": "Dec CE-bound interface of the PW, where the decapsulation takes place. It contains a compensation buffer (also known as the \"jitter buffer\") of limited size.",
      "ja": "カプセル解除が行わPW、の12月のCE-バインドされたインターフェース。これは、限られたサイズの（また、「ジッタバッファ」として知られている）補償バッファを含んでいます。"
    },
    {
      "indent": 3,
      "text": "\"==>\" TDM attachment circuits.",
      "ja": "\"==>\" TDMの接続回線。"
    },
    {
      "indent": 3,
      "text": "\"::>\" PW providing edge-to-edge emulation for the TDM circuit.",
      "ja": "「::>」PWは、TDM回路のためのエッジツーエッジエミュレーションを提供します。"
    },
    {
      "indent": 3,
      "text": "The characters \"A\" - \"L\" denote various clocks:",
      "ja": "文字「A」 - 「L」は、様々なクロックを表します："
    },
    {
      "indent": 3,
      "text": "\"A\" The clock used by CE1 for transmission of the TDM attachment circuit towards CE1.",
      "ja": "CE1に向かってTDMアタッチメント回路の伝送のためにCE1によって使用される「」時計。"
    },
    {
      "indent": 3,
      "text": "\"B\" The clock recovered by PE1 from the incoming TDM attachment circuit. \"A\" and \"B\" always have the same frequency.",
      "ja": "「B」の着信TDM装着回路からPE1によって復元されたクロック。 「A」と「B」は常に同じ周波数を有します。"
    },
    {
      "indent": 3,
      "text": "\"G\" The clock used by CE2 for transmission of the TDM attachment circuit towards CE2.",
      "ja": "「G」CE2に向かってTDMアタッチメント回路の伝送のためにCE2で使用されるクロック。"
    },
    {
      "indent": 3,
      "text": "\"H\" The clock recovered by PE2 from the incoming TDM attachment circuit. \"G\" and \"H\" always have the same frequency.",
      "ja": "「H」着信TDM装着回路からPE2によって復元されたクロック。 「G」と「H」は常に同じ周波数を有します。"
    },
    {
      "indent": 3,
      "text": "\"C\", \"D\" Local oscillators available to PE1 and PE2, respectively.",
      "ja": "それぞれ \"C\"、PE1とPE2に局部発振器が利用可能な \"D\"。"
    },
    {
      "indent": 3,
      "text": "\"E\" Clock used by PE2 to transmit the TDM attachment service circuit to CE2 (the recovered clock).",
      "ja": "CE2（再生クロック）にTDM取付サービス回路を送信するためにPE2によって使用される「E」時計。"
    },
    {
      "indent": 3,
      "text": "\"F\" Clock recovered by CE2 from the incoming TDM attachment service (\"E and \"F\" have the same frequency).",
      "ja": "着信TDM取付サービスからCE2により回収「F」クロック（「Eと 『F』は同じ周波数を有します）。"
    },
    {
      "indent": 3,
      "text": "\"I\" If the clock exists, it is the common network reference clock available to PE1 and PE2.",
      "ja": "クロックが存在する場合は、「私は」、それはPE1とPE2に利用できる一般的なネットワークの基準クロックです。"
    },
    {
      "indent": 3,
      "text": "\"J\" Clock used by PE1 to transmit the TDM attachment service circuit to CE1 (the recovered clock).",
      "ja": "CE1（再生クロック）にTDM取付サービス回路を送信するためにPE1によって使用される、「J」時計。"
    },
    {
      "indent": 3,
      "text": "\"K\" Clock recovered by CE1 from the incoming TDM attachment service (\"J\" and \"K\" have the same frequency).",
      "ja": "着信TDM取付サービスからCE1により回収「K」クロック（「J」と「K」は、同一の周波数を有します）。"
    },
    {
      "indent": 3,
      "text": "\"L\" If it exists, it is the common reference clock of CE1 and CE2. Note that different pairs of CE devices may use different common reference clocks.",
      "ja": "それが存在する場合、「L」は、それがCE1とCE2の共通の基準クロックです。 CEデバイスの異なる対が異なる共通の基準クロックを使用してもよいことに留意されたいです。"
    },
    {
      "indent": 3,
      "text": "A requirement of edge-to-edge emulation of a TDM circuit is that clock \"B\" and \"E\", as well as clock \"H\" and \"J\", are of the same frequency. The most appropriate method will depend on the network synchronization scheme.",
      "ja": "TDM回路のエッジツーエッジエミュレーションの要件は、クロック「B」と「E」、並びにクロック「H」と「J」は、同じ周波数であることです。最も適切な方法は、ネットワーク同期方式に依存します。"
    },
    {
      "indent": 3,
      "text": "The following groups of synchronization scenarios can be considered:",
      "ja": "同期シナリオの次のグループが考えられます。"
    },
    {
      "indent": 0,
      "text": "4.3.1. Synchronous Network Scenarios",
      "section_title": true,
      "ja": "4.3.1。同期ネットワークのシナリオ"
    },
    {
      "indent": 3,
      "text": "Depending on which part of the network is synchronized by a common clock, there are two scenarios:",
      "ja": "これは共通のクロックによって同期されたネットワークの一部に応じて、2つのシナリオがあります。"
    },
    {
      "indent": 3,
      "text": "o PE Synchronized Network:",
      "ja": "PE同期ネットワークO："
    },
    {
      "indent": 6,
      "text": "Figure 2 is an adapted version of the generic network reference model, and presents the PE synchronized network scenario.",
      "ja": "図2は、一般的なネットワーク参照モデルの適合バージョンであり、そしてPE同期ネットワークシナリオを示します。"
    },
    {
      "indent": 6,
      "text": "The common network reference clock \"I\" is available to all the PE devices, and local oscillators \"C\" and \"D\" are locked to \"I\":",
      "ja": "一般的なネットワーク基準クロック「I」のすべてのPEデバイスに利用可能であり、局部発振器「C」および「D」は「I」にロックされています。"
    },
    {
      "indent": 6,
      "text": "* Clocks \"E\" and \"J\" are the same as \"D\" and \"C\", respectively.",
      "ja": "*クロック「E」および「J」は、それぞれ、「D」および「C」と同じです。"
    },
    {
      "indent": 6,
      "text": "* Clocks \"A\" and \"G\" are the same as \"K\" and \"F\", respectively (i.e., CE1 and CE2 use loop timing).",
      "ja": "*時計「A」および「G」（すなわち、CE1及びCE2は、ループタイミングを使用する）は、それぞれ、「K」と「F」と同じです。"
    },
    {
      "indent": 6,
      "text": "                 +-----+                 +-----+\n+-----+    |     |- - -|=================|- - -|     |    +-----+\n| /-- |<---------|............PW1..............|<---------| <-\\ |\n|| CE |    |     | PE1 |                 | PE2 |     |    |CE2 ||\n| \\-> |--------->|............PW2..............|--------->| --/ |\n+-----+    |     |- - -|=================|- - -|     |    +-----+\n                 +-----+                 +-----+\n                    ^                       ^\n                    |C                      |D\n                    +-----------+-----------+\n                                |\n                               +-+\n                               |I|\n                               +-+",
      "raw": true
    },
    {
      "indent": 21,
      "text": "Figure 2: PE Synchronized Scenario",
      "ja": "図2：PE同期シナリオ"
    },
    {
      "indent": 3,
      "text": "o CE Synchronized Network:",
      "ja": "CE同期ネットワークO："
    },
    {
      "indent": 6,
      "text": "Figure 3 is an adapted version of the generic network reference model, and presents the CE synchronized network scenario.",
      "ja": "図3は、一般的なネットワーク参照モデルの適合バージョンであり、及びCE同期ネットワークシナリオを示します。"
    },
    {
      "indent": 6,
      "text": "The common network reference clock \"L\" is available to all the CE devices, and local oscillators \"A\" and \"G\" are locked to \"L\":",
      "ja": "一般的なネットワーク基準クロック「L」は、すべてのCEデバイスが利用可能であり、局部発振器「A」及び「G」「L」にロックされています。"
    },
    {
      "indent": 6,
      "text": "* Clocks \"E\" and \"J\" are the same as \"G\" and \"A\", respectively (i.e., PE1 and PE2 use loop timing).",
      "ja": "*クロック「E」および「J」は、それぞれ「G」および「A」（すなわち、PE1とPE2使用ループタイミング）と同じです。"
    },
    {
      "indent": 6,
      "text": "                 +-----+                 +-----+\n+-----+    |     |- - -|=================|- - -|     |    +-----+\n|     |<---------|............PW1..............|<---------|     |\n| CE1 |    |     | PE1 |                 | PE2 |     |    | CE2 |\n|     |--------->|............PW2..............|--------->|     |\n+-----+    |     |- - -|=================|- - -|     |    +-----+\n  ^              +-----+                 +-----+              ^\n  |A                                                         G|\n  +----------------------------+------------------------------+\n                               |\n                              +-+\n                              |L|\n                              +-+",
      "raw": true
    },
    {
      "indent": 21,
      "text": "Figure 3: CE Synchronized Scenario",
      "ja": "図3：CE同期シナリオ"
    },
    {
      "indent": 3,
      "text": "No timing information has to be transferred in these cases.",
      "ja": "いかなるタイミング情報は、これらのケースで転送する必要がありません。"
    },
    {
      "indent": 0,
      "text": "4.3.2. Relative Network Scenario",
      "section_title": true,
      "ja": "4.3.2。相対的なネットワークシナリオ"
    },
    {
      "indent": 3,
      "text": "In this case, each CE uses its own transmission clock source that must be carried across the PSN and recovered by the remote PE, respectively. The common PE clock \"I\" can be used as reference for this purpose.",
      "ja": "この場合、各CEは、それぞれ、リモートPEによってPSNを横切って運ばれ、回収されなければならない自身の送信クロック・ソースを使用します。共通PEクロックが「I」はこの目的のために参照として使用することができます。"
    },
    {
      "indent": 3,
      "text": "Figure 4 shows the relative network scenario.",
      "ja": "図4は、相対的なネットワークシナリオを示します。"
    },
    {
      "indent": 3,
      "text": "The common network reference clock \"I\" is available to all the PE devices, and local oscillators \"C\" and \"D\" are locked to \"I\":",
      "ja": "一般的なネットワーク基準クロック「I」のすべてのPEデバイスに利用可能であり、局部発振器「C」および「D」は「I」にロックされています。"
    },
    {
      "indent": 3,
      "text": "o Clocks \"A\" and \"G\" are generated locally without reference to a common clock.",
      "ja": "Oクロック「A」および「G」は、共通クロックを参照することなく局所的に生成されます。"
    },
    {
      "indent": 3,
      "text": "o Clocks \"E\" and \"J\" are generated in reference to a common clock available at all PE devices.",
      "ja": "Oクロック「E」および「J」は、PEデバイスで利用可能なすべての共通のクロックを参照して生成されます。"
    },
    {
      "indent": 3,
      "text": "In a slight modification of this scenario, one (but not both!) of the CE devices may use its receive clock as its transmission clock (i.e., use loop timing).",
      "ja": "このシナリオのわずかな変形、いずれかで（両方ではない！）CEデバイスの（すなわち、ループのタイミングを使用して）その送信クロックとしての受信クロックを使用することができます。"
    },
    {
      "indent": 3,
      "text": "                                                           |G\n                 +-----+                 +-----+           v\n+-----+    |     |- - -|=================|- - -|     |    +-----+\n|     |<---------|............PW1..............|<---------|     |\n| CE1 |    |     | PE1 |                 | PE2 |     |    | CE2 |\n|     |--------->|............PW2..............|--------->|     |\n+-----+    |     |- - -|=================|- - -|     |    +-----+\n     ^           +-----+<-------+------->+-----+\n     |A                         |\n                               +-+\n                               |I|\n                               +-+",
      "raw": true
    },
    {
      "indent": 13,
      "text": "Figure 4: Relative Network Scenario Timing",
      "ja": "図4：相対ネットワークシナリオのタイミング"
    },
    {
      "indent": 3,
      "text": "In this case, timing information (the difference between the common reference clock \"I\" and the incoming clock \"A\") MUST be explicitly transferred from the ingress PE to the egress PE.",
      "ja": "この場合、タイミング情報（共通基準クロック「I」と入力クロック「A」との間の差）は、明示的に出口PEへの入口PEから転送されなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.3.3. Adaptive Network Scenario",
      "section_title": true,
      "ja": "4.3.3。アダプティブ・ネットワークのシナリオ"
    },
    {
      "indent": 3,
      "text": "The adaptive scenario is characterized by:",
      "ja": "適応シナリオはことを特徴としています。"
    },
    {
      "indent": 3,
      "text": "o No common network reference clock \"I\" is available to PE1 and PE2.",
      "ja": "Oいいえ一般的なネットワーク基準クロックが「I」はPE1とPE2に利用可能ではありません。"
    },
    {
      "indent": 3,
      "text": "o No common reference clock \"L\" is available to CE1 and CE2.",
      "ja": "O共通の基準クロック「L」はCE1とCE2に利用可能ではありません。"
    },
    {
      "indent": 3,
      "text": "Figure 5 presents the adaptive network scenario.",
      "ja": "図5は、適応ネットワークシナリオを提示します。"
    },
    {
      "indent": 3,
      "text": "                  |J                                       |G\n                  v                                        |\n                 +-----+                 +-----+           v\n+-----+    |     |- - -|=================|- - -|     |    +-----+\n|     |<---------|............PW1..............|<---------|     |\n| CE1 |    |     | PE1 |                 | PE2 |     |    | CE2 |\n|     |--------->|............PW2..............|--------->|     |\n+-----+    |     |- - -|=================|- - -|     |    +-----+\n     ^           +-----+                 +-----+\n     |                                        ^\n    A|                                       E|",
      "raw": true
    },
    {
      "indent": 21,
      "text": "Figure 5: Adaptive Scenario",
      "ja": "図5：適応シナリオ"
    },
    {
      "indent": 3,
      "text": "Synchronizing clocks \"A\" and \"E\" in this scenario is more difficult than it is in the other scenarios.",
      "ja": "このシナリオでは、クロック「A」と「E」を同期すると、それは他のシナリオであるよりも、より困難です。"
    },
    {
      "indent": 3,
      "text": "Note that the tolerance between clocks \"A\" and \"E\" must be small enough to ensure that the jitter buffer does not overflow or underflow.",
      "ja": "クロック「A」と「E」との間の公差は、ジッタバッファがオーバーフローまたはアンダーフローしないように十分に小さくなければならないことに留意されたいです。"
    },
    {
      "indent": 3,
      "text": "In this case, timing information MAY be explicitly transferred from the ingress PE to the egress PE, e.g., by RTP.",
      "ja": "この場合、タイミング情報は、明示的にRTPによって、例えば、出口PEへの入口PEから転送されてもよいです。"
    },
    {
      "indent": 0,
      "text": "5. Emulated Services",
      "section_title": true,
      "ja": "5.エミュレートサービス"
    },
    {
      "indent": 3,
      "text": "This section defines requirements for the payload and encapsulation layers for edge-to-edge emulation of TDM services with bit-stream payload as well as structured bit-stream payload.",
      "ja": "このセクションでは、ビットストリーム・ペイロードとTDMサービスのエッジツーエッジエミュレーションならびに構造化ビットストリームペイロードのペイロードとカプセル化層のための要件を定義します。"
    },
    {
      "indent": 3,
      "text": "Wherever possible, the requirements specified in this document SHOULD be satisfied by appropriate arrangements of the encapsulation layer only. The (rare) cases when the requirements apply to both the encapsulation and payload layers (or even to the payload layer only) will be explicitly noted.",
      "ja": "可能な限り、この文書で指定された要件のみを封入層の適切な取り決めが満たすべき。 （まれな）ケース要件は（あるいはのみペイロード層に）の両方のカプセル化およびペイロード層に適用される場合、明示的に留意されたいです。"
    },
    {
      "indent": 3,
      "text": "The service-specific encapsulation layer for edge-to-edge emulation comprises the following services over a PSN.",
      "ja": "エッジツーエッジエミュレーションのためのサービス固有の封止層は、PSN上に以下のサービスを含みます。"
    },
    {
      "indent": 0,
      "text": "5.1. Structure-Agnostic Transport of Signals out of the PDH Hierarchy",
      "section_title": true,
      "ja": "5.1。 PDH階層のうち信号の構造不可知論者輸送"
    },
    {
      "indent": 3,
      "text": "Structure-agnostic transport is considered for the following signals:",
      "ja": "構造に依存しない交通機関は、次の信号のために考えられています。"
    },
    {
      "indent": 3,
      "text": "o E1 as described in [G.704].",
      "ja": "O [G.704]で説明されるようにE1。"
    },
    {
      "indent": 3,
      "text": "o T1 (DS1) as described in [G.704].",
      "ja": "T1（DS1）O [G.704]で説明されるように。"
    },
    {
      "indent": 3,
      "text": "o E3 as defined in [G.751].",
      "ja": "E3 O [G.751]で定義されます。"
    },
    {
      "indent": 3,
      "text": "o T3 (DS3) as described in [T1.107].",
      "ja": "T3（DS3）O [T1.107]に記載されているように。"
    },
    {
      "indent": 0,
      "text": "5.2. Structure-Aware Transport of Signals out of the PDH Hierarchy",
      "section_title": true,
      "ja": "5.2。 PDH階層のうち信号の構造を意識交通"
    },
    {
      "indent": 3,
      "text": "Structure-aware transport is considered for the following signals:",
      "ja": "構造を意識した輸送は以下の信号のために考えられています。"
    },
    {
      "indent": 3,
      "text": "o E1/T1 with one of the structures imposed by framing as described in [G.704].",
      "ja": "[G.704]で説明されるようにフレーミングによって課される構造のうちの1つとO E1 / T1。"
    },
    {
      "indent": 3,
      "text": "o NxDS0 with or without CAS.",
      "ja": "O CASの有無にかかわらずのNxDS0。"
    },
    {
      "indent": 0,
      "text": "5.3. Structure-Aware Transport of SONET/SDH Circuits",
      "section_title": true,
      "ja": "5.3。 SONET / SDH回線の構造を意識交通"
    },
    {
      "indent": 3,
      "text": "Structure-aware transport is considered for the following SONET/SDH circuits:",
      "ja": "構造を意識したトランスポートは、次のSONET / SDH回線のために考えられています。"
    },
    {
      "indent": 3,
      "text": "o SONET STS-1 synchronous payload envelope (SPE)/SDH VC-3.",
      "ja": "SONET STS-1同期ペイロード・エンベロープ（SPE）O / SDH VC-3。"
    },
    {
      "indent": 3,
      "text": "o SONET STS-Nc SPE (N = 3, 12, 48, 192) / SDH VC-4, VC-4-4c, VC-4-16c, VC-4-64c.",
      "ja": "SONET STS-NC SPE（N = 3、12、48、192）/ SDH VC-4、VC-4-4C、VC-4-16c、VC-4-64c。"
    },
    {
      "indent": 3,
      "text": "o SONET VT-N (N = 1.5, 2, 3, 6) / SDH VC-11, VC-12, VC-2.",
      "ja": "SONET VT-N（C = 1.5、2、3、6）/ SDH VC-11、VC-12、VC-2。"
    },
    {
      "indent": 3,
      "text": "o SONET Nx VT-N / SDH Nx VC-11/VC-12/VC-2/VC-3.",
      "ja": "NX SONET VT-N / NX SDH VC-11 / VC-12 / VC-2 / VC-3。"
    },
    {
      "indent": 3,
      "text": "Note: There is no requirement for the structure-agnostic transport of SONET/SDH. For this case, it would seem that structure must be taken into account.",
      "ja": "注意：SONET / SDHの構造不可知論者輸送のための要件はありません。このような場合のために、その構造が考慮されなければならないと思われます。"
    },
    {
      "indent": 0,
      "text": "6. Generic Requirements",
      "section_title": true,
      "ja": "6.汎用要件"
    },
    {
      "indent": 0,
      "text": "6.1. Relevant Common PW Requirements",
      "section_title": true,
      "ja": "6.1。関連共通PWの要件"
    },
    {
      "indent": 3,
      "text": "The encapsulation and payload layers MUST conform to the common PW requirements defined in [RFC3916]:",
      "ja": "カプセル化およびペイロード層は[RFC3916]で定義された一般的なPWの要件に準拠しなければなりません。"
    },
    {
      "indent": 3,
      "text": "1. Conveyance of Necessary Header Information:",
      "section_title": true,
      "ja": "必要なヘッダ情報の1搬送："
    },
    {
      "indent": 7,
      "text": "A.  For structure-agnostic transport, this functionality MAY be\n    provided by the payload layer.",
      "raw": true
    },
    {
      "indent": 7,
      "text": "B. For structure-aware transport, the necessary information MUST be provided by the encapsulation layer.",
      "ja": "構造認識輸送のためのB.、必要な情報は、カプセル化層によって提供されなければなりません。"
    },
    {
      "indent": 7,
      "text": "C. Structure-aware transport of SONET/SDH circuits MUST preserve path overhead information as part of the payload. Relevant components of the transport overhead MAY be carried in the encapsulation layer.",
      "ja": "SONET / SDH回線のC.構造認識輸送は、ペイロードの一部としてパスオーバーヘッド情報を保存しなければなりません。トランスポートオーバーヘッドの関連コンポーネントは、カプセル化層で行ってもよいです。"
    },
    {
      "indent": 3,
      "text": "2. Support of Multiplexing and Demultiplexing if supported by the native services. This is relevant for Nx DS0 circuits (with or without signaling) and Nx VT-x in a single STS-1 SPE or VC-4.:",
      "ja": "多重・分離の2のサポートネイティブサービスでサポートされている場合。これは、単一のSTS-1 SPE又はVC-4（とまたはシグナリングなし）NxのDS0回路に関連するおよびNX VT-xは.:"
    },
    {
      "indent": 7,
      "text": "A.  For these circuits, the combination of encapsulation and\n    payload layers MUST provide for separate treatment of every\n    sub-circuit.",
      "raw": true
    },
    {
      "indent": 7,
      "text": "B. Enough information SHOULD be provided by the pseudo wire to allow multiplexing and demultiplexing by the NSP. Reduction of the complexity of the PW emulation by using NSP circuitry for multiplexing and demultiplexing MAY be the preferred solution.",
      "ja": "B.十分な情報がNSPによって多重化および逆多重化を可能にするために、擬似ワイヤによって提供されるべきです。多重・分離のためのNSP回路を使用してPWエミュレーションの複雑さの軽減が好ましい溶液であってもよいです。"
    },
    {
      "indent": 3,
      "text": "3. Intervention or transparent transfer of Maintenance Messages of the Native Services, depending on the particular scenario.",
      "ja": "3.介入または特定のシナリオに応じてネイティブサービスの保守メッセージの透過転送。"
    },
    {
      "indent": 3,
      "text": "4. Consideration of Per-PSN Packet Overhead (see also Section 7.5 below).",
      "ja": "単位のPSNパケットオーバーヘッドの4検討（セクションも下記7.5参照）。"
    },
    {
      "indent": 3,
      "text": "5. Detection and handling of PW faults. The list of faults is given in Section 7.9 below.",
      "ja": "5.検出とPW障害の取り扱い。障害のリストは以下のセクション7.9に記載されています。"
    },
    {
      "indent": 3,
      "text": "Fragmentation indications MAY be used for structure-aware transport when the structures in question either exceed desired packetization delay or exceed Path MTU between the pair of PEs.",
      "ja": "当該構造は、所望のパケット化遅延を超えるまたはPEの対の間のパスMTUを超えた場合のいずれかの断片化指標は、構造認識輸送のために使用されるかもしれません。"
    },
    {
      "indent": 3,
      "text": "The following requirement listed in [RFC3916] is not applicable to emulation of TDM services:",
      "ja": "[RFC3916]に記載されている次の要件は、TDMサービスのエミュレーションには適用されません。"
    },
    {
      "indent": 3,
      "text": "o Support of variable length PDUs.",
      "ja": "可変長のPDUのOサポート。"
    },
    {
      "indent": 0,
      "text": "6.2. Common Circuit Payload Requirements",
      "section_title": true,
      "ja": "6.2。共通の回路ペイロード要件"
    },
    {
      "indent": 3,
      "text": "Structure-agnostic transport treats TDM circuits as belonging to the 'Bit-stream' payload type defined in [RFC3985].",
      "ja": "[RFC3985]で定義された「ビットストリーム」ペイロード・タイプに属するような構造に依存しないトランスポート扱いTDM回路。"
    },
    {
      "indent": 3,
      "text": "Structure-aware transport treats these circuits as belonging to the \"Structured bit-stream\" payload type defined in [RFC3985].",
      "ja": "構造認識輸送は[RFC3985]で定義された「構造化ビットストリーム」ペイロードタイプに属するものとして、これらの回路を扱います。"
    },
    {
      "indent": 3,
      "text": "Accordingly, the encapsulation layer MUST provide the common Sequencing service and SHOULD provide Timing information (Synchronization services) when required (see Section 4.3 above).",
      "ja": "したがって、カプセル化層は、一般的なシーケンシングサービスを提供しなければならないし、（上記セクション4.3を参照）必要なときにタイミング情報（同期サービス）を提供する必要があります。"
    },
    {
      "indent": 3,
      "text": "Note: Length service MAY be provided by the encapsulation layer, but is not required.",
      "ja": "注意：長さサービスは、カプセル化層によって提供されてもよいが、必須ではありません。"
    },
    {
      "indent": 0,
      "text": "6.3. General Design Issues",
      "section_title": true,
      "ja": "6.3。一般的な設計上の問題"
    },
    {
      "indent": 3,
      "text": "The combination of payload and encapsulation layers SHOULD comply with the general design principles of the Internet protocols as presented in Section 3 of [RFC1958] and [RFC3985].",
      "ja": "[RFC1958]及び[RFC3985]のセクション3に示すように、ペイロード及び封入層の組み合わせは、インターネットプロトコルの一般的な設計原理に適合しなければなりません。"
    },
    {
      "indent": 3,
      "text": "If necessary, the payload layer MAY use some forms of adaptation of the native TDM payload in order to achieve specific, well-documented design objectives. In these cases, standard adaptation techniques SHOULD be used.",
      "ja": "必要であれば、ペイロード層は、特定の、十分に文書化設計目標を達成するために、ネイティブのTDMペイロードの適応のいくつかの形態を使用するかもしれません。これらのケースでは、標準適応技術を使用する必要があります。"
    },
    {
      "indent": 0,
      "text": "7. Service-Specific Requirements",
      "section_title": true,
      "ja": "7.サービス固有の要件"
    },
    {
      "indent": 0,
      "text": "7.1. Connectivity",
      "section_title": true,
      "ja": "7.1。接続性"
    },
    {
      "indent": 3,
      "text": "1. The emulation MUST support the transport of signals between Attachment Circuits (ACs) of the same type (see Section 5) and, wherever appropriate, bit-rate.",
      "ja": "1.エミュレーションは、同じタイプの接続回線（ACS）との間の信号の転送をサポートしなければならない限り、適切な、ビットレート、（セクション5を参照）。"
    },
    {
      "indent": 3,
      "text": "2. The encapsulation layer SHOULD remain unaffected by specific characteristics of connection between the ACs and PE devices at the two ends of the PW.",
      "ja": "前記封止層は、PWの両端ACSとPEデバイス間の接続の特定の特性によって影響を受けないままであるべきです。"
    },
    {
      "indent": 0,
      "text": "7.2. Network Synchronization",
      "section_title": true,
      "ja": "7.2。ネットワーク同期"
    },
    {
      "indent": 3,
      "text": "1. The encapsulation layer MUST provide synchronization services that are sufficient to:",
      "ja": "1.カプセル化層は十分にある同期サービスを提供する必要があります。"
    },
    {
      "indent": 7,
      "text": "A.  match the ingress and egress end service clocks regardless of\n    the specific network synchronization scenario, and",
      "raw": true
    },
    {
      "indent": 7,
      "text": "B. keep the jitter and wander of the egress service clock within the service-specific limits defined by the appropriate normative references.",
      "ja": "B.適切な引用規格によって定義されたサービス固有の限界内に出力サービス・クロックのジッタとワンダーを保ちます。"
    },
    {
      "indent": 3,
      "text": "2. If the same high-quality synchronization source is available to all the PE devices in the given domain, the encapsulation layer SHOULD be able to make use of it (e.g., for better reconstruction of the native service clock).",
      "ja": "同じ高品質の同期ソースは、特定のドメイン内のすべてのPEデバイスに利用可能である2.場合、封入層は、（ネイティブサービスクロックのより良好な再構成のために、例えば）それを利用することができるべきです。"
    },
    {
      "indent": 0,
      "text": "7.3. Robustness",
      "section_title": true,
      "ja": "7.3。丈夫"
    },
    {
      "indent": 3,
      "text": "The robustness of the emulated service depends not only upon the edge-to-edge emulation protocol, but also upon proper implementation of the following procedures.",
      "ja": "エミュレートされたサービスのロバスト性は、エッジツーエッジエミュレーションプロトコルにだけでなく、次の手順の適切な実装に依存するだけでなく。"
    },
    {
      "indent": 0,
      "text": "7.3.1. Packet loss",
      "section_title": true,
      "ja": "7.3.1。パケットロス"
    },
    {
      "indent": 3,
      "text": "Edge-to-edge emulation of TDM circuits MAY assume very low probability of packet loss between ingress and egress PE. In particular, no retransmission mechanisms are required.",
      "ja": "TDM回線のエッジツーエッジエミュレーションは、入力および出力PE間のパケット損失の非常に低い確率をとることができます。具体的には、再送機構が必要とされません。"
    },
    {
      "indent": 3,
      "text": "In order to minimize the effect of lost packets on the egress service, the encapsulation layer SHOULD:",
      "ja": "出力サービス上の失われたパケットの影響を最小限にするために、封入層必要があります。"
    },
    {
      "indent": 3,
      "text": "1. Enable independent interpretation of TDM data in each packet by the egress PE (see [RFC2736]). This requirement MAY be disregarded if the egress PE needs to interpret structures that exceed the path MTU between the ingress and egress PEs.",
      "ja": "1.（[RFC2736]を参照）出口PEによって各パケットにTDMデータの独立した解釈を有効にします。出口PEは、入力および出力PE間の経路MTUを超えた構造を解釈する必要がある場合、この要件は無視されるかもしれません。"
    },
    {
      "indent": 3,
      "text": "2. Allow reliable detection of lost packets (see next section). In particular, it SHOULD allow estimation of the arrival time of the next packet and detection of lost packets based on this estimate.",
      "ja": "2.失われたパケット（次のセクションを参照）を確実に検出できるようにします。特に、次のパケットの到着時間の推定と、この推定値に基づいて失われたパケットの検出を可能にしなければなりません。"
    },
    {
      "indent": 3,
      "text": "3. Minimize possible effect of lost packets on recovery of the circuit clock by the egress PE.",
      "ja": "3.出力PEにより回路クロックの回復に失われたパケットの影響の可能性を最小限に抑えます。"
    },
    {
      "indent": 3,
      "text": "4. Increase the resilience of the CE TDM interface to packet loss by allowing the egress PE to substitute appropriate data.",
      "ja": "4.出口PEが適切なデータを代入できるようにすることで、パケット損失にCEのTDMインタフェースの回復力を向上。"
    },
    {
      "indent": 0,
      "text": "7.3.2. Out-of-order delivery",
      "section_title": true,
      "ja": "7.3.2。アウトオブオーダー配信"
    },
    {
      "indent": 3,
      "text": "The encapsulation layer MUST provide the necessary mechanisms to guarantee ordered delivery of packets carrying the TDM data over the PSN. Packets that have arrived out-of-order:",
      "ja": "封入層は、PSN上TDMデータを運ぶパケットの順序付けられた配信を保証するために必要なメカニズムを提供しなければなりません。アウトオブオーダー到着したパケット："
    },
    {
      "indent": 3,
      "text": "1. MUST be detected, and",
      "section_title": true,
      "ja": "1.検出されなければならない、そして"
    },
    {
      "indent": 3,
      "text": "2. SHOULD be reordered if not judged to be too late or too early for playout.",
      "ja": "あまりにも早く再生のために遅すぎると判断されたりされていない場合2.並べ替えられるべきです。"
    },
    {
      "indent": 3,
      "text": "Out-of-order packets that cannot be reordered MUST be treated as lost.",
      "ja": "失われたとして並べ替えることができないアウトオブオーダーパケットが扱わなければなりません。"
    },
    {
      "indent": 0,
      "text": "7.4. CE Signaling",
      "section_title": true,
      "ja": "7.4。 ECシグナリング"
    },
    {
      "indent": 3,
      "text": "Unstructured TDM circuits would not usually require any special mechanism for carrying CE signaling as this would be carried as part of the emulated service.",
      "ja": "これはエミュレートサービスの一環として実施されるように構造化されていないTDM回路は、通常、CEシグナリングを搬送するための任意の特別な機構を必要としません。"
    },
    {
      "indent": 3,
      "text": "Some CE applications using structured TDM circuits (e.g., telephony) require specific signaling that conveys the changes of state of these applications relative to the TDM data.",
      "ja": "構造化されたTDM回線（例えば、電話）を使用して、いくつかのCEアプリケーションは、TDMデータに対して、これらのアプリケーションの状態の変更を伝える特定のシグナリングを必要とします。"
    },
    {
      "indent": 3,
      "text": "The encapsulation layer SHOULD support signaling of state of CE applications for the relevant circuits providing for:",
      "ja": "封入層は、を提供する関連する回路のCEアプリケーションの状態のシグナリングをサポートする必要があります。"
    },
    {
      "indent": 3,
      "text": "1. Ability to support different signaling schemes with minimal impact on encapsulation of TDM data,",
      "ja": "TDMデータのカプセル化への影響を最小限に抑えながら、異なるシグナリング方式をサポートする1​​機能、"
    },
    {
      "indent": 3,
      "text": "2. Multiplexing of application-specific CE signals and data of the emulated service in the same PW,",
      "ja": "2.同じPWにアプリケーション固有CE信号およびエミュレートサービスのデータの多重化、"
    },
    {
      "indent": 3,
      "text": "3. Synchronization (within the application-specific tolerance limits) between CE signals and data at the PW egress,",
      "ja": "同期PW出口におけるCE信号とデータとの間の（アプリケーション固有の許容限度内で）3."
    },
    {
      "indent": 3,
      "text": "4. Probabilistic recovery against possible, occasional loss of packets in the PSN, and",
      "ja": "PSNでのパケットの可能性、時折損失に対する4.確率的回復、および"
    },
    {
      "indent": 3,
      "text": "5. Deterministic recovery of the CE application state after PW setup and network outages.",
      "ja": "PWのセットアップとネットワークの停止後のCEアプリケーション状態の5確定的回復。"
    },
    {
      "indent": 3,
      "text": "CE signaling that is used for maintenance purposes (loopback commands, performance monitoring data retrieval, etc.) SHOULD use the generic PWE3 maintenance protocol.",
      "ja": "（等ループバックコマンド、性能監視データの取得）保守目的のために使用されるCEシグナルは、一般的なPWE3メンテナンスプロトコルを使用すべきです。"
    },
    {
      "indent": 0,
      "text": "7.5. PSN Bandwidth Utilization",
      "section_title": true,
      "ja": "7.5。 PSN帯域幅使用率"
    },
    {
      "indent": 3,
      "text": "1. The encapsulation layer SHOULD allow for an effective trade-off between the following requirements:",
      "ja": "1封入層は、次の要件との間の効果的なトレードオフを可能にすべきです。"
    },
    {
      "indent": 7,
      "text": "A.  Effective PSN bandwidth utilization.  Assuming that the size\n    of the encapsulation layer header does not depend on the size\n    of its payload, an increase in the packet payload size\n    results in increased efficiency.",
      "raw": true
    },
    {
      "indent": 7,
      "text": "B. Low edge-to-edge latency. Low end-to-end latency is the common requirement for Voice applications over TDM services. Packetization latency is one of the components comprising edge-to-edge latency, and it decreases with the packet payload size.",
      "ja": "B.低端から端までの待ち時間。ローエンドツーエンドの待ち時間は、TDMサービス上で音声アプリケーション用の一般的な要件です。パケット待ち時間は端から端までの待ち時間を含む成分の一つであり、パケットペイロードサイズと共に減少します。"
    },
    {
      "indent": 7,
      "text": "The compensation buffer used by the CE-bound IWF increases latency to the emulated circuit. Additional delays introduced by this buffer SHOULD NOT exceed the packet delay variation observed in the PSN.",
      "ja": "CE-結合IWFによって使用される補償バッファは、エミュレートされた回路に待ち時間を増加させます。このバッファにより導入された追加の遅延はPSNで観察されたパケット遅延変動を超えないようにしてください。"
    },
    {
      "indent": 3,
      "text": "2. The encapsulation layer MAY provide for saving PSN bandwidth by not sending corrupted TDM data across the PSN.",
      "ja": "2.カプセル化層は、PSNの向こう破損したTDMデータを送信しないことにより、PSN帯域幅を節約を提供することができます。"
    },
    {
      "indent": 3,
      "text": "3. The encapsulation layer MAY provide the ability to save the PSN bandwidth for the structure-aware case by not sending channels that are permanently inactive.",
      "ja": "3.カプセル化層は、恒久的に非アクティブなチャネルを送信しないことにより、構造を意識した場合のPSN帯域幅を節約する能力を提供することができます。"
    },
    {
      "indent": 3,
      "text": "4. The encapsulation layer MAY enable the dynamic suppression of temporarily unused channels from transmission for the structure-aware case.",
      "ja": "前記封入層が構造認識場合の送信から、一時的に未使用チャネルの動的な抑制を可能にすることができます。"
    },
    {
      "indent": 7,
      "text": "If used, dynamic suppression of temporarily unused channels\nMUST NOT violate the integrity of the structures delivered over\nthe PW.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "5. For NxDS0, the encapsulation layer MUST provide the ability to keep the edge-to-edge delay independent of the service rate.",
      "ja": "5.のNxDS0の場合、封入層は、サービス率の独立端から端までの遅延を維持する能力を提供しなければなりません。"
    },
    {
      "indent": 0,
      "text": "7.6. Packet Delay Variation",
      "section_title": true,
      "ja": "7.6。パケット遅延変動"
    },
    {
      "indent": 3,
      "text": "The encapsulation layer SHOULD provide for the ability to compensate for packet delay variation, while maintaining jitter and wander of the egress end service clock with tolerances specified in the normative references.",
      "ja": "引用規格で指定された公差を有する出口端サービスクロックのジッタとワンダーを維持しながら、カプセル化層は、パケット遅延変動を補償する能力を提供すべきです。"
    },
    {
      "indent": 3,
      "text": "The encapsulation layer MAY provide for run-time adaptation of delay introduced by the jitter buffer if the packet delay variation varies with time. Such an adaptation MAY introduce a low level of errors (within the limits tolerated by the application) but SHOULD NOT introduce additional wander of the egress end service clock.",
      "ja": "パケット遅延変動が時間とともに変化する場合の封止層は、ジッタバッファによって導入される遅延のランタイム適応を提供することができます。そのような適応は、（アプリケーションによって許容限界内）エラーの低レベルを導入することができるが、出口エンドサービスクロックの追加ワンダーを導入するべきではありません。"
    },
    {
      "indent": 0,
      "text": "7.7. Compatibility with the Existing PSN Infrastructure",
      "section_title": true,
      "ja": "7.7。既存のPSNインフラストラクチャとの互換性"
    },
    {
      "indent": 3,
      "text": "The combination of encapsulation and PSN tunnel layers used for edge-to-edge emulation of TDM circuits SHOULD be compatible with existing PSN infrastructures. In particular, compatibility with the mechanisms of header compression over links where capacity is at a premium SHOULD be provided.",
      "ja": "TDM回線のエッジツーエッジエミュレーションに使用されるカプセル化とPSNトンネル層の組み合わせは、既存のPSNインフラストラクチャと互換性があるべきです。具体的には、容量が限られているリンク上でヘッダ圧縮のメカニズムと互換性が提供されるべきです。"
    },
    {
      "indent": 0,
      "text": "7.8. Congestion Control",
      "section_title": true,
      "ja": "7.8。輻輳制御"
    },
    {
      "indent": 3,
      "text": "TDM circuits run at a constant rate, and hence offer constant traffic loads to the PSN. The rate varying mechanism that TCP uses to match the demand to the network congestion state is, therefore, not applicable.",
      "ja": "TDM回路は、一定の速度で実行し、ひいてはPSNに一定のトラフィックの負荷を提供します。 TCPは、ネットワークの輻輳状態に需要を一致させるために使用率可変機構はそのため、適用できない、です。"
    },
    {
      "indent": 3,
      "text": "The ability to shut down a TDM PW when congestion has been detected MUST be provided.",
      "ja": "輻輳が検出された場合にTDM PWをシャットダウンする能力を提供しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Precautions should be taken to avoid situations wherein multiple TDM PWs are simultaneously shut down or re-established, because this leads to PSN instability.",
      "ja": "これはPSNの不安定につながるので注意事項は、複数のTDM PWをを同時にシャットダウンされているか再確立を特徴事態を避けるために注意しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Further congestion considerations are discussed in chapter 6.5 of [RFC3985].",
      "ja": "さらに輻輳考察は[RFC3985]の章6.5に記載されています。"
    },
    {
      "indent": 0,
      "text": "7.9. Fault Detection and Handling",
      "section_title": true,
      "ja": "7.9。検出と処理を障害"
    },
    {
      "indent": 3,
      "text": "The encapsulation layer for edge-to-edge emulation of TDM services SHOULD, separately or in conjunction with the lower layers of the PWE3 stack, provide for detection, handling, and reporting of the following defects:",
      "ja": "TDMサービスのエッジツーエッジエミュレーションのための封止層は、別々に又はPWE3スタックの下位層に関連して、検出、処理、および以下の欠陥の報告を提供すべきです。"
    },
    {
      "indent": 3,
      "text": "1. Misconnection, or Stray Packets. The importance of this requirement stems from customer expectation due to reliable misconnection detection in SONET/SDH networks.",
      "ja": "1.の接続ミス、またはストレイパケット。この要件の重要性が原因SONET / SDHネットワークにおける信頼性の誤検出に顧客の期待に由来します。"
    },
    {
      "indent": 3,
      "text": "2. Packet Loss. Packet loss detection is required to maintain clock integrity, as discussed in Section 7.3.1 above. In addition, packet loss detection mechanisms SHOULD provide for localization of the outage in the end-to-end emulated service.",
      "ja": "2.パケットロス。上記セクション7.3.1で説明したようにパケット損失検出は、クロックの完全性を維持するために必要とされます。また、パケット損失検出メカニズムは、エンドツーエンドのエミュレートされたサービスに停止の局在化を提供すべきです。"
    },
    {
      "indent": 3,
      "text": "3. Malformed packets.",
      "section_title": true,
      "ja": "3.不正な形式のパケット。"
    },
    {
      "indent": 0,
      "text": "7.10. Performance Monitoring",
      "section_title": true,
      "ja": "7.10。パフォーマンス監視"
    },
    {
      "indent": 3,
      "text": "The encapsulation layer for edge-to-edge emulation of TDM services SHOULD provide for collection of performance monitoring (PM) data that is compatible with the parameters defined for 'classic', TDM-based carriers of these services. The applicability of [G.826] is left for further study.",
      "ja": "TDMサービスのエッジツーエッジエミュレーションのための封止層は、これらのサービスの「古典的な」、TDMベースのキャリアのために定義されたパラメータと互換性のあるパフォーマンスモニタリング（PM）データの収集を提供すべきです。 [G.826]の適用は、さらなる研究のために残されています。"
    },
    {
      "indent": 0,
      "text": "8. Security Considerations",
      "section_title": true,
      "ja": "8.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "The security considerations in [RFC3916] are fully applicable to the emulation of TDM services. In addition, TDM services are sensitive to packet delay variation [Section 7.6], and need to be protected from this method of attack.",
      "ja": "[RFC3916]のセキュリティの考慮事項は、TDMサービスのエミュレーションに完全に適用されています。また、TDMサービスは、パケット遅延変動[セクション7.6]に対して敏感であり、この攻撃方法から保護する必要があります。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "ja": "9.参考文献"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "ja": "9.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "ja": "9.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC3916] Xiao, X., McPherson, D., and P. Pate, \"Requirements for Pseudo-Wire Emulation Edge-to-Edge (PWE3)\", RFC 3916, September 2004.",
      "ja": "[RFC3916]シャオ、X.、マクファーソン、D.、およびP.パテ、 \"疑似ワイヤー・エミュレーション・エッジ・ツー・エッジ（PWE3）の要件\"、RFC 3916、2004年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC3985] Bryant, S. and P. Pate, \"Pseudo Wire Emulation Edge-to-Edge (PWE3) Architecture\", RFC 3985, March 2005.",
      "ja": "[RFC3985]ブライアント、S.とP.パテ、 \"疑似ワイヤーエミュレーション端から端まで（PWE3）アーキテクチャ\"、RFC 3985、2005年3月。"
    },
    {
      "indent": 3,
      "text": "[G.702] ITU-T Recommendation G.702 (11/88) - Digital hierarchy bit rates",
      "ja": "[G.702] ITU-T勧告G.702（88分の11） - デジタル階層ビットレート"
    },
    {
      "indent": 3,
      "text": "[G.704] ITU-T Recommendation G.704 (10/98) - Synchronous frame structures used at 1544, 6312, 2048, 8448 and 44 736 Kbit/s hierarchical levels",
      "ja": "[G.704] ITU-T勧告G.704（10/98） -  1544、6312、2048、8448と44 736キロビット/秒の階層レベルで使用される同期フレーム構造"
    },
    {
      "indent": 3,
      "text": "[G.706] ITU-T Recommendation G.706 (04/91) - Frame alignment and cyclic redundancy check (CRC) procedures relating to basic frame structures defined in Recommendation G.704",
      "ja": "[G.706] ITU-T勧告G.706（04/91） - フレーム同期と勧告G.704で定義された基本的なフレーム構造に関する巡回冗長検査（CRC）手順"
    },
    {
      "indent": 3,
      "text": "[G.707] ITU-T Recommendation G.707 (10/00) - Network node interface for the synchronous digital hierarchy (SDH)",
      "ja": "[G.707] ITU-T勧告G.707（10/00） - 同期デジタル階層（SDH）のためのネットワークノードインタフェース"
    },
    {
      "indent": 3,
      "text": "[G.751] ITU-T Recommendation G.751 (11/88) - Digital multiplex equipments operating at the third order bit rate of 34 368 Kbit/s and the fourth order bit rate of 139 264 Kbit/s and using positive justification",
      "ja": "[G.751] ITU-T勧告G.751（88分の11） -  34 368キロビット/秒の三次ビットレートと139 264キロビット/秒の四次ビットレートで動作し、正の正当化を使用してデジタル多重機器"
    },
    {
      "indent": 3,
      "text": "[G.810] ITU-T Recommendation G.810 (08/96) - Definitions and terminology for synchronization networks",
      "ja": "同期ネットワークの定義および用語 -  [G.810] ITU-T勧告G.810（08/96）"
    },
    {
      "indent": 3,
      "text": "[G.826] ITU-T Recommendation G.826 (02/99) - Error performance parameters and objectives for international, constant bit rate digital paths at or above the primary rate",
      "ja": "[G.826] ITU-T勧告G.826（02/99） - インターナショナル、一定のビットレートのデジタルパスのエラー性能パラメータと目標一次速度で、または上記"
    },
    {
      "indent": 3,
      "text": "[Q.700] ITU-T Recommendation Q.700 (03/93) - Introduction to CCITT Signalling System No. 7",
      "ja": "[Q.700] ITU-T勧告Q.700（03/93） -  CCITT信号システム第7号概要"
    },
    {
      "indent": 3,
      "text": "[Q.931] ITU-T Recommendation Q.931 (05/98) - ISDN user-network interface layer 3 specification for basic call control",
      "ja": "[931] ITU-T勧告Q.931（05/98） - 基本的な呼制御のためのISDNユーザ・網インタフェースレイヤ3仕様"
    },
    {
      "indent": 3,
      "text": "[RFC1958] Carpenter, B., \"Architectural Principles of the Internet\", RFC 1958, June 1996.",
      "ja": "[RFC1958]大工、B.、 \"インターネットの建築原則\"、RFC 1958、1996年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC2736] Handley, M. and C. Perkins, \"Guidelines for Writers of RTP Payload Format Specifications\", BCP 36, RFC 2736, December 1999.",
      "ja": "[RFC2736]ハンドリー、M.とC.パーキンス、 \"RTPペイロードフォーマット仕様の作家のためのガイドライン\"、BCP 36、RFC 2736、1999年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC3393] Demichelis, C. and P. Chimento, \"IP Packet Delay Variation Metric for IP Performance Metrics (IPPM)\", RFC 3393, November 2002.",
      "ja": "[RFC3393]デミチェリス、C.およびP. Chimento、 \"IPパフォーマンス・メトリックのためのIPパケット遅延変動メトリック（IPPM）\"、RFC 3393、2002年11月。"
    },
    {
      "indent": 3,
      "text": "[T1.105] ANSI T1.105 - 2001 Synchronous Optical Network (SONET) - Basic Description including Multiplex Structure, Rates, and Formats, May 2001",
      "ja": "[T1.105] ANSI T1.105  -  2001年同期光ネットワーク（SONET） - 多重構造、料金などの基本的な説明、およびフォーマット、2001年5月"
    },
    {
      "indent": 3,
      "text": "[T1.107] ANSI T1.107 - 1995. Digital Hierarchy - Format Specification",
      "ja": "[T1.107] ANSI T1.107  -  1995年デジタル階層 - フォーマット仕様"
    },
    {
      "indent": 3,
      "text": "[TR-NWT-170] Digital Cross Connect Systems - Generic Requirements and Objectives, Bellcore, TR-NWT-170, January 1993",
      "ja": "[TR-NWT-170]デジタルクロスコネクトシステム - ジェネリック要件と目的、ベルコア、TR-NWT-170、1993年1月"
    },
    {
      "indent": 0,
      "text": "10. Contributors Section",
      "section_title": true,
      "ja": "10.協力者セクション"
    },
    {
      "indent": 3,
      "text": "The following have contributed to this document:",
      "ja": "以下は、この文書に貢献しています："
    },
    {
      "indent": 3,
      "text": "Sasha Vainshtein Axerra Networks",
      "ja": "サーシャVainshtein Axerra Networksの"
    },
    {
      "indent": 3,
      "text": "EMail: sasha@axerra.com",
      "ja": "メールアドレス：sasha@axerra.com"
    },
    {
      "indent": 3,
      "text": "Yaakov Stein RAD Data Communication",
      "ja": "YaakovのスタインRADデータコミュニケーション"
    },
    {
      "indent": 3,
      "text": "EMail: yaakov_s@rad.com",
      "ja": "メールアドレス：yaakov_s@rad.com"
    },
    {
      "indent": 3,
      "text": "Prayson Pate Overture Networks, Inc.",
      "ja": "Praysonパテ序曲ネットワークス、株式会社.."
    },
    {
      "indent": 3,
      "text": "EMail: prayson.pate@overturenetworks.com",
      "ja": "メールアドレス：prayson.pate@overturenetworks.com"
    },
    {
      "indent": 3,
      "text": "Ron Cohen Lycium Networks",
      "ja": "ロン・コーエンクコネットワーク"
    },
    {
      "indent": 3,
      "text": "EMail: ronc@lyciumnetworks.com",
      "ja": "メールアドレス：ronc@lyciumnetworks.com"
    },
    {
      "indent": 3,
      "text": "Tim Frost Zarlink Semiconductor",
      "ja": "ティム・フロストZarlinkセミコンダクター"
    },
    {
      "indent": 3,
      "text": "EMail: tim.frost@zarlink.com",
      "ja": "メールアドレス：tim.frost@zarlink.com"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Maximilian Riegel Siemens AG St-Martin-Str 76 Munich 81541 Germany",
      "ja": "マクシミリアンリーゲルシーメンスAGサンマルタンのStr 76 81541ミュンヘンドイツ"
    },
    {
      "indent": 3,
      "text": "Phone: +49-89-636-75194 EMail: maximilian.riegel@siemens.com",
      "ja": "電話：+ 49-89-636-75194 Eメール：maximilian.riegel@siemens.com"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "ja": "著作権（C）インターネット協会（2005）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "この文書では、BCP 78に含まれる権利と許可と制限の適用を受けており、その中の記載を除いて、作者は彼らのすべての権利を保有します。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とCONTRIBUTOR「そのまま」、ORGANIZATION HE / SHEが表すまたはインターネットソサエティおよびインターネット・エンジニアリング・タスク・フォース放棄すべての保証、明示または、（もしあれば）後援ISに設けられています。黙示、情報の利用は、特定の目的に対する権利または商品性または適合性の黙示の保証を侵害しない任意の保証含むがこれらに限定されません。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、本書またはそのような権限下で、ライセンスがたりないかもしれない程度に記載された技術の実装や使用に関係すると主張される可能性があります任意の知的財産権やその他の権利の有効性または範囲に関していかなる位置を取りません利用可能です。またそれは、それがどのような権利を確認する独自の取り組みを行ったことを示すものでもありません。 RFC文書の権利に関する手続きの情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IPRの開示のコピーが利用できるようにIETF事務局とライセンスの保証に行われた、または本仕様の実装者または利用者がそのような所有権の使用のための一般的なライセンスまたは許可を取得するために作られた試みの結果を得ることができますhttp://www.ietf.org/iprのIETFのオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、その注意にこの標準を実装するために必要とされる技術をカバーすることができる任意の著作権、特許または特許出願、またはその他の所有権を持ってすべての利害関係者を招待します。 ietf-ipr@ietf.orgのIETFに情報を記述してください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}