{
  "title": {
    "text": "RFC 4608 - Source-Specific Protocol Independent Multicast in 232/8",
    "ja": "RFC 4608 - 232/8でソース固有プロトコル独立マルチキャスト"
  },
  "number": 4608,
  "created_at": "2019-10-23 23:05:42.750321+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                           D. Meyer\nRequest for Comments: 4608                                    R. Rockell\nBCP: 120                                                     G. Shepherd\nCategory: Best Current Practice                              August 2006",
      "raw": true
    },
    {
      "indent": 8,
      "text": "Source-Specific Protocol Independent Multicast in 232/8",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet Best Current Practices for the Internet Community, and requests discussion and suggestions for improvements. Distribution of this memo is unlimited.",
      "ja": "このドキュメントはインターネットコミュニティのためのインターネットBest Current Practicesを指定し、改善のための議論と提案を要求します。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2006).",
      "ja": "著作権（C）インターネット協会（2006）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "IP Multicast group addresses in the 232/8 (232.0.0.0 to 232.255.255.255) range are designated as source-specific multicast destination addresses and are reserved for use by source-specific multicast applications and protocols. This document defines operational recommendations to ensure source-specific behavior within the 232/8 range.",
      "ja": "232/8（232.0.0.0 232.255.255.255まで）の範囲内のIPマルチキャストグループアドレスは、ソース固有マルチキャスト宛先アドレスとして指定され、ソース固有マルチキャストアプリケーションとプロトコルで使用するために予約されています。この文書は232/8の範囲内のソース固有の動作を保証するために、動作推奨を定義します。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n   1.1. BCP, Experimental Protocols, and Normative References ......2\n2. Operational practices in 232/8 ..................................4\n   2.1. Preventing Local Sources from Sending to Shared Tree .......4\n   2.2. Preventing Remote Sources from Being Learned/Joined\n        via MSDP ...................................................4\n   2.3. Preventing Receivers from Joining the Shared Tree ..........4\n   2.4. Preventing RPs as Candidates for 232/8 .....................5\n3. Acknowledgements ................................................5\n4. Security Considerations .........................................5\n5. References ......................................................6\n   5.1. Normative References .......................................6\n   5.2. Informative References .....................................6",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "Current Protocol Independent Multicast - Sparse Mode (PIM-SM) [RFC4601] relies on the shared Rendezvous Point (RP) tree to learn about active sources for a group and to support group-generic (Any Source Multicast or ASM) data distribution. The IP Multicast group address range 232/8 has been designated for Source-Specific Multicast [RFC3569] applications and protocols [IANA] and SHOULD support source-only trees only, precluding the requirement of an RP and a shared tree; active sources in the 232/8 range will be discovered out of band. PIM Sparse Mode Designated Routers (DR) with local membership are capable of joining the shortest path tree for the source directly using SSM functionality of PIM-SM.",
      "ja": "現在のプロトコル独立マルチキャスト - スパースモード（PIM-SM）[RFC4601]はグループのアクティブソースについて学習すると、一般的なグループ（どれソースマルチキャストまたはASM）のデータ配信をサポートするために、共有ランデブーポイント（RP）ツリーに依存しています。 IPマルチキャストグループアドレス範囲232/8は[IANA]ソース固有マルチキャスト[RFC3569]アプリケーションおよびプロトコル用に指定されており、RPと共有ツリーの要件を排除し、唯一のソースのみのツリーを支持します。 232/8範囲で活性源は、帯域外で発見されます。ローカル・メンバーシップを持つPIM希薄モード指定ルータ（DR）を直接PIM-SMのSSM機能を使用してソースの最短経路ツリーを結合することが可能です。"
    },
    {
      "indent": 3,
      "text": "Operational best common practices in the 232/8 group address range are necessary to ensure shortest path source-only trees across multiple domains in the Internet [RFC3569], and to prevent data from sources sending to groups in the 232/8 range from arriving via shared trees. This avoids unwanted data arrival and allows several sources to use the same group address without conflict at the receivers.",
      "ja": "232/8グループアドレス範囲の動作ベストプラクティス一般的には、インターネット[RFC3569]で複数のドメイン間で最短経路ソースのみツリーを確実にするために、及び介して到着から232/8の範囲内のグループに送信ソースからのデータを防ぐために必要です共有ツリー。これは、不要なデータの到来を回避し、いくつかのソースは、受信機において競合することなく同じグループアドレスを使用することを可能にします。"
    },
    {
      "indent": 3,
      "text": "The operational practices SHOULD:",
      "ja": "運用実践する必要があります。"
    },
    {
      "indent": 6,
      "text": "o Prevent local sources from sending to shared tree",
      "ja": "O共有ツリーへの送信からローカルソースを防ぎます"
    },
    {
      "indent": 6,
      "text": "o Prevent receivers from joining the shared tree",
      "ja": "共有ツリーへの参加からO防止レシーバー"
    },
    {
      "indent": 6,
      "text": "o Prevent RPs as candidates for 232/8",
      "ja": "O防止のRP 232/8の候補として"
    },
    {
      "indent": 6,
      "text": "o Prevent remote sources from being learned/joined via Multicast Source Discovery Protocol (MSDP) [RFC3618]",
      "ja": "O /学習されることを防ぐリモートソースは、マルチキャスト発信元検出プロトコル（MSDP）[RFC3618]を介して連結しました"
    },
    {
      "indent": 0,
      "text": "1.1. BCP, Experimental Protocols, and Normative References",
      "section_title": true,
      "ja": "1.1。 BCP、実験プロトコル、および引用規格"
    },
    {
      "indent": 3,
      "text": "This document describes the best current practice for a widely deployed Experimental protocol, MSDP. There is no plan to advance MSDP's status (for example, to Proposed Standard). The reasons for this include:",
      "ja": "この文書では、広く普及し、実験プロトコル、MSDPのための最良の現在のプラクティスについて説明します。 （例えば、標準化提案へ）MSDPの状態を推進する予定はありません。その理由は、次のとおりです。"
    },
    {
      "indent": 6,
      "text": "o MSDP was originally envisioned as a temporary protocol to be supplanted by whatever the Inter-Domain Multicast Routing (IDMR) working group produced as an inter-domain protocol. However, the IDMR WG (or subsequently, the Border Gateway Multicast Protocol (BGMP) WG) never produced a protocol that could be deployed to replace MSDP.",
      "ja": "O MSDPは、もともとドメイン間プロトコルとして生成どのドメイン間マルチキャストルーティング（IDMR）ワーキンググループによって取って代わられるべき一時的なプロトコルとして想定しました。しかし、IDMR WG（またはその後に、ボーダーゲートウェイマルチキャストプロトコル（BGMP）WG）は、MSDPを交換するために展開することができ、プロトコルを生成することはありません。"
    },
    {
      "indent": 6,
      "text": "o One of the primary reasons given for MSDP to be classified as Experimental was that the MSDP Working Group came up with modifications to the protocol that the WG thought made it better but that implementors didn't see any reasons to deploy. Without these modifications (e.g., UDP or GRE encapsulation), MSDP can have negative consequences to initial packets in datagram streams.",
      "ja": "O MSDPが実験的に分類されるために与えられた主な理由の一つは、MSDPワーキンググループがWGは、それがよりよい作ったが実装者が展開するあらゆる理由のを見ていないと思ったプロトコルへの変更を思い付いたということでした。これらの修飾（例えば、UDPまたはGREカプセル化）することなく、MSDPは、データグラムストリームにおける最初のパケットに対して否定的な結果を有することができます。"
    },
    {
      "indent": 6,
      "text": "o Scalability: Although we don't know what the hard limits might be, readvertising everything you know every 60 seconds clearly limits the amount of state you can advertise.",
      "ja": "Oの拡張性：私たちはすべてをreadvertising、ハードリミットが何であるか分からないが、あなたは明確に60秒ごとに知っているあなたが広告することができる状態の量を制限します。"
    },
    {
      "indent": 6,
      "text": "o MSDP reached nearly ubiquitous deployment as the de facto standard inter-domain multicast protocol in the IPv4 Internet.",
      "ja": "O MSDPはIPv4インターネットでのデファクトスタンダードドメイン間のマルチキャストプロトコルとほぼユビキタス展開に達しました。"
    },
    {
      "indent": 6,
      "text": "o No consensus could be reached regarding the reworking of MSDP to address the many concerns of various constituencies within the IETF. As a result, a decision was taken to document what is (ubiquitously) deployed and to move that document to Experimental. Although advancement of MSDP to Proposed Standard was considered, for the reasons mentioned above, it was immediately discarded.",
      "ja": "Oコンセンサスは、IETF内のさまざまな有権者の多くの懸念に対処するためのMSDPの再加工に関する到達することはできませんでした。その結果、決定は（遍在し）に配備されており、実験的にその文書を移動するために何を文書化するために取られました。 Proposed StandardへのMSDPの進歩を考えたが、上記の理由のために、それはすぐに捨てました。"
    },
    {
      "indent": 6,
      "text": "o The advent of protocols such as source-specific multicast and bi-directional PIM, as well as embedded RP techniques for IPv6, have further reduced consensus that a replacement protocol for MSDP for the IPv4 Internet is required.",
      "ja": "そのようなソース固有マルチキャストおよび双方向PIM、ならびにIPv6の埋め込みRP技術などのプロトコルの出現O、さらにIPv4インターネット用MSDPの交換プロトコルが必要であることコンセンサスが減少しています。"
    },
    {
      "indent": 3,
      "text": "The RFC Editor's policy regarding references is that they be split into two categories known as \"normative\" and \"informative\". Normative references specify those documents that must be read for one to understand or implement the technology in an RFC (or whose technology must be present for the technology in the new RFC to work) [RFCED]. In order to understand this document, one must also understand both the PIM [RFC4601] and MSDP [RFC3618] documents. As a result, references to these documents are normative.",
      "ja": "参照に関するRFC編集者の政策は、彼らが「規範」と「有益」として知られている2つのカテゴリーに分割されることです。引用規格（またはその技術の仕事に新しいRFCにおける技術のために存在している必要があります）[RFCED] RFCに技術を理解したり、実装するための1のために読み取らなければならないそれらの文書を指定します。このドキュメントを理解するためには、また、PIM [RFC4601]とMSDP [RFC3618]ドキュメントの両方を理解する必要があります。その結果、これらの文書への参照は規範的です。"
    },
    {
      "indent": 3,
      "text": "The IETF has adopted the policy that BCPs must not have normative references to Experimental protocols. However, this document is a special case in that the underlying Experimental document (MSDP) is not planned to be advanced to Proposed Standard.",
      "ja": "IETFはのBCPは、実験プロトコルへの引用規格を持っていなければならない政策を採用しています。しかし、この文書は、基礎となる実験的文書（MSDP）が提案されている規格に前進するように計画されていないという点で特殊なケースです。"
    },
    {
      "indent": 3,
      "text": "The MBONED Working Group requests approval under the Variance Procedure as documented in RFC 2026 [RFC2026]. The IESG followed the Variance Procedure and, after an additional 4-week IETF Last Call, evaluated the comments and status and has approved the document.",
      "ja": "MBONEDワーキンググループは、RFC 2026 [RFC2026]に記載されているように分散手順の下での承認を要求します。 IESGは、分散手順に従ったと、追加の4週間のIETFラストコールした後、コメントや状況を評価し、文書を承認しました。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\"\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "ja": "キーワードは「、 \"REQUIRED\"、、、、、 \"MAY\"、 \"推奨\"、 \"すべきではない\" \"べきである\" \"SHALL NOT\" \"ものと\" \"MUST NOT\" \"MUST\"、およびこのドキュメントの \"オプション\" RFC 2119 [RFC2119]に記載されているように解釈されるべきです。"
    },
    {
      "indent": 0,
      "text": "2. Operational practices in 232/8",
      "section_title": true,
      "ja": "232/8 2.運用プラクティス"
    },
    {
      "indent": 0,
      "text": "2.1. Preventing Local Sources from Sending to Shared Tree",
      "section_title": true,
      "ja": "2.1。共有ツリーへの送信からローカルソースの防止"
    },
    {
      "indent": 3,
      "text": "In order to eliminate the use of shared trees for groups in 232/8, while maintaining coexistence with ASM in PIM-SM, the behavior of the RP and/or the DR needs to be modified. This can be accomplished by",
      "ja": "PIM-SMにおけるASMとの共存を維持しながら、232/8でグループに対する共有ツリーの使用を排除するために、RP及び/又はDRの挙動を変更する必要があります。これは、ことによって達成することができます"
    },
    {
      "indent": 6,
      "text": "- preventing data for 232/8 groups from being sent encapsulated to the RP by the DR,",
      "ja": " - 、DRによってRPにカプセル化され送信されてから232/8グループのデータを防止します"
    },
    {
      "indent": 6,
      "text": "- preventing the RP from accepting registers for 232/8 groups from the DR, and",
      "ja": " -  DRから232/8グループに対して受け入れレジスタからRPを防止し、及び"
    },
    {
      "indent": 6,
      "text": "- preventing the RP from forwarding accepted data down (*,G) tree for 232/8 groups.",
      "ja": " -  232/8グループに対してダウン（*、G）ツリーを受け付けたデータを転送からRPを防止します。"
    },
    {
      "indent": 0,
      "text": "2.2. Preventing Remote Sources from Being Learned/Joined via MSDP",
      "section_title": true,
      "ja": "2.2。 MSDPを経て入社/学習さからリモート・ソースの防止"
    },
    {
      "indent": 3,
      "text": "SSM does not require active source announcements via MSDP. All source announcements are received out of band, and the last hop router is responsible for sending (S,G) joins directly to the source. To prevent propagation of SAs in the 232/8 range, an RP SHOULD",
      "ja": "SSMは、MSDPを経由してアクティブなソースの発表を必要としません。すべてのソースの発表は、帯域外で受信され、最後のホップルータは（S、G）ソースに直接参加するの送信を担当します。 232/8範囲、RP SHOULDにSAの伝播を防ぐために、"
    },
    {
      "indent": 6,
      "text": "- never originate an SA for any 232/8 groups, and",
      "ja": " - すべての232/8グループのためにSAを発信しませんし、"
    },
    {
      "indent": 6,
      "text": "- never accept or forward an SA for any 232/8 groups.",
      "ja": " - すべての232/8グループのためにSAを受け入れないか、転送しません。"
    },
    {
      "indent": 0,
      "text": "2.3. Preventing Receivers from Joining the Shared Tree",
      "section_title": true,
      "ja": "2.3。共有ツリーへの参加からレシーバの防止"
    },
    {
      "indent": 3,
      "text": "Local PIM domain practices need to be enforced to prevent local receivers from joining the shared tree for 232/8 groups. This can be accomplished by",
      "ja": "ローカルPIMドメイン慣行が232/8グループの共有ツリーに参加する地元のレシーバを防ぐために施行する必要があります。これは、ことによって達成することができます"
    },
    {
      "indent": 6,
      "text": "- preventing DR from sending (*,G) joins for 232/8 groups, and",
      "ja": " - （*、G）232/8グループに対して参加送信からDRを防止し、及び"
    },
    {
      "indent": 6,
      "text": "- preventing RP from accepting (*,G) join for 232/8 groups.",
      "ja": " - 受け入れからRPを防止する（*、G）232/8グループに対して加わります。"
    },
    {
      "indent": 3,
      "text": "However, within a local PIM domain, any last-hop router NOT preventing (*,G) joins may trigger unwanted (*,G) state toward the RP that intersects an existing (S,G) tree, allowing the receiver on the shared tree to receive the data, which breaks the source-specific",
      "ja": "しかし、ローカルPIMドメイン内で、任意の最後のホップルータが（*、G）妨げない共有に受信を可能にする既存の（S、G）ツリーと交差RPに向かって（*、G）の望ましくない状態を引き起こす可能性が合流ソース固有を壊したデータを、受信する木"
    },
    {
      "indent": 3,
      "text": "[RFC3569] service model. It is therefore recommended that ALL routers in the domain MUST reject AND never originate (*,G) joins for 232/8 groups.",
      "ja": "[RFC3569]サービスモデル。したがって、ドメイン内のすべてのルータが拒否AND（*を、G）は232/8グループのために参加する発信はならないことをお勧めします。"
    },
    {
      "indent": 3,
      "text": "In those cases in which an ISP is offering its customers (or others) the use of the ISP's RP, the ISP SHOULD NOT allow (*,G) joins in the 232/8 range.",
      "ja": "ISPは、ISPのRPの使用を顧客（またはその他）提供されているような場合には、ISPは、（*、G）が232/8の範囲内の結合許してはなりません。"
    },
    {
      "indent": 0,
      "text": "2.4. Preventing RPs as Candidates for 232/8",
      "section_title": true,
      "ja": "2.4。 232/8の候補としてRPを防止"
    },
    {
      "indent": 3,
      "text": "Because SSM does not require an RP, all RPs SHOULD NOT offer themselves as candidates in the 232/8 range. This can be accomplished by",
      "ja": "SSMは、RPを必要としないので、すべてのRPは232/8の範囲の候補として自らを申し出てはなりません。これは、ことによって達成することができます"
    },
    {
      "indent": 6,
      "text": "- preventing RP/BSR from announcing in the 232/8 range,",
      "ja": " -  232/8の範囲で発表するからRP / BSRを防止し、"
    },
    {
      "indent": 6,
      "text": "- preventing ALL routers from accepting RP delegations in the 232/8 range, and",
      "ja": " -  232/8の範囲でRP代表団を受け入れからすべてのルータを防止し、及び"
    },
    {
      "indent": 6,
      "text": "- precluding RP functionality on RP for the 232/8 range.",
      "ja": " -  232/8の範囲のためのRP上のRPの機能を妨げます。"
    },
    {
      "indent": 3,
      "text": "Note that in typical practice, RPs announce themselves as candidates for the 224/4 (which obviously includes 232/8). It is still acceptable to allow the advertisement of 224/4 (or any other superset of 232/8); however, this approach relies on the second point, above; namely, that routers silently ignore the RP delegation in the 232/8 range and prevent sending or receiving using the shared tree, as described previously. Finally, an RP SHOULD NOT be configured as a candidate RP for 232/8 (or for a more specific range).",
      "ja": "典型的な実際には、RPが（明らかに232/8を含む）224/4の候補として自分自身を発表することに注意してください。 224/4の広告（又は232/8の任意の他のスーパーセット）を可能にするために依然として許容可能です。しかし、このアプローチは、上記第二の点に依存しています。すなわち、ルータは静か232/8の範囲でRP委任を無視して先に説明したように、共有ツリーを使用して送信または受信防ぐこと。最後に、RPは232/8（または複数の特定の範囲について）の候補RPとして設定しないでください。"
    },
    {
      "indent": 0,
      "text": "3. Acknowledgements",
      "section_title": true,
      "ja": "3.謝辞"
    },
    {
      "indent": 3,
      "text": "This document is the work of many people in the multicast community, including (but not limited to) Dino Farinacci, John Meylor, John Zwiebel, Tom Pusateri, Dave Thaler, Toerless Eckert, Leonard Giuliano, Mike McBride, and Pekka Savola.",
      "ja": "この文書では、ディノファリナッチ、ジョンMeylor、ジョンZwiebel、トムPusateri、デーブターラー、Toerlessエッカート、レオナルドジュリアーノ、マイク・マクブライド、およびペッカSavola（これらに限定されない）を含むマルチキャストコミュニティ内の多くの人々の仕事です。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "This document describes operational practices that introduce no new security issues to PIM-SM [RFC4601] in either or SSM [RFC3569] or ASM operation.",
      "ja": "この文書では、いずれか、またはSSM [RFC3569]またはASM操作でPIM-SM [RFC4601]への新たなセキュリティ上の問題を導入しない運用方法について説明します。"
    },
    {
      "indent": 3,
      "text": "However, in the event that the operational practices described in this document are not adhered to, some problems may surface. In particular, Section 2.3 describes the effects of non-compliance of last-hop routers (or, to some degree, rogue hosts sending PIM messages themselves) on the source-specific service model. Creating the (*,G) state for source-specific (S,G) could enable a receiver to receive data it should not get. This can be mitigated by host-side multicast source filtering.",
      "ja": "しかし、この文書に記述されている運用慣行が守られていないという場合には、いくつかの問題が表面化します。具体的には、2.3節では、ソース固有のサービスモデルに（PIMのメッセージ自体を送信するか、ある程度、不正なホスト）ラストホップルータの非遵守の効果を説明します。ソース固有の（S、G）のための（*、G）ステートを作成すると、それが得るべきでないデータを受信する受信機を可能にすることができます。これは、ホスト側のマルチキャストソースフィルタリングによって軽減することができます。"
    },
    {
      "indent": 0,
      "text": "5. References",
      "section_title": true,
      "ja": "5.参考文献"
    },
    {
      "indent": 0,
      "text": "5.1. Normative References",
      "section_title": true,
      "ja": "5.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC4601] Fenner, B., Handley, M., Holbrook, H., and I. Kouvelas, \"Protocol Independent Multicast - Sparse Mode (PIM-SM): Protocol Specification (Revised)\", RFC 4601, August 2006.",
      "ja": "[RFC4601]フェナー、B.、ハンドリー、M.、ホルブルック、H.、およびI. Kouvelas、 \"プロトコル独立マルチキャスト - スパースモード（PIM-SM）：プロトコル仕様（改訂）\"、RFC 4601、2006年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2026] Bradner, S., \"The Internet Standards Process -- Revision 3\", BCP 9, RFC 2026, October 1996.",
      "ja": "[RFC2026]ブラドナーの、S.、 \"インターネット標準化プロセス - リビジョン3\"、BCP 9、RFC 2026、1996年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC3569] Bhattacharyya, S., \"An Overview of Source-Specific Multicast (SSM)\", RFC 3569, July 2003.",
      "ja": "[RFC3569]バッタチャリヤ、S.、 \"ソース固有マルチキャスト（SSM）の概要\"、RFC 3569、2003年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC3618] Fenner, B. and D. Meyer, \"Multicast Source Discovery Protocol (MSDP)\", RFC 3618, October 2003.",
      "ja": "[RFC3618]フェナー、B.とD.マイヤー、 \"は、Multicast Source Discovery Protocol（MSDP）\"、RFC 3618、2003年10月。"
    },
    {
      "indent": 0,
      "text": "5.2. Informative References",
      "section_title": true,
      "ja": "5.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[IANA] http://www.iana.org",
      "ja": "[IANA] http://www.iana.org"
    },
    {
      "indent": 3,
      "text": "[RFCED] http://www.rfc-editor.org/policy.html",
      "ja": "【RFCED] http://www.rfc-editor.org/policy.html"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "David Meyer",
      "ja": "デビッド・マイヤー"
    },
    {
      "indent": 3,
      "text": "EMail: dmm@1-4-5.net",
      "ja": "メールアドレス：dmm@1-4-5.net"
    },
    {
      "indent": 3,
      "text": "Robert Rockell Sprint",
      "ja": "ロバートロッケルスプリント"
    },
    {
      "indent": 3,
      "text": "EMail: rrockell@sprint.net",
      "ja": "メールアドレス：rrockell@sprint.net"
    },
    {
      "indent": 3,
      "text": "Greg Shepherd Cisco",
      "ja": "グレッグ・シェパードシスコ"
    },
    {
      "indent": 3,
      "text": "EMail: gjshep@gmail.com",
      "ja": "メールアドレス：gjshep@gmail.com"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2006).",
      "ja": "著作権（C）インターネット協会（2006）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "この文書では、BCP 78に含まれる権利と許可と制限の適用を受けており、その中の記載を除いて、作者は彼らのすべての権利を保有します。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とCONTRIBUTOR「そのまま」、ORGANIZATION HE / SHEが表すまたはインターネットソサエティおよびインターネット・エンジニアリング・タスク・フォース放棄すべての保証、明示または、（もしあれば）後援ISに設けられています。黙示、情報の利用は、特定の目的に対する権利または商品性または適合性の黙示の保証を侵害しない任意の保証含むがこれらに限定されません。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、本書またはそのような権限下で、ライセンスがたりないかもしれない程度に記載された技術の実装や使用に関係すると主張される可能性があります任意の知的財産権やその他の権利の有効性または範囲に関していかなる位置を取りません利用可能です。またそれは、それがどのような権利を確認する独自の取り組みを行ったことを示すものでもありません。 RFC文書の権利に関する手続きの情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IPRの開示のコピーが利用できるようにIETF事務局とライセンスの保証に行われた、または本仕様の実装者または利用者がそのような所有権の使用のための一般的なライセンスまたは許可を取得するために作られた試みの結果を得ることができますhttp://www.ietf.org/iprのIETFのオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、その注意にこの標準を実装するために必要とされる技術をカバーすることができる任意の著作権、特許または特許出願、またはその他の所有権を持ってすべての利害関係者を招待します。 ietf-ipr@ietf.orgのIETFに情報を記述してください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is provided by the IETF Administrative Support Activity (IASA).",
      "ja": "RFCエディタ機能のための資金は、IETF管理サポート活動（IASA）によって提供されます。"
    }
  ]
}