{
  "title": {
    "text": "RFC 4195 - A Uniform Resource Name (URN) Namespace for the TV-Anytime Forum",
    "ja": "RFC 4195 - たTV-Anytimeフォーラムのための統一リソース名（URN）名前空間"
  },
  "number": 4195,
  "created_at": "2019-10-21 20:30:46.087722+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                        W. Kameyama\nRequest for Comments: 4195                       GITS, Waseda University\nCategory: Informational                                     October 2005",
      "raw": true
    },
    {
      "indent": 4,
      "text": "A Uniform Resource Name (URN) Namespace for the TV-Anytime Forum",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモはインターネットコミュニティのための情報を提供します。それはどんな種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "ja": "著作権（C）インターネット協会（2005）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document describes a Uniform Resource Name (URN) namespace that is engineered by the TV-Anytime Forum for naming persistent resources published by the TV-Anytime Forum including the TV-Anytime Forum Standards, XML (Extensible Markup Language) Document Type Definitions, XML Schemas, Namespaces, and other documents.",
      "ja": "この文書では、たTV-Anytimeフォーラム規格、XML（拡張マークアップ言語）文書型定義、XMLを含めたTV-Anytimeフォーラムで発表され、永続的リソースに名前を付けるためたTV-Anytimeフォーラムによって設計された統一リソース名（URN）名前空間について説明しスキーマ、名前空間、および他の文書。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The TV-Anytime Forum produces many kinds of documents (i.e., specifications, working documents, and schemas) that are currently being considered for adoption by many standardization bodies such as ETSI (European Telecommunication Standardization Institute), DVB (Digital Video Broadcasting), ARIB (Association of Radio Industries and Businesses), and ATSC (Advance Television Systems Committee).",
      "ja": "たTV-Anytime Forumは現在、ETSI（欧州電気通信標準化協会）など、多くの標準化団体によって採用が検討されている文書の多くの種類（すなわち、仕様、作業文書、およびスキーマ）を生成し、DVB（デジタルビデオ放送）、ARIB （電波産業会）、およびATSC（アドバンステレビジョンシステム委員会）。"
    },
    {
      "indent": 3,
      "text": "The TV-Anytime Forum wishes to provide global, distributed, persistent, location-independent names for these resources.",
      "ja": "たTV-Anytimeフォーラムは、これらのリソースのグローバルな分散、永続的な、場所に依存しない名前を提供することを希望します。"
    },
    {
      "indent": 0,
      "text": "2. Specification Template",
      "section_title": true,
      "ja": "2.仕様のテンプレート"
    },
    {
      "indent": 3,
      "text": "Namespace ID:",
      "ja": "名前空間ID："
    },
    {
      "indent": 6,
      "text": "\"tva\"",
      "ja": "「バット」"
    },
    {
      "indent": 3,
      "text": "Registration information:",
      "ja": "登録情報："
    },
    {
      "indent": 6,
      "text": "Registration Version Number: 1 Registration Date: 2005-1-6",
      "ja": "登録バージョン番号：1登録日：2005年1月6日"
    },
    {
      "indent": 3,
      "text": "Declared registrant of the namespace:",
      "ja": "名前空間の宣言された登録者："
    },
    {
      "indent": 6,
      "text": "Name: Wataru KAMEYAMA Title: Vice Chairman and Secretary, The TV-Anytime Forum Affiliation: Graduate School of Global Information and Telecommunication Studies, Waseda University Address: 1011 Okuboyama, Nishi-tomida, Honjo-shi, Saitama 367-0035, JAPAN Phone: +81 495 24 6052 Email: wataru@waseda.jp",
      "ja": "名前：渉亀山タイトル：副会長兼事務局長、たTV-Anytimeフォーラム所属：国際情報通信研究、早稲田大学アドレスの大学院：1011 Okuboyama、西富田、本庄市、埼玉県367から0035、JAPAN電話： +81 495 24 6052 Eメール：wataru@waseda.jp"
    },
    {
      "indent": 3,
      "text": "Declaration of structure:",
      "ja": "構造体の宣言："
    },
    {
      "indent": 6,
      "text": "The Namespace Specific String (NSS) of all URNs assigned by the TV-Anytime Forum will have the following hierarchical structure:",
      "ja": "たTV-Anytimeフォーラムによって割り当てられたすべてのURNの名前空間固有の文字列（NSS）は、以下の階層構造を持つことになります。"
    },
    {
      "indent": 18,
      "text": "urn:tva:{category}:{string}",
      "ja": "URN：TVA：{カテゴリ}：{文字列}"
    },
    {
      "indent": 6,
      "text": "where the \"category\" is a US-ASCII string that conforms to URN syntax requirements ([RFC2141]), and \"{string}\" is a string that confirms to URN syntax requirements ([RFC2141]).",
      "ja": "ここで、「カテゴリ」は、構文要件（[RFC2141]）をURNに準拠US-ASCII文字列であり、「{}文字列は、」構文要件（[RFC2141]）をURNすることを確認する文字列です。"
    },
    {
      "indent": 3,
      "text": "Relevant ancillary documentation:",
      "ja": "関連の補助ドキュメント："
    },
    {
      "indent": 6,
      "text": "The TV-Anytime Forum specifications have been publicly available at all stages during their development from \"ftp://tva:tva@ftp.bbc.co.uk/Specifications/\". The final specifications are also available as formal ETSI (European Telecommunication Standardization Institute) technical specification documents, ETSI TS 102 822 series.",
      "ja": "たTV-Anytime Forum仕様は「：// TVA：tva@ftp.bbc.co.uk/Specifications/ FTP」から彼らの開発中にすべての段階で一般に公開されています。最終的な仕様も正式ETSI（欧州電気通信標準化協会）の技術仕様書、ETSI TS 102 822シリーズとしてご利用いただけます。"
    },
    {
      "indent": 3,
      "text": "Identifier uniqueness considerations:",
      "ja": "識別子一意性の考慮事項："
    },
    {
      "indent": 6,
      "text": "The TV-Anytime Forum shall establish unique identifiers as appropriate.",
      "ja": "たTV-Anytimeフォーラムは、必要に応じて一意の識別子を確立しなければなりません。"
    },
    {
      "indent": 6,
      "text": "Uniqueness is guaranteed as long as the assigned \"{category}\" is never reassigned for other categories. The TV-Anytime Forum is responsible for this.",
      "ja": "一意性は限り割り当てられている「{}カテゴリが」他のカテゴリのために再割り当てされることはありませんとして保証されています。たTV-Anytime Forumは、このために責任があります。"
    },
    {
      "indent": 3,
      "text": "Identifier persistence considerations:",
      "ja": "識別子の永続性の考慮事項："
    },
    {
      "indent": 6,
      "text": "The TV-Anytime Forum is committed to maintaining the accessibility and persistence of all resources that are officially assigned URNs by the organization. Persistence of identifiers is dependent upon suitable delegation at the level of \"category\"s, and persistence of category assignment.",
      "ja": "たTV-Anytimeフォーラムが正式に組織によってのURNを割り当てられているすべてのリソースのアクセシビリティと持続性を維持することにコミットしています。識別子の持続性は、適切な「カテゴリ」のレベルで委任、およびカテゴリの割り当ての持続性に依存しています。"
    },
    {
      "indent": 3,
      "text": "Process of identifier assignment:",
      "ja": "識別子割り当てのプロセス。"
    },
    {
      "indent": 6,
      "text": "All the assignments of identifiers are fully controlled and managed by the TV-Anytime Forum.",
      "ja": "識別子のすべての割り当てが完全に制御されたTV-Anytimeフォーラムによって管理されています。"
    },
    {
      "indent": 3,
      "text": "Process of identifier resolution:",
      "ja": "識別子解像度のプロセス。"
    },
    {
      "indent": 6,
      "text": "The namespace is not listed with an RDS; this is not relevant.",
      "ja": "名前空間はRDSに記載されていません。これは関係ありません。"
    },
    {
      "indent": 3,
      "text": "Rules for Lexical Equivalence:",
      "ja": "字句等価のルール："
    },
    {
      "indent": 6,
      "text": "The \"{category}\" is case-insensitive. Thus, the portion of the URN:",
      "ja": "「{}カテゴリは、」大文字と小文字を区別しないです。したがって、URNの一部："
    },
    {
      "indent": 18,
      "text": "urn:tva:{category}:",
      "ja": "URN：TVA：{カテゴリ}。"
    },
    {
      "indent": 6,
      "text": "is case-insensitive for matches. The remainder of the identifier shall be considered case-sensitive; hence, URNs are only lexically equivalent if they are also lexically identical in the remaining {string} field.",
      "ja": "大文字と小文字を区別しない一致するものです。識別子の残りは大文字と小文字を区別みなします。それらは残り{文字列}フィールドにも字句的に同一である場合、したがって、のURNは、辞書的に同等です。"
    },
    {
      "indent": 3,
      "text": "Conformance with URN Syntax:",
      "ja": "URN構文に準拠："
    },
    {
      "indent": 6,
      "text": "No special considerations.",
      "ja": "特別な考慮事項はありません。"
    },
    {
      "indent": 3,
      "text": "Validation mechanism:",
      "ja": "検証メカニズム："
    },
    {
      "indent": 6,
      "text": "Validation shall be done by a syntax grammar corresponding to each \"{category}\".",
      "ja": "検証は、それぞれ、「{カテゴリ}」に対応する構文の文法によって行われなければなりません。"
    },
    {
      "indent": 3,
      "text": "Scope:",
      "ja": "範囲："
    },
    {
      "indent": 6,
      "text": "Global.",
      "ja": "グローバル。"
    },
    {
      "indent": 0,
      "text": "3. Examples",
      "section_title": true,
      "ja": "3.例"
    },
    {
      "indent": 3,
      "text": "The following examples are not guaranteed to be real. They are provided for pedagogical reasons only.",
      "ja": "次の例では、本当のことが保証されていません。彼らは唯一の教育的な理由のために提供されています。"
    },
    {
      "indent": 9,
      "text": "urn:tva:metadata:2002\nurn:tva:metadata:cs:IntentionCS:2002\nurn:tva:metadata:cs:ActionTypeCS:2002\nurn:tva:rmp:tvax",
      "raw": true
    },
    {
      "indent": 0,
      "text": "4. Community Considerations",
      "section_title": true,
      "ja": "4.コミュニティの考慮事項"
    },
    {
      "indent": 3,
      "text": "The names in this namespace are to be used in any public implementations of the TV-Anytime Forum specifications so that anybody can benefit from the officially assigned namespace.",
      "ja": "この名前空間内の名前は誰もが公式に割り当てられた名前空間の恩恵を受けることができるようにたTV-Anytime Forum仕様の任意のパブリック実装するときに使用します。"
    },
    {
      "indent": 3,
      "text": "Potential beneficiary communities include:",
      "ja": "潜在的な受益者のコミュニティは、次のとおりです。"
    },
    {
      "indent": 3,
      "text": "a) Implementers of the TV-Anytime specifications.",
      "ja": "A）たTV-Anytime仕様の実装者。"
    },
    {
      "indent": 6,
      "text": "Resources that comply with the TV-Anytime Forum specifications (including TV-Anytime schemas, instance documents that comply with TV-Anytime schemas, and TV-Anytime default Classification Schemes) may, by means of the registered namespace, become exposed to the general Internet and gain from the interoperability benefits of the Internet at large.",
      "ja": "（たTV-Anytimeのスキーマ、およびたTV-Anytimeデフォルトの分類スキーマに準拠したTV-Anytimeのスキーマ、インスタンス文書を含む）たTV-Anytime Forum仕様に準拠したリソースは、登録した名前空間によって、一般的なインターネットに公開になることがありそして大でのインターネットの相互運用性の利点から得ることができます。"
    },
    {
      "indent": 3,
      "text": "b) Implementers of other specifications that incorporate components of the TV-Anytime specifications.",
      "ja": "B）たTV-Anytime仕様のコンポーネントを組み込むその他の仕様の実装者。"
    },
    {
      "indent": 6,
      "text": "URNs used to identify TV-Anytime components may be used to enable their inclusion in, and enhancement of, other specifications while maintaining, to a certain degree, interoperability with the TV-Anytime community (see a) above).",
      "ja": "たTV-Anytimeのコンポーネントを識別するために使用されるのURNにおけるそれらの包含を可能にするために使用され得る、およびその他の仕様の向上）上記（A参照）、ある程度、たTV-Anytimeコミュニティとの相互運用性を維持しつつ。"
    },
    {
      "indent": 3,
      "text": "c) Implementers of other semantically related specifications that do not directly incorporate components of the TV-Anytime specifications.",
      "ja": "C）を直接たTV-Anytime仕様のコンポーネントを組み込んでいない他の意味的に関連する仕様の実装者。"
    },
    {
      "indent": 6,
      "text": "URNs used to identify components of the TV-Anytime specifications, such as identifiers of terms within default Classification Schemes, may enable interoperation with other semantically determined specifications (including present and future metadata/resource description and ontology specifications) of relevance to TV-Anytime implementation communities (see a) and b) above).",
      "ja": "このようなデフォルトの分類スキーム内の用語の識別子としてたTV-Anytime仕様の構成要素を識別するために使用されるのURNは、TV-いつ実装に関連性の（現在および将来のメタデータ/リソース記述及びオントロジ仕様を含む）他の意味論的に決定された仕様との相互運用を可能にすることができますコミュニティは）（参照）およびb）上記。"
    },
    {
      "indent": 0,
      "text": "5. Namespace Considerations",
      "section_title": true,
      "ja": "5.名前空間の考慮事項"
    },
    {
      "indent": 3,
      "text": "This application requires a unique namespace because the assignment mechanism requires delegation to the TV-Anytime Forum. As a namespace used to identify components of the TV-Anytime specifications, the TV-Anytime Forum will manage the inter-relationship of the components and the uniqueness of the identifiers.",
      "ja": "割り当てメカニズムがたTV-Anytimeフォーラムへの委任を必要とするので、このアプリケーションは、一意の名前空間が必要です。たTV-Anytime仕様のコンポーネントを識別するために使用される名前空間として、たTV-Anytimeフォーラムは、コンポーネントの相互関係と識別子の一意性を管理します。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "There are no additional security considerations other than those normally associated with the use and resolution of URNs in general.",
      "ja": "通常、一般的なのURNの使用と解決に関連づけられたもの以外の追加のセキュリティの考慮事項はありません。"
    },
    {
      "indent": 0,
      "text": "Informative References",
      "ja": "参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC2141] Moats, R., \"URN Syntax\", RFC 2141, May 1997.",
      "ja": "[RFC2141]堀、R.、 \"URN構文\"、RFC 2141、1997年5月。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Wataru KAMEYAMA GITS, Waseda University 1011 Okuboyama, Nishi-tomida Honjo-shi, Saitama, 367-0035 JAPAN",
      "ja": "わたる かめやま ぎＴＳ、 わせだ うにゔぇｒしｔｙ １０１１ おくぼやま、 にしーとみだ ほんじょーし、 さいたま、 ３６７ー００３５ じゃぱん"
    },
    {
      "indent": 3,
      "text": "Phone: +81 495 24 6052 EMail: wataru@waseda.jp",
      "ja": "電話：+81 495 24 6052 Eメール：wataru@waseda.jp"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "ja": "著作権（C）インターネット協会（2005）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "この文書では、BCP 78に含まれる権利と許可と制限の適用を受けており、その中の記載を除いて、作者は彼らのすべての権利を保有します。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とCONTRIBUTOR「そのまま」、ORGANIZATION HE / SHEが表すまたはインターネットソサエティおよびインターネット・エンジニアリング・タスク・フォース放棄すべての保証、明示または、（もしあれば）後援ISに設けられています。黙示、情報の利用は、特定の目的に対する権利または商品性または適合性の黙示の保証を侵害しない任意の保証含むがこれらに限定されません。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、本書またはそのような権限下で、ライセンスがたりないかもしれない程度に記載された技術の実装や使用に関係すると主張される可能性があります任意の知的財産権やその他の権利の有効性または範囲に関していかなる位置を取りません利用可能です。またそれは、それがどのような権利を確認する独自の取り組みを行ったことを示すものでもありません。 RFC文書の権利に関する手続きの情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IPRの開示のコピーが利用できるようにIETF事務局とライセンスの保証に行われた、または本仕様の実装者または利用者がそのような所有権の使用のための一般的なライセンスまたは許可を取得するために作られた試みの結果を得ることができますhttp://www.ietf.org/iprのIETFのオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、その注意にこの標準を実装するために必要とされる技術をカバーすることができる任意の著作権、特許または特許出願、またはその他の所有権を持ってすべての利害関係者を招待します。 ietf-ipr@ietf.orgのIETFに情報を記述してください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}