{
  "title": {
    "text": "RFC 4405 - SMTP Service Extension for Indicating the Responsible Submitter of an E-Mail Message",
    "ja": "RFC 4405 - Eメールメッセージの責任提出者を示すためのSMTPサービス拡張"
  },
  "number": 4405,
  "created_at": "2019-10-24 14:50:21.083628+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                          E. Allman\nRequest for Comments: 4405                                Sendmail, Inc.\nCategory: Experimental                                           H. Katz\n                                                         Microsoft Corp.\n                                                              April 2006",
      "raw": true
    },
    {
      "indent": 7,
      "text": "                SMTP Service Extension for\nIndicating the Responsible Submitter of an E-Mail Message",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This memo defines an Experimental Protocol for the Internet community. It does not specify an Internet standard of any kind. Discussion and suggestions for improvement are requested. Distribution of this memo is unlimited.",
      "ja": "このメモはインターネットコミュニティのためにExperimentalプロトコルを定義します。それはどんな種類のインターネット標準を指定しません。改善のための議論や提案が要求されています。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2006).",
      "ja": "著作権（C）インターネット協会（2006）。"
    },
    {
      "indent": 0,
      "text": "IESG Note",
      "ja": "IESG注意"
    },
    {
      "indent": 3,
      "text": "The following documents (RFC 4405, RFC 4406, RFC 4407, and RFC 4408) are published simultaneously as Experimental RFCs, although there is no general technical consensus and efforts to reconcile the two approaches have failed. As such, these documents have not received full IETF review and are published \"AS-IS\" to document the different approaches as they were considered in the MARID working group.",
      "ja": "何の一般的な技術コンセンサスと失敗した二つのアプローチを調整するための努力はありませんが、以下の文書（RFC 4405、RFC 4406、RFC 4407、およびRFC 4408）は、実験的RFCとして同時に公開されています。このように、これらの文書は、完全なIETFレビューを受け取っていないと、彼らがMARIDワーキンググループで検討されたとして異なるアプローチを文書化するために、「AS-IS」に公開されています。"
    },
    {
      "indent": 3,
      "text": "The IESG takes no position about which approach is to be preferred and cautions the reader that there are serious open issues for each approach and concerns about using them in tandem. The IESG believes that documenting the different approaches does less harm than not documenting them.",
      "ja": "IESGはアプローチが好ましいとされ、それぞれのアプローチとタンデムでそれらを使用する方法についての懸念のための重大な未解決の問題があることを読者に警告するかについて何の位置を取りません。 IESGは異なるアプローチを文書化することは、それらを文書化していないよりも少ない害をすることを考えています。"
    },
    {
      "indent": 3,
      "text": "Note that the Sender ID experiment may use DNS records that may have been created for the current SPF experiment or earlier versions in this set of experiments. Depending on the content of the record, this may mean that Sender-ID heuristics would be applied incorrectly to a message. Depending on the actions associated by the recipient with those heuristics, the message may not be delivered or may be discarded on receipt.",
      "ja": "Sender IDの実験は、現在のSPF実験やこの一連の実験では、以前のバージョン用に作成されている可能性がDNSレコードを使用することができることに注意してください。レコードの内容によっては、これは、Sender-IDの経験則がメッセージに間違って適用されることを意味します。これらの経験則に受信者が関連するアクションに応じて、メッセージが配信されていないか、または領収書に破棄されることがあります。"
    },
    {
      "indent": 3,
      "text": "Participants relying on Sender ID experiment DNS records are warned that they may lose valid messages in this set of circumstances. Participants publishing SPF experiment DNS records should consider the advice given in section 3.4 of RFC 4406 and may wish to publish both v=spf1 and spf2.0 records to avoid the conflict.",
      "ja": "Sender IDの実験のDNSレコードに依存する参加者は、彼らは状況のこのセットに有効なメッセージを失う可能性があると警告しています。 SPF実験のDNSレコードを公開参加者は、RFC 4406のセクション3.4で与えられたアドバイスを検討すべきとの競合を避けるために、V = SPF1とspf2.0両方のレコードを公開することもできます。"
    },
    {
      "indent": 3,
      "text": "Participants in the Sender-ID experiment need to be aware that the way Resent-* header fields are used will result in failure to receive legitimate email when interacting with standards-compliant systems (specifically automatic forwarders which comply with the standards by not adding Resent-* headers, and systems which comply with RFC 822 but have not yet implemented RFC 2822 Resent-* semantics). It would be inappropriate to advance Sender-ID on the standards track without resolving this interoperability problem.",
      "ja": "送信者ID実験の参加者は、標準準拠のシステムはResent-を添加しないことにより、規格に準拠して（具体的には、自動フォワーダと相互作用するときにはResent- *ヘッダフィールドを使用する方法が正当な電子メールを受信するのに失敗をもたらすであろうことに注意する必要がRFC 822に準拠していますが、まだRFC 2822のResent- *セマンティクスを実装していない*ヘッダ、およびシステム）。この相互運用性の問題を解決せずに標準化過程の上送信者IDを進めるために不適切です。"
    },
    {
      "indent": 3,
      "text": "The community is invited to observe the success or failure of the two approaches during the two years following publication, in order that a community consensus can be reached in the future.",
      "ja": "コミュニティは、コミュニティの合意は、将来的に到達できるようにするために、公表後2年の間に2つのアプローチの成功または失敗を観察するために招待されます。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This memo defines an extension to the Simple Mail Transfer Protocol (SMTP) service that allows an SMTP client to specify the responsible submitter of an e-mail message. The responsible submitter is the e-mail address of the entity most recently responsible for introducing a message into the transport stream. This extension helps receiving e-mail servers efficiently determine whether the SMTP client is authorized to transmit mail on behalf of the responsible submitter's domain.",
      "ja": "このメモはSMTPクライアントが電子メールメッセージの責任の提出者を指定することができます簡易メール転送プロトコル（SMTP）サービスへの拡張を定義します。責任の提出者は、トランスポートストリームにメッセージを導入するための最も最近担当したエンティティの電子メールアドレスです。この拡張は、電子メールサーバーが効率的にSMTPクライアントを担当する送信者のドメインに代わってメールを送信するために許可されているかどうかを判断する受信できます。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n   1.1. Conventions Used in This Document ..........................4\n2. The SUBMITTER Service Extension .................................4\n3. The SUBMITTER Keyword of the EHLO Command .......................5\n4. The SUBMITTER Parameter of the MAIL Command .....................5\n   4.1. Setting the SUBMITTER Parameter Value ......................5\n   4.2. Processing the SUBMITTER Parameter .........................5\n   4.3. Transmitting to a Non-SUBMITTER-Aware SMTP Server ..........6\n5. Examples ........................................................6\n   5.1. Mail Submission ............................................7\n   5.2. Mail Forwarding ............................................7\n   5.3. Mobile User ................................................8\n   5.4. Guest E-Mail Service .......................................9\n   5.5. SUBMITTER Used on a Non-Delivery Report ...................11\n6. Security Considerations ........................................11\n7. Acknowledgements ...............................................12\n8. IANA Considerations ............................................12\n9. References .....................................................12\n   9.1. Normative References ......................................12",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "The practice of falsifying the identity of the sender of an e-mail message, commonly called \"spoofing\", is a prevalent tactic used by senders of unsolicited commercial e-mail, or \"spam\". This form of abuse has highlighted the need to improve identification of the \"responsible submitter\" of an e-mail message.",
      "ja": "一般的に「なりすまし」と呼ばれる電子メールメッセージの送信者の身元を偽っの実践は、迷惑な商用電子メール、または「スパム」の送信者によって使用される流行戦術です。虐待のこの形式は、電子メールメッセージの「責任ある提出者」の識別を改善する必要性を強調しています。"
    },
    {
      "indent": 3,
      "text": "In this specification, the responsible submitter is the entity most recently responsible for injecting a message into the e-mail transport stream. The e-mail address of the responsible submitter will be referred to as the Purported Responsible Address (PRA) of the message. The Purported Responsible Domain (PRD) is the domain portion of that address.",
      "ja": "本明細書では、責任の提出者は、最近の電子メールトランスポートストリームにメッセージを注入するための責任を負うエンティティです。責任提出者の電子メールアドレスは、メッセージの主張責任アドレス（PRA）と呼ぶことにします。自称責任ドメイン（PRD）はそのアドレスのドメイン部分です。"
    },
    {
      "indent": 3,
      "text": "This specification codifies rules for encoding the purported responsible address into the SMTP transport protocol. This will permit receiving SMTP servers to efficiently validate whether or not the SMTP client is authorized to transmit mail on behalf of the responsible submitter's domain.",
      "ja": "この仕様は、SMTPトランスポートプロトコルに主張責任のアドレスを符号化するためのルールを成文化。これは、効率的にSMTPクライアントを担当する送信者のドメインに代わってメールを送信するために許可されているかどうかを検証するためにSMTPサーバーを受信可能にします。"
    },
    {
      "indent": 3,
      "text": "Broadly speaking, there are two possible approaches for determining the purported responsible address: either from RFC 2821 [SMTP] protocol data or from RFC 2822 [MSG-FORMAT] message headers. Each approach has certain advantages and disadvantages.",
      "ja": "RFCから2821 [SMTP]プロトコル・データ又はRFC 2822から[MSG-FORMAT]メッセージヘッダのいずれか：大まかに言えば、主張責任アドレスを決定するための2つの可能なアプローチがあります。それぞれのアプローチは、特定の利点と欠点があります。"
    },
    {
      "indent": 3,
      "text": "Deriving the purported responsible domain from RFC 2821 data has the advantage that validation can be performed before the SMTP client has transmitted the message body. If spoofing is detected, then the SMTP server has the opportunity, depending upon local policy, to reject the message before it is ever transmitted. The disadvantage of this approach is the risk of false positives, that is, incorrectly concluding that the sender's e-mail address has been spoofed. There are today legitimate reasons why the Internet domain names used in RFC 2821 commands may be different from those of the sender of an e-mail message.",
      "ja": "RFC 2821のデータから主張責任ドメインを導出することは、SMTPクライアントは、メッセージ本体を送信する前に検証を行うことができる利点があります。なりすましが検出された場合、SMTPサーバーは、それが今までに送信される前に、メッセージを拒否するように、ローカルポリシーに応じて、機会を持っています。この方法の欠点は、間違って送信者の電子メールアドレスが詐称されていることを結論、つまり、偽陽性のリスクです。 RFC 2821回のコマンドで使用されるインターネットドメイン名は、電子メールメッセージの送信者のものとは異なる場合があり、なぜ今日の正当な理由があります。"
    },
    {
      "indent": 3,
      "text": "Deriving the purported responsible domain from RFC 2822 headers has the advantage that validation can usually be based on an identity that is displayed to recipients by existing Mail User Agents (MUAs) as the sender's identity. This aids in detection of a particularly noxious form of spoofing known as \"phishing\" in which a malicious sender attempts to fool a recipient into believing that a message originates from an entity well known to the recipient. This approach carries a lower risk of false positives since there are fewer legitimate reasons for RFC 2822 headers to differ from the true sender of the message. The disadvantage of this approach is that it does require parsing and analysis of message headers. In practice, much if not all the message body is also transmitted since the SMTP protocol described in RFC 2821 provides no mechanism to interrupt message transmission after the DATA command has been issued.",
      "ja": "RFC 2822ヘッダから主張責任ドメインを導出することは、検証は通常、送信者の身元などの既存のメールユーザエージェント（MUA）での受信者に表示されるアイデンティティに基づくことができるという利点があります。これは、悪意のある送信者は、メッセージが受信者によく知られている実体に由来することを信じるように受信者を欺くしようとする「フィッシング」として知られているなりすましの特に有害な形の検出に役立ちます。メッセージの真の送信者から異なるようにRFC 2822のヘッダーの少ない正当な理由があるので、このアプローチは、偽陽性の低いリスクを運びます。このアプローチの欠点は、メッセージヘッダの解析および分析を必要とするということです。 DATAコマンドが発行された後、RFC 2821に記載されたSMTPプロトコルがメッセージの送信を遮断するメカニズムを提供しないので、実際には、多くの場合ではないが、すべてのメッセージボディも送信されます。"
    },
    {
      "indent": 3,
      "text": "It is desirable to unify these two approaches in a way that combines the benefits of both while minimizing their respective disadvantages.",
      "ja": "それぞれの欠点を最小限に抑えながら、両方の利点を組み合わせた方法でこれらの二つのアプローチを統一することが望ましいです。"
    },
    {
      "indent": 3,
      "text": "This specification describes just such a unified approach. It uses the mechanism described in [SMTP] to describe an extension to the SMTP protocol. Using this extension, an SMTP client can specify the e-mail address of the entity most recently responsible for submitting the message to the SMTP client in a new SUBMITTER parameter of the SMTP MAIL command. SMTP servers can use this information to validate that the SMTP client is authorized to transmit e-mail on behalf of the Internet domain contained in the SUBMITTER parameter.",
      "ja": "この仕様は、まさにこのような統一されたアプローチを説明しています。これは、SMTPプロトコルの拡張機能を記述するために[SMTP]に記載の機構を使用します。この拡張機能を使用して、SMTPクライアントは、最近のSMTP MAILコマンドの新しいSUBMITTERパラメータでSMTPクライアントにメッセージを提出する責任主体の電子メールアドレスを指定することができます。 SMTPサーバはSMTPクライアントがSUBMITTERパラメータに含まれているインターネットドメインに代わって電子メールを送信するために許可されていることを検証するために、この情報を使用することができます。"
    },
    {
      "indent": 0,
      "text": "1.1. Conventions Used in This Document",
      "section_title": true,
      "ja": "1.1。このドキュメントの表記規則"
    },
    {
      "indent": 3,
      "text": "In examples, \"C:\" and \"S:\" indicate lines sent by the client and server, respectively.",
      "ja": "実施例において、「C：」および「S：」は、それぞれ、クライアントとサーバによって送信されたラインを示します。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [KEYWORDS].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はありますRFC 2119 [KEYWORDS]で説明されるように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. The SUBMITTER Service Extension",
      "section_title": true,
      "ja": "2. SUBMITTERサービス拡張"
    },
    {
      "indent": 3,
      "text": "The following SMTP service extension is hereby defined:",
      "ja": "以下のSMTPサービス拡張は、ここに定義されています。"
    },
    {
      "indent": 3,
      "text": "(1) The name of this SMTP service extension is \"Responsible Submitter\";",
      "ja": "（1）このSMTPサービス拡張の名前は「責任提出者」です。"
    },
    {
      "indent": 3,
      "text": "(2) The EHLO keyword value associated with this extension is \"SUBMITTER\";",
      "ja": "（2）この拡張子に関連付けられているEHLOキーワード値は「SUBMITTER」です。"
    },
    {
      "indent": 3,
      "text": "(3) The SUBMITTER keyword has no parameters;",
      "ja": "（3）SUBMITTERキーワードは、パラメータはありません。"
    },
    {
      "indent": 3,
      "text": "(4) No additional SMTP verbs are defined by this extension;",
      "ja": "（4）追加のSMTP動詞はこの拡張によって定義されていません。"
    },
    {
      "indent": 3,
      "text": "(5) An optional parameter is added to the MAIL command using the esmtp-keyword \"SUBMITTER\", and is used to specify the e-mail address of the entity responsible for submitting the message for delivery;",
      "ja": "（5）オプションのパラメータは、ESMTPキーワード「SUBMITTER」を使用してメールコマンドに追加され、配信のためのメッセージを提出する責任エンティティの電子メールアドレスを指定するために使用されます。"
    },
    {
      "indent": 3,
      "text": "(6) This extension is appropriate for the submission protocol [SUBMIT].",
      "ja": "（6）この拡張は、[登録]提出プロトコルのために適切です。"
    },
    {
      "indent": 0,
      "text": "3. The SUBMITTER Keyword of the EHLO Command",
      "section_title": true,
      "ja": "3. EHLOコマンドのSUBMITTERキーワード"
    },
    {
      "indent": 3,
      "text": "An SMTP server includes the SUBMITTER keyword in its EHLO response to tell the SMTP client that the SUBMITTER service extension is supported.",
      "ja": "SMTPサーバーは、SUBMITTERサービス拡張がサポートされているSMTPクライアントを伝えるためにそのEHLO応答にSUBMITTERキーワードが含まれています。"
    },
    {
      "indent": 3,
      "text": "The SUBMITTER keyword has no parameters.",
      "ja": "SUBMITTERキーワードにはパラメータはありません。"
    },
    {
      "indent": 0,
      "text": "4. The SUBMITTER Parameter of the MAIL Command",
      "section_title": true,
      "ja": "4. MAILコマンドのSUBMITTERパラメータ"
    },
    {
      "indent": 3,
      "text": "The syntax of the SUBMITTER parameter is",
      "ja": "SUBMITTERパラメータの構文は次のとおりです。"
    },
    {
      "indent": 6,
      "text": "\"SUBMITTER=\" Mailbox",
      "ja": "\"SUBMITTER =\" メールボックス"
    },
    {
      "indent": 3,
      "text": "where Mailbox is the Augmented Backus-Naur Form (ABNF) [ABNF] production defined in Section 4.1.2 of [SMTP]. Characters such as SP, \"+\", and \"=\" that may occur in Mailbox but are not permitted in ESMTP parameter values MUST be encoded as \"xtext\" as described in Section 4 of [DSN].",
      "ja": "メールボックスは、[SMTP]のセクション4.1.2で定義された拡張バッカス・ナウアフォーム（ABNF）[ABNF]生産です。 [DSN]のセクション4で説明したように、メールボックスで起こり得るが、ESMTPパラメータ値に許可されていないようなSP、「+」、および「=」などの文字は、「XTEXT」として符号化されなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.1. Setting the SUBMITTER Parameter Value",
      "section_title": true,
      "ja": "4.1。 SUBMITTERパラメータ値を設定します"
    },
    {
      "indent": 3,
      "text": "The purpose of the SUBMITTER parameter is to allow the SMTP client to indicate to the server the purported responsible address of the message directly in the RFC 2821 protocol.",
      "ja": "SUBMITTERパラメータの目的は、SMTPクライアントがサーバにRFC 2821プロトコルで直接メッセージの主張責任のアドレスを示すためにできるようにすることです。"
    },
    {
      "indent": 3,
      "text": "Therefore, SMTP clients that support the Responsible Submitter extension MUST include the SUBMITTER parameter on all messages. This includes messages containing a null reverse-path in the MAIL command.",
      "ja": "そのため、責任提出者の拡張をサポートするSMTPクライアントはすべてのメッセージにSUBMITTERパラメータを含まなければなりません。これは、MAILコマンドでヌルリバースパスを含むメッセージを含んでいます。"
    },
    {
      "indent": 3,
      "text": "SMTP clients MUST set the SUBMITTER parameter value to the purported responsible address of the message as defined in [PRA]. This also applies to messages containing a null reverse-path.",
      "ja": "[PRA]で定義されるようにSMTPクライアントは、メッセージの主張責任アドレスにSUBMITTERパラメータ値を設定しなければなりません。また、これはヌルリバースパスを含むメッセージに適用されます。"
    },
    {
      "indent": 3,
      "text": "In some circumstances, described in Section 7 of [SENDER-ID], SMTP clients may need to add RFC 2822 headers to the message in order to ensure that the correct SUBMITTER parameter value can be set.",
      "ja": "[SENDER-ID]のセクション7に記載されるいくつかの状況では、SMTPクライアントは正しいSUBMITTERパラメータ値を設定することができることを確実にするために、メッセージにRFC 2822のにヘッダを追加する必要があるかもしれません。"
    },
    {
      "indent": 0,
      "text": "4.2. Processing the SUBMITTER Parameter",
      "section_title": true,
      "ja": "4.2。 SUBMITTERパラメータの処理"
    },
    {
      "indent": 3,
      "text": "Receivers of e-mail messages sent with the SUBMITTER parameter SHOULD select the domain part of the SUBMITTER address value as the purported responsible domain of the message, and SHOULD perform such tests, including those defined in [SENDER-ID], as are deemed necessary to determine whether the connecting SMTP client is authorized to transmit e-mail messages on behalf of that domain.",
      "ja": "SUBMITTERパラメータで送信された電子メールメッセージの受信機はメッセージの主張担うドメインとしてSUBMITTERアドレス値のドメイン部分を選択する必要があり、必要とみなされるように、[SENDER-ID]で定義されたものを含めて、このようなテストを実行する必要接続するSMTPクライアントは、そのドメインに代わって電子メールメッセージを送信することを許可されているかどうかを判断します。"
    },
    {
      "indent": 3,
      "text": "If these tests indicate that the connecting SMTP client is not authorized to transmit e-mail messages on behalf of the SUBMITTER domain, the receiving SMTP server SHOULD reject the message and when rejecting MUST use \"550 5.7.1 Submitter not allowed.\"",
      "ja": "これらのテストは、接続しているSMTPクライアントがSUBMITTERドメインに代わって電子メールメッセージを送信することを許可されていないことを示している場合、受信側のSMTPサーバーは、メッセージを拒否すべきであり、使用しなければなら拒否したときに「550 5.7.1提出を許可されていません。」"
    },
    {
      "indent": 3,
      "text": "If the receiving SMTP server allows the connecting SMTP client to transmit message data, then the server SHOULD determine the purported responsible address of the message by examining the RFC 2822 message headers as described in [PRA]. If this purported responsible address does not match the address appearing in the SUBMITTER parameter, the receiving SMTP server MUST reject the message and when rejecting MUST use \"550 5.7.1 Submitter does not match header.\"",
      "ja": "受信SMTPサーバが接続しているSMTPクライアントは、メッセージデータの送信を許可する場合、サーバは[PRA]に記載されているようにRFC 2822メッセージヘッダーを調べることによって、メッセージの主張責任アドレスを決定する必要があります。この主張責任アドレスはSUBMITTERパラメータに現れるアドレスと一致しない場合、受信側のSMTPサーバーは、メッセージを拒絶しなければなりませんし、拒否するときは、使用しなければなりません「550 5.7.1提出者は、ヘッダと一致しません。」"
    },
    {
      "indent": 3,
      "text": "If no purported responsible address is found according to the procedure defined in [PRA], the SMTP server SHOULD reject the message and when rejecting MUST use \"554 5.7.7 Cannot verify submitter address.\"",
      "ja": "何の主張責任アドレスは[PRA]で定義された手順に従って、見つからない場合は、SMTPサーバーは、メッセージを拒否すべきであり、使用しなければなら拒否したときに「554 5.7.7は、提出者のアドレスを確認することはできません。」"
    },
    {
      "indent": 3,
      "text": "Verifying Mail Transfer Agents (MTAs) are strongly urged to validate the SUBMITTER parameter against the RFC 2822 headers; otherwise, an attacker can trivially defeat the algorithm.",
      "ja": "確認メール転送エージェント（MTA）強くRFC 2822ヘッダーに対してSUBMITTERパラメータを検証するために付勢されます。そうでない場合、攻撃者は、自明なアルゴリズムを倒すことができます。"
    },
    {
      "indent": 3,
      "text": "Note that the presence of the SUBMITTER parameter on the MAIL command MUST NOT change the effective reverse-path of a message. Any delivery status notifications must be sent to the reverse-path, if one exists, as per Section 3.7 of [SMTP] regardless of the presence of a SUBMITTER parameter. If the reverse-path is null, delivery status notifications MUST NOT be sent to the SUBMITTER address.",
      "ja": "MAILコマンドのSUBMITTERパラメータの存在は、メッセージの効果的な逆の経路を変更しない必要があります。一つは関係なく、SUBMITTERパラメータの存在の[SMTP]のセクション3.7に従って、存在する場合、任意の配信状態通知は、リバースパスに送信されなければなりません。リバースパスがnullの場合、配信状態通知をSUBMITTERアドレスに送ってはいけません。"
    },
    {
      "indent": 3,
      "text": "Likewise, the SUBMITTER parameter MUST NOT change the effective reply address of a message. Replies MUST be sent to the From address or the Reply-To address, if present, as described in Section 3.6.2 of [MSG-FORMAT] regardless of the presence of a SUBMITTER parameter.",
      "ja": "同様に、SUBMITTERパラメータには、メッセージの効果的な返信アドレスを変更しないでください。存在する場合、[MSG-FORMAT]のセクション3.6.2に記載のように応答にかかわらずSUBMITTERパラメータの存在、アドレスまたは返信先アドレスからに送信されなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.3. Transmitting to a Non-SUBMITTER-Aware SMTP Server",
      "section_title": true,
      "ja": "4.3。非SUBMITTER-AwareのSMTPサーバーに送信します"
    },
    {
      "indent": 3,
      "text": "Notwithstanding the provisions of Section 4.1 above, when an MTA transmits a message to another MTA that does not support the SUBMITTER extension, the forwarding MTA MUST transmit the message without the SUBMITTER parameter. This should involve no information loss, since the SUBMITTER parameter is required to contain information derived from the message headers.",
      "ja": "MTAはSUBMITTER拡張機能をサポートしていない別のMTAへメッセージを送信し、上記セクション4.1の規定にかかわらず、転送MTAはSUBMITTERパラメータなしでメッセージを送信しなければなりません。 SUBMITTERパラメータはメッセージヘッダから得られた情報を含有することが要求されるので、これは、何の情報損失を伴うべきではありません。"
    },
    {
      "indent": 0,
      "text": "5. Examples",
      "section_title": true,
      "ja": "5.例"
    },
    {
      "indent": 3,
      "text": "This section provides examples of how the SUBMITTER parameter would be used. The following dramatis personae appear in the examples: alice@example.com: the original sender of each e-mail message.",
      "ja": "このセクションでは、SUBMITTERパラメータが使用される方法の例を示します。 alice@example.com：次の登場人物は、例に表示された各電子メールメッセージの元の送信者を。"
    },
    {
      "indent": 3,
      "text": "bob@company.com.example: the final recipient of each e-mail.",
      "ja": "bob@company.com.example：各電子メールの最終受信者。"
    },
    {
      "indent": 3,
      "text": "bob@almamater.edu.example: an e-mail address used by Bob that he has configured to forward mail to his office account at bob@company.com.example.",
      "ja": "bob@almamater.edu.example：彼はbob@company.com.exampleで彼のオフィスのアカウントにメールを転送するように設定していることをボブが使用する電子メールアドレス。"
    },
    {
      "indent": 3,
      "text": "alice@mobile.net.example: an e-mail account provided to Alice by her mobile e-mail network carrier.",
      "ja": "alice@mobile.net.example：彼女の携帯電話の電子メールネットワークキャリアによってアリスに提供する電子メールアカウント。"
    },
    {
      "indent": 0,
      "text": "5.1. Mail Submission",
      "section_title": true,
      "ja": "5.1。メール発信"
    },
    {
      "indent": 3,
      "text": "Under normal circumstances, Alice would configure her MUA to submit her message to the mail system using the SUBMIT protocol [SUBMIT]. The MUA would transmit the message without the SUBMITTER parameter. The SUBMIT server would validate that the MUA is allowed to submit a message through some external scheme, perhaps SMTP Authentication [SMTPAUTH]. Under most circumstances, this would look like a normal, authenticated SMTP transaction. The SUBMIT server would extract her name from the RFC 2822 headers for use in the SUBMITTER parameters of subsequent transmissions of the message.",
      "ja": "通常の状況下では、アリスは、[SUBMIT] SUBMITプロトコルを使用してメールシステムに彼女のメッセージを送信するために彼女のMUAを設定します。 MUAはSUBMITTERパラメータを指定せずにメッセージを送信するであろう。 SUBMITサーバは、MUAが何らかの外部のスキーム、恐らくSMTP認証[SMTPAUTH]を介してメッセージを送信することが許可されていることを検証することになります。ほとんどの状況では、これは通常、認証されたSMTPトランザクションのようになります。サーバーは、メッセージの後続の送信のSUBMITTERパラメータで使用するためのRFC 2822ヘッダから彼女の名前を抽出しますSUBMIT。"
    },
    {
      "indent": 0,
      "text": "5.2. Mail Forwarding",
      "section_title": true,
      "ja": "5.2。メール転送"
    },
    {
      "indent": 3,
      "text": "When Alice sends a message to Bob at his almamater.edu.example account, the SMTP session from her SUBMIT server might look something like this:",
      "ja": "アリスは彼のalmamater.edu.exampleアカウントでボブにメッセージを送信すると、彼女からのSMTPセッションは、サーバが次のようになりますSUBMIT："
    },
    {
      "indent": 6,
      "text": "S: 220 almamater.edu.example ESMTP server ready C: EHLO example.com S: 250-almamater.edu.example S: 250-DSN S: 250-AUTH S: 250-SUBMITTER S: 250 SIZE C: MAIL FROM:<alice@example.com> SUBMITTER=alice@example.com S: 250 <alice@example.com> sender ok C: RCPT TO:<bob@almamater.edu.example> S: 250 <bob@almamater.edu.example> recipient ok C: DATA S: 354 okay, send message C: (message body goes here) C: . S: 250 message accepted C: QUIT S: 221 goodbye",
      "ja": "S：ESMTPサーバー準備C almamater.edu.example 220：EHLO example.com S：250 almamater.edu.example S：250-DSN S：250-AUTH S：250 SUBMITTER S：250 SIZE C：FROM MAIL： <alice@example.com> SUBMITTER=alice@example.com S：250 <alice@example.com>送信者OK C：RCPT TO：<bob@almamater.edu.example> S：250 <bob@almamater.edu。例>受信者OK C：データS：354大丈夫、メッセージCを送信します（メッセージ本文をここに）C：。 S：250メッセージ受け入れC：221別れ：Sを終了"
    },
    {
      "indent": 3,
      "text": "The almamater.edu.example MTA must now forward this message to bob@company.com.example. Although the original sender of the message is alice@example.com, Alice is not responsible for this most recent retransmission of the message. That role is filled by bob@almamater.edu.example, who established the forwarding of mail to bob@company.com.example. Therefore, the almamater.edu.example MTA determines a new purported responsible address for the message, namely, bob@almamater.edu.example, and sets the SUBMITTER parameter accordingly. The forwarding MTA also inserts a Resent-From header in the message body to ensure the purported responsible address derived from the RFC 2822 headers matches the SUBMITTER address.",
      "ja": "almamater.edu.example MTAは今bob@company.com.exampleにこのメッセージを転送する必要があります。メッセージの元の送信者がalice@example.comですが、アリスはメッセージのこの最も最近の再送信については責任を負いません。その役割はbob@company.com.exampleへのメールの転送を確立bob@almamater.edu.example、によって満たされています。したがって、almamater.edu.example MTAは、メッセージ、すなわち、bob@almamater.edu.exampleための新しい主張責任アドレスを決定し、それに応じSUBMITTERパラメータを設定します。転送MTAはまた、2822のヘッダがSUBMITTERアドレスと一致するRFCに由来主張責任アドレスを確保するために、メッセージ本文に憤慨-からヘッダを挿入します。"
    },
    {
      "indent": 6,
      "text": "S: 220 company.com.example ESMTP server ready C: EHLO almamater.edu.example S: 250-company.com.example S: 250-DSN S: 250-AUTH S: 250-SUBMITTER S: 250 SIZE C: MAIL FROM:<alice@example.com> SUBMITTER=bob@almamater.edu.example S: 250 <alice@example.com> sender ok C: RCPT TO:<bob@company.com.example> S: 250 <bob@company.com.example> recipient ok C: DATA S: 354 okay, send message C: Resent-From: bob@almamater.edu.example C: Received By: ... C: (message body goes here) C: . S: 250 message accepted C: QUIT S: 221 goodbye",
      "ja": "S：220 company.com.exampleのESMTPサーバーレディC：S almamater.edu.example EHLO：250 company.com.exampleのS：250-DSN S：250-AUTH S：250 SUBMITTER S：250 SIZE C：MAIL FROM：<alice@example.com> SUBMITTER=bob@almamater.edu.example S：250 <alice@example.com>送信者OK C：RCPT TO：<bob@company.com.example> S：250 <ボブ@ company.com.example>受信者OK C：データS：354大丈夫、メッセージCを送信：のResent-から：bob@almamater.edu.example C：... C：（メッセージ本文をここに）C：によって受信されています。 S：250メッセージ受け入れC：221別れ：Sを終了"
    },
    {
      "indent": 0,
      "text": "5.3. Mobile User",
      "section_title": true,
      "ja": "5.3。モバイルユーザー"
    },
    {
      "indent": 3,
      "text": "Alice is at the airport and uses her mobile e-mail device to send a message to Bob. The message travels through the carrier network provided by mobile.net.example, but Alice uses her example.com address on the From line of all her messages so that replies go to her office mailbox.",
      "ja": "アリスは、空港にあり、ボブにメッセージを送信するために彼女の携帯電話の電子メール装置を使用しています。メッセージはmobile.net.exampleが提供するキャリアネットワークを通過するが、応答が彼女のオフィスのメールボックスに行くように、アリスは彼女のすべてのメッセージのFrom行に彼女のexample.comアドレスを使用しています。"
    },
    {
      "indent": 3,
      "text": "Here is an example of the SMTP session between the MTAs at mobile.net.example and almamater.edu.example.",
      "ja": "ここでmobile.net.exampleとalmamater.edu.exampleでMTA間のSMTPセッションの例です。"
    },
    {
      "indent": 6,
      "text": "S: 220 almamater.edu.example ESMTP server ready C: EHLO mobile.net.example S: 250-almamater.edu.example S: 250-DSN S: 250-AUTH S: 250-SUBMITTER S: 250 SIZE C: MAIL FROM:<alice@example.com> SUBMITTER=alice@mobile.net.example S: 250 <alice@example.com> sender ok C: RCPT TO:<bob@almamater.edu.example> S: 250 <bob@almamater.edu.example> recipient ok C: DATA S: 354 okay, send message C: Sender: alice@mobile.net.example C: Received By: ... C: (message body goes here) C: . S: 250 message accepted C: QUIT S: 221 goodbye",
      "ja": "EHLO mobile.net.exampleのS：250 almamater.edu.example S：250-DSN S：250-AUTH S：250サブミッター・S：250サイズC：MAIL S：ESMTPサーバー準備C almamater.edu.example 220 FROM：<alice@example.com> SUBMITTER=alice@mobile.net.example S：250 <alice@example.com>送信者OK C：RCPT TO：<bob@almamater.edu.example> S：250 <ボブ@ almamater.edu.example>受信者OK C：データS：354大丈夫、メッセージCを送信：送信者：alice@mobile.net.exampleのC：... C：（メッセージ本文をここに）C：によって受信されています。 S：250メッセージ受け入れC：221別れ：Sを終了"
    },
    {
      "indent": 3,
      "text": "Note that mobile.net.example uses the SUBMITTER parameter to designate alice@mobile.net.example as the responsible submitter for this message. Further, this MTA also inserts a Sender header to ensure the purported responsible address derived from the RFC 2822 headers matches the SUBMITTER address.",
      "ja": "そのmobile.net.exampleこのメッセージの責任提出者としてalice@mobile.net.example指定するSUBMITTERパラメータを使用します。さらに、このMTAはまた、RFC 2822ヘッダーに由来主張責任アドレスがSUBMITTERアドレスと一致する保証するために、送信者ヘッダを挿入します。"
    },
    {
      "indent": 3,
      "text": "Likewise, conventional ISPs may also choose to use the SUBMITTER parameter to designate as the responsible submitter the user's address on the ISP's network if that address is different from the MAIL FROM address. This may be especially useful for ISPs that host multiple domains or otherwise share MTAs among multiple domains.",
      "ja": "同様に、従来のISPはまた、そのアドレスは、MAIL FROMアドレスと異なる場合に責任提出者としてISPのネットワーク上のユーザーのアドレスを指定するSUBMITTERパラメータを使用することもできます。これは、複数のドメイン間で複数のドメインまたは他の共有のMTAをホストするISPのために特に有用であり得ます。"
    },
    {
      "indent": 3,
      "text": "When the message is subsequently forwarded by the almamater.edu.example MTA, that MTA will replace the SUBMITTER parameter with bob@almamater.edu.example as in Section 5.2 and add its own Resent-From header.",
      "ja": "メッセージはその後almamater.edu.example MTAによって転送されると、MTAは、5.2節のようにbob@almamater.edu.exampleでSUBMITTERパラメータを交換し、ヘッダからのResent-、独自に追加すること。"
    },
    {
      "indent": 0,
      "text": "5.4. Guest E-Mail Service",
      "section_title": true,
      "ja": "5.4。ゲストEメールサービス"
    },
    {
      "indent": 3,
      "text": "While on a business trip, Alice uses the broadband access facilities provided by the Exemplar Hotel to connect to the Internet and send e-mail. The hotel routes all outbound e-mail through its own SMTP server, email.hotel.com.example.",
      "ja": "出張の間、アリスは、インターネットに接続して電子メールを送信するために模範ホテルが提供するブロードバンドアクセス機能を使用しています。ホテルルート独自のSMTPサーバー、email.hotel.com.exampleを介してすべての送信メール。"
    },
    {
      "indent": 3,
      "text": "The SMTP session for Alice's message to Bob from the Exemplar Hotel would look like this:",
      "ja": "模範ホテルからボブにアリスのメッセージのためのSMTPセッションは次のようになります。"
    },
    {
      "indent": 6,
      "text": "S: 220 almamater.edu.example ESMTP server ready C: EHLO email.hotel.com.example S: 250-almamater.edu.example S: 250-DSN S: 250-AUTH S: 250-SUBMITTER S: 250 SIZE C: MAIL FROM:<alice@example.com> SUBMITTER=guest.services@email.hotel.com.example S: 250 <alice@example.com> sender ok C: RCPT TO:<bob@almamater.edu.example> S: 250 <bob@almamater.edu.example> recipient ok C: DATA S: 354 okay, send message C: Resent-From: guest.services@email.hotel.com.example C: Received By: ... C: (message body goes here) C: . S: 250 message accepted C: QUIT S: 221 goodbye",
      "ja": "S email.hotel.com.example EHLO：250 almamater.edu.example S：250-DSN S：250-AUTH S：250 SUBMITTER S：250 SIZE C S：ESMTPサーバー準備C almamater.edu.example 220 <alice@example.com> SUBMITTER=guest.services@email.hotel.com.example S：250 <alice@example.com>送信者OK C：RCPT TO：<bob@almamater.edu.example> MAIL FROM： S：250 <bob@almamater.edu.example>受信者OK C：データS：354大丈夫、メッセージCを送信：のResent-から：guest.services@email.hotel.com.example C：... C：で受信したが：（メッセージ本文をここに）C：。 S：250メッセージ受け入れC：221別れ：Sを終了"
    },
    {
      "indent": 3,
      "text": "Note that email.hotel.com.example uses the SUBMITTER parameter to designate a generic account guest.services@email.hotel.com.example as the responsible submitter address for this message. A generic account is used since Alice herself does not have an account at that domain. Furthermore, this client also inserts a Resent-From header to ensure the purported responsible address derived from the RFC 2822 headers with the SUBMITTER address.",
      "ja": "email.hotel.com.exampleこのメッセージに責任提出者のアドレスとして、一般的なアカウントguest.services@email.hotel.com.exampleを指定するSUBMITTERパラメータを使用することに注意してください。アリス自身がそのドメインのアカウントを持っていないので、一般的なアカウントが使用されています。また、このクライアントはまた、サブミッター・アドレスをRFC 2822ヘッダーに由来主張責任アドレスを確実に再送-からヘッダを挿入します。"
    },
    {
      "indent": 3,
      "text": "As before, when the message is subsequently forwarded by the almamater.edu.example MTA, that MTA will replace the SUBMITTER parameter with bob@almamater.edu.example as in Section 5.2 and add its own Resent-From header.",
      "ja": "前と同様に、メッセージはその後MTAは、5.2節のようにbob@almamater.edu.exampleでSUBMITTERパラメータを交換し、独自のResent-からヘッダを追加すること、almamater.edu.example MTAによって転送されたとき。"
    },
    {
      "indent": 0,
      "text": "5.5. SUBMITTER Used on a Non-Delivery Report",
      "section_title": true,
      "ja": "5.5。配信不能レポートに使用されるSUBMITTER"
    },
    {
      "indent": 3,
      "text": "Alice sends an incorrectly addressed e-mail message and receives a non-delivery report from a SUBMITTER-compliant server.",
      "ja": "アリスは、誤った電子メールメッセージを送信し、対処SUBMITTER準拠のサーバーから配信不能レポートを受け取ります。"
    },
    {
      "indent": 6,
      "text": "S: 220 example.com ESMTP server ready C: EHLO almamater.edu.example S: 250-example.com S: 250-DSN S: 250-AUTH S: 250-SUBMITTER S: 250 SIZE C: MAIL FROM:<> SUBMITTER=mailer-daemon@almamater.edu.example S: 250 OK C: RCPT TO:<alice@example.com> S: 250 OK C: DATA S: 354 OK, send message C: (message body goes here) C: . S: 250 message accepted C: QUIT S: 221 goodbye",
      "ja": "S：220 example.com ESMTPサーバーレディC：EHLO S almamater.edu.example：250-example.com S：250-DSN S：250-AUTH S：250サブミッター・S：250サイズC：MAIL FROM：<> SUBMITTER=mailer-daemon@almamater.edu.example S：250 OK C：RCPT TO：<alice@example.com> S：250 OK C：DATA S：354 OK、メッセージCを送信します（メッセージボディがここに入ります）C ：。 S：250メッセージ受け入れC：221別れ：Sを終了"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "This extension provides an optimization to allow an SMTP client to identify the responsible submitter of an e-mail message in the SMTP protocol, and to enable SMTP servers to perform efficient validation of that identity before the message contents are transmitted.",
      "ja": "この拡張は、SMTPクライアントがSMTPプロトコルで電子メールメッセージの責任の提出者を識別できるようにすると、メッセージの内容が送信される前に、そのアイデンティティの効率的な検証を実行するためにSMTPサーバーを有効にするために最適化を提供します。"
    },
    {
      "indent": 3,
      "text": "It is, however, quite possible for an attacker to forge the value of the SUBMITTER parameter. Furthermore, it is possible for an attacker to transmit an e-mail message whose SUBMITTER parameter does not match the purported responsible address of the message as derived from the RFC 2822 headers. Therefore, the presence of the SUBMITTER parameter provides, by itself, no assurance of the authenticity of the message or the responsible submitter. Rather, the SUBMITTER parameter is intended to provide additional information to receiving e-mail systems to enable them to efficiently determine the validity of the responsible submitter, and specifically, whether the SMTP client is authorized to transmit e-mail on behalf of the purported responsible submitter's domain. Section 4.2 describes how receiving e-mail systems should process the SUBMITTER parameter.",
      "ja": "攻撃者はSUBMITTERパラメータの値を偽造することは、しかし、かなり可能です。攻撃者はそのSUBMITTERパラメータRFC 2822ヘッダーに由来するように、メッセージの主張責任アドレスと一致しない電子メールメッセージを送信するためにまた、可能です。したがって、SUBMITTERパラメータの存在は、それ自体で、メッセージまたは責任提出者の真正性の保証を提供しません。むしろ、SUBMITTERパラメータはSMTPクライアントが主張責任者に代わって電子メールを送信することを許可されているかどうか、特に効率的責任提出者の妥当性を判断するために、それらを可能にするために、電子メールの受信システムに追加情報を提供することを意図しており、送信者のドメイン。 4.2節は、受信電子メールシステムは、SUBMITTERパラメータを処理する方法を説明します。"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgements",
      "section_title": true,
      "ja": "7.謝辞"
    },
    {
      "indent": 3,
      "text": "The idea of an ESMTP extension to convey the identity of the responsible sender of an e-mail message has many progenitors. Nick Shelness suggested the idea in a private conversation with one of the authors. Pete Resnick suggested a variant on the MARID mailing list. The idea was also discussed on the Anti-Spam Research Group (ASRG) mailing list.",
      "ja": "電子メールメッセージの責任の送信者の身元を伝えるためにESMTP拡張のアイデアは、多くの前駆細胞を持っています。ニックShelnessは、著者の一人でプライベートな会話の中で考えを示唆しました。ピートレズニックはMARIDメーリングリスト上のバリアントを示唆しました。アイデアはまた、アンチスパム研究グループ（ASRG）メーリングリストで議論されました。"
    },
    {
      "indent": 3,
      "text": "The authors would also like to thank the participants of the MARID working group and the following individuals for their comments and suggestions, which greatly improved this document:",
      "ja": "著者らはまた、大幅にこの文書を改善MARIDワーキンググループの参加者とその意見や提案のために以下の個人を、感謝したいと思います："
    },
    {
      "indent": 6,
      "text": "Robert Atkinson, Simon Attwell, Roy Badami, Greg Connor, Dave Crocker, Matthew Elvey, Tony Finch, Ned Freed, Mark Lentczner, Jim Lyon, Bruce McMillan, Sam Neely, Daryl Odnert, Margaret Olson, Pete Resnick, Hector Santos, Nick Shelness, Rand Wacker, and Meng Weng Wong.",
      "ja": "ロバート・アトキンソン、サイモンAttwell、ロイBadami、グレッグコナー、デイブ・クロッカー、マシュー・Elvey、トニー・フィンチ、ネッドフリード、マーク・Lentczner、ジム・リヨン、ブルース・マクミラン、サム・ニーリー、ダリルOdnert、マーガレット・オルソン、ピート・レズニック、ヘクターサントス、ニックShelness 、ランドワッカー、そして孟ウェン・ウォン。"
    },
    {
      "indent": 0,
      "text": "8. IANA Considerations",
      "section_title": true,
      "ja": "8. IANAの考慮事項"
    },
    {
      "indent": 6,
      "text": "The IANA has registered the SUBMITTER SMTP service extension.",
      "ja": "IANAはSUBMITTERのSMTPサービス拡張を登録しています。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "ja": "9.参考文献"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "ja": "9.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[ABNF] Crocker, D. and P. Overell, \"Augmented BNF for Syntax Specifications: ABNF\", RFC 4234, October 2005.",
      "ja": "[ABNF]クロッカー、D.、およびP. Overell、 \"構文仕様のための増大しているBNF：ABNF\"、RFC 4234、2005年10月。"
    },
    {
      "indent": 3,
      "text": "[DSN] Moore, K., \"Simple Mail Transfer Protocol (SMTP) Service Extension for Delivery Status Notifications (DSNs)\", RFC 3461, January 2003.",
      "ja": "[DSN]ムーア、K.、 \"配信状態通知のための簡易メール転送プロトコル（SMTP）サービス拡張（DSNの）\"、RFC 3461、2003年1月。"
    },
    {
      "indent": 3,
      "text": "[KEYWORDS] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[キーワード]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[MSG-FORMAT] Resnick, P., \"Internet Message Format\", RFC 2822, April 2001.",
      "ja": "[MSG-FORMAT]レズニック、P.、 \"インターネットメッセージ形式\"、RFC 2822、2001年4月。"
    },
    {
      "indent": 3,
      "text": "[PRA] Lyon, J., \"Purported Responsible Address in E-Mail Messages\", RFC 4407, April 2006.",
      "ja": "[PRA]リヨン、J.、 \"Eメールメッセージで主張責任アドレス\"、RFC 4407、2006年4月。"
    },
    {
      "indent": 3,
      "text": "[SENDER-ID] Lyon, J. and M. Wong, \"Sender ID: Authenticating E-Mail\", RFC 4406, April 2006.",
      "ja": "[SENDER-ID]リヨン、J.とM.ウォン、 \"送信者ID：の認証Eメール\"、RFC 4406、2006年4月。"
    },
    {
      "indent": 3,
      "text": "[SUBMIT] Gellens, R. and J. Klensin, \"Message Submission for Mail\", RFC 4409, April 2006.",
      "ja": "[SUBMIT] Gellens、R.とJ. Klensin、 \"メールのメッセージの提出\"、RFC 4409、2006年4月。"
    },
    {
      "indent": 3,
      "text": "[SMTP] Klensin, J., \"Simple Mail Transfer Protocol\", RFC 2821, April 2001.",
      "ja": "[SMTP] Klensin、J.、 \"簡易メール転送プロトコル\"、RFC 2821、2001年4月。"
    },
    {
      "indent": 3,
      "text": "[SMTPAUTH] Myers, J., \"SMTP Service Extension for Authentication\", RFC 2554, March 1999.",
      "ja": "[SMTPAUTH]マイヤーズ、J.、 \"認証のためのSMTPサービス拡張子\"、RFC 2554、1999年3月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Eric Allman Sendmail, Inc. 6425 Christie Ave, Suite 400 Emeryville, CA 94608 USA",
      "ja": "エリック・オールマンのSendmail社6425クリスティアベニュー、スイート400エメリービル、CA 94608 USA"
    },
    {
      "indent": 3,
      "text": "EMail: eric@sendmail.com",
      "ja": "メールアドレス：eric@sendmail.com"
    },
    {
      "indent": 3,
      "text": "Harry Katz Microsoft Corp. 1 Microsoft Way Redmond, WA 98052 USA",
      "ja": "ハリー・カッツマイクロソフト社1マイクロソフト道、レッドモンド、WA 98052 USA"
    },
    {
      "indent": 3,
      "text": "EMail: hkatz@microsoft.com",
      "ja": "メールアドレス：hkatz@microsoft.com"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2006).",
      "ja": "著作権（C）インターネット協会（2006）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "この文書では、BCP 78に含まれる権利と許可と制限の適用を受けており、その中の記載を除いて、作者は彼らのすべての権利を保有します。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とCONTRIBUTOR「そのまま」、ORGANIZATION HE / SHEが表すまたはインターネットソサエティおよびインターネット・エンジニアリング・タスク・フォース放棄すべての保証、明示または、（もしあれば）後援ISに設けられています。黙示、情報の利用は、特定の目的に対する権利または商品性または適合性の黙示の保証を侵害しない任意の保証含むがこれらに限定されません。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、本書またはそのような権限下で、ライセンスがたりないかもしれない程度に記載された技術の実装や使用に関係すると主張される可能性があります任意の知的財産権やその他の権利の有効性または範囲に関していかなる位置を取りません利用可能です。またそれは、それがどのような権利を確認する独自の取り組みを行ったことを示すものでもありません。 RFC文書の権利に関する手続きの情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IPRの開示のコピーが利用できるようにIETF事務局とライセンスの保証に行われた、または本仕様の実装者または利用者がそのような所有権の使用のための一般的なライセンスまたは許可を取得するために作られた試みの結果を得ることができますhttp://www.ietf.org/iprのIETFのオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、その注意にこの標準を実装するために必要とされる技術をカバーすることができる任意の著作権、特許または特許出願、またはその他の所有権を持ってすべての利害関係者を招待します。 ietf-ipr@ietf.orgのIETFに情報を記述してください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "了承"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is provided by the IETF Administrative Support Activity (IASA).",
      "ja": "RFCエディタ機能のための資金は、IETF管理サポート活動（IASA）によって提供されます。"
    }
  ]
}