{
  "title": {
    "text": "RFC 4625 - Fibre Channel Routing Information MIB",
    "ja": "RFC 4625 - ファイバチャネルルーティング情報MIB"
  },
  "number": 4625,
  "created_at": "2019-10-24 02:52:12.387272+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                         C. DeSanti\nRequest for Comments: 4625                                 K. McCloghrie\nCategory: Standards Track                                  Cisco Systems\n                                                                 S. Kode\n                                                              Consultant\n                                                                  S. Gai\n                                                                 Retired\n                                                          September 2006",
      "raw": true
    },
    {
      "indent": 17,
      "text": "Fibre Channel Routing Information MIB",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2006).",
      "ja": "著作権（C）インターネット協会（2006）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This memo defines a portion of the Management Information Base (MIB) for use with network management protocols in the Internet community. In particular, it describes managed objects for information related to routing within a Fibre Channel fabric, which is independent of the usage of a particular routing protocol.",
      "ja": "このメモは、インターネットコミュニティでのネットワーク管理プロトコルで使用するための管理情報ベース（MIB）の一部を定義します。特に、特定のルーティングプロトコルの使用とは無関係であるファイバ・チャネル・ファブリック内のルーティングに関連する情報のための管理オブジェクトについて説明します。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n2. The Internet-Standard Management Framework ......................3\n3. Short Overview of Fibre Channel .................................3\n   3.1. Introduction ...............................................3\n   3.2. Routing Protocols ..........................................4\n   3.3. Virtual Fabrics ............................................4\n4. Relationship to Other MIBs ......................................5\n5. MIB Overview ....................................................5\n   5.1. Fibre Channel Management Instance ..........................5\n   5.2. Switch Index ...............................................6\n   5.3. Fabric Index ...............................................6\n   5.4. The t11FcRouteGroup Group ..................................6\n   5.5. The t11FcRouteTable's INDEX ................................6\n6. The T11-FC-ROUTE-MIB Module .....................................7\n7. Acknowledgements ...............................................17\n8. IANA Considerations ............................................17\n9. Security Considerations ........................................17\n10. Normative References ..........................................19\n11. Informative References ........................................20",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "This memo defines a portion of the Management Information Base (MIB) for use with network management protocols in the Internet community. In particular, it describes managed objects for information related to the Fibre Channel network's Routing Table for routing within a Fabric. Managed objects specific to particular routing protocols, such as the Fabric Shortest Path First (FSPF) protocol [FC-SW-4], are not specified in this MIB module.",
      "ja": "このメモは、インターネットコミュニティでのネットワーク管理プロトコルで使用するための管理情報ベース（MIB）の一部を定義します。特に、それは、ファブリック内のルーティングにファイバチャネルネットワークのルーティングテーブルに関連する情報を管理するオブジェクトについて説明します。このようなファブリック最短パス優先（FSPF）プロトコル[FC-SW-4]のような特定のルーティングプロトコルに特定の管理対象オブジェクトは、このMIBモジュールで指定されていません。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "ja": "この文書のキーワード \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", および \"OPTIONAL\" はRFC 2119 [RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. The Internet-Standard Management Framework",
      "section_title": true,
      "ja": "2.インターネット標準管理フレームワーク"
    },
    {
      "indent": 3,
      "text": "For a detailed overview of the documents that describe the current Internet-Standard Management Framework, please refer to section 7 of RFC 3410 [RFC3410].",
      "ja": "現在のインターネット標準の管理フレームワークを記述したドキュメントの詳細な概要については、RFC 3410 [RFC3410]のセクション7を参照してください。"
    },
    {
      "indent": 3,
      "text": "Managed objects are accessed via a virtual information store, termed the Management Information Base or MIB. MIB objects are generally accessed through the Simple Network Management Protocol (SNMP). Objects in the MIB are defined using the mechanisms defined in the Structure of Management Information (SMI). This memo specifies a MIB module that is compliant to the SMIv2, which is described in STD 58, RFC 2578 [RFC2578], STD 58, RFC 2579 [RFC2579] and STD 58, RFC 2580 [RFC2580].",
      "ja": "管理対象オブジェクトが仮想情報店を介してアクセスされ、管理情報ベースまたはMIBと呼ばれます。 MIBオブジェクトは、一般的に簡易ネットワーク管理プロトコル（SNMP）を介してアクセスされます。 MIBのオブジェクトは、管理情報（SMI）の構造で定義されたメカニズムを使用して定義されています。このメモは、STD 58、RFC 2578 [RFC2578]、STD 58、RFC 2579 [RFC2579]とSTD 58、RFC 2580 [RFC2580]に記載されているSMIv2のに準拠しているMIBモジュールを指定します。"
    },
    {
      "indent": 0,
      "text": "3. Short Overview of Fibre Channel",
      "section_title": true,
      "ja": "ファイバチャネルの3ショート概要"
    },
    {
      "indent": 0,
      "text": "3.1. Introduction",
      "section_title": true,
      "ja": "3.1。前書き"
    },
    {
      "indent": 3,
      "text": "The Fibre Channel (FC) is logically a bidirectional point-to-point serial data channel, structured for high performance. Fibre Channel provides a general transport vehicle for higher-level protocols, such as Small Computer System Interface (SCSI) command sets, the High-Performance Parallel Interface (HIPPI) data framing, IP (Internet Protocol), IEEE 802.2, and others.",
      "ja": "ファイバチャネル（FC）論理的に高い性能のために構成され、双方向ポイント・ツー・ポイントのシリアル・データ・チャンネルです。ファイバチャネルは、このような小型コンピュータシステムインタフェース（SCSI）コマンドセット、高性能パラレルインタフェース（HIPPI）データフレーミング、IP（インターネット・プロトコル）、IEEE 802.2、および他のような高レベルプロトコルのための一般的な輸送車両を提供します。"
    },
    {
      "indent": 3,
      "text": "Physically, Fibre Channel is an interconnection of multiple communication points, called N_Ports, interconnected either by a switching network, called a Fabric, or by a point-to-point link. A Fibre Channel \"node\" consists of one or more N_Ports. A Fabric may consist of multiple Interconnect Elements, some of which are switches. An N_Port connects to the Fabric via a port on a switch called an F_Port. When multiple FC nodes are connected to a single port on a switch via an \"Arbitrated Loop\" topology, the switch port is called an FL_Port, and the nodes' ports are called NL_Ports. The term Nx_Port is used to refer to either an N_Port or an NL_Port. The term Fx_Port is used to refer to either an F_Port or an FL_Port. A switch port, which is interconnected to another switch port via an Inter-Switch Link (ISL), is called an E_Port. A B_Port connects a bridge device with an E_Port on a switch; a B_Port provides a subset of E_Port functionality.",
      "ja": "物理的には、ファイバチャネルスイッチングネットワークによって、ファブリックと呼ばれ、またはポイントツーポイントリンクによって相互接続されたいずれかのN_ポートと呼ばれる複数の通信ポイントの相互接続です。ファイバーチャネル「ノード」は、一の以上のN_Portで構成されています。ファブリックスイッチでいくつかは、複数の相互接続素子、から構成されてもよいです。 Nポートは、Fポートと呼ばれるスイッチのポート経由でファブリックに接続します。複数のFCノードが「アービトレーテッドループ」トポロジーを介してスイッチ上の単一のポートに接続されている場合、スイッチポートはFLポートと呼ばれ、ノードのポートはNL_Portsと呼ばれます。長期たNx_Portは、NポートまたはNLポートのいずれかを参照するために使用されます。長期Fx_Portは、FポートまたはFLポートのいずれかを参照するために使用されます。スイッチ間リンク（ISL）を介して別のスイッチポートに相互接続されたスイッチポートは、Eポートと呼ばれています。 B_portと、スイッチ上のE_Portを有するブリッジ装置を接続します。 B_portとは、Eポート機能のサブセットを提供します。"
    },
    {
      "indent": 3,
      "text": "Many Fibre Channel components, including the fabric, each node, and most ports, have globally-unique names. These globally-unique names are typically formatted as World Wide Names (WWNs). More information on WWNs can be found in [FC-FS]. WWNs are expected to be persistent across agent and unit resets.",
      "ja": "ファブリック、各ノード、およびほとんどのポートを含む多くのファイバー・チャネル・コンポーネントは、グローバルにユニークな名前を持っています。これらのグローバルにユニークな名前は、通常のWWN（World Wide Name）としてフォーマットされています。 WWNの詳細については、[FC-FS]に見出すことができます。 WWNは、エージェントとユニットリセット間で永続的であることが予想されます。"
    },
    {
      "indent": 3,
      "text": "Fibre Channel frames contain 24-bit address identifiers that identify the frame's source and destination ports. Each FC port has both an address identifier and a WWN. When a fabric is in use, the FC address identifiers are dynamic and are assigned by a switch. Each octet of a 24-bit address represents a level in an address hierarchy, a Domain_ID being the highest level of the hierarchy.",
      "ja": "ファイバチャネルフレームは、フレームの送信元ポートと宛先ポートを識別する24ビットのアドレス識別子を含みます。各FCポートは、アドレス識別子とWWNの両方を有します。ファブリックが使用されている場合、FCアドレス識別子は、動的であり、スイッチによって割り当てられています。 24ビット・アドレスの各オクテットは、アドレス階層のレベル、階層の最上位レベルであるのDomain_IDを表します。"
    },
    {
      "indent": 0,
      "text": "3.2. Routing Protocols",
      "section_title": true,
      "ja": "3.2。ルーティングプロトコル"
    },
    {
      "indent": 3,
      "text": "The routing of frames within the Fabric is normally based on the standard routing protocol, called the Fabric Shortest Path First (FSPF) protocol. The operation of FSPF (or of any other routing protocol) allows a switch to generate and maintain its own routing table of how to forward frames it receives; i.e., a table in which to look up the destination address of a received frame in order to determine the best link by which to forward that frame towards its destination.",
      "ja": "ファブリック内のフレームのルーティングは、通常、標準的なルーティングプロトコルに基づいており、ファブリック最短パス優先（FSPF）プロトコルと呼ばれます。 FSPFの操作（または他の任意のルーティングプロトコル）は、スイッチが受信フレームを転送する方法の独自のルーティングテーブルを生成し、維持することを可能にします。すなわち、テーブルとは、その目的地に向かってそのフレームを転送することにより、最良のリンクを決定するために、受信したフレームの宛先アドレスをルックアップします。"
    },
    {
      "indent": 0,
      "text": "3.3. Virtual Fabrics",
      "section_title": true,
      "ja": "3.3。仮想ファブリック"
    },
    {
      "indent": 3,
      "text": "The latest standard for an interconnecting Fabric containing multiple Fabric Switch elements is [FC-SW-4] (which replaces the previous revision, [FC-SW-3]). [FC-SW-4] carries forward the existing specification for the operation of a single Fabric in a physical infrastructure, augmenting it with the definition of Virtual Fabrics and with the specification of how multiple Virtual Fabrics can operate within one (or more) physical infrastructures. The use of Virtual Fabrics provides for each frame to be tagged in its header to indicate which one of several Virtual Fabrics that frame is being transmitted on. All frames entering a particular \"Core Switch\" [FC-SW-4] (i.e., a physical switch) on the same Virtual Fabric are processed by the same \"Virtual Switch\" within that Core switch.",
      "ja": "複数のファブリックのスイッチ素子を含む相互接続ファブリックの最新の標準である[FC-SW-4]（以前のリビジョンを置き換え、[FC-SW-3]）。 [FC-SW-4]は、物理仮想ファブリックの定義と仮想ファブリックは、1つ（または複数）内で動作する方法の複数の仕様とそれを増強する、フォワード物理インフラストラクチャ内の単一のファブリックの動作のための既存の仕様を運びインフラ。各フレームは、フレームに送信されている複数の仮想ファブリックのどちらを示すために、そのヘッダにタグ付けするための仮想ファブリックの使用が提供されます。同じ仮想ファブリック上の特定の「コアスイッチ」[FC-SW-4]（すなわち、物理的なスイッチ）に入るすべてのフレームは、そのコアスイッチ内の同じ「仮想スイッチ」によって処理されます。"
    },
    {
      "indent": 0,
      "text": "4. Relationship to Other MIBs",
      "section_title": true,
      "ja": "その他のMIB 4.関係"
    },
    {
      "indent": 3,
      "text": "The first standardized MIB for Fibre Channel [RFC2837] was focussed on Fibre Channel switches. It is being replaced by the more generic Fibre Channel Management MIB [FC-MGMT], which defines basic information for Fibre Channel hosts and switches, including extensions to the standard IF-MIB [RFC2863] for Fibre Channel interfaces.",
      "ja": "ファイバチャネル[RFC2837]のための最初の標準化されたMIBは、ファイバチャネルスイッチに焦点を当てました。これは、ファイバチャネルインターフェイスのためのIF-MIB [RFC2863]規格の拡張を含むファイバ・チャネル・ホストとスイッチの基本的な情報を定義するより一般的なファイバ・チャネル管理MIB [FC-MGMT]によって置換されています。"
    },
    {
      "indent": 3,
      "text": "This MIB extends beyond [FC-MGMT] to cover the routing of traffic within a Fabric of a Fibre Channel network. The standard routing protocol for Fibre Channel is FSPF [FC-SW-4]. Another MIB [RFC4626] specifies management information specific to FSPF. This MIB contains routing information that is independent of FSPF (i.e., it would still apply even if a routing protocol other than FSPF were in use in the network).",
      "ja": "このMIBは、ファイバチャネルネットワークのファブリック内のトラフィックのルーティングを覆うように、[FC-MGMT]を越えて延びています。ファイバ・チャネルのための標準的なルーティングプロトコルはFSPF [FC-SW-4]です。別のMIB [RFC4626]はFSPFに特定の管理情報を指定します。このMIBは、（すなわち、それはまだFSPF以外のルーティングプロトコルは、ネットワーク内の使用されていた場合でも適用される）FSPFから独立しているルーティング情報を含んでいます。"
    },
    {
      "indent": 3,
      "text": "This MIB imports some common Textual Conventions from T11-TC-MIB, defined in [RFC4439].",
      "ja": "このMIBは、[RFC4439]で定義されたT11-TC-MIBから、いくつかの一般的なテキストの表記法をインポートします。"
    },
    {
      "indent": 0,
      "text": "5. MIB Overview",
      "section_title": true,
      "ja": "5. MIBの概要"
    },
    {
      "indent": 3,
      "text": "This MIB module provides the means for monitoring the operation of, and configuring some parameters of, one or more instances of the FSPF protocol. (Note that there are no definitions in this MIB module of \"managed actions\" that can be invoked via SNMP.)",
      "ja": "このMIBモジュールは、動作を監視し、FSPFプロトコルの1つ以上のインスタンスのいくつかのパラメータを設定するための手段を提供します。 （SNMP経由で呼び出すことができる「管理アクション」のこのMIBモジュールには定義が存在しないことに注意してください。）"
    },
    {
      "indent": 0,
      "text": "5.1. Fibre Channel Management Instance",
      "section_title": true,
      "ja": "5.1。ファイバチャネル管理インスタンス"
    },
    {
      "indent": 3,
      "text": "A Fibre Channel management instance is defined in [FC-MGMT] as a separable managed instance of Fibre Channel functionality. Fibre Channel functionality may be grouped into Fibre Channel management instances in whatever way is most convenient for the implementation(s). For example, one such grouping accommodates a single SNMP agent with multiple AgentX [RFC2741] sub-agents, each sub-agent implementing a different Fibre Channel management instance.",
      "ja": "ファイバチャネル管理インスタンスは、ファイバチャネル機能の分離管理インスタンスとして[FC-MGMT]で定義されています。ファイバチャネル機能は、どのような方法でのFibre Channel管理インスタンスにグループ化することができる実装（S）のための最も便利です。例えば、1つのそのようなグループ化は、複数のAgentX [RFC2741]サブ剤と単一のSNMPエージェントを収容し、各サブエージェントは、異なるファイバチャネル管理インスタンスを実装します。"
    },
    {
      "indent": 3,
      "text": "The object, fcmInstanceIndex, is IMPORTed from the FC-MGMT-MIB [FC-MGMT] as the index value that uniquely identifies each Fibre Channel management instance within the same SNMP context ([RFC3411], Section 3.3.1).",
      "ja": "オブジェクト、fcmInstanceIndexは、一意同じSNMPコンテキスト（[RFC3411]、セクション3.3.1）内の各ファイバチャネル管理インスタンスを識別するインデックス値としてFC-MGMT-MIB [FC-MGMT]からインポートされています。"
    },
    {
      "indent": 0,
      "text": "5.2. Switch Index",
      "section_title": true,
      "ja": "5.2。スイッチのインデックス"
    },
    {
      "indent": 3,
      "text": "The FC-MGMT-MIB [FC-MGMT] defines the fcmSwitchTable as a table of information about Fibre Channel switches that are managed by Fibre Channel management instances. Each Fibre Channel management instance can manage one or more Fibre Channel switches. The Switch Index, fcmSwitchIndex, is IMPORTed from the FC-MGMT-MIB as the index value that uniquely identifies a Fibre Channel switch among those (one or more) managed by the same Fibre Channel management instance.",
      "ja": "FC-MGMT-MIB [FC-MGMT]は、ファイバチャネル管理インスタンスによって管理されているファイバチャネルスイッチに関する情報のテーブルとしてfcmSwitchTableを定義します。各ファイバチャネル管理インスタンスは、1つのまたは複数のファイバチャネルスイッチを管理することができます。スイッチインデックス、fcmSwitchIndexは、一意に同じファイバチャネル管理インスタンスによって管理されるもの（一つ以上）の間でファイバチャネルスイッチを特定するインデックス値としてFC-MGMT-MIBからインポートされています。"
    },
    {
      "indent": 0,
      "text": "5.3. Fabric Index",
      "section_title": true,
      "ja": "5.3。ファブリックインデックス"
    },
    {
      "indent": 3,
      "text": "Whether operating on a physical Fabric (i.e., without Virtual Fabrics) or within a Virtual Fabric, the operation of FSPF within a Fabric is identical. Therefore, this MIB defines all Fabric-related information in tables that are INDEX-ed by an arbitrary integer, named a \"Fabric Index\", the syntax of which is IMPORTed from the T11-TC-MIB. When a device is connected to a single physical Fabric, without use of any virtual Fabrics, the value of this Fabric Index will always be 1. In an environment of multiple virtual and/or physical Fabrics, this index provides a means to distinguish one Fabric from another.",
      "ja": "物理ファブリック（すなわち、仮想ファブリックせず）上または仮想ファブリック内で動作しているかどうか、ファブリック内FSPFの動作は同じです。したがって、このMIBは、「ファブリックインデックス」、T11-TC-MIBからインポートされた構文名前の任意の整数で-INDEX編されているテーブル内のすべてのファブリックに関連する情報を定義します。デバイスは、任意の仮想ファブリックを使用することなく、単一の物理ファブリックに接続されている場合、この布インデックスの値は、常に複数の仮想及び/又は物理的なファブリックの環境では1になり、このインデックスは、一のファブリックを区別するための手段を提供します他から。"
    },
    {
      "indent": 3,
      "text": "It is quite possible, and may even be likely, that a Fibre Channel switch will have ports connected to multiple virtual and/or physical Fabrics. Thus, in order to simplify a management protocol query concerning all the Fabrics to which a single switch is connected, fcmSwitchIndex will be listed before t11FcRouteFabricIndex when they both appear in the same INDEX clause.",
      "ja": "これは、ファイバチャネルスイッチは、複数の仮想および/または物理的なファブリックに接続されたポートを持っていることを、かなり可能であり、さらに可能性が高いです。両者が同じINDEX節に現れるときしたがって、単一のスイッチが接続されたすべてのファブリックに関する管理プロトコルのクエリを簡単にするために、fcmSwitchIndexはt11FcRouteFabricIndex前に表示されます。"
    },
    {
      "indent": 0,
      "text": "5.4. The t11FcRouteGroup Group",
      "section_title": true,
      "ja": "5.4。 t11FcRouteGroupグループ"
    },
    {
      "indent": 3,
      "text": "This MIB contains one object group, the t11FcRouteGroup, which contains objects to allow the displaying and the configuring of routes in the Fibre Channel Routing tables for the locally managed switches.",
      "ja": "このMIBは、表示およびローカル管理スイッチのファイバチャネルルーティングテーブル内のルートの設定を可能にするためのオブジェクトが含まれている1つのオブジェクトグループ、t11FcRouteGroupが含まれています。"
    },
    {
      "indent": 0,
      "text": "5.5. The t11FcRouteTable's INDEX",
      "section_title": true,
      "ja": "5.5。 t11FcRouteTableのINDEX"
    },
    {
      "indent": 3,
      "text": "It is normally valuable for a MIB table that contains routes to be ordered such that a management application is able to query the table based on some attribute, without having to read every row in the MIB table. This requires that the rows in the table be ordered according to such attributes, and thus that those attributes be represented by objects included in the table's INDEX clause. Examples of this can be seen in the ipCidrRouteTable [RFC2096] and, more recently, the inetCidrRouteTable in [RFC4292].",
      "ja": "ルートが含まれているMIBテーブルの管理アプリケーションは、MIBテーブルのすべての行を読み取るすることなく、いくつかの属性に基づいて、テーブルを照会することができるように注文する通常価値があります。これは、テーブル内の行は、このような属性に応じて発注されている必要がありますので、それらの属性は、テーブルのINDEX句に含まれるオブジェクトによって表現されていること。この例は、[RFC4292]にinetCidrRouteTable、より最近、ipCidrRouteTable [RFC2096]に見られることができます。"
    },
    {
      "indent": 3,
      "text": "While this useful feature results in an unusually large number (ten) of objects in the t11FcRouteTable's INDEX clause, all ten are either integers or strings of 3 (or zero) octet length, so the resulting OIDs are not unusually large. (Specifically, the aggregate number of sub-identifiers to be appended to an OBJECT-TYPE's OID, when naming an instance of an object in the t11FcRouteTable, is at most 22 sub-identifiers; i.e., less than the *minimum* number to be appended for the inetCidrRouteTable table.)",
      "ja": "t11FcRouteTableのINDEX句のオブジェクトの非常に大きな数（10）で、この便利な機能の結果が、全て10のいずれかの整数、または3（またはゼロ）オクテット長の文字列があるので、得られたOIDは異常に大きくありません。 t11FcRouteTable内のオブジェクトのインスタンスを命名する場合（具体的には、OBJECT-TYPEのOIDに付加される副識別子の総数は、最大で22のサブ識別子である; *最小*数よりすなわち、小さくなるようにinetCidrRouteTableテーブルの添付）。"
    },
    {
      "indent": 0,
      "text": "6. The T11-FC-ROUTE-MIB Module",
      "section_title": true,
      "ja": "6. T11-FC-ROUTE-MIBモジュール"
    },
    {
      "indent": 0,
      "text": "T11-FC-ROUTE-MIB DEFINITIONS ::= BEGIN",
      "raw": true
    },
    {
      "indent": 0,
      "text": "IMPORTS MODULE-IDENTITY, OBJECT-TYPE, Unsigned32, mib-2 FROM SNMPv2-SMI -- [RFC2578] MODULE-COMPLIANCE, OBJECT-GROUP FROM SNMPv2-CONF -- [RFC2580] RowStatus, TimeStamp, StorageType FROM SNMPv2-TC -- [RFC2579] InterfaceIndex, InterfaceIndexOrZero FROM IF-MIB -- [RFC2863] fcmInstanceIndex, fcmSwitchIndex, FcAddressIdOrZero, FcDomainIdOrZero FROM FC-MGMT-MIB -- [FC-MGMT] T11FabricIndex FROM T11-TC-MIB; -- [RFC4439]",
      "ja": "SNMPv2-SMIからの輸入MODULE-IDENTITY、OBJECT-TYPE、Unsigned32の、MIB-2  -  [RFC2578] MODULE-COMPLIANCE、オブジェクト・グループのSNMPv2-CONF FROM  -  [RFC2580]のRowStatus、タイムスタンプのSNMPv2-TC FROM StorageType  - [RFC2579] InterfaceIndexの、InterfaceIndexOrZeroのFROM IF-MIB  -  [RFC2863] fcmInstanceIndex、FC-MGMT-MIBからfcmSwitchIndex、FcAddressIdOrZero、FcDomainIdOrZero  -  [FC-MGMT] T11-TC-MIBからT11FabricIndex。 -  [RFC4439]"
    },
    {
      "indent": 0,
      "text": "t11FcRouteMIB MODULE-IDENTITY LAST-UPDATED \"200608140000Z\" ORGANIZATION \"T11\" CONTACT-INFO \" Claudio DeSanti Cisco Systems, Inc. 170 West Tasman Drive San Jose, CA 95134 USA EMail: cds@cisco.com",
      "ja": "t11FcRouteMIBのMODULE-IDENTITY LAST-UPDATED \"200608140000Z\" ORGANIZATION \"T11\" CONTACT-INFO「クラウディオDeSantiシスコシステムズ、株式会社170西タスマン・ドライブサンノゼ、CA 95134 USA電子メール：cds@cisco.com"
    },
    {
      "indent": 4,
      "text": "                Keith McCloghrie\n                Cisco Systems, Inc.\n                170 West Tasman Drive\n                San Jose, CA USA 95134\n                Email: kzm@cisco.com\"\nDESCRIPTION\n       \"The MIB module for configuring and displaying Fibre\n       Channel Route Information.",
      "raw": true
    },
    {
      "indent": 4,
      "text": " Copyright (C) The Internet Society (2006). This version of this MIB module is part of RFC 4625; see the RFC itself for full legal notices.\" REVISION \"200608140000Z\"",
      "ja": "著作権（C）インターネット協会（2006）。このMIBモジュールのこのバージョンはRFC 4625の一部です。完全な適法な通知についてはRFC自体を参照してください。」REVISION 『200608140000Z』"
    },
    {
      "indent": 4,
      "text": "DESCRIPTION \"Initial version of this MIB module, published as RFC4625.\"",
      "ja": "DESCRIPTION「RFC4625として発行され、このMIBモジュールの初期バージョン。」"
    },
    {
      "indent": 4,
      "text": "::= {mib-2 144 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "t11FcRouteNotifications OBJECT IDENTIFIER ::= { t11FcRouteMIB 0 }\nt11FcRouteObjects       OBJECT IDENTIFIER ::= { t11FcRouteMIB 1 }\nt11FcRouteConformance   OBJECT IDENTIFIER ::= { t11FcRouteMIB 2 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "--\n-- Per-Fabric routing information\n--\nt11FcRouteFabricTable OBJECT-TYPE\n    SYNTAX      SEQUENCE OF T11FcRouteFabricEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n           \"The table containing Fibre Channel Routing information\n           that is specific to a Fabric.\"\n    ::= { t11FcRouteObjects 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "t11FcRouteFabricEntry OBJECT-TYPE\n    SYNTAX      T11FcRouteFabricEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n           \"Each entry contains routing information specific to a\n           particular Fabric on a particular switch (identified by\n           values of fcmInstanceIndex and fcmSwitchIndex).\"\n    INDEX      { fcmInstanceIndex, fcmSwitchIndex,\n                 t11FcRouteFabricIndex }\n    ::= { t11FcRouteFabricTable 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "T11FcRouteFabricEntry ::=\n    SEQUENCE {\n        t11FcRouteFabricIndex      T11FabricIndex,\n        t11FcRouteFabricLastChange TimeStamp\n    }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "t11FcRouteFabricIndex OBJECT-TYPE SYNTAX T11FabricIndex MAX-ACCESS not-accessible STATUS current DESCRIPTION \"A unique index value that uniquely identifies a particular Fabric.",
      "ja": "t11FcRouteFabricIndex OBJECT-TYPE構文T11FabricIndex MAX-ACCESSステータス現在の説明「特定のファブリックを識別する一意のインデックス値。"
    },
    {
      "indent": 11,
      "text": "In a Fabric conformant to FC-SW-3, only a single Fabric can operate within a physical infrastructure, and thus\nthe value of this Fabric Index will always be 1.",
      "raw": true
    },
    {
      "indent": 4,
      "text": "       In a Fabric conformant to FC-SW-4, multiple Virtual Fabrics\n       can operate within one (or more) physical infrastructures.\n       In such a case, index value is used to uniquely identify a\n       particular Fabric within a physical infrastructure.\"\n::= { t11FcRouteFabricEntry 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "t11FcRouteFabricLastChange OBJECT-TYPE SYNTAX TimeStamp MAX-ACCESS read-only STATUS current DESCRIPTION \"The value of sysUpTime at the most recent time when any corresponding row in the t11FcRouteTable was created, modified, or deleted. A corresponding row in the t11FcRouteTable is for the same management instance, the same switch, and same Fabric as the row in this table.",
      "ja": "t11FcRouteFabricLastChange OBJECT-TYPE構文タイムスタンプMAX-ACCESS read-only説明「t11FcRouteTable内の任意の対応する行を作成、変更、または削除された最新の値のsysUpTime。t11FcRouteTableの対応する行が同じためであります管理インスタンス、同じスイッチ、及びこの表の行と同じファブリック。"
    },
    {
      "indent": 4,
      "text": "       If no change has occurred since the last restart of the\n       management system, then the value of this object is 0.\"\n::= { t11FcRouteFabricEntry 2 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "-- -- Fibre Channel Routing table -- t11FcRouteTable OBJECT-TYPE SYNTAX SEQUENCE OF T11FcRouteEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"The Fibre Channel Routing tables for the locally managed switches. This table lists all the routes that are configured in and/or computed by any local switch for any Fabric.",
      "ja": " -   - ファイバチャネルルーティングテーブル -  T11FcRouteEntry MAX-ACCESSステータスOF t11FcRouteTable OBJECT-TYPE構文配列現在の説明「ローカルで管理スイッチのファイバチャネルルーティングテーブルこの表で構成されているすべてのルートと。 /または任意のファブリックのための任意のローカルスイッチによって計算。"
    },
    {
      "indent": 11,
      "text": "Such routes are used by a switch to forward frames (of user\ndata) on a Fabric.  The conceptual process is based on\nextracting the Destination Fibre Channel Address Identifier\n(D_ID) out of a received frame (of user data) and comparing\nit to each entry of this table that is applicable to the\ngiven switch and Fabric.  Such comparison consists of first\nperforming a logical-AND of the extracted D_ID with a mask\n(the value of t11FcRouteDestMask) and second comparing the\nresult of that 'AND' operation to the value of\nt11FcRouteDestAddrId.  A similar comparison is made of the\nSource Fibre Channel Address Identifier (S_ID) of a frame against the t11FcRouteSrcAddrId and t11FcRouteSrcMask values\nof an entry.  If an entry's value of t11FcRouteInInterface\nis non-zero, then a further comparison determines if the\nframe was received on the appropriate interface.  If all of\nthese comparisons for a particular entry are successful,\nthen that entry represents a potential route for forwarding\nthe received frame.",
      "raw": true
    },
    {
      "indent": 4,
      "text": "       For entries configured by a user, t11FcRouteProto has\n       the value 'netmgmt'; only entries of this type can be\n       deleted by the user.\"\n::= { t11FcRouteObjects 2 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "t11FcRouteEntry OBJECT-TYPE\n    SYNTAX      T11FcRouteEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n           \"Each entry contains a route to a particular destination,\n           possibly from a particular subset of source addresses,\n           on a particular Fabric via a particular output interface\n           and learned in a particular manner.\"\n    INDEX       { fcmInstanceIndex, fcmSwitchIndex,\n                  t11FcRouteFabricIndex,\n                  t11FcRouteDestAddrId, t11FcRouteDestMask,\n                  t11FcRouteSrcAddrId, t11FcRouteSrcMask,\n                  t11FcRouteInInterface, t11FcRouteProto,\n                  t11FcRouteOutInterface }\n    ::= { t11FcRouteTable 1 }\nT11FcRouteEntry ::=\n    SEQUENCE {\n        t11FcRouteDestAddrId   FcAddressIdOrZero,\n        t11FcRouteDestMask     FcAddressIdOrZero,\n        t11FcRouteSrcAddrId    FcAddressIdOrZero,\n        t11FcRouteSrcMask      FcAddressIdOrZero,\n        t11FcRouteInInterface  InterfaceIndexOrZero,\n        t11FcRouteProto        INTEGER,\n        t11FcRouteOutInterface InterfaceIndex,\n        t11FcRouteDomainId     FcDomainIdOrZero,\n        t11FcRouteMetric       Unsigned32,\n        t11FcRouteType         INTEGER,\n        t11FcRouteIfDown       INTEGER,\n        t11FcRouteStorageType  StorageType,\n        t11FcRouteRowStatus    RowStatus\n    }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "t11FcRouteDestAddrId OBJECT-TYPE SYNTAX FcAddressIdOrZero (SIZE (3))",
      "ja": "t11FcRouteDestAddrIdのOBJECT-TYPE SYNTAX FcAddressIdOrZero（SIZE（3））"
    },
    {
      "indent": 4,
      "text": "MAX-ACCESS  not-accessible\nSTATUS      current\nDESCRIPTION\n       \"The destination Fibre Channel Address Identifier of\n       this route.  A zero-length string for this field is\n       not allowed.\"\n::= { t11FcRouteEntry 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "t11FcRouteDestMask OBJECT-TYPE\n    SYNTAX      FcAddressIdOrZero\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n           \"The mask to be logical-ANDed with a destination\n           Fibre Channel Address Identifier before it is compared\n           to the value in the t11FcRouteDestAddrId field.\n           Allowed values are 255.255.255, 255.255.0, or 255.0.0.\n           FSPF's definition generates routes to a Domain_ID,\n           so the mask for all FSPF-generated routes is 255.0.0.\n           The zero-length value has the same meaning as 0.0.0.\"\n    ::= { t11FcRouteEntry 2 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "t11FcRouteSrcAddrId OBJECT-TYPE\n    SYNTAX      FcAddressIdOrZero\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n           \"The source Fibre Channel Address Identifier of this\n           route.  Note that if this object and the corresponding\n           instance of t11FcRouteSrcMask both have a value of 0.0.0,\n           then this route matches all source addresses.  The\n           zero-length value has the same meaning as 0.0.0.\"\n    ::= { t11FcRouteEntry 3 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "t11FcRouteSrcMask OBJECT-TYPE\n    SYNTAX      FcAddressIdOrZero\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n           \"The mask to be logical-ANDed with a source\n           Fibre Channel Address Identifier before it is compared\n           to the value in the t11FcRouteSrcAddrId field.  Allowed\n           values are 255.255.255, 255.255.0, 255.0.0, or 0.0.0.\n           The zero-length value has the same meaning as 0.0.0.\"\n    ::= { t11FcRouteEntry 4 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "t11FcRouteInInterface OBJECT-TYPE SYNTAX InterfaceIndexOrZero",
      "ja": "t11FcRouteInInterfaceのOBJECT-TYPE SYNTAX InterfaceIndexOrZeroの"
    },
    {
      "indent": 4,
      "text": "MAX-ACCESS  not-accessible\nSTATUS      current\nDESCRIPTION\n       \"If the value of this object is non-zero, it is the\n       value of ifIndex that identifies the local\n       Fibre Channel interface through which a frame\n       must have been received in order to match with\n       this entry.  If the value of this object is zero,\n       the matching does not require that the frame be\n       received on any specific interface.\"\n::= { t11FcRouteEntry 5 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "t11FcRouteProto OBJECT-TYPE\n    SYNTAX   INTEGER {\n                 other(1),\n                 local(2),\n                 netmgmt(3),\n                 fspf(4)\n              }\n    MAX-ACCESS not-accessible\n    STATUS   current\n    DESCRIPTION\n           \"The mechanism via which this route was learned:\n                other(1)  - not specified\n                local(2)  - local interface\n                netmgmt(3)- static route\n                fspf(4)   - Fibre Shortest Path First\n           \"\n    ::= { t11FcRouteEntry 6 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "t11FcRouteOutInterface OBJECT-TYPE\n    SYNTAX      InterfaceIndex\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n           \"The value of ifIndex that identifies the local\n           Fibre Channel interface through which the next hop\n           of this route is to be reached.\"\n    ::= { t11FcRouteEntry 7 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "t11FcRouteDomainId OBJECT-TYPE SYNTAX FcDomainIdOrZero MAX-ACCESS read-create STATUS current DESCRIPTION \"The domain_ID of next hop switch.",
      "ja": "t11FcRouteDomainId OBJECT-TYPE SYNTAX FcDomainIdOrZero MAX-ACCESSはリード作成しますステータス現在の説明は「ネクストホップスイッチのdomain_IDを。"
    },
    {
      "indent": 4,
      "text": "       This object can have a value of zero if the value of t11FcRouteProto is 'local'.\"\n::= { t11FcRouteEntry 8 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "t11FcRouteMetric OBJECT-TYPE SYNTAX Unsigned32 (0..65536) MAX-ACCESS read-create STATUS current DESCRIPTION \"The routing metric for this route.",
      "ja": "t11FcRouteMetric OBJECT-TYPE構文Unsigned32（0 65536）MAX-ACCESSリード作成ステータス現在の説明「このルートのルーティングメトリック。"
    },
    {
      "indent": 4,
      "text": "       The use of this object is dependent on t11FcRouteProto.\"\n::= { t11FcRouteEntry 9 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "t11FcRouteType OBJECT-TYPE SYNTAX INTEGER { local(1), remote(2) } MAX-ACCESS read-create STATUS current DESCRIPTION \"The type of route.",
      "ja": "t11FcRouteType OBJECT-TYPE SYNTAX INTEGER {ローカル（1）リモート（2）} MAX-ACCESSリード作成ステータス現在の説明「ルートの種類。"
    },
    {
      "indent": 4,
      "text": "       local(1)  - a route for which the next Fibre Channel\n                   port is the final destination;\n       remote(2) - a route for which the next Fibre Channel\n                  port is not the final destination.\"\nDEFVAL {local}\n::= { t11FcRouteEntry 10 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "t11FcRouteIfDown OBJECT-TYPE\n    SYNTAX      INTEGER {\n                    remove(1),\n                    retain(2)\n                }\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n           \"The value of this object indicates what happens to\n           this route when the output interface (given by the\n           corresponding value of t11FcRouteOutInterface) is\n           operationally 'down'.  If this object's value is 'retain',\n           the route is to be retained in this table.  If this\n           object's value is 'remove', the route is to be removed\n           from this table.\"\n    DEFVAL  { retain }\n    ::= { t11FcRouteEntry 11 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "t11FcRouteStorageType OBJECT-TYPE\n    SYNTAX      StorageType\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n           \"The storage type for this conceptual row.\n           Conceptual rows having the value 'permanent' need not\n           allow write-access to any columnar objects in the row.\"\n       DEFVAL { nonVolatile }\n    ::= { t11FcRouteEntry 12 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "t11FcRouteRowStatus OBJECT-TYPE\n    SYNTAX      RowStatus\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n           \"The status of this conceptual row.\n           The only rows that can be deleted by setting this object to\n           'destroy' are those for which t11FcRouteProto has the value\n           'netmgmt'.\"\n    ::= { t11FcRouteEntry 13 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "--\n-- Conformance\n--\nt11FcRouteCompliances OBJECT IDENTIFIER\n                         ::= { t11FcRouteConformance 1 }\nt11FcRouteGroups      OBJECT IDENTIFIER\n                         ::= { t11FcRouteConformance 2 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "t11FcRouteCompliance MODULE-COMPLIANCE STATUS current DESCRIPTION \"The compliance statement for entities that implement the T11-FC-ROUTE-MIB. -- -- Note: The next four OBJECT clauses are for auxiliary objects, and the -- SMIv2 does not permit inclusion of objects that are not accessible -- in an OBJECT clause (see Sections 3.1 & 5.4.3 in STD 58, RFC 2580). -- Thus, these four clauses cannot be included below in the normal -- location for OBJECT clauses. -- -- OBJECT t11FcRouteSrcAddrId -- SYNTAX FcAddressIdOrZero (SIZE (0)) -- DESCRIPTION -- 'Support is not required for routes that -- match only a subset of possible source",
      "ja": "t11FcRouteCompliance MODULE-COMPLIANCEステータス現在の説明「T11-FC-ROUTE-MIBを設定するエンティティのための準拠宣言 -   - 注：次の4つのOBJECT句は、補助オブジェクトのためのもの、および -  SMIv2のは含めることを許可していません。アクセス可能でないオブジェクト - オブジェクト句の（RFC 2580、STD 58のセクション3.1及び5.4.3を参照） - 。OBJECT節の位置 - このように、これら四つの節が正常以下に含めることはできません。 -  -  OBJECT t11FcRouteSrcAddrId  -  SYNTAX FcAddressIdOrZero（SIZE（0）） -  DESCRIPTION  - 「サポートはルートのために必要とされていない - 可能なソースのサブセットのみと一致"
    },
    {
      "indent": 0,
      "text": "-- addresses.' -- -- OBJECT t11FcRouteSrcMask -- SYNTAX FcAddressIdOrZero (SIZE (0)) -- DESCRIPTION -- 'Support is not required for routes that -- match only a subset of possible source -- addresses.' -- -- OBJECT t11FcRouteDestMask -- DESCRIPTION -- 'Support is mandatory only for FSPF-generated -- routes. Since FSPF's definition generates -- routes to a Domain_ID, the mask for all -- FSPF-generated routes is 255.0.0. Thus, -- support is only required for 255.0.0.' -- -- OBJECT t11FcRouteInInterface -- SYNTAX InterfaceIndexOrZero (0) -- DESCRIPTION -- 'Support for routes specific to particular -- source interfaces is not required.' \"",
      "ja": " - アドレス「。 -   -  OBJECT t11FcRouteSrcMask  -  SYNTAX FcAddressIdOrZero（SIZE（0）） -  DESCRIPTION  -  'サポートはルートのために必要とされていない - 可能なソースのサブセットのみを一致 - アドレス' -   - オブジェクトt11FcRouteDestMask  - 説明 - 「サポートのみFSPF-生成のために必須である - 路線。 FSPFの定義を生成するので - のDomain_ID、全てのマスクへのルート -  FSPFで生成経路は255.0.0あります。したがって、 - サポートは、255.0.0のために必要です「。 -   - オブジェクトt11FcRouteInInterface  -  SYNTAX InterfaceIndexOrZeroの（0） - 説明 - 「特定の特定のルートのためのサポート - ソースインタフェースは必要ありません。」 \""
    },
    {
      "indent": 4,
      "text": "MODULE  -- this module\n    MANDATORY-GROUPS { t11FcRouteGroup }",
      "raw": true
    },
    {
      "indent": 8,
      "text": "OBJECT     t11FcRouteIfDown\nMIN-ACCESS read-only\nDESCRIPTION\n       \"Write access is not required.\"",
      "raw": true
    },
    {
      "indent": 8,
      "text": "OBJECT t11FcRouteDomainId MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "ja": "OBJECT t11FcRouteDomainId MIN-ACCESS読み取り専用説明 \"書き込みアクセスが必要とされていません。\""
    },
    {
      "indent": 8,
      "text": "OBJECT t11FcRouteMetric MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "ja": "OBJECT t11FcRouteMetric MIN-ACCESS読み取り専用説明 \"書き込みアクセスが必要とされていません。\""
    },
    {
      "indent": 8,
      "text": "OBJECT t11FcRouteType MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "ja": "OBJECT t11FcRouteType MIN-ACCESS読み取り専用説明 \"書き込みアクセスが必要とされていません。\""
    },
    {
      "indent": 8,
      "text": "OBJECT t11FcRouteStorageType",
      "ja": "OBJECTのt11FcRouteStorageType"
    },
    {
      "indent": 8,
      "text": "MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "ja": "MIN-ACCESS読み取り専用説明「書き込みアクセスが必要とされていません。」"
    },
    {
      "indent": 8,
      "text": "OBJECT t11FcRouteRowStatus SYNTAX INTEGER { active(1) } MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "ja": "OBJECT t11FcRouteRowStatus SYNTAX INTEGER {アクティブ（1）} MIN-ACCESS読み取り専用説明 \"書き込みアクセスが必要となりません。\""
    },
    {
      "indent": 0,
      "text": "    ::= { t11FcRouteCompliances 1 }\nt11FcRouteGroup  OBJECT-GROUP\n    OBJECTS  { t11FcRouteFabricLastChange,\n               t11FcRouteDomainId,\n               t11FcRouteMetric,\n               t11FcRouteType,\n               t11FcRouteIfDown,\n               t11FcRouteStorageType,\n               t11FcRouteRowStatus\n             }\n    STATUS   current\n    DESCRIPTION\n           \"A collection of objects for displaying and configuring\n           routes.\"\n    ::= { t11FcRouteGroups 1 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "END",
      "ja": "終わり"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgements",
      "section_title": true,
      "ja": "7.謝辞"
    },
    {
      "indent": 3,
      "text": "This document was originally developed and approved by the INCITS Task Group T11.5 (http://www.t11.org) as the SM-RTM project. We wish to acknowledge the contributions and comments from the INCITS Technical Committee T11, including the following:",
      "ja": "この文書では、独自に開発し、SM-RTMプロジェクトとしてINCITSタスクグループT11.5（http://www.t11.org）によって承認されました。我々は、次を含むINCITS T11技術委員会からの貢献とコメントを、認めることを望みます："
    },
    {
      "indent": 6,
      "text": "T11 Chair: Robert Snively, Brocade T11 Vice Chair: Claudio DeSanti, Cisco Systems T11.5 Chair: Roger Cummings, Symantec T11.5 members, especially: Ken Hirata, Emulex Scott Kipp, McData Elizabeth G. Rodriguez, Dot Hill",
      "ja": "T11司会：ロバート・スナイブリー、ブロケードT11副議長：クラウディオDeSanti、シスコシステムズT11.5座長：ロジャー・カミングス、シマンテックT11.5メンバー、特に：ケン・平田、Emulexのスコット・キップ、McDataのエリザベスG.ロドリゲス、ドットヒル"
    },
    {
      "indent": 3,
      "text": "The document was subsequently approved by the IETF's IMSS Working Group, chaired by David Black (EMC Corporation). We also wish to acknowledge Bert Wijnen (Lucent Technologies), the IETF Area Director, for his review of the document.",
      "ja": "文書は、その後、デヴィッド・ブラック（EMC社）が委員長を務めるIETFのIMSSワーキンググループによって承認されました。また、文書の彼のレビューのために、バートWijnen（ルーセント・テクノロジーズ）、IETFエリアディレクターを確認したいです。"
    },
    {
      "indent": 0,
      "text": "8. IANA Considerations",
      "section_title": true,
      "ja": "8. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "The IANA has assigned a MIB OID for the T11-FC-ROUTE-MIB module under the appropriate subtree.",
      "ja": "IANAは、適切なサブツリーの下T11-FC-ROUTE-MIBモジュールのMIB OIDを割り当てました。"
    },
    {
      "indent": 0,
      "text": "9. Security Considerations",
      "section_title": true,
      "ja": "9.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "There are several management objects defined in this MIB module with a MAX-ACCESS clause of read-write and/or read-create. Such objects may be considered sensitive or vulnerable in some network environments. The support for SET operations in a non-secure environment without proper protection can have a negative effect on network operations. These objects and their sensitivity/vulnerability are:",
      "ja": "読み書きおよび/またはリード作成のMAX-ACCESS句でこのMIBモジュールで定義されたいくつかの管理オブジェクトがあります。そのようなオブジェクトは、いくつかのネットワーク環境に敏感又は脆弱と考えることができます。適切な保護のない非安全な環境におけるSET操作のサポートはネットワーク操作のときにマイナスの影響を与える可能性があります。これらのオブジェクトとそれらの感度/脆弱性は、以下のとおりです。"
    },
    {
      "indent": 8,
      "text": "t11FcRouteDomainId, t11FcRouteMetric, t11FcRouteType,\nt11FcRouteIfDown, t11FcRouteRowStatus\n   -- configure new routes and/or modify existing routes.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Such objects may be considered sensitive or vulnerable in some network environments. For example, the ability to change network topology or network speed may afford an attacker the ability to obtain better performance at the expense of other network users. The support for SET operations in a non-secure environment without proper protection can have a negative effect on network operations.",
      "ja": "そのようなオブジェクトは、いくつかのネットワーク環境に敏感又は脆弱と考えることができます。例えば、ネットワークトポロジーまたはネットワークの速度を変更する能力は、攻撃者は、他のネットワークユーザを犠牲にしてより良好な性能を得る能力を与えることができます。適切な保護のない非安全な環境におけるSET操作のサポートはネットワーク操作のときにマイナスの影響を与える可能性があります。"
    },
    {
      "indent": 3,
      "text": "Some of the readable objects in this MIB module (i.e., objects with a MAX-ACCESS other than not-accessible) may be considered sensitive or vulnerable in some network environments. It is thus important to control even GET and/or NOTIFY access to these objects and possibly to even encrypt the values of these objects when sending them over the network via SNMP. The objects and their sensitivity/vulnerability are: the write-able objects listed above plus one other:",
      "ja": "このMIBモジュールで読み取り可能なオブジェクトの一部（すなわち、アクセス可能ではない以外MAX-ACCESS持つオブジェクト）は、いくつかのネットワーク環境に敏感又は脆弱と考えることができます。 GETおよび/またはこれらのオブジェクトへのアクセスを通知し、おそらくSNMPを通してネットワークの上にそれらを送信する場合でも、これらのオブジェクトの値を暗号化するためにも、制御することが重要です。オブジェクトとそれらの感度/脆弱性は、以下のとおりです。上記の書き込み可能オブジェクトに加えて、他の1："
    },
    {
      "indent": 8,
      "text": "t11FcRouteLastChangeTime\n   -- the time of the last routing table change.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "SNMP versions prior to SNMPv3 did not include adequate security. Even if the network itself is secure (for example by using IPSec), even then, there is no control as to who on the secure network is allowed to access and GET/SET (read/change/create/delete) the objects in this MIB module.",
      "ja": "SNMPv3の前のSNMPバージョンは十分なセキュリティを含んでいませんでした。ネットワーク自体が（IPSecを使用することにより、例えば）安全であっても、その後も、安全なネットワーク上で/ SETにアクセスし、GETだれに許容されているかのように何の制御（読み取り/変更/作成/削除）この内のオブジェクトが存在しませんMIBモジュール。"
    },
    {
      "indent": 3,
      "text": "It is RECOMMENDED that implementors consider the security features as provided by the SNMPv3 framework (see [RFC3410], section 8), including full support for the SNMPv3 cryptographic mechanisms (for authentication and privacy).",
      "ja": "実装がSNMPv3フレームワークで提供するようにセキュリティ機能を考えることが推奨される（認証とプライバシーのために）SNMPv3の暗号化メカニズムの完全なサポートを含む、（[RFC3410]セクション8を参照）。"
    },
    {
      "indent": 3,
      "text": "Further, deployment of SNMP versions prior to SNMPv3 is NOT RECOMMENDED. Instead, it is RECOMMENDED to deploy SNMPv3 and to enable cryptographic security. It is then a customer/operator responsibility to ensure that the SNMP entity giving access to an instance of this MIB module is properly configured to give access to the objects only to those principals (users) that have legitimate rights to indeed GET or SET (change/create/delete) them.",
      "ja": "さらに、SNMPv3の前のSNMPバージョンの展開はお勧めしません。代わりに、SNMPv3を展開すると、暗号化セキュリティを有効にすることをお勧めします。このMIBモジュールのインスタンスへのアクセスを与えるSNMP実体が適切にのみプリンシパル（ユーザ）にオブジェクトへのアクセスを提供するように設定されていることを確認するために、顧客/オペレータ責任実際にGETまたはSET（変化への正当な権利を有することです/）/削除、それらを作成します。"
    },
    {
      "indent": 0,
      "text": "10. Normative References",
      "section_title": true,
      "ja": "10.引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2578] McCloghrie, K., Perkins, D., Schoenwaelder, J., Case, J., Rose, M., and S. Waldbusser, \"Structure of Management Information Version 2 (SMIv2)\", STD 58, RFC 2578, April 1999.",
      "ja": "[RFC2578] McCloghrie、K.、パーキンス、D.、Schoenwaelder、J.、ケース、J.、ローズ、M.、およびS. Waldbusser、 \"経営情報バージョン2（SMIv2）の構造\"、STD 58、RFC 2578 、1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2579] McCloghrie, K., Perkins, D., Schoenwaelder, J., Case, J., Rose, M., and S. Waldbusser, \"Textual Conventions for SMIv2\", STD 58, RFC 2579, April 1999.",
      "ja": "[RFC2579] McCloghrie、K.、パーキンス、D.、Schoenwaelder、J.、ケース、J.、ローズ、M.、およびS. Waldbusser、 \"SMIv2のためのテキストの表記法\"、STD 58、RFC 2579、1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2580] McCloghrie, K., Perkins, D., Schoenwaelder, J., Case, J., Rose, M., and S. Waldbusser, \"Conformance Statements for SMIv2\", STD 58, RFC 2580, April 1999.",
      "ja": "[RFC2580] McCloghrie、K.、パーキンス、D.、Schoenwaelder、J.、ケース、J.、ローズ、M.、およびS. Waldbusser、 \"SMIv2のための適合性宣言\"、STD 58、RFC 2580、1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2863] McCloghrie, K. and F. Kastenholz, \"The Interfaces Group MIB\", RFC 2863, June 2000.",
      "ja": "[RFC2863] McCloghrie、K.およびF. Kastenholzと、 \"インターフェイスグループMIB\"、RFC 2863、2000年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC3411] Harrington, D., Presuhn, R., and B. Wijnen, \"An Architecture for Describing Simple Network Management Protocol (SNMP) Management Frameworks\", STD 62, RFC 3411, December 2002.",
      "ja": "[RFC3411]ハリントン、D.、Presuhn、R.、およびB. Wijnenの、 \"簡易ネットワーク管理プロトコル（SNMP）管理フレームワークを記述するためのアーキテクチャ\"、STD 62、RFC 3411、2002年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC4439] DeSanti, C., Gaonkar, V., McCloghrie, K., and S. Gai, \"Fibre Channel Fabric Address Manager MIB\", RFC 4439, March 2006.",
      "ja": "[RFC4439] DeSanti、C.、Gaonkar、V.、McCloghrie、K.、およびS.ガイ、 \"ファイバーチャネルファブリックアドレスマネージャMIB\"、RFC 4439、2006年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC4626] DeSanti, C., Gaonkar, V., McCloghrie, K., and S. Gai, \"MIB for Fibre Channel's Fabric Shortest Path First (FSPF) Protocol\", RFC 4626, September 2006.",
      "ja": "[RFC4626] DeSanti、C.、Gaonkar、V.、McCloghrie、K.、およびS.ガイ、RFC 4626、2006年9月 \"ファイバチャネルのファブリック最短パスファースト（FSPF）プロトコルのためのMIB\"。"
    },
    {
      "indent": 3,
      "text": "[FC-FS] \"Fibre Channel - Framing and Signaling (FC-FS)\", ANSI INCITS 373-2003, April 2003.",
      "ja": "[FC-FS] \"ファイバチャネル - フレーミングおよびシグナリング（FC-FS）\"、ANSI INCITS 373から2003まで、2003年4月。"
    },
    {
      "indent": 3,
      "text": "[FC-SW-3] \"Fibre Channel - Switch Fabric - 3 (FC-SW-3)\", ANSI INCITS 384-2004, 2004.",
      "ja": "[FC-SW-3] \"ファイバチャネル - スイッチファブリック -  3（FC-SW-3）\"、ANSI INCITS 384から2004、2004。"
    },
    {
      "indent": 3,
      "text": "[FC-SW-4] \"Fibre Channel - Switch Fabric - 4 (FC-SW-4)\", ANSI INCITS 418-2006, 2006.",
      "ja": "[FC-SW-4] \"ファイバチャネル - スイッチファブリック -  4（FC-SW-4）\"、ANSI INCITS 418から2006、2006。"
    },
    {
      "indent": 3,
      "text": "[FC-MGMT] McCloghrie, K., \"Fibre Channel Management MIB\", RFC 4044, May 2005.",
      "ja": "[FC-MGMT] McCloghrie、K.、 \"ファイバー・チャネル管理MIB\"、RFC 4044、2005年5月。"
    },
    {
      "indent": 0,
      "text": "11. Informative References",
      "section_title": true,
      "ja": "11.参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC2096] Baker, F., \"IP Forwarding Table MIB\", RFC 2096, January 1997.",
      "ja": "[RFC2096]ベイカー、F.、 \"IP転送テーブルMIB\"、RFC 2096、1997年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC2741] Daniele, M., Wijnen, B., Ellison, M., and D. Francisco, \"Agent Extensibility (AgentX) Protocol Version 1\", RFC 2741, January 2000.",
      "ja": "[RFC2741]ダニエル、M.、Wijnenの、B.、エリソン、M.、およびD.フランシスコ、 \"エージェントの拡張機能（のAgentX）プロトコルバージョン1\"、RFC 2741、2000年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC2837] Teow, K., \"Definitions of Managed Objects for the Fabric Element in Fibre Channel Standard\", RFC 2837, May 2000.",
      "ja": "[RFC2837] TEOW、K.、RFC 2837、2000年5月「ファイバチャネル標準におけるファブリック要素のための管理オブジェクトの定義」。"
    },
    {
      "indent": 3,
      "text": "[RFC3410] Case, J., Mundy, R., Partain, D., and B. Stewart, \"Introduction and Applicability Statements for Internet-Standard Management Framework\", RFC 3410, December 2002.",
      "ja": "[RFC3410]ケース、J.、マンディ、R.、パーテイン、D.、およびB.スチュワート、 \"インターネット標準の管理フレームワークのための序論と適用性声明\"、RFC 3410、2002年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC4292] Haberman, B., \"IP Forwarding Table MIB\", RFC 4292, April 2006.",
      "ja": "[RFC4292]ハーバーマン、B.、 \"IP転送テーブルMIB\"、RFC 4292、2006年4月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Claudio DeSanti Cisco Systems, Inc. 170 West Tasman Drive San Jose, CA 95134 USA",
      "ja": "クラウディオDeSantiシスコシステムズ、株式会社170西タスマン・ドライブサンノゼ、CA 95134 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 408 853-9172 EMail: cds@cisco.com",
      "ja": "電話：+1 408 853-9172 Eメール：cds@cisco.com"
    },
    {
      "indent": 3,
      "text": "Srini Kode Consultant",
      "ja": "Sriniコードコンサルタント"
    },
    {
      "indent": 3,
      "text": "Phone: 408-348-5343 EMail: srinikode@yahoo.com",
      "ja": "電話：408-348-5343 Eメール：srinikode@yahoo.com"
    },
    {
      "indent": 3,
      "text": "Keith McCloghrie Cisco Systems, Inc. 170 West Tasman Drive San Jose, CA USA 95134",
      "ja": "キースMcCloghrieシスコシステムズ、株式会社170西タスマン・ドライブサンノゼ、CA USA 95134"
    },
    {
      "indent": 3,
      "text": "Phone: +1 408-526-5260 EMail: kzm@cisco.com",
      "ja": "電話：+1 408-526-5260電子メール：kzm@cisco.com"
    },
    {
      "indent": 3,
      "text": "Silvano Gai Retired",
      "ja": "シルヴァーノガイ退職"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2006).",
      "ja": "著作権（C）インターネット協会（2006）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "この文書では、BCP 78に含まれる権利と許可と制限の適用を受けており、その中の記載を除いて、作者は彼らのすべての権利を保有します。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とCONTRIBUTOR「そのまま」、ORGANIZATION HE / SHEが表すまたはインターネットソサエティおよびインターネット・エンジニアリング・タスク・フォース放棄すべての保証、明示または、（もしあれば）後援ISに設けられています。黙示、情報の利用は、特定の目的に対する権利または商品性または適合性の黙示の保証を侵害しない任意の保証含むがこれらに限定されません。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、本書またはそのような権限下で、ライセンスがたりないかもしれない程度に記載された技術の実装や使用に関係すると主張される可能性があります任意の知的財産権やその他の権利の有効性または範囲に関していかなる位置を取りません利用可能です。またそれは、それがどのような権利を確認する独自の取り組みを行ったことを示すものでもありません。 RFC文書の権利に関する手続きの情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IPRの開示のコピーが利用できるようにIETF事務局とライセンスの保証に行われた、または本仕様の実装者または利用者がそのような所有権の使用のための一般的なライセンスまたは許可を取得するために作られた試みの結果を得ることができますhttp://www.ietf.org/iprのIETFのオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、その注意にこの標準を実装するために必要とされる技術をカバーすることができる任意の著作権、特許または特許出願、またはその他の所有権を持ってすべての利害関係者を招待します。 ietf-ipr@ietf.orgのIETFに情報を記述してください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is provided by the IETF Administrative Support Activity (IASA).",
      "ja": "RFCエディタ機能のための資金は、IETF管理サポート活動（IASA）によって提供されます。"
    }
  ]
}