{
  "title": {
    "text": "RFC 4454 - Asynchronous Transfer Mode (ATM) over Layer 2 Tunneling Protocol Version 3 (L2TPv3)",
    "ja": "RFC 4454 - レイヤ2トンネリングプロトコルバージョン3（L2TPv3の）上の非同期転送モード（ATM）"
  },
  "number": 4454,
  "created_at": "2019-10-25 05:56:04.147889+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                           S. Singh\nRequest for Comments: 4454                                   M. Townsley\nCategory: Standards Track                                   C. Pignataro\n                                                           Cisco Systems\n                                                                May 2006",
      "raw": true
    },
    {
      "indent": 13,
      "text": "    Asynchronous Transfer Mode (ATM) over\nLayer 2 Tunneling Protocol Version 3 (L2TPv3)",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2006).",
      "ja": "著作権（C）インターネット協会（2006）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "The Layer 2 Tunneling Protocol, Version 3 (L2TPv3) defines an extensible tunneling protocol to transport layer 2 services over IP networks. This document describes the specifics of how to use the L2TP control plane for Asynchronous Transfer Mode (ATM) Pseudowires and provides guidelines for transporting various ATM services over an IP network.",
      "ja": "レイヤ2トンネリングプロトコルバージョン3（L2TPv3の）は、IPネットワークを介してレイヤ2つのサービスを搬送する拡張可能なトンネリングプロトコルを定義します。この文書では、非同期転送モード（ATM）スードワイヤ用のL2TPコントロールプレーンを使用する方法の詳細を説明し、IPネットワーク上で様々なATMサービスを輸送するためのガイドラインを提供します。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n   1.1. Abbreviations ..............................................3\n   1.2. Specification of Requirements ..............................3\n2. Control Connection Establishment ................................3\n3. Session Establishment and ATM Circuit Status Notification .......4\n   3.1. L2TPv3 Session Establishment ...............................4\n   3.2. L2TPv3 Session Teardown ....................................6\n   3.3. L2TPv3 Session Maintenance .................................6\n4. Encapsulation ...................................................6\n   4.1. ATM-Specific Sublayer ......................................7\n   4.2. Sequencing .................................................9\n5. ATM Transport ...................................................9\n   5.1. ATM AAL5-SDU Mode .........................................10\n   5.2. ATM Cell Mode .............................................10",
      "raw": true
    },
    {
      "indent": 3,
      "text": "        5.2.1. ATM VCC Cell Relay Service .........................11\n        5.2.2. ATM VPC Cell Relay Service .........................12\n        5.2.3. ATM Port Cell Relay Service ........................12\n   5.3. OAM Cell Support ..........................................12\n        5.3.1. VCC Switching ......................................12\n        5.3.2. VPC Switching ......................................13\n6. ATM Maximum Concatenated Cells AVP .............................13\n7. OAM Emulation Required AVP .....................................14\n8. ATM Defects Mapping and Status Notification ....................14\n   8.1. ATM Alarm Status AVP ......................................14\n9. Applicability Statement ........................................15\n   9.1. ATM AAL5-SDU Mode .........................................16\n   9.2. ATM Cell Relay Mode .......................................18\n10. Congestion Control ............................................20\n11. Security Considerations .......................................21\n12. IANA Considerations ...........................................21\n   12.1. L2-Specific Sublayer Type ................................21\n   12.2. Control Message Attribute Value Pairs (AVPs) .............21\n   12.3. Result Code AVP Values ...................................22\n   12.4. ATM Alarm Status AVP Values ..............................22\n   12.5. ATM-Specific Sublayer Bits ...............................23\n13. Acknowledgements ..............................................23\n14. References ....................................................23\n   14.1. Normative References .....................................23\n   14.2. Informative References ...................................24",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "This document describes the specifics of how to use the Layer 2 Tunneling Protocol (L2TP) for Asynchronous Transfer Mode (ATM) Pseudowires, including encapsulation, carrying various ATM services, such as AAL5 SDU, ATM VCC/VPC/Port cell relay over L2TP, and mapping ATM defects to L2TP Set-Link-Info (SLI) messages to notify the peer L2TP Control Connection Endpoint (LCCE).",
      "ja": "この文書では、このようAAL5 SDU、L2TPを超えるATM VCC / VPC /ポートセルリレーなど、さまざまなATMサービスを、運ぶ、カプセル化を含む非同期転送モード（ATM）の擬似回線のレイヤ2トンネリングプロトコル（L2TP）を使用する方法の詳細を記述しますそして、L2TPセットリンク情報（SLI）メッセージにマッピングATM欠陥は、ピアL2TPコントロール接続のエンドポイント（LCCE）を通知します。"
    },
    {
      "indent": 3,
      "text": "Any ATM-specific AVPs or other L2TP constructs for ATM Pseudowire (ATMPW) support are defined here as well. Support for ATM Switched Virtual Path/Connection (SVP/SVC) and Soft Permanent Virtual Path/Connection (SPVP/SPVC) are outside the scope of this document.",
      "ja": "ATM疑似回線（ATMPW）をサポートするための任意のATM固有のAVPまたは他のL2TP構築物は、同様にここで定義されています。 ATMのサポートは、仮想パス/コネクション（SVP / SVC）を交換し、ソフト永久仮想パス/コネクション（SPVP / SPVC）は、この文書の範囲外です。"
    },
    {
      "indent": 3,
      "text": "The reader is expected to be very familiar with the terminology and protocol constructs defined in [RFC3931].",
      "ja": "読者は[RFC3931]で定義された用語とプロトコル構築に精通することが期待されます。"
    },
    {
      "indent": 0,
      "text": "1.1. Abbreviations",
      "section_title": true,
      "ja": "1.1。略語"
    },
    {
      "indent": 3,
      "text": "AIS Alarm Indication Signal ATMPW ATM Pseudowire AVP Attribute Value Pair CC Continuity Check OAM Cell CE Customer Edge HEC Header Error Checksum LAC L2TP Access Concentrator (see [RFC3931]) LCCE L2TP Control Connection Endpoint (see [RFC3931]) MSB Most Significant Byte OAM Operation, Administration, and Maintenance PE Provider Edge PSN Packet Switched Network PWE3 Pseudowire Emulation Edge to Edge RDI Remote Defect Indicator SAR Segmentation and Reassembly SDU Service Data Unit SLI Set-Link-Info, an L2TP control message SVC Switched Virtual Connection SVP Switched Virtual Path SPVC Soft Permanent Virtual Connection SPVP Soft Permanent Virtual Path VC Virtual Circuit VCC Virtual Channel Connection VCI Virtual Channel Identifier VPC Virtual Path Connection VPI Virtual Path Identifier",
      "ja": "AISアラーム表示信号ATMPW ATM擬似回線AVP属性値ペアCC継続性チェックOAMセルCEカスタマーエッジHECヘッダーエラーチェックサムLAC L2TPアクセスコンセントレータ（参照[RFC3931]）LCCE L2TPコントロール接続エンドポイント（参照[RFC3931]）MSB最上位バイトOAM操作、管理、およびメンテナンスPEプロバイダーエッジPSNパケットはRDIリモート障害インジケータSARセグメンテーションとリアセンブリSDUサービスデータユニットSLIセットリンク情報、L2TP制御メッセージSVCは、仮想接続のSVPは、仮想パスSPVCを交換交換EdgeにネットワークPWE3スードワイヤ・エミュレーション・エッジを交換しましたソフト永久仮想接続SPVPソフト永久仮想パスVC仮想回線VCC仮想チャネル接続VCI仮想チャネル識別子VPC仮想パス接続VPI仮想パス識別子"
    },
    {
      "indent": 0,
      "text": "1.2. Specification of Requirements",
      "section_title": true,
      "ja": "1.2。要件の仕様"
    },
    {
      "indent": 3,
      "text": "In this document, several words are used to signify the requirements of the specification. These words are often capitalized. The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "このドキュメントでは、いくつかの単語は、仕様の要件を意味するために使用されています。これらの言葉は、多くの場合、資産計上されます。この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. Control Connection Establishment",
      "section_title": true,
      "ja": "2.コントロール接続の確立"
    },
    {
      "indent": 3,
      "text": "To emulate ATM Pseudowires using L2TP, an L2TP Control Connection as described in Section 3.3 of [RFC3931] MUST be established.",
      "ja": "[RFC3931]のセクション3.3に記載されるようにL2TP、L2TP制御接続を使用して、ATM疑似回線をエミュレートするために確立されなければなりません。"
    },
    {
      "indent": 3,
      "text": "The Start-Control-Connection-Request (SCCRQ) and corresponding Start-Control-Connection-Reply (SCCRP) MUST include the supported ATM Pseudowire types (see Section 3.1), in the Pseudowire Capabilities List as defined in Section 5.4.3 of [RFC3931]. This identifies the Control Connection as able to establish L2TP sessions in support of the ATM Pseudowires.",
      "ja": "セクション5.4.3で定義されるようにスタートコントロール接続要求（SCCRQ）と対応するスタートコントロール接続応答（SCCRP）は疑似回線の能力リストでサポートされているATM擬似回線の種類（3.1節を参照）、含まなければなりません[ RFC3931]。これは、ATMスードワイヤの支援にL2TPセッションを確立することができるように制御接続を識別します。"
    },
    {
      "indent": 3,
      "text": "An LCCE MUST be able to uniquely identify itself in the SCCRQ and SCCRP messages via a globally unique value. By default, this is advertised via the structured Router ID AVP [RFC3931], though the unstructured Hostname AVP [RFC3931] MAY be used to identify LCCEs as well.",
      "ja": "LCCE一意グローバルに一意の値を介してSCCRQとSCCRPメッセージで自身を識別できなければなりません。構造化されていないホスト名AVP [RFC3931]は、同様LCCEsのを識別するために使用することができるが、デフォルトでは、これは、構造化されたルータID AVP [RFC3931]を介してアドバタイズされます。"
    },
    {
      "indent": 0,
      "text": "3. Session Establishment and ATM Circuit Status Notification",
      "section_title": true,
      "ja": "3.セッションの確立とATM回線ステータス通知"
    },
    {
      "indent": 3,
      "text": "This section describes how L2TP ATMPWs or sessions are established between two LCCEs. This includes what will happen when an ATM circuit (e.g., AAL5 PVC) is created, deleted, or changes state when circuit state is in alarm.",
      "ja": "このセクションでは、L2TP ATMPWsまたはセッションが2つのLCCEsの間で確立されている方法を説明します。これは、ATM回路（例えば、AAL5 PVC）を作成、削除、または回路状態がアラームのときに状態が変化したとき。何が起こるかを含み"
    },
    {
      "indent": 0,
      "text": "3.1. L2TPv3 Session Establishment",
      "section_title": true,
      "ja": "3.1。 L2TPv3のセッション確立"
    },
    {
      "indent": 3,
      "text": "ATM circuit (e.g., an AAL5 PVC) creation triggers establishment of an L2TP session using three-way handshake described in Section 3.4.1 of [RFC3931]. An LCCE MAY initiate the session immediately upon ATM circuit creation, or wait until the circuit state transitions to ACTIVE before attempting to establish a session for the ATM circuit. It MAY be preferred to wait until circuit status transitions to ACTIVE in order to delay the allocation of resources until absolutely necessary.",
      "ja": "ATM回路（例えば、AAL5 PVC）の作成[RFC3931]のセクション3.4.1に記載のスリーウェイハンドシェイクを使用して、L2TPセッションの確立をトリガします。 LCCEはすぐにATM回路の作成時にセッションを開始、またはATM回路のためのセッションを確立しようとする前にACTIVEに回路の状態遷移まで待つかもしれません。絶対に必要になるまでリソースの割り当てを遅らせるためにACTIVEに回路状態遷移するまで待つように好ましいかもしれません。"
    },
    {
      "indent": 3,
      "text": "The Circuit Status AVP (see Section 8) MUST be present in the Incoming-Call-Request (ICRQ) and Incoming-Call-Reply (ICRP) messages, and MAY be present in the SLI message for ATMPWs.",
      "ja": "サーキットステータスAVP（セクション8を参照）着信-要求（ICRQ）と着信-返信（ICRP）メッセージ中に存在しなければならない、とATMPWsのためのSLIメッセージ中に存在してもよいです。"
    },
    {
      "indent": 3,
      "text": "The following figure shows how L2TP messages are exchanged to set up an ATMPW after the ATM circuit (e.g., an AAL5 PVC) becomes ACTIVE.",
      "ja": "次の図は、L2TPメッセージは、ATM回路（例えば、AAL5 PVC）後ATMPWを設定するために交換される方法を示しするとアクティブになります。"
    },
    {
      "indent": 6,
      "text": "    LCCE (LAC) A                                  LCCE (LAC) B\n------------------                            --------------------",
      "raw": true
    },
    {
      "indent": 7,
      "text": "ATM Ckt Provisioned\n                                             ATM Ckt Provisioned\nATM Ckt ACTIVE\n                ICRQ (status = 0x03) ---->\n                                             ATM Ckt ACTIVE\n                <----- ICRP (status = 0x03)\nL2TP session established\nOK to send data into PW",
      "raw": true
    },
    {
      "indent": 23,
      "text": "ICCN ----->\n                        L2TP session established\n                        OK to send data into PW",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The following signaling elements are required for the ATMPW establishment.",
      "ja": "以下のシグナリング要素がATMPWの確立のために必要とされます。"
    },
    {
      "indent": 3,
      "text": "a. Pseudowire Type: One of the supported ATM-related PW types should be present in the Pseudowire Type AVP of [RFC3931].",
      "ja": "A。疑似回線の種類：サポートされているATM関連PWタイプの一つは、[RFC3931]の疑似回線タイプAVPで存在すべきです。"
    },
    {
      "indent": 6,
      "text": "0x0002 ATM AAL5 SDU VCC transport 0x0003 ATM Cell transport Port Mode 0x0009 ATM Cell transport VCC Mode 0x000A ATM Cell transport VPC Mode",
      "ja": "0×0002 ATM AAL5 SDU VCC輸送0x0003 ATMセル転送ポートモード0x0009 ATMセル輸送VCCモード0x000A ATMセル輸送VPCモード"
    },
    {
      "indent": 3,
      "text": "The above cell relay modes can also signal the ATM Maximum Concatenated Cells AVP as described in Section 6.",
      "ja": "セクション6に記載されるように上記セルリレーモードもAVP ATM最大連結セルをシグナリングすることができます。"
    },
    {
      "indent": 3,
      "text": "b. Remote End ID: Each PW is associated with a Remote End ID akin to the VC-ID in [PWE3ATM]. Two LCCEs of a PW would have the same Remote End ID, and its format is described in Section 5.4.4 of [RFC3931].",
      "ja": "B。リモートエンドID：各PWは[PWE3ATM]でVC-IDと同種のリモートエンドIDに関連付けられています。 PWの二つのLCCEsは、同じリモートエンドIDを持っているでしょうし、その形式は[RFC3931]のセクション5.4.4に記載されています。"
    },
    {
      "indent": 6,
      "text": "This Remote End ID AVP MUST be present in the ICRQ in order for the remote LCCE to associate the session to the ATM circuit. The Remote End Identifier AVP defined in [RFC3931] is of opaque form, though ATMPW implementations MAY simply use a 4-octet value that is known to both LCCEs (either by direct configuration or some other means). The exact method of how this value is configured, retrieved, discovered, or otherwise determined at each LCCE is outside the scope of this document.",
      "ja": "このリモートエンドID AVPは、ATM回路にセッションを関連付けるために、リモートLCCEためにICRQに存在しなければなりません。 ATMPW実装は単に両方のLCCEsの（直接的設定または何らかの他の手段によって）にはよく知られている4オクテットの値を使用するかもしれません[RFC3931]で定義されたリモートエンド識別子AVPは、不透明な形です。この値は、構成された検索、発見、またはそうでなければ各LCCEで決定された方法の正確な方法は、この文書の範囲外です。"
    },
    {
      "indent": 3,
      "text": "As with the ICRQ, the ICRP is sent only after the ATM circuit transitions to ACTIVE. If LCCE B had not been provisioned yet for the ATM circuit identified in the ICRQ, a Call-Disconnect-Notify (CDN) would have been immediately returned indicating that the circuit either was not provisioned or was not available at this LCCE. LCCE A SHOULD then exhibit a periodic retry mechanism. If so, the period and maximum number of retries MUST be configurable.",
      "ja": "ICRQと同じように、ICRPはACTIVEにのみATM回路に遷移した後に送信されます。 LCCE BがICRQ、コールを切断-通知（CDN）で識別ATM回路のためにまだプロビジョニングされていなかった場合は、すぐに回路がいずれかのプロビジョニングされていないか、またはこのLCCEでは利用できなかったたことを示す返されたであろう。 LCCE Aはその後、定期的な再試行メカニズムを示すべきです。その場合は、再試行の期間と最大数は構成可能でなければなりません。"
    },
    {
      "indent": 3,
      "text": "An implementation MAY send an ICRQ or ICRP before a PVC is ACTIVE, as long as the Circuit Status AVP reflects that the ATM circuit is INACTIVE and an SLI is sent when the ATM circuit becomes ACTIVE (see Section 8).",
      "ja": "PVCの前ICRQかICRPを送るかもしれ実装は、AVPは、ATM回路が非アクティブで、ATM回路がアクティブになるとSLIは（セクション8を参照）が送信されることを反映している限り、回路状態として、ACTIVEです。"
    },
    {
      "indent": 3,
      "text": "The ICCN is the final stage in the session establishment. It confirms the receipt of the ICRP with acceptable parameters to allow bidirectional traffic.",
      "ja": "ICCNは、セッション確立の最終段階です。これは、双方向のトラフィックを許可するために許容可能なパラメータを持つICRPの受信を確認します。"
    },
    {
      "indent": 0,
      "text": "3.2. L2TPv3 Session Teardown",
      "section_title": true,
      "ja": "3.2。 L2TPv3のセッションのティアダウン"
    },
    {
      "indent": 3,
      "text": "When an ATM circuit is unprovisioned (deleted) at either LCCE, the associated L2TP session MUST be torn down via the CDN message defined in Section 3.4.3 of [RFC3931].",
      "ja": "ATM回路はLCCEのいずれかにプロビジョニングされていない（削除）である場合、関連するL2TPセッションは[RFC3931]のセクション3.4.3で定義されたCDNメッセージを介して解体されなければなりません。"
    },
    {
      "indent": 0,
      "text": "3.3. L2TPv3 Session Maintenance",
      "section_title": true,
      "ja": "3.3。 L2TPv3のセッションのメンテナンス"
    },
    {
      "indent": 3,
      "text": "All sessions established by a given Control Connection utilize the L2TP Hello facility defined in Section 4.4 of [RFC3931] for session keepalive. This gives all sessions basic dead peer and path detection between LCCEs.",
      "ja": "与えられた制御接続によって確立されたすべてのセッションは、セッションキープアライブのために[RFC3931]のセクション4.4で定義されたL2TPこんにちは施設を利用しています。これは、すべてのセッションに基本的な死者ピアとLCCEsの間のパスの検出を提供します。"
    },
    {
      "indent": 3,
      "text": "If the control channel utilizing the Hello message is not in-band with data traffic over the PSN, then other method MAY be used to detect the session failure, and it is left for further study.",
      "ja": "Helloメッセージを利用した制御チャネルは、PSN上でデータトラフィックとインバンドでない場合は、他の方法は、セッションの障害を検出するために用いることができる、それがさらなる研究のために残されています。"
    },
    {
      "indent": 3,
      "text": "ATMPWs over L2TP use the Set-Link-Info (SLI) control message as defined in [RFC3931] to signal ATM circuit status between LCCEs after initial session establishment. This includes ACTIVE or INACTIVE notifications of the ATM circuit, or any other parameters that may need to be shared between the LCCEs in order to provide proper PW emulation.",
      "ja": "初期セッション確立後LCCEsの間のATM回路の状態を知らせるために[RFC3931]で定義されるようにL2TP上ATMPWsは、Set-リンク情報（SLI）制御メッセージを使用します。これは、ATM回路のアクティブまたは非アクティブ通知、または適切なPWエミュレーションを提供するために、LCCEsの間で共有される必要があるかもしれない他の任意のパラメータを含みます。"
    },
    {
      "indent": 3,
      "text": "The SLI message MUST be sent whenever there is a status change that may be reported by any values identified in the Circuit Status AVP. The only exceptions to this are the initial ICRQ, ICRP, and CDN messages, which establish and tear down the L2TP session itself when the ATM circuit is created or deleted. The SLI message may be sent from either LCCE at any time after the first ICRQ is sent (and perhaps before an ICRP is received, requiring the peer to perform a reverse Session ID lookup).",
      "ja": "回路状態AVPで特定された値によって報告されるステータスの変更があるたびSLIメッセージを送らなければなりません。これに対する唯一の例外は、確立し、ATM回路が作成または削除されたときにL2TPセッション自体を取り壊す初期ICRQ、ICRP、とCDNのメッセージです。最初ICRQが送信され（及びICRPが受信される前に、おそらく、逆セッションIDルックアップを実行するためにピアを必要とする）した後、SLIメッセージは、任意の時点でいずれかからLCCE送信されても​​よいです。"
    },
    {
      "indent": 3,
      "text": "The other application of the SLI message is to map the ATM OAM or physical layer alarms into Circuit Status AVP as described in Section 8.",
      "ja": "SLIメッセージの他のアプリケーションは、セクション8に記載されているように回路状態AVPにATMのOAM又は物理層アラームをマッピングすることです。"
    },
    {
      "indent": 0,
      "text": "4. Encapsulation",
      "section_title": true,
      "ja": "4.カプセル化"
    },
    {
      "indent": 3,
      "text": "This section describes the general encapsulation format for ATM services over L2TP.",
      "ja": "このセクションでは、L2TPを超えるATMサービスのための一般的なカプセル化形式について説明します。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     PSN Transport Header                      |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                       Session Header                          |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                    ATM-Specific Sublayer                      |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                                                               |\n|                      ATM Service Payload                      |\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 4,
      "text": "Figure 1: General Format for ATM Encapsulation over L2TPv3 over IP",
      "ja": "図1：IP上のL2TPv3を超えるATMカプセル化のための一般的なフォーマット"
    },
    {
      "indent": 3,
      "text": "The PSN Transport header is specific to IP and its underlying transport header. This header is used to transport the encapsulated ATM payload through the IP network.",
      "ja": "PSNトランスポートヘッダは、IPおよびその基礎となるトランスポート・ヘッダーに固有のものです。このヘッダは、IPネットワークを介してカプセル化されたATMペイロードを輸送するために使用されます。"
    },
    {
      "indent": 3,
      "text": "The Session Header is a non-zero 32-bit Session ID with an optional Cookie up to 64-bits. This Session ID is exchanged during session setup.",
      "ja": "セッションヘッダは64ビットに任意クッキーアップ非ゼロ32ビットのセッションIDです。このセッションIDは、セッションのセットアップの間に交換されます。"
    },
    {
      "indent": 3,
      "text": "The ATM-Specific Sublayer is REQUIRED for AAL5 SDU Mode and OPTIONAL for ATM Cell Mode. Please refer to Section 4.1 for more details.",
      "ja": "ATM固有のサブレイヤは、AAL5 SDUモードに必要とATMセルモードのオプションです。詳細はセクション4.1を参照してください。"
    },
    {
      "indent": 0,
      "text": "4.1. ATM-Specific Sublayer",
      "section_title": true,
      "ja": "4.1。 ATM特有の副層"
    },
    {
      "indent": 3,
      "text": "This section defines a new ATM-Specific Sublayer, an alternative to the Default L2-Specific Sublayer as mentioned in Section 4.6 of [RFC3931]. Four new flag bits (T, G, C, and U) are defined that concur with Section 8.2 of [PWE3ATM].",
      "ja": "このセクションでは、新しいATM-特有のSublayer、[RFC3931]のセクション4.6で述べたように、デフォルトL2特有のSublayerの代替を定義します。四つの新しいフラグビット（T、G、C、およびU）は[PWE3ATM]のセクション8.2でそのCONCUR定義されます。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|x|S|B|E|T|G|C|U|          Sequence Number                      |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 18,
      "text": "Figure 2: ATM-Specific Sublayer Format",
      "ja": "図2：ATM固有のサブレイヤーのフォーマット"
    },
    {
      "indent": 3,
      "text": "The meaning of the fields of the ATM-Specific Sublayer is as follows:",
      "ja": "次のようにATM特有の副層のフィールドの意味は次のとおりです。"
    },
    {
      "indent": 6,
      "text": "* S bit",
      "ja": "* Sビット"
    },
    {
      "indent": 6,
      "text": "Definition of this bit is as per Section 4.6 of [RFC3931].",
      "ja": "このビットの定義は、[RFC3931]のセクション4.6のとおりです。"
    },
    {
      "indent": 6,
      "text": "* B and E bits",
      "ja": "* BとEビット"
    },
    {
      "indent": 6,
      "text": "Definitions of these bits are as per Section 5.5 of [L2TPFRAG].",
      "ja": "これらのビットの定義は[L2TPFRAG]のセクション5.5のとおりです。"
    },
    {
      "indent": 6,
      "text": "If these bits are not used as per [L2TPFRAG], they MUST be set to 0 upon transmission and ignored upon reception.",
      "ja": "これらのビットは[L2TPFRAG]に従って使用されていない場合、それらは送信時に0に設定し、受信時に無視しなければなりません。"
    },
    {
      "indent": 6,
      "text": "* T (Transport type) bit",
      "ja": "* T（トランスポート・タイプ）ビット"
    },
    {
      "indent": 6,
      "text": "Bit (T) of the ATM-Specific Sublayer indicates whether the packet contains an ATM admin cell or an AAL5 payload. If T = 1, the packet contains an ATM admin cell, encapsulated according to the VCC cell relay encapsulation of Section 5.2.",
      "ja": "ATM特有サブレイヤのビット（T）は、パケットがATM管理セルまたはAAL5ペイロードを含むかどうかを示しています。 T = 1の場合、パケットは、セクション5.2のVCCセルリレーカプセル化によれば、カプセル化、ATMの管理セルを含みます。"
    },
    {
      "indent": 6,
      "text": "If not set, the PDU contains an AAL5 payload. The ability to transport an ATM cell in the AAL5 SDU Mode is intended to provide a means of enabling administrative functionality over the AAL5 VCC (though it does not endeavor to preserve user-cell and admin-cell arrival/transport ordering, as described in Section 9.1).",
      "ja": "設定されていない場合は、PDUはAAL5ペイロードが含まれています。節に記載したようにAAL5 SDUモードにおけるATMセルを輸送する能力は、それがユーザセルとadmin-セル到着/輸送の順序を維持するために努力しないが、（AAL5 VCCに対する管理機能を可能にする手段を提供することを意図しています9.1）。"
    },
    {
      "indent": 6,
      "text": "* G (EFCI) Bit",
      "ja": "* G（EFCI）ビット"
    },
    {
      "indent": 6,
      "text": "The ingress LCCE device SHOULD set this bit to 1 if the Explicit Forward Congestion Indication (EFCI) bit of the final cell of the incoming AAL5 payload is set to 1, or if the EFCI bit of the single ATM cell to be transported in the packet is set to 1. Otherwise, this bit SHOULD be set to 0. The egress LCCE device SHOULD set the EFCI bit of all the outgoing cells that transport the AAL5 payload to the value contained in this field.",
      "ja": "着信AAL5ペイロードの最終セルの明示的順方向輻輳表示（EFCI）ビットが1に設定されている場合、または単一のATMセルのEFCIビットがパケットで搬送される場合に入口LCCE装置は、このビットを1に設定すべきですそうでなければ1にセットされ、このビットが出口LCCEデバイスはこのフィールドに含まれる値にAAL5ペイロードを輸送するすべての送信セルのEFCIビットを設定すべきである0に設定されるべきです。"
    },
    {
      "indent": 6,
      "text": "* C (CLP) Bit",
      "ja": "* C（CLP）ビット"
    },
    {
      "indent": 6,
      "text": "The ingress LCCE device SHOULD set this bit to 1 if the Cell Loss Priority (CLP) bit of any of the incoming ATM cells of the AAL5 payload is set to 1, or if the CLP bit of the single ATM cell that is to be transported in the packet is set to 1. Otherwise this bit SHOULD be set to 0. The egress LCCE device SHOULD set the CLP bit of all outgoing cells that transport the AAL5 CPCS-PDU to the value contained in this field.",
      "ja": "AAL5ペイロードの受信ATMセルの任意のセル廃棄優先（CLP）ビットが1に設定されている場合、または輸送される単一のATMセルのCLPビットである場合に入口LCCE装置は、このビットを1に設定すべきですパケットがそれ以外の場合、このビットは0に設定されるべきである1に設定されているに出口LCCE装置は、このフィールドに含まれる値にAAL5 CPCS-PDUを輸送するすべての送信セルのCLPビットを設定する必要があります。"
    },
    {
      "indent": 6,
      "text": "* U (Command/Response) Bit",
      "ja": "* U（コマンド/レスポンス）ビット"
    },
    {
      "indent": 6,
      "text": "When FRF.8.1 Frame Relay / ATM PVC Service Interworking (see [FRF8.1]) traffic is being transported, the CPCS-UU Least Significant Bit (LSB) of the AAL5 CPCS-PDU may contain the Frame Relay C/R bit. The ingress LCCE device SHOULD copy this bit to the U bit of the ATM-Specific Sublayer. The egress LCCE device SHOULD copy the U bit to the CPCS-UU Least Significant Bit (LSB) of the AAL5 payload.",
      "ja": "FRF.8.1フレームリレー/ ATM PVCサービスインターワーキング（[FRF8.1]参照）トラフィックが搬送されると、AAL5 CPCS-PDUのCPCS-UUは、最下位ビット（LSB）フレームリレーC / Rビットを含んでいてもよいです。入口LCCE装置はATM特有サブレイヤのUビットにこのビットをコピーする必要があります。出口LCCE装置はAAL5ペイロードのCPCS-UU最下位ビット（LSB）にUビットをコピーする必要があります。"
    },
    {
      "indent": 6,
      "text": "The Sequence Number field is used in sequencing, as described in Section 4.2.",
      "ja": "4.2節で説明したようにシーケンス番号フィールドは、シークエンシングに使用されています。"
    },
    {
      "indent": 3,
      "text": "In case of a reassembly timeout, the encapsulating LCCE should discard all component cells of the AAL5 frame.",
      "ja": "再アセンブリタイムアウトの場合には、封入LCCEは、AAL5フレームのすべてのコンポーネントのセルを廃棄すべきです。"
    },
    {
      "indent": 3,
      "text": "An additional enumeration is added to the L2-Specific Sublayer AVP to identify the ATM-Specific Sublayer:",
      "ja": "追加の列挙は、ATM-特有のSublayerを識別するためにL2特有のSublayerのAVPに追加されます。"
    },
    {
      "indent": 9,
      "text": "0 - There is no L2-Specific Sublayer present.\n1 - The Default L2-Specific Sublayer (defined in Section 4.6\n    of [RFC3931]) is used.\n2 - The ATM-Specific Sublayer is used.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The first two values are already defined in the L2TPv3 base specification [RFC3931].",
      "ja": "最初の2つの値が既にのL2TPv3ベース仕様[RFC3931]で定義されています。"
    },
    {
      "indent": 0,
      "text": "4.2. Sequencing",
      "section_title": true,
      "ja": "4.2。シーケンシング"
    },
    {
      "indent": 3,
      "text": "Data Packet Sequencing MAY be enabled for ATMPWs. The sequencing mechanisms described in [RFC3931] MUST be used to signal sequencing support. ATMPWs over L2TPv3 MUST request the presence of the ATM-Specific Sublayer when sequencing is enabled, and MAY request its presence at all times.",
      "ja": "データパケットシーケンスはATMPWsのために有効にすることができます。 [RFC3931]に記載され配列決定メカニズムは、配列決定のサポートを通知するために使用されなければなりません。 L2TPv3のオーバーATMPWsは、シーケンシングが有効になっているときにATM特有の副層の存在を要求しなければなりませんし、常にその存在を要求することができます。"
    },
    {
      "indent": 0,
      "text": "5. ATM Transport",
      "section_title": true,
      "ja": "5. ATM交通"
    },
    {
      "indent": 3,
      "text": "There are two encapsulations supported for ATM transport as described below.",
      "ja": "後述のようにATMの輸送のためにサポートされる2つのカプセル化があります。"
    },
    {
      "indent": 3,
      "text": "The ATM-Specific Sublayer is prepended to the AAL5-SDU. The other cell mode encapsulation consists of the OPTIONAL ATM-Specific Sublayer, followed by a 4-byte ATM cell header and a 48-byte ATM cell-payload.",
      "ja": "ATM-特有のSublayerはAAL5-SDUに付加されています。他のセルモードのカプセル化は、4バイトのATMセルのヘッダに続いOPTIONAL ATM-特有のSublayer、及び48バイトのATMセルペイロードから成ります。"
    },
    {
      "indent": 0,
      "text": "5.1. ATM AAL5-SDU Mode",
      "section_title": true,
      "ja": "5.1。 ATM AAL5-SDUモード"
    },
    {
      "indent": 3,
      "text": "In this mode, each AAL5 VC is mapped to an L2TP session. The Ingress LCCE reassembles the AAL5 CPCS-SDU without the AAL5 trailer and any padding bytes. Incoming EFCI, CLP, and C/R (if present) are carried in an ATM-Specific Sublayer across ATMPWs to the egress LCCE. The processing of these bits on ingress and egress LCCEs is defined in Section 4.1.",
      "ja": "このモードでは、各AAL5 VCは、L2TPセッションにマッピングされています。イングレスLCCEはAAL5トレーラと任意のパディングバイトなしAAL5 CPCS-SDUを再構成します。着信EFCI、CLP、およびC / R（存在する場合）出口LCCEにATMPWs横切っATM固有サブレイヤにおいて実行されます。入力および出力LCCEsの上のこれらのビットの処理は、セクション4.1で定義されています。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|x|S|x|x|T|G|C|U|             Sequence Number                   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                                                               |\n|                                                               |\n|                         AAL5 CPCS-SDU                         |\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 17,
      "text": "Figure 3: ATM AAL5-SDU Mode Encapsulation",
      "ja": "図3：ATM AAL5-SDUモードカプセル化"
    },
    {
      "indent": 3,
      "text": "If the ingress LCCE determines that an encapsulated AAL5 SDU exceeds the MTU size of the L2TPv3 session, then AAL5 SDU may be fragmented as per [L2TPFRAG] or underneath the transport layer (IP, etc.). F5 OAM cells that arrive during the reassembly of an AAL5 SDU are sent immediately on the PW followed by the AAL5 SDU payload. In this case, OAM cells' relative order with respect to user data cells is not maintained.",
      "ja": "入口LCCEは、カプセル化されたAAL5 SDUがL2TPv3のセッションのMTUサイズを超えていると判定した場合、その後、AAL5 SDUは、トランスポート層（IP等）L2TPFRAG]単位または下のように断片化してもよいです。 AAL5 SDUの再組み立て中に到着するF5 OAMセルがAAL5 SDUのペイロードが続くPWに直ちに送信されます。この場合、ユーザデータセルに対してOAMセルの相対的な順序が維持されません。"
    },
    {
      "indent": 3,
      "text": "Performance Monitoring OAM, as specified in ITU-T 610 [I610-1], [I610-2], [I610-3] and security OAM cells as specified in [ATMSEC], should not be used in combination with AAL5 SDU Mode. These cells MAY be dropped at the ingress LCCE because cell sequence integrity is not maintained.",
      "ja": "パフォーマンス監視OAM [ATMSEC]で指定されるように、ITU-T 610で指定されるように[I610-1]、[I610-2]、[I610-3]とセキュリティOAMセル、AAL5 SDUモードと組み合わせて使用​​されるべきではありません。セルシーケンスの完全性が維持されていないため、これらの細胞は、イングレスLCCEでドロップされる可能性があります。"
    },
    {
      "indent": 3,
      "text": "The Pseudowire Type AVP defined in Section 5.4.4 of [RFC3931], Attribute Type 68, MUST be present in the ICRQ messages and MUST include the ATM AAL5 SDU VCC transport PW Type of 0x0002.",
      "ja": "[RFC3931]のセクション5.4.4で定義された疑似回線タイプAVP、属性タイプ68は、ICRQメッセージ中に存在していなければなりませんと0×0002のATM AAL5 SDU VCC輸送PWタイプを含まなければなりません。"
    },
    {
      "indent": 0,
      "text": "5.2. ATM Cell Mode",
      "section_title": true,
      "ja": "5.2。 ATMセルモード"
    },
    {
      "indent": 3,
      "text": "In this mode, ATM cells skip the reassembly process at the ingress LCCE. These cells are transported over an L2TP session, either as a single cell or as concatenated cells, into a single packet. Each ATM cell consists of a 4-byte ATM cell header and a 48-byte ATM cell-payload; the HEC is not included.",
      "ja": "このモードでは、ATMセルは、イングレスLCCEで再構築プロセスをスキップします。これらの細胞は、単一のパケットに、単一細胞として、または連結細胞のいずれかと、L2TPセッションを介して転送されます。各ATMセルは、4バイトのATMセルのヘッダと48バイトのATMセルペイロードから成ります。 HECは含まれていません。"
    },
    {
      "indent": 3,
      "text": "In ATM Cell Mode encapsulation, the ATM-Specific Sublayer is OPTIONAL. It can be included, if sequencing support is required. It is left to the implementation to choose to signal the Default L2- Specific Sublayer or the ATM-Specific Sublayer.",
      "ja": "ATMセルモードカプセル化では、ATM特有のサブレイヤは任意です。シーケンシングのサポートが必要な場合は、含めることができます。デフォルトのL2-特定のサブレイヤーまたはATM固有のサブレイヤーを知らせるために選択することが実装に任されています。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|x|S|x|x|x|x|x|x|          Sequence Number (Optional)           |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|        VPI            |           VCI                 |PTI  |C|\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                                                               |\n|                    ATM Cell Payload (48-bytes)                |\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n                            \"\n                            \"\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|        VPI            |           VCI                 |PTI  |C|\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                                                               |\n|                    ATM Cell Payload (48-bytes)                |\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 19,
      "text": "Figure 4: ATM Cell Mode Encapsulation",
      "ja": "図4：ATMセルモードカプセル化"
    },
    {
      "indent": 3,
      "text": "In the simplest case, this encapsulation can be used to transmit a single ATM cell per Pseudowire PDU. However, in order to provide better Pseudowire bandwidth efficiency, several ATM cells may be optionally encapsulated into a single Pseudowire PDU.",
      "ja": "最も単純な場合では、このカプセル化は疑似PDUごとに1つのATMセルを送信するために使用することができます。しかし、より良い疑似回線の帯域幅効率を提供するために、いくつかのATMセルは、必要に応じて、単一の疑似回線のPDUにカプセル化してもよいです。"
    },
    {
      "indent": 3,
      "text": "The maximum number of concatenated cells in a packet is limited by the MTU size of the session and also by the ability of the egress LCCE to process them. For more details about ATM Maximum Concatenated Cells, please refer to Section 6.",
      "ja": "パケット内の連結セルの最大数は、セッションのMTUサイズで、またそれらを処理するための出口LCCEの能力によって制限されます。 ATMの最大連結セルの詳細については、第6章を参照してください。"
    },
    {
      "indent": 0,
      "text": "5.2.1. ATM VCC Cell Relay Service",
      "section_title": true,
      "ja": "5.2.1。 ATM VCCセルリレーサービス"
    },
    {
      "indent": 3,
      "text": "A VCC cell relay service may be provided by mapping an ATM Virtual Channel Connection to a single Pseudowire using cell mode encapsulation as defined in Section 5.2.",
      "ja": "VCCセルリレーサービスは、セクション5.2で定義されるようにセルモードカプセル化を使用して、単一の疑似回線へのATM仮想チャネル接続をマッピングすることによって提供されてもよいです。"
    },
    {
      "indent": 3,
      "text": "An LCCE may map one or more VCCs to a single PW. However, a service provider may wish to provision a single VCC to a PW in order to satisfy QOS or restoration requirements.",
      "ja": "LCCEは、単一のPWへの1つのまたは複数のVCCをマッピングすることができます。しかし、サービスプロバイダは、QoSやリストアの要件を満たすために準備にPWへの単一のVCCを望むことができます。"
    },
    {
      "indent": 3,
      "text": "The Pseudowire Type AVP defined in Section 5.4.4 of [RFC3931], Attribute Type 68, MUST be present in the ICRQ messages and MUST include the ATM cell transport VCC Mode PW Type of 0x0009.",
      "ja": "[RFC3931]のセクション5.4.4で定義された疑似回線タイプAVP、属性タイプ68は、ICRQメッセージ中に存在していなければなりませんし、0x0009のATMセル輸送VCCモードPWタイプを含まなければなりません。"
    },
    {
      "indent": 0,
      "text": "5.2.2. ATM VPC Cell Relay Service",
      "section_title": true,
      "ja": "5.2.2。 ATM VPCセルリレーサービス"
    },
    {
      "indent": 3,
      "text": "A Virtual Path Connection cell relay service may be provided by mapping an ATM Virtual Path Connection to a single Pseudowire using cell mode encapsulation as defined in Section 5.2.",
      "ja": "仮想パス接続セルリレーサービスは、セクション5.2で定義されるようにセルモードカプセル化を使用して、単一の疑似回線へのATM仮想パス接続をマッピングすることによって提供されてもよいです。"
    },
    {
      "indent": 3,
      "text": "An LCCE may map one or more VPCs to a single Pseudowire.",
      "ja": "LCCEは、単一の擬似回線への1つの以上のVPCをマッピングすることができます。"
    },
    {
      "indent": 3,
      "text": "The Pseudowire Type AVP defined in Section 5.4.4 of [RFC3931], Attribute Type 68, MUST be present in the ICRQ messages and MUST include the ATM cell transport VPC Mode PW Type of 0x000A.",
      "ja": "[RFC3931]のセクション5.4.4で定義された疑似回線タイプAVP、属性タイプ68は、ICRQメッセージ中に存在していなければなりませんと0x000AのATMセル輸送VPCモードPWタイプを含まなければなりません。"
    },
    {
      "indent": 0,
      "text": "5.2.3. ATM Port Cell Relay Service",
      "section_title": true,
      "ja": "5.2.3。 ATMポートセルリレーサービス"
    },
    {
      "indent": 3,
      "text": "ATM port cell relay service allows an ATM port to be connected to another ATM port. All ATM cells that are received at the ingress ATM port on the LCCE are encapsulated as per Section 5.2, into Pseudowire PDU and sent to peer LCCE.",
      "ja": "ATMポートセルリレーサービスは、ATMポートが別のATMポートに接続されることを可能にします。 LCCEに入口ATMポートで受信されたすべてのATMセルは、スードワイヤPDUに、セクション5.2に従ってカプセル化され、ピアLCCEに送られます。"
    },
    {
      "indent": 3,
      "text": "Each LCCE MUST discard any idle/unassigned cells received on an ATM port associated with ATMPWs.",
      "ja": "各LCCEはATMPWsに関連付けられたATMポートで受信された任意のアイドル/未割り当てのセルを廃棄しなければなりません。"
    },
    {
      "indent": 3,
      "text": "The Pseudowire Type AVP defined in Section 5.4.4 of [RFC3931], Attribute Type 68, MUST be present in the ICRQ messages and MUST include the ATM Cell transport Port Mode PW Type of 0x0003.",
      "ja": "[RFC3931]のセクション5.4.4で定義された疑似回線タイプAVP、属性タイプ68は、ICRQメッセージ中に存在していなければなりませんし、0x0003のATMセル輸送ポートモードPWタイプを含まなければなりません。"
    },
    {
      "indent": 0,
      "text": "5.3. OAM Cell Support",
      "section_title": true,
      "ja": "5.3。 OAMセルのサポート"
    },
    {
      "indent": 3,
      "text": "The OAM cells are defined in [I610-1], [I610-2], [I610-3] and [ATMSEC] can be categorized as follows:",
      "ja": "次のようにOAMセルが[I610-3]、[I610-2]、[I610-1]で定義され、[ATMSEC]分類することができます。"
    },
    {
      "indent": 6,
      "text": "a. Fault Management b. Performance monitoring and reporting c. Activation/deactivation d. System Management (e.g., security OAM cells)",
      "ja": "A。管理bを障害。パフォーマンスのモニタリングとレポーティングC。起動/停止D。システム管理（例えば、セキュリティOAMセル）"
    },
    {
      "indent": 3,
      "text": "OAM Cells are always encapsulated using cell mode encapsulation, regardless of the encapsulation format used for user data.",
      "ja": "OAMセルは関係なく、常にユーザ・データに使用されるカプセル化形式の、セルモードカプセル化を使用してカプセル化されます。"
    },
    {
      "indent": 0,
      "text": "5.3.1. VCC Switching",
      "section_title": true,
      "ja": "5.3.1。 VCC切り替え"
    },
    {
      "indent": 3,
      "text": "The LCCEs SHOULD be able to pass the F5 segment and end-to-end Fault Management, Resource Management (RM cells), Performance Management, Activation/deactivation, and System Management OAM cells.",
      "ja": "LCCEsのはF5セグメントおよびエンドツーエンドの障害管理、リソース管理（RM細胞）、パフォーマンス管理、活性化/不活性化、およびシステム管理OAMセルを通過することができるべきです。"
    },
    {
      "indent": 3,
      "text": "F4 OAM cells are inserted or extracted at the VP link termination. These OAM cells are not seen at the VC link termination and are therefore not sent across the PW.",
      "ja": "F4 OAMセルが挿入またはVPリンク終了時に抽出されています。これらのOAMセルは、VCリンク終了時に見られないので、PWを介して送信されていません。"
    },
    {
      "indent": 0,
      "text": "5.3.2. VPC Switching",
      "section_title": true,
      "ja": "5.3.2。 VPC切り替え"
    },
    {
      "indent": 3,
      "text": "The LCCEs MUST be able to pass the F4 segment and end-to-end Fault Management, Resource Management (RM cells), Performance Management, Activation/deactivation, and System Management OAM cells transparently according to [I610-1].",
      "ja": "LCCEsのは透過[I610-1]に記載F4セグメントおよびエンドツーエンドの障害管理、リソース管理（RM細胞）、パフォーマンス管理、活性化/不活性化、およびシステム管理OAMセルを通過できなければなりません。"
    },
    {
      "indent": 3,
      "text": "F5 OAM cells are not inserted or extracted at the VP cross-connect. The LCCEs MUST be able to pass the F5 OAM cells transparently across the PW.",
      "ja": "F5 OAMセルは、クロスコネクトVPに挿入または抽出されません。 LCCEsのはPWを横切って透過F5 OAMセルを通過できなければなりません。"
    },
    {
      "indent": 0,
      "text": "6. ATM Maximum Concatenated Cells AVP",
      "section_title": true,
      "ja": "6 ATM最大連結セルAVP"
    },
    {
      "indent": 3,
      "text": "The \"ATM Maximum Concatenated Cells AVP\", Attribute Type 86, indicates that the egress LCCE node can process a single PDU with concatenated cells up to a specified number of cells. An LCCE node transmitting concatenated cells on this PW MUST NOT exceed the maximum number of cells as specified in this AVP. This AVP is applicable only to ATM Cell Relay PW Types (VCC, VPC, Port Cell Relay). This Attribute value may not be same in both directions of the specific PW.",
      "ja": "「ATM最大連結セルAVP」、属性タイプ86、出口LCCEノードがセルの指定された数に連結細胞と単PDUを処理することができることを示しています。このAVPで指定されるように、このPWに連結されたセルを送信LCCEノードは、セルの最大数を超えてはなりません。このAVPはATMセルリレーPWタイプ（VCC、VPC、ポートセルリレー）にも適用可能です。この属性値は、特定のPWの両方の方向に同じではないかもしれません。"
    },
    {
      "indent": 3,
      "text": "The Attribute Value field for this AVP has the following format:",
      "ja": "このAVPのためのAttribute Value分野には、以下の形式になっています。"
    },
    {
      "indent": 3,
      "text": " 0                   1\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n| ATM Maximum Concatenated Cells|\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "This AVP MAY be hidden (the H bit MAY be 0 or 1). The M bit for this AVP MAY be set to 0, but MAY vary (see Section 5.2 of [RFC3931]). The length (before hiding) of this AVP is 8.",
      "ja": "このAVPは、（Hビットが0または1でもよい）隠すことができます。このAVPのためのMビットは0に設定することができるが、（[RFC3931]のセクション5.2を参照）を変化させることができます。このAVPのLength（隠れることの前の）は8です。"
    },
    {
      "indent": 3,
      "text": "This AVP is sent in an ICRQ, ICRP during session negotiation or via SLI control messages when LCCE changes the maximum number of concatenated cells configuration for a given ATM cell relay circuit.",
      "ja": "LCCEが所与のATMセルリレー回路の連結セル構成の最大数を変更した場合、このAVPは、セッションネゴシエーション中またはSLI制御メッセージを介してICRQ、ICRPで送信されます。"
    },
    {
      "indent": 3,
      "text": "This AVP is OPTIONAL. If the egress LCCE is configured with a maximum number of cells to be concatenated by the ingress LCCE, it SHOULD signal this value to the ingress LCCE.",
      "ja": "このAVPはオプションです。出口LCCEが入口LCCEによって連結されるセルの最大数で構成されている場合、それは入口LCCEこの値を通知すべきです。"
    },
    {
      "indent": 0,
      "text": "7. OAM Emulation Required AVP",
      "section_title": true,
      "ja": "7. OAMエミュレーションに必要なAVP"
    },
    {
      "indent": 3,
      "text": "An \"OAM Emulation Required AVP\", Attribute Type 87, MAY be needed to signal OAM emulation in AAL5 SDU Mode, if an LCCE cannot support the transport of OAM cells across L2TP sessions. If OAM cell emulation is configured or detected via some other means on one side, the other LCCE MUST support OAM cell emulation as well.",
      "ja": "「OAMエミュレーションに必要なAVP」、属性タイプ87 LCCEはL2TPセッション全体でOAMセルの輸送をサポートできない場合は、AAL5 SDUモードのOAMエミュレーションに信号を送るために必要な場合があります。 OAMセルエミュレーションは、一方の側にいくつかの他の手段を介して設定されるか、または検出された場合、他のLCCEもOAMセルエミュレーションをサポートしなければなりません。"
    },
    {
      "indent": 3,
      "text": "This AVP is exchanged during session negotiation (in ICRQ and ICRP) or during the life of the session via SLI control messages. If the other LCCE cannot support the OAM cell emulation, the associated L2TP session MUST be torn down via CDN message with result code 22.",
      "ja": "このAVPは、（ICRQとICRPで）セッション交渉中またはSLI制御メッセージを介したセッションの寿命の間に交換されます。他のLCCEは、OAMセルエミュレーションをサポートできない場合、関連するL2TPセッションが結果コード22とCDNメッセージを介して解体されなければなりません。"
    },
    {
      "indent": 3,
      "text": "OAM Emulation AVP is a boolean AVP, having no Attribute Value. Its absence is FALSE and its presence is TRUE. This AVP MAY be hidden (the H bit MAY be 0 or 1). The M bit for this AVP SHOULD be set to 0, but MAY vary (see Section 5.2 of [RFC3931]). The Length (before hiding) of this AVP is 6.",
      "ja": "OAMエミュレーションAVPには属性値を持たない、ブールAVPです。その不在はFALSEであり、その存在はTRUEです。このAVPは、（Hビットが0または1でもよい）隠すことができます。このAVPのためのMビットは0に設定されるべきであるが、（[RFC3931]のセクション5.2を参照）を変化させることができます。このAVPのLength（隠れることの前の）は6です。"
    },
    {
      "indent": 0,
      "text": "8. ATM Defects Mapping and Status Notification",
      "section_title": true,
      "ja": "8. ATM欠陥マッピングおよびステータス通知"
    },
    {
      "indent": 3,
      "text": "ATM OAM alarms or circuit status is indicated via the Circuit Status AVP as defined in Section 5.4.5 of [RFC3931]. For reference, usage of this AVP is shown below.",
      "ja": "[RFC3931]のセクション5.4.5で定義されているATM OAMアラームまたは回路ステータス回路状態AVPを介して示されています。参考のために、このAVPの使用方法を以下に示します。"
    },
    {
      "indent": 3,
      "text": " 0                   1\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|           Reserved        |N|A|\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The Value is a 16-bit mask with the two least significant bits defined, and the remaining bits are reserved for future use. Reserved bits MUST be set to 0 when sending and ignored upon receipt.",
      "ja": "値は、定義された2つの最下位ビットと16ビット・マスクであり、残りのビットは将来の使用のために予約されています。予約ビットは、送信時に0に設定し、受信時に無視しなければなりません。"
    },
    {
      "indent": 3,
      "text": "The A (Active) bit indicates whether the ATM circuit is ACTIVE (1) or INACTIVE (0).",
      "ja": "A（アクティブ）ビットは、ATM回路は、（1）アクティブまたは非アクティブ（0）であるかどうかを示します。"
    },
    {
      "indent": 3,
      "text": "The N (New) bit indicates whether the ATM circuit status indication is for a new ATM circuit (1) or an existing ATM circuit (0).",
      "ja": "N（新規）ビットは、ATM回線状態表示が新しいATM回路（1）又は既存のATM回路（0）のためであるかどうかを示します。"
    },
    {
      "indent": 0,
      "text": "8.1. ATM Alarm Status AVP",
      "section_title": true,
      "ja": "8.1。 ATMアラームステータスAVP"
    },
    {
      "indent": 3,
      "text": "An \"ATM Alarm Status AVP\", Attribute Type 88, indicates the reason for the ATM circuit status and specific alarm type, if any, to its peer LCCE node. This OPTIONAL AVP MAY be present in the SLI message with the Circuit Status AVP.",
      "ja": "「ATMアラームステータスAVP」、タイプ88の属性があれば、そのピアLCCEノードに、ATM回路のステータスおよび特定のアラームタイプの理由を示しています。このオプションAVPは、回路状態AVPとSLIメッセージ中に存在してもよいです。"
    },
    {
      "indent": 3,
      "text": "The Attribute Value field for this AVP has the following format:",
      "ja": "このAVPのためのAttribute Value分野には、以下の形式になっています。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Circuit Status Reason     |            Alarm              |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The Circuit Status Reason is a 2-octet unsigned integer, and the Alarm Type is also a 2-octet unsigned integer.",
      "ja": "サーキットのステータス理由は、2オクテットの符号なし整数であり、アラームタイプも2オクテットの符号なし整数です。"
    },
    {
      "indent": 3,
      "text": "This AVP MAY be hidden (the H bit MAY be 0 or 1). The M bit for this AVP SHOULD be set to 0, but MAY vary (see Section 5.2 of [RFC3931]). The Length (before hiding) of this AVP is 10 octets.",
      "ja": "このAVPは、（Hビットが0または1でもよい）隠すことができます。このAVPのためのMビットは0に設定されるべきであるが、（[RFC3931]のセクション5.2を参照）を変化させることができます。このAVPのLength（隠れることの前の）は10オクテットです。"
    },
    {
      "indent": 3,
      "text": "This AVP is sent in the SLI message to indicate additional information about the ATM circuit status.",
      "ja": "このAVPは、ATM回路の状態に関する追加情報を示すために、SLIメッセージで送信されます。"
    },
    {
      "indent": 3,
      "text": "Circuit Status Reason values for the SLI message are as follows:",
      "ja": "次のようにSLIメッセージのための回路のステータス理由の値は次のとおりです。"
    },
    {
      "indent": 11,
      "text": "0 - Reserved\n1 - No alarm or alarm cleared (default for Active Status)\n2 - Unspecified or unknown Alarm Received (default for\n    Inactive Status)\n3 - ATM Circuit received F1 Alarm on ingress LCCE\n4 - ATM Circuit received F2 Alarm on ingress LCCE\n5 - ATM Circuit received F3 Alarm on ingress LCCE\n6 - ATM Circuit received F4 Alarm on ingress LCCE\n7 - ATM Circuit received F5 Alarm on ingress LCCE\n8 - ATM Circuit down due to ATM Port shutdown on Peer LCCE\n9 - ATM Circuit down due to loop-back timeout on ingress LCCE",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The general ATM Alarm failures are encoded as below:",
      "ja": "一般のATMアラーム障害は以下のようにコード化されています。"
    },
    {
      "indent": 11,
      "text": "0 - Reserved\n1 - No Alarm type specified (default)\n2 - Alarm Indication Signal (AIS)\n3 - Remote Defect Indicator (RDI)\n4 - Loss of Signal (LOS)\n5 - Loss of Pointer (LOP)\n6 - Loss of Framer (LOF)\n7 - Loopback cells (LB)\n8 - Continuity Check (CC)",
      "raw": true
    },
    {
      "indent": 0,
      "text": "9. Applicability Statement",
      "section_title": true,
      "ja": "9.適用性に関する声明"
    },
    {
      "indent": 3,
      "text": "The ATM Pseudowire emulation described in this document allows for carrying various ATM services across an IP packet switched network (PSN). These ATM services can be PVC-based, PVP-based, or port-based. In all cases, ATMPWs operate in a point-to-point deployment model.",
      "ja": "この文書に記載されATM擬似回線エミュレーションは、IPパケットの様々なATMサービスを搬送するためのネットワーク（PSN）を切り替えることができます。これらのATMサービスは、PVCベース、PVPベース、またはポートベースすることができます。すべての場合において、ATMPWsは、ポイントツーポイントの展開モデルで動作します。"
    },
    {
      "indent": 3,
      "text": "ATMPWs support two modes of encapsulation: ATM AAL5-SDU Mode and ATM Cell Relay Mode. The following sections list their respective characteristics in relationship to the native service.",
      "ja": "ATM AAL5-SDUモードとATMセルリレーモード：ATMPWsは、カプセル化の2つのモードがサポート。次のセクションでは、ネイティブのサービスに関連して、それぞれの特性をリストアップ。"
    },
    {
      "indent": 0,
      "text": "9.1. ATM AAL5-SDU Mode",
      "section_title": true,
      "ja": "9.1。 ATM AAL5-SDUモード"
    },
    {
      "indent": 3,
      "text": "ATMPWs operating in AAL5-SDU Mode only support the transport of PVC-based services. In this mode, the AAL5 CPCS-PDU from a single VCC is reassembled at the ingress LCCE, and the AAL5 CPCS-SDU (i.e., the AAL5 CPCS-PDU without CPCS-PDU Trailer or PAD octets, also referred to as AAL5 CPCS-PDU Payload) is transported over the Pseudowire. Therefore, Segmentation and Reassembly (SAR) functions are required at the LCCEs. There is a one-to-one mapping between an ATM PVC and an ATMPW operating in AAL5-SDU Mode, supporting bidirectional transport of variable length frames. With the exception of optionally transporting OAM cells, only ATM Adaptation Layer (AAL) Type 5 frames are carried in this mode, including multiprotocol over AAL5 packets [RFC2684].",
      "ja": "AAL5-SDUモードで動作ATMPWsはPVCベースのサービスのトランスポートをサポートしています。このモードでは、単一のVCCからAAL5 CPCS-PDUは、入口LCCEで再組み立てされ、AAL5 CPCS-SDU（CPCS-PDUトレーラー又はPADオクテットせず、すなわち、AAL5 CPCS-PDUは、また、AAL5 CPCS-とも称されるPDUペイロード）は、疑似回線上を搬送されます。したがって、セグメンテーションとリアセンブリ（SAR）関数は、LCCEsのに必要とされます。 ATM PVC可変長フレームの双方向転送をサポートAAL5-SDUモードで動作ATMPW、間に1対1のマッピングがあります。必要に応じてOAMセルの輸送を除いて、唯一のATMアダプテーション・レイヤー（AAL）は、5フレームを入力AAL5パケット[RFC2684]を超えるマルチ含めて、このモードで実施されます。"
    },
    {
      "indent": 3,
      "text": "The following considerations stem from ATM AAL5-SDU Mode Pseudowires not transporting the ATM cell headers and AAL5 CPCS-PDU Trailer (see Section 5.1):",
      "ja": "以下の考察は、（セクション5.1を参照）ATMセルのヘッダとAAL5 CPCS-PDUトレーラーを輸送しないATM AAL5-SDUモードスードワイヤ由来します："
    },
    {
      "indent": 6,
      "text": "o An ATMPW operating in AAL5-SDU Mode conveys EFCI and CLP information using the G and C bits in the ATM-Specific Sublayer. In consequence, the EFCI and CLP values of individual ATM cells that constitute the AAL5 frame may be lost across the ATMPW, and CLP and EFCI transparency may not be maintained. The AAL5-SDU Mode does not preserve EFCI and CLP values for every ATM cell within the AAL5 PDU. The processing of these bits on ingress and egress is defined in Section 4.1.",
      "ja": "O AAL5-SDUモードで動作ATMPWはATM固有のサブレイヤにおいてGおよびCビットを使用してEFCIとCLP情報を伝えます。これにより、AAL5フレームを構成する個々のATMセルのEFCIとCLP値がATMPW横切って失われる可能性があり、およびCLPとEFCI透明性が維持されなくてもよいです。 AAL5-SDUモードはAAL5 PDU内のすべてのATMセルに対するEFCIとCLP値を保持しません。入力および出力上のこれらのビットの処理は、セクション4.1で定義されています。"
    },
    {
      "indent": 6,
      "text": "o Only the least significant bit (LSB) from the CPCS-UU (User-to-User indication) field in the CPCS-PDU Trailer is transported using the ATM-Specific Sublayer (see Section 4.1). This bit contains the Frame Relay C/R bit when FRF.8.1 Frame Relay / ATM PVC Service Interworking [FRF8.1] is used. The CPCS-UU field is not used in multiprotocol over AAL5 [RFC2684]. However, applications that transfer user to user information using the CPCS-UU octet would fail to operate.",
      "ja": "CPCS-UU（ユーザ対ユーザ表示）CPCS-PDUトレーラーのフィールドからOのみ最下位ビット（LSB）ATM-特有のSublayerを用いて搬送される（セクション4.1参照）。このビットはFRF.8.1フレームリレー/ ATM PVCサービスインターワーキングを【FRF8.1]が使用されているフレームリレーC / Rビットを含んでいます。 CPCS-UUフィールドはAAL5 [RFC2684]の上にマルチで使用されていません。しかし、CPCS-UUのオクテットを使用してユーザー情報をユーザーに転送するアプリケーションが動作しないでしょう。"
    },
    {
      "indent": 6,
      "text": "o The CPI (Common Part Indicator) field in the CPCS-PDU Trailer is also not transported across the ATMPW. This does not affect multiprotocol over AAL5 applications since the field is used for alignment and MUST be coded as 0x00 [RFC2684].",
      "ja": "O CPCS-PDUトレーラーにおけるCPI（共通部インジケータ）フィールドもATMPWを横切って輸送されません。フィールドを位置合わせするために使用され、0×00 [RFC2684]として符号化されなければならないので、これはAAL5アプリケーションにわたるマルチに影響を及ぼしません。"
    },
    {
      "indent": 6,
      "text": "o The trailing CRC field in the CPCS-PDU is stripped at the ingress LCCE and not transported over the ATMPW operating in AAL5-SDU Mode. It is in turn regenerated at the egress LCCE. Since the CRC has end-to-end significance, this means that errors introduced in the ATMPW payload during encapsulation or transit across the packet switched network may not be detected. To allow for payload integrity checking transparency on ATMPWs operating in AAL5-SDU Mode using L2TP over IP or L2TP over UDP/IP, the L2TPv3 session can utilize IPsec as specified in Section 4.1.3 of [RFC3931].",
      "ja": "O CPCS-PDUの末尾CRCフィールドは、入口LCCEでストリップとATMPWはAAL5-SDUモードで動作する上で輸送されていません。これは、出口LCCEで再生順番にあります。 CRCは、エンドツーエンドの意味を有しているため、このパケットを横切ってカプセル化または輸送中ATMPWペイロードに導入されたエラーは、ネットワークが検出されないことが切り替わることを意味します。 [RFC3931]のセクション4.1.3で指定されたUDP / IP上でIPまたはL2TP上でL2TPを使用してAAL5-SDUモードで動作ATMPWs上の透明性をチェックするペイロードの整合性を可能にするため、L2TPv3のセッションは、IPsecを利用することができます。"
    },
    {
      "indent": 3,
      "text": "Some additional characteristics of the AAL5-SDU Mode are the following:",
      "ja": "AAL5-SDUモードのいくつかの追加の特徴は以下のとおりです。"
    },
    {
      "indent": 6,
      "text": "o The status of the ATM PVC is signaled between LCCEs using the Circuit Status AVP. More granular cause values for the ATM circuit status and specific ATM alarm types are signaled using the ATM Alarm Status AVP (see Section 8.1). Additionally, loss of connectivity between LCCEs can be detected by the L2TPv3 keepalive mechanism (see Section 4.4 in [RFC3931]).",
      "ja": "O ATM PVCのステータスは、回線状態AVPを使用してLCCEsの間でシグナリングされます。 ATM回路のステータスおよび特定のATMアラームタイプのため、より詳細な原因値は、ATMアラームステータスAVP（セクション8.1を参照）を使用して通知されます。また、LCCEsの間の接続の損失は、L2TPv3のキープアライブ機構によって検出することができる（[RFC3931]セクション4.4を参照）。"
    },
    {
      "indent": 6,
      "text": "o F5 OAM cells' relative order with respect to user data cells may not be maintained. F5 OAM cells that arrive during the reassembly of an AAL5 SDU are sent immediately over the PW and before the AAL5 SDU payload. At egress, these OAM cells are sent before the cells that comprise the AAL5-SDU. Therefore, applications that rely on cell sequence integrity between OAM and user data cells may not work. This includes Performance Monitoring and Security OAM cells (see Section 5.1). In addition, the AAL5-SDU service allows for OAM emulation in which OAM cells are not transported over the ATMPW (see Section 7). This is advantageous for AAL5-SDU Mode ATMPW implementations that do not support cell transport using the T-bit.",
      "ja": "Oユーザーデータセルに対するF5 OAMセルの相対的な順序が維持されなくてもよいです。 AAL5 SDUの再組み立て中に到着するF5のOAMセルはPW上及びAAL5 SDUペイロードの直前に送信されます。出口で、これらのOAMセルがAAL5-SDUを含むセル前に送信されます。したがって、OAMとユーザデータセル間のセルシーケンスの完全性に依存するアプリケーションが動作しない場合があります。これは、パフォーマンスの監視とセキュリティOAMセルを（5.1節を参照）が含まれます。また、AAL5-SDUサービスは、OAMセルがATMPW（セクション7参照）を介して転送されていないOAMエミュレーションを可能にします。これはTビットを用いて細胞輸送をサポートしていないAAL5-SDUモードATMPW実装に有利です。"
    },
    {
      "indent": 6,
      "text": "o Fragmentation and Reassembly procedures MAY be used for managing mismatched MTUs, as specified in Section 5 of [L2TPFRAG] or in the underlying PSN (IP, etc.) between tunnel endpoints as discussed in Section 4.1.4 of [RFC3931]. Only one of these methods SHOULD be used for a given AAL5-SDU Mode ATMPW. The procedures described in [L2TPFRAG] can be used to support the maximum size of an AAL5 SDU, 2 ^ 16 - 1 (65535) octets. However, relying on fragmentation on the L2TP/IPv4 packet between tunnel endpoints limits the maximum size of the AAL5 SDU that can be transported, because the maximum total length of an IPv4 datagram is already 65535 octets. In this case, the maximum AAL5 SDU that can be transported is limited to 65535 minus the encapsulating headers, 24-36 octets for L2TP-over-IPv4 or 36-48 octets for L2TP-over-UDP/IPv4. When the AAL5 payload is IPv4, an additional option is to fragment IP packets before tunnel encapsulation with L2TP/IP (see Section 4.1.4 of [RFC3931]).",
      "ja": "[RFC3931]のセクション4.1.4で説明したように、トンネルエンドポイント間の[L2TPFRAG]または基礎PSN（IP、等）中のセクション5で指定されるようにOフラグメンテーション及び再組み立て手順は、ミスマッチのMTUを管理するために使用されるかもしれません。のみこれらのいずれかの方法は、所与のAAL5-SDUモードATMPWに使用されるべきです。 1（65535）オクテット -  [L2TPFRAG]に記載の手順は、AAL5 SDUの最大サイズは、2 ^ 16を支持するために使用することができます。 IPv4データグラムの最大全長が既に65535オクテットであるのでしかし、トンネルエンドポイントとの間のL2TP / IPv4パケットに断片化に依存して、搬送することができるAAL5 SDUの最大サイズを制限します。この場合、搬送することができる最大AAL5 SDUは65535に制限されているマイナスL2TPオーバーUDP / IPv4のカプセル化ヘッダー、L2TPオーバーIPv4の24-36オクテットまたは36〜48オクテット。 AAL5ペイロードがIPv4である場合、追加のオプションは、L2TP / IP（[RFC3931]のセクション4.1.4を参照）とのトンネルカプセル化の前にIPパケットを断片化することです。"
    },
    {
      "indent": 6,
      "text": "o Sequencing may be enabled on the ATMPW using the ATM-Specific Sublayer Sequence Number field, to detect lost, duplicate, or out-of-order frames on a per-session basis (see Section 4.2).",
      "ja": "Oシーケンシングは、失われた検出複製、またはセッションごとにアウトオブオーダーフレームに、ATM-特有のSublayerシーケンス番号フィールドを使用してATMPW上で有効にすることができる（4.2節を参照）。"
    },
    {
      "indent": 6,
      "text": "o Quality of Service characteristics such as throughput (cell rates), burst sizes and delay variation can be provided by leveraging Quality of Service features of the LCCEs and the underlying PSN, increasing the faithfulness of ATMPWs. This includes mapping ATM service categories to a compatible PSN class of service.",
      "ja": "そのようなスループット（セル速度）などのサービス特性の品質O、バーストサイズ及び遅延変動がATMPWsの忠実さを増加させる、LCCEsののサービス機能の品質と基礎となるPSNを活用して提供することができます。これは、サービスの互換性のPSNクラスにマッピングATMサービスカテゴリが含まれています。"
    },
    {
      "indent": 0,
      "text": "9.2. ATM Cell Relay Mode",
      "section_title": true,
      "ja": "9.2。 ATMセルリレーモード"
    },
    {
      "indent": 3,
      "text": "In this mode, no reassembly takes place at the ingress LCCE. There are no SAR requirements for LCCEs. Instead, ATM-layer cells are transported over the ATMPW. Consequently, all AAL types can be transported over ATMPWs operating in Cell Relay Mode. ATM Cell Relay Pseudowires can operate in three different modes (see Section 5.2): ATM VCC, ATM VPC, and ATM Port Cell Relay Services. The following are some of their characteristics:",
      "ja": "このモードでは、再組み立ては、イングレスLCCEで行われていません。 LCCEsのためのSAR要件はありません。代わりに、ATM層の細胞はATMPWの上に輸送されます。その結果、すべてのAALタイプは、セルリレーモードで動作ATMPWs上で転送することができます。 ATM VCC、ATM VPC、およびATMポートセルリレーサービス：ATMセルリレースードワイヤは、3つの異なるモード（5.2節を参照）で動作することができます。以下は、その特性の一部を以下に示します。"
    },
    {
      "indent": 6,
      "text": "o The ATM cells transported over Cell Relay Mode ATMPWs consist of a 4-byte ATM cell header and a 48-byte ATM cell-payload (see Section 5.2). The ATM Service Payload of a Cell Relay Mode ATMPW is a multiple of 52 bytes. The Header Error Checksum (HEC) in the ATM cell header containing a Cyclic Redundancy Check (CRC) calculated over the first 4 bytes of the ATM cell header is not transported. Accordingly, the HEC field may not accurately reflect errors on an end-to-end basis; errors or corruption in the 4-byte ATM cell header introduced in the ATMPW payload during encapsulation or transit across the PSN may not be detected. To allow for payload integrity checking transparency on ATMPWs operating in Cell Relay Mode using L2TP over IP or L2TP over UDP/IP, the L2TPv3 session can utilize IPsec as specified in Section 4.1.3 of [RFC3931].",
      "ja": "リレーモードATMPWsは、4バイトのATMセルのヘッダから成るセル上搬送ATMセル、48バイトのATMセルペイロードO（5.2節を参照）。セルリレーモードATMPWのATMサービスペイロードは、52バイトの倍数です。 ATMセルのヘッダの最初の4バイトにわたって計算巡回冗長検査（CRC）を含むATMセルのヘッダ内のヘッダエラーチェックサム（HEC）が輸送されません。したがって、HECフィールドが正確にエンドツーエンドベースでエラーを反映しないかもしれません。 PSNを横切るカプセル化又は輸送中ATMPWペイロードに導入された4バイトのATMセルのヘッダ内のエラーや破損が検出されない場合があります。 [RFC3931]のセクション4.1.3で指定されたUDP / IP上でIPまたはL2TP上でL2TPを使用してセルリレーモードで動作してATMPWsに透明性をチェックし、ペイロード整合性を可能にするため、L2TPv3のセッションは、IPsecを利用することができます。"
    },
    {
      "indent": 6,
      "text": "o ATM PWs operating in Cell Relay Mode can transport a single ATM cell or multiple concatenated cells (see Section 6). Cell concatenation improves the bandwidth efficiency of the ATMPW (by decreasing the overhead) but introduces latency and delay variation.",
      "ja": "O ATM PWSがセルリレーモードで動作する単一のATMセル又は複数の連結細胞を輸送することができる（第6節参照）。セルの連結は、（オーバーヘッドを減少させることによって）ATMPWの帯域幅効率を改善するが、待ち時間と遅延変動を導入します。"
    },
    {
      "indent": 6,
      "text": "o The status of the ATM PVC is signaled between LCCEs using the Circuit Status AVP. More granular cause values for the ATM circuit status and specific ATM alarm types are signaled using the ATM Alarm Status AVP (see Section 8.1). Additionally, loss of connectivity between LCCEs can be detected by the L2TPv3 keepalive mechanism (see Section 4.4 in [RFC3931]).",
      "ja": "O ATM PVCのステータスは、回線状態AVPを使用してLCCEsの間でシグナリングされます。 ATM回路のステータスおよび特定のATMアラームタイプのため、より詳細な原因値は、ATMアラームステータスAVP（セクション8.1を参照）を使用して通知されます。また、LCCEsの間の接続の損失は、L2TPv3のキープアライブ機構によって検出することができる（[RFC3931]セクション4.4を参照）。"
    },
    {
      "indent": 6,
      "text": "o ATM OAM cells are transported in the same fashion as user cells, and in the same order as they are received. Therefore, applications that rely on cell sequence integrity between OAM and user data cells are not adversely affected. This includes performance management and security applications that utilize OAM cells (see Section 5.3).",
      "ja": "O ATM OAMセルはユーザセルと同じ方法で輸送され、そして同じ順序でそれらが受信されます。したがって、OAMとユーザデータセル間のセルシーケンスの完全性に依存するアプリケーションに悪影響を与えることはありません。これは、OAMセル（5.3節を参照）を利用して、パフォーマンス管理とセキュリティアプリケーションが含まれています。"
    },
    {
      "indent": 6,
      "text": "o The maximum number of concatenated cells is limited by the MTU size of the session (see Section 5.2 and Section 6). Therefore, Fragmentation and Reassembly procedures are not used for Cell Relay ATMPWs. Concatenating cells to then fragment the resulting packet defeats the purpose of cell concatenation. Concatenation of cells and fragmentation act as inverse functions, with additional processing but null net effect, and should not be used together.",
      "ja": "O連結されたセルの最大数は、セッションのMTUサイズによって制限される（第5.2節および第6節を参照のこと）。したがって、フラグメンテーション及び再組み立て手順は、セルリレーATMPWsために使用されていません。次いで、得られたパケットを断片化するために、細胞を連結するセルの連結の目的に反します。細胞の連結、および追加の処理が、ヌル正味効果の逆関数として断片化作用、および一緒に使用すべきではありません。"
    },
    {
      "indent": 6,
      "text": "o Sequencing may be enabled on the ATMPW to detect lost, duplicate, or out-of-order packets on a per-session basis (see Section 4.2).",
      "ja": "Oの配列決定は、失われた検出複製、またはアウトオブオーダーパケットセッションごとに（セクション4.2を参照）ATMPW上で有効にされてもよいです。"
    },
    {
      "indent": 6,
      "text": "o Quality of Service characteristics such as throughput (cell rates), burst sizes, and delay variation can be provided by leveraging Quality of Service features of the LCCEs and the underlying PSN, increasing the faithfulness of ATMPWs. This includes mapping ATM service categories to a compatible PSN class of service, and mapping CLP and EFCI bits to PSN classes of service. For example, mapping a Constant Bit Rate (CBR) PVC to a class of service with tight loss and delay characteristics, such as an Expedited Forwarding (EF) Per-Hop Behavior (PHB) if the PSN is an IP DiffServ-enabled domain. The following characteristics of ATMPWs operating in Cell Relay Mode include additional QoS considerations:",
      "ja": "Oサービス特性の品質そのようなスループット（セル速度）、バーストサイズ、及び遅延変動は、LCCEsの、基礎となるPSNのサービス機能の品質を活用ATMPWsの忠実さを増加させることによって提供することが可能です。これは、サービスの互換性のPSNクラスにマッピングATMサービスカテゴリが含まれており、サービスのPSNクラスにCLPとEFCIビットをマッピングします。 PSNがIP DiffServの対応のドメインである場合たとえば、このような緊急転送（EF）ホップ単位動作（PHB）などの厳しい損失や遅延特性、とサービスのクラスに固定ビットレート（CBR）PVCをマッピングします。セルリレーモードで動作ATMPWsの次の特性は、追加のQoSの考慮事項が含まれています。"
    },
    {
      "indent": 11,
      "text": "- ATM Cell transport VCC Pseudowires allow for mapping\n  multiple ATM VCCs to a single ATMPW.  However, a user may wish to map a single ATM VCC per ATMPW to satisfy QoS\n  requirements (see Section 5.2.1).",
      "raw": true
    },
    {
      "indent": 11,
      "text": "- Cell Relay ATMPWs allow for concatenating multiple cells in a single Pseudowire PDU to improve bandwidth efficiency, but may introduce latency and delay variation.",
      "ja": " - セルリレーATMPWsは、帯域幅効率を改善するために、単一の疑似PDUに複数のセルを連結することを可能にするが、待ち時間及び遅延変動を導入することができます。"
    },
    {
      "indent": 0,
      "text": "10. Congestion Control",
      "section_title": true,
      "ja": "10.輻輳制御"
    },
    {
      "indent": 3,
      "text": "As explained in [RFC3985], the PSN carrying the PW may be subject to congestion, with congestion characteristics depending on PSN type, network architecture, configuration, and loading. During congestion the PSN may exhibit packet loss and packet delay variation (PDV) that will impact the timing and data integrity of the ATMPW. During intervals of acute congestion, some Cell Relay ATMPWs may not be able to maintain service. The inelastic nature of some ATM services reduces the risk of congestion because the rates will not expand to consume all available bandwidth, but on the other hand, those ATM services cannot arbitrarily reduce their load on the network to eliminate congestion when it occurs.",
      "ja": "[RFC3985]で説明したように、PWを運ぶPSNは、輻輳特性がPSNのタイプ、ネットワークアーキテクチャ、構成、および負荷に依存して、混雑を受けることができます。混雑時PSNはATMPWのタイミングとデータの整合性に影響を与える、パケット損失、パケット遅延変動（PDV）を示すことができます。急性混雑の間隔の間に、いくつかのセルリレーATMPWsは、サービスを維持することができないかもしれません。料金は、すべての利用可能な帯域幅を消費するために拡張しませんが、一方で、それらのATMサービスが任意にそれが発生したときに渋滞を解消するために、ネットワーク上の彼らの負荷を軽減することができないので、いくつかのATMサービスの非弾性性質は、渋滞のリスクを低減します。"
    },
    {
      "indent": 3,
      "text": "Whenever possible, Cell Relay ATMPWs should be run over traffic-engineered PSNs providing bandwidth allocation and admission control mechanisms. IntServ-enabled domains providing the Guaranteed Service (GS) or DiffServ-enabled domains using Expedited Forwarding (EF) are examples of traffic-engineered PSNs. Such PSNs will minimize loss and delay while providing some degree of isolation of the Cell Relay ATMPW's effects from neighboring streams.",
      "ja": "可能な限り、セルリレーATMPWsは、帯域幅の割り当てとアドミッション制御メカニズムを提供するトラフィックエンジニアリングのPSN上で実行する必要があります。保証サービス（GS）または緊急転送（EF）を使用してのDiffServ対応のドメインを提供イントサーブ対応のドメインは、トラフィックエンジニアリングのPSNの例です。隣接するストリームからセルリレーATMPWの効果の分離をある程度提供しながら、このようなのPSNは、損失および遅延を最小化します。"
    },
    {
      "indent": 3,
      "text": "If the PSN is providing a best-effort service, then the following best-effort service congestion avoidance considerations apply: Those ATMPWs that carry constant bit rate (CBR) and variable bit rate-real time (VBR-rt) services across the PSN will most probably not behave in a TCP-friendly manner prescribed by [RFC2914]. In the presence of services that reduce transmission rate, ATMPWs carrying CBR and VBR-rt traffic SHOULD be halted when acute congestion is detected, in order to allow for other traffic or the network infrastructure itself to continue. ATMPWs carrying unspecified bit rate (UBR) traffic, which are equivalent to best-effort IP service, need not be halted during acute congestion and MAY have cells delayed or dropped by the ingress PE if necessary. ATMPWs carrying variable bit rate-non real time (VBR-nrt) services may or may not behave in a TCP-friendly manner, depending on the end user application, but are most likely safe to continue operating, since the end-user application is expected to be delay-insensitive and may also be somewhat loss-insensitive.",
      "ja": "PSNは、ベストエフォート型のサービスを提供している場合は、次のベストエフォート型のサービスの輻輳回避の考慮事項が適用されます：PSNの向こう固定ビットレート（CBR）と可変ビットレートリアルタイム（VBR-RT）サービスを運ぶものATMPWsはなりますおそらく[RFC2914]によって定められたTCPに優しい方法で動作しません。急性輻輳が継続する他のトラフィックまたはネットワーク・インフラストラクチャ自体を可能にするために、検出された場合、伝送速度を低下させるサービスの存在下で、CBRとVBR-RTトラフィックを運ぶATMPWsが停止されるべきです。ベストエフォート型のIPサービスと同等である未指定ビット・レート（UBR）のトラフィックを、運ぶATMPWsは、急性輻輳時に停止され、必要に応じて入力PEによって遅延またはドロップされた細胞を持っているかもしれません必要はありません。エンド・ユーザー・アプリケーションであるため、可変ビットレート非リアルタイム（VBR-NRT）サービスを運ぶATMPWsはしてもしなくてもよい、エンドユーザのアプリケーションに応じて、TCPに優しい方法で動作しますが、最も可能性の高い安全な動作を継続するあること遅延非感受性であると予想し、また幾分損失非感受性であってもよいです。"
    },
    {
      "indent": 3,
      "text": "LCCEs SHOULD monitor for congestion (for example, by measuring packet loss or as specified in Section 6.5 of [RFC3985]) in order to ensure that the ATM service may be maintained. When severe congestion is detected (for example, when enabling sequencing and detecting that the packet loss is higher than a threshold), the ATM service SHOULD be terminated by tearing down the L2TP session via a CDN message. The PW may be restarted by manual intervention, or by automatic means after an appropriate waiting time.",
      "ja": "LCCEsのは、ATMサービスを維持することができることを確実にするために（例えば、パケット損失を測定することによってか、[RFC3985]のセクション6.5で指定されるように）輻輳を監視すべきです。重度の輻輳が検出された場合（例えば、シークエンシングを可能にし、パケット損失が閾値よりも高いことを検出した場合、）、ATMサービスは、CDNメッセージを介してL2TPセッションを切断することによって終了されるべきです。 PWは適切な待ち時間の後に手動での介入によって、または自動手段によって再起動することができます。"
    },
    {
      "indent": 0,
      "text": "11. Security Considerations",
      "section_title": true,
      "ja": "11.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "ATM over L2TPv3 is subject to the security considerations defined in [RFC3931]. There are no additional considerations specific to carrying ATM that are not present carrying other data link types.",
      "ja": "L2TPv3のオーバーATMは、[RFC3931]で定義されたセキュリティ問題を受けることです。他のデータリンクタイプを運んで提示されていないATMを運ぶに固有の追加の考慮事項はありません。"
    },
    {
      "indent": 0,
      "text": "12. IANA Considerations",
      "section_title": true,
      "ja": "12. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "The signaling mechanisms defined in this document rely upon the allocation of the following ATM Pseudowire Types (see Pseudowire Capabilities List as defined in 5.4.3 of [RFC3931] and L2TPv3 Pseudowire Types in 10.6 of [RFC3931]) by the IANA (number space created as part of publication of [RFC3931]):",
      "ja": "この文書で定義されたシグナル伝達機構が作成IANA（番号空間によって（[RFC3931]の5.4.3で定義され、[RFC3931]の10.6でのL2TPv3疑似回線タイプとして疑似回線の能力リストを参照）、次のATM疑似回線の種類の割り当てに依存します[RFC3931]の出版物の一部として）。"
    },
    {
      "indent": 6,
      "text": "Pseudowire Types\n----------------",
      "raw": true
    },
    {
      "indent": 6,
      "text": "0x0002 ATM AAL5 SDU VCC transport 0x0003 ATM Cell transparent Port Mode 0x0009 ATM Cell transport VCC Mode 0x000A ATM Cell transport VPC Mode",
      "ja": "0×0002 ATM AAL5 SDU VCC輸送0x0003のATMセル透明ポートモード0x0009 ATMセル輸送VCCモード0x000A ATMセル輸送VPCモード"
    },
    {
      "indent": 0,
      "text": "12.1. L2-Specific Sublayer Type",
      "section_title": true,
      "ja": "12.1。 L2特有の副層タイプ"
    },
    {
      "indent": 3,
      "text": "This number space is created and maintained per [RFC3931].",
      "ja": "この番号のスペースは[RFC3931]ごとに作成され、維持されます。"
    },
    {
      "indent": 6,
      "text": "L2-Specific Sublayer Type\n-------------------------",
      "raw": true
    },
    {
      "indent": 6,
      "text": "2 - ATM L2-Specific Sublayer present",
      "ja": "2  -  ATM L2特有のSublayer存在"
    },
    {
      "indent": 0,
      "text": "12.2. Control Message Attribute Value Pairs (AVPs)",
      "section_title": true,
      "ja": "12.2。制御メッセージの属性値ペア（AVPの）"
    },
    {
      "indent": 3,
      "text": "This number space is managed by IANA as per [BCP0068].",
      "ja": "この番号空間は[BCP0068]に従ってIANAによって管理されています。"
    },
    {
      "indent": 3,
      "text": "A summary of the three new AVPs follows:",
      "ja": "3つの新のAVPの概要は、次のとおりです。"
    },
    {
      "indent": 3,
      "text": "Control Message Attribute Value Pairs",
      "ja": "制御メッセージ属性値ペア"
    },
    {
      "indent": 6,
      "text": "Attribute\nType        Description\n---------   ----------------------------------\n86          ATM Maximum Concatenated Cells AVP\n87          OAM Emulation Required AVP\n88          ATM Alarm Status AVP",
      "raw": true
    },
    {
      "indent": 0,
      "text": "12.3. Result Code AVP Values",
      "section_title": true,
      "ja": "12.3。コードAVP値の結果"
    },
    {
      "indent": 3,
      "text": "This number space is managed by IANA as per [BCP0068].",
      "ja": "この番号空間は[BCP0068]に従ってIANAによって管理されています。"
    },
    {
      "indent": 3,
      "text": "A new Result Code value for the CDN message is defined in Section 7. Following is a summary:",
      "ja": "CDNメッセージのための新しい結果コード値をまとめたものである次のセクション7で定義されています。"
    },
    {
      "indent": 3,
      "text": "Result Code AVP (Attribute Type 1) Values\n-----------------------------------------",
      "raw": true
    },
    {
      "indent": 3,
      "text": "General Error Codes",
      "ja": "一般的なエラーコード"
    },
    {
      "indent": 9,
      "text": "22 - Session not established due to other LCCE\n     cannot support the OAM Cell Emulation",
      "raw": true
    },
    {
      "indent": 0,
      "text": "12.4. ATM Alarm Status AVP Values",
      "section_title": true,
      "ja": "12.4。 ATMアラームステータスAVP値"
    },
    {
      "indent": 3,
      "text": "This is a new registry for IANA to maintain.",
      "ja": "これはIANAが維持するための新しいレジストリです。"
    },
    {
      "indent": 3,
      "text": "New Attribute values for the ATM Alarm Status AVP in the SLI message are defined in Section 8.1. Additional values may be assigned by Expert Review [RFC2434]. Following is a summary:",
      "ja": "SLIメッセージでATMアラームステータスAVPのための新しい属性値は、8.1節で定義されています。追加の値は、専門家レビュー[RFC2434]によって割り当てられることができます。以下は要約です："
    },
    {
      "indent": 3,
      "text": "ATM Alarm Status AVP (Attribute Type 88) Values\n-----------------------------------------------",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Circuit Status Reason values for the SLI message are as follows:",
      "ja": "次のようにSLIメッセージのための回路のステータス理由の値は次のとおりです。"
    },
    {
      "indent": 11,
      "text": "0 - Reserved\n1 - No alarm or alarm cleared (default for Active Status)\n2 - Unspecified or unknown Alarm Received (default for\n    Inactive Status)\n3 - ATM Circuit received F1 Alarm on ingress LCCE\n4 - ATM Circuit received F2 Alarm on ingress LCCE\n5 - ATM Circuit received F3 Alarm on ingress LCCE\n6 - ATM Circuit received F4 Alarm on ingress LCCE\n7 - ATM Circuit received F5 Alarm on ingress LCCE\n8 - ATM Circuit down due to ATM Port shutdown on Peer LCCE\n9 - ATM Circuit down due to loop-back timeout on ingress LCCE",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The general ATM Alarm failures are encoded as below:",
      "ja": "一般のATMアラーム障害は以下のようにコード化されています。"
    },
    {
      "indent": 11,
      "text": "0 - Reserved\n1 - No Alarm type specified (default)\n2 - Alarm Indication Signal (AIS)\n3 - Remote Defect Indicator (RDI)\n4 - Loss of Signal (LOS)\n5 - Loss of Pointer (LOP)\n6 - Loss of Framer (LOF)\n7 - Loopback cells (LB)\n8 - Continuity Check (CC)",
      "raw": true
    },
    {
      "indent": 0,
      "text": "12.5. ATM-Specific Sublayer Bits",
      "section_title": true,
      "ja": "12.5。 ATM特有の副層ビット"
    },
    {
      "indent": 3,
      "text": "This is a new registry for IANA to maintain.",
      "ja": "これはIANAが維持するための新しいレジストリです。"
    },
    {
      "indent": 3,
      "text": "The ATM-Specific Sublayer contains 8 bits in the low-order portion of the header. Reserved bits may be assigned by IETF Consensus [RFC2434].",
      "ja": "ATM固有のサブレイヤは、ヘッダの下位部分に8ビットを含みます。予約ビットはIETFコンセンサス[RFC2434]によって割り当てられてもよいです。"
    },
    {
      "indent": 6,
      "text": "Bit 0 - Reserved Bit 1 - S (Sequence) bit Bit 2 - B (Fragmentation) bit Bit 3 - E (Fragmentation) bit Bit 4 - T (Transport type) bit Bit 5 - G (EFCI) bit Bit 6 - C (CLP) bit Bit 7 - U (Command/Response) bit",
      "ja": "ビット0  - 予約ビット1  -  S（シーケンス）ビットのビット2  -  B（断片化）ビットのビット3  -  E（断片化）ビットのビット4  -  T（トランスポート・タイプ）ビットのビット5  -  G（EFCI）ビットのビット6  -  C（ CLP）ビットのビット7  -  U（コマンド/レスポンス）ビット"
    },
    {
      "indent": 0,
      "text": "13. Acknowledgements",
      "section_title": true,
      "ja": "13.謝辞"
    },
    {
      "indent": 3,
      "text": "Thanks for the contributions from Jed Lau, Pony Zhu, Prasad Yaditi, Durai, and Jaya Kumar.",
      "ja": "ジェド・ラウ、ポニー朱、プラサドYaditi、Durai、およびジャヤクマールからの寄付をありがとう。"
    },
    {
      "indent": 3,
      "text": "Many thanks to Srinivas Kotamraju for editorial review.",
      "ja": "社説レビューのためスリニバスKotamrajuに感謝します。"
    },
    {
      "indent": 3,
      "text": "Thanks to Shoou Yiu and Fred Shu for giving their valuable time to review this document.",
      "ja": "この文書をレビューする彼らの貴重な時間を与えるためのShoou耀輝とフレッド・シュウに感謝します。"
    },
    {
      "indent": 0,
      "text": "14. References",
      "section_title": true,
      "ja": "14.参考文献"
    },
    {
      "indent": 0,
      "text": "14.1. Normative References",
      "section_title": true,
      "ja": "14.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC3931] Lau, J., Townsley, M., and I. Goyret, \"Layer Two Tunneling Protocol - Version 3 (L2TPv3)\", RFC 3931, March 2005.",
      "ja": "[RFC3931]ラウ、J.、Townsley、M.、およびI. Goyret、 \"レイヤ2トンネリングプロトコル - バージョン3（L2TPv3の）\"、RFC 3931、2005年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 0,
      "text": "14.2. Informative References",
      "section_title": true,
      "ja": "14.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[PWE3ATM] Martini, L., \"Encapsulation Methods for Transport of ATM Over MPLS Networks\", Work in Progress, September 2005.",
      "ja": "[PWE3ATM]マティーニ、L.、「ATMオーバーMPLSネットワークの輸送のためのカプセル化方法」、進歩、2005年9月での作業。"
    },
    {
      "indent": 3,
      "text": "[L2TPFRAG] Malis, A. and M. Townsley, \"PWE3 Fragmentation and Reassembly\", Work in Progress, November 2005.",
      "ja": "【L2TPFRAG] Malis、A.およびM. Townsley、 \"PWE3断片化と再アセンブリ\"、進歩、2005年11月に働いています。"
    },
    {
      "indent": 3,
      "text": "[FRF8.1] \"Frame Relay / ATM PVC Service Interworking Implementation Agreement (FRF 8.1)\", Frame Relay Forum 2000.",
      "ja": "[FRF8.1] \"フレームリレー/ ATM PVCサービスインターワーキング実装合意書（FRF 8.1）\"、フレームリレーフォーラム2000。"
    },
    {
      "indent": 3,
      "text": "[BCP0068] Townsley, W., \"Layer Two Tunneling Protocol (L2TP) Internet Assigned Numbers Authority (IANA) Considerations Update\", BCP 68, RFC 3438, December 2002.",
      "ja": "[BCP0068] Townsley、W.、 \"レイヤ2トンネリングプロトコル（L2TP）IANA（Internet Assigned Numbers Authority）の考慮事項更新\"、BCP 68、RFC 3438、2002年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC2434] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 2434, October 1998.",
      "ja": "[RFC2434] Narten氏、T.とH. Alvestrand、 \"RFCsにIANA問題部に書くためのガイドライン\"、BCP 26、RFC 2434、1998年10月。"
    },
    {
      "indent": 3,
      "text": "[I610-1] ITU-T Recommendation I.610 (1999): B-ISDN operation and maintenance principles and functions",
      "ja": "【I610-1] ITU-T勧告I.610（1999）：B-ISDNの運用保守原則と機能"
    },
    {
      "indent": 3,
      "text": "[I610-2] ITU-T Recommendation I.610, Corrigendum 1 (2000): B-ISDN operation and maintenance principles and functions (corrigendum 1)",
      "ja": "【I610-2] ITU-T勧告I.610、正誤表1（2000）：B-ISDNの運用保守原理および機能（正誤表1）"
    },
    {
      "indent": 3,
      "text": "[I610-3] ITU-T Recommendation I.610, Amendment 1 (2000): B-ISDN operation and maintenance principles and functions (Amendment 1)",
      "ja": "【I610-3] ITU-T勧告I.610、改正1（2000）：B-ISDNの運用保守原理および機能（追補1）"
    },
    {
      "indent": 3,
      "text": "[ATMSEC] ATM Forum Specification, af-sec-0100.002 (2001): ATM Security Specification version 1.1",
      "ja": "[ATMSEC] ATMフォーラム仕様、AF-SEC-0100.002（2001）：ATMのセキュリティ仕様バージョン1.1"
    },
    {
      "indent": 3,
      "text": "[RFC2684] Grossman, D. and J. Heinanen, \"Multiprotocol Encapsulation over ATM Adaptation Layer 5\", RFC 2684, September 1999.",
      "ja": "[RFC2684]グロスマン、D.とJ. Heinanen、RFC 2684、1999年9月 \"ATMアダプテーションレイヤ5以上のマルチプロトコルカプセル化\"。"
    },
    {
      "indent": 3,
      "text": "[RFC3985] Bryant, S. and P. Pate, \"Pseudo Wire Emulation Edge-to-Edge (PWE3) Architecture\", RFC 3985, March 2005.",
      "ja": "[RFC3985]ブライアント、S.とP.パテ、 \"疑似ワイヤーエミュレーション端から端まで（PWE3）アーキテクチャ\"、RFC 3985、2005年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2914] Floyd, S., \"Congestion Control Principles\", BCP 41, RFC 2914, September 2000.",
      "ja": "[RFC2914]フロイド、S.、 \"輻輳制御の原理\"、BCP 41、RFC 2914、2000年9月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Sanjeev Singh Cisco Systems 170 W. Tasman Drive San Jose, CA 95134",
      "ja": "サンジーブシンシスコシステムズ170 W.タスマン・ドライブサンノゼ、CA 95134"
    },
    {
      "indent": 3,
      "text": "EMail: sanjeevs@cisco.com",
      "ja": "メールアドレス：sanjeevs@cisco.com"
    },
    {
      "indent": 3,
      "text": "W. Mark Townsley Cisco Systems 7025 Kit Creek Road PO Box 14987 Research Triangle Park, NC 27709",
      "ja": "W.マークTownsleyシスコシステムズ7025キットクリーク道路私書箱14987リサーチトライアングルパーク、NC 27709"
    },
    {
      "indent": 3,
      "text": "EMail: mark@townsley.net",
      "ja": "メールアドレス：mark@townsley.net"
    },
    {
      "indent": 3,
      "text": "Carlos Pignataro Cisco Systems 7025 Kit Creek Road PO Box 14987 Research Triangle Park, NC 27709",
      "ja": "カルロスPignataroシスコシステムズ7025キットクリーク道路私書箱14987リサーチトライアングルパーク、NC 27709"
    },
    {
      "indent": 3,
      "text": "EMail: cpignata@cisco.com",
      "ja": "メールアドレス：cpignata@cisco.com"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2006).",
      "ja": "著作権（C）インターネット協会（2006）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "この文書では、BCP 78に含まれる権利と許可と制限の適用を受けており、その中の記載を除いて、作者は彼らのすべての権利を保有します。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とCONTRIBUTOR「そのまま」、ORGANIZATION HE / SHEが表すまたはインターネットソサエティおよびインターネット・エンジニアリング・タスク・フォース放棄すべての保証、明示または、（もしあれば）後援ISに設けられています。黙示、情報の利用は、特定の目的に対する権利または商品性または適合性の黙示の保証を侵害しない任意の保証含むがこれらに限定されません。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、本書またはそのような権限下で、ライセンスがたりないかもしれない程度に記載された技術の実装や使用に関係すると主張される可能性があります任意の知的財産権やその他の権利の有効性または範囲に関していかなる位置を取りません利用可能です。またそれは、それがどのような権利を確認する独自の取り組みを行ったことを示すものでもありません。 RFC文書の権利に関する手続きの情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IPRの開示のコピーが利用できるようにIETF事務局とライセンスの保証に行われた、または本仕様の実装者または利用者がそのような所有権の使用のための一般的なライセンスまたは許可を取得するために作られた試みの結果を得ることができますhttp://www.ietf.org/iprのIETFのオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、その注意にこの標準を実装するために必要とされる技術をカバーすることができる任意の著作権、特許または特許出願、またはその他の所有権を持ってすべての利害関係者を招待します。 ietf-ipr@ietf.orgのIETFに情報を記述してください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is provided by the IETF Administrative Support Activity (IASA).",
      "ja": "RFCエディタ機能のための資金は、IETF管理サポート活動（IASA）によって提供されます。"
    }
  ]
}