{
  "title": {
    "text": "RFC 4008 - Definitions of Managed Objects for Network Address Translators (NAT)",
    "ja": "RFC 4008 - ネットワークアドレス変換器（NAT）の管理対象オブジェクトの定義"
  },
  "number": 4008,
  "created_at": "2019-10-18 21:39:40.220759+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                           R. Rohit\nRequest for Comments: 4008                         Mascon Global Limited\nCategory: Standards Track                                   P. Srisuresh\n                                                    Caymas Systems, Inc.\n                                                         R. Raghunarayan\n                                                                  N. Pai\n                                                     Cisco Systems, Inc.\n                                                                 C. Wang\n                                                           Bank One Corp\n                                                              March 2005",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 2,
      "text": "Definitions of Managed Objects for Network Address Translators (NAT)",
      "ja": "ネットワークアドレス変換器（NAT）の管理対象オブジェクトの定義"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "このドキュメントでは、インターネットコミュニティ向けのインターネット標準追跡プロトコルを指定し、改善のための議論と提案を求めています。 このプロトコルの標準化状態とステータスについては、「Internet Official Protocol Standards」（STD 1）の最新版を参照してください。 このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "ja": "著作権（C）インターネット協会（2005）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This memo defines a portion of the Management Information Base (MIB) for devices implementing Network Address Translator (NAT) function. This MIB module may be used for configuration as well as monitoring of a device capable of NAT function.",
      "ja": "このメモは、Network Address Translator（NAT）機能を実装するデバイスの管理情報ベース（MIB）の一部を定義します。 このMIBモジュールは、NAT機能が可能なデバイスの監視だけでなく設定にも使用できます。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction .................................................  2\n2.  The Internet-Standard Management Framework ...................  2\n3.  Terminology ..................................................  3\n4.  Overview .....................................................  4\n    4.1.  natInterfaceTable.......................................  4\n    4.2.  natAddrMapTable.........................................  5\n    4.3.  Default Timeouts, Protocol Table, and Other Scalars.....  6\n    4.4.  natAddrBindTable and natAddrPortBindTable...............  6\n    4.5.  natSessionTable.........................................  6\n    4.6.  RFC 3489 NAPT Variations, NAT Session and Bind Tables...  7\n    4.7.  Notifications...........................................  7\n    4.8.  Relation Among Tables...................................  8\n    4.9.  Configuration via the MIB...............................  8\n    4.10. Relationship to Interface MIB...........................  9\n5.  Definitions ..................................................  9\n6.  Acknowledgements ............................................. 59\n7.  Security Considerations ...................................... 59\n8.  References ................................................... 60\nAuthors' Addresses ............................................... 62\nFull Copyright Statement.......................................... 64",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "This memo defines a portion of the Management Information Base (MIB) for devices implementing NAT function. This MIB module may be used for configuration and monitoring of a device capable of NAT function. NAT types and their characteristics are defined in[RFC2663]. Traditional NAT function, in particular is defined in [RFC3022]. This MIB does not address the firewall functions and must not be used for configuring or monitoring these. Section 2 provides references to the SNMP management framework, which was used as the basis for the MIB module definition. Section 3 describes the terms used throughout the document. Section 4 provides an overview of the key objects, their inter-relationship, and how the MIB module may be used to configure and monitor a NAT device. Lastly, section 5 has the complete NAT MIB definition.",
      "ja": "このメモは、NAT機能を実装するデバイスの管理情報ベース（MIB）の一部を定義します。 このMIBモジュールは、NAT機能が可能なデバイスの構成と監視に使用できます。 NATタイプとその特性は[RFC2663]で定義されています。 従来のNAT機能は、特に[RFC3022]で定義されています。 このMIBはファイアウォール機能に対応していないため、これらの設定や監視に使用しないでください。 セクション2は、MIBモジュール定義の基礎として使用されたSNMP管理フレームワークへの参照を提供します。 セクション3では、ドキュメント全体で使用される用語について説明します。 セクション4では、主要なオブジェクトの概要、それらの相互関係、およびMIBモジュールを使用してNATデバイスを構成および監視する方法について説明します。 最後に、セクション5には完全なNAT MIB定義があります。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "このドキュメントのキーワード「MUST」、「MUST NOT」、「REQUIRED」、「SHALL」、「SHALL NOT」、「SHOULD」、「SHOULD NOT」、「RECOMMENDED」、「MAY」、および「OPTIONAL」は [RFC2119]で説明されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. The Internet-Standard Management Framework",
      "section_title": true,
      "ja": "2.インターネット標準管理フレームワーク"
    },
    {
      "indent": 3,
      "text": "For a detailed overview of the documents that describe the current Internet-Standard Management Framework, please refer to section 7 of RFC 3410 [RFC3410].",
      "ja": "現在のインターネット標準管理フレームワークについて説明しているドキュメントの詳細な概要については、RFC 3410 [RFC3410]のセクション7を参照してください。"
    },
    {
      "indent": 3,
      "text": "Managed objects are accessed via a virtual information store, termed the Management Information Base or MIB. MIB objects are generally accessed through the Simple Network Management Protocol (SNMP).",
      "ja": "管理対象オブジェクトには、管理情報ベースまたはMIBと呼ばれる仮想情報ストアを介してアクセスします。 MIBオブジェクトには、通常、簡易ネットワーク管理プロトコル（SNMP）を介してアクセスします。"
    },
    {
      "indent": 3,
      "text": "Objects in the MIB are defined using the mechanisms defined in the Structure of Management Information (SMI). This memo specifies a MIB module that is compliant to the SMIv2, which is described in STD 58, RFC 2578 [RFC2578], STD 58, RFC 2579 [RFC2579] and STD 58, RFC 2580 [RFC2580].",
      "ja": "MIBのオブジェクトは、管理情報の構造（SMI）で定義されたメカニズムを使用して定義されます。 このメモは、STD 58、RFC 2578 [RFC2578]、STD 58、RFC 2579 [RFC2579]およびSTD 58、RFC 2580 [RFC2580]で説明されているSMIv2に準拠したMIBモジュールを指定します。"
    },
    {
      "indent": 0,
      "text": "3. Terminology",
      "section_title": true,
      "ja": "3.用語"
    },
    {
      "indent": 3,
      "text": "Definitions for a majority of the terms used throughout the document may be found in RFC 2663 [RFC2663]. Additional terms that further classify NAPT implementations are defined in RFC 3489 [RFC3489]. Listed below are terms used in this document.",
      "ja": "ドキュメント全体で使用されている用語の大部分の定義は、RFC 2663 [RFC2663]に記載されています。 NAPT実装をさらに分類する追加の用語は、RFC 3489 [RFC3489]で定義されています。 以下に、このドキュメントで使用されている用語を示します。"
    },
    {
      "indent": 3,
      "text": "Address realm - An address realm is a realm of unique network addresses that are routable within the realm. For example, an enterprise address realm could be constituted of private IP addresses in the ranges specified in RFC 1918 [RFC1918], which are routable within the enterprise, but not across the Internet. A public realm is constituted of globally unique network addresses.",
      "ja": "アドレスレルム-アドレスレルムは、レルム内でルーティング可能な一意のネットワークアドレスのレルムです。 たとえば、エンタープライズアドレスレルムは、RFC 1918 [RFC1918]で指定された範囲のプライベートIPアドレスで構成できます。これは、インターネット内ではなく、エンタープライズ内でルーティングできます。 パブリックレルムは、グローバルに一意のネットワークアドレスで構成されます。"
    },
    {
      "indent": 3,
      "text": "Symmetric NAT - Symmetric NAT, as defined in RFC 3489 [RFC3489], is a variation of Network Address Port Translator (NAPT). Symmetric NAT does not use port bind for translation across all sessions originating from the same private host. Instead, it assigns a new public port to each new session, irrespective of whether the new session used the same private end-point as before.",
      "ja": "対称NAT-RFC 3489 [RFC3489]で定義されている対称NATは、ネットワークアドレスポートトランスレータ（NAPT）のバリエーションです。 対称NATは、同じプライベートホストから発信されるすべてのセッションにわたる変換にポートバインドを使用しません。 代わりに、新しいセッションが以前と同じプライベートエンドポイントを使用したかどうかに関係なく、新しいセッションごとに新しいパブリックポートを割り当てます。"
    },
    {
      "indent": 3,
      "text": "Bind or Binding - Several variations of the term 'Bind' (or 'Binding') are used throughout the document. Address Bind (or Address Binding) is a tuple of (Private IP address, Public IP Address) used for translating an IP address end-point in IP packets. Port Bind (or, Port Binding, or Address Port Bind, or Address Port Binding) is a tuple of (transport protocol, Private IP address, Private port, Public IP Address, Public port) used for translating a port end-point tuple of (transport protocol, IP address, port). Bind is used to refer to either Address Bind or Port Bind. Bind Mode identifies whether a bind is Address Bind or Port Bind.",
      "ja": "バインドまたはバインド-「バインド」（または「バインド」）という用語のいくつかのバリエーションがドキュメント全体で使用されています。 アドレスバインド（またはアドレスバインド）は、IPパケット内のIPアドレスエンドポイントの変換に使用される（プライベートIPアドレス、パブリックIPアドレス）のタプルです。 Port Bind（または、Port Binding、またはAddress Port Bind、またはAddress Port Binding）は、タプル（トランスポートプロトコル、プライベートIPアドレス、プライベートポート、パブリックIPアドレス、パブリックポート）のポートエンドポイントタプルの変換に使用されます （トランスポートプロトコル、IPアドレス、ポート）。 バインドは、アドレスバインドまたはポートバインドを参照するために使用されます。 バインドモードは、バインドがアドレスバインドかポートバインドかを識別します。"
    },
    {
      "indent": 3,
      "text": "NAT Session - A NAT session is an association between a session as seen in the private realm and a session as seen in the public realm, by virtue of NAT translation. If a session in the private realm were to be represented as (PrivateSrcAddr, PrivateDstAddr, TransportProtocol, PrivateSrcPort, PrivateDstPort) and the same session in the public realm were to be represented as (PublicSrcAddr,",
      "ja": "NATセッション-NATセッションは、NAT変換により、プライベートレルムで見られるセッションとパブリックレルムで見られるセッション間の関連付けです。 プライベートレルムのセッションが（PrivateSrcAddr、PrivateDstAddr、TransportProtocol、PrivateSrcPort、PrivateDstPort）として表され、パブリックレルムの同じセッションが（PublicSrcAddr、"
    },
    {
      "indent": 3,
      "text": "PublicDstAddr, TransportProtocol, PublicSrcPort, PublicDstPort), the NAT session will provide the translation glue between the two session representations. NAT sessions in the document are restricted to sessions based on TCP and UDP only. In the future, NAT sessions may be extended to be based on other transport protocols such as SCTP, UDP-lite and DCCP.",
      "ja": "PublicDstAddr、TransportProtocol、PublicSrcPort、PublicDstPort）、NATセッションは2つのセッション表現間の変換接着剤を提供します。 ドキュメント内のNATセッションは、TCPおよびUDPのみに基づくセッションに制限されています。 将来、NATセッションはSCTP、UDP-lite、DCCPなどの他のトランスポートプロトコルに基づいて拡張される可能性があります。"
    },
    {
      "indent": 3,
      "text": "The terms 'local' and 'private' are used interchangeably throughout the document when referring to private networks, IP addresses, and ports. Likewise, the terms 'global' and 'public' are used interchangeably when referring to public networks, IP addresses, and ports.",
      "ja": "「ローカル」および「プライベート」という用語は、プライベートネットワーク、IPアドレス、およびポートを指す場合、ドキュメント全体で同じ意味で使用されます。 同様に、パブリックネットワーク、IPアドレス、およびポートを指す場合、「グローバル」と「パブリック」という用語は同じ意味で使用されます。"
    },
    {
      "indent": 0,
      "text": "4. Overview",
      "section_title": true,
      "ja": "4.概要"
    },
    {
      "indent": 3,
      "text": "NAT MIB is configurable on a per-interface basis and depends in several parts on the IF-MIB [RFC2863].",
      "ja": "NAT MIBはインターフェイスごとに設定可能で、IF-MIB [RFC2863]にいくつかの部分が依存しています。"
    },
    {
      "indent": 3,
      "text": "NAT MIB requires that an interface for which NAT is configured be connected to either a private or a public realm. The realm association of the interface plays an important role in the definition of address maps for the interface. An address map entry identifies the orientation of the session (inbound or outbound to the interface) for which the entry may be used for NAT translation. The address map entry also identifies the end-point of the session that must be subject to translation. An SNMP Textual-Convention 'NatTranslationEntity' is defined to capture this important characteristic that combines session orientation and applicable session endpoint for translation.",
      "ja": "NAT MIBでは、NATが設定されているインターフェイスをプライベートレルムまたはパブリックレルムに接続する必要があります。 インターフェイスのレルムの関連付けは、インターフェイスのアドレスマップの定義において重要な役割を果たします。 アドレスマップエントリは、エントリがNAT変換に使用されるセッションの方向（インターフェイスへのインバウンドまたはアウトバウンド）を識別します。 アドレスマップエントリは、変換の対象となるセッションのエンドポイントも識別します。 SNMP Textual-Convention 'NatTranslationEntity'は、セッションの方向と変換に適用可能なセッションエンドポイントを組み合わせたこの重要な特性をキャプチャするために定義されています。"
    },
    {
      "indent": 3,
      "text": "An address map may consist of static or dynamic entries. NAT creates static binds from a static address map entry. Each static bind has a direct one-to-one relationship with a static address map entry. NAT creates dynamic binds from a dynamic address map entry upon seeing the first packet of a new session.",
      "ja": "アドレスマップは、静的エントリまたは動的エントリで構成されます。 NATは、静的アドレスマップエントリから静的バインドを作成します。 各静的バインドには、静的アドレスマップエントリとの直接の1対1の関係があります。 NATは、新しいセッションの最初のパケットを検出すると、動的アドレスマップエントリから動的バインドを作成します。"
    },
    {
      "indent": 3,
      "text": "The following subsections define the key objects used in NAT MIB, their inter-relationship, and how to configure a NAT device using the MIB module.",
      "ja": "次のサブセクションでは、NAT MIBで使用されるキーオブジェクト、それらの相互関係、およびMIBモジュールを使用してNATデバイスを構成する方法を定義します。"
    },
    {
      "indent": 0,
      "text": "4.1. natInterfaceTable",
      "section_title": true,
      "ja": "4.1。 natInterfaceTable"
    },
    {
      "indent": 3,
      "text": "natInterfaceTable is defined in the MIB module to configure interface specific realm type and the NAT services enabled for the interface. natInterfaceTable is indexed by ifIndex and also includes interface specific NAT statistics.",
      "ja": "natInterfaceTableは、MIBモジュールで定義され、インターフェイス固有のレルムタイプと、インターフェイスで有効なNATサービスを設定します。 natInterfaceTableはifIndexによってインデックスが付けられ、インターフェイス固有のNAT統計も含まれます。"
    },
    {
      "indent": 3,
      "text": "The first step for an operator in configuring a NAT device is determining the interface over which NAT service is to be configured. When NAT service is operational, translated packets traverse the NAT device by ingressing on a private interface and egressing on a public interface or vice versa. An operator may configure the NAT service on either the public interface or the private interface in the traversal path.",
      "ja": "NATデバイスを構成する際のオペレーターの最初のステップは、NATサービスを構成するインターフェースを決定することです。 NATサービスが動作している場合、変換されたパケットは、プライベートインターフェイスで入力され、パブリックインターフェイスで出力されるか、またはその逆でNATデバイスを通過します。 オペレータは、トラバーサルパスのパブリックインターフェイスまたはプライベートインターフェイスのいずれかでNATサービスを構成できます。"
    },
    {
      "indent": 3,
      "text": "As the next step, the operator must identify the NAT service(s) desired for the interface. The operator may configure one or more NAT services on the same interface. The MIB module identifies four types of NAT services: Basic NAT, NAPT, twice NAT and bidirectional NAT. These are NAT varieties as defined in RFC 2663 [RFC2663]. Note that RFC 3489 [RFC3489] further classifies NAPT implementations based on the behavior exhibited by the NAPT devices from different vendors. However, the MIB module does not explicitly distinguish between the NAPT implementations. NAPT implementations may be distinguished between one another by monitoring the BIND and NAT Session objects generated by the NAT device as described in section 4.6.",
      "ja": "次のステップとして、オペレーターはインターフェースに必要なNATサービスを識別する必要があります。 オペレーターは、同じインターフェース上で1つ以上のNATサービスを構成できます。 MIBモジュールは、基本NAT、NAPT、Twice NAT、および双方向NATの4種類のNATサービスを識別します。 これらは、RFC 2663 [RFC2663]で定義されているNATの種類です。 RFC 3489 [RFC3489]は、さまざまなベンダーのNAPTデバイスが示す動作に基づいてNAPT実装をさらに分類することに注意してください。 ただし、MIBモジュールは、NAPT実装を明示的に区別しません。 セクション4.6で説明されているように、NAPTデバイスによって生成されたBINDおよびNATセッションオブジェクトを監視することにより、NAPT実装を相互に区別できます。"
    },
    {
      "indent": 0,
      "text": "4.2. natAddrMapTable",
      "section_title": true,
      "ja": "4.2。 natAddrMapTable"
    },
    {
      "indent": 3,
      "text": "natAddrMapTable is defined in the MIB module to configure address maps on a per-interface basis. natAddrMapTable is indexed by the tuple of (ifIndex, natAddrMapIndex). The same table is also used to collect Statistics for the address map entries. Address maps are key to NAT configuration. An operator may configure one or more address map entries per interface. NAT looks up address map entries in the order in which they are defined to determine the translation function at the start of each new session traversing the interface. An address map may consist of static or dynamic entries. A static address map entry has a direct one-to-one relationship with binds. NAT will dynamically create binds from a dynamic address map entry.",
      "ja": "natAddrMapTableは、インターフェイスごとにアドレスマップを設定するためにMIBモジュールで定義されています。 natAddrMapTableは、タプル（ifIndex、natAddrMapIndex）によってインデックス付けされます。 同じテーブルは、アドレスマップエントリの統計を収集するためにも使用されます。 アドレスマップはNAT設定の鍵です。 オペレータは、インターフェイスごとに1つ以上のアドレスマップエントリを設定できます。 NATは、定義された順序でアドレスマップエントリを検索し、インターフェイスを通過する各新しいセッションの開始時に変換機能を決定します。 アドレスマップは、静的エントリまたは動的エントリで構成されます。 静的アドレスマップエントリには、バインドとの直接的な1対1の関係があります。 NATは、動的アドレスマップエントリからバインドを動的に作成します。"
    },
    {
      "indent": 3,
      "text": "The operator must be careful in selecting address map entries for an interface based on the interface realm-type and the type of NAT service desired. The operator can be amiss in the selection of address map entries when not paying attention to the associated interface characteristics defined in natInterfaceTable (described in section 4.1). For example, say the operator wishes to configure a NAPT map entry on an interface of a NAT device. If the operator chooses to configure the NAPT map entry on a public interface (i.e., interface realm-type is public), the operator should set the TranslationEntity of the NAPT address map entry to be outboundSrcEndPoint. On the other hand, if the operator chooses to configure the NAPT map entry on a private interface (i.e., interface realm-type is private), the operator should set the TranslationEntity of the NAPT address map entry to be InboundSrcEndPoint.",
      "ja": "オペレータは、インターフェイスレルムタイプおよび必要なNATサービスのタイプに基づいて、インターフェイスのアドレスマップエントリを選択する際に注意する必要があります。 natInterfaceTable（セクション4.1で説明）で定義されている関連するインターフェイス特性に注意を払っていない場合、オペレータはアドレスマップエントリの選択に失敗する可能性があります。 たとえば、オペレータがNATデバイスのインターフェイスにNAPTマップエントリを設定したいとします。 オペレータがパブリックインターフェイスでNAPTマップエントリを構成することを選択した場合（つまり、インターフェイスレルムタイプがパブリックである場合）、オペレータはNAPTアドレスマップエントリのTranslationEntityをoutboundSrcEndPointに設定する必要があります。 一方、オペレーターがプライベートインターフェイスでNAPTマップエントリを構成することを選択した場合（つまり、インターフェイスレルムタイプがプライベート）、オペレーターはNAPTアドレスマップエントリのTranslationEntityをInboundSrcEndPointに設定する必要があります。"
    },
    {
      "indent": 0,
      "text": "4.3. Default Timeouts, Protocol Table, and Other Scalars",
      "section_title": true,
      "ja": "4.3。 デフォルトのタイムアウト、プロトコルテーブル、およびその他のスカラー"
    },
    {
      "indent": 3,
      "text": "DefTimeouts is defined in the MIB module to configure idle Bind timeout and IP protocol specific idle NAT session timeouts. The timeouts defined are global to the system and are not interface specific.",
      "ja": "DefTimeoutsはMIBモジュールで定義され、アイドルバインドタイムアウトとIPプロトコル固有のアイドルNATセッションタイムアウトを設定します。 定義されたタイムアウトはシステムに対してグローバルであり、インターフェース固有ではありません。"
    },
    {
      "indent": 3,
      "text": "Protocol specific statistics are maintained in natProtocolTable, which is indexed by the protocol type.",
      "ja": "プロトコル固有の統計はnatProtocolTableで維持され、プロトコルタイプによってインデックスが付けられます。"
    },
    {
      "indent": 3,
      "text": "The scalars natAddrBindNumberOfEntries and natAddrPortBindNumberOfEntries hold the number of entries that currently exist in the Address Bind and the Address Port Bind tables, respectively.",
      "ja": "スカラーのnatAddrBindNumberOfEntriesとnatAddrPortBindNumberOfEntriesは、それぞれアドレスバインドテーブルとアドレスポートバインドテーブルに現在存在するエントリの数を保持します。"
    },
    {
      "indent": 3,
      "text": "The generation of natPacketDiscard notifications can be configured by using the natNotifThrottlingInterval scalar MIB object.",
      "ja": "natPacketDiscard通知の生成は、natNotifThrottlingIntervalスカラーMIBオブジェクトを使用して構成できます。"
    },
    {
      "indent": 0,
      "text": "4.4. natAddrBindTable and natAddrPortBindTable",
      "section_title": true,
      "ja": "4.4。 natAddrBindTableおよびnatAddrPortBindTable"
    },
    {
      "indent": 3,
      "text": "Two Bind tables, natAddrBindTable and natAddrPortBindTable, are defined to hold the bind entries. Entries are derived from the address map table and are not configurable. natAddrBindTable contains Address Binds, and natAddrPortBindTable contains Address Port Binds. natAddrBindTable is indexed by the tuple of (ifIndex, LocalAddrType, LocalAddr). natAddrPortBindTable is indexed by the tuple of (ifIndex, LocalAddrType, LocalAddr, LocalPort, Protocol). These tables also maintain bind specific statistics. A Symmetric NAT will have no entries in the Bind tables.",
      "ja": "2つのバインドテーブル、natAddrBindTableおよびnatAddrPortBindTableは、バインドエントリを保持するために定義されています。 エントリはアドレスマップテーブルから取得され、構成できません。 natAddrBindTableにはアドレスバインドが含まれ、natAddrPortBindTableにはアドレスポートバインドが含まれます。 natAddrBindTableは、タプル（ifIndex、LocalAddrType、LocalAddr）によってインデックス付けされます。 natAddrPortBindTableは、タプル（ifIndex、LocalAddrType、LocalAddr、LocalPort、Protocol）によってインデックス付けされます。 これらのテーブルは、バインド固有の統計も保持します。 対称NATには、バインドテーブルにエントリがありません。"
    },
    {
      "indent": 0,
      "text": "4.5. natSessionTable",
      "section_title": true,
      "ja": "4.5。 natSessionTable"
    },
    {
      "indent": 3,
      "text": "natSessionTable is defined to hold NAT session entries. NAT session entries are derived from NAT Binds (except in the case of Symmetric NAT) and are not configurable.",
      "ja": "natSessionTableは、NATセッションエントリを保持するように定義されています。 NATセッションエントリはNATバインドから派生し（対称NATの場合を除く）、構成できません。"
    },
    {
      "indent": 3,
      "text": "The NAT session provides the necessary translation glue between two session representations of the same end-to-end session; that is, a session as seen in the private realm and in the public realm. Session orientation (inbound or outbound) is determined from the orientation of the first packet traversing the NAT interface. Address map entries and bind entries on the interface determine whether a session is subject to NAT translation. One or both endpoints of a session may be subject to translation.",
      "ja": "NATセッションは、同じエンドツーエンドセッションの2つのセッション表現の間に必要な変換のりを提供します。 つまり、プライベートレルムとパブリックレルムで見られるセッションです。 セッションの方向（インバウンドまたはアウトバウンド）は、NATインターフェイスを通過する最初のパケットの方向から決定されます。 インターフェイス上のアドレスマップエントリとバインドエントリは、セッションがNAT変換の対象となるかどうかを決定します。 セッションの一方または両方のエンドポイントが翻訳の対象になる場合があります。"
    },
    {
      "indent": 3,
      "text": "With the exception of symmetric NAT, all other NAT functions use end-point specific bind to perform individual end-point translations. Multiple NAT sessions would use the same bind as long as they share the same endpoint. Symmetric NAT does not retain a consistent port bind across multiple sessions using the same endpoint. For this reason, the bind identifier for a NAT session in symmetric NAT is set to zero. natSessionTable is indexed by the tuple of (ifIndex, natSessionIndex). Statistics for NAT sessions are also maintained in the same table.",
      "ja": "対称NATを除き、他のすべてのNAT機能はエンドポイント固有のバインドを使用して、個々のエンドポイント変換を実行します。 複数のNATセッションが同じエンドポイントを共有している限り、同じバインドを使用します。 対称NATは、同じエンドポイントを使用する複数のセッション間で一貫したポートバインドを保持しません。 このため、対称NATのNATセッションのバインド識別子はゼロに設定されます。 natSessionTableは、タプル（ifIndex、natSessionIndex）によってインデックス付けされます。 NATセッションの統計も同じテーブルに保持されます。"
    },
    {
      "indent": 0,
      "text": "4.6. NAPT Variations, NAT Session and Bind Tables",
      "section_title": true,
      "ja": "4.6。 NAPTバリエーション、NATセッション、バインドテーブル"
    },
    {
      "indent": 3,
      "text": "[RFC3489] defines four variations of NAPT - Full Cone, Restricted Cone, Port Restricted Cone, and Symmetric NAT. These can be differentiated in the NAT MIB based on different values for the objects in the session and the bind tables, as indicated below.",
      "ja": "[RFC3489]は、NAPTの4つのバリエーション-フルコーン、制限コーン、ポート制限コーン、および対称NATを定義しています。 これらは、以下に示すように、セッションおよびバインドテーブルのオブジェクトの異なる値に基づいてNAT MIBで区別できます。"
    },
    {
      "indent": 3,
      "text": "In a Port Restricted Cone NAT, NAT Session objects will contain a non-zero PrivateSrcEPBindId object. Further, all address and port objects within a NAT session will have non-zero values (i.e., no wildcard matches).",
      "ja": "ポート制限コーンNATでは、NATセッションオブジェクトにゼロ以外のPrivateSrcEPBindIdオブジェクトが含まれます。 さらに、NATセッション内のすべてのアドレスおよびポートオブジェクトにはゼロ以外の値があります（つまり、ワイルドカードが一致しません）。"
    },
    {
      "indent": 3,
      "text": "An Address Restricted Cone NAT may have been implemented in the same way as a Port Restricted Cone NAT, except that the UDP NAT Sessions may use ANY match on PrivateDstPort and PublicDstPort objects; i.e., PrivateDstPort and PublicDstPort objects within a NAT session may be set to zero.",
      "ja": "アドレス制限コーンNATは、ポート制限コーンNATと同じ方法で実装されている場合がありますが、UDP NATセッションはPrivateDstPortおよびPublicDstPortオブジェクトで任意の一致を使用できます。 つまり、NATセッション内のPrivateDstPortおよびPublicDstPortオブジェクトはゼロに設定できます。"
    },
    {
      "indent": 3,
      "text": "A Full Cone NAT may have also been implemented in the same way as a Port Restricted Cone NAT, except that the UDP NAT Sessions may use ANY match on PrivateDstAddr, PrivateDstPort, PublicDstAddr, and PublicDstPort objects. Within a NAT Session, all four of these objects may be set to zero. Alternately, all address and port objects within a NAT Session may have non-zero values, yet the TranslationEntity of the PrivateSrcEPBindId for the NAT Sessions may be set bi-directionally, i.e., as a bit mask of (outboundSrcEndPoint and inboundDstEndPoint) or (inboundSrcEndPoint and outboundDstEndPoint), depending on the interface realm type. Lastly, a Symmetric NAT does not maintain Port Bindings. As such, the NAT Session objects will have the PrivateSrcEPBindId set to zero.",
      "ja": "また、UDP NATセッションがPrivateDstAddr、PrivateDstPort、PublicDstAddr、およびPublicDstPortオブジェクトで任意の一致を使用できることを除いて、フルコーンNATはポート制限コーンNATと同じ方法で実装されている場合があります。 NATセッション内では、これらのオブジェクトの4つすべてがゼロに設定される場合があります。 または、NATセッション内のすべてのアドレスおよびポートオブジェクトにゼロ以外の値を設定できますが、NATセッションのPrivateSrcEPBindIdのTranslationEntityは、双方向に、つまり（outboundSrcEndPointおよびinboundDstEndPoint）または（inboundSrcEndPoint）のビットマスクとして設定できます およびoutboundDstEndPoint）、インターフェイスレルムタイプに応じて。 最後に、対称NATはポートバインディングを維持しません。 そのため、NATセッションオブジェクトのPrivateSrcEPBindIdはゼロに設定されます。"
    },
    {
      "indent": 0,
      "text": "4.7. Notifications",
      "section_title": true,
      "ja": "4.7。 通知"
    },
    {
      "indent": 3,
      "text": "natPacketDiscard notifies the end user/manager of packets being discarded due to lack of address mappings.",
      "ja": "natPacketDiscardは、アドレスマッピングがないために破棄されるパケットをエンドユーザー/マネージャーに通知します。"
    },
    {
      "indent": 0,
      "text": "4.8. Relation Among Tables",
      "section_title": true,
      "ja": "4.8。 テーブル間の関係"
    },
    {
      "indent": 3,
      "text": "The association between the various NAT tables can be represented as follows:",
      "ja": "さまざまなNATテーブル間の関連付けは、次のように表すことができます。"
    },
    {
      "indent": 3,
      "text": "                      Interface\n                          |\n                          |\n                          |\n                     Address map\n                          |\n                          |\n                          |\n     ----------------------------------------------\n    |                                              |\n    |                                              |\n    |                                              |\nAddress Bind                                   Port Bind\n    |                                              |\n    |                                              |\n    |                                              |\n     ----------------------------------------------\n                          |\n                          |\n                          |\n                      NAT Session",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "All NAT functions, with the exception of Symmetric NAT, use Bind(s) to provide the glue necessary for a NAT Session. natSessionPrivateSrcEPBindId and natSessionPrivateDstEPBindId objects represent the endpoint Binds used by NAT Sessions.",
      "ja": "すべてのNAT機能は、対称NATを除き、バインドを使用してNATセッションに必要な接着剤を提供します。 natSessionPrivateSrcEPBindIdおよびnatSessionPrivateDstEPBindIdオブジェクトは、NATセッションで使用されるエンドポイントバインドを表します。"
    },
    {
      "indent": 0,
      "text": "4.9. Configuration via the MIB",
      "section_title": true,
      "ja": "4.9。 MIBを介した設定"
    },
    {
      "indent": 3,
      "text": "Sections 4.1 and 4.2 and part of section 4.3 refer to objects that are configurable on a NAT device. NAT derives Address Bind and Address Port Bind entries from the Address Map table. Hence, an Address Bind or an Address Port Bind entry must not exist without an associated entry in the Address Map table.",
      "ja": "セクション4.1および4.2、およびセクション4.3の一部は、NATデバイスで設定可能なオブジェクトを参照しています。 NATは、アドレスマップテーブルからアドレスバインドおよびアドレスポートバインドエントリを取得します。 したがって、アドレスマップテーブルに関連付けられたエントリがない場合、アドレスバインドまたはアドレスポートバインドエントリは存在してはなりません。"
    },
    {
      "indent": 3,
      "text": "Further, NAT derives NAT session entries from NAT Binds, except in the case of symmetric NAT, which derives translation parameters for a NAT session directly from an address map entry. Hence, with the exception of Symmetric NAT, a NAT session entry must not exist in the NAT Session table without a corresponding bind.",
      "ja": "さらに、NATは、NATセッションの変換パラメータをアドレスマップエントリから直接導出する対称NATの場合を除き、NATバインドからNATセッションエントリを導出します。 したがって、対称NATを除き、NATセッションエントリは、対応するバインドなしでNATセッションテーブルに存在してはなりません。"
    },
    {
      "indent": 3,
      "text": "A Management station may use the following steps to configure entries in the NAT-MIB:",
      "ja": "管理ステーションは、次の手順を使用してNAT-MIBのエントリを設定できます。"
    },
    {
      "indent": 3,
      "text": "- Create an entry in the natInterfaceTable specifying the value of ifIndex as the interface index of the interface on which NAT is being configured. Specify appropriate values, as applicable, for the other objects (e.g., natInterfaceRealm, natInterfaceServiceType) in the table (refer to Section 4.1).",
      "ja": "-NATが設定されているインターフェイスのインターフェイスインデックスとしてifIndexの値を指定するnatInterfaceTableにエントリを作成します。 テーブル内の他のオブジェクト（たとえば、natInterfaceRealm、natInterfaceServiceType）に適切な適切な値を指定します（セクション4.1を参照）。"
    },
    {
      "indent": 3,
      "text": "- Create one or more address map entries sequentially in reduced order of priority in the natAddrMapTable, specifying the value of ifIndex to be the same for all entries. The ifIndex specified would be the same as that specified for natInterfaceTable (refer to Section 4.2).",
      "ja": "-1つ以上のアドレスマップエントリをnatAddrMapTableの優先順位の低い順に連続して作成し、すべてのエントリに対して同じifIndexの値を指定します。 指定されたifIndexは、natInterfaceTableに指定されたものと同じです（セクション4.2を参照）。"
    },
    {
      "indent": 3,
      "text": "- Configure the maximum permitted idle time duration for BINDs and TCP, UDP, and ICMP protocol sessions by setting the relevant scalars in natDefTimeouts object (refer to Section 4.3).",
      "ja": "-natDefTimeoutsオブジェクトに関連するスカラーを設定して、BINDおよびTCP、UDP、ICMPプロトコルセッションの最大許容アイドル時間を設定します（セクション4.3を参照）。"
    },
    {
      "indent": 0,
      "text": "4.10. Relationship to Interface MIB",
      "section_title": true,
      "ja": "4.10。 インターフェイスMIBとの関係"
    },
    {
      "indent": 3,
      "text": "The natInterfaceTable specifies the NAT configuration attributes on each interface. The concept of \"interface\" is as defined by InterfaceIndex/ifIndex of the IETF Interfaces MIB [RFC2863].",
      "ja": "natInterfaceTableは、各インターフェイスのNAT設定属性を指定します。 「インターフェイス」の概念は、IETF Interfaces MIB [RFC2863]のInterfaceIndex / ifIndexで定義されています。"
    },
    {
      "indent": 0,
      "text": "5. Definitions",
      "section_title": true,
      "ja": "5.定義"
    },
    {
      "indent": 3,
      "text": "This MIB module IMPORTs objects from RFCs 2578 [RFC2578], 2579 [RFC2579], 2580 [RFC2580], 2863 [RFC2863], 3411 [RFC3411], and 4001 [RFC4001]. It also refers to information in RFCs 792 [RFC792], 2463 [RFC2463], and 3413 [RFC3413].",
      "ja": "このMIBモジュールは、RFC 2578 [RFC2578]、2579 [RFC2579]、2580 [RFC2580]、2863 [RFC2863]、3411 [RFC3411]、および4001 [RFC4001]からオブジェクトをインポートします。 また、RFC 792 [RFC792]、2463 [RFC2463]、および3413 [RFC3413]の情報も参照します。"
    },
    {
      "indent": 0,
      "text": "NAT-MIB DEFINITIONS ::= BEGIN",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "IMPORTS MODULE-IDENTITY, OBJECT-TYPE, Integer32, Unsigned32, Gauge32, Counter64, TimeTicks, mib-2, NOTIFICATION-TYPE FROM SNMPv2-SMI TEXTUAL-CONVENTION, StorageType, RowStatus",
      "ja": "MODULE-IDENTITY、OBJECT-TYPE、Integer32、Unsigned32、Gauge32、Counter64、TimeTicks、mib-2、SNMPv2-SMI TEXT-CONVENTION、StorageType、RowStatusからのNOTIFICATION-TYPEのインポート"
    },
    {
      "indent": 5,
      "text": "        FROM SNMPv2-TC\nMODULE-COMPLIANCE,\nNOTIFICATION-GROUP,\nOBJECT-GROUP\n        FROM SNMPv2-CONF\nifIndex,\nifCounterDiscontinuityGroup\n        FROM IF-MIB\nSnmpAdminString\n        FROM SNMP-FRAMEWORK-MIB\nInetAddressType,\nInetAddress,\nInetPortNumber\n        FROM INET-ADDRESS-MIB;",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natMIB MODULE-IDENTITY LAST-UPDATED \"200503210000Z\" ORGANIZATION \"IETF Transport Area\" CONTACT-INFO \" Rohit Mascon Global Limited #59/2 100 ft Ring Road Banashankari II Stage Bangalore 560 070 India Phone: +91 80 2679 6227 Email: rrohit74@hotmail.com",
      "ja": "natMIB MODULE-IDENTITY LAST-UPDATED \"200503210000Z\" ORGANIZATION \"IETF Transport Area\"連絡先情報 \"Rohit Mascon Global Limited＃59/2 100 ft Ring Road Banashankari II Stageバンガロール560 070インド電話：+91 80 2679 6227メール：rrohit74 @ hotmail.com"
    },
    {
      "indent": 15,
      "text": "P. Srisuresh\nCaymas Systems, Inc.\n1179-A North McDowell Blvd.\nPetaluma, CA 94954\nTel: (707) 283-5063\nEmail: srisuresh@yahoo.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 15,
      "text": "Rajiv Raghunarayan Cisco Systems Inc. 170 West Tasman Drive San Jose, CA 95134 Phone: +1 408 853 9612 Email: raraghun@cisco.com",
      "ja": "Rajiv Raghunarayan Cisco Systems Inc. 170 West Tasman Drive San Jose、CA 95134電話：+1 408 853 9612電子メール：raraghun@cisco.com"
    },
    {
      "indent": 15,
      "text": "Nalinaksh Pai Cisco Systems, Inc. Prestige Waterford No. 9, Brunton Road Bangalore - 560 025",
      "ja": "Nalinaksh Pai Cisco Systems、Inc. Prestige Waterford No. 9、Brunton Road Bangalore-560 025"
    },
    {
      "indent": 15,
      "text": "India Phone: +91 80 532 1300 Email: npai@cisco.com",
      "ja": "インド電話：+91 80 532 1300電子メール：npai@cisco.com"
    },
    {
      "indent": 5,
      "text": " Cliff Wang Information Security Bank One Corp 1111 Polaris Pkwy Columbus, OH 43240 Phone: +1 614 213 6117 Email: cliffwang2000@yahoo.com \" DESCRIPTION \"This MIB module defines the generic managed objects for NAT.",
      "ja": "Cliff Wang Information Security Bank One Corp 1111 Polaris Pkwy Columbus、OH 43240 Phone：+1 614 213 6117 Email：cliffwang2000@yahoo.com \"DESCRIPTION\"このMIBモジュールは、NATの汎用管理オブジェクトを定義します。"
    },
    {
      "indent": 5,
      "text": "         Copyright (C) The Internet Society (2005).  This version\n         of this MIB module is part of RFC 4008;  see the RFC\n         itself for full legal notices.\"\nREVISION     \"200503210000Z\"  -- 21th March 2005\nDESCRIPTION\n        \"Initial version, published as RFC 4008.\"\n::= { mib-2 123 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natMIBObjects OBJECT IDENTIFIER ::= { natMIB 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "NatProtocolType ::= TEXTUAL-CONVENTION\n       STATUS       current\n       DESCRIPTION\n               \"A list of protocols that support the network\n                address translation.  Inclusion of the values is\n                not intended to imply that those protocols\n                need to be supported.  Any change in this\n                TEXTUAL-CONVENTION should also be reflected in\n                the definition of NatProtocolMap, which is a\n                BITS representation of this.\"\n       SYNTAX   INTEGER {\n                     none (1),  -- not specified\n                     other (2), -- none of the following\n                     icmp (3),\n                     udp (4),\n                     tcp (5)\n                  }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "NatProtocolMap ::= TEXTUAL-CONVENTION\n       STATUS       current\n       DESCRIPTION\n               \"A bitmap of protocol identifiers that support",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 7,
      "text": "         the network address translation.  Any change\n         in this TEXTUAL-CONVENTION should also be\n         reflected in the definition of NatProtocolType.\"\nSYNTAX   BITS {\n           other (0),\n           icmp (1),\n           udp (2),\n           tcp (3)\n         }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "NatAddrMapId ::= TEXTUAL-CONVENTION\n       DISPLAY-HINT \"d\"\n       STATUS current\n       DESCRIPTION\n               \"A unique id that is assigned to each address map\n                by a NAT enabled device.\"\n       SYNTAX   Unsigned32 (1..4294967295)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "NatBindIdOrZero ::= TEXTUAL-CONVENTION\n       DISPLAY-HINT \"d\"\n       STATUS current\n       DESCRIPTION\n               \"A unique id that is assigned to each bind by\n                a NAT enabled device.  The bind id will be zero\n                in the case of a Symmetric NAT.\"\n       SYNTAX   Unsigned32 (0..4294967295)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "NatBindId ::= TEXTUAL-CONVENTION\n       DISPLAY-HINT \"d\"\n       STATUS current\n       DESCRIPTION\n               \"A unique id that is assigned to each bind by\n                a NAT enabled device.\"\n       SYNTAX   Unsigned32 (1..4294967295)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "NatSessionId ::= TEXTUAL-CONVENTION\n       DISPLAY-HINT \"d\"\n       STATUS current\n       DESCRIPTION\n               \"A unique id that is assigned to each session by\n                a NAT enabled device.\"\n       SYNTAX   Unsigned32 (1..4294967295)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "NatBindMode ::= TEXTUAL-CONVENTION\n       STATUS current\n       DESCRIPTION\n               \"An indication of whether the bind is\n                an address bind or an address port bind.\"",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 7,
      "text": "SYNTAX   INTEGER {\n              addressBind (1),\n              addressPortBind (2)\n         }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "NatAssociationType ::= TEXTUAL-CONVENTION\n       STATUS current\n       DESCRIPTION\n               \"An indication of whether the association is\n                static or dynamic.\"\n       SYNTAX   INTEGER {\n                     static (1),\n                     dynamic (2)\n                }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "NatTranslationEntity ::= TEXTUAL-CONVENTION\n       STATUS       current\n       DESCRIPTION\n               \"An indication of a) the direction of a session for\n                which an address map entry, address bind or port\n                bind is applicable, and b) the entity (source or\n                destination) within the session that is subject to\n                translation.\"\n       SYNTAX   BITS {\n                  inboundSrcEndPoint (0),\n                  outboundDstEndPoint(1),\n                  inboundDstEndPoint (2),\n                  outboundSrcEndPoint(3)\n                }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- -- Default Values for the Bind and NAT Protocol Timers --",
      "ja": "--バインドおよびNATプロトコルタイマーのデフォルト値-"
    },
    {
      "indent": 0,
      "text": "natDefTimeouts OBJECT IDENTIFIER ::= { natMIBObjects 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natNotifCtrl OBJECT IDENTIFIER ::= { natMIBObjects 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- -- Address Bind and Port Bind related NAT configuration --",
      "ja": "--アドレスバインドおよびポートバインド関連のNAT構成-"
    },
    {
      "indent": 0,
      "text": "natBindDefIdleTimeout OBJECT-TYPE SYNTAX Unsigned32 (0..4294967295) UNITS \"seconds\" MAX-ACCESS read-write STATUS current DESCRIPTION",
      "ja": "natBindDefIdleTimeout OBJECT-TYPE構文Unsigned32（0..4294967295）UNITS \"秒\" MAX-ACCESS読み取りと書き込みステータス現在の説明"
    },
    {
      "indent": 12,
      "text": "\"The default Bind (Address Bind or Port Bind) idle\n timeout parameter.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "         If the agent is capable of storing non-volatile\n         configuration, then the value of this object must be\n         restored after a re-initialization of the management\n         system.\"\nDEFVAL { 0 }\n::= { natDefTimeouts 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- -- UDP related NAT configuration --",
      "ja": "--UDP関連のNAT設定-"
    },
    {
      "indent": 0,
      "text": "natUdpDefIdleTimeout OBJECT-TYPE SYNTAX Unsigned32 (1..4294967295) UNITS \"seconds\" MAX-ACCESS read-write STATUS current DESCRIPTION \"The default UDP idle timeout parameter.",
      "ja": "natUdpDefIdleTimeout OBJECT-TYPE構文Unsigned32（1..4294967295）UNITS \"seconds\" MAX-ACCESS読み取りと書き込みステータス現在の説明「デフォルトUDPアイドルタイムアウトパラメータ。"
    },
    {
      "indent": 4,
      "text": "         If the agent is capable of storing non-volatile\n         configuration, then the value of this object must be\n         restored after a re-initialization of the management\n         system.\"\nDEFVAL { 300 }\n::= { natDefTimeouts 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- -- ICMP related NAT configuration --",
      "ja": "--ICMP関連のNAT設定-"
    },
    {
      "indent": 0,
      "text": "natIcmpDefIdleTimeout OBJECT-TYPE SYNTAX Unsigned32 (1..4294967295) UNITS \"seconds\" MAX-ACCESS read-write STATUS current DESCRIPTION \"The default ICMP idle timeout parameter.",
      "ja": "natIcmpDefIdleTimeout OBJECT-TYPE構文Unsigned32（1..4294967295）UNITS「秒」MAX-ACCESS読み取りと書き込みステータス現在の説明「デフォルトICMPアイドルタイムアウトパラメータ。"
    },
    {
      "indent": 4,
      "text": "         If the agent is capable of storing non-volatile\n         configuration, then the value of this object must be\n         restored after a re-initialization of the management\n         system.\"\nDEFVAL { 300 }\n::= { natDefTimeouts 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- -- Other protocol parameters --",
      "ja": "--その他のプロトコルパラメータ-"
    },
    {
      "indent": 0,
      "text": "natOtherDefIdleTimeout OBJECT-TYPE SYNTAX Unsigned32 (1..4294967295) UNITS \"seconds\" MAX-ACCESS read-write STATUS current DESCRIPTION \"The default idle timeout parameter for protocols represented by the value other (2) in NatProtocolType.",
      "ja": "natOtherDefIdleTimeout OBJECT-TYPE SYNTAX Unsigned32（1..4294967295）UNITS \"seconds\" MAX-ACCESS読み取りと書き込みステータス現在の説明「NatProtocolTypeの値other（2）によって表されるプロトコルのデフォルトアイドルタイムアウトパラメータ。"
    },
    {
      "indent": 4,
      "text": "         If the agent is capable of storing non-volatile\n         configuration, then the value of this object must be\n         restored after a re-initialization of the management\n         system.\"\nDEFVAL { 60 }\n::= { natDefTimeouts 4 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- -- TCP related NAT Timers --",
      "ja": "--TCP関連のNATタイマー-"
    },
    {
      "indent": 0,
      "text": "natTcpDefIdleTimeout OBJECT-TYPE SYNTAX Unsigned32 (1..4294967295) UNITS \"seconds\" MAX-ACCESS read-write STATUS current DESCRIPTION \"The default time interval that a NAT session for an established TCP connection is allowed to remain valid without any activity on the TCP connection.",
      "ja": "natTcpDefIdleTimeout OBJECT-TYPE SYNTAX Unsigned32（1..4294967295）UNITS \"seconds\" MAX-ACCESS読み取りと書き込みステータス現在の説明 接続。"
    },
    {
      "indent": 4,
      "text": "         If the agent is capable of storing non-volatile\n         configuration, then the value of this object must be\n         restored after a re-initialization of the management\n         system.\"\nDEFVAL { 86400 }\n::= { natDefTimeouts 5 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natTcpDefNegTimeout OBJECT-TYPE SYNTAX Unsigned32 (1..4294967295) UNITS \"seconds\" MAX-ACCESS read-write STATUS current DESCRIPTION",
      "ja": "natTcpDefNegTimeout OBJECT-TYPE構文Unsigned32（1..4294967295）UNITS \"seconds\" MAX-ACCESS読み取りと書き込みステータス現在の説明"
    },
    {
      "indent": 12,
      "text": "\"The default time interval that a NAT session for a TCP\n connection that is not in the established state\n is allowed to remain valid without any activity on\n the TCP connection.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "         If the agent is capable of storing non-volatile\n         configuration, then the value of this object must be\n         restored after a re-initialization of the management\n         system.\"\nDEFVAL { 60 }\n::= { natDefTimeouts 6 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natNotifThrottlingInterval OBJECT-TYPE SYNTAX Integer32 (0 | 5..3600) UNITS \"seconds\" MAX-ACCESS read-write STATUS current DESCRIPTION \"This object controls the generation of the natPacketDiscard notification.",
      "ja": "natNotifThrottlingInterval OBJECT-TYPE SYNTAX Integer32（0 | 5..3600）UNITS「秒」MAX-ACCESS読み取りと書き込みステータス現在の説明「このオブジェクトはnatPacketDiscard通知の生成を制御します。"
    },
    {
      "indent": 13,
      "text": "If this object has a value of zero, then no\nnatPacketDiscard notifications will be transmitted by the\nagent.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 13,
      "text": "If this object has a non-zero value, then the agent must not generate more than one natPacketDiscard 'notification-event' in the indicated period, where a 'notification-event' is the generation of a single notification PDU type to a list of notification destinations. If additional NAT packets are discarded within the throttling period, then notification-events for these changes must be suppressed by the agent until the current throttling period expires.",
      "ja": "このオブジェクトにゼロ以外の値がある場合、エージェントは示された期間の複数のnatPacketDiscard「notification-event」を生成してはなりません、「notification-event」はリストへの単一の通知PDUタイプの生成です 通知先。 調整期間内に追加のNATパケットが破棄された場合、これらの変更の通知イベントは、現在の調整期間が終了するまでエージェントによって抑制される必要があります。"
    },
    {
      "indent": 13,
      "text": "If natNotifThrottlingInterval notification generation is enabled, the suggested default throttling period is 60 seconds, but generation of the natPacketDiscard notification should be disabled by default.",
      "ja": "natNotifThrottlingInterval通知の生成が有効になっている場合、推奨されるデフォルトの調整期間は60秒ですが、natPacketDiscard通知の生成はデフォルトで無効にする必要があります。"
    },
    {
      "indent": 13,
      "text": "If the agent is capable of storing non-volatile configuration, then the value of this object must be restored after a re-initialization of the management system.",
      "ja": "エージェントが不揮発性設定を保存できる場合、管理システムの再初期化後にこのオブジェクトの値を復元する必要があります。"
    },
    {
      "indent": 4,
      "text": " The actual transmission of notifications is controlled via the MIB modules in RFC 3413.\" DEFVAL { 0 }",
      "ja": "通知の実際の送信は、RFC 3413のMIBモジュールを介して制御されます。 \"DEFVAL {0}"
    },
    {
      "indent": 4,
      "text": "::= { natNotifCtrl 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- -- The NAT Interface Table --",
      "ja": "--NATインターフェイステーブル-"
    },
    {
      "indent": 0,
      "text": "natInterfaceTable OBJECT-TYPE\n    SYNTAX      SEQUENCE OF NatInterfaceEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n            \"This table specifies the attributes for interfaces on a\n             device supporting NAT function.\"\n    ::= { natMIBObjects 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natInterfaceEntry OBJECT-TYPE SYNTAX NatInterfaceEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"Each entry in the natInterfaceTable holds a set of parameters for an interface, instantiated by ifIndex. Therefore, the interface index must have been assigned, according to the applicable procedures, before it can be meaningfully used. Generally, this means that the interface must exist.",
      "ja": "natInterfaceEntry OBJECT-TYPE SYNTAX NatInterfaceEntry MAX-ACCESSアクセス不能STATUS現在の説明「natInterfaceTableの各エントリは、ifIndexによってインスタンス化されたインターフェイスのパラメータセットを保持します。したがって、適用可能な手順に従って、インターフェイスインデックスを割り当てる必要があります。 通常、これはインターフェースが存在する必要があることを意味します。"
    },
    {
      "indent": 4,
      "text": "         When natStorageType is of type nonVolatile, however,\n         this may reflect the configuration for an interface whose\n         ifIndex has been assigned but for which the supporting\n         implementation is not currently present.\"\nINDEX   { ifIndex }\n::= { natInterfaceTable 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "NatInterfaceEntry ::= SEQUENCE {\n    natInterfaceRealm            INTEGER,\n    natInterfaceServiceType      BITS,\n    natInterfaceInTranslates     Counter64,\n    natInterfaceOutTranslates    Counter64,\n    natInterfaceDiscards         Counter64,\n    natInterfaceStorageType      StorageType,\n    natInterfaceRowStatus        RowStatus\n}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natInterfaceRealm OBJECT-TYPE SYNTAX INTEGER { private (1), public (2)",
      "ja": "natInterfaceRealm OBJECT-TYPE SYNTAX INTEGER {プライベート（1）、パブリック（2）"
    },
    {
      "indent": 4,
      "text": "           }\nMAX-ACCESS read-create\nSTATUS     current\nDESCRIPTION\n        \"This object identifies whether this interface is\n         connected to the private or the public realm.\"\nDEFVAL  { public }\n::= { natInterfaceEntry 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natInterfaceServiceType OBJECT-TYPE\n    SYNTAX  BITS {\n                basicNat (0),\n                napt (1),\n                bidirectionalNat (2),\n                twiceNat (3)\n            }\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n            \"An indication of the direction in which new sessions\n             are permitted and the extent of translation done within\n             the IP and transport headers.\"\n    ::= { natInterfaceEntry 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natInterfaceInTranslates OBJECT-TYPE\n    SYNTAX     Counter64\n    MAX-ACCESS read-only\n    STATUS     current\n    DESCRIPTION\n            \"Number of packets received on this interface that\n             were translated.\n             Discontinuities in the value of this counter can occur at\n             reinitialization of the management system and at other\n             times as indicated by the value of\n             ifCounterDiscontinuityTime on the relevant interface.\"\n    ::= { natInterfaceEntry 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natInterfaceOutTranslates OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current DESCRIPTION \"Number of translated packets that were sent out this interface.",
      "ja": "natInterfaceOutTranslates OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS読み取り専用ステータス現在の説明「このインターフェイスを送信された変換されたパケットの数。"
    },
    {
      "indent": 4,
      "text": "         Discontinuities in the value of this counter can occur at\n         reinitialization of the management system and at other\n         times as indicated by the value of ifCounterDiscontinuityTime on the relevant interface.\"\n::= { natInterfaceEntry 4 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natInterfaceDiscards OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current DESCRIPTION \"Number of packets that had to be rejected/dropped due to a lack of resources for this interface.",
      "ja": "natInterfaceDiscards OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS読み取り専用ステータス現在の説明「このインターフェイスのためのリソースの欠乏が原因で拒否された/廃棄されなければならなかったパケットの数。"
    },
    {
      "indent": 5,
      "text": "        Discontinuities in the value of this counter can occur at\n        reinitialization of the management system and at other\n        times as indicated by the value of\n        ifCounterDiscontinuityTime on the relevant interface.\"\n::= { natInterfaceEntry 5 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natInterfaceStorageType OBJECT-TYPE\n    SYNTAX      StorageType\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n            \"The storage type for this conceptual row.\n             Conceptual rows having the value 'permanent'\n             need not allow write-access to any columnar objects\n             in the row.\"\n    REFERENCE\n            \"Textual Conventions for SMIv2, Section 2.\"\n    DEFVAL { nonVolatile }\n    ::= { natInterfaceEntry 6 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natInterfaceRowStatus OBJECT-TYPE SYNTAX RowStatus MAX-ACCESS read-create STATUS current DESCRIPTION \"The status of this conceptual row.",
      "ja": "natInterfaceRowStatus OBJECT-TYPE構文RowStatus MAX-ACCESS読み取り作成ステータス現在の説明「この概念的な列のステータス。"
    },
    {
      "indent": 13,
      "text": "Until instances of all corresponding columns are\nappropriately configured, the value of the\ncorresponding instance of the natInterfaceRowStatus\ncolumn is 'notReady'.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 13,
      "text": "In particular, a newly created row cannot be made active until the corresponding instance of natInterfaceServiceType has been set.",
      "ja": "特に、natInterfaceServiceTypeの対応するインスタンスが設定されるまで、新しく作成された行をアクティブにすることはできません。"
    },
    {
      "indent": 4,
      "text": "         None of the objects in this row may be modified\n         while the value of this object is active(1).\"\nREFERENCE\n        \"Textual Conventions for SMIv2, Section 2.\"\n::= { natInterfaceEntry 7 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- -- The Address Map Table --",
      "ja": "--アドレスマップテーブル-"
    },
    {
      "indent": 0,
      "text": "natAddrMapTable OBJECT-TYPE\n    SYNTAX      SEQUENCE OF NatAddrMapEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n            \"This table lists address map parameters for NAT.\"\n    ::= { natMIBObjects 4 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrMapEntry OBJECT-TYPE\n    SYNTAX      NatAddrMapEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n            \"This entry represents an address map to be used for\n             NAT and contributes to the dynamic and/or static\n             address mapping tables of the NAT device.\"\n    INDEX   { ifIndex, natAddrMapIndex }\n    ::= { natAddrMapTable 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "NatAddrMapEntry ::= SEQUENCE {\n    natAddrMapIndex                 NatAddrMapId,\n    natAddrMapName                  SnmpAdminString,\n    natAddrMapEntryType             NatAssociationType,\n    natAddrMapTranslationEntity     NatTranslationEntity,\n    natAddrMapLocalAddrType         InetAddressType,\n    natAddrMapLocalAddrFrom         InetAddress,\n    natAddrMapLocalAddrTo           InetAddress,\n    natAddrMapLocalPortFrom         InetPortNumber,\n    natAddrMapLocalPortTo           InetPortNumber,\n    natAddrMapGlobalAddrType        InetAddressType,\n    natAddrMapGlobalAddrFrom        InetAddress,\n    natAddrMapGlobalAddrTo          InetAddress,\n    natAddrMapGlobalPortFrom        InetPortNumber,\n    natAddrMapGlobalPortTo          InetPortNumber,\n    natAddrMapProtocol              NatProtocolMap,\n    natAddrMapInTranslates          Counter64,\n    natAddrMapOutTranslates         Counter64,\n    natAddrMapDiscards              Counter64, natAddrMapAddrUsed              Gauge32,\n    natAddrMapStorageType           StorageType,\n    natAddrMapRowStatus             RowStatus\n}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrMapIndex  OBJECT-TYPE\n    SYNTAX      NatAddrMapId\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n            \"Along with ifIndex, this object uniquely\n             identifies an entry in the natAddrMapTable.\n             Address map entries are applied in the order\n             specified by natAddrMapIndex.\"\n    ::= { natAddrMapEntry 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrMapName OBJECT-TYPE\n    SYNTAX      SnmpAdminString (SIZE(1..32))\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n            \"Name identifying all map entries in the table associated\n             with the same interface.  All map entries with the same\n             ifIndex MUST have the same map name.\"\n    ::= { natAddrMapEntry 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrMapEntryType OBJECT-TYPE\n    SYNTAX      NatAssociationType\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n            \"This parameter can be used to set up static\n             or dynamic address maps.\"\n    ::= { natAddrMapEntry 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrMapTranslationEntity OBJECT-TYPE SYNTAX NatTranslationEntity MAX-ACCESS read-create STATUS current DESCRIPTION \"The end-point entity (source or destination) in inbound or outbound sessions (i.e., first packets) that may be translated by an address map entry.",
      "ja": "natAddrMapTranslationEntity OBJECT-TYPE構文NatTranslationEntity MAX-ACCESS読み取り作成ステータス現在の記述「アドレスマップエントリによって変換されるかもしれない着信または発信セッション（すなわち、最初のパケット）のエンドポイントエンティティ（ソースまたは宛先）。"
    },
    {
      "indent": 13,
      "text": "Session direction (inbound or outbound) is\nderived from the direction of the first packet\nof a session traversing a NAT interface.\nNAT address (and Transport-ID) maps may be defined to effect inbound or outbound sessions.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 13,
      "text": "Traditionally, address maps for Basic NAT and NAPT are configured on a public interface for outbound sessions, effecting translation of source end-point. The value of this object must be set to outboundSrcEndPoint for those interfaces.",
      "ja": "従来、Basic NATおよびNAPTのアドレスマップは、発信セッションのパブリックインターフェイス上で構成され、ソースエンドポイントの変換に影響を与えていました。 これらのインターフェイスでは、このオブジェクトの値をoutboundSrcEndPointに設定する必要があります。"
    },
    {
      "indent": 13,
      "text": "Alternately, if address maps for Basic NAT and NAPT were to be configured on a private interface, the desired value for this object for the map entries would be inboundSrcEndPoint (i.e., effecting translation of source end-point for inbound sessions).",
      "ja": "または、Basic NATおよびNAPTのアドレスマップがプライベートインターフェイスで設定される場合、マップエントリのこのオブジェクトに必要な値はinboundSrcEndPointになります（つまり、インバウンドセッションのソースエンドポイントの変換に影響します）。"
    },
    {
      "indent": 4,
      "text": "         If TwiceNAT were to be configured on a private interface,\n         the desired value for this object for the map entries\n         would be a bitmask of inboundSrcEndPoint and\n         inboundDstEndPoint.\"\n::= { natAddrMapEntry 4 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrMapLocalAddrType OBJECT-TYPE\n    SYNTAX      InetAddressType\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n            \"This object specifies the address type used for\n             natAddrMapLocalAddrFrom and natAddrMapLocalAddrTo.\"\n    ::= { natAddrMapEntry 5 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrMapLocalAddrFrom OBJECT-TYPE SYNTAX InetAddress MAX-ACCESS read-create STATUS current DESCRIPTION \"This object specifies the first IP address of the range of IP addresses mapped by this translation entry. The value of this object must be less than or equal to the value of the natAddrMapLocalAddrTo object.",
      "ja": "natAddrMapLocalAddrFrom OBJECT-TYPE SYNTAX InetAddress MAX-ACCESS read-create STATUSの現在の説明「このオブジェクトはこの変換エントリによってマッピングされるIPアドレスの範囲の最初のIPアドレスを指定します。このオブジェクトの値は次の値以下である必要があります natAddrMapLocalAddrToオブジェクト。"
    },
    {
      "indent": 4,
      "text": "         The type of this address is determined by the value of\n         the natAddrMapLocalAddrType object.\"\n::= { natAddrMapEntry 6 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrMapLocalAddrTo OBJECT-TYPE SYNTAX InetAddress MAX-ACCESS read-create STATUS current DESCRIPTION",
      "ja": "natAddrMapLocalAddrTo OBJECT-TYPE構文InetAddress MAX-ACCESS読み取り作成ステータス現在の説明"
    },
    {
      "indent": 12,
      "text": "\"This object specifies the last IP address of the range of\n IP addresses mapped by this translation entry.  If only\n a single address is being mapped, the value of this object\n is equal to the value of natAddrMapLocalAddrFrom.  For a\n static NAT, the number of addresses in the range defined\n by natAddrMapLocalAddrFrom and natAddrMapLocalAddrTo must\n be equal to the number of addresses in the range defined by\n natAddrMapGlobalAddrFrom and natAddrMapGlobalAddrTo.\n The value of this object must be greater than or equal to\n the value of the natAddrMapLocalAddrFrom object.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "         The type of this address is determined by the value of\n         the natAddrMapLocalAddrType object.\"\n::= { natAddrMapEntry 7 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrMapLocalPortFrom OBJECT-TYPE SYNTAX InetPortNumber MAX-ACCESS read-create STATUS current DESCRIPTION \"If this conceptual row describes a Basic NAT address mapping, then the value of this object must be zero. If this conceptual row describes NAPT, then the value of this object specifies the first port number in the range of ports being mapped.",
      "ja": "natAddrMapLocalPortFrom OBJECT-TYPE SYNTAX InetPortNumber MAX-ACCESS read-create STATUS現在の説明「この概念的な列が基本的なNATアドレスマッピングを記述する場合、このオブジェクトの値はゼロである必要があります。 マッピングされるポート範囲の最初のポート番号を指定します。"
    },
    {
      "indent": 4,
      "text": "         The value of this object must be less than or equal to the\n         value of the natAddrMapLocalPortTo object.  If the\n         translation specifies a single port, then the value of this\n         object is equal to the value of natAddrMapLocalPortTo.\"\nDEFVAL { 0 }\n::= { natAddrMapEntry 8 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrMapLocalPortTo OBJECT-TYPE SYNTAX InetPortNumber MAX-ACCESS read-create STATUS current DESCRIPTION \"If this conceptual row describes a Basic NAT address mapping, then the value of this object must be zero. If this conceptual row describes NAPT, then the value of this object specifies the last port number in the range of ports being mapped.",
      "ja": "natAddrMapLocalPortTo OBJECT-TYPE SYNTAX InetPortNumber MAX-ACCESS read-create STATUS現在の説明「この概念的な列が基本的なNATアドレスマッピングを記述する場合、このオブジェクトの値はゼロである必要があります。この概念的な行がNAPTを記述すれば、このオブジェクトの値 マッピングされるポートの範囲内の最後のポート番号を指定します。"
    },
    {
      "indent": 13,
      "text": "The value of this object must be greater than or equal to\nthe value of the natAddrMapLocalPortFrom object.  If the\ntranslation specifies a single port, then the value of this\nobject is equal to the value of natAddrMapLocalPortFrom.\"",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "DEFVAL { 0 }\n::= { natAddrMapEntry 9 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrMapGlobalAddrType OBJECT-TYPE\n    SYNTAX      InetAddressType\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n            \"This object specifies the address type used for\n             natAddrMapGlobalAddrFrom and natAddrMapGlobalAddrTo.\"\n    ::= { natAddrMapEntry 10 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrMapGlobalAddrFrom OBJECT-TYPE SYNTAX InetAddress MAX-ACCESS read-create STATUS current DESCRIPTION \"This object specifies the first IP address of the range of IP addresses being mapped to. The value of this object must be less than or equal to the value of the natAddrMapGlobalAddrTo object.",
      "ja": "natAddrMapGlobalAddrFrom OBJECT-TYPE SYNTAX InetAddress MAX-ACCESS read-create STATUS現在の説明「このオブジェクトはマッピングされるIPアドレスの範囲の最初のIPアドレスを指定します。このオブジェクトの値はnatAddrMapGlobalAddrToの値以下である必要があります オブジェクト。"
    },
    {
      "indent": 4,
      "text": "         The type of this address is determined by the value of\n         the natAddrMapGlobalAddrType object.\"\n::= { natAddrMapEntry 11 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrMapGlobalAddrTo OBJECT-TYPE SYNTAX InetAddress MAX-ACCESS read-create STATUS current DESCRIPTION \"This object specifies the last IP address of the range of IP addresses being mapped to. If only a single address is being mapped to, the value of this object is equal to the value of natAddrMapGlobalAddrFrom. For a static NAT, the number of addresses in the range defined by natAddrMapGlobalAddrFrom and natAddrMapGlobalAddrTo must be equal to the number of addresses in the range defined by natAddrMapLocalAddrFrom and natAddrMapLocalAddrTo. The value of this object must be greater than or equal to the value of the natAddrMapGlobalAddrFrom object.",
      "ja": "natAddrMapGlobalAddrTo OBJECT-TYPE SYNTAX I 静的NATの場合、natAddrMapGlobalAddrFromとnatAddrMapGlobalAddrToで定義された範囲のアドレスの数は、natAddrMapLocalAddrFromとnatAddrMapLocalAddrToで定義された範囲のアドレスの数と等しくなければなりません。このオブジェクトの値は、 natAddrMapGlobalAddrFromオブジェクトの値と等しい。"
    },
    {
      "indent": 4,
      "text": "         The type of this address is determined by the value of\n         the natAddrMapGlobalAddrType object.\"\n::= { natAddrMapEntry 12 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrMapGlobalPortFrom OBJECT-TYPE SYNTAX InetPortNumber",
      "ja": "natAddrMapGlobalPortFrom OBJECT-TYPE構文InetPortNumber"
    },
    {
      "indent": 4,
      "text": "MAX-ACCESS  read-create\nSTATUS      current\nDESCRIPTION\n        \"If this conceptual row describes a Basic NAT address\n         mapping, then the value of this object must be zero.  If\n         this conceptual row describes NAPT, then the value of\n         this object specifies the first port number in the range\n         of ports being mapped to.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "         The value of this object must be less than or equal to the\n         value of the natAddrMapGlobalPortTo object.  If the\n         translation specifies a single port, then the value of this\n         object is equal to the value natAddrMapGlobalPortTo.\"\nDEFVAL { 0 }\n::= { natAddrMapEntry 13 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrMapGlobalPortTo OBJECT-TYPE SYNTAX InetPortNumber MAX-ACCESS read-create STATUS current DESCRIPTION \"If this conceptual row describes a Basic NAT address mapping, then the value of this object must be zero. If this conceptual row describes NAPT, then the value of this object specifies the last port number in the range of ports being mapped to.",
      "ja": "natAddrMapGlobalPortTo OBJECT-TYPE SYNTAX InetPortNumber MAX-ACCESS read-create STATUS現在の説明「この概念的な列が基本的なNATアドレスマッピングを記述する場合、このオブジェクトの値はゼロである必要があります。 マッピングされるポート範囲の最後のポート番号を指定します。"
    },
    {
      "indent": 4,
      "text": "         The value of this object must be greater than or equal to\n         the value of the natAddrMapGlobalPortFrom object.  If the\n         translation specifies a single port, then the value of this\n         object is equal to the value of natAddrMapGlobalPortFrom.\"\nDEFVAL { 0 }\n::= { natAddrMapEntry 14 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrMapProtocol OBJECT-TYPE\n    SYNTAX      NatProtocolMap\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n            \"This object specifies a bitmap of protocol identifiers.\"\n    ::= { natAddrMapEntry 15 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrMapInTranslates OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current DESCRIPTION",
      "ja": "natAddrMapInTranslates OBJECT-TYPE構文Counter64 MAX-ACCESS読み取り専用ステータス現在の説明"
    },
    {
      "indent": 12,
      "text": "\"The number of inbound packets pertaining to this address\n map entry that were translated.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "         Discontinuities in the value of this counter can occur at\n         reinitialization of the management system and at other\n         times, as indicated by the value of\n         ifCounterDiscontinuityTime on the relevant interface.\"\n::= { natAddrMapEntry 16 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrMapOutTranslates OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current DESCRIPTION \"The number of outbound packets pertaining to this address map entry that were translated.",
      "ja": "natAddrMapOutTranslates OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS読み取り専用ステータス現在の説明「変換されたこのアドレスマップエントリに関連する発信パケットの数。"
    },
    {
      "indent": 4,
      "text": "         Discontinuities in the value of this counter can occur at\n         reinitialization of the management system and at other\n         times, as indicated by the value of\n         ifCounterDiscontinuityTime on the relevant interface.\"\n::= { natAddrMapEntry 17 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrMapDiscards OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current DESCRIPTION \"The number of packets pertaining to this address map entry that were dropped due to lack of addresses in the address pool identified by this address map. The value of this object must always be zero in case of static address map.",
      "ja": "natAddrMapDiscards OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS読み取り専用ステータス現在の説明「このアドレスマップによって識別されるアドレスプールのアドレスの不足が原因で廃棄されたこのアドレスマップエントリに関連するパケットの数。このオブジェクトの値は 静的アドレスマップの場合は常にゼロです。"
    },
    {
      "indent": 4,
      "text": "         Discontinuities in the value of this counter can occur at\n         reinitialization of the management system and at other\n         times, as indicated by the value of\n         ifCounterDiscontinuityTime on the relevant interface.\"\n::= { natAddrMapEntry 18 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrMapAddrUsed OBJECT-TYPE\n    SYNTAX     Gauge32\n    MAX-ACCESS read-only\n    STATUS     current\n    DESCRIPTION\n            \"The number of addresses pertaining to this address map\n             that are currently being used from the NAT pool.\n             The value of this object must always be zero in the case of a static address map.\"\n    ::= { natAddrMapEntry 19 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrMapStorageType OBJECT-TYPE\n    SYNTAX      StorageType\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n            \"The storage type for this conceptual row.\n             Conceptual rows having the value 'permanent'\n             need not allow write-access to any columnar objects\n             in the row.\"\n    REFERENCE\n            \"Textual Conventions for SMIv2, Section 2.\"\n    DEFVAL { nonVolatile }\n    ::= { natAddrMapEntry 20 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrMapRowStatus OBJECT-TYPE SYNTAX RowStatus MAX-ACCESS read-create STATUS current DESCRIPTION \"The status of this conceptual row.",
      "ja": "natAddrMapRowStatus OBJECT-TYPE構文RowStatus MAX-ACCESS読み取り作成ステータス現在の説明「この概念的な列のステータス。"
    },
    {
      "indent": 13,
      "text": "Until instances of all corresponding columns are\nappropriately configured, the value of the\ncorresponding instance of the natAddrMapRowStatus\ncolumn is 'notReady'.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "         None of the objects in this row may be modified\n         while the value of this object is active(1).\"\nREFERENCE\n        \"Textual Conventions for SMIv2, Section 2.\"\n::= { natAddrMapEntry 21 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- -- Address Bind section --",
      "ja": "--アドレスバインドセクション-"
    },
    {
      "indent": 0,
      "text": "natAddrBindNumberOfEntries OBJECT-TYPE\n    SYNTAX     Gauge32\n    MAX-ACCESS read-only\n    STATUS     current\n    DESCRIPTION\n            \"This object maintains a count of the number of entries\n             that currently exist in the natAddrBindTable.\"\n    ::= { natMIBObjects 5 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- -- The NAT Address BIND Table --",
      "ja": "--NATアドレスBINDテーブル-"
    },
    {
      "indent": 0,
      "text": "natAddrBindTable OBJECT-TYPE\n    SYNTAX     SEQUENCE OF NatAddrBindEntry\n    MAX-ACCESS not-accessible\n    STATUS     current\n    DESCRIPTION\n            \"This table holds information about the currently\n             active NAT BINDs.\"\n    ::= { natMIBObjects 6 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrBindEntry OBJECT-TYPE SYNTAX NatAddrBindEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"Each entry in this table holds information about an active address BIND. These entries are lost upon agent restart.",
      "ja": "natAddrBindEntry OBJECT-TYPE構文NatAddrBindEntry MAX-ACCESSアクセス不能STATUS現在の説明「この表の各エントリはアクティブアドレスBINDについての情報を保持します。これらのエントリはエージェントの再始動で失われます。"
    },
    {
      "indent": 13,
      "text": "This row has indexing which may create variables with\nmore than 128 subidentifiers.  Implementers of this table\nmust be careful not to create entries that would result\nin OIDs which exceed the 128 subidentifier limit.\nOtherwise, the information cannot be accessed using\nSNMPv1, SNMPv2c or SNMPv3.\"",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "INDEX   { ifIndex, natAddrBindLocalAddrType, natAddrBindLocalAddr }\n::= { natAddrBindTable 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "NatAddrBindEntry ::= SEQUENCE {\n    natAddrBindLocalAddrType        InetAddressType,\n    natAddrBindLocalAddr            InetAddress,\n    natAddrBindGlobalAddrType       InetAddressType,\n    natAddrBindGlobalAddr           InetAddress,\n    natAddrBindId                   NatBindId,\n    natAddrBindTranslationEntity    NatTranslationEntity,\n    natAddrBindType                 NatAssociationType,\n    natAddrBindMapIndex             NatAddrMapId,\n    natAddrBindSessions             Gauge32,\n    natAddrBindMaxIdleTime          TimeTicks,\n    natAddrBindCurrentIdleTime      TimeTicks,\n    natAddrBindInTranslates         Counter64,\n    natAddrBindOutTranslates        Counter64\n} natAddrBindLocalAddrType OBJECT-TYPE\n    SYNTAX      InetAddressType\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n            \"This object specifies the address type used for\n             natAddrBindLocalAddr.\"\n    ::= { natAddrBindEntry 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrBindLocalAddr OBJECT-TYPE SYNTAX InetAddress MAX-ACCESS not-accessible STATUS current DESCRIPTION \"This object represents the private-realm specific network layer address, which maps to the public-realm address represented by natAddrBindGlobalAddr.",
      "ja": "natAddrBindLocalAddr OBJECT-TYPE構文InetAddress MAX-ACCESSアクセス不能ステータス現在の説明「このオブジェクトはnatAddrBindGlobalAddrによって表されるパブリックレルムアドレスにマップするプライベートレルム特定のネットワークレイヤアドレスを表します。"
    },
    {
      "indent": 3,
      "text": "          The type of this address is determined by the value of\n          the natAddrBindLocalAddrType object.\"\n::= { natAddrBindEntry 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrBindGlobalAddrType OBJECT-TYPE\n    SYNTAX      InetAddressType\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"This object specifies the address type used for\n             natAddrBindGlobalAddr.\"\n    ::= { natAddrBindEntry 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrBindGlobalAddr OBJECT-TYPE SYNTAX InetAddress MAX-ACCESS read-only STATUS current DESCRIPTION \"This object represents the public-realm network layer address that maps to the private-realm network layer address represented by natAddrBindLocalAddr.",
      "ja": "natAddrBindGlobalAddr OBJECT-TYPE構文InetAddress MAX-ACCESS読み取り専用ステータス現在の説明「このオブジェクトはnatAddrBindLocalAddrによって表されるプライベートレルムネットワークレイヤアドレスにマッピングするパブリックレルムネットワークレイヤアドレスを表します。"
    },
    {
      "indent": 4,
      "text": "         The type of this address is determined by the value of\n         the natAddrBindGlobalAddrType object.\"\n::= { natAddrBindEntry 4 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrBindId OBJECT-TYPE SYNTAX NatBindId MAX-ACCESS read-only STATUS current",
      "ja": "natAddrBindId OBJECT-TYPE構文NatBindId MAX-ACCESS読み取り専用ステータス現在"
    },
    {
      "indent": 4,
      "text": "DESCRIPTION\n        \"This object represents a bind id that is dynamically\n         assigned to each bind by a NAT enabled device.  Each\n         bind is represented by a bind id that is\n         unique across both, the natAddrBindTable and the\n         natAddrPortBindTable.\"\n::= { natAddrBindEntry 5 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrBindTranslationEntity OBJECT-TYPE SYNTAX NatTranslationEntity MAX-ACCESS read-only STATUS current DESCRIPTION \"This object represents the direction of sessions for which this bind is applicable and the endpoint entity (source or destination) within the sessions that is subject to translation using the BIND.",
      "ja": "natAddrBindTranslationEntity OBJECT-TYPE構文NatTranslationEntity MAX-ACCESS読み取り専用ステータス現在の説明「このオブジェクトはこのバインドが適用可能であるセッションの方向およびBINDを使用して変換に応じるセッション内のエンドポイントエンティティ（ソースまたは宛先）を表します。"
    },
    {
      "indent": 13,
      "text": "Orientation of the bind can be a superset of\ntranslationEntity of the address map entry which\nforms the basis for this bind.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "         For example, if the translationEntity of an\n         address map entry is outboundSrcEndPoint, the\n         translationEntity of a bind derived from this\n         map entry may either be outboundSrcEndPoint or\n         it may be bidirectional (a bitmask of\n         outboundSrcEndPoint and inboundDstEndPoint).\"\n::= { natAddrBindEntry 6 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrBindType OBJECT-TYPE\n    SYNTAX     NatAssociationType\n    MAX-ACCESS read-only\n    STATUS     current\n    DESCRIPTION\n            \"This object indicates whether the bind is static or\n             dynamic.\"\n    ::= { natAddrBindEntry 7 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrBindMapIndex OBJECT-TYPE\n    SYNTAX     NatAddrMapId\n    MAX-ACCESS read-only\n    STATUS     current\n    DESCRIPTION\n            \"This object is a pointer to the natAddrMapTable entry\n             (and the parameters of that entry) which was used in\n             creating this BIND.  This object, in conjunction with the\n             ifIndex (which identifies a unique addrMapName) points to a unique entry in the natAddrMapTable.\"\n    ::= { natAddrBindEntry 8 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrBindSessions OBJECT-TYPE\n    SYNTAX     Gauge32\n    MAX-ACCESS read-only\n    STATUS     current\n    DESCRIPTION\n            \"Number of sessions currently using this BIND.\"\n    ::= { natAddrBindEntry 9 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrBindMaxIdleTime OBJECT-TYPE SYNTAX TimeTicks MAX-ACCESS read-only STATUS current DESCRIPTION \"This object indicates the maximum time for which this bind can be idle with no sessions attached to it.",
      "ja": "natAddrBindMaxIdleTime OBJECT-TYPE構文TimeTicks MAX-ACCESS読み取り専用ステータス現在の説明「このオブジェクトはそれに接続されるセッションなしでこのバインドがアイドル状態であることができる最大時間を示します。"
    },
    {
      "indent": 4,
      "text": "         The value of this object is of relevance only for\n         dynamic NAT.\"\n::= { natAddrBindEntry 10 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrBindCurrentIdleTime OBJECT-TYPE SYNTAX TimeTicks MAX-ACCESS read-only STATUS current DESCRIPTION \"At any given instance, this object indicates the time that this bind has been idle without any sessions attached to it.",
      "ja": "natAddrBindCurrentIdleTime OBJECT-TYPE構文TimeTicks MAX-ACCESS読み取り専用ステータス現在の説明「任意のある例で、このオブジェクトはそれに接続されるセッションなしでこのバインドがアイドル状態だった時間を示します"
    },
    {
      "indent": 4,
      "text": "         The value of this object is of relevance only for\n         dynamic NAT.\"\n::= { natAddrBindEntry 11 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrBindInTranslates OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current DESCRIPTION \"The number of inbound packets that were successfully translated by using this bind entry.",
      "ja": "natAddrBindInTranslates OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS読み取り専用ステータス現在の説明「このバインドエントリを使用して正常に変換された着信パケットの数。"
    },
    {
      "indent": 4,
      "text": "         Discontinuities in the value of this counter can occur at\n         reinitialization of the management system and at other\n         times, as indicated by the value of ifCounterDiscontinuityTime on the relevant interface.\"\n::= { natAddrBindEntry 12 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrBindOutTranslates OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current DESCRIPTION \"The number of outbound packets that were successfully translated using this bind entry.",
      "ja": "natAddrBindOutTranslates OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS読み取り専用ステータス現在の説明「このバインドエントリを使用して正常に変換された発信パケットの数。"
    },
    {
      "indent": 4,
      "text": "         Discontinuities in the value of this counter can occur at\n         reinitialization of the management system and at other\n         times as indicated by the value of\n         ifCounterDiscontinuityTime on the relevant interface.\"\n::= { natAddrBindEntry 13 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- -- Address Port Bind section --",
      "ja": "--アドレスポートバインドセクション-"
    },
    {
      "indent": 0,
      "text": "natAddrPortBindNumberOfEntries OBJECT-TYPE\n    SYNTAX     Gauge32\n    MAX-ACCESS read-only\n    STATUS     current\n    DESCRIPTION\n            \"This object maintains a count of the number of entries\n             that currently exist in the natAddrPortBindTable.\"\n    ::= { natMIBObjects 7 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- -- The NAT Address Port Bind Table --",
      "ja": "--NATアドレスポートバインドテーブル-"
    },
    {
      "indent": 0,
      "text": "natAddrPortBindTable OBJECT-TYPE\n    SYNTAX     SEQUENCE OF NatAddrPortBindEntry\n    MAX-ACCESS not-accessible\n    STATUS     current\n    DESCRIPTION\n            \"This table holds information about the currently\n             active NAPT BINDs.\"\n    ::= { natMIBObjects 8 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrPortBindEntry OBJECT-TYPE SYNTAX NatAddrPortBindEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION",
      "ja": "natAddrPortBindEntry OBJECT-TYPE構文NatAddrPortBindEntry MAX-ACCESSアクセス不能ステータス現在の説明"
    },
    {
      "indent": 12,
      "text": "\"Each entry in the this table holds information\n about a NAPT bind that is currently active.\n These entries are lost upon agent restart.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "         This row has indexing which may create variables with\n         more than 128 subidentifiers.  Implementers of this table\n         must be careful not to create entries which would result\n         in OIDs that exceed the 128 subidentifier limit.\n         Otherwise, the information cannot be accessed using\n         SNMPv1, SNMPv2c or SNMPv3.\"\nINDEX   { ifIndex, natAddrPortBindLocalAddrType,\n          natAddrPortBindLocalAddr, natAddrPortBindLocalPort,\n          natAddrPortBindProtocol }\n::= { natAddrPortBindTable 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "NatAddrPortBindEntry ::= SEQUENCE {\n    natAddrPortBindLocalAddrType        InetAddressType,\n    natAddrPortBindLocalAddr            InetAddress,\n    natAddrPortBindLocalPort            InetPortNumber,\n    natAddrPortBindProtocol             NatProtocolType,\n    natAddrPortBindGlobalAddrType       InetAddressType,\n    natAddrPortBindGlobalAddr           InetAddress,\n    natAddrPortBindGlobalPort           InetPortNumber,\n    natAddrPortBindId                   NatBindId,\n    natAddrPortBindTranslationEntity    NatTranslationEntity,\n    natAddrPortBindType                 NatAssociationType,\n    natAddrPortBindMapIndex             NatAddrMapId,\n    natAddrPortBindSessions             Gauge32,\n    natAddrPortBindMaxIdleTime          TimeTicks,\n    natAddrPortBindCurrentIdleTime      TimeTicks,\n    natAddrPortBindInTranslates         Counter64,\n    natAddrPortBindOutTranslates        Counter64\n}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrPortBindLocalAddrType OBJECT-TYPE\n    SYNTAX      InetAddressType\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n            \"This object specifies the address type used for\n             natAddrPortBindLocalAddr.\"\n    ::= { natAddrPortBindEntry 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrPortBindLocalAddr OBJECT-TYPE SYNTAX InetAddress MAX-ACCESS not-accessible STATUS current DESCRIPTION",
      "ja": "natAddrPortBindLocalAddr OBJECT-TYPE構文InetAddress MAX-ACCESSアクセス不能ステータス現在の説明"
    },
    {
      "indent": 12,
      "text": "\"This object represents the private-realm specific network\n layer address which, in conjunction with\n natAddrPortBindLocalPort, maps to the public-realm\n network layer address and transport id represented by\n natAddrPortBindGlobalAddr and natAddrPortBindGlobalPort\n respectively.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "         The type of this address is determined by the value of\n         the natAddrPortBindLocalAddrType object.\"\n::= { natAddrPortBindEntry 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrPortBindLocalPort OBJECT-TYPE SYNTAX InetPortNumber MAX-ACCESS not-accessible STATUS current DESCRIPTION \"For a protocol value TCP or UDP, this object represents the private-realm specific port number. On the other hand, for ICMP a bind is created only for query/response type ICMP messages such as ICMP echo, Timestamp, and Information request messages, and this object represents the private-realm specific identifier in the ICMP message, as defined in RFC 792 for ICMPv4 and in RFC 2463 for ICMPv6.",
      "ja": "natAddrPortBindLocalPort OBJECT-TYPE SYNTAX InetPortNumber MAX-ACCESSアクセス不可STATUS現在の説明「プロトコル値TCPまたはUDPの場合、このオブジェクトはプライベートレルム固有のポート番号を表します。一方、ICMPの場合は、クエリ/ ICMPエコー、タイムスタンプ、情報要求メッセージなどの応答タイプICMPメッセージ。このオブジェクトは、ICMPv4のRFC 792およびICMPv6のRFC 2463で定義されているICMPメッセージのプライベートレルム固有の識別子を表します。"
    },
    {
      "indent": 3,
      "text": "          This object, together with natAddrPortBindProtocol,\n          natAddrPortBindLocalAddrType, and natAddrPortBindLocalAddr,\n          constitutes a session endpoint in the private realm.  A\n          bind entry binds a private realm specific endpoint to a\n          public realm specific endpoint, as represented by the\n          tuple of (natAddrPortBindGlobalPort,\n          natAddrPortBindProtocol, natAddrPortBindGlobalAddrType,\n          and natAddrPortBindGlobalAddr).\"\n::= { natAddrPortBindEntry 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrPortBindProtocol OBJECT-TYPE\n    SYNTAX      NatProtocolType\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n            \"This object specifies a protocol identifier.  If the\n             value of this object is none(1), then this bind entry\n             applies to all IP traffic.  Any other value of this object\n             specifies the class of IP traffic to which this BIND\n             applies.\"\n    ::= { natAddrPortBindEntry 4 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrPortBindGlobalAddrType OBJECT-TYPE\n    SYNTAX      InetAddressType\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"This object specifies the address type used for\n             natAddrPortBindGlobalAddr.\"\n    ::= { natAddrPortBindEntry 5 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrPortBindGlobalAddr OBJECT-TYPE SYNTAX InetAddress MAX-ACCESS read-only STATUS current DESCRIPTION \"This object represents the public-realm specific network layer address that, in conjunction with natAddrPortBindGlobalPort, maps to the private-realm",
      "ja": "natAddrPortBindGlobalAddr OBJECT-TYPE構文InetAddress MAX-ACCESS読み取り専用ステータス現在の説明「このオブジェクトはnatAddrPortBindGlobalPortと共に、private-realmにマッピングするパブリックレルム固有のネットワークレイヤアドレスを表します"
    },
    {
      "indent": 13,
      "text": "network layer address and transport id represented by\nnatAddrPortBindLocalAddr and natAddrPortBindLocalPort,\nrespectively.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "         The type of this address is determined by the value of\n         the natAddrPortBindGlobalAddrType object.\"\n::= { natAddrPortBindEntry 6 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrPortBindGlobalPort OBJECT-TYPE SYNTAX InetPortNumber MAX-ACCESS read-only STATUS current DESCRIPTION \"For a protocol value TCP or UDP, this object represents the public-realm specific port number. On the other hand, for ICMP a bind is created only for query/response type ICMP messages such as ICMP echo, Timestamp, and Information request messages, and this object represents the public-realm specific identifier in the ICMP message, as defined in RFC 792 for ICMPv4 and in RFC 2463 for ICMPv6.",
      "ja": "natAddrPortBindGlobalPort OBJECT-TYPE SYNTAX InetPortNumber MAX-ACCESS読み取り専用STATUS現在の説明「プロトコル値TCPまたはUDPの場合、このオブジェクトはパブリックレルム固有のポート番号を表します。一方、ICMPの場合、クエリ/ ICMPエコー、タイムスタンプ、情報要求メッセージなどの応答タイプICMPメッセージ。このオブジェクトは、ICMPv4のRFC 792およびICMPv6のRFC 2463で定義されているICMPメッセージのパブリックレルム固有の識別子を表します。"
    },
    {
      "indent": 4,
      "text": "         This object, together with natAddrPortBindProtocol,\n         natAddrPortBindGlobalAddrType, and\n         natAddrPortBindGlobalAddr, constitutes a session endpoint\n         in the public realm.  A bind entry binds a public realm\n         specific endpoint to a private realm specific endpoint,\n         as represented by the tuple of\n          (natAddrPortBindLocalPort, natAddrPortBindProtocol,\n           natAddrPortBindLocalAddrType, and natAddrPortBindLocalAddr).\"\n::= { natAddrPortBindEntry 7 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrPortBindId OBJECT-TYPE\n    SYNTAX     NatBindId\n    MAX-ACCESS read-only\n    STATUS     current\n    DESCRIPTION\n            \"This object represents a bind id that is dynamically\n             assigned to each bind by a NAT enabled device.  Each\n             bind is represented by a unique bind id across both\n             the natAddrBindTable and the natAddrPortBindTable.\"\n    ::= { natAddrPortBindEntry 8 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrPortBindTranslationEntity OBJECT-TYPE SYNTAX NatTranslationEntity MAX-ACCESS read-only STATUS current DESCRIPTION \"This object represents the direction of sessions for which this bind is applicable and the entity (source or destination) within the sessions that is subject to translation with the BIND.",
      "ja": "natAddrPortBindTranslationEntity OBJECT-TYPE構文NatTranslationEntity MAX-ACCESS読み取り専用ステータス現在の説明「このオブジェクトはこのバインドが適用可能であるセッションの方向およびBINDとの変換に応じるセッション内のエンティティ（ソースまたは宛先）を表します。"
    },
    {
      "indent": 13,
      "text": "Orientation of the bind can be a superset of the\ntranslationEntity of the address map entry that\nforms the basis for this bind.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "         For example, if the translationEntity of an\n         address map entry is outboundSrcEndPoint, the\n         translationEntity of a bind derived from this\n         map entry may either be outboundSrcEndPoint or\n         may be bidirectional (a bitmask of\n         outboundSrcEndPoint and inboundDstEndPoint).\"\n::= { natAddrPortBindEntry 9 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrPortBindType OBJECT-TYPE\n    SYNTAX     NatAssociationType\n    MAX-ACCESS read-only\n    STATUS     current\n    DESCRIPTION\n            \"This object indicates whether the bind is static or\n             dynamic.\"\n    ::= { natAddrPortBindEntry 10 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrPortBindMapIndex OBJECT-TYPE SYNTAX NatAddrMapId MAX-ACCESS read-only",
      "ja": "natAddrPortBindMapIndex OBJECT-TYPE構文NatAddrMapId MAX-ACCESS読み取り専用"
    },
    {
      "indent": 4,
      "text": "STATUS     current\nDESCRIPTION\n        \"This object is a pointer to the natAddrMapTable entry\n         (and the parameters of that entry) used in\n         creating this BIND.  This object, in conjunction with the\n         ifIndex (which identifies a unique addrMapName), points\n         to a unique entry in the natAddrMapTable.\"\n::= { natAddrPortBindEntry 11 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrPortBindSessions OBJECT-TYPE\n    SYNTAX     Gauge32\n    MAX-ACCESS read-only\n    STATUS     current\n    DESCRIPTION\n            \"Number of sessions currently using this BIND.\"\n    ::= { natAddrPortBindEntry 12 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrPortBindMaxIdleTime OBJECT-TYPE SYNTAX TimeTicks MAX-ACCESS read-only STATUS current",
      "ja": "natAddrPortBindMaxIdleTime OBJECT-TYPE構文TimeTicks MAX-ACCESS読み取り専用ステータス現在"
    },
    {
      "indent": 4,
      "text": "DESCRIPTION\n        \"This object indicates the maximum time for\n         which this bind can be idle without any sessions\n         attached to it.\n         The value of this object is of relevance\n         only for dynamic NAT.\"\n::= { natAddrPortBindEntry 13 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrPortBindCurrentIdleTime OBJECT-TYPE SYNTAX TimeTicks MAX-ACCESS read-only STATUS current DESCRIPTION \"At any given instance, this object indicates the time that this bind has been idle without any sessions attached to it.",
      "ja": "natAddrPortBindCurrentIdleTime OBJECT-TYPE構文TimeTicks MAX-ACCESS読み取り専用ステータス現在の説明「任意のあるインスタンスで、このオブジェクトはこのバインドがそれに接続されるセッションなしでアイドル状態だった時間を示します"
    },
    {
      "indent": 4,
      "text": "         The value of this object is of relevance\n         only for dynamic NAT.\"\n::= { natAddrPortBindEntry 14 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrPortBindInTranslates OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current DESCRIPTION",
      "ja": "natAddrPortBindInTranslates OBJECT-TYPE構文Counter64 MAX-ACCESS読み取り専用ステータス現在の説明"
    },
    {
      "indent": 12,
      "text": "\"The number of inbound packets that were translated as per\n this bind entry.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "         Discontinuities in the value of this counter can occur at\n         reinitialization of the management system and at other\n         times, as indicated by the value of\n         ifCounterDiscontinuityTime on the relevant interface.\"\n::= { natAddrPortBindEntry 15 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natAddrPortBindOutTranslates OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current DESCRIPTION \"The number of outbound packets that were translated as per this bind entry.",
      "ja": "natAddrPortBindOutTranslates OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS読み取り専用ステータス現在の説明「このバインドエントリによって変換された発信パケットの数。"
    },
    {
      "indent": 4,
      "text": "         Discontinuities in the value of this counter can occur at\n         reinitialization of the management system and at other\n         times, as indicated by the value of\n         ifCounterDiscontinuityTime on the relevant interface.\"\n::= { natAddrPortBindEntry 16 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- -- The Session Table --",
      "ja": "--セッションテーブル-"
    },
    {
      "indent": 0,
      "text": "natSessionTable OBJECT-TYPE\n    SYNTAX     SEQUENCE OF NatSessionEntry\n    MAX-ACCESS not-accessible\n    STATUS     current\n    DESCRIPTION\n            \"The (conceptual) table containing one entry for each\n             NAT session currently active on this NAT device.\"\n    ::= { natMIBObjects 9 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natSessionEntry OBJECT-TYPE\n    SYNTAX     NatSessionEntry\n    MAX-ACCESS not-accessible\n    STATUS     current\n    DESCRIPTION\n            \"An entry (conceptual row) containing information\n             about an active NAT session on this NAT device.\n             These entries are lost upon agent restart.\"\n    INDEX   { ifIndex, natSessionIndex }\n    ::= { natSessionTable 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "NatSessionEntry ::= SEQUENCE {",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": " natSessionIndex NatSessionId, natSessionPrivateSrcEPBindId NatBindIdOrZero, natSessionPrivateSrcEPBindMode NatBindMode, natSessionPrivateDstEPBindId NatBindIdOrZero, natSessionPrivateDstEPBindMode NatBindMode, natSessionDirection INTEGER, natSessionUpTime TimeTicks, natSessionAddrMapIndex NatAddrMapId, natSessionProtocolType NatProtocolType, natSessionPrivateAddrType InetAddressType, natSessionPrivateSrcAddr InetAddress, natSessionPrivateSrcPort InetPortNumber, natSessionPrivateDstAddr InetAddress, natSessionPrivateDstPort InetPortNumber, natSessionPublicAddrType InetAddressType, natSessionPublicSrcAddr InetAddress, natSessionPublicSrcPort InetPortNumber, natSessionPublicDstAddr InetAddress, natSessionPublicDstPort InetPortNumber, natSessionMaxIdleTime TimeTicks, natSessionCurrentIdleTime TimeTicks, natSessionInTranslates Counter64, natSessionOutTranslates Counter64 }",
      "ja": "natSessionIndex NatSessionId、natSessionPrivateSrcEPBindId NatBindIdOrZero、natSessionPrivateSrcEPBindMode NatBindMode、natSessionPrivateDstEPBindId NatBindIdOrZero、natSessionPrivateDstEPBindMode NatBindMode、natSessionDirection INTEGER、natSessionUpTime時間刻み、natSessionAddrMapIndex NatAddrMapId、natSessionProtocolType NatProtocolType、natSessionPrivateAddrTypeたInetAddressType、natSessionPrivateSrcAddrのInetAddress、natSessionPrivateSrcPort InetPortNumber、natSessionPrivateDstAddrのInetAddress、natSessionPrivateDstPort InetPortNumber、natSessionPublicAddrTypeたInetAddressType、natSessionPublicSrcAddrのInetAddress、natSessionPublicSrcPort InetPortNumber 、natSessionPublicDstAddr InetAddress、natSessionPublicDstPort InetPortNumber、natSessionMaxIdleTime TimeTicks、natSessionCurrentIdleTime TimeTicks、natSessionInTranslates Counter64、natSessionOutTranslates Counter64}"
    },
    {
      "indent": 0,
      "text": "natSessionIndex OBJECT-TYPE\n    SYNTAX     NatSessionId\n    MAX-ACCESS not-accessible\n    STATUS     current\n    DESCRIPTION\n            \"The session ID for this NAT session.\"\n    ::= { natSessionEntry 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natSessionPrivateSrcEPBindId OBJECT-TYPE\n    SYNTAX     NatBindIdOrZero\n    MAX-ACCESS read-only\n    STATUS     current\n    DESCRIPTION\n            \"The bind id associated between private and public\n             source end points.  In the case of Symmetric-NAT,\n             this should be set to zero.\"\n    ::= { natSessionEntry 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natSessionPrivateSrcEPBindMode OBJECT-TYPE SYNTAX NatBindMode MAX-ACCESS read-only STATUS current DESCRIPTION",
      "ja": "natSessionPrivateSrcEPBindMode OBJECT-TYPE構文NatBindMode MAX-ACCESS読み取り専用ステータス現在の説明"
    },
    {
      "indent": 4,
      "text": "        \"This object indicates whether the bind indicated\n         by the object natSessionPrivateSrcEPBindId\n         is an address bind or an address port bind.\"\n::= { natSessionEntry 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natSessionPrivateDstEPBindId OBJECT-TYPE\n    SYNTAX     NatBindIdOrZero\n    MAX-ACCESS read-only\n    STATUS     current\n    DESCRIPTION\n            \"The bind id associated between private and public\n             destination end points.\"\n    ::= { natSessionEntry 4 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natSessionPrivateDstEPBindMode OBJECT-TYPE\n    SYNTAX     NatBindMode\n    MAX-ACCESS read-only\n    STATUS     current\n    DESCRIPTION\n            \"This object indicates whether the bind indicated\n             by the object natSessionPrivateDstEPBindId\n             is an address bind or an address port bind.\"\n    ::= { natSessionEntry 5 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natSessionDirection OBJECT-TYPE SYNTAX INTEGER { inbound (1), outbound (2) }",
      "ja": "natSessionDirection OBJECT-TYPE SYNTAX INTEGER {インバウンド（1）、アウトバウンド（2）}"
    },
    {
      "indent": 4,
      "text": "MAX-ACCESS read-only\nSTATUS     current\nDESCRIPTION\n        \"The direction of this session with respect to the\n         local network.  'inbound' indicates that this session\n         was initiated from the public network into the private\n         network.  'outbound' indicates that this session was\n         initiated from the private network into the public\n         network.\"\n::= { natSessionEntry 6 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natSessionUpTime OBJECT-TYPE SYNTAX TimeTicks MAX-ACCESS read-only STATUS current DESCRIPTION \"The up time of this session in one-hundredths of a second.\"",
      "ja": "natSessionUpTime OBJECT-TYPE構文TimeTicks MAX-ACCESS読み取り専用ステータス現在の説明「100分の1秒のこのセッションのアップタイム」。"
    },
    {
      "indent": 4,
      "text": "::= { natSessionEntry 7 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natSessionAddrMapIndex OBJECT-TYPE\n    SYNTAX     NatAddrMapId\n    MAX-ACCESS read-only\n    STATUS     current\n    DESCRIPTION\n            \"This object is a pointer to the natAddrMapTable entry\n             (and the parameters of that entry) used in\n             creating this session.  This object, in conjunction with\n             the ifIndex (which identifies a unique addrMapName), points\n             to a unique entry in the natAddrMapTable.\"\n    ::= { natSessionEntry 8 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natSessionProtocolType OBJECT-TYPE\n    SYNTAX     NatProtocolType\n    MAX-ACCESS read-only\n    STATUS     current\n    DESCRIPTION\n            \"The protocol type of this session.\"\n    ::= { natSessionEntry 9 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natSessionPrivateAddrType OBJECT-TYPE\n    SYNTAX      InetAddressType\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"This object specifies the address type used for\n             natSessionPrivateSrcAddr and natSessionPrivateDstAddr.\"\n    ::= { natSessionEntry 10 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natSessionPrivateSrcAddr OBJECT-TYPE SYNTAX InetAddress MAX-ACCESS read-only STATUS current DESCRIPTION \"The source IP address of the session endpoint that lies in the private network.",
      "ja": "natSessionPrivateSrcAddr OBJECT-TYPE構文InetAddress MAX-ACCESS読み取り専用ステータス現在の説明「プライベートネットワークにあるセッションエンドポイントのソースIPアドレス。"
    },
    {
      "indent": 13,
      "text": "The value of this object must be zero only when the\nnatSessionPrivateSrcEPBindId object has a zero value.\nWhen the value of this object is zero, the NAT session\nlookup will match any IP address to this field.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "         The type of this address is determined by the value of\n         the natSessionPrivateAddrType object.\"\n::= { natSessionEntry 11 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natSessionPrivateSrcPort OBJECT-TYPE SYNTAX InetPortNumber MAX-ACCESS read-only STATUS current DESCRIPTION \"When the value of protocol is TCP or UDP, this object represents the source port in the first packet of session while in private-realm. On the other hand, when the protocol is ICMP, a NAT session is created only for query/response type ICMP messages such as ICMP echo, Timestamp, and Information request messages, and this object represents the private-realm specific identifier in the ICMP message, as defined in RFC 792 for ICMPv4 and in RFC 2463 for ICMPv6.",
      "ja": "natSessionPrivateSrcPort OBJECT-TYPE SYNTAX InetPortNumber MAX-ACCESS読み取り専用STATUS現在の説明「プロトコルの値がTCPまたはUDPである場合、このオブジェクトは、プライベートレルムにある間のセッションの最初のパケットのソースポートを表します。 プロトコルはICMPです。NATセッションは、ICMPエコー、タイムスタンプ、情報要求メッセージなどのクエリ/応答タイプのICMPメッセージに対してのみ作成され、このオブジェクトはRFC 792で定義されているICMPメッセージのプライベートレルム固有の識別子を表します ICMPv4の場合、およびICMPv6のRFC 2463の場合。"
    },
    {
      "indent": 13,
      "text": "The value of this object must be zero when the\nnatSessionPrivateSrcEPBindId object has zero value\nand value of natSessionPrivateSrcEPBindMode is\naddressPortBind(2).  In such a case, the NAT session\nlookup will match any port number to this field.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "         The value of this object must be zero when the object\n         is not a representative field (SrcPort, DstPort, or\n         ICMP identifier) of the session tuple in either the\n         public realm or the private realm.\"\n::= { natSessionEntry 12 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natSessionPrivateDstAddr OBJECT-TYPE SYNTAX InetAddress MAX-ACCESS read-only STATUS current DESCRIPTION \"The destination IP address of the session endpoint that lies in the private network.",
      "ja": "natSessionPrivateDstAddr OBJECT-TYPE構文InetAddress MAX-ACCESS読み取り専用ステータス現在の説明「プライベートネットワークにあるセッションエンドポイントの宛先IPアドレス。"
    },
    {
      "indent": 13,
      "text": "The value of this object must be zero when the\nnatSessionPrivateDstEPBindId object has a zero value.\nIn such a scenario, the NAT session lookup will match\nany IP address to this field.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "         The type of this address is determined by the value of\n         the natSessionPrivateAddrType object.\"\n::= { natSessionEntry 13 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natSessionPrivateDstPort OBJECT-TYPE SYNTAX InetPortNumber MAX-ACCESS read-only STATUS current",
      "ja": "natSessionPrivateDstPort OBJECT-TYPE構文InetPortNumber MAX-ACCESS読み取り専用ステータス現在"
    },
    {
      "indent": 4,
      "text": "DESCRIPTION\n        \"When the value of protocol is TCP or UDP, this object\n         represents the destination port in the first packet\n         of session while in private-realm.  On the other hand,\n         when the protocol is ICMP, this object is not relevant\n         and should be set to zero.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 13,
      "text": "The value of this object must be zero when the\nnatSessionPrivateDstEPBindId object has a zero\nvalue and natSessionPrivateDstEPBindMode is set to\naddressPortBind(2).  In such a case, the NAT session\nlookup will match any port number to this field.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "         The value of this object must be zero when the object\n         is not a representative field (SrcPort, DstPort, or\n         ICMP identifier) of the session tuple in either the\n         public realm or the private realm.\"\n::= { natSessionEntry 14 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natSessionPublicAddrType OBJECT-TYPE\n    SYNTAX      InetAddressType\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n            \"This object specifies the address type used for\n             natSessionPublicSrcAddr and natSessionPublicDstAddr.\"\n    ::= { natSessionEntry 15 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natSessionPublicSrcAddr OBJECT-TYPE SYNTAX InetAddress MAX-ACCESS read-only STATUS current DESCRIPTION \"The source IP address of the session endpoint that lies in the public network.",
      "ja": "natSessionPublicSrcAddr OBJECT-TYPE構文InetAddress MAX-ACCESS読み取り専用ステータス現在の説明「パブリックネットワークにあるセッションエンドポイントのソースIPアドレス。"
    },
    {
      "indent": 13,
      "text": "The value of this object must be zero when the\nnatSessionPrivateSrcEPBindId object has a zero value.\nIn such a scenario, the NAT session lookup will match\nany IP address to this field.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "         The type of this address is determined by the value of\n         the natSessionPublicAddrType object.\"\n::= { natSessionEntry 16 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natSessionPublicSrcPort OBJECT-TYPE SYNTAX InetPortNumber MAX-ACCESS read-only",
      "ja": "natSessionPublicSrcPort OBJECT-TYPE構文InetPortNumber MAX-ACCESS読み取り専用"
    },
    {
      "indent": 4,
      "text": "STATUS     current\nDESCRIPTION\n        \"When the value of protocol is TCP or UDP, this object\n         represents the source port in the first packet of\n         session while in public-realm.  On the other hand, when\n         protocol is ICMP, a NAT session is created only for\n         query/response type ICMP messages such as ICMP echo,\n         Timestamp, and Information request messages, and this\n         object represents the public-realm specific identifier\n         in the ICMP message, as defined in RFC 792 for ICMPv4\n         and in RFC 2463 for ICMPv6.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 13,
      "text": "The value of this object must be zero when the\nnatSessionPrivateSrcEPBindId object has a zero value\nand natSessionPrivateSrcEPBindMode is set to\naddressPortBind(2).  In such a scenario, the NAT\nsession lookup will match any port number to this\nfield.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "         The value of this object must be zero when the object\n         is not a representative field (SrcPort, DstPort or\n         ICMP identifier) of the session tuple in either the\n         public realm or the private realm.\"\n::= { natSessionEntry 17 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natSessionPublicDstAddr OBJECT-TYPE SYNTAX InetAddress MAX-ACCESS read-only STATUS current DESCRIPTION \"The destination IP address of the session endpoint that lies in the public network.",
      "ja": "natSessionPublicDstAddr OBJECT-TYPE構文InetAddress MAX-ACCESS読み取り専用ステータス現在の説明「パブリックネットワークにあるセッションエンドポイントの宛先IPアドレス。"
    },
    {
      "indent": 13,
      "text": "The value of this object must be non-zero when the\nnatSessionPrivateDstEPBindId object has a non-zero\nvalue.  If the value of this object and the\ncorresponding natSessionPrivateDstEPBindId object value\nis zero, then the NAT session lookup will match any IP\naddress to this field.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "         The type of this address is determined by the value of\n         the natSessionPublicAddrType object.\"\n::= { natSessionEntry 18 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natSessionPublicDstPort OBJECT-TYPE SYNTAX InetPortNumber MAX-ACCESS read-only STATUS current",
      "ja": "natSessionPublicDstPort OBJECT-TYPE構文InetPortNumber MAX-ACCESS読み取り専用ステータス現在"
    },
    {
      "indent": 4,
      "text": "DESCRIPTION\n        \"When the value of protocol is TCP or UDP, this object\n         represents the destination port in the first packet of\n         session while in public-realm.  On the other hand, when\n         the protocol is ICMP, this object is not relevant for\n         translation and should be zero.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 13,
      "text": "The value of this object must be zero when the\nnatSessionPrivateDstEPBindId object has a zero value\nand natSessionPrivateDstEPBindMode is\naddressPortBind(2).  In such a scenario, the NAT\nsession lookup will match any port number to this\nfield.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "         The value of this object must be zero when the object\n         is not a representative field (SrcPort, DstPort, or\n         ICMP identifier) of the session tuple in either the\n         public realm or the private realm.\"\n::= { natSessionEntry 19 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natSessionMaxIdleTime OBJECT-TYPE\n    SYNTAX     TimeTicks\n    MAX-ACCESS read-only\n    STATUS     current\n    DESCRIPTION\n            \"The max time for which this session can be idle\n             without detecting a packet.\"\n    ::= { natSessionEntry 20 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natSessionCurrentIdleTime OBJECT-TYPE\n    SYNTAX     TimeTicks\n    MAX-ACCESS read-only\n    STATUS     current\n    DESCRIPTION\n            \"The time since a packet belonging to this session was\n            last detected.\"\n    ::= { natSessionEntry 21 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natSessionInTranslates OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current DESCRIPTION \"The number of inbound packets that were translated for this session.",
      "ja": "natSessionInTranslates OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS読み取り専用ステータス現在の説明「このセッションのために変換されたインバウンドパケットの数。"
    },
    {
      "indent": 4,
      "text": "         Discontinuities in the value of this counter can occur at\n         reinitialization of the management system and at other times, as indicated by the value of\n         ifCounterDiscontinuityTime on the relevant interface.\"\n::= { natSessionEntry 22 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natSessionOutTranslates OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current DESCRIPTION \"The number of outbound packets that were translated for this session.",
      "ja": "natSessionOutTranslates OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS読み取り専用ステータス現在の説明「このセッションのために変換された発信パケットの数。"
    },
    {
      "indent": 4,
      "text": "         Discontinuities in the value of this counter can occur at\n         reinitialization of the management system and at other\n         times, as indicated by the value of\n         ifCounterDiscontinuityTime on the relevant interface.\"\n::= { natSessionEntry 23 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- -- The Protocol table --",
      "ja": "--プロトコルテーブル-"
    },
    {
      "indent": 0,
      "text": "natProtocolTable OBJECT-TYPE\n    SYNTAX     SEQUENCE OF NatProtocolEntry\n    MAX-ACCESS not-accessible\n    STATUS     current\n    DESCRIPTION\n            \"The (conceptual) table containing per protocol NAT\n             statistics.\"\n    ::= { natMIBObjects 10 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natProtocolEntry OBJECT-TYPE\n    SYNTAX     NatProtocolEntry\n    MAX-ACCESS not-accessible\n    STATUS     current\n    DESCRIPTION\n            \"An entry (conceptual row) containing NAT statistics\n             pertaining to a particular protocol.\"\n    INDEX   { natProtocol }\n    ::= { natProtocolTable 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "NatProtocolEntry ::= SEQUENCE {\n    natProtocol                 NatProtocolType,\n    natProtocolInTranslates     Counter64,\n    natProtocolOutTranslates    Counter64,\n    natProtocolDiscards         Counter64\n} natProtocol    OBJECT-TYPE\n    SYNTAX     NatProtocolType\n    MAX-ACCESS not-accessible\n    STATUS     current\n    DESCRIPTION\n            \"This object represents the protocol pertaining to which\n             parameters are reported.\"\n    ::= { natProtocolEntry 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natProtocolInTranslates OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current DESCRIPTION \"The number of inbound packets pertaining to the protocol identified by natProtocol that underwent NAT.",
      "ja": "natProtocolInTranslates OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS読み取り専用ステータス現在の説明「NATを経たnatProtocolによって識別されるプロトコルに関連する着信パケットの数。"
    },
    {
      "indent": 4,
      "text": "         Discontinuities in the value of this counter can occur at\n         reinitialization of the management system and at other\n         times, as indicated by the value of\n         ifCounterDiscontinuityTime on the relevant interface.\"\n::= { natProtocolEntry 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natProtocolOutTranslates OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current DESCRIPTION \"The number of outbound packets pertaining to the protocol identified by natProtocol that underwent NAT.",
      "ja": "natProtocolOutTranslates OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS読み取り専用STATUSの現在の説明「NATを経たnatProtocolによって識別されるプロトコルに関連するアウトバウンドパケットの数。"
    },
    {
      "indent": 4,
      "text": "         Discontinuities in the value of this counter can occur at\n         reinitialization of the management system and at other\n         times, as indicated by the value of\n         ifCounterDiscontinuityTime on the relevant interface.\"\n::= { natProtocolEntry 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natProtocolDiscards OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS read-only STATUS current DESCRIPTION \"The number of packets pertaining to the protocol identified by natProtocol that had to be rejected/dropped due to lack of resources. These rejections could be due to session timeout, resource unavailability, lack of address space, etc.",
      "ja": "natProtocolDiscards OBJECT-TYPE SYNTAX Counter64 MAX-ACCESS読み取り専用STATUSの現在の説明「natProtocolによって識別されるプロトコルに関連するパケットの数。リソースの不足のために拒否/ドロップする必要がありました。これらの拒否はセッションタイムアウト、リソースによる可能性があります 利用できない、アドレス空間の不足など"
    },
    {
      "indent": 5,
      "text": "        Discontinuities in the value of this counter can occur at\n        reinitialization of the management system and at other\n        times, as indicated by the value of\n        ifCounterDiscontinuityTime on the relevant interface.\"\n::= { natProtocolEntry 4 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- -- Notifications section --",
      "ja": "--通知セクション-"
    },
    {
      "indent": 0,
      "text": "natMIBNotifications OBJECT IDENTIFIER ::= { natMIB 0 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- -- Notifications --",
      "ja": "--通知-"
    },
    {
      "indent": 0,
      "text": "natPacketDiscard NOTIFICATION-TYPE OBJECTS { ifIndex } STATUS current DESCRIPTION \"This notification is generated when IP packets are discarded by the NAT function; e.g., due to lack of mapping space when NAT is out of addresses or ports.",
      "ja": "natPacketDiscard NOTIFICATION-TYPE OBJECTS {ifIndex} STATUSの現在の説明は「IPパケットがNAT機能によって廃棄されるときこの通知が生成されます;たとえば、NATがアドレスまたはポートからあるときマッピングスペースの不足が原因で。"
    },
    {
      "indent": 4,
      "text": "         Note that the generation of natPacketDiscard\n         notifications is throttled by the agent, as specified\n         by the 'natNotifThrottlingInterval' object.\"\n::= { natMIBNotifications 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- -- Conformance information. --",
      "ja": "--適合情報。 -"
    },
    {
      "indent": 0,
      "text": "natMIBConformance OBJECT IDENTIFIER ::= { natMIB 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natMIBGroups      OBJECT IDENTIFIER ::= { natMIBConformance 1 }\nnatMIBCompliances OBJECT IDENTIFIER ::= { natMIBConformance 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- -- Units of conformance --",
      "ja": "--適合単位-"
    },
    {
      "indent": 0,
      "text": "natConfigGroup OBJECT-GROUP\n    OBJECTS { natInterfaceRealm,\n              natInterfaceServiceType,\n              natInterfaceStorageType,\n              natInterfaceRowStatus,\n              natAddrMapName, natAddrMapEntryType,\n              natAddrMapTranslationEntity,\n              natAddrMapLocalAddrType,\n              natAddrMapLocalAddrFrom,\n              natAddrMapLocalAddrTo,\n              natAddrMapLocalPortFrom,\n              natAddrMapLocalPortTo,\n              natAddrMapGlobalAddrType,\n              natAddrMapGlobalAddrFrom,\n              natAddrMapGlobalAddrTo,\n              natAddrMapGlobalPortFrom,\n              natAddrMapGlobalPortTo,\n              natAddrMapProtocol,\n              natAddrMapStorageType,\n              natAddrMapRowStatus,\n              natBindDefIdleTimeout,\n              natUdpDefIdleTimeout,\n              natIcmpDefIdleTimeout,\n              natOtherDefIdleTimeout,\n              natTcpDefIdleTimeout,\n              natTcpDefNegTimeout,\n              natNotifThrottlingInterval }\n    STATUS  current\n    DESCRIPTION\n            \"A collection of configuration-related information\n             required to support management of devices supporting\n             NAT.\"\n    ::= { natMIBGroups 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natTranslationGroup OBJECT-GROUP OBJECTS { natAddrBindNumberOfEntries, natAddrBindGlobalAddrType, natAddrBindGlobalAddr, natAddrBindId, natAddrBindTranslationEntity, natAddrBindType, natAddrBindMapIndex, natAddrBindSessions, natAddrBindMaxIdleTime, natAddrBindCurrentIdleTime, natAddrBindInTranslates, natAddrBindOutTranslates, natAddrPortBindNumberOfEntries, natAddrPortBindGlobalAddrType, natAddrPortBindGlobalAddr, natAddrPortBindGlobalPort, natAddrPortBindId, natAddrPortBindTranslationEntity, natAddrPortBindType, natAddrPortBindMapIndex, natAddrPortBindSessions, natAddrPortBindMaxIdleTime, natAddrPortBindCurrentIdleTime, natAddrPortBindInTranslates, natAddrPortBindOutTranslates, natSessionPrivateSrcEPBindId, natSessionPrivateSrcEPBindMode, natSessionPrivateDstEPBindId, natSessionPrivateDstEPBindMode, natSessionDirection, natSessionUpTime, natSessionAddrMapIndex, natSessionProtocolType, natSessionPrivateAddrType, natSessionPrivateSrcAddr, natSessionPrivateSrcPort, natSessionPrivateDstAddr, natSessionPrivateDstPort, natSessionPublicAddrType, natSessionPublicSrcAddr, natSessionPublicSrcPort, natSessionPublicDstAddr, natSessionPublicDstPort, natSessionMaxIdleTime, natSessionCurrentIdleTime, natSessionInTranslates, natSessionOutTranslates } STATUS current",
      "ja": "natTranslationGroupオブジェクト・グループオブジェクト{natAddrBindNumberOfEntries、natAddrBindGlobalAddrType、natAddrBindGlobalAddr、natAddrBindId、natAddrBindTranslationEntity、natAddrBindType、natAddrBindMapIndex、natAddrBindSessions、natAddrBindMaxIdleTime、natAddrBindCurrentIdleTime、natAddrBindInTranslates、natAddrBindOutTranslates、natAddrPortBindNumberOfEntries、natAddrPortBindGlobalAddrType、natAddrPortBindGlobalAddr、natAddrPortBindGlobalPort、natAddrPortBindId、natAddrPortBindTranslationEntity、natAddrPortBindType、natAddrPortBindMapIndex、natAddrPortBindSessions、natAddrPortBindMaxIdleTime、 natAddrPortBindCurrentIdleTime、natAddrPortBindInTranslates、natAddrPortBindOutTranslates、natSessionPrivateSrcEPBindId、natSessionPrivateSrcEPBindMode、natSessionPrivateDstEPBindId、natSessionPrivateDstEPBindMode、natSessionDirection、natSessionUpTime、natSessionAddrMapIndex、natSessionProtocolType、natSessionPrivateAddrType、natSessionPrivateSrcAddr、natSessionPrivateSrcPort、natSessionPrivateDstAd dr、natSessionPrivateDstPort、natSessionPublicAddrType、natSessionPublicSrcAddr、natSessionPublicSrcPort、natSessionPublicDstAddr、natSessionPublicDstPort、natSessionMaxIdleTime、natSessionCurrentIdleTime、natSessionInTranslates、natSessionOutTranslates} STATUS current"
    },
    {
      "indent": 4,
      "text": "DESCRIPTION\n        \"A collection of BIND-related objects required to support\n         management of devices supporting NAT.\"\n::= { natMIBGroups 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natStatsInterfaceGroup OBJECT-GROUP\n    OBJECTS { natInterfaceInTranslates,\n              natInterfaceOutTranslates,\n              natInterfaceDiscards }\n    STATUS  current\n    DESCRIPTION\n            \"A collection of NAT statistics associated with the\n             interface on which NAT is configured, to aid\n             troubleshooting/monitoring of the NAT operation.\"\n    ::= { natMIBGroups 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natStatsProtocolGroup OBJECT-GROUP",
      "ja": "natStatsProtocolGroup OBJECT-GROUP"
    },
    {
      "indent": 4,
      "text": "OBJECTS { natProtocolInTranslates,\n          natProtocolOutTranslates,\n          natProtocolDiscards }\nSTATUS  current\nDESCRIPTION\n        \"A collection of protocol specific NAT statistics,\n         to aid troubleshooting/monitoring of NAT operation.\"\n::= { natMIBGroups 4 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natStatsAddrMapGroup OBJECT-GROUP\n    OBJECTS { natAddrMapInTranslates,\n              natAddrMapOutTranslates,\n              natAddrMapDiscards,\n              natAddrMapAddrUsed }\n    STATUS  current\n    DESCRIPTION\n            \"A collection of address map specific NAT statistics,\n             to aid troubleshooting/monitoring of NAT operation.\"\n    ::= { natMIBGroups 5 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natMIBNotificationGroup NOTIFICATION-GROUP\n    NOTIFICATIONS { natPacketDiscard }\n    STATUS        current\n    DESCRIPTION\n            \"A collection of notifications generated by\n            devices supporting this MIB.\"\n    ::= { natMIBGroups 6 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- -- Compliance statements --",
      "ja": "--コンプライアンスに関する声明-"
    },
    {
      "indent": 0,
      "text": "natMIBFullCompliance MODULE-COMPLIANCE STATUS current DESCRIPTION \"When this MIB is implemented with support for read-create, then such an implementation can claim full compliance. Such devices can then be both monitored and configured with this MIB.",
      "ja": "natMIBFullCompliance MODULE-COMPLIANCE STATUS現在の説明「このMIBがread-createのサポートで実装されると、そのような実装は完全な準拠を要求できます。このようなデバイスは、このMIBで監視および設定できます。"
    },
    {
      "indent": 13,
      "text": "The following index objects cannot be added as OBJECT\nclauses but nevertheless have the compliance\nrequirements:\n    \"\n-- OBJECT  natAddrBindLocalAddrType\n-- SYNTAX  InetAddressType { ipv4(1), ipv6(2) }\n-- DESCRIPTION\n--         \"An implementation is required to support",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 13,
      "text": "-- global IPv4 and/or IPv6 addresses, depending -- on its support for IPv4 and IPv6.\"",
      "ja": "-依存するグローバルIPv4および/またはIPv6アドレス-IPv4およびIPv6のサポートに依存。"
    },
    {
      "indent": 13,
      "text": "-- OBJECT natAddrBindLocalAddr -- SYNTAX InetAddress (SIZE(4|16)) -- DESCRIPTION -- \"An implementation is required to support -- global IPv4 and/or IPv6 addresses, depending -- on its support for IPv4 and IPv6.\"",
      "ja": "-オブジェクトnatAddrBindLocalAddr-構文InetAddress（SIZE（4 | 16））-説明-「サポートするには実装が必要です-グローバルIPv4および/またはIPv6アドレス、依存-IPv4およびIPv6のサポートに依存します。」"
    },
    {
      "indent": 13,
      "text": "-- OBJECT natAddrPortBindLocalAddrType -- SYNTAX InetAddressType { ipv4(1), ipv6(2) } -- DESCRIPTION -- \"An implementation is required to support -- global IPv4 and/or IPv6 addresses, depending -- on its support for IPv4 and IPv6.\"",
      "ja": "-オブジェクトnatAddrPortBindLocalAddrType-構文InetAddressType {ipv4（1）、ipv6（2）}-説明-「サポートするには実装が必要です-グローバルIPv4および/またはIPv6アドレス、依存-IPv4および IPv6。」"
    },
    {
      "indent": 13,
      "text": "-- OBJECT natAddrPortBindLocalAddr -- SYNTAX InetAddress (SIZE(4|16)) -- DESCRIPTION -- \"An implementation is required to support -- global IPv4 and/or IPv6 addresses, depending -- on its support for IPv4 and IPv6.\"",
      "ja": "-オブジェクトnatAddrPortBindLocalAddr-構文InetAddress（SIZE（4 | 16））-説明-「サポートは実装が必要です-グローバルIPv4および/またはIPv6アドレス、依存-IPv4およびIPv6のサポートによって。」"
    },
    {
      "indent": 4,
      "text": "MODULE IF-MIB -- The interfaces MIB, RFC2863 MANDATORY-GROUPS { ifCounterDiscontinuityGroup }",
      "ja": "モジュールIF-MIB-インターフェイスMIB、RFC2863 MANDATORY-GROUPS {ifCounterDiscontinuityGroup}"
    },
    {
      "indent": 4,
      "text": "MODULE -- this module MANDATORY-GROUPS { natConfigGroup, natTranslationGroup, natStatsInterfaceGroup }",
      "ja": "モジュール-このモジュールの必須グループ{natConfigGroup、natTranslationGroup、natStatsInterfaceGroup}"
    },
    {
      "indent": 6,
      "text": "GROUP natStatsProtocolGroup DESCRIPTION \"This group is optional.\" GROUP natStatsAddrMapGroup DESCRIPTION \"This group is optional.\" GROUP natMIBNotificationGroup DESCRIPTION \"This group is optional.\"",
      "ja": "GROUP natStatsProtocolGroup DESCRIPTION \"このグループはオプションです。\" GROUP natStatsAddrMapGroup DESCRIPTION \"このグループはオプションです。\" GROUP natMIBNotificationGroup DESCRIPTION \"このグループはオプションです。\""
    },
    {
      "indent": 6,
      "text": "OBJECT natAddrMapLocalAddrType SYNTAX InetAddressType { ipv4(1), ipv6(2) } DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "ja": "オブジェクトnatAddrMapLocalAddrType構文InetAddressType {ipv4（1）、ipv6（2）}説明「IPv4およびIPv6のサポートに応じて、グローバルIPv4またはIPv6アドレスをサポートするには実装が必要です。"
    },
    {
      "indent": 6,
      "text": "OBJECT natAddrMapLocalAddrFrom SYNTAX InetAddress (SIZE(4|16)) DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "ja": "オブジェクトnatAddrMapLocalAddrFrom SYNTAX InetAddress（SIZE（4 | 16））説明「IPv4およびIPv6のサポートに応じて、グローバルIPv4および/またはIPv6アドレスをサポートするには実装が必要です。」"
    },
    {
      "indent": 6,
      "text": "OBJECT natAddrMapLocalAddrTo SYNTAX InetAddress (SIZE(4|16)) DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "ja": "オブジェクトnatAddrMapLocalAddrTo SYNTAX InetAddress（SIZE（4 | 16））説明「IPv4およびIPv6のサポートに応じて、グローバルIPv4および/またはIPv6アドレスをサポートするには実装が必要です。」"
    },
    {
      "indent": 6,
      "text": "OBJECT natAddrMapGlobalAddrType SYNTAX InetAddressType { ipv4(1), ipv6(2) } DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "ja": "オブジェクトnatAddrMapGlobalAddrType構文InetAddressType {ipv4（1）、ipv6（2）}説明「IPv4およびIPv6のサポートに応じて、グローバルIPv4および/またはIPv6アドレスをサポートするには実装が必要です。」"
    },
    {
      "indent": 6,
      "text": "OBJECT natAddrMapGlobalAddrFrom SYNTAX InetAddress (SIZE(4|16)) DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "ja": "オブジェクトnatAddrMapGlobalAddrFrom SYNTAX InetAddress（SIZE（4 | 16））説明「IPv4およびIPv6のサポートに応じて、グローバルIPv4および/またはIPv6アドレスをサポートするには実装が必要です。」"
    },
    {
      "indent": 6,
      "text": "OBJECT natAddrMapGlobalAddrTo SYNTAX InetAddress (SIZE(4|16)) DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "ja": "オブジェクトnatAddrMapGlobalAddrTo SYNTAX InetAddress（SIZE（4 | 16））説明「IPv4およびIPv6のサポートに応じて、グローバルIPv4またはIPv6アドレスをサポートするには実装が必要です。」"
    },
    {
      "indent": 6,
      "text": "OBJECT natAddrBindGlobalAddrType SYNTAX InetAddressType { ipv4(1), ipv6(2) } DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "ja": "オブジェクトnatAddrBindGlobalAddrType SYNTAX InetAddressType {ipv4（1）、ipv6（2）}説明「IPv4およびIPv6のサポートに応じて、グローバルIPv4またはIPv6アドレスをサポートするには実装が必要です。」"
    },
    {
      "indent": 6,
      "text": "OBJECT natAddrBindGlobalAddr SYNTAX InetAddress (SIZE(4|16)) DESCRIPTION \"An implementation is required to support global IPv4",
      "ja": "オブジェクトnatAddrBindGlobalAddr SYNTAX InetAddress（SIZE（4 | 16））説明「グローバルIPv4をサポートするには実装が必要です"
    },
    {
      "indent": 15,
      "text": "and/or IPv6 addresses, depending on its support\nfor IPv4 and IPv6.\"",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "OBJECT natAddrPortBindGlobalAddrType SYNTAX InetAddressType { ipv4(1), ipv6(2) } DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "ja": "オブジェクトnatAddrPortBindGlobalAddrType SYNTAX InetAddressType {ipv4（1）、ipv6（2）}説明「IPv4およびIPv6のサポートに応じて、グローバルIPv4および/またはIPv6アドレスをサポートするには実装が必要です。」"
    },
    {
      "indent": 6,
      "text": "OBJECT natAddrPortBindGlobalAddr SYNTAX InetAddress (SIZE(4|16)) DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "ja": "オブジェクトnatAddrPortBindGlobalAddr SYNTAX InetAddress（SIZE（4 | 16））説明「IPv4およびIPv6のサポートに応じて、グローバルIPv4またはIPv6アドレスをサポートするには実装が必要です。」"
    },
    {
      "indent": 6,
      "text": "OBJECT natSessionPrivateAddrType SYNTAX InetAddressType { ipv4(1), ipv6(2) } DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "ja": "オブジェクトnatSessionPrivateAddrType構文InetAddressType {ipv4（1）、ipv6（2）}説明「IPv4およびIPv6のサポートに応じて、グローバルIPv4またはIPv6アドレスをサポートするには実装が必要です。」"
    },
    {
      "indent": 6,
      "text": "OBJECT natSessionPrivateSrcAddr SYNTAX InetAddress (SIZE(4|16)) DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "ja": "オブジェクトnatSessionPrivateSrcAddr SYNTAX InetAddress（SIZE（4 | 16））説明「IPv4およびIPv6のサポートに応じて、グローバルIPv4および/またはIPv6アドレスをサポートするには実装が必要です。」"
    },
    {
      "indent": 6,
      "text": "OBJECT natSessionPrivateDstAddr SYNTAX InetAddress (SIZE(4|16)) DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "ja": "オブジェクトnatSessionPrivateDstAddr SYNTAX InetAddress（SIZE（4 | 16））説明「IPv4およびIPv6のサポートに応じて、グローバルIPv4および/またはIPv6アドレスをサポートするには実装が必要です。」"
    },
    {
      "indent": 6,
      "text": "OBJECT natSessionPublicAddrType SYNTAX InetAddressType { ipv4(1), ipv6(2) } DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "ja": "オブジェクトnatSessionPublicAddrType構文InetAddressType {ipv4（1）、ipv6（2）}説明「IPv4およびIPv6のサポートに応じて、グローバルIPv4および/またはIPv6アドレスをサポートするには実装が必要です。」"
    },
    {
      "indent": 6,
      "text": "OBJECT natSessionPublicSrcAddr SYNTAX InetAddress (SIZE(4|16))",
      "ja": "オブジェクトnatSessionPublicSrcAddr構文InetAddress（SIZE（4 | 16））"
    },
    {
      "indent": 6,
      "text": "DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "ja": "「IPv4およびIPv6のサポートに応じて、グローバルIPv4および/またはIPv6アドレスをサポートするには実装が必要です。」"
    },
    {
      "indent": 6,
      "text": "OBJECT natSessionPublicDstAddr SYNTAX InetAddress (SIZE(4|16)) DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "ja": "オブジェクトnatSessionPublicDstAddr SYNTAX InetAddress（SIZE（4 | 16））説明「IPv4およびIPv6のサポートに応じて、グローバルIPv4および/またはIPv6アドレスをサポートするには実装が必要です。」"
    },
    {
      "indent": 4,
      "text": "::= { natMIBCompliances 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "natMIBReadOnlyCompliance MODULE-COMPLIANCE STATUS current DESCRIPTION \"When this MIB is implemented without support for read-create (i.e., in read-only mode), then such an implementation can claim read-only compliance. Such a device can then be monitored but cannot be configured with this MIB.",
      "ja": "natMIBReadOnlyCompliance MODULE-COMPLIANCE STATUS現在の説明「このMIBが読み取り作成のサポートなしで（つまり、読み取り専用モードで）実装されると、そのような実装は読み取り専用のコンプライアンスを要求できます。このようなデバイスは監視できますが、監視できません このMIBで構成されます。"
    },
    {
      "indent": 13,
      "text": "The following index objects cannot be added as OBJECT\nclauses but nevertheless have the compliance\nrequirements:\n\"\n-- OBJECT  natAddrBindLocalAddrType\n-- SYNTAX  InetAddressType { ipv4(1), ipv6(2) }\n-- DESCRIPTION\n--         \"An implementation is required to support\n--          global IPv4 and/or IPv6 addresses, depending\n--          on its support for IPv4 and IPv6.\"",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 13,
      "text": "-- OBJECT natAddrBindLocalAddr -- SYNTAX InetAddress (SIZE(4|16))",
      "ja": "-オブジェクトnatAddrBindLocalAddr-構文InetAddress（SIZE（4 | 16））"
    },
    {
      "indent": 13,
      "text": "-- DESCRIPTION -- \"An implementation is required to support -- global IPv4 and/or IPv6 addresses, depending -- on its support for IPv4 and IPv6.\"",
      "ja": "-説明-「実装には、サポートが必要です-グローバルIPv4および/またはIPv6アドレス、依存-IPv4およびIPv6のサポートに依存します。」"
    },
    {
      "indent": 13,
      "text": "-- OBJECT natAddrPortBindLocalAddrType -- SYNTAX InetAddressType { ipv4(1), ipv6(2) } -- DESCRIPTION -- \"An implementation is required to support -- global IPv4 and/or IPv6 addresses, depending -- on its support for IPv4 and IPv6.\"",
      "ja": "-オブジェクトnatAddrPortBindLocalAddrType-構文InetAddressType {ipv4（1）、ipv6（2）}-説明-「サポートするには実装が必要です-グローバルIPv4および/またはIPv6アドレス、依存-IPv4および IPv6。」"
    },
    {
      "indent": 13,
      "text": "-- OBJECT natAddrPortBindLocalAddr -- SYNTAX InetAddress (SIZE(4|16)) -- DESCRIPTION -- \"An implementation is required to support -- global IPv4 and/or IPv6 addresses, depending -- on its support for IPv4 and IPv6.\"",
      "ja": "-オブジェクトnatAddrPortBindLocalAddr-構文InetAddress（SIZE（4 | 16））-説明-「サポートは実装が必要です-グローバルIPv4および/またはIPv6アドレス、依存-IPv4およびIPv6のサポートによって。」"
    },
    {
      "indent": 4,
      "text": "MODULE IF-MIB -- The interfaces MIB, RFC2863 MANDATORY-GROUPS { ifCounterDiscontinuityGroup }",
      "ja": "モジュールIF-MIB-インターフェイスMIB、RFC2863 MANDATORY-GROUPS {ifCounterDiscontinuityGroup}"
    },
    {
      "indent": 4,
      "text": "MODULE -- this module MANDATORY-GROUPS { natConfigGroup, natTranslationGroup, natStatsInterfaceGroup }",
      "ja": "モジュール-このモジュールの必須グループ{natConfigGroup、natTranslationGroup、natStatsInterfaceGroup}"
    },
    {
      "indent": 6,
      "text": "GROUP natStatsProtocolGroup DESCRIPTION \"This group is optional.\" GROUP natStatsAddrMapGroup DESCRIPTION \"This group is optional.\" GROUP natMIBNotificationGroup DESCRIPTION \"This group is optional.\" OBJECT natInterfaceRowStatus SYNTAX RowStatus { active(1) } MIN-ACCESS read-only DESCRIPTION \"Write access is not required, and active is the only status that needs to be supported.\"",
      "ja": "GROUP natStatsProtocolGroup DESCRIPTION \"このグループはオプションです。\" GROUP natStatsAddrMapGroup DESCRIPTION \"このグループはオプションです。\" GROUP natMIBNotificationGroup DESCRIPTION \"このグループはオプションです。\" オブジェクトnatInterfaceRowStatus構文RowStatus {active（1）} MIN-ACCESS読み取り専用説明「書き込みアクセスが必要となりません、アクティブがサポートされる必要がある唯一のステータスです。」"
    },
    {
      "indent": 6,
      "text": "OBJECT natAddrMapLocalAddrType SYNTAX InetAddressType { ipv4(1), ipv6(2) } MIN-ACCESS read-only DESCRIPTION \"Write access is not required. An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "ja": "オブジェクトnatAddrMapLocalAddrType SYNTAX InetAddressType {ipv4（1）、ipv6（2）} MIN-ACCESS読み取り専用説明 IPv6。」"
    },
    {
      "indent": 6,
      "text": "OBJECT natAddrMapLocalAddrFrom SYNTAX InetAddress (SIZE(4|16)) MIN-ACCESS read-only DESCRIPTION \"Write access is not required. An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "ja": "オブジェクトnatAddrMapLocalAddrFrom SYNTAX InetAddress（SIZE（4 | 16））MIN-ACCESS読み取り専用説明「書き込みアクセスは必要ありません。IPv4およびIPv6のサポートに応じて、グローバルIPv4および/またはIPv6アドレスをサポートするには実装が必要です。」"
    },
    {
      "indent": 6,
      "text": "OBJECT natAddrMapLocalAddrTo SYNTAX InetAddress (SIZE(4|16)) MIN-ACCESS read-only DESCRIPTION \"Write access is not required. An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "ja": "オブジェクトnatAddrMapLocalAddrTo SYNTAX InetAddress（SIZE（4 | 16））MIN-ACCESS読み取り専用説明「書き込みアクセスは必要ありません。IPv4およびIPv6のサポートに応じて、グローバルIPv4および/またはIPv6アドレスをサポートするには実装が必要です。」"
    },
    {
      "indent": 6,
      "text": "OBJECT natAddrMapGlobalAddrType SYNTAX InetAddressType { ipv4(1), ipv6(2) } MIN-ACCESS read-only DESCRIPTION \"Write access is not required. An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "ja": "オブジェクトnatAddrMapGlobalAddrType SYNTAX InetAddressType {ipv4（1）、ipv6（2）} MIN-ACCESS読み取り専用説明「書き込みアクセスは必要ありません。IPv4のサポートに応じて、グローバルIPv4および/またはIPv6アドレスをサポートするには実装が必要です。 IPv6。」"
    },
    {
      "indent": 6,
      "text": "OBJECT natAddrMapGlobalAddrFrom SYNTAX InetAddress (SIZE(4|16)) MIN-ACCESS read-only DESCRIPTION \"Write access is not required. An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "ja": "オブジェクトnatAddrMapGlobalAddrFrom SYNTAX InetAddress（SIZE（4 | 16））MIN-ACCESS読み取り専用説明「書き込みアクセスは必要ありません。IPv4およびIPv6のサポートに応じて、グローバルIPv4および/またはIPv6アドレスをサポートするには実装が必要です。」"
    },
    {
      "indent": 6,
      "text": "OBJECT natAddrMapGlobalAddrTo SYNTAX InetAddress (SIZE(4|16)) MIN-ACCESS read-only DESCRIPTION \"Write access is not required. An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "ja": "オブジェクトnatAddrMapGlobalAddrTo SYNTAX InetAddress（SIZE（4 | 16））MIN-ACCESS読み取り専用説明「書き込みアクセスは必要ありません。IPv4およびIPv6のサポートに応じて、グローバルIPv4および/またはIPv6アドレスをサポートするには実装が必要です。」"
    },
    {
      "indent": 6,
      "text": "OBJECT natAddrMapRowStatus SYNTAX RowStatus { active(1) } MIN-ACCESS read-only DESCRIPTION \"Write access is not required, and active is the only status that needs to be supported.\"",
      "ja": "オブジェクトnatAddrMapRowStatus構文RowStatus {active（1）} MIN-ACCESS読み取り専用説明「書き込みアクセスが必要となりません、アクティブがサポートされる必要がある唯一のステータスです。」"
    },
    {
      "indent": 6,
      "text": "OBJECT natAddrBindGlobalAddrType SYNTAX InetAddressType { ipv4(1), ipv6(2) } DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "ja": "オブジェクトnatAddrBindGlobalAddrType SYNTAX InetAddressType {ipv4（1）、ipv6（2）}説明「IPv4およびIPv6のサポートに応じて、グローバルIPv4またはIPv6アドレスをサポートするには実装が必要です。」"
    },
    {
      "indent": 6,
      "text": "OBJECT natAddrBindGlobalAddr SYNTAX InetAddress (SIZE(4|16))",
      "ja": "オブジェクトnatAddrBindGlobalAddr構文InetAddress（SIZE（4 | 16））"
    },
    {
      "indent": 6,
      "text": "DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "ja": "「IPv4およびIPv6のサポートに応じて、グローバルIPv4および/またはIPv6アドレスをサポートするには実装が必要です。」"
    },
    {
      "indent": 6,
      "text": "OBJECT natAddrPortBindGlobalAddrType SYNTAX InetAddressType { ipv4(1), ipv6(2) } DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "ja": "オブジェクトnatAddrPortBindGlobalAddrType SYNTAX InetAddressType {ipv4（1）、ipv6（2）}説明「IPv4およびIPv6のサポートに応じて、グローバルIPv4および/またはIPv6アドレスをサポートするには実装が必要です。」"
    },
    {
      "indent": 6,
      "text": "OBJECT natAddrPortBindGlobalAddr SYNTAX InetAddress (SIZE(4|16)) DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "ja": "オブジェクトnatAddrPortBindGlobalAddr SYNTAX InetAddress（SIZE（4 | 16））説明「IPv4およびIPv6のサポートに応じて、グローバルIPv4またはIPv6アドレスをサポートするには実装が必要です。」"
    },
    {
      "indent": 6,
      "text": "OBJECT natSessionPrivateAddrType SYNTAX InetAddressType { ipv4(1), ipv6(2) } DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "ja": "オブジェクトnatSessionPrivateAddrType構文InetAddressType {ipv4（1）、ipv6（2）}説明「IPv4およびIPv6のサポートに応じて、グローバルIPv4またはIPv6アドレスをサポートするには実装が必要です。」"
    },
    {
      "indent": 6,
      "text": "OBJECT natSessionPrivateSrcAddr SYNTAX InetAddress (SIZE(4|16)) DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "ja": "オブジェクトnatSessionPrivateSrcAddr SYNTAX InetAddress（SIZE（4 | 16））説明「IPv4およびIPv6のサポートに応じて、グローバルIPv4および/またはIPv6アドレスをサポートするには実装が必要です。」"
    },
    {
      "indent": 6,
      "text": "OBJECT natSessionPrivateDstAddr SYNTAX InetAddress (SIZE(4|16)) DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "ja": "オブジェクトnatSessionPrivateDstAddr SYNTAX InetAddress（SIZE（4 | 16））説明「IPv4およびIPv6のサポートに応じて、グローバルIPv4および/またはIPv6アドレスをサポートするには実装が必要です。」"
    },
    {
      "indent": 6,
      "text": "OBJECT natSessionPublicAddrType SYNTAX InetAddressType { ipv4(1), ipv6(2) } DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "ja": "オブジェクトnatSessionPublicAddrType構文InetAddressType {ipv4（1）、ipv6（2）}説明「IPv4およびIPv6のサポートに応じて、グローバルIPv4および/またはIPv6アドレスをサポートするには実装が必要です。」"
    },
    {
      "indent": 6,
      "text": "OBJECT natSessionPublicSrcAddr",
      "ja": "オブジェクトnatSessionPublicSrcAddr"
    },
    {
      "indent": 6,
      "text": "SYNTAX InetAddress (SIZE(4|16)) DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "ja": "構文InetAddress（SIZE（4 | 16））説明「IPv4およびIPv6のサポートに応じて、グローバルIPv4および/またはIPv6アドレスをサポートするには実装が必要です。」"
    },
    {
      "indent": 6,
      "text": "OBJECT natSessionPublicDstAddr SYNTAX InetAddress (SIZE(4|16)) DESCRIPTION \"An implementation is required to support global IPv4 and/or IPv6 addresses, depending on its support for IPv4 and IPv6.\"",
      "ja": "オブジェクトnatSessionPublicDstAddr SYNTAX InetAddress（SIZE（4 | 16））説明「IPv4およびIPv6のサポートに応じて、グローバルIPv4および/またはIPv6アドレスをサポートするには実装が必要です。」"
    },
    {
      "indent": 4,
      "text": "::= { natMIBCompliances 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "END",
      "ja": "終わり"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgements",
      "section_title": true,
      "ja": "6.謝辞"
    },
    {
      "indent": 3,
      "text": "The authors of the document would like to thank Randy Turner, Ashwini S.T., Kevin Luehrs, Sam Sankoorikal, and Juergen Quittek for their valuable feedback.",
      "ja": "このドキュメントの著者は、貴重なフィードバックをしてくれたランディターナー、アシュウィニS.T.、ケビンルーア、サムサンコーリカル、およびユルゲンキッテクに感謝します。"
    },
    {
      "indent": 3,
      "text": "The authors would like to especially thank Juergen Schoenwaelder for his patient and fine-combed review and detailed comments as a MIB doctor. The NAT MIB is much clearer and flatter as a result of Juergen's suggestions.",
      "ja": "著者は、MIB医師としての彼の忍耐強く丁寧なレビューと詳細なコメントについて特にJuergen Schoenwaelderに感謝したいと思います。 NAT MIBは、ユルゲンの提案の結果、はるかに明確で平坦になりました。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "ja": "7.セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "It is clear that this MIB can potentially be useful for configuration. Unauthorized access to the write-able objects could cause a denial of service and/or widespread network disturbance. Hence, the support for SET operations in a non-secure environment without proper protection can have a negative effect on network operations.",
      "ja": "このMIBが構成に役立つ可能性があることは明らかです。 書き込み可能なオブジェクトへの不正アクセスは、サービス拒否や広範なネットワーク障害を引き起こす可能性があります。 したがって、適切な保護のない非セキュア環境でのSET操作のサポートは、ネットワーク操作に悪影響を及ぼす可能性があります。"
    },
    {
      "indent": 3,
      "text": "At this writing, no security holes have been identified beyond those that SNMP Security is itself intended to address. These relate primarily to controlled access to sensitive information and the ability to configure a device - or which might result from operator error, which is beyond the scope of any security architecture.",
      "ja": "この記事の執筆時点では、SNMPセキュリティ自体が対処することを意図したセキュリティホール以外のセキュリティホールは確認されていません。 これらは主に、機密情報へのアクセスの制御と、デバイスを構成する機能に関連しています。これは、セキュリティアーキテクチャの範囲を超えた、オペレータのエラーに起因する可能性があります。"
    },
    {
      "indent": 3,
      "text": "There are a number of managed objects in this MIB that may contain information that may be sensitive from a business perspective, in that they may represent NAT bind and session information. The NAT bind and session objects reveal the identity of private hosts that are engaged in a session with external end nodes. A curious outsider could monitor these two objects to assess the number of private hosts being supported by the NAT device. Further, a disgruntled former employee of an enterprise could use the NAT bind and session information to break into specific private hosts by intercepting the existing sessions or originating new sessions into the host. There are no objects that are sensitive in their own right, such as passwords or monetary amounts. It may even be important to control GET access to these objects and possibly to encrypt the values of these objects when they are sent over the network via SNMP. Not all versions of SNMP provide features for such a secure environment.",
      "ja": "このMIBには、NATバインドおよびセッション情報を表す可能性があるという点で、ビジネスの観点から機密性の高い情報を含む可能性のある多くの管理対象オブジェクトがあります。 NATバインドおよびセッションオブジェクトは、外部エンドノードとのセッションに関与しているプライベートホストのIDを明らかにします。 好奇心の強い部外者は、これら2つのオブジェクトを監視して、NATデバイスでサポートされているプライベートホストの数を評価できます。 さらに、企業の不満を抱いた元従業員は、NATバインドおよびセッション情報を使用して、既存のセッションを傍受するか、ホストに新しいセッションを発信することにより、特定のプライベートホストに侵入できます。 パスワードや金額など、それ自体が機密性の高いオブジェクトはありません。 これらのオブジェクトへのGETアクセスを制御し、SNMPを介してネットワーク経由で送信される場合、これらのオブジェクトの値を暗号化することも重要です。 SNMPのすべてのバージョンがこのような安全な環境の機能を提供するわけではありません。"
    },
    {
      "indent": 3,
      "text": "SNMP versions prior to SNMPv3 did not include adequate security. Even if the network itself is secure (for example by using IPSec), even then, there is no control as to who on the secure network is allowed to access and GET/SET (read/change/create/delete) the objects in this MIB.",
      "ja": "SNMPv3より前のSNMPバージョンには、適切なセキュリティが含まれていませんでした。 ネットワーク自体がセキュリティで保護されている場合（たとえば、IPSecを使用する場合）でも、セキュリティで保護されたネットワーク上の誰がこのオブジェクトにアクセスしてGET / SET（読み取り/変更/作成/削除）できるかについては制御できません。 MIB。"
    },
    {
      "indent": 3,
      "text": "It is recommended that the implementers consider the security features as provided by the SNMPv3 framework (see [RFC3410], section 8), including full support for the SNMPv3 cryptographic mechanisms (for authentication and privacy).",
      "ja": "実装者は、SNMPv3暗号化メカニズムの完全なサポート（認証とプライバシーのため）を含む、SNMPv3フレームワークによって提供されるセキュリティ機能（[RFC3410]、セクション8を参照）を考慮することをお勧めします。"
    },
    {
      "indent": 3,
      "text": "Further, deployment of SNMP versions prior to SNMPv3 is NOT RECOMMENDED. Instead, it is RECOMMENDED to deploy SNMPv3 and to enable cryptographic security. It is then a customer/operator responsibility to ensure that the SNMP entity giving access to an instance of this MIB module is properly configured to give access to the objects only to those principals (users) that have legitimate rights to indeed GET or SET (change/create/delete) them.",
      "ja": "さらに、SNMPv3より前のSNMPバージョンの展開は推奨されません。 代わりに、SNMPv3を展開し、暗号化セキュリティを有効にすることをお勧めします。 次に、このMIBモジュールのインスタンスへのアクセスを提供するSNMPエンティティが、実際にGETまたはSET（変更）に対する正当な権利を持つプリンシパル（ユーザー）のみにオブジェクトへのアクセスを許可するように正しく構成されていることを確認するのは、顧客/オペレーターの責任です / create / delete）それら。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8.参照"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "ja": "8.1。 規範的参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC2578] McCloghrie, K., Perkins, D., and J. Schoenwaelder, \"Structure of Management Information Version 2 (SMIv2)\", STD 58, RFC 2578, April 1999.",
      "ja": "[RFC2578] McCloghrie、K.、Perkins、D。、およびJ. Schoenwaelder、「管理情報バージョン2（SMIv2）の構造」、STD 58、RFC 2578、1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2579] McCloghrie, K., Perkins, D., and J. Schoenwaelder, \"Textual Conventions for SMIv2\", STD 58, RFC 2579, April 1999.",
      "ja": "[RFC2579] McCloghrie、K.、Perkins、D。、およびJ. Schoenwaelder、「SMIv2のテキスト表記規則」、STD 58、RFC 2579、1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2580] McCloghrie, K., Perkins, D., and J. Schoenwaelder, \"Conformance Statements for SMIv2\", STD 58, RFC 2580, April 1999.",
      "ja": "[RFC2580] McCloghrie、K.、Perkins、D。、およびJ. Schoenwaelder、「SMIv2の適合宣言」、STD 58、RFC 2580、1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC3022] Srisuresh, P. and K. Egevang, \"Traditional IP Network Address Translator (Traditional NAT)\", RFC 3022, January 2001.",
      "ja": "[RFC3022] Srisuresh、P。、およびK. Egevang、「Traditional IP Network Address Translator（Traditional NAT）」、RFC 3022、2001年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC2663] Srisuresh, P. and M. Holdrege, \"IP Network Address Translator (NAT) Terminology and Considerations\", RFC 2663, August 1999.",
      "ja": "[RFC2663] Srisuresh、P。、およびM. Holdrege、「IPネットワークアドレス変換（NAT）の用語と考慮事項」、RFC 2663、1999年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC4001] Daniele, M., Haberman, B., Routhier, S., Schoenwaelder, J., \"Textual Conventions for Internet Network Addresses\", RFC 4001, February 2005.",
      "ja": "[RFC4001]ダニエル、M。、ハーバーマン、B。、ラウティエ、S。、シェーンヴェルダー、J。、「インターネットネットワークアドレスのテキスト表記規則」、RFC 4001、2005年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC792] Postel, J., \"Internet Control Message Protocol\", STD 5, RFC 792, September 1981.",
      "ja": "[RFC792]ポステル、J。、「インターネット制御メッセージプロトコル」、STD 5、RFC 792、1981年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC3489] Rosenberg, J., Weinberger, J., Huitema, C., and R. Mahy, \"STUN - Simple Traversal of User Datagram Protocol (UDP) Through Network Address Translators (NATs)\", RFC 3489, March 2003.",
      "ja": "[RFC3489] Rosenberg、J.、Weinberger、J.、Huitema、C。、およびR. Mahy、「STUN-ネットワークアドレス変換器（NAT）を介したユーザーデータグラムプロトコル（UDP）の単純なトラバース」、RFC 3489、2003年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2863] McCloghrie, K. and F. Kastenholz, \"The Interfaces Group MIB\", RFC 2863, June 2000.",
      "ja": "[RFC2863] McCloghrie、K。およびF. Kastenholz、「インターフェースグループMIB」、RFC 2863、2000年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC2463] Conta, A. and S. Deering, \"Internet Control Message Protocol (ICMPv6) for the Internet Protocol Version 6 (IPv6) Specification\", RFC 2463, December 1998.",
      "ja": "[RFC2463] Conta、A。、およびS. Deering、「インターネットプロトコルバージョン6（IPv6）仕様のインターネット制御メッセージプロトコル（ICMPv6）」、RFC 2463、1998年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC3411] Harrington, D., Presuhn, R., and B. Wijnen, \"An Architecture for Describing Simple Network Management Protocol (SNMP) Management Frameworks\", STD 62, RFC 3411, December 2002.",
      "ja": "[RFC3411] Harrington、D.、Presuhn、R。、およびB. Wijnen、「簡易ネットワーク管理プロトコル（SNMP）管理フレームワークを記述するためのアーキテクチャ」、STD 62、RFC 3411、2002年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119] Bradner、S。、「要件レベルを示すためにRFCで使用するキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3413] Levi, D., Meyer, P., and B. Stewart, \"Simple Network Management Protocol (SNMP) Applications\", STD 62, RFC 3413, December 2002.",
      "ja": "[RFC3413] Levi、D.、Meyer、P。、およびB. Stewart、「簡易ネットワーク管理プロトコル（SNMP）アプリケーション」、STD 62、RFC 3413、2002年12月。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "ja": "8.2。 参考資料"
    },
    {
      "indent": 3,
      "text": "[RFC1918] Rekhter, Y., Moskowitz, B., Karrenberg, D., de Groot, G., and E. Lear, \"Address Allocation for Private Internets\", BCP 5, RFC 1918, February 1996.",
      "ja": "[RFC1918] Rekhter、Y.、Moskowitz、B.、Karrenberg、D.、de Groot、G。、およびE. Lear、「プライベートインターネットのアドレス割り当て」、BCP 5、RFC 1918、1996年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC3410] Case, J., Mundy, R., Partain, D., and B. Stewart, \"Introduction and Applicability Statements for Internet-Standard Management Framework\", RFC 3410, December 2002.",
      "ja": "[RFC3410]ケース、J。、マンディー、R。、パーテイン、D。、およびB.スチュワート、「インターネット標準管理フレームワークの導入および適用ステートメント」、RFC 3410、2002年12月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "R. Rohit Mascon Global Limited #59/2 100 ft Ring Road Banashankari II Stage Bangalore 560 070 India",
      "ja": "R. Rohit Mascon Global Limited＃59/2 100 ft Ring Road Banashankari II Stageバンガロール560 070インド"
    },
    {
      "indent": 3,
      "text": "Phone: +91 80 679 6227 EMail: rrohit74@hotmail.com",
      "ja": "電話：+91 80 679 6227電子メール：rrohit74@hotmail.com"
    },
    {
      "indent": 3,
      "text": "P. Srisuresh Caymas Systems, Inc. 1179-A North McDowell Blvd. Petaluma, CA 94954",
      "ja": "P. Srisuresh Caymas Systems、Inc. 1179-A North McDowell Blvd. ペタルマ、CA 94954"
    },
    {
      "indent": 3,
      "text": "Phone: (707) 283-5063 EMail: srisuresh@yahoo.com",
      "ja": "電話：（707）283-5063電子メール：srisuresh@yahoo.com"
    },
    {
      "indent": 3,
      "text": "Rajiv Raghunarayan Cisco Systems Inc. 170 West Tasman Drive San Jose, CA 95134",
      "ja": "Rajiv Raghunarayan Cisco Systems Inc. 170 West Tasman Drive San Jose、CA 95134"
    },
    {
      "indent": 3,
      "text": "Phone: +1 408 853 9612 EMail: raraghun@cisco.com",
      "ja": "電話：+1 408 853 9612電子メール：raraghun@cisco.com"
    },
    {
      "indent": 3,
      "text": "Nalinaksh Pai Cisco Systems, Inc. Prestige Waterford No. 9, Brunton Road Bangalore - 560 025 India",
      "ja": "Nalinaksh Pai Cisco Systems、Inc. Prestige Waterford No. 9、Brunton Road Bangalore-560 025インド"
    },
    {
      "indent": 3,
      "text": "Phone: +91 80 532 1300 extn. 6354 EMail: npai@cisco.com",
      "ja": "電話：+91 80 532 1300内線 6354電子メール：npai@cisco.com"
    },
    {
      "indent": 3,
      "text": "Cliff Wang Information Security Bank One Corp 1111 Polaris Pkwy Columbus, OH 43240",
      "ja": "Cliff Wang Information Security Bank One Corp 1111 Polaris Pkwy Columbus、OH 43240"
    },
    {
      "indent": 3,
      "text": "Phone: +1 614 213 6117 EMail: cliffwang2000@yahoo.com",
      "ja": "電話：+1 614 213 6117メール：cliffwang2000@yahoo.com"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "ja": "著作権（C）インターネット協会（2005）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "この文書は、BCP 78に含まれる権利、ライセンス、制限の対象となります。また、そこに記載されている場合を除き、著者はすべての権利を保持します。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "本書および本書に含まれる情報は「現状のまま」提供され、寄稿者、代表者または代表者（もしあれば）、インターネット協会、インターネットエンジニアリングタスクフォースはすべての保証を放棄します 黙示的であるが、ここに記載されている情報の使用が商品性または特定の目的への適合性の黙示的保証を侵害しないという保証に限定されない。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、本書に記載されている技術の実装または使用に関連すると主張される可能性のある知的財産権またはその他の権利の有効性または範囲、またはそのような権利の下でのライセンスの有無に関して、立場をとりません。 利用可能 また、そのような権利を特定するための独立した努力を行ったことを表すものでもありません。 RFC文書の権利に関する手順に関する情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IETF事務局に行われたIPR開示のコピーおよび利用可能になるライセンスの保証、またはこの仕様の実装者またはユーザーによる一般的なライセンスまたはそのような所有権の使用許可の取得を試みた結果を取得できます。 IETFオンラインIPRリポジトリ（http://www.ietf.org/ipr）から。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、この標準を実装するために必要な技術を対象とする著作権、特許、特許出願、またはその他の所有権に関心を寄せるよう、あらゆる利害関係者を招待します。 IETFのietf-ipr@ietf.orgに情報を送信してください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "了承"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能の資金は、現在インターネット協会によって提供されています。"
    }
  ]
}