{
  "title": {
    "text": "RFC 4161 - Guidelines for Optional Services for Internet Fax Gateways",
    "ja": "RFC 4161 - インターネットファックスゲートウェイのオプションサービスのガイドライン"
  },
  "number": 4161,
  "created_at": "2023-08-02 13:17:35.301251+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                         K. Mimura\nRequest for Comments: 4161                                  K. Yokoyama\nCategory: Informational                                        T. Satoh\n                                                            K. Watanabe\n                                                             C. Kanaide\n                                           TOYO Communication Equipment\n                                                            August 2005",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 7,
      "text": "Guidelines for Optional Services for Internet Fax Gateways",
      "ja": "インターネットファックスゲートウェイのオプションサービスのガイドライン"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモは、インターネットコミュニティに情報を提供します。いかなる種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "ja": "Copyright（c）The Internet Society（2005）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "To allow connectivity between the general switched telephone network facsimile service (GSTN fax) and the e-mail-based Internet Fax service (i-fax), an \"Internet Fax Gateway\" is required. This document provides guidelines for the optional functionality of Internet Fax Gateways. In this context, an \"offramp gateway\" provides facsimile data transmission from i-fax to GSTN fax; vice versa, an \"onramp gateway\" provides data transmission from GSTN fax to i-fax. The recommendations in this document apply to the integrated service including Internet Fax terminals, computers with i-fax software on the Internet, and GSTN fax terminals on the GSTN.",
      "ja": "一般的な切り替えの電話ネットワークファクシミリサービス（GSTN FAX）と電子メールベースのインターネットファックスサービス（Iファックス）間の接続を可能にするには、「インターネットファックスゲートウェイ」が必要です。このドキュメントは、インターネットファックスゲートウェイのオプション機能に関するガイドラインを提供します。これに関連して、「Offramp Gateway」は、I-FaxからGSTN Faxへのファクシミリデータ送信を提供します。その逆の場合、「Onramp Gateway」はGSTN FaxからIファックスへのデータ送信を提供します。このドキュメントの推奨事項は、インターネットFAX端子、インターネット上のIファックスソフトウェアを備えたコンピューター、GSTN上のGSTN FAX端子を含む統合サービスに適用されます。"
    },
    {
      "indent": 3,
      "text": "This document supplements the recommendation for minimal features of an Internet Fax Gateway. In particular, it covers techniques for dropping duplicated fax messages, automatic fax re-transmission, error, return notice, and log handling, and possible authorization methods by DTMF (Dual Tone Multi-Frequency) for onramp gateways.",
      "ja": "このドキュメントは、インターネットFAXゲートウェイの最小限の機能に関する推奨事項を補完します。特に、OnRampゲートウェイのDTMF（デュアルトーンマルチフェーク）による重複したFAXメッセージ、自動FAXの再送信、エラー、返信通知、ログ処理、および可能な承認方法を削除するための手法をカバーしています。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "An Internet Fax Gateway can be classified as either an offramp gateway or an onramp gateway. This document provides guidelines for optional services and examples of Internet Fax Gateway operations. In particular, it covers techniques for dropping duplicated fax messages, automatic fax re-transmission, error, return notice, and log handling, and possible authorization methods by DTMF (Dual Tone Multi-Frequency) for onramp gateways.",
      "ja": "インターネットFAXゲートウェイは、オフランプゲートウェイまたはOnrampゲートウェイのいずれかに分類できます。このドキュメントは、オプションのサービスのガイドラインと、インターネットファックスゲートウェイ操作の例を提供します。特に、OnRampゲートウェイのDTMF（デュアルトーンマルチフェーク）による重複したFAXメッセージ、自動FAXの再送信、エラー、返信通知、ログ処理、および可能な承認方法を削除するための手法をカバーしています。"
    },
    {
      "indent": 3,
      "text": "A more detailed definition of onramps and offramps is provided in [1]. Recommended behaviors for Internet Fax Gateway functions are defined in [15].",
      "ja": "オンランプとオフランプのより詳細な定義は[1]に記載されています。インターネットファックスゲートウェイ関数の推奨動作は[15]で定義されています。"
    },
    {
      "indent": 3,
      "text": "This document provides recommendations only for the specific cases hereunder:",
      "ja": "このドキュメントは、以下の特定のケースについてのみの推奨事項を提供します。"
    },
    {
      "indent": 3,
      "text": "1) the operational mode of the Internet Fax is \"store and forward\", as defined in Section 2.5 of [1].",
      "ja": "1) インターネットファックスの運用モードは、[1]のセクション2.5で定義されているように、「ストアアンドフォワード」です。"
    },
    {
      "indent": 3,
      "text": "2) The format of image data is the data format defined by \"simple mode\" in [16].",
      "ja": "2) 画像データの形式は、[16]の「シンプルモード」で定義されるデータ形式です。"
    },
    {
      "indent": 3,
      "text": "This document does not apply to the gateway functions for \"real-time Internet Fax\", as described and defined in [18].",
      "ja": "このドキュメントは、[18]で説明および定義されているように、「リアルタイムインターネットファックス」のゲートウェイ関数には適用されません。"
    },
    {
      "indent": 0,
      "text": "1.1. Key Words",
      "section_title": true,
      "ja": "1.1. キーワード"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"SHOULD\", \"SHOULD NOT\", and \"MAY\" in this document are to be interpreted as described in [17].",
      "ja": "このドキュメントの「必須」、「すべき」、「すべき」、「すべきではない」、「可能性」は、[17]で説明されているように解釈されるべきです。"
    },
    {
      "indent": 0,
      "text": "2. Optional Services for an Offramp Gateway",
      "section_title": true,
      "ja": "2. オフランプゲートウェイのオプションサービス"
    },
    {
      "indent": 0,
      "text": "2.1. Drop Duplicated GSTN Fax Transmission",
      "section_title": true,
      "ja": "2.1. 複製されたGSTNファックス伝送をドロップします"
    },
    {
      "indent": 3,
      "text": "Electronic mail transport agents (MTA) deliver an Internet Fax message into either the recipient's mailbox or an offramp gateway mailbox. Hence, the message is retrieved for further action, which in the case of the offramp gateway, will result in its delivery to the GSTN fax service.",
      "ja": "電子メール輸送エージェント（MTA）は、インターネットファックスメッセージを受信者のメールボックスまたはオフランプゲートウェイメールボックスのいずれかに配信します。したがって、メッセージはさらなるアクションのために取得されます。これにより、Offramp Gatewayの場合、GSTN Faxサービスへの配信が行われます。"
    },
    {
      "indent": 3,
      "text": "The offramp gateway mailbox will thus receive all messages which the gateway will process, regardless of their final, distinct GSTN destinations. As such, addresses like",
      "ja": "したがって、Offramp Gatewayメールボックスは、最終的な個別のGSTN宛先に関係なく、ゲートウェイが処理するすべてのメッセージを受信します。そのため、アドレスは次のとおりです"
    },
    {
      "indent": 6,
      "text": "Fax=+12224567654@example.com\nFax=+38155234578@example.com\nFax=+3904567437777@example.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "will all end up in the offramp gateway mailbox corresponding to the \"example.com\" domain.",
      "ja": "すべてが「Example.com」ドメインに対応するOfframp Gatewayメールボックスに行き着きます。"
    },
    {
      "indent": 3,
      "text": "However, the handling of e-mail messages (including those of Internet Faxes) that contain more than one recipient, but are directed to the same final MTA, can be different, depending on the MTA configuration or features. A single message with multiple recipients in the SMTP envelope [19] is likely to be the most common case on the mail transport system, but it may happen that multiple copies of the same message are transmitted, one per recipient. Or it may happen that the final MTA is set to deliver a separate copy of the message per recipient into the final mailbox, supposing it is delivering messages to real mailboxes of distinct endusers.",
      "ja": "ただし、複数の受信者を含むが同じ最終的なMTAに向けられている電子メールメッセージ（インターネットファックスを含む）の処理は、MTAの構成または機能に応じて異なる場合があります。SMTPエンベロープ[19]に複数の受信者を含む単一のメッセージは、郵便輸送システムで最も一般的なケースである可能性がありますが、同じメッセージの複数のコピーが送信され、1人が受信者ごとに送信される可能性があります。または、最終的なMTAが、受信者ごとのメッセージの個別のコピーを最終メールボックスに配信するように設定されている場合があります。"
    },
    {
      "indent": 3,
      "text": "Thus, it may happen that the offramp gateway receives multiple copies of the same Internet Fax message that is to be delivered to different GSTN destinations, which are listed together and repeatedly in the e-mail message headers [20] of the Internet Fax. In such cases, the offramp gateway SHOULD implement techniques to avoid duplicate or multiple transmission over GSTN of the same fax message to the same recipient.",
      "ja": "したがって、Offramp Gatewayは、インターネットFAXの電子メールメッセージヘッダー[20]に互いにリストされ、繰り返しリストされている異なるGSTN宛先に配信される同じインターネットファックスメッセージの複数のコピーを受信します。そのような場合、Offramp Gatewayは、同じファックスメッセージのGSTNを介した複数の送信を同じ受信者に介して複数の送信を避けるための手法を実装する必要があります。"
    },
    {
      "indent": 3,
      "text": "Here are some possible, but non-exclusive, examples of these techniques.",
      "ja": "これらの手法の可能性はありますが、非独占的な例を紹介します。"
    },
    {
      "indent": 0,
      "text": "2.1.1. SMTP Envelope Addresses Check",
      "section_title": true,
      "ja": "2.1.1. SMTPエンベロープアドレスチェック"
    },
    {
      "indent": 3,
      "text": "Using the SMTP [19] envelope destination address given in the \"RCPT TO\" field is usually the best technique to ensure that a received message is delivered to that address, and to avoid duplicate deliveries.",
      "ja": "「RCPTから」フィールドに与えられたSMTP [19]エンベロープ宛先アドレスを使用することは、通常、受信したメッセージがそのアドレスに配信され、重複配信を避けるための最良の手法です。"
    },
    {
      "indent": 3,
      "text": "If the offramp gateway has the \"RCPT TO\" information still available during processing, then it MUST use it to determine the recipients over GSTN fax service.",
      "ja": "Offramp Gatewayに、処理中にまだ利用可能な情報がまだ「RCPT」がある場合、GSTN FAXサービスを通じて受信者を決定するために使用する必要があります。"
    },
    {
      "indent": 0,
      "text": "2.1.2 Message-ID Check",
      "section_title": true,
      "ja": "2.1.2 メッセージ-IDチェック"
    },
    {
      "indent": 3,
      "text": "If the SMTP \"RCPT TO\" information is not available (for example, in the case where the offramp gateway retrieves messages from its mailbox using either POP [21] or IMAP [22]), the message header \"Message-ID\" (see [20]) MAY be used to check if a message has already been processed, and hence avoid retransmission to all its GSTN recipients handled by the offramp gateway.",
      "ja": "smtp \"rcpt to\"情報が利用できない場合（たとえば、Offramp GatewayがPOP [21]またはIMAP [22]のいずれかを使用してメールボックスからメッセージを取得する場合）、メッセージヘッダー「Message-ID」（参照[20]）は、メッセージが既に処理されているかどうかを確認するために使用される可能性があるため、Offramp Gatewayで処理されたすべてのGSTN受信者への再送信を避けることができます。"
    },
    {
      "indent": 0,
      "text": "2.2. Error Handling",
      "section_title": true,
      "ja": "2.2. エラー処理"
    },
    {
      "indent": 0,
      "text": "2.2.1. Recoverable Errors",
      "section_title": true,
      "ja": "2.2.1. 回復可能なエラー"
    },
    {
      "indent": 3,
      "text": "Recoverable errors that happen during GSTN transmission are those where there is good chance that the error may not occur at the next attempt. This category includes \"busy signal\", \"no line/carrier signal\", etc.",
      "ja": "GSTN伝送中に発生する回復可能なエラーは、次の試みでエラーが発生しない可能性がある場合があります。このカテゴリには、「ビジー信号」、「ライン/キャリア信号なし」などが含まれます。"
    },
    {
      "indent": 3,
      "text": "For all these errors, the offramp gateway SHOULD re-queue the message and perform a retransmission attempt later on, as specified in Section 2.3.",
      "ja": "これらすべてのエラーについて、Offramp Gatewayはメッセージを再度再生し、セクション2.3で指定されているように、後で再送信試行を実行する必要があります。"
    },
    {
      "indent": 0,
      "text": "2.2.2. Non-Recoverable Errors",
      "section_title": true,
      "ja": "2.2.2. 回復不可能なエラー"
    },
    {
      "indent": 3,
      "text": "If the error that occurs during GSTN transmission is likely non-recoverable, the offramp gateway SHOULD NOT attempt retransmission, and an error Message Delivery Notification (MDN) with appropriate error codes MUST be generated for the Internet Fax message sender. Examples of non-recoverable errors include paper-related errors (such as a jam, an empty tray, etc.) at a remote device, no response from a remote destination, voice response errors, data modem response errors, and stop event errors.",
      "ja": "GSTN送信中に発生するエラーが再回復可能である可能性が高い場合、Offramp Gatewayは再送信を試みるべきではなく、インターネットFAXメッセージ送信者に対して適切なエラーコードを備えたエラーメッセージ配信通知（MDN）を生成する必要があります。回復不可能なエラーの例には、リモートデバイスでの紙関連のエラー（ジャム、空のトレイなど）、リモート宛先からの応答、音声応答エラー、データモデム応答エラー、イベントエラーの停止などがあります。"
    },
    {
      "indent": 0,
      "text": "2.3. Automatic Re-Transmission Handling",
      "section_title": true,
      "ja": "2.3. 自動再送信処理"
    },
    {
      "indent": 3,
      "text": "An offramp gateway SHOULD implement a function that automatically tries to send facsimile data again if recoverable delivery failure occurs. If this function is implemented, then:",
      "ja": "Offramp Gatewayは、回復可能な配信の障害が発生した場合に、ファクシミリデータを再度送信しようとする関数を実装する必要があります。この関数が実装されている場合、次のとおりです。"
    },
    {
      "indent": 3,
      "text": "- the retry times and retry interval MAY be specified as options by the administrator of the offramp gateway;",
      "ja": "- 再試行時間と再試行間隔は、オフランプゲートウェイの管理者によってオプションとして指定される場合があります。"
    },
    {
      "indent": 3,
      "text": "- any error return notice SHOULD be sent only when the maximum number of retries has been completed without success;",
      "ja": "- エラー返品通知は、成功せずに最大レトリの最大数が完了した場合にのみ送信する必要があります。"
    },
    {
      "indent": 3,
      "text": "- if transmission is suspended due to an error, then the subsequent transmission attempt SHOULD avoid retransmitting the pages already delivered successfully, if any.",
      "ja": "- エラーのために送信が中断された場合、その後の送信試行は、もしあれば既に正常に配信されているページの再送信を避ける必要があります。"
    },
    {
      "indent": 0,
      "text": "2.4. Multiple Return Notice Handling",
      "section_title": true,
      "ja": "2.4. 複数の返品通知処理"
    },
    {
      "indent": 3,
      "text": "An offramp gateway can receive an Internet Fax for delivery to multiple GSTN recipients. If errors occur, which require the Internet Fax sender to be informed about them, or if the Internet Fax sender requested delivery notifications, then the offramp gateway has various ways to handle these multiple return notices: 1) An offramp gateway sends a return notice as soon as an error or a successful delivery occurs, per single GSTN recipient.",
      "ja": "Offramp Gatewayは、複数のGSTN受信者に配信するためのインターネットファックスを受け取ることができます。インターネットFAX送信者にそれらについて通知する必要があるエラーが発生した場合、またはインターネットFAX送信者が配信通知を要求した場合、Offramp Gatewayにはこれらの複数の返品通知を処理するさまざまな方法があります。エラーまたは配信が成功するとすぐに、単一のGSTNレシピエントごとに。"
    },
    {
      "indent": 3,
      "text": "2) An offramp gateway gathers all information about the message, but sends a return notice only after all or a number of GSTN recipients have been handled (successfully or not).",
      "ja": "2) Offramp Gatewayは、メッセージに関するすべての情報を収集しますが、GSTNの受信者がすべてまたは多くのGSTN受信者が処理された後にのみ返品通知を送信します（成功したかどうか）。"
    },
    {
      "indent": 3,
      "text": "If Case 2 is implemented, then the offramp gateway MAY also choose to send separate success and failure notices, or to limit the number of GSTN recipients handled per single return note (for example, no more than 10 recipients per return note).",
      "ja": "ケース2が実装されている場合、Offramp Gatewayは、個別の成功通知と失敗通知を送信するか、単一のリターンノートごとに処理されたGSTN受信者の数を制限することも選択できます（たとえば、返品ごとに10人以下の受信者）。"
    },
    {
      "indent": 0,
      "text": "2.5. Handling Transmission Errors for a Return Notice",
      "section_title": true,
      "ja": "2.5. 返品通知の送信エラーの処理"
    },
    {
      "indent": 3,
      "text": "When an offramp gateway fails in the transmission of a return notice, the Internet Fax Gateway SHOULD process the notice in either of the following ways:",
      "ja": "オフランプゲートウェイが返信通知の送信に失敗した場合、インターネットFAXゲートウェイは次の方法のいずれかで通知を処理する必要があります。"
    },
    {
      "indent": 3,
      "text": "1) The return notices SHOULD be re-queued, and delivery retried later. The number of retry attempts and the time interval between them MAY be a feature configured by the offramp gateway administrator. This is the preferred method to implement; however, if all the retransmission attempts fail, processing SHOULD continue as in Case 2.",
      "ja": "1) 返品通知を再登録する必要があり、配達は後で再試行しました。再試行回数とそれらの間の時間間隔は、オフランプゲートウェイ管理者によって構成された機能である場合があります。これは、実装するのに好ましい方法です。ただし、すべての再送信の試行が失敗した場合、ケース2のように処理を続行する必要があります。"
    },
    {
      "indent": 3,
      "text": "2) If the gateway does not have enough capabilities to handle notice re-queuing, but has a log information preservation function, the error information SHOULD be recorded to a log, and processing SHOULD end. At this time, the administrator of the gateway system SHOULD be notified of these errors using a specific method (for example, by an e-mail message).",
      "ja": "2) ゲートウェイに通知の再登録を処理するのに十分な機能がないが、ログ情報保存機能がある場合、エラー情報をログに記録する必要があり、処理は終了する必要があります。現時点では、ゲートウェイシステムの管理者に、特定の方法を使用してこれらのエラーを通知する必要があります（たとえば、電子メールメッセージで）。"
    },
    {
      "indent": 3,
      "text": "3) If the gateway does not even have a log information preservation function, the administrator SHOULD be notified about the failure (for example, via an e-mail message), and processing SHOULD end.",
      "ja": "3) ゲートウェイにログ情報保存機能さえ持っていない場合、管理者に障害について通知される必要があります（たとえば、電子メールメッセージを介して）、処理は終了する必要があります。"
    },
    {
      "indent": 0,
      "text": "2.6. Offramp Gateway Log",
      "section_title": true,
      "ja": "2.6. オフランプゲートウェイログ"
    },
    {
      "indent": 3,
      "text": "An offramp gateway SHOULD have a function that keeps information listed as a log, either specific to the fax gateway or in a log file that exists locally on the gateway or remotely. If the fax gateway or the remote system are equipped with recording media, the log information SHOULD be saved as a log file. As a last resort, if no recording media are available, the log MAY be printed.",
      "ja": "Offramp Gatewayには、FAXゲートウェイに固有のログとして、またはゲートウェイにローカルに存在するログファイルまたはリモートでログとしてリストされた情報を保持する関数が必要です。FAXゲートウェイまたはリモートシステムに録音メディアが装備されている場合、ログ情報はログファイルとして保存する必要があります。最後の手段として、録音メディアが利用できない場合、ログを印刷することができます。"
    },
    {
      "indent": 3,
      "text": "The information listed in the log MAY be the following:",
      "ja": "ログに記載されている情報は、次のとおりです。"
    },
    {
      "indent": 3,
      "text": "- Date and time when the Internet Fax is received - Sender address - Recipient address(es) - Start date and time of transmission over GSTN - End date and time of transmission over GSTN - Number of actually transmitted pages - Number of actually transmitted bytes - Fax resolution used - Error codes/text that occurred during transmission - Number of transmission attempts (retries) - Date and time of transmission of the (eventual) delivery notice",
      "ja": "- インターネットFAXを受信した日時 - 送信者アドレス - 受信者アドレス（ES） -  GSTN上の送信の開始日時 -  GSTN上の送信の終了日と時間 - 実際に送信されたページの数 - 実際に送信されたバイトの数 - ファックス使用される解像度 - 送信中に発生したエラーコード/テキスト - 送信試行回数（取得） - （最終的な）配信通知の送信の日付と時刻"
    },
    {
      "indent": 0,
      "text": "3. Optional Services for an Onramp Gateway",
      "section_title": true,
      "ja": "3. Onrampゲートウェイのオプションサービス"
    },
    {
      "indent": 0,
      "text": "3.1. Examples of User Authorization",
      "section_title": true,
      "ja": "3.1. ユーザー承認の例"
    },
    {
      "indent": 3,
      "text": "An onramp gateway MAY have a user authorization function to confirm that the user is authorized to transmit a facsimile into the Internet fax service. For example, user authorization may be accomplished by getting a user ID and password received by DTMF, or via a local authorization table based on the GSTN caller-ID. The following subsections give some possible examples, but other methods are also possible.",
      "ja": "Onramp Gatewayには、ユーザーがファクシミリをインターネットFAXサービスに送信することを許可されていることを確認するユーザー認証機能を持つ場合があります。たとえば、ユーザーの承認は、DTMFが受信したユーザーIDとパスワードを取得するか、GSTN Caller-IDに基づいたローカル認証テーブルを介して実行される場合があります。次のサブセクションはいくつかの例を挙げていますが、他の方法も可能です。"
    },
    {
      "indent": 0,
      "text": "3.1.1. Authorization via GSTN Caller-ID",
      "section_title": true,
      "ja": "3.1.1. GSTN Caller-IDによる承認"
    },
    {
      "indent": 3,
      "text": "The most simple method to authenticate and authorize a GSTN fax service user is to use the GSTN caller-ID. If available, in fact, the caller-ID is generated by the GSTN network service itself, and it is quite difficult to produce fake caller-IDs. In other words, the security related to this authentication method relies on the confidence that the GSTN caller-ID service is secure by itself.",
      "ja": "GSTN FAXサービスユーザーを認証および承認する最も簡単な方法は、GSTN Caller-IDを使用することです。実際、利用可能な場合、発信者-IDはGSTNネットワークサービス自体によって生成され、偽の発信者IDを作成することは非常に困難です。言い換えれば、この認証方法に関連するセキュリティは、GSTN Caller-IDサービスがそれ自体で安全であるという自信に依存しています。"
    },
    {
      "indent": 3,
      "text": "The GSTN sender MAY be authorized via a lookup into a table managed by the onramp gateway administrator, via complete or partial (wildcard) matches.",
      "ja": "GSTN送信者は、Onramp Gateway管理者が管理するテーブルを検索して、完全または部分的な（ワイルドカード）マッチを介して許可される場合があります。"
    },
    {
      "indent": 0,
      "text": "3.1.2. Authorization via GSTN Fax \"Station ID\"",
      "section_title": true,
      "ja": "3.1.2. GSTN FAX「ステーションID」を介した承認"
    },
    {
      "indent": 3,
      "text": "During the initial GSTN fax service negotiation, the sender fax can send various information to the onramp gateway, including the \"station ID\" alphanumeric string. This string MAY be used to transmit authentication and authorization information for subsequent lookup by the onramp gateway. Thus, user ID and an eventual password MAY be sent inside this string.",
      "ja": "最初のGSTN FAXサービスの交渉中、送信者FAXは、「ステーションID」英数字文字列を含むOnrampゲートウェイにさまざまな情報を送信できます。この文字列は、Onrampゲートウェイでその後の検索のために認証と承認情報を送信するために使用できます。したがって、ユーザーIDと最終的なパスワードは、この文字列内に送信される場合があります。"
    },
    {
      "indent": 3,
      "text": "However, if used as the only authentication, this method is much less secure than the caller-ID one because the user of the calling GSTN station can decide which string to send, and the string travels in clear form over the GSTN. Given this security warning, this method allows more flexibility to the GSTN user: in fact, it is not tied to a single GSTN fax terminal, and authorization can be obtained from anywhere, provided the sender has the possibility to configure the \"station ID\" on the device being used.",
      "ja": "ただし、唯一の認証として使用される場合、呼び出しGSTNステーションのユーザーが送信する文字列を決定できるため、このメソッドは発信者IDよりもはるかに安全性が低くなり、文字列はGSTN上で明確な形で移動できます。このセキュリティの警告を考慮して、この方法によりGSTNユーザーにより柔軟性が可能になります。実際、Senderが「ステーションID」を構成する可能性がある場合、どこからでも承認を取得できず、承認はどこからでも取得できます。使用されているデバイスで。"
    },
    {
      "indent": 3,
      "text": "A combination of caller-ID and station ID checks MAY, on the other hand, result in a greatly improved level of security.",
      "ja": "一方、Caller-IDとステーションIDのチェックの組み合わせにより、セキュリティのレベルが大幅に改善される場合があります。"
    },
    {
      "indent": 0,
      "text": "3.1.3. Authorization via DTMF",
      "section_title": true,
      "ja": "3.1.3. DTMFによる承認"
    },
    {
      "indent": 3,
      "text": "An onramp gateway MAY implement the Authorization function by requesting that a user ID and password information are sent over GSTN via DTMF. For example, this function MAY be accomplished by requesting that the DTMF information is sent immediately after the connection over GSTN is established, before starting the GSTN fax negotiation; but other methods are also possible.",
      "ja": "Onramp Gatewayは、ユーザーIDとパスワード情報がDTMFを介してGSTNを介して送信されるように要求することにより、承認関数を実装する場合があります。たとえば、この関数は、GSTN FAXの交渉を開始する前に、GSTNを介した接続が確立された直後にDTMF情報が送信されるように要求することで実現できます。しかし、他の方法も可能です。"
    },
    {
      "indent": 0,
      "text": "3.2. Onramp Gateway Log",
      "section_title": true,
      "ja": "3.2. ONRAMPゲートウェイログ"
    },
    {
      "indent": 3,
      "text": "An onramp gateway SHOULD have a function that keeps information listed as a log, either specific to the fax gateway or in a log file that exists locally on the gateway or remotely. If the fax gateway or the remote system are equipped with recording media, the log information SHOULD be saved as a log file. As a last resort, if no recording media are available, the log MAY be printed.",
      "ja": "Onrampゲートウェイには、FAXゲートウェイに固有のログとして、またはゲートウェイにローカルに存在するログファイルまたはリモートで情報をログとしてリストする機能が必要です。FAXゲートウェイまたはリモートシステムに録音メディアが装備されている場合、ログ情報はログファイルとして保存する必要があります。最後の手段として、録音メディアが利用できない場合、ログを印刷することができます。"
    },
    {
      "indent": 3,
      "text": "The information listed in the log MAY be the following:",
      "ja": "ログに記載されている情報は、次のとおりです。"
    },
    {
      "indent": 3,
      "text": "- Start date and time of transmission from GSTN - End date and time of transmission from GSTN - Number of actually received pages - Number of actually received bytes - Fax resolution used - Sender address (if available) - Recipient address(es) - Date and time when the Internet Fax is sent - Error codes/text that occurred during Internet Fax transmission - Number of transmission attempts (retries) - Date and time of transmission of the (eventual) delivery notice",
      "ja": "- GSTNからの送信の開始日 -  GSTNからの送信の終了日 - 実際に受け取ったページの数 - 実際に受け取ったバイトの数 - ファックス解像度使用 - 送信者アドレス（利用可能な場合） - 受信者アドレス - 日付と時刻インターネットファックスが送信されるとき - インターネットファックス伝送中に発生したエラーコード/テキスト - 送信試行回数（取得） - （最終的な）配信通知の送信の日付と時刻"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "Refer to Section 3.1 (\"User Authorization\") for authentication for an onramp gateway. In particular, sending user IDs and passwords in clear, as described in Section 3.1.2, can pose high security risks, and thus is NOT RECOMMENDED.",
      "ja": "Onrampゲートウェイの認証については、セクション3.1（「ユーザー認証」）を参照してください。特に、セクション3.1.2で説明されているように、ユーザーIDとパスワードをクリアに送信すると、高いセキュリティリスクをもたらす可能性があるため、推奨されません。"
    },
    {
      "indent": 3,
      "text": "S/MIME [2][11][12][13][14] and OpenPGP [3][10] can also be used to encrypt an Internet Fax message. A signed or encrypted message is protected while transported along the network; however, when a message reaches an Internet Fax Gateway, either onramp or offramp, this kind of protection cannot be applied anymore. In this situation, security must rely on trusted operations of the gateway itself. A gateway might have its own certificate/key to improve security operations when sending Internet Faxes, but, as with any gateway, it breaks the end-to-end security pattern of both S/MIME and OpenPGP.",
      "ja": "S/MIME [2] [11] [12] [13] [14]およびOpenPGP [3] [10]を使用して、インターネットFAXメッセージを暗号化することもできます。ネットワークに沿って輸送されている間、署名または暗号化されたメッセージが保護されています。ただし、メッセージがオンランプまたはオフランプのいずれかのインターネットFAXゲートウェイに到達すると、この種の保護はもはや適用できません。この状況では、セキュリティはゲートウェイ自体の信頼できる運用に依存する必要があります。ゲートウェイには、インターネットファックスを送信するときにセキュリティ操作を改善するための独自の証明書/キーがある場合がありますが、Gatewayと同様に、S/MIMEとOpenPGPの両方のエンドツーエンドセキュリティパターンを破ります。"
    },
    {
      "indent": 3,
      "text": "Other security mechanisms, like IPsec [4][5][6][7][8] or TLS [9] also do not ensure a secure gateway operation.",
      "ja": "IPSEC [4] [5] [6] [7] [8]やTLS [9]のような他のセキュリティメカニズムは、安全なゲートウェイ操作を保証しません。"
    },
    {
      "indent": 3,
      "text": "Denial-of-service attacks are beyond the scope of this document. Host compromise caused by flaws in the implementation is beyond the scope of this document.",
      "ja": "サービス拒否攻撃は、このドキュメントの範囲を超えています。実装の欠陥によって引き起こされるホストの妥協は、このドキュメントの範囲を超えています。"
    },
    {
      "indent": 0,
      "text": "5. Acknowledgments",
      "section_title": true,
      "ja": "5. 謝辞"
    },
    {
      "indent": 3,
      "text": "Thanks to Claudio Allocchio (Consortium GARR, Italy) for its final review of this document, and for contributing the authorization and security sections of this document.",
      "ja": "この文書の最終レビューと、この文書の承認とセキュリティセクションを提供してくれたClaudio Allocchio（イタリアのコンソーシアムガー）に感謝します。"
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "ja": "6. 参考文献"
    },
    {
      "indent": 0,
      "text": "6.1. Informative References",
      "section_title": true,
      "ja": "6.1. 参考引用"
    },
    {
      "indent": 3,
      "text": "[1] Masinter, L., \"Terminology and Goals for Internet Fax\", RFC 2542, March 1999.",
      "ja": "[1] Masinter、L。、「インターネットファックスの用語と目標」、RFC 2542、1999年3月。"
    },
    {
      "indent": 3,
      "text": "[2] Housley, R., \"Cryptographic Message Syntax (CMS)\", RFC 3852, July 2004.",
      "ja": "[2] Housley、R。、「暗号化メッセージ構文（CMS）」、RFC 3852、2004年7月。"
    },
    {
      "indent": 3,
      "text": "[3] Callas, J., Donnerhacke, L., Finney, H., and R. Thayer, \"OpenPGP Message Format\", RFC 2440, November 1998.",
      "ja": "[3] Callas、J.、Donnerhacke、L.、Finney、H。、およびR. Thayer、「OpenPGPメッセージ形式」、RFC 2440、1998年11月。"
    },
    {
      "indent": 3,
      "text": "[4] Kent, S. and R. Atkinson, \"Security Architecture for the Internet Protocol\", RFC 2401, November 1998.",
      "ja": "[4] Kent、S。およびR. Atkinson、「インターネットプロトコルのセキュリティアーキテクチャ」、RFC 2401、1998年11月。"
    },
    {
      "indent": 3,
      "text": "[5] Kent, S. and R. Atkinson, \"IP Authentication Header\", RFC 2402, November 1998.",
      "ja": "[5] Kent、S。およびR. Atkinson、「IP Authentication Header」、RFC 2402、1998年11月。"
    },
    {
      "indent": 3,
      "text": "[6] Ramakrishnan, K., Floyd, S., and D. Black, \"The Addition of Explicit Congestion Notification (ECN) to IP\", RFC 3168, September 2001.",
      "ja": "[6] Ramakrishnan、K.、Floyd、S。、およびD. Black、「IPへの明示的な混雑通知（ECN）の追加」、RFC 3168、2001年9月。"
    },
    {
      "indent": 3,
      "text": "[7] Piper, D., \"The Internet IP Security Domain of Interpretation for ISAKMP\", RFC 2407, November 1998.",
      "ja": "[7] Piper、D。、「ISAKMPの解釈のインターネットIPセキュリティドメイン」、RFC 2407、1998年11月。"
    },
    {
      "indent": 3,
      "text": "[8] Thayer, R., Doraswamy, N., and R. Glenn, \"IP Security Document Roadmap\", RFC 2411, November 1998.",
      "ja": "[8] Thayer、R.、Doraswamy、N。、およびR. Glenn、「IP Security Document Roadmap」、RFC 2411、1998年11月。"
    },
    {
      "indent": 3,
      "text": "[9] Blake-Wilson, S., Nystrom, M., Hopwood, D., Mikkelsen, J., and T. Wright, \"Transport Layer Security (TLS) Extensions\", RFC 3546, June 2003.",
      "ja": "[9] Blake-Wilson、S.、Nystrom、M.、Hopwood、D.、Mikkelsen、J。、およびT. Wright、「Transport Layer Security（TLS）Extensions」、RFC 3546、2003年6月。"
    },
    {
      "indent": 3,
      "text": "[10] Elkins, M., Del Torto, D., Levien, R., and T. Roessler, \"MIME Security with OpenPGP\", RFC 3156, August 2001.",
      "ja": "[10] Elkins、M.、Del Torto、D.、Levien、R。、およびT. Roessler、「OpenPGPのMIMEセキュリティ」、RFC 3156、2001年8月。"
    },
    {
      "indent": 3,
      "text": "[11] Rescorla, E., \"Diffie-Hellman Key Agreement Method\", RFC 2631, June 1999.",
      "ja": "[11] Rescorla、E。、「Diffie-Hellman Key Asmational Method」、RFC 2631、1999年6月。"
    },
    {
      "indent": 3,
      "text": "[12] Ramsdell, B., \"Secure/Multipurpose Internet Mail Extensions (S/MIME) Version 3.1 Certificate Handling\", RFC 3850, July 2004.",
      "ja": "[12] Ramsdell、B。、「セキュア/多目的インターネットメール拡張機能（S/MIME）バージョン3.1証明書処理」、RFC 3850、2004年7月。"
    },
    {
      "indent": 3,
      "text": "[13] Ramsdell, B., \"Secure/Multipurpose Internet Mail Extensions (S/MIME) Version 3.1 Message Specification\", RFC 3851, July 2004.",
      "ja": "[13] Ramsdell、B。、「Secure/Multipurpose Internet Mail拡張機能（S/MIME）バージョン3.1メッセージ仕様」、RFC 3851、2004年7月。"
    },
    {
      "indent": 3,
      "text": "[14] Hoffman, P., \"Enhanced Security Services for S/MIME\", RFC 2634, June 1999.",
      "ja": "[14] Hoffman、P。、「S/MIMEの強化されたセキュリティサービス」、RFC 2634、1999年6月。"
    },
    {
      "indent": 0,
      "text": "6.2. Normative References",
      "section_title": true,
      "ja": "6.2. 引用文献"
    },
    {
      "indent": 3,
      "text": "[15] Mimura, K., Yokoyama, K., Satoh, T., Kanaide, C., and C. Allocchio, \"Internet Fax Gateway Requirements\", RFC 4160, August 2005.",
      "ja": "[15] Mimura、K.、Yokoyama、K.、Satoh、T.、Kanaide、C。、およびC. Allocchio、「インターネットファックスゲートウェイ要件」、RFC 4160、2005年8月。"
    },
    {
      "indent": 3,
      "text": "[16] Toyoda, K., Ohno, H., Murai, J., and D. Wing, \"A Simple Mode of Facsimile Using Internet Mail\", RFC 3965, December 2004.",
      "ja": "[16] Toyoda、K.、Ohno、H.、Murai、J。、およびD. Wing、「インターネットメールを使用したファクシミリの単純なモード」、RFC 3965、2004年12月。"
    },
    {
      "indent": 3,
      "text": "[17] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[17] Bradner、S。、「要件レベルを示すためにRFCで使用するためのキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[18] \"Procedures for real-time Group 3 facsimile communication over IP networks\", ITU-T Recommendation T.38, June 1998.",
      "ja": "[18] 「IPネットワークを介したリアルタイムグループ3ファクシミリ通信の手順」、ITU-T推奨T.38、1998年6月。"
    },
    {
      "indent": 3,
      "text": "[19] Klensin, J., \"Simple Mail Transfer Protocol\", RFC 2821, April 2001.",
      "ja": "[19] Klensin、J。、「Simple Mail Transfer Protocol」、RFC 2821、2001年4月。"
    },
    {
      "indent": 3,
      "text": "[20] Resnick, P., \"Internet Message Format\", RFC 2822, April 2001.",
      "ja": "[20] Resnick、P。、「インターネットメッセージフォーマット」、RFC 2822、2001年4月。"
    },
    {
      "indent": 3,
      "text": "[21] Myers, J. and M. Rose, \"Post Office Protocol - Version 3\", STD 53, RFC 1939, May 1996.",
      "ja": "[21] Myers、J。およびM. Rose、「郵便局プロトコル - バージョン3」、STD 53、RFC 1939、1996年5月。"
    },
    {
      "indent": 3,
      "text": "[22] Crispin, M., \"Internet Message Access Protocol - Version 4rev1\", RFC 3501, March 2003.",
      "ja": "[22] Crispin、M。、「インターネットメッセージアクセスプロトコル -バージョン4REV1」、RFC 3501、2003年3月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Katsuhiko Mimura TOYO Communication Equipment CO., LTD. 2-1-1 Koyato, Samukawa-machi, Koza-gun Kanagawa-pref., Japan",
      "ja": "魚島mimura toyo通信機器Co。、Ltd。2-1-1 Koyato、Samukawa-Machi、Koza-Gun Kanagawa-Pref。、日本"
    },
    {
      "indent": 3,
      "text": "Fax: +81 467 74 5743\nEMail: mimu@miyabi-labo.net",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Keiichi Yokoyama TOYO Communication Equipment CO., LTD. 2-1-1 Koyato, Samukawa-machi, Koza-gun Kanagawa-pref., Japan",
      "ja": "横林ya馬toyo通信機器Co。、Ltd。2-1-1 Koyato、Samukawa-Machi、Koza-Gun Kanagawa-Pref。、日本"
    },
    {
      "indent": 3,
      "text": "Fax: +81 467 74 5743\nEMail: keiyoko@msn.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Takahisa Satoh TOYO Communication Equipment CO., LTD. 2-1-1 Koyato, Samukawa-machi, Koza-gun Kanagawa-pref., Japan",
      "ja": "Takahisa Satoh Toyo Communication Equipment Co。、Ltd。2-1-1 Koyato、Samukawa-Machi、Koza-Gun Kanagawa-Pref。、日本"
    },
    {
      "indent": 3,
      "text": "Fax: +81 467 74 5743\nEMail: zsatou@t-ns.co.jp",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Ken Watanabe TOYO Communication Equipment CO., LTD. 2-1-1 Koyato, Samukawa-machi, Koza-gun Kanagawa-pref., Japan",
      "ja": "Ken Watanabe Toyo Communication Equipment Co。、Ltd。2-1-1 Koyato、Samukawa-Machi、Koza-Gun Kanagawa-Pref。、日本"
    },
    {
      "indent": 3,
      "text": "Fax: +81 467 74 5743\nEMail: knabe@ad.cyberhome.ne.jp",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Chie Kanaide TOYO Communication Equipment CO., LTD. 2-1-1 Koyato, Samukawa-machi, Koza-gun Kanagawa-pref., Japan",
      "ja": "Chie Kanaide Toyo Communication Equipment Co。、Ltd。2-1-1 Koyato、Samukawa-Machi、Koza-Gun Kanagawa-Pref。、日本"
    },
    {
      "indent": 3,
      "text": "Fax: +81 467 74 5743\nEMail: icemilk77@yahoo.co.jp",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "ja": "Copyright（c）The Internet Society（2005）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "この文書は、BCP 78に含まれる権利、ライセンス、および制限の対象となり、そこに記載されている場合を除き、著者はすべての権利を保持しています。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "このドキュメントとここに含まれる情報は、「現状のまま」に基づいて提供されています。また、貢献者、彼/彼女が代表する組織（もしあれば）が後援する組織、インターネット協会とインターネット工学タスクフォースは、すべての保証、明示的または明示的、またはすべての保証を否認します。本書の情報の使用が、商品性または特定の目的に対する適合性の権利または黙示的な保証を侵害しないという保証を含むがこれらに限定されないことを含む。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、知的財産権またはその他の権利の有効性または範囲に関して、本書に記載されている技術の実装または使用、またはそのような権利に基づくライセンスに基づくライセンスの範囲に関連すると主張される可能性のある他の権利に関しては、立場を取得しません。利用可能になります。また、そのような権利を特定するために独立した努力をしたことも表明していません。RFCドキュメントの権利に関する手順に関する情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IETF事務局に行われたIPR開示のコピーと、利用可能にするライセンスの保証、またはこの仕様の実装者またはユーザーによるそのような独自の権利の使用のための一般的なライセンスまたは許可を取得しようとする試みの結果を取得できます。http://www.ietf.org/iprのIETFオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、関心のある当事者に、著作権、特許、または特許出願、またはこの基準を実装するために必要な技術をカバーする可能性のあるその他の独自の権利を注意深く招待するよう招待しています。ietf-ipr@ietf.orgのIETFへの情報をお問い合わせください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFCエディター機能の資金は現在、インターネット協会によって提供されています。"
    }
  ]
}