{
  "title": {
    "text": "RFC 4554 - Use of VLANs for IPv4-IPv6 Coexistence in Enterprise Networks",
    "ja": "RFC 4554 - エンタープライズネットワークでのIPv4-IPV6共存のVLANの使用"
  },
  "number": 4554,
  "created_at": "2023-06-24 11:18:01.856764+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                           T. Chown\nRequest for Comments: 4554                     University of Southampton\nCategory: Informational                                        June 2006",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 5,
      "text": "Use of VLANs for IPv4-IPv6 Coexistence in Enterprise Networks",
      "ja": "エンタープライズネットワークでのIPv4-IPV6共存のVLANの使用"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモは、インターネットコミュニティに情報を提供します。いかなる種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2006).",
      "ja": "Copyright（c）The Internet Society（2006）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "Ethernet VLANs are quite commonly used in enterprise networks for the purposes of traffic segregation. This document describes how such VLANs can be readily used to deploy IPv6 networking in an enterprise, which focuses on the scenario of early deployment prior to availability of IPv6-capable switch-router equipment. In this method, IPv6 may be routed in parallel with the existing IPv4 in the enterprise and delivered at Layer 2 via VLAN technology. The IPv6 connectivity to the enterprise may or may not enter the site via the same physical link.",
      "ja": "イーサネットVLANは、トラフィックの分離を目的として、エンタープライズネットワークで非常に一般的に使用されています。このドキュメントでは、そのようなVLANをどのように使用してIPv6ネットワーキングをエンタープライズに展開するために使用できるかについて説明します。これは、IPv6対応のスイッチルーター機器を入手する前に早期展開のシナリオに焦点を当てています。この方法では、IPv6はエンタープライズ内の既存のIPv4と並行してルーティングされ、VLANテクノロジーを介してレイヤー2で配信される場合があります。EnterpriseへのIPv6接続は、同じ物理リンクを介してサイトに入る場合としない場合があります。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . . . 2\n2.  Enabling IPv6 per Link  . . . . . . . . . . . . . . . . . . . . 3\n    2.1.  IPv6 Routing over VLANs . . . . . . . . . . . . . . . . . 3\n    2.2.  One VLAN per Router Interface . . . . . . . . . . . . . . 4\n    2.3.  Collapsed VLANs on a Single Interface . . . . . . . . . . 4\n    2.4.  Congruent IPv4 and IPv6 Subnets . . . . . . . . . . . . . 5\n    2.5.  IPv6 Addressing . . . . . . . . . . . . . . . . . . . . . 5\n    2.6.  Final IPv6 Deployment . . . . . . . . . . . . . . . . . . 5\n3.  Example VLAN Topology . . . . . . . . . . . . . . . . . . . . . 6\n4.  Security Considerations . . . . . . . . . . . . . . . . . . . . 7\n5.  Acknowledgements  . . . . . . . . . . . . . . . . . . . . . . . 7\n6.  Informative References  . . . . . . . . . . . . . . . . . . . . 7\nAppendix A.  Configuration Example  . . . . . . . . . . . . . . . . 8",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "Ethernet VLANs are quite commonly used in enterprise networks for the purposes of traffic segregation. This document describes how such VLANs can be readily used to deploy IPv6 networking in an enterprise, including the scenario of early deployment prior to availability of IPv6-capable switch-router equipment, where IPv6 may be routed in parallel with the existing IPv4 in the enterprise and delivered to the desired LANs via VLAN technology.",
      "ja": "イーサネットVLANは、トラフィックの分離を目的として、エンタープライズネットワークで非常に一般的に使用されています。このドキュメントでは、IPv6対応のスイッチルーター機器が利用可能になる前の早期展開のシナリオなど、そのようなVLANをEnterpriseでIPv6ネットワーキングを展開するために容易に使用できる方法について説明します。VLANテクノロジーを介して目的のLANに配信されます。"
    },
    {
      "indent": 3,
      "text": "It is expected that in the long run, sites migrating to dual-stack networking will either upgrade existing switch-router equipment to support IPv6 or procure new equipment that supports IPv6. If a site already has production routers deployed that support IPv6, the procedures described in this document are not required. In the interim, however, a method is required for early IPv6 adopters that enables IPv6 to be deployed in a structured, managed way to some or all of an enterprise network that currently lacks IPv6 support in its core infrastructure.",
      "ja": "長期的には、デュアルスタックネットワーキングに移行するサイトは、既存のスイッチルーター機器をアップグレードしてIPv6をサポートするか、IPv6をサポートする新しい機器を調達することが期待されています。サイトにIPv6をサポートする生産ルーターが既に展開されている場合、このドキュメントで説明されている手順は必要ありません。ただし、中間では、IPv6をコアインフラストラクチャに現在IPv6サポートを欠いているエンタープライズネットワークの一部またはすべてに展開できるようにする初期のIPv6アダプターには、メソッドが必要です。"
    },
    {
      "indent": 3,
      "text": "The IEEE 802.1Q VLAN standard allows separate LANs to be deployed over a single bridged LAN, by inserting \"Virtual LAN\" tagging or membership information into Ethernet frames. Hosts and switches that support VLANs effectively allow software-based reconfiguration of LANs through configuration of the tagging parameters. The software control means that VLANs can be used to alter the LAN infrastructure without having to physically alter the wiring between the LAN segments and Layer 3 routers.",
      "ja": "IEEE 802.1Q VLAN標準では、「仮想LAN」タグ付けまたはメンバーシップ情報をイーサネットフレームに挿入することにより、単一のブリッジ付きLAN上に個別のLANを展開できます。VLANをサポートするホストとスイッチは、タグ付けパラメーターの構成を通じてLANのソフトウェアベースの再構成を効果的に可能にします。ソフトウェア制御は、LANセグメントとレイヤー3ルーター間の配線を物理的に変更することなく、VLANを使用してLANインフラストラクチャを変更できることを意味します。"
    },
    {
      "indent": 3,
      "text": "Many IPv4 enterprise networks are utilising VLAN technology. Where a site does not have IPv6-capable Layer 2/3 switch-router equipment, but VLANs are supported, a simple yet effective method exists to gradually introduce IPv6 to some or all of that site's network, in advance of the site's core infrastructure having dual-stack capability.",
      "ja": "多くのIPv4エンタープライズネットワークは、VLANテクノロジーを利用しています。サイトにIPv6対応レイヤー2/3スイッチルーター機器がないが、VLANがサポートされている場合、サイトのコアインフラストラクチャの前にIPv6をそのサイトのネットワークの一部またはすべてに徐々に導入するためのシンプルで効果的な方法が存在します。デュアルスタック機能。"
    },
    {
      "indent": 3,
      "text": "If such a site wishes to introduce IPv6, it may do so by deploying a parallel IPv6 routing infrastructure (which is likely to be a different platform to the site's main infrastructure equipment, i.e., one that supports IPv6 where the existing equipment does not), and then using VLAN technology to \"overlay\" IPv6 links onto existing IPv4 links. This can be achieved without needing any changes to the IPv4 configuration. The VLANs don't need to differentiate between IPv4 and IPv6; the deployment is just dual-stack, as Ethernet is without VLANs.",
      "ja": "そのようなサイトがIPv6を導入したい場合、並列IPv6ルーティングインフラストラクチャ（サイトの主要なインフラストラクチャ機器とは異なるプラットフォームである可能性が高い、つまり既存の機器がそうでない場合はIPv6をサポートしているプラットフォーム）を展開することにより、そうすることができます。次に、VLANテクノロジーを使用して、既存のIPv4リンクにIPv6リンクを「オーバーレイ」します。これは、IPv4構成の変更を必要とせずに実現できます。VLANは、IPv4とIPv6を区別する必要はありません。イーサネットにはVLANがないため、展開は単なるデュアルスタックです。"
    },
    {
      "indent": 3,
      "text": "The IPv4 default route to the VLAN is provided by one (IPv4) router, while the IPv6 default route to the VLAN is provided by a different (IPv6) router. The IPv6 router can provide native IPv6 connectivity to the whole site with just a single physical interface, thanks to VLAN tagging and trunking, as described below.",
      "ja": "VLANへのIPv4デフォルトルートは1つの（IPv4）ルーターによって提供され、VLANへのIPv6デフォルトルートは別の（IPv6）ルーターによって提供されます。IPv6ルーターは、以下で説明するように、VLANのタグ付けとトランキングのおかげで、単一の物理インターフェイスを使用して、サイト全体にネイティブIPv6接続を提供できます。"
    },
    {
      "indent": 3,
      "text": "The IPv6 connectivity to the enterprise may or may not enter the site via the same physical link as the IPv4 traffic, and may be native or tunneled from the external provider to the IPv6 routing equipment.",
      "ja": "IPv6エンタープライズへの接続は、IPv4トラフィックと同じ物理リンクを介してサイトに入る場合とそうでない場合があり、外部プロバイダーからIPv6ルーティング機器にネイティブまたはトンネルを貼っている場合があります。"
    },
    {
      "indent": 3,
      "text": "This VLAN usage is a solution adopted by a number of sites already, including that of the author.",
      "ja": "このVLANの使用法は、著者の使用を含め、すでに多くのサイトで採用されているソリューションです。"
    },
    {
      "indent": 3,
      "text": "It should be noted that a parallel infrastructure will require additional infrastructure and thus cost, and will often require a separate link into the site (from an IPv6 provider), quite possibly tunneled, that will require the site's security policy to be applied (e.g., firewalling and intrusion detection). For sites that believe early adoption of IPv6 is important, that price is one they may be quite willing to pay. However, this document focuses on the technical issues of VLAN usage in such a scenario.",
      "ja": "並列インフラストラクチャには追加のインフラストラクチャが必要であり、したがってコストが必要になるため、サイトのセキュリティポリシーを適用する必要がある（たとえば、おそらくトンレリングされている可能性のあるサイトへの別のリンクが必要になることに注意してください（例えば、ファイアウォールおよび侵入検出）。IPv6の早期採用が重要であると信じているサイトにとって、その価格は彼らが非常に喜んで支払うものです。ただし、このドキュメントは、このようなシナリオでのVLAN使用の技術的な問題に焦点を当てています。"
    },
    {
      "indent": 0,
      "text": "2. Enabling IPv6 per Link",
      "section_title": true,
      "ja": "2. リンクごとにIPv6を有効にします"
    },
    {
      "indent": 3,
      "text": "The precise method by which IPv6 would be \"injected\" into the existing IPv4 network is deployment specific. For example, perhaps a site has an IPv4-only router, connected to an Ethernet switch that supports VLANs and a number of hosts connected to that VLAN. Let's further assume that the site has a dozen of these setups that it wishes to IPv6-enable immediately. This could be done by upgrading the twelve routers to support IPv6, and turning IPv6 on those routers. However, this may not be practical for various reasons.",
      "ja": "IPv6が既存のIPv4ネットワークに「注入」される正確な方法は、展開固有です。たとえば、おそらくサイトには、VLANとそのVLANに接続された多くのホストをサポートするイーサネットスイッチに接続されたIPv4のみのルーターがあります。さらに、サイトには、すぐにIPv6に有効になりたいと思うこれらのセットアップの数十があると仮定しましょう。これは、12のルーターをアップグレードしてIPv6をサポートし、それらのルーターでIPv6を回すことで実行できます。ただし、これはさまざまな理由で実用的ではない場合があります。"
    },
    {
      "indent": 3,
      "text": "The simplest approach would be to connect an IPv6 router with one interface to an Ethernet switch, and connect that switch to other switches, and then use VLAN tags between the switches and the IPv6 router to \"reach\" all the IPv4-only subnets from the IPv6 router. Thus, the general principle is that the IPv6 router device (e.g., performing IPv6 Router Advertisements [1] in the case of stateless autoconfiguration) is connected to the target link through the use of VLAN-capable Layer 2 equipment.",
      "ja": "最も単純なアプローチは、IPv6ルーターを1つのインターフェイスでイーサネットスイッチに接続し、そのスイッチを他のスイッチに接続し、スイッチとIPv6ルーターの間でVLANタグを使用して、すべてのIPv4のみのサブネットに「到達」することです。IPv6ルーター。したがって、一般的な原則は、IPv6ルーターデバイス（たとえば、Stateless Autoconfigurationの場合にIPv6ルーター広告[1]を実行する[1]）が、VLAN対応レイヤー2機器を使用してターゲットリンクに接続されることです。"
    },
    {
      "indent": 0,
      "text": "2.1. IPv6 Routing over VLANs",
      "section_title": true,
      "ja": "2.1. VLAN上のIPv6ルーティング"
    },
    {
      "indent": 3,
      "text": "In a typical scenario where connectivity is to be offered to a number of existing IPv6 internal subnets, one IPv6 router could be deployed, with both an external interface and one or more internal interfaces. The external interface connects to the wider IPv6 internet, and may be dual-stack if some tunnel mechanism is used for external connectivity, or IPv6-only if a native external connection is available.",
      "ja": "接続性が多数の既存のIPv6内部サブネットに提供される典型的なシナリオでは、外部インターフェイスと1つ以上の内部インターフェイスの両方を備えた1つのIPv6ルーターを展開できます。外部インターフェイスは、より広いIPv6インターネットに接続し、外部接続にトンネルメカニズムが使用される場合はデュアルスタックになる場合があります。"
    },
    {
      "indent": 3,
      "text": "The internal interface(s) can be connected directly to a VLAN-capable switch. It is then possible to write VLAN tags on the packets sent from the internal router interface based on the target IPv6 link prefix. The VLAN-tagged traffic is then transported across the internal VLAN-capable site infrastructure to the target IPv6 links (which may be dispersed widely across the site network).",
      "ja": "内部インターフェイスは、VLAN対応スイッチに直接接続できます。その後、ターゲットIPv6リンクのプレフィックスに基づいて、内部ルーターインターフェイスから送信されたパケットにVLANタグを書き込むことができます。VLANタグ付きトラフィックは、内部VLAN対応サイトインフラストラクチャを介してターゲットIPv6リンクに輸送されます（サイトネットワーク全体に広く分散される場合があります）。"
    },
    {
      "indent": 3,
      "text": "Where the IPv6 router is unable to VLAN-tag the packets, a protocol-based VLAN can be created on the VLAN-capable device connected to the IPv6 router, causing IPv6 traffic to be tagged and then redistributed on (congruent) IPv4 subnet links that lie in the same VLAN.",
      "ja": "IPv6ルーターがパケットをVLANタグできない場合、IPv6ルーターに接続されたVLAN対応デバイスにプロトコルベースのVLANを作成し、IPv6トラフィックをタグ付けし、（合同）IPv4サブネットリンクで再配布します。同じVLANに横たわっています。"
    },
    {
      "indent": 0,
      "text": "2.2. One VLAN per Router Interface",
      "section_title": true,
      "ja": "2.2. ルーターインターフェイスごとに1つのVLAN"
    },
    {
      "indent": 3,
      "text": "The VLAN marking may be done in different ways. Some sites may prefer to use one router interface per VLAN; for example, if there are three internal IPv6 links, a standard PC-based IPv6 router with four Ethernet ports could be used, one for the external link and three for the internal links. In such a case, one switch port would be needed per link, to receive the connectivity from each router port.",
      "ja": "VLANマーキングは、さまざまな方法で行うことができます。一部のサイトでは、VLANごとに1つのルーターインターフェイスを使用することを好む場合があります。たとえば、3つの内部IPv6リンクがある場合、4つのイーサネットポートを備えた標準のPCベースのIPv6ルーターを使用できます。1つは外部リンクに、3つは内部リンクに3つ使用できます。このような場合、各ルーターポートから接続を受信するために、リンクごとに1つのスイッチポートが必要になります。"
    },
    {
      "indent": 3,
      "text": "In such a deployment, the IPv6 routing could be cascaded through lower-tier internal IPv6-only routers. Here, the internal-facing ports on the IPv6 edge router may feed other IPv6 routers over IPv6- only links, which in turn inject the IPv6 connectivity (the stub links using 64-bit subnet prefixes and associated Router Advertisements) into the VLANs.",
      "ja": "このような展開では、IPv6ルーティングは、低層の内部IPv6のみのルーターを介してカスケードできます。ここでは、IPv6エッジルーターの内部向上ポートは、IPv6-のみのリンクを介して他のIPv6ルーターを供給し、IPv6接続（64ビットサブネットプレフィックスと関連するルーター広告を使用してスタブリンク）をVLANSに注入できます。"
    },
    {
      "indent": 0,
      "text": "2.3. Collapsed VLANs on a Single Interface",
      "section_title": true,
      "ja": "2.3. 単一のインターフェイスでVLANを崩壊させました"
    },
    {
      "indent": 3,
      "text": "Using multiple IPv6 routers and one port per IPv6 link (i.e., VLAN) may be unnecessary. Many devices now support VLAN tagging based on virtual interfaces such that multiple IPv6 VLANs could be assigned (trunked) from one physical router interface port. Thus, it is possible to use just one router interface for \"aggregated\" VLAN trunking from a switch. This is a far more interesting case for a site planning the introduction of IPv6 to (part of) its site network.",
      "ja": "複数のIPv6ルーターとIPv6リンクごとに1つのポート（つまり、VLAN）を使用するのは不要です。多くのデバイスは、1つの物理ルーターインターフェイスポートから複数のIPv6 VLANを割り当てる（トランク）できるように、仮想インターフェイスに基づくVLANタグ付けをサポートしています。したがって、スイッチから「集計された」VLANトランキングに1つのルーターインターフェイスのみを使用することができます。これは、IPv6のサイトネットワークの導入を計画しているサイトにとってはるかに興味深いケースです。"
    },
    {
      "indent": 3,
      "text": "This approach is viable while the IPv6 traffic load is light. As traffic volume grows, the single collapsed interface could be extended to utilise two or more physical ports, where the capacity of the IPv6 router device allows it.",
      "ja": "このアプローチは実行可能ですが、IPv6トラフィックの負荷は軽いです。交通量が増えると、単一の崩壊したインターフェイスを拡張して、IPv6ルーターデバイスの容量が許可されている2つ以上の物理ポートを利用するために拡張できます。"
    },
    {
      "indent": 0,
      "text": "2.4. Congruent IPv4 and IPv6 Subnets",
      "section_title": true,
      "ja": "2.4. 合同IPv4およびIPv6サブネット"
    },
    {
      "indent": 3,
      "text": "Such a VLAN-based technique can be used to deploy IPv6-only VLANs in an enterprise network. However, most enterprises will be interested in dual-stack IPv4-IPv6 networking.",
      "ja": "このようなVLANベースの手法は、IPv6のみのVLANをエンタープライズネットワークに展開するために使用できます。ただし、ほとんどの企業は、デュアルスタックIPv4-IPV6ネットワークに関心があります。"
    },
    {
      "indent": 3,
      "text": "In such a case, the IPv6 connectivity may be injected into the existing IPv4 VLANs, such that the IPv4 and IPv6 subnets are congruent (i.e., they coincide exactly when superimposed). Such a method may have desirable administrative properties; for example, the devices in each IPv4 subnet will be in the same IPv6 subnets also. This is the method used at the author's site.",
      "ja": "そのような場合、IPv6接続は既存のIPv4 VLANに注入される可能性があり、IPv4およびIPv6サブネットが合同であるように（つまり、重ね合わせたときに正確に一致します）。このような方法には、望ましい管理特性があるかもしれません。たとえば、各IPv4サブネットのデバイスは同じIPv6サブネットにも含まれます。これは、著者のサイトで使用される方法です。"
    },
    {
      "indent": 3,
      "text": "Furthermore, IPv6-only devices may be gradually added into the subnet without any need to resize the IPv6 subnet (which may hold in effect an infinite number of hosts in a /64 in contrast to IPv4 where the subnet size is often relatively limited, or kept to a minimum possibly due to address space usage concerns). The lack of requirement to periodically resize an IPv6 subnet is a useful administrative advantage for IPv6.",
      "ja": "さらに、IPv6のみのデバイスは、IPv6サブネットをサイズ変更する必要なく、サブネットに徐々に追加される可能性があります（実際には、サブネットサイズが比較的限られている場合、またはサブネットサイズがしばしば限られている場合、またはA /64の無限のホストを保持する場合があります。スペース使用の懸念に対処するために、おそらく最小限に抑えられています）。IPv6サブネットを定期的にサイズ変更するための要件の欠如は、IPv6にとって有用な管理上の利点です。"
    },
    {
      "indent": 0,
      "text": "2.5. IPv6 Addressing",
      "section_title": true,
      "ja": "2.5. IPv6アドレス指定"
    },
    {
      "indent": 3,
      "text": "One site using this VLAN technique has chosen to number its IPv6 links with the format [Site IPv6 prefix]:[VLAN ID]::/64. The VLAN tag is 16 bits, so this can work with a typical maximum 48-bit site prefix. Linking the VLAN ID into a site's addressing scheme may not fit topology and aggregation, and thus is not necessarily a recommended addressing plan, but some sites may wish to consider its usage.",
      "ja": "このVLAN手法を使用している1つのサイトは、[サイトIPv6プレフィックス]：[VLAN ID] ::/64でIPv6リンクを番号にすることを選択しました。VLANタグは16ビットなので、これは一般的な最大48ビットサイトプレフィックスで動作できます。VLAN IDをサイトのアドレス指定スキームにリンクすることは、トポロジーや集約に適合しない可能性があるため、必ずしも推奨されるアドレス指定計画ではありませんが、一部のサイトではその使用を検討したい場合があります。"
    },
    {
      "indent": 0,
      "text": "2.6. Final IPv6 Deployment",
      "section_title": true,
      "ja": "2.6. 最終的なIPv6展開"
    },
    {
      "indent": 3,
      "text": "The VLAN technique for IPv6 deployment offers a more structured alternative to opportunistic per-host intra-site tunnelling methods such as Intra-Site Automatic Tunnel Addressing Protocol ISATAP [2]. It has the ability to offer a simple yet efficient method for early IPv6 deployment to an enterprise site.",
      "ja": "IPv6展開用のVLAN手法は、敷地内の自動トンネルアドレス指定プロトコルISATAPなどの日和見的な現場内トンネルメソッドに代わる、より構造化された代替品を提供します[2]。エンタープライズサイトへの早期のIPv6展開のためのシンプルで効率的な方法を提供する機能があります。"
    },
    {
      "indent": 3,
      "text": "When the site acquires IPv6-capable switch-router equipment, the VLAN-based method can still be used for delivery of IPv6 links to physical switch interfaces, just as it is commonly used today for IPv4 subnets, but with a common routing infrastructure.",
      "ja": "サイトがIPv6対応のスイッチルーター機器を取得する場合、VLANベースの方法は、IPv4サブネットに今日一般的に使用されているが、一般的なルーティングインフラストラクチャを使用して、物理スイッチインターフェイスへのIPv6リンクの配信に使用できます。"
    },
    {
      "indent": 0,
      "text": "3. Example VLAN Topology",
      "section_title": true,
      "ja": "3. 例VLANトポロジー"
    },
    {
      "indent": 3,
      "text": "The following figure shows how a VLAN topology may be used to introduce IPv6 in an enterprise network, using a parallel IPv6 routing infrastructure and VLAN tagging.",
      "ja": "次の図は、並列IPv6ルーティングインフラストラクチャとVLANタグ付けを使用して、エンタープライズネットワークにIPv6を導入するためにVLANトポロジを使用する方法を示しています。"
    },
    {
      "indent": 15,
      "text": "        External IPv6 Internet\n                  |\n                  |\n         IPv6 Access Router\n                  |\n                  |\n    Switch-router with VLAN support\n                  |\n                  |\n   +--------------+----------------+\n   |Site enterprise infrastructure |\n   |   with support for VLANs      |\n   +----+--------------------+-----+\n        |                    |\n        |                    |\n  VLAN switch A         VLAN switch B\n    |        |               |\n    |        |               |\nSubnet1    Subnet2        Subnet3",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 9,
      "text": "Figure 1: IPv6 deployment using VLANs (physical diagram)",
      "ja": "図1：VLANを使用したIPv6の展開（物理図）"
    },
    {
      "indent": 3,
      "text": "In this scenario, the IPv6 access router has one physical port facing toward the internal infrastructure. In this example, it need only be IPv6-enabled, as its purpose is solely to handle IPv6 traffic for the enterprise. The access router has an additional interface facing toward the external infrastructure, which in this example could be dual-stack if the external IPv6 connectivity is via a tunnel to an IPv6 ISP.",
      "ja": "このシナリオでは、IPv6アクセスルーターには、内部インフラストラクチャに向かって1つの物理ポートがあります。この例では、その目的はエンタープライズのIPv6トラフィックのみを処理することのみを処理することであるため、IPv6対応のみが必要です。Accessルーターには、外部インフラストラクチャに向かって追加のインターフェイスがあります。この例では、外部IPv6接続がIPv6 ISPへのトンネルを介してある場合、デュアルスタックになる可能性があります。"
    },
    {
      "indent": 3,
      "text": "A number of VLANs are handled by the internal-facing IPv6 router port; in this case, IPv6 links Subnet1, Subnet2, Subnet3. The VLANs are seen as logical subinterfaces of the physical interface on the IPv6 access router, which is using the \"collapsed VLAN\" method described above, tagging the inbound traffic with one of three VLAN IDs depending on the target IPv6 Subnet prefix.",
      "ja": "多くのVLANが内部向上IPv6ルーターポートによって処理されます。この場合、IPv6はsubnet1、subnet2、subnet3をリンクします。VLANは、上記の「崩壊したVLAN」メソッドを使用しているIPv6アクセスルーターの物理インターフェイスの論理サブインターフェイスと見なされ、ターゲットIPv6サブネットプレフィックスに応じて3つのVLAN IDのいずれかでインバウンドトラフィックにタグ付けされます。"
    },
    {
      "indent": 3,
      "text": "The following figure shows how the IPv6 view of the deployment looks; all IPv6 subnets are on-link to the IPv6 access router, whether or not they share the same physical links over the VLAN infrastructure.",
      "ja": "次の図は、展開のIPv6ビューがどのように見えるかを示しています。すべてのIPv6サブネットは、VLANインフラストラクチャで同じ物理リンクを共有するかどうかにかかわらず、IPv6アクセスルーターにリンクしています。"
    },
    {
      "indent": 20,
      "text": " External IPv6 Internet\n            |\n            |\n Site IPv6 Access Router\n   |        |         |\n   |        |         |\nSubnet1  Subnet2   Subnet3",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 11,
      "text": "Figure 2: IPv6 view of the deployment (logical view)",
      "ja": "図2：展開のIPv6ビュー（論理ビュー）"
    },
    {
      "indent": 3,
      "text": "In this example, the router acts as an IPv6 first-hop access router to the physical links, separately from the IPv4 first-hop router. This technique allows a site to easily \"inject\" native IPv6 into all the links where a VLAN-capable infrastructure is available, enabling partial or full IPv6 deployment on the wire in a site.",
      "ja": "この例では、ルーターはIPv4の最初のホップルーターとは別に、IPv6の最初のホップアクセスルーターとして物理リンクへのアクセスルーターとして機能します。この手法により、サイトはVLANに対応できるインフラストラクチャが利用できるすべてのリンクにネイティブIPv6を簡単に「注入」することができ、サイト内のワイヤー上の部分または完全なIPv6の展開を可能にします。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "There are no additional security considerations particular to this method of enabling IPv6 on a link.",
      "ja": "リンクでIPv6を有効にするこの方法に特有の追加のセキュリティ上の考慮事項はありません。"
    },
    {
      "indent": 3,
      "text": "Where the IPv6 connectivity is delivered into the enterprise network by a different path from the IPv4 connectivity, care should be given that equivalent application of security policy (e.g., firewalling) is made to the IPv6 path.",
      "ja": "IPv6接続がIPv4接続とは異なるパスによってエンタープライズネットワークに配信される場合、IPv6パスに対してセキュリティポリシーの同等の適用（ファイアウォールなど）が行われることに注意する必要があります。"
    },
    {
      "indent": 0,
      "text": "5. Acknowledgements",
      "section_title": true,
      "ja": "5. 謝辞"
    },
    {
      "indent": 3,
      "text": "The author would like to thank colleagues on the 6NET project, where this technique for IPv4-IPv6 coexistence is widely deployed, in particular Pekka Savola (CSC/FUNET), but also including Janos Mohacsi (Hungarnet), Martin Dunmore and Chris Edwards (Lancaster University), Christian Strauf (JOIN Project, University of Muenster), and Stig Venaas (UNINETT).",
      "ja": "著者は、IPv4-IPV6共存のこの手法が広く展開されている6NETプロジェクトの同僚に感謝したいと思います。大学）、クリスチャン・ストラウフ（ムエンスター大学に参加）、およびスティグ・ヴェナス（Uninett）。"
    },
    {
      "indent": 0,
      "text": "6. Informative References",
      "section_title": true,
      "ja": "6. 参考引用"
    },
    {
      "indent": 3,
      "text": "[1] Narten, T., Nordmark, E., and W. Simpson, \"Neighbor Discovery for IP Version 6 (IPv6)\", RFC 2461, December 1998.",
      "ja": "[1] Narten、T.、Nordmark、E。、およびW. Simpson、「IPバージョン6の近隣発見（IPv6）」、RFC 2461、1998年12月。"
    },
    {
      "indent": 3,
      "text": "[2] Templin, F., Gleeson, T., Talwar, M., and D. Thaler, \"Intra-Site Automatic Tunnel Addressing Protocol (ISATAP)\", RFC 4214, October 2005.",
      "ja": "[2] Templin、F.、Gleeson、T.、Talwar、M。、およびD. Thaler、「敷地内自動トンネルアドレス指定プロトコル（ISATAP）」、RFC 4214、2005年10月。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Configuration Example",
      "section_title": true,
      "ja": "付録A. 構成の例"
    },
    {
      "indent": 3,
      "text": "This section describes a configuration example for using a computer running the FreeBSD variant of the Berkeley Software Distribution (BSD) operating system as a router to deploy IPv6 networking across a number of IPv6 links on an enterprise (in this case, six links), for a scenario similar to the one described above. Here, the precise configuration may of course vary depending on the existing site VLAN deployment. This section highlights that the VLAN configuration must be manually configured; the support is not \"automatic\".",
      "ja": "このセクションでは、Berkeleyソフトウェア配信（BSD）オペレーティングシステムのFreeBSDバリアントを実行しているコンピューターを使用するための構成例について説明します。上記のシナリオと同様のシナリオ。ここでは、もちろん、正確な構成は、既存のサイトVLAN展開によって異なる場合があります。このセクションでは、VLAN構成を手動で構成する必要があることを強調しています。サポートは「自動」ではありません。"
    },
    {
      "indent": 3,
      "text": "In this example, the configuration is for an IPv6 BSD router connected directly to a site's external IPv6 access router. The BSD router has one interface (dc0) toward the site IPv6 access router, and three interfaces (dc1, dc2, dc3) over which the internal routing is performed (the number of interfaces can be varied; three are used here to distribute the traffic load). The IPv6 documentation prefix (2001:db8::/32) is used in the example.",
      "ja": "この例では、構成は、サイトの外部IPv6アクセスルーターに直接接続されたIPv6 BSDルーター用です。BSDルーターには、サイトIPv6アクセスルーターに1つのインターフェイス（DC0）があり、3つのインターフェイス（DC1、DC2、DC3）があり、その上に内部ルーティングが実行されます（インターフェイスの数を変更できます。3つはトラフィックを配布するために使用されます。ロード）。IPv6ドキュメントプレフィックス（2001：DB8 ::/32）は、例で使用されています。"
    },
    {
      "indent": 0,
      "text": "--- Example IPv6 VLAN configuration, FreeBSD ---",
      "ja": "---例IPv6 VLAN構成、FreeBSD ---"
    },
    {
      "indent": 0,
      "text": "# # To IPv6 enable a vlan # # 1. Add a new vlan device to cloned_interfaces called vlanX # # 2. Add an ifconfig_vlanX line, the number is the vlan tag ID # # 3. Add vlanX to ipv6_network_interfaces # # 4. Add an ipv6_ifconfig_vlanX line, with a new unique prefix # # 5. Add vlanX to rtadvd_interface # # 6. Add vlanX to ipv6_router_flags",
      "ja": "＃＃to ipv6を有効にするvlan＃＃＃＃1。vlanx＃＃＃＃＃＃＃＃2。cloned_interfacesに新しいVLANデバイスを追加します。ifconfig_vlanx行を追加します。IPv6_ifconfig_vlanx行、新しい一意のプレフィックス＃＃5を備えたライン＃5。vlanxをrtadvd_interface＃＃6.ipv6_router_flagsにvlanxを追加する"
    },
    {
      "indent": 0,
      "text": "### Interfaces ###",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "# Bring physical interfaces up ifconfig_dc0=\"up\" ifconfig_dc1=\"up\" ifconfig_dc2=\"up\" ifconfig_dc3=\"up\"",
      "ja": "＃ifconfig_dc0 = \"up\" ifconfig_dc1 = \"up\" ifconfig_dc2 = \"up\" ifconfig_dc3 = \"up\" ifconfig_dc1 = \"up\" \"up\" \"up\" up \"up\"を持ち込む"
    },
    {
      "indent": 0,
      "text": "# Create VLan interfaces cloned_interfaces=\"vlan0 vlan1 vlan2 vlan3 vlan4 vlan5 vlan6\"",
      "ja": "＃vlanインターフェイスを作成するcloned_interfaces = \"vlan0 vlan1 vlan2 vlan3 vlan4 vlan5 vlan6\""
    },
    {
      "indent": 0,
      "text": "# Upstream link to IPv6 Access Router ifconfig_vlan0=\"vlan 37 vlandev dc0\"",
      "ja": "＃IPv6へのアップストリームリンクAccess Router ifconfig_vlan0 = \"vlan 37 vlandev dc0\""
    },
    {
      "indent": 0,
      "text": "# Downstream interfaces, load balance over interfaces dc1,dc2,dc3\nifconfig_vlan1=\"vlan 11 vlandev dc1\" # Subnet1\nifconfig_vlan2=\"vlan 17 vlandev dc2\" # Subnet2\nifconfig_vlan3=\"vlan 24 vlandev dc3\" # Subnet3\nifconfig_vlan4=\"vlan 25 vlandev dc1\" # Subnet4\nifconfig_vlan5=\"vlan 34 vlandev dc2\" # Subnet5\nifconfig_vlan6=\"vlan 14 vlandev dc3\" # Subnet6",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "### IPv6 ###",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "# Enable ipv6 ipv6_enable=\"YES\"",
      "ja": "＃IPv6IPv6_ENABLE = \"はい\"を有効にします"
    },
    {
      "indent": 0,
      "text": "# Forwarding ipv6_gateway_enable=\"YES\"",
      "ja": "＃転送ipv6_gateway_enable = \"yes\""
    },
    {
      "indent": 0,
      "text": "# Define Interfaces\nipv6_network_interfaces=\"vlan0 vlan1 vlan2 vlan3 vlan4 vlan5 vlan6\"\n# Define addresses\nipv6_ifconfig_vlan0=\"2001:db8:d0:101::2 prefixlen 64\" # Uplink\nipv6_ifconfig_vlan1=\"2001:db8:d0:111::1 prefixlen 64\" # Subnet1\nipv6_ifconfig_vlan2=\"2001:db8:d0:112::1 prefixlen 64\" # Subnet2\nipv6_ifconfig_vlan3=\"2001:db8:d0:121::1 prefixlen 64\" # Subnet3\nipv6_ifconfig_vlan4=\"2001:db8:d0:113::1 prefixlen 64\" # Subnet4\nipv6_ifconfig_vlan5=\"2001:db8:d0:114::1 prefixlen 64\" # Subnet5\nipv6_ifconfig_vlan6=\"2001:db8:d0:115::1 prefixlen 64\" # Subnet6",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "# Router advertisements rtadvd_enable=\"YES\" rtadvd_interfaces=\"-s vlan0 vlan1 vlan2 vlan3 vlan4 vlan5 vlan6\"",
      "ja": "＃ルーター広告rtadvd_enable = \"yes\" rtadvd_interfaces = \"-s vlan0 vlan1 vlan2 vlan3 vlan4 vlan5 vlan6\" \""
    },
    {
      "indent": 0,
      "text": "### Routing ###",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "# Multicast mroute6d_enable=\"YES\" mroute6d_program=\"/sbin/pim6sd\"",
      "ja": "＃multicast mroute6d_enable = \"yes\" mroute6d_program = \"/sbin/pim6sd\""
    },
    {
      "indent": 0,
      "text": "# RIP-ng ipv6_router_enable=\"YES\" ipv6_router_flags=\"-N dc0,dc1,dc2,dc3, vlan1,vlan2,vlan3, vlan4,vlan5,vlan6\"",
      "ja": "＃rip-ng ipv6_router_enable = \"yes\" ipv6_router_flags = \"-n dc0、dc1、dc2、dc3、vlan1、vlan2、vlan3、vlan4、vlan5、vlan6\""
    },
    {
      "indent": 0,
      "text": "--- End of configuration ---",
      "ja": "---構成の終わり---"
    },
    {
      "indent": 3,
      "text": "Note that if there was only one internal-facing interface, then again so long as the OS supported VLAN trunking, all the VLAN IDs could be associated to that interface (dc1, for example).",
      "ja": "内部面インターフェイスが1つしかなかった場合、OSがVLANトランキングをサポートしている限り、すべてのVLAN IDがそのインターフェイスに関連付けられる可能性があることに注意してください（たとえば、DC1）。"
    },
    {
      "indent": 3,
      "text": "The VLAN IDs need to be managed by the site administrator, but would probably already be assigned for existing IPv4 subnets (ones into which IPv6 is being introduced).",
      "ja": "VLAN IDはサイト管理者によって管理される必要がありますが、おそらく既存のIPv4サブネット（IPv6が導入されているもの）にすでに割り当てられているでしょう。"
    },
    {
      "indent": 3,
      "text": "For a large enterprise, a combination of internal tunnels and VLAN usage could be used; the whole site need not be enabled by VLAN tagging alone. This choice is one for the site administrator to make.",
      "ja": "大企業の場合、内部トンネルとVLANの使用の組み合わせを使用できます。サイト全体を単独でタグ付けすることで有効にする必要はありません。この選択は、サイト管理者が作成できるものです。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者の連絡先"
    },
    {
      "indent": 3,
      "text": "Tim Chown University of Southampton Southampton, Hampshire SO17 1BJ United Kingdom",
      "ja": "ティムチャウンサウサンプトン大学サウサンプトン、ハンプシャーSO17 1BJイギリス"
    },
    {
      "indent": 3,
      "text": "EMail: tjc@ecs.soton.ac.uk",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2006).",
      "ja": "Copyright（c）The Internet Society（2006）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "この文書は、BCP 78に含まれる権利、ライセンス、および制限の対象となり、そこに記載されている場合を除き、著者はすべての権利を保持しています。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "このドキュメントとここに含まれる情報は、「現状のまま」に基づいて提供されています。また、貢献者、彼/彼女が代表する組織（もしあれば）が後援する組織、インターネット協会とインターネット工学タスクフォースは、すべての保証、明示的または明示的、またはすべての保証を否認します。本書の情報の使用が、商品性または特定の目的に対する適合性の権利または黙示的な保証を侵害しないという保証を含むがこれらに限定されないことを含む。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、知的財産権またはその他の権利の有効性または範囲に関して、この文書に記載されている技術の実装または使用、またはそのような権利に基づくライセンスがどの程度であるかについての使用に関連すると主張する可能性があるという立場はありません。利用可能になります。また、そのような権利を特定するために独立した努力をしたことも表明していません。RFCドキュメントの権利に関する手順に関する情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IETF事務局に行われたIPR開示のコピーと、利用可能にするライセンスの保証、またはこの仕様の実装者またはユーザーによるそのような独自の権利の使用のための一般的なライセンスまたは許可を取得するための試みの結果を取得できます。http://www.ietf.org/iprのIETFオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、関心のある当事者に、著作権、特許、または特許出願、またはこの基準を実装するために必要な技術をカバーする可能性のあるその他の独自の権利を注意深く招待するよう招待しています。ietf-ipr@ietf.orgのIETFへの情報をお問い合わせください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is provided by the IETF Administrative Support Activity (IASA).",
      "ja": "RFCエディター機能の資金は、IETF管理サポートアクティビティ（IASA）によって提供されます。"
    }
  ]
}