{
  "title": {
    "text": "RFC 4047 - MIME Sub-type Registrations for Flexible Image Transport System (FITS)",
    "ja": "RFC 4047 - Flexible Image Transport System（FITS）のMIMEサブタイプ登録"
  },
  "number": 4047,
  "created_at": "2019-10-19 07:07:41.478086+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                           S. Allen\nRequest for Comments: 4047                          UCO/Lick Observatory\nCategory: Informational                                         D. Wells\n                                    National Radio Astronomy Observatory\n                                                              April 2005",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 17,
      "text": "   MIME Sub-type Registrations for\nFlexible Image Transport System (FITS)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモは、インターネットコミュニティに情報を提供します。 いかなる種類のインターネット標準も指定していません。 このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "ja": "著作権（C）インターネット協会（2005）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document describes the registration of the Multipurpose Internet Mail Extensions (MIME) sub-types to be used by the international astronomical community for the interchange of Flexible Image Transport System (FITS) files. The encoding is defined by the published FITS standard documents. The FITS format has been in use since 1979, and almost all data from astronomical observations are interchanged by using FITS.",
      "ja": "このドキュメントでは、Flexible Image Transport System（FITS）ファイルの交換のために国際天文コミュニティで使用される多目的インターネットメール拡張（MIME）サブタイプの登録について説明します。 エンコードは、公開されているFITS標準ドキュメントで定義されています。 FITS形式は1979年から使用されており、天体観測のほとんどすべてのデータはFITSを使用して交換されます。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction..................................................  2\n2.  Conventions Used in this Document.............................  2\n3.  Overview......................................................  2\n4.  FITS Definition...............................................  3\n    4.1.  FITS Structure..........................................  3\n    4.2.  History of FITS Features................................  5\n    4.3.  Stability of the FITS definition........................  6\n    4.4.  Portability of FITS files...............................  7\n    4.5.  Application Programming Interfaces to FITS..............  7\n    4.6.  FITS File Conformance Testing...........................  8\n    4.7.  Archives That Distribute FITS Files.....................  8\n5.  IANA Considerations...........................................  9\n    5.1.  Registration of application/fits........................ 10\n    5.2.  Registration of image/fits.............................. 14\n6.  References.................................................... 19\n    6.1.  Normative References.................................... 19",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "    6.2.  Informative References.................................. 20\n7.  Security Considerations....................................... 21\n8.  Contributors.................................................. 21\n9.  Acknowledgements.............................................. 22\nAuthors' Addresses................................................ 22\nFull Copyright Statement.......................................... 23",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The FITS file format [FITS] was designed in order to facilitate the interchange of astronomical image data between observatories. FITS provides a means of transporting arrays and tables of data and keyword/value pairs of metadata. FITS is defined by standards documents that are approved by the International Astronomical Union (IAU, http://www.iau.org/) and published in refereed journals.",
      "ja": "FITSファイル形式[FITS]は、天文台間の天文画像データの交換を容易にするために設計されました。 FITSは、データの配列とテーブル、およびメタデータのキーワードと値のペアを転送する手段を提供します。 FITSは、International Astronomical Union（IAU、http：//www.iau.org/）によって承認され、査読付きのジャーナルで公開されている標準文書によって定義されています。"
    },
    {
      "indent": 3,
      "text": "Before the inception of HTTP, astronomers used the Internet to exchange FITS files. Multiple unofficial media types for FITS files [ASU] came into use shortly after the inception of the WWW and have remained in use. Currently (2005) the international astronomical community is pursuing many cooperative efforts (e.g., [IVOA], [NVO], [AstroGrid], [AVO]) to produce web services that provide astronomical data. The exchange of FITS files is a fundamental element of the prototypes for these web services [SIAP]. The astronomical community has to agree to use one set of media types for FITS files in order to promote interoperability of its various services.",
      "ja": "HTTPの開始前、天文学者はインターネットを使用してFITSファイルを交換していました。 FITSファイル用の複数の非公式メディアタイプ[ASU]は、WWWの開始直後に使用され、現在も使用され続けています。 現在（2005）、国際天文学コミュニティは、天文データを提供するWebサービスを作成するために、多くの協力的な努力（[IVOA]、[NVO]、[AstroGrid]、[AVO]など）を追求しています。 FITSファイルの交換は、これらのWebサービス[SIAP]のプロトタイプの基本要素です。 天文学コミュニティは、さまざまなサービスの相互運用性を促進するために、FITSファイルに1種類のメディアタイプを使用することに同意する必要があります。"
    },
    {
      "indent": 3,
      "text": "In its simplest form, FITS is used as a means of transporting astronomical image data in a raster form along with coordinate information and other standard and locally defined metadata. In such applications FITS is much like the well-known TIFF format [TIFF] with the addition of the GeoTIFF tags [GeoTIFF]. However, FITS is capable of describing a much broader range of data than 2-dimensional rasters. A consensus has developed in the FITS community that two media types are needed: one for images and one for all other cases.",
      "ja": "最も単純な形式では、FITSは、天体画像データを座標情報やその他の標準およびローカルで定義されたメタデータとともにラスター形式で転送する手段として使用されます。 このようなアプリケーションでは、FITSはよく知られているTIFF形式[TIFF]とよく似ており、GeoTIFFタグ[GeoTIFF]が追加されています。 ただし、FITSは、2次元ラスターよりもはるかに広範なデータを記述することができます。 FITSコミュニティでは、2つのメディアタイプが必要であるというコンセンサスが得られました。1つは画像用で、もう1つは他のすべての場合用です。"
    },
    {
      "indent": 0,
      "text": "2. Conventions Used in this Document",
      "section_title": true,
      "ja": "2.このドキュメントで使用される規則"
    },
    {
      "indent": 3,
      "text": "The keywords \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC-2119 [Require].",
      "ja": "このドキュメントのキーワード「MUST」、「MUST NOT」、「REQUIRED」、「SHALL」、「SHALL NOT」、「SHOULD」、「SHOULD NOT」、「RECOMMENDED」、「MAY」、および「OPTIONAL」は RFC-2119 [Require]で説明されているように解釈される。"
    },
    {
      "indent": 0,
      "text": "3. Overview",
      "section_title": true,
      "ja": "3.概要"
    },
    {
      "indent": 3,
      "text": "This document describes the registration of the MIME media sub-types \"application/fits\" and \"image/fits\".",
      "ja": "このドキュメントでは、MIMEメディアのサブタイプ「application / fits」および「image / fits」の登録について説明しています。"
    },
    {
      "indent": 3,
      "text": "In 1988 the International Astronomical Union formed the FITS Working Group (IAUFWG) to oversee matters pertaining to the evolution of the FITS data format. The IAUFWG has approved the submission of this document and the registration of these two MIME types.",
      "ja": "1988年、国際天文学連合はFITSデータ形式の進化に関する事項を監督するためにFITSワーキンググループ（IAUFWG）を設立しました。 IAUFWGは、この文書の提出とこれら2つのMIMEタイプの登録を承認しました。"
    },
    {
      "indent": 0,
      "text": "4. FITS Definition",
      "section_title": true,
      "ja": "4. FITSの定義"
    },
    {
      "indent": 3,
      "text": "FITS is defined by a document approved by the International Astronomical Union (IAU) and published in the journal Astronomy & Astrophysics [NOST]. Conventions for additional keywords used in FITS files are proposed by interested parties and negotiated and reviewed by ad hoc committees of the FITS community. If such usage of additional keywords is approved by national committees and the IAUFWG then they become new reserved keywords in the FITS standard and are published in an ongoing series of papers (e.g., [WCS1, WCS2]).",
      "ja": "FITSは、International Astronomical Union（IAU）によって承認され、ジャーナルAstronomy＆Astrophysics [NOST]で公開されている文書によって定義されています。 FITSファイルで使用される追加キーワードの規則は、利害関係者によって提案され、FITSコミュニティのアドホック委員会によって交渉および検討されます。 このような追加キーワードの使用が国内委員会とIAUFWGによって承認された場合、それらはFITS規格の新しい予約キーワードになり、継続中の一連の論文で公開されます（例：[WCS1、WCS2]）。"
    },
    {
      "indent": 3,
      "text": "Copies of the standard documents can be found at the following sites:",
      "ja": "標準文書のコピーは、次のサイトにあります。"
    },
    {
      "indent": 3,
      "text": "http://fits.gsfc.nasa.gov/",
      "ja": "http://fits.gsfc.nasa.gov/"
    },
    {
      "indent": 3,
      "text": "http://archive.stsci.edu/fits/",
      "ja": "http://archive.stsci.edu/fits/"
    },
    {
      "indent": 3,
      "text": "http://www.cv.nrao.edu/fits/",
      "ja": "http://www.cv.nrao.edu/fits/"
    },
    {
      "indent": 3,
      "text": "http://heasarc.gsfc.nasa.gov/docs/heasarc/fits.html",
      "ja": "http://heasarc.gsfc.nasa.gov/docs/heasarc/fits.html"
    },
    {
      "indent": 3,
      "text": "Although a brief structure and feature description is provided in this section as background information, the reader is directed to the FITS standards documents to obtain complete feature and technical details.",
      "ja": "このセクションでは、背景情報として簡単な構造と機能の説明を提供しますが、読者はFITS標準ドキュメントを参照して、完全な機能と技術的な詳細を入手してください。"
    },
    {
      "indent": 0,
      "text": "4.1. FITS Structure",
      "section_title": true,
      "ja": "4.1.  FITS構造"
    },
    {
      "indent": 3,
      "text": "A FITS file consists of a sequence of one or more header and data units (HDUs) optionally followed by special records. The structure of a FITS file is based on blocks with a length of 2880 8-bit bytes (23040 bits). This size was chosen because it is evenly divisible by the byte and word lengths of all known computer systems. All FITS files have lengths that are integral multiples of this block size.",
      "ja": "FITSファイルは、1つ以上のヘッダーとデータユニット（HDU）のシーケンスで構成され、オプションで特別なレコードが続きます。 FITSファイルの構造は、8ビットバイト（23040ビット）2880の長さのブロックに基づいています。 このサイズが選択されたのは、既知のすべてのコンピューターシステムのバイト長とワード長で均等に割り切れるからです。 すべてのFITSファイルの長さは、このブロックサイズの整数倍です。"
    },
    {
      "indent": 3,
      "text": "Each FITS header consists of a sequence of one or more 2880-byte blocks that hold 36 80-character records (36*80=2880). The records consist of ASCII keyword/value pairs plus optional comments. The character set is the 7-bit printing ASCII codes, including the ASCII space. In particular, the control codes CR, LF, FF, TAB and NUL are not used in FITS headers. The keywords are up to 8 characters in length. Some keywords are mandatory, and their meaning is rigidly prescribed. Among these are keywords that describe the structure and size of the subsequent data array. The standard reserves other keywords for the purpose of conveying specifically defined items of metadata. Keywords that are neither mandatory nor reserved may be inserted with semantics that are defined by local conventions. (Some local conventions have later been adopted into standardized practice.) The end of the header is signified by a block containing the keyword \"END\". A simple example of a FITS header for a digital image, using only keywords that were specified in the initial FITS Agreement of March 1979 [FITS], is as follows:",
      "ja": "各FITSヘッダーは、36個の80文字レコード（36 * 80 = 2880）を保持する1つ以上の2880バイトブロックのシーケンスで構成されます。レコードは、ASCIIキーワード/値のペアとオプションのコメントで構成されます。文字セットは、ASCIIスペースを含む7ビット印刷ASCIIコードです。特に、制御コードCR、LF、FF、TAB、およびNULは、FITSヘッダーでは使用されません。キーワードの長さは最大8文字です。一部のキーワードは必須であり、その意味は厳密に規定されています。これらの中には、後続のデータ配列の構造とサイズを記述するキーワードがあります。この規格は、メタデータの具体的に定義されたアイテムを伝える目的で他のキーワードを予約しています。必須でも予約でもないキーワードは、ローカルの規則で定義されているセマンティクスで挿入できます。 （いくつかの地域の慣習は後に標準化された方法に採用されました。）ヘッダーの終わりは、キーワード「END」を含むブロックによって示されます。 1979年3月の最初のFITS協定[FITS]で指定されたキーワードのみを使用した、デジタル画像のFITSヘッダーの簡単な例は次のとおりです。"
    },
    {
      "indent": 3,
      "text": " 1 2 3 4 5 6 1234567890123456789012345678901234567890123456789012345678901234567..",
      "ja": "1 2 3 4 5 6 1234567890123456789012345678901234567890123456789012345678901234567 .."
    },
    {
      "indent": 3,
      "text": "SIMPLE  =                    T / file does conform to FITS standard\nBITPIX  =                   16 / 16-bit twos-complement pixel values\nNAXIS   =                    2 / 2-dimensional image\nNAXIS1  =                  512 / first axis length\nNAXIS2  =                  512 / second axis length\nCOMMENT  -----------------------------------------------------\nCOMMENT   FITS (Flexible Image Transport System) format is defined\nCOMMENT   in 'Astronomy and Astrophysics', volume 376, page 359;\nCOMMENT   bibcode: 2001A&A...376..359H\nCOMMENT  -----------------------------------------------------\nORIGIN  = 'Lick Observatory   ' /\nDATE    = '2003-11-22T05:23:45' / when this file was written\nEND",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "(These 13 records are followed by 23 80-character records of ASCII spaces, to pad the header block to the 2880-byte FITS block size.)",
      "ja": "（これらの13個のレコードの後には、ヘッダーブロックを2880バイトのFITSブロックサイズにパディングするために、23個のASCIIスペースの80文字レコードが続きます。）"
    },
    {
      "indent": 3,
      "text": "The first keyword/value pair, SIMPLE=T, is the signature of FITS; all FITS files begin with these characters. BITPIX is the second keyword of all FITS files; legal values for it are 8, 16, 32, -32 and -64. NAXIS is the third keyword of all FITS files; legal values for it are 0 to 999. NAXIS=0 is legal, and implies that there is no image data matrix associated with the header (and the NAXISi keywords must not be present); this value is common for files that will be given the media type \"application/fits\" as discussed in section 5.1 of this document. NAXIS=2 is the value most often used for files that will be given the media type \"image/fits\", as discussed in section 5.2 of this document (NAXIS=3 FITS images are also common). The COMMENT records will be ignored by FITS reading software, but are used here to specify the precise journal citation for the FITS standard, an item of information that is important for archiving on timescales of decades. The ORIGIN keyword is commonly used in FITS files to encode the name of the institution where the file was produced. The DATE keyword is used to convey the timestamp for the file (whereas the keyword DATE-OBS is used to convey observation start times). FITS headers commonly contain a vast variety of additional keywords used to encode metadata. In particular, a digital image header will often include keywords to specify the precise celestial coordinates of the pixels of the 2-D matrix, with conventions that became part of the FITS standard in 2002 (see [WCS2]). Finally, the above example demonstrates how, in addition to the COMMENT records, 60% of the bytes in keyword=value records in FITS headers are reserved for comments. Although the simple header example above is contained in only one FITS block, multi-block FITS headers are commonly interchanged.",
      "ja": "最初のキーワード/値のペアであるSIMPLE = Tは、FITSの署名です。すべてのFITSファイルはこれらの文字で始まります。 BITPIXは、すべてのFITSファイルの2番目のキーワードです。有効な値は8、16、32、-32および-64です。 NAXISは、すべてのFITSファイルの3番目のキーワードです。有効な値は0〜999です。NAXIS= 0は有効で、ヘッダーに関連付けられた画像データマトリックスがないことを意味します（NAXISiキーワードが存在してはなりません）。この値は、このドキュメントのセクション5.1で説明されているように、メディアタイプ「application / fits」が与えられるファイルに共通です。 NAXIS = 2は、このドキュメントのセクション5.2で説明されているように、メディアタイプ「image / fits」が与えられるファイルに最もよく使用される値です（NAXIS = 3 FITSイメージも一般的です）。 COMMENTレコードは、FITSリーディングソフトウェアでは無視されますが、ここでは、FITS標準の正確なジャーナル引用を指定するために使用されます。FITS標準は、数十年のタイムスケールでアーカイブするために重要な情報項目です。 ORIGINキーワードは、ファイルが作成された機関の名前をエンコードするためにFITSファイルで一般的に使用されます。 DATEキーワードは、ファイルのタイムスタンプを伝えるために使用されます（一方、キーワードDATE-OBSは、観測開始時刻を伝えるために使用されます）。 FITSヘッダーには、通常、メタデータのエンコードに使用されるさまざまな追加キーワードが含まれています。特に、デジタル画像ヘッダーには、多くの場合、2002年にFITS標準の一部になった慣例に従って、2次元マトリックスのピクセルの正確な天体座標を指定するキーワードが含まれます（[WCS2]を参照）。最後に、上記の例は、COMMENTレコードに加えて、FITSヘッダーのkeyword = valueレコードのバイトの60％がコメント用に予約される方法を示しています。上記の簡単なヘッダーの例は1つのFITSブロックにのみ含まれていますが、マルチブロックFITSヘッダーは一般的に交換されます。"
    },
    {
      "indent": 3,
      "text": "Following each header is a data unit that consists of a sequence of zero or more 2880-byte blocks. In accordance with the description in the keywords of their header, these blocks contain an N-dimensional data array, optionally followed by other small groups of array data. In most cases, the data array represents either an N-dimensional array of image pixel values or a 2-dimensional array of tabular data.",
      "ja": "各ヘッダーの後には、0個以上の2880バイトブロックのシーケンスで構成されるデータ単位が続きます。 ヘッダーのキーワードの説明に従って、これらのブロックにはN次元データ配列が含まれ、オプションで他の小さな配列データのグループが続きます。 ほとんどの場合、データ配列は、イメージピクセル値のN次元配列または表形式データの2次元配列のいずれかを表します。"
    },
    {
      "indent": 3,
      "text": "Following the HDUs a FITS file may contain zero or more 2880-byte blocks of special records. The standard does not specify anything about their content. (This convention for special records is not known to have been used for any purpose other than prototyping new elements of the standard, such as random groups and BINTABLE.)",
      "ja": "HDUに続いて、FITSファイルには0個以上の2880バイトの特殊レコードブロックが含まれる場合があります。 標準では、コンテンツについて何も指定されていません。 （この特殊なレコードの規則は、ランダムグループやBINTABLEなど、標準の新しい要素のプロトタイプ作成以外の目的で使用されたことはありません。）"
    },
    {
      "indent": 3,
      "text": "The initial HDU in a FITS file is known as the primary HDU (PHDU); any subsequent HDU is known as an extension HDU (XHDU). The keyword content of the PHDU is distinct (a PHDU requires a slight alteration before it can become an XHDU, and most types of XHDU cannot become a PHDU). A PHDU may have a data array consisting of zero elements, and this will often be the case for FITS files intended to communicate tables and multiple images. An XHDU may be one of several standard types, or it may be another conforming type. Standard types of XHDU include \"IMAGE\" (containing an N-dimensional data array similar in most respects to the PHDU), \"TABLE\" (containing a 2-dimensional table of ASCII character data), and \"BINTABLE\" (containing a 2-dimensional table of binary data whose elements may themselves be multi-dimensional arrays).",
      "ja": "FITSファイルの最初のHDUは、プライマリHDU（PHDU）と呼ばれます。 後続のHDUは、拡張HDU（XHDU）と呼ばれます。 PHDUのキーワードコンテンツは明確です（PHDUはXHDUになる前にわずかな変更が必要であり、ほとんどのタイプのXHDUはPHDUになりません）。 PHDUには、ゼロ要素で構成されるデータ配列が含まれる場合があります。これは、テーブルと複数の画像を通信するためのFITSファイルの場合によくあります。 XHDUは、いくつかの標準タイプの1つでも、別の準拠タイプでもかまいません。 XHDUの標準タイプには、「IMAGE」（ほとんどの点でPHDUと同様のN次元データ配列を含む）、「TABLE」（ASCII文字データの2次元テーブルを含む）、「BINTABLE」（2 要素自体が多次元配列である可能性のあるバイナリデータの次元テーブル）。"
    },
    {
      "indent": 0,
      "text": "4.2. History of FITS Features",
      "section_title": true,
      "ja": "4.2.  FITS機能の歴史"
    },
    {
      "indent": 3,
      "text": "In 1981 the original definition of FITS described a single HDU containing one multi-dimensional image array [FITS], as illustrated by the sample header shown in section 4.1. Subsequent agreements have used the original framework of HDUs and keyword/value pairs to extend FITS while preserving the validity of all existing files. FITS now has standard means of describing multiple arrays of image data and/or multiple tables of numeric and character information.",
      "ja": "1981年、FITSの元の定義では、セクション4.1に示すサンプルヘッダーに示すように、1つの多次元画像アレイ[FITS]を含む単一のHDUが記述されました。 その後の合意では、HDUとキーワード/値のペアの元のフレームワークを使用して、既存のすべてのファイルの有効性を維持しながらFITSを拡張しています。 FITSには、画像データの複数の配列や、数値および文字情報の複数のテーブルを記述する標準的な手段があります。"
    },
    {
      "indent": 3,
      "text": "Brief highlights of the history of FITS",
      "ja": "FITSの歴史の概要"
    },
    {
      "indent": 6,
      "text": "- 1979: Initial FITS Agreement and first interchange of files",
      "ja": "-1979：最初のFITS契約と最初のファイル交換"
    },
    {
      "indent": 6,
      "text": "- 1980: Random groups convention developed",
      "ja": "-1980年：ランダムグループ規約が開発されました"
    },
    {
      "indent": 6,
      "text": "- 1981: Published original (single HDU) definition [FITS]",
      "ja": "-1981：オリジナル（シングルHDU）定義の公開[FITS]"
    },
    {
      "indent": 6,
      "text": "- 1981: Published random groups definition [GROUPS]",
      "ja": "-1981：ランダムグループ定義の公開[グループ]"
    },
    {
      "indent": 6,
      "text": "- 1982: Formally endorsed by the IAU",
      "ja": "-1982年：IAUにより正式に承認されました"
    },
    {
      "indent": 6,
      "text": "- 1988: Defined rules for multiple HDUs [XTENSION]",
      "ja": "-1988：複数のHDUの定義済みルール[XTENSION]"
    },
    {
      "indent": 6,
      "text": "- 1988: FITS Working Group established by IAU [IAUFWG]",
      "ja": "-1988：IAUが設立したFITSワーキンググループ[IAUFWG]"
    },
    {
      "indent": 6,
      "text": "- 1988: Extended to include ASCII tables [TABLE]",
      "ja": "-1988：ASCIIテーブルを含むように拡張[表]"
    },
    {
      "indent": 6,
      "text": "- 1990: Extended to include IEEE floating-point data",
      "ja": "-1990：IEEE浮動小数点データを含むように拡張"
    },
    {
      "indent": 6,
      "text": "- 1994: Extended to multiple image arrays [IMAGE]",
      "ja": "-1994：複数の画像配列に拡張[画像]"
    },
    {
      "indent": 6,
      "text": "- 1995: Extended to binary tables [BINTABLE]",
      "ja": "-1995：バイナリテーブルに拡張[BINTABLE]"
    },
    {
      "indent": 6,
      "text": "- 1997: Adopted a Y2K-compliant date format",
      "ja": "-1997：Y2K準拠の日付形式を採用"
    },
    {
      "indent": 6,
      "text": "- 2001: Reiterated existing standard in one paper [NOST]",
      "ja": "-2001：1つの論文で既存の標準を繰り返した[NOST]"
    },
    {
      "indent": 6,
      "text": "- 2002: Approved conventions for world coordinates [WCS1, WCS2]",
      "ja": "-2002：世界座標の承認された規則[WCS1、WCS2]"
    },
    {
      "indent": 0,
      "text": "4.3. Stability of the FITS Definition",
      "section_title": true,
      "ja": "4.3.  FITS定義の安定性"
    },
    {
      "indent": 3,
      "text": "After the adoption of FITS by the IAU in 1982, some in the emerging community of FITS users realized that there would be tension between the need for archival stability and the need for evolution. In order to satisfy both of these requirements they set up a controlled parliamentary process. At the time of the Generalized Extensions Agreement [XTENSION], the meta-agreement that controls the evolution of FITS, the FITS community adopted the guiding principle \"Once FITS, always FITS\". Under this rule, no change may be made to FITS that invalidates existing files. Changes to the FITS standard occur only after action by the IAU FITS Working Group (FWG). The FWG acts only after approval by regional working groups that coordinate FITS activity in various parts of the world.",
      "ja": "1982年にIAUがFITSを採用した後、FITSユーザーの新興コミュニティの一部は、アーカイブの安定性の必要性と進化の必要性の間に緊張があることに気付きました。 これらの要件の両方を満たすために、彼らは管理された議会プロセスを設定しました。 FITSの進化を制御するメタ合意であるGeneralized Extensions Agreement [XTENSION]の時点で、FITSコミュニティは「一度FITS、常にFITS」という指針を採用しました。 この規則の下では、既存のファイルを無効にするFITSに変更を加えることはできません。 FITS規格の変更は、IAU FITSワーキンググループ（FWG）による措置後にのみ行われます。 FWGは、世界のさまざまな地域でのFITS活動を調整する地域ワーキンググループによる承認後にのみ機能します。"
    },
    {
      "indent": 3,
      "text": "FITS has been adopted as the archival format for image data and interferometric data obtained by many ground-based observatories and for all data from many spacecraft. Many astrophysical archives store their data in FITS format, and most astronomical catalog data has been transcribed into FITS files. The many terabytes of data in these archives contribute to the stability of the FITS standard.",
      "ja": "FITSは、多くの地上観測所で取得された画像データと干渉データ、および多くの宇宙船からのすべてのデータのアーカイブ形式として採用されています。 多くの天体物理アーカイブはデータをFITS形式で保存し、ほとんどの天文カタログデータはFITSファイルに転写されています。 これらのアーカイブ内の数テラバイトのデータは、FITS標準の安定性に貢献しています。"
    },
    {
      "indent": 0,
      "text": "4.4. Portability of FITS files",
      "section_title": true,
      "ja": "4.4.  FITSファイルの移植性"
    },
    {
      "indent": 3,
      "text": "Eric Greisen, one of the authors of the original document [FITS], relates that in 1979",
      "ja": "オリジナル文書[FITS]の著者の1人であるEric Greisenは、1979年の"
    },
    {
      "indent": 6,
      "text": "[t]he first FITS files were written by a PL/I program on an IBM 360 under OS/MFT (32-bit, twos-complement numbers and 8-bit EBCDIC characters) and were read by a Fortran program executing on a CDC 6400 under SCOPE (60-bit, ones-complement numbers and 6-bit \"Display Code\" characters). [Remark]",
      "ja": "[t]最初のFITSファイルは、IBM 360のOS / MFT（32ビット、2の補数、8ビットのEBCDIC文字）のPL / Iプログラムによって書き込まれ、CDCで実行されるFortranプログラムによって読み取られました。 SCOPEで6400（60ビット、1の補数、6ビットの「表示コード」文字）。 [リマーク]"
    },
    {
      "indent": 3,
      "text": "Subsequent evolution of computing hardware and FITS over 25 years has not degraded this ability to transfer the data content.",
      "ja": "25年にわたるコンピューティングハードウェアとFITSのその後の進化は、データコンテンツを転送するこの能力を低下させませんでした。"
    },
    {
      "indent": 3,
      "text": "The structure of FITS files is extremely general, and this necessarily complements the nature of astronomical data. FITS is used to store observations of the entire electromagnetic spectrum from radio to gamma rays, from ground-based observatories and from spacecraft. FITS is also used to communicate physical properties other than radiation intensity; these may be inferred from observations or calculated by theoretical models. The pedigree of data in a FITS file typically varies among disciplines; FITS may be used to store raw and uncalibrated data, completely reduced and calibrated data, or both. Nevertheless, the FITS standard provides that the syntactic content of the data and metadata are unambiguously available to posterity.",
      "ja": "FITSファイルの構造は非常に一般的であり、これは必然的に天文データの性質を補完します。 FITSは、電波からガンマ線、地上の観測所、宇宙船からの電磁スペクトル全体の観測値を保存するために使用されます。 FITSは、放射強度以外の物理的特性の伝達にも使用されます。 これらは観測から推測されるか、理論モデルによって計算されます。 FITSファイル内のデータの血統は、通常、分野ごとに異なります。 FITSは、未加工のデータと未校正のデータ、完全に削減され校正されたデータ、またはその両方を保存するために使用できます。 それにもかかわらず、FITS規格では、データとメタデータの構文コンテンツが後世に明確に利用可能であると規定されています。"
    },
    {
      "indent": 3,
      "text": "Observatories have developed numerous local conventions for the storage and transfer of data peculiar to their instrumentation and purview. Application software for handling FITS files from different regions of the electromagnetic spectrum has been largely disjoint. For a FITS file that consists of multiple HDUs there are no widely established conventions governing the meaning of, interrelations between, and suggested use of the data sets. Recognition of any local conventions used for FITS data has often been based on heuristics of the additional (non-standard) keyword/value pairs. Fully understanding the semantic content of a FITS file usually requires an external data dictionary.",
      "ja": "天文台は、その計装と範囲に固有のデータの保存と転送のために、多くのローカルの規則を開発しました。 電磁スペクトルの異なる領域からのFITSファイルを処理するためのアプリケーションソフトウェアは、ほとんどばらばらです。 複数のHDUで構成されるFITSファイルの場合、データセットの意味、相互関係、および使用の推奨を規定する広く確立された規則はありません。 FITSデータに使用されるローカル規則の認識は、多くの場合、追加の（非標準の）キーワード/値のペアのヒューリスティックに基づいています。 FITSファイルのセマンティックコンテンツを完全に理解するには、通常、外部データディクショナリが必要です。"
    },
    {
      "indent": 0,
      "text": "4.5. Application Programming Interfaces to FITS",
      "section_title": true,
      "ja": "4.5.  FITSへのアプリケーションプログラミングインターフェイス"
    },
    {
      "indent": 3,
      "text": "Although the definition of FITS is expressed in terms of the bit content of the files, there are widely supported application programming interfaces (APIs) which simplify the task of manipulating",
      "ja": "FITSの定義はファイルのビットコンテンツで表されますが、広くサポートされているアプリケーションプログラミングインターフェイス（API）により、操作のタスクが簡素化されます。"
    },
    {
      "indent": 3,
      "text": "FITS files. Interfaces exist for many languages and operating systems. A partial list of APIs follows:",
      "ja": "FITSファイル。 多くの言語とオペレーティングシステム用のインターフェイスがあります。 APIの部分的なリストは次のとおりです。"
    },
    {
      "indent": 3,
      "text": "CFITSIO http://heasarc.gsfc.nasa.gov/fitsio/ fitsTcl http://heasarc.gsfc.nasa.gov/ftools/fv/fitsTcl_home.html WCSLIB http://www.atnf.csiro.au/people/mcalabre/WCS/ PyFITS http://www.stsci.edu/resources/software_hardware/pyfits WCSTools http://tdc-www.harvard.edu/software/wcstools/ FUNTOOLS http://hea-www.harvard.edu/RD/funtools/ IDLASTRO http://idlastro.gsfc.nasa.gov/ fitsy http://cfa-www.harvard.edu/~john/fitsy/ IUEDAC http://archive.stsci.edu/iue/iuedacfits.html Mathematica http://documents.wolfram.com/v5/Built-inFunctions/ GraphicsAndSound/ImportAndExport/ AdditionalInformation/Import.html MatLab http://www.mathworks.com/access/helpdesk/help/techdoc/ ref/fitsread.shtml?cmdname=fitsread",
      "ja": "CFITSIO http://heasarc.gsfc.nasa.gov/fitsio/ fitsTcl http://heasarc.gsfc.nasa.gov/ftools/fv/fitsTcl_home.html WCSLIB http://www.atnf.csiro.au/people/ mcalabre / WCS / PyFITS http://www.stsci.edu/resources/software_hardware/pyfits WCSTools http://tdc-www.harvard.edu/software/wcstools/ FUNTOOLS http://hea-www.harvard.edu/ RD / funtools / IDLASTRO http://idlastro.gsfc.nasa.gov/ fitsy http://cfa-www.harvard.edu/~john/fitsy/ IUEDAC http://archive.stsci.edu/iue/iuedacfits。 html Mathematica http://documents.wolfram.com/v5/Built-inFunctions/ GraphicsAndSound / ImportAndExport / AdditionalInformation / Import.html MatLab http://www.mathworks.com/access/helpdesk/help/techdoc/ ref / fitsread。 shtml？cmdname = fitsread"
    },
    {
      "indent": 3,
      "text": "Current lists of more APIs can be found at http://fits.gsfc.nasa.gov/fits_libraries.html",
      "ja": "より多くのAPIの現在のリストは、http：//fits.gsfc.nasa.gov/fits_libraries.htmlにあります。"
    },
    {
      "indent": 3,
      "text": "List of applications that use FITS are found in the IANA registrations of the media types.",
      "ja": "FITSを使用するアプリケーションのリストは、メディアタイプのIANA登録にあります。"
    },
    {
      "indent": 0,
      "text": "4.6. FITS File Conformance Testing",
      "section_title": true,
      "ja": "4.6.  FITSファイル適合性テスト"
    },
    {
      "indent": 3,
      "text": "FITS files can be tested for conformance to the Definition of FITS rules [NOST, WCS1, WCS2] with an application named \"fitsverify\", which is available at",
      "ja": "FITSファイルは、「fitsverify」という名前のアプリケーションを使用して、FITSルールの定義[NOST、WCS1、WCS2]への準拠をテストできます。"
    },
    {
      "indent": 3,
      "text": "http://heasarc.gsfc.nasa.gov/docs/software/ftools/fitsverify/",
      "ja": "http://heasarc.gsfc.nasa.gov/docs/software/ftools/fitsverify/"
    },
    {
      "indent": 3,
      "text": "in the form of executable binary files for Solaris, Linux, and Windows platforms, as well as in source code. Although \"fitsverify\" has not been endorsed by the IAUFWG, users should be aware that the designer of the program was the Secretary of the Technical Panel that produced the published FITS standard [NOST].",
      "ja": "Solaris、Linux、およびWindowsプラットフォーム用の実行可能バイナリファイルの形式、およびソースコード。 「fitsverify」はIAUFWGによって承認されていませんが、ユーザーは、プログラムの設計者が公開されたFITS標準[NOST]を作成したテクニカルパネルの長官であることを認識する必要があります。"
    },
    {
      "indent": 0,
      "text": "4.7. Archives That Distribute FITS Files",
      "section_title": true,
      "ja": "4.7.  FITSファイルを配布するアーカイブ"
    },
    {
      "indent": 3,
      "text": "As noted in section 4.3 of this RFC, massive (multi-terabyte) data archives that contain and/or distribute FITS files contribute to the stability of the FITS standard. There are numerous publicly available archives of FITS files derived from both space and ground-based observations that span the entire range of the electromagnetic spectrum from radio to gamma-ray wavelengths. The following are examples of such archives, in no particular order:",
      "ja": "このRFCのセクション4.3に記載されているように、FITSファイルを含むおよび/または配布する大規模な（マルチテラバイトの）データアーカイブは、FITS標準の安定性に貢献します。 宇宙からの観測と地上からの観測の両方から派生した、ラジオからガンマ線の波長までの電磁スペクトルの全範囲にわたるFITSファイルの公に利用可能なアーカイブが多数あります。 以下は、そのようなアーカイブの例であり、順不同です。"
    },
    {
      "indent": 3,
      "text": "Telescope(s)   URLs for archive access\n------------   ------------------------------------------------------\nKPNO,CTIO,..   http://archive.noao.edu/nsa/\nVLT,HST,..     http://archive.eso.org/\nSubaru         http://smoka.nao.ac.jp/\nSDSS           http://www.sdss.org/dr3/\nCFHT           http://cadcwww.dao.nrc.ca/cfht/cfht.html\nVLA,VLBA,GBT   http://e2e.aoc.nrao.edu/archive/archive_describe.html\nHST,MAST       http://archive.stsci.edu/\nHEASARC        http://heasarc.gsfc.nasa.gov/w3browse/\nChandra        http://cxc.harvard.edu/cda/\nLaPalma        http://archive.ast.cam.ac.uk/ingarch/\nBIMA           http://bimaarch.ncsa.uiuc.edu/\nKeck-DEIMOS    http://archive.deep.ucolick.org/\nComptonGRO     http://cossc.gsfc.nasa.gov/archive/index.html\nSpitzer,..     http://www.ipac.caltech.edu/\nAAT            http://www.aao.gov.au/archive/\nHIPASS         http://www.atnf.csiro.au/research/multibeam/\n                       multibeam.html\nJCMT           http://salish.dao.nrc.ca:8080/jcmt/intro.html\nCOBE,WMAP      http://lambda.gsfc.nasa.gov/\nEVN            http://www.jive.nl/archive/scripts/listarch.php\nGemini         http://gemini.ast.cam.ac.uk/sciops/data/dataIndex.html\nXMM-Newton     http://xmm.vilspa.esa.es/external/xmm_data_acc/xsa/",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "ja": "5. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "The general nature of the full FITS standard requires the use of the media type \"application/fits\". Nevertheless, the principal intent for a great many FITS files is to convey a single data array in the PHDU, and such arrays are very often 2-dimensional images. Several common image viewing applications already display single-HDU FITS files, and the prototypes for virtual observatory projects specify that data provided by web services be conveyed by the data array in the PHDU. These uses justify the registration of a second media type, namely \"image/fits\", for files which use the subset of the standard described by the original FITS standard paper [FITS].",
      "ja": "完全なFITS規格の一般的な性質は、メディアタイプ「アプリケーション/適合」の使用を必要とします。 それでも、非常に多くのFITSファイルの主な目的は、PHDUで単一のデータ配列を伝達することであり、そのような配列は2次元画像であることが非常に多いです。 いくつかの一般的な画像表示アプリケーションは、すでに単一のHDU FITSファイルを表示し、仮想天文台プロジェクトのプロトタイプは、Webサービスによって提供されるデータがPHDUのデータ配列によって伝達されることを指定します。 これらは、元のFITS標準ペーパー[FITS]で記述された標準のサブセットを使用するファイルに対して、2番目のメディアタイプ、つまり「image / fits」の登録を正当化します。"
    },
    {
      "indent": 3,
      "text": "We note that the media type \"image/gif\" [MIME2] admits raster images that are three dimensional, because animated GIF images contain two spatial dimensions and one temporal dimension. We note that the media types \"image/vnd.dwg\" and \"image/vnd.dxf\" admit data that include three-dimensional vectors and curves as well as objects created by using constructive solid geometry. Following these precedents for the \"image\" media type, we specify that \"image/fits\" MAY be used to describe FITS PHDUs that have other than two dimensions. We expect that most files described as \"image/fits\" will have two-dimensional (NAXIS=2) PHDUs.",
      "ja": "アニメーションGIF画像には2つの空間次元と1つの時間次元が含まれているため、メディアタイプ「image / gif」[MIME2]は3次元のラスター画像を許可します。 メディアタイプ「image / vnd.dwg」および「image / vnd.dxf」は、3次元のベクトルと曲線、および建設的なソリッドジオメトリを使用して作成されたオブジェクトを含むデータを許可します。 「イメージ」メディアタイプのこれらの先例に従い、「イメージ/フィット」を使用して、2次元以外のFITS PHDUを記述することができます。 「イメージ/フィット」として記述されたほとんどのファイルには、2次元（NAXIS = 2）PHDUが含まれることが予想されます。"
    },
    {
      "indent": 0,
      "text": "5.1. Registration of application/fits",
      "section_title": true,
      "ja": "5.1.  アプリケーション/適合の登録"
    },
    {
      "indent": 3,
      "text": "To: ietf-types@iana.org Subject: Registration of Standard MIME Media type application/fits",
      "ja": "宛先：ietf-types@iana.org件名：標準MIMEメディアタイプの登録application / fits"
    },
    {
      "indent": 3,
      "text": "MIME media type name: application",
      "ja": "MIMEメディアタイプ名：アプリケーション"
    },
    {
      "indent": 3,
      "text": "MIME subtype name: fits",
      "ja": "MIMEサブタイプ名：適合"
    },
    {
      "indent": 3,
      "text": "Required parameters: none",
      "ja": "必須パラメーター：なし"
    },
    {
      "indent": 3,
      "text": "Optional parameters: none",
      "ja": "オプションのパラメーター：なし"
    },
    {
      "indent": 3,
      "text": "Encoding considerations: binary",
      "ja": "エンコードに関する考慮事項：バイナリ"
    },
    {
      "indent": 3,
      "text": "FITS files can be quite large. When transferred via HTTP it may be efficient for the transaction to make use of content-coding or transfer-coding values such as \"gzip\", \"compress\", or \"deflate\".",
      "ja": "FITSファイルは非常に大きくなる可能性があります。 HTTPを介して転送する場合、トランザクションで「gzip」、「compress」、「deflate」などのコンテンツコーディングまたは転送コーディングの値を使用すると効率的です。"
    },
    {
      "indent": 3,
      "text": "Security considerations:",
      "ja": "セキュリティに関する考慮事項："
    },
    {
      "indent": 3,
      "text": "FITS provides a means of transporting arrays and tables of data and keyword/value pairs of metadata. The standard FITS keywords are either mandatory or reserved. Mandatory keywords provide information necessary for correct interpretation of the data; reserved keywords merely provide standard bits of metadata. As such, the current standard FITS keywords do not pose security risks.",
      "ja": "FITSは、データの配列とテーブル、およびメタデータのキーワードと値のペアを転送する手段を提供します。 標準のFITSキーワードは必須または予約済みです。 必須キーワードは、データの正しい解釈に必要な情報を提供します。 予約済みキーワードは、メタデータの標準ビットを提供するだけです。 そのため、現在の標準FITSキーワードはセキュリティリスクをもたらしません。"
    },
    {
      "indent": 3,
      "text": "A FITS file author may insert additional keywords with semantics that are not described by the standard. Parties exchanging FITS files may employ locally defined conventions that use various keywords and their values to induce actions on the part of the recipient. There are existing local conventions where such keywords are used to request the reading of other files and/or URIs. There are other local conventions where such keywords are used to modify the state of a telescope and/or instrument. The security implications of local conventions such as these SHOULD be analyzed by the parties employing them.",
      "ja": "FITSファイルの作成者は、標準で記述されていないセマンティクスを持つ追加のキーワードを挿入できます。 FITSファイルを交換する関係者は、さまざまなキーワードとその値を使用して受信者側のアクションを誘発するローカルに定義された規則を使用する場合があります。 他のファイルやURIの読み取りを要求するためにそのようなキーワードが使用される既存のローカル規則があります。 このようなキーワードを使用して望遠鏡や計器の状態を変更する他の地域の慣習があります。 これらのようなローカル規約のセキュリティの意味は、それらを使用する当事者によって分析されるべきです。"
    },
    {
      "indent": 3,
      "text": "Interoperability considerations:",
      "ja": "相互運用性に関する考慮事項："
    },
    {
      "indent": 3,
      "text": "FITS files have been successfully transported between wildly different computers since 1979. The difficulty most likely to be encountered by a FITS application is inability to acquire the computational resources required by a very large FITS file.",
      "ja": "FITSファイルは、1979年以来、大きく異なるコンピューター間で正常に転送されています。FITSアプリケーションで最も遭遇する可能性が高いのは、非常に大きなFITSファイルに必要な計算リソースを取得できないことです。"
    },
    {
      "indent": 3,
      "text": "Published specification:",
      "ja": "公開された仕様："
    },
    {
      "indent": 3,
      "text": "The specification for this content type is published as a series of papers in refereed astronomical journals:",
      "ja": "このコンテンツタイプの仕様は、参照される天文学ジャーナルに一連の論文として公開されています。"
    },
    {
      "indent": 3,
      "text": "Hanisch, R., et al., \"Definition of the Flexible Image Transport System (FITS)\", Astronomy & Astrophysics, 376, p. 359, 2001.",
      "ja": "Hanisch、R.、et al。、 \"Definition of the Flexible Image Transport System（FITS）\"、Astronomy＆Astrophysics、376、p。 359、2001。"
    },
    {
      "indent": 3,
      "text": "Greisen, E. and M. Calabretta, \"Representations of world coordinates in FITS\", Astronomy & Astrophysics, 395, p. 1061, 2002.",
      "ja": "Greisen、E。およびM. Calabretta、「FITSの世界座標の表現」、Astronomy＆Astrophysics、395、p。 1061、2002。"
    },
    {
      "indent": 3,
      "text": "Calabretta, M. and E. Greisen, \"Representations of celestial coordinates in FITS\", Astronomy & Astrophysics, 395, p. 1077, 2002.",
      "ja": "Calabretta、M。およびE. Greisen、「FITSでの天体座標の表現」、Astronomy＆Astrophysics、395、p。 1077、2002。"
    },
    {
      "indent": 3,
      "text": "Copies of these specifications can also be found via:",
      "ja": "これらの仕様のコピーは、次の方法でも入手できます。"
    },
    {
      "indent": 3,
      "text": "http://fits.gsfc.nasa.gov/ http://archive.stsci.edu/fits/ http://www.cv.nrao.edu/fits/ http://heasarc.gsfc.nasa.gov/docs/heasarc/fits.html",
      "ja": "http://fits.gsfc.nasa.gov/ http://archive.stsci.edu/fits/ http://www.cv.nrao.edu/fits/ http://heasarc.gsfc.nasa.gov/ docs / heasarc / fits.html"
    },
    {
      "indent": 3,
      "text": "Applications that use this media type:",
      "ja": "このメディアタイプを使用するアプリケーション："
    },
    {
      "indent": 3,
      "text": "There are many astronomical image viewing and data reduction applications including, but not limited to, the following list:",
      "ja": "次のリストを含むがこれらに限定されない天文学的な画像表示およびデータ削減アプリケーションが多数あります。"
    },
    {
      "indent": 3,
      "text": "IRAF http://iraf.noao.edu/ AIPS http://www.aoc.nrao.edu/aips/ AIPS++ http://aips2.nrao.edu/ MIDAS http://www.eso.org/projects/esomidas/ ds9 http://hea-www.harvard.edu/RD/ds9/ fv http://heasarc.gsfc.nasa.gov/ftools/fv/ Aladin http://aladin.u-strasbg.fr/ Starlink http://star-www.rl.ac.uk/ Miriad http://bima.astro.umd.edu/miriad/ STSDAS http://www.stsci.edu/resources/software_hardware/stsdas PROS http://hea-www.harvard.edu/PROS/pros.html CIAO http://cxc.harvard.edu/ciao/ XANADU http://heasarc.gsfc.nasa.gov/docs/xanadu/xanadu.html HESSI http://hesperia.gsfc.nasa.gov/ssw/hessi/doc/ FITSview http://www.nrao.edu/software/fitsview/ XMM-SAS http://xmm.vilspa.esa.es/external/xmm_sw_cal/sas_frame.shtml",
      "ja": "IRAF http://iraf.noao.edu/ AIPS http://www.aoc.nrao.edu/aips/ AIPS ++ http://aips2.nrao.edu/ MIDAS http://www.eso.org/projects/ esomidas / ds9 http://hea-www.harvard.edu/RD/ds9/ fv http://heasarc.gsfc.nasa.gov/ftools/fv/ Aladin http://aladin.u-strasbg.fr/ Starlink http://star-www.rl.ac.uk/ Miriad http://bima.astro.umd.edu/miriad/ STSDAS http://www.stsci.edu/resources/software_hardware/stsdas PROS http：// hea-www.harvard.edu/PROS/pros.html CIAO http://cxc.harvard.edu/ciao/ XANADU http://heasarc.gsfc.nasa.gov/docs/xanadu/xanadu.html HESSI http：/ /hesperia.gsfc.nasa.gov/ssw/hessi/doc/ FITSview http://www.nrao.edu/software/fitsview/ XMM-SAS http://xmm.vilspa.esa.es/external/xmm_sw_cal/sas_frame .shtml"
    },
    {
      "indent": 3,
      "text": "At the present time many of these applications are not designed to support use as viewers of \"application/fits\" files in association with web browsers.",
      "ja": "現時点では、これらのアプリケーションの多くは、Webブラウザーに関連する「アプリケーション/適合」ファイルのビューアーとしての使用をサポートするようには設計されていません。"
    },
    {
      "indent": 3,
      "text": "Additional information:",
      "ja": "追加情報："
    },
    {
      "indent": 3,
      "text": "A FITS file described with the media type \"application/fits\" SHOULD conform to the published standards for FITS files as determined by convention and agreement within the international FITS community. No other constraints are placed on the content of a file described as \"application/fits\".",
      "ja": "メディアタイプ「application / fits」で記述されたFITSファイルは、国際FITSコミュニティ内の慣例および合意によって決定されるFITSファイルの公開された標準に準拠する必要があります。 「application / fits」として記述されるファイルのコンテンツには、他の制約はありません。"
    },
    {
      "indent": 3,
      "text": "A FITS file described with the media type \"application/fits\" may have an arbitrary number of conforming extension header and data units (XHDUs) that follow its mandatory primary header and data unit (PHDU). The XHDUs may be one of the standard types (\"IMAGE\", \"TABLE\", and \"BINTABLE\") or any other type that satisfies the \"Requirements for Conforming Extensions\" (section 4.4.1 of [NOST]). The PHDU or any \"IMAGE\" XHDU may contain zero to 999 dimensions with zero or more pixels along each dimension.",
      "ja": "メディアタイプ「application / fits」で記述されたFITSファイルには、必須のプライマリヘッダーおよびデータユニット（PHDU）に続く任意の数の適合拡張ヘッダーおよびデータユニット（XHDU）が含まれる場合があります。 XHDUは、標準タイプ（「IMAGE」、「TABLE」、および「BINTABLE」）のいずれか、または「適合拡張の要件」（[NOST]のセクション4.4.1）を満たす他のタイプのいずれかです。 PHDUまたは「IMAGE」XHDUには、各次元に沿って0個以上のピクセルを含む0〜999個の次元を含めることができます。"
    },
    {
      "indent": 3,
      "text": "The PHDU may use the random groups convention, in which the dimension of the first axis is zero and the keywords GROUPS, PCOUNT and GCOUNT appear in the header. NAXIS1=0 and GROUPS=T is the signature of random groups; see section 7 of the Definition of FITS paper [NOST].",
      "ja": "PHDUはランダムグループの規則を使用できます。この規則では、最初の軸の次元がゼロで、キーワードGROUPS、PCOUNT、GCOUNTがヘッダーに表示されます。 NAXIS1 = 0およびGROUPS = Tは、ランダムグループの署名です。 FITSペーパーの定義のセクション7 [NOST]を参照してください。"
    },
    {
      "indent": 3,
      "text": "Recommendations for application writers:",
      "ja": "アプリケーション作成者向けの推奨事項："
    },
    {
      "indent": 3,
      "text": "An application intended to handle \"application/fits\" SHOULD be able to provide a user with a manifest of all of the HDUs that are present in the file and with all of the keyword/value pairs from each of the HDUs.",
      "ja": "「アプリケーション/適合」を処理することを目的としたアプリケーションは、ファイルに存在するすべてのHDUのマニフェストと、各HDUからのすべてのキーワード/値のペアをユーザーに提供できる必要があります。"
    },
    {
      "indent": 3,
      "text": "An application intended to handle \"application/fits\" SHOULD be prepared to encounter XHDUs that contain either ASCII or binary tables, and to provide a user with access to their elements.",
      "ja": "「アプリケーション/適合」を処理することを意図したアプリケーションは、ASCIIテーブルまたはバイナリテーブルのいずれかを含むXHDUに遭遇し、ユーザーに要素へのアクセスを提供するように準備する必要があります。"
    },
    {
      "indent": 3,
      "text": "An application which can modify FITS files or retrieve FITS files from an external service SHOULD be capable of writing such files to a local storage medium.",
      "ja": "FITSファイルを変更したり、外部サービスからFITSファイルを取得できるアプリケーションは、そのようなファイルをローカルストレージメディアに書き込むことができる必要があります。"
    },
    {
      "indent": 3,
      "text": "Complete interpretation of the meaning and intended use of the data in each of the HDUs typically requires the use of heuristics that attempt to ascertain which local conventions were used by the author of the FITS file.",
      "ja": "各HDUのデータの意味と使用目的の完全な解釈には、通常、FITSファイルの作成者が使用したローカル規則を確認しようとするヒューリスティックの使用が必要です。"
    },
    {
      "indent": 3,
      "text": "As examples, files with media type \"application/fits\" might contain any of the following contents:",
      "ja": "例として、メディアタイプが「application / fits」のファイルには、次のコンテンツのいずれかが含まれます。"
    },
    {
      "indent": 3,
      "text": "- An empty PHDU (containing zero data elements) followed by a table HDU that contains a catalog of celestial objects.",
      "ja": "-天体のカタログを含むテーブルHDUが後に続く空のPHDU（ゼロのデータ要素を含む）。"
    },
    {
      "indent": 3,
      "text": "- An empty PHDU followed by a table HDU that encodes a series of time-tagged photon events from an exposure using an X-ray detector.",
      "ja": "-空のPHDUの後に、X線検出器を使用した露出からの一連の時間タグ付き光子イベントをエンコードするテーブルHDUが続きます。"
    },
    {
      "indent": 3,
      "text": "- An empty PHDU followed by a series of IMAGE HDUs containing data from an exposure taken by a mosaic of CCD detectors.",
      "ja": "-空のPHDUの後に、CCD検出器のモザイクによって撮影された露出からのデータを含む一連のIMAGE HDUが続きます。"
    },
    {
      "indent": 3,
      "text": "- An empty PHDU followed by a series of table HDUs that contain a snapshot of the state of a relational database.",
      "ja": "-空のPHDUの後に、リレーショナルデータベースの状態のスナップショットを含む一連のテーブルHDUが続きます。"
    },
    {
      "indent": 3,
      "text": "- A PHDU containing a single image along with keyword/value pairs of metadata.",
      "ja": "-メタデータのキーワード/値ペアとともに単一の画像を含むPHDU。"
    },
    {
      "indent": 3,
      "text": "- A PHDU with NAXIS1=0 and GROUPS=T followed by random groups data records of complex fringe visibilities",
      "ja": "-NAXIS1 = 0およびGROUPS = TのPHDUと、それに続く複雑なフリンジ可視性のランダムグループデータレコード"
    },
    {
      "indent": 3,
      "text": "Magic number(s): \"SIMPLE = T\"",
      "ja": "マジックナンバー： \"SIMPLE = T\""
    },
    {
      "indent": 3,
      "text": "Jeff Uphoff of the National Radio Astronomy Observatory (NRAO) has contributed database entries for the magic number file which is used by the Unix \"file\" command. Magic number files with these entries are distributed with a variety of Unix-like operating systems. In addition to recognizing a FITS file using the string given above, the Uphoff entries also recognize the data type of the pixels in the PHDU.",
      "ja": "National Radio Astronomy Observatory（NRAO）のJeff Uphoffは、Unixの「file」コマンドで使用されるマジックナンバーファイルのデータベースエントリを提供しました。 これらのエントリを持つマジックナンバーファイルは、さまざまなUnixライクなオペレーティングシステムで配布されます。 上記の文字列を使用してFITSファイルを認識することに加えて、UphoffエントリはPHDUのピクセルのデータ型も認識します。"
    },
    {
      "indent": 3,
      "text": "File extension(s): fits",
      "ja": "ファイル拡張子：適合"
    },
    {
      "indent": 3,
      "text": "This file extension SHOULD NOT be interpreted as a prescription.",
      "ja": "このファイル拡張子は、処方箋として解釈されるべきではありません。"
    },
    {
      "indent": 3,
      "text": "The FITS standard originated in the era when files were stored and exchanged via magnetic tape; it does not prescribe any nomenclature for files on disk. Various sites within the FITS community have long-established practices where files are presumed to be FITS by context. File extensions used at such sites commonly indicate content of the file instead of the data format.",
      "ja": "FITS標準は、ファイルが磁気テープを介して保存および交換された時代に始まりました。 ディスク上のファイルの命名法は規定していません。 FITSコミュニティ内のさまざまなサイトには、ファイルがコンテキストによってFITSであると推定される慣習があります。 そのようなサイトで使用されるファイル拡張子は、通常、データ形式ではなくファイルの内容を示します。"
    },
    {
      "indent": 3,
      "text": "In the absence of other information it is reasonably safe to presume that a file name ending in \".fits\" is intended to be a FITS file. Nevertheless, there are other commonly used extensions; e.g., \".fit\", \".fts\", and many others not suitable for listing in a media type registration.",
      "ja": "他の情報がない場合、「。fits」で終わるファイル名はFITSファイルであると想定するのが合理的に安全です。 それでも、一般的に使用される拡張機能は他にもあります。 たとえば、「。fit」、「。fts」など、メディアタイプ登録にリストするのに適していない他の多くのもの。"
    },
    {
      "indent": 3,
      "text": "Intended usage: Common",
      "ja": "使用目的：共通"
    },
    {
      "indent": 3,
      "text": "Persons to contact for further information:",
      "ja": "詳細について連絡する人："
    },
    {
      "indent": 6,
      "text": "\"Steve Allen\" <sla@ucolick.org> \"Don Wells\" <dwells@nrao.edu>",
      "ja": "「スティーブアレン」<sla@ucolick.org>「ドンウェルズ」<dwells@nrao.edu>"
    },
    {
      "indent": 3,
      "text": "Author/Change controller:",
      "ja": "作成者/変更コントローラー："
    },
    {
      "indent": 6,
      "text": "\"Steve Allen\" <sla@ucolick.org>",
      "ja": "「スティーブアレン」<sla@ucolick.org>"
    },
    {
      "indent": 3,
      "text": "The IAU FITS Working Group may authorize changes to this document.",
      "ja": "IAU FITSワーキンググループは、このドキュメントの変更を許可する場合があります。"
    },
    {
      "indent": 0,
      "text": "5.2. Registration of image/fits",
      "section_title": true,
      "ja": "5.2.  画像/フィットの登録"
    },
    {
      "indent": 3,
      "text": "To: ietf-types@iana.org Subject: Registration of Standard MIME Media type image/fits",
      "ja": "宛先：ietf-types@iana.org件名：標準MIMEメディアタイプimage / fitsの登録"
    },
    {
      "indent": 3,
      "text": "MIME media type name: image",
      "ja": "MIMEメディアタイプ名：画像"
    },
    {
      "indent": 3,
      "text": "MIME subtype name: fits",
      "ja": "MIMEサブタイプ名：適合"
    },
    {
      "indent": 3,
      "text": "Required parameters: none",
      "ja": "必須パラメーター：なし"
    },
    {
      "indent": 3,
      "text": "Optional parameters: none",
      "ja": "オプションのパラメーター：なし"
    },
    {
      "indent": 3,
      "text": "Encoding considerations: binary",
      "ja": "エンコードに関する考慮事項：バイナリ"
    },
    {
      "indent": 3,
      "text": "FITS files can be quite large. When transferred via HTTP it may be efficient for the transaction to make use of content-coding or transfer-coding values such as \"gzip\", \"compress\", or \"deflate\".",
      "ja": "FITSファイルは非常に大きくなる可能性があります。 HTTPを介して転送する場合、トランザクションで「gzip」、「compress」、「deflate」などのコンテンツコーディングまたは転送コーディングの値を使用すると効率的です。"
    },
    {
      "indent": 3,
      "text": "Security considerations:",
      "ja": "セキュリティに関する考慮事項："
    },
    {
      "indent": 3,
      "text": "FITS provides a means of transporting arrays and tables of data and keyword/value pairs of metadata. The standard FITS keywords are either mandatory or reserved. Mandatory keywords provide information necessary for correct interpretation of the data; reserved keywords merely provide standard bits of metadata. As such, the current standard FITS keywords do not pose security risks.",
      "ja": "FITSは、データの配列とテーブル、およびメタデータのキーワードと値のペアを転送する手段を提供します。 標準のFITSキーワードは必須または予約済みです。 必須キーワードは、データの正しい解釈に必要な情報を提供します。 予約済みキーワードは、メタデータの標準ビットを提供するだけです。 そのため、現在の標準FITSキーワードはセキュリティリスクをもたらしません。"
    },
    {
      "indent": 3,
      "text": "A FITS file author may insert additional keywords with semantics that are not described by the standard. Parties exchanging FITS files may employ locally defined conventions that use various keywords and their values to induce actions on the part of the recipient. There are existing local conventions where such keywords are used to request the reading of other files and/or URIs. There are other local conventions where such keywords are used to modify the state of a telescope and/or instrument. The security implications of local conventions such as these SHOULD be analyzed by the parties employing them.",
      "ja": "FITSファイルの作成者は、標準で記述されていないセマンティクスを持つ追加のキーワードを挿入できます。 FITSファイルを交換する関係者は、さまざまなキーワードとその値を使用して受信者側のアクションを誘発するローカルに定義された規則を使用する場合があります。 他のファイルやURIの読み取りを要求するためにそのようなキーワードが使用される既存のローカル規則があります。 このようなキーワードを使用して望遠鏡や計器の状態を変更する他の地域の慣習があります。 これらのようなローカル規約のセキュリティの意味は、それらを使用する当事者によって分析されるべきです。"
    },
    {
      "indent": 3,
      "text": "Interoperability considerations:",
      "ja": "相互運用性に関する考慮事項："
    },
    {
      "indent": 3,
      "text": "FITS files have been successfully transported between wildly different computers since 1979. The difficulty most likely to be encountered by a FITS application is inability to acquire the computational resources required by a very large FITS file.",
      "ja": "FITSファイルは、1979年以来、大きく異なるコンピューター間で正常に転送されています。FITSアプリケーションで最も遭遇する可能性が高いのは、非常に大きなFITSファイルに必要な計算リソースを取得できないことです。"
    },
    {
      "indent": 3,
      "text": "Published specification:",
      "ja": "公開された仕様："
    },
    {
      "indent": 3,
      "text": "The specification for this content type is published as a series of papers in refereed astronomical journals:",
      "ja": "このコンテンツタイプの仕様は、参照される天文学ジャーナルに一連の論文として公開されています。"
    },
    {
      "indent": 3,
      "text": "Hanisch, R., et al., \"Definition of the Flexible Image Transport System (FITS)\", Astronomy & Astrophysics, 376, p. 359, 2001.",
      "ja": "Hanisch、R.、et al。、 \"Definition of the Flexible Image Transport System（FITS）\"、Astronomy＆Astrophysics、376、p。 359、2001。"
    },
    {
      "indent": 3,
      "text": "Greisen, E. and M. Calabretta, \"Representations of world coordinates in FITS\", Astronomy & Astrophysics, 395, p. 1061, 2002.",
      "ja": "Greisen、E。およびM. Calabretta、「FITSの世界座標の表現」、Astronomy＆Astrophysics、395、p。 1061、2002。"
    },
    {
      "indent": 3,
      "text": "Calabretta, M. and E. Greisen, \"Representations of celestial coordinates in FITS\", Astronomy & Astrophysics, 395, p. 1077, 2002.",
      "ja": "Calabretta、M。およびE. Greisen、「FITSでの天体座標の表現」、Astronomy＆Astrophysics、395、p。 1077、2002。"
    },
    {
      "indent": 3,
      "text": "Copies of these specifications can also be found via:",
      "ja": "これらの仕様のコピーは、次の方法でも入手できます。"
    },
    {
      "indent": 3,
      "text": "http://fits.gsfc.nasa.gov/ http://archive.stsci.edu/fits/ http://www.cv.nrao.edu/fits/ http://heasarc.gsfc.nasa.gov/docs/heasarc/fits.html",
      "ja": "http://fits.gsfc.nasa.gov/ http://archive.stsci.edu/fits/ http://www.cv.nrao.edu/fits/ http://heasarc.gsfc.nasa.gov/ docs / heasarc / fits.html"
    },
    {
      "indent": 3,
      "text": "Applications that use this media type:",
      "ja": "このメディアタイプを使用するアプリケーション："
    },
    {
      "indent": 3,
      "text": "There are many astronomical image viewing and data reduction applications including, but not limited to, the following list:",
      "ja": "次のリストを含むがこれらに限定されない天文学的な画像表示およびデータ削減アプリケーションが多数あります。"
    },
    {
      "indent": 3,
      "text": "IRAF http://iraf.noao.edu/ AIPS http://www.aoc.nrao.edu/aips/ AIPS++ http://aips2.nrao.edu/ MIDAS http://www.eso.org/projects/esomidas/ ds9 http://hea-www.harvard.edu/RD/ds9/ fv http://heasarc.gsfc.nasa.gov/ftools/fv/ Aladin http://aladin.u-strasbg.fr/ Starlink http://star-www.rl.ac.uk/ Miriad http://bima.astro.umd.edu/miriad/ STSDAS http://www.stsci.edu/resources/software_hardware/stsdas PROS http://hea-www.harvard.edu/PROS/pros.html CIAO http://cxc.harvard.edu/ciao/ XANADU http://heasarc.gsfc.nasa.gov/docs/xanadu/xanadu.html",
      "ja": "IRAF http://iraf.noao.edu/ AIPS http://www.aoc.nrao.edu/aips/ AIPS ++ http://aips2.nrao.edu/ MIDAS http://www.eso.org/projects/ esomidas / ds9 http://hea-www.harvard.edu/RD/ds9/ fv http://heasarc.gsfc.nasa.gov/ftools/fv/ Aladin http://aladin.u-strasbg.fr/ Starlink http://star-www.rl.ac.uk/ Miriad http://bima.astro.umd.edu/miriad/ STSDAS http://www.stsci.edu/resources/software_hardware/stsdas PROS http：// hea-www.harvard.edu/PROS/pros.html CIAO http://cxc.harvard.edu/ciao/ XANADU http://heasarc.gsfc.nasa.gov/docs/xanadu/xanadu.html"
    },
    {
      "indent": 3,
      "text": "HESSI http://hesperia.gsfc.nasa.gov/ssw/hessi/doc/ FITSview http://www.nrao.edu/software/fitsview/ XMM-SAS http://xmm.vilspa.esa.es/external/xmm_sw_cal/sas_frame.shtml",
      "ja": "HESSI http://hesperia.gsfc.nasa.gov/ssw/hessi/doc/ FITSview http://www.nrao.edu/software/fitsview/ XMM-SAS http://xmm.vilspa.esa.es/external /xmm_sw_cal/sas_frame.shtml"
    },
    {
      "indent": 3,
      "text": "Non-astronomical FITS image display applications include:",
      "ja": "非天文学的なFITS画像表示アプリケーションには以下が含まれます。"
    },
    {
      "indent": 3,
      "text": "netpbm http://netpbm.sourceforge.net/ gimp http://www.gimp.org/ IDL http://www.rsinc.com/ ImageMagick http://www.imagemagick.com/ Mathematica http://www.wolfram.com/ MatLab http://www.mathworks.com/ xv http://www.trilon.com/xv/xv.html",
      "ja": "netpbm http://netpbm.sourceforge.net/ gimp http://www.gimp.org/ IDL http://www.rsinc.com/ ImageMagick http://www.imagemagick.com/ Mathematica http：// www .wolfram.com / MatLab http://www.mathworks.com/ xv http://www.trilon.com/xv/xv.html"
    },
    {
      "indent": 3,
      "text": "There are also two FITS plug-ins for Adobe Photoshop (http://www.adobe.com/products/photoshop/), available at http://astroshed.com/fitsplug/fitsplug.htm and http://www.spacetelescope.org/projects/fits_liberator/",
      "ja": "Adobe Photoshop用の2つのFITSプラグイン（http://www.adobe.com/products/photoshop/）もあり、http：//astroshed.com/fitsplug/fitsplug.htmおよびhttp：// wwwで入手できます。 spacetelescope.org/projects/fits_liberator/"
    },
    {
      "indent": 3,
      "text": "At the present time many of the applications listed above are not designed to support use as viewers of \"image/fits\" files in association with web browsers.",
      "ja": "現時点では、上記のアプリケーションの多くは、Webブラウザーに関連する「イメージ/フィット」ファイルのビューアーとしての使用をサポートするようには設計されていません。"
    },
    {
      "indent": 3,
      "text": "Additional information:",
      "ja": "追加情報："
    },
    {
      "indent": 3,
      "text": "A FITS file described with the media type \"image/fits\" SHOULD have a PHDU with positive integer values for the NAXIS and NAXISn keywords, and hence SHOULD contain at least one pixel. Files with 4 or more non-degenerate axes (NAXISn>1) SHOULD be described as \"application/fits\", not as \"image/fits\". (In rare cases it may be appropriate to describe a NULL image -- a dataless container for FITS keywords, with NAXIS=0 or NAXISn=0 -- or an image with 4+ non-degenerate axes as \"image/fits\" but this usage is discouraged because such files may confuse simple image viewer applications.)",
      "ja": "メディアタイプ「image / fits」で記述されたFITSファイルには、NAXISおよびNAXISnキーワードの正の整数値を持つPHDUが含まれている必要があります。したがって、少なくとも1つのピクセルが含まれている必要があります。 4つ以上の非縮退軸（NAXISn> 1）を持つファイルは、「image / fits」ではなく「application / fits」として記述される必要があります。 （まれに、NAXIS = 0またはNAXISn = 0のFITSキーワードのデータレスコンテナーであるNULLイメージ、または「image / fits」として4+の非縮退軸を持つイメージを記述することが適切な場合がありますが、 このようなファイルは単純な画像ビューアアプリケーションを混乱させる可能性があるため、使用は推奨されません。）"
    },
    {
      "indent": 3,
      "text": "FITS files declared as \"image/fits\" MAY also have one or more conforming XHDUs following their PHDUs. These extension HDUs MAY contain standard, non-linear, world coordinate system (WCS) information in the form of tables or images. The extension HDUs MAY also contain other, non-standard metadata pertaining to the image in the PHDU in the forms of keywords and tables.",
      "ja": "「イメージ/フィット」として宣言されたFITSファイルには、PHDUの後に1つ以上の適合XHDUが存在する場合があります。 これらの拡張HDUには、テーブルまたは画像の形式で、標準的な非線形の世界座標系（WCS）情報が含まれている場合があります。 拡張HDUには、キーワードおよびテーブルの形式でPHDUの画像に関連する他の非標準のメタデータも含めることができます。"
    },
    {
      "indent": 3,
      "text": "A FITS file described with the media type \"image/fits\" SHOULD be principally intended to communicate the single data array in the PHDU. This means that \"image/fits\" SHOULD NOT be applied to FITS files containing MEF (multi-exposure-frame) mosaic images. Also, random groups files MUST be described as \"application/fits\" and not as \"image/fits\".",
      "ja": "メディアタイプ「image / fits」で記述されたFITSファイルは、主にPHDUの単一のデータアレイと通信することを意図する必要があります。 これは、「画像/適合」が、MEF（多重露光フレーム）モザイク画像を含むFITSファイルに適用されるべきではないことを意味します。 また、ランダムグループファイルは、「image / fits」ではなく「application / fits」として記述される必要があります。"
    },
    {
      "indent": 3,
      "text": "A FITS file described with the media type \"image/fits\" is also valid as a file of media type \"application/fits\". The choice of classification depends on the context and intended usage.",
      "ja": "メディアタイプ「image / fits」で記述されたFITSファイルは、メディアタイプ「application / fits」のファイルとしても有効です。 分類の選択は、コンテキストと使用目的によって異なります。"
    },
    {
      "indent": 3,
      "text": "Recommendations for application writers:",
      "ja": "アプリケーション作成者向けの推奨事項："
    },
    {
      "indent": 3,
      "text": "An application that is intended to handle \"image/fits\" SHOULD be able to provide a user with a manifest of all of the HDUs that are present in the file and with all of the keyword/value pairs from each of the HDUs. An application writer MAY choose to ignore HDUs beyond the PHDU, but even in this case the application SHOULD be able to present the user with the keyword/value pairs from the PHDU.",
      "ja": "「イメージ/フィット」を処理することを目的としたアプリケーションは、ファイルに存在するすべてのHDUのマニフェストと、各HDUのすべてのキーワード/値のペアをユーザーに提供できる必要があります。 アプリケーション作成者は、PHDUを超えるHDUを無視することを選択できますが、この場合でも、アプリケーションはPHDUのキーワード/値のペアをユーザーに提示できる必要があります。"
    },
    {
      "indent": 3,
      "text": "Note that an application intended to render \"image/fits\" for viewing by a user has significantly more responsibility than an application intended to handle, e.g., \"image/tiff\" or \"image/gif\". FITS data arrays contain elements which typically represent the values of a physical quantity at some coordinate location. Consequently they need not contain any pixel rendering information in the form of transfer functions, and there is no mechanism for color look-up tables. An application SHOULD provide this functionality, either statically using a more or less sophisticated algorithm, or interactively allowing a user various degrees of choice.",
      "ja": "ユーザーが表示するための「イメージ/フィット」をレンダリングすることを目的としたアプリケーションは、たとえば「image / tiff」または「image / gif」を処理することを目的としたアプリケーションよりもかなり責任があることに注意してください。 FITSデータ配列には、通常、ある座標位置での物理量の値を表す要素が含まれています。 そのため、伝達関数の形式でピクセルレンダリング情報を含める必要はなく、カラールックアップテーブルのメカニズムもありません。 アプリケーションは、この機能を、多少洗練されたアルゴリズムを静的に使用するか、ユーザーにさまざまな程度の選択をインタラクティブに許可する必要があります。"
    },
    {
      "indent": 3,
      "text": "Furthermore, the elements in a FITS data array may be integers or floating-point numbers. The dynamic range of the data array values may exceed that of the display medium and the eye, and their distribution may be highly nonuniform. Logarithmic, square-root, and quadratic transfer functions along with histogram equalization techniques have proved helpful for rendering FITS data arrays. Some elements of the array may have values which indicate that their data are undefined or invalid; these should be rendered distinctly. Via WCS Paper I [WCS1] the standard permits \"CTYPEnnn = 'COMPLEX'\" to assert that a data array contains complex numbers (future revisions might admit other elements such as quaternions or general tensors).",
      "ja": "さらに、FITSデータ配列の要素は、整数または浮動小数点数です。 データ配列値のダイナミックレンジは、表示媒体と目のダイナミックレンジを超える場合があり、それらの分布は非常に不均一になる場合があります。 対数、平方根、および二次の伝達関数とヒストグラム均等化手法は、FITSデータ配列のレンダリングに役立つことが証明されています。 配列の一部の要素には、データが未定義または無効であることを示す値が含まれる場合があります。 これらは明確にレンダリングする必要があります。 WCS Paper I [WCS1]を介して、標準では \"CTYPEnnn = 'COMPLEX'\"により、データ配列に複素数が含まれていることを表明することが許可されています（将来の改訂では、四元数や一般テンソルなどの他の要素が認められる場合があります）。"
    },
    {
      "indent": 3,
      "text": "Three-dimensional data arrays (NAXIS=3 with NAXIS1, NAXIS2 and NAXIS3 > 1) are of special interest. Applications intended to handle \"image/fits\" MAY default to displaying the first 2D plane of such an image cube, or they MAY default to presenting such an image in a fashion akin to that used for an animated GIF, or they MAY present the data cube as a mosaic of \"thumbnail\" images. Even in the absence of WCS indication of a temporal axis the time-lapse movie-looping display technique can be effective, and application writers SHOULD consider offering it for all three-dimensional arrays.",
      "ja": "3次元データ配列（NAXIS1、NAXIS2、NAXIS3が1を超えるNAXIS = 3）が特に重要です。 「画像/フィット」を処理するアプリケーションは、デフォルトでそのような画像キューブの最初の2Dプレーンを表示するか、デフォルトでアニメーションGIFに使用されるのと同様の方法でそのような画像を表示するか、データを表示することができます 「サムネイル」画像のモザイクとしての立方体。 時間軸のWCS表示がない場合でも、タイムラプスムービーループ表示技術は効果的である可能性があり、アプリケーション作成者は、すべての3次元配列に提供することを検討する必要があります。"
    },
    {
      "indent": 3,
      "text": "An \"image/fits\" PHDU with NAXIS=1 is describing a one-dimensional entity such as a spectrum or a time series. Applications intended to handle \"image/fits\" MAY default to displaying such an image as a graphical plot rather than as a two-dimensional picture with a single row.",
      "ja": "NAXIS = 1の「イメージ/フィット」PHDUは、スペクトルや時系列などの1次元のエンティティを表します。 「画像/フィット」を処理することを目的としたアプリケーションは、デフォルトでは、そのような画像を単一行の2次元画像としてではなく、グラフィカルプロットとして表示する場合があります。"
    },
    {
      "indent": 3,
      "text": "An application that cannot handle an image with dimensionality other than 2 SHOULD gracefully indicate its limitations to its users when it encounters NAXIS=1 or NAXIS=3 cases, while still providing access to the keyword/value pairs.",
      "ja": "2以外の次元の画像を処理できないアプリケーションは、NAXIS = 1またはNAXIS = 3のケースが発生したときに、キーワード/値のペアへのアクセスを提供しながら、ユーザーにその制限を適切に示す必要があります。"
    },
    {
      "indent": 3,
      "text": "FITS files with degenerate axes (i.e., one or more NAXISn=1) MAY be described as \"image/fits\", but the first axes SHOULD be non-degenerate (i.e., the degenerate axes SHOULD be the highest dimensions). An algorithm designed to render only two-dimensional images will be capable of displaying such an NAXIS=3 or NAXIS=4 FITS array that has one or two of the axes consisting of a single pixel, and an application writer SHOULD consider coding this capability into the application. Writers of new applications which generate FITS files intended to be described as \"image/fits\" SHOULD consider using the WCSAXES keyword [WCS1] to declare the dimensionality of such degenerate axes, so that NAXIS can be used to convey the number of non-degenerate axes.",
      "ja": "縮退軸（つまり、1つ以上のNAXISn = 1）を持つFITSファイルは、「イメージ/フィット」として記述できますが、最初の軸は非縮退である必要があります（つまり、縮退軸は最高の次元である必要があります）。 2次元画像のみをレンダリングするように設計されたアルゴリズムは、単一ピクセルで構成される1つまたは2つの軸を持つNAXIS = 3またはNAXIS = 4 FITS配列を表示でき、アプリケーション作成者はこの機能のコーディングを検討する必要があります アプリケーション。 「イメージ/フィット」として記述されるFITSファイルを生成する新しいアプリケーションの作成者は、NACSを使用して非縮退の数を伝えることができるように、WCSAXESキーワード[WCS1]を使用してこのような縮退軸の次元を宣言することを検討する必要があります 軸。"
    },
    {
      "indent": 3,
      "text": "Magic number(s): \"SIMPLE = T\"",
      "ja": "マジックナンバー： \"SIMPLE = T\""
    },
    {
      "indent": 3,
      "text": "Jeff Uphoff of the National Radio Astronomy Observatory (NRAO) has contributed database entries for the magic number file which is used by the Unix \"file\" command. Magic number files with these entries are distributed with a variety of Unix-like operating systems. In addition to recognizing a FITS file using the string given above, the Uphoff entries also recognize the data type of the pixels in the PHDU.",
      "ja": "National Radio Astronomy Observatory（NRAO）のJeff Uphoffは、Unixの「file」コマンドで使用されるマジックナンバーファイルのデータベースエントリを提供しました。 これらのエントリを持つマジックナンバーファイルは、さまざまなUnixライクなオペレーティングシステムで配布されます。 上記の文字列を使用してFITSファイルを認識することに加えて、UphoffエントリはPHDUのピクセルのデータ型も認識します。"
    },
    {
      "indent": 3,
      "text": "File extension(s): fits",
      "ja": "ファイル拡張子：適合"
    },
    {
      "indent": 3,
      "text": "This file extension SHOULD NOT be interpreted as a prescription.",
      "ja": "このファイル拡張子は、処方箋として解釈されるべきではありません。"
    },
    {
      "indent": 3,
      "text": "The FITS standard originated in the era when files were stored and exchanged via magnetic tape; it does not prescribe any nomenclature for files on disk. Various sites within the FITS community have long-established practices where files are presumed to be FITS by context. File extensions used at such sites commonly indicate content of the file instead of the data format.",
      "ja": "FITS標準は、ファイルが磁気テープを介して保存および交換された時代に始まりました。 ディスク上のファイルの命名法は規定していません。 FITSコミュニティ内のさまざまなサイトには、ファイルがコンテキストによってFITSであると推定される慣習があります。 そのようなサイトで使用されるファイル拡張子は、通常、データ形式ではなくファイルの内容を示します。"
    },
    {
      "indent": 3,
      "text": "In the absence of other information it is reasonably safe to presume that a file name ending in \".fits\" is intended to be a FITS file. Nevertheless, there are other commonly used extensions; e.g., \".fit\", \".fts\", and many others not suitable for listing in a media type registration.",
      "ja": "他の情報がない場合、「。fits」で終わるファイル名はFITSファイルであると想定するのが合理的に安全です。 それでも、一般的に使用される拡張機能は他にもあります。 たとえば、「。fit」、「。fts」など、メディアタイプ登録にリストするのに適していない他の多くのもの。"
    },
    {
      "indent": 3,
      "text": "Intended usage: Common",
      "ja": "使用目的：共通"
    },
    {
      "indent": 3,
      "text": "Persons to contact for further information:",
      "ja": "詳細について連絡する人："
    },
    {
      "indent": 6,
      "text": "\"Steve Allen\" <sla@ucolick.org> \"Don Wells\" <dwells@nrao.edu>",
      "ja": "「スティーブアレン」<sla@ucolick.org>「ドンウェルズ」<dwells@nrao.edu>"
    },
    {
      "indent": 3,
      "text": "Author/Change controller:",
      "ja": "作成者/変更コントローラー："
    },
    {
      "indent": 6,
      "text": "\"Steve Allen\" <sla@ucolick.org>",
      "ja": "「スティーブアレン」<sla@ucolick.org>"
    },
    {
      "indent": 3,
      "text": "The IAU FITS Working Group may authorize changes to this document.",
      "ja": "IAU FITSワーキンググループは、このドキュメントの変更を許可する場合があります。"
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "ja": "6.参照"
    },
    {
      "indent": 0,
      "text": "6.1. Normative References",
      "section_title": true,
      "ja": "6.1.  規範的参考文献"
    },
    {
      "indent": 3,
      "text": "[Require] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[必須] Bradner、S。、「要件レベルを示すためにRFCで使用するキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[MIME1] Freed, N. and N. Borenstein, \"Multipurpose Internet Mail Extensions (MIME) Part One: Format of Internet Message Bodies\", RFC 2045, November 1996.",
      "ja": "[MIME1] Freed、N。およびN. Borenstein、「Multipurpose Internet Mail Extensions（MIME）Part One：Format of Internet Message Bodies」、RFC 2045、1996年11月"
    },
    {
      "indent": 3,
      "text": "[MIME2] Freed, N. and N. Borenstein, \"Multipurpose Internet Mail Extensions (MIME) Part Two: Media Types\", RFC 2046, November 1996.",
      "ja": "[MIME2] Freed、N。およびN. Borenstein、「Multipurpose Internet Mail Extensions（MIME）Part Two：Media Types」、RFC 2046、1996年11月。"
    },
    {
      "indent": 3,
      "text": "[MIME4] Freed, N., Klensin, J., and J. Postel, \"Multipurpose Internet Mail Extensions (MIME) Part Four: Registration Procedures\", BCP 13, RFC 2048, November 1996.",
      "ja": "[MIME4] Freed、N.、Klensin、J。、およびJ. Postel、「Multipurpose Internet Mail Extensions（MIME）Part Four：Registration Procedures」、BCP 13、RFC 2048、1996年11月。"
    },
    {
      "indent": 3,
      "text": "[HTTP] Fielding, R., Gettys, J., Mogul, J., Frystyk, H., Masinter, L., Leach, P., and T. Berners-Lee, \"Hypertext Transfer Protocol -- HTTP/1.1\", RFC 2616, June 1999.",
      "ja": "[HTTP] Fielding、R.、Gettys、J.、Mogul、J.、Frystyk、H.、Masinter、L.、Leach、P。、およびT. Berners-Lee、「ハイパーテキスト転送プロトコル-HTTP / 1.1」 、RFC 2616、1999年6月。"
    },
    {
      "indent": 3,
      "text": "[NOST] Hanisch, R., et al., \"Definition of the Flexible Image Transport System (FITS)\", Astronomy & Astrophysics, 376, p. 359, 2001.",
      "ja": "[NOST] Hanisch、R.、et al。、 \"Definition of the Flexible Image Transport System（FITS）\"、Astronomy＆Astrophysics、376、p。 359、2001。"
    },
    {
      "indent": 3,
      "text": "[WCS1] Greisen, E. and M. Calabretta, \"Representations of world coordinates in FITS\", Astronomy & Astrophysics, 395, p. 1061, 2002.",
      "ja": "[WCS1] Greisen、E.およびM. Calabretta、「FITSにおける世界座標の表現」、Astronomy＆Astrophysics、395、p。 1061、2002。"
    },
    {
      "indent": 3,
      "text": "[WCS2] Calabretta, M. and E. Greisen, \"Representations of celestial coordinates in FITS\", Astronomy & Astrophysics, 395, p. 1077, 2002.",
      "ja": "[WCS2] Calabretta、M。およびE. Greisen、「FITSの天体座標の表現」、Astronomy＆Astrophysics、395、p。 1077、2002。"
    },
    {
      "indent": 0,
      "text": "6.2. Informative References",
      "section_title": true,
      "ja": "6.2.  参考資料"
    },
    {
      "indent": 3,
      "text": "[FITS] Wells, D., et al., \"FITS: A Flexible Image Transport System\", Astronomy & Astrophysics Supplement, 44, p. 363, 1981.",
      "ja": "[FITS] Wells、D.、et al。、 \"FITS：A Flexible Image Transport System\"、Astronomy＆Astrophysics Supplement、44、p。 363、1981。"
    },
    {
      "indent": 3,
      "text": "[GROUPS] Greisen, E. and R. Harten, \"An extension of FITS for groups of small arrays of data\", Astronomy & Astrophysics Supplement, 44, p. 371, 1981.",
      "ja": "[GROUPS] Greisen、E.、R。Harten、「データの小さな配列のグループに対するFITSの拡張」、Astronomy＆Astrophysics Supplement、44、p。 371、1981。"
    },
    {
      "indent": 3,
      "text": "[XTENSION] Grosbol, P., et al., \"Generalized extensions and blocking factors for FITS\", Astronomy & Astrophysics Supplement, 73, p. 359, 1988.",
      "ja": "[XTENSION] Grosbol、P.、et al。、 \"一般化された拡張とFITSのブロック因子\"、Astronomy＆Astrophysics Supplement、73、p。 359、1988。"
    },
    {
      "indent": 3,
      "text": "[IAUFWG] McNally, D., ed., \"Transactions of the IAU, Vol. XXB 1988, Proceedings of the Twentieth General Assembly Baltimore 1988\", Kluwer Academic, p. 52 (Resolution B2), 1988.",
      "ja": "[IAUFWG] McNally、D.、ed。、 \"Transactions of the IAU、Vol。XXB 1988、Proceedings of the Twentieth General Assembly Baltimore 1988\"、Kluwer Academic、p。 52（解像度B2）、1988年。"
    },
    {
      "indent": 3,
      "text": "[TABLE] Harten, R., et al., \"The FITS tables extension\", Astronomy & Astrophysics Supplement, 73, p. 365, 1988.",
      "ja": "[TABLE] Harten、R.、et al。、 \"The FITS tables extension\"、Astronomy＆Astrophysics Supplement、73、p。 365、1988。"
    },
    {
      "indent": 3,
      "text": "[IMAGE] Ponz, J., et al., \"The FITS image extension\", Astronomy & Astrophysics Supplement, 105, p. 53, 1994.",
      "ja": "[IMAGE] Ponz、J.、et al。、 \"The FITS image extension\"、Astronomy＆Astrophysics Supplement、105、p。 53、1994。"
    },
    {
      "indent": 3,
      "text": "[BINTABLE] Cotton, W., et al., \"Binary table extension to FITS\", Astronomy & Astrophysics Supplement, 113, p. 159, 1995.",
      "ja": "[BINTABLE] Cotton、W.、et al。、「FITSへのバイナリテーブル拡張」、Astronomy＆Astrophysics Supplement、113、p。 159、1995。"
    },
    {
      "indent": 3,
      "text": "[Remark] Greisen, E., \"FITS: A remarkable achievement in information exchange\" in \"Information Handling in Astronomy -- Historical Vistas\", A. Heck, ed., Kluwer Academic, p. 71, 2003.",
      "ja": "[備考] Greisen、E.、 \"FITS：A information at amazing exchange in information exchange\" in \"Astronomy in Historical-Historical Vistas\"、A. Heck、ed。、Kluwer Academic、p。 71、2003。"
    },
    {
      "indent": 3,
      "text": "[IVOA] The International Virtual Observatory Alliance, http://www.ivoa.net/",
      "ja": "[IVOA] The International Virtual Observatory Alliance、http：//www.ivoa.net/"
    },
    {
      "indent": 3,
      "text": "[NVO] The US National Virtual Observatory, http://www.us-vo.org/",
      "ja": "[NVO]米国国立仮想天文台、http：//www.us-vo.org/"
    },
    {
      "indent": 3,
      "text": "[AstroGrid] The UK AstroGrid, http://www.astrogrid.org/",
      "ja": "[AstroGrid] UK AstroGrid、http：//www.astrogrid.org/"
    },
    {
      "indent": 3,
      "text": "[AVO] The European Astrophysical Virtual Observatory, http://www.euro-vo.org/",
      "ja": "[AVO]欧州天体物理観測所、http：//www.euro-vo.org/"
    },
    {
      "indent": 3,
      "text": "[ASU] Albrecht, M., et al., \"Astronomical Server URL\", http://vizier.u-strasbg.fr/doc/asu.html, 1996.",
      "ja": "[ASU] Albrecht、M.、et al。、 \"Astronomical Server URL\"、http://vizier.u-strasbg.fr/doc/asu.html、1996。"
    },
    {
      "indent": 3,
      "text": "[SIAP] Tody, D., et al., \"Simple Image Access Prototype Specification\", http://www.us-vo.org/pubs/, 2002.",
      "ja": "[SIAP] Tody、D.、et al。、 \"Simple Image Access Prototype Specification\"、http://www.us-vo.org/pubs/、2002。"
    },
    {
      "indent": 3,
      "text": "[TIFF] Adobe Systems Incorporated, \"TIFF Revision 6.0\", http://partners.adobe.com/asn/developer/pdfs/tn/TIFF6.pdf 1992.",
      "ja": "[TIFF] Adobe Systems Incorporated、「TIFF Revision 6.0」、http：//partners.adobe.com/asn/developer/pdfs/tn/TIFF6.pdf 1992。"
    },
    {
      "indent": 3,
      "text": "[GeoTIFF] Ritter, N. and M. Ruth, \"GeoTIFF Format Specification\", http://www.remotesensing.org/geotiff/geotiff.html, 2000.",
      "ja": "[GeoTIFF] Ritter、N.、M。Ruth、「GeoTIFF Format Specification」、http：//www.remotesensing.org/geotiff/geotiff.html、2000"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "ja": "7.セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "The security considerations of interchanging FITS files are discussed above within the text of the IANA registration for each media type.",
      "ja": "FITSファイルの交換に関するセキュリティの考慮事項は、各メディアタイプのIANA登録のテキスト内で上記で説明されています。"
    },
    {
      "indent": 0,
      "text": "8. Contributors",
      "section_title": true,
      "ja": "8.貢献者"
    },
    {
      "indent": 3,
      "text": "Several individuals have made significant contributions to the content and clarity of this text:",
      "ja": "数人の個人がこのテキストの内容と明確さに大きく貢献しています。"
    },
    {
      "indent": 3,
      "text": "- Francois Ochsenbein (Observatoire Astronomique de Strasbourg)",
      "ja": "-フランソワオクセンバイン（ストラスブール天文台）"
    },
    {
      "indent": 3,
      "text": "- Clive Davenhall (Institute for Astronomy of the Royal Observatory Edinburgh)",
      "ja": "-クライブダベンホール（エジンバラ王立天文台）"
    },
    {
      "indent": 3,
      "text": "- Tom McGlynn (Laboratory for High Energy Astrophysics of the NASA Goddard Space Flight Center)",
      "ja": "-トムマクグリン（NASAゴダード宇宙飛行センターの高エネルギー天体物理学研究所）"
    },
    {
      "indent": 3,
      "text": "- Lucio Chiappetti (Milan section of the Italian Istituto di Astrofisica Spaziale e Fisica Cosmica)",
      "ja": "-ルシオ・キアッペッティ"
    },
    {
      "indent": 3,
      "text": "- William Pence (NASA High Energy Astrophysics Science Archive Research Center)",
      "ja": "-ウィリアムペンス（NASA高エネルギー天体物理学科学研究センター）"
    },
    {
      "indent": 3,
      "text": "- Arnold Rots (High Energy Astrophysics Division of the Smithsonian Astrophysical Observatory)",
      "ja": "-アーノルドロット（スミソニアン天体物理観測所の高エネルギー天体物理学部門）"
    },
    {
      "indent": 3,
      "text": "- Doug Tody (National Radio Astronomy Observatory)",
      "ja": "-ダグトディ（国立電波天文台）"
    },
    {
      "indent": 3,
      "text": "- Bob Hanisch (Space Telescope Science Institute)",
      "ja": "-ボブ・ハニッシュ（宇宙望遠鏡科学研究所）"
    },
    {
      "indent": 3,
      "text": "- Mark Calabretta (Australia Telescope National Facility)",
      "ja": "-マーク・カラブレッタ（オーストラリア望遠鏡国立施設）"
    },
    {
      "indent": 0,
      "text": "9. Acknowledgements",
      "section_title": true,
      "ja": "9.謝辞"
    },
    {
      "indent": 3,
      "text": "This document originated when William Joye of the Research and Development Group at the Smithsonian Astrophysical Observatory High Energy Astrophysics Division discovered many experimental and unofficial MIME media types being used by various agencies.",
      "ja": "このドキュメントは、スミソニアン天体物理観測所高エネルギー天体物理学部門の研究開発グループのウィリアムジョイが、さまざまな機関で使用されている多くの実験的および非公式のMIMEメディアタイプを発見したときに作成されました。"
    },
    {
      "indent": 3,
      "text": "Jeff Uphoff of the National Radio Astronomy Observatory (NRAO) contributed the FITS entries for the magic number file that permits the Unix-like \"file\" command on many systems to identify a FITS file.",
      "ja": "National Radio Astronomy Observatory（NRAO）のJeff Uphoffは、多くのシステムでUnixのような「ファイル」コマンドがFITSファイルを識別することを許可するマジックナンバーファイルのFITSエントリを提供しました。"
    },
    {
      "indent": 3,
      "text": "Nelson Zarate verified that the fgread and fgwrite programs are able to store hierarchical directories containing files with arbitrary MIME media types within a HDU of a FITS file. The fgread and fgwrite programs are part of the FITSUTIL IRAF external package (version dated September 1999) written by N. Zarate, D. Tody, and R. Seaman at National Optical Astronomy Observatory (NOAO).",
      "ja": "Nelson Zarateは、fgreadおよびfgwriteプログラムが、FITSファイルのHDU内に任意のMIMEメディアタイプのファイルを含む階層ディレクトリを保存できることを確認しました。 fgreadおよびfgwriteプログラムは、N。Zarate、D。Tody、およびR. Seamanが米国国立光学天文台（NOAO）で作成したFITSUTIL IRAF外部パッケージ（バージョン1999年9月）の一部です。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Steven L. Allen UCO/Lick Observatory University of California Santa Cruz, CA 95064 USA",
      "ja": "Steven L. Allen UCO / Lick Observatory University of Californiaカリフォルニア州サンタクルーズ、95064アメリカ合衆国"
    },
    {
      "indent": 3,
      "text": "Phone: +1 831 459 3046 EMail: sla@ucolick.org",
      "ja": "電話：+1 831 459 3046 Eメール：sla@ucolick.org"
    },
    {
      "indent": 3,
      "text": "Donald C. Wells National Radio Astronomy Observatory 520 Edgemont Road Charlottesville, Virginia 22903-2475 USA",
      "ja": "ドナルドC.ウェルズ国立電波天文台520 Edgemont Road Charlottesville、Virginia 22903-2475 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 434 296 0277 EMail: dwells@nrao.edu",
      "ja": "電話：+1 434 296 0277 Eメール：dwells@nrao.edu"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "ja": "著作権（C）インターネット協会（2005）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "この文書は、BCP 78に含まれる権利、ライセンス、制限の対象となります。また、そこに記載されている場合を除き、著者はすべての権利を保持します。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "本書および本書に含まれる情報は「現状のまま」提供され、寄稿者、代表者または代表者（もしあれば）、インターネット協会、インターネットエンジニアリングタスクフォースはすべての保証を放棄します 黙示的であるが、ここに記載されている情報の使用が商品性または特定の目的への適合性の黙示的保証を侵害しないという保証に限定されない。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、本書に記載されている技術の実装または使用に関連すると主張される可能性のある知的財産権またはその他の権利の有効性または範囲、またはそのような権利の下でのライセンスの有無に関して、立場をとりません。 利用可能 また、そのような権利を特定するための独立した努力を行ったことを表すものでもありません。 RFC文書の権利に関する手順に関する情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IETF事務局に行われたIPR開示のコピーおよび利用可能になるライセンスの保証、またはこの仕様の実装者またはユーザーによる一般的なライセンスまたはそのような所有権の使用許可の取得を試みた結果を取得できます。 IETFオンラインIPRリポジトリ（http://www.ietf.org/ipr）から。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、この標準を実装するために必要な技術を対象とする著作権、特許、特許出願、またはその他の所有権に関心を寄せるよう、あらゆる利害関係者を招待します。 IETFのietf-ipr@ietf.orgに情報を送信してください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能の資金は、現在インターネット協会によって提供されています。"
    }
  ]
}