{
  "title": {
    "text": "RFC 4644 - Network News Transfer Protocol (NNTP) Extension for Streaming Feeds",
    "ja": "RFC 4644 - ストリーミングフィード用のネットワークニュース転送プロトコル（NNTP）拡張"
  },
  "number": 4644,
  "created_at": "2023-06-13 17:17:16.387318+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                         J. Vinocur\nRequest for Comments: 4644                            Cornell University\nUpdates: 2980                                               K. Murchison\nCategory: Standards Track                     Carnegie Mellon University\n                                                            October 2006",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 2,
      "text": "Network News Transfer Protocol (NNTP) Extension for Streaming Feeds",
      "ja": "ストリーミングフィード用のネットワークニュース転送プロトコル（NNTP）拡張"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "このドキュメントは、インターネットコミュニティのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態とステータスについては、「インターネット公式プロトコル標準」（STD 1）の現在のエディションを参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2006).",
      "ja": "Copyright（c）The Internet Society（2006）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This memo defines an extension to the Network News Transfer Protocol (NNTP) to provide asynchronous (otherwise known as \"streaming\") transfer of articles. This allows servers to transfer articles to other servers with much greater efficiency.",
      "ja": "このメモは、ネットワークニュース転送プロトコル（NNTP）の拡張機能を定義して、記事の非同期（別名「ストリーミング」と呼ばれる）転送を提供します。これにより、サーバーはより大きな効率で他のサーバーに記事を転送できます。"
    },
    {
      "indent": 3,
      "text": "This document updates and formalizes the CHECK and TAKETHIS commands specified in RFC 2980 and deprecates the MODE STREAM command.",
      "ja": "このドキュメントは、RFC 2980で指定されたチェックおよびTakethisコマンドを更新および形式化し、Mode Streamコマンドを非難します。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n   1.1. Conventions Used in this Document ..........................2\n2. The STREAMING Extension .........................................3\n   2.1. Streaming Article Transfer .................................3\n   2.2. Advertising the STREAMING Extension ........................4\n   2.3. MODE STREAM Command ........................................5\n        2.3.1. Usage ...............................................5\n        2.3.2. Description .........................................5\n        2.3.3. Examples ............................................5\n   2.4. CHECK Command ..............................................6\n        2.4.1. Usage ...............................................6\n        2.4.2. Description .........................................6\n        2.4.3. Examples ............................................6\n   2.5. TAKETHIS Command ...........................................7",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "        2.5.1. Usage ...............................................7\n        2.5.2. Description .........................................7\n        2.5.3. Examples ............................................8\n3. Augmented BNF Syntax for the STREAMING Extension ................9\n   3.1. Commands ...................................................9\n   3.2. Command Datastream .........................................9\n   3.3. Responses .................................................10\n   3.4. Capability Entries ........................................10\n4. Summary of Response Codes ......................................10\n5. Security Considerations ........................................11\n6. IANA Considerations ............................................11\n7. Acknowledgements ...............................................12\n8. References .....................................................12\n   8.1. Normative References ......................................12\n   8.2. Informative References ....................................12",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "According to the NNTP specification [NNTP], a peer uses the IHAVE command to query whether a server wants a particular article. Because the IHAVE command cannot be pipelined, the need to stop and wait for the remote end's response greatly restricts the throughput that can be achieved.",
      "ja": "NNTP仕様[NNTP]によると、ピアはiHaveコマンドを使用して、サーバーが特定の記事を必要とするかどうかを照会します。iHaveコマンドをパイプライン化できないため、リモートエンドの応答を停止して待つ必要があるため、達成できるスループットが大幅に制限されます。"
    },
    {
      "indent": 3,
      "text": "The ad-hoc CHECK and TAKETHIS commands, originally documented in [NNTP-COMMON], provide an alternative method of peer-to-peer article transfer that permits a more effective use of network bandwidth. Due to their proven usefulness and wide deployment, they are formalized in this specification.",
      "ja": "元々[NNTP-Common]で文書化されたアドホックチェックとTakethisコマンドは、ネットワーク帯域幅のより効果的な使用を可能にするピアツーピアの記事転送の代替方法を提供します。実証済みの有用性と幅広い展開により、この仕様で正式になっています。"
    },
    {
      "indent": 3,
      "text": "The ad-hoc MODE STREAM command, also documented in [NNTP-COMMON], is deprecated by this specification, but due to its ubiquity is documented here for backwards compatibility.",
      "ja": "[nntp-common]でも文書化されたアドホックモードストリームコマンドは、この仕様によって非推奨されていますが、その遍在のために、逆方向の互換性のためにここに文書化されています。"
    },
    {
      "indent": 0,
      "text": "1.1. Conventions Used in this Document",
      "section_title": true,
      "ja": "1.1. このドキュメントで使用されている規則"
    },
    {
      "indent": 3,
      "text": "The notational conventions used in this document are the same as those in [NNTP] and any term not defined in this document has the same meaning as in that one.",
      "ja": "このドキュメントで使用される表記規則は[NNTP]のものと同じであり、このドキュメントで定義されていない用語は、その文書と同じ意味を持っています。"
    },
    {
      "indent": 3,
      "text": "The key words \"REQUIRED\", \"MUST\", \"MUST NOT\", \"SHOULD\", \"SHOULD NOT\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in \"Key words for use in RFCs to Indicate Requirement Levels\" [KEYWORDS].",
      "ja": "「必須」、「必須」、「必要はない」、「そうは思わない」、「そうではない」、「5月」、および「オプション」は、「RFCで使用するためのキーワードで説明されていると解釈されます。要件レベルを示すために」[キーワード]。"
    },
    {
      "indent": 3,
      "text": "This document assumes you familiarity with NNTP [NNTP]. In general, the connections described below are from one peer to another, but we will continue to use \"client\" to mean the initiator of the NNTP connection, and \"server\" to mean the other endpoint.",
      "ja": "このドキュメントは、NNTP [NNTP]に精通していることを前提としています。一般に、以下で説明する接続は、あるピアから別のピアへですが、「クライアント」を使用してNNTP接続のイニシエーターを意味し、「サーバー」を意味して他のエンドポイントを意味します。"
    },
    {
      "indent": 3,
      "text": "In the examples, commands from the client are indicated with [C], and responses from the server are indicated with [S].",
      "ja": "例では、クライアントからのコマンドは[c]で示され、サーバーからの応答は[s]で示されます。"
    },
    {
      "indent": 0,
      "text": "2. The STREAMING Extension",
      "section_title": true,
      "ja": "2. ストリーミング拡張機能"
    },
    {
      "indent": 3,
      "text": "This extension provides three new commands: MODE STREAM, CHECK, and TAKETHIS. The capability label for this extension is STREAMING.",
      "ja": "この拡張機能は、モードストリーム、チェック、およびTakethisの3つの新しいコマンドを提供します。この拡張機能の機能ラベルはストリーミングです。"
    },
    {
      "indent": 0,
      "text": "2.1. Streaming Article Transfer",
      "section_title": true,
      "ja": "2.1. ストリーミング記事転送"
    },
    {
      "indent": 3,
      "text": "The STREAMING extension provides the same functionality as the IHAVE command ([NNTP] section 6.3.2) but splits the query and transfer functionality into the CHECK and TAKETHIS commands respectively. This allows the CHECK and TAKETHIS commands to be pipelined ([NNTP] section 3.5) and provides for \"streaming\" article transfer.",
      "ja": "ストリーミング拡張機能は、iHaveコマンド（[nntp]セクション6.3.2）と同じ機能を提供しますが、それぞれクエリと転送機能をチェックとtakethisコマンドに分割します。これにより、チェックとTakethisコマンドをパイプライン（[nntp]セクション3.5）にすることができ、「ストリーミング」記事の転送を提供します。"
    },
    {
      "indent": 3,
      "text": "A streaming client will often pipeline many CHECK commands and use the responses to construct a list of articles to be sent by a pipelined sequence of TAKETHIS commands, thus increasing the fraction of time spent transferring articles. The CHECK and TAKETHIS commands utilize distinct response codes so that these commands can be intermingled in a pipeline and the response to any single command can be definitively identified by the client.",
      "ja": "ストリーミングクライアントは、多くのチェックコマンドをパイプラインし、回答を使用して、Takethisコマンドのパイプラインされたシーケンスによって送信される記事のリストを作成するため、記事の転送に費やされた時間の割合が増加します。Check and Takethisコマンドは、個別の応答コードを利用して、これらのコマンドをパイプラインに混ぜ合わせ、単一のコマンドへの応答をクライアントによって明確に識別できるようにします。"
    },
    {
      "indent": 3,
      "text": "The client MAY send articles via TAKETHIS without first querying the server with CHECK. The client SHOULD NOT send every article in this fashion unless explicitly configured to do so by the site administrator based on out-of-band information. However, the client MAY use an adaptive strategy where it initially sends CHECK commands for all articles, but switches to using TAKETHIS without CHECK if most articles are being accepted (over 95% acceptance might be a reasonable metric in some configurations). If the client uses such a strategy, it SHOULD also switch back to using CHECK on all articles if the acceptance rate ever falls much below the threshold.",
      "ja": "クライアントは、チェックでサーバーを最初にクエリすることなく、Takethisを介して記事を送信する場合があります。クライアントは、バンド外情報に基づいてサイト管理者によって明示的に設定されていない限り、この方法ですべての記事を送信する必要はありません。ただし、クライアントは最初にすべての記事のチェックコマンドを送信する適応戦略を使用する場合がありますが、ほとんどの記事が受け入れられているかどうかをチェックせずにTakethisを使用することに切り替えます（一部の構成では95％以上の受け入れが合理的なメトリックになる可能性があります）。クライアントがそのような戦略を使用している場合、受け入れ率がしきい値をはるかに下回った場合、すべての記事のチェックを使用することに戻る必要があります。"
    },
    {
      "indent": 0,
      "text": "2.2. Advertising the STREAMING Extension",
      "section_title": true,
      "ja": "2.2. ストリーミング拡張機能を宣伝します"
    },
    {
      "indent": 3,
      "text": "A server supporting the streaming commands described in this document will advertise the \"STREAMING\" capability label in response to the CAPABILITIES command ([NNTP] section 5.2). The server MUST continue to advertise this capability after a client has issued the MODE STREAM command. This capability MAY be advertised both before and after any use of the MODE READER command ([NNTP] section 5.3), with the same semantics.",
      "ja": "このドキュメントで説明されているストリーミングコマンドをサポートするサーバーは、機能コマンド（[NNTP]セクション5.2）に応じて「ストリーミング」機能ラベルを宣伝します。クライアントがモードストリームコマンドを発行した後、サーバーはこの機能を引き続き宣伝する必要があります。この機能は、同じセマンティクスを使用して、Mode Readerコマンド（[NNTP]セクション5.3）の使用の前後の両方で宣伝できます。"
    },
    {
      "indent": 3,
      "text": "Example of a client using CAPABILITIES and MODE STREAM on a mode-switching server:",
      "ja": "モードスイッチングサーバーで機能とモードストリームを使用しているクライアントの例："
    },
    {
      "indent": 6,
      "text": "[C] CAPABILITIES [S] 101 Capability list: [S] VERSION 2 [S] MODE-READER [S] IHAVE [S] LIST ACTIVE [S] STREAMING [S] . [C] MODE STREAM [S] 203 Streaming permitted [C] CAPABILITIES [S] 101 Capability list: [S] VERSION 2 [S] MODE-READER [S] IHAVE [S] LIST ACTIVE [S] STREAMING [S] . [C] MODE READER [S] 200 Posting allowed [C] CAPABILITIES [S] 101 Capability list: [S] VERSION 2 [S] READER [S] POST [S] LIST ACTIVE NEWSGROUPS HEADERS [S] HDR [S] .",
      "ja": "[c]機能[s] 101機能リスト：[s]バージョン2 [s]モードリーダー[s] ihave [s] active [s] striming [s]。[c]モードストリーム[s] 203ストリーミング許可[c]機能[s] 101機能リスト：[s]バージョン2 [s]モードリーダー[s] ihave [s] active [s] striming [s]。[c]モードリーダー[s] 200の投稿許可[c]機能[s] 101機能リスト：[s]バージョン2 [s] Reader [s] active newsgroups headers [s] hdr [s]をリストします。"
    },
    {
      "indent": 0,
      "text": "2.3. MODE STREAM Command",
      "section_title": true,
      "ja": "2.3. モードストリームコマンド"
    },
    {
      "indent": 3,
      "text": "Historically this command was used by a client to discover if a server supported the CHECK and TAKETHIS commands. This command is deprecated in favor of the CAPABILITIES discovery command and is only provided here for compatibility with legacy implementations [NNTP-COMMON] of these transport commands.",
      "ja": "歴史的に、このコマンドはクライアントによって使用され、サーバーがチェックとTakethisコマンドをサポートしているかどうかを発見しました。このコマンドは、機能ディスカバリーコマンドを支持して非推奨され、これらの輸送コマンドのレガシー実装[NNTP-Common]との互換性のためにのみここで提供されます。"
    },
    {
      "indent": 3,
      "text": "New clients SHOULD use the CAPABILITIES command to check a server for support of the STREAMING extension but MAY use the MODE STREAM command for backwards compatibility with legacy servers that don't support the CAPABILITIES discovery command. Servers MUST accept the MODE STREAM command for backwards compatibility with legacy clients that don't use the CAPABILITIES discovery command.",
      "ja": "新しいクライアントは、機能コマンドを使用してサーバーにストリーミング拡張機能のサポートを確認する必要がありますが、機能Discoveryコマンドをサポートしていないレガシーサーバーとの後方互換性にモードストリームコマンドを使用する場合があります。サーバーは、機能Discoveryコマンドを使用しないレガシークライアントとの後方互換性のモードストリームコマンドを受け入れる必要があります。"
    },
    {
      "indent": 3,
      "text": "NOTE: This command may be removed from a future version of this specification, therefore clients are urged to transition to the CAPABILITIES command wherever possible.",
      "ja": "注：このコマンドは、この仕様の将来のバージョンから削除される場合があるため、クライアントは可能な限り機能コマンドに移行するように促されます。"
    },
    {
      "indent": 0,
      "text": "2.3.1. Usage",
      "section_title": true,
      "ja": "2.3.1. 使用法"
    },
    {
      "indent": 3,
      "text": "Syntax MODE STREAM",
      "ja": "構文モードストリーム"
    },
    {
      "indent": 3,
      "text": "Responses 203 Streaming permitted",
      "ja": "応答203ストリーミングが許可されています"
    },
    {
      "indent": 0,
      "text": "2.3.2. Description",
      "section_title": true,
      "ja": "2.3.2. 説明"
    },
    {
      "indent": 3,
      "text": "If a server supports this extension, it MUST return a 203 response to the MODE STREAM command (or 501 if an argument is given). The MODE STREAM command MUST NOT affect the server state in any way (that is, it is not a mode change despite the name), therefore this command MAY be pipelined. A server MUST NOT require that the MODE STREAM command be issued by the client before accepting the CHECK or TAKETHIS commands.",
      "ja": ""
    },
    {
      "indent": 0,
      "text": "2.3.3. Examples",
      "section_title": true,
      "ja": "2.3.3. 例"
    },
    {
      "indent": 3,
      "text": "Example of a client checking the ability to stream articles on a server which does not support this extension:",
      "ja": "この拡張機能をサポートしていないサーバー上で記事をストリーミングする機能を確認するクライアントの例："
    },
    {
      "indent": 6,
      "text": "[C] MODE STREAM [S] 501 Unknown MODE variant",
      "ja": "[c]モードストリーム[S] 501不明モードバリアント"
    },
    {
      "indent": 3,
      "text": "Example of a client checking the ability to stream articles on a server which supports this extension:",
      "ja": "この拡張機能をサポートするサーバー上で記事をストリーミングする機能を確認するクライアントの例："
    },
    {
      "indent": 6,
      "text": "[C] MODE STREAM [S] 203 Streaming permitted",
      "ja": "[c]モードストリーム[S] 203ストリーミング許可"
    },
    {
      "indent": 0,
      "text": "2.4. CHECK Command",
      "section_title": true,
      "ja": "2.4. コマンドを確認してください"
    },
    {
      "indent": 0,
      "text": "2.4.1. Usage",
      "section_title": true,
      "ja": "2.4.1. 使用法"
    },
    {
      "indent": 3,
      "text": "Syntax CHECK message-id",
      "ja": "構文チェックMessage-ID"
    },
    {
      "indent": 3,
      "text": "Responses 238 message-id Send article to be transferred 431 message-id Transfer not possible; try again later 438 message-id Article not wanted",
      "ja": "応答238メッセージ-ID転送される記事を送信する431メッセージ-ID転送は不可能です。後でもう一度再試行してください438メッセージ-ID記事が必要ではありません"
    },
    {
      "indent": 3,
      "text": "Parameters message-id = Article message-id",
      "ja": "パラメーターメッセージ-ID =記事メッセージ-ID"
    },
    {
      "indent": 3,
      "text": "The first parameter of the 238, 431, and 438 responses MUST be the message-id provided by the client as the parameter to CHECK.",
      "ja": "238、431、および438の応答の最初のパラメーターは、クライアントがチェックするパラメーターとして提供するメッセージ-IDでなければなりません。"
    },
    {
      "indent": 0,
      "text": "2.4.2. Description",
      "section_title": true,
      "ja": "2.4.2. 説明"
    },
    {
      "indent": 3,
      "text": "The CHECK command informs the server that the client has an article with the specified message-id. If the server desires a copy of that article, a 238 response MUST be returned, indicating that the client may send the article using the TAKETHIS command. If the server does not want the article (if, for example, the server already has a copy of it), a 438 response MUST be returned, indicating that the article is not wanted. Finally, if the article isn't wanted immediately but the client should retry later if possible (if, for example, another client has offered to send the same article to the server), a 431 response MUST be returned.",
      "ja": "Checkコマンドは、クライアントが指定されたMessage-IDを含む記事があることをサーバーに通知します。サーバーがその記事のコピーを希望する場合、238の応答を返す必要があり、クライアントがTakethisコマンドを使用して記事を送信できることを示します。サーバーが記事を必要としない場合（たとえば、サーバーがすでにコピーを持っている場合）、438の応答を返す必要があり、記事が必要でないことを示します。最後に、記事がすぐに必要ではないが、可能であれば後でクライアントが再試行する必要がある場合（たとえば、別のクライアントが同じ記事をサーバーに送信することを申し出た場合）、431の応答を返す必要があります。"
    },
    {
      "indent": 3,
      "text": "NOTE: The responses to CHECK are advisory; the server MUST NOT rely on the client to behave as requested by these responses.",
      "ja": "注：チェックへの回答はアドバイザリーです。サーバーは、これらの応答の要求に応じて動作するようにクライアントに依存してはなりません。"
    },
    {
      "indent": 0,
      "text": "2.4.3. Examples",
      "section_title": true,
      "ja": "2.4.3. 例"
    },
    {
      "indent": 3,
      "text": "Example of a client checking whether the server would like a set of articles and getting a mixture of responses:",
      "ja": "サーバーが記事のセットを希望するかどうかを確認し、応答の混合を取得するクライアントの例："
    },
    {
      "indent": 6,
      "text": "[C] CHECK <i.am.an.article.you.will.want@example.com>\n[S] 238 <i.am.an.article.you.will.want@example.com>\n[C] CHECK <i.am.an.article.you.have@example.com>\n[S] 438 <i.am.an.article.you.have@example.com>\n[C] CHECK <i.am.an.article.you.defer@example.com>\n[S] 431 <i.am.an.article.you.defer@example.com>",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Example of pipelining the CHECK commands in the previous example:",
      "ja": "前の例でチェックコマンドのパイプラインの例："
    },
    {
      "indent": 6,
      "text": "[C] CHECK <i.am.an.article.you.will.want@example.com>\n[C] CHECK <i.am.an.article.you.have@example.com>\n[C] CHECK <i.am.an.article.you.defer@example.com>\n[S] 238 <i.am.an.article.you.will.want@example.com>\n[S] 438 <i.am.an.article.you.have@example.com>\n[S] 431 <i.am.an.article.you.defer@example.com>",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "2.5. TAKETHIS Command",
      "section_title": true,
      "ja": "2.5. "
    },
    {
      "indent": 0,
      "text": "2.5.1. Usage",
      "section_title": true,
      "ja": "2.5.1. 使用法"
    },
    {
      "indent": 3,
      "text": "A client MUST NOT use this command unless the server advertises the STREAMING capability or returns a 203 response to the MODE STREAM command.",
      "ja": "サーバーがストリーミング機能を宣伝したり、モードストリームコマンドに対する203の応答を返したりしない限り、クライアントはこのコマンドを使用してはなりません。"
    },
    {
      "indent": 3,
      "text": "Syntax TAKETHIS message-id",
      "ja": "構文takethis message-id"
    },
    {
      "indent": 3,
      "text": "Responses 239 message-id Article transferred OK 439 message-id Transfer rejected; do not retry",
      "ja": "回答239メッセージ-ID記事転送OK 439メッセージ-ID転送は拒否されました。再試行しないでください"
    },
    {
      "indent": 3,
      "text": "Parameters message-id = Article message-id",
      "ja": "パラメーターメッセージ-ID =記事メッセージ-ID"
    },
    {
      "indent": 3,
      "text": "The first parameter of the 239 and 439 responses MUST be the message-id provided by the client as the parameter to TAKETHIS.",
      "ja": "239および439の応答の最初のパラメーターは、Takethのパラメーターとしてクライアントが提供するメッセージ-IDでなければなりません。"
    },
    {
      "indent": 0,
      "text": "2.5.2. Description",
      "section_title": true,
      "ja": "2.5.2. 説明"
    },
    {
      "indent": 3,
      "text": "The TAKETHIS command is used to send an article with the specified message-id to the server. The article is sent immediately following the CRLF at the end of the TAKETHIS command line. The client MUST send the entire article, including headers and body, to the server as a multi-line data block ([NNTP] section 3.1.1). Thus, a single dot (\".\") on a line indicates the end of the text, and lines starting with a dot in the original text have that dot doubled during transmission. The server MUST return either a 239 response, indicating that the article was successfully transferred, or a 439 response, indicating that the article was rejected. If the server encounters a temporary error that prevents it from processing the article but does not want to reject the article, it MUST reply with a 400 response to the client and close the connection.",
      "ja": "Takethisコマンドは、指定されたメッセージIDを含む記事をサーバーに送信するために使用されます。この記事は、Takethisコマンドラインの終わりにCRLFの直後に送信されます。クライアントは、マルチラインデータブロック（[NNTP]セクション3.1.1）として、ヘッダーとボディを含む記事全体をサーバーに送信する必要があります。したがって、行の単一のドット（ \"）はテキストの終わりを示し、元のテキストのドットから始まる行では、伝送中にドットが2倍になりました。サーバーは、記事が正常に転送されたことを示す239の応答のいずれかを返す必要があります。または、記事が拒否されたことを示します。サーバーが記事の処理を防ぐが、記事を拒否したくない一時的なエラーに遭遇する場合、クライアントに400回の応答で返信して接続を閉じる必要があります。"
    },
    {
      "indent": 3,
      "text": "This function differs from the POST command in that it is intended for use in transferring already-posted articles between hosts. It SHOULD NOT be used when the client is a personal news-reading program, since use of this command indicates that the article has already been posted at another site and is simply being forwarded from another host. However, despite this, the server MAY elect not to post or forward the article if, after further examination of the article, it deems it inappropriate to do so. Reasons for such subsequent rejection of an article may include problems such as inappropriate newsgroups or distributions, disk space limitations, article lengths, garbled headers, and the like. These are typically restrictions enforced by the server host's news software and not necessarily by the NNTP server itself.",
      "ja": "この関数は、ホスト間ですでにポストされた記事を転送する際に使用することを目的としているという点で、Postコマンドとは異なります。このコマンドの使用は、記事がすでに別のサイトに投稿されており、単に別のホストから転送されていることを示しているため、クライアントが個人のニュースリーディングプログラムである場合は使用しないでください。ただし、それにもかかわらず、サーバーは、記事をさらに調査した後、それが不適切であると考えている場合、記事を投稿または転送しないことを選択する場合があります。このようなその後の記事の拒否の理由には、不適切なニュースグループや分布、ディスクのスペースの制限、記事の長さ、文字化けヘッダーなどの問題が含まれる場合があります。これらは通常、サーバーホストのニュースソフトウェアによって施行される制限であり、必ずしもNNTPサーバー自体によってではありません。"
    },
    {
      "indent": 3,
      "text": "The client SHOULD NOT assume that the article has been successfully transferred unless it receives an affirmative response from the server. A lack of response (such as a dropped network connection or a network timeout) or a 400 response SHOULD be treated as a temporary failure and cause the transfer to be tried again later if possible.",
      "ja": "クライアントは、サーバーから肯定的な応答を受け取らない限り、記事が正常に転送されたと仮定してはなりません。応答の欠如（ネットワーク接続のドロップやネットワークタイムアウトなど）または400の応答は、一時的な障害として扱われ、可能であれば転送を後で再試行する必要があります。"
    },
    {
      "indent": 3,
      "text": "Because some news server software may not immediately be able to determine whether an article is suitable for posting or forwarding, an NNTP server MAY acknowledge the successful transfer of the article (with a 239 response) but later silently discard it.",
      "ja": "一部のニュースサーバーソフトウェアは、記事が投稿または転送に適しているかどうかをすぐに判断できない可能性があるため、NNTPサーバーは、記事の転送の成功（239回の応答）を認めている場合がありますが、後に静かに破棄します。"
    },
    {
      "indent": 0,
      "text": "2.5.3. Examples",
      "section_title": true,
      "ja": "2.5.3. 例"
    },
    {
      "indent": 3,
      "text": "Example of streaming two articles to another site (the first article is accepted and the second is rejected):",
      "ja": "2つの記事を別のサイトにストリーミングする例（最初の記事は受け入れられ、2番目の記事は拒否されます）："
    },
    {
      "indent": 6,
      "text": "[C] TAKETHIS <i.am.an.article.you.will.want@example.com>\n[C] Path: pathost!demo!somewhere!not-for-mail\n[C] From: \"Demo User\" <nobody@example.com>\n[C] Newsgroups: misc.test\n[C] Subject: I am just a test article\n[C] Date: 6 Oct 1998 04:38:40 -0500\n[C] Organization: An Example Com, San Jose, CA\n[C] Message-ID: <i.am.an.article.you.will.want@example.com>\n[C]\n[C] This is just a test article.\n[C] .\n[C] TAKETHIS <i.am.an.article.you.have@example.com>\n[C] Path: pathost!demo!somewhere!not-for-mail\n[C] From: \"Demo User\" <nobody@example.com>\n[C] Newsgroups: misc.test\n[C] Subject: I am just a test article\n[C] Date: 6 Oct 1998 04:38:40 -0500\n[C] Organization: An Example Com, San Jose, CA\n[C] Message-ID: <i.am.an.article.you.have@example.com>\n[C]",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "[C] This is just a test article.\n[C] .\n[S] 239 <i.am.an.article.you.will.want@example.com>\n[S] 439 <i.am.an.article.you.have@example.com>",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Example of sending an article to a site where the transfer fails:",
      "ja": ""
    },
    {
      "indent": 6,
      "text": "[C] TAKETHIS <i.am.an.article.you.will.want@example.com>\n[C] Path: pathost!demo!somewhere!not-for-mail\n[C] From: \"Demo User\" <nobody@example.com>\n[C] Newsgroups: misc.test\n[C] Subject: I am just a test article\n[C] Date: 6 Oct 1998 04:38:40 -0500\n[C] Organization: An Example Com, San Jose, CA\n[C] Message-ID: <i.am.an.article.you.will.want@example.com>\n[C]\n[C] This is just a test article.\n[C] .\n[S] 400 Service temporarily unavailable\n[Server closes connection.]",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "3. Augmented BNF Syntax for the STREAMING Extension",
      "section_title": true,
      "ja": "3. "
    },
    {
      "indent": 3,
      "text": "This section describes the formal syntax of the STREAMING extension using ABNF [ABNF]. It extends the syntax in section 9 of [NNTP], and non-terminals not defined in this document are defined there. The [NNTP] ABNF should be imported first before attempting to validate these rules.",
      "ja": "このセクションでは、ABNF [ABNF]を使用したストリーミング拡張機能の正式な構文について説明します。[NNTP]のセクション9の構文を拡張し、このドキュメントで定義されていない非ターミナルはそこで定義されています。[NNTP] ABNFは、これらのルールを検証しようとする前に、まずインポートする必要があります。"
    },
    {
      "indent": 0,
      "text": "3.1. Commands",
      "section_title": true,
      "ja": "3.1. コマンド"
    },
    {
      "indent": 3,
      "text": "This syntax extends the non-terminal \"command\", which represents an NNTP command.",
      "ja": "この構文は、NNTPコマンドを表す非末端「コマンド」を拡張します。"
    },
    {
      "indent": 3,
      "text": "command =/ check-command / mode-stream-command / takethis-command",
      "ja": "command = / check-command / mode-stream-command / takethis-command"
    },
    {
      "indent": 3,
      "text": "check-command = \"CHECK\" WS message-id mode-stream-command = \"MODE\" WS \"STREAM\" takethis-command = \"TAKETHIS\" WS message-id",
      "ja": "check-command = \"check\" ws message-id mode-stream-command = \"mode\" ws \"stream\" takethis-command = \"takethis\" ws message-id"
    },
    {
      "indent": 0,
      "text": "3.2. Command Datastream",
      "section_title": true,
      "ja": "3.2. コマンドdatastream"
    },
    {
      "indent": 3,
      "text": "This syntax extends the non-terminal \"command-datastream\", which represents the further material sent by the client in the case of streaming commands.",
      "ja": "この構文は、ストリーミングコマンドの場合にクライアントが送信したさらなる資料を表す非末端「コマンドダタストリーム」を拡張します。"
    },
    {
      "indent": 3,
      "text": "command-datastream =/ takethis-datastream",
      "ja": "command-dataStream =/ takethis-datastream"
    },
    {
      "indent": 3,
      "text": "takethis-datastream = encoded-article",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "3.3. Responses",
      "section_title": true,
      "ja": "3.3. 反応"
    },
    {
      "indent": 3,
      "text": "This syntax extends the non-terminal \"initial-response-content\", which represents an initial response line sent by the server.",
      "ja": "この構文は、サーバーから送信された初期応答ラインを表す非末端の「初期応答コンテンツ」を拡張します。"
    },
    {
      "indent": 3,
      "text": "initial-response-content =/ response-238-content / response-239-content / response-431-content / response-438-content / response-439-content",
      "ja": "初期応答コンテンント= / Response-238-Content / Response-239-Content / Response-431-Content / Response-438-Content / Response-439-Content"
    },
    {
      "indent": 3,
      "text": "response-238-content = \"238\" SP message-id response-239-content = \"239\" SP message-id response-431-content = \"431\" SP message-id response-438-content = \"438\" SP message-id response-439-content = \"439\" SP message-id",
      "ja": "Response-238-Content = \"238\" SP Message-ID Response-239-Content = \"239\" SP Message-ID Response-431-Content = \"431\" SP Message-ID Response-438-Content = \"438\" SPメッセージ-id response-439-content = \"439\" sp message-id"
    },
    {
      "indent": 0,
      "text": "3.4. Capability Entries",
      "section_title": true,
      "ja": "3.4. 機能エントリ"
    },
    {
      "indent": 3,
      "text": "This syntax extends the non-terminal \"capability-entry\", which represents a capability that may be advertised by the server.",
      "ja": "この構文は、非末端の「機能エントリ」を拡張します。これは、サーバーが宣伝できる機能を表します。"
    },
    {
      "indent": 3,
      "text": "capability-entry =/ streaming-capability",
      "ja": "capability-entry =/ストリーミング能力"
    },
    {
      "indent": 3,
      "text": "streaming-capability = \"STREAMING\"",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "4. Summary of Response Codes",
      "section_title": true,
      "ja": "4. 応答コードの概要"
    },
    {
      "indent": 3,
      "text": "This section contains a list of each new response code defined in this document and indicates whether it is multi-line, which commands can generate it, what arguments it has, and what its meaning is.",
      "ja": "このセクションには、このドキュメントで定義されている各新しい応答コードのリストが含まれており、それがマルチラインであるかどうか、コマンドがそれを生成できるか、それが持っている引数、およびその意味とは何かを示します。"
    },
    {
      "indent": 3,
      "text": "Response code 203 Generated by: MODE STREAM Meaning: streaming permitted.",
      "ja": "応答コード203生成：モードストリーム意味：ストリーミング許可。"
    },
    {
      "indent": 3,
      "text": "Response code 238 Generated by: CHECK 1 argument: message-id Meaning: send article to be transferred.",
      "ja": "生成された応答コード238：チェック1引数：メッセージ-ID意味：転送される記事を送信します。"
    },
    {
      "indent": 3,
      "text": "Response code 239 Generated by: TAKETHIS 1 argument: message-id Meaning: article transferred OK.",
      "ja": "応答コード239生成：Takethis 1引数：メッセージ-ID意味：記事転送されたOK。"
    },
    {
      "indent": 3,
      "text": "Response code 431 Generated by: CHECK 1 argument: message-id Meaning: transfer not possible; try again later.",
      "ja": "応答コード431生成：1引数を確認：メッセージ-IDの意味：転送不可。あとでもう一度試してみてください。"
    },
    {
      "indent": 3,
      "text": "Response code 438 Generated by: CHECK 1 argument: message-id Meaning: article not wanted.",
      "ja": "生成された応答コード438：チェック1引数：メッセージ-ID意味：記事が必要ではありません。"
    },
    {
      "indent": 3,
      "text": "Response code 439 Generated by: TAKETHIS 1 argument: message-id Meaning: transfer rejected; do not retry.",
      "ja": "応答コード439生成：Takethis 1引数：メッセージ-ID意味：転送拒否。再試行しないでください。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "No new security considerations are introduced by this extension, beyond those already described in the core specification [NNTP].",
      "ja": "コア仕様[NNTP]ですでに説明されているものを超えて、この拡張機能によって新しいセキュリティ上の考慮事項は導入されていません。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This section gives a formal definition of the STREAMING extension as required by Section 3.3.3 of [NNTP] for the IANA registry.",
      "ja": "このセクションでは、IANAレジストリに[NNTP]のセクション3.3.3で要求されるストリーミング拡張の正式な定義を示します。"
    },
    {
      "indent": 3,
      "text": "o The STREAMING extension provides for streaming transfer of articles.",
      "ja": "o "
    },
    {
      "indent": 3,
      "text": "o The capability label for this extension is \"STREAMING\".",
      "ja": "o この拡張機能の機能ラベルは「ストリーミング」です。"
    },
    {
      "indent": 3,
      "text": "o The capability label has no arguments.",
      "ja": "o 機能ラベルには引数がありません。"
    },
    {
      "indent": 3,
      "text": "o The extension defines three new commands, MODE STREAM, CHECK, and TAKETHIS, whose behavior, arguments, and responses are defined in Sections 2.3, 2.4, and 2.5 respectively.",
      "ja": "o 拡張機能は、3つの新しいコマンド、モードストリーム、チェック、およびTakethisを定義します。その動作、引数、および応答は、それぞれセクション2.3、2.4、および2.5で定義されています。"
    },
    {
      "indent": 3,
      "text": "o The extension does not associate any new responses with pre-existing NNTP commands.",
      "ja": "o 拡張機能は、新しい応答を既存のNNTPコマンドに関連付けません。"
    },
    {
      "indent": 3,
      "text": "o The extension does not affect the behavior of a server or client other than via the new commands.",
      "ja": "o 拡張機能は、新しいコマンドを介してサーバーまたはクライアントの動作に影響しません。"
    },
    {
      "indent": 3,
      "text": "o The extension does not affect the maximum length of commands or initial response lines.",
      "ja": "o 拡張機能は、コマンドの最大長または初期応答ラインに影響しません。"
    },
    {
      "indent": 3,
      "text": "o The extension does not alter pipelining, and the MODE STREAM, CHECK, and TAKETHIS commands can be pipelined.",
      "ja": "o 拡張機能はパイプライニングを変更せず、モードストリーム、チェック、およびTakethisコマンドをパイプ化できます。"
    },
    {
      "indent": 3,
      "text": "o Use of this extension does not alter the capabilities list.",
      "ja": "o この拡張機能の使用は、機能リストを変更しません。"
    },
    {
      "indent": 3,
      "text": "o The extension does not cause any pre-existing command to produce a 401, 480, or 483 response.",
      "ja": "o 拡張機能により、既存のコマンドが401、480、または483の応答を生成することはありません。"
    },
    {
      "indent": 3,
      "text": "o Use of the MODE READER command on a mode-switching server may disable this extension.",
      "ja": "o モードスイッチングサーバーでモードリーダーコマンドを使用すると、この拡張子が無効になる場合があります。"
    },
    {
      "indent": 3,
      "text": "o Published Specification: This document.",
      "ja": "o 公開された仕様：このドキュメント。"
    },
    {
      "indent": 3,
      "text": "o Contact for Further Information: Authors of this document.",
      "ja": "o 詳細については、このドキュメントの著者にお問い合わせください。"
    },
    {
      "indent": 3,
      "text": "o Change Controller: IESG <iesg@ietf.org>.",
      "ja": "o コントローラーの変更：iesg <iesg@ietf.org>。"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgements",
      "section_title": true,
      "ja": "7. 謝辞"
    },
    {
      "indent": 3,
      "text": "This document is based heavily on the relevant sections of RFC 2980 [NNTP-COMMON], by Stan Barber.",
      "ja": "このドキュメントは、Stan BarberによるRFC 2980 [NNTP-Common]の関連セクションに大きく基づいています。"
    },
    {
      "indent": 3,
      "text": "Special acknowledgement also goes to Russ Allbery, Clive Feather, Andrew Gierth, and others who commented privately on intermediate revisions of this document, as well as the members of the IETF NNTP Working Group for continual (yet sporadic) insight in discussion.",
      "ja": "また、特別な謝辞は、ラス・オールベリー、クライヴ・フェザー、アンドリュー・ジャイアス、およびこの文書の中間修正について個人的にコメントした他の人々と、議論の継続的な（まだ散発的な）洞察のためのIETF NNTPワーキンググループのメンバーにも当てはまります。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8. 参考文献"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "ja": "8.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[ABNF] Crocker, D., Ed. and P. Overell, \"Augmented BNF for Syntax Specifications: ABNF\", RFC 4234, October 2005.",
      "ja": "[ABNF] Crocker、D.、ed。およびP. Overell、「構文仕様のためのBNFの増強：ABNF」、RFC 4234、2005年10月。"
    },
    {
      "indent": 3,
      "text": "[KEYWORDS] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[キーワード] Bradner、S。、「要件レベルを示すためにRFCで使用するためのキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[NNTP] Feather, C., \"Network News Transfer Protocol (NNTP)\", RFC 3977, October 2006.",
      "ja": "[NNTP] Feather、C。、「ネットワークニュース転送プロトコル（NNTP）」、RFC 3977、2006年10月。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "ja": "8.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[NNTP-COMMON] Barber, S., \"Common NNTP Extensions\", RFC 2980, October 2000.",
      "ja": "[NNTP-Common] Barber、S。、「Common NNTP拡張機能」、RFC 2980、2000年10月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Jeffrey M. Vinocur Department of Computer Science Upson Hall Cornell University Ithaca, NY 14853",
      "ja": "ジェフリー・M・ヴィノクルコンピュータサイエンスのヴィノクルアップソンホールコーネル大学イサカ、ニューヨーク14853"
    },
    {
      "indent": 3,
      "text": "EMail: vinocur@cs.cornell.edu",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Kenneth Murchison Carnegie Mellon University 5000 Forbes Avenue Cyert Hall 285 Pittsburgh, PA 15213 USA",
      "ja": "ケネスマーチソンカーネギーメロン大学5000フォーブスアベニューサイエートホール285ピッツバーグ、ペンシルバニア州15213 USA"
    },
    {
      "indent": 3,
      "text": "EMail: murch@andrew.cmu.edu",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 0,
      "text": "Copyright (C) The Internet Society (2006).",
      "ja": "Copyright（c）The Internet Society（2006）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "この文書は、BCP 78に含まれる権利、ライセンス、および制限の対象となり、そこに記載されている場合を除き、著者はすべての権利を保持しています。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "このドキュメントとここに含まれる情報は、「現状のまま」に基づいて提供されています。また、貢献者、彼/彼女が代表する組織（もしあれば）が後援する組織、インターネット協会とインターネット工学タスクフォースは、すべての保証、明示的または明示的、またはすべての保証を否認します。本書の情報の使用が、商品性または特定の目的に対する適合性の権利または黙示的な保証を侵害しないという保証を含むがこれらに限定されないことを含む。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、知的財産権またはその他の権利の有効性または範囲に関して、この文書に記載されている技術の実装または使用、またはそのような権利に基づくライセンスがどの程度であるかについての使用に関連すると主張する可能性があるという立場はありません。利用可能になります。また、そのような権利を特定するために独立した努力をしたことも表明していません。RFCドキュメントの権利に関する手順に関する情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IETF事務局に行われたIPR開示のコピーと、利用可能にするライセンスの保証、またはこの仕様の実装者またはユーザーによるそのような独自の権利の使用のための一般的なライセンスまたは許可を取得しようとする試みの結果を取得できます。http://www.ietf.org/iprのIETFオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、関心のある当事者に、著作権、特許、または特許出願、またはこの基準を実装するために必要な技術をカバーする可能性のあるその他の独自の権利を注意深く招待するよう招待しています。ietf-ipr@ietf.orgのIETFへの情報をお問い合わせください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is provided by the IETF Administrative Support Activity (IASA).",
      "ja": "RFCエディター機能の資金は、IETF管理サポートアクティビティ（IASA）によって提供されます。"
    }
  ]
}