{
  "title": {
    "text": "RFC 4103 - RTP Payload for Text Conversation",
    "ja": "RFC 4103 - テキスト会話のためのRTPペイロード"
  },
  "number": 4103,
  "created_at": "2019-10-19 19:34:40.537105+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                      G. Hellstrom\nRequest for Comments: 4103                                   Omnitor AB\nObsoletes: 2793                                                P. Jones\nCategory: Standards Track                           Cisco Systems, Inc.\n                                                              June 2005",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 19,
      "text": "RTP Payload for Text Conversation",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "ja": "著作権（C）インターネット協会（2005）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This memo obsoletes RFC 2793; it describes how to carry real-time text conversation session contents in RTP packets. Text conversation session contents are specified in ITU-T Recommendation T.140.",
      "ja": "このメモはRFC 2793を廃止します。それは、RTPパケットでリアルタイムのテキスト会話セッションの内容を運ぶ方法について説明します。テキスト会話セッション内容はITU-T勧告T.140で指定されています。"
    },
    {
      "indent": 3,
      "text": "One payload format is described for transmitting text on a separate RTP session dedicated for the transmission of text.",
      "ja": "一つのペイロードフォーマットは、テキストの送信専用の別個のRTPセッションのテキストを送信するために記載されています。"
    },
    {
      "indent": 3,
      "text": "This RTP payload description recommends a method to include redundant text from already transmitted packets in order to reduce the risk of text loss caused by packet loss.",
      "ja": "このRTPペイロード記述は、パケット損失によるテキストの損失のリスクを低減するために、既に送信したパケットから冗長なテキストを含める方法をお勧めします。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction ...................................................3\n2.  Conventions Used in This Document ..............................4\n3.  Usage of RTP ...................................................4\n    3.1. Motivations and Rationale .................................4\n    3.2. Payload Format for Transmission of text/t140 Data .........4\n    3.3. The \"T140block\" ...........................................5\n    3.4. Synchronization of Text with Other Media ..................5\n    3.5. RTP Packet Header .........................................5\n4.  Protection against Loss of Data ................................6\n    4.1. Payload Format When Using Redundancy ......................6\n    4.2. Using Redundancy with the text/t140 Format ................7\n5.  Recommended Procedure ..........................................8\n    5.1. Recommended Basic Procedure ...............................8\n    5.2. Transmission before and after \"Idle Periods\" ..............8\n    5.3. Detection of Lost Text Packets ............................9\n    5.4. Compensation for Packets Out of Order ....................10\n6.  Parameter for Character Transmission Rate .....................10\n7.  Examples ......................................................11\n    7.1. RTP Packetization Examples for the text/t140 Format ......11\n    7.2. SDP Examples .............................................13\n8.  Security Considerations .......................................14\n    8.1. Confidentiality ..........................................14\n    8.2. Integrity ................................................14\n    8.3. Source Authentication ....................................14\n9.  Congestion Considerations .....................................14\n10. IANA Considerations ...........................................16\n    10.1. Registration of MIME Media Type text/t140 ...............16\n    10.2. SDP Mapping of MIME Parameters ..........................17\n    10.3. Offer/Answer Consideration ..............................17\n11. Acknowledgements ..............................................18\n12. Normative References ..........................................18\n13. Informative References ........................................19",
      "raw": true,
      "ja": "1.はじめに\nこの文書で使用される2.表記\nRTPの3.使用\n    3.1。動機や理由\n    3.2。テキスト/ T140データの伝送のためのペイロードフォーマット\n    3.3。 「T140block」\n    3.4。その他のメディアでのテキストの同期\n    3.5。 RTPパケットヘッダ\nデータの損失に対する保護4。\n    4.1。ペイロードフォーマットの冗長性を使用して\n    4.2。テキスト/ T140形式で冗長性を使用して\n5.推奨手順\n    5.1。推奨基本手順\n    5.2。 「アイドル期間」の前と後の送信\n    5.3。失われたテキストパケットの検出\n    5.4。注文のうち、パケットの補償\n文字伝送速度の6パラメータ\n7.例\n    7.1。テキスト/ T140のフォーマットのためのRTPパケット化の例\n    7.2。 SDPの例\n8.セキュリティの考慮事項\n    8.1。機密性\n    8.2。整合性\n    8.3。ソース認証\n9.輻輳の考慮事項\n10. IANAの考慮事項\n    10.1。 MIMEメディアタイプのテキスト/ T140の登録\n    10.2。 MIMEパラメータのSDPマッピング\n    10.3。オファー/回答の考察\n11.謝辞\n12.引用規格\n13.参考文献"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "This document defines a payload type for carrying text conversation session contents in RTP [2] packets. Text conversation session contents are specified in ITU-T Recommendation T.140 [1]. Text conversation is used alone or in connection with other conversational facilities, such as video and voice, to form multimedia conversation services. Text in multimedia conversation sessions is sent character-by-character as soon as it is available, or with a small delay for buffering.",
      "ja": "この文書では、RTP [2]パケットをテキスト会話セッションの内容を搬送するペイロードタイプを定義します。テキスト会話セッション内容はITU-T勧告T.140で指定されている[1]。テキストの会話は、マルチメディア会話サービスを形成するために、単独で、または、そのような映像や音声などの他の会話の施設に関連して使用されています。マルチメディア会話セッションでのテキストは、それが利用可能である、あるいはバッファリングのためにわずかな遅延とするとすぐに文字ずつ送信されます。"
    },
    {
      "indent": 3,
      "text": "The text is intended to be entered by human users from a keyboard, handwriting recognition, voice recognition or any other input method. The rate of character entry is usually at a level of a few characters per second or less. In general, only one or a few new characters are expected to be transmitted with each packet. Small blocks of text may be prepared by the user and pasted into the user interface for transmission during the conversation, occasionally causing packets to carry more payload.",
      "ja": "テキストは、キーボード、手書き認識、音声認識やその他の入力方法から人間のユーザによって入力されることを意図しています。文字入力のレートは、数秒ごとに文字以下のレベルで通常です。一般的には、1つまたはいくつかの新しい文字は、各パケットを送信することが期待されます。テキストの小ブロックは、時々複数のペイロードを運ぶパケットを引き起こし、ユーザにより調製し、会話中に送信するためのユーザインタフェースに貼り付けることができます。"
    },
    {
      "indent": 3,
      "text": "T.140 specifies that text and other T.140 elements must be transmitted in ISO 10646-1 [5] code with UTF-8 [6] transformation. This makes it easy to implement internationally useful applications and to handle the text in modern information technology environments. The payload of an RTP packet that follows this specification consists of text encoded according to T.140, without any additional framing. A common case will be a single ISO 10646 character, UTF-8 encoded.",
      "ja": "T.140は、テキストおよび他のT.140要素はUTF-8 [6]に変換してISO 10646-1 [5]のコードで送信されなければならない特定します。これは、国際的に有用なアプリケーションを実装するために、現代の情報技術環境内のテキストを処理することが容易になります。この仕様を以下のRTPパケットのペイロードは、任意の付加的なフレーミングなしで、T.140に従って符号化されたテキストから成ります。一般的なケースは、単一のISO 10646文字、UTF-8でエンコードされます。"
    },
    {
      "indent": 3,
      "text": "T.140 requires the transport channel to provide characters without duplication and in original order. Text conversation users expect that text will be delivered with no, or a low level, of lost information.",
      "ja": "T.140は重複せず、元の順序で文字を提供するために、トランスポート・チャネルが必要です。テキスト会話ユーザーは、そのテキストが失われた情報を、全く、または低レベルで配信されません期待しています。"
    },
    {
      "indent": 3,
      "text": "Therefore, a mechanism based on RTP is specified here. It gives text arrival in correct order, without duplication, and with detection and indication of loss. It also includes an optional possibility to repeat data for redundancy in order to lower the risk of loss. Because packet overhead is usually much larger than the T.140 contents, the increase in bandwidth, with the use of redundancy, is minimal.",
      "ja": "したがって、RTPに基づくメカニズムが、ここで指定されています。それは重複せず、損失の検出と表示して、正しい順序でテキスト到着を与えます。それはまた、損失のリスクを低下させるために、冗長性のためのデータを繰り返すオプションの可能性を含みます。パケットオーバーヘッドは、冗長性を利用して、T.140内容、帯域幅の増加よりも通常はるかに大きいので、最小限です。"
    },
    {
      "indent": 3,
      "text": "By using RTP for text transmission in a multimedia conversation application, uniform handling of text and other media can be achieved in, for example, conferencing systems, firewalls, and network translation devices. This, in turn, eases the design and increases the possibility for prompt and proper media delivery.",
      "ja": "マルチメディア会話アプリケーションのテキスト伝送用のRTPを使用することで、テキストや他のメディアの均一な取り扱いはたとえば、会議システム、ファイアウォール、ネットワーク変換デバイスのために、中に達成することができます。これは、順番に、設計を容易にし、迅速かつ適切なメディア配信の可能性を高めます。"
    },
    {
      "indent": 3,
      "text": "This document obsoletes RFC 2793 [16]. The text clarifies ambiguities in RFC 2793, improves on the specific implementation requirements learned through development experience and gives explicit usage examples.",
      "ja": "この文書は、RFC 2793 [16]を廃止します。テキストは、RFC 2793であいまいさを明確に開発経験を通じて学習の特定の実施要件に向上し、明示的な使用例を示します。"
    },
    {
      "indent": 0,
      "text": "2. Conventions Used in This Document",
      "section_title": true,
      "ja": "この文書で使用される2.表記"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [4].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はありますRFC 2119に記載されるように解釈される[4]。"
    },
    {
      "indent": 0,
      "text": "3. Usage of RTP",
      "section_title": true,
      "ja": "RTPの3.使用"
    },
    {
      "indent": 3,
      "text": "The payload format for real-time text transmission with RTP [2] described in this memo is intended for general text conversation use and is called text/t140 after its MIME registration.",
      "ja": "このメモに記載され[2] RTPとリアルタイムテキスト伝送用のペイロードフォーマットは、一般的なテキストの会話の使用のために意図され、そのMIME登録後にテキスト/ T140と呼ばれます。"
    },
    {
      "indent": 0,
      "text": "3.1. Motivations and Rationale",
      "section_title": true,
      "ja": "3.1。動機や理由"
    },
    {
      "indent": 3,
      "text": "The text/t140 format is intended to be used for text transmitted on a separate RTP session, dedicated for the transmission of text, and not shared with other media.",
      "ja": "テキスト/ T140フォーマットは、別々のRTPセッションで送信テキストに使用されるテキストの送信専用の、及び他のメディアと共有しないことを意図しています。"
    },
    {
      "indent": 3,
      "text": "The text/t140 format MAY be used for any non-gateway application, as well as in gateways. It MAY be used simultaneously with other media streams, transmitted as a separate RTP session, as required in real time multimedia applications.",
      "ja": "テキスト/ T140形式は、任意の非ゲートウェイアプリケーションのための、ならびにゲートウェイで使用されるかもしれません。リアルタイムのマルチメディア・アプリケーションに必要とされるそれは、別々のRTPセッションとして送信し、他のメディアストリームと同時に使用されるかもしれません。"
    },
    {
      "indent": 3,
      "text": "The text/t140 format specified in this memo is compatible with its earlier definition in RFC 2793. It has been refined, with the main intention to minimize interoperability problems and encourage good reliability and functionality.",
      "ja": "このメモで指定したテキスト/ T140形式は、それが相互運用性の問題を最小限に抑え、優れた信頼性と機能性を奨励するための主な目的で、洗練されたRFC 2793.にその以前の定義と互換性があります。"
    },
    {
      "indent": 3,
      "text": "By specifying text transmission as a text medium, many good effects are gained. Routing, device selection, invocation of transcoding, selection of quality of service parameters, and other high and low level functions depend on each medium being explicitly specified.",
      "ja": "テキスト媒体としてのテキスト送信を指定することで、多くの良い効果が得ています。ルーティング、デバイスの選択、トランスコードの呼び出し、サービスパラメータの品質の選択、および他のハイとローレベルの機能は、明示的に指定されている各メディアに依存します。"
    },
    {
      "indent": 0,
      "text": "3.2. Payload Format for Transmission of text/t140 Data",
      "section_title": true,
      "ja": "3.2。テキスト/ T140データの伝送のためのペイロードフォーマット"
    },
    {
      "indent": 3,
      "text": "A text/t140 conversation RTP payload format consists of one, and only one, block of T.140 data, referred to as a \"T140block\" (see Section 3.3). There are no additional headers specific to this payload format. The fields in the RTP header are set as defined in Section 3.5, carried in network byte order (see RFC 791 [12]).",
      "ja": "テキスト/ T140会話RTPペイロードフォーマットは、一つで構成され、一つだけ、「T140block」というT.140データのブロック（セクション3.3を参照します）。このペイロード形式に固有の追加のヘッダはありません。 RTPヘッダ内のフィールドは、（RFC 791 [12]参照）のセクション3.5で定義されるように、設定されたネットワークバイト順に搬送されます。"
    },
    {
      "indent": 0,
      "text": "3.3. The \"T140block\"",
      "section_title": true,
      "ja": "3.3。 「T140block」"
    },
    {
      "indent": 3,
      "text": "T.140 text is UTF-8 coded, as specified in T.140, with no extra framing. The T140block contains one or more T.140 code elements as specified in [1]. Most T.140 code elements are single ISO 10646 [5] characters, but some are multiple character sequences. Each character is UTF-8 encoded [6] into one or more octets. Each block MUST contain an integral number of UTF-8 encoded characters regardless of the number of octets per character. Any composite character sequence (CCS) SHOULD be placed within one block.",
      "ja": "余分なフレーミングで、T.140に指定されているT.140テキストは、UTF-8コード化されています。 T140block [1]で指定されたような1つ以上のT.140コード要素を含みます。ほとんどのT.140コード要素は、ISO 10646 [5]文字シングルですが、いくつかは、複数の文字列です。各文字は、一個の以上のオクテットにUTF-8でエンコードされた[6]です。各ブロックには関係なく、文字ごとのオクテット数のUTF-8エンコードされた文字の整数を含まなければなりません。任意の複合文字シーケンス（CCS）は、一つのブロック内に配置されるべきです。"
    },
    {
      "indent": 0,
      "text": "3.4. Synchronization of Text with Other Media",
      "section_title": true,
      "ja": "3.4。その他のメディアでのテキストの同期"
    },
    {
      "indent": 3,
      "text": "Usually, each medium in a session utilizes a separate RTP stream. As such, if synchronization of the text and other media packets is important, the streams MUST be associated when the sessions are established and the streams MUST share the same reference clock (refer to the description of the timestamp field as it relates to synchronization in Section 5.1 of RFC 3550 [2]). Association of RTP streams can be done through the CNAME field of RTCP SDES function. It is dependent on the particular application and is outside the scope of this document.",
      "ja": "通常、セッション内の各メディアは別々のRTPストリームを利用しています。テキストおよび他のメディアパケットの同期が重要である場合など、セッションが確立されたときにストリームが関連しなければならなくて、ストリームが同じ基準クロックを共有する必要があり、それはセクションにおける同期に関連する（タイムスタンプフィールドの説明を参照RFC 3550の5.1 [2]）。 RTPストリームの協会は、RTCP SDES機能のCNAMEフィールドを介して行うことができます。これは、特定のアプリケーションに依存し、この文書の範囲外です。"
    },
    {
      "indent": 0,
      "text": "3.5. RTP Packet Header",
      "section_title": true,
      "ja": "3.5。 RTPパケットヘッダ"
    },
    {
      "indent": 3,
      "text": "Each RTP packet starts with a fixed RTP header. The following fields of the RTP fixed header are specified for T.140 text streams:",
      "ja": "各RTPパケットは、固定されたRTPヘッダで始まります。 RTP固定ヘッダの次のフィールドは、T.140テキストストリームに指定されています。"
    },
    {
      "indent": 3,
      "text": "Payload Type (PT): The assignment of an RTP payload type is specific to the RTP profile under which the payload format is used. For profiles that use dynamic payload type number assignment, this payload format can be identified by the MIME type \"text/t140\" (see Section 10). If redundancy is used per RFC 2198, another payload type number needs to be provided for the redundancy format. The MIME type for identifying RFC 2198 is available in RFC 4102 [9].",
      "ja": "ペイロードタイプ（PT）：RTPペイロードタイプの割り当ては、ペイロード・フォーマットが使用される下RTPプロファイルに特異的です。ダイナミックペイロードタイプ番号の割り当てを使用するプロファイルの場合、このペイロードフォーマットは、MIMEタイプによって識別することができ、「テキスト/ T140」（セクション10を参照）。冗長性は、RFC 2198ごとに使用される場合、別のペイロードタイプ番号は、冗長形式のために提供される必要があります。 RFC 2198を識別するためのMIMEタイプは、RFC 4102で入手可能である[9]。"
    },
    {
      "indent": 3,
      "text": "Sequence number: The definition of sequence numbers is available in RFC 3550 [2]. When transmitting text using the payload format for text/t140, it is used for detection of packet loss and out-of-order packets, and can be used in the process of retrieval of redundant text, reordering of text and marking missing text.",
      "ja": "配列番号：シーケンス番号の定義は、RFC 3550で入手可能である[2]。テキスト/ T140のためのペイロード・フォーマットを使用してテキストを送信する場合、それは、パケットロス及びアウトオブオーダーパケットの検出のために使用され、冗長なテキスト、テキストの並べ替えの検索の過程で使用され、不足しているテキストをマークすることができます。"
    },
    {
      "indent": 3,
      "text": "Timestamp: The RTP Timestamp encodes the approximate instance of entry of the primary text in the packet. A clock frequency of 1000 Hz MUST be used. Sequential packets MUST NOT use the same timestamp. Because packets do not represent any constant duration, the timestamp cannot be used to directly infer packet loss.",
      "ja": "タイムスタンプ：RTPタイムスタンプは、パケット内のプライマリテキストのエントリのおおよそのインスタンスをエンコードします。 1000Hzでのクロック周波数を使用しなければなりません。シーケンシャルパケットは同じタイムスタンプを使用してはなりません。パケットは、任意の一定の持続時間を表すものではありませんので、タイムスタンプは、直接パケット損失を推測するために使用することはできません。"
    },
    {
      "indent": 3,
      "text": "M-bit: The M-bit MUST be included. The first packet in a session, and the first packet after an idle period, SHOULD be distinguished by setting the marker bit in the RTP data header to one. The marker bit in all other packets MUST be set to zero. The reception of the marker bit MAY be used for refined methods for detection of loss.",
      "ja": "Mビット：Mビットを含まなければなりません。セッションの最初のパケット、及びアイドル期間後の最初のパケットは、一つにRTPデータヘッダ内のマーカビットを設定することによって区別されるべきです。他のすべてのパケットでマーカービットはゼロに設定しなければなりません。マーカービットの受信は、損失の検出のための洗練された方法のために使用されるかもしれません。"
    },
    {
      "indent": 0,
      "text": "4. Protection against Loss of Data",
      "section_title": true,
      "ja": "データの損失に対する保護4。"
    },
    {
      "indent": 3,
      "text": "Consideration must be devoted to keeping loss of text due to packet loss within acceptable limits. (See ITU-T F.703 [17])",
      "ja": "対価は、許容範囲内にパケットロスにテキストの損失を保つことに専念しなければなりません。 （[17] ITU-T F.703を参照）。"
    },
    {
      "indent": 3,
      "text": "The default method that MUST be used, when no other method is explicitly selected, is redundancy in accordance with RFC 2198 [3]. When this method is used, the original text and two redundant generations SHOULD be transmitted if the application or end-to-end conditions do not call for other levels of redundancy to be used.",
      "ja": "他の方法は、明示的に選択されていない場合、使用しなければならないデフォルトの方法は、RFC 2198 [3]に応じて冗長性です。この方法を使用する場合、アプリケーションまたはエンド・ツー・エンドの条件が使用される冗長性の他のレベルを要求しない場合、元のテキストと2つの冗長世代が送信されなければなりません。"
    },
    {
      "indent": 3,
      "text": "Forward Error Correction mechanisms, as per RFC 2733 [8], or any other mechanism with the purpose of increasing the reliability of text transmission, MAY be used as an alternative or complement to redundancy. Text data MAY be sent without additional protection if end-to-end network conditions allow the text quality requirements, specified in ITU-T F.703 [17], to be met in all anticipated load conditions.",
      "ja": "RFC 2733通りの順方向誤り訂正メカニズムは、[8]、またはテキスト伝送の信頼性を向上させる目的を有する他の任意の機構、代替物として使用されるか、または冗長性を補完するかもしれません。エンドツーエンドのネットワーク条件は、ITU-T F.703 [17]で指定したテキストの品質要件は、すべての予想される負荷条件で会ったことが許せば、テキストデータは、追加の保護なしで送信されるかもしれません。"
    },
    {
      "indent": 0,
      "text": "4.1. Payload Format When Using Redundancy",
      "section_title": true,
      "ja": "4.1。ペイロードフォーマットの冗長性を使用して"
    },
    {
      "indent": 3,
      "text": "When using the payload format with redundant data, the transmitter may select a number of T140block generations to retransmit in each packet. A higher number introduces better protection against loss of text but marginally increases the data rate.",
      "ja": "冗長データとペイロード・フォーマットを使用する場合、送信機は、各パケットに再送信するT140block世代の数を選択することができます。数値が大きいほど、テキストの損失に対するより良い保護を紹介するが、わずかにデータ速度を増加させます。"
    },
    {
      "indent": 3,
      "text": "The RTP header is followed by one or more redundant data block headers: one for each redundant data block to be included. Each of these headers provides the timestamp offset and length of the corresponding data block, in addition to a payload type number (indicating the payload format text/t140).",
      "ja": "各冗長データブロックのための1つに含まれるべき：RTPヘッダは、一つ以上の冗長データブロックヘッダが続きます。これらのヘッダの各々は、タイムスタンプオフセットおよび対応するデータブロックの長さ、ペイロードタイプ番号に加えて（ペイロード形式のテキスト/ T140を示す）を提供します。"
    },
    {
      "indent": 3,
      "text": "The redundant data block headers are followed by the redundant data fields carrying T140blocks from previous packets. Finally, the new (primary) T140block for this packet follows.",
      "ja": "冗長データブロックヘッダは、前パケットからT140blocksを搬送する冗長データフィールドが続きます。最後に、このパケットのための新たな（プライマリ）T140blockは、以下の通りです。"
    },
    {
      "indent": 3,
      "text": "Redundant data that would need a timestamp offset higher than 16383 (due to its age at transmission) MUST NOT be included in transmitted packets.",
      "ja": "タイムスタンプを必要とする冗長データは、（原因送信時の年齢に）16383よりも高いオフセット送信したパケットに含まれてはいけません。"
    },
    {
      "indent": 0,
      "text": "4.2. Using Redundancy with the text/t140 Format",
      "section_title": true,
      "ja": "4.2。テキスト/ T140形式で冗長性を使用して"
    },
    {
      "indent": 3,
      "text": "Because text is transmitted only when there is text to transmit, the timestamp is not used to identify a lost packet. Rather, missing sequence numbers are used to detect lost text packets at reception. Also, because sequence numbers are not provided in the redundant header, some additional rules must be followed to allow redundant data that corresponds to missing primary data to be properly merged into the stream of primary data T140blocks. They are:",
      "ja": "テキストが送信するテキストがある場合にのみ送信されるため、タイムスタンプが失われたパケットを識別するために使用されていません。むしろ、不足しているシーケンス番号は、受信時に失われたテキストパケットを検出するために使用されています。シーケンス番号は、冗長ヘッダに設けられていないためにも、いくつかの追加のルールが適切に次データT140blocksのストリームにマージされるプライマリ・データを欠落に対応する冗長データを可能にするために従わなければなりません。彼らです："
    },
    {
      "indent": 3,
      "text": "- Each redundant data block MUST contain the same data as a T140block previously transmitted as primary data.",
      "ja": " - 各冗長データブロックは、以前に一次データとして伝送T140blockと同じデータを含まなければなりません。"
    },
    {
      "indent": 3,
      "text": "- The redundant data MUST be placed in age order, with the most recent redundant T140block last in the redundancy area.",
      "ja": " - 冗長データは冗長領域内の最後の最も最近の冗長T140blockで、年齢順に置かなければなりません。"
    },
    {
      "indent": 3,
      "text": "- All T140blocks, from the oldest desired generation up through the generation immediately preceding the new (primary) T140block, MUST be included.",
      "ja": " - すべてT140blocksは、直ちに新しい（一次）T140blockの前世代を経て、最も古い所望の生成アップから、含まなければなりません。"
    },
    {
      "indent": 3,
      "text": "These rules allow the sequence numbers for the redundant T140blocks to be inferred by counting backwards from the sequence number in the RTP header. The result will be that all the text in the payload will be contiguous and in order.",
      "ja": "これらのルールは、冗長T140blocksのシーケンス番号は、RTPヘッダ内のシーケンス番号から後方に数えることによって推測することを可能にします。結果は、ペイロード内のすべてのテキストが連続して順番になることになります。"
    },
    {
      "indent": 3,
      "text": "If there is a gap in the received RTP sequence numbers, and redundant T140blocks are available in a subsequent packet, the sequence numbers for the redundant T140blocks should be inferred by counting backwards from the sequence number in the RTP header for that packet. If there are redundant T140blocks with sequence numbers matching those that are missing, the redundant T140blocks may be substituted for the missing T140blocks.",
      "ja": "受信したRTPシーケンス番号、冗長T140blocksにギャップがある場合、後続のパケットで提供され、冗長T140blocksのシーケンス番号は、そのパケットのRTPヘッダのシーケンス番号から後方に数えることによって推測されるべきです。欠落しているものと一致するシーケンス番号、冗長T140blocksがある場合は、冗長T140blocksが欠落T140blocks置換されていてもよいです。"
    },
    {
      "indent": 0,
      "text": "5. Recommended Procedure",
      "section_title": true,
      "ja": "5.推奨手順"
    },
    {
      "indent": 3,
      "text": "This section contains RECOMMENDED procedures for usage of the payload format. Based on the information in the received packets, the receiver can:",
      "ja": "このセクションは、ペイロードフォーマットの使用のための推奨手順を含んでいます。受信パケット内の情報に基づいて、受信機は、缶："
    },
    {
      "indent": 6,
      "text": "- reorder text received out of order. - mark where text is missing because of packet loss. - compensate for lost packets by using redundant data.",
      "ja": " - 再発注テキストは、順不同で受け取りました。 - なぜなら、パケットロスのテキストが欠落しているマーク。 - 冗長データを用いて、失われたパケットを補償します。"
    },
    {
      "indent": 0,
      "text": "5.1. Recommended Basic Procedure",
      "section_title": true,
      "ja": "5.1。推奨基本手順"
    },
    {
      "indent": 3,
      "text": "Packets are transmitted when there is valid T.140 data to transmit.",
      "ja": "パケットは、送信するために有効なT.140データがある場合に送信されます。"
    },
    {
      "indent": 3,
      "text": "T.140 specifies that T.140 data MAY be buffered for transmission with a maximum buffering time of 500 ms. A buffering time of 300 ms is RECOMMENDED when the application or end-to-end network conditions are not known to require another value.",
      "ja": "T.140は、T.140データが500ミリ秒の最大バッファリング時間と送信のためにバッファリングすることができることを指定します。アプリケーションまたはエンドツーエンドのネットワーク条件が別の値を必要とすることが知られていない場合に300ミリ秒のバッファ時間が推奨されます。"
    },
    {
      "indent": 3,
      "text": "If no new data is available for a longer period than the buffering time, the transmission process is in an idle period.",
      "ja": "新しいデータがバッファリング時間よりも長い期間のために利用可能でない場合、送信処理がアイドル期間です。"
    },
    {
      "indent": 3,
      "text": "When new text is available for transmission after an idle period, it is RECOMMENDED to send it as soon as possible. After this transmission, it is RECOMMENDED to buffer T.140 data in buffering time intervals, until the next idle period. This is done in order to keep the maximum bit rate usage for text at a reasonable level. The buffering time MUST be selected so that text users will perceive a real-time text flow.",
      "ja": "新しいテキストがアイドル期間後の送信のために利用可能である場合は、できるだけ早くそれを送信することをお勧めします。この送信後、それを次のアイドル期間まで、バッファリング時間間隔でT.140データをバッファすることが推奨されます。これは、合理的なレベルでのテキストの最大ビットレートの使用量を維持するために行われます。テキストユーザーは、リアルタイムのテキストフローを知覚するように、バッファリング時間を選択する必要があります。"
    },
    {
      "indent": 0,
      "text": "5.2. Transmission before and after \"Idle Periods\"",
      "section_title": true,
      "ja": "5.2。 「アイドル期間」の前と後の送信"
    },
    {
      "indent": 3,
      "text": "When valid T.140 data has been sent and no new T.140 data is available for transmission after the selected buffering time, an empty T140block SHOULD be transmitted. This situation is regarded as the beginning of an idle period. The procedure is recommended in order to more rapidly detect potentially missing text before an idle period.",
      "ja": "有効なT.140データが送信され、新たなT.140データが選択されたバッファリング時間の後に、送信のために利用できない場合は、空のT140blockが送信されるべきである（SHOULD）。この状況は、アイドル期間の開始とみなされています。手順は、より迅速にアイドル期間前に潜在的に不足しているテキストを検出するために推奨されます。"
    },
    {
      "indent": 3,
      "text": "An empty T140block contains no data.",
      "ja": "空T140blockはデータは含まれていません。"
    },
    {
      "indent": 3,
      "text": "When redundancy is used, transmission continues with a packet at every transmission timer expiration and insertion of an empty T.140block as primary, until the last non-empty T140block has been transmitted, as primary and as redundant data, with all intended generations of redundancy. The last packet before an idle period will contain only one non-empty T140block as redundant data, while the remainder of the redundancy packet will contain empty T140blocks.",
      "ja": "冗長性を使用する場合、最後の非空T140block冗長の全てを意図世代で、一次及び冗長データとして送信されるまで、送信は、プライマリとして空T.140blockのすべての送信タイマ満了と挿入にパケットを続行します。冗長パケットの残りの部分は空T140blocksを含有する一方、アイドル期間前の最後のパケットは、唯一の非空T140block冗長データを含むであろう。"
    },
    {
      "indent": 3,
      "text": "Any empty T140block sent as primary data MUST be included as redundant T140blocks in subsequent packets, just as normal text T140blocks would be, unless the empty T140block is too old to be transmitted. This is done so that sequence number inference for the redundant T140blocks will be correct, as explained in Section 4.2.",
      "ja": "任意の空のT140blockは、プライマリデータが空T140blockを送信することが古すぎる場合を除き、通常のテキストT140blocksは、ことと同じように、後続のパケットに冗長T140blocksを含まなければならない送りました。これはセクション4.2で説明したように、冗長T140blocksためにそのシーケンス番号推論は、正しいであろう行われます。"
    },
    {
      "indent": 3,
      "text": "After an idle period, the transmitter SHOULD set the M-bit to one in the first packet with new text.",
      "ja": "アイドル期間の後、送信機は、新しいテキストで最初のパケット内の1つにMビットを設定する必要があります。"
    },
    {
      "indent": 0,
      "text": "5.3. Detection of Lost Text Packets",
      "section_title": true,
      "ja": "5.3。失われたテキストパケットの検出"
    },
    {
      "indent": 3,
      "text": "Packet loss for text/t140 packets MAY be detected by observing gaps in the sequence numbers of RTP packets received by the receiver.",
      "ja": "テキスト/ T140パケットのパケット損失は、受信機によって受信されたRTPパケットのシーケンス番号のギャップを観察することによって検出することができます。"
    },
    {
      "indent": 3,
      "text": "With text/t140, the loss of packets is usually detected by comparison of the sequence of RTP packets as they arrive. Any discrepancy MAY be used to indicate loss. The highest RTP sequence number received may also be compared with that in RTCP reports, as an additional check for loss of the last packet before an idle period.",
      "ja": "彼らが到着すると、テキスト/ T140と、パケットの損失は、通常、RTPパケットの配列の比較によって検出されます。任意の不一致が損失を示すために使用されるかもしれません。受け取った最高のRTPシーケンス番号もそれと比較することができるRTCPレポートでは、アイドル期間前の最後のパケットの損失のための追加のチェックとして。"
    },
    {
      "indent": 3,
      "text": "Missing data SHOULD be marked by insertion of a missing text marker in the received stream for each missing T140block, as specified in ITU-T T.140 Addendum 1 [1].",
      "ja": "ITU-T T.140補遺1で指定されるように欠けているデータは、各欠落T140blockための受信されたストリームにおける欠落テキストマーカーの挿入によってマークされるべきである[1]。"
    },
    {
      "indent": 3,
      "text": "Because empty T140blocks are transmitted in the beginning of an idle period, there is a slight risk of falsely marking loss of text, when only an empty T140block was lost. Procedures based on detection of the packet with the M-bit set to one MAY be used to reduce the risk of introducing false markers of loss.",
      "ja": "空T140blocksは、アイドル期間の初めに送信されるため、唯一の空のT140blockが失われた際に誤って、テキストの損失をマーキングのわずかな危険性があります。いずれかに設定さMビットを有するパケットの検出に基づく手順は、損失の偽のマーカーを導入するリスクを低減するために使用され得ます。"
    },
    {
      "indent": 3,
      "text": "If redundancy is used with the text/t140 format, and a packet is received with fewer redundancy levels than normally in the session, it SHOULD be treated as if one empty T140block has been received for each excluded level in the received packet. This is because the only occasion when a T140block is excluded from transmission is when it is an empty T140block that has become too old to be transmitted.",
      "ja": "冗長性は、テキスト/ T140形式で使用され、そしてパケットがセッション中に通常よりも少ない冗長性レベルで受信される場合、それは1つの空T140blockは、受信したパケット内の各除外レベルのために受信されたかのように扱われるべきです。それが送信されるには余りにも古くなってきた空T140blockときT140blockを送信から除外されている唯一の機会であるためです。"
    },
    {
      "indent": 3,
      "text": "If two successive packets have the same number of redundant generations, it SHOULD be treated as the general redundancy level for the session. Change of the general redundancy level SHOULD only be done after an idle period.",
      "ja": "二つの連続するパケットが冗長世代数が同じ場合は、セッションのための一般的な冗長レベルとして扱われるべきです。一般的な冗長レベルの変更は、アイドル期間の後に行われる必要があります。"
    },
    {
      "indent": 3,
      "text": "The text/t140 format relies on use of the sequence number in the RTP packet header for detection of loss and, therefore, is not suitable for applications where it needs to be alternating with other payloads in the same RTP stream. It would be complicated and unreliable to try to detect loss of data at the edges of the shifts between t140 text and other stream contents. Therefore, text/t140 is RECOMMENDED to be the only payload type in the RTP stream.",
      "ja": "テキスト/ T140のフォーマットは、損失の検出のためのRTPパケットヘッダ内のシーケンス番号の使用に依存しており、従って、それが同一のRTPストリーム内の他のペイロードと交互にされる必要がある用途には適していません。 T140のテキストやその他のストリームのコンテンツ間のシフトのエッジでデータの損失を検出しようとする複雑で、信頼できないだろう。したがって、テキスト/ T140は、RTPストリーム内のみペイロードタイプであることが推奨されます。"
    },
    {
      "indent": 0,
      "text": "5.4. Compensation for Packets Out of Order",
      "section_title": true,
      "ja": "5.4。注文のうち、パケットの補償"
    },
    {
      "indent": 3,
      "text": "For protection against packets arriving out of order, the following procedure MAY be implemented in the receiver. If analysis of a received packet reveals a gap in the sequence and no redundant data is available to fill that gap, the received packet SHOULD be kept in a buffer to allow time for the missing packet(s) to arrive. It is RECOMMENDED that the waiting time be limited to 1 second.",
      "ja": "順不同で到着するパケットに対する保護のために、以下の手順では、受信機に実装することができます。受信したパケットの解析は、配列中のギャップを明らかにし、冗長データがそのギャップを埋めるために利用できない場合、受信したパケットが到着する欠落パケット（単数または複数）のための時間を可能にする緩衝液中で維持されるべきです。待機時間が1秒に制限することが推奨されます。"
    },
    {
      "indent": 3,
      "text": "If a packet with a T140block belonging to the gap arrives before the waiting time expires, this T140block is inserted into the gap and then consecutive T140blocks from the leading edge of the gap may be consumed. Any T140block that does not arrive before the time limit expires should be treated as lost and a missing text marker should be inserted (see Section 5.3).",
      "ja": "待機時間が満了する前にギャップに属するT140block持つパケットが到着した場合、このT140blockは隙間に挿入され、その後、ギャップの先端から連続T140blocksが消費されてもよいです。失われたと不足しているテキストマーカーを挿入する必要があるとして、制限時間が切れる前に到着していない任意のT140blockは（5.3節を参照）で処理されなければなりません。"
    },
    {
      "indent": 0,
      "text": "6. Parameter for Character Transmission Rate",
      "section_title": true,
      "ja": "文字伝送速度の6パラメータ"
    },
    {
      "indent": 3,
      "text": "In some cases, it is necessary to limit the rate at which characters are transmitted. For example, when a Public Switched Telephone Network (PSTN) gateway is interworking between an IP device and a PSTN textphone, it may be necessary to limit the character rate from the IP device in order to avoid throwing away characters (in case of buffer overflow at the PSTN gateway).",
      "ja": "場合によっては、文字が送信されるレートを制限する必要があります。例えば、公衆交換電話網（PSTN）ゲートウェイは、IPデバイスとPSTN textphone間のインターワーキングされ、バッファオーバーフローの場合には（文字を捨て回避するために、IPデバイスから文字速度を制限する必要があるかもしれないスイッチドPSTNゲートウェイで）。"
    },
    {
      "indent": 3,
      "text": "To control the character transmission rate, the MIME parameter \"cps\" in the \"fmtp\" attribute [7] is defined (see Section 10 ). It is used in SDP with the following syntax:",
      "ja": "文字の伝送速度を制御するために、「のfmtp」属性[7]におけるMIMEパラメータ「CPS」は（セクション10を参照）が定義されています。それは、次の構文でSDPで使用されます。"
    },
    {
      "indent": 6,
      "text": "a=fmtp:<format> cps=<integer>",
      "ja": "=のfmtp：<フォーマット>のCPS = <整数>"
    },
    {
      "indent": 3,
      "text": "The <format> field is populated with the payload type that is used for text. The <integer> field contains an integer representing the maximum number of characters that may be received per second. The value shall be used as a mean value over any 10-second interval. The default value is 30.",
      "ja": "<フォーマット>フィールドは、テキストのために使用されるペイロードタイプが移入されます。 <整数>フィールドは、秒あたりに受信することができる文字の最大数を表す整数を含んでいます。値は、任意の10秒間隔で平均値として使用されなければなりません。デフォルト値は30です。"
    },
    {
      "indent": 3,
      "text": "Examples of use in SDP are found in Section 7.2.",
      "ja": "SDPでの使用の例は、7.2節に記載されています。"
    },
    {
      "indent": 3,
      "text": "In receipt of this parameter, devices MUST adhere to the request by transmitting characters at a rate at or below the specified <integer> value. Note that this parameter was not defined in RFC 2793 [16]. Therefore implementations of the text/t140 format may be in use that do not recognize and act according to this parameter. Therefore, receivers of text/t140 MUST be designed so they can handle temporary reception of characters at a higher rate than this parameter specifies. As a result malfunction due to buffer overflow is avoided for text conversation with human input.",
      "ja": "このパラメータの受信において、デバイスは、指定された<整数>値以下の速度で文字を送信することによって要求に従わなければなりません。このパラメータは、RFC 2793 [16]で定義されていないことに留意されたいです。したがって、テキスト/ T140形式の実装は、このパラメータに従って認識して作用しない用途にあってもよいです。彼らは、このパラメータの指定よりも高いレートでの文字の一時的な受信を扱うことができるようによって、テキスト/ T140の受信機を設計する必要があります。バッファオーバーフローによる結果誤動作ヒト入力とテキストの会話のために回避されます。"
    },
    {
      "indent": 0,
      "text": "7. Examples",
      "section_title": true,
      "ja": "7.例"
    },
    {
      "indent": 0,
      "text": "7.1. RTP Packetization Examples for the text/t140 Format",
      "section_title": true,
      "ja": "7.1。テキスト/ T140のフォーマットのためのRTPパケット化の例"
    },
    {
      "indent": 3,
      "text": "Below is an example of a text/t140 RTP packet without redundancy.",
      "ja": "以下は、冗長性のないテキスト/ T140のRTPパケットの例です。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|V=2|P|X| CC=0  |M|   T140 PT   |       sequence number         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                      timestamp (1000Hz)                       |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|           synchronization source (SSRC) identifier            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                      T.140 encoded data                       |\n+                                               +---------------+\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Below is an example of a text/t140 RTP packet with one redundant T140block.",
      "ja": "以下一つの冗長T140blockのテキスト/ T140のRTPパケットの例です。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|V=2|P|X| CC=0  |M|  \"RED\" PT   |   sequence number of primary  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|               timestamp of primary encoding \"P\"               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|           synchronization source (SSRC) identifier            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|1|   T140 PT   |  timestamp offset of \"R\"  | \"R\" block length  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|0|   T140 PT   | \"R\" T.140 encoded redundant data              |\n+-+-+-+-+-+-+-+-+                               +---------------+\n+                                               |               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+     +-+-+-+-+-+\n|                \"P\" T.140 encoded primary data       |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Below is an example of an RTP packet with one redundant T140block using text/t140 payload format. The primary data block is empty, which is the case when transmitting a packet for the sole purpose of forcing the redundant data to be transmitted in the absence of any new data.",
      "ja": "以下のテキスト/ T140ペイロードフォーマットを使用して、一つの冗長T140blockのRTPパケットの例です。プライマリ・データ・ブロックは、新しいデータが存在しない状態で送信される冗長データを強制する唯一の目的のためにパケットを送信する場合であるれ、空です。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|V=2|P|X| CC=0  |M|  \"RED\" PT   |   sequence number of primary  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|               timestamp of primary encoding \"P\"               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|           synchronization source (SSRC) identifier            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|1|   T140 PT   |  timestamp offset of \"R\"  | \"R\" block length  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|0|   T140 PT   | \"R\" T.140 encoded redundant data              |\n+-+-+-+-+-+-+-+-+                               +---------------+\n|                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "As a follow-on to the previous example, the example below shows the next RTP packet in the sequence, which does contain a real T140block when using the text/t140 payload format. Note that the empty block is present in the redundant transmissions of the text/t140 payload format. This example shows two levels of redundancy and one primary data block. The value of the \"R2 block length\" would be set to zero in order to represent the empty T140block.",
      "ja": "後続の前の例としては、以下の例では、テキスト/ T140ペイロードフォーマットを使用する場合、実T140blockを含有しないシーケンス内の次のRTPパケットを示します。空きブロックがテキスト/ T140ペイロードフォーマットの冗長送信中に存在することに留意されたいです。この例では、冗長性の2つのレベルの一次データブロックを示しています。 「R2ブロック長さ」の値は空T140blockを表現するためにゼロに設定されることになります。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|V=2|P|X| CC=0  |M|  \"RED\" PT   |   sequence number of primary  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|               timestamp of primary encoding \"P\"               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|           synchronization source (SSRC) identifier            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|1|   T140 PT   |  timestamp offset of \"R2\" | \"R2\" block length |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|1|   T140 PT   |  timestamp offset of \"R1\" | \"R1\" block length |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|0|   T140 PT   | \"R1\" T.140 encoded redundant data             |\n+-+-+-+-+-+-+-+-+                               +---------------+\n|                                               |               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+         +-+-+-+\n|              \"P\" T.140 encoded primary data             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "7.2. SDP Examples",
      "section_title": true,
      "ja": "7.2。 SDPの例"
    },
    {
      "indent": 3,
      "text": "Below is an example of SDP, which describes RTP text transport on port 11000:",
      "ja": "以下は、ポート11000上のRTPテキスト輸送を記述するSDPの例です。"
    },
    {
      "indent": 6,
      "text": "m=text 11000 RTP/AVP 98 a=rtpmap:98 t140/1000",
      "ja": "M =テキスト11000 RTP / AVP 98 = rtpmap：98 T140 / 1000"
    },
    {
      "indent": 3,
      "text": "Below is an example of SDP that is similar to the above example, but also utilizes RFC 2198 to provide the recommended two levels of redundancy for the text packets:",
      "ja": "以下、上記の例と同様であるSDPの一例であるだけでなく、テキスト・パケットの冗長性の推奨二つのレベルを提供するためにRFC 2198を利用します。"
    },
    {
      "indent": 6,
      "text": "m=text 11000 RTP/AVP 98 100 a=rtpmap:98 t140/1000 a=rtpmap:100 red/1000 a=fmtp:100 98/98/98",
      "ja": "M =テキスト11000 RTP / AVP 98 100 = rtpmap：98 T140 / 1000 = rtpmap：100赤/ 1000 =のfmtp：100 98/98/98"
    },
    {
      "indent": 3,
      "text": "Note: Although these examples utilize the RTP/AVP profile, it is not intended to limit the scope of this memo. Any appropriate profile may be used in conjunction with this memo.",
      "ja": "注：これらの実施例は、RTP / AVPプロファイルを利用するが、このメモの範囲を限定するものではありません。任意の適切なプロファイルは、このメモと一緒に使用することができます。"
    },
    {
      "indent": 0,
      "text": "8. Security Considerations",
      "section_title": true,
      "ja": "8.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "All of the security considerations from Section 14 of RFC 3550 [2] apply.",
      "ja": "RFC 3550のセクション14からのセキュリティ上の考慮事項のすべては、[2]適用されます。"
    },
    {
      "indent": 0,
      "text": "8.1. Confidentiality",
      "section_title": true,
      "ja": "8.1。機密性"
    },
    {
      "indent": 3,
      "text": "Because the intention of the described payload format is to carry text in a text conversation, security measures in the form of encryption are of importance. The amount of data in a text conversation session is low. Therefore, any encryption method MAY be selected and applied to T.140 session contents or to whole RTP packets. Secure Real-time Transport Protocol (SRTP) [14] provides a suitable method for ensuring confidentiality.",
      "ja": "説明ペイロードフォーマットの意図は、テキストの会話のテキストを運ぶことであるため、暗号化の形でセキュリティ対策が重要です。テキスト会話セッションのデータ量が低いです。したがって、任意の暗号化方法を選択し、T.140セッション内容に又は全体RTPパケットに適用されてもよいです。セキュアリアルタイムトランスポートプロトコル（SRTP）は、[14]機密性を確保するのに適した方法を提供します。"
    },
    {
      "indent": 0,
      "text": "8.2. Integrity",
      "section_title": true,
      "ja": "8.2。整合性"
    },
    {
      "indent": 3,
      "text": "It may be desirable to protect the text contents of an RTP stream against manipulation. SRTP [14] provides methods for providing integrity that MAY be applied.",
      "ja": "操作に対するRTPストリームのテキストコンテンツを保護することが望ましいです。 SRTP [14]適用することができる完全性を提供するための方法を提供します。"
    },
    {
      "indent": 0,
      "text": "8.3. Source Authentication",
      "section_title": true,
      "ja": "8.3。ソース認証"
    },
    {
      "indent": 3,
      "text": "There are several methods of making sure the source of the text is the intended one.",
      "ja": "テキストのソースが意図した1であることを確認することにはいくつかの方法があります。"
    },
    {
      "indent": 3,
      "text": "Text streams are usually used in a multimedia control environment. Security measures for authentication are available and SHOULD be applied in the registration and session establishment procedures, so that the identity of the sender of the text stream is reliably associated with the person or device setting up the session. Once established, SRTP [14] mechanisms MAY be applied to ascertain that the source is maintained the same during the session.",
      "ja": "テキストストリームは、通常、マルチメディアコントロール環境で使用されています。認証のためのセキュリティ対策が利用可能であり、テキストストリームの送信者の身元を確実にセッションをセットアップする人やデバイスに関連付けられているように、登録およびセッション確立手順に適用されるべきです。確立されると、SRTP [14]メカニズムは、ソースがセッション中に同じに維持されていることを確認するために適用されてもよいです。"
    },
    {
      "indent": 0,
      "text": "9. Congestion Considerations",
      "section_title": true,
      "ja": "9.輻輳の考慮事項"
    },
    {
      "indent": 3,
      "text": "The congestion considerations from Section 10 of RFC 3550 [2], Section 6 of RFC 2198 [3], and any used profile (e.g., the section about congestion in chapter 2 of RFC 3551 [11]) apply with the following application-specific considerations.",
      "ja": "RFC 3550のセクション10から輻輳考察[2]は、RFC 2198のセクション6 [3]、及び任意使用のプロファイル（例えば、RFCの第2章の輻輳に関するセクション3551 [11]）、アプリケーション固有の以下で適用します検討事項。"
    },
    {
      "indent": 3,
      "text": "Automated systems MUST NOT use this format to send large amounts of text at rates significantly above those a human user could enter.",
      "ja": "自動化システムは、大幅に人間のユーザが入力することができ、それらの上のレートで大量のテキストを送信するには、このフォーマットを使用してはなりません。"
    },
    {
      "indent": 3,
      "text": "Even if the network load from users of text conversation is usually very low, for best-effort networks an application MUST monitor the packet loss rate and take appropriate actions to reduce its sending rate (if this application sends at higher rate than what TCP would achieve over the same path). The reason for this is that this application, due to its recommended usage of two or more redundancy levels, is very robust against packet loss. At the same time, due to the low bit-rate of text conversations, if one considers the discussion in RFC 3714 [13], this application will experience very high packet loss rates before it needs to perform any reduction in the sending rate.",
      "ja": "テキストの会話のユーザーからネットワークの負荷は通常、ベストエフォート型のネットワークのための、非常に低い場合であっても、パケット損失率を監視し、このアプリケーションは、TCPが達成するであろうものよりも高いレートで送信した場合（その送信レートを低減するための適切な措置を取らなければならないアプリケーション）同じパスを超えます。この理由は二つ以上の冗長レベルのその推奨使用方法に起因するこのアプリケーションは、パケット損失に対して非常に堅牢であることです。それは送信レートの低下を実行する必要がある前に、同時に、原因テキストの会話の低ビットレートに、1は、[13] RFC 3714での議論を考慮した場合、このアプリケーションは非常に高いパケット損失率を経験することになります。"
    },
    {
      "indent": 3,
      "text": "If the application needs to reduce its sending rate, it SHOULD NOT reduce the number of redundancy levels below the default amount specified in Section 4. Instead, the following actions are RECOMMENDED in order of priority:",
      "ja": "アプリケーションは、その送信速度を低下させる必要がある場合、それは第4節の代わりに指定された既定量以下の冗長レベルの数を減らすべきではありません、以下のアクションが優先順位の高い順に推奨されています。"
    },
    {
      "indent": 3,
      "text": "- Increase the shortest time between transmissions (described in Section 5.1) from the recommended 300 ms to 500 ms, which is the highest value allowed according to T.140.",
      "ja": " -  T.140に従って許容最大値である500ミリ秒に推奨300ミリ秒から（セクション5.1を参照）伝送間の最短時間を増やします。"
    },
    {
      "indent": 3,
      "text": "- Limit the maximum rate of characters transmitted.",
      "ja": " - 送信された文字の最大速度を制限します。"
    },
    {
      "indent": 3,
      "text": "- Increase the shortest time between transmissions to a higher value, not higher than 5 seconds. This will cause unpleasant delays in transmission, beyond what is allowed according to T.140, but text will still be conveyed in the session with some usability.",
      "ja": " -  5秒よりも高い値ではなく、それ以上に送信間の最短時間を増やします。これはT.140に応じて許可されているものを超えて、伝送中に不快な遅延が発生しますが、テキストはまだいくつかのユーザビリティとのセッションで搬送されます。"
    },
    {
      "indent": 3,
      "text": "- Exclude participants from the session.",
      "ja": " - セッションからの参加者を除外します。"
    },
    {
      "indent": 3,
      "text": "Please note that if the reduction in bit-rate achieved through the above measures is not sufficient, the only remaining action is to terminate the session.",
      "ja": "上記の対策によって達成ビットレートの低減が十分でない場合、唯一残っているアクションがセッションを終了することであることに注意してください。"
    },
    {
      "indent": 3,
      "text": "As guidance, some load figures are provided here as examples based on use of IPv4, including the load from IP, UDP, and RTP headers without compression .",
      "ja": "指針として、いくつかの負荷の数値は圧縮せずにIP、UDP、およびRTPヘッダからの負荷を含めたIPv4の使用に基づいて例としてここに提供されています。"
    },
    {
      "indent": 3,
      "text": "- Experience tells that a common mean character transmission rate, during a complete PSTN text telephony session, is around two characters per second.",
      "ja": " - 経験は、共通の平均文字の伝送速度は、完全なPSTNテキスト電話セッションの間、毎秒約2文字であることを伝えます。"
    },
    {
      "indent": 3,
      "text": "- A maximum performance of 20 characters per second is enough even for voice-to-text applications.",
      "ja": " - 毎秒20文字の最大のパフォーマンスでも、音声からテキストへの応用のために十分です。"
    },
    {
      "indent": 3,
      "text": "- With the (unusually high) load of 20 characters per second, in a language that makes use of three octets per UTF-8 character, two redundant levels, and 300 ms between transmissions, the maximum load of this application is 3300 bits/s.",
      "ja": " - 毎秒20文字の（異常に高い）負荷で、UTF-8文字、2つの冗長レベル、及び送信間の300ミリ秒ごとに3つのオクテットを利用した言語で、このアプリケーションの最大荷重は、/ sの3300ビットであります。"
    },
    {
      "indent": 3,
      "text": "- When the restrictions mentioned above are applied, limiting transmission to 10 characters per second, using 5 s between transmissions, the maximum load of this application, in a language that uses one octet per UTF-8 character, is 300 bits/s.",
      "ja": " - 上記制限が適用された場合、毎秒10の文字への送信を制限する送信間の5秒を使用して、このアプリケーションの最大荷重は、UTF-8文字ごとに1つのオクテットを使用する言語では、300ビット/ sです。"
    },
    {
      "indent": 3,
      "text": "Note that this payload can be used in a congested situation as a last resort to maintain some contact when audio and video media need to be stopped. The availability of one low bit-rate stream for text in such adverse situations may be crucial for maintaining some communication in a critical situation.",
      "ja": "このペイロードは、オーディオとビデオのメディアが停止する必要がある場合、いくつかの接触を維持するために、最後の手段として混雑状況で使用できることに注意してください。そのような不利な状況でのテキストのための1つの低ビットレートストリームの可用性が重要な状況で、いくつかの通信を維持するために重要かもしれません。"
    },
    {
      "indent": 0,
      "text": "10. IANA Considerations",
      "section_title": true,
      "ja": "10. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document updates the RTP payload format named \"t140\" and the associated MIME type \"text/t140\", in the IANA RTP and Media Type registries.",
      "ja": "このドキュメントは、IANA RTPメディアタイプレジストリに、「T140」という名前のRTPペイロードフォーマットと関連するMIMEタイプ「テキスト/ T140」を更新します。"
    },
    {
      "indent": 0,
      "text": "10.1. Registration of MIME Media Type text/t140",
      "section_title": true,
      "ja": "10.1。 MIMEメディアタイプのテキスト/ T140の登録"
    },
    {
      "indent": 3,
      "text": "MIME media type name: text",
      "ja": "MIMEメディアタイプ名：テキスト"
    },
    {
      "indent": 3,
      "text": "MIME subtype name: t140",
      "ja": "MIMEサブタイプ名：T140"
    },
    {
      "indent": 3,
      "text": "Required parameters: rate: The RTP timestamp clock rate, which is equal to the sampling rate. The only valid value is 1000.",
      "ja": "必須パラメータ：レート：サンプリングレートに等しいRTPタイムスタンプのクロックレート、。唯一の有効な値は1000です。"
    },
    {
      "indent": 3,
      "text": "Optional parameters: cps: The maximum number of characters that may be received per second. The default value is 30.",
      "ja": "オプションのパラメータ：CPS：秒あたりに受信することができる文字の最大数。デフォルト値は30です。"
    },
    {
      "indent": 3,
      "text": "Encoding considerations: T.140 text can be transmitted with RTP as specified in RFC 4103.",
      "ja": "エンコードの考慮事項：RFC 4103で指定されているT.140テキストがRTPで送信することができます。"
    },
    {
      "indent": 3,
      "text": "Security considerations: See Section 8 of RFC 4103.",
      "ja": "セキュリティの考慮事項：RFC 4103のセクション8を参照してください。"
    },
    {
      "indent": 3,
      "text": "Interoperability considerations: This format is the same as specified in RFC2793. For RFC2793 the \"cps=\" parameter was not defined. Therefore, there may be implementations that do not consider this parameter. Receivers need to take that into account.",
      "ja": "相互運用性に関する注意事項：このフォーマットは、RFC2793で指定されたものと同じです。 RFC2793は、「CPS =」パラメータが定義されていませんでした。そのため、このパラメータを考慮していない実装があるかもしれません。レシーバではこの点を考慮に入れする必要があります。"
    },
    {
      "indent": 3,
      "text": "Published specification: ITU-T T.140 Recommendation. RFC 4103.",
      "ja": "公開された仕様：ITU-T勧告T.140。 RFC 4103。"
    },
    {
      "indent": 3,
      "text": "Applications which use this media type: Text communication terminals and text conferencing tools.",
      "ja": "このメディアタイプを使用するアプリケーション：テキスト通信端末とテキスト会議ツール。"
    },
    {
      "indent": 3,
      "text": "Additional information: This type is only defined for transfer via RTP.",
      "ja": "追加情報：このタイプは、唯一のRTPを介した転送のために定義されています。"
    },
    {
      "indent": 3,
      "text": "Magic number(s): None",
      "ja": "マジックナンバー（S）：なし"
    },
    {
      "indent": 3,
      "text": "File extension(s): None Macintosh File Type Code(s): None",
      "ja": "ファイルの拡張子（秒）：なしMacintoshのファイルタイプコード（S）：なし"
    },
    {
      "indent": 3,
      "text": "Person & email address to contact for further information: Gunnar Hellstrom E-mail: gunnar.hellstrom@omnitor.se",
      "ja": "人と詳細のために連絡する電子メールアドレス：グンナー・ヘルストロームEメール：gunnar.hellstrom@omnitor.se"
    },
    {
      "indent": 3,
      "text": "Intended usage: COMMON",
      "ja": "意図している用法：COMMON"
    },
    {
      "indent": 3,
      "text": "Author / Change controller: Gunnar Hellstrom | IETF avt WG gunnar.hellstrom@omnitor.se |",
      "ja": "著者/変更コントローラ：グンナー・ヘルストローム| IETF AVT WG gunnar.hellstrom@omnitor.se |"
    },
    {
      "indent": 0,
      "text": "10.2. SDP Mapping of MIME Parameters",
      "section_title": true,
      "ja": "10.2。 MIMEパラメータのSDPマッピング"
    },
    {
      "indent": 3,
      "text": "The information carried in the MIME media type specification has a specific mapping to fields in the Session Description Protocol (SDP) [7], which is commonly used to describe RTP sessions. When SDP is used to specify sessions employing the text/t140 format, the mapping is as follows:",
      "ja": "MIMEメディアタイプの仕様で搬送される情報は、[7]、一般にRTPセッションを記述するために使用されるセッション記述プロトコル（SDP）内のフィールドに特定のマッピングを有します。 SDPは、テキスト/ T140形式を採用するセッションを指定するために使用される場合、以下のように、マッピングは次のとおりです。"
    },
    {
      "indent": 3,
      "text": "- The MIME type (\"text\") goes in SDP \"m=\" as the media name.",
      "ja": " -  MIMEタイプ（「テキスト」）は、メディア名としてSDP「m =」に進みます。"
    },
    {
      "indent": 3,
      "text": "- The MIME subtype (payload format name) goes in SDP \"a=rtpmap\" as the encoding name. The RTP clock rate in \"a=rtpmap\" MUST be 1000 for text/t140.",
      "ja": " -  MIMEサブタイプ（ペイロードフォーマット名）エンコーディング名としてSDPの「a = rtpmap」に進みます。 「= rtpmap」のRTPクロックレートは、テキスト/ T140 1000でなければなりません。"
    },
    {
      "indent": 3,
      "text": "- The parameter \"cps\" goes in SDP \"a=fmtp\" attribute.",
      "ja": " - パラメータが \"CPS\" SDP \"A =のfmtp\" 属性になります。"
    },
    {
      "indent": 3,
      "text": "- When the payload type is used with redundancy according to RFC 2198, the level of redundancy is shown by the number of elements in the slash-separated payload type list in the \"fmtp\" parameter of the redundancy declaration as defined in RFC 4102 [9] and RFC 2198 [3].",
      "ja": " - ペイロードタイプは、RFC 2198によれば、冗長性とともに使用される場合、RFC 4102で定義されるように、冗長性のレベルは、冗長性宣言の「のfmtp」パラメータにスラッシュで区切られたペイロードタイプのリスト内の要素の数で示されている[9 ]およびRFC 2198 [3]。"
    },
    {
      "indent": 0,
      "text": "10.3. Offer/Answer Consideration",
      "section_title": true,
      "ja": "10.3。オファー/回答の考察"
    },
    {
      "indent": 3,
      "text": "In order to achieve interoperability within the framework of the offer/answer model [10], the following consideration should be made:",
      "ja": "オファー/アンサーモデル[10]の枠組み内での相互運用性を達成するために、以下の配慮がなされるべきです。"
    },
    {
      "indent": 3,
      "text": "- The \"cps\" parameter is declarative. Both sides may provide a value, which is independent of the other side.",
      "ja": " - 「CPS」パラメータは、宣言です。双方は、他方の側から独立している値を、提供してもよいです。"
    },
    {
      "indent": 0,
      "text": "11. Acknowledgements",
      "section_title": true,
      "ja": "11.謝辞"
    },
    {
      "indent": 3,
      "text": "The authors want to thank Stephen Casner, Magnus Westerlund, and Colin Perkins for valuable support with reviews and advice on creation of this document, to Mickey Nasiri at Ericsson Mobile Communication for providing the development environment, Michele Mizarro for verification of the usability of the payload format for its intended purpose, and Andreas Piirimets for editing support and validation.",
      "ja": "著者は、ペイロードのユーザビリティの検証のための開発環境、ミケーレMizarroを提供するためのエリクソン・モバイルコミュニケーションのミッキーナシリに、レビューし、この文書の作成上のアドバイスと貴重な支援のためにスティーブンCasner、マグヌスウェスター、およびコリンパーキンスに感謝したいと思いますサポートと検証を編集するための所期の目的のためのフォーマット、およびアンドレアスPiirimets。"
    },
    {
      "indent": 0,
      "text": "12. Normative References",
      "section_title": true,
      "ja": "12.引用規格"
    },
    {
      "indent": 3,
      "text": "[1] ITU-T Recommendation T.140 (1998) - Text conversation protocol for multimedia application, with amendment 1, (2000).",
      "ja": "[1] ITU-T勧告T.140（1998） - マルチメディアアプリケーションのためのテキスト会話プロトコル、改正1、（2000）。"
    },
    {
      "indent": 3,
      "text": "[2] Schulzrinne, H., Casner, S., Frederick, R. and V. Jacobson, \"RTP: A Transport Protocol for Real-Time Applications\", RFC 3550, July 2003.",
      "ja": "[2] Schulzrinneと、H.、Casner、S.、フレデリック、R.とV. Jacobson氏、 \"RTP：リアルタイムアプリケーションのためのトランスポートプロトコル\"、RFC 3550、2003年7月。"
    },
    {
      "indent": 3,
      "text": "[3] Perkins, C., Kouvelas, I., Hodson, O., Hardman, V., Handley, M., Bolot, J., Vega-Garcia, A., and S. Fosse-Parisis, \"RTP Payload for Redundant Audio Data\", RFC 2198, September 1997.",
      "ja": "[3]パーキンス、C.、Kouvelas、I.、ホドソン、O.、ハードマン、V.、ハンドレー、M.、Bolot、J.、ベガ・ガルシア、A.、およびS.フォッシー-Parisis、「RTPペイロード冗長オーディオ・データ」、RFC 2198、1997年9月のため。"
    },
    {
      "indent": 3,
      "text": "[4] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[4]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月を。"
    },
    {
      "indent": 3,
      "text": "[5] ISO/IEC 10646-1: (1993), Universal Multiple Octet Coded Character Set.",
      "ja": "[5] ISO / IEC 10646-1：（1993）、ユニバーサル複数オクテット符号化文字セット。"
    },
    {
      "indent": 3,
      "text": "[6] Yergeau, F., \"UTF-8, a transformation format of ISO 10646\", STD 63, RFC 3629, November 2003.",
      "ja": "[6] Yergeau、F.、 \"UTF-8、ISO 10646の変換フォーマット\"、STD 63、RFC 3629、2003年11月。"
    },
    {
      "indent": 3,
      "text": "[7] Handley, M. and V. Jacobson, \"SDP: Session Description Protocol\", RFC 2327, April 1998.",
      "ja": "[7]ハンドレー、M.およびV. Jacobsonの \"SDP：セッション記述プロトコル\"、RFC 2327、1998年4月。"
    },
    {
      "indent": 3,
      "text": "[8] Rosenberg, J. and H. Schulzrinne, \"An RTP Payload Format for Generic Forward Error Correction\", RFC 2733, December 1999.",
      "ja": "[8]ローゼンバーグ、J.とH. Schulzrinne、 \"一般的なフォワードエラー訂正のためのRTPペイロードフォーマット\"、RFC 2733、1999年12月。"
    },
    {
      "indent": 3,
      "text": "[9] Jones, P., \"Registration of the text/red MIME Sub-Type\", RFC 4102, June 2005.",
      "ja": "[9]・ジョーンズ、P.、 \"テキスト/赤いMIMEサブタイプの登録\"、RFC 4102、2005年6月。"
    },
    {
      "indent": 3,
      "text": "[10] Rosenberg, J. and H. Schulzrinne, \"An Offer/Answer Model with the Session Description Protocol (SDP)\", RFC 3264, June 2002.",
      "ja": "[10]ローゼンバーグ、J.、およびH. Schulzrinneと、RFC 3264、2002年6月 \"セッション記述プロトコル（SDP）とのオファー/アンサーモデル\"。"
    },
    {
      "indent": 3,
      "text": "[11] Schulzrinne, H. and S. Casner, \"RTP Profile for Audio and Video Conference with Minimal Control\", STD 65, RFC 3551, July 2003.",
      "ja": "[11] Schulzrinneと、H.とS. Casner、 \"最小量のコントロールがあるオーディオとビデオ会議用RTPプロファイル\"、STD 65、RFC 3551、2003年7月。"
    },
    {
      "indent": 3,
      "text": "[12] Postel, J., \"Internet Protocol\", STD 5, RFC 791, September 1981.",
      "ja": "[12]ポステル、J.、 \"インターネットプロトコル\"、STD 5、RFC 791、1981年9月。"
    },
    {
      "indent": 0,
      "text": "13. Informative References",
      "section_title": true,
      "ja": "13.参考文献"
    },
    {
      "indent": 3,
      "text": "[13] Floyd, S. and J. Kempf, \"IAB Concerns Regarding Congestion Control for Voice Traffic in the Internet\", RFC 3714, March 2004.",
      "ja": "[13]フロイド、S.とJ.ケンプ、「インターネットでの音声トラフィックのための輻輳制御に関するIAB心配」、RFC 3714、2004年3月。"
    },
    {
      "indent": 3,
      "text": "[14] Baugher, M., McGrew, D., Naslund, M., Carrara, E., and K. Norrman, \"The Secure Real-time Transport Protocol (SRTP)\", RFC 3711, March 2004.",
      "ja": "[14] Baugher、M.、マグリュー、D.、Naslund、M.、カララ、E.、およびK. Norrman、 \"セキュアリアルタイム転送プロトコル（SRTP）\"、RFC 3711、2004年3月。"
    },
    {
      "indent": 3,
      "text": "[15] Schulzrinne, H. and S. Petrack, \"RTP Payload for DTMF Digits, Telephony Tones and Telephony Signals\", RFC 2833, May 2000.",
      "ja": "[15] Schulzrinneと、H.およびS. 2000 Petrackと、 \"DTMFケタ、電話トーン、および電話信号のためのRTPペイロード\"、RFC 2833、2000年5月。"
    },
    {
      "indent": 3,
      "text": "[16] Hellstrom, G., \"RTP Payload for Text Conversation\", RFC 2793, May 2000.",
      "ja": "[16]ヘルストローム、G.、 \"テキストの会話のためのRTPペイロード\"、RFC 2793、2000年5月。"
    },
    {
      "indent": 3,
      "text": "[17] ITU-T Recommendation F.703, Multimedia Conversational Services, November 2000.",
      "ja": "[17] ITU-T勧告F.703、マルチメディア会話サービス、2000年11月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Gunnar Hellstrom Omnitor AB Renathvagen 2 SE-121 37 Johanneshov Sweden",
      "ja": "グンナー・ヘルストロームOmnitor AB Renathvagen 2 SE-121 37 Johanneshovスウェーデン"
    },
    {
      "indent": 3,
      "text": "Phone: +46 708 204 288 / +46 8 556 002 03 Fax: +46 8 556 002 06 EMail: gunnar.hellstrom@omnitor.se",
      "ja": "電話：+46 708 204 288/46 8 556 002 03ファックス：+46 8 556 002 06 Eメール：gunnar.hellstrom@omnitor.se"
    },
    {
      "indent": 3,
      "text": "Paul E. Jones Cisco Systems, Inc. 7025 Kit Creek Rd. Research Triangle Park, NC 27709 USA",
      "ja": "ポール・E.ジョーンズシスコシステムズ社7025キットクリークRdを。リサーチトライアングルパーク、NC 27709 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 919 392 6948 EMail: paulej@packetizer.com",
      "ja": "電話：+1 919 392 6948 Eメール：paulej@packetizer.com"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "ja": "著作権（C）インターネット協会（2005）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "この文書では、BCP 78に含まれる権利と許可と制限の適用を受けており、その中の記載を除いて、作者は彼らのすべての権利を保有します。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とCONTRIBUTOR「そのまま」、ORGANIZATION HE / SHEが表すまたはインターネットソサエティおよびインターネット・エンジニアリング・タスク・フォース放棄すべての保証、明示または、（もしあれば）後援ISに設けられています。黙示、情報の利用は、特定の目的に対する権利または商品性または適合性の黙示の保証を侵害しない任意の保証含むがこれらに限定されません。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、本書またはそのような権限下で、ライセンスがたりないかもしれない程度に記載された技術の実装や使用に関係すると主張される可能性があります任意の知的財産権やその他の権利の有効性または範囲に関していかなる位置を取りません利用可能です。またそれは、それがどのような権利を確認する独自の取り組みを行ったことを示すものでもありません。 RFC文書の権利に関する手続きの情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IPRの開示のコピーが利用できるようにIETF事務局とライセンスの保証に行われた、または本仕様の実装者または利用者がそのような所有権の使用のための一般的なライセンスまたは許可を取得するために作られた試みの結果を得ることができますhttp://www.ietf.org/iprのIETFのオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、その注意にこの標準を実装するために必要とされる技術をカバーすることができる任意の著作権、特許または特許出願、またはその他の所有権を持ってすべての利害関係者を招待します。 ietf-ipr@ietf.orgのIETFに情報を記述してください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}