{
  "title": {
    "text": "RFC 4629 - RTP Payload Format for ITU-T Rec. H.263 Video",
    "ja": "RFC 4629 - ITU-T勧告のためのRTPペイロードフォーマット。 H.263ビデオ"
  },
  "number": 4629,
  "created_at": "2019-10-24 03:28:45.425374+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                             J. Ott\nRequest for Comments: 4629             Helsinki University of Technology\nObsoletes: 2429                                               C. Bormann\nUpdates: 3555                                    Universitaet Bremen TZI\nCategory: Standards Track                                    G. Sullivan\n                                                               Microsoft\n                                                               S. Wenger\n                                                                   Nokia\n                                                            R. Even, Ed.\n                                                                 Polycom\n                                                            January 2007",
      "raw": true
    },
    {
      "indent": 13,
      "text": "RTP Payload Format for ITU-T Rec. H.263 Video",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The IETF Trust (2007).",
      "ja": "著作権（C）IETFトラスト（2007）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document describes a scheme to packetize an H.263 video stream for transport using the Real-time Transport Protocol (RTP) with any of the underlying protocols that carry RTP.",
      "ja": "このドキュメントは、RTPを運ぶ基本的なプロトコルのいずれかでリアルタイムトランスポートプロトコル（RTP）を使用して、輸送のためのH.263ビデオストリームをパケット化するための仕組みを説明しています。"
    },
    {
      "indent": 3,
      "text": "The document also describes the syntax and semantics of the Session Description Protocol (SDP) parameters needed to support the H.263 video codec.",
      "ja": "文書はまた、セッション記述プロトコル（SDP）H.263ビデオコーデックをサポートするために必要なパラメータの構文と意味を説明しています。"
    },
    {
      "indent": 3,
      "text": "The document obsoletes RFC 2429 and updates the H263-1998 and H263-2000 media type in RFC 3555.",
      "ja": "文書はRFC 2429を廃止し、RFC 3555でH263-1998とH263-2000メディアタイプを更新します。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n   1.1. Terminology ................................................3\n2. New H.263 Features ..............................................3\n3. Usage of RTP ....................................................4\n   3.1. RTP Header Usage ...........................................5\n   3.2. Video Packet Structure .....................................6\n4. Design Considerations ...........................................7\n5. H.263+ Payload Header ...........................................9\n   5.1. General H.263+ Payload Header ..............................9\n   5.2. Video Redundancy Coding Header Extension ..................10\n6. Packetization Schemes ..........................................12\n   6.1. Picture Segment Packets and Sequence Ending\n        Packets (P=1) .............................................12\n        6.1.1. Packets that begin with a Picture Start Code .......12\n        6.1.2. Packets that begin with GBSC or SSC ................13\n        6.1.3. Packets that begin with an EOS or EOSBS Code .......14\n   6.2. Encapsulating Follow-on Packet (P=0) ......................15\n7. Use of this Payload Specification ..............................15\n8. Media Type Definition ..........................................17\n   8.1. Media Type Registrations ..................................17\n        8.1.1. Registration of Media Type video/H263-1998 .........17\n        8.1.2. Registration of Media Type video/H263-2000 .........21\n   8.2. SDP Usage .................................................22\n        8.2.1. Usage with the SDP Offer Answer Model ..............23\n9. Backward Compatibility to RFC 2429 .............................25\n   9.1. New Optional Parameters for SDP ...........................25\n10. IANA Considerations ...........................................25\n11. Security Considerations .......................................25\n12. Acknowledgments ...............................................26\n13. Changes from Previous Versions of the Documents ...............26\n   13.1. Changes from RFC 2429 ....................................26\n   13.2. Changes from RFC 3555 ....................................26\n14. References ....................................................26\n   14.1. Normative References .....................................26\n   14.2. Informative References ...................................27",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "This document specifies an RTP payload header format applicable to the transmission of video streams based on the 1998 and 2000 versions of International Telecommunication Union-Telecommunication Standardization Sector (ITU-T) Recommendation H.263 [H263]. Because the 1998 and 2000 versions of H.263 are a superset of the 1996 syntax, this format can also be used with the 1996 version of H.263 and is recommended for this use by new implementations. This format replaces the payload format in RFC 2190 [RFC2190], which continues to be used by some existing implementations, and can be useful for backward compatibility. New implementations supporting H.263 SHALL use the payload format described in this document. RFC 2190 is moved to historic status [RFC4628].",
      "ja": "この文書は、国際電気通信連合・電気通信標準化部門（ITU-T）勧告H.263 [H263] 1998年と2000年のバージョンに基づいて、ビデオストリームの伝送に適用可能なRTPペイロードヘッダの書式を指定します。 H.263の1998年と2000年のバージョンは1996構文のスーパーセットであるため、このフォーマットは、H.263の1996年版で使用することができ、新しい実装することにより、この使用することをお勧めします。このフォーマットは、いくつかの既存の実装で使用され続けてRFC 2190 [RFC2190]、ペイロード・フォーマットを置き換え、後方互換性のために有用であり得ます。 H.263をサポートする新しい実装は、この文書で説明したペイロードフォーマットを使用しなければなりません。 RFC 2190は、歴史的状況[RFC4628]に移動します。"
    },
    {
      "indent": 3,
      "text": "The document updates the media type registration that was previously in RFC 3555 [RFC3555].",
      "ja": "文書は、RFC 3555 [RFC3555]に以前にあったメディアタイプの登録を更新します。"
    },
    {
      "indent": 3,
      "text": "This document obsoletes RFC 2429 [RFC2429].",
      "ja": "この文書は、RFC 2429 [RFC2429]を廃止します。"
    },
    {
      "indent": 0,
      "text": "1.1. Terminology",
      "section_title": true,
      "ja": "1.1. 用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119] and indicate requirement levels for compliant RTP implementations.",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はありますRFC 2119 [RFC2119]に記載されており、対応RTP実装の要求レベルを示すものと解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. New H.263 Features",
      "section_title": true,
      "ja": "2.新H.263機能"
    },
    {
      "indent": 3,
      "text": "The 1998 version of ITU-T Recommendation H.263 added numerous coding options to improve codec performance over the 1996 version. In this document, the 1998 version is referred to as H.263+ and the 2000 version as H.263++.",
      "ja": "ITU-T勧告H.263の1998バージョンは、1996年のバージョンに比べコーデックのパフォーマンスを向上させるために、多くのコーディングのオプションを追加しました。この文書では、1998年バージョンは、H.263 +およびH.263 ++などの2000年版と呼ばれています。"
    },
    {
      "indent": 3,
      "text": "Among the new options, the ones with the biggest impact on the RTP payload specification and the error resilience of the video content are the slice structured mode, the independent segment decoding mode, the reference picture selection mode, and the scalability mode. This section summarizes the impact of these new coding options on packetization. Refer to [H263] for more information on coding options.",
      "ja": "新しいオプションのうち、RTPペイロード仕様とビデオコンテンツの誤り耐性に最も大きな影響を与えるものは、スライス構造モード、独立セグメント復号モード、参照ピクチャ選択モード、およびスケーラビリティモードです。このセクションでは、パケットにこれらの新しいコーディングオプションの影響をまとめたもの。オプションのコーディングの詳細については、[H263]を参照してください。"
    },
    {
      "indent": 3,
      "text": "The slice structured mode was added to H.263+ for three purposes: to provide enhanced error resilience capability, to make the bitstream more amenable for use with an underlying packet transport such as RTP, and to minimize video delay. The slice structured mode supports fragmentation at macroblock boundaries.",
      "ja": "スライス構造モードは、の3つの目的のためにH.263 +に追加されました：RTPのような基本的なパケットトランスポートで使用するためのビットストリームがより容易にするために、ビデオ遅延を最小限に抑えるために、強化されたエラー回復機能を提供します。スライス構造モードは、マクロブロックの境界で断片化をサポートしています。"
    },
    {
      "indent": 3,
      "text": "With the independent segment decoding (ISD) option, a video picture frame is broken into segments and encoded in such a way that each segment is independently decodable. Utilizing ISD in a lossy network environment helps to prevent the propagation of errors from one segment of the picture to others.",
      "ja": "独立セグメント復号（ISD）オプションを使用して、ビデオ画像フレームはセグメントに分割され、各セグメントは、独立して復号可能であるような方法で符号化されました。損失の多いネットワーク環境でISDを利用すると、他の人に絵の一つのセグメントからエラーの伝播を防ぐことができます。"
    },
    {
      "indent": 3,
      "text": "The reference picture selection mode allows the use of an older reference picture rather than the one immediately preceding the current picture. Usually, the last transmitted frame is implicitly used as the reference picture for inter-frame prediction. If the reference picture selection mode is used, the data stream carries information on what reference frame should be used, indicated by the temporal reference as an ID for that reference frame. The reference picture selection mode may be used with or without a back channel, which provides information to the encoder about the internal status of the decoder. However, no special provision is made herein for carrying back channel information. The Extended RTP Profile for RTP Control Protocol (RTCP)-based Feedback [RFC4585] MAY be used as a back channel mechanism.",
      "ja": "参照ピクチャ選択モードではなく、すぐに現在の画像に先行するものより古い参照ピクチャの使用を可能にします。通常、最後に送信されたフレームが暗黙のうちに、フレーム間予測のための参照ピクチャとして使用されます。参照ピクチャ選択モードが使用される場合、データストリームは、その参照フレームのIDとして時間リファレンスによって示される、使用すべきかの基準フレームに関する情報を運びます。参照ピクチャ選択モードでは、デコーダの内部状態についてのエンコーダに情報を提供するバックチャネル、またはなしで使用することができます。しかし、特別な規定は、チャネル情報をバック運ぶための、本明細書に行われません。 RTP制御プロトコル（RTCP）の拡張RTPプロファイルフィードバック[RFC4585]は、バックチャンネルメカニズムとして使用されるかもしれベース。"
    },
    {
      "indent": 3,
      "text": "H.263+ also includes bitstream scalability as an optional coding mode. Three kinds of scalability are defined: temporal, signal-to-noise ratio (SNR), and spatial scalability. Temporal scalability is achieved via the disposable nature of bi-directionally predicted frames, or B-frames. (A low-delay form of temporal scalability known as P-picture temporal scalability can also be achieved by using the reference picture selection mode, described in the previous paragraph.) SNR scalability permits refinement of encoded video frames, thereby improving the quality (or SNR). Spatial scalability is similar to SNR scalability except that the refinement layer is twice the size of the base layer in the horizontal dimension, vertical dimension, or both.",
      "ja": "H.263 +は、オプションの符号化モードとしてビットストリームのスケーラビリティを含みます。スケーラビリティの三種類が定義されている：時間、信号対雑音比（SNR）、及び空間スケーラビリティを。時間スケーラビリティは、双方向予測フレーム、またはBフレームの使い捨ての性質を介して達成されます。 （Pピクチャ時間スケーラビリティとして知られている時間的スケーラビリティの低遅延形態はまた、前の段落で説明した参照ピクチャ選択モードを使用することによって達成することができる。）SNRスケーラビリティ、それによって品質を向上させる、符号化されたビデオフレームの改良を可能にする（またはSNR）。空間スケーラビリティは、リファインメント層は、二回の水平寸法におけるベース層のサイズ、垂直寸法、またはその両方であることを除いてSNRスケーラビリティと同様です。"
    },
    {
      "indent": 3,
      "text": "H.263++ added some new functionalities. Among the new functionalities are support for interlace mode, specified in H.263, annex W.6.3.11, and the definition of profiles and levels in H.263 annex X.",
      "ja": "H.263 ++は、いくつかの新機能を追加しました。新機能の中でH.263に指定されたインタレースモード、別館W.6.3.11、およびH.263別館Xのプロファイルとレベルを定義するためのサポートがあります"
    },
    {
      "indent": 0,
      "text": "3. Usage of RTP",
      "section_title": true,
      "ja": "RTPの3.使用"
    },
    {
      "indent": 3,
      "text": "When transmitting H.263+ video streams over the Internet, the output of the encoder can be packetized directly. All the bits resulting from the bitstream (including the fixed length codes and variable length codes) will be included in the packet, the only exception being that when the payload of a packet begins with a Picture, GOB, Slice, End of Sequence (EOS), or End of Sub-Bit Stream (EOSBS) start code, the first 2 (all-zero) bytes of the start code shall be removed and replaced by setting an indicator bit in the payload header.",
      "ja": "インターネット上でH.263 +ビデオストリームを送信する場合、エンコーダの出力は、直接パケット化することができます。 （固定長符号と可変長符号を含む）ビットストリームから得られた全てのビットは、パケットに含まれる、ある唯一の例外は、そのパケットのペイロードは、ピクチャ、GOB、スライス、シーケンスの終了（EOSで始まる場合）、またはサブビットストリーム（EOSBS）の終了コードを開始する、開始コードの第2（全てゼロ）バイトは、ペイロードヘッダにインジケータ・ビットを設定することにより、取り外して交換しなければなりません。"
    },
    {
      "indent": 3,
      "text": "For H.263+ bitstreams coded with temporal, spatial, or SNR scalability, each layer may be transported to a different network address. More specifically, each layer may use a unique IP address and port number combination. The temporal relations between layers shall be expressed using the RTP timestamp so that they can be synchronized at the receiving ends in multicast or unicast applications.",
      "ja": "H.263 +、時間的、空間的、またはSNRスケーラビリティで符号化ビットストリームのために、それぞれの層は、異なるネットワークアドレスに輸送することができます。具体的には、それぞれの層は、固有のIPアドレスとポート番号の組み合わせを使用することができます。層の間の時間的関係は、それらが受信に同期マルチキャストまたはユニキャストアプリケーションで終了することができるように、RTPタイムスタンプを使用して表現されなければなりません。"
    },
    {
      "indent": 3,
      "text": "The H.263+ video stream will be carried as payload data within RTP packets. A new H.263+ payload header is defined in Section 5; it updates the one specified in RFC 2190. This section defines the usage of the RTP fixed header and H.263+ video packet structure.",
      "ja": "H.263 +ビデオストリームは、RTPパケット内のペイロードデータとして実行されます。新しいH.263 +ペイロードヘッダは、セクション5で定義されています。それはこのセクションでは、RTP固定ヘッダおよびH.263 +ビデオパケット構造の使用を規定するRFC 2190に指定されたものを更新します。"
    },
    {
      "indent": 0,
      "text": "3.1. RTP Header Usage",
      "section_title": true,
      "ja": "3.1.  RTPヘッダーの使用"
    },
    {
      "indent": 3,
      "text": "Each RTP packet starts with a fixed RTP header. The following fields of the RTP fixed header used for H.263+ video streams are further emphasized here.",
      "ja": "各RTPパケットは、固定されたRTPヘッダで始まります。 H.263 +ビデオストリームに使用されるRTP固定ヘッダの次のフィールドは、ここでさらに強調されます。"
    },
    {
      "indent": 3,
      "text": "Marker bit (M bit): The Marker bit of the RTP header is set to 1 when the current packet carries the end of current frame and is 0 otherwise.",
      "ja": "マーカービット（Mビット）：現在のパケットが現在のフレームの端を運び、そうでなければ0である場合、RTPヘッダのマーカービットが1に設定されています。"
    },
    {
      "indent": 3,
      "text": "Payload Type (PT): The RTP profile for a particular class of applications will assign a payload type for this encoding, or, if that is not done, a payload type in the dynamic range shall be chosen by the sender.",
      "ja": "ペイロードタイプ（PT）：アプリケーションの特定のクラスのためのRTPプロファイルは、それが行われない場合、ダイナミックレンジにおけるペイロードタイプは、送信者によって選択されなければならない、この符号化のためのペイロードタイプを割り当てる、またはだろう。"
    },
    {
      "indent": 3,
      "text": "Timestamp: The RTP Timestamp encodes the sampling instance of the first video frame data contained in the RTP data packet. The RTP timestamp shall be the same on successive packets if a video frame occupies more than one packet. In a multilayer scenario, all pictures corresponding to the same temporal reference should use the same timestamp. If temporal scalability is used (if B-frames are present), the timestamp may not be monotonically increasing in the RTP stream. If B-frames are transmitted on a separate layer and address, they must be synchronized properly with the reference frames. Refer to ITU-T Recommendation H.263 [H263] for information on required transmission order to a decoder. For an H.263+ video stream, the RTP timestamp is based on a 90 kHz clock, the same as that of the RTP payload for H.261 stream [RFC2032]. Since both the H.263+ data and the RTP header contain time information, that timing information must run synchronously. That is, both the RTP timestamp and the temporal reference (TR in the picture header of H.263) should carry the same relative timing information. Any H.263+ picture clock frequency can be expressed as 1800000/(cd*cf) source pictures per second, in which cd is an integer from 1 to 127 and cf is either 1000 or 1001. Using the 90 kHz clock of the RTP timestamp, the time increment between each coded H.263+ picture should therefore be an integer multiple of (cd*cf)/20. This will always be an integer for any \"reasonable\" picture clock frequency (for example, it is 3003 for 30/1.001 Hz NTSC; 3600 for 25 Hz PAL; 3750 for 24 Hz film; and 1500, 1250, or 1200 for the computer display update rates of 60, 72, or 75 Hz, respectively). For RTP packetization of hypothetical H.263+ bitstreams using \"unreasonable\" custom picture clock frequencies, mathematical rounding could become necessary for generating the RTP timestamps.",
      "ja": "タイムスタンプ：RTPタイムスタンプは、RTPデータパケットに含まれる第一ビデオフレームデータのサンプリング・インスタンスをコードします。ビデオフレームは、複数のパケットを占有する場合はRTPタイムスタンプは、連続するパケットで同じでなければなりません。多層シナリオでは、同じ時間基準に対応するすべての画像は、同じタイムスタンプを使用する必要があります。時間スケーラビリティは、（Bフレームが存在する場合）が使用される場合、タイムスタンプはRTPストリームに単調増加ではないかもしれません。 Bフレームは、別個の層とアドレスに送信される場合、それらは、参照フレームと適切に同期されなければなりません。デコーダに必要な送信順序については、ITU-T勧告H.263 [H263]を参照。 H.263 +ビデオストリームは、RTPタイムスタンプは、90 kHzのクロック、H.261ストリーム[RFC2032]のためのRTPペイロードのと同じに基づいています。 H.263 +データ及びRTPヘッダの両方が、時間情報を含んでいるので、タイミング情報は同期的に実行する必要があります。すなわち、RTPタイムスタンプ及び時間基準（H.263のピクチャヘッダ内のTR）の両方が同じ相対タイミング情報を運ぶべきです。任意H.263 +画像クロック周波数は1から127の整数であり、CF 1000又は1001 RTPの90 kHzのクロックを使用してのいずれかであるCDに毎秒1800000 /（CD * CF）ソース・ピクチャ、のように表すことができます。タイムスタンプは、各符号化されたH.263 +ピクチャ間の時間増分は、したがって、（CD用*のCF）/ 20の整数倍でなければなりません。これは常に「合理的な」画像クロック周波数に対する整数であろう（例えば、30 / 1.001 HzのNTSCのための3003である。3600 25 HzのPALのために、コンピュータの1500、1250または1200; 3750 24Hzのフィルム用60、72、又は75ヘルツ、それぞれ）の表示更新レート。 「不合理」カスタム画像クロック周波数を使用して仮想的なH.263 +ビットストリームのRTPのパケットのために、数学的な丸めは、RTPタイムスタンプを生成するために必要になる可能性があります。"
    },
    {
      "indent": 0,
      "text": "3.2. Video Packet Structure",
      "section_title": true,
      "ja": "3.2. ビデオパケットの構造"
    },
    {
      "indent": 3,
      "text": "A section of an H.263+ compressed bitstream is carried as a payload within each RTP packet. For each RTP packet, the RTP header is followed by an H.263+ payload header, which is followed by a number of bytes of a standard H.263+ compressed bitstream. The size of the H.263+ payload header is variable, depending on the payload involved, as detailed in the Section 4. The layout of the RTP H.263+ video packet is shown as",
      "ja": "H.263 +圧縮されたビットストリームの部分は、各RTPパケット内のペイロードとして搬送されます。各RTPパケットに対して、RTPヘッダは、標準H.263 +圧縮されたビットストリームのバイト数が続くH.263 +ペイロードヘッダが続きます。 RTP H.263 +ビデオパケットの配置は次のように示されている第4節で詳述するようにH.263 +ペイロードヘッダのサイズは、関係するペイロードに応じて、可変です"
    },
    {
      "indent": 6,
      "text": "+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n:    RTP Header                                                 :\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n:    H.263+ Payload Header                                      :\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n:    H.263+ Compressed Data Stream                              :\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Any H.263+ start codes can be byte aligned by an encoder by using the stuffing mechanisms of H.263+. As specified in H.263+, picture, slice, and EOSBS starts codes shall always be byte aligned, and GOB and EOS start codes may be byte aligned. For packetization purposes, GOB start codes should be byte aligned; however, since this is not required in H.263+, there may be some cases where GOB start codes are not aligned, such as when transmitting existing content, or when using H.263 encoders that do not support GOB start code alignment. In this case, Follow-on Packets (see Section 5.2) should be used for packetization.",
      "ja": "任意H.263 +スタートコードはH.263 +のスタッフィング・メカニズムを使用して、エンコーダによって整列バイトとすることができます。 H.263 +で指定されているように、画像、スライス、およびEOSBSはコードを起動するには、常にバイト整列しなければならない、とGOBおよびEOSは、コードが整列バイトかもしれ始めます。パケット化の目的のために、GOBは、コードはバイト整列する必要があります開始します。これはH.263 +に必要とされないので、このようなGOB開始コードアライメントをサポートしていないH.263エンコーダを使用する場合、既存のコンテンツを送信する場合、またはのようなGOB開始コードが整列されていないいくつかの場合、存在し得ます。この場合、後続のパケットパケットのために使用すべきである（5.2節を参照してください）。"
    },
    {
      "indent": 3,
      "text": "All H.263+ start codes (Picture, GOB, Slice, EOS, and EOSBS) begin with 16 zero-valued bits. If a start code is byte aligned and it occurs at the beginning of a packet, these two bytes shall be removed from the H.263+ compressed data stream in the packetization process and shall instead be represented by setting a bit (the P bit) in the payload header.",
      "ja": "全てH.263 +、16ゼロ値ビットで始まるコード（ピクチャ、GOB、スライス、EOS、およびEOSBS）を開始します。スタートコードがバイト整列され、それはパケットの先頭に発生した場合、これらの2つのバイトは、パケット化プロセスにおいてH.263 +圧縮データストリームから除去されなければならないし、代わりに（Pビット）ビットを設定することによって表されなければなりませんペイロードヘッダです。"
    },
    {
      "indent": 0,
      "text": "4. Design Considerations",
      "section_title": true,
      "ja": "4.設計上の考慮事項"
    },
    {
      "indent": 3,
      "text": "The goals of this payload format are to specify an efficient way of encapsulating an H.263+ standard compliant bitstream and to enhance the resiliency towards packet losses. Due to the large number of different possible coding schemes in H.263+, a copy of the picture header with configuration information is inserted into the payload header when appropriate. The use of that copy of the picture header along with the payload data can allow decoding of a received packet even in cases when another packet containing the original picture header becomes lost.",
      "ja": "このペイロード形式の目標は、H.263 +標準に準拠したビットストリームをカプセル化する効率的な方法を指定すると、パケット損失に対する回復力を強化するためです。適切なコンフィギュレーション情報とピクチャヘッダのコピーをペイロードヘッダに挿入されたH.263 +で異なる可能な符号化方式の多数による。オリジナルピクチャヘッダを含む別のパケットが失われてしまう場合にペイロードデータとともにピクチャヘッダのコピーの使用も場合には、受信パケットの復号化を可能にすることができます。"
    },
    {
      "indent": 3,
      "text": "There are a few assumptions and constraints associated with this H.263+ payload header design. The purpose of this section is to point out various design issues and also to discuss several coding options provided by H.263+ that may impact the performance of network-based H.263+ video.",
      "ja": "このH.263 +ペイロードヘッダーのデザインに関連したいくつかの前提条件と制約があります。このセクションの目的は、様々な設計上の問題を指摘すると、ネットワークベースのH.263 +ビデオの性能に影響を与える可能性がH.263 +によって提供されるいくつかの符号化オプションを議論することです。"
    },
    {
      "indent": 3,
      "text": "o The optional slice structured mode described in Annex K of [H263] enables more flexibility for packetization. Similar to a picture segment that begins with a GOB header, the motion vector predictors in a slice are restricted to reside within its boundaries. However, slices provide much greater freedom in the selection of the size and shape of the area that is represented as a distinct decodable region. In particular, slices can have a size that is dynamically selected to allow the data for each slice to fit into a chosen packet size. Slices can also be chosen to have a rectangular shape, which is conducive for minimizing the impact of errors and packet losses on motion-compensated prediction. For these reasons, the use of the slice structured mode is strongly recommended for any applications used in environments where significant packet loss occurs.",
      "ja": "付録Kに記載の任意のスライス構造モードO [H263]はパケットのためのより多くの柔軟性を可能にします。 GOBヘッダで始まるピクチャセグメントと同様に、スライスに動きベクトル・プレディクタは、その境界内に存在するように制限されます。しかし、スライスは別個の復号可能な領域として表現される領域の大きさ及び形状の選択においてはるかに大きな自由度を提供します。具体的には、スライスが動的各スライスのデータが選択されたパケットサイズに適合するように選択されたサイズを有することができます。スライスは、動き補償予測のエラーとパケット損失の影響を最小限にするための助けとなる長方形形状を有するように選択することができます。これらの理由から、スライス構造モードの使用が強く重大なパケットロスが発生する環境下で使用される任意のアプリケーションのために推奨されます。"
    },
    {
      "indent": 3,
      "text": "o In non-rectangular slice structured mode, only complete slices SHOULD be included in a packet. In other words, slices should not be fragmented across packet boundaries. The only reasonable need for a slice to be fragmented across packet boundaries is when the encoder that generated the H.263+ data stream could not be influenced by an awareness of the packetization process (such as when sending H.263+ data through a network other than the one to which the encoder is attached, as in network gateway implementations). Optimally, each packet will contain only one slice.",
      "ja": "O非矩形スライスストラクチャードモードでは、唯一の完全なスライスは、パケットに含まれるべきです。言い換えれば、スライスは、パケットの境界を越えて断片化するべきではありません。 H.263 +データストリームを生成したエンコーダはパケット化プロセスの意識に影響されなかった場合、パケットの境界を越えて断片化されるスライスのための唯一の妥当な必要性がある（例えば、ネットワークを介してH.263 +データを送信する場合のようにエンコーダは、ネットワークゲートウェイの実装のように、取り付けられたもの）以外。最適には、各パケットは、1つのスライスのみが含まれます。"
    },
    {
      "indent": 3,
      "text": "o The independent segment decoding (ISD) described in Annex R of [H263] prevents any data dependency across slice or GOB boundaries in the reference picture. It can be utilized to improve resiliency further in high loss conditions.",
      "ja": "OのアネックスR [H263]に記載の独立したセグメントの復号（ISD）が参照ピクチャのスライス又はGOB境界を越えて任意のデータ依存性を防止します。高損失の条件でさらに弾力性を改善するために利用することができます。"
    },
    {
      "indent": 3,
      "text": "o If ISD is used in conjunction with the slice structure, the rectangular slice submode shall be enabled, and the dimensions and quantity of the slices present in a frame shall remain the same between each two intra-coded frames (I-frames), as required in H.263+. The individual ISD segments may also be entirely intra coded from time to time to realize quick error recovery without adding the latency time associated with sending complete INTRA-pictures.",
      "ja": "ISDは、スライス構造に関連して使用される場合、O、矩形スライスサブモードを有効にしなければならない、そしてフレーム内に存在するスライスの寸法及び量は、各2イントラ符号化フレーム（Iフレーム）との間で同じままでなければならない、などH.263 +に必要。個々のISDセグメントはまた、完全に内完全INTRA-画像を送信することに関連した待ち時間を追加することなく、迅速にエラー回復を実現するために随時符号化することができます。"
    },
    {
      "indent": 3,
      "text": "o When the slice structure is not applied, the insertion of a (preferably byte-aligned) GOB header can be used to provide resync boundaries in the bitstream, as the presence of a GOB header eliminates the dependency of motion vector prediction across GOB boundaries. These resync boundaries provide natural locations for packet payload boundaries.",
      "ja": "スライス構造が適用されていない場合、O、（好ましくはバイト整列）GOBヘッダの挿入は、GOBヘッダの存在はGOB境界を越えて動きベクトル予測の依存性を排除するように、ビットストリームに再同期境界を提供するために使用することができます。これらの再同期の境界は、パケットペイロード境界のための自然な場所を提供しています。"
    },
    {
      "indent": 3,
      "text": "o H.263+ allows picture headers to be sent in an abbreviated form in order to prevent repetition of overhead information that does not change from picture to picture. For resiliency, sending a complete picture header for every frame is often advisable. This means (especially in cases with high packet loss probability in which picture header contents are not expected to be highly predictable) that the sender may find it advisable always to set the subfield UFEP in PLUSPTYPE to '001' in the H.263+ video bitstream. (See [H263] for the definition of the UFEP and PLUSPTYPE fields).",
      "ja": "O H.263 +は、ピクチャヘッダがピクチャにピクチャから変化しないオーバーヘッド情報の重複を防止するために省略形で送信されることを可能にします。弾力性のために、フレームごとに完全な画像ヘッダを送信することが多いことをお勧めします。この手段は、送信者がH.263 +ビデオに「001」にPLUSPTYPEにおけるサブフィールドUFEPを設定し、常にそれが賢明かもしれこと（特に、ピクチャヘッダの内容が高度に予測可能であることが期待されていない高いパケット損失確率を有する場合）ビットストリーム。 （UFEPとPLUSPTYPEフィールドの定義については、[H263]を参照）。"
    },
    {
      "indent": 3,
      "text": "o In a multi-layer scenario, each layer may be transmitted to a different network address. The configuration of each layer, such as the enhancement layer number (ELNUM), reference layer number (RLNUM), and scalability type should be determined at the start of the session and should not change during the course of the session.",
      "ja": "O多層シナリオでは、各層は、異なるネットワークアドレスに送信されても​​よいです。そのようなエンハンスメントレイヤ数（ELNUM）、基準層数（RLNUM）、およびスケーラビリティタイプとして、各層の構成は、セッションの開始時に決定されるべきであり、セッションの過程で変化してはなりません。"
    },
    {
      "indent": 3,
      "text": "o All start codes can be byte aligned, and picture, slice, and EOSBS start codes are always byte aligned. The boundaries of these syntactical elements provide ideal locations for placing packet boundaries.",
      "ja": "Oすべてのコードは、バイト整列、および画像、スライス、およびEOSBS開始コードは常にバイト整列されていることができ始めます。これらの構文要素の境界は、パケット境界を配置するための理想的な場所を提供しています。"
    },
    {
      "indent": 3,
      "text": "o We assume that a maximum Picture Header size of 504 bits is sufficient. The syntax of H.263+ does not explicitly prohibit larger picture header sizes, but the use of such extremely large picture headers is not expected.",
      "ja": "O我々は、504ビットの最大画像ヘッダサイズが十分であると仮定する。 H.263 +の構文は、明示的により大きなピクチャヘッダサイズを禁止していないが、そのような非常に大きなピクチャヘッダを使用することは期待されません。"
    },
    {
      "indent": 0,
      "text": "5. H.263+ Payload Header",
      "section_title": true,
      "ja": "5. H.263 +ペイロードヘッダー"
    },
    {
      "indent": 3,
      "text": "For H.263+ video streams, each RTP packet shall carry only one H.263+ video packet. The H.263+ payload header shall always be present for each H.263+ video packet. The payload header is of variable length. A 16-bit field of the general payload header, defined in 5.1, may be followed by an 8 bit field for Video Redundancy Coding (VRC) information, and/or by a variable-length extra picture header as indicated by PLEN. These optional fields appear in the order given above, when present.",
      "ja": "H.263 +ビデオストリームの場合、各RTPパケットは、唯一のH.263 +ビデオパケットを運ぶものとします。 H.263 +ペイロードヘッダは、常に各H.263 +ビデオパケットのために存在しなければなりません。ペイロードヘッダは可変長です。 PLENによって示されるように5.1で定義された一般的なペイロードヘッダの16ビットのフィールドは、ビデオ冗長符号化（VRC）情報のため、および/または可変長余分ピクチャヘッダによって8ビットのフィールドが続いてもよいです。存在する場合、これらのオプションのフィールドは、上記の順番で表示されます。"
    },
    {
      "indent": 3,
      "text": "If an extra picture header is included in the payload header, the length of the picture header in number of bytes is specified by PLEN. The minimum length of the payload header is 16 bits, PLEN equal to 0 and no VRC information being present.",
      "ja": "余分ピクチャヘッダがペイロードヘッダに含まれている場合、バイト数でピクチャヘッダの長さは、PLENによって指定されます。ペイロードヘッダの最小の長さは16ビットで、PLENが0に等しいと存在しないVRC情報です。"
    },
    {
      "indent": 3,
      "text": "The remainder of this section defines the various components of the RTP payload header. Section 6 defines the various packet types that are used to carry different types of H.263+ coded data, and Section 7 summarizes how to distinguish between the various packet types.",
      "ja": "このセクションの残りの部分は、RTPペイロードヘッダの種々の構成要素を定義します。セクション6は、H.263 +符号化された異なるタイプのデータを運ぶために使用される様々なパケットタイプを定義し、セクション7は、様々なパケットタイプを区別する方法を要約したものです。"
    },
    {
      "indent": 0,
      "text": "5.1. General H.263+ Payload Header",
      "section_title": true,
      "ja": "5.1. 一般的なH.263 +ペイロードヘッダー"
    },
    {
      "indent": 3,
      "text": "The H.263+ payload header is structured as follows:",
      "ja": "次のようにH.263 +ペイロードヘッダが構成されています。"
    },
    {
      "indent": 8,
      "text": " 0                   1\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|   RR    |P|V|   PLEN    |PEBIT|\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "RR: 5 bits",
      "ja": "RR：5ビット"
    },
    {
      "indent": 6,
      "text": "Reserved bits. It SHALL be zero and MUST be ignored by receivers.",
      "ja": "予約ビット。それはゼロでなければならず、受信機で無視しなければなりません。"
    },
    {
      "indent": 3,
      "text": "P: 1 bit",
      "ja": "P：1ビット"
    },
    {
      "indent": 6,
      "text": "Indicates the picture start or a picture segment (GOB/Slice) start or a video sequence end (EOS or EOSBS). Two bytes of zero bits then have to be prefixed to the payload of such a packet to compose a complete picture/GOB/slice/EOS/EOSBS start code. This bit allows the omission of the two first bytes of the start codes, thus improving the compression ratio.",
      "ja": "ピクチャスタート又は画像セグメント（GOB /スライス）開始またはビデオシーケンスの終了（EOSまたはEOSBS）を示しています。ゼロ・ビットの2バイトは、その後、完全な画像/ GOB /スライス/ EOSを構成するためにそのようなパケットのペイロードの前に付けなければならない/ EOSBSコードを開始。このビットは、このように圧縮率を向上させる、スタートコードの最初の2バイトの省略を可能にします。"
    },
    {
      "indent": 3,
      "text": "V: 1 bit",
      "ja": "V：1ビット"
    },
    {
      "indent": 6,
      "text": "Indicates the presence of an 8-bit field containing information for Video Redundancy Coding (VRC), which follows immediately after the initial 16 bits of the payload header, if present. For syntax and semantics of that 8-bit VRC field, see Section 5.2.",
      "ja": "存在する場合、ペイロードヘッダの最初の16ビットの直後にビデオ冗長性のために8ビットのフィールド情報を含む符号化（VRC）の存在を示します。構文とその8ビットのVRCフィールドの意味については、5.2節を参照してください。"
    },
    {
      "indent": 3,
      "text": "PLEN: 6 bits",
      "ja": "PLEN：6ビット"
    },
    {
      "indent": 6,
      "text": "Length, in bytes, of the extra picture header. If no extra picture header is attached, PLEN is 0. If PLEN>0, the extra picture header is attached immediately following the rest of the payload header. Note that the length reflects the omission of the first two bytes of the picture start code (PSC). See Section 6.1.",
      "ja": "余分ピクチャヘッダのバイト単位の長さ、、。余分なピクチャヘッダが添付されていない場合、PLEN 0 PLENが> 0である場合、余分なピクチャヘッダは、ペイロードヘッダの残りの部分の直後に取り付けられています。長さは、ピクチャスタートコード（PSC）の最初の2バイトの漏れを反映することに留意されたいです。 6.1節を参照してください。"
    },
    {
      "indent": 3,
      "text": "PEBIT: 3 bits",
      "ja": "PEBIT：3ビット"
    },
    {
      "indent": 6,
      "text": "Indicates the number of bits that shall be ignored in the last byte of the picture header. If PLEN is not zero, the ignored bits shall be the least significant bits of the byte. If PLEN is zero, then PEBIT shall also be zero.",
      "ja": "ピクチャヘッダの最後のバイトでは無視されなければならないビットの数を示します。 PLENがゼロでない場合は、無視されたビットはバイトの最下位ビットでなければなりません。 PLENがゼロの場合は、PEBITもゼロでなければなりません。"
    },
    {
      "indent": 0,
      "text": "5.2. Video Redundancy Coding Header Extension",
      "section_title": true,
      "ja": "5.2. ヘッダー拡張をビデオ符号化の冗長性"
    },
    {
      "indent": 3,
      "text": "Video Redundancy Coding (VRC) is an optional mechanism intended to improve error resilience over packet networks. Implementing VRC in H.263+ will require the Reference Picture Selection option described in Annex N of [H263]. By having multiple \"threads\" of independently inter-frame predicted pictures, damage to an individual frame will cause distortions only within its own thread, leaving the other threads unaffected. From time to time, all threads converge to a so-called sync frame (an INTRA picture or a non-INTRA picture that is redundantly represented within multiple threads); from this sync frame, the independent threads are started again. For more information on codec support for VRC, see [Vredun].",
      "ja": "ビデオ冗長符号化（VRC）は、パケットネットワーク上でエラー回復力を改善することを意図任意の機構です。 H.263 +にVRCを実装するの附属書N [H263]で説明した参照ピクチャ選択オプションが必要になります。複数を有することにより、独立して、フレーム間の「スレッド」は写真を予測し、個々のフレームへのダメージが影響を受けていない他のスレッドを残し、唯一独自のスレッド内の歪みの原因となります。時々、すべてのスレッドは、いわゆるシンクフレーム（イントラピクチャ又は重複複数のスレッドの中に表現される非イントラピクチャ）に収束します。このシンクフレームから、独立したスレッドを再開しています。 VRCのためのコーデックのサポートの詳細については、[Vredun]を参照してください。"
    },
    {
      "indent": 3,
      "text": "P-picture temporal scalability is another use of the reference picture selection mode and can be considered a special case of VRC in which only one copy of each sync frame may be sent. It offers a thread-based method of temporal scalability without the increased delay caused by the use of B pictures. In this use, sync frames sent in the first thread of pictures are also used for the prediction of a second thread of pictures that fall temporally between the sync frames to increase the resulting frame rate. In this use, the pictures in the second thread can be discarded in order to obtain a reduction of bit rate or decoding complexity without harming the ability to decode later pictures. A third or more threads, can also be added, but each thread is predicted only from the sync frames (which are sent at least in thread 0) or from frames within the same thread.",
      "ja": "Pピクチャの時間的スケーラビリティは、参照ピクチャ選択モードの別の使用であり、各シンクフレームの唯一のコピーが送信されても​​よいしたVRCの特別な場合と考えることができます。これは、Bピクチャの使用による増加遅滞なく時間スケーラビリティのスレッドベースの方法を提供しています。この用途では、ピクチャの最初のスレッドに送られる同期フレームは、また、結果として得られるフレームレートを増加させるための同期フレーム間で時間的に落ちる画像の第二のスレッドを予測するために使用されます。この用途では、第二のスレッド内の画像は、後のピクチャをデコードする能力を損なうことなく、ビットレートまたは復号化の複雑さの減少を得るために、廃棄することができます。三以上のスレッドは、添加することもできるが、各スレッドは、同じスレッド内またはフレームから（スレッド0に少なくとも送信される）シンクフレームから予測されます。"
    },
    {
      "indent": 3,
      "text": "While a VRC data stream is (like all H.263+ data) totally self-contained, it may be useful for the transport hierarchy implementation to have knowledge about the current damage status of each thread. On the Internet, this status can easily be determined by observing the marker bit, the sequence number of the RTP header, the thread-id, and a circling \"packet per thread\" number. The latter two numbers are coded in the VRC header extension.",
      "ja": "VRCデータストリームが（全H.263 +データのような）完全に自己完結型であるが、トランスポート階層の実装では、各スレッドの現在の被害状況についての知識を持っているため、これは有用であり得ます。インターネット上で、この状態は容易にマーカービットを観察することによって決定することができる、RTPヘッダのシーケンス番号、スレッドID、および数周回「スレッドごとパケット」。後者の二つの数字は、VRCヘッダ拡張内に符号化されます。"
    },
    {
      "indent": 3,
      "text": "The format of the VRC header extension is as follows:",
      "ja": "次のようにVRCヘッダ拡張の形式は次のとおりです。"
    },
    {
      "indent": 8,
      "text": " 0 1 2 3 4 5 6 7\n+-+-+-+-+-+-+-+-+\n| TID | Trun  |S|\n+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "TID: 3 bits",
      "ja": "TIME：3ビット"
    },
    {
      "indent": 3,
      "text": "Thread ID. Up to 7 threads are allowed. Each frame of H.263+ VRC data will use as reference information only sync frames or frames within the same thread. By convention, thread 0 is expected to be the \"canonical\" thread, which is the thread from which the sync frame should ideally be used. In the case of corruption or loss of the thread 0 representation, a representation of the sync frame with a higher thread number can be used by the decoder. Lower thread numbers are expected to contain representations of the sync frames equal to or better than higher thread numbers in the absence of data corruption or loss. See [Vredun] for a detailed discussion of VRC.",
      "ja": "スレッドID。最大7つのスレッドが許可されています。 H.263 + VRCデータの各フレームは、同じスレッド内の参照情報のみ同期フレームまたはフレームとして使用します。慣例により、スレッド0は、シンクフレームを理想的に使用する必要があり、そこから糸である「標準的な」スレッド、ことが期待されます。スレッド0表現の破損または紛失の場合には、より高いスレッド番号と同期フレームの表示は、デコーダによって使用することができます。下糸数は、データの破損または損失の非存在下でのより高いスレッド数以上に良好同期フレームの表現を含むことが期待されます。 VRCの詳細な議論のための[Vredun]を参照してください。"
    },
    {
      "indent": 3,
      "text": "Trun: 4 bits",
      "ja": "トラン：BITS午後"
    },
    {
      "indent": 3,
      "text": "Monotonically increasing (modulo 16) 4-bit number counting the packet number within each thread.",
      "ja": "単調増加（モジュロ16）4ビットの数は、各スレッド内のパケット数をカウントします。"
    },
    {
      "indent": 3,
      "text": "S: 1 bit",
      "ja": "S：1ビット"
    },
    {
      "indent": 3,
      "text": "A bit that indicates that the packet content is for a sync frame. An encoder using VRC may send several representations of the same \"sync\" picture, in order to ensure that, regardless of which thread of pictures is corrupted by errors or packet losses, the reception of at least one representation of a particular picture is ensured (within at least one thread). The sync picture can then be used for the prediction of any thread. If packet losses have not occurred, then the sync frame contents of thread 0 can be used, and those of other threads can be discarded (and similarly for other threads). Thread 0 is considered the \"canonical\" thread, the use of which is preferable to all others. The contents of packets having lower thread numbers shall be considered as having a higher processing and delivery priority than those with higher thread numbers. Thus, packets having lower thread numbers for a given sync frame shall be delivered first to the decoder under loss-free and low-time-jitter conditions, which will result in the discarding of the sync contents of the higher-numbered threads as specified in Annex N of [H263].",
      "ja": "パケットの内容が同期フレームのためであることを示すビット。 VRCを使用してエンコーダにかかわらず、画像のどのスレッドがエラーやパケット損失によって破損していることを確実にするために、特定のピクチャの少なくとも1つの表現の受信が（確保され、同一の「同期」の画像のいくつかの表現を送信することができます）少なくとも一つのスレッド内で。同期画像は、その後、任意のスレッドを予測するために使用することができます。パケット損失が発生していない場合、スレッド0のシンクフレームの内容を使用することができ、他のスレッドのものは廃棄（および同様に他のスレッドのために）ことができます。スレッド0は、他のすべての好ましい使用がの「正規の」スレッドと考えられます。下糸番号を有するパケットの内容は、より高いスレッド数を有するものよりも高い処理と配信優先度を有するとみなされます。したがって、所与のシンクフレームのための下糸番号を有するパケットは、で指定されるように、より高い番号のスレッドの同期コンテンツの廃棄をもたらす無損失と低時間ジッタ条件下デコーダ、第1送達されなければなりません[H263]の付属書N。"
    },
    {
      "indent": 0,
      "text": "6. Packetization Schemes",
      "section_title": true,
      "ja": "6.パケット化スキーム"
    },
    {
      "indent": 0,
      "text": "6.1. Picture Segment Packets and Sequence Ending Packets (P=1)",
      "section_title": true,
      "ja": "6.1. 画像セグメントパケットとシーケンスパケットの終了（P = 1）"
    },
    {
      "indent": 3,
      "text": "A picture segment packet is defined as a packet that starts at the location of a Picture, GOB, or slice start code in the H.263+ data stream. This corresponds to the definition of the start of a video picture segment as defined in H.263+. For such packets, P=1 always.",
      "ja": "画像セグメントパケットはH.263 +データストリームにおけるピクチャ、GOB、またはスライススタートコードの位置から始まるパケットとして定義されます。 263 +で定義されたように、これは、ビデオピクチャセグメントの開始の定義に対応します。そのようなパケットのために、P = 1常に。"
    },
    {
      "indent": 3,
      "text": "An extra picture header can sometimes be attached in the payload header of such packets. Whenever an extra picture header is attached as signified by PLEN>0, only the last six bits of its picture start code, '100000', are included in the payload header. A complete H.263+ picture header with byte-aligned picture start code can be conveniently assembled on the receiving end by prepending the sixteen leading '0' bits.",
      "ja": "余分ピクチャヘッダは、しばしば、そのようなパケットのペイロードヘッダに取り付けることができます。 PLEN> 0によって示されるように、余分なピクチャヘッダが取り付けられているときはいつでも、その画像開始コードの最後の6ビット、「100000」は、ペイロードヘッダに含まれています。バイト整列ピクチャスタートコードとの完全なH.263 +ピクチャヘッダは、好都合には16主要「0」ビットを付加することにより、受信側で組み立てることができます。"
    },
    {
      "indent": 3,
      "text": "When PLEN>0, the end bit position corresponding to the last byte of the picture header data is indicated by PEBIT. The actual bitstream data shall begin on an 8-bit byte boundary following the payload header.",
      "ja": "PLEN> 0の場合、ピクチャヘッダデータの最後のバイトに対応するエンドビット位置がPEBITで示されています。実際のビットストリームデータは、ペイロードヘッダに続く8ビットのバイト境界で開始しなければなりません。"
    },
    {
      "indent": 3,
      "text": "A sequence ending packet is defined as a packet that starts at the location of an EOS or EOSBS code in the H.263+ data stream. This delineates the end of a sequence of H.263+ video data (more H.263+ video data may still follow later, however, as specified in ITU-T Recommendation H.263). For such packets, P=1 and PLEN=0 always.",
      "ja": "シーケンス終了パケットは、H.263 +データストリームにEOSまたはEOSBSコードの位置から始まるパケットとして定義されます。これは、（ITU-T勧告H.263に指定され、よりH.263 +ビデオデータはまだ、しかし、後でフォローすることができる）H.263 +ビデオデータのシーケンスの終わりを描きます。そのようなパケットのために、P = 1と常にPLEN = 0。"
    },
    {
      "indent": 3,
      "text": "The optional header extension for VRC may or may not be present as indicated by the V bit flag.",
      "ja": "Vビットフラグによって示されるようにVRCためのオプションヘッダ拡張があってもなくてもよいです。"
    },
    {
      "indent": 0,
      "text": "6.1.1. Packets that begin with a Picture Start Code",
      "section_title": true,
      "ja": "6.1.1. ピクチャスタートコードで始まり、パケット"
    },
    {
      "indent": 3,
      "text": "Any packet that contains the whole or the start of a coded picture shall start at the location of the picture start code (PSC) and should normally be encapsulated with no extra copy of the picture header. In other words, normally PLEN=0 in such a case. However, if the coded picture contains an incomplete picture header (UFEP = \"000\"), then a representation of the complete (UFEP = \"001\") picture header may be attached during packetization in order to provide greater error resilience. Thus, for packets that start at the location of a picture start code, PLEN shall be zero unless both of the following conditions apply:",
      "ja": "全部または符号化ピクチャの先頭を含む任意のパケットは、ピクチャスタートコード（PSC）の位置で開始しなければならない、通常ピクチャヘッダの余分なコピーでカプセル化されるべきです。すなわち、通常PLEN = 0におけるこのような場合です。符号化ピクチャは、不完全なピクチャヘッダ（UFEP =「000」）を含んでいる場合は、次に、完全（UFEP =「001」）ピクチャヘッダの表現は、より誤り耐性を提供するために、パケット間に取り付けられてもよいです。以下の条件の両方が適用されない限り、このように、ピクチャスタートコードの位置で開始パケットについて、PLENはゼロでなければなりません。"
    },
    {
      "indent": 3,
      "text": "1) The picture header in the H.263+ bitstream payload is incomplete (PLUSPTYPE present and UFEP=\"000\").",
      "ja": "1）H.263 +ビットストリームペイロードにおけるピクチャヘッダは、不完全（PLUSPTYPE存在とUFEP =「000」）です。"
    },
    {
      "indent": 3,
      "text": "2) The additional picture header that is attached is not incomplete (UFEP=\"001\").",
      "ja": "2）取り付けられている追加のピクチャヘッダは、（UFEP =「001」）不完全ではありません。"
    },
    {
      "indent": 3,
      "text": "A packet that begins at the location of a Picture, GOB, slice, EOS, or EOSBS start code shall omit the first two (all zero) bytes from the H.263+ bitstream and signify their presence by setting P=1 in the payload header.",
      "ja": "ピクチャ、GOB、スライス、EOS、又はEOSBSの位置で開始パケットは、コードが最初の2つ（全てゼロ）H.263 +ビットストリームからバイトを省略して、ペイロードにP = 1を設定することによって、その存在を意味するものと開始しますヘッダ。"
    },
    {
      "indent": 3,
      "text": "Here is an example of encapsulating the first packet in a frame (without an attached redundant complete picture header):",
      "ja": "ここで（添付の冗長完全ピクチャヘッダなし）フレーム内の最初のパケットをカプセル化する例です。"
    },
    {
      "indent": 5,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|   RR    |1|V|0|0|0|0|0|0|0|0|0| bitstream data without the    :\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n: first two 0 bytes of the PSC\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "6.1.2. Packets that begin with GBSC or SSC",
      "section_title": true,
      "ja": "6.1.2.  GBSCまたはSSCで始まるパケット"
    },
    {
      "indent": 3,
      "text": "For a packet that begins at the location of a GOB or slice start code (GBSC), PLEN may be zero or nonzero, depending on whether a redundant picture header is attached to the packet. In environments with very low packet loss rates, or when picture header contents are very seldom likely to change (except as can be detected from the GOB Frame ID (GFID) syntax of H.263+), a redundant copy of the picture header is not required. However, in less ideal circumstances a redundant picture header should be attached for enhanced error resilience, and its presence is indicated by PLEN>0.",
      "ja": "GOBまたはスライススタートコード（GBSC）の位置で開始パケットについて、PLEN冗長ピクチャヘッダをパケットに付加されているかどうかに依存して、ゼロ又は非ゼロであってもよいです。ピクチャヘッダの内容は、（H.263 +のGOBフレームID（GFID）構文を検出することができるよう除く）めったに変更する可能性がない、非常に低いパケット損失率を有する環境、またはでは、ピクチャヘッダの冗長コピーであります必須ではありません。しかし、あまり理想的な状況では、冗長ピクチャヘッダは、拡張誤り耐性のために取り付けられなければならない、及びその存在はPLEN> 0で示されています。"
    },
    {
      "indent": 3,
      "text": "Assuming a PLEN of 9 and P=1, below is an example of a packet that begins with a byte-aligned GBSC or a Slice Start Code (SSC):",
      "ja": "9のPLENとP = 1と仮定すると、以下のバイト整列GBSCまたはスライススタートコード（SSC）から始まるパケットの例です。"
    },
    {
      "indent": 7,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|   RR    |1|V|0 0 1 0 0 1|PEBIT|1 0 0 0 0 0| picture header    :\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n: starting with TR, PTYPE ...                                   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n| ...                                           | bitstream     :\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n: data starting with GBSC/SSC without its first two 0 bytes\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Notice that only the last six bits of the picture start code, '100000', are included in the payload header. A complete H.263+ picture header with byte aligned picture start code can be conveniently assembled, if needed, on the receiving end by prepending the sixteen leading '0' bits.",
      "ja": "画像開始コードの最後の6ビット「100000」ことがわかり、ペイロードヘッダに含まれています。必要に応じて、バイト整列ピクチャスタートコードとの完全なH.263 +ピクチャヘッダは、好都合には16主要「0」ビットを付加することにより受信側で、組み立てることができます。"
    },
    {
      "indent": 0,
      "text": "6.1.3. Packets that begin with an EOS or EOSBS Code",
      "section_title": true,
      "ja": "6.1.3.  EOSまたはEOSBSコードで始まるパケット"
    },
    {
      "indent": 3,
      "text": "For a packet that begins with an EOS or EOSBS code, PLEN shall be zero, and no Picture, GOB, or Slice start codes shall be included within the same packet. As with other packets beginning with start codes, the two all-zero bytes that begin the EOS or EOSBS code at the beginning of the packet shall be omitted, and their presence shall be indicated by setting the P bit to 1 in the payload header.",
      "ja": "EOSまたはEOSBSコードで始まるパケットに対して、PLENはゼロ、及び画像なし、GOB、またはスライスが符号が同じパケット内に含まれなければならない開始しなければなりません。開始コードで始まる他のパケットと同様に、パケットの先頭にEOSまたはEOSBSコードを始める2全ゼロバイトを省略するものとし、それらの存在は、ペイロードヘッダで1にPビットをセットすることによって示されなければなりません。"
    },
    {
      "indent": 3,
      "text": "System designers should be aware that some decoders may interpret the loss of a packet containing only EOS or EOSBS information as the loss of essential video data and may thus respond by not displaying some subsequent video information. Since EOS and EOSBS codes do not actually affect the decoding of video pictures, they are somewhat unnecessary to send at all. Because of the danger of misinterpretation of the loss of such a packet (which can be detected by the sequence number), encoders are generally to be discouraged from sending EOS and EOSBS.",
      "ja": "システム設計者は、いくつかのデコーダが必要不可欠ビデオデータの損失などだけEOSまたはEOSBS情報を含むパケットの損失を解釈することができ、したがって、いくつかのその後のビデオ情報を表示しないことによって応答することができることに注意する必要があります。 EOSとEOSBSコードが実際にビデオ映像のデコードには影響を与えませんので、彼らはすべての送信がやや不必要です。なぜなら（シーケンス番号によって検出することができる）は、パケットのロスの誤った解釈の危険性のため、エンコーダは、一般的にEOSとEOSBSを送信落胆します。"
    },
    {
      "indent": 3,
      "text": "Below is an example of a packet containing an EOS code:",
      "ja": "以下EOSコードを含むパケットの例です。"
    },
    {
      "indent": 8,
      "text": " 0                   1                   2\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|   RR    |1|V|0|0|0|0|0|0|0|0|0|1|1|1|1|1|1|0|0|\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "6.2. Encapsulating Follow-on Packet (P=0)",
      "section_title": true,
      "ja": "6.2. 封入後続パケット（P = 0）"
    },
    {
      "indent": 3,
      "text": "A Follow-on Packet contains a number of bytes of coded H.263+ data that do not start at a synchronization point. That is, a Follow-on Packet does not start with a Picture, GOB, Slice, EOS, or EOSBS header, and it may or may not start at a macroblock boundary. Since Follow-on Packets do not start at synchronization points, the data at the beginning of a Follow-on Packet is not independently decodable. For such packets, P=0 always. If the preceding packet of a Follow-on Packet got lost, the receiver may discard that Follow-on Packet, as well as all other following Follow-on Packets. Better behavior, of course, would be for the receiver to scan the interior of the packet payload content to determine whether any start codes are found in the interior of the packet that can be used as resync points. The use of an attached copy of a picture header for a Follow-on Packet is useful only if the interior of the packet or some subsequent Follow-on Packet contains a resync code, such as a GOB or slice start code. PLEN>0 is allowed, since it may allow resync in the interior of the packet. The decoder may also be resynchronized at the next segment or picture packet.",
      "ja": "後続のパケットは、同期ポイントで開始されませんコード化されたH.263 +データのバイト数が含まれています。すなわち、後続のパケットは、ピクチャ、GOB、スライス、EOS、又はEOSBSヘッダーで開始せず、又はマクロブロック境界で開始してもしなくてもよい、です。後続のパケットは、同期ポイントで開始されませんので、後続のパケットの先頭のデータが独立して復号可能ではありません。そのようなパケットのために、P = 0常に。後続のパケットの直前のパケットが失われてしまった場合、受信機はそれが後続のパケット破棄してもよいだけでなく、他のすべての以下の後続のパケット。受信機は、任意のスタートコードは、再同期ポイントとして使用することができるパケットの内部に見出されるかどうかを決定するために、パケットペイロードコンテンツの内部をスキャンするためのより良い動作、当然であろう。後続のパケットのためのピクチャヘッダの添付コピーの使用が有用である場合にのみ、パケットの内部またはいくつかの後続の後続パケットは、GOBまたはスライススタートコードのように、再同期コードを含みます。それは、パケットの内部に再同期を可能にすることができるので、PLEN> 0は、許可されています。デコーダはまた、次のセグメント又はピクチャパケットに再同期化することができます。"
    },
    {
      "indent": 3,
      "text": "Here is an example of a Follow-on Packet (with PLEN=0):",
      "ja": "ここでフォローオン（PLEN = 0）パケットの例です。"
    },
    {
      "indent": 5,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-\n|   RR    |0|V|0|0|0|0|0|0|0|0|0| bitstream data\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-",
      "raw": true
    },
    {
      "indent": 0,
      "text": "7. Use of this Payload Specification",
      "section_title": true,
      "ja": "このペイロード仕様の7."
    },
    {
      "indent": 3,
      "text": "There is no syntactical difference between a picture segment packet and a Follow-on Packet, other than the indication P=1 for picture segment or sequence ending packets and P=0 for Follow-on Packets. See the following for a summary of the entire packet types and ways to distinguish between them.",
      "ja": "画像セグメントパケットと後続のパケットを終了画像セグメントまたは配列の指標P = 1以外のパケット、およびP = 0後続パケット用の間には構文上の違いはありません。全体のパケットの種類とそれらを区別するための方法の概要については、以下を参照してください。"
    },
    {
      "indent": 3,
      "text": "It is possible to distinguish between the different packet types by checking the P bit and the first 6 bits of the payload along with the header information. The following table shows the packet type for permutations of this information (see also the picture/GOB/Slice header descriptions in H.263+ for details):",
      "ja": "Pビット、ヘッダ情報とともにペイロードの最初の6ビットをチェックすることにより、異なるパケットタイプを区別することが可能です。次の表は、この情報の順列のためのパケットタイプ（詳細についてもH.263 +絵/ GOB /スライスヘッダの説明を参照）を示しています。"
    },
    {
      "indent": 3,
      "text": "-------------+--------------+----------------------+----------------\nFirst 6 bits | P-Bit | PLEN |  Packet              |  Remarks\nof Payload   |(payload hdr.)|                      |\n-------------+--------------+----------------------+----------------\n100000       |   1   |  0   |  Picture             | Typical Picture\n100000       |   1   | > 0  |  Picture             | Note UFEP\n1xxxxx       |   1   |  0   |  GOB/Slice/EOS/EOSBS | See possible GNs\n1xxxxx       |   1   | > 0  |  GOB/Slice           | See possible GNs\nXxxxxx       |   0   |  0   |  Follow-on           |\nXxxxxx       |   0   | > 0  |  Follow-on           | Interior Resync\n-------------+--------------+----------------------+----------------",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The details regarding the possible values of the five bit Group Number (GN) field that follows the initial \"1\" bit when the P-bit is \"1\" for a GOB, Slice, EOS, or EOSBS packet are found in Section 5.2.3 of H.263 [H263].",
      "ja": "PビットはGOBについては、「1」である場合にビット「1」の初期に続く5ビットグループ番号（GN）フィールドの可能な値についての詳細は、スライス、EOS、又はEOSBSパケットは、セクション5.2に見られます。 H.263の3 [H263]。"
    },
    {
      "indent": 3,
      "text": "As defined in this specification, every start of a coded frame (as indicated by the presence of a PSC) has to be encapsulated as a picture segment packet. If the whole coded picture fits into one packet of reasonable size (which is dependent on the connection characteristics), this is the only type of packet that may need to be used. Due to the high compression ratio achieved by H.263+, it is often possible to use this mechanism, especially for small spatial picture formats such as Quarter Common Intermediate Format (QCIF) and typical Internet packet sizes around 1500 bytes.",
      "ja": "本明細書で定義されているように、符号化されたフレーム（PSCの存在によって示されるように）のすべての開始は、画像セグメントのパケットとしてカプセル化されなければなりません。全体の符号化ピクチャは、（接続特性に依存して）妥当なサイズの1つのパケットに収まる場合、これは使用される必要があるかもしれないパケットの唯一のタイプです。 H.263 +によって達成高圧縮比に、特に、クォーター共通中間フォーマット（QCIF）と1500バイトの周りに一般的なインターネットパケットサイズのような小さな空間画像フォーマットのために、この機構を使用することがしばしば可能です。"
    },
    {
      "indent": 3,
      "text": "If the complete coded frame does not fit into a single packet, two different ways for the packetization may be chosen. In case of very low or zero packet loss probability, one or more Follow-on Packets may be used for coding the rest of the picture. Doing so leads to minimal coding and packetization overhead, as well as to an optimal use of the maximal packet size, but does not provide any added error resilience.",
      "ja": "完全なコード化されたフレームは、単一のパケットに収まらない場合は、パケットのための2つの異なった方法を選択することができます。非常に低いまたはゼロパケット損失確率の場合には、一つ以上の後続のパケットは、画像の残りの部分を符号化するために使用することができます。そうすることで、最小限のコーディングとパケットのオーバーヘッドに、だけでなく、最大パケットサイズの最適な使用につながるが、任意の追加のエラー回復力を提供していません。"
    },
    {
      "indent": 3,
      "text": "The alternative is to break the picture into reasonably small partitions, called Segments (by using the Slice or GOB mechanism), that do offer synchronization points. By doing so and using the Picture Segment payload with PLEN>0, decoding of the transmitted packets is possible even in cases in which the Picture packet containing the picture header was lost (provided any necessary reference picture is available). Picture Segment packets can also be used in conjunction with Follow-on Packets for large segment sizes.",
      "ja": "代替は、同期ポイントを提供していますか（スライスまたはGOBメカニズムを使用して）、セグメントと呼ばれる合理的に小さなパーティション、に画像を分割することです。 PLEN> 0で画像セグメントペイロードをそうし、使用することにより、送信されたパケットの復号が偶数ピクチャヘッダを含むピクチャパケットは（必要な参照ピクチャが利用可能で提供）が失われた場合に可能です。画像セグメントのパケットも大きいセグメントサイズのための後続パケットと併せて使用することができます。"
    },
    {
      "indent": 0,
      "text": "8. Media Type Definition",
      "section_title": true,
      "ja": "8.メディアタイプの定義"
    },
    {
      "indent": 3,
      "text": "This section specifies optional parameters that MAY be used to select optional features of the H.263 codec. The parameters are specified here as part of the Media Type registration for the ITU-T H.263 codec. A mapping of the parameters into the Session Description Protocol (SDP) [RFC4566] is also provided for applications that use SDP. Multiple parameters SHOULD be expressed as a media type string, in the form of a semicolon-separated list of parameter=value pairs.",
      "ja": "このセクションでは、H.263コーデックのオプション機能を選択するために使用できるオプションのパラメータを指定します。パラメータは、ITU-T H.263コーデックのメディアタイプ登録の一環として、ここで指定されています。セッション記述プロトコル（SDP）[RFC4566]にパラメータのマッピングは、また、SDPを使用するアプリケーションのために提供されます。複数のパラメータは、パラメータ=値のペアのセミコロンで区切られたリストの形式で、メディアタイプ文字列として表現されてください。"
    },
    {
      "indent": 0,
      "text": "8.1. Media Type Registrations",
      "section_title": true,
      "ja": "8.1. メディアタイプ登録"
    },
    {
      "indent": 3,
      "text": "This section describes the media types and names associated with this payload format. The section updates the previous registered version in RFC 3555 [RFC3555].",
      "ja": "このセクションでは、このペイロード形式に関連付けられているメディアの種類と名前を示します。セクションは、RFC 3555 [RFC3555]に以前登録されたバージョンを更新します。"
    },
    {
      "indent": 0,
      "text": "8.1.1. Registration of Media Type video/H263-1998",
      "section_title": true,
      "ja": "8.1.1. メディアタイプビデオの登録/ H263-1998"
    },
    {
      "indent": 3,
      "text": "Type name: video",
      "ja": "型名：ビデオ"
    },
    {
      "indent": 3,
      "text": "Subtype name: H263-1998",
      "ja": "サブタイプ名：H263-1998"
    },
    {
      "indent": 3,
      "text": "Required parameters: None",
      "ja": "必須パラメータ：なし"
    },
    {
      "indent": 3,
      "text": "Optional parameters:",
      "ja": "オプションのパラメータ："
    },
    {
      "indent": 6,
      "text": "SQCIF: Specifies the MPI (Minimum Picture Interval) for SQCIF resolution. Permissible values are integer values from 1 to 32, which correspond to a maximum frame rate of 30/(1.001 * the specified value) frames per second.",
      "ja": "SQCIF：SQCIFの解決のためにMPI（最小画像間隔）を指定します。許容値は、30 /（1.001 *指定された値）の最大フレームレートに対応する1から32までの整数値、秒あたりのフレーム数です。"
    },
    {
      "indent": 6,
      "text": "QCIF: Specifies the MPI (Minimum Picture Interval) for QCIF resolution. Permissible values are integer values from 1 to 32, which correspond to a maximum frame rate of 30/(1.001 * the specified value) frames per second.",
      "ja": "QCIF：QCIF解決のためのMPI（最小画像間隔）を指定します。許容値は、30 /（1.001 *指定された値）の最大フレームレートに対応する1から32までの整数値、秒あたりのフレーム数です。"
    },
    {
      "indent": 6,
      "text": "CIF: Specifies the MPI (Minimum Picture Interval) for CIF resolution. Permissible values are integer values from 1 to 32, which correspond to a maximum frame rate of 30/(1.001 * the specified value) frames per second.",
      "ja": "CIFは：CIF解像度のためのMPI（最小画像間隔）を指定します。許容値は、30 /（1.001 *指定された値）の最大フレームレートに対応する1から32までの整数値、秒あたりのフレーム数です。"
    },
    {
      "indent": 6,
      "text": "CIF4: Specifies the MPI (Minimum Picture Interval) for 4CIF resolution. Permissible values are integer values from 1 to 32, which correspond to a maximum frame rate of 30/(1.001 * the specified value) frames per second.",
      "ja": "CIF4：4CIF解像度のためのMPI（最小画像間隔）を指定します。許容値は、30 /（1.001 *指定された値）の最大フレームレートに対応する1から32までの整数値、秒あたりのフレーム数です。"
    },
    {
      "indent": 6,
      "text": "CIF16: Specifies the MPI (Minimum Picture Interval) for 16CIF resolution. Permissible values are integer values from 1 to 32, which correspond to a maximum frame rate of 30/(1.001 * the specified value) frames per second.",
      "ja": "CIF16：16CIF解像度のためのMPI（最小画像間隔）を指定します。許容値は、30 /（1.001 *指定された値）の最大フレームレートに対応する1から32までの整数値、秒あたりのフレーム数です。"
    },
    {
      "indent": 6,
      "text": "CUSTOM: Specifies the MPI (Minimum Picture Interval) for a custom-defined resolution. The custom parameter receives three comma-separated values, Xmax, Ymax, and MPI. The Xmax and Ymax parameters describe the number of pixels in the X and Y axis and must be evenly divisible by 4. The permissible values for MPI are integer values from 1 to 32, which correspond to a maximum frame rate of 30/(1.001 *the specified value).",
      "ja": "CUSTOM：カスタム定義の解像度のためのMPI（最小画像間隔）を指定します。カスタムパラメータは、コンマで区切られた3つの値、Xmaxの、Ymaxの、およびMPIを受けます。 XmaxとYmaxのパラメータは、XおよびY軸方向の画素数を記述し、MPIの許容値の最大フレームレートに対応する1から32までの整数値である4で割り切れるでなければならない30 /（1.001 *指定された値）。"
    },
    {
      "indent": 6,
      "text": "A system that declares support of a specific MPI for one of the resolutions SHALL also implicitly support a lower resolution with the same MPI.",
      "ja": "解像度のいずれかのための具体的なMPIのサポートを宣言するシステムはまた、暗黙的に同じMPIと低い解像度をサポートします。"
    },
    {
      "indent": 6,
      "text": "A list of optional annexes specifies which annexes of H.263 are supported. The optional annexes are defined as part of H263-1998, H263-2000. H.263 annex X [H263] defines profiles that group annexes for specific applications. A system that supports a specific annex SHALL specify its support using the optional parameters. If no annex is specified, then the stream is Baseline H.263.",
      "ja": "オプションの附属書のリストがサポートされているH.263の別館を指定します。オプションの附属書はH263-1998、H263-2000の一部として定義されます。 263附属書X [H263]はグループが特定の用途のための附属書プロファイルを定義しています。特定の附属書をサポートするシステムは、オプションのパラメータを使用して、そのサポートを指定しなければなりません。何の別館が指定されていない場合は、ストリームは、ベースラインH.263です。"
    },
    {
      "indent": 6,
      "text": "The allowed optional parameters for the annexes are \"F\", \"I\", \"J\", \"T\", \"K\", \"N\", and \"P\".",
      "ja": "附属書の許可オプションのパラメータは、 \"F\"、 \"I\"、 \"J\"、 \"T\"、 \"K\"、 \"N\"、および \"P\" です。"
    },
    {
      "indent": 6,
      "text": "\"F\", \"I\", \"J\", and \"T\" if supported, SHALL have the value \"1\". If not supported, they should not be listed or SHALL have the value \"0\".",
      "ja": "\"F\"、 \"I\"、 \"J\"、およびサポートされている場合、 \"T\" は、値 \"1\" を有するものとします。サポートされていない場合は、それらが記載されているべきではないか、値が「0」を有するものとします。"
    },
    {
      "indent": 6,
      "text": "\"K\" can receive one of four values 1 - 4:",
      "ja": "「K」四つの値1の1つを受信することができます -  4："
    },
    {
      "indent": 6,
      "text": "1: Slices In Order, Non-Rectangular",
      "ja": "1：順序でスライス、非矩形"
    },
    {
      "indent": 6,
      "text": "2: Slices In Order, Rectangular",
      "ja": "2：長方形、順番にスライス"
    },
    {
      "indent": 6,
      "text": "3: Slices Not Ordered, Non-Rectangular",
      "ja": "3：スライス非矩形、順序はありません"
    },
    {
      "indent": 6,
      "text": "4: Slices Not Ordered, Rectangular",
      "ja": "4：スライス、長方形の順序はありません"
    },
    {
      "indent": 6,
      "text": "\"N\": Reference Picture Selection mode - Four numeric choices (1 - 4) are available, representing the following modes:",
      "ja": "「N」：参照画像選択モード - 四つの数字の選択肢（1から4）は、以下のモードを表す、用意されています。"
    },
    {
      "indent": 6,
      "text": "1: NEITHER: No back-channel data is returned from the decoder to the encoder.",
      "ja": "1：NEITHER：なしバックチャネルデータは、エンコーダ、デコーダから返されません。"
    },
    {
      "indent": 6,
      "text": "2: ACK: The decoder returns only acknowledgment messages.",
      "ja": "2：ACK：デコーダは、肯定応答メッセージを返します。"
    },
    {
      "indent": 6,
      "text": "3: NACK: The decoder returns only non-acknowledgment messages.",
      "ja": "3：NACK：復号器は、否定応答メッセージを返します。"
    },
    {
      "indent": 6,
      "text": "4: ACK+NACK: The decoder returns both acknowledgment and non-acknowledgment messages.",
      "ja": "4：ACK + NACK：デコーダは、肯定応答と否定応答メッセージの両方を返します。"
    },
    {
      "indent": 6,
      "text": "No special provision is made herein for carrying back channel information. The Extended RTP Profile for RTCP-based Feedback [RFC4585] MAY be used as a back channel mechanism.",
      "ja": "特別な規定は、チャネル情報をバック運ぶための、本明細書に行われません。 RTCPベースのフィードバック[RFC4585]の拡張RTPプロファイルは、バックチャネル機構として使用することができます。"
    },
    {
      "indent": 6,
      "text": "\"P\": Reference Picture Resampling, in which the following submodes are represented as a number from 1 to 4:",
      "ja": "「P」：リファレンスピクチャリサンプリングは、次のサブモードは、1から4までの数として表現されています。"
    },
    {
      "indent": 6,
      "text": "1: dynamicPictureResizingByFour",
      "ja": "1：dynamicPictureResizingByFour"
    },
    {
      "indent": 6,
      "text": "2: dynamicPictureResizingBySixteenthPel",
      "ja": "2：dynamicPictureResizingBySixteenthPel"
    },
    {
      "indent": 6,
      "text": "3: dynamicWarpingHalfPel",
      "ja": "3：dynamicWarpingHalfPel"
    },
    {
      "indent": 6,
      "text": "4: dynamicWarpingSixteenthPel",
      "ja": "4：dynamicWarpingSixteenthPel"
    },
    {
      "indent": 6,
      "text": "Example: P=1,3",
      "ja": "例：P = 1,3"
    },
    {
      "indent": 6,
      "text": "PAR: Arbitrary Pixel Aspect Ratio. Defines the width:height ratio by two colon-separated integers between 0 and 255. Default ratio is 12:11, if not otherwise specified.",
      "ja": "PAR：任意のピクセルアスペクト比。幅を定義：特に指定しない場合は0〜255デフォルト率との間に2つのコロンで区切られた整数で高さの比は、12時11分です。"
    },
    {
      "indent": 6,
      "text": "CPCF: Arbitrary (Custom) Picture Clock Frequency: CPCF is a comma-separated list of eight parameters specifying a custom picture clock frequency and the MPI (minimum picture interval) for the supported picture sizes when using that picture clock frequency. The first two parameters are cd, which is an integer from 1 to 127, and cf, which is either 1000 or 1001. The custom picture clock frequency is given by the formula 1800000/(cd*cf) provided in the RTP Timestamp semantics in Section 3.1 above (as specified in H.263 section 5.1.7). Following the values of cd and cf, the remaining six parameters are SQCIFMPI, QCIFMPI, CIFMPI, CIF4MPI, CIF16MPI, and CUSTOMMPI, which each specify an integer MPI (minimum picture interval) for the standard picture sizes SQCIF, QCIF, CIF, 4CIF, 16CIF, and CUSTOM, respectively, as described above. The MPI value indicates a maximum frame rate of 1800000/(cd*cf*MPI) frames per second for MPI parameters having a value in the range from 1 to 2048, inclusive. An MPI value of 0 specifies that the associated picture size is not supported for the custom picture clock frequency. If the CUSTOMMPI parameter is not equal to 0, the CUSTOM parameter SHALL also be present (so that the Xmax and Ymax dimensions of the custom picture size are defined).",
      "ja": "CPCF：任意（カスタム）ピクチャークロック周波数：CPCFは、カスタム画像クロック周波数およびサポートされている画像のためのMPI（最小画像間隔）を指定する8つのパラメータをカンマで区切ったリストである画像クロック周波数を使用する際にサイズ。最初の2つのパラメータ1000または1001のいずれかである1から127までの整数であり、CD、およびCF、カスタム画像クロック周波数でRTPタイムスタンプセマンティクスに設け式1800000 /（CD用*のCF）で与えられるいます（H.263のセクション5.1.7で指定されるように）上記セクション3.1。 CDとCFの値以下、残りの6つのパラメータはそれぞれ、標準画像に対してサイズSQCIF、QCIF、CIF、4CIF整数MPI（最小画像間隔）を指定SQCIFMPI、QCIFMPI、CIFMPI、CIF4MPI、CIF16MPI、及びCUSTOMMPI、です、 16CIF、カスタム、それぞれ、上述したように。 MPI値は包括1から2048の範囲内の値を有するMPIパラメータの毎秒1800000 /（CD * CF * MPI）フレームの最大フレームレートを示しています。 0のMPI値は、関連する画像サイズは、カスタム画像クロック周波数ではサポートされていないことを指定します。 CUSTOMMPIパラメータが0に等しくない場合（カスタム画像サイズをXmaxとYmaxの寸法が定義されているように）、カスタムパラメータも存在しなければなりません。"
    },
    {
      "indent": 6,
      "text": "BPP: BitsPerPictureMaxKb. Maximum number of bits in units of 1024 bits allowed to represent a single picture. If this parameter is not present, then the default value, based on the maximum supported resolution, is used. BPP is integer value between 0 and 65536.",
      "ja": "BPP：BitsPerPictureMaxKb。 1024ビットの単位でのビットの最大数は、単一の画像を表現することができました。このパラメータが存在しない場合、デフォルト値は、サポートされる最大解像度に基づいて、使用されています。 BPPは0と65536の間の整数値です。"
    },
    {
      "indent": 6,
      "text": "HRD: Hypothetical Reference Decoder. See annex B of H.263 specification [H263]. This parameter, if supported, SHALL have the value \"1\". If not supported, it should not be listed or SHALL have the value \"0\".",
      "ja": "HRD：仮想基準デコーダ。 H.263仕様[H263]の付録Bを参照。このパラメータは、サポートされている場合、値「1」を有するものとします。サポートされていない場合は、それが記載されているべきではないか、値が「0」を有するものとします。"
    },
    {
      "indent": 3,
      "text": "Encoding considerations:",
      "ja": "エンコードの考慮事項："
    },
    {
      "indent": 6,
      "text": "This media type is framed and binary; see Section 4.8 in [RFC4288]",
      "ja": "このメディアタイプは、フレームとバイナリされます。 [RFC4288]でセクション4.8を参照してください"
    },
    {
      "indent": 3,
      "text": "Security considerations: See Section 11 of RFC 4629",
      "ja": "セキュリティの考慮事項：RFC 4629のセクション11を参照してください。"
    },
    {
      "indent": 3,
      "text": "Interoperability considerations:",
      "ja": "相互運用性の考慮事項："
    },
    {
      "indent": 6,
      "text": "These are receiver options; current implementations will not send any optional parameters in their SDP. They will ignore the optional parameters and will encode the H.263 stream without any of the annexes. Most decoders support at least QCIF and CIF fixed resolutions, and they are expected to be available almost in every H.263-based video application.",
      "ja": "これらは、受信機のオプションです。現在の実装では、彼らのSDP内の任意のオプションのパラメータを送信しません。彼らは、オプションのパラメータを無視し、附属書の任意なしH.263ストリームを符号化します。ほとんどのデコーダは、少なくともQCIFとCIF固定解像度をサポートし、それらはほぼすべてのH.263ベースのビデオアプリケーションで利用できることが期待されています。"
    },
    {
      "indent": 3,
      "text": "Published specification: RFC 4629",
      "ja": "公開された仕様：RFC 4629"
    },
    {
      "indent": 3,
      "text": "Applications that use this media type:",
      "ja": "このメディアタイプを使用するアプリケーション："
    },
    {
      "indent": 6,
      "text": "Audio and video streaming and conferencing tools.",
      "ja": "オーディオとビデオストリーミングおよび会議ツール。"
    },
    {
      "indent": 6,
      "text": "Additional information: None",
      "ja": "追加情報：なし"
    },
    {
      "indent": 6,
      "text": "Person and email address to contact for further information:",
      "ja": "詳細のために連絡する人とEメールアドレス："
    },
    {
      "indent": 3,
      "text": "Roni Even: roni.even@polycom.co.il",
      "ja": "ロニさえ：roni.even@polycom.co.il"
    },
    {
      "indent": 6,
      "text": "Intended usage: COMMON",
      "ja": "意図している用法：COMMON"
    },
    {
      "indent": 6,
      "text": "Restrictions on usage:",
      "ja": "使用に関する制限事項："
    },
    {
      "indent": 6,
      "text": "This media type depends on RTP framing and thus is only defined for transfer via RTP [RFC3550]. Transport within other framing protocols is not defined at this time.",
      "ja": "このメディアタイプは、RTPフレーミングに依存し、これが唯一のRTCP [RFC 3550]を介して転送するために定義されています。他のフレーミングプロトコル内の輸送は、この時点で定義されていません。"
    },
    {
      "indent": 3,
      "text": "Author: Roni Even",
      "ja": "著者：ロニでも"
    },
    {
      "indent": 3,
      "text": "Change controller:",
      "ja": "コントローラを変更します。"
    },
    {
      "indent": 6,
      "text": "IETF Audio/Video Transport working group, delegated from the IESG.",
      "ja": "IESGから委任IETFオーディオ/ビデオ輸送ワーキンググループ、。"
    },
    {
      "indent": 0,
      "text": "8.1.2. Registration of Media Type video/H263-2000",
      "section_title": true,
      "ja": "8.1.2. メディアタイプビデオの登録/ H263-2000"
    },
    {
      "indent": 3,
      "text": "Type name: video",
      "ja": "型名：ビデオ"
    },
    {
      "indent": 3,
      "text": "Subtype name: H263-2000",
      "ja": "サブタイプ名：H263-2000"
    },
    {
      "indent": 3,
      "text": "Required parameters: None",
      "ja": "必須パラメータ：なし"
    },
    {
      "indent": 3,
      "text": "Optional parameters:",
      "ja": "オプションのパラメータ："
    },
    {
      "indent": 6,
      "text": "The optional parameters of the H263-1998 type MAY be used with this media subtype. Specific optional parameters that may be used with the H263-2000 type are as follows:",
      "ja": "H263-1998タイプのオプションのパラメータは、このメディアサブタイプで使用されるかもしれません。次のようにH263-2000タイプで使用することができる特定のオプションのパラメータは次のとおりです。"
    },
    {
      "indent": 6,
      "text": "PROFILE: H.263 profile number, in the range 0 through 10, specifying the supported H.263 annexes/subparts based on H.263 annex X [H263]. The annexes supported in each profile are listed in table X.1 of H.263 annex X. If no profile or H.263 annex is specified, then the stream is Baseline H.263 (profile 0 of H.263 annex X).",
      "ja": "PROFILE：H.263プロファイル番号、範囲0に10を介して、H.263アネックスX [H263]に基づいて、サポートされているH.263の附属書/部品を指定します。なプロフィール又はH.263附属書が指定されていない場合、各プロファイルでサポートされている附属書は、H.263の附属書XのテーブルX.1にリストされ、その後、ストリームがベースラインH.263（H.263の附属書Xのプロフィール0）です。"
    },
    {
      "indent": 6,
      "text": "LEVEL: Level of bitstream operation, in the range 0 through 100, specifying the level of computational complexity of the decoding process. The level are described in table X.2 of H.263 annex X.",
      "ja": "LEVEL：ビットストリーム操作のレベル、範囲0 100を介して、復号化処理の計算の複雑さのレベルを指定します。レベルは、H.263の附属書XのテーブルX.2に記載されています。"
    },
    {
      "indent": 6,
      "text": "According to H.263 annex X, support of any level other than level 45 implies support of all lower levels. Support of level 45 implies support of level 10.",
      "ja": "263附属書Xによれば、レベル45以外の任意のレベルのサポートは、すべての下位レベルのサポートを意味しています。レベル45のサポートは、レベル10のサポートを意味します。"
    },
    {
      "indent": 6,
      "text": "A system that specifies support of a PROFILE MUST specify the supported LEVEL.",
      "ja": "PROFILEのサポートを指定するシステムは、サポートされているレベルを指定する必要があります。"
    },
    {
      "indent": 6,
      "text": "INTERLACE: Interlaced or 60 fields indicates the support for interlace display mode, as specified in H.263 annex W.6.3.11. This parameter, if supported SHALL have the value \"1\". If not supported, it should not be listed or SHALL have the value \"0\".",
      "ja": "INTERLACE：263附属書W.6.3.11で指定されるようにインターレースまたは60のフィールドは、インターレース表示モードのサポートを示しています。このパラメータは、サポートされている場合、値「1」を有するものとします。サポートされていない場合は、それが記載されているべきではないか、値が「0」を有するものとします。"
    },
    {
      "indent": 3,
      "text": "Encoding considerations:",
      "ja": "エンコードの考慮事項："
    },
    {
      "indent": 6,
      "text": "This media type is framed and binary; see Section 4.8 in [RFC4288]",
      "ja": "このメディアタイプは、フレームとバイナリされます。 [RFC4288]でセクション4.8を参照してください"
    },
    {
      "indent": 3,
      "text": "Security considerations: See Section 11 of RFC 4629",
      "ja": "セキュリティの考慮事項：RFC 4629のセクション11を参照してください。"
    },
    {
      "indent": 3,
      "text": "Interoperability considerations:",
      "ja": "相互運用性の考慮事項："
    },
    {
      "indent": 6,
      "text": "The optional parameters PROFILE and LEVEL SHALL NOT be used with any of the other optional parameters.",
      "ja": "オプションのパラメータのPROFILEとLEVELは、他のオプションパラメータのいずれかで使用してはなりません。"
    },
    {
      "indent": 3,
      "text": "Published specification: RFC 4629",
      "ja": "公開された仕様：RFC 4629"
    },
    {
      "indent": 3,
      "text": "Applications that use this media type:",
      "ja": "このメディアタイプを使用するアプリケーション："
    },
    {
      "indent": 6,
      "text": "Audio and video streaming and conferencing tools.",
      "ja": "オーディオとビデオストリーミングおよび会議ツール。"
    },
    {
      "indent": 3,
      "text": "Additional information: None",
      "ja": "追加情報：なし"
    },
    {
      "indent": 3,
      "text": "Person and email address to contact for further information :",
      "ja": "詳細のために連絡する人とEメールアドレス："
    },
    {
      "indent": 6,
      "text": "Roni Even: roni.even@polycom.co.il",
      "ja": "ロニさえ：roni.even@polycom.co.il"
    },
    {
      "indent": 3,
      "text": "Intended usage: COMMON",
      "ja": "意図している用法：COMMON"
    },
    {
      "indent": 3,
      "text": "Restrictions on usage:",
      "ja": "使用に関する制限事項："
    },
    {
      "indent": 6,
      "text": "This media type depends on RTP framing and thus is only defined for transfer via RTP [RFC3550]. Transport within other framing protocols is not defined at this time.",
      "ja": "このメディアタイプは、RTPフレーミングに依存し、これが唯一のRTCP [RFC 3550]を介して転送するために定義されています。他のフレーミングプロトコル内の輸送は、この時点で定義されていません。"
    },
    {
      "indent": 3,
      "text": "Author: Roni Even",
      "ja": "著者：ロニでも"
    },
    {
      "indent": 3,
      "text": "Change controller:",
      "ja": "コントローラを変更します。"
    },
    {
      "indent": 6,
      "text": "IETF Audio/Video Transport working group delegated from the IESG.",
      "ja": "IESGから委任IETFオーディオ/ビデオ輸送ワーキンググループ。"
    },
    {
      "indent": 0,
      "text": "8.2. SDP Usage",
      "section_title": true,
      "ja": "8.2.  SDPの使い方"
    },
    {
      "indent": 3,
      "text": "The media types video/H263-1998 and video/H263-2000 are mapped to fields in the Session Description Protocol (SDP) as follows:",
      "ja": "次のようにメディアタイプビデオ/ H263-1998及びビデオ/ H263-2000は、セッション記述プロトコル（SDP）内のフィールドにマッピングされます。"
    },
    {
      "indent": 3,
      "text": "o The media name in the \"m=\" line of SDP MUST be video.",
      "ja": "メディア名O「M =」SDPのラインがビデオでなければなりません。"
    },
    {
      "indent": 3,
      "text": "o The encoding name in the \"a=rtpmap\" line of SDP MUST be H263-1998 or H263-2000 (the media subtype).",
      "ja": "O SDPの「A = rtpmap」ラインでエンコーディング名はH263-1998またはH263-2000（メディアサブタイプ）でなければなりません。"
    },
    {
      "indent": 3,
      "text": "o The clock rate in the \"a=rtpmap\" line MUST be 90000.",
      "ja": "O「A = rtpmap」行のクロックレートは90000でなければなりません。"
    },
    {
      "indent": 3,
      "text": "o The optional parameters, if any, MUST be included in the \"a=fmtp\" line of SDP. These parameters are expressed as a media type string, in the form of a semicolon-separated list of parameter=value pairs. The optional parameters PROFILE and LEVEL SHALL NOT be used with any of the other optional parameters.",
      "ja": "Oオプションのパラメータは、もしあれば、SDPの「A =のfmtp」行に含まれなければなりません。これらのパラメータは、パラメータ=値のペアのセミコロンで区切られたリストの形式で、メディアタイプ文字列として表されます。オプションのパラメータのPROFILEとLEVELは、他のオプションパラメータのいずれかで使用してはなりません。"
    },
    {
      "indent": 0,
      "text": "8.2.1. Usage with the SDP Offer Answer Model",
      "section_title": true,
      "ja": "8.2.1.  SDPオファーアンサーモデルと使用法"
    },
    {
      "indent": 3,
      "text": "For offering H.263 over RTP using SDP in an Offer/Answer model [RFC3264], the following considerations are necessary.",
      "ja": "オファー/アンサーモデル[RFC3264]でSDPを使用してRTPの上にH.263を提供するために、以下の考慮事項が必要です。"
    },
    {
      "indent": 3,
      "text": "Codec options (F,I,J,K,N,P,T): These options MUST NOT appear unless the sender of these SDP parameters is able to decode those options. These options designate receiver capabilities even when sent in a \"sendonly\" offer.",
      "ja": "コーデックオプション（F、I、J、K、N、P、T）は、これらのSDPパラメータの送信者がこれらのオプションをデコードすることができない限り、これらのオプションが表示されてはいけません。これらのオプションは、「sendonlyで」提供に送られたとしても、受信機の機能を指定します。"
    },
    {
      "indent": 3,
      "text": "Profile: The offer of a SDP profile parameter signals that the offerer can decode a stream that uses the specified profile. Each profile uses different H.263 annexes, so there is no implied relationship between them. An answerer SHALL NOT change the profile parameter and MUST reject the payload type containing an unsupported profile. A decoder that supports a profile SHALL also support H.263 baseline profile (profile 0). An offerer is RECOMMENDED to offer all the different profiles it is interested to use as individual payload types. In addition an offerer, sending an offer using the PROFILE optional parameter, is RECOMMENDED to offer profile 0, as this will enable communication, and in addition allows an answerer to add those profiles it does support in an answer.",
      "ja": "プロフィール：オファーは、指定されたプロファイルを使用してストリームを復号することができるSDPプロファイルパラメータ信号の提供。各プロファイルは、異なるH.263の附属書を使用するため、それらの間に暗黙の関係はありません。回答は、プロファイルパラメータを変更ないものとサポートされていないプロファイルを含むペイロードタイプを拒絶​​しなければなりません。プロファイルをサポートしているデコーダはまた、H.263ベースラインプロファイル（プロファイル0）をサポートすること。オファー側は、個々のペイロード・タイプとして使用する興味を持っているすべての異なるプロファイルを提供することをお勧めします。これは、通信を可能にするようさらにPROFILEオプションのパラメータを使用してプランをご送付オファー側は、プロファイル0を提供するために推奨され、しかもその答えに、それはサポートしていますそれらのプロファイルを追加するために回答することができます。"
    },
    {
      "indent": 3,
      "text": "LEVEL: The LEVEL parameter in an offer indicates the maximum computational complexity supported by the offerer in performing decoding for the given PROFILE. An answerer MAY change the value (both up and down) of the LEVEL parameter in its answer to indicate the highest value it supports.",
      "ja": "LEVEL：オファーのレベルパラメータは、特定のプロファイルの復号を実行する際に申出によってサポートされる最大計算の複雑さを示しています。回答は、それがサポートする最大値を示すために、その答えに（上下両方）LEVELパラメータの値を変更することがあります。"
    },
    {
      "indent": 3,
      "text": "INTERLACE: The parameter MAY be included in either offer or answer to indicate that the offerer or answerer respectively supports reception of interlaced content. The inclusion in either offer or answer is independent of each other.",
      "ja": "INTERLACE：パラメータは、オファー側またはアンサー側はそれぞれ、インターレースコンテンツの受信をサポートすることを示すために提供または回答のいずれかに含まれるかもしれません。提供または回答のいずれかに含まれていることは、互いに独立しています。"
    },
    {
      "indent": 3,
      "text": "Picture sizes and MPI: Supported picture sizes and their corresponding minimum picture interval (MPI) information for H.263 can be combined. All picture sizes can be advertised to the other party, or only a subset. The terminal announces only those picture sizes (with their MPIs) which it is willing to receive. For example, MPI=2 means that the maximum (decodable) picture rate per second is 15/1.001 (approximately 14.985).",
      "ja": "ピクチャサイズ及びMPI：サポートされている画像サイズとH.263のためのそれらの対応する最小ピクチャ間隔（MPI）情報を組み合わせることができます。すべての画像サイズは、他の当事者、またはサブセットのみにアドバタイズすることができます。端末は受信していく所存です（自分のMPI付き）のみ画像サイズを発表しました。例えば、MPI = 2は、毎秒最大（復号可能）ピクチャレート（約14.985）15 / 1.001であることを意味します。"
    },
    {
      "indent": 3,
      "text": "If the receiver does not specify the picture size/MPI optional parameter, then it SHOULD be ready to receive QCIF resolution with MPI=1.",
      "ja": "受信機は画像サイズ/ MPIオプションのパラメータを指定していない場合、MPI = 1とQCIF解像度を受信する準備ができているべきです。"
    },
    {
      "indent": 3,
      "text": "Parameters offered first are the most preferred picture mode to be received.",
      "ja": "最初の提示パラメータを受信することが最も好ましいピクチャーモードです。"
    },
    {
      "indent": 3,
      "text": "Here is an example of the usage of these parameters:",
      "ja": "ここでは、これらのパラメータの使用方法の例です。"
    },
    {
      "indent": 6,
      "text": "CIF=4;QCIF=3;SQCIF=2;CUSTOM=360,240,2",
      "ja": "CIF = 4; QCIF = 3; SQCIF = 2; CUSTOM = 360,240,2"
    },
    {
      "indent": 3,
      "text": "This means that the encoder SHOULD send CIF picture size, which it can decode at MPI=4. If that is not possible, then QCIF with MPI value 3 should be sent; if neither are possible, then SQCIF with MPI value=2. The receiver is capable of (but least preferred) decoding custom picture sizes (max 360x240) with MPI=2. Note that most decoders support at least QCIF and CIF fixed resolutions, and that they are expected to be available almost in every H.263-based video application.",
      "ja": "これは、エンコーダが、それはMPI = 4で復号することができるCIF画像サイズを、送るべきであることを意味します。それが不可能な場合は、MPI値3を持つQCIFを送信する必要があります。もしどちらも可能であり、その後、MPIとSQCIFは値= 2。受信機は、MPI = 2の（しかし最も好ましくない）復号カスタム画像サイズ（最大360x240）が可能です。ほとんどのデコーダは、少なくともQCIFとCIF固定解像度をサポートすることに注意してください、そして、彼らはほぼすべてのH.263ベースのビデオアプリケーションで利用できることが期待されていること。"
    },
    {
      "indent": 3,
      "text": "Below is an example of H.263 SDP in an offer:",
      "ja": "以下は、提供してH.263 SDPの例です。"
    },
    {
      "indent": 6,
      "text": "a=fmtp:xx CIF=4;QCIF=2;F=1;K=1",
      "ja": "=のfmtp：CIF = 4 XX; QCIF = 2; F = 1; K = 1"
    },
    {
      "indent": 3,
      "text": "This means that the sender of this message can decode an H.263 bit stream with the following options and parameters: preferred resolution is CIF (at up to 30/4.004 frames per second), but if that is not possible then QCIF size is also supported (at up to 30/2.002 frames per second). Advanced Prediction mode (AP) and slicesInOrder-NonRect options MAY be used.",
      "ja": "これは、このメッセージの送信者は、以下のオプションやパラメータとH.263のビットストリームを復号することができることを意味する。好ましい解像度がCIF（毎秒最大30 / 4.004フレームで）であるが、それが不可能であるならば、QCIFサイズでもありますサポート（毎秒最大30 / 2.002フレームで）。高度な予測モード（AP）とslicesInOrder-NonRectオプションを使用することができます。"
    },
    {
      "indent": 3,
      "text": "Below is an example of H.263 SDP in an offer that includes the CPCF parameter.",
      "ja": "以下CPCFパラメータを含むオファーにH.263 SDPの一例です。"
    },
    {
      "indent": 6,
      "text": "a=fmtp:xx CPCF=36,1000,0,1,1,0,0,2;CUSTOM=640,480,2;CIF=1;QCIF=1",
      "ja": "=のfmtp：XX CPCF = 36,1000,0,1,1,0,0,2; CUSTOM = 640,480,2; CIF = 1; QCIF = 1"
    },
    {
      "indent": 3,
      "text": "This means that the sender of this message can decode an H.263 bit stream with a preferred custom picture size of 640x480 at a maximum frame rate of 25 frames per second using a custom picture clock frequency of 50 Hz. If that is not possible, then the 640x480 picture size is also supported at up to 30/2.002 frames per second using the ordinary picture clock frequency of 30/1.001 Hz. If neither of those is possible, then the CIF and QCIF picture sizes are also supported at up to 50 frames per second using the custom picture clock frequency of 50 Hz or up to 30/1.001 frames per second using the ordinary picture clock frequency of 30/1.001 Hz, and CIF is preferred over QCIF.",
      "ja": "これは、このメッセージの送信者が50Hzのカスタム画像クロック周波数を用いて、毎秒25のフレームの最大フレームレートで640×480の好適なカスタム画像サイズでH.263のビットストリームを復号することができることを意味します。それが不可能な場合は、640×480の画像サイズは、また、30 / 1.001ヘルツの通常の画像クロック周波数を使用して、毎秒最大30 / 2.002フレームに支持されています。それらのいずれもが可能である場合には、CIF及びQCIFピクチャサイズも30の通常画像クロック周波数を使用するか、最大毎秒30 / 1.001フレームに50ヘルツのカスタム画像クロック周波数を使用して、毎秒50のフレームで支持されています/1.001ヘルツ、及びCIFはQCIFよりも好ましいです。"
    },
    {
      "indent": 3,
      "text": "The following limitation applies for usage of these media types when performing offer/answer for sessions using multicast transport. An answerer SHALL NOT change any of the parameters in an answer, instead if the indicated values are not supported the payload type MUST be rejected.",
      "ja": "マルチキャストトランスポートを使用してセッションのためのオファー/アンサーを実行する場合、以下の制限がこれらのメディアタイプの使用のために適用されます。指定された値は、ペイロードタイプを拒絶​​しなければなりませんサポートされていない場合は回答ではなく、答えのパラメータのいずれかを変更してはなりません。"
    },
    {
      "indent": 1,
      "text": "9. Backward Compatibility to",
      "section_title": true,
      "ja": "9.下位互換性"
    },
    {
      "indent": 3,
      "text": "The current document is a revision of RFC 2429 and obsoletes it. This section will address the backward compatibility issues.",
      "ja": "現在のドキュメントは、RFC 2429の改正で、それを廃止します。このセクションでは、後方互換性の問題に対処します。"
    },
    {
      "indent": 0,
      "text": "9.1. New Optional Parameters for SDP",
      "section_title": true,
      "ja": "9.1.  SDPのための新しいオプションパラメータ"
    },
    {
      "indent": 3,
      "text": "The document adds new optional parameters to the H263-1998 and H263- 2000 payload type, defined in RFC 3555 [RFC3555]. Since these are optional parameters we expect that old implementations will ignore these parameters, and that new implementations that will receive the H263-1998 and H263-2000 payload types with no parameters will behave as if the other side can accept H.263 at QCIF resolution at a frame rate not exceeding 15/1.001 (approximately 14.985) frames per second.",
      "ja": "文書は、RFC 3555で定義されH263-1998とH263- 2000ペイロードタイプ、[RFC3555]に新しいオプションのパラメータを追加します。これらはオプションのパラメータであるため、私たちは、古い実装は、これらのパラメータを無視していること、およびH263-1998およびパラメータなしでH263-2000ペイロードタイプは、他の側かのように動作します受け取ります新しい実装はQCIF解像度でH.263を受け入れることができることを期待しますフレームレートで毎秒15 / 1.001（約14.985）フレームを超えません。"
    },
    {
      "indent": 0,
      "text": "10. IANA Considerations",
      "section_title": true,
      "ja": "10. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document updates the H.263 (1998) and H.263 (2000) media types, described in RFC 3555 [RFC3555]. The updated media type registrations are in Section 8.1.",
      "ja": "この文書では、H.263（1998）およびH.263（2000）メディアタイプ、RFC 3555 [RFC3555]で説明を更新します。更新されたメディアタイプの登録はセクション8.1です。"
    },
    {
      "indent": 0,
      "text": "11. Security Considerations",
      "section_title": true,
      "ja": "11.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "RTP packets using the payload format defined in this specification are subject to the security considerations discussed in the RTP specification [RFC3550] and any appropriate RTP profile (for example, [RFC3551]). This implies that confidentiality of the media streams is achieved by encryption. Because the data compression used with this payload format is applied end-to-end, encryption may be performed after compression, so there is no conflict between the two operations.",
      "ja": "本明細書で定義されたペイロードフォーマットを使用して、RTPパケットは、RTP仕様[RFC3550]と、任意の適切なRTPプロファイル（例えば、[RFC3551]）で説明したセキュリティ上の考慮の対象となっています。これは、メディアストリームの機密性は、暗号化によって達成されることを意味します。このペイロードフォーマットに使用されるデータ圧縮は、エンドツーエンドで適用されるため、暗号化は、圧縮後に行うことができるので、2つの操作の間に競合が存在しません。"
    },
    {
      "indent": 3,
      "text": "A potential denial-of-service threat exists for data encoding using compression techniques that have non-uniform receiver-end computational load. The attacker can inject pathological datagrams into the stream that are complex to decode and cause the receiver to be overloaded. The usage of authentication of at least the RTP packet is RECOMMENDED.",
      "ja": "潜在的なサービス拒否の脅威は、不均一な受信端計算負荷を有する圧縮技術を用いて、データ符号化のために存在します。攻撃者が復号及び受信機が過負荷にさせるのに複雑であるストリームに病理学的なデータグラムを注入することができます。少なくともRTPパケットの認証の使用が推奨されます。"
    },
    {
      "indent": 3,
      "text": "As with any IP-based protocol, in some circumstances a receiver may be overloaded simply by the receipt of too many packets, either desired or undesired. Network-layer authentication may be used to discard packets from undesired sources, but the processing cost of the authentication itself may be too high. In a multicast environment, pruning of specific sources may be implemented in future versions of IGMP [RFC2032] and in multicast routing protocols to allow a receiver to select which sources are allowed to reach it.",
      "ja": "任意のIPベースのプロトコルと同様に、いくつかの状況では、受信機は、所望のまたは望ましくないのいずれかで、あまりに多くのパケットを受信することによって簡単にオーバーロードされてもよいです。ネットワーク層認証は、望ましくないソースからのパケットを破棄するために使用することができるが、認証自体の処理コストが高すぎるかもしれません。マルチキャスト環境では、特定の供給源の剪定は、受信機がそれに到達するために許可されているソースを選択することを可能にするIGMPの将来のバージョン[RFC2032]およびマルチキャストルーティングプロトコルで実現されてもよいです。"
    },
    {
      "indent": 3,
      "text": "A security review of this payload format found no additional considerations beyond those in the RTP specification.",
      "ja": "このペイロード形式のセキュリティレビューは、RTP仕様のものを超えて追加の考慮事項は認められませんでした。"
    },
    {
      "indent": 0,
      "text": "12. Acknowledgements",
      "section_title": true,
      "ja": "12.謝辞"
    },
    {
      "indent": 3,
      "text": "This is to acknowledge the work done by Chad Zhu, Linda Cline, Gim Deisher, Tom Gardos, Christian Maciocco, and Donald Newell from Intel Corp., who co-authored RFC 2429.",
      "ja": "これは、RFC 2429を共著インテル社からチャド朱、リンダ・クライン、GIM Deisher、トム・ガルドス、クリスチャンMaciocco、そしてドナルド・ニューウェルで行った作業を確認することです。"
    },
    {
      "indent": 3,
      "text": "We would also like to acknowledge the work of Petri Koskelainen from Nokia and Nermeen Ismail from Cisco, who helped with composing the text for the new media types.",
      "ja": "我々はまた、新しいメディアタイプのテキストを構成して助けたノキアとシスコからNermeenイスマイル、からペトリKoskelainenの仕事を承認したいと思います。"
    },
    {
      "indent": 0,
      "text": "13. Changes from Previous Versions of the Documents",
      "section_title": true,
      "ja": "ドキュメントの以前のバージョンからの変更点13"
    },
    {
      "indent": 1,
      "text": "13.1. Changes from",
      "section_title": true,
      "ja": "13.1. からの変更点"
    },
    {
      "indent": 3,
      "text": "The changes from the RFC 2429 are:",
      "ja": "RFC 2429からの変更点は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "1. The H.263 1998 and 2000 media type are now in the payload specification.",
      "ja": "1. H.263 1998年と2000年のメディアタイプは、ペイロード仕様になりました。"
    },
    {
      "indent": 3,
      "text": "2. Added optional parameters to the H.263 1998 and 2000 media types.",
      "section_title": true,
      "ja": "2. H.263 1998年と2000年のメディアタイプにオプションのパラメータを追加しました。"
    },
    {
      "indent": 3,
      "text": "3. Mandate the usage of RFC 2429 for all H.263. RFC 2190 payload format should be used only to interact with legacy systems.",
      "ja": "3.委任統治すべてのH.263のためのRFC 2429の使用。 RFC 2190ペイロードフォーマットは、レガシーシステムと対話するためにのみ使用する必要があります。"
    },
    {
      "indent": 1,
      "text": "13.2. Changes from",
      "section_title": true,
      "ja": "13.2. からの変更点"
    },
    {
      "indent": 3,
      "text": "This document adds new optional parameters to the H263-1998 and H263-2000 payload types.",
      "ja": "この文書では、H263-1998とH263-2000ペイロードタイプに新しいオプションのパラメータが追加されます。"
    },
    {
      "indent": 0,
      "text": "14. References",
      "section_title": true,
      "ja": "14.参考文献"
    },
    {
      "indent": 0,
      "text": "14.1. Normative References",
      "section_title": true,
      "ja": "14.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[H263] International Telecommunications Union - Telecommunication Standardization Sector, \"Video coding for low bit rate communication\", ITU-T Recommendation H.263, January 2005.",
      "ja": "[H263]国際電気通信連合 - 電気通信標準化部門、ITU-T勧告H.263、2005年1月「低ビットレート通信用ビデオ符号化」。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3550] Schulzrinne, H., Casner, S., Frederick, R., and V. Jacobson, \"RTP: A Transport Protocol for Real-Time Applications\", STD 64, RFC 3550, July 2003.",
      "ja": "[RFC3550] Schulzrinneと、H.、Casner、S.、フレデリック、R.、およびV.ヤコブソン、 \"RTP：リアルタイムアプリケーションのためのトランスポートプロトコル\"、STD 64、RFC 3550、2003年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC3551] Schulzrinne, H. and S. Casner, \"RTP Profile for Audio and Video Conferences with Minimal Control\", STD 65, RFC 3551, July 2003.",
      "ja": "[RFC3551] Schulzrinneと、H.とS. Casner、 \"最小量のコントロールがあるオーディオとビデオ会議システムのためのRTPプロフィール\"、STD 65、RFC 3551、2003年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC3555] Casner, S. and P. Hoschka, \"MIME Type Registration of RTP Payload Formats\", RFC 3555, July 2003.",
      "ja": "[RFC3555] Casner、S.とP. Hoschka、 \"RTPペイロード形式のMIMEタイプ登録\"、RFC 3555、2003年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC4566] Handley, M., Jacobson, V., and C. Perkins, \"SDP: Session Description Protocol\", RFC 4566, July 2006.",
      "ja": "[RFC4566]ハンドリー、M.、ヤコブソン、V.、およびC.パーキンス、 \"SDP：セッション記述プロトコル\"、RFC 4566、2006年7月。"
    },
    {
      "indent": 0,
      "text": "14.2. Informative References",
      "section_title": true,
      "ja": "14.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC2032] Turletti, T., \"RTP Payload Format for H.261 Video Streams\", RFC 2032, October 1996.",
      "ja": "[RFC2032] Turletti、T.、 \"H.261ビデオストリームのためのRTPペイロードフォーマット\"、RFC 2032、1996年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC2190] Zhu, C., \"RTP Payload Format for H.263 Video Streams\", RFC 2190, September 1997.",
      "ja": "[RFC2190]朱、C.、 \"H.263ビデオストリームのためのRTPペイロードフォーマット\"、RFC 2190、1997年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC2429] Bormann, C., Cline, L., Deisher, G., Gardos, T., Maciocco, C., Newell, D., Ott, J., Sullivan, G., Wenger, S., and C. Zhu, \"RTP Payload Format for the 1998 Version of ITU-T Rec. H.263 Video (H.263+)\", RFC 2429, October 1998.",
      "ja": "[RFC2429]ボルマン、C.、クライン、L.、Deisher、G.、ガルドス、T.、Maciocco、C.、ニューウェル、D.、オット、J.、サリバン、G.、ウェンガー、S.、およびC 。朱、RFC 2429、1998年10月 \"ITU-T勧告H.263ビデオ（H.263 +）の1998年バージョンのためのRTPペイロードフォーマット\"。"
    },
    {
      "indent": 3,
      "text": "[RFC3264] Rosenberg, J. and H. Schulzrinne, \"An Offer/Answer Model with Session Description Protocol (SDP)\", RFC 3264, June 2002.",
      "ja": "[RFC3264]ローゼンバーグ、J.とH. Schulzrinneと、RFC 3264、2002年6月 \"セッション記述プロトコル（SDP）とのオファー/アンサーモデル\"。"
    },
    {
      "indent": 3,
      "text": "[RFC4288] Freed, N. and J. Klensin, \"Media Type Specifications and Registration Procedures\", BCP 13, RFC 4288, December 2005.",
      "ja": "[RFC4288]解放され、N.とJ. Klensin、 \"メディアタイプの仕様と登録手順\"、BCP 13、RFC 4288、2005年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC4585] Ott, J., Wenger, S., Sato, N., Burmeister, C., and J. Rey, \"Extended RTP Profile for Real-time Transport Control Protocol (RTCP)-Based Feedback (RTP/AVPF)\", RFC 4585, July 2006.",
      "ja": "[RFC4585]オット、J.、ウェンガー、S.、佐藤、N.、Burmeister、C.、およびJ.レイ「ベースのフィードバック（RTP / AVPF）リアルタイムトランスポート制御プロトコル（RTCP）の拡張RTPプロファイル」、RFC 4585、2006年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC4628] Even, R., \"RTP Payload Format for H.263 Moving RFC 2190 to Historic Status\", RFC 4628, January 2007.",
      "ja": "[RFC4628]であっても、R.、 \"歴史的な状態へのH.263の移動RFC 2190のためのRTPペイロードフォーマット\"、RFC 4628、2007年1月。"
    },
    {
      "indent": 3,
      "text": "[Vredun] Wenger, S., \"Video Redundancy Coding in H.263+\", Proc. Audio-Visual Services over Packet Networks, Aberdeen, U.K. 9/1997, September 1997.",
      "ja": "[Vredun]ウェンガー、S.、PROC \"ビデオ冗長性はH.263 +でコーディング\"。パケットネットワーク、アバディーン、U.K. 1997分の9、1997年9月を超えるオーディオビジュアルサービス。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Joerg Ott Helsinki University of Technology Networking Laboratory PO Box 3000 02015 TKK, Finland",
      "ja": "イェルク・オットヘルシンキ工科大学のネットワーキング研究所私書箱3000 02015 TKK、フィンランド"
    },
    {
      "indent": 3,
      "text": "EMail: jo@netlab.tkk.fi",
      "ja": "メールアドレス：jo@netlab.tkk.fi"
    },
    {
      "indent": 3,
      "text": "Carsten Bormann Universitaet Bremen TZI Postfach 330440 D-28334 Bremen, GERMANY",
      "ja": "カールステンボルマンUniversitaetブレーメンTZI POSTFACH 330440 D-28334ブレーメン、ドイツ"
    },
    {
      "indent": 3,
      "text": "Phone: +49.421.218-7024 Fax: +49.421.218-7000 EMail: cabo@tzi.org",
      "ja": "電話：+ 49.421.218-7024ファックス：+ 49.421.218-7000 Eメール：cabo@tzi.org"
    },
    {
      "indent": 3,
      "text": "Gary Sullivan Microsoft Corp. One Microsoft Way Redmond, WA 98052 USA",
      "ja": "ゲーリー・サリバンマイクロソフト社1マイクロソフト道、レッドモンド、ワシントン98052 USA"
    },
    {
      "indent": 3,
      "text": "EMail: garysull@microsoft.com",
      "ja": "メールアドレス：garysull@microsoft.com"
    },
    {
      "indent": 3,
      "text": "Stephan Wenger Nokia Research Center P.O. Box 100 33721 Tampere Finland",
      "ja": "ステファン・ウェンガーノキア・リサーチセンター私書箱ボックス100 33721タンペレフィンランド"
    },
    {
      "indent": 3,
      "text": "EMail: stewe@stewe.org",
      "ja": "メールアドレス：stewe@stewe.org"
    },
    {
      "indent": 3,
      "text": "Roni Even (editor) Polycom 94 Derech Em Hamoshavot Petach Tikva 49130 Israel",
      "ja": "ロニさえ（エディタ）ポリコム94 DerechエムHamoshavotペタク・チクヴァ49130イスラエル"
    },
    {
      "indent": 3,
      "text": "EMail: roni.even@polycom.co.il",
      "ja": "メールアドレス：roni.even@polycom.co.il"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The IETF Trust (2007).",
      "ja": "著作権（C）IETFトラスト（2007）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "この文書では、BCP 78に含まれる権利と許可と制限の適用を受けており、その中の記載を除いて、作者は彼らのすべての権利を保有します。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE IETF TRUST AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とCONTRIBUTOR「そのまま」、ORGANIZATION HE / SHEが表すまたはインターネットSOCIETY、（もしあれば）を後援し、IETF TRUST ANDインターネットエンジニアリングタスクフォース放棄ALLに設けられています。保証は、明示または黙示、この情報の利用および特定目的に対する権利または商品性または適合性の黙示の保証を侵害しない任意の保証がこれらに限定されません。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、本書またはそのような権限下で、ライセンスがたりないかもしれない程度に記載された技術の実装や使用に関係すると主張される可能性があります任意の知的財産権やその他の権利の有効性または範囲に関していかなる位置を取りません利用可能です。またそれは、それがどのような権利を確認する独自の取り組みを行ったことを示すものでもありません。 RFC文書の権利に関する手続きの情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IPRの開示のコピーが利用できるようにIETF事務局とライセンスの保証に行われた、または本仕様の実装者または利用者がそのような所有権の使用のための一般的なライセンスまたは許可を取得するために作られた試みの結果を得ることができますhttp://www.ietf.org/iprのIETFのオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、その注意にこの標準を実装するために必要とされる技術をカバーすることができる任意の著作権、特許または特許出願、またはその他の所有権を持ってすべての利害関係者を招待します。 ietf-ipr@ietf.orgのIETFに情報を記述してください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}