{
  "title": {
    "text": "RFC 6430 - Email Feedback Report Type Value: not-spam",
    "ja": "RFC 6430 - メールフィードバックレポートタイプ値：ないスパム"
  },
  "number": 6430,
  "created_at": "2019-10-31 03:06:44.579005+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                             K. Li\nRequest for Comments: 6430                                      B. Leiba\nCategory: Standards Track                            Huawei Technologies\nISSN: 2070-1721                                            November 2011",
      "raw": true
    },
    {
      "indent": 15,
      "text": "Email Feedback Report Type Value: not-spam",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document defines a new Abuse Reporting Format (ARF) feedback report type value: \"not-spam\". It can be used to report an email message that was mistakenly marked as spam.",
      "ja": "「ないスパム」：この文書は、新しい乱用報告様式（ARF）フィードバックレポートのタイプの値を定義します。誤ってスパムとしてマークされた電子メールメッセージを報告するために使用することができます。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6430.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6430で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2011 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2011 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n   1.1. Discussion .................................................2\n2. Feedback Report Type: not-spam ..................................3\n3. Example .........................................................3\n4. Security Considerations .........................................5\n5. IANA Considerations .............................................6\n6. Acknowledgements ................................................6\n7. References ......................................................6\n   7.1. Normative References .......................................6\n   7.2. Informative References .....................................6",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "In RFC 5965 [RFC5965], an Abuse Reporting Format (ARF) is defined for reporting email abuse. Currently, two feedback report types are defined that are related to the spam problem and that can be used to report abusive or fraudulent email messages:",
      "ja": "RFC 5965 [RFC5965]で、虐待の報告フォーマット（ARF）は、電子メールの乱用を報告するために定義されています。現在、2つのフィードバックレポートタイプは、スパム問題に関連しており、それは虐待や詐欺的な電子メールメッセージを報告するために使用することができるように定義されています。"
    },
    {
      "indent": 3,
      "text": "o abuse: indicates unsolicited email or some other kind of email abuse.",
      "ja": "O乱用は：迷惑メールや電子メールの乱用のいくつかの他の種類を示します。"
    },
    {
      "indent": 3,
      "text": "o fraud: indicates some kind of fraud or phishing activity.",
      "ja": "O詐欺は：詐欺やフィッシング活動のいくつかの種類を示します。"
    },
    {
      "indent": 3,
      "text": "This specification defines a new feedback report type: \"not-spam\". It can be used to report a message that was mistakenly marked as spam.",
      "ja": "「ないスパム」：この仕様は新しいフィードバックレポートタイプを定義します。誤って迷惑メールとしてマークされたメッセージを報告するために使用することができます。"
    },
    {
      "indent": 0,
      "text": "1.1. Discussion",
      "section_title": true,
      "ja": "1.1。討論"
    },
    {
      "indent": 3,
      "text": "In some cases, the email client receives an email message that was incorrectly tagged as spam, perhaps by the email system, or accidentally by the user. The email client accepts the end user's \"not-spam\" report instruction, retrieves information related to the message, and reports this email as not-spam to the email operator. When the email operator receives the report, it can determine what action is appropriate for the particular message and user. (The requirement for a not-spam report type is from the Open Mobile Alliance (OMA) Spam Report Requirement Document [OMA-SpamRep-RD].)",
      "ja": "いくつかのケースでは、電子メールクライアントは、ユーザが誤って、おそらく電子メールシステムによって、誤ってスパムとしてタグ付けされた電子メールメッセージを受信、または。電子メールクライアントは、エンドユーザーの「ないスパム」報告指示を受け付けたメールオペレータにない-スパムとしてこのメ​​ールメッセージに関連する情報、およびレポートを取得します。電子メールオペレータがレポートを受信すると、特定のメッセージとユーザーのための適切なアクションを決定することができます。 （スパムではないレポートタイプの要件は、オープン・モバイル・アライアンス（OMA）スパムレポート要件ドキュメント[OMA-SpamRep-RD]からです。）"
    },
    {
      "indent": 3,
      "text": "For example, in response to a \"not-spam\" report, the email system can remove the spam tag or otherwise reclassify the message, possibly preventing similar email for this user from being marked as spam in the future. The report can be used to adjust the training of an automated classifier. After processing the report, the email operator might send a notification to the email client about the processing result (for example, by moving the message from one mailbox to another, such as from \"Junk\" to \"Inbox\").",
      "ja": "たとえば、「スパムでない」のレポートに応じて、電子メールシステムは、スパムタグを削除することができますか、そうでない場合は、おそらく将来的にはスパムとしてマークされることから、このユーザのために同様のメールを防止すること、メッセージを再分類します。報告書は、自動化された分類器のトレーニングを調整するために使用することができます。レポートを処理した後、電子メールのオペレータは、（例えば、「受信トレイ」に「ジャンク」からと、別のメールボックスからメッセージを移動することで）処理結果についての電子メールクライアントに通知を送信することがあります。"
    },
    {
      "indent": 3,
      "text": "In most cases, \"not-spam\" reports will probably not be taken on their own, but will be considered along with other information, analysis of the message, etc. Because different users have different needs and different views of what constitutes spam, reports from one user might or might not be applicable to others. And because users might sometimes press a \"report not spam\" button accidentally, immediate strong action, such as marking all similar messages as \"good\" based on a single report, is probably not the right approach. Recipients of \"not-spam\" reports need to consider what's right in their environments.",
      "ja": "ほとんどの場合、「スパムでない」のレポートは、おそらく自分で取られることはありませんが、他の情報、メッセージの解析などさまざまなユーザーが異なるニーズやスパムを構成するものの異なる見解を持っているので、レポートと一緒に考慮されます1人のユーザからかもしれないか、他の人には適用できない場合があります。ユーザーは時々誤って「報告書ではないスパム」ボタンを押してください可能性があるため、そして、そのような単一のレポートに基づいて「良い」として、すべての同様のメッセージをマークするなど当面の強い行動は、おそらく正しいアプローチではありません。 「スパムでない」レポートの受信者はその環境にぴったりのものを検討する必要があります。"
    },
    {
      "indent": 3,
      "text": "There are anti-spam systems that use (non-standard) \"not spam\" feedback today. All of them take the reports and mix them with other spam reports and other data, using their own algorithms, to determine appropriate action. In no case do the existing systems use a \"not spam\" report as an immediate, automatic override.",
      "ja": "今日（非標準）「ではないスパム」のフィードバックを使用するアンチスパムシステムがあります。それらのすべては、適切な処置を決定するために、自分のアルゴリズムを使用して、レポートを取り、他のスパムレポートや他のデータとそれらをミックス。いかなる場合にも、既存のシステムは、即時、自動オーバライドとして「非スパム」レポートを使用します。"
    },
    {
      "indent": 3,
      "text": "The feedback types \"abuse\" and \"not-spam\" can be taken as opposites. A mistaken \"not-spam\" report could be countermanded by a subsequent \"abuse\" report from the same user, and an operator could consider collected reports of \"abuse\" and \"not-spam\" in making future assessments.",
      "ja": "フィードバックタイプの「虐待」と「ないスパムは、」反対とすることができます。誤解「ではないスパム」レポートでは、同じユーザーからの後続の「虐待」のレポートでcountermandedすることができ、オペレータは、将来の評価を行うことで、「虐待」と「ないスパム」の収集報告書を検討することができます。"
    },
    {
      "indent": 0,
      "text": "2. Feedback Report Type: not-spam",
      "section_title": true,
      "ja": "2.フィードバック報告書の種類：ないスパム"
    },
    {
      "indent": 3,
      "text": "This document defines a new feedback report type, \"not-spam\", which extends the Email Feedback Reports specification [RFC5965].",
      "ja": "この文書は、電子メールのフィードバックレポート仕様[RFC5965]を拡張し、新たなフィードバックレポートの種類、「ないスパムを」、定義されています。"
    },
    {
      "indent": 3,
      "text": "In the first MIME part of the feedback report message, the end user or the email client can add information to indicate why the message is not considered as spam -- for example, because the originator or its domain is well known.",
      "ja": "フィードバックレポートメッセージの最初のMIMEパートでは、エンドユーザーや電子メールクライアントは、メッセージがスパムと見なされていない理由を示すために情報を追加することができます - 例えば、発信元またはそのドメインはよく知られているので。"
    },
    {
      "indent": 0,
      "text": "3. Example",
      "section_title": true,
      "ja": "3.例"
    },
    {
      "indent": 3,
      "text": "In the example, Joe, a pharmaceuticals sales representative, has received a message about discount pharmaceuticals. Because that is a frequent subject of spam email, the message has been marked as spam -- incorrectly, in this case. Joe has reported it as \"not-spam\", and this is an example of the report, shortened (the \"[...etc...]\" part) for presentation here.",
      "ja": "例では、ジョー、医薬品の販売代理店は、割引の医薬品についてのメッセージを受信しました。それはスパムメールを頻繁に受けているので、メッセージがスパムとしてマークされている - 間違って、このケースでは。ジョーは「ないスパム」として、それを報告しており、これは、ここでのプレゼンテーションのための短縮報告書、（「[...等...]」の部分）の一例です。"
    },
    {
      "indent": 3,
      "text": "Note that the message has been signed using DomainKeys Identified Mail (DKIM) [RFC6376] -- a good security practice as suggested in Section 8.2 of RFC 5965 [RFC5965].",
      "ja": "RFC 5965 [RFC5965]のセクション8.2で提案されているように、良好なセキュリティプラクティス - メッセージがメール（DKIM）を同定DomainKeysの[RFC6376]を使用して署名されていることに留意されたいです。"
    },
    {
      "indent": 6,
      "text": "DKIM-Signature: v=1; a=rsa-sha256; s=abuse; d=example.com;\n  c=simple/simple; q=dns/txt; i=abusedesk@example.com;\n  h=From:Date:Subject:To:Message-ID:MIME-Version:Content-Type;\n  bh=iF4dMNYs/KepE0HuwfukJCDyjkduUzZFiaHqO9DMIPU=;\n  b=e+BF8DCHFGqCp7/pExleNz7pVaLEoT+uWj/8H9DoZpxFI1vNnCTDu14w5v\n    ze4mqJkldudVI0JspsYHTYeomhPklCV4F95GfwpM5W+ziUOv7AySTfygPW\n    EerczqZwAK88//oaYCFXq3XV9T/z+zlLp3rrirKGmCMCPPcbdSGv/Eg=\nFrom: <abusedesk@example.com>\nDate: Thu, 8 Mar 2005 17:40:36 EDT\nSubject: FW: Discount on pharmaceuticals\nTo: <abuse@example.net>\nMessage-ID: <20030712040037.46341.5F8J@example.com>\nMIME-Version: 1.0",
      "raw": true
    },
    {
      "indent": 6,
      "text": "Content-Type: multipart/report; report-type=feedback-report; boundary=\"part1_13d.2e68ed54_boundary\"",
      "ja": "コンテンツタイプ：マルチパート/レポート。レポートタイプ=フィードバックレポート。境界= \"part1_13d.2e68ed54_boundary\""
    },
    {
      "indent": 6,
      "text": "--part1_13d.2e68ed54_boundary Content-Type: text/plain; charset=\"US-ASCII\" Content-Transfer-Encoding: 7bit",
      "ja": "--part1_13d.2e68ed54_boundaryのContent-Type：text / plainの。文字セット= \"US-ASCII\" コンテンツ転送 - エンコード：7ビット"
    },
    {
      "indent": 6,
      "text": "This is an email abuse report for an email message received from IP 192.0.2.1 on Thu, 8 Mar 2005 14:00:00 EDT. For more information about this format please see http://tools.ietf.org/html/rfc5965 Comment: I sell pharmaceuticals, so this is not spam for me.",
      "ja": "これは、木のIP 192.0.2.1、2005年3月8日14時00分00秒EDTから受信した電子メールメッセージの電子メールの乱用レポートです。この形式の詳細についてはhttp://tools.ietf.org/html/rfc5965コメントを参照してください。私は、医薬品を販売するので、これは私のために、スパムではありません。"
    },
    {
      "indent": 6,
      "text": "--part1_13d.2e68ed54_boundary Content-Type: message/feedback-report",
      "ja": "--part1_13d.2e68ed54_boundaryのContent-Type：メッセージ/フィードバックレポート"
    },
    {
      "indent": 6,
      "text": "Feedback-Type: not-spam User-Agent: SomeGenerator/1.0 Version: 1",
      "ja": "帰還型：スパムではないのUser-Agent：SomeGenerator / 1.0バージョン：1"
    },
    {
      "indent": 6,
      "text": "--part1_13d.2e68ed54_boundary Content-Type: message/rfc822 Content-Disposition: inline",
      "ja": "--part1_13d.2e68ed54_boundaryのContent-Type：メッセージ/ RFC822のコンテンツディスポジション：インライン"
    },
    {
      "indent": 6,
      "text": "Received: from mailserver.example.net (mailserver.example.net [192.0.2.1]) by example.com with ESMTP id M63d4137594e46; Thu, 08 Mar 2005 14:00:00 -0400 From: <someone@example.net> To: <Undisclosed Recipients> Subject: Discount on pharmaceuticals MIME-Version: 1.0 Content-type: text/plain Message-ID: 8787KJKJ3K4J3K4J3K4J3.mail@example.net Date: Thu, 02 Sep 2004 12:31:03 -0500",
      "ja": "受信された：mailserver.example.netから（mailserver.example.net [192.0.2.1]）example.com ESMTP番号M63d4137594e46とすることにより、木、2005年3月8日14時00分00秒-0400から：<someone@example.net>宛先：<非公開受信者>件名：医薬品MIME-バージョンの割引：1.0コンテンツタイプ：text / plainのメッセージID：8787KJKJ3K4J3K4J3K4J3。 mail@example.net日：木、2004年9月2日12時31分03秒-0500"
    },
    {
      "indent": 6,
      "text": "Hi, Joe. I got a lead on a source for discounts on pharmaceuticals, and I thought you might be interested. [...etc...] --part1_13d.2e68ed54_boundary--",
      "ja": "こんにちは、ジョー。私は、医薬品の割引のためのソースのリードを得た、と私はあなたが興味があるかもしれないと思いました。 [...等...] --part1_13d.2e68ed54_boundary--"
    },
    {
      "indent": 24,
      "text": "Example 1: not-spam Report",
      "ja": "例1：スパムではないレポート"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "All of the security considerations from the Email Feedback Reports specification [RFC5965] are inherited here. In addition, the Email Feedback Reports Applicability Statement [MARF-AS] contains important information about trust relationships and other security- and integrity-related aspects of accepting abuse feedback.",
      "ja": "メールのフィードバックレポート仕様からセキュリティ上の考慮事項の全ての[RFC5965]は、ここで継承されます。また、電子メールのフィードバックは、適用性に関する声明[MARF-AS]は信頼関係や虐待からのフィードバックを受け入れ、他のセキュリティにとの整合性関連の側面に関する重要な情報が含まれて報告します。"
    },
    {
      "indent": 3,
      "text": "In particular, not-spam reports will likely be used in an attack on a filtering system, reporting true spam as \"not-spam\". Even in absence of malice, some not-spam reports might be made in error, or will only apply to the user sending the report. Operators need to be careful in trusting such reports, beyond their applicability to the specific user in question.",
      "ja": "具体的には、スパムではないレポートはおそらく「ではないスパム」として、真のスパムを報告し、フィルタリングシステムへの攻撃に使用されます。でも、悪意の不在では、いくつかのないスパムレポートはエラーに作られるかもしれない、またはレポートのみを送信するユーザーに適用されます。オペレータは、問題の特定のユーザーへの適用を超えて、そのような報告書を信頼するに注意する必要があります。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "ja": "5. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has registered the newly defined feedback type name: \"not-spam\", according to the instructions in Section 7.3 of the base specification [RFC5965].",
      "ja": "基本仕様[RFC5965]のセクション7.3の指示に従って、「ないスパム」：IANAは、新しく定義された帰還型の名前が登録されています。"
    },
    {
      "indent": 3,
      "text": "The following has been added to the \"Feedback Report Type Values\" registry:",
      "ja": "以下は、「フィードバックレポートタイプの値」レジストリに追加されました："
    },
    {
      "indent": 3,
      "text": "Feedback Type Name: not-spam",
      "ja": "フィードバックタイプ名：ないスパム"
    },
    {
      "indent": 3,
      "text": "Description: Indicates that the entity providing the report does not consider the message to be spam. This may be used to correct a message that was incorrectly tagged or categorized as spam.",
      "ja": "説明：レポートを提供するエンティティは、メッセージがスパムであることを考慮していないことを示します。これは、誤ってスパムとしてタグ付けまたは分類されたメッセージを修正するために使用されてもよいです。"
    },
    {
      "indent": 3,
      "text": "Published in: this document",
      "ja": "このドキュメント：に掲載されました"
    },
    {
      "indent": 3,
      "text": "Status: current",
      "ja": "ステータス：現在の"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgements",
      "section_title": true,
      "ja": "6.謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Murray S. Kucherawy and Bert Greevenbosch for their discussion and review, and J.D. Falk for suggesting some explanatory text.",
      "ja": "著者は、いくつかの説明テキストを示唆するために彼らの議論や検討、およびJ.D.フォークのためにマレーS. KucherawyとバートGreevenboschに感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7.参考"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "ja": "7.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC5965] Shafranovich, Y., Levine, J., and M. Kucherawy, \"An Extensible Format for Email Feedback Reports\", RFC 5965, August 2010.",
      "ja": "[RFC5965] Shafranovich、Y.、レヴァイン、J.、およびM. Kucherawy、 \"電子メールのフィードバックレポートの拡張フォーマット\"、RFC 5965、2010年8月。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "ja": "7.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[MARF-AS] Falk, J., \"Creation and Use of Email Feedback Reports: An Applicability Statement for the Abuse Reporting Format (ARF)\", Work in Progress, September 2011.",
      "ja": "[MARF-AS]フォーク、J.、「電子メールのフィードバックレポートの作成と使用：虐待の報告フォーマット（ARF）のための適用性に関する声明」の進捗状況、2011年9月で、作業。"
    },
    {
      "indent": 3,
      "text": "[OMA-SpamRep-RD] Open Mobile Alliance, \"Mobile Spam Reporting Requirements\", Candidate Version 1.0 OMA-RD-SpamRep-V1_0- 20101123-C, November 2010, <http:// www.openmobilealliance.org/Technical/release_program/docs/ SpamRep/V1_0-20101123-C/ OMA-RD-SpamRep-V1_0-20101123-C.pdf>.",
      "ja": "[OMA-SpamRep-RD]オープン・モバイル・アライアンス、 \"モバイルスパム報告要件\"、候補バージョン1.0 OMA-RD-SpamRep-V1_0- 20101123-C、2010年11月、<のhttp：// www.openmobilealliance.org/Technical/release_program /ドキュメント/ SpamRep / V1_0-20101123-C / OMA-RD-SpamRep-V1_0-20101123-C.pdf>。"
    },
    {
      "indent": 3,
      "text": "[RFC6376] Crocker, D., Ed., Hansen, T., Ed., and M. Kucherawy, Ed., \"DomainKeys Identified Mail (DKIM) Signatures\", RFC 6376, September 2011.",
      "ja": "[RFC6376]クロッカー、D.、編、ハンセン、T.編、及びM. Kucherawy、エド。、 \"ドメインキー・アイデンティファイド・メール（DKIM）署名\"、RFC 6376、2011年9月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Kepeng Li Huawei Technologies Huawei Base, Bantian, Longgang District Shenzhen, Guangdong 518129 P.R. China",
      "ja": "KE鵬リットルIH UAは技術胡ベース、禁止の日、長い剛性地区としてAが真で、GU Gケース洞518129中華人民共和国です"
    },
    {
      "indent": 3,
      "text": "Phone: +86-755-28974289 EMail: likepeng@huawei.com",
      "ja": "電話：+ 86-755-28974289電子メール：likepeng@huawei.com"
    },
    {
      "indent": 3,
      "text": "Barry Leiba Huawei Technologies",
      "ja": "バリー・レイバ、華為技術"
    },
    {
      "indent": 3,
      "text": "Phone: +1 646 827 0648 EMail: barryleiba@computer.org URI: http://internetmessagingtechnology.org/",
      "ja": "電話：+1 646 827 0648 Eメール：barryleiba@computer.org URI：http://internetmessagingtechnology.org/"
    }
  ]
}