{
  "title": {
    "text": "RFC 6473 - vCard KIND:application",
    "ja": "RFC 6473 - vCardののKIND：アプリケーション"
  },
  "number": 6473,
  "created_at": "2019-10-31 15:06:47.125769+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                    P. Saint-Andre\nRequest for Comments: 6473                                         Cisco\nCategory: Standards Track                                  December 2011\nISSN: 2070-1721",
      "raw": true
    },
    {
      "indent": 25,
      "text": "vCard KIND:application",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document defines a value of \"application\" for the vCard KIND property so that vCards can be used to represent software applications.",
      "ja": "vCardは、ソフトウェアアプリケーションを表すために使用することができるように、このドキュメントは、vCardのKindプロパティのための「アプリケーション」の値を定義します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6473.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6473で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2011 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2011 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Meaning .........................................................2\n3. Example .........................................................4\n4. IANA Considerations .............................................4\n5. Security Considerations .........................................4\n6. Acknowledgements ................................................5\n7. References ......................................................5\n   7.1. Normative References .......................................5\n   7.2. Informative References .....................................5",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "Version 4 of the vCard specification [RFC6350] defines a new KIND property to specify the type of entity that a vCard represents. During its work on the base vCard4 specification, the VCARDDAV Working Group defined values of \"individual\", \"organization\", \"group\", and \"location\" for the KIND property. The working group considered but then removed a value of \"thing\" to represent any type of physical entity, machine, software application, etc., with the expectation that such a value might be defined in a vCard extension. This document does not define a generic \"thing\" value but instead defines a more narrow \"application\" value so that vCards can be used to represent software applications.",
      "ja": "vCardの仕様のバージョン4 [RFC6350]はvCardが表すエンティティのタイプを指定する新しい種類のプロパティを定義します。ベースvCard4仕様に関する作業中は、VCARDDAVワーキンググループは、Kindプロパティのための「個人」、「組織」、「グループ」、および「場所」の値を定義しました。次いで考えしかしワーキンググループは、このような値は、vCardの拡張で定義されるかもしれないことを期待して、物理的な実体、機械、ソフトウェアアプリケーション、等の任意のタイプを表すために、「事」の値を除去します。この文書では、一般的な「もの」の値を定義するが、vCardのは、ソフトウェア・アプリケーションを表すために使用することができるように代わり、より狭い「アプリケーション」の値を定義していません。"
    },
    {
      "indent": 0,
      "text": "2. Meaning",
      "section_title": true,
      "ja": "2.意味"
    },
    {
      "indent": 3,
      "text": "When the KIND property has a value of \"application\", the vCard represents a software application such as a server, an online service (e.g., a chat room), or an automated software bot. More formally, an \"application\" is functionally equivalent to the 'applicationProcess' object class used in the Lightweight Directory Access Protocol [RFC4519] as derived from the Open Systems Interconnection model [X.521] [X.200]. As one example of the \"application\" KIND, vCards are currently used in the Extensible Messaging and Presence Protocol [RFC6120] to represent instant messaging servers that are deployed on the network.",
      "ja": "Kindプロパティが「アプリケーション」の値を持つときは、vCardのは、サーバなどのソフトウェアアプリケーション、オンラインサービス（例えば、チャットルーム）、または自動化されたソフトウェアのボットを表します。開放型システム間相互接続モデルから派生して、より正式には、「アプリケーション」[X.200] [X.521]ライトウェイトディレクトリアクセスプロトコル[RFC4519]で使用される「applicationProcess」オブジェクトのクラスと機能的に同等です。 「アプリケーション」の種類の一例として、vCardのは、現在、ネットワーク上に展開されているインスタントメッセージングサーバーを表現するために拡張可能なメッセージングとプレゼンスプロトコル[RFC6120]で使用されています。"
    },
    {
      "indent": 3,
      "text": "The properties included in an application's vCard apply to one of the following:",
      "ja": "アプリケーションのvCardの中に含まれるプロパティは、次のいずれかに適用されます。"
    },
    {
      "indent": 3,
      "text": "o The application itself (e.g., the FN property might represent the friendly name of an application service, the URL property might represent a website that contains further information about the service, and the ADR, GEO, and TZ properties might represent the physical address, geographical location, and time zone of the machine where the service is hosted).",
      "ja": "Oアプリケーション自体（例えば、アプリケーション・サービスのフレンドリ名を表すことができますFNプロパティは、URLプロパティは、物理アドレスを表すかもしれないサービス、およびADR、GEO、およびTZのプロパティに関する詳細情報が含まれているウェブサイトを表すことができ、地理的位置、およびサービスがホストされているマシンのタイムゾーン）。"
    },
    {
      "indent": 3,
      "text": "o An organization or person that makes the application available on the network (e.g., the LOGO property might represent the corporate logo of a service provider).",
      "ja": "Oネットワーク上のアプリケーションが利用できるようにする組織や人が（例えば、ロゴプロパティは、サービスプロバイダの企業ロゴを表すことができます）。"
    },
    {
      "indent": 3,
      "text": "o A person or role that maintains the application (e.g., the TEL, EMAIL, and IMPP properties might represent ways to contact a server administrator).",
      "ja": "Oアプリケーションを維持して人や役割が（例えば、TEL、EMAIL、およびIMPPのプロパティは、サーバー管理者に連絡する方法を表しているかもしれません）。"
    },
    {
      "indent": 3,
      "text": "When a property represents some aspect of the application itself, it makes no sense to include the \"work\" and \"home\" values of the TYPE parameter since software applications do not have work places and personal lives (see the definition of the TYPE parameter in Section 5.6 of [RFC6350]). When a property represents information about an individual associated with the application (e.g., an individual service administrator as opposed to a generic service administrator role or an associated organization), inclusion of the \"work\" and \"home\" values can be appropriate.",
      "ja": "プロパティは、アプリケーション自体のいくつかの側面を表す場合、ソフトウェアアプリケーションは、作業場所や私生活を持っていないので、TYPEパラメータの「仕事」と「家庭」の値を含めることも意味がありません（中TYPEパラメータの定義を参照してください[RFC6350]のセクション5.6）。プロパティは、アプリケーション（例えば、一般的なサービス管理者の役割または関連組織とは対照的に、個々のサービスの管理者）に関連付けられた個人に関する情報である場合、「仕事」と「家庭」の値を含めることは、適切であり得ます。"
    },
    {
      "indent": 3,
      "text": "The following base properties make sense for vCards that represent software applications (this list is not exhaustive, and other properties might be applicable as well):",
      "ja": "以下の塩基特性は、ソフトウェア・アプリケーションを（このリストは網羅的ではなく、その他のプロパティは、同様に適用できる可能性がある）を表すvCardのために意味をなします。"
    },
    {
      "indent": 3,
      "text": "o ADR o EMAIL o FN o GEO o IMPP o KEY o KIND o LANG o LOGO o NOTE o ORG o PHOTO o REV o SOURCE o TEL o TZ o URL",
      "ja": "ADRのEMAIL FN GEO IMPP KEY KIND LANGロゴNOTE ORGのPHOTO REVソースTEL TZのURL"
    },
    {
      "indent": 3,
      "text": "Although it might be desirable to define a more fine-grained taxonomy of applications (e.g., a KIND of \"application\" with a subtype of \"server\" or \"IM server\"), such a taxonomy is out of the scope of this document.",
      "ja": "それは、アプリケーション（例えば、「サーバ」または「IMサーバ」のサブタイプと「アプリケーション」の一種）のよりきめの細かい分類を定義することが望ましいかもしれないが、このような分類は、この文書の範囲外です。"
    },
    {
      "indent": 0,
      "text": "3. Example",
      "section_title": true,
      "ja": "3.例"
    },
    {
      "indent": 3,
      "text": "The following example of an Extensible Messaging and Presence Protocol (XMPP) server is borrowed from [XEP-0292]. The XML representation of the vCard is described in [RFC6351], which allows for the use of the new \"application\" value using the \"iana-token\" production defined in [RFC6350].",
      "ja": "拡張メッセージングおよびプレゼンスプロトコル（XMPP）サーバの以下の例は[XEP-0292]から借用されます。 vCardのXML表現は、[RFC6350]で定義された「IANAトークン」生産を使用して、新しい「アプリケーション」値の使用を可能に[RFC6351]に記載されています。"
    },
    {
      "indent": 3,
      "text": "<vcard xmlns=\"urn:ietf:params:xml:ns:vcard-4.0\"> <fn><text>jabber.org IM service</text></fn> <url><uri>http://www.jabber.org/</uri></url> <lang> <parameters><pref><integer>1</integer></pref></parameters> <language-tag>en</language-tag> </lang> <email><text>xmpp@jabber.org</text></email> <impp><uri>xmpp:jabber.org</uri></impp> <logo><uri>http://www.jabber.org/images/logo.png</uri></logo> <geo><uri>geo:42.25,-91.05</uri></geo> <tz><text>America/Chicago</text></tz> <source><uri>xmpp:jabber.org?vcard</uri></source> <rev><timestamp>19990104T122100Z</timestamp></rev> <kind><text>application</text></kind> </vcard>",
      "ja": "<vCardののxmlns = \"壷：IETF：のparams：XML：NS：vCardの-4.0\"> <FN> <テキスト> jabber.org IMサービス</テキスト> </ FN> <URL> <URI>のhttp：// WWW .jabber.org / </ URI> </ URL> <言語> <パラメータ> <県> <整数> 1 </整数> </県> </パラメータ> <言語タグ>エン</言語タグ> </ LANG> <Eメール> <テキスト> xmpp@jabber.org </テキスト> </メール> <IMPP> <URI> XMPP：jabber.org </ URI> </ IMPP> <ロゴ> <URI>のhttp： //www.jabber.org/images/logo.png</uri> </ロゴ> <地理> <URI> GEO：42.25、-91.05 </ URI> </地理> <TZ> <テキスト>アメリカ/シカゴ</テキスト> </ TZ> <ソース> <URI> XMPP：？jabber.org vCardの</ URI> </ソース> <REV> <タイムスタンプ> 19990104T122100Z </タイムスタンプ> </ REV> <種類> <テキスト>アプリケーション</テキスト> </種類> </ vCardの>"
    },
    {
      "indent": 0,
      "text": "4. IANA Considerations",
      "section_title": true,
      "ja": "4. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has added \"application\" to the registry of property values for vCard4. In conformance with Section 10.2.6 of [RFC6350], the registration is as follows, where the reference is to RFC 6473.",
      "ja": "IANAはvCard4のプロパティ値のレジストリに「アプリケーション」を追加しました。 [RFC6350]のセクション10.2.6に準拠して、登録基準は、RFC 6473にある場合、以下の通りです。"
    },
    {
      "indent": 3,
      "text": "Value: application",
      "ja": "値：アプリケーション"
    },
    {
      "indent": 3,
      "text": "Purpose: The entity represented by the vCard is a software application (e.g., a server, an online service such as a chat room, or an automated software bot).",
      "ja": "目的：vCardのに代表されるエンティティは、ソフトウェア・アプリケーション（例えば、サーバーは、そのようなチャットルームなどオンラインサービス、または自動化されたソフトウェアボット）です。"
    },
    {
      "indent": 3,
      "text": "Conformance: This value can be used with the KIND property.",
      "ja": "適合：この値は、Kindプロパティと一緒に使用することができます。"
    },
    {
      "indent": 3,
      "text": "Example: See Section 3 of RFC 6473.",
      "ja": "例：RFC 6473のセクション3を参照してください。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "Use of vCards to represent software applications is not envisioned to introduce security considerations beyond those specified for vCards in general as described in [RFC6350].",
      "ja": "ソフトウェアアプリケーションを表現するためのvCardの使用は[RFC6350]で説明したように、一般的にvCardのために指定されたものを超えたセキュリティ上の考慮事項を導入することが想定されていません。"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgements",
      "section_title": true,
      "ja": "6.謝辞"
    },
    {
      "indent": 3,
      "text": "Thanks to Cyrus Daboo, Barry Leiba, Kepeng Li, and Simon Perreault for their feedback.",
      "ja": "彼らのフィードバックのためのCyrus Daboo、バリー・レイバ、Kepengリー、そしてサイモン・ペローに感謝します。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7.参考"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "ja": "7.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC6350] Perreault, S., \"vCard Format Specification\", RFC 6350, August 2011.",
      "ja": "[RFC6350]ペロー、S.、 \"vCardのフォーマット仕様\"、RFC 6350、2011年8月。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "ja": "7.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC4519] Sciberras, A., \"Lightweight Directory Access Protocol (LDAP): Schema for User Applications\", RFC 4519, June 2006.",
      "ja": "[RFC4519] Sciberras、A.、 \"ライトウェイトディレクトリアクセスプロトコル（LDAP）：ユーザー・アプリケーションのためのスキーマ\"、RFC 4519、2006年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC6120] Saint-Andre, P., \"Extensible Messaging and Presence Protocol (XMPP): Core\", RFC 6120, March 2011.",
      "ja": "[RFC6120]サンアンドレ、P.、 \"拡張メッセージングおよびプレゼンスプロトコル（XMPP）：コア\"、RFC 6120、2011年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC6351] Perreault, S., \"xCard: vCard XML Representation\", RFC 6351, August 2011.",
      "ja": "[RFC6351]ペロー、S.、 \"xCard：vCardののXML表現\"、RFC 6351、2011年8月。"
    },
    {
      "indent": 3,
      "text": "[X.200] International Telecommunications Union, \"Information Technology - Open Systems Interconnection - Basic Reference Model: The Basic Model\", ITU-T Recommendation X.200, ISO Standard 7498-1, July 1994.",
      "ja": "[X.200]国際電気通信連合、 \"情報技術 - 開放型システム間相互接続 - 基本参照モデル：基本モデル\"、ITU-T勧告X.200、ISO規格7498-1、1994年7月。"
    },
    {
      "indent": 3,
      "text": "[X.521] International Telecommunications Union, \"Information Technology - Open Systems Interconnection - The Directory: Selected Object Classes\", ITU-T Recommendation X.521, ISO Standard 9594-7, November 2008.",
      "ja": "[X.521]国際電気通信連合、「情報技術 - 開放型システム間相互接続 - ディレクトリ：選択したオブジェクトクラス」、ITU-T勧告X.521、ISO規格9594から7、2008年11月。"
    },
    {
      "indent": 3,
      "text": "[XEP-0292] Saint-Andre, P. and S. Mizzi, \"vCard4 over XMPP\", XSF XEP 0292, October 2011.",
      "ja": "[XEP-0292]サンアンドレ、P.とS. Mizzi、 \"XMPPオーバーvCard4\"、XSF XEP 0292、2011年10月。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Peter Saint-Andre Cisco 1899 Wynkoop Street, Suite 600 Denver, CO 80202 USA",
      "ja": "ピーターサンアンドレのCisco 1899 Wynkoopストリート、スイート600デンバー、CO 80202 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1-303-308-3282 EMail: psaintan@cisco.com",
      "ja": "電話：+ 1-303-308-3282 Eメール：psaintan@cisco.com"
    }
  ]
}