{
  "title": {
    "text": "RFC 2550 - Y10K and Beyond",
    "ja": "RFC 2550 - Y10K枠を越えて、"
  },
  "number": 2550,
  "created_at": "2019-10-22 14:00:39.862272+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                       S. Glassman\nRequest for Comments: 2550                                   M. Manasse\nCategory: Stinkards Track                                      J. Mogul\n                                            Compaq Computer Corporation\n                                                           1 April 1999",
      "raw": true
    },
    {
      "indent": 28,
      "text": "Y10K and Beyond",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモはインターネットコミュニティのための情報を提供します。それはどんな種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1999). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1999）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "As we approach the end of the millennium, much attention has been paid to the so-called \"Y2K\" problem. Nearly everyone now regrets the short-sightedness of the programmers of yore who wrote programs designed to fail in the year 2000. Unfortunately, the current fixes for Y2K lead inevitably to a crisis in the year 10,000 when the programs are again designed to fail.",
      "ja": "私たちは千年の終わりに近づくにつれ、多くの関心は、いわゆる「Y2K」問題が注目されています。ほぼ全員が、今、必然的にプログラムが再び失敗するように設計されている年万の危機に残念ながら2000年に失敗するように設計されたプログラム、Y2Kリードの現在の修正を書いた昔のプログラマの近視を後悔します。"
    },
    {
      "indent": 3,
      "text": "This specification provides a solution to the \"Y10K\" problem which has also been called the \"YAK\" problem (hex) and the \"YXK\" problem (Roman numerals).",
      "ja": "この仕様は、「YAK」問題（16進数）と呼ばれ、「YXK」問題（ローマ数字）された「Y10K」問題に対する解決策を提供します。"
    },
    {
      "indent": 0,
      "text": "1. Introduction, Discussion, and Related Work",
      "section_title": true,
      "ja": "1.はじめ、ディスカッション、および関連研究"
    },
    {
      "indent": 3,
      "text": "Many programs and standards contain, manipulate and maintain dates. Comparing and sorting dates is a common activity. Many different formats and standards for dates have been developed and all have been found wanting.",
      "ja": "多くのプログラムや規格は、操作および保守日付を含みます。日付を比較し、ソートすることは一般的な活動です。日付のための多くの異なるフォーマットや規格が開発されており、すべてが望んで発見されています。"
    },
    {
      "indent": 3,
      "text": "Early date formats reserved only two digits to represent the year portion of a date. Programs that use this format make mistakes when dealing with dates after the year 2000. This is the so-called Y2K problem.",
      "ja": "初期の日付形式は、日付の年の部分を表現するために2桁のみを禁じます。これは、いわゆるY2K問題であり、2000年以降の日付を扱うときにこの形式を使用するプログラムは、間違いを犯します。"
    },
    {
      "indent": 3,
      "text": "The most common fix for the Y2K problem has been to switch to 4-digit years. This fix covers roughly the next 8,000 years (until the year 9999) by which time, everyone seems convinced that all current programs will have been retired. This is exactly the faulty logic and lazy programming practice that led to the current Y2K problem! Programmers and designers always assume that their code will eventually disappear, but history suggests that code and programs are often used well past their intended circumstances.",
      "ja": "Y2K問題の最も一般的な修正は4桁の年に切り替えることでした。この修正は、その時点で（9999年まで）の次の8000年のおおよそカバーし、誰もがすべての現在のプログラムが廃止されていると確信しそうです。これはまさに現在のY2K問題につながっ故障した論理と怠惰なプログラミングの練習です！プログラマやデザイナーは、常に自分のコードが最終的に消滅することを前提としていますが、歴史は、コードやプログラムは、多くの場合だけでなく、それらの意図状況を過ぎて使用されていることを示唆しています。"
    },
    {
      "indent": 3,
      "text": "The 4-digit year leads directly to programs that will fail in the year 10,000. This proposal addresses the Y10K problem in a general way that covers the full range of date and time format issues.",
      "ja": "4桁の年は年間万に失敗したプログラムに直結します。この提案は、日付と時刻の形式の問題の全範囲をカバーし、一般的な方法でY10Kの問題に対処します。"
    },
    {
      "indent": 0,
      "text": "1.1 Current approaches",
      "section_title": true,
      "ja": "1.1現在のアプローチ"
    },
    {
      "indent": 3,
      "text": "A large number of approaches exist for formatting dates and times. All of them have limitations. The 2-digit year runs into trouble next year. The 4-digit year hits the wall in the year 10,000. A 16-bit year runs out in the year 65,536. A 32-bit counter for the number of seconds since 1970 [UNIX] wraps in 2038. A 32-bit counter for the number of milli-seconds since booting crashes a Windows (TM) PC in 49.7 days [Microsoft].",
      "ja": "アプローチの多くは、日付と時刻をフォーマットするために存在します。それらのすべては制限があります。 2桁の年は来年トラブルに実行されます。 4桁の年は年間10,000分の壁にぶつかります。 16ビットの年は年間65,536でなくなりました。 1970年以降の秒数のための32ビットカウンタ[UNIX]は2038で49.7日[マイクロソフト]でWindows（TM）PCをクラッシュを起動以来のミリ秒数の32ビットカウンタをラップします。"
    },
    {
      "indent": 3,
      "text": "In this specification, we focus on the Y10K problems since they are most common and a large number of existing standards and protocols are susceptible to them (section 7). These standards, and new proposals on their way, will lead to a serious world-wide problem unless efforts are made now to correct the computing, government, and business communities.",
      "ja": "彼らは最も一般的であり、既存の規格やプロトコルの多くはそれら（セクション7）の影響を受けやすいので、この仕様では、我々はY10K問題に焦点を当てます。努力はコンピューティング、政府、およびビジネス・コミュニティを修正するために、今作られていない限り、これらの規格、および彼らの方法に新たな提案は、深刻な世界的な問題につながります。"
    },
    {
      "indent": 3,
      "text": "Already, a small cottage industry is popping up to deal with the Y10K problem [YUCK]. We encourage these efforts and, in the coming years, this effort can only grow in size and importance.",
      "ja": "すでに、小規模な家内工業はY10K問題[YUCK]に対処するためにポップアップされます。私たちは、今後数年間で、この努力が唯一の大きさや重要性に成長することができ、これらの取り組みを奨励して。"
    },
    {
      "indent": 0,
      "text": "1.2 A Fixed Format Y10K Fix",
      "section_title": true,
      "ja": "1.2固定フォーマットのY10K修正"
    },
    {
      "indent": 3,
      "text": "At the time of this writing, only one proposal [Wilborne] directly deals with the Y10K problem. In that proposal, dates are represented as decimal numbers with the dates compared numerically. The proposed format is simply YYYYYMMDD - i.e. 5-digit years.",
      "ja": "この記事の執筆時点では、一つだけの提案[Wilborne]は直接Y10K問題を扱っています。その提案では、日付が数値的に比較した日付と10進数で表されます。すなわち、5桁の年 - 提案されたフォーマットは、単にYYYYYMMDDあります。"
    },
    {
      "indent": 3,
      "text": "To allow numerical comparison of dates, this representation requires a completely fixed representation for the date. There can be no optional fields, the date resolution is limited to the granularity of one day, and this solution fails in the year 100,000 (Y100K).",
      "ja": "日付の数値比較を可能にするには、この表現は、日付のための完全に固定された表現が必要です。何のオプションフィールドはありえない、日付の解像度は、1日の粒度に制限され、この溶液は今年10万（Y100K）に失敗しました。"
    },
    {
      "indent": 0,
      "text": "1.2.2 Limitations of Numerical Comparison",
      "section_title": true,
      "ja": "数値比較の1.2.2制限事項"
    },
    {
      "indent": 3,
      "text": "While sufficient for the specific Y10K problem, this solution is limited. Even if extended for 6-digit years, it fails on 32-bit systems (and future 32-bit system emulators) after the date represented by the number 2147481231 (December 31, 214748) leading to a Y214749 problem. Similarly, 64-bit and 128-bit systems also will fail, although somewhat later (after December 31, 922,337,203,685,477 and December 31, 17,014,118,346,046,923,173,168,730,371,588,410 respectively).",
      "ja": "特定のY10K問題に十分なものの、この解決策は限られています。 6桁の年間延長場合でも、32ビットシステム（および将来の32ビット・システム・エミュレータ）で失敗Y214749問題につながる番号2147481231（12月31日214748）で表される日後。同様に、64ビットおよび128ビットのシステムもやや後であるが（12月31日922,337,203,685,477及び12月31日17,014,118,346,046,923,173,168,730,371,588,410それぞれの後）、失敗します。"
    },
    {
      "indent": 0,
      "text": "1.2.3 Granularity Issues",
      "section_title": true,
      "ja": "1.2.3粒度の問題"
    },
    {
      "indent": 3,
      "text": "The granularity problems of a fixed format date can be improved by extending the date format to include greater precision in the date. However, since numerical comparison of dates requires a fixed representation date, an extended format can not provide sufficient resolution for all foreseeable needs.",
      "ja": "固定フォーマットの日付の粒度の問題が日付に高い精度を含むように日付フォーマットを拡張することによって改善することができます。日付の数値比較は、固定された表現の日付を必要とするので、拡張フォーマットは、すべての予測可能なニーズに十分な解像度を提供することができません。"
    },
    {
      "indent": 3,
      "text": "For instance, if the precision were extended to the femto-second range the date format would become YYYYYMMDDHHMMSSmmmuuunnnpppfff (year, month, day, hour, minute, second, milli-second, micro-second, nano-second, pico-second, and femto-second). The additional 21 digits of this format limit the set of representable dates. Compared to 1.2.2, the 32-bit and 64-bit forms of the date are instantly exceeded, while the 128-bit version would be viable - expiring on December 31, 17,014,118,346,046.",
      "ja": "精度がフェムト秒の範囲に拡張された場合、例えば、日付フォーマットがYYYYYMMDDHHMMSSmmmuuunnnpppfff（年、月、日、時、分、秒、ミリ秒、マイクロ秒、ナノ秒、ピコ秒、およびなりますフェムト秒）。この形式の追加の21桁は表現日付のセットを制限します。 12月31日、17,014,118,346,046に期限切れ -  128ビットバージョンが実行可能になりながら、1.2.2と比較すると、日付の32ビットおよび64ビットフォームは即座に、超過しています。"
    },
    {
      "indent": 0,
      "text": "1.2.3.1 Extrapolation of Future Granularity Issues",
      "section_title": true,
      "ja": "今後の粒度の問題の1.2.3.1外挿"
    },
    {
      "indent": 3,
      "text": "However, a simple extrapolation of Moore's law shows that even femto-second resolution will soon be inadequate. Projecting current CPU clock speeds forward, a femto-second clock speed will be achieved in only 30 years. And, by the year 10,000 the projected clock speed of the Intel Pentium MMDCLXVI (TM) will be approximately 10 ** (- 1609) seconds.",
      "ja": "しかし、ムーアの法則の簡単な外挿は、さらにフェムト秒の分解能はすぐに不十分になることを示しています。現在のCPUクロックを突出する前進速度、フェムト秒のクロック速度はわずか30年で達成されます。 （ -  1609）秒と、今年万のIntel Pentium MMDCLXVI（TM）の投影クロック速度で約10 **になります。"
    },
    {
      "indent": 3,
      "text": "This discussion clearly shows that any fixed-format, integer representation of a date is likely to be insufficiently precise for future uses.",
      "ja": "この議論は、明らかに、日付の任意の固定形式、整数表現は将来の使用のために十分に正確である可能性が高いことを示しています。"
    },
    {
      "indent": 0,
      "text": "1.2.3.2 Floating Point Is No Solution",
      "section_title": true,
      "ja": "1.2.3.2浮動小数点では解決策ではありません"
    },
    {
      "indent": 3,
      "text": "The temptation to use floating point numbers to represent dates should be avoided. Like the longer fixed-format, integer representations of the date, floating point representations merely delay the inevitable time when their range is exceeded. In addition, the well known problems of real numbers - rounding, de-normalization, non-uniform distribution, etc. - just add to the problems of dealing with dates.",
      "ja": "日付を表現するために浮動小数点数を使用する誘惑は避けるべきです。長い固定形式、日付の整数表現のように、浮動小数点表現は、単に、それらの範囲を超えた不可避の時間を遅らせます。また、実数のよく知られた問題 - 丸め、非正規化、不均一な分布など - はちょうど日付を扱うの問題に追加します。"
    },
    {
      "indent": 0,
      "text": "2 Structure of Y10K Solution",
      "ja": "Y10Kソリューションの2構造"
    },
    {
      "indent": 3,
      "text": "Any Y10K solution should have the following characteristics.",
      "ja": "どれY10Kソリューションは、次のような特徴を持っている必要があります。"
    },
    {
      "indent": 0,
      "text": "2.1 Compatibility",
      "section_title": true,
      "ja": "2.1の互換性"
    },
    {
      "indent": 3,
      "text": "The format must be compatible with existing 4-digit date formats. Y2K compliant programs and standards must continue to work with Y10K dates before the year 10,000. Y10K compliant programs can gradually be developed over time and coexist with non-Y10K compliant programs.",
      "ja": "フォーマットは、既存の4桁の日付フォーマットと互換性がなければなりません。 Y2Kに準拠したプログラムや基準が年間万の前にY10K日付で動作するように続けなければなりません。 Y10Kに準拠したプログラムは、徐々に時間をかけて開発し、非Y10K対応のプログラムと共存することができます。"
    },
    {
      "indent": 0,
      "text": "2.2 Simplicity and Efficiency",
      "section_title": true,
      "ja": "2.2シンプルさと効率性"
    },
    {
      "indent": 3,
      "text": "Y10K dates must allow dates after 10,000 to be easily identified. Within a program, there must be a simple procedure for recognizing the Y10K dates and distinguishing them from legacy dates.",
      "ja": "Y10K日付は万後の日付を容易に識別できるようにする必要があります。プログラム内では、Y10K日付を認識し、従来の日付からそれらを区別するための簡単な手順がなければなりません。"
    },
    {
      "indent": 0,
      "text": "2.3 Lexical Sorting",
      "section_title": true,
      "ja": "2.3字句ソート"
    },
    {
      "indent": 3,
      "text": "Y10K dates must be sortable lexically based on their ASCII representation. The dates must not require specialized libraries or procedures.",
      "ja": "Y10K日付は、辞書的にそのASCII表現に基づいてソート可能でなければなりません。日付は、特殊なライブラリや手順を必要としない必要があります。"
    },
    {
      "indent": 0,
      "text": "2.4 Future Extensibility",
      "section_title": true,
      "ja": "2.4将来の拡張"
    },
    {
      "indent": 3,
      "text": "Y10K dates must support arbitrary precision dates, and should support dates extending arbitrarily far into the future and past. Y10K dates from different eras and with different precisions must be directly comparable and sortable.",
      "ja": "Y10K日付は任意精度の日付をサポートしなければならない、と未来と過去を任意に遠く拡張日付をサポートする必要があります。異なる時代からと異なる精度を持つY10K日付は直接比較とソート可能でなければなりません。"
    },
    {
      "indent": 0,
      "text": "2.4.1 Environmental Considerations",
      "section_title": true,
      "ja": "2.4.1環境への配慮"
    },
    {
      "indent": 3,
      "text": "The known universe has a finite past and future. The current age of the universe is estimated in [Zebu] as between 10 ** 10 and 2 * 10 ** 10 years. The death of the universe is estimated in [Nigel] to occur in 10 ** 11 - years and in [Drake] as occurring either in 10 ** 12 years for a closed universe (the big crunch) or 10 ** 14 years for an open universe (the heat death of the universe).",
      "ja": "既知の宇宙は有限の過去と未来を持っています。宇宙の現在の年齢は** 10 10 ** 10〜2 * 10年ようにZebu]で推定されます。宇宙の死は10 ** 11で発生する[ナイジェル]で推定された - 起こるよう年[ドレイク]のいずれか閉じ宇宙10 ** 12年（ビッグクランチ）または10 ** 14年オープン宇宙（熱的死）。"
    },
    {
      "indent": 3,
      "text": "In any case, the prevailing belief is that the life of the universe (and thus the range of possible dates) is finite.",
      "ja": "いずれにしても、現行の信念は（したがって、可能な日付の範囲）宇宙の寿命は有限であるということです。"
    },
    {
      "indent": 0,
      "text": "2.4.2 Transcending Environmental Considerations",
      "section_title": true,
      "ja": "2.4.2超越環境配慮"
    },
    {
      "indent": 3,
      "text": "However, we might get lucky. So, Y10K dates are able to represent any possible time without any limits to their range either in the past or future.",
      "ja": "しかし、我々は幸運を得るかもしれません。だから、Y10K日付は、過去または将来のいずれかで、その範囲に任意の制限なしにすべての可能な時間を表現することができます。"
    },
    {
      "indent": 3,
      "text": "Y10K compliant programs MAY choose to limit the range of dates they support to those consistent with the expected life of the universe. Y10K compliant systems MUST accept Y10K dates from 10 ** 12 years in the past to 10 ** 20 years into the future. Y10K compliant systems SHOULD accept dates for at least 10 ** 29 years in the past and future.",
      "ja": "Y10Kに準拠したプログラムは、彼らは宇宙の期待寿命と一貫したものにサポートする日付の範囲を制限することを選択するかもしれません。 Y10Kに準拠したシステムは、将来的に10 ** 20年に過去10 ** 12年からY10K日付を受け入れなければなりません。 Y10Kに準拠したシステムは、過去と未来の少なくとも10 ** 29年間の日付を受け入れる必要があります。"
    },
    {
      "indent": 0,
      "text": "3 Syntax Overview",
      "ja": "3構文の概要"
    },
    {
      "indent": 3,
      "text": "The syntax of Y10K dates consists of simple, printable ASCII characters. The syntax and the characters are chosen to support a simple lexical sort order for dates represented in Y10K format. All Y10K dates MUST conform to these rules.",
      "ja": "Y10K日付の構文は単純で、印刷可能なASCII文字で構成されています。構文と文字がY10K形式で表された日付のための単純な字句ソート順をサポートするために選択されています。すべてのY10K日付は、これらのルールに従わなければなりません。"
    },
    {
      "indent": 3,
      "text": "Every Y10K date MUST begin with a Y10K year. Following the year, there MAY be an arbitrary sequence of digits. The digits are interpreted as MMDDHHMMSSmmmuuunnnpppfff... (month, day, hour, minute, second, milli-second, micro-second, nano-second pico-second, femto-second, etc. - moving left to right in the date, digits always decrease in significance).",
      "ja": "すべてのY10K日はY10K年で開始する必要があります。年に続いて、数字の任意のシーケンスがあるかもしれません。数字は、などMMDDHHMMSSmmmuuunnnpppfff ...（月、日、時、分、秒、ミリ秒、マイクロ秒、ナノ秒ピコ秒、フェムト秒、と解釈されている - 左から右に動かす日付で、数字は常に）重要性の減少します。"
    },
    {
      "indent": 3,
      "text": "All dates and times MUST be relative to International Atomic Time (TAI) [NRAO].",
      "ja": "すべての日付と時刻は、国際原子時（TAI）[NRAO]を基準にする必要があります。"
    },
    {
      "indent": 3,
      "text": "When comparing dates, a date precedes every other date for which it is a prefix. So, the date \"19990401000000\" precedes the date \"19990401000000000\". In particular, dates with the format YYYYMMDD are interpreted to represent the exact instant that the day begins and precede any other date contained in that day.",
      "ja": "日付を比較するとき、日付は、それが接頭語であるため、他のすべての日付の前に。だから、日付が「19990401000000は、」日付「19990401000000000」を先行します。特に、フォーマットYYYYMMDDと日付が一日が始まる正確な瞬間を表し、その日中に含まれる他の任意の日付の前に解釈されます。"
    },
    {
      "indent": 0,
      "text": "3.1 Years 1 - 9999",
      "section_title": true,
      "ja": "3.1年1から9999"
    },
    {
      "indent": 3,
      "text": "The current 4-digit year syntax covers all years from 1000 - 9999. These years are represented as 4 decimal digits. Leading 0's MUST be added to the years before 1000 to bring the year to 4 digits. Files containing legacy pre-Y1K [Mike] dates will have to be converted.",
      "ja": "9999年これらの4桁の10進数で表されます - 現在の4桁の年の構文が1000年からすべての年をカバーしています。先頭の0をする4桁に年持って来るために1000年前に年間に追加する必要があります。レガシー前Y1K [マイク]日付を含むファイルは変換する必要があります。"
    },
    {
      "indent": 0,
      "text": "3.2 Years 10,000 through 99,999",
      "section_title": true,
      "ja": "3.2年間99,999通じ万"
    },
    {
      "indent": 3,
      "text": "Four digits are not sufficient to represent dates beyond the year 9999. So, all years from 10,000 - 99,999 are represented by 5 digits preceded by the letter 'A'. So, 10,000 becomes \"A10000\" and 99,999 becomes \"A99999\". Since 'A' follows '9' in the ASCII ordering, all dates with 5-digit years will follow all dates with 4-digit years (for example, \"A10000\" will sort after \"9999\"). This gives us the sort and comparison behaviour we want.",
      "ja": "4桁だから今年9999を超えて日付を表現するのに十分ではない、万からすべての年 -  99999は、文字「A」が前に5桁の数字で表されます。だから、万が「A10000」になり、99999は、「A99999」となります。 「」ASCII順で「9」を次のので、5桁の年のすべての日付は、（例えば、「A10000」は「9999」の後にソートされます）4桁の年ですべての日付に従います。これは、私たちが望むソートと比較動作を提供します。"
    },
    {
      "indent": 0,
      "text": "3.3 Years 100,000 up to 10 ** 30",
      "section_title": true,
      "ja": "3.3年10 ** 30 100,000"
    },
    {
      "indent": 3,
      "text": "By a simple generalization of 3.2, 6-digit years are preceded by the letter 'B', 7-digit years by 'C', etc. Using just the 26 upper-case ASCII characters, we can cover all years up to 10**30 (the last year representable is \"Z999999999999999999999999999999\"). Again, since the ASCII characters are sorted alphabetically, all dates sort appropriately.",
      "ja": "3.2の簡単な一般化することで、6桁の年はちょうど26大文字のASCII文字を使用するなど、「C」で7桁の年、文字「B」が先行している、我々は* 10までのすべての年をカバーすることができます* 30（昨年の表現は \"Z999999999999999999999999999999\" です）。 ASCII文字はアルファベット順にソートされているので、ここでも、すべてはソート適切にさかのぼります。"
    },
    {
      "indent": 0,
      "text": "3.4 Years 10 ** 30 and beyond (Y10**30)",
      "section_title": true,
      "ja": "3.4年** 30以降10（Y10 ** 30）"
    },
    {
      "indent": 3,
      "text": "As discussed in 2.4.1, the end of the universe is predicted to occur well before the year 10 ** 30. However, if there is one single lesson to be learned from the current Y2K problems, it is that specifications and conventions have a way of out living their expected environment. Therefore we feel it is imperative to completely solve the date representation problem once and for all.",
      "ja": "2.4.1で述べたように、現在のY2K問題から学ぶべき1つの教訓があれば、宇宙の端は、10 ** 30しかし年前にも発生することが予測され、それは仕様や規則が持っているということです彼らの期待される生活環境アウトの方法。そこで我々は、完全に一度、すべての日付表現の問題を解決することが不可欠であると感じています。"
    },
    {
      "indent": 0,
      "text": "3.4.1 Naive Approach for Y10**30 Problem",
      "section_title": true,
      "ja": "3.4.1 Y10のための単純なアプローチ** 30問題"
    },
    {
      "indent": 3,
      "text": "The naive solution is to prepend a single '^' (caret) - caret sorts after all letters in the ASCII order) before all years from 10 ** 30 to 10 ** 56. Thus the year \"Z999999999999999999999999999999\" is followed by the year \"^A1000000000000000000000000000000\". Similarly, all years from 10 ** 56 to 10 ** 82 get one more caret. So, the year \"^Z99999999999999999999999999999999999999999999999999999999\" is followed by the year \"^^A100000000000000000000000000000000000000000000000000000000\". This scheme can be extended indefinitely by prepending one addition caret for each additional factor of 10 ** 26 in the range of the year.",
      "ja": "年に続いて10 ** 30 56 ** 10にこのように毎年「Z999999999999999999999999999999」からASCII順ですべての文字の後にキャレット種類）すべての年前 - ナイーブソリューションは、単一の「^」（キャレット）を前に付加することです\"^ A1000000000000000000000000000000\"。同様に、** 56 10から10 ** 82までのすべての年が1つのよりキャレットを取得します。だから、今年「^ Z99999999999999999999999999999999999999999999999999999999は」年「^^ A100000000000000000000000000000000000000000000000000000000」が続いています。このスキームは、年の範囲の10 ** 26の各追加の因子に対して1つの付加キャレットを付加することにより無限に拡張することができます。"
    },
    {
      "indent": 3,
      "text": "In this approach, the number of digits in a date that are used to represent the year is simply:",
      "ja": "このアプローチでは、年を表すために使用されている日付の桁数は単純です："
    },
    {
      "indent": 6,
      "text": "26 * <number of '^'> + ASCII(<prefix letter>) - ASCII('A') + 5",
      "ja": "26 * + ASCII（<接頭文字>）< '^' の数>  -  ASCII（ 'A'）+ 5"
    },
    {
      "indent": 3,
      "text": "Note: this algorithm is provided for informational purposes only and to show the path leading to the true solution. Y10K dates MUST NOT use this format. They MUST use the format in the next section.",
      "ja": "注：このアルゴリズムは、情報提供のみを目的に提供されており、真の解につながるパスを表示します。 Y10K日付はこのフォーマットを使用してはなりません。彼らは、次のセクションで形式を使用する必要があります。"
    },
    {
      "indent": 0,
      "text": "3.4.2 Space Efficient Approach for Y10**30 Problem",
      "section_title": true,
      "ja": "Y10 ** 30問題の3.4.2のスペース効率的なアプローチ"
    },
    {
      "indent": 3,
      "text": "The solution in 3.4.1 is not a space efficient format for giving the number of digits in the year. The length of the prefix grows linearly in the length of the year (which, itself, grows logarithmically over time). Therefore, Y10K format dates use an improved, more compact encoding of the number of digits in the year.",
      "ja": "3.4.1でのソリューションは、今年の桁数を与えるためのスペース効率的なフォーマットではありません。プレフィックスの長さは（それ自体が、時間の経過とともに対数的に成長し、）年の長さに直線的に成長します。したがって、Y10K形式の日付は年の桁数の改善された、よりコンパクトな符号化を使用します。"
    },
    {
      "indent": 0,
      "text": "3.4.2.1 Years 10 ** 30 to 10 ** 56",
      "section_title": true,
      "ja": "3.4.2.1年10 ** 30 10 ** 56"
    },
    {
      "indent": 3,
      "text": "As in 3.4.1, a single '^' and letter precede the year.",
      "ja": "3.4.1のように、一つの「^」と手紙が一年前に置きます。"
    },
    {
      "indent": 0,
      "text": "3.4.2.2 Years 10 ** 56 to 10 ** 732",
      "section_title": true,
      "ja": "3.4.2.2年10 ** 56から10 ** 732"
    },
    {
      "indent": 3,
      "text": "The year is preceded by two carets (\"^^\") and two letters. The letters create a two digit, base 26 number which is the number of digits in the year minus 57. So, the year \"^Z99999999999999999999999999999999999999999999999999999999\" is followed by the year \"^^AA100000000000000000000000000000000000000000000000000000000\". The last representable year with two carets is the year (10 ** 732) - 1 and is \"^^ZZ999..999\" (i.e. two carets and two Z's, followed by 732 consecutive 9's).",
      "ja": "今年は2つのキャレット（「^^」）と2つの文字が先行しています。手紙は、年「^ Z99999999999999999999999999999999999999999999999999999999は」「^^ AA100000000000000000000000000000000000000000000000000000000を」年が続いているので、今年マイナス57の桁数が2桁、ベース26番号を作成します。 1と「^^ ZZ999..999」である（すなわち、732の連続する9の続く2つのキャレットと2つのZの、） -  2つのキャレットとの最後の表現年年（10 ** 732）です。"
    },
    {
      "indent": 3,
      "text": "The formula for the number of digits in the year is, based on the two digit prefix is:",
      "ja": "今年の桁数のための式は、2桁のプレフィックスに基づいています："
    },
    {
      "indent": 4,
      "text": "26 * (ASCII(<prefix letter1>) - ASCII('A')) + ASCII(<prefix letter2>) - ASCII('A') + 57",
      "ja": "26 *（ASCII（<プレフィックスLETTER1>） -  ASCII（ 'A'））+ ASCII（<プレフィックスLETTER2>） -  ASCII（ 'A'）+ 57"
    },
    {
      "indent": 0,
      "text": "3.4.2.3 Years 10 ** 732 to 10 ** 18308",
      "section_title": true,
      "ja": "3.4.2.3年10 ** 732から10 ** 18308"
    },
    {
      "indent": 3,
      "text": "The next block of years has the number of digits given by three carets (\"^^^\") followed by three letters forming a three-digit, base 26 number. The number of digits in the year is given by the formula:",
      "ja": "年の次のブロックは3桁、ベース26番号を構成する3つの文字に続く3つのキャレット（「^^^」）によって与えられた桁数を有します。今年の桁数は次の式で与えられます。"
    },
    {
      "indent": 4,
      "text": "676 * (ASCII(<prefix letter1>) - ASCII('A')) + 26 * (ASCII(<prefix letter2>) - ASCII('A')) + ASCII(<prefix letter3>) - ASCII('A') + 733",
      "ja": "676 *（ASCII（<プレフィックスLETTER1>） -  ASCII（ 'A'））+ 26 *（ASCII（<プレフィックスLETTER2>） -  ASCII（ 'A'））+ ASCII（<プレフィックスLETTER3>） -  ASCII（ 'A 「）+ 733"
    },
    {
      "indent": 0,
      "text": "3.4.2.4 General Format for Y10K Dates",
      "section_title": true,
      "ja": "Y10K日付のための3.4.2.4一般形式"
    },
    {
      "indent": 3,
      "text": "In general, if there is at least one letter in a Y10K year, the number of the digits in the year portion of the date is given by the formula:",
      "ja": "Y10K年に少なくとも1つの文字が存在する場合、一般的に、日付の年の部分の桁数は、以下の式によって与えられます。"
    },
    {
      "indent": 7,
      "text": "base26(fib(n) letters) + y10k(n)",
      "ja": "base26（FIB（n）の文字）+ Y10K（N）"
    },
    {
      "indent": 3,
      "text": "Where \"n\" is the number of leading carets and the fig, base26 and y10k functions are defined with the following recurrence relations:",
      "ja": "「n」はどこをリードするキャレットの数であり、図、base26とY10Kの機能は以下の漸化式で定義されています。"
    },
    {
      "indent": 6,
      "text": "fib(n) is the standard Fibonacci sequence with:",
      "ja": "FIBは、（N）と、標準的なフィボナッチ数列です。"
    },
    {
      "indent": 6,
      "text": "fib(0) = 1",
      "ja": "繊維（0）= 1"
    },
    {
      "indent": 6,
      "text": "fib(1) = 1",
      "ja": "繊維（1）= 1"
    },
    {
      "indent": 6,
      "text": "fib(n+2) = fib(n) + fib(n+1)",
      "ja": "FIB（N + 2）= FIB（N）+ FIB（N + 1）"
    },
    {
      "indent": 6,
      "text": "base26(m letters) is the base 26 number represented by m letters A-Z:",
      "ja": "base26（m個の文字）は、M文字-Zで表されるベース26の数です。"
    },
    {
      "indent": 6,
      "text": "base26(letter) = ASCII(<letter>) - ASCII('A') base26(string letter) = 26 * base26(string) + base26(letter)",
      "ja": "base26（手紙）= ASCII（<文字>） -  ASCII（ 'A'）base26（文字列の文字）= 26 * base26（文字列）+ base26（手紙）"
    },
    {
      "indent": 6,
      "text": "y10k(n) is the necessary fudge factor to align the sequences",
      "ja": "Y10K（n）は、配列を整列させるために必要なファッジ因子であります"
    },
    {
      "indent": 6,
      "text": "properly:",
      "ja": "正しく："
    },
    {
      "indent": 6,
      "text": "y10k(0) = 5 y10k(n+1) = 26 ** fib(n) + y10k(n)",
      "ja": "Y10K（0）= 5 Y10K（N + 1）= 26 ** FIB（N）+ Y10K（N）"
    },
    {
      "indent": 3,
      "text": "If the year does not have at least one letter in the year, then the number of digits in the year is:",
      "ja": "年が年に少なくとも1つの文字を持っていない場合は、年の桁数は次のとおりです。"
    },
    {
      "indent": 7,
      "text": "4",
      "ja": "４"
    },
    {
      "indent": 3,
      "text": "This year format is space-efficient. The length of the prefix giving number of digits in the year only grows logarithmically with the number of digits in the year. And, the number of carets preceding the prefix only grows logarithmically with the number of digits in the prefix.",
      "ja": "今年形式は、スペース効率です。今年の桁数を与える接頭辞の長さはわずか一年の桁数を対数的に成長します。そして、接頭辞の前のキャレットの数は、プレフィックスの桁数を対数的に成長します。"
    },
    {
      "indent": 0,
      "text": "3.5 B.C.E. (Before Common Era) Years",
      "section_title": true,
      "ja": "3.5 B.C.E.年（西暦前）"
    },
    {
      "indent": 3,
      "text": "Now that have a format for all of the years in the future, we'll take on the \"negative\" years. A negative year is represented in \"Y10K-complement\" form. A Y10K-complement year is computed as follows:",
      "ja": "今では、将来的には年間のすべての形式を持って、私たちは「負」年を取るでしょう。負の年は「Y10K補数」形式で表現されます。次のようにY10K-補数年が計算されます。"
    },
    {
      "indent": 4,
      "text": "1) Calculate the non-negative Y10K year string as in 3.4.2.4. 2) Replace all letters by their base 26 complement. I.E. A -> Z, B -> Y, ... Z -> A. 3) Replace all digits in the year portion of the date by their base 10 complement. I.E. 0 -> 9, 1 -> 8, ... 9 -> 0. 4) Replace carets by exclamation points ('!'). 5) Four-digit years are pre-pended with a slash ('/')",
      "ja": "1）3.4.2.4のように非負Y10K年文字列を計算します。 2）それらのベース26補数ですべての文字を置き換え。即ち - > Z、B  - > Y ... Z  - > A. 3）それらのベース10補数で日付の年の部分におけるすべての数字を交換します。即ち0  - > 9、1  - > 8、... 9  -  '！'> 0.4））、感嘆符（によって脱字記号を交換します。 5）は、4桁の年は、スラッシュ（「/」）で予め保留されています"
    },
    {
      "indent": 4,
      "text": "6) Years that don't now begin with an exclamation point or slash are pre-pended with a star ('*'). (This rule covers the negative 5- 31 digit years).",
      "ja": "6）今、感嘆符やスラッシュで始まらない年はスター（「*」）が事前に保留されています。 （この規則は、負の5- 31桁の年をカバーしてい）。"
    },
    {
      "indent": 3,
      "text": "For example, the year 1 BCE is represented by \"/9998\". The conversion is accomplished by applying rules:",
      "ja": "例えば、年1 BCEは「/ 9998」で表されます。変換は、ルールを適用することによって達成されます。"
    },
    {
      "indent": 4,
      "text": "1) Calculate the non-negative Y10K year (\"1\" -> \"0001\") 2) Complement the digits (\"0001\" -> \"9998\") 3) Four-digit numbers get a leading slash.",
      "ja": "1）非負Y10K年を計算する（ \"1\"  - > \"0001\"）2）（ \"0001\" の数字を補完 - > \"9998\"）3）4桁の番号が先頭のスラッシュを取得します。"
    },
    {
      "indent": 3,
      "text": "The earliest four-digit BCE year (9999 BCE) becomes \"/0000\" and the year before that (10000 BCE) becomes \"*Z89999\". The earliest 5-digit BCE year (99999 BCE) is \"*Z00000\". And the year before that (100000 BCE) is \"*Y899999\". And so on.",
      "ja": "最も初期の4桁のBCE年（9999 BCE）は、 \"/ 0000\" になり、その前年（10000 BCE）は、 \"* Z89999\" になります。最も初期の5桁のBCE年（99999 BCE） \"* Z00000\" です。そして、その前年（100000 BCE）は、 \"* Y899999\" です。等々。"
    },
    {
      "indent": 3,
      "text": "These rules give the desired sort order for BCE dates. For example, the following dates get translated and sorted as: Jun 6, 200 BCE /97990606 199 BCE /9800 Jan 1, 199 BCE /98000101",
      "ja": "これらのルールは、BCE日のために所望のソート順序を与えます。 6月6日、200 BCE / 97990606 199 BCE / 9800 1月1日、199 BCE / 98000101：たとえば、次の日付は次のように翻訳され、並べ替えられます"
    },
    {
      "indent": 0,
      "text": "3.6 Restrictions on Y10K Dates",
      "section_title": true,
      "ja": "Y10K日に3.6制限事項"
    },
    {
      "indent": 3,
      "text": "There are no restrictions on legal values for Y10K dates. Y10K compliant programs MUST accept any syntactically legal Y10K date as a valid date. A '0' can be appended to the end of any Y10K date, yielding an equivalent date that sorts immediately after the original date and represents the instant after the original date.",
      "ja": "Y10K日付の正当な値に制限はありません。 Y10Kに準拠したプログラムは、有効な日付として構文的に法的Y10K日付を受け入れなければなりません。 「0」は、元の日付の直後にソートし、元の日付後の瞬間を表す等価日付を得、任意Y10K日付の末尾に追加することができます。"
    },
    {
      "indent": 3,
      "text": "The following are all valid representations (in sorted order) of the first instant of A10000:",
      "ja": "A10000の最初の瞬間の（ソート順で）すべての有効な表現は次のとおりです。"
    },
    {
      "indent": 5,
      "text": "A1 A10000 A1000001 A100000101000000 A1000001010000000000000000000000",
      "ja": "A1 A10000 A1000001 A100000101000000 A1000001010000000000000000000000"
    },
    {
      "indent": 3,
      "text": "Similarly, the following are all valid Y10K dates (in sorted order) for the time after the last instant of the A99999 and before the first instant of B100000:",
      "ja": "同様に、次は、A99999の最後の瞬間の後とB100000の最初の瞬間までの時間のために、すべての有効なY10K日付（ソート順で）、次のとおりです。"
    },
    {
      "indent": 5,
      "text": "A999991231250000 A999991232 A999992 A9999999999 A99999999990000000000000",
      "ja": "A999991231250000 A999991232 A999992 A9999999999 A99999999990000000000000"
    },
    {
      "indent": 0,
      "text": "4 ABNF",
      "ja": "4 ABNF"
    },
    {
      "indent": 3,
      "text": "The following ABNF [Crocker] gives the formal syntax for Y10K years.",
      "ja": "以下のABNF [クロッカー]はY10K年の正式な構文を提供します。"
    },
    {
      "indent": 3,
      "text": "The initial characters definitions are given in their lexical collation (ASCII) order.",
      "ja": "最初の文字の定義は、その字句照合（ASCII）の順序で与えられています。"
    },
    {
      "indent": 3,
      "text": "exclamation = '!' star = '*' slash = '/' digit = 0 | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9 letter = A | B | C | D | E | F | G | H | I | J | K | L | M |",
      "ja": "感嘆符= '！'スター= '*' スラッシュ= '/' 桁= 0 | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9文字= A | B | C | D | E | F | G | H | I | J | K | L | M |"
    },
    {
      "indent": 3,
      "text": " N | O | P | Q | R | S | T | U | V | W | X | Y | Z caret = '^'",
      "ja": "N | O | P | Q | R | S | T | U | V | W | X | Y | Zキャレット= '^'"
    },
    {
      "indent": 3,
      "text": "year = [*(caret | exclamation) | star | slash ] [ *letter ] *digit month = 2digit day = 2digit hour = 2digit minute = 2digit second = 2digit fraction = *digit date = year [ month [ day [ hour [ minute [ second [ fraction ]]]]]]",
      "ja": "年= [*（キャレット|エクスクラメーション）|星|スラッシュ] [*レター] *桁の月= 2桁の日= 2桁時間= 2桁分= 2桁秒= 2桁割合= *桁の日付=年[月[日[時間[分[秒[分数]]]]]]"
    },
    {
      "indent": 0,
      "text": "5 Open Issues",
      "ja": "5点の未解決の問題"
    },
    {
      "indent": 3,
      "text": "There are a number date comparison problems that are beyond the scope of this specification.",
      "ja": "この仕様の範囲を超えて数日比較の問題があります。"
    },
    {
      "indent": 3,
      "text": "1) Dates from different calendar systems can not be directly compared. For instance, dates from the Aztec, Bhuddist, Jewish, Muslim, and Hittite calendars must be converted to a common calendar before comparisons are possible.",
      "ja": "1）異なるカレンダーシステムから日付を直接比較することはできません。比較が可能になる前に例えば、アステカ、Bhuddist、ユダヤ教、イスラム教、およびヒッタイトカレンダーから日付は、共通のカレンダーに変換する必要があります。"
    },
    {
      "indent": 3,
      "text": "2) Future re-numberings of years are not covered. If, and when, a new \"Year 0\" occurs and comes into general use, old dates will have to be adjusted.",
      "ja": "2）年の今後の再番号付けがカバーされていません。もし、新たな「年0」が発生し、一般的な使用になると、古い日付を調整する必要があります。"
    },
    {
      "indent": 3,
      "text": "3) Continued existence of Earth-centric time periods (year, day, etc.) are problematical past the up-coming destruction of the solar system (5-10 billion years or so). The use of atomic-time helps some since leap seconds are no longer an issue.",
      "ja": "3）地球中心の期間（年、日、など）の継続的な存在は）ソーラーシステム（5〜10億年かそこらのアップ来破壊過去の問題としています。アトミック・時間の使用はうるう秒以来のいくつかは、もはや問題で助けません。"
    },
    {
      "indent": 3,
      "text": "4) Future standards and methods of synchronization for inter-planetary and inter-galactic time have not been agreed to.",
      "ja": "4）間の惑星とインター銀河の時間の同期の未来基準や方法が合意されていません。"
    },
    {
      "indent": 3,
      "text": "5) Survivability of dates past the end of the universe is uncertain.",
      "ja": "5）宇宙の果て過去の日付の生存は不明です。"
    },
    {
      "indent": 0,
      "text": "6 Affected Standards",
      "ja": "6つの影響を受ける規格"
    },
    {
      "indent": 3,
      "text": "A number of standards currently and RFCs use 4-digit years and are affected by this proposal:",
      "ja": "現在の規格およびRFCの数は、4桁の年を使用して、この提案によって影響を受けます。"
    },
    {
      "indent": 5,
      "text": "rfc2459: Internet X.509 Public Key Infrastructure Certificate and CRL Profile rfc2326: Real Time Streaming Protocol (RTSP) rfc2311: ODETTE File Transfer Protocol rfc2280: Routing Policy Specification Language (RPSL) rfc2259: Simple Nomenclator Query Protocol (SNQP) rfc2244: ACAP -- Application Configuration Access Protocol rfc2167: Referral Whois (RWhois) Protocol V1.5 rfc2065: Domain Name System Security Extensions rfc2060: Internet Message Access Protocol - Version 4rev1 rfc1922: Chinese Character Encoding for Internet Messages rfc1912: Common DNS Operational and Configuration Errors rfc1903: Textual Conventions for Version 2 of the Simple Network Management Protocol (SNMPv2) rfc1521: MIME (Multipurpose Internet Mail Extensions) Part One:",
      "ja": "RFC2459：インターネットX.509公開鍵基盤証明書とCRLプロフィールRFC2326：リアルタイムストリーミングプロトコル（RTSP）rfc2311：ODETTEファイル転送プロトコルrfc2280：ルーティングポリシー仕様言語（RPSL）rfc2259：シンプルNomenclatorクエリプロトコル（SNQP）rfc2244：ACAP  -  - アプリケーション設定アクセスプロトコルrfc2167：紹介のWhois（RWhois）プロトコルV1.5のRFC2065：ドメインネームシステムセキュリティ拡張のRFC2060：インターネットメッセージアクセスプロトコル - バージョン4rev1 rfc1922：一般的なDNS運用および設定エラーRFC1903：インターネットメッセージrfc1912のための中国の文字エンコード：簡易ネットワーク管理プロトコル（SNMPv2の）RFC1521のバージョン2のためのテキストの表記法：MIME（多目的インターネットメール拡張）第一部："
    },
    {
      "indent": 5,
      "text": "rfc1123: Requirements for Internet hosts - application and support",
      "ja": "RFC1123：インターネットホストのための要件 - アプリケーションとサポート"
    },
    {
      "indent": 3,
      "text": "The following standards internally represent years as 16-bit numbers (0..65536) and are affected by this proposal:",
      "ja": "次の規格は、内部16ビットの数値（0 65536）として年を代表し、この提案によって影響を受けます。"
    },
    {
      "indent": 5,
      "text": "rfc2021: Remote Network Monitoring Management Information Base Version 2 using SMIv2 rfc1514: Host Resources MIB",
      "ja": "RFC2021：リモートネットワーク監視管理情報ベースバージョン2のSMIv2のRFC1514を使用して：リソースMIBホスト"
    },
    {
      "indent": 3,
      "text": "The following ISO standard is affected: ISO8601: International Date Format",
      "ja": "以下のISO規格は影響を受けている：ISO8601：国際日付形式を"
    },
    {
      "indent": 0,
      "text": "8 Security Considerations",
      "ja": "8セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "Y10K dates will improve the security of all programs where they are used. Many errors in programs have been tracked to overflow while parsing illegal input. Programs allocating fixed size storage for dates will exhibit errors when presented with larger dates. These errors can be exploited by wily hackers to compromise the security of systems running these programs. Since Y10K dates are arbitrary length strings, there is no way to make them overflow.",
      "ja": "Y10K日付は、彼らが使用されているすべてのプログラムのセキュリティを向上します。違法な入力を解析中にプログラムで多くのエラーは、オーバーフローに追跡されています。大きな日付を提示するときの日付の固定サイズのストレージを割り当てるプログラムは、エラーを示すであろう。これらのエラーは、これらのプログラムを実行しているシステムのセキュリティを侵害する狡猾なハッカーによって悪用される可能性があります。 Y10K日付は、任意の長さの文字列であるので、それらをオーバーフローさせる方法はありません。"
    },
    {
      "indent": 3,
      "text": "In addition, positive Y10K dates are easy to compare and less error-prone for humans. It is easier to compare the three projected end of the universe dates - \"H100000000000\", \"I1000000000000\" and \"K100000000000000\" - by looking at the leading letter than by counting the 0's. This will reduce inadvertent errors by people. This advantage will become more noticeable when large dates are more common.",
      "ja": "また、正Y10K日付は、人間のために比較し、より少ないエラーが発生しやすいのは簡単です。 「H100000000000」、「I1000000000000」と「K100000000000000」 -   -  0をカウントすることにより、より有数の文字を見て、3つの投影宇宙日の終わりを比較することが容易です。これは、人々によって不注意によるエラーを低減します。大きな日付がより一般的であるとき、この利点はより顕著になります。"
    },
    {
      "indent": 3,
      "text": "Unfortunately, negative Y10K dates are a bit more difficult to decipher. However, by comparing the current age of the universe to its projected end, it is obvious that there will be many more positive dates than negative dates. And, while the number of negative dates for human history is currently greater than the number of positive dates, the number of negative dates is fixed and the number of positive dates is unbounded.",
      "ja": "残念ながら、負Y10K日付は、もう少し難しい解読されています。しかし、その突出端に宇宙の現在の年齢を比較することで、負の日付よりも多くの正の日付があるだろうことは明らかです。人類の歴史のための負の日付の数は現在、正の日付の数よりも大きいしながら、負の日付の数が固定され、正の日付の数は無制限です。"
    },
    {
      "indent": 0,
      "text": "9 Conclusion",
      "ja": "9おわり"
    },
    {
      "indent": 3,
      "text": "It is not too early to aggressively pursue solutions for the Y10K problem. This specification presents a simple, elegant, and efficient solution to this problem.",
      "ja": "積極的にY10K問題の解決策を追求するのは時期尚早ではありません。この仕様はこの問題に対して、シンプルでエレガントな、そして効率的なソリューションを提供します。"
    },
    {
      "indent": 0,
      "text": "10 References",
      "ja": "10本の参考文献"
    },
    {
      "indent": 3,
      "text": "[Crocker] Crocker, D. and P. Overell, \"Augmented BNF for Syntax Specifications: ABNF\", RFC 2234, November 1997.",
      "ja": "[クロッカー]クロッカー、D.、およびP. Overell、 \"構文仕様のための増大しているBNF：ABNF\"、RFC 2234、1997年11月。"
    },
    {
      "indent": 3,
      "text": "[Drake] Review for the Drake Equation http://www.umsl.edu/~bwilking/assign/drake.html",
      "ja": "ドレイク方程式について[ドレイク]レビューhttp://www.umsl.edu/~bwilking/assign/drake.html"
    },
    {
      "indent": 3,
      "text": "[Microsoft] SNMP SysUpTime Counter Resets After 49.7 Days http://support.microsoft.com/support/kb/articles/Q169/ 8/47.asp",
      "ja": "[Microsoft]のSNMPのsysUpTimeカウンターリセット49.7日後にhttp://support.microsoft.com/support/kb/articles/Q169/ 8 / 47.asp"
    },
    {
      "indent": 3,
      "text": "[Mike] Y1K http://lonestar.texas.net/~mdlvas/y1k.htm",
      "ja": "[マイク] Y1K http://lonestar.texas.net/~mdlvas/y1k.htm"
    },
    {
      "indent": 3,
      "text": "[Nigel] Nigel's (en)lighening tour of Thermodynamics for Economists ;-) http://www.santafe.edu/~nigel/thermo-primer.html",
      "ja": "[ナイジェル]ナイジェルさん（JA）エコノミストのための熱力学のツアーをlighening ;-) http://www.santafe.edu/~nigel/thermo-primer.html"
    },
    {
      "indent": 3,
      "text": "[NRAO] Astronomical Times http://sadira.gb.nrao.edu/~rfisher/Ephemerides/times.html",
      "ja": "[NRAO]天文タイムズhttp://sadira.gb.nrao.edu/~rfisher/Ephemerides/times.html"
    },
    {
      "indent": 3,
      "text": "[RFC] Here are all the online RFCs. Note: this is a LONG menu. http://info.internet.isi.edu/1s/in-notes/rfc/files",
      "ja": "[RFC]ここでは、すべてのオンラインのRFCです。注意：これはLONG​​メニューです。 http://info.internet.isi.edu/1s/in-notes/rfc/files"
    },
    {
      "indent": 3,
      "text": "[UNIX] Year 2000 Issues http://www.rdrop.com/users/caf/y2k.html",
      "ja": "[UNIX] 2000年問題http://www.rdrop.com/users/caf/y2k.html"
    },
    {
      "indent": 3,
      "text": "[Wilborne] PktCDateLig http://www3.gamewood.net/mew3/pilot/pocketc/pktcdate/ index.html",
      "ja": "【Wilborne] PktCDateLig http://www3.gamewood.net/mew3/pilot/pocketc/pktcdate/のindex.html"
    },
    {
      "indent": 3,
      "text": "[YUCK] Y10K Unlimited Consulting Knowledgebase http://www.loyd.net/y10k/index.html",
      "ja": "[YUCK] Y10K無制限コンサルティングナレッジhttp://www.loyd.net/y10k/index.html"
    },
    {
      "indent": 3,
      "text": "[Zebu] The Search for H0 http://zebu.uoregon.edu/1997/ph410/l6.html",
      "ja": "【にZebu] H0 http://zebu.uoregon.edu/1997/ph410/l6.html検索します"
    },
    {
      "indent": 0,
      "text": "11 Authors' Addresses",
      "ja": "11本の著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Steve Glassman Compaq Systems Research Center 130 Lytton Avenue Palo Alto, CA 94301 USA",
      "ja": "スティーブ・グラスマンのCompaqシステム研究センター130リットンアベニューパロアルト、CA 94301 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 650-853-2166 EMail: steveg@pa.dec.com",
      "ja": "電話：+1 650-853-2166電子メール：steveg@pa.dec.com"
    },
    {
      "indent": 3,
      "text": "Mark Manasse Compaq Systems Research Center 130 Lytton Avenue Palo Alto, CA 94301 USA",
      "ja": "マークManasseコンパックシステム研究センター130リットンアベニューパロアルト、CA 94301 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 650-853-2221 EMail: msm@pa.dec.com",
      "ja": "電話：+1 650-853-2221電子メール：msm@pa.dec.com"
    },
    {
      "indent": 3,
      "text": "Jeff Mogul Compaq Western Resarch Lab 250 University Avenue Palo Alto, CA 94301 USA",
      "ja": "ジェフ・モーグルのCompaq西研究所250大学アベニューパロアルト、CA 94301 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 650-617-3300 EMail: mogul@pa.dec.com",
      "ja": "電話：+1 650-617-3300電子メール：mogul@pa.dec.com"
    },
    {
      "indent": 0,
      "text": "12. Full Copyright Statement",
      "section_title": true,
      "ja": "12.完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1999). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1999）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    }
  ]
}