{
  "title": {
    "text": "RFC 3615 - A Uniform Resource Name (URN) Namespace for SWIFT Financial Messaging",
    "ja": "RFC 3615 - SWIFT金融メッセージングのための統一リソース名（URN）名前空間"
  },
  "number": 3615,
  "created_at": "2019-10-20 05:50:42.259414+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                          J. Gustin\nRequest for Comments: 3615                                     A. Goyens\nCategory: Informational                                            SWIFT\n                                                          September 2003",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 16,
      "text": "A Uniform Resource Name (URN) Namespace\n     for SWIFT Financial Messaging",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモはインターネットコミュニティのための情報を提供します。それはどんな種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2003）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document describes a Uniform Resource Name (URN) namespace that is managed by SWIFT for usage within messages standardized by SWIFT.",
      "ja": "このドキュメントは、SWIFTによって標準化されたメッセージ内で使用するためにSWIFTにより管理されている統一リソース名（URN）名前空間について説明します。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "SWIFT is an industry-owned cooperative supplying secure, standardised messaging services and interface software to over 7,500 financial institutions in 199 countries. The SWIFT community includes banks, broker/dealers and investment managers, as well as their market infrastructures in payments, securities, treasury and trade.",
      "ja": "SWIFTは、199カ国に7,500以上の金融機関に安全な、標準化されたメッセージングサービスおよびインタフェース・ソフトウェアを供給業界所有の協同組合です。 SWIFTコミュニティは支払の銀行、ブローカー/ディーラー、投資マネジャー、並びにそれらの市場インフラ、証券、財務省との貿易が含まれています。"
    },
    {
      "indent": 3,
      "text": "The goal of this namespace is to ensure the stability and uniqueness of the names of various items that are used within the messages exchanged between financial institutions. SWIFT is one of the principal standardization bodies for financial messages and services. This standardization process identifies the structure and meaning of messages exchanged for various financial services offered by financial institutions. It is essential that names of items (such as the XML schema describing the message itself) can be used to identify the resource even years after the message has been exchanged.",
      "ja": "この名前空間の目標は、金融機関の間で交換されるメッセージ内で使用される様々なアイテムの名前の安定性と独自性を確保することです。 SWIFTは、金融メッセージやサービスのための主要な標準化団体の一つです。この標準化プロセスは、金融機関が提供する様々な金融サービスのために交換されるメッセージの構造と意味を示しています。 （例えば、メッセージ自体を記述したXMLスキーマなど）の項目の名前は、メッセージが交換されても数年後にリソースを識別するために使用できることが必須です。"
    },
    {
      "indent": 3,
      "text": "The same resource may exist in multiple physical locations, and thus multiple URL's, but only a single URN.",
      "ja": "同じリソースは複数の物理的な場所に存在するため、複数のURLのが、唯一つのURNがあります。"
    },
    {
      "indent": 0,
      "text": "2. Specification Template",
      "section_title": true,
      "ja": "2.仕様のテンプレート"
    },
    {
      "indent": 3,
      "text": "Namespace ID:",
      "ja": "名前空間ID："
    },
    {
      "indent": 6,
      "text": "\"swift\"",
      "ja": "\"迅速\""
    },
    {
      "indent": 3,
      "text": "Registration Information:",
      "ja": "登録情報："
    },
    {
      "indent": 6,
      "text": "Version 1 Date: 2001-08-01",
      "ja": "バージョン1日：2001-08-01"
    },
    {
      "indent": 3,
      "text": "Declared registrant of the namespace:",
      "ja": "名前空間の宣言された登録者："
    },
    {
      "indent": 10,
      "text": "SWIFT s.c.r.l.\nAvenue Adele 1\nB-1310 La Hulpe\nBelgium",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Declaration of syntactic structures:",
      "ja": "構文構造の宣言："
    },
    {
      "indent": 6,
      "text": "The structure of the Namespace Specific String is a flat space <URN chars> [1] which have no knowable structure outside of the context of the SWIFT community internal resolver. Future changes to the assignment methods may allow others to assign sub-spaces of the flat namespace but again, this knowledge is only valid internally and should never be inferred or relied upon externally.",
      "ja": "ネームスペース固有の文字列の構造は、平坦な空間<URNの文字> [1] SWIFTコミュニティ内部レゾルバのコンテキストの外では知り得る構造を有していないいます。割り当て方法の将来の変更は、フラットな名前空間のサブスペースを割り当てるために他人を許すかもしれないが、もう一度、この知識は、内部でのみ有効で、外部時に推測されない、または信頼できないはずです。"
    },
    {
      "indent": 3,
      "text": "Relevant ancillary Documentation:",
      "ja": "関連の補助ドキュメント："
    },
    {
      "indent": 6,
      "text": "None",
      "ja": "無し"
    },
    {
      "indent": 3,
      "text": "Identifier uniqueness considerations:",
      "ja": "識別子一意性の考慮事項："
    },
    {
      "indent": 6,
      "text": "Identifiers are assigned by SWIFT URN Registration that guarantees uniqueness. This is simply achieved by keeping track of already assigned names and comparing all new proposed names to the database ones. If the name already exists a new one has to be proposed.",
      "ja": "識別子は、一意性を保証SWIFT URN登録によって割り当てられます。これは単純に、すでに割り当てられた名前を追跡すると、データベースのものにすべての新しい提案名を比較することによって達成されます。名前がすでに存在する場合は、新しいものを提案する必要があります。"
    },
    {
      "indent": 3,
      "text": "Identifiers persistence considerations:",
      "ja": "識別子は配慮を永続性："
    },
    {
      "indent": 6,
      "text": "The assignment process guarantees that names are not reassigned. In any case SWIFT URNs are guaranteed to remain valid for 15 years.",
      "ja": "割り当てプロセスは、名前が再割り当てされていないことを保証します。いずれの場合もSWIFTのURNは15年間有効のままに保証されています。"
    },
    {
      "indent": 3,
      "text": "Process of identifiers assignment:",
      "ja": "識別子の割り当てのプロセス："
    },
    {
      "indent": 6,
      "text": "Names are granted via SWIFT proprietary registration procedures.",
      "ja": "名前はSWIFT独自の登録手続きを経て付与されます。"
    },
    {
      "indent": 3,
      "text": "Process for identifier resolution:",
      "ja": "識別子の解決のためのプロセス。"
    },
    {
      "indent": 6,
      "text": "SWIFT URNs are resolved via URN resolvers run under SWIFT responsibility.",
      "ja": "SWIFTのURNは、SWIFTの責任の下で実行URNレゾルバを経て解決されます。"
    },
    {
      "indent": 3,
      "text": "Rules for lexical equivalence:",
      "ja": "字句等価のルール："
    },
    {
      "indent": 6,
      "text": "No special consideration.",
      "ja": "特別な考慮事項はありません。"
    },
    {
      "indent": 3,
      "text": "Conformance with URN syntax:",
      "ja": "URN構文に準拠："
    },
    {
      "indent": 6,
      "text": "No special consideration.",
      "ja": "特別な考慮事項はありません。"
    },
    {
      "indent": 3,
      "text": "Validation mechanism:",
      "ja": "検証メカニズム："
    },
    {
      "indent": 6,
      "text": "None specified.",
      "ja": "いずれも指定されていません。"
    },
    {
      "indent": 3,
      "text": "Scope:",
      "ja": "範囲："
    },
    {
      "indent": 6,
      "text": "This namespace is reserved to the global financial community.",
      "ja": "この名前空間は、グローバルな金融コミュニティに予約されています。"
    },
    {
      "indent": 0,
      "text": "3. Examples",
      "section_title": true,
      "ja": "3.例"
    },
    {
      "indent": 3,
      "text": "The following examples are not guaranteed to be real. They are listed for pedagogical reasons only.",
      "ja": "次の例では、本当のことが保証されていません。彼らは唯一の教育的な理由のために記載されています。"
    },
    {
      "indent": 6,
      "text": "urn:swift:xsd:epp$mi.i-2.0 urn:swift:type:fin$103",
      "ja": "URN：SWIFT：のxsd：EPP $ mi.i-2.0のurn：SWIFT：タイプ：フィン$ 103"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "Since the URNs in this namespace are opaque there are no additional security considerations other than those normally associated with the use and resolution of URNs in general.",
      "ja": "この名前空間内のURNが不透明であるので、通常は一般的なのURNの使用と解決に関連づけられたもの以外の追加のセキュリティの考慮事項はありません。"
    },
    {
      "indent": 3,
      "text": "It is noted however that attempting to resolve a SWIFT URN through a resolver other than the one provided by SWIFT is error prone. In any case, it is not considered authoritative.",
      "ja": "SWIFTが提供するもの以外のリゾルバを通じてSWIFT URNを解決しようとすると、エラーが発生しやすくなりますしかしことに留意されたいです。いずれにせよ、それは権威と見なされていません。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "ja": "5. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "The IANA has registered formal URN namespace 15, to SWIFT within the IANA registry of URN NIDs.",
      "ja": "IANAはURNのNIDのIANAレジストリ内SWIFTに、正式なURN名前空間15が登録されています。"
    },
    {
      "indent": 0,
      "text": "6. Normative References",
      "section_title": true,
      "ja": "6.引用規格"
    },
    {
      "indent": 3,
      "text": "[1] Moats, R., \"URN Syntax\", RFC 2141, May 1997.",
      "ja": "[1]堀、R.、 \"URN構文\"、RFC 2141、1997年5月を。"
    },
    {
      "indent": 3,
      "text": "[2] Daigle, L., van Gulik, D., Iannella, R. and P. Faltstrom, \"Uniform Resource Name (URN) Namespace Definition Mechanisms\", BCP 66, RFC 3406, October 2002.",
      "ja": "[2] Daigle氏、L.、バンGulik、D.、Iannella、R.とP. Faltstrom、 \"URN（Uniform Resource Name）の名前空間定義メカニズム\"、BCP 66、RFC 3406、2002年10月。"
    },
    {
      "indent": 0,
      "text": "7. Authors' Addresses",
      "section_title": true,
      "ja": "7.著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Jean-Marc Gustin SWIFT s.c.r.l. Avenue Adele, 1 B1310 La Hulpe Belgium",
      "ja": "ジャンマルクGustin SWIFT s.c.r.l.アベニューアデル、1 B1310ラユルプベルギー"
    },
    {
      "indent": 3,
      "text": "EMail: jean-marc.gustin@swift.com",
      "ja": "メールアドレス：jean-marc.gustin@swift.com"
    },
    {
      "indent": 3,
      "text": "Andre Goyens SWIFT s.c.r.l. Avenue Adele, 1 B1310 La Hulpe Belgium",
      "ja": "アンドレGoyens SWIFT s.c.r.l.アベニューアデル、1 B1310ラユルプベルギー"
    },
    {
      "indent": 3,
      "text": "EMail: andre.goyens@swift.com URI: http://www.swift.com",
      "ja": "電子メール：andre.goyens@swift.com URI：http://www.swift.com"
    },
    {
      "indent": 0,
      "text": "8. Full Copyright Statement",
      "section_title": true,
      "ja": "8.完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2003）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assignees.",
      "ja": "上記の制限は永続的なものであり、インターネットソサエティもしくはその継承者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "了承"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}