{
  "title": {
    "text": "RFC 8023 - Report from the Workshop and Prize on Root Causes and Mitigation of Name Collisions",
    "ja": "RFC 8023 - ワークショップからの報告と根本原因と名前衝突の緩和に関する賞"
  },
  "number": 8023,
  "created_at": "2019-10-19 22:52:35.391497+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Independent Submission                                         M. Thomas\nRequest for Comments: 8023\nCategory: Informational                                        A. Mankin\nISSN: 2070-1721                                               Salesforce\n                                                                L. Zhang\n                                                                    UCLA\n                                                           November 2016",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 13,
      "text": "    Report from the Workshop and Prize on\nRoot Causes and Mitigation of Name Collisions",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document provides context and a report on the workshop on \"Root Causes and Mitigation of Name Collisions\", which took place in London, United Kingdom, from March 8 to 10, 2014. The main goal of the workshop was to foster a discussion on the causes and potential mitigations of domain name collisions. This report provides a small amount of background and context; then, it provides a summary of the workshop's discussions.",
      "ja": "このドキュメントは、2014年3月8日から10日にイギリスのロンドンで開催された「名前の衝突の根本原因と緩和」に関するワークショップの背景とレポートを提供します。ワークショップの主な目標は、 ドメイン名の衝突の原因と潜在的な軽減策。 このレポートは、少量の背景とコンテキストを提供します。 次に、ワークショップの議論の要約を提供します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントは、インターネット標準化過程の仕様ではありません。 情報提供の目的で公開されています。"
    },
    {
      "indent": 3,
      "text": "This is a contribution to the RFC Series, independently of any other RFC stream. The RFC Editor has chosen to publish this document at its discretion and makes no statement about its value for implementation or deployment. Documents approved for publication by the RFC Editor are not a candidate for any level of Internet Standard; see Section 2 of RFC 7841.",
      "ja": "これは、他のRFCストリームとは無関係に、RFCシリーズへの貢献です。 RFCエディターは、この文書をその裁量で公開することを選択しており、実装または展開の価値については何も表明していません。 RFCエディターによる公開が承認されたドキュメントは、どのレベルのインターネット標準の候補でもありません。 RFC 7841のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc8023.",
      "ja": "このドキュメントの現在のステータス、エラータ、およびフィードバックの提供方法に関する情報は、http：//www.rfc-editor.org/info/rfc8023で入手できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2016 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2016 IETF Trustおよび文書の著者として特定された人物。 全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document.",
      "ja": "この文書は、この文書の発行日に有効なBCP 78およびIETFトラストのIETF文書に関する法的条項（http://trustee.ietf.org/license-info）の対象となります。 これらのドキュメントは、このドキュメントに関するあなたの権利と制限を説明しているので、注意深く確認してください。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Background and Context ..........................................4\n   2.1. Brief Update ...............................................6\n3. Workshop Structure ..............................................7\n   3.1. Research Findings ..........................................8\n   3.2. System Analysis ............................................9\n   3.3. Frameworks: Modeling, Analysis, and  Mitigation ............9\n   3.4. Conclusions and Next Steps ................................11\n4. Security Considerations ........................................11\n5. Informative References .........................................12\nAppendix A. Program Committee .....................................16\nAppendix B. Workshop Material .....................................16\nAppendix C. Workshop Participants .................................17\nAcknowledgments ...................................................17\nAuthors' Addresses ................................................17",
      "raw": true,
      "ja": "1.はじめに2.背景とコンテキスト    2.1。 簡単な更新3.ワークショップの構造    3.1。 研究結果    3.2。 システム分析    3.3。 フレームワーク：モデリング、分析、および軽減    3.4。 結論と次のステップ4.セキュリティに関する考慮事項5.参考情報付録A.プログラム委員会付録B.ワークショップ資料付録C.ワークショップ参加者謝辞著者のアドレス"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "It has been well known within the Internet research and engineering community that many installed systems in the Internet query the domain name system (DNS) root for names under a wide range of top-level domains (TLDs). Many of these TLDs are not delegated, which results in a response indicating that the name queried does not exist (commonly called an NXDOMAIN response [RFC7719]). In the Internet Corporation for Assigned Names and Numbers (ICANN) community, it was observed as early as November 2010 by the Security and Stability Advisory Committee (SSAC) report [SAC045] that the addition of new TLDs in the DNS root could result in so-called name collisions for names used in environments other than the global Internet. Some installed systems, following established (albeit not vetted) operational practices, generate queries to the global DNS with name suffixes that, under seemingly reasonable assumptions at the time the systems were designed or configured, were not expected to be delegated as TLDs. Many of these installed systems depend explicitly or implicitly on the indication from the global DNS that the domain name suffix does not exist. After a new TLD is delegated, the global DNS may give a different response to the query involving the TLD than it did prior to the TLD's delegation.",
      "ja": "インターネットにインストールされている多くのシステムが、さまざまなトップレベルドメイン（TLD）の下のドメインネームシステム（DNS）ルートに対してクエリを実行することは、インターネット調査およびエンジニアリングコミュニティでよく知られています。これらのTLDの多くは委任されていないため、照会された名前が存在しないことを示す応答（一般にNXDOMAIN応答[RFC7719]と呼ばれます）になります。割り当てられた名前と番号のためのInternet Corporation（ICANN）コミュニティでは、2010年11月には、セキュリティおよび安定性諮問委員会（SSAC）レポート[SAC045]によって、DNSルートに新しいTLDを追加すると、 -グローバルインターネット以外の環境で使用される名前の名前の衝突と呼ばれます。一部のインストール済みシステムは、確立された（吟味されていない）運用慣行に従って、システムが設計または構成された時点で一見合理的な仮定のもとでTLDとして委任されることは想定されていなかった名前サフィックスを持つグローバルDNSへのクエリを生成します。これらのインストール済みシステムの多くは、ドメイン名サフィックスが存在しないというグローバルDNSからの指示に明示的または暗黙的に依存しています。新しいTLDが委任された後、グローバルDNSは、TLDを委任する前とは異なる応答をTLDに関係するクエリに与える場合があります。"
    },
    {
      "indent": 3,
      "text": "A name collision occurs when an attempt to resolve a name used in a private namespace results in a query to the public DNS, and the response indicates that the name is in the global DNS [NCRI]. In other words, the overlap of public and private namespaces may result in potential unintended (and, therefore, potentially harmful) resolution results. The impact of the global change on installed systems will be varied; risks to installed systems introduced by name collisions may arise due to varied causes.",
      "ja": "プライベートネームスペースで使用されている名前を解決しようとするとパブリックDNSへのクエリが行われ、名前がグローバルDNS [NCRI]にあることが応答で示されると、名前の衝突が発生します。 つまり、パブリック名前空間とプライベート名前空間の重複により、意図しない（したがって、潜在的に有害な）解決結果が生じる可能性があります。 インストールされたシステムに対するグローバルな変更の影響はさまざまです。 さまざまな原因により、名前の衝突によって導入されたシステムにリスクが生じる可能性があります。"
    },
    {
      "indent": 3,
      "text": "In a globally distributed system, such as the Internet, it is difficult, yet critical, to agree on policies for demarking boundaries of ownership and autonomy. Name space governance is critical to ensure predictable use of names in the global DNS.",
      "ja": "インターネットなどのグローバルに分散したシステムでは、所有権と自律性の境界を定めるためのポリシーに同意することは困難ですが、重要です。 名前空間のガバナンスは、グローバルDNSで予測可能な名前の使用を保証するために重要です。"
    },
    {
      "indent": 3,
      "text": "In order to help ensure this uniqueness and interoperability, ICANN, through its coordination of the IANA functions, is responsible for administration of certain responsibilities associated with Internet DNS root zone management, such as generic and country code Top-Level Domains (gTLDs and ccTLDs). Prior to ICANN's creation in 1998, seven generic TLDs were defined in the early development of the Internet [RFC1591]. Since the formation of ICANN, the delegations of generic, internationalized and country code TLDs have been administered and delegated by ICANN. During these delegations, it quickly became apparent within the IETF community that there was a need to reserve name spaces that can be used for creating limited sets of internal names without fear of conflicts with current or future TLD name spaces in the global DNS [RFC2606].",
      "ja": "この一意性と相互運用性を確保するために、ICANNは、IANA機能の調整を通じて、汎用および国コードトップレベルドメイン（gTLDおよびccTLD）など、インターネットDNSルートゾーン管理に関連する特定の責任の管理を担当します 。 1998年にICANNが作成される前は、インターネットの初期開発で7つの汎用TLDが定義されていました[RFC1591]。 ICANNの設立以来、ジェネリック、国際化、国コードTLDの代表団はICANNによって管理および委任されてきました。 これらの委任中に、IETFコミュニティ内で、グローバルDNSの現在または将来のTLD名前空間との競合を恐れることなく、限られた内部名のセットを作成するために使用できる名前空間を予約する必要があることがすぐに明らかになりました[RFC2606] 。"
    },
    {
      "indent": 3,
      "text": "While the reserved TLDs [RFC2606] aimed to enable operators to use them only as a small set of reserved names internally, with limited uses, educational awareness and operational best practices did not achieve the goal of reserving special-use domain names [RFC6761]; other suffixes, not reserved though at the time not in conflict, were often employed instead. Faulty assumptions, or encouragement in some cases by vendor documentation, of \"we only use this name internally and there is no possibility of leakage to the global DNS\" were made by numerous operators or administrators. Numerous reports and findings have clearly disproved these faulty assumptions by showing substantial \"DNS leakage\" into the global DNS through mechanisms such as search lists.",
      "ja": "予約済みのTLD [RFC2606]は、限られた用途で、オペレーターがそれらを内部的に予約済みの小さな名前セットとしてのみ使用できるようにすることを目的としていました。 当時は競合していなかったが予約されていない他の接尾辞が代わりにしばしば使われた。 「この名前は内部でのみ使用し、グローバルDNSに漏洩する可能性はありません」という誤った仮定、またはベンダーのドキュメントによる励ましが、多数のオペレーターまたは管理者によって行われました。 多数のレポートと調査結果は、検索リストなどのメカニズムを介してグローバルDNSへの実質的な「DNSリーク」を示すことにより、これらの誤った仮定を明らかに反証しました。"
    },
    {
      "indent": 3,
      "text": "In 2012, ICANN created a new gTLD program to add a potentially unlimited number of new gTLDs to the root zone as a mechanism to enhance competition, innovation, and consumer choice. With the potential of many new gTLDs becoming delegated in the global DNS, operators or administrators who elected to use a non-delegated name space internally may face potential \"name collision\" problems.",
      "ja": "2012年、ICANNは新しいgTLDプログラムを作成し、潜在的に無制限の数の新しいgTLDをルートゾーンに追加して、競争、革新、および消費者の選択を強化します。 多くの新しいgTLDがグローバルDNSに委任される可能性があるため、委任されていない名前空間を内部で使用することを選択したオペレータまたは管理者は、潜在的な「名前衝突」問題に直面する可能性があります。"
    },
    {
      "indent": 3,
      "text": "This document is primarily a report on the March 2014 workshop that set out to examine the causes and mitigation of such name collisions and their associated risks. It is a companion to the Workshop and Prize on Root Causes and Mitigation of Name Collisions proceedings [WPNC], and it also provides some additional background and context.",
      "ja": "このドキュメントは、主に、2014年3月のワークショップに関するレポートであり、このような名前の衝突の原因と緩和、およびそれらに関連するリスクを調査することを目的としています。 これは、ワークショップと名前の衝突の根本原因と軽減に関する手続き[WPNC]の賞であり、追加の背景とコンテキストも提供します。"
    },
    {
      "indent": 0,
      "text": "2. Background and Context",
      "section_title": true,
      "ja": "2.背景とコンテキスト"
    },
    {
      "indent": 3,
      "text": "When the workshop was convened, the context and status of the work around name collisions could be described as follows.",
      "ja": "ワークショップが開催されたとき、名前の衝突に関する作業の背景と状況は次のように説明することができました。"
    },
    {
      "indent": 3,
      "text": "Since early 2008, there had been numerous lengthy discussions within the ICANN community about the ability of the DNS root to scale to accommodate new gTLDs and the impact of making those changes on the DNS ecosystem. In March 2008, the Internet Architecture Board (IAB) observed that the introduction of suffixes in use in a number of environments could lead to instability [IAB2008]. In December 2010, the Security and Stability Advisory Committee (SSAC) issued their report on root scaling in which the committee formalized several recommendations based on \"actual measurement, monitoring, and data-sharing capabilities of root zone performance\" to help determine the feasibility of root scaling [SAC046]. Separately, the Root Server System Advisory Committee [RSSAC] agreed in late 2010 on the need to establish standard metrics to be collected and reported by all operators. This effort would provide the community with a baseline measure of the entire root server system's performance. With such an established baseline, any possible negative effect from additional TLDs within the root could potentially be identified. In late 2012, the ICANN Board affirmed the need to work with the root server operators via RSSAC to complete the documentation of the interactions between ICANN and the root server operators with respect to root zone scaling [IR2012].",
      "ja": "2008年初頭以来、ICANNコミュニティ内では、新しいgTLDに対応するためにDNSルートを拡張する能力と、それらの変更がDNSエコシステムに与える影響について、ICANNコミュニティ内で多くの長い議論がありました。 2008年3月に、インターネットアーキテクチャ委員会（IAB）は、多くの環境で使用されているサフィックスの導入が不安定につながる可能性があることを観察しました[IAB2008]。 2010年12月に、セキュリティおよび安定性諮問委員会（SSAC）は、ルートスケーリングに関するレポートを発行しました。ルートスケーリング[SAC046]。これとは別に、ルートサーバーシステム諮問委員会[RSSAC]は、2010年後半に、すべてのオペレーターが収集および報告する標準メトリックを確立する必要性について合意しました。この取り組みは、コミュニティにルートサーバーシステム全体のパフォーマンスのベースライン測定値を提供します。このような確立されたベースラインを使用すると、ルート内の追加のTLDによる悪影響の可能性を特定できます。 2012年後半、ICANN理事会は、ルートゾーンスケーリングに関するICANNとルートサーバーオペレーター間の相互作用の文書化を完了するために、RSSACを介してルートサーバーオペレーターと協力する必要性を確認しました[IR2012]。"
    },
    {
      "indent": 3,
      "text": "In March 2013, SSAC published an advisory titled \"SSAC Advisory on Internal Name Certificates,\" which identified a Certificate Authority (CA) practice that, if widely exploited, \"could pose a significant risk to the privacy and integrity of secure Internet communications\" [SAC057]. The ICANN Board acknowledged the issues identified in the advisory report on internal name certificates [SAC057] as part of a more general category of issues. These issues included installed systems utilizing a namespace in a private network that includes a non-delegated TLD that is later delegated into the root. In May 2013, the ICANN Board commissioned a study on the use within private name spaces of TLDs that are not currently delegated at the root level of the global DNS [ISTUDY]. This study was focused on potential name collision events between applied-for new gTLDs and non-delegated TLDs potentially used in private namespaces. The study also examined the potential possibility of name collisions arising from the use of digital certificates referenced in the SSAC report on internal name certificates [SAC057].",
      "ja": "2013年3月に、SSACは「内部名証明書に関するSSACアドバイザリ」というタイトルのアドバイザリを発行しました。これは、広く利用された場合、「安全なインターネット通信のプライバシーと整合性に重大なリスクをもたらす可能性がある」認証局（CA）の慣行を特定しました[ SAC057]。 ICANN理事会は、問題のより一般的なカテゴリの一部として、内部名証明書に関する助言レポート[SAC057]で特定された問題を認めました。これらの問題には、プライベートネットワークのネームスペースを利用するインストール済みシステムが含まれ、これには後でルートに委任される非委任TLDが含まれます。 2013年5月、ICANN理事会は、グローバルDNSのルートレベルで現在委任されていないTLDのプライベートネームスペース内での使用に関する調査を依頼しました[ISTUDY]。この研究は、プライベート名前空間で使用される可能性のある、適用対象の新しいgTLDと非委任TLDの間の潜在的な名前衝突イベントに焦点を当てました。この研究では、内部名証明書に関するSSACレポート[SAC057]で参照されているデジタル証明書の使用に起因する名前衝突の潜在的な可能性についても検討しました。"
    },
    {
      "indent": 3,
      "text": "Between the RSSAC's and SSAC's advisory statements ([RSSAC] [SAC046]) and the ICANN commissioning of a study in May 2013, there was significant progress on establishing formalized, coordinated monitoring and measurement of the root. RSSAC approached its finalization of the specific metrics that each root operator will collect and initiated discussions about where the operators will send their data for analysis once collected. To properly gauge the risks of new gTLD delegations to the root, an established baseline of normal performance of the system would be required to start sufficiently ahead of the new delegations. The execution of these RSSAC and SSAC recommendations was timed poorly with the commissioned study, resulting in a limited pool of data repositories from which any baseline and risk measurements could be established.",
      "ja": "RSSACおよびSSACの勧告声明（[RSSAC] [SAC046]）と2013年5月の調査のICANNのコミッショニングの間で、ルートの正式な調整された監視と測定の確立に大きな進展がありました。 RSSACは、各ルートオペレーターが収集する特定のメトリックの最終化に近づき、オペレーターが収集したデータを分析のためにどこに送信するかについての議論を開始しました。 ルートへの新しいgTLD委任のリスクを適切に評価するには、システムの正常なパフォーマンスの確立されたベースラインが、新しい委任よりも十分に先に開始する必要があります。 これらのRSSACおよびSSACの推奨事項の実行は、委託された調査とのタイミングが遅く、その結果、任意のベースラインおよびリスク測定値を確立できるデータリポジトリのプールが制限されました。"
    },
    {
      "indent": 3,
      "text": "It is common practice for each root operator to monitor its own root server, and some operators report the status and performance of their services publicly. As of ICANN's study commissioned in May 2013 [ISTUDY], there was no mechanism in place to allow a detailed view of the entire root system, short of the annual \"Day in the Life\" ([DITL]) data repository, which contains root DNS data over a short coordinated time period from a varying subset of root operators and was intended to be used for research purposes, not to provide overall monitoring and an operational view of system health. Due to the lack of a more comprehensive and desirable data repository for baseline and collision analysis DITL has become the de facto referential dataset for root traffic analysis.",
      "ja": "各ルートオペレーターは独自のルートサーバーを監視するのが一般的であり、一部のオペレーターはサービスのステータスとパフォーマンスを公開して報告します。 2013年5月に委託されたICANNの調査[ISTUDY]では、ルートを含む毎年の「Day in the Life」（[DITL]）データリポジトリを除き、ルートシステム全体の詳細な表示を可能にするメカニズムはありませんでした ルートオペレータのさまざまなサブセットからの短い調整期間にわたるDNSデータ。調査目的で使用することを目的としており、システムの健全性の全体的な監視と運用ビューを提供することを目的としていませんでした。 ベースラインおよび衝突分析のためのより包括的で望ましいデータリポジトリがないため、DITLはルートトラフィック分析の事実上の参照データセットになりました。"
    },
    {
      "indent": 3,
      "text": "The commissioned study, conducted by the Interisle Consulting Group, was published in August of 2013. Their report \"Name Collisions in the DNS\" [INTERISLE], based on [DITL] measurements, addressed name collisions in the DNS and also recommended options to mitigate the various name collision risks. The study identified categories of strings according to the risk they represent: low risk (80 percent of applied-for strings), uncalculated risk (20 percent of applied-for strings), and high risk (2 applied-for strings).",
      "ja": "Interisle Consulting Groupが実施した委託研究は2013年8月に公開されました。[DITL]測定に基づくレポート「DNSでの名前の衝突」[INTERISLE]は、DNSでの名前の衝突に対処し、 さまざまな名前の衝突のリスク。 この研究では、低リスク（適用される文字列の80％）、未計算のリスク（適用される文字列の20％）、および高リスク（2つの適用される文字列）を表すリスクに応じて、文字列のカテゴリを特定しました。"
    },
    {
      "indent": 3,
      "text": "At the same time as the [INTERISLE] study, ICANN published a proposal, titled \"New gTLD Collision Occurrence Management Plan\" [NGCOMP], to manage the risk of name collisions within the applied-for gTLDs. Based on measurements, ICANN deemed two strings, .home and .corp, to be high risk because of their widespread use within internal networks and would indefinitely delay their delegation [INTERISLE]. Those strings within the uncalculated-risk classification would be delayed 2 to 3 months in their application process while ICANN conducted more research into whether the string is of high- or low-risk classification. Those in the low-risk classification would face a delay in activating domains until 120 days after contracting with ICANN to allow for the change in certificate authority practices recommended in the SSAC report on internal name certificates [SAC057].",
      "ja": "[INTERISLE]の調査と同時に、ICANNは、申請されたgTLD内での名前の衝突のリスクを管理するための「新しいgTLD衝突発生管理計画」[NGCOMP]というタイトルの提案を発行しました。 測定に基づいて、ICANNは、.homeと.corpの2つの文字列が内部ネットワーク内で広く使用されているためリスクが高く、委任を無期限に遅らせると考えました[INTERISLE]。 計算されていないリスク分類内のこれらの文字列は、申請プロセスで2〜3か月遅れます。一方、ICANNは、文字列が高リスク分類か低リスク分類かをさらに調査しました。 低リスクの分類では、ICANNとの契約後120日までドメインのアクティブ化が遅れ、内部名証明書に関するSSACレポート[SAC057]で推奨されている認証局の慣行の変更が認められます。"
    },
    {
      "indent": 3,
      "text": "Within the ICANN proposal [NGCOMP], an approach termed the \"alternative path to delegation\" was outlined, in which a registry operator could elect to proceed with delegation, provided it initially blocked all second-level domains (SLDs) that appeared in the certain DITL datasets pending the completion of the assessment. The majority of new gTLD applicants that were eligible elected this alternative path once otherwise approved for delegation. The plan also outlined an outreach campaign to educate system administrators, software developers, and other engineers about the name collision issue and possible mitigation measures.",
      "ja": "ICANN提案[NGCOMP]内で、「委任への代替パス」と呼ばれるアプローチが概説されました。レジストリオペレーターは、特定のドメインに現れるすべての第2レベルドメイン（SLD） 評価の完了を待っているDITLデータセット。 適格であった新しいgTLD申請者の大多数は、別の方法で委任が承認されると、この代替パスを選択しました。 また、この計画では、システム管理者、ソフトウェア開発者、およびその他のエンジニアに名前の衝突の問題と可能な緩和策を教育するためのアウトリーチキャンペーンの概要を示しました。"
    },
    {
      "indent": 3,
      "text": "As a further provision, the \"New gTLD Collision Occurrence Management Plan\" called for a follow-up study that would develop a \"Name Collision Occurrence Management Framework\" [NCOMF]. In February 2014, the document, \"Mitigating the Risk of DNS Namespace Collisions: Phase One Report,\" was published by the ICANN-contracted group JAS Global Advisors [MRDNC]. The report provides a number of recommendations for addressing the name collision issue focusing on a technique termed \"controlled interruption,\" in which a registry would temporarily resolve all SLDs (or all SLDs present in the block list) to a specific IP: 127.0.53.53. The report also makes provisions to implement an emergency plan and strategy in case name collisions had a \"clear danger to human life.\"",
      "ja": "さらなる規定として、「新しいgTLD衝突発生管理計画」では、「Name Collision Occurrence Management Framework」[NCOMF]を開発する追跡調査が求められました。 2014年2月、ドキュメント「DNS名前空間衝突のリスクの軽減：フェーズ1レポート」がICANN契約グループJAS Global Advisors [MRDNC]によって発行されました。 このレポートは、レジストリがすべてのSLD（またはブロックリストに存在するすべてのSLD）を特定のIP：127.0.53.53に一時的に解決する「制御割り込み」と呼ばれる手法に焦点を当て、名前衝突の問題に対処するためのいくつかの推奨事項を提供します 。 また、このレポートでは、名前の衝突が「人命に明らかな危険」をもたらした場合に備えて、緊急時の計画と戦略を実施するための規定を設けています。"
    },
    {
      "indent": 0,
      "text": "2.1. Brief Update",
      "section_title": true,
      "ja": "2.1。 簡単な更新"
    },
    {
      "indent": 3,
      "text": "In the time frame after the workshop, a final version of the Phase One Report was released in June 2014 [MRDNC].",
      "ja": "ワークショップ後の時間枠で、フェーズ1レポートの最終版が2014年6月にリリースされました[MRDNC]。"
    },
    {
      "indent": 3,
      "text": "In July 2014, after a community review phase, a final recommendation was issued by ICANN [NCOMFINAL]; this has been followed by the publication of management documents for the implementation of a controlled interrupt for new gTLD delegations [NOCA] [NCSLDCIV] [ADDNOCA].",
      "ja": "2014年7月、コミュニティレビューフェーズの後、ICANN [NCOMFINAL]から最終勧告が発行されました。 これに続いて、新しいgTLD委任[NOCA] [NCSLDCIV] [ADDNOCA]の制御された割り込みを実装するための管理ドキュメントが発行されました。"
    },
    {
      "indent": 3,
      "text": "Much of the framework called for in the Name Collision Occurrence Management Framework [NCOMF] was not released by the time of writing this document, and the Phase One Report [MRDNC] indicated that its publication was delayed due to a security vulnerability [JASBUG] identified during the course of the work.",
      "ja": "Name Collision Occurrence Management Framework [NCOMF]で要求されたフレームワークの多くは、このドキュメントの執筆時点ではリリースされていません。フェーズ1レポート[MRDNC]は、セキュリティ脆弱性[JASBUG] 作業中。"
    },
    {
      "indent": 3,
      "text": "Broad community efforts to measure the impact of name collisions were not included in the final recommendation issued by ICANN [NCOMFINAL]. At the time of this writing, RSSAC has just published its specification of common measurements to be collected by root operators, meeting one part of the needs for measurements of the root server system [RSSAC002].",
      "ja": "名前の衝突の影響を測定する広範なコミュニティの努力は、ICANN [NCOMFINAL]によって発行された最終勧告に含まれていません。 この記事の執筆時点で、RSSACはルートオペレータによって収集される一般的な測定の仕様を公開したばかりで、ルートサーバーシステムの測定のニーズの一部を満たしています[RSSAC002]。"
    },
    {
      "indent": 0,
      "text": "3. Workshop Structure",
      "section_title": true,
      "ja": "3.ワークショップの構造"
    },
    {
      "indent": 3,
      "text": "The Workshop and Prize on Root Causes and Mitigation of Name Collisions [WPNC], sponsored by Verisign, took place March 8-10, 2014 in London, United Kingdom. The WPNC was open to the public, and it gathered subject-area specialists, researchers, and practitioners to discuss and present their views, concerns, and ideas surrounding the name collision issue. Proceedings are published at the workshop's website [WPNC].",
      "ja": "ベリサインが後援するワークショップと根本原因と名前の衝突の軽減[WPNC]に関する賞は、2014年3月8〜10日にイギリスのロンドンで開催されました。 WPNCは一般に公開されており、名前衝突の問題をめぐる意見、懸念、およびアイデアを議論し、提示するために、主題分野の専門家、研究者、および実務家を集めました。 議事録は、ワークショップのウェブサイト[WPNC]で公開されています。"
    },
    {
      "indent": 3,
      "text": "The workshop focused on studies of name collision risks and mitigations with the expectation to advance the global community's insight into operational uses of name suffixes that can result in name collisions and to gain a stronger understanding of the potential risks for the users of the installed systems. Additional emphasis and attention was given to discussions that might advance the state of knowledge about the architecture and impacts of DNS namespaces with multiple scopes or resolution contexts and the utilization of new methods of monitoring and understanding the needs and methods for mitigating emerging Internet risks around name collisions. A technical program committee, whose members spanned a variety of organizations and universities, was assembled. The committee issued a call for papers and evaluated all submissions to ensure the highest level of quality.",
      "ja": "ワークショップは、名前の衝突を引き起こす可能性のある名前の接尾辞の運用上の使用に関するグローバルコミュニティの洞察を深め、インストールされたシステムのユーザーの潜在的なリスクをより深く理解することを期待して、名前の衝突のリスクと緩和の研究に焦点を当てました。 複数のスコープまたは解決コンテキストを使用したDNS名前空間のアーキテクチャおよび影響に関する知識の状態、および名前に関する新たなインターネットリスクを緩和するためのニーズと方法を監視および理解する新しい方法の利用を促進する可能性のある議論に追加の重点と注意が与えられました 衝突。 メンバーがさまざまな組織や大学にまたがる技術プログラム委員会が設立されました。 委員会は論文を募集し、すべての提出物を評価して最高レベルの品質を確保しました。"
    },
    {
      "indent": 3,
      "text": "A synthesis of the accepted papers and conference proceedings is captured in the subsections below. Another informal synopsis of the workshop combined with individual statements and observations is available online [COMMENTARY].",
      "ja": "受け入れられた論文と会議議事録の統合は、以下のサブセクションにまとめられています。 ワークショップの別の非公式の概要は、個々の声明と観察と組み合わせてオンラインで入手できます[解説]。"
    },
    {
      "indent": 0,
      "text": "3.1. Research Findings",
      "section_title": true,
      "ja": "3.1。 研究結果"
    },
    {
      "indent": 3,
      "text": "Many of the research papers focused on the analysis of DITL data to better understand various aspects of the root NXDOMAIN traffic ([TECHNIQUES], [RARDBITS], [BLOCKLISTS], [MODELING], and [SEARCHLISTS]). Note: all workshop contributions are listed in Appendix B; full papers and slides are available at the website [WPNC].",
      "ja": "多くの研究論文は、ルートNXDOMAINトラフィックのさまざまな側面をよりよく理解するために、DITLデータの分析に焦点を当てています（[TECHNIQUES]、[RARDBITS]、[BLOCKLISTS]、[MODELING]、および[SEARCHLISTS]）。 注：ワークショップへの貢献はすべて付録Bにリストされています。 完全な論文とスライドは、ウェブサイト[WPNC]で入手できます。"
    },
    {
      "indent": 3,
      "text": "While the DITL data has become the de facto referential dataset for root traffic analysis, some presenters echoed concerns that the dataset may have become biased or polluted with \"artificial\" queries after the ICANN \"Reveal Day,\" in which the list of applied-for gTLD strings was publicly disclosed. No conclusive or empirical evidence of tampering was presented; however, concerns about the integrity and reliability of future DITL collections and analysis for purposes related to new gTLDs were echoed by some panelists [IESCPANEL]. Furthermore, the statistical accuracy and completeness of DITL data -- used to draw inferential conclusions or more specifically create SLD block lists -- was examined. The efficacy of blocking domains based on sampled DNS data, e.g., DITL, was investigated by comparing measurements of SLDs within DITL and that of a multi-month root NXDOMAIN collection at the A and J roots [BLOCKLISTS]. The findings provided insights into SLD-root affinities, SLD temporal query patterns and occurrence frequencies that demonstrated the ineffectiveness of block listing domains based on sampled DNS data such as [DITL].",
      "ja": "DITLデータはルートトラフィック分析の事実上の参照データセットになりましたが、一部の発表者は、ICANNの「Reveal Day」の後に「人工」クエリでデータセットがバイアスまたは汚染される可能性があるという懸念を繰り返しました。 gTLD文字列は公開されました。改ざんの決定的または経験的な証拠は提示されませんでした。ただし、新しいgTLDに関連する目的のための将来のDITL収集および分析の整合性と信頼性に関する懸念は、一部のパネリストによって反映されました[IESCPANEL]。さらに、推論の結論を導き出したり、より具体的にはSLDブロックリストを作成したりするために使用される、DITLデータの統計的正確性と完全性を検証しました。サンプリングされたDNSデータ、たとえばDITLに基づくドメインのブロックの有効性は、DITL内のSLDの測定値と、AおよびJのルート[BLOCKLISTS]での複数月のルートNXDOMAINコレクションの測定値を比較することによって調査されました。調査結果は、SLDルートアフィニティ、SLD一時クエリパターン、および[DITL]などのサンプリングされたDNSデータに基づくブロックリストドメインの無効性を示す発生頻度に関する洞察を提供しました。"
    },
    {
      "indent": 3,
      "text": "Measurements of queries specifying the recursion desired (RD) bit to the roots in DITL were quantified to identify the level and nature of naive DNS clients and to determine and assess potential impacts that could arise from the proposed SLD blocking technique to these naive clients [RARDBITS]. A substantial proportion of the root server request traffic contained queries with the RD bit specified. Both in absolute and relative terms, requests specifying the RD bit for applied-for gTLDs were found to be significantly lower when compared to existing TLDs. The root cause determination of what system or mechanism is responsible for generating the queries was inconclusive and only speculative explanations of faulty implementations of a DNS resolving server were hypothesized. However, the analysis was also not able to identify instances of actual or potential harm resulting from these naive clients, suggesting if SLD blocking techniques were to be utilized, it is unlikely there would be any negative impact to these naive clients.",
      "ja": "DITLのルートへの再帰要求（RD）ビットを指定するクエリの測定値を定量化して、ナイーブDNSクライアントのレベルと性質を特定し、提案されたSLDブロッキング手法からこれらのナイーブクライアントに生じる可能性のある影響を判断および評価します[RARDBITS ]。ルートサーバーの要求トラフィックのかなりの部分に、RDビットが指定されたクエリが含まれていました。絶対用語と相対用語の両方で、適用対象のgTLDのRDビットを指定するリクエストは、既存のTLDと比較して大幅に低いことがわかりました。クエリを生成する原因となっているシステムまたはメカニズムの根本的な原因の決定は決定的ではなく、DNS解決サーバーの実装の誤りに関する投機的な説明のみが仮定されました。ただし、分析では、これらの素朴なクライアントに起因する実際のまたは潜在的な危害のインスタンスを特定することもできなかったため、SLDブロッキング技術を利用する場合、これらの素朴なクライアントに悪影響が及ぶ可能性は低いことが示唆されました。"
    },
    {
      "indent": 0,
      "text": "3.2. System Analysis",
      "section_title": true,
      "ja": "3.2。 システム分析"
    },
    {
      "indent": 3,
      "text": "Comparison of elements can often help us to understand a system as a whole. A passive study of the DNS traffic in a provisioned domain such as \"corp.com\" may elucidate certain name collision parallels [CORPCOM]. Such measurements were presented as a proxy for the \".corp\" potential new gTLD. According to the study, significant DNS traffic volume was directed at a variety of third-level domains under \"corp.com\". This prompted a series of questions surrounding how name collisions can be identified, as most end-users won't recognize that problems may be due to a name collision. How will users know that the problem they are experiencing is a result of a new, colliding gTLD? Will support groups be able to diagnose a name collision event from reported symptom(s)? Will a collision-based security hole be detectable?",
      "ja": "多くの場合、要素の比較は、システム全体を理解するのに役立ちます。 「corp.com」などのプロビジョニングされたドメインでのDNSトラフィックの受動的な調査により、特定の名前の衝突の類似点[CORPCOM]が明らかになる可能性があります。 このような測定値は、「。corp」の潜在的な新しいgTLDのプロキシとして提示されました。 この調査によると、大量のDNSトラフィック量は、「corp.com」の下のさまざまな第3レベルドメインに向けられました。 ほとんどのエンドユーザーは、問題が名前の衝突によるものであることを認識しないため、名前の衝突の識別方法に関する一連の質問を促しました。 ユーザーは、発生している問題が新しいgTLDの衝突の結果であることをどのように知るのでしょうか？ サポートグループは、報告された症状から名前の衝突イベントを診断できますか？ 衝突ベースのセキュリティホールは検出可能ですか？"
    },
    {
      "indent": 3,
      "text": "These questions, upon which underpinnings rely on communication and educational awareness, may find recommendations or parallels from other system references during the workshop [JASFRAMEWORK] -- such as the postal and telephone system. Most telephone and postal systems have evolved over time, requiring individuals to alter the way they address their parcels or place their calls. Both systems implemented their changes in such a way that prior to the change, educational material is distributed and communicated and for a period of time and after the change, compliance of the previous standard is temporarily accepted. While the telephone and postal system operate in a very different way than the DNS, these parallels of \"advanced notification, education and communication, and a grace period\" were insightful for how other similar systems transitioned.",
      "ja": "基礎がコミュニケーションと教育意識に依存しているこれらの質問は、ワークショップ[JASFRAMEWORK]の間に他のシステム参照（郵便や電話システムなど）から推奨事項や類似点を見つけることがあります。 ほとんどの電話および郵便システムは時間の経過とともに進化しており、個人が小包の扱い方や電話のかけ方を変更する必要があります。 両方のシステムは、変更前に教材が配布および伝達され、一定期間および変更後、以前の標準のコンプライアンスが一時的に受け入れられるように、変更を実装しました。 電話および郵便システムはDNSとは非常に異なる方法で動作しますが、これらの「高度な通知、教育とコミュニケーション、および猶予期間」は、他の同様のシステムがどのように移行したかについて洞察力がありました。"
    },
    {
      "indent": 0,
      "text": "3.3. Frameworks: Modeling, Analysis, and Mitigation",
      "section_title": true,
      "ja": "3.3。 フレームワーク：モデリング、分析、および軽減"
    },
    {
      "indent": 3,
      "text": "Statements from several TLD operators during the conference reverberated a theme for the need of improved tooling, education, and communication surrounding name collisions. The delegation of new gTLDs is an ongoing event, and there is a clear and immediate need for these operators to have visibility to monitor and measure the effects of these new gTLD delegations. A lack of tools, shared data, communication, and education surrounding name collisions has handicapped operators in their ability to quantitatively measure and proactively provide any steps for mitigation of risks. To this end, numerous techniques, frameworks, and models that focused on the concepts of analyzing, detecting, and measuring various name collision risk factors were presented and reviewed with the hope of understanding these underlying concerns and issues ([TECHNIQUES] [MODELING] [SEARCHLISTS] [DNSENDUSER] [ENTNETWORK]).",
      "ja": "会議中の複数のTLDオペレーターからの声明は、名前の衝突を取り巻く改善されたツール、教育、コミュニケーションの必要性のテーマを反響させました。 新しいgTLDの委任は継続的なイベントであり、これらのオペレーターがこれらの新しいgTLD委任の影響を監視および測定するための可視性を持つことは、明確かつ即時に必要です。 名前の衝突を取り巻くツール、共有データ、通信、および教育の欠如により、リスクを軽減するための手順を定量的に測定し、積極的に提供する能力が障害のあるオペレーターがいます。 この目的のために、さまざまな名前衝突リスク要因の分析、検出、および測定の概念に焦点を当てた多数の技術、フレームワーク、およびモデルが提示され、これらの潜在的な懸念および問題を理解することを期待してレビューされました（[TECHNIQUES] [MODELING] [ サーチリスト] [DNSエンドユーザー] [ネットワーク]）。"
    },
    {
      "indent": 3,
      "text": "Data-driven analysis and mitigation require operators to be versed and skilled with data analysis techniques to better understand the contextual intent and ownership of DNS queries. An overview of various DNS analysis techniques in which ways of decomposing names, measuring temporal distributions between queries, and detecting organizational/geographical affinities was presented [TECHNIQUES]. More-specific techniques were also showcased, such as a systematic way of observing and characterizing the impact of search lists within root DNS traffic allowing operators to quantify the number of unique entities that may be reliant on a particular name space [SEARCHLISTS]. While not exhaustive, the techniques presented have been proven to elucidate patterns within root DNS traffic data and could serve as the potential building blocks of a DNS analysis framework.",
      "ja": "データ駆動型の分析と緩和には、DNSクエリのコンテキストの意図と所有権をよりよく理解するために、オペレーターがデータ分析技術に精通し、熟練していることが必要です。 名前を分解する方法、クエリ間の時間分布を測定する方法、および組織的/地理的類似性を検出するさまざまなDNS分析手法の概要が提示されました[TECHNIQUES]。 また、ルートDNSトラフィック内の検索リストの影響を体系的に確認および特徴付ける方法など、より具体的な手法も紹介されました。これにより、オペレーターは特定の名前空間に依存する可能性のある一意のエンティティの数を定量化できます[SEARCHLISTS]。 網羅的ではありませんが、提示された手法は、ルートDNSトラフィックデータ内のパターンを解明することが証明されており、DNS分析フレームワークの潜在的なビルディングブロックとして機能します。"
    },
    {
      "indent": 3,
      "text": "Most of the previously published work focused on name collisions has produced various quantitative analyses based on observations of Internet traffic and data, including DNS queries and web content, in which behavior and associated risks have been inferred. An understanding of the inverse of the process by starting with a fundamental model of name resolution at the client was proposed as an alternative means to define risk [MODELING]. This model deconstructed the process of name resolution at the resolver library of a client system and formalized a model from which derived metrics could be used to define and quantify associated risks. While the model presented is only a piece of the greater name collision puzzle, it provides potentially new insights into what may otherwise be considered a missing piece.",
      "ja": "名前の衝突に焦点を当てた以前に公開された研究のほとんどは、DNSクエリやWebコンテンツを含むインターネットトラフィックやデータの観察に基づいて、さまざまな定量分析を行いました。 リスクを定義するための代替手段として、クライアントでの名前解決の基本モデルから開始することによるプロセスの逆の理解が提案されました[モデリング]。 このモデルは、クライアントシステムのリゾルバーライブラリで名前解決のプロセスを分解し、派生メトリックを使用して関連するリスクを定義および定量化できるモデルを形式化しました。 提示されたモデルは、名前の衝突のパズルの一部にすぎませんが、欠落していると見なされる可能性のあるものに対する潜在的に新しい洞察を提供します。"
    },
    {
      "indent": 3,
      "text": "Just as important as understanding the root causes of name collisions, providing effective mitigation strategies is a critical piece of the name collision puzzle. Mitigation can be achieved from both higher levels, such as ICANN, as well as the enterprise level. Proposed strategies for mitigating name collisions at both of these levels were presented. While the technical details for each proposed strategy varies, underlying dependencies in both strategies require operators to monitor and educate/train their users.",
      "ja": "名前の衝突の根本原因を理解することと同じくらい重要なことは、効果的な緩和戦略を提供することは、名前の衝突パズルの重要な部分です。 軽減は、ICANNなどの上位レベルとエンタープライズレベルの両方から達成できます。 これらの両方のレベルで名前の衝突を緩和するための提案された戦略が提示されました。 提案された各戦略の技術的な詳細は異なりますが、両方の戦略の基礎となる依存関係では、オペレーターがユーザーを監視および教育/トレーニングする必要があります。"
    },
    {
      "indent": 0,
      "text": "3.4. Conclusions and Next Steps",
      "section_title": true,
      "ja": "3.4。 結論と次のステップ"
    },
    {
      "indent": 3,
      "text": "In their concluding statement [NEXTSTEPS], the workshop committee stated:",
      "ja": "ワークショップ委員会は、結論声明[NEXTSTEPS]で次のように述べました。"
    },
    {
      "indent": 6,
      "text": "It occurs to the program committee that the analysis of the interactions between the different uses of domain names within local or global context is almost a nonexistent topic of research. This may have to do with the lack of accessible data, lack of theory of root causes, a lack of interest, or a bias in the participation of the workshop. We think that this is evidence that this study of the global centrally important technical system needs to be ramped up.",
      "ja": "プログラム委員会は、ローカルまたはグローバルコンテキスト内でのドメイン名の異なる使用間の相互作用の分析は、ほとんど存在しない研究テーマであると思います。 これは、アクセス可能なデータの欠如、根本原因の理論の欠如、関心の欠如、またはワークショップへの参加の偏りに関係している可能性があります。 これは、世界的に重要な技術システムのこの研究を強化する必要があるという証拠だと思います。"
    },
    {
      "indent": 3,
      "text": "Follow-on commentary [NEXTSTEPS] from the attendees reaffirmed this opinion with recurring messages of a need to understand the root causes of name collision and the need to overcome shortcomings within our shared data collection, monitoring, and analysis of the DNS.",
      "ja": "参加者からの次のコメント[NEXTSTEPS]は、名前の衝突の根本原因を理解する必要性と、共有データの収集、監視、DNSの分析内の欠点を克服する必要性の繰り返しのメッセージでこの意見を再確認しました。"
    },
    {
      "indent": 3,
      "text": "Many name collision unknowns still exist. What are the root causes of these queries? What is going on within a recursive name server? What vulnerabilities or subtle attack vectors do these new gTLD delegations enable? The limited datasets available to researchers and operators are not sufficient to draw baseline measurements for these questions, forcing the community to make inferences and rank guesses as to what is going on within the DNS. Using these suboptimal data repositories to create solutions such as block lists is only dealing with the symptoms of the problem and not addressing the root cause. To properly answer these questions, the community needs to address the issue of a shortage of funding and data collection/analysis. Communication and educational outreach programs need to be improved in order raise the awareness of impacted parties and broaden participation and sharing.",
      "ja": "多くの名前衝突の未知のものがまだ存在します。 これらのクエリの根本的な原因は何ですか？ 再帰ネームサーバー内で何が起こっているのですか？ これらの新しいgTLD委任により、どのような脆弱性または微妙な攻撃ベクトルが可能になりますか？ 研究者やオペレーターが利用できる限られたデータセットは、これらの質問のベースライン測定値を引き出すのに十分ではなく、コミュニティがDNS内で何が起こっているかを推測し、推測をランク付けします。 これらの次善のデータリポジトリを使用してブロックリストなどのソリューションを作成することは、問題の症状のみを処理し、根本原因に対処することではありません。 これらの質問に適切に回答するには、コミュニティは資金不足とデータ収集/分析の問題に対処する必要があります。 影響を受ける当事者の意識を高め、参加と共有を広げるために、コミュニケーションと教育のアウトリーチプログラムを改善する必要があります。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4.セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "Workshop participants discussed security aspects related to root cause analysis and mitigation techniques of potential name collision events. As noted in several papers and presentations, security concerns may both arise and be addressed with name collision mitigation techniques. Follow-on measurement-based research is important to security considerations for name collisions.",
      "ja": "ワークショップの参加者は、潜在的な名前衝突イベントの根本原因分析と緩和技術に関連するセキュリティの側面について議論しました。 いくつかの論文やプレゼンテーションで述べられているように、セキュリティの懸念が生じ、名前の衝突を緩和する技術で対処される場合があります。 後続の測定ベースの調査は、名前の衝突に関するセキュリティ上の考慮事項にとって重要です。"
    },
    {
      "indent": 0,
      "text": "5. Informative References",
      "section_title": true,
      "ja": "5.参考情報"
    },
    {
      "indent": 3,
      "text": "[ADDNOCA] ICANN, \"Addendum To Name Collision Occurrence Assessment\", November 2014, <http://newgtlds.icann.org/sites/default/files/ agreements/name-collision-assessment-addendum-14nov14-en.htm>.",
      "ja": "[ADDNOCA] ICANN、「名前衝突発生評価の補遺」、2014年11月、<http://newgtlds.icann.org/sites/default/files/ agreements / name-collision-assessment-addendum-14nov14-en.htm> 。"
    },
    {
      "indent": 3,
      "text": "[BLOCKLISTS] Thomas, M., Labrou, Y., and A. Simpson, \"The Effectiveness of Block Lists in Preventing Collisions\", March 2014, <http://namecollisions.net/program/index.html>.",
      "ja": "[ブロックリスト] Thomas、M.、Labrou、Y。、およびA. Simpson、「衝突防止におけるブロックリストの有効性」、2014年3月、<http://namecollisions.net/program/index.html>。"
    },
    {
      "indent": 3,
      "text": "[COMMENTARY] Kaliski, B., \"Proceedings of Name Collisions Workshop Available\", March 2014, <http://www.circleid.com/posts/20140326_proceedings_ of_name_collisions_workshop_available/>.",
      "ja": "[解説] Kaliski、B。、「Proceedings of Name Collisions Workshop Available」、2014年3月、<http://www.circleid.com/posts/20140326_proceedings_ of_name_collisions_workshop_available />。"
    },
    {
      "indent": 3,
      "text": "[CORPCOM] Strutt, C., \"Looking at corp.com as a proxy for .corp\", March 2014, <http://namecollisions.net/program/index.html>.",
      "ja": "[CORPCOM] Strutt、C。、「。corpのプロキシとしてcorp.comを見る」、2014年3月、<http://namecollisions.net/program/index.html>。"
    },
    {
      "indent": 3,
      "text": "[DITL] Center for Applied Internet Data Analysis, \"A Day in the Life of the Internet (DITL)\", July 2011, <http://www.caida.org/projects/ditl/>.",
      "ja": "[DITL]応用インターネットデータ分析センター、「インターネットの1日（DITL）」、2011年7月、<http://www.caida.org/projects/ditl/>。"
    },
    {
      "indent": 3,
      "text": "[DNS-OARC] Mitchell, K., \"DNS-OARC\", March 2014, <http://namecollisions.net/program/index.html>.",
      "ja": "[DNS-OARC] Mitchell、K。、「DNS-OARC」、2014年3月、<http://namecollisions.net/program/index.html>。"
    },
    {
      "indent": 3,
      "text": "[DNSENDUSER] Huston, G., \"Measuring DNS Behaviors from the End User Perspective\", March 2014, <http://namecollisions.net/program/index.html>.",
      "ja": "[DNSENDUSER] Huston、G.、「エンドユーザーの観点からのDNS動作の測定」、2014年3月、<http://namecollisions.net/program/index.html>。"
    },
    {
      "indent": 3,
      "text": "[ENTNETWORK] Hoffman, P., \"Name Collision Mitigation for Enterprise Networks\", March 2014, <http://namecollisions.net/program/index.html>.",
      "ja": "[ENTNETWORK] Hoffman、P。、「エンタープライズネットワークの名前衝突軽減」、2014年3月、<http://namecollisions.net/program/index.html>。"
    },
    {
      "indent": 3,
      "text": "[IAB2008] IAB, \"The IAB's response to ICANN's solicitation on DNS stability\", March 2008, <https://www.iab.org/documents/correspondence-reports-documents/docs2008/2008-03-07-icann-new-gtlds/>.",
      "ja": "[IAB2008] IAB、「DNSの安定性に関するICANNの要請に対するIABの対応」、2008年3月、<https://www.iab.org/documents/correspondence-reports-documents/docs2008/2008-03-07-icann-new -gtlds />。"
    },
    {
      "indent": 3,
      "text": "[IESCPANEL] Woolf, S., Koch, P., Kolkman, O., Kumari, W., and J. Levine, \"Internet Engineering and Standards Considerations\", March 2014, <http://namecollisions.net/program/index.html>.",
      "ja": "[IESCPANEL] Woolf、S.、Koch、P.、Kolkman、O.、Kumari、W.、and J. Levine、 \"Internet Engineering and Standards Considerations\"、2014年3月、<http://namecollisions.net/program/ index.html>。"
    },
    {
      "indent": 3,
      "text": "[INTERISLE] ICANN, \"Name Collision in the DNS\", Version 1.5, August 2013, <https://www.icann.org/en/about/staff/security/ ssr/name-collision-02aug13-en.pdf>.",
      "ja": "[内部] ICANN、「DNSの名前衝突」、バージョン1.5、2013年8月、<https://www.icann.org/en/about/staff/security/ ssr / name-collision-02aug13-en.pdf> 。"
    },
    {
      "indent": 3,
      "text": "[IR2012] ICANN, \"Preliminary Report | Regular Meeting of the ICANN Board\", September 2012, <http://www.icann.org/en/groups/ board/documents/prelim-report-13sep12-en.htm>.",
      "ja": "[IR2012] ICANN、「予備報告| ICANN理事会の定例会議」、2012年9月、<http://www.icann.org/en/groups/ board / documents / prelim-report-13sep12-en.htm>。"
    },
    {
      "indent": 3,
      "text": "[ISTUDY] ICANN, \"Security Studies on the Use of Non-Delegated TLDs, and Dotless Names\", May 2013, <https://www.icann.org/en/news/announcements/ announcement-28may13-en.htm>.",
      "ja": "[ISTUDY] ICANN、「非委任TLDおよびドットレス名の使用に関するセキュリティ研究」、2013年5月、<https://www.icann.org/en/news/announcements/announcement-28may13-en.htm> 。"
    },
    {
      "indent": 3,
      "text": "[JASBUG] Common Vulnerabilities and Exposures, \"Group Policy Remote Code Execution Vulnerability\", CVE-2015-0008, February 2015, <http://www.cve.mitre.org/cgi-bin/ cvename.cgi?name=CVE-2015-0008>.",
      "ja": "[JASBUG]共通の脆弱性とエクスポージャー、「グループポリシーのリモートコード実行の脆弱性」、CVE-2015-0008、2015年2月、<http://www.cve.mitre.org/cgi-bin/ cvename.cgi？name = CVE -2015-0008>。"
    },
    {
      "indent": 3,
      "text": "[JASFRAMEWORK] Schmidt, J., \"Name Collisions Management Framework\", March 2014, <http://namecollisions.net/program/index.html>.",
      "ja": "[JASFRAMEWORK] Schmidt、J。、「名前衝突管理フレームワーク」、2014年3月、<http://namecollisions.net/program/index.html>。"
    },
    {
      "indent": 3,
      "text": "[KEEPEYE] Schneier, B., \"Keeping an Eye on Name Collisions\", March 2014, <http://namecollisions.net/program/index.html>.",
      "ja": "[KEEPEYE]シュナイアー、B。、「名前の衝突を監視する」、2014年3月、<http://namecollisions.net/program/index.html>。"
    },
    {
      "indent": 3,
      "text": "[MODELING] Deccio, C. and D. Wessels, \"What's in a Name (Collision): Modeling and Quantifying Collision Potential\", March 2014, <http://namecollisions.net/program/index.html>.",
      "ja": "[モデリング] Deccio、C. and D. Wessels、 \"What's in a Name（Collision）：Modeling and Quantifying Collision Potential\"、2014年3月、<http://namecollisions.net/program/index.html>。"
    },
    {
      "indent": 3,
      "text": "[MRDNC] ICANN, \"Mitigating the Risk of DNS Namespace Collisions: A Study on Namespace Collisions in the Global Internet DNS Namespace and a Framework for Risk Mitigation\", February 2014, <https://www.icann.org/en/about/staff/ security/ssr/name-collision-mitigation-26feb14-en.pdf>.",
      "ja": "[MRDNC] ICANN、「DNS名前空間衝突のリスクの軽減：グローバルインターネットDNS名前空間における名前空間衝突の研究とリスク軽減のフレームワーク」、2014年2月、<https://www.icann.org/en/about / staff / security / ssr / name-collision-mitigation-26feb14-en.pdf>。"
    },
    {
      "indent": 3,
      "text": "[NCOMF] ICANN, \"ICANN Selects Lead for Development of Name Collision Occurrence Management Framework\", November 2013, <http://www.icann.org/en/news/announcements/ announcement-2-11nov13-en.htm>.",
      "ja": "[NCOMF] ICANN、「ICANNが名前衝突発生管理フレームワークの開発のためのリードを選択」、2013年11月、<http://www.icann.org/en/news/announcements/announcement-2-11nov13-en.htm>"
    },
    {
      "indent": 3,
      "text": "[NCOMFINAL] ICANN, \"Name Collision Occurrence Management Framework\", July 2014, <https://www.icann.org/en/system/files/files/ name-collision-framework-30jul14-en.pdf>.",
      "ja": "[NCOMFINAL] ICANN、「Name Collision Occurrence Management Framework」、2014年7月、<https://www.icann.org/en/system/files/files/ name-collision-framework-30jul14-en.pdf>。"
    },
    {
      "indent": 3,
      "text": "[NCRI] ICANN, \"Name Collision Resources & Information\", <http://www.icann.org/en/help/name-collision>.",
      "ja": "[NCRI] ICANN、「Name Collision Resources＆Information」、<http://www.icann.org/en/help/name-collision>。"
    },
    {
      "indent": 3,
      "text": "[NCSLDCIV] ICANN, \"Name Collision SLD Controlled Interruption Variations\", September 2014, <http://newgtlds.icann.org/sites/default/files/ agreements/name-collision-sld-controlled-interruption-12sep14-en.htm>.",
      "ja": "[NCSLDCIV] ICANN、「Name Collision SLD Controlled Interruption Variations」、2014年9月、<http://newgtlds.icann.org/sites/default/files/ agreements / name-collision-sld-controlled-interruption-12sep14-en htm>。"
    },
    {
      "indent": 3,
      "text": "[NEXTSTEPS] Kaliski, B., \"Workshop Wrap-Up and Next Steps\", March 2014, <http://namecollisions.net/program/index.html>.",
      "ja": "[NEXTSTEPS] Kaliski、B.、「ワークショップのまとめと次のステップ」、2014年3月、<http://namecollisions.net/program/index.html>。"
    },
    {
      "indent": 3,
      "text": "[NGCOMP] ICANN, \"New gTLD Collision Risk Mitigation\", August 2013, <https://www.icann.org/en/about/staff/security/ssr/ new-gtld-collision-mitigation-05aug13-en.pdf>.",
      "ja": "[NGCOMP] ICANN、「新しいgTLD衝突リスクの軽減」、2013年8月、<https://www.icann.org/en/about/staff/security/ssr/ new-gtld-collision-mitigation-05aug13-en.pdf >。"
    },
    {
      "indent": 3,
      "text": "[NOCA] ICANN, \"Name Collision Occurrence Assessment\", August 2014, <http://newgtlds.icann.org/sites/default/files/ agreements/name-collision-assessment-04aug14-en.htm>.",
      "ja": "[NOCA] ICANN、「名前衝突発生評価」、2014年8月、<http://newgtlds.icann.org/sites/default/files/ agreements / name-collision-assessment-04aug14-en.htm>。"
    },
    {
      "indent": 3,
      "text": "[RARDBITS] Reid, J., \"Analysing the Use of the RA and RD bits in Queries to Root Servers\", March 2014, <http://namecollisions.net/program/index.html>.",
      "ja": "[RARDBITS] Reid、J。、「ルートサーバーへのクエリでのRAおよびRDビットの使用の分析」、2014年3月、<http://namecollisions.net/program/index.html>。"
    },
    {
      "indent": 3,
      "text": "[RFC1591] Postel, J., \"Domain Name System Structure and Delegation\", RFC 1591, DOI 10.17487/RFC1591, March 1994, <http://www.rfc-editor.org/info/rfc1591>.",
      "ja": "[RFC1591]ポステル、J。、「ドメインネームシステムの構造と委任」、RFC 1591、DOI 10.17487 / RFC1591、1994年3月、<http://www.rfc-editor.org/info/rfc1591>。"
    },
    {
      "indent": 3,
      "text": "[RFC2606] Eastlake 3rd, D. and A. Panitz, \"Reserved Top Level DNS Names\", BCP 32, RFC 2606, DOI 10.17487/RFC2606, June 1999, <http://www.rfc-editor.org/info/rfc2606>.",
      "ja": "[RFC2606] Eastlake 3rd、D.およびA. Panitz、「Reserved Top Level DNS Names」、BCP 32、RFC 2606、DOI 10.17487 / RFC2606、1999年6月、<http://www.rfc-editor.org/info/ rfc2606>。"
    },
    {
      "indent": 3,
      "text": "[RFC6761] Cheshire, S. and M. Krochmal, \"Special-Use Domain Names\", RFC 6761, DOI 10.17487/RFC6761, February 2013, <http://www.rfc-editor.org/info/rfc6761>.",
      "ja": "[RFC6761] Cheshire、S.およびM. Krochmal、「特別な使用ドメイン名」、RFC 6761、DOI 10.17487 / RFC6761、2013年2月、<http://www.rfc-editor.org/info/rfc6761>。"
    },
    {
      "indent": 3,
      "text": "[RFC7719] Hoffman, P., Sullivan, A., and K. Fujiwara, \"DNS Terminology\", RFC 7719, DOI 10.17487/RFC7719, December 2015, <http://www.rfc-editor.org/info/rfc7719>.",
      "ja": "[RFC7719] Hoffman、P.、Sullivan、A。、およびK. Fujiwara、「DNS用語」、RFC 7719、DOI 10.17487 / RFC7719、2015年12月、<http://www.rfc-editor.org/info/rfc7719 >。"
    },
    {
      "indent": 3,
      "text": "[RSSAC] Murai, J., \"RSSAC response to the root scaling report\", November 2010, <http://www.icann.org/en/news/ correspondence/murai-to-board-25nov10-en.pdf>.",
      "ja": "[RSSAC] Murai、J.、「ルートスケーリングレポートへのRSSAC応答」、2010年11月、<http://www.icann.org/en/news/通信/murai-to-board-25nov10-en.pdf> 。"
    },
    {
      "indent": 3,
      "text": "[RSSAC002] ICANN Root Server System Advisory Committee, \"Advisory on Measurements of the Root Server System\", November 2014, <https://www.icann.org/en/system/files/files/ rssac-002-measurements-root-20nov14-en.pdf>.",
      "ja": "[RSSAC002] ICANNルートサーバーシステム諮問委員会、「ルートサーバーシステムの測定に関する助言」、2014年11月、<https://www.icann.org/en/system/files/files/ rssac-002-measurements-root -20nov14-en.pdf>。"
    },
    {
      "indent": 3,
      "text": "[SAC045] ICANN Security and Stability Advisory Committee, \"Invalid Top Level Domain Queries at the Root Level of the Domain Name System\", SAC 045, November 2010, <https://www.icann.org/en/groups/ssac/documents/ sac-045-en.pdf>.",
      "ja": "[SAC045] ICANNセキュリティおよび安定性諮問委員会、「ドメインネームシステムのルートレベルでの無効なトップレベルドメインクエリ」、SAC 045、2010年11月、<https://www.icann.org/en/groups/ssac/ documents / sac-045-en.pdf>"
    },
    {
      "indent": 3,
      "text": "[SAC046] ICANN Security and Stability Advisory Committee, \"Report of the Security and Stability Advisory Committee on Root Scaling\", SAC 046, December 2010, <https://www.icann.org/en/groups/ssac/documents/ sac-046-en.pdf>.",
      "ja": "[SAC046] ICANNセキュリティおよび安定性諮問委員会、「ルートスケーリングに関するセキュリティおよび安定性諮問委員会の報告」、SAC 046、2010年12月、<https://www.icann.org/en/groups/ssac/documents/ sac -046-en.pdf>。"
    },
    {
      "indent": 3,
      "text": "[SAC057] ICANN Security and Stability Advisory Committee, \"SSAC Advisory on Internal Name Certificates\", SAC057, March 2013, <http://www.icann.org/en/groups/ssac/documents/ sac-057-en.pdf>.",
      "ja": "[SAC057] ICANNセキュリティおよび安定性諮問委員会、「内部名証明書に関するSSAC諮問」、SAC057、2013年3月、<http://www.icann.org/en/groups/ssac/documents/ sac-057-en.pdf >。"
    },
    {
      "indent": 3,
      "text": "[SEARCHLISTS] Simpson, A., \"Detecting Search Lists in Authoritative DNS\", March 2014, <http://namecollisions.net/program/index.html>.",
      "ja": "[SEARCHLISTS] Simpson、A.、「権威あるDNSでの検索リストの検出」、2014年3月、<http://namecollisions.net/program/index.html>。"
    },
    {
      "indent": 3,
      "text": "[TECHNIQUES] Thomas, M. and A. Simpson, \"Analysis Techniques for Determining Cause and Ownership of DNS Queries\", March 2014, <http://namecollisions.net/program/index.html>.",
      "ja": "[TECHNIQUES] Thomas、M。、およびA. Simpson、「DNSクエリの原因と所有権を決定するための分析手法」、2014年3月、<http://namecollisions.net/program/index.html>。"
    },
    {
      "indent": 3,
      "text": "[WPNC] Verisign, \"Workshop and Prize on Root Causes and Mitigation of Name Collisions (WPNC)\", June 2014, <http://namecollisions.net/>.",
      "ja": "[WPNC] Verisign、「根本原因と名前衝突の軽減に関するワークショップと賞（WPNC）」、2014年6月、<http://namecollisions.net/>。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Program Committee",
      "ja": "付録A.プログラム委員会"
    },
    {
      "indent": 3,
      "text": "This workshop program committee consisted of Geoff Huston, Burt Kaliski, Olaf Kolkman, John Levine, Allison Mankin, Lixia Zhang, Anne-Marie Eklund Loewinder, and Andrew Sullivan.",
      "ja": "このワークショッププログラム委員会は、Geoff Huston、Burt Kaliski、Olaf Kolkman、John Levine、Allison Mankin、Lixia Zhang、Anne-Marie Eklund Loewinder、およびAndrew Sullivanで構成されました。"
    },
    {
      "indent": 0,
      "text": "Appendix B. Workshop Material",
      "ja": "付録B.ワークショップ資料"
    },
    {
      "indent": 3,
      "text": "Main Workshop Page: <http://namecollisions.net/>",
      "ja": "メインワークショップページ：<http://namecollisions.net/>"
    },
    {
      "indent": 3,
      "text": "Name Collision Invited and Submitted Papers, Panels, and Videos: <http://namecollisions.net/program/index.html>",
      "ja": "Name Collision Invited and Submitted Papers、Panels、and Videos：<http://namecollisions.net/program/index.html>"
    },
    {
      "indent": 3,
      "text": "The peer-reviewed papers were:",
      "ja": "査読済みの論文は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "o \"Analysis Techniques for Determining Cause and Ownership of DNS Queries\" [TECHNIQUES],",
      "ja": "o「DNSクエリの原因と所有権を判断するための分析手法」[TECHNIQUES]、"
    },
    {
      "indent": 3,
      "text": "o \"Analysing the Use of the RA and RD bits in Queries to Root Servers\" [RARDBITS],",
      "ja": "o「ルートサーバーへのクエリでのRAおよびRDビットの使用の分析」[RARDBITS]"
    },
    {
      "indent": 3,
      "text": "o \"The Effectiveness of Block Lists in Preventing Collisions\" [BLOCKLISTS],",
      "ja": "o「衝突防止におけるブロックリストの有効性」[ブロックリスト]、"
    },
    {
      "indent": 3,
      "text": "o \"What's in a Name (Collision): Modeling and Quantifying Collision Potential\" [MODELING], and",
      "ja": "o「名前に含まれるもの（衝突）：衝突の可能性のモデリングと定量化」[モデリング]、および"
    },
    {
      "indent": 3,
      "text": "o \"Detecting Search Lists in Authoritative DNS\" [SEARCHLISTS].",
      "ja": "o「権威あるDNSでの検索リストの検出」[SEARCHLISTS]。"
    },
    {
      "indent": 3,
      "text": "The invited talks were:",
      "ja": "招待講演は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "o \"Keeping an Eye on Name Collisions\" [KEEPEYE],",
      "ja": "o「名前の衝突を監視する」[KEEPEYE]、"
    },
    {
      "indent": 3,
      "text": "o \"Looking at corp.com as a proxy for .corp\" [CORPCOM],",
      "ja": "o「corp.comを.corpのプロキシとして見る」[CORPCOM]、"
    },
    {
      "indent": 3,
      "text": "o \"Measuring DNS Behaviors from the End User Perspective\" [DNSENDUSER],",
      "ja": "o「エンドユーザーの観点からのDNS動作の測定」[DNSENDUSER]、"
    },
    {
      "indent": 3,
      "text": "o \"DNS-OARC\" [DNS-OARC], and",
      "ja": "o「DNS-OARC」[DNS-OARC]、および"
    },
    {
      "indent": 3,
      "text": "o \"Name Collision Mitigation for Enterprise Networks\" [ENTNETWORK].",
      "ja": "o「エンタープライズネットワークの名前衝突軽減」[ENTNETWORK]。"
    },
    {
      "indent": 3,
      "text": "The panels and discussions were:",
      "ja": "パネルとディスカッションは次のとおりです。"
    },
    {
      "indent": 3,
      "text": "o \"Internet Engineering and Standards Considerations\" [IESCPANEL],",
      "ja": "o「インターネットエンジニアリングと標準に関する考慮事項」[IESCPANEL]、"
    },
    {
      "indent": 3,
      "text": "o \"Name Collisions Management Framework\" [JASFRAMEWORK], and",
      "ja": "o「名前衝突管理フレームワーク」[JASFRAMEWORK]、および"
    },
    {
      "indent": 3,
      "text": "o \"Workshop Wrap-Up and Next Steps\" [NEXTSTEPS].",
      "ja": "o「ワークショップのまとめと次のステップ」[NEXTSTEPS]。"
    },
    {
      "indent": 0,
      "text": "Appendix C. Workshop Participants",
      "ja": "付録C.ワークショップ参加者"
    },
    {
      "indent": 3,
      "text": "A list of workshop participants is provided at [WPNC].",
      "ja": "ワークショップ参加者のリストは[WPNC]で提供されています。"
    },
    {
      "indent": 0,
      "text": "Acknowledgments",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "We would like to thank both the program committee (Appendix A) and the workshop participants (Appendix C), with equal appreciation to those who spoke formally and those who joined in the lively discussions.",
      "ja": "プログラム委員会（付録A）とワークショップ参加者（付録C）の両方に感謝します。正式に発言した人と活発な議論に参加した人に平等に感謝します。"
    },
    {
      "indent": 3,
      "text": "Additionally, we would like to thank the following people for their review comments: Burt Kaliski, Olaf Kolkman, Ed Lewis, Nevil Brownlee, Tim Wicinski, and Danny McPherson.",
      "ja": "さらに、レビューコメントについては、バートカリスキ、オラフコルクマン、エドルイス、ネビルブラウンリー、ティムウィシンスキー、ダニーマクファーソンの各氏に感謝します。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Matthew Thomas Email: mthomas@verisign.com",
      "ja": "マシュー・トーマスメール：mthomas@verisign.com"
    },
    {
      "indent": 3,
      "text": "Allison Mankin Salesforce Email: allison.mankin@gmail.com",
      "ja": "アリソンマンキンSalesforceメール：allison.mankin@gmail.com"
    },
    {
      "indent": 3,
      "text": "Lixia Zhang UCLA Email: lixia@cs.ucla.edu",
      "ja": "Lixia Zhang UCLAメール：lixia@cs.ucla.edu"
    }
  ]
}