{
  "title": {
    "text": "RFC 8067 - Updating When Standards Track Documents May Refer Normatively to Documents at a Lower Level",
    "ja": "RFC 8067 - 標準化過程文書は、下位レベルのドキュメントを参照してください規範的される場合があり更新"
  },
  "number": 8067,
  "created_at": "2019-10-22 22:37:04.774011+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                          B. Leiba\nRequest for Comments: 8067                           Huawei Technologies\nBCP: 97                                                     January 2017\nUpdates: 3967\nCategory: Best Current Practice\nISSN: 2070-1721",
      "raw": true
    },
    {
      "indent": 4,
      "text": "Updating When Standards Track Documents May Refer Normatively to\n                   Documents at a Lower Level",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "RFC 3967 specifies a process for allowing normative references to documents at lower maturity levels (\"downrefs\"), which involves calling out the downref explicitly in the Last Call notice. That requirement has proven to be unnecessarily strict, and this document updates RFC 3967, allowing the IESG more flexibility in accepting downrefs in Standards Track documents.",
      "ja": "RFC 3967は、ラストコール通知に明示的downrefを呼び出す必要れ、低成熟度レベル（「downrefs」）で文書に引用規格を可能にするためのプロセスを指定します。その要件は、標準化過程文書でdownrefsを受け入れるにおけるIESGより柔軟にできるように、必要以上に厳格であることが証明されており、この文書の更新RFC 3967ました。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This memo documents an Internet Best Current Practice.",
      "ja": "このメモはインターネット最も良い現在の練習を説明します。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on BCPs is available in Section 2 of RFC 7841.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 BCPの詳細については、RFC 7841のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc8067.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc8067で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2017 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2017 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2\n2.  The IESG's Responsibility with Respect to Downrefs  . . . . .   2\n3.  Security Considerations . . . . . . . . . . . . . . . . . . .   3\n4.  Normative References  . . . . . . . . . . . . . . . . . . . .   3\nAuthor's Address  . . . . . . . . . . . . . . . . . . . . . . . .   3",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "[RFC3967] notes the importance of assuring that normative references from Standards Track and Best Current Practice (BCP) documents are appropriately mature, and specifies a process for allowing normative references to documents at lower maturity levels (\"downrefs\"). That process starts at IETF Last Call (see Section 3 of [RFC3967]):",
      "ja": "[RFC3967]は（BCP）の文書が適切に成熟している標準化過程と最も良い現在の練習からの引用規格を保証することの重要性を指摘し、下の成熟度レベル（「downrefs」）で、ドキュメントへの引用規格を可能にするためのプロセスを指定します。このプロセスは、（[RFC3967]のセクション3を参照）IETFラストコール開始時刻："
    },
    {
      "indent": 6,
      "text": "For Standards Track or BCP documents requiring normative reference to documents of lower maturity, the normal IETF Last Call procedure will be issued, with the need for the downward reference explicitly documented in the Last Call itself. Any community comments on the appropriateness of downward references will be considered by the IESG as part of its deliberations.",
      "ja": "下の成熟度のドキュメントへの引用規格を必要とする標準化過程やBCP文書の場合、通常のIETFラストコール手順は、明示的にラストコール自体に記載下向きの参照が必要で、発行されます。下方への参照の妥当性上の任意のコミュニティのコメントは、その審議の一環としてIESGによって考慮されます。"
    },
    {
      "indent": 3,
      "text": "Section 2 of [RFC3967] lists some conditions under which downrefs may make sense. In addition to those, it has become common for working groups to produce foundational documents (which contain important information such as terminology definitions and architectural design and considerations) at Informational status, and those documents are often needed as normative references in the Standards Track protocol documents that follow.",
      "ja": "[RFC3967]の第2節では、downrefsは意味をなさない可能性があるの下に、いくつかの条件を示しています。これらに加えて、それは情報ステータスで（などの用語の定義と建築デザインとの配慮などの重要な情報が含まれている）基礎文書を生成するためにグループを操作するための一般的になっていると、それらの文書は、多くの場合、標準化過程プロトコル文書の引用規格として必要とされていますそれが続きます。"
    },
    {
      "indent": 3,
      "text": "The requirement to explicitly mention the downrefs and the need for them in the Last Call message has proven to be unnecessarily restrictive and has often resulted in unnecessary repetitions of Last Call, with the corresponding delay and with no real benefit.",
      "ja": "明示的downrefsとラストコールメッセージにそれらの必要性を言及するための要件は、不必要に制限的であることが証明され、多くの場合、対応する遅延でなし本当の利点で、ラストコールの不必要な繰り返しをもた​​らしました。"
    },
    {
      "indent": 0,
      "text": "2. The IESG's Responsibility with Respect to Downrefs",
      "section_title": true,
      "ja": "Downrefsに関して2. IESGの責任"
    },
    {
      "indent": 3,
      "text": "The process in RFC 3967 is hereby updated to specify that explicitly documenting the downward references in the Last Call message is strongly recommended but not required. The responsible AD should still check for downrefs before sending out the Last Call notice, but if an undetected downref is noticed during Last Call or IESG review, any need to repeat the Last Call is at the discretion of the IESG. However, the process in RFC 3967 is not fundamentally altered: If the IESG decides not to repeat the Last Call, the status of the affected downrefs is not changed, and the process in RFC 3967 will still apply if those downrefs are used in the future.",
      "ja": "RFC 3967での処理は、ここに強く推奨され、明示的にラストコールメッセージに下向きの参照を文書化することを指定するには、更新が、必須ではありません。責任ADはまだラストコール通知を送信する前にdownrefsをチェックする必要がありますが、検出されないdownrefがラストコールまたはIESGレビューの間注目されている場合は、最後のコールを繰り返しする必要はIESGの裁量です。しかし、RFC 3967の処理は基本的に変更されていません：IESG最終コールを繰り返していないことを決定した場合、影響を受けたdownrefsのステータスが変更されず、それらのdownrefsは、将来的に使用されている場合は、RFC 3967でプロセスがまだ適用されます。"
    },
    {
      "indent": 3,
      "text": "This gives the IESG the responsibility to determine the actual maturity level of the downward reference with respect to the document at hand, and to decide whether or not it is necessary to explicitly ask the IETF community for comments on the downref on a case-by-case basis. In making that decision, the IESG should take into account the general discussion in RFC 3967. The responsible AD should make sure that the omission is recorded as a comment in the datatracker.",
      "ja": "これはIESGに手で文書に関して下向き参照の実際の成熟度レベルを決定するために、明示的にケースバイにdownrefにコメントをIETFコミュニティに依頼する必要があるかどうかを決定するために責任を与えますケースごと。その決定を行う際に、IESGは考慮に責任ADが漏れがdatatrackerにコメントとして記録されていることを確認する必要があるRFC 3967.で一般的な議論を取る必要があります。"
    },
    {
      "indent": 0,
      "text": "3. Security Considerations",
      "section_title": true,
      "ja": "3.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "Referencing immature protocols can have security and stability implications, and the IESG should take that into account when deciding whether re-consulting the community is useful.",
      "ja": "未熟なプロトコルを参照すると、セキュリティと安定性の影響を持つことができ、かつ再コンサルティングコミュニティが有用であるかどうかを決定する際にIESGではこの点を考慮に入れなければなりません。"
    },
    {
      "indent": 0,
      "text": "4. Normative References",
      "section_title": true,
      "ja": "4.引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC3967] Bush, R. and T. Narten, \"Clarifying when Standards Track Documents may Refer Normatively to Documents at a Lower Level\", BCP 97, RFC 3967, DOI 10.17487/RFC3967, December 2004, <http://www.rfc-editor.org/info/rfc3967>.",
      "ja": "[RFC3967]ブッシュ、R.とT. Narten氏、 \"標準化過程文書は、下位レベルのドキュメントを参照してください規範的かもしれとき明確化\"、BCP 97、RFC 3967、DOI 10.17487 / RFC3967、2004年12月、<のhttp：// WWW。 rfc-editor.org/info/rfc3967>。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Barry Leiba Huawei Technologies",
      "ja": "バリー・レイバ、華為技術"
    },
    {
      "indent": 3,
      "text": "Phone: +1 646 827 0648 Email: barryleiba@computer.org URI: http://internetmessagingtechnology.org/",
      "ja": "電話：+1 646 827 0648 Eメール：barryleiba@computer.org URI：http://internetmessagingtechnology.org/"
    }
  ]
}