{
  "title": {
    "text": "RFC 4770 - vCard Extensions for Instant Messaging (IM)",
    "ja": "RFC 4770 - インスタントメッセージングのためのvCardの拡張機能（IM）"
  },
  "number": 4770,
  "created_at": "2019-10-26 07:24:19.958388+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                        C. Jennings\nRequest for Comments: 4770                                 Cisco Systems\nCategory: Standards Track                                J. Reschke, Ed.\n                                                              greenbytes\n                                                            January 2007",
      "raw": true
    },
    {
      "indent": 14,
      "text": "vCard Extensions for Instant Messaging (IM)",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The IETF Trust (2007).",
      "ja": "著作権（C）IETFトラスト（2007）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document describes an extension to vCard to support Instant Messaging (IM) and Presence Protocol (PP) applications. IM and PP are becoming increasingly common ways of communicating, and users want to save this contact information in their address books. It allows a URI that is associated with IM or PP to be specified inside a vCard.",
      "ja": "この文書では、インスタントメッセージング（IM）およびプレゼンスプロトコル（PP）アプリケーションをサポートするためのvCardへの拡張について説明します。 IMおよびPPは、通信のますます一般的な方法になりつつあり、ユーザーは自分のアドレス帳でのこの連絡先情報を保存したいです。それは、IM又はPPをvCardの内側に指定するに関連付けられているURIを可能にします。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Overview ........................................................2\n2. IANA Considerations .............................................3\n3. Formal Grammar ..................................................4\n4. Example .........................................................4\n5. Security Considerations .........................................4\n6. Acknowledgments .................................................4\n7. References ......................................................5\n   7.1. Normative References .......................................5\n   7.2. Informational References ...................................5",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Overview",
      "section_title": true,
      "ja": "1。概要"
    },
    {
      "indent": 3,
      "text": "As more and more people use various instant messaging (IM) and presence protocol (PP) applications, it becomes important for them to be able to share this contact address information, along with the rest of their contact information. RFC 2425 [1] and RFC 2426 [2] define a standard format for this information, which is referred to as vCard. This document defines a new type in a vCard for representing instant IM and PP URIs. It is very similar to existing types for representing email address and telephone contact information.",
      "ja": "より多くの人々が様々なインスタントメッセージング（IM）およびプレゼンスプロトコル（PP）アプリケーションを使用し、それらに自分の連絡先情報の残りの部分と一緒に、この連絡先情報を共有できるようにするために、それが重要になります。 RFC 2425 [1]及びRFC 2426 [2]のvCardと呼ばれるこの情報、のための標準フォーマットを定義します。この文書は、インスタントIM及びPP URIを表現するためのvCardの新しいタイプを定義します。これは、電子メールアドレスと電話の連絡先情報を表現するための既存のタイプと非常に似ています。"
    },
    {
      "indent": 3,
      "text": "The type entry to hold this new contact information is an IMPP type. The IMPP entry has a single URI (see RFC 3986 [3]) that indicates the address of a service that provides IM, PP, or both. Also defined are some parameters that give hints as to when certain URIs would be appropriate. A given vCard can have multiple IMPP entries, but each entry can contain only one URI. Each IMPP entry can contain multiple parameters. Any combination of parameters is valid, although a parameter should occur, at most, once in a given IMPP entry.",
      "ja": "この新しい連絡先情報を保持するタイプのエントリは、IMPPタイプです。 IMPPエントリはIM、PP、またはその両方を提供するサービスのアドレスを示す（RFC 3986 [3]を参照）は、単一のURIを有します。また、特定のURIが適切であろうがある場合のヒントを与えるいくつかのパラメータがある定義されました。与えられたvCardのは、複数のIMPPエントリを持つことができますが、各エントリは1つのURIのみを含めることができます。各IMPPエントリは、複数のパラメータを含めることができます。パラメータは、一度与えられたIMPPエントリで、最大で、起こるべきであるが、パラメータの任意の組み合わせは、有効です。"
    },
    {
      "indent": 3,
      "text": "The type of URI indicates what protocols might be usable for accessing it, but this document does not define any of the types. For example, a URI type of",
      "ja": "URIのタイプは、プロトコルがそれにアクセスするために使用できるかもしれないものを示しているが、この文書では、タイプのいずれかを定義していません。例えば、URIタイプの"
    },
    {
      "indent": 3,
      "text": "o \"sip\" [5] indicates to use SIP/SIMPLE, o \"xmpp\" [6] indicates to use XMPP, o \"irc\" indicates to use IRC, o \"ymsgr\" indicates to use yahoo, o \"msn\" might indicate to use Microsoft messenger, o \"aim\" indicates to use AOL, and o \"im\" [7] or \"pres\" [8] indicates that a CPIM or CPP gateway should be used.",
      "ja": "\"MSN\" が示すかもしれない〇〇 \"SIP\" が[5]、 \"XMPP\" は、[6] XMPPを使用することを示しているO、SIP / SIMPLEを使用することを示し、 \"IRC\" は、IRCを使用することを示しているO、O- \"ymsgr\" は、ヤフーを使用することを示し「目標」O、マイクロソフトメッセンジャーを使用すると、AOLを使用することを示し、およびo「IM」は、[7]または「PRES」[8] CPIMまたはCPPゲートウェイが使用されるべきであることを示しています。"
    },
    {
      "indent": 3,
      "text": "The normative definition of this new vCard type is given in Section 2, and an informational ABNF is provided in Section 3.",
      "ja": "この新しいvCardのタイプの規範的定義は、第2節で与えられ、および情報ABNFは、第3節で提供されています。"
    },
    {
      "indent": 0,
      "text": "2. IANA Considerations",
      "section_title": true,
      "ja": "2. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "The required email to define this extension (as defined in RFC 2425 [1]) was sent on October 29, 2004, to the ietf-mime-direct@imc.org mailing list with the subject \"Registration of text/directory MIME type IMPP\" (see <http://www.imc.org/ietf-mime-direct/mail-archive/msg00068.html>).",
      "ja": "（RFC 2425で定義されている[1]）は、この拡張機能を定義するために必要な電子メールはテキスト/ディレクトリMIMEタイプIMPPの「登録対象とietf-mime-direct@imc.orgメーリングリストに、2004年10月29日に送られました「（<http://www.imc.org/ietf-mime-direct/mail-archive/msg00068.html>参照）。"
    },
    {
      "indent": 3,
      "text": "This specification updates the \"text/directory MIME Types\" subregistry in the \"text/directory MIME Registrations\" registry at http://www.iana.org/assignments/text-directory-registrations with the following information:",
      "ja": "この仕様は、以下の情報をhttp://www.iana.org/assignments/text-directory-registrationsで「テキスト/ディレクトリMIME登録」レジストリに「テキスト/ディレクトリMIMEタイプの」副登録を更新します。"
    },
    {
      "indent": 3,
      "text": "Type name: IMPP",
      "ja": "型名：IMPP"
    },
    {
      "indent": 3,
      "text": "Type purpose: To specify the URI for instant messaging and presence protocol communications with the object the vCard represents.",
      "ja": "型の目的：vCardが表すオブジェクトとのインスタントメッセージングおよびプレゼンスプロトコル通信のためのURIを指定します。"
    },
    {
      "indent": 3,
      "text": "Type encoding: 8bit",
      "ja": "タイプのエンコード：8ビット"
    },
    {
      "indent": 3,
      "text": "Type value: A single URI. The type of the URI indicates the protocol that can be used for this contact.",
      "ja": "Type値：単一のURI。 URIの種類は、この接触のために使用することができるプロトコルを示しています。"
    },
    {
      "indent": 3,
      "text": "Type special notes: The type may include the type parameter \"TYPE\" to specify an intended use for the URI. The TYPE parameter values include one or more of the following:",
      "ja": "型の特別な備考：タイプは、URIの使用目的を指定するには、typeパラメータ「TYPE」を含むことが可能です。 TYPEパラメータ値は、以下の1つ以上を含みます："
    },
    {
      "indent": 3,
      "text": "o An indication of the type of communication for which this URI is appropriate. This can be a value of PERSONAL or BUSINESS.",
      "ja": "O通信のタイプの表示は、このURIが適切です。これは、個人やビジネスの値にすることができます。"
    },
    {
      "indent": 3,
      "text": "o An indication of the location of a device associated with this URI. Values can be HOME, WORK, or MOBILE.",
      "ja": "このURIに関連付けられたデバイスの位置の指示O。値は、HOME、WORK、あるいは移動することができます。"
    },
    {
      "indent": 3,
      "text": "o The value PREF indicates this is a preferred address and has the same semantics as the PREF value in a TEL type.",
      "ja": "値oをPREFは、これが好ましいアドレスであり、TELのタイプPREF値と同じセマンティクスを有することを示します。"
    },
    {
      "indent": 3,
      "text": "Additional information can be found in RFC 4770.",
      "ja": "追加情報は、RFC 4770に記載されています。"
    },
    {
      "indent": 3,
      "text": "Intended usage: COMMON",
      "ja": "意図している用法：COMMON"
    },
    {
      "indent": 0,
      "text": "3. Formal Grammar",
      "section_title": true,
      "ja": "3.形式文法"
    },
    {
      "indent": 3,
      "text": "The following ABNF grammar [4] extends the grammar found in RFC 2425 [1] (Section 5.8.2) and RFC 2426 [2] (Section 4).",
      "ja": "以下のABNF文法[4]は、RFC 2425 [1]（セクション5.8.2）とRFC 2426 [2]（第4章）に見出さ文法を拡張します。"
    },
    {
      "indent": 3,
      "text": ";For name=\"IMPP\" param = impp-param ; Only impp parameters are allowed",
      "ja": "：名前の戦争=「IMPP」のparam =統治のために。唯一の治世パラメータが許可されています"
    },
    {
      "indent": 4,
      "text": "value = URI ; URI defined in Section 3 of [3]",
      "ja": "値= URI。 [3]のセクション3で定義されたURI"
    },
    {
      "indent": 4,
      "text": "impp-param = \"TYPE\" \"=\" impp-type *(\",\" impp-type)",
      "ja": "皇帝-PARAM = \"タイプ\" \"=\" 皇帝型（ \"\" 皇帝型）"
    },
    {
      "indent": 4,
      "text": "impp-type = \"PERSONAL\" / \"BUSINESS\" / ; purpose of communications \"HOME\" / \"WORK\" / \"MOBILE\" / \"PREF\" / iana-token / x-name; ; Values are case insensitive",
      "ja": "IMPP型=「個人」/「ビジネス」/。通信 \"HOME\" / \"WORK\" / \"モバイル\" / \"PREF\" / IANA-トークン/ X-名の目的。 ;値は大文字と小文字を区別しません"
    },
    {
      "indent": 0,
      "text": "4. Example",
      "section_title": true,
      "ja": "4.例"
    },
    {
      "indent": 3,
      "text": "BEGIN:vCard VERSION:3.0 FN:Alice Doe IMPP;TYPE=personal,pref:im:alice@example.com END:vCard",
      "ja": "BEGIN：vCardのバージョン：3.0 FN：アリスドウIMPP; TYPE =個人、県：イム：alice@example.com END：vCardの"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "This does not introduce additional security issues beyond the current vCard specification. It is worth noting that many people consider their presence information more sensitive than other address information. Any system that stores or transfers vCards needs to carefully consider the privacy issues around this information.",
      "ja": "これは、現在のvCardの仕様を超える追加のセキュリティ問題を紹介しません。それは多くの人が他のアドレス情報よりも自分のプレゼンス情報がより敏感に考えることは注目に値します。店舗や転送vCardを慎重この情報の周りのプライバシーの問題を検討する必要のあるシステム。"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgments",
      "section_title": true,
      "ja": "6.謝辞"
    },
    {
      "indent": 3,
      "text": "Thanks to Brian Carpenter, Lars Eggert, Ted Hardie, Paul Hoffman, Sam Roberts, and Pekka Pessi for their comments.",
      "ja": "彼らのコメントのためのブライアン・カーペンター、ラースEggertの、テッドハーディー、ポール・ホフマン、サム・ロバーツ、そしてペッカPessiに感謝します。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7.参考"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "ja": "7.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[1] Howes, T., Smith, M., and F. Dawson, \"A MIME Content-Type for Directory Information\", RFC 2425, September 1998.",
      "ja": "[1]ハウズ、T.、スミス、M.、およびF.ドーソン、 \"ディレクトリ情報のMIMEのContent-Type\"、RFC 2425、1998年9月。"
    },
    {
      "indent": 3,
      "text": "[2] Dawson, F. and T. Howes, \"vCard MIME Directory Profile\", RFC 2426, September 1998.",
      "ja": "[2]ドーソン、F.とT.ハウズ、 \"vCardのMIMEディレクトリプロフィール\"、RFC 2426、1998年9月を。"
    },
    {
      "indent": 3,
      "text": "[3] Berners-Lee, T., Fielding, R., and L. Masinter, \"Uniform Resource Identifier (URI): Generic Syntax\", STD 66, RFC 3986, January 2005.",
      "ja": "[3]バーナーズ - リー、T.、フィールディング、R.、およびL. Masinter、 \"ユニフォームリソース識別子（URI）：汎用構文\"、STD 66、RFC 3986、2005年1月。"
    },
    {
      "indent": 3,
      "text": "[4] Crocker, D., Ed. and P. Overell, \"Augmented BNF for Syntax Specifications: ABNF\", RFC 4234, October 2005.",
      "ja": "[4]クロッカー、D.、エド。そして、P. Overell、 \"構文仕様のための増大しているBNF：ABNF\"、RFC 4234、2005年10月。"
    },
    {
      "indent": 0,
      "text": "7.2. Informational References",
      "section_title": true,
      "ja": "7.2。情報の参照"
    },
    {
      "indent": 3,
      "text": "[5] Rosenberg, J., Schulzrinne, H., Camarillo, G., Johnston, A., Peterson, J., Sparks, R., Handley, M., and E. Schooler, \"SIP: Session Initiation Protocol\", RFC 3261, June 2002.",
      "ja": "[5]ローゼンバーグ、J.、Schulzrinneと、H.、カマリロ、G.、ジョンストン、A.、ピーターソン、J.、スパークス、R.、ハンドレー、M.、およびE.学生、 \"SIP：セッション開始プロトコル\" 、RFC 3261、2002年6月。"
    },
    {
      "indent": 3,
      "text": "[6] Saint-Andre, P., \"Internationalized Resource Identifiers (IRIs) and Uniform Resource Identifiers (URIs) for the Extensible Messaging and Presence Protocol (XMPP)\", RFC 4622, July 2006.",
      "ja": "[6]サンアンドレ、P.、「国際化資源識別子（IRIを）および拡張メッセージングおよびプレゼンスプロトコル（XMPP）のためのユニフォームリソース識別子（URI）」、RFC 4622、2006年7月。"
    },
    {
      "indent": 3,
      "text": "[7] Peterson, J., \"Common Profile for Instant Messaging (CPIM)\", RFC 3860, August 2004.",
      "ja": "[7]ピーターソン、J.、RFC 3860、2004年8月 \"インスタントメッセージング（CPIM）のための共通プロファイル\"。"
    },
    {
      "indent": 3,
      "text": "[8] Peterson, J., \"Common Profile for Presence (CPP)\", RFC 3859, August 2004.",
      "ja": "[8]ピーターソン、J.、RFC 3859、2004年8月、 \"共通プロファイルプレゼンス（CPP）のために\"。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Cullen Jennings Cisco Systems 170 West Tasman Drive MS: SJC-21/2 San Jose, CA 95134 USA",
      "ja": "カレンジェニングスシスコシステムズ170西タスマンドライブMS：SJC-2分の21サンノゼ、CA 95134 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 408 902-3341 EMail: fluffy@cisco.com",
      "ja": "電話：+1 408 902-3341 Eメール：fluffy@cisco.com"
    },
    {
      "indent": 3,
      "text": "Julian F. Reschke (editor) greenbytes GmbH Hafenweg 16 Muenster, NW 48155 Germany",
      "ja": "ジュリアンF. Reschke（エディタ）greenbytes社Hafenweg 16ミュンスター、NW 48155ドイツ"
    },
    {
      "indent": 3,
      "text": "Phone: +49 251 2807760 EMail: julian.reschke@greenbytes.de",
      "ja": "電話：+49 251 2807760 Eメール：julian.reschke@greenbytes.de"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The IETF Trust (2007).",
      "ja": "著作権（C）IETFトラスト（2007）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "この文書では、BCP 78に含まれる権利と許可と制限の適用を受けており、その中の記載を除いて、作者は彼らのすべての権利を保有します。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE IETF TRUST, AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書およびここに含まれる情報は、上に提供される基礎とCONTRIBUTOR、ORGANIZATION彼/彼女が表すOR（もしあれば）後援が「そのまま」、インターネット学会、IETFトラスト、インターネットエンジニアリングタスクフォース放棄情報の利用は、特定の目的に対する権利または商品性または適合性の黙示の保証を侵害しない任意の保証含むがこれらに限定されないすべての保証、明示または黙示、。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、本書またはそのような権限下で、ライセンスがたりないかもしれない程度に記載された技術の実装や使用に関係すると主張される可能性があります任意の知的財産権やその他の権利の有効性または範囲に関していかなる位置を取りません利用可能です。またそれは、それがどのような権利を確認する独自の取り組みを行ったことを示すものでもありません。 RFC文書の権利に関する手続きの情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IPRの開示のコピーが利用できるようにIETF事務局とライセンスの保証に行われた、または本仕様の実装者または利用者がそのような所有権の使用のための一般的なライセンスまたは許可を取得するために作られた試みの結果を得ることができますhttp://www.ietf.org/iprのIETFのオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、その注意にこの標準を実装するために必要とされる技術をカバーすることができる任意の著作権、特許または特許出願、またはその他の所有権を持ってすべての利害関係者を招待します。 ietf-ipr@ietf.orgのIETFに情報を記述してください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "了承"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}