{
  "title": {
    "text": "RFC 8145 - Signaling Trust Anchor Knowledge in DNS Security Extensions (DNSSEC)",
    "ja": "RFC 8145 - DNSセキュリティ拡張機能（DNSSEC）でシグナリングトラストアンカー知識"
  },
  "number": 8145,
  "created_at": "2019-10-23 22:11:03.223683+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                        D. Wessels\nRequest for Comments: 8145                                      Verisign\nCategory: Standards Track                                      W. Kumari\nISSN: 2070-1721                                                   Google\n                                                              P. Hoffman\n                                                                   ICANN\n                                                              April 2017",
      "raw": true
    },
    {
      "indent": 2,
      "text": "Signaling Trust Anchor Knowledge in DNS Security Extensions (DNSSEC)",
      "ja": "DNSセキュリティ拡張機能（DNSSEC）でシグナリングトラストアンカー知識"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "The DNS Security Extensions (DNSSEC) were developed to provide origin authentication and integrity protection for DNS data by using digital signatures. These digital signatures can be verified by building a chain of trust starting from a trust anchor and proceeding down to a particular node in the DNS. This document specifies two different ways for validating resolvers to signal to a server which keys are referenced in their chain of trust. The data from such signaling allow zone administrators to monitor the progress of rollovers in a DNSSEC-signed zone.",
      "ja": "DNSセキュリティ拡張機能（DNSSEC）は、デジタル署名を使用してDNSデータの発信元の認証と完全性保護を提供するために開発されました。これらのデジタル署名は、信頼アンカーから始まる信頼の連鎖を構築し、DNS内の特定のノードまで進むことによって確認することができます。この文書では、鍵は信頼の彼らの連鎖の中で参照されているサーバに通知するためにリゾルバを検証するための2種類の方法を指定します。そのようなシグナリングデータは、ゾーン管理者は、DNSSEC署名ゾーンにおけるロールオーバーの進行状況を監視することを可能にします。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 7841.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 7841のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc8145.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc8145で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2017 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2017 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n   1.1. Design Evolution ...........................................4\n2. Requirements Terminology ........................................5\n3. Terminology .....................................................5\n4. Using the edns-key-tag Option ...................................5\n   4.1. Option Format ..............................................5\n   4.2. Use by Queriers ............................................6\n        4.2.1. Stub Resolvers ......................................7\n               4.2.1.1. Validating Stub Resolvers ..................7\n               4.2.1.2. Non-validating Stub Resolvers ..............7\n        4.2.2. Recursive Resolvers .................................7\n               4.2.2.1. Validating Recursive Resolvers .............7\n               4.2.2.2. Non-validating Recursive Resolvers .........8\n   4.3. Use by Responders ..........................................8\n5. Using the Key Tag Query .........................................8\n   5.1. Query Format ...............................................8\n   5.2. Use by Queriers ............................................9\n   5.3. Use by Responders ..........................................9\n        5.3.1. Interaction with Aggressive Negative Caching ........9\n6. IANA Considerations ............................................10\n7. Security Considerations ........................................10\n8. Privacy Considerations .........................................11\n9. References .....................................................11\n   9.1. Normative References ......................................11\n   9.2. Informative References ....................................12\nAcknowledgments ...................................................13\nAuthors' Addresses ................................................13",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "The DNS Security Extensions (DNSSEC) [RFC4033] [RFC4034] [RFC4035] were developed to provide origin authentication and integrity protection for DNS data by using digital signatures. DNSSEC uses Key Tags to efficiently match signatures to the keys from which they are generated. The Key Tag is a 16-bit value computed from the RDATA portion of a DNSKEY resource record (RR) using a formula not unlike a ones-complement checksum. RRSIG RRs contain a Key Tag field whose value is equal to the Key Tag of the DNSKEY RR that validates the signature.",
      "ja": "DNSセキュリティ拡張機能（DNSSEC）[RFC4033] [RFC4034] [RFC4035]はデジタル署名を使用してDNSデータの発信元の認証と完全性保護を提供するために開発されました。 DNSSECは、効率的に、それらが生成されたキーに署名を一致させるためにキータグを使用しています。鍵タグはないもの補数チェックサムとは異なり、式を用いてDNSKEYリソースレコード（RR）のRDATA部分から計算さ16ビットの値です。 RRSIG RRは、その値は、署名を検証するDNSKEY RRの鍵タグと等しい鍵タグフィールドを含みます。"
    },
    {
      "indent": 3,
      "text": "Likewise, Delegation Signer (DS) RRs also contain a Key Tag field whose value is equal to the Key Tag of the DNSKEY RR to which it refers.",
      "ja": "同様に、委任署名者（DS）RRはまた、その値は、それが参照するDNSKEY RRの鍵タグと等しい鍵タグフィールドを含みます。"
    },
    {
      "indent": 3,
      "text": "This document specifies how validating resolvers can tell a server, in a DNS query, which DNSSEC key(s) they would use to validate the server's responses. It describes two independent methods for conveying Key Tag information between clients and servers:",
      "ja": "この文書では、検証リゾルバがDNSSECキー（s）は、彼らがサーバーの応答を検証するために使用した、DNSクエリで、サーバーを伝えることができる方法を指定します。これは、クライアントとサーバ間の鍵タグ情報を伝達するための2つの独立した方法を説明します。"
    },
    {
      "indent": 3,
      "text": "1. placing an EDNS option in the OPT RR [RFC6891] that contains the Key Tags (described in Section 4)",
      "ja": "1.キータグを含むOPTのRR [RFC6891]でEDNSオプションを確定する（セクション4を参照）"
    },
    {
      "indent": 3,
      "text": "2. periodically sending special \"Key Tag queries\" to a server authoritative for the zone (described in Section 5)",
      "ja": "2.定期的に（第5節で説明）ゾーンの権限サーバに特別な「鍵タグのクエリを」送ります"
    },
    {
      "indent": 3,
      "text": "Each of these new signaling mechanisms is OPTIONAL to implement and use. These mechanisms serve to measure the acceptance and use of new DNSSEC trust anchors and key signing keys (KSKs). This signaling data can be used by zone administrators as a gauge to measure the successful deployment of new keys. This is of particular interest for the DNS root zone in the event of key and/or algorithm rollovers that rely on [RFC5011] to automatically update a validating DNS resolver's trust anchor.",
      "ja": "これらの新しいシグナル伝達機構のそれぞれは、実装して使用するには、オプションです。これらのメカニズムは、新しいDNSSECトラストアンカーと鍵署名鍵（KSKs）の受け入れと使用を測定するのに役立ちます。このシグナリングデータは、新しいキーの導入を成功さを測定するためのゲージとして、ゾーン管理者が使用することができます。これは自動的に有効DNSリゾルバのトラストアンカーを更新するために、[RFC5011]に依存しているキーおよび/またはアルゴリズムのロールオーバーが発生した場合にDNSのルートゾーンのために特に重要です。"
    },
    {
      "indent": 3,
      "text": "This document does not introduce new processes for rolling keys or updating trust anchors. Rather, it specifies a means by which a DNS query can signal the set of keys that a client uses for DNSSEC validation.",
      "ja": "この文書では、キーを転がすか、トラストアンカーを更新するための新しいプロセスを導入していません。むしろ、それは、DNSクエリは、クライアントがDNSSECの検証に使用するキーのセットを知らせることができる手段を指定します。"
    },
    {
      "indent": 0,
      "text": "1.1. Design Evolution",
      "section_title": true,
      "ja": "1.1。デザインの進化"
    },
    {
      "indent": 3,
      "text": "Initially, when the work on this document started, it proposed including Key Tag values in a new EDNS(0) option code. It was modeled after [RFC6975], which provides DNSSEC algorithm signaling.",
      "ja": "この文書に関する作業が始まったときに最初に、それは新しいEDNS（0）オプション・コード内の鍵タグ値を含む提案しました。これはDNSSECアルゴリズムシグナルを提供する[RFC6975]、後にモデル化されました。"
    },
    {
      "indent": 3,
      "text": "The authors received feedback from participants in the DNSOP Working Group that it might be better to convey Key Tags in the QNAME of a separate DNS query, rather than as an EDNS(0) option. Mostly, this is because forwarding (e.g., from stub to recursive to authoritative) could be problematic. Reasons include the following:",
      "ja": "著者は、別のDNSクエリのQNAMEではなく、EDNS（0）オプションとしてキータグを伝えるために、より良いかもしれないとDNSOP作業部会の参加者からのフィードバックを受けました。転送が（例えば、権威への再帰するスタブから）問題となる可能性があるため、主に、これは。理由は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "1. EDNS(0) is a hop-by-hop protocol. Unknown option codes would not be forwarded by default, as per [RFC6891].",
      "ja": "1. EDNS（0）は、ホップバイホッププロトコルです。不明なオプションコードは[RFC6891]に従って、デフォルトで転送されることはありません。"
    },
    {
      "indent": 3,
      "text": "2. Middleboxes might block entire queries containing unknown EDNS(0) option codes.",
      "ja": "2.のMiddleboxesは不明EDNS（0）オプションコードを含む全体のクエリをブロックする可能性があります。"
    },
    {
      "indent": 3,
      "text": "3. A recursive resolver might need to remember Key Tag values (i.e., keep state) received from its stub clients and then forward them at a later opportunity.",
      "ja": "3.再帰リゾルバは（すなわち、状態を保つには）そのスタブクライアントから受け取った鍵タグ値を覚えていて、後で機会にそれらを転送する必要がある場合があります。"
    },
    {
      "indent": 3,
      "text": "One advantage of the EDNS(0) option code is that it is possible to see that a stub client has a different Key Tag list than its forwarder. In the QNAME-based approach, this is not possible because queries originated by a stub and a forwarder are indistinguishable. The authors feel that this advantage is not sufficient to justify the EDNS(0) approach.",
      "ja": "EDNS（0）オプションコードの利点の一つは、スタブクライアントがそのフォワーダとは異なる鍵タグリストを持っていることを確認することが可能であるということです。スタブおよびフォワーダによって発信クエリは区別できないので、QNAMEベースのアプローチでは、これは不可能です。著者は、この利点は、EDNS（0）アプローチを正当化するのに十分ではないと感じています。"
    },
    {
      "indent": 3,
      "text": "One downside to the QNAME approach is that it uses a separate query, whereas with EDNS(0) the Key Tag values are \"piggybacked\" onto an existing DNSKEY query. For this reason, this document recommends only sending QNAME-based Key Tag queries for trust anchors, although EDNS-based Key Tags can be sent with any DNSKEY query.",
      "ja": "QNAMEアプローチの一つの欠点は、EDNS（0）鍵タグ値は、既存のDNSKEYクエリ上に「ピギーバック」である一方、それは、別のクエリを使用することです。 EDNSベースのキータグは任意のDNSKEYクエリを送信することができますが、このような理由から、このドキュメントは、信頼アンカーのためのQNAMEベースの鍵タグクエリを送信することをお勧めします。"
    },
    {
      "indent": 3,
      "text": "Another downside to the QNAME-based approach is that since the trust anchor zone might not contain labels matching the QNAME, these queries could be subject to aggressive negative caching features now in development by the Working Group. This could affect the amount of signaling sent by some clients compared to others.",
      "ja": "QNAMEベースのアプローチのもう一つの欠点は、トラストアンカーゾーンがQNAMEに一致するラベルが含まれていないかもしれないので、これらのクエリは、ワーキンググループによって開発中で、今積極的な負のキャッシング機能の対象となる可能性があることです。これは他の人に比べていくつかのクライアントによって送信されるシグナリング量に影響を与える可能性があります。"
    },
    {
      "indent": 3,
      "text": "A probably minor downside to the QNAME-based approach is that it cannot be used with extremely long query names if the addition of the prefix would cause the name to be longer than 255 octets.",
      "ja": "QNAMEベースのアプローチに、おそらくマイナーな欠点は、接頭辞の付加は名前が255オクテットよりも長くする原因となる場合、それは非常に長いクエリ名に使用できないということです。"
    },
    {
      "indent": 0,
      "text": "2. Requirements Terminology",
      "section_title": true,
      "ja": "2.要件用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "3. Terminology",
      "section_title": true,
      "ja": "3.用語"
    },
    {
      "indent": 3,
      "text": "Trust Anchor: A configured DNSKEY RR or DS RR hash of a DNSKEY RR. A validating security-aware resolver uses this public key or hash as a starting point for building the authentication chain to a signed DNS response. In general, a validating resolver will have to obtain the initial values of its trust anchors via some secure or trusted means outside the DNS protocol. Presence of a trust anchor also implies that the resolver should expect the zone to which the trust anchor points to be signed. (This paragraph is quoted from Section 2 of [RFC4033].)",
      "ja": "トラストアンカー：構成されたDNSKEYのRRやDNSKEY RRのDS RRハッシュ。検証をセキュリティ対応リゾルバは、署名されたDNS応答への認証チェーンを構築するための出発点として、この公開キーまたはハッシュを使用しています。一般的には、検証をリゾルバは、DNSプロトコル外の一部のセキュアまたは信頼できる手段を介してそのトラストアンカーの初期値を取得する必要があります。トラストアンカーの存在はまた、リゾルバはゾーンがどのトラストアンカーポイントが署名することを期待すべきであることを意味します。 （この段落は、[RFC4033]の第2節から引用されています。）"
    },
    {
      "indent": 3,
      "text": "Key Tag: A 16-bit integer that identifies and enables efficient selection of DNSSEC public keys. A Key Tag value can be computed over the RDATA of a DNSKEY RR. The Key Tag field in the RRSIG and DS records can be used to help select the corresponding DNSKEY RR efficiently when more than one candidate DNSKEY RR is available. For most algorithms, the Key Tag is a simple 16-bit modular sum of the DNSKEY RDATA. See [RFC4034], Appendix B.",
      "ja": "キータグ：識別し、DNSSEC公開鍵の効率的な選択を可能にする16ビット整数。鍵タグ値はDNSKEY RRのRDATAにわたって計算することができます。 RRSIGおよびDSレコード内の鍵タグフィールドは、複数の候補DNSKEYのRRが利用可能な場合に効率的に対応するDNSKEY RRを選択するために使用することができ。ほとんどのアルゴリズムで、鍵タグはDNSKEY RDATAのシンプルな16ビットモジュール式の和です。 [RFC4034]を参照してください、付録B."
    },
    {
      "indent": 0,
      "text": "4. Using the edns-key-tag Option",
      "section_title": true,
      "ja": "4. EDNSキータグオプションの使用"
    },
    {
      "indent": 0,
      "text": "4.1. Option Format",
      "section_title": true,
      "ja": "4.1。オプションフォーマット"
    },
    {
      "indent": 3,
      "text": "The edns-key-tag option is encoded as follows:",
      "ja": "次のようにEDNSキータグオプションがエンコードされています。"
    },
    {
      "indent": 3,
      "text": "0                       8                      16\n+--+--+--+--+--+--+--+--+--+--+--+--+--+--+--+--+\n|                  OPTION-CODE                  |\n+--+--+--+--+--+--+--+--+--+--+--+--+--+--+--+--+\n|                 OPTION-LENGTH                 |\n+--+--+--+--+--+--+--+--+--+--+--+--+--+--+--+--+\n|                    KEY-TAG                    |\n+--+--+--+--+--+--+--+--+--+--+--+--+--+--+--+--+\n|                      ...                      /\n+--+--+--+--+--+--+--+--+--+--+--+--+--+--+--+--+ where:",
      "raw": true
    },
    {
      "indent": 3,
      "text": "OPTION-CODE: The EDNS0 option code assigned to edns-key-tag (14).",
      "ja": "OPTION-CODE：EDNSキータグ（14）に割り当てられたEDNS0オプションコード。"
    },
    {
      "indent": 3,
      "text": "OPTION-LENGTH: The value 2 x number of key-tag values present.",
      "ja": "OPTION-LENGTH：現在キータグ値の値が2 x個。"
    },
    {
      "indent": 3,
      "text": "KEY-TAG: One or more 16-bit Key Tag values ([RFC4034], Appendix B).",
      "ja": "KEY-TAG：1つ以上の16ビットの鍵タグ値（[RFC4034]、付録B）。"
    },
    {
      "indent": 0,
      "text": "4.2. Use by Queriers",
      "section_title": true,
      "ja": "4.2。クエリアで使用してください"
    },
    {
      "indent": 3,
      "text": "A validating resolver sets the edns-key-tag option in the OPT RR when sending a DNSKEY query. The validating resolver SHOULD also set the DNSSEC OK bit (also known as the DO bit) [RFC4035] to indicate that it wishes to receive DNSSEC RRs in the response.",
      "ja": "DNSKEYクエリを送信するときに、検証リゾルバはOPTのRRでEDNSキータグオプションを設定します。検証リゾルバはまた、応答にDNSSEC RRを受信したいことを示すためにDNSSEC OKビット（また、DOのビットとしても知られている）[RFC4035]を設定すべきです。"
    },
    {
      "indent": 3,
      "text": "A DNS client MUST NOT include the edns-key-tag option for non-DNSKEY queries.",
      "ja": "DNSクライアントは、非DNSKEYクエリのEDNSキータグオプションを含んではいけません。"
    },
    {
      "indent": 3,
      "text": "The KEY-TAG value(s) included in the edns-key-tag option represents the Key Tag of the trust anchor or DNSKEY RR that will be used to validate the expected response. When the client sends a DNSKEY query, the edns-key-tag option represents the Key Tag(s) of the KSK(s) of the zone for which the server is authoritative. A validating resolver learns the Key Tag(s) of the KSK(s) from the zone's DS record(s) (found in the parent) or from a trust anchor.",
      "ja": "KEY-TAG値（複数可）EDNSキータグオプションに含ま期待される応答を検証するために使用されるトラストアンカーまたはDNSKEY RRの鍵タグを表します。クライアントはDNSKEYクエリを送信すると、EDNSキータグオプションは、サーバーが権限を持つゾーンのKSK（S）の鍵タグ（複数可）を表しています。検証をリゾルバは、（親にあります）ゾーンのDSレコード（複数可）またはトラストアンカーからKSK（S）の鍵タグ（複数可）を学習します。"
    },
    {
      "indent": 3,
      "text": "A DNS client SHOULD include the edns-key-tag option when issuing a DNSKEY query for a zone corresponding to a trust anchor.",
      "ja": "トラストアンカーに対応するゾーンのDNSKEYクエリを発行するときにDNSクライアントがEDNSキータグオプションを含むべきです。"
    },
    {
      "indent": 3,
      "text": "A DNS client MAY include the edns-key-tag option when issuing a DNSKEY query for a non-trust anchor zone (i.e., Key Tags learned via DS records). Since some DNSSEC validators implement bottom-up validation, a non-trust anchor Key Tags zone might not be known at the time of the query. Such a validator can include the edns-key-tag option based on previously cached data.",
      "ja": "非トラストアンカーゾーンのDNSKEYクエリを発行するときにDNSクライアントが（すなわち、キータグはDSレコードを介して学習）EDNSキータグオプションを含むかもしれません。いくつかのDNSSECのバリデータは、ボトムアップの検証を実装するので、非トラストアンカーキータグゾーンは、クエリの時点で知られていない可能性があります。このようなバリデータは、以前にキャッシュされたデータに基づいてEDNSキータグオプションを含めることができます。"
    },
    {
      "indent": 3,
      "text": "A DNS client MUST NOT include Key Tag(s) for keys that are not learned via either a trust anchor or DS records.",
      "ja": "DNSクライアントは、トラストアンカーまたはDSレコードのいずれかを介して学習されていない鍵の鍵タグ（複数可）を含んではいけません。"
    },
    {
      "indent": 3,
      "text": "Since the edns-key-tag option is only set in the query, if a client sees these options in the response, no action needs to be taken and the client MUST ignore the option values.",
      "ja": "クライアントが応答でこれらのオプションを見ればEDNSキータグオプションはのみ、クエリに設定されているので、何もする必要はありませんし、クライアントがオプション値を無視しなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.2.1. Stub Resolvers",
      "section_title": true,
      "ja": "4.2.1。スタブリゾルバ"
    },
    {
      "indent": 3,
      "text": "Typically, stub resolvers rely on an upstream recursive resolver (or cache) to provide a response. Optimal setting of the edns-key-tag option depends on whether the stub resolver elects to perform its own validation.",
      "ja": "典型的には、スタブリゾルバは、応答を提供するために、上流の再帰リゾルバ（またはキャッシュ）に依存しています。 EDNSキータグオプションの最適な設定は、スタブリゾルバは、独自の検証を実行することを選択したかどうかに依存します。"
    },
    {
      "indent": 0,
      "text": "4.2.1.1. Validating Stub Resolvers",
      "section_title": true,
      "ja": "4.2.1.1。スタブリゾルバの検証"
    },
    {
      "indent": 3,
      "text": "A validating stub resolver sets the DNSSEC OK bit [RFC4035] to indicate that it wishes to receive additional DNSSEC RRs (i.e., RRSIG RRs) in the response. Such validating resolvers SHOULD include the edns-key-tag option in the OPT RR when sending a DNSKEY query.",
      "ja": "検証スタブリゾルバは、それが応答して追加のDNSSECのRR（すなわち、RRSIGのRR）を受信したいことを示すためにDNSSEC OKビット[RFC4035]を設定します。 DNSKEYクエリを送信するときに、このような検証をリゾルバは、OPTのRRでEDNSキータグオプションを含むべきです。"
    },
    {
      "indent": 0,
      "text": "4.2.1.2. Non-validating Stub Resolvers",
      "section_title": true,
      "ja": "4.2.1.2。スタブリゾルバを非検証"
    },
    {
      "indent": 3,
      "text": "The edns-key-tag option MUST NOT be included by non-validating stub resolvers.",
      "ja": "EDNSキータグオプションは、非検証のスタブリゾルバによって含んではいけません。"
    },
    {
      "indent": 0,
      "text": "4.2.2. Recursive Resolvers",
      "section_title": true,
      "ja": "4.2.2。再帰リゾルバ"
    },
    {
      "indent": 0,
      "text": "4.2.2.1. Validating Recursive Resolvers",
      "section_title": true,
      "ja": "4.2.2.1。再帰リゾルバの検証"
    },
    {
      "indent": 3,
      "text": "A validating recursive resolver is, by definition, configured with at least one trust anchor. Thus, a recursive resolver SHOULD include the edns-key-tag option in its DNSKEY queries as described above.",
      "ja": "検証再帰リゾルバは、定義により、少なくとも一つのトラストアンカーが設定されています。以上のように、再帰リゾルバはそのDNSKEYクエリでEDNSキータグオプションを含むべきです。"
    },
    {
      "indent": 3,
      "text": "In addition, the clients of a validating recursive resolver might be configured to do their own validation, with their own trust anchor(s). When a validating recursive resolver receives a query that includes the edns-key-tag option with a Key Tag list that differs from its own, it SHOULD forward both the client's Key Tag list and its own list. When doing so, the recursive resolver SHOULD transmit the two Key Tag lists using separate instances of the edns-key-tag option code in the OPT RR. For example, if the recursive resolver's Key Tag list is (19036, 12345) and the stub/client's list is (19036, 34567), the recursive resolver would include the edns-key-tag option twice: once with values (19036, 12345) and once with values (19036, 34567).",
      "ja": "また、検証を再帰的なレゾルバのクライアントは、独自のトラストアンカー（S）と、独自の検証を行うように構成することがあります。検証を再帰リゾルバは、独自異なり鍵タグリストとEDNSキータグオプションを含むクエリを受け取ると、それは、クライアントの鍵タグリストと独自のリストの両方を転送する必要があります。その際、再帰リゾルバはOPTのRRでEDNSキータグオプションコードの別々のインスタンスを使用して2つの鍵タグリストを送信しなければなりません。再帰リゾルバの鍵タグリストは（19036、12345）で、スタブ/クライアントのリストは（19036、34567）であれば、例えば、再帰リゾルバは二回EDNSキータグオプションが含まれます：一度値（19036、12345で）と値（19036、34567）で1回。"
    },
    {
      "indent": 3,
      "text": "A validating recursive resolver MAY combine stub/client Key Tag values from multiple incoming queries into a single outgoing query. It is RECOMMENDED that implementations place reasonable limits on the number of Key Tags to include in the outgoing edns-key-tag option.",
      "ja": "検証を再帰リゾルバは、単一の発信問合せに複数の着信クエリからスタブ/クライアント鍵タグ値を組み合わせることができます。実装は、発信EDNSキータグオプションに含めるキータグの数の合理的な制限を置くことが推奨されます。"
    },
    {
      "indent": 3,
      "text": "If the client included the DNSSEC OK and Checking Disabled (CD) bits but did not include the edns-key-tag option in the query, the validating recursive resolver MAY include the option with its own Key Tag values in full.",
      "ja": "クライアントがDNSSEC OKとチェック無効（CD）ビットが含まれていますが、クエリでEDNSキータグオプションが含まれていなかった場合は、検証を再帰リゾルバはいっぱいで、独自の鍵タグ値を持つオプションを含むかもしれません。"
    },
    {
      "indent": 3,
      "text": "Validating recursive resolvers MUST NOT set the edns-key-tag option in the final response to the stub client.",
      "ja": "検証再帰リゾルバは、スタブクライアントへの最終的な応答でEDNSキータグオプションを設定してはいけません。"
    },
    {
      "indent": 0,
      "text": "4.2.2.2. Non-validating Recursive Resolvers",
      "section_title": true,
      "ja": "4.2.2.2。再帰リゾルバを非検証"
    },
    {
      "indent": 3,
      "text": "Recursive resolvers that do not validate responses SHOULD copy the edns-key-tag option seen in received queries, as they represent the wishes of the validating downstream resolver that issued the original query.",
      "ja": "彼らは元のクエリを発行した検証を下流レゾルバの願いを表現するような応答を検証しません再帰リゾルバは、受け取ったクエリで見EDNSキータグオプションをコピーする必要があります。"
    },
    {
      "indent": 0,
      "text": "4.3. Use by Responders",
      "section_title": true,
      "ja": "4.3。レスポンダで使用"
    },
    {
      "indent": 3,
      "text": "An authoritative name server receiving queries with the edns-key-tag option MAY log or otherwise collect the Key Tag values to provide information to the zone operator.",
      "ja": "EDNSキータグオプションを使用してクエリを受ける権威ネームサーバは、ログインするか、そうでない場合は、ゾーンのオペレータに情報を提供するために、鍵タグ値を収集する場合があります。"
    },
    {
      "indent": 3,
      "text": "A responder MUST NOT include the edns-key-tag option in any DNS response.",
      "ja": "レスポンダは任意のDNS応答のEDNSキータグオプションを含んではいけません。"
    },
    {
      "indent": 0,
      "text": "5. Using the Key Tag Query",
      "section_title": true,
      "ja": "5.鍵タグのクエリを使用して"
    },
    {
      "indent": 0,
      "text": "5.1. Query Format",
      "section_title": true,
      "ja": "5.1。クエリフォーマット"
    },
    {
      "indent": 3,
      "text": "A Key Tag query consists of a standard DNS query of type NULL and of class IN [RFC1035].",
      "ja": "鍵タグ問合せは、タイプNULLのと[RFC1035]でクラスの標準DNSクエリで構成されています。"
    },
    {
      "indent": 3,
      "text": "The first component of the query name is the string \"_ta-\" followed by a sorted, hyphen-separated list of hexadecimal-encoded Key Tag values. The zone name corresponding to the trust anchor is appended to this first component.",
      "ja": "クエリ名の最初のコンポーネントは、文字列「_ta-」16進符号化された鍵タグ値のソートされ、ハイフンで区切られたリストが続きます。トラストアンカーに対応するゾーン名は、この最初のコンポーネントに追加されます。"
    },
    {
      "indent": 3,
      "text": "For example, a validating DNS resolver that has a single root zone trust anchor with Key Tag 17476 (decimal) would originate a query of the form QTYPE=NULL, QCLASS=IN, QNAME=_ta-4444.",
      "ja": "例えば、鍵タグ17476（10進数）を持つ単一のルートゾーンのトラストアンカーを持って検証をDNSリゾルバは、フォームのQTYPE = NULL、QCLASS =に、QNAME = _ta-4444のクエリを発信します。"
    },
    {
      "indent": 3,
      "text": "Hexadecimal values MUST be zero-padded to four hexadecimal digits. For example, if the Key Tag is 999 (decimal), it is represented in hexadecimal as 03e7.",
      "ja": "進数の値は、ゼロパディングされた4桁の16進数でなければなりません。キータグ999（10進数）である場合、例えば、それが03e7として進数で表されています。"
    },
    {
      "indent": 3,
      "text": "When representing multiple Key Tag values, they MUST be sorted in order from smallest to largest. For example, a validating DNS resolver that has three trust anchors for the example.com zone with Key Tags 1589, 43547, 31406 (decimal) would originate a query of the form QTYPE=NULL, QCLASS=IN, QNAME=_ta-0635-7aae-aa1b.example.com.",
      "ja": "複数の鍵タグ値を表すとき、彼らは、最小から最大までの順序でソートする必要があります。例えば、キータグ1589、43547、31406（10進数）でexample.comゾーンのための3つのトラストアンカーを持って検証をDNSリゾルバは、フォームのクエリQTYPE = NULL、QCLASS =に、QNAME = _ta-0635-を発信う7aae-aa1b.example.com。"
    },
    {
      "indent": 0,
      "text": "5.2. Use by Queriers",
      "section_title": true,
      "ja": "5.2。クエリアで使用してください"
    },
    {
      "indent": 3,
      "text": "A validating DNS resolver (stub or recursive) SHOULD originate a Key Tag query whenever it also originates a DNSKEY query for a trust anchor zone. In other words, the need to issue a DNSKEY query is also the trigger to issue a Key Tag query.",
      "ja": "それはまた、トラストアンカーゾーンのDNSKEYクエリを発信したときに検証をDNSリゾルバ（スタブまたは再帰）が鍵タグクエリーを発信すべきです。言い換えれば、DNSKEYクエリを発行する必要も鍵タグクエリを発行するためのトリガです。"
    },
    {
      "indent": 3,
      "text": "The value(s) included in the Key Tag query represents the Key Tag(s) of the trust anchor that will be used to validate the expected DNSKEY response.",
      "ja": "鍵タグクエリに含まれる値（複数可）、予想されるDNSKEY応答を検証するために使用されるトラストアンカーの鍵タグ（複数可）を表しています。"
    },
    {
      "indent": 3,
      "text": "A validating DNS resolver SHOULD NOT originate Key Tag queries when also originating DNSKEY queries for non-trust anchor zones.",
      "ja": "また、非トラストアンカーゾーンのDNSKEYクエリを発信する際に有効DNSリゾルバは鍵タグクエリーを発信すべきではありません。"
    },
    {
      "indent": 3,
      "text": "A non-validating DNS resolver MUST NOT originate Key Tag queries.",
      "ja": "非検証DNSリゾルバは鍵タグクエリーを発信してはなりません。"
    },
    {
      "indent": 3,
      "text": "DNS resolvers with caches SHOULD cache and reuse the response to a Key Tag query just as it would any other response.",
      "ja": "キャッシュを持つDNSリゾルバは、他の応答それは同じように鍵タグクエリに対する応答をキャッシュして再利用する必要があります。"
    },
    {
      "indent": 0,
      "text": "5.3. Use by Responders",
      "section_title": true,
      "ja": "5.3。レスポンダで使用"
    },
    {
      "indent": 3,
      "text": "An authoritative name server receiving Key Tag queries MAY log or otherwise collect the Key Tag values to provide information to the zone operator.",
      "ja": "鍵タグの問い合わせを受けた権威ネームサーバは、ログインするか、そうでない場合は、ゾーンのオペレータに情報を提供するために、鍵タグ値を収集する場合があります。"
    },
    {
      "indent": 3,
      "text": "An authoritative name server MUST generate an appropriate response to the Key Tag query. A server does not need to have built-in logic that determines the response to Key Tag queries: the response code is determined by whether the data is in the zone file or covered by wildcards. The zone operator might want to add specific Key Tag records to its zone, perhaps with specific TTLs, to affect the frequency of Key Tag queries from clients.",
      "ja": "権威ネームサーバは、鍵タグクエリに対する適切な応答を生成しなければなりません。応答コードは、データがゾーンファイルであるか、ワイルドカードでカバーするかどうかによって決定されます。サーバーは、鍵タグクエリに対する応答を決定し、組み込みのロジックを持っている必要はありません。ゾーンのオペレータは、クライアントからの鍵タグクエリの頻度に影響を与えるために、おそらく特定のTTLをして、そのゾーンに特定の鍵タグレコードを追加したい場合があります。"
    },
    {
      "indent": 0,
      "text": "5.3.1. Interaction with Aggressive Negative Caching",
      "section_title": true,
      "ja": "5.3.1。積極的なネガティブキャッシュとの対話"
    },
    {
      "indent": 3,
      "text": "Aggressive NSEC/NSEC3 negative caching [NSEC-NSEC3-Usage] may also affect the quality of Key Tag signaling. When the response code for a Key Tag query is NXDOMAIN, DNS resolvers that implement aggressive negative caching will send fewer Key Tag queries than resolvers that do not implement it.",
      "ja": "積極的なNSEC / NSEC3ネガティブキャッシュ[NSEC-NSEC3-使い方]も鍵タグシグナリングの品質に影響を与える可能性があります。鍵タグクエリに対する応答コードがNXDOMAINである場合には、積極的なネガティブキャッシュを実装するDNSリゾルバはそれを実装していないリゾルバよりも少ない鍵タグクエリを送信します。"
    },
    {
      "indent": 3,
      "text": "For this reason, zone operators might choose to create records corresponding to expected Key Tag queries. During a rollover from Key Tag 1111 (hex) to Key Tag 2222 (hex), the zone could include the following records:",
      "ja": "このため、ゾーンの事業者は、予想される主なタグクエリに対応するレコードを作成することもできます。鍵タグ2222（16進数）にキータグ1111（16進）からロールオーバー時には、ゾーンには、以下のレコードを含めることができます："
    },
    {
      "indent": 3,
      "text": "_ta-1111 IN NULL \\# 0 _ta-2222 IN NULL \\# 0 _ta-1111-2222 IN NULL \\# 0",
      "ja": "NULL \\＃0 _ta-2222、IN _ta 1111 nullを\\ NULLの＃0 _ta-1111から2222 \\＃0"
    },
    {
      "indent": 3,
      "text": "Recall that when multiple Key Tags are present, the originating client MUST sort them from smallest to largest in the query name.",
      "ja": "複数のキーのタグが存在する場合、元のクライアントは、クエリ名に最小から最大にそれらをソートしなければならないことを思い出してください。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has assigned an EDNS0 option code for the edns-key-tag option in the \"DNS EDNS0 Option Codes (OPT)\" registry as follows:",
      "ja": "次のようにIANAは、「DNS EDNS0オプションコード（OPT）」のレジストリでEDNSキータグオプションのEDNS0のオプションコードを割り当てています："
    },
    {
      "indent": 14,
      "text": "+-------+--------------+----------+-----------+\n| Value | Name         | Status   | Reference |\n+-------+--------------+----------+-----------+\n| 14    | edns-key-tag | Optional | RFC 8145  |\n+-------+--------------+----------+-----------+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "ja": "7.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document specifies two ways for a client to signal its trust anchor knowledge to a cache or server. The goal of these optional mechanisms is to signal new trust anchor uptake in clients to allow zone administrators to know when it is possible to complete a key rollover in a DNSSEC-signed zone.",
      "ja": "この文書では、キャッシュまたはサーバにそのトラストアンカー知識を知らせるために、クライアントのための二つの方法を指定します。これらのオプションのメカニズムの目標は、DNSSEC署名済みゾーンでのキーロールオーバーを完了することが可能であるとき、ゾーン管理者が知ることができるように、クライアントに新しいトラストアンカーの取り込みを通知することです。"
    },
    {
      "indent": 3,
      "text": "There is a possibility that an eavesdropper or server could infer the validator in use by a client by the Key Tag list seen. This may allow an attacker to find validators using old, possibly broken, keys. It could also be used to identify the validator or to narrow down the possible validator implementations in use by a client; the validator used by the client could have a known vulnerability that could be exploited by the attacker.",
      "ja": "盗聴者またはサーバーが見鍵タグリストによって、クライアントが使用してバリデータを推測することができる可能性があります。これにより、攻撃者は古い、おそらく壊れて、キーを使用してバリデータを見つけることができるようにします。また、バリデータを特定したり、クライアントで使用されている可能性バリデータの実装を絞り込むために使用することができ、クライアントが使用するバリデータは、攻撃者によって悪用される可能性があり、既知の脆弱性を持つことができます。"
    },
    {
      "indent": 3,
      "text": "Consumers of data collected from the mechanisms described in this document are advised that provided Key Tag values might be \"made up\" by some DNS clients with malicious, or at least mischievous, intentions. For example, an attacker with sufficient resources might try to generate large numbers of queries including only old Key Tag values, with the intention of delaying the completion of a key rollover.",
      "ja": "鍵タグ値を提供することをお勧めしているこのドキュメントで説明するメカニズムから収集されたデータの消費者は、悪質な、または少なくともいたずら、意図していくつかのDNSクライアントによって「作ら」される可能性があります。例えば、十分なリソースを持つ攻撃者は、キーロールオーバーの完了を遅らせることを意図して、唯一の古い鍵タグ値を含むクエリを大量に生成しようとします。"
    },
    {
      "indent": 3,
      "text": "DNSSEC does not require keys in a zone to have unique Key Tags. During a rollover, there is a small possibility that an old key and a new key will have identical Key Tag values. Zone operators relying on the edns-key-tag mechanism SHOULD take care to ensure that new keys have unique Key Tag values.",
      "ja": "DNSSECは、ユニークなキーのタグを持っているゾーン内のキーを必要としません。ロールオーバー時には、古いキーと新しいキーが同一の鍵タグ値を持つことを小さな可能性があります。 EDNSキータグメカニズムに依存するゾーン事業者は新しいキーがユニーク鍵タグ値を持っていることを確認するために注意する必要があります。"
    },
    {
      "indent": 0,
      "text": "8. Privacy Considerations",
      "section_title": true,
      "ja": "8.プライバシーに関する注意事項"
    },
    {
      "indent": 3,
      "text": "This proposal provides additional, optional \"signaling\" to DNS queries in the form of Key Tag values. While Key Tag values themselves are not considered private information, it may be possible for an eavesdropper to use Key Tag values as a fingerprinting technique to identify particular validating DNS clients. This may be especially true if the validator is configured with trust anchors for zones in addition to the root zone.",
      "ja": "この提案は、鍵タグ値の形でDNSクエリに追加、オプションの「シグナル」を提供します。鍵タグ値自体が個人情報とはみなされませんが、それは特定の検証用のDNSクライアントを識別するために、フィンガープリント技術として、鍵タグ値を使用する盗聴者のために可能かもしれません。バリデータは、ルートゾーンに加えて、ゾーンのトラストアンカーが設定されている場合、これは特にそうかもしれません。"
    },
    {
      "indent": 3,
      "text": "A validating resolver need not transmit the Key Tags in every applicable query. Due to privacy concerns, such a resolver MAY choose to transmit the Key Tags for a subset of queries (e.g., every 25th time) or by random chance with a certain probability (e.g., 5%).",
      "ja": "検証をリゾルバには、該当する各クエリにキータグを送信する必要はありません。プライバシーの問題のため、そのようなリゾルバは、クエリのサブセット（例えば、すべての25時間）または一定の確率（例えば、5％）との偶然によってキータグを送信するために選ぶかもしれません。"
    },
    {
      "indent": 3,
      "text": "Implementations of this specification MAY be administratively configured to only transmit the Key Tags for certain zones. For example, the software's configuration file may specify a list of zones for which the use of the mechanisms described here is allowed or denied. Since the primary motivation for this specification is to provide operational measurement data for root zone key rollovers, it is RECOMMENDED that implementations at least include the edns-key-tag option for root zone DNSKEY queries.",
      "ja": "この仕様の実装は、行政だけで、特定のゾーンのキータグを送信するように構成することができます。例えば、ソフトウェアの設定ファイルは、ここで説明するメカニズムの使用が許可または拒否されたゾーンのリストを指定することもできます。この仕様のための主な動機は、ルートゾーンキーロールオーバーのための動作の測定データを提供することであるので、少なくとも実装がルートゾーンのDNSKEYクエリのEDNSキータグオプションを含むことが推奨されます。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "ja": "9.参考文献"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "ja": "9.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC1035] Mockapetris, P., \"Domain names - implementation and specification\", STD 13, RFC 1035, DOI 10.17487/RFC1035, November 1987, <http://www.rfc-editor.org/info/rfc1035>.",
      "ja": "[RFC1035] Mockapetris、P.、 \"ドメイン名 - 実装及び仕様\"、STD 13、RFC 1035、DOI 10.17487 / RFC1035、1987年11月、<http://www.rfc-editor.org/info/rfc1035>。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<http://www.rfc-editor.org/info/ RFC2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC4033] Arends, R., Austein, R., Larson, M., Massey, D., and S. Rose, \"DNS Security Introduction and Requirements\", RFC 4033, DOI 10.17487/RFC4033, March 2005, <http://www.rfc-editor.org/info/rfc4033>.",
      "ja": "[RFC4033]アレンズ、R.、Austeinと、R.、ラーソン、M.、マッシー、D.、およびS.ローズ、 \"DNSセキュリティ序論と要件\"、RFC 4033、DOI 10.17487 / RFC4033、2005年3月、<のhttp： //www.rfc-editor.org/info/rfc4033>。"
    },
    {
      "indent": 3,
      "text": "[RFC4034] Arends, R., Austein, R., Larson, M., Massey, D., and S. Rose, \"Resource Records for the DNS Security Extensions\", RFC 4034, DOI 10.17487/RFC4034, March 2005, <http://www.rfc-editor.org/info/rfc4034>.",
      "ja": "[RFC4034]アレンズ、R.、Austeinと、R.、ラーソン、M.、マッシー、D.、およびS.ローズ、 \"DNSセキュリティ拡張機能のためのリソースレコード\"、RFC 4034、DOI 10.17487 / RFC4034、2005年3月、< http://www.rfc-editor.org/info/rfc4034>。"
    },
    {
      "indent": 3,
      "text": "[RFC4035] Arends, R., Austein, R., Larson, M., Massey, D., and S. Rose, \"Protocol Modifications for the DNS Security Extensions\", RFC 4035, DOI 10.17487/RFC4035, March 2005, <http://www.rfc-editor.org/info/rfc4035>.",
      "ja": "[RFC4035]アレンズ、R.、Austeinと、R.、ラーソン、M.、マッシー、D.、およびS.ローズ、 \"DNSセキュリティ拡張のためのプロトコル変更\"、RFC 4035、DOI 10.17487 / RFC4035、2005年3月、< http://www.rfc-editor.org/info/rfc4035>。"
    },
    {
      "indent": 3,
      "text": "[RFC6891] Damas, J., Graff, M., and P. Vixie, \"Extension Mechanisms for DNS (EDNS(0))\", STD 75, RFC 6891, DOI 10.17487/RFC6891, April 2013, <http://www.rfc-editor.org/info/rfc6891>.",
      "ja": "[RFC6891]ダマ、J.、Graffの、M.、およびP.いるVixie、 \"DNS用拡張メカニズム（EDNS（0））\"、STD 75、RFC 6891、DOI 10.17487 / RFC6891、2013年4月、<HTTP：// www.rfc-editor.org/info/rfc6891>。"
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "ja": "9.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[NSEC-NSEC3-Usage] Fujiwara, K., Kato, A., and W. Kumari, \"Aggressive use of DNSSEC-validated Cache\", Work in Progress, draft-ietf-dnsop-nsec-aggressiveuse-09, March 2017.",
      "ja": "[NSEC-NSEC3-使い方]藤原、K.、加藤、A.、およびW.クマリ、進行中で働いて、ドラフト-IETF-dnsop  - ナノ秒 -  aggressiveuse-09 \"DNSSEC検証済みキャッシュの積極的な利用\"、2017年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC5011] StJohns, M., \"Automated Updates of DNS Security (DNSSEC) Trust Anchors\", STD 74, RFC 5011, DOI 10.17487/RFC5011, September 2007, <http://www.rfc-editor.org/info/rfc5011>.",
      "ja": "[RFC5011] StJohns、M.、 \"DNSセキュリティの自動アップデート（DNSSEC）トラストアンカー\"、STD 74、RFC 5011、DOI 10.17487 / RFC5011、2007年9月、<http://www.rfc-editor.org/info/ RFC5011>。"
    },
    {
      "indent": 3,
      "text": "[RFC6975] Crocker, S. and S. Rose, \"Signaling Cryptographic Algorithm Understanding in DNS Security Extensions (DNSSEC)\", RFC 6975, DOI 10.17487/RFC6975, July 2013, <http://www.rfc-editor.org/info/rfc6975>.",
      "ja": "[RFC6975]クロッカー、S.とS.ローズ、DOI 10.17487 / RFC6975、RFC 6975、 \"DNSセキュリティ拡張機能（DNSSEC）でシグナリング暗号アルゴリズムの理解\"、2013年7月、<http://www.rfc-editor.org/情報/ rfc6975>。"
    },
    {
      "indent": 0,
      "text": "Acknowledgments",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "This document was inspired by and borrows heavily from [RFC6975] by Scott Rose and Steve Crocker. The authors would like to thank Mark Andrews, Casey Deccio, Burt Kalisky, Bob Harold, Edward Lewis, Tim Wicinski, Suzanne Woolf, and other members of the DNSOP Working Group for their input.",
      "ja": "この文書では、触発さとスコット・ローズとスティーブクロッカーによって、[RFC6975]から重く借りました。作者は彼らの入力のためにマーク・アンドリュース、ケーシーDeccio、バート・Kalisky、ボブ・ハロルド、エドワード・ルイス、ティムWicinski、スザンヌウルフ、およびDNSOPワーキンググループの他のメンバーに感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Duane Wessels Verisign 12061 Bluemont Way Reston, VA 20190 United States of America",
      "ja": "デュアン・ウェッセルベリサイン12061 Bluemontウェイレストン、VAアメリカの20190米国"
    },
    {
      "indent": 3,
      "text": "Phone: +1 703 948-3200 Email: dwessels@verisign.com URI: http://verisigninc.com",
      "ja": "電話：+1 703 948-3200 Eメール：dwessels@verisign.com URI：http://verisigninc.com"
    },
    {
      "indent": 3,
      "text": "Warren Kumari Google 1600 Amphitheatre Parkway Mountain View, CA 94043 United States of America",
      "ja": "ウォーレン・クマリGoogleの1600アンフィシアターパークウェイマウンテンビュー、カリフォルニア州アメリカの94043米国"
    },
    {
      "indent": 3,
      "text": "Email: warren@kumari.net",
      "ja": "メール：warren@kumari.net"
    },
    {
      "indent": 3,
      "text": "Paul Hoffman ICANN",
      "ja": "ポール・ホフマンICANN"
    },
    {
      "indent": 3,
      "text": "Email: paul.hoffman@icann.org",
      "ja": "メール：paul.hoffman@icann.org"
    }
  ]
}