{
  "title": {
    "text": "RFC 8118 - The application/pdf Media Type",
    "ja": "RFC 8118 - アプリケーション/ PDFのメディアタイプ"
  },
  "number": 8118,
  "created_at": "2019-10-23 14:27:15.727215+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                          M. Hardy\nRequest for Comments: 8118                                   L. Masinter\nObsoletes: 3778                                              D. Markovic\nCategory: Informational                       Adobe Systems Incorporated\nISSN: 2070-1721                                               D. Johnson\n                                                         PDF Association\n                                                               M. Bailey\n                                                         Global Graphics\n                                                              March 2017",
      "raw": true
    },
    {
      "indent": 21,
      "text": "The application/pdf Media Type",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "The Portable Document Format (PDF) is an ISO standard (ISO 32000-1:2008) defining a final-form document representation language in use for document exchange, including on the Internet, since 1993. This document provides an overview of the PDF format and updates the media type registration of \"application/pdf\". It obsoletes RFC 3778.",
      "ja": "1993年以来、このドキュメントは、PDF形式の概要を提供し、インターネット上を含む文書交換のために使用されている最終形の文書表現言語を、定義：Portable Document Format（PDF）はISO規格（2008年ISO 32000-1）でありますおよび「アプリケーション/ PDF」のメディアタイプの登録を更新します。これは、RFC 3778を廃止します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 7841.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 IESGによって承認されていないすべての文書がインターネットStandardのどんなレベルの候補です。 RFC 7841のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc8118.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc8118で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2017 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2017 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. History .........................................................3\n3. Fragment Identifiers ............................................3\n4. Subset Standards ................................................5\n5. PDF Versions ....................................................6\n6. PDF Implementations .............................................7\n7. Security Considerations .........................................7\n8. IANA Considerations .............................................8\n9. References ......................................................9\n   9.1. Normative References .......................................9\n   9.2. Informative References .....................................9\nAppendix A. Changes since RFC 3778 ................................11\nAuthors' Addresses ................................................12",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "This document is intended to provide updated information on the registration of the MIME Media Type \"application/pdf\" for documents in the PDF (Portable Document Format) syntax. It obsoletes [RFC3778].",
      "ja": "この文書は、PDF（Portable Document Format）形式の構文の文書のMIMEメディアタイプ「アプリケーション/ PDF」の登録の更新された情報を提供することを意図しています。これは、[RFC3778]を廃止します。"
    },
    {
      "indent": 3,
      "text": "PDF was originally envisioned as a way to reliably communicate and view printed information electronically across a wide variety of machine configurations, operating systems, and communication networks.",
      "ja": "PDFはもともと確実に通信し、機械の構成、オペレーティングシステム、及び通信ネットワークの広範囲を横切って電子的に印刷された情報を表示する方法として想定しました。"
    },
    {
      "indent": 3,
      "text": "PDF is used to represent \"final form\" formatted documents. PDF pages may include text, images, graphics, and multimedia content such as video and audio. PDF is also capable of containing auxiliary structures, including annotations, bookmarks, file attachments, hyperlinks, logical structures, and metadata. These features are useful for navigation and building collections of related documents, as well as for reviewing and commenting on documents. A rich JavaScript model has been defined for interacting with PDF documents.",
      "ja": "PDFは、「最終形態」形式のドキュメントを表すために使用されます。 PDFページは、テキスト、画像、グラフィックス、ビデオやオーディオなどのマルチメディアコンテンツを含んでいてもよいです。 PDFはまた、注釈、ブックマーク、添付ファイル、ハイパーリンク、論理構造、およびメタデータを含む補助構造を、収容可能です。これらの機能は、関連文書のナビゲーションや建物のコレクションのためだけでなく、見直しやドキュメントにコメントのために便利です。豊富なJavaScriptのモデルは、PDFドキュメントと対話するために定義されています。"
    },
    {
      "indent": 3,
      "text": "The imaging model for PDF was originally based on the PostScript [PS] page description language, used to render complex text, images, and graphics in a device-independent and resolution-independent manner.",
      "ja": "PDF用イメージングモデルは、もともとデバイスに依存しない解像度非依存的に複雑なテキスト、画像、グラフィックスをレンダリングするために使用されるポストスクリプト[PS]ページ記述言語に基づいていました。"
    },
    {
      "indent": 3,
      "text": "PDF supports encryption and digital signatures. The encryption capability is combined with access control information to facilitate management of the functionality available to the recipient. PDF supports the inclusion of document and object-level metadata through the eXtensible Metadata Platform [XMP].",
      "ja": "PDFは、暗号化とデジタル署名をサポートしています。暗号化機能は、受信者に利用可能な機能の管理を容易にするために、アクセス制御情報と組み合わされます。 PDFは、拡張可能なメタデータプラットフォーム[XMP]を介してドキュメントオブジェクトレベルのメタデータを含めることをサポートします。"
    },
    {
      "indent": 0,
      "text": "2. History",
      "section_title": true,
      "ja": "2.歴史"
    },
    {
      "indent": 3,
      "text": "PDF is used widely in the Internet community. The first version of PDF, 1.0, was published in 1993 by Adobe Systems Incorporated. Since then, PDF has grown to be a widely used format for capturing and exchanging formatted documents electronically across the Web, via email and virtually every other document-exchange mechanism. In 2008, PDF 1.7 was adopted as an ISO standard (ISO 32000-1:2008 [ISOPDF]) using the ISO \"Fast-Track\" process. That specification is technically identical to Adobe Portable Document Format version 1.7 [AdobePDF].",
      "ja": "PDFは、インターネットコミュニティで広く使用されています。 PDF、1.0の最初のバージョンは、Adobe Systems Incorporated（アドビシステムズ社）によって1993年に出版されました。それ以来、PDFは、電子メールとほぼすべての他の文書交換機構を介して、キャプチャしたWeb全体で電子的にフォーマットされた文書を交換するために広く使用されている形式に成長しました。 ISO \"ファスト・トラック\" プロセスを使用した：（2008 [ISOPDF] ISO 32000-1）2008年には、PDF 1.7はISO規格として採用されました。その仕様は、AdobeのPortable Document Formatバージョン1.7 [AdobePDF]技術的に同じです。"
    },
    {
      "indent": 3,
      "text": "The ISO TC-171 committee developed a \"refresh\" of PDF, known as ISO 32000-2; the version is PDF 2.0 [ISOPDF2].",
      "ja": "ISO TC-171委員会は、ISO 32000から2として知られている、PDFの「リフレッシュ」を開発しました。バージョンは[ISOPDF2] PDF 2.0です。"
    },
    {
      "indent": 3,
      "text": "In addition to ISO 32000-1:2008 and ISO 32000-2, several subset standards have been defined to address specific use cases and standardized by the ISO. These standards include PDF for Archival (PDF/A) [ISOPDFA], PDF for Engineering (PDF/E) [ISOPDFE], PDF for Universal Accessibility (PDF/UA) [ISOPDFUA], PDF for Variable Data and Transactional Printing (PDF/VT) [ISOPDFVT], and PDF for Prepress Digital Data Exchange (PDF/X) [ISOPDFX]. The subset standards are fully compliant PDF files capable of being displayed in a general PDF viewer.",
      "ja": "ISO 32000-1に加えて：2008とISO 32000から2、いくつかのサブセット規格は、特定のユースケースに対処するために定義されているとISOによって標準化されました。これらの基準は、アーカイブ可変データおよびトランザクション印刷用（PDF / A）[ISOPDFA]、エンジニアリング用PDF（PDF / E）[ISOPDFE]、ユニバーサルアクセシビリティ（PDF / UA）についてPDF [ISOPDFUA]、PDF（PDF /用PDFを含めますVT）[ISOPDFVT]、およびプリプレスのデジタルデータ交換のためのPDF（PDF / X）[ISOPDFX]。サブセット規格は、一般的なPDFビューアに表示されることが可能な、完全に準拠したPDFファイルです。"
    },
    {
      "indent": 0,
      "text": "3. Fragment Identifiers",
      "section_title": true,
      "ja": "3.フラグメント識別子"
    },
    {
      "indent": 3,
      "text": "Fragment identifiers appear at the end of a URI and provide a way to reference an anchor to subordinate content within the target of the URI, or additional parameters to the process of opening the identified content. The syntax and semantics of fragment identifiers are referenced in the media type definition.",
      "ja": "フラグメント識別子はURIの最後に表示され、特定されたコンテンツを開く処理がURI、または追加のパラメータのターゲット範囲内下位コンテンツにアンカーを参照する方法を提供します。フラグメント識別子の構文とセマンティクスは、メディアタイプの定義で参照されています。"
    },
    {
      "indent": 3,
      "text": "The specification of fragment identifiers for PDF appeared originally in [RFC3778] and is now included in ISO 32000-2 [ISOPDF2]. This section is a summary of that material. Any disagreements between [ISOPDF2] and this document should be resolved in favor of the ISO 32000-2 definition.",
      "ja": "PDFのためのフラグメント識別子の仕様は、[RFC3778]に元々登場し、今[ISOPDF2] ISO 32000から2に含まれています。このセクションでは、その材料の要約です。 [ISOPDF2]の間で、この文書の任意の意見の相違は、ISO 32000から2定義を優先して解決されなければなりません。"
    },
    {
      "indent": 3,
      "text": "A fragment identifier for PDF has one or more parameters, separated by the ampersand (&) or pound (#) character. Each parameter consists of the parameter name, \"=\" (equal), and the parameter value; lists of values are comma-separated, and parameter value strings may be URI-encoded [RFC3986]. Parameters are processed left to right.",
      "ja": "PDFのためのフラグメント識別子は、アンパサンド（＆）またはポンド（＃）文字で区切られた1つまたは複数のパラメータを有しています。各パラメータは、パラメータ名で構成され、「=」（等しい）、及びパラメータ値、値のリストは、カンマで区切られており、パラメータ値文字列はURIエンコード[RFC3986]であってもよいです。パラメータは、左から右に処理されます。"
    },
    {
      "indent": 3,
      "text": "Coordinate values (such as <left>, <right>, and <width>) are expressed in the default user space coordinate system of the document: 1/72 of an inch measured down and to the right from the upper left corner of the (current) page ([ISOPDF2] 8.3.2.3 \"User Space\").",
      "ja": "座標値（例えば<左>のように、<右>、及び<幅>）ドキュメントの座標系デフォルトのユーザ空間で表現されている：インチの1/72ダウン測定との左上隅から右へ（現在の）ページ（[ISOPDF2] 8.3.2.3 \"ユーザ空間\"）。"
    },
    {
      "indent": 3,
      "text": "The following parameters identify subordinate content of a PDF file but also may be used to set the document view to make the (start of) the identified content visible:",
      "ja": "以下のパラメータは、PDFファイルの下位のコンテンツを識別するだけでなく、目に見える識別されたコンテンツ（の開始）を行うためのドキュメントビューを設定するために使用されてもよいです。"
    },
    {
      "indent": 3,
      "text": "page=<pageNum> Identifies a specified (physical) page; the first page in the document has a pageNum value of 1.",
      "ja": "ページ= <PAGENUM>指定された（物理）ページを識別し、文書の最初のページには、1のPAGENUM値を持っています。"
    },
    {
      "indent": 3,
      "text": "nameddest=<name> Identifies a named destination ([ISOPDF2] 12.3.2.4 \"Named destinations\").",
      "ja": "nameddest = <名前>は、指定された送信先（[ISOPDF2] 12.3.2.4 \"名前付きの目的地\"）を識別します。"
    },
    {
      "indent": 3,
      "text": "structelem=<structID> A byte string with URI encoding; identifies the structure element with the ID key within a StructElem dictionary of the document.",
      "ja": "URIエンコードとstructelem = <structID>バイトの文字列。文書のStructElem辞書内のIDキーを持つ構造要素を識別します。"
    },
    {
      "indent": 3,
      "text": "comment=<commentID> The value of an annotation name, which is defined by the NM key in the corresponding annotation dictionary of the selected page ([ISOPDF2] 12.5.2 \"Annotation dictionaries\").",
      "ja": "コメント= <commentID>選択されたページ（[ISOPDF2] 12.5.2「注釈辞書」）の対応するアノテーション辞書にNMキーによって定義された注釈名の値。"
    },
    {
      "indent": 3,
      "text": "ef=<name> Identifies the embedded file where the parameter string <name> matches a file specification dictionary in the EmbeddedFiles name tree. If the \"ef\" parameter is not at the end of the fragment identifier, then the rest of the fragment identifier (after the ampersand or hash delimiter) is applied to the embedded file according to its own media type. This allows identification of content within the embedded file (which itself might be a PDF file).",
      "ja": "EF = <名前>は、パラメータ文字列は、<名前>はEmbeddedFiles名ツリー内のファイル指定の辞書に一致する埋め込みファイルを識別します。 「EF」パラメータは、フラグメント識別子の終わりにない場合、（アンパサンドまたはハッシュデリミタ後）フラグメント識別子の残りの部分は、独自のメディアタイプに応じて埋め込みファイルに適用されます。これは、（それ自体がPDFファイルであるかもしれない）埋め込まれたファイル内のコンテンツの同定を可能にします。"
    },
    {
      "indent": 6,
      "text": "NOTE: When attempting to open a PDF file that is not from a trusted source, the processor may choose to prompt the user or even prevent the file from being opened.",
      "ja": "注：信頼できるソースからのものではないPDFファイルを開こうとすると、プロセッサは、ユーザーにプロンプ​​トを表示することを選択したり、開かれてからファイルを防ぐことができます。"
    },
    {
      "indent": 3,
      "text": "These parameters operate on the view of the PDF document when it is opened:",
      "ja": "これらのパラメータは、それが開かれたPDFドキュメントのビューを操作します："
    },
    {
      "indent": 3,
      "text": "zoom=<scale>,<left>,<top> <scale> is the percentage to which the document should be zoomed, where a value of 100 corresponds to a zoom of 100%. <left> and <top> are optional, but both must be specified if either is included.",
      "ja": "ズーム= <スケール>、<左>、<TOP> <スケール> 100の値が100％のズームに対応する文書がズームされるべきである割合が、あります。 <左>と<トップ>はオプションですが、どちらかが含まれている場合の両方を指定する必要があります。"
    },
    {
      "indent": 3,
      "text": "view=<keyword>,<position> The arguments correspond to those found in [ISOPDF2] 12.3.2.2 \"Explicit destinations\". <keyword> is one of the keywords defined in [ISOPDF2] \"Table 149: Destination syntax\" with appropriate position values.",
      "ja": "ビュー= <キーワード>は、<位置>引数12.3.2.2「明示的な目的地」[ISOPDF2]に見出されるものに対応します。適切な位置の値を持つ：「宛先構文表149」<キーワードは> [ISOPDF2]で定義されたキーワードのいずれかです。"
    },
    {
      "indent": 3,
      "text": "viewrect=<left>,<top>,<width>,<height> Set the view rectangle.",
      "ja": "viewrect = <左>、<TOP>、<幅>、<高さ>ビュー矩形を設定します。"
    },
    {
      "indent": 3,
      "text": "highlight=<left>,<right>,<top>,<bottom> Highlight the specified rectangle.",
      "ja": "ハイライト= <左>、<右>、<トップ>、<下>指定された矩形を強調表示します。"
    },
    {
      "indent": 3,
      "text": "search=<wordList> Open the document and search for one or more words, selecting the first matching word in the document. <wordList> is a string enclosed in quotation marks, where individual words are separated by the space character (or %20).",
      "ja": "検索= <wordListに>文書の最初に一致する単語を選択し、ドキュメントを開いて、1つ以上の単語を検索します。 <wordListには>個々の単語が空白文字（または20％）によって分離されている引用符で囲まれた文字列です。"
    },
    {
      "indent": 3,
      "text": "fdf=<URI> This parameter imports data into PDF form fields. The URI is either a relative or absolute URI to a Forms Data Format (FDF) or XML FDF (XFDF) file. The fdf parameter should be specified as the last parameter to a given URI.",
      "ja": "FDF = <URI> PDFフォームフィールドにこのパラメータは、輸入データ。 URIは、フォームデータ形式（FDF）またはXML FDF（XFDF）ファイルのいずれかの相対または絶対URIです。 FDFパラメータは、指定されたURIの最後のパラメータとして指定する必要があります。"
    },
    {
      "indent": 0,
      "text": "4. Subset Standards",
      "section_title": true,
      "ja": "4.サブセット規格"
    },
    {
      "indent": 3,
      "text": "Several subsets of PDF have been published as distinct ISO standards:",
      "ja": "PDFのいくつかのサブセットは、明確なISO規格として公開されています："
    },
    {
      "indent": 3,
      "text": "o PDF/X [ISOPDFX], initially released in 2001 as PDF/X-1a, specifies how to use PDF for graphics exchange, with the aim to facilitate correct and predictable printing by print service providers. The standard has gone through multiple revisions over the years and has several published parts, the most recently released being part 8, specifying different levels of conformance: PDF/X-1a:2001, PDF/X-3:2002, PDF/X-1a:2003, PDF/X-3:2003, PDF/X-4, PDF/X-4p, PDF/X-5g, PDF/X-5pg, and PDF/X-5n.",
      "ja": "O PDF / X [ISOPDFX]、最初はPDF / X-1aと2001年にリリースされ、印刷サービスプロバイダによって正しいと予測可能な印刷を容易にする目的で、グラフィックス交換にPDFを使用する方法を指定します。標準では、長年にわたって複数のリビジョンを経て、いくつかの公表の部分、最も最近の適合の異なるレベルを指定して、部分8であることリリースしていました：PDF / X-1aに：2001、PDF / X-3：2002、PDF / X-を図1a：2003、PDF / X-3：2003、PDF / X-4、PDF / X-4P、PDF / X-5G、PDF / X-5PG、およびPDF / X-5N。"
    },
    {
      "indent": 3,
      "text": "o PDF/A [ISOPDFA], initially released in 2005, specifies how to use PDF for long-term preservation (archiving) of electronic documents. It prohibits PDF features that are not well suited to long-term archiving of documents, including JavaScript or executable file launches. Its requirements for PDF/A viewers include color management guidelines and support for embedded fonts. There are three parts of this standard and a total of eight conformance levels: PDF/A-1a, PDF/A-1b, PDF/A-2a, PDF/A-2b, PDF/A-2u, PDF/A-3a, PDF/A-3b, and PDF/A-3u.",
      "ja": "O当初、2005年にリリースされたPDF / A [ISOPDFA]は、電子文書の長期保存（アーカイブ）用のPDFを使用する方法を指定します。これは、JavaScriptや実行ファイルの起動を含む文書の長期保存に適していないPDFの機能を禁止しています。 PDF / Aの視聴者のためにその要件は、カラーマネジメントガイドラインおよび埋め込みフォントのサポートが含まれています。 PDF / A-1aを、PDF / A-1B、PDF / A-2A、PDF / A-2bを、PDF / A-2U、PDF / A-3A：この標準の8つの適合レベルの合計の3つの部分があります。 、PDF / A-3B、およびPDF / A-3U。"
    },
    {
      "indent": 3,
      "text": "o PDF/E, initially released in 2008 as PDF/E-1 [ISOPDFE], specifies how to use PDF in engineering workflows, such as manufacturing, construction, and geospatial analysis. Future revisions of PDF/E are supposed to include support for 3D PDF workflows.",
      "ja": "最初に[ISOPDFE] PDF / E-1として2008年にリリース、PDF / E、O、こうした製造業、建設業、および地理空間解析など、エンジニアリングワークフローでPDFを使用する方法を指定します。 PDF / Eの将来の改訂は、3D PDFワークフローをサポートするようになっています。"
    },
    {
      "indent": 3,
      "text": "o PDF/VT, initially released in 2010, specifies how to use PDF in variable and transactional printing. It is based on PDF/X and places additional restrictions on PDF content elements and supporting metadata. It specifies three conformance levels: PDF/VT-1, PDF/VT-2, and PDF/VT-2s [ISOPDFVT].",
      "ja": "当初は2010年にリリースされ、O PDF / VTは、変数およびトランザクション印刷でPDFを使用する方法を指定します。これは、PDF / Xに基づいており、PDFのコンテンツ要素とサポートするメタデータの追加制限を課すされます。 [ISOPDFVT] PDF / VT-1、PDF / VT-2、およびPDF / VT-2S：これは3つの適合レベルを指定します。"
    },
    {
      "indent": 3,
      "text": "o PDF/UA [ISOPDFUA], initially released in 2012 as PDF/UA-1, specifies how to create accessible electronic documents. It requires the use of ISO 32000's Tagged PDF feature and adds many requirements regarding semantic correctness in applying logical structures to content in PDF documents.",
      "ja": "最初にPDF / UA-1として2012年にリリースされ、O PDF / UA [ISOPDFUA]は、アクセス可能な電子文書を作成する方法を指定します。これは、ISO 32000のタグ付きPDFの機能を使用する必要があり、PDF文書内のコンテンツへの論理構造を適用するには、セマンティック正確性に関する多くの要件が追加されます。"
    },
    {
      "indent": 3,
      "text": "All of these subset standards use the \"application/pdf\" media type. The subset standards are generally not exclusive, so it is possible to construct a PDF file that conforms to, for example, both PDF/A-2b and PDF/X-4 subset standards.",
      "ja": "これらのサブセット規格のすべては、「アプリケーション/ PDF」メディアタイプを使用します。例えば、PDF / A-2bの両方とPDF / X-4サブセット規格に準拠したPDFファイルを構築することが可能であるので、サブセット規格は、一般に排他的ではありません。"
    },
    {
      "indent": 3,
      "text": "PDF documents claiming conformance to one or more of the subset standards use XMP metadata to identify levels of conformance. PDF processors should examine document metadata streams for such subset standards identifiers and, if appropriate, label documents as such when presenting them to the user.",
      "ja": "サブセットの1つまたは複数の規格への適合性を主張しているPDF文書は、適合性のレベルを識別するために、XMPメタデータを使用します。 PDFプロセッサは、ユーザーにそれらを提示するとき、文書のメタデータは、そのようなサブセット規格識別子のためのストリームと、適切な場合、ラベル文書調べる必要があります。"
    },
    {
      "indent": 0,
      "text": "5. PDF Versions",
      "section_title": true,
      "ja": "5. PDFのバージョン"
    },
    {
      "indent": 3,
      "text": "The PDF format has gone through several revisions, primarily for the addition of features. PDF features have generally been added in a way that older viewers \"fail gracefully\", because they can just ignore features they do not recognize. Even so, the older the PDF version produced, the more legacy viewers will support that version, but the fewer features will be enabled. The \"application/pdf\" media type is used for all versions. See [ISOPDF2] Annex I, \"PDF Versions and Compatibility\".",
      "ja": "PDF形式は、主に機能の追加のために、いくつかの改定を経験してきました。彼らはちょうど彼らが認識しない機能を無視することができますので、PDFの機能は、一般的に、古い視聴者は「正常に失敗」という方法で追加されました。そうであっても、PDF版が作ら古い、より多くのレガシーの視聴者は、そのバージョンをサポートしていますが、少数の機能が有効になります。 「アプリケーション/ PDF」メディアタイプは、すべてのバージョンで使用されています。 [ISOPDF2]附属書I、 \"PDFのバージョンとの互換性\" を参照してください。"
    },
    {
      "indent": 0,
      "text": "6. PDF Implementations",
      "section_title": true,
      "ja": "6. PDFの実装"
    },
    {
      "indent": 3,
      "text": "PDF files are experienced through a reader or viewer of PDF files. For most of the common platforms in use (iOS, OS X, Windows, Android, ChromeOS, Kindle) and for most browsers (Edge, Safari, Chrome, Firefox), PDF viewing is built in. In addition, there are many PDF viewers available for download and installation. The PDF specification was published and freely available since the format was introduced in 1993, so hundreds of companies and organizations make tools for PDF creation, viewing, and manipulation.",
      "ja": "PDFファイルは、PDFファイルのリーダーやビューアから経験しています。使用中の一般的なプラットフォーム（iOS版、OS X、Windowsの、アンドロイド、ChromeOSの、Kindleの）ほとんどのブラウザ用（エッジ、サファリ、クロム、Firefoxの）、PDFの閲覧が内蔵されたのほとんどのために。また、多くのPDFビューアがありますダウンロードとインストールのために利用できます。 PDFの仕様は公開され、フォーマットは、1993年に導入されて以来、自由に利用できるので、企業や組織の何百ものPDFの作成、表示、および操作のためのツールを作るました。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "ja": "7.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "PDF is certainly a complex media type as per Section 4.6 of [RFC6838], which sets requirements for security analysis of media type registrations. [RFC3778] (which this document obsoletes) contained a detailed analysis of some of the security issues for PDF implementations known at the time. While the analysis isn't necessarily wrong, the threat analysis is much too limited, and the mitigations are somewhat out of date. There is now extensive literature on security threats involving PDF implementations and how to avoid them, consistent with broad implementation over decades. We are not registering a new media type but rather are making a primarily administrative update. With those caveats:",
      "ja": "PDFは確かにメディアタイプ登録のセキュリティ分析のための要件を設定し、[RFC6838]のセクション4.6あたりのような複雑なメディアタイプです。 [RFC3778]（このドキュメントは時代遅れ）時点で知られているPDFの実装のためのセキュリティ上の問題のいくつかの詳細な分析を含んでいました。分析は必ずしも間違っていないですが、脅威分析があまりにも限られており、緩和策は古くなって多少あります。数十年にわたる広範な実装と一致したセキュリティPDFの実装に関わる脅威とその回避方法、に関する広範な文献が用意されました。私たちは、新しいメディアの種類を登録されるのではなく、主に管理者用更新プログラムを作っています。これらの注意点を持ちます："
    },
    {
      "indent": 3,
      "text": "The PDF file format allows several constructs that may compromise security if handled inadequately by PDF processors. For example:",
      "ja": "PDFファイル形式は、PDFプロセッサによって不十分に扱わ場合は、セキュリティを損なう可能性があるいくつかの構造を可能にします。例えば："
    },
    {
      "indent": 3,
      "text": "o PDF may contain scripts to customize the displaying and processing of PDF files. These scripts are expressed in a version of JavaScript and are intended for execution by the PDF processor.",
      "ja": "O PDFは、PDFファイルの表示や処理をカスタマイズするためのスクリプトが含まれていてもよいです。これらのスクリプトには、JavaScriptのバージョンで表現されており、PDFプロセッサによる実行のために意図されています。"
    },
    {
      "indent": 3,
      "text": "o A PDF file may refer to other PDF files for portions of content. PDF processors may be expected to find and use these external files when processing the document.",
      "ja": "O PDFファイルは、コンテンツの部分に他のPDFファイルを参照することができます。 PDFプロセッサは、文書を処理する際にこれらの外部ファイルを検索し、使用することを期待することができます。"
    },
    {
      "indent": 3,
      "text": "o PDF may act as a container for various files embedded in it (for example, as attached files). PDF processors may offer functionality to open and display such files or store them on the system, such as with the \"ef\" open action. The PDF specification places no restrictions on types of files that may be embedded, so",
      "ja": "O PDFは、（例えば、添付ファイルとして）、それに埋め込まれた各種ファイルのコンテナとして作用することができます。 PDFプロセッサが開き、このようなファイルを表示したり、そのような「EF」オープンアクションと同じようにシステム上でそれらを格納するための機能を提供することがあります。 PDFの仕様では、そう、埋め込まれていてもよいファイルの種類に制限を課すん"
    },
    {
      "indent": 6,
      "text": "PDF processors should be extremely careful to prevent unwanted execution of attached executables or decompression of attached archives that may store dangerous files in the host file system.",
      "ja": "PDFプロセッサは、添付の実行ファイルまたはホストファイルシステム内の危険なファイルを格納することができる添付のアーカイブの解凍の不要な実行を防ぐために非常に注意しなければなりません。"
    },
    {
      "indent": 3,
      "text": "o PDF files may contain links to content on the Internet. PDF processors may offer functionality to show such content upon following the link.",
      "ja": "O PDFファイルは、インターネット上のコンテンツへのリンクが含まれていてもよいです。 PDFプロセッサは、リンクをたどるときに、このようなコンテンツを表示するための機能を提供することがあります。"
    },
    {
      "indent": 3,
      "text": "o The fragment identifier syntax (Section 3) contains directives for opening (\"ef\") or including (\"fdf\") additional material.",
      "ja": "フラグメント識別子構文（セクション3）O口（「EF」）のための指示が含まれているか（「FDF」）追加の材料を含みます。"
    },
    {
      "indent": 3,
      "text": "PDF interpreters executing any scripts or programs related to these constructs must be extremely careful to ensure that untrusted software is executed in a protected environment.",
      "ja": "これらの構成に関連する任意のスクリプトやプログラムを実行するPDFの通訳は、信頼できないソフトウェアが保護された環境で実行されていることを確実にするために非常に慎重でなければなりません。"
    },
    {
      "indent": 3,
      "text": "In addition, the PDF processor itself, as well as its plugins, scripts, etc., may be a source of insecurity, by either obvious or subtle means.",
      "ja": "また、PDFプロセッサ自体、ならびに等のプラグイン、スクリプトは、明白な又は微妙ないずれかの手段によって、不安の源であってもよいです。"
    },
    {
      "indent": 0,
      "text": "8. IANA Considerations",
      "section_title": true,
      "ja": "8. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document updates the registration of \"application/pdf\", a media type registration previously defined in [RFC3778], using the registration template defined in [RFC6838]:",
      "ja": "このドキュメントは[RFC6838]で定義された登録テンプレートを使用して、「アプリケーション/ PDF」、以前に[RFC3778]で定義されたメディアタイプ登録の登録を更新します。"
    },
    {
      "indent": 3,
      "text": "Type name: application",
      "ja": "型名：アプリケーション"
    },
    {
      "indent": 3,
      "text": "Subtype name: pdf",
      "ja": "サブタイプ名：PDF"
    },
    {
      "indent": 3,
      "text": "Required parameters: none",
      "ja": "必須パラメータ：なし"
    },
    {
      "indent": 3,
      "text": "Optional parameter: none",
      "ja": "オプションのパラメータ：なし"
    },
    {
      "indent": 3,
      "text": "Encoding considerations: binary",
      "ja": "エンコードの考慮事項：バイナリ"
    },
    {
      "indent": 3,
      "text": "Security considerations: See Section 7 of this document.",
      "ja": "セキュリティの考慮事項：このドキュメントのセクション7を参照してください。"
    },
    {
      "indent": 3,
      "text": "Interoperability considerations: See Section 5 of this document.",
      "ja": "相互運用性に関する注意事項：このドキュメントのセクション5を参照してください。"
    },
    {
      "indent": 3,
      "text": "Published specification: ISO 32000-2 (PDF 2.0) [ISOPDF2] is the most recent.",
      "ja": "公開された仕様：ISO 32000から2（PDF 2.0）[ISOPDF2]が最新です。"
    },
    {
      "indent": 3,
      "text": "Applications that use this media type: See Section 6 of this document.",
      "ja": "このドキュメントのセクション6を参照してください：このメディアタイプを使用するアプリケーション。"
    },
    {
      "indent": 3,
      "text": "Fragment identifier considerations: See Section 3 of this document.",
      "ja": "フラグメント識別子の考慮事項：このドキュメントのセクション3を参照してください。"
    },
    {
      "indent": 3,
      "text": "Additional information:",
      "ja": "追加情報："
    },
    {
      "indent": 6,
      "text": "Deprecated alias names for this type: none",
      "ja": "このタイプの非推奨別名：なし"
    },
    {
      "indent": 6,
      "text": "Magic number(s): All PDF files start with the characters \"%PDF-\" followed by the PDF version number, e.g., \"%PDF-1.7\" or \"%PDF-2.0\". These characters are in US-ASCII encoding.",
      "ja": "マジックナンバー（S）：すべてのPDFファイルは、PDFのバージョン番号、例えば、 \"％のPDF-1.7\" または \"％のPDF-2.0\" に続く文字の \"％PDF-\" で始まります。これらの文字は、US-ASCIIエンコーディングです。"
    },
    {
      "indent": 6,
      "text": "File extension(s): .pdf",
      "ja": "ファイルの拡張子（S）：.PDF"
    },
    {
      "indent": 6,
      "text": "Macintosh file type code(s): \"PDF \"",
      "ja": "Macintoshのファイルタイプコード（S）： \"PDF\""
    },
    {
      "indent": 3,
      "text": "Person & email address to contact for further information: Duff Johnson <duff@duff-johnson.com>, Peter Wyatt <Peter.wyatt@cisra.canon.com.au>, ISO 32000 Project Leaders.",
      "ja": "人と詳細のために連絡する電子メールアドレス：ダフ・ジョンソン<duff@duff-johnson.com>、ピーター・ワイアット<Peter.wyatt@cisra.canon.com.au>、ISO 32000人のプロジェクトリーダー。"
    },
    {
      "indent": 3,
      "text": "Intended usage: COMMON",
      "ja": "意図している用法：COMMON"
    },
    {
      "indent": 3,
      "text": "Restrictions on usage: none",
      "ja": "使用に関する制限事項：なし"
    },
    {
      "indent": 3,
      "text": "Author: Authors of this document",
      "ja": "著者：このドキュメントの著者"
    },
    {
      "indent": 3,
      "text": "Change controller: ISO; in particular, ISO 32000 is by ISO TC 171/SC 02/WG 08, \"PDF specification\". Duff Johnson <duff@duff-johnson.com> and Peter Wyatt <Peter.wyatt@cisra.canon.com.au> are current ISO 32000 Project Leaders.",
      "ja": "変更コントローラ：ISO;具体的には、ISO 32000は、ISO TC 171 / SC 02 / WG 08、 \"PDFの仕様\" です。ダフ・ジョンソン<duff@duff-johnson.com>とピーター・ワイアット<Peter.wyatt@cisra.canon.com.au>は、現在のISO 32000プロジェクト・リーダーです。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "ja": "9.参考文献"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "ja": "9.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[ISOPDF] ISO, \"Document management -- Portable document format -- Part 1: PDF 1.7\", ISO 32000-1:2008, 2008.",
      "ja": "[ISOPDF] ISO、 \"文書管理 - ポータブル・ドキュメント・フォーマット - パート1：PDF 1.7\"、ISO 32000-1：2008、2008。"
    },
    {
      "indent": 3,
      "text": "[ISOPDF2] ISO, \"Document management -- Portable document format -- Part 2: PDF 2.0\", ISO 32000-2:2017, 2017.",
      "ja": "[ISOPDF2] ISO、 \"文書管理 - ポータブル・ドキュメント・フォーマット - パート2：PDF 2.0\"、ISO 32000から2：2017、2017。"
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "ja": "9.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[ISOPDFX] ISO, \"Graphic technology -- Prepress digital data exchange using PDF -- Part 8: Partial exchange of printing data using PDF 1.6 (PDF/X-5)\", ISO 15930-8:2008, 2008.",
      "ja": "[ISOPDFX] ISO、 \"グラフィック技術 - プリプレスデジタルデータ交換PDFを使用して - パート8：PDF 1.6（PDF / X-5）を使用した印刷データの部分的な交換\"：2008、2008、ISO 15930から8を。"
    },
    {
      "indent": 3,
      "text": "[ISOPDFA] ISO, \"Document management -- Electronic document file format for long-term preservation -- Part 3: Use of ISO 32000-1 with support for embedded files (PDF/A-3)\", ISO 19005-3:2012, 2012.",
      "ja": "[ISOPDFA] ISO、 \"文書管理 - 長期保存のための電子文書ファイルフォーマット - 第3部：ISO 32000-1の使用埋め込みファイルをサポートする（PDF / A-3）\"、ISO 19005から3：2012 2012年。"
    },
    {
      "indent": 3,
      "text": "[ISOPDFE] ISO, \"Document management -- Engineering document format using PDF -- Part 1: Use of PDF 1.6 (PDF/E-1)\", ISO 24517-1:2008, 2008.",
      "ja": "[ISOPDFE] ISO、 \"文書管理 -  PDFを使用したエンジニアリング・ドキュメント・フォーマット - パート1：PDF 1.6の使用（PDF / E-1）\"、ISO 24517から1：2008、2008。"
    },
    {
      "indent": 3,
      "text": "[ISOPDFVT] ISO, \"Graphic technology -- Variable data exchange -- Part 2: Using PDF/X-4 and PDF/X-5 (PDF/VT-1 and PDF/VT-2)\", ISO 16612-2:2010, 2010.",
      "ja": "【ISOPDFVT] ISO、 \"グラフィック技術 - 可変データ交換 - パート2：PDF / X-4を使用し、PDF / X-5（PDF / VT-1およびPDF / VT-2）\"、ISO 16612から2： 2010年、2010年。"
    },
    {
      "indent": 3,
      "text": "[ISOPDFUA] ISO, \"Document management applications -- Electronic document file format enhancement for accessibility -- Part 1: Use of ISO 32000-1 (PDF/UA-1)\", ISO 14289-1:2014, 2014.",
      "ja": "[ISOPDFUA] ISO、 \"文書管理アプリケーション - アクセシビリティのための電子文書のファイル形式の強化 - パート1：ISO 32000-1（PDF / UA-1）の使用\"：2014、2014、ISO 14289から1。"
    },
    {
      "indent": 3,
      "text": "[XMP] ISO, \"Graphic technology -- Extensible metadata platform (XMP) specification -- Part 1: Data model, serialization and core properties\", ISO 16684-1, 2012.",
      "ja": "[XMP] ISO、 \"グラフィック技術 - 拡張メタデータプラットフォーム（XMP）仕様 - パート1：データモデル、シリアライズおよびコアの特性\"、ISO 16684から1、2012。"
    },
    {
      "indent": 3,
      "text": "[PS] Adobe Systems Incorporated, \"PostScript Language Reference, third edition\", 1999, <https://www.adobe.com/products/postscript/pdfs/PLRM.pdf>.",
      "ja": "[PS] Adob​​e Systems Incorporated（アドビシステムズ社）、 \"ポストスクリプト言語リファレンス、第三版\"、1999年、<https://www.adobe.com/products/postscript/pdfs/PLRM.pdf>。"
    },
    {
      "indent": 3,
      "text": "[AdobePDF] Adobe Systems Incorporated, \"PDF Reference, sixth edition\", 2006, <http://www.adobe.com/content/dam/Adobe/en/devnet/acrobat/ pdfs/pdf_reference_1-7.pdf>.",
      "ja": "[AdobePDF] Adob​​e Systems Incorporated（アドビシステムズ社）、 \"PDFリファレンス、第6版\"、2006、<http://www.adobe.com/content/dam/Adobe/en/devnet/acrobat/ PDFファイル/ pdf_reference_1-7.pdf>。"
    },
    {
      "indent": 3,
      "text": "[RFC6838] Freed, N., Klensin, J., and T. Hansen, \"Media Type Specifications and Registration Procedures\", BCP 13, RFC 6838, DOI 10.17487/RFC6838, January 2013, <http://www.rfc-editor.org/info/rfc6838>.",
      "ja": "[RFC6838]解放され、N.、Klensin、J.、およびT.ハンセン、 \"メディアタイプの仕様と登録手順\"、BCP 13、RFC 6838、DOI 10.17487 / RFC6838、2013年1月、<のhttp：//www.rfc- editor.org/info/rfc6838>。"
    },
    {
      "indent": 3,
      "text": "[RFC3986] Berners-Lee, T., Fielding, R., and L. Masinter, \"Uniform Resource Identifier (URI): Generic Syntax\", STD 66, RFC 3986, DOI 10.17487/RFC3986, January 2005, <http://www.rfc-editor.org/info/rfc3986>.",
      "ja": "[RFC3986]バーナーズ - リー、T.、フィールディング、R.、およびL. Masinter、 \"ユニフォームリソース識別子（URI）：汎用構文\"、STD 66、RFC 3986、DOI 10.17487 / RFC3986、2005年1月<HTTP：/ /www.rfc-editor.org/info/rfc3986>。"
    },
    {
      "indent": 3,
      "text": "[RFC3778] Taft, E., Pravetz, J., Zilles, S., and L. Masinter, \"The application/pdf Media Type\", RFC 3778, DOI 10.17487/RFC3778, May 2004, <http://www.rfc-editor.org/info/rfc3778>.",
      "ja": "[RFC3778]タフト、E.、Pravetz、J.、Zilles、S.、およびL. Masinter、 \"アプリケーション/ PDFメディアタイプ\"、RFC 3778、DOI 10.17487 / RFC3778、2004年5月、<のhttp：// WWW。 rfc-editor.org/info/rfc3778>。"
    },
    {
      "indent": 1,
      "text": "Appendix A. Changes since",
      "ja": "付録A.からの変更点"
    },
    {
      "indent": 3,
      "text": "This specification replaces RFC 3778, which previously defined the \"application/pdf\" Media Type. Differences include the following:",
      "ja": "この仕様は、以前に「アプリケーション/ PDF」メディアタイプを定義したRFC 3778に代わるものです。違いは次のものがあります。"
    },
    {
      "indent": 3,
      "text": "o To reflect the transition from a proprietary specification by Adobe to an open ISO standard, the Change Controller has changed from Adobe to ISO, and references have been updated.",
      "ja": "オープンISO規格にAdobeが独自の仕様からの移行を反映するために、oは、変更コントローラは、ISOにはAdobeから変更されている、と参照が更新されました。"
    },
    {
      "indent": 3,
      "text": "o The overview of PDF capabilities, the history of PDF, and the descriptions of PDF subsets were updated to reflect more recent relevant history.",
      "ja": "O PDF機能、PDFの歴史、およびPDFのサブセットの説明の概要は、より最近の関連の歴史を反映するために更新されました。"
    },
    {
      "indent": 3,
      "text": "o The section on fragment identifiers was updated to closely reflect the material that has been added to ISO-32000-2.",
      "ja": "Oフラグメント識別子のセクションは、密接にIS​​O-32000から2に追加された材料を反映するように更新されました。"
    },
    {
      "indent": 3,
      "text": "o The status of popular PDF implementations was updated.",
      "ja": "O人気のPDF実装のステータスが更新されました。"
    },
    {
      "indent": 3,
      "text": "o The Security Considerations section was updated to match the current understanding of PDF vulnerabilities.",
      "ja": "O Security Considerations部は、PDFの脆弱性の現在の理解と一致するように更新されました。"
    },
    {
      "indent": 3,
      "text": "o The registration template was updated to match RFC 6838.",
      "ja": "O登録テンプレートは、RFC 6838に一致するように更新されました。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Matthew Hardy Adobe Systems Incorporated 345 Park Ave. San Jose, CA 95110 United States of America",
      "ja": "マシュー・ハーディAdobe Systems Incorporated（アドビシステムズ社）345パークアベニュー。サンノゼ、CAアメリカの95110米国"
    },
    {
      "indent": 3,
      "text": "Email: mahardy@adobe.com",
      "ja": "メール：mahardy@adobe.com"
    },
    {
      "indent": 3,
      "text": "Larry Masinter Adobe Systems Incorporated 345 Park Ave. San Jose, CA 95110 United States of America",
      "ja": "ラリーMasinter Adob​​e Systems Incorporated（アドビシステムズ社）345パークアベニュー。サンノゼ、CAアメリカの95110米国"
    },
    {
      "indent": 3,
      "text": "Email: masinter@adobe.com URI: http://LarryMasinter.net",
      "ja": "メール：masinter@adobe.com URI：http://LarryMasinter.net"
    },
    {
      "indent": 3,
      "text": "Dejan Markovic Adobe Systems Incorporated 345 Park Ave. San Jose, CA 95110 United States of America",
      "ja": "デヤン・マルコヴィッチAdobe Systems Incorporated（アドビシステムズ社）345パークアベニュー。サンノゼ、CAアメリカの95110米国"
    },
    {
      "indent": 3,
      "text": "Email: dmarkovi@adobe.com",
      "ja": "メール：dmarkovi@adobe.com"
    },
    {
      "indent": 3,
      "text": "Duff Johnson PDF Association Neue Kantstrasse 14 Berlin 14057 Germany",
      "ja": "ダフ・ジョンソンPDF協会新カントシュトラーセ14ベルリン14057ドイツ"
    },
    {
      "indent": 3,
      "text": "Email: duff.johnson@pdfa.org",
      "ja": "メール：duff.johnson@pdfa.org"
    },
    {
      "indent": 3,
      "text": "Martin Bailey Global Graphics 2030 Cambourne Business Park Cambridge CB23 6DW United Kingdom",
      "ja": "マーティン・ベイリーGlobal Graphicsの2030 CambourneのビジネスパークケンブリッジCB23 6DWイギリス"
    },
    {
      "indent": 3,
      "text": "Email: martin.bailey@globalgraphics.com URI: http://www.globalgraphics.com",
      "ja": "メール：martin.bailey@globalgraphics.com URI：http://www.globalgraphics.com"
    }
  ]
}