{
  "title": {
    "text": "RFC 6549 - OSPFv2 Multi-Instance Extensions",
    "ja": "RFC 6549 - OSPFV2マルチインスト拡張機能"
  },
  "number": 6549,
  "created_at": "2022-11-04 09:53:26.825663+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         A. Lindem\nRequest for Comments: 6549                                      Ericsson\nUpdates: 2328                                                     A. Roy\nCategory: Standards Track                                   S. Mirtorabi\nISSN: 2070-1721                                            Cisco Systems\n                                                              March 2012",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 20,
      "text": "OSPFv2 Multi-Instance Extensions",
      "ja": "OSPFV2マルチインスト拡張機能"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "OSPFv3 includes a mechanism to support multiple instances of the protocol running on the same interface. OSPFv2 can utilize such a mechanism in order to support multiple routing domains on the same subnet.",
      "ja": "OSPFV3には、同じインターフェイスで実行されているプロトコルの複数のインスタンスをサポートするメカニズムが含まれています。OSPFV2は、同じサブネット上の複数のルーティングドメインをサポートするために、このようなメカニズムを利用できます。"
    },
    {
      "indent": 3,
      "text": "This document defines the OSPFv2 Instance ID to enable separate OSPFv2 protocol instances on the same interface. Unlike OSPFv3 where the Instance ID can be used for multiple purposes, such as putting the same interface in multiple areas, the OSPFv2 Instance ID is reserved for identifying protocol instances.",
      "ja": "このドキュメントでは、同じインターフェイス上の個別のOSPFV2プロトコルインスタンスを有効にするOSPFV2インスタンスIDを定義します。同じインターフェイスを複数の領域に配置するなど、インスタンスIDを複数の目的に使用できるOSPFV3とは異なり、OSPFV2インスタンスIDはプロトコルインスタンスを識別するために予約されています。"
    },
    {
      "indent": 3,
      "text": "This document updates RFC 2328.",
      "ja": "このドキュメントは、RFC 2328を更新します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準トラックドキュメントです。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントは、インターネットエンジニアリングタスクフォース（IETF）の製品です。IETFコミュニティのコンセンサスを表しています。公開レビューを受けており、インターネットエンジニアリングステアリンググループ（IESG）からの出版が承認されています。インターネット標準の詳細については、RFC 5741のセクション2で入手できます。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6549.",
      "ja": "このドキュメントの現在のステータス、任意のERRATA、およびそのフィードバックを提供する方法に関する情報は、http：//www.rfc-editor.org/info/rfc6549で取得できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2012 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2012 IETF Trustおよび文書著者として特定された人。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "このドキュメントは、BCP 78およびIETFドキュメント（http://trustee.ietf.org/license-info）に関連するIETF Trustの法的規定の対象となります。この文書に関するあなたの権利と制限を説明するので、これらの文書を注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、セクション4.Eで説明されている法的規定のセクション4.Eで説明されており、単純化されたBSDライセンスで説明されているように保証なしで提供される簡略化されたBSDライセンステキストを含める必要があります。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n   1.1. Requirements Notation ......................................3\n2. OSPFv2 Instance Packet Encoding .................................3\n3. OSPFv2 Interface Instance ID ....................................4\n   3.1. Sending and Receiving OSPFv2 Packets .......................4\n   3.2. Interface Instance ID Values ...............................4\n4. State Sharing Optimizations between OSPFv2 Instances ............5\n5. OSPFv2 Authentication Impacts ...................................5\n6. Backward Compatibility and Deployment Considerations ............5\n7. Security Considerations .........................................6\n8. IANA Considerations .............................................6\n9. References ......................................................7\n   9.1. Normative References .......................................7\n   9.2. Informative References .....................................7\nAppendix A. Acknowledgments.... ....................................8",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "OSPFv3 [OSPFV3] includes a mechanism to support multiple instances of a protocol running on the same interface. OSPFv2 [OSPFV2] can utilize such a mechanism in order to support multiple routing domains on the same subnet.",
      "ja": "OSPFV3 [OSPFV3]には、同じインターフェイスで実行されているプロトコルの複数のインスタンスをサポートするメカニズムが含まれています。OSPFV2 [OSPFV2]は、同じサブネット上の複数のルーティングドメインをサポートするために、このようなメカニズムを利用できます。"
    },
    {
      "indent": 3,
      "text": "This document defines the OSPFv2 Instance ID to enable separate OSPFv2 protocol instances on the same interface. Unlike OSPFv3 where the Instance ID can be used for multiple purposes, such as putting the same interface in multiple areas, the OSPFv2 Instance ID is reserved for identifying protocol instances.",
      "ja": "このドキュメントでは、同じインターフェイス上の個別のOSPFV2プロトコルインスタンスを有効にするOSPFV2インスタンスIDを定義します。同じインターフェイスを複数の領域に配置するなど、インスタンスIDを複数の目的に使用できるOSPFV3とは異なり、OSPFV2インスタンスIDはプロトコルインスタンスを識別するために予約されています。"
    },
    {
      "indent": 0,
      "text": "1.1. Requirements Notation",
      "section_title": true,
      "ja": "1.1. 要件表記"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC-KEYWORDS].",
      "ja": "「必須」、「そうしない」、「必須」、「必要」、「しない」、「そうしない」、「そうではない」、「そうでない」、「推奨」、「5月」、および「オプション」は、[rfc-keywords]で説明されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. OSPFv2 Instance Packet Encoding",
      "section_title": true,
      "ja": "2. OSPFV2インスタンスパケットエンコーディング"
    },
    {
      "indent": 3,
      "text": "This document extends OSPFv2 with a mechanism to differentiate packets for different instances sent and received on the same interface. In support of this capability, a modified packet header format with the Authentication Type field split into an Instance ID and AuType.",
      "ja": "このドキュメントは、同じインターフェイスで送信および受信されたさまざまなインスタンスのパケットを区別するメカニズムでOSPFV2を拡張します。この機能をサポートして、認証タイプフィールドを備えた修正パケットヘッダー形式は、インスタンスIDと自動タイプに分割されます。"
    },
    {
      "indent": 6,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|   Version #   |     Type      |         Packet length         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                         Router ID                             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                          Area ID                              |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|          Checksum             |  Instance ID  |  AuType       |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     Authentication                            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     Authentication                            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 27,
      "text": "The OSPFv2 Packet Header",
      "ja": "OSPFV2パケットヘッダー"
    },
    {
      "indent": 3,
      "text": "All fields are as defined in [OSPFV2] except that the Instance ID field is new, and the AuType field is reduced to 8 bits from 16 bits without any change in meaning. The Instance ID field is defined as follows:",
      "ja": "すべてのフィールドは[OSPFV2]で定義されていると同様に、インスタンスIDフィールドが新しく、自動タイプフィールドが意味を変えることなく16ビットから8ビットに削減されます。インスタンスIDフィールドは次のように定義されています。"
    },
    {
      "indent": 3,
      "text": "Instance ID Enables multiple instances of OSPFv2 to be used on a single interface. Each protocol instance would be assigned a separate Instance ID; the Instance ID has local subnet significance only. Received packets with an Instance ID not equal to one of the Instance IDs corresponding to one of the configured OSPFv2 Instances for the receiving interface MUST be discarded.",
      "ja": "インスタンスIDを使用すると、OSPFV2の複数のインスタンスを単一のインターフェイスで使用できます。各プロトコルインスタンスには、個別のインスタンスIDが割り当てられます。インスタンスIDには、ローカルサブネットの重要性のみがあります。受信インターフェイスの設定されたOSPFV2インスタンスのいずれかに対応するインスタンスIDの1つに等しくないインスタンスIDを持つ受信パケットを破棄する必要があります。"
    },
    {
      "indent": 0,
      "text": "3. OSPFv2 Interface Instance ID",
      "section_title": true,
      "ja": "3. OSPFV2インターフェイスインスタンスID"
    },
    {
      "indent": 3,
      "text": "Section 9 of [OSPFV2] describes the conceptual interface data structure. The OSPFv2 Interface Instance ID is added to this structure. The OSPFv2 Interface Instance ID has a default value of 0. Setting it to a non-zero value may be accomplished through configuration.",
      "ja": "[OSPFV2]のセクション9では、概念的インターフェイスデータ構造について説明します。OSPFV2インターフェイスインスタンスIDがこの構造に追加されます。OSPFV2インターフェイスインスタンスIDのデフォルト値は0です。ゼロ以外の値に設定すると、構成を介して達成できます。"
    },
    {
      "indent": 0,
      "text": "3.1. Sending and Receiving OSPFv2 Packets",
      "section_title": true,
      "ja": "3.1. OSPFV2パケットの送信と受信"
    },
    {
      "indent": 3,
      "text": "When sending OSPFv2 packets, the OSPFv2 Interface Instance ID is set in the OSPFv2 packet header. When receiving OSPFv2 packets, the OSPFv2 Header Instance ID is used to aid in demultiplexing the packet and associating it with the correct OSPFv2 instance. Received packets with an Instance ID not equal to one of the configured OSPFv2 Instance IDs on the receiving interface MUST be discarded.",
      "ja": "OSPFV2パケットを送信するとき、OSPFV2インターフェイスインスタンスIDがOSPFV2パケットヘッダーに設定されます。OSPFV2パケットを受信する場合、OSPFV2ヘッダーインスタンスIDを使用して、パケットの再剥奪を支援し、正しいOSPFV2インスタンスに関連付けます。受信インターフェイス上の設定されたOSPFV2インスタンスIDのいずれかに等しくないインスタンスIDを持つ受信パケットを破棄する必要があります。"
    },
    {
      "indent": 0,
      "text": "3.2. Interface Instance ID Values",
      "section_title": true,
      "ja": "3.2. インターフェイスインスタンスID値"
    },
    {
      "indent": 3,
      "text": "The following OSPFv2 Instance IDs have been defined:",
      "ja": "次のOSPFV2インスタンスIDが定義されています。"
    },
    {
      "indent": 3,
      "text": "0 Base IPv4 Instance - This is the default IPv4 routing instance corresponding to default IPv4 unicast routing and the attendant IPv4 routing table. Use of this Instance ID provides backward compatibility with the base OSPF specification [OSPFV2].",
      "ja": "0ベースIPv4インスタンス - これは、デフォルトのIPv4ユニキャストルーティングと付随するIPv4ルーティングテーブルに対応するデフォルトのIPv4ルーティングインスタンスです。このインスタンスIDを使用すると、ベースOSPF仕様[OSPFV2]との逆方向の互換性が提供されます。"
    },
    {
      "indent": 3,
      "text": "1 Base IPv4 Multicast Instance - This IPv4 instance corresponds to the separate IPv4 routing table used for the Reverse Path Forwarding (RPF) checking performed on IPv4 multicast traffic.",
      "ja": "1ベースIPv4マルチキャストインスタンス -このIPv4インスタンスは、IPv4マルチキャストトラフィックで実行されるリバースパス転送（RPF）チェックに使用される個別のIPv4ルーティングテーブルに対応します。"
    },
    {
      "indent": 3,
      "text": "2 Base IPv4 In-band Management Instance - This IPv4 instance corresponds to a separate IPv4 routing table used for network management applications.",
      "ja": "2ベースIPv4インバンド管理インスタンス -このIPv4インスタンスは、ネットワーク管理アプリケーションに使用される別のIPv4ルーティングテーブルに対応しています。"
    },
    {
      "indent": 3,
      "text": "3-127 Private Use - These Instance IDs are reserved for definition and semantics defined by the local network administrator. For example, separate Interface Instance IDs and their corresponding OSPFv2 instances could be used to support independent non-congruent topologies for different classes of IPv4 unicast traffic. The details of such deployments are beyond the scope of this document.",
      "ja": "3-127プライベート使用 - これらのインスタンスIDは、ローカルネットワーク管理者によって定義された定義とセマンティクスのために予約されています。たとえば、個別のインターフェイスインスタンスIDとそれらに対応するOSPFV2インスタンスを使用して、IPv4ユニキャストトラフィックのさまざまなクラスの独立した非環境トポロジーをサポートできます。このような展開の詳細は、このドキュメントの範囲を超えています。"
    },
    {
      "indent": 3,
      "text": "The first three Interface Instance IDs are analogous to the topology IDs defined in [RFC4915].",
      "ja": "最初の3つのインターフェイスインスタンスIDは、[RFC4915]で定義されているトポロジIDに類似しています。"
    },
    {
      "indent": 0,
      "text": "4. State-Sharing Optimizations between OSPFv2 Instances",
      "section_title": true,
      "ja": "4. OSPFV2インスタンス間の状態共有最適化"
    },
    {
      "indent": 3,
      "text": "This is beyond the scope of this document and is an area for further study.",
      "ja": "これはこのドキュメントの範囲を超えており、さらなる研究の領域です。"
    },
    {
      "indent": 0,
      "text": "5. OSPFv2 Authentication Impacts",
      "section_title": true,
      "ja": "5. OSPFV2認証の影響"
    },
    {
      "indent": 3,
      "text": "Now that the AuType OSPFv2 header field has been reduced from 2 octets to 1 octet, OSPFv2 routers not supporting this specification will fail packet authentication for any instance other than the default (i.e., the Base IPv4 Unicast Instance). This is solely due to the difference in field definition as opposed to any explicit change to OSPFv2 authentication, as described in Appendix D of RFC 2328 [OSPFV2] and RFC 5709 [RFC5709]. However, this is exactly what is desired since OSPFv2 routers not supporting this specification should only support the default instance (refer to Section 6).",
      "ja": "自己型OSPFV2ヘッダーフィールドが2オクテットから1オクテットに縮小されたため、この仕様をサポートしていないOSPFV2ルーターは、デフォルト以外のインスタンス（つまり、ベースIPv4ユニキャストインスタンス）の場合、パケット認証に失敗します。これは、RFC 2328 [OSOSPFV2]およびRFC 5709 [RFC5709]の付録Dに記載されているように、OSPFV2認証の明示的な変更とは対照的に、フィールド定義の違いによるものです。ただし、これはまさにこの仕様をサポートしていないOSPFV2ルーターがデフォルトインスタンスのみをサポートする必要があるため、まさに望ましいものです（セクション6を参照）。"
    },
    {
      "indent": 0,
      "text": "6. Backward Compatibility and Deployment Considerations",
      "section_title": true,
      "ja": "6. 後方互換性と展開の考慮事項"
    },
    {
      "indent": 3,
      "text": "When there are OSPFv2 routers that support OSPFv2 Multi-Instance extensions on the same broadcast-capable interface as OSPFv2 routers that do not, packets with non-zero OSPFv2 header Instance IDs are received by those legacy OSPFv2 routers. Since the non-zero Instance ID is included in the AuType by these legacy OSPFv2 routers, it is misinterpreted as a mismatched authentication type and the packet is dropped. This is exactly what is expected and desired.",
      "ja": "OSPFV2マルチインストタンス拡張機能をサポートするOSPFv2ルーターがある場合、OSPFV2ルーターと同じブロードキャスト対応インターフェイスではない場合、ゼロ以外のOSOSPFV2ヘッダーインスタンスIDを持つパケットは、これらのLEGACY OSPFV2ルーターによって受信されます。ゼロ以外のインスタンスIDは、これらのレガシーOSPFV2ルーターによって自動タイプに含まれているため、不一致の認証タイプと誤解され、パケットがドロップされます。これはまさに期待され望ましいものです。"
    },
    {
      "indent": 3,
      "text": "Previously, there was concern that certain implementations would log every single authentication type mismatch. However, discussions with implementers have led us to the conclusion that this is not as severe a problem as we'd first thought, and it will be even less of a problem by the time the mechanism described herein is standardized, implemented, and deployed. Most implementations will dampen the logging of errors. Hence, the more drastic mechanisms to avoid legacy OSPFv2 routers from receiving multicast OSPFv2 packets with non-zero Instance IDs have been removed.",
      "ja": "以前は、特定の実装がすべての認証タイプの不一致を記録するという懸念がありました。しかし、実装者との議論により、これは私たちが最初に考えたほど深刻な問題ではなく、本明細書に記載されているメカニズムが標準化、実装、展開されるまでにさらに問題になるという結論に至りました。ほとんどの実装は、エラーのロギングを弱めます。したがって、ゼロ以外のインスタンスIDを備えたマルチキャストOSPFV2パケットの受信からレガシーOSPFV2ルーターを回避するためのより劇的なメカニズムが削除されました。"
    },
    {
      "indent": 3,
      "text": "If the OSPF MIB as specified in [OSPF-MIB] is implemented, even the damped generation of the ospfIfAuthFailure or ospfVirtIfAuthFailure Simple Network Management Protocol (SNMP) notifications would be undesirable in situations where legacy OSPFv2 routers are deployed on the same subnet as OSPFv2 routers supporting this specification. Consequently, it is recommended that implementations that implement this specification and the OSPF MIB also implement SNMP Notification filtering as specified in Section 6 of [RFC3413].",
      "ja": "[OSPF-MIB]で指定されているOSPF MIBが実装されている場合、OSPFIFAUTHFAILUREまたはOSPFVIRTIFAUTHFAILUREの減衰世代でさえ、Simple Network Management Protocol（SNMP）通知は、Legacy OSPFV2ルーターがEOSOSPFV2 RETERSと同じサブネットと同じサブネットで展開されている状況では望ましくありません。この仕様をサポートします。したがって、この仕様とOSPF MIBを実装する実装は、[RFC3413]のセクション6で指定されているようにSNMP通知フィルタリングを実装することをお勧めします。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "ja": "7. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "The enhancement described herein doesn't include additional security considerations to OSPFv2. Security considerations for OSPFv2 are described in [OSPFV2].",
      "ja": "本明細書に記載されている拡張には、OSPFV2への追加のセキュリティ上の考慮事項は含まれていない。OSPFV2のセキュリティ上の考慮事項は、[OSPFV2]で説明されています。"
    },
    {
      "indent": 3,
      "text": "Given that only three OSPFv2 authentication types have been standardized, it seems reasonable to reduce the OSPFv2 packet header field to 8 bits.",
      "ja": "標準化された3つのOSPFV2認証タイプのみを考えると、OSPFV2パケットヘッダーフィールドを8ビットに削減することは妥当と思われます。"
    },
    {
      "indent": 0,
      "text": "8. IANA Considerations",
      "section_title": true,
      "ja": "8. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "The size of the AuType field is reduced from 16 octets to 8 octets. This changes the OSPF Authentication Codes registry in that the values 256-65535 are no longer defined and are therefore deprecated. There is no backward compatibility issue since this range of values was previously defined as \"Reserved and should not be assigned\".",
      "ja": "自己型フィールドのサイズは、16オクテットから8オクテットに減少します。これにより、値256-65535が定義されなくなるため、非推奨されるという点で、OSPF認証コードレジストリが変更されます。この値の範囲は以前は「予約済みであり、割り当てられるべきではない」と定義されていたため、後方互換性の問題はありません。"
    },
    {
      "indent": 3,
      "text": "A new registry has been created for OSPFv2 Instance IDs. The initial allocation of OSPFv2 Instance IDs is described below. Refer to Section 3.2 for more information.",
      "ja": "OSPFV2インスタンスID用に新しいレジストリが作成されました。OSPFV2インスタンスIDの初期割り当てについては、以下に説明します。詳細については、セクション3.2を参照してください。"
    },
    {
      "indent": 6,
      "text": "+-------------+----------------------+--------------------+\n| Value/Range | Designation          | Assignment Policy  |\n+-------------+----------------------+--------------------+\n| 0           | Base IPv4 Unicast    | Assigned           |\n|             | Instance             |                    |\n|             |                      |                    |\n| 1           | Base IPv4 Multicast  | Assigned           |\n|             | Instance             |                    |\n|             |                      |                    |\n| 2           | Base IPv4 In-band    | Assigned           |\n|             | Management Instance  |                    |\n|             |                      |                    |\n| 3-127       | Private Use          | Reserved for local |\n|             |                      | policy assignment  |\n|             |                      |                    |\n| 128-255     | Unassigned           | Standards Action   |\n+-------------+----------------------+--------------------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 22,
      "text": "OSPFv2 Instance ID",
      "ja": "OSPFV2インスタンスID"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "ja": "9. 参考文献"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "ja": "9.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[OSPFV2] Moy, J., \"OSPF Version 2\", STD 54, RFC 2328, April 1998.",
      "ja": "[OSPFV2] Moy、J。、「OSPFバージョン2」、STD 54、RFC 2328、1998年4月。"
    },
    {
      "indent": 3,
      "text": "[OSPFV3] Coltun, R., Ferguson, D., Moy, J., and A. Lindem, \"OSPF for IPv6\", RFC 5340, July 2008.",
      "ja": "[OSPFV3] Coltun、R.、Ferguson、D.、Moy、J。、およびA. Lindem、「OSPF for IPv6」、RFC 5340、2008年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC-KEYWORDS] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC-Keywords] Bradner、S。、「要件レベルを示すためにRFCで使用するためのキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "ja": "9.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[OSPF-MIB] Joyal, D., Ed., Galecki, P., Ed., Giacalone, S., Ed., Coltun, R., and F. Baker, \"OSPF Version 2 Management Information Base\", RFC 4750, December 2006.",
      "ja": "[Ospf-Mib] Joyal、D.、Ed。、Galecki、P.、Ed。、Giacalone、S.、Ed。、Coltun、R。、およびF. Baker、「OSPFバージョン2管理情報ベース」、RFC 4750、2006年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC3413] Levi, D., Meyer, P., and B. Stewart, \"Simple Network Management Protocol (SNMP) Applications\", STD 62, RFC 3413, December 2002.",
      "ja": "[RFC3413] Levi、D.、Meyer、P。、およびB. Stewart、「Simple Network Management Protocol（SNMP）アプリケーション」、STD 62、RFC 3413、2002年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC4915] Psenak, P., Mirtorabi, S., Roy, A., Nguyen, L., and P. Pillay-Esnault, \"Multi-Topology (MT) Routing in OSPF\", RFC 4915, June 2007.",
      "ja": "[RFC4915] Psenak、P.、Mirtorabi、S.、Roy、A.、Nguyen、L。、およびP. Pillay-Esnault、「Multi-Topology（MT）Routing in OSPF」、RFC 4915、2007年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC5709] Bhatia, M., Manral, V., Fanto, M., White, R., Barnes, M., Li, T., and R. Atkinson, \"OSPFv2 HMAC-SHA Cryptographic Authentication\", RFC 5709, October 2009.",
      "ja": "[RFC5709] Bhatia、M.、Manral、V.、Fanto、M.、White、R.、Barnes、M.、Li、T。、およびR. Atkinson、「Ospfv2 HMAC-SHA暗号認証」、RFC 5709、2009年10月。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Acknowledgments",
      "section_title": true,
      "ja": "付録A. 謝辞"
    },
    {
      "indent": 3,
      "text": "Thanks to Adrian Farrel for reviewing and providing some suggested improvements during the IESG review.",
      "ja": "IESGレビュー中にいくつかの推奨改善をレビューし、提供してくれたAdrian Farrelに感謝します。"
    },
    {
      "indent": 3,
      "text": "Thanks to Paul Wells for commenting on the backward compatibility issues.",
      "ja": "後方の互換性の問題についてコメントしてくれたPaul Wellsに感謝します。"
    },
    {
      "indent": 3,
      "text": "Thanks to Paul Wells and Vladica Stanisic for commenting during the OSPF WG last call.",
      "ja": "OSPF WGの最後の電話でコメントしてくれたPaul WellsとVladica Stanisicに感謝します。"
    },
    {
      "indent": 3,
      "text": "Thanks to Manav Bhatia for comments and for being the document shepherd.",
      "ja": "コメントとドキュメントシェパードであることについて、Manav Bhatiaに感謝します。"
    },
    {
      "indent": 3,
      "text": "Thanks to Magnus Nystrom for comments under the auspices of the Security Directorate review.",
      "ja": "セキュリティ局のレビューの後援に基づくコメントをしてくれたマグナス・ナイストロムに感謝します。"
    },
    {
      "indent": 3,
      "text": "Thanks to Dan Romascanu for comments during the IESG review.",
      "ja": "IESGレビュー中のコメントについてDan Romascanuに感謝します。"
    },
    {
      "indent": 3,
      "text": "Thanks to Pete McCann for comments under the auspices of the Gen-ART review.",
      "ja": "Gen-Artレビューの後援に基づくコメントをしてくれたPete McCannに感謝します。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Acee Lindem Ericsson 102 Carric Bend Court Cary, NC 27519 USA",
      "ja": "ACEE LINDEM ERICSSON 102 CARRIC BEND COURT CARY、NC 27519 USA"
    },
    {
      "indent": 3,
      "text": "EMail: acee.lindem@ericsson.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Abhay Roy Cisco Systems 225 West Tasman Drive San Jose, CA 95134 USA",
      "ja": "Abhay Roy Cisco Systems 225 West Tasman Drive San Jose、CA 95134 USA"
    },
    {
      "indent": 3,
      "text": "EMail: akr@cisco.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Sina Mirtorabi Cisco Systems 3 West Plumeria Drive San Jose, CA 95134 USA",
      "ja": "Sina Mirtorabi Cisco Systems 3 West Plumeria Drive San Jose、CA 95134 USA"
    },
    {
      "indent": 3,
      "text": "EMail: sina@cisco.com",
      "raw": true,
      "ja": ""
    }
  ]
}