{
  "title": {
    "text": "RFC 6478 - Pseudowire Status for Static Pseudowires",
    "ja": "RFC 6478 - 静的スードワイヤのための擬似回線ステータス"
  },
  "number": 6478,
  "created_at": "2019-10-31 16:00:31.788299+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                        L. Martini\nRequest for Comments: 6478                                    G. Swallow\nUpdates: 5885                                                   G. Heron\nCategory: Standards Track                                          Cisco\nISSN: 2070-1721                                                 M. Bocci\n                                                          Alcatel-Lucent\n                                                                May 2012",
      "raw": true
    },
    {
      "indent": 16,
      "text": "Pseudowire Status for Static Pseudowires",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document specifies a mechanism to signal Pseudowire (PW) status messages using a PW associated channel (ACh). Such a mechanism is suitable for use where no PW dynamic control plane exits, known as static PWs, or where a Terminating Provider Edge (T-PE) needs to send a PW status message directly to a far-end T-PE. The mechanism allows PW Operations, Administration, and Maintenance (OAM) message mapping and PW redundancy to operate on static PWs. This document also updates RFC 5885 in the case when Bi-directional Forwarding Detection (BFD) is used to convey PW status-signaling information.",
      "ja": "この文書では、PW関連チャネル（アセチルコリン）を使用して疑似回線（PW）ステータスメッセージを通知するためのメカニズムを指定します。ここで、静的のPWとして知らないPW動的制御プレーンが終了すると、そのような機構は、使用に適している、又は終端プロバイダエッジ（T-PE）は遠端T-PEに直接PWステータスメッセージを送信する必要があります。メカニズムはPW運用、管理、および保守（OAM）メッセージマッピング及びPWの冗長性が静的のPW上で動作することを可能にします。この文書はまた、双方向フォワーディング検出（BFD）はPWステータスシグナリング情報を搬送するために使用された場合にはRFC 5885に更新します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6478.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6478で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2011 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2011 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n2. Specification of Requirements ...................................3\n3. Terminology .....................................................3\n4. Applicability ...................................................3\n5. Pseudowire Status Operation .....................................4\n   5.1. PW OAM Message .............................................4\n   5.2. Sending a PW Status Message ................................5\n   5.3. PW OAM Status Message Transmit and Receive .................6\n        5.3.1. Acknowledgment of PW Status .........................7\n   5.4. MPLS Label Stack ...........................................7\n        5.4.1. Label Stack for a Message Destined to the Next PE ...8\n        5.4.2. Label Stack for a Message Destined to the Egress PE .8\n   5.5. S-PE Bypass Mode ...........................................8\n        5.5.1. S-PE Bypass Mode LDP Flag Bit .......................9\n6. S-PE Operation .................................................10\n   6.1. Static PW to Another Static PW ............................10\n   6.2. Dynamic PW to Static PW or Vice Versa .....................10\n7. Security Considerations ........................................11\n8. IANA Considerations ............................................11\n9. References .....................................................11\n   9.1. Normative References ......................................11\n   9.2. Informative References ....................................12",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The default control plane for Pseudowire (PW) technology, as defined in [RFC4447], is based on the Label Distribution Protocol (LDP). However, that document also describes a static provisioning mode without a control plane. When a static PW is used, there is no method to transmit the status of the PW or attachment circuit (AC) between the two Provider Edge (PE) devices at each end of the PW. This document defines a method to transport the PW status codes defined in Section 5.4.2 of [RFC4447] and elsewhere [REDUNDANCY] in-band with the PW data using a generic associated channel [RFC5586].",
      "ja": "擬似回線（PW）技術のデフォルトのコントロールプレーンは、[RFC4447]で定義されるように、ラベル配布プロトコル（LDP）に基づいています。しかし、その文書は、制御プレーンなしで静的プロビジョニングモードについて説明します。静的なPWを使用する場合、PWの各端部にある2つのプロバイダエッジ（PE）デバイス間PW又はアタッチメント回路（AC）のステータスを送信する方法はありません。この文書は、一般的な関連チャネル[RFC5586]を使用して、PWデータと帯域内の他の場所[RFC4447]及び[REDUNDANCY]のセクション5.4.2で定義されたPWステータスコードを転送する方法を定義します。"
    },
    {
      "indent": 0,
      "text": "2. Specification of Requirements",
      "section_title": true,
      "ja": "要件の2仕様"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "3. Terminology",
      "section_title": true,
      "ja": "3.用語"
    },
    {
      "indent": 3,
      "text": "ACh: Associated Channel",
      "ja": "アセチルコリン：関連したチャンネル"
    },
    {
      "indent": 3,
      "text": "ACH: Associated Channel Header",
      "ja": "ACH：関連するチャネルヘッダー"
    },
    {
      "indent": 3,
      "text": "FEC: Forwarding Equivalence Class",
      "ja": "FEC：転送等価クラス"
    },
    {
      "indent": 3,
      "text": "LDP: Label Distribution Protocol",
      "ja": "LDP：ラベル配布プロトコル"
    },
    {
      "indent": 3,
      "text": "LSP: Label Switching Path",
      "ja": "LSP：ラベルスイッチングパス"
    },
    {
      "indent": 3,
      "text": "MS-PW: Multi-Segment Pseudowire",
      "ja": "MS-PW：マルチセグメント擬似回線"
    },
    {
      "indent": 3,
      "text": "PE: Provider Edge",
      "ja": "PE：プロバイダーエッジ"
    },
    {
      "indent": 3,
      "text": "PW: Pseudowire",
      "ja": "PO：Psefdoviri"
    },
    {
      "indent": 3,
      "text": "SS-PW: Single-Segment Pseudowire",
      "ja": "SS-PW：単一セグメント擬似回線"
    },
    {
      "indent": 3,
      "text": "S-PE: Switching Provider Edge Node of MS-PW",
      "ja": "S-PE：MS-PWのスイッチングプロバイダーエッジノード"
    },
    {
      "indent": 3,
      "text": "T-PE: Terminating Provider Edge Node of MS-PW",
      "ja": "T-PE：MS-PWの終端プロバイダエッジノード"
    },
    {
      "indent": 0,
      "text": "4. Applicability",
      "section_title": true,
      "ja": "4.適用性"
    },
    {
      "indent": 3,
      "text": "As described in [RFC4447] and [RFC6310], a PE that establishes an MPLS PW using means other than LDP, e.g., by static configuration, MUST support some alternative method of status reporting. The procedures described in this document are for use when PWs are statically configured and an LDP control plane is not available.",
      "ja": "[RFC4447]及び[RFC6310]に記載されているように、LDP以外の手段を使用してMPLS PWを確立するPEは、例えば、静的な構成によって、ステータスレポートのいくつかの代替方法をサポートしなければなりません。 PWが静的に構成されている場合は、この文書に記載された手順は、使用のためであり、LDPコントロールプレーンは使用できません。"
    },
    {
      "indent": 3,
      "text": "As defined in [RFC4447], a PE that establishes a PW using LDP MUST use the PW status TLV mechanism for AC and PW status and defect notification on that PW. In order to avoid duplicate notifications and potentially conflicting notifications, such PEs MUST NOT use the mechanisms described in this document for those PWs, except that the S-PE bypass mode described in Section 5.5 MAY be used when both T-PEs at each end of the PW use LDP to establish the PW.",
      "ja": "[RFC4447]で定義されるように、LDPを使用してPWを確立するPEは、ACとPWステータスおよびそのPW上の欠陥通知用PWステータスTLV機構を使用しなければなりません。重複通知潜在的に競合通知を回避するために、そのようなPEは、セクション5.5で説明S-PEバイパスモードの各端部がともにT-PES使用されてもよいことを除いて、それらのPWは、この文書で説明されたメカニズムを使用してはいけませんPWはPWを確立するためにLDPを使用しています。"
    },
    {
      "indent": 3,
      "text": "In order to protect against duplicate notifications and potentially conflicting notifications, when the Pseudowire Status protocol for Static Pseudowires described in this document is used, the BFD VCCV (Virtual Circuit Connectivity Verification) status-signaling mechanisms described in [RFC5885] (CV Types 0x08 and 0x20) MUST NOT be used. BFD VCCV for fault detection (CV types 0x04 and 0x10) MAY still be used.",
      "ja": "この文書で説明した静的スードワイヤのための擬似回線ステータスプロトコルを使用する場合、重複する通知および潜在的に矛盾する通知に対して保護するために、BFD VCCV（仮想回線接続性検証）[RFC5885]で説明ステータスシグナル伝達機構（CVタイプは0x08と0x20の）使用してはいけません。 BFD障害検出のためのVCCV（CVタイプの0x04のとは0x10）はまだ使用されるかもしれません。"
    },
    {
      "indent": 0,
      "text": "5. Pseudowire Status Operation",
      "section_title": true,
      "ja": "5.疑似回線ステータス操作"
    },
    {
      "indent": 0,
      "text": "5.1. PW OAM Message",
      "section_title": true,
      "ja": "5.1.  PW OAMメッセージ"
    },
    {
      "indent": 3,
      "text": "The PW status TLV as defined in Section 5.4.2 of [RFC4447] is transported in a PW OAM message using the PW ACH.",
      "ja": "[RFC4447]のセクション5.4.2で定義されるようにPW状態TLVは、PW ACHを用いたPW OAMメッセージで搬送されます。"
    },
    {
      "indent": 4,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|0 0 0 1|Version|   Reserved    | 0x0027 PW OAM Message         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         Refresh Timer         |  TLV Length   |A|   Flags     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                                                               |\n~                              TLVs                             ~\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 16,
      "text": "Figure 1: ACh PW OAM Message Packet Header",
      "ja": "図1：アセチルコリンPW OAMメッセージパケットヘッダ"
    },
    {
      "indent": 3,
      "text": "The first 32 bits are the standard ACH header construct as defined in [RFC5586].",
      "ja": "[RFC5586]で定義されるように最初の32ビットは、標準的なACHヘッダ構築物です。"
    },
    {
      "indent": 3,
      "text": "The first nibble (0001b) indicates the ACH instead of PW data. The version and the reserved values are both set to 0 as specified in [RFC4385].",
      "ja": "最初のニブル（0001B）が代わりPWデータのACHを示しています。 [RFC4385]で指定されたバージョンと予約済みの値が両方とも0に設定されています。"
    },
    {
      "indent": 3,
      "text": "The refresh timer is an unsigned integer and specifies refresh time in seconds with a range from 1 to 65535. The value 0 means that the refresh timer is set to infinity, and the PW OAM message will never be refreshed, and will never timeout.",
      "ja": "リフレッシュタイマは、符号なし整数であり、値0は、リフレッシュタイマが無限大に設定されていることを意味1〜65535の範囲で秒でリフレッシュ時間を指定し、PW OAMメッセージが更新されない、およびタイムアウトありません。"
    },
    {
      "indent": 3,
      "text": "The TLV length field indicates the length of all TLVs only. This document defines only the transport of the PW status TLV, as defined in Section 5.4.2, [RFC4447], in the TLV field. In the future, additional TLVs may be defined to be used in this field with code points allocated from the IANA registry called \"LDP TLV Type Name Space\".",
      "ja": "TLVの長さフィールドは、すべてのTLVの長さを示します。 TLVフィールドに、セクション5.4.2、[RFC4447]で定義されるように、このドキュメントは、PWステータスTLVのみ輸送を規定します。将来的には、追加のTLVは「LDP TLVタイプ名前空間」と呼ばれるIANAレジストリから割り当てられたコードポイントで、この分野で使用されるように定義することができます。"
    },
    {
      "indent": 3,
      "text": "The A flag bit is used to indicate an acknowledgment of the PW status TLV included. The rest of the flag bits are reserved and they MUST be set to 0 on transmit, and ignored upon receipt. When the A bit is set, the refresh timer value is a requested timer value.",
      "ja": "Aフラグビットは、TLVが含まPWステータスの確認を示すために使用されます。フラグビットの残りは予約されており、それらは送信時に0に設定しなければなりません、そして受信時には無視します。 Aビットがセットされると、リフレッシュタイマ値は、要求されたタイマー値です。"
    },
    {
      "indent": 3,
      "text": "The PW OAM Message code point value is 0x0027.",
      "ja": "PW OAMメッセージコードポイント値は0x0027です。"
    },
    {
      "indent": 0,
      "text": "5.2. Sending a PW Status Message",
      "section_title": true,
      "ja": "5.2.  PWステータスメッセージを送信"
    },
    {
      "indent": 3,
      "text": "The PW Status messages are sent in-band using the PW OAM message containing the PW Status TLV for a particular PW, as defined in [RFC4447]. The PW Status TLV format is almost as defined in [RFC4447] and is repeated here for the reader's convenience:",
      "ja": "[RFC4447]で定義されるようにPWステータスメッセージは、特定のPWのためのPWステータスTLVを含むPW OAMメッセージを使用して、帯域内送信されます。 PWステータスTLV形式は、[RFC4447]で定義されているほとんどのように、読者の便宜のためにここで繰り返されます。"
    },
    {
      "indent": 4,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|Res|     PW Status (0x096A)    |            Length             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                          Status Code                          |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 22,
      "text": "Figure 2: PW Status TLV Format",
      "ja": "図2：PWステータスTLVのフォーマット"
    },
    {
      "indent": 3,
      "text": "Unlike the case in [RFC4447], here, the first 2 bits are reserved, and MUST be set to zero on transmit and ignored on receipt.",
      "ja": "[RFC4447]での場合と異なり、ここでは、最初の2ビットは予約されており、送信にゼロに設定され、領収書の上で無視しなければなりません。"
    },
    {
      "indent": 3,
      "text": "The PW Status TLV is prepended with a PW OAM message header and sent on the ACh of the PW to which the status update applies.",
      "ja": "PWステータスTLVは、PW OAMメッセージヘッダと付加し、ステータス更新が適用されるPWのアセチルコリンに送信されます。"
    },
    {
      "indent": 3,
      "text": "To clear a particular status indication, the PE needs to send a new PW OAM message containing a PW Status TLV with the corresponding bit cleared as defined in [RFC4447].",
      "ja": "特定の状態表示をクリアするには、PEは、[RFC4447]で定義されるようにクリアされ、対応するビットとPWステータスTLVを含む新しいPW OAMメッセージを送信する必要があります。"
    },
    {
      "indent": 3,
      "text": "The procedures described in [RFC6073] that apply to an S-PE and PW using an LDP control plane also apply when sending PW status using the PW OAM channel. The OPTIONAL procedures using the SP-PE TLV described in [RFC6073] can also be applied when sending PW status using the PW OAM channel.",
      "ja": "PW OAMチャネルを使用してPWステータスを送信するときLDPコントロールプレーンを用いて、S-PEおよびPWに適用する[RFC6073]に記載の手順も当てはまります。 SP-PE TLVを使用してOPTIONAL手順は、PW OAMチャネルを使用してPWステータスを送信する場合にも適用することができる[RFC6073]で説明しました。"
    },
    {
      "indent": 3,
      "text": "The detailed message transmit and message receive procedures are specified in the next section. PW OAM status messages MUST NOT be used as a connectivity verification method.",
      "ja": "詳細メッセージの送信とメッセージが手順は、次のセクションで指定され受け取ります。 PW OAMステータスメッセージは、接続性検証方法として使用してはいけません。"
    },
    {
      "indent": 0,
      "text": "5.3. PW OAM Status Message Transmit and Receive",
      "section_title": true,
      "ja": "5.3.  PW OAMステータスメッセージの送受信"
    },
    {
      "indent": 3,
      "text": "Unlike the PW status procedures defined in [RFC4447], with this method there is no TCP/IP session or session management. Therefore, unlike the TCP/IP case, where each message is sent only once, the PW OAM message containing the PW status TLV needs to be transmitted repeatedly to ensure reliable message delivery. If a malformed TLV or an unknown TLV is received in a PW OAM status message, the TLV MUST be ignored, and the PE SHOULD report the event to the operator.",
      "ja": "[RFC4447]で定義されたPWステータス手順とは異なり、この方法ではないTCP / IPセッションまたはセッション管理は存在しません。したがって、各メッセージは一度だけ送信されるTCP / IPの場合とは異なり、PW状態TLVを含むPW OAMメッセージは信頼性の高いメッセージ配信を保証するために繰り返し送信する必要があります。奇形のTLVまたは未知のTLVは、PW OAMステータスメッセージで受信された場合、TLVを無視しなければなりません、そしてPEは、オペレータにイベントを報告すべきです。"
    },
    {
      "indent": 3,
      "text": "A PW OAM message containing a PW status TLV with a new status bit set or reset will be transmitted immediately by the PE. Unless the message is acknowledged within a second, the PW OAM message will then be repeated twice more at an initial interval of one second. Subsequently, the PW OAM message will be transmitted with an interval specified by the refresh timer value in the packet. Note that this value MAY be updated in the new PW OAM message packet, in which case the new refresh timer value becomes the new packet transmit interval.",
      "ja": "新しいステータスビットがセットまたはリセットとPWステータスTLVを含むPW OAMメッセージはPEによって直ちに送信されます。メッセージは秒以内に承認されていない限り、PW OAMメッセージは、1秒の初期間隔で2回以上繰り返されます。その後、PW OAMメッセージは、パケット内のリフレッシュタイマ値で指定した間隔で送信されます。この値は、新しいリフレッシュタイマの値は、新たなパケットの送信間隔となった場合には、新たなPW OAMメッセージパケットに更新されてもよいことに注意してください。"
    },
    {
      "indent": 3,
      "text": "The suggested default value for the refresh timer is 600 seconds. This default is adequate for typical deployments, and PEs are designed to take into account processing these messages at the required rate.",
      "ja": "リフレッシュタイマーの推奨デフォルト値は600秒です。このデフォルトは、典型的な展開のために適切である、とのPEが必要な速度でこれらのメッセージを処理を考慮に入れて設計されています。"
    },
    {
      "indent": 3,
      "text": "When a PW OAM message containing a status TLV is received, a timer is started according to the refresh rate specified in the packet. If another non-zero PW status message is not received within 3.5 times the specified timer value, the status condition will timeout in 3.5 times the last refresh timer value received, and the default status of zero is assumed on the PW. It is also a good practice to introduce some jitter in the delay between refresh transmissions, as long as the maximum jitter delay is within the prescribed maximum refresh time of 3.5 times the specified timer value for 3 consecutive refresh packets.",
      "ja": "ステータスTLVを含むPW OAMメッセージを受信した場合、タイマーはパケットに指定されたリフレッシュレートに応じて開始されます。別の非ゼロPWのステータスメッセージが3.5倍、指定タイマ値内に受信されない場合は、ステータス状態は、受信3.5倍の最後のリフレッシュタイマ値でタイムアウトになり、ゼロのデフォルト状態はPWに想定されます。また、限り最大ジッタ遅延が3つの連続でリフレッシュパケットのための3.5倍、指定タイマ値の規定の最大リフレッシュ時間以内であるとして、リフレッシュ送信間の遅延で、いくつかのジッタを導入することをお勧めします。"
    },
    {
      "indent": 3,
      "text": "To clear a particular status fault, the PE need only send an updated message with the corresponding bit cleared. If the PW status code is zero, the PW OAM message will be sent like any other PW OAM status message using the procedures described above; however, transmission will cease after 3 PW status messages have been sent at one second intervals and before the refresh timer expires. A PW status message of zero MAY be acknowledged using the procedures described in Section 5.3.1. If it is acknowledged, then a timer value of zero MUST be used. This SHOULD cause the PE sending the PW status notification message with a PW status code equal to zero to stop sending and to continue normal operation.",
      "ja": "特定のステータスの障害をクリアするには、PEはクリア対応するビットで更新されたメッセージを送信する必要が。 PWステータスコードがゼロの場合、PW OAMメッセージは、上述した手順を使用して、他のPW OAMステータスメッセージと同様に送信されます。 3つのPWステータスメッセージが1秒間隔で、リフレッシュタイマーが切れる前に送られた後しかし、送信が中止されます。ゼロのPWステータスメッセージは、セクション5.3.1に記載した手順を使用して肯定応答されるかもしれません。それが認められている場合には、ゼロのタイマー値を使用しなければなりません。これは、送信を停止すると、通常の動作を継続し、ゼロに等しいPWステータスコードとPW状態通知メッセージを送信PEを引き起こすべきです。"
    },
    {
      "indent": 0,
      "text": "5.3.1. Acknowledgment of PW Status",
      "section_title": true,
      "ja": "5.x.1。 AkknooledgmentオフPOステータ"
    },
    {
      "indent": 3,
      "text": "A PE receiving a PW OAM message containing a PW status message MAY acknowledge the PW status message by simply building a reply packet with the same format and status code as the received PW OAM message, but with the A bit set, and transmitting it on the PW ACh back to the source of the PW OAM message. The receiving PE MAY use the refresh timer field in the acknowledgement packet to request a new refresh interval from the originator of the PW OAM message. The timer value set in the reply packet SHOULD then be used by the originator of the PW OAM message as the new transmit interval. If the requested refresh timer value is to be used, then, when the the current timer expires, the PW OAM message transmission interval is set to the new value and the new value is sent in the PW OAM message. If the transmitting PE does not want to use the new timer value (for local policy reasons, or because it simply cannot support it), it MUST refresh the PW OAM message with the timer value it desires. The receiving PE will then set its timeout timer according to the new refresh timer value that is in the packet received, regardless of what timer value it requested. The receiving PE MUST NOT request a new refresh timer value more than once per refresh interval.",
      "ja": "PWステータスメッセージを含むPW OAMメッセージを受信したPEは、単に受信したPW OAMメッセージと同じフォーマットとステータスコードで応答パケットを構築することによりPWステータスメッセージを確認するが、Aで設定し、そして上で送信ビットMAYバックPW OAMメッセージの送信元にPWのACh。受信PEはPW OAMメッセージの発信元からの新しいリフレッシュ間隔を要求するために、確認応答パケットにリフレッシュタイマーフィールドを使用するかもしれません。応答パケットに設定されたタイマ値は、新しい送信間隔としてPW OAMメッセージの発信者によって使用されるべきです。要求されたリフレッシュタイマ値を使用する場合は、その後、現在のタイマが満了したとき、PW OAMメッセージの送信間隔は、新しい値に設定され、新しい値がPW OAMメッセージで送信されます。 （それは単にそれをサポートすることができないため、ローカルポリシー上の理由、または）送信PEは、新しいタイマー値を使用したくない場合は、それが希望するタイマ値とPW OAMメッセージを更新する必要があります。受信PEはその後にかかわらず、それが要求されたどのようなタイマ値の、受信したパケットである新しいリフレッシュタイマ値に応じてタイムアウトタイマーを設定します。受信PEは、一度リフレッシュ間隔あたりより新しいリフレッシュタイマ値を要求してはなりません。"
    },
    {
      "indent": 3,
      "text": "The suggested default value for the refresh timer value in the acknowledgment packet is 600 seconds.",
      "ja": "確認応答パケット内のリフレッシュタイマ値の推奨デフォルト値は600秒です。"
    },
    {
      "indent": 3,
      "text": "If the sender PE receives an acknowledgment message that does not match the current active PW status message being sent, it simply ignores the acknowledgment packet.",
      "ja": "送信側PEが送信されている現在アクティブなPWステータスメッセージと一致しない肯定応答メッセージを受信した場合、それは単に肯定応答パケットを無視します。"
    },
    {
      "indent": 3,
      "text": "If a PE that has received a non-zero status code for a PW detects by any means that the far end PE has become unreachable, it will follow the standard defect entry procedures of [RFC6310], Section 6.2.",
      "ja": "PWのために非ゼロのステータスコードを受信したPEは、遠端PEが到達不能になったことを任意の手段により検出された場合、それは[RFC6310]、セクション6.2の標準欠陥エントリー手順に従います。"
    },
    {
      "indent": 0,
      "text": "5.4. MPLS Label Stack",
      "section_title": true,
      "ja": "5.4.  MPLSラベルスタック"
    },
    {
      "indent": 3,
      "text": "With one exception, all PW OAM status messages are sent to the adjacent PE across the PSN tunnel. In many cases, the transmitting PE has no way to determine whether the adjacent PE is an S-PE or a T-PE. This is a necessary behavior to preserve backward compatibility with PEs that do not understand MS-PWs. In the procedures described in this document, there are two possible destinations for the PW OAM status messages: the adjacent PE or the T-PE. Sending a PW status message directly to the T-PE is an enhanced method that is only applicable using PW OAM status messages sent in the PW ACH.",
      "ja": "一つの例外を除いて、全てのPW OAMステータスメッセージは、PSNトンネルを横切って隣接するPEに送られます。多くの場合、送信PEは、隣接するPEは、S-PEまたはT-PEであるかどうかを決定する方法がありません。これは、MS-PWのを理解していないのPEとの下位互換性を維持するために必要な動作です。隣接PEまたはT-PE：この文書に記載されている手順では、PW OAMステータスメッセージのための2つの可能な目的地が存在します。 T-PEに直接PWステータスメッセージを送信すると、PW ACHで送信PW OAMステータスメッセージを使用してのみ適用可能である改良された方法です。"
    },
    {
      "indent": 0,
      "text": "5.4.1. Label Stack for a Message Destined to the Next PE",
      "section_title": true,
      "ja": "5.4.1. 次PE宛のメッセージのためのラベルスタック"
    },
    {
      "indent": 3,
      "text": "A PE that needs to forward a PW OAM status message to the adjacent PE across the PSN tunnel MUST set the PW label TTL field to 1. Furthermore, if the control word is not in use on the particular PW, the PE MUST place the GAL reserved label [RFC5586] below the PW label with the TTL field set to 1.",
      "ja": "制御ワードは、特定のPWで使用されていない場合、さらに1にPWラベルTTLフィールドを設定しなければならないPSNトンネルを横切って隣接するPEにPW OAMステータスメッセージを転送する必要があるPEは、PEは、GALを配置しなければなりません予約ラベル1に設定するTTLフィールドとPWラベル以下[RFC5586]。"
    },
    {
      "indent": 0,
      "text": "5.4.2. Label Stack for a Message Destined to the Egress PE",
      "section_title": true,
      "ja": "5.4.2. 出力PE宛のメッセージのためのラベルスタック"
    },
    {
      "indent": 3,
      "text": "This is also known as \"S-PE bypass mode\"; see below. A T-PE that requires sending a PW OAM status message directly to the corresponding T-PE at the other end of the PW MUST set the TTL of the PW label to a value that is sufficient to reach the corresponding T-PE. This value will be greater than one, but will be set according to the local policy on the transmitting T-PE. Furthermore, if the control word is not in use on the particular PW, the PE MUST also place the GAL reserved label [RFC5586] below the PW label with the TTL field set to 1.",
      "ja": "これはまた、「S-PEバイパスモード」として知られています。下記参照。 PWの他方の端部に対応するT-PEに直接PW OAMステータスメッセージを送信する必要T-PEは、対応するT-PEに到達するのに十分な値にPWラベルのTTLを設定しなければなりません。この値は1よりも大きくなるが、送信T-PEのローカルポリシーに従って設定されます。制御ワードは、特定のPWで使用されていない場合はさらに、PEはまた、1に設定されたTTLフィールドにPWラベル以下GAL予約ラベル[RFC5586]を配置しなければなりません。"
    },
    {
      "indent": 0,
      "text": "5.5. S-PE Bypass Mode",
      "section_title": true,
      "ja": "5.5.  S-INバイパスモード"
    },
    {
      "indent": 3,
      "text": "S-PE bypass mode enables a T-PE that uses LDP as the PW setup and control protocol to bypass all S-PEs that might be present along the MS-PW and to send a message directly to the remote T-PE. This is used for very fast message transmission in-band with the PW PDUs. This mode is OPTIONAL and MUST be supported by both T-PEs to be enabled. This mode MUST NOT be used if the first PW segment connected to each T-PE is not using LDP.",
      "ja": "S-PEバイパスモードはMS-PWに沿って存在するかもしれないし、リモートT-PEに直接メッセージを送信するために、すべてのS-PESをバイパスするようにPWセットアップおよび制御プロトコルとしてLDPを使用してT-PEを可能にします。これは、PWのPDUとのインバンド非常に高速なメッセージを送信するために使用されています。このモードはオプションで、有効にするT-PEの両方でサポートしなければなりません。各T-PEに接続された第一のPWセグメントがLDPを使用していない場合、このモードを使用してはいけません。"
    },
    {
      "indent": 3,
      "text": "Note that this method MUST NOT be used to send messages that are permitted to originate at an S-PE. Otherwise, race conditions could occur between messages sent via the control plane by S-PEs and messages sent via the data plane by T-PEs.",
      "ja": "この方法は、S-PEで発生することを許可されたメッセージを送信するために使用されてはならないことに注意してください。そうでない場合、競合状態は、T-PESによってデータプレーンを介して送信されるS-PESによって制御プレーンを介して送信されたメッセージとメッセージの間に起こり得ます。"
    },
    {
      "indent": 3,
      "text": "Status codes, except for those listed below, MUST NOT be sent using the S-PE bypass procedure and MUST be ignored on reception.",
      "ja": "ステータスコードは、以下に列挙されたものを除いて、S-PEバイパス手順を使用して送信してはいけませんし、受信時には無視されなければなりません。"
    },
    {
      "indent": 6,
      "text": "0x00000002 - Local Attachment Circuit (ingress) Receive Fault",
      "ja": "0x00000002  - ローカル接続回線（入力）障害を受信"
    },
    {
      "indent": 6,
      "text": "0x00000004 - Local Attachment Circuit (egress) Transmit Fault",
      "ja": "0x00000004  - ローカル接続回線（出力）障害を送信"
    },
    {
      "indent": 6,
      "text": "0x00000020 - PW forwarding standby",
      "ja": "0x00000020  -  PW転送スタンバイ"
    },
    {
      "indent": 6,
      "text": "0x00000040 - Request switchover to this PW",
      "ja": "0x00000040  - このPWへの切り替えをリクエスト"
    },
    {
      "indent": 3,
      "text": "Note that since \"clear all failures\" may be sent by an S-PE, it MUST NOT be sent using the S-PE bypass mode.",
      "ja": "「クリアすべての障害は、」S-PEにより送信することができるので、それはS-PEバイパスモードを使用して送信されてはならないことに注意してください。"
    },
    {
      "indent": 3,
      "text": "When S-PE bypass mode is enabled, all PW Status TLVs received using this method have priority over PW Status TLVs sent via control protocols such as LDP [RFC4447]. However, the same PW Status TLVs MUST also be sent in LDP to keep the S-PEs state updated.",
      "ja": "S-PEバイパスモードが有効になっている場合、全てのPWステータスのTLVは、この方法を使用して、受信したそのようなLDP [RFC4447]などの制御プロトコルを介して送信されたPWステータスのTLVを超える優先度を有します。しかし、同じPWステータスのTLVも更新S-PESの状態を維持するためにLDPに送らなければなりません。"
    },
    {
      "indent": 0,
      "text": "5.5.1. S-PE Bypass Mode LDP Flag Bit",
      "section_title": true,
      "ja": "5.5.1.  S-PEバイパスモードLDPフラグビット"
    },
    {
      "indent": 3,
      "text": "When a PW Segment along an MS-PW is using the LDP control protocol and wishes to request the use of the S-PE bypass status message mode, it sets the B bit in the generic protocol flags interface parameters sub-TLV as shown in Figure 3. This flag can only be set by a T-PE using LDP as the PW configuration and management protocol. If the S-PE bypass mode LDP flag bit in the generic protocol flags interface parameter does not match in the FEC advertisement for directions of a specific PW, that PW MUST NOT be enabled.",
      "ja": "MS-PWに沿ったPWセグメントがLDP制御プロトコルを使用し、S-PEバイパス状態メッセージモードの使用を要求することを希望すると、図に示すように、汎用プロトコルフラグインタフェースパラメータサブTLVにBビットをセット3.このフラグは、PWの設定と管理プロトコルとしてLDPを使用して、T-PEによって設定することができます。汎用プロトコルフラグインタフェースパラメータのS-PEバイパスモードLDPフラグビットは、PWが有効にされてはならないこと、特定のPWの方向についてFEC広告に一致しない場合。"
    },
    {
      "indent": 3,
      "text": "The interface parameter is defined as follows:",
      "ja": "次のようにインタフェースパラメータが定義されています。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|    Type=0x18  |   Length=4    |R R R R R R R R R R R R R R R B|\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 16,
      "text": "Figure 3: PW Generic Protocol Flags Sub-TLV",
      "ja": "図3：PW汎用プロトコル国旗サブTLV"
    },
    {
      "indent": 3,
      "text": "TLV Type",
      "ja": "TLVタイプ"
    },
    {
      "indent": 6,
      "text": "Type 0x18 - PW Generic Protocol Flags.",
      "ja": "タイプ0x18の -  PW汎用プロトコルフラグ。"
    },
    {
      "indent": 3,
      "text": "Length",
      "ja": "長さ"
    },
    {
      "indent": 6,
      "text": "TLV length is always 4 octets.",
      "ja": "TLVの長さは常に4つのオクテットです。"
    },
    {
      "indent": 3,
      "text": "Flags",
      "ja": "国旗"
    },
    {
      "indent": 6,
      "text": "Bit B, in position 31 above, is set to request the S-PE bypass mode. R bits are to be allocated by IANA as described in the IANA section. If they are not allocated, they are to be considered as reserved for future use and MUST be zero on transmission and ignored on reception of this TLV.",
      "ja": "ビットBは、上記位置31で、S-PEバイパスモードを要求するように設定されています。 Rビットは、IANAのセクションで説明したようにIANAによって割り当てられるべきです。それらが割り当てられていない場合、彼らは将来の使用のために予約として考慮されるべきであり、送信時にゼロになると、このTLVのレセプションで無視しなければなりません。"
    },
    {
      "indent": 6,
      "text": "If the T-PE receives an LDP label mapping message containing a generic protocol flags interface parameter TLV with the bit B set, then the T-PE receiving the label mapping message MAY send S-PE bypass status messages in the PW ACh. If bit B of said TLV is not set, or the TLV is not present, then the T-PE receiving the label mapping message MUST NOT send S-PE bypass status messages in the PW ACh.",
      "ja": "T-PEは、ビットBが設定された一般的なプロトコルフラグインタフェースパラメータTLVを含むLDPラベルマッピングメッセージを受信した場合、ラベルマッピングメッセージを受信したT-PEはPWのAChでS-PEバイパスステータスメッセージを送信することができます。 TLVは、前記のビットBが設定されていない、またはTLVが存在しないれている場合、ラベルマッピングメッセージを受信したT-PEはPWのAChでS-PEバイパス・ステータス・メッセージを送ってはいけません。"
    },
    {
      "indent": 0,
      "text": "6. S-PE Operation",
      "section_title": true,
      "ja": "6. S-IN操作"
    },
    {
      "indent": 3,
      "text": "The S-PE will operate according to the procedures defined in [RFC6073]. The following additional procedures apply to the case where a static PW segment is switched to a dynamic PW segment that uses LDP, and the case where a static PW segment is switched to another static PW segment.",
      "ja": "S-PEは、[RFC6073]で定義された手順に従って動作します。次の追加の手順は、静的なPWセグメントがLDPを使用して動的PWセグメント、および静的PWセグメントが別の静的PWセグメントに切り替えられた場合に切り替えられた場合に適用されます。"
    },
    {
      "indent": 0,
      "text": "6.1. Static PW to Another Static PW",
      "section_title": true,
      "ja": "6.1. 別の静的PWに静的PW"
    },
    {
      "indent": 3,
      "text": "The procedures that are described in [RFC6073] Section 10 also apply to the case of a static PW switched to another static PW. The LDP header is simply replaced by the PW OAM header; otherwise, the packet format will be identical. The information that is necessary to form an SP-PE TLV MUST be configured in the S-PE, or no SP-PE TLV will be sent. [RFC6073] defines the IANA \"Pseudowire Switching Point PE TLV Type\" registry. In order to support the static PW configuration and addressing scheme, the following new code point has been assigned:",
      "ja": "[RFC6073]セクション10に記載された手順はまた、PWは、別の静的PWに切り替えスタティックの場合に適用されます。 LDPヘッダは単にPW OAMヘッダによって置き換えられます。それ以外の場合は、パケットのフォーマットは同じになります。 SP-PE TLVを形成する必要がある情報は、S-PEで構成する必要があり、または全くSP-PE TLVは、送信されません。 [RFC6073]は、レジストリIANA「ポイントPE TLVタイプスイッチング疑似回線」を定義します。静的PWの設定とアドレス指定方式をサポートするために、次の新しいコードポイントが割り当てられています。"
    },
    {
      "indent": 6,
      "text": "Type  Length   Description\n----  ------   -----------\n0x07      24   Static PW/MPLS-TP PW segment ID of last\n               PW segment traversed",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The format of this TLV is that of the \"Static Pseudowire Sub-TLV\" defined in [RFC6426].",
      "ja": "このTLVのフォーマットは、[RFC6426]で定義された「静的疑似サブTLV」のことです。"
    },
    {
      "indent": 0,
      "text": "6.2. Dynamic PW to Static PW or Vice Versa",
      "section_title": true,
      "ja": "6.2. 静的PW、またはその逆への動的PW"
    },
    {
      "indent": 3,
      "text": "The procedures that are described in Section 10 of [RFC6073] also apply to this situation. However, if the PW label of the LDP-controlled PW segment is withdrawn by the adjacent PE, the S-PE will set the PW status code \"0x00000001 - Pseudowire Not Forwarding\" to the adjacent PW on the static PW segment.",
      "ja": "[RFC6073]のセクション10に記載された手順はまた、このような状況にも適用されます。静的PWセグメントに隣接PWに -  LDP制御PWセグメントのPWラベルが隣接PEによって引き出される場合には、S-PEはPWステータスコード「疑似回線が転送されませんは0x00000001」を設定します。"
    },
    {
      "indent": 3,
      "text": "The S-PE will only withdraw its label for the dynamic, LDP-controlled PW segment if the S-PE is not provisioned.",
      "ja": "S-PEがプロビジョニングされていない場合、S-PEは、ダイナミック、LDP-制御PWセグメントに対してラベルを撤退します。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "ja": "7.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "The security measures described in [RFC4447], [RFC5085], and [RFC6073] are adequate for the proposed mechanism.",
      "ja": "[RFC4447]、[RFC5085]及び[RFC6073]に記載されているセキュリティ対策が提案されたメカニズムのために適切です。"
    },
    {
      "indent": 0,
      "text": "8. IANA Considerations",
      "section_title": true,
      "ja": "8. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has set up the registry of \"PW Generic Protocol Flags\". These are bit strings of length 16. Bit 0 is defined in this document. Bits 1 through 15 are to be assigned by IANA using the \"IETF Review\" policy defined in [RFC5226].",
      "ja": "IANAは、「PW汎用プロトコルフラグ」のレジストリを設定しています。これらは、16ビット0は、この文書で定義された長さのビット列です。ビット1〜15は、[RFC5226]で定義された「IETFレビュー」ポリシーを使用して、IANAによって割り当てられるべきです。"
    },
    {
      "indent": 3,
      "text": "Any requests for allocation from this registry require a description of up to 65 characters.",
      "ja": "このレジストリから配分のための任意の要求は、最大65文字の説明を必要としています。"
    },
    {
      "indent": 3,
      "text": "Initial PW Generic Protocol Flags value allocations are as follows:",
      "ja": "次のように初期PW汎用プロトコルフラグの値の割り当ては、次のとおりです。"
    },
    {
      "indent": 3,
      "text": "Bit Mask     Description\n====================================================================\n0x0001    -  S-PE bypass mode                              [RFC6478]",
      "raw": true
    },
    {
      "indent": 3,
      "text": "This document uses a new Associated Channel Type. IANA already maintains the \"Pseudowire Associated Channel Types\" registry. The value 0x0027 has been assigned with the description \"PW OAM Message\".",
      "ja": "この文書は、新しい関連するチャネルタイプを使用しています。 IANAは、すでに「擬似回線関連するチャネルタイプ」のレジストリを維持します。値0x0027が記述「PW OAMメッセージ」に割り当てられています。"
    },
    {
      "indent": 3,
      "text": "This document uses a new Pseudowire Switching Point PE TLV Type. IANA already maintains the \"Pseudowire Switching Point PE sub-TLV Type\" registry. A value of 0x07 has been assigned with the description \"Static PW/MPLS-TP PW segment ID of last PW segment traversed\".",
      "ja": "この文書では、ポイントPE TLVタイプを切り替え、新たな擬似回線を使用しています。 IANAは、既にレジストリの「ポイントPEサブTLVタイプを切り替える擬似回線」を維持しています。 0x07の値は、説明「横断最後PWセグメントの静的PW / MPLS-TP PWセグメントID」が割り当てられています。"
    },
    {
      "indent": 3,
      "text": "This document uses a new interface parameter type. IANA already maintains the \"Pseudowire Interface Parameters Sub-TLV type Registry\". A value of 0x18 has been assigned with the description \"PW Generic Protocol Flags\".",
      "ja": "この文書は、新しいインタフェースパラメータの型を使用しています。 IANAは、すでに「擬似回線インタフェースパラメータサブTLVタイプレジストリ」を維持しています。 0x18の値が記述「PW汎用プロトコルフラグ」が割り当てられています。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "ja": "9.参考文献"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "ja": "9.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC4385] Bryant, S., Swallow, G., Martini, L., and D. McPherson, \"Pseudowire Emulation Edge-to-Edge (PWE3) Control Word for Use over an MPLS PSN\", RFC 4385, February 2006.",
      "ja": "[RFC4385]ブライアント、S.、ツバメ、G.、マティーニ、L.、およびD.マクファーソン、 \"MPLS PSNの上の使用のための擬似回線エミュレーションエッジツーエッジ（PWE3）制御ワード\"、RFC 4385、2006年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC4447] Martini, L., Ed., Rosen, E., El-Aawar, N., Smith, T., and G. Heron, \"Pseudowire Setup and Maintenance Using the Label Distribution Protocol (LDP)\", RFC 4447, April 2006.",
      "ja": "[RFC4447]、RFC 4447マティーニ、L.、エド。、ローゼン、E.、エルAawar、N.、スミス、T.、およびG.サギ、 \"ラベル配布プロトコル（LDP）を使用して疑似回線の設定とメンテナンス\" 、2006年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC5085] Nadeau, T., Ed., and C. Pignataro, Ed., \"Pseudowire Virtual Circuit Connectivity Verification (VCCV): A Control Channel for Pseudowires\", RFC 5085, December 2007.",
      "ja": "[RFC5085]ナドー、T.、エド、およびC. Pignataro、エド、 \"Pseudowireの仮想回線接続性検証（VCCV）：スードワイヤ用制御チャネル\"。。、RFC 5085、2007年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC5226] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 5226, May 2008.",
      "ja": "[RFC5226] Narten氏、T.とH. Alvestrand、 \"RFCsにIANA問題部に書くためのガイドライン\"、BCP 26、RFC 5226、2008年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC6073] Martini, L., Metz, C., Nadeau, T., Bocci, M., and M. Aissaoui, \"Segmented Pseudowire\", RFC 6073, January 2011.",
      "ja": "[RFC6073]マルティーニ、L.、メス、C.、ナドー、T.、ボッチ、M.、およびM. Aissaoui、 \"セグメント疑似回線\"、RFC 6073、2011年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC6310] Aissaoui, M., Busschbach, P., Martini, L., Morrow, M., Nadeau, T., and Y(J). Stein, \"Pseudowire (PW) Operations, Administration, and Maintenance (OAM) Message Mapping\", RFC 6310, July 2011.",
      "ja": "[RFC6310] Aissaoui、M.、Busschbach、P.、マルティーニ、L.、モロー、M.、ナドー、T.、およびY（J）。スタイン、 \"擬似回線（PW）運用、管理、および保守（OAM）メッセージのマッピング\"、RFC 6310、2011年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC6426] Gray, E., Bahadur, N., Boutros, S., and R. Aggarwal, \"MPLS On-Demand Connectivity Verification and Route Tracing\", RFC 6426, November 2011.",
      "ja": "[RFC6426]グレー、E.、バハドゥール、N.、Boutros、S.、およびR.アガルワル、 \"MPLSオンデマンド接続検証とルートトレース\"、RFC 6426、2011年11月。"
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "ja": "9.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[REDUNDANCY] Muley, P., Ed., and M. Aissaoui, Ed., \"Pseudowire Preferential Forwarding Status Bit\", Work in Progress, September 2011.",
      "ja": "[REDUNDANCY] Muley、P.、エド。、およびM. Aissaoui、エド。、 \"擬似回線優先転送ステータスビット\"、進歩、2011年9月での作業。"
    },
    {
      "indent": 3,
      "text": "[RFC5885] Nadeau, T., Ed., and C. Pignataro, Ed., \"Bidirectional Forwarding Detection (BFD) for the Pseudowire Virtual Circuit Connectivity Verification (VCCV)\", RFC 5885, June 2010.",
      "ja": "[RFC5885]ナドー、T.、エド。、およびC. Pignataro、エド。、 \"Pseudowireの仮想回線接続性検証のための双方向フォワーディング検出（BFD）（VCCV）\"、RFC 5885、2010年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC5586] Bocci, M., Ed., Vigoureux, M., Ed., and S. Bryant, Ed., \"MPLS Generic Associated Channel\", RFC 5586, June 2009.",
      "ja": "[RFC5586]ボッチ、M.、エド。、Vigoureux、M.、エド。、およびS.ブライアント、エド。、 \"MPLSジェネリック関連チャンネル\"、RFC 5586、2009年6月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Luca Martini Cisco Systems, Inc. 9155 East Nichols Avenue, Suite 400 Englewood, CO, 80112 EMail: lmartini@cisco.com",
      "ja": "ルカ・マティーニシスコシステムズ株式会社9155東ニコルズアベニュー、スイート400イングルウッド、CO、80112 Eメール：lmartini@cisco.com"
    },
    {
      "indent": 3,
      "text": "George Swallow Cisco Systems, Inc. 300 Beaver Brook Road Boxborough, Massachusetts 01719 United States EMail: swallow@cisco.com",
      "ja": "ジョージツバメシスコシステムズ社300ビーバーブルック・ロードボックスボロー、マサチューセッツ01719米国電子メール：swallow@cisco.com"
    },
    {
      "indent": 3,
      "text": "Giles Heron Cisco Systems 9-11 New Square Bedfont Lakes Feltham Middlesex TW14 8HA United Kingdom EMail: giheron@cisco.com",
      "ja": "ジャイルズヘロンシスコシステムズ9-11新スクエアBedfont湖フェルサムミドルTW14 8HAイギリスメール：giheron@cisco.com"
    },
    {
      "indent": 3,
      "text": "Matthew Bocci Alcatel-Lucent Voyager Place Shoppenhangers Road Maidenhead Berks SL6 2PJ United Kingdom EMail: matthew.bocci@alcatel-lucent.com",
      "ja": "マシューボッチアルカテル・ルーセントボイジャー場所Shoppenhangers道路メイデンヘッドバークスSL6 2PJイギリスメールアドレス：matthew.bocci@alcatel-lucent.com"
    }
  ]
}