{
  "title": {
    "text": "RFC 6732 - 6to4 Provider Managed Tunnels",
    "ja": "RFC 6732 - 6to4のプロバイダマネージドトンネル"
  },
  "number": 6732,
  "created_at": "2019-10-30 00:18:44.608392+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Independent Submission                                 V. Kuarsingh, Ed.\nRequest for Comments: 6732                         Rogers Communications\nCategory: Informational                                           Y. Lee\nISSN: 2070-1721                                                  Comcast\n                                                              O. Vautrin\n                                                        Juniper Networks\n                                                          September 2012",
      "raw": true
    },
    {
      "indent": 21,
      "text": "6to4 Provider Managed Tunnels",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "6to4 Provider Managed Tunnels (6to4-PMT) provide a framework that can help manage 6to4 tunnels operating in an anycast configuration. The 6to4-PMT framework is intended to serve as an option for operators to help improve the experience of 6to4 operation when conditions of the network may provide sub-optimal performance or break normal 6to4 operation. 6to4-PMT supplies a stable provider prefix and forwarding environment by utilizing existing 6to4 relays with an added function of IPv6 Prefix Translation. This operation may be particularly important in NAT444 infrastructures where a customer endpoint may be assigned a non-RFC1918 address, thus breaking the return path for anycast-based 6to4 operation. 6to4-PMT has been successfully used in a production network, implemented as open source code, and implemented by a major routing vendor.",
      "ja": "6to4のプロバイダマネージドトンネル（6to4の-PMT）は、エニーキャスト構成で動作する6to4トンネルの管理を助けることができるフレームワークを提供します。 6to4の-PMTのフレームワークは、ネットワークの状態がサブ最適なパフォーマンスを提供したり、通常の6to4操作を壊すかもしれ際にオペレーターが6to4の運転の経験を改善するためのオプションとして機能することを目的としています。 6to4の-PMTは、IPv6プレフィックス翻訳の追加機能で、既存の6to4リレーを利用することにより、安定したプロバイダのプレフィックスと転送環境を提供します。この操作は、顧客エンドポイントは、このようにエニーキャストベースの6to4動作のためのリターンパスを破壊、非RFC1918アドレスを割り当てることができるNAT444インフラストラクチャにおいて特に重要であり得ます。 6to4の-PMTが正常に稼働ネットワークで使用されるオープン・ソース・コードとして実装され、主要なルーティングベンダーによって実装されています。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This is a contribution to the RFC Series, independently of any other RFC stream. The RFC Editor has chosen to publish this document at its discretion and makes no statement about its value for implementation or deployment. Documents approved for publication by the RFC Editor are not a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "これは、独立して、他のRFCストリームの、RFCシリーズへの貢献です。 RFC Editorはその裁量でこの文書を公開することを選択し、実装や展開のためにその値についての声明を出すていません。 RFC編集者によって公表のために承認されたドキュメントは、インターネット標準の任意のレベルの候補ではありません。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6732.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6732で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2012 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2012 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n2. Motivation ......................................................3\n3. 6to4 Provider Managed Tunnels ...................................5\n   3.1. 6to4 Provider Managed Tunnel Model .........................5\n   3.2.  Traffic Flow ..............................................5\n   3.3.  Prefix Translation ........................................6\n   3.4.  Translation State .........................................7\n4. Deployment Considerations and Requirements ......................7\n   4.1. Customer Opt-Out ...........................................7\n   4.2. Shared CGN Space Considerations ............................8\n   4.3. End-to-End Transparency ....................................8\n   4.4. Path MTU Discovery Considerations ..........................9\n   4.5. Checksum Management ........................................9\n   4.6. Application Layer Gateways .................................9\n   4.7. Routing Requirements .......................................9\n   4.8. Relay Deployments .........................................10\n5. Security Considerations ........................................10\n6. Acknowledgements ...............................................10\n7. References .....................................................11\n   7.1. Normative References ......................................11\n   7.2. Informative References ....................................11",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "6to4 [RFC3056] tunneling, along with the anycast operation described in [RFC3068], is widely deployed in modern Operating Systems and off-the-shelf gateways sold throughout retail and Original Equipment Manufacturer (OEM) channels. Anycast-based 6to4 [RFC3068] allows for tunneled IPv6 connectivity through IPv4 clouds without explicit configuration of a relay address. Since the overall system utilizes anycast forwarding in both directions, flow paths are difficult to determine, tend to follow separate paths in either direction, and often change based on network conditions. The return path is normally uncontrolled by the local operator and can contribute to poor performance for IPv6 and can also act as a breakage point. Many of the challenges with 6to4 are described in [RFC6343]. A specific critical use case for problematic anycast 6to4 operation is related to conditions in which the consumer endpoints are downstream from a northbound Carrier-Grade NAT (CGN) [RFC6264] function when assigned non-RFC1918 IPv4 addresses, which are not routed on interdomain links.",
      "ja": "[RFC3068]で説明エニーキャスト動作に沿った6to4 [RFC3056]トンネリングは、広く現代のオペレーティングシステムと小売とオリジナル機器製造者（OEM）チャネルを通じて販売されている既製のゲートウェイに配備されています。エニーキャストベースの6to4 [RFC3068]リレーアドレスの明示的な構成なしでのIPv4クラウドを介してトンネルIPv6接続を可能にします。システム全体は、両方向にエニーキャスト転送を利用しているため、流路を決定することは困難であり、いずれかの方向に別々の経路をたどる、しばしばネットワーク条件に基づいて変化する傾向があります。リターンパスは、ローカルオペレータによって正常に制御されていないで、IPv6のパフォーマンスの低下に寄与することができ、また破損ポイントとして機能することができます。 6to4の持つ課題の多くは、[RFC6343]で説明されています。問題のエニーキャスト6to4動作のための特定の重要なユースケースは、消費者のエンドポイントが北から下流された条件に関連しているキャリアグレードNAT（CGN）[RFC6264]機能ドメイン間リンクにルーティングされていない非RFC1918 IPv4アドレスを割り当て。"
    },
    {
      "indent": 3,
      "text": "Operators that are actively deploying IPv6 networks and operate legacy IPv4 access environments may want to utilize the existing 6to4 behavior in customer site resident hardware and software as an interim option to reach the IPv6 Internet in advance of being able to offer full native IPv6. Operators may also need to address the brokenness related to 6to4 operation originating from behind a provider NAT function. 6to4-PMT offers an operator the opportunity to utilize IPv6 Prefix Translation to enable deterministic traffic flow and an unbroken path to and from the Internet for IPv6-based traffic sourced originally from these 6to4 customer endpoints.",
      "ja": "積極的にIPv6のネットワークを展開し、レガシーのIPv4アクセス環境を運用している事業者は、完全なネイティブIPv6を提供することができるという、事前にIPv6インターネットに到達するための暫定的なオプションとして、顧客サイトの常駐ハードウェアおよびソフトウェアの既存の6to4の挙動を利用することができます。オペレータはまた、プロバイダのNAT機能の背後から発信さ6to4の操作に関連した壊れたに対処する必要があるかもしれません。 6to4の-PMTは、オペレータに決定論的トラフィ​​ックフローとすると、これらの6to4顧客のエンドポイントからもともと供給さIPv6ベースのトラフィックのためのインターネットからの切れ目のないパスを有効にするためのIPv6プレフィックス翻訳を利用する機会を提供しています。"
    },
    {
      "indent": 3,
      "text": "6to4-PMT translates the prefix portion of the IPv6 address from the 6to4-generated prefix to a provider-assigned prefix that is used to represent the source. This translation will then provide a stable forward and return path for the 6to4 traffic by allowing the existing IPv6 routing and policy environment to control the traffic. 6to4-PMT is primarily intended to be used in a stateless manner to maintain many of the elements inherent in normal 6to4 operation. Alternatively, 6to4-PMT can be used in a stateful translation mode should the operator choose this option.",
      "ja": "6to4の-PMTは、ソースを表すために使用されているプロバイダに割り当てられたプレフィックスに6to4の生成されたプレフィックスからIPv6アドレスのプレフィックス部分を変換します。この変換は、順方向の安定を提供し、既存のIPv6ルーティングと政策環境がトラフィックを制御できるようにすることで、6to4のトラフィックのパスを返します。 6to4の-PMTは、主に通常の6to4動作に固有の要素の多くを維持するためにステートレスな方法で使用されることを意図しています。また、6to4の-PMTは、オペレータが、このオプションを選択する必要がありステートフル変換モードで使用することができます。"
    },
    {
      "indent": 0,
      "text": "2. Motivation",
      "section_title": true,
      "ja": "2.動機"
    },
    {
      "indent": 3,
      "text": "Many operators endeavor to deploy IPv6 as soon as possible so as to ensure uninterrupted connectivity to all Internet applications and content through the IPv4 to IPv6 transition process. The IPv6 preparations within these organizations are often faced with both financial challenges and timing issues related to deploying IPv6 to the network edge and related transition technologies. Many of the new technologies available for IPv4 to IPv6 transition will require the replacement of the organization's Customer Premises Equipment (CPE) to support technologies like IPv6 Rapid Deployment (6RD) [RFC5969], Dual-Stack Lite [RFC6333], and native dual-stack.",
      "ja": "多くの事業者は、IPv4からIPv6への移行プロセスを介してすべてのインターネットアプリケーションやコンテンツへの中断のない接続性を確保するために、できるだけ早くIPv6を展開するよう努めます。これらの組織内でのIPv6の準備は、多くの場合、ネットワークのエッジと関連する移行テクノロジへのIPv6の展開に関連する財務課題やタイミングの問題の両方に直面しています。 IPv6への移行にIPv4のために利用可能な新技術の多くは、IPv6のRapid Deployment（6RD）[RFC5969]、デュアルスタックライト[RFC6333]、およびネイティブデュアルのような技術をサポートするために、組織の顧客宅内機器（CPE）の交換が必要になりますスタック。"
    },
    {
      "indent": 3,
      "text": "Operators face a number of challenges related to home equipment replacement. Operator-initiated replacement of this equipment will take time due to the nature of mass equipment refresh programs or may require the consumer to replace their own gear. Replacing consumer owned and operated equipment, compounded by the fact that there is also a general unawareness of what IPv6 is, also adds to the challenges faced by operators. It is also important to note that 6to4 is present in much of the equipment found in networks today that do not as of yet, or will not, support 6RD and/or native IPv6.",
      "ja": "オペレータは、家庭用機器の交換に関連する多くの課題に直面しています。この装置のオペレータ起動の交換が原因質量設備の更新プログラムの性質のために時間がかかりますか、自分のギアを交換するために、消費者が必要な場合があります。また、IPv6は何であるかの一般的な無自覚があるという事実によって配合所有消費者や駆動機器を、交換、また、事業者が直面する課題に追加されます。それの6to4はまだのようではないん今日のネットワークで見つかった機器の多くに存在している、または、6RDおよび/またはネイティブIPv6をサポートしていません注意することも重要です。"
    },
    {
      "indent": 3,
      "text": "Operators may still be motivated to provide a form of IPv6 connectivity to customers and would want to mitigate potential issues related to IPv6-only deployments elsewhere on the Internet. Operators also need to mitigate issues related to the fact that 6to4 operation is often on by default, and may be subject to erroneous behavior. The undesired behavior may be related to the use of non-RFC1918 addresses on CPE equipment that operate behind large operator NATs or other conditions as described in a general advisory as laid out in [RFC6343].",
      "ja": "オペレータは、まだ顧客にIPv6接続の形態を提供する動機づけすることができるとIPv6のみのインターネット上の他の場所に展開に関連する潜在的な問題を軽減したいと思います。オペレータはまた、6to4の操作は、デフォルトでは、多くの場合であり、かつ誤った動作を受ける可能性があるという事実に関連する問題を軽減する必要があります。望ましくない現象は、[RFC6343]にレイアウトした一般的なアドバイザリで説明したように大オペレータのNATまたは他の条件の背後動作CPE装置上の非RFC1918アドレスの使用に関連してもよいです。"
    },
    {
      "indent": 3,
      "text": "6to4-PMT allows an operator to help mitigate such challenges by leveraging the existing 6to4 deployment base, while maintaining operator control of access to the IPv6 Internet. It is intended for use when better options, such as 6RD or native IPv6, are not yet viable. One of the key objectives of 6to4-PMT is to also help reverse the negative impacts of 6to4 in CGN environments. The 6to4-PMT operation can also be used immediately with the default parameters that are often enough to allow it to operate in a 6to4-PMT environment. Once native IPv6 is available to the endpoint, the 6to4-PMT operation is no longer needed and will cease to be used based on correct address selection behaviors in end hosts [RFC6724].",
      "ja": "IPv6インターネットへのアクセスのオペレータ制御を維持しながらの6to4-PMTは、オペレータは、既存の6to4展開ベースを活用することによって、このような問題を軽減することを可能にします。このよう6RDやネイティブIPv6などのより良いオプションは、まだ生きていないときに使用するためのものです。 6to4の-PMTの重要な目的の一つは、また、CGN環境での6to4のマイナスの影響を逆に支援することです。 6to4の-PMTの動作も、多くの場合、それは6to4の-PMTの環境で動作することを可能にするのに十分なされているデフォルトのパラメータですぐに使用することができます。ネイティブIPv6がエンドポイントに利用可能になると、6to4の-PMT動作はもはや必要ないとエンドホストにおける正しいアドレス選択挙動[RFC6724]に基づいて使用されることを停止します。"
    },
    {
      "indent": 3,
      "text": "6to4-PMT thus helps operators remove the impact of 6to4 in CGN environments, deals with the fact that 6to4 is often on by default, and allows access to IPv6-only endpoints from IPv4-only addressed equipment. Additionally, it provides relief from many challenges related to mis-configurations in other networks that control return flows via foreign relays. Due to the simple nature of 6to4-PMT, it can also be implemented in a cost-effective and simple manner, allowing operators to concentrate their energy on deploying native IPv6.",
      "ja": "6to4の-PMTは、このように、事業者はCGN環境での6to4の影響を取り除くことができた6to4は、デフォルトでは、多くの場合であるという事実を扱う、とIPv4のみの対処機器からIPv6のみのエンドポイントへのアクセスを可能にします。さらに、それは外国のリレーを経由して戻り流れを制御する他のネットワークにおける誤設定に関連する多くの課題からの救済を提供します。原因の6to4-PMTの簡単な性質のために、それはまた、事業者はネイティブIPv6を導入する上で彼らのエネルギーを集中することができ、費用対効果と簡単な方法で実現することができます。"
    },
    {
      "indent": 0,
      "text": "3. 6to4 Provider Managed Tunnels",
      "section_title": true,
      "ja": "3. 6to4のプロバイダマネージドトンネル"
    },
    {
      "indent": 0,
      "text": "3.1. 6to4 Provider Managed Tunnel Model",
      "section_title": true,
      "ja": "3.1.  6to4のプロバイダマネージドトンネルモデル"
    },
    {
      "indent": 3,
      "text": "The 6to4 managed tunnel model behaves like a standard 6to4 service between the customer IPv6 host or gateway, and the 6to4-PMT Relay (within the provider domain). The 6to4-PMT Relay shares properties with 6RD [RFC5969] by decapsulating and forwarding encapsulated IPv6 flows within an IPv4 packet to the IPv6 Internet. The model provides an additional function that translates the source 6to4 prefix to a provider-assigned prefix that is not found in 6RD [RFC5969] or traditional 6to4 operation.",
      "ja": "6to4トンネル管理モデルは、顧客のIPv6ホストやゲートウェイと6to4-PMTリレー（プロバイダドメイン内）との間の標準的な6to4サービスのように振る舞います。 6to4の-PMTリレーデカプセル化および転送カプセル化されたIPv6は、IPv6インターネットへのIPv4パケット内に流入することによって6RD [RFC5969]と特性を共有します。モデルは6RD [RFC5969]または従来の6to4操作中に見出されないプロバイダに割り当てられたプレフィックスに、ソースの6to4プレフィックスを変換する追加の機能を提供します。"
    },
    {
      "indent": 3,
      "text": "The 6to4-PMT Relay is intended to provide a stateless (or stateful) mapping of the 6to4 prefix to a provider supplied prefix.",
      "ja": "6to4の-PMTリレーは接頭供給プロバイダへの6to4プリフィックスのマッピングをステートレス（またはステートフル）を提供することを目的とします。"
    },
    {
      "indent": 29,
      "text": "| 6to4-PMT Operation |",
      "ja": "| 6to4の-PMTの操作|"
    },
    {
      "indent": 10,
      "text": "+-----+ 6to4 Tunnel +--------+  +------+  IPv6    +----+\n| CPE |-------------|6to4 BR |--| PT66 |--------- |Host|\n+-----+    IPv4     +--------+  +------+ Provider +----+\n          Network                         Prefix\n                     Unified or Separate\n                      Functions/Platforms",
      "raw": true
    },
    {
      "indent": 20,
      "text": "Figure 1: 6to4-PMT Functional Model",
      "ja": "図1：6to4の-PMT機能モデル"
    },
    {
      "indent": 3,
      "text": "This mode of operation is seen as beneficial when compared to broken 6to4 paths and/or environments where 6to4 operation may be functional but highly degraded.",
      "ja": "6to4の動作は、機能が、高度に分解することができるの6to4経路及び/又は環境を破壊するために比較した場合、この動作モードは有益と見なされます。"
    },
    {
      "indent": 0,
      "text": "3.2. Traffic Flow",
      "section_title": true,
      "ja": "3.2. 交通流"
    },
    {
      "indent": 3,
      "text": "Traffic in the 6to4-PMT model is intended to be controlled by the operator's IPv6 peering operations. Egress traffic is managed through outgoing routing policy, and incoming traffic is influenced by the operator-assigned prefix advertisements using normal interdormain routing functions.",
      "ja": "6to4の-PMTモデルのトラフィックは、オペレータのIPv6ピアリングの操作によって制御されることを意図しています。出力トラフィックは、発信ルーティングポリシーによって管理され、着信トラフィックが通常のinterdormainルーティング機能を使用してオペレータに割り当てられたプレフィックス広告の影響を受けています。"
    },
    {
      "indent": 3,
      "text": "The routing model is as predictable as native IPv6 traffic and legacy IPv4-based traffic. Figure 2 provides a view of the routing topology needed to support this relay environment. The diagram references PrefixA as 2002::/16 and PrefixB as the example 2001:db8::/32.",
      "ja": "ルーティングモデルは、ネイティブIPv6トラフィックとレガシーIPv4ベースのトラフィックのように予測可能です。図2は、このリレー環境をサポートするために必要なルーティングトポロジのビューを提供します。図2002としてPrefixAを参照:: / 16とPrefixB例2001のように：DB8 :: / 32。"
    },
    {
      "indent": 8,
      "text": "|  6to4 IPv4 Path     |       Native IPv6 Path            |\n       -----------       -----------      -------------\n      /  IPv4 Net \\     /  IPv6 Net  \\  / IPv6 Internet \\\n+------+         +--------+         +-------+    +---------+\n| CPE  | PrefixA |6to4-PMT| PrefixB |Peering|    |IPv6 HOST|\n+------+         +--------+         +-------+    +---------+\n      \\           /     \\            /  \\               /\n       ----------        ------------     --------------",
      "raw": true
    },
    {
      "indent": 16,
      "text": "IPv4 6to4       IPv6 Provider       IPv6 Prefix\n Anycast           Prefix           Propagation",
      "raw": true
    },
    {
      "indent": 23,
      "text": "Figure 2: 6to4-PMT Flow Model",
      "ja": "図2：6to4の-PMTフローモデル"
    },
    {
      "indent": 3,
      "text": "Traffic between two 6to4-enabled devices would use the IPv4 path for communication according to [RFC3056] unless the local host still prefers traffic via a relay. 6to4-PMT is intended to be deployed in conjunction with the 6to4 relay function in an attempt to help simplify its deployment. The model can also provide the ability for an operator to forward both 6to4-PMT (translated) and normal 6to4 flows (untranslated) simultaneously based on configured policy.",
      "ja": "ローカルホストが依然としてリレーを介してトラフィックを優先しない限り2の6to4対応デバイス間のトラフィックは、[RFC3056]によれば、通信のためのIPv4経路を使用します。 6to4の-PMTは、その展開を簡素化する試みで6to4リレー機能と連動して展開することを意図しています。モデルはまた、6to4の-PMT（翻訳）と同時に設定されたポリシーに基づいて、通常の6to4フロー（未変換）の両方を転送するオペレータのための能力を提供することができます。"
    },
    {
      "indent": 0,
      "text": "3.3. Prefix Translation",
      "section_title": true,
      "ja": "3.3. プレフィックス翻訳"
    },
    {
      "indent": 3,
      "text": "IPv6 Prefix Translation is a key part of the system as a whole. The 6to4-PMT framework is a combination of two concepts: 6to4 [RFC3056] and IPv6 Prefix Translation. IPv6 Prefix Translation, as used in 6to4-PMT, has some similarities to concepts discussed in [RFC6296]. 6to4-PMT would provide prefix translation based on specific rules configured on the translator that maps the 6to4 2002::/16 prefix to an appropriate provider assigned prefix. In most cases, a ::/32 prefix would work best in 6to4-PMT that matches common Regional Internet Registry (RIR) prefix assignments to operators.",
      "ja": "IPv6のプレフィックス翻訳は、システム全体の重要な部分です。 6to4の[RFC3056]とIPv6プレフィックス翻訳：の6to4-PMTフレームワークは二つの概念の組み合わせです。 6to4の-PMTで使用されるのIPv6プレフィックス変換は、[RFC6296]で説明した概念のいくつかの類似点を有しています。 6to4の-PMTは、6to4 2002 ::適切なプロバイダに割り当てられ接頭辞に/ 16のプレフィックスをマップ翻訳者で構成された特定のルールに基づいて、接頭辞の翻訳を提供することになります。ほとんどの場合、:: / 32のプレフィックスは、事業者に共通する地域インターネットレジストリ（RIR）プレフィックスの割り当てに一致した6to4-PMTに最もよく働くだろう。"
    },
    {
      "indent": 3,
      "text": "The provider can use any prefix mapping strategy they so choose, but the simpler the better. Simple direct bitmapping can be used, or more advanced forms of translation should the operator want to achieve higher address compression. More advanced forms of translation may require the use of stateful translation.",
      "ja": "プロバイダは、彼らが選択した任意のプレフィックスマッピング戦略を使用しますが、単純に良くすることができます。シンプルな直接ビットマッピングを使用することができ、または翻訳のより高度なフォームは、オペレータは、上位アドレスの圧縮を達成したいはずです。翻訳のより高度なフォームは、ステートフルな翻訳を使用する必要があります。"
    },
    {
      "indent": 3,
      "text": "Figure 3 shows a 6to4 Prefix with a Subnet-ID of \"0000\" mapped to a provider-assigned, globally unique prefix (2001:db8::/32). With this simple form of translation, there is support for only one Subnet-ID per provider-assigned prefix. In characterization of deployed OSs and gateways, a Subnet-ID of \"0000\" is the most common default case followed by Subnet-ID \"0001\". Use of the Subnet-ID can be referenced in [RFC4291]. It should be noted that in normal 6to4 operation, the endpoint (network) has access to 65,536 (16-bits) Subnet IDs. In the",
      "ja": "図3は、サブネットID「0000」のプロバイダに割り当てられ、グローバルに一意のプレフィックス（：DB8 :: / 32 2001）にマッピングされたとの6to4プレフィックスを示しています。翻訳のこの単純な形では、プロバイダに割り当てられたプレフィックスごとに1つだけのサブネットIDのためのサポートがあります。展開のOSとゲートウェイの特性評価では、サブネットID「0000」のは、サブネットID「0001」に続いて、最も一般的なデフォルトのケースです。サブネットIDの使用は[RFC4291]で参照することができます。通常の6to4動作において、エンドポイント（ネットワーク）が65,536（16ビット）、サブネットIDへのアクセスを有することに留意すべきです。の中に"
    },
    {
      "indent": 3,
      "text": "6to4-PMT case as described above using the mapping in Figure 3, all but the one Subnet-ID used for 6to4-PMT would still operate under normal 6to4 operation.",
      "ja": "全て依然として通常の6to4動作の下で動作することになるの6to4-PMTのために使用されるものサブネットIDしかし図3のマッピングを使用して上記のようの6to4-PMTケース。"
    },
    {
      "indent": 6,
      "text": "Pre-Relayed Packet [Provider Access Network Side]",
      "ja": "事前中継されたパケット[プロバイダーアクセスネットワーク側]"
    },
    {
      "indent": 6,
      "text": "0     16      32     48     64    80     96     112    128 Bits\n| ---- | ---- | ---- | ---- | ---- | ---- | ---- | ---- |\n  2002 : 0C98 : 2C01 : 0000 : xxxx : xxxx : xxxx : xxxx\n| ---- | ---- | ---- | ---- | ---- | ---- | ---- | ---- |\n           |       |            |      |      |      |\n            ----    ----        |      |      |      |\n                |       |       |      |      |      |\n| ---- | ---- | ---- | ---- | ---- | ---- | ---- | ---- |\n  2001 : 0db8 : 0c98 : 2c01 : xxxx : xxxx : xxxx : xxxx\n| ---- | ---- | ---- | ---- | ---- | ---- | ---- | ---- |",
      "raw": true
    },
    {
      "indent": 6,
      "text": "Post-Relayed Packet [Internet Side]",
      "ja": "ポスト中継されたパケット[インターネットサイド]"
    },
    {
      "indent": 21,
      "text": "Figure 3: 6to4-PMT Prefix Mapping",
      "ja": "図3の6to4-PMTプレフィックスマッピング"
    },
    {
      "indent": 0,
      "text": "3.4. Translation State",
      "section_title": true,
      "ja": "3.4. 変換状態"
    },
    {
      "indent": 3,
      "text": "It is preferred that the overall system use deterministic prefix translation mappings such that stateless operation can be implemented. This allows the provider to place N number of relays within the network without the need to manage translation state. Deterministic translation also allows a customer to employ inward services using the translated (provider prefix) address.",
      "ja": "全体的なシステムはステートレスな操作を実現することができるような決定論的プレフィックス変換マッピングを使用することが好ましいです。これは、プロバイダは変換状態を管理することなく、ネットワーク内のリレーのN数を配置することができます。決定論的な翻訳はまた、顧客が翻訳された（プロバイダプレフィックス）アドレスを使用して内側のサービスを利用することができます。"
    },
    {
      "indent": 3,
      "text": "If stateful operation is chosen, the operator would need to validate state and routing requirements particular to that type of deployment. The full body of considerations for this type of deployment is not within this scope of this document.",
      "ja": "ステートフルな操作を選択した場合、オペレータは、展開の種類に特定の状態とルーティングの要件を検証する必要があります。このタイプの配置のための考慮事項の完全なボディは、このドキュメントのこの範囲内ではありません。"
    },
    {
      "indent": 0,
      "text": "4. Deployment Considerations and Requirements",
      "section_title": true,
      "ja": "4.展開の考慮事項および要件"
    },
    {
      "indent": 0,
      "text": "4.1. Customer Opt-Out",
      "section_title": true,
      "ja": "4.1. お客様のオプトアウト"
    },
    {
      "indent": 3,
      "text": "A provider enabling this function should offer a method to allow customers to opt-out of such a service should the customer choose to maintain normal 6to4 operation irrespective of degraded performance. In cases where the customer is behind a CGN device, the customer would not be advised to opt-out and can be assisted in turning off 6to4.",
      "ja": "この機能を有効にするプロバイダは、顧客が関係なく、性能劣化の通常の6to4動作を維持することを選択しなければならない顧客は、このようなサービスのオプトアウトできるようにする方法を提供する必要があります。顧客がCGNデバイスの背後にある場合には、顧客がオプトアウトすることをお勧めすることはないだろうと6to4をオフに支援することができます。"
    },
    {
      "indent": 3,
      "text": "Since the 6to4-PMT system is targeted at customers who are relatively unaware of IPv6 and IPv4, and normally run network equipment with a default configuration, an opt-out strategy is recommended. This method provides 6to4-PMT operation for non-IPv6 savvy customers whose equipment may turn on 6to4 automatically and allows savvy customers to easily configure their way around the 6to4-PMT function.",
      "ja": "6to4の-PMTシステムがIPv6とIPv4の比較的知らない顧客を対象に、通常はデフォルトの設定でネットワーク機器を実行しているので、オプトアウト戦略が推奨されます。この方法は、機器に自動的に6to4のと精通した顧客が簡単に6to4の-PMT機能の周りに彼らの方法を設定することができますをオンにして非IPv6の精通した顧客のための6to4-PMTの操作を提供します。"
    },
    {
      "indent": 3,
      "text": "Capable customers can also disable anycast-based 6to4 entirely and use traditional 6to4 or other tunneling mechanisms if they are so inclined. This is not considered the normal case, and most endpoints with auto-6to4 functions will be subject to 6to4-PMT operation since most users are unaware of its existence. 6to4-PMT is targeted as an option for stable IPv6 connectivity for average consumers.",
      "ja": "対応の顧客はまた、エニーキャストベースの6to4を完全に無効にして、彼らが傾斜している場合は、伝統的な6to4のか、他のトンネリングメカニズムを使用することができます。これは通常のケースと見なされず、ほとんどのユーザーはその存在に気づいていないため、自動6to4の機能を持つほとんどのエンドポイントは、6to4-PMT操作の対象になります。 6to4の-PMTは、平均的な消費者のための安定したIPv6接続のためのオプションとして、目標とされます。"
    },
    {
      "indent": 0,
      "text": "4.2. Shared CGN Space Considerations",
      "section_title": true,
      "ja": "4.2. 共有CGNスペースの考慮事項"
    },
    {
      "indent": 3,
      "text": "6to4-PMT operation can also be used to mitigate a known problem with 6to4 occurring when shared address space [RFC6598] or Global Unicast Addresses (GUA) are used behind a CGN and not routed on the Internet. Non-RFC1918, yet unrouted (on interdomain links) address space would cause many deployed OSs and network equipment to potentially auto-enable 6to4 operation even without a valid return path (such as behind a CGN function). The operator's desire to use non-RFC1918 addresses, such as shared address space [RFC6598], is considered highly likely based on real world deployments.",
      "ja": "6to4の-PMT動作も共有アドレス空間[RFC6598]またはグローバルユニキャストアドレス（GUA）がCGNの背後に使用され、インターネット上でルーティングされていない場合に発生するの6to4の既知の問題を軽減するために使用することができます。非RFC1918、まだ（ドメイン間リンク上の）未配線のアドレス空間であっても（例えばCGN機能の後ろなど）、有効なリターンパスなしで潜在的に自動有効6to4の操作に多くの展開のOSやネットワーク機器を引き起こします。そのような共有アドレススペース[RFC6598]などの非RFC1918アドレスを使用する事業者の願望は、現実世界の展開に基づいて可能性が高いと考えられています。"
    },
    {
      "indent": 3,
      "text": "Such hosts, in normal cases, would send 6to4 traffic to the IPv6 Internet via the anycast relay, which would in fact provide broken IPv6 connectivity, since the return path flow is built using an IPv4 address that is not routed or assigned to the source network. The use of 6to4-PMT would help reverse these effects by translating the 6to4 prefix to a provider-assigned prefix, masking this automatic and undesired behavior.",
      "ja": "リターンパスフローが構築されているので、このようなホストは、通常の場合には、ソース・ネットワークにルーティングされ又は割り当てられていないIPv4アドレスを使用して、実際には壊れたIPv6接続を提供するエニーキャスト中継を介してIPv6インターネットへの6to4トラフィックを送信することになります。 6to4の-PMTの使用は、この自動および望ましくない行動をマスキング、プロバイダに割り当てられたプレフィックスに6to4の接頭語を翻訳することによって、これらの効果を逆に役立つだろう。"
    },
    {
      "indent": 0,
      "text": "4.3. End-to-End Transparency",
      "section_title": true,
      "ja": "4.3. エンドツーエンドの透明性"
    },
    {
      "indent": 3,
      "text": "The 6to4-PMT mode of operation removes the traditional end-to-end transparency of 6to4. Remote hosts would connect to a 6to4-PMT-serviced host using a translated IPv6 address versus the original 6to4 address based on the 2002::/16 well-known prefix. This can be seen as a disadvantage of the 6to4-PMT system. This lack of transparency should also be contrasted with the normal operating state of 6to4 that provides connectivity that is uncontrolled and often prone to high latency. The lack of transparency is, however, a better form of operation when extreme poor performance, broken IPv6 connectivity, or no IPv6 connectivity is considered as the alternative.",
      "ja": "動作の6to4-PMTモードは、6to4の伝統的なエンドツーエンドの透明性を除去します。リモートホストは、翻訳されたIPv6を使用した6to4-PMT-サービスホストに接続します2002 :: / 16のよく知られたプレフィックスに基づいて、元の6to4アドレス対取り組みます。これは、6to4-PMTシステムの欠点として見ることができます。透明性の欠如はまた、制御されていないと高遅延にしばしば傾向があるの接続性を提供した6to4の通常の動作状態と対比されなければなりません。透明性の欠如は、しかし、極端なパフォーマンスの低下、壊れたIPv6接続、または全くIPv6接続が代替手段として考えられている操作のより良い形です。"
    },
    {
      "indent": 0,
      "text": "4.4. Path MTU Discovery Considerations",
      "section_title": true,
      "ja": "4.4. パスMTUディスカバリの考慮事項"
    },
    {
      "indent": 3,
      "text": "The MTU will be subject to a reduced value due to standard 6to4 tunneling operation. Under normal 6to4 operation, the 6to4 service agent would send an ICMP Packet Too Big Message as part of Path MTU discovery as described in [RFC4443] and [RFC1981], respectively. In 6to4-PMT operation, the PMT Service agent should be aware of the reduced 6to4 MTU and send ICMP messages using the translated address accordingly.",
      "ja": "MTUが原因標準の6to4トンネリング動作に減少値を受けることになります。それぞれ、[RFC4443]と[RFC1981]で説明したように、通常の6to4動作では、6to4サービス・エージェントは、パスMTUディスカバリの一環として、ICMPパケット過大メッセージを送信します。 6to4の-PMTの動作では、PMTサービス・エージェントは、MTUの6to4の減少を認識し、それに応じて変換されたアドレスを使用してICMPメッセージを送信する必要があります。"
    },
    {
      "indent": 3,
      "text": "It is also possible to pre-constrain the MTU at the upstream router from the 6to4-PMT service agents that would then have the upstream router send the appropriate ICMP Packet Too Big Messages.",
      "ja": "その後、上流のルータは適切なICMPパケット過大メッセージを送る必要がありますの6to4-PMTサービス・エージェントから上流のルータでMTUを事前に制約することも可能です。"
    },
    {
      "indent": 0,
      "text": "4.5. Checksum Management",
      "section_title": true,
      "ja": "4.5. チェックサムの管理"
    },
    {
      "indent": 3,
      "text": "Checksum management for 6to4-PMT can be implemented in one of two ways. The first deployment model is based on the stateless 6to4-PMT operational mode. In this case, checksum modifications are made using the method described in [RFC3022], Section 4.2. The checksum is modified to match the parameters of the translated address of the source 6to4-PMT host. In the second deployment model in which stateful 6to4-PMT translation is used, the vendor can implement checksum-neutral mappings as defined in [RFC6296].",
      "ja": "6to4の-PMTのためのチェックサム管理は、次のいずれかの方法で実現することができます。最初の展開モデルはステートレスの6to4-PMT動作モードに基づいています。この場合、チェックサムの変更は、[RFC3022]に記載された方法、セクション4.2を使用して作られます。チェックサムは、送信元の6to4-PMTホストの変換されたアドレスのパラメータと一致するように修正されます。 [RFC6296]で定義されるように、ステートフルの6to4-PMT変換を用いた第二の展開モデルでは、ベンダーは、チェックサム中立マッピングを実現することができます。"
    },
    {
      "indent": 0,
      "text": "4.6. Application Layer Gateways",
      "section_title": true,
      "ja": "4.6. アプリケーション層ゲートウェイ"
    },
    {
      "indent": 3,
      "text": "Vendors can choose to deploy Application Layer Gateways (ALGs) on their platforms that perform 6to4-PMT if they so choose. No ALGs were deployed as part of the open source and vendor product deployments of 6to4-PMT. In the vendor deployment case, the same rules were used as with their NPTv6 [RFC6296] base code.",
      "ja": "ベンダーは、彼らがそう選択した場合の6to4-PMTを実行し、そのプラットフォーム上でアプリケーションレイヤゲートウェイ（ALG）を展開することを選択できます。何のALGは、6to4の-PMTのオープンソースとベンダー製品の展開の一部として展開されませんでした。ベンダ配備場合、同じ規則は、それらNPTv6 [RFC6296]ベースコードのように使用しました。"
    },
    {
      "indent": 0,
      "text": "4.7. Routing Requirements",
      "section_title": true,
      "ja": "4.7. ルーティングの要件"
    },
    {
      "indent": 3,
      "text": "The provider would need to advertise the well-known IP address range used for normal anycast 6to4 [RFC3068] operation within the local IPv4 routing environment. This advertisement would attract the 6to4 upstream traffic to a local relay. To control this environment and make sure all northbound traffic lands on a provider-controlled relay, the operator may filter the anycast range from being advertised from customer endpoints toward the local network (upstream propagation).",
      "ja": "プロバイダは、ローカルIPv4ルーティング環境内で正常エニーキャストの6to4 [RFC3068]動作に使用されるよく知られたIPアドレス範囲をアドバタイズする必要があります。この広告は、地元のリレーに6to4のアップストリームトラフィックを引き付けるでしょう。この環境を制御し、プロバイダ制御リレーに確認すべてのノースバウンドトラフィックランドを作るために、オペレータは、ローカルネットワーク（上流伝播）に向かって顧客エンドポイントから広告されているからエニーキャスト範囲をフィルタリングすることができます。"
    },
    {
      "indent": 3,
      "text": "The provider would not be able to control route advertisements inside the customer domain, but that use case is not in scope for this document. In that case, it is likely that the end network/customer understands 6to4 and is maintaining their own relay environment and therefore would not be subject to the operators 6to4 and/or PMT operation.",
      "ja": "プロバイダは、顧客ドメイン内のルートアドバタイズメントをコントロールすることはできないだろうが、そのユースケースは、このドキュメントの範囲ではありません。その場合には、エンドネットワーク/顧客は6to4の理解と自分のリレー環境を維持して、したがって、6to4のオペレータ及び/又はPMT動作を受けることはないであろうと思われます。"
    },
    {
      "indent": 3,
      "text": "Within their own network, the provider would also likely want to advertise the 2002::/16 range to help bridge traditional 6to4 traffic within the network (native IPv6 to 6to4-PMT-based endpoint). It would also be advised that the local 6to4-PMT operator not leak the well-known 6to4 anycast IPv4 prefix to neighboring Autonomous Systems to prevent PMT operation for neighboring networks. Policy configuration on the local 6to4-PMT Relay can also be used to disallow PMT operation should the local provider service downstream customer networks.",
      "ja": "独自のネットワーク内では、プロバイダもありそう（6to4の-PMTベースのエンドポイントにネイティブIPv6）ネットワーク内の伝統的なの6to4トラフィックを埋めるために2002 :: / 16の範囲を宣伝したいと思います。また、ローカルの6to4-PMTオペレータが隣接するネットワークのPMT動作を防止するために、隣接する自律システムの周知の6to4エニーキャストIPv4のプレフィックスを漏れないことをお勧めされるであろう。地元の6to4リレー-PMTのポリシー設定もすべきローカルプロバイダサービス下流の顧客ネットワークPMTの操作を禁止するために使用することができます。"
    },
    {
      "indent": 0,
      "text": "4.8. Relay Deployments",
      "section_title": true,
      "ja": "4.8. リレーの展開"
    },
    {
      "indent": 3,
      "text": "The 6to4-PMT function can be deployed onto existing 6to4 relays (if desired) to help minimize network complexity and cost. 6to4-PMT has already been developed on Linux-based platforms that are package add-ons to the traditional 6to4 code. The only additional considerations beyond normal 6to4 relay operation would include the need to route specific IPv6 provider prefix ranges used for 6to4-PMT operation towards peers and transit providers.",
      "ja": "6to4の-PMT機能は、ネットワークの複雑さとコストを最小限に抑えるために、既存の6to4リレー（所望の場合）上に展開することができます。 6to4の-PMTは、すでに伝統的な6to4のコードにパッケージのアドオンですLinuxベースのプラットフォーム上で開発されてきました。通常の6to4リレーの動作を超えた唯一の追加の考慮事項は、ピアとトランジットプロバイダーへの6to4の-PMTの操作のために使用されるルートの特定のIPv6プロバイダーのプレフィックス範囲にする必要が含まれます。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "6to4-PMT operation would be subject to the same security concerns as normal 6to4 operation as described in [RFC6169]. 6to4-PMT is also not plainly perceptible by external hosts, and local entities appear as native IPv6 hosts to the external hosts.",
      "ja": "[RFC6169]に記載されているように6to4の-PMT動作は通常の6to4動作と同じセキュリティ上の懸念の対象となります。 6to4の-PMTは、外部ホストでもはっきり知覚ではなく、ネイティブのIPv6は、外部のホストにホストとしてローカルエンティティが表示されます。"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgements",
      "section_title": true,
      "ja": "6.謝辞"
    },
    {
      "indent": 3,
      "text": "Thanks to the following people for their textual contributions and/or guidance on 6to4 deployment considerations: Dan Wing, Wes George, Scott Beuker, JF Tremblay, John Brzozowski, Chris Metz, and Chris Donley.",
      "ja": "そのテキストの貢献および/または6to4の展開の考慮事項に関するガイダンスについては、以下の人々に感謝：ダン・ウィング、ウェス・ジョージ、スコットBeuker、JFトレンブレイ、ジョンBrzozowski、クリス・メッツ、とクリスDonley。"
    },
    {
      "indent": 3,
      "text": "Additional thanks to the following for assisting with the coding and testing of 6to4-PMT: Marc Blanchet, John Cianfarani, Tom Jefferd, Nik Lavorato, Robert Hutcheon, and Ida Leung.",
      "ja": "6to4の-PMTのコーディングとテストを支援するために、次の追加のおかげ：マルク・ブランシェ、ジョンCianfarani、トムJefferd、ニックLavorato、ロバートHutcheon、および井田レオン。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7.参考"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "ja": "7.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC3056] Carpenter, B. and K. Moore, \"Connection of IPv6 Domains via IPv4 Clouds\", RFC 3056, February 2001.",
      "ja": "[RFC3056]カーペンター、B.およびK.ムーア、RFC 3056、2001年2月 \"のIPv4クラウドを介したIPv6ドメインの接続\"。"
    },
    {
      "indent": 3,
      "text": "[RFC3068] Huitema, C., \"An Anycast Prefix for 6to4 Relay Routers\", RFC 3068, June 2001.",
      "ja": "[RFC3068]のHuitema、C.、 \"6to4のリレールーターのエニーキャストプレフィックス\"、RFC 3068、2001年6月。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "ja": "7.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC1981] McCann, J., Deering, S., and J. Mogul, \"Path MTU Discovery for IP version 6\", RFC 1981, August 1996.",
      "ja": "[RFC1981]マッキャン、J.、デアリング、S.、およびJ.ムガール人、RFC 1981、1996年8月 \"IPバージョン6のパスMTUディスカバリー\"。"
    },
    {
      "indent": 3,
      "text": "[RFC3022] Srisuresh, P. and K. Egevang, \"Traditional IP Network Address Translator (Traditional NAT)\", RFC 3022, January 2001.",
      "ja": "[RFC3022] Srisuresh、P.とK. Egevang、 \"伝統的なIPネットワークアドレス変換（NAT繁体字）\"、RFC 3022、2001年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC4291] Hinden, R. and S. Deering, \"IP Version 6 Addressing Architecture\", RFC 4291, February 2006.",
      "ja": "[RFC4291] HindenとR.とS.デアリング、 \"IPバージョン6アドレッシング体系\"、RFC 4291、2006年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC4443] Conta, A., Deering, S., and M. Gupta, Ed., \"Internet Control Message Protocol (ICMPv6) for the Internet Protocol Version 6 (IPv6) Specification\", RFC 4443, March 2006.",
      "ja": "[RFC4443]コンタ、A.、デアリング、S.、およびM.グプタ、エド。、 \"インターネット制御メッセージプロトコル（ICMPv6の）インターネットプロトコルバージョン6（IPv6）の仕様について\"、RFC 4443、2006年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC5969] Townsley, W. and O. Troan, \"IPv6 Rapid Deployment on IPv4 Infrastructures (6rd) -- Protocol Specification\", RFC 5969, August 2010.",
      "ja": "[RFC5969] Townsley、W.およびO. Troan、 \"IPv4の基盤のIPv6のRapid Deployment（6rd） - プロトコル仕様\"、RFC 5969、2010年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC6169] Krishnan, S., Thaler, D., and J. Hoagland, \"Security Concerns with IP Tunneling\", RFC 6169, April 2011.",
      "ja": "[RFC6169]クリシュナン、S.、ターラー、D.、およびJ.ホーグランド、 \"IPトンネリングとセキュリティの懸念\"、RFC 6169、2011年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC6264] Jiang, S., Guo, D., and B. Carpenter, \"An Incremental Carrier-Grade NAT (CGN) for IPv6 Transition\", RFC 6264, June 2011.",
      "ja": "[RFC6264]江、S.、郭、D.、およびB.カーペンター、 \"増分キャリアグレードNAT IPv6移行のための（CGN）\"、RFC 6264、2011年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC6296] Wasserman, M. and F. Baker, \"IPv6-to-IPv6 Network Prefix Translation\", RFC 6296, June 2011.",
      "ja": "[RFC6296]ワッサーマン、M.およびF.ベイカー、 \"IPv6の対IPv6ネットワークプレフィックス翻訳\"、RFC 6296、2011年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC6333] Durand, A., Droms, R., Woodyatt, J., and Y. Lee, \"Dual-Stack Lite Broadband Deployments Following IPv4 Exhaustion\", RFC 6333, August 2011.",
      "ja": "[RFC6333]デュラン、A.、Droms、R.、Woodyatt、J.、およびY.リー、 \"IPv4の枯渇後デュアルスタックLiteのブロードバンドの展開\"、RFC 6333、2011年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC6343] Carpenter, B., \"Advisory Guidelines for 6to4 Deployment\", RFC 6343, August 2011.",
      "ja": "[RFC6343]大工、B.、 \"6to4の展開のための諮問ガイドライン\"、RFC 6343、2011年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC6598] Weil, J., Kuarsingh, V., Donley, C., Liljenstolpe, C., and M. Azinger, \"IANA-Reserved IPv4 Prefix for Shared Address Space\", BCP 153, RFC 6598, April 2012.",
      "ja": "[RFC6598]ワイル、J.、Kuarsingh、V.、Donley、C.、Liljenstolpe、C.、およびM. Azinger、 \"IANAリザーブIPv4のプレフィックス共有アドレススペースのための\"、BCP 153、RFC 6598、2012年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC6724] Thaler, D., Ed., Draves, R., Matsumoto, A., and T. Chown, \"Default Address Selection for Internet Protocol Version 6 (IPv6)\", RFC 6724, September 2012.",
      "ja": "[RFC6724]ターラー、D.、エド。、Draves、R.、松本、A.、およびT. CHOWN、 \"インターネットプロトコルバージョン6（IPv6）のためのデフォルトのアドレス選択\"、RFC 6724、2012年9月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Victor Kuarsingh (editor) Rogers Communications 8200 Dixie Road Brampton, Ontario L6T 0C1 Canada",
      "ja": "ビクターKuarsingh（エディタ）ロジャース・コミュニケーションズ8200ディクシーロードブランプトン、オンタリオL6T 0C1カナダ"
    },
    {
      "indent": 3,
      "text": "EMail: victor.kuarsingh@gmail.com URI: http://www.rogers.com",
      "ja": "電子メール：victor.kuarsingh@gmail.com URI：http://www.rogers.com"
    },
    {
      "indent": 3,
      "text": "Yiu L. Lee Comcast One Comcast Center Philadelphia, PA 19103 U.S.A.",
      "ja": "耀輝L.リーComcastの一つコムキャストセンター、フィラデルフィア、PA 19103 U.S.A."
    },
    {
      "indent": 3,
      "text": "EMail: yiu_lee@cable.comcast.com URI: http://www.comcast.com",
      "ja": "電子メール：yiu_lee@cable.comcast.com URI：http://www.comcast.com"
    },
    {
      "indent": 3,
      "text": "Olivier Vautrin Juniper Networks 1194 N Mathilda Avenue Sunnyvale, CA 94089 U.S.A.",
      "ja": "オリヴィエVautrinジュニパーネットワークスの1194 Nマチルダアベニューサニーベール、CA 94089 U.S.A."
    },
    {
      "indent": 3,
      "text": "EMail: olivier@juniper.net URI: http://www.juniper.net",
      "ja": "電子メール：olivier@juniper.net URI：http://www.juniper.net"
    }
  ]
}