{
  "title": {
    "text": "RFC 6666 - A Discard Prefix for IPv6",
    "ja": "RFC 6666 - IPv6の破棄プレフィックス"
  },
  "number": 6666,
  "created_at": "2020-09-07 18:57:32.289676+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                       N. Hilliard\nRequest for Comments: 6666                                          INEX\nCategory: Informational                                      D. Freedman\nISSN: 2070-1721                                                 Claranet\n                                                             August 2012",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 23,
      "text": "A Discard Prefix for IPv6",
      "ja": "IPv6の破棄プレフィックス"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "Remote triggered black hole filtering describes a method of mitigating the effects of denial-of-service attacks by selectively discarding traffic based on source or destination address. Remote triggered black hole routing describes a method of selectively re-routing traffic into a sinkhole router (for further analysis) based on destination address. This document updates the \"IPv6 Special Purpose Address Registry\" by explaining why a unique IPv6 prefix should be formally assigned by IANA for the purpose of facilitating IPv6 remote triggered black hole filtering and routing.",
      "ja": "リモートでトリガーされるブラックホールフィルタリングは、送信元または宛先アドレスに基づいてトラフィックを選択的に破棄することにより、サービス拒否攻撃の影響を軽減する方法を説明します。リモートトリガーブラックホールルーティングは、宛先アドレスに基づいてトラフィックを（詳細な分析のために）シンクホールルーターに選択的に再ルーティングする方法を表します。このドキュメントは、IPv6リモートトリガーブラックホールフィルタリングおよびルーティングを容易にする目的で、IANAによって一意のIPv6プレフィックスを正式に割り当てる必要がある理由を説明することにより、「IPv6特別目的アドレスレジストリ」を更新します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の状態"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはInternet Standards Trackの仕様ではありません。情報提供を目的として公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントは、IETF（Internet Engineering Task Force）の製品です。これは、IETFコミュニティのコンセンサスを表しています。これは公開レビューを受けており、Internet Engineering Steering Group（IESG）による公開が承認されています。 IESGによって承認されたすべてのドキュメントが、あらゆるレベルのインターネット標準の候補になるわけではありません。 RFC 5741のセクション2をご覧ください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6666.",
      "ja": "このドキュメントの現在のステータス、エラータ、およびフィードバックの提供方法に関する情報は、http：//www.rfc-editor.org/info/rfc6666で入手できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2012 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2012 IETF Trustおよびドキュメントの作成者として識別された人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書は、BCP 78およびこの文書の発行日に有効なIETF文書に関するIETFトラストの法的規定（http://trustee.ietf.org/license-info）の対象となります。これらのドキュメントは、このドキュメントに関するあなたの権利と制限について説明しているため、注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、Trust Legal Provisionsのセクション4.eに記載されているSimplified BSD Licenseのテキストが含まれている必要があり、Simplified BSD Licenseに記載されているように保証なしで提供されます。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n   1.1. Notational Conventions .....................................3\n2. A Discard Prefix for IPv6 .......................................3\n3. Operational Implications ........................................4\n4. IANA Considerations .............................................4\n5. Security Considerations .........................................4\n6. References ......................................................5\n   6.1. Normative References .......................................5\n   6.2. Informative References .....................................5",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "Remote Triggered Black Hole (RTBH) filtering describes a class of methods of blocking IP traffic either from a specific source ([RFC5635]) or to a specific destination ([RFC3882]) on a network. RTBH routing describes a class of methods of re-routing IP traffic destined to the attacked/targeted host to a special path (tunnel) where a sniffer could capture the traffic for analysis. Both of these methods operate by setting the next-hop address of an IP packet with a specified source or destination address to be a unicast prefix that is connected locally or remotely to a router's discard, null, or tunnel interface. Typically, reachability information for this prefix is propagated throughout an autonomous system using a dynamic routing protocol such as BGP ([RFC3882]). By deploying RTBH systems across a network, traffic to or from specific destinations may be selectively black-holed or re-routed to a sinkhole device in a manner that is efficient, scalable, and straightforward to implement.",
      "ja": "リモートトリガーブラックホール（RTBH）フィルタリングは、ネットワーク上の特定の送信元（[RFC5635]）または特定の宛先（[RFC3882]）へのIPトラフィックをブロックする方法のクラスを表します。 RTBHルーティングは、攻撃されたホストまたはターゲットホストに向けられたIPトラフィックを、スニファが分析のためにトラフィックをキャプチャできる特別なパス（トンネル）に再ルーティングするクラスのメソッドを記述します。これらの方法はどちらも、指定された送信元または宛先アドレスを持つIPパケットのネクストホップアドレスを、ルーターの破棄、ヌル、またはトンネルインターフェイスにローカルまたはリモートで接続されるユニキャストプレフィックスに設定することによって機能します。通常、このプレフィックスの到達可能性情報は、BGP（[RFC3882]）などの動的ルーティングプロトコルを使用して自律システム全体に伝達されます。 RTBHシステムをネットワーク全体に展開することにより、特定の宛先への、または特定の宛先からのトラフィックを、効率的でスケーラブルで、実装が簡単な方法で、シンクホールデバイスに選択的にブラックホール化または再ルーティングできます。"
    },
    {
      "indent": 3,
      "text": "On some networks, operators configure RTBH installations using [RFC1918] address space or the address blocks reserved for documentation in [RFC5737]. This approach is inadequate because RTBH configurations are not documentation, but rather operationally important features of many public-facing production networks. Furthermore, [RFC3849] specifies that the IPv6 documentation prefix should be filtered in both local and public contexts. On this basis, it is suggested that both private network address blocks and the documentation prefixes described in [RFC5737] are inappropriate for RTBH configurations and that a dedicated IPv6 prefix should be assigned instead.",
      "ja": "一部のネットワークでは、オペレーターは[RFC1918]アドレス空間または[RFC5737]のドキュメント用に予約されているアドレスブロックを使用してRTBHインストールを構成します。 RTBH構成はドキュメントではなく、多くの公衆向け運用ネットワークの運用上重要な機能であるため、このアプローチは不適切です。さらに、[RFC3849]は、IPv6ドキュメントプレフィックスをローカルコンテキストとパブリックコンテキストの両方でフィルタリングする必要があることを指定しています。これに基づいて、[RFC5737]で説明されているプラ​​イベートネットワークアドレスブロックとドキュメントプレフィックスの両方がRTBH構成には不適切であり、代わりに専用IPv6プレフィックスを割り当てることをお勧めします。"
    },
    {
      "indent": 3,
      "text": "This document updates the \"IPv6 Special Purpose Address Registry\" [IANA-IPV6REG].",
      "ja": "このドキュメントは、「IPv6特別目的アドレスレジストリ」[IANA-IPV6REG]を更新します。"
    },
    {
      "indent": 0,
      "text": "1.1. Notational Conventions",
      "section_title": true,
      "ja": "1.1. 表記規則"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "このドキュメントのキーワード「MUST」、「MUST NOT」、「REQUIRED」、「SHALL」、「SHALL NOT」、「SHOULD」、「SHOULD NOT」、「RECOMMENDED」、「MAY」、および「OPTIONAL」は、 [RFC2119]で説明されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. A Discard Prefix for IPv6",
      "section_title": true,
      "ja": "2. IPv6の破棄プレフィックス"
    },
    {
      "indent": 3,
      "text": "For the purposes of implementing an IPv6 RTBH configuration, a unicast address block is required. There are currently no IPv6 unicast address blocks that are specifically nominated for the purposes of implementing such RTBH systems.",
      "ja": "IPv6 RTBH構成を実装するためには、ユニキャストアドレスブロックが必要です。現在、このようなRTBHシステムを実装する目的で特別に指定されているIPv6ユニキャストアドレスブロックはありません。"
    },
    {
      "indent": 3,
      "text": "While it could be argued that there are other addresses and address prefixes that could be used for this purpose (e.g., documentation prefixes, private address space), or that an operator could assign an address block from their own address space for this purpose, there is currently no operational clarity on what address block would be appropriate or inappropriate to use for this purpose. By assigning a globally unique discard prefix for IPv6, the IETF will introduce good practice for the implementation of IPv6 RTBH configurations and will facilitate operational clarity by allowing operators to implement consistent and deterministic inter-domain prefix and traffic filtering policies for black-holed traffic.",
      "ja": "この目的に使用できる他のアドレスとアドレスプレフィックス（たとえば、ドキュメントプレフィックス、プライベートアドレススペース）があるか、またはオペレーターがこの目的のために独自のアドレススペースからアドレスブロックを割り当てることができると主張できますが、現在のところ、この目的で使用するのに適切または不適切なアドレスブロックについては、操作上明確ではありません。 IPv6にグローバルに一意の破棄プレフィックスを割り当てることにより、IETFはIPv6 RTBH構成の実装に優れた手法を導入し、オペレーターがブラックホールトラフィックに一貫性のある確定的なドメイン間プレフィックスとトラフィックフィルタリングポリシーを実装できるようにすることで、操作の明確化を促進します。"
    },
    {
      "indent": 3,
      "text": "As [RFC3882] and [RFC5635] describe situations where more than one discard address may be used for implementing multiple RTBH scenarios, a single address is not sufficient to cover all likely RTBH situations. Consequently, an address block is required.",
      "ja": "[RFC3882]と[RFC5635]は複数の破棄アドレスが複数のRTBHシナリオの実装に使用される状況を説明しているため、1つのアドレスではすべての可能性のあるRTBH状況をカバーするには十分ではありません。したがって、アドレスブロックが必要です。"
    },
    {
      "indent": 0,
      "text": "3. Operational Implications",
      "section_title": true,
      "ja": "3. 運用上の影響"
    },
    {
      "indent": 3,
      "text": "This assignment MAY be carried in a dynamic routing protocol within an autonomous system. The assignment SHOULD NOT be announced to or accepted from third-party autonomous systems, and IPv6 traffic with a destination address within this prefix SHOULD NOT be forwarded to or accepted from third-party autonomous systems. If the prefix or a subnet of the prefix is inadvertently announced to or accepted from a third-party autonomous system, this may cause excessive volumes of traffic to pass unintentionally between the two networks, which would aggravate the effect of a denial-of-service attack.",
      "ja": "この割り当ては、自律システム内の動的ルーティングプロトコルで実行される場合があります。割り当ては、サードパーティの自律システムに対してアナウンスまたは受け入れるべきではなく（SHOULD NOT）、このプレフィックス内の宛先アドレスを持つIPv6トラフィックは、サードパーティの自律システムに対して転送または受け入れるべきではありません（SHOULD NOT）。プレフィクスまたはプレフィクスのサブネットがサードパーティの自律システムに誤って通知または受け入れられた場合、過剰なトラフィック量が2つのネットワーク間で意図せずに通過し、サービス拒否の影響が悪化する可能性があります。攻撃。"
    },
    {
      "indent": 3,
      "text": "On networks that implement IPv6 remote triggered black holes, some or all of this network block MAY be configured with a next-hop destination of a discard or null interface on any or all IPv6 routers within the autonomous system.",
      "ja": "IPv6リモートトリガーブラックホールを実装するネットワークでは、このネットワークブロックの一部またはすべてに、自律システム内の一部またはすべてのIPv6ルーターの破棄またはヌルインターフェイスのネクストホップ宛先を構成できます（MAY）。"
    },
    {
      "indent": 0,
      "text": "4. IANA Considerations",
      "section_title": true,
      "ja": "4. IANAに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "Per this document, IANA has recorded the allocation of the IPv6 address prefix 0100::/64 as a Discard-Only Prefix in the \"Internet Protocol Version 6 Address Space\" and added the prefix to the \"IANA IPv6 Special Purpose Address Registry\" [IANA-IPV6REG]. No end party has been assigned to this prefix. The prefix has been allocated from ::/3.",
      "ja": "このドキュメントによれば、IANAはIPv6アドレスプレフィックス0100 :: / 64の割り当てを「インターネットプロトコルバージョン6アドレススペース」の破棄専用プレフィックスとして記録し、そのプレフィックスを「IANA IPv6特別目的アドレスレジストリ」に追加しました[ IANA-IPV6REG]。このプレフィックスにエンドパーティが割り当てられていません。接頭辞は:: / 3から割り当てられています。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "As the prefix specified in this document ought not normally be transmitted or accepted over inter-domain BGP sessions for the reasons described in Section 3, it is usually appropriate to include this prefix in inter-domain BGP prefix filters [RFC3704] or otherwise ensure the prefix is neither transmitted to nor accepted from a third-party autonomous system.",
      "ja": "このドキュメントで指定されているプレフィックスは、セクション3で説明されている理由により、通常ドメイン間BGPセッションで送信または受け入れられるべきではないため、通常、このプレフィックスをドメイン間BGPプレフィックスフィルター[RFC3704]に含めるか、そうでなければ接頭辞は、サードパーティの自律システムに送信されず、受け入れられません。"
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "ja": "6. 参考文献"
    },
    {
      "indent": 0,
      "text": "6.1. Normative References",
      "section_title": true,
      "ja": "6.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[IANA-IPV6REG] Internet Assigned Numbers Authority, \"IPv6 Special Purpose Address Registry\", 2012, <http://www.iana.org/assignments/ iana-ipv6-special-registry>.",
      "ja": "[IANA-IPV6REG] Internet Assigned Numbers Authority、「IPv6 Special Purpose Address Registry」、2012、<http://www.iana.org/assignments/ iana-ipv6-special-registry>。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119] Bradner、S。、「要件レベルを示すためにRFCで使用するキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3882] Turk, D., \"Configuring BGP to Block Denial-of-Service Attacks\", RFC 3882, September 2004.",
      "ja": "[RFC3882] Turk、D。、「DoS攻撃をブロックするためのBGPの構成」、RFC 3882、2004年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC5635] Kumari, W. and D. McPherson, \"Remote Triggered Black Hole Filtering with Unicast Reverse Path Forwarding (uRPF)\", RFC 5635, August 2009.",
      "ja": "[RFC5635]クマリW.およびD.マクファーソン、「Unicast Reverse Path Forwarding（uRPF）によるリモートトリガーブラックホールフィルタリング」、RFC 5635、2009年8月。"
    },
    {
      "indent": 0,
      "text": "6.2. Informative References",
      "section_title": true,
      "ja": "6.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[RFC1918] Rekhter, Y., Moskowitz, B., Karrenberg, D., de Groot, G., and E. Lear, \"Address Allocation for Private Internets\", BCP 5, RFC 1918, February 1996.",
      "ja": "[RFC1918] Rekhter、Y.、Moskowitz、B.、Karrenberg、D.、de Groot、G。、およびE. Lear、「プライベートインターネットのアドレス割り当て」、BCP 5、RFC 1918、1996年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC3704] Baker, F. and P. Savola, \"Ingress Filtering for Multihomed Networks\", BCP 84, RFC 3704, March 2004.",
      "ja": "[RFC3704]ベイカー、F。、およびP.サボラ、「マルチホームネットワークの入力フィルタリング」、BCP 84、RFC 3704、2004年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3849] Huston, G., Lord, A., and P. Smith, \"IPv6 Address Prefix Reserved for Documentation\", RFC 3849, July 2004.",
      "ja": "[RFC3849] Huston、G.、Lord、A。、およびP. Smith、「ドキュメント用に予約されたIPv6アドレスプレフィックス」、RFC 3849、2004年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC5737] Arkko, J., Cotton, M., and L. Vegoda, \"IPv4 Address Blocks Reserved for Documentation\", RFC 5737, January 2010.",
      "ja": "[RFC5737] Arkko、J.、Cotton、M。、およびL. Vegoda、「ドキュメント用に予約されたIPv4アドレスブロック」、RFC 5737、2010年1月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Nick Hilliard INEX 4027 Kingswood Road Dublin 24 IE",
      "ja": "ニックヒリアードINEX 4027キングスウッドロードダブリン24 IE"
    },
    {
      "indent": 3,
      "text": "EMail: nick@inex.ie",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "David Freedman Claranet 21 Southampton Row, Holborn London WC1B 5HA UK",
      "ja": "デビッドフリードマンクララネット21サウサンプトンロウ、ホルボーンロンドンWC1B 5HA英国"
    },
    {
      "indent": 3,
      "text": "EMail: david.freedman@uk.clara.net",
      "raw": true,
      "ja": ""
    }
  ]
}