{
  "title": {
    "text": "RFC 6880 - An Information Model for Kerberos Version 5",
    "ja": "RFC 6880 - Kerberosバージョン5のための情報モデル"
  },
  "number": 6880,
  "created_at": "2019-11-01 02:48:15.274563+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                      L. Johansson\nRequest for Comments: 6880                                         SUNET\nCategory: Standards Track                                     March 2013\nISSN: 2070-1721",
      "raw": true
    },
    {
      "indent": 14,
      "text": "An Information Model for Kerberos Version 5",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document describes an information model for Kerberos version 5 from the point of view of an administrative service. There is no standard for administrating a Kerberos 5 Key Distribution Center (KDC). This document describes the services exposed by an administrative interface to a KDC.",
      "ja": "この文書は、行政サービスの観点から、Kerberosバージョン5のための情報モデルを記述する。 Kerberos 5のキー配布センター（KDC）を管理するための標準はありません。この文書では、KDCへの管理インターフェースによって公開されたサービスについて説明します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6880.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6880で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2013 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2013 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 3,
      "text": "This document may contain material from IETF Documents or IETF Contributions published or made publicly available before November 10, 2008. The person(s) controlling the copyright in some of this material may not have granted the IETF Trust the right to allow modifications of such material outside the IETF Standards Process. Without obtaining an adequate license from the person(s) controlling the copyright in such materials, this document may not be modified outside the IETF Standards Process, and derivative works of it may not be created outside the IETF Standards Process, except to format it for publication as an RFC or to translate it into languages other than English.",
      "ja": "この材料の一部がIETFトラストにこのような材料の変更を許可する権利を与えられていない可能性がありますにこの文書は、2008年、IETFドキュメントまたは11月10日以前に発行または公開さIETF貢献から著作権を支配する者（複数可）材料を含んでいてもよいですIETF標準化プロセスの外。そのような材料の著作権を管理者（単数または複数）から適切なライセンスを取得することなく、この文書は、IETF標準化過程の外側修正されないかもしれません、そして、それの派生物は、IETF標準化過程の外側に作成されない場合があり、それをフォーマットする以外出版RFCとして、英語以外の言語に翻訳します。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n2. Requirements Notation ...........................................4\n3. Information Model Demarcation ...................................5\n4. Information Model Specification .................................6\n   4.1. Principal ..................................................6\n        4.1.1. Principal: Attributes ...............................6\n        4.1.2. Principal: Associations .............................7\n   4.2. KeySet .....................................................8\n        4.2.1. KeySet: Attributes ..................................8\n        4.2.2. KeySet: Associations ................................8\n   4.3. Key ........................................................9\n        4.3.1. Key: Attributes .....................................9\n        4.3.2. Key: Associations ..................................10\n        4.3.3. Key: Remarks .......................................10\n   4.4. Policy ....................................................10\n        4.4.1. Policy: Attributes .................................10\n        4.4.2. Mandatory-to-Implement Policy ......................11\n5. Implementation Scenarios .......................................11\n   5.1. LDAP Backend to KDC .......................................12\n   5.2. LDAP Frontend to KDC ......................................12\n   5.3. SOAP ......................................................12\n   5.4. NETCONF ...................................................12\n6. Security Considerations ........................................12\n7. Acknowledgments ................................................13\n8. References .....................................................13\n   8.1. Normative References ......................................13\n   8.2. Informative References ....................................14",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The Kerberos version 5 authentication service described in [RFC4120] describes how a Key Distribution Center (KDC) provides authentication to clients. RFC 4120 does not stipulate how a KDC is managed, and several \"kadmin\" servers have evolved since RFC 4120 was written. This document describes the services required to administer a KDC and the underlying information model assumed by a kadmin-type service.",
      "ja": "[RFC4120]で説明ケルベロスバージョン5認証サービスは、キー配布センター（KDC）は、クライアントに認証を提供する方法について説明します。 RFC 4120は、KDCが管理されており、いくつかの「kadminの」サーバはRFC 4120が書き込まれてから進化してきた方法を規定するものではありません。この文書では、KDCとkadminのタイプのサービスが想定している基本的な情報モデルを管理するために必要なサービスについて説明します。"
    },
    {
      "indent": 3,
      "text": "The information model is written in terms of \"attributes\" and either \"services\" or \"interfaces\", but the use of these particular words must not be taken to imply any particular modeling paradigm. Neither an object-oriented model nor a Lightweight Directory Access Protocol (LDAP) [RFC4510] schema is intended. The author has attempted to describe, in prose, the intended semantics and syntax of the components of the model. For instance, an LDAP schema based on this model will be more precise in the expression of the syntax while preserving the semantics of this model.",
      "ja": "情報モデルは、「属性」と「サービス」や「インタフェース」のいずれかの観点で書かれているが、これらの特定の単語の使用は、特定のモデリングパラダイムを暗示するために取られてはなりません。オブジェクト指向モデルでもライトウェイトディレクトリアクセスプロトコル（LDAP）[RFC4510]スキーマどちらが意図されます。著者は、散文では、モデルのコンポーネントの意図セマンティクスと構文を記述しようとしています。このモデルのセマンティクスを維持しながら、例えば、このモデルに基づいてLDAPスキーマは、構文の表現で、より正確になります。"
    },
    {
      "indent": 3,
      "text": "Implementations of this document MAY decide to change the names used (e.g., principalName). If so, an implementation MUST provide a name-to-name mapping to this document. In particular, schema languages may have different typographical conventions, e.g., the use of an uppercase letter (as seen in camelCase) versus the use of '_' and '-' to separate 'words' in a name. Implementations MUST call out such conventions explicitly.",
      "ja": "このドキュメントの実装は、（例えば、PrincipalNameの）使用される名前を変更することもできます。その場合、実装は、このドキュメントに名前と名前のマッピングを提供しなければなりません。具体的には、スキーマ言語は、「_」の使用に対して（キャメルケースに見られるように）、例えば、大文字の使用は、異なる表記規則を有していてもよく、「 - 」名前に「単語」を分離します。実装は、明示的な規則を呼び出す必要があります。"
    },
    {
      "indent": 3,
      "text": "Implementations of this document MUST be able to support default values for attributes and have the ability to specify syntax for attribute values.",
      "ja": "このドキュメントの実装は属性のデフォルト値をサポートすることが可能と属性値の構文を指定する能力を持たなければなりません。"
    },
    {
      "indent": 0,
      "text": "2. Requirements Notation",
      "section_title": true,
      "ja": "2.要件表記"
    },
    {
      "indent": 3,
      "text": "This document uses the standard key words (\"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\") that are defined in [RFC2119], but with modifications to those definitions as described below. The reason for this (which was discussed extensively in the Kerberos working group) is as follows:",
      "ja": "この文書では、 \"MAY\"、標準キーワード（ \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\" は、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\" を使用して、「オプション「）[RFC2119]で定義されるが、これらの定義に変更を加えて以下に説明するように。次のように（ケルベロスワーキンググループで広く議論された）その理由は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "This document describes an information model for Kerberos 5, but it does not directly describe any mapping onto a particular schema or modeling language. Hence, an implementation of this model consists of a mapping to such a language, e.g., an LDAP or SQL schema. Therefore, the standard normative key words require precise definition.",
      "ja": "この文書では、Kerberos 5のための情報モデルを記述し、それが直接、特定のスキーマやモデリング言語への任意のマッピングを説明していません。したがって、このモデルの実装は、そのような言語、例えば、LDAPまたはSQLスキーマにマッピングから成ります。したがって、標準規範キーの言葉は正確な定義が必要です。"
    },
    {
      "indent": 3,
      "text": "The terms \"MUST\" and \"REQUIRED\" mean that a schema implementing this model must have a way to represent a feature (i.e., that it is mandatory to implement it in the schema), but that, unless otherwise specified, the feature may represent an optional element in the chosen schema definition language.",
      "ja": "用語「MUST」と「REQUIRED」このモデルを実装するスキーマは、（スキーマでそれを実装するために必須であること、すなわち、）機能を表現する方法を持たなければならないことを意味し、それは、特に断りのない限り、機能は表すことができます選択したスキーマ定義言語でオプションの要素。"
    },
    {
      "indent": 3,
      "text": "However, \"MUST\" also means that a KDC or administrative interface implementing this information model has to provide the feature and associated behavior consistent with the schema.",
      "ja": "しかし、この情報モデルを実装するKDCまたは管理インターフェイスが機能して、スキーマと一致関連付けられた動作を提供しなければならないことを意味し、「しなければなりません」。"
    },
    {
      "indent": 3,
      "text": "For instance, principalName (see Section 4.1.1.1) represents the name of a principal. In an LDAP schema (for instance), this may be represented as an optional attribute even though all KDCs implementing this specification must support this attribute.",
      "ja": "例えば、principalnameと（セクション4.1.1.1を参照）主の名前を表します。 （例えば）LDAPスキーマでは、これは、この仕様を実装するすべてのKDCは、この属性をサポートしなければならないにもかかわらず、オプション属性として表すことができます。"
    },
    {
      "indent": 3,
      "text": "The terms \"MAY\" and \"OPTIONAL\" mean that it is optional for a KDC or administrative interface implementing this information model to implement this feature. These terms also mean that implementing the feature in the schema is optional.",
      "ja": "用語は、「OPTIONAL」は、それがこの機能を実装するために、この情報モデルを実装するKDCまたは管理インターフェース用のオプションであることを意味し、「MAY」。これらの用語は、スキーマ内の機能を実装することはオプションであることを意味します。"
    },
    {
      "indent": 3,
      "text": "Implementers of the schema should be aware that, unless the schema definition can represent critical but optional elements, language confusion may arise when optional elements are used but not understood by all implementations in a particular deployment.",
      "ja": "スキーマの実装は、スキーマ定義が重要しかし、オプションの要素を表すことができない限り、任意の要素が使用されるが、特定のデプロイメント内のすべての実装によって理解されていない場合、言語の混乱が生じる可能性がある、ということに注意してください。"
    },
    {
      "indent": 3,
      "text": "The expression \"MUST NOT be OPTIONAL\" means that it is mandatory that a feature be implemented (\"MUST\" per the definition in [RFC2119]) and additionally that it must not be marked as optional in the schema language. In particular, this expression means that the feature is both mandatory to implement and must be present in all representations of the object to which it applies.",
      "ja": "表現「オプションにすることはできませんが、」機能が実装されていることが必須であることを意味します（「MUST」の定義に従って、[RFC2119]）、さらにそれがスキーマ言語でオプションとしてマークされてはならないこと。特に、この表現は、機能が実装が必須の両方であり、それが適用されるオブジェクトのすべての表現中に存在しなければならないことを意味します。"
    },
    {
      "indent": 3,
      "text": "The terms \"SHOULD\" and \"RECOMMENDED\" mean that the consequences of not implementing the feature as if it were described with the \"MUST\" keyword must be carefully weighed before choosing a different course. In particular, these terms imply that interoperability concerns may arise from not following the recommended practice in schema that implement this model.",
      "ja": "用語は、および「推奨」、それが「MUST」のキーワードで説明されているかのように機能を実装していないの結果は慎重に別のコースを選択する前に検討されなければならないことを意味し、「すべきです」。特に、これらの用語は、相互運用性の懸念は、このモデルを実装して、スキーマ内の推奨プラクティスに従っていないから生じる可能性があることを示唆しています。"
    },
    {
      "indent": 3,
      "text": "Context will determine whether the \"SHOULD\" key word applies to the schema, to the underlying behavior of the KDC, or both. For instance, when this document states that principalIsDisabled (see Section 4.1.1.4) SHOULD default to FALSE, this statement implies both a recommendation for the behavior of KDCs as well as a recommendation for the representation of that behavior in schema.",
      "ja": "コンテキストは、「SHOULD」キーワードはKDC、またはその両方の根本的な振る舞いに、スキーマに適用されるかどうかを決定します。この文書はprincipalIsDisabled（セクション4.1.1.4を参照）FALSEをデフォルトとすべきであると述べているとき例えば、この文はのKDCの行動のための勧告だけでなく、スキーマ内のその行動の表現のための勧告の両方を意味します。"
    },
    {
      "indent": 0,
      "text": "3. Information Model Demarcation",
      "section_title": true,
      "ja": "3.情報モデル分界"
    },
    {
      "indent": 3,
      "text": "The information model specified in Section 4 describes objects, their properties, and the relationships between the objects. These elements comprise an abstract view of the data represented in a KDC. It is important to understand that the information model is not a schema. In particular, the way objects are compared for equality beyond that which is implied by the specification of a syntax is not part of this specification, nor is the ordering specified between the elements of a particular syntax.",
      "ja": "セクション4で指定された情報モデルは、オブジェクト、そのプロパティ、およびオブジェクト間の関係を記述する。これらの要素はKDCで表されるデータの抽象的ビューを含みます。情報モデルは、スキーマではないことを理解することが重要です。特に、オブジェクトは構文の仕様によって暗示される超えて等しいかどうかを比較する方法は、本明細書の一部ではなく、また特定の構文要素の間に指定された順序です。"
    },
    {
      "indent": 3,
      "text": "Further work on Kerberos will undoubtedly prompt updates to this information model to reflect changes in the functions performed by the KDC. Such extensions to the information model should always use a normative reference to the relevant RFCs in detailing the change in KDC function.",
      "ja": "ケルベロスの更なる作業は、間違いなくKDCによって実行される機能の変化を反映するために、この情報モデルへの更新を促すメッセージが表示されます。情報モデルへのこのような拡張は、常にKDC機能の変化を詳細に関連するRFCへの引用規格を使用する必要があります。"
    },
    {
      "indent": 3,
      "text": "This model describes a number of elements related to password policy management. Not all of the elements in this model are unique to Kerberos. For example, an LDAP implementation of this model should incorporate existing LDAP schema where functional overlap exists, rather than defining additional Kerberos-specific elements.",
      "ja": "このモデルは、パスワードポリシーの管理に関連する要素の数を示します。ないこのモデル内のすべての要素は、Kerberosに固有のものです。例えば、このモデルのLDAP実装ではなく、追加のKerberos固有の要素を定義するよりも、機能的なオーバーラップが存在する既存のLDAPスキーマを組み込むべきです。"
    },
    {
      "indent": 0,
      "text": "4. Information Model Specification",
      "section_title": true,
      "ja": "4.情報モデルの仕様"
    },
    {
      "indent": 0,
      "text": "4.1. Principal",
      "section_title": true,
      "ja": "4.1. 主要な"
    },
    {
      "indent": 3,
      "text": "The fundamental entity stored in a KDC is the principal. The principal is associated with keys and generalizes the \"user\" concept. The principal MUST be implemented in full and MUST NOT be OPTIONAL in an implementation",
      "ja": "KDCに格納されている基本的なエンティティが主です。校長は、キーに関連付けられており、「利用者」という概念を一般化しています。校長はフルに実装しなければならないと実装ではオプションにすることはできません"
    },
    {
      "indent": 0,
      "text": "4.1.1. Principal: Attributes",
      "section_title": true,
      "ja": "4.1.1. 校長：属性"
    },
    {
      "indent": 0,
      "text": "4.1.1.1. principalName",
      "section_title": true,
      "ja": "4.1.1.1。 PrincipalName"
    },
    {
      "indent": 3,
      "text": "The principalName MUST uniquely identify the principal within the administrative context of the KDC. The principalName MUST be equivalent to the string representation of the principal name (see Section 2.1.1 of [RFC1964]), including, if applicable for the name type, the realm.",
      "ja": "principalnameと一意KDCの管理コンテキスト内のプリンシパルを識別しなければなりません。 principalnameとは、プリンシパル名（[RFC1964]のセクション2.1.1を参照）、名前タイプ、レルムの該当する場合、などの文字列表現と同等でなければなりません。"
    },
    {
      "indent": 3,
      "text": "The attribute MAY be multivalued if the implementation supports aliases, enterprise names, or both. In this case, exactly one of the principalName values MAY be designated as the canonical principalName. If the implementation supports encryption types (enctypes) that require salt, exactly one of the values of principalName MAY be designated as the canonical salting principalName.",
      "ja": "実装は別名、企業名、またはその両方をサポートしている場合、属性は複数の値かもしれません。この場合には、正確に一つのPrincipalName値は正規のPrincipalNameとして指定することができます。実装は、塩を必要とする暗号化の種類（enctypes）をサポートしている場合、正確に一つのPrincipalNameの値のは、正規の塩漬けprincipalnameととして指定することができます。"
    },
    {
      "indent": 3,
      "text": "Implementations (i.e., schema) that support enterprise names, aliases, or both, SHOULD provide for efficient lookup of principal objects based on the alias or enterprise name.",
      "ja": "企業の名前、別名、またはその両方をサポートする実装（すなわち、スキーマ）は、別名または企業名に基づいて、主オブジェクトの効率的な検索を提供すべきです。"
    },
    {
      "indent": 0,
      "text": "4.1.1.2. principalNotUsedBefore",
      "section_title": true,
      "ja": "4.1.1.2。 principalNotUsedBefore"
    },
    {
      "indent": 3,
      "text": "The principal MUST NOT be used before this date. The syntax of the attribute MUST be Internet date/time format from [RFC3339]. The attribute MUST be single-valued.",
      "ja": "校長はこの日付の前に使用してはいけません。属性の構文は、[RFC3339]からインターネット日付/時刻の形式でなければなりません。属性は単一値でなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.1.1.3. principalNotUsedAfter",
      "section_title": true,
      "ja": "4.1.1.3。 principalNotUsedAfter"
    },
    {
      "indent": 3,
      "text": "The principal MUST NOT be used after this date. The syntax of the attribute MUST be Internet date/time format from [RFC3339]. The attribute MUST be single-valued.",
      "ja": "校長は、この日付以降に使用してはいけません。属性の構文は、[RFC3339]からインターネット日付/時刻の形式でなければなりません。属性は単一値でなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.1.1.4. principalIsDisabled",
      "section_title": true,
      "ja": "4.1.1.4。 principalIsDisabled"
    },
    {
      "indent": 3,
      "text": "A boolean attribute used to disable a principal. The attribute SHOULD default to boolean FALSE.",
      "ja": "ブール属性は、プリンシパルを無効にするために使用します。属性はブール値FALSEをデフォルトとすべきです。"
    },
    {
      "indent": 0,
      "text": "4.1.1.5. principalLastCredentialChangeTime",
      "section_title": true,
      "ja": "4.1.1.5。 principalLastCredentialChangeTime"
    },
    {
      "indent": 3,
      "text": "This single-valued attribute contains the time of the last successful change of credentials (e.g., password or private key) associated with this principal. The syntax of the attribute MUST be Internet date/time format from [RFC3339].",
      "ja": "この単一値の属性には、このプリンシパルに関連付けられた資格情報（たとえば、パスワードや秘密鍵）の最後に成功した変化の時間が含まれています。属性の構文は、[RFC3339]からインターネット日付/時刻の形式でなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.1.1.6. principalCreateTime",
      "section_title": true,
      "ja": "4.1.1.6。 principalCreateTime"
    },
    {
      "indent": 3,
      "text": "This single-valued attribute contains the time and date when this principal was created. The syntax of the attribute MUST be Internet date/time format from [RFC3339].",
      "ja": "この単一値の属性は、この校長が作成された時刻と日付が含まれています。属性の構文は、[RFC3339]からインターネット日付/時刻の形式でなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.1.1.7. principalModifyTime",
      "section_title": true,
      "ja": "4.1.1.7。 principalModifyTime"
    },
    {
      "indent": 3,
      "text": "This single-valued attribute contains the time and date when this principal was last modified, excluding changes to credentials. The syntax of the attribute MUST be Internet date/time format from [RFC3339].",
      "ja": "この単一値の属性は、このプリンシパルが資格証明書への変更を除いて、最後に変更された時刻と日付が含まれています。属性の構文は、[RFC3339]からインターネット日付/時刻の形式でなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.1.1.8. principalMaximumTicketLifetime",
      "section_title": true,
      "ja": "4.1.1.8。 principalMaximumTicketLifetime"
    },
    {
      "indent": 3,
      "text": "This single-valued attribute contains the time, in seconds, representing the maximum lifetime of a ticket issued for this principal.",
      "ja": "この単一値の属性には、この主体のために発行されたチケットの最大有効期間を表す、時間を秒単位で含まれています。"
    },
    {
      "indent": 0,
      "text": "4.1.1.9. principalMaximumRenewableTicketLifetime",
      "section_title": true,
      "ja": "4.1.1.9。 principalMaximumRenewableTicketLifetime"
    },
    {
      "indent": 3,
      "text": "This single-valued attribute contains the delta time, in seconds, representing the maximum amount of time a ticket may be renewed for this principal.",
      "ja": "この単一値の属性には、チケットがこのプリンシパルのために更新することができる時間の最大量を表す、秒単位で、デルタ時間が含まれています。"
    },
    {
      "indent": 0,
      "text": "4.1.1.10. principalAllowedEnctype",
      "section_title": true,
      "ja": "4.1.1.10。 principalAllowedEnctype"
    },
    {
      "indent": 3,
      "text": "This OPTIONAL multivalued attribute lists the enctypes allowed for this principal. If empty or absent, any enctype supported by the implementation is allowed for this principal.",
      "ja": "このオプション複数値属性は、このプリンシパルに許可さenctypesを示しています。空または存在しない場合、実装によってサポートされる任意のenctypeこのプリンシパルに許可されています。"
    },
    {
      "indent": 3,
      "text": "This attribute is intended as a policy attribute and restricts all uses of enctypes, including server, client, and session keys. Data models MAY choose to use policy objects in order to represent more complex decision mechanisms.",
      "ja": "この属性は、ポリシー属性として意図されており、サーバー、クライアント、およびセッションキーを含む、enctypesのすべての使用を制限しています。データモデルは、より複雑な意思決定メカニズムを表現するために、ポリシーオブジェクトを使用することもできます。"
    },
    {
      "indent": 0,
      "text": "4.1.2. Principal: Associations",
      "section_title": true,
      "ja": "4.1.2. 校長：団体"
    },
    {
      "indent": 3,
      "text": "Each principal MAY be associated with 0 or more KeySets and MAY be associated with 0 or more Policies. The KeySet is represented as an object in this model, because it has attributes associated with it (the key version number). In typical situations, the principal is associated with exactly one KeySet, but implementations MUST NOT assume this case. That is, an implementation of this standard MUST be able to handle the general case of multiple KeySets associated with each principal. Multiple KeySets may, for instance, be useful when performing a key rollover for a principal.",
      "ja": "各プリンシパルは0以上のキーセットに関連付けられてもよく、0または複数のポリシーに関連付けることができます。それに関連付けられた属性（キーバージョン番号）を持っているので、キーセットは、このモデル内のオブジェクトとして表現されます。典型的な状況では、主は、正確に一つのキーセットに関連付けられているが、実装は、この場合を想定してはいけません。つまり、この規格の実装では、各プリンシパルに関連する複数のキーセットの一般的なケースを扱うことができなければなりません。プリンシパルのキーロールオーバを実行するときに、複数のキーセットは、例えば、有用であり得ます。"
    },
    {
      "indent": 0,
      "text": "4.2. KeySet",
      "section_title": true,
      "ja": "4.2. キーセット"
    },
    {
      "indent": 3,
      "text": "In Kerberos, principals are associated with zero or more symmetric secret keys, and each key has a key version number (kvno) and an enctype. In this model, we group keys by kvno into KeySet objects. A principal can have zero or more KeySet objects associated with it, each of which MUST have one or more keys. Each KeySet is associated with exactly one principal. A schema derived from this model MAY lack a direct analogue of KeySet, as described in this document.",
      "ja": "ケルベロスでは、プリンシパルは、ゼロまたはそれ以上の対称秘密鍵に関連付けられており、各キーは、キーのバージョン番号（KVNO）とENCTYPEを有しています。キーセットオブジェクトにKVNOことで、このモデルでは、私たちグループキー。プリンシパルは、1つ以上のキーを持たなければならないそれぞれがそれに関連付けられたゼロ個以上のキーセットオブジェクトを有することができます。各キーセットは正確に一つの元本と関連しています。この文書に記載されているように、このモデルに由来するスキーマは、キーセットの直接アナログを欠いていてもよいです。"
    },
    {
      "indent": 3,
      "text": "It is expected that most Kerberos implementations will use a special-purpose interface for setting and changing principal passwords and keys.",
      "ja": "ほとんどのKerberos実装は、主なパスワードやキーを設定し、変更するための専用のインターフェースを使用することが期待されます。"
    },
    {
      "indent": 3,
      "text": "If a server supports an enctype for a principal, that enctype must be present in at least one key for the principal in question. For any given enctype, a KeySet MUST NOT contain more than one key with that enctype.",
      "ja": "サーバーは、プリンシパルのENCTYPEをサポートしている場合は、そののenctypeは、問題のプリンシパルの少なくとも1つのキーに存在している必要があります。任意のenctypeのために、キーセットは、enctypeを持つ複数のキーを含めることはできません。"
    },
    {
      "indent": 3,
      "text": "The security of Kerberos 5 depends absolutely on the confidentiality and integrity of the key objects stored in the KDC. Implementations of this standard MUST facilitate, to the extent possible, an administrator's ability to place more restrictive access controls on KeySets than on other principal data, and to arrange for more secure backup for KeySets.",
      "ja": "ケルベロス5のセキュリティは、KDCに保存されている主要なオブジェクトの機密性と完全性に絶対的に依存します。この標準の実装は、可能な限り、他の主要なデータに比べてキーセットにより制限のアクセスコントロールを配置するには、管理者の能力を促進しなければならない、とキーセットのためのより安全なバックアップのために手配すること。"
    },
    {
      "indent": 0,
      "text": "4.2.1. KeySet: Attributes",
      "section_title": true,
      "ja": "4.2.1. キーセット：属性"
    },
    {
      "indent": 0,
      "text": "4.2.1.1. kvno",
      "section_title": true,
      "ja": "4.2.1.1。 KVNO"
    },
    {
      "indent": 3,
      "text": "The key version number. This is a single-valued attribute containing a non-negative integer. This number is incremented by one each time a key in the KeySet is changed.",
      "ja": "鍵のバージョン番号。これは、負でない整数を含む単一値の属性です。この数は1でキーセット内のキーが変更されるたびにインクリメントされます。"
    },
    {
      "indent": 0,
      "text": "4.2.2. KeySet: Associations",
      "section_title": true,
      "ja": "4.2.2. キーセット：団体"
    },
    {
      "indent": 3,
      "text": "Each KeySet MUST be associated with a set of one or more Keys.",
      "ja": "各キーセットは1つまたは複数のキーのセットに関連付けられなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.3. Key",
      "section_title": true,
      "ja": "4.3. キー"
    },
    {
      "indent": 3,
      "text": "Implementations of this model MUST NOT force keys to be represented. That is, a schema that REQUIRED a key to be present would not meet this constraint.",
      "ja": "このモデルの実装は、表現するキーを強制してはなりません。それは、この制約を満たさない存在することがキーを必要なスキーマです。"
    },
    {
      "indent": 0,
      "text": "4.3.1. Key: Attributes",
      "section_title": true,
      "ja": "4.3.1. キー：属性"
    },
    {
      "indent": 0,
      "text": "4.3.1.1. keyEncryptionType",
      "section_title": true,
      "ja": "4.3.1.1。 keyEncryptionType"
    },
    {
      "indent": 3,
      "text": "The enctype SHOULD be represented as an enumeration of the enctypes supported by the KDC using the string name (\"encryption type\") of the enctype from the IANA registry of Kerberos Encryption Type Numbers. One example is \"aes128-cts-hmac-sha1-96\".",
      "ja": "ENCTYPEは、Kerberos暗号化タイプ番号のIANAレジストリからのenctypeの文字列名（「暗号化の種類」）を使用してKDCでサポートされているenctypesの列挙として表現できるようにして下さい。一つの例は、 \"AES128-CTS-HMAC-SHA1-96\" です。"
    },
    {
      "indent": 0,
      "text": "4.3.1.2. keyValue",
      "section_title": true,
      "ja": "4.3.1.2。 keyValueの"
    },
    {
      "indent": 3,
      "text": "The binary representation of the key data. This MUST be a single-valued octet string.",
      "ja": "キーデータのバイナリ表現。これは、単一値のオクテット文字列でなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.3.1.3. keySaltValue",
      "section_title": true,
      "ja": "4.3.1.3。 keySaltValue"
    },
    {
      "indent": 3,
      "text": "The binary representation of the key salt. This MUST be a single-valued octet string.",
      "ja": "キー塩のバイナリ表現。これは、単一値のオクテット文字列でなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.3.1.4. keyStringToKeyParameter",
      "section_title": true,
      "ja": "4.3.1.4。 keyStringToKeyParameter"
    },
    {
      "indent": 3,
      "text": "This MUST be a single-valued octet string representing an opaque parameter associated with the enctype. This parameter is specified using the string-to-key method defined in Section 3 of [RFC3961].",
      "ja": "これはENCTYPEに関連付けられた不透明なパラメータを表す単一値オクテットストリングでなければなりません。このパラメータは、[RFC3961]のセクション3で定義された文字列にキー方式を使用して指定されます。"
    },
    {
      "indent": 0,
      "text": "4.3.1.5. keyNotUsedBefore",
      "section_title": true,
      "ja": "4.3.1.5。 keyNotUsedBefore"
    },
    {
      "indent": 3,
      "text": "The key MUST NOT be used before this date. The syntax of the attribute MUST be semantically equivalent to the standard ISO date format ([RFC3339]). This attribute MUST be single-valued.",
      "ja": "キーは、この日付の前に使用してはいけません。属性の構文は、標準ISO日付フォーマットと意味的に等価である必要があります（[RFC3339]）。この属性は単一値でなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.3.1.6. keyNotUsedAfter",
      "section_title": true,
      "ja": "4.3.1.6。 keyNotUsedAfter"
    },
    {
      "indent": 3,
      "text": "The key MUST NOT be used after this date. The syntax of the attribute MUST be semantically equivalent to the standard ISO date format ([RFC3339]). This attribute MUST be single-valued.",
      "ja": "キーは、この日付以降に使用してはいけません。属性の構文は、標準ISO日付フォーマットと意味的に等価である必要があります（[RFC3339]）。この属性は単一値でなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.3.1.7. keyIsDisabled",
      "section_title": true,
      "ja": "4.3.1.7。 keyIsDisabled"
    },
    {
      "indent": 3,
      "text": "This is a boolean attribute that SHOULD be set to FALSE by default. If this attribute is TRUE, the key MUST NOT be used. The keyIsDisabled attributed is used to temporarily disable a key.",
      "ja": "これは、デフォルトではfalseに設定する必要がブール属性です。この属性がTRUEの場合、キーを使用してはいけません。一時的にキーを無効にするために使用される起因keyIsDisabled。"
    },
    {
      "indent": 0,
      "text": "4.3.2. Key: Associations",
      "section_title": true,
      "ja": "4.3.2. キー：団体"
    },
    {
      "indent": 3,
      "text": "None",
      "ja": "無し"
    },
    {
      "indent": 0,
      "text": "4.3.3. Key: Remarks",
      "section_title": true,
      "ja": "4.3.3. キー：特記事項"
    },
    {
      "indent": 3,
      "text": "The security of the keys is an absolute requirement for the operation of Kerberos 5. If keys are implemented, adequate protection from unauthorized modification and disclosure MUST be available and is REQUIRED of the implementation.",
      "ja": "キーのセキュリティは、Kerberos 5の操作キーが実装されている場合、不正な改変および開示からの十分な保護が利用可能でなければならないと実装が要求されるための絶対条件です。"
    },
    {
      "indent": 0,
      "text": "4.4. Policy",
      "section_title": true,
      "ja": "4.4. ポリシー"
    },
    {
      "indent": 3,
      "text": "Implementations SHOULD implement policies, but MAY allow them to be OPTIONAL. The policy should be thought of as a \"typed hole\", i.e., as an opaque binary value paired with an identifier of the type of data contained in the binary value. Both attributes (type and value) must be present.",
      "ja": "実装は、ポリシーを実装する必要がありますが、それらは任意でできるようにしてもよいです。ポリシーは、バイナリ値に含まれるデータのタイプの識別子と対に不透明なバイナリ値として、すなわち、「型付きホール」として考えなければなりません。両方の属性（種類および値）が存在しなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.4.1. Policy: Attributes",
      "section_title": true,
      "ja": "4.4.1. ポリシー：属性"
    },
    {
      "indent": 0,
      "text": "4.4.1.1. policyIdentifier",
      "section_title": true,
      "ja": "4.4.1.1。 policyIdentifier"
    },
    {
      "indent": 3,
      "text": "The policyIdentifier MUST be globally unique. Possible types of identifiers include:",
      "ja": "policyIdentifierはグローバルにユニークでなければなりません。識別子の可能なタイプは次のとおりです。"
    },
    {
      "indent": 3,
      "text": "o An Object Identifier (OID) [RFC4517]",
      "ja": "オブジェクト識別子（OID）[RFC4517] O"
    },
    {
      "indent": 3,
      "text": "o A URI [RFC3986]",
      "ja": "O URI [RFC3986]"
    },
    {
      "indent": 3,
      "text": "o A UUID [RFC4122]",
      "ja": "O UUID [RFC4122]"
    },
    {
      "indent": 3,
      "text": "Implementations of this specification are expected to assign globally unique identifiers to the list of the standard policy below in accordance with best practices for identifier management for the schema language used.",
      "ja": "この仕様の実装は使用されるスキーマ言語の識別子を管理するためのベストプラクティスに従って、以下の標準ポリシーのリストにグローバルに一意の識別子を割り当てることが予想されます。"
    },
    {
      "indent": 0,
      "text": "4.4.1.2. policyIsCritical",
      "section_title": true,
      "ja": "4.4.1.2。 policyIsCritical"
    },
    {
      "indent": 3,
      "text": "This boolean attribute indicates that the KDC MUST be able to correctly interpret and apply the policy for the principal to be used.",
      "ja": "このブール属性は、KDCが正しく解釈し、プリンシパルが使用されるためのポリシーを適用できなければならないことを示しています。"
    },
    {
      "indent": 0,
      "text": "4.4.1.3. policyContent",
      "section_title": true,
      "ja": "4.4.1.3。 policyContent"
    },
    {
      "indent": 3,
      "text": "This optional single opaque binary value is used to store a representation of the policy. In general, a policy cannot be fully expressed using attribute-value pairs. The policyContent is OPTIONAL in the sense that an implementation MAY use it to store an opaque value for the policy types that are not directly representable in that implementation.",
      "ja": "この任意の単一の不透明なバイナリ値は、ポリシーの表現を格納するために使用されます。一般に、ポリシーは、完全属性値のペアを使用して表現することができません。 policyContentは、実装は、その実装には直接表現できないポリシーの種類の不透明な値を格納するためにそれを使用するかもしれないという意味ではオプションです。"
    },
    {
      "indent": 0,
      "text": "4.4.1.4. policyUse",
      "section_title": true,
      "ja": "4.4.1.4。 policyUse"
    },
    {
      "indent": 3,
      "text": "This optional single enumerated string value is used to describe the use of the policy. Implementations SHOULD provide this attribute and MUST (if the attribute is implemented) describe the enumerated set of possible values. The intent is that this attribute provide an initial context-based filtering.",
      "ja": "このオプションの単一列挙の文字列値は、ポリシーの使用を記述するために使用されます。実装は、この属性を提供するべきであり、（属性が実装されている場合）の可能な値の列挙セットを記述しなければなりません。その意図は、この属性は、初期コンテキストベースのフィルタリングを提供するということです。"
    },
    {
      "indent": 0,
      "text": "4.4.2. Mandatory-to-Implement Policy",
      "section_title": true,
      "ja": "4.4.2. 実装に必須のポリシー"
    },
    {
      "indent": 3,
      "text": "All implementations that represent policy objects MUST be able to represent the policies listed in this section. Implementations are not required to use the same underlying data representation for the policyContent binary value, but SHOULD use the same OIDs as the policyIdentifier. In general, the expression of policy may require a Turing-complete language. This specification does not attempt to model policy-expression language.",
      "ja": "ポリシー・オブジェクトを表すすべての実装は、このセクションに記載されているポリシーを表現できなければなりません。実装はpolicyContentバイナリ値の同じ基本的なデータ表現を使用する必要はありませんが、policyIdentifier同じOIDを使用すべきです。一般的には、政策の発現はチューリング完全言語が必要な場合があります。この仕様は、ポリシー表現言語をモデル化しようとしません。"
    },
    {
      "indent": 0,
      "text": "4.4.2.1. Password Quality Policy",
      "section_title": true,
      "ja": "4.4.2.1。パスワード・品質方針"
    },
    {
      "indent": 3,
      "text": "Password quality policy controls the requirements placed by the KDC on new passwords.",
      "ja": "パスワード・品質方針は、新しいパスワードにKDCによって配置要件を制御します。"
    },
    {
      "indent": 0,
      "text": "4.4.2.2. Password Management Policy",
      "section_title": true,
      "ja": "4.4.2.2。パスワード管理ポリシー"
    },
    {
      "indent": 3,
      "text": "Password management policy controls how passwords are changed.",
      "ja": "パスワード管理ポリシーは、パスワードが変更される方法を制御します。"
    },
    {
      "indent": 0,
      "text": "4.4.2.3. Keying Policy",
      "section_title": true,
      "ja": "4.4.2.3。キーイングポリシー"
    },
    {
      "indent": 3,
      "text": "A keying policy specifies the association of enctypes with new principals. For example, when a principal is created, one of the applicable keying policies is used to determine the set of keys to associate with the principal.",
      "ja": "キーイングポリシーは、新しい原理にenctypesの関連付けを指定します。プリンシパルが作成されるとき、例えば、該当するキーのポリシーの一つは主に関連付けるキーのセットを決定するために使用されます。"
    },
    {
      "indent": 0,
      "text": "4.4.2.4. Ticket Flag Policy",
      "section_title": true,
      "ja": "4.4.2.4。チケット旗ポリシー"
    },
    {
      "indent": 3,
      "text": "A ticket flag policy specifies the ticket flags allowed for tickets issued for a principal.",
      "ja": "チケットフラグポリシーは、元本のために発行されたチケットに許可チケットフラグを指定します。"
    },
    {
      "indent": 0,
      "text": "5. Implementation Scenarios",
      "section_title": true,
      "ja": "5.実装シナリオ"
    },
    {
      "indent": 3,
      "text": "There are several ways to implement an administrative service for Kerberos 5 based on this information model. In this section, we list a few of them.",
      "ja": "この情報モデルに基づいて、Kerberos 5のための行政サービスを実装する方法はいくつかあります。このセクションでは、我々はそれらのいくつかをリストアップ。"
    },
    {
      "indent": 0,
      "text": "5.1. LDAP Backend to KDC",
      "section_title": true,
      "ja": "5.1.  KDCにLDAPバックエンド"
    },
    {
      "indent": 3,
      "text": "Given an LDAP schema implementation of this information model, it would be possible to build an administrative service by backending the KDC to a directory server where principals and keys are stored. Using the security mechanisms available on the directory, server keys are protected from access by anyone apart from the KDC. Administration of the principals, policy, and other non-key data is done through the directory server, while the keys are modified using the set/change password protocol [PASSWORD].",
      "ja": "この情報モデルのLDAPスキーマの実装を考えると、プリンシパルとキーが保存されているディレクトリサーバにKDCをbackendingことにより、行政サービスを構築することが可能であろう。ディレクトリで利用可能なセキュリティメカニズム使用して、サーバ鍵はKDCから離れて、誰でもアクセスから保護されています。キーが設定/変更パスワードプロトコル[パスワード]を使用して変更されている間プリンシパル、ポリシー、および他の非鍵データの投与は、ディレクトリ・サーバーを介して行われます。"
    },
    {
      "indent": 0,
      "text": "5.2. LDAP Frontend to KDC",
      "section_title": true,
      "ja": "5.2.  KDCにLDAPフロントエンド"
    },
    {
      "indent": 3,
      "text": "An alternative way to provide a directory interface to the KDC is to implement an LDAP frontend to the KDC that exposes all non-key objects as entries and attributes. As in the example above, all keys are modified using the set/change password protocol [PASSWORD]. In this scenario, the implementation would typically not use a traditional LDAP implementation, but would treat LDAP as a protocol to access data in the native KDC database.",
      "ja": "KDCへのディレクトリ・インターフェースを提供するための別の方法は、エントリや属性など、すべての非キーオブジェクトを公開KDCにLDAPフロントエンドを実装することです。上記の例のように、全てのキーは、設定/変更パスワードプロトコル[パスワード]を使用して修正されます。このシナリオでは、実装は、一般的に、伝統的なLDAP実装を使用していないだろうが、ネイティブKDCデータベース内のデータにアクセスするためのプロトコルとしてLDAPを扱っていました。"
    },
    {
      "indent": 0,
      "text": "5.3. SOAP",
      "section_title": true,
      "ja": "5.3. 石鹸"
    },
    {
      "indent": 3,
      "text": "Given an XML schema implementation of this information model, it would be possible to build a SOAP interface to the KDC. This situation demonstrates the value of creating an abstract information model that is mappable to multiple schema representations.",
      "ja": "この情報モデルのXMLスキーマの実装を考えると、KDCにSOAPインターフェイスを構築することが可能であろう。この状況は、複数のスキーマ表現にマッピング可能である抽象的な情報モデルを作成するための値を示しています。"
    },
    {
      "indent": 0,
      "text": "5.4. NETCONF",
      "section_title": true,
      "ja": "5.4.  NETCONF"
    },
    {
      "indent": 3,
      "text": "Given a YAML (YAML Ain't Markup Language) implementation of this information model, it would be possible to create a NETCONF-based interface to the KDC, enabling management of the KDC from standard network management applications.",
      "ja": "YAMLこの情報モデルの実装（YAMLはマークアップ言語ではない）を考えると、標準的なネットワーク管理アプリケーションからのKDCの管理を可能にする、KDCにNETCONFベースのインターフェイスを作成することが可能です。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document describes an abstract information model for Kerberos 5. The Kerberos 5 protocol depends on the security of the keys stored in the KDC. The model described here assumes that keys MUST NOT be transported in the clear over the network and furthermore that keys be treated as write-only attributes that SHALL be modified (using the administrative interface) only by the change-password protocol [PASSWORD].",
      "ja": "この文書では、Kerberos 5プロトコルがKDCに保存されたキーのセキュリティに依存ケルベロス5の抽象情報モデルを記述する。ここで説明したモデルは、キーは書き込み専用のみ変更パスワードプロトコル[パスワード]によって（管理インターフェースを使用して）変更することが旨属性としてキーが処理されることが、さらにネットワーク上明らかに輸送されてはならないことを前提としています。"
    },
    {
      "indent": 3,
      "text": "Exposing the object model of a KDC typically implies that objects can be modified, deleted, or both. In a KDC, not all principals are created equal. For instance, deleting krbtgt/EXAMPLE.COM@EXAMPLE.COM effectively disables the EXAMPLE.COM realm. Hence, access control is paramount to the security of any implementation. This document does not mandate access control. This situation implies only that access control is beyond the scope of the standard information model, i.e., that access control may not be accessible via any protocol based on this model. If access control objects are exposed via an extension to this model, the presence of access control may in itself provide points of attack by giving away information about principals that have elevated rights.",
      "ja": "KDCのオブジェクトモデルを露出することは、典型的にオブジェクトが削除、変更、または両方であり得ることを意味します。 KDCではなく、すべてのプリンシパルは、同じように作られています。例えば、削除krbtgt/EXAMPLE.COM@EXAMPLE.COMを効果EXAMPLE.COMレルムを無効にします。したがって、アクセス制御は、任意の実装のセキュリティにとって最も重要です。この文書では、アクセス制御を強制しません。この状況は、アクセス制御は、このモデルに基づいて、任意のプロトコルを介してアクセス可能ではないかもしれないこと、即ち、標準的な情報モデルの範囲を超えているだけでアクセス制御を意味しています。アクセス制御オブジェクトは、このモデルの拡張を介して公開されている場合は、アクセス制御の存在は、それ自体に権利が上昇しているプリンシパルについての情報を配っによる攻撃のポイントを提供することができます。"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgments",
      "section_title": true,
      "ja": "7.謝辞"
    },
    {
      "indent": 3,
      "text": "The author wishes to extend his thanks to Love Hoernquist-Aestrand and Sam Hartman for their important contributions to this document.",
      "ja": "作者はこのドキュメントへの重要な貢献のための愛Hoernquist-Aestrandとサム・ハートマンへの感謝の意を拡張したいです。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8.参照文献"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "ja": "8.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC1964] Linn, J., \"The Kerberos Version 5 GSS-API Mechanism\", RFC 1964, June 1996.",
      "ja": "[RFC1964]リン、J.、 \"Kerberosバージョン5 GSS-APIメカニズム\"、RFC 1964、1996年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3339] Klyne, G., Ed. and C. Newman, \"Date and Time on the Internet: Timestamps\", RFC 3339, July 2002.",
      "ja": "[RFC3339] Klyne、G.、エド。そして、C.ニューマン、「インターネット上の日付と時刻：タイムスタンプ」、RFC 3339、2002年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC3961] Raeburn, K., \"Encryption and Checksum Specifications for Kerberos 5\", RFC 3961, February 2005.",
      "ja": "[RFC3961]レイバーン、K.、 \"暗号化とケルベロス5チェックサムの仕様\"、RFC 3961、2005年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC3986] Berners-Lee, T., Fielding, R., and L. Masinter, \"Uniform Resource Identifier (URI): Generic Syntax\", STD 66, RFC 3986, January 2005.",
      "ja": "[RFC3986]バーナーズ - リー、T.、フィールディング、R.、およびL. Masinter、 \"ユニフォームリソース識別子（URI）：汎用構文\"、STD 66、RFC 3986、2005年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC4120] Neuman, C., Yu, T., Hartman, S., and K. Raeburn, \"The Kerberos Network Authentication Service (V5)\", RFC 4120, July 2005.",
      "ja": "[RFC4120]ノイマン、C.、ゆう、T.、ハルトマン、S.、およびK.レイバーン、 \"ケルベロスネットワーク認証サービス（V5）\"、RFC 4120、2005年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC4122] Leach, P., Mealling, M., and R. Salz, \"A Universally Unique IDentifier (UUID) URN Namespace\", RFC 4122, July 2005.",
      "ja": "[RFC4122]リーチ、P.、Mealling、M.、およびR. Salzの、 \"汎用一意識別子（UUID）URN名前空間\"、RFC 4122、2005年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC4517] Legg, S., \"Lightweight Directory Access Protocol (LDAP): Syntaxes and Matching Rules\", RFC 4517, June 2006.",
      "ja": "[RFC4517]レッグ、S.​​、 \"ライトウェイトディレクトリアクセスプロトコル（LDAP）：構文と一致規則\"、RFC 4517、2006年6月。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "ja": "8.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[PASSWORD] Williams, N., \"Kerberos Set/Change Key/Password Protocol Version 2\", Work in Progress, November 2008.",
      "ja": "[PASSWORD]ウィリアムズ、N.、 \"Kerberosの設定/変更キー/パスワードプロトコルバージョン2\"、進歩、2008年11月の作業。"
    },
    {
      "indent": 3,
      "text": "[RFC4510] Zeilenga, K., \"Lightweight Directory Access Protocol (LDAP): Technical Specification Road Map\", RFC 4510, June 2006.",
      "ja": "[RFC4510] Zeilenga、K.、 \"ライトウェイトディレクトリアクセスプロトコル（LDAP）：技術仕様ロードマップ\"、RFC 4510、2006年6月。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Leif Johansson Swedish University Network Thulegatan 11 Stockholm Sweden",
      "ja": "レイフ・ヨハンソンスウェーデンの大学ネットワークThulegatan 11ストックホルムスウェーデン"
    },
    {
      "indent": 3,
      "text": "EMail: leifj@sunet.se URI: http://www.sunet.se",
      "ja": "電子メール：URI leifj@sunet.se：http://www.sunet.se"
    }
  ]
}