{
  "title": {
    "text": "RFC 6444 - Location Hiding: Problem Statement and Requirements",
    "ja": "RFC 6444 - 位置隠れ：問題の声明と要件"
  },
  "number": 6444,
  "created_at": "2022-11-18 05:17:19.838447+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                    H. Schulzrinne\nRequest for Comments: 6444                           Columbia University\nCategory: Informational                                         L. Liess\nISSN: 2070-1721                                         Deutsche Telekom\n                                                           H. Tschofenig\n                                                  Nokia Siemens Networks\n                                                                B. Stark\n                                                                    AT&T\n                                                                A. Kuett\n                                                                   Skype\n                                                            January 2012",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 10,
      "text": "Location Hiding: Problem Statement and Requirements",
      "ja": "位置隠れ：問題の声明と要件"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "The emergency services architecture developed in the IETF Emergency Context Resolution with Internet Technology (ECRIT) working group describes an architecture where location information is provided by access networks to endpoints or Voice over IP (VoIP) service providers in order to determine the correct dial string and information to route the call to a Public Safety Answering Point (PSAP). To determine the PSAP Uniform Resource Identifier (URI), the usage of the Location-to-Service Translation (LoST) protocol is envisioned.",
      "ja": "IETFで開発された緊急サービスアーキテクチャは、インターネットテクノロジー（ECRIT）ワーキンググループを使用したIETF緊急コンテキスト解像度（ECRIT）で、アクセスネットワークがエンドポイントまたはボイスオーバーIP（VOIP）サービスプロバイダーに位置情報が提供されるアーキテクチャを説明し、正しいダイヤル文字列を決定します。通話を公共の安全回答ポイント（PSAP）にルーティングするための情報。PSAPユニフォームリソース識別子（URI）を決定するために、場所からサービスへの翻訳（失われた）プロトコルの使用が想定されています。"
    },
    {
      "indent": 3,
      "text": "This document provides a problem statement and lists requirements for situations where the Internet Access Provider (IAP) and/or the Internet Service Provider (ISP) are only willing to disclose limited or no location information.",
      "ja": "このドキュメントは、問題のステートメントを提供し、インターネットアクセスプロバイダー（IAP）および/またはインターネットサービスプロバイダー（ISP）が限られたまたは位置情報を開示するか、ロケーションなしで開示することをいとわない状況の要件をリストします。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントは、インターネット標準の追跡仕様ではありません。情報目的で公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントは、インターネットエンジニアリングタスクフォース（IETF）の製品です。IETFコミュニティのコンセンサスを表しています。公開レビューを受けており、インターネットエンジニアリングステアリンググループ（IESG）からの出版が承認されています。IESGによって承認されたすべてのドキュメントが、あらゆるレベルのインターネット標準の候補者ではありません。RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6444.",
      "ja": "このドキュメントの現在のステータス、任意のERRATA、およびそのフィードバックを提供する方法に関する情報は、http：//www.rfc-editor.org/info/rfc6444で取得できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2012 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書に関するあなたの権利と制限を説明するので、これらの文書を注意深く確認してください。"
    },
    {
      "indent": 3,
      "text": "This document may contain material from IETF Documents or IETF Contributions published or made publicly available before November 10, 2008. The person(s) controlling the copyright in some of this material may not have granted the IETF Trust the right to allow modifications of such material outside the IETF Standards Process. Without obtaining an adequate license from the person(s) controlling the copyright in such materials, this document may not be modified outside the IETF Standards Process, and derivative works of it may not be created outside the IETF Standards Process, except to format it for publication as an RFC or to translate it into languages other than English.",
      "ja": "このドキュメントには、2008年11月10日までに公開または公開されたIETFドキュメントまたはIETFの寄付からの資料が含まれている場合があります。IETF標準プロセスの外。そのような資料の著作権を制御する人から適切なライセンスを取得せずに、このドキュメントはIETF標準プロセスの外側に変更されない場合があり、その派生作業は、ITF標準プロセスの外側で作成されない場合があります。RFCとしての出版またはそれを英語以外の言語に翻訳するため。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n   1.1. Emergency Services Architecture ............................3\n   1.2. Location Hiding ............................................3\n   1.3. Location by Reference ......................................4\n2. Terminology .....................................................5\n3. Requirements ....................................................5\n4. Security Considerations .........................................7\n5. Acknowledgments .................................................7\n6. Normative References ............................................7",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 0,
      "text": "1.1. Emergency Services Architecture",
      "section_title": true,
      "ja": "1.1. 緊急サービスアーキテクチャ"
    },
    {
      "indent": 3,
      "text": "The emergency services architecture developed in the IETF Emergency Context Resolution with Internet Technology (ECRIT) working group, see [RFC6443], describes an architecture where location information is provided by access networks to endpoints or VoIP service providers in order to determine the correct dial string and information to route the call to a Public Safety Answering Point (PSAP). The Location-to-Service Translation (LoST) protocol [RFC5222] allows callers and other call-routing entities to determine the PSAP Uniform Resource Identifier (URI) for a specific geographical location together with a service URN [RFC5031]. The basic architecture is shown in Figure 1 of [RFC6443] and further detailed in the message flow in Figure 2 of [RFC6443].",
      "ja": "IETFで開発された緊急サービスアーキテクチャは、インターネットテクノロジー（ECRIT）ワーキンググループを使用したIETF緊急コンテキスト解像度[RFC6443]を参照して、アクセスネットワークによってエンドポイントまたはVoIPサービスプロバイダーに位置情報が提供されるアーキテクチャを説明し、正しいダイヤル文字列を決定します。通話を公共の安全回答ポイント（PSAP）にルーティングするための情報。場所からサービスへの翻訳（失われた）プロトコル[RFC5222]により、発信者やその他のコールルーティングエンティティは、サービスURN [RFC5031]とともに特定の地理的位置のPSAPユニフォームリソース識別子（URI）を決定できます。基本的なアーキテクチャは[RFC6443]の図1に示されており、[RFC643]の図2のメッセージフローでさらに詳しく説明しています。"
    },
    {
      "indent": 3,
      "text": "For emergency services, location information is needed for three purposes:",
      "ja": "緊急サービスの場合、3つの目的に位置情報が必要です。"
    },
    {
      "indent": 3,
      "text": "1. Emergency call routing to the PSAP that is responsible for a specific geographical region.",
      "ja": "1. 特定の地理的領域を担当するPSAPへの緊急通話ルーティング。"
    },
    {
      "indent": 3,
      "text": "2. Dispatch of the emergency personnel to the scene of an accident, crime, or other type of incident.",
      "ja": "2. 事故、犯罪、またはその他の種類の事件の現場に救急隊員を派遣します。"
    },
    {
      "indent": 3,
      "text": "3. Additionally, a Voice Service Provider (VSP) may need to verify that a call is indeed an emergency call and may therefore require location information to ensure that calls routed to a specific URI point to a PSAP.",
      "ja": "3. "
    },
    {
      "indent": 3,
      "text": "This document focuses on items (1) and (3). Providing location information by the ISP to emergency authorities, including PSAPs, regional emergency management association, and emergency personnel is typically a legal obligation covered by regulatory frameworks.",
      "ja": "このドキュメントは、アイテム（1）および（3）に焦点を当てています。PSAP、地域緊急事態管理協会、緊急要員など、ISPによる緊急当局に位置情報を提供することは、通常、規制の枠組みによって対象となる法的義務です。"
    },
    {
      "indent": 0,
      "text": "1.2. Location Hiding",
      "section_title": true,
      "ja": "1.2. 隠れ場所"
    },
    {
      "indent": 3,
      "text": "Internet Access Providers (IAPs) and Internet Service Providers (ISPs) typically have little incentive to provide location information to end hosts or independent VSPs (without monetary compensation) for any purpose, including for emergency call routing. The decision to deny disclosure of location information can be driven by a number of technical and business concerns. Some providers may perceive a risk that allowing users to access location information for non-emergency purposes or prior to an emergency call will incur additional server load and thus costs. Other providers may not want",
      "ja": "インターネットアクセスプロバイダー（IAP）とインターネットサービスプロバイダー（ISP）は通常、緊急通話ルーティングを含む、あらゆる目的でホストまたは独立したVSP（金融補償なし）を終了するための位置情報を提供するインセンティブをほとんど持っていません。位置情報の開示を拒否する決定は、多くの技術的およびビジネス上の懸念によって推進される可能性があります。一部のプロバイダーは、ユーザーが非緊急目的で、または緊急電話の前に位置情報にアクセスできるようにするリスクを認識している場合があります。他のプロバイダーは望まないかもしれません"
    },
    {
      "indent": 3,
      "text": "to make location information available without the ability to charge for it. Yet, others fear problems with regard to privacy when disclosing location information to potentially unknown third parties.",
      "ja": "請求することなく位置情報を利用できるようにするため。しかし、他の人は、潜在的に未知の第三者に位置情報を開示する際にプライバシーに関する問題を恐れています。"
    },
    {
      "indent": 0,
      "text": "1.3. Location by Reference",
      "section_title": true,
      "ja": "1.3. 参照による場所"
    },
    {
      "indent": 3,
      "text": "The work on the Location Configuration Protocol (LCP) indicated the need to provide the capability to obtain Location-by-References (LbyRs) in addition to Location-by-Value (LbyV) from a Location Information Server (LIS).",
      "ja": "ロケーション構成プロトコル（LCP）の作業は、ロケーション情報サーバー（LIS）からの場所ごと（LBYV）に加えて、参照ごと（LBYR）を取得する機能を提供する必要があることを示しています。"
    },
    {
      "indent": 3,
      "text": "The LCP problem statement and requirements document is [RFC5687]. The requirements for obtaining an LbyR via the LCP and the corresponding dereferencing step can be found in [RFC5808].",
      "ja": "LCP問題ステートメントと要件文書は[RFC5687]です。LCPおよび対応する逆方向のステップを介してLBYRを取得するための要件は、[RFC5808]に記載されています。"
    },
    {
      "indent": 3,
      "text": "HTTP Enabled Location Delivery (HELD), see [RFC5985], is an instantiation of the LCP concept and allows LbyVs and LbyRs to be requested.",
      "ja": "HTTP対応の位置配信（保持）、[RFC5985]を参照して、LCPコンセプトのインスタンス化であり、LBYVとLBYRを要求することを可能にします。"
    },
    {
      "indent": 3,
      "text": "A location reference may already satisfy the requirement for location hiding if the PSAP has the appropriate credentials to resolve the reference. These credentials allow the ISP/IAP to authenticate and to authorize the party that would like to request location information. The policy to obtain these credentials allows ISPs/IAPs to put constraints under which these credentials are handed out. ISPs/IAPs ideally might want to engage in a business relationship with the VSP to receive a financial compensation for the service they provide. On the Internet, the number of VSPs is potentially large and the VSPs would not want to enter a business contract with potentially every ISP/IAP worldwide. The number of potential contracts between ISPs/IAPs and PSAPs is, however, relatively small as they typically need to have a local relationship as PSAPs provide their emergency services support in a certain geographical region for which certain ISPs/IAPs have networks deployed.",
      "ja": "位置参照は、PSAPが参照を解決するための適切な資格情報を持っている場合、ロケーションの隠蔽の要件を既に満たすことができます。これらの資格情報により、ISP/IAPは、位置情報を要求したい当事者を認証し、承認することができます。これらの資格情報を取得するためのポリシーにより、ISPS/IAPは、これらの資格情報が配布される制約を入れることができます。ISPS/IAPは、理想的には、VSPとのビジネス関係に従事し、提供するサービスに対する財政的報酬を受け取りたいと思うかもしれません。インターネットでは、VSPの数は潜在的に大きく、VSPは世界中のすべてのISP/IAPとのビジネス契約を締結したくありません。ただし、ISP/IAPとPSAPの間の潜在的な契約の数は、特定のISP/IAPがネットワークを展開している特定の地理的領域で緊急サービスサポートを提供するため、通常、ローカルな関係を持つ必要があるため、比較的少ないためです。"
    },
    {
      "indent": 3,
      "text": "Note that the requirement being met here is for delivery of location information to the PSAP, not for LoST routing or for validation at the VSP. Since LoST [RFC5222] requires location by value, location by reference cannot be used for location-based routing. Also, LoST servers may be operated by independent parties, including VSPs, which again may not be able to resolve the reference to location by value. (Note that LoST is a protocol used for determining the location-appropriate PSAP based on location information and a Service URN [RFC5031].)",
      "ja": "ここで満たされている要件は、失われたルーティングやVSPでの検証ではなく、PSAPへの位置情報の配信であることに注意してください。紛失[RFC5222]には価値によって位置が必要なため、参照により場所を使用することはできません。また、失われたサーバーは、VSPを含む独立した当事者によって運用される場合があります。VSPは、価値ごとに場所への参照を解決できない場合があります。（Lostは、位置情報とサービスURN [RFC5031]に基づいて、位置に適したPSAPを決定するために使用されるプロトコルであることに注意してください。）"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "ja": "2. 用語"
    },
    {
      "indent": 3,
      "text": "The keywords \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119], with the important qualification that, unless otherwise stated, these terms apply to the design of an solution supporting location hiding, not its implementation or application.",
      "ja": "キーワードは「必要」、「必要」、「必須」、「shall」、「shall \"、\" ingle \"、\" low \"obs\"、 \"becommended\"、 \"\"、 \"optional\"は、[RFC2119]に記載されているように解釈され、特に明記しない限り、これらの用語は、その実装やアプリケーションではなく、位置の隠れをサポートするソリューションの設計に適用されるという重要な資格があります。"
    },
    {
      "indent": 3,
      "text": "This document reuses terminology from [RFC5687].",
      "ja": "この文書は、[RFC5687]から用語を再利用します。"
    },
    {
      "indent": 0,
      "text": "3. Requirements",
      "section_title": true,
      "ja": "3. 要件"
    },
    {
      "indent": 3,
      "text": "Req-1: There MUST be a way for the ISP/IAP to withhold precise location information from the endpoint and from the VSP.",
      "ja": "REQ-1：ISP/IAPがエンドポイントとVSPから正確な位置情報を差し控える方法がなければなりません。"
    },
    {
      "indent": 3,
      "text": "Req-2: The ISP/IAP MUST support the ability of the endpoint or the VSP to route emergency calls.",
      "ja": "REQ-2：ISP/IAPは、緊急コールをルーティングするエンドポイントまたはVSPの能力をサポートする必要があります。"
    },
    {
      "indent": 3,
      "text": "Req-3: The VSP MUST be able to validate that a call purported to be an emergency call is being routed to a bona fide URI, which is denoted by being a URI in LoST for the designated emergency service. This requirement is provided to deal with potential security problems described in Section 5.1 of [RFC5069].",
      "ja": "REQ-3：VSPは、緊急電話であると言われているコールが、指定された緊急サービスのために紛失したURIであることによって示される真正なURIにルーティングされていることを検証できる必要があります。この要件は、[RFC5069]のセクション5.1で説明されている潜在的なセキュリティ問題に対処するために提供されます。"
    },
    {
      "indent": 3,
      "text": "Req-4: The PSAP MUST receive precise location information (by value) about emergency callers. As such, any solution MUST be able to provide location information to the PSAP even while withholding it from the emergency caller.",
      "ja": "REQ-4：PSAPは、緊急発信者に関する正確な位置情報（価値によって）を受信する必要があります。そのため、緊急発信者から源泉徴収中であっても、PSAPに位置情報を提供できる必要があります。"
    },
    {
      "indent": 3,
      "text": "Req-5: The proposed solution MUST NOT assume a business or trust relationship between the caller's VSP and the caller's ISP.",
      "ja": "REQ-5：提案されたソリューションは、発信者のVSPと発信者のISPとの間のビジネスまたは信頼関係を想定してはなりません。"
    },
    {
      "indent": 3,
      "text": "Req-6: A solution MUST consider deployment scenarios where a VSP does not operate in the same jurisdiction as the PSAP.",
      "ja": "REQ-6：ソリューションは、VSPがPSAPと同じ管轄区域で動作しない展開シナリオを考慮する必要があります。"
    },
    {
      "indent": 3,
      "text": "Req-7: The solution MUST consider that service boundaries for the various emergency services responsible for a particular location may differ.",
      "ja": "REQ-7：解決策は、特定の場所を担当するさまざまな緊急サービスのサービス境界が異なる場合があることを考慮する必要があります。"
    },
    {
      "indent": 3,
      "text": "Req-8: The steps needed by the endpoint for emergency calling SHOULD be no different when location is withheld versus when location is not withheld. In particular, user agents cannot require additional configuration to discover in which particular environment (hiding or no hiding) they find themselves.",
      "ja": "REQ-8：緊急通話のためにエンドポイントが必要とする手順は、場所が差し控えられている場合と場所が差し控えられない場合に変わらないはずです。特に、ユーザーエージェントは、特定の環境（隠れまたは隠れなし）で自分自身を見つけるために追加の構成を必要とすることはできません。"
    },
    {
      "indent": 3,
      "text": "Req-9: The solution SHOULD work without the ISP/IAP having to support SIP and without the need to utilize SIP between the endpoint and the VSP.",
      "ja": "REQ-9：ISP/IAPがSIPをサポートする必要がなく、エンドポイントとVSPの間でSIPを使用する必要なく、ソリューションは機能する必要があります。"
    },
    {
      "indent": 3,
      "text": "Req-10: The solution MUST work if PSAP boundaries have holes. (For a discussion about holes in PSAP boundaries and their encoding, the reader is referred to [RFC5964].)",
      "ja": "REQ-10：PSAPの境界に穴がある場合、ソリューションは機能する必要があります。（PSAP境界の穴とそのエンコードに関する議論のために、読者は[RFC5964]と呼ばれます。）"
    },
    {
      "indent": 3,
      "text": "Req-11: The solution MUST NOT assume the existence of Emergency Service Routing Proxies (ESRPs) per country, state, and city.",
      "ja": "Req-11：ソリューションは、国、州、および都市ごとの緊急サービスルーティングプロキシ（ESRP）の存在を想定してはなりません。"
    },
    {
      "indent": 3,
      "text": "Req-12: The solution MUST consider that service boundaries for different emergency services may differ, but they overlap at the location of the caller.",
      "ja": "REQ-12：ソリューションは、異なる緊急サービスのサービス境界が異なる場合があるが、発信者の場所で重複する可能性があることを考慮する必要があります。"
    },
    {
      "indent": 3,
      "text": "Req-13: Though the solution MAY add steps to the emergency call routing process described in [RFC6443], these steps MUST NOT significantly increase call setup latency. For example, the revised process MUST NOT include \"trial-and-error\" operations on its critical path, such as attempts at LbyR resolutions that may take time to time out.",
      "ja": "REQ-13：ソリューションは[RFC6443]で説明されている緊急通話ルーティングプロセスに手順を追加する場合がありますが、これらの手順はコールセットアップの遅延を大幅に増加させてはなりません。たとえば、改訂されたプロセスには、タイムアウトに時間がかかる可能性のあるLBYR解像度の試みなど、その重要なパスでの「試行錯誤」操作を含めるべきではありません。"
    },
    {
      "indent": 3,
      "text": "Req-14: The solution MUST allow the end host to determine PSAP/ESRP URLs prior to the call, for all emergency services.",
      "ja": "REQ-14：ソリューションは、すべての緊急サービスに対して、コールの前にPSAP/ESRP URLを決定できるようにする必要があります。"
    },
    {
      "indent": 3,
      "text": "Req-15: The solution MUST allow user agents (UAs) to discover at least their dial string ahead of the emergency call.",
      "ja": "REQ-15：ソリューションは、ユーザーエージェント（UAS）が緊急通話の前に少なくともダイヤル文字列を発見できるようにする必要があります。"
    },
    {
      "indent": 3,
      "text": "Req-16: The solution MUST have minimal impact on UAs, i.e., a solution is preferred if it does not require a substantially different emergency service procedure compared to the procedure of dealing with emergency services where no location hiding is applied.",
      "ja": "REQ-16：ソリューションはUASへの影響を最小限に抑える必要があります。つまり、場所が隠れていない緊急サービスを扱う手順と比較して、実質的に異なる緊急サービス手順を必要としない場合、ソリューションが推奨されます。"
    },
    {
      "indent": 3,
      "text": "Req-17: The solution MUST NOT interfere with the use of LoST for non-emergency services.",
      "ja": "REQ-17：ソリューションは、非緊急サービスに対するLostの使用を妨害してはなりません。"
    },
    {
      "indent": 3,
      "text": "Req-18: The solution MUST allow emergency calls to reach an IP-to-PSTN gateway rather than the IP-based PSAP directly.",
      "ja": "REQ-18：ソリューションは、IPベースのPSAPではなくIPからPSTNゲートウェイに直接到達するための緊急コールを許可する必要があります。"
    },
    {
      "indent": 3,
      "text": "Req-19: The solution MUST NOT shift effort (externality), i.e., the convenience of the location-hiding ISP MUST NOT impose a burden on user agents or non-hiding ISPs/IAPs and SHOULD NOT impose a burden on VSPs.",
      "ja": "REQ-19：ソリューションは、努力（外部性）を変えてはなりません。つまり、場所ハイディングISPの利便性は、ユーザーエージェントまたは非ハイディングISP/IAPに負担をかけてはならず、VSPに負担をかけるべきではありません。"
    },
    {
      "indent": 3,
      "text": "Req-20: The solution SHOULD minimize the impact on LoST, SIP conveyance [RFC6442], and DHCP.",
      "ja": "REQ-20：ソリューションは、失われた輸送、SIP輸送[RFC6442]、およびDHCPへの影響を最小限に抑える必要があります。"
    },
    {
      "indent": 3,
      "text": "Req-21: The solution SHOULD NOT break in the presence of NATs and SHOULD consider the presence of legacy devices, as described in [RFC5687].",
      "ja": "REQ-21：[RFC5687]に記載されているように、ソリューションはNATの存在下で壊れてはならず、レガシーデバイスの存在を考慮する必要があります。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "This document does not raise additional security consideration beyond those mentioned in [RFC5687] and discussed in this document.",
      "ja": "このドキュメントは、[RFC5687]で言及されたものを超えて、このドキュメントで説明したものを超えて追加のセキュリティ対価を提起するものではありません。"
    },
    {
      "indent": 0,
      "text": "5. Acknowledgments",
      "section_title": true,
      "ja": "5. 謝辞"
    },
    {
      "indent": 3,
      "text": "We would like to thank the following ECRIT working group members (in no particular order) for their contributions:",
      "ja": "次のECRITワーキンググループメンバー（順不同）に貢献してくれたことに感謝します。"
    },
    {
      "indent": 3,
      "text": "o Andrew Newton (andy@hxr.us)",
      "ja": "o アンドリュー・ニュートン（andy@hxr.us）"
    },
    {
      "indent": 3,
      "text": "o James Winterbottom (James.Winterbottom@andrew.com)",
      "ja": "o James Winterbottom（James.winterbottom@andrew.com）"
    },
    {
      "indent": 3,
      "text": "o Brian Rosen (br@brianrosen.net)",
      "ja": "o ブライアンローゼン（br@brianrosen.net）"
    },
    {
      "indent": 3,
      "text": "o Richard Barnes (rbarnes@bbn.com)",
      "ja": "o リチャード・バーンズ（rbarnes@bbn.com）"
    },
    {
      "indent": 3,
      "text": "o Marc Linsner (mlinsner@cisco.com)",
      "ja": "o Marc Linsner（mlinsner@cisco.com）"
    },
    {
      "indent": 3,
      "text": "o Ted Hardie (hardie@qualcomm.com)",
      "ja": "o Ted Hardie（hardie@qualcomm.com）"
    },
    {
      "indent": 3,
      "text": "The authors would also like to thank Ben Campbell for his Gen-ART review. Additionally, we would like to thank Jari Arkko, Alexey Melnikov, Tim Polk, and Dan Romascanu for their IESG review.",
      "ja": "著者はまた、ベン・キャンベルのgen-artレビューに感謝したいと思います。さらに、IESGレビューについてJari Arkko、Alexey Melnikov、Tim Polk、Dan Romascanuに感謝します。"
    },
    {
      "indent": 0,
      "text": "6. Normative References",
      "section_title": true,
      "ja": "6. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119] Bradner、S。、「要件レベルを示すためにRFCで使用するためのキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC5031] Schulzrinne, H., \"A Uniform Resource Name (URN) for Emergency and Other Well-Known Services\", RFC 5031, January 2008.",
      "ja": "[RFC5031] Schulzrinne、H。、「緊急およびその他のよく知られたサービスのための均一なリソース名（URN）」、RFC 5031、2008年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC5069] Taylor, T., Tschofenig, H., Schulzrinne, H., and M. Shanmugam, \"Security Threats and Requirements for Emergency Call Marking and Mapping\", RFC 5069, January 2008.",
      "ja": "[RFC5069] Taylor、T.、Tschofenig、H.、Schulzrinne、H。、およびM. Shanmugam、「緊急コールマーキングとマッピングのセキュリティの脅威と要件」、RFC 5069、2008年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC5222] Hardie, T., Newton, A., Schulzrinne, H., and H. Tschofenig, \"LoST: A Location-to-Service Translation Protocol\", RFC 5222, August 2008.",
      "ja": "[RFC5222] Hardie、T.、Newton、A.、Schulzrinne、H。、およびH. Tschofenig、「Lost：A Location-s-Service Translation Protocol」、RFC 5222、2008年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC5687] Tschofenig, H. and H. Schulzrinne, \"GEOPRIV Layer 7 Location Configuration Protocol: Problem Statement and Requirements\", RFC 5687, March 2010.",
      "ja": "[RFC5687] Tschofenig、H。およびH. Schulzrinne、「Geopriv Layer 7位置構成プロトコル：問題ステートメントと要件」、RFC 5687、2010年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC5808] Marshall, R., \"Requirements for a Location-by-Reference Mechanism\", RFC 5808, May 2010.",
      "ja": "[RFC5808] Marshall、R。、「場所ごとのメカニズムの要件」、RFC 5808、2010年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC5964] Winterbottom, J. and M. Thomson, \"Specifying Holes in Location-to-Service Translation (LoST) Service Boundaries\", RFC 5964, August 2010.",
      "ja": "[RFC5964] Winterbottom、J。およびM. Thomson、「場所からサービスへの翻訳（失われた）サービス境界の指定」、RFC 5964、2010年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC5985] Barnes, M., \"HTTP-Enabled Location Delivery (HELD)\", RFC 5985, September 2010.",
      "ja": "[RFC5985] Barnes、M。、「HTTP対応の位置配信（保有）」、RFC 5985、2010年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC6442] Polk, J., Rosen, B., and J. Peterson, \"Location Conveyance for the Session Initiation Protocol\", RFC 6442, December 2011.",
      "ja": "[RFC6442] Polk、J.、Rosen、B。、およびJ. Peterson、「セッション開始プロトコルの位置輸送」、RFC 6442、2011年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC6443] Rosen, B., Schulzrinne, H., Polk, J., and A. Newton, \"Framework for Emergency Calling Using Internet Multimedia\", RFC 6443, December 2011.",
      "ja": "[RFC6443] Rosen、B.、Schulzrinne、H.、Polk、J。、およびA. Newton、「インターネットマルチメディアを使用した緊急通話のフレームワーク」、RFC 6443、2011年12月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Henning Schulzrinne Columbia University Department of Computer Science 450 Computer Science Building New York, NY 10027 US Phone: +1 212 939 7004 EMail: hgs+ecrit@cs.columbia.edu URI: http://www.cs.columbia.edu",
      "ja": "ヘニングシュルツリンヌコロンビア大学コンピューターサイエンス学科450コンピューターサイエンスビル、ニューヨーク、ニューヨーク、ニューヨーク、ニューヨーク10027米国電話：1 212 939 7004メール：hgs ecrit@cs.columbia.edu uri：http：//www.cs.columbia.edu"
    },
    {
      "indent": 3,
      "text": "Laura Liess Deutsche Telekom Networks Deutsche Telekom Allee 7 Darmstadt, Hessen 64295 Germany Phone: EMail: L.Liess@telekom.de URI: http://www.telekom.de",
      "ja": "Laura Liess Deutsche Telekom Networks Deutsche Telekom Allee 7 Darmstadt、Hessen 64295ドイツ電話：電子メール：l.liess@telekom.de uri：http：//www.telekom.de"
    },
    {
      "indent": 3,
      "text": "Hannes Tschofenig Nokia Siemens Networks Linnoitustie 6 Espoo 02600 Finland Phone: +358 (50) 4871445 EMail: Hannes.Tschofenig@gmx.net URI: http://www.tschofenig.priv.at",
      "ja": "Hannes Tschofenig Nokia Siemens Networks Linnoitustie 6 ESPOO 02600フィンランド電話：358（50）4871445メール：hannes.tschofenig@gmx.net URI：http://www.tschofenig.priv.priv.t"
    },
    {
      "indent": 3,
      "text": "Barbara Stark AT&T 725 W Peachtree St, NE Atlanta, GA 30308 USA Phone: +1 404 499 7026 EMail: barbara.stark@att.com",
      "ja": "Barbara Stark AT＆T 725 W Peachtree St、NE Atlanta、GA 30308 USA電話：1 404 499 7026メール：barbara.stark@att.com"
    },
    {
      "indent": 3,
      "text": "Andres Kuett Skype EMail: andres.kytt@skype.net",
      "ja": "Andres Kuett Skypeメール：andres.kytt@skype.net"
    }
  ]
}