{
  "title": {
    "text": "RFC 6789 - Congestion Exposure (ConEx) Concepts and Use Cases",
    "ja": "RFC 6789 - 輻輳露出（コーネックス）の概念とユースケース"
  },
  "number": 6789,
  "created_at": "2019-10-31 00:31:58.101586+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                   B. Briscoe, Ed.\nRequest for Comments: 6789                                            BT\nCategory: Informational                                   R. Woundy, Ed.\nISSN: 2070-1721                                                  Comcast\n                                                          A. Cooper, Ed.\n                                                                     CDT\n                                                           December 2012",
      "raw": true
    },
    {
      "indent": 11,
      "text": "Congestion Exposure (ConEx) Concepts and Use Cases",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document provides the entry point to the set of documentation about the Congestion Exposure (ConEx) protocol. It explains the motivation for including a ConEx marking at the IP layer: to expose information about congestion to network nodes. Although such information may have a number of uses, this document focuses on how the information communicated by the ConEx marking can serve as the basis for significantly more efficient and effective traffic management than what exists on the Internet today.",
      "ja": "この文書は、輻輳露光（CONEX）プロトコルに関するドキュメントのセットへのエントリポイントを提供します。ネットワーク・ノードへの渋滞情報を公開する：これは、IP層でのマーキングコーネックスを含むための動機を説明します。そのような情報は、多くの用途を持っているかもしれないが、この文書では、マーキングコーネックスによって伝達された情報は、今日、インターネット上に存在するものよりもはるかに効率的かつ効果的なトラフィック管理のための基礎として役立つことができる方法に焦点を当てています。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 IESGによって承認されていないすべての文書がインターネットStandardのどんなレベルの候補です。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6789.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6789で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2012 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2012 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  2\n2.  Concepts . . . . . . . . . . . . . . . . . . . . . . . . . . .  5\n  2.1.  Congestion . . . . . . . . . . . . . . . . . . . . . . . .  5\n  2.2.  Congestion-Volume  . . . . . . . . . . . . . . . . . . . .  5\n  2.3.  Rest-of-Path Congestion  . . . . . . . . . . . . . . . . .  6\n  2.4.  Definitions  . . . . . . . . . . . . . . . . . . . . . . .  6\n3.  Core Use Case: Informing Traffic Management  . . . . . . . . .  7\n  3.1.  Use Case Description . . . . . . . . . . . . . . . . . . .  7\n  3.2.  Additional Benefits  . . . . . . . . . . . . . . . . . . .  9\n  3.3.  Comparison with Existing Approaches  . . . . . . . . . . .  9\n4.  Other Use Cases  . . . . . . . . . . . . . . . . . . . . . . . 11\n5.  Deployment Arrangements  . . . . . . . . . . . . . . . . . . . 12\n6.  Experimental Considerations  . . . . . . . . . . . . . . . . . 13\n7.  Security Considerations  . . . . . . . . . . . . . . . . . . . 14\n8.  Acknowledgments  . . . . . . . . . . . . . . . . . . . . . . . 14\n9.  Contributors . . . . . . . . . . . . . . . . . . . . . . . . . 15\n10. Informative References . . . . . . . . . . . . . . . . . . . . 15",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The power of Internet technology comes from multiplexing shared capacity with packets rather than circuits. Network operators aim to provide sufficient shared capacity, but when too much packet load meets too little shared capacity, congestion results. Congestion appears as either increased delay, dropped packets, or packets explicitly marked with Explicit Congestion Notification (ECN) markings [RFC3168]. As described in Figure 1, congestion control currently relies on the transport receiver detecting these 'Congestion Signals' and informing the transport sender in 'Congestion Feedback Signals'. The sender is then expected to reduce its rate in response.",
      "ja": "インターネット技術の力は、パケットではなく、回路を備えた多重共有能力から来ています。ネットワークオペレータは、十分な共有能力を提供することを目指し、あまりにも多くのパケット負荷が少なすぎる共有容量、混雑結果を満たしたとき。輻輳が増加したいずれかの遅延として表示され、パケット、または明示的に明示的輻輳通知（ECN）のマーキング[RFC3168]でマークされたパケットを落としました。図1で説明したように、輻輳制御は、現在、これらの「輻輳信号を」検出および「輻輳フィードバック信号」で搬送を送信者に知らせる搬送受信機に依存しています。送信者は、その後応答して、その速度を低下させると予想されます。"
    },
    {
      "indent": 3,
      "text": "This document provides the entry point to the set of documentation about the Congestion Exposure (ConEx) protocol. It focuses on the motivation for including a ConEx marking at the IP layer. (A companion document, [CONEX-ABS], focuses on the mechanics of the protocol.) Briefly, the idea is for the sender to continually signal expected congestion in the headers of any data it sends. To a first approximation, the sender does this by relaying the 'Congestion Feedback Signals' back into the IP layer. They then travel unchanged across the network to the receiver (shown as 'IP-Layer-ConEx-Signals' in Figure 1). This enables IP-layer devices on the path to see information about the whole-path congestion.",
      "ja": "この文書は、輻輳露光（CONEX）プロトコルに関するドキュメントのセットへのエントリポイントを提供します。これは、IP層でのマーキングコーネックスを含むためのモチベーションに焦点を当てています。 （コンパニオン文書は、[CONEX-ABS]は、プロトコルの仕組みに焦点を当てています。）送信者は継続的にそれが送るすべてのデータのヘッダで予想される混雑を合図するために簡単に言えば、アイデアがあります。最初の近似として、送信者がバックIP層に「輻輳フィードバック信号」を中継することによってこれを行います。次いで、それらを（図1の「IP-レイヤCONEX-信号」として示される）受信機にネットワークを介して不変移動します。これは、全体のパスの輻輳に関する情報を表示するために、パス上のIP層のデバイスを可能にします。"
    },
    {
      "indent": 3,
      "text": ",---------.                                               ,---------.\n|Transport|                                               |Transport|\n| Sender  |   .                                           |Receiver |\n|         |  /|___________________________________________|         |\n|     ,-<---------------Congestion-Feedback-Signals--<--------.     |\n|     |   |/                                              |   |     |\n|     |   |\\           Transport Layer Feedback Flow      |   |     |\n|     |   | \\  ___________________________________________|   |     |\n|     |   |  \\|                                           |   |     |\n|     |   |   '         ,-----------.               .     |   |     |\n|     |   |_____________|           |_______________|\\    |   |     |\n|     |   |    IP Layer |           |  Data Flow      \\   |   |     |\n|     |   |             |(Congested)|                  \\  |   |     |\n|     |   |             |  Network  |--Congestion-Signals--->-'     |\n|     |   |             |  Device   |                    \\|         |\n|     |   |             |           |                    /|         |\n|     `----------->--(new)-IP-Layer-ConEx-Signals-------->|         |\n|         |             |           |                  /  |         |\n|         |_____________|           |_______________  /   |         |\n|         |             |           |               |/    |         |\n`---------'             `-----------'               '     `---------'",
      "raw": true
    },
    {
      "indent": 9,
      "text": "Figure 1: The ConEx Protocol in the Internet Architecture",
      "ja": "図1：インターネットアーキテクチャにおけるコーネックスプロトコル"
    },
    {
      "indent": 3,
      "text": "One of the key benefits of exposing this congestion information at the IP layer is that it makes the information available to network operators for use as input into their traffic management procedures. A ConEx-enabled sender signals expected whole-path congestion, which is approximately the congestion at least a round-trip time earlier as reported by the receiver to the sender (Figure 1). The ConEx signal is a mark in the IP header that is easy for any IP device to read. Therefore, a node performing traffic management can count congestion as easily as it might count data volume today by simply counting the volume of packets with ConEx markings.",
      "ja": "IP層で、この渋滞情報をさらすの主な利点の一つは、それが彼らのトラフィック管理手順への入力として使用するためのネットワークオペレータへの情報が利用できるようにするということです。 CONEX対応の送信元信号は、送信者（図1）に受信機によって報告されたように、往復時間以前約少なくとも輻輳ある全経路の混雑を、期待します。コーネックス信号は、任意のIPデバイスが読み取ることは容易であるIPヘッダ内のマークです。そのため、トラフィック管理を行うノードは、同じように簡単、それは単にコネックスマーキングパケットの量をカウントすることにより、今日のデータ量をカウントする可能性があるとして、輻輳をカウントすることができます。"
    },
    {
      "indent": 3,
      "text": "ConEx-based traffic management can make highly efficient use of capacity. In times of no congestion, all traffic management restraints can be removed, leaving the network's full capacity available to all its users. If some users on the network cause disproportionate congestion, the traffic management function can learn about this and directly limit those users' traffic in order to protect the service of other users sharing the same capacity. ConEx-based traffic management thus presents a step change in terms of the options available to network operators for managing traffic on their networks.",
      "ja": "CONEXベースのトラフィック管理は、能力の高効率利用することができます。無混雑の時代には、すべてのトラフィック管理の制約は、すべてのユーザーが利用できるネットワークの全容量を残して除去することができます。ネットワーク上の一部のユーザーが不均衡な渋滞を引き起こした場合は、トラフィック管理機能はこれについて学び、直接同じ容量を共有する他のユーザーのサービスを保護するために、これらのユーザのトラフィックを制限することができます。 CONEXベースのトラフィック管理は、このように自社のネットワーク上のトラフィックを管理するためのネットワークオペレータが利用できるオプションの観点からの段階的変化を示しています。"
    },
    {
      "indent": 3,
      "text": "The remainder of this document explains the concepts behind ConEx and how exposing congestion can significantly improve Internet traffic management, among other benefits. Section 2 introduces a number of concepts that are fundamental to understanding how ConEx-based traffic management works. Section 3 shows how ConEx can be used for traffic management, discusses additional benefits from such usage, and compares ConEx-based traffic management to existing traffic management approaches. Section 4 discusses other related use cases. Section 5 briefly discusses deployment arrangements. Section 6 suggests open issues that experiments in the use of ConEx could usefully be designed to answer. The final sections are standard RFC back matter.",
      "ja": "このドキュメントの残りの部分は、コーネックスの背景にある概念を説明し、どのように輻輳を暴露して大幅に他の利点の中で、インターネットのトラフィック管理を向上させることができます。第2章では、コーネックスベースのトラフィック管理がどのように機能するかを理解するための基礎となる概念の数を紹介します。第3節では、コーネックスは、トラフィック管理のために使用することができる方法を示し、そのような使い方から、追加の利点について説明し、既存のトラフィック管理手法にCONEXベースのトラフィック管理を比較します。第4節では、その他の関連するユースケースについて説明します。第5節で簡単に展開取り決めについて説明します。第6節は、コーネックスの使用での実験が有効に答えるように設計することができるオープンな問題を示唆しています。最後のセクションでは、標準のRFCバック問題です。"
    },
    {
      "indent": 3,
      "text": "The remainder of the core ConEx document suite consists of:",
      "ja": "コアCONEXドキュメントスイートの残りの構成要素は："
    },
    {
      "indent": 6,
      "text": "[CONEX-ABS], which provides an abstract encoding of ConEx signals, explains the ConEx audit and security mechanisms, and describes incremental deployment features;",
      "ja": "CONEX信号の抽象符号化を提供する[CONEX-ABS]は、コーネックス監査およびセキュリティメカニズムを説明し、そして増分展開機能について説明します。"
    },
    {
      "indent": 6,
      "text": "[CONEX-DESTOPT], which specifies the IPv6 destination option encoding for ConEx;",
      "ja": "コーネックスのIPv6宛先オプションのエンコーディングを指定する[CONEX-DESTOPT]。"
    },
    {
      "indent": 6,
      "text": "[TCP-MOD], which specifies TCP-sender modifications for use of ConEx;",
      "ja": "[TCP-MOD]、コーネックスの使用のためのTCP送信者の変更を指定します。"
    },
    {
      "indent": 6,
      "text": "and the following documents, which describe some feasible scenarios for deploying ConEx:",
      "ja": "コーネックスを展開するためのいくつかの可能なシナリオについて説明し、次のドキュメント："
    },
    {
      "indent": 9,
      "text": "[CONEX-DEPLOY], which describes a scenario around a fixed broadband access network;",
      "ja": "固定ブロードバンドアクセスネットワークの周りシナリオを説明[CONEX-DEPLOY]。"
    },
    {
      "indent": 9,
      "text": "[CONEX-MOBILE], which describes a scenario around a mobile communications provider;",
      "ja": "モバイル通信プロバイダの周りシナリオを説明[CONEX-MOBILE]。"
    },
    {
      "indent": 9,
      "text": "[CONEX-DATA], which describes how ConEx could be used for performance isolation between tenants of a data centre.",
      "ja": "[CONEX-DATA]、コーネックスは、データセンターのテナントとの間で性能分離に使用することができる方法を記載しています。"
    },
    {
      "indent": 0,
      "text": "2. Concepts",
      "section_title": true,
      "ja": "2.概念"
    },
    {
      "indent": 3,
      "text": "ConEx relies on a precise definition of congestion and a number of newer concepts that are introduced in this section. Definitions are summarized in Section 2.4.",
      "ja": "コーネックスは、輻輳の正確な定義と、このセクションで導入される新しい概念の数に依存しています。定義は2.4節にまとめられています。"
    },
    {
      "indent": 0,
      "text": "2.1. Congestion",
      "section_title": true,
      "ja": "2.1. 混雑"
    },
    {
      "indent": 3,
      "text": "Despite its central role in network control and management, congestion is a remarkably difficult concept to define. Experts in different disciplines and with different perspectives define congestion in a variety of ways [Bauer09].",
      "ja": "ネットワーク制御および管理におけるその中心的な役割にもかかわらず、輻輳が定義するための非常に困難な概念です。さまざまな分野で、異なる視点を有する専門家は、方法[Bauer09】種々の輻輳を定義します。"
    },
    {
      "indent": 3,
      "text": "The definition used for the purposes of ConEx is expressed as the probability of packet loss (or the probability of packet marking if ECN is in use). This definition focuses on how congestion is measured, rather than describing congestion as a condition or state.",
      "ja": "コーネックスの目的のために使用される定義は、パケット損失の確率（またはパケットの確率ECNが使用中である場合にマーキング）として表現されます。この定義は、むしろ条件または状態として渋滞を記述するよりも、輻輳を測定する方法に焦点を当てています。"
    },
    {
      "indent": 0,
      "text": "2.2. Congestion-Volume",
      "section_title": true,
      "ja": "2.2. 渋滞ボリューム"
    },
    {
      "indent": 3,
      "text": "The metric that ConEx exposes is congestion-volume: the volume of bytes dropped or ECN-marked in a given period of time. Counting congestion-volume allows each user to be held responsible for his or her contribution to congestion. Congestion-volume can only be a property of traffic, whereas congestion can be a property of traffic or a property of a link or a path.",
      "ja": "コーネックスが公開するメトリックが混雑-ボリュームです：バイトのボリュームが落ちたり、所定の期間にECN-マーク。混雑ボリュームを数えること、各ユーザーが輻輳に彼または彼女の貢献のために責任を負うことを可能にします。輻輳トラフィックのプロパティまたはリンクの特性または経路とすることができるのに対し、輻輳ボリュームのみ、トラフィックの性質であることができます。"
    },
    {
      "indent": 3,
      "text": "To understand congestion-volume, consider a simple example. Imagine Alice sends 1 GB of a file while the loss-probability is a constant 0.2%. Her contribution to congestion -- her congestion-volume -- is 1 GB x 0.2% = 2 MB. If she then sends another 3 GB of the file while the loss-probability is 0.1%, this adds 3 MB to her congestion-volume. Her total contribution to congestion is then 2 MB + 3 MB = 5 MB.",
      "ja": "混雑ボリュームを理解するために、簡単な例を考えてみましょう。損失確率が一定で0.2％であるアリスは、ファイルが1 GBを送信想像。混雑に彼女の貢献 - 彼女の輻輳体積は -  1ギガバイトX 0.2％= 2 MBです。損失確率は0.1％である一方で、彼女はその後、ファイルの別の3ギガバイトを送信した場合、これは彼女の混雑-ボリュームに3メガバイトを追加します。混雑に彼女の総寄与は次いで、2メガバイト+ 3メガバイト= 5 MBです。"
    },
    {
      "indent": 3,
      "text": "Fortunately, measuring Alice's congestion-volume on a real network does not require the kind of arithmetic shown above, because congestion-volume can be directly measured by counting the total volume of Alice's traffic that gets discarded or ECN-marked. (A queue with varying percentage loss does these multiplications and additions inherently.) With ConEx, network operators can count congestion-volume using techniques very similar to those they use for counting volume.",
      "ja": "混雑ボリュームが直接破棄またはECN-マークされますアリスのトラフィックの総量をカウントすることによって測定することができるので、幸いなことに、実際のネットワーク上のアリスの混雑体積を測定することは、上記示した演算の種類を必要としません。 （損失割合を変化させたキューは、本質的にこれらの乗算と加算を行います。）コーネックスを使用すると、ネットワークオペレータは、彼らがボリュームをカウントするために使用したものと非常に類似した技術を使用して、混雑のボリュームをカウントすることができます。"
    },
    {
      "indent": 0,
      "text": "2.3. Rest-of-Path Congestion",
      "section_title": true,
      "ja": "2.3. 残り-のパス輻輳"
    },
    {
      "indent": 3,
      "text": "At a particular measurement point within a network, \"rest-of-path congestion\" (also known as \"downstream congestion\") is the level of congestion that a traffic flow is expected to experience between the measurement point and its final destination. \"Upstream congestion\" is the congestion experienced up to the measurement point.",
      "ja": "ネットワーク内の特定の測定点で、（また、「下流輻輳」として知られている）、「静止のパス渋滞」はトラフィックフローが測定点と最終目的地との間で発生すると予想されること輻輳のレベルです。 「上流渋滞は、」測定ポイントまでの経験混雑です。"
    },
    {
      "indent": 3,
      "text": "If traffic is ECN-capable, ECN signals monitored in the middle of a network will indicate the congestion experienced so far on the path (upstream congestion). In contrast, the ConEx signals inserted into IP headers as shown in Figure 1 indicate the congestion along a whole path from transport source to transport destination. Therefore, if a measurement point detects both of these signals, it can subtract the level of ECN (upstream congestion) from the level of ConEx (whole path) to derive a measure of the congestion that packets are likely to experience between the monitoring point and their destination (rest-of-path congestion). A measurement point can calculate this measurement in the aggregate, across all flows.",
      "ja": "トラフィックがECN-可能である場合、輻輳を示すことになるネットワークの中央で監視ECN信号は、これまでのパス（アップストリーム輻輳）に経験しました。対照的に、図1に示すように、IPヘッダに挿入コーネックス信号は、先に搬送するように搬送元から全経路に沿って輻輳を示します。測定点は、これらの信号の両方を検出した場合、したがって、それは、パケットが監視ポイントとの間で発生する可能性がある輻輳の測度を導出するためにコーネックス（全パス）のレベルからECN（上流の輻輳）のレベルを差し引くことができその先（残り-のパス輻輳）。測定点は、すべてのフローを横切って、骨材でこの測定を計算することができます。"
    },
    {
      "indent": 3,
      "text": "A network monitor can usually accurately measure upstream congestion only if the traffic it observes is ECN-capable. [CONEX-ABS] further discusses the constraints around the network's ability to measure upstream and rest-of-path congestion in these circumstances. However, there are a number of initial deployment arrangements that benefit from ConEx but work without ECN (see Section 5).",
      "ja": "ネットワークモニタは、通常、正確にそれが観察トラフィックがECN対応である場合にのみ、上流の輻輳を測定することができます。 [CONEX-ABS]はさらに上流測定し、休息・オブ・パスの輻輳をこのような状況にするためのネットワークの能力の周りに制約を説明します。しかし、ECNずにコーネックスが、仕事の恩恵を受ける初期導入構成の数があります（第5章を参照してください）。"
    },
    {
      "indent": 0,
      "text": "2.4. Definitions",
      "section_title": true,
      "ja": "2.4. 定義"
    },
    {
      "indent": 3,
      "text": "Congestion: In general, congestion occurs when any user's traffic suffers loss, ECN marking, or increased delay as a result of one or more network resources becoming overloaded. For the purposes of ConEx, congestion is measured using the concrete signals provided by loss and ECN markings (delay is not considered). Congestion is measured as the probability of loss or the probability of ECN marking, usually expressed as a dimensionless percentage.",
      "ja": "混雑は：任意のユーザーのトラフィックが損失、ECNマーキング、または過負荷になる1つまたは複数のネットワーク・リソースの結果として増加した遅延を被ったときに一般的には、輻輳が発生します。コーネックスの目的のために、輻輳が損失及びECNマーキング（遅延が考慮されていない）によって提供される具体的な信号を使用して測定されます。輻輳は、通常、無次元パーセンテージとして表さ損失の確率又はマーキングECNの確率として測定されます。"
    },
    {
      "indent": 3,
      "text": "Congestion-volume: For any granularity of traffic (packet, flow, aggregate, link, etc.), the volume of bytes dropped or ECN-marked in a given period of time. Conceptually, data volume multiplied by the congestion each packet of the volume experienced. This is usually expressed in bytes (or kB, MB, etc.).",
      "ja": "輻輳体積：トラフィック（パケット、フロー、集計、リンク、等）の任意の細分性のために、バイトの容量が削除または所与の期間にECNは、マークされました。概念的には、データボリュームは、ボリュームの各パケットが経験した輻輳を掛けました。これは通常、バイト（またはキロバイト、メガバイトなど）で表現されます。"
    },
    {
      "indent": 3,
      "text": "Congestion policer: A logical entity that allows a network operator to monitor each user's congestion-volume and enforce congestion-volume limits (discussed in Section 3.1).",
      "ja": "輻輳ポリサー：ネットワークオペレータは、各ユーザの輻輳量を監視し（セクション3.1で議論する）輻輳ボリューム制限を実施することを可能にする論理エンティティ。"
    },
    {
      "indent": 3,
      "text": "Rest-of-path congestion (or downstream congestion): The congestion a flow of traffic is expected to experience on the remainder of its path. In other words, at a measurement point in the network, the rest-of-path congestion is the congestion the traffic flow has yet to experience as it travels from that point to the receiver. Upstream congestion is usually expressed as a dimensionless percentage.",
      "ja": "静止のパス輻輳（または下流混雑）：輻輳トラフィックの流れは、その経路の残りの部分に発生すると予想されます。換言すれば、ネットワーク内の計測点で、静止のパスの輻輳は、トラフィックフローが、それはその時点から受信機まで移動するように体験してまだ渋滞です。上流の混雑は通常、無次元パーセンテージで表されます。"
    },
    {
      "indent": 3,
      "text": "Upstream congestion: The accumulated congestion experienced by a traffic flow thus far, relative to a point along its path. In other words, at a measurement point in the network, the upstream congestion is the accumulated congestion the traffic flow has experienced as it travels from the sender to that point. At the receiver, this is equivalent to the end-to-end congestion level that (usually) is reported back to the sender. This is usually expressed as a dimensionless percentage.",
      "ja": "上流の混雑：これまでのトラフィックフローが経験蓄積渋滞、そのパスに沿った点からの相対。換言すれば、ネットワーク内の測定点において、上流の輻輳は、それがその時点まで送信者から移動するトラフィックフローが経験した累積渋滞です。受信機において、これは、（通常は）送信者に報告されているエンドツーエンドの輻輳レベルに相当します。これは通常、無次元パーセンテージで表されます。"
    },
    {
      "indent": 3,
      "text": "Network operator (or provider): Operator of a residential, commercial, enterprise, campus, or other network.",
      "ja": "ネットワークオペレータ（またはプロバイダ）：住宅、商業、企業、キャンパス、または他のネットワークのオペレータ。"
    },
    {
      "indent": 3,
      "text": "User: The contractual entity that represents an individual, household, business, or institution that uses the service of a network operator. There is no implication that the contract has to be commercial; for instance, the users of a university or enterprise network service could be students or employees who do not pay for access, but may be required to comply with some form of contract or acceptable use policy. There is also no implication that every user is an end user. Where two networks form a customer-provider relationship, the term \"user\" applies to the customer network.",
      "ja": "ユーザー：ネットワークオペレータのサービスを利用する個人、家庭、ビジネス、または機関を表し契約エンティティ。契約は、商用でなければなら何の意味はありません。例えば、大学や企業のネットワークサービスのユーザーは、アクセスのために払っていない学生や従業員のかもしれないが、契約または利用規定のいくつかの形式に準拠する必要があります。すべてのユーザーが、エンドユーザーであるという意味合いもありません。 2つのネットワークは、顧客プロバイダの関係を形成する場合は、「ユーザ」という用語は、顧客のネットワークに適用されます。"
    },
    {
      "indent": 3,
      "text": "[CONEX-ABS] gives further definitions for aspects of ConEx related to protocol mechanisms.",
      "ja": "[CONEX-ABS]はプロトコルメカニズムに関連するコーネックスの態様についてさらに定義を与えます。"
    },
    {
      "indent": 0,
      "text": "3. Core Use Case: Informing Traffic Management",
      "section_title": true,
      "ja": "3.コアユースケース：トラフィック管理を知らせます"
    },
    {
      "indent": 3,
      "text": "This section explains how ConEx could be used as the basis for traffic management, highlights additional benefits derived from having ConEx-aware nodes on the network, and compares ConEx-based traffic management to existing approaches.",
      "ja": "このセクションでは、コーネックスは、トラフィック管理のための基礎として使用することができる方法を説明し、ネットワーク上のCONEX認識ノードを有する由来付加的な利点を強調し、既存のアプローチにCONEXベースのトラフィック管理を比較します。"
    },
    {
      "indent": 0,
      "text": "3.1. Use Case Description",
      "section_title": true,
      "ja": "3.1. ケースの説明を使用します"
    },
    {
      "indent": 3,
      "text": "One of the key benefits that ConEx can deliver is in helping network operators to improve how they manage traffic on their networks. Consider the common case of a commercial broadband network where a relatively small number of users place disproportionate demand on network resources, at times resulting in congestion. The network operator seeks a way to manage traffic such that the traffic that contributes more to congestion bears more of the brunt of the management.",
      "ja": "コーネックスが提供できる主な利点の1つは、自社のネットワーク上のトラフィックを管理する方法を改善するために、ネットワークオペレータを支援しています。ユーザーの数が比較的少ないが、混雑が生じた時間に、ネットワークリソース上の不均衡な需要を置く商業用ブロードバンドネットワークの一般的なケースを考えてみましょう。ネットワークオペレータは、混雑に多くを貢献したトラフィック管理の矛先の多くを負担するようなトラフィックを管理する方法を求めています。"
    },
    {
      "indent": 3,
      "text": "Assuming ConEx signals are visible at the IP layer, the network operator can accomplish this by placing a congestion policer at an enforcement point within the network and configuring it with a traffic management policy that monitors each user's contribution to congestion. As described in [CONEX-ABS] and elaborated in [CongPol], one way to implement a congestion policer is in a similar way to a bit-rate policer, except that it monitors congestion-volume (based on IP-layer ConEx signals) rather than bit rate. When implemented as a token bucket, the tokens provide users with the right to cause bits of congestion-volume, rather than to send bits of data volume. The fill rate represents each user's congestion-volume quota.",
      "ja": "CONEX信号がIPレイヤで表示されていると仮定すると、ネットワークオペレータは、ネットワーク内の実施ポイントで輻輳ポリサーを配置し、輻輳に対する各ユーザの寄与を監視トラフィック管理ポリシーとそれを構成することによって、これを達成することができます。 [CONEX-ABS]に記載の[CongPol]に詳述されるように、それは（IP層コーネックス信号に基づいて）輻輳量を監視する以外は、輻輳ポリサーを実装する1つの方法は、ビットレートポリサーと同様ですむしろ、ビットレートより。トークンバケットとして実装されている場合は、トークンは混雑ボリュームのビットを発生させるのではなく、データ量のビットを送信する権利をユーザーに提供します。フィルレートは、各ユーザーの輻輳ボリュームのクォータを表します。"
    },
    {
      "indent": 3,
      "text": "The congestion policer monitors the ConEx signals of the traffic entering the network. As long as the network remains uncongested and users stay within their quotas, no action is taken. When the network becomes congested and a user exhausts his quota, some action is taken against the traffic that breached the quota in accordance with the network operator's traffic management policy. For example, the traffic may be dropped, delayed, or marked with a lower QoS class. In this way, traffic is managed according to its contribution to congestion -- not some application- or flow-specific policy -- and is not managed at all during times of no congestion.",
      "ja": "混雑ポリサーは、ネットワークに入るトラフィックのコーネックス信号を監視します。限り、ネットワークが輻輳していないままで、ユーザーが自分のクォータ内にとどまるように、何も起こりません。ネットワークが混雑し、ユーザーが自分のクォータを排出する場合、いくつかのアクションは、ネットワークオペレータのトラフィック管理ポリシーに従ってクォータに違反したトラフィックに対して取られます。例えば、トラフィックは、ドロップ遅れ、またはより低いQoSクラスでマークすることができます。ていないいくつかの用途向けまたはフロー固有のポリシー -   - このように、トラフィックが混雑への貢献に応じて管理されていないと輻輳時には全く管理されていません。"
    },
    {
      "indent": 3,
      "text": "As an example of how a network operator might employ a ConEx-based traffic management system, consider a typical DSL network architecture (as elaborated in [TR-059] and [TR-101]). Traffic is routed from regional and global IP networks to an operator-controlled IP node, the Broadband Remote Access Server (BRAS). From the BRAS, traffic is delivered to access nodes. The BRAS carries enhanced functionality, including IP QoS and traffic management capabilities.",
      "ja": "ネットワークオペレータは、（[TR-059]に詳述されるように[TR-101]）、コーネックスベースのトラフィック管理システムを採用し、典型的なDSLネットワークアーキテクチャを検討するかもしれない方法の例として。トラフィックは、ブロードバンドリモートアクセスサーバ（BRAS）、オペレータ制御IPノードに地域およびグローバルIPネットワークから転送されます。 BRASからは、トラフィックがアクセス・ノードに配信されます。 BRASは、IP QoSおよびトラフィック管理機能を含む、強化された機能を、運びます。"
    },
    {
      "indent": 3,
      "text": "By deploying a congestion policer at the BRAS location, the network operator can measure the congestion-volume created by users within the access nodes and police misbehaving users before their traffic affects others on the access network. The policer would be provisioned with a traffic management policy, perhaps directing the BRAS to drop packets from users that exceed their congestion-volume quotas during times of congestion. Those users' apps would be likely to react in the typical way to drops, backing off (assuming at least some use TCP), and thereby lowering the users' congestion-volumes back within the quota limits. If none of a user's apps responds, the policer would continue to increase focused drops and effectively enforce its own congestion control.",
      "ja": "そのトラフィックは、アクセスネットワーク上の他の人に影響を与える前に、BRASの場所で渋滞ポリサーを展開することによって、ネットワークオペレータは、ユーザーを不正な動作アクセスノードと警察内のユーザーが作成した混雑体積を測定することができます。ポリサーは、おそらく輻輳時にその渋滞ボリュームのクォータを超えて、ユーザーからのパケットをドロップするようにBRASを向ける、トラフィック管理ポリシーをプロビジョニングすることでしょう。それらのユーザーバッククォータ制限内輻輳ボリュームのアプリケーションはバックオフ（少なくともいくつかの使用TCPを想定）、およびそれによってユーザ低下、液滴の典型的な方法で反応する可能性が高いであろうと。ユーザーのアプリのどれも応答しない場合、ポリサーは、集束滴を高め、効果的に、自身の輻輳制御を強化していきます。"
    },
    {
      "indent": 0,
      "text": "3.2. Additional Benefits",
      "section_title": true,
      "ja": "3.2. その他の利点"
    },
    {
      "indent": 3,
      "text": "The ConEx-based approach to traffic management has a number of benefits in addition to efficient management of traffic. It provides incentives for users to make use of \"scavenger\" transport protocols, such as the Low Extra Delay Background Transport [LEDBAT], that provide ways for bulk-transfer applications to rapidly yield when interactive applications require capacity (thereby \"scavenging\" remaining bandwidth). With a congestion policer in place as described in Section 3.1, users of these protocols will be less likely to run afoul of the network operator's traffic management policy than those whose bulk-transfer applications generate the same volume of traffic without being sensitive to congestion. In short, two users who produce similar traffic volumes over the same time interval may produce different congestion-volumes if one of them is using a scavenger transport protocol and the other is not; in that situation, the scavenger user's traffic is less likely to be managed by the network operator.",
      "ja": "トラフィック管理にコーネックスベースのアプローチは、トラフィックの効率的な管理に加えて、多くの利点を持っています。これにより、ユーザーは、対話型アプリケーションが必要とするときに迅速に容量を生成するバルク転送アプリケーション用の方法を提供し、このような低余分な遅延の背景トランスポートとして「スカベンジャー」トランスポートプロトコル、[LEDBAT]、（それによって「捕捉」残りの帯域幅を利用するためのインセンティブを提供します）。 3.1節で述べたような場所での渋滞ポリサーでは、これらのプロトコルのユーザーが抵触ネットワークオペレータのトラフィック管理ポリシーのそのバルク転送アプリケーション混雑に敏感されることなく、トラフィックの同じ量を生成するよりも実行しにくくなります。それらの一つはスカベンジャートランスポートプロトコルを使用して、他のではない場合要するに、同一の時間間隔で同様のトラフィック量を生成する2人のユーザが異なる輻輳ボリュームを生成することができます。そのような状況では、スカベンジャーユーザーのトラフィックは、ネットワークオペレータによって管理されにくくなります。"
    },
    {
      "indent": 3,
      "text": "ConEx-based traffic management also makes it possible for a user to control the relative performance among its own traffic flows. If a user wants some flows to have more bandwidth than others, it can reduce the rate of some traffic so that it consumes less congestion-volume \"budget\", leaving more congestion-volume \"budget\" for the user to \"spend\" on making other traffic go faster. This approach is most relevant if congestion is signalled by ECN, because no impairment due to loss is involved and delay can remain low.",
      "ja": "CONEXベースのトラフィック管理は、独自のトラフィックフロー間の相対的なパフォーマンスを制御するためのユーザのためにそれを可能にします。ユーザーは、いくつかのフローが他よりも多くの帯域幅を持っているしたい場合は、それは作ることに「費やす」するユーザーのためのより多くの混雑ボリューム「予算」を残して、あまり混雑ボリューム「予算」を消費するように、それはいくつかのトラフィックの割合を減らすことができます他のトラフィックはより速く行きます。輻輳がECNによって通知された場合に起因する損失に減損が関与していないと遅延が低く保つことができるので、このアプローチは、最も関連性があります。"
    },
    {
      "indent": 0,
      "text": "3.3. Comparison with Existing Approaches",
      "section_title": true,
      "ja": "3.3. 既存のアプローチとの比較"
    },
    {
      "indent": 3,
      "text": "A variety of approaches already exist for network operators to manage congestion, traffic, and the disproportionate usage of scarce capacity by a small number of users. Common approaches can be categorized as rate-based, volume-based, or application-based.",
      "ja": "ネットワークオペレータは渋滞、交通、及び少数のユーザによる希少容量の不均衡な使用を管理するための種々のアプローチは既に存在します。一般的なアプローチは、レートベース、容量ベース、またはアプリケーションベースとして分類することができます。"
    },
    {
      "indent": 3,
      "text": "Rate-based approaches constrain the traffic rate per user or per network. A user's peak and average (or \"committed\") rate may be limited. These approaches have the potential to either over- or under-constrain the network, suppressing rates even when the network is uncongested or not suppressing them enough during heavy usage periods.",
      "ja": "レートベースのアプローチは、ユーザごと、またはネットワークごとにトラフィックレートを制限します。ユーザーのピークと平均（または「コミット」）レートが制限される場合があります。これらのアプローチは、重い使用期間中に十分にそれらを抑制し、ネットワークが輻輳していない場合であっても、速度を抑えたりない、過剰発現またはいずれかのネットワークを過小制約する可能性があります。"
    },
    {
      "indent": 3,
      "text": "Round-robin scheduling and fair queuing were developed to address these problems. They equalize relative rates between active users (or flows) at a known bottleneck. The bit rate allocated to any one user depends on the number of active users at each instant. The drawback of these approaches is that they favor heavy users over light users over time, because they do not have any memory of usage.",
      "ja": "ラウンドロビンスケジューリングと公正なキューイングは、これらの問題に対処するために開発されました。彼らは、既知のボトルネックでのアクティブユーザー（またはフロー）との間の相対速度を等しく。いずれかのユーザに割り当てられたビットレートは、各瞬間におけるアクティブユーザの数に依存します。これらのアプローチの欠点は、使用の任意のメモリを持っていないので、彼らは、時間をかけてライトユーザー以上のヘビーユーザーを好むということです。"
    },
    {
      "indent": 3,
      "text": "These approaches share bit rate instant by instant; however, heavy users are active at every instant, whereas light users only occupy their share of the link occasionally.",
      "ja": "これらのアプローチは、インスタントでビットレートの瞬間を共有します。ライトユーザーがたまにしかリンクのシェアを占めているのに対し、しかし、ヘビーユーザーは、すべての瞬間にアクティブになっています。"
    },
    {
      "indent": 3,
      "text": "Volume-based approaches measure the overall volume of traffic a user sends (and/or receives) over time. Users may be subject to an absolute volume cap (for example, 10GB per month) or the \"heaviest\" users may be sanctioned in some other manner. Many providers use monthly volume limits, and count volume regardless of whether the network is congested or not, creating the potential for over- or under-constraining problems, as with the original rate-based approaches.",
      "ja": "ボリュームベースのアプローチは、ユーザが時間をかけて送信（及び/又は受信）トラフィックの全体的な量を測定します。ユーザは、（例えば、月あたり10ギガバイト）絶対量キャップまたは他の何らかの方法で認可されてもよい「重い」のユーザの対象であってもよいです。多くのプロバイダは、毎月のボリューム制限を使用し、元のレートベースのアプローチと同様に、オーバーまたはアンダー制約の問題の可能性を作成し、関係なく、ネットワークが混雑しているかどうかのボリュームを数えます。"
    },
    {
      "indent": 3,
      "text": "ConEx-based approaches, by comparison, only react during times of congestion and in proportion to each user's congestion contribution, making more efficient use of capacity and more proportionate management decisions.",
      "ja": "CONEXベースのアプローチは、比較することによって、容量のみ、より比例経営上の意思決定をより効率的に利用して、輻輳時に、各ユーザーの混雑貢献に比例して反応します。"
    },
    {
      "indent": 3,
      "text": "Unlike ConEx-based approaches, neither rate-based nor volume-based approaches provide incentives for applications to use scavenger transport protocols. They may even penalize users of applications that employ scavenger transports for the large amount of volume they send, rather than rewarding them for carefully avoiding congestion while sending it. While the volume-based approach described in \"Comcast's Protocol-Agnostic Congestion Management System\" [RFC6057] aims to overcome the over-/under-constraining problem by only measuring volume and triggering traffic management action during periods of high utilization, it still does not provide incentives to use scavenger transports, because congestion-causing volume cannot be distinguished from volume overall. ConEx provides this ability.",
      "ja": "CONEXベースのアプローチとは異なり、レートベースでもボリュームベースのアプローチでもないが、スカベンジャートランスポートプロトコルを使用するアプリケーションのためのインセンティブを提供しています。彼らも、スカベンジャーが、彼らはむしろそれを送信しながら、慎重に混雑を避けるためにそれらに報酬を与えるよりも、送信量を多くするために輸送採用するアプリケーションのユーザーを罰することがあります。 「Comcastのプロトコルに依存しない輻輳管理システム」[RFC6057]で説明ボリュームベースのアプローチが唯一の体積を測定し、高い使用率の期間中にトラフィック管理アクションをトリガーすることにより、オーバー/アンダー制約の問題を克服することを目的とするが、それはまだありません輻輳の原因となるボリューム全体のボリュームから区別することができないので、スカベンジャートランスポートを使用するためのインセンティブを提供します。コーネックスは、この機能を提供します。"
    },
    {
      "indent": 3,
      "text": "Application-based approaches use deep packet inspection or other techniques to determine what application a given traffic flow is associated with. Network operators may then use this information to rate-limit or otherwise sanction certain applications, in some cases only during peak hours. These approaches suffer from being at odds with IPsec and some application-layer encryption, and they may raise additional policy concerns. In contrast, ConEx offers an application-agnostic metric to serve as the basis for traffic management decisions.",
      "ja": "アプリケーションベースのアプローチは、所与のトラフィックフローが関連付けられているどのアプリケーションを決定するためにディープパケットインスペクションまたは他の技術を使用します。ネットワークオペレータは、次いで、制限をレートまたはそうでなければのみピーク時いくつかのケースでは、特定のアプリケーションを制裁するためにこの情報を使用することができます。これらのアプローチは、IPsecと、いくつかのアプリケーション層の暗号化と対立している苦しむ、彼らは追加のポリシーの懸念を上げることができます。これとは対照的に、コーネックスは、トラフィック管理の意思決定の基礎として機能するアプリケーションに依存しないメトリックを提供しています。"
    },
    {
      "indent": 3,
      "text": "The existing types of approaches share a further limitation that ConEx can help to overcome: performance uncertainty. Flat-rate pricing plans are popular because users appreciate the certainty of having their monthly bill amount remain the same for each billing period, allowing them to plan their costs accordingly. But while flat-rate pricing avoids billing uncertainty, it creates performance uncertainty: users cannot know whether the performance of their connections is being altered or degraded based on how the network operator is attempting to manage congestion. By exposing congestion information at the IP layer, ConEx instead provides a metric that can serve as an open, transparent basis for traffic management policies that both providers and their customers can measure and verify. It can be used to reduce the performance uncertainty that some users currently experience, without having to sacrifice their billing certainty.",
      "ja": "パフォーマンスの不確実性：アプローチの既存のタイプは、コーネックスを克服するのに役立つことができ、さらに制限を共有しています。ユーザーは、彼らがそれに応じてコストを計画することができ、各請求期間に同じまま彼らの毎月の請求書の金額を持っていることの確実性を認めるため、定額料金プランが人気があります。フラットレート料金が課金不確実性を回避しながら、しかし、それはパフォーマンスの不確実性を作成します。ユーザーは、その接続のパフォーマンスは、ネットワークオペレータは、混雑を管理しようとしているかに基づいて変更または分解されているかどうかを知ることができません。 IP層での渋滞情報を暴露することにより、コーネックスは、代わりにプロバイダと顧客の両方を測定して確認することができ、トラフィック管理ポリシーのためのオープン、透明性の基礎として機能することができメトリックを提供します。彼らの課金確実性を犠牲にすることなく、一部のユーザーが現在経験していること、パフォーマンスの不確実性を低減するために使用することができます。"
    },
    {
      "indent": 0,
      "text": "4. Other Use Cases",
      "section_title": true,
      "ja": "4.その他のユースケース"
    },
    {
      "indent": 3,
      "text": "ConEx information can be put to a number of uses other than informing traffic management. These include:",
      "ja": "コネックス情報は、トラフィック管理を知らせる以外の使用回数に置くことができます。これらは、次のとおりです。"
    },
    {
      "indent": 3,
      "text": "Informing inter-operator contracts: ConEx information is made visible to every IP node, including border nodes between networks. Network operators can use ConEx combined with ECN markings to measure how much traffic from each network contributes to congestion in the other. As such, congestion-volume could be included as a metric in inter-operator contracts, just as volume or bit rate are included today. This would not be an initial deployment scenario, unless ECN became widely deployed.",
      "ja": "オペレータ間の契約を通知する：コーネックス情報は、ネットワークの境界ノードを含む、すべてのIPノードに可視化されます。ネットワークオペレータは、各ネットワークからのトラフィックの量は、他の中で渋滞にどのように寄与するかを測定するために、ECNマーキングと組み合わせたコーネックスを使用することができます。そのため、混雑ボリュームは、ボリュームまたはビットレートは今日含まれているのと同様に、オペレータ間の契約におけるメトリックとして含めることができます。 ECNが広く展開になった場合を除きこれは、初期の展開シナリオではないでしょう。"
    },
    {
      "indent": 3,
      "text": "Enabling more efficient capacity provisioning: Section 3.2 explains how operators can use ConEx-based traffic management to encourage use of scavenger transport protocols, which significantly improves the performance of interactive applications while still allowing heavy users to transfer high volumes. Here we explain how this can also benefit network operators.",
      "ja": "より効率的な容量のプロビジョニングを有効にする：3.2節は、事業者はまだヘビーユーザーが大量の転送を可能にしながら大幅にインタラクティブなアプリケーションのパフォーマンスを向上させスカベンジャートランスポートプロトコルの使用を奨励するためにコーネックスベースのトラフィック管理を使用する方法について説明します。ここでは、これはまた、ネットワークオペレータに利益をもたらすことができる方法を説明します。"
    },
    {
      "indent": 6,
      "text": "Today, when loss, delay, or average utilization exceeds a certain threshold, some operators just buy more capacity without attempting to manage the traffic. Other operators prefer to limit a minority of heavy users at peak times, but they still eventually buy more capacity when utilization rises.",
      "ja": "ロス、遅延、または平均利用率が一定のしきい値を超えたときに今日、一部の事業者は、単にトラフィックを管理しようとすることなく、より多くの容量を購入。他の事業者はピーク時にヘビーユーザーの少数派を制限することを好むが、使用率が上昇したとき、彼らはまだ最終的にはより多くの容量を購入します。"
    },
    {
      "indent": 6,
      "text": "With ConEx-based traffic management, a network operator should be able to provision capacity more efficiently. An operator could benefit from this in a variety of ways. For example, the operator could add capacity as it would do without ConEx, but deliver better quality of service for its users. Or, the operator could delay adding capacity while delivering similar quality of service to what it currently provides.",
      "ja": "CONEXベースのトラフィック管理では、ネットワークオペレータは、より効率的に提供容量にできるはずです。オペレータは、さまざまな方法でこのことから利益を得ることができます。例えば、オペレータは、コーネックスせずに行うように容量を追加しますが、そのユーザーに対するサービスの質の向上を提供できます。または、オペレータは、現在提供しているものにサービスの同様の品質を提供しながら、容量を追加遅らせることができます。"
    },
    {
      "indent": 0,
      "text": "5. Deployment Arrangements",
      "section_title": true,
      "ja": "5.展開アレンジメント"
    },
    {
      "indent": 3,
      "text": "ConEx is designed so that it can be incrementally deployed in the Internet and still be valuable for early adopters. As long as some senders are ConEx-enabled, a network on the path can unilaterally use ConEx-aware policy devices for traffic management; no changes to network forwarding elements are needed, and ConEx still works if there are other networks on the path that are unaware of ConEx marks.",
      "ja": "コーネックスは、それが漸増インターネットで展開することができるように設計されており、まだアーリーアダプターのための価値がされています。限り、いくつかの送信者がCONEX対応しているとして、パス上のネットワークが一方的にトラフィック管理のためのCONEX認識ポリシー・デバイスを使用することができます。転送ネットワーク要素への変更は必要ありませんされており、コーネックスマークに気づいていないパス上の他のネットワークがある場合、コーネックスはまだ動作なし。"
    },
    {
      "indent": 3,
      "text": "The above two steps seem to represent a stand-off where neither step is useful until the other has made the first move: i) some sending hosts must be modified to give information to the network, and ii) a network must deploy policy devices to monitor this information and act on it. Nonetheless, the developer of a scavenger transport protocol like LEDBAT does stand to benefit from deploying ConEx. In this case, the developer makes the first move, expecting it will prompt at least some networks to move in response, using the ConEx information to reward users of the scavenger transport protocol.",
      "ja": "I）のいくつかの送信ホストは、ネットワークに情報を提供するように修正されなければならない、及びii）ネットワークにポリシーデバイスを展開する必要があり：他は最初の移動をしたまでも工程が有用である場合、上記2つのステップは、スタンドオフを表すように見えますこの情報を監視し、それに基づいて行動。それにもかかわらず、LEDBATのようなスカベンジャートランスポートプロトコルの開発者は、コーネックスの展開から恩恵を受けるありません。この場合、開発者は、スカベンジャートランスポートプロトコルのユーザに報いるためにコーネックス情報を使用して、応答して移動するように、少なくともいくつかのネットワークが要求されます期待、最初の移動を行います。"
    },
    {
      "indent": 3,
      "text": "On the host side, we have already shown (Figure 1) how the sender piggy-backs ConEx signals on normal data packets to re-insert feedback about packet drops (and/or ECN) back into the IP layer. In the case of TCP, [TCP-MOD] proposes the required sender modifications. ConEx works with any TCP receiver as long as it uses SACK (selective acknowledgment), which most do. There is a receiver optimisation [TCPM-ECN] that improves ConEx precision when using ECN, but ConEx can still use ECN without it. Networks can make use of ConEx even if the implementations of some of the transport protocols on a host do not support ConEx (e.g., the implementation of DNS over UDP might not support ConEx, while perhaps RTP over UDP and TCP will).",
      "ja": "ホスト側では、我々はすでにバックIP層へのパケットに関する再挿入フィードバックに通常のデータパケットで送信者ピギーバックコーネックス信号が低下（および/またはECN）方法（図1）を示しています。 TCPの場合には、[TCP-MOD]は必要な送信者の変更を提案しています。それはほとんどがそうSACK（選択的確認応答）を、使用してコーネックスは、限り、任意のTCP受信機で動作します。そこECNを使用するときにコーネックス精度を向上させ、受信機の最適化[TCPM-ECN]はあるが、コーネックスはまだそれなしでECNを使用することができます。ネットワークは、ホスト上のトランスポートプロトコルの一部の実装では、コーネックスを（おそらくUDPおよびTCP上のRTPがしますが、例えば、UDP上のDNSの実装は、コーネックスをサポートしていない可能性があります）をサポートしていない場合でも、コーネックスを利用することができます。"
    },
    {
      "indent": 3,
      "text": "On the network side, the provider solely needs to place ConEx congestion policers at each ingress to its network in a similar arrangement to the edge-policed architecture of Diffserv [RFC2475].",
      "ja": "ネットワーク側では、プロバイダは、単独のDiffserv [RFC 2475]のエッジポリシングアーキテクチャと同様の構成で、そのネットワークへの各入口でコーネックス輻輳警察を配置する必要があります。"
    },
    {
      "indent": 3,
      "text": "A sender can choose whether to send packets that support ConEx or packets that don't. ConEx-enabled packets bring information to the policer about congestion expected on the rest of the path beyond the policer. Packets that do not support ConEx bring no such information. Therefore, the network will tend to conservatively rate-limit non-ConEx-enabled packets in order to manage the unknown risk of congestion. In contrast, a network doesn't normally need to rate-limit ConEx-enabled packets unless they reveal a persistently high contribution to congestion. This natural tendency for networks to favour senders that provide ConEx information reinforces ConEx deployment.",
      "ja": "送信者は、コーネックスたりしないパケットをサポートしてパケットを送信するかどうかを選択することができます。 CONEX対応のパケットがポリサーを超えたパスの残りの部分に期待渋滞についてのポリサーに情報をもたらします。コーネックスをサポートしていないパケットは、そのような情報を持っていません。そのため、ネットワークは控えめに混雑の未知のリスクを管理するために、非CONEX対応のパケット制限を評価する傾向があります。これとは対照的に、ネットワークは、通常、彼らは渋滞に持続的に高い貢献を明らかにしない限り、CONEX対応のパケット・レート制限する必要はありません。コネックス情報を提供する送信者を有利にするネットワークのためのこの自然な傾向は、コーネックスの展開を強化します。"
    },
    {
      "indent": 3,
      "text": "Feasible initial deployment scenarios exist for a broadband access network [CONEX-DEPLOY], a mobile communications network [CONEX-MOBILE], and a multi-tenant data centre [CONEX-DATA]. The first two of these scenarios are believed to work well without ECN support, while the data center scenario works best with ECN (and ECN can be deployed unilaterally).",
      "ja": "実現可能な初期の展開シナリオは、ブロードバンド・アクセス・ネットワーク[CONEX-DEPLOY]、移動体通信網[CONEX-MOBILE]、及びマルチテナントデータセンター[CONEX-DATA]のために存在します。データセンターのシナリオでは、ECNで最適に動作しながら、これらのシナリオの最初の二つは、ECNのサポートなしでうまく機能すると考えられている（とECNを一方的に展開することができます）。"
    },
    {
      "indent": 3,
      "text": "The above gives only the most salient aspects of ConEx deployment. For further detail, [CONEX-ABS] describes the incremental deployment features of the ConEx protocol and the components that need to be deployed for ConEx to work.",
      "ja": "上記は、コーネックスの展開の唯一の最も顕著な側面を与えます。さらに詳しくは、[CONEX-ABSは】コーネックスプロトコルの増分展開機能とコーネックスを動作させるために展開される必要があるコンポーネントを記述しています。"
    },
    {
      "indent": 0,
      "text": "6. Experimental Considerations",
      "section_title": true,
      "ja": "6.実験的考察"
    },
    {
      "indent": 3,
      "text": "ConEx is initially designed as an experimental protocol because it makes an ambitious change at the interoperability (IP) layer, so no amount of careful design can foresee all the potential feature interactions with other uses of IP. This section identifies a number of questions that would be useful to answer through well-designed experiments:",
      "ja": "それは、相互運用性（IP）層での野心的な変更を行うため、コーネックスは、最初に実験プロトコルとして設計されているので、慎重な設計のない量は、IPの他の用途を持つすべての潜在的な特徴の相互作用を予測することはできません。このセクションでは、うまく設計された実験によって答えることが有用であろう質問の数を識別します。"
    },
    {
      "indent": 3,
      "text": "o Are the compromises that were made in order to fit the ConEx encoding into IP (for example, that the initial design was solely for IPv6 and not for IPv4, and that the encoding has limited visibility when tunnelled [CONEX-DESTOPT]) the right ones?",
      "ja": "O IPにコーネックス符号化に適合するためになされた妥協は、（トンネリング例えば、初期の設計は単にIPv6用としないIPv4で、そのあったことをエンコーディングが制限されている可視[CONEX-DESTOPT]）右もの？"
    },
    {
      "indent": 3,
      "text": "o Is it possible to combine techniques for distinguishing self-congestion from shared congestion with ConEx-based traffic management such that users are not penalized for congestion that does not impact others on the network? Are other techniques needed?",
      "ja": "Oそれは、ユーザーがネットワーク上で他の人に影響を与えません混雑のために罰せられないようなコーネックスベースのトラフィック管理と共有混雑から自己輻輳を区別するための技術を組み合わせることが可能ですか？他の技術が必要とされていますか？"
    },
    {
      "indent": 3,
      "text": "o In practice, how does traffic management using ConEx compare with traditional techniques (Section 3.3)? Does it give the benefits claimed in Sections 3.1 and 3.2?",
      "ja": "O実際には、どのようにコーネックスを使用して、トラフィック管理は、伝統的な技法（3.3節）との違いは何ですか？それは、セクション3.1および3.2に記載の恩恵を与えるのか？"
    },
    {
      "indent": 3,
      "text": "o Approaches are proposed for congestion policing of ConEx traffic alongside existing management (or lack thereof) of non-ConEx traffic, including UDP traffic [CONEX-ABS]. Are they strategy-proof against users selectively using both? Are there better transition strategies?",
      "ja": "OアプローチはUDPトラフィック[CONEX-ABS]を含む非コーネックストラフィックの既存の管理（またはその欠如）、一緒にコーネックス・トラフィックの混雑ポリシングのために提案されています。彼らは選択の両方を使用して、ユーザーに対する戦略プルーフていますか？より優れた移行戦略はありますか？"
    },
    {
      "indent": 3,
      "text": "o Audit devices have been designed and implemented to assure ConEx signal integrity [CONEX-ABS]. Do they achieve minimal false hits and false misses in a wide range of traffic scenarios? Are there new attacks? Are there better audit designs to defend against these?",
      "ja": "O監査デバイスを設計し、コーネックス信号インテグリティ[CONEX-ABS]を保証するために実施されてきました。彼らは、トラフィックシナリオの広い範囲で最小限の偽ヒットと偽のミスを達成していますか？そこに新たな攻撃がありますか？これらを防御するためのより良い監査のデザインがありますか？"
    },
    {
      "indent": 3,
      "text": "o If ECN deployment remains patchy, are the proposed initial ConEx deployment scenarios (Section 5) still useful enough to kick-start deployment? Is auditing effective when based on loss at a primary bottleneck? Can rest-of-path congestion be approximated accurately enough without ECN? Are there other useful deployment scenarios?",
      "ja": "ECNの展開が斑状のままの場合はO、提案された初期のコネックス展開シナリオは十分にキックスタートへの展開をまだ（第5節）が有用ですか？主要なボトルネックでの損失に基づいたときに効果的な監査ですか？休む-のパスができ輻輳ECNせずに十分正確に近似することが？他の有用な展開シナリオはありますか？"
    },
    {
      "indent": 3,
      "text": "ConEx is intended to be a generative technology that might be used for unexpected purposes unforeseen by the designers. Therefore, this list of experimental considerations is not intended to be exhaustive.",
      "ja": "コーネックスは、デザイナーによって予期せぬ不測の目的のために使用される可能性があります生成的な技術であることを意図しています。そのため、実験的な検討事項のこのリストは網羅的であることを意図したものではありません。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "ja": "7.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document does not specify a mechanism, it merely motivates congestion exposure at the IP layer. Therefore, security considerations are described in the companion document that gives an abstract description of the ConEx protocol and the components that would use it [CONEX-ABS].",
      "ja": "この文書では、それは単に、IP層での混雑暴露の動機、機構が指定されていません。したがって、セキュリティの考慮事項は、コーネックスプロトコルと、それを使用するコンポーネント[CONEX-ABS]の抽象記述を与える仲間ドキュメントに記載されています。"
    },
    {
      "indent": 0,
      "text": "8. Acknowledgments",
      "section_title": true,
      "ja": "8.謝辞"
    },
    {
      "indent": 3,
      "text": "Bob Briscoe was partly funded by Trilogy, a research project (ICT-216372) supported by the European Community under its Seventh Framework Programme. The views expressed here are those of the author only.",
      "ja": "ボブ・ブリスコーが一部トリロジーによって資金を供給された、第7次フレームワーク計画の下で欧州共同体でサポートされている研究プロジェクト（ICT-216372）。ここで示された見解は著者のものです。"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank the many people that have commented on this document: Bernard Aboba, Mikael Abrahamsson, Joao Taveira Araujo, Marcelo Bagnulo Braun, Steve Bauer, Caitlin Bestler, Steven Blake, Louise Burness, Ken Carlberg, Nandita Dukkipati, Dave McDysan, Wes Eddy, Matthew Ford, Ingemar Johansson, Georgios Karagiannis, Mirja Kuehlewind, Dirk Kutscher, Zhu Lei, Kevin Mason, Matt Mathis, Michael Menth, Chris Morrow, Tim Shepard, Hannes Tschofenig, and Stuart Venters. Please accept our apologies if your name has been missed off this list.",
      "ja": "バーナードAboba、ミカエルAbrahamsson、ジョアン・タベイラアラウージョ、マルセロBagnuloブラウン、スティーブ・バウアー、ケイトリンBestler、スティーブ・ブレイク、ルイーズBurness、ケン・カールバーグ、Nandita Dukkipati、デイブMcDysan：作者は、このドキュメントにコメントしている多くの人々に感謝したいと思います、ウェス・エディ、マシュー・フォード、インゲマル・ヨハンソン、ゲオルギオスKaragiannis、Mirja Kuehlewind、ディルクKutscher、朱レイ、ケヴィン・メイソン、マット・マシス、マイケルMenth、クリス・モロー、ティム・シェパード、ハンネスTschofenig、およびスチュアートVenters氏。あなたの名前はこのリストをオフに見逃されている場合は、私たちの謝罪を受け入れてください。"
    },
    {
      "indent": 0,
      "text": "9. Contributors",
      "section_title": true,
      "ja": "9.協力者"
    },
    {
      "indent": 3,
      "text": "Philip Eardley and Andrea Soppera made helpful text contributions to this document.",
      "ja": "フィリップEardleyとアンドレアSopperaは、この文書に役立つテキスト貢献をしました。"
    },
    {
      "indent": 3,
      "text": "The following co-edited this document through most of its life:",
      "ja": "以下にその人生の大半を通じてこの文書を共同編集しました："
    },
    {
      "indent": 6,
      "text": "Toby Moncaster Computer Laboratory William Gates Building JJ Thomson Avenue Cambridge, CB3 0FD UK EMail: toby.moncaster@cl.cam.ac.uk",
      "ja": "トビーMoncasterコンピュータ研究所のウィリアム・ゲイツビルJJトムソン・アベニューケンブリッジ、CB3 0FD英国Eメール：toby.moncaster@cl.cam.ac.uk"
    },
    {
      "indent": 6,
      "text": "John Leslie JLC.net 10 Souhegan Street Milford, NH 03055 US EMail: john@jlc.net",
      "ja": "ジョン・レスリーJLC.net 10 Souheganストリートミルフォード、NH 03055米国電子メール：john@jlc.net"
    },
    {
      "indent": 0,
      "text": "10. Informative References",
      "section_title": true,
      "ja": "10.参考文献"
    },
    {
      "indent": 3,
      "text": "[Bauer09] Bauer, S., Clark, D., and W. Lehr, \"The Evolution of Internet Congestion\", 2009.",
      "ja": "[Bauer09]バウアー、S.、クラーク、D.、およびW. Lehrの、 \"インターネット輻輳の進化\"、2009年。"
    },
    {
      "indent": 3,
      "text": "[CONEX-ABS] Mathis, M. and B. Briscoe, \"Congestion Exposure (ConEx) Concepts and Abstract Mechanism\", Work in Progress, October 2012.",
      "ja": "[CONEX-ABS]マシス、M.とB.ブリスコー、 \"輻輳露出（コーネックス）概念および抽象メカニズム\"、進歩、2012年10月での作業。"
    },
    {
      "indent": 3,
      "text": "[CONEX-DATA] Briscoe, B. and M. Sridharan, \"Network Performance Isolation in Data Centres using Congestion Exposure (ConEx)\", Work in Progress, July 2012.",
      "ja": "[CONEX-DATA]ブリスコー、B.とM. Sridharan、進歩、2012年7月で、作業 \"輻輳露出（コーネックス）を使用して、データセンターにおけるネットワークパフォーマンスの分離\"。"
    },
    {
      "indent": 3,
      "text": "[CONEX-DEPLOY] Briscoe, B., \"Initial Congestion Exposure (ConEx) Deployment Examples\", Work in Progress, July 2012.",
      "ja": "[CONEX-DEPLOY]ブリスコー、B.、 \"初期輻輳暴露（コーネックス）展開例\"、進歩、2012年7月で働いています。"
    },
    {
      "indent": 3,
      "text": "[CONEX-DESTOPT] Krishnan, S., Kuehlewind, M., and C. Ucendo, \"IPv6 Destination Option for ConEx\", Work in Progress, September 2012.",
      "ja": "[CONEX-DESTOPT]クリシュナン、S.、Kuehlewind、M.、およびC. Ucendo、 \"コーネックスのためのIPv6宛先オプション\"、進歩、2012年9月での作業。"
    },
    {
      "indent": 3,
      "text": "[CONEX-MOBILE] Kutscher, D., Mir, F., Winter, R., Krishnan, S., Zhang, Y., and C. Bernardos, \"Mobile Communication Congestion Exposure Scenario\", Work in Progress, July 2012.",
      "ja": "[CONEX-MOBILE] Kutscher、D.、ミール、F.、冬、R.、クリシュナン、S.、張、Y.、およびC. Bernardos、 \"移動通信の輻輳暴露シナリオ\"、進歩、2012年7月に働いています。"
    },
    {
      "indent": 3,
      "text": "[CongPol] Briscoe, B., Jacquet, A., and T. Moncaster, \"Policing Freedom to Use the Internet Resource Pool\", ReArch 2008 hosted at the 2008 CoNEXT conference , December 2008.",
      "ja": "[CongPol]ブリスコー、B.、ジャケ、A.、およびT. Moncaster、 \"ポリシング自由にインターネットリソースプールを使用するためには、\"、ReArch 2008は2008 CoNEXT会議、2008年12月に開催しました。"
    },
    {
      "indent": 3,
      "text": "[LEDBAT] Shalunov, S., Hazel, G., Iyengar, J., and M. Kuehlewind, \"Low Extra Delay Background Transport (LEDBAT)\", Work in Progress, September 2012.",
      "ja": "【LEDBAT] Shalunov、S.、ヘーゼル、G.、アイアンガー、J.、およびM. Kuehlewind、 \"低余分な遅延の背景トランスポート（LEDBAT）\"、進歩、2012年9月に働いています。"
    },
    {
      "indent": 3,
      "text": "[RFC2475] Blake, S., Black, D., Carlson, M., Davies, E., Wang, Z., and W. Weiss, \"An Architecture for Differentiated Services\", RFC 2475, December 1998.",
      "ja": "[RFC2475]ブレイク、S.、ブラ​​ック、D.、カールソン、M.、デイヴィス、E.、王、Z.、およびW.ワイス、 \"差別化サービスのためのアーキテクチャ\"、RFC 2475、1998年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC3168] Ramakrishnan, K., Floyd, S., and D. Black, \"The Addition of Explicit Congestion Notification (ECN) to IP\", RFC 3168, September 2001.",
      "ja": "\"IPに明示的輻輳通知の添加（ECN）\" [RFC3168]ラマクリシュナン、K.、フロイド、S.、およびD.ブラック、RFC 3168、2001年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC6057] Bastian, C., Klieber, T., Livingood, J., Mills, J., and R. Woundy, \"Comcast's Protocol-Agnostic Congestion Management System\", RFC 6057, December 2010.",
      "ja": "[RFC6057]バスティアン、C.、Klieber、T.、Livingood、J.、ミルズ、J.、およびR. Woundy、 \"Comcastのプロトコルに依存しない輻輳管理システム\"、RFC 6057、2010年12月。"
    },
    {
      "indent": 3,
      "text": "[TCP-MOD] Kuehlewind, M. and R. Scheffenegger, \"TCP modifications for Congestion Exposure\", Work in Progress, May 2012.",
      "ja": "[TCP-MOD] Kuehlewind、M.とR. Scheffenegger、 \"輻輳露出のためのTCPの変更\"、進歩、2012年5月での作業。"
    },
    {
      "indent": 3,
      "text": "[TCPM-ECN] Kuehlewind, M. and R. Scheffenegger, \"More Accurate ECN Feedback in TCP\", Work in Progress, July 2012.",
      "ja": "[TCPM-ECN] Kuehlewind、M.とR. Scheffenegger、 \"TCPで、より正確なECNフィードバック\"、進歩、2012年7月での作業。"
    },
    {
      "indent": 3,
      "text": "[TR-059] Anschutz, T., Ed., \"DSL Forum Technical Report TR-059: Requirements for the Support of QoS-Enabled IP Services\", September 2003.",
      "ja": "[TR-059]アンシュッツ、T.、エド、 \"DSLフォーラム技術報告書TR-059：QoS対応IPサービスのサポートのための要件\"。2003年9月。"
    },
    {
      "indent": 3,
      "text": "[TR-101] Cohen, A., Ed. and E. Schrum, Ed., \"DSL Forum Technical Report TR-101: Migration to Ethernet-Based DSL Aggregation\", April 2006.",
      "ja": "[TR-101]コーエン、A.編。そしてE. Schrum、エド、 \"DSLフォーラム技術報告書TR-101：イーサネットベースのDSL集約への移行\"。2006年4月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Bob Briscoe (editor) BT B54/77, Adastral Park Martlesham Heath Ipswich IP5 3RE UK",
      "ja": "ボブ・ブリスコー（エディタ）BT B54 / 77、Adastral公園MartleshamヒースイプスウィッチIP5 3RE英国"
    },
    {
      "indent": 3,
      "text": "Phone: +44 1473 645196 EMail: bob.briscoe@bt.com URI: http://bobbriscoe.net/",
      "ja": "電話：+44 1473 645196 Eメール：bob.briscoe@bt.com URI：http://bobbriscoe.net/"
    },
    {
      "indent": 3,
      "text": "Richard Woundy (editor) Comcast 1701 John F Kennedy Boulevard Philadelphia, PA 19103 US",
      "ja": "リチャードWoundy（エディタ）Comcastの1701ジョン・F・ケネディ大通りフィラデルフィア、PA 19103米国"
    },
    {
      "indent": 3,
      "text": "EMail: richard_woundy@cable.comcast.com URI: http://www.comcast.com",
      "ja": "電子メール：richard_woundy@cable.comcast.com URI：http://www.comcast.com"
    },
    {
      "indent": 3,
      "text": "Alissa Cooper (editor) CDT 1634 Eye St. NW, Suite 1100 Washington, DC 20006 US",
      "ja": "アリッサ・クーパー（エディタ）CDT 1634アイセントNW、スイート1100ワシントンD.C. 20006米国"
    },
    {
      "indent": 3,
      "text": "EMail: acooper@cdt.org",
      "ja": "メールアドレス：acooper@cdt.org"
    }
  ]
}