{
  "title": {
    "text": "RFC 6395 - An Interface Identifier (ID) Hello Option for PIM",
    "ja": "RFC 6395 - PIMのインターフェイス識別子（ID）こんにちはオプション"
  },
  "number": 6395,
  "created_at": "2022-11-27 05:17:19.036893+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                      S. Gulrajani\nRequest for Comments: 6395                                     S. Venaas\nCategory: Standards Track                                  Cisco Systems\nISSN: 2070-1721                                             October 2011",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 11,
      "text": "An Interface Identifier (ID) Hello Option for PIM",
      "ja": "PIMのインターフェイス識別子（ID）こんにちはオプション"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document defines a new PIM Hello option to advertise an Interface Identifier that can be used by PIM protocols to uniquely identify an interface of a neighboring router.",
      "ja": "このドキュメントでは、PIMプロトコルで使用できるインターフェイス識別子を宣伝する新しいPIM Helloオプションを定義して、隣接するルーターのインターフェイスを一意に識別します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準トラックドキュメントです。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントは、インターネットエンジニアリングタスクフォース（IETF）の製品です。IETFコミュニティのコンセンサスを表しています。公開レビューを受けており、インターネットエンジニアリングステアリンググループ（IESG）からの出版が承認されています。インターネット標準の詳細については、RFC 5741のセクション2で入手できます。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6395.",
      "ja": "このドキュメントの現在のステータス、任意のERRATA、およびそのフィードバックを提供する方法に関する情報は、http：//www.rfc-editor.org/info/rfc6395で取得できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2011 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2011 IETF Trustおよび文書著者として特定された人。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "このドキュメントは、BCP 78およびIETFドキュメント（http://trustee.ietf.org/license-info）に関連するIETF Trustの法的規定の対象となります。この文書に関するあなたの権利と制限を説明するので、これらの文書を注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、セクション4.Eで説明されている法的規定のセクション4.Eで説明されており、単純化されたBSDライセンスで説明されているように保証なしで提供される簡略化されたBSDライセンステキストを含める必要があります。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . . . 2\n  1.1.  Requirements Notation . . . . . . . . . . . . . . . . . . . 2\n2.  Interface Identifier Option . . . . . . . . . . . . . . . . . . 2\n  2.1.  Local Interface Identifier  . . . . . . . . . . . . . . . . 3\n  2.2.  Router Identifier . . . . . . . . . . . . . . . . . . . . . 3\n3.  Message Format  . . . . . . . . . . . . . . . . . . . . . . . . 4\n4.  Security Considerations . . . . . . . . . . . . . . . . . . . . 4\n5.  IANA Considerations . . . . . . . . . . . . . . . . . . . . . . 5\n6.  Acknowledgments . . . . . . . . . . . . . . . . . . . . . . . . 5\n7.  References  . . . . . . . . . . . . . . . . . . . . . . . . . . 5\n  7.1.  Normative References  . . . . . . . . . . . . . . . . . . . 5\n  7.2.  Informative References  . . . . . . . . . . . . . . . . . . 5",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "This document defines a new option for use in PIM Hello messages [RFC4601] to carry an Interface Identifier. A router generates identifiers for each of its PIM-enabled interfaces such that each interface has a different identifier. The identifiers can optionally be generated such that they are unique within, e.g., an administrative domain.",
      "ja": "このドキュメントでは、PIM Hello Messages [RFC4601]で使用する新しいオプションを定義して、インターフェイス識別子を運びます。ルーターは、各インターフェイスに異なる識別子があるように、PIM対応インターフェイスのそれぞれの識別子を生成します。識別子は、たとえば管理ドメイン内で一意になるように、オプションで生成できます。"
    },
    {
      "indent": 3,
      "text": "An example where this Interface Identifier can be used is with PIM over Reliable Transport (PORT) [PIM-PORT], where a single Transport connection is used between two routers that have multiple interfaces connecting them. If these interfaces have unnumbered or IPv6 link-local addresses, the Interface Identifier included in the PORT Join/ Prune message will identify with which interface the message is associated. For PORT, the Router Identifier is not needed, and it can be set to zero.",
      "ja": "このインターフェイス識別子を使用できる例は、信頼できる輸送（PORT）[PIM-PORT]上のPIMで使用されます。ここでは、複数のインターフェイスを接続する2つのルーター間で単一の輸送接続が使用されます。これらのインターフェイスには数本のインターフェイスまたはIPv6リンクローカルアドレスがある場合、ポートJoin/ Pruneメッセージに含まれるインターフェイス識別子は、メッセージが関連付けられているインターフェイスと識別されます。ポートの場合、ルーター識別子は必要ありません。また、ゼロに設定できます。"
    },
    {
      "indent": 3,
      "text": "All multi-byte integers in this specification are transmitted in network byte order (i.e., most significant byte first).",
      "ja": "この仕様のすべてのマルチバイト整数は、ネットワークバイトの順序で送信されます（つまり、最初に最も重要なバイト）。"
    },
    {
      "indent": 0,
      "text": "1.1. Requirements Notation",
      "section_title": true,
      "ja": "1.1. 要件表記"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "「必須」、「そうしない」、「必須」、「必要」、「しない」、「そうしない」、「そうではない」、「そうでない」、「推奨」、「5月」、および「オプション」は、[RFC2119]に記載されているように解釈される。"
    },
    {
      "indent": 0,
      "text": "2. Interface Identifier Option",
      "section_title": true,
      "ja": "2. インターフェイス識別子オプション"
    },
    {
      "indent": 3,
      "text": "The Interface Identifier option is used to identify the interface of a neighboring router through which a PIM Hello [RFC4601] was sent. This allows PIM protocols to refer to, or identify, a particular interface on a neighboring router.",
      "ja": "インターフェイス識別子オプションは、PIM Hello [RFC4601]が送信された隣接ルーターのインターフェイスを識別するために使用されます。これにより、PIMプロトコルは、隣接するルーター上の特定のインターフェイスを参照または識別できます。"
    },
    {
      "indent": 3,
      "text": "The Interface Identifier option need only be included in PIM Hello messages if the router supports protocols that require it. An implementation MAY choose to always include it. The usage of the Interface Identifier and the uniqueness requirements are left to the specifications of the PIM protocols that implement it. It is assumed that different protocols have different minimum requirements for stability and uniqueness of the Interface Identifier but that they have no maximum requirement. When specified, these protocols should indicate what their minimum requirements are.",
      "ja": "インターフェイス識別子オプションは、ルーターが必要なプロトコルをサポートしている場合にのみPIM Helloメッセージに含める必要があります。実装は、常にそれを含めることを選択する場合があります。インターフェイス識別子の使用法と一意性要件は、それを実装するPIMプロトコルの仕様に任されています。異なるプロトコルには、インターフェイス識別子の安定性と一意性に関する最小要件が異なるが、最大の要件はないと想定されています。指定すると、これらのプロトコルは最小要件が何であるかを示す必要があります。"
    },
    {
      "indent": 3,
      "text": "The Interface Identifier consists of 64 bits. The lower 32 bits form a Local Interface Identifier, and the high 32 bits form a Router Identifier.",
      "ja": "インターフェイス識別子は64ビットで構成されています。下部32ビットはローカル界面識別子を形成し、高い32ビットはルーター識別子を形成します。"
    },
    {
      "indent": 0,
      "text": "2.1. Local Interface Identifier",
      "section_title": true,
      "ja": "2.1. ローカルインターフェイス識別子"
    },
    {
      "indent": 3,
      "text": "The 32-bit Local Interface Identifier is selected such that it is unique among the router's PIM-enabled interfaces. That is, there MUST NOT be two PIM interfaces with the same Local Interface Identifier. While an interface is up, the Identifier MUST always be the same once it has been allocated. If an interface goes down and comes up, the router SHOULD use the same Identifier. If a node goes down and comes up again, the Identifier for each interface MAY change. Many systems make use of an ifIndex [RFC2863] as a Local Interface Identifier.",
      "ja": "32ビットのローカルインターフェイス識別子が選択されており、ルーターのPIM対応インターフェイスの中で一意になります。つまり、同じローカルインターフェイス識別子を持つ2つのPIMインターフェイスがないはずです。インターフェイスが上がっている間、識別子は割り当てられたら常に同じでなければなりません。インターフェイスが下がって表示される場合、ルーターは同じ識別子を使用する必要があります。ノードが下がって再び登場すると、各インターフェイスの識別子が変更される可能性があります。多くのシステムは、ローカルインターフェイス識別子としてifindex [RFC2863]を使用しています。"
    },
    {
      "indent": 3,
      "text": "The Local Interface Identifier MUST be non-zero. The reason for this is that some protocols may have messages that optionally reference an Interface Identifier, and they may use the value of 0 to show that no Interface Identifier is being referenced. Note that the value of 0 is not a valid ifIndex as defined in [RFC2863].",
      "ja": "ローカルインターフェイス識別子はゼロ以外でなければなりません。この理由は、一部のプロトコルにはオプションでインターフェイス識別子を参照するメッセージがあり、0の値を使用してインターフェイス識別子が参照されていないことを示す可能性があるためです。[RFC2863]で定義されているように、0の値は有効なifindexではないことに注意してください。"
    },
    {
      "indent": 0,
      "text": "2.2. Router Identifier",
      "section_title": true,
      "ja": "2.2. ルーター識別子"
    },
    {
      "indent": 3,
      "text": "The 32-bit Router Identifier may be used to uniquely identify the router. The requirements for the scope in which the Router Identifier needs to be unique depend on the protocols that utilize it. It may need to be unique within some administrative domain, or it may possibly be globally unique.",
      "ja": "32ビットルーター識別子を使用して、ルーターを一意に識別できます。ルーター識別子が一意である必要がある範囲の要件は、それを利用するプロトコルによって異なります。何らかの管理ドメイン内で一意である必要があるかもしれませんし、おそらくグローバルに一意である可能性があります。"
    },
    {
      "indent": 3,
      "text": "A router implementation selects a Router Identifier according to a configured policy that defines the uniqueness scope. Thus, an implementation MAY be configured to choose an IPv4 unicast address assigned to the router as the Router Identifier, but the implementation MUST allow the identifier to be configured manually.",
      "ja": "ルーターの実装は、一意性範囲を定義する構成されたポリシーに従ってルーター識別子を選択します。したがって、ルーターに割り当てられたIPv4ユニキャストアドレスをルーター識別子として選択するように実装を構成することができますが、実装により識別子を手動で構成する必要があります。"
    },
    {
      "indent": 3,
      "text": "Protocols such as BGP [RFC4271] and OSPFv2 [RFC2328] are other protocols that make use of 32-bit identifiers for routers. Provided that the stability and uniqueness requirements of the protocols that make use of the Router Identifier are met, an implementation MAY use the same identifier used by other protocols.",
      "ja": "BGP [RFC4271]やOSPFV2 [RFC2328]などのプロトコルは、ルーターに32ビット識別子を使用する他のプロトコルです。ルーター識別子を使用するプロトコルの安定性と一意性要件が満たされている場合、実装は他のプロトコルで使用される同じ識別子を使用する場合があります。"
    },
    {
      "indent": 3,
      "text": "The value 0 has a special meaning for the Router Identifier. It means that no Router Identifier is used. If a router only supports protocols that require the Interface Identifier to be unique for one router (only making use of the Local Interface Identifier), then the implementation MAY set the Router Identifier to zero.",
      "ja": "値0には、ルーター識別子に特別な意味があります。これは、ルーター識別子が使用されないことを意味します。ルーターが、インターフェイス識別子が1つのルーターに対して一意であることを要求するプロトコルのみをサポートする場合（ローカルインターフェイス識別子のみ）、実装はルーター識別子をゼロに設定する場合があります。"
    },
    {
      "indent": 0,
      "text": "3. Message Format",
      "section_title": true,
      "ja": "3. メッセージ形式"
    },
    {
      "indent": 3,
      "text": "Option Type: Interface Identifier",
      "ja": "オプションタイプ：インターフェイス識別子"
    },
    {
      "indent": 4,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|           Type = 31           |         Length = 8            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                       Router Identifier                       |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                   Local Interface Identifier                  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Allocated Hello Type values can be found in [HELLO-OPT].",
      "ja": "割り当てられたハロータイプの値は[hello-opt]にあります。"
    },
    {
      "indent": 3,
      "text": "Length: In bytes for the value part of the Type/Length/Value encoding. The Interface Identifier will be 8 bytes long.",
      "ja": "長さ：タイプ/長さ/値エンコーディングの値部分のバイト。インターフェイス識別子の長さは8バイトです。"
    },
    {
      "indent": 3,
      "text": "Router Identifier: The Router Identifier is a 4-byte identifier uniquely identifying the router within some scope. It MAY be 0 when no protocols require a Router Identifier. The field MUST contain a valid Router Identifier or the value zero.",
      "ja": "ルーター識別子：ルーター識別子は、あるスコープ内でルーターを一意に識別する4バイト識別子です。ルーター識別子が必要なプロトコルがない場合は0です。フィールドには、有効なルーター識別子または値ゼロが含まれている必要があります。"
    },
    {
      "indent": 3,
      "text": "Local Interface Identifier: The Local Interface Identifier is a 4-byte identifier that is unique among all PIM-enabled interfaces on a router.",
      "ja": "ローカルインターフェイス識別子：ローカルインターフェイス識別子は、ルーター上のすべてのPIM対応インターフェイスの中で一意の4バイト識別子です。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "The Interface Identifier is included in PIM Hello messages. See [RFC4601] for security considerations regarding PIM Hello messages. In particular, PIM Hello messages may be forged and include an arbitrary Interface Identifier, or the Interface Identifier may be intentionally omitted. The effects of this depend on how the Interface Identifier is used by other protocols.",
      "ja": "インターフェイス識別子は、PIM Helloメッセージに含まれています。PIM Helloメッセージに関するセキュリティに関する考慮事項については、[RFC4601]を参照してください。特に、PIM Helloメッセージが偽造され、任意のインターフェイス識別子を含めるか、インターフェイス識別子が意図的に省略される場合があります。これの効果は、インターフェイス識別子が他のプロトコルによってどのように使用されるかに依存します。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "ja": "5. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has assigned the value 31 for the Interface ID PIM-Hello option defined in this document.",
      "ja": "IANAは、このドキュメントで定義されているインターフェイスID PIM-Helloオプションに値31を割り当てました。"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgments",
      "section_title": true,
      "ja": "6. 謝辞"
    },
    {
      "indent": 3,
      "text": "The authors thank Yiqun Cai, Heidi Ou, Liming Wei, Gorry Fairhurst, Bharat Joshi, and Bill Atwood for providing valuable feedback.",
      "ja": "著者は、貴重なフィードバックを提供してくれたYiqun Cai、Heidi Ou、Liming Wei、Gorry Fairhurst、Bharat Joshi、およびBill Atwoodに感謝します。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7. 参考文献"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "ja": "7.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119] Bradner、S。、「要件レベルを示すためにRFCで使用するためのキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC4601] Fenner, B., Handley, M., Holbrook, H., and I. Kouvelas, \"Protocol Independent Multicast - Sparse Mode (PIM-SM): Protocol Specification (Revised)\", RFC 4601, August 2006.",
      "ja": "[RFC4601] Fenner、B.、Handley、M.、Holbrook、H.、およびI. Kouvelas、「プロトコル独立マルチキャスト - スパースモード（PIM -SM）：プロトコル仕様（改訂）」、RFC 4601、2006年8月。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "ja": "7.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[HELLO-OPT] IANA, \"PIM Hello Options\", <http://www.iana.org/>.",
      "ja": "[hello-opt] iana、 \"pim hello options\"、<http://www.iana.org/>。"
    },
    {
      "indent": 3,
      "text": "[PIM-PORT] Farinacci, D., Wijnands, IJ., Venaas, S., and M. Napierala, \"A Reliable Transport Mechanism for PIM\", Work in Progress, August 2011.",
      "ja": "[Pim-Port] Farinacci、D.、Wijnands、IJ。、Venaas、S。、およびM. Napierala、「PIMの信頼できる輸送メカニズム」、2011年8月の進行中。"
    },
    {
      "indent": 3,
      "text": "[RFC2328] Moy, J., \"OSPF Version 2\", STD 54, RFC 2328, April 1998.",
      "ja": "[RFC2328] Moy、J。、「OSPFバージョン2」、STD 54、RFC 2328、1998年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2863] McCloghrie, K. and F. Kastenholz, \"The Interfaces Group MIB\", RFC 2863, June 2000.",
      "ja": "[RFC2863] McCloghrie、K。およびF. Kastenholz、「The Interfaces Group MIB」、RFC 2863、2000年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC4271] Rekhter, Y., Li, T., and S. Hares, \"A Border Gateway Protocol 4 (BGP-4)\", RFC 4271, January 2006.",
      "ja": "[RFC4271] Rekhter、Y.、Li、T。、およびS. Hares、「A Border Gateway Protocol 4（BGP-4）」、RFC 4271、2006年1月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Sameer Gulrajani Cisco Systems Tasman Drive San Jose, CA 95134 USA",
      "ja": "Sameer Gulrajani Cisco Systems Tasman Drive San Jose、CA 95134 USA"
    },
    {
      "indent": 3,
      "text": "EMail: sameerg@cisco.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Stig Venaas Cisco Systems Tasman Drive San Jose, CA 95134 USA",
      "ja": "Stig Venaas Cisco Systems Tasman Drive San Jose、CA 95134 USA"
    },
    {
      "indent": 3,
      "text": "EMail: stig@cisco.com",
      "raw": true,
      "ja": ""
    }
  ]
}