{
  "title": {
    "text": "RFC 6987 - OSPF Stub Router Advertisement",
    "ja": "RFC 6987 - OSPFスタブルータアドバタイズメント"
  },
  "number": 6987,
  "created_at": "2019-11-02 14:06:21.635203+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         A. Retana\nRequest for Comments: 6987                                     L. Nguyen\nObsoletes: 3137                                      Cisco Systems, Inc.\nCategory: Informational                                         A. Zinin\nISSN: 2070-1721                                          Cinarra Systems\n                                                                R. White",
      "raw": true
    },
    {
      "indent": 58,
      "text": "  D. McPherson\nVerisign, Inc.\nSeptember 2013",
      "raw": true
    },
    {
      "indent": 21,
      "text": "OSPF Stub Router Advertisement",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document describes a backward-compatible technique that may be used by OSPF (Open Shortest Path First) implementations to advertise a router's unavailability to forward transit traffic or to lower the preference level for the paths through such a router.",
      "ja": "この文書では、トランジットトラフィックを転送したり、ルータを介してパスの優先度を下げるために、ルータの使用不能をアドバタイズするOSPF（オープンショーテストパスファースト）の実装によって使用されることができる下位互換性技術が記載されています。"
    },
    {
      "indent": 3,
      "text": "This document obsoletes RFC 3137.",
      "ja": "この文書はRFC 3137を廃止します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 IESGによって承認されていないすべての文書がインターネットStandardのどんなレベルの候補です。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6987.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6987で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2013 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2013 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2\n2.  Solutions . . . . . . . . . . . . . . . . . . . . . . . . . .   3\n  2.1.  OSPFv3-Only Solution  . . . . . . . . . . . . . . . . . .   3\n3.  Maximum Link Metric . . . . . . . . . . . . . . . . . . . . .   4\n4.  Deployment Considerations . . . . . . . . . . . . . . . . . .   4\n5.  Security Considerations . . . . . . . . . . . . . . . . . . .   4\n6.  Acknowledgements  . . . . . . . . . . . . . . . . . . . . . .   5\n7.  References  . . . . . . . . . . . . . . . . . . . . . . . . .   5\n  7.1.  Normative References  . . . . . . . . . . . . . . . . . .   5\n  7.2.  Informative References  . . . . . . . . . . . . . . . . .   5\nAppendix A.  Changes from RFC 3137  . . . . . . . . . . . . . . .   6",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "In some situations, it may be advantageous to inform routers in a network not to use a specific router as a transit point but to still route to it. Possible situations include the following:",
      "ja": "いくつかの状況では、通過点として、それに依然としてルーティングする特定のルータを使用しないネットワーク内のルータに通知することが有利であり得ます。可能な状況は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "o The router is in a critical condition (for example, has a very high CPU load or does not have enough memory to store all Link State Advertisements (LSAs) or build the routing table).",
      "ja": "ルータO（例えば、非常に高いCPU負荷を持っているか、すべてのリンクステートアドバタイズメント（LSA）を保存したり、ルーティングテーブルを構築するための十分なメモリがありません）重要な条件です。"
    },
    {
      "indent": 3,
      "text": "o Graceful introduction and removal of the router to/from the network.",
      "ja": "O優雅導入し、ネットワークから/へのルータの除去。"
    },
    {
      "indent": 3,
      "text": "o Other (administrative or traffic engineering) reasons.",
      "ja": "Oその他（管理上またはトラフィックエンジニアリング）の理由。"
    },
    {
      "indent": 3,
      "text": "Note that the solution introduced in this document does not remove the router from the topology view of the network (as could be done by just flushing that router's router-LSA) but discourages other routers from using it for transit routing, while still routing packets to the router's own IP addresses, i.e., the router is announced as a stub.",
      "ja": "まだにパケットをルーティングしながら、このドキュメントで紹介ソリューションは、ネットワークのトポロジビューからルータを削除（ちょうどそのルータのルータ -  LSAをフラッシュすることによって行うことができるよう）が、トランジットルーティングのためにそれを使用してから他のルータを阻止しないことに注意してくださいルータ自身のIPアドレス、すなわち、ルータをスタブとして発表されます。"
    },
    {
      "indent": 3,
      "text": "It must be emphasized that the solution provides real benefits in networks designed with at least some level of redundancy, so that traffic can be routed around the stub router. Otherwise, traffic destined for the networks and reachable through such a stub router may still be routed through it.",
      "ja": "トラフィックがスタブルータを迂回することができるように解決策は、冗長性の少なくともいくつかのレベルで設計されたネットワークでの真のメリットを提供することを強調しなければなりません。そうでなければ、このようスタブルータを介してネットワークと到達可能宛てのトラフィックはまだそれを経由してルーティングすることができます。"
    },
    {
      "indent": 0,
      "text": "2. Solutions",
      "section_title": true,
      "ja": "2.ソリューション"
    },
    {
      "indent": 3,
      "text": "The solution introduced in this document solves two challenges associated with the outlined problem. In the description below, router X is the router announcing itself as a stub. The challenges are",
      "ja": "本書で紹介し解決策を概説問題に関連した2つの課題を解決します。以下の説明では、ルータXは、スタブとして自分自身を発表ルータです。課題があります"
    },
    {
      "indent": 3,
      "text": "1) Making other routers prefer routes around router X while performing the Dijkstra calculation.",
      "ja": "1）他のルータの作成ダイクストラ計算を行いながら、ルータXの周りにルートを好みます。"
    },
    {
      "indent": 3,
      "text": "2) Allowing other routers to reach IP prefixes directly connected to router X.",
      "ja": "2）他のルータが直接ルータXに接続されているIPプレフィクスに到達することを可能にします"
    },
    {
      "indent": 3,
      "text": "Note that it would be easy to address issue 1) alone by just flushing router X's router-LSA from the domain. However, it does not solve problem 2), since other routers will not be able to use links to router X in Dijkstra (no back link), and because router X will not have links to its neighbors.",
      "ja": "それだけで、ドメインからルータXのルータLSAをフラッシュすることによってのみ）問題1に対処するのは簡単だろうことに注意してください。しかし、他のルータは、ダイクストラにおけるX（ノーバックリンクをルータにリンクを使用することはできませんので、それは）、）問題2を解決しないと、ルータXは、隣国へのリンクを持っていないので。"
    },
    {
      "indent": 3,
      "text": "To address both problems, router X announces its router-LSA to the neighbors with the cost of all non-stub links (links of the types other than 3) being set to MaxLinkMetric (defined in Section 3).",
      "ja": "両方の問題に対処するために、ルータXはMaxLinkMetric（セクション3で定義されている）に設定されているすべての非スタッブリンク（3以外の他のタイプのリンク）のコストで隣人にそのルータLSAを発表しました。"
    },
    {
      "indent": 3,
      "text": "The solution above applies to both OSPFv2 [RFC2328] and OSPFv3 [RFC5340].",
      "ja": "溶液を上記のOSPFv2 [RFC2328]とのOSPFv3 [RFC5340]の両方に適用されます。"
    },
    {
      "indent": 0,
      "text": "2.1. OSPFv3-Only Solution",
      "section_title": true,
      "ja": "2.1.  OSPFv3の専用ソリューション"
    },
    {
      "indent": 3,
      "text": "OSPFv3 [RFC5340] introduces additional options to provide similar control of the forwarding topology; the R-bit provides an indication of whether a router is active and should be used for transit traffic.",
      "ja": "OSPFv3の[RFC5340]は転送トポロジの同様の制御を提供するために、追加オプションを導入します。 Rビットは、ルータがアクティブであり、通過トラフィックに使用すべきかどうかの指標を提供します。"
    },
    {
      "indent": 3,
      "text": "It is left to network operators to decide which technique to use in their network. See Section 4 for more details.",
      "ja": "彼らのネットワークで使用する手法を決定するネットワーク事業者に任されています。詳細は、4章を参照してください。"
    },
    {
      "indent": 0,
      "text": "3. Maximum Link Metric",
      "section_title": true,
      "ja": "3.最大リンクメトリック"
    },
    {
      "indent": 3,
      "text": "Section 2 refers to the cost of all non-stub links as MaxLinkMetric, which is a new fixed architectural value introduced in this document.",
      "ja": "第2節では、この文書で導入された新しい固定建築的価値であるMaxLinkMetric、などすべての非スタブリンクのコストを指します。"
    },
    {
      "indent": 3,
      "text": "MaxLinkMetric The metric value indicating that a router-LSA link (see Section 2) should not be used for transit traffic. It is defined to be the 16-bit binary value of all ones: 0xffff.",
      "ja": "MaxLinkMetricルータLSAリンク（セクション2を参照）を通過トラフィックのために使用すべきではないことを示すメトリック値。 0xFFFFの：すべてのものの16ビットのバイナリ値であると定義されます。"
    },
    {
      "indent": 0,
      "text": "4. Deployment Considerations",
      "section_title": true,
      "ja": "4.展開の考慮事項"
    },
    {
      "indent": 3,
      "text": "When using MaxLinkMetric, some inconsistency may be seen if the network is constructed of routers that perform an intra-area Dijkstra calculation as specified in [RFC1247] (discarding link records in router-LSAs that have a MaxLinkMetric cost value) and routers that perform it as specified in [RFC1583] and higher (do not treat links with MaxLinkMetric cost as unreachable). Note that this inconsistency will not lead to routing loops, because if there are some alternate paths in the network, both types of routers will agree on using them rather than the path through the stub router. If the path through the stub router is the only one, the routers of the first type will not use the stub router for transit (which is the desired behavior), while the routers of the second type will still use this path.",
      "ja": "MaxLinkMetricを使用する場合ネットワークは[RFC1247]で指定されているエリア内ダイクストラ計算を実行するルータで構成されている場合、いくつかの矛盾が見られることがあり、それを実行し、ルータ（MaxLinkMetricコスト値を有するルータのLSAのリンクレコードを破棄） [RFC1583]と高い（到達不能としてMaxLinkMetricコストとのリンクを扱うことはありません）に指定されています。ネットワーク内のいくつかの代替パスがある場合、ルータの両方のタイプは、スタブルータを通る経路ではなく、それらを使用することに同意するので、この矛盾は、ルーティングループをもたらさないことに注意してください。スタブルータを通るパスが一つだけである場合に、第2のタイプのルータがまだこのパスを使用する一方、第一のタイプのルータは、（所望の動作である）トランジットのスタブルータを使用しないであろう。"
    },
    {
      "indent": 3,
      "text": "On the other hand, clearing the R-bit will consistently result in the router not being used for transit.",
      "ja": "一方、Rビットをクリアすると、一貫輸送に使用されていないルータをもたらすであろう。"
    },
    {
      "indent": 3,
      "text": "The use of MaxLinkMetric or the R-bit in a network depends on the objectives of the operator. One of the possible considerations for selecting one or the other is in the desired behavior if the path through the stub router is the only one available. Using MaxLinkMetric allows for that path to be used while the R-bit doesn't.",
      "ja": "MaxLinkMetric又はネットワーク内のRビットの使用は、オペレータの目的に依存します。スタブルータを経由するパスが利用できる唯一のものである場合は、1つを選択するか、他の可能な考慮事項の一つは、望ましい行動です。 MaxLinkMetricを使用すると、Rビットがないときに使用すべき経路を可能にします。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "The technique described in this document does not introduce any new security issues into the OSPF protocol.",
      "ja": "この文書に記載された技術は、OSPFプロトコルに新たなセキュリティ問題を紹介しません。"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgements",
      "section_title": true,
      "ja": "6.謝辞"
    },
    {
      "indent": 3,
      "text": "The authors of this document do not make any claims on the originality of the ideas described. Among other people, we would like to acknowledge Henk Smit for being part of one of the initial discussions around this topic.",
      "ja": "本書の著者は述べたアイデアの独創性に申し立てを行うことはありません。他の人の中で、私たちは、このトピックの周りの初期の議論の一つの一部であるためヘンクスミットを承認したいと思います。"
    },
    {
      "indent": 3,
      "text": "We would like to thank Shishio Tsuchiya, Gunter Van de Velde, Tomohiro Yamagata, Faraz Shamim, and Acee Lindem who provided significant input for the latest draft version of this document. Dave Cridland and Tom Yu also provided valuable comments.",
      "ja": "私たちは、このドキュメントの最新ドラフト版のための重要なインプットを提供Shishio土屋、ギュンター・ヴァン・デ・ヴェルデ、智弘山形、Faraz Shamim、およびACEE Lindemに感謝したいと思います。デイブCridlandとトムゆうも貴重なコメントを提供しました。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7.参考"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "ja": "7.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2328] Moy, J., \"OSPF Version 2\", STD 54, RFC 2328, April 1998.",
      "ja": "[RFC2328]モイ、J.、 \"OSPFバージョン2\"、STD 54、RFC 2328、1998年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC5340] Coltun, R., Ferguson, D., Moy, J., and A. Lindem, \"OSPF for IPv6\", RFC 5340, July 2008.",
      "ja": "[RFC5340] Coltun、R.、ファーガソン、D.、モイ、J.、およびA. Lindem、 \"IPv6のためのOSPF\"、RFC 5340、2008年7月。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "ja": "7.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC1247] Moy, J., \"OSPF Version 2\", RFC 1247, July 1991.",
      "ja": "[RFC1247]モイ、J.、 \"OSPFバージョン2\"、RFC 1247、1991年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC1583] Moy, J., \"OSPF Version 2\", RFC 1583, March 1994.",
      "ja": "[RFC1583]モイ、J.、 \"OSPFバージョン2\"、RFC 1583、1994年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3137] Retana, A., Nguyen, L., White, R., Zinin, A., and D. McPherson, \"OSPF Stub Router Advertisement\", RFC 3137, June 2001.",
      "ja": "[RFC3137] Retana、A.、グエン、L.、ホワイト、R.、ジニン、A.、およびD.マクファーソン、 \"OSPFスタブルータアドバタイズメント\"、RFC 3137、2001年6月。"
    },
    {
      "indent": 1,
      "text": "Appendix A. Changes from",
      "ja": "付録A.からの変更点"
    },
    {
      "indent": 3,
      "text": "This document obsoletes [RFC3137].",
      "ja": "この文書では、[RFC3137]を廃止します。"
    },
    {
      "indent": 3,
      "text": "In addition to editorial updates, this document defines a new architectural constant (MaxLinkMetric in Section 3) to eliminate any confusion about the interpretation of LSInfinity. It also incorporates and explains the use of the R-bit [RFC5340] as a solution to the problem addressed in the text.",
      "ja": "社説アップデートに加えて、この文書はLSInfinityの解釈についての混乱を避けるために、新しいアーキテクチャの定数（第3節でMaxLinkMetric）を定義します。また、内蔵しており、テキストで扱われる問題に対する解決策として、R-ビット[RFC5340]の使用方法について説明します。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Alvaro Retana Cisco Systems, Inc. 7025 Kit Creek Rd. Research Triangle Park, NC 27709 USA",
      "ja": "アルバロRetanaシスコシステムズ株式会社7025キットクリークRdを。リサーチトライアングルパーク、NC 27709 USA"
    },
    {
      "indent": 3,
      "text": "EMail: aretana@cisco.com",
      "ja": "メールアドレス：aretana@cisco.com"
    },
    {
      "indent": 3,
      "text": "Liem Nguyen Cisco Systems, Inc. 3750 Cisco Way San Jose, CA 95134 USA",
      "ja": "Liemグエンシスコシステムズ株式会社3750シスコウェイサンノゼ、CA 95134 USA"
    },
    {
      "indent": 3,
      "text": "EMail: lhnguyen@cisco.com",
      "ja": "メールアドレス：lhnguyen@cisco.com"
    },
    {
      "indent": 3,
      "text": "Alex Zinin Cinarra Systems Menlo Park, CA USA",
      "ja": "アレックスジニンCinarraシステムメンロパーク、CA USA"
    },
    {
      "indent": 3,
      "text": "EMail: alex.zinin@gmail.com",
      "ja": "メールアドレス：alex.zinin@gmail.com"
    },
    {
      "indent": 3,
      "text": "Russ White 1500 N. Greenville Avenue Suite 1100 Richardson, TX 75081 USA",
      "ja": "ラスホワイト1500 N.グリーンアベニュースイート1100リチャードソン、TX 75081 USA"
    },
    {
      "indent": 3,
      "text": "EMail: Russ.White@vce.com",
      "ja": "メールアドレス：Russ.White@vce.com"
    },
    {
      "indent": 3,
      "text": "Danny McPherson Verisign, Inc. 12061 Bluemont Way Reston, VA 20190 USA",
      "ja": "ダニー・マクファーソンベリサイン社12061 Bluemontウェイレストン、VA 20190 USA"
    },
    {
      "indent": 3,
      "text": "EMail: dmcpherson@verisign.com",
      "ja": "メールアドレス：dmcpherson@verisign.com"
    }
  ]
}