{
  "title": {
    "text": "RFC 6302 - Logging Recommendations for Internet-Facing Servers",
    "ja": "RFC 6302 - インターネット向けサーバーのログの推奨事項"
  },
  "number": 6302,
  "created_at": "2022-12-14 13:17:39.259759+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         A. Durand\nRequest for Comments: 6302                              Juniper Networks\nBCP: 162                                                    I. Gashinsky\nCategory: Best Current Practice                              Yahoo! Inc.\nISSN: 2070-1721                                                   D. Lee\n                                                          Facebook, Inc.\n                                                             S. Sheppard\n                                                                ATT Labs\n                                                               June 2011",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 10,
      "text": "Logging Recommendations for Internet-Facing Servers",
      "ja": "インターネット向けサーバーのログの推奨事項"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "In the wake of IPv4 exhaustion and deployment of IP address sharing techniques, this document recommends that Internet-facing servers log port number and accurate timestamps in addition to the incoming IP address.",
      "ja": "IPv4の使い果たしとIPアドレス共有技術の展開をきっかけに、このドキュメントでは、インターネット向けサーバーが着信IPアドレスに加えてポート番号と正確なタイムスタンプをログに記録することを推奨しています。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This memo documents an Internet Best Current Practice.",
      "ja": "このメモは、インターネットの最高の現在の練習を文書化しています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on BCPs is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントは、インターネットエンジニアリングタスクフォース（IETF）の製品です。IETFコミュニティのコンセンサスを表しています。公開レビューを受けており、インターネットエンジニアリングステアリンググループ（IESG）からの出版が承認されています。BCPの詳細については、RFC 5741のセクション2で入手できます。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6302.",
      "ja": "このドキュメントの現在のステータス、任意のERRATA、およびそのフィードバックを提供する方法に関する情報は、http：//www.rfc-editor.org/info/rfc6302で取得できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2011 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2011 IETF Trustおよび文書著者として特定された人。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "このドキュメントは、BCP 78およびIETFドキュメント（http://trustee.ietf.org/license-info）に関連するIETF Trustの法的規定の対象となります。この文書に関するあなたの権利と制限を説明するので、これらの文書を注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、セクション4.Eで説明されている法的規定のセクション4.Eで説明されており、単純化されたBSDライセンスで説明されているように保証なしで提供される簡略化されたBSDライセンステキストを含める必要があります。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . . . 2\n2.  Recommendations . . . . . . . . . . . . . . . . . . . . . . . . 3\n3.  ISP Considerations  . . . . . . . . . . . . . . . . . . . . . . 4\n4.  Security Considerations . . . . . . . . . . . . . . . . . . . . 4\n5.  References  . . . . . . . . . . . . . . . . . . . . . . . . . . 4\n  5.1.  Normative references  . . . . . . . . . . . . . . . . . . . 4\n  5.2.  Informative references  . . . . . . . . . . . . . . . . . . 4",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The global IPv4 address free pool at IANA was exhausted in February 2011. Service providers will now have a hard time finding enough IPv4 global addresses to sustain product and subscriber growth. Due to the huge existing global infrastructure, both hardware and software, vendors, and service providers must continue to support IPv4 technologies for the foreseeable future. As legacy applications and hardware are retired, the reliance on IPv4 will diminish; however, this is a process that will take years, perhaps decades.",
      "ja": "IANAのグローバルIPv4アドレスフリープールは、2011年2月に使い果たされました。サービスプロバイダーは、製品と加入者の成長を維持するのに十分なIPv4グローバルアドレスを見つけるのに苦労します。既存のグローバルインフラストラクチャが大きくなっているため、ハードウェアとソフトウェアの両方、ベンダー、サービスプロバイダーの両方が、近い将来のIPv4テクノロジーを引き続きサポートする必要があります。レガシーアプリケーションとハードウェアが廃止されると、IPv4への依存が減少します。しかし、これは何年もかかるプロセスです。"
    },
    {
      "indent": 3,
      "text": "To maintain legacy IPv4 address support, service providers will have little choice but to share IPv4 global addresses among multiple customers. Techniques to do so are outside of the scope of this document. All include some form of address translation/address sharing, being NAT44 [RFC3022], NAT64 [RFC6146] or DS-Lite [DS-LITE].",
      "ja": "Legacy IPv4アドレスサポートを維持するために、サービスプロバイダーは複数の顧客間でIPv4グローバルアドレスを共有する以外に選択肢がありません。そのための手法は、このドキュメントの範囲外です。すべてには、Nat44 [RFC3022]、NAT64 [RFC6146]、またはDS-Lite [DS-Lite]であるために、何らかの形式のアドレス変換/アドレス共有が含まれます。"
    },
    {
      "indent": 3,
      "text": "The effects on the Internet of the introduction of those address sharing techniques have been documented in [RFC6269].",
      "ja": "これらの住所共有技術の導入のインターネットへの影響は、[RFC6269]に記録されています。"
    },
    {
      "indent": 3,
      "text": "Address sharing techniques come with their own logging infrastructure to track the relation between which original IP address and source port(s) were associated with which user and external IPv4 address at any given point in time. In the past, to support abuse mitigation or public safety requests, the knowledge of the external global IP address was enough to identify a subscriber of interest. With address sharing technologies, only providing information about the external public address associated with a session to a service provider is no longer sufficient information to unambiguously identify customers.",
      "ja": "アドレス共有手法には、独自のロギングインフラストラクチャが付属しており、元のIPアドレスとソースポートが、どの時点でどのユーザーおよび外部IPv4アドレスに関連付けられているかの関係を追跡します。過去には、乱用の緩和または公共安全リクエストをサポートするために、外部のグローバルIPアドレスの知識は、関心のサブスクライバーを特定するのに十分でした。住所共有テクノロジーでは、セッションに関連付けられた外部パブリックアドレスに関する情報のみをサービスプロバイダーに提供することで、顧客を明確に識別するのに十分な情報がなくなります。"
    },
    {
      "indent": 3,
      "text": "Note: This document provides recommendations for Internet-facing servers logging incoming connections. It does not provide any recommendations about logging on carrier-grade NAT or other address sharing tools.",
      "ja": "注：このドキュメントは、着信接続を記録するインターネット向けサーバーの推奨事項を提供します。キャリアグレードのNATまたはその他のアドレス共有ツールでのロギングに関する推奨事項は提供されません。"
    },
    {
      "indent": 0,
      "text": "2. Recommendations",
      "section_title": true,
      "ja": "2. 推奨事項"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "ja": "この文書のキーワード \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", および \"OPTIONAL\" はRFC 2119 [RFC2119]で説明されているように解釈されます。"
    },
    {
      "indent": 3,
      "text": "It is RECOMMENDED as best current practice that Internet-facing servers logging incoming IP addresses from inbound IP traffic also log:",
      "ja": "インターネット向けのサーバーが、インバウンドIPトラフィックからの受信IPアドレスを記録することをログに記録することを最良の現在の練習として推奨しています。"
    },
    {
      "indent": 3,
      "text": "o The source port number.",
      "ja": "o ソースポート番号。"
    },
    {
      "indent": 3,
      "text": "o A timestamp, RECOMMENDED in UTC, accurate to the second, from a traceable time source (e.g., NTP [RFC5905]).",
      "ja": "o Timestampは、Traceable Time Source（NTP [RFC5905]など）から、2番目に正確で、2番目に正確に推奨されています。"
    },
    {
      "indent": 3,
      "text": "o The transport protocol (usually TCP or UDP) and destination port number, when the server application is defined to use multiple transports or multiple ports.",
      "ja": "o サーバーアプリケーションが複数のトランスポートまたは複数のポートを使用するように定義されている場合、トランスポートプロトコル（通常はTCPまたはUDP）と宛先ポート番号。"
    },
    {
      "indent": 3,
      "text": "Discussion: Carrier-grade NATs may have different policies to recycle ports; some implementations may decide to reuse ports almost immediately, some may wait several minutes before marking the port ready for reuse. As a result, servers have no idea how fast the ports will be reused and, thus, should log timestamps using a reasonably accurate clock. At this point, the RECOMMENDED accuracy for timestamps is to the second or better. Representation of timestamps in UTC is preferred to local time with UTC-offset or time zone, as this extra information can be lost in the reporting chain.",
      "ja": "ディスカッション：キャリアグレードのNATには、ポートをリサイクルするためのさまざまなポリシーがある場合があります。いくつかの実装は、ポートをほぼすぐに再利用することを決定する場合があります。一部は、再利用の準備ができているポートをマークする前に数分待つことがあります。その結果、サーバーは、ポートがどれだけ速く再利用されるかを知りません。したがって、適度に正確なクロックを使用してタイムスタンプをログに記録する必要があります。この時点で、タイムスタンプの推奨精度は2番目またはそれ以上のものです。UTCのタイムスタンプの表現は、Reportingチェーンでこの追加情報が失われる可能性があるため、UTCオフセットまたはタイムゾーンを使用して現地時間よりも好まれます。"
    },
    {
      "indent": 3,
      "text": "Examples of Internet-facing servers include, but are not limited to, web servers and email servers.",
      "ja": "インターネット向けサーバーの例には、Webサーバーと電子メールサーバーが含まれますが、これらに限定されません。"
    },
    {
      "indent": 3,
      "text": "Although the deployment of address sharing techniques is not foreseen in IPv6, the above recommendations apply to both IPv4 and IPv6, if only for consistency and code simplification reasons.",
      "ja": "IPv6ではアドレス共有手法の展開は予見されていませんが、上記の推奨事項は、一貫性とコードの簡素化上の理由のみである場合、IPv4とIPv6の両方に適用されます。"
    },
    {
      "indent": 3,
      "text": "Discussions about data-retention policies are out of scope for this document. Server security and transport security are important for the protection of logs for Internet-facing systems. The operator of the Internet-facing server must consider the risks, including the data and services on the server, to determine the appropriate measures. The protection of logs is critical in incident investigations. If logs are tampered with, evidence could be destroyed.",
      "ja": "データ保持ポリシーに関する議論は、このドキュメントの範囲外です。サーバーセキュリティと輸送セキュリティは、インターネット向けシステムのログの保護にとって重要です。インターネット向けサーバーのオペレーターは、適切な測定値を決定するために、サーバー上のデータやサービスを含むリスクを考慮する必要があります。ログの保護は、インシデント調査で重要です。ログが改ざんされている場合、証拠を破壊する可能性があります。"
    },
    {
      "indent": 3,
      "text": "The above recommendations also apply to devices such as load-balancers logging incoming connections on behalf of actual servers.",
      "ja": "上記の推奨事項は、実際のサーバーに代わって着信接続を記録する負荷バランサーなどのデバイスにも適用されます。"
    },
    {
      "indent": 3,
      "text": "The above recommendations apply to current logging practices. They do not require any changes in the way logging is performed; e.g., which packets are examined and logged.",
      "ja": "上記の推奨事項は、現在のロギングプラクティスに適用されます。ロギングの実行方法に変更は必要ありません。たとえば、どのパケットが検査およびログに記録されているか。"
    },
    {
      "indent": 0,
      "text": "3. ISP Considerations",
      "section_title": true,
      "ja": "3. ISPの考慮事項"
    },
    {
      "indent": 3,
      "text": "ISP deploying IP address sharing techniques should also deploy a corresponding logging architecture to maintain records of the relation between a customer's identity and IP/port resources utilized. However, recommendations on this topic are out of scope for this document.",
      "ja": "ISP展開IPアドレス共有手法は、対応するロギングアーキテクチャを展開して、顧客の身元と使用されるIP/ポートリソースの関係の記録を維持する必要があります。ただし、このトピックに関する推奨事項は、このドキュメントの範囲外です。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "In the absence of the source port number and accurate timestamp information, operators deploying any address sharing techniques will not be able to identify unambiguously customers when dealing with abuse or public safety queries.",
      "ja": "ソースポート番号と正確なタイムスタンプ情報がない場合、アドレス共有技術を展開するオペレーターは、虐待や公共安全の質問に対処する際に明確な顧客を特定することはできません。"
    },
    {
      "indent": 0,
      "text": "5. References",
      "section_title": true,
      "ja": "5. 参考文献"
    },
    {
      "indent": 0,
      "text": "5.1. Normative references",
      "section_title": true,
      "ja": "5.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119] Bradner、S。、「要件レベルを示すためにRFCで使用するためのキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 0,
      "text": "5.2. Informative references",
      "section_title": true,
      "ja": "5.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[DS-LITE] Durand, A., Droms, R., Woodyatt, J., and Y. Lee, \"Dual-Stack Lite Broadband Deployments Following IPv4 Exhaustion\", Work in Progress, May 2011.",
      "ja": "[DS-Lite] Durand、A.、Droms、R.、Woodyatt、J。、およびY. Lee、「IPv4疲労後のデュアルスタックLiteブロードバンド展開」、2011年5月の進行中。"
    },
    {
      "indent": 3,
      "text": "[RFC3022] Srisuresh, P. and K. Egevang, \"Traditional IP Network Address Translator (Traditional NAT)\", RFC 3022, January 2001.",
      "ja": "[RFC3022] Srisuresh、P。およびK. Egevang、「従来のIPネットワークアドレス翻訳者（従来のNAT）」、RFC 3022、2001年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC5905] Mills, D., Martin, J., Burbank, J., and W. Kasch, \"Network Time Protocol Version 4: Protocol and Algorithms Specification\", RFC 5905, June 2010.",
      "ja": "[RFC5905] Mills、D.、Martin、J.、Burbank、J。、およびW. Kasch、「ネットワーク時間プロトコルバージョン4：プロトコルとアルゴリズムの仕様」、RFC 5905、2010年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC6146] Bagnulo, M., Matthews, P., and I. van Beijnum, \"Stateful NAT64: Network Address and Protocol Translation from IPv6 Clients to IPv4 Servers\", RFC 6146, April 2011.",
      "ja": "[RFC6146] Bagnulo、M.、Matthews、P。、およびI. Van Beijnum、「Stateful Nat64：IPv6クライアントからIPv4サーバーへのネットワークアドレスとプロトコル翻訳」、RFC 6146、2011年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC6269] Ford, M., Ed., Boucadair, M., Durand, A., Levis, P., and P. Roberts, \"Issues with IP Address Sharing\", RFC 6269, June 2011.",
      "ja": "[RFC6269] Ford、M.、Ed。、Boucadair、M.、Durand、A.、Levis、P.、およびP. Roberts、「IPアドレス共有の問題」、RFC 6269、2011年6月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Alain Durand Juniper Networks 1194 North Mathilda Avenue Sunnyvale, CA 94089-1206 USA",
      "ja": "Alain Durand Juniper Networks 1194 North Mathilda Avenue Sunnyvale、CA 94089-1206 USA"
    },
    {
      "indent": 3,
      "text": "EMail: adurand@juniper.net",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Igor Gashinsky Yahoo! Inc. 45 West 18th St. New York, NY 10011 USA",
      "ja": "Igor Gashinsky Yahoo!Inc. 45 West 18th St. New York、NY 10011 USA"
    },
    {
      "indent": 3,
      "text": "EMail: igor@yahoo-inc.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Donn Lee Facebook, Inc. 1601 S. California Ave. Palo Alto, CA 94304 USA",
      "ja": "Donn Lee Facebook、Inc。1601 S. California Ave. Palo Alto、CA 94304 USA"
    },
    {
      "indent": 3,
      "text": "EMail: donn@fb.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Scott Sheppard ATT Labs 575 Morosgo Ave, 4d57 Atlanta, GA 30324 USA",
      "ja": "Scott Sheppard att Labs 575 Morosgo Ave、4d57 Atlanta、GA 30324 USA"
    },
    {
      "indent": 3,
      "text": "EMail: Scott.Sheppard@att.com",
      "raw": true,
      "ja": ""
    }
  ]
}