{
  "title": {
    "text": "RFC 6061 - Uniform Resource Name (URN) Namespace for the National Emergency Number Association (NENA)",
    "ja": "RFC 6061 - ユニフォームリソース名国立緊急番号協会（URN）名前空間（NENA）"
  },
  "number": 6061,
  "created_at": "2019-10-27 14:59:23.384109+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                          B. Rosen\nRequest for Comments: 6061                                       NeuStar\nCategory: Informational                                     January 2011\nISSN: 2070-1721",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Uniform Resource Name (URN) Namespace for the National Emergency Number Association (NENA)",
      "ja": "ユニフォームリソース名国立緊急番号協会（URN）名前空間（NENA）"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document describes the Namespace Identifier (NID) \"nena\" for Uniform Resource Name (URN) resources published by the National Emergency Number Association (NENA). NENA defines and manages resources that utilize this URN model. Management activities for these and other resource types are provided by the NENA Registry System (NRS).",
      "ja": "この文書では、全国緊急番号協会（NENA）によって公開されURN（Uniform Resource Name）のリソースのための名前空間識別子（NID）「ネーナ」を説明しています。 NENAを定義し、このURNモデルを利用リソースを管理します。これらおよびその他のリソースタイプのための管理活動は、NENAレジストリシステム（NRS）によって提供されています。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 IESGによって承認されていないすべての文書がインターネットStandardのどんなレベルの候補です。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6061.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6061で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2011 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2011 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. URN Specification for \"nena\" NID ................................2\n3. Examples ........................................................4\n4. Namespace Considerations ........................................5\n5. Community Considerations ........................................5\n6. Security Considerations .........................................6\n7. IANA Considerations .............................................6\n8. Acknowledgements ................................................6\n9. References ......................................................7\n   9.1. Normative References .......................................7\n   9.2. Informative References .....................................7",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The National Emergency Number Association (NENA) is currently in the process of setting standards, processes, and procedures for the use of an IP-based Emergency Services IP Network (ESInet) for all public safety entities in North America. Some of the solutions being developed by NENA require XML namespaces that are managed so that they are unique and persistent. To assure that the uniqueness is absolute, the registration of a specific Uniform Resource Name (URN) [RFC2141] Namespace ID (NID) for use by NENA is required. This document defines and registers such a namespace in accordance with [RFC3406].",
      "ja": "全国緊急番号協会（NENA）基準、プロセス、および北米のすべての公共の安全のエンティティのIPベースの緊急サービスIPネットワーク（ESInet）を使用するための手順を設定する処理に現在あります。 NENAによって開発されたソリューションのいくつかは、彼らがユニークかつ永続的になるように管理されているXML名前空間が必要です。一意性は絶対的であることを保証するために、特定のユニフォームリソース名（URN）NENAによる使用のために[RFC2141]ネームスペースID（NID）の登録が必要です。このドキュメントは[RFC3406]に従って、そのような名前空間を定義し、登録します。"
    },
    {
      "indent": 0,
      "text": "2. URN Specification for \"nena\" NID",
      "section_title": true,
      "ja": "「ネーナ」NID 2. URN仕様"
    },
    {
      "indent": 3,
      "text": "Namespace ID: nena",
      "ja": "名前空間ID：ネーナ"
    },
    {
      "indent": 3,
      "text": "Registration information:",
      "ja": "登録情報："
    },
    {
      "indent": 6,
      "text": "registration version number: 1",
      "ja": "登録バージョン番号：1"
    },
    {
      "indent": 6,
      "text": "registration date: 2010-10-13",
      "ja": "登録日：2010-10-13"
    },
    {
      "indent": 3,
      "text": "Declared registrant of the namespace:",
      "ja": "名前空間の宣言された登録者："
    },
    {
      "indent": 6,
      "text": "Registering organization Name: National Emergency Number Association (NENA) Address: 4350 North Fairfax Drive, Suite 750 Arlington, VA 22203-1695",
      "ja": "登録組織名：国立緊急番号協会（NENA）住所：4350ノースフェアファックス・ドライブ、スイート750アーリントン、バージニア州22203から1695"
    },
    {
      "indent": 3,
      "text": "Designated contact:",
      "ja": "指定された連絡先："
    },
    {
      "indent": 6,
      "text": "Role: NENA Registry Services Administrator Email: nrs-admin@nena.org",
      "ja": "役割：NENAレジストリサービス管理者のメールアドレス：nrs-admin@nena.org"
    },
    {
      "indent": 3,
      "text": "Declaration of syntactic structure:",
      "ja": "構文構造の宣言："
    },
    {
      "indent": 6,
      "text": "The Namespace Specific String (NSS) of all URNs that use the \"nena\" NID will have the following structure: {NENAclass}:{ClassSpecificString}",
      "ja": "「ネーナ」を使用するすべてのURNのネームスペース固有の文字列（NSS）は、NIDは、以下の構造：{NENAclass}：{} ClassSpecificString"
    },
    {
      "indent": 3,
      "text": "The \"NENAclass\" conforms to the URN syntax requirements [RFC2141] and defines a specific class of resource type. Each class will have a specific labeling scheme that is covered by \"ClassSpecificString\", which also conforms to the naming requirements of [RFC2141].",
      "ja": "「NENAclassは」URN構文要件[RFC2141]に準拠しており、リソース・タイプの特定のクラスを定義します。各クラスには、[RFC2141]の命名要件に準拠して、「ClassSpecificString」、で覆われている特異的標識スキームを持っています。"
    },
    {
      "indent": 3,
      "text": "NENA maintains a naming authority, the National Emergency Number Association (NENA) Registry System (NRS), that will manage the assignment of \"NENAclass\" and the specific registration values assigned for each class. Other NENA standards documents will define the \"ClassSpecificStrings\" for a given \"NENAclass\".",
      "ja": "NENAは「NENAclass」と、クラスごとに割り当てられた特定の登録値の割り当てを管理します命名機関、国家緊急番号協会（NENA）レジストリシステム（NRS）を、維持します。その他NENAの規格文書が与えられた「NENAclass」の「ClassSpecificStrings」を定義します。"
    },
    {
      "indent": 3,
      "text": "Relevant ancillary documentation:",
      "ja": "関連の補助ドキュメント："
    },
    {
      "indent": 6,
      "text": "The National Emergency Number Association Registry System (NRS) provides information on the registered resources and the registrations for each. More information about the NRS and the registration activities and procedures to be followed are defined in \"NENA Registry System Standard\", NENA 70-001 [NENA70-001], which is available at http://www.nena.org/.",
      "ja": "全国緊急番号協会レジストリシステム（NRS）が登録されたリソースとそれぞれの登録に関する情報を提供します。従うべきNRS登録活動と手順の詳細についてはhttp://www.nena.org/で入手できる「NENAレジストリシステム規格」、NENA 70から001 [NENA70-001]で定義されています。"
    },
    {
      "indent": 3,
      "text": "Identifier uniqueness considerations:",
      "ja": "識別子一意性の考慮事項："
    },
    {
      "indent": 6,
      "text": "The NRS will manage resources using the \"nena\" NID and will be the authority for managing the resources and subsequent strings associated. The NRS shall ensure the uniqueness of all nena URNs by checking such names against the list of existing namespace names, as documented in NENA 70-001 [NENA70-001].",
      "ja": "NRSは「ネ​​ーナ」NIDを使用してリソースを管理し、関連するリソースとそれに続く文字列を管理するための権限となります。 NRSは、[NENA70-001] NENA 70から001に記載されているように、既存の名前空間名のリストに対して、このような名前を確認することで、すべてのネーナのURNの一意性を確保しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Identifier persistence considerations:",
      "ja": "識別子の永続性の考慮事項："
    },
    {
      "indent": 6,
      "text": "The NRS will provide clear documentation of the registered uses of the \"nena\" NID. The NRS will establish a registry for \"NENAclass\", as defined in NENA08-003 [NENA08-003]. Each \"NENAclass\" will have a separate description in the registry and may have its own sub-registry. In particular, new \"NENAclass\" registry entries will require a full NENA Technical Standard document.",
      "ja": "NRSは「ネ​​ーナ」NIDの登録用途の明確な文書を提供します。 [NENA08-003] NENA08-003で定義されているようNRSは、「NENAclass」のレジストリを確立します。各「NENAclassは、」レジストリ内の別の記述がありますし、独自のサブレジストリを有することができます。具体的には、新しい「NENAclass」のレジストリエントリは、完全なNENA技術標準の文書が必要になります。"
    },
    {
      "indent": 3,
      "text": "The NRS will maintain a website at a stable address that provides XML and text renderings of the urn:nena registry.",
      "ja": "ネーナレジストリ：NRSは、壷のXMLおよびテキストのレンダリングを提供し、安定したアドレスのウェブサイトを維持します。"
    },
    {
      "indent": 3,
      "text": "Process of identifier assignment:",
      "ja": "識別子割り当てのプロセス。"
    },
    {
      "indent": 6,
      "text": "The NRS processes and procedures for identifier assignment are documented in NENA 07-001 [NENA70-001]. The registry that will control the urn:nena namespace is defined in NENA 08-003 [NENA08-003]. In particular, assignments to the \"NENAclass\" registry will require a NENA Technical Standard document. Subregistries for particular \"NENAclasses\" may be established by such technical standards. Subregistries may be defined to have more liberal management policies as defined in NENA 70-001 [NENA70-001], but must be NRS managed and will not be permitted to be delegated to any other organization or registry. Thus, the NRS will manage the entire urn:nena tree.",
      "ja": "識別子割り当てのNRSプロセスおよび手順は、[NENA70-001] NENA 07から001に記載されています。骨壷制御するレジストリ：ネーナ名前空間には、[NENA08-003] NENA 08から003で定義されています。具体的には、「NENAclass」レジストリへの割り当ては、NENA技術標準の文書が必要になります。特に「NENAclasses」のSubregistriesは、このような技術基準によって確立することができます。 SubregistriesはNENA 70から001 [NENA70-001]で定義されているより自由な経営方針を持っているように定義することができるが、NRS管理する必要がありますし、他の組織やレジストリに委任することが許可されることはありません。ネーナツリー：このように、NRSは、全体の壷を管理します。"
    },
    {
      "indent": 3,
      "text": "Process for identifier resolution:",
      "ja": "識別子の解決のためのプロセス。"
    },
    {
      "indent": 6,
      "text": "The namespace is not currently listed with a Resolution Discovery System (RDS), but nothing about the namespace prohibits the future definition of appropriate resolution methods or listing with an RDS.",
      "ja": "名前空間は、現在の解像度発見システム（RDS）に記載されているが、名前空間については何もRDSと適切な解決方法やリストの将来の定義を禁止していないされていません。"
    },
    {
      "indent": 3,
      "text": "Rules for lexical equivalence:",
      "ja": "字句等価のルール："
    },
    {
      "indent": 6,
      "text": "No special considerations; the rules for lexical equivalence of [RFC2141] apply.",
      "ja": "特別な考慮事項はありません。字句等価性のためのルールは、[RFC2141]適用されます。"
    },
    {
      "indent": 3,
      "text": "Conformance with URN syntax:",
      "ja": "URN構文に準拠："
    },
    {
      "indent": 6,
      "text": "No special considerations.",
      "ja": "特別な考慮事項はありません。"
    },
    {
      "indent": 3,
      "text": "Validation mechanism:",
      "ja": "検証メカニズム："
    },
    {
      "indent": 6,
      "text": "None specified. URN assignment will be handled by procedures implemented in support of NENA activities.",
      "ja": "いずれも指定されていません。 URN割り当てはNENA活動の支援に実装手順によって処理されます。"
    },
    {
      "indent": 3,
      "text": "Scope:",
      "ja": "範囲："
    },
    {
      "indent": 6,
      "text": "Global",
      "ja": "グローバル"
    },
    {
      "indent": 0,
      "text": "3. Examples",
      "section_title": true,
      "ja": "3.例"
    },
    {
      "indent": 3,
      "text": "The following examples are representative URNs that could be assigned by the NRS. They may not be the actual strings that would be assigned.",
      "ja": "以下の実施例は、NRSによって割り当てることができる代表的なのURNです。彼らは、割り当てられる実際の文字列ではないかもしれません。"
    },
    {
      "indent": 3,
      "text": "NENAresource \"psaproute\" Syntax: \"urn:nena:emergencyresponders:<responder name>\" ResourceSpecificString: simple string with name of responder, defined in a subregistry Use: Defines the URN to be used for queries to an NG9-1-1 Emergency Call Routing Function that provides URIs for responding agencies.",
      "ja": "NENAresource「psaproute」構文：「URN：ネーナ：emergencyresponders：<応答者名>」ResourceSpecificString：副登録を使用して定義された応答者の名前を持つ単純な文字列は、：NG9-1-1緊急通報へのクエリに使用するURNを定義します代理店を応答するためのURIを提供してルーティング機能。"
    },
    {
      "indent": 3,
      "text": "Examples:",
      "ja": "例："
    },
    {
      "indent": 6,
      "text": "urn:nena:emergencyresponders:ambulance urn:nena:emergencyresponders:fire urn:nena:emergencyresponders:police urn:nena:emergencyresponders:poison urn:nena:emergencyresponders:coastguard urn:nena:emergencyresponders:marine",
      "ja": "URN：ネーナ：emergencyresponders：救急車骨壷：ネーナ：emergencyresponders：火災骨壷：ネーナ：emergencyresponders：警察骨壷：ネーナ：emergencyresponders：毒骨壷：ネーナ：emergencyresponders：沿岸警備隊のurn：ネーナ：emergencyresponders：マリン"
    },
    {
      "indent": 0,
      "text": "4. Namespace Considerations",
      "section_title": true,
      "ja": "4.名前空間の考慮事項"
    },
    {
      "indent": 3,
      "text": "The National Emergency Number Association has developed standards for emergency calling in North America for several decades. NENA is developing a variety of applications and services using Internet protocols built upon IETF standards. Some of these services require that supporting information (e.g., data descriptions, attributes, etc.) be fully specified. For proper operation, descriptions of the needed supporting information must exist and be available in a unique, reliable, and persistent manner. These dependencies provide the basis of the need for namespaces, in one form or another, and will enable NENA to define URNs that are to assign cleaner, more general, more permanent, more reliable, and more controllable namespace names related to NENA standards, while keeping URNs defined by NENA properly separate from the IETF-defined URNs.",
      "ja": "全国緊急番号協会は、数十年の間、北米での緊急呼び出しのための標準を開発しました。 NENAは、IETF標準に基づいて構築インターネットプロトコルを使用してアプリケーションや様々なサービスを開発しています。これらのサービスの中には、情報をサポートしている（例えば、データの記述は、属性など）を完全に指定する必要があります。適切な動作のために、必要な支援情報の記述が存在しなければならないと、独特の信頼性、および永続的に利用可能です。これらの依存関係はしばらく、何らかの形で、名前空間の必要性の基礎を提供し、NENA規格に関連したクリーナー、より一般的な、より恒久的な、より信頼性が高く、より制御名前空間名を割り当てることがあるのURNを定義するためにNENAを可能にします適切IETF定義のURNから分離NENAによって定義されたURNを保ちます。"
    },
    {
      "indent": 3,
      "text": "As the National Emergency Number Association work is ongoing and covers many technical areas, the possibility of binding to various other namespace repositories has been deemed impractical. Each object or description, as defined in NENA, could possibly be related to multiple different namespaces, so further conflicts of association could occur. Thus, the intent is to utilize the National Emergency Number Association Registry System, operated by NENA, as the naming authority for NENA-defined objects and descriptions.",
      "ja": "全国緊急番号協会の作業が進行中であり、多くの技術分野をカバーしているように、様々な他の名前空間のリポジトリへの結合の可能性は非現実的と考えられています。各オブジェクトまたは説明は、NENAで定義されるように、おそらくそれほど関連のさらなる競合が発生する可能性があり、複数の異なる名前空間に関連することができます。このように、意図はNENA定義オブジェクトとその説明のための命名機関として、NENAが運営する全国の緊急番号協会レジストリシステムを利用することです。"
    },
    {
      "indent": 0,
      "text": "5. Community Considerations",
      "section_title": true,
      "ja": "5.コミュニティの考慮事項"
    },
    {
      "indent": 3,
      "text": "The North American public safety organizations will benefit from publication of this namespace by having permanent and reliable URNs to be used with protocols defined by NENA. The objects and descriptions required for services defined by NENA are generally available for use by other organizations. The National Emergency",
      "ja": "北アメリカの公共安全機関NENAによって定義されたプロトコルで使用するための恒久的かつ信頼性の高いURNのを持っていることによって、この名前空間の出版物から利益を得るであろう。 NENAによって定義されたサービスのために必要なオブジェクトとその説明は、他の組織による使用のために一般的に利用可能です。国家非常事態"
    },
    {
      "indent": 3,
      "text": "Number Association will provide access and support for name requests by these organizations within the constraints of the defined NRS processes and the specific urn:nena registry and subregistries. This support can be enabled in a timely and responsive fashion as new objects and descriptions are produced. These will be enabled in a fashion similar to current IANA processes, as documented in NENA70-001 [NENA70-001].",
      "ja": "ネーナレジストリとsubregistries：ナンバー協会は、名前の定義されたNRSプロセスの制約の範囲内でこれらの組織による要求や特定の壷のためのアクセスとサポートを提供します。新しいオブジェクトと説明が生成されるため、このサポートは、タイムリーかつ応答性の方法で有効にすることができます。 【NENA70-001] NENA70-001に記載されているように、これらは、現在のIANAプロセスと同様の方法で有効になります。"
    },
    {
      "indent": 3,
      "text": "The NRS establishes registries when called for in a NENA Technical Standard. Such standards must provide the NRS with clear and concise instructions on creating and maintaining such registries. Defined management policies include \"NENA Technical Standard Required\", \"NENA Document Required\", \"Expert Review\", and \"First Come First Served\", which correspond to similar IANA management policies. NENA is establishing a website that provides controlled entry of new registries and entries in registries, and automatically produces HTML and XML descriptions of registry contents that are used by vendors and other consumers of the content.",
      "ja": "NENA技術標準にするために呼び出されたときNRSは、レジストリを確立します。このような基準は、そのようなレジストリを作成し、維持することに明確かつ簡潔な命令でNRSを提供しなければなりません。同様のIANA管理ポリシーに対応する、定義された経営方針は「エキスパートレビュー」、「NENA技術標準必須」、「NENAドキュメント必須」が含まれ、「まず最初に添え来ます」。 NENAは、レジストリの新しいレジストリエントリとの制御されたエントリを提供し、ウェブサイトを構築し、自動的にベンダー、コンテンツの他の消費者によって使用されているレジストリの内容のHTMLとXML記述を生成しています。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "There are no additional security considerations other than those normally associated with the use and resolution of URNs in general.",
      "ja": "通常、一般的なのURNの使用と解決に関連づけられたもの以外の追加のセキュリティの考慮事項はありません。"
    },
    {
      "indent": 0,
      "text": "7. IANA Considerations",
      "section_title": true,
      "ja": "7. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document adds a new entry in the URN Namespaces registry. The namespace is \"nena\". The defining document is this RFC. The entry can be found in the Uniform Resource Names (URN) Namespaces registry available from http://www.iana.org and any associated mirrors.",
      "ja": "この文書では、URN名前空間のレジストリに新しいエントリを追加します。名前空間は「ネーナ」です。定義文書は、このRFCです。エントリは、統一リソース名（URN）で見つけることができhttp://www.iana.orgから入手レジストリおよび関連するミラーを名前空間。"
    },
    {
      "indent": 0,
      "text": "8. Acknowledgements",
      "section_title": true,
      "ja": "8.謝辞"
    },
    {
      "indent": 3,
      "text": "The author thanks Alfred Hoenes (TR-Sys) for his careful reading and extensive comments and suggestions. The author also acknowledges that the text from [RFC4358] formed the basis of this document.",
      "ja": "著者のおかげで、彼注意深く読むと多くのコメントや提案のためのアルフレッドHoenes（TR-SYS）。著者はまた、[RFC4358]からのテキストは、この文書の基礎を形成することを認めています。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "ja": "9.参考文献"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "ja": "9.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2141] Moats, R., \"URN Syntax\", RFC 2141, May 1997.",
      "ja": "[RFC2141]堀、R.、 \"URN構文\"、RFC 2141、1997年5月。"
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "ja": "9.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[NENA08-003] NENA, \"Detailed Functional and Interface Specification for the NENA i3 Solution - Stage 3\", NENA Standard 08-003, September 2010.",
      "ja": "[NENA08-003] NENA、 \"NENA i3は解決のための詳細な機能やインタフェース仕様 - 第3ステージ\"、NENA標準08から003、2010年9月。"
    },
    {
      "indent": 3,
      "text": "[NENA70-001] NENA, \"NENA Registry System Standard\", NENA Standard 70-001, September 2009.",
      "ja": "[NENA70-001] NENA、 \"NENAレジストリシステム規格\"、NENA標準70から001、2009年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC3406] Daigle, L., van Gulik, D., Iannella, R., and P. Faltstrom, \"Uniform Resource Names (URN) Namespace Definition Mechanisms\", BCP 66, RFC 3406, October 2002.",
      "ja": "[RFC3406] Daigle氏、L.、バンGulik、D.、Iannella、R.、およびP. Faltstrom、 \"統一リソース名（URN）名前空間定義メカニズム\"、BCP 66、RFC 3406、2002年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC4358] Smith, D., \"A Uniform Resource Name (URN) Namespace for the Open Mobile Alliance (OMA)\", RFC 4358, January 2006.",
      "ja": "[RFC4358]スミス、D.、RFC 4358 \"オープン・モバイル・アライアンス（OMA）のための統一リソース名（URN）名前空間\"、2006年1月。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Brian Rosen NeuStar, Inc. 470 Conrad Dr. Mars, PA 16046 US",
      "ja": "ブライアン・ローゼンNeuStar、Inc.の470コンラッド博士は火星、PA 16046米国"
    },
    {
      "indent": 3,
      "text": "EMail: br@brianrosen.net",
      "ja": "メールアドレス：br@brianrosen.net"
    }
  ]
}