{
  "title": {
    "text": "RFC 6289 - A Uniform Resource Name (URN) Namespace for CableLabs",
    "ja": "RFC 6289 - CableLabsのための統一リソース名（URN）名前空間"
  },
  "number": 6289,
  "created_at": "2019-11-01 19:53:47.230688+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                        E. Cardona\nRequest for Comments: 6289                              S. Channabasappa\nCategory: Informational                                        J-F. Mule\nISSN: 2070-1721                                                CableLabs\n                                                               June 2011",
      "raw": true
    },
    {
      "indent": 9,
      "text": "A Uniform Resource Name (URN) Namespace for CableLabs",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document describes the Namespace Identifier (NID) 'cablelabs' for Uniform Resource Names (URNs) used to identify resources published by Cable Television Laboratories, Inc. (CableLabs). CableLabs specifies and manages resources that utilize this URN identification model. Management activities for these and other resource types are handled by the manager of the CableLabs' Assigned Names and Numbers registry.",
      "ja": "この文書では、名前空間識別子（NID）統一リソース名の「CableLabsの」（のURN）はケーブルテレビラボラトリーズ社（CableLabsの）によって公開されたリソースを識別するために使用について説明します。 CableLabsのは、指定し、このURN識別モデルを利用リソースを管理します。これらおよびその他のリソースタイプのための管理活動は、CableLabsの割り当てられた名前と番号、レジストリの管理者によって処理されます。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 IESGによって承認されていないすべての文書がインターネットStandardのどんなレベルの候補です。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6289.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6289で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2011 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2011 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 3,
      "text": "This document may contain material from IETF Documents or IETF Contributions published or made publicly available before November 10, 2008. The person(s) controlling the copyright in some of this material may not have granted the IETF Trust the right to allow modifications of such material outside the IETF Standards Process. Without obtaining an adequate license from the person(s) controlling the copyright in such materials, this document may not be modified outside the IETF Standards Process, and derivative works of it may not be created outside the IETF Standards Process, except to format it for publication as an RFC or to translate it into languages other than English.",
      "ja": "この材料の一部がIETFトラストにこのような材料の変更を許可する権利を与えられていない可能性がありますにこの文書は、2008年、IETFドキュメントまたは11月10日以前に発行または公開さIETF貢献から著作権を支配する者（複数可）材料を含んでいてもよいですIETF標準化プロセスの外。そのような材料の著作権を管理者（単数または複数）から適切なライセンスを取得することなく、この文書は、IETF標準化過程の外側修正されないかもしれません、そして、それの派生物は、IETF標準化過程の外側に作成されない場合があり、それをフォーマットする以外出版RFCとして、英語以外の言語に翻訳します。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . . . 2\n2.  URN Specification for CableLabs . . . . . . . . . . . . . . . . 3\n3.  Example . . . . . . . . . . . . . . . . . . . . . . . . . . . . 5\n4.  Namespace Considerations  . . . . . . . . . . . . . . . . . . . 5\n5.  Community Considerations  . . . . . . . . . . . . . . . . . . . 5\n6.  IANA Considerations . . . . . . . . . . . . . . . . . . . . . . 5\n7.  Security Considerations . . . . . . . . . . . . . . . . . . . . 6\n8.  Acknowledgements  . . . . . . . . . . . . . . . . . . . . . . . 6\n9.  References  . . . . . . . . . . . . . . . . . . . . . . . . . . 6\n  9.1.  Normative References  . . . . . . . . . . . . . . . . . . . 6\n  9.2.  Informative References  . . . . . . . . . . . . . . . . . . 6",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "CableLabs is a non-profit research and development consortium that is dedicated to pursuing new cable telecommunications technologies and to helping its cable operator members integrate those technical advancements into their business objectives. Within CableLabs, specification activities are organized into projects such as DOCSIS(R), PacketCable(TM), and OpenCable(TM), and technical work is conducted within focus teams. Product vendors, manufacturers, and cable operator members are invited to join the focus teams that create technical specifications.",
      "ja": "CableLabsのは、新しいケーブル電気通信技術を追求し、そのケーブルオペレータのメンバーは彼らのビジネス目標にそれらの技術的な進歩を統合助けることに専用されている非営利の研究開発コンソーシアムです。 CableLabsの内、特定の活動は、DOCSIS（R）のPacketCable（TM）、及びオープンケーブル（TM）などのプロジェクトに編成され、そして技術的な作業は、フォーカスチーム内で行われます。製品のベンダー、メーカー、およびケーブルオペレータのメンバーは、技術仕様を作成するフォーカスチームに招待されています。"
    },
    {
      "indent": 3,
      "text": "Occasionally, CableLabs specification efforts require identifiers in a managed namespace so that they are unique and persistent. To ensure that the uniqueness is absolute, the registration of a specific Uniform Resource Name (URN) [RFC2141] Namespace Identifier",
      "ja": "彼らはユニークかつ永続的になるように、時折、CableLabsの仕様の努力は、管理対象の名前空間内の識別子が必要です。一意性は絶対的であることを保証するために、特定のユニフォームリソース名（URN）の登録[RFC2141]ネームスペース識別子"
    },
    {
      "indent": 3,
      "text": "(NID) for use by CableLabs is being specified in this document, in full conformance with the NID registration process specified in [RFC3406].",
      "ja": "CableLabsのが使用するための（NID）は[RFC3406]で指定されたNID登録プロセスに完全に準拠して、この文書で指定されています。"
    },
    {
      "indent": 0,
      "text": "2. URN Specification for CableLabs",
      "section_title": true,
      "ja": "CableLabsのため2. URN仕様"
    },
    {
      "indent": 3,
      "text": "Namespace ID: cablelabs",
      "ja": "名前空間ID：CableLabsの"
    },
    {
      "indent": 3,
      "text": "Registration information: registration version number: 1 registration date: 2011-04-18",
      "ja": "登録情報：登録バージョン番号：1登録日：2011-04-18"
    },
    {
      "indent": 3,
      "text": "Declared registrant of the namespace: Registering organization Name: Cable Television Laboratories, Inc. Address: 858 Coal Creek Circle, Louisville, CO 80027, USA Designated contact Role: Manager, Standards Email: ietf_standards@cablelabs.com",
      "ja": "宣言された名前空間の登録者：登録団体名：ケーブルテレビラボラトリーズ社住所：858コールクリークサークル、ルイビル、CO 80027、USA指定接触役割：マネージャー、標準Eメール：ietf_standards@cablelabs.com"
    },
    {
      "indent": 3,
      "text": "Declaration of syntactic structure: The Namespace Specific String (NSS) of all URNs that use the \"cablelabs\" NID will have the following structure:",
      "ja": "構文構造の宣言：「CableLabsのを」使用するすべてのURNの名前空間固有の文字列（NSS）は、NIDは、以下の構造："
    },
    {
      "indent": 8,
      "text": "{CLclass}:{CLClassSpecificString}",
      "ja": "{CLクラス}：{CLクラス固有の文字列}"
    },
    {
      "indent": 8,
      "text": "The \"CLclass\" is a US-ASCII string that conforms to the URN syntax requirements specified in [RFC2141] and defines a specific class of resource type. Each class will have a specific labeling scheme that is covered by \"CLClassSpecificString\", which also conforms to the naming requirements of [RFC2141].",
      "ja": "「CLclassは、」[RFC2141]で指定されたURN構文の要件に準拠しており、リソースタイプの特定のクラスを定義するUS-ASCII文字列です。各クラスには、[RFC2141]の命名要件に準拠して、「CLClassSpecificString」、で覆われている特異的標識スキームを持っています。"
    },
    {
      "indent": 8,
      "text": "CableLabs maintains the CableLabs' Assigned Names and Numbers [CANN] specification that will contain the assignment of CableLabs' resource classes and the specific registration values assigned for each resource class.",
      "ja": "CableLabsのリソース・クラスおよび各リソース・クラスに割り当てられた固有の登録値CableLabsののCableLabsの割り当てが含まれます割り当てられた名前と番号[キャン]仕様を維持します。"
    },
    {
      "indent": 3,
      "text": "Relevant ancillary documentation: CableLabs publishes information regarding the registered resources in the CableLabs' Assigned Names and Numbers specification ([CANN]).",
      "ja": "関連の補助ドキュメント：CableLabsのはCableLabsの割り当てられた名前と番号の指定（[キャン]）で登録されたリソースに関する情報を公開しています。"
    },
    {
      "indent": 3,
      "text": "Identifier uniqueness considerations: CableLabs will manage resource classes using the \"cablelabs\" NID and will be the authority for managing resources and associated subsequent strings. CableLabs is expected to guarantee the uniqueness of the strings themselves, or it may permit secondary responsibility for certain defined resources.",
      "ja": "識別子の一意性の考慮：CableLabsのは「CableLabsの」NIDを使用して、リソースクラスを管理し、リソースと関連以降の文字列を管理するための権限となります。 CableLabsのは、自分自身を文字列の一意性を保証することが予想される、またはそれは、特定の定義されたリソースのための二次的な責任を許可することができます。"
    },
    {
      "indent": 8,
      "text": "CableLabs could allow the use of experimental type values for\ntesting purposes only.  Note that using experimental types may\ncreate collisions as multiple users may use the same values for\nresources and specific strings.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Identifier persistence considerations: CableLabs will update the CableLabs' Assigned Names and Numbers specification ([CANN]) to document the registered resources that use the \"cablelabs\" NID.",
      "ja": "識別子の永続性の考慮事項：CableLabsのは 『CableLabsの』 NIDを使用登録されたリソースを文書化するCableLabsの割り当てられた名前と番号の指定（[キャン]）を更新します。"
    },
    {
      "indent": 3,
      "text": "Process of identifier assignment: CableLabs will provide procedures for registration of each type of resource that it maintains. Each such resource may have three types of registration activities:",
      "ja": "識別子割り当てのプロセス：CableLabsのは、それが保持するリソースの各タイプの登録のための手順を提供します。それぞれのそのようなリソースは、登録活動の三種類を持っていることがあります。"
    },
    {
      "indent": 8,
      "text": "1.   Registered values associated with CableLabs documents or\n     services\n2.   Registration of values or sub-trees to other entities\n3.   Name models for use in experimental purposes",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Process for identifier resolution: The namespace is not listed with a resolution discovery system; this is not applicable for this URN registration.",
      "ja": "識別子の解決のためのプロセス：名前空間は解像度発見システムと表示されていません。これは、このURN登録には適用されません。"
    },
    {
      "indent": 3,
      "text": "Rules for lexical equivalence: No special considerations; the rules for lexical equivalence of [RFC2141] apply.",
      "ja": "字句等価のルール：特別な考慮事項はありません。字句等価性のためのルールは、[RFC2141]適用されます。"
    },
    {
      "indent": 3,
      "text": "Conformance with URN syntax: No special considerations.",
      "ja": "URN構文に準拠していない：特別な配慮を。"
    },
    {
      "indent": 3,
      "text": "Validation mechanism: None specified. URN assignment will be handled by procedures implemented in support of CableLabs activities.",
      "ja": "検証メカニズム：指定なし。 URN割り当てはCableLabsの活動を支援するために実装された手順で処理されます。"
    },
    {
      "indent": 3,
      "text": "Scope: Global",
      "ja": "スコープ：グローバル"
    },
    {
      "indent": 0,
      "text": "3. Example",
      "section_title": true,
      "ja": "3.例"
    },
    {
      "indent": 3,
      "text": "The following example represents a hypothetical URN that could be assigned by CableLabs.",
      "ja": "次の例では、CableLabsのにより割り当てることができる仮想的なURNを表します。"
    },
    {
      "indent": 3,
      "text": "urn:cablelabs:packetcable-example:ue:rst-sample",
      "ja": "URN：CableLabsの：PacketCableの-例：UE：RST-サンプル"
    },
    {
      "indent": 3,
      "text": "This example defines the URN to be used for User Equipment (UE) conforming to the sample Residential SIP Telephony (RST) application specified within CableLabs' PacketCable RST specification suite.",
      "ja": "この例では、CableLabsのPacketCableのRST仕様スイート内の指定されたサンプル住宅SIP電話（RST）アプリケーションに準拠したユーザ機器（UE）のために使用するURNを定義します。"
    },
    {
      "indent": 0,
      "text": "4. Namespace Considerations",
      "section_title": true,
      "ja": "4.名前空間の考慮事項"
    },
    {
      "indent": 3,
      "text": "CableLabs develops specifications that may require the use of data models. URN Namespaces are key constructs to manage the definitions of those data models reliably with persistence and uniqueness.",
      "ja": "CableLabsのは、データモデルの使用を必要とする可能性の仕様を開発しています。 URN名前空間は確実に永続性とユニークさと、それらのデータモデルの定義を管理するための重要な構成要素です。"
    },
    {
      "indent": 3,
      "text": "The use of URNs should also help specification authors to maintain different versions of URNs and dependencies between URNs across different versions of CableLabs specifications if they so wish.",
      "ja": "URNの使用はまた、彼らがそう望むならCableLabsの仕様の異なるバージョン間でのURNの間のURNと依存関係の異なるバージョンを維持するために、仕様の著者を助けるべきです。"
    },
    {
      "indent": 0,
      "text": "5. Community Considerations",
      "section_title": true,
      "ja": "5.コミュニティの考慮事項"
    },
    {
      "indent": 3,
      "text": "Participants involved in the development and usage of CableLabs specifications and cable industry deployments will benefit from the publication of this namespace by providing consistent and reliable names for the XML namespaces, schema locations, and similar identifiers of physical data models published within CableLabs specifications.",
      "ja": "CableLabsの仕様の開発と利用に関わる参加者とケーブル業界の展開は、一貫して信頼性の高いXML名前空間の名前、スキーマの場所、およびCableLabsの仕様の範囲内で発表された物理データモデルの同様の識別子を提供することによって、この名前空間の出版物から利益を得るであろう。"
    },
    {
      "indent": 3,
      "text": "The CableLabs specifications are publicly available and are licensed to manufacturers on a nondiscriminatory basis. CableLabs will maintain the allocation of resources for the \"cablelabs\" NID within the following specification: \"CableLabs' Assigned Names and Numbers\" [CANN], which will be publicly available for viewing. CableLabs will also maintain the corresponding specifications where the registered resources are referenced or used.",
      "ja": "CableLabsの仕様は公開され、無差別に基づきメーカーにライセンス供与されています。鑑賞するために一般に公開される、「CableLabsの割り当てられた名前と番号」[キャン]：CableLabsのは、以下の仕様内の「CableLabsの」NIDをするためのリソースの割り当てを維持します。 CableLabsのも、登録されたリソースを参照または使用されている対応する仕様を維持します。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document adds a new entry (\"cablelabs\") in the urn-namespaces registry. This is the defining document. The entry can be found in the \"Uniform Resource Names (URN) Namespaces\" registry available from the IANA site (http://www.iana.org) and any associated mirrors.",
      "ja": "この文書では、URN  - 名前空間のレジストリに新しいエントリ（「CableLabsの」）を追加します。これが定義する文書です。エントリーは、IANAサイト（http://www.iana.org）および関連するミラーから入手できる「統一リソース名（URN）名前空間」のレジストリで見つけることができます。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "ja": "7.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "There are no additional security considerations other than those normally associated with the use and resolution of URNs in general, which are described in [RFC1737], [RFC2141], and [RFC3406].",
      "ja": "[RFC1737]に記載されている通常、一般的にのURNの使用および解像度に関連するもの、[RFC2141]及び[RFC3406]以外の付加的なセキュリティ問題がありません。"
    },
    {
      "indent": 0,
      "text": "8. Acknowledgements",
      "section_title": true,
      "ja": "8.謝辞"
    },
    {
      "indent": 3,
      "text": "The authors wish to thank Alfred Hoenes, Ted Hardie, and Peter Saint-Andre for their useful comments and suggestions. The authors also acknowledge that the text from [RFC4358] formed the basis for the initial version of this document.",
      "ja": "作者は彼らの役に立つコメントと提案のためにアルフレッドHoenes、テッドハーディー、およびピーターサンアンドレに感謝したいです。著者らはまた、[RFC4358]からのテキストは、このドキュメントの最初のバージョンの基礎を形成することを認めます。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "ja": "9.参考文献"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "ja": "9.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2141] Moats, R., \"URN Syntax\", RFC 2141, May 1997.",
      "ja": "[RFC2141]堀、R.、 \"URN構文\"、RFC 2141、1997年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC3406] Daigle, L., van Gulik, D., Iannella, R., and P. Faltstrom, \"Uniform Resource Names (URN) Namespace Definition Mechanisms\", BCP 66, RFC 3406, October 2002.",
      "ja": "[RFC3406] Daigle氏、L.、バンGulik、D.、Iannella、R.、およびP. Faltstrom、 \"統一リソース名（URN）名前空間定義メカニズム\"、BCP 66、RFC 3406、2002年10月。"
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "ja": "9.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[CANN] Cable Television Laboratories Inc., \"CableLabs' Assigned Names and Numbers\", 2011, <http://www.cablelabs.com/specifications/cpSpecs.html>.",
      "ja": "[キャン]ケーブルテレビラボラトリーズ社、 \"CableLabsの割り当てられた名前と番号\"、2011年、<http://www.cablelabs.com/specifications/cpSpecs.html>。"
    },
    {
      "indent": 3,
      "text": "[RFC1737] Sollins, K. and L. Masinter, \"Functional Requirements for Uniform Resource Names\", RFC 1737, December 1994.",
      "ja": "[RFC1737] Sollins、K.とL. Masinter、 \"統一リソース名のための機能要件\"、RFC 1737、1994年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC4358] Smith, D., \"A Uniform Resource Name (URN) Namespace for the Open Mobile Alliance (OMA)\", RFC 4358, January 2006.",
      "ja": "[RFC4358]スミス、D.、RFC 4358 \"オープン・モバイル・アライアンス（OMA）のための統一リソース名（URN）名前空間\"、2006年1月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Eduardo Cardona CableLabs 858 Coal Creek Circle Louisville, CO 80027 USA",
      "ja": "エドゥアルド・カルドナCableLabsの858コールクリークサークルルイビル、CO 80027 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 303 661 3375 EMail: e.cardona@cablelabs.com",
      "ja": "電話：+1 303 661 3375 Eメール：e.cardona@cablelabs.com"
    },
    {
      "indent": 3,
      "text": "Sumanth Channabasappa CableLabs 858 Coal Creek Circle Louisville, CO 80027 USA",
      "ja": "スーマンスChannabasappa CableLabsの858コールクリークサークルルイビル、CO 80027 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 303 661 3307 EMail: sumanth@cablelabs.com",
      "ja": "電話：+1 303 661 3307 Eメール：sumanth@cablelabs.com"
    },
    {
      "indent": 3,
      "text": "Jean-Francois Mule CableLabs 858 Coal Creek Circle Louisville, CO 80027 USA",
      "ja": "ジャン=フランソワラバCableLabsの858コールクリークサークルルイビル、CO 80027 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 303 661 9100 EMail: jf.mule@cablelabs.com",
      "ja": "電話：+1 303 661 9100 Eメール：jf.mule@cablelabs.com"
    }
  ]
}