{
  "title": {
    "text": "RFC 6651 - Extensions to DomainKeys Identified Mail (DKIM) for Failure Reporting",
    "ja": "RFC 6651 - 障害報告のメール（DKIM）を特定のDomainKeysの拡張"
  },
  "number": 6651,
  "created_at": "2019-10-28 20:20:00.290893+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                      M. Kucherawy\nRequest for Comments: 6651                                     Cloudmark\nCategory: Standards Track                                      June 2012\nISSN: 2070-1721",
      "raw": true
    },
    {
      "indent": 1,
      "text": "Extensions to DomainKeys Identified Mail (DKIM) for Failure Reporting",
      "ja": "障害報告のメール（DKIM）を特定のDomainKeysの拡張"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document presents extensions to the DomainKeys Identified Mail (DKIM) specification to allow for detailed reporting of message authentication failures in an on-demand fashion.",
      "ja": "この文書では、オンデマンド方式でメッセージ認証の失敗の詳細なレポートを可能にするためにドメインキー・アイデンティファイド・メール（DKIM）仕様への拡張を提供します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6651.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6651で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2012 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2012 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n2. Definitions .....................................................3\n   2.1. Key Words ..................................................3\n   2.2. Notation ...................................................3\n   2.3. Imported Definitions .......................................3\n   2.4. Other Definitions ..........................................3\n3. Optional Reporting for DKIM .....................................4\n   3.1. Extension DKIM Signature Tag ...............................4\n   3.2. DKIM Reporting TXT Record ..................................4\n   3.3. DKIM Reporting Algorithm ...................................6\n4. Optional Reporting Address for DKIM ADSP ........................8\n5. Requested Reports ...............................................9\n   5.1. Requested Reports for DKIM Failures .......................10\n   5.2. Requested Reports for DKIM ADSP Failures ..................10\n6. Report Generation ..............................................11\n   6.1. Report Format .............................................11\n   6.2. Other Guidance ............................................11\n7. IANA Considerations ............................................11\n   7.1. DKIM Signature Tag Registration ...........................11\n   7.2. DKIM ADSP Tag Registration ................................12\n   7.3. DKIM Reporting Tag Registry ...............................12\n8. Security Considerations ........................................13\n   8.1. Inherited Considerations ..................................13\n   8.2. Report Volume .............................................13\n   8.3. Deliberate Misuse .........................................13\n   8.4. Unreported Fraud ..........................................14\n9. References .....................................................14\n   9.1. Normative References ......................................14\n   9.2. Informative References ....................................15\nAppendix A. Acknowledgements ......................................16\nAppendix B. Examples ..............................................16\n   B.1. Example Use of DKIM Signature Extension Tag ...............16\n   B.2. Example DKIM Reporting TXT Record .........................17\n   B.3. Example Use of DKIM ADSP Extension Tags ...................17",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "DomainKeys Identified Mail [DKIM] introduced a mechanism for message signing and authentication. It uses digital signing to associate a domain name with a message in a reliable manner. The verified domain name can then be evaluated (e.g., checking advertised sender policy, comparison to a known-good list, submission to a reputation service, etc.).",
      "ja": "ドメインキー・アイデンティファイド・メール[DKIM]はメッセージの署名および認証のためのメカニズムを導入しました。それは確実にメッセージを表示してドメイン名を関連付けるためにデジタル署名を使用しています。検証済みのドメイン名は、（例えば、既知の良好なリストにアドバタイズ送信者ポリシー、比較をチェックし、評判サービスへの提出など）を評価することができます。"
    },
    {
      "indent": 3,
      "text": "Deployers of message authentication technologies are increasingly seeking visibility into DKIM verification failures and conformance failures involving the published signing practices (e.g., Author Domain Signing Practices [ADSP]) of an ADministrative Management Domain (ADMD; see [EMAIL-ARCH]).",
      "ja": "メッセージ認証技術のデプロイヤはますます行政管理ドメイン（; [EMAIL-ARCH]を参照ADMD）の公開された署名プラクティス（例えば、著者ドメインはプラクティスの署名[ADSP]）を含むDKIM検証の失敗と適合性の障害への可視性を求めています。"
    },
    {
      "indent": 3,
      "text": "This document extends [DKIM] and [ADSP] to add an optional reporting address and some reporting parameters. Reports are generated using the format defined in [ARF-AUTHFAIL].",
      "ja": "この文書では、オプションのレポート・アドレスと、いくつかの報告パラメータを追加するために[DKIM]延びて、[ADSP]。レポートは、[ARF-AUTHFAIL]で定義されたフォーマットを使用して生成されます。"
    },
    {
      "indent": 0,
      "text": "2. Definitions",
      "section_title": true,
      "ja": "2.定義"
    },
    {
      "indent": 0,
      "text": "2.1. Key Words",
      "section_title": true,
      "ja": "2.1. キーワード"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [KEYWORDS].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[キーワード]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2.2. Notation",
      "section_title": true,
      "ja": "2.2. 表記法"
    },
    {
      "indent": 3,
      "text": "Certain properties of email messages described in this document are referenced using notation found in [EMAIL-ARCH] (e.g., \"RFC5322.From\").",
      "ja": "この文書に記載された電子メールメッセージの特定の特性は[EMAIL-ARCH]に見られる表記法を使用して参照されている（例えば、「RFC5322.From」）。"
    },
    {
      "indent": 0,
      "text": "2.3. Imported Definitions",
      "section_title": true,
      "ja": "2.3. 輸入の定義"
    },
    {
      "indent": 3,
      "text": "Numerous DKIM-specific terms used here are defined in [DKIM]. The definitions of the [ABNF] tokens \"domain-name\" and \"dkim-quoted-printable\" can also be found there.",
      "ja": "ここで使用される多くのDKIM-特有の用語が[DKIM]で定義されています。 [ABNF]トークン「ドメイン名」の定義と「DKIM-quoted-printableの」もそこにあります。"
    },
    {
      "indent": 0,
      "text": "2.4. Other Definitions",
      "section_title": true,
      "ja": "2.4. 他の定義"
    },
    {
      "indent": 3,
      "text": "report generator: A report generator is an entity that generates and sends reports. For the scope of this document, the term refers to Verifiers, as defined in Section 2.2 of [DKIM], with the added capability to generate authentication failure reports according to this specification.",
      "ja": "レポート作成：レポート・ジェネレータが生成したレポートを送信するエンティティです。この仕様によれば認証失敗レポートを生成するために追加された機能と、[DKIM]のセクション2.2で定義されるように、この文書の範囲のために、この用語は、検証者を指します。"
    },
    {
      "indent": 0,
      "text": "3. Optional Reporting for DKIM",
      "section_title": true,
      "ja": "DKIため3.オプションのレポート"
    },
    {
      "indent": 3,
      "text": "A domain name owner employing [DKIM] for email signing and authentication might want to know when signatures that ought to be verifiable are not successfully verifying. Currently, there is no such mechanism defined.",
      "ja": "電子メールの署名および認証のために[DKIM]採用するドメイン名の所有者はべき署名が正常に検証されていない検証する際に知ってほしいことがあります。現在、定義されたそのようなメカニズムはありません。"
    },
    {
      "indent": 3,
      "text": "This section adds optional \"tags\" (as defined in [DKIM]) to the DKIM-Signature header field and the DKIM key record in the DNS, using the formats defined in that specification.",
      "ja": "このセクションでは、その仕様で定義されたフォーマットを使用して、DKIM署名ヘッダフィールドとDNSにDKIMキーレコードに（[DKIM]で定義されるように）、オプションの「タグ」を追加します。"
    },
    {
      "indent": 0,
      "text": "3.1. Extension DKIM Signature Tag",
      "section_title": true,
      "ja": "3.1. 拡張DKI署名タグ"
    },
    {
      "indent": 3,
      "text": "The following tag is added to DKIM-Signature header fields when a Signer wishes to request that reports of failed verifications be generated by a Verifier:",
      "ja": "署名者は、検証失敗の報告を検証することによって生成されることを要求することを望む場合は、次のタグは、DKIM-Signatureヘッダーフィールドに追加されます。"
    },
    {
      "indent": 3,
      "text": "r= Reporting Requested (plain-text; OPTIONAL; no default). If present, this tag indicates that the Signer requests that Verifiers generate a report when verification of the DKIM signature fails. At present, the only legal value is the single character \"y\". A complete description and illustration of how this is applied can be found in Section 3.3.",
      "ja": "R =要求レポート（プレーンテキスト、オプション;デフォルトなし）。存在する場合、このタグはDKIM署名の検証が失敗した場合に検証者は、レポートを生成する署名者を要求することを示しています。現時点では、唯一の有効な値は、単一の文字「Y」です。この適用方法の完全な説明と図は、3.3節に見出すことができます。"
    },
    {
      "indent": 6,
      "text": "ABNF:",
      "ja": "ABNF："
    },
    {
      "indent": 6,
      "text": "sig-r-tag = %x72 *WSP \"=\" *WSP %x79 ; \"r=y\" (lower-case only)",
      "ja": "SIG-Rタグ=％のX72 * WSP \"=\" X79 * WSP％。 \"R = Y\"（小文字のみ）"
    },
    {
      "indent": 0,
      "text": "3.2. DKIM Reporting TXT Record",
      "section_title": true,
      "ja": "3.2.  TXTレコードの報告DKI"
    },
    {
      "indent": 3,
      "text": "When a Signer wishes to advertise that it wants to receive failed verification reports, it places in the DNS a TXT Resource Record (RR). The RR contains a sequence of tag-value objects in a format similar to DKIM key records (see Section 3.6.1 of [DKIM]), but it is entirely independent of those key records and is found at a different name. The tag-value objects in this case comprise the parameters to be used when generating the reports. A report generator will request the content of this record when it sees an \"r=\" tag in a DKIM-Signature header field.",
      "ja": "署名者は、それが失敗した検証報告を受信したいことを宣伝したい場合は、DNS TXTリソースレコード（RR）に配置します。 RRは、DKIMキーレコード（[DKIM]のセクション3.6.1を参照）と同様の形式でタグ値のオブジェクトの配列を含むが、それはそれらのキーレコードの完全に独立しており、別の名前で見出されます。この場合のタグ値オブジェクトは、レポートを生成する際に使用するパラメータを含みます。それはDKIM署名ヘッダフィールドに「R =」タグを見たとき、レポートジェネレータは、このレコードのコンテンツを要求します。"
    },
    {
      "indent": 3,
      "text": "Section 3.6.2.2 of [DKIM] provides guidance with respect to the handling of a TXT RR that comprises multiple distinct strings (\"character-strings\" in the parlance of [DNS]). The same process MUST be applied here.",
      "ja": "[DKIM]のセクション3.6.2.2は、複数の異なる文字列（[DNS]の用語で「文字列」）を含むTXT RRの処理に関して指針を提供します。同じプロセスは、ここで適用されなければなりません。"
    },
    {
      "indent": 3,
      "text": "Implementations MUST support all tags defined in this document, and any other tag found in the content of the record that is not recognized by an implementation MUST be ignored. See Section 7.3 for details about finding or registering extension tags.",
      "ja": "実装は、この文書で定義されたすべてのタグをサポートしなければならない、と実装によって認識されていないレコードの内容で見つかった他のタグを無視しなければなりません。拡張タグを見つけるか、登録の詳細については、7.3節を参照してください。"
    },
    {
      "indent": 3,
      "text": "The initial list of tags supported for the reporting TXT record is as follows:",
      "ja": "次のように報告してTXTレコードのためにサポートされるタグの最初のリストは、次のとおりです。"
    },
    {
      "indent": 3,
      "text": "ra= Reporting Address (plain-text; OPTIONAL). A dkim-quoted-printable string (see Section 2.11 of [DKIM]) containing the local-part of an email address to which a report SHOULD be sent when mail fails DKIM verification for one of the reasons enumerated below. The value MUST be interpreted as a local-part only. To construct the actual address to which the report is sent, the Verifier simply appends to this value an \"@\" followed by the domain name found in the \"d=\" tag of the DKIM-Signature header field. Therefore, a Signer making use of this specification MUST ensure that an email address thus constructed can receive reports generated as described in Section 6.",
      "ja": "RA =レポーティングアドレス（平文;オプション）。メールは以下に列挙のいずれかの理由でDKIM検証を失敗したときにレポートが送らすべき電子メールアドレスのローカル部分を含むDKIM-quoted-printableの文字列（[DKIM]のセクション2.11を参照してください）。値は、ローカルの部分として解釈されなければなりません。レポートが送信される実際のアドレスを構築するために、検証者は、単純にこの値にDKIM-Signatureヘッダーフィールドの「D =」タグに見られるドメイン名に続いて「@」を付加します。したがって、本明細書の署名者を作る使用は、このように構成された電子メールアドレスは、セクション6で説明したように生成されたレポートを受信できることを保証しなければなりません。"
    },
    {
      "indent": 6,
      "text": "ABNF:",
      "ja": "ABNF："
    },
    {
      "indent": 6,
      "text": "rep-ra-tag = %x72.61 *WSP \"=\" *WSP dkim-quoted-printable ; \"ra=...\" (lower-case only for the tag name)",
      "ja": "REP-RA-タグ=％のx72.61 * WSP \"=\" * WSP DKIM-印刷可能引用され; 「RA = ...」（唯一のタグ名の小文字）"
    },
    {
      "indent": 3,
      "text": "rp= Requested Report Percentage (plain-text; OPTIONAL; default is \"100\"). The value is an integer from 0 to 100 inclusive that indicates what percentage of incidents of signature authentication failures, selected at random, are to cause reports to be generated. The report generator SHOULD NOT issue reports for more than the requested percentage of incidents. Report generators MAY make use of the \"Incidents:\" field in [ARF] to indicate that there are more reportable incidents than there are reports.",
      "ja": "RP =要求されたレポートの割合（平文;オプション;デフォルトである「100」）。値がランダムに選択されたシグネチャ認証失敗の事故の何パーセント、示す0から100までの整数で含まれており、生成されるレポートを引き起こすことがあります。レポート・ジェネレータは、事件の要求された割合よりも多くのレポートを発行するべきではありません。報告があるよりも多くの報告事件があることを示すために、[ARF]フィールド：レポートジェネレータは、「インシデント」を利用することができます。"
    },
    {
      "indent": 6,
      "text": "ABNF:",
      "ja": "ABNF："
    },
    {
      "indent": 6,
      "text": "rep-rp-tag = %x72.70 *WSP \"=\" *WSP 1*3DIGIT ; \"rp=...\" (lower-case only)",
      "ja": "REP-RP-タグ=％x72.70 * WSP \"=\" * WSP 1 * 3DIGIT。 \"RP = ...\"（小文字のみ）"
    },
    {
      "indent": 3,
      "text": "rr= Requested Reports (plain-text; OPTIONAL; default is \"all\"). The value MUST be a colon-separated list of tokens representing those conditions under which a report is desired. See Section 5.1 for a list of valid tokens.",
      "ja": "RR =レポート要求（;オプション;プレーンテキストのデフォルトは「すべて」です）。値は、レポートが望まれるの下、これらの条件を表すトークンのコロンで区切られたリストでなければなりません。有効なトークンのリストについては、セクション5.1を参照してください。"
    },
    {
      "indent": 6,
      "text": "ABNF:",
      "ja": "ABNF："
    },
    {
      "indent": 6,
      "text": "rep-rr-type = ( \"all\" / \"d\" / \"o\" / \"p\" / \"s\" / \"u\" / \"v\" / \"x\" ) rep-rr-tag = %x72.72 *WSP \"=\" *WSP rep-rr-type *WSP *( \":\" *WSP rep-rr-type ) ; \"rr=...\" (lower-case only for the tag name)",
      "ja": "REP-RR型=（ \"全て\" / \"D\" / \"O\" / \"P\" / \"S\" / \"U\" / \"V\" / \"X\"）REP-RR-タグ=％のx72.72 * WSP \"=\" * WSP REP-RR型* WSP *（ \"：\" * WSPのREP-RR型）。 「RR = ...」（唯一のタグ名の小文字）"
    },
    {
      "indent": 3,
      "text": "rs= Requested SMTP Error String (plain-text; OPTIONAL; no default). The value is a dkim-quoted-printable string that the publishing ADMD requests be included in [SMTP] error strings if messages are rejected during the delivery SMTP session.",
      "ja": "RS =要求されたSMTPエラー文字列（平文;オプション;デフォルトなし）。値は、メッセージが配信SMTPセッション中に拒否された場合に発行ADMD要求は、[SMTP]エラー文字列に含まれることをDKIM-quoted-printableの文字列です。"
    },
    {
      "indent": 6,
      "text": "ABNF:",
      "ja": "ABNF："
    },
    {
      "indent": 6,
      "text": "rep-rs-tag = %x72.73 *WSP \"=\" dkim-quoted-printable ; \"rs=...\" (lower-case only for the tag name)",
      "ja": "REP-RS-タグ=％のx72.73は* WSP \"=\" DKIM-quoted-printableの。 「RS = ...」（小文字のみのタグ名用）"
    },
    {
      "indent": 3,
      "text": "In the absence of an \"ra=\" tag, the \"rp=\" and \"rr=\" tags MUST be ignored, and the report generator MUST NOT issue a report.",
      "ja": "「RA =」タグがない場合には、「RPは=」と「RR =」タグは無視されなければならない、とレポートジェネレータは、レポートを発行してはいけません。"
    },
    {
      "indent": 0,
      "text": "3.3. DKIM Reporting Algorithm",
      "section_title": true,
      "ja": "3.3.  DKI報告アルゴリズム"
    },
    {
      "indent": 3,
      "text": "Report generators MUST apply the following algorithm, or one semantically equivalent to it, for each DKIM-Signature header field whose verification fails for some reason. Note that this processing is done as a reporting extension only; the outcome of the specified DKIM evaluation MUST be otherwise unaffected.",
      "ja": "レポートジェネレータは、その検証何らかの理由で失敗した各DKIM署名ヘッダフィールドに、以下のアルゴリズム、またはそれと意味的に同等のものを適用しなければなりません。この処理は、唯一のレポート拡張機能として行われることに注意してください。指定されたDKIM評価の結果は、それ以外の場合は影響を受けなければなりません。"
    },
    {
      "indent": 3,
      "text": "1. If the DKIM-Signature field did not contain a valid \"r=\" tag, terminate.",
      "ja": "DKIM署名フィールドに有効な「R =」タグが含まれていなかった場合は1、終了します。"
    },
    {
      "indent": 3,
      "text": "2. Issue a [DNS] TXT query to the name that results from appending the value of the \"d=\" tag in the DKIM-Signature field to the string \"_report._domainkey.\". For example, if the DKIM-Signature header field contains \"d=example.com\", issue a DNS TXT query to \"_report._domainkey.example.com\".",
      "ja": "2.発行列にDKIM署名フィールドに「D =」タグの値付加から生じる名に[DNS] TXTクエリ「_report._domainkeyを」。 DKIM-Signatureヘッダーフィールドは \"D = example.com\" が含まれている場合、例えば、 \"_report._domainkey.example.com\" にDNS TXTクエリを発行します。"
    },
    {
      "indent": 3,
      "text": "3. If the DNS query returns anything other than RCODE 0 (NOERROR), or if multiple TXT records are returned, terminate.",
      "ja": "DNSクエリがRCODE 0（NOERROR）以外のものを返す、または複数のTXTレコードが返された場合は、終了した場合3。"
    },
    {
      "indent": 3,
      "text": "4. If the resultant TXT is in several string fragments, concatenate them as described in Section 3.6.2.2 of [DKIM].",
      "ja": "4.結果TXTは、いくつかの文字列フラグメントである場合は、[DKIM]のセクション3.6.2.2で説明したように、それらを連結。"
    },
    {
      "indent": 3,
      "text": "5. If the TXT content is syntactically invalid (see Section 3.2), terminate.",
      "ja": "5. TXTコンテンツが終了し、（3.2節を参照）構文的に無効である場合。"
    },
    {
      "indent": 3,
      "text": "6. If the reason for the signature evaluation failure does not match one of the report requests found in the \"rr=\" tag (or its default value), terminate.",
      "ja": "6.「RR =」タグ（またはそのデフォルト値）に見られる報告要求のいずれかと一致しない署名の評価の失敗の理由は、終了した場合。"
    },
    {
      "indent": 3,
      "text": "7. If a report percentage (\"rp=\") tag was present, select a random number between 0 and 99, inclusive; if the selected number is not lower than the tag's value, terminate.",
      "ja": "7.レポートの割合が（「RP =」）タグが存在し、0と99の間の乱数を選択した場合、包括。選択した番号は、タグの値を下回っていない場合は、終了します。"
    },
    {
      "indent": 3,
      "text": "8. If no \"ra=\" tag was present, skip this step and the next one. Otherwise, determine the reporting address by extracting the value of the \"ra=\" tag and appending to it an \"@\" followed by the domain name found in the \"d=\" tag of the DKIM-Signature header field.",
      "ja": "8.ない「RA =」タグは、この手順と次のスキップ、存在しなかった場合。そうでない場合は、DKIM-Signatureヘッダーフィールドの「D =」タグに見られるドメイン名に続いて「@」を「RA =」タグの値を抽出し、それに追加することによって報告アドレスを決定します。"
    },
    {
      "indent": 3,
      "text": "9. Construct and send a report in compliance with Section 6 of this document that includes as its intended recipient the address constructed in the previous step.",
      "ja": "9.構築し、その目的の受信者として、前のステップで構築されたアドレスを含んでいるこのドキュメントのセクション6に準拠したレポートを送信。"
    },
    {
      "indent": 3,
      "text": "10. If the [SMTP] session during which the DKIM signature was evaluated is still active and the SMTP server has not already given its response to the DATA command that relayed the message, and an \"rs=\" tag was present in the TXT record, the SMTP server SHOULD include the decoded string found in the \"rs=\" tag in its SMTP reply to the DATA command.",
      "ja": "10. DKIM署名を評価し、その間に[SMTP]セッションがまだアクティブであるとSMTPサーバが既にメッセージを中継DATAコマンドに対する応答を与えられていない、と「RS =」タグは、TXTレコードに存在した場合、SMTPサーバーは、DATAコマンドへのSMTP応答で「RS =」タグで見つかったデコードされた文字列を含むべきです。"
    },
    {
      "indent": 3,
      "text": "In order to thwart attacks that seek to convert report generators into unwitting denial-of-service attack participants, a report generator SHOULD NOT issue more than one report to any given domain as a result of a single message. Further, a report generator SHOULD establish an upper bound on the number of reports a single message can generate overall. For example, a message with three invalid signatures, two from example.com and one from example.net, would generate at most one report to each of those domains.",
      "ja": "無意識のサービス拒否攻撃参加者にレポートジェネレータを変換しようと攻撃を阻止するためには、レポートジェネレータは、単一のメッセージの結果として、任意のドメインに複数のレポートを発行するべきではありません。さらに、レポートジェネレータは、単一のメッセージが、全体的に生成できるレポートの数の上限を確立すべきです。例えば、3人の無効な署名、example.comおよびexample.netから1から2つのメッセージは、これらのドメインの各々に最大1つのレポートを生成します。"
    },
    {
      "indent": 3,
      "text": "This algorithm has the following advantages over previous pre-standardization implementations, such as early versions of [OPENDKIM]:",
      "ja": "このアルゴリズムは、[OPENDKIM]の初期バージョンとして以前プリ標準実装、上次のような利点を有します。"
    },
    {
      "indent": 3,
      "text": "a. If the DKIM signature fails to verify, no additional DNS check is made to see if reporting is requested; the request is active in that it is included in the DKIM-Signature header field. (Previous implementations included the reporting address in the DKIM key record, which is not queried for certain failure cases. This meant, for full reporting, that the key record had to be retrieved even when it was not otherwise necessary.)",
      "ja": "A。 DKIM署名を検証するために失敗した場合、追加のDNSチェックは、報告が要求されているかどうかを確認するために行われません。それはDKIM署名ヘッダフィールドに含まれているという点で要求がアクティブです。 （以前の実装は、キーレコードは、それがそうでなければ必要ではなかった場合でも、検索されなければならなかったこと。これが意味するもの、完全な報告のため、一定の障害のケースのために照会されていないDKIMキーレコード、中レポーティングアドレスを含みます。）"
    },
    {
      "indent": 3,
      "text": "b. The request is confirmed by the presence of a corresponding TXT record in the DNS, since the Signer thus provides the parameters required to construct and send the report. This means a malicious Signer cannot falsely assert that someone else wants failure reports and cause unwanted mail to be generated. It can cause additional DNS traffic against the domain listed in the \"d=\" signature tag, but negative caching of the requested DNS record will help to mitigate this issue.",
      "ja": "B。署名者は、このように報告書を作成し、送信するために必要なパラメータを提供するので、要求は、DNSに対応するTXTレコードの存在によって確認されました。これは、悪意のある署名者が誤って他の誰かが障害レポートを望んでいると主張し、不要なメールを生成させることができないことを意味します。それは、この問題を軽減するのに役立ちます要求されたDNSレコードの「D =」署名タグに記載されているドメインが、ネガティブキャッシュに対して追加のDNSトラフィックを引き起こす可能性があります。"
    },
    {
      "indent": 3,
      "text": "c. It is not possible for a Signer to direct reports to an email address outside of its own domain, preventing distributed email-based denial-of-service attacks.",
      "ja": "C。署名者は、分散型電子メールベースのDoS攻撃を防ぐ、独自のドメイン外のメールアドレスにレポートを指示することはできません。"
    },
    {
      "indent": 3,
      "text": "See Section 8.4 for some considerations regarding limitations of this mechanism.",
      "ja": "このメカニズムの限界に関するいくつかの考慮事項については、セクション8.4を参照してください。"
    },
    {
      "indent": 0,
      "text": "4. Optional Reporting Address for DKIM ADSP",
      "section_title": true,
      "ja": "DKIM ADSP 4.オプションのレポート住所"
    },
    {
      "indent": 3,
      "text": "A domain name owner employing Author Domain Signing Practices [ADSP] may also want to know when messages are received without valid author domain signatures. Currently, there is no such mechanism defined.",
      "ja": "著者ドメイン署名プラクティスを採用し、ドメイン名の所有者[ADSP]もメッセージが有効な著者のドメイン署名なしで受信されたときに知りたいことがあります。現在、定義されたそのようなメカニズムはありません。"
    },
    {
      "indent": 3,
      "text": "This section adds the following optional \"tags\" (as defined in [ADSP]) to the DKIM ADSP records, using the form defined in that specification:",
      "ja": "このセクションでは、その仕様で定義されたフォームを使用して、DKIMのADSPレコードへ（[ADSP]で定義されるように）、以下のオプションの「タグ」を追加します。"
    },
    {
      "indent": 3,
      "text": "ra= Reporting Address (plain-text; OPTIONAL; no default). The value MUST be a dkim-quoted-printable string containing the local-part of an email address to which a report SHOULD be sent when mail claiming to be from this domain failed the verification algorithm described in [ADSP], in particular because a message arrived without a signature that validates, which contradicts what the ADSP record claims. The value MUST be interpreted as a local-part only. To construct the actual address to which the report is sent, the Verifier simply appends to this value an \"@\" followed by the domain whose policy was queried in order to evaluate the sender's ADSP, i.e., the RFC5322.From domain of the message under evaluation. Therefore, a Signer making use of this extension tag MUST ensure that an email address thus constructed can receive reports generated as described in Section 6.",
      "ja": "RA =レポーティングアドレス（平文;オプション;デフォルトなし）。値は、このドメインからのものであると主張したメールは[ADSP]で説明した検証アルゴリズムを失敗したときにレポートが特に理由のメッセージ、送ってくださいする電子メールアドレスのローカル部分を含むDKIM-quoted-printableの文字列でなければなりません何ADSPレコードの主張と矛盾た、検証署名なしで到着しました。値は、ローカルの部分として解釈されなければなりません。レポートを送信するために実際のアドレスを構築するために、Verifierは単につまり、この値にそのポリシー、送信者のADSPを評価するために、照会されたドメインに続いて「@」を追加し、メッセージのRFC5322.Fromドメインの下評価。したがって、この拡張タグの署名者を作る使用は、このように構成された電子メールアドレスは、セクション6で説明したように生成されたレポートを受信できることを保証しなければなりません。"
    },
    {
      "indent": 6,
      "text": "ABNF:",
      "ja": "ABNF："
    },
    {
      "indent": 6,
      "text": "adsp-ra-tag = %x72.61 *WSP \"=\" dkim-quoted-printable ; \"ra=...\" (lower-case only for the tag name)",
      "ja": "ADSP-RA-タグ=％のx72.61 * WSP \"=\" DKIMは、quoted-printable形式。 「RA = ...」（唯一のタグ名の小文字）"
    },
    {
      "indent": 3,
      "text": "rp= Requested Report Percentage (plain-text; OPTIONAL; default is \"100\"). The value is a single integer from 0 to 100 inclusive that indicates what percentage of incidents of ADSP evaluation failures, selected at random, are to cause reports to be generated. The report generator SHOULD NOT issue reports for more than the requested percentage of incidents. An exception to this might be some out-of-band arrangement between two parties to override it with some mutually agreed value. Report generators MAY make use of the \"Incidents:\" field in [ARF] to indicate that there are more reportable incidents than there are reports.",
      "ja": "RP =要求されたレポートの割合（平文;オプション;デフォルトである「100」）。値がランダムに選択ADSP評価障害の事件の何パーセント、示し包括0から100までの単一の整数である、生成されるレポートを引き起こすことがあります。レポート・ジェネレータは、事件の要求された割合よりも多くのレポートを発行するべきではありません。この例外は、いくつかの相互に合意した値で上書きするには、2つの当事者間のいくつかのアウトオブバンド配置であるかもしれません。報告があるよりも多くの報告事件があることを示すために、[ARF]フィールド：レポートジェネレータは、「インシデント」を利用することができます。"
    },
    {
      "indent": 6,
      "text": "ABNF:",
      "ja": "ABNF："
    },
    {
      "indent": 6,
      "text": "adsp-rp-tag = %x72.70 *WSP \"=\" *WSP 1*3DIGIT ; \"rp=...\" (lower-case only)",
      "ja": "ADSP-RP-タグ=％のx72.70 * WSP \"=\" * WSP 1 * 3DIGIT。 \"RP = ...\"（小文字のみ）"
    },
    {
      "indent": 3,
      "text": "rr= Requested Reports (plain-text; OPTIONAL; default is \"all\"). The value MUST be a colon-separated list of tokens representing those conditions under which a report is desired. See Section 5.2 for a list of valid tokens.",
      "ja": "RR =レポート要求（;オプション;プレーンテキストのデフォルトは「すべて」です）。値は、レポートが望まれるの下、これらの条件を表すトークンのコロンで区切られたリストでなければなりません。有効なトークンのリストについては、5.2節を参照してください。"
    },
    {
      "indent": 6,
      "text": "ABNF:",
      "ja": "ABNF："
    },
    {
      "indent": 6,
      "text": "adsp-rr-type = ( \"all\" / \"o\" / \"p\" / \"s\" / \"u\" ) adsp-rr-tag = %x72.72 *WSP \"=\" *WSP adsp-rr-type *WSP *( \":\" *WSP adsp-rr-type ) ; \"rr=...\" (lower-case only for the tag name)",
      "ja": "ADSP-RR型=（ \"全て\" / \"O\" / \"P\" / \"S\" / \"U\"）ADSP-RR-タグ=％のx72.72 * WSP \"=\" * WSPのADSP-RR型* WSP *（ \"：\" * WSPのADSP-RR型）; 「RR = ...」（唯一のタグ名の小文字）"
    },
    {
      "indent": 3,
      "text": "rs= Requested SMTP Error String (plain-text; OPTIONAL; no default). The value is a string the signing domain requests be included in [SMTP] error strings when messages are rejected during a single SMTP session.",
      "ja": "RS =要求されたSMTPエラー文字列（平文;オプション;デフォルトなし）。値は、メッセージが単一のSMTPセッション中に拒否された場合、署名ドメイン要求は、[SMTP]エラー文字列に含まれる文字列です。"
    },
    {
      "indent": 6,
      "text": "ABNF:",
      "ja": "ABNF："
    },
    {
      "indent": 6,
      "text": "adsp-rs-tag = %x72.73 *WSP \"=\" dkim-quoted-printable ; \"rs=...\" (lower-case only for the tag name)",
      "ja": "ADSP-RS-タグ=％のx72.73は* WSP \"=\" DKIM-quoted-printableの。 「RS = ...」（小文字のみのタグ名用）"
    },
    {
      "indent": 3,
      "text": "In the absence of an \"ra=\" tag, the \"rp=\" and \"rr=\" tags MUST be ignored, and the report generator MUST NOT issue a report.",
      "ja": "「RA =」タグがない場合には、「RPは=」と「RR =」タグは無視されなければならない、とレポートジェネレータは、レポートを発行してはいけません。"
    },
    {
      "indent": 0,
      "text": "5. Requested Reports",
      "section_title": true,
      "ja": "5.要求されたレポート"
    },
    {
      "indent": 3,
      "text": "The \"rr\" tags defined above allow a Signer to specify the types of errors about which it is interested in receiving reports. This section defines the error types and corresponding token values.",
      "ja": "上記で定義された「RR」のタグが署名者は、それが報告を受けに興味があるかについて、エラーの種類を指定することができます。このセクションでは、エラーの種類と対応するトークン値を定義します。"
    },
    {
      "indent": 3,
      "text": "Verifiers MUST NOT generate reports for incidents that do not match a requested report and MUST ignore requests for reports not included in this list.",
      "ja": "検証者は、要求された報告書と一致しないと、このリストに含まれていないレポートの要求を無視しなければなりませんインシデントのレポートを生成してはなりません。"
    },
    {
      "indent": 0,
      "text": "5.1. Requested Reports for DKIM Failures",
      "section_title": true,
      "ja": "5.1.  DKIM障害に対する要求されたレポート"
    },
    {
      "indent": 3,
      "text": "The following report requests are defined for DKIM keys:",
      "ja": "次のレポート要求は、DKIMキーに対して定義されています。"
    },
    {
      "indent": 3,
      "text": "all All reports are requested.",
      "ja": "すべてすべてのレポートは要求されています。"
    },
    {
      "indent": 3,
      "text": "d Reports are requested for signature evaluation errors that resulted from DNS issues (e.g., key retrieval problems).",
      "ja": "Dレポートは、DNSの問題（例えば、キー検索の問題）から得られた署名評価エラーが要求されています。"
    },
    {
      "indent": 3,
      "text": "o Reports are requested for any reason related to DKIM signature evaluation not covered by other report requests listed here.",
      "ja": "Oレポートは、ここに記載されているその他のレポートの要求によってカバーされていないDKIM署名の評価に関連した何らかの理由で要求されています。"
    },
    {
      "indent": 3,
      "text": "p Reports are requested for signatures that are rejected for local policy reasons at the Verifier that are related to DKIM signature evaluation.",
      "ja": "Pのレポートは、DKIM署名評価に関連した検証でローカルポリシーの理由で拒否されている署名のために要求されています。"
    },
    {
      "indent": 3,
      "text": "s Reports are requested for signature or key syntax errors.",
      "ja": "sのレポートは、署名またはキー構文エラーのために要求されています。"
    },
    {
      "indent": 3,
      "text": "u Reports are requested for signatures that include unknown tags in the signature field.",
      "ja": "Uレポートは署名フィールドで未知のタグが含まれる署名を要求されています。"
    },
    {
      "indent": 3,
      "text": "v Reports are requested for signature verification failures or body hash mismatches.",
      "ja": "Vレポートは、署名検証の障害や体のハッシュの不一致のために要求されています。"
    },
    {
      "indent": 3,
      "text": "x Reports are requested for signatures rejected by the Verifier because the expiration time has passed.",
      "ja": "Xレポートは、有効期限が過ぎているため、検証によって拒否され、署名のために要求されています。"
    },
    {
      "indent": 0,
      "text": "5.2. Requested Reports for DKIM ADSP Failures",
      "section_title": true,
      "ja": "5.2.  DKIMのADSP障害のために要求されたレポート"
    },
    {
      "indent": 3,
      "text": "The following report requests are defined for ADSP records:",
      "ja": "次のレポート要求は、ADSPレコードのために定義されています。"
    },
    {
      "indent": 3,
      "text": "all All reports are requested.",
      "ja": "すべてすべてのレポートは要求されています。"
    },
    {
      "indent": 3,
      "text": "o Reports are requested for any [ADSP]-related failure reason not covered by other report requests listed here.",
      "ja": "Oレポートは、ここに記載されているその他のレポートの要求によってカバーされていない[ADSP]関連の失敗の理由のために要求されています。"
    },
    {
      "indent": 3,
      "text": "p Reports are requested for messages that are rejected for local policy reasons at the Verifier that are related to [ADSP].",
      "ja": "Pのレポートは、[ADSP]に関連した検証でローカルポリシーの理由で拒否されたメッセージのために要求されています。"
    },
    {
      "indent": 3,
      "text": "s Reports are requested for messages that have a valid [DKIM] signature but do not match the published [ADSP] policy.",
      "ja": "sのレポートは、有効な[DKIM]の署名を持っていますが、公開[ADSP]ポリシーに一致しないメッセージのために要求されています。"
    },
    {
      "indent": 3,
      "text": "u Reports are requested for messages that have no valid [DKIM] signature and do not match the published [ADSP] policy.",
      "ja": "uのレポートは、有効な[DKIM]の署名を持っていないと公表[ADSP]ポリシーに一致しないメッセージのために要求されています。"
    },
    {
      "indent": 0,
      "text": "6. Report Generation",
      "section_title": true,
      "ja": "6.レポートの生成"
    },
    {
      "indent": 3,
      "text": "This section describes the process for generating and sending reports in accordance with the request of the Signer and/or sender as described above.",
      "ja": "このセクションでは、前述のように署名者及び/又は送信者の要求に応じてレポートを生成し、送信するための方法が記載されています。"
    },
    {
      "indent": 0,
      "text": "6.1. Report Format",
      "section_title": true,
      "ja": "6.1. レポート形式"
    },
    {
      "indent": 3,
      "text": "All reports generated as a result of requests contained in these extension parameters MUST be generated in compliance with [ARF] and its extension specific to this work, [ARF-AUTHFAIL]. Moreover, because abuse reports from unverified sources might be handled with some skepticism, report generators are strongly advised to use [DKIM] to sign reports they generate.",
      "ja": "すべてのレポートは、これらの拡張パラメータ[ARF]に準拠して生成されなければならないとこの仕事に固有の拡張子、[ARF-AUTHFAIL]に含まれる要求の結果として発生しました。未検証のソースからの虐待の報告がいくつか懐疑的に扱われるかもしれないので、また、レポートジェネレータが強く、彼らが生成するレポートに署名する[DKIM]を使用することをお勧めします。"
    },
    {
      "indent": 0,
      "text": "6.2. Other Guidance",
      "section_title": true,
      "ja": "6.2. その他のご案内"
    },
    {
      "indent": 3,
      "text": "Additional guidance about the generation of these reports can be found in [ARF-AS], especially in Section 6.",
      "ja": "これらのレポートの生成に関する追加のガイダンスは、特に第6節では、[ARF-AS]で見つけることができます。"
    },
    {
      "indent": 0,
      "text": "7. IANA Considerations",
      "section_title": true,
      "ja": "7. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "As required by [IANA-CONS], this section contains registry information for the new [DKIM] signature tags and for the new [ADSP] tags. It also creates a DKIM reporting tag registry.",
      "ja": "[IANA-CONS]で必要に応じて、このセクションでは、新しい[DKIM]署名タグおよび新しい[ADSP]タグのレジストリ情報が含まれています。また、DKIM報告タグレジストリを作成します。"
    },
    {
      "indent": 0,
      "text": "7.1. DKIM Signature Tag Registration",
      "section_title": true,
      "ja": "7.1.  DKI署名タグ登録"
    },
    {
      "indent": 3,
      "text": "IANA has added the following item to the DKIM Signature Tag Specifications registry:",
      "ja": "IANAはDKIM署名タグ仕様レジストリに以下の項目を追加しました："
    },
    {
      "indent": 17,
      "text": "+------+-----------------+--------+\n| TYPE | REFERENCE       | STATUS |\n+------+-----------------+--------+\n| r    | (this document) | active |\n+------+-----------------+--------+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "7.2. DKIM ADSP Tag Registration",
      "section_title": true,
      "ja": "7.2.  DKIM ADSPタグの登録"
    },
    {
      "indent": 3,
      "text": "IANA has added the following items to the DKIM ADSP Specification Tags registry:",
      "ja": "IANAはDKIM ADSP仕様タグレジストリに以下の項目を追加しました："
    },
    {
      "indent": 17,
      "text": "+------+-----------------+\n| TYPE | REFERENCE       |\n+------+-----------------+\n| ra   | (this document) |\n| rp   | (this document) |\n| rr   | (this document) |\n| rs   | (this document) |\n+------+-----------------+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "7.3. DKIM Reporting Tag Registry",
      "section_title": true,
      "ja": "7.3.  DKIレポートタグのレジストリ"
    },
    {
      "indent": 3,
      "text": "IANA has created a sub-registry of the DKIM Parameters registry called \"DKIM Reporting Tag Registry\". Additions to this registry follow the \"Specification Required\" rules, with the following columns required for all registrations:",
      "ja": "IANAは、「DKIMタグレジストリのレポート」と呼ばれるDKIMパラメータレジストリのサブレジストリを作成しました。このレジストリへの追加は、すべての登録に必要な次の列で、「仕様が必要である」というルールに従います。"
    },
    {
      "indent": 3,
      "text": "Tag: The name of the tag being used in reporting records",
      "ja": "タグ：タグの名前は、レポートのレコードに使用されています"
    },
    {
      "indent": 3,
      "text": "Reference: The document that specifies the tag being defined",
      "ja": "参考：タグを指定する文書が定義されています"
    },
    {
      "indent": 3,
      "text": "Status: The status of the tag's current use -- either \"active\" indicating active use, or \"historic\" indicating discontinued or deprecated use",
      "ja": "状態：タグの現在の使用状況 - のいずれかの「アクティブ」アクティブな使用を示す、または「歴史的」廃止または非推奨の使用を示します"
    },
    {
      "indent": 3,
      "text": "The initial registry entries are as follows:",
      "ja": "次のように初期のレジストリエントリは次のとおりです。"
    },
    {
      "indent": 17,
      "text": "+-----+-----------------+--------+\n| TAG | REFERENCE       | STATUS |\n+-----+-----------------+--------+\n| ra  | (this document) | active |\n| rp  | (this document) | active |\n| rr  | (this document) | active |\n| rs  | (this document) | active |\n+-----+-----------------+--------+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "8. Security Considerations",
      "section_title": true,
      "ja": "8.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "Security issues with respect to these reports are similar to those found in [DSN].",
      "ja": "これらの報告に関して、セキュリティ上の問題は、[DSN]で見つかったものと同様です。"
    },
    {
      "indent": 0,
      "text": "8.1. Inherited Considerations",
      "section_title": true,
      "ja": "8.1. 継承の考慮事項"
    },
    {
      "indent": 3,
      "text": "Implementers are advised to consider the Security Considerations sections of [DKIM], [ADSP], [ARF-AS], and [ARF-AUTHFAIL]. Many security issues related to this document are already covered in those documents.",
      "ja": "実装者は、[DKIM]、[ADSP]、[ARF-AS]、および[ARF-AUTHFAIL]のセキュリティの考慮事項のセクションを検討することをお勧めします。このドキュメントに関連する多くのセキュリティ上の問題は、すでにそれらの文書で説明されています。"
    },
    {
      "indent": 0,
      "text": "8.2. Report Volume",
      "section_title": true,
      "ja": "8.2. レポートボリューム"
    },
    {
      "indent": 3,
      "text": "It is impossible to predict the volume of reports this facility will generate when enabled by a report receiver. An implementer ought to anticipate substantial volume, since the amount of abuse occurring at receivers cannot be known ahead of time, and may vary rapidly and unpredictably.",
      "ja": "レポートの受信機では有効になったときに、この機能は生成されたレポートの量を予測することは不可能です。実装は、受信機で発生する乱用の量は前もって知ることができない、迅速かつ予測不能に変化することができるので、実質的な量を予測するべきです。"
    },
    {
      "indent": 0,
      "text": "8.3. Deliberate Misuse",
      "section_title": true,
      "ja": "8.3. 故意の誤用"
    },
    {
      "indent": 3,
      "text": "Some threats caused by deliberate misuse of this error-reporting mechanism are discussed in Section 3.3, but they warrant further discussion here.",
      "ja": "このエラー報告機構の意図的な誤用に起因するいくつかの脅威はセクション3.3で説明されているが、ここでさらに議論を保証します。"
    },
    {
      "indent": 3,
      "text": "The presence of the DNS record that indicates willingness to accept reports opens the recipient to abuse. In particular, it is possible for an attacker to attempt to cause a flood of reports toward the domain identified in a signature's \"d=\" tag in one of these ways:",
      "ja": "レポートを受け入れる意向を示してDNSレコードの存在は、虐待に受信者を開きます。特に、これらのいずれかの方法で署名の「D =」タグに同定されたドメインに向けた報告書の洪水を引き起こすしようとする攻撃者のために可能です："
    },
    {
      "indent": 3,
      "text": "1. Alter existing DKIM-Signature header fields by adding an \"r=y\" tag (and possibly altering the \"d=\" tag to point at the target domain);",
      "ja": "1.アルターが「R = Y」タグを追加（そしておそらくターゲットドメインにおける点「Dは=」タグを変更する）ことにより、DKIM-Signatureヘッダーフィールドを既存の。"
    },
    {
      "indent": 3,
      "text": "2. Add a new but bogus signature bearing an \"r=y\" tag and a \"d=\" tag pointing at the target domain;",
      "ja": "2.「R = Y」タグとターゲットドメインを指し、「D =」タグを担持する新規が、偽の署名を追加します。"
    },
    {
      "indent": 3,
      "text": "3. Generate a completely new message bearing an \"r=y\" tag and a \"d=\" tag pointing at the target domain.",
      "ja": "3.「R = Y」タグとターゲットドメインを指し、「D =」タグを保有する完全に新しいメッセージを生成します。"
    },
    {
      "indent": 3,
      "text": "Consider, for example, the situation where an attacker sends out a multi-million-message spam run and includes in the messages a fake DKIM signature containing \"d=example.com; r=y\". It won't matter that those signatures couldn't possibly be real: each will fail verification, and any implementations that support this specification will report those failures, in the millions and in short order, to example.com.",
      "ja": "例えば、攻撃者は数百万のメッセージスパムランを送信し、メッセージの「; R = Y D = example.com」を含む偽DKIM署名を含む場合を考えます。それぞれが検証に失敗し、この仕様をサポートするすべての実装はexample.comに、何百万人に短いために、それらの障害を報告します。これらの署名はおそらく本当であることができなかったことは問題ないでしょう。"
    },
    {
      "indent": 3,
      "text": "Implementers are therefore strongly advised not to advertise the DNS record specified in this document except when failure reports are desired. Upon doing so, unexpected traffic volumes and attacks should be anticipated.",
      "ja": "実装者は、そのために強く、故障の報告が必要な場合を除いて、この文書で指定されたDNSレコードを宣伝しないことをお勧めします。そうする際に、予想外の交通量と攻撃が予想されなければなりません。"
    },
    {
      "indent": 3,
      "text": "Negative caching offers some protection against this pattern of abuse, although it will work only as long as the negative time-to-live on the relevant SOA record in the DNS.",
      "ja": "それが唯一の限り、負のtime-to-liveのDNS内の関連するSOAレコードのように動作しますが、ネガティブキャッシュは、虐待のこのパターンに対してある程度の保護を提供しています。"
    },
    {
      "indent": 3,
      "text": "Positive caching of this DNS reply also means that turning off the flow of reports by removing the record is not likely to have an immediate effect. A low time-to-live on the record needs to be considered.",
      "ja": "このDNS応答の正のキャッシュはまた、レコードを削除することで、レポートの流れをオフにするとすぐに効果がありそうにないことを意味しています。低タイム・ツー・ライブレコード上を考慮する必要があります。"
    },
    {
      "indent": 0,
      "text": "8.4. Unreported Fraud",
      "section_title": true,
      "ja": "8.4. 報告されていない詐欺"
    },
    {
      "indent": 3,
      "text": "An attacker can craft fraudulent DKIM-Signature fields on messages, without using \"r=\" tags, and avoid having these reported. The procedure described in Section 3.3 does not permit the detection and reporting of such cases.",
      "ja": "攻撃者は、「R =」タグを使用せずに、メッセージの不正DKIM署名フィールドを作る、そしてこれらは、報告を避けることができます。 3.3節で説明する手順は、このような場合の検出と報告を許可していません。"
    },
    {
      "indent": 3,
      "text": "It might be useful to some Signers to receive such reports, but the mechanism does not support it. To offer such support, a Verifier would have to violate the first step in the procedure and continue even in the absence of an \"r=\" tag. Although that would enable the desired report, it would also create a possible denial-of-service attack: such Verifiers would always look for the reporting TXT record, so a generator of fraudulent messages could simply send a large volume of messages without an \"r=\" tag to a number of destinations. To avoid that outcome, reports of fraudulent DKIM-Signature header fields are not possible using the published mechanism.",
      "ja": "それは、このような報告書を受け取るために、いくつかの署名者に役に立つかもしれませんが、メカニズムはそれをサポートしていません。そのようなサポートを提供するために、Verifierは、手順の最初のステップに違反しても、「R =」タグが存在しない状態で継続しなければなりません。こうした検証者は、常に報告TXTレコードを探しますので、詐欺的なメッセージの発電機は、単に「Rせずにメッセージを大量に送信することができ：それは目的のレポートが可能になるであろうが、それはまた、可能サービス拒否攻撃を作成します宛先の数に=」タグ。その結果を避けるために、不正DKIM-Signatureヘッダフィールドの報告書は公表メカニズムを使用できません。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "ja": "9.参考文献"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "ja": "9.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[ABNF] Crocker, D., Ed., and P. Overell, \"Augmented BNF for Syntax Specifications: ABNF\", RFC 5234, January 2008.",
      "ja": "\"構文仕様のための増大しているBNF：ABNF\" [ABNF]クロッカー、D.、エド、およびP. Overell、。、RFC 5234、2008年1月。"
    },
    {
      "indent": 3,
      "text": "[ADSP] Allman, E., Fenton, J., Delany, M., and J. Levine, \"DomainKeys Identified Mail (DKIM) Author Domain Signing Practices (ADSP)\", RFC 5617, August 2009.",
      "ja": "【ADSP】オールマン、E.、フェントン、J.、デラニー、M.、およびJ.レヴァイン、 \"ドメインキー・アイデンティファイド・メール（DKIM）著ドメイン署名プラクティス（ADSP）\"、RFC 5617、2009年8月。"
    },
    {
      "indent": 3,
      "text": "[ARF] Shafranovich, Y., Levine, J., and M. Kucherawy, \"An Extensible Format for Email Feedback Reports\", RFC 5965, August 2010.",
      "ja": "[ARF] Shafranovich、Y.、レヴァイン、J.、およびM. Kucherawy、 \"電子メールのフィードバックレポートの拡張フォーマット\"、RFC 5965、2010年8月。"
    },
    {
      "indent": 3,
      "text": "[ARF-AS] Falk, J. and M. Kucherawy, Ed., \"Creation and Use of Email Feedback Reports: An Applicability Statement for the Abuse Reporting Format (ARF)\", RFC 6650, June 2012.",
      "ja": "[ARF-AS]フォーク、J.とM. Kucherawy、エド、 \"電子メールのフィードバックレポートの作成と使用：虐待の報告フォーマット（ARF）のための適用性に関する声明\"。、RFC 6650、2012年6月。"
    },
    {
      "indent": 3,
      "text": "[ARF-AUTHFAIL] Fontana, H., \"Authentication Failure Reporting Using the Abuse Reporting Format\", RFC 6591, April 2012.",
      "ja": "[ARF-AUTHFAIL]フォンタナ、H.、 \"フォーマットを不正使用の報告を使用して認証失敗報告\"、RFC 6591、2012年4月。"
    },
    {
      "indent": 3,
      "text": "[DKIM] Crocker, D., Ed., Hansen, T., Ed., and M. Kucherawy, Ed., \"DomainKeys Identified Mail (DKIM) Signatures\", RFC 6376, September 2011.",
      "ja": "[DKIM]クロッカー、D.、編、ハンセン、T.編、及びM. Kucherawy、エド。、 \"ドメインキー・アイデンティファイド・メール（DKIM）署名\"、RFC 6376、2011年9月。"
    },
    {
      "indent": 3,
      "text": "[DNS] Mockapetris, P., \"Domain names - implementation and specification\", STD 13, RFC 1035, November 1987.",
      "ja": "[DNS] Mockapetris、P.、 \"ドメイン名 - 実装及び仕様\"、STD 13、RFC 1035、1987年11月。"
    },
    {
      "indent": 3,
      "text": "[EMAIL-ARCH] Crocker, D., \"Internet Mail Architecture\", RFC 5598, July 2009.",
      "ja": "[EMAIL-ARCH]クロッカー、D.、 \"インターネットメールのアーキテクチャ\"、RFC 5598、2009年7月。"
    },
    {
      "indent": 3,
      "text": "[IANA-CONS] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 5226, May 2008.",
      "ja": "[IANA-CONS] Narten氏、T.とH. Alvestrand、 \"RFCsにIANA問題部に書くためのガイドライン\"、BCP 26、RFC 5226、2008年5月。"
    },
    {
      "indent": 3,
      "text": "[KEYWORDS] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[キーワード]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[SMTP] Klensin, J., \"Simple Mail Transfer Protocol\", RFC 5321, October 2008.",
      "ja": "[SMTP] Klensin、J.、 \"簡易メール転送プロトコル\"、RFC 5321、2008年10月。"
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "ja": "9.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[DSN] Moore, K. and G. Vaudreuil, \"An Extensible Message Format for Delivery Status Notifications\", RFC 3464, January 2003.",
      "ja": "[DSN]ムーア、K.とG.ボードルイ、 \"配送状態通知のための広げることができるメッセージフォーマット\"、RFC 3464、2003年1月。"
    },
    {
      "indent": 3,
      "text": "[OPENDKIM] Kucherawy, M., \"OpenDKIM -- Open Source DKIM Library and Filter\", August 2009, <http://www.opendkim.org>.",
      "ja": "[OPENDKIM] Kucherawy、M.、 \"OpenDKIM  - オープンソースDKIM図書館やフィルター\"、2009年8月、<http://www.opendkim.org>。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Acknowledgements",
      "ja": "付録A.謝辞"
    },
    {
      "indent": 3,
      "text": "The author wishes to acknowledge the following for their review and constructive criticism of this proposal: Steve Atkins, Monica Chew, Dave Crocker, Tim Draegen, Frank Ellermann, J.D. Falk, John Levine, Scott Kitterman, and Andrew Sullivan.",
      "ja": "スティーブ・アトキンス、モニカはチュー、デイブ・クロッカー、ティムDraegen、フランクEllermann、J.D.フォーク、ジョン・レヴァイン、スコットKitterman、そしてアンドリュー・サリバン：作者は彼らのレビューとこの提案の建設的な批判のために、次を確認したいです。"
    },
    {
      "indent": 0,
      "text": "Appendix B. Examples",
      "ja": "付録B.例"
    },
    {
      "indent": 3,
      "text": "This section contains examples of the use of each of the extensions defined by this document.",
      "ja": "このセクションでは、この文書で定義された拡張子のそれぞれの使用例が含まれています。"
    },
    {
      "indent": 0,
      "text": "B.1. Example Use of DKIM Signature Extension Tag",
      "ja": "B.1。 DKIM署名の拡張タグの使用例"
    },
    {
      "indent": 3,
      "text": "This example shows a DKIM-Signature field using the extension tag defined by this document:",
      "ja": "この例では、このドキュメントによって定義された拡張タグを使用して、DKIM署名フィールドを示しています。"
    },
    {
      "indent": 7,
      "text": "DKIM-Signature: v=1; a=rsa-sha256; c=simple/simple;\n        d=example.com; s=jan2012; r=y;\n        h=from:to:subject:date:message-id;\n        bh=YJAYwiNdc3wMh6TD8FjVhtmxaHYHo7Z/06kHQYvQ4tQ=;\n        b=jHF3tpgqr6nH/icHKIqFK2IJPtCLF0CRJaz2Hj1Y8yNwTJ\n          IMYIZtLccho3ymGF2GYqvTl2nP/cn4dH+55rH5pqkWNnuJ\n          R9z54CFcanoKKcl9wOZzK9i5KxM0DTzfs0r8",
      "raw": true
    },
    {
      "indent": 11,
      "text": "Example 1: DKIM-Signature Field Using This Extension",
      "ja": "例1：この拡張機能を使用するDKIM署名フィールド"
    },
    {
      "indent": 3,
      "text": "This example DKIM-Signature field contains the \"r=\" tag that indicates reports are requested on verification failure.",
      "ja": "この例でDKIM署名フィールドは、報告書は、検証失敗時に要求されていることを示し、「R =」タグが含まれています。"
    },
    {
      "indent": 3,
      "text": "Assuming the public key retrieved from the DNS and processed according to [DKIM] would determine that the signature is invalid, a TXT query will be sent to \"_report._domainkey.example.com\" to retrieve a reporting address and other report parameters as described in Section 3.3.",
      "ja": "説明したように公開鍵DNSから取得され、[DKIM]に従って処理が署名が無効であることを決定するであろうと仮定すると、TXTクエリレポートアドレスと他のレポート・パラメータを取得するために「_report._domainkey.example.com」に送信されますセクション3.3インチ"
    },
    {
      "indent": 0,
      "text": "B.2. Example DKIM Reporting TXT Record",
      "ja": "B.2。例DKIMは、TXTレコードの報告"
    },
    {
      "indent": 3,
      "text": "An example DKIM Reporting TXT record as defined by this document is as follows:",
      "ja": "次のように、この文書で定義されている例DKIM報告TXTレコードは次のとおりです。"
    },
    {
      "indent": 7,
      "text": "ra=dkim-errors; rp=100; rr=v:x",
      "ja": "RA = DKIM-エラー。 RP = 100; RR = VのX："
    },
    {
      "indent": 14,
      "text": "Example 2: Example DKIM Reporting TXT Record",
      "ja": "例2：例DKIMは、TXTレコードの報告"
    },
    {
      "indent": 3,
      "text": "This example, continuing from the previous one, shows a message that might be found at \"_report._domainkey.example.com\" in a TXT record. It makes the following requests:",
      "ja": "この例では、前回の1から引き続き、TXTレコードで「_report._domainkey.example.com」で発見される可能性がありますメッセージが表示されます。これは、次の要求を行います。"
    },
    {
      "indent": 3,
      "text": "o Reports about signature evaluation failures should be sent to the address \"dkim-errors\" at the Signer's domain;",
      "ja": "O署名評価の失敗についてのレポートは、署名者のドメインのアドレス「DKIM-エラー」に送信する必要があります。"
    },
    {
      "indent": 3,
      "text": "o All incidents (100%) should be reported;",
      "ja": "Oすべてのインシデント（100％）が報告されるべきです。"
    },
    {
      "indent": 3,
      "text": "o Only reports about signature verification failures and expired signatures should be generated.",
      "ja": "Oのみ署名検証の失敗について報告し、期限切れの署名が生成されなければなりません。"
    },
    {
      "indent": 0,
      "text": "B.3. Example Use of DKIM ADSP Extension Tags",
      "ja": "B.3。 DKIM ADSP拡張タグの使用例"
    },
    {
      "indent": 3,
      "text": "This example shows a DKIM ADSP record using the extensions defined by this document:",
      "ja": "この例では、この文書で定義された拡張機能を使用してDKIM ADSPレコードを示しています。"
    },
    {
      "indent": 7,
      "text": "dkim=all; ra=dkim-adsp-errors; rr=u",
      "ja": "DKIM =すべて; RA = DKIM-ADS-エラー。 RR ="
    },
    {
      "indent": 12,
      "text": "Example 3: DKIM ADSP Record Using These Extensions",
      "ja": "例3：これらの拡張機能を使用したDKIM ADSP録音"
    },
    {
      "indent": 3,
      "text": "This example ADSP record makes the following assertions:",
      "ja": "この例ではADSPレコードは、次のアサーションを行います"
    },
    {
      "indent": 3,
      "text": "o The sending domain (i.e., the one that is advertising this policy) signs all mail it sends;",
      "ja": "送信ドメインO（すなわち、このポリシーをアドバタイズしている1）は、それが送信するすべてのメールに署名します。"
    },
    {
      "indent": 3,
      "text": "o Reports about ADSP evaluation failures should be sent to the address \"dkim-adsp-errors\" at the Author's domain;",
      "ja": "O ADSP評価障害に関する報告は著者のドメインのアドレス「DKIM-ADSP-エラー」に送信する必要があります。"
    },
    {
      "indent": 3,
      "text": "o Only reports about unsigned messages should be generated.",
      "ja": "Oのみ生成されるべき符号なしのメッセージについて報告します。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Murray S. Kucherawy Cloudmark 128 King St., 2nd Floor San Francisco, CA 94107 US",
      "ja": "マレーS. Kucherawy Cloudmarkの128キングセント、2階サンフランシスコ、CA 94107米国"
    },
    {
      "indent": 3,
      "text": "Phone: +1 415 946 3800 EMail: superuser@gmail.com",
      "ja": "電話：+1 415 946 3800 Eメール：superuser@gmail.com"
    }
  ]
}