{
  "title": {
    "text": "RFC 6903 - Additional Link Relation Types",
    "ja": "RFC 6903 - 追加のリンク関係の種類"
  },
  "number": 6903,
  "created_at": "2019-11-01 09:38:51.983610+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Independent Submission                                          J. Snell\nRequest for Comments: 6903                                    March 2013\nCategory: Informational\nISSN: 2070-1721",
      "raw": true
    },
    {
      "indent": 21,
      "text": "Additional Link Relation Types",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This specification defines a number of additional link relation types that can used for a range of purposes in a variety of applications types.",
      "ja": "この仕様では、アプリケーションの種類の様々な目的の範囲のために使用できる追加のリンク関係の種類の数を定義します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This is a contribution to the RFC Series, independently of any other RFC stream. The RFC Editor has chosen to publish this document at its discretion and makes no statement about its value for implementation or deployment. Documents approved for publication by the RFC Editor are not a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "これは、独立して、他のRFCストリームの、RFCシリーズへの貢献です。 RFC Editorはその裁量でこの文書を公開することを選択し、実装や展開のためにその値についての声明を出すていません。 RFC編集者によって公表のために承認されたドキュメントは、インターネット標準の任意のレベルの候補ではありません。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6903.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6903で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2013 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2013 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2\n2.  \"about\" . . . . . . . . . . . . . . . . . . . . . . . . . . .   2\n3.  \"preview\" . . . . . . . . . . . . . . . . . . . . . . . . . .   2\n4.  \"privacy-policy\"  . . . . . . . . . . . . . . . . . . . . . .   3\n  4.1.  The \"privacy-policy\" Link Relation and P3P  . . . . . . .   4\n5.  \"terms-of-service\"  . . . . . . . . . . . . . . . . . . . . .   4\n6.  \"type\"  . . . . . . . . . . . . . . . . . . . . . . . . . . .   5\n7.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   5\n8.  Security Considerations . . . . . . . . . . . . . . . . . . .   6\n9.  References  . . . . . . . . . . . . . . . . . . . . . . . . .   6\n  9.1.  Normative References  . . . . . . . . . . . . . . . . . .   6\n  9.2.  Informative References  . . . . . . . . . . . . . . . . .   6",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The fundamental model for web links and the \"Link Relations\" registry are established by [RFC5988]. This specification defines and adds the following additional link relation types to the registry: \"about\", \"preview\", \"privacy-policy\", \"terms-of-service\", and \"type\".",
      "ja": "ウェブリンクや「リンク関係」レジストリのための基本的なモデルは、[RFC5988]によって確立されています。この仕様の定義とレジストリに次の追加リンク関係の種類を追加します。「約」、「プレビュー」、「プライバシーポリシー」、「用語・オブ・サービス」、および「タイプ」。"
    },
    {
      "indent": 0,
      "text": "2. \"about\"",
      "section_title": true,
      "ja": "2.「約」"
    },
    {
      "indent": 3,
      "text": "The \"about\" link relation can be used to refer to a resource that is the subject or topic of the link's context. Multiple subjects can be indicated through the use of multiple \"about\" link relations.",
      "ja": "「約」リンク関係は、リンクのコンテキストの主題またはトピックであるリソースを参照するために使用することができます。複数の被験者は、リンク関係「について」複数を使用して示すことができます。"
    },
    {
      "indent": 3,
      "text": "For example, if the context resource is a review about a particular product, the \"about\" link can be used to reference the URL of the product:",
      "ja": "コンテキストリソースは、特定の商品についてのレビューされている場合、「約」リンクは、製品のURLを参照するために使用することができます。"
    },
    {
      "indent": 5,
      "text": "HTTP/1.1 200 OK Content-Type: application/json Link: <http://store.example.org/product/abc>; rel=\"about\"",
      "ja": "HTTP / 1.1 200 OKのContent-Type：アプリケーション/ JSONのリンク：<http://store.example.org/product/abc>。 \"約\" のrel ="
    },
    {
      "indent": 5,
      "text": "{...}",
      "ja": "｛。。。｝"
    },
    {
      "indent": 0,
      "text": "3. \"preview\"",
      "section_title": true,
      "ja": "3.「プレビュー」"
    },
    {
      "indent": 3,
      "text": "The \"preview\" link relation can be used to refer to a resource that serves as a preview of the link's context, likely with reduced quality or limited content. For instance, the preview link might reference a screen capture of a video, a brief snippet of audio from a song, or a thumbnail representation of an image.",
      "ja": "「プレビュー」リンク関係は、品質低下または制限されたコンテンツを含む可能性が高いリンクのコンテキストのプレビューとして機能するリソースを参照するために使用することができます。例えば、プレビューリンクは、ビデオの画面キャプチャ、歌からの音声を簡単に抜粋、または画像のサムネイル表現を参照することがあります。"
    },
    {
      "indent": 3,
      "text": "For example, issuing an HTTP HEAD request to a URI representing a large video or image file might return a link to a short or lower-quality preview of the original:",
      "ja": "例えば、元の短いまたはより低い品質のプレビューへのリンクを返すことがあり、大きなビデオまたはイメージファイルを表すURIに対するHTTP HEAD要求を発行します。"
    },
    {
      "indent": 5,
      "text": "HTTP/1.1 200 OK Content-Text: video/mpeg Link: <http://example.org/preview/10-second-preview.mpg>; rel=\"preview\"; type=\"video/mpeg\"",
      "ja": "HTTP / 1.1 200 OKコンテンツテキスト：ビデオ/ MPEGリンク：<http://example.org/preview/10-second-preview.mpg>。 REL =「プレビュー」。タイプ= \"ビデオ/ MPEG\""
    },
    {
      "indent": 0,
      "text": "4. \"privacy-policy\"",
      "section_title": true,
      "ja": "4.「プライバシーポリシー」"
    },
    {
      "indent": 3,
      "text": "The \"privacy-policy\" link relation can be used to refer to a resource describing the privacy policy associated with the link's context. The privacy policy can be any resource that discloses what personal information about the user is collected and how that personal information is stored, used, managed, and disclosed to other parties.",
      "ja": "「プライバシーポリシー」リンク関係は、リンクのコンテキストに関連付けられているプラ​​イバシーポリシーを記述したリソースを参照するために使用することができます。プライバシーポリシーは、個人情報が、保存された使用、管理、およびその他の第三者に開示されているものを利用者の個人情報が収集され、どのように記載されている任意のリソースすることができます。"
    },
    {
      "indent": 3,
      "text": "For example, an HTTP server that collects personal information about a user throughout the course of the user's interaction with the service can include \"privacy-policy\" links within all HTTP responses using any combination of Link headers or links embedded in the response payload:",
      "ja": "たとえば、サービスとのユーザの対話の過程を通じて利用者の個人情報を収集するHTTPサーバが応答ペイロードに埋め込まれたリンクヘッダやリンクの任意の組み合わせを使用して、すべてのHTTPレスポンス内の「プライバシーポリシー」のリンクを含めることができます。"
    },
    {
      "indent": 5,
      "text": "HTTP/1.1 200 OK Content-Type: text/html",
      "ja": "HTTP / 1.1 200 OKのContent-Type：text / htmlの"
    },
    {
      "indent": 5,
      "text": "<html> <head> ... <link rel=\"privacy-policy\" href=\"/privacy-policy.html\" /> ... </head> <body> ... </body> </html>",
      "ja": "ます。<html> <head> ... <リンクのrel = \"プライバシーポリシー\" のhref = \"/プライバシーpolicy.html\" /> ... </ head>の<身体> ... </ BODY> </ HTML >"
    },
    {
      "indent": 3,
      "text": "Note that in the absence of clear legal obligations placed on an entity, either through contract or law, the presence of a \"privacy-policy\" link does not constitute a legally binding obligation on the part of the service. The linked resource can only be interpreted as a description of the expected practice.",
      "ja": "いずれかの契約または法律によって、「プライバシーポリシー」リンクの存在は、サービスの一部に法的拘束力のある義務を構成するものではありません、エンティティ上に置く明確な法的義務が存在しない状態であることに注意してください。リンクされたリソースのみが予想される練習の説明として解釈することができます。"
    },
    {
      "indent": 3,
      "text": "It is recommended that publishers of privacy-policy resources linked to using the \"privacy-policy\" link relation provide a clear and simple mechanism for signaling when changes to the privacy-policy resource have been made, such as generating a new Entity Tag for the resource or generating a hash over the privacy policy's content. The extent to which mechanisms are utilized is out of the scope of this specification, however.",
      "ja": "プライバシーポリシーリソースへの変更が行われた場合には、そのようなのために新しいエンティティタグを生成するものとして、「プライバシーポリシー」リンク関係を使ってリンクプライバシーポリシーリソースの出版社がシグナリングのための明確かつシンプルなメカニズムを提供することをお勧めしますリソースまたはプライバシーポリシーの内容以上のハッシュを生成します。機構が利用される程度は、しかしながら、本明細書の範囲外です。"
    },
    {
      "indent": 0,
      "text": "4.1. The \"privacy-policy\" Link Relation and P3P",
      "section_title": true,
      "ja": "4.1.  「プライバシーポリシー」リンク関係とP3P"
    },
    {
      "indent": 3,
      "text": "The Platform for Privacy Preferences [P3P] is a W3C Recommendation that defines a data format for the expression of privacy policy information. While the \"privacy-policy\" link relation can be used to reference P3P documents, there is no intended relationship, normative or otherwise, between this specification and the P3P Recommendation. As far as this specification is concerned, P3P documents are just one possible type of resource that \"privacy-policy\" links can reference.",
      "ja": "プライバシー設定[P3P]のプラットフォームは、プライバシーポリシー情報の発現のためのデータフォーマットを定義するW3C勧告です。 「プライバシーポリシー」リンク関係は、P3Pのドキュメントを参照するために使用することができますが、この仕様とP3P勧告間の規範的またはそうでなければ意図した関係は、ありません。限りこの仕様に関しては、P3P文書は、「プライバシーポリシー」のリンクを参照することができ、リソースのただ一つの可能​​なタイプです。"
    },
    {
      "indent": 0,
      "text": "5. \"terms-of-service\"",
      "section_title": true,
      "ja": "5.「用語・オブ・サービス」"
    },
    {
      "indent": 3,
      "text": "The \"terms-of-service\" link relation can be used to refer to a resource describing the terms of service associated with the link's context. The terms of service can be any resource that describes the rules to which a consumer of the service must agree to follow when using the service provided by the link's context.",
      "ja": "「用語のサービス」リンク関係は、リンクのコンテキストに関連するサービスの条件を記述したリソースを参照するために使用することができます。利用規約は、サービスの消費者は、リンクのコンテキストで提供されるサービスを使用する際に従うことに同意しなければならないルールを説明任意のリソースすることができます。"
    },
    {
      "indent": 3,
      "text": "For example, an HTTP server can include \"terms-of-service\" links within all HTTP responses using any combination of Link headers or links embedded in the response payload:",
      "ja": "例えば、HTTPサーバは、「用語のサービス」応答ペイロードに埋め込まれたリンクヘッダやリンクの任意の組み合わせを使用して、すべてのHTTP応答内のリンクを含めることができます。"
    },
    {
      "indent": 5,
      "text": "HTTP/1.1 200 OK Content-Type: text/html",
      "ja": "HTTP / 1.1 200 OKのContent-Type：text / htmlの"
    },
    {
      "indent": 5,
      "text": "<html> <head> ... <link rel=\"terms-of-service\" href=\"/tos.html\"> ... </head> <body> ... </body> </html>",
      "ja": "ます。<html> <head> ... <リンクのrel = \"用語のサービス\" のhref = \"/ tos.html\"> ... </ head>の<身体> ... </ body> </ html>この"
    },
    {
      "indent": 3,
      "text": "It must be noted that the terms of service linked to using this link relation carry no legal weight and can be ignored with impunity in the absence of an explicit, legally enforceable contract. The linked terms of service are simply a notice of the terms that may be expected to apply once a contract is established.",
      "ja": "このリンク関係を使ってリンクサービスの観点からは、法的重量を運ばないことに留意しなければならないと明示的、法的強制力のある契約が存在しない場合に免責を無視することができます。サービスのリンクに関しては、単純に契約が確立された後に適用することが予想される用語の予告です。"
    },
    {
      "indent": 0,
      "text": "6. \"type\"",
      "section_title": true,
      "ja": "6.「タイプ」"
    },
    {
      "indent": 3,
      "text": "The \"type\" link relation can be used to indicate that the context resource is an instance of the resource identified by the target Internationalized Resource Identifier (IRI).",
      "ja": "「タイプ」リンク関係は、コンテキストリソースがターゲット国際化リソース識別子（IRI）によって識別されたリソースのインスタンスであることを示すために使用することができます。"
    },
    {
      "indent": 5,
      "text": "HTTP/1.1 200 OK Content-Type: text/plain Link: <http://example.org/Person/givenName>; rel=\"type\"",
      "ja": "HTTP / 1.1 200 OKのContent-Type：text / plainのリンク：<http://example.org/Person/givenName>。 REL = \"タイプ\""
    },
    {
      "indent": 5,
      "text": "Sally",
      "ja": "サリー"
    },
    {
      "indent": 3,
      "text": "When used within the header of an HTTP message, the type specified by the \"type\" link relation cannot be confused with the content type of the payload as given by the Content-Type header. The \"type\" link relation references the payload's abstract semantic type, whereas the Content-Type header identifies the specific serialization format of the payload.",
      "ja": "HTTPメッセージのヘッダ内で使用される場合、Content-Typeヘッダで与えられるように、「タイプ」リンク関係によって指定されたタイプは、ペイロードのコンテンツ・タイプと混同することはできません。 Content-Typeヘッダはペイロードの特定のシリアル化形式を識別し、一方、「タイプ」リンク関係は、ペイロードの抽象セマンティックタイプを参照します。"
    },
    {
      "indent": 3,
      "text": "If the context can be considered to be an instance of multiple semantic types, multiple \"type\" link relations can be used.",
      "ja": "コンテキストは、複数のセマンティックタイプのインスタンスであるとみなすことができ、複数の「タイプ」のリンク関係を使用することができます。"
    },
    {
      "indent": 0,
      "text": "7. IANA Considerations",
      "section_title": true,
      "ja": "7. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "The \"Link Relation Types\" registry has been updated with the following entries:",
      "ja": "「リンクの関係タイプ」のレジストリには、次のエントリで更新されました："
    },
    {
      "indent": 3,
      "text": "o Relation Name: about o Description: Refers to a resource that is the subject of the link's context. o Reference: This specification, Section 2",
      "ja": "Oリレーション名：O説明については：リンクのコンテキストの対象であるリソースを参照します。 O参考：この仕様で、第2節"
    },
    {
      "indent": 3,
      "text": "o Relation Name: preview o Description: Refers to a resource that provides a preview of the link's context. o Reference: This specification, Section 3",
      "ja": "Oリレーション名：プレビューO説明：リンクのコンテキストのプレビューを提供し、リソースを参照します。 O参考：この仕様で、第3節"
    },
    {
      "indent": 3,
      "text": "o Relation Name: privacy-policy o Description: Refers to a privacy policy associated with the link's context. o Reference: This specification, Section 4",
      "ja": "Oリレーション名：プライバシー・ポリシー0説明：リンクのコンテキストに関連付けられているプラ​​イバシーポリシーを参照します。 O参考：この仕様で、第4節"
    },
    {
      "indent": 3,
      "text": "o Relation Name: terms-of-service o Description: Refers to the terms of service associated with the link's context. o Reference: This specification, Section 5",
      "ja": "Oリレーション名：用語のサービスO説明：リンクのコンテキストに関連するサービスの条件を指します。 O参考：この仕様で、第5節"
    },
    {
      "indent": 3,
      "text": "o Relation Name: type o Description: Refers to a resource identifying the abstract semantic type of which the link's context is considered to be an instance. o Reference: This specification, Section 6",
      "ja": "Oリレーション名：O型説明：リンクのコンテキストがインスタンスであると考えられるの抽象セマンティックタイプを識別するリソースを指します。 O参考：この仕様で、第6節"
    },
    {
      "indent": 0,
      "text": "8. Security Considerations",
      "section_title": true,
      "ja": "8.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "There are no additional security concerns introduced by this document.",
      "ja": "このドキュメントで紹介追加のセキュリティ上の懸念はありません。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "ja": "9.参考文献"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "ja": "9.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC5988] Nottingham, M., \"Web Linking\", RFC 5988, October 2010.",
      "ja": "[RFC5988]ノッティンガム、M.、 \"ウェブリンク\"、RFC 5988、2010年10月。"
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "ja": "9.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[P3P] W3C, \"P3P: The Platform for Privacy Preferences\", November 2007, <http://www.w3.org/P3P/>.",
      "ja": "[P3P] W3C、 \"P3P：プライバシー設定のためのプラットフォーム\"、2007年11月、<http://www.w3.org/P3P/>。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "James M Snell",
      "ja": "ジェームズ・M・スネル"
    },
    {
      "indent": 3,
      "text": "EMail: jasnell@gmail.com",
      "ja": "メールアドレス：jasnell@gmail.com"
    }
  ]
}