{
  "title": {
    "text": "RFC 6546 - Transport of Real-time Inter-network Defense (RID) Messages over HTTP/TLS",
    "ja": "RFC 6546 - http/tlsを介したリアルタイムのネットワーク間防御（RID）メッセージの輸送"
  },
  "number": 6546,
  "created_at": "2022-11-04 09:45:09.236097+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                       B. Trammell\nRequest for Comments: 6546                                    ETH Zurich\nObsoletes: 6046                                               April 2012\nCategory: Standards Track\nISSN: 2070-1721",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "Transport of Real-time Inter-network Defense (RID) Messages over HTTP/TLS",
      "ja": "http/tlsを介したリアルタイムのネットワーク間防御（RID）メッセージの輸送"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "The Incident Object Description Exchange Format (IODEF) defines a common XML format for document exchange, and Real-time Inter-network Defense (RID) defines extensions to IODEF intended for the cooperative handling of security incidents within consortia of network operators and enterprises. This document specifies an application-layer protocol for RID based upon the passing of RID messages over HTTP/TLS.",
      "ja": "インシデントオブジェクト説明交換形式（IODEF）は、ドキュメント交換用の一般的なXML形式を定義し、ネットワークオペレーターと企業のコンソーシアム内でのセキュリティインシデントの協力処理を目的としたIODEFへの拡張を定義します。このドキュメントは、HTTP/TLSを介したRIDメッセージの渡されに基づいて、RID用のアプリケーション層プロトコルを指定します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準トラックドキュメントです。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントは、インターネットエンジニアリングタスクフォース（IETF）の製品です。IETFコミュニティのコンセンサスを表しています。公開レビューを受けており、インターネットエンジニアリングステアリンググループ（IESG）からの出版が承認されています。インターネット標準の詳細については、RFC 5741のセクション2で入手できます。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6546.",
      "ja": "このドキュメントの現在のステータス、任意のERRATA、およびそのフィードバックを提供する方法に関する情報は、http：//www.rfc-editor.org/info/rfc6546で取得できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2012 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2012 IETF Trustおよび文書著者として特定された人。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "このドキュメントは、BCP 78およびIETFドキュメント（http://trustee.ietf.org/license-info）に関連するIETF Trustの法的規定の対象となります。この文書に関するあなたの権利と制限を説明するので、これらの文書を注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、セクション4.Eで説明されている法的規定のセクション4.Eで説明されており、単純化されたBSDライセンスで説明されているように保証なしで提供される簡略化されたBSDライセンステキストを含める必要があります。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The Incident Object Description Exchange Format (IODEF) [RFC5070] describes an XML document format for the purpose of exchanging data between Computer Security Incident Response Teams (CSIRTs) or those responsible for security incident handling for service providers (SPs). The defined document format provides a simple way for CSIRTs to exchange data in a way which can be easily parsed.",
      "ja": "インシデントオブジェクト説明交換形式（IODEF）[RFC5070]は、コンピューターセキュリティインシデント対応チーム（CSIRT）間でデータを交換する目的で、またはサービスプロバイダー（SPS）のセキュリティインシデント処理を担当するものを交換する目的でXMLドキュメント形式を説明します。定義されたドキュメント形式は、CSIRTが簡単に解析できる方法でデータを交換する簡単な方法を提供します。"
    },
    {
      "indent": 3,
      "text": "IODEF defines a message format, not a protocol, as the sharing of messages is assumed to be out of scope in order to allow CSIRTs to exchange and store messages in a way most suited to their established incident-handling processes. However, Real-time Inter-network Defense (RID) [RFC6545] does require a specification of a protocol to ensure interoperability among members in a RID consortium. This document specifies the transport of RID messages within HTTP [RFC2616] Request and Response messages over TLS [RFC5246] (herein, HTTP/TLS). Note that any IODEF message may also be transported using this mechanism, by sending it as a RID Report message.",
      "ja": "IODEFは、CSIRTが確立されたインシデント処理プロセスに最も適した方法でメッセージを交換および保存できるようにするために、メッセージの共有が範囲外であると想定されるため、プロトコルではなくメッセージ形式を定義します。ただし、リアルタイムのネットワーク間防御（RID）[RFC6545]では、RIDコンソーシアムのメンバー間の相互運用性を確保するために、プロトコルの仕様が必要です。このドキュメントは、TLS [RFC5246]（ここではHTTP/TLS）を介したHTTP [RFC2616]リクエストと応答メッセージ内のRIDメッセージの輸送を指定します。IODEFメッセージは、RIDレポートメッセージとして送信することにより、このメカニズムを使用して輸送される場合があることに注意してください。"
    },
    {
      "indent": 0,
      "text": "1.1. Changes from RFC 6046",
      "section_title": true,
      "ja": "1.1. RFC 6046からの変更"
    },
    {
      "indent": 3,
      "text": "This document contains the following changes with respect to its predecessor [RFC6046]:",
      "ja": "このドキュメントには、その前身に関する次の変更が含まれています[RFC6046]："
    },
    {
      "indent": 3,
      "text": "o The status of the document is Standards Track.",
      "ja": "o ドキュメントのステータスは標準トラックです。"
    },
    {
      "indent": 3,
      "text": "o The document is updated to refer to the updated RID specification, [RFC6545], where appropriate.",
      "ja": "o ドキュメントは、必要に応じて更新されたRID仕様[RFC6545]を参照するように更新されます。"
    },
    {
      "indent": 3,
      "text": "o Language regarding the use of HTTP/1.1 and TCP ports for RID transport is clarified.",
      "ja": "o RID輸送のためのHTTP/1.1およびTCPポートの使用に関する言語は明らかにされています。"
    },
    {
      "indent": 3,
      "text": "o The RID-Callback-Token entity header field is added to allow matching of RID replies during callback, independent of the content of the underlying RID message.",
      "ja": "o RID-Callback-Token Entityヘッダーフィールドが追加され、基礎となるRIDメッセージのコンテンツとは無関係に、コールバック中のRID応答を一致させることができます。"
    },
    {
      "indent": 3,
      "text": "o The minimum required version of TLS is upgraded to 1.1, and the minimum recommended version to 1.2.",
      "ja": "o TLSの最小必要なバージョンは1.1にアップグレードされ、最小推奨バージョンは1.2にアップグレードされます。"
    },
    {
      "indent": 3,
      "text": "o Language regarding PKI for RID over HTTPS is clarified, and updated to refer to [RFC6125].",
      "ja": "o httpsを超えるPKIに関する言語は明確になり、[RFC6125]を参照するように更新されます。"
    },
    {
      "indent": 3,
      "text": "This document obsoletes [RFC6046] and moves it to Historic status.",
      "ja": "このドキュメントは廃止され[RFC6046]、歴史的なステータスに移動します。"
    },
    {
      "indent": 0,
      "text": "2. Terminology and Normative Sections",
      "section_title": true,
      "ja": "2. 用語と規範セクション"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "「必須」、「そうしない」、「必須」、「必要」、「しない」、「そうしない」、「そうではない」、「そうでない」、「推奨」、「5月」、および「オプション」は、[RFC2119]に記載されているように解釈される。"
    },
    {
      "indent": 3,
      "text": "RID systems participating in a consortium are required to fully implement the protocol in Section 3 in order to interoperate within the consortium; the remainder of this document is informative and provides helpful background or explanatory information.",
      "ja": "コンソーシアムに参加しているRIDシステムは、コンソーシアム内で相互運用するためにセクション3にプロトコルを完全に実装する必要があります。このドキュメントの残りの部分は有益であり、役立つ背景または説明情報を提供します。"
    },
    {
      "indent": 0,
      "text": "3. Transmission of RID Messages over HTTP/TLS",
      "section_title": true,
      "ja": "3. HTTP/TLS上のRIDメッセージの送信"
    },
    {
      "indent": 3,
      "text": "This section specifies the details of the transport of RID messages [RFC6545] over HTTP/TLS. In this arrangement, each RID server is both an HTTP/TLS server and an HTTP/TLS client. When a RID message is sent, the sending RID system connects to the receiving RID system and sends the message, optionally receiving a message in reply. Each RID system MUST be prepared to accept HTTP/TLS connections from any RID peer with which it communicates, in order to support callback for delayed replies (see below).",
      "ja": "このセクションでは、HTTP/TLSを介したRIDメッセージ[RFC6545]の輸送の詳細を指定します。この配置では、各RIDサーバーはHTTP/TLSサーバーとHTTP/TLSクライアントの両方です。RIDメッセージが送信されると、送信RIDシステムが受信RIDシステムに接続してメッセージを送信し、オプションでメッセージを受信します。各RIDシステムは、遅延返信のコールバックをサポートするために、通信するRIDピアからHTTP/TLS接続を受け入れるように準備する必要があります（以下を参照）。"
    },
    {
      "indent": 3,
      "text": "BCP 56 [RFC3205] contains a number of important considerations when using HTTP for application protocols. These include the size of the payload for the application, whether the application will use a web browser, whether the protocol should be defined on a port other than 80, and if the security provided through HTTP/TLS suits the needs of the new application.",
      "ja": "BCP 56 [RFC3205]には、アプリケーションプロトコルにHTTPを使用する場合、多くの重要な考慮事項が含まれています。これらには、アプリケーションのペイロードのサイズ、アプリケーションがWebブラウザーを使用するかどうか、プロトコルを80以外のポートで定義する必要があるかどうか、HTTP/TLSを介して提供されるセキュリティが新しいアプリケーションのニーズに合っているかどうかが含まれます。"
    },
    {
      "indent": 3,
      "text": "It is acknowledged within the scope of these concerns that HTTP/TLS is not ideally suited for RID transport, as the former is a client-server protocol and the latter a message-exchange protocol; however, the ease of implementation of RID systems over HTTP/TLS outweighs these concerns. Consistent with BCP 56, RID systems listen for TCP connections on port 4590 (see Section 5). Every RID system participating in a consortium SHOULD listen for HTTP/TLS connections on the assigned port. RID systems MAY be configurable to listen on ports other than the well-known port; this configuration is out of scope for this specification. RID systems SHOULD NOT use TCP port 443 (the standard port for HTTP over TLS) for RID messages in order to avoid confusing standard HTTP/TLS servers for RID systems.",
      "ja": "前者はクライアントサーバープロトコルであり、後者はメッセージ交換プロトコルであるため、HTTP/TLSはRID輸送に理想的ではないことがこれらの懸念の範囲内で認められています。ただし、HTTP/TLSよりもRIDシステムの実装の容易さは、これらの懸念を上回ります。BCP 56と一致して、RIDシステムはポート4590でTCP接続をリッスンします（セクション5を参照）。コンソーシアムに参加するすべてのRIDシステムは、割り当てられたポートのHTTP/TLS接続をリッスンする必要があります。RIDシステムは、よく知られているポート以外のポートでリッスンするように構成できる場合があります。この構成は、この仕様の範囲外です。RIDシステムのRIDシステムは、RIDメッセージにTCPポート443（TLSを介したHTTPの標準ポート）を使用しないでください。RIDシステム用の標準のHTTP/TLSサーバーを混乱させないようにしてください。"
    },
    {
      "indent": 3,
      "text": "RID systems MUST implement all REQUIRED functionality for HTTP/1.1 [RFC2616]. All RID messages sent in HTTP Requests MUST be sent using the POST method with a Request-URI of '/'. As RID documents are XML, the RID media type is 'text/xml'; i.e., the 'Content-type' Request and Response headers MUST be 'text/xml'. As RID messages MUST be sent using the POST method, the GET and HEAD methods have no",
      "ja": "RIDシステムは、HTTP/1.1 [RFC2616]に必要なすべての機能を実装する必要があります。HTTPリクエストで送信されたすべてのRIDメッセージは、「/」のリクエスト-URIを使用してPOSTメソッドを使用して送信する必要があります。RIDドキュメントはXMLであるため、RIDメディアタイプは「テキスト/XML」です。つまり、「コンテンツタイプ」リクエストと応答ヘッダーは「テキスト/XML」でなければなりません。POSTメソッドを使用してRIDメッセージを送信する必要があるため、GETおよびHEADメソッドにはありません"
    },
    {
      "indent": 3,
      "text": "particular meaning on a RID system; a RID system SHOULD answer 'GET /' or 'HEAD /' with 204 No Content. Other Request-URIs are reserved for future use; any access to Request-URIs other than '/' by any method on a RID system SHOULD return the appropriate HTTP error (404 Not Found).",
      "ja": "RIDシステムの特定の意味。RIDシステムは、204のコンテンツを使用して「get /」または「head /」に答える必要があります。他のリクエストウリは、将来の使用のために予約されています。RIDシステム上の任意のメソッドによる「/」以外のリクエスト-urisへのアクセスは、適切なHTTPエラー（404は見つかりません）を返す必要があります。"
    },
    {
      "indent": 3,
      "text": "Since the content of RID messages is essentially declarative, a RID system interrupted during transport MAY simply repeat the transaction; the sending of a RID message is idempotent.",
      "ja": "RIDメッセージの内容は本質的に宣言的であるため、輸送中に中断されたRIDシステムは、単にトランザクションを繰り返す可能性があります。RIDメッセージの送信はiDempotentです。"
    },
    {
      "indent": 3,
      "text": "As the queries and replies in a RID message exchange may be significantly separated in time, RID over HTTP/TLS supports a callback mechanism. In this mechanism, the receiving RID system MAY return a 202 Accepted response, called a RID callback, instead of a RID message. The RID callback MUST contain a zero-length entity body and a 'RID-Callback-Token' entity header field, itself containing a unique token generated by the receiving RID system.",
      "ja": "RIDメッセージ交換でのクエリと応答は時間内に大幅に分離される可能性があるため、HTTP/TLSを介してREDはコールバックメカニズムをサポートします。このメカニズムでは、受信RIDシステムは、RIDメッセージの代わりに、RIDコールバックと呼ばれる202の受け入れられた応答を返す場合があります。RIDコールバックには、ゼロ長エンティティボディと「RID-Callback-Token」エンティティヘッダーフィールドが含まれている必要があります。それ自体には、受信RIDシステムによって生成された一意のトークンが含まれています。"
    },
    {
      "indent": 3,
      "text": "The RID-Callback-Token is an opaque, whitespace-free string of up to 255 printable ASCII characters that MUST uniquely identify the callback among all callbacks from the receiving RID system to the sending RID system. Due to the amount of time that may be required to generate a RID Result or Report response, there is no upper bound on the time period for this uniqueness requirement. The RID-Callback-Token in ABNF [RFC5234] form is shown below:",
      "ja": "リドコールバックトークンは、最大255の印刷可能なASCIIキャラクターの不透明で白色のない文字列で、受信RIDシステムから送信RIDシステムへのすべてのコールバック間でコールバックを一意に識別する必要があります。RID結果またはレポート応答を生成するために必要な時間の量があるため、この一意性要件の期間に上限はありません。ABNF [RFC5234]フォームのリッドコールバックトークンを以下に示します。"
    },
    {
      "indent": 3,
      "text": "callback-token = 1*255(VCHAR)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "When performing RID callback, a responding system MUST connect to the host at the network-layer address from which the original request was sent; there is no mechanism in RID for redirected callback. This callback SHOULD use TCP port 4590 unless configured to use a different port.",
      "ja": "RIDコールバックを実行する場合、応答システムは、元のリクエストが送信されたネットワーク層アドレスでホストに接続する必要があります。リダイレクトされたコールバックのRIDにメカニズムはありません。このコールバックは、別のポートを使用するように構成されていない限り、TCPポート4590を使用する必要があります。"
    },
    {
      "indent": 3,
      "text": "While a RID system SHOULD return the reply in an HTTP Response if it is available immediately or within a generally accepted HTTP client timeout (about thirty seconds), this is not mandatory, and as such RID systems MUST be prepared for a query to be met with a 202 Accepted, an empty Response body, a connection termination, and a callback. Note that all RID messages require a response from the receiving RID system, so a sending RID system can expect either an immediate response or a callback.",
      "ja": "RIDシステムは、http応答がすぐに利用可能である場合、または一般的に受け入れられているHTTPクライアントタイムアウト（約30秒）内で使用可能な場合、返信を返す必要がありますが、これは必須ではないため、coeryを満たすためにRIDシステムを準備する必要があります。202が受け入れられている、空の応答本体、接続終了、コールバック。すべてのRIDメッセージには、受信RIDシステムからの応答が必要であるため、送信RIDシステムは即時の応答またはコールバックのいずれかを期待できることに注意してください。"
    },
    {
      "indent": 3,
      "text": "Table 1 lists the allowable RID message types in an HTTP Response for a given RID message type in the Request. A RID system MUST be prepared to handle an HTTP Response of the given type(s) when sending",
      "ja": "表1に、リクエストの特定のRIDメッセージタイプのHTTP応答の許容RIDメッセージタイプを示します。送信時に指定されたタイプのHTTP応答を処理するために、RIDシステムを準備する必要があります"
    },
    {
      "indent": 3,
      "text": "the corresponding HTTP Request. A RID system MUST NOT send an HTTP Response containing any RID message other than the one corresponding to the one sent in the HTTP Request.",
      "ja": "対応するHTTP要求。RIDシステムは、HTTPリクエストで送信されたものに対応するもの以外のRIDメッセージを含むHTTP応答を送信してはなりません。"
    },
    {
      "indent": 5,
      "text": "+----------------------+----------+--------+-------------------+\n| Request RID type     | Callback | Result | Response RID type |\n+----------------------+----------+--------+-------------------+\n| InvestigationRequest |          | 200    | Acknowledgement   |\n| InvestigationRequest |          | 200    | Result            |\n| InvestigationRequest |          | 200    | Report            |\n| InvestigationRequest |          | 202    | [empty]           |\n| TraceRequest         |          | 200    | Acknowledgement   |\n| TraceRequest         |          | 200    | Result            |\n| TraceRequest         |          | 200    | Report            |\n| TraceRequest         |          | 202    | [empty]           |\n| Query                |          | 200    | Acknowledgement   |\n| Query                |          | 200    | Report            |\n| Query                |          | 202    | [empty]           |\n| Acknowledgement      |     X    | 200    | [empty]           |\n| Result               |     X    | 200    | [empty]           |\n| Report               |          | 200    | Acknowledgement   |\n| Report               |          | 200    | [empty]           |\n| Report               |     X    | 200    | [empty]           |\n+----------------------+----------+--------+-------------------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 34,
      "text": "Table 1",
      "ja": "表1"
    },
    {
      "indent": 3,
      "text": "The use of stable DNS names to address RID systems is RECOMMENDED; in addition to facilitating connection to RID systems within a consortium, these are to be used as reference identifiers for a RID system's peers. For security purposes, RID systems SHOULD NOT return 3xx Redirection response codes, and SHOULD NOT follow any 3xx Redirection. The protocol provides no in-band method for handling a change of address of a RID system.",
      "ja": "安定したDNS名を使用してRIDシステムに対処することをお勧めします。コンソーシアム内のRIDシステムへの接続を促進することに加えて、これらはRIDシステムのピアの参照識別子として使用されます。セキュリティ目的で、RIDシステムは3XXリダイレクト応答コードを返すべきではなく、3XXリダイレクトに従ってはなりません。このプロトコルは、RIDシステムのアドレスの変更を処理するための帯域内の方法を提供しません。"
    },
    {
      "indent": 3,
      "text": "If a RID system receives an improper RID message in an HTTP Request, it MUST return an appropriate 4xx Client Error result code to the requesting RID system. If a RID system cannot process a RID message received in an HTTP Request due to an error on its own side, it MUST return an appropriate 5xx Server Error result code to the requesting RID system.",
      "ja": "RIDシステムがHTTP要求で不適切なRIDメッセージを受信した場合、Requireming RIDシステムに適切な4XXクライアントエラー結果コードを返す必要があります。RIDシステムがHTTP要求で受信したRIDメッセージをHTTP要求で処理できない場合、独自のエラーがあるため、適切な5XXサーバーエラー結果コードをリクエストRIDシステムに返す必要があります。"
    },
    {
      "indent": 3,
      "text": "Note that HTTP provides no mechanism for signaling to a server that a response body is not a valid RID message. If a RID system receives an improper RID message in an HTTP Response, or cannot process a RID message received in an HTTP Response due to an error on its own side,",
      "ja": "HTTPは、応答本体が有効なRIDメッセージではないことをサーバーに信号するメカニズムを提供しないことに注意してください。RIDシステムがHTTP応答で不適切なRIDメッセージを受信した場合、または独自のエラーがあるためにHTTP応答で受信したRIDメッセージを処理できない場合、"
    },
    {
      "indent": 3,
      "text": "it MUST log the error and present it to the RID system administrator for handling; the error logging format is an implementation detail and is considered out of scope for this specification.",
      "ja": "エラーをログにして、取り扱いのためにRIDシステム管理者に提示する必要があります。エラーログ形式は実装の詳細であり、この仕様の範囲外であると見なされます。"
    },
    {
      "indent": 3,
      "text": "RID systems MUST support and SHOULD use HTTP/1.1 persistent connections as described in [RFC2616]. RID systems MUST support chunked transfer encoding on the HTTP server side to allow the implementation of clients that do not need to pre-calculate message sizes before constructing HTTP headers.",
      "ja": "RIDシステムは、[RFC2616]で説明されているように、HTTP/1.1永続的な接続をサポートする必要があり、使用する必要があります。RIDシステムは、HTTPサーバー側でのチャンク転送エンコードをサポートして、HTTPヘッダーを構築する前にメッセージサイズを事前に計算する必要のないクライアントの実装を可能にする必要があります。"
    },
    {
      "indent": 3,
      "text": "RID systems MUST use TLS version 1.1 [RFC4346] or higher for confidentiality, identification, and authentication, when sending RID messages over HTTPS. HTTPS is specified in Section 2 of [RFC2818]. RID systems MUST use mutual authentication; that is, both RID systems acting as HTTPS clients and RID systems acting as HTTPS servers MUST be identified by an X.509 certificate [RFC5280]. Mutual authentication requires full path validation on each certificate, as defined in [RFC5280].",
      "ja": "RIDシステムは、httpsを介してRIDメッセージを送信する際に、機密性、識別、および認証のために、TLSバージョン1.1 [RFC4346]以上を使用する必要があります。HTTPSは[RFC2818]のセクション2で指定されています。RIDシステムは相互認証を使用する必要があります。つまり、HTTPSクライアントとして機能するRIDシステムとHTTPSサーバーとして機能するRIDシステムは、X.509証明書[RFC5280]で識別する必要があります。相互認証には、[RFC5280]で定義されているように、各証明書のフルパス検証が必要です。"
    },
    {
      "indent": 3,
      "text": "The TLS session MUST use non-NULL ciphersuites for authentication, integrity, and confidentiality. Sessions MAY be renegotiated within these constraints.",
      "ja": "TLSセッションでは、認証、整合性、および機密性のために、非ヌルの暗号化を使用する必要があります。セッションは、これらの制約内で再交渉される場合があります。"
    },
    {
      "indent": 3,
      "text": "All RID systems SHOULD be identified by a certificate containing DNS-ID identifier as in Section 6.4 of [RFC6125]; the inclusion of Common Names (CN-IDs) in certificates identifying RID systems is NOT RECOMMENDED. RID systems MUST verify the reference identifiers of their peers against those stored in the certificates presented using one of the methods in the following paragraph. Wildcards MUST NOT appear in the DNS-ID or CN-ID of a certificate identifying a RID system.",
      "ja": "すべてのRIDシステムは、[RFC6125]のセクション6.4のように、DNS-ID識別子を含む証明書によって識別する必要があります。RIDシステムを特定する証明書に共通名（CN-ID）を含めることは推奨されません。RIDシステムは、次の段落のメソッドのいずれかを使用して提示された証明書に保存されているものに対して、ピアの参照識別子を確認する必要があります。ワイルドカードは、RIDシステムを識別する証明書のDNS-IDまたはCN-IDに表示されてはなりません。"
    },
    {
      "indent": 3,
      "text": "RID systems MUST support the verification of certificates against an explicit whitelist of peer certificates. RID systems SHOULD support the verification of reference identifiers by matching the DNS-ID or CN-ID with a reverse DNS lookup of the connecting RID peer; this support SHOULD allow the lookup to be cached and/or done in advance in order to ensure verifiability during instability or compromise of DNS itself.",
      "ja": "RIDシステムは、ピア証明書の明示的なホワイトリストに対する証明書の検証をサポートする必要があります。RIDシステムは、DNS-IDまたはCN-IDを接続するRIDピアの逆DNS検索と一致させることにより、参照識別子の検証をサポートする必要があります。このサポートにより、DNS自体の不安定性または妥協の間に検証可能性を確保するために、検索を事前に検索および/または事前に実行できるようにする必要があります。"
    },
    {
      "indent": 3,
      "text": "Additional general information on the use of PKI with RID systems is detailed in Section 9.3 of [RFC6545].",
      "ja": "RIDシステムを使用したPKIの使用に関する追加の一般情報は、[RFC6545]のセクション9.3に詳述されています。"
    },
    {
      "indent": 3,
      "text": "RID systems MUST support TLS version 1.1 and SHOULD support TLS version 1.2 [RFC5246]; RID systems MUST NOT request, offer, or use any version of SSL, or any version of TLS prior to 1.1, due to known security vulnerabilities in prior versions of the protocol; see Appendix E of [RFC5246] for more information.",
      "ja": "RIDシステムはTLSバージョン1.1をサポートする必要があり、TLSバージョン1.2 [RFC5246]をサポートする必要があります。RIDシステムは、プロトコルの以前のバージョンで既知のセキュリティの脆弱性のため、1.1より前にSSLのバージョン、または1.1より前にTLSのバージョンを要求、提供、または使用してはなりません。詳細については、[RFC5246]の付録Eを参照してください。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "In addition to the final paragraphs in Section 3 on the use of TLS to secure RID message transport, all security considerations of related documents apply, especially the Incident Object Description Exchange Format (IODEF) [RFC5070] and Real-time Inter-network Defense (RID) [RFC6545]. The protocol described herein is built on the foundation of those documents; the security considerations contained therein are incorporated by reference.",
      "ja": "RIDメッセージトランスポートを保護するためのTLSの使用に関するセクション3の最終段落に加えて、関連するドキュメントのすべてのセキュリティに関する考慮事項、特にインシデントオブジェクト説明交換形式（IODEF）[RFC5070]およびリアルタイムのネットワーク間防御（RID）[RFC6545]。本明細書に記載されているプロトコルは、これらのドキュメントの基礎の上に構築されています。そこに含まれるセキュリティ上の考慮事項は、参照により組み込まれています。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "ja": "5. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "Consistent with BCP 56 [RFC3205], since RID over HTTP/TLS is a substantially new service, and should be controlled at the consortium member network's border differently than HTTP/TLS, it requires a new port number. IANA has assigned port 4590/tcp to RID with service name \"RID over HTTP/TLS\".",
      "ja": "BCP 56 [RFC3205]と一致して、HTTP/TLSを介してRidが実質的に新しいサービスであり、HTTP/TLSとは異なるコンソーシアムメンバーネットワークの境界線で制御する必要があるため、新しいポート番号が必要です。IANAは、ポート4590/TCPを割り当てて、「HTTP/TLSを削除する」サービス名を削除しました。"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgements",
      "section_title": true,
      "ja": "6. 謝辞"
    },
    {
      "indent": 3,
      "text": "The author would like to thank David Black for the review, and Kathleen Moriarty for work on earlier revisions of this specification. This work was partially supported by the European Union Seventh Framework Program under grant agreement 257315 (DEMONS).",
      "ja": "著者は、レビューについてDavid Blackに感謝し、Kathleen Moriartyがこの仕様の以前の改訂に関する作業については感謝したいと思います。この作業は、助成金契約257315（悪魔）に基づく欧州連合第7フレームワークプログラムによって部分的にサポートされていました。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7. 参考文献"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "ja": "7.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119] Bradner、S。、「要件レベルを示すためにRFCで使用するためのキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2616] Fielding, R., Gettys, J., Mogul, J., Frystyk, H., Masinter, L., Leach, P., and T. Berners-Lee, \"Hypertext Transfer Protocol -- HTTP/1.1\", RFC 2616, June 1999.",
      "ja": "[RFC2616] Fielding、R.、Gettys、J.、Mogul、J.、Frystyk、H.、Masinter、L.、Leach、P。、およびT. Berners-Lee、「Hypertext Transfer Protocol-HTTP/1.1」、RFC 2616、1999年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC2818] Rescorla, E., \"HTTP Over TLS\", RFC 2818, May 2000.",
      "ja": "[RFC2818] Rescorla、E。、「TLS上のHTTP」、RFC 2818、2000年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC5070] Danyliw, R., Meijer, J., and Y. Demchenko, \"The Incident Object Description Exchange Format\", RFC 5070, December 2007.",
      "ja": "[RFC5070] Danyliw、R.、Meijer、J。、およびY. Demchenko、「インシデントオブジェクト説明交換形式」、RFC 5070、2007年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC5246] Dierks, T. and E. Rescorla, \"The Transport Layer Security (TLS) Protocol Version 1.2\", RFC 5246, August 2008.",
      "ja": "[RFC5246] Dierks、T。およびE. Rescorla、「The Transport Layer Security（TLS）プロトコルバージョン1.2」、RFC 5246、2008年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC5280] Cooper, D., Santesson, S., Farrell, S., Boeyen, S., Housley, R., and W. Polk, \"Internet X.509 Public Key Infrastructure Certificate and Certificate Revocation List (CRL) Profile\", RFC 5280, May 2008.",
      "ja": "[RFC5280] Cooper、D.、Santesson、S.、Farrell、S.、Boeyen、S.、Housley、R.、およびW. Polk、 \"Internet X.509公開キーインフラストラクチャ証明書および証明書失効リスト（CRL）プロファイル\"、RFC 5280、2008年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC6125] Saint-Andre, P. and J. Hodges, \"Representation and Verification of Domain-Based Application Service Identity within Internet Public Key Infrastructure Using X.509 (PKIX) Certificates in the Context of Transport Layer Security (TLS)\", RFC 6125, March 2011.",
      "ja": "[RFC6125] Saint-Andre、P。およびJ. Hodges、「輸送層のセキュリティ（TLS）のコンテキストでX.509（PKIX）証明書を使用したインターネット公開キーインフラストラクチャ内のドメインベースのアプリケーションサービスIDの表現と検証」、RFC 6125、2011年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC6545] Moriarty, K., \"Real-time Inter-network Defense (RID)\", RFC 6545, April 2012.",
      "ja": "[RFC6545] Moriarty、K。、「リアルタイム間のネットワーク間防衛（RID）」、RFC 6545、2012年4月。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "ja": "7.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[RFC3205] Moore, K., \"On the use of HTTP as a Substrate\", BCP 56, RFC 3205, February 2002.",
      "ja": "[RFC3205]ムーア、K。、「基質としてのHTTPの使用について」、BCP 56、RFC 3205、2002年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC4346] Dierks, T. and E. Rescorla, \"The Transport Layer Security (TLS) Protocol Version 1.1\", RFC 4346, April 2006.",
      "ja": "[RFC4346] Dierks、T。およびE. Rescorla、「The Transport Layer Security（TLS）プロトコルバージョン1.1」、RFC 4346、2006年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC5234] Crocker, D. and P. Overell, \"Augmented BNF for Syntax Specifications: ABNF\", STD 68, RFC 5234, January 2008.",
      "ja": "[RFC5234] Crocker、D。およびP. Overell、「構文仕様のためのBNFの増強：ABNF」、STD 68、RFC 5234、2008年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC6046] Moriarty, K. and B. Trammell, \"Transport of Real-time Inter-network Defense (RID) Messages\", RFC 6046, November 2010.",
      "ja": "[RFC6046] Moriarty、K。およびB. Trammell、「リアルタイム間のネットワーク間防衛（RID）メッセージの輸送」、RFC 6046、2010年11月。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者の連絡先"
    },
    {
      "indent": 3,
      "text": "Brian Trammell Swiss Federal Institute of Technology Zurich Gloriastrasse 35 8092 Zurich Switzerland",
      "ja": "ブライアン・トラメル・スイス連邦技術研究所チューリッヒ・グロリア・ストラス35 8092チューリッヒ・スイス"
    },
    {
      "indent": 3,
      "text": "Phone: +41 44 632 70 13\nEMail: trammell@tik.ee.ethz.ch",
      "raw": true,
      "ja": ""
    }
  ]
}