{
  "title": {
    "text": "RFC 6133 - Sieve Email Filtering: Use of Presence Information with Auto-Responder Functionality",
    "ja": "RFC 6133 - ふるい電子メールフィルタリング：自動応答機能を備えた存在情報の使用"
  },
  "number": 6133,
  "created_at": "2023-01-07 13:17:11.697728+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         R. George\nRequest for Comments: 6133                                      B. Leiba\nCategory: Informational                              Huawei Technologies\nISSN: 2070-1721                                              A. Melnikov\n                                                           Isode Limited\n                                                               July 2011",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 5,
      "text": " Sieve Email Filtering: Use of Presence Information with Auto-Responder Functionality",
      "ja": "ふるい電子メールフィルタリング：自動応答機能を備えた存在情報の使用"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document describes how the Sieve email filtering language, along with some extensions, can be used to create automatic replies to incoming electronic mail messages based on the address book and presence information of the recipient.",
      "ja": "このドキュメントでは、Sieve Emailフィルタリング言語といくつかの拡張機能を使用して、アドレス帳と受信者の存在情報に基づいて電子メールメッセージを着信する自動応答を作成する方法について説明します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントは、インターネット標準の追跡仕様ではありません。情報目的で公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントは、インターネットエンジニアリングタスクフォース（IETF）の製品です。IETFコミュニティのコンセンサスを表しています。公開レビューを受けており、インターネットエンジニアリングステアリンググループ（IESG）からの出版が承認されています。IESGによって承認されたすべてのドキュメントが、あらゆるレベルのインターネット標準の候補者ではありません。RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6133.",
      "ja": "このドキュメントの現在のステータス、任意のERRATA、およびそのフィードバックを提供する方法に関する情報は、http：//www.rfc-editor.org/info/rfc6133で取得できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2011 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2011 IETF Trustおよび文書著者として特定された人。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "このドキュメントは、BCP 78およびIETFドキュメント（http://trustee.ietf.org/license-info）に関連するIETF Trustの法的規定の対象となります。この文書に関するあなたの権利と制限を説明するので、これらの文書を注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、セクション4.Eで説明されている法的規定のセクション4.Eで説明されており、単純化されたBSDライセンスで説明されているように保証なしで提供される簡略化されたBSDライセンステキストを含める必要があります。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . . . 2\n2.  How To Create Auto-Replies  . . . . . . . . . . . . . . . . . . 3\n3.  Example Use Cases for Auto-Replies  . . . . . . . . . . . . . . 3\n4.  Security Considerations . . . . . . . . . . . . . . . . . . . . 6\n5.  Normative References  . . . . . . . . . . . . . . . . . . . . . 8",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "This document describes how the Sieve email filtering language [RFC5228], along with some extensions [RFC5230] [RFC5435] [RFC6134] [RFC6132] [RFC6131], can be used to generate automatic replies to incoming electronic mail messages based on the presence information of the recipient. This can be used, for example, to inform the sender that messages will not be answered immediately because the recipient is busy or away.",
      "ja": "このドキュメントでは、Sieveメールのフィルタリング言語[RFC5228]といくつかの拡張機能[RFC5230] [RFC5435] [RFC6134] [RFC6132] [RFC6131]とともに、存在する電子メールメッセージに基づく電子メールメッセージに基づく自動応答を生成するために使用できます。受信者の。これは、たとえば、受信者が忙しいか離れているため、メッセージにはすぐに回答されないことを送信者に通知するために使用できます。"
    },
    {
      "indent": 3,
      "text": "The auto-reply message can additionally be based on information about the sender from the recipient's address book, sub-lists therefrom, or other lists available to the recipient, so that different senders might get different responses. The recipient can create separate rules for friends, family members, colleagues, and so on.",
      "ja": "さらに、Auto Replyメッセージは、受信者のアドレス帳、そこからサブリスト、または受信者が利用できるその他のリストからの送信者に関する情報に基づいているため、異なる送信者が異なる応答を得ることができます。受信者は、友人、家族、同僚などのための個別のルールを作成できます。"
    },
    {
      "indent": 3,
      "text": "This can be used in mail filtering software, email-based information services, and other automatic responder situations. There are many programs currently in use that automatically respond to email. Some of them send many useless or unwanted responses, or send responses to inappropriate addresses. The mechanism described herein will help avoid those problems (but see the discussion in Section 4). Implementations need to take care of tracking previous messages received from the same sender, and they will start or stop sending responses as the presence status of the recipient changes.",
      "ja": "これは、メールフィルタリングソフトウェア、電子メールベースの情報サービス、およびその他の自動レスポンダー状況で使用できます。現在使用されている多くのプログラムがあり、電子メールに自動的に応答しています。それらのいくつかは、多くの役に立たないまたは望ましくない応答を送信するか、不適切なアドレスへの回答を送信します。ここで説明するメカニズムは、これらの問題を回避するのに役立ちます（ただし、セクション4の議論を参照）。実装は、同じ送信者から受信した以前のメッセージを追跡する必要があり、受信者の存在状態が変更されると回答の送信を開始または停止します。"
    },
    {
      "indent": 3,
      "text": "An important note, though: users of any auto-reply mechanism should really think about whether automatic replies are necessary, and at what interval they make sense when they are. Email is not Instant Messaging, and senders generally expect that replies might take a while. Consider whether it's truly important to tell people that you'll read their mail in an hour or so, or whether that can just be taken as how email works. There are times when this makes sense, but let's not use it to exacerbate information overload. Judicious use of appropriate presence information might serve to mitigate these issues.",
      "ja": "ただし、重要な注意事項：自動応答メカニズムのユーザーは、自動応答が必要かどうか、およびそれらがどのような間に意味をなさないかについて本当に考える必要があります。電子メールはインスタントメッセージングではなく、送信者は一般に、返信に時間がかかることを期待しています。1時間ほどでメールを読むことを人々に伝えることが本当に重要か、それが電子メールの仕組みとしてとらえることができるかどうかを考えてください。これが理にかなっている場合がありますが、情報の過負荷を悪化させるためにそれを使用しないでください。適切な存在情報の賢明な使用は、これらの問題を軽減するのに役立つ可能性があります。"
    },
    {
      "indent": 3,
      "text": "Implementors, therefore, need to consider this with respect to the features they expose to users, and the potential for inappropriate use those features represent. The ability to create auto responders might be hidden behind an \"advanced\" button, and users might be warned of the consequences and advised of the considerations in the previous paragraph.",
      "ja": "したがって、実装者は、ユーザーに公開する機能、およびそれらの機能を表す不適切な使用の可能性に関してこれを考慮する必要があります。自動レスポンダーを作成する機能は「高度な」ボタンの後ろに隠されている可能性があり、ユーザーは結果について警告され、前の段落の考慮事項についてアドバイスされる可能性があります。"
    },
    {
      "indent": 0,
      "text": "2. How To Create Auto-Replies",
      "section_title": true,
      "ja": "2. 自動レプリーを作成する方法"
    },
    {
      "indent": 3,
      "text": "When an email message arrives, the Sieve script can use the notify_method_capability of the Notify extension [RFC5435] to check the recipient's presence information. The Notify-presence extension [RFC6132] makes additional presence, such as \"away\" and \"do not disturb\" status, available. The script can use the External-lists extension [RFC6134] to look the sender up in the recipient's address book or other list. If the information retrieved warrants an auto-reply message, the message can then be composed based on that information.",
      "ja": "電子メールメッセージが届くと、SieveスクリプトはNotify Extension [RFC5435]のnotify_method_capabilityを使用して、受信者の存在情報を確認できます。Notify-Presence拡張[RFC6132]は、「アウェイ」や「邪魔しない」ステータスなどの追加の存在を利用可能にします。スクリプトは、外部リスト拡張子[RFC6134]を使用して、受信者のアドレス帳またはその他のリストで送信者を調べることができます。取得された情報が自動応答メッセージを保証する場合、メッセージはその情報に基づいて構成できます。"
    },
    {
      "indent": 3,
      "text": "The Vacation extension [RFC5230] provides an easy way to send the auto-reply message to the sender, as it automatically keeps track of the automatic replies and attempts to avoid excessive messages and mail loops. The Vacation-seconds extension [RFC6131] allows auto-replies to be sent this way more frequently than once per day, when that's appropriate. (Alternatively, the script can use the Notify extension [RFC5435] to send a notification by a means other than email.)",
      "ja": "バケーションエクステンション[RFC5230]は、自動応答を自動的に追跡し、過度のメッセージやメールループを回避しようとする試みを自動的に追跡するため、自動応答メッセージを送信者に簡単に送信する簡単な方法を提供します。休暇秒延長[RFC6131]により、自動レプリーは、適切な場合は1日に1回よりも頻繁にこの方法で送信できます。（または、スクリプトはNotify拡張子[RFC5435]を使用して、電子メール以外の手段で通知を送信することができます。）"
    },
    {
      "indent": 3,
      "text": "Personal and Group Responders can refuse to generate responses except to known correspondents or addresses otherwise known to the recipient. Such responders can also generate different kinds of responses for \"trusted\" vs. \"untrusted\" addresses. This might be useful, for instance, to avoid inappropriate disclosure of personal or confidential information to arbitrary addresses.",
      "ja": "個人およびグループレスポンダーは、受信者に知られている既知の特派員または住所を除き、応答の生成を拒否できます。このようなレスポンダーは、「信頼できる」対「信頼されていない」アドレスのさまざまな種類の応答を生成することもできます。これは、たとえば、個人情報または機密情報のarbitrary意的なアドレスへの不適切な開示を避けるために有用かもしれません。"
    },
    {
      "indent": 0,
      "text": "3. Example Use Cases for Auto-Replies",
      "section_title": true,
      "ja": "3. 自動レプリーのユースケースの例"
    },
    {
      "indent": 3,
      "text": "1. In this example, we check that the envelope \"from\" is in the recipient's address book [RFC6134] and that the recipient's presence shows \"extended away\" [RFC6132]. If both of those are true, the \"vacation\" action [RFC5230] is used to send an auto-reply, making sure we don't reply to the same sender more than once every half hour [RFC6131]. The variables extension [RFC5229] is used to extract the value of the recipient's natural-language presence status message, which will be used as the response to the sender.",
      "ja": "1. この例では、封筒「From」が受信者のアドレス帳[RFC6134]にあること、および受信者の存在が「延長された」[RFC6132]を示していることを確認します。両方が真実である場合、「休暇」アクション[RFC5230]を使用して自動応答を送信し、30分ごとに同じ送信者に1回以上返信しないようにします[RFC6131]。変数拡張[RFC5229]は、送信者への応答として使用される受信者の自然言語存在ステータスメッセージの値を抽出するために使用されます。"
    },
    {
      "indent": 3,
      "text": "require [\"envelope\", \"extlists\", \"enotify\", \"variables\",\n         \"vacation-seconds\"];\nif allof (\n    envelope :list \"from\" \":addrbook:default\",\n    notify_method_capability \"xmpp:me@example.com\" \"show\" \"xa\"\n  ) {\n    # :matches \"*\" is used here to extract the value\n    if notify_method_capability :matches\n        \"xmpp:myjid@example.com\" \"status\" \"*\" {\n      set \"resp_msg\" \"${1}\";\n    } else {\n      set \"resp_msg\" \"Away for a while, without access to email.\";\n    }\n    vacation :handle \"ext-away\" :seconds 1800 \"${resp_msg}\";\n  }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "2. In the next example, we'll check for the recipient's personal assistant, and give very detailed information about the recipient's status to that sender. For other senders in the \"family\" and \"friends\" lists, we'll also send an auto-reply. Other senders will be considered less important, and don't need auto-replies.",
      "ja": "2. 次の例では、受信者のパーソナルアシスタントをチェックし、受信者のステータスに関する非常に詳細な情報をその送信者に提供します。「ファミリー」リストと「フレンズ」リストの他の送信者については、自動繰り返しも送信します。他の送信者はそれほど重要ではないと見なされ、自動レプリーを必要としません。"
    },
    {
      "indent": 3,
      "text": "require [\"envelope\", \"extlists\", \"enotify\", \"vacation-seconds\"];",
      "ja": "[\"envelope\"、 \"extlists\"、 \"enotify\"、 \"休暇秒\"]が必要です。"
    },
    {
      "indent": 3,
      "text": "if envelope :is \"from\" \"assistant@example.com\"\n  {\n    if notify_method_capability \"xmpp:me@example.com\" \"show\" \"away\"\n      {\n        vacation :handle \"away\" :seconds 600\n            \"I'm away for now, but I'll be back soon.\";\n      }\n    elsif notify_method_capability \"xmpp:me@example.com\" \"show\" \"dnd\"\n      {\n        vacation :handle \"dnd\" :seconds 1800\n            \"I'm not to be disturbed.  I'll check mail later.\";\n      }\n    elsif notify_method_capability \"xmpp:me@example.com\" \"show\" \"xa\"\n      {\n        vacation :handle \"ext-away\" :seconds 3600\n            \"I'm away for a while, without access to email.\";\n      }\n    elsif notify_method_capability \"xmpp:me@example.com\" \"busy\" \"yes\"\n      {\n        vacation :handle \"busy\" :seconds 1800\n            \"I'm very busy, but might check email now and then.\";\n      }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "  }\nelsif envelope :list \"from\" [\":addrbook:family\",\n                             \":addrbook:friends\"]\n  {\n    if notify_method_capability \"xmpp:me@example.com\" \"show\"\n           [\"away\", \"dnd\", \"xa\"]\n      {\n        vacation :handle \"away\" :seconds 3600\n            \"I'm not available to respond to email.\";\n      }\n  }\nelse\n  { # We could respond as below, making it only once a day\n    # for less important senders.  Better to just omit\n    # that, though (see the end of the Introduction section).\n    #\n    # vacation :handle \"catchall\" :days 1\n    #     \"I got your message, and might read it eventually.\";\n  }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "3. For this example, if the sender is a work colleague and the recipient is on extended away status, then reply with a message giving alternative contact information. The message might also include details about the reason for the absence, or other personal or confidential information that shouldn't be shared with senders who aren't associated with the recipient's company.",
      "ja": "3. この例では、送信者が作業の同僚であり、受信者が延長されたステータスにある場合は、代替の連絡先情報を与えるメッセージで返信します。メッセージには、不在の理由、または受信者の会社に関連付けられていない送信者と共有されるべきではない他の個人的または機密情報に関する詳細も含まれる場合があります。"
    },
    {
      "indent": 3,
      "text": "require [\"envelope\", \"extlists\", \"enotify\", \"vacation\"];",
      "ja": "[\"envelope\"、 \"extlists\"、 \"enotify\"、 \"vacation\"]が必要です。"
    },
    {
      "indent": 3,
      "text": "if envelope :list \"from\" \":addrbook:co-workers\"\n  {\n    if notify_method_capability \"xmpp:me@example.com\" \"show\" \"xa\"\n      {\n        vacation :handle \"bigtrip\" :days 3\n            \"I'm on an extended business trip to Texas for the Foo\n             project.  Contact my backup, Susan <susan@example.com>,\n             or call my assistant on +1 666 555 1234 if you urgently\n             need to contact me.\";\n      }\n  }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "4. This example is used to send an acknowledgment to every message received. A :seconds value of zero is used to reply to every message, with no removal of duplicates to the same sender. This requires that the Sieve engine allow an interval of zero; if it does not, and it imposes a minimum value, not every message will receive an auto-reply.",
      "ja": "4. この例は、受信したすべてのメッセージに謝辞を送信するために使用されます。A：ゼロの秒値は、すべてのメッセージに返信するために使用され、同じ送信者に複製を削除することはありません。これには、ふるいエンジンがゼロの間隔を可能にする必要があります。そうでない場合、最小値を課す場合、すべてのメッセージが自動修復を受信するわけではありません。"
    },
    {
      "indent": 3,
      "text": "require [\"envelope\", \"extlists\", \"vacation-seconds\"];",
      "ja": "[\"envelope\"、 \"extlists\"、 \"Vacation-Seconds\"]が必要です。"
    },
    {
      "indent": 3,
      "text": "if not envelope :list \"from\" \":addrbook:staff\"\n  {\n    vacation :handle \"auto-resp\" :seconds 0\n        \"Your request has been received.  A service\n         representative will contact you as soon as\n         possible, usually within one business day.\";\n  }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "5. This example uses the same structure to automatically send a copy of each incoming message to the recipient's backup, if the sender is a customer contact or co-worker, or if the message's subject includes the word \"urgent\".",
      "ja": "5. この例では、同じ構造を使用して、送信者が顧客の連絡先または同僚である場合、またはメッセージの件名に「緊急」という単語が含まれている場合、受信者のバックアップに各受信メッセージのコピーを自動的に送信します。"
    },
    {
      "indent": 3,
      "text": "require [\"envelope\", \"extlists\", \"enotify\"];",
      "ja": "[\"envelope\"、 \"extlists\"、 \"enotify\"]を必要とします。"
    },
    {
      "indent": 3,
      "text": "if anyof (\n    envelope :list \"from\" [\":addrbook:customers\",\n                           \":addrbook:co-workers\"],\n    header :contains \"subject\" \"urgent\"\n  ) {\n    if notify_method_capability \"xmpp:me@example.com\" \"show\" \"xa\"\n      {\n        redirect \"susan@example.com\"; # send a copy to my backup\n        keep; # also keep a copy for myself\n      }\n  }\n}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "See the Security Considerations sections of the following specifications for discussion of security considerations not covered here:",
      "ja": "ここでカバーされていないセキュリティ考慮事項の議論については、次の仕様のセキュリティに関する考慮事項セクションを参照してください。"
    },
    {
      "indent": 3,
      "text": "o Sieve base specification [RFC5228]",
      "ja": "o ふるいベース仕様[RFC5228]"
    },
    {
      "indent": 3,
      "text": "o Sieve Vacation extension [RFC5230]",
      "ja": "o シーブバケーションエクステンション[RFC5230]"
    },
    {
      "indent": 3,
      "text": "o Vacation \"Seconds\" parameter [RFC6131] o Sieve Externally Stored Lists extension [RFC6134]",
      "ja": "o 休暇「秒」パラメーター[RFC6131] o外部に保存されたリスト拡張[RFC6134]"
    },
    {
      "indent": 3,
      "text": "o Sieve Notify extension [RFC5435] (and any applicable notification methods)",
      "ja": "o Sieve Notify Extension [RFC5435]（および該当する通知方法）"
    },
    {
      "indent": 3,
      "text": "This document describes how to set up a system that creates automatic replies in an intelligent way. Despite the \"intelligence\", errors in scripts can result in too many auto-reply messages, especially when the reply interval is minimal (using the \"notify\" action, or the \"vacation\" action with a small value for \":seconds\").",
      "ja": "このドキュメントでは、インテリジェントな方法で自動応答を作成するシステムをセットアップする方法について説明します。「インテリジェンス」にもかかわらず、スクリプトのエラーは、特に返信インターバルが最小限の場合（「notify」アクションを使用する、または「秒」の小さな値で「休暇」アクションを使用する場合）の場合、自動応答メッセージが多すぎる可能性があります。。"
    },
    {
      "indent": 3,
      "text": "Despite the \"intelligence\", too, errors in scripts can result in private information getting to senders inappropriately. In example 3 in Section 3, for instance, if the :list test checks the wrong list, or none at all, information about the recipient's business trip might be sent to someone who has no need to know about it, and that information should not have been sent.",
      "ja": "「インテリジェンス」にもかかわらず、スクリプトのエラーは、個人情報が送信者に不適切に到達する可能性があります。たとえば、セクション3の例3では、次の場合、リストテストが間違ったリストをチェックした場合、またはまったくない場合、受信者の出張に関する情報は、それについて知る必要がない人に送られ、その情報はそうすべきではありません。送られました。"
    },
    {
      "indent": 3,
      "text": "Even without errors in scripts, a sender who recognizes that auto-replies are dependent upon the recipient's presence can use that fact to probe the presence information. One result of that can be that the sender discerns changes in the recipient's presence that the sender would normally not be allowed to see, making this an unintentional back door into the user's presence information. Another result is that this can create a \"covert channel\", allowing the recipient to send information to a sender by changing his presence information, his address book, and/or his Sieve script (though in this regard, the exposure is comparable to any other case of shared presence information).",
      "ja": "スクリプトにエラーがなくても、自動レプリーが受信者の存在に依存していることを認識する送信者は、その事実を使用して存在情報を調査できます。その結果、送信者は、送信者が通常見ることが許可されないという受信者の存在の変化を識別し、これをユーザーの存在情報に意図しないバックドアにすることです。別の結果は、これが「カバーチャネル」を作成し、受信者が存在情報、アドレス帳、および/またはふるいスクリプトを変更することで送信者に情報を送信できることです（ただし、この点で、露出は任意に匹敵します。共有存在情報の他のケース）。"
    },
    {
      "indent": 3,
      "text": "An auto responder can cause leaks of other pieces of information, including potentially providing the ability to attack cryptographic keying material. For example, using the time it takes to perform a cryptographic operation, an attacker may obtain information about the secret key. An auto responder that doesn't take timing into account could accidentally leak this kind of information.",
      "ja": "自動レスポンダーは、暗号化キーイン素材を攻撃する能力を潜在的に提供するなど、他の情報の漏れを引き起こす可能性があります。たとえば、暗号操作の実行にかかる時間を使用すると、攻撃者は秘密の鍵に関する情報を取得できます。タイミングを考慮しない自動対応者は、この種の情報を誤って漏らす可能性があります。"
    },
    {
      "indent": 3,
      "text": "Moreover, if an auto responder script directly returns the results of a cryptographic operation, that could also provide an attack vector. For example, if a script returns the results of a decryption operation, an attacker can send an arbitrarily encrypted message and use the results as a chosen cyphertext attack to decode the encryption key. Authors of scripts should be careful about what information they return to senders.",
      "ja": "さらに、Auto Responderスクリプトが暗号化操作の結果を直接返す場合、攻撃ベクトルも提供する可能性があります。たとえば、スクリプトが復号化操作の結果を返す場合、攻撃者は任意に暗号化されたメッセージを送信し、結果を選択したcyphertext攻撃として使用して暗号化キーをデコードできます。スクリプトの著者は、送信者に返す情報に注意する必要があります。"
    },
    {
      "indent": 0,
      "text": "5. Normative References",
      "section_title": true,
      "ja": "5. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC5228] Guenther, P. and T. Showalter, \"Sieve: An Email Filtering Language\", RFC 5228, January 2008.",
      "ja": "[RFC5228] Guenther、P。およびT. Showalter、「Sieve：An Email Filtering Language」、RFC 5228、2008年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC5229] Homme, K., \"Sieve Email Filtering: Variables Extension\", RFC 5229, January 2008.",
      "ja": "[RFC5229] Homme、K。、「Sieve Emailフィルタリング：変数拡張」、RFC 5229、2008年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC5230] Showalter, T. and N. Freed, \"Sieve Email Filtering: Vacation Extension\", RFC 5230, January 2008.",
      "ja": "[RFC5230] Showalter、T。and N. Freed、「Sieve Emailフィルタリング：休暇拡張」、RFC 5230、2008年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC5435] Melnikov, A., Leiba, B., Segmuller, W., and T. Martin, \"Sieve Email Filtering: Extension for Notifications\", RFC 5435, January 2009.",
      "ja": "[RFC5435] Melnikov、A.、Leiba、B.、Segmuller、W。、およびT. Martin、「Sieve Emailフィルタリング：通知の拡張」、RFC 5435、2009年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC6131] George, R. and B. Leiba, \"Sieve Vacation Extension: \"Seconds\" Parameter\", RFC 6131, July 2011.",
      "ja": "[RFC6131] George、R。およびB. Leiba、「Sieve Vacation Extension：「秒」パラメーター」、RFC 6131、2011年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC6132] George, R. and B. Leiba, \"Sieve Notification Using Presence Information\", RFC 6132, July 2011.",
      "ja": "[RFC6132]ジョージ、R。およびB.レイバ、「存在情報を使用したふるい通知」、RFC 6132、2011年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC6134] Melnikov, A. and B. Leiba, \"Sieve Extension: Externally Stored Lists\", RFC 6134, July 2011.",
      "ja": "[RFC6134] Melnikov、A。およびB. Leiba、「Sieve Extension：外部保存リスト」、RFC 6134、2011年7月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Robins George Huawei Technologies Bangalore, Karnataka 560071 India",
      "ja": "ロビンズジョージホーウェイテクノロジーズバンガロール、カルナタカ560071インド"
    },
    {
      "indent": 3,
      "text": "Phone: +91-080-41117676\nEMail: robinsgv@gmail.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Barry Leiba Huawei Technologies",
      "ja": "Barry Leiba Huawei Technologies"
    },
    {
      "indent": 3,
      "text": "Phone: +1 646 827 0648\nEMail: barryleiba@computer.org\nURI:   http://internetmessagingtechnology.org/",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Alexey Melnikov Isode Limited 5 Castle Business Village, 36 Station Road Hampton, Middlesex TW12 2BX UK",
      "ja": "Alexey Melnikov Isode Limited 5 Castle Business Village、36 Station Road Hampton、Middlesex TW12 2BX UK"
    },
    {
      "indent": 3,
      "text": "EMail: Alexey.Melnikov@isode.com\nURI:   http://www.melnikov.ca/",
      "raw": true,
      "ja": ""
    }
  ]
}