{
  "title": {
    "text": "RFC 6483 - Validation of Route Origination Using the Resource Certificate Public Key Infrastructure (PKI) and Route Origin Authorizations (ROAs)",
    "ja": "RFC 6483 - リソース証明書公開鍵インフラストラクチャ（PKI）を使用してルートオリジネーションおよびルート起源権限（資産収益率）の検証"
  },
  "number": 6483,
  "created_at": "2019-10-31 17:00:18.005399+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         G. Huston\nRequest for Comments: 6483                                 G. Michaelson\nCategory: Informational                                            APNIC\nISSN: 2070-1721                                            February 2012",
      "raw": true
    },
    {
      "indent": 6,
      "text": "           Validation of Route Origination Using\nthe Resource Certificate Public Key Infrastructure (PKI) and\n             Route Origin Authorizations (ROAs)",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document defines the semantics of a Route Origin Authorization (ROA) in terms of the context of an application of the Resource Public Key Infrastructure to validate the origination of routes advertised in the Border Gateway Protocol.",
      "ja": "この文書では、ボーダーゲートウェイプロトコルでアドバタイズされたルートの発信を検証するためのリソース公開鍵インフラストラクチャのアプリケーションのコンテキストの面でルート起源許可（ROA）の意味を定義します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 IESGによって承認されていないすべての文書がインターネットStandardのどんなレベルの候補です。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6483.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6483で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2012 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2012 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. ROA Validation Outcomes for a Route .............................3\n3. Applying Validation Outcomes to Route Selection .................5\n4. Disavowal of Routing Origination ................................6\n5. Route Validation Lifetime .......................................6\n6. Security Considerations .........................................7\n7. Acknowledgements ................................................7\n8. References ......................................................8\n   8.1. Normative References .......................................8\n   8.2. Informative References .....................................8",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "This document defines the semantics of a Route Origin Authorization (ROA) in terms of the context of an application of the Resource Public Key Infrastructure (RPKI) [RFC6480] to validate the origination of routes advertised in the Border Gateway Protocol (BGP) [RFC4271].",
      "ja": "この文書では、ボーダーゲートウェイプロトコル（BGP）[RFC4271にアドバタイズされたルートの発信を検証するために、リソースの公開鍵インフラストラクチャ（RPKI）[RFC6480]のアプリケーションのコンテキストの面でルート起源許可（ROA）のセマンティクスを定義します]。"
    },
    {
      "indent": 3,
      "text": "The RPKI is based on a hierarchy of resource certificates that are aligned to the Internet Number Resource allocation structure. Resource certificates are X.509 certificates that conform to the PKIX profile [RFC5280], and to the extensions for IP addresses and AS identifiers [RFC3779]. A resource certificate describes an action by an issuer that binds a list of IP address blocks and Autonomous System (AS) numbers to the subject of a certificate, identified by the unique association of the subject's private key with the public key contained in the resource certificate. The RPKI is structured such that each current resource certificate matches a current resource allocation or assignment. This is further described in [RFC6480].",
      "ja": "RPKIは、インターネット番号リソース配分構造に配列されているリソース証明書の階層に基づいています。リソース証明書は、PKIXプロフィール[RFC5280]、およびIPアドレスのため、識別子として機能拡張に準拠するX.509証明書[RFC3779]です。リソース証明書は、リソース証明書に含まれる公開鍵と対象者の秘密鍵のユニークな関連によって識別される、証明書の対象にIPアドレスブロックと自律システム（AS）番号のリストを結合し、発行者によるアクションを記述します。 RPKIはそれぞれ現在のリソース証明書は現在のリソース割り振りまたは割り当てに一致するように構成されています。これにより、[RFC6480]に記載されています。"
    },
    {
      "indent": 3,
      "text": "ROAs are digitally signed objects that bind an address to an AS number, and are signed by the address holder. A ROA provides a means of verifying that an IP address block holder has authorized a particular AS to originate routes in the inter-domain routing environment for that address block. ROAs are described in [RFC6482]. ROAs are intended to fit within the requirements for adding security to inter-domain routing.",
      "ja": "資産収益率はデジタルAS番号にアドレスをバインドオブジェクトに署名しており、アドレスホルダによって署名されています。 ROAは、アドレスブロックのためのドメイン間ルーティング環境内のルートを発信するようにIPアドレスのブロックホルダが特定のを許可したことを確認する手段を提供します。資産収益率は、[RFC6482]に記載されています。資産収益率は、ドメイン間ルーティングにセキュリティを追加するための要件に適合するように意図されています。"
    },
    {
      "indent": 3,
      "text": "This document describes the semantic interpretation of a ROA, with particular reference to application in inter-domain routing relating to the origination of routes, and the intended scope of the authority that is conveyed in the ROA.",
      "ja": "この文書では、経路の起点、およびROAに搬送される権限の意図された範囲に関連するドメイン間ルーティングでアプリケーションを特に参照して、ROAの意味解釈を記載します。"
    },
    {
      "indent": 0,
      "text": "2. ROA Validation Outcomes for a Route",
      "section_title": true,
      "ja": "ルート2. ROA検証の成果"
    },
    {
      "indent": 3,
      "text": "A \"route\" is unit of information that associates a set of destinations described by an IP address prefix with a set of attributes of a path to those destinations, as defined in Section 1.1 of [RFC4271].",
      "ja": "「ルート」は、[RFC4271]のセクション1.1で定義されるように、これらの目的地へのパスの属性のセットを用いてIPアドレスのプレフィックスによって記述宛先のセットを関連付ける情報の単位です。"
    },
    {
      "indent": 3,
      "text": "A route's \"origin AS\" is defined as follows: If the final path segment of the AS_PATH is of type AS_SEQUENCE, the origin AS is the first element of the sequence (i.e., the AS in the rightmost position with respect to the position of octets in the protocol message). If the AS_PATH contains a path segment of type AS_SET, indicating that the route is an aggregate, then the origin AS cannot be determined. In terms of validation of a route in the context of a routing environment, the address prefix value and the origin AS are used in the ROA validation operation.",
      "ja": "ルートの「原点として」次のように定義される：AS_PATHの最終パスセグメントがタイプAS_SEQUENCEである場合、原点配列オクテットの位置に対して最も右側の位置（すなわち、ASの最初の要素であるのでプロトコル・メッセージで）。 AS_PATHルートが集合体であることを示す、タイプAS_SETの経路セグメントが含まれている場合、原点とは判断できません。ルーティング環境の文脈における経路の検証の観点から、アドレスプレフィックス値と原点ROA検証動作で使用されています。"
    },
    {
      "indent": 3,
      "text": "It is assumed here that a relying party (RP) has access to a local cache of the complete set of valid ROAs when performing validation of a route. (Valid ROAs are defined as ROAs that are determined to be syntactically correct and are signed using a signature that can be verified using the RPKI, as described in [RFC6482].) The RP needs to match a route to one or more valid candidate ROAs in order to determine a validation outcome, which, in turn, can be used to determine the appropriate local actions to perform on the route.",
      "ja": "証明書利用者（RP）は、ルートの検証を行い、有効な資産収益率の完全なセットのローカルキャッシュへのアクセス権を持っているものとします。 （[RFC6482]に記載されるように有効な資産収益率は、構文的に正しいことが決定され、RPKIを使用して検証できるシグネチャを使用して署名された資産収益率として定義される。）RPは、一つ以上の有効な候補資産収益率へのルートを一致させる必要があります次に、経路上で実行するための適切なローカルアクションを決定するために使用することができ、検証結果を決定するためです。"
    },
    {
      "indent": 3,
      "text": "This approach to route origination validation uses a generic model of \"positive\" attestation that has an associated inference that routes that cannot be validated within the RPKI framework would conventionally be interpreted by an RP as \"invalid\". However, the considerations of accommodating environments of partial adoption of the use of ROAs, where only a subset of validly advertised address prefixes have associated published ROAs within the structure of the RPKI, imply some modification to this model of positive attestation. In the context of route validation, it is assumed that once an address prefix is described in a ROA, then this ROA specifically encompasses all address prefixes that are more specific than that described in the ROA. Thus, any route for a more specific address prefix than that described by any valid ROA that does not itself have a matching valid ROA can be considered \"invalid\". However, routes for address prefixes that are not fully described by any single ROA (i.e., those routes whose address prefixes may be an aggregate of address prefixes described in a valid ROA, or have address prefixes where there is no intersection with any valid ROA), and are not matched by any valid ROA and do not have an address prefix that is a more specific address prefix described in any valid ROA, cannot be reliably classified as \"invalid\" in a partial deployment scenario. Such routes have a validation outcome of \"unknown\".",
      "ja": "ルート発信検証に対するこのアプローチは、RPKIフレームワーク内で検証することができないルートが従来「無効」としてRPによって解釈される関連する推論を有する「正」認証の一般的なモデルを使用します。ただし、有効にアドバタイズされたアドレスのプレフィックスのサブセットのみが正認証のこのモデルにいくつかの変更を意味するものでは、RPKIの構造内で公開資産収益率を関連付けた資産収益率、使用の部分採用の収容環境の配慮。ルート検証の文脈では、アドレスプレフィックスがROAに記載された後、このROAは、具体的にROAで説明したものよりも特異的であるすべてのアドレスプレフィックスを包含することが想定されます。このように、自身がマッチングに有効なROAを持っていない任意の有効なROAで説明したものよりも、特定のアドレスプレフィックスのための任意の経路を「無効」とみなすことができます。しかし、完全に任意の単一ROAによって記述されていないアドレスプレフィックスのルート（すなわち、そのアドレスプレフィックス有効ROAに記載のアドレスプレフィックスの集合体であること、またはアドレスプレフィクスを有していてもよく、任意の有効なROAとは交点が存在しないそれらのルート） 、および任意の有効なROAにより一致しないと確実に部分的な展開シナリオで「無効」に分類されない任意の有効なROAで説明した特定のアドレスプレフィックス、あるアドレスプレフィックスを持っていません。このようなルートは、「不明」の検証結果を持っています。"
    },
    {
      "indent": 3,
      "text": "An abstract attribute of a route can be determined as the outcome of this validation procedure, namely a \"validity state\" [BGP-PFX]. The validity state of a route, with a prefix and an origin AS as defined above, when using single ROA for determining this validity state, is summarized in the following table:",
      "ja": "ルートのアブストラクト属性は、この検証手順の結果、すなわち、「有効状態」[BGP-PFX]として求めることができます。この有効状態を決定するための単一のROAを使用する場合、上記で定義した通りASプレフィックスと原点と経路の妥当性状態は、以下の表に要約されます。"
    },
    {
      "indent": 6,
      "text": "     Route    matching  non-matching\nPrefix   AS->   AS         AS\n V           +---------+---------+\nNon-         | unknown | unknown |\nIntersecting |         |         |\n             +---------+---------+\nCovering     | unknown | unknown |\nAggregate    |         |         |\n             +---------+---------+\nmatch ROA    | valid   | invalid |\nprefix       |         |         |\n             +---------+---------+\nMore         |         |         |\nSpecific     | invalid | invalid |\nthan ROA     |         |         |\n             +---------+---------+",
      "raw": true
    },
    {
      "indent": 18,
      "text": "Route's Validity State",
      "ja": "ルートの有効状態"
    },
    {
      "indent": 3,
      "text": "In an environment of a collection of valid ROAs, a route's validity state is considered to be \"valid\" if any ROA provides a \"valid\" outcome. It's validity state is considered to be \"invalid\" if one (or more) ROAs provide an \"invalid\" outcome and no ROAs provide a \"valid\" outcome. Its validity state is considered to be \"unknown\" (or, synonymously, \"not found\" [BGP-PFX]) when no valid ROA can produce either a \"valid\" or an \"invalid\" validity state outcome.",
      "ja": "有効な資産収益率のコレクションの環境では、ルートの妥当性状態は、任意のROAが「有効」な結果を提供する場合、「有効」であると考えられています。これは、1つ（またはそれ以上）の資産収益率は「無効」な結果を提供し、何の資産収益率が「有効」な結果を提供しない場合は状態が「無効」であるとみなされ、有効です。有効なROAは「有効」または「無効」有効状態の結果のいずれかを作ることができないとき、その有効性状態は、（[BGP-PFX]または、同義語として、「見つからない」）、「不明」であると考えられています。"
    },
    {
      "indent": 3,
      "text": "A route validity state is defined by the following procedure:",
      "ja": "ルート妥当性状態は、以下の手順で定義されます。"
    },
    {
      "indent": 6,
      "text": "1. Select all valid ROAs that include a ROAIPAddress value that either matches, or is a covering aggregate of, the address prefix in the route. This selection forms the set of \"candidate ROAs\".",
      "ja": "1. ROAIPAddress値のいずれかの一致を含め、すべての有効な資産収益率を選択するかのカバー集約、ルートのアドレスのプレフィックスです。この選択は、「候補広告費用対効果」のセットを形成しています。"
    },
    {
      "indent": 6,
      "text": "2. If the set of candidate ROAs is empty, then the procedure stops with an outcome of \"unknown\" (or, synonymously, \"not found\", as used in [BGP-PFX]).",
      "ja": "2.候補資産収益率のセットが空である場合、このプロシージャは、「不明」（または、[BGP-PFX]で使用される同義語、「見つかりません」）の結果を用いて停止します。"
    },
    {
      "indent": 6,
      "text": "3. If the route's origin AS can be determined and any of the set of candidate ROAs has an asID value that matches the origin AS in the route, and the route's address prefix matches a ROAIPAddress in the ROA (where \"match\" is defined as where the route's address precisely matches the ROAIPAddress, or where the ROAIPAddress includes a maxLength element, and the route's address prefix is a more specific prefix of the ROAIPAddress, and the route's address prefix length value is less than or equal to the ROAIPAddress maxLength value), then the procedure halts with an outcome of \"valid\".",
      "ja": "決定された候補資産収益率の組のいずれかの経路のように原点に一致するASID値を有し、そしてルートのアドレスプレフィックスが「一致」のように定義されるROA（内ROAIPAddressに一致させることができる3.ルートの起源場合ここで、ルートのアドレスを正確ROAIPAddressがmaxLengthの要素を含むROAIPAddress、または一致し、ルートのアドレスプレフィックスはROAIPAddressのより具体的な接頭辞であり、ルートのアドレスプレフィックス長値が以下）ROAIPAddress maxLengthの値に等しいです。 、その後の手順は、「有効」の結果を停止します。"
    },
    {
      "indent": 6,
      "text": "4. Otherwise, the procedure halts with an outcome of \"invalid\".",
      "section_title": true,
      "ja": "4.それ以外の場合は、手順が「無効」の結果を停止します。"
    },
    {
      "indent": 0,
      "text": "3. Applying Validation Outcomes to Route Selection",
      "section_title": true,
      "ja": "3.ルート選択への検証結果を適用します"
    },
    {
      "indent": 3,
      "text": "Within the framework of the abstract model of the operation of inter-domain routing using BGP [RFC4271], a received prefix announcement from a routing peer is compared to all announcements for this prefix received from other routing peers, and a route selection procedure is used to select the \"best\" route from this candidate set.",
      "ja": "BGP [RFC4271]を使用して、ルーティングドメイン間の動作の抽象モデルの枠組みの中で、この接頭辞は他のルーティングピアから受信するためのルーティングピアから受信されたプレフィックスアナウンスは、すべての発表と比較され、経路選択手順が使用されていますこの候補集合から「最良の」ルートを選択します。"
    },
    {
      "indent": 3,
      "text": "The route's validity state, described in Section 2, of \"valid\", \"invalid\", or \"unknown\" may be used as part of the determination of the local degree of preference, in which case the local order of preference is as follows:",
      "ja": "：「有効」「無効」、または「不明」の第2章に記載された経路の有効状態は、次のように嗜好のローカル順序がある場合に、嗜好のローカル度の判定の一部として使用することができます"
    },
    {
      "indent": 6,
      "text": "\"valid\" is to be preferred over \"unknown\", which is to be preferred over \"invalid\".",
      "ja": "「有効」「無効」よりも優先されるべき、「不明」よりも好ましいです。"
    },
    {
      "indent": 3,
      "text": "It is a matter of local routing policy as to the actions to be undertaken by a routing entity in processing those routes with \"unknown\" validity states. Due to considerations of partial use of ROAs in heterogeneous environments, such as in the public Internet, it is advised that local policy settings should not result in \"unknown\" validity state outcomes being considered as sufficient grounds to reject a route outright from further consideration as a local best route.",
      "ja": "「不明」の有効状態でこれらのルートを処理するには、ルーティングエンティティによって行われるべきアクションについてのローカルルーティングポリシーの問題です。このような公共のインターネットのような異機種環境での資産収益率を部分的に使用を考慮し、ローカルポリシー設定として更なる検討からあからさまなルートを拒否するための十分な根拠とみなされている「不明」の有効状態の結果になってはならないことをお勧めします地元の最適なルート。"
    },
    {
      "indent": 3,
      "text": "It is a matter of local routing policy as to whether routes with an \"invalid\" validity state are considered to be ineligible for further consideration in a route selection process. Potential circular dependence is a consideration here: if the authoritative publication point of the repository of ROAs, or that of any certificate used in relation to an address prefix, is located at an address that lies within the address prefix described in a ROA, then the repository can only be accessed by the RP once a route for the prefix has been accepted by the RP's local routing domain. It is also noted that the propagation time of RPKI objects may be different to the propagation time of routes, and that routes may be learned by an RP's routing system before the RP's local RPKI repository cache picks up the associated ROAs and recognizes them as having a validity state of \"valid\" within the RPKI.",
      "ja": "これは、「無効」の有効状態とルートがルート選択プロセスのさらなる検討のために不適格であると考えられるかどうかのローカルルーティングポリシーの問題です。潜在的な円形の依存性は、ここで考慮すべき事項である：権威出版広告費用対効果のリポジトリの点、またはアドレスプレフィックスに関連して使用される任意の証明書とは、ROAに記載のアドレスプレフィックス内にあるアドレスに配置されている場合、次いでプレフィックスのルートはRPのローカルルーティングドメインによって受理された後、リポジトリはRPによってアクセスすることができます。また、RPKIオブジェクトの伝播時間は、経路の伝播時間に異なっていてもよいことに留意、およびRPのローカルRPKIリポジトリキャッシュは、関連する資産収益率をピックアップとを有するようにそれらを認識する前に、ルートがRPのルーティングシステムによって知ることができるということですRPKI内の「有効」の有効状態。"
    },
    {
      "indent": 0,
      "text": "4. Disavowal of Routing Origination",
      "section_title": true,
      "ja": "ルーティングオリジネーションの4否認"
    },
    {
      "indent": 3,
      "text": "A ROA is a positive attestation that a prefix holder has authorized an AS to originate a route for this prefix into the inter-domain routing system. It is possible for a prefix holder to construct an authorization where no valid AS has been granted any such authority to originate a route for an address prefix. This is achieved by using a ROA where the ROA's subject AS is one that must not be used in any routing context. Specifically, AS 0 is reserved by the IANA such that it may be used to identify non-routed networks [IANA-AS].",
      "ja": "ROAは、プレフィックスホルダがドメイン間ルーティングシステムにこのプレフィクスの経路を発信することを承認した正の証明です。接頭ホルダーがアドレスプレフィックスのルートを発信するためにそのような権限を付与されているように有効な承認を構築することが可能です。これは、AS ROAの対象は、任意のルーティングコンテキストで使用することはできませんいずれかですROAを使用することによって達成されます。 0はIANAによって予約され、具体的には、非ルーティングネットワーク[IANA-AS]を識別するために使用することができるようになっています。"
    },
    {
      "indent": 3,
      "text": "A ROA with a subject of AS 0 (AS 0 ROA) is an attestation by the holder of a prefix that the prefix described in the ROA, and any more specific prefix, should not be used in a routing context.",
      "ja": "（0 AS ROA）AS 0の主題とROAは、接頭辞がROAに記載のプレフィックス、および任意のより具体的なプレフィックスの所有者によって認証され、ルーティングコンテキストで使用すべきではありません。"
    },
    {
      "indent": 3,
      "text": "The route validation procedure, described in Section 2, will provide a \"valid\" outcome if any ROA matches the address prefix and origin AS, even if other valid ROAs would provide an \"invalid\" validation outcome if used in isolation. Consequently, an AS 0 ROA has a lower relative preference than any other ROA that has a routable AS as its subject. This allows a prefix holder to use an AS 0 ROA to declare a default condition that any route that is equal to or more specific than the prefix to be considered \"invalid\", while also allowing other concurrently issued ROAs to describe valid origination authorizations for more specific prefixes.",
      "ja": "任意のROAは、ASアドレスプレフィックスと原点と一致した場合に第2節で説明したルート検証手順は、単独で使用する場合は、他の有効な資産収益率は「無効」の検証結果を提供する場合であっても、「有効」な結果を提供します。したがって、AS 0 ROAは、その対象とASルーティング可能を有する任意の他のROAより低い相対的優先度を有しています。また、より多くの有効な発信の権限を記述するために、他の同時に発行した資産収益率を可能にしながらこれは、接頭ホルダーは、プレフィックスが「無効」と見なされるために以上の特定である任意の経路というデフォルトの状態を宣言するためにAS 0 ROAを使用することができます特定の接頭辞。"
    },
    {
      "indent": 3,
      "text": "By convention, an AS 0 ROA should have a maxLength value of 32 for IPv4 addresses and a maxlength value of 128 for IPv6 addresses; although, in terms of route validation, the same outcome would be achieved with any valid maxLength value, or even if the maxLength element were to be omitted from the ROA.",
      "ja": "慣例により、AS 0 ROAは、IPv4アドレスとIPv6アドレスのための128のMAXLENGTH値32のmaxLengthの値を有するべきです。ルート検証の観点から、同じ結果が有効なmaxLengthの値で達成されるであろう、またはmaxLengthの要素がROAから省略されたとしても、ありません。"
    },
    {
      "indent": 3,
      "text": "Also by convention, an AS 0 ROA should be the only ROA issued for a given address prefix; although again, this is not a strict requirement. An AS 0 ROA may coexist with ROAs that have different subject AS values; although in such cases, the presence or lack of presence of the AS 0 ROA does not alter the route's validity state in any way.",
      "ja": "また慣例により、AS 0 ROAは唯一のROAは、与えられたアドレスプレフィックスのために発行する必要があります。再びものの、これは厳密な要件ではありません。値と異なる被写体を有する資産収益率と共存できるように、0 ROA。このような場合にも、AS 0 ROAの存在の存在または欠如はどのような方法で、ルートの有効状態を変更しません。"
    },
    {
      "indent": 0,
      "text": "5. Route Validation Lifetime",
      "section_title": true,
      "ja": "5.ルート検証生涯"
    },
    {
      "indent": 3,
      "text": "The \"lifetime\" of a validation outcome refers to the time period during which the original validation outcome can be still applied. The implicit assumption here is that when the validation lifetime \"expires\", the route should be re-tested for validity.",
      "ja": "検証結果の「寿命」とは、元の検証結果が依然として適用できる期間を意味します。ここでの暗黙の前提は、検証の有効期間は、「期限が切れる」と、ルートは妥当性について再試験しなければならないということです。"
    },
    {
      "indent": 3,
      "text": "The validation lifetime for a ROA is controlled by the Valid times specified in the end-entity (EE) certificate used to sign the ROA, and the valid times of those certificates in the certification path used to validate the EE certificate. A ROA validation expires at the notAfter field of the signing EE certificate, or at such a time when there is no certification path that can validate the ROA. A ROA issuer may elect to prematurely invalidate a ROA by revoking the EE certificate that was used to sign the ROA.",
      "ja": "ROAの検証寿命はROAに署名するために使用されるエンドエンティティ（EE）証明書に指定した有効時間、及びEE証明書を検証するために使用される証明書パスにおけるそれらの証明書の有効時間によって制御されます。 ROAの検証は、署名EE証明書のnotAfterのフィールドにおいて、又はROAを検証することができない証明書パスが存在しないような時に満了します。 ROAの発行者は、早期ROAに署名するために使用されたEE証明書を取り消すことによりROAを無効にすることを選択することができます。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "ROA issuers should be aware of the validation implication in issuing a ROA, in that a ROA implicitly invalidates all routes that have more specific prefixes with a prefix length greater than maxLength, and all originating AS's other than the AS listed in the collection of ROAs for this prefix.",
      "ja": "ROAの発行体は、ROAが暗黙のうちにmaxLengthのより大きいプレフィックス長で、より具体的な接頭辞を持つすべてのルートを無効にし、すべての元のASの他のASよりも資産収益率の収集のために記載されているという点で、ROAを発行における検証意義を認識する必要がありますこのプレフィックス。"
    },
    {
      "indent": 3,
      "text": "A conservative operational practice would be to ensure the issuing of ROAs for all more specific prefixes with distinct origination ASes prior to the issuing of ROAs for larger encompassing address blocks, in order to avoid inadvertent invalidation of valid routes during ROA generation.",
      "ja": "保守的な動作の練習は、ROA生成中に有効なルートの不注意による無効化を回避するために、より大きな網羅アドレスブロックの資産収益率の発行に先立って異なる発信元のASを持つすべてのより具体的なプレフィックスの資産収益率の発行を保証することであろう。"
    },
    {
      "indent": 3,
      "text": "ROA issuers should also be aware that if they generate a ROA for one origin AS, then if the address prefix holder authorizes multiple ASes to originate routes for a given address prefix, then is necessary for a ROA be generated for every such authorized AS.",
      "ja": "ROAの発行者はまた、彼らは1人の起源のためのROAを生成する場合、アドレスのプレフィックスホルダーが与えられたアドレスプレフィックスのルートを発信するために、複数のASを許可した場合、ASは、AS許可ごとなどのために生成されるROAのために必要であること。注意する必要があります"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgements",
      "section_title": true,
      "ja": "7.謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to acknowledge the helpful contributions of John Scudder and Stephen Kent in preparing this document, and also the contributions of many members of the SIDR working group in response to presentations of this material in SIDR WG sessions. The authors also acknowledge prior work undertaken by Tony Bates, Randy Bush, Tony Li, and Yakov Rekhter as the validation outcomes described here reflect the authentication outcomes and semantics of origin AS verification described in [NLRI-ORIG]. A number of validation concepts relating to a route's validity state presented in [BGP-PFX], edited by Pradosh Mohapatra, et al., have be used in this document.",
      "ja": "著者は、この文書を作成するにはジョン・スカダーとスティーブン・ケントの便利貢献し、またSIDR WGセッションでこの材料のプレゼンテーションに応じて、SIDRワーキンググループの多くのメンバーの貢献を認めたいと思います。著者らはまた、認証の結果と[NLRI-ORIG]に記載されている確認AS起源のセマンティクスを反映し、ここで説明した検証の結果としてトニー・ベイツ、ランディブッシュ、トニー・リー、およびヤコフ・レックターによって行わ前に仕事を認めます。 Pradosh Mohapatraらにより編集[BGP-PFX]に提示経路の妥当性状態に関連する検証概念の数は、本書で使用されてきました。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8.参照文献"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "ja": "8.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC3779] Lynn, C., Kent, S., and K. Seo, \"X.509 Extensions for IP Addresses and AS Identifiers\", RFC 3779, June 2004.",
      "ja": "[RFC3779]リン、C.、ケント、S.、およびK.ソ、 \"IPアドレスとAS識別子のためのX.509拡張機能\"、RFC 3779、2004年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC4271] Rekhter, Y., Ed., Li, T., Ed., and S. Hares, Ed., \"A Border Gateway Protocol 4 (BGP-4)\", RFC 4271, January 2006.",
      "ja": "[RFC4271] Rekhter、Y.、エド。、李、T.、エド。、およびS.野兎、編、 \"ボーダーゲートウェイプロトコル4（BGP-4）\"、RFC 4271、2006年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC5280] Cooper, D., Santesson, S., Farrell, S., Boeyen, S., Housley, R., and W. Polk, \"Internet X.509 Public Key Infrastructure Certificate and Certificate Revocation List (CRL) Profile\", RFC 5280, May 2008.",
      "ja": "[RFC5280]クーパー、D.、Santesson、S.、ファレル、S.、Boeyen、S.、Housley氏、R.、およびW.ポーク、「インターネットX.509公開鍵暗号基盤証明書と証明書失効リスト（CRL）のプロフィール」、RFC 5280、2008年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC6480] Lepinski, M. and S. Kent, \"An Infrastructure to Support Secure Internet Routing\", RFC 6480, February 2012.",
      "ja": "[RFC6480] Lepinski、M.とS.ケント、 \"安全なインターネットルーティングをサポートするインフラストラクチャ\"、RFC 6480、2012年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC6482] Lepinski, M., Kent, S., and D. Kong, \"A Profile for Route Origin Authorizations (ROAs)\", RFC 6482, February 2012.",
      "ja": "[RFC6482] Lepinski、M.、ケント、S.、およびD.コング、 \"ルート起源権限のプロファイル（資産収益率）\"、RFC 6482、2012年2月。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "ja": "8.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[BGP-PFX] Mohapatra, P., Ed., Scudder, J., Ed., Ward, D., Ed., Bush, R., Ed., and R. Austein, Ed., \"BGP Prefix Origin Validation\", Work in Progress, October 2011.",
      "ja": "[BGP-PFX] Mohapatra、P.編、スカダー、J.、編、ウォード、D.、編、ブッシュ、R.、編、及びR. Austeinと、エド。、「BGPプレフィックス起源検証」、進歩、2011年10月に作業。"
    },
    {
      "indent": 3,
      "text": "[IANA-AS] IANA, \"Autonomous System (AS) Numbers\", http://http://www.iana.org/assignments/as-numbers",
      "ja": "[IANA-AS] IANA、 \"自律システム（AS）番号\" は、http：//のhttp：//www.iana.org/assignments/as-numbers"
    },
    {
      "indent": 3,
      "text": "[NLRI-ORIG] Bates, T., Bush, R., Li, T., and Y. Rekhter, \"DNS-based NLRI origin AS verification in BGP\", Work in Progress, January 1998.",
      "ja": "[NLRI-ORIG]ベイツ、T.、ブッシュ、R.、李、T.、およびY. Rekhter、 \"BGPでの検証AS DNSベースのNLRIの起源\"、進歩、1998年1月での作業。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Geoff Huston APNIC",
      "ja": "ジェフ・ヒューストンAPNIC"
    },
    {
      "indent": 3,
      "text": "EMail: gih@apnic.net",
      "ja": "メールアドレス：gih@apnic.net"
    },
    {
      "indent": 3,
      "text": "George Michaelson APNIC",
      "ja": "ジョージ・マイケルソンAPNIC"
    },
    {
      "indent": 3,
      "text": "EMail: ggm@apnic.net",
      "ja": "メールアドレス：ggm@apnic.net"
    }
  ]
}