{
  "title": {
    "text": "RFC 6905 - Requirements for Operations, Administration, and Maintenance (OAM) in Transparent Interconnection of Lots of Links (TRILL)",
    "ja": "RFC 6905 - 運用、管理、およびリンクの多くの透明な相互接続における保守（OAM）の要件（TRILL）"
  },
  "number": 6905,
  "created_at": "2019-11-01 09:55:58.825906+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                   T. Senevirathne\nRequest for Comments: 6905                                         Cisco\nCategory: Informational                                          D. Bond\nISSN: 2070-1721                                                      IBM\n                                                               S. Aldrin\n                                                                   Y. Li\n                                                                  Huawei\n                                                                R. Watve\n                                                                   Cisco\n                                                              March 2013",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Requirements for Operations, Administration, and Maintenance (OAM) in Transparent Interconnection of Lots of Links (TRILL)",
      "ja": "運用、管理、およびリンクの多くの透明な相互接続における保守（OAM）の要件（TRILL）"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "Operations, Administration, and Maintenance (OAM) is a general term used to identify functions and toolsets to troubleshoot and monitor networks. This document presents OAM requirements applicable to the Transparent Interconnection of Lots of Links (TRILL).",
      "ja": "運用、管理、および保守（OAM）は、ネットワークのトラブルシューティングおよび監視するための機能とツールセットを識別するために使用される一般的な用語です。この文書は、リンク（TRILL）の多くの透明な相互接続に適用されるOAMの要件を提示します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 IESGによって承認されていないすべての文書がインターネットStandardのどんなレベルの候補です。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6905.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6905で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2013 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2013 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n   1.1. Scope ......................................................3\n2. Conventions Used in This Document ...............................3\n3. Terminology .....................................................3\n4. OAM Requirements ................................................4\n   4.1. Data Plane .................................................4\n   4.2. Connectivity Verification ..................................5\n        4.2.1. Unicast .............................................5\n        4.2.2. Distribution Trees ..................................5\n   4.3. Continuity Check ...........................................5\n   4.4. Path Tracing ...............................................6\n   4.5. General Requirements .......................................6\n   4.6. Performance Monitoring .....................................7\n        4.6.1. Packet Loss .........................................7\n        4.6.2. Packet Delay ........................................7\n   4.7. ECMP Utilization ...........................................8\n   4.8. Security and Operational Considerations ....................8\n   4.9. Fault Indications ..........................................8\n   4.10. Defect Indications ........................................9\n   4.11. Live Traffic Monitoring ...................................9\n5. Security Considerations .........................................9\n6. References ......................................................9\n   6.1. Normative References .......................................9\n   6.2. Informative References ....................................10\n7. Acknowledgments ................................................11\n8. Contributors ...................................................11",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "The Operations, Administration, and Maintenance (OAM) generally covers various production aspects of a network. In this document, we use the term OAM as defined in [RFC6291].",
      "ja": "運用、管理、および保守（OAM）は、一般に、ネットワークの様々な生産側面を覆っています。 [RFC6291]で定義された、この文書では、用語のOAMを使用します。"
    },
    {
      "indent": 3,
      "text": "The success of network operations depends on the ability to proactively monitor it for faults, performance, etc., as well as the ability to efficiently and quickly troubleshoot defects and failures. A well-defined OAM toolset is a vital requirement for wider adoption of Transparent Interconnection of Lots of Links (TRILL) as the next generation data-forwarding technology in larger networks such as data centers.",
      "ja": "ネットワーク運用の成功は、積極的になど、障害、パフォーマンス、それを監視する能力だけでなく、効率的かつ迅速に欠陥や故障のトラブルシューティングをする能力に依存します。明確に定義されたOAMツールセットは、データセンタなど大規模なネットワークにおける次世代のデータ転送技術としてリンク（TRILL）の多くの透明な相互接続のより広い採用のために不可欠な要件です。"
    },
    {
      "indent": 3,
      "text": "In this document, we define the requirements for TRILL OAM. It is assumed that the readers are familiar with the OAM concepts and terminologies defined in other OAM standards such as [8021ag], [RFC5860], and [RFC4377]. This document does not attempt to redefine the terms and concepts specified elsewhere.",
      "ja": "この文書では、我々は、TRILLのOAMの要件を定義します。読者が、このような[8021ag]、[RFC5860]及び[RFC4377]などの他のOAM標準規格で定義されたOAMの概念と用語に精通しているものとします。本ドキュメントは、他の場所で指定された用語や概念を再定義しようとしません。"
    },
    {
      "indent": 0,
      "text": "1.1. Scope",
      "section_title": true,
      "ja": "1.1。範囲"
    },
    {
      "indent": 3,
      "text": "The scope of this document is OAM between Routing Bridges (RBridges) of a TRILL campus over links selected by TRILL routing.",
      "ja": "この文書の範囲は、TRILLルーティングによって選択されたリンク上TRILLキャンパスのルーティングブリッジ間OAM（RBridges）です。"
    },
    {
      "indent": 0,
      "text": "2. Conventions Used in This Document",
      "section_title": true,
      "ja": "この文書で使用される2.表記"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119]. Although this document is not a protocol specification, the use of this language clarifies the instructions to protocol designers producing solutions that satisfy the requirements set out in this document.",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はありますRFC 2119 [RFC2119]に記載されているように解釈されます。このドキュメントはプロトコル仕様ではありませんが、この言語の使用は、本文書に定める要件を満たすソリューションを生産するプロトコル設計者に指示を明確にしています。"
    },
    {
      "indent": 0,
      "text": "3. Terminology",
      "section_title": true,
      "ja": "3.用語"
    },
    {
      "indent": 3,
      "text": "Section: This term refers to a segment of a path between any two given RBridges. As an example, consider the case where RB1 is connected to RBx via RB2, RB3, and RB4. The segment between RB2 to RB4 is referred to as a section of the path RB1 to RBx. More details of this definition can be found in [RFC5960].",
      "ja": "セクション：この用語は、任意の2つの所与RBridges間のパスのセグメントを指します。一例として、RB1は、RB2、RB3、RB4及び介しRBXに接続されている場合を考えます。 RB4とRB2との間のセグメントは、RBXのパスRB1のセクションと呼ばれています。この定義の詳細は[RFC5960]で見つけることができます。"
    },
    {
      "indent": 3,
      "text": "Flow: This term indicates a set of packets that share the same path and per-hop behavior (such as priority). A flow is typically identified by a portion of the inner payload that affects the hop-by-hop forwarding decisions. This may contain Layer 2 through Layer 4 information.",
      "ja": "フロー：この用語は、同じパスと（優先度など）ホップ単位動作を共有するパケットのセットを示しています。流れは、典型的には、ホップバイホップ転送の決定に影響を与え、内側ペイロードの部分によって識別されます。これは、レイヤ4情報を通じて、レイヤ2が含まれていてもよいです。"
    },
    {
      "indent": 3,
      "text": "All Selectable Least-Cost Paths: This term refers to a subset of all potentially available least-cost paths to a specified destination RBridge that are available (and usable) for forwarding of frames. It is important to note that in practice, due to limitations in implementations, not all available least-cost paths may be selectable for forwarding.",
      "ja": "全て選択可能最小コストパス：この用語は、フレームの転送のために利用可能な（および使用可能）は、指定された宛先RBridgeにすべての潜在的に利用可能な最低コストパスのサブセットを指します。それが原因の実装の制限により、実際にそれを注意することが重要である、ではないすべての利用可能な最小コストパスは、転送のために選択可能であってもよいです。"
    },
    {
      "indent": 3,
      "text": "Connectivity: This term indicates reachability between an arbitrary RBridge RB1 and any other RBridge RB2. The specific path can be either explicit (i.e., associated with a specific flow) or unspecified. Unspecified means that messages used for connectivity verification take whatever path the RBs happen to select. Please refer to [OAMOVER] for details.",
      "ja": "接続性：この用語は、任意のRBridge RB1及び他RBridge RB2との間の到達可能性を示しています。特定のパスは、明示的な（すなわち、特定のフローに関連付けられている）または未指定のいずれかであり得ます。接続性検証のために使用されるメッセージは、RBを選択するために起こるものは何でもパス取る詳細不明の手段。詳細については、[OAMOVER]を参照してください。"
    },
    {
      "indent": 3,
      "text": "Continuity Verification: This term refers to proactive verification of liveliness between two RBridges at periodic intervals and the generation of explicit notification when connectivity failures occur. Please refer to [OAMOVER] for details.",
      "ja": "連続検証：接続障害が発生した場合、この用語は、2つの周期的な間隔でRBridgesと明示的通知の発生との間の活気の積極的な検証を指します。詳細については、[OAMOVER]を参照してください。"
    },
    {
      "indent": 3,
      "text": "Fault: This term refers to an inability to perform a required action, e.g., an unsuccessful attempt to deliver a packet. Please refer to [TERMTP] for definition.",
      "ja": "障害：この用語は、必要なアクション、例えば、パケットを届けるために失敗した試行を実行することができないことを指します。定義について[TERMTP]を参照してください。"
    },
    {
      "indent": 3,
      "text": "Defect: This term refers to an interruption in the normal operation, such that over a period of time no packets are delivered successfully. Please refer to [TERMTP] for definition.",
      "ja": "欠陥：この用語は、ある期間にわたってパケットが正常に配信されないように、通常動作の中断を意味します。定義について[TERMTP]を参照してください。"
    },
    {
      "indent": 3,
      "text": "Failure: This term refers to the termination of the required function over a longer period of time. Persistence of a defect for a period of time is interpreted as a failure. Please refer to [TERMTP] for definition.",
      "ja": "失敗：この用語は、時間の長い期間にわたって必要とされる機能の終了を指します。時間の期間のための欠陥の持続障害として解釈されます。定義について[TERMTP]を参照してください。"
    },
    {
      "indent": 3,
      "text": "Simulated Flow: This term refers to a sequence of OAM-generated packets designed to follow a specific path. The fields of the packets in the simulated flow may or may not be identical to the fields of data packets of an actual flow being simulated. However, the purpose of the simulated flow is to have OAM packets of the simulated flow follow a specific path.",
      "ja": "シミュレートされたフロー：この用語は、特定のパスに従うように設計されたOAM生成されたパケットの配列を指します。シミュレートされたフロー内のパケットのフィールドは、またはシミュレートされた実際のフローのデータ・パケットのフィールドと同一であってもなくてもよいです。しかし、シミュレートされたフローの目的は、シミュレートされたフローのOAMパケットが特定のパスに従うことです。"
    },
    {
      "indent": 0,
      "text": "4. OAM Requirements",
      "section_title": true,
      "ja": "4. OAM要件"
    },
    {
      "indent": 0,
      "text": "4.1. Data Plane",
      "section_title": true,
      "ja": "4.1。データプレーン"
    },
    {
      "indent": 3,
      "text": "OAM frames, utilized for connectivity verification, continuity checks, performance measurements, etc., will by default take whatever path TRILL chooses based on the current topology and per-hop equal-cost path choices. In some cases, it may be required that the OAM frames utilize specific paths. Thus, it MUST be possible to arrange that OAM frames follow the path taken by a specific flow.",
      "ja": "接続性検証のために利用OAMフレーム、連続性チェック、性能測定など、デフォルトでTRILLは、現在のトポロジとホップごとの等コストパスの選択に基づいて選択したどんな経路取ります。場合によっては、OAMフレームが特定のパスを利用することが必要とされ得ます。したがって、OAMフレームが特定のフローによって取られる経路をたどることを配置することが可能でなければなりません。"
    },
    {
      "indent": 3,
      "text": "RBridges MUST have the ability to identify frames that require OAM processing.",
      "ja": "RBridgesは、OAM処理を必要とするフレームを特定する能力を持たなければなりません。"
    },
    {
      "indent": 3,
      "text": "TRILL OAM frames MUST remain within a TRILL campus and MUST NOT be egressed from a TRILL network as native frames.",
      "ja": "TRILL OAMフレームは、TRILLのキャンパス内に留まる必要がありますし、ネイティブフレームなどTRILLネットワークからegressedてはなりません。"
    },
    {
      "indent": 3,
      "text": "OAM MUST have the ability to include all Ethernet traffic types carried by TRILL.",
      "ja": "OAMは、TRILLによって運ばれるすべてのイーサネットトラフィックタイプを含める機能を持たなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.2. Connectivity Verification",
      "section_title": true,
      "ja": "4.2。接続性検証"
    },
    {
      "indent": 0,
      "text": "4.2.1. Unicast",
      "section_title": true,
      "ja": "4.2.1。ユニキャスト"
    },
    {
      "indent": 3,
      "text": "From an arbitrary RBridge RB1, OAM MUST have the ability to verify connectivity to any other RBridge RB2.",
      "ja": "任意のRBridgeのRB1からは、OAMは、他のRBridge RB2への接続性を検証する能力を持たなければなりません。"
    },
    {
      "indent": 3,
      "text": "From an arbitrary RBridge RB1, OAM MUST have the ability to verify connectivity to any other RBridge RB2 for a specific flow via the path associated with the specified flow.",
      "ja": "任意RBridge RB1から、OAMは、指定されたフローに関連付けられたパスを介して特定のフローのための任意の他のRBridge RB2への接続を検証する能力を持たなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.2.2. Distribution Trees",
      "section_title": true,
      "ja": "4.2.2。ディストリビューションツリー"
    },
    {
      "indent": 3,
      "text": "OAM MUST have the ability to verify connectivity from an arbitrary RBridge RB1 to either a specific set of RBridges or all member RBridges, for a specified distribution tree. This functionality is referred to as verification of the unpruned distribution tree.",
      "ja": "OAMは、指定された配信ツリーに対して、RBridgesの特定のセットまたはすべてのメンバRBridgesのいずれかに任意RBridge RB1からの接続を確認する能力を持たなければなりません。この機能は、unpruned分配ツリーの検証と呼ばれています。"
    },
    {
      "indent": 3,
      "text": "OAM MUST have the ability to verify connectivity from an arbitrary RBridge RB1 to either a specific set of RBridges or all member RBridges, for a specified distribution tree and for a specified flow. This functionality is referred to as verification of the pruned tree.",
      "ja": "OAMは、指定された配信ツリーに対して、指定されたフローのため、RBridgesの特定のセットまたはすべてのメンバRBridgesのいずれかに任意RBridge RB1からの接続を確認する能力を持たなければなりません。この機能は、剪定された木の検証と呼ばれています。"
    },
    {
      "indent": 0,
      "text": "4.3. Continuity Check",
      "section_title": true,
      "ja": "4.3。導通チェック"
    },
    {
      "indent": 3,
      "text": "OAM MUST provide functions that allow any arbitrary RBridge RB1 to perform a Continuity Check to any other RBridge.",
      "ja": "OAMは、任意のRBridge RB1は、他のRBridgeへの導通チェックを行うことを可能にする機能を提供しなければなりません。"
    },
    {
      "indent": 3,
      "text": "OAM MUST provide functions that allow any arbitrary RBridge RB1 to perform a Continuity Check to any other RBridge using a path associated with a specified flow.",
      "ja": "OAMは、任意のRBridge RB1は、指定されたフローに関連するパスを使用して、他のRBridgeに導通チェックを行うことを可能にする機能を提供しなければなりません。"
    },
    {
      "indent": 3,
      "text": "OAM SHOULD provide functions that allow any arbitrary RBridge to perform a Continuity Check to any other RBridge over any section of any selectable least-cost path.",
      "ja": "OAMは、任意のRBridgeは、任意選択の最小コスト経路の任意のセクションの上に他のRBridgeに導通チェックを行うことを可能にする機能を提供すべきです。"
    },
    {
      "indent": 3,
      "text": "OAM SHOULD provide the ability to perform a Continuity Check on sections of any selectable path within the network.",
      "ja": "OAMは、ネットワーク内の任意の選択可能なパスのセクションに連続性チェックを実行する機能を提供すべきです。"
    },
    {
      "indent": 3,
      "text": "OAM SHOULD provide the ability to perform a multicast Continuity Check for specified distribution tree(s), as well as specified combinations of distribution trees and flows. The former is referred to as an unpruned multi-destination tree Continuity Check and the latter is referred to as a pruned tree Continuity Check.",
      "ja": "OAMは、指定された配信ツリー（複数可）、ならびに配信ツリーとフローの指定された組み合わせのマルチキャスト導通チェックを実行する能力を提供すべきです。前者はunpruned報ツリー導通チェックと呼ばれ、後者は、剪定ツリー導通チェックと呼ばれています。"
    },
    {
      "indent": 0,
      "text": "4.4. Path Tracing",
      "section_title": true,
      "ja": "4.4。パストレース"
    },
    {
      "indent": 3,
      "text": "OAM MUST provide the ability to trace a path between any two RBridges corresponding to a specified unicast flow.",
      "ja": "OAMは、指定されたユニキャストフローに対応する任意の二つのRBridges間の経路を追跡する能力を提供しなければなりません。"
    },
    {
      "indent": 3,
      "text": "OAM SHOULD provide the ability to trace all selectable least-cost paths between any two RBridges.",
      "ja": "OAMは、任意の2つのRBridges間のすべての選択可能な最小コストの経路を追跡する能力を提供すべきです。"
    },
    {
      "indent": 3,
      "text": "OAM SHOULD provide functionality to trace all branches of a specified distribution tree (unpruned tree).",
      "ja": "OAMは、指定されたディストリビューションツリー（unpruned木）のすべてのブランチを追跡する機能を提供する必要があります。"
    },
    {
      "indent": 3,
      "text": "OAM SHOULD provide functionality to trace all branches of a specified distribution tree for a specified flow (pruned tree).",
      "ja": "OAMは、指定されたフロー（剪定木）に指定したディストリビューションツリーのすべてのブランチを追跡するための機能を提供する必要があります。"
    },
    {
      "indent": 0,
      "text": "4.5. General Requirements",
      "section_title": true,
      "ja": "4.5。一般要件"
    },
    {
      "indent": 3,
      "text": "OAM MUST provide the ability to initiate and maintain multiple concurrent sessions for multiple OAM functions between any arbitrary RBridge RB1 to any other RBridge. In general, multiple OAM operations will run concurrently. For example, proactive continuity checks may take place between RB1 and RB2 at the same time that an operator decides to test connectivity between the same two RBs. Multiple OAM functions and instances of those functions MUST be able to run concurrently without interfering with each other.",
      "ja": "OAMは、他RBridgeに任意RBridge RB1との間に複数のOAM機能のための複数の同時セッションを開始し、維持する能力を提供しなければなりません。一般的には、複数のOAM操作が同時に実行されます。例えば、積極的な連続性チェックは、オペレータが同じ2個のRB間の接続をテストすることを決定すると同時に、RB1とRB2との間に起こり得ます。複数のOAM機能及びこれらの機能のインスタンスが互いに干渉することなく同時に実行できなければなりません。"
    },
    {
      "indent": 3,
      "text": "OAM MUST provide a single OAM framework for all TRILL OAM functions within the scope of this document.",
      "ja": "OAMは、この文書の範囲内でのすべてのTRILLのOAM機能のため単一のOAMフレームワークを提供しなければなりません。"
    },
    {
      "indent": 3,
      "text": "OAM, as practical and as possible, SHOULD reuse functional, operational, and semantic elements of existing OAM standards.",
      "ja": "OAMは、実用的かつ可能な限り、既存のOAM規格の、機能的な運用、およびセマンティック要素を再利用する必要があります。"
    },
    {
      "indent": 3,
      "text": "OAM MUST maintain related error and operational counters. Such counters MUST be accessible via network management applications (e.g., SNMP).",
      "ja": "OAMは、関連するエラーや運用のカウンターを維持しなければなりません。このようなカウンタは、ネットワーク管理アプリケーション（例えば、SNMP）を介してアクセス可能でなければなりません。"
    },
    {
      "indent": 3,
      "text": "OAM functions related to continuity and connectivity checks MUST be able to be invoked either proactively or on demand.",
      "ja": "継続性と接続性チェックに関連するOAM機能は、どちらか積極的にまたはオンデマンドで起動することができなければなりません。"
    },
    {
      "indent": 3,
      "text": "OAM MAY be required to provide the ability to specify a desired response mode for a specific OAM message. The desired response mode can be in-band, out-of-band, or none.",
      "ja": "OAMは、特定のOAMメッセージに対する所望の応答モードを指定する機能を提供するために必要とされ得ます。所望の応答モードは、インバンド、アウトオブバンド、またはなしとすることができます。"
    },
    {
      "indent": 3,
      "text": "The OAM Framework MUST be extensible to include new functionality. For example, the solution needs to include a version number to differentiate older and newer implementations and TLV structures for flexibility to include new information elements.",
      "ja": "OAMフレームワークは、新しい機能を含むように拡張可能でなければなりません。例えば、溶液は、新たな情報要素を含めるための柔軟性のために新旧の実装とTLV構造を区別するために、バージョン番号を含める必要があります。"
    },
    {
      "indent": 3,
      "text": "OAM MAY provide methods to verify control-plane and forwarding-plane alignments.",
      "ja": "OAMは、制御プレーンと転送プレーンアラインメントを確認する方法を提供することができます。"
    },
    {
      "indent": 3,
      "text": "OAM SHOULD leverage existing OAM technologies, where practical.",
      "ja": "OAMは、実用的な既存のOAM技術を活用すべきです。"
    },
    {
      "indent": 0,
      "text": "4.6. Performance Monitoring",
      "section_title": true,
      "ja": "4.6。パフォーマンス監視"
    },
    {
      "indent": 0,
      "text": "4.6.1. Packet Loss",
      "section_title": true,
      "ja": "4.6.1。パケットロス"
    },
    {
      "indent": 3,
      "text": "In this document, the term \"packet loss\" is used as defined in Section 2.4 of [RFC2680].",
      "ja": "[RFC2680]のセクション2.4で定義されるように本書では、用語「パケット損失」が使用されます。"
    },
    {
      "indent": 3,
      "text": "OAM SHOULD provide the ability to measure packet loss statistics for a flow from any arbitrary RBridge RB1 to any other RBridge.",
      "ja": "OAMは、他のRBridgeに任意のRBridge RB1からのフローのためのパケット損失の統計情報を測定する能力を提供する必要があります。"
    },
    {
      "indent": 3,
      "text": "OAM SHOULD provide the ability to measure packet loss statistics over a section for a flow between any arbitrary RBridge RB1 to any other RBridge.",
      "ja": "OAMは、他RBridgeに任意RBridge RB1との間の流れのための区間にわたってパケット損失統計を測定する能力を提供すべきです。"
    },
    {
      "indent": 3,
      "text": "OAM SHOULD provide the ability to measure packet loss statistics between any two RBridges over all least-cost paths.",
      "ja": "OAMはすべて最小コストパス上の任意の2 RBridges間のパケット損失統計を測定する能力を提供する必要があります。"
    },
    {
      "indent": 3,
      "text": "An RBridge SHOULD be able to perform the above packet loss measurement functions either proactively or on demand.",
      "ja": "RBridgeいずれか積極的に又は要求に応じて上記パケット損失測定機能を実行することができるべきです。"
    },
    {
      "indent": 0,
      "text": "4.6.2. Packet Delay",
      "section_title": true,
      "ja": "4.6.2。パケット遅延"
    },
    {
      "indent": 3,
      "text": "There are two types of packet delays -- one-way delay and two-way delay (Round-Trip Delay).",
      "ja": "一方向遅延および双方向の遅延（ラウンドトリップ遅延） - パケット遅延の2種類があります。"
    },
    {
      "indent": 3,
      "text": "One-way delay is defined in [RFC2679] as the time elapsed from the start of transmission of the first bit of a packet by an RBridge until the reception of the last bit of the packet by the destination RBridge.",
      "ja": "一方向遅延は、宛先RBridgeによるパケットの最後のビットを受信するまでRBridgeによりパケットの最初のビットの送信の開始からの経過時間として[RFC2679]で定義されています。"
    },
    {
      "indent": 3,
      "text": "Two-way delay is also referred to as Round-Trip Delay and is defined similar to [RFC2681]; i.e., the time elapsed from the start of transmission of the first bit of a packet from RB1, receipt of the packet at RB2, RB2 sending a response packet back to RB1, and RB1 receiving the last bit of that response packet.",
      "ja": "双方向遅延もラウンドトリップ遅延と呼ばれ、[RFC2681]と同様に定義されます。すなわち、時間は、応答パケットの最後のビットを受信RB1、RB2のパケットの受信、バックRB1に応答パケットを送信RB2、及びRB1からのパケットの最初のビットの送信開始からの経過しました。"
    },
    {
      "indent": 3,
      "text": "OAM SHOULD provide functions to measure two-way delay between two RBridges.",
      "ja": "OAMは2 RBridges間の双方向の遅延を測定するための機能を提供する必要があります。"
    },
    {
      "indent": 3,
      "text": "OAM MAY provide functions to measure one-way delay between two RBridges for a specified flow.",
      "ja": "OAMは、指定されたフローのための2つのRBridges間の一方向遅延を測定する機能を提供することができます。"
    },
    {
      "indent": 3,
      "text": "OAM MAY provide functions to measure one-way delay between two RBridges for a specified flow over a specific section.",
      "ja": "OAMは、特定区間の指定されたフローのための2つのRBridges間の一方向遅延を測定する機能を提供することができます。"
    },
    {
      "indent": 0,
      "text": "4.7. ECMP Utilization",
      "section_title": true,
      "ja": "4.7。 ECMP利用"
    },
    {
      "indent": 3,
      "text": "OAM MAY provide functionality to monitor the effectiveness of per-hop Equal-Cost Multipath (ECMP) hashing. For example, individual RBridges could maintain counters that show how packets are being distributed across equal-cost next hops for a specified destination RBridge or RBridges as a result of ECMP hashing.",
      "ja": "OAMは、ホップごとの等価コストマルチパス（ECMP）ハッシュの有効性を監視するための機能を提供することができます。例えば、個々RBridgesパケットがECMPハッシュの結果として指定された宛先RBridge又はRBridgesの等価コスト次のホップに分散されている方法を示すカウンタを維持することができます。"
    },
    {
      "indent": 0,
      "text": "4.8. Security and Operational Considerations",
      "section_title": true,
      "ja": "4.8。セキュリティと運用に関する注意事項"
    },
    {
      "indent": 3,
      "text": "Methods MUST be provided to protect against exploitation of OAM framework for security and denial-of-service attacks.",
      "ja": "方法は、セキュリティやサービス妨害（DoS）攻撃のOAMフレームワークの搾取から保護するために提供されなければなりません。"
    },
    {
      "indent": 3,
      "text": "Methods MUST be provided to prevent OAM messages from causing congestion in the networks. Periodically generated messages with high frequencies may lead to congestion, hence methods such as shaping or rate limiting SHOULD be utilized.",
      "ja": "方法は、ネットワークの混雑を引き起こしてからOAMメッセージを防止するために設けられなければなりません。定期的に高い周波数を有するメッセージは、整形し、または速度制限などの方法が利用されるべきしたがって、輻輳をもたらす可能性が発生しました。"
    },
    {
      "indent": 3,
      "text": "Certain OAM functions may be utilized to gather operational information such as topology of the network. Methods MUST be provided to prevent unauthorized users accessing OAM functions to gather critical and sensitive information of the network.",
      "ja": "特定のOAM機能は、ネットワークのトポロジーとして動作情報を収集するために利用することができます。方法は、ネットワークの重要な機密情報を収集するために、OAM機能にアクセスする権限のないユーザーを防止するために設けられなければなりません。"
    },
    {
      "indent": 3,
      "text": "OAM packets MUST be limited to within the TRILL campus, and the implementation MUST provide methods to prevent leaking of OAM packets out of the TRILL campus. Additionally, methods MUST be provided to prevent accepting OAM packets from outside the TRILL campus.",
      "ja": "OAMパケットは、TRILLのキャンパス内に制限されなければならない、と実装は、TRILLキャンパスの外にOAMパケットの漏洩を防止するための方法を提供しなければなりません。また、方法は、TRILLキャンパスの外部から受け付けるOAMパケットを防止するために設けられなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.9. Fault Indications",
      "section_title": true,
      "ja": "4.9。適応症フォールト"
    },
    {
      "indent": 3,
      "text": "OAM MUST provide a Fault Indication framework to notify the packet's ingress RBridge or other interested parties (such as syslog servers) about faults.",
      "ja": "OAMは、障害に関するパケットの入口RBridgeか（例えばsyslogサーバなど）その他の利害関係者に通知するための障害表示のフレームワークを提供しなければなりません。"
    },
    {
      "indent": 3,
      "text": "OAM MUST provide functions to selectively enable or disable different types of Fault Indications.",
      "ja": "OAMは、選択的に障害状況の異なる種類を有効または無効にする機能を提供しなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.10. Defect Indications",
      "section_title": true,
      "ja": "4.10。欠陥適応症"
    },
    {
      "indent": 3,
      "text": "OAM SHOULD provide a framework for Defect Detection and Indication.",
      "ja": "OAMは、欠陥検出および表示のためのフレームワークを提供する必要があります。"
    },
    {
      "indent": 3,
      "text": "OAM Defect Detection and Indication Framework SHOULD provide methods to selectively enable or disable Defect Detection per defect type.",
      "ja": "OAM欠陥検出および表示フレームワークを選択的欠陥種ごとに欠陥検出を有効または無効にする方法を提供すべきです。"
    },
    {
      "indent": 3,
      "text": "OAM Defect Detection and Indication Framework SHOULD provide methods to configure Defect Detection thresholds per different types of defects.",
      "ja": "OAM欠陥検出および表示フレームワークは、異なるタイプの欠陥あたりの欠陥検出しきい値を設定するためのメソッドを提供しなければなりません。"
    },
    {
      "indent": 3,
      "text": "OAM Defect Detection and Indication Framework SHOULD provide methods to log defect indications to a locally defined archive (such as log buffer) or Simple Network Management Protocol (SNMP) traps.",
      "ja": "OAM欠陥検出および表示フレームワークは、（ログ・バッファなど）、ローカルに定義されたアーカイブまたは簡易ネットワーク管理プロトコル（SNMP）トラップに欠陥指摘をログに記録する方法を提供する必要があります。"
    },
    {
      "indent": 3,
      "text": "OAM Defect Detection and Indication Framework SHOULD provide a Remote Defect Indication framework that facilitates notifying the originator/owner of the flow experiencing the defect, which is the ingress RBridge.",
      "ja": "OAM欠陥検出および表示フレームワークは入力RBridgeある欠陥を経験フローの発信者/所有者に通知容易リモート障害表示フレームワークを提供しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Remote Defect Indication MAY be either in-band or out-of-band.",
      "ja": "リモート障害表示は、インバンドまたはアウト・オブ・バンドのいずれであってもよいです。"
    },
    {
      "indent": 0,
      "text": "4.11. Live Traffic Monitoring",
      "section_title": true,
      "ja": "4.11。ライブトラフィック監視"
    },
    {
      "indent": 3,
      "text": "OAM implementations MAY provide methods to utilize live traffic for troubleshooting and performance monitoring.",
      "ja": "OAMの実装は、トラブルシューティングやパフォーマンス監視のためのライブトラフィックを利用する方法を提供することができます。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "Security requirements are specified in Section 4.8. For general TRILL security considerations, please refer to [RFC6325].",
      "ja": "セキュリティ要件は、4.8節で指定されています。一般TRILLセキュリティの考慮事項については、[RFC6325]を参照してください。"
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "ja": "6.参照"
    },
    {
      "indent": 0,
      "text": "6.1. Normative References",
      "section_title": true,
      "ja": "6.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC6291] Andersson, L., van Helvoort, H., Bonica, R., Romascanu, D., and S. Mansfield, \"Guidelines for the Use of the \"OAM\" Acronym in the IETF\", BCP 161, RFC 6291, June 2011.",
      "ja": "[RFC6291]アンダーソン、L.、バンHelvoort、H.、Bonica、R.、Romascanu、D.、およびS.マンスフィールド、OAM \"IETFにおける頭字語 \"\" の使用のためのガイドライン\"、BCP 161、RFC 6291 、2011年6月。"
    },
    {
      "indent": 0,
      "text": "6.2. Informative References",
      "section_title": true,
      "ja": "6.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[8021ag] IEEE, \"Virtual Bridged Local Area Networks Amendment 5: Connectivity Fault Management\", IEEE Std 802.1ag-2007, 2007.",
      "ja": "[8021ag] IEEE、 \"仮想ブリッジローカルエリアネットワーク改正5：接続障害管理\"、IEEE STDの802.1ag-2007、2007。"
    },
    {
      "indent": 3,
      "text": "[OAMOVER] Mizrahi, T., Sprecher, N., Bellagamba, E., Y. Weingarten, \"An Overview of Operations, Administration, and Maintenance (OAM) Mechanisms\", Work in Progress, January 2013.",
      "ja": "[OAMOVER]ミズラヒ、T.、Sprecher、N.、Bellagamba、E.、Y.ヴェンガルテン、 \"事業の概要、管理、および保守（OAM）メカニズム\"、進歩、2013年1月での作業。"
    },
    {
      "indent": 3,
      "text": "[RFC2679] Almes, G., Kalidindi, S., and M. Zekauskas, \"A One-way Delay Metric for IPPM\", RFC 2679, September 1999.",
      "ja": "[RFC2679] Almes、G.、Kalidindi、S.、およびM. Zekauskas、 \"一方向IPPMの遅延メトリック\"、RFC 2679、1999年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC2680] Almes, G., Kalidindi, S., and M. Zekauskas, \"A One-way Packet Loss Metric for IPPM\", RFC 2680, September 1999.",
      "ja": "[RFC2680] Almes、G.、Kalidindi、S.、およびM. Zekauskas、 \"IPPMための一方向パケット損失メトリック\"、RFC 2680、1999年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC2681] Almes, G., Kalidindi, S., and M. Zekauskas, \"A Round-trip Delay Metric for IPPM\", RFC 2681, September 1999.",
      "ja": "[RFC2681] Almes、G.、Kalidindi、S.、およびM. Zekauskas、 \"IPPMのラウンドトリップ遅延メトリック\"、RFC 2681、1999年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC4377] Nadeau, T., Morrow, M., Swallow, G., Allan, D., and S. Matsushima, \"Operations and Management (OAM) Requirements for Multi-Protocol Label Switched (MPLS) Networks\", RFC 4377, February 2006.",
      "ja": "[RFC4377]ナドー、T.、モロー、M.、ツバメ、G.、アラン、D.、およびS.松島は、RFC 4377 \"操作とマルチプロトコルラベルの管理（OAM）要件（MPLS）ネットワークのスイッチ\" 、2006年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC5860] Vigoureux, M., Ed., Ward, D., Ed., and M. Betts, Ed., \"Requirements for Operations, Administration, and Maintenance (OAM) in MPLS Transport Networks\", RFC 5860, May 2010.",
      "ja": "[RFC5860] Vigoureux、M.、エド。、ウォード、D.、エド。、およびM.ベッツ、エド。、 \"運用、管理、およびMPLS交通ネットワークのメンテナンス（OAM）のための要件\"、RFC 5860、2010年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC5960] Frost, D., Ed., Bryant, S., Ed., and M. Bocci, Ed., \"MPLS Transport Profile Data Plane Architecture\", RFC 5960, August 2010.",
      "ja": "[RFC5960]フロスト、D.、エド。、ブライアント、S.、エド。、およびM.ボッチ、エド。、 \"MPLS交通データプレーンのアーキテクチャプロフィール\"、RFC 5960、2010年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC6325] Perlman, R., Eastlake 3rd, D., Dutt, D., Gai, S., and A. Ghanwani, \"Routing Bridges (RBridges): Base Protocol Specification\", RFC 6325, July 2011.",
      "ja": "[RFC6325]パールマン、R.、イーストレーク3、D.、ダット、D.、ガイ、S.、およびA. Ghanwani、 \"ルーティングブリッジ（RBridges）：基本プロトコル仕様\"、RFC 6325、2011年7月。"
    },
    {
      "indent": 3,
      "text": "[TERMTP] van Helvoort, H., Ed., Andersson, L., Ed., and N. Sprecher, Ed., \"A Thesaurus for the Terminology used in Multiprotocol Label Switching Transport Profile (MPLS-TP) drafts/RFCs and ITU-T' Transport Network Recommendations\", Work in Progress, February 2013.",
      "ja": "【TERMTP】バンHelvoort、H.編、アンダーソン、L.、エド。、及びN. Sprecher、編、「シソーラストランスポートプロファイル（MPLS-TP）ドラフト/ RFCをマルチプロトコルラベルスイッチングに使用される用語およびITU-T」トランスポートネットワークの推奨事項」、進歩、2013年2月での作業。"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgments",
      "section_title": true,
      "ja": "7.謝辞"
    },
    {
      "indent": 3,
      "text": "Special acknowledgments to IEEE 802.1 chair, Tony Jeffree, for allowing us to solicit comments from IEEE 802.1 group. Also recognized are the comments received from the IEEE group, IESG, Stewart Bryant, Ralph Droms, Adrian Farrel, Benoit Claise, Ayal Lior, and others.",
      "ja": "私たちは、IEEE 802.1グループからのコメントを募集することを可能にするため、802.1椅子、トニーJEFFREEをIEEEする特別な謝辞。また、認識のコメントは、IEEEグループからIESG、スチュワートブライアント、ラルフDroms、エードリアンファレル、ブノワClaise、Ayal LIORなどを受けています。"
    },
    {
      "indent": 0,
      "text": "8. Contributors",
      "section_title": true,
      "ja": "8.協力者"
    },
    {
      "indent": 3,
      "text": "Thomas Narten IBM Corporation 3039 Cornwallis Avenue, PO Box 12195 Research Triangle Park, NC 27709 USA",
      "ja": "トーマスNarten氏IBMコーポレーション3039コーンウォリス・アベニュー、私書箱12195リサーチトライアングルパーク、NC 27709 USA"
    },
    {
      "indent": 3,
      "text": "EMail:narten@us.ibm.com",
      "ja": "メールアドレス：narten@us.ibm.com"
    },
    {
      "indent": 3,
      "text": "Donald Eastlake Huawei Technologies 155 Beaver Street, Milford, MA 01757 USA",
      "ja": "ドナルドイーストレイク華為技術155ビーバー通り、ミルフォード、MA 01757 USA"
    },
    {
      "indent": 3,
      "text": "EMail: d3e3e3@gmail.com",
      "ja": "メールアドレス：d3e3e3@gmail.com"
    },
    {
      "indent": 3,
      "text": "Anoop Ghanwani Dell 350 Holger Way San Jose, CA 95134 USA",
      "ja": "アヌープGhanwaniデル350ホルガー・ウェイサンノゼ、CA 95134 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1-408-571-3500 EMail: Anoop@alumni.duke.edu",
      "ja": "電話：+ 1-408-571-3500 Eメール：Anoop@alumni.duke.edu"
    },
    {
      "indent": 3,
      "text": "Jon Hudson Brocade 120 Holger Way San Jose, CA 95134 USA",
      "ja": "ジョン・ハドソンブロケード120ホルガー・ウェイサンノゼ、CA 95134 USA"
    },
    {
      "indent": 3,
      "text": "EMail: jon.hudson@gmail.com",
      "ja": "メールアドレス：jon.hudson@gmail.com"
    },
    {
      "indent": 3,
      "text": "Naveen Nimmu Broadcom 9th Floor, Building no 9, Raheja Mind space Hi-Tec City, Madhapur, Hyderabad - 500 081 India",
      "ja": "Naveen Nimmu Broadcomの9階、建物なし9、Rahejaマインドスペースハイテック市、マダプル、ハイデラバード -  500 081インド"
    },
    {
      "indent": 3,
      "text": "Phone: +1-408-218-8893 EMail: naveen@broadcom.com",
      "ja": "電話：+ 1-408-218-8893 Eメール：naveen@broadcom.com"
    },
    {
      "indent": 3,
      "text": "Radia Perlman Intel Labs 2700 156th Ave NE, Suite 300, Bellevue, WA 98007 USA",
      "ja": "らぢあ ぺｒｌまん いんてｌ ぁｂｓ ２７００ １５６ｔｈ あゔぇ ね、 すいて ３００、 べっぇゔえ、 わ ９８００７ うさ"
    },
    {
      "indent": 3,
      "text": "Phone: +1-425-881-4824 EMail: radia.perlman@intel.com",
      "ja": "電話：+ 1-425-881-4824 Eメール：radia.perlman@intel.com"
    },
    {
      "indent": 3,
      "text": "Tal Mizrahi Marvell 6 Hamada St. Yokneam, 20692 Israel",
      "ja": "タルミズラヒマーベル6浜田セントYokneam、20692イスラエル"
    },
    {
      "indent": 3,
      "text": "EMail: talmi@marvell.com",
      "ja": "メールアドレス：talmi@marvell.com"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Tissa Senevirathne Cisco Systems 375 East Tasman Drive San Jose, CA 95134 USA",
      "ja": "ティッサSenevirathneシスコシステムズ375西タスマン・ドライブサンノゼ、CA 95134 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1-408-853-2291 EMail: tsenevir@cisco.com",
      "ja": "電話：+ 1-408-853-2291 Eメール：tsenevir@cisco.com"
    },
    {
      "indent": 3,
      "text": "David Bond IBM 4400 North 1st Street San Jose, CA 95134 USA",
      "ja": "デビッド・ボンドIBM 4400北1番街サンノゼ、CA 95134 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1-603-339-7575 EMail: mokon@mokon.net",
      "ja": "電話：+ 1-603-339-7575 Eメール：mokon@mokon.net"
    },
    {
      "indent": 3,
      "text": "Sam Aldrin Huawei Technologies 2330 Central Express Way Santa Clara, CA 95951 USA",
      "ja": "サム・オルドリン華為技術2330セントラルエクスプレスサンタクララ、CA 95951 USA"
    },
    {
      "indent": 3,
      "text": "EMail: aldrin.ietf@gmail.com",
      "ja": "メールアドレス：aldrin.ietf@gmail.com"
    },
    {
      "indent": 3,
      "text": "Yizhou Li Huawei Technologies 101 Software Avenue, Nanjing 210012 China",
      "ja": "技術のY IリットルIH UA周辺101ソフトウェア大通り、南京210012中国"
    },
    {
      "indent": 3,
      "text": "Phone: +86-25-56625375 EMail: liyizhou@huawei.com",
      "ja": "電話：+ 86-25-56625375 Eメール：liyizhou@huawei.com"
    },
    {
      "indent": 3,
      "text": "Rohit Watve Cisco Systems 375 East Tasman Drive San Jose, CA 95134 USA",
      "ja": "Rohit Watveシスコシステムズ375東タスマン・ドライブサンノゼ、CA 95134 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1-408-424-2091 EMail: rwatve@cisco.com",
      "ja": "電話：+ 1-408-424-2091 Eメール：rwatve@cisco.com"
    }
  ]
}