{
  "title": {
    "text": "RFC 6516 - IPv6 Multicast VPN (MVPN) Support Using PIM Control Plane and Selective Provider Multicast Service Interface (S-PMSI) Join Messages",
    "ja": "RFC 6516 - IPv6マルチキャストVPN（MVPN）PIMコントロールプレーンと選択的プロバイダーマルチキャストサービスインタフェース（S-PMSI）を使用して、サポートのJoinメッセージの送信"
  },
  "number": 6516,
  "created_at": "2019-10-27 04:38:39.949862+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                            Y. Cai\nRequest for Comments: 6516                                 E. Rosen, Ed.\nCategory: Standards Track                                   IJ. Wijnands\nISSN: 2070-1721                                            Cisco Systems\n                                                           February 2012",
      "raw": true
    },
    {
      "indent": 6,
      "text": " IPv6 Multicast VPN (MVPN) Support Using PIM Control Plane\nand Selective Provider Multicast Service Interface (S-PMSI)\n                       Join Messages",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "The specification for Multicast Virtual Private Networks (MVPNs) contains an option that allows the use of PIM as the control protocol between provider edge routers. It also contains an option that allows UDP-based messages, known as Selective Provider Multicast Service Interface (S-PMSI) Join messages, to be used to bind particular customer multicast flows to particular tunnels through a service provider's network. This document extends the MVPN specification (RFC 6513) so that these options can be used when the customer multicast flows are IPv6 flows.",
      "ja": "マルチキャスト仮想プライベートネットワーク（MVPNs）の仕様は、プロバイダーエッジルータ間の制御プロトコルとしてPIMの使用を可能にするオプションを含んでいます。また、選択的なプロバイダマルチキャストサービスインタフェース（S-PMSI）として知られているUDPベースのメッセージは、サービスプロバイダのネットワークを介して、特定のトンネルに特定の顧客のマルチキャストフローを結合するために使用されるように、Joinメッセージを可能にするオプションが含まれています。顧客のマルチキャストフローがIPv6フローである場合、これらのオプションを使用することができるように、このドキュメントは、MVPN仕様（RFC 6513）に延びています。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6516.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6516で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2012 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2012 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Specification of Requirements ...................................3\n3. S-PMSI Joins Binding IPv6 Flows to GRE/IPv4 P-Tunnels ...........3\n   3.1. Encoding ...................................................3\n   3.2. Encapsulation of S-PMSI Joins in UDP Datagrams .............4\n4. PE-PE PIM/IPv6 over an IPv4 P-Tunnel ............................4\n5. IANA Considerations .............................................5\n6. Security Considerations .........................................5\n7. Acknowledgments .................................................5\n8. Normative References ............................................5",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The Multicast Virtual Private Network (MVPN) specification [RFC6513] defines the notion of a \"PMSI\" (Provider Multicast Service Interface) and specifies how a PMSI can be instantiated by various kinds of tunnels through a service provider's network (\"P-tunnels\"). It also specifies the procedures for using PIM (Protocol Independent Multicast [RFC4601]) as the control protocol between Provider Edge (PE) routers. When PIM is used as the control protocol, PIM messages are sent through a P-tunnel from one PE in an MVPN to others in the same MVPN. These PIM messages carry customer multicast routing information. However, [RFC6513] does not cover the case where the customer is using IPv6, but the service provider is using P-tunnels created by PIM over an IPv4 infrastructure.",
      "ja": "マルチキャストバーチャルプライベートネットワーク（MVPN）仕様[RFC6513]は、「PMSI」（プロバイダマルチキャスト・サービス・インタフェース）の概念を定義し、PMSIは（「P-トンネル」サービスプロバイダのネットワークを介して、トンネルの様々な種類によってインスタンス化することができる方法を指定します）。それはまた、プロバイダエッジ（PE）ルータ間の制御プロトコルとしてPIM（プロトコル独立マルチキャスト[RFC4601]）を使用するための手順を規定します。 PIMは、制御プロトコルとして使用される場合、PIMメッセージが同じMVPNに他人にMVPNに1つのPEからP-トンネルを介して送信されます。これらのPIMメッセージは、顧客のマルチキャストルーティング情報を運びます。しかしながら、[RFC6513]は、顧客がIPv6を使用しているが、サービス・プロバイダは、IPv4インフラストラクチャを介してPIMによって作成されたP-トンネルを使用している場合をカバーしていません。"
    },
    {
      "indent": 3,
      "text": "The MVPN specification [RFC6513] also specifies \"S-PMSI (Selective PMSI) Join\" messages, which are optionally used to bind particular customer multicast flows to particular P-tunnels. However, the specification does not cover the case where the customer flows are IPv6 flows.",
      "ja": "MVPN仕様[RFC6513]も必要に応じて特定の顧客マルチキャストを結合するために使用される特定のP-トンネルに流れるされたメッセージを、「S-PMSI（選択PMSI）が参加」を指定します。ただし、仕様は顧客の流れがIPv6流れているケースをカバーしていません。"
    },
    {
      "indent": 3,
      "text": "This document extends [RFC6513] by adding the specification for handling customer IPv6 multicast flows when a service provider is using PE-PE PIM and/or S-PMSI Join messages over an IPv4 infrastructure. This document also specifies how to send multiple S-PMSI Join messages in a single UDP datagram.",
      "ja": "この文書は、サービスプロバイダは、IPv4インフラストラクチャを介してメッセージを参加PE-PE PIMおよび/またはS-PMSIを使用しているときに流れる顧客のIPv6マルチキャストを処理するための仕様を追加することによって、[RFC6513]を延びています。また、このドキュメントでは、複数のS-PMSIは、単一のUDPデータグラムにJoinメッセージを送信する方法を指定します。"
    },
    {
      "indent": 3,
      "text": "This document uses terminology defined in [RFC6513]: C-source, C-group, C-flow, P-group, and (C-S,C-G).",
      "ja": "Cソース、C群、C-流れ、P-基、及び（C-S、C-G）：このドキュメントは[RFC6513]で定義された用語を使用します。"
    },
    {
      "indent": 0,
      "text": "2. Specification of Requirements",
      "section_title": true,
      "ja": "要件の2仕様"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "3. S-PMSI Joins Binding IPv6 Flows to GRE/IPv4 P-Tunnels",
      "section_title": true,
      "ja": "3. S-PMSIは、IPv6を結合はGRE / IPv4のP-トンネルに流れジョイン"
    },
    {
      "indent": 3,
      "text": "The S-PMSI Join message is defined in Section 7.4.2.2 of [RFC6513]. These messages contain a type field, and [RFC6513] defines only Type 1 S-PMSI Joins. A Type 1 S-PMSI Join may be used to assign a customer IPv4 (C-S,C-G) flow to a P-tunnel that is created by PIM/IPv4. To transmit data or control packets over such a P-tunnel, the packets are encapsulated in GRE (Generic Routing Encapsulation) within IPv4, as specified in Section 12 of [RFC6513].",
      "ja": "S-PMSI参加メッセージは、[RFC6513]のセクション7.4.2.2で定義されています。これらのメッセージは、S-PMSIジョイン1型を定義タイプフィールド、および[RFC6513]を含みます。 1 S-PMSI参加タイプは顧客のIPv4（C-S、C-G）PIM / IPv4のによって作成されたP-トンネルにフローを割り当てるために使用されてもよいです。 [RFC6513]のセクション12で指定されるように、このようなP-トンネルを介してデータや制御パケットを送信するために、パケットは、IPv4の内GRE（総称ルーティングカプセル化）中に封入されています。"
    },
    {
      "indent": 3,
      "text": "In this document, we define the Type 4 S-PMSI Join. A Type 4 S-PMSI Join may be used to assign a customer IPv6 (C-S,C-G) flow to a P-tunnel that is created by PIM/IPv4. GRE/IPv4 encapsulation is used to send data or control packets on the P-tunnel.",
      "ja": "この文書では、我々はS-PMSI参加型4を定義します。 4 S-PMSI参加タイプは顧客のIPv6（C-S、C-G）PIM / IPv4のによって作成されたP-トンネルにフローを割り当てるために使用されてもよいです。 GRE / IPv4のカプセル化は、P-トンネルでデータや制御パケットを送信するために使用されます。"
    },
    {
      "indent": 0,
      "text": "3.1. Encoding",
      "section_title": true,
      "ja": "3.1. エンコーディング"
    },
    {
      "indent": 4,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Type      |           Length            |    Reserved     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                                                               |\n|                           C-source                            |\n|                                                               |\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                                                               |\n|                           C-group                             |\n|                                                               |\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                           P-group                             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Type (8 bits): 4",
      "ja": "タイプ（8ビット）：4"
    },
    {
      "indent": 3,
      "text": "Length (16 bits): 40, the length in octets of the entire S-PMSI Join message, including the Type, Length, Reserved, C-source, C-group, and P-group fields.",
      "ja": "長さ（16ビット）：40、全体のS-PMSIのオクテットの長さは、タイプ、長さ、予約、C-ソース、C群、およびP-グループフィールドを含むメッセージを、参加。"
    },
    {
      "indent": 3,
      "text": "Reserved (8 bits): this field SHOULD be zero when transmitted and MUST be ignored when received.",
      "ja": "予約（8ビット）：送受信時に無視されなければならない場合、このフィールドはゼロであるべきです。"
    },
    {
      "indent": 3,
      "text": "C-source (128 bits): the IPv6 address of the traffic source in the VPN.",
      "ja": "Cソース（128ビット）：VPNトラフィックのソースのIPv6アドレス。"
    },
    {
      "indent": 3,
      "text": "C-group (128 bits): the IPv6 group address of the multicast traffic.",
      "ja": "C群（128ビット）：マルチキャストトラフィックのIPv6のグループアドレス。"
    },
    {
      "indent": 3,
      "text": "P-group (32 bits): the IPv4 group address identifying the P-tunnel. Data packets sent on this tunnel are encapsulated in IPv4 GRE packets with this group address in the IP destination address field of the outer header.",
      "ja": "Pグループ（32ビット）：P-トンネルを特定のIPv4グループアドレス。このトンネル上で送信されるデータパケットは、外部ヘッダのIP宛先アドレスフィールドにこのグループアドレスとのIPv4 GREパケットにカプセル化されています。"
    },
    {
      "indent": 0,
      "text": "3.2. Encapsulation of S-PMSI Joins in UDP Datagrams",
      "section_title": true,
      "ja": "3.2.  S-PMSIのカプセル化は、UDPデータグラムに参加します"
    },
    {
      "indent": 3,
      "text": "All S-PMSI Joins are encapsulated in UDP datagrams [RFC768]. A Type 4 S-PMSI Join MUST be encapsulated in an IPv6 UDP datagram. The IPv6 source address field of these datagrams SHOULD be the IPv4-mapped IPv6 address [RFC4291] corresponding to the IPv4 address that the originating PE router uses as its source address in the instance of PIM that is used to create the specified P-tunnel.",
      "ja": "すべてのS-PMSIは、UDPデータグラム[RFC768]にカプセル化されている参加します。タイプ4 S-PMSI参加は、IPv6 UDPデータグラムにカプセル化されなければなりません。これらのデータグラムのIPv6のソースアドレスフィールドは、発信PEルータが指定されたP-トンネルを作成するために使用されるPIMのインスタンスにおけるそのソースアドレスとして使用するIPv4アドレスに対応するIPv4射影IPv6アドレス[RFC4291]であるべきです。"
    },
    {
      "indent": 3,
      "text": "A single UDP datagram MAY carry multiple S-PMSI Join messages, as many as can fit entirely within it. If there are multiple S-PMSI Joins in a UDP datagram, they MUST be of the same S-PMSI Join type. The end of the last S-PMSI Join (as determined by the S-PMSI Join length field) MUST coincide with the end of the UDP datagram, as determined by the UDP length field. When processing a received UDP datagram that contains one or more S-PMSI Joins, a router MUST process all the S-PMSI Joins that fit into the datagram.",
      "ja": "単一UDPデータグラムは、完全にその中に収めることができるように、複数のS-PMSIは、できるだけ多くのJoinメッセージを運ぶことができます。複数のS-PMSIは、UDPデータグラムに参加がある場合、それらは同じS-PMSI参加型でなければなりません。 UDP長フィールドによって決定されるように、UDPデータグラムの終わりと一致しなければならない（S-PMSI参加長フィールドによって決定される）最後のS-PMSIの端部が参加します。一つ以上のS-PMSIは参加が含まれている受信したUDPデータグラムを処理する場合、ルータはすべてのS-PMSIは、データグラムにそのフィット感を参加処理しなければなりません。"
    },
    {
      "indent": 0,
      "text": "4. PE-PE PIM/IPv6 over an IPv4 P-Tunnel",
      "section_title": true,
      "ja": "4. PE-PE PIM / IPv6のIPv4の年P-トンネルを介し"
    },
    {
      "indent": 3,
      "text": "If a VPN customer is using PIM over IPv6, but the SP (service provider) is using an IPv4 infrastructure (i.e., is using an IPv4-based control protocol to construct its P-tunnels), then the PE routers will need to originate IPv6 PIM control messages. The IPv6 Source Address field of any such IPv6 PIM control message SHOULD be the IPv4-mapped IPv6 address [RFC4291] corresponding to the IPv4 address that the originating PE router uses as its source address in the instance of PIM that is used to create the specified P-tunnel. If the IPv6 Destination Address field is the multicast address ALL-PIM-ROUTERS, the IPv6 form of the address (ff02::d) is used. These IPv6 PIM control messages are, of course, not transmitted natively over the service provider's network but rather are encapsulated in GRE/IPv4.",
      "ja": "VPN顧客がIPv6上PIMを使用しているが、SP（サービスプロバイダ）がIPv4インフラストラクチャを使用している場合（すなわち、そのP-トンネルを構築するためのIPv4ベースの制御プロトコルを使用して）、次いでPEルータは、IPv6を発信する必要がありますPIMコントロールメッセージ。このようなIPv6のPIM制御メッセージのIPv6のソースアドレスフィールドは、IPv4に対応するIPv4射影IPv6アドレス[RFC4291]であるべきである発信PEルータが指定を作成するために使用されるPIMのインスタンスでその送信元アドレスとして使用し、そのアドレスP-トンネル。 IPv6の宛先アドレスフィールドには、マルチキャストアドレスALL-PIM-ROUTERSある場合は、アドレス（FF02 :: D）のIPv6のフォームが使用されています。これらのIPv6 PIM制御メッセージは、当然のことながら、サービスプロバイダのネットワーク上でネイティブに送信されるのではなく、GRE / IPv4の中に封入されています。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "ja": "5. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "[RFC6513] created an IANA registry for the \"S-PMSI Join Message Type Field\". This document registers a new value in that registry:",
      "ja": "[RFC6513]は、「S-PMSIは、メッセージタイプフィールドに参加しましょう」のIANAレジストリを作成しました。この文書では、そのレジストリに新しい値を登録します。"
    },
    {
      "indent": 6,
      "text": "Value: 4 Description: GRE S-PMSI for IPv6 traffic (unaggregated)",
      "ja": "値：4説明：IPv6トラフィックのGRE S-PMSI（凝集していません）"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "There are no additional security considerations beyond those of [RFC6513].",
      "ja": "[RFC6513]のものを超えて追加のセキュリティ上の考慮事項はありません。"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgments",
      "section_title": true,
      "ja": "7.謝辞"
    },
    {
      "indent": 3,
      "text": "The authors wish to thank DP Ayyadevara, Arjen Boers, Rayen Mohanty, Rajesh Sharma, and Karthik Subramanian.",
      "ja": "著者はDP Ayyadevara、アリエン・ボーア人、Rayen Mohanty、ラジェッシュ・シャルマ、およびカルティクサブラマニアンに感謝したいです。"
    },
    {
      "indent": 0,
      "text": "8. Normative References",
      "section_title": true,
      "ja": "8.引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC768] Postel, J., \"User Datagram Protocol\", STD 6, RFC 768, August 1980.",
      "ja": "[RFC768]ポステル、J.、 \"ユーザ・データグラム・プロトコル\"、STD 6、RFC 768、1980年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC4291] Hinden, R. and S. Deering, \"IP Version 6 Addressing Architecture\", RFC 4291, February 2006.",
      "ja": "[RFC4291] HindenとR.とS.デアリング、 \"IPバージョン6アドレッシング体系\"、RFC 4291、2006年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC4601] Fenner, B., Handley, M., Holbrook, H., and I. Kouvelas, \"Protocol Independent Multicast - Sparse Mode (PIM-SM): Protocol Specification (Revised)\", RFC 4601, August 2006.",
      "ja": "[RFC4601]フェナー、B.、ハンドリー、M.、ホルブルック、H.、およびI. Kouvelas、 \"プロトコル独立マルチキャスト - スパースモード（PIM-SM）：プロトコル仕様（改訂）\"、RFC 4601、2006年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC6513] Rosen, E., Ed., and R. Aggarwal, Ed., \"Multicast in MPLS/BGP IP VPNs\", RFC 6513, February 2012.",
      "ja": "[RFC6513]ローゼン、E.、エド。、およびR.アガルワル、エド。、 \"マルチキャストMPLS / BGP VPNのIPで\"、RFC 6513、2012年2月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Yiqun Cai Cisco Systems, Inc. 170 Tasman Drive San Jose, CA 95134 EMail: ycai@cisco.com",
      "ja": "Yiqunカイシスコシステムズ社170タスマン・ドライブサンノゼ、CA 95134 Eメール：ycai@cisco.com"
    },
    {
      "indent": 3,
      "text": "Eric C. Rosen (editor) Cisco Systems, Inc. 1414 Massachusetts Avenue Boxborough, MA 01719 EMail: erosen@cisco.com",
      "ja": "エリックC.ローゼン（エディタ）シスコ・システムズ・インク1414年マサチューセッツアベニューボックスボロー、MA 01719 Eメール：erosen@cisco.com"
    },
    {
      "indent": 3,
      "text": "IJsbrand Wijnands Cisco Systems, Inc. De kleetlaan 6a Diegem 1831 Belgium EMail: ice@cisco.com",
      "ja": "IJsbrand Wijnandsシスコシステムズ株式会社Kleetlaan 6aはディーゲム1831ベルギーEメール：ice@cisco.com"
    }
  ]
}