{
  "title": {
    "text": "RFC 6625 - Wildcards in Multicast VPN Auto-Discovery Routes",
    "ja": "RFC 6625 - マルチキャストVPN自動検出ルートでワイルドカード"
  },
  "number": 6625,
  "created_at": "2019-10-28 12:05:11.662499+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                     E. Rosen, Ed.\nRequest for Comments: 6625                           Cisco Systems, Inc.\nUpdates: 6514                                            Y. Rekhter, Ed.\nCategory: Standards Track                         Juniper Networks, Inc.\nISSN: 2070-1721                                            W. Henderickx\n                                                          Alcatel-Lucent\n                                                                  R. Qiu\n                                                                  Huawei\n                                                                May 2012",
      "raw": true
    },
    {
      "indent": 12,
      "text": "Wildcards in Multicast VPN Auto-Discovery Routes",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "In Multicast Virtual Private Networks (MVPNs), customer multicast flows are carried in \"tunnels\" through a service provider's network. The base specifications for MVPN define BGP multicast VPN \"auto-discovery routes\" and specify how to use an auto-discovery route to advertise the fact that an individual customer multicast flow is being carried in a particular tunnel. However, those specifications do not provide a way to specify, in a single such route, that multiple customer flows are being carried in a single tunnel. Those specifications also do not provide a way to advertise that a particular tunnel is to be used by default to carry all customer flows, except in the case where that tunnel is joined by all the provider edge routers of the MVPN. This document eliminates these restrictions by specifying the use of \"wildcard\" elements in the customer flow identifiers. With wildcard elements, a single auto-discovery route can refer to multiple customer flows or even to all customer flows.",
      "ja": "マルチキャスト仮想プライベートネットワーク（MVPNs）では、顧客のマルチキャストフローは、サービスプロバイダのネットワークを介して、「トンネル」に搭載されています。 MVPNのための基本仕様は、BGPマルチキャストVPN「自動検出経路」を定義し、個々の顧客のマルチキャストフローが特定のトンネルで搬送されていることを宣伝するために自動検出経路を使用する方法を指定します。しかし、これらの仕様は、複数の顧客フローが単一のトンネルで搬送されていることを、単一のような経路で、指定する方法を提供しません。これらの仕様は、特定のトンネルがそのトンネルをMVPNのすべてのプロバイダエッジルータによって接合されている場合を除き、すべての顧客のフローを運ぶためにデフォルトで使用されることをアドバタイズする方法を提供しません。この文書では、顧客フロー識別子の「ワイルドカード」要素の使用を指定することにより、これらの制限を排除します。ワイルドカード要素を持つ、単一の自動検出ルートは複数の顧客フローに、あるいはすべての顧客のフローを参照することができます。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6625.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6625で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2012 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2012 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n   1.1. Terminology ................................................3\n   1.2. Wildcards in S-PMSI A-D Routes .............................5\n   1.3. Use Cases ..................................................5\n2. Encoding of Wildcards ...........................................7\n3. Finding the Matching S-PMSI A-D Route ...........................8\n   3.1. Finding the Match for Data Transmission ....................8\n   3.2. Finding the Match for Data Reception .......................9\n        3.2.1. Finding the Match for (C-S,C-G) .....................9\n        3.2.2. Finding the Wildcard Match for (C-*,C-G) ............9\n4. Procedures for S-PMSI A-D Routes with Wildcards ................10\n   4.1. Procedures for All Kinds of Wildcards .....................10\n   4.2. Procedures for (C-*,C-G) S-PMSI A-D Routes ................11\n   4.3. Procedures for (C-S,C-*) S-PMSI A-D Routes ................12\n   4.4. Procedures for (C-*,C-*) S-PMSI A-D Routes ................13\n5. Security Considerations ........................................15\n6. Acknowledgments ................................................15\n7. Normative References ...........................................15",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "In Multicast Virtual Private Networks (MVPNs), customer multicast flows are carried in tunnels through a service provider's network. The base specifications for MVPN define BGP multicast VPN \"auto-discovery routes\" and specify how to use an auto-discovery route to advertise the fact that an individual customer multicast flow is being carried in a particular tunnel. However, those specifications do not provide a way to specify, in a single such route, that multiple customer flows are being carried in a single tunnel. Those specifications also do not provide a way to advertise that a particular tunnel is to be used by default to carry all customer flows, except in the case where that tunnel is joined by all the provider edge routers of the MVPN. This document eliminates these restrictions by specifying the use of \"wildcard\" elements in the customer flow identifiers. With wildcard elements, a single auto-discovery route can refer to multiple customer flows or even to all customer flows.",
      "ja": "マルチキャスト仮想プライベートネットワーク（MVPNs）では、顧客のマルチキャストフローは、サービスプロバイダのネットワークを介して、トンネルで運ばれます。 MVPNのための基本仕様は、BGPマルチキャストVPN「自動検出経路」を定義し、個々の顧客のマルチキャストフローが特定のトンネルで搬送されていることを宣伝するために自動検出経路を使用する方法を指定します。しかし、これらの仕様は、複数の顧客フローが単一のトンネルで搬送されていることを、単一のような経路で、指定する方法を提供しません。これらの仕様は、特定のトンネルがそのトンネルをMVPNのすべてのプロバイダエッジルータによって接合されている場合を除き、すべての顧客のフローを運ぶためにデフォルトで使用されることをアドバタイズする方法を提供しません。この文書では、顧客フロー識別子の「ワイルドカード」要素の使用を指定することにより、これらの制限を排除します。ワイルドカード要素を持つ、単一の自動検出ルートは複数の顧客フローに、あるいはすべての顧客のフローを参照することができます。"
    },
    {
      "indent": 0,
      "text": "1.1. Terminology",
      "section_title": true,
      "ja": "1.1. 用語"
    },
    {
      "indent": 3,
      "text": "This document uses terminology from [MVPN] and, in particular, uses the prefixes \"C-\" and \"P-\", as specified in Section 3.1 of [MVPN], to distinguish addresses in the \"customer address space\" from addresses in the \"provider address space\". The following terminology and acronyms are particularly important in this document:",
      "ja": "、[MVPN]の3.1節で指定のアドレスから「顧客のアドレス空間」内のアドレスを区別するために、この文書では、[MVPN]と、特に、接頭辞「C-」を使用し、「P-」からの用語を使用しています「プロバイダのアドレス空間」。以下の用語および略語は、この文書で特に重要です："
    },
    {
      "indent": 6,
      "text": "- MVPN",
      "ja": " -  MVPN"
    },
    {
      "indent": 8,
      "text": "Multicast Virtual Private Network -- a VPN [L3VPN] in which multicast service is offered.",
      "ja": "マルチキャストバーチャルプライベートネットワーク - マルチキャストサービスが提供されているVPN [L3VPN]。"
    },
    {
      "indent": 6,
      "text": "- VRF",
      "ja": " -  VRF"
    },
    {
      "indent": 8,
      "text": "VPN Routing and Forwarding table [L3VPN].",
      "ja": "VPNルーティングおよび転送テーブル[L3VPN]。"
    },
    {
      "indent": 6,
      "text": "- SP",
      "ja": " -  SP"
    },
    {
      "indent": 8,
      "text": "Service Provider.",
      "ja": "サービスプロバイダ。"
    },
    {
      "indent": 6,
      "text": "- P-tunnel",
      "ja": " -  P-トンネル"
    },
    {
      "indent": 8,
      "text": "A tunnel through the network of one or more SPs.",
      "ja": "一の以上のSPのネットワークを介してトンネル。"
    },
    {
      "indent": 6,
      "text": "- C-S",
      "ja": " -  C-S"
    },
    {
      "indent": 8,
      "text": "Multicast Source. A multicast source address, in the address space of a customer network.",
      "ja": "マルチキャストソース。マルチキャスト送信元アドレス、顧客のネットワークのアドレス空間インチ"
    },
    {
      "indent": 6,
      "text": "- C-G",
      "ja": " -  C-G"
    },
    {
      "indent": 8,
      "text": "Multicast Group. A multicast group address (destination address) in the address space of a customer network.",
      "ja": "マルチキャストグループ。顧客ネットワークのアドレス空間内のマルチキャストグループアドレス（宛先アドレス）。"
    },
    {
      "indent": 6,
      "text": "- C-multicast flow or C-flow",
      "ja": " -  C-マルチキャストフロー又はCフロー"
    },
    {
      "indent": 8,
      "text": "A customer multicast flow. Each C-flow is identified by the ordered pair (source address, group address), where each address is in the customer's address space. The identifier of a particular C-flow is usually written as (C-S,C-G).",
      "ja": "顧客のマルチキャストフロー。各C-フローは、各アドレスは、顧客のアドレス空間にある順序対（ソースアドレス、グループ・アドレス）によって識別されます。特にCフローの識別子は、通常（C-S、C-G）のように記述されています。"
    },
    {
      "indent": 6,
      "text": "- RP",
      "ja": " -  RP"
    },
    {
      "indent": 8,
      "text": "A \"Rendezvous Point\", as defined in [PIM].",
      "ja": "「ランデブーポイント」、[PIM]で定義されます。"
    },
    {
      "indent": 6,
      "text": "- C-RP",
      "ja": " -  C-RP"
    },
    {
      "indent": 8,
      "text": "A Rendezvous Point whose address is in the customer's address space.",
      "ja": "そのアドレスがランデブーポイントは、顧客のアドレス空間です。"
    },
    {
      "indent": 6,
      "text": "- Selective P-tunnel",
      "ja": " - 選択的P-トンネル"
    },
    {
      "indent": 8,
      "text": "A P-tunnel that is joined only by Provider Edge (PE) routers that need to receive one or more of the C-flows that are traveling through that P-tunnel.",
      "ja": "のみがP-トンネルを通って移動しているC-フローの一つ以上を受信する必要がプロバイダエッジ（PE）ルータによって接合されているP-トンネル。"
    },
    {
      "indent": 6,
      "text": "- Inclusive P-tunnel",
      "ja": " - インクルーシブP-トンネル"
    },
    {
      "indent": 8,
      "text": "A P-tunnel that is joined by all PE routers that attach to sites of a given MVPN.",
      "ja": "所与MVPNの部位に取り付けるすべてのPEルータによって接合されているP-トンネル。"
    },
    {
      "indent": 6,
      "text": "- S-PMSI A-D route",
      "ja": " -  S-PMSI A-Dの経路"
    },
    {
      "indent": 8,
      "text": "Selective Provider Multicast Service Interface Auto-Discovery route. Carried in BGP Update messages, these routes are used to advertise the fact that particular C-flows are bound to (i.e., are traveling through) particular P-tunnels.",
      "ja": "選択プロバイダマルチキャストサービスインタフェース自動検出ルート。 BGPアップデートメッセージで運ばれ、これらのルートは、特定のC-フローが特定のP-トンネル（即ち、貫通走行している）に結合されているという事実を宣伝するために使用されます。"
    },
    {
      "indent": 3,
      "text": "Familiarity with multicast concepts and terminology [PIM] is also presupposed.",
      "ja": "マルチキャストの概念及び用語[PIM]精通も想定されます。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "1.2. Wildcards in S-PMSI A-D Routes",
      "section_title": true,
      "ja": "1.2.  S-PMSI A-Dのルートにワイルドカード"
    },
    {
      "indent": 3,
      "text": "As specified in [MVPN] and [MVPN-BGP], an S-PMSI A-D route advertises that a particular C-flow is bound to a particular selective P-tunnel.",
      "ja": "【MVPN]および[MVPN-BGP]で指定されるように、S-PMSI A-Dの経路は、特定のC-フローが特定の選択P-トンネルにバインドされていることをアドバタイズします。"
    },
    {
      "indent": 3,
      "text": "The identifier of the specified C-flow, e.g., (C-S,C-G), is encoded into the Network Layer Reachability Information (NLRI) of the S-PMSI A-D route. The identifier of the specified P-tunnel is encoded into an attribute (the \"PMSI Tunnel Attribute\") of the S-PMSI A-D route. Each S-PMSI A-D route thus specifies a single C-flow. To bind multiple C-flows to a single P-tunnel, it is necessary to advertise one S-PMSI A-D route for each C-flow, specifying the same P-tunnel in each such route.",
      "ja": "指定されたC-フロー、例えば、（C-S、C-G）の識別子は、S-PMSI A-Dのルートのネットワーク層到達可能性情報（NLRI）に符号化されます。指定されたP-トンネルの識別子S-PMSI A-Dのルートの属性（「PMSIトンネル属性」）に符号化されます。各S-PMSI A-Dの経路は、従って、単一のC-フローを指定します。単P-トンネルに複数のC-フローを結合するために、このような各経路において同じP-トンネルを指定し、各Cフローのための1つのS-PMSI A-Dのルートをアドバタイズする必要があります。"
    },
    {
      "indent": 3,
      "text": "This document defines OPTIONAL extensions to the procedures and encodings specified in [MVPN] and [MVPN-BGP]. These extensions enable a single S-PMSI A-D route to advertise that multiple C-multicast flows are bound to a single P-tunnel.",
      "ja": "この文書では、[MVPN]と[MVPN-BGP]で指定された手順及びエンコーディングするためのオプションの拡張を定義します。これらの拡張機能は、複数のC-マルチキャストフローは、単一のP-トンネルにバインドされてアドバタイズするために、単一のS-PMSI A-Dの経路を有効にします。"
    },
    {
      "indent": 3,
      "text": "The extensions specified in this document are based on the notion of allowing the NLRI of an S-PMSI A-D route to contain a \"wildcard\". In the NLRI encoding, a wildcard can replace the C-S, the C-G, or both. We use the notation \"C-*\" to denote a wildcard. The extensions allow the NLRI to encode three kinds of wildcards: (C-*,C-*), (C-S,C-*), and (C-*,C-G).",
      "ja": "この文書で指定された拡張子は、S-PMSI A-DのルートのNLRIは「ワイルドカード」を含有させるという概念に基づいています。 NLRI符号化では、ワイルドカードは、C-S、C-G、またはその両方を交換することができます。私たちは、ワイルドカードを示すために表記「C- *」を使用します。 - 、（C-S、C- *）、及び（C  -  *、C-G）（*、C * C）：拡張はNLRIは、ワイルドカードの3種類の符号化を可能にします。"
    },
    {
      "indent": 3,
      "text": "By using wildcards, a PE may be able to reduce the number of S-PMSI A-D routes it originates, thereby improving the scalability of the control plane. There is, however, no impact on data plane scalability, as the number of P-tunnels is not reduced.",
      "ja": "ワイルドカードを使用することにより、PEは、それによって、制御プレーンのスケーラビリティを向上させる、それが由来するS-PMSI A-Dのルートの数を減らすことができるかもしれません。 P-トンネルの数が減少しないように、データプレーンのスケーラビリティに与える影響は、しかしながら、存在しません。"
    },
    {
      "indent": 3,
      "text": "Encoding and detailed procedures are specified in subsequent sections of this document.",
      "ja": "エンコードと詳細な手順については、このドキュメントの後のセクションで指定されています。"
    },
    {
      "indent": 0,
      "text": "1.3. Use Cases",
      "section_title": true,
      "ja": "1.3. ユースケース"
    },
    {
      "indent": 3,
      "text": "There are a number of situations in which it can be useful to use wildcards in the NLRI of an S-PMSI A-D route.",
      "ja": "S-PMSI A-D経路のNLRIにワイルドカードを使用することが有用であり得る状況は多数存在します。"
    },
    {
      "indent": 6,
      "text": "- Using a selective P-tunnel as the default tunnel.",
      "ja": " - デフォルトのトンネルとして選択P-トンネルを使用します。"
    },
    {
      "indent": 8,
      "text": "There are procedures in [MVPN] and [MVPN-BGP] that allow a PE to advertise that it is going to use an inclusive P-tunnel as the P-tunnel on which it will transmit all C-flows by \"default\". However, those documents do not provide any way for a PE to advertise that it is going to use a selective P-tunnel as the P-tunnel on which it will transmit all C-flows by \"default\". Using the extensions defined in this document, a PE can advertise that it is going to use a selective P-tunnel as its default P-tunnel. It does so by advertising an S-PMSI A-D route whose NLRI contains (C-*,C-*).",
      "ja": "PEは、「デフォルト」で全てC-フローを送信するれたP-トンネルとして包括P-トンネルを使用しようとしていることをアドバタイズすることを可能にする[MVPN]と[MVPN-BGP]の手順があります。しかし、それらの文書は、「デフォルト」で、すべてのC-フローを送信先となるP-トンネルとして選択P-トンネルを使用しようとしていることを宣伝するPEのための任意の方法を提供していません。この文書で定義された拡張子を使用して、PEは、デフォルトP-トンネルとして選択P-トンネルを使用しようとしていることを宣伝することができます。それは、そのNLRI含有（ -  *、C * C）S-PMSI A-Dの経路をアドバタイズすることによってそうします。"
    },
    {
      "indent": 6,
      "text": "- Binding multiple C-flows traveling along a customer's Protocol Independent Multicast - Sparse Mode (PIM-SM) shared tree to a single P-tunnel.",
      "ja": "単P-トンネルにスパースモード（PIM-SM）共有ツリー -   - 顧客のプロトコル独立マルチキャストに沿って移動する複数の結合C-流れます。"
    },
    {
      "indent": 8,
      "text": "A PE router may be connected to an MVPN site that contains a customer RP (C-RP). The C-RP may be the root of one or more shared trees. In multicast terminology, these are known as (*,G) trees. By advertising a single S-PMSI A-D route whose NLRI contains the (C-*,C-G) wildcard, the PE can bind all the C-flows traveling along a customer's (*,G) tree to a single P-tunnel. This use case applies only when C-G is a non-bidirectional ASM (Any Source Multicast) group.",
      "ja": "PEルータは、顧客RP（C-RP）を含有MVPNサイトに接続することができます。 C-RPは、一つ以上の共有ツリーのルートであってもよいです。マルチキャスト用語では、これらは、（*、G）木として知られています。そのNLRI（C  -  *、C-G）を含む単一S-PMSI A-Dの経路広告によってワイルドカードを、PEは、単一のP-トンネルに顧客の（*、G）ツリーに沿って移動するすべてのC-フローを結合することができます。このユースケースは、C-Gが非双方向ASM（任意のソースマルチキャスト）基である場合にのみ適用されます。"
    },
    {
      "indent": 6,
      "text": "- Binding multiple C-flows with the same C-group address to a single P-tunnel, even if each such C-flow is traveling along a customer's PIM source tree.",
      "ja": " - このような各Cフローは、顧客のPIMソースツリーに沿って走行している場合でも、単一のP-トンネルに同じC-グループアドレスを持つ複数のC-フローを結合。"
    },
    {
      "indent": 8,
      "text": "A PE router may be connected to an MVPN site containing several multicast sources that are all sending to a common multicast group, along a customer's PIM source trees. Alternatively, the PE may be connected to several sites, each containing at least one source sending to the common multicast group. By advertising a single S-PMSI A-D route whose NLRI contains (C-*,C-G), the PE can bind these C-flows to a single P-tunnel.",
      "ja": "PEルータは、すべての顧客のPIMソース木に沿って、共通のマルチキャストグループに送信しているいくつかのマルチキャスト送信元を含むMVPNサイトに接続することができます。代替的に、PEは、それぞれが共通のマルチキャストグループに送信する少なくとも1つの供給源を含む、いくつかのサイトに接続してもよいです。そのNLRI含み（C  -  *、C-G）は、単一S-PMSI A-Dのルートをアドバタイズすることにより、PEは、単一のP-トンネルにこれらのC-フローを結合することができます。"
    },
    {
      "indent": 8,
      "text": "This use case applies only when the C-group is a non-bidirectional ASM group.",
      "ja": "このユースケースは、C-基は非双方向ASM基である場合にのみ適用されます。"
    },
    {
      "indent": 6,
      "text": "- Binding multiple C-flows with the same C-group address to a single P-tunnel, when those C-flows are traveling along a customer's BIDIR-PIM shared tree.",
      "ja": " - バインディング複数のC-流れるものC-フローが顧客のBIDIR-PIM共有ツリーに沿って移動している単P-トンネルに同じC-グループアドレスと。"
    },
    {
      "indent": 8,
      "text": "This use case applies only when the C-group is a BIDIR-PIM group.",
      "ja": "このユースケースは、C-基はBIDIR-PIM基である場合にのみ適用されます。"
    },
    {
      "indent": 6,
      "text": "- Binding multiple C-flows from a given C-source to a given P-tunnel, irrespective of whether those C-flows all have the same C-group address.",
      "ja": " - かかわらず、それらのすべてが同じC-グループアドレスを持つC-が流れるかどうかの、与えられたP-トンネルに与えCソースから複数のC-フローを結合。"
    },
    {
      "indent": 8,
      "text": "This can be useful when the C-group addresses are SSM (Single Source Multicast) addresses. Suppose, for example, that a given source transmits multiple \"channels\" of information, each with its own C-group address. It may be desirable to bind all these channels to a single P-tunnel, without having to advertise an S-PMSI A-D route for each one.",
      "ja": "C-グループアドレスがSSM（シングルソースマルチキャスト）アドレスである場合に便利です。それ自身のC-グループアドレスを持つ各、所与のソース情報の複数の「チャネル」を送信することを、例えば、と仮定する。それぞれについてS-PMSI A-Dのルートをアドバタイズすることなく、単一のP-トンネルにこれらのすべてのチャネルを結合することが望ましい場合があります。"
    },
    {
      "indent": 3,
      "text": "Of course, a specific C-flow, (C-S,C-G), can always be assigned individually to a particular P-tunnel by advertising an S-PMSI A-D route whose NLRI contains (C-S,C-G).",
      "ja": "もちろん、特定Cフロー、（C-S、C-G）、常にそのNLRI（C-S、C-G）を含むS-PMSI A-Dの経路をアドバタイズすることによって、特定のP-トンネルに個別に割り当てることができます。"
    },
    {
      "indent": 3,
      "text": "In Section 4, we will sometimes speak of an S-PMSI A-D route being ignored. When we say the route is \"ignored\", we do not mean that its normal BGP processing is not done, but that the route is not considered when determining which P-tunnel to use when receiving multicast data, and that the MPLS label values it conveys are not used. We will use \"ignore\" in quotes to indicate this meaning.",
      "ja": "第4節では、我々は時々無視されているS-PMSI A-Dのルートの話をします。我々はルートが「無視」されたと言うとき、私たちは通常のBGP処理が行われていないことを意味するものではありませんが、マルチキャストデータを受信するときに使用するP-トンネルを決定する際の経路は考慮されていないこと、およびMPLSラベルは、それを値ということ伝えるには使用されません。私たちは、この意味を示すために引用符で「無視」を使用します。"
    },
    {
      "indent": 3,
      "text": "This document provides procedures only for the case where the P-tunnels are \"unidirectional\", i.e., point-to-multipoint. The use of \"bidirectional\" (multipoint-to-multipoint) P-tunnels is outside the scope of this document.",
      "ja": "この文書では、すなわち、ポイントツーマルチポイントP-トンネルは「一方向」である場合、手順を提供します。 「双方向」（マルチポイントツーマルチポイント）P-トンネルの使用は、この文書の範囲外です。"
    },
    {
      "indent": 0,
      "text": "2. Encoding of Wildcards",
      "section_title": true,
      "ja": "ワイルドカードの2エンコーディング"
    },
    {
      "indent": 3,
      "text": "Per [MVPN-BGP] Section 4.3, the MCAST-VPN NLRI in an S-PMSI A-D route is encoded as follows:",
      "ja": "[MVPN-BGP]セクション4.3、次のようにS-PMSI A-Dの経路でMCAST-VPN NLRIがコードされます。"
    },
    {
      "indent": 16,
      "text": "+-----------------------------------+\n|      RD   (8 octets)              |\n+-----------------------------------+\n| Multicast Source Length (1 octet) |\n+-----------------------------------+\n|  Multicast Source (variable)      |\n+-----------------------------------+\n|  Multicast Group Length (1 octet) |\n+-----------------------------------+\n|  Multicast Group   (variable)     |\n+-----------------------------------+\n|   Originating Router's IP Addr    |\n+-----------------------------------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "where the \"source length\" and \"group length\" fields always have a non-zero value. This document specifies that a \"zero-length\" source or group represents the corresponding wildcard. Specifically,",
      "ja": "「元の長さ」と「グループ長さ」フィールドは、常に非ゼロ値を有する場合。この文書では、「ゼロ長」ソースまたはグループは、対応するワイルドカードを表すことを指定します。具体的には、"
    },
    {
      "indent": 6,
      "text": "- A source wildcard is encoded as a zero-length source field. That is, the \"multicast source length\" field contains the value 0x00, and the \"multicast source\" field is omitted.",
      "ja": " - ソースのワイルドカードは、長さゼロのソースフィールドとして符号化されます。すなわち、「マルチキャストソースの長さ」フィールドの値は0x00を含み、「マルチキャストソース」フィールドは省略されます。"
    },
    {
      "indent": 6,
      "text": "- A group wildcard is encoded as a zero-length group field. That is, the \"multicast group length\" field contains the value 0x00, and the \"multicast group\" field is omitted.",
      "ja": " - グループのワイルドカードは、長さゼロのグループフィールドとして符号化されます。すなわち、「マルチキャストグループの長さ」フィールドの値は0x00を含み、「マルチキャストグループ」フィールドは省略されます。"
    },
    {
      "indent": 0,
      "text": "3. Finding the Matching S-PMSI A-D Route",
      "section_title": true,
      "ja": "3.マッチングS-PMSI A-Dのルートを見つけます"
    },
    {
      "indent": 3,
      "text": "This section gives the precise rules for determining the S-PMSI A-D route that is \"matched\" by a given (C-S,C-G) or (C-*,C-G). The procedures in Section 4 will make use of the matching rules defined in this section.",
      "ja": "このセクションでは、与えられた（C-S、C-G）または（ -  *、C-G C）によって \"マッチ\" されるS-PMSI A-Dの経路を決定するための正確な規則を与えます。第4の手順は、このセクションで定義されたマッチングルールを利用します。"
    },
    {
      "indent": 3,
      "text": "All matching rules assume the context of a given VRF at a given PE.",
      "ja": "一致するすべてのルールは、所与のPEでの与えられたVRFのコンテキストを想定します。"
    },
    {
      "indent": 3,
      "text": "The rules that a PE applies to find the S-PMSI A-D route that matches a (C-S,C-G) C-flow that it needs to transmit are slightly different than the rules it applies to find the S-PMSI A-D route that matches a (C-S,C-G) C-flow that it needs to receive. These rules are specified in Sections 3.1 and 3.2, respectively.",
      "ja": "PEは、それが送信する必要があること（CS、CG）C-フローと一致S-PMSIのADルートを見つけるために適用されるルールは、（それが一致するS-PMSIのADルートを見つけるために適用されるルールよりもわずかに異なっていますそれが受信する必要があるCS、CG）C-フロー。これらのルールは、それぞれ、セクション3.1および3.2に指定されています。"
    },
    {
      "indent": 3,
      "text": "The S-PMSI A-D route that is matched by a given (C-S,C-G) may change over time, as the result of S-PMSI A-D routes being withdrawn or as a result of new S-PMSI A-D routes being originated and/or advertised. In particular, if (C-S,C-G) matches an S-PMSI A-D route whose NLRI contains (C-*,C-*), the origination or reception of an S-PMSI A-D route whose NLRI contains (C-S,C-G) may cause (C-S,C-G) to match the latter route instead. Note also that the S-PMSI A-D route that matches a given (C-S,C-G) is independent of the order in which the routes were originated or received.",
      "ja": "所与の（CS、CG）によって一致さS-PMSIのAD経路はS-PMSIのADルートの結果として回収されるか、新しいS-PMSIのADルートの結果として発信及び/又は広告されて、時間の経過と共に変化してもよいです。 （CS、CG）は、そのNLRI含有する（C  -  *、C *）S-PMSIのADルートと一致する場合、特に、NLRI含有（CS、CG）S-PMSIのADルートの発信又は受信が発生することがあり（CS、CG）の代わりに、後者の経路と一致します。注また、所与の（C-S、C-G）と一致するS-PMSI A-D経路がルートが発信または受信された順序とは無関係であること。"
    },
    {
      "indent": 0,
      "text": "3.1. Finding the Match for Data Transmission",
      "section_title": true,
      "ja": "3.1. データ伝送のためのマッチを見つけます"
    },
    {
      "indent": 3,
      "text": "Consider a given PE; call it PE1. At any given time, for a given VRF at PE1, there is a (possibly empty) set of S-PMSI A-D routes that PE1 has originated and advertised, but not withdrawn. We will refer to these routes as \"currently originated\" by PE1. Suppose that PE1 needs to transmit a particular C-flow (C-S,C-G) to one or more other PEs. We use the following algorithm to find the S-PMSI A-D route that the C-flow \"matches\":",
      "ja": "所与のPEを考えます。 PE1それを呼び出します。任意の時点で、PE1における所与のVRFのために、PE1が発信およびアドバタイズが、撤回していないS-PMSI A-Dのルートの（おそらく空の）セットが存在します。 PE1によって「現在起源」として私たちは、これらのルートを参照します。 PE1は、1つのまたは複数の他のPEに特にCフロー（C-S、C-G）を送信する必要があると仮定する。私たちは、C-フローが「一致」というS-PMSI A-Dのルートを検索するには、次のアルゴリズムを使用します。"
    },
    {
      "indent": 6,
      "text": "- If there is an S-PMSI A-D route currently originated by PE1, whose NLRI contains (C-S,C-G), the (C-S,C-G) C-flow matches that route.",
      "ja": " - 現在、そのNLRI含み（C-S、C-G）PE1、によって発信S-PMSI A-Dの経路がある場合（C-Sは、C-G）C-フローがそのルートに一致します。"
    },
    {
      "indent": 6,
      "text": "- Otherwise, if there is an S-PMSI A-D route currently originated by PE1, whose NLRI contains (C-S,C-*), AND if C-G is an SSM group address, the (C-S,C-G) C-flow matches that route.",
      "ja": " - それ以外の場合は、現在そのNLRI（C-S、C- *）が含まれ、C-Gは、SSMグループアドレス、（C-S、C-G）である場合、C-フローがそのルートに一致PE1、によって発信S-PMSI A-D経路が存在する場合。"
    },
    {
      "indent": 6,
      "text": "- Otherwise, if there is an S-PMSI A-D route currently originated by PE1, whose NLRI contains (C-*,C-G), AND if C-G is an ASM group address, the (C-S,C-G) C-flow matches that route.",
      "ja": " - それ以外の場合は、現在そのNLRI含み（C  -  *、C-G）PE1、によって発信S-PMSI A-Dの経路がある場合、およびC-Gは、ASMグループアドレスである場合（C-S、C-G）C-フローがそのルートに一致します。"
    },
    {
      "indent": 6,
      "text": "- Otherwise, if there is an S-PMSI A-D route currently originated by PE1, whose NLRI contains (C-*,C-*), the (C-S,C-G) C-flow matches that route.",
      "ja": "現在、そのNLRI含み（C  -  *、C *）PE1、によって発信S-PMSI A-Dの経路が存在する場合それ以外の場合、 - 、（C-Sは、C-G）C-フローは、そのルートに一致します。"
    },
    {
      "indent": 0,
      "text": "3.2. Finding the Match for Data Reception",
      "section_title": true,
      "ja": "3.2. データ受信のためのマッチを見つけます"
    },
    {
      "indent": 3,
      "text": "We refer to an S-PMSI A-D route as being \"installed\" (in a given VRF) if it has been selected by the BGP decision process as the preferred route for its NLRI.",
      "ja": "我々は、そのNLRIのための好ましい経路としてBGP決定プロセスにより選択された場合（所定のVRFに）「インストール」されるものとしてS-PMSI A-Dの経路を指します。"
    },
    {
      "indent": 3,
      "text": "An S-PMSI A-D route is considered to be \"originated by a given PE\" if that PE's IP address is contained in the \"Originating Router's IP Address\" field in the MCAST-VPN NLRI of the route.",
      "ja": "S-PMSI A-D経路がそのPEのIPアドレスがルートのMCAST-VPN NLRIに「発信元ルータのIPアドレス」フィールドに含まれている場合「とは、所与のPEによって発信」していると考えられます。"
    },
    {
      "indent": 0,
      "text": "3.2.1. Finding the Match for (C-S,C-G)",
      "section_title": true,
      "ja": "3.2.1. 以下のためのマッチ（C-S、C-G）を求めます"
    },
    {
      "indent": 3,
      "text": "Suppose that a PE router (call it PE1) needs to receive (C-S,C-G), and that PE1 has chosen another PE router (call it PE2) as the \"upstream PE\" [MVPN] for that flow.",
      "ja": "PEルータ（PE1それを呼び出す）（C-S、C-G）を受信し、PE1は、その流れのための \"上流PE\" などの別のPEルータ（PE2それを呼び出す）[MVPN]を選択していることが必要であると仮定する。"
    },
    {
      "indent": 6,
      "text": "- If there is an installed S-PMSI A-D route originated by PE2, whose NLRI contains (C-S,C-G), then (C-S,C-G) matches that route.",
      "ja": " - そのNLRI含み（C-S、C-G）PE2によって発信インストールS-PMSI A-Dの経路がある場合、（C-S、C-G）は、そのルートに一致します。"
    },
    {
      "indent": 6,
      "text": "- Otherwise, if there is an installed S-PMSI A-D route originated by PE2, whose NLRI contains (C-S,C-*), AND if C-G is an SSM multicast group address, then (C-S,C-G) matches that route.",
      "ja": " - そうでなければ、そのNLRI（C- *、C-S）を含むPE2によって発信インストールS-PMSI A-D経路が、存在する場合、およびC-GはSSMマルチキャストグループアドレスである場合、（C-S、C-G）は、そのルートに一致。"
    },
    {
      "indent": 6,
      "text": "- Otherwise, if there is an installed S-PMSI A-D route originated by PE2, whose NLRI contains (C-*,C-G), AND if C-G is an ASM multicast group address, then (C-S,C-G) matches that route.",
      "ja": " - そうでなければ、そのNLRI含有する（C  -  *、C-G）PE2によって発信インストールS-PMSI A-D経路が、存在する場合、およびC-Gは、ASMマルチキャストグループアドレスである場合、（C-S、C-G）は、そのルートに一致。"
    },
    {
      "indent": 6,
      "text": "- Otherwise, if there is an installed S-PMSI A-D route originated by PE2, whose NLRI contains (C-*,C-*), then (C-S,C-G) matches that route.",
      "ja": "そのNLRI含み（C  -  *、C *）PE2によって発信インストールS-PMSI A-D経路が、存在する場合それ以外の場合、 - 、その後、（C-S、C-G）は、そのルートに一致します。"
    },
    {
      "indent": 0,
      "text": "3.2.2. Finding the Wildcard Match for (C-*,C-G)",
      "section_title": true,
      "ja": "3.2.2. 以下のためのワイルドカードマッチを見つける（C  -  *、C-G）"
    },
    {
      "indent": 3,
      "text": "Suppose that a PE router (call it PE1) needs to receive (C-*,C-G) traffic. Note that even if (C-*,C-G) matches a non-wildcard S-PMSI A-D route (as detailed in Section 12.3 of [MVPN-BGP]), it may also match one or more wildcard S-PMSI A-D routes, as specified below.",
      "ja": "トラフィック -  PEルータ（PE1それを呼び出す）（*、C-G C）を受信する必要があると仮定する。 、それはまた、1つ以上のワイルドカードS-PMSIのADルートを一致させることができる（[MVPN-BGPは]のセクション12.3に詳述するように） - （*、CG C）として、非ワイルドカードS-PMSIのADルートと一致する場合でもことに注意してください以下に指定。"
    },
    {
      "indent": 3,
      "text": "If on PE1 there is an installed S-PMSI A-D route originated by PE2, whose NLRI contains (C-*,C-G), then (C-*,C-G) matches this route if one of the following conditions holds:",
      "ja": "PE1にそのNLRI含み（C  -  *、C-G）PE2によって発信インストールS-PMSI A-Dの経路がある場合、（C  -  *、C-G）は、次のいずれかの条件が成立する場合は、このルートに一致します。"
    },
    {
      "indent": 6,
      "text": "- PE1 determines that PE2 is the \"upstream\" PE [MVPN] for the C-RP of C-G, or",
      "ja": " -  PE1 PE2はC-GのC-RPのための \"上流\" PE [MVPN]であると判定し、又は"
    },
    {
      "indent": 6,
      "text": "- PE1 has installed one or more Source Active A-D routes for C-G originated by PE2, and for at least one of these routes, PE1 does not have a corresponding (C-S,C-G) state, or",
      "ja": " -  PE1がPE2によって発信C-Gのための1つ以上のソースアクティブA-Dの経路をインストールしており、これらの経路の少なくとも一つのために、PE1は、対応する（C-S、C-G）状態を有していない、または"
    },
    {
      "indent": 6,
      "text": "- C-G is a BIDIR-PIM group, or",
      "ja": " -  C-GはBIDIR-PIM基であり、又は"
    },
    {
      "indent": 6,
      "text": "- Source Active A-D routes are not being used.",
      "ja": " - ソースアクティブA-D経路が使用されていません。"
    },
    {
      "indent": 3,
      "text": "If (C-*,C-G) does not match a (C-*,C-G) S-PMSI A-D route from PE2, but PE1 has an installed (C-*,C-*) S-PMSI A-D route from PE2, then (C-*,C-G) matches the (C-*,C-*) route if one of the following conditions holds:",
      "ja": "次に、PE2からS-PMSIのADルート（C  -  *、CGは）場合 -   -  PE2からS-PMSIのAD経路が、PE1がインストール（*、C * C）を有している（*、CG C）と一致しません：次のいずれかの条件が成立する場合、ルート（C  -   -  *、CG）が（*、C * C）と一致します"
    },
    {
      "indent": 6,
      "text": "- PE1 determines that PE2 is the \"upstream\" PE [MVPN] for the C-RP of C-G, or",
      "ja": " -  PE1 PE2はC-GのC-RPのための \"上流\" PE [MVPN]であると判定し、又は"
    },
    {
      "indent": 6,
      "text": "- PE1 has installed one or more Source Active A-D routes for C-G originated by PE2, and for at least one of these routes, PE1 does not have a corresponding (C-S,C-G) state, or",
      "ja": " -  PE1がPE2によって発信C-Gのための1つ以上のソースアクティブA-Dの経路をインストールしており、これらの経路の少なくとも一つのために、PE1は、対応する（C-S、C-G）状態を有していない、または"
    },
    {
      "indent": 6,
      "text": "- C-G is a BIDIR-PIM group, or",
      "ja": " -  C-GはBIDIR-PIM基であり、又は"
    },
    {
      "indent": 6,
      "text": "- Source Active A-D routes are not being used.",
      "ja": " - ソースアクティブA-D経路が使用されていません。"
    },
    {
      "indent": 0,
      "text": "4. Procedures for S-PMSI A-D Routes with Wildcards",
      "section_title": true,
      "ja": "ワイルドカードとS-PMSI A-Dのルートの4手順"
    },
    {
      "indent": 0,
      "text": "4.1. Procedures for All Kinds of Wildcards",
      "section_title": true,
      "ja": "4.1. ワイルドカードのすべての種類の手順"
    },
    {
      "indent": 3,
      "text": "This document defines procedures for the following uses of the wildcard in the NLRI of an S-PMSI A-D route:",
      "ja": "この文書では、S-PMSI A-D経路のNLRIにワイルドカードの次の使用のための手順を定義します。"
    },
    {
      "indent": 6,
      "text": "- (C-*,C-G): Source wildcard, group specified.",
      "ja": " - （C  -  *、C-G）：ソースワイルドカード、指定されたグループ。"
    },
    {
      "indent": 6,
      "text": "- (C-S,C-*): Source specified, group wildcard.",
      "ja": " - （C-S、C- *）：ソース指定、グループのワイルドカード。"
    },
    {
      "indent": 6,
      "text": "- (C-*,C-*): Source wildcard, group wildcard.",
      "ja": " - （C  -  *、C- *）：ソースワイルドカード、グループ、ワイルドカード。"
    },
    {
      "indent": 3,
      "text": "All other wildcard functionality is outside the scope of this document.",
      "ja": "他のすべてのワイルドカードの機能は、この文書の範囲外です。"
    },
    {
      "indent": 3,
      "text": "The ability to originate S-PMSI A-D routes with a particular kind of wildcard is OPTIONAL. However, if a PE has the ability to originate S-PMSI A-D routes with a particular kind of wildcard, it MUST have the ability to interpret and correctly process S-PMSI A-D routes with that kind of wildcard, and it SHOULD have the ability to interpret and correctly process all three kinds of wildcards.",
      "ja": "ワイルドカードの特定の種類のS-PMSI A-Dルートを発信する能力は、任意です。 PEは、ワイルドカードの特定の種類のS-PMSIのADルートを発信する能力を有している場合は、それはワイルドカードのようなものを用いてS-PMSIのADルートを解釈して正しく処理する能力を持たなければならない、そして、それは能力を持っているべきです解釈し、正しくワイルドカードの3つのすべての種類を処理します。"
    },
    {
      "indent": 3,
      "text": "For a given MVPN, A PE MUST NOT originate S-PMSI A-D routes with a particular kind of wildcard unless it is known a priori that all PEs attached to that MVPN have the ability to interpret and correctly process that kind of wildcard.",
      "ja": "そのMVPNに接続されたすべてのPEが解釈し、正しくワイルドカードのようなものを処理する能力を有することが事前に知られていない限り、所与のMVPNのために、PEは、ワイルドカードの特定の種類のS-PMSI A-Dルートを発信してはいけません。"
    },
    {
      "indent": 3,
      "text": "The criteria for originating and withdrawing S-PMSI A-D routes with wildcards are local to the originating PE.",
      "ja": "発信とワイルドカードでS-PMSI A-Dルートを吸引するための基準は、発信PEにローカルです。"
    },
    {
      "indent": 3,
      "text": "As specified in [MVPN-BGP], an S-PMSI A-D route is carried in the NLRI field of an MP_REACH_NLRI attribute (see [BGP-MP]). Every S-PMSI A-D route has a particular address family (IPv4 or IPv6), as specified in the Address Family Identifier (AFI) field of the MP_REACH_NLRI attribute. A wildcard in a particular S-PMSI A-D route always refers only to multicast flows of that same address family.",
      "ja": "[MVPN-BGP]で指定されるように、S-PMSI A-D経路がMP_REACH_NLRI属性のNLRIフィールドで搬送される（[BGP-MP]を参照）。すべてのS-PMSI A-Dの経路は、MP_REACH_NLRI属性のアドレスファミリ識別子（AFI）フィールドで指定されるように、特定のアドレスファミリー（IPv4またはIPv6）を有しています。特定のS-PMSI A-Dの経路内のワイルドカードは常にのみが同じアドレスファミリのマルチキャストフローを指します。"
    },
    {
      "indent": 3,
      "text": "The procedures specified in this document apply only when the PMSI Tunnel Attribute of an S-PMSI A-D route specifies a \"unidirectional\" P-tunnel. The use of \"bidirectional\" P-tunnels (e.g., Multipoint-to-Multipoint Label Switched Paths, BIDIR-PIM trees) is outside the scope of this document.",
      "ja": "この文書で指定された手順は、S-PMSI A-D経路のPMSIトンネル属性が「一方向」P-トンネルを指定する場合にのみ適用されます。 「双方向」P-トンネルの使用は、この文書の範囲外である（例えば、マルチポイント・ツー・マルチラベルBIDIR-PIM木は、パスのスイッチ）。"
    },
    {
      "indent": 3,
      "text": "In the following sections, an S-PMSI A-D route whose NLRI contains (C-*,C-G), (C-S,C-*), or (C-*,C-*) will be referred to as a \"(C-*,C-G) route\", a \"(C-S,C-*) route\", or a \"(C-*,C-*)\" route, respectively.",
      "ja": "以下のセクションでは、そのNLRIが含まS-PMSIのADルート（C  -  *、CG）、（CS、C *）、又は（C  -  *、C *）は、「（C-と呼ぶことにします*、CG）経路」、 \"（CS、C- *）経路\"、または \"（C  -  *、C *）\" 経路、それぞれ。"
    },
    {
      "indent": 0,
      "text": "4.2. Procedures for (C-*,C-G) S-PMSI A-D Routes",
      "section_title": true,
      "ja": "4.2.  （ -  *、C-G C）S-PMSI A-Dのルートのための手順"
    },
    {
      "indent": 3,
      "text": "This document specifies the use of (C-*,C-G) S-PMSI A-D routes only in the case where C-G is an ASM group address. Use of (C-*,C-G) S-PMSI A-D routes where C-G is an SSM group address is outside the scope of this document. If a PE receives a (C-*,C-G) S-PMSI A-D route, and the PE can determine that C-G is an SSM group address, the PE SHOULD \"ignore\" this S-PMSI A-D route.",
      "ja": "唯一のC-Gは、ASMグループアドレスである場合に、S-PMSI A-Dルート - このドキュメントは、（*、C-G C）の使用を指定します。 （C  -  *、C-G）の使用C-Gは、SSMグループアドレスであるS-PMSI A-Dの経路は、この文書の範囲外です。 PEは、（C  -  *、C-G）を受信した場合、S-PMSI A-Dの経路を、そしてPEはC-Gは、SSMグループアドレスであると判断することができる、PEはこのS-PMSI A-Dの経路を \"無視する\" べきです。"
    },
    {
      "indent": 3,
      "text": "By default, the set of Route Targets carried by a (C-*,C-G) S-PMSI A-D route originated by a given VRF is the same as the set of Route Targets carried in the (unicast) VPN-IP routes that originated from that VRF. An implementation MUST allow the set of Route Targets carried by the (C-*,C-G) S-PMSI A-D route to be specified by configuration. In the absence of a configured set of Route Targets, the route MUST carry the default set of Route Targets.",
      "ja": "デフォルトでは、（C  -  *、CG）によって運ばれるルートターゲットのセット所定のVRFによって発信S-PMSIのAD経路が由来する（ユニキャスト）VPN-IPルートで搬送ルートターゲットのセットと同じですVRFいます。構成によって指定されるS-PMSI A-Dの経路 - 実装が（*、C-G C）によって運ばれるルートターゲットのセットを可能にしなければなりません。ルートターゲットの構成セットの非存在下では、ルートは、ルートターゲットのデフォルトセットを運ばなければなりません。"
    },
    {
      "indent": 3,
      "text": "If a PE needs to transmit packets of a (C-S,C-G) C-flow, and if (C-S,C-G) matches a (C-*,C-G) S-PMSI A-D route according to the rules of Section 3.1, then the PE MUST use the P-tunnel advertised in this route for transmitting that C-flow. (Note that it is impossible for a given (C-S,C-G) to match both a (C-*,C-G) wildcard and a (C-S,C-*) wildcard.)",
      "ja": "PEは（CS、CG）Cフローのパケットを送信する必要がある場合、及び（CS、CG）は（C  -  *、CG）と一致する場合、セクション3.1の規則に従って、S-PMSIのADルートを、次にPEそのC-フローを送信するためにこのルートでアドバタイズP-トンネルを使用しなければなりません。 （これは（Cの両方と一致するように指定された（C-S、C-G）のために不可能であることに注意してください - 。*、C-G）のワイルドカードと（C-S、C- *）ワイルドカード）"
    },
    {
      "indent": 3,
      "text": "If PIM is being used as the PE-PE control protocol, then if the PE has (C-*,C-G) and/or (C-S,C-G) state that matches (according to the procedures of Section 3.2) an S-PMSI A-D route, the PE MUST join the P-tunnel specified in the PMSI Tunnel Attribute of that route.",
      "ja": "PIMは、PE-PE制御プロトコルとして使用される場合、PEは、持っている場合 -  S-PMSIのAD（セクション3.2の手順に従って）と一致する（C *、CG）および/または（CS、CG）状態ルートは、PEはその経路のPMSIトンネル属性で指定されたP-トンネルに参加する必要があります。"
    },
    {
      "indent": 3,
      "text": "If BGP is being used as the PE-PE control protocol, then",
      "ja": "BGPは、PE-PE制御プロトコルとして使用されている場合、次いで"
    },
    {
      "indent": 6,
      "text": "- If a given PE has currently originated a C-multicast Shared Tree Join for (C-*,C-G), and if (C-*,C-G) matches a (C-*,C-G) S-PMSI A-D route, then the PE applies the procedures of Section 12.3 (\"Receiving S-PMSI A-D Routes by PEs\") of [MVPN-BGP] to that S-PMSI A-D route.",
      "ja": " - 指定されたPEは、現在発信した場合にC-マルチキャスト共有ツリーは、（C  -  *、CG）のために参加し、及び（C  -  *、CGは）場合 - 次いで、S-PMSIのADルート（*、CG C）と一致しますPEは、S-PMSIのAD経路に[MVPN-BGP]のセクション12.3（ \"のPEによってS-PMSIのADルートを受信\"）の手順を適用します。"
    },
    {
      "indent": 6,
      "text": "- Otherwise (the given PE does not have a currently originated C-multicast Shared Tree Join for (C-*,C-G)), if there are one or more values of C-S for which the PE has a currently originated Source Tree Join C-multicast route for (C-S,C-G), the PE MUST join the tunnels advertised by the S-PMSI A-D routes that match (according to Section 3.2) each such (C-S,C-G).",
      "ja": " - それ以外の場合（所定のPEは、現在C-マルチキャスト共有ツリーは、（Cするための参加発信していません -  *、CG））CSの1つまたは複数の値が存在する場合、そのためのPEは、現在ソースツリーはC-に参加発信しました（CS、CG）のマルチキャスト経路、PEは（セクション3.2に従って）各そのような（CS、CG）と一致S-PMSIのADルートによってアドバタイズトンネルに参加する必要があります。"
    },
    {
      "indent": 6,
      "text": "- Otherwise, the PE \"ignores\" the route.",
      "ja": " - それ以外の場合、PEは、経路を「無視します」。"
    },
    {
      "indent": 0,
      "text": "4.3. Procedures for (C-S,C-*) S-PMSI A-D Routes",
      "section_title": true,
      "ja": "4.3.  （C-S、C- *）S-PMSI A-Dのルートのための手順"
    },
    {
      "indent": 3,
      "text": "This document covers the use of (C-S,C-*) S-PMSI A-D routes for only the C-multicast flows where C-G is an SSM group address. Use of (C-S,C-*) S-PMSI A-D routes for other C-multicast flows is outside the scope of this document. Specifically, if a PE receives a (C-S,C-*) S-PMSI A-D route, and the PE can determine that C-G is not an SSM group address, the PE SHOULD \"ignore\" this S-PMSI A-D route.",
      "ja": "C-Gは、SSMグループアドレスである場合、このドキュメントのみC-マルチキャストのための使用（C-S、C- *）S-PMSI A-Dの経路を覆って流れます。他のC-マルチキャストフローの（C-S、C- *）S-PMSI A-Dの経路の使用は、この文書の範囲外です。 PEは、（C-S、C- *）S-PMSI A-Dの経路を受信し、そしてPE C-Gは、SSMグループアドレスではないと判断できる場合は具体的に、PEは、このS-PMSI A-Dの経路を \"無視する\" べきです。"
    },
    {
      "indent": 3,
      "text": "By default, the set of Route Targets carried by a (C-S,C-*) S-PMSI A-D route originated by a given VRF is an intersection between the set of Route Targets carried in the Intra-AS I-PMSI A-D route that originated from that VRF, and the set of Route Targets carried by the unicast VPN-IP route to C-S originated from that VRF. An implementation MUST allow the set of Route Targets carried by the (C-S,C-*) S-PMSI A-D route to be specified by configuration. In the absence of a configured set of Route Targets, the route MUST carry the default set of Route Targets.",
      "ja": "デフォルトでは、与えられたVRFによって発信（CS、C- *）S-PMSIのAD経路によって運ばれるルートターゲットのセットが発信イントラAS I-PMSIのAD経路で搬送ルートターゲットのセットとの交点でありますそのVRF、およびCSへのユニキャストVPN-IPルートによって運ばれるルートターゲットのセットからそのVRFに由来。実装は、設定によって指定される（C-S、C- *）S-PMSI A-Dの経路によって運ばれるルートターゲットのセットを可能にしなければなりません。ルートターゲットの構成セットの非存在下では、ルートは、ルートターゲットのデフォルトセットを運ばなければなりません。"
    },
    {
      "indent": 3,
      "text": "If a PE needs to transmit packets of a (C-S,C-G) C-flow, and if (C-S,C-G) matches a (C-S,C-*) S-PMSI A-D route according to the rules of Section 3.1, then the PE MUST use the P-tunnel advertised in this route for transmitting that C-flow. (Note that it is impossible for a given (C-S,C-G) to match both a (C-*,C-G) wildcard and a (C-S,C-*) wildcard.)",
      "ja": "PEは（CS、CG）Cフローのパケットを送信する必要がある場合、及び（CS、CG）は、セクション3.1の規則に従って（CS、C- *）S-PMSIのADルートと一致する場合、PEそのC-フローを送信するためにこのルートでアドバタイズP-トンネルを使用しなければなりません。 （これは（Cの両方と一致するように指定された（C-S、C-G）のために不可能であることに注意してください - 。*、C-G）のワイルドカードと（C-S、C- *）ワイルドカード）"
    },
    {
      "indent": 3,
      "text": "If PIM is being used as the PE-PE control protocol for distributing C-multicast routing, and if a given PE needs to receive a (C-S,C-G) flow, and if (C-S,C-G) matches the (C-S,C-*) S-PMSI A-D route (according to the procedures of Section 3.2), then the PE MUST join the P-tunnel specified in the PMSI Tunnel Attribute of that route.",
      "ja": "PIMは、C-マルチキャストルーティングを配布するPE-PE制御プロトコルとして使用されている場合、所与のPEは（CS、CG）の流れを受信する必要がある場合、及び（CS、CG）は（CS、C *に一致する場合）S-PMSIのAD経路（セクション3.2の手順に従って）、次いでPEはその経路のPMSIトンネル属性で指定されたP-トンネルに参加する必要があります。"
    },
    {
      "indent": 3,
      "text": "If BGP is being used as the PE-PE control protocol for distributing C-multicast routing, and if there is some (C-S,C-G) such that (a) the PE has a currently originated (C-S,C-G) Source Tree Join C-multicast route, AND (b) the given (C-S,C-G) matches (according to the procedures of Section 3.2) a (C-S,C-*) S-PMSI A-D route, then PE1 applies the procedures of Section 12.3 (\"Receiving S-PMSI A-D Routes by PEs\") of [MVPN-BGP] to the matching S-PMSI A-D route.",
      "ja": "BGPは、C-マルチキャストルーティングを配布するPE-PE制御プロトコルとして使用され、されている場合（A）PEは、現在発信（CS、CG）ソースツリーは、C-に参加を有するように、いくつかの（CS、CG）がある場合マルチキャスト経路、および（b）与えられた（CS、CG）と一致（CS、C- *）S-PMSIのAD経路（セクション3.2の手順に従って）、次いで、PE1は、セクション12.3（「Sを受信する手順を適用しますマッチングS-PMSIのADのルートを[MVPN-BGP]ののPE」）によって-PMSI ADルート。"
    },
    {
      "indent": 0,
      "text": "4.4. Procedures for (C-*,C-*) S-PMSI A-D Routes",
      "section_title": true,
      "ja": "4.4.  S-PMSI A-Dルート - （*、C * C）の手順"
    },
    {
      "indent": 3,
      "text": "(C-*,C-*) S-PMSI A-D routes are used when, for a given MVPN, a PE has a policy not to use an I-PMSI for carrying multicast data traffic originated in the MVPN's site(s) connected to that PE. When the (C-*,C-*) wildcard is used together with BGP C-multicast routing, this results in the \"S-PMSI only\" model, where no I-PMSIs are used at all for the given MVPN.",
      "ja": "（C  -  *、C *）所与MVPNのために、PEが接続MVPNの部位（単数または複数）にマルチキャストデータトラフィックを搬送するためのI-PMSIを使用しないポリシーを発信した場合、S-PMSIのADのルートが使用されていますそのPE。 （C  -  *、C *）場合、ワイルドカードは、BGP-Cマルチキャストルーティングと一緒に使用され、これにはI-PMSIsが所与MVPNのために全く使用されない「S-PMSIのみ」モデルになります。"
    },
    {
      "indent": 3,
      "text": "A (C-*,C-*) S-PMSI A-D route is originated for a given MVPN by a given PE only if that PE has been provisioned with the policy to do so.",
      "ja": "（C  -  *、C *）S-PMSI A-Dの経路そのPEがそうするようにポリシーでプロビジョニングされている場合にのみ与えられたPEによって与えMVPNのために発信されます。"
    },
    {
      "indent": 3,
      "text": "When so provisioned, the PE MAY originate the (C-*,C-*) S-PMSI A-D route as soon as it is enabled to support the given MVPN. Alternatively, the PE MAY delay originating the route until one of the following conditions holds:",
      "ja": "すぐに与えられたMVPNをサポートすることが可能になるようにS-PMSI A-Dの経路 - そうプロビジョニング場合、PEは（*、C * C）を生じ得ます。代替的に、PEは、次のいずれかの条件が成立するまでのルートを発信遅延させることができます。"
    },
    {
      "indent": 6,
      "text": "- The PE-PE protocol for distributing C-multicast routing is PIM, and for the given MVPN, the PE has some (C-S,C-G) or (C-*,C-G) state for which the upstream interface is one of the VRF interfaces for the given MVPN.",
      "ja": " -  C-マルチキャストルーティングを配布するPE-PEプロトコルはPIMであり、所与MVPNのために、PEは、いくつかの（CS、CG）又は（C  -  *、CG）を有する上流インタフェースがVRFインタフェースの一つされている状態を与えられたMVPNのため。"
    },
    {
      "indent": 6,
      "text": "- The PE-PE protocol for distributing C-multicast routing is BGP, and the given PE has received and installed either of the following:",
      "ja": " -  C-マルチキャストルーティングを配布するPE-PEプロトコルはBGPであり、所与のPEを受信し、次のいずれかがインストールされています。"
    },
    {
      "indent": 8,
      "text": "* a Source Tree Join C-multicast route, with the C-S contained in the route's NLRI being reachable via one of the given MVPN's VRF interfaces, or",
      "ja": "*ソースツリーは、所与のMVPNのVRFインタフェースのうちの1つを介して到達可能であるルートのNLRIに含まれるC-Sを用いて、C-マルチキャストルートに参加し、又は"
    },
    {
      "indent": 8,
      "text": "* a Shared Tree Join C-multicast route, with the C-RP carried in that route being reachable via one of the given MVPN's VRF interfaces.",
      "ja": "*共有ツリーは、そのルートが与えられたMVPNのVRFインターフェイスのいずれかを経由して到達可能であることに運ばC-RPで、C-マルチキャストルーティングに参加します。"
    },
    {
      "indent": 3,
      "text": "By default, the set of Route Targets carried by a (C-*,C-*) S-PMSI A-D route originated from a given VRF is the same as the set of Route Targets carried in the VPN-IP unicast routes originated from that VRF. An implementation MUST allow the set of Route Targets carried by the (C-*,C-*) S-PMSI A-D route to be specified by configuration. In the absence of a configured set of Route Targets, the route MUST carry the default set of Route Targets, as specified above.",
      "ja": "デフォルトでは、（C  -  *、C *）によって運ばれるルートターゲットのセットS-PMSIのADルートは所定のVRFに由来VPN-IPユニキャストルートで搬送ルートターゲットのセットは、その由来と同じですVRF。構成によって指定されるS-PMSI A-Dの経路 - 実装が（*、C * C）によって運ばれるルートターゲットのセットを可能にしなければなりません。上記指定されたとおりルートターゲットの構成セットの非存在下では、ルートは、ルートターゲットのデフォルトセットを運ばなければなりません。"
    },
    {
      "indent": 3,
      "text": "If a PE needs to transmit packets of a (C-S,C-G) C-flow, and if (C-S,C-G) matches a (C-*,C-*) S-PMSI A-D route according to the rules of Section 3.1, then the PE MUST use the P-tunnel advertised in this route for transmitting that C-flow. (Note that it is impossible for a given (C-S,C-G) to match both a (C-*,C-*) wildcard and any other wildcard.)",
      "ja": "PEは（CS、CG）Cフローのパケットを送信する必要がある場合、及び（CS、CG）は（C  -  *、C *）と一致する場合、次に、セクション3.1の規則に従って、S-PMSIのADルートをPEはそのC-フローを送信するためにこのルートでアドバタイズP-トンネルを使用しなければなりません。 （これは（Cの両方と一致するように指定された（C-S、C-G）のために不可能であることに注意してください - 。*、C *）のワイルドカードと他のワイルドカード）"
    },
    {
      "indent": 3,
      "text": "If PIM is being used as the PE-PE control protocol for distributing C-multicast routing, and if a given PE, say PE1, needs to receive a (C-S,C-G) flow, and if (C-S,C-G) matches the (C-*,C-*) S-PMSI A-D route (according to the procedures of Section 3.2), then PE1 MUST join the P-tunnel specified in the PMSI Tunnel Attribute of that route.",
      "ja": "PIMは、C-マルチキャストルーティングを配布するPE-PE制御プロトコルとして使用され、所与のPEは、PE1を言う場合、（CS、CG）の流れを受信する必要がある、及び（CS、CG）が一致する場合（Cれている場合 -  *、C *）S-PMSIのAD経路（セクション3.2の手順に従って）、次いで、PE1は、その経路のPMSIトンネル属性で指定されたP-トンネルに参加する必要があります。"
    },
    {
      "indent": 3,
      "text": "If BGP is being used as the PE-PE control protocol for distributing C-multicast routing, then if (and only if) one of the following conditions holds, the PE applies the procedures of Section 12.3 (\"Receiving S-PMSI A-D Routes by PEs\") of [MVPN-BGP] to the matching S-PMSI A-D route. The conditions are as follows:",
      "ja": "BGPは、C-マルチキャストルーティングを配布するPE-PE制御プロトコルとして使用されている場合、次のいずれかの条件が成立（および場合のみ）場合、次いで、PEは（ \"によってS-PMSIのADルートを受信部12.3の手順を適用しますマッチングS-PMSIのADのルートを[MVPN-BGP]ののPE」）。次のような条件は以下のとおりです。"
    },
    {
      "indent": 6,
      "text": "- The PE has a currently originated C-multicast Source Tree Join route for (C-S,C-G) that matches (according to the procedures of Section 3.2) the (C-*,C-*) S-PMSI A-D route, or",
      "ja": " -  PEは、現在、C-マルチキャストソースツリー（セクション3.2の手順に従って）（C  -  *、C *）に一致する（C-S、C-G）のルートに参加発信しているS-PMSI A-Dの経路を、または"
    },
    {
      "indent": 6,
      "text": "- The PE has a currently originated a C-multicast Shared Tree Join route for (C-*,C-G) that matches (according to the procedures of Section 3.2) the (C-*,C-*) S-PMSI A-D route.",
      "ja": " -  S-PMSI A-Dの経路 - （セクション3.2の手順に従って）（*、C * C）と一致する -  PEは、現在、C-マルチキャスト共有ツリー（*、C-G C）のルートに参加発信しています。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "There are no additional security considerations beyond those of [MVPN] and [MVPN-BGP].",
      "ja": "[MVPN]と[MVPN-BGP]のものを超えて追加のセキュリティ上の考慮事項はありません。"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgments",
      "section_title": true,
      "ja": "6.謝辞"
    },
    {
      "indent": 3,
      "text": "The authors wish to thank Arjen Boers, Dongling Duan, Apoorva Karan, Thomas Morin, Keyur Patel, Karthik Subramanian, and Kurt Windisch for many helpful discussions.",
      "ja": "著者は、多くの有用な議論のためにアリエン・ボーア人、Donglingドゥアン、Apoorvaカラン、トーマス・モラン、Keyurパテル、カルティクサブラマニアン、およびクルトWindischに感謝したいです。"
    },
    {
      "indent": 0,
      "text": "7. Normative References",
      "section_title": true,
      "ja": "7.引用規格"
    },
    {
      "indent": 3,
      "text": "[BGP-MP] Bates, T., Chandra, R., Katz, D., and Y. Rekhter, \"Multiprotocol Extensions for BGP-4\", RFC 4760, January 2007.",
      "ja": "[BGP-MP]ベイツ、T.、チャンドラ、R.、カッツ、D.、およびY. Rekhter、 \"BGP-4のためのマルチプロトコル拡張機能\"、RFC 4760、2007年1月。"
    },
    {
      "indent": 3,
      "text": "[L3VPN] Rosen, E. and Y. Rekhter, \"BGP/MPLS IP Virtual Private Networks (VPNs)\", RFC 4364, February 2006.",
      "ja": "[L3VPN]ローゼン、E.およびY. Rekhter、 \"BGP / MPLS IP仮想プライベートネットワーク（VPN）\"、RFC 4364、2006年2月。"
    },
    {
      "indent": 3,
      "text": "[MVPN] Rosen, E., Ed., and R. Aggarwal, Ed., \"Multicast in MPLS/BGP IP VPNs\", RFC 6513, February 2012.",
      "ja": "[MVPN]ローゼン、E.、エド。、およびR.アガルワル、エド。、RFC 6513、2012年2月 \"MPLS / BGP VPNのIPにおけるマルチキャスト\"。"
    },
    {
      "indent": 3,
      "text": "[MVPN-BGP] Aggarwal, R., Rosen, E., Morin, T., and Y. Rekhter, \"BGP Encodings and Procedures for Multicast in MPLS/BGP IP VPNs\", RFC 6514, February 2012.",
      "ja": "[MVPN-BGP]アガルワル、R.、ローゼン、E.、モリン、T.、およびY. Rekhter、 \"BGPエンコーディング及びMPLS / IP VPNのBGPにおけるマルチキャストのための手順\"、RFC 6514、2012年2月。"
    },
    {
      "indent": 3,
      "text": "[PIM] Fenner, B., Handley, M., Holbrook, H., and I. Kouvelas, \"Protocol Independent Multicast - Sparse Mode (PIM-SM): Protocol Specification (Revised)\", RFC 4601, August 2006.",
      "ja": "[PIM]フェナー、B.、ハンドリー、M.、ホルブルック、H.、およびI. Kouvelas、 \"プロトコル独立マルチキャスト - スパースモード（PIM-SM）：プロトコル仕様（改訂）\"、RFC 4601、2006年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Rahul Aggarwal Arktan",
      "ja": "ラウール・アガーウォールArktan"
    },
    {
      "indent": 3,
      "text": "EMail: raggarwa_1@yahoo.com",
      "ja": "メールアドレス：raggarwa_1@yahoo.com"
    },
    {
      "indent": 3,
      "text": "Yiqun Cai Microsoft 1065 La Avenida Mountain View, CA 94043",
      "ja": "Y IグループCAIマイクロソフト1065 LA AVアンIDAのマウンテンビュー、CA 94043"
    },
    {
      "indent": 3,
      "text": "EMail: yiqunc@microsoft.com",
      "ja": "メールアドレス：yiqunc@microsoft.com"
    },
    {
      "indent": 3,
      "text": "Wim Henderickx Alcatel-Lucent",
      "ja": "ヴィム・ヘンデリックアルカテル・ルーセント"
    },
    {
      "indent": 3,
      "text": "EMail: wim.henderickx@alcatel-lucent.be",
      "ja": "メールアドレス：wim.henderickx@alcatel-lucent.be"
    },
    {
      "indent": 3,
      "text": "Praveen Muley Alcatel-Lucent",
      "ja": "PraveenさんMuleyアルカテル・ルーセント"
    },
    {
      "indent": 3,
      "text": "EMail: Praveen.Muley@alcatel-lucent.com",
      "ja": "メールアドレス：Praveen.Muley@alcatel-lucent.com"
    },
    {
      "indent": 3,
      "text": "Ray (Lei) Qiu 2330 Central Expressway Santa Clara, CA 95050 USA",
      "ja": "レイ（レイ）Q IU 2330中央高速道路サンタクララ、CA 95050 USA"
    },
    {
      "indent": 3,
      "text": "EMail: rayq@huawei.com",
      "ja": "メールアドレス：rayq@huawei.com"
    },
    {
      "indent": 3,
      "text": "Yakov Rekhter (editor) Juniper Networks 1194 North Mathilda Ave. Sunnyvale, CA 94089",
      "ja": "ヤコフ・レックター（編集者）ジュニパーネットワークスの1194北マチルダアベニュー。サニーベール、CA 94089"
    },
    {
      "indent": 3,
      "text": "EMail: yakov@juniper.net",
      "ja": "メールアドレス：yakov@juniper.net"
    },
    {
      "indent": 3,
      "text": "Eric C. Rosen (editor) Cisco Systems, Inc. 1414 Massachusetts Avenue Boxborough, MA 01719",
      "ja": "エリックC.ローゼン（エディタ）シスコ・システムズ・インク1414年マサチューセッツアベニューボックスボロー、MA 01719"
    },
    {
      "indent": 3,
      "text": "EMail: erosen@cisco.com",
      "ja": "メールアドレス：erosen@cisco.com"
    },
    {
      "indent": 3,
      "text": "IJsbrand Wijnands Cisco Systems, Inc. De kleetlaan 6a Diegem 1831 Belgium",
      "ja": "IJsbrand Wijnandsシスコシステムズ株式会社Kleetlaan 6aはディーゲム1831ベルギー"
    },
    {
      "indent": 3,
      "text": "EMail: ice@cisco.com",
      "ja": "メールアドレス：ice@cisco.com"
    }
  ]
}