{
  "title": {
    "text": "RFC 6838 - Media Type Specifications and Registration Procedures",
    "ja": "RFC 6838 - メディアタイプの仕様と登録手順"
  },
  "number": 6838,
  "created_at": "2019-10-31 15:49:13.527818+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                          N. Freed\nRequest for Comments: 6838                                        Oracle\nBCP: 13                                                       J. Klensin\nObsoletes: 4288\nCategory: Best Current Practice                                T. Hansen\nISSN: 2070-1721                                        AT&T Laboratories\n                                                            January 2013",
      "raw": true
    },
    {
      "indent": 9,
      "text": "Media Type Specifications and Registration Procedures",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document defines procedures for the specification and registration of media types for use in HTTP, MIME, and other Internet protocols.",
      "ja": "この文書では、HTTP、MIME、および他のインターネットプロトコルで使用するためのメディアタイプの仕様と登録のための手続きを定義します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This memo documents an Internet Best Current Practice.",
      "ja": "このメモはインターネット最も良い現在の練習を説明します。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on BCPs is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 BCPの詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6838.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6838で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2013 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2013 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  3\n  1.1.  Historical Note  . . . . . . . . . . . . . . . . . . . . .  3\n  1.2.  Conventions Used in This Document  . . . . . . . . . . . .  4\n2.  Media Type Registration Preliminaries  . . . . . . . . . . . .  4\n3.  Registration Trees and Subtype Names . . . . . . . . . . . . .  4\n  3.1.  Standards Tree . . . . . . . . . . . . . . . . . . . . . .  4\n  3.2.  Vendor Tree  . . . . . . . . . . . . . . . . . . . . . . .  6\n  3.3.  Personal or Vanity Tree  . . . . . . . . . . . . . . . . .  6\n  3.4.  Unregistered x. Tree . . . . . . . . . . . . . . . . . . .  7\n  3.5.  Additional Registration Trees  . . . . . . . . . . . . . .  7\n4.  Registration Requirements  . . . . . . . . . . . . . . . . . .  7\n  4.1.  Functionality Requirement  . . . . . . . . . . . . . . . .  8\n  4.2.  Naming Requirements  . . . . . . . . . . . . . . . . . . .  8\n    4.2.1.  Text Media Types . . . . . . . . . . . . . . . . . . .  9\n    4.2.2.  Image Media Types  . . . . . . . . . . . . . . . . . . 10\n    4.2.3.  Audio Media Types  . . . . . . . . . . . . . . . . . . 10\n    4.2.4.  Video Media Types  . . . . . . . . . . . . . . . . . . 10\n    4.2.5.  Application Media Types  . . . . . . . . . . . . . . . 11\n    4.2.6.  Multipart and Message Media Types  . . . . . . . . . . 11\n    4.2.7.  Additional Top-Level Types . . . . . . . . . . . . . . 12\n    4.2.8.  Structured Syntax Name Suffixes  . . . . . . . . . . . 12\n    4.2.9.  Deprecated Aliases . . . . . . . . . . . . . . . . . . 13\n  4.3.  Parameter Requirements . . . . . . . . . . . . . . . . . . 13\n  4.4.  Canonicalization and Format Requirements . . . . . . . . . 14\n  4.5.  Interchange Recommendations  . . . . . . . . . . . . . . . 15\n  4.6.  Security Requirements  . . . . . . . . . . . . . . . . . . 15\n  4.7.  Requirements Specific to XML Media Types . . . . . . . . . 16\n  4.8.  Encoding Requirements  . . . . . . . . . . . . . . . . . . 16\n  4.9.  Usage and Implementation Non-Requirements  . . . . . . . . 17\n  4.10. Publication Requirements . . . . . . . . . . . . . . . . . 18\n  4.11. Fragment Identifier Requirements . . . . . . . . . . . . . 18\n  4.12. Additional Information . . . . . . . . . . . . . . . . . . 19\n5.  Media Type Registration Procedures . . . . . . . . . . . . . . 19\n  5.1.  Preliminary Community Review . . . . . . . . . . . . . . . 19\n  5.2.  Submit Request to IANA . . . . . . . . . . . . . . . . . . 20\n    5.2.1.  Provisional Registrations  . . . . . . . . . . . . . . 20\n  5.3.  Review and Approval  . . . . . . . . . . . . . . . . . . . 21\n  5.4.  Comments on Media Type Registrations . . . . . . . . . . . 21\n  5.5.  Change Procedures  . . . . . . . . . . . . . . . . . . . . 21\n  5.6.  Registration Template  . . . . . . . . . . . . . . . . . . 22\n6.  Structured Syntax Suffix Registration Procedures . . . . . . . 23\n  6.1.  Change Procedures  . . . . . . . . . . . . . . . . . . . . 24\n  6.2.  Structured Syntax Suffix Registration Template . . . . . . 24\n7.  Security Considerations  . . . . . . . . . . . . . . . . . . . 25\n8.  IANA Considerations  . . . . . . . . . . . . . . . . . . . . . 26\n9.  Acknowledgments  . . . . . . . . . . . . . . . . . . . . . . . 27",
      "raw": true
    },
    {
      "indent": 3,
      "text": "10. References . . . . . . . . . . . . . . . . . . . . . . . . . . 27\n  10.1. Normative References . . . . . . . . . . . . . . . . . . . 27\n  10.2. Informative References . . . . . . . . . . . . . . . . . . 28\nAppendix A.  Grandfathered Media Types . . . . . . . . . . . . . . 30\nAppendix B.  Changes since RFC 4288  . . . . . . . . . . . . . . . 30",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "Recent Internet protocols have been carefully designed to be easily extensible in certain areas. In particular, many protocols, including but not limited to HTTP [RFC2616] and MIME [RFC2045], are capable of carrying arbitrary labeled content.",
      "ja": "最近のインターネットプロトコルは、慎重に特定の領域に容易に拡張できるように設計されています。具体的には、[RFC2616]とMIME [RFC2045]などではなく、HTTPに限定されるもので多くのプロトコルは、任意の標識されたコンテンツを運ぶことが可能です。"
    },
    {
      "indent": 3,
      "text": "The mechanism used to label such content is a media type, consisting of a top-level type and a subtype, which is further structured into trees. Optionally, media types can define companion data, known as parameters.",
      "ja": "そのようなコンテンツを標識するために使用される機構は、さらに、木に構成されている最上位のタイプおよびサブタイプからなる、メディアタイプです。必要に応じて、メディアタイプをパラメータとして知られているコンパニオンデータを、定義することができます。"
    },
    {
      "indent": 3,
      "text": "A registration process is needed for these labels, so that the set of such values are defined in a reasonably orderly, well-specified, and public manner.",
      "ja": "そのような値のセットは、合理的に秩序よく指定、及び公共のように定義されるように、登録プロセスは、これらのラベルのために必要とされます。"
    },
    {
      "indent": 3,
      "text": "This document specifies the criteria for media type registrations and defines the procedures to be used to register media types (Section 5) as well as media type structured suffixes (Section 6) in the Internet Assigned Numbers Authority (IANA) central registry.",
      "ja": "この文書は、メディアタイプ登録のための基準を指定し、インターネット割り当て番号機関（IANA）は、中央レジストリ内のメディアタイプ（セクション5）、ならびにメディアタイプ構造サフィックス（第6節）を登録するために使用される手順を定義します。"
    },
    {
      "indent": 3,
      "text": "The location of the media type registry managed by these procedures is:",
      "ja": "これらの手順によって管理されるメディアタイプレジストリの場所は次のとおりです。"
    },
    {
      "indent": 5,
      "text": "http://www.iana.org/assignments/media-types/",
      "ja": "ｈっｔｐ：／／ｗっｗ。いあな。おｒｇ／あっしｇんめんｔｓ／めぢあーｔｙぺｓ／"
    },
    {
      "indent": 0,
      "text": "1.1. Historical Note",
      "section_title": true,
      "ja": "1.1。ヒストリカルノート"
    },
    {
      "indent": 3,
      "text": "The media type registration process was initially defined for registering media types for use in the context of the asynchronous Internet mail environment. In this mail environment, there is a need to limit the number of possible media types, to increase the likelihood of interoperability when the capabilities of the remote mail system are not known. As media types are used in new environments in which the proliferation of media types is not a hindrance to interoperability, the original procedure proved excessively restrictive and had to be generalized. This was initially done in [RFC2048], but the procedure defined there was still part of the MIME document set. The media type specification and registration procedure is now a separate document, to make it clear that it is independent of MIME.",
      "ja": "メディアタイプの登録プロセスは、最初の非同期インターネットメール環境のコンテキストで使用するためにメディアタイプを登録するために定義されました。このメール環境では、リモートメールシステムの能力が知られていない場合は、相互運用性の可能性を高めるために、可能なメディアタイプの数を制限する必要があります。メディアタイプは、メディアタイプの増殖が相互運用性に支障ないような新しい環境で使用されると、元のプロシージャは過度に制限的証明し、一般化されなければなりませんでした。これは、最初に[RFC2048]で行われましたが、手続きは、MIMEドキュメントセットの一部が残っていた定義されました。メディアタイプの仕様と登録手続きは、それが明確にそれがMIMEとは独立していることを確認するために、今、別の文書です。"
    },
    {
      "indent": 3,
      "text": "It may be desirable to restrict the use of media types to specific environments or to prohibit their use in other environments. This specification incorporates such restrictions into media type registrations in a systematic way. See Section 4.9 for additional discussion.",
      "ja": "特定の環境にメディアタイプの使用を制限したり、他の環境での使用を禁止することが望ましいことがあります。この仕様は、体系的な方法でメディアタイプの登録にそのような制限が組み込まれています。追加の議論については、セクション4.9を参照してください。"
    },
    {
      "indent": 0,
      "text": "1.2. Conventions Used in This Document",
      "section_title": true,
      "ja": "1.2。このドキュメントの表記規則"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119] when they appear in ALL CAPS. They may also appear in lower or mixed case as plain English words, without any normative meaning.",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はありますそれらはすべて大文字で表示され、[RFC2119]に記載されているように解釈されます。彼らはまた、任意の規範的な意味せず、平易な英語の言葉のような低級または混合の場合に表示されることがあります。"
    },
    {
      "indent": 3,
      "text": "This specification makes use of the Augmented Backus-Naur Form (ABNF) [RFC5234] notation, including the core rules defined in Appendix B of that document.",
      "ja": "この仕様は、拡張バッカス・ナウアフォーム（ABNF）そのドキュメントの付録Bで定義されたコア・ルールを含む[RFC5234]表記を使用します。"
    },
    {
      "indent": 0,
      "text": "2. Media Type Registration Preliminaries",
      "section_title": true,
      "ja": "2.メディアタイプ登録予選"
    },
    {
      "indent": 3,
      "text": "Registration of a new media type or types starts with the construction of a registration proposal. Registration may occur within several different registration trees that have different requirements, as discussed below. In general, a new registration proposal is circulated and reviewed in a fashion appropriate to the tree involved. The media type is then registered if the proposal is acceptable. The following sections describe the requirements and procedures used for each of the different registration trees.",
      "ja": "新しいメディアの種類やタイプの登録は、登録提案の建設を開始します。登録は以下に述べるように、異なる要件を持っているいくつかの異なる登録木の中に発生する可能性があります。一般的には、新規登録の提案が関与ツリーへの適切な方法で循環して見直されています。提案が受け入れ可能であるならば、メディアタイプは、登録されています。以下のセクションでは、異なる登録木のそれぞれのために使用要件および手順を記載しています。"
    },
    {
      "indent": 0,
      "text": "3. Registration Trees and Subtype Names",
      "section_title": true,
      "ja": "3.登録木とサブタイプ名"
    },
    {
      "indent": 3,
      "text": "In order to increase the efficiency and flexibility of the registration process, different structures of subtype names can be registered to accommodate the different natural requirements for, e.g., a subtype that will be recommended for wide support and implementation by the Internet community, or a subtype that is used to move files associated with proprietary software. The following subsections define registration \"trees\" that are distinguished by the use of faceted names, e.g., subtype names that begin with a \"tree.\" prefix. Note that some media types defined prior to this document do not conform to the naming conventions described below. See Appendix A for a discussion of them.",
      "ja": "登録プロセスの効率性と柔軟性を高めるためには、サブタイプ名の異なる構造は、例えばのための異なる自然な要件に対応するためにインターネットコミュニティによって幅広い支持と実装のために推奨されるサブタイプ、またはサブタイプを登録することができますそれは、独自のソフトウェアに関連するファイルを移動するために使用されます。以下のサブセクションでは、多面的な名前で始まり、例えば、サブタイプ名の使用によって区別され、登録「木」を定義「ツリーを。」接頭辞。以前このドキュメントに定義されたいくつかのメディアタイプは、以下の命名規則に準拠していないことに注意してください。それらの議論については、付録Aを参照してください。"
    },
    {
      "indent": 0,
      "text": "3.1. Standards Tree",
      "section_title": true,
      "ja": "3.1。標準ツリー"
    },
    {
      "indent": 3,
      "text": "The standards tree is intended for types of general interest to the Internet community. Registrations in the standards tree MUST be either:",
      "ja": "規格木は、インターネットコミュニティへの一般的な関心のタイプを対象としています。規格木の登録は、のいずれかでなければなりません。"
    },
    {
      "indent": 3,
      "text": "1. in the case of registrations associated with IETF specifications, approved directly by the IESG, or",
      "ja": "IETF仕様に関連付けられている登録の場合には1、IESGによって直接承認され、又は"
    },
    {
      "indent": 3,
      "text": "2. registered by a recognized standards-related organization using the \"Specification Required\" IANA registration policy [RFC5226] (which implies Expert Review).",
      "ja": "2.（専門家のレビューを意味する）「仕様が必要」IANA登録ポリシー[RFC5226]を使用して認められた基準に関連する組織によって登録されています。"
    },
    {
      "indent": 3,
      "text": "The first procedure is used for registrations from IETF Consensus documents, or in rare cases when registering a grandfathered (see Appendix A) and/or otherwise incomplete registration is in the interest of the Internet community. The registration proposal MUST be published as an RFC. When the registration RFC is in the IETF stream, it must have IETF Consensus, which can be attained with a status of Standards Track, BCP, Informational, or Experimental. Registrations published in non-IETF RFC streams are also allowed and require IESG approval. A registration can be either in a stand-alone \"registration only\" RFC or incorporated into a more general specification of some sort.",
      "ja": "適用除外（付録Aを参照）、および/またはその他の不完全な登録は、インターネットコミュニティの利益のためにある登録時に最初の手順は、IETF合意文書から、またはまれに登録するために使用されています。登録提案は、RFCとして公開する必要があります。登録RFCはIETFストリームである場合、それは標準化過程、BCP、情報、または実験の状況を達成することができるIETFコンセンサスを持っている必要があります。非IETF RFCストリームに掲載された登録も許可され、IESGの承認を必要としています。登録は、スタンドアローンの「登録のみ」RFCまたはある種のより一般的な仕様に組み込まれてのいずれかであることができます。"
    },
    {
      "indent": 3,
      "text": "In the second case, the IESG makes a one-time decision on whether the registration submitter represents a recognized standards-related organization; after that, a Media Types Reviewer (Designated Expert or a group of Designated Experts) performs the Expert Review as specified in this document. Subsequent submissions from the same source do not involve the IESG. The format MUST be described by a formal standards specification produced by the submitting standards-related organization.",
      "ja": "後者の場合、IESGは、登録提出が認められた標準関連団体を表しているかどうかに一回判定を行います。この文書で指定され、その後、メディアタイプレビュー（指定エキスパートまたは指定専門家のグループは）専門家レビューを行います。同じソースからの後続の提出は、IESGを含みません。フォーマットは、提出規格関連組織によって産生さ正式標準仕様で記述されなければなりません。"
    },
    {
      "indent": 3,
      "text": "Media types in the standards tree MUST NOT have faceted names, unless they are grandfathered in using the process described in Appendix A.",
      "ja": "彼らは付録Aに記載されているプロセスを使用して適用除外されない限り、規格木におけるメディアタイプは、多面的な名前を持ってはいけません"
    },
    {
      "indent": 3,
      "text": "The \"owner\" of a media type registered in the standards tree is assumed to be the standards-related organization itself. Modification or alteration of the specification uses the same level of processing (e.g., a registration submitted on Standards Track can be revised in another Standards Track RFC, but cannot be revised in an Informational RFC) required for the initial registration.",
      "ja": "規格木に登録されたメディアタイプの「所有者」の規格関連団体そのものであると仮定されます。仕様の変更または改変（例えば、標準化過程で提出登録が別の標準化過程RFCに改訂することができるが、情報RFCに改訂することができない）、初期登録に必要な処理の同じレベルを使用します。"
    },
    {
      "indent": 3,
      "text": "Standards-tree registrations from recognized standards-related organizations are submitted directly to the IANA, where they will undergo Expert Review [RFC5226] prior to approval. In this case, the Expert Reviewer(s) will, among other things, ensure that the required specification provides adequate documentation.",
      "ja": "認められた基準関連団体から規格ツリーの登録は、それらが承認する前に専門家のレビュー[RFC5226]を受けるIANAに直接提出されます。この場合、エキスパートレビュー（複数可）、とりわけ、必要な仕様は、十分なドキュメントを提供していることを確認します。"
    },
    {
      "indent": 0,
      "text": "3.2. Vendor Tree",
      "section_title": true,
      "ja": "3.2。ベンダーツリー"
    },
    {
      "indent": 3,
      "text": "The vendor tree is used for media types associated with publicly available products. \"Vendor\" and \"producer\" are construed very broadly in this context and are considered equivalent. Note that industry consortia as well as non-commercial entities that do not qualify as recognized standards-related organizations can quite appropriately register media types in the vendor tree.",
      "ja": "ベンダー・ツリーは、公に利用可能な製品に関連したメディアタイプのために使用されています。 「ベンダー」および「プロデューサー」は、この文脈では非常に広く解釈さと同等であると考えられます。その業界のコンソーシアムと同様に認められた基準関連団体としての資格がない非営利団体は非常に適切ベンダーツリーにメディアタイプを登録することができます。"
    },
    {
      "indent": 3,
      "text": "A registration may be placed in the vendor tree by anyone who needs to interchange files associated with some product or set of products. However, the registration properly belongs to the vendor or organization producing the software that employs the type being registered, and that vendor or organization can at any time elect to assert ownership of a registration done by a third party in order to correct or update it. See Section 5.5 for additional information.",
      "ja": "登録は、製品のいくつかの製品またはセットに関連付けられたファイルを交換する必要がある人で、ベンダツリーに配置することができます。ただし、登録が正しく登録されているタイプを採用してソフトウェアを生産するベンダーや組織に属し、そのベンダーや組織は、いつでもそれを修正または更新するために、第三者によって行わ登録の所有権を主張することを選択することができます。詳細については、5.5節を参照してください。"
    },
    {
      "indent": 3,
      "text": "When a third party registers a type on behalf of someone else, both entities SHOULD be noted in the Change Controller field in the registration. One possible format for this would be \"Foo, on behalf of Bar\".",
      "ja": "第三者が他の誰かに代わってタイプを登録すると、両方のエンティティは、登録の変更コントローラの分野で注目されるべきです。このための一つの可能​​な形式は、「バーの代わりにはFoo、」だろう。"
    },
    {
      "indent": 3,
      "text": "Vendor-tree registrations will be distinguished by the leading facet \"vnd.\". That may be followed, at the discretion of the registrant, by either a media subtype name from a well-known producer (e.g., \"vnd.mudpie\") or by an IANA-approved designation of the producer's name that is followed by a media type or product designation (e.g., vnd.bigcompany.funnypictures).",
      "ja": "ベンダーツリー登録は大手面で区別されます「VND。」。それは、（例えば、「vnd.mudpie」）またはメディアが続いているプロデューサの名前のIANAが承認した指定によって、よく知られている生産者からのメディアサブタイプ名のいずれかにより、登録者の裁量で、続いてもよいですタイプまたは製品名称（例えば、vnd.bigcompany.funnypictures）。"
    },
    {
      "indent": 3,
      "text": "While public exposure and review of media types to be registered in the vendor tree are not required, using the media-types@iana.org mailing list for review is encouraged, to improve the quality of those specifications. Registrations in the vendor tree may be submitted directly to the IANA, where they will undergo Expert Review [RFC5226] prior to approval.",
      "ja": "公共露出、メディアタイプのレビューは、ベンダ木に登録される一方で、これらの仕様の品質を向上させるために、レビュー用media-types@iana.orgメーリングリストが奨励されている使用して、必要とされていません。ベンダ木の登録は、彼らが承認する前に専門家のレビュー[RFC5226]を受けるIANAに直接提出することができます。"
    },
    {
      "indent": 0,
      "text": "3.3. Personal or Vanity Tree",
      "section_title": true,
      "ja": "3.3。個人やバニティツリー"
    },
    {
      "indent": 3,
      "text": "Registrations for media types created experimentally or as part of products that are not distributed commercially may be registered in the personal or vanity tree. The registrations are distinguished by the leading facet \"prs.\".",
      "ja": "メディアタイプの登録は、実験的または商業的に配布されていない個人や虚栄心、ツリーに登録することができる製品の一部として作成されました。登録は主要な面で区別されている「PRS。」。"
    },
    {
      "indent": 3,
      "text": "The owner of \"personal\" registrations and associated specifications is the person or entity making the registration, or one to whom responsibility has been transferred as described below.",
      "ja": "「個人」の登録と関連仕様の所有者は、個人または団体の登録を行うか、後述のように責任が転送されてきた人に一つです。"
    },
    {
      "indent": 3,
      "text": "While public exposure and review of media types to be registered in the personal tree are not required, using the media-types@iana.org mailing list (see Section 5.1) for review is encouraged, to improve the quality of those specifications. Registrations in the personal tree may be submitted directly to the IANA, where they will undergo Expert Review [RFC5226] prior to approval.",
      "ja": "個人的なツリーに登録するメディアタイプの公共暴露とレビューはmedia-types@iana.orgメーリングリストを使用して、必要とされていませんが（セクション5.1を参照）レビューのために、これらの仕様の品質を向上させるために、奨励されます。個人的なツリー内の登録は、彼らが承認する前に専門家のレビュー[RFC5226]を受けるIANAに直接提出することができます。"
    },
    {
      "indent": 0,
      "text": "3.4. Unregistered x. Tree",
      "section_title": true,
      "ja": "3.4。未登録のx。木"
    },
    {
      "indent": 3,
      "text": "Subtype names with \"x.\" as the first facet may be used for types intended exclusively for use in private, local environments. Types in this tree cannot be registered and are intended for use only with the active agreement of the parties exchanging them.",
      "ja": "サブタイプ名「X」。最初のファセットは、プライベート、ローカル環境での使用のためだけに意図したタイプのために使用することができるよう。このツリー内のタイプを登録することができませんし、それらだけを交換する当事者の積極的合意での使用を目的としています。"
    },
    {
      "indent": 3,
      "text": "However, with the simplified registration procedures described above for vendor and personal trees, it should rarely, if ever, be necessary to use unregistered types. Therefore, use of types in the \"x.\" tree is strongly discouraged.",
      "ja": "しかし、ベンダーとの個人的な木のため、上記の簡略化され、登録手続きと、ほとんど、これまでであれば、未登録のタイプを使用する必要があってはなりません。そのため、内の型を使用する「×」。ツリーは、強くお勧めします。"
    },
    {
      "indent": 3,
      "text": "Note that types with names beginning with \"x-\" are no longer considered to be members of this tree (see [RFC6648]). Also note that if a generally useful and widely deployed type incorrectly ends up with an \"x-\" name prefix, it MAY be registered using its current name in an alternative tree by following the procedure defined in Appendix A.",
      "ja": "「X-」で始まる名前を持つ型は、もはやこのツリーのメンバーであると考えられていることに注意してください（参照[RFC6648]）。また、付録Aで定義された手順に従うことによって、一般的に有用で広く採用されているタイプが誤って「X-」名の接頭辞で終わる場合、それは別のツリーに現在の名前を使用して登録することがあります"
    },
    {
      "indent": 0,
      "text": "3.5. Additional Registration Trees",
      "section_title": true,
      "ja": "3.5。追加登録木"
    },
    {
      "indent": 3,
      "text": "From time to time and as required by the community, new top-level registration trees may be created by IETF Standards Action. It is explicitly assumed that these trees may be created for external registration and management by well-known permanent organizations; for example, scientific societies may register media types specific to the sciences they cover. In general, the quality of review of specifications for one of these additional registration trees is expected to be equivalent to registrations in the standards tree by a recognized standards-related organization. When the IETF performs such review, it needs to consider the greater expertise of the requesting organization with respect to the subject media type.",
      "ja": "時々、コミュニティで必要とされる、新しいトップレベル登録木は、IETF標準化行動によって作成することができます。明示的にこれらの木は、よく知られた永久機関が外部の登録と管理のために作成されることが想定されます。例えば、科学的社会は、彼らがカバー科学に特定のメディアタイプを登録することもできます。一般的に、これらの追加登録木の一つの仕様の見直しの品質が認められた基準関連団体によって規格木に登録と同等であることが期待されます。 IETFは、このような評価を行う場合、それは対象のメディアタイプに対する要求組織の大きな専門性を考慮する必要があります。"
    },
    {
      "indent": 0,
      "text": "4. Registration Requirements",
      "section_title": true,
      "ja": "4.登録要件"
    },
    {
      "indent": 3,
      "text": "Media type registrations are all expected to conform to various requirements laid out in the following sections. Note that requirement specifics sometimes vary depending on the registration tree, again as detailed in the following sections.",
      "ja": "メディアタイプの登録は、以下のすべてのセクションにレイアウトされ、さまざまな要件に適合することが期待されます。以下のセクションで詳述するようにその要件の詳細は、時には再度、登録ツリーに依存して変化に留意されたいです。"
    },
    {
      "indent": 0,
      "text": "4.1. Functionality Requirement",
      "section_title": true,
      "ja": "4.1。機能要件"
    },
    {
      "indent": 3,
      "text": "Media types MUST function as actual media formats. Registration of things that are better thought of as a transfer encoding, as a charset, or as a collection of separate entities of another type, is not allowed. For example, although applications exist to decode the base64 transfer encoding [RFC2045], base64 cannot be registered as a media type.",
      "ja": "メディアタイプは、実際のメディアフォーマットとして機能しなければなりません。より良い文字セットとして、または別の種類の別々のエンティティのコレクションとして、転送エンコーディングとして考えられているものの登録は、許可されていません。アプリケーションがBASE64転送エンコード[RFC2045]をデコードするために存在するが、例えば、BASE64は、メディアタイプとして登録することができません。"
    },
    {
      "indent": 3,
      "text": "This requirement applies regardless of the registration tree involved.",
      "ja": "この要件はかかわった登録木にかかわらず適用されます。"
    },
    {
      "indent": 0,
      "text": "4.2. Naming Requirements",
      "section_title": true,
      "ja": "4.2。要件の命名"
    },
    {
      "indent": 3,
      "text": "All registered media types MUST be assigned top-level type and subtype names. The combination of these names serves to uniquely identify the media type, and the subtype name facet (or the absence of one) identifies the registration tree. Both top-level type and subtype names are case-insensitive.",
      "ja": "登録されているすべてのメディアタイプは、トップレベルのタイプとサブタイプ名を割り当てなければなりません。これらの名前の組み合わせが一意のメディアタイプを識別するためのものであり、サブタイプ名ファセット（または1つの欠如）が登録木を識別する。両方のトップレベルタイプとサブタイプ名は大文字と小文字を区別しています。"
    },
    {
      "indent": 3,
      "text": "Type and subtype names MUST conform to the following ABNF:",
      "ja": "タイプとサブタイプ名は、次のABNFに従わなければなりません。"
    },
    {
      "indent": 5,
      "text": "type-name = restricted-name subtype-name = restricted-name",
      "ja": "型名=制限名のサブタイプ名=制限名"
    },
    {
      "indent": 5,
      "text": "restricted-name = restricted-name-first *126restricted-name-chars restricted-name-first = ALPHA / DIGIT restricted-name-chars = ALPHA / DIGIT / \"!\" / \"#\" / \"$\" / \"&\" / \"-\" / \"^\" / \"_\" restricted-name-chars =/ \".\" ; Characters before first dot always ; specify a facet name restricted-name-chars =/ \"+\" ; Characters after last plus always ; specify a structured syntax suffix",
      "ja": "制限された名=制限-名-最初* 126restricted名 - 文字制限名-最初= ALPHA / DIGIT制限-名-文字= ALPHA / DIGIT / \"！\" / \"＃\" / \"$\" / \"＆\" / \" - \" / \"^\" / \"_\" 制限された名前と文字の= / \"\" ;常に最初のドットの前の文字。ファセット名を指定する= /「+」名 - 文字制限。常に最後プラス後の文字。構造化された構文のサフィックスを指定"
    },
    {
      "indent": 3,
      "text": "Note that this syntax is somewhat more restrictive than what is allowed by the ABNF in Section 5.1 of [RFC2045] or Section 4.2 of [RFC4288]. Also note that while this syntax allows names of up to 127 characters, implementation limits may make such long names problematic. For this reason, <type-name> and <subtype-name> SHOULD be limited to 64 characters.",
      "ja": "この構文は、[RFC2045]のセクション5.1 [RFC4288]のセクション4.2でABNFによって許可されているものよりも幾分より制限的であることに留意されたいです。また、この構文は、最大127文字の名前を可能にしながら、実装の制限は、このような長い名前を問題にする可能性があることに注意。このため、<タイプ名>と<サブタイプ名>の場合は64文字に制限する必要があります。"
    },
    {
      "indent": 3,
      "text": "Although the name syntax treats \".\" as equivalent to any other character, characters before any initial \".\" always specify the registration facet. Note that this means that facet-less standards-tree registrations cannot use periods in the subtype name.",
      "ja": "名前の構文扱いますが、「」他の文字、文字の任意の初期前と同等として、「」常に登録ファセットを指定します。これは、ファセットレス標準木の登録は、サブタイプ名にピリオドを使用できないことを意味することに注意してください。"
    },
    {
      "indent": 3,
      "text": "Similarly, the final \"+\" in a subtype name introduces a structured syntax specifier suffix. Structured syntax suffix requirements are specified in Section 4.2.8.",
      "ja": "同様に、最後の「+」のサブタイプ名は、構造化された構文指定のサフィックスを紹介します。構造化構文サフィックス要件は、セクション4.2.8で指定されています。"
    },
    {
      "indent": 3,
      "text": "While it is possible for a given media type to be assigned additional names, the use of different names to identify the same media type is discouraged.",
      "ja": "それは追加の名前を割り当てる所与のメディアタイプのために可能であるが、同一のメディアタイプを識別するために異なる名前を使用することが推奨されます。"
    },
    {
      "indent": 3,
      "text": "These requirements apply regardless of the registration tree involved.",
      "ja": "これらの要件はかかわった登録木にかかわらず適用されます。"
    },
    {
      "indent": 3,
      "text": "The choice of top-level type MUST take into account the nature of media type involved. New subtypes of top-level types MUST conform to the restrictions of the top-level type, if any. The following sections describe each of the initial set of top-level types and their associated restrictions. Additionally, various protocols, including but not limited to HTTP and MIME, MAY impose additional restrictions on the media types they can transport. (See [RFC2046] for additional information on the restrictions MIME imposes.)",
      "ja": "トップレベルのタイプの選択は、アカウントに関連するメディアタイプの性質を取る必要があります。いずれかの場合には、トップレベルの型の新しいサブタイプは、トップレベルタイプの制限に従わなければなりません。以下のセクションでは、トップレベルのタイプおよびその関連の制約の初期セットの各々を記述する。また、HTTPとMIMEを含むがこれらに限定されない様々なプロトコルが、彼らは輸送することができるメディアの種類の追加の制限を課すことができます。 （MIMEを課し制限の詳細については、[RFC2046]を参照してください。）"
    },
    {
      "indent": 0,
      "text": "4.2.1. Text Media Types",
      "section_title": true,
      "ja": "4.2.1。テキストメディアタイプ"
    },
    {
      "indent": 3,
      "text": "The \"text\" top-level type is intended for sending material that is principally textual in form.",
      "ja": "「テキスト」トップレベルのタイプは形で、主にテキスト形式で情報を送信するためのものです。"
    },
    {
      "indent": 3,
      "text": "Many subtypes of text, notably including the subtype \"text/plain\", which is a generic subtype for plain text defined in [RFC2046], define a \"charset\" parameter. If a \"charset\" parameter is defined for a particular subtype of text, it MUST be used to specify a charset name defined in accordance to the procedures laid out in [RFC2978].",
      "ja": "特に、[RFC2046]で定義されたプレーンテキストのための一般的なサブタイプであるサブタイプ「text / plainの」などのテキストの多くのサブタイプは、「文字セット」パラメータを定義します。 「文字セット」パラメータは、テキストの特定のサブタイプのために定義されている場合、[RFC2978]にレイアウトされた手順に基づいて定義された文字セット名を指定するために使用されなければなりません。"
    },
    {
      "indent": 3,
      "text": "As specified in [RFC6657], a \"charset\" parameter SHOULD NOT be specified when charset information is transported inside the payload (e.g., as in \"text/xml\").",
      "ja": "[RFC6657]で指定された文字セット情報は、ペイロードの内部に搬送されるとき、「文字セット」パラメータを指定することはできません（例えば、「テキスト/ XML」のように）。"
    },
    {
      "indent": 3,
      "text": "If a \"charset\" parameter is specified, it SHOULD be a required parameter, eliminating the options of specifying a default value. If there is a strong reason for the parameter to be optional despite this advice, each subtype MAY specify its own default value, or alternatively, it MAY specify that there is no default value. Finally, the \"UTF-8\" charset [RFC3629] SHOULD be selected as the default. See [RFC6657] for additional information on the use of \"charset\" parameters in conjunction with subtypes of text.",
      "ja": "「文字セット」パラメータを指定する場合は、デフォルト値を指定するオプションを排除し、必要なパラメータであるべきです。パラメータはこのアドバイスにもかかわらず、オプションであるためには、強力な理由がある場合は、各サブタイプは、独自のデフォルト値を指定してよく、あるいは、それはデフォルト値がないことを指定してもよいです。最後に、 \"UTF-8\" 文字セット[RFC3629]はデフォルトで選択されるべきである（SHOULD）。テキストのサブタイプと関連して、「文字セット」のパラメータの使用に関する追加情報については、[RFC6657]を参照してください。"
    },
    {
      "indent": 3,
      "text": "Regardless of what approach is chosen, all new text/* registrations\nMUST clearly specify how the charset is determined; relying on the\nUS-ASCII default defined in Section 4.1.2 of [RFC2046] is no longer",
      "raw": true
    },
    {
      "indent": 3,
      "text": "permitted. If explanatory text is needed, this SHOULD be placed in the additional information section of the registration.",
      "ja": "許可。説明文が必要な場合、これは、登録の追加情報セクションに配置する必要があります。"
    },
    {
      "indent": 3,
      "text": "Plain text does not provide for or allow formatting commands, font attribute specifications, processing instructions, interpretation directives, or content markup. Plain text is seen simply as a linear sequence of characters, possibly interrupted by line breaks or page breaks. Plain text MAY allow the stacking of several characters in the same position in the text. Plain text in scripts like Arabic and Hebrew may also include facilities that allow the arbitrary mixing of text segments with different writing directions.",
      "ja": "プレーンテキストは、のために提供するか、またはコマンド、フォント属性の仕様、処理命令、解釈ディレクティブ、またはコンテンツのマークアップをフォーマットすることはできません。プレーンテキストは単におそらく改行や改ページによって中断文字の線状配列、と見られています。プレーンテキストは、テキスト内の同じ位置に複数の文字の積み重ねを可能にすることができます。アラビア語、ヘブライ語などのスクリプトにプレーンテキストは、異なる書込方向とテキストセグメントの任意の混合を可能にする設備を含むことができます。"
    },
    {
      "indent": 3,
      "text": "Beyond plain text, there are many formats for representing what might be known as \"rich text\". An interesting characteristic of many such representations is that they are to some extent readable even without the software that interprets them. It is useful to distinguish them, at the highest level, from such unreadable data as images, audio, or text represented in an unreadable form. In the absence of appropriate interpretation software, it is reasonable to present subtypes of \"text\" to the user, while it is not reasonable to do so with most non-textual data. Such formatted textual data can be represented using subtypes of \"text\".",
      "ja": "プレーンテキストを越えて、「リッチテキスト」として知られているかもしれないもの表すための多くのフォーマットがあります。多くのそのような表現の興味深い特徴は、彼らもそれを解釈するソフトウェアを使用せずに、ある程度まで読み取り可能であるということです。読めない形で表される画像、音声、テキストなどの読めないデータから、最高のレベルで、それらを区別するために有用です。適切な解釈ソフトウェアがない場合には、ほとんどの非テキストデータと、そうすることは合理的ではないが、利用者に「テキスト」のサブタイプを提示するのが合理的です。このようなフォーマットされたテキストデータは、「テキスト」のサブタイプを使用して表現することができます。"
    },
    {
      "indent": 0,
      "text": "4.2.2. Image Media Types",
      "section_title": true,
      "ja": "4.2.2。画像メディアタイプ"
    },
    {
      "indent": 3,
      "text": "A top-level type of \"image\" indicates that the content specifies one or more individual images. The subtype names the specific image format.",
      "ja": "「画像」のトップレベルタイプは、コンテンツは、1つ以上の個々の画像を指定していることを示しています。サブタイプ名特定の画像フォーマット。"
    },
    {
      "indent": 0,
      "text": "4.2.3. Audio Media Types",
      "section_title": true,
      "ja": "4.2.3。オーディオメディアタイプ"
    },
    {
      "indent": 3,
      "text": "A top-level type of \"audio\" indicates that the content contains audio data. The subtype names the specific audio format.",
      "ja": "「オーディオ」のトップレベルタイプは、コンテンツがオーディオデータを含むことを示します。サブタイプ名特定のオーディオフォーマット。"
    },
    {
      "indent": 0,
      "text": "4.2.4. Video Media Types",
      "section_title": true,
      "ja": "4.2.4。動画のメディアタイプ"
    },
    {
      "indent": 3,
      "text": "A top-level type of \"video\" indicates that the content specifies a time-varying-picture image, possibly with color and coordinated sound. The term 'video' is used in its most generic sense, rather than with reference to any particular technology or format, and is not meant to preclude subtypes such as animated drawings encoded compactly.",
      "ja": "「ビデオ」のトップレベルタイプは、コンテンツは、おそらく色と協調音と、時間的に変化する映像画像を指定していることを示しています。用語「ビデオ」はなく、任意の特定の技術またはフォーマットを参照してより、その最も一般的な意味で使用され、そしてそのようなコンパクトに符号化されたアニメーションの図面としてサブタイプを排除するものではありません。"
    },
    {
      "indent": 3,
      "text": "Note that although in general the mixing of multiple kinds of media in a single body is discouraged [RFC2046], it is recognized that many video formats include a representation for synchronized audio and/or text, and this is explicitly permitted for subtypes of \"video\".",
      "ja": "一般に、単体でのメディアの複数種の混合は[RFC2046]推奨されているが、多くのビデオフォーマットが同期オーディオおよび/またはテキストの表現を含むことが認識され、これは明示的に「ビデオのサブタイプのために許可されていることに注意してください」。"
    },
    {
      "indent": 0,
      "text": "4.2.5. Application Media Types",
      "section_title": true,
      "ja": "4.2.5。アプリケーションメディアタイプ"
    },
    {
      "indent": 3,
      "text": "The \"application\" top-level type is to be used for discrete data that do not fit under any of the other type names, and particularly for data to be processed by some type of application program. This is information that must be processed by an application before it is viewable or usable by a user. Expected uses for the \"application\" type name include but are not limited to file transfer, spreadsheets, presentations, scheduling data, and languages for \"active\" (computational) material. (The last, in particular, can pose security problems that must be understood by implementors. The \"application/postscript\" media type registration in [RFC2046] provides a good example of how to handle these issues.)",
      "ja": "「アプリケーション」トップレベルの型が他の型の名前のいずれかに適合し、特にアプリケーションプログラムのいくつかの種類によって処理されるデータのためにしていない離散データのために使用されるべきです。これは、ユーザによって視認可能または使用可能になる前に、アプリケーションによって処理されなければならない情報です。 「アプリケーション」タイプの名前の予想用途としては、「アクティブ」（計算）材料のために転送、スプレッドシート、プレゼンテーション、スケジュールデータ、および言語をファイルに限定されるものではありません。 （最後には、具体的には、実装によって理解されなければならないセキュリティ上の問題を提起することができます。[RFC2046]で「アプリケーション/追伸」メディアタイプの登録は、これらの問題を処理する方法の良い例を提供します。）"
    },
    {
      "indent": 3,
      "text": "For example, a meeting scheduler might define a standard representation for information about proposed meeting dates. An intelligent user agent would use this information to conduct a dialog with the user, and might then send additional material based on that dialog. More generally, there have been several \"active\" languages developed in which programs in a suitably specialized language are transported to a remote location and automatically run in the recipient's environment. Such applications may be defined as subtypes of the \"application\" top-level type.",
      "ja": "例えば、会議のスケジュール担当者は、提案された会議の日付については、標準的な表現を定義できます。インテリジェントユーザーエージェントは、ユーザーとの対話を行うために、この情報を使用し、その後、そのダイアログに基づいて追加の材料を送信することがあります。より一般的には、適当に特化した言語でプログラムが遠隔地に輸送し、自動的に受信者の環境で実行されている開発されたいくつかの「アクティブ」な言語がありました。そのようなアプリケーションは、「アプリケーション」トップレベルタイプのサブタイプとして定義することができます。"
    },
    {
      "indent": 3,
      "text": "The subtype of \"application\" will often either be the name or include part of the name of the application for which the data are intended. This does not mean, however, that any application program name may simply be used freely as a subtype of \"application\"; the subtype needs to be registered.",
      "ja": "「アプリケーション」のサブタイプは、多くの場合、いずれかの名前であるか、データが意図されるアプリケーションの名前の一部が含まれます。これは、任意のアプリケーションプログラム名は単に「アプリケーション」のサブタイプとして自由に使用できることは、意味するものではありません。サブタイプを登録する必要があります。"
    },
    {
      "indent": 0,
      "text": "4.2.6. Multipart and Message Media Types",
      "section_title": true,
      "ja": "4.2.6。マルチパートとメッセージメディアタイプ"
    },
    {
      "indent": 3,
      "text": "Multipart and message are composite types; that is, they provide a means of encapsulating zero or more objects, each one a separate media type.",
      "ja": "マルチパートメッセージは複合型です。つまり、それらは、ゼロ以上のオブジェクト、それぞれ1つの別個のメディアタイプをカプセル化する手段を提供します。"
    },
    {
      "indent": 3,
      "text": "All subtypes of multipart and message MUST conform to the syntax rules and other requirements specified in [RFC2046] and amended by Section 3.5 of [RFC6532].",
      "ja": "マルチパートとメッセージのすべてのサブタイプは、構文規則と[RFC2046]で指定し、[RFC6532]のセクション3.5で修正されたその他の要求事項に従わなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.2.7. Additional Top-Level Types",
      "section_title": true,
      "ja": "4.2.7。追加のトップレベルの種類"
    },
    {
      "indent": 3,
      "text": "In some cases, a new media type may not \"fit\" under any currently defined top-level type names. Such cases are expected to be quite rare. However, if such a case does arise, a new type name can be defined to accommodate it. Definition of a new top-level type name MUST be done via a Standards Track RFC; no other mechanism can be used to define additional type names.",
      "ja": "いくつかのケースでは、新しいメディアの種類は、任意の現在定義されているトップレベルのタイプ名の下に「フィット」しない場合があります。このようなケースは非常にまれであると予想されます。このような場合には発生しない場合は、新しいタイプの名前は、それに対応するように定義することができます。新しいトップレベルの型名の定義は、標準化過程のRFCを介して行われなければなりません。他のメカニズムは、追加型の名前を定義するために使用することはできません。"
    },
    {
      "indent": 0,
      "text": "4.2.8. Structured Syntax Name Suffixes",
      "section_title": true,
      "ja": "4.2.8。構造化された構文の名前サフィックス"
    },
    {
      "indent": 3,
      "text": "XML in MIME [RFC3023] defined the first such augmentation to the media type definition to additionally specify the underlying structure of that media type. To quote:",
      "ja": "MIME [RFC3023]のXMLは、さらに、そのメディアタイプの基本構造を指定するメディア・タイプ定義に最初のそのような増大を定義しました。引用すると："
    },
    {
      "indent": 6,
      "text": "This document also standardizes a convention (using the suffix '+xml') for naming media types ... when those media types represent XML MIME (Multipurpose Internet Mail Extensions) entities.",
      "ja": "この文書はまた、これらのメディアタイプがXMLのMIME（多目的インターネットメール拡張）エンティティを表す...際にメディアタイプの命名規則（接尾辞を使用して「+ XML」）を標準化しています。"
    },
    {
      "indent": 3,
      "text": "That is, it specified a suffix (in that case, \"+xml\") to be appended to the base subtype name.",
      "ja": "すなわち、ベースサブタイプ名に付加されるサフィックス（その場合には、「+ XML」）を指定しています。"
    },
    {
      "indent": 3,
      "text": "Since this was published, the de facto practice has arisen for using this suffix convention for other well-known structuring syntaxes. In particular, media types have been registered with suffixes such as \"+der\", \"+fastinfoset\", and \"+json\". This specification formalizes this practice and sets up a registry for structured type name suffixes.",
      "ja": "これが出版されて以来、事実上の練習は、他のよく知られた構造化構文については、この接尾辞規則を使用するために生じています。具体的には、メディアタイプは、「+ DER」、「+ fastinfoset」、および「+ JSON」などのサフィックスに登録されています。この仕様は、このような行為を形式化し、構造化型の名前サフィックスのレジストリを設定します。"
    },
    {
      "indent": 3,
      "text": "The primary guideline for whether a structured type name suffix is registrable is that it be described by a readily available description, preferably within a document published by an established standards-related organization, and for which there's a reference that can be used in a Normative References section of an RFC.",
      "ja": "構造タイプ名のサフィックスが登録可能であるかどうかのための主要なガイドラインは、好ましくは、確立された標準関連団体によって発行された文書内に、それは容易に入手可能な説明によって説明されることがあり、そのため引用規格で使用することができる基準がありますRFCのセクション。"
    },
    {
      "indent": 3,
      "text": "Media types that make use of a named structured syntax SHOULD use the appropriate registered \"+suffix\" for that structured syntax when they are registered. By the same token, media types MUST NOT be given names incorporating suffixes for structured syntaxes they do not actually employ. \"+suffix\" constructs for as-yet unregistered structured syntaxes SHOULD NOT be used, given the possibility of conflicts with future suffix definitions.",
      "ja": "それらが登録されているときという名前の構造化された構文を利用するメディアタイプは、その構造化された構文については、「+接尾辞」に登録適切なを使用すべきです。同様に、メディアタイプは、彼らが実際に使用しない構造化された構文のためのサフィックスを組み込む名前を与えてはなりません。 「+接尾語は、」将来の接尾語の定義との競合の可能性が与えられ、未登録の構造化された構文を使用すべきでないとして、まだのために構築します。"
    },
    {
      "indent": 0,
      "text": "4.2.9. Deprecated Aliases",
      "section_title": true,
      "ja": "4.2.9。非推奨エイリアス"
    },
    {
      "indent": 3,
      "text": "In some cases, a single media type may have been widely deployed prior to registration under multiple names. In such cases, a preferred name MUST be chosen for the media type, and applications MUST use this to be compliant with the type's registration. However, a list of deprecated aliases by which the type is known MAY be supplied as additional information in order to assist applications in processing the media type properly.",
      "ja": "いくつかのケースでは、単一のメディアタイプが広く、複数の名前で登録前に展開されている可能性があります。このような場合には、優先名はメディアタイプを選ばなければなりません、そしてアプリケーションは、タイプの登録に準拠するように、これを使用しなければなりません。しかし、種類が知られていることにより、廃止予定のエイリアスのリストは、正しくメディアタイプを処理する際にアプリケーションを支援するために、追加情報として供給され得ます。"
    },
    {
      "indent": 0,
      "text": "4.3. Parameter Requirements",
      "section_title": true,
      "ja": "4.3。パラメータの要件"
    },
    {
      "indent": 3,
      "text": "Media types MAY elect to use one or more media type parameters, or some parameters may be automatically made available to the media type by virtue of being a subtype of a content type that defines a set of parameters applicable to any of its subtypes. In either case, the names, values, and meanings of any parameters MUST be fully specified when a media type is registered in the standards tree, and SHOULD be specified as completely as possible when media types are registered in the vendor or personal trees.",
      "ja": "メディアタイプは、1つまたは複数のメディアタイプパラメータを使用することを選択することができる、またはいくつかのパラメータが自動的にそのサブタイプのいずれかに適用可能なパラメータのセットを定義するコンテンツ・タイプのサブタイプであることによって、メディアタイプに利用可能にすることができます。メディアタイプが標準ツリーに登録され、メディアタイプをベンダーまたはパーソナルツリーに登録されているときにできるだけ完全に指定する必要がある場合いずれの場合においても、任意のパラメータの名前、値、および意味は完全に指定されなければなりません。"
    },
    {
      "indent": 3,
      "text": "Parameter names have the syntax as media type names and values:",
      "ja": "パラメータ名は、メディアタイプの名前と値のような構文を持っています："
    },
    {
      "indent": 7,
      "text": "parameter-name = restricted-name",
      "ja": "パラメータ名=制限名"
    },
    {
      "indent": 3,
      "text": "Note that this syntax is somewhat more restrictive than what is allowed by the ABNF in [RFC2045] and amended by [RFC2231].",
      "ja": "この構文は、[RFC2045]でABNFによって許可され、[RFC2231]によって改正されたものよりもいくらか制限的であることに注意してください。"
    },
    {
      "indent": 3,
      "text": "Parameter names are case-insensitive and no meaning is attached to the order in which they appear. It is an error for a specific parameter to be specified more than once.",
      "ja": "パラメータ名は大文字と小文字を区別しないと何の意味は、それらが表示される順に添付されていません。これは、複数回指定する特定のパラメータのエラーです。"
    },
    {
      "indent": 3,
      "text": "There is no defined syntax for parameter values. Therefore, registrations MUST specify parameter value syntax. Additionally, some transports impose restrictions on parameter value syntax, so care needs be taken to limit the use of potentially problematic syntaxes; e.g., pure binary valued parameters, while permitted in some protocols, are best avoided.",
      "ja": "パラメータ値には定義されている構文はありません。そのため、登録は、パラメータ値の構文を指定しなければなりません。ケアのニーズは潜在的に問題の構文の使用を制限するために取られるので、さらに、いくつかのトランスポートは、パラメータ値の構文上の制限を課します。いくつかのプロトコルで許可しながら、例えば、純粋なバイナリ値パラメーターは、最高の回避されます。"
    },
    {
      "indent": 3,
      "text": "Note that a protocol can impose further restrictions on parameter value syntax, depending on how it chooses to represent parameters. Both MIME [RFC2045] [RFC2231] and HTTP [RFC2045] [RFC5987] allow binary parameters as well as parameter values expressed in a specific charset, but other protocols may be less flexible.",
      "ja": "プロトコルは、それがパラメータを表すことを選択する方法に応じて、パラメータ値構文にさらなる制限を課すことができることに留意されたいです。両方のMIME [RFC2045]、[RFC2231]とHTTP [RFC2045]、[RFC5987]は、特定の文字セットで表現さバイナリパラメータならびにパラメータ値を許すが、他のプロトコルはあまり柔軟であってもよいです。"
    },
    {
      "indent": 3,
      "text": "New parameters SHOULD NOT be defined as a way to introduce new functionality in types registered in the standards tree, although new parameters MAY be added to convey additional information that does not otherwise change existing functionality. An example of this would be a \"revision\" parameter to indicate a revision level of an external specification such as JPEG. Similar behavior is encouraged for media types registered in the vendor or personal trees, but is not required.",
      "ja": "新しいパラメータは、そうでない場合は、既存の機能を変更しない付加的な情報を伝えるために添加してもよいが、新しいパラメータは、規格木に登録種類の新機能を導入する方法として定義されるべきではありません。この例は、JPEGなどの外部仕様の改訂レベルを示すために、「改訂」パラメーターであろう。同様の挙動は、ベンダーや個人的なツリーに登録されたメディアタイプのために奨励されるが、必須ではありません。"
    },
    {
      "indent": 3,
      "text": "Changes to parameters (including the introduction of new ones) is managed in the same manner as other changes to the media type; see Section 5.5.",
      "ja": "（新しいものの導入を含む）のパラメータへの変更は、メディアタイプに他の変更と同様に管理されています。セクション5.5を参照してください。"
    },
    {
      "indent": 0,
      "text": "4.4. Canonicalization and Format Requirements",
      "section_title": true,
      "ja": "4.4。正規化とフォーマットの要件"
    },
    {
      "indent": 3,
      "text": "All registered media types MUST employ a single, canonical data format, regardless of registration tree.",
      "ja": "登録されているすべてのメディアタイプは、登録木にかかわらず、単一の標準的なデータ形式を採用しなければなりません。"
    },
    {
      "indent": 3,
      "text": "A permanent and readily available public specification of the format for the media type MUST exist for all types registered in the standards tree. This specification MUST provide sufficient detail so that interoperability between independent implementations using the media type is possible. This specification MUST at a minimum be referenced by, if it is not actually included in, the media type registration proposal itself.",
      "ja": "メディアタイプのフォーマットの恒久的かつ容易に利用可能な公開された仕様は規格木に登録されているすべてのタイプのために存在しなければなりません。メディアタイプを使用して、独立した実装の間の相互運用が可能であるように、この仕様では、十分な詳細を提供しなければなりません。それは実際には、メディアタイプ登録提案自体は含まれていない場合、この仕様は最低でも、で参照する必要があります。"
    },
    {
      "indent": 3,
      "text": "The specifications of format and processing particulars may or may not be publicly available for media types registered in the vendor and personal trees. Such registrations are explicitly permitted to limit the information in the registration to which software and version produce or process such media types. As such, references to or inclusion of format specifications in registrations is encouraged but not required. Note, however, that the public availability of a meaningful specification will often make the difference between simply having a name reserved so that there are no conflicts with other uses and having the potential for other implementations of the media type and useful interoperation with them.",
      "ja": "フォーマットおよび処理細目の仕様はやベンダーとの個人的なツリーに登録されたメディアタイプのために公に利用可能であってもなくてもよいです。そのような登録は、明示的に登録するソフトウェアとバージョン生産またはプロセス、メディアタイプの情報を制限することが許可されています。このようにして、参考文献または登録中のフォーマット仕様を含めることが奨励さが、必須ではありません。意味のある仕様のパブリック可用性は、多くの場合、単に他の用途との競合が発生しないように予約名を持つ、メディアタイプと、それらに有用な相互運用の他の実装の可能性を持つとの違いを生むだろうということ、しかし、注意してください。"
    },
    {
      "indent": 3,
      "text": "Some media types involve the use of patented technology. The registration of media types involving patented technology is specifically permitted. However, the restrictions set forth in BCP 79 [RFC3979] and BCP 78 [RFC5378] on the use of patented technology in IETF Standards Track protocols must be respected when the specification of a media type is part of a Standards Track protocol. In addition, other standards-related organizations making use of the standards tree may have their own rules regarding intellectual property that must be observed in their registrations.",
      "ja": "一部のメディアタイプは、特許技術の使用を含みます。特許技術を含むメディアタイプの登録を具体的に許可されています。しかし、BCP 79 [RFC3979]およびBCP 78 IETF標準化過程プロトコルにおける特許技術の使用上の[RFC5378]に定められた規制は、メディアタイプの仕様が標準化過程プロトコルの一部である場合に尊重されなければなりません。また、規格木を利用して他の標準関連団体は、その登録に観察する必要があり、知的財産に関する独自のルールを持っていることがあります。"
    },
    {
      "indent": 3,
      "text": "Intellectual Property Rights (IPR) disclosures for registrations in the vendor and personal trees are encouraged but not required.",
      "ja": "知的財産権（IPR）ベンダーとの個人的な木での登録のための開示が奨励さが、必須ではありません。"
    },
    {
      "indent": 0,
      "text": "4.5. Interchange Recommendations",
      "section_title": true,
      "ja": "4.5。インターチェンジの推奨事項"
    },
    {
      "indent": 3,
      "text": "Ideally, media types will be defined so they interoperate across as many systems and applications as possible. However, some media types will inevitably have problems interoperating across different platforms. Problems with different versions, byte ordering, and specifics of gateway handling can and will arise.",
      "ja": "彼らはできるだけ多くのシステムやアプリケーション間で相互運用理想的には、メディアタイプが定義されます。しかし、いくつかのメディアタイプは、必然的に、異なるプラットフォーム間で相互運用問題が発生します。異なるバージョン、バイト順序、およびゲートウェイ操作の詳細と問題が発生するとされますすることができます。"
    },
    {
      "indent": 3,
      "text": "Universal interoperability of media types is not required, but known interoperability issues SHOULD be identified whenever possible. Publication of a media type does not require an exhaustive review of interoperability, and the interoperability considerations section is subject to continuing evaluation.",
      "ja": "メディアタイプのユニバーサル相互運用性が必要とされていませんが、知られている相互運用性の問題は、可能な限り特定されるべきです。メディアタイプの公表は、相互運用性の徹底的な見直しを必要としない、との相互運用性の考慮事項のセクションでは、継続的な評価の対象となります。"
    },
    {
      "indent": 3,
      "text": "The recommendations in this subsection apply regardless of the registration tree involved.",
      "ja": "この項の推奨事項はかかわった登録木にかかわらず適用されます。"
    },
    {
      "indent": 0,
      "text": "4.6. Security Requirements",
      "section_title": true,
      "ja": "4.6。セキュリティ要件"
    },
    {
      "indent": 3,
      "text": "An analysis of security issues MUST be done for all types registered in the standards tree. A similar analysis for media types registered in the vendor or personal trees is encouraged but not required. However, regardless of what security analysis has or has not been done, all descriptions of security issues MUST be as accurate as possible regardless of registration tree. In particular, the security considerations MUST NOT state that there are \"no security issues associated with this type\". Security considerations for types in the vendor or personal tree MAY say that \"the security issues associated with this type have not been assessed\".",
      "ja": "セキュリティ問題の分析は、規格木に登録されているすべてのタイプのために行われなければなりません。ベンダーや個人的なツリーに登録されたメディアタイプについて同様の分析が奨励さが、必須ではありません。しかし、関係なく、セキュリティ分析が持っているか行われていないものの、セキュリティ問題のすべての記述は、登録木にかかわらず、可能な限り正確でなければなりません。具体的には、セキュリティ上の考慮事項は、「この種類に関連付けられたセキュリティ上の問題」が存在しないことを述べるならありません。ベンダーや個人のツリー内の種類のセキュリティの考慮事項は、「この種類に関連付けられているセキュリティ上の問題が評価されていない」と言うかもしれません。"
    },
    {
      "indent": 3,
      "text": "There is absolutely no requirement that media types registered in any tree be secure or completely free from risks. Nevertheless, all known security risks MUST be identified in the registration of a media type, again regardless of registration tree.",
      "ja": "任意のツリーに登録されたメディアタイプが安全やリスクから完全に自由である必要は全くありません。それにもかかわらず、すべての既知のセキュリティリスクは、再び登録木にかかわらず、メディアタイプの登録で識別されなければなりません。"
    },
    {
      "indent": 3,
      "text": "The security considerations section of all registrations is subject to continuing evaluation and modification, and in particular MAY be extended by use of the \"comments on media types\" mechanism described in Section 5.4 below.",
      "ja": "すべての登録のセキュリティの考慮事項のセクションでは、継続的な評価と修正の対象であり、特に、以下のセクション5.4で説明した機構「メディアタイプのコメント」を使用することによって延長することができます。"
    },
    {
      "indent": 3,
      "text": "Some of the issues that need to be examined and described in a security analysis of a media type are:",
      "ja": "メディアタイプのセキュリティ分析で検討し、説明する必要がある問題のいくつかは以下のとおりです。"
    },
    {
      "indent": 3,
      "text": "o Complex media types may include provisions for directives that institute actions on a recipient's files or other resources. In many cases, provision is made for originators to specify arbitrary actions in an unrestricted fashion that may then have devastating effects. See the registration of the application/postscript media type in [RFC2046] for an example of such directives and how they can be described in a media type registration.",
      "ja": "O複雑なメディアタイプは、受信者のファイルや他のリソースに対するアクションを提起ディレクティブの規定を含んでいてもよいです。多くの場合、引当金は、壊滅的な影響を与えることが無制限の方法で任意のアクションを指定するにはオリジネーターのために作られています。そのような指示の例およびそれらがどのようにメディアタイプ登録に記述することができるために[RFC2046]でアプリケーション/追記メディアタイプの登録を参照してください。"
    },
    {
      "indent": 3,
      "text": "o Any security analysis MUST state whether or not they employ such \"active content\"; if they do, they MUST state what steps have been taken, or MUST be taken by applications of the media type, to protect users of the media type from harm.",
      "ja": "O任意のセキュリティ分析は、彼らがそのような「アクティブコンテンツ」を採用するかどうかを述べなければなりません。彼らがしなければ、彼らが撮影されている、または危害からメディアタイプのユーザーを保護するために、メディアタイプのアプリケーションによって行われなければなりませんどのような手順述べなければなりません。"
    },
    {
      "indent": 3,
      "text": "o Complex media types may include provisions for directives that institute actions that, while not directly harmful to the recipient, may result in disclosure of information that either facilitates a subsequent attack or else violates a recipient's privacy in some way. Again, the registration of the application/ postscript media type illustrates how such directives can be handled.",
      "ja": "O複雑なメディアタイプは、受信者に直接有害ではないが、いずれかのその後の攻撃を容易にしたり、他の何らかの方法で、受信者のプライバシーを侵害する情報の開示をもたらすことができる、というアクションを提起ディレクティブの規定を含んでいてもよいです。再度、アプリケーション/追記メディアタイプの登録は、そのような指示を扱うことができる方法を示す図です。"
    },
    {
      "indent": 3,
      "text": "o A media type that employs compression may provide an opportunity for sending a small amount of data that, when received and evaluated, expands enormously to consume all of the recipient's resources. All media types SHOULD state whether or not they employ compression; if they do, they SHOULD discuss what steps need to be taken to avoid such attacks.",
      "ja": "受信されたと評価されたとき、受信者のすべてのリソースを消費する非常に膨張し、少量のデータを送信するための機会を提供することができる圧縮を用いたメディアタイプをO。すべてのメディアタイプは、彼らが圧縮を採用するかどうかを必ず明記してください。彼らがしなければ、彼らはこのような攻撃を避けるように注意する必要がどのような手順について議論すべきです。"
    },
    {
      "indent": 3,
      "text": "o A media type might be targeted for applications that require some sort of security assurance but don't provide the necessary security mechanisms themselves. For example, a media type could be defined for storage of sensitive medical information that in turn requires external confidentiality and integrity protection services, or which is designed for use only within a secure environment. Types SHOULD always document whether or not they need such services in their security considerations.",
      "ja": "Oメディアタイプは、セキュリティ保証のいくつかの並べ替えを必要とするアプリケーションを対象とされる可能性がありますが、必要なセキュリティ・メカニズム自体を提供していません。例えば、メディアタイプが順番に外部の機密性と完全性保護サービスを必要とする、または唯一のセキュアな環境で使用するために設計されていることに敏感な医療情報の保存のために定義することができます。タイプは、常に彼らはセキュリティ上の配慮で、このようなサービスを必要とするかどうかをドキュメント化する必要があります。"
    },
    {
      "indent": 0,
      "text": "4.7. Requirements Specific to XML Media Types",
      "section_title": true,
      "ja": "4.7。 XMLのメディアタイプに固有の要件"
    },
    {
      "indent": 3,
      "text": "There are a number of additional requirements specific to the registration of XML media types. These requirements are specified in [RFC3023].",
      "ja": "XMLのメディアタイプの登録に特有の追加要件がいくつかあります。これらの要件は[RFC3023]で指定されています。"
    },
    {
      "indent": 0,
      "text": "4.8. Encoding Requirements",
      "section_title": true,
      "ja": "4.8。エンコーディングに関する要件"
    },
    {
      "indent": 3,
      "text": "Some transports impose restrictions on the type of data they can carry. For example, Internet mail traditionally was limited to 7bit US-ASCII text. Encoding schemes are often used to work around such transport limitations.",
      "ja": "いくつかのトランスポートは、彼らが運ぶことができるデータの種類に制限を課します。たとえば、インターネットメールは、伝統的にUS-ASCIIテキストを7ビットに制限されていました。符号化方式は、多くの場合、輸送制限を回避するために使用されています。"
    },
    {
      "indent": 3,
      "text": "It is therefore useful to note what sort of data a media type can consist of as part of its registration. An \"encoding considerations\" field is provided for this purpose. Possible values of this field are:",
      "ja": "メディアタイプがその登録の一部として構成することができ、データの種類を注意することは有用です。 「エンコーディングの考慮事項」の欄は、この目的のために提供されます。このフィールドの可能な値は以下のとおりです。"
    },
    {
      "indent": 3,
      "text": "7bit: The content of the media type consists solely of CRLF-delimited 7bit US-ASCII text.",
      "ja": "7ビット：メディアタイプのコンテンツは、単にCRLFで区切られた7ビットUS-ASCIIテキストで構成されています。"
    },
    {
      "indent": 3,
      "text": "8bit: The content of the media type consists solely of CRLF-delimited 8bit text.",
      "ja": "8ビット：メディアタイプのコンテンツは、単にCRLFで区切られた8ビットのテキストで構成されています。"
    },
    {
      "indent": 3,
      "text": "binary: The content consists of an unrestricted sequence of octets.",
      "ja": "バイナリ：内容はオクテットの無制限の配列からなります。"
    },
    {
      "indent": 3,
      "text": "framed: The content consists of a series of frames or packets without internal framing or alignment indicators. Additional out-of-band information is needed to interpret the data properly, including but not necessarily limited to knowledge of the boundaries between successive frames and knowledge of the transport mechanism. Note that media types of this sort cannot simply be stored in a file or transported as a simple stream of octets; therefore, such media types are unsuitable for use in many traditional protocols. A commonly used transport with framed encoding is the Real-time Transport Protocol, RTP. Additional rules for framed encodings defined for transport using RTP are given in [RFC4855].",
      "ja": "フレーム：コンテンツが内部フレーミングまたは整列インジケータなしにフレーム又は一連のパケットから成ります。追加のアウトオブバンド情報は、適切にデータを解釈するために必要なを含むが、必ずしも連続したフレームと輸送機構の知識間の境界の知識に限定されるものではありません。この種のメディアタイプは、単にファイルに保存されているか、オクテットの簡単な流れとして輸送することができないことに注意してください。したがって、このようなメディアタイプは、多くの伝統的なプロトコルでの使用には適していません。額入りのエンコーディングで一般的に使用されるトランスポートは、リアルタイムトランスポートプロトコル、RTPです。 RTPを使用して輸送するための定義されたフレームのエンコーディングのための追加の規則は、[RFC4855]に記載されています。"
    },
    {
      "indent": 3,
      "text": "Additional restrictions on 7bit and 8bit text are given in Section 4.1.1 of [RFC2046].",
      "ja": "7ビットおよび8ビットのテキストの追加の制限は、[RFC 2046]のセクション4.1.1に記載されています。"
    },
    {
      "indent": 0,
      "text": "4.9. Usage and Implementation Non-Requirements",
      "section_title": true,
      "ja": "4.9。使用法と実装非要件"
    },
    {
      "indent": 3,
      "text": "In the asynchronous mail environment, where information on the capabilities of the remote mail agent is frequently not available to the sender, maximum interoperability is attained by restricting the media types used to those \"common\" formats expected to be widely implemented. This was asserted in the past as a reason to limit the number of possible media types, and resulted in a registration process with a significant hurdle and delay for those registering media types.",
      "ja": "リモートメールエージェントの能力に関する情報を頻繁に送信者に利用できない非同期メール環境では、最大の相互運用性を広く実装することが予想される「共通」フォーマットに使用されるメディアの種類を制限することによって達成されます。これは、可能なメディアタイプの数を制限する理由として、過去にアサートされ、それらの登録メディアタイプのための重要なハードルと遅延の登録処理が生じました。"
    },
    {
      "indent": 3,
      "text": "However, the need for \"common\" media types does not require limiting the registration of new media types. If a limited set of media types is recommended for a particular application, that should be asserted by a separate applicability statement specific for the application and/or environment.",
      "ja": "しかし、「一般的な」メディアタイプの必要性は、新たなメディアタイプの登録を制限する必要はありません。メディアタイプの限られたセットは、特定のアプリケーションのために推奨されている場合、それはアプリケーションおよび/または環境のための具体的な個別の適用性声明によって表明されなければなりません。"
    },
    {
      "indent": 3,
      "text": "Therefore, universal support and implementation of a media type are NOT a requirement for registration. However, if a media type is explicitly intended for limited use, this MUST be noted in its registration. The \"Restrictions on Usage\" field is provided for this purpose.",
      "ja": "そのため、ユニバーサルサポートとメディアタイプの実装では、登録のための要件ではありません。メディアタイプが明示的に限られた使用のために意図されている場合しかし、これは、その登録に留意しなければなりません。 「使用上の制限」フィールドは、この目的のために提供されます。"
    },
    {
      "indent": 0,
      "text": "4.10. Publication Requirements",
      "section_title": true,
      "ja": "4.10。出版の要件"
    },
    {
      "indent": 3,
      "text": "Media types registered in the standards tree by the IETF itself MUST be published as RFCs. RFC publication of vendor and personal media type registrations is allowed but not required. In all cases, the IANA will retain copies of all media type registrations and \"publish\" them as part of the media types registration tree itself.",
      "ja": "IETF自身で規格木に登録されたメディアタイプは、RFCとして公開する必要があります。ベンダーとパーソナルメディアタイプ登録のRFC公表は許可が、必須ではありません。すべての場合において、IANAは、すべてのメディアタイプ登録のコピーを保持し、メディアタイプ登録木自体の一部としてそれらを「公開します」。"
    },
    {
      "indent": 3,
      "text": "As stated previously, standards-tree registrations for media types defined in documents produced by other standards-related organizations MUST be described by a formal standards specification produced by that organization. Additionally, any copyright on the registration template MUST allow the IANA to copy it into the IANA registry.",
      "ja": "先に述べたように、他の標準関連団体によって作成されたドキュメントで定義されたメディアタイプの標準木の登録は、その組織によって生成正式な標準仕様で記述されなければなりません。また、登録テンプレート上の任意の著作権はIANAがIANAレジストリにコピーすることができなければなりません。"
    },
    {
      "indent": 3,
      "text": "Other than IETF registrations in the standards tree, the registration of a media type does not imply endorsement, approval, or recommendation by the IANA or the IETF or even certification that the specification is adequate. To become an IETF standard, a protocol or data object must go through the IETF standards process. While it provides additional assurances when it is appropriate, this is too difficult and too lengthy a process for the convenient registration of media types.",
      "ja": "規格木でIETFの登録以外に、メディアタイプの登録は、IANAまたはIETFや仕様が適切であることも、認証による承認、承認、または推奨を意味するものではありません。 IETF標準になるためには、プロトコルやデータオブジェクトは、IETF標準化プロセスを経なければなりません。それが適切な場合には、追加の保証を提供していますが、これはメディアタイプの便利な登録のためにあまりにも難しい、あまりにも長いプロセスです。"
    },
    {
      "indent": 3,
      "text": "The standards tree exists for media types that do require a substantive review and approval process in a recognized standards-related organization. The vendor and personal trees exist for those media types that do not require such a process. It is expected that applicability statements for particular applications will be published from time to time in the IETF, recommending implementation of, and support for, media types that have proven particularly useful in those contexts.",
      "ja": "規格木が認められた標準に関連した組織の実質的な審査と承認プロセスを必要としないメディアタイプのために存在します。ベンダーとの個人的な木は、このようなプロセスを必要としないメディアタイプのために存在します。特定のアプリケーションのための適用性の文は、それらの文脈で特に有用であることが証明されているメディアタイプ、のための実装、およびサポートを推薦、時間からIETFの時間に公開されることが期待されます。"
    },
    {
      "indent": 3,
      "text": "As discussed above, registration of a top-level type requires Standards Action in the IETF and, hence, the publication of a RFC on the Standards Track.",
      "ja": "上述したように、トップレベルタイプの登録は、したがって、標準化過程にRFCの出版物をIETFで標準化行動を必要とします。"
    },
    {
      "indent": 0,
      "text": "4.11. Fragment Identifier Requirements",
      "section_title": true,
      "ja": "4.11。フラグメント識別子の要件"
    },
    {
      "indent": 3,
      "text": "Media type registrations can specify how applications should interpret fragment identifiers (specified in Section 3.5 of [RFC3986]) associated with the media type.",
      "ja": "メディアタイプの登録は、アプリケーションがメディアタイプに関連付けられている（[RFC3986]の3.5節で指定された）フラグメント識別子を解釈する方法を指定することができます。"
    },
    {
      "indent": 3,
      "text": "Media types are encouraged to adopt fragment identifier schemes that are used with semantically similar media types. In particular, media types that use a named structured syntax with a registered \"+suffix\" MUST follow whatever fragment identifier rules are given in the structured syntax suffix registration.",
      "ja": "メディアタイプは、意味的に類似したメディアタイプで使用されているフラグメント識別子スキームを採用することを奨励されています。具体的には、登録された「+接尾辞」と名付けられ、構造構文を使用したメディアの種類は、識別子のルールが構造化された構文サフィックス登録に与えられているものは何でもフラグメントに従わなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.12. Additional Information",
      "section_title": true,
      "ja": "4.12。追加情報"
    },
    {
      "indent": 3,
      "text": "Various sorts of optional information SHOULD be included in the specification of a media type if it is available:",
      "ja": "それが利用可能である場合、オプションの各種の情報は、メディアタイプの仕様に含まれるべきです。"
    },
    {
      "indent": 3,
      "text": "o Magic number(s) (length, octet values). Magic numbers are byte sequences that are always present at a given place in the file and thus can be used to identify entities as being of a given media type.",
      "ja": "Oマジックナンバー（S）（長さ、オクテット値）。魔法の数字は常にファイル内の指定された場所に存在しているため、特定のメディアタイプのものとしてエンティティを識別するために使用することができ、バイト配列です。"
    },
    {
      "indent": 3,
      "text": "o File name extension(s) commonly used on one or more platforms to indicate that some file contains a given media type.",
      "ja": "一般的に、いくつかのファイルが指定されたメディアタイプが含まれていることを示すために、1つ以上のプラットフォームで使用Oファイル名の拡張子（複数可）。"
    },
    {
      "indent": 3,
      "text": "o Mac OS File Type code(s) (4 octets) used to label files containing a given media type. Some discussion of Macintosh file type codes and their purpose can be found in [MacOSFileTypes].",
      "ja": "特定のメディアタイプを含むファイルにラベルを付けるために使用されるO Mac OSのファイルタイプコード（S）（4つのオクテット）。 Macintoshファイルタイプコードとその目的のいくつかの議論は[MacOSFileTypes]で見つけることができます。"
    },
    {
      "indent": 3,
      "text": "In the case of a registration in the standards tree, this additional information MAY be provided in the formal specification of the media type format. It is suggested that this be done by incorporating the IANA media type registration form into the format specification itself.",
      "ja": "規格木の登録の場合には、この追加情報は、メディアタイプのフォーマットの正式な仕様で提供されてもよいです。形式仕様自体にIANAメディアタイプ登録フォームを組み込むことによって行われることが示唆されています。"
    },
    {
      "indent": 0,
      "text": "5. Media Type Registration Procedures",
      "section_title": true,
      "ja": "5.メディアタイプの登録手順"
    },
    {
      "indent": 3,
      "text": "The media type registration procedure is not a formal standards process, but rather an administrative procedure intended to allow community comment and sanity checking without excessive time delay.",
      "ja": "メディアタイプ登録手続きは、正式な標準化プロセスではなく、行政手続は、コミュニティのコメントと正気が過度の時間遅れなしにチェックできるようにするためのもの。"
    },
    {
      "indent": 3,
      "text": "Normal IETF processes need to be followed for all IETF registrations in the standards tree. The posting of an Internet Draft is a necessary first step, followed by posting to the media-types@iana.org list as discussed below.",
      "ja": "通常のIETFのプロセスが標準化ツリー内のすべてのIETF登録に続いする必要があります。インターネットドラフトの転記は、後述するようにmedia-types@iana.orgリストに掲載することにより、その後必要に応じて最初のステップです。"
    },
    {
      "indent": 0,
      "text": "5.1. Preliminary Community Review",
      "section_title": true,
      "ja": "5.1。予備コミュニティレビュー"
    },
    {
      "indent": 3,
      "text": "Notice of a potential media type registration in the standards tree SHOULD be sent to the media-types@iana.org mailing list for review. This mailing list has been established for the purpose of reviewing proposed media and access types. Registrations in other trees MAY be sent to the list for review as well; doing so is entirely OPTIONAL, but is strongly encouraged.",
      "ja": "規格木の潜在的なメディアタイプ登録のお知らせは、レビューのためmedia-types@iana.orgメーリングリストに送ってください。このメーリングリストは、提案されたメディアおよびアクセスタイプを検討する目的で設立されました。他の木での登録は、同様にレビューのためにリストに送ってもよいです。そうすることは完全に任意ですが、強く推奨されます。"
    },
    {
      "indent": 3,
      "text": "The intent of the public posting to this list is to solicit comments and feedback on the choice of type/subtype name, the unambiguity of the references with respect to versions and external profiling information, and a review of any interoperability or security considerations. The submitter may submit a revised registration proposal or abandon the registration completely and at any time.",
      "ja": "このリストへの公共の投稿の意図は、タイプ/サブタイプ名の選択、バージョンに関して、外部のプロファイリング情報を参照の曖昧、および任意の相互運用性やセキュリティの考慮のレビューにコメントやフィードバックを求めることです。提出者は、改訂された登録提案を提出するか、完全に、いつでも登録を放棄することができます。"
    },
    {
      "indent": 0,
      "text": "5.2. Submit Request to IANA",
      "section_title": true,
      "ja": "5.2。 IANAへのリクエストを送信"
    },
    {
      "indent": 3,
      "text": "Media types registered in the standards tree by the IETF itself MUST be reviewed and approved by the IESG as part of the normal standards process. Standards-tree registrations by recognized standards-related organizations as well as registrations in the vendor and personal trees are submitted directly to the IANA, unless other arrangements were made as part of a liaison agreement. In either case, posting the registration to the media-types@iana.org list for review prior to submission is strongly encouraged.",
      "ja": "IETF自身で規格木に登録されたメディアの種類は、通常の標準化プロセスの一環として検討し、IESGによって承認されなければなりません。他の構成は、リエゾン契約の一環として行われた場合を除き標準木認められた標準関連団体の登録だけでなく、ベンダーでの登録や個人的な木は、IANAに直接提出されます。いずれの場合も、提出前にレビューのためにmedia-types@iana.orgリストへの登録を掲示することを強く推奨されています。"
    },
    {
      "indent": 3,
      "text": "Registration requests can be sent to iana@iana.org. A web form for registration requests is also available:",
      "ja": "登録要求がiana@iana.orgに送信することができます。登録要求のためのWebフォームも利用可能です："
    },
    {
      "indent": 5,
      "text": "http://www.iana.org/form/media-types",
      "ja": "ｈっｔｐ：／／ｗっｗ。いあな。おｒｇ／ふぉｒｍ／めぢあーｔｙぺｓ"
    },
    {
      "indent": 0,
      "text": "5.2.1. Provisional Registrations",
      "section_title": true,
      "ja": "5.2.1。暫定登録"
    },
    {
      "indent": 3,
      "text": "Standardization processes often take considerable time to complete. In order to facilitate prototyping and testing, it is often helpful to assign identifiers, including but not limited to media types, early in the process. This way, identifiers used during standards development can remain unchanged once the process is complete, and implementations and documentation do not have to be updated.",
      "ja": "標準化のプロセスは、多くの場合、完了するまでにかなりの時間がかかります。試作とテストを容易にするために、含むが、プロセスの早い段階で、メディアの種類に限定されるものではなく、識別子を割り当てることがしばしば有用です。プロセスが完了すると、この方法では、規格開発の際に使用される識別子は変更されないままでき、実装およびドキュメントを更新する必要はありません。"
    },
    {
      "indent": 3,
      "text": "Accordingly, a provisional registration process is provided to support early assignment of media type names in the standards tree. A provisional registration MAY be submitted to IANA for standards-tree types. The only required fields in such registrations are the media type name and contact information (including the standards-related organization name).",
      "ja": "したがって、仮登録プロセスは規格木におけるメディアタイプ名の初期の割り当てをサポートするために提供されます。仮登録は、標準木のタイプについてIANAに提出することができます。そのような登録で唯一の必須フィールドはメディアタイプの名前と（規格関連の組織名を含む）の連絡先情報です。"
    },
    {
      "indent": 3,
      "text": "Upon receipt of a provisional registration, IANA will check the name and contact information, then publish the registration in a distinct publicly visible provisional registration list.",
      "ja": "仮登録を受信すると、IANAは、次いで、名前と連絡先情報をチェックする別個公開さ仮登録リストに登録を公開します。"
    },
    {
      "indent": 3,
      "text": "Provisional registrations MAY be updated or abandoned at any time. When the registration is abandoned, the media type is no longer registered in any sense; it can subsequently be registered just like any other unassigned media type name.",
      "ja": "暫定登録は随時更新または放棄されるかもしれません。登録が放棄された場合、メディアタイプは、もはやいかなる意味においても登録されていません。それは、その後も他の割り当てられていないメディアタイプの名前のように登録することができます。"
    },
    {
      "indent": 0,
      "text": "5.3. Review and Approval",
      "section_title": true,
      "ja": "5.3。レビューと承認"
    },
    {
      "indent": 3,
      "text": "With the exception of provisional standards-tree registrations, registrations submitted to the IANA will be passed on to the media types reviewer. The media types reviewer, who is appointed by the IETF Applications Area Director(s), will review the registration to make sure it meets the requirements set forth in this document. Registrations that do not meet these requirements will be returned to the submitter for revision.",
      "ja": "暫定基準ツリー登録の例外を除いて、IANAに提出登録はメディアタイプ投稿者に渡されます。 IETFアプリケーションエリアディレクター（S）によって任命されたメディアタイプ投稿者は、それがこの文書に記載された要件を満たしていることを確認するために登録を検討します。これらの要件を満たしていない登録が改正のための提出者に返却されます。"
    },
    {
      "indent": 3,
      "text": "Decisions made by the media types reviewer may be appealed to the IESG using the procedure specified in Section 6.5.4 of [RFC2026].",
      "ja": "メディアタイプ投稿者によって行われた決定は、[RFC2026]のセクション6.5.4で指定された手順を使用して、IESGにアピールすることができます。"
    },
    {
      "indent": 3,
      "text": "Once a media type registration has passed review, the IANA will register the media type and make the media type registration available to the community.",
      "ja": "メディアタイプの登録は審査を通過した後は、IANAはメディアタイプを登録し、地域社会へのメディアタイプの登録が利用できるようになります。"
    },
    {
      "indent": 3,
      "text": "In the case of standards-tree registrations from other standards-related organizations, IANA will also check that the submitter is in fact a recognized standards-related organization. If the submitter is not currently recognized as such, the IESG will be asked to confirm their status. Recognition from the IESG MUST be obtained before a standards-tree registration can proceed.",
      "ja": "他の規格関連団体からの標準ツリー登録の場合には、IANAはまた、提出者が実際に認められた基準に関連した組織であることを確認します。提出者は、現在のような認識されない場合は、IESGは、その状態を確認するように求められます。標準木の登録を進める前にIESGからの認識が得られなければなりません。"
    },
    {
      "indent": 0,
      "text": "5.4. Comments on Media Type Registrations",
      "section_title": true,
      "ja": "5.4。メディアタイプ登録のコメント"
    },
    {
      "indent": 3,
      "text": "Comments on registered media types may be submitted by members of the community to the IANA at iana@iana.org. These comments will be reviewed by the media types reviewer and then passed on to the \"owner\" of the media type if possible. Submitters of comments may request that their comment be attached to the media type registration itself; if the IANA, in consultation with the media types reviewer, approves, the comment will be made accessible in conjunction with the type registration.",
      "ja": "登録されたメディアタイプのコメントはiana@iana.orgでIANAにコミュニティのメンバーによって提出することができます。これらのコメントは、レビューアメディアタイプによって審査した後、可能な場合はメディアタイプの「所有者」に渡されます。コメントの提出者は、彼らのコメントがメディアタイプ登録自体に添付することを要求することができます。 IANAは、メディアタイプ投稿者と協議の上、承認した場合、コメントはタイプ登録と併せてアクセスできるようになります。"
    },
    {
      "indent": 0,
      "text": "5.5. Change Procedures",
      "section_title": true,
      "ja": "5.5。変更手続き"
    },
    {
      "indent": 3,
      "text": "Once a media type has been published by the IANA, the owner may request a change to its definition. The descriptions of the different registration trees above designate the \"owners\" of each type of registration. The same procedure that would be appropriate for the original registration request is used to process a change request.",
      "ja": "メディアタイプがIANAによって公表された後、所有者はその定義への変更を要求することができます。異なる登録木の記述は、上記の登録の各タイプの「所有者」を指定します。オリジナルの登録要求のために適切であるのと同じ手順が変更要求を処理するために使用されます。"
    },
    {
      "indent": 3,
      "text": "Media type registrations may not be deleted; media types that are no longer believed appropriate for use can be declared OBSOLETE by a change to their \"intended use\" field; such media types will be clearly marked in the lists published by the IANA.",
      "ja": "メディアタイプの登録が削除されないことがあります。もはや使用するのに適したと考えられているメディアの種類は、彼らの「意図する使用」フィールドに変更することによりOBSOLETEと宣言することができます。そのような媒体の種類は明らかにIANAによって公表リストにマークされます。"
    },
    {
      "indent": 3,
      "text": "Significant changes to a media type's definition should be requested only when there are serious omissions or errors in the published specification. When review is required, a change request may be denied if it renders entities that were valid under the previous definition invalid under the new definition.",
      "ja": "メディアタイプの定義に重要な変更が公開された仕様に重大な欠落や誤りがある場合にのみ、要求されるべき。見直しが必要とされる場合、それは新しい定義の下で前の定義の下で無効有効であったエンティティをレンダリングする場合は、変更要求が拒否されることがあります。"
    },
    {
      "indent": 3,
      "text": "The owner of a media type may pass responsibility to another person or agency by informing the IANA; this can be done without discussion or review.",
      "ja": "メディアタイプの所有者は、IANAに通知することにより、他の人や機関に責任を渡すこと。これは、議論や検討せずに行うことができます。"
    },
    {
      "indent": 3,
      "text": "The IESG may reassign responsibility for a media type. The most common case of this will be to enable changes to be made to types where the author of the registration has died, moved out of contact, or is otherwise unable to make changes that are important to the community.",
      "ja": "IESGはメディアタイプの責任を再割り当てすることができます。この最も一般的な場合は、登録の作者が死亡したタイプに行われる変更を可能にすることであろう、接触の外に移動、またはコミュニティへの重要な変更を行うことがそれ以外の場合はできません。"
    },
    {
      "indent": 0,
      "text": "5.6. Registration Template",
      "section_title": true,
      "ja": "5.6。登録テンプレート"
    },
    {
      "indent": 3,
      "text": "Type name:",
      "ja": "名前を入力します。"
    },
    {
      "indent": 3,
      "text": "Subtype name:",
      "ja": "サブタイプ名："
    },
    {
      "indent": 3,
      "text": "Required parameters:",
      "ja": "必須パラメータ："
    },
    {
      "indent": 3,
      "text": "Optional parameters:",
      "ja": "オプションのパラメータ："
    },
    {
      "indent": 3,
      "text": "Encoding considerations:",
      "ja": "エンコードの考慮事項："
    },
    {
      "indent": 3,
      "text": "Security considerations:",
      "ja": "セキュリティの考慮事項："
    },
    {
      "indent": 3,
      "text": "Interoperability considerations:",
      "ja": "相互運用性の考慮事項："
    },
    {
      "indent": 3,
      "text": "Published specification:",
      "ja": "公開された仕様："
    },
    {
      "indent": 3,
      "text": "Applications that use this media type:",
      "ja": "このメディアタイプを使用するアプリケーション："
    },
    {
      "indent": 3,
      "text": "Fragment identifier considerations:",
      "ja": "フラグメント識別子の考慮事項："
    },
    {
      "indent": 3,
      "text": "Additional information:",
      "ja": "追加情報："
    },
    {
      "indent": 5,
      "text": "Deprecated alias names for this type: Magic number(s): File extension(s): Macintosh file type code(s):",
      "ja": "このタイプの非推奨別名：マジックナンバー（S）：ファイルの拡張子（S）：Macintoshのファイルタイプコード（S）："
    },
    {
      "indent": 3,
      "text": "Person & email address to contact for further information:",
      "ja": "詳細のために連絡する人とEメールアドレス："
    },
    {
      "indent": 3,
      "text": "Intended usage:",
      "ja": "意図している用法："
    },
    {
      "indent": 3,
      "text": "(One of COMMON, LIMITED USE, or OBSOLETE.)",
      "ja": "（COMMON、限られた使用、またはOBSOLETEの一つ。）"
    },
    {
      "indent": 3,
      "text": "Restrictions on usage:",
      "ja": "使用に関する制限事項："
    },
    {
      "indent": 3,
      "text": "(Any restrictions on where the media type can be used go here.)",
      "ja": "（メディアタイプが使用できる場所上の任意の制限がここに入ります。）"
    },
    {
      "indent": 3,
      "text": "Author:",
      "ja": "著者："
    },
    {
      "indent": 3,
      "text": "Change controller:",
      "ja": "コントローラを変更します。"
    },
    {
      "indent": 3,
      "text": "Provisional registration? (standards tree only):",
      "ja": "仮登録？ （唯一の規格木）："
    },
    {
      "indent": 3,
      "text": "(Any other information that the author deems interesting may be added below this line.)",
      "ja": "（著者が面白いと判断する任意の他の情報は、この行の下に追加されてもよいです。）"
    },
    {
      "indent": 3,
      "text": "\"N/A\", written exactly that way, can be used in any field if desired to emphasize the fact that it does not apply or that the question was not omitted by accident. Do not use 'none' or other words that could be mistaken for a response.",
      "ja": "それが適用や質問が事故では省略されなかったことないという事実を強調するために、必要に応じて、まさにそのように書かれた「N / A」は、あらゆる分野で使用することができます。 「どれも」や応答のために誤解される可能性があり、他の言葉を使用しないでください。"
    },
    {
      "indent": 3,
      "text": "Limited-use media types should also note in the applications list whether or not that list is exhaustive.",
      "ja": "限定使用のメディアタイプも、そのリストは網羅的であるか否かのアプリケーションのリストに注意してください。"
    },
    {
      "indent": 0,
      "text": "6. Structured Syntax Suffix Registration Procedures",
      "section_title": true,
      "ja": "6.構造化構文サフィックス登録手順"
    },
    {
      "indent": 3,
      "text": "Someone wishing to define a \"+suffix\" name for a structured syntax for use with a new media type registration SHOULD:",
      "ja": "新しいメディアタイプ登録SHOULDで使用するための構造化された構文については、「+接尾辞」の名前を定義したい誰か："
    },
    {
      "indent": 3,
      "text": "1. Check IANA's registry of media type name suffixes to see whether or not there is already an entry for that well-defined structured syntax.",
      "ja": "1.その明確に定義された構造化された構文のエントリが既に存在するか否かを確認するために、メディアタイプ名の接尾辞のIANAのレジストリを確認してください。"
    },
    {
      "indent": 3,
      "text": "2. If there is no entry for their suffix scheme, fill out the template (specified in Section 6.2) and include that with the media type registration. The template may be contained in an Internet Draft, alone or as part of some other protocol specification. The template may also be submitted in some other form (as part of another document or as a stand-alone document), but the contents will be treated as an \"IETF Contribution\" under the guidelines of BCP 78 [RFC5378].",
      "ja": "そのサフィックススキームのエントリがない場合2.は、（セクション6.2で指定された）テンプレートに必要事項を記入し、メディアタイプを登録していることを含んでいます。テンプレートは、単独で、または他のいくつかのプロトコル仕様の一部として、インターネットドラフトに含まれていてもよいです。テンプレートはまた、いくつかの他の形態（別の文書の一部として、またはスタンドアロン文書など）に提出することができるが、内容がBCP 78のガイドラインの下で「IETF貢献」[RFC5378]として扱われます。"
    },
    {
      "indent": 3,
      "text": "3. Send a copy of the template or a pointer to the containing document (with specific reference to the section with the template) to the mailing list media-types@iana.org, requesting review. This may be combined with a request to review the media type registration. Allow a reasonable time for discussion and comments.",
      "ja": "3.審査を要求し、メーリングリストmedia-types@iana.orgに（テンプレートのセクションを具体的に参照して）を含む文書にテンプレートやポインタのコピーを送信します。これは、メディアタイプの登録を確認するための要求と組み合わせることができます。議論とコメントのための合理的な時間を許可します。"
    },
    {
      "indent": 3,
      "text": "4. Respond to review comments and make revisions to the proposed registration as needed to bring it into line with the guidelines given in this document.",
      "ja": "コメントを確認し、この文書で指定されたガイドラインに沿っにそれを持って来るために、必要に応じて提案の登録に改訂を行うため4.応答します。"
    },
    {
      "indent": 3,
      "text": "5. Submit the (possibly updated) registration template (or pointer to the document containing it) to IANA at iana@iana.org.",
      "ja": "5. iana@iana.orgでIANAに（おそらく更新）登録テンプレート（またはそれを含むドキュメントへのポインタ）を提出してください。"
    },
    {
      "indent": 3,
      "text": "Upon receipt of a structured syntax suffix registration request,",
      "ja": "構造化された構文接尾登録要求を受信すると、"
    },
    {
      "indent": 3,
      "text": "1. IANA checks the submission for completeness; if sections are missing or citations are not correct, IANA rejects the registration request.",
      "ja": "1. IANAは、完全性について提出をチェックします。セクションが欠落しているか引用が正しくない場合、IANAは、登録要求を拒否します。"
    },
    {
      "indent": 3,
      "text": "2. IANA checks the current registry for an entry with the same name; if such a registry exists, IANA rejects the registration request.",
      "ja": "2. IANAは、同じ名前を持つエントリの現在のレジストリをチェックします。このようレジストリが存在する場合は、IANAは、登録要求を拒否します。"
    },
    {
      "indent": 3,
      "text": "3. IANA requests Expert Review of the registration request against the corresponding guidelines.",
      "ja": "3. IANAは、対応するガイドラインに対する登録要求のエキスパートレビューを依頼します。"
    },
    {
      "indent": 3,
      "text": "4. The Designated Expert may request additional review or discussion, as necessary.",
      "ja": "4.指定Expertは、必要に応じて、追加的なレビューや議論を要求することができます。"
    },
    {
      "indent": 3,
      "text": "5. If Expert Review recommends registration, IANA adds the registration to the appropriate registry.",
      "ja": "5.エキスパートレビューが登録を推奨していた場合は、IANAは、適切なレジストリへの登録を追加します。"
    },
    {
      "indent": 3,
      "text": "The initial registry content specification [RFC6839] provides examples of structured syntax suffix registrations.",
      "ja": "初期レジストリコンテンツの仕様[RFC6839]は構造化された構文サフィックス登録の例を示します。"
    },
    {
      "indent": 0,
      "text": "6.1. Change Procedures",
      "section_title": true,
      "ja": "6.1。変更手続き"
    },
    {
      "indent": 3,
      "text": "Registrations may be updated in each registry by the same mechanism as required for an initial registration. In cases where the original definition of the scheme is contained in an IESG-approved document, update of the specification also requires IESG approval.",
      "ja": "初期登録のために必要に応じて登録は同じ機構によって各レジストリに更新されてもよいです。スキームの元の定義は、IESGが承認した文書に含まれている場合には、仕様書の更新も、IESGの承認を必要とします。"
    },
    {
      "indent": 0,
      "text": "6.2. Structured Syntax Suffix Registration Template",
      "section_title": true,
      "ja": "6.2。構造化構文サフィックス登録テンプレート"
    },
    {
      "indent": 3,
      "text": "This template describes the fields that must be supplied in a structured syntax suffix registration request:",
      "ja": "このテンプレートは、構造化された構文サフィックス登録要求に供給されなければならないフィールドについて説明します。"
    },
    {
      "indent": 3,
      "text": "Name Full name of the well-defined structured syntax.",
      "ja": "明確に定義された構造化された構文の完全な名前です。"
    },
    {
      "indent": 3,
      "text": "+suffix Suffix used to indicate conformance to the syntax.",
      "ja": "+接尾辞接尾辞構文への適合性を示すために使用されます。"
    },
    {
      "indent": 3,
      "text": "References Include full citations for all specifications necessary to understand the structured syntax.",
      "ja": "参考文献は、構造化された構文を理解するために必要なすべての仕様の完全な引用を含めます。"
    },
    {
      "indent": 3,
      "text": "Encoding considerations General guidance regarding encoding considerations for any type employing this syntax should be given here. The same requirements for media type encoding considerations given in Section 4.8 apply here.",
      "ja": "この構文を使用するあらゆるタイプのエンコードの考慮事項に関するエンコーディングの考慮事項一般的な指針はここに与えられるべきです。 4.8節で与えられたメディアタイプのエンコードの考慮事項については、同じ要件が適用されます。"
    },
    {
      "indent": 3,
      "text": "Interoperability considerations Any issues regarding the interoperable use of types employing this structured syntax should be given here. Examples would include the existence of incompatible versions of the syntax, issues combining certain charsets with the syntax, or incompatibilities with other types or protocols.",
      "ja": "この構造化された構文を使用するタイプの相互運用性の使用に関する相互運用性の考慮事項すべての問題は、ここに与えられるべきです。例としては、他のタイプまたはプロトコルと互換性の構文のバージョン、構文で特定の文字セットを組み合わせる問題、または非互換性の有無を含むであろう。"
    },
    {
      "indent": 3,
      "text": "Fragment identifier considerations Generic processing of fragment identifiers for any type employing this syntax should be described here.",
      "ja": "フラグメント識別子の考慮事項は、この構文を使用する任意のタイプのフラグメント識別子の一般的な処理は、ここで説明しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Security considerations Security considerations shared by media types employing this structured syntax must be specified here. The same requirements for media type security considerations given in Section 4.6 apply here, with the exception that the option of not assessing the security considerations is not available for suffix registrations.",
      "ja": "この構造化された構文を使用するメディアタイプによって共有セキュリティに関する注意事項セキュリティに関する注意事項は、ここで指定する必要があります。セクション4.6で与えられたメディアタイプのセキュリティの考慮事項について同じ要件は、セキュリティ上の配慮を評価しないオプションは、接尾辞の登録のために利用できないことを除いて、ここで適用されます。"
    },
    {
      "indent": 3,
      "text": "Contact Person (including contact information) to contact for further information.",
      "ja": "（連絡先情報を含む）担当者は詳細のために連絡します。"
    },
    {
      "indent": 3,
      "text": "Author/Change controller. Person (including contact information) authorized to change this suffix registration.",
      "ja": "著者/コントローラを変更します。 （連絡先情報を含む）の人は、このサフィックスの登録を変更する権限。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "ja": "7.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "Security requirements for both media type and media type suffix registrations are discussed in Section 4.6.",
      "ja": "両方のメディアタイプとメディアタイプの接尾辞の登録のためのセキュリティ要件は、4.6節で議論されています。"
    },
    {
      "indent": 0,
      "text": "8. IANA Considerations",
      "section_title": true,
      "ja": "8. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "The purpose of this document is to define IANA registries for media types and structured syntax suffixes as well as the procedures for managing these registries. Additionally, this document requires IANA to maintain a list of standards-related organizations for which the IESG has approved media type registrations in the standards tree.",
      "ja": "このドキュメントの目的は、メディアの種類と構造化された構文サフィックスならびにこれらのレジストリを管理するための手順については、IANAレジストリを定義することです。また、この文書は、IESGが規格木にメディアタイプの登録を承認しているために標準化関連団体のリストを維持するために、IANAが必要です。"
    },
    {
      "indent": 3,
      "text": "The existing media type registry has been extended to include a section for provisional registrations. Only standards-tree registrations are allowed in the standards tree and only at the request of an organization on the IANA list of standards-related organizations. See Section 5.2.1 for additional information on provisional registrations.",
      "ja": "既存のメディアタイプレジストリは、仮登録のセクションを含むように拡張されました。唯一の標準木の登録は規格木にのみ標準化関連団体のIANAリスト上の組織の要求に応じて許可されています。暫定登録の追加情報については、5.2.1項を参照してください。"
    },
    {
      "indent": 3,
      "text": "IANA has also added the following note at the top of the provisional registry:",
      "ja": "IANAはまた、暫定レジストリの最上部に次の注意を追加しました："
    },
    {
      "indent": 6,
      "text": "This registry, unlike some other provisional IANA registries, is only for temporary use. Entries in this registry are either finalized and moved to the main media types registry, or are abandoned and deleted. Entries in this registry are suitable for use for development and test purposes only.",
      "ja": "このレジストリは、他のいくつかの暫定IANAレジストリとは異なり、唯一の一時的な使用のためです。このレジストリのエントリはどちらか確定し、メインのメディアタイプレジストリに移動し、または放棄され、削除されています。このレジストリのエントリは、開発およびテストの目的での使用に適しています。"
    },
    {
      "indent": 3,
      "text": "The structured syntax name suffix registry has been created as follows:",
      "ja": "次のように構造化された構文名サフィックスレジストリが作成されています："
    },
    {
      "indent": 3,
      "text": "o The name is the \"Structured Syntax Suffix\" registry.",
      "ja": "O名は「構造化構文サフィックス」レジストリです。"
    },
    {
      "indent": 3,
      "text": "o The registration process is specified in Section 6.",
      "ja": "O登録プロセスはセクション6で指定されています。"
    },
    {
      "indent": 3,
      "text": "o The information required for a registry entry as well as the entry format are specified in Section 6.2.",
      "ja": "Oレジストリエントリ、ならびにエントリ・フォーマットに必要な情報は、セクション6.2で指定されています。"
    },
    {
      "indent": 3,
      "text": "o The initial content of the registry is specified in [RFC6839].",
      "ja": "Oレジストリの初期の内容は[RFC6839]で指定されています。"
    },
    {
      "indent": 3,
      "text": "Entries in both the media type and structured suffix registries will be annotated by IANA with both the original registration date as well as the date of the most recent update to the entry. Registrations made prior to the implementation of this specification may, if necessary, be marked as such, rather than with a specific date.",
      "ja": "メディアの種類と構造化された接尾辞レジストリの両方のエントリは、元の登録日と同様に、エントリに最新の更新の日付の両方でIANAによって注釈されます。前に本明細書の実施になさ登録は、必要であれば、むしろ特定の日付よりも、そのようにマークされてもよいです。"
    },
    {
      "indent": 3,
      "text": "Since registration entries can be updated multiple times, IANA will also maintain the history of changes to each registration in such a way that the state of the registration at any given time can be determined.",
      "ja": "登録エントリが複数回更新することができるので、IANAはまた、任意の時点で登録の状態を決定することができるように、各登録の変更の履歴を維持します。"
    },
    {
      "indent": 3,
      "text": "Finally, per this document, IANA has created a new email address, media-types@iana.org, for the media type review list, which replaces the ietf-types@iana.org address specified in RFC 4288. ietf-types@iana.org has been retained as an alias.",
      "ja": "最後に、この文書ごとに、IANAはIETF-タイプIANA @ RFC 4288.に指定されたietf-types@iana.orgアドレスを置き換えるメディアタイプのレビュー一覧、のための新しい電子メールアドレス、media-types@iana.orgを作成しました.ORGは、別名として保持されています。"
    },
    {
      "indent": 0,
      "text": "9. Acknowledgments",
      "section_title": true,
      "ja": "9.謝辞"
    },
    {
      "indent": 3,
      "text": "The current authors would like to acknowledge their debt to the late Dr. Jon Postel, whose general model of IANA registration procedures and specific contributions shaped the predecessors of this document [RFC2048] [RFC4288]. We hope that the current version is one with which he would have agreed but, as it is impossible to verify that agreement, we have regretfully removed his name as a co-author.",
      "ja": "現在の著者は、その一般的なモデルIANA登録手順と具体的な貢献のこのドキュメント[RFC2048] [RFC4288]の前任者を形作っ故博士ジョン・ポステル、に借金を認めたいと思います。その合意を確認することは不可能であると私たちは、現在のバージョンは、彼が合意したことになると1であることを願っていますが、我々は残念ながら共著者として彼の名前を削除しました。"
    },
    {
      "indent": 3,
      "text": "Randy Bush, Francis Dupont, Bjoern Hoehrmann, Barry Leiba, Murray Kucherawy, Alexey Melnikov, S. Moonesamy, Mark Nottingham, Tom Petch, Peter Saint-Andre, and Jeni Tennison provided many helpful review comments and suggestions.",
      "ja": "ランディブッシュ、フランシスデュポン、ビョルンHoehrmann、バリー・レイバ、マレーKucherawy、アレクセイ・メルニコフ、S. Moonesamy、マーク・ノッティンガム、トム・ペッチ、ピーター・サン・アンドレ、そしてジェニ・テニソンは、多くの有用なレビューコメントや提案を提供しました。"
    },
    {
      "indent": 0,
      "text": "10. References",
      "section_title": true,
      "ja": "10.参考文献"
    },
    {
      "indent": 0,
      "text": "10.1. Normative References",
      "section_title": true,
      "ja": "10.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2045] Freed, N. and N. Borenstein, \"Multipurpose Internet Mail Extensions (MIME) Part One: Format of Internet Message Bodies\", RFC 2045, November 1996.",
      "ja": "[RFC2045]解放され、N.とN. Borenstein、 \"マルチパーパスインターネットメールエクステンション（MIME）第一部：インターネットメッセージ本体のフォーマット\"、RFC 2045、1996年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC2046] Freed, N. and N. Borenstein, \"Multipurpose Internet Mail Extensions (MIME) Part Two: Media Types\", RFC 2046, November 1996.",
      "ja": "[RFC2046]解放され、N.とN. Borenstein、 \"マルチパーパスインターネットメールエクステンション（MIME）パート2：メディアタイプ\"、RFC 2046、1996年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2978] Freed, N. and J. Postel, \"IANA Charset Registration Procedures\", BCP 19, RFC 2978, October 2000.",
      "ja": "[RFC2978]フリード、N.とJ.ポステル、 \"IANA文字セット登録手順\"、BCP 19、RFC 2978、2000年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC3023] Murata, M., St. Laurent, S., and D. Kohn, \"XML Media Types\", RFC 3023, January 2001.",
      "ja": "[RFC3023]村田、M.、サンローラン、S.、およびD.コーン、 \"XMLのメディアタイプ\"、RFC 3023、2001年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC3629] Yergeau, F., \"UTF-8, a transformation format of ISO 10646\", STD 63, RFC 3629, November 2003.",
      "ja": "[RFC3629] Yergeau、F.、 \"UTF-8、ISO 10646の変換フォーマット\"、STD 63、RFC 3629、2003年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC3979] Bradner, S., \"Intellectual Property Rights in IETF Technology\", BCP 79, RFC 3979, March 2005.",
      "ja": "[RFC3979]ブラドナーの、S.、 \"IETF技術の知的財産権\"、BCP 79、RFC 3979、2005年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3986] Berners-Lee, T., Fielding, R., and L. Masinter, \"Uniform Resource Identifier (URI): Generic Syntax\", STD 66, RFC 3986, January 2005.",
      "ja": "[RFC3986]バーナーズ - リー、T.、フィールディング、R.、およびL. Masinter、 \"ユニフォームリソース識別子（URI）：汎用構文\"、STD 66、RFC 3986、2005年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC4855] Casner, S., \"Media Type Registration of RTP Payload Formats\", RFC 4855, February 2007.",
      "ja": "[RFC4855] Casner、S.、RFC 4855、2007年2月 \"RTPペイロード形式のメディアタイプ登録\"。"
    },
    {
      "indent": 3,
      "text": "[RFC5226] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 5226, May 2008.",
      "ja": "[RFC5226] Narten氏、T.とH. Alvestrand、 \"RFCsにIANA問題部に書くためのガイドライン\"、BCP 26、RFC 5226、2008年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC5234] Crocker, D. and P. Overell, \"Augmented BNF for Syntax Specifications: ABNF\", STD 68, RFC 5234, January 2008.",
      "ja": "[RFC5234]クロッカー、D.、およびP. Overell、 \"構文仕様のための増大しているBNF：ABNF\"、STD 68、RFC 5234、2008年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC5378] Bradner, S. and J. Contreras, \"Rights Contributors Provide to the IETF Trust\", BCP 78, RFC 5378, November 2008.",
      "ja": "[RFC5378]ブラドナー、S.およびJ.コントレラス、 \"権利貢献者は、IETFトラストに提供\"、BCP 78、RFC 5378、2008年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC6532] Yang, A., Steele, S., and N. Freed, \"Internationalized Email Headers\", RFC 6532, February 2012.",
      "ja": "[RFC6532]ヤン、A.、スティール、S.、およびN.フリード、 \"国際電子メールヘッダ\"、RFC 6532、2012年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC6657] Melnikov, A. and J. Reschke, \"Update to MIME regarding \"charset\" Parameter Handling in Textual Media Types\", RFC 6657, July 2012.",
      "ja": "[RFC6657]メルニコフ、A.とJ. Reschke、 \"パラメータテキストメディアタイプに処理 \"CHARSET\" に関するMIMEへの更新\"、RFC 6657、2012年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC6839] Hansen, T. and A. Melnikov, \"Additional Media Type Structured Syntax Suffixes\", RFC 6839, January 2013.",
      "ja": "[RFC6839]ハンセン、T.とA.メルニコフ、 \"追加のメディアタイプの構造化構文サフィックス\"、RFC 6839、2013年1月。"
    },
    {
      "indent": 0,
      "text": "10.2. Informative References",
      "section_title": true,
      "ja": "10.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[MacOSFileTypes] Apple Computer, Inc., \"Mac OS: File Type and Creator Codes, and File Formats\", Apple Knowledge Base Article 55381, June 1993, <http://www.info.apple.com/kbnum/n55381>.",
      "ja": "[MacOSFileTypes]アップルコンピュータ社の \"Mac OS：ファイルタイプとクリエータコード、およびファイル形式\"、<http://www.info.apple.com/kbnum/n55381>アップルサポート技術情報55381、1993年6月、 。"
    },
    {
      "indent": 3,
      "text": "[RFC2026] Bradner, S., \"The Internet Standards Process -- Revision 3\", BCP 9, RFC 2026, October 1996.",
      "ja": "[RFC2026]ブラドナーの、S.、 \"インターネット標準化プロセス - リビジョン3\"、BCP 9、RFC 2026、1996年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC2048] Freed, N., Klensin, J., and J. Postel, \"Multipurpose Internet Mail Extensions (MIME) Part Four: Registration Procedures\", BCP 13, RFC 2048, November 1996.",
      "ja": "[RFC2048]解放され、N.、Klensin、J.、およびJ.ポステル、 \"多目的インターネットメール拡張（MIME）第四部：登録手順\"、BCP 13、RFC 2048、1996年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC2231] Freed, N. and K. Moore, \"MIME Parameter Value and Encoded Word Extensions: Character Sets, Languages, and Continuations\", RFC 2231, November 1997.",
      "ja": "[RFC2231]解放され、N.とK.ムーア、 \"MIMEパラメータ値およびエンコードされたWordの機能拡張：文字セット、言語、および継続の\"、RFC 2231、1997年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC2616] Fielding, R., Gettys, J., Mogul, J., Frystyk, H., Masinter, L., Leach, P., and T. Berners-Lee, \"Hypertext Transfer Protocol -- HTTP/1.1\", RFC 2616, June 1999.",
      "ja": "[RFC2616]フィールディング、R.、ゲティス、J.、モーグル、J.、Frystyk、H.、Masinter、L.、リーチ、P.、およびT.バーナーズ - リー、 \"ハイパーテキスト転送プロトコル -  HTTP / 1.1\" 、RFC 2616、1999年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC4288] Freed, N. and J. Klensin, \"Media Type Specifications and Registration Procedures\", BCP 13, RFC 4288, December 2005.",
      "ja": "[RFC4288]解放され、N.とJ. Klensin、 \"メディアタイプの仕様と登録手順\"、BCP 13、RFC 4288、2005年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC5987] Reschke, J., \"Character Set and Language Encoding for Hypertext Transfer Protocol (HTTP) Header Field Parameters\", RFC 5987, August 2010.",
      "ja": "[RFC5987]、RFC 5987、2010年8月Reschke、J.、 \"ハイパーテキスト転送プロトコル（HTTP）ヘッダフィールドパラメータのセットと言語文字エンコード\"。"
    },
    {
      "indent": 3,
      "text": "[RFC6648] Saint-Andre, P., Crocker, D., and M. Nottingham, \"Deprecating the \"X-\" Prefix and Similar Constructs in Application Protocols\", BCP 178, RFC 6648, June 2012.",
      "ja": "[RFC6648]サンアンドレ、P.、クロッカー、D.、およびM.ノッティンガム、X- \"アプリケーションプロトコルでのプレフィックスと同様の構築 \"\" 卑下\"、BCP 178、RFC 6648、2012年6月。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Grandfathered Media Types",
      "ja": "付録A.適用除外メディアタイプ"
    },
    {
      "indent": 3,
      "text": "A number of media types with unfaceted subtype names, registered prior to 1996, would, if registered under the guidelines in this document, be given a faceted name and placed into either the vendor or personal trees. Reregistration of those types to reflect the appropriate trees is encouraged but not required. Ownership and change control principles outlined in this document apply to those types as if they had been registered in the trees described above.",
      "ja": "前1996に登録unfacetedサブタイプ名を持つメディアの種類の数は、この文書のガイドラインの下で登録されている場合、多面的な名前を与えられ、ベンダーや個人的な木のいずれかに配置されることになります。適切な木を反映するために、これらのタイプの再登録が奨励さが、必須ではありません。このドキュメントで概説所有権と変更管理の原則は、彼らは、上述の木に登録されたかのように、これらのタイプに適用されます。"
    },
    {
      "indent": 3,
      "text": "From time to time there may also be cases where a media type with an unfaceted subtype name has been widely deployed without being registered. (Note that this includes subtype names beginning with the \"x-\" prefix.) If possible, such a media type SHOULD be reregistered with a proper faceted subtype name, possibly using a deprecated alias to identify the original name (see Section 4.2.9). However, if this is not possible, the type can, subject to approval by both the media types reviewer and the IESG, be registered in the proper tree with its unfaceted name.",
      "ja": "時々もunfacetedサブタイプ名を持つメディアタイプが広く、登録されずに展開されている場合があります。 （これは「X-」接頭辞で始まるサブタイプ名が含まれていることに注意してください。）可能ならば、そのようなメディアタイプは、適切な多面的なサブタイプの名前で再登録されるべきで、おそらく元の名前を識別するための非推奨別名を使用します（セクション4.2.9を参照してください）。これが不可能な場合は、タイプは、メディアタイプのレビューとIESGの両方の承認を受け、そのunfaceted名前で適切なツリーに登録することができます。"
    },
    {
      "indent": 1,
      "text": "Appendix B. Changes since",
      "ja": "付録B.からの変更点"
    },
    {
      "indent": 3,
      "text": "o Suffixes to indicate the use of a particular structured syntax are now fully specified and a suffix registration process has been defined.",
      "ja": "Oサフィックスは、特定の構造化された構文を使用することを示すために、今、完全に指定されていると接尾辞の登録プロセスが定義されています。"
    },
    {
      "indent": 3,
      "text": "o Registration of widely deployed unregistered unfaceted type names in the vendor or personal trees is now allowed, subject to approval by the media types reviewer and the IESG.",
      "ja": "Oベンダーや個人的な木で広く導入されている未登録のunfacetedタイプ名の登録は今、メディアタイプのレビューとIESGの承認を受け許可されています。"
    },
    {
      "indent": 3,
      "text": "o The standards-tree registration process has been revised to include Expert Review and generalized to address cases like media types in non-IETF stream documents.",
      "ja": "O規格ツリーの登録プロセスは、専門家のレビューを含めるように改訂し、非IETFストリーム文書のメディアタイプのような場合に対処するために一般化されています。"
    },
    {
      "indent": 3,
      "text": "o A field for fragment identifiers has been added to the registration template and brief directions for specifying fragment identifiers have been added.",
      "ja": "Oフラグメント識別子のためのフィールドは、登録テンプレートと追加されたフラグメント識別子を指定するための簡単な方向に追加されました。"
    },
    {
      "indent": 3,
      "text": "o The specification requirements for personal-tree registrations have been changed to be the same as those for the vendor tree. The text has been changed to encourage (but not require) specification availability.",
      "ja": "oを個人的なツリーの登録のための要求仕様は、ベンダーの木のものと同じになるように変更されました。テキストは、仕様の可用性を奨励する（必須ではない）に変更されました。"
    },
    {
      "indent": 3,
      "text": "o The process for defining additional trees has been clarified to state that an IETF Standards Action is required.",
      "ja": "O追加の木を定義するためのプロセスは、IETF標準化行動が必要であると述べていることが明らかにされています。"
    },
    {
      "indent": 3,
      "text": "o Widely deployed types with \"x-\" names can now be registered as an exception in the vendor tree.",
      "ja": "「X-」の名前を持つO広く展開されているタイプは、今、ベンダー・ツリーの例外として登録することができます。"
    },
    {
      "indent": 3,
      "text": "o The requirements on changes to registrations have been loosened so minor changes are easier to make.",
      "ja": "登録への変更の要件はそれほどマイナーな変更を緩めてきたoを作ることが容易です。"
    },
    {
      "indent": 3,
      "text": "o The registration process has been completely restructured so that with the exception of IETF-generated types in the standards tree, all requests are processed by IANA and not the IESG.",
      "ja": "規格木でIETF生成型の例外を除いて、すべての要求はIANAはなくIESGによって処理されるように、登録プロセスが完全に再構築された、O。"
    },
    {
      "indent": 3,
      "text": "o A provisional registration process has been added for early assignment of types in the standards tree.",
      "ja": "O仮登録プロセスが標準化ツリー内のタイプの早期割り当てに追加されました。"
    },
    {
      "indent": 3,
      "text": "o Many editorial changes have been made throughout the document to make the requirements and processes it describes clearer and easier to follow.",
      "ja": "O多くの編集上の変更は、要件を作るために文書全体作られ、それが明確とフォローしやすい説明に処理されています。"
    },
    {
      "indent": 3,
      "text": "o The ability to specify a list of deprecated aliases for a media type has been added.",
      "ja": "Oメディアタイプのために廃止予定のエイリアスのリストを指定する機能が追加されました。"
    },
    {
      "indent": 3,
      "text": "o Types with names beginning with \"x-\" are no longer considered to be members of the unregistered \"x.\" tree. As with any unfaceted type, special procedures have been added to allow registration of such types in an appropriate tree.",
      "ja": "O「X-」で始まる名前を持つタイプはもはや未登録のメンバーであると見なされていません「×」。木。任意unfacetedタイプと同様に、特別な手順は、適切なツリー内のそのようなタイプの登録を可能にするために追加されています。"
    },
    {
      "indent": 3,
      "text": "o Changes to a type registered by a third party may now be made by the designated change controller even if that isn't the vendor or organization that created the type. However, the vendor or organization may elect to assert ownership and change controller over the type at any time.",
      "ja": "O第三者によって登録されたタイプへの変更は、今では種類を作成したベンダーや組織でない場合でも、指定された変更制御装置によって行うことができます。しかし、ベンダーまたは組織が所有権を主張し、いつでもタイプにわたってコントローラを変更することを選択することができます。"
    },
    {
      "indent": 3,
      "text": "o Limited-use media types are now asked to note whether or not the supplied list of applications employing the media type is exhaustive.",
      "ja": "O限定使用のメディアタイプは、現在のメディアタイプを採用したアプリケーションの供給リストは網羅的であるかどうかに注意することが求められます。"
    },
    {
      "indent": 3,
      "text": "o The ABNF for media type names has been further restricted to require that names begin with an alphanumeric character.",
      "ja": "Oメディアタイプ名のABNFは、名前は英数字で始まることを必要とすることがさらに制限されていました。"
    },
    {
      "indent": 3,
      "text": "o Mailing list review is no longer required prior to registration of media types. Additionally, the address associated with the media type review mailing list has been changed to media-types@iana.org.",
      "ja": "Oメーリングリストのレビューは、もはや以前のメディアタイプの登録に必要とされません。また、メディアタイプレビューメーリングリストに関連付けられたアドレスがmedia-types@iana.orgに変更されました。"
    },
    {
      "indent": 3,
      "text": "o  The rules for text/* media types have been updated to reflect the\n   changes specified in [RFC6657].",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Ned Freed Oracle 800 Royal Oaks Monrovia, CA 91016-6347 USA",
      "ja": "ネッドフリードオラクル800のロイヤルオークスモンロビア、カリフォルニア州91016から6347 USA"
    },
    {
      "indent": 3,
      "text": "EMail: ned+ietf@mrochek.com",
      "ja": "メールアドレス：ned+ietf@mrochek.com"
    },
    {
      "indent": 3,
      "text": "John C. Klensin 1770 Massachusetts Ave, #322 Cambridge, MA 02140 USA",
      "ja": "ジョンC. Klensin 1770マサチューセッツアベニュー、＃322ケンブリッジ、MA 02140 USA"
    },
    {
      "indent": 3,
      "text": "EMail: john+ietf@jck.com",
      "ja": "メールアドレス：john+ietf@jck.com"
    },
    {
      "indent": 3,
      "text": "Tony Hansen AT&T Laboratories 200 Laurel Ave. Middletown, NJ 07748 USA",
      "ja": "トニー・ハンセンAT＆T研究所200ローレルアベニュー。ミドルタウン、NJ 07748 USA"
    },
    {
      "indent": 3,
      "text": "EMail: tony+mtsuffix@maillennium.att.com",
      "ja": "メールアドレス：tony+mtsuffix@maillennium.att.com"
    }
  ]
}