{
  "title": {
    "text": "RFC 6065 - Using Authentication, Authorization, and Accounting Services to Dynamically Provision View-Based Access Control Model User-to-Group Mappings",
    "ja": "RFC 6065 - 認証、承認、および会計サービスを使用して、ビューベースのアクセス制御モデルユーザーからグループへのマッピングを動的に提供する"
  },
  "number": 6065,
  "created_at": "2023-01-13 21:17:46.404420+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                        K. Narayan\nRequest for Comments: 6065                           Cisco Systems, Inc.\nCategory: Standards Track                                      D. Nelson\nISSN: 2070-1721                                    Elbrys Networks, Inc.\n                                                         R. Presuhn, Ed.\n                                                           December 2010",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "Using Authentication, Authorization, and Accounting Services to Dynamically Provision View-Based Access Control Model User-to-Group Mappings",
      "ja": "認証、承認、および会計サービスを使用して、ビューベースのアクセス制御モデルユーザーからグループへのマッピングを動的に提供する"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This memo defines a portion of the Management Information Base (MIB) for use with network management protocols. It describes the use of information provided by Authentication, Authorization, and Accounting (AAA) services, such as the Remote Authentication Dial-In User Service (RADIUS), to dynamically update user-to-group mappings in the View-based Access Control Model (VACM).",
      "ja": "このメモは、ネットワーク管理プロトコルで使用するための管理情報ベース（MIB）の一部を定義します。これは、ビューベースのアクセス制御モデルでユーザー間マッピングを動的に更新するために、リモート認証ダイヤルインユーザーサービス（RADIUS）などの認証、承認、および会計（AAA）サービスによって提供される情報の使用について説明しています。（vacm）。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準トラックドキュメントです。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントは、インターネットエンジニアリングタスクフォース（IETF）の製品です。IETFコミュニティのコンセンサスを表しています。公開レビューを受けており、インターネットエンジニアリングステアリンググループ（IESG）からの出版が承認されています。インターネット標準の詳細については、RFC 5741のセクション2で入手できます。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6065.",
      "ja": "このドキュメントの現在のステータス、任意のERRATA、およびそのフィードバックを提供する方法に関する情報は、http：//www.rfc-editor.org/info/rfc6065で取得できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2010 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2010 IETF Trustおよび文書著者として特定された人。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "このドキュメントは、BCP 78およびIETFドキュメント（http://trustee.ietf.org/license-info）に関連するIETF Trustの法的規定の対象となります。この文書に関するあなたの権利と制限を説明するので、これらの文書を注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、セクション4.Eで説明されている法的規定のセクション4.Eで説明されており、単純化されたBSDライセンスで説明されているように保証なしで提供される簡略化されたBSDライセンステキストを含める必要があります。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  3\n2.  The Internet-Standard Management Framework . . . . . . . . . .  3\n3.  Conventions  . . . . . . . . . . . . . . . . . . . . . . . . .  3\n4.  Overview . . . . . . . . . . . . . . . . . . . . . . . . . . .  4\n  4.1.  Using AAA services with SNMP . . . . . . . . . . . . . . .  4\n  4.2.  Applicability  . . . . . . . . . . . . . . . . . . . . . .  5\n5.  Structure of the MIB Module  . . . . . . . . . . . . . . . . .  6\n  5.1.  Textual Conventions  . . . . . . . . . . . . . . . . . . .  6\n  5.2.  The Table Structure  . . . . . . . . . . . . . . . . . . .  6\n6.  Relationship to Other MIB Modules  . . . . . . . . . . . . . .  6\n  6.1.  Relationship to the VACM MIB . . . . . . . . . . . . . . .  6\n  6.2.  MIB modules Required for IMPORTS . . . . . . . . . . . . .  6\n  6.3.  Documents Required for REFERENCE Clauses . . . . . . . . .  6\n7.  Elements of Procedure  . . . . . . . . . . . . . . . . . . . .  7\n  7.1.  Sequencing Requirements  . . . . . . . . . . . . . . . . .  7\n  7.2.  Actions upon Session Establishment Indication  . . . . . .  7\n    7.2.1.  Required Information . . . . . . . . . . . . . . . . .  7\n    7.2.2.  Creation of Entries in vacmAaaSecurityToGroupTable . .  8\n    7.2.3.  Creation of Entries in vacmSecurityToGroupTable  . . .  8\n    7.2.4.  Update of vacmGroupName  . . . . . . . . . . . . . . .  9\n  7.3.  Actions upon Session Termination Indication  . . . . . . .  9\n    7.3.1.  Deletion of Entries from\n            vacmAaaSecurityToGroupTable  . . . . . . . . . . . . .  9\n    7.3.2.  Deletion of Entries from vacmSecurityToGroupTable  . . 10\n8.  Definitions  . . . . . . . . . . . . . . . . . . . . . . . . . 10\n9.  Security Considerations  . . . . . . . . . . . . . . . . . . . 14\n  9.1.  Principal Identity Naming  . . . . . . . . . . . . . . . . 14\n  9.2.  Management Information Considerations  . . . . . . . . . . 15\n10. IANA Considerations  . . . . . . . . . . . . . . . . . . . . . 16\n11. Contributors . . . . . . . . . . . . . . . . . . . . . . . . . 16\n12. References . . . . . . . . . . . . . . . . . . . . . . . . . . 17\n  12.1. Normative References . . . . . . . . . . . . . . . . . . . 17\n  12.2. Informative References . . . . . . . . . . . . . . . . . . 18",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "This memo specifies a way to dynamically provision selected View-based Access Control Model (VACM) [RFC3415] Management Information Base (MIB) objects, based on information received from an Authentication, Authorization, and Accounting (AAA) service, such as RADIUS [RFC2865] and [RFC5607]. It reduces the need for security administrators to manually update VACM configurations due to user churn, allowing a centralized AAA service to provide the information associating a given user with the access control policy (known as a \"group\" in VACM) governing that user's access to management information.",
      "ja": "このメモは、選択されたビューベースのアクセス制御モデル（VACM）[RFC3415]管理情報ベース（MIB）オブジェクトを動的に提供する方法を指定します。RFC2865]および[RFC5607]。セキュリティ管理者がユーザーチャーンのためにVACM構成を手動で更新する必要性を減らし、集中型AAAサービスが特定のユーザーに関連するアクセス制御ポリシー（VACMで「グループ」として知られている）に関連する情報を提供できるようにします。管理情報。"
    },
    {
      "indent": 3,
      "text": "This memo requires no changes to the Abstract Service Interface for the Access Control Subsystem, and requires no changes to the Elements of Procedure for VACM. It provides a MIB module that reflects the information provided by the AAA service, along with elements of procedure for maintaining that information and performing corresponding updates to VACM MIB data.",
      "ja": "このメモは、アクセス制御サブシステムの抽象サービスインターフェイスに変更を変更する必要はなく、VACMの手順の要素に変更を変更する必要はありません。AAAサービスが提供する情報を反映したMIBモジュールと、その情報を維持し、Vacm MIBデータに対応する更新を実行するための手順の要素を提供します。"
    },
    {
      "indent": 3,
      "text": "The reader is expected to be familiar with [RFC3415], [RFC5607], [RFC5608], and their supporting specifications.",
      "ja": "読者は[RFC3415]、[RFC5607]、[RFC5608]、およびそのサポート仕様に精通していると予想されます。"
    },
    {
      "indent": 0,
      "text": "2. The Internet-Standard Management Framework",
      "section_title": true,
      "ja": "2. インターネット標準の管理フレームワーク"
    },
    {
      "indent": 3,
      "text": "For a detailed overview of the documents that describe the current Internet-Standard Management Framework, please refer to section 7 of RFC 3410 [RFC3410].",
      "ja": "現在のインターネット標準管理フレームワークを説明するドキュメントの詳細な概要については、RFC 3410 [RFC3410]のセクション7を参照してください。"
    },
    {
      "indent": 3,
      "text": "Managed objects are accessed via a virtual information store, termed the Management Information Base or MIB. MIB objects are generally accessed through the Simple Network Management Protocol (SNMP). Objects in the MIB are defined using the mechanisms defined in the Structure of Management Information (SMI). This memo specifies a MIB module that is compliant to the SMIv2, which is described in STD 58, RFC 2578 [RFC2578], STD 58, RFC 2579 [RFC2579] and STD 58, RFC 2580 [RFC2580].",
      "ja": "管理されたオブジェクトは、管理情報ベースまたはMIBと呼ばれる仮想情報ストアからアクセスされます。MIBオブジェクトは通常、単純なネットワーク管理プロトコル（SNMP）からアクセスされます。MIBのオブジェクトは、管理情報の構造（SMI）で定義されたメカニズムを使用して定義されます。このメモは、STD 58、RFC 2578 [RFC2578]、STD 58、RFC 2579 [RFC2579]およびSTD 58、RFC 2580 [RFC2580]に記載されているSMIV2に準拠したMIBモジュールを指定します。"
    },
    {
      "indent": 0,
      "text": "3. Conventions",
      "section_title": true,
      "ja": "3. 規約"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "ja": "キーワードは「必須」、「必要」、「必須」、「shall」、「shall \"、\" bood \"、\" low \"of\" bould \"、\" becommended \"、\" bodement \"、\" may \"、\" optional「この文書では、RFC 2119 [RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "4. Overview",
      "section_title": true,
      "ja": "4. 概要"
    },
    {
      "indent": 0,
      "text": "4.1. Using AAA services with SNMP",
      "section_title": true,
      "ja": "4.1. SNMPでAAAサービスを使用します"
    },
    {
      "indent": 3,
      "text": "There are two use cases for AAA support of management access via SNMP. These are (a) service authorization and (b) access control authorization. The former is discussed in detail in [RFC5608]. The latter is the subject of this memo.",
      "ja": "SNMPを介した管理アクセスのAAAサポートには、2つのユースケースがあります。これらは、（a）サービス承認と（b）アクセス制御承認です。前者は[RFC5608]で詳細に説明されています。後者はこのメモの主題です。"
    },
    {
      "indent": 3,
      "text": "The use case assumption here is that roles within an organization (which are represented in VACM as groups, which in turn name access control policies) change infrequently, while the users assigned to those roles change much more frequently. This memo describes how the user-to-role (group) mapping can be delegated to the RADIUS server, avoiding the need to re-provision managed devices as users are added, deleted, or assigned new roles in an organization.",
      "ja": "ここでのユースケースの仮定は、組織内の役割（vacmでグループとして表され、順番にアクセス制御ポリシーを名前を付ける）がまれに変更されますが、それらの役割に割り当てられたユーザーははるかに頻繁に変更されます。このメモでは、ユーザーからロール（グループ）マッピングをRADIUSサーバーに委任する方法を説明し、ユーザーが組織内に新しい役割を追加、削除、または割り当てたときに管理されたデバイスを再構成する必要性を回避します。"
    },
    {
      "indent": 3,
      "text": "This memo assumes that the detailed access control policies are pre-configured in VACM, and does not attempt to address the question of how the policy associated with a given role is put in place.",
      "ja": "このメモは、詳細なアクセス制御ポリシーがVACMで事前に構成されていることを前提としており、特定の役割に関連するポリシーがどのように導入されるかという問題に対処しようとしないことを前提としています。"
    },
    {
      "indent": 3,
      "text": "The only additional information obtained from the AAA service is the mapping of the authenticated user's identifier to a specific role (or \"group\" in VACM terminology) in the access control policy. Dynamic user authorization for MIB database access control, as defined herein, is limited to mapping the authenticated user to a group, which in turn is mapped to whatever access control policies are already in place in VACM.",
      "ja": "AAAサービスから得られた唯一の追加情報は、アクセス制御ポリシーの特定の役割（またはVACM用語の「グループ」）に認証されたユーザーの識別子をマッピングすることです。本明細書で定義されているMIBデータベースアクセス制御の動的ユーザー認証は、認証されたユーザーをグループにマッピングすることに限定されており、これはVACMですでに導入されているアクセス制御ポリシーにマッピングされます。"
    },
    {
      "indent": 3,
      "text": "The SNMP architecture [RFC3411] maintains strong modularity and separation of concerns, separating user identity (authentication) from user database access rights (authorization). RADIUS, on the other hand, allows for no such separation of authorization from authentication. Consequently, the approach here is to leverage existing RADIUS usage for identifying a principal, documented in [RFC5608], along with the RADIUS Management-Policy-Id Attribute [RFC5607].",
      "ja": "SNMPアーキテクチャ[RFC3411]は、強力なモジュール性と懸念の分離を維持し、ユーザーデータベースアクセス権（認証）を分離します（認証）。一方、Radiusは、認証から認証を分離することを許可しません。その結果、ここでのアプローチは、既存の半径使用量を活用して、[RFC5608]で文書化されたプリンシパルを識別することと、RADIUS Management-Policy-ID属性[RFC5607]とともに識別することです。"
    },
    {
      "indent": 3,
      "text": "A unique identifier is needed for each AAA-authorized \"session\", corresponding to a communication channel, such as a transport session, for which a principal has been AAA-authenticated and which is authorized to offer SNMP service. How these identifiers are assigned is implementation dependent. When a RADIUS Management-Policy-Id Attribute (or equivalent) is bound to such a session and principal authentication, this binding provides sufficient information to compute dynamic updates to VACM. How this information is communicated within an implementation is implementation dependent; this memo is only concerned with externally observable behavior.",
      "ja": "AAAを認可する各識別子は、輸送セッションなどの通信チャネルに対応する各識別子が必要です。これらの識別子が割り当てられる方法は、実装依存です。RADIUS Management-Policy-ID属性（または同等）がこのようなセッションと主要な認証に拘束される場合、このバインディングはVACMに動的な更新を計算するのに十分な情報を提供します。この情報が実装内で伝達される方法は、実装依存です。このメモは、外部的に観察可能な動作にのみ関係しています。"
    },
    {
      "indent": 3,
      "text": "The key concept here is that what we will informally call a \"AAA binding\" binds:",
      "ja": "ここでの重要な概念は、「AAAバインディング」と非公式に呼ばれるものがバインドすることです。"
    },
    {
      "indent": 3,
      "text": "1. a communications channel",
      "ja": "1. 通信チャネル"
    },
    {
      "indent": 3,
      "text": "2. an authenticated principal",
      "ja": "2. 認証されたプリンシパル"
    },
    {
      "indent": 3,
      "text": "3. service authorization",
      "ja": "3. サービス承認"
    },
    {
      "indent": 3,
      "text": "4. an access control policy name",
      "ja": "4. アクセス制御ポリシー名"
    },
    {
      "indent": 3,
      "text": "Some of the binding is done via other specifications. A transport model, such as the Secure Shell Transport Model [RFC5592], provides a binding between 1 and 2 and 3, providing a securityName. In turn, [RFC5607] provides a binding between (1+2+3) and 4. This document extends that further, to create a binding between (1+2+3+4) and the local (VACM MIB) definition of the named policy, called a group in VACM.",
      "ja": "バインディングの一部は、他の仕様を介して行われます。Secure Shell Transport Model [RFC5592]などの輸送モデルは、1〜2と3の間のバインディングを提供し、セキュリティ名を提供します。次に、[RFC5607]は（1 2 3）と4の間のバインディングを提供します。このドキュメントは、さらに（1 2 3 4）と（1 2 3 4）と呼ばれる名前付きポリシーのローカル（Vacm MIB）定義の間に結合を作成するためにさらに拡張されています。vacmのグループ。"
    },
    {
      "indent": 0,
      "text": "4.2. Applicability",
      "section_title": true,
      "ja": "4.2. 適用性"
    },
    {
      "indent": 3,
      "text": "Though this memo was motivated to support the use of specific Transport Models, such as the Secure Shell Transport Model [RFC5592], it MAY be used with other implementation environments satisfying these requirements:",
      "ja": "このメモは、安全なシェル輸送モデル[RFC5592]などの特定の輸送モデルの使用をサポートするように動機付けられましたが、これらの要件を満たす他の実装環境で使用できます。"
    },
    {
      "indent": 3,
      "text": "o use an AAA service for sign-on service and data access authorization;",
      "ja": "o サインオンサービスとデータアクセス認証には、AAAサービスを使用します。"
    },
    {
      "indent": 3,
      "text": "o provide an indication of the start of a session for a particular authenticated principal in a particular role, based on information provided by the AAA service. The principal will be identified using an SNMP securityName [RFC3411]. The role will be identified by the name of the corresponding VACM group.",
      "ja": "o AAAサービスが提供する情報に基づいて、特定の役割で特定の認証されたプリンシパルのセッションの開始を示します。プリンシパルは、SNMP SecurityName [RFC3411]を使用して識別されます。役割は、対応するVACMグループの名前によって識別されます。"
    },
    {
      "indent": 3,
      "text": "o provide an indication of the end of the need for being able to make access decisions for a particular authenticated principal, as at the end of a session, whether due to disconnection, termination due to timeout, or any other reason.",
      "ja": "o 切断によるもの、タイムアウトによる終了、またはその他の理由など、セッションの終了時のように、特定の認証されたプリンシパルのアクセス決定を下すことができる必要性の終了を示します。"
    },
    {
      "indent": 3,
      "text": "Likewise, although this memo specifically refers to RADIUS, it MAY be used with other AAA services satisfying these requirements:",
      "ja": "同様に、このメモは具体的には半径を指しますが、これらの要件を満たす他のAAAサービスで使用できます。"
    },
    {
      "indent": 3,
      "text": "o the service provides information semantically equivalent to the RADIUS Management-Policy-Id Attribute [RFC5607], which corresponds to the name of a VACM group;",
      "ja": "o このサービスは、VACMグループの名前に対応するRADIUS Management-Policy-ID属性[RFC5607]に意味的に同等の情報を提供します。"
    },
    {
      "indent": 3,
      "text": "o the service provides an authenticated principal identifier (e.g., the RADIUS User-Name Attribute [RFC2865]) that can be transformed to an equivalent principal identifier in the form of a securityName [RFC3411].",
      "ja": "o このサービスは、SecurityName [RFC3411]の形式で同等の主要な識別子に変換できる、認証された主要な識別子（例えば、RADIUSユーザー名属性[RFC2865]）を提供します。"
    },
    {
      "indent": 0,
      "text": "5. Structure of the MIB Module",
      "section_title": true,
      "ja": "5. MIBモジュールの構造"
    },
    {
      "indent": 0,
      "text": "5.1. Textual Conventions",
      "section_title": true,
      "ja": "5.1. テキストの慣習"
    },
    {
      "indent": 3,
      "text": "This MIB module makes use of the SnmpAdminString [RFC3411] and SnmpSecurityModel [RFC3411] textual conventions.",
      "ja": "このMIBモジュールは、snmpadminstring [rfc3411]およびsnmpsecuritymodel [rfc3411]テキストコンベンションを使用しています。"
    },
    {
      "indent": 0,
      "text": "5.2. The Table Structure",
      "section_title": true,
      "ja": "5.2. テーブル構造"
    },
    {
      "indent": 3,
      "text": "This MIB module defines a single table, the vacmAaaSecurityToGroupTable. This table is indexed by the integer assigned to each security model, the protocol-independent securityName corresponding to a principal, and the unique identifier of a session.",
      "ja": "このMIBモジュールは、単一のテーブルであるvacmaaasecurityTogruptableを定義します。このテーブルは、各セキュリティモデルに割り当てられた整数、プリンシパルに対応するプロトコルに依存しないセキュリティ名、およびセッションの一意の識別子によってインデックス付けされています。"
    },
    {
      "indent": 0,
      "text": "6. Relationship to Other MIB Modules",
      "section_title": true,
      "ja": "6. 他のMIBモジュールとの関係"
    },
    {
      "indent": 3,
      "text": "This MIB module has a close operational relationship with the SNMP-VIEW-BASED-ACM-MIB (more commonly known as the \"VACM MIB\") from [RFC3415]. It also relies on IMPORTS from several other modules.",
      "ja": "このMIBモジュールは、[RFC3415]のSNMP-ViewベースのACM-MIB（より一般的には「Vacm Mib」として知られている）と密接な動作関係を持っています。また、他のいくつかのモジュールからの輸入にも依存しています。"
    },
    {
      "indent": 0,
      "text": "6.1. Relationship to the VACM MIB",
      "section_title": true,
      "ja": "6.1. vacm mibとの関係"
    },
    {
      "indent": 3,
      "text": "Although the MIB module defined here has a close relationship with the VACM MIB's vacmSecurityToGroupTable, it in no way changes the elements of procedure for VACM, nor does it affect any other tables defined in VACM. See the elements of procedure (below) for details of how the contents of the vacmSecurityToGroupTable are affected by this MIB module.",
      "ja": "ここで定義されているMIBモジュールは、vacm MIBのvacmsecurityTogruptableと密接な関係を持っていますが、Vacmの手順の要素を変更することも、vacmで定義されている他のテーブルにも影響しません。vacmsecurityTogrouptableの内容がこのMIBモジュールの影響を受ける方法の詳細については、手順の要素（以下）を参照してください。"
    },
    {
      "indent": 0,
      "text": "6.2. MIB modules Required for IMPORTS",
      "section_title": true,
      "ja": "6.2. 輸入に必要なMIBモジュール"
    },
    {
      "indent": 3,
      "text": "This MIB module employs definitions from [RFC2578], [RFC2579], and [RFC3411].",
      "ja": "このMIBモジュールは、[RFC2578]、[RFC2579]、および[RFC3411]の定義を採用しています。"
    },
    {
      "indent": 0,
      "text": "6.3. Documents Required for REFERENCE Clauses",
      "section_title": true,
      "ja": "6.3. 参照条項に必要なドキュメント"
    },
    {
      "indent": 3,
      "text": "This MIB module contains REFERENCE clauses making reference to [RFC2865], [RFC3411], and [RFC5590].",
      "ja": "このMIBモジュールには、[RFC2865]、[RFC3411]、および[RFC5590]を参照する参照条項が含まれています。"
    },
    {
      "indent": 0,
      "text": "7. Elements of Procedure",
      "section_title": true,
      "ja": "7. 手順の要素"
    },
    {
      "indent": 3,
      "text": "The following elements of procedure are formulated in terms of two types of events: an indication of the establishment of a session, and an indication that one has ended. These can result in the creation of entries in the vacmAaaSecurityToGroupTable, which can in turn trigger creation, update, or deletion of entries in the vacmSecurityToGroupTable.",
      "ja": "手順の次の要素は、2種類のイベントの観点から定式化されています。セッションの確立の兆候と、1つが終了したことを示しています。これらは、vacmaaasecuritytopruptableでエントリを作成する可能性があり、これにより、facmsecuritytopropableでのエントリの作成、更新、または削除をトリガーできます。"
    },
    {
      "indent": 3,
      "text": "There are various possible implementation-dependent error cases not spelled out here, such as running out of memory. By their nature, recovery in such cases will be implementation dependent. Implementors are advised to consider fail-safe strategies, e.g., prematurely terminating access in preference to erroneously perpetuating access.",
      "ja": "メモリが不足しているなど、ここでは綴られていないさまざまな実装依存エラーケースがあります。その性質上、そのような場合の回復は実装に依存します。実装者は、フェイルセーフ戦略を検討することをお勧めします。たとえば、アクセスを誤って永続させるよりも、アクセスを早期に終了します。"
    },
    {
      "indent": 0,
      "text": "7.1. Sequencing Requirements",
      "section_title": true,
      "ja": "7.1. シーケンス要件"
    },
    {
      "indent": 3,
      "text": "These procedures assume that a transport model, such as [RFC5592], coordinates session establishment with AAA authentication and authorization. They rely on the receipt by the AAA client of the RADIUS Management-Policy-Id [RFC5607] Attribute (or its equivalent) from the RADIUS Access-Accept message (or equivalent). They also assume that the User-Name [RFC2865] from the RADIUS Access-Request message (or equivalent) corresponds to a securityName [RFC3411].",
      "ja": "これらの手順では、[RFC5592]などの輸送モデルが、AAA認証と承認とセッションの確立を調整すると想定しています。彼らは、RADIUS Access-Acceptメッセージ（または同等）からRADIUS Management-Policy-ID [RFC5607]属性（または同等）のAAAクライアントによる領収書に依存しています。また、RADIUS Access-Requestメッセージ（または同等）からのユーザー名[RFC2865]がセキュリティ名[RFC3411]に対応すると仮定しています。"
    },
    {
      "indent": 3,
      "text": "To ensure correct processing of SNMP PDUs, the handling of the indication of the establishment of a session in accordance with the elements of procedure below MUST be completed before the isAccessAllowed() Abstract Service Interface [RFC3415] is invoked for any SNMP PDUs from that session.",
      "ja": "SNMP PDUの正しい処理を確保するには、以下の手順の要素に従ってセッションの確立の指標の取り扱いを完了する必要があります（）Abstract Service Interface [RFC3415]がそのセッションからのSNMP PDUに対して呼び出されます。。"
    },
    {
      "indent": 3,
      "text": "If a session termination indication occurs before all invocations of the isAccessAllowed() Abstract Service Interface [RFC3415] have completed for all SNMP PDUs from that session, those remaining invocations MAY result in denial of access.",
      "ja": "ISACCESSALLOWED（）Abstract Service Interface [RFC3415]のすべての呼び出しの前にセッション終了表示が発生した場合、そのセッションからのすべてのSNMP PDUに対して完了した場合、残りの呼び出しはアクセスの拒否につながる可能性があります。"
    },
    {
      "indent": 0,
      "text": "7.2. Actions upon Session Establishment Indication",
      "section_title": true,
      "ja": "7.2. セッションの確立兆候時のアクション"
    },
    {
      "indent": 0,
      "text": "7.2.1. Required Information",
      "section_title": true,
      "ja": "7.2.1. 必要な情報"
    },
    {
      "indent": 3,
      "text": "Four pieces of information are needed to process the session establishment indication:",
      "ja": "セッションの確立の表示を処理するには、4つの情報が必要です。"
    },
    {
      "indent": 3,
      "text": "o the SnmpSecurityModel [RFC3411] needed as an index into the vacmSecurityToGroupTable;",
      "ja": "o snmpsecurityModel [rfc3411]は、facmsecuritytopropableのインデックスとして必要でした。"
    },
    {
      "indent": 3,
      "text": "o the RADIUS User-Name Attribute;",
      "ja": "o RADIUSユーザー名属性。"
    },
    {
      "indent": 3,
      "text": "o a session identifier, as a unique, definitive identifier of the session that the AAA authorization is tied to;",
      "ja": "o AAA認証が結びついているセッションのユニークで決定的な識別子としてのセッション識別子。"
    },
    {
      "indent": 3,
      "text": "o the RADIUS Management-Policy-Id Attribute.",
      "ja": "o RADIUS Management-Policy-ID属性。"
    },
    {
      "indent": 3,
      "text": "All four of these pieces of information are REQUIRED. In particular, if either the User-Name or Management-Policy-Id is absent, invalid, or a zero-length string, no further processing of the session establishment indication is undertaken.",
      "ja": "これらの情報の4つすべてが必要です。特に、ユーザー名またはManagement-Policy-IDが存在しない、無効、またはゼロ長さの文字列のいずれかがある場合、セッション確立の表示のさらなる処理は行われません。"
    },
    {
      "indent": 3,
      "text": "As noted in Section 4.2, the above text refers specifically to RADIUS attributes. Other AAA services can be substituted, but the requirements imposed on the User-Name and the Management-Policy-Id-Attribute MUST be satisfied using the equivalent fields for those services.",
      "ja": "セクション4.2に記載されているように、上記のテキストは、特に半径属性を指します。他のAAAサービスを代用することができますが、ユーザー名に課される要件とManagement-Policy-ID-Attributeは、それらのサービスの同等のフィールドを使用して満たされなければなりません。"
    },
    {
      "indent": 0,
      "text": "7.2.2. Creation of Entries in vacmAaaSecurityToGroupTable",
      "section_title": true,
      "ja": "7.2.2. vacmaaasecuritytopruptableのエントリの作成"
    },
    {
      "indent": 3,
      "text": "Whenever an indication arrives that a new session has been established, determine whether a corresponding entry exists in the vacmAaaSecurityToGroupTable. If one does not, create a new row with the columns populated as follows:",
      "ja": "新しいセッションが確立されていることを示す兆候が届くたびに、VacmaaasecurityTogrouptableに対応するエントリが存在するかどうかを判断します。そうでない場合は、次のように列が入力された新しい行を作成します。"
    },
    {
      "indent": 3,
      "text": "o vacmAaaSecurityModel = value of SnmpSecurityModel corresponding to the security model in use;",
      "ja": "o vacmaaasecurityModel =使用中のセキュリティモデルに対応するsnmpsecurityModelの値。"
    },
    {
      "indent": 3,
      "text": "o vacmAaaSecurityName = RADIUS User-Name Attribute or equivalent, the securityName that will be used in invocations of the isAccessAllowed() Abstract Service Interface [RFC3415];",
      "ja": "o vacmaaasecurityName = radius user-name属性または同等の属性、isaccessallowed（）Abstract Serviceインターフェイス[RFC3415]の呼び出しで使用されるセキュリティ名。"
    },
    {
      "indent": 3,
      "text": "o vacmAaaSessionID = session identifier, unique across all open sessions of all of this SNMP engine's transport models;",
      "ja": "o vacmaaasessionId =セッション識別子、このSNMPエンジンのすべての輸送モデルのすべてのオープンセッションにわたって一意。"
    },
    {
      "indent": 3,
      "text": "o vacmAaaGroupName = RADIUS Management-Policy-Id Attribute or equivalent.",
      "ja": "o vacmaaagroupName = RADIUS Management-Policy-ID属性または同等。"
    },
    {
      "indent": 3,
      "text": "Otherwise, if the row already exists, update the vacmAaaGroupName with the RADIUS Management-Policy-Id Attribute or equivalent supplied.",
      "ja": "それ以外の場合、行が既に存在する場合は、radius management-policy-id属性または等価供給を使用してvacmaaagroupNameを更新します。"
    },
    {
      "indent": 0,
      "text": "7.2.3. Creation of Entries in vacmSecurityToGroupTable",
      "section_title": true,
      "ja": "7.2.3. vacmsecuritytogrouptableでのエントリの作成"
    },
    {
      "indent": 3,
      "text": "Whenever an entry is created in the vacmAaaSecurityToGroupTable, the vacmSecurityToGroupTable is examined to determine whether a corresponding entry exists there, using the value of vacmAaaSecurityModel for vacmSecurityModel, and the value of vacmAaaSecurityName for vacmSecurityName. If no corresponding entry exists, create one using the vacmAaaGroupName of the newly created entry to fill in vacmGroupName, using a value of \"volatile\" for the row's StorageType, and a value of \"active\" for its RowStatus.",
      "ja": "vacmaaasecuritytopruptableでエントリが作成されるたびに、vacmsecuritymodelの値とvacmsecurityNameのVacmaaaasecurityNameの値を使用して、対応するエントリがそこに存在するかどうかを判断するためにvacmsecurityTogruptableを調べます。対応するエントリが存在しない場合は、新しく作成されたエントリのvacmaaAgroupNameを使用して、vacmgroupNameを埋めるために、行のvacmaagroupNameを使用して作成します。これは、行のStorageTypeの「揮発性」の値と、RowStatusの「アクティブ」の値を使用します。"
    },
    {
      "indent": 0,
      "text": "7.2.4. Update of vacmGroupName",
      "section_title": true,
      "ja": "7.2.4. vacmgroupNameの更新"
    },
    {
      "indent": 3,
      "text": "Whenever the value of an instance of vacmAaaGroupName is updated, if a corresponding entry exists in the vacmSecurityToGroupTable, and that entry's StorageType is \"volatile\" and its RowStatus is \"active\", update the value of vacmGroupName with the value from vacmAaaGroupName.",
      "ja": "vacmaaagroupNameのインスタンスの値が更新されると、対応するエントリがvacmsecuritytoproptableに存在し、そのエントリのStorageTypeが「揮発性」であり、そのrowStatusは「アクティブ」である場合、vacmaagagroupnameの値でvacmgroupNameの値を更新します。"
    },
    {
      "indent": 3,
      "text": "If a corresponding entry already exists in the vacmSecurityToGroupTable, and that row's StorageType is anything other than \"volatile\", or its RowStatus is anything other than \"active\", then that instance of vacmGroupName MUST NOT be modified.",
      "ja": "対応するエントリがfacmsecurityTopropableに既に存在し、そのrowのstorageTypeが「揮発性」以外のものである場合、またはそのrowStatusが「アクティブ」以外のものである場合、vacmgroupNameのインスタンスを変更する必要はありません。"
    },
    {
      "indent": 3,
      "text": "The operational assumption here is that if the row's StorageType is \"volatile\", then this entry was probably dynamically created; an entry created by a security administrator would not normally be given a StorageType of \"volatile\". If the value being provided by RADIUS (or another AAA service) is the same as what is already there, this is a no-op. If the value is different, the new information is understood as a more recent role (group) assignment for the user, which should supersede the one currently held there. The structure of the vacmSecurityToGroupTable makes it impossible for a (vacmSecurityModel, vacmSecurityName) tuple to map to more than one group.",
      "ja": "ここでの運用上の仮定は、行のStorageTypeが「揮発性」である場合、このエントリはおそらく動的に作成されたということです。セキュリティ管理者によって作成されたエントリには、通常、「揮発性」のStorageTypeが与えられません。RADIUS（または別のAAAサービス）によって提供されている値がすでにそこにあるものと同じ場合、これはNo-opです。値が異なる場合、新しい情報はユーザーのより最近の役割（グループ）の割り当てとして理解されます。vacmsecurityTogrouptableの構造により、（vacmsecurityModel、vacmsecurityName）タプルが複数のグループにマッピングすることは不可能になります。"
    },
    {
      "indent": 0,
      "text": "7.3. Actions upon Session Termination Indication",
      "section_title": true,
      "ja": "7.3. セッション終了表示時のアクション"
    },
    {
      "indent": 3,
      "text": "Whenever a RADIUS (or other AAA) authenticated session ends for any reason, an indication is provided. This indication MUST provide means of determining the SnmpSecurityModel, and an identifier for the transport session tied to the AAA authorization. The manner in which this occurs is implementation dependent.",
      "ja": "何らかの理由で半径（または他のAAA）認証セッションが終了するたびに、表示が提供されます。この適応症は、snmpsecuritymodelを決定する手段と、AAA認証に関連する輸送セッションの識別子を提供する必要があります。これが発生する方法は、実装依存です。"
    },
    {
      "indent": 0,
      "text": "7.3.1. Deletion of Entries from vacmAaaSecurityToGroupTable",
      "section_title": true,
      "ja": "7.3.1. vacmaaasecuritytopropableからのエントリの削除"
    },
    {
      "indent": 3,
      "text": "Entries in the vacmAaaSecurityToGroupTable MUST NOT persist across system reboots.",
      "ja": "vacmaaasecuritytogrouptableのエントリは、システムの再起動全体で持続してはなりません。"
    },
    {
      "indent": 3,
      "text": "When a session has been terminated, the vacmAaaSecurityToGroupTable is searched for a corresponding entry. A \"matching\" entry is any entry for which the SnmpSecurityModel and session ID match the information associated with the session termination indication. Any matching entries are deleted. It is possible that no entries will match; this is not an error, and no special processing is required in this case.",
      "ja": "セッションが終了すると、vacmaaaasecuritytoproptableが対応するエントリを検索します。「マッチング」エントリとは、SNMPSECURITYMODELとセッションIDがセッション終了表示に関連付けられた情報と一致するエントリです。一致するエントリは削除されます。エントリが一致しない可能性があります。これはエラーではなく、この場合には特別な処理は必要ありません。"
    },
    {
      "indent": 0,
      "text": "7.3.2. Deletion of Entries from vacmSecurityToGroupTable",
      "section_title": true,
      "ja": "7.3.2. vacmsecuritytogrouptableからのエントリの削除"
    },
    {
      "indent": 3,
      "text": "Whenever the last remaining row bearing a particular (vacmAaaSecurityModel, vacmAaaSecurityName) pair is deleted from the vacmAaaSecurityToGroupTable, the vacmSecurityToGroupTable is examined for a corresponding row. If one exists, and if its StorageType is \"volatile\" and its RowStatus is \"active\", that row MUST be deleted as well. The mechanism to accomplish this task is implementation dependent.",
      "ja": "特定の（vacmaaasecuritymodel、vacmaaasecurityName）ペアがvacmaaaasecuritytogrouptableから削除される最後の行が削除されるたびに、vacmsecuritytoproptableは対応する行について調べられます。存在し、そのStorageTypeが「揮発性」であり、RowStatusが「アクティブ」である場合、その行も削除する必要があります。このタスクを達成するメカニズムは、実装依存です。"
    },
    {
      "indent": 0,
      "text": "8. Definitions",
      "section_title": true,
      "ja": "8. 定義"
    },
    {
      "indent": 0,
      "text": "SNMP-VACM-AAA-MIB DEFINITIONS ::= BEGIN",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "IMPORTS\n    MODULE-COMPLIANCE, OBJECT-GROUP       FROM SNMPv2-CONF\n    MODULE-IDENTITY, OBJECT-TYPE,\n    mib-2,\n    Unsigned32                            FROM SNMPv2-SMI\n    SnmpAdminString,\n    SnmpSecurityModel                     FROM SNMP-FRAMEWORK-MIB;",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "vacmAaaMIB MODULE-IDENTITY LAST-UPDATED \"201012090000Z\" -- 9 December 2010 ORGANIZATION \"ISMS Working Group\" CONTACT-INFO \"WG-email: isms@ietf.org\"",
      "ja": "vacmaaamibモジュールのアイデンティティ最後の「201012090000z」 -  2010年12月9日組織「ISMSワーキンググループ「連絡先」 \"wg-email：isms@ietf.org\""
    },
    {
      "indent": 4,
      "text": "DESCRIPTION \"The management and local datastore information definitions for the AAA-Enabled View-based Access Control Model for SNMP.",
      "ja": "説明 \"SNMPのAAA対応ビューベースのアクセス制御モデルの管理およびローカルデータストア情報定義。"
    },
    {
      "indent": 18,
      "text": "Copyright (c) 2010 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2010 IETF Trustおよび文書著者として特定された人。全著作権所有。"
    },
    {
      "indent": 18,
      "text": "Redistribution and use in source and binary forms, with or without modification, is permitted pursuant to, and subject to the license terms contained in, the Simplified BSD License set forth in Section 4.c of the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info).",
      "ja": "変更とバイナリ形式での再配布と使用は、変更の有無にかかわらず、IETF Trustの法的規定（IETFドキュメントに関する法的規定）のセクション4.Cに記載されている簡略化されたBSDライセンスに基づいて許可されており、ライセンス条件に従います。http://trustee.ietf.org/license-info）。"
    },
    {
      "indent": 18,
      "text": "This version of this MIB module is part of RFC 6065; see the RFC itself for full legal notices.\"",
      "ja": "このMIBモジュールのこのバージョンは、RFC 6065の一部です。完全な法的通知については、RFC自体を参照してください。」"
    },
    {
      "indent": 4,
      "text": "REVISION \"201012090000Z\" DESCRIPTION \"Initial version, published as RFC 6065.\"",
      "ja": "Revision \"201012090000Z\"説明「RFC 6065として公開された初期バージョン」"
    },
    {
      "indent": 5,
      "text": "::= { mib-2 199 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "vacmAaaMIBObjects   OBJECT IDENTIFIER ::= { vacmAaaMIB 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "vacmAaaMIBConformance OBJECT IDENTIFIER ::= { vacmAaaMIB 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "vacmAaaSecurityToGroupTable OBJECT-TYPE\n    SYNTAX       SEQUENCE OF VacmAaaSecurityToGroupEntry\n    MAX-ACCESS   not-accessible\n    STATUS       current\n    DESCRIPTION \"This table provides a listing of all currently active\n                 sessions for which a mapping of the combination of\n                 SnmpSecurityModel and securityName into the name of\n                 a VACM group has been provided by an AAA service.\n                 The group name (in VACM) in turn identifies an access\n                 control policy to be used for the corresponding\n                 principals.\"\n    REFERENCE   \"RFC 3411, Section 3.2.2, defines securityName.\"\n    ::= { vacmAaaMIBObjects 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "vacmAaaSecurityToGroupEntry OBJECT-TYPE SYNTAX VacmAaaSecurityToGroupEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"An entry in this table maps the combination of a SnmpSecurityModel and securityName into the name of a VACM group defining the access control policy that is to govern a particular session.",
      "ja": "vacmaaaasecuritytogroupentryオブジェクトタイプ構文vacmaaasecuritytogroupentry max-access not-accessable current current current current \"このテーブルのエントリは、特定のセッションを管理するアクセス制御ポリシーを定義するアクセス制御ポリシーを定義するvacmグループの名前にsnmpsecuritymodelとセキュリティ名の組み合わせをマッピングします。"
    },
    {
      "indent": 17,
      "text": "Each entry corresponds to a session.",
      "ja": "各エントリはセッションに対応します。"
    },
    {
      "indent": 17,
      "text": "Entries do not persist across reboots.",
      "ja": "エントリは再起動全体で持続しません。"
    },
    {
      "indent": 17,
      "text": "An entry is created whenever an indication occurs that a new session has been established that would not have the same index values as an existing entry.",
      "ja": "エントリは、既存のエントリと同じインデックス値を持たない新しいセッションが確立されていることを示しているときに作成されます。"
    },
    {
      "indent": 4,
      "text": "             When a session is torn down, disconnected, timed out\n             (e.g., following the RADIUS Session-Timeout Attribute),\n             or otherwise terminated for any reason, the\n             corresponding vacmAaaSecurityToGroupEntry is deleted.\"\nREFERENCE   \"RFC 3411, Section 3.2.2, defines securityName.\"\nINDEX       {\n              vacmAaaSecurityModel,\n              vacmAaaSecurityName,\n              vacmAaaSessionID\n            }\n::= { vacmAaaSecurityToGroupTable 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "VacmAaaSecurityToGroupEntry ::= SEQUENCE\n    {\n        vacmAaaSecurityModel            SnmpSecurityModel,\n        vacmAaaSecurityName             SnmpAdminString,\n        vacmAaaSessionID                Unsigned32,\n        vacmAaaGroupName                SnmpAdminString\n    }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "vacmAaaSecurityModel OBJECT-TYPE SYNTAX SnmpSecurityModel(1..2147483647) MAX-ACCESS not-accessible STATUS current DESCRIPTION \"The security model associated with the AAA binding represented by this entry.",
      "ja": "vacmaaaasecuritymodel object-type syntax snmpsecuritymodel（1..2147483647）最大アクセスはアクセス不可能なステータス現在の説明 \"このエントリで表されるAAAバインディングに関連するセキュリティモデル。"
    },
    {
      "indent": 4,
      "text": "             This object cannot take the 'any' (0) value.\"\n::= { vacmAaaSecurityToGroupEntry 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "vacmAaaSecurityName OBJECT-TYPE\n    SYNTAX       SnmpAdminString (SIZE(1..32))\n    MAX-ACCESS   not-accessible\n    STATUS       current\n    DESCRIPTION \"The securityName of the principal associated with the\n                 AAA binding represented by this entry.  In RADIUS\n                 environments, this corresponds to the User-Name\n                 Attribute.\"\n    REFERENCE   \"RFC 3411, Section 3.2.2, defines securityName, and\n                 RFC 2865, Section 5.1, defines User-Name.\"\n    ::= { vacmAaaSecurityToGroupEntry 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "vacmAaaSessionID OBJECT-TYPE SYNTAX Unsigned32 MAX-ACCESS not-accessible STATUS current DESCRIPTION \"An implementation-dependent identifier of the session.",
      "ja": "vacmaaasessionIDオブジェクトタイプの構文untisismed32 max-access not-accessable current current current \"セッションの実装依存識別子。"
    },
    {
      "indent": 17,
      "text": "This value MUST be unique among all currently open sessions of all of this SNMP engine's transport models. The value has no particular significance other than to distinguish sessions.",
      "ja": "この値は、このSNMPエンジンの輸送モデルのすべての現在オープンセッションのすべての中で一意でなければなりません。この値は、セッションを区別する以外に特に重要ではありません。"
    },
    {
      "indent": 4,
      "text": "             Implementations in which tmSessionID has a compatible\n             syntax and is unique across all transport models MAY\n             use that value.\"\nREFERENCE   \"The Abstract Service Interface parameter tmSessionID\n             is defined in RFC 5590, Section 5.2.4.\"\n::= { vacmAaaSecurityToGroupEntry 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "vacmAaaGroupName OBJECT-TYPE SYNTAX SnmpAdminString (SIZE(1..32)) MAX-ACCESS read-only STATUS current DESCRIPTION \"The name of the group to which this entry is to belong. In RADIUS environments, this comes from the RADIUS Management-Policy-Id Attribute.",
      "ja": "vacmaaagroupNameオブジェクトタイプ構文SNMPADMINSTRING（サイズ（1..32））最大アクセス読み取り専用ステータス現在の説明 \"このエントリが属するグループの名前。-id属性。"
    },
    {
      "indent": 4,
      "text": "             When the appropriate conditions are met,\n             the value of this object is applied the vacmGroupName\n             in the corresponding vacmSecurityToGroupEntry.\"\nREFERENCE    \"RFC 3415\"\n::= { vacmAaaSecurityToGroupEntry 4 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- Conformance information ******************************************",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "vacmAaaMIBCompliances\n               OBJECT IDENTIFIER ::= {vacmAaaMIBConformance 1}\nvacmAaaMIBGroups\n               OBJECT IDENTIFIER ::= {vacmAaaMIBConformance 2}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- compliance statements",
      "ja": " - コンプライアンスステートメント"
    },
    {
      "indent": 0,
      "text": "vacmAaaMIBBasicCompliance MODULE-COMPLIANCE STATUS current DESCRIPTION \"The compliance statement for SNMP engines implementing the AAA-Enabled View-based Access Control Model for SNMP.\" MODULE -- this module MANDATORY-GROUPS { vacmAaaGroup }",
      "ja": "vacmaaAmibbasicComplianceモジュールコンプライアンスステータス現在の説明「SNMPのAAA対応ビューベースのアクセス制御モデルを実装するSNMPエンジンのコンプライアンスステートメント。」モジュール - このモジュールの必須グループ{vacmaaagroup}"
    },
    {
      "indent": 4,
      "text": "::= { vacmAaaMIBCompliances 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- units of conformance",
      "ja": " - 適合ユニット"
    },
    {
      "indent": 0,
      "text": "vacmAaaGroup OBJECT-GROUP\n    OBJECTS {\n              vacmAaaGroupName\n            }\n    STATUS       current\n    DESCRIPTION \"A collection of objects for supporting the use of AAA\n                 services to provide user-to-group mappings for VACM.\"\n    ::= { vacmAaaMIBGroups 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "END\u0007\u0007\u00079. Security Considerations",
      "ja": "終了9。セキュリティ上の考慮事項"
    },
    {
      "indent": 3,
      "text": "The algorithms in this memo make heuristic use of the StorageType of entries in the vacmSecurityToGroupTable to distinguish those provisioned by a security administrator (which would presumably not be configured as \"volatile\") from those dynamically generated. In making this distinction, it assumes that those entries explicitly provisioned by a security administrator and given a non-\"volatile\" status are not to be dynamically overridden. Furthermore, it assumes that any active entries with \"volatile\" status can be treated as dynamic, and deleted or updated as needed. Users of this memo need to be aware of this operational assumption, which, while reasonable, is not necessarily universally valid. For example, this situation could also occur if the SNMP security administrator had mistakenly created these non-volatile entries in error.",
      "ja": "このメモのアルゴリズムは、セキュリティ管理者によってプロビジョニングされたもの（おそらく「揮発性」として構成されていない）を動的に生成したものと区別するために、vacmsecurityTogruptiveのエントリのStorageTypeをヒューリスティックに使用します。この区別を行う際、これらのエントリは、セキュリティ管理者によって明示的にプロビジョニングされ、「不安定な」ステータスが動的に無効にされないことを前提としています。さらに、「揮発性」ステータスを持つアクティブなエントリは、動的として扱われ、必要に応じて削除または更新できると想定しています。このメモのユーザーは、この運用上の仮定を認識する必要があります。これは、合理的ですが、必ずしも普遍的に有効ではありません。たとえば、SNMPセキュリティ管理者がこれらの不揮発性のないエントリを誤って誤って作成した場合、この状況も発生する可能性があります。"
    },
    {
      "indent": 3,
      "text": "The design of VACM ensures that if an unknown policy (group name) is used in the vacmSecurityToGroupTable, no access is granted. A consequence of this is that no matter what information is provided by the AAA server, no user can gain SNMP access rights not already granted to some group through the VACM configuration.",
      "ja": "VACMの設計により、vacmsecurityTopluptableで不明なポリシー（グループ名）が使用されている場合、アクセスが許可されないことが保証されます。この結果、AAAサーバーがどのような情報が提供されていても、VACM構成を通じて何らかのグループにまだ許可されていないSNMPアクセス権を取得できないユーザーはいないということです。"
    },
    {
      "indent": 0,
      "text": "9.1. Principal Identity Naming",
      "section_title": true,
      "ja": "9.1. 主要なアイデンティティ命名"
    },
    {
      "indent": 3,
      "text": "In order to ensure that the access control policy ultimately applied as a result of the mechanisms described here is indeed the intended policy for a given principal using a particular security model, care needs to be applied in the mapping of the authenticated user (principal) identity to the securityName used to make the access control decision. Broadly speaking, there are two approaches to ensure consistency of identity:",
      "ja": "ここで説明されているメカニズムの結果として最終的に適用されるアクセス制御ポリシーが特定のセキュリティモデルを使用して特定のプリンシパルの意図されたポリシーであることを保証するために、認証されたユーザー（プリンシパル）IDのマッピングには注意を払う必要があります。Access Controlの決定を下すために使用されるSecurityNameに。大まかに言えば、アイデンティティの一貫性を確保するための2つのアプローチがあります。"
    },
    {
      "indent": 3,
      "text": "o Entries for the vacmSecurityToGroupTable corresponding to a given security model are created only through the operation of the procedures described in this memo. A consequence of this would be that all such entries would have been created using the RADIUS User-Name (or other AAA-authenticated identity) and RADIUS Management-Policy-Id Attribute (or equivalent).",
      "ja": "o 特定のセキュリティモデルに対応するvacmsecurityTogruptableのエントリは、このメモに記載されている手順の操作によってのみ作成されます。これの結果、そのようなエントリはすべて、RADIUSユーザー名（または他のAAA認証アイデンティティ）およびRADIUS Management-Policy-ID属性（または同等）を使用して作成されたことです。"
    },
    {
      "indent": 3,
      "text": "o Administrative policy allows a matching pre-configured entry to exist in the vacmSecurityToGroupTable, i.e., an entry with the corresponding vacmSecurityModel and with a vacmSecurityName matching the authenticated principal's RADIUS User-Name. In this case, administrative policy also needs to ensure consistency of identity between each authenticated principal's RADIUS User-Name and the administratively configured vacmSecurityName in the vacmSecurityToGroupTable row entries for that particular security model.",
      "ja": "o 管理ポリシーにより、一致する事前に構成されたエントリがvacmsecurityTogroutable、つまり、対応するvacmsecurityModelと認証されたプリンシパルのRADIUSユーザー名と一致するvacmsecurityNameを備えたエントリに存在することができます。この場合、管理ポリシーは、その特定のセキュリティモデルのvacmsecuritytogruptable行エントリで、認証された各プリンシパルのRADIUSユーザー名と管理上構成されたvacmsecurityNameの間のIDの一貫性を確保する必要があります。"
    },
    {
      "indent": 3,
      "text": "In the latter case, inconsistent re-use of the same name for different entities or individuals (principals) can cause the incorrect access control policy to be applied for the authenticated principal, depending on whether the policy that is configured using SNMP or the policy that is applied using the procedures of this memo is the intended policy. This may result in greater or lesser access rights than the administrative policy intended. Inadvertent misidentification in such cases may be undetectable by the SNMP engine or other software elements of the managed entity.",
      "ja": "後者の場合、異なるエンティティまたは個人（プリンシパル）の同じ名前の一貫性のない再利用により、SNMPを使用して構成されているポリシーまたはポリシーを使用して構成されているポリシーに応じて、誤ったアクセス制御ポリシーが認証されたプリンシパルに適用される可能性があります。このメモの手順を使用して適用されます。これにより、意図した管理ポリシーよりもアクセス権が大きくなる可能性があります。そのような場合の不注意な誤認は、SNMPエンジンまたはマネージドエンティティの他のソフトウェア要素によって検出できない場合があります。"
    },
    {
      "indent": 0,
      "text": "9.2. Management Information Considerations",
      "section_title": true,
      "ja": "9.2. 管理情報の考慮事項"
    },
    {
      "indent": 3,
      "text": "There are no management objects defined in this MIB module that have a MAX-ACCESS clause of read-write and/or read-create. So, if this MIB module is implemented correctly, then there is no risk that an intruder can alter or create any management objects of this MIB module via direct SNMP SET operations.",
      "ja": "このMIBモジュールには、read-writeおよび/またはread-createの最大アクセス句がある管理オブジェクトはありません。したがって、このMIBモジュールが正しく実装されている場合、侵入者が直接SNMPセット操作を介してこのMIBモジュールの管理オブジェクトを変更または作成できるリスクはありません。"
    },
    {
      "indent": 3,
      "text": "Some of the readable objects in this MIB module (including some objects with a MAX-ACCESS of not-accessible, whose values are exposed as a result of access to indexed objects) may be considered sensitive or vulnerable in some network environments. It is thus important to control even GET and/or NOTIFY access to these objects and possibly to even encrypt the values of these objects when sending them over the network via SNMP. These are the tables and objects and their sensitivity/vulnerability:",
      "ja": "このMIBモジュールの読み取り可能なオブジェクトのいくつか（アクセス不可能な最大アクセスを備えた一部のオブジェクトを含む、その値はインデックス付きオブジェクトへのアクセスの結果として公開されます）は、一部のネットワーク環境で敏感または脆弱と見なされる場合があります。したがって、これらのオブジェクトへのアクセスを取得および/または通知することさえ制御し、SNMPを介してネットワーク上に送信するときにこれらのオブジェクトの値を暗号化することも重要です。これらはテーブルとオブジェクトであり、その感度/脆弱性です。"
    },
    {
      "indent": 3,
      "text": "o vacmAaaSecurityToGroupTable - the entire table is potentially sensitive, since walking the table will reveal user names, security models in use, session identifiers, and group names;",
      "ja": "o vacmaaasecuritytogrouptable-テーブル全体が潜在的に敏感です。テーブルを歩くと、ユーザー名、使用中のセキュリティモデル、セッション識別子、およびグループ名が明らかになります。"
    },
    {
      "indent": 3,
      "text": "o vacmAaaSecurityModel - though not-accessible, this is exposed as an index of vacmAaaGroupName;",
      "ja": "o vacmaaasecurityModel-アクセスできませんが、これはvacmaaagroupNameのインデックスとして公開されます。"
    },
    {
      "indent": 3,
      "text": "o vacmAaaSecurityName - though not-accessible, this is exposed as an index of vacmAaaGroupName;",
      "ja": "o vacmaaasecurityName-アクセスできませんが、これはvacmaaagroupNameのインデックスとして公開されます。"
    },
    {
      "indent": 3,
      "text": "o vacmAaaSessionID - though not-accessible, this is exposed as an index of vacmAaaGroupName;",
      "ja": "o vacmaaasessionid-アクセスできませんが、これはvacmaaagroupNameのインデックスとして公開されます。"
    },
    {
      "indent": 3,
      "text": "o vacmAaaGroupName - since this identifies a security policy and associates it with a particular user, this is potentially sensitive.",
      "ja": "o vacmaaagroupName-これはセキュリティポリシーを特定し、特定のユーザーと関連付けるため、これは潜在的に敏感です。"
    },
    {
      "indent": 3,
      "text": "SNMP versions prior to SNMPv3 did not include adequate security. Even if the network itself is secure (for example by using IPsec), even then, there is no control as to who on the secure network is allowed to access and GET/SET (read/change/create/delete) the objects in this MIB module.",
      "ja": "SNMPV3以前のSNMPバージョンには、適切なセキュリティが含まれていませんでした。ネットワーク自体が（たとえばIPSECを使用して）安全である場合でも、それでもセキュアネットワークで誰がアクセスして取得/セット（読み取り/変更/作成/削除/削除）を制御することはできません。MIBモジュール。"
    },
    {
      "indent": 3,
      "text": "It is RECOMMENDED that implementers consider the security features as provided by the SNMPv3 framework (see [RFC3410], section 8), including full support for the SNMPv3 cryptographic mechanisms (for authentication and privacy).",
      "ja": "実装者は、SNMPV3暗号化メカニズム（認証とプライバシー用）の完全なサポートを含む、SNMPV3フレームワーク（[RFC3410]、セクション8を参照）で提供されるセキュリティ機能を考慮することをお勧めします。"
    },
    {
      "indent": 3,
      "text": "Further, deployment of SNMP versions prior to SNMPv3 is NOT RECOMMENDED. Instead, it is RECOMMENDED to deploy SNMPv3 and to enable cryptographic security. It is then a customer/operator responsibility to ensure that the SNMP entity giving access to an instance of this MIB module is properly configured to give access to the objects only to those principals (users) that have legitimate rights to indeed GET or SET (change/create/delete) them.",
      "ja": "さらに、SNMPV3より前のSNMPバージョンの展開は推奨されません。代わりに、SNMPV3を展開し、暗号化セキュリティを有効にすることをお勧めします。その場合、このMIBモジュールのインスタンスへのアクセスを提供するSNMPエンティティが、実際に取得または設定する正当な権利を持つプリンシパル（ユーザー）にのみオブジェクトにアクセスできるように適切に構成されていることを保証するのは、顧客/オペレーターの責任です（変更（変更）（変更）/作成/削除）それら。"
    },
    {
      "indent": 0,
      "text": "10. IANA Considerations",
      "section_title": true,
      "ja": "10. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "The MIB module in this document uses the following IANA-assigned OBJECT IDENTIFIER value recorded in the SMI Numbers registry:",
      "ja": "このドキュメントのMIBモジュールは、SMI番号レジストリに記録された次のIANAによって割り当てられたオブジェクト識別子値を使用します。"
    },
    {
      "indent": 6,
      "text": "Descriptor        OBJECT IDENTIFIER value\n----------        -----------------------\nvacmAaaMIB        { mib-2 199 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "11. Contributors",
      "section_title": true,
      "ja": "11. 貢献者"
    },
    {
      "indent": 3,
      "text": "The following participants from the ISMS working group contributed to the development of this document:",
      "ja": "ISMSワーキンググループの以下の参加者は、このドキュメントの開発に貢献しました。"
    },
    {
      "indent": 3,
      "text": "o Andrew Donati",
      "ja": "o アンドリュー・ドナティ"
    },
    {
      "indent": 3,
      "text": "o David Harrington",
      "ja": "o デビッド・ハリントン"
    },
    {
      "indent": 3,
      "text": "o Jeffrey Hutzelman",
      "ja": "o ジェフリー・ハッツェルマン"
    },
    {
      "indent": 3,
      "text": "o Juergen Schoenwaelder",
      "ja": "o Juergen Schoenwaelder"
    },
    {
      "indent": 3,
      "text": "o Tom Petch",
      "ja": "o トム・ペッチ"
    },
    {
      "indent": 3,
      "text": "o Wes Hardaker During the IESG review, additional comments were received from:",
      "ja": "o Wes Hardaker IESGレビュー中に、追加のコメントは以下から受け取りました。"
    },
    {
      "indent": 3,
      "text": "o Adrian Farrel",
      "ja": "o エイドリアン・ファレル"
    },
    {
      "indent": 3,
      "text": "o Amanda Baber",
      "ja": "o アマンダ・バベル"
    },
    {
      "indent": 3,
      "text": "o Dan Romescanu",
      "ja": "o ダン・ロメスカヌ"
    },
    {
      "indent": 3,
      "text": "o David Kessens",
      "ja": "o デビッド・ケッセン"
    },
    {
      "indent": 3,
      "text": "o Francis Dupont",
      "ja": "o フランシス・デュポン"
    },
    {
      "indent": 3,
      "text": "o Glenn Keeni",
      "ja": "o グレン・ケーニ"
    },
    {
      "indent": 3,
      "text": "o Jari Arkko",
      "ja": "o ジャリ・アークコ"
    },
    {
      "indent": 3,
      "text": "o Joel Jaeggli",
      "ja": "o ジョエル・ジェグリ"
    },
    {
      "indent": 3,
      "text": "o Magnus Nystrom",
      "ja": "o マグナス・ニストロム"
    },
    {
      "indent": 3,
      "text": "o Mike Heard",
      "ja": "o マイクは聞いた"
    },
    {
      "indent": 3,
      "text": "o Robert Story",
      "ja": "o ロバートストーリー"
    },
    {
      "indent": 3,
      "text": "o Russ Housley",
      "ja": "o ラス・ヒューズリー"
    },
    {
      "indent": 3,
      "text": "o Sean Turner",
      "ja": "o ショーン・ターナー"
    },
    {
      "indent": 3,
      "text": "o Tim Polk",
      "ja": "o ティム・ポーク"
    },
    {
      "indent": 0,
      "text": "12. References",
      "section_title": true,
      "ja": "12. 参考文献"
    },
    {
      "indent": 0,
      "text": "12.1. Normative References",
      "section_title": true,
      "ja": "12.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119] Bradner、S。、「要件レベルを示すためにRFCで使用するためのキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2578] McCloghrie, K., Ed., Perkins, D., Ed., and J. Schoenwaelder, Ed., \"Structure of Management Information Version 2 (SMIv2)\", STD 58, RFC 2578, April 1999.",
      "ja": "[RFC2578] McCloghrie、K.、Ed。、Perkins、D.、ed。、およびJ. Schoenwaelder、ed。、「管理情報の構造バージョン2（SMIV2）」、STD 58、RFC 2578、1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2579] McCloghrie, K., Ed., Perkins, D., Ed., and J. Schoenwaelder, Ed., \"Textual Conventions for SMIv2\", STD 58, RFC 2579, April 1999.",
      "ja": "[RFC2579] McCloghrie、K.、Ed。、Perkins、D.、ed。、およびJ. Schoenwaelder、ed。、「Smiv2のテキストコンベンション」、STD 58、RFC 2579、1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2580] McCloghrie, K., Perkins, D., and J. Schoenwaelder, \"Conformance Statements for SMIv2\", STD 58, RFC 2580, April 1999.",
      "ja": "[RFC2580] McCloghrie、K.、Perkins、D。、およびJ. Schoenwaelder、「SMIV2の適合ステートメント」、STD 58、RFC 2580、1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2865] Rigney, C., Willens, S., Rubens, A., and W. Simpson, \"Remote Authentication Dial In User Service (RADIUS)\", RFC 2865, June 2000.",
      "ja": "[RFC2865] Rigney、C.、Willens、S.、Rubens、A。、およびW. Simpson、「リモート認証ダイヤルインユーザーサービス（RADIUS）」、RFC 2865、2000年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC3411] Harrington, D., Presuhn, R., and B. Wijnen, \"An Architecture for Describing Simple Network Management Protocol (SNMP) Management Frameworks\", STD 62, RFC 3411, December 2002.",
      "ja": "[RFC3411] Harrington、D.、Presuhn、R。、およびB. Wijnen、「単純なネットワーク管理プロトコル（SNMP）管理フレームワークを説明するためのアーキテクチャ」、STD 62、RFC 3411、2002年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC3415] Wijnen, B., Presuhn, R., and K. McCloghrie, \"View-based Access Control Model (VACM) for the Simple Network Management Protocol (SNMP)\", STD 62, RFC 3415, December 2002.",
      "ja": "[RFC3415] Wijnen、B.、Presuhn、R。、およびK. McCloghrie、「シンプルネットワーク管理プロトコル（SNMP）のビューベースのアクセス制御モデル（VACM）」、2002年12月、RFC 3415、RFC 3415。"
    },
    {
      "indent": 3,
      "text": "[RFC5590] Harrington, D. and J. Schoenwaelder, \"Transport Subsystem for the Simple Network Management Protocol (SNMP)\", RFC 5590, June 2009.",
      "ja": "[RFC5590] Harrington、D。およびJ. Schoenwaelder、「Simple Network Management Protocol（SNMP）の輸送サブシステム」、RFC 5590、2009年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC5607] Nelson, D. and G. Weber, \"Remote Authentication Dial-In User Service (RADIUS) Authorization for Network Access Server (NAS) Management\", RFC 5607, July 2009.",
      "ja": "[RFC5607] Nelson、D。およびG. Weber、「ネットワークアクセスサーバー（NAS）管理のためのリモート認証ダイヤルインユーザーサービス（RADIUS）認証」、RFC 5607、2009年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC5608] Narayan, K. and D. Nelson, \"Remote Authentication Dial-In User Service (RADIUS) Usage for Simple Network Management Protocol (SNMP) Transport Models\", RFC 5608, August 2009.",
      "ja": "[RFC5608] Narayan、K。およびD. Nelson、「Simple Network Management Protocol（SNMP）Transport Modelsのリモート認証ダイヤルインユーザーサービス（RADIUS）使用」、RFC 5608、2009年8月。"
    },
    {
      "indent": 0,
      "text": "12.2. Informative References",
      "section_title": true,
      "ja": "12.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[RFC3410] Case, J., Mundy, R., Partain, D., and B. Stewart, \"Introduction and Applicability Statements for Internet-Standard Management Framework\", RFC 3410, December 2002.",
      "ja": "[RFC3410] Case、J.、Mundy、R.、Partain、D。、およびB. Stewart、「インターネット標準管理フレームワークの紹介と適用声明」、RFC 3410、2002年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC5592] Harrington, D., Salowey, J., and W. Hardaker, \"Secure Shell Transport Model for the Simple Network Management Protocol (SNMP)\", RFC 5592, June 2009.",
      "ja": "[RFC5592] Harrington、D.、Salowey、J。、およびW. Hardaker、「Secure Shell Transport Model for the Simple Network Management Protocol（SNMP）」、RFC 5592、2009年6月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Kaushik Narayan Cisco Systems, Inc. 10 West Tasman Drive San Jose, CA 95134 USA",
      "ja": "Kaushik Narayan Cisco Systems、Inc。10 West Tasman Drive San Jose、CA 95134 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 408-526-8168\nEMail: kaushik_narayan@yahoo.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "David Nelson Elbrys Networks, Inc. 282 Corporate Drive, Unit #1, Portsmouth, NH 03801 USA",
      "ja": "David Nelson Elbrys Networks、Inc。282 Corporate Drive、ユニット＃1、ポーツマス、NH 03801 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 603-570-2636\nEMail: d.b.nelson@comcast.net",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Randy Presuhn (editor) San Jose, CA 95120 USA",
      "ja": "Randy Presuhn（編集者）サンノゼ、CA 95120 USA"
    },
    {
      "indent": 3,
      "text": "EMail: randy_presuhn@mindspring.com",
      "raw": true,
      "ja": ""
    }
  ]
}