{
  "title": {
    "text": "RFC 6165 - Extensions to IS-IS for Layer-2 Systems",
    "ja": "RFC 6165 - レイヤ2システムのIS-ISへの拡張"
  },
  "number": 6165,
  "created_at": "2019-10-29 07:35:11.231412+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                       A. Banerjee\nRequest for Comments: 6165                                 Cisco Systems\nCategory: Standards Track                                        D. Ward\nISSN: 2070-1721                                         Juniper Networks\n                                                              April 2011",
      "raw": true
    },
    {
      "indent": 16,
      "text": "Extensions to IS-IS for Layer-2 Systems",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document specifies the Intermediate System to Intermediate System (IS-IS) extensions necessary to support link state routing for any protocols running directly over Layer-2. While supporting this concept involves several pieces, this document only describes extensions to IS-IS. Furthermore, the Type, Length, Value pairs (TLVs) described in this document are generic Layer-2 additions, and specific ones as needed are defined in the IS-IS technology-specific extensions. We leave it to the systems using these IS-IS extensions to explain how the information carried in IS-IS is used.",
      "ja": "この文書では、中間システムへの中間システム（IS-IS）レイヤ2上で直接実行されているすべてのプロトコルのためのリンク状態ルーティングをサポートするのに必要な拡張子を指定します。この概念をサポートするいくつかの部分が含まれますが、このドキュメントでは、IS-ISへの拡張機能について説明します。さらに、タイプ、長さは、このドキュメントで説明する値のペア（のTLV）は、技術固有の拡張IS-ISで定義されている必要に応じて、一般的なレイヤ2の追加、および特定のものされています。私たちは、IS-ISで運ばれた情報を利用する方法を説明するためにこれらのIS-ISの拡張を使用してシステムに任せます。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6165.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6165で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2011 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2011 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Overview ........................................................2\n   1.1. Terminology ................................................3\n2. TLV Enhancements to IS-IS .......................................3\n   2.1. Multi-Topology-Aware Port Capability TLV ...................3\n   2.2. The MAC-Reachability TLV ...................................4\n3. Acknowledgements ................................................5\n4. Security Considerations .........................................5\n5. IANA Considerations .............................................5\n6. References ......................................................6\n   6.1. Normative References .......................................6\n   6.2. Informative References .....................................6",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Overview",
      "section_title": true,
      "ja": "1。概要"
    },
    {
      "indent": 3,
      "text": "There are a number of systems (for example, [RBRIDGES], [802.1aq], and [OTV]) that use Layer-2 addresses carried in a link state routing protocol, specifically Intermediate System to Intermediate System [IS-IS] [RFC1195], to provide true Layer-2 routing. In almost all the technologies mentioned above, classical Layer-2 packets are encapsulated with an outer header. The outer header format varies across all these technologies. This outer header is used to route the encapsulated packets to their destination.",
      "ja": "リンクステートルーティングプロトコルで運ばレイヤ2アドレスを使用するシステム（例えば、[RBRIDGES]、[802.1aq]、および[OTV]）の数、具体的に中間システムは、[ - である]の中間システムに存在しますRFC1195]は、真のレイヤ2ルーティングを提供します。上記ほぼすべての技術では、古典的なレイヤ2パケットは、外部ヘッダでカプセル化されています。外側のヘッダフォーマットは、すべてのこれらの技術を横切って変化します。この外部ヘッダは、その目的地までの経路カプセル化されたパケットのために使用されます。"
    },
    {
      "indent": 3,
      "text": "Each Intermediate System (IS) advertises one or more IS-IS Link State Protocol Data Units (PDUs) with routing information. Each Link State PDU (LSP) is composed of a fixed header and a number of tuples, each consisting of a Type, a Length, and a Value. Such tuples are commonly known as TLVs. In this document, we specify a set of TLVs to be added to [IS-IS] PDUs, to support these proposed systems. The TLVs are generic Layer-2 additions, and specific ones, as needed, are defined in the IS-IS technology-specific extensions. This document does not propose any new forwarding mechanisms using this additional information carried within IS-IS.",
      "ja": "各中間システム（IS）は、ルーティング情報を持つ1つ以上のIS-ISリンクステートプロトコルデータユニット（PDU）をアドバタイズします。各リンク状態PDU（LSP）は、それぞれがタイプ、長さ、および値からなる、固定ヘッダとタプルの数で構成されています。このようなタプルは一般のTLVとして知られています。この文書では、我々はこれらの提案されたシステムをサポートするために、[IS-IS]のPDUに追加するのTLVのセットを指定します。 TLVが、一般的なレイヤ2の加算であり、具体的なものは、必要に応じて、IS-IS技術固有の拡張で定義されています。この文書では、IS-ISの中に運ばこの追加情報を使用して、任意の新しい転送メカニズムを提案していません。"
    },
    {
      "indent": 0,
      "text": "1.1. Terminology",
      "section_title": true,
      "ja": "1.1。用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "ja": "この文書のキーワード \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", および \"OPTIONAL\" はRFC 2119 [RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. TLV Enhancements to IS-IS",
      "section_title": true,
      "ja": "IS-IS 2. TLVの拡張"
    },
    {
      "indent": 3,
      "text": "This section specifies the enhancements for the TLVs that are needed in common by Layer-2 technologies.",
      "ja": "このセクションでは、レイヤ2の技術で共通に必要とされているのTLVのための拡張機能を指定します。"
    },
    {
      "indent": 0,
      "text": "2.1. Multi-Topology-Aware Port Capability TLV",
      "section_title": true,
      "ja": "2.1。マルチトポロジ対応ポート機能TLV"
    },
    {
      "indent": 3,
      "text": "The Multi-Topology-aware Port Capability (MT-PORT-CAP) is IS-IS TLV type 143 and has the following format:",
      "ja": "マルチトポロジ対応ポート機能（MT-PORT-CAP）があるTLVタイプ143 IS-ISとの形式は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "+-+-+-+-+-+-+-+-+\n| Type=MTPORTCAP|                  (1 byte)\n+-+-+-+-+-+-+-+-+\n|   Length      |                  (1 byte)\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|R|R|R|R|  Topology Identifier  |  (2 bytes)\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                sub-TLVs         (variable bytes)              |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "o Type: TLV Type, set to MT-PORT-CAP TLV 143.",
      "ja": "Oタイプ：TLVタイプ、MT-PORT-CAP TLV 143に設定します。"
    },
    {
      "indent": 3,
      "text": "o Length: Total number of bytes contained in the value field, including the length of the sub-TLVs carried in this TLV.",
      "ja": "O長さ：サブのTLVの長さを含む値フィールドに含まれるバイトの総数は、このTLVで運ばれます。"
    },
    {
      "indent": 3,
      "text": "o R: Reserved 4 bits, MUST be sent as zero and ignored on receipt.",
      "ja": "R O：4ビットを予約、ゼロとして送られて、領収書の上で無視しなければなりません。"
    },
    {
      "indent": 3,
      "text": "o Topology Identifier: MT ID is a 12-bit field containing the MT ID of the topology being announced. This field when set to zero implies that it is being used to carry base topology information.",
      "ja": "トポロジ識別子（O）MT IDが発表されているトポロジーのMT IDを含む12ビットのフィールドです。ゼロに設定され、このフィールドは、ベース・トポロジ情報を運ぶために使用されていることを意味します。"
    },
    {
      "indent": 3,
      "text": "o Sub-TLVs: The MT-PORT-CAP TLV value contains sub-TLVs formatted as described in [RFC5305]. They are defined in the technology-specific documents.",
      "ja": "サブのTLV（O）MT-PORT-CAP TLV値は、[RFC5305]に記載されているようにフォーマットされたサブTLVを含んでいます。これらは、技術固有の文書で定義されています。"
    },
    {
      "indent": 3,
      "text": "The MT-PORT-CAP TLV may occur multiple times and is carried within an IS-IS Hello (IIH) PDU.",
      "ja": "MT-PORT-CAP TLVは、複数回発生する可能性があり、およびIS-ISハロー（IIH）PDUの中で運ばれます。"
    },
    {
      "indent": 0,
      "text": "2.2. The MAC-Reachability TLV",
      "section_title": true,
      "ja": "2.2。 MAC-到達可能性TLV"
    },
    {
      "indent": 3,
      "text": "The MAC-Reachability (MAC-RI) TLV is IS-IS TLV type 147 and has the following format:",
      "ja": "MAC-到達可能性（MAC-RI）TLV TLVタイプ147-IS、次の形式を有します。"
    },
    {
      "indent": 3,
      "text": "+-+-+-+-+-+-+-+-+\n| Type= MAC-RI  |                  (1 byte)\n+-+-+-+-+-+-+-+-+\n|   Length      |                  (1 byte)\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|   Topology-id/Nickname        |  (2 bytes)\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|   Confidence  |                  (1 byte)\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|  RESV |      VLAN-ID          |  (2 bytes)\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-...+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                          MAC (1)       (6 bytes)                 |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-...+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                      .................                           |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-...+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                          MAC (N)       (6 bytes)                 |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-...+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "o Type: TLV Type, set to 147 (MAC-RI).",
      "ja": "O型：TLVタイプ、147に設定し（MAC-RI）。"
    },
    {
      "indent": 3,
      "text": "o Length: Total number of bytes contained in the value field given by 5 + 6*n bytes.",
      "ja": "O長さ：5 + 6 * nバイトで指定された値のフィールドに含まれるバイトの合計数。"
    },
    {
      "indent": 3,
      "text": "o Topology-id/Nickname : Depending on the technology in which it is used, this carries the topology-id or nickname. When this field is set to zero, this implies that the Media Access Control (MAC) addresses are reachable across all topologies or across all nicknames of the originating IS.",
      "ja": "トポロジ-ID /ニックネームO：それが使用される技術に応じて、これはトポロジ-IDまたはニックネームを運びます。このフィールドがゼロに設定されている場合、これは、メディアアクセス制御（MAC）アドレスは、すべてのトポロジ全体またはIS発信元のすべてのニックネーム間で到達可能であることを意味します。"
    },
    {
      "indent": 3,
      "text": "o Confidence: This carries an 8-bit quantity indicating the confidence level in the MAC addresses being transported. Whether this field is used, and its semantics if used, are further defined by the specific protocol using Layer-2 IS-IS. If not used, it MUST be set to zero on transmission and be ignored on receipt.",
      "ja": "信頼○：これは、搬送されるMACアドレスの信頼レベルを示す8ビットの量を運びます。使用している場合、このフィールドは使用されており、その意味論されているかどうか、さらにレイヤ2 IS-IS使用して、特定のプロトコルによって定義されています。使用されていない場合は、送信時にゼロに設定しなければならなくて、領収書の上で無視されます。"
    },
    {
      "indent": 3,
      "text": "o RESV: (4 bits) MUST be sent as zero and ignored on receipt.",
      "ja": "O RESV：（4ビット）はゼロとして送信され、受信時に無視しなければなりません。"
    },
    {
      "indent": 3,
      "text": "o VLAN-ID: This carries a 12-bit VLAN identifier that is valid for all subsequent MAC addresses in this TLV, or the value zero if no VLAN is specified.",
      "ja": "VLAN-ID○：VLANが指定されていない場合、これは、このTLV内のすべての後続のMACアドレスのために有効である12ビットのVLAN識別子を運ぶ、または値ゼロ。"
    },
    {
      "indent": 3,
      "text": "o MAC(i): This is the 48-bit MAC address reachable from the IS that is announcing this TLV.",
      "ja": "O MAC（I）：これはこのTLVを発表しているISから到達可能な48ビットのMACアドレスです。"
    },
    {
      "indent": 3,
      "text": "The MAC-RI TLV is carried in a standard Link State PDU (LSP). This TLV can be carried multiple times in an LSP and in multiple LSPs. It MUST contain only unicast addresses. The manner in which these TLVs are generated by the various Layer-2 routing technologies and the manner in which they are consumed are detailed in the technology-specific documents.",
      "ja": "MAC-RI TLVは、標準的なリンク状態PDU（LSP）に搬送されます。このTLVは、LSPにし、複数のLSPに複数回実施することができます。それが唯一のユニキャストアドレスを含まなければなりません。これらのTLVは、さまざまなレイヤ2のルーティング技術と、彼らが消費される方法によって生成される方法は、技術固有の文書に詳述されています。"
    },
    {
      "indent": 3,
      "text": "In most of the technologies, these MAC-RI TLVs will translate to populating the hardware with these entries and with appropriate next-hop information as derived from the advertising IS.",
      "ja": "技術のほとんどでは、これらのMAC-RIのTLVは、これらのエントリとし、IS広告から得られるように、適切なネクストホップ情報とハードウェアを移入に変換します。"
    },
    {
      "indent": 0,
      "text": "3. Acknowledgements",
      "section_title": true,
      "ja": "3.謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Peter Ashwood-Smith, Donald E. Eastlake 3rd, Dino Farinacci, Don Fedyk, Les Ginsberg, Radia Perlman, Mike Shand, and Russ White for their useful comments.",
      "ja": "作者は彼らの役に立つコメントをピーター・アッシュウッド・スミス、ドナルドE.イーストレイク3日、ディノファリナッチ、ドンFedyk、レ・ギンズバーグ、ラディア・パールマン、マイク・シャンド、およびラスホワイトに感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "This document adds no additional security risks to IS-IS, nor does it provide any additional security for IS-IS.",
      "ja": "この文書では、IS-ISには追加のセキュリティリスクを追加していない、またそれは、IS-ISのための任意の追加のセキュリティを提供しません。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "ja": "5. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document specifies the definition of a set of new IS-IS TLVs -- the Port-Capability TLV (type 143) and the MAC-Reachability TLV (type 147). They are listed in the IS-IS TLV codepoint registry.",
      "ja": "ポート機能TLV（タイプ143）とMAC-到達性TLV（タイプ147） - この文書は、新しいののTLV-ISのセットの定義を指定します。これらは、IS-IS TLVコードポイントレジストリに記載されています。"
    },
    {
      "indent": 3,
      "text": " IIH LSP SNP MT-Port-Cap-TLV (143) X - - MAC-RI TLV (147) - X -",
      "ja": "IIH LSP SNP MT-ポートキャップ-TLV（143）X  -   -  MAC-RI TLV（147） -  X  - "
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "ja": "6.参照"
    },
    {
      "indent": 0,
      "text": "6.1. Normative References",
      "section_title": true,
      "ja": "6.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[IS-IS] ISO/IEC 10589:2002, Second Edition, \"Intermediate System to Intermediate System Intra-Domain Routing Information Exchange Protocol for use in Conjunction with the Protocol for Providing the Connectionless-mode Network Service (ISO 8473)\", 2002.",
      "ja": "[IS-IS] ISO / IEC 10589：2002、第2版、「中間システム中間システムドメイン内にルーティング情報交換プロトコル（ISO 8473）接続モード・ネットワーク・サービスを提供するための議定書と併せて使用するために」、2002 。"
    },
    {
      "indent": 3,
      "text": "[RFC1195] Callon, R., \"Use of OSI IS-IS for routing in TCP/IP and dual environments\", RFC 1195, December 1990.",
      "ja": "[RFC1195] Callon、R.は、RFC 1195、1990年12月 \"OSIの使用は、TCP / IPやデュアル環境でのルーティングのためIS-IS\"。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC5305] Li, T. and H. Smit, \"IS-IS Extensions for Traffic Engineering\", RFC 5305, October 2008.",
      "ja": "[RFC5305]李、T.とH.スミットは、RFC 5305、2008年10月 \"トラフィックエンジニアリングのための拡張機能-IS IS\"。"
    },
    {
      "indent": 0,
      "text": "6.2. Informative References",
      "section_title": true,
      "ja": "6.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[802.1aq] \"Standard for Local and Metropolitan Area Networks / Virtual Bridged Local Area Networks / Amendment 8: Shortest Path Bridging, Draft IEEE P802.1aq/D1.5\", 2008.",
      "ja": "[802.1aq]「ローカルおよびメトロポリタンエリアネットワーク/仮想ブリッジローカルエリアネットワーク/修正8のための標準：最短パスブリッジ、ドラフトIEEE P802.1aq / D1.5」、2008年。"
    },
    {
      "indent": 3,
      "text": "[OTV] Grover, H., Rao, D., and D. Farinacci, \"Overlay Transport Virtualization\", Work in Progress, October 2010.",
      "ja": "[OTV]グローバー、H.、ラオ、D.、およびD.ファリナッチ、 \"オーバーレイ交通仮想化\"、進歩、2010年10月の作業。"
    },
    {
      "indent": 3,
      "text": "[RBRIDGES] Perlman, R., Eastlake 3rd, D., Dutt, D., Gai, S., and A. Ghanwani, \"RBridges: Base Protocol Specification\", Work in Progress, March 2010.",
      "ja": "[RBRIDGES]パールマン、R.、イーストレイク3日、D.、ダット、D.、ガイ、S.、およびA. Ghanwani、 \"RBridges：基本プロトコル仕様\"、進歩、2010年3月での作業。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Ayan Banerjee Cisco Systems 170 W. Tasman Drive San Jose, CA 95138 USA",
      "ja": "アヤンバネルジーシスコシステムズ170 W.タスマン・ドライブサンノゼ、CA 95138 USA"
    },
    {
      "indent": 3,
      "text": "EMail: ayabaner@cisco.com",
      "ja": "メールアドレス：ayabaner@cisco.com"
    },
    {
      "indent": 3,
      "text": "David Ward Juniper Networks 1194 N. Mathilda Ave. Sunnyvale, CA 94089-1206 USA",
      "ja": "デビッド・ウォードジュニパーネットワークスの1194 N.マチルダアベニュー。サニーベール、CA 94089-1206 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1-408-745-2000 EMail: dward@juniper.net",
      "ja": "電話：+ 1-408-745-2000 Eメール：dward@juniper.net"
    }
  ]
}