{
  "title": {
    "text": "RFC 6882 - Support for Resource Reservation Protocol Traffic Engineering (RSVP-TE) in Layer 3 Virtual Private Networks (L3VPNs)",
    "ja": "RFC 6882 - レイヤでのリソース予約プロトコルトラフィックエンジニアリング（RSVP-TE）のサポート3個の仮想プライベートネットワーク（L3VPNs）"
  },
  "number": 6882,
  "created_at": "2019-11-01 03:26:25.331191+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                    K. Kumaki, Ed.\nRequest for Comments: 6882                              KDDI Corporation\nCategory: Experimental                                          T. Murai\nISSN: 2070-1721                          Furukawa Network Solution Corp.\n                                                                D. Cheng\n                                                     Huawei Technologies\n                                                           S. Matsushima\n                                                        Softbank Telecom\n                                                                P. Jiang\n                                                        KDDI Corporation\n                                                              March 2013",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Support for Resource Reservation Protocol Traffic Engineering (RSVP-TE) in Layer 3 Virtual Private Networks (L3VPNs)",
      "ja": "レイヤでのリソース予約プロトコルトラフィックエンジニアリング（RSVP-TE）のサポート3個の仮想プライベートネットワーク（L3VPNs）"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "IP Virtual Private Networks (VPNs) provide connectivity between sites across an IP/MPLS backbone. These VPNs can be operated using BGP/MPLS, and a single Provider Edge (PE) node may provide access to multiple customer sites belonging to different VPNs.",
      "ja": "IP仮想プライベートネットワーク（VPN）は、IP / MPLSバックボーン全体でサイト間の接続を提供します。これらのVPNは、BGP / MPLSを使用して操作することができ、単一のプロバイダエッジ（PE）ノードは、異なるVPNに属する複数の顧客サイトへのアクセスを提供することができます。"
    },
    {
      "indent": 3,
      "text": "The VPNs may support a number of customer services, including RSVP and Resource Reservation Protocol Traffic Engineering (RSVP-TE) traffic. This document describes how to support RSVP-TE between customer sites when a single PE supports multiple VPNs and labels are not used to identify VPNs between PEs.",
      "ja": "VPNは、RSVPとリソース予約プロトコルトラフィックエンジニアリング（RSVP-TE）トラフィックを含む顧客サービスの数をサポートすることができます。この文書では、単一のPEが複数のVPNをサポートし、ラベルがPE間のVPNを識別するために使用されていないとき、顧客サイトの間でRSVP-TEをサポートする方法について説明します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for examination, experimental implementation, and evaluation.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、検査、実験的な実装、および評価のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document defines an Experimental Protocol for the Internet community. This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "この文書は、インターネットコミュニティのためにExperimentalプロトコルを定義します。このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 IESGによって承認されていないすべての文書がインターネットStandardのどんなレベルの候補です。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6882.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6882で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2013 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2013 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n   1.1. Conventions ................................................3\n2. Motivation ......................................................4\n   2.1. Network Example ............................................4\n3. Protocol Extensions and Procedures ..............................5\n   3.1. Object Definitions .........................................5\n        3.1.1. LSP_TUNNEL_VPN-IPv4 and LSP_TUNNEL_VPN-IPv6\n               SESSION Object ......................................6\n        3.1.2. LSP_TUNNEL_VPN-IPv4 and LSP_TUNNEL_VPN-IPv6\n               SENDER_TEMPLATE .....................................7\n        3.1.3. LSP_TUNNEL_VPN-IPv4 and LSP_TUNNEL_VPN-IPv6\n               FILTER_SPEC Objects .................................9\n        3.1.4. VPN-IPv4 and VPN-IPv6 RSVP_HOP Objects ..............9\n   3.2. Handling the Messages ......................................9\n        3.2.1. Path Message Processing at the Ingress PE ...........9\n        3.2.2. Path Message Processing at the Egress PE ...........10\n        3.2.3. Resv Processing at the Egress PE ...................11\n        3.2.4. Resv Processing at the Ingress PE ..................11\n        3.2.5. Other RSVP Messages ................................12\n4. Management Considerations ......................................12\n   4.1. Impact on Network Operation ...............................12\n5. Security Considerations ........................................13\n6. References .....................................................13\n   6.1. Normative References ......................................13\n   6.2. Informative References ....................................13\n7. Acknowledgments ................................................14\n8. Contributors ...................................................14",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "Service Providers would like to use BGP/MPLS IP VPNs [RFC4364] to support connections between Customer Edge (CE) sites. As described in [RFC5824], these connections can be MPLS Traffic Engineered (TE) Label Switched Paths (LSPs) established using extensions to RSVP [RFC3209] for a number of different deployment scenarios. The requirements for supporting MPLS-TE LSP connections across BGP/MPLS IP VPNs are documented in [RFC5824].",
      "ja": "サービスプロバイダーは、カスタマーエッジ（CE）サイト間の接続をサポートするために、BGP / MPLS IP VPNの[RFC4364]を使用したいと思います。 [RFC5824]に記載されているように、これらの接続は、MPLSトラヒックエンジニアリング（TE）ラベル（LSPを）パスを切り替えることができるさまざまな展開シナリオの数は[RFC3209]をRSVPの拡張機能を使用して確立しました。 BGP / MPLS IP VPNを横切ってMPLS-TE LSPの接続をサポートするための要件は、[RFC5824]に記載されています。"
    },
    {
      "indent": 3,
      "text": "In order to establish a customer MPLS-TE LSP over a BGP/MPLS IP VPN, it is necessary for the RSVP-TE control messages, including the Path and Resv messages described in [RFC3209], to be handled appropriately by the Provider Edge (PE) routers. [RFC4364] allows RSVP messages sent within a VPN's context to be handled just like any other VPN data. In such a solution, the RSVP-TE component at a PE that sends messages toward a remote PE must process the messages in the context of the VPN and must ensure that the messages are correctly labeled. Similarly, when a message sent across the core is received by a PE, both labels must indicate the correct VPN context.",
      "ja": "BGP / MPLS IP VPN上の顧客MPLS-TE LSPを確立するためには、[RFC3209]に記載のパスとRESVメッセージ、プロバイダエッジによって適切に処理されるなど、RSVP-TE制御メッセージのために必要です（ PE）ルータ。 [RFC4364]はVPNのコンテキスト内で送信されたRSVPメッセージがちょうど他のVPNのデータと同様に扱うことを可能にします。そのような解決策では、リモートPEに向けてメッセージを送信するPEでRSVP-TE成分は、VPNのコンテキストでメッセージを処理しなければならないし、メッセージが正しくラベル付けされていることを確認しなければなりません。コアを介して送信されるメッセージがPEによって受信されると同様に、両方のラベルが正しいVPNコンテキストを示さなければなりません。"
    },
    {
      "indent": 3,
      "text": "Implementation of the standards-based solution described in the previous paragraph is possible, but requires proper support on the PE. In particular, a PE must be able to process RSVP messages within the context of the appropriate VPN Routing and Forwarding (VRF). This may be easy to achieve in some implementations, but in others, it is not so easy.",
      "ja": "前の段落で説明した標準ベースのソリューションの実装が可能ですが、PE上の適切なサポートが必要です。具体的には、PEは、適切なVPNルーティングおよび転送（VRF）のコンテキスト内でRSVPメッセージを処理することができなければなりません。これは、いくつかの実装で実現するのは簡単かもしれないが、他の人には、それはそう簡単ではありません。"
    },
    {
      "indent": 3,
      "text": "This document defines experimental formats and mechanisms that follow a different approach. The documented approach enables the VPN identifier to be carried in the RSVP-TE protocol message so that there is no requirement for label-based VRF identification on the PE.",
      "ja": "この文書は、実験のフォーマットと異なるアプローチに従うメカニズムを定義します。文書化されたアプローチは、PEでラベルベースのVRFを同定するための要件が​​ないように、VPN識別子はRSVP-TEプロトコルメッセージで搬送されることを可能にします。"
    },
    {
      "indent": 3,
      "text": "The experiment proposed by this document does not negate the label-based approach supported by [RFC4364]. The experiment is intended to enable research into alternate methods of supporting RSVP-TE within VPNs.",
      "ja": "この文書で提案した実験では、[RFC4364]でサポートされているラベルベースのアプローチを否定するものではありません。実験のVPN内のRSVP-TEをサポートする別の方法の研究を可能にすることを意図しています。"
    },
    {
      "indent": 0,
      "text": "1.1. Conventions",
      "section_title": true,
      "ja": "1.1. 表記"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "ja": "この文書のキーワード \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", および \"OPTIONAL\" はRFC 2119 [RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. Motivation",
      "section_title": true,
      "ja": "2.動機"
    },
    {
      "indent": 3,
      "text": "If multiple BGP/MPLS IP VPNs are supported at the same PE, new RSVP-TE extensions are required so that RSVP-TE control messages from the CEs can be handled appropriately by the PE.",
      "ja": "複数のBGP / MPLSのIP VPNが同じPEにサポートされている場合のCEからのRSVP-TE制御メッセージがPEによって適切に処理できるように、新しいRSVP-TEの拡張が必要です。"
    },
    {
      "indent": 0,
      "text": "2.1. Network Example",
      "section_title": true,
      "ja": "2.1. ネットワークの例"
    },
    {
      "indent": 3,
      "text": "Figure 1 (\"Customer MPLS TE LSPs in the context of BGP/MPLS IP VPNs\") shows two VPNs supported by a core IP/MPLS network. Both VPNs have customer sites on the two PEs shown in the figure. The customer sites operate MPLS-TE LSPs.",
      "ja": "図1は、（「BGP / MPLS IP VPNの文脈におけるカスタマーMPLS TEのLSP」）コアIP / MPLSネットワークでサポートされている2つのVPNを示しています。どちらのVPNは、図に示す2つのPE上の顧客サイトを持っています。顧客サイトは、MPLS-TEのLSPを動作させます。"
    },
    {
      "indent": 3,
      "text": "Here, we make the following set of assumptions:",
      "ja": "ここでは、仮定の次のセットを行います。"
    },
    {
      "indent": 3,
      "text": "o VPN1 and VPN2 are for different customers. o CE1 and CE3 are head-end routers. o CE2 and CE4 are tail-end routers. o The same address (e.g., 192.0.2.1) is assigned at CE2 and CE4.",
      "ja": "O VPN1とVPN2は、さまざまな顧客のためのものです。 O CE1とCE3はヘッドエンドルータです。 O CE2及びCE4は、テールエンドルータです。 O同一のアドレス（例えば、192.0.2.1）をCE2及びCE4に割り当てられます。"
    },
    {
      "indent": 8,
      "text": "<--------Customer MPLS-TE LSP for VPN1-------->",
      "raw": true
    },
    {
      "indent": 6,
      "text": ".......                                        .......\n. --- .    ---      ---       ---      ---     . --- .\n.|CE1|----|PE1|----|P1 |-----|P2 |----|PE2|-----|CE2|.\n. --- .    ---      ---       ---      ---     . --- .\n.......     |                           |      .......\n(VPN1)      |                           |      (VPN1)\n            |                           |\n.......     |                           |      .......\n. --- .     |                           |      . --- .\n.|CE3|------+                           +-------|CE4|.\n. --- .                                        . --- .\n.......                                        .......\n(VPN2)                                         (VPN2)",
      "raw": true
    },
    {
      "indent": 8,
      "text": "<--------Customer MPLS-TE LSP for VPN2-------->\n          ^                           ^\n          |                           |\n     VRF instance                VRF instance",
      "raw": true
    },
    {
      "indent": 6,
      "text": "<-Customer->    <---BGP/MPLS IP VPN--->   <-Customer->\n   network                                   network",
      "raw": true
    },
    {
      "indent": 6,
      "text": "Figure 1: Customer MPLS TE LSPs in the context of BGP/MPLS IP VPNs",
      "ja": "図1：BGP / MPLS IP VPNのコンテキストで顧客MPLS TEのLSP"
    },
    {
      "indent": 6,
      "text": "Consider that customers in VPN1 and VPN2 would like to establish customer MPLS-TE LSPs between their sites (i.e., between CE1 and CE2, and between CE3 and CE4). In this situation, the following RSVP-TE Path messages would be sent:",
      "ja": "VPN1とVPN2の顧客は（すなわち、CE1とCE2の間、およびCE3とCE4間の）自分のサイト間の顧客のMPLS-TEのLSPを確立したいと考えてみましょう。このような状況では、以下のRSVP-TE Pathメッセージが送信されます。"
    },
    {
      "indent": 6,
      "text": "1. CE1 would send a Path message to PE1 to establish the MPLS-TE LSP (VPN1) between CE1 and CE2.",
      "ja": "1. CE1は、CE1とCE2の間のMPLS-TE LSP（VPN1）を確立するために、PE1にPathメッセージを送信することになります。"
    },
    {
      "indent": 6,
      "text": "2. CE3 would also send a Path message to PE1 to establish the MPLS-TE LSP (VPN2) between CE1 and CE2.",
      "ja": "2. CE3はまた、CE1とCE2の間のMPLS-TE LSP（VPN2）を確立するために、PE1にPathメッセージを送信することになります。"
    },
    {
      "indent": 3,
      "text": "After receiving each Path message, PE1 can identify the customer context for each Path message from the incoming interface over which the message was received. PE1 forwards the messages to PE2 using the routing mechanisms described in [RFC4364] and [RFC4659].",
      "ja": "各Pathメッセージを受信した後、PE1は、メッセージを受信した上着信インターフェイスから各Pathメッセージに対する顧客のコンテクストを識別することができます。 PE1は、[RFC4364]及び[RFC4659]に記載のルーティングメカニズムを使用して、PE2へメッセージを転送します。"
    },
    {
      "indent": 3,
      "text": "When the Path messages are received at PE2, that node needs to distinguish the messages and determine which applies to VPN1 and which to VPN2 so that the right forwarding state can be established and so that the messages can be passed on to the correct CE. Although the messages arrive at PE2 with an MPLS label that identifies the VPN, the messages are delivered to the RSVP-TE component on PE2, and the context of the core VPN LSP (i.e., the label) is lost. Some RSVP-TE protocol mechanism is therefore needed to embed the VPN identifier within the RSVP-TE message.",
      "ja": "PathメッセージをPE2で受信される場合、そのノードは、メッセージを識別し、正しい転送状態を確立することができ、メッセージが正しいCEに渡すことができるようにようにVPN2にVPN1に適用されるかを決定する必要があります。メッセージはVPNを識別するMPLSラベルとPE2に到着するが、メッセージがPE2にRSVP-TEコンポーネントに配信され、そしてコアVPN LSP（すなわち、標識）のコンテキストが失われます。いくつかのRSVP-TEプロトコル機構従ってRSVP-TEメッセージ内のVPN識別子を埋め込むために必要とされます。"
    },
    {
      "indent": 3,
      "text": "Similarly, Resv messages sent from PE2 to PE1 need an RSVP-TE mechanism to assign them to the correct VPN.",
      "ja": "同様に、PE1とPE2から送信されたResvメッセージは正しいVPNに割り当てるためのRSVP-TEの機構を必要とします。"
    },
    {
      "indent": 0,
      "text": "3. Protocol Extensions and Procedures",
      "section_title": true,
      "ja": "3.プロトコル拡張と手続き"
    },
    {
      "indent": 3,
      "text": "This section defines the additional RSVP-TE objects to meet the requirements described in Section 2. These objects are new variants of the SESSION, SENDER_TEMPLATE, and FILTERSPEC objects. They act as identifiers and allow PEs to distinguish Path/Resv messages per VPN in the context of BGP/MPLS IP VPNs. Section 3.1 defines the new object types, and Section 3.2 defines the specific procedures for handling RSVP messages.",
      "ja": "このセクションでは、これらのオブジェクトは、SESSION、SENDER_TEMPLATE、およびFILTERSPECオブジェクトの新しい変異体である第2節で説明した要件を満たすために、追加のRSVP-TEオブジェクトを定義します。彼らは、識別子として機能し、PEがBGP / MPLS IP VPNのコンテキストでVPNあたりのパス/ RESVメッセージを区別することができます。 3.1節では、新しいオブジェクトタイプを定義し、3.2節はRSVPメッセージを処理するための具体的な手順を定義します。"
    },
    {
      "indent": 0,
      "text": "3.1. Object Definitions",
      "section_title": true,
      "ja": "3.1. オブジェクト定義"
    },
    {
      "indent": 3,
      "text": "This experiment will be carried out using the following private Class Types. This document identifies these Class Types as \"C-Type = EXPn\".",
      "ja": "この実験は、次のプライベートクラスの型を使用して実行されます。この文書では、「C-タイプ= EXPN」としてこれらのクラスの型を識別します。"
    },
    {
      "indent": 3,
      "text": "Class = SESSION, LSP_TUNNEL_VPN-IPv4 C-Type = EXP1 Class = SESSION, LSP_TUNNEL_VPN-IPv6 C-Type = EXP2 Class = SENDER_TEMPLATE, LSP_TUNNEL_VPN-IPv4 C-Type = EXP3 Class = SENDER_TEMPLATE, LSP_TUNNEL_VPN-IPv6 C-Type = EXP4 Class = FILTER SPECIFICATION, LSP_TUNNEL_VPN-IPv4 C-Type = EXP5 Class = FILTER SPECIFICATION, LSP_TUNNEL_VPN-IPv6 C-Type = EXP6",
      "ja": "クラス= SESSION、LSP_TUNNEL_VPN-IPv4のC型= EXP1クラス= SESSION、LSP_TUNNEL_VPN-IPv6のC型= EXP2クラス= SENDER_TEMPLATE、LSP_TUNNEL_VPN-IPv4のC型= EXP3クラス= SENDER_TEMPLATE、LSP_TUNNEL_VPN-IPv6のC型= EXP4クラス=フィルタ仕様、LSP_TUNNEL_VPN-IPv4のC型= EXP5クラス=フィルタ仕様、LSP_TUNNEL_VPN-IPv6のCタイプ= EXP6"
    },
    {
      "indent": 0,
      "text": "3.1.1. LSP_TUNNEL_VPN-IPv4 and LSP_TUNNEL_VPN-IPv6 SESSION Object",
      "section_title": true,
      "ja": "3.1.1.  LSP_TUNNEL_VPN-IPv4およびIPv6のLSP_TUNNEL_VPN-Sessionオブジェクト"
    },
    {
      "indent": 3,
      "text": "The LSP_TUNNEL_VPN-IPv4 (or LSP_TUNNEL_VPN-IPv6) SESSION object appears in RSVP-TE messages that ordinarily contain a SESSION object and that are sent between the ingress PE and egress PE in either direction. This object MUST NOT be included in any RSVP-TE message that is sent outside of the provider's backbone.",
      "ja": "LSP_TUNNEL_VPN-のIPv4（またはLSP_TUNNEL_VPN-IPv6）のセッション・オブジェクトは、通常、いずれかの方向に入口PEと出口PE間で送信されるセッションオブジェクトを含み、RSVP-TEメッセージに表示されます。このオブジェクトは、プロバイダのバックボーンの外に送信されるすべてのRSVP-TEメッセージに含まれてはなりません。"
    },
    {
      "indent": 3,
      "text": "The LSP_TUNNEL_VPN-IPv6 SESSION object is analogous to the LSP_TUNNEL_VPN-IPv4 SESSION object, using a VPN-IPv6 address ([RFC4659]) instead of a VPN-IPv4 address ([RFC4364]).",
      "ja": "LSPトンネルVPN-IPv6のセッションオブジェクトは、VPN-IPv6アドレス（[RFC4659]）の代わりに、VPN-IPv4アドレス（[RFC4364]）を使用して、LSPトンネルVPN-IPv4のセッションオブジェクトに類似しています。"
    },
    {
      "indent": 3,
      "text": "Experimenters MUST ensure that there is no conflict between the private Class Types used for this experiment and other Class Types used by the PEs.",
      "ja": "実験者は、PESによって使用されるこの実験および他のクラスの型のために使用するプライベートクラスの型との間に競合がないことを保証しなければなりません。"
    },
    {
      "indent": 3,
      "text": "The formats of the SESSION objects are as follows:",
      "ja": "次のようにセッションオブジェクトの形式は次のとおりです。"
    },
    {
      "indent": 5,
      "text": "Class = SESSION, LSP_TUNNEL_VPN-IPv4 C-Type = EXP1",
      "ja": "クラス= SESSION、LSP_TUNNEL_VPN-IPv4のCタイプ= EXP1"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                                                               |\n+                                                               +\n|            VPN-IPv4 Tunnel Endpoint Address (12 bytes)        |\n+                                                               +\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|  MUST be zero                 |      Tunnel ID                |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                       Extended Tunnel ID                      |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 5,
      "text": "Class = SESSION, LSP_TUNNEL_VPN-IPv6 C-Type = EXP2",
      "ja": "クラス= SESSION、LSP_TUNNEL_VPN-IPv6のC-タイプ= EXP2"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                                                               |\n+                                                               +\n|                                                               |\n+                                                               +\n|                                                               |\n+       VPN-IPv6 Tunnel Endpoint Address (24 bytes)             +\n|                                                               |\n+                                                               +\n|                                                               |\n+                                                               +\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|  MUST be zero                 |      Tunnel ID                |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                                                               |\n+                                                               +\n|                                                               |\n+                  Extended Tunnel ID (16 bytes)                +\n|                                                               |\n+                                                               +\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The VPN-IPv4 or VPN-IPv6 tunnel endpoint address field contains an address of the VPN-IPv4 or VPN-IPv6 address family encoded as specified in [RFC4364] or [RFC4659], respectively.",
      "ja": "VPN-IPv4またはVPN-IPv6のトンネルエンドポイントアドレスフィールドは、それぞれ、[RFC4364]または[RFC4659]で指定されるように符号化されたVPN-IPv4またはVPN-IPv6のアドレスファミリのアドレスを含みます。"
    },
    {
      "indent": 3,
      "text": "The Tunnel ID and Extended Tunnel ID are identical to the same fields in the LSP_TUNNEL_IPv4 and LSP_TUNNEL_IPv6 SESSION objects as per [RFC3209].",
      "ja": "トンネルIDと拡張トンネルIDは、[RFC3209]の通りLSP_TUNNEL_IPv4とLSP_TUNNEL_IPv6 SESSIONオブジェクト内の同じフィールドと同じです。"
    },
    {
      "indent": 0,
      "text": "3.1.2. LSP_TUNNEL_VPN-IPv4 and LSP_TUNNEL_VPN-IPv6 SENDER_TEMPLATE Objects",
      "ja": "3.1.2.  LSP_TUNNEL_VPN-IPv4およびIPv6のLSP_TUNNEL_VPN-SENDER_TEMPLATEオブジェクト"
    },
    {
      "indent": 3,
      "text": "The LSP_TUNNEL_VPN-IPv4 (or LSP_TUNNEL_VPN-IPv6) SENDER_TEMPLATE object appears in RSVP-TE messages that ordinarily contain a SENDER_TEMPLATE object and that are sent between ingress PE and egress PE in either direction, such as Path, PathError, and PathTear messages. The object MUST NOT be included in any RSVP-TE messages that are sent outside of the provider's backbone.",
      "ja": "LSP_TUNNEL_VPN-のIPv4（またはLSP_TUNNEL_VPN-IPv6）のSENDER_TEMPLATEオブジェクトは、通常SENDER_TEMPLATEオブジェクトが含まれており、そのようなパス、PathError、及びPathTearメッセージとして、いずれかの方向に入口PEと出口PE間で送信されるRSVP-TEメッセージに表示されます。オブジェクトは、プロバイダのバックボーンの外に送信されるすべてのRSVP-TEのメッセージに含めることはできません。"
    },
    {
      "indent": 3,
      "text": "The format of the object is as follows:",
      "ja": "次のようにオブジェクトの形式は次のとおりです。"
    },
    {
      "indent": 5,
      "text": "Class = SENDER_TEMPLATE, LSP_TUNNEL_VPN-IPv4 C-Type = EXP3",
      "ja": "クラス= SENDER_TEMPLATE、LSP_TUNNEL_VPN-IPv4のCタイプ= EXP3"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                                                               |\n+                                                               +\n|            VPN-IPv4 Tunnel Sender Address (12 bytes)          |\n+                                                               +\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|  MUST be zero                 |            LSP ID             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 5,
      "text": "Class = SENDER_TEMPLATE, LSP_TUNNEL_VPN-IPv6 C-Type = EXP4",
      "ja": "クラス= SENDER_TEMPLATE、LSP_TUNNEL_VPN-IPv6のC-タイプ= EXP4"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                                                               |\n+                                                               +\n|                                                               |\n+                                                               +\n|                                                               |\n+         VPN-IPv6 Tunnel Sender Address (24 bytes)             +\n|                                                               |\n+                                                               +\n|                                                               |\n+                                                               +\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|  MUST be zero                 |            LSP ID             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The VPN-IPv4 or VPN-IPv6 tunnel sender address field contains an address of the VPN-IPv4 or VPN-IPv6 address family encoded as specified in [RFC4364] or [RFC4659], respectively.",
      "ja": "VPN-IPv4またはVPN-のIPv6トンネルの送信元アドレスフィールドは、それぞれ、[RFC4364]または[RFC4659]で指定されるように符号化されたVPN-IPv4またはVPN-IPv6のアドレスファミリのアドレスを含みます。"
    },
    {
      "indent": 3,
      "text": "The LSP ID is identical to the LSP ID field in the LSP_TUNNEL_IPv4 and LSP_TUNNEL_IPv6 SENDER_TEMPLATE objects as per [RFC3209].",
      "ja": "LSP IDは、[RFC3209]の通りLSP_TUNNEL_IPv4とLSP_TUNNEL_IPv6 SENDER_TEMPLATEオブジェクト内LSP IDフィールドと同一です。"
    },
    {
      "indent": 0,
      "text": "3.1.3. LSP_TUNNEL_VPN-IPv4 and LSP_TUNNEL_VPN-IPv6 FILTER_SPEC Objects",
      "section_title": true,
      "ja": "3.1.3.  LSP_TUNNEL_VPN-IPv4およびIPv6のLSP_TUNNEL_VPN-FILTER_SPECオブジェクト"
    },
    {
      "indent": 3,
      "text": "The LSP_TUNNEL_VPN-IPv4 (or LSP_TUNNEL_VPN-IPv6) FILTER_SPEC object appears in RSVP-TE messages that ordinarily contain a FILTER_SPEC object and that are sent between ingress PE and egress PE in either direction, such as Resv, ResvError, and ResvTear messages. The object MUST NOT be included in any RSVP-TE messages that are sent outside of the provider's backbone.",
      "ja": "LSP_TUNNEL_VPN-のIPv4（またはLSP_TUNNEL_VPN-IPv6）のFILTER_SPECオブジェクトは、通常FILTER_SPECオブジェクトを含み、そのようなのResv、ResvError、そしてたResvTearメッセージとして、いずれかの方向に入口PEと出口PE間で送信されるRSVP-TEメッセージに表示されます。オブジェクトは、プロバイダのバックボーンの外に送信されるすべてのRSVP-TEのメッセージに含めることはできません。"
    },
    {
      "indent": 3,
      "text": "Class = FILTER SPECIFICATION, LSP_TUNNEL_VPN-IPv4 C-Type = EXP5",
      "ja": "クラス=フィルタ仕様、LSP_TUNNEL_VPN-IPv4のCタイプ= EXP5"
    },
    {
      "indent": 6,
      "text": "The format of the LSP_TUNNEL_VPN-IPv4 FILTER_SPEC object is identical to the LSP_TUNNEL_VPN-IPv4 SENDER_TEMPLATE object.",
      "ja": "LSP_TUNNEL_VPN-IPv4のFILTER_SPECオブジェクトのフォーマットはLSP_TUNNEL_VPN-IPv4のSENDER_TEMPLATEオブジェクトと同一です。"
    },
    {
      "indent": 3,
      "text": "Class = FILTER SPECIFICATION, LSP_TUNNEL_VPN-IPv6 C-Type = EXP6",
      "ja": "クラス=フィルタ仕様、LSP_TUNNEL_VPN-IPv6のC-タイプ= EXP6"
    },
    {
      "indent": 6,
      "text": "The format of the LSP_TUNNEL_VPN-IPv6 FILTER_SPEC object is identical to the LSP_TUNNEL_VPN-IPv6 SENDER_TEMPLATE object.",
      "ja": "LSP_TUNNEL_VPN-IPv6のFILTER_SPECオブジェクトのフォーマットはLSP_TUNNEL_VPN-IPv6のSENDER_TEMPLATEオブジェクトと同一です。"
    },
    {
      "indent": 0,
      "text": "3.1.4. VPN-IPv4 and VPN-IPv6 RSVP_HOP Objects",
      "section_title": true,
      "ja": "3.1.4.  VPN-IPv4およびIPv6のVPN-RSVP_HOPオブジェクト"
    },
    {
      "indent": 3,
      "text": "The formats of the VPN-IPv4 and VPN-IPv6 RSVP_HOP objects are identical to the RSVP_HOP objects described in [RFC6016].",
      "ja": "VPN-IPv4およびIPv6のVPN-RSVP_HOPオブジェクトのフォーマットは、[RFC6016]に記載RSVP_HOPオブジェクトと同一です。"
    },
    {
      "indent": 0,
      "text": "3.2. Handling the Messages",
      "section_title": true,
      "ja": "3.2. メッセージの処理"
    },
    {
      "indent": 3,
      "text": "This section describes how the RSVP-TE messages are handled. Handling of these messages assumes that, in the context of BGP/MPLS IP VPNs, the ingress and egress PEs have RSVP-TE capabilities.",
      "ja": "このセクションでは、RSVP-TEメッセージの処理方法について説明します。これらのメッセージの取り扱いについては、BGP / MPLS IP VPNの文脈で、入力および出力PEはRSVP-TEの能力を持っている、ということを前提としています。"
    },
    {
      "indent": 0,
      "text": "3.2.1. Path Message Processing at the Ingress PE",
      "section_title": true,
      "ja": "3.2.1. 入力PEでパスメッセージ処理"
    },
    {
      "indent": 3,
      "text": "When a Path message arrives at the ingress PE (PE1 in Figure 1), the PE needs to establish suitable Path state and forward the Path message on to the egress PE (PE2 in Figure 1). Below, we describe the message handling process at the ingress PE.",
      "ja": "Pathメッセージは、入口PE（図1のPE1）に到達すると、PEは、適切なパスの状態を確立し、出口PE（図1のPE2）へのPATHメッセージを転送する必要があります。以下では、入力PEでプロセスをメッセージ処理を記述します。"
    },
    {
      "indent": 6,
      "text": "1. CE1 sends a Path message to PE1 to establish the MPLS-TE LSP (VPN1) between CE1 and CE2. The Path message is addressed to the eventual destination (the receiver at the remote customer site) and carries the IP Router Alert option, in accordance with [RFC2205]. The ingress PE must recognize the router alert, intercept these messages, and process them as RSVP-TE signaling messages.",
      "ja": "1. CE1は、CE1とCE2の間のMPLS-TE LSP（VPN1）を確立するために、PE1にPathメッセージを送信します。 Pathメッセージは、[RFC2205]に従って、IPルータ警告オプションを最終的な目的地（リモート顧客サイトでの受信機）宛てと搬送されます。入力PEは、ルータアラートを認識し、これらのメッセージを傍受し、RSVP-TEのシグナリングメッセージとしてそれらを処理しなければなりません。"
    },
    {
      "indent": 6,
      "text": "2. When the ingress PE receives a Path message from a CE that is addressed to the receiver, the VRF that is associated with the incoming interface can be identified. (This step does not deviate from current behavior.)",
      "ja": "入口PEは、受信機にアドレス指定されるCEからPathメッセージを受信した場合2.着信インターフェイスに関連付けられたVRFを同定することができます。 （このステップは、現在の動作を逸脱しません。）"
    },
    {
      "indent": 6,
      "text": "3. The tunnel endpoint address of the receiver is looked up in the appropriate VRF, and the BGP next hop for that tunnel endpoint address is identified. The next hop is the egress PE.",
      "ja": "3.受信機のトンネルエンドポイントアドレスは、適切なVRF内で検索され、そのトンネルエンドポイントアドレスのBGPネクストホップが識別されます。次のホップは、出口PEです。"
    },
    {
      "indent": 6,
      "text": "4. A new LSP_TUNNEL_VPN-IPv4/VPN-IPv6 SESSION object is constructed, containing the Route Distinguisher (RD) that is part of the VPN-IPv4/VPN-IPv6 route prefix for this tunnel endpoint address, and the IPv4/IPv6 tunnel endpoint address from the original SESSION object.",
      "ja": "4.新しいLSP_TUNNEL_VPN-のIPv4 / VPN-IPv6のセッションオブジェクトは、このトンネルエンドポイントアドレスのVPN-IPv4の/ VPN-IPv6ルート接頭語の一部であるルート識別子（RD）とIPv4 / IPv6トンネルエンドポイントを含む、構成されています元のセッションオブジェクトからアドレス。"
    },
    {
      "indent": 6,
      "text": "5. A new LSP_TUNNEL_VPN-IPv4/IPv6 SENDER_TEMPLATE object is constructed, with the original IPv4/IPv6 tunnel sender address from the incoming SENDER_TEMPLATE plus the RD that is used by the PE to advertise the prefix for the customers VPN.",
      "ja": "5.新しいLSP_TUNNEL_VPN-のIPv4 / IPv6のSENDER_TEMPLATEオブジェクトは、着信SENDER_TEMPLATEからオリジナルのIPv4 / IPv6トンネルの送信元アドレスに加えて、顧客VPN用のプレフィックスを通知するためにPEによって使用されるRDと、構成されています。"
    },
    {
      "indent": 6,
      "text": "6. A new Path message is sent containing all the objects from the original Path message, replacing the original SESSION and SENDER_TEMPLATE objects with the new LSP_TUNNEL_VPN-IPv4/VPN-IPv6 type objects. This Path message is sent directly to the egress PE (the next hop that was determined in Step 3) without the IP Router Alert option.",
      "ja": "6.新たなPathメッセージは、新しいLSP_TUNNEL_VPN-のIPv4 / IPv6のVPN-型オブジェクトを元のセッションとSENDER_TEMPLATEオブジェクトを置き換える、元のPathメッセージからすべてのオブジェクトを含む送信されます。このPathメッセージは、IPルータ警告オプションを使用せずに出口PE（ステップ3で決定された次のホップ）に直接送信されます。"
    },
    {
      "indent": 0,
      "text": "3.2.2. Path Message Processing at the Egress PE",
      "section_title": true,
      "ja": "3.2.2. 出力PEのパスメッセージ処理"
    },
    {
      "indent": 3,
      "text": "Below, we describe the message handling process at the egress PE.",
      "ja": "以下では、出力PEのプロセスをメッセージ処理を記述します。"
    },
    {
      "indent": 6,
      "text": "1. When a Path message arrives at the egress PE (PE2 in Figure 1), it is addressed to the PE itself and is handed to RSVP for processing.",
      "ja": "Pathメッセージが出力PE（図1のPE2）に到達すると1は、それがPE自体にアドレス指定され、処理のためにRSVPに渡されます。"
    },
    {
      "indent": 6,
      "text": "2. The router extracts the RD and IPv4/IPv6 address from the LSP_TUNNEL_VPN-IPv4/VPN-IPv6 SESSION object and determines the local VRF context by finding a matching VPN-IPv4 prefix with the specified RD that has been advertised by this router into BGP.",
      "ja": "2.ルータはLSP_TUNNEL_VPN-のIPv4 / VPN-IPv6のセッション・オブジェクトからRDとIPv4 / IPv6アドレスを抽出し、BGPにこのルータによってアドバタイズされた指定されたRDと一致VPN-IPv4のプレフィックスを見つけることによってローカルVRFコンテキストを決定します。"
    },
    {
      "indent": 6,
      "text": "3. The entire incoming RSVP message, including the VRF information, is stored as part of the Path state.",
      "ja": "3. VRF情報を含む全体の着信RSVPメッセージは、パス状態の一部として記憶されます。"
    },
    {
      "indent": 6,
      "text": "4. The egress PE can now construct a Path message that differs from the Path message it received in the following ways:",
      "ja": "4.出口PEは、今では次の方法で受信されたPathメッセージは異なるPathメッセージを構築することができます。"
    },
    {
      "indent": 9,
      "text": "a. Its tunnel endpoint address is the IP address extracted from the SESSION object.",
      "ja": "A。そのトンネルエンドポイントアドレスは、セッションオブジェクトから抽出されたIPアドレスです。"
    },
    {
      "indent": 9,
      "text": "b. The SESSION and SENDER_TEMPLATE objects have been converted back to IPv4-type/IPv6-type by discarding the attached RD.",
      "ja": "B。 SESSIONとSENDER_TEMPLATEオブジェクトは、添付RDを破棄することで、IPv4型/ IPv6の型に変換されています。"
    },
    {
      "indent": 9,
      "text": "c. The RSVP_HOP object contains the IP address of the outgoing interface of the egress PE and a Logical Interface Handle (LIH), as per normal RSVP processing.",
      "ja": "C。 RSVP_HOPオブジェクトは、通常のRSVP処理通り、出口PEおよび論理インターフェイスハンドル（LIH）の発信インターフェイスのIPアドレスを含みます。"
    },
    {
      "indent": 6,
      "text": "5. The egress PE then sends the Path message towards its tunnel endpoint address over the interface identified in Step 4c. This Path message carries the IP Router Alert option, as required by [RFC2205].",
      "ja": "前記出口PEは、ステップ4cに同定されたインターフェースを介して、そのトンネル・エンドポイント・アドレスに向けてPathメッセージを送信します。 [RFC2205]で必要とされる。このPathメッセージは、IPルータアラートオプションを運びます。"
    },
    {
      "indent": 0,
      "text": "3.2.3. Resv Processing at the Egress PE",
      "section_title": true,
      "ja": "3.2.3. 出力PEでのResv処理"
    },
    {
      "indent": 3,
      "text": "When a receiver at the customer site originates a Resv message for the session, normal RSVP procedures apply until the Resv, making its way back towards the sender, arrives at the \"egress\" PE (it is the egress with respect to the direction of data flow, i.e., PE2 in Figure 1). Upon arriving at PE2, the SESSION and FILTER_SPEC objects in the Resv message, and the VRF in which the Resv was received, are used to find the matching Path state that was stored previously.",
      "ja": "顧客サイトでの受信機はセッションのResvメッセージを発信する場合、通常のRSVP手順が送信者に向かってその方法を行うこと、のResvまで適用し、「出口」PEに到達する（それはデータの方向に対して出力であります流れ、すなわち、図1）でPE2。 PE2、Resvメッセージ内のセッションとFILTER_SPECオブジェクトとのResvが受信されたVRFに到着すると、以前に格納されたマッチングパスの状態を検索するために使用されます。"
    },
    {
      "indent": 3,
      "text": "The PE constructs a Resv message to send to the RSVP HOP stored in the Path state, i.e., the ingress PE (PE1 in Figure 1). The LSP TUNNEL IPv4/IPv6 SESSION object is replaced with the same LSP_TUNNEL_VPN-IPv4/VPN-IPv6 SESSION object received in the Path message. The LSP TUNNEL IPv4/IPv6 FILTER_SPEC object is replaced with a LSP_TUNNEL_VPN-IPv4/VPN-IPv6 FILTER_SPEC object, which copies the VPN-IPv4/VPN-IPv6 address from the LSP TUNNEL SENDER_TEMPLATE received in the matching Path message.",
      "ja": "PEはパス状態に格納されたRSVPホップに送信するResvメッセージ、すなわち、入口PE（図1のPE1）を構築します。 LSPトンネルのIPv4 / IPv6のセッションオブジェクトはPathメッセージで受信した同一のLSP_TUNNEL_VPN-のIPv4 / VPN-IPv6のセッションオブジェクトに置き換えられます。 LSPトンネルのIPv4 / IPv6のFILTER_SPECオブジェクトは、LSPトンネルSENDER_TEMPLATEからVPN-のIPv4 / VPN-IPv6アドレスが一致するPathメッセージで受信したコピーLSP_TUNNEL_VPN-のIPv4 / IPv6のVPN-FILTER_SPECオブジェクトに置き換えられます。"
    },
    {
      "indent": 3,
      "text": "The Resv message MUST be addressed to the IP address contained within the RSVP_HOP object in the Path message.",
      "ja": "Resvメッセージは、PathメッセージでRSVP_HOPオブジェクト内に含まれるIPアドレスに取り組まなければなりません。"
    },
    {
      "indent": 0,
      "text": "3.2.4. Resv Processing at the Ingress PE",
      "section_title": true,
      "ja": "3.2.4. 入力PEでのResv処理"
    },
    {
      "indent": 3,
      "text": "When the ingress PE receives a Resv message (the ingress with respect to data flow, i.e., PE1 in Figure 1), the PE determines the local VRF context and associated Path state for this Resv message by decoding the received SESSION and FILTER_SPEC objects. It is now possible to generate a Resv message to send to the appropriate CE. The Resv message sent to the ingress CE contains the LSP TUNNEL IPv4/IPv6 SESSION and LSP TUNNEL FILTER_SPEC objects, which are derived from the appropriate Path state.",
      "ja": "入口PEは、Resvメッセージ（データ・フローに対する入口、図1において、すなわち、PE1）を受信すると、PEは、受信したセッションとFILTER_SPECオブジェクトをデコードすることにより、このResvメッセージのローカルVRFコンテキストと関連付けられたパスの状態を判定する。適切なCEに送信するResvメッセージを生成することが可能になりました。入口CEに送信されたResvメッセージは、適切なパスの状態に由来するLSPトンネルのIPv4 / IPv6のSESSIONとLSP TUNNEL FILTER_SPECオブジェクトを含んでいます。"
    },
    {
      "indent": 0,
      "text": "3.2.5. Other RSVP Messages",
      "section_title": true,
      "ja": "3.2.5. 他のRSVPメッセージ"
    },
    {
      "indent": 3,
      "text": "Processing of other RSVP messages (i.e., PathError, PathTear, ResvError, ResvTear, and ResvConf) generally follows the rules defined in [RFC2205]. The following additional rules MUST be observed for messages transmitted within the VPN, i.e., between the PEs:",
      "ja": "他のRSVPメッセージ（すなわち、PathError、PathTear、ResvError、たResvTear、およびResvConf）の処理は、一般に、[RFC2205]で定義されたルールに従います。以下の追加の規則はPE間、すなわち、VPN内で送信されるメッセージのために守らなければなりません。"
    },
    {
      "indent": 3,
      "text": "o The SESSION, SENDER_TEMPLATE, and FILTER_SPEC objects MUST be converted from LSP_TUNNEL_IPv4/LSP_TUNNEL_IPv6 [RFC3209] to LSP_TUNNEL_VPN-IPv4/LSP_TUNNEL_VPN-IPv6 form, respectively, and back again, in the same manner as described above for Path and Resv messages.",
      "ja": "SESSION O、SENDER_TEMPLATE、およびFILTER_SPECオブジェクトがパスとRESVメッセージについて上述したと同様に、再びそれぞれLSP_TUNNEL_VPN-のIPv4 / LSP_TUNNEL_VPN-IPv6の形にLSP_TUNNEL_IPv4 / LSP_TUNNEL_IPv6 [RFC3209]から変換、およびなければなりません。"
    },
    {
      "indent": 3,
      "text": "o The appropriate type of RSVP_HOP object (VPN-IPv4 or VPN-IPv6) MUST be used, as described in Section 8.4 of [RFC6016].",
      "ja": "[RFC6016]のセクション8.4に記載されているようにRSVP_HOPオブジェクトの適切なタイプO（VPN-IPv4またはVPN-IPv6）は、使用しなければなりません。"
    },
    {
      "indent": 3,
      "text": "o Depending on the type of RSVP_HOP object received from the neighbor, the message MUST be MPLS encapsulated or IP encapsulated.",
      "ja": "Oネイバーから受信RSVP_HOPオブジェクトのタイプに応じて、メッセージは、MPLSカプセル化しなければならないか、またはIPカプセル化。"
    },
    {
      "indent": 3,
      "text": "o The matching state and VRF MUST be determined by decoding the corresponding RD and IPv4 or IPv6 address in the SESSION and FILTER_SPEC objects.",
      "ja": "O整合状態とVRFはSESSIONとFILTER_SPECオブジェクトに対応するRD及びIPv4またはIPv6アドレスをデコードすることにより決定されなければなりません。"
    },
    {
      "indent": 3,
      "text": "o The message MUST be directly addressed to the appropriate PE, without using the Router Alert Option.",
      "ja": "メッセージが直接ルータ警告オプションを使用することなく、適切なPEに対処しなければならないO。"
    },
    {
      "indent": 0,
      "text": "4. Management Considerations",
      "section_title": true,
      "ja": "4.管理上の考慮事項"
    },
    {
      "indent": 3,
      "text": "MPLS-TE-based BGP/MPLS IP VPNs are based on a peer model. If an operator would like to configure a new site to an existing VPN, configuration of both the CE router and the attached PE router is required. The operator is not required to modify the configuration of PE routers connected to other sites or to modify the configuration of other VPNs.",
      "ja": "MPLS-TEベースのBGP / MPLS IP VPNは、ピアモデルに基づいています。オペレータは、既存のVPNに新しいサイトを設定したい場合は、CEルータと接続PEルータの両方の設定が必要です。オペレータは、他のサイトに接続されたPEルータの設定を変更したり、他のVPNの構成を変更する必要はありません。"
    },
    {
      "indent": 0,
      "text": "4.1. Impact on Network Operation",
      "section_title": true,
      "ja": "4.1. ネットワークオペレーションへの影響"
    },
    {
      "indent": 3,
      "text": "It is expected that the use of the extensions specified in this document will not significantly increase the level of operational traffic.",
      "ja": "この文書で指定された拡張子の使用が大幅に運用トラフィックのレベルを増加させないことが期待されます。"
    },
    {
      "indent": 3,
      "text": "Furthermore, the additional extensions described in this document will have no impact on the operation of existing resiliency mechanisms available within MPLS-TE.",
      "ja": "また、この文書で説明する追加拡張は、MPLS-TE内で利用可能な既存の復元力機構の動作に影響を与えないであろう。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "This document defines RSVP-TE extensions for BGP/MPLS IP VPNs. The general security issues for RSVP-TE are described in [RFC3209], [RFC4364] addresses the specific security considerations of BGP/MPLS VPNs. General security considerations for MPLS are described in [RFC5920].",
      "ja": "この文書は、BGP / MPLS IP VPNのRSVP-TEの拡張を定義します。 RSVP-TEのための一般的なセキュリティ上の問題は[RFC3209]で説明されて、[RFC4364]はBGP / MPLS VPNの特定のセキュリティ上の考慮事項に対処しています。 MPLSのための一般的なセキュリティ上の考慮事項は、[RFC5920]で説明されています。"
    },
    {
      "indent": 3,
      "text": "In order to secure the control plane, techniques such as the TCP Authentication Option (TCP-AO) [RFC5925] MAY be used authenticate BGP messages.",
      "ja": "制御プレーンを確保するために、そのようなTCP認証オプション（TCP-AO）[RFC5925]のような技術は、認証のBGPメッセージを併用してもよいです。"
    },
    {
      "indent": 3,
      "text": "To ensure the integrity of an RSVP request, the RSVP Authentication mechanisms defined in [RFC2747], and updated by [RFC3097], SHOULD be used.",
      "ja": "RSVP要求の完全性を保証するために、RSVP認証メカニズムは[RFC2747]で定義され、そして[RFC3097]によって更新使用すべきです。"
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "ja": "6.参照"
    },
    {
      "indent": 0,
      "text": "6.1. Normative References",
      "section_title": true,
      "ja": "6.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3209] Awduche, D., Berger, L., Gan, D., Li, T., Srinivasan, V., and G. Swallow, \"RSVP-TE: Extensions to RSVP for LSP Tunnels\", RFC 3209, December 2001.",
      "ja": "[RFC3209] Awduche、D.、バーガー、L.、ガン、D.、李、T.、スリニヴァサン、V.、およびG.ツバメ、 \"RSVP-TE：LSPトンネルのためのRSVPの拡張\"、RFC 3209年12月2001。"
    },
    {
      "indent": 0,
      "text": "6.2. Informative References",
      "section_title": true,
      "ja": "6.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC2205] Braden, R., Ed., Zhang, L., Berson, S., Herzog, S., and S. Jamin, \"Resource ReSerVation Protocol (RSVP) -- Version 1 Functional Specification\", RFC 2205, September 1997.",
      "ja": "[RFC2205]ブレーデン、R.、エド、チャン、L.、Berson氏、S.、ハーツォグ、S.、およびS.ヤミン、 \"リソース予約プロトコル（RSVP） - バージョン1の機能的な仕様\"。、RFC 2205、9月1997。"
    },
    {
      "indent": 3,
      "text": "[RFC2747] Baker, F., Lindell, B., and M. Talwar, \"RSVP Cryptographic Authentication\", RFC 2747, January 2000.",
      "ja": "[RFC2747]ベーカー、F.、リンデル、B.、およびM. Talwar、 \"RSVP暗号化認証\"、RFC 2747、2000年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC3097] Braden, R. and L. Zhang, \"RSVP Cryptographic Authentication -- Updated Message Type Value\", RFC 3097, April 2001.",
      "ja": "[RFC3097]ブレーデン、R.とL.チャン、 \"RSVP暗号化認証 - 更新メッセージタイプ価値\"、RFC 3097、2001年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC4364] Rosen, E. and Y. Rekhter, \"BGP/MPLS IP Virtual Private Networks (VPNs)\", RFC 4364, February 2006.",
      "ja": "[RFC4364]ローゼン、E.およびY. Rekhter、 \"BGP / MPLS IP仮想プライベートネットワーク（VPN）\"、RFC 4364、2006年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC4659] De Clercq, J., Ooms, D., Carugi, M., and F. Le Faucheur, \"BGP-MPLS IP Virtual Private Network (VPN) Extension for IPv6 VPN\", RFC 4659, September 2006.",
      "ja": "[RFC4659]デClercq、J.、Ooms、D.、Carugi、M.、およびF.ルFaucheur、 \"BGP-MPLS IP仮想プライベートネットワーク（VPN）は、IPv6 VPNのための拡張\"、RFC 4659、2006年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC5824] Kumaki, K., Ed., Zhang, R., and Y. Kamite, \"Requirements for Supporting Customer Resource ReSerVation Protocol (RSVP) and RSVP Traffic Engineering (RSVP-TE) over a BGP/MPLS IP-VPN\", RFC 5824, April 2010.",
      "ja": "[RFC5824]熊木、K.、エド。、張、R.、およびY. Kamite、 \"BGP / MPLS IP-VPNを介して顧客リソース予約プロトコル（RSVP）とRSVPトラフィックエンジニアリング（RSVP-TE）をサポートするための要件\" 、RFC 5824、2010年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC5920] Fang, L., Ed., \"Security Framework for MPLS and GMPLS Networks\", RFC 5920, July 2010.",
      "ja": "[RFC5920]牙、L.、エド。、 \"MPLSおよびGMPLSネットワークのセキュリティフレームワーク\"、RFC 5920、2010年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC5925] Touch, J., Mankin, A., and R. Bonica, \"The TCP Authentication Option\", RFC 5925, June 2010.",
      "ja": "[RFC5925]をタッチし、J.、マンキン、A.、およびR. Bonica、 \"TCP認証オプション\"、RFC 5925、2010年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC6016] Davie, B., Le Faucheur, F., and A. Narayanan, \"Support for the Resource Reservation Protocol (RSVP) in Layer 3 VPNs\", RFC 6016, October 2010.",
      "ja": "[RFC6016]デイビー、B.、ルFaucheur、F.、及びA.ナラヤナン、 \"レイヤ3つのVPNをにリソース予約プロトコル（RSVP）のサポート\"、RFC 6016、2010年10月。"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgments",
      "section_title": true,
      "ja": "7.謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to express thanks to Makoto Nakamura and Daniel King for their helpful and useful comments and feedback.",
      "ja": "作者は彼らの役に立つと有益なコメントやフィードバックのための中村誠とダニエル王への感謝を表したいと思います。"
    },
    {
      "indent": 0,
      "text": "8. Contributors",
      "section_title": true,
      "ja": "8.協力者"
    },
    {
      "indent": 3,
      "text": "Chikara Sasaki KDDI R&D Laboratories, Inc. 2-1-15 Ohara Fujimino Saitama 356-8502 Japan EMail: ch-sasaki@kddilabs.jp",
      "ja": "ちから ささき Ｋっぢ Ｒ＆Ｄ ぁぼらとりえｓ、 いんｃ。 ２ー１ー１５ おはら ふじみの さいたま ３５６ー８５０２ じゃぱん えまいｌ： ｃｈーささき＠ｋっぢぁｂｓ。ｊｐ"
    },
    {
      "indent": 3,
      "text": "Daisuke Tatsumi KDDI Corporation 2-3-2 Nishishinjuku Shinjuku-ku Tokyo 163-8003 Japan EMail: da-tatsumi@kddi.com",
      "ja": "だいすけ たつみ Ｋっぢ こｒぽらちおん ２ー３ー２ にししんじゅく しんじゅくーく ときょ １６３ー８００３ じゃぱん えまいｌ： だーたつみ＠ｋっぢ。こｍ"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Kenji Kumaki KDDI Corporation Garden Air Tower Iidabashi, Chiyoda-ku, Tokyo 102-8460 Japan EMail: ke-kumaki@kddi.com",
      "ja": "けんじ くまき Ｋっぢ こｒぽらちおん がｒでん あいｒ とうぇｒ いいだばし、 ちよだーく、 ときょ １０２ー８４６０ じゃぱん えまいｌ： けーくまき＠ｋっぢ。こｍ"
    },
    {
      "indent": 3,
      "text": "Tomoki Murai Furukawa Network Solution Corp. 5-1-9, Higashi-Yawata, Hiratsuka Kanagawa 254-0016 Japan EMail: murai@fnsc.co.jp",
      "ja": "ともき むらい ふるかわ ねとぉｒｋ そぅちおん こｒｐ。 ５ー１ー９、 ひがしーやわた、 ひらつか かながわ ２５４ー００１６ じゃぱん えまいｌ： むらい＠ｆんｓｃ。こ。ｊｐ"
    },
    {
      "indent": 3,
      "text": "Dean Cheng Huawei Technologies 2330 Central Expressway Santa Clara, CA 95050 USA EMail: dean.cheng@huawei.com",
      "ja": "技術へのディーン・チェン胡A 2330、中央高速道路サンタクララ、Huawei社へのCA 95050 USAメール:. @ディーン.COM"
    },
    {
      "indent": 3,
      "text": "Satoru Matsushima Softbank Telecom 1-9-1,Higashi-Shimbashi,Minato-Ku Tokyo 105-7322 Japan EMail: satoru.matsushima@g.softbank.co.jp",
      "ja": "さとる まつしま そｆｔばんｋ てぇこｍ １ー９ー１、ひがしーしｍばし、みなとーく ときょ １０５ー７３２２ じゃぱん えまいｌ： さとる。まつしま＠ｇ。そｆｔばんｋ。こ。ｊｐ"
    },
    {
      "indent": 3,
      "text": "Peng Jiang KDDI Corporation Garden Air Tower Iidabashi, Chiyoda-ku, Tokyo 102-8460 Japan EMail: pe-jiang@kddi.com",
      "ja": "鵬江沢民ガーデンエアタワーaidabasiロッド・コーポレーション、ciyoda区、東京102-8460日本Eメール：పే-జియాంగ్@కడ్డీ.కం"
    }
  ]
}