{
  "title": {
    "text": "RFC 6387 - GMPLS Asymmetric Bandwidth Bidirectional Label Switched Paths (LSPs)",
    "ja": "RFC 6387 - GMPLS非対称帯域幅の双方向ラベルスイッチパス（LSP）"
  },
  "number": 6387,
  "created_at": "2019-11-01 01:14:54.039428+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         A. Takacs\nRequest for Comments: 6387                                      Ericsson\nObsoletes: 5467                                                L. Berger\nCategory:  Standards Track                       LabN Consulting, L.L.C.\nISSN:  2070-1721                                             D. Caviglia\n                                                                Ericsson\n                                                                D. Fedyk\n                                                          Alcatel-Lucent\n                                                               J. Meuric\n                                                   France Telecom Orange\n                                                          September 2011",
      "raw": true
    },
    {
      "indent": 2,
      "text": "GMPLS Asymmetric Bandwidth Bidirectional Label Switched Paths (LSPs)",
      "ja": "GMPLS非対称帯域幅の双方向ラベルスイッチパス（LSP）"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document defines a method for the support of GMPLS asymmetric bandwidth bidirectional Label Switched Paths (LSPs). The approach presented is applicable to any switching technology and builds on the original Resource Reservation Protocol (RSVP) model for the transport of traffic-related parameters. This document moves the experiment documented in RFC 5467 to the standards track and obsoletes RFC 5467.",
      "ja": "このドキュメントは、GMPLS非対称帯域幅双方向ラベル（LSPを）パスの交換をサポートするための方法を定義します。提示したアプローチは、任意のスイッチング技術に適用可能であり、元のリソース予約プロトコル（RSVP）トラフィック関連パラメータの輸送のためのモデルに基づいています。この文書では、標準化トラックにRFC 5467で文書化実験を移動して、RFC 5467を廃止します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6387.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6387で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2011 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2011 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  2\n  1.1.  Background . . . . . . . . . . . . . . . . . . . . . . . .  3\n  1.2.  Approach Overview  . . . . . . . . . . . . . . . . . . . .  3\n  1.3.  Conventions Used in This Document  . . . . . . . . . . . .  4\n2.  Generalized Asymmetric Bandwidth Bidirectional LSPs  . . . . .  4\n  2.1.  UPSTREAM_FLOWSPEC Object . . . . . . . . . . . . . . . . .  5\n    2.1.1.  Procedures . . . . . . . . . . . . . . . . . . . . . .  5\n  2.2.  UPSTREAM_TSPEC Object  . . . . . . . . . . . . . . . . . .  5\n    2.2.1.  Procedures . . . . . . . . . . . . . . . . . . . . . .  5\n  2.3.  UPSTREAM_ADSPEC Object . . . . . . . . . . . . . . . . . .  6\n    2.3.1.  Procedures . . . . . . . . . . . . . . . . . . . . . .  6\n3.  Packet Formats . . . . . . . . . . . . . . . . . . . . . . . .  6\n4.  Compatibility  . . . . . . . . . . . . . . . . . . . . . . . .  7\n5.  IANA Considerations  . . . . . . . . . . . . . . . . . . . . .  8\n  5.1.  UPSTREAM_FLOWSPEC Object . . . . . . . . . . . . . . . . .  8\n  5.2.  UPSTREAM_TSPEC Object  . . . . . . . . . . . . . . . . . .  8\n  5.3.  UPSTREAM_ADSPEC Object . . . . . . . . . . . . . . . . . .  8\n6.  Security Considerations  . . . . . . . . . . . . . . . . . . .  8\n7.  References . . . . . . . . . . . . . . . . . . . . . . . . . .  9\n  7.1.  Normative References . . . . . . . . . . . . . . . . . . .  9\n  7.2.  Informative References . . . . . . . . . . . . . . . . . .  9",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "GMPLS [RFC3473] introduced explicit support for bidirectional Label Switched Paths (LSPs). The defined support matched the switching technologies covered by GMPLS, notably Time Division Multiplexing (TDM) and lambdas; specifically, it only supported bidirectional LSPs with symmetric bandwidth allocation. Symmetric bandwidth requirements are conveyed using the semantics objects defined in [RFC2205] and [RFC2210].",
      "ja": "双方向ラベルスイッチパス（LSP）のためのGMPLS [RFC3473]は明示的なサポートを導入しました。定義されたサポートはGMPLS、特に時分割多重（TDM）およびラムダによってカバーされ、スイッチング技術をマッチしました。具体的には、それだけで、対称帯域幅の割り当てとの双方向LSPをサポート。対称的な帯域幅要件は、[RFC2205]及び[RFC2210]で定義されたセマンティックオブジェクトを使用して搬送されます。"
    },
    {
      "indent": 3,
      "text": "GMPLS asymmetric bandwidth bidirectional LSPs are bidirectional LSPs that have different bandwidth reservations in each direction. Support for bidirectional LSPs with asymmetric bandwidth was previously discussed in the context of Ethernet, notably [RFC6060] and [RFC6003]. In that context, asymmetric bandwidth support was considered to be a capability that was unlikely to be deployed, and hence [RFC5467] was published as Experimental. The MPLS Transport Profile, MPLS-TP, requires that asymmetric bandwidth bidirectional LSPs be supported (see [RFC5654]); therefore, this document is being published on the Standards Track. This document has no technical changes from the approach defined in [RFC5467]. This document moves the experiment documented in [RFC5467] to the standards track and obsoletes [RFC5467]. This document also removes the Ethernet-technology-specific alternative approach discussed in the appendix of [RFC5467] and maintains only one approach that is suitable for use with any technology.",
      "ja": "GMPLS非対称帯域幅双方向のLSPは、各方向で異なる帯域幅の予約を持って双方向のLSPです。非対称な帯域幅との双方向のLSPのサポートは、以前に、イーサネットの文脈、特に[RFC6060]及び[RFC6003]で議論されました。その意味で、非対称帯域幅のサポートが展開されそうだった機能であると考えられた、したがって、[RFC5467]は実験として出版されました。 MPLSトランスポートプロファイル、MPLS-TPは、非対称的な帯域幅の双方向のLSPがサポートされている必要がある（[RFC5654]）。そのため、この文書では標準化過程に公開されています。この文書では、[RFC5467]で定義されたアプローチからの技術的な変更はありません。この文書では、基準トラックとを時代遅れに[RFC5467] [RFC5467]で文書化実験を移動します。また、このドキュメントは[RFC5467]の付録に論じイーサネット技術固有の代替アプローチを除去し、任意の技術の使用に適している唯一のアプローチを維持します。"
    },
    {
      "indent": 0,
      "text": "1.1. Background",
      "section_title": true,
      "ja": "1.1。バックグラウンド"
    },
    {
      "indent": 3,
      "text": "Bandwidth parameters are transported within RSVP ([RFC2210], [RFC3209], and [RFC3473]) via several objects that are opaque to RSVP. While opaque to RSVP, these objects support a particular model for the communication of bandwidth information between an RSVP session sender (ingress) and receiver (egress). The original model of communication, defined in [RFC2205] and maintained in [RFC3209], used the SENDER_TSPEC and ADSPEC objects in Path messages and the FLOWSPEC object in Resv messages. The SENDER_TSPEC object was used to indicate a sender's data generation capabilities. The FLOWSPEC object was issued by the receiver and indicated the resources that should be allocated to the associated data traffic. The ADSPEC object was used to inform the receiver and intermediate hops of the actual resources available for the associated data traffic.",
      "ja": "帯域幅パラメータは、RSVPに対して不透明な複数のオブジェクトを介して（[RFC2210]、[RFC3209]及び[RFC3473]）RSVP内に輸送されます。 RSVPに対して不透明ながら、これらのオブジェクトは、RSVPセッションの送信元（入力）と受信機（出力）との間の帯域幅情報の通信のための特定のモデルをサポートします。通信の元のモデル、[RFC3209]の[RFC2205]で定義され、維持は、PathメッセージとRESVメッセージ内のFLOWSPECオブジェクト内SENDER_TSPECおよびADSPECオブジェクトを使用します。 SENDER_TSPECオブジェクトは、送信者のデータ生成機能を示すために使用されました。 FLOWSPECオブジェクトは、受信機によって発行され、関連するデータトラフィックに割り当てられるべきリソースを示しました。 ADSPECオブジェクトは、受信機及び関連するデータトラフィックのために利用可能な実際のリソースの中間ホップを通知するために使用されました。"
    },
    {
      "indent": 3,
      "text": "With the introduction of bidirectional LSPs in [RFC3473], the model of communication of bandwidth parameters was implicitly changed. In the context of [RFC3473] bidirectional LSPs, the SENDER_TSPEC object indicates the desired resources for both upstream and downstream directions. The FLOWSPEC object is simply confirmation of the allocated resources. The definition of the ADSPEC object is either unmodified and only has meaning for downstream traffic, or is implicitly or explicitly ([RFC4606] and [RFC6003]) irrelevant.",
      "ja": "[RFC3473]で双方向LSPの導入により、帯域幅パラメータの通信のモデルは、暗黙的に変更されました。 [RFC3473]の双方向LSPの文脈では、SENDER_TSPECオブジェクトは、上流と下流の両方向に所望されるリソースを示します。 FLOWSPECオブジェクトは、単純に割り当てられたリソースの確認です。 ADSPECオブジェクトの定義は、修飾されていないだけダウンストリームトラフィックに対して意味を持ち、または無関係（[RFC4606]及び[RFC6003]）暗黙的または明示的のいずれかです。"
    },
    {
      "indent": 0,
      "text": "1.2. Approach Overview",
      "section_title": true,
      "ja": "1.2。アプローチの概要"
    },
    {
      "indent": 3,
      "text": "The approach for supporting asymmetric bandwidth bidirectional LSPs defined in this document builds on the original RSVP model for the transport of traffic-related parameters and GMPLS's support for bidirectional LSPs.",
      "ja": "この文書で定義された非対称の帯域幅双方向LSPをサポートするためのアプローチは、トラフィック関連のパラメータおよび双方向のLSPのためのGMPLSの支援の輸送のためのオリジナルのRSVPモデルに基づいています。"
    },
    {
      "indent": 3,
      "text": "The defined approach is generic and can be applied to any switching technology supported by GMPLS. With this approach, the existing SENDER_TSPEC, ADSPEC, and FLOWSPEC objects are complemented with the addition of new UPSTREAM_TSPEC, UPSTREAM_ADSPEC, and UPSTREAM_FLOWSPEC objects. The existing objects are used in the original fashion defined in [RFC2205] and [RFC2210], and refer only to traffic associated with the LSP flowing in the downstream direction. The new objects are used in exactly the same fashion as the old objects, but refer to the upstream traffic flow Figure 1 shows the bandwidth-related objects used for asymmetric bandwidth bidirectional LSPs.",
      "ja": "定義されたアプローチは、一般的なものとGMPLSでサポートされている任意のスイッチング技術に適用することができます。このアプローチでは、既存のSENDER_TSPEC、ADSPEC、およびFLOWSPECオブジェクトは新しいUPSTREAM_TSPEC、UPSTREAM_ADSPEC、およびUPSTREAM_FLOWSPECオブジェクトの追加で補完されています。既存のオブジェクトは、[RFC2205]及び[RFC2210]で定義された元の様式で使用され、LSPが下流方向に流れると関連付けられたトラフィックにのみ参照されています。新しいオブジェクトが古いオブジェクトとまったく同じ方法で使用されるが、アップストリームトラフィックフローの図1を参照して、非対称帯域幅双方向のLSPのために使用される帯域幅に関連するオブジェクトを示しています。"
    },
    {
      "indent": 20,
      "text": "|---|        Path        |---|\n| I |------------------->| E |\n| n | -SENDER_TSPEC      | g |\n| g | -ADSPEC            | r |\n| r | -UPSTREAM_FLOWSPEC | e |\n| e |                    | s |\n| s |        Resv        | s |\n| s |<-------------------|   |\n|   | -FLOWSPEC          |   |\n|   | -UPSTREAM_TSPEC    |   |\n|   | -UPSTREAM_ADSPEC   |   |\n|---|                    |---|",
      "raw": true
    },
    {
      "indent": 9,
      "text": "Figure 1: Generic Asymmetric Bandwidth Bidirectional LSPs",
      "ja": "図1：一般的な非対称帯域幅の双方向のLSP"
    },
    {
      "indent": 3,
      "text": "The extensions defined in this document are limited to Point-to-Point (P2P) LSPs. Support for Point-to-Multipoint (P2MP) bidirectional LSPs is not currently defined and, as such, not covered in this document.",
      "ja": "この文書で定義された拡張は、ポイントツーポイント（P2P）のLSPに限定されています。ポイントツーマルチポイント（P2MP）双方向のLSPのサポートは、現在のような、本文書に含まれていない、定義されていません。"
    },
    {
      "indent": 0,
      "text": "1.3. Conventions Used in This Document",
      "section_title": true,
      "ja": "1.3。このドキュメントの表記規則"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. Generalized Asymmetric Bandwidth Bidirectional LSPs",
      "section_title": true,
      "ja": "2.一般非対称帯域幅の双方向のLSP"
    },
    {
      "indent": 3,
      "text": "The setup of an asymmetric bandwidth bidirectional LSP is signaled using the bidirectional procedures defined in [RFC3473] together with the inclusion of the new UPSTREAM_FLOWSPEC, UPSTREAM_TSPEC, and UPSTREAM_ADSPEC objects.",
      "ja": "非対称な帯域幅の双方向LSPの設定は新しいUPSTREAM_FLOWSPEC、UPSTREAM_TSPEC、及びUPSTREAM_ADSPECオブジェクトの包含と共に[RFC3473]で定義された双方向の手順を使用してシグナリングされます。"
    },
    {
      "indent": 3,
      "text": "The new upstream objects carry the same information and are used in the same fashion as the existing downstream objects; they differ in that they relate to traffic flowing in the upstream direction while the existing objects relate to traffic flowing in the downstream direction. The new objects also differ in that they are carried in messages traveling in the opposite direction.",
      "ja": "新しい上流のオブジェクトが同一の情報を搬送し、既存の下流オブジェクトと同じ様式で使用されています。彼らは、既存のオブジェクトが下流方向に流れるトラフィックに関連しながら上流方向に流れるトラフィックに関連するという点で異なります。新しいオブジェクトはまた、彼らは反対の方向に進むのメッセージで運ばれるという点で異なります。"
    },
    {
      "indent": 0,
      "text": "2.1. UPSTREAM_FLOWSPEC Object",
      "section_title": true,
      "ja": "2.1。 UPSTREAM_FLOWSPECオブジェクト"
    },
    {
      "indent": 3,
      "text": "The format of an UPSTREAM_FLOWSPEC object is the same as a FLOWSPEC object [RFC2210]. This includes the definition of class types and their formats. The class number of the UPSTREAM_FLOWSPEC object is 120 (of the form 0bbbbbbb).",
      "ja": "UPSTREAM_FLOWSPECオブジェクトのフォーマットは、FLOWSPECオブジェクト[RFC2210]と同じです。これは、クラス型とそのフォーマットの定義が含まれています。 UPSTREAM_FLOWSPECオブジェクトのクラス数は120（フォーム0bbbbbbbはで）です。"
    },
    {
      "indent": 0,
      "text": "2.1.1. Procedures",
      "section_title": true,
      "ja": "2.1.1。手順"
    },
    {
      "indent": 3,
      "text": "The Path message of an asymmetric bandwidth bidirectional LSP MUST contain an UPSTREAM_FLOWSPEC object and MUST use the bidirectional LSP formats and procedures defined in [RFC3473]. The C-Type of the UPSTREAM_FLOWSPEC object MUST match the C-Type of the SENDER_TSPEC object used in the Path message. The contents of the UPSTREAM_FLOWSPEC object MUST be constructed using a format and procedures consistent with those used to construct the FLOWSPEC object that will be used for the LSP, e.g., [RFC2210] or [RFC4328].",
      "ja": "非対称な帯域幅双方向LSPのPathメッセージはUPSTREAM_FLOWSPECオブジェクトを含まなければなりませんと[RFC3473]で定義された双方向LSPフォーマットおよび手順を使用しなければなりません。 UPSTREAM_FLOWSPECオブジェクトのC型は、Pathメッセージに使用SENDER_TSPEC対象のC型と一致しなければなりません。 UPSTREAM_FLOWSPECオブジェクトの内容は、LSP、例えば、[RFC2210]または[RFC4328]のために使用されるFLOWSPECオブジェクトを構築するために使用されるものと一致するフォーマットおよび手順を用いて構築されなければなりません。"
    },
    {
      "indent": 3,
      "text": "Nodes processing a Path message containing an UPSTREAM_FLOWSPEC object MUST use the contents of the UPSTREAM_FLOWSPEC object in the upstream label and the resource allocation procedure defined in Section 3.1 of [RFC3473]. Consistent with [RFC3473], a node that is unable to allocate a label or internal resources based on the contents of the UPSTREAM_FLOWSPEC object MUST issue a PathErr message with a \"Routing problem/MPLS label allocation failure\" indication.",
      "ja": "UPSTREAM_FLOWSPECオブジェクトを含むPathメッセージを処理するノードが上流のラベルと[RFC3473]のセクション3.1で定義されたリソース割当て手順でUPSTREAM_FLOWSPECオブジェクトのコンテンツを使用しなければなりません。 [RFC3473]と一致し、UPSTREAM_FLOWSPECオブジェクトの内容に基づいて、ラベルまたは内部リソースを割り当てることができないノードは、「ルーティング問題/ MPLSラベル割り当て失敗」指示とのPathErrメッセージを発行しなければなりません。"
    },
    {
      "indent": 0,
      "text": "2.2. UPSTREAM_TSPEC Object",
      "section_title": true,
      "ja": "2.2。 UPSTREAM_TSPECオブジェクト"
    },
    {
      "indent": 3,
      "text": "The format of an UPSTREAM_TSPEC object is the same as a SENDER_TSPEC object, which includes the definition of class types and their formats. The class number of the UPSTREAM_TSPEC object is 121 (of the form 0bbbbbbb).",
      "ja": "UPSTREAM_TSPECオブジェクトのフォーマットは、クラスタイプとその形式の定義を含むSENDER_TSPECオブジェクトと同じです。 UPSTREAM_TSPECオブジェクトのクラス数は121（フォーム0bbbbbbbはで）です。"
    },
    {
      "indent": 0,
      "text": "2.2.1. Procedures",
      "section_title": true,
      "ja": "2.2.1。手順"
    },
    {
      "indent": 3,
      "text": "The UPSTREAM_TSPEC object describes the traffic flow that originates at the egress. The UPSTREAM_TSPEC object MUST be included in any Resv message that corresponds to a Path message containing an UPSTREAM_FLOWSPEC object. The C-Type of the UPSTREAM_TSPEC object MUST match the C-Type of the corresponding UPSTREAM_FLOWSPEC object. The contents of the UPSTREAM_TSPEC object MUST be constructed using a format and procedures consistent with those used to construct the FLOWSPEC object that will be used for the LSP, e.g., [RFC2210] or [RFC4328]. The contents of the UPSTREAM_TSPEC object MAY differ from",
      "ja": "UPSTREAM_TSPECオブジェクトは、出口で発信トラフィックの流れを説明します。 UPSTREAM_TSPECオブジェクトはUPSTREAM_FLOWSPECオブジェクトを含むPathメッセージに対応する任意のResvメッセージに含まれなければなりません。 UPSTREAM_TSPECオブジェクトのC型は、対応するUPSTREAM_FLOWSPECオブジェクトのC型と一致しなければなりません。 UPSTREAM_TSPECオブジェクトの内容は、LSP、例えば、[RFC2210]または[RFC4328]のために使用されるFLOWSPECオブジェクトを構築するために使用されるものと一致するフォーマットおよび手順を用いて構築されなければなりません。 UPSTREAM_TSPECオブジェクトの内容が異なる場合があり"
    },
    {
      "indent": 3,
      "text": "contents of the UPSTREAM_FLOWSPEC object based on application data transmission requirements.",
      "ja": "UPSTREAM_FLOWSPECオブジェクトの内容は、アプリケーションデータの送信要求に基づい。"
    },
    {
      "indent": 3,
      "text": "When an UPSTREAM_TSPEC object is received by an ingress, the ingress MAY determine that the original reservation is insufficient to satisfy the traffic flow. In this case, the ingress MAY tear down the LSP and send a PathTear message. Alternatively, the ingress MAY issue a Path message with an updated UPSTREAM_FLOWSPEC object to modify the resources requested for the upstream traffic flow. This modification might require the LSP to be re-routed, and in extreme cases might result in the LSP being torn down when sufficient resources are not available along the path of the LSP.",
      "ja": "UPSTREAM_TSPECオブジェクトが入力によって受信されると、入力は、元の予約トラフィックフローを満たすには不十分であると判断してもよいです。この場合、入力は、LSPをティアダウンし、PathTearメッセージを送信することができます。また、進入がアップストリームトラフィックフローのために要求されたリソースを変更するように更新UPSTREAM_FLOWSPECオブジェクトとPathメッセージを発行することができます。この変更は、再ルーティングされるようにLSPを必要とするかもしれないし、極端な場合には十分なリソースがLSPのパスに沿って利用できない場合LSPが切断される可能性があります。"
    },
    {
      "indent": 0,
      "text": "2.3. UPSTREAM_ADSPEC Object",
      "section_title": true,
      "ja": "2.3。オブジェクトUPSTREAM_ADSPEC"
    },
    {
      "indent": 3,
      "text": "The format of an UPSTREAM_ADSPEC object is the same as an ADSPEC object. This includes the definition of class types and their formats. The class number of the UPSTREAM_ADSPEC object is 122 (of the form 0bbbbbbb).",
      "ja": "UPSTREAM_ADSPECオブジェクトのフォーマットは、ADSPECオブジェクトと同じです。これは、クラス型とそのフォーマットの定義が含まれています。 UPSTREAM_ADSPECオブジェクトのクラス数は122（フォーム0bbbbbbbはで）です。"
    },
    {
      "indent": 0,
      "text": "2.3.1. Procedures",
      "section_title": true,
      "ja": "2.3.1。手順"
    },
    {
      "indent": 3,
      "text": "The UPSTREAM_ADSPEC object MAY be included in any Resv message that corresponds to a Path message containing an UPSTREAM_FLOWSPEC object. The C-Type of the UPSTREAM_TSPEC object MUST be consistent with the C-Type of the corresponding UPSTREAM_FLOWSPEC object. The contents of the UPSTREAM_ADSPEC object MUST be constructed using a format and procedures consistent with those used to construct the ADSPEC object that will be used for the LSP, e.g., [RFC2210] or [RFC6003]. The UPSTREAM_ADSPEC object is processed using the same procedures as the ADSPEC object and, as such, MAY be updated or added at transit nodes.",
      "ja": "UPSTREAM_ADSPECオブジェクトはUPSTREAM_FLOWSPECオブジェクトを含むPathメッセージに対応する任意のResvメッセージに含まれるかもしれ。 UPSTREAM_TSPECオブジェクトのC型は、対応するUPSTREAM_FLOWSPECオブジェクトのC型と一致していなければなりません。 UPSTREAM_ADSPECオブジェクトの内容は、LSP、例えば、[RFC2210]または[RFC6003]のために使用されるADSPECオブジェクトを構築するために使用されるものと一致するフォーマットおよび手順を用いて構築されなければなりません。 UPSTREAM_ADSPECオブジェクトのような、更新されてもよいか、トランジットノードで加え、ADSPECオブジェクトと同じ手順を用いて処理されます。"
    },
    {
      "indent": 0,
      "text": "3. Packet Formats",
      "section_title": true,
      "ja": "3.パケットフォーマット"
    },
    {
      "indent": 3,
      "text": "This section presents the RSVP message-related formats as modified by this section. This document modifies formats defined in [RFC2205], [RFC3209], and [RFC3473]. See [RFC5511] for the syntax used by RSVP. Unmodified formats are not listed. Three new objects are defined in this section:",
      "ja": "このセクションによって修正され、このセクションでは、RSVPメッセージに関連するフォーマットを提示します。このドキュメントは[RFC2205]、[RFC3209]及び[RFC3473]で定義されたフォーマットを変更します。 RSVPが使用する構文については、[RFC5511]を参照してください。非修飾形式は表示されません。三つの新しいオブジェクトは、このセクションで定義されています。"
    },
    {
      "indent": 6,
      "text": "Object name            Applicable RSVP messages\n---------------        ------------------------\nUPSTREAM_FLOWSPEC      Path, PathTear, PathErr, and Notify\n                           (via sender descriptor)\nUPSTREAM_TSPEC         Resv, ResvConf, ResvTear, ResvErr, and\n                           Notify (via flow descriptor list)\nUPSTREAM_ADSPEC        Resv, ResvConf, ResvTear, ResvErr, and\n                           Notify (via flow descriptor list)",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The format of the sender description for bidirectional asymmetric LSPs is:",
      "ja": "双方向非対称のLSPの送信者の記述の形式は次のとおりです。"
    },
    {
      "indent": 6,
      "text": "<sender descriptor> ::=  <SENDER_TEMPLATE> <SENDER_TSPEC>\n                         [ <ADSPEC> ]\n                         [ <RECORD_ROUTE> ]\n                         [ <SUGGESTED_LABEL> ]\n                         [ <RECOVERY_LABEL> ]\n                         <UPSTREAM_LABEL>\n                         <UPSTREAM_FLOWSPEC>",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The format of the flow descriptor list for bidirectional asymmetric LSPs is:",
      "ja": "双方向非対称のLSPのためのフロー記述子リストの形式は次のとおりです。"
    },
    {
      "indent": 6,
      "text": "<flow descriptor list> ::= <FF flow descriptor list>\n                         | <SE flow descriptor>",
      "raw": true
    },
    {
      "indent": 6,
      "text": "<FF flow descriptor list> ::= <FLOWSPEC>\n                         <UPSTREAM_TSPEC> [ <UPSTREAM_ADSPEC> ]\n                         <FILTER_SPEC>\n                         <LABEL> [ <RECORD_ROUTE> ]\n                         | <FF flow descriptor list>\n                         <FF flow descriptor>",
      "raw": true
    },
    {
      "indent": 6,
      "text": "<FF flow descriptor> ::= [ <FLOWSPEC> ]\n                         [ <UPSTREAM_TSPEC>] [ <UPSTREAM_ADSPEC> ]\n                         <FILTER_SPEC> <LABEL>\n                         [ <RECORD_ROUTE> ]",
      "raw": true
    },
    {
      "indent": 6,
      "text": "<SE flow descriptor> ::= <FLOWSPEC>\n                         <UPSTREAM_TSPEC> [ <UPSTREAM_ADSPEC> ]\n                         <SE filter spec list>",
      "raw": true
    },
    {
      "indent": 6,
      "text": "<SE filter spec list> is unmodified by this document.",
      "ja": "<SEフィルタスペック一覧>この文書によって変更されません。"
    },
    {
      "indent": 0,
      "text": "4. Compatibility",
      "section_title": true,
      "ja": "4.互換性"
    },
    {
      "indent": 3,
      "text": "This extension reuses and extends semantics and procedures defined in [RFC2205], [RFC3209], and [RFC3473] to support bidirectional LSPs with asymmetric bandwidth. Three new objects are defined to indicate the use of asymmetric bandwidth. Each of these objects is defined with class numbers in the form 0bbbbbbb. Per [RFC2205], nodes not supporting this extension will not recognize the new class numbers and will respond with an \"Unknown Object Class\" error. The error message will propagate to the ingress, which can then take action to avoid the path with the incompatible node or can simply terminate the session.",
      "ja": "この拡張は、非対称帯域幅で双方向LSPをサポートするために再利用し、[RFC2205]で定義された意味論および手順を拡張し、[RFC3209]及び[RFC3473]。三つの新しいオブジェクトが非対称の帯域幅の使用を示すために定義されています。これらの各オブジェクトは、フォーム0bbbbbbbは中クラス番号で定義されています。パー[RFC2205]、ノードではない新しいクラス番号を認識せず、「不明なオブジェクトクラス」エラーで応答します。この拡張機能をサポートしています。エラーメッセージは、互換性のないノードとのパスを避けるために行動を取ることができますまたは単にセッションを終了することができ、入口に反映されます。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "ja": "5. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "The IANA has made the assignments described below in the \"Class Names, Class Numbers, and Class Types\" section of the \"RSVP PARAMETERS\" registry.",
      "ja": "IANAは、「RSVPパラメータ」レジストリの「クラス名、クラス番号、およびクラスの型」で以下の割り当てを行っています。"
    },
    {
      "indent": 0,
      "text": "5.1. UPSTREAM_FLOWSPEC Object",
      "section_title": true,
      "ja": "5.1。 UPSTREAM_FLOWSPECオブジェクト"
    },
    {
      "indent": 3,
      "text": "The class named UPSTREAM_FLOWSPEC has been assigned in the 0bbbbbbb range (120) with the following definition:",
      "ja": "UPSTREAM_FLOWSPECという名前のクラスは、次の定義と0bbbbbbbは範囲（120）に割り当てられています。"
    },
    {
      "indent": 8,
      "text": "Class Types or C-types:",
      "ja": "クラスの型やC-種類："
    },
    {
      "indent": 8,
      "text": "Same values as FLOWSPEC object (C-Num 9)",
      "ja": "FLOWSPECオブジェクトと同じ値（C-テンキー9）"
    },
    {
      "indent": 0,
      "text": "5.2. UPSTREAM_TSPEC Object",
      "section_title": true,
      "ja": "5.2。 UPSTREAM_TSPECオブジェクト"
    },
    {
      "indent": 3,
      "text": "The class named UPSTREAM_TSPEC has been assigned in the 0bbbbbbb range (121) with the following definition:",
      "ja": "UPSTREAM_TSPECという名前のクラスは、次の定義と0bbbbbbbは範囲（121）に割り当てられています。"
    },
    {
      "indent": 8,
      "text": "Class Types or C-types:",
      "ja": "クラスの型やC-種類："
    },
    {
      "indent": 8,
      "text": "Same values as SENDER_TSPEC object (C-Num 12)",
      "ja": "SENDER_TSPECオブジェクトと同じ値（C-民12）"
    },
    {
      "indent": 0,
      "text": "5.3. UPSTREAM_ADSPEC Object",
      "section_title": true,
      "ja": "5.3。オブジェクトUPSTREAM_ADSPEC"
    },
    {
      "indent": 3,
      "text": "The class named UPSTREAM_ADSPEC has been assigned in the 0bbbbbbb range (122) with the following definition:",
      "ja": "UPSTREAM_ADSPECという名前のクラスは、次の定義と0bbbbbbbは範囲（122）に割り当てられています。"
    },
    {
      "indent": 8,
      "text": "Class Types or C-types:",
      "ja": "クラスの型やC-種類："
    },
    {
      "indent": 8,
      "text": "Same values as ADSPEC object (C-Num 13)",
      "ja": "ADSPECオブジェクトと同じ値（C-民13）"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document introduces new message objects for use in GMPLS signaling [RFC3473] -- specifically the UPSTREAM_TSPEC, UPSTREAM_ADSPEC, and UPSTREAM_FLOWSPEC objects. These objects parallel the existing SENDER_TSPEC, ADSPEC, and FLOWSPEC objects but are used in the opposite direction. As such, any vulnerabilities that are due to the use of the old objects now apply to messages flowing in the reverse direction.",
      "ja": "具体UPSTREAM_TSPEC、UPSTREAM_ADSPEC、及びUPSTREAM_FLOWSPECオブジェクト - この文書は、新しいメッセージが[RFC3473]をGMPLSシグナリングに使用するためのオブジェクトを導入します。これらのオブジェクトは、既存のSENDER_TSPEC、ADSPEC、及びFLOWSPECオブジェクトを平行であるが逆方向に使用されています。そのため、古いオブジェクトの使用に起因しているすべての脆弱性が、今は逆方向に流れるメッセージに適用されます。"
    },
    {
      "indent": 3,
      "text": "From a message standpoint, this document does not introduce any new signaling messages or change the relationship between LSRs that are adjacent in the control plane. As such, this document introduces no additional message- or neighbor-related security considerations.",
      "ja": "メッセージの観点から、この文書は、新しいシグナリングメッセージを紹介したり、コントロールプレーンに隣接するLSRの間の関係は変更されません。そのため、この資料は追加message-や隣人に関連したセキュリティ問題も紹介しません。"
    },
    {
      "indent": 3,
      "text": "See [RFC3473] for relevant security considerations and [RFC5920] for a more general discussion on RSVP-TE security discussions.",
      "ja": "RSVP-TEのセキュリティ協議に関する一般的な議論については、関連するセキュリティ上の考慮事項については、[RFC3473]と[RFC5920]を参照してください。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7.参考"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "ja": "7.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2205] Braden, R., Ed., Zhang, L., Berson, S., Herzog, S., and S. Jamin, \"Resource ReSerVation Protocol (RSVP) -- Version 1 Functional Specification\", RFC 2205, September 1997.",
      "ja": "[RFC2205]ブレーデン、R.、エド、チャン、L.、Berson氏、S.、ハーツォグ、S.、およびS.ヤミン、 \"リソース予約プロトコル（RSVP） - バージョン1の機能的な仕様\"。、RFC 2205、9月1997。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2210] Wroclawski, J., \"The Use of RSVP with IETF Integrated Services\", RFC 2210, September 1997.",
      "ja": "[RFC2210] Wroclawski、J.、RFC 2210、1997年9月 \"IETF統合サービスとRSVPの使用\"。"
    },
    {
      "indent": 3,
      "text": "[RFC3209] Awduche, D., Berger, L., Gan, D., Li, T., Srinivasan, V., and G. Swallow, \"RSVP-TE: Extensions to RSVP for LSP Tunnels\", RFC 3209, December 2001.",
      "ja": "[RFC3209] Awduche、D.、バーガー、L.、ガン、D.、李、T.、スリニヴァサン、V.、およびG.ツバメ、 \"RSVP-TE：LSPトンネルのためのRSVPの拡張\"、RFC 3209年12月2001。"
    },
    {
      "indent": 3,
      "text": "[RFC3473] Berger, L., Ed., \"Generalized Multi-Protocol Label Switching (GMPLS) Signaling Resource ReserVation Protocol-Traffic Engineering (RSVP-TE) Extensions\", RFC 3473, January 2003.",
      "ja": "[RFC3473]バーガー、L.、エド。、 \"一般化されたマルチプロトコルラベルスイッチング（GMPLS）シグナリング資源予約プロトコル - トラフィックエンジニアリング（RSVP-TE）を拡張\"、RFC 3473、2003年1月。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "ja": "7.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC4606] Mannie, E. and D. Papadimitriou, \"Generalized Multi-Protocol Label Switching (GMPLS) Extensions for Synchronous Optical Network (SONET) and Synchronous Digital Hierarchy (SDH) Control\", RFC 4606, August 2006.",
      "ja": "[RFC4606]マニー、E.およびD. Papadimitriou、 \"一般化マルチプロトコルラベルスイッチング（GMPLS）同期光ネットワーク（SONET）および同期デジタル階層（SDH）コントロールのための拡張機能\"、RFC 4606、2006年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC4328] Papadimitriou, D., Ed., \"Generalized Multi-Protocol Label Switching (GMPLS) Signaling Extensions for G.709 Optical Transport Networks Control\", RFC 4328, January 2006.",
      "ja": "[RFC4328] Papadimitriou、D.、エド。、 \"一般化されたマルチプロトコルラベルスイッチング（GMPLS）G.709光トランスポートネットワーク制御のための拡張機能をシグナリング\"、RFC 4328、2006年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC5511] Farrel, A., \"Routing Backus-Naur Form (RBNF): A Syntax Used to Form Encoding Rules in Various Routing Protocol Specifications\", RFC 5511, April 2009.",
      "ja": "[RFC5511]ファレル、A.、「ルーティングバッカス記法（RBNF）：さまざまなルーティングプロトコル仕様に符号化規則を形成するのに使用される構文」を2009年4月、RFC 5511を。"
    },
    {
      "indent": 3,
      "text": "[RFC5654] Niven-Jenkins, B., Ed., Brungard, D., Ed., Betts, M., Ed., Sprecher, N., and S. Ueno, \"Requirements of an MPLS Transport Profile\", RFC 5654, September 2009.",
      "ja": "[RFC5654]ニーヴン、ジェンキンス、B.、編。、Brungard、D.、編、ベッツ、M.編、Sprecher、N.、およびS.上野、 \"MPLSトランスポートプロファイルの要件\"、RFC 5654 2009年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC5920] Fang, L., Ed., \"Security Framework for MPLS and GMPLS Networks\", RFC 5920, July 2010.",
      "ja": "[RFC5920]牙、L.、エド。、 \"MPLSおよびGMPLSネットワークのセキュリティフレームワーク\"、RFC 5920、2010年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC5467] Berger, L., Takacs, A., Caviglia, D., Fedyk, D., and J. Meuric, \"GMPLS Asymmetric Bandwidth Bidirectional Label Switched Paths (LSPs)\", RFC 5467, March 2009.",
      "ja": "[RFC5467]バーガー、L.、タカーチ、A.、Caviglia、D.、Fedyk、D.、およびJ. Meuric、2009年3月、RFC 5467 \"をGMPLS非対称帯域幅双方向ラベル（のLSP）パスの交換しました\"。"
    },
    {
      "indent": 3,
      "text": "[RFC6003] Papadimitriou, D., \"Ethernet Traffic Parameters\", RFC 6003, October 2010.",
      "ja": "2010 Oktover [RFK6003] Papadimitriou、D.、 \"Traffisイーサネットパラメータ\" PYR 6003、。"
    },
    {
      "indent": 3,
      "text": "[RFC6060] Fedyk, D., Shah, H., Bitar, N., and A. Takacs, \"Generalized Multiprotocol Label Switching (GMPLS) Control of Ethernet Provider Backbone Traffic Engineering (PBB-TE)\", RFC 6060, March 2011.",
      "ja": "[RFC6060] Fedyk、D.、シャー、H.、ビタール、N.、およびA.タカーチ、 \"イーサネットプロバイダーバックボーントラフィックエンジニアリング（PBB-TE）の（GMPLS）制御スイッチング汎用マルチプロトコル・ラベル\"、RFC 6060、2011年3月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Attila Takacs Ericsson Konyves Kalman krt. 11. Budapest, 1097 Hungary",
      "ja": "アッティラタカーチエリクソンKonyvesカルマンKRT。 11ブダペスト、ハンガリー1097"
    },
    {
      "indent": 3,
      "text": "EMail: attila.takacs@ericsson.com",
      "ja": "メールアドレス：attila.takacs@ericsson.com"
    },
    {
      "indent": 3,
      "text": "Lou Berger LabN Consulting, L.L.C.",
      "ja": "ルー・バーガーLabnコンサルティング、L.L.C."
    },
    {
      "indent": 3,
      "text": "EMail: lberger@labn.net",
      "ja": "メールアドレス：lberger@labn.net"
    },
    {
      "indent": 3,
      "text": "Diego Caviglia Ericsson Via A. Negrone 1/A Genova-Sestri Ponente, Italy",
      "ja": "ディエゴ・A.シャハトエリクソンNegrone 1 /ジェノバ・セストリポネンテ、イタリア"
    },
    {
      "indent": 3,
      "text": "Phone: +390106003738 Fax: EMail: diego.caviglia@ericsson.com",
      "ja": "電話：+390106003738 FAX番号：Eメール：diego.caviglia@ericsson.com"
    },
    {
      "indent": 3,
      "text": "Don Fedyk Alcatel-Lucent Groton, MA USA",
      "ja": "ドン・ルブランアルカテル・ルーセントグロトン、MA USA"
    },
    {
      "indent": 3,
      "text": "EMail: donald.fedyk@alcatel-lucent.com",
      "ja": "メールアドレス：donald.fedyk@alcatel-lucent.com"
    },
    {
      "indent": 3,
      "text": "Julien Meuric France Telecom Orange 2, avenue Pierre Marzin Lannion Cedex, 22307 France",
      "ja": "ジュリアンMeuricフランステレコムオレンジ2、大通りピエールMarzinラニオンセデックス、フランス22307"
    },
    {
      "indent": 3,
      "text": "EMail: julien.meuric@orange.com",
      "ja": "メールアドレス：julien.meuric@orange.com"
    }
  ]
}