{
  "title": {
    "text": "RFC 6034 - Unicast-Prefix-Based IPv4 Multicast Addresses",
    "ja": "RFC 6034 - Unicast-PrefixベースのIPv4マルチキャストアドレス"
  },
  "number": 6034,
  "created_at": "2023-01-17 07:17:46.049503+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         D. Thaler\nRequest for Comments: 6034                                     Microsoft\nCategory: Standards Track                                   October 2010\nISSN: 2070-1721",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 13,
      "text": "Unicast-Prefix-Based IPv4 Multicast Addresses",
      "ja": "Unicast-PrefixベースのIPv4マルチキャストアドレス"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This specification defines an extension to the multicast addressing architecture of the IP Version 4 protocol. The extension presented in this document allows for unicast-prefix-based assignment of multicast addresses. By delegating multicast addresses at the same time as unicast prefixes, network operators will be able to identify their multicast addresses without needing to run an inter-domain allocation protocol.",
      "ja": "この仕様は、IPバージョン4プロトコルのマルチキャストアドレス指定アーキテクチャの拡張機能を定義します。このドキュメントに示されている拡張機能により、マルチキャストアドレスのユニキャスト対応ベースの割り当てが可能になります。ユニキャストプレフィックスと同時にマルチキャストアドレスを委任することにより、ネットワークオペレーターは、ドメイン間割り当てプロトコルを実行する必要なく、マルチキャストアドレスを特定できます。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準トラックドキュメントです。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントは、インターネットエンジニアリングタスクフォース（IETF）の製品です。IETFコミュニティのコンセンサスを表しています。公開レビューを受けており、インターネットエンジニアリングステアリンググループ（IESG）からの出版が承認されています。インターネット標準の詳細については、RFC 5741のセクション2で入手できます。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6034.",
      "ja": "このドキュメントの現在のステータス、任意のERRATA、およびそのフィードバックを提供する方法に関する情報は、http：//www.rfc-editor.org/info/rfc6034で取得できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2010 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2010 IETF Trustおよび文書著者として特定された人。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "このドキュメントは、BCP 78およびIETFドキュメント（http://trustee.ietf.org/license-info）に関連するIETF Trustの法的規定の対象となります。この文書に関するあなたの権利と制限を説明するので、これらの文書を注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、セクション4.Eで説明されている法的規定のセクション4.Eで説明されており、単純化されたBSDライセンスで説明されているように保証なしで提供される簡略化されたBSDライセンステキストを含める必要があります。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . . . 2\n2.  Terminology . . . . . . . . . . . . . . . . . . . . . . . . . . 3\n3.  Address Space . . . . . . . . . . . . . . . . . . . . . . . . . 3\n4.  Examples  . . . . . . . . . . . . . . . . . . . . . . . . . . . 4\n5.  Security Considerations . . . . . . . . . . . . . . . . . . . . 4\n6.  IANA Considerations . . . . . . . . . . . . . . . . . . . . . . 5\n7.  Acknowledgments . . . . . . . . . . . . . . . . . . . . . . . . 5\n8.  References  . . . . . . . . . . . . . . . . . . . . . . . . . . 5\n  8.1.  Normative References  . . . . . . . . . . . . . . . . . . . 5\n  8.2.  Informative References  . . . . . . . . . . . . . . . . . . 5",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "RFC 3180 [RFC3180] defines an allocation mechanism (called \"GLOP\") in 233/8 whereby an Autonomous System (AS) number is embedded in the middle 16 bits of an IPv4 multicast address, resulting in 256 multicast addresses per AS. Advantages of this mechanism include the ability to get multicast address space without an inter-domain multicast address allocation protocol, and the ease of determining the AS that was assigned the address for debugging and auditing purposes.",
      "ja": "RFC 3180 [RFC3180]は、233/8の割り当てメカニズム（「GLOP」と呼ばれる）を定義します。このメカニズムの利点には、ドメイン間のマルチキャストアドレス割り当てプロトコルなしでマルチキャストアドレススペースを取得する機能、およびデバッグおよび監査目的のアドレスが割り当てられたASを容易にすることが含まれます。"
    },
    {
      "indent": 3,
      "text": "Some disadvantages of GLOP include:",
      "ja": "GLOPのいくつかの欠点は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "o RFC 4893 [RFC4893] expands the size of an AS number to 4 bytes, and GLOP cannot work with 4-byte AS numbers.",
      "ja": "o RFC 4893 [RFC4893]は、AS数のサイズを4バイトに拡張し、GLOPは4バイトとして動作することはできません。"
    },
    {
      "indent": 3,
      "text": "o When an AS covers multiple sites or organizations, administration of the multicast address space within an AS must be handled by other mechanisms, such as manual administrative effort or the Multicast Address Dynamic Client Allocation Protocol (MADCAP) [RFC2730].",
      "ja": "o Aが複数のサイトまたは組織をカバーする場合、AS内のマルチキャストアドレス空間の管理は、手動管理努力やマルチキャストアドレスダイナミッククライアント割り当てプロトコル（MADCAP）[RFC2730]など、他のメカニズムによって処理する必要があります。"
    },
    {
      "indent": 3,
      "text": "o During debugging, identifying the AS does not immediately identify the correct organization when an AS covers multiple organizations.",
      "ja": "o デバッグ中、ASを識別すると、ASが複数の組織をカバーしている場合、正しい組織をすぐに特定しません。"
    },
    {
      "indent": 3,
      "text": "o Only 256 addresses are automatically available per AS, and obtaining any more requires administrative effort.",
      "ja": "o ASごとに自動的に利用可能な256のアドレスのみがあり、これ以上の取得には管理努力が必要です。"
    },
    {
      "indent": 3,
      "text": "More recently, a mechanism [RFC3306] has been developed for IPv6 that provides a multicast range to every IPv6 subnet, which is at a much finer granularity than an AS. As a result, the first three disadvantages above are avoided (and the last disadvantage does not apply to IPv6 due to the extended size of the address space).",
      "ja": "最近では、すべてのIPv6サブネットにマルチキャスト範囲を提供するIPv6向けにメカニズム[RFC3306]が開発されました。その結果、上記の最初の3つの欠点は回避されます（そして、アドレス空間のサイズが拡張されているため、最後の欠点はIPv6には適用されません）。"
    },
    {
      "indent": 3,
      "text": "Another advantage of providing multicast space to a subnet, rather than just to an entire AS, is that multicast address assignments within the range need only be coordinated within the subnet.",
      "ja": "AS全体ではなく、マルチキャストスペースをサブネットに提供するもう1つの利点は、範囲内のマルチキャストアドレスの割り当てをサブネット内でのみ調整する必要があることです。"
    },
    {
      "indent": 3,
      "text": "This document specifies a mechanism similar to [RFC3306], whereby a range of global IPv4 multicast address space is provided to each organization that has unicast address space. A resulting advantage over GLOP is that the mechanisms in IPv4 and IPv6 become more similar.",
      "ja": "このドキュメントは、[RFC3306]に類似したメカニズムを指定します。これにより、ユニキャストアドレススペースを持つ各組織にさまざまなグローバルIPv4マルチキャストアドレススペースが提供されます。GLOPよりも結果として得られる利点は、IPv4とIPv6のメカニズムがより類似することです。"
    },
    {
      "indent": 3,
      "text": "This document does not obsolete or update RFC 3180, as the mechanism described in RFC 3180 is still required for organizations with prefix allocations more specific than /24. Organizations using RFC 3180 allocations may continue to do so. In fact, it is conceivable that an organization might use both RFC 3180 allocations and the allocation method described in this document.",
      "ja": "このドキュメントは、RFC 3180で説明されているメカニズムが依然として /24よりも特定の割り当てを備えた組織に必要であるため、RFC 3180を廃止したり更新したりしません。RFC 3180の割り当てを使用する組織は、引き続きそうすることができます。実際、組織がこのドキュメントで説明したRFC 3180割り当てと割り当て方法の両方を使用する可能性があると考えられます。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "ja": "2. 用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "「必須」、「そうしない」、「必須」、「必要」、「しない」、「そうしない」、「そうではない」、「そうでない」、「推奨」、「5月」、および「オプション」は、[RFC2119]に記載されているように解釈される。"
    },
    {
      "indent": 0,
      "text": "3. Address Space",
      "section_title": true,
      "ja": "3. 住所スペース"
    },
    {
      "indent": 3,
      "text": "A multicast address with the prefix 234/8 indicates that the address is a Unicast-Based Multicast (UBM) address. The remaining 24 bits are used as follows:",
      "ja": "プレフィックス234/8を備えたマルチキャストアドレスは、アドレスがユニキャストベースのマルチキャスト（UBM）アドレスであることを示しています。残りの24ビットは次のように使用されます。"
    },
    {
      "indent": 3,
      "text": "Bits:  |   0 thru 7   |         8 thru N        |   N+1 thru 31   |\n       +-------+--------------------+-----------------------------+\nValue: |     234      |      Unicast Prefix     |    Group ID     |\n       +-------+--------------------+-----------------------------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "For organizations with a /24 or shorter prefix, the unicast prefix of the organization is appended to the common /8. Any remaining bits may be assigned by any mechanism the organization wishes.",
      "ja": "A /24以下のプレフィックスを持つ組織の場合、組織のユニキャストプレフィックスはCommon /8に追加されます。残りのビットは、組織が望むメカニズムによって割り当てられる場合があります。"
    },
    {
      "indent": 3,
      "text": "For example, an organization that has a /16 prefix assigned might choose to assign multicast addresses manually from the /24 multicast prefix derived from the above method. Alternatively, the organization might choose to delegate the use of multicast addresses to individual subnets that have a /24 or shorter unicast prefix, or it might choose some other method.",
      "ja": "たとえば、A /16プレフィックスが割り当てられている組織は、上記の方法から派生した /24マルチキャストプレフィックスから手動でマルチキャストアドレスを割り当てることを選択できます。あるいは、組織は、マルチキャストアドレスの使用をA /24以下のユニキャストプレフィックスを備えた個々のサブネットに委任するか、他の方法を選択することを選択する場合があります。"
    },
    {
      "indent": 3,
      "text": "Organizations with a prefix length longer than 24 do not receive any multicast address space from this mechanism; in such cases, another mechanism must be used.",
      "ja": "24を超える接頭辞の長さを持つ組織は、このメカニズムからマルチキャストアドレススペースを受け取りません。そのような場合、別のメカニズムを使用する必要があります。"
    },
    {
      "indent": 3,
      "text": "Compared to GLOP, an AS will receive more address space via this mechanism if it has more than a /16 for unicast space. An AS will receive less address space than it does from GLOP if it has less than a /16.",
      "ja": "GLOPと比較して、ユニキャストスペースにA /16を超える場合、ASはこのメカニズムを介してより多くのアドレススペースを受け取ります。Aは、A /16未満の場合、GLOPからのアドレススペースが少なくなります。"
    },
    {
      "indent": 3,
      "text": "The organization that is assigned a UBM address can be determined by taking the multicast address, shifting it left by 8 bits, and identifying who has been assigned the address space covering the resulting unicast address.",
      "ja": "UBMアドレスを割り当てられている組織は、マルチキャストアドレスを取得し、8ビットを残してシフトし、結果のユニキャストアドレスをカバーするアドレススペースを割り当てられた人を特定することで決定できます。"
    },
    {
      "indent": 3,
      "text": "The embedded unicast prefix MUST be a global unicast prefix (i.e., no loopback, multicast, link-local, or private-use IP address space). In addition, since global unicast addresses are not permanently assigned, UBM addresses MUST NOT be hard-coded in applications.",
      "ja": "埋め込まれたユニキャストプレフィックスは、グローバルユニキャストプレフィックスでなければなりません（つまり、ループバック、マルチキャスト、リンクローカル、またはプライベート使用IPアドレススペースなし）。さらに、グローバルユニキャストアドレスは永続的に割り当てられていないため、UBMアドレスをアプリケーションでハードコーディングしてはなりません。"
    },
    {
      "indent": 0,
      "text": "4. Examples",
      "section_title": true,
      "ja": "4. 例"
    },
    {
      "indent": 3,
      "text": "The following are a few examples of the structure of unicast-prefix-based multicast addresses.",
      "ja": "以下は、Unicast-Prefixベースのマルチキャストアドレスの構造のいくつかの例です。"
    },
    {
      "indent": 3,
      "text": "o Consider an organization that has been assigned the global unicast address space 192.0.2.0/24. This means that organization can use the global multicast address 234.192.0.2 without coordinating with any other entity. Someone who sees this multicast address and wants to find who is using it can mentally shift the address left by 8 bits to get 192.0.2.0, and can then look up who has been assigned unicast address space that includes that address.",
      "ja": "o グローバルユニキャストアドレススペース192.0.2.0/24を割り当てられた組織を検討してください。これは、組織が他のエンティティと調整せずにグローバルマルチキャストアドレス234.192.0.2を使用できることを意味します。このマルチキャストアドレスを見て、それを使用している人を見つけたい人は、192.0.2.0を取得するために8ビットを残してアドレスを精神的にシフトし、そのアドレスを含むユニキャストアドレススペースを割り当てられた人を調べることができます。"
    },
    {
      "indent": 3,
      "text": "o Consider an organization that has been assigned a larger address space, x.y.0.0/16. This organization can use the global multicast address space 234.x.y.0/24 without coordinating with any other entity, and can assign addresses within this space by any mechanism the organization wishes. Someone who sees a multicast address (say) 234.x.y.10 and wants to find who is using it can mentally shift the address left by 8 bits to get x.y.10.0, and can then look up who has been assigned unicast address space that includes that address.",
      "ja": "o より大きな住所スペースX.Y.0.0/16が割り当てられた組織を検討してください。この組織は、他のエンティティと調整することなく、グローバルマルチキャストアドレススペース234.x.y.0/24を使用でき、組織が望むメカニズムによってこのスペース内のアドレスを割り当てることができます。マルチキャストアドレス（たとえば）234.x.y.10を見て、それを使用している人を見つけたい人は、X.Y.10.0を取得するために8ビットを残してアドレスを精神的にシフトし、それを含むユニキャストアドレススペースを割り当てられた人を調べることができます住所。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "The same well-known intra-domain security techniques can be applied as with GLOP. Furthermore, when dynamic allocation is used within a prefix, the approach described here may have the effect of reduced exposure to denial-of-service attacks, since the topological area within which nodes compete for addresses within the same prefix is reduced from an entire AS to only within an individual organization or an even smaller area.",
      "ja": "GLOPと同様に、同じよく知られているドメイン内セキュリティ手法を適用できます。さらに、プレフィックス内で動的割り当てが使用される場合、ここで説明するアプローチは、同じ接頭辞内のアドレスを競うトポロジー領域が競合するトポロジカル領域が同じように、同じプレフィックス内のアドレスを競うため、サービス拒否攻撃への露出の減少の影響を与える可能性があります。個々の組織またはさらに小さな領域内のみ。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has assigned a /8 in the global IPv4 multicast address space for this purpose.",
      "ja": "IANAは、この目的のためにグローバルIPv4マルチキャストアドレススペースにA /8を割り当てました。"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgments",
      "section_title": true,
      "ja": "7. 謝辞"
    },
    {
      "indent": 3,
      "text": "This document was updated based on feedback from the MBoneD working group. In particular, Tim Chown, Toerless Eckert, Prashant Jhingran, Peter Koch, John Linn, Dave Meyer, Pekka Savola, Greg Shepherd, and Stig Venaas provided valuable suggestions on the text.",
      "ja": "このドキュメントは、MBONEDワーキンググループからのフィードバックに基づいて更新されました。特に、ティム・チャウン、Toerless Eckert、Prashant Jhingran、Peter Koch、John Linn、Dave Meyer、Pekka Savola、Greg Shepherd、Stig Venaasは、テキストに関する貴重な提案を提供しました。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8. 参考文献"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "ja": "8.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119] Bradner、S。、「要件レベルを示すためにRFCで使用するためのキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "ja": "8.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[RFC2730] Hanna, S., Patel, B., and M. Shah, \"Multicast Address Dynamic Client Allocation Protocol (MADCAP)\", RFC 2730, December 1999.",
      "ja": "[RFC2730] Hanna、S.、Patel、B。、およびM. Shah、「マルチキャストアドレスダイナミッククライアント割り当てプロトコル（MADCAP）」、RFC 2730、1999年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC3180] Meyer, D. and P. Lothberg, \"GLOP Addressing in 233/8\", BCP 53, RFC 3180, September 2001.",
      "ja": "[RFC3180] Meyer、D。およびP. Lothberg、「233/8のGlopアドレス指定」、BCP 53、RFC 3180、2001年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC3306] Haberman, B. and D. Thaler, \"Unicast-Prefix-based IPv6 Multicast Addresses\", RFC 3306, August 2002.",
      "ja": "[RFC3306] Haberman、B。およびD. Thaler、「Unicast-PrefixベースのIPv6マルチキャストアドレス」、RFC 3306、2002年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC4893] Vohra, Q. and E. Chen, \"BGP Support for Four-octet AS Number Space\", RFC 4893, May 2007.",
      "ja": "[RFC4893] Vohra、Q。およびE. Chen、「Number Spaceとしての4オクテットのBGPサポート」、RFC 4893、2007年5月。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者の連絡先"
    },
    {
      "indent": 3,
      "text": "Dave Thaler Microsoft Corporation One Microsoft Way Redmond, WA 98052 USA",
      "ja": "Dave Thaler Microsoft Corporation One Microsoft Way Redmond、WA 98052 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 425 703 8835\nEMail: dthaler@microsoft.com",
      "raw": true,
      "ja": ""
    }
  ]
}