{
  "title": {
    "text": "RFC 6626 - Dynamic Prefix Allocation for Network Mobility for Mobile IPv4 (NEMOv4)",
    "ja": "RFC 6626 - モバイルIPv4のネットワークモビリティ（NEMOv4）の動的プレフィックスの割り当て"
  },
  "number": 6626,
  "created_at": "2019-10-28 12:20:12.438781+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                       G. Tsirtsis\nRequest for Comments: 6626                                       V. Park\nUpdates: 5177                                               V. Narayanan\nCategory: Standards Track                                       Qualcomm\nISSN: 2070-1721                                                 K. Leung\n                                                                   Cisco\n                                                                May 2012",
      "raw": true
    },
    {
      "indent": 15,
      "text": "      Dynamic Prefix Allocation for\nNetwork Mobility for Mobile IPv4 (NEMOv4)",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "The base Network Mobility for Mobile IPv4 (NEMOv4) specification defines extensions to Mobile IPv4 for mobile networks. This specification defines a dynamic prefix allocation mechanism for NEMOv4.",
      "ja": "モバイルIPv4（NEMOv4）仕様ベースネットワークモビリティは、モバイルネットワークのモバイルIPv4への拡張を定義します。この仕様はNEMOv4ための動的プレフィックス割り当てメカニズムを定義します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6626.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6626で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2012 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2012 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Requirements Notation ...........................................2\n3. Dynamic Mobile Prefix Allocation ................................2\n   3.1. Mobile Client Considerations ...............................2\n   3.2. Home Agent Considerations ..................................3\n4. Security Considerations .........................................4\n5. IANA Considerations .............................................4\n6. Acknowledgements ................................................4\n7. Normative References ............................................4",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "The base NEMOv4 specification [RFC5177] defines extensions to Mobile IPv4 [RFC5944] for mobile networks. This specification adds support for dynamic allocation of mobile prefixes by the home agent.",
      "ja": "ベースNEMOv4仕様[RFC5177]は、モバイルネットワークのためのモバイルIPv4 [RFC5944]の拡張機能を定義します。この仕様は、ホームエージェントによって、モバイルプレフィックスの動的割り当てのサポートを追加します。"
    },
    {
      "indent": 0,
      "text": "2. Requirements Notation",
      "section_title": true,
      "ja": "2.要件表記"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "3. Dynamic Mobile Prefix Allocation",
      "section_title": true,
      "ja": "3.ダイナミックモバイルプレフィックスの割り当て"
    },
    {
      "indent": 3,
      "text": "The following extension is defined according to this specification.",
      "ja": "次の拡張は、本明細書に従って定義されます。"
    },
    {
      "indent": 0,
      "text": "3.1. Mobile Client Considerations",
      "section_title": true,
      "ja": "3.1。モバイルクライアントの考慮事項"
    },
    {
      "indent": 3,
      "text": "According to this specification, the Prefix field of the Mobile Network Request extension MUST be set to zero to indicate that the Mobile Router requests mobile network prefix(es) be assigned to it by the home agent. In this case, the Mobile Router MAY set the prefix length field of such extensions to zero or to a length of its choice as a hint to the home agent. According to this specification, Mobile Network Request extensions with the Prefix field set to zero MAY be included in a registration request message either during initial registration or during a subsequent registration.",
      "ja": "この仕様によると、モバイルネットワーク要求拡張のプレフィックス]フィールドには、モバイルルータがホームエージェントによってそれに割り当てられるモバイルネットワークプレフィックス（複数可）を要求することを示すためにゼロに設定しなければなりません。この場合、モバイルルータは、ホームエージェントへのヒントとして、ゼロまたはその任意の長さに、このような拡張子のプレフィックス長さフィールドを設定することができます。この仕様によれば、ゼロに設定プレフィックスフィールドとモバイルネットワーク要求拡張は、初期登録時またはその後の登録時のいずれかで登録要求メッセージに含まれるかもしれません。"
    },
    {
      "indent": 3,
      "text": "When a Mobile Router receives a registration reply, it MUST process it as defined in Mobile IPv4 [RFC5944] and [RFC5177]. If one or more network acknowledgement extensions are included with the Code field set to \"Success\", the Mobile Router SHOULD treat the prefixes in the corresponding Prefix fields as allocated prefixes and create the appropriate bindings as defined in [RFC5177].",
      "ja": "モバイルルータは、登録応答を受信した場合、モバイルIPv4 [RFC5944]及び[RFC5177]で定義されるように、それを処理しなければなりません。 1つ以上のネットワーク承認拡張が「成功」に設定されたコードフィールドに含まれている場合は、モバイルルータは、割り当てられたプレフィックスとして対応する接頭辞フィールドにプレフィックスを扱うべきであると[RFC5177]で定義されたように、適切なバインディングを作成します。"
    },
    {
      "indent": 3,
      "text": "In response to a registration request with a Mobile Network Request extension with the Prefix field set to zero, if a Mobile Router receives a registration reply with a network acknowledgement extension including Code field set to 1 \"invalid prefix\", it may use it as a hint that the home agent does not support dynamic prefix allocation.",
      "ja": "ゼロに設定プレフィックスフィールドとモバイルネットワーク要求拡張の登録要求に応答して、モバイルルータは、1「無効な接頭辞」に設定されたコードフィールドを含むネットワーク確認拡張子で登録応答を受信した場合、それはとして使用することができますホームエージェントは、動的プレフィックスの割り当てをサポートしていないことを暗示。"
    },
    {
      "indent": 0,
      "text": "3.2. Home Agent Considerations",
      "section_title": true,
      "ja": "3.2。ホームエージェント問題"
    },
    {
      "indent": 3,
      "text": "A home agent receiving a Mobile Network Request extension with the Prefix field set to zero MAY return a Mobile Network Acknowledgement extension [RFC5177] with the Prefix field set to the prefix allocated to the Mobile Router. The length of that prefix is at the discretion of the home agent. The home agent MAY take into account the prefix length hint if one is included in the Mobile Network Request extension. Once the home agent allocates a prefix, it MUST maintain the prefix registration table as defined in [RFC5177]. Alternatively, the home agent MAY return a Mobile Network Acknowledgement extension with the Code field set to one of the negative codes defined in [RFC5177].",
      "ja": "ゼロにPrefixフィールドセットでモバイルネットワーク要求の拡張子を受けたホームエージェントは、モバイルルータに割り当てられたプレフィックスに設定プレフィックス]フィールドとモバイルネットワーク謝辞拡張[RFC5177]を返してもよいです。その接頭辞の長さは、ホームエージェントの裁量です。一つは、モバイルネットワーク要求拡張に含まれている場合、ホームエージェントは、プレフィックス長のヒントを考慮に入れることができます。ホームエージェントはプレフィックスを割り当てたら、[RFC5177]で定義されているように、プレフィックス登録テーブルを維持しなければなりません。また、ホームエージェントは、[RFC5177]で定義された負のコードのいずれかにコードフィールドセットとモバイルネットワーク謝辞拡張子を返す場合があります。"
    },
    {
      "indent": 3,
      "text": "Dynamic mobile prefix allocation, as defined in this specification, MAY be combined with dynamic home address allocation, as defined in [RFC5177]. In other words, the home address field of the registration request message MAY be set to zero while the message also includes one or more Mobile Network Request extensions with the Prefix field also set to zero.",
      "ja": "動的モバイルプレフィックス割当[RFC5177]で定義されるように、本明細書で定義されるように、動的ホームアドレス割当と組み合わせてもよいです。メッセージもまたゼロに設定プレフィックス]フィールドを有する1つまたは複数のモバイルネットワーク・リクエスト・拡張機能が含まれている間、他の言葉では、登録要求メッセージのホームアドレスフィールドはゼロに設定されてもよいです。"
    },
    {
      "indent": 3,
      "text": "Once the home agent allocates a prefix, it MUST maintain the prefix registration table as defined in [RFC5177]. The lifetime of the allocated prefix will be equal to the lifetime of the binding cache entry. The Mobile Router may request for multiple mobile network prefixes to be assigned by the home agent. For a Mobile Network Prefix for which the assignment was unsuccessful, the Code field in the corresponding Mobile Network Acknowledgement extension should be set to 4 (MOBNET_UNASSIGNED).",
      "ja": "ホームエージェントはプレフィックスを割り当てたら、[RFC5177]で定義されているように、プレフィックス登録テーブルを維持しなければなりません。割り当てられたプレフィックスの寿命は、バインディングキャッシュエントリの寿命と同じになります。モバイルルータは、ホームエージェントによって割り当てられる複数のモバイルネットワークプレフィックスのために要求することができます。割り当てに失敗したため、モバイルネットワークプレフィックスのために、対応するモバイルネットワーク謝辞拡張におけるコードフィールドは4（MOBNET_UNASSIGNED）に設定されるべきです。"
    },
    {
      "indent": 3,
      "text": "For dynamic prefix allocation, the Mobile Router's home address MAY be used to identify the client if it is not set to zero. Otherwise, as defined in the Network Access Identifier (NAI) extension [RFC2794] of Mobile IPv4 [RFC2794], the NAI extension needs to be included in the registration request, in which case the same extension SHOULD be used to identify the Mobile Router for prefix allocation purposes.",
      "ja": "ダイナミックプレフィックスの割り当てについては、モバイルルータのホームアドレスは、それがゼロに設定されていない場合は、クライアントを識別するために使用されるかもしれません。モバイルIPv4のネットワークアクセス識別子（NAI）拡張子[RFC2794]、[RFC2794]で定義されるようにそうでなければ、NAI拡張は同じ拡張子がためにモバイルルータを識別するために使用されるべき場合には、登録要求に含まれる必要がありますプレフィックスの割り当て目的。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "This specification operates in the security constraints and requirements of Mobile IPv4 [RFC5944], NAI [RFC2794], and [RFC5177].",
      "ja": "この仕様はモバイルIPv4 [RFC5944]、NAI [RFC2794]、および[RFC5177]のセキュリティ制約と要件で動作します。"
    },
    {
      "indent": 3,
      "text": "Home agent implementations SHOULD take steps to prevent address exhaustion attacks. One way to limit the effectiveness of such an attack is to limit the number and size of prefixes any one Mobile Router can be allocated.",
      "ja": "ホーム・エージェントの実装は、アドレス枯渇の攻撃を防ぐための措置をとるべきです。このような攻撃の有効性を制限する一つの方法は、いずれかの移動ルータが割り当てられることができるプレフィックスの数とサイズを制限することです。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "ja": "5. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "A new value has been assigned in the Mobile Network Acknowledgement Extension registry: 4 - Home Agent cannot assign a mobile network prefix (MOBNET_UNASSIGNED).",
      "ja": "新しい値は、モバイルネットワーク謝辞拡張レジストリに割り当てられている：4  - ホームエージェントは、モバイルネットワークプレフィックス（MOBNET_UNASSIGNED）を割り当てることができません。"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgements",
      "section_title": true,
      "ja": "6.謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Pete McCann, Alexandru Petrescu, Ralph Droms, and Jari Arkko for their reviews and comments.",
      "ja": "作者は彼らのレビューとコメントのためのピートマッキャン、アレクサンドル・ペトレスク、ラルフDroms、とヤリArkkoに感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "7. Normative References",
      "section_title": true,
      "ja": "7.引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2794] Calhoun, P. and C. Perkins, \"Mobile IP Network Access Identifier Extension for IPv4\", RFC 2794, March 2000.",
      "ja": "[RFC2794]カルフーン、P.とC.パーキンス、 \"IPv4のモバイルIPネットワークアクセス識別子拡張\"、RFC 2794、2000年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC5177] Leung, K., Dommety, G., Narayanan, V., and A. Petrescu, \"Network Mobility (NEMO) Extensions for Mobile IPv4\", RFC 5177, April 2008.",
      "ja": "[RFC5177]レオン、K.、Dommety、G.、ナラヤナン、V.、およびA.ペトレスク、 \"モバイルIPv4のためのネットワークモビリティ（NEMO）の拡張\"、RFC 5177、2008年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC5944] Perkins, C., \"IP Mobility Support for IPv4, Revised\", RFC 5944, November 2010.",
      "ja": "[RFC5944]パーキンス、C.、 \"IPv4のIPモビリティのサポート、改訂\"、RFC 5944、2010年11月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "George Tsirtsis Qualcomm",
      "ja": "ジョージTsirtsisクアルコム"
    },
    {
      "indent": 3,
      "text": "EMail: tsirtsis@googlemail.com",
      "ja": "メールアドレス：tsirtsis@googlemail.com"
    },
    {
      "indent": 3,
      "text": "Vincent Park Qualcomm",
      "ja": "ヴィンセントパーククアルコム"
    },
    {
      "indent": 3,
      "text": "Phone: +908-443-8141 EMail: vpark@qualcomm.com",
      "ja": "電話：+ 908-443-8141 Eメール：vpark@qualcomm.com"
    },
    {
      "indent": 3,
      "text": "Vidya Narayana Qualcomm",
      "ja": "Vidyaナラヤナクアルコム"
    },
    {
      "indent": 3,
      "text": "Phone: +858-845-2483 EMail: vidyan@qualcomm.com",
      "ja": "電話：+ 858-845-2483 Eメール：vidyan@qualcomm.com"
    },
    {
      "indent": 3,
      "text": "Kent Leung Cisco",
      "ja": "ケント・レオンシスコ"
    },
    {
      "indent": 3,
      "text": "Phone: +408-526-5030 EMail: kleung@cisco.com",
      "ja": "電話：+ 408-526-5030 Eメール：kleung@cisco.com"
    }
  ]
}