{
  "title": {
    "text": "RFC 6705 - Localized Routing for Proxy Mobile IPv6",
    "ja": "RFC 6705 - プロキシモバイルIPv6のためのローカライズされたルーティング"
  },
  "number": 6705,
  "created_at": "2019-10-29 11:02:48.110625+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                       S. Krishnan\nRequest for Comments: 6705                                      Ericsson\nCategory: Standards Track                                      R. Koodli\nISSN: 2070-1721                                            Cisco Systems\n                                                             P. Loureiro\n                                                                     NEC\n                                                                   Q. Wu\n                                                                  Huawei\n                                                                A. Dutta\n                                                                  NIKSUN\n                                                          September 2012",
      "raw": true
    },
    {
      "indent": 16,
      "text": "Localized Routing for Proxy Mobile IPv6",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "Proxy Mobile IPv6 (PMIPv6) is a network based mobility management protocol that enables IP mobility for a host without requiring its participation in any mobility-related signaling. PMIPv6 requires all communications to go through the local mobility anchor. As this can be suboptimal, Localized Routing (LR) allows Mobile Nodes (MNs) attached to the same or different Mobile Access Gateways (MAGs) to route traffic by using localized forwarding or a direct tunnel between the gateways. This document proposes initiation, utilization, and termination mechanisms for localized routing between mobile access gateways within a proxy mobile IPv6 domain. It defines two new signaling messages, Localized Routing Initiation (LRI) and Local Routing Acknowledgment (LRA), that are used to realize this mechanism.",
      "ja": "プロキシモバイルIPv6（PMIPv6の）は、任意のモビリティ関連のシグナリングへの参加を必要とせずにホストのIPモビリティを可能にするネットワークベースのモビリティ管理プロトコルです。 PMIPv6は、ローカル・モビリティ・アンカーを通過するすべての通信を必要とします。これは準最適であることができるように、ローカライズされたルーティング（LR）は、トラフィックをルーティングする同じまたは異なるモバイルアクセスゲートウェイ（MAG群）に取り付けられたモバイルノード（MNの）は、ローカライズされた転送またはゲートウェイとの間の直接トンネルを使用することによって可能となります。この文書では、プロキシモバイルIPv6ドメイン内のモバイル・アクセス・ゲートウェイ間の局所化ルーティングのための開始、利用、および終了メカニズムを提案しています。それは、この仕組みを実現するために使用される2つの新しいシグナリングメッセージ、ローカライズされたルーティングイニシエーション（LRI）とローカルルーティング承認（LRA）を定義しています。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6705.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6705で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2012 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2012 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n2. Conventions Used in This Document ...............................3\n3. Initiation of Localized Routing .................................3\n   3.1. MAG Behavior ...............................................4\n   3.2. LMA Behavior ...............................................4\n4. Teardown of Localized Routing ...................................4\n5. Scenario A11: Two MNs Attached to the Same MAG and LMA ..........4\n   5.1. Handover Considerations ....................................6\n6. Scenario A21: Two MNs Attached to Different MAGs but the\n   Same LMA ........................................................7\n   6.1. Handover Considerations ....................................9\n   6.2. Tunneling between the MAGs .................................9\n7. Scenario A12: Two MNs Attached to the Same MAG with\n   Different LMAs .................................................10\n   7.1. Handover Considerations ...................................12\n8. Scenario A22: Two MNs Attached to Different MAGs with\n   Different LMAs .................................................13\n9. IPv4 Support in Localized Routing ..............................13\n10. Message Formats ...............................................13\n   10.1. Localized Routing Initiation (LRI) .......................14\n   10.2. Localized Routing Acknowledgment (LRA) ...................15\n11. New Mobility Option ...........................................16\n   11.1. MAG IPv6 Address .........................................16\n12. Configuration Variables .......................................17\n13. Security Considerations .......................................17\n14. IANA Considerations ...........................................17\n15. Contributors ..................................................18\n16. Acknowledgments ...............................................18\n17. References ....................................................19\n   17.1. Normative References .....................................19\n   17.2. Informative References ...................................19",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "Proxy Mobile IPv6 [RFC5213] describes the protocol operations to maintain reachability and session persistence for a Mobile Node (MN) without the explicit participation from the MN in signaling operations at the Internet Protocol (IP) layer. In order to facilitate such network-based mobility, the PMIPv6 protocol defines a Mobile Access Gateway (MAG), which acts as a proxy for the Mobile IPv6 [RFC6275] signaling, and the Local Mobility Anchor (LMA), which acts similar to a Home Agent. The LMA and the MAG establish a bidirectional tunnel for forwarding all data traffic belonging to the Mobile Nodes. In the case where both endpoints are located in the same PMIPv6 domain, this can be suboptimal and result in increased delay and congestion in the network. Moreover, it increases transport costs and traffic load at the LMA.",
      "ja": "プロキシモバイルIPv6 [RFC5213]は、インターネットプロトコル（IP）レイヤで動作シグナリングにおけるMNからの明示的な参加なしでモバイル・ノード（MN）の到達可能性およびセッションの持続性を維持するために、プロトコルの動作を説明しています。そのようなネットワーク・ベースのモビリティを容易にするために、のPMIPv6プロトコルは、モバイルIPv6のためのプロキシとして機能するモバイル・アクセス・ゲートウェイ（MAG）、[RFC6275]のシグナリング、及びと同様に作用するローカル・モビリティ・アンカー（LMA）を定義しますホームエージェント。 LMAとMAGは、モバイルノードに属するすべてのデータトラフィックを転送するための双方向トンネルを確立します。両方のエンドポイントが同じPMIPv6ドメインに位置している場合には、これは準最適であることができ、ネットワークにおける遅延の増加や輻輳をもたらします。また、LMAで輸送コストやトラフィック負荷が増加します。"
    },
    {
      "indent": 3,
      "text": "To overcome these issues, localized routing can be used to allow nodes attached to the same or different MAGs to directly exchange traffic by using localized forwarding or a direct tunnel between the gateways. [RFC6279] defines the problem statement for PMIPv6 localized routing. This document describes a solution for PMIPv6 localized routing between two MNs in the same PMIPv6 domain. The protocol specified here assumes that each MN is attached to a MAG and that each MN's MAG has established a binding for the attached MN at its selected LMA according to [RFC5213]. The protocol builds on the scenarios defined in [RFC6279].",
      "ja": "これらの問題を克服するために、ローカライズされたルーティング直接局所的な転送またはゲートウェイ間のダイレクトトンネルを使用してトラフィックを交換するために、同じまたは異なるのMAGに接続されたノードを可能にするために使用することができます。 [RFC6279]はPMIPv6の局在化ルーティングのために問題文を定義します。この文書では、同一のPMIPv6ドメイン内の2つのMN間のPMIPv6局在化ルーティングのための解決策を記載しています。ここで指定されたプロトコルは、各MNがMAGに取り付けられ、各MNのMAGは、[RFC5213]によれば、その選択されたLMAに取り付けMNのバインディングを確立していることであることを前提としています。プロトコルは、[RFC6279]で定義されたシナリオに基づいています。"
    },
    {
      "indent": 0,
      "text": "2. Conventions Used in This Document",
      "section_title": true,
      "ja": "この文書で使用される2.表記"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 3,
      "text": "This document also uses the terminology defined in Section 2 of [RFC6279].",
      "ja": "この文書はまた、[RFC6279]のセクション2で定義された用語を使用しています。"
    },
    {
      "indent": 0,
      "text": "3. Initiation of Localized Routing",
      "section_title": true,
      "ja": "ローカライズされたルーティングの3.開始"
    },
    {
      "indent": 3,
      "text": "Since the traffic to be localized passes through both the LMA and the MAGs, it is possible, at least in some scenarios, for either of them to initiate Localized Routing (LR). In order to eliminate ambiguity, the protocol described in this document selects the initiator of LR based on the rules below.",
      "ja": "ローカライズされるべきトラフィックがLMAとのMAGの両方を通過するので、それらのいずれかがローカライズルーティング（LR）を開始することは、少なくともいくつかのシナリオでは、可能です。あいまいさを排除するために、本文書に記載のプロトコルは以下のルールに基づいて、LRのイニシエータを選択します。"
    },
    {
      "indent": 0,
      "text": "3.1. MAG Behavior",
      "section_title": true,
      "ja": "3.1。 MAGの動作"
    },
    {
      "indent": 3,
      "text": "The MAG MUST initiate LR if both of the communicating MNs are attached to it and the MNs are anchored at different LMAs. The MAG MUST NOT initiate LR in any other case.",
      "ja": "通信中のMNの両方がそれに接続されたMNが別のLMAに固定されている場合、MAGはLRを開始しなければなりません。 MAGは、その他の場合にはLRを開始してはなりません。"
    },
    {
      "indent": 0,
      "text": "3.2. LMA Behavior",
      "section_title": true,
      "ja": "A.o.掘りとき"
    },
    {
      "indent": 3,
      "text": "The LMA MUST initiate LR if both of the communicating MNs are anchored to it. The LMA MUST NOT initiate LR in any other case.",
      "ja": "通信中のMNの両方がそれに固定されている場合LMAはLRを開始しなければなりません。 LMAは、その他の場合にはLRを開始してはなりません。"
    },
    {
      "indent": 0,
      "text": "4. Teardown of Localized Routing",
      "section_title": true,
      "ja": "ローカライズされたルーティングの4ティアダウン"
    },
    {
      "indent": 3,
      "text": "The use of localized routing is not persistent. Localized routing has a defined lifetime as specified by the initiator; upon expiry, the forwarding MUST revert to using bidirectional tunneling. When localized routing ceases, the corresponding Localized Routing Entries (LREs) MUST be removed.",
      "ja": "ローカライズされたルーティングの使用は永続的ではありません。イニシエータによって指定されるように局在ルーティングが定義された寿命を有します。満了時に、転送は、双方向トンネリングを使用するように戻す必要。ローカライズされたルーティングが停止するとき、対応するローカライズされたルーティングエントリ（LRES）が除去されなければなりません。"
    },
    {
      "indent": 3,
      "text": "If the initiator of LR wishes to terminate localized routing before the expiry of the lifetime specified in the LRI message, it MUST do so by sending a new LRI message with the lifetime set to zero.",
      "ja": "LRのイニシエータがLRIメッセージで指定された存続期間の満了前に、ローカライズされたルーティングを終了したい場合、それはゼロに設定さ寿命の新しいLRIメッセージを送信することにより、そうしなければなりません。"
    },
    {
      "indent": 0,
      "text": "5. Scenario A11: Two MNs Attached to the Same MAG and LMA",
      "section_title": true,
      "ja": "5.シナリオA11：同じMAGとLMAに取り付けられた2つのMN"
    },
    {
      "indent": 3,
      "text": "In this scenario, the two Mobile Nodes involved in communication are attached to a single MAG and both are anchored at the same LMA as shown in Figure 1.",
      "ja": "このシナリオでは、通信に関与する2つのモバイルノードは、単一のMAGに取り付けられ、図1に示すように、両方が同じLMAに固定されています。"
    },
    {
      "indent": 31,
      "text": "  Internet\n     :\n     |\n     |\n  +-----+\n  | LMA |\n  +-----+\n     |\n     |\n     |\n  +-----+\n  | MAG |\n  +-----+\n   :   :\n+---+ +---+\n|MN1| |MN2|\n+---+ +---+",
      "raw": true
    },
    {
      "indent": 33,
      "text": "Figure 1",
      "ja": "図1"
    },
    {
      "indent": 3,
      "text": "The LMA initiates a localized routing session by detecting traffic between two MNs attached to the same MAG. The exact traffic identification mechanism is not specified in this document and is left open for implementations and specific deployments. An example trigger could be that an application-layer signaling entity detects the possibility of localized routing and notifies the LMA about the two endpoints, and the LMA determines that the two endpoints are attached to the same MAG. Such a trigger mechanism offers localized routing at the granularity of an individual application session, providing flexibility in usage. It is also possible that one of the mobility entities (LMA or MAG) could decide to initiate localized routing based on configured policy. Please note that a MAG implementing the protocol specified in this document will not dynamically initiate LR in the same LMA case (i.e., by sending an LRI), but can statically initiate LR based on the EnableMAGLocalRouting configuration variable specified in [RFC5213].",
      "ja": "LMAは、同一のMAGに取り付けられた2つのMN間のトラフィックを検出することにより、局所的なルーティングセッションを開始します。正確なトラフィック識別機構は、この文書で指定されておらず、実装および特定の展開のために開放されています。例トリガーは、アプリケーション層シグナリングエンティティが局在ルーティングの可能性を検出し、2つのエンドポイントに関するLMAに通知し、LMAは、2つのエンドポイントが同一のMAGに接続されていることを決定することであってもよいです。そのようなトリガー機構は、使用の柔軟性を提供し、個々のアプリケーションセッションの粒度で局所的なルーティングを提供します。移動性実体（LMAやMAG）のいずれかが設定されたポリシーに基づいて、ローカライズされたルーティングを開始することを決定する可能性もあります。本書で指定されたプロトコルを実装MAGが動的に（すなわち、LRIを送信することによって）同じLMAケース内LRを開始しませんが、静的[RFC5213]で指定のEnableMAGLocalRouting構成変数に基づいて、LRを開始することができることに注意してください。"
    },
    {
      "indent": 6,
      "text": "+----+      +----+      +----+          +----+\n|MN1 |      |MN2 |      |MAG1|          |LMA |\n+----+      +----+      +----+          +----+\n  |           |           |               |\n  |         data          |     data      |\n  |<--------------------->|<------------->|\n  |           |           |               |\n  |           |    data   |     data      |\n  |           |<--------->|<------------->|\n  |           |           |          LR decision\n  |           |           |  LRI(Opt1)    |\n  |           |           |<--------------|\n  |           |           |               |\n  |           |           |  LRA(Opt2)    |\n  |           |           |-------------->|\n  |           |           |               |\n  |        data           |               |\n  |<--------------------->|               |\n  |           |           |               |\n  |           |   data    |               |\n  |           |<--------->|               |\n  |           |           |               |\n  |           |           |               |",
      "raw": true
    },
    {
      "indent": 6,
      "text": "Opt1: MN1-ID,MN1-HNP,MN2-ID,MN2-HNP Opt2: U=0,MN1-ID,MN1-HNP,MN2-ID,MN2-HNP",
      "ja": "OPT1：ID MN1、MN1、HNP、MN2 ID、MN2、HNP OPT2：U = 0、ID MN1、MN1、HNP、MN2 ID、MN2、HNP"
    },
    {
      "indent": 6,
      "text": "where U is the flag defined in Section 10.2.",
      "ja": "Uは10.2節で定義されたフラグです。"
    },
    {
      "indent": 33,
      "text": "Figure 2",
      "ja": "図2"
    },
    {
      "indent": 3,
      "text": "After detecting a possibility for localized routing, the LMA SHOULD construct an LRI message that is used to signal the intent to initiate localized routing and to convey parameters for the same. This is a Mobility Header message and it MUST contain the MN-Identifier (MN-ID) and the Home Network Prefix (HNP) (as Mobility Header options) for each of the MNs involved. The LMA MUST then send the LRI message to the MAG (MAG1) where the two MNs are attached. The initiation of the LR procedure is shown in Figure 2.",
      "ja": "ローカライズされたルーティングの可能性を検出した後、LMAは、局所的なルーティングを開始するために、同一のパラメータを伝達する意図を知らせるために使用さLRIメッセージを構築すべきです。これは、モビリティヘッダのメッセージであり、それが関係するのMNのそれぞれについて、（モビリティヘッダオプションとして）MN-識別子（MN-ID）とホームネットワークプレフィックス（HNP）を含まなければなりません。 LMAは、2つのMNが結合しているMAG（MAG1）にLRIメッセージを送らなければなりません。 LR手続きの開始は、図2に示されています。"
    },
    {
      "indent": 3,
      "text": "The MAG (MAG1) MUST verify the attachment status of the two MNs locally by checking the binding cache. The MAG MUST then verify if the EnableMAGLocalRouting flag is set to 1. If it is not, the MAG has not been configured to allow localized routing, and it MUST reject the LRI and MUST send an LRA with Status code \"Localized Routing Not Allowed\". Please note that this does not update behavior specified in [RFC5213] but merely implements the LMA enforcement specified in Section 6.10.3 of [RFC5213]. If the MAG is configured to allow localized routing, it MUST then create LREs for each direction of the communication between the two MNs. The exact form of the forwarding entries is left for the implementations to decide; however, they SHOULD contain the HNP corresponding to the destination IP address and a next-hop identifier (e.g., the layer-2 address of the next hop). These LREs MUST override the Binding Update List (BUL) entries for the specific HNPs identified in the LRI message. Hence, all traffic matching the HNPs is forwarded locally.",
      "ja": "MAG（MAG1）は、ローカルにバインディングキャッシュをチェックすることにより、2つのMNの装着状態を確かめなければなりません。そうでない場合のEnableMAGLocalRoutingフラグが1に設定されている場合、MAGはその後、MAGは、ローカライズされたルーティングを許可するように設定されていない確認する必要があり、それがLRIを拒絶しなければなりませんし、ステータスコード「許可されていませんローカライズされたルーティング」とLRAを送らなければなりません。これは[RFC5213]で指定された動作を更新しないことに注意してくださいしかし、単に[RFC5213]のセクション6.10.3に指定されたLMAの執行を実装してください。 MAGが局在ルーティングを可能にするように構成されている場合、それは2つのMN間の通信の各方向についてLRESを作成する必要があります。転送エントリの正確な形態は、決定する実装のために残されています。しかし、それらは、宛先IPアドレスと次ホップ識別子（次のホップの例えば、レイヤ2アドレス）に対応したHNPを含むべきです。これらのLRESはLRIメッセージで識別される特定のHNPのためのバインディング更新リスト（BUL）エントリをオーバーライドする必要があります。したがって、たHNPに一致するすべてのトラフィックがローカルに転送されます。"
    },
    {
      "indent": 3,
      "text": "If the MAG is unable to deliver packets using the LREs, it is possible that one of the MNs is no longer attached to the MAG. Hence, the MAG MUST fall back to using the BUL entry, and the LMA MUST forward the received packets using its Binding Cache Entry (BCE).",
      "ja": "MAGはLRESを使用してパケットを配信することができない場合、のMNの一つは、もはやMAGに接続されている可能性がありません。従って、MAGは、バックBULエントリを使用することに入らなければならない、とLMAは、その結合キャッシュ・エントリ（BCE）を使用して受信したパケットを転送しなければなりません。"
    },
    {
      "indent": 3,
      "text": "After processing the LRI message, the MAG MUST respond with a Local Routing Acknowledgment (LRA) message. This Mobility Header message MUST also include the MN-ID and the HNP for each of the communicating MNs, as well as an appropriate Status code indicating the outcome of LRI processing. Status code 0 indicates localized routing was successfully offered by the MAG. Any other value for Status code indicates the reason for the failure to offer localized routing service. When Status code is 0, the LMA sets a flag in the BCE corresponding to the HNPs to record that localized routing is in progress for that HNP.",
      "ja": "LRIメッセージを処理した後に、MAGは、ローカルルーティング応答（LRA）メッセージで応答しなければなりません。このモビリティヘッダメッセージは、MN-IDと通信するMNのそれぞれについてHNP、ならびにLRI処理の結果を示す適切なステータスコードを含まなければなりません。ステータスコード0は、ローカライズされたルーティングが正常にMAGによって提供されたことを示します。ステータスコードのために他の値は、ローカライズされたルーティングサービスを提供するために失敗の理由を示しています。ステータスコードが0である場合、LMAは、局所ルーティングがそのHNPために進行中であることを記録するためのHNPに対応BCEにフラグを設定します。"
    },
    {
      "indent": 0,
      "text": "5.1. Handover Considerations",
      "section_title": true,
      "ja": "5.1。ハンドオーバーの注意事項"
    },
    {
      "indent": 3,
      "text": "If one of the MNs, say MN1, detaches from the MAG and attaches to another MAG (say nMAG), the localized routing state needs to be re-established. When the LMA receives the PBU from nMAG for MN1, it will see that localized routing is active for MN1. The LMA MUST hence initiate LR at nMAG and update the LR state of pMAG. After the handover completes, LR will resemble Scenario A21. The pMAG MUST follow the forwarding rules described in Section 6.10.5 of [RFC5213] and decide that it will no longer perform LR for MN1.",
      "ja": "MNの一つは、MN1を言う場合は、MAGから切り離し、別のMAG（nMAGを言う）に取り付けられ、局在ルーティング状態を再確立する必要があります。 LMAは、MN1のためnMAGからPBUを受信すると、ローカライズされたルーティングは、MN1のためにアクティブであることがわかります。 LMAは、したがってnMAGでLRを開始し、PMAGのLR状態を更新する必要があります。ハンドオーバが完了した後、LRは、シナリオA21のようになります。 PMAGは、[RFC5213]のセクション6.10.5で説明した転送ルールに従うと、それはもはやMN1のためのLRを実行しないことを決定しなければなりません。"
    },
    {
      "indent": 0,
      "text": "6. Scenario A21: Two MNs Attached to Different MAGs but the Same LMA",
      "section_title": true,
      "ja": "6.シナリオA21：つの異なるのMAGに付属のMNが、同じLMA"
    },
    {
      "indent": 3,
      "text": "The LMA may choose to support local forwarding to Mobile Nodes attached to two different MAGs within a single PMIPv6 domain.",
      "ja": "LMAは、単一のPMIPv6ドメイン内の2つの異なるのMAGに取り付けられたモバイルノードに対してローカル転送をサポートすることを選択することができます。"
    },
    {
      "indent": 28,
      "text": "     Internet\n        :\n        |\n        |\n     +-----+\n     | LMA |\n     +-----+\n        |\n        |\n   +----+-----+\n   |          |\n+----+     +----+\n|MAG1|     |MAG2|\n+----+     +----+\n  :           :\n+---+       +---+\n|MN1|       |MN2|\n+---+       +---+",
      "raw": true
    },
    {
      "indent": 33,
      "text": "Figure 3",
      "ja": "図3"
    },
    {
      "indent": 3,
      "text": "As earlier, the LMA initiates LR as a response to some trigger mechanism. In this case, however, it MUST send two separate LRI messages to the two MAGs. In addition to the MN-ID and the HNP options, each LRI message MUST contain the IP address of the counterpart MAG. When the MAG IP address option is present, each MAG MUST create a local forwarding entry such that the packets for the MN attached to the remote MAG are sent over a tunnel associated with that remote MAG. The tunnel between the MAGs is assumed to be established following the considerations mentioned in Section 6.2.",
      "ja": "以前のように、LMAは、いくつかのトリガ機構への応答としてLRを開始します。しかし、この場合、2つのMAGへの2つの別々のLRIメッセージを送らなければなりません。 MN-IDとHNPオプションに加えて、各LRIメッセージは、相手MAGのIPアドレスを含まなければなりません。 MAGのIPアドレスオプションが存在する場合、各MAGは、MAGリモートに取り付けられたMNのためのパケットは、そのリモートMAGに関連付けられたトンネルを介して送信されるように、ローカル転送エントリを作成する必要があります。 MAG間にトンネルはセクション6.2で述べた検討事項次の確立されているものとします。"
    },
    {
      "indent": 6,
      "text": "+----+      +----+      +----+      +----+        +----+\n|MN1 |      |MN2 |      |MAG1|      |MAG2|        |LMA |\n+----+      +----+      +----+      +----+        +----+\n  |           |           |           |             |\n  |        data           |          data           |\n  |<--------------------->|<----------------------->|\n  |           |           |           |             |\n  |           |         data          |    data     |\n  |           |<--------------------->|<----------->|\n  |           |           |           |             |\n  |           |           |           |             |\n  |           |           |       LRI(Opt1)         |\n  |           |           |<------------------------|\n  |           |           |           |             |\n  |           |           |           |  LRI(Opt2)  |\n  |           |           |           |<------------|\n  |           |           |           |             |\n  |           |           |        LRA(Opt3)        |\n  |           |           |------------------------>|\n  |           |           |           |             |\n  |           |           |           |   LRA(Opt4) |\n  |           |           |           |------------>|\n  |           |           |           |             |\n  |           |           |           |             |\n  |           |           |           |             |\n  |        data           |    data   |             |\n  |<--------------------->|<--------->|             |\n  |           |           |           |             |\n  |           |         data          |             |\n  |           |<--------------------->|             |\n  |           |           |           |             |\n  |           |           |           |             |",
      "raw": true
    },
    {
      "indent": 6,
      "text": "Opt1: MN1-ID,MN1-HNP,MAG2-IPv6-Address Opt2: MN2-ID,MN2-HNP,MAG1-IPv6-Address Opt3: U=0,MN1-ID,MN1-HNP,MAG2-IPv6-Address Opt4: U=0,MN2-ID,MN2-HNP,MAG1-IPv6-Address",
      "ja": "OPT1：MN1-ID、MN1-HNP、MAG2-のIPv6アドレスOPT2：MN2-ID、MN2-HNP、MAG1-のIPv6アドレスOPT3：U = 0、MN1-ID、MN1-HNP、MAG2-のIPv6アドレスOpt4 ：U = 0、MN2-ID、MN2-HNP、MAG1-のIPv6アドレス"
    },
    {
      "indent": 6,
      "text": "where U is the flag defined in Section 10.2.",
      "ja": "Uは10.2節で定義されたフラグです。"
    },
    {
      "indent": 33,
      "text": "Figure 4",
      "ja": "図4"
    },
    {
      "indent": 3,
      "text": "In this case, each MAG responds to the LRI with an LRA message. All subsequent packets are routed between the MAGs locally, without traversing the LMA. If one of the MAGs (say MAG1) responds with a successful LRA (Status value is zero) and the other (say MAG2) responds with an error (Status value is non-zero), LR will still be performed in one direction (MN1->MAG1->MAG2->MN2), but the packets flowing the other way will take the LMA path (MN2->MAG2->LMA->MAG1->MN1).",
      "ja": "この場合、各MAGは、LRAメッセージでLRIに応答します。後続のすべてのパケットはLMAを横断せずに、ローカルでのMAGの間でルーティングされます。 MAG（MAG1と言う）のいずれかが成功したLRA（ステータス値がゼロ）と（ステータス値が非ゼロである）エラーを有する（例えばMAG2）他の応答で応答する場合、LRは依然としてMN1（一方向に行われます - > MAG1-> MAG2-> MN2）が、他の方法を流れるパケットがLMAパス（MN2-> MAG2-> LMA-> MAG1-> MN1）を取ります。"
    },
    {
      "indent": 3,
      "text": "The protocol does not require any synchronization between the MAGs before local forwarding begins. Each MAG begins its local forwarding independent of the other.",
      "ja": "地元の転送が始まる前に、プロトコルは、MAGを間に任意の同期を必要としません。各MAGは、他のローカルフォワーディングの独立を開始します。"
    },
    {
      "indent": 3,
      "text": "No synchronization between the MAGs is required because each MAG initiates LR in one direction. After the LMA instructs MAG1 to initiate LR, packets from MN1 to MN2 will take the path MN1->MAG1->MAG2->MN2 while those from MN2 to MN1 will take the path MN2->MAG2->LMA->MAG1->MN1 until the LMA instructs MAG2 to initiate LR as well. A MAG will forward a packet towards either another MAG or its own LMA; therefore, there would be no duplication of packets.",
      "ja": "各MAGは、一方向にLRを開始するためのMAGとの間には同期は必要とされません。 LMAはLRを開始するMAG1に指示した後、MN2からMN1へものMN2-> MAG2-> LMA-> MAG1->パスを取るが、MN1からMN2へのパケットパスMN1-> MAG1-> MAG2-> MN2を取りますLMAまでMN1は、MAG2が同様にLRを開始するように指示します。 MAGは、別のMAGまたは独自のLMAのいずれかに向けてパケットを転送します。そのため、パケットのない重複はないだろう。"
    },
    {
      "indent": 0,
      "text": "6.1. Handover Considerations",
      "section_title": true,
      "ja": "6.1。ハンドオーバーの注意事項"
    },
    {
      "indent": 3,
      "text": "If one of the MNs, say MN1, detaches from its current MAG (in this case MAG1) and attaches to another MAG (say nMAG1), the localized routing state needs to be re-established. When the LMA receives the PBU from nMAG1 for MN1, it will see that localized routing is active for MN1. The LMA MUST then initiate LR at nMAG1 and update the LR state of MAG2 to use nMAG1 instead of MAG1.",
      "ja": "MNの一つは、MN1を言う場合、（nMAG1を言う）は、その現在のMAG（この場合はMAG1）から切り離し、別のMAGに付着する、ローカライズされたルーティング状態を再確立する必要があります。 LMAは、MN1のためnMAG1からPBUを受信すると、ローカライズされたルーティングは、MN1のためにアクティブであることがわかります。 LMAは次いでnMAG1でLRを開始し、nMAG1代わりのMAG1を使用するMAG2のLR状態を更新する必要があります。"
    },
    {
      "indent": 0,
      "text": "6.2. Tunneling between the MAGs",
      "section_title": true,
      "ja": "6.2。 MAG間のトンネル"
    },
    {
      "indent": 3,
      "text": "In order to support localized routing, both MAGs SHOULD support the following encapsulation modes for the user packets, which are also defined for the tunnel between the LMA and MAG:",
      "ja": "局所的なルーティングをサポートするために、両方のMAGはまた、LMAとMAGとの間のトンネルのために定義されたユーザパケットは、次のカプセル化モードをサポートする必要があります。"
    },
    {
      "indent": 3,
      "text": "o IPv4-or-IPv6-over-IPv6 [RFC5844]",
      "ja": "OのIPv4またはIPv6の-オーバーのIPv6 [RFC5844]"
    },
    {
      "indent": 3,
      "text": "o IPv4-or-IPv6-over-IPv4 [RFC5844]",
      "ja": "OのIPv4またはIPv6の-オーバーのIPv4 [RFC5844]"
    },
    {
      "indent": 3,
      "text": "o IPv4-or-IPv6-over-IPv4-UDP [RFC5844]",
      "ja": "OのIPv4またはIPv6の-オーバーのIPv4-UDP [RFC5844]"
    },
    {
      "indent": 3,
      "text": "o TLV-header UDP tunneling [RFC5845]",
      "ja": "O TLVヘッダUDPトンネリング[RFC5845]"
    },
    {
      "indent": 3,
      "text": "o Generic Routing Encapsulation (GRE) tunneling with or without GRE key(s) [RFC5845]",
      "ja": "GREキー（S）を伴うまたは伴わないO総称ルーティングカプセル化（GRE）トンネル[RFC5845]"
    },
    {
      "indent": 3,
      "text": "MAG1 and MAG2 MUST use the same tunneling mechanism for the data traffic tunneled between them. The encapsulation mode to be employed SHOULD be configurable. It is RECOMMENDED that:",
      "ja": "MAG1およびMAG2は、それらの間でトンネリングされたデータトラフィックに同じトンネリングメカニズムを使用しなければなりません。採用されるカプセル化モードは設定可能であるべきです。これは、することをお勧めします。"
    },
    {
      "indent": 3,
      "text": "1. As the default behavior, the inter-MAG tunnel uses the same encapsulation mechanism as that being used for the PMIPv6 tunnel between the LMA and the MAGs. MAG1 and MAG2 automatically start using the same encapsulation mechanism without a need for a special configuration on the MAGs or a dynamic tunneling mechanism negotiation between them.",
      "ja": "デフォルトの動作として1は、インターMAGトンネルは、LMAとのMAGとの間のPMIPv6トンネルに使用されるものと同じカプセル化メカニズムを使用します。 MAG1とMAG2は自動的のMAGに特別な設定や、それらの間の動的なトンネリングメカニズムの交渉を必要とせずに同じカプセル化メカニズムを使用して開始します。"
    },
    {
      "indent": 3,
      "text": "2. Configuration on the MAGs can override the default mechanism specified in Option 1 above. MAG1 and MAG2 MUST be configured with the same mechanism, and this configuration is most likely to be uniform throughout the PMIPv6 domain. If the packets on the PMIPv6 tunnel cannot be uniquely mapped onto the configured inter-MAG tunnel, this scenario is not applicable, and Option 3 below SHOULD directly be applied.",
      "ja": "MAG 2.上記の設定はオプション1で指定したデフォルトのメカニズムを無効にすることができます。 MAG1とMAG2は同じメカニズムで構成されなければならないが、この構成では、PMIPv6ドメインにわたって均一である可能性が最も高いです。 PMIPv6トンネルにパケットを一意に構成されたインターMAGトンネルにマッピングすることができない場合、このシナリオは適用されない、そしてオプション3は、以下に直接適用されるべきです。"
    },
    {
      "indent": 3,
      "text": "3. An implicit or explicit tunnel negotiation mechanism between the MAGs can override the default mechanism specified in Option 1 above. The employed tunnel negotiation mechanism is outside the scope of this document.",
      "ja": "3のMAGとの間の暗黙的または明示的なトンネルネゴシエーション機構は、上記のオプション1で指定したデフォルトの機構をオーバーライドすることができます。使用トンネルネゴシエーション機構は、この文書の範囲外です。"
    },
    {
      "indent": 0,
      "text": "7. Scenario A12: Two MNs Attached to the Same MAG with Different LMAs",
      "section_title": true,
      "ja": "7.シナリオA12：異なるのLMAと同じMAGに取り付けられた2つのMN"
    },
    {
      "indent": 3,
      "text": "In this scenario, both the MNs are attached to the same MAG, but are\nanchored at two different LMAs.  MN1 is anchored at LMA1, and MN2 is\nanchored at LMA2.  Note that the two LMAs are part of the same\nProvider Domain.\n                              Internet\n                        :                  :\n                        +------------------+\n                        |                  |\n                     +----+              +----+\n                     |LMA1|              |LMA2|\n                     +----+              +----+\n                        |                  |\n                        |                  |\n                        +------------------+\n                                 |\n                                 |\n                                 |\n                              +-----+\n                              | MAG |\n                              +-----+\n                               :   :\n                            +---+ +---+\n                            |MN1| |MN2|\n                            +---+ +---+",
      "raw": true
    },
    {
      "indent": 33,
      "text": "Figure 5",
      "ja": "図5"
    },
    {
      "indent": 3,
      "text": "Hence, neither LMA has a means to determine that the two Mobile Nodes are attached to the same MAG. Only the MAG can possibly determine that the two Mobile Nodes involved in communication are attached to it. Therefore, localized routing MUST be initiated by the MAG.",
      "ja": "したがって、どちらのLMAは、2つのモバイルノードが同一のMAGに接続されていることを決定するための手段を有します。唯一のMAGは、おそらく通信に関与する2つのモバイルノードは、それに接続されていると判断することができます。したがって、ローカライズされたルーティングはMAGによって開始されなければなりません。"
    },
    {
      "indent": 3,
      "text": "The MAG sends an LRI message containing the MN-ID, HNP, and the counterpart LMA address to each LMA. Each LMA makes a decision to support local forwarding independently based on configured policy for the corresponding LMA. Each LMA MUST respond to the LRI message with an LRA message. If the initiation of LR on the LMA was successful, the Status value in the received LRA would be set to zero. After the MAG receives both the LRA messages, each with the Status value set to zero (success) from the two different LMAs, the MAG will conclude that it can provide local forwarding support for the two Mobile Nodes.",
      "ja": "MAGは、MN-ID、HNP、および各LMAに相手LMAアドレスを含むLRIメッセージを送信します。各LMAは、独立して、対応するLMAのため設定されたポリシーに基づいて、ローカル転送をサポートすることを決定します。各LMAは、LRAメッセージでLRIメッセージに反応しなければなりません。 LMA上のLRの開始が成功した場合、受信LRAのStatus値がゼロに設定されます。 MAGは、2つの異なるのLMAからLRAメッセージ、ゼロ（成功）に設定された状態値を有する各両方を受信した後に、MAGは、2つのモバイルノードのローカル転送のサポートを提供することができると結論します。"
    },
    {
      "indent": 6,
      "text": "+----+      +----+      +----+      +----+        +----+\n|MN1 |      |MN2 |      |MAG |      |LMA1|        |LMA2|\n+----+      +----+      +----+      +----+        +----+\n  |           |           |           |             |\n  |        data           |   data    |    data     |\n  |<--------------------->|<--------->|<----------->|\n  |           |           |           |             |\n  |           |   data    |          data           |\n  |           |<--------->|<----------------------->|\n  |           |           |           |             |\n  |           |           |           |             |\n  |           |           | LRI(Opt1) |             |\n  |           |           |---------->|             |\n  |           |           |           |             |\n  |           |           |        LRI(Opt2)        |\n  |           |           |------------------------>|\n  |           |           |           |             |\n  |           |           | LRA(Opt3) |             |\n  |           |           |<----------|             |\n  |           |           |           |             |\n  |           |           |        LRA(Opt4)        |\n  |           |           |<------------------------|\n  |           |           |           |             |\n  |           |           |           |             |\n  |           |           |           |             |\n  |        data           |           |             |\n  |<--------------------->|           |             |\n  |           |           |           |             |\n  |           |    data   |           |             |\n  |           |<--------->|           |             |\n  |           |           |           |             |\n  |           |           |           |             |",
      "raw": true
    },
    {
      "indent": 6,
      "text": "Opt1: MN1-ID,MN1-HNP Opt2: MN2-ID,MN2-HNP Opt3: U=0,MN1-ID,MN1-HNP Opt4: U=0,MN2-ID,MN2-HNP",
      "ja": "OPT1：ID MN1、MN1、HNP OPT2：MN2 ID、MN2、HNP OPT3：U = 0、ID MN1、MN1、HNP Opt4：U = 0、MN2 ID、MN2、HNP"
    },
    {
      "indent": 6,
      "text": "where U is the flag defined in Section 10.2.",
      "ja": "Uは10.2節で定義されたフラグです。"
    },
    {
      "indent": 33,
      "text": "Figure 6",
      "ja": "図6"
    },
    {
      "indent": 0,
      "text": "7.1. Handover Considerations",
      "section_title": true,
      "ja": "7.1。ハンドオーバーの注意事項"
    },
    {
      "indent": 3,
      "text": "If one of the MNs, say MN1, detaches from its current MAG (in this case MAG1) and attaches to another MAG (say nMAG1), the current MAG MUST immediately stop using the LRE and MUST send all packets originated by the other MN (MN2) towards its LMA (in this case LMA2).",
      "ja": "MNの一つは、MN1は、（nMAG1を言う）、現在のMAGはすぐにLREの使用を停止しなければならなくて、他のMN（から発信されるすべてのパケットを送らなければなりません、現在のMAG（この場合はMAG1）から切り離し、別のMAGに接続すると言うならこの場合、LMA2内のLMA（）へのMN2）。"
    },
    {
      "indent": 0,
      "text": "8. Scenario A22: Two MNs Attached to Different MAGs with Different LMAs",
      "section_title": true,
      "ja": "8.シナリオA22：異なるのLMAと異なるのMAGに取り付けられた2つのMN"
    },
    {
      "indent": 3,
      "text": "This scenario will not be covered in this document since PMIPv6 does not define any form of inter-LMA communication. When a supported scenario, such as Scenario A12, morphs into Scenario A22, the node that initiated the localized routing session MUST tear it down in order to prevent lasting packet loss. This can result in transient packet loss when routing switches between the localized path into the normal path through the LMAs. In applications that are loss sensitive, this can lead to observable service disruptions. In deployments where Scenario A22 is possible, the use of localized routing is NOT RECOMMENDED when packet-loss-sensitive applications are in use.",
      "ja": "PMIPv6のは間LMA通信の任意の形式を定義していないので、このシナリオでは、この文書でカバーされることはありません。このようなシナリオA12のようなサポートシナリオが、シナリオA22にモーフ場合、ローカライズされたルーティングセッションを開始したノードは、永続的なパケット損失を防止するために、それを切断しなければなりません。 LMAを介して通常のパスにローカライズ経路との間のスイッチをルーティングするとき、これは過渡パケット損失をもたらすことができます。損失敏感なアプリケーションでは、これは、観察可能なサービスの中断につながることができます。パケット損失に敏感なアプリケーションを使用しているとき、シナリオA22が可能である展開では、ローカライズされたルーティングの使用は推奨されません。"
    },
    {
      "indent": 0,
      "text": "9. IPv4 Support in Localized Routing",
      "section_title": true,
      "ja": "ローカライズされたルーティング9. IPv4のサポート"
    },
    {
      "indent": 3,
      "text": "PMIPv6 MNs can use an IPv4 Home Address (HoA) as described in [RFC5844]. In order to support the setup and maintenance of localized routes for these IPv4 HoAs in PMIPv6, the MAGs MUST add the IPv4 HoAs into their LREs. The MAGs MUST also support encapsulation of IPv4 packets as described in [RFC5844]. The localized routing protocol messages MUST include an IPv4 HoA option in their signaling messages in order to support IPv4 addresses for localized routing.",
      "ja": "[RFC5844]に記載されているようのPMIPv6のMNは、IPv4ホームアドレス（HoA）を使用することができます。 PMIPv6の中にこれらのIPv4のHoAのローカライズされたルートの設定やメンテナンスをサポートするために、のMAGは、そのLRESへのIPv4のHoAを加えなければなりません。 [RFC5844]に記載されているようのMAGはまた、IPv4パケットのカプセル化をサポートしなければなりません。ローカライズされたルーティング・プロトコル・メッセージは、ローカライズされたルーティングのIPv4アドレスをサポートするために、そのシグナリングメッセージ内のIPv4のHoAオプションを含まなければなりません。"
    },
    {
      "indent": 3,
      "text": "If the transport network between the PMIPv6 entities involved in localized routing is IPv4-only, the LRI and LRA messages MUST be encapsulated similar to the PBU/PBA messages as specified in [RFC5844]. The encapsulation mode used SHOULD be identical to the one used to transport PBU and PBA messages.",
      "ja": "ローカライズされたルーティングに関与するのPMIPv6エンティティ間のトランスポートネットワークは、IPv4のみである場合、[RFC5844]で指定されるように、LRIとLRAメッセージがPBU / PBAメッセージと同様にカプセル化されなければなりません。使用されるカプセル化モードは、PBU及びPBAメッセージを転送するために使用されるものと同一であるべきです。"
    },
    {
      "indent": 0,
      "text": "10. Message Formats",
      "section_title": true,
      "ja": "10.メッセージフォーマット"
    },
    {
      "indent": 3,
      "text": "The localized routing messages use two new Mobility Header types (17 and 18). The LRI message requests creation or deletion of the localized routing state, and the LRA message acknowledges the creation or deletion of such localized routing state.",
      "ja": "ローカライズされたルーティングメッセージは、2つの新しいモビリティヘッダタイプ（17及び18）を使用します。 LRIメッセージは、ローカライズされたルーティング状態の作成または削除を要求し、LRAメッセージは、ローカライズされたルーティング状態の作成または削除を承認します。"
    },
    {
      "indent": 0,
      "text": "10.1. Localized Routing Initiation (LRI)",
      "section_title": true,
      "ja": "10.1。ローカライズされたルーティング開始（LRI）"
    },
    {
      "indent": 3,
      "text": "The LRI messages use a new Mobility Header type (17). The LMA sends an LRI message to a MAG to request local forwarding for a pair of MNs. The MAG may also send this message to request the two LMAs for offering local forwarding as described in Section 7.",
      "ja": "LRIメッセージは、新しいモビリティヘッダタイプ（17）を使用します。 LMAは、MNの一対のローカル転送を要求するためにMAGにLRIメッセージを送信します。 MAGはまた、第7節に記載されているように、ローカル転送を提供するための2つのLMAを要求するためにこのメッセージを送信することができます。"
    },
    {
      "indent": 4,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n                                +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n                                |           Sequence #          |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         Reserved              |           Lifetime            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                                                               |\n.                                                               .\n.                        Mobility options                       .\n.                                                               .\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 6,
      "text": "Sequence Number: A monotonically increasing integer. Set by a sending node in a request message and used to match a reply to the request.",
      "ja": "シーケンス番号：単調に増加する整数。要求メッセージに送信ノードによって設定された要求に対する応答を一致させるために使用されます。"
    },
    {
      "indent": 6,
      "text": "Reserved: This field is unused and MUST be set to zero.",
      "ja": "予約：このフィールドは使用されず、ゼロに設定しなければなりません。"
    },
    {
      "indent": 6,
      "text": "Lifetime: The requested time, in seconds, for which the sender wishes to have local forwarding. A value of 0xffff (all ones) indicates an infinite lifetime. When set to 0, indicates a request to stop localized routing.",
      "ja": "生涯：要求された時間、秒単位で、送信者がローカルフォワーディングを持っていることを望むいます。 0xFFFFの（すべてのもの）の値は、無限の寿命を示しています。 0に設定すると、局所的なルーティングを停止する要求を示します。"
    },
    {
      "indent": 6,
      "text": "Mobility Options: MUST contain two separate MN-ID options, followed by one or more HNPs for each of the MNs. For instance, for Mobile Nodes MN1 and MN2 with identifiers MN1-ID and MN2-ID, and Home Network Prefixes MN1-HNP and MN2-HNP, the following tuple MUST be present in the following order: [MN1-ID, MN1-HNP], [MN2-ID, MN2-HNP]. The MN-ID and HNP options are the same as in [RFC5213]. The LRI MAY contain the remote MAG IPv6 address option, which is formatted identically to the HNP option, except that it uses a different Type code and the Prefix Length is always equal to 128 bits (see Section 10.1).",
      "ja": "モビリティオプション：のMNのそれぞれに1つのまたは複数のHNPに続く二つの別々のMN-IDのオプションを、含まれていなければなりません。例えば、モバイルノードMN1及びMN2識別子MN1-IDとMN2-IDと、ホームネットワークプレフィックスMN1-HNPおよびMN2-HNPために、以下のタプルは以下の順序で存在していなければなりません：[MN1-ID、MN1-HNP ]、[MN2-ID、MN2-HNP]。 MN-IDとHNPオプションは[RFC5213]と同じです。 LRIは、異なるタイプのコードを使用して、プレフィックス長は常に128ビット（10.1節を参照）と同じであることを除いて、HNPオプションと同一にフォーマットされたリモートMAG IPv6アドレスオプションを含むことができます。"
    },
    {
      "indent": 3,
      "text": "The LRI message SHOULD be re-transmitted if a corresponding LRA message is not received within LRA_WAIT_TIME time units, up to a maximum of LRI_RETRIES, each separated by LRA_WAIT_TIME time units.",
      "ja": "対応するLRAメッセージがLRI_RETRIESの最大、LRA_WAIT_TIME時間単位で区切っまで、LRA_WAIT_TIME時間単位内に受信されない場合LRIメッセージが再送信されなければなりません。"
    },
    {
      "indent": 0,
      "text": "10.2. Localized Routing Acknowledgment (LRA)",
      "section_title": true,
      "ja": "10.2。ローカライズされたルーティング承認（LRA）"
    },
    {
      "indent": 3,
      "text": "The LRA messages use a new Mobility Header type (18). A MAG sends an LRA message to the LMA as a response to the LRI message. An LMA may also send this message to a MAG as a response to the LRI message as described in Section 7.",
      "ja": "LRAのメッセージは、新しいモビリティヘッダタイプ（18）を使用します。 MAGはLRIメッセージに対する応答として、LMAへLRAメッセージを送信します。 LMAはまた、第7節に記載されているようにLRIメッセージに対する応答として、MAGにこのメッセージを送信することができます。"
    },
    {
      "indent": 4,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n                                +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n                                |           Sequence #          |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|U|  Reserved   |   Status      |           Lifetime            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                                                               |\n.                                                               .\n.                        Mobility options                       .\n.                                                               .\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 6,
      "text": "Sequence Number: Copied from the sequence number field of the LRI message being responded to.",
      "ja": "シーケンス番号：に反応さLRIメッセージのシーケンス番号フィールドからコピーされます。"
    },
    {
      "indent": 7,
      "text": "'U' flag: When set to 1, the LRA message is sent unsolicited.",
      "ja": "「U」フラグ：1に設定すると、LRAメッセージが迷惑送信されます。"
    },
    {
      "indent": 7,
      "text": "The Lifetime field indicates a new requested value. The MAG MUST wait for the regular LRI message to confirm that the request is acceptable to the LMA.",
      "ja": "Lifetimeフィールドは、新しい要求された値を示しています。 MAGは、要求がLMAに許容可能であることを確認するために、定期的LRIメッセージを待たなければなりません。"
    },
    {
      "indent": 7,
      "text": "Reserved: This field is unused and MUST be set zero.",
      "ja": "予約：このフィールドは未使用で、ゼロに設定しなければなりません。"
    },
    {
      "indent": 7,
      "text": "Status: 8-bit unsigned integer indicating the result of processing the Localized Routing Acknowledgment message. Values of the Status field less than 128 indicate that the Localized Routing Acknowledgment was processed successfully by the mobility entities(LMA or MAG). Values greater than or equal to 128 indicate that the Localized Routing Acknowledgment was rejected by the mobility entities. The following Status values are currently defined:",
      "ja": "ステータス：ローカライズルーティング確認メッセージを処理した結果を示す8ビットの符号なし整数。 Statusフィールド128未満の値は、ローカライズされたルーティング謝辞は移動性実体（LMAやMAG）によって正常に処理されたことを示しています。 128以上の値がローカライズされたルーティング謝辞は、モビリティエンティティによって拒否されたことを示しています。以下のステータス値が現在定義されています："
    },
    {
      "indent": 10,
      "text": "0: Success 128: Localized Routing Not Allowed 129: MN Not Attached",
      "ja": "0：成功128：ローカライズされたルーティングが129許可されていません：接続されていないMN"
    },
    {
      "indent": 7,
      "text": "Lifetime: The time, in seconds, for which local forwarding is supported. It is typically copied from the corresponding field in the LRI message.",
      "ja": "生涯：時間（秒）は、どのローカルフォワーディングのためにサポートされています。それは、典型的には、LRIメッセージの対応するフィールドからコピーされます。"
    },
    {
      "indent": 7,
      "text": "Mobility Options: When Status code is 0, MUST contain the [MN-ID, HNP] tuples in the same order as in the LRI message. When Status code is not 0, MUST contain only those [MN-ID, HNP] tuples for which local forwarding is supported. The MN-ID and HNP options are the same as those described in [RFC5213].",
      "ja": "モビリティオプション：ステータスコードが0である場合、含まなければならない[MN-IDを、HNP] LRIメッセージと同じ順序でタプル。ステータスコードが0でない場合、ローカル転送がサポートされているのみ[MN-ID、HNP]タプルを含まなければなりません。 MN-IDとHNPオプションは、[RFC5213]に記載のものと同じです。"
    },
    {
      "indent": 0,
      "text": "11. New Mobility Option",
      "section_title": true,
      "ja": "11.新しいモビリティオプション"
    },
    {
      "indent": 0,
      "text": "11.1. MAG IPv6 Address",
      "section_title": true,
      "ja": "11.1。 MAG IPv6アドレス"
    },
    {
      "indent": 3,
      "text": "The MAG IPv6 address mobility option contains the IPv6 address of a MAG involved in localized routing. The MAG IPv6 address option has an alignment requirement of 8n+4.",
      "ja": "MAGのIPv6アドレスモビリティオプションは、ローカライズされたルーティングに関与MAGのIPv6アドレスが含まれています。 MAG IPv6アドレスオプションは、8N + 4の位置合わせ要件を有しています。"
    },
    {
      "indent": 4,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|      Type     |   Length      |   Reserved    | Address Length|\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                                                               |\n+                                                               +\n|                                                               |\n+                       MAG IPv6 Address                        +\n|                                                               |\n+                                                               +\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 8,
      "text": "Type",
      "ja": "タイプ"
    },
    {
      "indent": 12,
      "text": "51",
      "ja": "５１"
    },
    {
      "indent": 8,
      "text": "Length",
      "ja": "長さ"
    },
    {
      "indent": 12,
      "text": "8-bit unsigned integer indicating the length of the option\nin octets, excluding the type and length fields.  This field\nMUST be set to 18.",
      "raw": true
    },
    {
      "indent": 8,
      "text": "Reserved (R)",
      "ja": "予約済み（R）"
    },
    {
      "indent": 12,
      "text": "This 8-bit field is unused.  The value MUST be initialized\nto 0 by the sender and MUST be ignored by the receiver.",
      "raw": true
    },
    {
      "indent": 8,
      "text": "Address Length",
      "ja": "アドレス長"
    },
    {
      "indent": 12,
      "text": "This field MUST be set to 128.",
      "ja": "このフィールドは128に設定しなければなりません。"
    },
    {
      "indent": 8,
      "text": "MAG IPv6 Address",
      "ja": "MAG IPv6アドレス"
    },
    {
      "indent": 12,
      "text": "A 16-byte field containing the MAG's IPv6 address.",
      "ja": "MAGのIPv6アドレスを含む16バイトのフィールド。"
    },
    {
      "indent": 0,
      "text": "12. Configuration Variables",
      "section_title": true,
      "ja": "12.構成変数"
    },
    {
      "indent": 3,
      "text": "The LMA and the MAG must allow the following variables to be configurable:",
      "ja": "LMAとMAGは、以下の変数を設定できるように許可する必要があります。"
    },
    {
      "indent": 3,
      "text": "LRA_WAIT_TIME: This variable is used to set the time interval, in seconds, between successive retransmissions of an LRI message. The default value is 3 seconds.",
      "ja": "LRA_WAIT_TIME：この変数は、LRIメッセージの連続再送信の間、秒単位で、時間間隔を設定するために使用されます。デフォルト値は3秒です。"
    },
    {
      "indent": 3,
      "text": "LRI_RETRIES: This variable indicates the maximum number of times the initiator retransmits an LRI message before stopping. The default value for this variable is 3.",
      "ja": "LRI_RETRIES：この変数は、イニシエータが停止する前にLRIメッセージを再送信回数の最大数を示します。この変数のデフォルト値は3です。"
    },
    {
      "indent": 0,
      "text": "13. Security Considerations",
      "section_title": true,
      "ja": "13.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "The protocol inherits the threats to [RFC5213] that are identified in [RFC4832]. The protocol specified in this document uses the same security association as defined in [RFC5213] for use between the LMA and the MAG to protect the LRI and LRA messages. This document also assumes the preexistence of a MAG-MAG security association if LR needs to be supported between them. Support for integrity protection using IPsec is REQUIRED, but support for confidentiality is OPTIONAL. The MAGs MUST perform ingress filtering on the MN-sourced packets before encapsulating them into MAG-MAG tunnels in order to prevent address spoofing.",
      "ja": "プロトコルは、[RFC4832]で同定されている[RFC5213]への脅威を継承します。 LRIとLRAメッセージを保護するために、LMAとMAGとの間の使用のために[RFC5213]で定義されるように、この文書で指定されたプロトコルは、同じセキュリティアソシエーションを使用します。 LRは、それらの間でサポートする必要がある場合、このドキュメントでは、MAG-MAGセキュリティアソシエーションの先在を前提としています。 IPsecを使用して完全性保護のためのサポートが必要ですが、機密保持のためのサポートはオプションです。 MAGは、アドレススプーフィングを防止するために、MAG-MAGトンネルにそれらをカプセル化する前に、MN-ソースのパケットのイングレスフィルタリングを実行しなければなりません。"
    },
    {
      "indent": 0,
      "text": "14. IANA Considerations",
      "section_title": true,
      "ja": "14. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "The Localized Routing Initiation (described in Section 10.1) and the Localized Routing Acknowledgment (described in Section 10.2) have each been assigned a Mobility Header type (17 and 18, respectively) from the \"Mobility Header Types - for the MH Type field in the Mobility Header\" registry at http://www.iana.org/assignments/mobility-parameters.",
      "ja": "（セクション10.1に記載）ローカライズルーティング開始し、ローカライズされたルーティング応答（セクション10.2に記載）は、それぞれ、「モビリティヘッダタイプからモビリティヘッダタイプ（それぞれ17及び18）が割り当てられている - においてMHタイプフィールドのhttp://www.iana.org/assignments/mobility-parametersでのモビリティヘッダ」レジストリ。"
    },
    {
      "indent": 3,
      "text": "The MAG IPv6 Address has been assigned a Mobility Option type (51) from the \"Mobility Options\" registry at http://www.iana.org/assignments/mobility-parameters.",
      "ja": "MAG IPv6アドレスはhttp://www.iana.org/assignments/mobility-parametersで「モビリティオプション」レジストリからモビリティオプションの種類（51）が割り当てられています。"
    },
    {
      "indent": 0,
      "text": "15. Contributors",
      "section_title": true,
      "ja": "15.協力者"
    },
    {
      "indent": 3,
      "text": "This document merges ideas from five different draft documents addressing the PMIP localized routing problem. The authors of these drafts are listed below (in alphabetical order).",
      "ja": "この文書では、PMIPローカライズされたルーティングの問題に対処五つの異なるドラフト文書からのアイデアをマージします。これらの草案の作成者は（アルファベット順）以下の通りです。"
    },
    {
      "indent": 3,
      "text": "Kuntal Chowdhury <kchowdhury@starentnetworks.com>",
      "ja": "Kuntalチョードリー<kchowdhury@starentnetworks.com>"
    },
    {
      "indent": 3,
      "text": "Ashutosh Dutta <adutta@niksun.com>",
      "ja": "アッシュートッシュDutta氏<adutta@niksun.com>"
    },
    {
      "indent": 3,
      "text": "Rajeev Koodli <rkoodli@starentnetworks.com>",
      "ja": "ラジブkudli <ರಕೂಡ್ಲಿ@ಸ್ಟಾರೆಂಟಿನೇಟುರ್ಕ್ಸ್.ಕಂ>"
    },
    {
      "indent": 3,
      "text": "Suresh Krishnan <suresh.krishnan@ericsson.com>",
      "ja": "スレシュクリシュナン<suresh.krishnan@ericsson.com>"
    },
    {
      "indent": 3,
      "text": "Marco Liebsch <marco.liebsch@nw.neclab.eu>",
      "ja": "マルコLiebsch <marco.liebsch@nw.neclab.eu>"
    },
    {
      "indent": 3,
      "text": "Paulo Loureiro <loureiro@neclab.eu>",
      "ja": "パウロLOUREIRO <loureiro@neclab.eu>"
    },
    {
      "indent": 3,
      "text": "Desire Oulai <desire.oulai@videotron.com>",
      "ja": "OUを望む<@video願望。オルレ彼Ron.com>"
    },
    {
      "indent": 3,
      "text": "Behcet Sarikaya <sarikaya@ieee.org>",
      "ja": "ベーチェットSarikaya <sarikaya@ieee.org>"
    },
    {
      "indent": 3,
      "text": "Qin Wu <sunseawq@huawei.com>",
      "ja": "W UでのQ <カラーああの損失は、私はに行ってきました@ Huawei社.COM>"
    },
    {
      "indent": 3,
      "text": "Hidetoshi Yokota <yokota@kddilabs.jp>",
      "ja": "ひでとし よこた ＜よこた＠ｋっぢぁｂｓ。ｊｐ＞"
    },
    {
      "indent": 0,
      "text": "16. Acknowledgments",
      "section_title": true,
      "ja": "16.謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Sri Gundavelli, Julien Abeille, Tom Taylor, Kent Leung, Mohana Jeyatharan, Jouni Korhonen, Glen Zorn, Ahmad Muhanna, Zoltan Turanyi, Dirk von Hugo, Pete McCann, Xiansong Cui, Carlos Bernardos, Basavaraj Patil, Jari Arkko, Mary Barnes, Les Ginsberg, Russ Housley, Carl Wallace, Ralph Droms, Adrian Farrel, and Stephen Farrell for their comments and suggestions.",
      "ja": "著者はスリGundavelli、ジュリアンラベイユ、トム・テイラー、ケントレオン、Mohana Jeyatharan、Jouni Korhonen、グレン・ソーン、アフマドMuhanna、ゾルタンTuranyi、ディルク・フォン・ヒューゴ、ピートマッキャン、Xiansong崔、カルロスBernardos、Basavarajパティル、ヤリに感謝したいと思います彼らのコメントや提案のためのArkko、メアリー・バーンズ、レ・ギンズバーグ、ラスHousley、カール・ウォレス、ラルフDroms、エードリアンファレル、そしてステファン・ファレル。"
    },
    {
      "indent": 0,
      "text": "17. References",
      "section_title": true,
      "ja": "17.参考文献"
    },
    {
      "indent": 0,
      "text": "17.1. Normative References",
      "section_title": true,
      "ja": "17.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC5213] Gundavelli, S., Ed., Leung, K., Devarapalli, V., Chowdhury, K., and B. Patil, \"Proxy Mobile IPv6\", RFC 5213, August 2008.",
      "ja": "【Ramphsi 5213] gundavelli、S。、ら、Leunji、K.、Devarapalliは、VEの、Chaudhuriの、K.、およびb。パティル、 \"プロキシ・モバイル・20 6\"、rphak 5213 2008年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC5844] Wakikawa, R. and S. Gundavelli, \"IPv4 Support for Proxy Mobile IPv6\", RFC 5844, May 2010.",
      "ja": "[RFC5844] Wakikawa、R.およびS. Gundavelli、 \"プロキシモバイルIPv6のIPv4サポート\"、RFC 5844、2010年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC5845] Muhanna, A., Khalil, M., Gundavelli, S., and K. Leung, \"Generic Routing Encapsulation (GRE) Key Option for Proxy Mobile IPv6\", RFC 5845, June 2010.",
      "ja": "[RFC5845] Muhanna、A.、カリル、M.、Gundavelli、S.、およびK.レオン、 \"プロキシモバイルIPv6の総称ルーティングカプセル化（GRE）キーオプション\"、RFC 5845、2010年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC6275] Perkins, C., Ed., Johnson, D., and J. Arkko, \"Mobility Support in IPv6\", RFC 6275, July 2011.",
      "ja": "[RFC6275]パーキンス、C.、エド。、ジョンソン、D.、およびJ. Arkko、 \"IPv6におけるモビリティサポート\"、RFC 6275、2011年7月。"
    },
    {
      "indent": 0,
      "text": "17.2. Informative References",
      "section_title": true,
      "ja": "17.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC4832] Vogt, C. and J. Kempf, \"Security Threats to Network-Based Localized Mobility Management (NETLMM)\", RFC 4832, April 2007.",
      "ja": "[RFC4832]フォークト、C.とJ.ケンプ、 \"ネットワークベース局所モビリティ管理（NETLMM）へのセキュリティの脅威\"、RFC 4832、2007年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC6279] Liebsch, M., Ed., Jeong, S., and Q. Wu, \"Proxy Mobile IPv6 (PMIPv6) Localized Routing Problem Statement\", RFC 6279, June 2011.",
      "ja": "[RFC6279] Liebsch、M.、編、チョン、S.、およびQ.ウー、 \"プロキシ・モバイルIPv6（PMIPv6の）ローカライズルーティング問題文\"、RFC 6279、2011年6月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Suresh Krishnan Ericsson 8400 Blvd Decarie Town of Mount Royal, Quebec Canada",
      "ja": "スレシュクリシュナンエリクソンマウントロイヤル、ケベック州、カナダの8400ブルバードDecarieタウン"
    },
    {
      "indent": 3,
      "text": "Phone: +1 514 345 7900 x42871 EMail: suresh.krishnan@ericsson.com",
      "ja": "電話：+1 514 345 7900 x42871メール：suresh.krishnan@ericsson.com"
    },
    {
      "indent": 3,
      "text": "Rajeev Koodli Cisco Systems",
      "ja": "ラジブkudliシスコシステムズ"
    },
    {
      "indent": 3,
      "text": "EMail: rkoodli@cisco.com",
      "ja": "メールアドレス：rkoodli@cisco.com"
    },
    {
      "indent": 3,
      "text": "Paulo Loureiro NEC Laboratories Europe NEC Europe Ltd. Kurfuersten-Anlage 36 69115 Heidelberg Germany",
      "ja": "パウロLOUREIRO NEC欧州研究所NECヨーロッパ社Kurfuerstenコンディショニング36 69115ハイデルベルク、ドイツ"
    },
    {
      "indent": 3,
      "text": "EMail: loureiro@neclab.eu",
      "ja": "メールアドレス：loureiro@neclab.eu"
    },
    {
      "indent": 3,
      "text": "Qin Wu Huawei Technologies Co., Ltd. 101 Software Avenue, Yuhua District Nanjing, Jiangsu 21001 China",
      "ja": "技術CO。、株式会社101ソフトウェア大通り、Y Uドロー地区のNaN北京、江蘇21001中国蕪湖AでQ"
    },
    {
      "indent": 3,
      "text": "Phone: +86-25-56623633 EMail: sunseawq@huawei.com",
      "ja": "電話：+ 86-25-56623633 Eメール：sunseawq@huawei.com"
    },
    {
      "indent": 3,
      "text": "Ashutosh Dutta NIKSUN",
      "ja": "アッシュートッシュDutta氏ニクソン"
    },
    {
      "indent": 3,
      "text": "EMail: adutta@niksun.com",
      "ja": "メールアドレス：adutta@niksun.com"
    }
  ]
}