{
  "title": {
    "text": "RFC 6091 - Using OpenPGP Keys for Transport Layer Security (TLS) Authentication",
    "ja": "RFC 6091 - トランスポート層セキュリティ（TLS）認証のためのOpenPGPキーの使用"
  },
  "number": 6091,
  "created_at": "2020-08-15 20:49:22.824999+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)              N. Mavrogiannopoulos\nRequest for Comments: 6091                                           KUL\nObsoletes: 5081                                               D. Gillmor\nCategory: Informational                                      Independent\nISSN: 2070-1721                                            February 2011",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 2,
      "text": "Using OpenPGP Keys for Transport Layer Security (TLS) Authentication",
      "ja": "トランスポート層セキュリティ（TLS）認証のためのOpenPGPキーの使用"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This memo defines Transport Layer Security (TLS) extensions and associated semantics that allow clients and servers to negotiate the use of OpenPGP certificates for a TLS session, and specifies how to transport OpenPGP certificates via TLS. It also defines the registry for non-X.509 certificate types.",
      "ja": "このメモは、クライアントとサーバーがTLSセッションのOpenPGP証明書の使用をネゴシエートできるようにするトランスポート層セキュリティ（TLS）拡張と関連するセマンティクスを定義し、TLSを介してOpenPGP証明書をトランスポートする方法を指定します。また、X.509以外の証明書タイプのレジストリも定義します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の状態"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはInternet Standards Trackの仕様ではありません。情報提供を目的として公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントは、IETF（Internet Engineering Task Force）の製品です。これは、IETFコミュニティのコンセンサスを表しています。公開レビューを受け、インターネットエンジニアリングステアリンググループ（IESG）による公開が承認されました。 IESGによって承認されたすべてのドキュメントが、あらゆるレベルのインターネット標準の候補になるわけではありません。 RFC 5741のセクション2をご覧ください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6091.",
      "ja": "このドキュメントの現在のステータス、エラータ、およびフィードバックの提供方法に関する情報は、http：//www.rfc-editor.org/info/rfc6091で入手できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2011 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2011 IETF Trustおよびドキュメントの作成者として識別された人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書は、BCP 78およびこの文書の発行日に有効なIETF文書に関するIETFトラストの法的規定（http://trustee.ietf.org/license-info）の対象となります。これらのドキュメントは、このドキュメントに関するあなたの権利と制限を説明しているため、注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、Trust Legal Provisionsのセクション4.eに記載されているSimplified BSD Licenseのテキストが含まれている必要があり、Simplified BSD Licenseに記載されているように保証なしで提供されます。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Terminology .....................................................2\n3. Changes to the Handshake Message Contents .......................3\n   3.1. Client Hello ...............................................3\n   3.2. Server Hello ...............................................4\n   3.3. Server Certificate .........................................4\n   3.4. Certificate Request ........................................6\n   3.5. Client Certificate .........................................6\n   3.6. Other Handshake Messages ...................................7\n4. Security Considerations .........................................7\n5. IANA Considerations .............................................7\n6. Acknowledgements ................................................8\n7. References ......................................................8\n   7.1. Normative References .......................................8\n   7.2. Informative References .....................................8\nAppendix A.  Changes from RFC 5081 .................................9",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The IETF has two sets of standards for public key certificates: one set for the use of X.509 certificates [RFC5280], and one for OpenPGP certificates [RFC4880]. At the time of this writing, TLS [RFC5246] standards are defined to use X.509 certificates. This document specifies a way to negotiate the use of OpenPGP certificates for a TLS session, and specifies how to transport OpenPGP certificates via TLS. The proposed extensions are backward-compatible with the current TLS specification, so that existing client and server implementations that make use of X.509 certificates are not affected.",
      "ja": "IETFには、公開鍵証明書に関する2つの標準セットがあります。1つはX.509証明書を使用するためのセット[RFC5280]で、もう1つはOpenPGP証明書のための[RFC4880]です。この記事の執筆時点では、TLS [RFC5246]標準はX.509証明書を使用するように定義されています。このドキュメントでは、TLSセッションでのOpenPGP証明書の使用をネゴシエートする方法と、TLSを介してOpenPGP証明書を転送する方法を指定します。提案された拡張機能は、現在のTLS仕様と下位互換性があるため、X.509証明書を使用する既存のクライアントおよびサーバーの実装は影響を受けません。"
    },
    {
      "indent": 3,
      "text": "These extensions are not backward-compatible with [RFC5081], and the major differences are summarized in Appendix A. Although the OpenPGP CertificateType value is being reused by this memo with the same number as that specified in [RFC5081] but with different semantics, we believe that this causes no interoperability issues because the latter was not widely deployed.",
      "ja": "これらの拡張機能は[RFC5081]との下位互換性がなく、主な違いは付録Aにまとめられています。OpenPGPCertificateType値は、[RFC5081]で指定されたものと同じ番号で、異なるセマンティクスでこのメモによって再利用されていますが、後者は広く展開されていなかったので、これは相互運用性の問題を引き起こさないと考えています。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "ja": "2. 用語"
    },
    {
      "indent": 3,
      "text": "The term \"OpenPGP key\" is used in this document as in the OpenPGP specification [RFC4880]. We use the term \"OpenPGP certificate\" to refer to OpenPGP keys that are enabled for authentication.",
      "ja": "このドキュメントでは、「OpenPGPキー」という用語がOpenPGP仕様[RFC4880]と同様に使用されています。 「OpenPGP証明書」という用語は、認証が有効になっているOpenPGP鍵を指すのに使用します。"
    },
    {
      "indent": 3,
      "text": "This document uses the same notation and terminology used in the TLS Protocol specification [RFC5246].",
      "ja": "このドキュメントでは、TLSプロトコル仕様[RFC5246]で使用されているものと同じ表記法と用語を使用しています。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "このドキュメントのキーワード「MUST」、「MUST NOT」、「REQUIRED」、「SHALL」、「SHALL NOT」、「SHOULD」、「SHOULD NOT」、「RECOMMENDED」、「MAY」、および「OPTIONAL」は、 [RFC2119]で説明されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "3. Changes to the Handshake Message Contents",
      "section_title": true,
      "ja": "3. ハンドシェイクメッセージの内容の変更"
    },
    {
      "indent": 3,
      "text": "This section describes the changes to the TLS handshake message contents when OpenPGP certificates are to be used for authentication.",
      "ja": "このセクションでは、OpenPGP証明書を認証に使用する場合のTLSハンドシェイクメッセージの内容の変更について説明します。"
    },
    {
      "indent": 0,
      "text": "3.1. Client Hello",
      "section_title": true,
      "ja": "3.1. こんにちは"
    },
    {
      "indent": 3,
      "text": "In order to indicate the support of multiple certificate types, clients MUST include an extension of type \"cert_type\" to the extended client hello message. The \"cert_type\" TLS extension is assigned the value of 9 from the TLS ExtensionType registry. This value is used as the extension number for the extensions in both the client hello message and the server hello message. The hello extension mechanism is described in [RFC5246].",
      "ja": "複数の証明書タイプのサポートを示すために、クライアントは、タイプ \"cert_type\"の拡張を拡張クライアントhelloメッセージに含める必要があります。 「cert_type」TLS拡張には、TLS ExtensionTypeレジストリから値9が割り当てられます。この値は、クライアントhelloメッセージとサーバーhelloメッセージの両方の内線番号の内線番号として使用されます。 hello拡張メカニズムは[RFC5246]で説明されています。"
    },
    {
      "indent": 3,
      "text": "This extension carries a list of supported certificate types the client can use, sorted by client preference. This extension MUST be omitted if the client only supports X.509 certificates. The \"extension_data\" field of this extension contains a CertificateTypeExtension structure. Note that the CertificateTypeExtension structure is being used both by the client and the server, even though the structure is only specified once in this document. Reusing a single specification for both client and server is common in other specifications, such as the TLS protocol itself [RFC5246].",
      "ja": "この拡張機能は、クライアントが使用できるサポートされている証明書の種類のリストを、クライアントの優先度順に並べたものです。クライアントがX.509証明書のみをサポートする場合は、この拡張を省略しなければなりません。この拡張の「extension_data」フィールドには、CertificateTypeExtension構造が含まれています。このドキュメントでは一度だけ構造が指定されているにもかかわらず、CertificateTypeExtension構造はクライアントとサーバーの両方で使用されていることに注意してください。クライアントとサーバーの両方に単一の仕様を再利用することは、TLSプロトコル自体[RFC5246]などの他の仕様では一般的です。"
    },
    {
      "indent": 6,
      "text": "enum { client, server } ClientOrServerExtension;",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "enum { X.509(0), OpenPGP(1), (255) } CertificateType;",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "struct {\n   select(ClientOrServerExtension) {\n      case client:\n         CertificateType certificate_types<1..2^8-1>;\n      case server:\n         CertificateType certificate_type;\n   }\n} CertificateTypeExtension;",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "No new cipher suites are required to use OpenPGP certificates. All existing cipher suites that support a key exchange method compatible with the key in the certificate can be used in combination with OpenPGP certificates.",
      "ja": "OpenPGP証明書を使用するために新しい暗号スイートは必要ありません。証明書の鍵と互換性のある鍵交換方式をサポートする既存のすべての暗号スイートは、OpenPGP証明書と組み合わせて使用​​できます。"
    },
    {
      "indent": 0,
      "text": "3.2. Server Hello",
      "section_title": true,
      "ja": "3.2. サーバーこんにちは"
    },
    {
      "indent": 3,
      "text": "If the server receives a client hello that contains the \"cert_type\" extension and chooses a cipher suite that requires a certificate, then two outcomes are possible. The server MUST either select a certificate type from the certificate_types field in the extended client hello or terminate the session with a fatal alert of type \"unsupported_certificate\".",
      "ja": "サーバーが「cert_type」拡張を含むclient helloを受信し、証明書を必要とする暗号スイートを選択した場合、2つの結果が考えられます。サーバーは、拡張クライアントhelloのcertificate_typesフィールドから証明書タイプを選択するか、タイプ「unsupported_certificate」の致命的なアラートでセッションを終了する必要があります。"
    },
    {
      "indent": 3,
      "text": "The certificate type selected by the server is encoded in a CertificateTypeExtension structure, which is included in the extended server hello message using an extension of type \"cert_type\". Servers that only support X.509 certificates MAY omit including the \"cert_type\" extension in the extended server hello.",
      "ja": "サーバーによって選択された証明書タイプはCertificateTypeExtension構造にエンコードされます。これは、タイプ「cert_type」の拡張を使用して、拡張サーバーのhelloメッセージに含まれています。 X.509証明書のみをサポートするサーバーは、拡張サーバーhelloに「cert_type」拡張を含めることで省略できます。"
    },
    {
      "indent": 0,
      "text": "3.3. Server Certificate",
      "section_title": true,
      "ja": "3.3. サーバー証明書"
    },
    {
      "indent": 3,
      "text": "The contents of the certificate message sent from server to client and vice versa are determined by the negotiated certificate type and the selected cipher suite's key exchange algorithm.",
      "ja": "サーバーからクライアントに、またはその逆に送信される証明書メッセージの内容は、ネゴシエートされた証明書タイプと選択された暗号スイートの鍵交換アルゴリズムによって決定されます。"
    },
    {
      "indent": 3,
      "text": "If the OpenPGP certificate type is negotiated, then it is required to present an OpenPGP certificate in the certificate message. The certificate must contain a public key that matches the selected key exchange algorithm, as shown below.",
      "ja": "OpenPGP証明書タイプがネゴシエートされる場合、証明書メッセージでOpenPGP証明書を提示する必要があります。証明書には、次に示すように、選択した鍵交換アルゴリズムと一致する公開鍵が含まれている必要があります。"
    },
    {
      "indent": 6,
      "text": "Key Exchange Algorithm OpenPGP Certificate Type",
      "ja": "鍵交換アルゴリズムOpenPGP証明書タイプ"
    },
    {
      "indent": 6,
      "text": "RSA RSA public key that can be used for encryption.",
      "ja": "暗号化に使用できるRSA RSA公開鍵。"
    },
    {
      "indent": 6,
      "text": "DHE_DSS DSA public key that can be used for authentication.",
      "ja": "DHE_DSS認証に使用できるDSA公開鍵。"
    },
    {
      "indent": 6,
      "text": "DHE_RSA RSA public key that can be used for authentication.",
      "ja": "DHE_RSA認証に使用できるRSA公開鍵。"
    },
    {
      "indent": 3,
      "text": "An OpenPGP certificate appearing in the certificate message is sent using the binary OpenPGP format. The certificate MUST contain all the elements required by Section 11.1 of [RFC4880].",
      "ja": "証明書メッセージに表示されるOpenPGP証明書は、バイナリOpenPGP形式を使用して送信されます。証明書には、[RFC4880]のセクション11.1で要求されるすべての要素が含まれている必要があります。"
    },
    {
      "indent": 0,
      "text": " OpenPGP certificates to be transferred are placed in the Certificate structure and tagged with the OpenPGPCertDescriptorType \"subkey_cert\". Since those certificates might contain several subkeys, the subkey ID to be used for this session is explicitly specified in the OpenPGPKeyID field. The key ID must be specified even if the certificate has only a primary key. The peer, upon receiving this type, has to either use the specified subkey or terminate the session with a fatal alert of \"unsupported_certificate\".",
      "ja": "転送されるOpenPGP証明書は証明書構造に配置され、OpenPGPCertDescriptorType \"subkey_cert\"でタグ付けされます。これらの証明書には複数のサブキーが含まれている可能性があるため、このセッションで使用されるサブキーIDは、OpenPGPKeyIDフィールドで明示的に指定されます。証明書に主キーしかない場合でも、キーIDを指定する必要があります。ピアは、このタイプを受信すると、指定されたサブキーを使用するか、「unsupported_certificate」の致命的なアラートでセッションを終了する必要があります。"
    },
    {
      "indent": 3,
      "text": "The option is also available to send an OpenPGP fingerprint, instead of sending the entire certificate, by using the \"subkey_cert_fingerprint\" tag. This tag uses the OpenPGPSubKeyFingerprint structure and requires the primary key fingerprint to be specified, as well as the subkey ID to be used for this session. The peer shall respond with a \"certificate_unobtainable\" fatal alert if the certificate with the given fingerprint cannot be found. The \"certificate_unobtainable\" fatal alert is defined in Section 5 of [RFC6066].",
      "ja": "「subkey_cert_fingerprint」タグを使用して、証明書全体を送信する代わりに、OpenPGPフィンガープリントを送信するオプションも利用できます。このタグはOpenPGPSubKeyFingerprint構造を使用し、このセッションで使用するサブキーIDだけでなく、主キーのフィンガープリントを指定する必要があります。ピアは、指定されたフィンガープリントの証明書が見つからない場合、「certificate_unobtainable」の致命的なアラートで応答します。 「certificate_unobtainable」の致命的なアラートは、[RFC6066]のセクション5で定義されています。"
    },
    {
      "indent": 3,
      "text": "Implementations of this protocol MUST ensure that the sizes of key IDs and fingerprints in the OpenPGPSubKeyCert and OpenPGPSubKeyFingerprint structures comply with [RFC4880]. Moreover, it is RECOMMENDED that the keys to be used with this protocol have the authentication flag (0x20) set.",
      "ja": "このプロトコルの実装は、OpenPGPSubKeyCertおよびOpenPGPSubKeyFingerprint構造体のキーIDおよびフィンガープリントのサイズが[RFC4880]に準拠していることを保証する必要があります。さらに、このプロトコルで使用されるキーには認証フラグ（0x20）が設定されていることが推奨されます。"
    },
    {
      "indent": 3,
      "text": "The process of fingerprint generation is described in Section 12.2 of [RFC4880].",
      "ja": "指紋の生成プロセスは、[RFC4880]のセクション12.2で説明されています。"
    },
    {
      "indent": 3,
      "text": "The enumerated types \"cert_fingerprint\" and \"cert\" of OpenPGPCertDescriptorType that were defined in [RFC5081] are not used and are marked as obsolete by this document. The \"empty_cert\" type has replaced \"cert\" and is a backward-compatible way to specify an empty certificate; \"cert_fingerprint\" MUST NOT be used with this updated specification, and hence that old alternative has been removed from the Certificate struct description.",
      "ja": "[RFC5081]で定義されたOpenPGPCertDescriptorTypeの列挙型「cert_fingerprint」および「cert」は使用されておらず、このドキュメントでは廃止されたものとしてマークされています。 「empty_cert」タイプは「cert」を置き換え、空の証明書を指定するための下位互換性のある方法です。 「cert_fingerprint」はこの更新された仕様で使用してはならないため、Certificate structの説明から古い代替手段が削除されました。"
    },
    {
      "indent": 6,
      "text": "enum {\n     empty_cert(1),\n     subkey_cert(2),\n     subkey_cert_fingerprint(3),\n     (255)\n} OpenPGPCertDescriptorType;",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "uint24 OpenPGPEmptyCert = 0;",
      "ja": "uint24 OpenPGPEmptyCert = 0;"
    },
    {
      "indent": 6,
      "text": "struct {\n    opaque OpenPGPKeyID<8..255>;\n    opaque OpenPGPCert<0..2^24-1>;\n} OpenPGPSubKeyCert;",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "struct {\n    opaque OpenPGPKeyID<8..255>;\n    opaque OpenPGPCertFingerprint<20..255>;\n} OpenPGPSubKeyFingerprint;",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "struct {\n     OpenPGPCertDescriptorType descriptorType;\n     select (descriptorType) {\n          case empty_cert: OpenPGPEmptyCert;\n          case subkey_cert: OpenPGPSubKeyCert;\n          case subkey_cert_fingerprint:\n              OpenPGPSubKeyCertFingerprint;\n     }\n} Certificate;",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "3.4. Certificate Request",
      "section_title": true,
      "ja": "3.4. 証明書リクエスト"
    },
    {
      "indent": 3,
      "text": "The semantics of this message remain the same as in the TLS specification. However, if this message is sent, and the negotiated certificate type is OpenPGP, the \"certificate_authorities\" list MUST be empty.",
      "ja": "このメッセージのセマンティクスは、TLS仕様の場合と同じです。ただし、このメッセージが送信され、ネゴシエートされた証明書タイプがOpenPGPであ​​る場合、「certificate_authorities」リストは空である必要があります。"
    },
    {
      "indent": 0,
      "text": "3.5. Client Certificate",
      "section_title": true,
      "ja": "3.5. クライアント証明書"
    },
    {
      "indent": 3,
      "text": "This message is only sent in response to the certificate request message. The client certificate message is sent using the same formatting as the server certificate message, and it is also required to present a certificate that matches the negotiated certificate type. If OpenPGP certificates have been selected and no certificate is available from the client, then a certificate structure of type \"empty_cert\" that contains an OpenPGPEmptyCert value MUST be sent. The server SHOULD respond with a \"handshake_failure\" fatal alert if client authentication is required.",
      "ja": "このメッセージは、証明書要求メッセージへの応答としてのみ送信されます。クライアント証明書メッセージは、サーバー証明書メッセージと同じフォーマットを使用して送信され、ネゴシエートされた証明書タイプと一致する証明書を提示することも必要です。 OpenPGP証明書が選択されていて、クライアントから使用できる証明書がない場合は、OpenPGPEmptyCert値を含む「empty_cert」タイプの証明書構造を送信する必要があります。クライアント認証が必要な場合、サーバーは「handshake_failure」致命的アラートで応答する必要があります（SHOULD）。"
    },
    {
      "indent": 0,
      "text": "3.6. Other Handshake Messages",
      "section_title": true,
      "ja": "3.6. その他のハンドシェイクメッセージ"
    },
    {
      "indent": 3,
      "text": "All the other handshake messages are identical to the TLS specification.",
      "ja": "他のすべてのハンドシェイクメッセージは、TLS仕様と同じです。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "All security considerations discussed in [RFC5246], [RFC6066], and [RFC4880] apply to this document. Considerations about the use of the web of trust or identity and certificate verification procedures are outside the scope of this document. These are considered issues to be handled by the application layer protocols.",
      "ja": "[RFC5246]、[RFC6066]、および[RFC4880]で説明されているすべてのセキュリティの考慮事項がこのドキュメントに適用されます。信頼またはアイデンティティのウェブの使用に関する考慮事項および証明書の検証手順は、このドキュメントの範囲外です。これらは、アプリケーション層プロトコルによって処理される問題と見なされます。"
    },
    {
      "indent": 3,
      "text": "The protocol for certificate type negotiation is identical in operation to cipher suite negotiation as described in the TLS specification [RFC5246], with the addition of default values when the extension is omitted. Since those omissions have a unique meaning and the same protection is applied to the values as with cipher suites, it is believed that the security properties of this negotiation are the same as with cipher suite negotiation.",
      "ja": "証明書タイプネゴシエーションのプロトコルは、TLS仕様[RFC5246]で説明されているように、暗号スイートネゴシエーションと動作が同じですが、拡張が省略されている場合はデフォルト値が追加されます。これらの省略には固有の意味があり、暗号スイートと同じ保護が値に適用されるため、このネゴシエーションのセキュリティプロパティは暗号スイートネゴシエーションと同じであると考えられています。"
    },
    {
      "indent": 3,
      "text": "When using OpenPGP fingerprints instead of the full certificates, the discussion in Section 5 of [RFC6066] for \"Client Certificate URLs\" applies, especially when external servers are used to retrieve keys. However, a major difference is that although the \"client_certificate_url\" extension allows identifying certificates without including the certificate hashes, this is not possible in the protocol proposed here. In this protocol, the certificates, when not sent, are always identified by their fingerprint, which serves as a cryptographic hash of the certificate (see Section 12.2 of [RFC4880]).",
      "ja": "完全な証明書の代わりにOpenPGPフィンガープリントを使用する場合、[RFC6066]のセクション5の「クライアント証明書のURL」に関する説明が適用されます。特に、外部サーバーを使用してキーを取得する場合に当てはまります。ただし、主な違いは、「client_certificate_url」拡張では証明書ハッシュを含めずに証明書を識別できるが、ここで提案されているプロトコルではこれが不可能であることです。このプロトコルでは、証明書が送信されない場合、証明書の暗号化ハッシュとして機能するフィンガープリントによって常に識別されます（[RFC4880]のセクション12.2を参照）。"
    },
    {
      "indent": 3,
      "text": "The information that is available to participating parties and eavesdroppers (when confidentiality is not available through a previous handshake) is the number and the types of certificates they hold, plus the contents of the certificates.",
      "ja": "参加者と盗聴者が利用できる情報（以前のハンドシェイクで機密性が利用できない場合）は、それらが保持する証明書の数と種類、および証明書の内容です。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "ja": "5. IANAに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "This document uses a registry and the \"cert_type\" extension originally defined in [RFC5081]. Existing IANA references have been updated to point to this document.",
      "ja": "このドキュメントでは、レジストリと、[RFC5081]で最初に定義された「cert_type」拡張を使用します。このドキュメントを指すように、既存のIANAリファレンスが更新されました。"
    },
    {
      "indent": 3,
      "text": "In addition, the \"TLS Certificate Types\" registry established by [RFC5081] has been updated in the following ways:",
      "ja": "さらに、[RFC5081]によって確立された「TLS証明書タイプ」レジストリは、次のように更新されました。"
    },
    {
      "indent": 3,
      "text": "1. Values 0 (X.509) and 1 (OpenPGP) are defined in this document.",
      "ja": "1. このドキュメントでは、値0（X.509）および1（OpenPGP）が定義されています。"
    },
    {
      "indent": 3,
      "text": "2. Values from 2 through 223 decimal inclusive are assigned via \"RFC Required\" [RFC5226].",
      "ja": "2. 2から223までの10進数の値は、「RFCが必要」[RFC5226]によって割り当てられます。"
    },
    {
      "indent": 3,
      "text": "3. Values from 224 decimal through 255 decimal inclusive are reserved for Private Use [RFC5226].",
      "ja": "3. 10進数で224から10進数で255までの値は、個人使用のために予約されています[RFC5226]。"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgements",
      "section_title": true,
      "ja": "6. 謝辞"
    },
    {
      "indent": 3,
      "text": "The authors wish to thank Alfred Hoenes and Ted Hardie for their suggestions on improving this document.",
      "ja": "著者は、このドキュメントを改善するための提案をしてくれたAlfred HoenesとTed Hardieに感謝します。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7. 参考文献"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "ja": "7.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119] Bradner、S。、「要件レベルを示すためにRFCで使用するキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC4880] Callas, J., Donnerhacke, L., Finney, H., Shaw, D., and R. Thayer, \"OpenPGP Message Format\", RFC 4880, November 2007.",
      "ja": "[RFC4880] Callas、J.、Donnerhacke、L.、Finney、H.、Shaw、D。、およびR. Thayer、「OpenPGP Message Format」、RFC 4880、2007年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC5226] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 5226, May 2008.",
      "ja": "[RFC5226] Narten、T。およびH. Alvestrand、「RFCでIANAの考慮事項セクションを作成するためのガイドライン」、BCP 26、RFC 5226、2008年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC5246] Dierks, T. and E. Rescorla, \"The Transport Layer Security (TLS) Protocol Version 1.2\", RFC 5246, August 2008.",
      "ja": "[RFC5246] Dierks、T。およびE. Rescorla、「The Transport Layer Security（TLS）Protocol Version 1.2」、RFC 5246、2008年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC6066] Eastlake 3rd, D., \"Transport Layer Security (TLS) Extensions: Extension Definitions\", RFC 6066, January 2011.",
      "ja": "[RFC6066] Eastlake 3rd、D。、「Transport Layer Security（TLS）Extensions：Extension Definitions」、RFC 6066、2011年1月。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "ja": "7.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[RFC5081] Mavrogiannopoulos, N., \"Using OpenPGP Keys for Transport Layer Security (TLS) Authentication\", RFC 5081, November 2007.",
      "ja": "[RFC5081] Mavrogiannopoulos、N。、「トランスポート層セキュリティ（TLS）認証のためのOpenPGPキーの使用」、RFC 5081、2007年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC5280] Cooper, D., Santesson, S., Farrell, S., Boeyen, S., Housley, R., and W. Polk, \"Internet X.509 Public Key Infrastructure Certificate and Certificate Revocation List (CRL) Profile\", RFC 5280, May 2008.",
      "ja": "[RFC5280] Cooper、D.、Santesson、S.、Farrell、S.、Boeyen、S.、Housley、R。、およびW. Polk、「Internet X.509 Public Key Infrastructure Certificate and Certificate Revocation List（CRL）Profile \"、RFC 5280、2008年5月。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Changes from RFC 5081",
      "section_title": true,
      "ja": "付録A. RFC 5081からの変更点"
    },
    {
      "indent": 3,
      "text": "This document incorporates a major change in the \"Server Certificate\" and \"Client Certificate\" TLS messages that will make implementations following this protocol incompatible with those following [RFC5081]. This change requires the subkey IDs used for TLS authentication to be marked explicitly in the handshake procedure. This was decided in order to place no limitation on the OpenPGP certificates' contents that can be used with this protocol.",
      "ja": "このドキュメントは、「サーバー証明書」と「クライアント証明書」のTLSメッセージに大きな変更を組み込んでおり、このプロトコルに従う実装は[RFC5081]に従うものと互換性がありません。この変更では、ハンドシェイク手順でTLS認証に使用されるサブキーIDを明示的にマークする必要があります。これは、このプロトコルで使用できるOpenPGP証明書の内容を制限しないために決定されました。"
    },
    {
      "indent": 3,
      "text": "[RFC5081] required that an OpenPGP key or subkey be marked with the authentication flag; thus, authentication would have failed if this flag was not set or if this flag was set in more than one subkey. The protocol in this memo has no such limitation.",
      "ja": "[RFC5081]は、OpenPGPキーまたはサブキーに認証フラグを付ける必要がありました。したがって、このフラグが設定されていない場合、またはこのフラグが複数のサブキーに設定されている場合、認証は失敗します。このメモのプロトコルにはそのような制限はありません。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Nikos Mavrogiannopoulos ESAT/COSIC Katholieke Universiteit Leuven Kasteelpark Arenberg 10, bus 2446 Leuven-Heverlee, B-3001 Belgium",
      "ja": "Nikos Mavrogiannopoulos ESAT / COSIC Katholieke Universiteit Leuven Kasteelpark Arenberg 10、box 2446 Leuven-Heverlee、B-3001 Belgium"
    },
    {
      "indent": 3,
      "text": "EMail: nikos.mavrogiannopoulos@esat.kuleuven.be",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Daniel Kahn Gillmor Independent 119 Herkimer St. Brooklyn, NY 11216-2801 US",
      "ja": "ダニエルカーンギルモアインディペンデント119 Herkimer St. Brooklyn、NY 11216-2801 US"
    },
    {
      "indent": 3,
      "text": "EMail: dkg@fifthhorseman.net",
      "raw": true,
      "ja": ""
    }
  ]
}