{
  "title": {
    "text": "RFC 6360 - Conclusion of FYI RFC Sub-Series",
    "ja": "RFC 6360 - FYI RFCサブシリーズの結論"
  },
  "number": 6360,
  "created_at": "2022-12-03 17:17:17.722735+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                        R. Housley\nRequest for Comments: 6360                                Vigil Security\nObsoletes: 1150                                              August 2011\nCategory: Informational\nISSN: 2070-1721",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 20,
      "text": "Conclusion of FYI RFC Sub-Series",
      "ja": "FYI RFCサブシリーズの結論"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document concludes the For Your Information (FYI) sub-series of RFCs, established by RFC 1150 for use by the IETF User Services Area, which no longer exists. The IESG does not intend to make any further additions to this RFC sub-series, and this document provides a record of this decision. This document also obsoletes RFC 1150 and changes the status of RFC 1150 to Historic.",
      "ja": "このドキュメントでは、RFCの情報（FYI）のサブシリーズは、RFC 1150によって確立され、IETFユーザーサービスエリアが存在しなくなったために確立されています。IESGは、このRFCサブシリーズにさらに追加するつもりはなく、このドキュメントはこの決定の記録を提供します。また、このドキュメントはRFC 1150を廃止し、RFC 1150のステータスを歴史的に変更します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントは、インターネット標準の追跡仕様ではありません。情報目的で公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントは、インターネットエンジニアリングタスクフォース（IETF）の製品です。IETFコミュニティのコンセンサスを表しています。公開レビューを受けており、インターネットエンジニアリングステアリンググループ（IESG）からの出版が承認されています。IESGによって承認されたすべてのドキュメントが、あらゆるレベルのインターネット標準の候補者ではありません。RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6360.",
      "ja": "このドキュメントの現在のステータス、任意のERRATA、およびそのフィードバックを提供する方法に関する情報は、http：//www.rfc-editor.org/info/rfc6360で取得できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2011 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2011 IETF Trustおよび文書著者として特定された人。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "このドキュメントは、BCP 78およびIETFドキュメント（http://trustee.ietf.org/license-info）に関連するIETF Trustの法的規定の対象となります。この文書に関するあなたの権利と制限を説明するので、これらの文書を注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、セクション4.Eで説明されている法的規定のセクション4.Eで説明されており、単純化されたBSDライセンスで説明されているように保証なしで提供される簡略化されたBSDライセンステキストを含める必要があります。"
    },
    {
      "indent": 0,
      "text": "1. Background",
      "section_title": true,
      "ja": "1. 背景"
    },
    {
      "indent": 3,
      "text": "The For Your Information (FYI) sub-series of RFCs was established by RFC 1150 [RFC1150] in 1990 for use by the IETF User Services Area, which has not met since IETF 53 held in March 2001. This RFC sub-series was designed to provide Internet users with a repository of information regarding the Internet that might be interesting to a wide range of people.",
      "ja": "RFCSの情報（FYI）サブシリーズは、1990年にRFC 1150 [RFC1150]によって、2001年3月に開催されてからIETF 53が開催されてから満たされていないIETFユーザーサービスエリアで使用するために設立されました。このRFCサブシリーズは設計されました。インターネットユーザーにインターネットに関する情報のリポジトリを提供して、幅広い人々にとって興味深いかもしれません。"
    },
    {
      "indent": 3,
      "text": "The publication of RFC 1150 [RFC1150] introduced the FYI sub-series of RFCs. Since that time, a total of 38 FYI numbers have been assigned. Many other Informational RFCs have been published that are not part of the FYI sub-series.",
      "ja": "RFC 1150 [RFC1150]の出版により、RFCSのFYIサブシリーズが導入されました。それ以来、合計38のFYI番号が割り当てられています。FYIサブシリーズの一部ではない他の多くの情報RFCが公開されています。"
    },
    {
      "indent": 3,
      "text": "The list of documents in the FYI sub-series can be found on the RFC Editor web site [INDEX].",
      "ja": "FYIサブシリーズのドキュメントのリストは、RFCエディターWebサイト[インデックス]にあります。"
    },
    {
      "indent": 0,
      "text": "2. Conclusion of the FYI Sub-Series",
      "section_title": true,
      "ja": "2. FYIサブシリーズの結論"
    },
    {
      "indent": 3,
      "text": "The IESG does not intend to make any further additions to the FYI sub-series. The IESG intends to continue to produce Informational RFCs, but none of them will be assigned an FYI number.",
      "ja": "IESGは、FYIサブシリーズにさらに追加するつもりはありません。IESGは、情報提供のRFCを引き続き作成する予定ですが、FYI番号はいずれも割り当てられません。"
    },
    {
      "indent": 3,
      "text": "All published RFCs that are currently part of the FYI sub-series will retain their FYI numbers. The FYI numbers continue to provide reference points for these documents, and the FYI number can be used in citations to these documents.",
      "ja": "現在FYIサブシリーズの一部である公開されているすべてのRFCは、FYI番号を保持します。FYI番号は引き続きこれらのドキュメントの参照ポイントを提供し、FYI番号はこれらのドキュメントの引用で使用できます。"
    },
    {
      "indent": 3,
      "text": "If a future RFC is published that obsoletes an existing member of the FYI sub-series, the new RFC will not be assigned an FYI number.",
      "ja": "FYIサブシリーズの既存のメンバーを廃止する将来のRFCが公開されている場合、新しいRFCにはFYI番号が割り当てられません。"
    },
    {
      "indent": 0,
      "text": "3. RFC 1150 Moved to Historic",
      "section_title": true,
      "ja": "3. RFC 1150は歴史的に移動しました"
    },
    {
      "indent": 3,
      "text": "This document moves RFC 1150 [RFC1150] to Historic. The procedural information in RFC 1150 is no longer valid. If it becomes desirable to make additions to the FYI sub-series in the future, new procedures can be developed to replace this document.",
      "ja": "このドキュメントは、RFC 1150 [RFC1150]を歴史的に移動します。RFC 1150の手続き情報は、もはや有効ではありません。将来、FYIサブシリーズに追加することが望ましい場合は、このドキュメントを置き換えるために新しい手順を開発できます。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "No Internet security issues are anticipated by the actions described in this document.",
      "ja": "このドキュメントで説明されているアクションによって、インターネットセキュリティの問題は予想されません。"
    },
    {
      "indent": 0,
      "text": "5. References",
      "section_title": true,
      "ja": "5. 参考文献"
    },
    {
      "indent": 0,
      "text": "5.1. Normative Reference",
      "section_title": true,
      "ja": "5.1. 規範的な参照"
    },
    {
      "indent": 3,
      "text": "[RFC1150] Malkin, G. and J. Reynolds, \"FYI on FYI: Introduction to the FYI Notes\", FYI 1, RFC 1150, March 1990.",
      "ja": "[RFC1150] Malkin、G。およびJ. Reynolds、「FYI on FYI：FYI Notesの紹介」、FYI 1、RFC 1150、1990年3月。"
    },
    {
      "indent": 0,
      "text": "5.2. Informative Reference",
      "section_title": true,
      "ja": "5.2. 有益なリファレンス"
    },
    {
      "indent": 3,
      "text": "[INDEX] \"FYI Index\", http://www.rfc-editor.org/fyi-index.html",
      "ja": "[index] \"fyi index\"、http://www.rfc-editor.org/fyi-index.html"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者の連絡先"
    },
    {
      "indent": 3,
      "text": "Russell Housley Vigil Security, LLC 918 Spring Knoll Drive Herndon, VA 20170 USA EMail: housley@vigilsec.com",
      "ja": "Russell Housley Vigil Security、LLC 918 Spring Knoll Drive Herndon、VA 20170 USAメール：housley@vigilsec.com"
    }
  ]
}