{
  "title": {
    "text": "RFC 6291 - Guidelines for the Use of the \"OAM\" Acronym in the IETF",
    "ja": "RFC 6291 - IETFにおける「OAM」頭字語の使用のためのガイドライン"
  },
  "number": 6291,
  "created_at": "2019-11-01 20:18:30.217718+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                      L. Andersson\nRequest for Comments: 6291                                      Ericsson\nBCP: 161                                                 H. van Helvoort\nCategory: Best Current Practice                      Huawei Technologies\nISSN: 2070-1721                                                R. Bonica\n                                                        Juniper Networks\n                                                            D. Romascanu\n                                                                   Avaya\n                                                            S. Mansfield\n                                                                Ericsson\n                                                               June 2011",
      "raw": true
    },
    {
      "indent": 8,
      "text": "Guidelines for the Use of the \"OAM\" Acronym in the IETF",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "At first glance, the acronym \"OAM\" seems to be well-known and well-understood. Looking at the acronym a bit more closely reveals a set of recurring problems that are revisited time and again.",
      "ja": "一見すると、頭文字「OAMは、」よく知られており、十分に理解のようです。頭字語を見て少しはより密接に再び時間を再訪している問題の再発のセットを明らかにする。"
    },
    {
      "indent": 3,
      "text": "This document provides a definition of the acronym \"OAM\" (Operations, Administration, and Maintenance) for use in all future IETF documents that refer to OAM. There are other definitions and acronyms that will be discussed while exploring the definition of the constituent parts of the \"OAM\" term.",
      "ja": "この文書では、OAMを参照するすべての将来のIETFのドキュメントで使用する略語「OAM」（運用、管理、およびメンテナンス）の定義を提供します。 「OAM」という用語の構成部品の定義を探索しながら議論される他の定義と略語があります。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This memo documents an Internet Best Current Practice.",
      "ja": "このメモはインターネット最も良い現在の練習を説明します。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on BCPs is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 BCPの詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6291.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6291で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2011 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2011 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . . . 3\n  1.1.  Terminology . . . . . . . . . . . . . . . . . . . . . . . . 3\n2.  Pre-Existing Uses of OAM  . . . . . . . . . . . . . . . . . . . 3\n  2.1.  Uses of OAM in Other SDOs . . . . . . . . . . . . . . . . . 4\n    2.1.1.  The \"O\" in OAM  . . . . . . . . . . . . . . . . . . . . 4\n    2.1.2.  The \"A\" in OAM  . . . . . . . . . . . . . . . . . . . . 4\n    2.1.3.  The \"M\" in OAM  . . . . . . . . . . . . . . . . . . . . 5\n  2.2.  Uses of OAM in the IETF . . . . . . . . . . . . . . . . . . 5\n3.  Recommendations on the Use of the \"OAM\" Acronym . . . . . . . . 5\n4.  Security Considerations . . . . . . . . . . . . . . . . . . . . 6\n5.  Acknowledgments . . . . . . . . . . . . . . . . . . . . . . . . 7\n6.  Informative References  . . . . . . . . . . . . . . . . . . . . 7",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The main purpose of this document is to provide a definition of the acronym \"OAM\" (Operations, Administration, and Maintenance) for use in all future IETF documents that refer to OAM.",
      "ja": "この文書の主な目的は、OAMを参照するすべての将来のIETFドキュメントで使用する略語「OAM」（運用、管理、およびメンテナンス）の定義を提供することです。"
    },
    {
      "indent": 3,
      "text": "The acronym \"OAM\" is frequently used in the data and telecommunication industry. One would assume that something that is so widely used is very clearly defined. However, a closer look reveals some points that need to be clarified.",
      "ja": "頭字語「OAMは、」頻繁にデータや通信業界で使用されています。一つは、そう広く使用されている何かが非常に明確に定義されていることを前提としています。しかし、よく見ると明確にする必要があるいくつかのポイントを明らかにする。"
    },
    {
      "indent": 3,
      "text": "If such an important piece of our technology is so poorly defined, or if there are dialects of the technology with different understandings of such a key concept, this will eventually cause problems.",
      "ja": "当社の技術の重要な部分はそう悪く定義されている場合、このような重要な概念の異なる理解と技術の方言がある場合、または、これは最終的に問題が発生します。"
    },
    {
      "indent": 3,
      "text": "Trying to understand the use of an acronym that is as \"content-rich\" as OAM reveals two levels of complexity. First, each letter in the acronym represents an integrated piece of functionality. Second, the acronym, as such, represents something that is more than just the sum of its parts.",
      "ja": "OAMは、複雑さの二つのレベルを明らかにして、「リッチコンテンツ」とある頭字語の使用を理解しようとしています。まず、頭字語の各文字は、機能の統合された部分を表しています。第二に、頭字語は、など、その部品の単なる総和以上の何かを表しています。"
    },
    {
      "indent": 3,
      "text": "There is also the issue of how each piece of the acronym is defined. This document provides an analysis of what each initial of the initialism represents and provides possible interpretations of the acronym. Finally, a recommendation for the interpretation of the \"OAM\" acronym is provided.",
      "ja": "頭字語の各部分がどのように定義されるかの問題もあります。この文書では、initialismの各初期は何を表しているかの分析を提供し、頭字語の解釈の可能性を提供します。最後に、「OAM」頭字語の解釈のための勧告を提供します。"
    },
    {
      "indent": 3,
      "text": "Another useful document to make the \"OAM\" term understandable in a wider scope is found in \"An Overview of Operations, Administration, and Maintenance (OAM) Mechanisms\" [OAM-OVERVIEW].",
      "ja": "より広い範囲で理解しやすい「OAM」という用語を作るための別の有用な文書は、「事業の概要、管理、および保守（OAM）メカニズム」[OAM-概要]で発見されました。"
    },
    {
      "indent": 0,
      "text": "1.1. Terminology",
      "section_title": true,
      "ja": "1.1. 用語"
    },
    {
      "indent": 3,
      "text": "o \"Mgmt\" - Management",
      "ja": "O \"Mgmt（仮想ディスクの管理）\"  - 管理"
    },
    {
      "indent": 3,
      "text": "o O&M - OAM and Management",
      "ja": "O O＆M  -  OAMと管理"
    },
    {
      "indent": 3,
      "text": "o OAM - Operations, Administration, and Maintenance",
      "ja": "OAM O  - 運用、管理、およびメンテナンス"
    },
    {
      "indent": 3,
      "text": "o SDO - Standards Development Organization",
      "ja": "O SDO  - 標準開発機構"
    },
    {
      "indent": 0,
      "text": "2. Pre-Existing Uses of OAM",
      "section_title": true,
      "ja": "OAMの2.既存の使用方法"
    },
    {
      "indent": 3,
      "text": "This section provides information on how OAM is used in other SDOs (Standards Development Organizations) and provides the background necessary to understand the how the term is used in the IETF.",
      "ja": "このセクションでは、OAMは、他のSDO（規格開発機関）で使用される方法に関する情報を提供し、用語がIETFで使用されているかを理解するために必要なバックグラウンドを提供します。"
    },
    {
      "indent": 0,
      "text": "2.1. Uses of OAM in Other SDOs",
      "section_title": true,
      "ja": "2.1. その他のSDOにおけるOAMの使用"
    },
    {
      "indent": 3,
      "text": "Operations And Maintenance (OAM): A group of network management functions that provide network fault indication, performance information, and data and diagnosis functions. ATM OAM ITU-T I.610 [ITU-T-I.610] is an example specification that uses this expansion of the \"OAM\" acronym.",
      "ja": "操作および保守（OAM）：ネットワークの障害通知、性能情報、データおよび診断機能を提供するネットワーク管理機能のグループ。 ATM OAM ITU-T I.610 [ITU-T-I.610は \"OAM\" の頭字語のこの拡張を使用する例の仕様です。"
    },
    {
      "indent": 3,
      "text": "Operations, Administration, and Maintenance (OAM): A group of network management functions that provide network fault indication, fault localization, performance information, and data and diagnosis functions. Examples where this acronym is used are Clause 57 of IEEE 802.3-2008 [IEEE.802.3-2008] and ITU-T Y.1731 [ITU-T-Y.1731].",
      "ja": "運用、管理、および保守（OAM）：ネットワークの障害通知、障害の局在化、性能情報、データおよび診断機能を提供するネットワーク管理機能のグループ。この頭字語が使用される例は、IEEE 802.3から2008 [IEEE.802.3-2008]とITU-T Y.1731 [ITU-T Y.1731  - ]の節57です。"
    },
    {
      "indent": 3,
      "text": "The ITU-T M.3010 [ITU-T-M.3010] Recommendation defines operations systems function as a function block that processes information related to the telecommunications management for the purpose of monitoring/coordinating and/or controlling telecommunication functions including management functions (i.e., the TMN (Telecommunications Management Network) itself).",
      "ja": "ITU-T M.3010 [ITU-TM.3010]勧告は、モニタリング/調整および/または管理機能（すなわち、含む通信機能を制御するために電気通信管理に関連する情報を処理する機能ブロックとしてオペレーションシステム機能を定義しますTMN（電気通信管理ネットワーク）そのもの）。"
    },
    {
      "indent": 3,
      "text": "The Metro Ethernet Forum refers to OAM as the tools and utilities to install, monitor, and troubleshoot a network, helping carriers run their networks more effectively MEF 17 [MEF-17].",
      "ja": "メトロ・イーサネット・フォーラムは、インストール、監視、およびネットワークのトラブルシューティングを行うためのツールやユーティリティなどOAMを意味し、支援するキャリアは、より効果的にMEF 17 [MEF-17]自社のネットワークを実行します。"
    },
    {
      "indent": 0,
      "text": "2.1.1. The \"O\" in OAM",
      "section_title": true,
      "ja": "2.1.1.  OAMの「O」"
    },
    {
      "indent": 3,
      "text": "The \"O\" in OAM invariably stands for \"Operations\". However, there is some ambivalence in the definition and scope of the term \"Operation\".",
      "ja": "OAMでの「O」は必ず「操作」の略です。しかし、用語「操作」の定義と範囲でいくつかのアンビバレンスがあります。"
    },
    {
      "indent": 3,
      "text": "Examples of tools related to \"operations\" are performance monitoring tools used for service level agreement (SLA) measurement, fault management tools used to monitor the health of nodes and links in the network, and network provisioning tools.",
      "ja": "「操作」に関連するツールの例は、サービスレベルアグリーメント（SLA）の測定、ネットワーク内のノード及びリンクの状態を監視するために使用される障害管理ツール、およびネットワークプロビジョニングツールを使用するパフォーマンス監視ツールです。"
    },
    {
      "indent": 0,
      "text": "2.1.2. The \"A\" in OAM",
      "section_title": true,
      "ja": "2.1.2.  OAMにおける「A」"
    },
    {
      "indent": 3,
      "text": "The \"A\" in OAM stands for \"Administration\".",
      "ja": "OAMの「A」は「管理」の略です。"
    },
    {
      "indent": 3,
      "text": "Examples of \"administration\" tools are network discovery and planning tools.",
      "ja": "「管理」ツールの例としては、ネットワークの発見と計画ツールです。"
    },
    {
      "indent": 0,
      "text": "2.1.3. The \"M\" in OAM",
      "section_title": true,
      "ja": "2.1.3.  OAMで「M」"
    },
    {
      "indent": 3,
      "text": "The \"M\" in OAM stands for \"Maintenance\" or \"Management\".",
      "ja": "OAMにおける「M」は「メンテナンス」または「管理」の略です。"
    },
    {
      "indent": 3,
      "text": "Examples of \"maintenance\" tools are implementations of connectivity check, loopback, link trace, and other tools that can be used to monitor and diagnose failures in a network or network element.",
      "ja": "「メンテナンス」ツールの例には、接続性チェック、ループバック、リンクトレース、およびネットワークまたはネットワーク要素内の障害を監視し、診断するために使用することができる他のツールの実装です。"
    },
    {
      "indent": 3,
      "text": "The Recommendation ITU-T M.20 [ITU-T-M.20] defines maintenance as the whole of operations required for setting up and maintaining, within prescribed limits, any element involved in the setting up of a connection (see the ITU-T M.60 [ITU-T-M.60] Recommendation). The purpose is to properly plan and program the maintenance operations required to establish and maintain a network.",
      "ja": "勧告ITU-T M.20 [ITU-TM.20】接続の設定アップに関与する任意の要素（ITU-T Mを参照して、所定の制限内で、設定および維持するために必要な操作の全体としてのメンテナンスを定義します0.60 [ITU-TM.60]推奨）。目的は、適切にネットワークを確立し、維持するために必要なメンテナンス作業を計画し、プログラムすることです。"
    },
    {
      "indent": 3,
      "text": "A major aim of the concept of maintenance is to minimize both the occurrence and the impact of failures and to ensure that in case of a failure the correct actions are taken.",
      "ja": "メンテナンスの概念の主要な目的は、発生し、障害の影響の両方を最小限に抑えるために、失敗した場合には、正しい行動が取られていることを確認することです。"
    },
    {
      "indent": 0,
      "text": "2.2. Uses of OAM in the IETF",
      "section_title": true,
      "ja": "2.2.  IETFでのOAMの使用"
    },
    {
      "indent": 3,
      "text": "The examples below show a number of different ways that the \"OAM\" acronym has been expanded in IETF RFCs. The reference list is not exhaustive.",
      "ja": "以下の例は、「OAM」の頭文字はIETFのRFCに展開されてきた、いくつかの異なる方法を示しています。参照リストは網羅的なものではありません。"
    },
    {
      "indent": 3,
      "text": "o OAM = Operations, Administration, and Maintenance in RFC 5586 [RFC5586]",
      "ja": "RFC 5586における入出力OAM =運用、管理、および保守[RFC5586]"
    },
    {
      "indent": 3,
      "text": "o OAM = Operations and Maintenance in RFC 3429 [RFC3429]",
      "ja": "RFC 3429における入出力OAM =オペレーションおよびメンテナンス[RFC3429]"
    },
    {
      "indent": 3,
      "text": "o OAM = Operations and Management in RFC 4377 [RFC4377]",
      "ja": "RFC 4377での入出力OAM =運用と管理[RFC4377]"
    },
    {
      "indent": 3,
      "text": "o O&M = OAM and Maintenance in RFC 1812 [RFC1812]",
      "ja": "O O＆M = RFC 1812 [RFC1812]でOAMとメンテナンス"
    },
    {
      "indent": 3,
      "text": "Sometimes there is a fourth letter added to the acronym:",
      "ja": "時には頭文字に追加第四の手紙があります："
    },
    {
      "indent": 3,
      "text": "o OAM&P = Operations, Administration, Maintenance and Provisioning in RFC 4594 [RFC4594]",
      "ja": "RFC 4594中のO OAM＆P =運用、管理、保守およびプロビジョニング[RFC4594]"
    },
    {
      "indent": 0,
      "text": "3. Recommendations on the Use of the \"OAM\" Acronym",
      "section_title": true,
      "ja": "「OAM」頭字語の使用3.勧告"
    },
    {
      "indent": 3,
      "text": "The IETF-recommended expansion of the \"OAM\" acronym is given below. In addition to the \"OAM\" acronym, two other recommendations are made in this section.",
      "ja": "「OAM」頭字語のIETF推奨拡張は以下のとおりです。 「OAM」の頭字語に加えて、二つの他の推薦は、このセクションで構成されています。"
    },
    {
      "indent": 3,
      "text": "o OAM - Operations, Administration, and Maintenance",
      "ja": "OAM O  - 運用、管理、およびメンテナンス"
    },
    {
      "indent": 3,
      "text": "o O&M - OAM and Management o \"Mgmt\" - Management",
      "ja": "O O＆M  -  \"Mgmt（仮想ディスクの管理）\" O OAMと管理 - 管理"
    },
    {
      "indent": 3,
      "text": "The components of the \"OAM\" acronym (and provisioning) are defined as follows:",
      "ja": "次のように「OAM」の頭字語（およびプロビジョニング）のコンポーネントが定義されています。"
    },
    {
      "indent": 3,
      "text": "o Operations - Operation activities are undertaken to keep the network (and the services that the network provides) up and running. It includes monitoring the network and finding problems. Ideally these problems should be found before users are affected.",
      "ja": "O操作 - 操作活動は稼働ネットワーク（およびネットワークが提供するサービス）を維持するために行われています。これは、ネットワークを監視し、問題を見つけることが含まれます。ユーザーに影響が及ぶ前に、理想的には、これらの問題が見つかるはずです。"
    },
    {
      "indent": 3,
      "text": "o Administration - Administration activities involve keeping track of resources in the network and how they are used. It includes all the bookkeeping that is necessary to track networking resources and the network under control.",
      "ja": "Oの管理 - 管理活動は、ネットワーク内のリソースを追跡し、それらがどのように使用されている伴います。これは、制御の下でネットワークリソースとネットワークを追跡する必要があるすべての簿記が含まれています。"
    },
    {
      "indent": 3,
      "text": "o Maintenance - Maintenance activities are focused on facilitating repairs and upgrades -- for example, when equipment must be replaced, when a router needs a patch for an operating system image, or when a new switch is added to a network. Maintenance also involves corrective and preventive measures to make the managed network run more effectively, e.g., adjusting device configuration and parameters.",
      "ja": "Oメンテナンス - メンテナンス活動は修理やアップグレードが容易に焦点を当てている - ルータがオペレーティングシステムイメージ用のパッチを必要とするとき、または新しいスイッチをネットワークに追加されたとき、たとえば、する場合は、装置は、交換する必要があります。メンテナンスは、デバイスの設定とパラメータを調整し、例えば、より効果的に管理するネットワークの実行を行うために是正・予防措置を必要とします。"
    },
    {
      "indent": 3,
      "text": "\"Provisioning\" is outside the scope of this document, but the following definition is provided for completeness.",
      "ja": "「プロビジョニング」このドキュメントの範囲外ですが、次の定義は、完全性のために提供されます。"
    },
    {
      "indent": 3,
      "text": "o Provisioning - Provisioning activities involve configuring resources in the network to support the offered services. This might include setting up the network so that a new customer can receive an Internet access service.",
      "ja": "Oプロビジョニング - プロビジョニング活動は、提供されるサービスをサポートするために、ネットワーク内のリソースを設定することを含みます。これは、新しい顧客がインターネット接続サービスの提供を受けることができるように、ネットワークの設定などがあります。"
    },
    {
      "indent": 3,
      "text": "In general, Provisioning is used to configure the network to provide new services, whereas OAM is used to keep the network in a state that it can support already existing services.",
      "ja": "一般的には、プロビジョニングは、OAMは、それが既存のサービスをサポートすることができた状態でネットワークを維持するために使用されるのに対し、新しいサービスを提供するために、ネットワークを構成するために使用されます。"
    },
    {
      "indent": 3,
      "text": "Sometimes it is necessary to talk about the combination of functions and tools supplied by OAM and Management, it is preferred that this is spelled out as \"OAM and Management\". In cases where an acronym is needed, O&M should be used.",
      "ja": "時にはこれは「OAMと管理」と綴られていることが好ましい、OAMと管理によって提供される機能やツールの組み合わせについて話をする必要があります。頭字語が必要な場合には、O＆Mを使用する必要があります。"
    },
    {
      "indent": 3,
      "text": "\"Mgmt\" will be used if an abbreviation for \"Management\" is needed. This document does not define Management.",
      "ja": "「管理」の略称が必要な場合は、「Mgmt（仮想ディスクの管理）」を使用します。この文書では、管理を定義していません。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "This document provides guidance for the use of the \"OAM\" acronym in other documents. This document does not have direct security implications.",
      "ja": "この文書は他の文書の「OAM」の頭文字を使用するためのガイダンスを提供します。この文書では、直接のセキュリティへの影響はありません。"
    },
    {
      "indent": 3,
      "text": "The misunderstanding of an acronym may lead to incorrect specification or implementation which may, in turn, open up security concerns with protocols or deployed networks. Clarifying the meaning of OAM is, therefore, a benefit for future stability of specifications.",
      "ja": "頭字語の誤解は、順番に、プロトコルや展開のネットワークとセキュリティの問題を開くことがあり、誤った仕様や実装につながる可能性があります。 OAMの意味を明確にすることは、そのため、仕様の将来の安定のための利益です。"
    },
    {
      "indent": 0,
      "text": "5. Acknowledgments",
      "section_title": true,
      "ja": "5.謝辞"
    },
    {
      "indent": 3,
      "text": "The following individuals significantly contributed to this document.",
      "ja": "以下の個人が大幅にこの文書に貢献しました。"
    },
    {
      "indent": 3,
      "text": "o Malcolm Betts from M. C. Betts Consulting, Ltd.",
      "ja": "M. C.ベッツコンサルティング製Oマルコムベッツ"
    },
    {
      "indent": 3,
      "text": "o Kam Lam from Alcatel Lucent",
      "ja": "アルカテル・ルーセントからカムラムO"
    },
    {
      "indent": 3,
      "text": "o Dieter Beller from Alcatel Lucent",
      "ja": "アルカテル・ルーセントからディーターBeller O"
    },
    {
      "indent": 3,
      "text": "o David Harrington from Huawei Technologies",
      "ja": "華為技術からOデビッド・ハリントン"
    },
    {
      "indent": 3,
      "text": "Thanks to the experts of ITU-T SG 15 for their review and comments.",
      "ja": "彼らのレビューとコメントのためのITU-T SG 15の専門家に感謝します。"
    },
    {
      "indent": 0,
      "text": "6. Informative References",
      "section_title": true,
      "ja": "6.参考文献"
    },
    {
      "indent": 3,
      "text": "[IEEE.802.3-2008] IEEE, \"Information technology - Telecommunications and information exchange between systems - Local and metropolitan area networks - Specific requirements - Part 3: Carrier sense multiple access with collision detection (CSMA/CD) access method and physical layer specifications\", IEEE Standard 802.3, December 2008.",
      "ja": "[IEEE.802.3-2008] IEEE、「情報技術 - 電気通信及びシステム間の情報交換 - 地方とメトロポリタンエリアネットワーク - 特定の要件 - パート3：衝突検出（CSMA / CD）アクセス方式および物理層仕様とキャリア検知多重アクセス」、IEEE規格802.​​3、2008年12月。"
    },
    {
      "indent": 3,
      "text": "[ITU-T-I.610] International Telecommunication Union, \"B-ISDN operation and maintenance principles and functions\", ITU-T Recommendation I.610, February 1999.",
      "ja": "[ITU-T-I.610]国際電気通信連合、 \"B-ISDNの運用・保守原則と機能\"、ITU-T勧告I.610、1999年2月。"
    },
    {
      "indent": 3,
      "text": "[ITU-T-M.20] International Telecommunication Union, \"Maintenance philosophy for telecommunication networks\", ITU-T Recommendation M.20, October 1992.",
      "ja": "[ITU-T-M.20]国際電気通信連合、 \"通信ネットワークの保守思想\"、ITU-T勧告M.20、1992年10月。"
    },
    {
      "indent": 3,
      "text": "[ITU-T-M.3010] International Telecommunication Union, \"Principles for a telecommunications management network\", ITU-T Recommendation M.3010, February 2000.",
      "ja": "[ITU-T-M.3010]国際電気通信連合、ITU-T勧告M.3010、2000年2月 \"電気通信管理ネットワークのための原則\"。"
    },
    {
      "indent": 3,
      "text": "[ITU-T-M.60] International Telecommunication Union, \"Maintenance terminology and definitions\", ITU-T Recommendation M.60, March 1993.",
      "ja": "[ITU-T-M.60]国際電気通信連合、 \"メンテナンスの用語および定義\"、ITU-T勧告M.60、1993年3月。"
    },
    {
      "indent": 3,
      "text": "[ITU-T-Y.1731] International Telecommunication Union, \"OAM functions and mechanisms for Ethernet based networks\", ITU-T Recommendation Y.1731, February 2008.",
      "ja": "[ITU-T Y.1731  - ]国際電気通信連合、 \"イーサネットベースのネットワークのためのOAM機能とメカニズム\"、ITU-T勧告Y.1731、2008年2月。"
    },
    {
      "indent": 3,
      "text": "[MEF-17] Metro Ethernet Forum, \"Service OAM Requirements & Framework - Phase 1\", MEF Technical Specification MEF 17, April 2007.",
      "ja": "[MEF-17]メトロ・イーサネット・フォーラム、 \"サービスOAMの要件＆フレームワーク - フェーズ1\"、MEF技術仕様MEF 17、2007年4月。"
    },
    {
      "indent": 3,
      "text": "[OAM-OVERVIEW] Mizrahi, T., Sprecher, N., Bellagamba, E., and Y. Weingarten, \"An Overview of Operations, Administration, and Maintenance (OAM) Mechanisms\", Work in Progress, March 2011.",
      "ja": "[OAM-概要]ミズラヒ、T.、Sprecher、N.、Bellagamba、E.、およびY.ヴェンガルテン、 \"事業の概要、管理、および保守（OAM）メカニズム\"、進歩、2011年3月に作業。"
    },
    {
      "indent": 3,
      "text": "[RFC1812] Baker, F., \"Requirements for IP Version 4 Routers\", RFC 1812, June 1995.",
      "ja": "[RFC1812]ベイカー、F.、RFC 1812、1995年6月 \"IPバージョン4つのルータのための要件\"。"
    },
    {
      "indent": 3,
      "text": "[RFC3429] Ohta, H., \"Assignment of the 'OAM Alert Label' for Multiprotocol Label Switching Architecture (MPLS) Operation and Maintenance (OAM) Functions\", RFC 3429, November 2002.",
      "ja": "[RFC3429]太田、H.、RFC 3429、2002年11月 \"のアーキテクチャをマルチプロトコル・ラベル・スイッチング（MPLS）動作及び保守（OAM）機能のための 'OAMの警告ラベル' の割り当て\"。"
    },
    {
      "indent": 3,
      "text": "[RFC4377] Nadeau, T., Morrow, M., Swallow, G., Allan, D., and S. Matsushima, \"Operations and Management (OAM) Requirements for Multi-Protocol Label Switched (MPLS) Networks\", RFC 4377, February 2006.",
      "ja": "[RFC4377]ナドー、T.、モロー、M.、ツバメ、G.、アラン、D.、およびS.松島は、RFC 4377 \"操作とマルチプロトコルラベルの管理（OAM）要件（MPLS）ネットワークのスイッチ\" 、2006年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC4594] Babiarz, J., Chan, K., and F. Baker, \"Configuration Guidelines for DiffServ Service Classes\", RFC 4594, August 2006.",
      "ja": "[RFC4594] Babiarz、J.、チャン、K.、およびF.ベイカー、 \"DiffServのサービスクラスの設定時の注意事項\"、RFC 4594、2006年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC5586] Bocci, M., Vigoureux, M., and S. Bryant, \"MPLS Generic Associated Channel\", RFC 5586, June 2009.",
      "ja": "[RFC5586]ボッチ、M.、Vigoureux、M.、およびS.ブライアント、 \"MPLSジェネリック関連チャンネル\"、RFC 5586、2009年6月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Loa Andersson Ericsson",
      "ja": "ロア・アンダーソンエリクソン"
    },
    {
      "indent": 3,
      "text": "EMail: loa.andersson@ericsson.com",
      "ja": "メールアドレス：loa.andersson@ericsson.com"
    },
    {
      "indent": 3,
      "text": "Huub van Helvoort Huawei Technologies",
      "ja": "HuubバンHelvoort華為技術"
    },
    {
      "indent": 3,
      "text": "EMail: huub.van.helvoort@huawei.com",
      "ja": "メールアドレス：huub.van.helvoort@huawei.com"
    },
    {
      "indent": 3,
      "text": "Ron Bonica Juniper Networks",
      "ja": "ロン・プリティ・ジュニパーネットワークス"
    },
    {
      "indent": 3,
      "text": "EMail: rbonica@juniper.net",
      "ja": "メールアドレス：rbonica@juniper.net"
    },
    {
      "indent": 3,
      "text": "Dan Romascanu Avaya",
      "ja": "ダンRomascanuアバイア"
    },
    {
      "indent": 3,
      "text": "EMail: dromasca@avaya.com",
      "ja": "メールアドレス：dromasca@avaya.com"
    },
    {
      "indent": 3,
      "text": "Scott Mansfield Ericsson",
      "ja": "スコット・マンスフィールドエリクソン"
    },
    {
      "indent": 3,
      "text": "EMail: scott.mansfield@ericsson.com",
      "ja": "メールアドレス：scott.mansfield@ericsson.com"
    }
  ]
}