{
  "title": {
    "text": "RFC 6992 - Routing for IPv4-Embedded IPv6 Packets",
    "ja": "RFC 6992 - IPv4に埋め込まれたIPv6パケットのルーティング"
  },
  "number": 6992,
  "created_at": "2019-11-02 15:07:40.781548+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                          D. Cheng\nRequest for Comments: 6992                           Huawei Technologies\nCategory: Informational                                     M. Boucadair\nISSN: 2070-1721                                           France Telecom\n                                                               A. Retana\n                                                           Cisco Systems\n                                                               July 2013",
      "raw": true
    },
    {
      "indent": 17,
      "text": "Routing for IPv4-Embedded IPv6 Packets",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document describes a routing scenario where IPv4 packets are transported over an IPv6 network, based on the methods described in RFCs 6145 and 6052, along with a separate OSPFv3 routing table for IPv4-embedded IPv6 routes in the IPv6 network.",
      "ja": "この文書は、IPv4パケットをIPv6ネットワーク中でIPv4に埋め込まれたIPv6ルートのための別個のOSPFv3ルーティングテーブルと一緒に、のRFC 6145と6052に記載された方法に基づいて、IPv6ネットワークを介して転送されるルーティングシナリオを説明しています。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 IESGによって承認されていないすべての文書がインターネットStandardのどんなレベルの候補です。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6992.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6992で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2013 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2013 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n   1.1. The Scenario ...............................................3\n   1.2. Routing Solution per RFC 5565 ..............................4\n   1.3. An Alternative Routing Solution with OSPFv3 ................4\n   1.4. OSPFv3 Routing with a Specific Topology ....................6\n2. Requirements Language ...........................................7\n3. Provisioning ....................................................7\n   3.1. Deciding on the IPv4-Embedded IPv6 Topology ................7\n   3.2. Maintaining a Dedicated IPv4-Embedded IPv6 Routing Table ...7\n4. Translation of IP Packets .......................................8\n   4.1. Address Translation ........................................8\n5. Advertising IPv4-Embedded IPv6 Routes ...........................9\n   5.1. Advertising IPv4-Embedded IPv6 Routes through an\n        IPv6 Transit Network .......................................9\n        5.1.1. Routing Metrics .....................................9\n        5.1.2. Forwarding Address .................................10\n   5.2. Advertising IPv4 Addresses into Client Networks ...........10\n6. Aggregation on IPv4 Addresses and Prefixes .....................10\n7. Forwarding .....................................................10\n8. Backdoor Connections ...........................................11\n9. Prevention of Loops ............................................11\n10. MTU Issues ....................................................11\n11. Security Considerations .......................................12\n12. Operational Considerations ....................................13\n13. Acknowledgements ..............................................14\n14. References ....................................................14\n   14.1. Normative References .....................................14\n   14.2. Informative References ...................................14",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "This document describes a routing scenario where IPv4 packets are transported over an IPv6 network, based on [RFC6145] and [RFC6052], along with a separate OSPFv3 routing table for IPv4-embedded IPv6 routes in the IPv6 network. This document does not introduce any new IPv6 transition mechanism.",
      "ja": "この文書は、IPv6ネットワークでのIPv4埋め込みIPv6ルートのための別個のOSPFv3ルーティングテーブルとともに、ルーティング[RFC6145]に基づいて、IPv4パケットをIPv6ネットワーク上で転送されたシナリオ、および[RFC6052]を記述する。この文書は、新しいIPv6移行メカニズムを導入しません。"
    },
    {
      "indent": 3,
      "text": "In this document, the following terminology is used:",
      "ja": "この文書では、以下の用語が使用されます。"
    },
    {
      "indent": 3,
      "text": "o An IPv4-embedded IPv6 address denotes an IPv6 address that contains an embedded 32-bit IPv4 address constructed according to the rules defined in [RFC6052].",
      "ja": "OのIPv4埋め込みIPv6アドレスは[RFC6052]で定義されたルールに従って構築埋め込みの32ビットIPv4アドレスが含まれているIPv6アドレスを表します。"
    },
    {
      "indent": 3,
      "text": "o IPv4-embedded IPv6 packets are packets of which destination addresses are IPv4-embedded IPv6 addresses.",
      "ja": "OのIPv4埋め込みIPv6パケットは、宛先アドレスがIPv4埋め込みIPv6アドレスであるのパケットです。"
    },
    {
      "indent": 3,
      "text": "o AFBR (Address Family Border Router) [RFC5565] refers to an edge router that supports both IPv4 and IPv6 address families, but the backbone network it connects to only supports either the IPv4 or IPv6 address family.",
      "ja": "O AFBR（ファミリー境界ルータアドレス）[RFC5565]は、IPv4とIPv6の両方のアドレスファミリをサポートしているエッジルータを指しますが、それが接続するバックボーンネットワークはIPv4またはIPv6アドレスファミリのいずれかをサポートしています。"
    },
    {
      "indent": 3,
      "text": "o AFXLBR (Address Family Translation Border Router) is defined in this document. It refers to a border router that supports both IPv4 and IPv6 address families located on the boundary of an IPv4- only network and an IPv6-only network and that is capable of performing IP header translation between IPv4 and IPv6 [RFC6145].",
      "ja": "O AFXLBR（アドレスファミリー翻訳境界ルータ）は、この文書で定義されています。これはIPv4-のみネットワークとIPv6のみのネットワークの境界に位置し、IPv4とIPv6の両方のアドレスファミリをサポートする境界ルータを指し、それは、IPv4とIPv6 [RFC6145]の間でIPヘッダの変換を行うことができます。"
    },
    {
      "indent": 0,
      "text": "1.1. The Scenario",
      "section_title": true,
      "ja": "1.1. シナリオ"
    },
    {
      "indent": 3,
      "text": "Due to exhaustion of public IPv4 addresses, there has been a continuing effort within the IETF to investigate and specify IPv6 transitional techniques. In the course of the transition, it is certain that networks based on IPv4 and IPv6 technologies, respectively, will coexist at least for some time. One such scenario is the interconnection of IPv4-only and IPv6-only networks, and in particular, when an IPv6-only network serves as an interconnection between several segregated IPv4-only networks. In this scenario, IPv4 packets are transported over the IPv6 network between IPv4 networks. In order to forward an IPv4 packet from a source IPv4 network to the destination IPv4 network, IPv4 reachability information must be exchanged between the IPv4 networks via some mechanism.",
      "ja": "パブリックIPv4アドレスの枯渇に、IPv6の移行技術を調査し、指定するIETF内で継続的な努力がなされています。転移の過程では、IPv4とIPv6の技術に基づくネットワークは、それぞれ、しばらくの間、少なくとも共存することは確かです。そのようなシナリオは、IPv4のみとIPv6のみのネットワークの相互接続であり、特に、IPv6のみのネットワークは、いくつかの分離IPv4のみのネットワーク間の相互接続として機能します。このシナリオでは、IPv4パケットは、IPv4ネットワークとの間のIPv6ネットワーク上で転送されます。宛先IPv4ネットワークに送信元IPv4ネットワークからIPv4パケットを転送するために、IPv4の到達可能性情報は、いくつかの機構を介してIPv4ネットワークとの間で交換されなければなりません。"
    },
    {
      "indent": 3,
      "text": "In general, running an IPv6-only network would reduce operational expenditures and optimize operations as compared to an IPv4-IPv6 dual-stack environment. Some proposed solutions allow the delivery of IPv4 services over an IPv6-only network. This document specifies an engineering technique that separates the routing table dedicated to IPv4-embedded IPv6 destinations from the routing table used for native IPv6 destinations.",
      "ja": "一般的には、IPv6のみのネットワークを実行すると、運用コストを削減し、IPv4-IPv6のデュアルスタック環境に比べて運用を最適化します。いくつかの提案された解決策は、IPv6のみのネットワーク上でのIPv4サービスの提供を可能にします。この文書は、ネイティブIPv6宛先に使用されるルーティングテーブルからのIPv4-IPv6の埋め込み先に専用のルーティングテーブルを分離工学的手法を特定します。"
    },
    {
      "indent": 3,
      "text": "OSPFv3 is designed to support multiple instances. Maintaining a separate routing table for IPv4-embedded IPv6 routes would simplify implementation, troubleshooting, and operation; it would also prevent overload of the native IPv6 routing table. A separate routing table can be generated from a separate routing instance.",
      "ja": "OSPFv3のは、複数のインスタンスをサポートするように設計されています。実装、トラブルシューティング、および操作を簡素化することになるIPv4の埋め込みIPv6ルートのための個別のルーティングテーブルを維持します。それはまた、ネイティブのIPv6ルーティングテーブルの過負荷を防止するであろう。別々のルーティングテーブルは、別のルーティングインスタンスから生成することができます。"
    },
    {
      "indent": 1,
      "text": "1.2. Routing Solution per",
      "section_title": true,
      "ja": "1.2. あたりのルーティングソリューション"
    },
    {
      "indent": 3,
      "text": "The aforementioned scenario is described in [RFC5565], i.e., the IPv4-over-IPv6 scenario, where the network core is IPv6-only and the interconnected IPv4 networks are called IPv4 client networks. The P Routers (Provider Routers) in the core only support IPv6, but the AFBRs support IPv4 on interfaces facing IPv4 client networks and IPv6 on interfaces facing the core. The routing solution defined in [RFC5565] for this scenario is to run IBGP among AFBRs to exchange IPv4 routing information in the core, and the IPv4 packets are forwarded from one IPv4 client network to the other through a softwire using tunneling technology, such as MPLS, LSP, GRE, L2TPv3, etc.",
      "ja": "前述のシナリオは、[RFC5565]に記載されている、すなわち、ネットワークのコアはIPv6のみであるIPv4のオーバーのIPv6シナリオ、および相互接続されたIPv4ネットワークは、IPv4クライアント・ネットワークと呼ばれます。 Pコアのルータ（プロバイダールータ）IPv6のみをサポートするが、AFBRsコアに面するインターフェース上でIPv4クライアント・ネットワークに面するおよびIPv6インターフェース上でIPv4をサポートします。このシナリオのために[RFC5565]で定義されたルーティングソリューションは、コア中にIPv4ルーティング情報を交換するAFBRs間IBGPを実行することで、IPv4パケットは、MPLSのように、トンネリング技術を用いsoftwire介して他の1つのIPv4クライアントネットワークから転送され、LSP、GRE、L2TPv3の、など"
    },
    {
      "indent": 0,
      "text": "1.3. An Alternative Routing Solution with OSPFv3",
      "section_title": true,
      "ja": "1.3.  OSPFv3の持つ代替ルーティングソリューション"
    },
    {
      "indent": 3,
      "text": "In this document, we propose an alternative routing solution for the scenario described in Section 1.1 where several segregated IPv4 networks, called IPv4 client networks, are interconnected by an IPv6 network. The IPv6 network and the interconnected IPv4 networks may or may not belong to the same Autonomous System (AS). We refer to the border node on the boundary of an IPv4 client network and the IPv6 network as an Address Family Translation Border Router (AFXLBR), which supports both the IPv4 and IPv6 address families and is capable of translating an IPv4 packet to an IPv6 packet, and vice versa, according to [RFC6145]. The described scenario is illustrated in Figure 1.",
      "ja": "この文書では、我々は、IPv4クライアント・ネットワークと呼ばれるいくつかの隔離されたIPv4ネットワークは、IPv6ネットワークによって相互接続され、セクション1.1で説明したシナリオのための代替ルーティングソリューションを提案しています。 IPv6ネットワークと相互接続されたIPv4ネットワークは、同じ自律システム（AS）に属していてもいなくてもよいです。私たちは、IPv4およびIPv6アドレスファミリの両方をサポートし、IPv6パケットをIPv4パケットを翻訳することのできるアドレスファミリー翻訳境界ルータ（AFXLBR）、などのIPv4クライアントネットワークの境界とIPv6ネットワーク上の境界ノードを参照してください。 、及びその逆、[RFC6145]に記載の方法。説明したシナリオは、図1に示されています。"
    },
    {
      "indent": 7,
      "text": "                 +--------+   +--------+\n                 |  IPv4  |   |  IPv4  |\n                 | Client |   | Client |\n                 | Network|   | Network|\n                 +--------+   +--------+\n                     |   \\     /   |\n                     |    \\   /    |\n                     |     \\ /     |\n                     |      X      |\n                     |     / \\     |\n                     |    /   \\    |\n                     |   /     \\   |\n                 +--------+   +--------+\n                 | AFXLBR |   | AFXLBR |\n              +--| IPv4/6 |---| IPv4/6 |--+\n              |  +--------+   +--------+  |\n+--------+    |                           |    +--------+\n|  IPv6  |    |                           |    |  IPv6  |\n| Client |----|                           |----| Client |\n| Network|    |            IPv6           |    | Network|\n+--------+    |            only           |    +--------+\n              |                           |\n              |  +--------+   +--------+  |\n              +--| AFXLBR |---| AFXLBR |--+\n                 | IPv4/6 |   | IPv4/6 |\n                 +--------+   +--------+\n                     |   \\     /   |\n                     |    \\   /    |\n                     |     \\ /     |\n                     |      X      |\n                     |     / \\     |\n                     |    /   \\    |\n                     |   /     \\   |\n                 +--------+   +--------+\n                 |  IPv4  |   |  IPv4  |\n                 | Client |   | Client |\n                 | Network|   | Network|\n                 +--------+   +--------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Figure 1: Segregated IPv4 Networks Interconnected by an IPv6 Network",
      "ja": "図1：IPv6ネットワークによって相互接続された分別IPv4ネットワーク"
    },
    {
      "indent": 3,
      "text": "Since the scenario occurs most commonly within an organization, an IPv6 prefix can be locally allocated and used by AFXLBRs to construct IPv4-embedded IPv6 addresses [RFC6052]. The embedded IPv4 address or prefix belongs to an IPv4 client network that is connected to the AFXLBR. An AFXLBR injects IPv4-embedded IPv6 addresses and prefixes into the IPv6 network using OSPFv3, and it also installs IPv4-embedded IPv6 routes advertised by other AFXLBRs.",
      "ja": "シナリオは、組織内で最も一般的に起こるので、IPv6プレフィックスをローカルに割り当てられたIPv4埋め込みIPv6アドレス[RFC6052]を構築するためにAFXLBRsで使用することができます。埋め込まれたIPv4アドレスまたはプレフィックスがAFXLBRに接続されたIPv4クライアントのネットワークに属しています。 AFXLBRはOSPFv3のを使用してIPv6ネットワークにIPv4に埋め込まれたIPv6アドレスとプレフィックスを注入し、そしてそれはまた、他のAFXLBRsによってアドバタイズたIPv4埋め込みIPv6ルートをインストールします。"
    },
    {
      "indent": 3,
      "text": "When an AFXLBR receives an IPv4 packet from a locally connected IPv4 client network destined to a remote IPv4 client network, it translates the IPv4 header to the relevant IPv6 header [RFC6145], and in that process, the source and destination IPv4 addresses are translated into IPv4-embedded IPv6 addresses, respectively [RFC6052]. The resulting IPv6 packet is then forwarded to the AFXLBR that connects to the destination IPv4 client network. The remote AFXLBR derives the IPv4 source and destination addresses from the IPv4- embedded IPv6 addresses, respectively [RFC6052], and translates the header of the received IPv6 packet to the relevant IPv4 header [RFC6145]. The resulting IPv4 packet is then forwarded according to the IPv4 routing table maintained on the AFXLBR.",
      "ja": "AFXLBRがリモートのIPv4クライアントネットワーク宛ローカルに接続されたIPv4クライアントネットワークからIPv4パケットを受信すると、関連するIPv6ヘッダ[RFC6145]にIPv4ヘッダを変換し、その過程で、送信元および宛先のIPv4アドレスが翻訳されますそれぞれのIPv4埋め込みIPv6アドレス、[RFC6052]。得られたIPv6パケットは、宛先のIPv4クライアントネットワークに接続AFXLBRに転送されます。遠隔AFXLBRは、[RFC6052]は、それぞれ、IPv4-埋め込みIPv6アドレスからIPv4ソースと宛先アドレスを導出し、関連するIPv4ヘッダ[RFC6145]に受信されたIPv6パケットのヘッダを変換します。得られたIPv4パケットは、その後AFXLBRで維持IPv4ルーティングテーブルに従って転送されます。"
    },
    {
      "indent": 3,
      "text": "There are use cases where the proposed routing solution is useful. One case is that some border nodes do not participate in IBGP for the exchange of routes, or IBGP is not used at all. Another case is when tunnels are not deployed in the IPv6 network, or native IPv6 forwarding is preferred. Note that with this routing solution, the IPv4 and IPv6 header translation performed in both directions by the AFXLBR is stateless.",
      "ja": "提案されたルーティングソリューションが有用である使用例があります。一つのケースでは、いくつかの境界ノードがルートの交換のためにIBGPに参加していないということである、またはIBGPは一切使用しておりません。別の場合には、トンネルはIPv6ネットワークに配備されていない場合であり、またはネイティブIPv6転送が好ましいです。このルーティングソリューションで、AFXLBRによって両方向に行わIPv4およびIPv6ヘッダの変換がステートレスであることに留意されたいです。"
    },
    {
      "indent": 0,
      "text": "1.4. OSPFv3 Routing with a Specific Topology",
      "section_title": true,
      "ja": "1.4. 特定のトポロジでのOSPFv3ルーティング"
    },
    {
      "indent": 3,
      "text": "In general, IPv4-embedded IPv6 packets can be forwarded just like native IPv6 packets with OSPFv3 running in the IPv6 network. However, this would require that IPv4-embedded IPv6 routes be flooded throughout the entire IPv6 network and stored on every router. This is not desirable from a scaling perspective. Moreover, since all IPv6 routes are stored in the same routing table, it would be inconvenient to manage the resource required for routing and forwarding based on traffic category, if so desired.",
      "ja": "一般に、IPv4に埋め込まれたIPv6パケットは、ちょうどOSPFv3がIPv6ネットワークで実行しているネイティブのIPv6パケットのように転送することができます。しかし、これは、IPv4埋め込みIPv6ルート全体IPv6ネットワーク全体にフラッディングし、すべてのルータに格納されることを必要とするであろう。これは、スケーリングの観点から望ましくありません。すべてのIPv6ルートが同一のルーティングテーブルに格納されているので、所望であれば、トラフィックカテゴリに基づいて、ルーティングおよび転送に必要なリソースを管理することは不便であろう。"
    },
    {
      "indent": 3,
      "text": "To improve the situation, a separate OSPFv3 routing table dedicated to the IPv4-embedded IPv6 topology can be constructed; that table would be solely used for routing IPv4-embedded IPv6 packets in the IPv6 network. The IPv4-embedded IPv6 topology includes all the participating AFXLBRs and a set of P Routers providing redundant connectivity with alternate routing paths.",
      "ja": "この状況を改善するために、IPv4に埋め込まれたIPv6トポロジーに専用の別個のOSPFv3ルーティングテーブルを構築することができます。そのテーブルは、単にIPv6ネットワーク内のIPv4埋め込みIPv6パケットをルーティングするために使用されるであろう。 IPv4に埋め込まれたIPv6トポロジーはすべての参加AFXLBRsと代替ルーティング経路と冗長接続を提供Pルータのセットを含みます。"
    },
    {
      "indent": 3,
      "text": "To realize this, a separate OSPFv3 instance is configured in the IPv6 network [RFC5838]. This instance operates on all participating AFXLBRs and a set of P routers that interconnect them. As a result, there would be a dedicated IPv4-embedded IPv6 topology that is maintained on all these routers, along with a dedicated IPv4-embedded IPv6 routing table. This routing table in the IPv6 network is solely for forwarding IPv4-embedded IPv6 packets.",
      "ja": "これを実現するために、別個のOSPFv3インスタンスは、IPv6ネットワーク[RFC5838]に構成されています。このインスタンスは、すべての参加AFXLBRsし、それらを相互接続するPルータのセットを操作します。結果として、専用のIPv4埋め込みIPv6ルーティングテーブルとともに、これらのすべてのルータで維持された専用のIPv4-IPv6の埋め込みトポロジが存在するであろう。 IPv6ネットワークにおけるこのルーティングテーブルは、単にIPv4の埋め込みIPv6パケットを転送するためのものです。"
    },
    {
      "indent": 3,
      "text": "This document elaborates on how configuration is done with this method and on related routing issues.",
      "ja": "この文書では、設定は、この方法で、関連するルーティングの問題にどのように行われるかについて詳しく説明します。"
    },
    {
      "indent": 3,
      "text": "This document only focuses on unicast routing for IPv4-embedded IPv6 packets using OSPFv3.",
      "ja": "この文書のみのOSPFv3を使用したIPv4埋め込みIPv6パケットのためのユニキャストルーティングに焦点を当てています。"
    },
    {
      "indent": 0,
      "text": "2. Requirements Language",
      "section_title": true,
      "ja": "2.必要な言語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "3. Provisioning",
      "section_title": true,
      "ja": "3.プロビジョニング"
    },
    {
      "indent": 0,
      "text": "3.1. Deciding on the IPv4-Embedded IPv6 Topology",
      "section_title": true,
      "ja": "3.1.  IPv4に埋め込まれたIPv6のトポロジの決定"
    },
    {
      "indent": 3,
      "text": "Before deploying configurations that use a separate OSPFv3 routing table for IPv4-embedded IPv6 addresses and prefixes, a decision must be made regarding the set of routers and their interfaces in the IPv6 network that should be part of the IPv4-embedded IPv6 topology.",
      "ja": "IPv4の埋め込みIPv6アドレスとプレフィクスのための別個のOSPFv3ルーティングテーブルを使用する構成を展開する前に、決定は、IPv4-IPv6の埋め込みトポロジの一部でなければならないルータのセットとIPv6ネットワークでのインタフェースについて行わなければなりません。"
    },
    {
      "indent": 3,
      "text": "For the purpose of this IPv4-embedded IPv6 topology, all AFXLBRs that connect to IPv4 client networks MUST be members of this topology. An AFXLBR MUST have at least one connection with a P Router in the IPv6 network or another AFXLBR.",
      "ja": "このIPv4に埋め込まれたIPv6トポロジの目的のために、IPv4のクライアントのネットワークに接続するすべてのAFXLBRsは、このトポロジのメンバーでなければなりません。 AFXLBRは、IPv6ネットワークにおけるPルータまたは別のAFXLBR有する少なくとも1つの接続がなければなりません。"
    },
    {
      "indent": 3,
      "text": "The IPv4-embedded IPv6 topology is a subtopology of the entire IPv6 network, and if all routers (including AFXLBRs and P routers) and all their interfaces are included, the two topologies converge. Generally speaking, when this subtopology contains more interconnected P Routers, there would be more routing paths across the IPv6 network from one IPv4 client network to the other; however, this requires more routers in the IPv6 network to participate in IPv4-embedded IPv6 routing. In any case, the IPv4-embedded IPv6 topology MUST be continuous with no partitions.",
      "ja": "IPv4に埋め込まれたIPv6トポロジー全体IPv6ネットワークのsubtopologyであり、そして（AFXLBRsおよびPルータを含む）とそのすべてのインタフェースが含まれているすべてのルータ場合、2つのトポロジが収束します。一般に、このsubtopologyは、複数の相互接続Pルータを含む場合、他の1つのIPv4クライアントネットワークからIPv6ネットワークを横切って複数のルーティング経路が存在することになる、話します。しかし、これは、IPv4埋め込みIPv6ルーティングに参加するIPv6ネットワークに複数のルータを必要とします。いずれの場合においても、IPv4に埋め込まれたIPv6トポロジはないパーティションと連続していなければなりません。"
    },
    {
      "indent": 0,
      "text": "3.2. Maintaining a Dedicated IPv4-Embedded IPv6 Routing Table",
      "section_title": true,
      "ja": "3.2. 専用のIPv4-IPv6の組み込みルーティングテーブルを維持します"
    },
    {
      "indent": 3,
      "text": "In an IPv6 network, in order to maintain a separate IPv6 routing table that contains routes for IPv4-embedded IPv6 destinations only, OSPFv3 needs to use the mechanism defined in [RFC5838].",
      "ja": "IPv6ネットワークでは、IPv4のみに埋め込まれたIPv6宛先の経路を含む別のIPv6ルーティングテーブルを維持するために、OSPFv3は[RFC5838]で定義されたメカニズムを使用する必要があります。"
    },
    {
      "indent": 3,
      "text": "It is assumed that the IPv6 network that is interconnected with IPv4 networks as described in this document is under one administration, and as such an OSPFv3 Instance ID (IID) is allocated locally and used for OSPFv3 operation dedicated to unicast IPv4-embedded IPv6 routing in an IPv6 network. This IID is configured on OSPFv3 router interfaces that participate in the IPv4-embedded IPv6 topology.",
      "ja": "なお、この文書に記載されているようにIPv4ネットワークと相互接続されたIPv6ネットワーク一回の投与中であると仮定され、そしてそのようなOSPFv3のインスタンスID（IID）が中にIPv4に埋め込まれたIPv6ルーティングをユニキャスト専用のOSPFv3の動作のために局所的に割り当てられて使用されますIPv6ネットワーク。このIIDは、IPv4に埋め込まれたIPv6トポロジに参加するのOSPFv3ルータインターフェイス上で設定されています。"
    },
    {
      "indent": 3,
      "text": "A locally configured OSPFv3 IID is allocated in the range 192 to 255, inclusive, in the \"OSPFv3 Instance ID Address Family Values\" registry; this range is reserved for \"Private Use\" [RFC6969]. This IID must be used to encode the \"Instance ID\" field in the packet header of OSPFv3 packets associated with the OSPFv3 instance.",
      "ja": "ローカルに設定されたOSPFv3 IIDは範囲192から255まで、包括的、で「OSPFv3のインスタンスIDアドレス・家族の価値」レジストリに割り当てられています。この範囲は、「私用」[RFC6969]のために予約されています。このIIDはOSPFv3インスタンスに関連付けられたOSPFv3パケットのパケットヘッダ内の「インスタンスID」フィールドを符号化するために使用されなければなりません。"
    },
    {
      "indent": 3,
      "text": "In addition, the AF-bit in the OSPFv3 Option field MUST be set.",
      "ja": "また、OSPFv3のオプションフィールドにおけるAFビットを設定しなければなりません。"
    },
    {
      "indent": 3,
      "text": "During Hello packet processing, an adjacency may only be established when the received Hello packet contains the same Instance ID as the Instance ID configured on the receiving OSPFv3 interface. This insures that only interfaces configured as part of the OSPFv3 unicast IPv4-embedded IPv6 topology are used for IPv4-embedded IPv6 unicast routing.",
      "ja": "受信したHelloパケットは、インスタンスIDが受信OSPFv3のインターフェイスに設定と同じインスタンスIDが含まれている場合Helloパケット処理中に、隣接のみ確立することができます。これは、OSPFv3のユニキャストのIPv4埋め込みIPv6のトポロジの一部として構成のみインターフェイスは、IPv4埋め込みIPv6ユニキャストルーティングのために使用されることを保証します。"
    },
    {
      "indent": 3,
      "text": "For more details, the reader is referred to [RFC5838].",
      "ja": "詳細については、読者は[RFC5838]と呼ばれます。"
    },
    {
      "indent": 0,
      "text": "4. Translation of IP Packets",
      "section_title": true,
      "ja": "IPパケットの4翻訳"
    },
    {
      "indent": 3,
      "text": "When transporting IPv4 packets across an IPv6 network via the mechanism described above (Section 3.2), an IPv4 packet is translated to an IPv6 packet at the ingress AFXLBR, and the IPv6 packet is translated back to an IPv4 packet at the egress AFXLBR. IP packet header translation is accomplished in a stateless manner according to rules specified in [RFC6145]; the details of address translation are explained in the next subsection.",
      "ja": "上述した機構（セクション3.2）を介してIPv6ネットワークを横切ってIPv4パケットを輸送する場合、IPv4パケットは、入口AFXLBRでIPv6パケットに変換され、およびIPv6パケットはバック出口AFXLBRにIPv4パケットに変換されます。 IPパケットヘッダの変換は[RFC6145]で指定された規則に従ってステートレスな方法で達成されます。アドレス変換の詳細は、次のサブセクションで説明されています。"
    },
    {
      "indent": 0,
      "text": "4.1. Address Translation",
      "section_title": true,
      "ja": "4.1. アドレス変換"
    },
    {
      "indent": 3,
      "text": "Prior to address translation, an IPv6 prefix is allocated by the operator, and it is used to form IPv4-embedded IPv6 addresses.",
      "ja": "アドレス変換の前に、IPv6プレフィックスは、オペレータによって割り当てられ、IPv4の埋め込みIPv6アドレスを形成するために使用されます。"
    },
    {
      "indent": 3,
      "text": "The IPv6 prefix can either be the IPv6 well-known prefix (WKP) 64: ff9b::/96 or a network-specific prefix that is unique to the organization; for the latter case, the IPv6 prefix length may be 32, 40, 48, 56, or 64. In either case, this IPv6 prefix is used during the address translation between an IPv4 address and an IPv4-embedded IPv6 address, as described in [RFC6052].",
      "ja": "IPv6プレフィックスは、IPv6、周知のプレフィックス（WKP）64のいずれかであり得る：ff9b :: / 96または組織に固有のネットワーク固有のプレフィックス。後者の場合のために、IPv6プレフィックス長は32、40、48、56、またはいずれの場合も64であってもよいで説明したように、このIPv6プレフィックスは、IPv4アドレスとIPv4埋め込みIPv6アドレス間のアドレス変換中に使用されます[RFC6052]。"
    },
    {
      "indent": 3,
      "text": "During translation from an IPv4 header to an IPv6 header at an ingress AFXLBR, the source IPv4 address and destination IPv4 address are translated into the corresponding source IPv6 address and destination IPv6 address, respectively. During translation from an IPv6 header to an IPv4 header at an egress AFXLBR, the source IPv6 address and destination IPv6 address are translated into the corresponding source IPv4 address and destination IPv4 address, respectively. Note that address translation is accomplished in a stateless manner.",
      "ja": "入口AFXLBRにおけるIPv6ヘッダのIPv4ヘッダからの変換時に、送信元IPv4アドレスと宛先IPv4アドレスは、それぞれ、対応するソースIPv6アドレスと宛先IPv6アドレスに変換されます。出口AFXLBRでIPv4ヘッダーにIPv6ヘッダからの変換時に、送信元IPv6アドレスと宛先IPv6アドレスは、それぞれ、対応するソースIPv4アドレスと宛先IPv4アドレスに変換されます。アドレス変換はステートレスな方法で達成されることに注意してください。"
    },
    {
      "indent": 3,
      "text": "When an IPv6 WKP is used, [RFC6052] allows only global IPv4 addresses to be embedded in the IPv6 address. An IPv6 address composed of a WKP and a non-global IPv4 address is hence invalid, and packets that contain such an address received by an AFXLBR are dropped.",
      "ja": "IPv6のWKPが使用される場合、[RFC6052]はグローバルなIPv4だけがIPv6アドレスに埋め込まれるアドレス可能。 WKP非グローバルIPv4アドレスで構成されるIPv6アドレスは、したがって無効であり、AFXLBRによって受信されたそのようなアドレスを含むパケットは廃棄されます。"
    },
    {
      "indent": 3,
      "text": "In the case where both the IPv4 client networks and the IPv6 transit network belong to the same organization, non-global IPv4 addresses may be used with a network-specific prefix [RFC6052].",
      "ja": "IPv4のクライアントネットワークとIPv6中継網の両方が同じ組織に属している場合には、非グローバルIPv4アドレスは、ネットワーク固有の接頭辞[RFC6052]と共に使用することができます。"
    },
    {
      "indent": 0,
      "text": "5. Advertising IPv4-Embedded IPv6 Routes",
      "section_title": true,
      "ja": "5.広告のIPv4-組み込みIPv6ルート"
    },
    {
      "indent": 3,
      "text": "In order to forward IPv4 packets to the proper destination across an IPv6 network, IPv4 reachability information needs to be disseminated throughout the IPv6 network. This is performed by AFXLBRs that connect to IPv4 client networks using OSPFv3.",
      "ja": "IPv6ネットワークを横切って適切な宛先にIPv4パケットを転送するために、IPv4の到達可能性情報は、IPv6ネットワーク全体に配布される必要があります。これは、OSPFv3のを使用したIPv4クライアントのネットワークに接続AFXLBRsによって行われます。"
    },
    {
      "indent": 3,
      "text": "With the scenario described in this document, i.e., a set of AFXLBRs that interconnect multiple IPv4 client networks with an IPv6 network, the IPv4 networks and IPv6 networks belong to the same or separate Autonomous Systems (ASs), and as such, these AFXLBRs behave as AS Boundary Routers (ASBRs).",
      "ja": "IPv6ネットワークと相互接続複数のIPv4クライアントネットワークAFXLBRsこの文書、すなわち、セットに説明したシナリオと、IPv4ネットワークとIPv6ネットワークは、同じまたは別個の自律システム（のAS）に属し、そのようなものとして、これらAFXLBRsは振る舞います境界ルータ（ASBRは）ASとして。"
    },
    {
      "indent": 0,
      "text": "5.1. Advertising IPv4-Embedded IPv6 Routes through an IPv6 Transit Network",
      "ja": "5.1.  IPv6のトランジットネットワークを介して広告のIPv4-組み込みIPv6ルート"
    },
    {
      "indent": 3,
      "text": "IPv4 addresses and prefixes in an IPv4 client network are translated into IPv4-embedded IPv6 addresses and prefixes, respectively, using the IPv6 prefix allocated by the operator and the method specified in [RFC6052]. These routes are then advertised by one or more attached ASBRs into the IPv6 transit network using AS-External-LSAs [RFC5340], i.e., with advertising scope comprising the entire Autonomous System.",
      "ja": "IPv4のクライアントネットワーク内のIPv4アドレスとプレフィックスは、オペレータと[RFC6052]に規定する方法によって割り当てられたIPv6プレフィックスを使用して、それぞれ、IPv4に埋め込まれたIPv6アドレスとプレフィックスに翻訳されます。これらのルートは、次に全体の自律システムを含む広告範囲で、すなわち、ASの外部のLSAの[RFC5340]を用いたIPv6中継網に一つ以上の添付のASBRによってアドバタイズされています。"
    },
    {
      "indent": 0,
      "text": "5.1.1. Routing Metrics",
      "section_title": true,
      "ja": "5.1.1. ルーティングメトリック"
    },
    {
      "indent": 3,
      "text": "By default, the metric in an AS-External-LSA that carries an IPv4- embedded IPv6 address or prefixes is a Type 1 external metric, which is comparable to the link state metric, and we assume that in most cases OSPFv2 is used in client IPv4 networks. This metric is added to the metric of the intra-AS path to the ASBR during the OSPFv3 route calculation. Through ASBR configuration, the metric can be set to a Type 2 external metric, which is considered much larger than the metric for any intra-AS path. Refer to the OSPFv3 specification [RFC5340] for more details. In either case, an external metric may take the same value as in an IPv4 network (using OSPFv2 or another routing protocol) but may also be specified based on some routing policy, the details of which are beyond the scope of this document.",
      "ja": "デフォルトでは、IPv4-埋め込まれたIPv6アドレスまたはプレフィックスを運ぶASの外部のLSAにおけるメトリックは、メトリックのリンク状態に匹敵するタイプ1外部メトリック、であり、我々は、ほとんどの場合、OSPFv2には、クライアントで使用されていることを前提としていIPv4ネットワーク。このメトリックは、OSPFv3のルート計算中ASBRにイントラASパスのメトリックに加算されます。 ASBRの構成により、メトリックは、任意のイントラASパスのメトリックよりもはるかに大きいと考えられるタイプ2外部メトリックに設定することができます。詳細については、OSPFv3の仕様[RFC5340]を参照してください。いずれの場合においても、外部メトリックは、（OSPFv2のまたは別のルーティングプロトコルを使用して）IPv4ネットワークと同じ値を取ることができるだけでなく、いくつかのルーティングポリシーに基づいて特定することができる、の詳細は、この文書の範囲を超えています。"
    },
    {
      "indent": 0,
      "text": "5.1.2. Forwarding Address",
      "section_title": true,
      "ja": "5.1.2. 転送先アドレス"
    },
    {
      "indent": 3,
      "text": "If the \"Forwarding Address\" field of an OSPFv3 AS-External-LSA is used to carry an IPv6 address, that address must also be an IPv4-embedded IPv6 address where the embedded IPv4 address is the destination address in an IPv4 client network. However, since an AFXLBR sits on the border of an IPv4 network and an IPv6 network, it is RECOMMENDED that the \"Forwarding Address\" field not be used, so that the AFXLBR can make the forwarding decision based on its own IPv4 routing table.",
      "ja": "OSPFv3のASの外部のLSAの「転送先アドレス」フィールドは、IPv6アドレスを運ぶために使用されている場合は、そのアドレスはまた、埋め込まれたIPv4アドレスがIPv4クライアントネットワーク内の宛先アドレスであるIPv4に埋め込まれたIPv6アドレスでなければなりません。 AFXLBRは、IPv4ネットワークとIPv6ネットワークの境界に座っているので、しかし、AFXLBRは、自身のIPv4ルーティングテーブルに基づいて転送決定を行うことができるように、「転送先アドレス」フィールドは、使用しないことをお勧めします。"
    },
    {
      "indent": 0,
      "text": "5.2. Advertising IPv4 Addresses into Client Networks",
      "section_title": true,
      "ja": "5.2. 広告のIPv4は、クライアントネットワークにアドレス"
    },
    {
      "indent": 3,
      "text": "IPv4-embedded IPv6 routes injected into the IPv6 network from one IPv4 client network MAY be advertised into another IPv4 client network after the associated destination addresses and prefixes are translated back to IPv4 addresses and prefixes, respectively. This operation is similar to normal OSPFv3 operation, wherein an AS-External-LSA can be advertised in a non-backbone area by default.",
      "ja": "関連する宛先アドレスとプレフィックスは、それぞれ、IPv4アドレスとプレフィックスに戻す翻訳された後に1つのIPv4クライアントネットワークからIPv6ネットワークに注入されたIPv4埋め込みIPv6ルートは、別のIPv4クライアントネットワークにアドバタイズされるかもしれません。この操作は、ASの外部のLSAは、デフォルトでは非バックボーンエリアでアドバタイズされることができる通常のOSPFv3の動作に似ています。"
    },
    {
      "indent": 3,
      "text": "An IPv4 client network can limit which advertisements it receives through configuration.",
      "ja": "IPv4のクライアントネットワークは、それが設定を通して受信する広告制限することができます。"
    },
    {
      "indent": 3,
      "text": "For the purpose of this document, IPv4-embedded IPv6 routes MUST NOT be advertised into any IPv6 client networks that are also connected to the IPv6 transit network.",
      "ja": "このドキュメントの目的のために、IPv4に埋め込まれたIPv6ルートものIPv6中継網に接続されているすべてのIPv6クライアントのネットワークに広告を出してはなりません。"
    },
    {
      "indent": 0,
      "text": "6. Aggregation on IPv4 Addresses and Prefixes",
      "section_title": true,
      "ja": "IPv4アドレスとプレフィックス6.集約"
    },
    {
      "indent": 3,
      "text": "In order to reduce the amount of Link State Advertisements (LSAs) that are injected into the IPv6 network, an implementation should provide mechanisms to aggregate IPv4 addresses and prefixes at an AFXLBR prior to advertisement as IPv4-embedded IPv6 addresses and prefixes. In general, the aggregation practice should be based on routing policy, which is beyond the scope of this document.",
      "ja": "IPv6ネットワークに注入されるリンクステートアドバタイズメント（LSA）の量を低減するために、実装は、IPv4埋め込みIPv6アドレスとプレフィクスのような従来の広告にAFXLBRでIPv4アドレスとプレフィックスを集約するためのメカニズムを提供しなければなりません。一般的に、凝集の練習は、この文書の範囲を超えてポリシーをルーティングに基づくべきです。"
    },
    {
      "indent": 0,
      "text": "7. Forwarding",
      "section_title": true,
      "ja": "7.転送"
    },
    {
      "indent": 3,
      "text": "There are three cases applicable to forwarding IP packets in the scenario described in this document:",
      "ja": "この文書で説明したシナリオでIPパケットを転送に適用される3つのケースがあります。"
    },
    {
      "indent": 3,
      "text": "1. On an AFXLBR, if an IPv4 packet is received on an interface connecting to an IPv4 segregated client network with a destination IPv4 address belonging to another IPv4 client network, the header of the packet is translated to the corresponding IPv6 header as described in Section 4, and the packet is then forwarded to the destination AFXLBR that advertised the IPv4-embedded IPv6 address into the IPv6 network.",
      "ja": "IPv4パケットは別のIPv4クライアントネットワークに属する宛先IPv4アドレスとIPv4の分離クライアントネットワークに接続するインターフェイスで受信された場合のセクションで説明したようAFXLBR 1.は、パケットのヘッダは、対応するIPv6ヘッダに変換され図4に示すように、パケットは、次に、IPv6ネットワークにIPv4に埋め込まれたIPv6アドレスをアドバタイズ先AFXLBRに転送されます。"
    },
    {
      "indent": 3,
      "text": "2. On an AFXLBR, if an IPv4-embedded IPv6 packet is received and the embedded destination IPv4 address is in its IPv4 routing table, the header of the packet is translated to the corresponding IPv4 header as described in Section 4, and the packet is then forwarded accordingly.",
      "ja": "IPv4に埋め込まれたIPv6パケットが受信され、埋め込まれた宛先IPv4アドレスがIPv4ルーティングテーブルにある場合、セクション4で説明したようにAFXLBR 2.は、パケットのヘッダは、対応するIPv4ヘッダーに変換され、そしてパケットでありますそれに応じて転送されます。"
    },
    {
      "indent": 3,
      "text": "3. On any router that is within the IPv4-embedded IPv6 topology subset of the IPv6 network, if an IPv4-embedded IPv6 packet is received and a route is found in the IPv4-embedded IPv6 routing table, the packet is forwarded to the IPv6 next hop, just like the handling for a normal IPv6 packet, without any translation.",
      "ja": "IPv4に埋め込まれたIPv6パケットが受信された経路は、IPv4埋め込みIPv6ルーティングテーブル内に見つかった場合、IPv6ネットワークのIPv4に埋め込まれたIPv6トポロジサブセット内である任意のルータ3.は、パケットは、IPv6に転送されますただの翻訳せずに通常のIPv6パケットの処理、などのネクストホップ、。"
    },
    {
      "indent": 3,
      "text": "The classification of an IPv4-embedded IPv6 packet is done according to the IPv6 prefix of the destination address, which is either the WKP (i.e., 64:ff9b::/96) or locally allocated as defined in [RFC6052].",
      "ja": "ローカルまたは[RFC6052]で定義されるように割り当てられた：IPv4に埋め込まれたIPv6パケットの分類はWKP（ff9b :: / 96、すなわち、64）のいずれかである宛先アドレスのIPv6プレフィックスに従って行われます。"
    },
    {
      "indent": 0,
      "text": "8. Backdoor Connections",
      "section_title": true,
      "ja": "8.バックドア接続"
    },
    {
      "indent": 3,
      "text": "In some deployments, IPv4 client networks are interconnected across the IPv6 network but are also directly connected to each other. The direct connections between IPv4 client networks, sometimes called \"backdoor\" connections, can certainly be used to transport IPv4 packets between IPv4 client networks. In general, backdoor connections are preferred over the IPv6 network, since no address family translation is required.",
      "ja": "いくつかの展開では、IPv4のクライアント・ネットワークは、IPv6ネットワークを介して相互に接続されているだけでなく、相互に直接接続されています。時には「バックドア」と呼ばれる接続のIPv4クライアントネットワーク間の直接接続は、確かにIPv4のクライアントのネットワーク間でIPv4パケットを転送するために使用することができます。アドレスファミリの翻訳が必要とされないので、一般的には、バックドアの接続は、IPv6ネットワーク上で好ましいです。"
    },
    {
      "indent": 0,
      "text": "9. Prevention of Loops",
      "section_title": true,
      "ja": "ループの9.予防"
    },
    {
      "indent": 3,
      "text": "If an LSA sent from an AFXLBR into a client network could then be received by another AFXLBR, it would be possible for routing loops to occur. To prevent loops, an AFXLBR MUST set the DN bit [RFC4576] in any LSA that it sends to a client network. The AFXLBR MUST also ignore any LSA received from a client network that already has the DN bit set.",
      "ja": "クライアントネットワークにAFXLBRから送信されたLSAは、別AFXLBRによって受信することができればルーティングが発生するループのために、それは可能であろう。ループを防止するために、AFXLBRは、クライアントのネットワークに送信する任意のLSAにDNビット[RFC4576]を設定しなければなりません。 AFXLBRもすでにDNビットが設定されているクライアントのネットワークから受信したすべてのLSAを無視しなければなりません。"
    },
    {
      "indent": 0,
      "text": "10. MTU Issues",
      "section_title": true,
      "ja": "10. MTUの問題"
    },
    {
      "indent": 3,
      "text": "In the IPv6 network, there are no new MTU issues introduced by this document. If a separate OSPFv3 instance (per [RFC5838]) is used for IPv4-embedded IPv6 routing, the MTU handling in the IPv6 network is the same as that of the default OSPFv3 instance.",
      "ja": "IPv6ネットワークでは、この文書により導入された新しいMTUの問題はありません。別OSPFv3インスタンス（[RFC5838]あたり）はIPv4の埋め込みIPv6ルーティングに使用される場合、IPv6ネットワークにおけるMTU処理はデフォルトOSPFv3インスタンスと同じです。"
    },
    {
      "indent": 3,
      "text": "However, the MTU in the IPv6 network may be different than that of IPv4 client networks. Since an IPv6 router will never fragment a packet, the packet size of any IPv4-embedded IPv6 packet entering the IPv6 network must be equal to or less than the MTU of the IPv6 network. In order to achieve this requirement, it is recommended that AFXLBRs perform IPv6 path discovery among themselves. The resulting MTU, after taking into account the difference between the IPv4 header length and the IPv6 header length, must be \"propagated\" into IPv4 client networks, e.g., included in the OSPFv2 Database Description packet.",
      "ja": "しかし、IPv6ネットワークでのMTUは、IPv4クライアントネットワークのものとは異なる場合があります。 IPv6ルータは、パケットをフラグメント化することはありませんので、IPv6ネットワークに入る任意のIPv4埋め込みIPv6パケットのパケットサイズに等しいか、IPv6ネットワークのMTUよりも小さくなければなりません。この要件を達成するためには、AFXLBRsが自分たちの中でのIPv6の経路探索を実行することをお勧めします。得られたMTUは、アカウントにIPv4ヘッダ長とIPv6ヘッダ長との差を取った後、IPv4のクライアント・ネットワークに、例えば、OSPFv2のDatabase記述パケットに含まれる「伝播」されなければなりません。"
    },
    {
      "indent": 3,
      "text": "The details of passing the proper MTU into IPv4 client networks are beyond the scope of this document.",
      "ja": "IPv4のクライアントのネットワークに適切なMTUを渡すの詳細は、このドキュメントの範囲を超えています。"
    },
    {
      "indent": 0,
      "text": "11. Security Considerations",
      "section_title": true,
      "ja": "11.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "There are several security aspects that require attention in the deployment practices described in this document.",
      "ja": "このドキュメントで説明する展開の実践に注意が必要ないくつかのセキュリティの側面があります。"
    },
    {
      "indent": 3,
      "text": "In the OSPFv3 transit network, the security considerations for OSPFv3 are handled as usual, and in particular, authentication mechanisms described in [RFC6506] can be deployed.",
      "ja": "OSPFv3のトランジットネットワークでは、OSPFv3のためのセキュリティ問題は、通常のように処理され、特に、[RFC6506]に記載の認証メカニズムを展開することができます。"
    },
    {
      "indent": 3,
      "text": "When a separate OSPFv3 instance is used to support IPv4-embedded IPv6 routing, the same Security Association (SA) [RFC4552] MUST be used by the embedded IPv4 address instance as other instances utilizing the same link, as specified in [RFC5838].",
      "ja": "別のOSPFv3インスタンスはIPv4の埋め込みIPv6ルーティングをサポートするために使用される場合、同じセキュリティアソシエーション（SA）[RFC4552]は[RFC5838]で指定されるように、同一のリンクを利用して他のインスタンスとして埋め込まれたIPv4アドレスのインスタンスによって使用されなければなりません。"
    },
    {
      "indent": 3,
      "text": "Security considerations as documented in [RFC6052] must also be thought through and properly implemented, including the following:",
      "ja": "[RFC6052]に記載されているように、セキュリティ上の考慮事項もを通じて考えることが、適切に、以下を含む、実装する必要があります。"
    },
    {
      "indent": 3,
      "text": "o The IPv6 prefix that is used to carry an embedded IPv4 address (refer to Section 4.1) must be configured by the authorized operator on all participating AFXLBRs in a secure manner. This is to help prevent a malicious attack resulting in network disruption, denial of service, and possible information disclosure.",
      "ja": "埋め込まれたIPv4アドレスを運ぶために使用されているIPv6プレフィックスO（4.1節を参照）安全な方法ですべての参加AFXLBRsに認可オペレータによって設定されなければなりません。これは、ネットワークの中断、サービス拒否、および可能な情報開示をもたらし、悪意のある攻撃を防ぐためです。"
    },
    {
      "indent": 3,
      "text": "o Effective mechanisms (such as reverse path checking) must be implemented in the IPv6 transit network (including AFXLBRs) to prevent spoofing of embedded IPv4 addresses, which otherwise might be used as source addresses of malicious packets.",
      "ja": "O（例えば、チェックリバースパスとして）効果的なメカニズムは、そうでなければ、悪意のあるパケットの送信元アドレスとして使用され得る埋め込みIPv4アドレスのスプーフィングを防止するために（AFXLBRs含む）のIPv6中継網で実現されなければなりません。"
    },
    {
      "indent": 3,
      "text": "o If firewalls are used in IPv4 and/or IPv6 networks, configuration of the routers must be consistent, so that there are no holes in IPv4 address filtering.",
      "ja": "ファイアウォールは、IPv4および/またはIPv6ネットワークで使用される場合、IPv4アドレスフィルタには穴が存在しないようにO、ルータの設定は、一貫していなければなりません。"
    },
    {
      "indent": 3,
      "text": "The details of security handling are beyond the scope of this document.",
      "ja": "セキュリティの取り扱いの詳細は、このドキュメントの範囲を超えています。"
    },
    {
      "indent": 0,
      "text": "12. Operational Considerations",
      "section_title": true,
      "ja": "12.運用に関する注意事項"
    },
    {
      "indent": 3,
      "text": "This document puts together some mechanisms based on existing technologies developed by the IETF as an integrated solution to transport IPv4 packets over an IPv6 network using a separate OSPFv3 routing table. There are several aspects of these mechanisms that require attention for deployment and operation.",
      "ja": "この文書では、別個のOSPFv3ルーティングテーブルを使用して、IPv6ネットワーク上にIPv4パケットを転送する統合ソリューションとしてIETFによって開発された既存の技術に基づいて、いくつかのメカニズムを一緒に置きます。展開と運用のために注意が必要なこれらのメカニズムのいくつかの側面があります。"
    },
    {
      "indent": 3,
      "text": "The tunnel-based solution documented in [RFC5565] and the solution proposed in this document are both used for transporting IPv4 packets over an IPv6 network, using different mechanisms. The two methods are not related to each other, and they can coexist in the same network if so deployed, without any conflict.",
      "ja": "[RFC5565]に記載のトンネルベースの溶液およびこの文書で提案された解決策は、両方の異なるメカニズムを使用して、IPv6ネットワーク上にIPv4パケットを転送するために使用されます。二つの方法は、互いに関連していない、そのため展開されている場合、それらは矛盾することなく、同一のネットワーク内に共存することができます。"
    },
    {
      "indent": 3,
      "text": "If one approach is to be deployed, the operator will decide which approach to use. Note that each approach has its own characteristics and requirements. For example, the tunnel-based solution requires a mesh of inter-AFBR softwires (tunnels) spanning the IPv6 network, as well as IBGP to exchange routes between AFBRs [RFC5565]; the approach in this document requires AFXLBRs that are capable of performing IPv4-IPv6 packet header translation per [RFC6145].",
      "ja": "一つのアプローチが展開される場合は、オペレータが使用するために接近するかを決定します。それぞれのアプローチは独自の特性と要件を持っていることに注意してください。例えば、トンネルベースのソリューションはAFBRs [RFC5565]の間でルートを交換する間AFBRのIPv6ネットワークにまたがるsoftwires（トンネル）、ならびにIBGPのメッシュを必要とします。この文書に記載されているアプローチは、[RFC6145]あたりのIPv4-IPv6のパケットヘッダの変換を実行することが可能であるAFXLBRsを必要とします。"
    },
    {
      "indent": 3,
      "text": "To deploy the solution as documented here, some configurations are required. An IPv6 prefix must first be chosen that is used to form all the IPv4-embedded IPv6 addresses and prefixes advertised by AFXLBRs in the IPv6 network; refer to Section 4.1 for details. The IPv4-embedded IPv6 routing table is created by using a separate OSPFv3 instance in the IPv6 network. As described in Section 3.2, this configuration is accomplished according to the mechanism described in [RFC5838].",
      "ja": "ここに記載されているようにソリューションを展開するには、いくつかの構成が必要とされています。 IPv6プレフィックスは、第IPv6ネットワークにおけるAFXLBRsによってアドバタイズすべてのIPv4埋め込みIPv6アドレスとプレフィックスを形成するために使用される選択されなければなりません。詳細については、セクション4.1を参照してください。 IPv4の埋め込みIPv6ルーティングテーブルは、IPv6ネットワークにおける別のOSPFv3インスタンスを使用して作成されます。セクション3.2で説明したように、この構成は、[RFC5838]に記載の機構に従って達成されます。"
    },
    {
      "indent": 3,
      "text": "Note that this document does not change any behavior of OSPFv3, and the existing or common practice should apply in the context of scalability. For example, the amount of routes that are advertised by OSPFv3 is one key concern. With the solution as described in this document, IPv4-embedded IPv6 addresses and prefixes will be injected by AFXLBRs into some part of the IPv6 network (see Section 3.1 for details), and a separate routing table will be used for IPv4-embedded IPv6 routing. Care must be taken during network design such that 1) aggregations are performed on IPv4 addresses and prefixes before being advertised in the IPv6 network as described in Section 6, and 2) estimates are made as to the amount of IPv4-embedded IPv6 routes that would be disseminated in the IPv6 network and to the size of the separate OSPFv3 routing table.",
      "ja": "このドキュメントは、OSPFv3の任意の動作を変更せず、既存または一般的な方法は、スケーラビリティの文脈に適用されるべきであることに注意してください。例えば、のOSPFv3によってアドバタイズされたルートの量は、一つのキー懸念されます。この文書に記載されているように溶液を用いて、IPv4に埋め込まれたIPv6アドレスとプレフィックスは（詳細はセクション3.1を参照）IPv6ネットワークの一部にAFXLBRsによって注入され、別個のルーティングテーブルは、IPv4埋め込みIPv6ルーティングに使用されます。ケアはセクション6に記載されているような、1）集計は、IPv6ネットワークにアドバタイズされる前に、IPv4アドレスとプレフィックスで実行されるネットワーク設計時に注意しなければならない、及び2）の推定値は、IPv4埋め込みIPv6ルートの量がなされていることだろうIPv6ネットワークおよび別個のOSPFv3ルーティングテーブルのサイズに配布すること。"
    },
    {
      "indent": 0,
      "text": "13. Acknowledgements",
      "section_title": true,
      "ja": "13.謝辞"
    },
    {
      "indent": 3,
      "text": "Many thanks to Acee Lindem, Dan Wing, Joel Halpern, Mike Shand, and Brian Carpenter for their comments.",
      "ja": "彼らのコメントのためのACEE Lindem、ダン・ウィング、ジョエル・ハルパーン、マイク・シャンド、そしてブライアン・カーペンターに感謝します。"
    },
    {
      "indent": 0,
      "text": "14. References",
      "section_title": true,
      "ja": "14.参考文献"
    },
    {
      "indent": 0,
      "text": "14.1. Normative References",
      "section_title": true,
      "ja": "14.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC4576] Rosen, E., Psenak, P., and P. Pillay-Esnault, \"Using a Link State Advertisement (LSA) Options Bit to Prevent Looping in BGP/MPLS IP Virtual Private Networks (VPNs)\", RFC 4576, June 2006.",
      "ja": "[RFC4576]ローゼン、E.、Psenak、P.、およびP. Pillay-Esnault、RFC 4576、 \"BGP / MPLS IP仮想プライベートネットワーク（VPN）でループを防止するためにリンクステートアドバタイズメント（LSA）オプションビットを使用します\" 2006年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC5565] Wu, J., Cui, Y., Metz, C., and E. Rosen, \"Softwire Mesh Framework\", RFC 5565, June 2009.",
      "ja": "[RFC5565]呉、J.、キュイ、Y.、メス、C.、およびE.ローゼン、 \"Softwireメッシュフレームワーク\"、RFC 5565、2009年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC5838] Lindem, A., Mirtorabi, S., Roy, A., Barnes, M., and R. Aggarwal, \"Support of Address Families in OSPFv3\", RFC 5838, April 2010.",
      "ja": "[RFC5838] Lindem、A.、Mirtorabi、S.、ロイ、A.、バーンズ、M.、およびR.アガルワル、RFC 5838、2010年4月 \"のOSPFv3におけるアドレスファミリのサポート\"。"
    },
    {
      "indent": 3,
      "text": "[RFC6145] Li, X., Bao, C., and F. Baker, \"IP/ICMP Translation Algorithm\", RFC 6145, April 2011.",
      "ja": "[RFC6145]のLi、X.、バオ、C.、およびF.ベイカー、 \"IP / ICMP翻訳アルゴリズム\"、RFC 6145、2011年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC6969] Retana, A. and D. Cheng, \"OSPFv3 Instance ID Registry Update\", RFC 6969, July 2013.",
      "ja": "[RFC6969] Retana、A.とD.チェン、 \"OSPFv3のインスタンスIDレジストリの更新\"、RFC 6969、2013年7月。"
    },
    {
      "indent": 0,
      "text": "14.2. Informative References",
      "section_title": true,
      "ja": "14.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC4552] Gupta, M. and N. Melam, \"Authentication/Confidentiality for OSPFv3\", RFC 4552, June 2006.",
      "ja": "[RFC4552]グプタ、M.およびN.メラム、 \"OSPFv3のための認証/機密性\"、RFC 4552、2006年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC5340] Coltun, R., Ferguson, D., Moy, J., and A. Lindem, \"OSPF for IPv6\", RFC 5340, July 2008.",
      "ja": "[RFC5340] Coltun、R.、ファーガソン、D.、モイ、J.、およびA. Lindem、 \"IPv6のためのOSPF\"、RFC 5340、2008年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC6052] Bao, C., Huitema, C., Bagnulo, M., Boucadair, M., and X. Li, \"IPv6 Addressing of IPv4/IPv6 Translators\", RFC 6052, October 2010.",
      "ja": "[RFC6052]バオ、C.、のHuitema、C.、Bagnulo、M.、Boucadair、M.、およびX.李、RFC 6052、2010年10月の \"IPv6は、IPv4 / IPv6の翻訳者のアドレス指定\"。"
    },
    {
      "indent": 3,
      "text": "[RFC6506] Bhatia, M., Manral, V., and A. Lindem, \"Supporting Authentication Trailer for OSPFv3\", RFC 6506, February 2012.",
      "ja": "[RFC6506] Bhatiaは、M.、Manral、V.、およびA. Lindem、 \"OSPFv3のための認証トレーラーのサポート\"、RFC 6506、2012年2月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Dean Cheng Huawei Technologies 2330 Central Expressway Santa Clara, California 95050 USA",
      "ja": "ディーン・チェンHU A技術2330年、中央高速道路サンタクララ、カリフォルニア95050 USAへ"
    },
    {
      "indent": 3,
      "text": "EMail: dean.cheng@huawei.com",
      "ja": "メールアドレス：dean.cheng@huawei.com"
    },
    {
      "indent": 3,
      "text": "Mohamed Boucadair France Telecom Rennes, 35000 France",
      "ja": "モハメド・Boucadairフランステレコムレンヌ、フランス35000"
    },
    {
      "indent": 3,
      "text": "EMail: mohamed.boucadair@orange.com",
      "ja": "メールアドレス：mohamed.boucadair@orange.com"
    },
    {
      "indent": 3,
      "text": "Alvaro Retana Cisco Systems 7025 Kit Creek Rd. Research Triangle Park, North Carolina 27709 USA",
      "ja": "アルバロRetanaシスコシステムズ7025キットクリークRdを。リサーチトライアングルパーク、ノースカロライナ州27709 USA"
    },
    {
      "indent": 3,
      "text": "EMail: aretana@cisco.com",
      "ja": "メールアドレス：aretana@cisco.com"
    }
  ]
}