{
  "title": {
    "text": "RFC 6441 - Time to Remove Filters for Previously Unallocated IPv4 /8s",
    "ja": "RFC 6441 - 以前に割り当てられていないIPv4 /8Sのフィルターを削除する時間"
  },
  "number": 6441,
  "created_at": "2022-11-18 17:17:18.049369+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         L. Vegoda\nRequest for Comments: 6441                                         ICANN\nBCP: 171                                                   November 2011\nCategory: Best Current Practice\nISSN: 2070-1721",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 7,
      "text": "Time to Remove Filters for Previously Unallocated IPv4 /8s",
      "ja": "以前に割り当てられていないIPv4 /8Sのフィルターを削除する時間"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "It has been common for network administrators to filter IP traffic from and BGP prefixes of unallocated IPv4 address space. Now that there are no longer any unallocated IPv4 /8s, this practise is more complicated, fragile, and expensive. Network administrators are advised to remove filters based on the registration status of the address space.",
      "ja": "ネットワーク管理者は、未割り当てのIPv4アドレススペースからIPトラフィックとBGPプレフィックスをフィルタリングすることが一般的です。未割り当てのIPv4 /8Sがなくなったので、このプラクティスはより複雑で、壊れやすく、高価です。ネットワーク管理者は、アドレススペースの登録ステータスに基づいてフィルターを削除することをお勧めします。"
    },
    {
      "indent": 3,
      "text": "This document explains why any remaining packet and BGP prefix filters for unallocated IPv4 /8s should now be removed on border routers and documents those IPv4 unicast prefixes that should not be routed across the public Internet.",
      "ja": "このドキュメントでは、未配分のIPv4 /8Sの残りのパケットとBGPプレフィックスフィルターをボーダールーターで削除し、パブリックインターネットを介してルーティングしてはならないIPv4ユニキャストプレフィックスをドキュメントする理由を説明しています。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This memo documents an Internet Best Current Practice.",
      "ja": "このメモは、インターネットの最高の現在の練習を文書化しています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on BCPs is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントは、インターネットエンジニアリングタスクフォース（IETF）の製品です。IETFコミュニティのコンセンサスを表しています。公開レビューを受けており、インターネットエンジニアリングステアリンググループ（IESG）からの出版が承認されています。BCPの詳細については、RFC 5741のセクション2で入手できます。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6441.",
      "ja": "このドキュメントの現在のステータス、任意のERRATA、およびそのフィードバックを提供する方法に関する情報は、http：//www.rfc-editor.org/info/rfc6441で取得できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2011 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2011 IETF Trustおよび文書著者として特定された人。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must",
      "ja": "このドキュメントは、BCP 78およびIETFドキュメント（http://trustee.ietf.org/license-info）に関連するIETF Trustの法的規定の対象となります。この文書に関するあなたの権利と制限を説明するので、これらの文書を注意深く確認してください。このドキュメントから抽出されたコードコンポーネントは必須です"
    },
    {
      "indent": 3,
      "text": "include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "セクション4.Eで説明されている法的規定のセクション4.Eで説明されており、簡素化されたBSDライセンスに記載されている保証なしで提供される簡略化されたBSDライセンステキストを含めます。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . . . 2\n2.  Terminology . . . . . . . . . . . . . . . . . . . . . . . . . . 2\n3.  Traffic Filtering Options . . . . . . . . . . . . . . . . . . . 3\n  3.1.  No Longer Filtering Based on Address Registration\n        Status  . . . . . . . . . . . . . . . . . . . . . . . . . . 3\n  3.2.  Continuing to Filter Traffic from Unallocated IPv4\n        Space . . . . . . . . . . . . . . . . . . . . . . . . . . . 3\n4.  Prefixes That Should Not be Routed across the Internet  . . . . 3\n5.  Security Considerations . . . . . . . . . . . . . . . . . . . . 3\n6.  References  . . . . . . . . . . . . . . . . . . . . . . . . . . 4\n  6.1.  Normative References  . . . . . . . . . . . . . . . . . . . 4\n  6.2.  Informative References  . . . . . . . . . . . . . . . . . . 4\nAppendix A.  Acknowledgments  . . . . . . . . . . . . . . . . . . . 5",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "It has been common for network administrators to filter IP traffic from and BGP prefixes of unallocated IPv4 address space. Now that there are no longer any unallocated IPv4 /8s, this practise is more complicated, fragile, and expensive. Network administrators are advised to remove filters based on the registration status of the address space.",
      "ja": "ネットワーク管理者は、未割り当てのIPv4アドレススペースからIPトラフィックとBGPプレフィックスをフィルタリングすることが一般的です。未割り当てのIPv4 /8Sがなくなったので、このプラクティスはより複雑で、壊れやすく、高価です。ネットワーク管理者は、アドレススペースの登録ステータスに基づいてフィルターを削除することをお勧めします。"
    },
    {
      "indent": 3,
      "text": "This document explains why any remaining packet and BGP prefix filters for unallocated IPv4 /8s should now be removed on border routers and documents those IPv4 unicast prefixes that should not be routed across the public Internet.",
      "ja": "このドキュメントでは、未配分のIPv4 /8Sの残りのパケットとBGPプレフィックスフィルターをボーダールーターで削除し、パブリックインターネットを介してルーティングしてはならないIPv4ユニキャストプレフィックスをドキュメントする理由を説明しています。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "ja": "2. 用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14, RFC 2119 [RFC2119].",
      "ja": "「必須」、「そうしない」、「必須」、「必要」、「しない」、「そうしない」、「そうではない」、「そうでない」、「推奨」、「5月」、および「オプション」は、BCP 14、RFC 2119 [RFC2119]に記載されているように解釈される。"
    },
    {
      "indent": 3,
      "text": "Martians [RFC1208] is a humorous term applied to packets that turn up unexpectedly on the wrong network because of bogus routing entries. It is also used as a name for a packet that has an altogether bogus (non-registered or ill-formed) Internet address. Bogons [RFC3871] are packets sourced from addresses that have not yet been allocated",
      "ja": "Martians [RFC1208]は、偽のルーティングエントリのために間違ったネットワークで予期せずに現れるパケットに適用されるユーモラスな用語です。また、完全に偽物（登録されていないまたは不正な）インターネットアドレスを持つパケットの名前としても使用されます。ボゴン[RFC3871]は、まだ割り当てられていないアドレスから供給されたパケットです"
    },
    {
      "indent": 3,
      "text": "by IANA or the Regional Internet Registries (RIRs), or addresses reserved for private or special use by RFCs [RFC5735]. Bogons are referred to as \"Dark IP\" in some circles.",
      "ja": "IANAまたは地域のインターネットレジストリ（RIRS）、またはRFCS [RFC5735]によるプライベートまたは特別な使用のために予約されている住所。ボゴンは、一部の円で「暗いIP」と呼ばれます。"
    },
    {
      "indent": 0,
      "text": "3. Traffic Filtering Options",
      "section_title": true,
      "ja": "3. トラフィックフィルタリングオプション"
    },
    {
      "indent": 0,
      "text": "3.1. No Longer Filtering Based on Address Registration Status",
      "section_title": true,
      "ja": "3.1. アドレス登録ステータスに基づいてフィルタリングしなくなりました"
    },
    {
      "indent": 3,
      "text": "Network administrators who implemented filters for unallocated IPv4 /8s did so in the knowledge that those /8s were not a legitimate source of traffic on the Internet and that there was a small number of bogon filters to implement. Now that there are no longer any unallocated unicast IPv4 /8s, there will be legitimate Internet traffic coming from all unicast /8s that are not reserved for special purposes in an RFC.",
      "ja": "未割り当てのIPv4 /8のフィルターを実装したネットワーク管理者は、それらの /8がインターネット上の正当なトラフィックソースではなく、実装する少数のボゴンフィルターがあることを知ることでそうしました。Unocated Unicast IPv4 /8Sがなくなったので、RFCの特別な目的のために予約されていないすべてのユニキャスト /8から合法的なインターネットトラフィックが発生します。"
    },
    {
      "indent": 3,
      "text": "Removing packet and prefix filters based on the registration status of the IPv4 address is a simple approach that will avoid blocking legitimate Internet traffic. Network operators SHOULD remove both ingress and egress packet filters as well as BGP prefix filters for previously unallocated IPv4 /8s.",
      "ja": "IPv4アドレスの登録ステータスに基づいてパケットとプレフィックスフィルターの削除は、正当なインターネットトラフィックのブロックを避ける簡単なアプローチです。ネットワークオペレーターは、以前に割り当てられていないIPv4 /8SのBGPプレフィックスフィルターと同様に、Ingressパケットと出口の両方のパケットフィルターの両方を削除する必要があります。"
    },
    {
      "indent": 0,
      "text": "3.2. Continuing to Filter Traffic from Unallocated IPv4 Space",
      "section_title": true,
      "ja": "3.2. 未割り当てのIPv4スペースからのトラフィックのフィルタリングを継続します"
    },
    {
      "indent": 3,
      "text": "Some network administrators might want to continue filtering unallocated IPv4 addresses managed by the RIRs. This requires significantly more granular ingress filters and the highly dynamic nature of the RIRs' address pools means that filters need to be updated on a daily basis to avoid blocking legitimate incoming traffic.",
      "ja": "一部のネットワーク管理者は、RIRSによって管理されている未割り当てのIPv4アドレスのフィルタリングを続けたい場合があります。これには、より粒状の侵入フィルターが大幅に必要であり、RIRSのアドレスプールの非常に動的な性質は、合法的な着信トラフィックをブロックしないように、フィルターを毎日更新する必要があることを意味します。"
    },
    {
      "indent": 0,
      "text": "4. Prefixes That Should Not be Routed across the Internet",
      "section_title": true,
      "ja": "4. インターネットを介してルーティングしてはならないプレフィックス"
    },
    {
      "indent": 3,
      "text": "Network operators may deploy filters that block traffic destined for Martian prefixes. Currently, the Martian prefix table is defined by [RFC5735] which reserves each Martian prefix for some specific, special use. If the Martian prefix table ever changes, that change will be documented in an RFC that either updates or obsoletes [RFC5735].",
      "ja": "ネットワークオペレーターは、火星のプレフィックスに向けたトラフィックをブロックするフィルターを展開できます。現在、火星のプレフィックステーブルは[RFC5735]で定義されており、特定の特別な使用のために各火星のプレフィックスを予約しています。火星のプレフィックステーブルが変更された場合、その変更はRFCで文書化され、更新または廃止されます[RFC5735]。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "The cessation of filters based on unallocated IPv4 /8 allocations is an evolutionary step towards reasonable security filters. While these filters are no longer necessary, and in fact harmful, this does not obviate the need to continue other security solutions. These other solutions are as necessary today as they ever were.",
      "ja": "未配分のIPv4 /8割り当てに基づくフィルターの停止は、合理的なセキュリティフィルターへの進化的なステップです。これらのフィルターはもはや必要ではなく、実際には有害ですが、これは他のセキュリティソリューションを継続する必要性を明らかにしません。これらの他のソリューションは、今日と同じように必要です。"
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "ja": "6. 参考文献"
    },
    {
      "indent": 0,
      "text": "6.1. Normative References",
      "section_title": true,
      "ja": "6.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119] Bradner、S。、「要件レベルを示すためにRFCで使用するためのキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC5735] Cotton, M. and L. Vegoda, \"Special Use IPv4 Addresses\", BCP 153, RFC 5735, January 2010.",
      "ja": "[RFC5735] Cotton、M。およびL. Vegoda、「Special Use IPv4アドレス」、BCP 153、RFC 5735、2010年1月。"
    },
    {
      "indent": 0,
      "text": "6.2. Informative References",
      "section_title": true,
      "ja": "6.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[RFC1208] Jacobsen, O. and D. Lynch, \"Glossary of networking terms\", RFC 1208, March 1991.",
      "ja": "[RFC1208] Jacobsen、O。およびD. Lynch、「ネットワーキング用語の用語集」、RFC 1208、1991年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3871] Jones, G., \"Operational Security Requirements for Large Internet Service Provider (ISP) IP Network Infrastructure\", RFC 3871, September 2004.",
      "ja": "[RFC3871]ジョーンズ、G。、「大規模なインターネットサービスプロバイダー（ISP）IPネットワークインフラストラクチャの運用セキュリティ要件」、RFC 3871、2004年9月。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Acknowledgments",
      "section_title": true,
      "ja": "付録A. 謝辞"
    },
    {
      "indent": 3,
      "text": "Thanks are owed to Kim Davies, Terry Manderson, Dave Piscitello, and Joe Abley for helpful advice on how to focus this document. Thanks also go to Andy Davidson, Philip Smith, and Rob Thomas for early reviews and suggestions for improvements to the text, and to Carlos Pignataro for his support and comments.",
      "ja": "キム・デイビス、テリー・マンダーソン、デイブ・ピシテロ、ジョー・エイバイに、この文書に焦点を合わせる方法について有益なアドバイスに感謝します。また、テキストの改善のための早期のレビューと提案をしてくれたアンディ・デイビッドソン、フィリップ・スミス、ロブ・トーマス、そして彼のサポートとコメントについてカルロス・ピニャータロにも感謝します。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者の連絡先"
    },
    {
      "indent": 3,
      "text": "Leo Vegoda Internet Corporation for Assigned Names and Numbers 4676 Admiralty Way, Suite 330 Marina del Rey, CA 90292 United States of America",
      "ja": "割り当てられた名前と番号4676 Admiralty Way、Suite 330 Marina Del Rey、CA 90292アメリカ合衆国アメリカ"
    },
    {
      "indent": 3,
      "text": "Phone: +1-310-823-9358\nEMail: leo.vegoda@icann.org\nURI:   http://www.iana.org/",
      "raw": true,
      "ja": ""
    }
  ]
}