{
  "title": {
    "text": "RFC 6718 - Pseudowire Redundancy",
    "ja": "RFC 6718 - 擬似回線冗長性"
  },
  "number": 6718,
  "created_at": "2019-10-29 20:12:07.002460+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                          P. Muley\nRequest for Comments: 6718                                   M. Aissaoui\nCategory: Informational                                         M. Bocci\nISSN: 2070-1721                                           Alcatel-Lucent\n                                                             August 2012",
      "raw": true
    },
    {
      "indent": 25,
      "text": "Pseudowire Redundancy",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document describes a framework comprised of a number of scenarios and associated requirements for pseudowire (PW) redundancy. A set of redundant PWs is configured between provider edge (PE) nodes in single-segment PW applications or between terminating PE (T-PE) nodes in multi-segment PW applications. In order for the PE/T-PE nodes to indicate the preferred PW to use for forwarding PW packets to one another, a new PW status is required to indicate the preferential forwarding status of active or standby for each PW in the redundant set.",
      "ja": "この文書では、疑似回線（PW）冗長性のためのシナリオと関連する要件の数からなるフレームワークを記述する。冗長のPWのセットは、シングルセグメントPWアプリケーションまたはマルチセグメントPWアプリケーションでPE（T-PE）ノードを終端との間に、プロバイダエッジ（PE）ノード間で構成されています。互いにPWパケットを転送するために使用することが好ましいPWを示すPE / T-PEノードのために、新しいPWステータスは、冗長セット内の各PWのためにアクティブまたはスタンバイの優先転送状態を示すために必要とされます。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 IESGによって承認されていないすべての文書がインターネットStandardのどんなレベルの候補です。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6718.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6718で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2012 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2012 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n2. Terminology .....................................................4\n   2.1. Requirements Language ......................................6\n3. Reference Models ................................................6\n   3.1. PE Architecture ............................................6\n   3.2. PW Redundancy Network Reference Scenarios ..................7\n        3.2.1. PW Redundancy for AC and PE Protection: One\n               Dual-Homed CE with Redundant SS-PWs .................7\n        3.2.2. PW Redundancy for AC and PE Protection: Two\n               Dual-Homed CEs with Redundant SS-PWs ................8\n        3.2.3. PW Redundancy for S-PE Protection:\n               Single-Homed CEs with Redundant MS-PWs .............10\n        3.2.4. PW Redundancy for PE-rs Protection in\n               H-VPLS Using SS-PWs ................................11\n        3.2.5. PW Redundancy for PE Protection in a VPLS\n               Ring Using SS-PWs ..................................13\n        3.2.6. PW Redundancy for VPLS n-PE Protection\n               Using SS-PWs .......................................14\n4. Generic PW Redundancy Requirements .............................15\n   4.1. Protection Switching Requirements .........................15\n   4.2. Operational Requirements ..................................15\n5. Security Considerations ........................................16\n6. Contributors ...................................................16\n7. Acknowledgements ...............................................17\n8. References .....................................................17\n   8.1. Normative References ......................................17\n   8.2. Informative Reference .....................................18",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The objective of pseudowire (PW) redundancy is to maintain connectivity across the packet switched network (PSN) used by the emulated service if a component in the path of the emulated service fails or a backup component is activated. For example, PW redundancy will enable the correct PW to be used for forwarding emulated service packets when the connectivity of an attachment circuit (AC) changes due to the failure of an AC or when a pseudowire (PW) or packet switched network (PSN) tunnel fails due to the failure of a provider edge (PE) node.",
      "ja": "疑似回線（PW）冗長性の目的は、エミュレートされたサービスのパス内のコンポーネントに障害が発生したり、バックアップコンポーネントが起動された場合、パケットは、エミュレートされたサービスが使用するネットワーク（PSN）の切り替えを横切って接続を維持することです。アタッチメント回路（AC）の接続は、ACの故障時や疑似回線（PW）又はパケット交換ネットワーク（PSN）に起因する変化した場合、例えば、PW冗長性は、転送エミュレートされたサービス・パケットに使用されるべき正しいPWを可能にしますトンネル起因プロバイダエッジ（PE）ノードの故障に失敗します。"
    },
    {
      "indent": 3,
      "text": "PW redundancy uses redundant ACs, PEs, and PWs to eliminate single points of failure in the path of an emulated service. This is achieved while ensuring that only one path between a pair of customer edge (CE) nodes is active at any given time. Mechanisms that rely on more than one active path between the CEs, e.g., 1+1 protection switching, are out of the scope of this document because they may require a permanent bridge to provide traffic replication as well as support for a 1+1 protection switching protocol in the CEs.",
      "ja": "PW冗長性は、エミュレートされたサービスの経路内の単一障害点を排除するために、冗長ACS、のPE、およびPWを使用します。これは、顧客エッジ（CE）ノードの対の間の唯一のパスが任意の時点でアクティブであることを確保しながら達成されます。彼らは、トラフィックの複製だけでなく、1 + 1保護のためのサポートを提供するために、永久橋が必要な場合がありますのでCE間に複数のアクティブパスに依存しているメカニズム、例えば、1つの+ 1保護スイッチングは、この文書の範囲外でありますCEでプロトコルを切り替えます。"
    },
    {
      "indent": 3,
      "text": "Protection for a PW segment can be provided by the PSN layer. This may be a Resource Reservation Protocol with Traffic Engineering (RSVP-TE) label switched path (LSP) with a fast-reroute (FRR) backup or an end-to-end backup LSP. These mechanisms can restore PSN connectivity rapidly enough to avoid triggering protection by PW redundancy. PSN protection mechanisms cannot protect against the failure of a PE node or the failure of the remote AC. Typically, this is supported by dual-homing a CE node to different PE nodes that provide a pseudowire emulated service across the PSN. A set of PW mechanisms that enables a primary and one or more backup PWs to terminate on different PE nodes is therefore required. An important requirement is that changes occurring on the dual-homed side of the network due to the failure of an AC or PE are not propagated to the ACs on the other side of the network. Furthermore, failures in the PSN are not propagated to the attached CEs.",
      "ja": "PWセグメントの保護はPSNの層によって提供することができます。これは、トラフィックエンジニアリングとリソース予約プロトコルかもしれ（RSVP-TE）ラベルは、高速再ルーティング（FRR）バックアップまたはエンドツーエンドのバックアップLSPとパス（LSP）を切り替えます。これらのメカニズムはPW冗長性によって保護をトリガーする避けるために、急速に十分なPSNの接続を復元することができます。 PSN保護メカニズムは、PEノードの障害やリモートACの故障から保護することができません。典型的には、これは、PSNを横切る疑似回線エミュレートされたサービスを提供する異なるPEノードにデュアルホーミングCEノードによってサポートされています。異なるPEノードで終端する一次および1つまたは複数のバックアップのPWを可能PW機構のセットは、従って、必要とされます。重要な要件は起因ACまたはPEの故障に対するネットワークのデュアルホーム側で発生する変更は、ネットワークの反対側にACSに伝播されないことです。さらに、PSNの障害は、添付のCEに伝播されません。"
    },
    {
      "indent": 3,
      "text": "In cases where PSN protection mechanisms are not able to recover from a PSN failure or where a failure of a switching PE (S-PE) may occur, a set of mechanisms that supports the operation of a primary and one or more backup PWs via a different set of S-PEs or diverse PSN tunnels is therefore required. For multi-segment PWs (MS-PWs), the paths of these PWs are diverse in that they are switched at different S-PE nodes.",
      "ja": "PSN保護メカニズムは、PSN障害またはここ切り替えPE（S-PE）の故障が発生する可能性を介して一次および1つまたは複数のバックアップのPWの動作をサポートするメカニズムのセットから回復することができない場合にはS-PES又は多様PSNトンネルの異なるセットは、したがって必要とされます。マルチセグメントのPW（MS-のPW）のために、これらのPWのパスは、異なるS-PEノードに切り替えられるという点で多様です。"
    },
    {
      "indent": 3,
      "text": "In both of these cases, PW redundancy is important to maximize the resiliency of the emulated service. It supplements PSN protection techniques and can operate in addition to or instead of those techniques when they are not available.",
      "ja": "いずれの場合も、PWの冗長性は、エミュレートサービスの弾力性を最大にすることが重要です。これは、PSNの保護技術を補完し、それらが利用できないときにまたはその代わりにこれらの技術のほかに作動することができます。"
    },
    {
      "indent": 3,
      "text": "This document describes a framework for these applications and associated operational requirements. The framework utilizes a new PW status, called the 'Preferential Forwarding Status' of the PW. This is separate from the operational states defined in RFC 5601 [RFC5601]. The mechanisms for PW redundancy are modeled on general protection switching principles.",
      "ja": "この文書では、これらのアプリケーションと関連する業務要件のためのフレームワークについて説明します。フレームワークは、PWの「優先転送ステータス」と呼ばれる新しいPWの状態を、利用しています。これは、RFC 5601 [RFC5601]で定義された動作状態から分離されています。 PW冗長性のためのメカニズムは、一般的な保護スイッチングの原則に基づいてモデル化されています。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "ja": "2.用語"
    },
    {
      "indent": 3,
      "text": "o Up PW: A PW that has been configured (label mapping exchanged between PEs) and is not in any of the PW or AC defect states represented by the status codes specified in [RFC4446]. Such a PW is available for forwarding traffic.",
      "ja": "OアップPW：構成されているPWは、（ラベルマッピングは、PE間で交換）と[RFC4446]で指定されたステータスコードによって表さPW又はAC欠陥状態のいずれかではありません。このようなPWは、トラフィックを転送するために利用可能です。"
    },
    {
      "indent": 3,
      "text": "o Down PW: A PW that either has not been fully configured or has been configured and is in any one of the PW or AC defect states specified in [RFC4446]. Such a PW is not available for forwarding traffic.",
      "ja": "OダウンPW：PW完全に構成されていないか、設定されていると[RFC4446]で指定されたPW又はAC欠陥状態のいずれにあるのいずれかです。このようなPWがトラフィックの転送には使用できません。"
    },
    {
      "indent": 3,
      "text": "o Active PW: An up PW used for forwarding Operations, Administration, and Maintenance (OAM) as well as user-plane and control-plane traffic.",
      "ja": "OアクティブPW：アップPWは運用、管理、および保守（OAM）と同様に、ユーザプレーンとコントロールプレーントラフィックを転送するために使用しました。"
    },
    {
      "indent": 3,
      "text": "o Standby PW: An up PW that is not used for forwarding user traffic but may forward OAM and specific control-plane traffic.",
      "ja": "OスタンバイPW：アップPWユーザトラフィックを転送するために使用されず、OAM及び特定の制御プレーントラフィックを転送してもよいです。"
    },
    {
      "indent": 3,
      "text": "o PW Endpoint: A PE where a PW terminates on a point where native service processing is performed, e.g., a single-segment PW (SS-PW) PE, a multi-segment pseudowire (MS-PW) terminating PE (T-PE), or a hierarchical Virtual Private LAN Service (VPLS) MTU-s or PE-rs.",
      "ja": "O PWエンドポイント：PWは、ネイティブサービス処理が実行される点で終端PE、例えば、シングルセグメントPW（SS-PW）PE、PE（T-PEを終了マルチセグメント疑似ワイヤ（MS-PW） ）、または階層的な仮想プライベートLANサービス（VPLS）MTU-SまたはPE-RS。"
    },
    {
      "indent": 3,
      "text": "o Primary PW: The PW that a PW endpoint activates (i.e., uses for forwarding) in preference to any other PW when more than one PW qualifies for the active state. When the primary PW comes back up after a failure and qualifies for the active state, the PW endpoint always reverts to it. The designation of primary is performed by local configuration for the PW at the PE and is only required when revertive behavior is used and is not applicable when non-revertive protection switching is used.",
      "ja": "OプライマリPW：複数のPWがアクティブ状態に適格場合PWエンドポイントは、他のPWに優先して（すなわち、転送するために使用する）を活性化することPW。主PWは、障害発生後に戻って来ると、アクティブ状態の資格とき、PWエンドポイントは、常にそれに戻ります。一次の指定はPEでPWのローカル構成によって実行され、復元動作が使用され、非復帰保護スイッチングを使用する場合も適用可能ではない場合にのみ必要とされます。"
    },
    {
      "indent": 3,
      "text": "o Secondary PW: When it qualifies for the active state, a secondary PW is only selected if no primary PW is configured or if the configured primary PW does not qualify for active state (e.g., is down). By default, a PW in a redundancy PW set is considered secondary. There is no revertive mechanism among secondary PWs.",
      "ja": "OセカンダリPW：それはアクティブ状態に適格NOの場合、プライマリPWが設定されていない場合、セカンダリPWのみが選択されているか、構成されたプライマリPWがアクティブ状態の要件を満たさない場合（例えば、ダウンしています）。デフォルトでは、冗長PWのセットでPWは二次とみなされます。二次PWの間には復帰メカニズムはありません。"
    },
    {
      "indent": 3,
      "text": "o Revertive protection switching: Traffic will be carried by the primary PW if all of the following is true: it is up, a wait-to-restore timer expires, and the primary PW is made the active PW.",
      "ja": "復元待ちタイマーが満了し、それがアップされ、プライマリPWがアクティブPW行われますティブ保護スイッチングO：以下のすべてが真である場合、トラフィックは、プライマリPWで運ばれます。"
    },
    {
      "indent": 3,
      "text": "o Non-revertive protection switching: Traffic will be carried by the last PW selected as a result of a previous active PW entering the operationally down state.",
      "ja": "O非リバーティブ保護スイッチング：トラフィックが動作上のダウン状態に入る前のアクティブPWの結果として最後に選択したPWで運ばれます。"
    },
    {
      "indent": 3,
      "text": "o Manual selection of a PW: The ability to manually select the primary/secondary PWs.",
      "ja": "PWのO手動選択：手動でプライマリ/セカンダリのPWを選択する能力。"
    },
    {
      "indent": 3,
      "text": "o MTU-s: A hierarchical virtual private LAN service multi-tenant unit switch, as defined in RFC 4762 [RFC4762].",
      "ja": "O MTU-S：階層的な仮想プライベートLANサービス、マルチテナントユニットスイッチ、RFC 4762 [RFC4762]で定義されます。"
    },
    {
      "indent": 3,
      "text": "o PE-rs: A hierarchical virtual private LAN service switch, as defined in RFC 4762.",
      "ja": "O PE-RS：階層的な仮想プライベートLANサービススイッチ、RFC 4762で定義されています。"
    },
    {
      "indent": 3,
      "text": "o n-PE: A network-facing provider edge node, as defined in RFC 4026 [RFC4026].",
      "ja": "N-PE O：ネットワーク側プロバイダエッジノード、RFC 4026 [RFC4026]で定義されます。"
    },
    {
      "indent": 3,
      "text": "o 1:1 protection: One specific subset of a path for an emulated service, consisting of a standby PW and/or AC, protects another specific subset of a path for the emulated service. User traffic is transmitted over only one specific subset of the path at a time.",
      "ja": "O 1：1保護：エミュレートされたサービスのための経路の一つの特定のサブセット、スタンバイPW及び/又はACから成るは、エミュレートされたサービスのための経路の別の特定のサブセットを保護します。ユーザトラフィックは、一度にパスの1つの特定のサブセットを介して送信されます。"
    },
    {
      "indent": 3,
      "text": "o N:1 protection: N specific subsets of paths for an emulated service, consisting of standby PWs and/or ACs, protect another specific subset of the path for the emulated service. User traffic is transmitted over only one specific subset of the path at a time.",
      "ja": "O N：1保護：NスタンバイのPWおよび/またはACSからなるエミュレートされたサービスのための経路の特定のサブセットは、エミュレートされたサービスのための経路の別の特定のサブセットを保護します。ユーザトラフィックは、一度にパスの1つの特定のサブセットを介して送信されます。"
    },
    {
      "indent": 3,
      "text": "o 1+1 protection: One specific subset of a path for an emulated service, consisting of a standby PW and/or AC, protects another specific subset of a path for the emulated service. Traffic is permanently duplicated at the ingress node on both the currently active and standby subsets of the paths.",
      "ja": "O 1 + 1保護：エミュレートされたサービスのための経路の一つの特定のサブセット、スタンバイPW及び/又はACから成るは、エミュレートされたサービスのための経路の別の特定のサブセットを保護します。トラフィックは、恒久的にパスの現在アクティブ及びスタンバイサブセットの両方に入口ノードで複製されます。"
    },
    {
      "indent": 3,
      "text": "This document uses the term 'PE' to be synonymous with both PEs as per RFC 3985 [RFC3985] and T-PEs as per RFC 5659 [RFC5659].",
      "ja": "この文書では、用語 'PE' は、RFC 5659 [RFC5659]に従ってRFC 3985 [RFC3985]及びT-PESに従って両方のPEと同義であることに使用します。"
    },
    {
      "indent": 3,
      "text": "This document uses the term 'PW' to be synonymous with both PWs as per RFC 3985 and SS-PWs, MS-PWs, and PW segments as per RFC 5659.",
      "ja": "この文書は、RFC 5659に従ってRFC 3985あたりとしてのPWおよびSS-のPW、MS-のPW、およびPWセグメントの両方と同義であることが用語「PW」を使用します。"
    },
    {
      "indent": 0,
      "text": "2.1. Requirements Language",
      "section_title": true,
      "ja": "2.1. 要件言語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "ja": "この文書のキーワード \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", および \"OPTIONAL\" はRFC 2119 [RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "3. Reference Models",
      "section_title": true,
      "ja": "3.参照モデル"
    },
    {
      "indent": 3,
      "text": "The following sections show the reference architecture of the PE for PW redundancy and the usage of the architecture in different topologies and applications.",
      "ja": "以下のセクションでは、PW冗長性のためのPEの参照アーキテクチャと異なるトポロジとアプリケーションにおけるアーキテクチャの使用を示しています。"
    },
    {
      "indent": 0,
      "text": "3.1. PE Architecture",
      "section_title": true,
      "ja": "3.1.  PEのアーキテクチャ"
    },
    {
      "indent": 3,
      "text": "Figure 1 shows the PE architecture for PW redundancy when more than one PW in a redundant set is associated with a single AC. This is based on the architecture in Figure 4b of RFC 3985 [RFC3985]. The forwarder selects which of the redundant PWs to use based on the criteria described in this document.",
      "ja": "冗長セット内の複数のPWが単一のACに関連付けられている場合、図1は、PW冗長性のためにPEアーキテクチャを示します。これは、RFC 3985 [RFC3985]の図4Bにアーキテクチャに基づいています。フォワーダは、この文書に記載された条件に基づいて使用する冗長のPWのかを選択します。"
    },
    {
      "indent": 5,
      "text": "         +----------------------------------------+\n         |                PE Device               |\n         +----------------------------------------+\nSingle   |                 |        Single        | PW Instance\n AC      |                 +      PW Instance     X<===========>\n         |                 |                      |\n         |                 |----------------------|\n <------>o                 |        Single        | PW Instance\n         |    Forwarder    +      PW Instance     X<===========>\n         |                 |                      |\n         |                 |----------------------|\n         |                 |        Single        | PW Instance\n         |                 +      PW Instance     X<===========>\n         |                 |                      |\n         +----------------------------------------+",
      "raw": true
    },
    {
      "indent": 16,
      "text": "Figure 1: PE Architecture for PW Redundancy",
      "ja": "図1：PW冗長性のためにPEアーキテクチャ"
    },
    {
      "indent": 0,
      "text": "3.2. PW Redundancy Network Reference Scenarios",
      "section_title": true,
      "ja": "3.2.  PW冗長ネットワーク参照シナリオ"
    },
    {
      "indent": 3,
      "text": "This section presents a set of reference scenarios for PW redundancy. These reference scenarios represent example network topologies that illustrate the use of PW redundancy. They can be combined together to create more complex or comprehensive topologies, as required by a particular application or deployment.",
      "ja": "このセクションでは、PW冗長性の基準シナリオのセットを提示します。これらの参照シナリオは、PW冗長性の使用を示す例示的なネットワークトポロジを表します。特定のアプリケーションまたは展開で必要とされる彼らは、より複雑なまたは総合的なトポロジを作成するために一緒に組み合わせることができます。"
    },
    {
      "indent": 0,
      "text": "3.2.1. PW Redundancy for AC and PE Protection: One Dual-Homed CE with Redundant SS-PWs",
      "ja": "3.2.1.  ACおよびPE保護のためのPW冗長性：冗長SS-のPWの一つのデュアルホームCE"
    },
    {
      "indent": 3,
      "text": "Figure 2 illustrates an application of single-segment pseudowire redundancy where one of the CEs is dual-homed. This scenario is designed to protect the emulated service against a failure of one of the PEs or ACs attached to the multi-homed CE. Protection against failures of the PSN tunnels is provided using PSN mechanisms such as MPLS fast reroute, so that these failures do not impact the PW.",
      "ja": "図2は、CEの一方がデュアルホームである単一セグメント疑似回線冗長性の適用を示します。このシナリオは、マルチホームCEに添付のPEまたはACSの1の故障に対してエミュレートされたサービスを保護するように設計されています。これらの障害は、PWに影響を与えないように、PSNトンネルの障害に対する保護は、そのようなMPLS高速リルートとしてPSNメカニズムを使用して提供されます。"
    },
    {
      "indent": 3,
      "text": "CE1 is dual-homed to PE1 and PE3. A dual-homing control protocol, the details of which are outside the scope of this document, enables the PEs and CEs to determine which PE (PE1 or PE3) should forward towards CE1 and therefore which AC CE1 should use to forward towards the PSN.",
      "ja": "CE1は、デュアルホームPE1とPE3にあります。この文書の範囲外である詳細はデュアルホーミング制御プロトコルは、PE（PE1またはPE3）がCE1に向かって転送する必要があり、したがって、どのAC CE1は、PSNに向かって転送するために使用すべきかを決定するためにPEとCEを可能にします。"
    },
    {
      "indent": 6,
      "text": "      |<-------------- Emulated Service ---------------->|\n      |                                                  |\n      |          |<------- Pseudo Wire ------>|          |\n      |          |                            |          |\n      |          |    |<-- PSN Tunnels-->|    |          |\n      |          V    V                  V    V          |\n      V    AC    +----+                  +----+     AC   V\n+-----+    |     | PE1|==================|    |     |    +-----+\n|     |----------|....|...PW1.(active)...|....|----------|     |\n|     |          |    |==================|    |          | CE2 |\n| CE1 |          +----+                  |PE2 |          |     |\n|     |          +----+                  |    |          +-----+\n|     |          |    |==================|    |\n|     |----------|....|...PW2.(standby)..|    |\n+-----+    |     | PE3|==================|    |\n           AC    +----+                  +----+",
      "raw": true
    },
    {
      "indent": 13,
      "text": "Figure 2: One Dual-Homed CE and Redundant SS-PWs",
      "ja": "図2：一デュアルホームCEと冗長SS-のPW"
    },
    {
      "indent": 3,
      "text": "In this scenario, only one of the PWs should be used for forwarding between PE1/PE3 and PE2. PW redundancy determines which PW to make active based on the forwarding state of the ACs so that only one path is available from CE1 to CE2. This requires an additional PW state that reflects this forwarding state, which is separate from the operational status of the PW. This is the 'Preferential Forwarding Status'.",
      "ja": "このシナリオでは、一つだけのPWのは、PE1 / PE3およびPE2間の転送のために使用されるべきです。 PW冗長性は、唯一のパスがCE1からCE2に利用できるようにPWは、ACSの転送状態に基づいて、アクティブにするかを決定します。これは、PWの動作状態から分離され、この転送状態を反映した追加のPW状態を必要とします。これは、「優先転送ステータス」です。"
    },
    {
      "indent": 3,
      "text": "Consider the example where the AC from CE1 to PE1 is initially active and the AC from CE1 to PE3 is initially standby. PW1 is made active and PW2 is made standby in order to complete the path to CE2.",
      "ja": "CE1からPE1へACが最初にアクティブであり、CE1からPE3へACが最初にスタンバイである例を考えます。 PW1がアクティブにされ、PW2はCE2のパスを完了するために待機されています。"
    },
    {
      "indent": 3,
      "text": "On failure of the AC between CE1 and PE1, the forwarding state of the AC on PE3 transitions to active. The preferential forwarding state of PW2 therefore needs to become active, and PW1 standby, in order to re-establish connectivity between CE1 and CE2. PE3 therefore uses PW2 to forward towards CE2, and PE2 uses PW2 instead of PW1 to forward towards CE1. PW redundancy in this scenario requires that the forwarding status of the ACs at PE1 and PE3 be signaled to PE2 so that PE2 can choose which PW to make active.",
      "ja": "CE1とPE1の間のACの失敗時に、PE3上のACの転送状態がアクティブに遷移します。 PW2の優先転送状態は、したがって、アクティブになる必要があり、PW1スタンバイは、ために、CE1とCE2間の接続を再確立します。 PE3は、したがって、CE2に向けて転送するように、PW2を使用し、PE2はCE1に向けて転送するために、代わりにPW1のPW2を使用しています。このシナリオでは、PWの冗長性はPE2はPWをアクティブにするかを選択できるように、PE1とPE3でのACの転送状態がPE2に通知されている必要があります。"
    },
    {
      "indent": 3,
      "text": "Changes occurring on the dual-homed side of the network due to a failure of the AC or PE are not propagated to the ACs on the other side of the network. Furthermore, failures in the PSN are not propagated to the attached CEs.",
      "ja": "ACまたはPEの故障に起因するネットワークのデュアルホーム側で発生する変更は、ネットワークの反対側にACSに伝播されません。さらに、PSNの障害は、添付のCEに伝播されません。"
    },
    {
      "indent": 0,
      "text": "3.2.2. PW Redundancy for AC and PE Protection: Two Dual-Homed CEs with Redundant SS-PWs",
      "ja": "3.2.2.  ACおよびPE保護のためのPW冗長性：冗長SS-のPWを有する2つのデュアルホームのCE"
    },
    {
      "indent": 3,
      "text": "Figure 3 illustrates an application of single-segment pseudowire redundancy where both of the CEs are dual-homed. This scenario is also designed to protect the emulated service against failures of the ACs and failures of the PEs. Both CE1 and CE2 are dual-homed to their respective PEs, CE1 to PE1 and PE2, and CE2 to PE3 and PE4. A dual-homing control protocol, the details of which are outside the scope of this document, enables the PEs and CEs to determine which PEs should forward towards the CEs and therefore which ACs the CEs should use to forward towards the PSN.",
      "ja": "図3は、CEの両方がデュアルホームである単一セグメント疑似回線冗長性の適用を示します。このシナリオは、ACSおよびPEの障害の障害に対してエミュレートされたサービスを保護するように設計されています。 CE1とCE2の両方がデュアルホームPE3とPE4に、それぞれのPE、PE1とPE2にCE1、CE2としています。この文書の範囲外である詳細はデュアルホーミング制御プロトコルは、PEが複数のCEに向けて転送するべきしたがってCEはPSNに向かって転送するために使用するのACを決定するためにPEとCEを可能にします。"
    },
    {
      "indent": 3,
      "text": "Note that the PSN tunnels are not shown in this figure for clarity. However, it can be assumed that each of the PWs shown is encapsulated in a separate PSN tunnel. Protection against failures of the PSN tunnels is provided using PSN mechanisms such as MPLS fast reroute, so that these failures do not impact the PW.",
      "ja": "PSNトンネルは明確にするため、この図に示されていないことに注意してください。しかしながら、図示のPWのそれぞれが別々のPSNトンネルにカプセル化されると仮定することができます。これらの障害は、PWに影響を与えないように、PSNトンネルの障害に対する保護は、そのようなMPLS高速リルートとしてPSNメカニズムを使用して提供されます。"
    },
    {
      "indent": 3,
      "text": "      |<-------------- Emulated Service ---------------->|\n      |                                                  |\n      |          |<------- Pseudowire ------->|          |\n      |          |                            |          |\n      |          |    |<-- PSN Tunnels-->|    |          |\n      |          V    V                  V    V          |\n      V    AC    +----+                  +----+     AC   V\n+-----+    |     |....|.......PW1........|....|     |    +-----+\n|     |----------| PE1|......   .........| PE3|----------|     |\n| CE1 |          +----+      \\ /  PW3    +----+          | CE2 |\n|     |          +----+       X          +----+          |     |\n|     |          |    |....../ \\..PW4....|    |          |     |\n|     |----------| PE2|                  | PE4|--------- |     |\n+-----+    |     |....|.....PW2..........|....|     |    +-----+\n           AC    +----+                  +----+     AC",
      "raw": true
    },
    {
      "indent": 13,
      "text": "Figure 3: Two Dual-Homed CEs and Redundant SS-PWs",
      "ja": "図3：二つのデュアルホームCEと冗長SS-PWを"
    },
    {
      "indent": 3,
      "text": "PW1 and PW4 connect PE1 to PE3 and PE4, respectively. Similarly, PW2 and PW3 connect PE2 to PE4 and PE3. PW1, PW2, PW3, and PW4 are all up. In order to support protection for the emulated service, only one PW MUST be selected to forward traffic.",
      "ja": "PW1とPW4は、それぞれ、PE3とPE4にPE1を接続します。同様に、PW2およびPW3はPE4とPE3にPE2を接続します。 PW1、PW2、PW3、PW4とは、すべてのアップです。エミュレートされたサービスの保護をサポートするために、一つだけPWは、トラフィックを転送するために選択する必要があります。"
    },
    {
      "indent": 3,
      "text": "If a PW has a preferential forwarding status of 'active', it can be used for forwarding traffic. The actual up PW chosen by the combined set of PEs connected to the CEs is determined by considering the preferential forwarding status of each PW at each PE. The mechanisms for communicating the preferential forwarding status are outside the scope of this document. Only one PW is used for forwarding.",
      "ja": "PWは「アクティブ」の優先転送のステータスを持っている場合、それは、トラフィックを転送するために使用することができます。 CEに接続されたPEの組み合わせセットによって選択されたアップ実際のPWは、各PEの各PWの優先転送状況を考慮して決定されます。優先転送ステータスを通信するための機構は、この文書の範囲外です。唯一のPWは、転送のために使用されています。"
    },
    {
      "indent": 3,
      "text": "The following failure scenario illustrates the operation of PW redundancy in Figure 3. In the initial steady state, when there are no failures of the ACs, one of the PWs is chosen as the active PW, and all others are chosen as standby. The dual-homing protocol between CE1 and PE1/PE2 chooses to use the AC to PE2, while the protocol between CE2 and PE3/PE4 chooses to use the AC to PE4. Therefore, the PW between PE2 and PE4 is chosen as the active PW to complete the path between CE1 and CE2.",
      "ja": "次の障害シナリオは、初期定常状態では図3にPW冗長性の動作を示すのACのない障害が存在しない場合、のPWの一方がアクティブPWとして選択され、そして他のすべてのスタンバイとして選択されます。 CE2およびPE3 / PE4との間のプロトコルは、PE4にACを使用することを選択しながら、CE1およびPE1 / PE2の間にデュアルホーミングプロトコルは、PE2にACを使用することを選択しました。したがって、PE2とPE4との間のPWは、CE1とCE2の間の経路を完了するためにアクティブPWとして選択されます。"
    },
    {
      "indent": 3,
      "text": "On failure of the AC between the dual-homed CE1 and PE2, the preferential forwarding status of the PWs at PE1, PE2, PE3 and PE4 needs to change so as to re-establish a path from CE1 to CE2. Different mechanisms can be used to achieve this and these are beyond the scope of this document. After the change in status, the algorithm needs to evaluate and select which PW to forward traffic on. In this application, each dual-homing algorithm, i.e., {CE1, PE1, PE2} and {CE2, PE3, PE4}, selects the active AC independently.",
      "ja": "デュアルホームCE1およびPE2間に交流の失敗時に、PE1、PE2、PE3およびPE4でのPWの優先転送ステータスがCE2にCE1からのパスを再確立するように変更する必要があります。異なるメカニズムは、これを達成するために使用することができ、これらは、このドキュメントの範囲を超えています。状態の変化した後、アルゴリズムは、評価し、PWは上のトラフィックを転送するかを選択する必要があります。このアプリケーション、各デュアルホーミングアルゴリズム、すなわち、{CE1は、PE1、PE2}及び{CE2、PE3、PE4は}、アクティブACは、独立して選択されます。"
    },
    {
      "indent": 3,
      "text": "There is therefore a need to signal the active status of each AC such that the PEs can select a common active PW for forwarding between CE1 and CE2.",
      "ja": "PEはCE1とCE2の間に転送するための共通の活性PWを選択することができる各ACかかるのアクティブ状態を通知する必要があります。"
    },
    {
      "indent": 3,
      "text": "Changes occurring on one side of network due to a failure of the AC or PE are not propagated to the ACs on the other side of the network. Furthermore, failures in the PSN are not propagated to the attached CEs. Note that end-to-end native service protection switching can also be used to protect the emulated service in this scenario. In this case, PW3 and PW4 are not necessary.",
      "ja": "ACまたはPEの故障に対するネットワークの片側に発生する変更は、ネットワークの反対側にACSに伝播されません。さらに、PSNの障害は、添付のCEに伝播されません。そのエンド・ツー・エンドのネイティブサービス保護スイッチングは、このシナリオでエミュレートされたサービスを保護するためにも使用できることに注意してください。この場合、PW3およびPW4は必要ありません。"
    },
    {
      "indent": 3,
      "text": "If the CEs do not perform native service protection switching, they may instead use load balancing across the paths between the CEs.",
      "ja": "CEはネイティブサービス保護スイッチングを実行しない場合、彼らは代わりにCE間パス全体でロードバランシングを使用することができます。"
    },
    {
      "indent": 0,
      "text": "3.2.3. PW Redundancy for S-PE Protection: Single-Homed CEs with Redundant MS-PWs",
      "ja": "3.2.3.  S-PE保護用PW冗長性：冗長MS-のPWを有するシングルホームのCE"
    },
    {
      "indent": 3,
      "text": "Figure 4 shows a scenario where both CEs are single-homed, and MS-PW redundancy is used. The main objective is to protect the emulated service against failures of the S-PEs.",
      "ja": "図4は、両方のCEがシングルホームであるシナリオを示しており、MS-PWの冗長性が使用されます。主な目的は、S-PEの障害に対してエミュレートされたサービスを保護することです。"
    },
    {
      "indent": 3,
      "text": "    Native   |<----------- Pseudowires ----------->|  Native\n    Service  |                                     |  Service\n     (AC)    |     |<-PSN1-->|     |<-PSN2-->|     |  (AC)\n       |     V     V         V     V         V     V   |\n       |     +-----+         +-----+         +-----+   |\n+----+ |     |T-PE1|=========|S-PE1|=========|T-PE2|   |   +----+\n|    |-------|......PW1-Seg1.......|.PW1-Seg2......|-------|    |\n| CE1|       |     |=========|     |=========|     |       | CE2|\n|    |       +-----+         +-----+         +-----+       |    |\n+----+        |.||.|                          |.||.|       +----+\n              |.||.|         +-----+          |.||.|\n              |.||.|=========|     |========== .||.|\n              |.||...PW2-Seg1......|.PW2-Seg2...||.|\n              |.| ===========|S-PE2|============ |.|\n              |.|            +-----+             |.|\n              |.|============+-----+============= .|\n              |.....PW3-Seg1.|     | PW3-Seg2......|\n               ==============|S-PE3|===============\n                             |     |\n                             +-----+",
      "raw": true
    },
    {
      "indent": 14,
      "text": "Figure 4: Single-Homed CE with Redundant MS-PWs",
      "ja": "図4：冗長MS-のPWを有するシングルホームCE"
    },
    {
      "indent": 3,
      "text": "CE1 is connected to T-PE1, and CE2 is connected to T-PE2. There are three multi-segment PWs. PW1 is switched at S-PE1, PW2 is switched at S-PE2, and PW3 is switched at S-PE3. This scenario provides N:1 protection for the subset of the path of the emulated service from T-PE1 to T-PE2.",
      "ja": "CE1は、T-PE1に接続され、CE2はT-PE2に接続されています。 3マルチセグメントPWSがあります。 PW1は、PW2は、S-PE2で切り替えされ、S-PE1で切り替えられ、PW3は、S-PE3で切り替えています。 T-PE1からT-PE2にエミュレートされたサービスのパスのサブセットの1保護：このシナリオでは、Nを提供します。"
    },
    {
      "indent": 3,
      "text": "Since there is no multi-homing running on the ACs, the T-PE nodes advertise 'active' for the preferential forwarding status based on a priority for the PW. The priority associates a meaning of 'primary PW' and 'secondary PW' to a PW. These priorities MUST be used if revertive mode is used and the active PW to use for forwarding is determined accordingly. The priority can be derived via configuration or based on the value of the PW forwarding equivalence class (FEC). For example, a lower value of PWid FEC can be taken as a higher priority. However, this does not guarantee selection of same PW by the T-PEs because of, for example, a mismatch in the configuration of the PW priority at each T-PE. The intent of this application is for T-PE1 and T-PE2 to synchronize the transmit and receive paths of the PW over the network. In other words, both T-PE nodes are required to transmit over the PW segment that is switched by the same S-PE. This is desirable for ease of operation and troubleshooting.",
      "ja": "ACSで実行中のマルチホーミングがないため、T-PEノードは、PWの優先度に基づいて優先転送のステータス「アクティブ」広告します。優先順位は、PWに「主PW」と「二次PW」の意味を関連付けます。リバーティブモードが使用される場合、これらの優先度が使用されなければならないと活性PWは、それに応じて決定された転送のために使用します。優先度は、コンフィギュレーションを介して誘導された又はPW転送等価クラス（FEC）の値に基づくことができます。例えば、PWID FECの低い値は、より高い優先順位とすることができます。しかし、これは、各T-PEでPW優先度の構成では、例えば、ミスマッチのT-PESによって同じPWの選択を保証するものではありません。 T-PE1及びT-PE2は、送信を同期させると、ネットワークを介してPWのパスを受けるようにするために、本出願の目的です。換言すれば、両方のT-PEノードは、同じS-PEにより切り替えられるPWセグメント上に送信するために必要とされます。これは、操作やトラブルシューティングを容易にするために望ましいです。"
    },
    {
      "indent": 0,
      "text": "3.2.4. PW Redundancy for PE-rs Protection in H-VPLS Using SS-PWs",
      "section_title": true,
      "ja": "3.2.4.  SS-のPWを使用してH-VPLSにおけるPE-RS保護用PW冗長性"
    },
    {
      "indent": 3,
      "text": "The following figure (based on the architecture shown in Figure 3 of [RFC4762]) illustrates the application of PW redundancy to hierarchical VPLS (H-VPLS). Note that the PSN tunnels are not shown for clarity, and only one PW of a PW group is shown. A multi-tenant unit switch (MTU-s) is dual-homed to two PE router switches. The example here uses SS-PWs, and the objective is to protect the emulated service against failures of a PE-rs.",
      "ja": "（[RFC4762]の図3に示したアーキテクチャに基づいて）次の図は、階層的なVPLS（H-VPLS）にPW冗長性の適用を示します。 PSNトンネルを明確にするために図示されていない、およびPW群の一方のみPWが示されていることに留意されたいです。マルチテナントユニットのスイッチ（MTU-S）は、デュアルホーム2つのPEルータのスイッチです。ここでの例では、SS-PWのを使用し、目的は、PE-RSの障害に対してエミュレートされたサービスを保護することです。"
    },
    {
      "indent": 7,
      "text": "                                    PE1-rs\n                                +--------+\n                                |  VSI   |\n                Active PW       |   --   |\n                 Group..........|../  \\..|.\nCE-1                 .          |  \\  /  | .\n \\                  .           |   --   |  .\n  \\                .            +--------+   .\n   \\   MTU-s      .                  .        .     PE3-rs\n    +--------+   .                   .         . +--------+\n    |   VSI  |  .                    .  H-VPlS  .|  VSI   |\n    |   -- ..|..                     .   Core    |.. --   |\n    |  /  \\  |                       .    PWs    |  /  \\  |\n    |  \\  /..|..                     .           |  \\  /  |\n    |   --   |  .                    .          .|.. --   |\n    +--------+   .                   .         . +--------+\n   /              .                  .        .\n  /                .            +--------+   .\n /                  .           |  VSI   |  .\nCE-2                 .          |   --   | .\n                      ..........|../  \\..|.\n                Standby PW      |  \\  /  |\n                 Group          |   --   |\n                                +--------+\n                                  PE2-rs",
      "raw": true
    },
    {
      "indent": 16,
      "text": "Figure 5: MTU-s Dual-Homing in H-VPLS Core",
      "ja": "図5：H-VPLSコアにおけるMTU-Sデュアルホーミング"
    },
    {
      "indent": 3,
      "text": "In Figure 5, the MTU-s is dual-homed to PE1-rs and PE2-rs and has spoke PWs to each of them. The MTU-s needs to choose only one of the spoke PWs (the active PW) to forward traffic to one of the PEs and sets the other PW to standby. The MTU-s can derive the status of the PWs based on local policy configuration. PE1-rs and PE2-rs are connected to the H-VPLS core on the other side of network. The MTU-s communicates the status of its member PWs for a set of virtual switching instances (VSIs) that share a common status of active or standby. Here, the MTU-s controls the selection of PWs used to forward traffic. Signaling using PW grouping with a common group-id in the PWid FEC Element, or a Grouping TLV in Generalized PWid FEC Element as defined in [RFC4447], to PE1-rs and PE2-rs, is recommended for improved scaling.",
      "ja": "図5では、MTU-sがデュアルホームPE1-RSとPE2-RSにあり、それらのそれぞれにスポークPWをしています。 MTU-sがPEのいずれかにトラフィックを転送するためにスポークのPWだけ1（アクティブPW）を選択する必要があり、スタンバイに他のPWを設定します。 MTU-sがローカルポリシーの設定に基づいてのPW状態を導き出すことができます。 PE1-RSとPE2-RSは、ネットワークの反対側のH-VPLSコアに接続されています。 MTU-sがアクティブまたはスタンバイの共通のステータスを共有する仮想スイッチングインスタンス（のVSI）のセットに対するそのメンバーのPWのステータスを伝えます。ここでは、MTU-sがPWをの選択は、トラフィックを転送するために使用されるコントロール。 [RFC4447]で定義されるようPWID FEC素子における共通のグループID、または一般PWID FEC要素にグループ化TLVでグルーピングPWを使用してシグナリング、PE1-RSとPE2-RSに、改善されたスケーリングのために推奨されています。"
    },
    {
      "indent": 3,
      "text": "Whenever an MTU-s performs a switchover of the active PW group, it needs to communicate this status change to the PE2-rs. That is, it informs PE2-rs that the status of the standby PW group has changed to active.",
      "ja": "MTU-SはアクティブPWグループの切り替えを行うたびに、PE2-RSにこの状態変化を通信する必要があります。つまり、スタンバイPWグループの状態がアクティブに変化したPE2-RSに通知する、です。"
    },
    {
      "indent": 3,
      "text": "In this scenario, PE devices are aware of switchovers at the MTU-s and could generate Media Access Control (MAC) Address Withdraw messages to trigger MAC flushing within the H-VPLS full mesh. By default, MTU-s devices should still trigger MAC Address Withdraw messages as defined in [RFC4762] to prevent two copies of MAC Address Withdraw messages to be sent (one by the MTU-s and another one by the PE-rs). Mechanisms to disable the MAC withdraw trigger in certain devices are out of the scope of this document.",
      "ja": "このシナリオでは、PEデバイスは、MTU-sでスイッチオーバーを認識しており、メディアアクセス制御（MAC）アドレスがMACはH-VPLSフルメッシュ内フラッシングトリガするメッセージを生成することができる撤回します。デフォルトでは、MTU-Sデバイスは、依然として（MTU-SおよびPE-RSにより別の一枚ずつ）送信するメッセージを撤回MACアドレスの2つのコピーを防止するために、[RFC4762]で定義されるようにMACアドレスがメッセージを撤回トリガーします。特定のデバイスにトリガを撤回MACを無効にするメカニズムはこの文書の範囲外です。"
    },
    {
      "indent": 0,
      "text": "3.2.5. PW Redundancy for PE Protection in a VPLS Ring Using SS-PWs",
      "section_title": true,
      "ja": "3.2.5.  SS-のPWを使用してVPLS環におけるPE保護のための冗長PW"
    },
    {
      "indent": 3,
      "text": "The following figure illustrates the use of PW redundancy for dual-homed connectivity between PEs in a VPLS ring topology. As above, PSN tunnels are not shown, and only one PW of a PW group is shown for clarity. The example here uses SS-PWs, and the objective is to protect the emulated service against failures of a PE on the ring.",
      "ja": "次の図は、VPLSリングトポロジにおけるPE間のデュアルホーム接続のためのPW冗長性の使用を示します。上記のように、PSNトンネルは示されていない、およびPW群の一方のみPWは、明瞭化のために示されています。ここでの例では、SS-PWのを使用し、その目的は、リング上のPEの障害に対してエミュレートされたサービスを保護することです。"
    },
    {
      "indent": 3,
      "text": "            PE1                            PE2\n         +--------+                     +--------+\n         |  VSI   |                     |  VSI   |\n         |   --   |                     |   --   |\n   ......|../  \\..|.....................|../  \\..|.......\n         |  \\  /  |     PW Group 1      |  \\  /  |\n         |   --   |                     |   --   |\n         +--------+                     +--------+\n              .                              .\n              .                              .\nVPLS Domain A .                              . VPLS Domain B\n              .                              .\n              .                              .\n              .                              .\n         +--------+                     +--------+\n         |  VSI   |                     |  VSI   |\n         |   --   |                     |   --   |\n   ......|../  \\..|.....................|../  \\..|........\n         |  \\  /  |     PW Group 2      |  \\  /  |\n         |   --   |                     |   --   |\n         +--------+                     +--------+\n            PE3                            PE4",
      "raw": true
    },
    {
      "indent": 15,
      "text": "Figure 6: Redundancy in a VPLS Ring Topology",
      "ja": "図6：VPLSリングトポロジの冗長性"
    },
    {
      "indent": 3,
      "text": "In Figure 6, PE1 and PE3 from VPLS domain A are connected to PE2 and PE4 in VPLS domain B via PW group 1 and PW group 2. The PEs are connected to each other in such a way as to form a ring topology. Such scenarios may arise in inter-domain H-VPLS deployments where the Rapid Spanning Tree Protocol (RSTP) or other mechanisms may be used to maintain loop-free connectivity of the PW groups.",
      "ja": "図6に、VPLSドメインAからPE1及びPE3がリングトポロジを形成するようにPEが、このような方法で互いに接続されているPWグループ1及びPW群2を介してVPLSドメインBにPE2とPE4に接続されています。そのようなシナリオは、ラピッドスパニングツリープロトコル（RSTP）、または他のメカニズムがPWグループのループのない接続を維持するために使用することができるドメイン間H-VPLSの展開において生じ得ます。"
    },
    {
      "indent": 3,
      "text": "[RFC4762] outlines multi-domain VPLS services without specifying how multiple redundant border PEs per domain and per VPLS instance can be supported. In the example above, PW group 1 may be blocked at PE1 by RSTP, and it is desirable to block the group at PE2 by exchanging the PW preferential forwarding status of standby. The details of how PW grouping is achieved and used is deployment specific and is outside the scope of this document.",
      "ja": "[RFC4762]はドメインごとおよびVPLSインスタンスごとに複数の冗長境界PEがサポートされ得るかを指定することなく、マルチドメインVPLSサービスを概説します。上記の例では、PW基1 RSTPによってPE1でブロックされていてもよい、スタンバイのPW優先転送ステータスを交換することにより、PE2でグループをブロックすることが望ましいです。 PWのグループ化を達成して使用する方法の詳細は、特定の展開であり、この文書の範囲外です。"
    },
    {
      "indent": 0,
      "text": "3.2.6. PW Redundancy for VPLS n-PE Protection Using SS-PWs",
      "section_title": true,
      "ja": "3.2.6.  SS-のPWを使用してVPLSのN-PE保護のための冗長PW"
    },
    {
      "indent": 8,
      "text": "                  |<----- Provider ----->|\n                            Core\n           +------+                      +------+\n           | n-PE |::::::::::::::::::::::| n-PE |\nProvider   | (P)  |..........   .........| (P)  |  Provider\nAccess     +------+          . .         +------+  Access\nNetwork                       X                    Network\n  (1)      +------+          . .         +------+    (2)\n           | n-PE |..........   .........| n-PE |\n           |  (B) |......................| (B)  |\n           +------+                      +------+",
      "raw": true
    },
    {
      "indent": 23,
      "text": "Figure 7: Bridge Module Model",
      "ja": "図7：ブリッジモジュールモデル"
    },
    {
      "indent": 3,
      "text": "Figure 7 shows a scenario with two provider access networks. The example here uses SS-PWs, and the objective is to protect the emulated service against failures of a network-facing PE (n-PE).",
      "ja": "図7は、二つのプロバイダのアクセスネットワークを有するシナリオを示します。ここでの例では、SS-のPWを使用し、そして目的は、ネットワーク側PE（N-PE）の障害に対してエミュレートされたサービスを保護することです。"
    },
    {
      "indent": 3,
      "text": "Each network has two n-Pes. These n-PEs are connected via a full mesh of PWs for a given VPLS instance. As shown in the figure, only one n-PE in each access network serves as the primary PE (P) for that VPLS instance, and the other n-PE serves as the backup PE (B). In this figure, each primary PE has two active PWs originating from it. Therefore, when a multicast, broadcast, or unknown unicast frame arrives at the primary n-PE from the access network side, the n-PE replicates the frame over both PWs in the core even though it only needs to send the frames over a single PW (shown with :::: in the figure) to the primary n-PE on the other side. This is an unnecessary replication of the customer frames that consumes core-network bandwidth (half of the frames get discarded at the receiving n-PE). This issue gets aggravated when there are three or more n-PEs per provider access network. For example, if there are three n-PEs or four n-PEs per access network, then 67% or 75% of core bandwidth for multicast, broadcast, and unknown unicast are wasted, respectively.",
      "ja": "各ネットワークは、2つのn-PESを持っています。これらのn-PEが所定のVPLSインスタンスのためのPWのフルメッシュを介して接続されています。同図に示すように、各アクセスネットワークで唯一のn-PEは、それがVPLSインスタンスのプライマリPE（P）として機能し、他のN-PEは、バックアップPE（B）としての役割を果たす。この図では、各一次PEは、それに由来する二つの活性のPWを有しています。マルチキャスト、ブロードキャスト、または未知のユニキャストフレームは、アクセスネットワーク側からプライマリN-PEに到達したときしたがって、N-PEは、それが単一の上にフレームを送信する必要があるにもかかわらず、コア内の両方のPW上にフレームを複製しますPW（図中::::で示す）の一次のn-PE他方側へ。これは、（フレームの半分を受けるn-PEで廃棄GET）コアネットワーク帯域幅を消費する顧客フレームの不必要な複製です。プロバイダのアクセスネットワークごとに3つ以上のN-PEが存在する場合にこの問題が悪化します。 3つのN-PES又はアクセスネットワークごとに4つのN-PEがある場合、例えば、マルチキャスト、ブロードキャスト、および未知のユニキャスト、次いで67％またはコアの帯域幅の75％が、それぞれ、無駄になります。"
    },
    {
      "indent": 3,
      "text": "In this scenario, the n-PEs can communicate the active or standby status of the PWs among them. This status can be derived from the active or backup state of an n-PE for a given VPLS.",
      "ja": "このシナリオでは、N-PEはそれらの間のPWのアクティブまたはスタンバイ状態を通信することができます。このステータスは、所与のVPLSのためのN-PEのアクティブまたはバックアップ状態に由来することができます。"
    },
    {
      "indent": 0,
      "text": "4. Generic PW Redundancy Requirements",
      "section_title": true,
      "ja": "4.一般的なPW冗長性の要件"
    },
    {
      "indent": 0,
      "text": "4.1. Protection Switching Requirements",
      "section_title": true,
      "ja": "4.1. 保護スイッチングの要件"
    },
    {
      "indent": 3,
      "text": "o Protection architectures such as N:1,1:1 or 1+1 are possible. 1:1 protection MUST be supported. The N:1 protection case is less efficient in terms of the resources that must be allocated; hence, this SHOULD be supported. 1+1 protection MAY be used in the scenarios described in the document. However, the details of its usage are outside the scope of this document, as it MAY require a 1+1 protection switching protocol between the CEs.",
      "ja": "例えば、N、O保護アーキテクチャ：1,1：1または1 + 1が可能です。 1：1保護をサポートしなければなりません。 N：1保護ケースを割り当てなければならないリソースの点で効率が低いです。したがって、これはサポートされる必要があります。 1つの+ 1保護が文書で説明したシナリオで使用されるかもしれません。それはCE間1 + 1保護スイッチングプロトコルを必要とし得るようなしかし、その使用方法の詳細は、本文書の範囲外です。"
    },
    {
      "indent": 3,
      "text": "o Non-revertive behavior MUST be supported, while revertive behavior is OPTIONAL. This avoids the need to designate one PW as primary unless revertive behavior is explicitly required.",
      "ja": "リバーティブ動作はオプションですが、O非リバーティブ動作は、サポートしなければなりません。これは、リバーティブ動作が明示的に必要とされない限り、プライマリとして1 PWを指定する必要がありません。"
    },
    {
      "indent": 3,
      "text": "o Protection switchover can be initiated from a PE, e.g., using a manual switchover or a forced switchover, or it may be triggered by a signal failure, i.e., a defect in the PW or PSN. Manual switchover may be necessary if it is required to disable one PW in a redundant set. Both methods MUST be supported, and signal failure triggers MUST be treated with a lower priority than any local or far-end forced switch or manual trigger.",
      "ja": "O保護切り替えは、手動切り替えや強制切り替えを使用して、例えば、PEから開始することができ、またはそれは、すなわち、信号障害によってPWまたはPSNに欠陥をトリガすることができます。冗長セット内の1つPWを無効にするために必要とされる場合手動切り替えが必要であるかもしれません。両方の方法をサポートしなければなりません、そして信号障害トリガは、任意のローカルまたは遠端強制スイッチまたはマニュアルトリガよりも低い優先度で処理されなければなりません。"
    },
    {
      "indent": 3,
      "text": "o A PE MAY be able to forward packets received from a PW with a standby status in order to avoid black holing of in-flight packets during switchover. However, in cases where VPLS is used, all VPLS application packets received from standby PWs MUST be dropped, except for OAM and control-plane packets.",
      "ja": "O PEはスイッチオーバー中に飛行中のパケットのブラックホールを回避するために待機状態とPWから受信したパケットを転送することができるかもしれません。しかしながら、VPLSが使用される場合には、すべてのアプリケーションパケットはスタンバイのPWから受信VPLS OAM及びコントロールプレーンのパケットを除いて、削除する必要があります。"
    },
    {
      "indent": 0,
      "text": "4.2. Operational Requirements",
      "section_title": true,
      "ja": "4.2. 運用要件"
    },
    {
      "indent": 3,
      "text": "o (T-)PEs involved in protecting a PW SHOULD automatically discover and attempt to resolve inconsistencies in the configuration of primary/secondary PWs.",
      "ja": "PW保護に関与O（T-）PEは自動的に発見し、プライマリ/セカンダリのPWの構成に矛盾を解決しようとすべきです。"
    },
    {
      "indent": 3,
      "text": "o (T-)PEs involved in protecting a PW SHOULD automatically discover and attempt to resolve inconsistencies in the configuration of revertive/non-revertive protection switching mode.",
      "ja": "PWの保護に関与O（T-）PEは自動的に検出し、モードを切り替えるティブ/非リバーティブ保護の構成で矛盾を解決しようとすべきです。"
    },
    {
      "indent": 3,
      "text": "o (T-)PEs that do not automatically discover or resolve inconsistencies in the configuration of primary/secondary, revertive/non-revertive, or other parameters MUST generate an alarm upon detection of an inconsistent configuration.",
      "ja": "自動的に発見または、プライマリ/セカンダリ非復帰/復帰、又は他のパラメータの構成に矛盾を解決しないO（T-）PEは一貫性のない構成を検出するとアラームを生成しなければなりません。"
    },
    {
      "indent": 3,
      "text": "o (T-)PEs participating in PW redundancy MUST support the configuration of revertive or non-revertive protection switching modes if both modes are supported.",
      "ja": "両方のモードがサポートされている場合PW冗長性に関与O（T-）PEはリバーティブまたは非リバーティブ保護スイッチングモードの設定をサポートしなければなりません。"
    },
    {
      "indent": 3,
      "text": "o The MIB(s) MUST support inter-PSN monitoring of the PW redundancy configuration, including the protection switching mode.",
      "ja": "O MIB（複数可）保護スイッチングモードを含むPW冗長構成の間PSN監視をサポートしなければなりません。"
    },
    {
      "indent": 3,
      "text": "o (T-)PEs participating in PW redundancy SHOULD support the local invocation of protection switching.",
      "ja": "PW冗長に参加O（T-）PEは保護スイッチングのローカル呼び出しをサポートする必要があります。"
    },
    {
      "indent": 3,
      "text": "o (T-)PEs participating in PW redundancy SHOULD support the local invocation of a lockout of protection switching.",
      "ja": "PW冗長に参加O（T-）PEは保護スイッチングのロックアウトのローカル呼び出しをサポートする必要があります。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "The PW redundancy method described in this RFC will require an extension to the PW setup and maintenance protocol [RFC4447], which in turn is carried over the Label Distribution Protocol (LDP) [RFC5036]. This PW redundancy method will therefore inherit the security mechanisms of the version of LDP implemented in the PEs.",
      "ja": "このRFCに記載PW冗長方法は、順番にラベル配布プロトコル（LDP）[RFC5036]を介して搬送されたPWセットアップ及びメンテナンスプロトコル[RFC4447]の拡張を必要とします。このPW冗長方法は、そのためのPEに実装さLDPのバージョンのセキュリティメカニズムを継承します。"
    },
    {
      "indent": 0,
      "text": "6. Contributors",
      "section_title": true,
      "ja": "6.寄与者"
    },
    {
      "indent": 3,
      "text": "The editors would like to thank Pranjal Kumar Dutta, Marc Lasserre, Jonathan Newton, Hamid Ould-Brahim, Olen Stokes, Dave Mcdysan, Giles Heron, and Thomas Nadeau, all of whom made a major contribution to the development of this document.",
      "ja": "編集者は、この文書の発展に多大な貢献をしたすべての人のPranjalクマールDuttaさん、マルク・Lasserre、ジョナサン・ニュートン、ハミドウルド -  Brahimの、オレンストークス、デイブMcdysan、ジャイルズヘロン、とトーマスナドーを、感謝したいと思います。"
    },
    {
      "indent": 3,
      "text": "Pranjal Dutta Alcatel-Lucent EMail: pranjal.dutta@alcatel-lucent.com",
      "ja": "Pranjal Dutta氏アルカテル・ルーセントEメール：pranjal.dutta@alcatel-lucent.com"
    },
    {
      "indent": 3,
      "text": "Marc Lasserre Alcatel-Lucent EMail: marc.lasserre@alcatel-lucent.com",
      "ja": "マルク・Lasserreアルカテル・ルーセントEメール：marc.lasserre@alcatel-lucent.com"
    },
    {
      "indent": 3,
      "text": "Jonathan Newton Cable & Wireless EMail: Jonathan.Newton@cw.com",
      "ja": "ジョナサン・ニュートンケーブル・アンド・ワイヤレスEメール：Jonathan.Newton@cw.com"
    },
    {
      "indent": 3,
      "text": "Hamid Ould-Brahim EMail: ouldh@yahoo.com",
      "ja": "ハミドAldbarhamメール：ألذ@ياهو.كوم"
    },
    {
      "indent": 3,
      "text": "Olen Stokes Extreme Networks EMail: ostokes@extremenetworks.com",
      "ja": "オレンストークスエクストリームネットワークスのEメール：ostokes@extremenetworks.com"
    },
    {
      "indent": 3,
      "text": "Dave McDysan Verizon EMail: dave.mcdysan@verizon.com",
      "ja": "デイブMcDysanベライゾンメール：dave.mcdysan@verizon.com"
    },
    {
      "indent": 3,
      "text": "Giles Heron Cisco Systems EMail: giles.heron@gmail.com",
      "ja": "ジャイルズヘロンシスコシステムズ電子メール：giles.heron@gmail.com"
    },
    {
      "indent": 3,
      "text": "Thomas Nadeau Juniper Networks EMail: tnadeau@lucidvision.com",
      "ja": "トーマスナドージュニパーネットワークスのEメール：tnadeau@lucidvision.com"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgements",
      "section_title": true,
      "ja": "7.謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Vach Kompella, Kendall Harvey, Tiberiu Grigoriu, Neil Hart, Kajal Saha, Florin Balus, and Philippe Niger for their valuable comments and suggestions.",
      "ja": "作者は彼らの貴重なコメントや提案をVACH Kompella、ケンドールハーヴェイ、Tiberiu Grigoriu、ニール・ハート、Kajalサハ、フローリンBalus、およびフィリップ・ニジェールに感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8.参照文献"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "ja": "8.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3985] Bryant, S. and P. Pate, \"Pseudo Wire Emulation Edge-to-Edge (PWE3) Architecture\", RFC 3985, March 2005.",
      "ja": "[RFC3985]ブライアント、S.とP.パテ、 \"疑似ワイヤーエミュレーション端から端まで（PWE3）アーキテクチャ\"、RFC 3985、2005年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC4026] Andersson, L. and T. Madsen, \"Provider Provisioned Virtual Private Network (VPN) Terminology\", RFC 4026, March 2005.",
      "ja": "[RFC4026]アンデションとL.とT.マドセン、 \"プロバイダーのプロビジョニングされた仮想プライベートネットワーク（VPN）用語\"、RFC 4026、2005月。"
    },
    {
      "indent": 3,
      "text": "[RFC4446] Martini, L., \"IANA Allocations for Pseudowire Edge to Edge Emulation (PWE3)\", BCP 116, RFC 4446, April 2006.",
      "ja": "[RFC4446]マティーニ、L.、BCP 116、RFC 4446、2006年4月 \"エッジエミュレーションに擬似回線縁（PWE3）のためのIANAの割り当て\"。"
    },
    {
      "indent": 3,
      "text": "[RFC4447] Martini, L., Rosen, E., El-Aawar, N., Smith, T., and G. Heron, \"Pseudowire Setup and Maintenance Using the Label Distribution Protocol (LDP)\", RFC 4447, April 2006.",
      "ja": "[RFC4447]、L.、ローゼン、E.、エル・Aawar、N.、スミス、T.、およびG.サギ、 \"ラベル配布プロトコル（LDP）を使用して、擬似回線の設定とメンテナンス\"、RFC 4447、2006年4月マティーニ。"
    },
    {
      "indent": 3,
      "text": "[RFC4762] Lasserre, M. and V. Kompella, \"Virtual Private LAN Service (VPLS) Using Label Distribution Protocol (LDP) Signaling\", RFC 4762, January 2007.",
      "ja": "[RFC4762] Lasserre、M.およびV. Kompella、 \"仮想プライベートLANサービス（VPLS）ラベル配布プロトコル（LDP）シグナリングの使用\"、RFC 4762、2007年1月を。"
    },
    {
      "indent": 3,
      "text": "[RFC5036] Andersson, L., Minei, I., and B. Thomas, \"LDP Specification\", RFC 5036, October 2007.",
      "ja": "[RFC5036]アンデション、L.、Minei、I.、およびB.トーマス、 \"LDP仕様\"、RFC 5036、2007年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC5659] Bocci, M. and S. Bryant, \"An Architecture for Multi-Segment Pseudowire Emulation Edge-to-Edge\", RFC 5659, October 2009.",
      "ja": "[RFC5659]ボッチ、M.とS.ブライアント、「マルチセグメント擬似回線エミュレーションエッジツーエッジのためのアーキテクチャ」、RFC 5659、2009年10月。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative Reference",
      "section_title": true,
      "ja": "8.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC5601] Nadeau, T. and D. Zelig, \"Pseudowire (PW) Management Information Base (MIB)\", RFC 5601, July 2009.",
      "ja": "[RFC5601]ナドー、T.、およびD.カメレオンマン、 \"擬似回線（PW）管理情報ベース（MIB）\"、RFC 5601、2009年7月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Praveen Muley Alcatel-Lucent",
      "ja": "PraveenさんMuleyアルカテル・ルーセント"
    },
    {
      "indent": 3,
      "text": "EMail: praveen.muley@alcatel-lucent.com",
      "ja": "メールアドレス：praveen.muley@alcatel-lucent.com"
    },
    {
      "indent": 3,
      "text": "Mustapha Aissaoui Alcatel-Lucent",
      "ja": "ムスタファAissaouiアルカテル・ルーセント"
    },
    {
      "indent": 3,
      "text": "EMail: mustapha.aissaoui@alcatel-lucent.com",
      "ja": "メールアドレス：mustapha.aissaoui@alcatel-lucent.com"
    },
    {
      "indent": 3,
      "text": "Matthew Bocci Alcatel-Lucent",
      "ja": "マシューボッチアルカテル・ルーセント"
    },
    {
      "indent": 3,
      "text": "EMail: matthew.bocci@alcatel-lucent.com",
      "ja": "メールアドレス：matthew.bocci@alcatel-lucent.com"
    }
  ]
}