{
  "title": {
    "text": "RFC 6982 - Improving Awareness of Running Code: The Implementation Status Section",
    "ja": "RFC 6982 - 実施状況セクション：コードの実行の意識を向上させます"
  },
  "number": 6982,
  "created_at": "2019-11-02 12:17:26.336339+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                        Y. Sheffer\nRequest for Comments: 6982                                      Porticor\nCategory: Experimental                                         A. Farrel\nISSN: 2070-1721                                                  Juniper\n                                                               July 2013",
      "raw": true
    },
    {
      "indent": 1,
      "text": "Improving Awareness of Running Code: The Implementation Status Section",
      "ja": "実施状況セクション：コードの実行の意識を向上させます"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document describes a simple process that allows authors of Internet-Drafts to record the status of known implementations by including an Implementation Status section. This will allow reviewers and working groups to assign due consideration to documents that have the benefit of running code, which may serve as evidence of valuable experimentation and feedback that have made the implemented protocols more mature.",
      "ja": "この文書はインターネットドラフトの著者が、実施状況のセクションを含めることにより、既知の実装の状態を記録することができるシンプルなプロセスについて説明します。これは、審査及びワーキンググループが実装されたプロトコルは、より成熟してきた貴重な実験やフィードバックの証拠として働くことができるコードを、実行していることの利点を持っているドキュメントへの配慮を割り当てることができます。"
    },
    {
      "indent": 3,
      "text": "The process in this document is offered as an experiment. Authors of Internet-Drafts are encouraged to consider using the process for their documents, and working groups are invited to think about applying the process to all of their protocol specifications. The authors of this document intend to collate experiences with this experiment and to report them to the community.",
      "ja": "この文書に記載されているプロセスは、実験として提供されます。インターネットドラフトの著者は、その文書のためのプロセスを使用することを検討することが奨励され、そしてワーキンググループは、そのプロトコル仕様のすべてにプロセスを適用することを考えるに招待されています。本書の著者は、この実験の経験を照合するために、コミュニティに報告する予定。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for examination, experimental implementation, and evaluation.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、検査、実験的な実装、および評価のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document defines an Experimental Protocol for the Internet community. This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "この文書は、インターネットコミュニティのためにExperimentalプロトコルを定義します。このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 IESGによって承認されていないすべての文書がインターネットStandardのどんなレベルの候補です。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6982.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6982で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2013 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2013 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   3\n2.  The \"Implementation Status\" Section . . . . . . . . . . . . .   4\n2.1.  Introductory Text . . . . . . . . . . . . . . . . . . . . .   5\n3.  Alternative Formats . . . . . . . . . . . . . . . . . . . . .   6\n4.  Benefits  . . . . . . . . . . . . . . . . . . . . . . . . . .   6\n5.  Process Experiment  . . . . . . . . . . . . . . . . . . . . .   7\n5.1.  Duration  . . . . . . . . . . . . . . . . . . . . . . . . .   7\n5.2.  Summary Report  . . . . . . . . . . . . . . . . . . . . . .   8\n5.3.  Success Criteria  . . . . . . . . . . . . . . . . . . . . .   8\n6.  Security Considerations . . . . . . . . . . . . . . . . . . .   8\n7.  Acknowledgements  . . . . . . . . . . . . . . . . . . . . . .   8\n8.  Informative References  . . . . . . . . . . . . . . . . . . .   9",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "Most IETF participants are familiar with the saying \"rough consensus and running code\" [Tao] and can identify with its pragmatic approach. However, implementation is not a requirement for publication as an RFC. There are many examples of Internet-Drafts containing protocol specification that have gone through to publication as Proposed Standard RFCs without implementation. Some of them may never get implemented.",
      "ja": "ほとんどのIETFの参加者は、[タオ]「ラフコンセンサスとランニングコード」と言って精通しているとその実用的なアプローチを識別することができます。しかし、実装はRFCとして公開の要件ではありません。実装なしのProposed Standard RFCとして公表に通過したプロトコル仕様を含むインターネットドラフトの多くの例があります。それらのいくつかは実装されません飽きないことがあります。"
    },
    {
      "indent": 3,
      "text": "Over time, a variety of policies have been applied within the IETF to consider running code. In the Routing Area, it used to be a requirement that one or more implementations must exist before an Internet-Draft could be published as a Proposed Standard RFC [RFC1264]. That RFC was later obsoleted and the requirement for implementation was lifted, but each working group was given the authority to impose its own implementation requirements [RFC4794] and at least one working group, Inter-Domain Routing (IDR), continues to require two independent implementations.",
      "ja": "時間が経つにつれて、政策の様々なコードを実行することを検討するために、IETF内で適用されています。ルーティングエリアでは、インターネットドラフト提案標準RFC [RFC1264]として公開される前に1つ以上の実施が存在しなければならないという要件であるために使用しました。そのRFCは、後に廃止し、実施のための要件が​​解除されたが、各ワーキンググループは、独自の実装要件[RFC4794]を課す権限を与えられ、少なくとも一つの作業グループ、ドメイン間ルーティング（IDR）は、二つの独立を必要とし続けました実装。"
    },
    {
      "indent": 3,
      "text": "The hypothesis behind the current document is that there are benefits to the IETF standardization process of producing implementations of protocol specifications before publication as RFCs. These benefits, which include determining that the specification is comprehensible and that there is sufficient interest to implement, are further discussed in Section 4.",
      "ja": "現在の文書の背後にある仮説はRFCとして公表する前に、プロトコル仕様の実装を生成するIETF標準化プロセスへのメリットがあるということです。仕様が理解であると判断し、実施するために十分な関心があることが挙げられるこれらの利点は、さらに第4章に記載されています。"
    },
    {
      "indent": 3,
      "text": "This document describes a simple mechanism that allows authors of Internet-Drafts to record and publicize the status of known implementations by including an Implementation Status section. The document defines (quite informally) the contents of this section to ensure that the relevant information is included. This will allow reviewers and working groups to assign due consideration to documents that have the benefit of running code, which may serve as evidence of valuable experimentation and feedback that have made the implemented protocols more mature.",
      "ja": "この文書はインターネットドラフトの著者が記録し、実施状況のセクションを含めることにより、既知の実装の状況を公表することができるシンプルなメカニズムを説明しています。文書定義（かなり非公式）このセクションの内容は、関連情報が含まれていることを確実にします。これは、審査及びワーキンググループが実装されたプロトコルは、より成熟してきた貴重な実験やフィードバックの証拠として働くことができるコードを、実行していることの利点を持っているドキュメントへの配慮を割り当てることができます。"
    },
    {
      "indent": 3,
      "text": "It is up to the individual working groups to use this information as they see fit, but one result might be the preferential treatment of documents, resulting in them being processed more rapidly. We recommend that the Implementation Status section should be removed from Internet-Drafts before they are published as RFCs. As a result, we do not envisage changes to this section after approval of the document for publication, e.g., the RFC errata process does not apply.",
      "ja": "それは、彼らが合うように、この情報を使用するために、個々の作業グループまでですが、1つの結果は、それらをより迅速に処理され、その結果、文書の優遇かもしれません。我々は、彼らがRFCとして公開される前に実施状況のセクションでは、インターネットドラフトから除去されなければならないことをお勧めします。その結果、我々は出版のための文書の承認後に、このセクションへの変更を想定していない、例えば、RFCの正誤表のプロセスが適用されません。"
    },
    {
      "indent": 3,
      "text": "The process in this document is offered as an experiment (though not as an [RFC3933] experiment; see Section 5). Authors of Internet-Drafts are encouraged to consider using the process for their documents, and working groups are invited to think about applying the process to all of their protocol specifications.",
      "ja": "（;第5章を参照[RFC3933]実験としてではないが）、この文書に記載されているプロセスは、実験として提供されます。インターネットドラフトの著者は、その文書のためのプロセスを使用することを検討することが奨励され、そしてワーキンググループは、そのプロトコル仕様のすべてにプロセスを適用することを考えるに招待されています。"
    },
    {
      "indent": 3,
      "text": "The scope of the intended experiment is all Internet-Drafts (I-Ds) that contain implementable specifications, whether produced within IETF working groups or outside working groups but intended for IETF consensus. I-Ds published on the Independent Stream are explicitly out of scope. It is expected that the greatest benefit in the experiment will be seen with Standards Track documents developed within working groups.",
      "ja": "意図された実験の範囲は、IETFワーキンググループ内またはワーキンググループ外に生産が、IETFコンセンサスを意図するかどうかを、実行可能な仕様を含むすべてのインターネットドラフト（I-DS）です。独立したストリームに公開I-Dsがスコープ外に明示されています。実験では最大の利点は、ワーキンググループ内で開発標準化過程ドキュメントで見られることが期待されます。"
    },
    {
      "indent": 3,
      "text": "The authors of this document intend to collate experiences with this experiment and to report them to the community.",
      "ja": "本書の著者は、この実験の経験を照合するために、コミュニティに報告する予定。"
    },
    {
      "indent": 0,
      "text": "2. The \"Implementation Status\" Section",
      "section_title": true,
      "ja": "2.「実施状況」セクション"
    },
    {
      "indent": 3,
      "text": "Each Internet-Draft may contain a section entitled \"Implementation Status\". This section, if it appears, should be located just before the \"Security Considerations\" section and contain, for each existing implementation, some or all of the following:",
      "ja": "各インターネットドラフトは、「実施状況」と題するセクションが含まれていてもよいです。このセクションでは、それが表示された場合は、単に「セキュリティの考慮事項」セクションの前に配置する必要がありますと、それぞれの既存の実装のために、次の一部またはすべてが含まれています。"
    },
    {
      "indent": 3,
      "text": "o The organization responsible for the implementation, if any.",
      "ja": "実装に責任がある組織、もしあれば、O。"
    },
    {
      "indent": 3,
      "text": "o The implementation's name and/or a link to a web page describing the implementation.",
      "ja": "実装の名前および/または実装を記述したウェブページへのリンクO。"
    },
    {
      "indent": 3,
      "text": "o A brief general description.",
      "ja": "簡単な一般的な説明、O。"
    },
    {
      "indent": 3,
      "text": "o The implementation's level of maturity: research, prototype, alpha, beta, production, widely used, etc.",
      "ja": "研究、試作品、アルファ、ベータ、生産、広く使われている、など：成熟度の実装のレベルO"
    },
    {
      "indent": 3,
      "text": "o Coverage: which parts of the protocol specification are implemented and which versions of the Internet-Draft were implemented.",
      "ja": "Oカバレッジ：プロトコル仕様の部品が実装され、インターネットドラフトのどのバージョンが実装されました。"
    },
    {
      "indent": 3,
      "text": "o Licensing: the terms under which the implementation can be used. For example: proprietary, royalty licensing, freely distributable with acknowledgement (BSD style), freely distributable with requirement to redistribute source (General Public License (GPL) style), and other (specify).",
      "ja": "Oライセンス：実装が使用できるの下での用語。例えば：、確認応答（BSDスタイル）で自由に配布ソース（General Public License（GPL）のスタイル）を再配布するための要件と自由に配布、および他の独自の、ロイヤリティライセンス、（指定）。"
    },
    {
      "indent": 3,
      "text": "o Implementation experience: any useful information the implementers want to share with the community.",
      "ja": "O実装経験：実装者がコミュニティと共有したい任意の有用な情報。"
    },
    {
      "indent": 3,
      "text": "o Contact information: ideally a person's name and email address, but possibly just a URL or mailing list.",
      "ja": "理想的な人の名前と電子メールアドレスが、おそらくちょうどURLまたはメーリングリスト：O情報を問い合わせてください。"
    },
    {
      "indent": 3,
      "text": "In addition, this section can contain information about the interoperability of any or all of the implementations, including references to test-case descriptions and interoperability reports, when such exist.",
      "ja": "加えて、このセクションでは、そのようなものが存在する場合、テストケースの記述との相互運用性レポートへの参照を含む、実施態様のいずれかまたはすべての相互運用性に関する情報を含むことができます。"
    },
    {
      "indent": 3,
      "text": "Working group chairs and area directors (ADs) are requested to ensure that this section is not used as a marketing venue for specific implementations.",
      "ja": "ワーキンググループの議長と地域ディレクター（ADS）は、このセクションでは、特定の実装のためのマーケティングの会場として使用されていないことを確認するように要求されています。"
    },
    {
      "indent": 3,
      "text": "Since this information is necessarily time dependent, it is inappropriate for inclusion in a published RFC. The authors should include a note to the RFC Editor requesting that the section be removed before publication.",
      "ja": "この情報は、必ずしも時間依存性であるので、公開されたRFCに含めるためには不適切です。著者は、セクションを出版する前に削除することを要求するRFC編集者への注記を含める必要があります。"
    },
    {
      "indent": 0,
      "text": "2.1. Introductory Text",
      "section_title": true,
      "ja": "2.1。入門テキス"
    },
    {
      "indent": 3,
      "text": "The following boilerplate text is proposed to head the Implementation Status section:",
      "ja": "次の定型テキストは、実施状況のセクションを頭に提案されています。"
    },
    {
      "indent": 6,
      "text": "This section records the status of known implementations of the protocol defined by this specification at the time of posting of this Internet-Draft, and is based on a proposal described in RFC 6982. The description of implementations in this section is intended to assist the IETF in its decision processes in progressing drafts to RFCs. Please note that the listing of any individual implementation here does not imply endorsement by the IETF. Furthermore, no effort has been spent to verify the information presented here that was supplied by IETF contributors. This is not intended as, and must not be construed to be, a catalog of available implementations or their features. Readers are advised to note that other implementations may exist.",
      "ja": "このセクションでは、このインターネットドラフトの転記時にこの仕様で定義されたプロトコルの既知の実装の状態を記録し、RFC 6982.このセクションの実装の説明を記載提案に基づいているIETFを補助することが意図されていますその決定にいるRFCに草稿を進んで処理します。ここでは個々の実装のリストがIETFを示唆するものではありませんのでご注意ください。さらに、何の努力はIETFの貢献者によって供給された、ここで提示された情報を検証するために費やされていません。これは次のように意図されていない、そして、利用可能な実装またはその機能のカタログ的に解釈してはなりません。読者は、他の実装が存在する可能性があることに注意することをお勧めします。"
    },
    {
      "indent": 6,
      "text": "According to RFC 6982, \"this will allow reviewers and working groups to assign due consideration to documents that have the benefit of running code, which may serve as evidence of valuable experimentation and feedback that have made the implemented protocols more mature. It is up to the individual working groups to use this information as they see fit\".",
      "ja": "RFC 6982によると、「これは査読とワーキンググループが実装されたプロトコルは、より成熟してきた貴重な実験やフィードバックの証拠として働くことができるコードを、実行していることの利点を持っているドキュメントへの配慮を割り当てることができます。それはまでです個人は、彼らが「フィット見るようにグループはこの情報を使用して取り組んでいます。"
    },
    {
      "indent": 3,
      "text": "Authors are requested to add a note to the RFC Editor at the top of this section, advising the Editor to remove the entire section before publication, as well as the reference to RFC 6982.",
      "ja": "著者らは、出版前セクション全体、ならびにRFC 6982への参照を削除するためのエディタをアドバイス、このセクションの上部にあるRFCエディタにメモを追加するように要求されています。"
    },
    {
      "indent": 0,
      "text": "3. Alternative Formats",
      "section_title": true,
      "ja": "3.代替フォーマット"
    },
    {
      "indent": 3,
      "text": "Sometimes it can be advantageous to publish the implementation status separately from the base Internet-Draft, e.g., on the IETF wiki:",
      "ja": "時にはIETFのwikiに、例えば、ベースインターネットドラフトとは別に実施状況を公開することが有利です。"
    },
    {
      "indent": 3,
      "text": "o When the Implementation Status section becomes too large to be conveniently managed within the document.",
      "ja": "O実施状況のセクションには、便利なドキュメント内で管理できないほど大きくなると。"
    },
    {
      "indent": 3,
      "text": "o When a working group decides to have implementors, rather than authors, keep the status of their implementations current.",
      "ja": "ワーキンググループは、実装ではなく、著者を持っていることを決定したときは、O、その実装の現在の状態を保ちます。"
    },
    {
      "indent": 3,
      "text": "o When a working group already maintains an active wiki and prefers to use it for this purpose.",
      "ja": "OワーキンググループがすでにアクティブWikiを維持し、この目的のためにそれを使用することを好むとき。"
    },
    {
      "indent": 3,
      "text": "o If the working group decides that the information is still valuable (and needs to be kept current) after the I-D is published as an RFC, and the Implementation Status section had been removed from it.",
      "ja": "Oワーキンググループは、I-Dは、RFCとして公開され、実施状況のセクションがそれから除去された後の情報はまだ貴重な（かつ最新の状態に保たれる必要がある）であると判断した場合。"
    },
    {
      "indent": 3,
      "text": "It is highly desirable for all readers of the Internet-Draft to be made aware of this information. Initially, this can be done by replacing the Implementation Status section's contents with a URL pointing to the wiki. Later, the IETF Tools may support this functionality, e.g., by including such a link in the HTML file of the document, similar to the IPR link.",
      "ja": "インターネットドラフトのすべての読者は、この情報を認識させることが非常に望ましいです。最初は、これはウィキを指すURLと実施状況のセクションの内容を置き換えることによって行うことができます。その後、IETFツールは、IPRリンクに類似した文書のHTMLファイル内にそのようなリンクを含むことにより、例えば、この機能をサポートすることができます。"
    },
    {
      "indent": 3,
      "text": "If the implementation status is published separately from the I-D, then this information needs to be openly available without requiring authentication, registration, or access controls if it is to have any useful effects.",
      "ja": "実施状況は、I-Dとは別に公開されている場合、この情報は、任意の有用な効果を持っているのであれば、認証、登録、またはアクセス制御を必要とせずに公然と利用できるようにする必要があります。"
    },
    {
      "indent": 0,
      "text": "4. Benefits",
      "section_title": true,
      "ja": "4.メリット"
    },
    {
      "indent": 3,
      "text": "Publishing the information about implementations provides the working group with several benefits:",
      "ja": "実装についての情報を公開することは、いくつかの利点を持つワーキンググループを提供します。"
    },
    {
      "indent": 3,
      "text": "o Working group members, chairs, and ADs may use the information provided to help prioritize the progress of I-Ds, e.g., when there are several competing proposals to solve a particular problem.",
      "ja": "特定の問題を解決するには、いくつかの競合する提案がある場合、Oワーキンググループメンバー、椅子、そしてADSは、例えばI-DS、の進捗状況の優先順位付けを支援するために提供された情報を使用することができます。"
    },
    {
      "indent": 3,
      "text": "o Similarly, the information is useful when deciding whether the document should be progressed on a different track (individual submission, Experimental, etc.).",
      "ja": "文書が別のトラック（個々の提出、実験等）に進行すべきかどうかを決定する際O同様に、情報が有用です。"
    },
    {
      "indent": 3,
      "text": "o Making this information public and an explicit part of WG deliberations will motivate participants to implement protocol proposals, which in turn helps in discovering protocol flaws at an early stage.",
      "ja": "この情報を公開し、WGの審議の明示的な部分を作るoを順番に早い段階でのプロトコルの欠陥を発見するのに役立ちますこれは、プロトコルの提案を実装するために、参加者を動機となります。"
    },
    {
      "indent": 3,
      "text": "o Other participants can use the software to evaluate the usefulness of protocol features, its correctness (to some degree), and other properties, such as resilience and scalability.",
      "ja": "O他の参加者は、弾性および拡張性として、プロトコル機能、（ある程度）、その正確性、および他の特性の有用性を評価するためにソフトウェアを使用することができます。"
    },
    {
      "indent": 3,
      "text": "o WG members may choose to perform interoperability testing with known implementations, especially when they are publicly available.",
      "ja": "O WGのメンバーは、彼らが一般に公開されている場合は特に、既知の実装との相互運用性テストを実行することもできます。"
    },
    {
      "indent": 3,
      "text": "o In the case of open source, people may want to study the code to better understand the protocol and its limitations, determine if the implementation matches the protocol specification, and whether the protocol specification has omissions or ambiguities.",
      "ja": "Oオープンソースの場合は、人々がより良い実装がプロトコル仕様と一致し、プロトコル仕様は省略またはあいまいさを持っているかどうかかどうかを確認、プロトコルとその限界を理解するためのコードを勉強したいことがあります。"
    },
    {
      "indent": 3,
      "text": "o And lastly, some protocol features may be hard to understand, and for such features, the mere assurance that they can be implemented is beneficial. We note though that code should never be used in lieu of a clear specification.",
      "ja": "Oそして最後に、いくつかのプロトコル機能を理解するのは困難であってもよく、そのような特徴のために、彼らは実現できることを単なる保証が有益です。そのコードは、明確な仕様書の代わりに使用すべきではありませんけれども、我々は注意してください。"
    },
    {
      "indent": 3,
      "text": "We do not specify here whether and to what degree working groups are expected to prefer proposals that have \"running code\" associated with them, over others that do not.",
      "ja": "私たちは、どの程度のワーキンググループがない他の人の上にそれらに関連付けられている「コードを実行」している提案を、好むと予想されているかどうかを、ここで指定しないでください。"
    },
    {
      "indent": 0,
      "text": "5. Process Experiment",
      "section_title": true,
      "ja": "5.プロセスの実験"
    },
    {
      "indent": 3,
      "text": "The current proposal is proposed as an experiment. The inclusion of Implementation Status sections in Internet-Drafts is not mandatory, but the authors of this document wish to encourage authors of other Internet-Drafts to try out this simple mechanism to discover whether it is useful. Working group chairs are invited to suggest this mechanism to document editors in their working groups, and to draw the attention of their working group participants to Implementation Status sections where they exist.",
      "ja": "現在の提案は、実験として提案されています。インターネットドラフトでの実施状況のセクションを含めることは必須ではありませんが、この文書の著者は、それが有用であるかどうかを発見するために、この単純なメカニズムを試してみるために、他のインターネットドラフトの作成者を奨励したいです。ワーキンググループの議長は、そのワーキンググループでの編集者を文書化するために、このメカニズムを提案すること、およびそれらが存在する実施状況のセクションにそのワーキンググループ参加者の関心を引くために招待されています。"
    },
    {
      "indent": 3,
      "text": "Following a community discussion, it was concluded that [RFC3933] is not an appropriate framework for this experiment, primarily because no change is required to any existing process.",
      "ja": "コミュニティの議論に続いて、それは[RFC3933]は何の変更は、既存のプロセスに必要とされていない主な理由は、この実験のための適切なフレームワークではないと結論されました。"
    },
    {
      "indent": 0,
      "text": "5.1. Duration",
      "section_title": true,
      "ja": "5.1。期間"
    },
    {
      "indent": 3,
      "text": "Given the typical time to produce an RFC (see [Stats]), we propose a duration of 18 months for the experiment. Thus, 18 months after the date of publication of this document as an RFC, the authors will report on the experiment as described in the next section.",
      "ja": "RFCを生成する典型的な時間を考えると（[統計]を参照）、我々は実験のための18ヶ月の期間を提案します。次のセクションで説明したようにこのようにして、18ヶ月のRFCとしてこのドキュメントの発行日以降、筆者はこの実験について報告します。"
    },
    {
      "indent": 3,
      "text": "I-D authors are obviously free to include Implementation Status sections in their documents even after the experiment has concluded.",
      "ja": "I-Dの著者は明らかに実験が終了した後も、その文書に実施状況のセクションを含めることは自由です。"
    },
    {
      "indent": 0,
      "text": "5.2. Summary Report",
      "section_title": true,
      "ja": "5.2。概略報告"
    },
    {
      "indent": 3,
      "text": "The authors will summarize the results of the experiment at the end of the period assigned to the experiment (see Section 5.1). If nothing happens (no I-Ds or only a handful include an Implementation Status section), an email to the IETF list will be sufficient. This would obviously constitute a failure to adopt the idea and the authors will abandon the experiment.",
      "ja": "著者らは、実験に割り当てられた期間の終わりに、実験の結果を要約します（セクション5.1を参照してください）。何も起こらない場合は、IETFリストへの電子メールが十分になります（何もI-DSまたはほんの一握りは、実施状況のセクションが含まれていません）。これは明らかにアイデアを採用する失敗を構成するであろうと著者は実験を放棄します。"
    },
    {
      "indent": 3,
      "text": "If this idea is adopted by document authors, a summary I-D will be written containing the statistics of such adoption, as well as (necessarily subjective) reports by working group members, chairs, and area directors who have used this mechanism.",
      "ja": "このアイデアは、文書の作成者によって採用されている場合は、概要I-Dは、このメカニズムを使用しているワーキンググループのメンバー、椅子、および地域ディレクターによって、このような採用のほか、（必ずしも主観）レポートの統計情報を含む書き込まれます。"
    },
    {
      "indent": 3,
      "text": "The authors may then propose more wide-scale use of the process and might suggest more formal adoption of the process by the IETF.",
      "ja": "著者は、プロセスのより大規模な使用を提案することができるし、IETFによってプロセスのより正式採用を提案するかもしれません。"
    },
    {
      "indent": 0,
      "text": "5.3. Success Criteria",
      "section_title": true,
      "ja": "5.3。成功基準"
    },
    {
      "indent": 3,
      "text": "The goal of this experiment is to improve the quality of IETF specifications. This is impossible to quantify, of course. We suggest that generally positive answers to the following questions would indicate that the experiment was successful:",
      "ja": "この実験の目的は、IETF仕様の品質を向上させることです。もちろんこれは、定量化することは不可能です。我々は、次の質問に対する一般の正の答えは、実験が成功したことを示すであろうことを示唆しています："
    },
    {
      "indent": 3,
      "text": "o Did the working group make decisions that were more informed when comparing multiple competing solutions for the same work item?",
      "ja": "Oワーキンググループは、同じ作業項目に対して複数の競合ソリューションを比較したときに、より知らされた決定を下すましたか？"
    },
    {
      "indent": 3,
      "text": "o Did authors significantly modify proposed protocols based on implementation experience?",
      "ja": "O著者は大幅に実装経験に基づいて、提案プロトコルを変更しましたか？"
    },
    {
      "indent": 3,
      "text": "o Did disclosure of implementations encourage more interoperability testing than previously?",
      "ja": "Oの実装の開示は、以前よりも多くの相互運用性テストを奨励しましたか？"
    },
    {
      "indent": 3,
      "text": "o Did non-authors review documents based on interactions with running code and/or inspection of the code itself?",
      "ja": "Oコードおよび/またはコード自体の検査を実行しているとの相互作用に基づく非筆者のレビュー文書をしましたか？"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "This is a process document; therefore, it does not have a direct effect on the security of any particular IETF protocol. However, better-reviewed protocols are likely to also be more secure.",
      "ja": "これは、プロセスの文書です。したがって、それは特定のIETFプロトコルのセキュリティに直接影響を持っていません。しかし、より良いレビュープロトコルはまた、より安全である可能性が高いです。"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgements",
      "section_title": true,
      "ja": "7.謝辞"
    },
    {
      "indent": 3,
      "text": "We would like to thank Stephen Farrell, who reawakened community interest in this topic. Several reviewers provided important input, including Loa Andersson, Dave Crocker, Ned Freed, Christer Holmberg, Denis Ovsienko, and Curtis Villamizar.",
      "ja": "私たちは、このトピックのコミュニティの関心をreawakenedスティーブン・ファレルを、感謝したいと思います。いくつかのレビューはロア・アンダーソン、デイブ・クロッカー、ネッドフリード、クリステルHolmbergの、デニスOvsienko、およびカーティスVillamizarを含め、重要なインプットを提供しました。"
    },
    {
      "indent": 3,
      "text": "This document was originally prepared using the lyx2rfc tool, and we would like to thank Nico Williams, its author.",
      "ja": "この文書は、もともとlyx2rfcツールを使用して調製した、と私たちはニコ・ウィリアムズ、その作者に感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "8. Informative References",
      "section_title": true,
      "ja": "8.参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC1264] Hinden, R., \"Internet Engineering Task Force Internet Routing Protocol Standardization Criteria\", RFC 1264, October 1991.",
      "ja": "[RFC1264] HindenとR.、 \"インターネットエンジニアリングタスクフォースインターネットルーティングプロトコル標準化評価基準\"、RFC 1264、1991年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC3933] Klensin, J. and S. Dawkins, \"A Model for IETF Process Experiments\", BCP 93, RFC 3933, November 2004.",
      "ja": "[RFC3933] Klensin、J.及びS.ドーキンス、 \"IETFプロセスの実験のためのモデル\"、BCP 93、RFC 3933、2004年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC4794] Fenner, B., \"RFC 1264 Is Obsolete\", RFC 4794, December 2006.",
      "ja": "[RFC4794]フェナー、B.、 \"RFC 1264が廃止されました\"、RFC 4794、2006年12月。"
    },
    {
      "indent": 3,
      "text": "[Stats] Arkko, J., \"Distribution of Processing Times\", December 2012, <http://www.arkko.com/tools/lifecycle/wgdistr.html>.",
      "ja": "[統計] Arkko、J.、 \"処理時間の分布\"、2012年12月、<http://www.arkko.com/tools/lifecycle/wgdistr.html>。"
    },
    {
      "indent": 3,
      "text": "[Tao] Hoffman, P., Ed., \"The Tao of IETF: A Novice's Guide to the Internet Engineering Task Force\", November 2012, <http://www.ietf.org/tao.html>.",
      "ja": "[タオ]ホフマン、P.、エド、「IETFのタオ：インターネットエンジニアリングタスクフォースへの初心者ガイド」。、2012年11月、<http://www.ietf.org/tao.html>。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Yaron Sheffer Porticor",
      "ja": "ヤロンシェファーPorticor"
    },
    {
      "indent": 3,
      "text": "EMail: yaronf.ietf@gmail.com",
      "ja": "メールアドレス：yaronf.ietf@gmail.com"
    },
    {
      "indent": 3,
      "text": "Adrian Farrel Juniper Networks",
      "ja": "エードリアンファレルジュニパーネットワークス"
    },
    {
      "indent": 3,
      "text": "EMail: adrian@olddog.co.uk",
      "ja": "メールアドレス：adrian@olddog.co.uk"
    }
  ]
}