{
  "title": {
    "text": "RFC 6008 - Authentication-Results Registration for Differentiating among Cryptographic Results",
    "ja": "RFC 6008 - 暗号化結果のうち区別するための認証結果の登録"
  },
  "number": 6008,
  "created_at": "2019-10-26 21:21:13.393322+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                      M. Kucherawy\nRequest for Comments: 6008                               Cloudmark, Inc.\nCategory: Standards Track                                 September 2010\nISSN: 2070-1721",
      "raw": true
    },
    {
      "indent": 8,
      "text": "Authentication-Results Registration for Differentiating\n              among Cryptographic Results",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This memo updates the registry of properties in Authentication-Results: message header fields to allow a multiple-result report to distinguish among one or more cryptographic signatures on a message, thus associating specific results with the signatures they represent.",
      "ja": "このメモは、認証、結果のプロパティのレジストリを更新する：メッセージ・ヘッダ・フィールドを複数の結果のレポートは、このように、それらが表す署名と特定の結果を関連付ける、メッセージ上の1人のまたはそれ以上の暗号署名を区別することを可能にします。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6008.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6008で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2010 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2010 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . . . 2\n2.  Keywords  . . . . . . . . . . . . . . . . . . . . . . . . . . . 2\n3.  Discussion  . . . . . . . . . . . . . . . . . . . . . . . . . . 2\n4.  Definition  . . . . . . . . . . . . . . . . . . . . . . . . . . 3\n5.  IANA Considerations . . . . . . . . . . . . . . . . . . . . . . 4\n6.  Security Considerations . . . . . . . . . . . . . . . . . . . . 4\n  6.1.  Improvement . . . . . . . . . . . . . . . . . . . . . . . . 4\n  6.2.  Result Forgeries  . . . . . . . . . . . . . . . . . . . . . 4\n  6.3.  New Schemes with Small Signatures . . . . . . . . . . . . . 4\n7.  References  . . . . . . . . . . . . . . . . . . . . . . . . . . 5\n  7.1.  Normative References  . . . . . . . . . . . . . . . . . . . 5\n  7.2.  Informative References  . . . . . . . . . . . . . . . . . . 5\nAppendix A.  Authentication-Results Example . . . . . . . . . . . . 6\n  A.1.  Multiple DKIM Signatures with One Failure . . . . . . . . . 6\nAppendix B.  Acknowledgements . . . . . . . . . . . . . . . . . . . 7",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "[AUTHRES] defined a new header field for electronic mail messages that presents the results of a message authentication effort in a machine-readable format. Absent from that specification was the means by which the results of two cryptographic signatures, such as those provided by [DKIM], can both have results reported in an unambiguous manner.",
      "ja": "【AUTHRES]機械可読形式のメッセージ認証作業の結果を提示する電子メールメッセージのための新しいヘッダーフィールドを定義しました。その仕様は存在しないが、このような[DKIM]によって提供されるような2人の暗号署名の結果は、両方の明確な方法で報告された結果を有することができる手段でした。"
    },
    {
      "indent": 3,
      "text": "Fortunately, [AUTHRES] created IANA registries of reporting properties, enabling an easy remedy for this problem. This memo thus registers an additional reporting property allowing a result to be associated with a specific digital signature.",
      "ja": "幸い、[AUTHRES]この問題の簡単な救済策を有効にする、プロパティを報告するIANAレジストリを作成しました。このメモは、このように特定のデジタル署名に関連付けられる結果を可能にする追加のレポートのプロパティを登録します。"
    },
    {
      "indent": 0,
      "text": "2. Keywords",
      "section_title": true,
      "ja": "2.キーワード"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [KEYWORDS].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[キーワード]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "3. Discussion",
      "section_title": true,
      "ja": "3.ディスカッション"
    },
    {
      "indent": 3,
      "text": "A message can contain multiple signatures of a common sender authentication mechanism, such as [DKIM]. For example, a DomainKeys Identified Mail (DKIM) signer could apply signatures using two or more different message canonicalization algorithms to determine the resistance of each to being broken in transit.",
      "ja": "メッセージは、[DKIM]などの一般的な送信者認証メカニズムの複数の署名を含むことができます。例えば、ドメインキー・アイデンティファイド・メール（DKIM）署名者は、輸送中に破損され、各抵抗を決定するために、二つ以上の異なるメッセージの正規化アルゴリズムを使用して署名を適用することができます。"
    },
    {
      "indent": 3,
      "text": "By applying supported \"ptype.property\" combinations (cf. the ABNF in [AUTHRES]), a result can be associated with a given signature provided the signatures are all unique within one of the registered values (e.g., all of them had unique \"header.d\" or \"header.i\" values). This is not guaranteed, however; a single signing agent might have practical reasons for affixing multiple signatures with the same \"d=\" values while varying other signature parameters. This means one could get a \"dkim=pass\" and \"dkim=fail\" result simultaneously on verification, which is clearly ambiguous.",
      "ja": "（ABNF参照[AUTHRES]）でサポートされている「ptype.property」の組み合わせを適用することによって、結果が与えられた署名に関連付けることができる署名が登録された値のうちの1つの中にすべての固有提供される（例えば、それらのすべてが、「ユニークでしたheader.d」または \"header.i\" の値）。しかし、これは保証されません。単一署名エージェントは、他のシグニチャパラメータを変化させながら同じ「D =」値と複数の署名を固定するための実用的な理由があるかもしれません。これは、1つは、「DKIM =合格」と明らかに曖昧である、検証に同時に結果を「DKIM =失敗」を得ることができることを意味します。"
    },
    {
      "indent": 3,
      "text": "It is thus necessary either to create or to identify a signature attribute guaranteed to be unique, such that it is possible to unambiguously associate a result with the signature to which it refers.",
      "ja": "明確にそれが参照する署名との結果を関連付けることが可能であるように、このようにして作成するか、一意であることが保証署名属性を識別するためのいずれかが必要です。"
    },
    {
      "indent": 3,
      "text": "Collisions during general use of SHA1 and SHA256 are uncommon (see [HASH-ATTACKS]), and RSA key signing mechanisms are resilient to producing common substrings. Thus, the actual digital signature for a cryptographic signing of the message is an ideal property for such a unique identification. It is not, however, necessary to include the entire digital signature in an [AUTHRES] header field just to identify which result goes with which signature; since the signatures will almost always be substantially different, it is anticipated that only the first several bytes of a signature will be needed for disambiguating results.",
      "ja": "SHA1とSHA256の一般的な使用中に衝突が（[ハッシュ攻撃]参照）稀であり、RSA鍵署名メカニズムは、共通の部分文字列を生成するに弾性です。したがって、メッセージの暗号化署名のための実際のデジタル署名は、そのような固有の識別のための理想的な特性です。ちょうどその署名で行くた結果を識別するために[AUTHRES]ヘッダーフィールド全体のデジタル署名を含むように、しかし、必要ではありません。署名は、ほとんどの場合、実質的に異なることになるので、シグネチャの最初の数バイトが、結果を明確化するために必要とされるであろうことが予想されます。"
    },
    {
      "indent": 0,
      "text": "4. Definition",
      "section_title": true,
      "ja": "4.定義"
    },
    {
      "indent": 3,
      "text": "This memo adds the \"header.b\" reporting item to the IANA \"Email Authentication Methods\" registry created upon publication of [AUTHRES]. The value associated with this item in the header field MUST be at least the first eight characters of the digital signature (the \"b=\" tag from a DKIM-Signature) for which a result is being relayed, and MUST be long enough to be unique among the results being reported. Where the total length of the digital signature is fewer than eight characters, the entire signature MUST be included. Matching of the value of this item against the signature itself MUST be case-sensitive.",
      "ja": "このメモは[AUTHRES]の公表時に作成IANA「電子メール認証方式」のレジストリに「header.b」報告項目を追加します。ヘッダフィールドにこのアイテムに関連付けられた値は、結果が中継されているデジタル署名の少なくとも最初の8つの文字（「B =」DKIM-署名からタグ）でなければならない、とするのに十分に長くなければなりません報告された結果の中でユニーク。デジタル署名の合計の長さが8文字未満である場合、全体の署名を含まなければなりません。署名自体に対するこのアイテムの値の一致は、大文字と小文字を区別しなければなりません。"
    },
    {
      "indent": 3,
      "text": "If an evaluating agent observes that, despite the use of this disambiguating tag, unequal authentication results are offered about the same signature from the same trusted authserv-id, that agent SHOULD ignore all such results.",
      "ja": "評価エージェントは、この曖昧さ除去タグの使用にもかかわらず、不均等な認証結果が同じ信頼authServは-IDと同一の署名について提供されている、ことを観察した場合、そのエージェントは、すべてのそのような結果を無視すべきです。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "ja": "5. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "Per [IANA-CONSID], the following item is added to the \"Email Authentication Methods\" registry:",
      "ja": "[IANA-CONSID]ごとに、以下の項目は、「電子メール認証方式」のレジストリに追加されます。"
    },
    {
      "indent": 3,
      "text": "+------------+----------+--------+----------------+-----------------+\n|   Method   | Defined  | ptype  | property       | value           |\n+------------+----------+--------+----------------+-----------------+\n|    dkim    | RFC4871  | header | b              | full or partial |\n|            |          |        |                | value of        |\n|            |          |        |                | signature \"b\"   |\n|            |          |        |                | tag             |\n+------------+----------+--------+----------------+-----------------+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "[AUTHRES] discussed general security considerations regarding the use of this header field. The following new security considerations apply when adding or processing this new ptype/property combination:",
      "ja": "【AUTHRESこのヘッダフィールドの使用に関する一般的なセキュリティ問題について議論しました。この新しいp型/プロパティの組み合わせを追加したり、処理する際に、次の新しいセキュリティ上の考慮事項が適用されます。"
    },
    {
      "indent": 0,
      "text": "6.1. Improvement",
      "section_title": true,
      "ja": "6.1. 改善"
    },
    {
      "indent": 3,
      "text": "Rather than introducing a new security issue, this can be seen to fix a security weakness of the original specification: Useful information can now be obtained from results that could previously have been ambiguous and thus obscured or, worse, misinterpreted.",
      "ja": "むしろ、新たなセキュリティ上の問題を導入するよりも、これはオリジナルの仕様のセキュリティ上の弱点を修正するために見ることができます。お役立ち情報は、以前あいまいなので、隠れたか、悪化し、誤って解釈されている可能性の結果から得ることができます。"
    },
    {
      "indent": 0,
      "text": "6.2. Result Forgeries",
      "section_title": true,
      "ja": "6.2. 結果フォージェリ"
    },
    {
      "indent": 3,
      "text": "An attacker could copy a valid signature and add it to a message in transit, modifying some portion of it. This could cause two results to be provided for the same \"header.b\" value even if the entire \"b=\" string is used in an attempt to differentiate the results. This attack could cause an ambiguous result to be relayed and possibly neutralize any benefit given to a \"pass\" result that would have otherwise occurred, possibly impacting the delivery of valid messages.",
      "ja": "攻撃者は、有効な署名をコピーして、輸送中のメッセージに追加し、それのいくつかの部分を変更することができます。これは、二つの結果が全体の「B =」文字列が結果を区別しようとする試みで使用されている場合でも、同じ「header.b」値のために提供される可能性があります。この攻撃は中継され、おそらく、おそらく有効なメッセージの配信に影響を与える、そうでない場合は発生していた結果を「合格」に与えられたすべての利益を中和するために曖昧な結果を引き起こす可能性があります。"
    },
    {
      "indent": 3,
      "text": "It is worth noting, however, that a false negative (\"fail\") can be generated in this way, but it is extremely difficult to create a false positive (\"pass\") through such an attack. Thus, a cautious implementation could discard the false negative in that instance.",
      "ja": "これは、偽陰性（「不合格」）は、このように発生させることができる、しかし、注目に値するが、このような攻撃による偽陽性（「パス」）を作成することは非常に困難です。このように、慎重な実装は、そのインスタンスで偽陰性を捨てることができます。"
    },
    {
      "indent": 0,
      "text": "6.3. New Schemes with Small Signatures",
      "section_title": true,
      "ja": "6.3. 小署名した新しいスキーム"
    },
    {
      "indent": 3,
      "text": "Should a new signing scheme be introduced with a signature whose length is less than eight characters, Section 4 specifies that the entire signature must be used. The obvious concern in such a case would be that the signature scheme is itself prone to collisions, making the value reported by this field not useful. In such cases, the risk is created by the likelihood of collisions and not by this mechanism; furthermore, Section 4 recommends the results be ignored if that were to occur, preventing the application of an ambiguous result.",
      "ja": "新しい署名スキームは、長さが8文字未満である、第4節で全体の署名を使用しなければならないことを指定し、署名して導入すべきです。このような場合には自明の懸念は、署名方式は、このフィールドによって報告された値は有用ではないなって、衝突しやすい自体であることであろう。このような場合には、リスクは、この機構によって衝突の可能性によって作成されていません。また、第4節ではそれが発生した場合の結果があいまいな結果を適用することを防止する、無視することをお勧めします。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7.参考"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "ja": "7.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[AUTHRES] Kucherawy, M., \"Message Header Field for Indicating Message Authentication Status\", RFC 5451, April 2009.",
      "ja": "、RFC 5451、2009年4月 \"メッセージ認証ステータスを示すためのメッセージヘッダフィールド\" [AUTHRES] Kucherawy、M.、。"
    },
    {
      "indent": 3,
      "text": "[DKIM] Allman, E., Callas, J., Delany, M., Libbey, M., Fenton, J., and M. Thomas, \"DomainKeys Identified Mail (DKIM) Signatures\", RFC 4871, May 2007.",
      "ja": "[DKIM]オールマン、E.、カラス、J.、デラニー、M.、リビー、M.、フェントン、J.、およびM.トーマス、 \"ドメインキー・アイデンティファイド・メール（DKIM）署名\"、RFC 4871、2007年5月。"
    },
    {
      "indent": 3,
      "text": "[KEYWORDS] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[キーワード]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "ja": "7.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[HASH-ATTACKS] Hoffman, P. and B. Schneier, \"Attacks on Cryptographic Hashes in Internet Protocols\", RFC 4270, November 2005.",
      "ja": "[HASH攻撃]ホフマン、P.とB.シュナイアー、「インターネットプロトコルで暗号化ハッシュに対する攻撃」、RFC 4270、2005年11月。"
    },
    {
      "indent": 3,
      "text": "[IANA-CONSID] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 5226, May 2008.",
      "ja": "[IANA-CONSID] Narten氏、T.とH. Alvestrand、 \"RFCsにIANA問題部に書くためのガイドライン\"、BCP 26、RFC 5226、2008年5月。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Authentication-Results Example",
      "ja": "付録A.認証-結果の例"
    },
    {
      "indent": 3,
      "text": "This section presents an example of the use of this new item header field to indicate unambiguous authentication results.",
      "ja": "このセクションでは、明確な認証結果を示すために、この新しいアイテムのヘッダフィールドの使用例を示します。"
    },
    {
      "indent": 0,
      "text": "A.1. Multiple DKIM Signatures with One Failure",
      "ja": "A.1。一つの障害を持つ複数のDKIM署名"
    },
    {
      "indent": 3,
      "text": "A message that had two DKIM signatures applied by the same domain, one of which failed:",
      "ja": "同じドメインによって適用される2人のDKIM署名を持っていたメッセージ、のいずれかが失敗しました。"
    },
    {
      "indent": 8,
      "text": "Authentication-Results: mail-router.example.net;\n      dkim=pass (good signature) header.d=newyork.example.com\n            header.b=oINEO8hg;\n      dkim=fail (bad signature) header.d=newyork.example.com\n            header.b=EToRSuvU\nReceived: from newyork.example.com\n          (newyork.example.com [192.0.2.250])\n      by mail-router.example.net (8.11.6/8.11.6)\n          for <recipient@example.net>\n          with ESMTP id i7PK0sH7021929;\n      Fri, Feb 15 2002 17:19:22 -0800\nDKIM-Signature: v=1; a=rsa-sha256; s=rashani;\n      d=newyork.example.com;\n      t=1188964191; c=relaxed/simple;\n      h=From:Date:To:Message-Id:Subject;\n      bh=sEu28nfs9fuZGD/pSr7ANysbY3jtdaQ3Xv9xPQtS0m7=;\n      b=oINEO8hgn/gnunsg ... 9n9ODSNFSDij3=\nDKIM-Signature: v=1; a=rsa-sha256; s=rashani;\n      d=newyork.example.com;\n      t=1188964191; c=simple/simple;\n      h=From:Date:To:Message-Id:Subject;\n      bh=sEu28nfs9fuZGD/pSr7ANysbY3jtdaQ3Xv9xPQtS0m7=;\n      b=EToRSuvUfQVP3Bkz ... rTB0t0gYnBVCM=\nFrom: sender@newyork.example.com\nDate: Fri, Feb 15 2002 16:54:30 -0800\nTo: meetings@example.net\nMessage-Id: <12345.abc@newyork.example.com>\nSubject: here's a sample",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Example 1: Header field reporting results from multiple signatures added at initial signing",
      "ja": "実施例1：最初の署名に加え複数の署名からヘッダフィールドレポート結果"
    },
    {
      "indent": 3,
      "text": "Here we see an example of a message that was signed twice by the author's ADministrative Management Domain (ADMD). One signature used \"relaxed\" header canonicalization, and the other used \"simple\" header canonicalization; both used \"simple\" body canonicalization.",
      "ja": "ここでは、著者の管理管理ドメイン（ADMD）によって2回署名されたメッセージの例を参照してください。 1つのシグネチャは、「リラックス」ヘッダ正規化、および他の使用される「単純」ヘッダの正規化を使用します。両方の「簡単な」身体の正規化を使用していました。"
    },
    {
      "indent": 3,
      "text": "Presumably due to a change in one of the five header fields covered by the two signatures, the former signature passed, while the latter signature failed to verify. In particular, the \"relaxed\" header canonicalization of [DKIM] is resilient to changes in whitespace in the header, while \"simple\" is not, and the latter is the one that failed in this example.",
      "ja": "後者の署名が検証に失敗しながら、おそらく2つのシグネチャによって覆わ5つのヘッダフィールドのいずれかにおける変化に、前者署名は、渡されました。具体的には、「単純な」はないが[DKIM]の「緩和」ヘッダの正規化は、ヘッダ内の空白の変化に弾力的であり、後者は、この例では失敗したものです。"
    },
    {
      "indent": 3,
      "text": "The item registered by this memo allows an evaluation module to determine which DKIM result goes with which signature. Without the \"header.b\" portion of the result, it is unclear which one passed and which one failed.",
      "ja": "このメモが登録したアイテムは、DKIM結果がどの署名で行くかを決定する評価モジュールを可能にします。結果の「header.b」の部分がなければ、1つが渡され、そのいずれかが失敗したかは不明です。"
    },
    {
      "indent": 0,
      "text": "Appendix B. Acknowledgements",
      "ja": "付録B.謝辞"
    },
    {
      "indent": 3,
      "text": "The author wishes to acknowledge the following for their review and constructive criticism of this proposal: Dave Crocker, Tony Hansen, Eliot Lear, S. Moonesamy, and Alessandro Vesely.",
      "ja": "デイブ・クロッカー、トニー・ハンセン、エリオット・リア、S. Moonesamy、そしてアレッサンドロVesely：作者は彼らのレビューとこの提案の建設的な批判のために、以下を確認したいです。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Murray S. Kucherawy Cloudmark, Inc. 128 King St., 2nd Floor San Francisco, CA 94107 US",
      "ja": "マレーS. Kucherawyクラウドマーク社128キングセント、2階サンフランシスコ、CA 94107米国"
    },
    {
      "indent": 3,
      "text": "Phone: +1 415 946 3800 EMail: msk@cloudmark.com",
      "ja": "電話：+1 415 946 3800 Eメール：msk@cloudmark.com"
    }
  ]
}