{
  "title": {
    "text": "RFC 6248 - RFC 4148 and the IP Performance Metrics (IPPM) Registry of Metrics Are Obsolete",
    "ja": "RFC 6248 - RFC 4148およびIPパフォーマンスメトリック（IPPM）メトリックのレジストリは時代遅れです"
  },
  "number": 6248,
  "created_at": "2022-12-24 05:17:13.078336+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         A. Morton\nRequest for Comments: 6248                                     AT&T Labs\nObsoletes: 4148                                               April 2011\nUpdates: 4737, 5560, 5644, 6049\nCategory: Informational\nISSN: 2070-1721",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "RFC 4148 and the IP Performance Metrics (IPPM) Registry of Metrics Are Obsolete",
      "ja": "RFC 4148およびIPパフォーマンスメトリック（IPPM）メトリックのレジストリは時代遅れです"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This memo reclassifies RFC 4148, \"IP Performance Metrics (IPPM) Metrics Registry\", as Obsolete, and withdraws the IANA IPPM Metrics Registry itself from use because it is obsolete. The current registry structure has been found to be insufficiently detailed to uniquely identify IPPM metrics. Despite apparent efforts to find current or even future users, no one responded to the call for interest in the RFC 4148 registry during the second half of 2010.",
      "ja": "このメモは、RFC 4148「IP Performance Metrics（IPPM）Metricsレジストリ」を廃止し、IANA IPPMメトリックレジストリ自体を廃止されているため、使用しないように再分類します。現在のレジストリ構造は、IPPMメトリックを一意に識別するために不十分に詳細であることがわかっています。現在または将来のユーザーを見つけるための明らかな努力にもかかわらず、2010年後半にRFC 4148レジストリへの関心の呼びかけに誰も応答しませんでした。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントは、インターネット標準の追跡仕様ではありません。情報目的で公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントは、インターネットエンジニアリングタスクフォース（IETF）の製品です。IETFコミュニティのコンセンサスを表しています。公開レビューを受けており、インターネットエンジニアリングステアリンググループ（IESG）からの出版が承認されています。IESGによって承認されたすべてのドキュメントが、あらゆるレベルのインターネット標準の候補者ではありません。RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6248.",
      "ja": "このドキュメントの現在のステータス、任意のERRATA、およびそのフィードバックを提供する方法に関する情報は、http：//www.rfc-editor.org/info/rfc6248で取得できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2011 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2011 IETF Trustおよび文書著者として特定された人。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "このドキュメントは、BCP 78およびIETFドキュメント（http://trustee.ietf.org/license-info）に関連するIETF Trustの法的規定の対象となります。この文書に関するあなたの権利と制限を説明するので、これらの文書を注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、セクション4.Eで説明されている法的規定のセクション4.Eで説明されており、単純化されたBSDライセンスで説明されているように保証なしで提供される簡略化されたBSDライセンステキストを含める必要があります。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Action to Reclassify RFC 4148 and the Corresponding IANA\n   Registry as Obsolete ............................................3\n3. Security Considerations .........................................4\n4. IANA Considerations .............................................4\n5. Acknowledgements ................................................4\n6. References ......................................................5\n   6.1. Normative References .......................................5\n   6.2. Informative References .....................................5",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The IP Performance Metrics (IPPM) framework [RFC2330] describes several ways to record options and metric parameter settings, in order to account for sources of measurement variability. For example, Section 13 of [RFC2330] describes the notion of \"Type P\" so that metrics can be specified in general, but the specifics (such as payload length in octets and protocol type) can replace P to disambiguate the results.",
      "ja": "IPパフォーマンスメトリック（IPPM）フレームワーク[RFC2330]は、測定の変動の原因を説明するために、オプションとメトリックパラメーター設定を記録するいくつかの方法を説明しています。たとえば、[RFC2330]のセクション13では、メトリックを一般的に指定できるように「タイプP」の概念を説明していますが、詳細（オクテットのペイロード長やプロトコルタイプなど）はPを置き換えて結果を説明できます。"
    },
    {
      "indent": 3,
      "text": "When the IPPM Metrics Registry [RFC4148] was designed, the variability of the \"Type P\" notion, and the variability possible with the many metric parameters (see Section 4.2 of [RFC2679]), were not fully appreciated. Further, some of the early metric definitions only indicate Poisson streams [RFC2330] (see the metrics in [RFC2679], [RFC2680], and [RFC3393]), but later work standardized the methods for Periodic Stream measurements [RFC3432], adding to the variability possible when characterizing a metric exactly.",
      "ja": "IPPMメトリックレジストリ[RFC4148]が設計された場合、「タイプP」概念の変動性、および多くのメトリックパラメーターで可能な変動性（[RFC2679]のセクション4.2を参照）は十分に評価されませんでした。さらに、初期のメトリック定義の一部は、ポアソンストリーム[RFC2330]のみを示しています（[RFC2679]、[RFC2680]、[RFC3393]のメトリックを参照）が、その後の研究は、周期的なストリーム測定の方法[RFC3432]の方法を標準化しました。メトリックを正確に特徴付ける場合、可能な変動性。"
    },
    {
      "indent": 3,
      "text": "It is not believed to be feasible or even useful to register every possible combination of Type P, metric parameters, and Stream parameters using the current structure of the IPPM Metrics Registry.",
      "ja": "IPPMメトリックスレジストリの現在の構造を使用して、タイプP、メトリックパラメーター、およびストリームパラメーターのすべての可能な組み合わせを登録することは実現可能であるとは考えられていません。"
    },
    {
      "indent": 3,
      "text": "The IPPM Metrics Registry is believed to have very few users, if any. Evidence of this was provided by the fact that one registry entry was syntactically incorrect for months after [RFC5644] was published. The text \":=\" was used for the metrics in that document instead of \"::=\". It took eight months before someone offered that a parser found the error. Even the original registry author agrees that the current registry is not efficient, and has submitted a proposal to effectively create a new registry.",
      "ja": "IPPMメトリックレジストリには、ユーザーが非常に少ないと考えられています。この証拠は、[RFC5644]が公開されてから数か月間、1つのレジストリエントリが構文的に間違っていたという事実によって提供されました。テキスト \"：=\"は、 \":: =\"の代わりにそのドキュメントのメトリックに使用されました。パーサーがエラーを見つけたことを誰かが申し出るまでに8か月かかりました。元のレジストリ著者でさえ、現在のレジストリが効率的ではないことに同意し、新しいレジストリを効果的に作成するという提案を提出しました。"
    },
    {
      "indent": 3,
      "text": "Despite apparent efforts to find current or even future users, no one responded to the call for interest in the RFC 4148 registry during the second half of 2010. Therefore, the IETF now declares the registry Obsolete without any further reservations.",
      "ja": "現在または将来のユーザーを見つけるための明らかな努力にもかかわらず、2010年後半にRFC 4148レジストリへの関心の呼びかけに誰も応答しませんでした。"
    },
    {
      "indent": 3,
      "text": "When a registry is designated Obsolete, it simply prevents the IANA from registering new objects, in this case new metrics. So, even if a registry user was eventually found, they could continue to use the current registry, and its contents will continue to be available.",
      "ja": "レジストリが時代遅れに指定されると、IANAが新しいオブジェクト、この場合は新しいメトリックの登録を防ぐだけです。したがって、たとえレジストリユーザーが最終的に見つかったとしても、現在のレジストリを使用し続けることができ、その内容は引き続き利用可能になります。"
    },
    {
      "indent": 3,
      "text": "The most recently published memo that added metrics to the registry is [RFC6049]. This memo updates all previous memos that registered new metrics, including [RFC4737] and [RFC5560], so that the registry's Obsolete status will be evident.",
      "ja": "レジストリにメトリックを追加した最近公開されたメモは[RFC6049]です。このメモは、[RFC4737]や[RFC5560]を含む新しいメトリックを登録した以前のすべてのメモを更新しているため、レジストリの時代遅れのステータスが明らかになります。"
    },
    {
      "indent": 0,
      "text": "2. Action to Reclassify RFC 4148 and the Corresponding IANA Registry as Obsolete",
      "section_title": true,
      "ja": "2. RFC 4148と対応するIANAレジストリを時代遅れに再分類するためのアクション"
    },
    {
      "indent": 3,
      "text": "Due to the ambiguities between the current metrics registrations and the metrics used, and the apparent minimal adoption of the registry in practice, it is required that:",
      "ja": "現在のメトリック登録と使用されているメトリックとの間のあいまいさと、実際にレジストリの明らかな最小限の採用により、次のことが必要です。"
    },
    {
      "indent": 3,
      "text": "o the IETF reclassify [RFC4148] as Obsolete.",
      "ja": "o IETFは、[RFC4148]を廃止します。"
    },
    {
      "indent": 3,
      "text": "o the IANA withdraw the current IPPM Metrics Registry from further updates and note that it too is Obsolete.",
      "ja": "o IANAは、現在のIPPMメトリックレジストリをさらなる更新から撤回し、それも時代遅れであることに注意してください。"
    },
    {
      "indent": 3,
      "text": "It is assumed that parties who wish to establish a replacement registry function will work to specify such a registry.",
      "ja": "置換レジストリ機能を確立したい当事者は、そのようなレジストリを指定するために機能すると想定されています。"
    },
    {
      "indent": 0,
      "text": "3. Security Considerations",
      "section_title": true,
      "ja": "3. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "This memo and its recommendations have no known impact on the security of the Internet (especially if there is a zombie apocalypse on the day it is published; humans will have many more security issues to worry about stemming from the rise of the un-dead).",
      "ja": "このメモとその推奨事項は、インターネットのセキュリティに既知の影響を与えません（特に、公開された日にゾンビの黙示録がある場合、人間は、UNDEADの台頭に起因することを心配することにより多くのセキュリティの問題を抱えています）。"
    },
    {
      "indent": 0,
      "text": "4. IANA Considerations",
      "section_title": true,
      "ja": "4. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "Metrics defined in the IETF have been typically registered in the IANA IPPM Metrics Registry as described in the initial version of the registry [RFC4148]. However, areas for improvement of this registry have been identified, and the registry structure has to be revisited when there is working group consensus to do so.",
      "ja": "IETFで定義されたメトリックは、通常、レジストリ[RFC4148]の初期バージョンで説明されているように、IANA IPPMメトリックレジストリに登録されています。ただし、このレジストリの改善領域が特定されており、ワーキンググループのコンセンサスがある場合は、レジストリ構造を再検討する必要があります。"
    },
    {
      "indent": 3,
      "text": "The current consensus is to designate the IPPM Metrics Registry, originally described in [RFC4148], as Obsolete.",
      "ja": "現在のコンセンサスは、もともと[RFC4148]に記載されているIPPMメトリックレジストリを廃止されたものとして指定することです。"
    },
    {
      "indent": 3,
      "text": "The DESCRIPTION of the registry MIB has been modified as follows, and the first two sentences should be included on any IANA-maintained web page describing this registry or its contents:",
      "ja": "レジストリMIBの説明は次のように変更されており、最初の2つの文は、このレジストリまたはその内容を説明するIANAが管理するWebページに含める必要があります。"
    },
    {
      "indent": 3,
      "text": "DESCRIPTION",
      "ja": "説明"
    },
    {
      "indent": 6,
      "text": "\"With the approval and publication of RFC 6248, this module is designated Obsolete.",
      "ja": "「RFC 6248の承認と公開により、このモジュールは時代遅れに指定されています。"
    },
    {
      "indent": 6,
      "text": "The registry will no longer be updated, and the current contents will be maintained as-is on the day that RFC 6248 was published.",
      "ja": "レジストリは更新されなくなり、現在の内容はRFC 6248が公開された日に維持されます。"
    },
    {
      "indent": 6,
      "text": "The original Description text follows below:",
      "ja": "元の説明テキストは以下に次のとおりです。"
    },
    {
      "indent": 6,
      "text": "This module defines a registry for IP Performance Metrics.",
      "ja": "このモジュールは、IPパフォーマンスメトリックのレジストリを定義します。"
    },
    {
      "indent": 6,
      "text": "... \"",
      "ja": "...」"
    },
    {
      "indent": 0,
      "text": "5. Acknowledgements",
      "section_title": true,
      "ja": "5. 謝辞"
    },
    {
      "indent": 3,
      "text": "Henk Uijterwaal suggested additional rationale for the recommendation in this memo.",
      "ja": "Henk Uijterwaalは、このメモの推奨について追加の根拠を提案しました。"
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "ja": "6. 参考文献"
    },
    {
      "indent": 0,
      "text": "6.1. Normative References",
      "section_title": true,
      "ja": "6.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC4148] Stephan, E., \"IP Performance Metrics (IPPM) Metrics Registry\", BCP 108, RFC 4148, August 2005.",
      "ja": "[RFC4148] Stephan、E。、「IPパフォーマンスメトリック（IPPM）メトリックレジストリ」、BCP 108、RFC 4148、2005年8月。"
    },
    {
      "indent": 0,
      "text": "6.2. Informative References",
      "section_title": true,
      "ja": "6.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[RFC2330] Paxson, V., Almes, G., Mahdavi, J., and M. Mathis, \"Framework for IP Performance Metrics\", RFC 2330, May 1998.",
      "ja": "[RFC2330] Paxson、V.、Almes、G.、Mahdavi、J。、およびM. Mathis、「IPパフォーマンスメトリックのフレームワーク」、RFC 2330、1998年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC2679] Almes, G., Kalidindi, S., and M. Zekauskas, \"A One-way Delay Metric for IPPM\", RFC 2679, September 1999.",
      "ja": "[RFC2679] Almes、G.、Kalidindi、S。、およびM. Zekauskas、「IPPMの一方向遅延メトリック」、RFC 2679、1999年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC2680] Almes, G., Kalidindi, S., and M. Zekauskas, \"A One-way Packet Loss Metric for IPPM\", RFC 2680, September 1999.",
      "ja": "[RFC2680] Almes、G.、Kalidindi、S。、およびM. Zekauskas、「IPPMの一元配置パケット損失メトリック」、RFC 2680、1999年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC3393] Demichelis, C. and P. Chimento, \"IP Packet Delay Variation Metric for IP Performance Metrics (IPPM)\", RFC 3393, November 2002.",
      "ja": "[RFC3393] Demichelis、C。およびP. Chimento、「IPパフォーマンスメトリックのIPパケット遅延変動メトリック（IPPM）」、RFC 3393、2002年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC3432] Raisanen, V., Grotefeld, G., and A. Morton, \"Network performance measurement with periodic streams\", RFC 3432, November 2002.",
      "ja": "[RFC3432] Raisanen、V.、Grotefeld、G。、およびA. Morton、「周期的なストリームによるネットワークパフォーマンス測定」、RFC 3432、2002年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC4737] Morton, A., Ciavattone, L., Ramachandran, G., Shalunov, S., and J. Perser, \"Packet Reordering Metrics\", RFC 4737, November 2006.",
      "ja": "[RFC4737] Morton、A.、Ciavattone、L.、Ramachandran、G.、Shalunov、S。、およびJ. Perser、「Packet Redoring Metrics」、RFC 4737、2006年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC5560] Uijterwaal, H., \"A One-Way Packet Duplication Metric\", RFC 5560, May 2009.",
      "ja": "[RFC5560] Uijterwaal、H。、「一元配置パケット複製メトリック」、RFC 5560、2009年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC5644] Stephan, E., Liang, L., and A. Morton, \"IP Performance Metrics (IPPM): Spatial and Multicast\", RFC 5644, October 2009.",
      "ja": "[RFC5644] Stephan、E.、Liang、L。、およびA. Morton、「IP Performance Metrics（IPPM）：Spatial and Multicast」、RFC 5644、2009年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC6049] Morton, A. and E. Stephan, \"Spatial Composition of Metrics\", RFC 6049, January 2011.",
      "ja": "[RFC6049]モートン、A。およびE.ステファン、「メトリックの空間構成」、RFC 6049、2011年1月。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者の連絡先"
    },
    {
      "indent": 3,
      "text": "Al Morton AT&T Labs 200 Laurel Avenue South Middletown, NJ 07748 USA",
      "ja": "Al Morton AT＆T Labs 200 Laurel Avenue South Middletown、NJ 07748 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 732 420 1571\nFax:   +1 732 368 1192\nEMail: acmorton@att.com\nURI:   http://home.comcast.net/~acmacm/",
      "raw": true,
      "ja": ""
    }
  ]
}