{
  "title": {
    "text": "RFC 6596 - The Canonical Link Relation",
    "ja": "RFC 6596 - Canonicalのリンク関係"
  },
  "number": 6596,
  "created_at": "2019-10-28 04:21:59.790507+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                           M. Ohye\nRequest for Comments: 6596                                      J. Kupke\nCategory: Informational                                       April 2012\nISSN: 2070-1721",
      "raw": true
    },
    {
      "indent": 22,
      "text": "The Canonical Link Relation",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "RFC 5988 specifies a way to define relationships between links on the web. This document describes a new type of such a relationship, \"canonical\", to designate an Internationalized Resource Identifier (IRI) as preferred over resources with duplicative content.",
      "ja": "RFC 5988は、ウェブ上のリンクの間の関係を定義する方法を指定します。この文書では、重複コンテンツを含むリソース上好ましいものとして国際リソース識別子（IRI）を指定するために、「標準的な」、このような関係の新しいタイプを記述する。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 IESGによって承認されていないすべての文書がインターネットStandardのどんなレベルの候補です。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6596.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6596で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2012 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2012 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "The canonical link relation specifies the preferred IRI from resources with duplicative content. Common implementations of the canonical link relation are to specify the preferred version of an IRI from duplicate pages created with the addition of IRI parameters (e.g., session IDs) or to specify the single-page version as preferred over the same content separated on multiple component pages.",
      "ja": "標準的なリンク関係は、重複コンテンツとリソースから優先IRIを指定します。カノニカルリンク関係の一般的な実装は、IRIパラメータを加えて作成した重複ページからIRIの好ましいバージョンを指定する（例えば、セッションID）を、または複数の成分に分離された同じコンテンツよりも好ましいような単一ページのバージョンを指定しますページ。"
    },
    {
      "indent": 3,
      "text": "In regard to the link relation type, \"canonical\" can be described informally as the author's preferred version of a resource. More formally, the canonical link relation specifies the preferred IRI from a set of resources that return the context IRI's content in duplicated form. Once specified, applications such as search engines can focus processing on the canonical, and references to the context (referring) IRI can be updated to reference the target (canonical) IRI.",
      "ja": "リンク関係の種類に関しては、「標準的な」は、リソースの著者の優先バージョンとして非公式に記述することができます。より正式に、正規のリンク関係は、重複した形でのコンテキストIRIの内容を返すリソースのセットから優先IRIを指定します。一度そのような検索エンジンのような用途には、正規の処理を集中することができ、コンテキストへの言及は、（参照）IRIは、ターゲット（カノニカル）IRIを参照するように更新することができ、指定されました。"
    },
    {
      "indent": 0,
      "text": "2. Notational Conventions",
      "section_title": true,
      "ja": "2.表記規則"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "3. The Canonical Link Relation",
      "section_title": true,
      "ja": "3.正規リンク関係"
    },
    {
      "indent": 3,
      "text": "The target (canonical) IRI MUST identify content that is either duplicative or a superset of the content at the context (referring) IRI. Authors who declare the canonical link relation ought to anticipate that applications such as search engines can:",
      "ja": "ターゲット（カノニカル）IRIは、重複またはコンテキスト（参照）IRIにおけるコンテンツのスーパーセットのいずれかであるコンテンツを識別しなければなりません。正規のリンク関係を宣言する著者は、検索エンジンなどのアプリケーションができると予想するべきです："
    },
    {
      "indent": 3,
      "text": "o Index content only from the target IRI (i.e., content from the context IRIs will be likely disregarded as duplicative).",
      "ja": "OのみターゲットIRIからインデックスコンテンツ（すなわち、文脈からコンテンツアイリス可能性として重複無視されます）。"
    },
    {
      "indent": 3,
      "text": "o Consolidate IRI properties, such as link popularity, to the target IRI.",
      "ja": "OターゲットIRIには、そのようなリンクの人気としてIRIのプロパティを、統合します。"
    },
    {
      "indent": 3,
      "text": "o Display the target IRI as the representative IRI.",
      "ja": "O代表IRIとしてターゲットIRIを表示します。"
    },
    {
      "indent": 3,
      "text": "The target (canonical) IRI MAY:",
      "ja": "ターゲット（正規の）IRI MAY："
    },
    {
      "indent": 3,
      "text": "o Specify a relative IRI (see [RFC3986], Section 4.2).",
      "ja": "O（[RFC3986]、セクション4.2を参照）相対IRIを指定します。"
    },
    {
      "indent": 3,
      "text": "o Be self-referential (context IRI identical to target IRI).",
      "ja": "O自己参照（IRIをターゲットと同じ文脈IRI）が必要です。"
    },
    {
      "indent": 3,
      "text": "o Exist on a different hostname or domain.",
      "ja": "O異なるホスト名またはドメイン上に存在します。"
    },
    {
      "indent": 3,
      "text": "o Have different scheme names, such as \"http\" to \"https\" or \"gopher\" to \"ftp\".",
      "ja": "Oなど「http」を「https」または「ゴーファー」を「FTP」など、さまざまなスキーム名を、持っています。"
    },
    {
      "indent": 3,
      "text": "o Be a superset of the content at the context IRI.",
      "ja": "OコンテキストIRIのコンテンツのスーパーセットです。"
    },
    {
      "indent": 6,
      "text": "* As an example, each component page (e.g., page-1.html, page-2.html) of a multi-page article MAY specify the \"view-all\" version (e.g., page-all.html), the superset of their content, as the target IRI. This is because the content from each component page is contained within the view-all version. Given this implementation, applications can mark page-1.html and page-2.html as duplicates of page-all.html, process content only from page-all.html, and disregard the component pages. All references can then be made to the view-all version (page-all.html, the target IRI), and no content will have been lost in this process.",
      "ja": "*一例として、複数ページの記事の各成分ページ（例えば、ページ1.html、ページ-2.html）は、スーパーセットを「ビュー全て」のバージョン（例えば、ページall.html）を指定MAYその内容の、ターゲットIRIとして。各コンポーネントページのコンテンツがビューすべてのバージョン内に含まれているためです。この実装を考えると、アプリケーションはページall.htmlの複製、ページのみ-all.htmlから処理内容としてページ-1.htmlとページ-2.htmlをマークし、コンポーネントのページを無視することができます。すべての参照は、ビュー、すべてのバージョン（ページ-all.html、ターゲットIRI）を行うことができ、そして何のコンテンツが、この過程で失われていないでしょう。"
    },
    {
      "indent": 6,
      "text": "* Using the same example above, page-2.html SHOULD NOT designate page-1.html as the target (canonical) IRI because this may cause a loss of data. When page-2.html designates page-1.html as the canonical, only content from the target IRI, page-1.html, will be processed. page-2.html may be marked as a duplicate of page-1.html and its content disregarded.",
      "ja": "上記と同じ例を使用*これはデータの損失を引き起こす可能性があるため、ページ-2.htmlは、ターゲット（カノニカル）IRIとしてページ-1.htmlを指定すべきではありません。ページ-2.htmlがターゲットIRI、ページ-1.htmlから正規の、唯一のコンテンツとしてページ-1.htmlを指定すると、処理されます。ページ-2.htmlは、ページ-1.html、その内容は無視の重複としてマークすることができます。"
    },
    {
      "indent": 3,
      "text": "o Be the source IRI of a temporary redirect. For HTTP, this refers to status codes 302, 303, or 307 (Sections 10.3.3, 10.3.4, and 10.3.8, respectively, of [RFC2616]).",
      "ja": "O一時的なリダイレクトのソースIRIう。 HTTPの場合、これはステータスコード302、303、または307（[RFC2616]のセクションそれぞれ10.3.3、10.3.4および10.3.8、、）を指します。"
    },
    {
      "indent": 3,
      "text": "To better ensure that applications properly handle the canonical link relation, administrators ought to consider the following guidelines:",
      "ja": "より良いアプリケーションが適切に正規のリンク関係を扱うことを保証するために、管理者は、次のガイドラインを考慮するべきです："
    },
    {
      "indent": 3,
      "text": "o Specify only one canonical link relation for a resource. (It would be confusing to consider/label/designate more than one IRI as authoritative.)",
      "ja": "Oリソースのための唯一の正規のリンク関係を指定します。 （権威として、複数のIRIを指定/ /ラベルを検討するために混乱することでしょう。）"
    },
    {
      "indent": 3,
      "text": "o Avoid designating the target (canonical) as:",
      "ja": "Oとして、（正規の）ターゲットを指定しないでください。"
    },
    {
      "indent": 6,
      "text": "* The source IRI of a permanent redirect (for HTTP, this refers to 300 and 301 response codes, defined in Sections 10.3.1 and 10.3.2 of [RFC2616]).",
      "ja": "*永久リダイレクトのソースIRIは、（HTTPのために、このセクション10.3.1および10.3.2に定義された300と301応答コードを指す[RFC2616]）。"
    },
    {
      "indent": 6,
      "text": "* An IRI that also specifies a canonical link relation to an IRI other than itself.",
      "ja": "*また、自分以外のIRIへの正規のリンク関係を指定しIRI。"
    },
    {
      "indent": 6,
      "text": "* An IRI that returns an error code, such as a 4xx response in HTTP (Section 10.4 of [RFC2616]).",
      "ja": "*このようなHTTPで4XXレスポンスとして、エラーコードを返しIRI（セクション10.4 [RFC2616]）。"
    },
    {
      "indent": 6,
      "text": "* The first page of a multi-page article or multi-page listing of items (since the first page is not duplicative or a superset of the context IRI). For example, page-2.html and page-3.html of an article SHOULD NOT specify page-1.html as the canonical. This may cause a loss of data from page-2.html and page-3.html as they will be marked duplicative of page-1.html with only content from page-1.html being processed.",
      "ja": "*マルチページ物品またはアイテムの複数ページのリストの最初のページ（最初のページ以降は重複しないか、または文脈IRIのスーパーセット）。例えば、物品のページ-2.htmlとページ-3.htmlは、正規のように、ページ-1.htmlを指定しないでください。彼らは処理されているページ-1.htmlからのコンテンツのみを持つページ-1.htmlの重複としてマークされますので、これはページ-2.htmlとページ-3.htmlからのデータの損失を引き起こす可能性があります。"
    },
    {
      "indent": 3,
      "text": "When the canonical link relation is declared improperly, such as creating chained canonicals (i.e., target IRI specifies the source IRI of a permanent redirect) or designating a target IRI that returns a 4xx response, applications can use their own heuristics when processing the resource. For instance, an application can choose to ignore any improper canonical designation and continue to process the remaining content on a page.",
      "ja": "正規のリンク関係を4XXレスポンスを返すようにIRIを連鎖canonicalsを作成する（すなわち、ターゲットIRIはソース永久リダイレクトのIRIを指定する）、またはターゲットを指定するように、不適切に宣言されたときにリソースを処理するとき、アプリケーションは、独自のヒューリスティックを使用することができます。例えば、アプリケーションは、任意の不適切な正規の指定を無視し、ページ上の残りのコンテンツを処理し続けることを選択することができます。"
    },
    {
      "indent": 0,
      "text": "4. Examples",
      "section_title": true,
      "ja": "4.例"
    },
    {
      "indent": 3,
      "text": "The following example illustrates:",
      "ja": "次の例は示しています。"
    },
    {
      "indent": 3,
      "text": "o Three IRIs that serve duplicate content.",
      "ja": "重複したコンテンツを提供する三のIRIは、O。"
    },
    {
      "indent": 3,
      "text": "o One IRI that is the canonical or \"preferred version\".",
      "ja": "標準的なまたは「優先バージョン」である一つのIRI O。"
    },
    {
      "indent": 3,
      "text": "o Two IRIs with additional query parameters, making them the non-preferred version of the content (duplicates). The canonical link relation is therefore specified on these duplicates.",
      "ja": "それらにコンテンツ（重複）の非優先バージョンを作成する追加のクエリパラメータを持つ2つの虹彩、O。標準的なリンク関係は、したがって、これらの重複に指定されています。"
    },
    {
      "indent": 3,
      "text": "If the preferred version of a IRI and its content exists at:",
      "ja": "IRIとその内容の好ましいバージョンがで存在する場合："
    },
    {
      "indent": 3,
      "text": "http://www.example.com/page.php?item=purse",
      "ja": "ｈっｔｐ：／／ｗっｗ。えぁｍｐぇ。こｍ／ぱげ。ｐｈｐ？いてｍ＝ぷｒせ"
    },
    {
      "indent": 3,
      "text": "Then duplicate content IRIs such as:",
      "ja": "その後のようなコンテンツアイリスを複製します："
    },
    {
      "indent": 3,
      "text": "http://www.example.com/page.php?item=purse&category=bags http://www.example.com/page.php?item=purse&category=bags&sid=1234",
      "ja": "ｈっｔｐ：／／ｗっｗ。えぁｍｐぇ。こｍ／ぱげ。ｐｈｐ？いてｍ＝ぷｒせ＆かてごｒｙ＝ばｇｓ ｈっｔｐ：／／ｗっｗ。えぁｍｐぇ。こｍ／ぱげ。ｐｈｐ？いてｍ＝ぷｒせ＆かてごｒｙ＝ばｇｓ＆しｄ＝１２３４"
    },
    {
      "indent": 3,
      "text": "may designate the canonical link relation in HTML as specified in [REC-html401-19991224]:",
      "ja": "で指定されたHTMLにおける正規リンク関係を指定することができる[REC-html401-19991224]："
    },
    {
      "indent": 3,
      "text": "<link rel=\"canonical\" href=\"http://www.example.com/page.php?item=purse\">",
      "ja": "<Link rel = \"canonical\" というのhref = \"http://www.example.com/page.php?item=purse\">"
    },
    {
      "indent": 3,
      "text": "or as a relative IRI:",
      "ja": "または相対IRIのように："
    },
    {
      "indent": 3,
      "text": "<link rel=\"canonical\" href=\"page.php?item=purse\"> or alternatively, in the HTTP header field as specified in Section 5 of [RFC5988]:",
      "ja": "[RFC5988]のセクション5で指定されたHTTPヘッダフィールドの代わりに<リンクRELは=「カノニカル」HREFが=「page.phpアイテム=財布？」>または、。"
    },
    {
      "indent": 3,
      "text": "Link: <http://www.example.com/page.php?item=purse>; rel=\"canonical\"",
      "ja": "リンク：<http://www.example.com/page.php?item=purse>。 rel = \"標準的な\""
    },
    {
      "indent": 3,
      "text": "This signals to applications, such as search engines, that these are duplicates of the target (canonical) IRI:",
      "ja": "これは、これらがターゲット（カノニカル）IRIの複製であることを、このような検索エンジンなどのアプリケーション、への信号。"
    },
    {
      "indent": 3,
      "text": "http://www.example.com/page.php?item=purse.",
      "ja": "ｈっｔｐ：／／ｗっｗ。えぁｍｐぇ。こｍ／ぱげ。ｐｈｐ？いてｍ＝ぷｒせ。"
    },
    {
      "indent": 3,
      "text": "Applications may then select the canonical value as the display IRI (such as in search results), and additional IRI properties such as indexing and ranking signals can be transferred as well.",
      "ja": "アプリケーションは、（例えば、検索結果のように）表示IRIとして正規値を選択してもよく、そしてそのような索引付けおよび順位信号のような追加のIRI特性も転送することができます。"
    },
    {
      "indent": 0,
      "text": "5. Recommendations",
      "section_title": true,
      "ja": "5.勧告"
    },
    {
      "indent": 3,
      "text": "Before adding the canonical link relation, verification of the following is RECOMMENDED:",
      "ja": "正規のリンク関係を追加する前に、以下の検証をお勧めします。"
    },
    {
      "indent": 3,
      "text": "1. The content of the context IRI is duplicated within the content of the target (canonical) IRI.",
      "ja": "1.コンテキストIRIの含有量は、標的（カノニカル）IRIのコンテンツ内で複製されます。"
    },
    {
      "indent": 3,
      "text": "2. For HTTP, permanent HTTP redirects (Section 10.3.2 of [RFC2616]), the traditional strong indicator that a IRI's content has been permanently moved, could not be implemented in place of the canonical link relation.",
      "ja": "2. HTTP、永久的なHTTPリダイレクト（[RFC2616]のセクション10.3.2）の場合、IRIのコンテンツが永続的に移動されていること、伝統的な強力な指標は、正規のリンク関係の代わりに実装することができませんでした。"
    },
    {
      "indent": 3,
      "text": "3. In the case where the target (canonical) IRI is a superset of content from the context IRI (i.e., the case where page-1.html and page-2.html designate page-all.html as the canonical), that the user experience is strongly taken into consideration, both in regard to possible increased load time and potential complexity in navigation.",
      "ja": "ターゲット（カノニカル）IRIは、コンテキストIRI（カノニカルようすなわち、ケースページ1.htmlとページ-2.html指名ページ-all.html）からコンテンツのスーパーセットである場合には3ユーザーエクスペリエンスが強く、両方の可能性の増加、ロード時間やナビゲーションの潜在的な複雑さに関して、考慮されています。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has registered the Canonical Link Relation below as per [RFC5988].",
      "ja": "IANAは[RFC5988]あたりとして以下Canonicalのリンク関係を登録しています。"
    },
    {
      "indent": 3,
      "text": "Relation Name:",
      "ja": "リレーション名："
    },
    {
      "indent": 6,
      "text": "canonical",
      "ja": "標準的な"
    },
    {
      "indent": 3,
      "text": "Description:",
      "ja": "説明："
    },
    {
      "indent": 6,
      "text": "Designates the preferred version of a resource (the IRI and its contents).",
      "ja": "リソース（IRIおよびその内容）の好ましいバージョンを指定します。"
    },
    {
      "indent": 3,
      "text": "Reference:",
      "ja": "参照："
    },
    {
      "indent": 6,
      "text": "This specification.",
      "ja": "この仕様。"
    },
    {
      "indent": 3,
      "text": "Notes:",
      "ja": "ノート："
    },
    {
      "indent": 6,
      "text": "None.",
      "ja": "無し。"
    },
    {
      "indent": 3,
      "text": "Application Data:",
      "ja": "アプリケーションデータ："
    },
    {
      "indent": 6,
      "text": "None.",
      "ja": "無し。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "ja": "7.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "When a site is compromised, the canonical link relation can be implemented with malicious intent to designate the attacker's IRI as the preferred version of the content. While this technique is largely unnoticeable to humans, automated programs may cluster the compromised resource as duplicative of the attacker's target IRI, transferring properties such as link popularity away from the compromised resource to the attacker's designated canonical. (Naturally, even a site that is not compromised could provide inaccurate or misleading information about which URI is canonical.)",
      "ja": "サイトが侵害された場合、正規のリンク関係は、コンテンツの優先バージョンとして攻撃者のIRIを指定する悪意で実現することができます。この技術は、ヒトへの大部分が目立たないですが、自動化されたプログラムは、攻撃者が指定した正規のに離れ妥協リソースから、このようなリンクの人気などのプロパティを転送し、攻撃者のターゲットIRIのように重複妥協したリソースをクラスタ化します。 （当然のことながら、妥協しなくても、サイトには、URIが正規のであるかについて不正確または誤解を招くような情報を提供することができます。）"
    },
    {
      "indent": 0,
      "text": "8. Internationalization Considerations",
      "section_title": true,
      "ja": "8.国際化に関する注意事項"
    },
    {
      "indent": 3,
      "text": "Internationalization considerations for link relations are provided in Section 8 of [RFC5988].",
      "ja": "リンク関係のための国際化の考慮事項は、[RFC5988]のセクション8で提供されています。"
    },
    {
      "indent": 0,
      "text": "9. Normative References",
      "section_title": true,
      "ja": "9.引用規格"
    },
    {
      "indent": 3,
      "text": "[REC-html401-19991224] Raggett, D., Le Hors, A., and I. Jacobs, \"HTML 4.01 Specification\", W3C Recommendation REC-html401-19991224, December 1999, <http://www.w3.org/TR/1999/REC-html401-19991224>.",
      "ja": "[REC-html401-19991224] Raggett、D.、ル・オードブル、A.、およびI.ジェイコブス、 \"HTML 4.01仕様書\"、W3C勧告REC-html401-19991224、1999年12月、<http://www.w3.org / TR / 1999 / REC-html401-19991224>。"
    },
    {
      "indent": 14,
      "text": "Latest version available at\n<http://www.w3.org/TR/html401>.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2616] Fielding, R., Gettys, J., Mogul, J., Frystyk, H., Masinter, L., Leach, P., and T. Berners-Lee, \"Hypertext Transfer Protocol -- HTTP/1.1\", RFC 2616, June 1999.",
      "ja": "[RFC2616]フィールディング、R.、ゲティス、J.、モーグル、J.、Frystyk、H.、Masinter、L.、リーチ、P.、およびT.バーナーズ - リー、 \"ハイパーテキスト転送プロトコル -  HTTP / 1.1\" 、RFC 2616、1999年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC3986] Berners-Lee, T., Fielding, R., and L. Masinter, \"Uniform Resource Identifier (URI): Generic Syntax\", STD 66, RFC 3986, January 2005.",
      "ja": "[RFC3986]バーナーズ - リー、T.、フィールディング、R.、およびL. Masinter、 \"ユニフォームリソース識別子（URI）：汎用構文\"、STD 66、RFC 3986、2005年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC5988] Nottingham, M., \"Web Linking\", RFC 5988, October 2010.",
      "ja": "[RFC5988]ノッティンガム、M.、 \"ウェブリンク\"、RFC 5988、2010年10月。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Implementations",
      "ja": "付録A.実装"
    },
    {
      "indent": 3,
      "text": "Automated programs that implement functionality with regard for the canonical link relation include:",
      "ja": "正規のリンク関係を考慮して機能を実装する自動化されたプログラムは、次のとおりです。"
    },
    {
      "indent": 3,
      "text": "o Google, canonical link relation HTML and HTTP header support, within the same domain and across domains:",
      "ja": "同じドメイン内およびドメイン間で、グーグル、正規のリンク関係のHTMLやHTTPヘッダのサポート○："
    },
    {
      "indent": 6,
      "text": "* <http://googlewebmastercentral.blogspot.com/2009/02/ specify-your-canonical.html>",
      "ja": "* <http://googlewebmastercentral.blogspot.com/2009/02/指定-あなた-canonical.html>"
    },
    {
      "indent": 6,
      "text": "* <http://googlewebmastercentral.blogspot.com/2011/06/ supporting-relcanonical-http-headers.html>",
      "ja": "* <http://googlewebmastercentral.blogspot.com/2011/06/支援-relcanonical-HTTP-headers.html>"
    },
    {
      "indent": 6,
      "text": "* <http://googlewebmastercentral.blogspot.com/2009/12/ handling-legitimate-cross-domain.html>",
      "ja": "* <http://googlewebmastercentral.blogspot.com/2009/12/取り扱い-正当なクロスdomain.html>"
    },
    {
      "indent": 3,
      "text": "o Yahoo, canonical link relation HTML support within the same domain:",
      "ja": "Oヤフー、同じドメイン内の標準的なリンク関係のHTMLのサポート："
    },
    {
      "indent": 6,
      "text": "* <http://www.ysearchblog.com/2009/02/12/ fighting-duplication-adding-more-arrows-to-your-quiver/>",
      "ja": "* <http://www.ysearchblog.com/2009/02/12/戦闘-重複-追加-より-矢印ツーあなた-矢筒/>"
    },
    {
      "indent": 3,
      "text": "o Bing, canonical link relation HTML support within the same domain:",
      "ja": "Oビング、同じドメイン内の標準的なリンク関係のHTMLのサポート："
    },
    {
      "indent": 6,
      "text": "* <http://www.bing.com/community/site_blogs/b/webmaster/archive/ 2009/02/12/ partnering-to-help-solve-duplicate-content-issues.aspx>",
      "ja": "* <http://www.bing.com/community/site_blogs/b/webmaster/archive/ 2009/02/12 /提携ツーヘルプ解決-重複コンテンツissues.aspx>"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Maile Ohye",
      "ja": "マイレOhye"
    },
    {
      "indent": 3,
      "text": "EMail: maileohye@gmail.com URI: http://maileohye.com/",
      "ja": "電子メール：maileohye@gmail.com URI：http://maileohye.com/"
    },
    {
      "indent": 3,
      "text": "Joachim Kupke",
      "ja": "ヨアヒム・浴場"
    },
    {
      "indent": 3,
      "text": "EMail: joachim@kupke.za.net",
      "ja": "メールアドレス：joachim@kupke.za.net"
    }
  ]
}