{
  "title": {
    "text": "RFC 6942 - Diameter Support for the EAP Re-authentication Protocol (ERP)",
    "ja": "RFC 6942 - EAP再認証プロトコル（ERP）のための直径のサポート"
  },
  "number": 6942,
  "created_at": "2019-11-01 23:33:27.755620+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                      J. Bournelle\nRequest for Comments: 6942                                     L. Morand\nCategory: Standards Track                                    Orange Labs\nISSN: 2070-1721                                               S. Decugis\n                                                           INSIDE Secure\n                                                                   Q. Wu\n                                                                  Huawei\n                                                                 G. Zorn\n                                                             Network Zen\n                                                                May 2013",
      "raw": true
    },
    {
      "indent": 5,
      "text": "Diameter Support for the EAP Re-authentication Protocol (ERP)",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "The EAP Re-authentication Protocol (ERP) defines extensions to the Extensible Authentication Protocol (EAP) to support efficient re-authentication between the peer and an EAP Re-authentication (ER) server through a compatible authenticator. This document specifies Diameter support for ERP. It defines a new Diameter ERP application to transport ERP messages between an ER authenticator and the ER server, and a set of new Attribute-Value Pairs (AVPs) that can be used to transport the cryptographic material needed by the re-authentication server.",
      "ja": "EAP再認証プロトコル（ERP）は、互換性のオーセンティケータを介してピア及びEAP再認証（ER）サーバとの間の効率的な再認証をサポートするために拡張認証プロトコル（EAP）への拡張を定義します。この文書では、ERPのための直径のサポートを指定します。これはER認証及びERサーバ、および再認証サーバによって必要とされる暗号化材料を輸送するために使用することができる新しい属性値ペア（AVPの）のセットとの間のERPメッセージを輸送する新しい直径ERPアプリケーションを定義します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6942.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6942で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2013 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2013 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   3\n2.  Terminology . . . . . . . . . . . . . . . . . . . . . . . . .   3\n  2.1.  Requirements Language . . . . . . . . . . . . . . . . . .   4\n3.  Assumptions . . . . . . . . . . . . . . . . . . . . . . . . .   4\n4.  Protocol Overview . . . . . . . . . . . . . . . . . . . . . .   5\n5.  Bootstrapping the ER Server . . . . . . . . . . . . . . . . .   6\n  5.1.  Bootstrapping during the Initial EAP Authentication . . .   6\n  5.2.  Bootstrapping during the First Re-authentication  . . . .   8\n6.  Re-authentication . . . . . . . . . . . . . . . . . . . . . .  11\n7.  Application Id  . . . . . . . . . . . . . . . . . . . . . . .  12\n8.  AVPs  . . . . . . . . . . . . . . . . . . . . . . . . . . . .  13\n  8.1.  ERP-RK-Request AVP  . . . . . . . . . . . . . . . . . . .  13\n  8.2.  ERP-Realm AVP . . . . . . . . . . . . . . . . . . . . . .  13\n  8.3.  Key AVP . . . . . . . . . . . . . . . . . . . . . . . . .  13\n    8.3.1.  Key-Type AVP  . . . . . . . . . . . . . . . . . . . .  13\n    8.3.2.  Keying-Material AVP . . . . . . . . . . . . . . . . .  13\n    8.3.3.  Key-Name AVP  . . . . . . . . . . . . . . . . . . . .  14\n    8.3.4.  Key-Lifetime AVP  . . . . . . . . . . . . . . . . . .  14\n9.  Result-Code AVP Values  . . . . . . . . . . . . . . . . . . .  14\n  9.1.  Permanent Failures  . . . . . . . . . . . . . . . . . . .  14\n10. IANA Considerations . . . . . . . . . . . . . . . . . . . . .  14\n  10.1.  Diameter Application Identifier  . . . . . . . . . . . .  14\n  10.2.  New AVPs . . . . . . . . . . . . . . . . . . . . . . . .  15\n  10.3.  New Permanent Failures Result-Code AVP Values  . . . . .  15\n11. Security Considerations . . . . . . . . . . . . . . . . . . .  15\n12. Contributors  . . . . . . . . . . . . . . . . . . . . . . . .  16\n13. Acknowledgements  . . . . . . . . . . . . . . . . . . . . . .  16\n14. References  . . . . . . . . . . . . . . . . . . . . . . . . .  16\n  14.1.  Normative References . . . . . . . . . . . . . . . . . .  16\n  14.2.  Informative References . . . . . . . . . . . . . . . . .  17",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "Cao, et al. [RFC6696] defines the EAP Re-authentication Protocol (ERP). It consists of the following steps:",
      "ja": "ツァオら。 [RFC6696]はEAP再認証プロトコル（ERP）を定義します。これは、次の手順で構成されます。"
    },
    {
      "indent": 3,
      "text": "Bootstrapping",
      "ja": "ブートストラップ"
    },
    {
      "indent": 6,
      "text": "A root key for re-authentication is derived from the Extended Master Session Key (EMSK) created during EAP authentication [RFC5295]. This root key is transported from the EAP server to the ER server.",
      "ja": "再認証のためのルートキーは、EAP認証[RFC5295]中に作成された拡張マスターセッションキー（EMSK）に由来しています。このルートキーは、ERサーバにEAPサーバから輸送されます。"
    },
    {
      "indent": 3,
      "text": "Re-authentication",
      "ja": "再認証"
    },
    {
      "indent": 6,
      "text": "A one-round-trip exchange between the peer and the ER server, resulting in mutual authentication. To support the EAP re-authentication functionality, ERP defines two new EAP codes -- EAP-Initiate and EAP-Finish.",
      "ja": "相互認証が得られたピアとERサーバ間の1往復交換、。 EAP再認証機能をサポートするために、ERPは、2つの新しいEAPコードを定義 -  EAP-開始し、EAP-フィニッシュ。"
    },
    {
      "indent": 3,
      "text": "This document defines how Diameter transports the ERP messages during the re-authentication process. For this purpose, we define a new Application Identifier for ERP and reuse the Diameter EAP commands Diameter-EAP-Request (DER) / Diameter-EAP-Answer (DEA).",
      "ja": "この文書では、直径が再認証プロセス中にERPのメッセージを転送する方法を定義します。この目的のために、我々は、ERPのための新しいアプリケーション識別子を定義し、直径を再利用するEAPは、Diameter-EAP要求（DER）/直径-EAP-回答（DEA）を指示します。"
    },
    {
      "indent": 3,
      "text": "This document also discusses the distribution of the root key during bootstrapping, in conjunction with either the initial EAP authentication (implicit bootstrapping) or the first ERP exchange (explicit bootstrapping). Security considerations for this key distribution are detailed in Section 7.4 of Salowey, et al. [RFC5295].",
      "ja": "この文書はまた、初期EAP認証（暗黙ブートストラップ）又は第ERP交換（明示的なブートストラップ）のいずれかと組み合わせて、ブートストラップ時のルートキーの分布を論じています。このキー配布のためのセキュリティの考慮事項がら、Saloweyのセクション7.4に詳述されています。 [RFC5295]。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "ja": "2.用語"
    },
    {
      "indent": 3,
      "text": "This document uses terminology defined in Aboba, et al. [RFC3748], Salowey, et al. [RFC5295], Cao, et al. [RFC6696], and Eronen, et al. [RFC4072].",
      "ja": "この文書らAboba、で定義された用語を使用します。 [RFC3748]、Salowey、ら。 [RFC5295]、ツァオら。 [RFC6696]、およびEronenら。 [RFC4072]。"
    },
    {
      "indent": 3,
      "text": "Following RFC 5295, the term \"domain\" herein refers to a key management domain unless otherwise qualified. Similarly, the terms \"home domain\" and \"local domain\" have the same meaning here as in RFC 6696.",
      "ja": "RFC 5295に続いて、「ドメイン」という用語は、本明細書にそう修飾しない限り、鍵管理ドメインを指します。同様に、用語「ホームドメイン」と「ローカルドメイン」は、RFC 6696のように、ここで同じ意味を持ちます。"
    },
    {
      "indent": 3,
      "text": "The re-authentication Domain-Specific Root Key (rDSRK) is a re-authentication Root Key (rRK) [RFC6696] derived from the Domain-Specific Root Key (DSRK) instead of the EMSK.",
      "ja": "再認証ドメイン固有のルートキー（rDSRK）は、ドメイン固有のルートキー（DSRK）の代わりに、EMSKから誘導再認証ルート鍵（RRK）[RFC6696]です。"
    },
    {
      "indent": 3,
      "text": "\"Root key\" (RK) or \"bootstrapping material\" refers to the rRK or rDSRK derived from an EMSK, depending on whether the ER server is located in the home or a foreign domain.",
      "ja": "「ルートキー」（RK）、又は「ブートストラップ材料は、」ERサーバがホームまたは外部ドメインに位置しているかどうかに応じて、EMSKから導出さRRKまたはrDSRKを指します。"
    },
    {
      "indent": 3,
      "text": "We use the notation \"ERP/DER\" and \"ERP/DEA\" in this document to refer to Diameter-EAP-Request and Diameter-EAP-Answer commands with the Application Id set to <Diameter ERP> (Section 10.1); the same commands are denoted \"EAP/DER\" and \"EAP/DEA\" when the Application Id in the message is set to <Diameter EAP> [RFC4072].",
      "ja": "我々は<直径ERP>（セクション10.1）に設定されたアプリケーションIDを持つコマンドのDiameter-EAP-要求とDiameter-EAP-回答を参照するために本書では表記「ERP / DER」を使用して、「ERP / DEA」。同じコマンドは、「EAP / DER」とメッセージ内のアプリケーションIDが<直径EAP> [RFC4072]に設定されている「EAP / DEA」を付しています。"
    },
    {
      "indent": 0,
      "text": "2.1. Requirements Language",
      "section_title": true,
      "ja": "2.1。要件言語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "3. Assumptions",
      "section_title": true,
      "ja": "3.仮定"
    },
    {
      "indent": 3,
      "text": "This document assumes the existence of, at most, one logical ER server entity in a given domain. If several physical servers are deployed for robustness, a replication mechanism must be deployed to synchronize the ERP state (e.g., root keys) between these servers. Any such replication mechanism is outside the scope of this document. If multiple ER servers are deployed in the domain, we assume that they can be used interchangeably. If multiple ER servers are deployed across multiple domains, we assume that only one ER server, topologically close to the peer, is involved in ERP, with distance being measured in terms of Diameter hops.",
      "ja": "この文書は、特定のドメインに、最大で1つの論理ERサーバエンティティの存在を前提としています。複数の物理サーバが堅牢性のために配備されている場合は、レプリケーションメカニズムは、これらのサーバー間のERPの状態（例えば、ルートキー）を同期するために展開する必要があります。そのような任意のレプリケーションメカニズムは、この文書の範囲外です。複数のERサーバがドメインにデプロイされている場合、我々は、彼らが交換可能に使用することができることを前提としています。複数のERサーバが複数のドメインにまたがって配置されている場合は、我々は、Diameterホップの観点から測定された距離で、ピアにトポロジ的に近いだけ1台のERサーバは、ERPに関与していることを前提としています。"
    },
    {
      "indent": 3,
      "text": "This document also assumes the existence of, at most, one EAP server entity in the home domain. In case of multiple physical home EAP servers, if the ER server wants to reach the same home EAP server, the ER server SHOULD cache the Destination-Host AVP corresponding to the home EAP server it requests.",
      "ja": "また、このドキュメントでは、最大で、ホームドメイン内の1つのEAPサーバエンティティの存在を前提としています。 ERサーバが同じホームEAPサーバに到達したい場合は、複数の物理ホームEAPサーバの場合は、ERサーバは要求ホームEAPサーバに対応する宛先ホストAVPをキャッシュすべきです。"
    },
    {
      "indent": 3,
      "text": "In general, it is assumed that key management domain names and Diameter realm names are identical for any given domain/realm.",
      "ja": "一般的には、鍵管理ドメイン名および直径レルム名は、任意のドメイン/領域で同一であると仮定する。"
    },
    {
      "indent": 0,
      "text": "4. Protocol Overview",
      "section_title": true,
      "ja": "4.プロトコルの概要"
    },
    {
      "indent": 3,
      "text": "The following figure illustrates the components involved in ERP and their interactions.",
      "ja": "次の図は、ERPに含まれるコンポーネントとそれらの相互作用を示しています。"
    },
    {
      "indent": 3,
      "text": "                        Diameter                    +--------+\n        +-------------+   ERP   +-----------+  (*)  |  Home  |\nPeer <->|Authenticator|<=======>| ER server | <---> |  EAP   |\n        +-------------+         +-----------+       | server |\n                                                    +--------+\n(*) Diameter EAP application; explicit bootstrapping scenario only.",
      "raw": true
    },
    {
      "indent": 22,
      "text": "Figure 1: Diameter ERP Overview",
      "ja": "図1：直径ERPの概要"
    },
    {
      "indent": 3,
      "text": "The ER server is located either in the home domain (same as the EAP server) or in the local domain (same as the authenticator, when it differs from the home domain).",
      "ja": "（それがホームドメインと異なる場合、オーセンティケータと同じ）ERサーバは、（EAPサーバと同じ）ホームドメインまたはローカルドメインのいずれかに位置しています。"
    },
    {
      "indent": 3,
      "text": "When the peer initiates an ERP exchange, the authenticator creates a DER message [RFC4072]. The Application Id of the message is set to that of the Diameter ERP application (Section 10.1) in the message. The generation of the ERP/DER message is detailed in Section 6.",
      "ja": "ピアがERPの交換を開始したときに、オーセンティケータはDERメッセージ[RFC4072]を生成します。メッセージのアプリケーションIDは、メッセージの直径のERPアプリケーション（セクション10.1）のものに設定されています。 ERP / DERメッセージの生成は、第6章に詳述されています。"
    },
    {
      "indent": 3,
      "text": "If there is an ER server in the same domain as the authenticator (i.e., the local domain), Diameter routing MUST be configured so that this ERP/DER message reaches that server, even if the Destination-Realm is not the same as the local domain.",
      "ja": "ERサーバがオーセンティケータと同じドメイン（すなわち、ローカルドメイン）内に存在する場合、このERP / DERメッセージは、そのサーバに到達するように、直径のルーティングは、宛先レルムがローカルと同じでない場合であっても、構成されなければなりませんドメイン。"
    },
    {
      "indent": 3,
      "text": "If there is no local ER server, the message is routed according to its Destination-Realm AVP content, extracted from the realm component of the keyName-NAI attribute. As specified in RFC 6696, this realm is the home domain of the peer in the case of bootstrapping exchange ('B' flag is set in ERP message) or the domain of the bootstrapped ER server otherwise.",
      "ja": "ローカルERサーバが存在しない場合、メッセージはkeyNameの-NAI属性の領域コンポーネントから抽出し、その宛先領域AVP内容に従ってルーティングされます。 RFC 6696で指定されているように、この領域は、（「B」フラグがERPメッセージに設定されている）、または他の方法でブートストラップERサーバのドメインブートストラップ交換の場合には、ピアのホームドメインです。"
    },
    {
      "indent": 3,
      "text": "If no ER server is available in the home domain either, the ERP/DER message cannot be delivered and an error, DIAMETER_UNABLE_TO_DELIVER, MUST be generated, as specified in RFC 6733, and returned to the authenticator. The authenticator MAY cache this information (with limited duration) to avoid further attempts to execute ERP with this realm. It MAY also fallback to full EAP authentication to authenticate the peer.",
      "ja": "何ERサーバは、いずれかのホームドメインで利用できない場合は、ERP / DERメッセージは配信できないと、エラー、DIAMETER_UNABLE_TO_DELIVERは、RFC 6733で指定され、生成され、オーセンティケータに戻す必要があります。オーセンティケータは、この分野でERPを実行するためのさらなる試みを避けるために（限られた期間で）この情報をキャッシュしてもよいです。また、ピアを認証するために、完全なEAP認証にフォールバックするかもしれません。"
    },
    {
      "indent": 3,
      "text": "When an ER server receives the ERP/DER message, it searches its local database for a valid, unexpired root key matching the keyName part of the User-Name AVP. If such key is found, the ER server processes the",
      "ja": "ERサーバは、ERP / DERメッセージを受信すると、ユーザー名AVPのキー名の部分に一致する有効な、期限が切れていないルートキーのためのローカルデータベースを検索します。そのようなキーが見つかった場合、ERサーバが処理し"
    },
    {
      "indent": 3,
      "text": "ERP message, as described in RFC 6696, then creates the ERP/DEA answer, as described in Section 6. The re-authentication Master Session Key (rMSK) is included in this answer.",
      "ja": "RFC 6696で説明したようにERPメッセージ、その後、再認証のマスターセッションキー（rMSK）は第6節で説明したように、ERP / DEAの解答を作成しますが、この答えに含まれています。"
    },
    {
      "indent": 3,
      "text": "Finally, the authenticator extracts the rMSK from the ERP/DEA, as described in RFC 6696, and forwards the content of the EAP-Payload AVP, the EAP-Finish/Re-auth message, to the peer.",
      "ja": "最後に、オーセンティケータは、RFC 6696に記載されているように、ERP / DEAからrMSKを抽出し、ピアに、EAPペイロードAVP、EAP-終了/再認証メッセージの内容を転送します。"
    },
    {
      "indent": 3,
      "text": "The ER server may or may not possess the root key in its local database. If the EAP-Initiate/Re-auth message has its 'B' flag set (bootstrapping exchange) and the ER server possesses the root key, the ER server SHOULD respond directly to the peer that initiated the ERP exchange. Otherwise, the ER server SHOULD act as a proxy and forward the message to the home EAP server after changing its Application Id to Diameter EAP and adding the ERP-RK-Request AVP to request the root key. See Section 5 for more detail on this process.",
      "ja": "ERサーバは、またはそのローカルデータベース内のルートキーを所有していない場合があります。 EAP-開始/再認証メッセージが「B」フラグが設定（ブートストラップ交換）を有し、ERサーバがルート鍵を有する場合、ERサーバは、ERPの交換を開始したピアに直接応答する必要があります。それ以外の場合は、ERサーバがプロキシとして動作し、直径EAPにそのアプリケーションIDを変更し、ルートキーを要求するERP-RK-要求AVPを追加した後、ホームEAPサーバへメッセージを転送する必要があります。このプロセスの詳細については、セクション5を参照してください。"
    },
    {
      "indent": 0,
      "text": "5. Bootstrapping the ER Server",
      "section_title": true,
      "ja": "5. ERサーバのブートストラップ"
    },
    {
      "indent": 3,
      "text": "The bootstrapping process involves the home EAP server and the ER server, but also impacts the peer and the authenticator. In ERP, the peer must derive the same keying material as the ER server. To achieve this, it must learn the domain name of the ER server. How this information is acquired is outside the scope of this specification, but the authenticator might be configured to advertise this domain name, especially in the case of re-authentication after a handover.",
      "ja": "ブートストラッププロセスは、ホームEAPサーバとERサーバでなく、影響ピアと認証を必要とします。 ERPでは、ピアは、ERサーバーと同じ鍵素材を引き出す必要があります。これを達成するためには、ERサーバのドメイン名を学ばなければなりません。この情報を取得する方法は、この仕様の範囲外ですが、オーセンティケータは、特にハンドオーバ後の再認証の場合には、このドメイン名を宣伝するように構成することがあります。"
    },
    {
      "indent": 3,
      "text": "The bootstrapping of an ER server with a given root key happens either during the initial EAP authentication of the peer when the EMSK -- from which the root key is derived -- is created, during the first re-authentication, or sometime between those events. We only consider the first two possibilities in this specification, in the following subsections.",
      "ja": "ルートキーが由来する -   - 第1の再認証時に、作成された、またはいつかこれらのイベントの間に与えられたルートキーとERサーバのブートストラップは、EMSKがピアの初期EAP認証時のいずれかで起こります。私たちは以下のサブセクションでは、この仕様では最初の二つの可能性を検討します。"
    },
    {
      "indent": 0,
      "text": "5.1. Bootstrapping during the Initial EAP Authentication",
      "section_title": true,
      "ja": "5.1。初期のEAP認証時にブートストラップ"
    },
    {
      "indent": 3,
      "text": "Bootstrapping the ER server during the initial EAP authentication (also known as implicit bootstrapping) offers the advantage that the server is immediately available for re-authentication of the peer, thus minimizing the re-authentication delay. On the other hand, it is possible that only a small number of peers will use re-authentication in the local domain. Deriving and caching key material for all the peers (for example, for the peers that do not support ERP) is a waste of resources and should be avoided.",
      "ja": "初期EAP認証（暗黙ブートストラップとしても知られている）中のERサーバのブートストラップは、したがって再認証遅延を最小限に、サーバは、ピアの再認証のためにすぐに利用可能であるという利点を提供します。一方、ピアの数が少ないローカルドメインに再認証を使用することも可能です。導出すると（例えば、ERPをサポートしていないピアの）すべてのピアのためのキーマテリアルをキャッシュすることは資源の無駄であり、避けるべきです。"
    },
    {
      "indent": 3,
      "text": "To achieve implicit bootstrapping, the ER server acts as a Diameter EAP Proxy, and Diameter routing MUST be configured so that Diameter EAP application messages are routed through this proxy. The figure below illustrates this mechanism.",
      "ja": "暗黙的なブートストラップを達成するために、ERサーバは、Diameter EAPプロキシとして機能し、そして直径EAPアプリケーション・メッセージは、このプロキシを介してルーティングされるように、直径のルーティングを設定する必要があります。下の図は、このメカニズムを示しています。"
    },
    {
      "indent": 3,
      "text": "                         ER server &\nAuthenticator             EAP Proxy               Home EAP server\n=============            ===========              ===============\n     ------------------------->\n         Diameter EAP/DER\n          (EAP-Response)\n                               ------------------------->\n                                  Diameter EAP/DER\n                                   (EAP-Response)\n                                  (ERP-RK-Request)",
      "raw": true
    },
    {
      "indent": 8,
      "text": "<==================================================>\n   Multi-round Diameter EAP exchanges, unmodified",
      "raw": true
    },
    {
      "indent": 8,
      "text": "                          <-------------------------\n                              Diameter EAP/DEA\n                               (EAP-Success)\n                                   (MSK)\n                              (Key AVP (rRK))\n<-------------------------\n    Diameter EAP/DEA\n      (EAP-Success)\n          (MSK)\n       [ERP-Realm]",
      "raw": true
    },
    {
      "indent": 8,
      "text": "Figure 2: ERP Bootstrapping during Full EAP Authentication",
      "ja": "図2：ERPブートストラップ全EAP認証中に"
    },
    {
      "indent": 3,
      "text": "The authenticator creates the first DER of the full EAP authentication and sends it to the ER server. The ER server proxies the first DER of the full EAP authentication and adds the ERP-RK-Request AVP inside, then forwards the request to the home EAP server.",
      "ja": "オーセンティケータは、完全なEAP認証の最初のDERを作成し、ERサーバに送信します。 ERサーバープロキシの完全なEAP認証の最初のDERと内部のERP-RK-要求AVPを追加するには、その後、ホームEAPサーバに要求を転送します。"
    },
    {
      "indent": 3,
      "text": "If the home Diameter server does not support the Diameter ERP extensions, it simply ignores the ERP-RK-Request AVP and continues as specified in RFC 4072 [RFC4072]. If the server supports the ERP extensions, it saves the value of the ERP-Realm AVP found inside the ERP-RK-Request AVP, and continues with the EAP authentication. When the authentication completes, if it is successful and the EAP method has generated an EMSK, the server MUST derive the rRK as specified in RFC 6696, using the saved ERP realm name. It then includes the rRK inside a Key AVP (Section 8.3) with the Key-Type AVP set to rRK, before sending the DEA as usual.",
      "ja": "[RFC4072]をホームDiameterサーバは直径ERP拡張をサポートしていない場合、それは単にERP-RK-要求AVPを無視し、RFC 4072で指定され続けています。サーバーは、ERPの機能拡張をサポートしている場合、それはERP-RK-要求AVPの中に発見ERP-レルムAVPの値を保存し、EAP認証を続行します。認証が完了すると、それが成功したとEAPメソッドがEMSKを生成した場合は保存されたERPのレルム名を使用して、RFC 6696で指定され、サーバはRRKを導出しなければなりません。その後、いつものようにDEAを送信する前に、RRKに設定キータイプAVPとキーAVP（セクション8.3）の内側にRRKが含まれています。"
    },
    {
      "indent": 3,
      "text": "When the ER server proxies a Diameter-EAP-Answer message with a Session-Id corresponding to a message to which it added an ERP-RK-Request AVP, and the Result-Code is DIAMETER_SUCCESS, it MUST examine the message and save and remove any Key AVP (Section 8.3) with Key-Type AVP set to rRK. If the message does not contain such a Key AVP, the ER server may cache the information that re-authentication via ERP is not possible for the session in order to avoid any subsequent attempts. In any case, the information stored in the ER server concerning a session should not have a lifetime greater than the EMSK for this session.",
      "ja": "ときERサーバープロキシセッションIdそれはERP-RK-要求AVPを追加するメッセージに対応した直径-EAP-Answerメッセージ、および結果-コードDIAMETER_SUCCESSあり、それはメッセージを調べ、保存して削除しなければなりません。 RRKに設定キータイプAVPを持つ任意のキーAVP（8.3節）。メッセージは、このようなキーAVPが含まれていない場合は、ERサーバは、ERPを経由して認証を再度情報をキャッシュすることがあり、後続の試みを避けるために、セッションのために不可能です。いずれの場合も、セッションに関するERサーバに格納されている情報は、このセッションのためにEMSKより大きい寿命を持つべきではありません。"
    },
    {
      "indent": 3,
      "text": "If the ER server is successfully bootstrapped, it should also add the ERP-Realm AVP after removing the Key AVP with Key-Type of rRK in the EAP/DEA message. This ERP-Realm information can be used by the authenticator to notify the peer that the ER server is bootstrapped, and for which domain. How this information can be transmitted to the peer is outside the scope of this document. This information needs to be sent to the peer if both implicit and explicit bootstrapping mechanisms are possible, because the ERP message and the root key used for protecting this message are different in bootstrapping exchanges and non-bootstrapping exchanges.",
      "ja": "ERサーバが正常にブートストラップされた場合、それはまた、EAP / DEAメッセージにRRKのキータイプとキーAVPを取り除いた後、ERP-レルムAVPを追加する必要があります。このERP-レルム情報は、ERサーバがブートストラップされるピア、およびドメインのを通知するために、オーセンティケータによって使用することができます。この情報は、ピアに送信することができますどのように、このドキュメントの範囲外です。両方の暗黙的および明示的なブートストラッピング機構が可能であればERPメッセージとこのメッセージを保護するために使用されるルート鍵がブートストラップ交換と非ブートストラップ交換が異なるため、この情報は、ピアに送信される必要があります。"
    },
    {
      "indent": 0,
      "text": "5.2. Bootstrapping during the First Re-authentication",
      "section_title": true,
      "ja": "5.2。まず、再認証時にブートストラップ"
    },
    {
      "indent": 3,
      "text": "Bootstrapping the ER server during the first re-authentication (also known as explicit bootstrapping) is only needed when there is no ER server in the local domain and there is an ER server in the home domain. It is less resource intensive, since the EMSK generated during initial EAP authentication is reused to derive root keys. On the other hand, the first re-authentication requires a one-round-trip exchange with the home EAP server, since the EMSK is generated during the initial EAP authentication and never leaves the home EAP server, which is less efficient than implicit bootstrapping.",
      "ja": "最初の再認証時にERサーバのブートストラップローカルドメインにはERサーバが存在しないとホームドメインにおけるERサーバがある場合にのみ必要とされている（また、明示的にブートストラップとして知られています）。 EMSKは、ルートキーを導出するために再利用された最初のEAP認証時に生成されたので、それは、より少ない資源集約的です。 EMSKは、最初のEAP認証時に生成され、決して暗黙のブートストラップよりも効率が低いホームEAPサーバを残しているので、一方、最初の再認証は、ホームEAPサーバとの一往復の交換が必要です。"
    },
    {
      "indent": 3,
      "text": "The EAP-Initiate/Re-auth message is sent to the home ER server. The home ER server receives the ERP/DER message containing the EAP-Initiate/Re-auth message with the 'B' flag set. It creates the new EAP/DER message using the received ERP/DER message and performs the following processing:",
      "ja": "EAP-開始/再認証メッセージがホームERサーバに送信されます。ホームERサーバは、「B」フラグが設定されたEAP-開始/再認証メッセージを含むERP / DERメッセージを受け取ります。それは、受信されたERP / DERメッセージを用いて新たなEAP / DERメッセージを作成し、以下の処理を行います。"
    },
    {
      "indent": 6,
      "text": "Set the Application Id in the header of the message to <Diameter EAP> [RFC4072].",
      "ja": "<直径EAP> [RFC4072]にメッセージのヘッダにアプリケーションIDを設定します。"
    },
    {
      "indent": 6,
      "text": "Extract the ERP-RK-Request AVP from the ERP/DER message, which contains the name of the domain where the ER server is located, and add it to the newly created ERP/DER message.",
      "ja": "ERサーバーが置かれているドメインの名前が含まれているERP / DERメッセージ、ERPから-RK-要求AVPを抽出し、新しく作成されたERP / DERメッセージに追加します。"
    },
    {
      "indent": 3,
      "text": "Then, the newly created EAP/DER is sent and routed to the home Diameter EAP application server.",
      "ja": "その後、新たに作成されたEAP / DERは送信され、ホームDiameter EAPアプリケーション・サーバにルーティングされます。"
    },
    {
      "indent": 3,
      "text": "If the home Diameter EAP server does not support ERP extensions, EAP packets with an unknown ERP-specific code (EAP-Initiate) will not be understood. In such a case, the home Diameter EAP server MUST send an EAP/DEA with a Result-Code indicating a Permanent Failure (for example, DIAMETER_ERROR_EAP_CODE_UNKNOWN or DIAMETER_UNABLE_TO_COMPLY). The Failed-AVP AVP MUST be included and contain a copy of the EAP-Payload AVP. Otherwise, it processes the DSRK request, as described in RFC 6696. In particular, it includes the Domain-Name TLV attribute with the content from the ERP-Realm AVP. The server creates the EAP/DEA reply message [RFC4072], including an instance of the Key AVP (Section 8.3) with the Key-Type AVP set to rRK and an instance of the Domain-Name TLV attribute with the content from the ERP-Realm AVP.",
      "ja": "ホームDiameter EAPサーバは、ERPの拡張をサポートしていない場合は、未知のERP固有のコード（EAP-開始）でのEAPパケットが理解されることはありません。このような場合には、ホーム直径EAPサーバは、結果・コード（例えば、DIAMETER_ERROR_EAP_CODE_UNKNOWN又はDIAMETER_UNABLE_TO_COMPLY）永続的な障害を示すとEAP / DEAを送らなければなりません。失敗-AVP AVPは含まれており、EAP-ペイロードAVPのコピーが含まれていなければなりません。そうでなければ、それは特に、RFC 6696.に記載されているように、それはドメイン名TLVは、ERP-レルムAVPからのコンテンツの属性と、DSRK要求を処理します。サーバは、キータイプAVPを有するキーAVP（セクション8.3）のインスタンスを含む、EAP / DEA応答メッセージ[RFC4072]は、RRKとERP-からのコンテンツを含むドメイン名TLV属性のインスタンスに設定作成しますレルムAVP。"
    },
    {
      "indent": 3,
      "text": "The ER server receives this EAP/DEA and proxies it as follows, in addition to standard proxy operations:",
      "ja": "標準のプロキシ操作に加えて、以下のようにERサーバは、このEAP / DEAとプロキシ、それを受信します。"
    },
    {
      "indent": 6,
      "text": "Set the Application Id back to Diameter ERP Application Id (Section 10.1).",
      "ja": "直径ERPアプリケーションID（10.1節）に戻ってアプリケーションIDを設定します。"
    },
    {
      "indent": 6,
      "text": "Extract and cache the content of the Key AVP with Key-Type set to rRK, as described in Section 5.1).",
      "ja": "5.1節で説明したように）、RRKに設定キータイプとキーAVPの内容を抽出し、キャッシュします。"
    },
    {
      "indent": 3,
      "text": "The ERP/DEA message is then forwarded to the authenticator that can use the rMSK as described in RFC 6696.",
      "ja": "ERP / DEAメッセージは、その後、RFC 6696に記載されているようにrMSKを使用することができ、オーセンティケータに転送されます。"
    },
    {
      "indent": 3,
      "text": "The figure below captures this proxy behavior:",
      "ja": "下の図は、このプロキシ動作をキャプチャ："
    },
    {
      "indent": 3,
      "text": "Authenticator            ER server             Home Diameter server\n=============            =========             ====================\n      ----------------------->\n          Diameter ERP/DER\n           (EAP-Initiate)\n                              ------------------------>\n                                    Diameter EAP/DER\n                                     (EAP-Response)\n                                    (ERP-RK-Request)",
      "raw": true
    },
    {
      "indent": 9,
      "text": "                        <------------------------\n                              Diameter EAP/DEA\n                                (EAP-Success)\n                               (Key AVP (rRK))\n                               (Key AVP (rMSK))\n<----------------------\n    Diameter ERP/DEA\n      (EAP-Finish)\n    (Key AVP (rMSK))",
      "raw": true
    },
    {
      "indent": 13,
      "text": "Figure 3: ERP Explicit Bootstrapping Message Flow",
      "ja": "図3：ERP明示的なブートストラップメッセージフロー"
    },
    {
      "indent": 0,
      "text": "6. Re-authentication",
      "section_title": true,
      "ja": "6.再認証"
    },
    {
      "indent": 3,
      "text": "This section describes in detail a re-authentication exchange with an ER server that was previously bootstrapped. The following figure summarizes the re-authentication exchange.",
      "ja": "このセクションでは、詳細に以前にブートストラップされたERサーバによる再認証交換を説明します。次の図は、再認証交換をまとめました。"
    },
    {
      "indent": 4,
      "text": "                                                   ER server\nPeer                 Authenticator                (bootstrapped)\n====                 =============            ======================\n[ <------------------------          ]\n[optional EAP-Initiate/Re-auth-start,]\n[  possibly with ERP domain name     ]",
      "raw": true
    },
    {
      "indent": 6,
      "text": "----------------------->\n  EAP-Initiate/Re-auth\n                        ===============================>\n                           Diameter ERP, cmd code DER\n                             User-Name: keyName-NAI\n                        EAP-Payload: EAP-Initiate/Re-auth",
      "raw": true
    },
    {
      "indent": 6,
      "text": "                        <===============================\n                           Diameter ERP, cmd code DEA\n                         EAP-Payload: EAP-Finish/Re-auth\n                                  Key AVP: rMSK\n<----------------------\n   EAP-Finish/Re-auth",
      "raw": true
    },
    {
      "indent": 13,
      "text": "Figure 4: Diameter ERP Re-authentication Exchange",
      "ja": "図4：直径ERPの再認証交換"
    },
    {
      "indent": 3,
      "text": "The peer sends an EAP-Initiate/Re-auth message to the ER server via the authenticator. Alternatively, the authenticator may send an EAP-Initiate/Re-auth-Start message to the peer to trigger the mechanism. In this case, the peer responds with an EAP-Initiate/Re-auth message.",
      "ja": "ピアは、認証を経てERサーバにEAP-開始/再認証メッセージを送信します。あるいは、オーセンティケータ機構をトリガするためにピアにEAP-開始/再認証開始メッセージを送信することができます。この場合、ピアはEAP-開始/再認証メッセージで応答します。"
    },
    {
      "indent": 3,
      "text": "If the authenticator does not support ERP (pure Diameter EAP [RFC4072] support), it discards the EAP packets with an unknown ERP-specific code (EAP-Initiate). The peer should fall back to full EAP authentication in this case.",
      "ja": "オーセンティケータは、ERP（純粋直径EAP [RFC4072]のサポート）をサポートしていない場合、それは（EAP-開始）未知のERP固有のコードとEAPパケットを破棄する。ピアは、この場合には、完全なEAP認証にフォールバックする必要があります。"
    },
    {
      "indent": 3,
      "text": "When the authenticator receives an EAP-Initiate/Re-auth message from the peer, the message is processed as described in RFC 6696, with regard to the EAP state machine. It creates a Diameter ERP/DER message following the general process of Diameter EAP [RFC4072], with the following differences:",
      "ja": "オーセンティケータがピアからのEAP-開始/再認証メッセージを受信すると、EAP状態マシンに関しては、RFC 6696に記載されているように、メッセージが処理されます。これは、以下の違いを有する直径EAP [RFC4072]の一般的な方法以下の直径ERP / DERメッセージを作成します。"
    },
    {
      "indent": 6,
      "text": "The Application Id in the header is set to <Diameter ERP> (code 13).",
      "ja": "ヘッダにアプリケーションIDは、<直径ERP>（コード13）に設定されています。"
    },
    {
      "indent": 6,
      "text": "The value in the Auth-Application-Id AVP is also set to <Diameter ERP>.",
      "ja": "AUTH-アプリケーション-ID AVPの値はまた、<直径ERP>に設定されています。"
    },
    {
      "indent": 6,
      "text": "The keyName-NAI attribute from the ERP message is used to create the content of the User-Name and Destination-Realm AVPs.",
      "ja": "ERPメッセージからのkeyName-NAI属性は、ユーザー名と宛先領域のAVPのコンテンツを作成するために使用されます。"
    },
    {
      "indent": 6,
      "text": "The Auth-Request-Type AVP content is set to the appropriate value.",
      "ja": "認証リクエスト-Type AVPのコンテンツを適切な値に設定されています。"
    },
    {
      "indent": 6,
      "text": "The EAP-Payload AVP contains the EAP-Initiate/Re-auth message.",
      "ja": "EAP-ペイロードAVPは、EAP-開始/再認証メッセージが含まれています。"
    },
    {
      "indent": 3,
      "text": "Then, this ERP/DER message is sent as described in Section 4.",
      "ja": "セクション4で説明したように、次いで、このERP / DERメッセージが送信されます。"
    },
    {
      "indent": 3,
      "text": "The ER server receives and processes this request as described in Section 4. It then creates an ERP/DEA message following the general process described in Eronen, et al. [RFC4072], with the following differences:",
      "ja": "ERサーバが受信し、その後ら、Eronenに記載の一般的方法以下のERP / DEAメッセージを作成し、セクション4で説明したように、この要求を処理します。次のような違いと[RFC4072]、："
    },
    {
      "indent": 6,
      "text": "The Application Id in the header is set to <Diameter ERP> (code 13).",
      "ja": "ヘッダにアプリケーションIDは、<直径ERP>（コード13）に設定されています。"
    },
    {
      "indent": 6,
      "text": "The value of the Auth-Application-Id AVP is also set to <Diameter ERP>.",
      "ja": "AUTH-アプリケーション-ID AVPの値は、<直径ERP>に設定されています。"
    },
    {
      "indent": 6,
      "text": "The EAP-Payload AVP contains the EAP-Finish/Re-auth message.",
      "ja": "EAP-ペイロードAVPは、EAP-仕上げ/再認証メッセージが含まれています。"
    },
    {
      "indent": 6,
      "text": "If authentication is successful, an instance of the Key AVP containing the rMSK derived by ERP is included.",
      "ja": "認証が成功した場合は、ERPによって得rMSKを含むキーAVPのインスタンスが含まれています。"
    },
    {
      "indent": 3,
      "text": "When the authenticator receives this ERP/DEA answer, it processes it as described in the Diameter EAP Application specification [RFC4072] and RFC 6696: the content of the EAP-Payload AVP is forwarded to the peer, and the contents of the Keying-Material AVP [RFC6734] is used as a shared secret for a secure association protocol specific to the lower layer in use.",
      "ja": "オーセンティケータは、このERP / DEA応答を受信したときに直径EAPアプリケーション仕様[RFC4072]及びRFC 6696に記載されているように、それを処理する：EAPペイロードAVPのコンテンツをピアに転送され、内容キーイング-材料でありますAVP [RFC6734]は、使用中の下層に固有セキュアアソシエーションプロトコルの共有秘密として使用されます。"
    },
    {
      "indent": 0,
      "text": "7. Application Id",
      "section_title": true,
      "ja": "7.アプリケーションID"
    },
    {
      "indent": 3,
      "text": "We define a new Diameter application in this document, Diameter ERP, with an Application Id value of 13. Diameter nodes conforming to this specification in the role of the ER server MUST advertise support by including an Auth-Application-Id AVP with a value of Diameter ERP in the Capabilities-Exchange-Request and Capabilities-Exchange-Answer commands [RFC6733].",
      "ja": "私たちは、の値を持つAUTH-アプリケーションイドAVPを含むことにより、サポートすることを通知しなければならないERサーバーの役割でこの仕様に準拠した13 DiameterノードのアプリケーションIDの値と、この文書、直径ERPの新しいDiameterアプリケーションを定義します機能交換リクエストおよび機能交換-回答コマンドに直径ERP [RFC6733]。"
    },
    {
      "indent": 3,
      "text": "The primary use of the Diameter ERP Application Id is to ensure proper routing of the messages, and that the nodes that advertise the support for this application do understand the new AVPs defined in Section 8, although these AVPs have the 'M' flag cleared.",
      "ja": "直径ERPアプリケーションIDの主な用途は、メッセージの適切なルーティングを確保することであり、これらのAVPは「M」フラグがクリア持っているが、このアプリケーションをサポートすることを通知ノードは、第8項に定義された新しいAVPを理解しています。"
    },
    {
      "indent": 0,
      "text": "8. AVPs",
      "section_title": true,
      "ja": "8.のAVP"
    },
    {
      "indent": 3,
      "text": "The following subsections discuss the AVPs used by the Diameter ERP application.",
      "ja": "以下のサブセクションでは、Diameter ERPアプリケーションで使用されるAVPを議論します。"
    },
    {
      "indent": 0,
      "text": "8.1. ERP-RK-Request AVP",
      "section_title": true,
      "ja": "8.1。 ERP-RK-要求AVP"
    },
    {
      "indent": 3,
      "text": "The ERP-RK-Request AVP (AVP Code 618) is of type Grouped AVP. This AVP is used by the ER server to indicate its willingness to act as the ER server for a particular session.",
      "ja": "ERP-RK-要求AVP（AVPコード618）は、タイプグループ化AVPです。このAVPは、特定のセッションのためのERサーバとして機能するようにその意思を示すために、ERサーバで使用されています。"
    },
    {
      "indent": 3,
      "text": "This AVP has the 'M' and 'V' bits cleared.",
      "ja": "このAVPはクリア「M」と「V」ビットを持っています。"
    },
    {
      "indent": 9,
      "text": "ERP-RK-Request ::= < AVP Header: 618 >\n                   { ERP-Realm }\n                 * [ AVP ]",
      "raw": true
    },
    {
      "indent": 23,
      "text": "Figure 5: ERP-RK-Request ABNF",
      "ja": "図5：ERP-RK-リクエストABNF"
    },
    {
      "indent": 0,
      "text": "8.2. ERP-Realm AVP",
      "section_title": true,
      "ja": "8.2。 ERP-レルムAVP"
    },
    {
      "indent": 3,
      "text": "The ERP-Realm AVP (AVP Code 619) is of type DiameterIdentity. It contains the name of the realm in which the ER server is located.",
      "ja": "ERP-レルムAVP（AVPコード619）が型DiameterIdentityにです。これは、ERサーバが配置されているレルムの名前が含まれています。"
    },
    {
      "indent": 3,
      "text": "This AVP has the 'M' and 'V' bits cleared.",
      "ja": "このAVPはクリア「M」と「V」ビットを持っています。"
    },
    {
      "indent": 0,
      "text": "8.3. Key AVP",
      "section_title": true,
      "ja": "8.3。キーAVP"
    },
    {
      "indent": 3,
      "text": "The Key AVP [RFC6734] is of type Grouped and is used to carry the rRK or rMSK and associated attributes. The usage of the Key AVP and its constituent AVPs in this application is specified in the following subsections.",
      "ja": "キーAVP [RFC6734]はグループ化されたタイプであり、RRKまたはrMSKと関連属性を運ぶために使用されます。このアプリケーションの主なAVPおよびその構成要素のAVPの使用方法は、以下のサブセクションで指定されています。"
    },
    {
      "indent": 0,
      "text": "8.3.1. Key-Type AVP",
      "section_title": true,
      "ja": "8.3.1。キータイプAVP"
    },
    {
      "indent": 3,
      "text": "The value of the Key-Type AVP MUST be set to 1 for rRK or 2 for rMSK.",
      "ja": "キータイプAVPの値はRRKまたはrMSK 2のために1に設定しなければなりません。"
    },
    {
      "indent": 0,
      "text": "8.3.2. Keying-Material AVP",
      "section_title": true,
      "ja": "8.3.2。キーイング、マテリアルAVP"
    },
    {
      "indent": 3,
      "text": "The Keying-Material AVP contains the rRK sent by the home EAP server to the ER server, in answer to a request containing an ERP-RK-Request AVP, or the rMSK sent by the ER server to the authenticator. How this material is derived and used is specified in RFC 6696.",
      "ja": "キーイング・マテリアルAVPは、オーセンティケータにERサーバーから送信されたERP-RK-要求AVP、またはrMSKを含むリクエストへの回答では、ERサーバにホームEAPサーバによって送信されRRKが含まれています。どのようにこの材料が導出され、RFC 6696で指定されて使用されています。"
    },
    {
      "indent": 0,
      "text": "8.3.3. Key-Name AVP",
      "section_title": true,
      "ja": "8.3.3。キー名AVP"
    },
    {
      "indent": 3,
      "text": "This AVP contains the EMSKname that identifies the keying material. The derivation of this name is specified in RFC 6696.",
      "ja": "このAVPは、鍵素材を特定EMSKnameが含まれています。この名前の由来は、RFC 6696で指定されています。"
    },
    {
      "indent": 0,
      "text": "8.3.4. Key-Lifetime AVP",
      "section_title": true,
      "ja": "8.3.4。キー生涯AVP"
    },
    {
      "indent": 3,
      "text": "The Key-Lifetime AVP contains the lifetime of the keying material in seconds. It MUST NOT be greater than the remaining lifetime of the EMSK from which the material was derived.",
      "ja": "キー生涯AVPは、秒単位での鍵材料の寿命が含まれています。これは、材料が由来したEMSKの残りの寿命を超えてはなりません。"
    },
    {
      "indent": 0,
      "text": "9. Result-Code AVP Values",
      "section_title": true,
      "ja": "9.結果 - コードAVP値"
    },
    {
      "indent": 3,
      "text": "This section defines new Result-Code [RFC6733] values that MUST be supported by all Diameter implementations that conform to this specification.",
      "ja": "このセクションでは、この仕様に準拠するすべてのDiameter実装でサポートしなければならない新しい結果、コード[RFC6733]の値を定義します。"
    },
    {
      "indent": 0,
      "text": "9.1. Permanent Failures",
      "section_title": true,
      "ja": "9.1。恒久的な障害"
    },
    {
      "indent": 3,
      "text": "Errors that fall within the Permanent Failures category are used to inform the peer that the request failed and SHOULD NOT be attempted again.",
      "ja": "永久障害の範疇でのエラーは、要求が失敗し、再試行されるべきではないピアに通知するために使用されています。"
    },
    {
      "indent": 6,
      "text": "DIAMETER_ERROR_EAP_CODE_UNKNOWN (5048)",
      "ja": "DIAMETER_ERROR_EAP_CODE_UNKNOWN（5048）"
    },
    {
      "indent": 9,
      "text": "This error code is used by the Diameter server to inform the peer that the received EAP-Payload AVP contains an EAP packet with an unknown EAP code.",
      "ja": "このエラーコードは、受信されたEAPペイロードAVPが未知のEAPコードとEAPパケットを含むことをピアに通知するためにDiameterサーバによって使用されます。"
    },
    {
      "indent": 0,
      "text": "10. IANA Considerations",
      "section_title": true,
      "ja": "10. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has registered the following new elements in the Authentication, Authorization, and Accounting (AAA) Parameters registries [AAAPARAMS].",
      "ja": "IANAは、認証に次の新しい要素を登録した、許可、アカウンティング（AAA）は、レジストリ[AAAPARAMS]パラメータ。"
    },
    {
      "indent": 0,
      "text": "10.1. Diameter Application Identifier",
      "section_title": true,
      "ja": "10.1。直径アプリケーション識別子"
    },
    {
      "indent": 3,
      "text": "IANA has allocated a new value \"Diameter ERP\" (code: 13) in the \"Application IDs\" registry from the \"Standards Action\" range of numbers using the \"Specification Required\" policy [RFC5226]; see Section 11.3 of RFC 3588 [RFC3588] for further details.",
      "ja": "「仕様が必要で」ポリシー[RFC5226]を使用して数字の「標準アクション」レンジから「アプリケーションIDが」レジストリに;：IANAは新しい値「直径ERP」（13コード）を割り当てました詳細については、RFC 3588 [RFC3588]のセクション11.3を参照してください。"
    },
    {
      "indent": 0,
      "text": "10.2. New AVPs",
      "section_title": true,
      "ja": "10.2。新しいのAVP"
    },
    {
      "indent": 3,
      "text": "IANA has allocated new values from the \"AVP Codes\" registry according to the policy specified in Section 11.1 of Fajardo, et al. [RFC6733] for the following AVPs:",
      "ja": "IANAらファハルド、セクション11.1で指定されたポリシーに従って「AVPコード」レジストリから新しい値を割り当てました。以下のAVPのための[RFC6733]："
    },
    {
      "indent": 6,
      "text": "ERP-RK-Request (code: 618)",
      "ja": "ERP-RK-要求（コード：618）"
    },
    {
      "indent": 6,
      "text": "ERP-Realm (code: 619)",
      "ja": "ERP-レルム（コード：619）"
    },
    {
      "indent": 3,
      "text": "These AVPs are defined in Section 8.",
      "ja": "これらのAVPは、第8節で定義されています。"
    },
    {
      "indent": 0,
      "text": "10.3. New Permanent Failures Result-Code AVP Values",
      "section_title": true,
      "ja": "10.3。新しい永続障害は結果 - コードAVP値を"
    },
    {
      "indent": 3,
      "text": "IANA has allocated a new value from the \"Result-Code AVP Values (code 268) - Permanent Failure\" registry according to the policy specified in Section 11.3.2 of Fajardo, et al. [RFC6733] for the following Result-Code:",
      "ja": "らファハルド、セクション11.3.2に指定されたポリシーに従ってレジストリ -  IANAは、「永続的なエラーの結果、コードAVP値（符号268）」から新しい値を割り当てました。次の結果、コードのための[RFC6733]："
    },
    {
      "indent": 6,
      "text": "DIAMETER_ERROR_EAP_CODE_UNKNOWN (code: 5048)",
      "ja": "DIAMETER_ERROR_EAP_CODE_UNKNOWN（コード：5048）"
    },
    {
      "indent": 3,
      "text": "This Result-Code value is defined in Section 9.",
      "ja": "この結果、コード値は、セクション9で定義されています。"
    },
    {
      "indent": 0,
      "text": "11. Security Considerations",
      "section_title": true,
      "ja": "11.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "The security considerations from the following documents apply here:",
      "ja": "次のドキュメントからのセキュリティに関する考慮事項が適用されます："
    },
    {
      "indent": 3,
      "text": "o Eronen, et al. [RFC4072]",
      "ja": "いいえEronenら。 [RFC4072]"
    },
    {
      "indent": 3,
      "text": "o Salowey, et al. [RFC5295]",
      "ja": "O Salowey、ら。 [RFC5295]"
    },
    {
      "indent": 3,
      "text": "o Cao, et al. [RFC6696]",
      "ja": "およびCaOら。 [RFC6696]"
    },
    {
      "indent": 3,
      "text": "o Fajardo, et al. [RFC6733]",
      "ja": "Fjrdhら。 [Rvstaha]"
    },
    {
      "indent": 3,
      "text": "o Zorn, et al. [RFC6734]",
      "ja": "またはゾルン、ら。 [RFC6734]"
    },
    {
      "indent": 3,
      "text": "Because this application involves the transmission of sensitive data, including cryptographic keys, it MUST be protected using Transport Layer Security (TLS) [RFC5246], Datagram Transport Layer Security (DTLS) [RFC6347], or IP Encapsulating Security Payload (ESP) [RFC4303]. If TLS or DTLS is used, the bulk encryption algorithm negotiated MUST be non-null. If ESP is used, the encryption algorithm MUST be non-null.",
      "ja": "このアプリケーションは、暗号化キーを含む機密データの伝送を必要とするので、トランスポート層セキュリティ（TLS）[RFC5246]、データグラムトランスポート層セキュリティ（DTLS）[RFC6347]、またはIPカプセル化セキュリティペイロード（ESP）[RFC4303を使用して保護されなければなりません]。 TLSまたはDTLSを使用する場合は、交渉さバルク暗号化アルゴリズムは非NULLでなければなりません。 ESPを使用する場合は、暗号化アルゴリズムは、null以外でなければなりません。"
    },
    {
      "indent": 0,
      "text": "12. Contributors",
      "section_title": true,
      "ja": "12.協力者"
    },
    {
      "indent": 3,
      "text": "Hannes Tschofenig wrote the initial draft of this document.",
      "ja": "ハンネスTschofenigは、このドキュメントの初期の草稿を書きました。"
    },
    {
      "indent": 3,
      "text": "Lakshminath Dondeti contributed to the early drafts of the document.",
      "ja": "Lakshminath Dondetiは、文書の初期の草稿に貢献しました。"
    },
    {
      "indent": 0,
      "text": "13. Acknowledgements",
      "section_title": true,
      "ja": "13.謝辞"
    },
    {
      "indent": 3,
      "text": "Hannes Tschofenig, Zhen Cao, Benoit Claise, Elwyn Davies, Menachem Dodge, Vincent Roca, Stephen Farrell, Sean Turner, Pete Resnick, Russ Housley, Martin Stiemerling, and Jouni Korhonen provided useful reviews.",
      "ja": "ハンネスTschofenig、ジェン曹操、ブノワClaise、エルウィン・デイヴィス、メナヘムダッジ、ヴィンセントロカ、スティーブン・ファレル、ショーン・ターナー、ピート・レズニック、ラスHousley、マーティンStiemerling、およびJouni Korhonenは便利なレビューを提供します。"
    },
    {
      "indent": 3,
      "text": "Vidya Narayanan reviewed a rough draft version of the document and found some errors.",
      "ja": "Vidyaナラヤナンは、文書の草稿版を検討し、いくつかのエラーを発見しました。"
    },
    {
      "indent": 3,
      "text": "Many thanks to these people!",
      "ja": "これらの人々に感謝します！"
    },
    {
      "indent": 0,
      "text": "14. References",
      "section_title": true,
      "ja": "14.参考文献"
    },
    {
      "indent": 0,
      "text": "14.1. Normative References",
      "section_title": true,
      "ja": "14.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3748] Aboba, B., Blunk, L., Vollbrecht, J., Carlson, J., and H. Levkowetz, \"Extensible Authentication Protocol (EAP)\", RFC 3748, June 2004.",
      "ja": "[RFC3748] Aboba、B.、ブルンク、L.、Vollbrecht、J.、カールソン、J.、およびH. Levkowetz、 \"拡張認証プロトコル（EAP）\"、RFC 3748、2004年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC4072] Eronen, P., Hiller, T., and G. Zorn, \"Diameter Extensible Authentication Protocol (EAP) Application\", RFC 4072, August 2005.",
      "ja": "[RFC4072] Eronen、P.、ヒラー、T.、およびG.ゾルン、 \"直径拡張認証プロトコル（EAP）アプリケーション\"、RFC 4072、2005年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC5226] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 5226, May 2008.",
      "ja": "[RFC5226] Narten氏、T.とH. Alvestrand、 \"RFCsにIANA問題部に書くためのガイドライン\"、BCP 26、RFC 5226、2008年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC5295] Salowey, J., Dondeti, L., Narayanan, V., and M. Nakhjiri, \"Specification for the Derivation of Root Keys from an Extended Master Session Key (EMSK)\", RFC 5295, August 2008.",
      "ja": "[RFC5295] Salowey、J.、Dondeti、L.、ナラヤナン、V.、およびM. Nakhjiri、RFC 5295 \"拡張マスタセッションキー（EMSK）からルート鍵の導出のための仕様\"、2008年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC6696] Cao, Z., He, B., Shi, Y., Wu, Q., and G. Zorn, \"EAP Extensions for the EAP Re-authentication Protocol (ERP)\", RFC 6696, July 2012.",
      "ja": "[RFC6696]曹操、Z.、彼、B.、市、Y.、呉、Q.、およびG.ツォルン、 \"EAP再認証プロトコルのためのEAP拡張機能（ERP）\"、RFC 6696、2012年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC6733] Fajardo, V., Arkko, J., Loughney, J., and G. Zorn, \"Diameter Base Protocol\", RFC 6733, October 2012.",
      "ja": "[RFC6733]ファハルド、V.、Arkko、J.、Loughney、J.、およびG.ゾルン、 \"直径ベースプロトコル\"、RFC 6733、2012年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC6734] Zorn, G., Wu, Q., and V. Cakulev, \"Diameter Attribute-Value Pairs for Cryptographic Key Transport\", RFC 6734, October 2012.",
      "ja": "[RFC6734]ソーン、G.、呉、Q.、およびV. Cakulev、 \"暗号鍵輸送のための直径アトリビュートと値のペア\"、RFC 6734、2012年10月。"
    },
    {
      "indent": 0,
      "text": "14.2. Informative References",
      "section_title": true,
      "ja": "14.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[AAAPARAMS] Internet Assigned Numbers Authority, \"Authentication, Authorization, and Accounting (AAA) Parameters\", <http://www.iana.org/assignments/aaa-parameters/>.",
      "ja": "【AAAPARAMS】インターネット割り当て番号機関、 \"認証、許可、アカウンティング（AAA）パラメータ\"、<http://www.iana.org/assignments/aaa-parameters/>。"
    },
    {
      "indent": 3,
      "text": "[RFC3588] Calhoun, P., Loughney, J., Guttman, E., Zorn, G., and J. Arkko, \"Diameter Base Protocol\", RFC 3588, September 2003.",
      "ja": "[RFC3588]カルフーン、P.、Loughney、J.、ガットマン、E.、ゾルン、G.、およびJ. Arkko、 \"直径ベースプロトコル\"、RFC 3588、2003年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC4303] Kent, S., \"IP Encapsulating Security Payload (ESP)\", RFC 4303, December 2005.",
      "ja": "[RFC4303]ケント、S.、 \"IPカプセル化セキュリティペイロード（ESP）\"、RFC 4303、2005年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC5246] Dierks, T. and E. Rescorla, \"The Transport Layer Security (TLS) Protocol Version 1.2\", RFC 5246, August 2008.",
      "ja": "[RFC5246]ダークス、T.およびE.レスコラ、 \"トランスポート層セキュリティ（TLS）プロトコルバージョン1.2\"、RFC 5246、2008年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC6347] Rescorla, E. and N. Modadugu, \"Datagram Transport Layer Security Version 1.2\", RFC 6347, January 2012.",
      "ja": "[RFC6347]レスコラ、E.およびN. Modadugu、 \"データグラムトランスポート層セキュリティバージョン1.2\"、RFC 6347、2012年1月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Julien Bournelle Orange Labs 38-40 rue du general Leclerc Issy-Les-Moulineaux 92794 France",
      "ja": "38-40 RUEの一般ルクレールイシレムリノーのジュリアンBournelleオレンジ研究所、フランス92794"
    },
    {
      "indent": 3,
      "text": "EMail: julien.bournelle@orange.com",
      "ja": "メールアドレス：julien.bournelle@orange.com"
    },
    {
      "indent": 3,
      "text": "Lionel Morand Orange Labs 38-40 rue du general Leclerc Issy-Les-Moulineaux 92794 France",
      "ja": "38-40 RUEの一般ルクレールイシレムリノーのライオネル・モランオレンジ研究所、フランス92794"
    },
    {
      "indent": 3,
      "text": "EMail: lionel.morand@orange.com",
      "ja": "メールアドレス：lionel.morand@orange.com"
    },
    {
      "indent": 3,
      "text": "Sebastien Decugis INSIDE Secure 41 Parc Club du Golf Aix-en-Provence 13856 France",
      "ja": "セバスチャンDecugis INSIDEセキュア41パークゴルフクラブエクサンプロバンス13856フランス"
    },
    {
      "indent": 3,
      "text": "Phone: +33 (0)4 42 39 63 00 EMail: sdecugis@freediameter.net",
      "ja": "電話：+33（0）4 42 39 63 00 Eメール：sdecugis@freediameter.net"
    },
    {
      "indent": 3,
      "text": "Qin Wu Huawei Technologies Co., Ltd. 101 Software Avenue, Yuhua District Nanjing, JiangSu 210012 China",
      "ja": "技術CO。、株式会社101ソフトウェア大通り、Y Uドロー地区のNaN北京、江蘇省210012中国蕪湖AでQ"
    },
    {
      "indent": 3,
      "text": "EMail: sunseawq@huawei.com",
      "ja": "メールアドレス：sunseawq@huawei.com"
    },
    {
      "indent": 3,
      "text": "Glen Zorn Network Zen 227/358 Thanon Sanphawut Bang Na, Bangkok 10260 Thailand",
      "ja": "グレンツォルンネットワーク禅358分の227タノンSanphawutバンナー、バンコク10260タイ"
    },
    {
      "indent": 3,
      "text": "EMail: glenzorn@gmail.com",
      "ja": "メールアドレス：glenzorn@gmail.com"
    }
  ]
}