{
  "title": {
    "text": "RFC 6646 - DECoupled Application Data Enroute (DECADE) Problem Statement",
    "ja": "RFC 6646 - デカップリングアプリケーションデータ道中（DECADE）問題文"
  },
  "number": 6646,
  "created_at": "2019-10-28 19:21:01.951708+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                           H. Song\nRequest for Comments: 6646                                       N. Zong\nCategory: Informational                                           Huawei\nISSN: 2070-1721                                                  Y. Yang\n                                                         Yale University\n                                                                R. Alimi\n                                                                  Google\n                                                               July 2012",
      "raw": true
    },
    {
      "indent": 5,
      "text": "DECoupled Application Data Enroute (DECADE) Problem Statement",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "Peer-to-peer (P2P) applications have become widely used on the Internet today and make up a large portion of the traffic in many networks. In P2P applications, one technique for reducing the transit and uplink P2P traffic is to introduce storage capabilities within the network. Traditional caches (e.g., P2P and Web caches) provide such storage, but they can be complex (e.g., P2P caches need to explicitly support individual P2P application protocols), and do not allow users to manage resource usage policies for content in the cache. This document discusses the introduction of in-network storage for P2P applications and shows the need for a standard protocol for accessing this storage.",
      "ja": "ピア・ツー・ピア（P2P）アプリケーションは、インターネット上で、今日広く普及し、多くのネットワークのトラフィックの大部分を構成しています。 P2Pアプリケーションでは、トランジットリンクとアップリンクのP2Pトラフィックを低減するための一つの技術は、ネットワーク内のストレージ機能を導入することです。従来のキャッシュ（例えば、P2Pお​​よびWebキャッシュ）などの記憶装置を提供するが、それらは複雑になることがあります（例えば、P2Pのキャッシュが明示的に個々のP2Pアプリケーションプロトコルをサポートする必要がある）、およびユーザーがキャッシュ内にコンテンツのリソース使用状況ポリシーを管理することはできません。この文書では、P2Pアプリケーションのためで、ネットワークストレージの導入について説明し、このストレージにアクセスするための標準プロトコルの必要性を示しています。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 IESGによって承認されていないすべての文書がインターネットStandardのどんなレベルの候補です。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6646.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6646で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2012 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2012 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Terminology and Concepts ........................................3\n3. The Problems ....................................................4\n   3.1. P2P Infrastructural Stress and Inefficiency ................4\n   3.2. P2P Cache: A Complex Type of In-Network Storage ............5\n   3.3. Ineffective Integration of P2P Applications ................6\n4. Usage Scenarios .................................................6\n   4.1. BitTorrent .................................................6\n   4.2. Content Publisher ..........................................7\n5. Security Considerations .........................................8\n   5.1. Denial-of-Service Attacks ..................................8\n   5.2. Copyright and Legal Issues .................................8\n   5.3. Traffic Analysis ...........................................8\n   5.4. Modification of Information ................................8\n   5.5. Masquerade .................................................9\n   5.6. Disclosure .................................................9\n   5.7. Message Stream Modification ................................9\n6. Acknowledgments .................................................9\n7. Informative References .........................................10",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "Peer-to-peer (P2P) applications, including both P2P streaming and P2P file-sharing applications, make up a large fraction of the traffic in many Internet Service Provider (ISP) networks today. One way to reduce bandwidth usage by P2P applications is to introduce storage capabilities in networks. Allowing P2P applications to store and retrieve data from inside networks can reduce traffic on the last-mile uplink, as well as on backbone and transit links.",
      "ja": "、P2PストリーミングとP2Pファイル共有アプリケーションの両方を含む（P2P）アプリケーションを、ピアツーピア今日、多くのインターネットサービスプロバイダ（ISP）のネットワーク内のトラフィックの大部分を占めています。 P2Pアプリケーションによる帯域幅の使用量を削減する一つの方法は、ネットワークにストレージ機能を導入することです。 P2Pアプリケーションは、内部ネットワークからのデータを格納および取得できるようにすると、ラストマイルのアップリンク上だけでなく、バ​​ックボーンとトランジットリンク上のトラフィックを削減することができます。"
    },
    {
      "indent": 3,
      "text": "Existing P2P caches provide in-network storage and have been deployed in some networks. However, the current P2P caching architecture poses challenges to both P2P cache vendors and P2P application developers. For P2P cache vendors, it is challenging to support a number of continuously evolving P2P application protocols, due to lack of documentation, ongoing protocol changes, and rapid introduction of new features by P2P applications. For P2P application developers, closed P2P caching systems limit P2P applications from effectively utilizing in-network storage. In particular, P2P caches typically do not allow users to explicitly store content into in-network storage. They also do not allow applications to specific resource and access control policies over the usage of in-network storage. The challenges, if not addressed, may lead to reduced efficiency for P2P applications, and increased load on the network infrastructure.",
      "ja": "既存のP2Pキャッシュは、ネットワーク内のストレージを提供し、いくつかのネットワークで展開されています。しかし、現在のP2Pのキャッシュアーキテクチャは、P2Pのキャッシュ・ベンダーやP2Pアプリケーション開発者の両方への挑戦を提起します。 P2Pのキャッシュ・ベンダーの場合、原因ドキュメントの欠如、継続的なプロトコルの変更、およびP2Pアプリケーションによる新機能の迅速な導入に、継続的に進化するP2Pアプリケーションプロトコルの数をサポートするために困難です。 P2Pアプリケーション開発者のために、P2Pキャッシングシステムが効果的にネットワーク記憶装置を利用するから、P2Pアプリケーションを制限閉じ。特に、P2Pキャッシュは、通常、ユーザーが明示的で、ネットワークストレージにコンテンツを格納することはできません。彼らはまた、ネットワーク内のストレージの使用量を超える特定のリソースおよびアクセス制御ポリシーのアプリケーションを許可していません。課題は、対処しなければ、ネットワークインフラストラクチャ上のP2Pアプリケーションのための効率が低下し、負荷の増加につながる可能性があります。"
    },
    {
      "indent": 3,
      "text": "The challenges can be effectively addressed by using a standard, open protocol to access in-network storage [Data_Lockers]. P2P applications can store and retrieve content in the in-network storage, as well as control resources (e.g., bandwidth, connections) consumed by peers in a P2P application. As a simple example, a peer of a P2P application may upload to other peers through its in-network storage, saving its usage of last-mile uplink bandwidth.",
      "ja": "課題を効果的に標準を使用することによって対処することができ、オープンプロトコルは、ネットワーク内のストレージ[Data_Lockers]にアクセスします。 P2Pアプリケーションは、格納しにおけるネットワークストレージ内のコンテンツを検索、ならびにP2Pアプリケーションのピアによって消費される制御リソース（例えば、帯域幅、接続）することができます。簡単な例として、P2Pアプリケーションのピアは、ラストマイルのアップリンク帯域幅のその使用を節約し、そのネットワーク内のストレージを介して他のピアにアップロードすることができます。"
    },
    {
      "indent": 3,
      "text": "In this document, we distinguish between two functional components of the native P2P application protocol: signaling and data access. Signaling includes operations such as handshaking and discovering peer and content availability. The data access component transfers content from one peer to another.",
      "ja": "シグナリングおよびデータアクセス：この文書では、我々は、ネイティブP2Pアプリケーションプロトコルの二つの機能構成要素を区別します。シグナリングは、ハンドシェイクおよび発見ピアとコンテンツの可用性などの操作を含みます。別のピアからのコンテンツのデータアクセスコンポーネント転送します。"
    },
    {
      "indent": 3,
      "text": "In essence, coupling of the signaling and data access makes in-network storage complex to support various application services. However, these applications have common requirements for data access, making it possible to develop a standard protocol.",
      "ja": "本質的には、シグナリングおよびデータアクセスの結合は、様々なアプリケーション・サービスをサポートするために、ネットワークストレージ複合体を作ります。しかし、これらのアプリケーションは、データアクセスのための共通の要件を持つことが可能標準プロトコルを開発すること。"
    },
    {
      "indent": 0,
      "text": "2. Terminology and Concepts",
      "section_title": true,
      "ja": "2.用語と概念"
    },
    {
      "indent": 3,
      "text": "The following terms have special meaning in the definition of the in-network storage system.",
      "ja": "次の用語は、ネットワーク内のストレージシステムの定義の中で特別な意味を持っています。"
    },
    {
      "indent": 3,
      "text": "In-network storage: A service inside a network that provides storage and bandwidth to network applications. In-network storage may reduce upload/transit/backbone traffic and improve network application performance. The position of in-network storage is in the core of a network -- for example, co-located with the border router (network attached storage) or inside a data center.",
      "ja": "ネットワークストレージ：ネットワークアプリケーションにストレージと帯域幅を提供するネットワーク内のサービス。では、ネットワークストレージは、アップロード/トランジット/バックボーントラフィックを削減し、ネットワークアプリケーションのパフォーマンスを向上させることができます。ネットワークストレージの位置は、ネットワークのコアである - 例えば、ボーダルータ（ネットワーク接続ストレージ）またはデータセンター内の共配置します。"
    },
    {
      "indent": 3,
      "text": "P2P cache (peer-to-peer cache): A kind of in-network storage that understands the signaling and transport of specific P2P application protocols. It caches the content for those specific P2P applications in order to serve peers and reduce traffic on certain links.",
      "ja": "P2Pキャッシュ（ピア・ツー・ピアキャッシュ）：特定のP2Pアプリケーションプロトコルのシグナリングと輸送を理解におけるネットワークストレージの種類。これは、ピアにサービスを提供し、特定のリンク上のトラフィックを削減するために、これらの特定のP2Pアプリケーションのためのコンテンツをキャッシュします。"
    },
    {
      "indent": 0,
      "text": "3. The Problems",
      "section_title": true,
      "ja": "3.問題"
    },
    {
      "indent": 3,
      "text": "The emergence of P2P as a major network application (especially P2P file sharing and streaming) has led to substantial opportunities. The P2P paradigm can be utilized to design highly scalable and robust applications at low cost, compared to the traditional client-server paradigm.",
      "ja": "主要なネットワークアプリケーション（特にP2Pファイル共有やストリーミング）などのP2Pの出現はかなりの機会につながっています。 P2Pパラダイムは、従来のクライアント・サーバ・パラダイムに比べ、低コストで高度にスケーラブルで堅牢なアプリケーションを設計するために利用することができます。"
    },
    {
      "indent": 3,
      "text": "However, P2P applications also face substantial design challenges. A particular challenge facing P2P applications is the additional stress that they place on the network infrastructure. At the same time, lack of infrastructure support can lead to unstable P2P application performance, in particular during peer churns and flash crowds, when a large group of users begin to retrieve the content during a short period of time, leading to stress on bandwidth-constrained access uplinks. A potential way to reduce network stress and improve P2P application performance would be to make it possible for peers that are on bandwidth-constrained access to put data in a place that is free of bandwidth constraints and also accessible by other peers. These problems are now discussed in further detail.",
      "ja": "しかし、P2Pアプリケーションもかなりの設計上の課題に直面しています。 P2Pアプリケーションが直面する特定の課題は、彼らはネットワークインフラストラクチャに配置すること、追加のストレスです。同時に、インフラのサポートの欠如は、帯域幅のストレスにつながる、ユーザーの大規模なグループは、時間の短い期間中にコンテンツを取得するために始めたときに、ピア・大量生産で有名とフラッシュ群衆の間に、特に、不安定なP2Pアプリケーションのパフォーマンスにつながることができますアクセスアップリンクを制約。ネットワークのストレスを軽減し、P2Pアプリケーションのパフォーマンスを向上させる可能性の方法は、それが可能な帯域幅に制限のアクセスにあるピアが他のピアによって、帯域幅の制約の自由ともアクセス可能な場所にデータを入れてできるようにすることだろう。これらの問題は今、さらに詳細に検討されています。"
    },
    {
      "indent": 0,
      "text": "3.1. P2P Infrastructural Stress and Inefficiency",
      "section_title": true,
      "ja": "3.1.  P2Pインフラ網とストレスと非効率性"
    },
    {
      "indent": 3,
      "text": "A particular problem of the P2P paradigm is the stress that P2P application traffic places on the infrastructure of ISPs. Multiple measurements (e.g., [ipoque_Internet_Study]) have shown that P2P traffic has become a major type of traffic on some networks. Furthermore, the inefficiency of network-agnostic peering (at the P2P transmission level) leads to unnecessary traversal across network domains or spanning the backbone of a network [RFC5693].",
      "ja": "P2Pパラダイムの特定の問題は、ISPのインフラ上のP2Pアプリケーションのトラフィックの場所その応力です。複数の測定（例えば、[ipoque_Internet_Study]）はP2Pトラフィックは、いくつかのネットワーク上のトラフィックの主要なタイプとなっていることを示しています。さらに、（P2P伝送レベルで）ネットワークにとらわれないピアリングの非効率性は、不必要なネットワークドメイン間でトラバース又はネットワークのバックボーンにまたがる[RFC5693]につながります。"
    },
    {
      "indent": 3,
      "text": "Using network information alone to construct more efficient P2P swarms is not sufficient to reduce P2P traffic in access networks, as the total access upload traffic is equal to the total access download traffic in a traditional P2P system. On the other hand, it is reported that P2P traffic is becoming the dominant traffic on the access networks of some networks, reaching as high as 50-60% on the downlinks and 60-90% on the uplinks [DCIA] [ICNP] [ipoque_P2P_Survey] [P2P_File_Sharing]. Consequently, it becomes increasingly important to reduce upload access traffic, in addition to cross-domain and backbone traffic.",
      "ja": "総アクセスアップロードトラフィックは、従来のP2Pシステムにおける総アクセスダウンロードトラフィックに等しいように、より効率的なP2Pの群れを構築するだけでネットワーク情報を使用すると、アクセスネットワークにおけるP2Pトラフィックを削減するのに十分ではありません。一方、[DCIA] P2Pトラフィックがアップリンク上でダウンリンク上での高50~60％程度と60から90パーセントに達し、いくつかのネットワークのアクセスネットワーク上の支配的なトラフィックになりつつあることが報告されている[ICNP] [ ipoque_P2P_Survey] [P2P_File_Sharing]。したがって、クロスドメインとバックボーンのトラフィックに加えて、アップロードのアクセストラフィックを削減することがますます重要になってきます。"
    },
    {
      "indent": 3,
      "text": "The inefficiency of P2P is also observed when traffic is sent upstream as many times as there are remote peers interested in getting the corresponding information. For example, the P2P application transfer completion times remain affected by potentially (relatively) slow upstream transmission. Similarly, the performance of real-time P2P applications may be affected by potentially (relatively) higher upstream latencies.",
      "ja": "P2Pの非効率性は、対応する情報を得ることに興味を持って、リモートピアがあるので、トラフィックが何度でも上流に送信されたときに観察されます。例えば、P2Pアプリケーション転送完了時間は、潜在的に（相対的に）遅い上り伝送の影響を受けたままです。同様に、リアルタイムP2Pアプリケーションのパフォーマンスは、潜在的に（比較的）高い上流の待ち時間による影響を受けることができます。"
    },
    {
      "indent": 0,
      "text": "3.2. P2P Cache: A Complex Type of In-Network Storage",
      "section_title": true,
      "ja": "3.2.  P2Pキャッシュ：インネットワークストレージの複合型"
    },
    {
      "indent": 3,
      "text": "An effective technique to reduce P2P infrastructural stress and inefficiency is to introduce in-network storage. A survey of existing in-network storage systems can be found in [RFC6392].",
      "ja": "P2Pインフラストレスや非効率性を減少させるのに有効な手法は、ネットワーク内のストレージを導入することです。既存のネットワーク内のストレージシステムの調査は、[RFC6392]に見出すことができます。"
    },
    {
      "indent": 3,
      "text": "In the current Internet, in-network storage is introduced as P2P caches, either transparently or explicitly as a P2P peer. To provide service to a specific P2P application, the P2P cache server must support the specific signaling and transport protocols of the specific P2P application. This can lead to substantial complexity for the P2P cache vendor.",
      "ja": "現在のインターネットでは、ネットワーク内のストレージは、いずれかの透過的または明示的にP2Pピアとして、P2Pキャッシュとして導入されます。特定のP2Pアプリケーションにサービスを提供するために、P2Pのキャッシュサーバは、特定のP2Pアプリケーションの特定のシグナリングおよびトランスポートプロトコルをサポートしている必要があります。これは、P2Pのキャッシュ・ベンダーのためにかなりの複雑さにつながることができます。"
    },
    {
      "indent": 3,
      "text": "First, there are many P2P applications on the Internet (e.g., BitTorrent, eMule, Flashget, and Thunder for file sharing; Abacast, Kontiki, Octoshape, PPLive, PPStream, and UUSee for P2P streaming). Consequently, a P2P cache vendor faces the challenge of supporting a large number of P2P application protocols, leading to product complexity and increased development cost.",
      "ja": "まず、（; P2Pストリーミング用Abacast、コンティキ、Octoshape、PPLiveの、PPStreamの、およびUUSeeファイル共有のために、例えば、BitTorrentの、eMuleの、ã？、とサンダー）、インターネット上の多くのP2Pアプリケーションがあります。その結果、P2Pのキャッシュ・ベンダーは、製品の複雑さと増加した開発コストにつながる、P2Pアプリケーションプロトコルの多数をサポートするという課題に直面しています。"
    },
    {
      "indent": 3,
      "text": "Second, a specific P2P application protocol may evolve continuously to add new features or fix bugs. This in turn forces a P2P cache vendor to continuously monitor application updates to track such changes, leading to product complexity and increased costs.",
      "ja": "第二に、特定のP2Pアプリケーションプロトコルは、新しい機能を追加したり、バグを修正するために継続的に進化することがあります。これは、順番に、製品の複雑さとコストの増加につながる、継続的にこのような変化を追跡するために、アプリケーションの更新を監視するために、P2Pキャッシュベンダーを強制します。"
    },
    {
      "indent": 3,
      "text": "Third, many P2P applications use proprietary protocols or support end-to-end encryption. This can render P2P caches ineffective. Therefore, these three problems make it difficult to use the P2P cache as a network middlebox to support P2P application distribution.",
      "ja": "第三に、多くのP2Pアプリケーションが独自のプロトコルやサポートエンドツーエンドの暗号化を使用しています。これは無効P2Pキャッシュをレンダリングすることができます。したがって、これらの3つの問題が、それが困難なP2Pアプリケーションの配布をサポートするために、ネットワークのミドルとしてP2Pキャッシュを使用するようにします。"
    },
    {
      "indent": 3,
      "text": "Finally, an end host has better connectivity and connection quality to a P2P cache than to a remote peer. Without the ability to manage bandwidth usage, the P2P cache may increase the volume of download traffic, which runs counter to the reduction of upload access traffic.",
      "ja": "最後に、エンドホストは、リモートピアへのよりP2Pキャッシュに優れた接続性と接続品質を持っています。帯域幅の使用状況を管理する能力がなければ、P2Pキャッシュは、アップロードアクセストラフィックの削減に反するダウンロードトラフィックの量を増加させることができます。"
    },
    {
      "indent": 0,
      "text": "3.3. Ineffective Integration of P2P Applications",
      "section_title": true,
      "ja": "3.3.  P2Pアプリケーションの無効との統合"
    },
    {
      "indent": 3,
      "text": "As P2P applications evolve, it has become increasingly clear that usage of in-network resources can improve the user's experience. For example, multiple P2P streaming systems seek additional in-network resources during a flash crowd, such as just before a major live streaming event. In asymmetric networks, when the aggregated upload bandwidth of a channel cannot meet the download demand, a P2P application may seek additional in-network resources to maintain a stable system.",
      "ja": "P2Pアプリケーションが進化するにつれ、それがネットワーク内のリソースの使用量がユーザの経験を改善することができることがますます明らかになっています。例えば、複数のP2Pストリーミングシステムは、ちょうど主要なライブストリーミングイベントの前にあるフラッシュ群衆の中に追加のネットワーク内のリソースを、求めます。チャネルの集約アップロード帯域幅は、ダウンロードの需要を満たすことができないとき、非対称のネットワークでは、P2Pアプリケーションは、安定したシステムを維持するために、追加のネットワーク内のリソースを求めることができます。"
    },
    {
      "indent": 3,
      "text": "However, some P2P applications using in-network infrastructural resources require flexibility in implementing resource allocation policies. A major competitive advantage of many successful P2P systems is their substantial expertise in how to most efficiently utilize peer and infrastructural resources. For example, many live P2P systems have specific algorithms to select those peers that behave as stable, higher-bandwidth sources. Similarly, the higher-bandwidth sources frequently use algorithms to choose to which peers the source should send content. Developers of these systems continue to fine-tune these algorithms over time.",
      "ja": "しかし、中にネットワークインフラのリソースを使用して、いくつかのP2Pアプリケーションがリソース割り当てポリシーを実装する際の柔軟性が必要です。多くの成功したP2Pシステムの主要な競争上の優位性は、最も効率的にピアとインフラ資源を利用する方法で彼らのかなりの専門知識です。例えば、多くのライブP2Pシステムは、安定したとして振る舞うこれらのピア、高帯域幅のソースを選択するために、特定のアルゴリズムを持っています。同様に、より高い帯域幅の源はしばしばピアどのソースがコンテンツを送信するために選択するアルゴリズムを使用します。これらのシステムの開発者は、時間をかけてこれらのアルゴリズムを微調整し続けます。"
    },
    {
      "indent": 3,
      "text": "To permit developers to evolve and fine-tune their algorithms and policies, the in-network storage should expose basic mechanisms and allow as much flexibility as possible to P2P applications. This conforms to the end-to-end systems principle and allows innovation and satisfaction of specific business goals. Existing techniques for in-network storage in P2P applications lack these capabilities.",
      "ja": "そのアルゴリズムとの方針を進化して微調整するために、開発者を可能にするために、ネットワーク内のストレージは、基本的なメカニズムを公開し、P2Pアプリケーションへの可能な限りの柔軟性を可能にしなければなりません。これは、エンド・ツー・エンドのシステムの原則に準拠し、技術革新と、特定のビジネス目標の満足度を可能にします。 P2Pアプリケーションにおけるネットワーク内のストレージのための既存の技術は、これらの機能を欠いています。"
    },
    {
      "indent": 0,
      "text": "4. Usage Scenarios",
      "section_title": true,
      "ja": "4.使用シナリオ"
    },
    {
      "indent": 3,
      "text": "Usage scenarios are presented to illustrate the problems in both Content Distribution Network (CDN) and P2P scenarios.",
      "ja": "使用シナリオは、コンテンツ配信ネットワーク（CDN）の両方で問題とP2Pのシナリオを説明するために提示されています。"
    },
    {
      "indent": 0,
      "text": "4.1. BitTorrent",
      "section_title": true,
      "ja": "4.1.  BitTorrentの"
    },
    {
      "indent": 3,
      "text": "When a BitTorrent client A uploads a block to multiple peers, the block traverses the last-mile uplink once for each peer. After that, the peer B that just received the block from A also needs to upload through its own last-mile uplink to others when sharing this block. This is not an efficient use of the last-mile uplink. With an in-network storage server, however, the BitTorrent client may upload the block to its in-network storage. Peers may retrieve the block from the in-network storage, reducing the amount of data on the last-mile uplink. If supported by the in-network storage, a peer can also save the block in its own in-network storage while it is being retrieved; the block can then be uploaded from the in-network storage to other peers.",
      "ja": "BitTorrentクライアントAは、複数のピアのブロックをアップロードするとき、ブロックは、各ピアの回ラストマイルのアップリンクを横切ります。その後、ちょうどAからブロックを受信したピアBは、このブロックを共有するときに他の人に独自のラストマイルのアップリンクを介してアップロードする必要があります。これがラストマイルのアップリンクの効率的な使用ではありません。で、ネットワークストレージサーバでは、しかし、BitTorrentクライアントは、その中に、ネットワークストレージへのブロックをアップロードすることができます。ピアは、ラストマイルのアップリンク上のデータの量を減少させる、ネットワーク内のストレージからブロックを取り出すことができます。ネットワーク内のストレージでサポートされている場合、それが取得されている間、ピアは、それ自体で、ネットワークストレージのブロックを保存することができます。ブロックは、その後、他のピアにネットワークストレージからアップロードすることができます。"
    },
    {
      "indent": 3,
      "text": "As previously discussed, BitTorrent or other P2P applications currently cannot explicitly manage which content is placed in the existing P2P caches, nor can they manage access and resource control policies. Applications need to retain flexibility to control the content distribution policies and topology among peers.",
      "ja": "前述したように、BitTorrentのか、他のP2Pアプリケーションは現在、明示的に既存のP2Pのキャッシュに配置されたコンテンツを管理することができない、また彼らは、アクセスおよびリソース制御ポリシーを管理することができます。アプリケーションは、ピア間のコンテンツ配信ポリシーおよびトポロジーを制御するための柔軟性を保持する必要があります。"
    },
    {
      "indent": 0,
      "text": "4.2. Content Publisher",
      "section_title": true,
      "ja": "4.2. コンテンツパブリッシャー"
    },
    {
      "indent": 3,
      "text": "Content publishers may also utilize in-network storage. For example, consider a P2P live streaming application. A Content Publisher typically maintains a small number of sources, each of which distributes blocks in the current play buffer to a set of P2P peers.",
      "ja": "コンテンツの出版社はまた、ネットワークストレージを利用することができます。例えば、P2Pライブストリーミングアプリケーションを考えてみます。コンテンツ発行者は、典型的には、P2Pピアのセットに現在の再生バッファ内のブロックを分配各々が、ソースの小さな数を維持します。"
    },
    {
      "indent": 3,
      "text": "Some content publishers use another hybrid content distribution approach incorporating both P2P and CDN modes. As an example, Internet TV may be implemented as a hybrid CDN/P2P application by distributing content from central servers via a CDN, and also incorporating a P2P mode amongst end hosts and set-top boxes. In-network storage may be beneficial to hybrid CDN/P2P applications as well to support P2P distribution and to enable content publisher standard interfaces and controls.",
      "ja": "一部のコンテンツパブリッシャーは、P2PとCDNモードの両方を取り入れた別のハイブリッドコンテンツ配信アプローチを使用しています。一例として、インターネットTVは、CDNを介して中央サーバからコンテンツを配信し、またエンドホストとセットトップボックス間でP2Pモードを組み込むことによって、ハイブリッドCDN / P2Pアプリケーションとして実装されてもよいです。インネットワークストレージは、P2P配布をサポートし、コンテンツサイト運営者の標準インタフェース及び制御を可能にするためにもハイブリッドCDN / P2Pアプリケーションに有益であり得ます。"
    },
    {
      "indent": 3,
      "text": "However, there is no standard interface for different content publishers to access in-network storage. One streaming content publisher may need the existing in-network storage to support streaming signaling or another such capability, such as transcoding capability, bitmap information, intelligent retransmission, etc., while a different content publisher may only need the in-network storage to distribute files. However, it is reasonable that the application services are only supported by content publishers' original servers and clients, and intelligent data plane transport for those content publishers are supported by in-network storage.",
      "ja": "しかし、異なるコンテンツパブリッシャーは、ネットワーク内のストレージにアクセスするための標準的なインタフェースはありません。異なるコンテンツ発行者が配布することで、ネットワークストレージを必要とするだけかもしれない一つのストリーミングコンテンツの発行者は、等トランスコーディング機能、ビットマップ情報、インテリジェント再送などのストリーミングシグナリングまたは他のそのような能力をサポートするために既存のネットワーク内のストレージを必要とするかもしれませんファイル。しかし、アプリケーション・サービスはコンテンツのみ出版社のオリジナルサーバーとクライアントでサポートされており、それらのコンテンツ発行者のためのインテリジェントなデータ・プレーン・トランスポートがネットワーク内のストレージでサポートされていることが合理的です。"
    },
    {
      "indent": 3,
      "text": "A content publisher also benefits from a standard interface to access in-network storage servers provided by different providers. The standard interface must allow content publishers to retain control over content placed in their own in-network storage and to grant access and resources only to the desired end hosts and peers.",
      "ja": "コンテンツ発行者は、異なるプロバイダによって提供されるアクセスネットワーク内のストレージサーバに標準インタフェースから利益を得ます。標準インターフェースは、コンテンツ発行者が独自にネットワークストレージに配置されたコンテンツに対する制御を保持するためにのみ、所望のエンドホストとピアにアクセスし、リソースを許可することができなければなりません。"
    },
    {
      "indent": 3,
      "text": "In the hybrid CDN/P2P scenario, if only the end hosts can store content in the in-network storage server, the content must be downloaded and then uploaded over the last-mile access link before another peer may retrieve it from an in-network storage server. Thus, in this deployment scenario, it may be advantageous for a content publisher or CDN provider to store content in in-network storage servers.",
      "ja": "ハイブリッドCDN / P2Pのシナリオでは、唯一のエンドホストは、ネットワーク内のストレージサーバにコンテンツを格納することができた場合、コンテンツがダウンロードされ、その後、別のピアがネットワーク内からそれを検索することができる前に、ラストマイルアクセスリンク上でアップロードする必要がありますストレージサーバ。したがって、この展開シナリオでは、コンテンツ発行者またはインネットワークストレージサーバにコンテンツを保存するためのCDNプロバイダのために有利であり得ます。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "There are several security considerations related to in-network storage.",
      "ja": "で、ネットワークストレージに関連するいくつかのセキュリティ上の考慮事項があります。"
    },
    {
      "indent": 0,
      "text": "5.1. Denial-of-Service Attacks",
      "section_title": true,
      "ja": "5.1. サービス拒否攻撃"
    },
    {
      "indent": 3,
      "text": "An attacker can try to consume a large portion of the in-network storage, or exhaust the connections of the in-network storage through a denial-of-service (DoS) attack. Authentication, authorization, and accounting mechanisms should be considered in the cross-domain environment. Limitation of access from an administrative domain sets up barriers for content distribution.",
      "ja": "攻撃者は、ネットワーク内のストレージの大部分を消費しようとする、またはサービス拒否（DoS）攻撃を介して、ネットワークストレージの接続を排出することができます。認証、許可、アカウンティングメカニズムは、クロスドメイン環境に考慮しなければなりません。管理ドメインからのアクセスの制限は、コンテンツ配信のための障壁を設定します。"
    },
    {
      "indent": 0,
      "text": "5.2. Copyright and Legal Issues",
      "section_title": true,
      "ja": "5.2. 著作権と法的な問題"
    },
    {
      "indent": 3,
      "text": "Copyright and other laws may prevent the distribution of certain content in various localities. In-network storage operators may adopt system-wide ingress or egress filters to implement necessary policies for storing or retrieving content, and applications may apply Digital Rights Management (DRM) to the data stored in the network storage. However, the specification and implementation of such policies (e.g., filtering and DRM) is not in scope for the problem this document proposes to solve.",
      "ja": "著作権及びその他の法律では、様々な地域における特定のコンテンツの配信を防ぐことができます。ネットワーク内のストレージ事業者は、コンテンツを保存または取得するために必要なポリシーを実装するために、システム全体の入力または出力フィルタを採用することができる、とアプリケーションがネットワークストレージに格納されたデータにデジタル著作権管理（DRM）を適用することができます。しかしながら、そのようなポリシー（例えば、フィルタリング、およびDRM）の仕様と実装は、このドキュメントが解決することを提案している問題のスコープ内にありません。"
    },
    {
      "indent": 0,
      "text": "5.3. Traffic Analysis",
      "section_title": true,
      "ja": "5.3. トラフィック分析"
    },
    {
      "indent": 3,
      "text": "If the content is stored in the provider-based in-network storage, there may be a risk to privacy: a malicious service provider could use some link that a victim user is interested in, estimate that another user accessing the same data may have the same interest, and use this information as a basis to perform a phishing attack on the other user.",
      "ja": "コンテンツはプロバイダベースで、ネットワークストレージに保存されている場合は、プライバシーのリスクがあるかもしれない：悪質なサービスプロバイダは、被害者のユーザーが同じデータにアクセスして、他のユーザーが持っているかもしれ見積もり、に興味があることを、いくつかのリンクを使用することができます同じ興味、そして他のユーザーにフィッシング攻撃を実行するための基礎として、この情報を使用しています。"
    },
    {
      "indent": 0,
      "text": "5.4. Modification of Information",
      "section_title": true,
      "ja": "5.4. 情報の変更"
    },
    {
      "indent": 3,
      "text": "This type of threat means that some unauthorized entity may alter in-transit in-network storage access messages generated on behalf of an authorized principal in such a way as to effect unauthorized management operations, including falsifying the value of an object. This threat may result in false data being supplied either because the data on a legitimate store is modified or because a bogus store is introduced into the network.",
      "ja": "脅威のこのタイプは、オブジェクトの値を改ざんなどの不正管理操作を行うためのように、いくつかの不正なエンティティが、このような方法で許可さ主に代わって生成されたイン・トランジットでネットワークストレージアクセスメッセージを変更することができることを意味します。この脅威は、正当なストア上のデータが変更されるため、または偽のストアがネットワークに導入されるので、いずれかの供給される誤ったデータをもたらし得ます。"
    },
    {
      "indent": 0,
      "text": "5.5. Masquerade",
      "section_title": true,
      "ja": "5.5. 仮装"
    },
    {
      "indent": 3,
      "text": "This type of threat means that an unauthorized entity gains access to a system or performs a malicious act by illegitimately posing as an authorized entity. In the context of this specification, when accessing in-network storage, one malicious end host can masquerade as another authorized end host or application server to access a protected resource in the in-network storage.",
      "ja": "脅威のこのタイプは、不正なエンティティがシステムにアクセスを得るか、不正権限のある機関のふりをすることによって、悪意のある行為を実行することを意味します。本明細書の文脈では、ネットワーク内のストレージにアクセスする場合、1つの悪意のあるエンドホストは、ネットワーク内のストレージに保護されたリソースにアクセスするために別の認可されたエンドホストまたはアプリケーションサーバになりすますことができます。"
    },
    {
      "indent": 0,
      "text": "5.6. Disclosure",
      "section_title": true,
      "ja": "5.6. 開示"
    },
    {
      "indent": 3,
      "text": "This type of threat involves the danger of someone eavesdropping on exchanges between in-network storage and application clients. Protecting against this threat may be required as a matter of application policy.",
      "ja": "脅威のこのタイプでは、ネットワークストレージ、アプリケーションクライアント間の交流に盗聴誰かの危険を伴います。この脅威からの保護するアプリケーションポリシーの問題として必要になることがあります。"
    },
    {
      "indent": 0,
      "text": "5.7. Message Stream Modification",
      "section_title": true,
      "ja": "5.7. メッセージストリーム変更"
    },
    {
      "indent": 3,
      "text": "This type of threat means that messages may be maliciously re-ordered, delayed, or replayed to an extent greater than what would occur in a natural network system, in order to effect unauthorized management operations on in-network storage. If the middlebox (such as a Network Address Translator (NAT)) or proxy between an end host and in-network storage is compromised, it is easy to do a stream modification attack.",
      "ja": "脅威のこのタイプは、メッセージが悪意を持って、再順序付け遅延、またはインネットワークストレージ上の不正管理操作を行うために、天然のネットワークシステムで生じるものよりも大きな程度まで再生されてもよいことを意味します。ストレージエンドホスト間でネットワークまたはプロキシ（たとえば、ネットワークアドレス変換（NAT）など）、ミドルが侵害された場合は、ストリームの修正攻撃を行うことは容易です。"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgments",
      "section_title": true,
      "ja": "6.謝辞"
    },
    {
      "indent": 3,
      "text": "We would like to thank the following people for contributing to this document:",
      "ja": "私たちは、この文書に貢献するために、以下の人々に感謝したいと思います："
    },
    {
      "indent": 3,
      "text": "Ronald Bonica",
      "ja": "ロナルド・ニース"
    },
    {
      "indent": 3,
      "text": "David Bryan",
      "ja": "デヴィッド・ブライアン"
    },
    {
      "indent": 3,
      "text": "Kar Ann Chew",
      "ja": "アンチューにより、"
    },
    {
      "indent": 3,
      "text": "Lars Eggert",
      "ja": "ラースEggertの"
    },
    {
      "indent": 3,
      "text": "Roni Even",
      "ja": "ロニでも"
    },
    {
      "indent": 3,
      "text": "Adrian Farrel",
      "ja": "エイドリアン・ファレル"
    },
    {
      "indent": 3,
      "text": "Yingjie Gu",
      "ja": "英GU傑"
    },
    {
      "indent": 3,
      "text": "David Harrington",
      "ja": "デヴィッド・ハリントン"
    },
    {
      "indent": 3,
      "text": "Leif Johansson",
      "ja": "レイフ・ヨハンソン"
    },
    {
      "indent": 3,
      "text": "Francois Le Faucheur",
      "ja": "フランソワ・リーパー"
    },
    {
      "indent": 3,
      "text": "Hongqiang Liu",
      "ja": "香港強いリットルIU"
    },
    {
      "indent": 3,
      "text": "Tao Ma",
      "ja": "タオ馬"
    },
    {
      "indent": 3,
      "text": "Borje Ohlman",
      "ja": "Borje Ohlman"
    },
    {
      "indent": 3,
      "text": "Akbar Rahman",
      "ja": "ラーマン最大"
    },
    {
      "indent": 3,
      "text": "Peter Saint-Andre",
      "ja": "ピーターサンタンドレ"
    },
    {
      "indent": 3,
      "text": "Robert Sparks",
      "ja": "ロバート・スパークス"
    },
    {
      "indent": 3,
      "text": "Sean Turner",
      "ja": "ショーン・ターナー"
    },
    {
      "indent": 3,
      "text": "Yu-shun Wang",
      "ja": "旬王Y U-"
    },
    {
      "indent": 3,
      "text": "Richard Woundy",
      "ja": "リチャードWoundy"
    },
    {
      "indent": 3,
      "text": "Yunfei Zhang",
      "ja": "非張Y UN"
    },
    {
      "indent": 0,
      "text": "7. Informative References",
      "section_title": true,
      "ja": "7.参考文献"
    },
    {
      "indent": 3,
      "text": "[DCIA] Parker, A., \"P2P Media Summit presentation\", Distributed Computing Industry Association, October 2006, <http://www.dcia.info/activities/p2pmsla2006/ CacheLogic.ppt>.",
      "ja": "[DCIA]パーカー、A.、 \"P2Pメディアサミット・プレゼンテーション\" は、コンピューティング産業協会、2006年10月、<http://www.dcia.info/activities/p2pmsla2006/ CacheLogic.ppt>を分散。"
    },
    {
      "indent": 3,
      "text": "[Data_Lockers] Yang, Y., \"Open Content Distribution using Data Lockers\", CoXNet Workshop, Beijing, China, November 2010, <http:// cs-www.cs.yale.edu/homes/yry/projects/p4p/ open-data-lockers-nov-2010-coxnet.pdf>.",
      "ja": "[Data_Lockers]ヤン、Y.、 \"データロッカーを使用してオープンコンテンツ配信\"、CoXNetワークショップ、北京、中国、2010年11月、<のhttp：// cs-www.cs.yale.edu/homes/yry/projects/p4p/オープンデータ・ロッカー11月-2010-coxnet.pdf>。"
    },
    {
      "indent": 3,
      "text": "[ICNP] Wu, H., \"Challenges and Opportunities of Internet Developments in China\", ICNP 2007 Keynote Speech, October 2007, <http://www.ieee-icnp.org/2007/keynote_D.html>.",
      "ja": "[ICNP]呉、H.、 \"挑戦と中国のインターネットの発展の機会\"、ICNP 2007基調講演、2007年10月、<http://www.ieee-icnp.org/2007/keynote_D.html>。"
    },
    {
      "indent": 3,
      "text": "[P2P_File_Sharing] Casadesus-Masanell, R. and A. Hervas-Drane, \"Peer-to-Peer File Sharing and the Market for Digital Information Goods\", Journal of Economics & Management Strategy, Vol. 19, No. 2, pp. 333-373, Summer 2010.",
      "ja": "[P2P_File_Sharing]カサドシュ-Masanell、R.とA.エルバス-Drane、「ピア・ツー・ピアのファイル共有やデジタル情報財のための市場」、経済・経営戦略誌、Vol。 19、第2号、頁333から373まで、2010年夏。"
    },
    {
      "indent": 3,
      "text": "[RFC5693] Seedorf, J. and E. Burger, \"Application-Layer Traffic Optimization (ALTO) Problem Statement\", RFC 5693, October 2009.",
      "ja": "[RFC5693]セードルフ、J.およびE.バーガー、 \"アプリケーション層のトラフィックの最適化（ALTO）問題文\"、RFC 5693、2009年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC6392] Alimi, R., Ed., Rahman, A., Ed., and Y. Yang, Ed., \"A Survey of In-Network Storage Systems\", RFC 6392, October 2011.",
      "ja": "[RFC6392] Alimi、R.、エド。、ラーマン、A.編、およびY.ヤン、エド。、RFC 6392 \"では、ネットワークストレージシステムの調査\"、2011年10月。"
    },
    {
      "indent": 3,
      "text": "[ipoque_Internet_Study] Schulze, H. and K. Mochalski, \"Internet Study 2008/2009\", 2009, <http://www.ipoque.com/resources/internet-studies>.",
      "ja": "[Ipoque_Internet_Study]シュルツ、H.とK. Mochalski、 \"インターネット調査2008/2009\"、2009年<http://www.ipoque.com/resources/internet-studies>。"
    },
    {
      "indent": 3,
      "text": "[ipoque_P2P_Survey] \"ipoque's 2007 P2P Survey to be presented at Technology Review's Emerging Technologies Conference at MIT\", August 2007, <http://www.ipoque.com/en/news-events/ press-center/press-releases/2007/ ipoque%C2%B4s-2007-p2p-survey-to-be-presented-at-technology>.",
      "ja": "[ipoque_P2P_Survey]、2007年8月、<http://www.ipoque.com/en/news-events/プレスセンター/プレスリリース/ 2007「ipoqueの2007年のP2P調査は、MITのテクノロジーレビューの新興技術会議で発表します」 / ipoque％C2％B4S-2007-P2P-調査ツー・提示すること・アット・テクノロジー>。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Haibin Song Huawei 101 Software Avenue, Yuhua District Nanjing, Jiangsu Province 210012 China",
      "ja": "101ソフトウェアの大通りにH AIビン松花江、Y Uビデオ地区のNaN北京、江蘇省210012中国"
    },
    {
      "indent": 3,
      "text": "EMail: haibin.song@huawei.com",
      "ja": "メールアドレス：haibin.song@huawei.com"
    },
    {
      "indent": 3,
      "text": "Ning Zong Huawei 101 Software Avenue, Yuhua District Nanjing, Jiangsu Province 210012 China",
      "ja": "NI 101ソフトウェアの大通りにGH UA上のZは、Y U描く地区のNaN北京、江蘇省210012中国"
    },
    {
      "indent": 3,
      "text": "EMail: zongning@huawei.com",
      "ja": "メールアドレス：zongning@huawei.com"
    },
    {
      "indent": 3,
      "text": "Y. Richard Yang Yale University",
      "ja": "エール大学のY.リチャード・ヤン"
    },
    {
      "indent": 3,
      "text": "EMail: yry@cs.yale.edu",
      "ja": "メールアドレス：yry@cs.yale.edu"
    },
    {
      "indent": 3,
      "text": "Richard Alimi Google",
      "ja": "リチャードAlimiグーグル"
    },
    {
      "indent": 3,
      "text": "EMail: ralimi@google.com",
      "ja": "メールアドレス：ralimi@google.com"
    }
  ]
}