{
  "title": {
    "text": "RFC 6542 - Kerberos Version 5 Generic Security Service Application Program Interface (GSS-API) Channel Binding Hash Agility",
    "ja": "RFC 6542 - Kerberosバージョン5の汎用セキュリティサービスアプリケーションプログラムインタフェース（GSS-API）チャンネルはハッシュアジリティをバインド"
  },
  "number": 6542,
  "created_at": "2019-10-27 12:08:44.173157+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                          S. Emery\nRequest for Comments: 6542                                        Oracle\nUpdates: 4121                                                 March 2012\nCategory: Standards Track\nISSN: 2070-1721",
      "raw": true
    },
    {
      "indent": 4,
      "text": "                       Kerberos Version 5\nGeneric Security Service Application Program Interface (GSS-API)\n                  Channel Binding Hash Agility",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "Currently, channel bindings are implemented using an MD5 hash in the Kerberos Version 5 Generic Security Service Application Programming Interface (GSS-API) mechanism (RFC 4121). This document updates RFC 4121 to allow channel bindings using algorithms negotiated based on Kerberos crypto framework as defined in RFC 3961. In addition, because this update makes use of the last extensible field in the Kerberos client-server exchange message, extensions are defined to allow future protocol extensions.",
      "ja": "現在、チャネルバインディングは、Kerberosバージョン5の汎用セキュリティサービスアプリケーションプログラミングインターフェイス（GSS-API）メカニズム（RFC 4121）でのMD5ハッシュを使用して実装されています。また、RFC 3961.で定義されているアルゴリズムを使用してチャネルバインディングは、この更新は、Kerberosクライアント・サーバ・交換メッセージの最後の拡張可能なフィールドを使用するため、拡張ができるように定義され、Kerberosの暗号化フレームワークに基づいてネゴシエートできるようにするには、このドキュメントの更新のRFC 4121将来のプロトコル拡張。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6542.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6542で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2012 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2012 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Conventions Used in This Document ...............................2\n3. Channel Binding Hash Agility ....................................2\n   3.1. Structure of the Exts Field ................................3\n   3.2. The Channel Binding Extension ..............................4\n4. Security Considerations .........................................4\n5. IANA Considerations .............................................4\n6. Acknowledgments .................................................5\n7. References ......................................................5\n   7.1. Normative References .......................................5\n   7.2. Informative References .....................................5",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "With the recently discovered weaknesses in the MD5 hash algorithm (see [RFC6151]), there is a need to use stronger hash algorithms. The Kerberos Version 5 Generic Security Service Application Programming Interface (GSS-API) mechanism [RFC4121] uses MD5 to calculate channel binding verifiers. This document specifies an update to the mechanism that allows it to create channel binding information based on negotiated algorithms. This will allow deploying new algorithms incrementally without breaking interoperability with older implementations when new attacks arise in the future.",
      "ja": "MD5ハッシュアルゴリズムで最近発見された弱点と、より強力なハッシュアルゴリズムを使用する必要があります（[RFC6151]参照）。 Kerberosバージョン5の汎用セキュリティサービスアプリケーションプログラミングインターフェイス（GSS-API）メカニズム[RFC4121]はチャネル結合ベリファイアを計算するためにMD5を使用しています。この文書では、それが交渉されたアルゴリズムに基づいて、チャネルバインディング情報を作成することを可能にするメカニズムへの更新を指定します。これは、新しい攻撃が将来発生時に古い実装との相互運用性を壊すことなく、増分新しいアルゴリズムを導入することができます。"
    },
    {
      "indent": 0,
      "text": "2. Conventions Used in This Document",
      "section_title": true,
      "ja": "この文書で使用される2.表記"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 3,
      "text": "The term \"little-endian order\" is used for brevity to refer to the least-significant-octet-first encoding, while the term \"big-endian order\" is used for the most-significant-octet-first encoding.",
      "ja": "用語「ビッグエンディアン順序は、」最上位オクテット - 最初の符号化に使用されている間用語「リトルエンディアン順序は、」、最下位オクテット - 最初のエンコーディングを参照するために簡潔にするために使用されます。"
    },
    {
      "indent": 0,
      "text": "3. Channel Binding Hash Agility",
      "section_title": true,
      "ja": "3.チャンネルはハッシュアジリティをバインド"
    },
    {
      "indent": 3,
      "text": "When generating a channel binding verifier, Bnd, a hash is computed from the channel binding fields. Initiators MUST populate the Bnd field in order to maintain interoperability with existing acceptors. In addition, initiators MUST populate the extension field (Exts) defined below.",
      "ja": "チャネル結合ベリファイアを生成する際に、無買デーは、ハッシュは、フィールドを結合チャネルから計算されます。イニシエータは、既存のアクセプターとの相互運用性を維持するために、無買デーフィールドを移入する必要があります。また、開始剤は、以下に定義される拡張フィールド（EXTS）を投入しなければなりません。"
    },
    {
      "indent": 0,
      "text": "3.1. Structure of the Exts Field",
      "section_title": true,
      "ja": "3.1.  EXTSフィールドの構造"
    },
    {
      "indent": 3,
      "text": "The 0x8003 GSS checksum has the same structure described in [RFC4121] except that the Exts field is now defined; the entire structure of the 0x8003 checksum, including the now defined Exts field, follows:",
      "ja": "0x8003 GSSチェックサムはEXTSフィールドは現在定義されていることを除いて、[RFC4121]で説明したのと同じ構造を有しています。 0x8003チェックサムの全体構造は、今で定義されたEXTSフィールドを含め、次のとおりです。"
    },
    {
      "indent": 6,
      "text": "Octet     Name       Description\n-----------------------------------------------------------------\n0..3      Lgth       Number of octets in Bnd field, represented\n                      in little-endian order;  currently contains\n                      hex value 10 00 00 00 (16).\n4..19     Bnd        Channel binding information, as described in\n                      Section 4.1.1.2 of [RFC4121].\n20..23    Flags      Four-octet context-establishment flags in\n                      little-endian order as described in Section\n                      4.1.1.1 of [RFC4121].\n24..25    DlgOpt     The delegation option identifier (=1) in\n                      little-endian order [optional].  This field\n                      and the next two fields are present if and\n                      only if GSS_C_DELEG_FLAG is set as described\n                      in Section 4.1.1.1 of [RFC4121].\n26..27    Dlgth      The length of the Deleg field in\n                      little-endian order [optional].\n28..(n-1) Deleg      KRB_CRED message (n = Dlgth + 28) [optional].\nn..last   Exts       Extensions.",
      "raw": true
    },
    {
      "indent": 6,
      "text": "where Exts is the concatenation of zero, one, or more individual extensions, each of which consists of the following, in order:",
      "ja": "EXTSは順番に、以下から成る各々は、ゼロ、1つ、またはそれ以上の個々のエクステンションの連結があります。"
    },
    {
      "indent": 9,
      "text": "type -- big-endian-order unsigned integer, 32 bits, which contains the type of extension length -- big-endian-order unsigned integer, 32 bits, which contains the length, in octets, of the extension data encoded as an array of octets immediately following this field data -- octet string of extension information",
      "ja": "タイプ - 拡張長のタイプを含むビッグエンディアン順符号なし整数、32ビット、 - 長さを含むビッグエンディアン順符号なし整数、32ビット、オクテットにおいて、アレイとして符号化された拡張データの拡張情報のオクテット文字列を - すぐにこのフィールドのデータを次のオクテット"
    },
    {
      "indent": 6,
      "text": "If multiple extensions are present, then there MUST be at most one instance of a given extension type.",
      "ja": "複数の拡張子が存在する場合には、与えられた拡張タイプの最大1つのインスタンスがあるに違いありません。"
    },
    {
      "indent": 0,
      "text": "3.2. The Channel Binding Extension",
      "section_title": true,
      "ja": "3.2. チャンネルバインディング拡張"
    },
    {
      "indent": 3,
      "text": "When channel binding is used, the Exts MUST include the following extension:",
      "ja": "チャネル結合が使用される場合、EXTSは、以下の拡張子を含める必要があります。"
    },
    {
      "indent": 6,
      "text": "data-type 0x00000000",
      "ja": "データ型0x00000000の"
    },
    {
      "indent": 6,
      "text": "data-value",
      "ja": "データ値"
    },
    {
      "indent": 9,
      "text": "The output obtained by applying the Kerberos V get_mic operation [RFC3961] with key usage number 43 to the channel binding data as described in [RFC4121], Section 4.1.1.2 (using get_mic instead of MD5). The key used is the sub-session key from the authenticator, if it is present; otherwise, the key used is the session key from the ticket. The get_mic algorithm is chosen as the \"required checksum mechanism\" for the encryption type of the key used.",
      "ja": "[RFC4121]で説明されるようにデータを結合チャネル、セクション4.1.1.2に鍵用途番号43にケルベロスV get_mic操作[RFC3961]を適用して得られた出力は、（代わりにMD5のget_mic使用します）。それが存在する場合に使用される鍵は、認証者からのサブセッション鍵です。そうでない場合は、使用されるキーは、チケットからのセッションキーです。 get_micアルゴリズムが使用される鍵の暗号化タイプのために「必要なチェックサム機構」として選択されています。"
    },
    {
      "indent": 3,
      "text": "Initiators that are unwilling to use an MD5 hash of the channel bindings MUST set the Bnd field to sixteen octets of hex value FF.",
      "ja": "チャネルバインディングのMD5ハッシュを使用したくないですイニシエータは16進値FFの16個のオクテットに無買デーのフィールドを設定しなければなりません。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "With this mechanism, initiators get no indication as to whether the acceptors check or ignore channel bindings.",
      "ja": "この仕組みでは、開始剤は、アクセプターは、チャネルバインディングを確認するか、無視するかどうかについての兆候を取得していません。"
    },
    {
      "indent": 3,
      "text": "It is up to the application whether or not to enforce the use of channel bindings. [RFC5056] and [RFC5554] give guidance for application developers on channel binding usage.",
      "ja": "これは、チャネルバインディングの使用を強制するか否かのアプリケーション次第です。 [RFC5056]及び[RFC5554]チャネル結合用途にアプリケーション開発者のための指針を与えます。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "ja": "5. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has created a new top-level registry titled \"Kerberos V GSS-API Mechanism Parameters,\" separate from the existing Kerberos parameters registry. Within this registry, IANA has created a sub-registry of \"Kerberos V GSS-API Mechanism Extension Types\" with four-field entries (Type Number, Type Name, Description, and Reference) and, initially, a single registration: 0x00000000, \"Channel Binding MIC,\" \"Extension for the verifier of the channel bindings,\" [RFC6542].",
      "ja": "IANAは既存のKerberosパラメータレジストリから独立し題した新しいトップレベルのレジストリ「ケルベロスV GSS-APIメカニズムのパラメータを、」作成しました。 \"、0x00000000の：このレジストリ内で、IANAは、最初に、単一の登録を4フィールドのエントリ（タイプ番号、タイプ名、説明、および参照）と「ケルベロスV GSS-APIメカニズムの拡張タイプ」のサブレジストリを作成していますMIC結合チャネル 『」チャネルバインディングの検証のための拡張、』 [RFC6542]。"
    },
    {
      "indent": 3,
      "text": "Using the guidelines for allocation as described in [RFC5226], type number assignments are as follows:",
      "ja": "[RFC5226]で説明されるように割り当てのためのガイドラインを使用して、次のようにタイプ番号の割り当ては、次のとおりです。"
    },
    {
      "indent": 7,
      "text": "0x00000000 - 0x000003FF IETF Review",
      "ja": "0x00000000の -  0x000003FF IETFレビュー"
    },
    {
      "indent": 7,
      "text": "0x00000400 - 0xFFFFF3FF Specification Required",
      "ja": "0x00000400  -  0xFFFFF3FF仕様が必要"
    },
    {
      "indent": 7,
      "text": "0xFFFFF400 - 0xFFFFFFFF Private Use",
      "ja": "0xFFFFF400  -  0xFFFFFFFFのプライベート使用"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgments",
      "section_title": true,
      "ja": "6.謝辞"
    },
    {
      "indent": 3,
      "text": "The author would like to thank Larry Zhu, Nicolas Williams, Sam Hartman, Jeffrey Hutzelman, and Simon Josefsson for their help in reviewing and providing valuable feedback on this document.",
      "ja": "著者は、この文書に貴重なフィードバックを見直し、提供する彼らの助けのためにラリー朱、ニコラス・ウィリアムズ、サム・ハートマン、ジェフリーHutzelman、サイモンJosefsson氏に感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7.参考"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "ja": "7.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3961] Raeburn, K., \"Encryption and Checksum Specifications for Kerberos 5\", RFC 3961, February 2005.",
      "ja": "[RFC3961]レイバーン、K.、 \"暗号化とケルベロス5チェックサムの仕様\"、RFC 3961、2005年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC4121] Zhu, L., Jaganathan, K., and S. Hartman, \"The Kerberos Version 5 Generic Security Service Application Program Interface (GSS-API) Mechanism: Version 2\", RFC 4121, July 2005.",
      "ja": "[RFC4121]朱、L.、Jaganathan、K.、およびS.ハートマン、 \"Kerberosバージョン5の汎用セキュリティサービスアプリケーションプログラムインタフェース（GSS-API）メカニズム：バージョン2\"、RFC 4121、2005年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC5226] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 5226, May 2008.",
      "ja": "[RFC5226] Narten氏、T.とH. Alvestrand、 \"RFCsにIANA問題部に書くためのガイドライン\"、BCP 26、RFC 5226、2008年5月。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "ja": "7.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC5056] Williams, N., \"On the Use of Channel Bindings to Secure Channels\", RFC 5056, November 2007.",
      "ja": "\"チャネルを確保するチャネルバインディングの使用について\" [RFC5056]ウィリアムズ、N.、RFC 5056、2007年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC5554] Williams, N., \"Clarifications and Extensions to the Generic Security Service Application Program Interface (GSS-API) for the Use of Channel Bindings\", RFC 5554, May 2009.",
      "ja": "[RFC5554]ウィリアムズ、N.、RFC 5554、2009年05月05日「チャネルバインディングの使用のための一般的なセキュリティサービスアプリケーションプログラムインタフェース（GSS-API）への明確化と拡大」。"
    },
    {
      "indent": 3,
      "text": "[RFC6151] Turner, S. and L. Chen, \"Updated Security Considerations for the MD5 Message-Digest and the HMAC-MD5 Algorithms\", RFC 6151, March 2011.",
      "ja": "[RFC6151]ターナー、S.とL.チェン、 \"MD5メッセージダイジェストとHMAC-MD5アルゴリズムのための更新されたセキュリティ上の考慮事項\"、RFC 6151、2011年3月。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Shawn Emery Oracle 500 Eldorado Blvd, Building 1 Broomfield, CO 80021 USA",
      "ja": "1ブルームフィールド、CO 80021 USAの構築ショーン・エメリオラクル500エルドラドブールバード、"
    },
    {
      "indent": 3,
      "text": "EMail: shawn.emery@oracle.com",
      "ja": "メールアドレス：shawn.emery@oracle.com"
    }
  ]
}