{
  "title": {
    "text": "RFC 6740 - Identifier-Locator Network Protocol (ILNP) Architectural Description",
    "ja": "RFC 6740 - 識別子ロケータネットワークプロトコル（ILNP）アーキテクチャの説明"
  },
  "number": 6740,
  "created_at": "2019-10-30 04:06:19.332934+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Research Task Force (IRTF)                          RJ Atkinson\nRequest for Comments: 6740                                    Consultant\nCategory: Experimental                                         SN Bhatti\nISSN: 2070-1721                                            U. St Andrews\n                                                           November 2012",
      "raw": true
    },
    {
      "indent": 2,
      "text": "Identifier-Locator Network Protocol (ILNP) Architectural Description",
      "ja": "識別子ロケータネットワークプロトコル（ILNP）アーキテクチャの説明"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document provides an architectural description and the concept of operations for the Identifier-Locator Network Protocol (ILNP), which is an experimental, evolutionary enhancement to IP. This is a product of the IRTF Routing Research Group.",
      "ja": "この文書では、アーキテクチャの記述およびIPの実験、進化的エンハンスメントの識別子、ロケータネットワークプロトコル（ILNP）、のための操作の概念を提供します。これはIRTFのルーティング研究グループの製品です。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for examination, experimental implementation, and evaluation.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、検査、実験的な実装、および評価のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document defines an Experimental Protocol for the Internet community. This document is a product of the Internet Research Task Force (IRTF). The IRTF publishes the results of Internet-related research and development activities. These results might not be suitable for deployment. This RFC represents the individual opinion(s) of one or more members of the Routing Research Group of the Internet Research Task Force (IRTF). Documents approved for publication by the IRSG are not a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "この文書は、インターネットコミュニティのためにExperimentalプロトコルを定義します。この文書はインターネットResearch Task Force（IRTF）の製品です。 IRTFはインターネット関連の研究開発活動の成果を公表しています。これらの結果は、展開に適していない可能性があります。このRFCはインターネットResearch Task Force（IRTF）のルーティング研究グループの1つまたは複数のメンバーの個々の意見（複数可）を表しています。 IRSGによって公表のために承認されたドキュメントは、インターネット標準の任意のレベルの候補ではありません。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6740.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6740で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2012 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2012 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。"
    },
    {
      "indent": 3,
      "text": "This document may not be modified, and derivative works of it may not be created, except to format it for publication as an RFC or to translate it into languages other than English.",
      "ja": "RFCとして公表のためにそれをフォーマットしたり、英語以外の言語に翻訳することを除いて、このドキュメントは変更されないことがあり、それの派生作品が作成されないことがあります。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n   1.1. Document Roadmap ...........................................5\n   1.2. History ....................................................6\n   1.3. Terminology ................................................7\n2. Architectural Overview ..........................................7\n   2.1. Identifiers and Locators ...................................7\n   2.2. Deprecating IP Addresses ...................................9\n   2.3. Session Terminology .......................................10\n   2.4. Other Goals ...............................................12\n3. Architectural Changes Introduced by ILNP .......................12\n   3.1. Identifiers ...............................................12\n   3.2. Locators ..................................................14\n   3.3. IP Address and Identifier-Locator Vector (I-LV) ...........16\n   3.4. Notation ..................................................16\n   3.5. Transport-Layer State and Transport Pseudo-Headers ........18\n   3.6. Rationale for This Document ...............................18\n   3.7. ILNP Multicasting .........................................19\n4. ILNP Basic Connectivity ........................................20\n   4.1. Basic Local Configuration .................................20\n   4.2. I-L Communication Cache ...................................21\n   4.3. Packet Forwarding .........................................22\n   4.4. Packet Routing ............................................23\n5. Multihoming and Multi-Path Transport ...........................24\n   5.1. Host Multihoming (H-MH) ...................................25\n   5.2. Support for Multi-Path Transport Protocols ................27\n   5.3. Site Multihoming (S-MH) ...................................28\n   5.4. Multihoming Requirements for Site Border Routers ..........29\n6. Mobility .......................................................30\n   6.1. Mobility / Multihoming Duality in ILNP ....................31\n   6.2. Host Mobility .............................................32",
      "raw": true
    },
    {
      "indent": 3,
      "text": "   6.3. Network Mobility ..........................................34\n   6.4. Mobility Requirements for Site Border Routers .............36\n   6.5. Mobility with Multiple SBRs ...............................36\n7. IP Security for ILNP ...........................................36\n   7.1. Adapting IP Security for ILNP .............................37\n   7.2. Operational Use of IP Security with ILNP ..................37\n8. Backwards Compatibility and Incremental Deployment .............38\n9. Security Considerations ........................................39\n   9.1. Authentication of Locator Updates .........................39\n   9.2. Forged Identifier Attacks .................................40\n   9.3. IP Security Enhancements ..................................42\n   9.4. DNS Security ..............................................42\n   9.5. Firewall Considerations ...................................42\n   9.6. Neighbour Discovery Authentication ........................42\n   9.7. Site Topology Obfuscation .................................43\n10. Privacy Considerations ........................................43\n   10.1. Location Privacy .........................................43\n   10.2. Identity Privacy .........................................44\n11. References ....................................................45\n   11.1. Normative References .....................................45\n   11.2. Informative References ...................................47\n12. Acknowledgements ..............................................53",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "This document is part of the ILNP document set, which has had extensive review within the IRTF Routing RG. ILNP is one of the recommendations made by the RG Chairs. Separately, various refereed research papers on ILNP have also been published during this decade. So, the ideas contained herein have had much broader review than the IRTF Routing RG. The views in this document were considered controversial by the Routing RG, but the RG reached a consensus that the document still should be published. The Routing RG has had remarkably little consensus on anything, so virtually all Routing RG outputs are considered controversial.",
      "ja": "この文書では、IRTFのルーティングRG内の大規模な見直しがあったILNPのドキュメントセットの一部です。 ILNPはRGの議長の勧告の一つです。これとは別に、ILNP上の様々な査読研究論文も、この十年の間に発表されています。だから、ここに含まれているアイデアはIRTFのルーティングRGよりもはるかに広いのレビューを持っていました。この文書に記載されているビューは、ルーティングRGで物議を醸すと考えられるが、RGは、文書がまだ公表されるべきであると合意に達しました。ルーティングRGので、事実上、すべてのルーティングRGの出力が物議を考慮され、何も上著しく少しコンセンサスがありました。"
    },
    {
      "indent": 3,
      "text": "At present, the Internet research and development community is exploring various approaches to evolving the Internet Architecture to solve a variety of issues including, but not limited to, scalability of inter-domain routing [RFC4984]. A wide range of other issues (e.g., site multihoming, node multihoming, site/subnet mobility, node mobility) are also active concerns at present. Several different classes of evolution are being considered by the Internet research and development community. One class is often called \"Map and Encapsulate\", where traffic would be mapped and then tunnelled through the inter-domain core of the Internet. Another class being considered is sometimes known as \"Identifier/Locator Split\". This document relates to a proposal that is in the latter class of evolutionary approaches.",
      "ja": "現在では、インターネットの研究開発コミュニティは、以下を含むさまざまな問題を解決するために、インターネットアーキテクチャの進化に様々なアプローチを模索しているが、これらに限定されない、ドメイン間ルーティングのスケーラビリティ[RFC4984]。他の問題（例えば、サイトマルチホーミング、ノードマルチホーミング、サイト/サブネットモビリティ、ノードモビリティ）の広い範囲も、現時点でアクティブな関心事です。進化のいくつかの異なるクラスは、インターネットの研究開発コミュニティによって検討されています。一つのクラスは、多くの場合、トラフィックがマッピングされ、その後、インターネットのドメイン間のコアを通ってトンネルされることになる「マップとカプセル化」と呼ばれます。別のクラスは時々、「識別子/ロケータスプリット」として知られているとみなされています。この文書は、進化手法の後者のクラスにある提案に関する。"
    },
    {
      "indent": 3,
      "text": "There has been substantial research relating to naming in the Internet through the years [IEN1] [IEN19] [IEN23] [IEN31] [IEN135] [RFC814] [RFC1498] [RFC2956]. Much of that research has indicated that binding the end-to-end transport-layer session state with a specific interface of a node at a specific location is undesirable, for example, creating avoidable issues for mobility, multihoming, and end-to-end security. More recently, mindful of that important prior work, and starting well before the Routing RG was re-chartered to focus on inter-domain routing scalability, the authors have been examining enhancements to certain naming aspects of the Internet Architecture. Separately, the Internet Architecture Board (IAB) recently considered the matter of Internet evolution, including naming [RFC6250].",
      "ja": "[IEN1] [IEN19] [IEN23] [IEN31] [IEN135] [RFC814] [RFC1498] [RFC2956]年間を通じてインターネットに命名に関するかなりの研究がなされてきました。その研究の多くは、モビリティ、マルチホーミング、およびエンドツーエンドの回避の問題を作成、特定の場所でのノードの特定のインターフェイスと、エンドツーエンドのトランスポート層セッション状態の結合は、例えば、望ましくないことが示されましたセキュリティ。さらに最近では、その重要な先行研究の意識、およびルーティングRGは、ドメイン間ルーティングのスケーラビリティに焦点を当てて再チャーターしても前に始め、著者は、インターネットアーキテクチャの特定の命名側面の強化を検討してきました。これとは別に、インターネットアーキテクチャ委員会（IAB）は最近、[RFC6250]を命名含め、インターネットの進化の問題を検討しました。"
    },
    {
      "indent": 3,
      "text": "Our ideas and progress so far are embodied in the ongoing definition of an experimental protocol that we call the Identifier-Locator Network Protocol (ILNP).",
      "ja": "私たちのアイデアや進捗状況はこれまでのところ、我々は識別子ロケータネットワークプロトコル（ILNP）を呼び出し実験プロトコルの継続的な定義で具体化されています。"
    },
    {
      "indent": 3,
      "text": "Links to relevant material are all available at: http://ilnp.cs.st-andrews.ac.uk/",
      "ja": "http://ilnp.cs.st-andrews.ac.uk/：関連資料へのリンクはすべてでご利用いただけます"
    },
    {
      "indent": 3,
      "text": "At the time of writing, the main body of peer-reviewed research from which the ideas in this and the accompanying documents draw is given in [LABH06], [ABH07a], [ABH07b], [ABH08a], [ABH08b], [ABH09a], [ABH09b], [RAB09], [ABH10], [RB10], [BA11], [BAK11], and [BA12].",
      "ja": "執筆時点では、この中のアイデアや付属文書が描き、そこから査読研究の本体には、[LABH06]、[ABH07a]、[ABH07b]、[ABH08a]、[ABH08b]、[ABH09aに与えられています]、[ABH09b]、[RAB09]、[ABH10]、[RB10]、[BA11]、[BAK11]、および[BA12]。"
    },
    {
      "indent": 3,
      "text": "In this document, we:",
      "ja": "この文書では、私たち："
    },
    {
      "indent": 6,
      "text": "a) describe the architectural concepts behind ILNP and how various ILNP capabilities operate: this document deliberately focuses on describing the key architectural changes that ILNP introduces and defers engineering discussion to separate documents.",
      "ja": "a）は、建築ILNPの背後にある概念とどのように様々なILNP機能が動作について説明します。この文書では、意図的にILNPドキュメントを分離する技術の議論を紹介し、延期の重要なアーキテクチャの変更を記述するに焦点を当てています。"
    },
    {
      "indent": 3,
      "text": "Other documents (listed below):",
      "ja": "その他の書類（下記参照）："
    },
    {
      "indent": 6,
      "text": "b) show how functions based on ILNP would be realised on today's Internet by proposing an instance of ILNP based on IPv6, which we call ILNPv6 (there is also a document describing ILNPv4, which is how ILNP could be applied to IPv4).",
      "ja": "B）ILNPに基づく機能は、（ILNPは、IPv4に適用することができる方法であるILNPv4を記述した文書は、もあります）私たちはILNPv6を呼び出すのIPv6に基づくILNPのインスタンスを提案することにより、今日のインターネット上で実現される方法を示しています。"
    },
    {
      "indent": 6,
      "text": "c) discuss salient operational and engineering issues impacting the deployment of ILNPv6 and the impact on the Internet.",
      "ja": "C）ILNPv6の展開と、インターネット上のインパクトに影響を与える顕著な運用と工学の問題を議論します。"
    },
    {
      "indent": 6,
      "text": "d) give architectural descriptions of optional advanced capabilities in advanced deployments based on the ILNP approach.",
      "ja": "D）ILNP・アプローチに基づく高度な展開では、オプションの高度な機能のアーキテクチャの説明を与えます。"
    },
    {
      "indent": 0,
      "text": "1.1. Document Roadmap",
      "section_title": true,
      "ja": "1.1。ドキュメントロードマップ"
    },
    {
      "indent": 3,
      "text": "This document describes the architecture for the Identifier-Locator Network Protocol (ILNP) including concept of operations. The authors recommend reading and understanding this document as the starting point to understanding ILNP.",
      "ja": "この文書では、操作の概念を含む識別子ロケータネットワークプロトコル（ILNP）のためのアーキテクチャについて説明します。著者はILNPを理解するための出発点として、この文書を読み、理解することをお勧めします。"
    },
    {
      "indent": 3,
      "text": "The ILNP architecture can have more than one engineering instantiation. For example, one can imagine a \"clean-slate\" engineering design based on the ILNP architecture. In separate documents, we describe two specific engineering instances of ILNP. The term \"ILNPv6\" refers precisely to an instance of ILNP that is based upon, and backwards compatible with, IPv6. The term \"ILNPv4\" refers precisely to an instance of ILNP that is based upon, and backwards compatible with, IPv4.",
      "ja": "ILNPアーキテクチャは、複数のエンジニアリングのインスタンスを持つことができます。例えば、一つはILNPアーキテクチャに基づく「クリーンスレート」エンジニアリング設計を想像することができます。別の文書では、我々はILNPの2つの特定のエンジニアリング・インスタンスを記述します。用語「ILNPv6」とに基づいて、およびIPv6、と下位互換性がありILNPのインスタンスに正確に指します。用語「ILNPv4」とに基づいて、とIPv4との下位互換性があるILNPのインスタンスに正確に指します。"
    },
    {
      "indent": 3,
      "text": "Many engineering aspects common to both ILNPv4 and ILNPv6 are described in [RFC6741]. A full engineering specification for either ILNPv6 or ILNPv4 is beyond the scope of this document.",
      "ja": "ILNPv4とILNPv6の両方に共通する多くの技術的な側面は、[RFC6741]で説明されています。 ILNPv6またはILNPv4のいずれかの完全なエンジニアリング仕様は、このドキュメントの範囲を超えています。"
    },
    {
      "indent": 3,
      "text": "Readers are referred to other related ILNP documents for details not described here:",
      "ja": "読者はここで説明されていない詳細については、関連する他のILNP文書と呼ばれています。"
    },
    {
      "indent": 3,
      "text": "a) [RFC6741] describes engineering and implementation considerations that are common to both ILNPv4 and ILNPv6.",
      "ja": "A）[RFC6741]はILNPv4とILNPv6の両方に共通する技術および実装の考慮事項について説明します。"
    },
    {
      "indent": 3,
      "text": "b) [RFC6742] defines additional DNS resource records that support ILNP.",
      "ja": "B）[RFC6742]はILNPをサポートする追加のDNSリソースレコードを定義します。"
    },
    {
      "indent": 3,
      "text": "c) [RFC6743] defines a new ICMPv6 Locator Update message used by an ILNP node to inform its correspondent nodes of any changes to its set of valid Locators.",
      "ja": "C）[RFC6743]は、有効なロケータのセットに対する変更のその相手ノードに通知するILNPノードによって使用される新しいICMPv6のロケータUpdateメッセージを定義します。"
    },
    {
      "indent": 3,
      "text": "d) [RFC6744] defines a new IPv6 Nonce Destination Option used by ILNPv6 nodes (1) to indicate to ILNP correspondent nodes (by inclusion within the initial packets of an ILNP session) that the node is operating in the ILNP mode and (2) to prevent off-path attacks against ILNP ICMP messages. This Nonce is used, for example, with all ILNP ICMPv6 Locator Update messages that are exchanged among ILNP correspondent nodes.",
      "ja": "D）[RFC6744]はILNPセッションの最初のパケットの中に含めることによって（ILNPのコレスポンデントノードに示すためにILNPv6ノード（1）で使用される新規のIPv6ノンス宛先オプション）を定義するノードがILNPモードで動作していること（2） ILNP ICMPメッセージに対してオフパス攻撃を防ぐために。このナンスはILNP特派ノード間で交換されているすべてのILNPのICMPv6ロケータ更新メッセージで、例えば、使用されています。"
    },
    {
      "indent": 3,
      "text": "e) [RFC6745] defines a new ICMPv4 Locator Update message used by an ILNP node to inform its correspondent nodes of any changes to its set of valid Locators.",
      "ja": "E）[RFC6745]は、有効なロケータのセットに対する変更のその相手ノードに通知するILNPノードによって使用される新しいICMPv4のロケータUpdateメッセージを定義します。"
    },
    {
      "indent": 3,
      "text": "f) [RFC6746] defines a new IPv4 Nonce Option used by ILNPv4 nodes to carry a security nonce to prevent off-path attacks against ILNP ICMP messages and also defines a new IPv4 Identifier Option used by ILNPv4 nodes.",
      "ja": "F）[RFC6746]はILNP ICMPメッセージに対してオフパス攻撃を防ぐために、セキュリティnonceを運ぶためにILNPv4ノードによって使用される新しいIPv4のノンスオプションを定義し、またILNPv4ノードによって使用される新しいIPv4の識別子オプションを定義します。"
    },
    {
      "indent": 3,
      "text": "g) [RFC6747] describes extensions to the Address Resolution Protocol (ARP) for use with ILNPv4.",
      "ja": "G）[RFC6747]はILNPv4で使用するためのアドレス解決プロトコル（ARP）の拡張機能について説明します。"
    },
    {
      "indent": 3,
      "text": "h) [RFC6748] describes optional engineering and deployment functions for ILNP. These are not required for the operation or use of ILNP and are provided as additional options.",
      "ja": "H）[RFC6748]はILNPための任意のエンジニアリングと展開関数を記述しています。これらはILNPの操作または使用するために必要されておらず、追加オプションとして提供されています。"
    },
    {
      "indent": 0,
      "text": "1.2. History",
      "section_title": true,
      "ja": "1.2。歴史"
    },
    {
      "indent": 3,
      "text": "In 1977, Internet researchers at University College London wrote the first Internet Experiment Note (IEN), which discussed issues with the interconnection of networks [IEN1]. This identified the inclusion of network-layer addresses in the transport-layer session state (e.g., TCP checksum) as a significant problem for mobile and multihomed nodes and networks. It also proposed separation of identity from location as a better approach to take when designing the TCP/IP protocol suite. Unfortunately, that separation did not occur, so the deployed IPv4 and IPv6 Internet entangles upper-layer protocols (e.g., TCP, UDP) with network-layer routing and topology information (e.g., IP Addresses) [IEN1] [RFC768] [RFC793].",
      "ja": "1977年、ロンドン大学でのインターネットの研究者は、[IEN1]ネットワークの相互接続の問題を議論し最初のインターネット実験ノート（IEN）を、書きました。これは、モバイルおよびマルチホームノードとネットワークの重大な問題としてトランスポート層セッション状態（例えば、TCPチェックサム）でネットワークレイヤアドレスを含めることを同定しました。また、TCP / IPプロトコルスイートを設計する際に取るためのより良いアプローチとしての場所からアイデンティティの分離を提案しました。残念ながら、その分離が発生しなかったので、展開IPv4とIPv6インターネットが絡み合い上位層プロトコル（例えば、TCP、UDP）ネットワーク層のルーティングとトポロジ情報と（例えば、IPアドレス）[IEN1] [RFC768] [RFC793] 。"
    },
    {
      "indent": 3,
      "text": "The architectural concept behind ILNP derives from a June 1994 note by Bob Smart to the IETF SIPP WG mailing list [SIPP94]. In January 1995, Dave Clark sent a similar note to the IETF IPng WG mailing list, suggesting that the IPv6 address be split into separate Identifier and Locator fields [IPng95].",
      "ja": "ILNPの背後にある建築のコンセプトは[SIPP94] IETF SIPP WGメーリングリストにボブスマートによる1994年6月のノートに由来します。 1995年1月には、デイブ・クラークは、IPv6アドレスが別の識別子とロケータフィールド[IPng95]に分割することを示唆し、IETFのIPng WGメーリングリストに似たノートを送りました。"
    },
    {
      "indent": 3,
      "text": "Afterwards, Mike O'Dell pursued this concept in Internet-Drafts describing \"8+8\" [8+8] and \"GSE\" (Global, Site, and End-system) [GSE]. More recently, the IRTF Namespace Research Group (NSRG) studied this matter around the turn of the century. Unusually for an IRTF RG, the NSRG operated on the principle that unanimity was required for the NSRG to make a recommendation. Atkinson was a member of the IRTF NSRG. At least one other protocol, the Host Identity Protocol (HIP), also derives in part from the IRTF NSRG studies (and related antecedent work). This current proposal differs from O'Dell's work in various ways, notably in that it does not require deployment or use of Locator rewriting.",
      "ja": "その後、マイク・オデルは「8 + 8」[8 + 8]および「GSE」（グローバル、サイト、およびエンドシステム）[GSE]を記述したインターネットドラフトで、このコンセプトを追求しました。さらに最近では、IRTFネームスペースの研究グループ（NSRG）は、世紀の変わり目の周りにこの問題を調査しました。珍しくIRTFのRGのため、NSRGは全会一致で勧告を行うためにNSRGために必要であったという原則に基づいて運営しました。アトキンソンはIRTF NSRGのメンバーでした。少なくとも一つの他のプロトコル、ホスト識別プロトコル（HIP）は、また、IRTF NSRG研究（および関連する先行作業）から部分的に導出します。この現在の提案は、それが展開またはロケータ書き換えの使用を必要としない、特にその中で、さまざまな方法でオデルの仕事とは異なります。"
    },
    {
      "indent": 3,
      "text": "The key idea proposed for ILNP is to directly and specifically change the overloaded semantics of the IP Address. The Internet community has indicated explicitly, several times, that this use of overloaded semantics is a significant problem with the use of the Internet protocol today [RFC1498] [RFC2101] [RFC2956] [RFC4984].",
      "ja": "ILNPのために提案されているキーアイデアは、直接、具体的にIPアドレスのオーバーロードされた意味を変更することです。インターネットコミュニティは、オーバーロードされた意味論のこの使用は、インターネットプロトコル今日[RFC1498] [RFC2101] [RFC2956] [RFC4984]を使用すると重大な問題であることを、明示的に数回を示しました。"
    },
    {
      "indent": 3,
      "text": "While the research community has made a number of proposals that could provide solutions, so far there has been little progress on changing the status quo.",
      "ja": "研究コミュニティがソリューションを提供できる多数の提案を行っているが、これまでに現状を変えるにはほとんど進展がありました。"
    },
    {
      "indent": 0,
      "text": "1.3. Terminology",
      "section_title": true,
      "ja": "1.3。用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. Architectural Overview",
      "section_title": true,
      "ja": "2.アーキテクチャの概要"
    },
    {
      "indent": 3,
      "text": "ILNP takes a different approach to naming of communication objects within the network stack. Two new data types are introduced which subsume the role of the IP Address at the network and transport layers in the current IP architecture.",
      "ja": "ILNPは、ネットワークスタック内の通信オブジェクトの命名に異なるアプローチを採用しています。二つの新しいデータ型は、現在のIPアーキテクチャのネットワーク層とトランスポート層でのIPアドレスの役割を包摂が導入されています。"
    },
    {
      "indent": 0,
      "text": "2.1. Identifiers and Locators",
      "section_title": true,
      "ja": "2.1。識別子とロケータ"
    },
    {
      "indent": 3,
      "text": "ILNP explicitly replaces the use of IP Addresses with two distinct name spaces, each having distinct and different semantics:",
      "ja": "ILNPは、明示的に、IPの使用は二つの異なる名前空間とアドレスの置き換えは、それぞれ個別のと異なる意味を持ちます："
    },
    {
      "indent": 6,
      "text": "a) Identifier: a non-topological name for uniquely identifying a node.",
      "ja": "A）識別子：一意のノードを識別するための非トポロジー名。"
    },
    {
      "indent": 6,
      "text": "b) Locator: a topologically bound name for an IP subnetwork.",
      "ja": "b）のロケータ：IPサブネットワークのための位相幾何学的に束縛名前。"
    },
    {
      "indent": 3,
      "text": "The use of these two new namespaces in comparison to IP is given in Table 1. The table shows where existing names are used for state information in end-systems or protocols.",
      "ja": "IPと比較して、これらの二つの新しい名前空間を使用することは、テーブルは、既存の名前がエンドシステムまたはプロトコルの状態情報のために使用されている場合を示し、表1に示されています。"
    },
    {
      "indent": 6,
      "text": "     Layer     |          IP          |     ILNP\n---------------+----------------------+---------------\n  Application  |  FQDN or IP Address  |  FQDN\n  Transport    |  IP Address          |  Identifier\n  Network      |  IP Address          |  Locator\n  Physical i/f |  IP Address          |  MAC address\n---------------+----------------------+---------------",
      "raw": true
    },
    {
      "indent": 6,
      "text": "FQDN = Fully Qualified Domain Name i/f = interface MAC = Media Access Control",
      "ja": "FQDNは完全修飾ドメイン名を= I / F =インターフェイスMAC =メディアアクセス制御"
    },
    {
      "indent": 6,
      "text": "Table 1: Use of Names for State Information in Various Communication Layers for IP and ILNP",
      "ja": "表1：IPとILNPための様々な通信レイヤにおける状態情報のための名の使用"
    },
    {
      "indent": 3,
      "text": "As shown in Table 1, if an application uses a Fully Qualified Domain Name at the application-layer, rather than an IP Address or other lower-layer identifier, then the application perceives no architectural difference between IP and ILNP. We call such applications \"well-behaved\" with respect to naming as use of the FQDN at the application-layer is recommended in [RFC1958]. Some other applications also avoid use of IP Address information within the application-layer protocol; we also consider these applications to be \"well-behaved\". Any well-behaved application should be able to operate on ILNP without any changes. Note that application-level use of IP Addresses includes application-level configuration information, e.g., Apache web server (httpd) configuration files make extensive use of IP Addresses as a form of identity.",
      "ja": "アプリケーションではなくIPアドレスまたは他の下層の識別子よりも、アプリケーション層で完全修飾ドメイン名を使用する場合、表1に示すように、アプリケーションはIPとILNP間にアーキテクチャの違いを知覚しません。私たちは、[RFC1958]で推奨されるようなアプリケーションは、アプリケーション層でのFQDNの使用として命名に関して、「行儀」と呼びます。他のいくつかのアプリケーションでは、アプリケーション層のプロトコル内のIPアドレス情報の使用を避けます。我々はまた、これらのアプリケーションは、「行儀」であると考えています。どれ行儀の良いアプリケーションは変更なしILNPを操作することができるはずです。注意IPアドレスのアプリケーションレベルの使用は、アプリケーションレベルの構成情報が含まれ、例えば、Apache Webサーバ（httpd）が設定ファイルは同一の形態としてのIPアドレスの広範な使用を行います。"
    },
    {
      "indent": 3,
      "text": "ILNP does not require applications to be rewritten to use a new Networking Application Programming Interface (API). So existing well-behaved IP-based applications should be able to work over ILNP as is.",
      "ja": "ILNPは、アプリケーションが新しいネットワーキングアプリケーション・プログラミング・インターフェース（API）を使用するようにリライトする必要はありません。そこで、既存のよく振る舞ったIPベースのアプリケーションがあるとしてILNPを超える作業することができるはずです。"
    },
    {
      "indent": 3,
      "text": "In ILNP, transport-layer protocols use only an end-to-end, non-topological node Identifier in any transport-layer session state. It is important to note that the node Identifier names the node, not a specific interface of the node. In this way, it has different semantics and properties than either the IPv4 address, the IPv6 address, or the IPv6 interface identifier [RFC791] [RFC4291].",
      "ja": "ILNPでは、トランスポート層プロトコルは、任意のトランスポート層セッション状態のみエンドツーエンドの、非トポロジーノード識別子を使用します。ノード識別子名ノードではなく、ノードの特定のインターフェイスことに注意することが重要です。このようにして、IPv4アドレス、IPv6アドレス、またはIPv6インタフェース識別子[RFC791] [RFC4291]のいずれかとは異なる意味と性質を有します。"
    },
    {
      "indent": 3,
      "text": "The use of the ILNP Identifier value within application-layer protocols is not recommended. Instead, the use of either a FQDN or some different topology-independent namespace is recommended.",
      "ja": "アプリケーション層プロトコル内ILNP識別子値の使用は推奨されません。代わりに、FQDNまたはいくつかの異なるトポロジに依存しない名前空間のいずれかの使用が推奨されます。"
    },
    {
      "indent": 3,
      "text": "At the network-layer, Locator values, which have topological significance, are used for routing and forwarding of ILNP packets, but Locators are not used in upper-layer protocols.",
      "ja": "ネットワーク層において、トポロジカルな意義を有するロケータ値は、ルーティングおよびILNPパケットの転送に使用されるが、ロケータは、上位層プロトコルで使用されていません。"
    },
    {
      "indent": 3,
      "text": "As well as the new namespaces, another significant difference in ILNP, as shown in Table 1, is that there is no binding of a routable name to an interface, or Sub-Network Point of Attachment (SNPA), as there is in IP. The existence of such a binding in IP effectively binds transport protocol flows to a specific, single interface on a node. Also, applications that include IP Addresses in their application-layer session state effectively bind to a specific, single interface on a node [RFC2460] [RFC6724].",
      "ja": "同様に、表1に示すように、新しい名前空間、ILNPにおけるもう一つの重要な違いとして、IPであるように何らのインターフェイスにルーティング可能な名前の結合、または添付のサブネットワークポイント（SNPA）は、存在しないことです。このようなIPにおける結合の存在は、効果的に、トランスポートプロトコルは、ノード上の特定の、単一のインターフェイスに流れる結合します。また、それらのアプリケーション層のセッション状態のIPアドレスを含むアプリケーションを効果的にノード上の特定の、単一のインタフェース[RFC2460]、[RFC6724]に結合します。"
    },
    {
      "indent": 3,
      "text": "In ILNP, dynamic bindings exist between Identifier values and associated Locator values, as well as between {Identifier, Locator} pairs and (physical or logical) interfaces on the node.",
      "ja": "ILNPでは、動的バインディングは、識別子値および関連するロケータ値の間、並びに{識別子、ロケータ}ペアとノード上の（物理的または論理的な）インターフェイスの間に存在します。"
    },
    {
      "indent": 3,
      "text": "This change enhances the Internet Architecture by adding crisp and clear semantics for the Identifier and for the Locator, removing the overloaded semantics of the IP Address [RFC1992] [RFC4984], by updating end-system protocols, but without requiring any router or backbone changes. In ILNP, the closest approximation to an IP Address is an I-L Vector (I-LV), which is a given binding between an Identifier and Locator pair, written as [I, L]. I-LVs are discussed in more detail below.",
      "ja": "この変更は、しかし、任意のルータまたはバックボーンの変更を必要とせずに、エンドシステムプロトコルを更新することにより、識別子のためとロケータのための鮮明なセマンティクスを追加するIPアドレス[RFC1992] [RFC4984]のオーバーロードされたセマンティクスを除去することにより、インターネットアーキテクチャを強化します。 ILNPでは、IPアドレスに最も近い近似は、[I、L]として書き込まれ、識別子とロケータペア間の結合を与えられるI-Lベクター（I-LV）です。 I-LVSは、以下でより詳細に議論されています。"
    },
    {
      "indent": 3,
      "text": "Where, today, IP packets have:",
      "ja": "どこに、今日、IPパケットがあります。"
    },
    {
      "indent": 3,
      "text": "- Source IP Address, Destination IP Address",
      "ja": " - 送信元IPアドレス、宛先IPアドレス"
    },
    {
      "indent": 3,
      "text": "instead, ILNP packets have:",
      "ja": "代わりに、ILNPパケットがあります。"
    },
    {
      "indent": 3,
      "text": "- source I-LV, destination I-LV",
      "ja": " -  I-LV、およびdestination-LV sourtse"
    },
    {
      "indent": 3,
      "text": "However, it must be emphasised that the I-LV and the IP Address are *not* equivalent.",
      "ja": "しかし、I-LVおよびIPアドレスが*ない*同等であることを強調しなければなりません。"
    },
    {
      "indent": 3,
      "text": "With these naming enhancements, we will improve the Internet Architecture by adding explicit harmonised support for many functions, such as multihoming, mobility, and IPsec.",
      "ja": "これらのネーミングの機能強化により、我々は、マルチホーミング、モビリティ、およびIPsecなど、多くの機能を明示的に調和のサポートを追加することにより、インターネットアーキテクチャを改善します。"
    },
    {
      "indent": 0,
      "text": "2.2. Deprecating IP Addresses",
      "section_title": true,
      "ja": "2.2。 IPアドレスを非推奨"
    },
    {
      "indent": 3,
      "text": "ILNP places an explicit Locator and Identifier in the IP packet header, replacing the usual IP Address. Locators are tied to the topology of the network. They may change frequently, as the node or site changes its network connectivity. The node Identifier is normally much more static and remains constant throughout the life of a given transport-layer session, and frequently much longer. However, there are various options for Identifier values, as discussed in [RFC6741]. The way that I-LVs are encoded into packet headers is different for IPv4 and IPv6, as explained in [RFC6741].",
      "ja": "ILNPは、通常のIPアドレスを交換する、IPパケットヘッダ内の明示的なロケータと識別子を配置します。ロケータは、ネットワークのトポロジに関連付けられています。ノードまたはサイトがそのネットワーク接続を変更するよう彼らは、頻繁に変更されることがあります。ノード識別子は、通常、はるかに静的であり、与えられたトランスポート層セッションの寿命を通して一定のままであり、しばしばはるかに長いです。しかしながら、[RFC6741]で議論するように識別子の値のための様々なオプションがあります。 [RFC6741]で説明したようにI-のLVは、パケットヘッダに符号化される方法は、IPv4とIPv6で異なります。"
    },
    {
      "indent": 3,
      "text": "Identifiers and Locators for hosts are advertised explicitly in DNS, through the use of new Resource Records (RRs). This is a logical and reasonable use of DNS, completely analogous to the capability that DNS provides today. At present, among other current uses, the DNS is used to map from an FQDN to a set of addresses. As ILNP replaces IP Addresses with Identifiers and Locators, it is then clearly rational to use the DNS to map an FQDN to a set of Identifiers and a set of Locators for a node.",
      "ja": "ホストの識別子とロケータは、新しいリソースレコード（RR）を使用して、DNSで明示的に宣伝されています。これは、DNSが今日提供機能に完全に類似、DNSの論理的かつ合理的な使用です。現在のところ、他の現在の用途のうち、DNSは、アドレスのセットにFQDNからマッピングするために使用されます。 ILNPはIPが識別子とロケータとアドレス置き換えとして、識別子のセットと、ノードのためのロケータのセットにFQDNをマッピングするためにDNSを使用して、その後明らかに合理的です。"
    },
    {
      "indent": 3,
      "text": "The presence of ILNP Locators and Identifiers in the DNS for a DNS owner name is an indicator to correspondents that the correspondents can try to establish an ILNP-based transport-layer session with that DNS owner name.",
      "ja": "DNSの所有者名のDNSでILNPロケータと識別子の存在は、特派は、そのDNSの所有者名とILNPベースのトランスポート層セッションを確立しようとすることができるということ特派への指標です。"
    },
    {
      "indent": 3,
      "text": "Specifically in response to [RFC4984], ILNP improves routing scalability by helping multihomed sites operate effectively with Provider Aggregated (PA) address prefixes. Many multihomed sites today request provider-independent (PI) address prefixes so they can provide session survivability despite the failure of one or more access links or Internet Service Providers (ISPs). ILNP provides this transport-layer session survivability by having a provider-independent Node Identifier (NID) value that is free of any topological semantics. This NID value can be bound dynamically to a Provider Aggregated Locator (L) value, the latter being a topological name, i.e., a PA network prefix. By allowing correspondents to change arbitrarily among multiple PA Locator values, survivability is enabled as changes to the L values need not disrupt transport-layer sessions. In turn, this allows an ILNP multihomed site to have both the full transport-layer and full network-layer session resilience that is today offered by PI addressing while using the equivalent of PA addressing. In turn, this eliminates the current need to use globally visible PI routing prefixes for each multihomed site.",
      "ja": "具体的には[RFC4984]に応答して、ILNPは、マルチホームサイトがプロバイダ集約（PA）アドレスプレフィックスで効果的に動作支援することで、ルーティングのスケーラビリティを向上させることができます。多くのマルチホームのサイト今日の要求プロバイダに依存しない（PI）アドレスプレフィックス彼らは、1つまたは複数のアクセスリンク、またはインターネットサービスプロバイダ（ISP）の失敗にもかかわらず、セッションの存続を提供できるようにします。 ILNPは、任意のトポロジーのセマンティクスを含まないプロバイダに依存しないノード識別子（NID）値を有することによって、このトランスポート層セッションの存続を提供します。このNID値がプロバイダ集合ロケータ（L）の値に動的に結合することができ、後者はトポロジー名、即ち、PAネットワークプレフィックス。特派は、複数のPAロケータ値のうち任意に変更できるようにすることにより、生存率は、トランスポート層セッションを中断させる必要はありませんL値の変化として有効になっています。ターンでは、これはILNPマルチホームサイトは、フルトランスポート層およびPAアドレッシングと同等のものを使用しながら取り組むPIによって提供される今日で完全なネットワーク層セッション回復力の両方を持つことができます。ターンでは、これは、各マルチホームサイトに対してグローバルに見えるPIルーティングプレフィックスを使用するために、現在の必要がなくなります。"
    },
    {
      "indent": 0,
      "text": "2.3. Session Terminology",
      "section_title": true,
      "ja": "2.3。セッション用語"
    },
    {
      "indent": 3,
      "text": "To improve clarity and readability of the several ILNP specification documents, this section defines the terms \"network-layer session\" and \"transport-layer session\" both for IP-based networks and ILNP-based networks.",
      "ja": "いくつかのILNP仕様書の明快さと読みやすさを向上させるために、このセクションでは、用語「ネットワーク層セッション」との両方のIPベースのネットワークとILNPベースのネットワークのための「トランスポート層セッション」を定義します。"
    },
    {
      "indent": 3,
      "text": "Today, network-layer IP sessions have 2 components:",
      "ja": "今日では、ネットワーク層のIPセッションは2つのコンポーネントがあります。"
    },
    {
      "indent": 3,
      "text": "- Source IP Address (A_S) - Destination IP Address (A_D)",
      "ja": " - 送信元IPアドレス（A_S） - 宛先IPアドレス（A_D）"
    },
    {
      "indent": 3,
      "text": "For example, a tuple for an IP layer session would be:",
      "ja": "例えば、IPレイヤのセッションのタプルは次のようになります。"
    },
    {
      "indent": 6,
      "text": "<IP: A_S, A_D>",
      "ja": "<IP：A_S、A_D>"
    },
    {
      "indent": 3,
      "text": "Instead, network-layer ILNP sessions have 4 components:",
      "ja": "代わりに、ネットワーク層ILNPセッションは4つの成分を持っています："
    },
    {
      "indent": 3,
      "text": "- Source Locator(s) (L_S) - Source Identifier(s) (I_S) - Destination Locator(s) (L_D) - Destination Identifier(s) (L_S)",
      "ja": " - ソース・ロケータ（S）（L_S） - ソース識別子（S）（I_S） - 宛先ロケータ（S）（L_D） - 宛先識別子（S）（L_S）"
    },
    {
      "indent": 3,
      "text": "and a tuple for an ILNP session would be:",
      "ja": "そして、ILNPセッションのためのタプルは次のようになります。"
    },
    {
      "indent": 6,
      "text": "<ILNP: I_S, L_S, I_D, L_D>",
      "ja": "<ILNP：I_​​S、L_S、I_D、L_D>"
    },
    {
      "indent": 3,
      "text": "The phrase \"ILNP session\" refers to an ILNP-based network-layer session, having the 4 components in the definition above.",
      "ja": "語句「ILNPセッション」は、上記定義の4つの成分を有する、ILNPベースのネットワーク層セッションを指します。"
    },
    {
      "indent": 3,
      "text": "For engineering efficiency, multiple transport-layer sessions between a pair of ILNP correspondents normally share a single ILNP session (I-LV pairs and associated Nonce values). Also, for engineering convenience (and to cope with situation where different nodes, at different locations, might use the same I values), in the specific implementation of ILNPv6 and ILNPv4, we define the use of nonce values:",
      "ja": "エンジニアリング効率のため、ILNP特派の対の間の複数のトランスポート層セッションは、通常、単一ILNPセッション（I-LVのペアと関連ノンス値）を共有します。また、エンジニアリングの便宜のために（どこで異なるノードの状況に対処するために、異なる場所で、同じIの値を使用する場合があります）、ILNPv6とILNPv4の特定の実装では、我々は一回だけの値の使用を定義します。"
    },
    {
      "indent": 3,
      "text": "- Source-to-destination Nonce value (N_S) - Destination-to-source Nonce value (N_D)",
      "ja": " - ソース - 宛先ノンス値（N_S） - デスティネーション・ソースノンス値（N_D）"
    },
    {
      "indent": 3,
      "text": "These are explained in more detail in [RFC6741], with [RFC6744] for ILNPv6 and [RFC6746] for ILNPv4.",
      "ja": "これらはILNPv4ためILNPv6ための[RFC6744]及び[RFC6746]と[RFC6741]でより詳細に説明します。"
    },
    {
      "indent": 3,
      "text": "Today, transport-layer sessions using IP include these 5 components:",
      "ja": "今日では、IPを使用してトランスポート層セッションは、次の5コンポーネントが含まれています。"
    },
    {
      "indent": 4,
      "text": "- Source IP Address (A_S) - Destination IP Address (A_D) - Transport-layer protocol (e.g., UDP, TCP, SCTP) - Source transport-layer port number (P_S) - Destination transport-layer port number (P_D)",
      "ja": " - 送信元IPアドレス（A_S） - 宛先IPアドレス（A_D） - トランスポート層プロトコル（例えば、UDP、TCP、SCTP） - ソーストランスポート層のポート番号（P_S） - デスティネーショントランスポート層のポート番号（P_D）"
    },
    {
      "indent": 3,
      "text": "For example, a TCP tuple would be:",
      "ja": "たとえば、TCPタプルは次のようになります。"
    },
    {
      "indent": 6,
      "text": "<TCP: P_S, P_D, A_S, A_D>",
      "ja": "<TCP：P_S、P_D、A_S、A_D>"
    },
    {
      "indent": 3,
      "text": "Instead, transport-layer sessions using ILNP include these 5 components:",
      "ja": "代わりに、ILNPを使用してトランスポート層セッションは、次の5コンポーネントが含まれています。"
    },
    {
      "indent": 3,
      "text": "- Source Identifier (I_S) - Destination Identifier (I_D) - Transport-layer protocol (e.g., UDP, TCP, SCTP) - Source transport-layer port number (P_S) - Destination transport-layer port number (P_D) and an example tuple:",
      "ja": " - 送信元識別子（I_S） - 宛先識別子（I_D） - トランスポート層プロトコル（例えば、UDP、TCP、SCTP） - ソーストランスポート層ポート番号（P_S） - 宛先トランスポート層ポート番号（P_D）および実施例タプル："
    },
    {
      "indent": 6,
      "text": "<TCP: P_S, P_D, I_S, I_D>",
      "ja": "<TCP：P_S、P_D、I_S、I_D>"
    },
    {
      "indent": 0,
      "text": "2.4. Other Goals",
      "section_title": true,
      "ja": "2.4。他の目標"
    },
    {
      "indent": 3,
      "text": "While we seek to make significant enhancements to the current Internet Architecture, we also wish to ensure that instantiations of ILNP are:",
      "ja": "我々は現在のインターネットアーキテクチャに大幅な機能強化を行うことが求めている間、我々はまた、ILNPのインスタンスであることを保証したいです："
    },
    {
      "indent": 6,
      "text": "a) Backwards compatible: implementations of ILNP should be able to work with existing IPv6 or IPv4 deployments, without requiring application changes.",
      "ja": "a）は、下位互換性：ILNPの実装は、アプリケーションの変更を必要とせず、既存のIPv6又はIPv4の展開で動作することができなければなりません。"
    },
    {
      "indent": 6,
      "text": "b) Incrementally deployable: to deploy an implementation of ILNP, changes to the network nodes should only be for those nodes that choose to use ILNP. The use of ILNP by some nodes does not require other nodes (that do not use ILNP) to be upgraded.",
      "ja": "B）増分展開：ILNPの実装を展開するために、ネットワークノードへの変更のみILNPを使用することを選択し、それらのノードのためであるべきです。いくつかのノードによってILNPの使用をアップグレードする（ILNPを使用していない）他のノードを必要としません。"
    },
    {
      "indent": 0,
      "text": "3. Architectural Changes Introduced by ILNP",
      "section_title": true,
      "ja": "ILNPによって導入3.アーキテクチャの変更"
    },
    {
      "indent": 3,
      "text": "In this section, we describe the key changes that are made to the current Internet Architecture. These key changes impact end-systems, rather than routers.",
      "ja": "このセクションでは、現在のインターネットアーキテクチャに行われ、キーの変更について説明します。これらのキーの変更ではなく、ルータよりも、エンドシステムに影響を与えます。"
    },
    {
      "indent": 0,
      "text": "3.1. Identifiers",
      "section_title": true,
      "ja": "3.1。識別子"
    },
    {
      "indent": 3,
      "text": "Identifiers, also called Node Identifiers (NIDs), are non-topological values that identify an ILNP node. A node might be a physical node or a virtual node. For example, a single physical device might contain multiple independent virtual nodes. Alternately, a single virtual device might be composed from multiple physical devices. In the case of a Multi-Level Secure (MLS) system [DIA] [DoD85] [DoD87] [RFC5570], each valid Sensitivity Label of that system might be a separate virtual node.",
      "ja": "識別子は、また、ノード識別子（NIDS）と呼ばれるILNPノードを識別する非トポロジー値です。ノードは、物理ノードまたは仮想ノードであるかもしれません。例えば、単一の物理デバイスは、複数の独立した仮想ノードを含むかもしれません。代わりに、単一の仮想デバイスは、複数の物理デバイスから構成されることがあります。マルチレベルセキュリティ（MLS）システム[DIA] [DoD85] [DoD87] [RFC5570]の場合には、そのシステムの各有効機密ラベルが別の仮想ノードであるかもしれません。"
    },
    {
      "indent": 3,
      "text": "A node MAY have multiple Identifier values associated with it, which MAY be used concurrently.",
      "ja": "ノードは、同時に使用することができる、それに関連付けられた複数の識別子の値を有することができます。"
    },
    {
      "indent": 3,
      "text": "In normal operation, when a node is responding to a received ILNP packet that creates a new network-layer session, the correct NID value to use for that network-layer session with that correspondent node will be learned from the received ILNP packet.",
      "ja": "ノードが新しいネットワーク層セッションを作成し、受信しILNPパケットに応答して通常動作では、その通信相手ノードとそのネットワーク層セッションのために使用する正しいNID値は、受信ILNPパケットから学習されるであろう。"
    },
    {
      "indent": 3,
      "text": "In normal operation, when a node is initiating communication with a correspondent node, the correct I value to use for that session with that correspondent node will be learned either through the application-layer naming, through DNS name resolution, or through some alternative name resolution system. Another option is an application may be able to select different I values directly -- as Identifiers are visible above the network layer via the transport protocol.",
      "ja": "通常の動作では、ノードは、コレスポンデントノードとの通信を開始している場合、正しいI値は、DNS名前解決を介していずれかのアプリケーション層の命名によって学習されることをコレスポンデントノードとそのセッションに使用する、またはいくつかの別の名前解決を介してシステム。識別子は、トランスポートプロトコルを介してネットワーク層の上表示されているように - 別のオプションは、アプリケーションが直接異なるI値を選択することができる場合があります。"
    },
    {
      "indent": 0,
      "text": "3.1.1. Node Identifiers Are Immutable during a Session",
      "section_title": true,
      "ja": "3.1.1。ノード識別子は、セッション中に不変です"
    },
    {
      "indent": 3,
      "text": "Once a Node Identifier (NID) value has been used to establish a transport-layer session, that Node Identifier value forms part of the end-to-end (invariant) transport-layer session state and so MUST remain fixed for the duration of that session. This means, for example, that throughout the duration of a given TCP session, the Source Node Identifier and Destination Node Identifier values will not change.",
      "ja": "ノード識別子（NID）値は、ノード識別子の値を形成し、エンドツーエンド（不変の）トランスポート層セッション状態の一部などは、その期間中固定のままでなければならないことは、トランスポート層セッションを確立するために使用された後セッション。これは、特定のTCPセッションの期間を通じて、ソースノード識別子と宛先ノード識別子の値が変更されないこと、例えば、意味しています。"
    },
    {
      "indent": 3,
      "text": "In normal operation, a node will not change its set of valid Identifier values frequently. However, a node MAY change its set of valid Identifier values over time, for example, in an effort to provide identity obfuscation, while remaining subject to the architectural rule of the preceding paragraph. When a node has more than one Node Identifier value concurrently, the node might have multiple concurrent ILNP sessions with some correspondent node, in which case Node Identifier values MAY differ between the different concurrent ILNP sessions.",
      "ja": "通常の動作では、ノードは、しばしば、有効な識別子の値のセットを変更しないであろう。前項の建築規則に従うまましかし、ノードは、同一の難読化を提供するために、例えば、経時的に有効な識別子の値のセットを変更することができます。ノードが同時に複数のノード識別子の値を有する場合、ノードは、ノード識別子の値が異なる同時ILNPセッション間で異なる場合があり、その場合、いくつかの通信相手ノードとの複数の同時ILNPセッションを持っているかもしれません。"
    },
    {
      "indent": 0,
      "text": "3.1.2. Syntax",
      "section_title": true,
      "ja": "3.1.2。構文"
    },
    {
      "indent": 3,
      "text": "ILNP Identifiers have the same syntax as IPv6 interface identifiers [RFC4291], based on the EUI-64 format [IEEE-EUI], which helps with backwards compatibility. There is no semantic equivalent to an ILNP Identifier in IPv4 or IPv6 today.",
      "ja": "ILNP識別子は後方互換性に役立ちEUI-64フォーマット[IEEE-EUI]、に基づいて、IPv6インタフェース識別子[RFC4291]と同じシンタックスを有します。 IPv4またはIPv6今日でILNP識別子への意味的な等価ではありません。"
    },
    {
      "indent": 3,
      "text": "The Modified EUI-64 syntax used by both ILNP Identifiers and IPv6 interface identifiers contains a bit indicating whether the value has global scope or local scope [IEEE-EUI] [RFC4291]. ILNP Identifiers have either global scope or local scope. If they have global scope, they SHOULD be globally unique.",
      "ja": "ILNP識別子とIPv6の両方のインタフェース識別子によって使用される変性EUI-64構文値がグローバルスコープまたはローカルスコープ[IEEE-EUI] [RFC4291]を有するかどうかを示すビットを含みます。 ILNP識別子は、グローバルスコープまたはローカルスコープのいずれかを持っています。彼らはグローバルスコープを持っている場合、彼らは世界的に一意である必要があります。"
    },
    {
      "indent": 3,
      "text": "Regardless of whether an Identifier is global scope or local scope, an Identifier MUST be unique within the scope of a given Locator value to which it is bound for a given ILNP session or packet flow. As an example, with ILNPv6, the ordinary IPv6 Neighbour Discovery (ND) processes ensure that this is true, just as ND ensures that no two IPv6 nodes on the same IPv6 subnetwork have the same IPv6 address at the same time.",
      "ja": "関係なく、識別子は、グローバルスコープまたはローカルスコープであるかどうかの、識別子は、それが与えられたILNPセッションまたはパケットフローのためにバインドされている所定のロケータ値の範囲内で一意でなければなりません。一例として、ILNPv6、通常のIPv6近隣探索（ND）での処理は、NDが同一のIPv6サブネットワークには2つのIPv6ノードが同時に同じIPv6アドレスを持っていないことを保証するだけのように、これが真であることを確認します。"
    },
    {
      "indent": 3,
      "text": "Both the IEEE EUI-64 specification and the Modified EUI-64 syntax also has a 'Group' bit [IEEE-EUI] [RFC4291]. For both ILNP node Identifiers and also IPv6 interface identifiers, this Group bit is set to 0.",
      "ja": "IEEE EUI-64仕様および変形EUI-64構文の両方はまた、 'グループ' ビットを有する[IEEE-EUI] [RFC4291]。 ILNPノード識別子ともIPv6インタフェース識別子の両方のために、このグループのビットが0に設定されています。"
    },
    {
      "indent": 0,
      "text": "3.1.3. Semantics",
      "section_title": true,
      "ja": "3.1.3。意味論"
    },
    {
      "indent": 3,
      "text": "Unicast ILNP Identifier values name the node, rather than naming a specific interface on that node. So ILNP Identifiers have different semantics than IPv6 interface identifiers.",
      "ja": "ユニキャストILNP識別子の値ではなく、そのノード上の特定のインターフェイスに名前を付けるよりも、ノードに名前を付けます。だから、ILNP識別子は、IPv6インタフェース識別子とは異なる意味を持っています。"
    },
    {
      "indent": 0,
      "text": "3.2. Locators",
      "section_title": true,
      "ja": "3.2。ロケータ"
    },
    {
      "indent": 3,
      "text": "Locators are topologically significant names, analogous to (sub)network routing prefixes. The Locator names the IP subnetwork that a node is connected to. ILNP neither prohibits nor mandates in-transit modification of Locator values.",
      "ja": "ロケータは、（サブ）ネットワークルーティングプレフィックスと類似のトポロジー的に有意な名前です。ロケータ名ノードが接続されているIPサブネットワーク。 ILNPはロケータ値の輸送中の変更を禁止していないにも義務もありません。"
    },
    {
      "indent": 3,
      "text": "A host MAY have several Locators at the same time, for example, if it has a single network interface connected to multiple subnetworks (e.g., VLAN deployments on wired Ethernet) or has multiple interfaces each on a different subnetwork. Locator values normally have Locator Preference Indicator (LPI) values associated with them. These LPIs indicate that a specific Locator value has higher or lower preference for use at a given time. Local LPI values may be changed through local policy or via management interfaces. Remote LPI values are normally learned from the DNS, but the local copy of a remote LPI value might be modified by local policy relating to preferred paths or prefixes.",
      "ja": "それは、複数のサブネットワーク（有線イーサネット上の例えば、VLANの展開）に接続された単一のネットワークインターフェースを有するか、または異なるサブネットワーク上の複数のインターフェイスをそれぞれ有する場合、ホストは、例えば、同時に複数のロケータがあるかもしれません。ロケータ値は、通常、ロケータ優先インジケータ（LPI）それらに関連付けられた値を持っています。これらのLPIは、特定のロケータ値を所定の時間に使用するための、より高いまたはより低い優先度を有することを示しています。ローカルLPI値は、ローカルポリシーを介して、または管理インターフェイスを介して変更することができます。リモートLPIの値は、通常、DNSから学習されますが、リモートのLPI値のローカルコピーが優先パスまたはプレフィックスに関連するローカルポリシーによって変更される可能性があります。"
    },
    {
      "indent": 3,
      "text": "Locator values are used only at the network layer. Locators are not used in end-to-end transport state. For example, Locators are not used in transport-layer session state or application-layer session state. However, this does not preclude an end-system setting up local dynamic bindings for a single transport flow to multiple Locator values concurrently.",
      "ja": "ロケータ値のみネットワーク層で使用されています。ロケータは、エンドツーエンドの輸送状態で使用されていません。たとえば、ロケータは、トランスポート層、セッション状態またはアプリケーション層のセッション状態では使用されません。しかしながら、これは、同時に複数のロケータ値に単一のトランスポート・フローのための局所的なダイナミックバインディングをセットアップするエンドシステムを排除するものではありません。"
    },
    {
      "indent": 3,
      "text": "The routing system only uses Locators, not Identifiers. For unicast traffic, ILNP uses longest-prefix match routing, just as the IP Internet does.",
      "ja": "ルーティングシステムはロケータではなく、識別子を使用しています。ユニキャストトラフィックのために、ILNPは、IPインターネットと同じように、最長プレフィックス一致ルーティングを使用しています。"
    },
    {
      "indent": 3,
      "text": "Section 4 below describes in more detail how Locators are used in forwarding and routing packets from a sending node on a source subnetwork to one or more receiving nodes on one or more destination subnetworks.",
      "ja": "セクション4は、以下のロケータは、1つの以上の宛先サブネットワーク上の一つ以上の受信ノードにソースサブネットワーク上の送信ノードからの転送およびルーティングパケットで使用される方法をより詳細に記載されています。"
    },
    {
      "indent": 3,
      "text": "A difference from earlier proposals [GSE] [8+8] is that, in normal operation, the originating host supplies both Source Locator and Destination Locator values in the packets it sends out.",
      "ja": "以前の提案[GSE] [8 + 8]との違いは、元のホスト供給元ロケータ及びそれが送出するパケット内の宛先ロケータ値の両方、通常動作時に、ということです。"
    },
    {
      "indent": 3,
      "text": "Section 4.3 describes packet forwarding in more detail, while Section 4.4 describes packet routing in more detail.",
      "ja": "セクション4.4でより詳細にパケットルーティングを説明しながら、セクション4.3は、より詳細にパケット転送を記述する。"
    },
    {
      "indent": 0,
      "text": "3.2.1. Locator Values Are Dynamic",
      "section_title": true,
      "ja": "3.2.1。ロケータ値は動的です"
    },
    {
      "indent": 3,
      "text": "The ILNP architecture recognises that Locator values are topologically significant, so the set of Locator values associated with a node normally will need to change when the node's connectivity to the Internet topology changes. For example, a mobile or multihomed node is likely to have connectivity changes from time to time, along with the corresponding changes to the set of Locator values.",
      "ja": "ILNPアーキテクチャは、ロケータの値は位相幾何学的に重要であることを認識し、そのノードに関連付けられたロケータ値のセットは、通常時にインターネットトポロジーの変更にノードの接続に変更する必要があります。例えば、モバイルまたはマルチホームノードは、ロケータ値のセットに対応する変更と共に、随時接続の変更を持っている可能性があります。"
    },
    {
      "indent": 3,
      "text": "When a node using a specific set of Locator values changes one or more of those Locator values, then the node (1) needs to update its local knowledge of its own Locator values, (2) needs to inform all active Correspondent Nodes (CNs) of those changes to its set of Locator values so that ILNP session continuity is maintained, and (3) if it expects incoming connections the node also needs to update its Locator-related entries in the Domain Name System. [RFC6741] describes the engineering and implementation details of this process.",
      "ja": "ロケータ値の特定のセットを使用して、ノードがそれらのロケータ値の一つ以上を変更し、その後、ノード（1）（2）すべてのアクティブな通信先ノードに通知する必要がある、独自のロケータ値のローカル知識を更新する必要がある（CNS）ロケータ値のセットに対するこれらの変更のILNPセッション連続性が維持され、それが着信接続を想定した場合（3）ノードは、ドメインネームシステムにおけるそのロケータに関連するエントリを更新する必要があることになります。 [RFC6741]は、このプロセスのエンジニアリングおよび実装の詳細について説明します。"
    },
    {
      "indent": 0,
      "text": "3.2.2. Locator Updates",
      "section_title": true,
      "ja": "3.2.2。ロケータアップデート"
    },
    {
      "indent": 3,
      "text": "As Locator values can be dynamic, and they could change for a node during an ILNP session, correspondents need to be notified when a Locator value for a node changes for any existing ILNP session. To enable this, a node that sees its Locator values have changed MUST send a Locator Update (LU) message to its correspondent nodes. The details of this procedure are discussed in other ILNP documents -- [RFC6741], [RFC6743], and [RFC6745]. (The change in Locator values may also need to be notified to DNS but that is discussed elsewhere.)",
      "ja": "ロケータ値を動的にすることができ、それらはILNPセッション中にノードのために変更される可能性としては、特派とき、既存のILNPセッションのためのノードの変更のためのロケータ値を通知する必要があります。これを有効にするには、そのロケータの値が変更されている見ているノードは、その通信相手ノードにロケータアップデート（LU）メッセージを送らなければなりません。 [RFC6741]、[RFC6743]及び[RFC6745]  - この手順の詳細は、他のILNP文書に記載されています。 （ロケータ値の変化はまた、DNSに通知するが、それは他の場所で議論される必要があるかもしれません。）"
    },
    {
      "indent": 0,
      "text": "3.2.3. Syntax",
      "section_title": true,
      "ja": "3.2.3。構文"
    },
    {
      "indent": 3,
      "text": "ILNP Locators have the same syntax as an IP unicast routing prefix.",
      "ja": "ILNPロケータは、IPユニキャストルーティングプレフィックスと同じ構文を持っています。"
    },
    {
      "indent": 0,
      "text": "3.2.4. Semantics",
      "section_title": true,
      "ja": "3.2.4。意味論"
    },
    {
      "indent": 3,
      "text": "ILNP unicast Locators have the same semantics as an IP unicast routing prefix, since they name a specific subnetwork. ILNP neither prohibits nor requires in-transit modification of Locator values.",
      "ja": "彼らは、特定のサブネットワークに名前を付けるため、ILNPユニキャストロケータは、IPユニキャストルーティングプレフィックスと同じ意味を持っています。 ILNPは禁止していないにもロケータ値の輸送中の変更を必要とし、どちらも。"
    },
    {
      "indent": 0,
      "text": "3.3. IP Address and Identifier-Locator Vector (I-LV)",
      "section_title": true,
      "ja": "3.3。 IPアドレスや識別子ロケータベクトル（I-LV）"
    },
    {
      "indent": 3,
      "text": "Historically, an IP Address has been considered to be an atomic datum, even though it is recognised that an IP Address has an internal structure: the network prefix plus either the host ID (IPv4) or the interface identifier (IPv6). However, this internal structure has not been used in end-system protocols; instead, all the bits of the IP Address are used. (Additionally, in IPv4 the IPv4 subnet mask uses bits from the host ID, a further confusion of the structure, even thought it is an extremely useful engineering mechanism.)",
      "ja": "ネットワークプレフィックスプラスホストID（IPv4）の又はインタフェース識別子（IPv6）のいずれか：歴史的に、IPアドレスは、それがIPアドレスは内部構造を有していることが認識されているにもかかわらず、原子基準であると考えられています。しかしながら、この内部構造は、エンドシステムプロトコルで使用されていません。代わりに、IPアドレスのすべてのビットが使用されています。 （また、IPv4のIPv4サブネットマスクがあっても、それは非常に有用な工学的機構であると考えられ、ホストID、構造の更なる混乱のビットを使用します。）"
    },
    {
      "indent": 3,
      "text": "In ILNP, the IP Address is replaced by an \"Identifier-Locator Vector\" (I-LV). This consists of a pairing of an Identifier value and a Locator value for that packet, written as [I, L]. All ILNP packets have Source Identifier, Source Locator, Destination Identifier, and Destination Locator values. The I value of the I-LV is used by upper-layer protocols (e.g., TCP, UDP, SCTP), so needs to be immutable. Locators are not used by upper-layer protocols (e.g., TCP, UDP, SCTP). Instead, Locators are similar to IP routing prefixes, and are only used to name a specific subnetwork.",
      "ja": "ILNPでは、IPアドレスは、「識別子ロケータベクター」（I-LV）に置き換えられています。これは[I、L]と書かれた識別子の値と、そのパケットのためのロケータ値のペアから成ります。すべてのILNPパケットが送信元識別子、ソースロケータ、宛先識別子、及び宛先ロケータ値を持っています。 I-LVのI値は上位層プロトコル（例えば、TCP、UDP、SCTP）によって使用されるので、不変である必要があります。ロケータは、上位層プロトコル（例えば、TCP、UDP、SCTP）によって使用されません。代わりに、ロケータは、IPルーティングプレフィックスと同様であり、唯一の特定のサブネットワークに名前を付けるために使用されています。"
    },
    {
      "indent": 3,
      "text": "While it is possible to say that an I-LV is an approximation to an IP Address of today, it should be understood that an I-LV:",
      "ja": "それはI-LVは、今日のIPアドレスへの近似であると言うことは可能であるが、それはI-LVことを理解すべきです。"
    },
    {
      "indent": 6,
      "text": "a) is not an atomic datum, being a pairing of two data types, an Identifier and a Locator.",
      "ja": "A）2つのデータ型、識別子及びロケータのペアリングされ、原子基準ではありません。"
    },
    {
      "indent": 6,
      "text": "b) has different semantics and properties to an IP Address, as is described in this document.",
      "ja": "b）は、この文書に記載されているように、IPアドレスに異なる意味や特性を有しています。"
    },
    {
      "indent": 3,
      "text": "In our discussion, it will be convenient sometimes to refer to an I-LV, but sometimes to refer only to an Identifier value, or only to a Locator value.",
      "ja": "我々の議論では、I-LVを参照することが時には便利になりますが、時には唯一の識別子の値に、または唯一のロケータ値を参照します。"
    },
    {
      "indent": 3,
      "text": "ILNP packets always contain a source I-LV and a destination I-LV.",
      "ja": "ILNPパケットは、常にソースI-LVと宛先I-LVが含まれています。"
    },
    {
      "indent": 0,
      "text": "3.4. Notation",
      "section_title": true,
      "ja": "3.4。表記法"
    },
    {
      "indent": 3,
      "text": "In describing how capabilities are implemented in ILNP, we will consider the differences in end-systems' state between IP and ILNP in order to highlight the architectural changes.",
      "ja": "機能がILNPに実装されている方法を説明する際に、我々は、アーキテクチャの変更を強調するためにIPとILNP間のエンドシステム状態の違いを検討します。"
    },
    {
      "indent": 3,
      "text": "We define a formal notation to represent the data contained in the transport-layer session state. We define:",
      "ja": "我々は、トランスポート層セッション状態に含まれるデータを表現するための正式な表記法を定義します。私たちは、定義します。"
    },
    {
      "indent": 6,
      "text": "A = IP Address I = Identifier L = Locator P = Transport-layer port number",
      "ja": "= IPアドレスI =識別子L =ロケータP =トランスポート層ポート番号"
    },
    {
      "indent": 3,
      "text": "To differentiate the local and remote values for the above items, we also use suffixes, for example:",
      "ja": "上記の項目のためのローカルおよびリモートの値を区別するために、我々はまた、たとえば、接尾辞を使用します。"
    },
    {
      "indent": 6,
      "text": "_L = local _R = remote",
      "ja": "_L =ローカル_R =リモート"
    },
    {
      "indent": 3,
      "text": "With IPv4 and IPv6 today, the invariant state at the transport-layer for TCP can be represented by the tagged tuple:",
      "ja": "IPv4とIPv6では、今日、TCPのためのトランスポート層での不変の状態はタグ付きのタプルで表すことができます。"
    },
    {
      "indent": 6,
      "text": "<TCP: A_L, A_R, P_L, P_R>                               --- (1)",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Tag values that will be used are:",
      "ja": "使用されるタグの値は、次のとおりです。"
    },
    {
      "indent": 8,
      "text": "IP   Internet Protocol\nILNP Identifier-Locator Network Protocol\nTCP  Transmission Control Protocol\nUDP  User Datagram Protocol",
      "raw": true
    },
    {
      "indent": 3,
      "text": "So, for example, with IP, a UDP packet would have the tagged tuple:",
      "ja": "したがって、たとえば、IPと、UDPパケットがタグ付けされたタプルを持っています："
    },
    {
      "indent": 6,
      "text": "<UDP: A_L, A_R, P_L, P_R>                               --- (2)",
      "raw": true
    },
    {
      "indent": 3,
      "text": "A TCP segment carried in an IP packet may be represented by the tagged tuple binding:",
      "ja": "IPパケットで運ばれるTCPセグメントが結合タグ付き組で表すことができます。"
    },
    {
      "indent": 6,
      "text": "<TCP: A_L, A_R, P_L, P_R><IP: A_L, A_R>                 --- (3)",
      "raw": true
    },
    {
      "indent": 3,
      "text": "and a UDP packet would have the tagged tuple binding:",
      "ja": "そして、UDPパケットがバインディングタグ付けされたタプルを持っています："
    },
    {
      "indent": 6,
      "text": "<UDP: A_L, A_R, P_L, P_R><IP: A_L, A_R>                 --- (4)",
      "raw": true
    },
    {
      "indent": 3,
      "text": "In ILNP, the transport-layer state for TCP is:",
      "ja": "ILNPでは、TCPのためのトランスポート層の状態は次のとおりです。"
    },
    {
      "indent": 6,
      "text": "<TCP: I_L, I_R, P_L, P_R>                               --- (5)",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The binding for a TCP segment within an ILNP packet:",
      "ja": "ILNPパケット内のTCPセグメントのためのバインディング："
    },
    {
      "indent": 6,
      "text": "<TCP: I_L, I_R, P_L, P_R><ILNP: L_L, L_R>               --- (6)",
      "raw": true
    },
    {
      "indent": 3,
      "text": "When comparing tuple expressions (3) and (6), we see that for IP, any change to network addresses impacts the end-to-end state, but for ILNP, changes to Locator values do not impact end-to-end state. This provides end-system session state invariance, a key feature of ILNP compared to IP as it is used in some situations today. ILNP adopts the end-to-end approach for its architecture [SRC84]. As noted previously, nodes MAY have more than one Locator concurrently, and nodes MAY change their set of active Locator values as required.",
      "ja": "（3）タプル式を比較すると、（6）とき、私たちはIPのために、ネットワークへの変更は、エンドツーエンドの状態への影響に対処しますが、ILNPため、ロケータ値への変更は、エンドツーエンドの状態に影響を与えないことがわかります。これは、エンド・システムのセッション状態不変、それは今日、いくつかの状況で使用されるようIPに比べILNPの主要な機能を提供します。 ILNPは、建築[SRC84]のエンドツーエンドアプローチを採用しています。先に述べたように、ノードは、同時に複数のロケータを有することができ、必要に応じて、ノードがアクティブロケータ値の彼らのセットを変更することができます。"
    },
    {
      "indent": 3,
      "text": "While these documents do not include SCTP examples, the same notation can be used, simply substituting the string \"SCTP\" for the string \"TCP\" or the string \"UDP\" in the above examples.",
      "ja": "これらの文書は、SCTPの例が含まれていませんが、同様の表記は、単純に文字列「TCP」または上記の例では、文字列「UDP」の文字列「SCTP」を代入し、使用することができます。"
    },
    {
      "indent": 0,
      "text": "3.5. Transport-Layer State and Transport Pseudo-Headers",
      "section_title": true,
      "ja": "3.5。トランスポート・レイヤ・ステートとトランスポート疑似ヘッダ"
    },
    {
      "indent": 3,
      "text": "In ILNP, protocols above the network layer do not use the Locator values. Thus, the transport layer uses only the I values for the transport-layer session state (e.g., TCP pseudo-header checksum, UDP pseudo-header checksum), as is shown, for example, in expression (6) above.",
      "ja": "ILNPでは、ネットワーク層以上のプロトコルは、ロケータの値を使用しないでください。例えば、上記（6）式に示されるようにこのように、輸送層は、トランスポート層セッション状態（例えば、TCP疑似ヘッダチェックサム、UDP疑似ヘッダチェックサム）のための唯一のI値を使用します。"
    },
    {
      "indent": 3,
      "text": "Additionally, from a practical perspective, while the I values are only used in protocols above the network layer, it is convenient for them to be carried in network packets, so that the namespace for the I values can be used by any transport-layer protocols operating above the common network layer.",
      "ja": "I値は唯一のネットワーク層以上のプロトコルで使用されている間、それらがネットワークパケットで搬送するためのI値の名前空間は、任意のトランスポート層プロトコルで使用できるように加えて、実用的な観点から、それは、便利です一般的なネットワーク層以上で動作します。"
    },
    {
      "indent": 0,
      "text": "3.6. Rationale for This Document",
      "section_title": true,
      "ja": "3.6。このドキュメントのための理論的根拠"
    },
    {
      "indent": 3,
      "text": "This document provides an architectural description of the core ILNP capabilities and functions. It is based around the use of example scenarios so that practical issues can be highlighted.",
      "ja": "この文書では、コアILNP機能と機能のアーキテクチャ記述を提供します。実用的な問題を強調表示することができるようにそれは、シナリオ例の使用に基づいています。"
    },
    {
      "indent": 3,
      "text": "In some cases, illustrative suggestions and light discussion are presented with respect to engineering issues, but detailed discussion of engineering issues are deferred to other ILNP documents.",
      "ja": "いくつかのケースでは、説明の提案と光の議論は、エンジニアリングの問題に関して提示されているが、技術上の問題の詳細な議論は、他のILNP文書に延期されています。"
    },
    {
      "indent": 3,
      "text": "The order of the examples presented below is intended to allow an incremental technical understanding of ILNP to be developed. There is no other reason for the ordering of the examples listed below.",
      "ja": "以下に示す実施例の順序はILNPの増分技術的な理解が開発できるようにするためのものです。以下に示す例の順序のための他の理由はありません。"
    },
    {
      "indent": 3,
      "text": "Many of the descriptions are based on the use of an example site network as shown in Figure 3.1.",
      "ja": "図3.1に示すように、説明の多くは、例えばサイトネットワークの使用に基づいています。"
    },
    {
      "indent": 6,
      "text": "   site                         . . . .      +----+\n  network                      .       .-----+ CN |\n  . . . .      +------+ link1 .         .    +----+\n .       .     |      +------.           .\n.    D    .    |      |      .           .\n.         .----+ SBR  |      . Internet  .\n.  H      .    |      |      .           .\n .       .     |      +------.           .\n  . . . .      +------+ link2 .         .\n                               .       .\n                                . . . .",
      "raw": true
    },
    {
      "indent": 10,
      "text": " CN  = Correspondent Node\n  D  = Device\n  H  = Host\nSBR  = Site Border Router",
      "raw": true
    },
    {
      "indent": 6,
      "text": "Figure 3.1: A Simple Site Network for ILNP Examples",
      "ja": "図3.1：ILNP例のためのシンプルなサイトのネットワーク"
    },
    {
      "indent": 3,
      "text": "In some cases, hosts (H) or devices (D) act as end-systems within the site network, and communicate with (one or more) Correspondent Node (CN) instances that are beyond the site.",
      "ja": "サイトネットワーク内のエンドシステムのようないくつかのケースでは、ホスト（H）またはデバイス（D）行為、およびサイトを超えているインスタンス（1つ以上）の対応ノード（CN）と通信します。"
    },
    {
      "indent": 3,
      "text": "Note that the figure is illustrative and presents a logical view. For example, the CN may itself be on a site network, just like H or D.",
      "ja": "図は例示であり、論理的なビューを提供することに注意してください。例えば、CNは、それ自体だけHまたはDのように、サイトのネットワーク上にあってもよいです"
    },
    {
      "indent": 3,
      "text": "Also, for formulating examples, we assume ILNPv6 is in use, which has the same packet header format (as viewed by routers) as IPv6, and can be seen as a superset of IPv6 capabilities.",
      "ja": "また、例を処方するために、我々はILNPv6がIPv6として（ルータによって見て）同じパケットヘッダフォーマットを有し、およびIPv6機能のスーパーセットとして見ることができる、使用中であると仮定する。"
    },
    {
      "indent": 3,
      "text": "For simplicity, we assume that name resolution is via the deployed DNS, which has been updated to store DNS records for ILNP [RFC6742].",
      "ja": "簡単にするために、我々は、名前解決がILNP [RFC6742]のためのDNSレコードを格納するように更新されている展開DNS経由であることを前提としています。"
    },
    {
      "indent": 3,
      "text": "Note that, from an engineering viewpoint, this does NOT mean that the DNS also has to be ILNP capable: existing IPv4 or IPv6 infrastructure can be used for DNS transport.",
      "ja": "なお、エンジニアリングの観点から、これはDNSも可能ILNPなければならないことを意味しません：既存のIPv4またはIPv6インフラストラクチャは、DNSの輸送のために使用することができます。"
    },
    {
      "indent": 0,
      "text": "3.7. ILNP Multicasting",
      "section_title": true,
      "ja": "3.7。 ILNPマルチキャスト"
    },
    {
      "indent": 3,
      "text": "Multicast forwarding and routing are unchanged, in order to avoid requiring changes in deployed IP routers and routing protocols. ILNPv4 multicasting is the same as IETF Standards Track IPv4 multicasting [RFC1112] [RFC3376]. ILNPv6 multicasting is the same as IETF Standards Track IPv6 multicasting [RFC4291] [RFC2710] [RFC3810].",
      "ja": "マルチキャスト転送及びルーティングは、展開IPルータとルーティングプロトコルに必要な変更を避けるために、変更されません。 ILNPv4マルチキャストはIETF標準化過程のIPv4マルチキャスト[RFC1112]、[RFC3376]と同じです。 ILNPv6マルチキャストはIETF標準化過程のIPv6マルチキャスト[RFC4291] [RFC2710] [RFC3810]と同じです。"
    },
    {
      "indent": 0,
      "text": "4. ILNP Basic Connectivity",
      "section_title": true,
      "ja": "4. ILNP基本的な接続"
    },
    {
      "indent": 3,
      "text": "In this section, we describe basic packet forwarding and routing in ILNP. We highlight areas where it is similar to current IP, and also where it is different from current IP. We use examples in order to illustrate the intent and show the feasibility of the approach.",
      "ja": "このセクションでは、我々はILNPにおける基本的なパケット転送とルーティングについて説明します。私たちは、それが現在のIPに似ている領域を強調表示し、また、それは、現在のIPと異なるです。私たちは、意図を説明するために例を使用し、アプローチの実現可能性を示しています。"
    },
    {
      "indent": 3,
      "text": "For this section, in Figure 4.1, H is a fixed host in a simple site network, and CN is a remote Correspondent Node outside the site; H and CN are ILNP-capable, while the Site Border Router (SBR) does not need to be ILNP-capable.",
      "ja": "このセクションでは、図4.1で、Hは、単純なサイトのネットワーク内の固定ホストであり、CNは、サイト外の遠隔通信先ノードです。サイト境界ルータ（SBR）がILNP対応している必要はありませんがHおよびCNは、ILNP-が可能です。"
    },
    {
      "indent": 6,
      "text": "   site                         . . . .      +----+\n  network                      .       .-----+ CN |\n  . . . .      +------+       .         .    +----+\n .       .     |      +------.           .\n.         .    |      |      .           .\n.         .----+ SBR  |      . Internet  .\n.  H      .    |      |      .           .\n .       .     |      |      .           .\n  . . . .      +------+       .         .\n                               .       .\n                                . . . .",
      "raw": true
    },
    {
      "indent": 10,
      "text": " CN  = Correspondent Node\n  H  = Host\nSBR  = Site Border Router",
      "raw": true
    },
    {
      "indent": 6,
      "text": "Figure 4.1: A Simple Site Network for ILNP Examples",
      "ja": "図4.1：ILNP例のためのシンプルなサイトのネットワーク"
    },
    {
      "indent": 0,
      "text": "4.1. Basic Local Configuration",
      "section_title": true,
      "ja": "4.1。基本的なローカル設定"
    },
    {
      "indent": 3,
      "text": "This section uses the term \"address management\", in recognition of the analogy with capabilities present in IP today. In this document, address management is about enabling hosts to attach to a subnetwork and enabling network-layer communication between and among hosts, also including:",
      "ja": "このセクションでは、今日のIPに存在する機能を備えた類推の認識では、用語「アドレス管理」を使用しています。この文書では、アドレス管理は、サブネットワークに接続するホストを可能にし、ホスト間との間でネットワーク層の通信を可能にする、さらに含む程度です。"
    },
    {
      "indent": 6,
      "text": "a) enabling identification of a node within a site. b) allowing basic routing/forwarding from a node acting as an end-system.",
      "ja": "a）は、サイト内のノードの識別を可能にします。 B）エンドシステムとして動作するノードからの基本的なルーティング/転送を可能にします。"
    },
    {
      "indent": 3,
      "text": "If we consider Figure 4.1, imagine that host H has been connected to the site network. Administratively, it needs at least one I value and one L value in order to be able to communicate.",
      "ja": "我々は図4.1を検討している場合、ホストHは、サイトのネットワークに接続されていることを想像してみてください。管理上、それが通信できるようにするために、少なくとも一つのI値と1つのL値を必要とします。"
    },
    {
      "indent": 3,
      "text": "Today, local administrative procedures allocate IP Addresses, often using various protocol mechanisms (e.g., NETCONF-based router configuration, DHCP for IPv4, DHCP for IPv6, IPv6 Router Advertisements). Similarly, local administrative procedures can allocate I and L values as required, e.g., I_H and L_H. This may be through manual configuration.",
      "ja": "今日では、ローカル管理手順は、しばしば、様々なプロトコルメカニズム（例えば、NETCONFベースのルータの設定、IPv4のDHCPはIPv6、IPv6ルーター広告のDHCP）を使用して、IPアドレスを割り当てます。同様に、ローカル管理手順が必要で、例えば、I_HとL_HとしてIとL値を割り当てることができます。これは、手動設定によるものであってもよいです。"
    },
    {
      "indent": 3,
      "text": "Additionally, if it is expected or desired that H might have incoming communication requests, e.g., it is a server, then the values I_H and L_H can be added to the relevant name services (e.g., DNS, NIS/YP), so that FQDN lookups for H resolve to the appropriate DNS resource records (e.g., NID, L32, L64, and LP [RFC6742]) for node H.",
      "ja": "さらに、それは期待やHが着信通信要求があるかもしれないことが望まれる場合には、例えば、それはサーバであり、その後、I_HとL_Hは、関連するネームサービスに追加することができる値（例えば、DNS、NIS / YP）、FQDNいるのでノードH.ための適切なDNSリソースレコード（例えば、NID、L32、L64、およびLP [RFC6742]）にHを解決するためのルックアップ"
    },
    {
      "indent": 3,
      "text": "From a network operations perspective, this whole process also can be automated. As an example, consider that in Figure 3.1 the Site Border Router (SBR) is an IPv6-capable router and is connected via link1 to an ISP that supports IPv6. The SBR will have been allocated one (or more) IPv6 prefixes that it will multicast using IPv6 Routing Advertisements (RAs) into the site network, e.g., prefix L_1. L_1 is actually a local IPv6 prefix (/64), which is formed from an address assignment by the upstream ISP, according to [RFC3177] or [RFC6177]. Host H will see these RAs, for example, on its local interface with name eth0, will be able to use that prefix as a Locator value, and will cache that Locator value locally.",
      "ja": "ネットワーク運用の観点から、このプロセス全体を自動化することもできます。一例として、図3.1サイト境界ルータ（SBR）でIPv6対応のルータであり、IPv6をサポートするISPにリンク1を介して接続されていることを考えます。 SBRは、1つ（または複数）を割り当てられているであろうIPv6は、それは、例えば、サイトのネットワークにプレフィックスL_1をIPv6ルーティングアドバタイズメント（RAS）を使用してマルチキャストすることプレフィックス。 L_1は[RFC3177]または[RFC6177]によれば、実際に上流のISPによるアドレス割り当てから形成されているローカルIPv6プレフィックス（/ 64）です。 Hは、名前はeth0とそのローカルインターフェイスで、例えば、これらのRAが表示されますホスト、ロケータ値としてその接頭辞を使用することができますし、ローカルでそのロケータ値をキャッシュします。"
    },
    {
      "indent": 3,
      "text": "Also, node H can use the mechanism documented in either Section 2.5.1 of [RFC4291], in [RFC3972], [RFC4581], [RFC4982], or in [RFC4941] in order to create a default I value (say, I_H), just as an IPv6 host can. For DNS, the I_H and L_1 values may be pre-configured in DNS by an administrator who already has knowledge of these, or added to DNS by H using Secure DNS Dynamic Update [RFC3007] to add or update the correct NID and L64 records to DNS for the FQDN for H.",
      "ja": "また、ノードHは、デフォルトIの値（たとえば、I_Hを作成するために[RFC3972]で、[RFC4581]、[RFC4982]、または[RFC4941]に、[RFC4291]のセクション2.5.1のいずれかに記載の機構を使用することができ）、単にIPv6ホスト缶など。 DNSのために、I_HとL_1値は、既にこれらの知識を持つ管理者がDNSに予め構成されていてもよい、またはに正しいNIDとL64のレコードを追加または更新するセキュアDNS動的更新[RFC3007]を使用してHによりDNSに付加しますH.のためのFQDNのためのDNS"
    },
    {
      "indent": 0,
      "text": "4.2. I-L Communication Cache",
      "section_title": true,
      "ja": "4.2。 I-Lコミュニケーションキャッシュ"
    },
    {
      "indent": 3,
      "text": "For the purposes of explaining the concept of operations, we talk of a local I-L Communication Cache (ILCC). This is an engineering convenience and does not form part of the ILNP architecture, but is used in our examples. More details on the ILCC can be found in [RFC6741]. The ILCC contains information that is required for the operation of ILNP. This will include, amongst other things, the current set of valid Identifier and Locator values in use by a node, the bindings between them, and the bindings between Locator values and interfaces.",
      "ja": "操作の概念を説明する目的のために、私たちは地元のI-Lコミュニケーションキャッシュ（ILCC）の話します。これは、エンジニアリングの利便性であるとILNPアーキテクチャの一部を形成しないが、私たちの例で使用されています。 ILCCについての詳細は、[RFC6741]で見つけることができます。 ILCCはILNPの操作に必要な情報が含まれています。これは、とりわけ、ノードによって使用されている有効な識別子とロケータ値の現在のセット、それらの間の結合、及びロケータ値とインターフェイスとの間のバインディングを含むであろう。"
    },
    {
      "indent": 0,
      "text": "4.3. Packet Forwarding",
      "section_title": true,
      "ja": "4.3。パケット転送"
    },
    {
      "indent": 3,
      "text": "When the SBR needs to send a packet to H, it uses local address resolution mechanisms to discover the bindings between interface addresses and currently active I-LVs for H. For our example of Figure 3.1, IPv6 Neighbour Discovery (ND) can be used without modification, as the I-LV for ILNPv6 occupies the same bits as the IPv6 address in the IPv6 header. For packets from H to SBR, the same basic mechanism applies, as long as SBR supports IPv6 and even if it is not ILNPv6-capable, as IPv6 ND is used unmodified for ILNPv6.",
      "ja": "SBRはHにパケットを送信する必要がある場合には、図3.1の例のインターフェイスアドレス及びH.ための現在アクティブなI-LVの間のバインディングを発見するローカルアドレス解決メカニズムを使用して、IPv6近隣探索（ND）をすることなく使用することができます変形、ILNPv6ためのI-LVは、IPv6ヘッダーのIPv6アドレスと同じビットを占めています。 IPv6のNDがILNPv6ために修飾されていない使用されているように、SBRは、IPv6をサポートし、それがILNPv6対応しない場合でもとしてHからSBRへのパケットのために、同じ基本的な機構であれば、適用されます。"
    },
    {
      "indent": 3,
      "text": "For Figure 3.1, assuming:",
      "ja": "図3.1は、仮定："
    },
    {
      "indent": 3,
      "text": "- SBR advertises prefix L_1 locally, uses I value I_S, and has an Ethernet MAC address M_S on interface with local name sbr0",
      "ja": " -  SBRは、私がI_Sに価値を使用して、ローカルプレフィックスL_1を広告、およびローカル名SBR0とのインタフェースのイーサネットMACアドレスM_Sを持っています"
    },
    {
      "indent": 3,
      "text": "- H uses I value I_H, and has an Ethernet MAC address of M_H on the interface with local name eth0",
      "ja": " -  Hは、私がI_Hに価値を使用し、ローカル名はeth0とのインタフェースにM_HのイーサネットMACアドレスを持っています"
    },
    {
      "indent": 3,
      "text": "then H will have in its ILCC:",
      "ja": "その後、HはそのILCCになります。"
    },
    {
      "indent": 6,
      "text": "[I_H, L_1]                                         --- (7a)\nL_1, eth0                                          --- (7b)",
      "raw": true
    },
    {
      "indent": 3,
      "text": "After the IPv6 RA and ND mechanism has executed, the ILCC at H would contain, as well as expressions (7a) and (7b), the following entry for SBR:",
      "ja": "IPv6のRAおよびNDメカニズムが実行された後、HでILCCを含有するであろう、ならびに式（7A）及び（7B）、SBRのための次のエントリ："
    },
    {
      "indent": 6,
      "text": "[I_S, L_1], M_S                                    --- (8)",
      "raw": true
    },
    {
      "indent": 3,
      "text": "For ILNPv6, it does not matter that the SBR is not ILNPv6-capable, as the I-LV [I_S, L_1] is physically equivalent to the IPv6 address for the internal interface sbr0.",
      "ja": "I-LV [I_S、L_1]は内部インターフェースSBR0のIPv6アドレスと物理的に等価であるようILNPv6のために、SBRはILNPv6、できないことは問題ではありません。"
    },
    {
      "indent": 3,
      "text": "At SBR, which is not ILNP-capable, there would be the following entries in its local cache and configuration:",
      "ja": "ILNP対応ではないSBRでは、ローカルキャッシュおよびコンフィギュレーションに次のエントリが存在することになります。"
    },
    {
      "indent": 6,
      "text": "L_1:I_S                                           --- (9a)\nL_1, sbr0                                         --- (9b)",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Expression (9a) represents a valid IPv6 ND entry: in this case, the I_S value (which is 64 bits in ILNPv6) and the L_1 values are, effectively, concatenated and treated as if they were a single IPv6 address. Expression (9b) binds transmissions for L_1 to interface sbr0. (Again, sbr0 is a local, implementation-specific name, and such a binding is possible with standard tools today, for example, ifconfig(8).)",
      "ja": "式（9A）は、有効なIPv6 NDエントリ表す：この場合、I_S値（ILNPv6で64ビットである）、それらは、単一のIPv6アドレスであるかのようL_1値は、効果的に、連結及び処理されます。式（9b）がSBR0をインタフェースするL_1ための送信をバインドします。 （ここでも、SBR0は、ローカル、実装に固有の名前であり、そしてこのような結合は、例えば、標準的なツールで現在可能では、ifconfig（8））。"
    },
    {
      "indent": 0,
      "text": "4.4. Packet Routing",
      "section_title": true,
      "ja": "4.4。パケットルーティング"
    },
    {
      "indent": 3,
      "text": "If we assume that host H is configured as in the previous section, it is now ready to send and receive ILNP packets.",
      "ja": "私たちは、ホストHは、前節のように構成されていることを前提とした場合、今ILNPパケットを送信し、受信する準備ができています。"
    },
    {
      "indent": 3,
      "text": "Let us assume that, for Figure 4.1, it wishes to contact the node CN, which has FQDN cn.example.com and is ILNP-capable. A DNS query by H for cn.example.com will result in NID and L64 records for CN, with values I_CN and L_CN, respectively, being returned to H and stored in its ILCC:",
      "ja": "図4.1のために、それはFQDN cn.example.comを持っており、ILNP-できるノードCNに、連絡したい、私たちはそれを想定してみましょう。 cn.example.comためのHによるDNSクエリがCNのためのNIDおよびL64レコードになり、値はそれぞれI_CNとL_CNと、Hに戻され、そのILCCに格納されています。"
    },
    {
      "indent": 6,
      "text": "[I_CN, L_CN]                                     --- (10)",
      "raw": true
    },
    {
      "indent": 3,
      "text": "This will be considered active as long as the TTL values for the DNS records are valid. If the TTL for an I or L value is zero, then the value is still usable but becomes stale as soon as it has been used once. However, it is more likely that the TTL value will be greater than zero [BA11] [SBK01].",
      "ja": "これは、長いDNSレコードのTTL値が有効であるとして、アクティブと見なされます。 IまたはL値のTTLがゼロの場合、その値はまだ使用可能ですが、それは、一度使用されているとすぐに古くなってしまいます。しかし、[SBK01] [BA11] TTL値がゼロよりも大きくなる可能性が高いです。"
    },
    {
      "indent": 3,
      "text": "Once the CN's I value is known, the upper-layer protocol, e.g., the transport protocol, can set up suitable transport-layer session state:",
      "ja": "CNのI値がわかれば、上位層プロトコルは、例えば、トランスポートプロトコルは、適切なトランスポート層セッション状態を設定することができます。"
    },
    {
      "indent": 6,
      "text": "<UDP: I_H, I_CN, P_H, P_CN>                     --- (11)",
      "raw": true
    },
    {
      "indent": 3,
      "text": "For routing of ILNP packets, the destination L value in an ILNPv6 packet header is semantically equivalent to a routing prefix. So, once a packet has been forwarded from a host to its first-hop router, only the destination L value needs to be used for getting the packet to the destination network. Once the packet has arrived at the router for the site network, local mechanisms and the packet-forwarding mechanism, as described above in Section 4.3, allow the packet to be delivered to the host.",
      "ja": "ILNPパケットのルーティングのために、ILNPv6パケットヘッダ内の宛先L値は、ルーティングプレフィックスと意味的に等価です。だから、一度パケットは、宛先L値が宛先ネットワークにパケットを取得するために使用される必要があり、その最初のホップルータにホストから転送されてきました。 4.3節で前述したように、パケットは、サイトのネットワーク、地元のメカニズムとパケット転送メカニズムのためのルータに到着した後は、パケットはホストに配信することを可能にします。"
    },
    {
      "indent": 3,
      "text": "For our example of Figure 4.1, H will send a UDP packet over ILNP as:",
      "ja": "図4.1の当社例えば、HはILNP上としてUDPパケットを送信します。"
    },
    {
      "indent": 6,
      "text": "<UDP: I_H, I_CN, P_H, P_CN><ILNP: L_1, L_CN>     --- (12a)",
      "raw": true
    },
    {
      "indent": 3,
      "text": "and CN will send UDP packets to H as:",
      "ja": "そしてCNはHようにUDPパケットを送信します。"
    },
    {
      "indent": 6,
      "text": "<UDP: I_CN, I_H, P_CN, P_H><ILNP: L_CN, L_1>     --- (12b)",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The I value for H used in the transport-layer state (I_H in expression (12a)) selects the correct L value (L_1 in this case) from the bindings in the ILCC (expression (7a)), and that, in turn, selects the correct interface from the ILCC (expression (7b)), as described in Section 4.2. This gets the packet to the first hop router; beyond that, the ILNPv6 packet is treated as if it were an IPv6 packet.",
      "ja": "（式（12A）でI_H）トランスポート層の状態で使用HのI値はILCCにバインディングから（この場合L_1）正しいL値（式（7A））を選択し、その順番で、セクション4.2で説明したように、ILCC（式（7B））から正しいインタフェースを選択します。これは、最初のホップルータにパケットを取得します。それはIPv6パケットであるかのようにそれを超えて、ILNPv6パケットが処理されます。"
    },
    {
      "indent": 0,
      "text": "5. Multihoming and Multi-Path Transport",
      "section_title": true,
      "ja": "5.マルチホーミングとマルチパス交通"
    },
    {
      "indent": 3,
      "text": "For multihoming, there are three cases to consider:",
      "ja": "マルチホーミングのために、考慮すべき3つのケースがあります。"
    },
    {
      "indent": 6,
      "text": "a) Host Multihoming (H-MH): a single host is, individually, connected to multiple upstream links, via separate routing paths, and those multiple paths are used by that host as it wishes. That is, use of multiple upstream links is managed by the single host itself. For example, the host might have multiple valid Locator values on a single interface, with each Locator value being associated with a different upstream link (provider).",
      "ja": "A）ホストマルチホーム（H-MH）：単一のホストは、個々に、別々のルーティング経路を介して、複数のアップストリームリンクに接続され、それが望むように、これら複数のパスがそのホストによって使用されています。これは、複数の上流リンクの使用は、単一のホスト自身によって管理されています。例えば、ホストは、異なるアップストリームリンク（プロバイダ）に関連付けられている各ロケータ値を用いて、単一のインターフェース上の複数の有効なロケータ値を有するかもしれません。"
    },
    {
      "indent": 6,
      "text": "b) Multi-Path Transport (MTP): This is similar to using ILNP's support for host multihoming (i.e., H-MH), so we describe multi-path transport here. (Indeed, for ILNP, this can be considered a special case of H-MH.)",
      "ja": "b）は、マルチパス転送（MTP）：これは、ホストマルチホーミング（すなわち、H-MH）のためのILNPのサポートを使用するのと同様であるので、ここでのマルチパスの輸送を記述する。 （実際、ILNPため、これはH-MHの特別な場合と考えることができます。）"
    },
    {
      "indent": 6,
      "text": "c) Site Multihoming (S-MH): a site network is connected to multiple upstream links via separate routing paths, and hosts on the site are not necessarily aware of the multiple upstream paths. That is, the multiple upstream paths are managed, typically, through a site border router, or via the providers.",
      "ja": "C）サイトマルチホーミング（S-MH）：サイトのネットワークは、別々のルーティング経路を介して複数のアップストリームリンクに接続され、サイト上のホストは、必ずしも複数のアップストリームパスを認識していないれます。これは、複数の上流のパスは、サイトの境界ルータを介して、またはプロバイダを経由して、一般的に、管理されています。"
    },
    {
      "indent": 3,
      "text": "Essentially, for ILNP, multihoming is implemented by enabling:",
      "ja": "基本的に、ILNPのために、マルチホーミングを有効にすることによって実装されます。"
    },
    {
      "indent": 6,
      "text": "a) multiple Locator values to be used simultaneously by a node",
      "ja": "A）複数のロケータ値がノードによって同時に使用されます"
    },
    {
      "indent": 6,
      "text": "b) dynamic, simultaneous binding between one (or more) Identifier value(s) and multiple Locator values",
      "ja": "B）動的、1つ（または複数）識別子の値（S）と、複数のロケータ値の間の結合を同時"
    },
    {
      "indent": 3,
      "text": "With respect to the requirements for hosts [RFC1122], the multihoming function provided by ILNP is very flexible. It is not useful to discuss ILNP multihoming strictly within the confines of the exposition presented in Section 3.3.4 of [RFC1122], as that text is couched in terms of relationships between IP Addresses and interfaces, which can be dynamic in ILNP. The closest relationship between ILNP multihoming and [RFC1122] would be that certainly ILNP could support the notion of \"Multiple Logical Networks\", \"Multiple Logical Hosts\", and \"Simple Multihoming\".",
      "ja": "ホスト[RFC1122]の要件に関しては、ILNPによって提供マルチホーミング機能は非常に柔軟です。そのテキストはILNPで動的であることができるIPアドレスとインターフェースの間の関係の観点で表現されているように、厳密には[RFC1122]のセクション3.3.4に提示博覧会の範囲内ILNPマルチホーミングを議論することは有用ではありません。 ILNPマルチホーミングと[RFC1122]の間の最も近い関係は確かにILNPは、「複数の論理ネットワーク」の概念をサポート「複数の論理ホスト」、および「シンプル・マルチホーミング」ことができることになります。"
    },
    {
      "indent": 0,
      "text": "5.1. Host Multihoming (H-MH)",
      "section_title": true,
      "ja": "5.1。ホストマルチホーミング（H-MH）"
    },
    {
      "indent": 3,
      "text": "At present, host multihoming is not common in the deployed Internet. When TCP or UDP are in use with an IP-based network-layer session, host multihoming cannot provide session resilience, because the transport protocol's pseudo-header checksum binds the transport-layer session to a single IP Address of the multihomed node, and hence to a single interface of that node. SCTP has a protocol-specific mechanism to support node multihoming; SCTP can support session resilience both at present and also without change in the proposed approach [RFC5061].",
      "ja": "現時点では、ホストマルチホーミングが展開され、インターネットでは一般的ではありません。 TCPまたはUDPは、IPベースのネットワーク層セッションに使用されている場合、ホスト・マルチホーミングは、トランスポートプロトコルの疑似ヘッダチェックサムは、マルチホームノードの単一のIPアドレスへのトランスポート層セッションに結合するため、セッションの回復力を提供し、したがってことができませんそのノードの単一のインタフェースです。 SCTPは、ノードマルチホーミングをサポートするプロトコル固有の機構を有しています。 SCTPは、現在、また、提案されたアプローチ[RFC5061]に変更することなく、両方のセッションの復元をサポートすることができます。"
    },
    {
      "indent": 3,
      "text": "Host multihoming in ILNP is supported directly in each host by ILNP. The simplest explanation of H-MH for ILNP is that an ILNP-capable host can simultaneously use multiple Locator values, for example, by having a binding between an I value and two different L values, e.g., the ILCC may contain the I-LVs:",
      "ja": "ILNPのホストマルチホーミングはILNPにより、各ホストで直接サポートされています。 ILNPためのH-MHの最も簡単な説明はILNP対応ホストが同時に複数のロケータ値を使用することができ、例えば、例えば、I値および2つの異なるL値との間の結合を有することによって、ILCCはI-LVを含んでいてもよいということです："
    },
    {
      "indent": 6,
      "text": "[I_1, L_1]                                       --- (14a)\n[I_1, L_2]                                       --- (14b)",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Additionally, a host may use several I values concurrently, e.g., the ILCC may contain the I-LVs:",
      "ja": "さらに、ホストは、同時にいくつかのI値を使用することができる、例えば、ILCCはI-LVを含んでいてもよいです。"
    },
    {
      "indent": 6,
      "text": "[I_1, L_1]                                       --- (15a)\n[I_1, L_2]                                       --- (15b)\n[I_2, L_2]                                       --- (15c)\n[I_3, L_1]                                       --- (15d)",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Architecturally, ILNP considers these all to be cases of multihoming: the host is connected to more than one subnetwork, each subnetwork being named by a different Locator value.",
      "ja": "ホストは、複数のサブネットワーク、異なるロケータ値によって命名されている各サブネットワークに接続されている：アーキテクチャ、ILNPは、これらすべてのマルチホーミングの例であると考えています。"
    },
    {
      "indent": 3,
      "text": "In the cases above, the selection of which I-LV to use would be through local policy or through management mechanisms. Additionally, suitably modified transport-layer protocols, such as multi-path transport-layer protocol implementations, may make use of multiple I-LVs. Note that in such a case, the way in which multiple I-LVs are used would be under the control of the higher-layer protocol.",
      "ja": "上記のケースでは、I-LVを使用するかの選択は、ローカルポリシーを介して、または管理メカニズムを介してであろう。また、このようなマルチパストランスポート層プロトコルの実装として適切に修正トランスポート層プロトコルは、複数のI-のLVを使用してもよいです。このような場合には、複数のI-のLVが使用される方法は、上位層プロトコルの制御下であろうことに留意されたいです。"
    },
    {
      "indent": 3,
      "text": "Recall, however, that L values also have preference -- LPI values -- and these LPI values can be used at the network layer, or by a transport-layer protocol implementation, in order make use of L values in a specific manner.",
      "ja": "LPI値 -   - リコールは、しかし、そのL値も嗜好を有し、これらLPI値が特異的にL値を利用するために、ネットワーク層において、またはトランスポート層プロトコルの実装で使用することができます。"
    },
    {
      "indent": 3,
      "text": "Note that, from a practical perspective, ILNP dynamically binds L values to interfaces on a node to indicate the SNPA for that L value, so the multihoming is very flexible: a node could have a single interface and have multiple L values bound to that interface. For example, for expressions (14a) and (14b), if the end-system has a single interface with local name eth0, then the entries in the ILCC will be:",
      "ja": "なお、実用的な観点から、ILNP動的そのL値に対してSNPAを示すノード上のインターフェイスにL値を結合するので、マルチホーミングは非常に柔軟である：ノードが単一のインタフェースを有し、そのインタフェースにバインドされた複数のL値を有することができます。エンドシステムがローカル名はeth0との単一のインタフェースを有する場合、例えば、式（14A）および（14B）、次いでILCCのエントリは次のようになります。"
    },
    {
      "indent": 6,
      "text": "L_1, eth0                                       --- (16a)\nL_2, eth0                                       --- (16b)",
      "raw": true
    },
    {
      "indent": 3,
      "text": "And, if we assume that for expressions (15a-c) the end-system has two interfaces, eth0 and eth1, then these ILCC entries are possible:",
      "ja": "式（15A-C）のためのエンドシステムは、2つのインターフェースは、eth0とeth1を有することと、我々は仮定した場合、これらのILCCエントリが可能です。"
    },
    {
      "indent": 6,
      "text": "L_1, eth0                                       --- (17a)\nL_2, eth1                                       --- (17b)",
      "raw": true
    },
    {
      "indent": 6,
      "text": "Let us consider the network in Figure 5.1.",
      "ja": "私たちは、図5.1のネットワークを考えてみましょう。"
    },
    {
      "indent": 9,
      "text": "   site                         . . . .\n  network                      .       .\n  . . . .      +------+ L_1   .         .\n .       .     |      +------.           .\n.         .    |      |      .           .\n.         .----+ SBR  |      . Internet  .\n.         .    |      |      .           .\n .  H    .     |      +------.           .\n  . . . .      +------+ L_2   .         .\n                               .       .\n                                . . . .",
      "raw": true
    },
    {
      "indent": 12,
      "text": "L_1 = global Locator value 1 L_2 = global Locator value 2 SBR = Site Border Router",
      "ja": "L_1 =グローバルロケータ値1 L_2 =グローバルロケータ値2 SBR =サイト境界ルータ"
    },
    {
      "indent": 8,
      "text": "Figure 5.1: A Simple Multihoming Scenario for ILNP",
      "ja": "図5.1：ILNPのためのシンプルなマルチホーミングシナリオ"
    },
    {
      "indent": 3,
      "text": "We assume that H has a single interface, eth0. SBR will advertise L_1 and L_2 internally to the site. Host H will configure these as both reachable via its single interface, eth0, by using ILCC entries as in expressions (16a) and (16b). When packets from H that are to egress the site network reach SBR, it can make appropriate decisions on which link to use based on the source Locator value (which has been inserted by H) or based on other local policy.",
      "ja": "私たちは、Hがeth0を、単一のインタフェースを持っていることを前提としています。 SBRは、サイトへの内部L_1とL_2をアドバタイズします。 Hは、式（16A）のようILCCエントリを使用することにより、その単一のインターフェース、eth0を介して両方の到達可能なように、これらを構成するホストおよび（16B）。出口へのサイトのネットワークであるHからのパケットは、SBRに達すると、それは（Hによって挿入された）ソース・ロケータ値に基づいて、または他のローカルポリシーに基づいて使用するリンクれた適切な判断を下すことができます。"
    },
    {
      "indent": 3,
      "text": "If, however, H has two interfaces, eth0 and eth1, then it can use ILCC entries as in expressions (17a) and (17b).",
      "ja": "ただし、Hは、2つのインターフェースは、eth0とeth1を有する場合、それは式（17A）のようILCCエントリを使用することができ、（17B）。"
    },
    {
      "indent": 3,
      "text": "Note that the values L_1 and L_2 do not need to be PI-based Locator values, and can be taken from ISP-specific PA routing prefix allocations from the upstream ISPs providing the two links.",
      "ja": "値L_1とL_2は、PIベースのロケータ値である必要はありませんし、2つのリンクを提供し、上流のISPからISP固有のPAのルーティングプレフィックスの割り当てから取られることに注意してください。"
    },
    {
      "indent": 3,
      "text": "Of course, this example is illustrative: many other configurations are also possible, but the fundamental mechanism remains the same, as described above.",
      "ja": "もちろん、この実施例は、例示である：他の多くの構成も可能であるが、上記のように基本的なメカニズムは、同じままです。"
    },
    {
      "indent": 3,
      "text": "If any Locator values change, then H will discover this when it sees new Locator values in RAs from SBR, and sees that L values that were previously used are no longer advertised. When this happens, H will:",
      "ja": "任意のロケータ値が変更された場合、その後、Hは、SBRからのRAにおける新しいロケータ値を見たとき、これを発見し、そして以前に使用されたL値は、もはや広告を出していることを見ないだろう。これが起こるとき、Hは以下となります。"
    },
    {
      "indent": 6,
      "text": "a) maintain existing active network-layer sessions: based on its current ILCC entries and active sessions, send Locator Update (LU) messages to CNs to notify them of the change of L values. (LU messages are synonymous to Mobile IPv6 Binding Updates.)",
      "ja": "a）は、既存のアクティブなネットワーク層セッションを維持する：現在のILCCエントリとアクティブなセッションに基づいて、L値の変化を通知するために、CNSへロケータ更新（LU）メッセージを送信します。 （LUメッセージは、モバイルIPv6のバインディングアップデートに同義です。）"
    },
    {
      "indent": 6,
      "text": "b) if required, update its relevant DNS entries with the new L value in the appropriate DNS records, to enable correct resolution for new incoming session requests.",
      "ja": "必要であればb）に、新しい着信セッション要求のための正しい解決を可能にするために、適切なDNSレコードの新しいL値との関連DNSエントリを更新。"
    },
    {
      "indent": 3,
      "text": "From an engineering viewpoint, H also updates its ILCC data, removing the old L value(s) and replacing with new L value(s) as required.",
      "ja": "工学的観点から、Hはまた、古いL値（複数可）を除去し、必要に応じて新たなL値（S）に置き換え、そのILCCデータを更新します。"
    },
    {
      "indent": 3,
      "text": "Depending on the nature of the physical change in connectivity that the L value change represents, this may disrupt upper-level protocols, e.g., a fibre cut. Dealing with such physical-level disruption is beyond the scope of ILNP. However, ILNP supports graceful changes in L values, and this is explained below in Section 6 in the discussion on mobility support.",
      "ja": "L値の変化が表す接続における物理的変化の性質に依存し、これは、例えば、ファイバ切断を上位レベルプロトコルを破壊することができます。そのような物理的なレベルの混乱に対処するILNPの範囲を超えています。しかし、ILNPはL値の優雅な変更をサポートしており、これは、モビリティサポートに関する議論に第6節で説明します。"
    },
    {
      "indent": 0,
      "text": "5.2. Support for Multi-Path Transport Protocols",
      "section_title": true,
      "ja": "5.2。マルチパストランスポートプロトコルのサポート"
    },
    {
      "indent": 3,
      "text": "ILNP supports deployment and use of multi-path transport protocols, such as the Multi-Path extensions to TCP (MP-TCP) being defined by the IETF TCPM Working Group. Specifically, ILNP will support the use of multiple paths as it allows a single I value to be bound to multiple L values -- see Section 5.1, specifically expressions (15a) and (15b).",
      "ja": "ILNPは、IETF TCPMワーキンググループによって定義されているTCP（MP-TCP）へのマルチパスの拡張機能としてマルチパストランスポートプロトコルの展開と使用をサポートしています。それは、複数のL値に結合される単一のI値を可能にするように、具体的に、ILNPは、複数のパスの使用をサポートします - セクション5.1、具体的には式（15A）及び（15B）を参照します。"
    },
    {
      "indent": 3,
      "text": "Of course, there will be specific mechanisms for: - congestion control - signalling for connection/session management - path discovery and path management - engineering and implementation issues",
      "ja": "輻輳制御 -   - 接続/セッション管理のためのシグナリング - パスの検出とパス管理 - エンジニアリングと実装の問題：もちろん、特定のためのメカニズムが存在します"
    },
    {
      "indent": 3,
      "text": "These transport-layer mechanisms fall outside the scope of ILNP and would be defined in the multi-path transport protocol specifications.",
      "ja": "これらのトランスポート層機構はILNPの範囲外とマルチパストランスポートプロトコル仕様で定義されます。"
    },
    {
      "indent": 3,
      "text": "As far as the ILNP architecture is concerned, the transport protocol connection is simply using multiple I-LVs, but with the same I value in each, and different L values, i.e., a multihomed host.",
      "ja": "限りILNPアーキテクチャに関しては、トランスポートプロトコル接続は、単純に複数のI-LVを使用するが、それぞれに同じI値、および異なるL値、すなわち、マルチホームホストとされています。"
    },
    {
      "indent": 0,
      "text": "5.3. Site Multihoming (S-MH)",
      "section_title": true,
      "ja": "5.3。サイトマルチホーミング（S-MH）"
    },
    {
      "indent": 3,
      "text": "At present, site multihoming is common in the deployed Internet. This is primarily achieved by advertising the site's routing prefix(es) to more than one upstream Internet service provider at a given time. In turn, this requires de-aggregation of routing prefixes within the inter-domain routing system. This increases the entropy of the inter-domain routing system (e.g., RIB/FIB size increases beyond the minimal RIB/FIB size that would be required to reach all sites).",
      "ja": "現時点では、サイトマルチホーミングが展開され、インターネットで一般的です。これは主に、与えられた時間に複数の上流のインターネットサービスプロバイダへのサイトのルーティング接頭語（es）を宣伝することによって達成されます。今度は、これは、ドメイン間ルーティングシステム内のプレフィクスのルーティングの脱凝集を必要とします。これは、ドメイン間ルーティングシステムのエントロピーを増大させる（例えば、すべてのサイトに到達するために必要とされる最小のRIB / FIBサイズを超えRIB / FIBサイズが大きくなります）。"
    },
    {
      "indent": 3,
      "text": "Site multihoming, in its simplest form in ILNP, is an extension of the H-MH scenario described in Section 5.1. If we consider Figure 5.1, and assume that there are many hosts in the site network, then each host can choose (a) whether or not to manage its own ILNP connectivity, and (b) whether or not to use multiple Locator values. This allows maximal control of connectivity for each host.",
      "ja": "サイトマルチホーミングは、ILNPにおけるその最も単純な形で、セクション5.1に記載のH-MHシナリオの拡張です。我々は図5.1を検討し、多くのホストは、サイトのネットワーク内に存在すると仮定した場合、各ホストは独自のILNPの接続を管理するかどうかを（A）を選択することができ、および（b）は、複数のロケータ値を使用するかどうか。これは、各ホストの接続の最大の制御が可能になります。"
    },
    {
      "indent": 3,
      "text": "Of course, with ILNPv6, just as any IPv6 router is required to generate IPv6 Router Advertisement messages with the correct routing prefix information for the link the RA is advertised upon, the SBR is also required to generate RAs containing the correct Locator value(s) for the link that the RA is advertised upon. The correct values for these RA messages are typically configured by system administration, or might be passed down from the upstream provider.",
      "ja": "もちろん、任意のIPv6ルータがRAの時に公示されたリンクの正しいルーティングプレフィックス情報でのIPv6ルータアドバタイズメントメッセージを生成するために必要とされるだけのようILNPv6、で、SBRはまた、正しいロケータ値（複数可）を含むRAのを発生することが要求されますRAは時に公示されたリンクのために。これらのRAメッセージの正しい値は、典型的には、システム管理者によって構成され、または上流プロバイダから渡されるかもしれません。"
    },
    {
      "indent": 3,
      "text": "To avoid a DNS Update burst when a site or (sub)network changes location, a DNS record optimisation is possible by using the new LP record for ILNP. This would change the number of DNS Updates required from Order(Number of nodes within the site/subnetwork that moved) to Order(1) [RFC6742].",
      "ja": "サイトまたは（サブ）ネットワークの場所を変更したときにDNSアップデートバーストを回避するために、DNSレコードの最適化がILNPのための新しいLPレコードを使用することにより可能です。これは、（1）[RFC6742]を注文する（移動サイト/サブネットワーク内のノードの数）注文から必要なDNSアップデートの数を変更します。"
    },
    {
      "indent": 0,
      "text": "5.3.1. A Common Multihoming Scenario - Multiple SBRs",
      "section_title": true,
      "ja": "5.3.1。一般的なマルチホーミングシナリオ - 複数のSBR"
    },
    {
      "indent": 3,
      "text": "The scenario of Figure 5.1 is an example to illustrate the architectural operation of multihoming for ILNP. For site multihoming, a scenario such as the one depicted in Figure 5.2 is also common. Here, there are two SBRs, each with its own global connectivity.",
      "ja": "図5.1のシナリオはILNPためマルチホーミングのアーキテクチャの動作を説明するための一例です。サイトマルチホーミングのために、例えば図5.2に示されたものとシナリオも一般的です。ここでは、2つのSBR、独自のグローバルな接続とそれぞれがあります。"
    },
    {
      "indent": 5,
      "text": "    site                          . . . .\n   network                       .       .\n   . . . .      +-------+ L_1   .         .\n  .       .     |       +------.           .\n .         .    |       |      .           .\n.           .---+ SBR_A |      .           .\n.           .   |       |      .           .\n.           .   |       |      .           .\n.           .   +-------+      .           .\n.           .       ^          .           .\n.           .       | CP       . Internet  .\n.           .       v          .           .\n.           .   +-------+ L_2  .           .\n.           .   |       +------.           .\n.           .   |       |      .           .\n.           .---+ SBR_B |      .           .\n .         .    |       |      .           .\n  .       .     |       |      .           .\n   . . . .      +-------+       .         .\n                                 .       .\n                                  . . . .",
      "raw": true
    },
    {
      "indent": 9,
      "text": "CP     = coordination protocol\nL_1    = global Locator value 1\nL_2    = global Locator value 2\nSBR_A  = Site Border Router A\nSBR_B  = Site Border Router B",
      "raw": true
    },
    {
      "indent": 5,
      "text": "Figure 5.2: A Dual-Router Multihoming Scenario for ILNP",
      "ja": "図5.2：ILNP用デュアルルータマルチホーミングシナリオ"
    },
    {
      "indent": 3,
      "text": "The use of two physical routers provides an extra level of resilience compared to the scenario of Figure 5.1. The coordination protocol (CP) between the two routers keeps their actions in synchronisation according to whatever management policy is in place for the site network. Such capabilities are available today in products. Note that, logically, there is little difference between Figures 5.1 and 5.2, but with two distinct routers in Figure 5.2, the interaction using CP is required. Of course, it is also possible to have multiple interfaces in each router and more than two routers.",
      "ja": "2つの物理的ルータの使用は、図5.1のシナリオに比べて弾力の余分なレベルを提供します。 2つのルータ間の協調プロトコル（CP）は、サイトのネットワークのための場所にあるものは何でも管理ポリシーに従って同期して、彼らの行動を続けています。このような機能は製品で、今日利用可能です。論理的に、図5.1と5.2の間にほとんど差があることに留意されたいが、図5.2に2つの異なるルータと、CPを用いた相互作用が必要です。もちろん、複数の各ルータのインターフェイスとつ以上のルータを有することも可能です。"
    },
    {
      "indent": 0,
      "text": "5.4. Multihoming Requirements for Site Border Routers",
      "section_title": true,
      "ja": "5.4。サイト境界ルータのためのマルチホーミングの要件"
    },
    {
      "indent": 3,
      "text": "For multihoming, the SBR does NOT need to be ILNP-capable for host multihoming or site multihoming. This is true provided the multihoming is left to individual hosts as described above. In this deployment approach, the SBR need only issue Routing Advertisements (RAs) that are correct with respect to its upstream connectivity; that is, the SBR properly advertises routing prefixes (Locator values) to the ILNP hosts.",
      "ja": "マルチホーミングのために、SBRは、ホストマルチホーミングやサイトマルチホーミング用ILNP対応する必要はありません。これは、上記のようにマルチホーミングは、個々のホストに残って設けられ真です。この展開アプローチでは、SBRは、その上流接続性に関して正しいルーティングアドバタイズメント（RAS）を発するだけでよいです。つまり、SBRは、適切ILNPホストへルーティングプレフィックス（ロケータ値）をアドバタイズ。"
    },
    {
      "indent": 3,
      "text": "In such a scenario, when hosts in the site network see new Locator values, and see that a previous Locator value is no longer being advertised, those hosts can update their ILCCs, send Locator Updates to CNs, and change connectivity as required.",
      "ja": "サイトのネットワーク内のホストが新しいロケータ値を参照し、前回のロケータ値がもはや宣伝されていることを見ていない時にこのようなシナリオでは、これらのホストは、彼らのILCCsを更新することができ、CNSへロケータアップデートを送信し、必要に応じて接続を変更します。"
    },
    {
      "indent": 0,
      "text": "6. Mobility",
      "section_title": true,
      "ja": "6.モビリティ"
    },
    {
      "indent": 3,
      "text": "ILNP supports mobility directly, rather than relying upon special-purpose mobility extensions as is the case with both IPv4 [RFC2002] (which was obsoleted by [RFC5944]) and IPv6 [RFC6275].",
      "ja": "ILNPむしろとIPv6 [RFC6275]（[RFC5944]によって廃止された）のIPv4 [RFC2002]の両方の場合のように専用のモビリティ拡張機能に頼るよりも、直接移動性をサポートします。"
    },
    {
      "indent": 3,
      "text": "There are two different mobility cases to consider:",
      "ja": "考慮すべき二つの異なるモビリティケースがあります。"
    },
    {
      "indent": 6,
      "text": "a) Host Mobility: individual hosts may be mobile, moving across administrative boundaries or topological boundaries within an IP-based network, or across the Internet. Such hosts would need to independently manage their own mobility.",
      "ja": "a）はホスト移動：個々のホストは、IPベースのネットワーク内で、またはインターネットを介して管理境界または位相的境界を越えて移動し、移動体であってもよいです。このようなホストは独立して、独自のモビリティを管理する必要があります。"
    },
    {
      "indent": 6,
      "text": "b) Network (Site) Mobility: a whole site, i.e., one or more IP subnetworks may be mobile, moving across administrative boundaries or topological boundaries within an IP-based network, or across the Internet. The site as a whole needs to maintain consistency in connectivity.",
      "ja": "B）ネットワーク（サイト）モビリティ：サイト全体、すなわち、1つまたは複数のIPサブネットワークは、IPベースのネットワーク内で、またはインターネットを介して管理境界または位相的境界を越えて移動し、移動体であってもよいです。全体としてこのサイトは、接続の一貫性を維持する必要があります。"
    },
    {
      "indent": 9,
      "text": "Essentially, for ILNP, mobility is implemented by enabling:",
      "ja": "基本的に、ILNPのために、移動度は、有効にすることによって実装されます。"
    },
    {
      "indent": 6,
      "text": "a) Locator values to be changed dynamically by a node, including for active network-layer sessions.",
      "ja": "A）ロケータ値は、アクティブネットワーク層セッションを含め、ノードによって動的に変更されます。"
    },
    {
      "indent": 6,
      "text": "b) use of Locator Updates to allow active network-layer sessions to be maintained.",
      "ja": "b）活性ネットワーク層セッションを維持することを可能にするロケータ更新の使用。"
    },
    {
      "indent": 6,
      "text": "c) for those hosts that expect incoming network-layer or transport-layer session requests (e.g., servers), updates to the relevant DNS entries for those hosts.",
      "ja": "C）それらのホストに関連するDNSエントリへの着信ネットワーク層またはトランスポート層セッション要求（例えば、サーバ）、更新を期待するそれらのホストのために。"
    },
    {
      "indent": 3,
      "text": "It is possible that a device is both a mobile host and part of a mobile network, e.g., a smartphone in a mobile site network. This is supported in ILNP as the mechanism for mobile hosts and mobile networks are very similar and work in harmony.",
      "ja": "デバイスがモバイルホストとモバイルネットワークの一部、例えば、モバイルサイトのネットワーク内のスマートフォンの両方であることが可能です。モバイルホストとモバイルネットワークのための機構は、調和が非常に類似し、作業しているので、これはILNPに支持されています。"
    },
    {
      "indent": 3,
      "text": "For mobility, there are two general features that must be supported:",
      "ja": "モビリティのために、サポートしなければならない2つの一般的な特徴があります。"
    },
    {
      "indent": 6,
      "text": "a) Handover (or Hand-off): when a host changes its connectivity (e.g., it has a new SNPA as it moves to a new ILNP subnetwork), any active network-layer sessions for that host must be maintained with minimal disruption (i.e., transparently) to the upper-layer protocols.",
      "ja": "a）はハンドオーバ（またはハンドオフ）：ホストはその接続性（例えばを変更した場合、それは新しいILNPサブネットワークに移動すると、それは）新しいSNPAを持って、そのホストのすべてのアクティブなネットワーク層のセッションは、最小限の中断（で維持しなければなりませんすなわち、透過的に）上位層プロトコルへ。"
    },
    {
      "indent": 6,
      "text": "b) Rendezvous: when a host that expects incoming network-layer or transport-layer session requests has new connectivity (e.g., it has a new SNPA as it moves to a new ILNP subnetwork), it needs to update its relevant DNS entries so that name resolution will provide the correct I and L values to remote nodes.",
      "ja": "b）のランデブー：着信ネットワーク層またはトランスポート層セッション要求を期待するホストは、新たな接続性（例えばを持っている場合、それは新しいILNPサブネットワークに移動すると、それは）新しいSNPAを持って、それはそのように、その関連するDNSエントリを更新する必要があります名前解決は、リモート・ノードへの正しいIとLの値を提供します。"
    },
    {
      "indent": 0,
      "text": "6.1. Mobility / Multihoming Duality in ILNP",
      "section_title": true,
      "ja": "6.1。 ILNPにおけるモビリティ/マルチホーミング双対性"
    },
    {
      "indent": 3,
      "text": "Mobility and multihoming present the same set of issues for ILNP. Indeed, mobility and multihoming form a duality: the set of Locators associated with a node or site changes. The reason for the change might be different for the case of mobility and multihoming, but the effects on the network-layer session state and on correspondents is identical.",
      "ja": "モビリティとマルチホーミングはILNPのための課題の同じセットを提示します。ノードまたはサイトの変更に関連したロケータのセット：確かに、モビリティとマルチホーミングは二重性を形成します。変更の理由は、モビリティとマルチホーミングの場合のために異なるかもしれませんが、ネットワーク層セッション状態にし、特派への影響は同じです。"
    },
    {
      "indent": 3,
      "text": "With ILNP, mobility and multihoming are supported using a common set of mechanisms. In both cases, different Locator values are used to identify different IP subnetworks. Also, ILNP nodes that expect incoming network-layer or transport-layer session requests are assumed to have a Fully Qualified Domain Name (FQDN) stored in the Domain Name System (DNS), as is already done within the deployed Internet. ILNP mobility normally relies upon the Secure Dynamic DNS Update standard for mobile nodes to update their location information in the DNS. This approach of using DNS for rendezvous with mobile systems was proposed earlier by others [PHG02].",
      "ja": "ILNPでは、モビリティとマルチホーミングは、メカニズムの共通セットを使用してサポートされています。両方の場合において、異なるロケータ値が異なるIPサブネットワークを識別するために使用されます。既に展開インターネット内で行われているように、また、着信ネットワーク層またはトランスポート層セッション要求を期待ILNPノードは、ドメインネームシステム（DNS）に格納された完全修飾ドメイン名（FQDN）を持つと仮定されます。 ILNP移動度は、通常、DNSに自分の位置情報を更新するために、モバイルノードのためのセキュリティで保護された動的DNSの更新標準に依存しています。モバイルシステムとのランデブーのためにDNSを使用するこのアプローチは、[PHG02】他者により以前に提案されました。"
    },
    {
      "indent": 3,
      "text": "Host Mobility considers individual hosts that are individually mobile -- for example, a mobile telephone carried by a person walking in a city. Network (Site) Mobility considers a group of hosts within a local topology that move jointly and periodically change their uplinks to the rest of the Internet -- for example, a ship that has wired connections internally but one or more wireless uplinks to the rest of the Internet.",
      "ja": "モビリティが個別に携帯している個々のホストを考慮したホスト - 例えば、街中を歩いて、人が携帯する携帯電話。例えば、の残りの部分に内部が、1つの以上の無線アップリンクの有線接続をしている船 - ネットワーク（サイト）モビリティは共同で移動し、定期的にインターネットの残りの部分に自分のアップリンクを変更するローカルトポロジ内のホストのグループを考慮しますインターネット。"
    },
    {
      "indent": 3,
      "text": "For ILNP, Host Mobility is analogous to host multihoming (H-MH) and Network Mobility is analogous to site multihoming (S-MH). So, mobility and multihoming capabilities can be used together, without conflict.",
      "ja": "ILNPのために、ホストモビリティはマルチホーミング（H-MH）をホスト類似しており、ネットワークモビリティはサイトマルチホーミング（S-MH）に類似しています。だから、モビリティとマルチホーミング機能が競合することなく、一緒に使用することができます。"
    },
    {
      "indent": 0,
      "text": "6.2. Host Mobility",
      "section_title": true,
      "ja": "6.2。ホスト移動"
    },
    {
      "indent": 3,
      "text": "With Host Mobility, each individual end-system manages its own connectivity through the use of Locator values. (This is very similar to the situation described for H-MH in Section 5.1.)",
      "ja": "ホスト移動では、個々のエンド・システムは、ロケータ値を使用して、独自の接続を管理します。 （これはセクション5.1でH-MHのために説明した状況と非常によく似ています。）"
    },
    {
      "indent": 3,
      "text": "Let us consider the network in Figure 6.1.",
      "ja": "私たちは、図6.1のネットワークを考えてみましょう。"
    },
    {
      "indent": 5,
      "text": "    site                          . . . .\n   network A                     .       .\n   . . . .      +-------+ L_A   .         .\n  .       .     |       +------.           .\n .         .    |       |      .           .\n.           .---+ SBR_A |      .           .\n.           .   |       |      .           .\n.  H(1)     .   |       |      .           .\n.           .   +-------+      .           .\n . . . . . .                   .           .\n  .  H(2) .                    . Internet  .\n . . . . . .                   .           .\n.           .   +-------+ L_B  .           .\n.  H(3)     .   |       +------.           .\n.           .   |       |      .           .\n.           .---+ SBR_B |      .           .\n .         .    |       |      .           .\n  .       .     |       |      .           .\n   . . . .      +-------+       .         .\n    site                         .       .\n   network B                      . . . .",
      "raw": true
    },
    {
      "indent": 9,
      "text": "H(X) = host H at position X\nL_A  = global Locator value A\nL_B  = global Locator value B\nSBR  = Site Border Router",
      "raw": true
    },
    {
      "indent": 5,
      "text": "Figure 6.1: A Simple Mobile Host Scenario for ILNP",
      "ja": "図6.1：ILNPのためのシンプルなモバイルホストのシナリオ"
    },
    {
      "indent": 3,
      "text": "A host H is at position (1), hence H(1) in a site network A. This site network might be, for example, a single radio cell under administrative domain A. We assume that the host will move into site network B, which might be a single radio cell under administrative domain B. We also assume that the site networks have a region of overlap so that connectivity can be maintained; else, of course, the host will lose connectivity. Also, let us assume that the host already has ILNP connectivity in site network A.",
      "ja": "ホストHは、位置（1）、したがってH（1）サイトのネットワークAにこのサイトのネットワークがあるかもしれない、例えば、単一の無線セルの管理ドメインAの下で私たちは、ホストサイトのネットワークBに移動すると仮定します、我々はまた、接続性を維持できるように、サイトのネットワークが重複領域を持っていることを前提とした管理ドメインBの下で単一の無線セルであるかもしれません。他に、当然のことながら、ホストが接続を失います。また、私たちはホストがすでにサイトのネットワークAにILNPの接続性を持っていると仮定しましょう"
    },
    {
      "indent": 3,
      "text": "If site network A has connectivity via Locator value L_A, and H uses Identifier value I_H with a single interface ra0, then the host's ILCC will contain:",
      "ja": "サイトのネットワークAがロケータ値L_Aを経由して接続していて、Hは、単一のインタフェースRA0と識別子値I_Hを使用する場合、ホストのILCCが含まれています："
    },
    {
      "indent": 6,
      "text": "[I_H, L_A]                                           --- (18a)\nL_A, ra0                                             --- (18b)",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Note the equivalence of expressions (18a) and (18b), respectively, with the expressions (15a) and (16a) for host multihoming.",
      "ja": "式の等価（18A）とを注（18B）がそれぞれ、ホスト・マルチホーミングのための式（15A）及び（16A）を有します。"
    },
    {
      "indent": 3,
      "text": "The host now moves into the overlap region of site networks A and B, and has position (2), hence H(2) as indicated in Figure 6.1. As this region is now in site network B, as well as site network A, H should see RAs from SBR_B for L_B, as well as the RAs for L_A from SBR_A. The host can now start to use L_B for its connectivity. The host H must now:",
      "ja": "ホストは現在のサイトのネットワークAおよびBの重複領域に移動し、位置（2）を有し、したがってH（2）図6.1に示すように。この領域は、サイトネットワークB、ならびにサイトネットワークAに今あるように、HはL_BためSBR_BからのRAを参照、ならびにSBR_AからL_AためのRAべきです。ホストは現在、その接続にL_Bの使用を開始することができます。ホストHは現在、次の条件を満たす必要があります。"
    },
    {
      "indent": 6,
      "text": "a) maintain existing active upper-layer sessions: based on its current ILCC entries and active sessions, send Locator Update (LU) messages to CNs to notify them of the change of L values. (LU messages are synonymous to Mobile IPv6 Binding Updates.)",
      "ja": "a）活性上層セッションを既存の更新：現在のILCCエントリとアクティブなセッションに基づいて、L値の変化を通知するために、CNSへロケータ更新（LU）メッセージを送信します。 （LUメッセージは、モバイルIPv6のバインディングアップデートに同義です。）"
    },
    {
      "indent": 6,
      "text": "b) if required, update its relevant DNS entries with the new L value in the appropriate DNS records, to enable correct resolution for new incoming network-layer or transport-layer session requests.",
      "ja": "必要であれば、B）、新たな着信ネットワーク層またはトランスポート層セッション要求の正しい解像度を可能にするために、適切なDNSレコードに新たなL値とその関連するDNSエントリを更新します。"
    },
    {
      "indent": 9,
      "text": "However, it can opt to do this one of two ways:",
      "ja": "しかし、それは2つの方法のこのいずれかを実行することを選ぶことができます。"
    },
    {
      "indent": 6,
      "text": "1) immediate handover: the host sends Locator Update (LU) messages to CNs, immediately stops using L_A, and switches to using L_B only. In this case, its ILCC entries change to:",
      "ja": "1）即時ハンドオーバ：ホストはすぐにL_Aを使用して停止し、CNSへのロケータアップデート（LU）メッセージを送信し、のみL_Bを使用するように切り替わります。この場合、そのILCCエントリは次のように変更します。"
    },
    {
      "indent": 9,
      "text": "[I_H, L_B]                                        --- (19a)\nL_B, ra0                                          --- (19b)",
      "raw": true
    },
    {
      "indent": 9,
      "text": "There might be packets in flight to H that use L_A, and H MAY choose to ignore these on reception.",
      "ja": "そこL_Aを使用するHへの飛行中のパケットであるかもしれない、とHは、受信時にこれらを無視することを選ぶかもしれません。"
    },
    {
      "indent": 6,
      "text": "2) soft handover: the host sends Locator Update (LU) messages to CNS, but it uses both L_A and L_B until (i) it no longer receives incoming packets with destination Locator values set to L_A within a given time period and (ii) it no longer sees RAs for L_A (i.e., it has left the overlap region and so has left site network A). In this case, its ILCC entries change to:",
      "ja": "2）ソフトハンドオーバ：ホストは、CNSにロケータ更新（LU）メッセージを送信し、それは、もはや所定の時間期間内L_Aに設定された宛先ロケータ値で着信パケットを受信すると、（ii）上記（i）まで、L_AとL_Bの両方を使用しませんそれはもはや（すなわち、それはオーバーラップ領域を残しているので、サイトのネットワークAを残している）L_AのためのRAを見ません。この場合、そのILCCエントリは次のように変更します。"
    },
    {
      "indent": 9,
      "text": "[I_H, L_A]                                        --- (20a)\nL_A, ra0                                          --- (20b)\n[I_H, L_B]                                        --- (20c)\nL_B, ra0                                          --- (20d)",
      "raw": true
    },
    {
      "indent": 3,
      "text": "ILNP does not mandate the use of one handover option over another. Indeed, a host may implement both and decide, through local policy or other mechanisms (e.g., under the control of a particular transport protocol implementation), to use one or other for a specific transport-layer session, as required.",
      "ja": "ILNPは別の上の1つのハンドオーバオプションの使用を強制しません。実際には、ホストは、両方を実装してもよいし、必要に応じて、特定のトランスポート層セッションのための1つまたは他を使用する、ローカルポリシーまたは他のメカニズム（例えば、特定のトランスポートプロトコルの実装の制御下）を介して、決定します。"
    },
    {
      "indent": 3,
      "text": "Note that if using soft handover, when in the overlap region, the host is multihomed. Also, soft handover is likely to provide a less disruptive handover (e.g., lower packet loss) compared to immediate handover, all other things being equal.",
      "ja": "ときにオーバーラップ領域において、ソフトハンドオーバーを使用している場合、ホストがマルチホームであることに留意されたいです。また、ソフトハンドオーバは、他のすべてのものが等しい場合、即時のハンドオーバに比べてより少ない破壊ハンドオーバ（例えば、より低いパケット損失）を提供する可能性があります。"
    },
    {
      "indent": 3,
      "text": "There is a case where both the host and its correspondent node are mobile. In the unlikely event of simultaneous motion that changes both nodes' Locators within a very small time period, there is the possibility that communication may be lost. If the communication between the nodes was direct (i.e., one node initiated communication with another, through a DNS lookup), a node can use the DNS to discover the new Locator value(s) for the other node. If the communication was through some sort of middlebox providing a relay service, then communication is more likely to disrupted only if the middlebox is also mobile.",
      "ja": "ホストとそのコレスポンデントノードの両方が携帯している場合があります。非常に短い時間期間内の両方のノードのロケータを変更同時運動の万一、通信が失われる可能性があります。ノード間の通信は、直接であった場合（すなわち、一方のノードがDNSルックアップを介して、相互に通信を開始し）、ノードは他のノードのための新しいロケータ値（単数または複数）を発見するためにDNSを使用することができます。通信は、リレーサービスを提供するミドルのいくつかの並べ替えを介していた場合、その通信はミドルでもモバイルである場合にのみ中断する可能性が高いです。"
    },
    {
      "indent": 3,
      "text": "It is also possible that high packet loss results in Locator Updates being lost, which could disrupt handover. However, this is an engineering issue and does not impact the basic concept of operation; additional discussion on this issue is provided in [RFC6741].",
      "ja": "ロケータのアップデートで高いパケット損失の結果がハンドオーバを混乱させる可能性がある、失われていることも可能です。しかし、これは技術の問題であり、操作の基本的な考え方に影響を与えません。この問題に関する追加的な議論は[RFC6741]で提供されています。"
    },
    {
      "indent": 3,
      "text": "Of course, for any handover, the new end-to-end path through SBR_B might have very different end-to-end path characteristics (e.g., different end-to-end delay, packet loss, throughput). Also, the physical connectivity on interface ra0 as well as through SBR_B's uplink may be different. Such impacts on end-to-end packet transfer are outside the scope of ILNP.",
      "ja": "もちろん、任意のハンドオーバーのため、SBR_B介して新たなエンドツーエンドのパスは非常に異なるエンドツーエンドパス特性（例えば、異なるエンドツーエンド遅延、パケット損失、スループット）を有するかもしれません。また、インタフェースRA0にならびにSBR_Bのアップリンクを介して物理的な接続は異なっていてもよいです。エンドツーエンドのパケット転送に対するこのような影響はILNPの範囲外です。"
    },
    {
      "indent": 0,
      "text": "6.3. Network Mobility",
      "section_title": true,
      "ja": "6.3。ネットワークモビリティ"
    },
    {
      "indent": 3,
      "text": "For network mobility, a whole site may be mobile, e.g., the SBRs of Figure 6.1 have a radio uplink on a moving vehicle. Within the site, individual hosts may or may not be mobile.",
      "ja": "ネットワークモビリティのために、サイト全体がモバイルであってもよく、例えば、図6.1のSBRは、移動車両の無線アップリンクを持っています。サイト内では、個々のホストは、モバイルであってもなくてもよいです。"
    },
    {
      "indent": 3,
      "text": "In the simplest case, ILNP deals with mobile networks in the same way as for site multihoming: the management of mobility is delegated to each host in the site, so it needs to be ILNP-capable. Each host, effectively, behaves as if it were a mobile host, even though it may not actually be mobile. Indeed, in this way, the mechanism is very similar to that for site multihoming. Let us consider the mobile network in Figure 6.2.",
      "ja": "最も単純なケースでは、サイトマルチホーミングの場合と同じ方法で、モバイルネットワークとILNPお得な情報は：モビリティの管理は、サイト内の各ホストに委任されているので、それはILNP対応する必要があります。それはモバイルホストであるかのように、各ホストには、効果的に、それは実際に携帯できない場合でも、動作します。確かに、このように、メカニズムは、サイトマルチホーミングのためのものと非常に似ています。私たちは、図6.2にモバイルネットワークを考えてみましょう。"
    },
    {
      "indent": 6,
      "text": "   site                        ISP_1\n  network        SBR           . . .\n  . . . .      +------+ L_1   .     .\n .       .     |   ra1+------.       .\n.         .----+      |      .       .\n .  H    .     |   ra2+--    .       .\n  . . . .      +------+       .     .\n                               . . .\nFigure 6.2a: ILNP Mobile Network before Handover",
      "raw": true
    },
    {
      "indent": 6,
      "text": "   site                        ISP_1\n  network        SBR           . . .\n  . . . .      +------+ L_1   .     .\n .       .     |   ra1+------. . . . .\n.         .----+      |      .       .\n .  H    .     |   ra2+------.       .\n  . . . .      +------+ L_2  . . . . .\n                              .     .\n                               . . .\n                               ISP_2\n Figure 6.2b: ILNP Mobile Network during Handover",
      "raw": true
    },
    {
      "indent": 6,
      "text": "   site                        ISP_2\n  network        SBR           . . .\n  . . . .      +------+       .     .\n .       .     |   ra1+--    .       .\n.         .----+      |      .       .\n .  H    .     |   ra2+------.       .\n  . . . .      +------+       .     .\n                               . . .\n Figure 6.2c: ILNP Mobile Network after Handover",
      "raw": true
    },
    {
      "indent": 9,
      "text": " H = host L_1 = global Locator value 1 L_2 = global Locator value 2 SBR = Site Border Router",
      "ja": "H =ホストL_1 =グローバルロケータ値1 L_2 =グローバルロケータ値2 SBR =サイト境界ルータ"
    },
    {
      "indent": 5,
      "text": "Figure 6.2: A Simple Mobile Network Scenario for ILNP",
      "ja": "図6.2：ILNPのためのシンプルなモバイルネットワークのシナリオ"
    },
    {
      "indent": 3,
      "text": "In Figure 6.2, we assume that the site network is mobile, and the SBR has two radio interfaces ra1 and ra2. However, this particular figure is chosen for simplicity and clarity for our scenario, and other configurations are possible, e.g., a single radio interface which uses separate radio channels (separate carriers, coding channels, etc.). In the figure, ISP_1 and ISP_2 are separate, radio-based service providers, accessible via ra1 and ra2.",
      "ja": "図6.2において、我々は、サイトのネットワークがモバイルであると仮定し、SBRは、2つの無線インタフェースのRA1とRA2を有しています。しかし、この特定の図は、このシナリオのために、平易かつ明快にするために選択され、その他の構成は、例えば、別個の無線チャネル（別のキャリア、コードチャネル、など）を使用する単一の無線インタフェースを可能です。図では、ISP_1とISP_2は、別のラジオ・ベースのサービス・プロバイダ、RA1とRA2を介してアクセス可能です。"
    },
    {
      "indent": 3,
      "text": "In Figure 6.2a, the SBR has connectivity via ISP_1 using Locator value L_1. The host H, with interface ra0 and Identifier I_H, has an established connectivity via the SBR and so has ILCC entries as shown in (21):",
      "ja": "図6.2Aで、SBRは、ロケータ値L_1を用いISP_1介して接続性を有しています。ホストHは、インターフェースRA0と識別子I_Hと、SBRを介して確立された接続性を有しており、（21）に示すようにILCCエントリを有します。"
    },
    {
      "indent": 6,
      "text": "[I_H, L_1]                                           --- (21a)\nL_1, ra0                                             --- (21b)",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Note the equivalence to expressions (18a) and (18b). As the whole network moves, the SBR detects a new radio provider, ISP_2, and connects to it using ra2, as shown in Figure 6.2b, with the service areas of ISP_1 and ISP_2 overlapping. ISP_2 provides Locator L_2, which the SBR advertises into the site network along with L_1. As with the mobile host scenario above, individual hosts may decide to perform immediate handover or soft handover. So, the ILCC state for H will be as for expressions (19a) and (19b) and (20a)-(20d), but with L_1 in place of L_A, and L_2 in place of L_B. Finally, as in Figure 6.2c, the site network moves and is no longer served by ISP_1, and handover is complete. Note that during the handover the site is multihomed, as in Figure 6.2b.",
      "ja": "式の等価性を注（18A）及び（18B）。ネットワーク全体が移動するように、SBRは、新しい無線プロバイダー、ISP_2を検出し、図6.2-2に示すようにISP_1とISP_2重複のサービスエリアで、RA2を使用してそれに接続します。 ISP_2は、SBRはL_1と一緒にサイトのネットワークにアドバタイズロケータL_2を提供します。上記移動ホストのシナリオと同様に、個々のホストは、即時ハンドオーバまたはソフトハンドオーバーを遂行することを決定することができます。だから、HのためのILCC状態は、式（19A）及び（19B）および（20A）のためのようになります - （20D）が、L_Aの代わりにL_1、およびL_2とL_Bの代わりインチ最後に、図6.2c、サイトのネットワークに移動すると、もはやISP_1によって提供され、ハンドオーバが完了しているのように。図6.2-2のように、ハンドオーバー時にサイトがマルチホームであることに注意してください。"
    },
    {
      "indent": 0,
      "text": "6.4. Mobility Requirements for Site Border Routers",
      "section_title": true,
      "ja": "6.4。サイト境界ルータのためのモビリティの要件"
    },
    {
      "indent": 3,
      "text": "As for multihoming, the SBR does NOT need to be ILNP-capable: it simply needs to advertise the available routing prefixes into the site network. The mobility capability is handled completely by the hosts.",
      "ja": "マルチホーミングについては、SBRはILNP対応する必要はありません：それは単にサイトのネットワークに利用可能なルーティングプレフィックスを通知する必要があります。モビリティ機能はホストによって完全に処理されます。"
    },
    {
      "indent": 0,
      "text": "6.5. Mobility with Multiple SBRs",
      "section_title": true,
      "ja": "6.5。複数のSBRとモビリティ"
    },
    {
      "indent": 3,
      "text": "Just as Section 5.3.1 describes the use of multiple routers for multihoming, so it is possible to have multiple routers for mobility for ILNP, for both mobile hosts and mobile networks.",
      "ja": "5.3.1項には、マルチホーミングのための複数のルータの使用が記載されているので、モバイルホストとモバイルネットワークの両方のために、ILNPのモビリティのために複数のルータを持つことが可能であるように。"
    },
    {
      "indent": 0,
      "text": "7. IP Security for ILNP",
      "section_title": true,
      "ja": "ILNP 7. IPセキュリティ"
    },
    {
      "indent": 3,
      "text": "IP Security for ILNP [RFC6741] becomes simpler, in principle, than IPsec as it is today, based on the use of IP Addresses as Identifiers.",
      "ja": "ILNPのためのIPセキュリティ[RFC6741]は、それが識別子としてIPアドレスの使用に基づいて、今日のようにIPsecよりも、原則的に、簡単になります。"
    },
    {
      "indent": 3,
      "text": "An operational issue in the deployed IP Internet is that the IPsec protocols, AH and ESP, have Security Associations (IPsec SAs) that include the IP Addresses of the secure IPsec session endpoints. This was understood to be a problem when AH and ESP were originally defined in [RFC1825], [RFC1826], and [RFC1827] (which were obsoleted by [RFC4301], [RFC4302], and [RFC4303]). However, the limited set of namespaces in the Internet Architecture did not provide any better choices at that time. ILNP provides more namespaces, thus now enabling better IPsec architecture and engineering.",
      "ja": "展開IPインターネットでの運用の問題は、IPsecプロトコル、AHとESPは、セキュアなIPSecセッションのエンドポイントのIPアドレスが含まれるセキュリティアソシエーション（IPsecのSA）を有していることです。これは、（[RFC4301]、[RFC4302]及び[RFC4303]によって廃止された）AHとESPが元々[RFC1825]で定義された問題は、[RFC1826]及び[RFC1827]であることが分かりました。しかし、インターネットアーキテクチャにおける名前空間の限られたセットは、その時に任意のより良い選択肢を提供していませんでした。 ILNPは、このように今より良いのIPsecアーキテクチャとエンジニアリングを有効にする、より多くの名前空間を提供します。"
    },
    {
      "indent": 0,
      "text": "7.1. Adapting IP Security for ILNP",
      "section_title": true,
      "ja": "7.1。 ILNPのためのIPセキュリティの適合"
    },
    {
      "indent": 3,
      "text": "In essence, ILNP provides a very simple architectural change to IPsec: in place of IP Addresses as used today for IPsec SAs, ILNP uses Node Identifier values instead. Recall that Identifier values are immutable once in use, so they can be used to maintain end-to-end state for any protocol that requires it. Note from the discussion above that the Identifier values for a host remain unchanged when multihoming and mobility are in use, so IPsec using ILNP can work in harmony with multihoming and mobility [ABH08b] [ABH09a].",
      "ja": "本質的には、ILNPはIPsecのに非常に単純なアーキテクチャの変更提供：IPアドレスの代わりに、IPsecのSAのために今日使用されるように、ILNPではなく、ノード識別子の値を使用しています。彼らはそれを必要とする任意のプロトコルのためのエンドツーエンドの状態を維持するために使用できるように識別子の値は、一度使用に不変であることを思い出してください。 IPsecの使用ILNPはマルチホーミングとモビリティ[ABH08b] [ABH09a]と調和して働くことができるように、マルチホーミング及びモビリティときホストの識別子の値が使用されている不変のままであることが上記の議論から注意。"
    },
    {
      "indent": 3,
      "text": "To resolve the issue of IPsec interoperability through a Network Address Translator (NAT) deployment [RFC1631] [RFC3022], UDP encapsulation of IPsec [RFC3948] is commonly used as of the date this document was published. This special-case handling for IPsec traffic traversing a NAT is not needed with ILNP IPsec.",
      "ja": "ネットワークアドレス変換（NAT）の展開[RFC1631] [RFC3022]、IPsecの[RFC3948]のUDPカプセル化を通じてのIPsecの相互運用性の問題を解決するには、一般的に、この文書が公開された日付の時点で使用されています。この特殊なケースはILNPのIPsecで必要とされていないNATを通過するIPSecトラフィックのために処理します。"
    },
    {
      "indent": 3,
      "text": "Further, it would obviate the need for specialised IPsec NAT traversal mechanisms, thus simplifying IPsec implementations while enhancing deployability and interoperability [RFC3948].",
      "ja": "また、展開性と相互運用性を高めつつIPsec実装を簡素化する、[RFC3948]を専門のIPsec NATトラバーサルメカニズムの必要性をなくすことになります。"
    },
    {
      "indent": 3,
      "text": "This architectural change does not reduce the security provided by the IPsec protocols. In fact, had the Node Identifier namespace existed back in the early 1990s, IPsec would always have bound to that location-independent Node Identifier and would not have bound to IP Addresses.",
      "ja": "このアーキテクチャの変更は、IPsecプロトコルによって提供されるセキュリティを低下させません。実際には、IPsecは常にその場所に依存しないノード識別子にバインドされているだろうし、IPアドレスにバインドされていないと、ノード識別子の名前空間が戻って1990年代初頭に存在していました。"
    },
    {
      "indent": 0,
      "text": "7.2. Operational Use of IP Security with ILNP",
      "section_title": true,
      "ja": "7.2。 ILNPとIPセキュリティの運用使用"
    },
    {
      "indent": 3,
      "text": "Operationally, this change in SA bindings to use Identifiers rather than IP Addresses causes problems for the use of the IPsec protocols through IP Network Address Translation (NAT) devices, with mobile nodes (because the mobile node's IP Address changes at each network-layer handoff), and with multihomed nodes (because the network-layer IPsec session is bound to a particular interface of the multihomed node, rather than being bound to the node itself) [RFC3027] [RFC3715].",
      "ja": "操作上、SAバインディングのこの変化は、IPアドレスは、（モバイルノードと、IPネットワークアドレス変換（NAT）デバイスを介して、IPsecプロトコルを使用するための問題を引き起こすのではなく識別子を使用するため、各ネットワーク層ハンドオフでモバイルノードのIPアドレスの変更ネットワーク層のIPsecセッションがマルチホームノードの特定のインターフェイスにバインドされているため）、およびマルチホームノードと（いうよりは、ノード自体）[RFC3027]、[RFC3715]に結合されます。"
    },
    {
      "indent": 0,
      "text": "8. Backwards Compatibility and Incremental Deployment",
      "section_title": true,
      "ja": "8.後方互換性および増分の展開"
    },
    {
      "indent": 3,
      "text": "ILNPv6 is fully backwards compatible with existing IPv6. No router software or silicon changes are necessary to support the proposed enhancements. An IPv6 router would be unaware whether the packet being forwarded were classic IPv6 or the proposed enhancement in ILNPv6. IPv6 Neighbour Discovery will work unchanged for ILNPv6. ILNPv6 multicasting is the same as IETF standards-track IPv6 multicasting.",
      "ja": "ILNPv6は、既存のIPv6に完全な下位互換性があります。いいえルータソフトウェアまたはシリコンの変更が提案されている拡張機能をサポートする必要はありません。 IPv6ルータは、転送されるパケットは、古典的なIPv6のかILNPv6で提案された改善したかどうかを気づかないだろう。 IPv6の近隣探索はILNPv6のためにそのまま動作します。 ILNPv6マルチキャストはIETF標準トラックのIPv6マルチキャストと同じです。"
    },
    {
      "indent": 3,
      "text": "ILNPv4 is backwards compatible with existing IPv4. As the IPv4 address fields are used as 32-bit Locators, using only the address prefix bits of the 32-bit space, IPv4 routers also would not require changes. An IPv4 router would be unaware whether the packet being forwarded were classic IPv4 or the proposed enhancement in ILNPv4 [RFC6746]. ARP [RFC826] requires enhancements to support ILNPv4 [RFC6747] [RFC6741]. ILNPv4 multicasting is the same as IETF standards-track IPv4 multicasting.",
      "ja": "ILNPv4は、既存のIPv4と下位互換性があります。 IPv4アドレスフィールドは、32ビットの空間のアドレスのみプレフィックスビットを使用して、32ビットのロケータとして使用されるように、IPv4ルーターはまた、変更を必要としません。 IPv4ルータは転送されるパケットが、古典的なIPv4またはILNPv4 [RFC6746]で提案された拡張したかどうか気づかないであろう。 ARPは、[RFC826] ILNPv4 [RFC6747] [RFC6741]をサポートするための拡張機能を必要とします。 ILNPv4マルチキャストはIETF標準トラックのIPv4マルチキャストと同じです。"
    },
    {
      "indent": 3,
      "text": "If a node supports ILNP and intends to receive incoming network-layer or transport-layer sessions, the node's Fully Qualified Domain Name (FQDN) normally will have one or more NID records and one or more Locator (i.e., L32, L64, and/or LP) records associated with the node within the DNS [RFC6741] [RFC6742].",
      "ja": "ノードがILNPをサポートし、着信ネットワーク層またはトランスポート層セッションを受けようとする場合は、ノードの完全修飾ドメイン名（FQDN）は、通常、1つまたは複数のNIDレコードと1つまたは複数のロケータを持つことになります（つまり、L32、L64、および/ DNS [RFC6741]、[RFC6742]内のノードに関連付けられた、またはLP）レコード。"
    },
    {
      "indent": 3,
      "text": "When an IP host (\"initiator\") initiates a new network-layer session with a correspondent (\"responder\"), it normally will perform a DNS lookup to determine the address(es) of the responder. An ILNP host normally will look for Node Identifier (\"NID\") and Locator (i.e., L32, L64, and LP) records in any received DNS replies. DNS servers that support NID and Locator (i.e., L32, L64, and LP) records SHOULD include them (when they exist) as additional data in all DNS replies to queries for DNS AAAA records [RFC6742].",
      "ja": "IPホスト（「イニシエータ」）は特派（「応答者」）を使用して新しいネットワーク層セッションを開始すると、それは通常、応答者のアドレスを決定するためにDNSルックアップを実行します。 ILNPホストは、通常ノード識別子（「NID」）とロケータを検索します（すなわち、L32、L64、およびLP）任意のレコードは、DNS応答を受信しました。 （存在する場合）は、すべてのDNS内に追加データがDNS AAAAレコード[RFC6742]のためのクエリに応答としてそれらを含むべきNIDロケータ（即ち、L32、L64、およびLP）レコードをサポートするDNSサーバー。"
    },
    {
      "indent": 3,
      "text": "If the initiator supports ILNP, and from DNS information learns that the responder also supports ILNP, then the initiator will generate an unpredictable ILNP Nonce value, cache that value locally as part of the network-layer ILNP session, and will include the ILNP Nonce value in its initial packet(s) to the responder [RFC6741] [RFC6744] [RFC6746].",
      "ja": "イニシエータはILNPをサポートしており、DNS情報から応答もILNPをサポートしていることを学習した場合、イニシエータは、予測不可能なILNPノンス値、ネットワーク層ILNPセッションの一部として局所的価値キャッシュが生成され、そしてILNPノンス値を含むであろうレスポンダ[RFC6741]、[RFC6744]、[RFC6746]に初期パケット（単数または複数）です。"
    },
    {
      "indent": 3,
      "text": "If the initiator node does not find any ILNP-specific DNS resource records for the responder node, then the initiator uses classic IP for the new network-layer session with the responder, rather than trying to use ILNP for that network-layer session. Of course, multiple transport-layer sessions can concurrently share a single network-layer (e.g., IP or ILNP) session.",
      "ja": "イニシエータノードが応答ノードのための任意のILNP固有のDNSリソースレコードが見つからない場合には、イニシエータは、むしろそのネットワーク層セッションにILNPを使用しようとするよりも、応答者との新しいネットワーク層セッションのための古典的なIPを使用しています。もちろん、複数のトランスポート層セッションは、同時に単一のネットワーク層（例えば、IP又はILNP）セッションを共有することができます。"
    },
    {
      "indent": 3,
      "text": "If the responder node for a new network-layer session does not support ILNP and the responder node receives initial packet(s) containing the ILNP Nonce, then the responder will drop the packet and send an ICMP error message back to the initiator. If the responder node for a new network-layer session supports ILNP and receives initial packet(s) containing the ILNP Nonce, the responder learns that ILNP is in use for that network-layer session (i.e., by the presence of that ILNP Nonce).",
      "ja": "新しいネットワーク層セッションのためのレスポンダノードはILNPをサポートしていないとレスポンダノードはILNP nonceを含む最初のパケット（単数または複数）を受信した場合、次いでレスポンダはパケットをドロップし、バックイニシエータにICMPエラーメッセージを送信します。新しいネットワーク層セッションのためのレスポンダノードはILNPをサポートしILNP nonceを含む最初のパケット（単数または複数）を受信した場合、応答者はILNP（すなわち、そのILNPノンスの存在により）、そのネットワーク層セッションのために使用されていることを知ります。"
    },
    {
      "indent": 3,
      "text": "If the initiator node using ILNP does not receive a response from the responder in a timely manner (e.g., within TCP timeout for a TCP session) and also does not receive an ICMP Unreachable error message for that packet, OR if the initiator receives an ICMP Parameter Problem error message for that packet, then the initiator concludes that the responder does not support ILNP. In this case, the initiator node SHOULD try again to create the new network-layer session, but this time using IP (and therefore omitting the ILNP Nonce).",
      "ja": "ILNPを使用してイニシエータノードは、（TCPセッションのためのTCPのタイムアウト内に、例えば）タイムリーに応答者からの応答を受信しないと、またそのパケットのICMP到達不能エラーメッセージが表示され、またはイニシエータは、ICMPを受信した場合しない場合そのパケットのパラメータ問題エラーメッセージが、その後、イニシエータはレスポンダがILNPをサポートしていないと結論付けます。この場合には、イニシエータノードは、新しいネットワーク層セッションを作成するために、再度試みるべきであるが、今回は、IPを使用して（したがってILNP nonceを省略します）。"
    },
    {
      "indent": 3,
      "text": "Finally, since an ILNP node also is a fully capable IP node, the upgraded node can use any standardised IP mechanisms for communicating with a legacy IP-only node. So, ILNP will not be worse than existing IP, but when ILNP is used, the enhanced capabilities described in these ILNP documents will be available.",
      "ja": "ILNPノードも十分可能なIPノードであるので、最終的に、アップグレードされたノードは、レガシーIPのみのノードと通信するための任意の標準化されたIPメカニズムを使用することができます。だから、ILNPは、既存のIPよりも悪いことではないだろうが、ILNPを使用する場合、これらのILNP文書に記述拡張機能が利用できるようになります。"
    },
    {
      "indent": 0,
      "text": "9. Security Considerations",
      "section_title": true,
      "ja": "9.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "This proposal outlines a proposed evolution for the Internet Architecture to provide improved capabilities. This section discusses security considerations for this proposal.",
      "ja": "この提案は、改善された機能を提供するために、インターネットアーキテクチャの提案進化を概説します。このセクションでは、この提案のためのセキュリティの考慮事項について説明します。"
    },
    {
      "indent": 3,
      "text": "Note that ILNP provides security equivalent to IP for similar threats when similar mitigations (e.g., IPsec or not) are in use. In some cases, but not all, ILNP exceeds that objective and has lower security risk than IP. Additional engineering details for several of these topics can be found in [RFC6741].",
      "ja": "ILNPは同様の緩和策（例えば、IPSecまたはしない）が使用されている場合にも同様の脅威のためにIPに同等セキュリティを提供することに留意されたいです。いくつかのケースでは、すべてではないが、ILNPは、その目的を超え、IPよりも低いセキュリティ上のリスクがあります。これらのトピックのいくつかのための追加の技術の詳細は、[RFC6741]で見つけることができます。"
    },
    {
      "indent": 0,
      "text": "9.1. Authentication of Locator Updates",
      "section_title": true,
      "ja": "9.1。ロケータアップデートの認証"
    },
    {
      "indent": 3,
      "text": "All Locator Update messages are authenticated. ILNP requires use of an ILNP session nonce [RFC6744] [RFC6746] to prevent off-path attacks, and also allows use of IPsec cryptography to provide stronger protection where required.",
      "ja": "すべてのロケータの更新メッセージが認証されます。 ILNPオフパス攻撃を防ぐためにILNPセッションナンス[RFC6744]、[RFC6746]の使用を必要とし、また、必要な強力な保護を提供するためのIPsec暗号化の使用を可能にします。"
    },
    {
      "indent": 3,
      "text": "Ordinary network-layer sessions based on IP are vulnerable to on-path attacks unless IPsec is used. So the Nonce Destination Option only seeks to provide protection against off-path attacks on an ILNP-based network-layer session -- equivalent to ordinary IP-based network-layer sessions that are not using IPsec.",
      "ja": "IPsecが使用されていない限り、IPに基づいて、通常のネットワーク層のセッションは、上のパスの攻撃に対して脆弱です。 IPsecを使用していない通常のIPベースのネットワーク層のセッションに相当 - だから、ナンス先オプションのみILNPベースのネットワーク層セッション上のオフ・パス攻撃に対する保護を提供することを目的とします。"
    },
    {
      "indent": 3,
      "text": "It is common to have non-symmetric paths between two nodes on the Internet. To reduce the number of on-path nodes that know the Nonce value for a given session when ILNP is in use, a nonce value is unidirectional, not bidirectional. For example, for a network-layer ILNP-based session between nodes A and B, one nonce value is used from A to B and a different nonce value is used from B to A.",
      "ja": "インターネット上の2つのノード間の非対称パスを持っているのが一般的です。 ILNPが使用されている特定のセッションのためにノンス値を知る上でパスのノードの数を減らすために、ナンス値は、双方向、一方向ではありません。例えば、ノードAとBとの間のネットワーク層ILNPベースのセッションのために、1つのノンス値からBに使用され、異なるノンス値をBからAに使用されます"
    },
    {
      "indent": 3,
      "text": "ILNP sessions operating in higher risk environments SHOULD also use the cryptographic authentication provided by IPsec *in addition* to concurrent use of the ILNP Nonce.",
      "ja": "リスクの高い環境で動作ILNPセッションもILNPナンスの同時使用に*ほかのIPsec *が提供する暗号化認証を使用する必要があります。"
    },
    {
      "indent": 3,
      "text": "It is important to note that, at present, a network-layer IP-based session is entirely vulnerable to on-path attacks unless IPsec is in use for that particular IP session, so the security properties of the new proposal are never worse than for existing IP.",
      "ja": "現時点では、それを注意することが重要である、IPsecはその特定のIPセッションのために使用されている場合を除き、ネットワーク層IPベースのセッションは、上のパス攻撃を完全に脆弱であるので、新しい提案のセキュリティ特性はよりも決して悪いです既存のIP。"
    },
    {
      "indent": 0,
      "text": "9.2. Forged Identifier Attacks",
      "section_title": true,
      "ja": "9.2。鍛造識別子攻撃"
    },
    {
      "indent": 3,
      "text": "In the deployed Internet, active attacks using packets with a forged Source IP Address have been publicly known at least since early 1995 [CA-1995-01]. While these exist in the deployed Internet, they have not been widespread. This is equivalent to the issue of a forged Identifier value and demonstrates that this is not a new threat created by ILNP.",
      "ja": "展開され、インターネットでは、偽造送​​信元IPアドレスを持つパケットを使用して、アクティブな攻撃は公に少なくとも初期の1995 [CA-1995から1901]から知られています。これらが展開され、インターネットに存在するが、それらは普及していませんでした。これは、偽造識別子の値の問題と等価であり、これはILNPによって作成された新しい脅威ではないことを示しています。"
    },
    {
      "indent": 3,
      "text": "One mitigation for these attacks has been to deploy Source IP Address filtering [RFC2827] [RFC3704]. Jun Bi at Tsinghua University cites Arbor Networks as reporting that this mechanism has less than 50% deployment and cites an MIT analysis indicating that at least 25% of the deployed Internet permits forged Source IP Addresses.",
      "ja": "これらの攻撃のための一つの緩和は、送信元IPアドレスフィルタリング[RFC2827] [RFC3704]を展開してきました。清華大学の6月のBiは、このメカニズムが50％未満の展開を持ち、展開インターネット許可の少なくとも25％が、送信元IPアドレスを偽造したことを示すMITの分析を引用していることを報告するようアーバーネットワークを挙げています。"
    },
    {
      "indent": 3,
      "text": "In [RFC6741], there is a discussion of an accidental use of a duplicate Identifier on the Internet. However, this sub-section instead focuses on methods for mitigating attacks based on packets containing deliberately forged Source Identifier values.",
      "ja": "[RFC6741]に、インターネット上の重複識別子の偶発的使用の議論があります。しかしながら、このサブセクションではなく、意図的に偽造ソース識別子値を含むパケットに基づいて攻撃を軽減するための方法に焦点を当てています。"
    },
    {
      "indent": 3,
      "text": "Firstly, the recommendations of [RFC2827] and [RFC3704] remain. So, any packets that have a forged Locator value can be easily filtered using existing widely available mechanisms.",
      "ja": "まず、[RFC2827]及び[RFC3704]の推奨事項が残ります。だから、鍛造ロケータ値を持つすべてのパケットを容易に既存の広く利用可能なメカニズムを使用して濾過することができます。"
    },
    {
      "indent": 3,
      "text": "Secondly, the receiving node does not blindly accept any packet with the proper Source Identifier and proper Destination Identifier as an authentic packet. Instead, each ILNP node maintains an ILNP Communication Cache (ILCC) for each of its correspondents, as described in [RFC6741]. Information in the cache is used in validating received messages and preventing off-path attackers from succeeding. This process is discussed more in [RFC6741].",
      "ja": "第二に、受信ノードは、盲目的に適切なソース識別子と本物のパケットとして適切な宛先識別子を持つすべてのパケットを受け付けません。 [RFC6741]に記載されているように代わり、各ILNPノードは、その特派のそれぞれについてILNP通信キャッシュ（ILCC）を維持します。キャッシュ内の情報は、受信したメッセージを検証して、後続のオフパス攻撃を防ぐのに使用されています。このプロセスは、より多くの[RFC6741]に記載されています。"
    },
    {
      "indent": 3,
      "text": "Thirdly, any node can distinguish different nodes using the same Identifier value by other properties of their ILNP sessions. For example, IPv6 Neighbor Discovery prevents more than one node from using the same source I-LV at the same time on the same link [RFC4861]. So, cases of different nodes using the same Identifier value will involve nodes that have different sets of valid Locator values. A node thus can demultiplex based on the combination of Source Locator and Source Identifier if necessary. If IPsec is in use, the combination of the Source Identifier and the Security Parameter Index (SPI) value would be sufficient to demux two different ILNP sessions.",
      "ja": "第三に、任意のノードは、それらのILNPセッションの他の特性により、同じ識別子の値を使用して、異なるノードを識別することができます。例えば、IPv6の近隣探索は、同じリンク[RFC4861]で同時に同じソースI-LVを使用することから複数のノードを防止します。だから、同じ識別子の値を使用して異なるノードの場合は、有効なロケータ値の異なるセットを持っているノードを伴います。必要であれば、ノードは、このようにソースロケータとソース識別子の組合せに基づいて逆多重化することができます。 IPsecが使用されている場合は、ソース識別子およびセキュリティパラメータインデックス（SPI）値の組み合わせは、二つの異なるILNPセッションをデマルチプレクサするのに十分であろう。"
    },
    {
      "indent": 3,
      "text": "Fourthly, deployments in high-threat environments also SHOULD use IPsec to authenticate control traffic and data traffic. Because IPsec for ILNP binds only to the Identifier values, and never to the Locator values, a mobile or multihomed node can use IPsec even when its Locator value(s) have just changed.",
      "ja": "第四に、高脅威環境での展開は、制御トラフィックとデータトラフィックを認証するためにIPsecを使用すべきです。 ILNPのためのIPsecが唯一の識別子値に、そして決してロケータ値に結合しているため、携帯電話やマルチホームノードは、そのロケータ値（s）は単に変更した場合でも、IPsecを使用することができます。"
    },
    {
      "indent": 3,
      "text": "Lastly, note well that ordinary IPv4, ordinary IPv6, Mobile IPv4, and also Mobile IPv6 already are vulnerable to forged Identifier and/or forged IP Address attacks. An attacker on the same link as the intended victim simply forges the victims MAC address and the victim's IP Address. With IPv6, when Secure Neighbour Discovery (SEND) and Cryptographically Generated Addresses (CGAs) are in use, the victim node can defend its use of its IPv6 address using SEND. With ILNP, when SEND and CGAs are in use, the victim node also can defend its use of its IPv6 address using SEND. There are no standard mechanisms to authenticate ARP messages, so IPv4 is especially vulnerable to this sort of attack. These attacks also work against Mobile IPv4 and Mobile IPv6. In fact, when either form of Mobile IP is in use, there are additional risks, because the attacks work not only when the attacker has access to the victim's current IP subnetwork but also when the attacker has access to the victim's home IP subnetwork. Thus, the risks of using ILNP are not greater than exist today with IP or Mobile IP.",
      "ja": "最後に、すでに鍛造識別子および/または偽造IPアドレスの攻撃に対して脆弱である通常のIPv4、IPv6の通常、モバイルIPv4、また、モバイルIPv6ことにも注意してください。意図した被害者と同じリンク上の攻撃者は、単に被害者のMACアドレスと被害者のIPアドレスを偽造します。セキュア近隣探索（SEND）と暗号化生成アドレス（CGAs）が使用されている場合IPv6で、犠牲者ノードは、SEND使用してIPv6アドレスの使用を守ることができます。 SENDとCGAsが使用されている場合ILNPでは、被害者のノードにもSENDを使用して、IPv6アドレスの使用を守ることができます。そこARPメッセージを認証するための標準的なメカニズムはありませんので、IPv4がこの種の攻撃に対して特に脆弱です。これらの攻撃はまた、モバイルIPv4およびモバイルIPv6に対して動作します。いずれかのモバイルIPの形式が使用されているときに攻撃は、攻撃者が被害者の現在のIPサブネットワークへのアクセス権を持っているだけでなく、攻撃者は被害者の自宅のIPサブネットワークへのアクセスを持っている場合ではないときにのみ動作するため、実際には、、、その他のリスクがあります。したがって、ILNPを使用することのリスクは、IPまたはモバイルIPで、今日存在よりも大きくありません。"
    },
    {
      "indent": 0,
      "text": "9.3. IP Security Enhancements",
      "section_title": true,
      "ja": "9.3。 IPセキュリティ強化"
    },
    {
      "indent": 3,
      "text": "The IPsec standards are enhanced here by binding IPsec Security Associations (SAs) to the Node Identifiers of the endpoints, rather than binding IPsec SAs to the IP Addresses of the endpoints as at present. This change enhances the deployability and interoperability of the IPsec standards, but does not decrease the security provided by those protocols. See Section 7 for a more detailed explanation.",
      "ja": "IPsecの規格は、エンドポイントのノード識別子にIPsecセキュリティアソシエーション（SA）を結合ではなく、現時点でのように、エンドポイントのIPアドレスへのIPsec SAを結合することによって、ここで強化されています。この変更は、IPSec標準の展開性と相互運用性を向上させますが、それらのプロトコルによって提供されるセキュリティを低下させません。より詳細な説明については、セクション7を参照してください。"
    },
    {
      "indent": 0,
      "text": "9.4. DNS Security",
      "section_title": true,
      "ja": "9.4。 DNSセキュリティ"
    },
    {
      "indent": 3,
      "text": "The DNS enhancements proposed here are entirely compatible with, and can be protected using, the existing IETF standards for DNS Security [RFC4033]. The Secure DNS Dynamic Update mechanism used here is also used unchanged [RFC3007]. So, ILNP does not change the security properties of the DNS or of DNS servers.",
      "ja": "ここで提案されているDNSの拡張機能は、DNSセキュリティ[RFC4033]のための既存のIETF標準と完全に互換性があり、かつ使用して保護することができます。ここで使用されるセキュアなDNS動的更新メカニズムも変わらない[RFC3007]を使用しています。だから、ILNPは、DNSのか、DNSサーバのセキュリティプロパティを変更しません。"
    },
    {
      "indent": 0,
      "text": "9.5. Firewall Considerations",
      "section_title": true,
      "ja": "9.5。ファイアウォールに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "In the proposed new scheme, stateful firewalls are able to authenticate ILNP-specific control messages arriving on the external interface. This enables more thoughtful handling of ICMP messages by firewalls than is commonly the case at present. As the firewall is along the path between the communicating nodes, the firewall can snoop on the ILNP Nonce being carried in the initial packets of an ILNP session. The firewall can verify the correct ILNP Nonce is present on incoming control packets, dropping any control packets that lack the correct nonce value.",
      "ja": "提案された新しい方式では、ステートフルファイアウォールは、外部インターフェイスに到着ILNP固有の制御メッセージを認証することができます。これは、一般的に、現時点での場合よりも、ファイアウォールによってICMPメッセージのより多くの思いやりの取り扱いを可能にします。ファイアウォールは、通信ノード間の経路に沿っているように、ILNPノンスをスヌーピングすることができるファイアウォールはILNPセッションの最初のパケットで運ばれます。ファイアウォールは正しいILNP nonceを確認することができ、正しいノンス値を欠いている任意の制御パケットをドロップし、着信制御パケットに存在しています。"
    },
    {
      "indent": 3,
      "text": "By always including the ILNP Nonce in ILNP-specific control messages, even when IPsec is also in use, the firewall can filter out off-path attacks against those ILNP messages without needing to perform computationally expensive IPsec processing. In any event, a forged packet from an on-path attacker will still be detected when the IPsec input processing occurs in the receiving node; this will cause that forged packet to be dropped rather than acted upon.",
      "ja": "常にILNP固有の制御メッセージにILNP nonceを含めることにより、IPsecを使用しても場合でも、ファイアウォールは、計算コストの高いIPsec処理を実行するために必要とせずに、これらのILNPメッセージに対してオフパス攻撃をフィルタリングすることができます。 IPsecの入力処理は、受信ノードで発生したときにいずれにせよ、上の経路の攻撃者から偽造パケットがまだ検出されます。これは、偽造パケットはドロップではなく、作用させることになります。"
    },
    {
      "indent": 0,
      "text": "9.6. Neighbour Discovery Authentication",
      "section_title": true,
      "ja": "9.6。近隣探索認証"
    },
    {
      "indent": 3,
      "text": "Nothing in this proposal prevents sites from using the Secure Neighbour Discovery (SEND) proposal for authenticating IPv6 Neighbour Discovery with ILNPv6 [RFC3971].",
      "ja": "この提案では何もILNPv6 [RFC3971]でのIPv6近隣探索を認証するためのセキュア近隣探索（SEND）の提案を使用してからサイトを妨げるものはありません。"
    },
    {
      "indent": 0,
      "text": "9.7. Site Topology Obfuscation",
      "section_title": true,
      "ja": "9.7。サイトトポロジ難読化"
    },
    {
      "indent": 3,
      "text": "A site that wishes to obscure its internal topology information MAY do so by deploying site border routers that rewrite the Locator values for the site as packets enter or leave the site. This operational scenario was presented in [ABH09a] and is discussed in more detail in [RFC6748].",
      "ja": "その内部のトポロジ情報を不明瞭にしたいサイトは、パケットが入力したり、サイトを離れるとサイトのロケータ値を書き換えるサイト境界ルータを導入することによってそれを行うことができます。この動作シナリオは、[ABH09a]に提示して、[RFC6748]で詳しく説明されています。"
    },
    {
      "indent": 3,
      "text": "For example, a site might choose to use a ULA prefix internally for this reason [RFC4193] [ID-ULA]. In this case, the site border routers would rewrite the Source Locator of ILNP packets leaving the site to a global-scope Locator associated with the site. Also, those site border routers would rewrite the Destination Locator of packets entering the site from the global-scope Locator to an appropriate interior ULA Locator for the destination node [ABH08b] [ABH09a] [RFC6748].",
      "ja": "たとえば、サイトには、このような理由[RFC4193] [ID-ULA]のために内部ULAプリフィックスを使用することを選択するかもしれません。この場合、サイトの境界ルータは、サイトに関連付けられたグローバルスコープロケータにサイトを残しILNPパケットの送信元ロケータを書き換えます。また、これらのサイトの境界ルータは、宛先ノード[ABH08b] [ABH09a] [RFC6748]のために適切な内部ULAロケータにグローバルスコープロケータからサイトに入るパケットの宛先ロケータを書き換えることになります。"
    },
    {
      "indent": 0,
      "text": "10. Privacy Considerations",
      "section_title": true,
      "ja": "10.プライバシーに関する注意事項"
    },
    {
      "indent": 3,
      "text": "ILNP has support for both:",
      "ja": "ILNPは、両方をサポートしています："
    },
    {
      "indent": 3,
      "text": "- Location Privacy: to hide a node's topological location by obfuscating the ILNP Locator information. (See also Section 7 of [RFC6748].)",
      "ja": " - ロケーションプライバシー：ILNPロケータ情報を難読化することにより、ノードの位相的な位置を非表示にします。 （また、[RFC6748]のセクション7を参照）。"
    },
    {
      "indent": 3,
      "text": "- Identity Privacy: to hide a node's identity by allowing the use of Node Identifier values that are not tied to the node in some permanent or semi-permanent manner. (See also Section 11 of [RFC6741].)",
      "ja": " - アイデンティティプライバシー：いくつかの永続的または半恒久的にノードに結合されていないノード識別子値の使用を可能にすることにより、ノードの身元を隠すために。 （また、[RFC6741]のセクション11を参照）。"
    },
    {
      "indent": 3,
      "text": "A more detailed exposition of the possibilities is given in [BAK11].",
      "ja": "可能性のより詳細な博覧会は、[BAK11]で与えられます。"
    },
    {
      "indent": 0,
      "text": "10.1. Location Privacy",
      "section_title": true,
      "ja": "10.1。所在地プライバシー"
    },
    {
      "indent": 3,
      "text": "Some users have concerns about the issue of \"location privacy\", whereby the user's location might be determined by others. The term \"location privacy\" does not have a crisp definition within the Internet community at present. Some mean the location of a node relative to the Internet's routing topology, while others mean the geographic coordinates of the node (i.e., latitude X, longitude Y). The concern seems to focus on Internet-enabled devices, most commonly handheld devices such as a smartphone, that might have 1:1 mappings with individual users.",
      "ja": "一部のユーザーは、ユーザーの場所が他の人によって決定されるかもしれないことにより、「ロケーションプライバシー」の問題、不安があります。用語「ロケーションプライバシーは、」現時点では、インターネットコミュニティ内で鮮明な定義はありません。いくつかは、他のノードの地理的座標を意味している間（即ち、緯度X、経度Y）をインターネットのルーティングトポロジへのノードの相対的な位置を意味します。個々のユーザーで1マッピング：懸念は1を持っているかもしれない、そのようなスマートフォンなどのインターネット対応デバイス、最も一般的なハンドヘルドデバイス、に焦点を当てているようです。"
    },
    {
      "indent": 3,
      "text": "There is a fundamental trade-off here. Quality of a node's Internet connectivity tends to be inversely proportional to the \"location privacy\" of that node. For example, if a node were to use a router with NAT as a privacy proxy, routing all traffic to and from the",
      "ja": "ここでは基本的なトレードオフがあります。ノードのインターネット接続の品質は、そのノードの「ロケーション・プライバシー」に反比例する傾向があります。たとえば、ノードがにしてからのすべてのトラフィックをルーティング、プライバシーのプロキシとしてNATとルータを使用した場合"
    },
    {
      "indent": 3,
      "text": "Internet via that proxy, then (a) latency will increase as the distance increases between the node seeking privacy and its proxy, and (b) communications with the node seeking privacy will be more vulnerable to communication faults -- both due to the proxy itself (which might fail) and due to the longer path (which has more points of potential failure than a more direct path would have).",
      "ja": "そのプロキシを介してインターネットは、次いで、（a）は、待ち時間がプライバシーを求めるノードとプロキシとの間の距離が増加するにつれて増加する、及び（b）はプライバシーを求めて、ノードとの通信は、通信障害に対してより脆弱になり - プロキシ自体に起因両方（これは失敗することがあります）とより長いパス（より直接的なパスより潜在的な障害のより多くのポイントを持っている必要があります）へ。"
    },
    {
      "indent": 3,
      "text": "Any Internet node that wishes for other Internet nodes to be able to initiate transport-layer or network-layer sessions with it needs to include associated address (e.g., A, AAAA) or Locator (e.g., L32, L64, LP) records in the publicly accessible Domain Name System (DNS). Information placed in the DNS is publicly accessible. Since the goal of DNS is to distribute information to other Internet nodes, it does not provide mechanisms for selective privacy. Of course, a node that does not wish to be contacted need not be present in the DNS.",
      "ja": "それに関連するアドレス（例えば、A、AAAA）またはロケータ（例えば、L32、L64、LP）レコードを含める必要があると他のインターネットノードに対して希望する任意のインターネットノードは、トランスポート層またはネットワーク層セッションを開始することができるように公的にアクセス可能なドメインネームシステム（DNS）。 DNSに配置された情報は、公的にアクセス可能です。 DNSの目標は、他のインターネットノードに情報を配布することであるから、それは選択的プライバシーのためのメカニズムを提供していません。もちろん、連絡されることを望んでいないノードは、DNSに存在する必要はありません。"
    },
    {
      "indent": 3,
      "text": "In some cases, various parties have attempted to create mappings between IP Address blocks and geographic locations. The quality of such mappings appears to vary [GUF07]. Many such mapping efforts are driven themselves by efforts to comply with legal requirements in various legal jurisdictions. For example, some content providers reportedly have licenses authorising distribution of content in one set of locations, but not in a different set of locations.",
      "ja": "いくつかのケースでは、様々な関係者はIPアドレスブロックと地理的位置との間のマッピングを作成しようとしました。このようなマッピングの品質は[GUF07]変化するように表示されます。多くのこのようなマッピングの努力は、様々な法的管轄区域における法的要件を遵守するための努力によって自分自身を駆動しています。例えば、一部のコンテンツプロバイダは、伝えられる場所の1セットではなく、場所の異なるセットにコンテンツの配信を許可するライセンスを持っています。"
    },
    {
      "indent": 3,
      "text": "ILNP does not compromise user location privacy any more than base IPv6. In fact, by its nature ILNP provides additional choices to the user to protect their location privacy.",
      "ja": "ILNPは、IPv6をベースよりも、それ以上のユーザーの場所のプライバシーを侵害しません。実際には、その性質によってILNPは、その場所のプライバシーを保護するために、ユーザーに追加の選択肢を提供します。"
    },
    {
      "indent": 0,
      "text": "10.2. Identity Privacy",
      "section_title": true,
      "ja": "10.2。アイデンティティプライバシー"
    },
    {
      "indent": 3,
      "text": "Both ILNP and IPv6 permit use of identifier values generated using the IPv6 Privacy Address extension [RFC4941]. ILNP and IPv6 also support a node having multiple unicast addresses/locators at the same time, which facilitates changing the node's addresses/locators over time. IPv4 does not have any non-topological identifiers, and many IPv4 nodes only support one IPv4 unicast address per interface, so IPv4 is not directly comparable with IPv6 or ILNP.",
      "ja": "IPv6のプライバシーアドレス拡張[RFC4941]を使用して生成された識別子値のILNPとIPv6の両方の許可使用。 ILNPとIPv6はまた、経時的にノードのアドレス/ロケータを変更容易に同時に複数のユニキャストアドレス/ロケータを有するノードをサポートします。 IPv4のは、任意の非トポロジーの識別子を持っていない、多くのIPv4のみインターフェイスごとに1つのIPv4ユニキャストアドレスをサポートしているノード、これはIPv4がIPv6又はILNPと直接比較はありません。"
    },
    {
      "indent": 3,
      "text": "In normal operation with IPv4, IPv6, or ILNP, a mobile node might intend to be accessible for new connection attempts from the global Internet and also might wish to have both optimal routing and maximal Internet availability, both for sent and received packets. In that case, the node will want to have its addressing or location information kept in the DNS and made available to others.",
      "ja": "IPv4の、IPv6の、またはILNPと通常の操作では、モバイルノードは、グローバルなインターネットからの新しい接続試行のためにアクセスできるようにするつもりかもしれないし、また、両方の送信および受信されたパケットに対して、最適なルーティングおよび最大のインターネットの可用性の両方を持つことを望むかもしれません。その場合には、ノードは、そのアドレッシングや位置情報がDNSに保存し、他の人が利用できるようにしたいでしょう。"
    },
    {
      "indent": 3,
      "text": "In some cases, a mobile node might only desire to initiate network-layer or transport-layer sessions with other Internet nodes, and thus not desire to be a responder, in which case that node need not be present in the DNS. Some potential correspondent nodes might, as a matter of local security policy, decline to communicate with nodes that do not have suitable DNS records present in the DNS. For example, some deployed IPv4-capable mail relays refuse to communicate with an initiating node that lacks an appropriate PTR record in the DNS.",
      "ja": "いくつかの場合において、モバイルノードは、他のインターネットノードとネットワーク層またはトランスポート層セッションを開始することを望むので、そのノードがDNSに存在する必要はなく、その場合には応答であることを望むかもしれません。いくつかの潜在的な通信員ノードは、ローカルセキュリティポリシーの問題として、DNSに存在し、適切なDNSレコードを持たないノードと通信するために断るかもしれません。例えば、いくつかの展開IPv4対応のメールリレーはDNSで適切なPTRレコードを欠く開始ノードと通信することを拒否する。"
    },
    {
      "indent": 3,
      "text": "In some cases (for example, intermittent electronic mail access or browsing specific web pages), support for long-lived network sessions (i.e., where network-layer session lifetime is longer than the time the node remains on the same subnetwork) is not required. In those cases, support for node mobility (i.e., network-layer session continuity even when the SNPA changes) is not required and need not be used.",
      "ja": "場合によっては（例えば、断続的な電子メールアクセスまたは特定のウェブページを閲覧する）、（すなわち、ネットワーク層セッション寿命が長く、ノードが同じサブネットワーク上に残っている時間よりもされる）必要とされていない長寿命のネットワークセッションのサポート。これらの場合に、ノードの移動性のサポート（すなわち、SNPA変化があっても、ネットワーク層のセッション継続性）必要とされず、使用される必要はありません。"
    },
    {
      "indent": 3,
      "text": "If an ILNP node that is mobile chooses not to use DNS for rendezvous, yet desires to permit any node on the global Internet to initiate communications with that node, then that node may fall back to using Mobile IPv4 or Mobile IPv6 instead.",
      "ja": "モバイルは、ランデブーにDNSを使用しないことを選択しているILNPノードが、まだそのノードとの通信を開始するために、グローバルインターネット上の任意のノードを許可したい場合、そのノードは、代わりにモバイルIPv4又はモバイルIPv6を使用してフォールバックすることができます。"
    },
    {
      "indent": 3,
      "text": "Many residential broadband Internet users are subject to involuntary renumbering, usually when their ISP's DHCP server(s) deny a DHCP RENEW request and instead issue different IP addressing information to the residential user's device(s). In many cases, such users want their home server(s) or client(s) to be externally reachable. Such users today often use Secure DNS Dynamic Update to update their addressing or location information in the DNS entries, for the devices they wish to make reachable from the global Internet [RFC2136] [RFC3007] [LA2006]. This option exists for those users, whether they use IPv4, IPv6, or ILNP. Users also have the option not to use such mechanisms.",
      "ja": "多くの家庭用ブロードバンドインターネットユーザーは自分のISPのDHCPサーバー（s）はDHCP要求を更新し、代わりに、住宅のユーザのデバイス（複数可）に異なるIPアドレス情報を発行拒否するとき、通常は、不随意リナンバリングの対象となっています。多くの場合、そのようなユーザーが自分のホームサーバー（複数可）またはクライアント（s）は外部から到達可能になりたいです。このようなユーザーが、今日は多くの場合、彼らはグローバルなインターネット[RFC2136] [RFC3007] [LA2006]から到達可能にしたいデバイスのため、DNSエントリに自分のアドレス指定や場所の情報を更新するために、セキュアなDNS動的更新を使用します。このオプションは、彼らがIPv4、IPv6の、またはILNPを使用するかどうか、それらのユーザーのために存在します。また、ユーザーは、このようなメカニズムを使用しないオプションがあります。"
    },
    {
      "indent": 0,
      "text": "11. References",
      "section_title": true,
      "ja": "11.参考文献"
    },
    {
      "indent": 0,
      "text": "11.1. Normative References",
      "section_title": true,
      "ja": "11.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC768] Postel, J., \"User Datagram Protocol\", STD 6, RFC 768, August 1980.",
      "ja": "[RFC768]ポステル、J.、 \"ユーザ・データグラム・プロトコル\"、STD 6、RFC 768、1980年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC791] Postel, J., \"Internet Protocol\", STD 5, RFC 791, September 1981.",
      "ja": "[RFC791]ポステル、J.、 \"インターネットプロトコル\"、STD 5、RFC 791、1981年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC793] Postel, J., \"Transmission Control Protocol\", STD 7, RFC 793, September 1981.",
      "ja": "[RFC793]ポステル、J.、 \"伝送制御プロトコル\"、STD 7、RFC 793、1981年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC826] Plummer, D., \"Ethernet Address Resolution Protocol: Or Converting Network Protocol Addresses to 48.bit Ethernet Address for Transmission on Ethernet Hardware\", STD 37, RFC 826, November 1982.",
      "ja": "[RFC826]プラマー、D.、：、STD 37、RFC 826、1982年11月「イーサネットアドレス解決プロトコルやネットワーク・プロトコルを変換するには、イーサネットハードウェア上での伝送のためのイーサネットアドレスを48ビットにIPアドレス」。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2460] Deering, S. and R. Hinden, \"Internet Protocol, Version 6 (IPv6) Specification\", RFC 2460, December 1998.",
      "ja": "[RFC2460]デアリング、S.とR. Hindenと、 \"インターネットプロトコルバージョン6（IPv6）の仕様\"、RFC 2460、1998年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC3007] Wellington, B., \"Secure Domain Name System (DNS) Dynamic Update\", RFC 3007, November 2000.",
      "ja": "[RFC3007]ウェリントン、B.、RFC 3007、2000年11月 \"ドメインネームシステム（DNS）動的更新をセキュア\"。"
    },
    {
      "indent": 3,
      "text": "[RFC4033] Arends, R., Austein, R., Larson, M., Massey, D., and S. Rose, \"DNS Security Introduction and Requirements\", RFC 4033, March 2005.",
      "ja": "[RFC4033]アレンズ、R.、Austeinと、R.、ラーソン、M.、マッシー、D.、およびS.ローズ、 \"DNSセキュリティ序論と要件\"、RFC 4033、2005年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC4861] Narten, T., Nordmark, E., Simpson, W., and H. Soliman, \"Neighbor Discovery for IP version 6 (IPv6)\", RFC 4861, September 2007.",
      "ja": "[RFC4861] Narten氏、T.、Nordmarkと、E.、シンプソン、W.、およびH.ソリマン、 \"IPバージョン6（IPv6）のための近隣探索\"、RFC 4861、2007年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC6724] Thaler, D., Ed., Draves, R., Matsumoto, A., and T. Chown, \"Default Address Selection for Internet Protocol Version 6 (IPv6)\", RFC 6724, September 2012.",
      "ja": "[RFC6724]ターラー、D.、エド。、Draves、R.、松本、A.、およびT. CHOWN、 \"インターネットプロトコルバージョン6（IPv6）のためのデフォルトのアドレス選択\"、RFC 6724、2012年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC6741] Atkinson, R. and S. Bhatti, \"Identifier-Locator Network Protocol (ILNP) Engineering and Implementation Considerations\", RFC 6741, November 2012.",
      "ja": "[RFC6741]アトキンソン、R.とS. Bhattiさん、 \"識別子ロケータネットワークプロトコル（ILNP）エンジニアリングと実装に関する考慮事項\"、RFC 6741、2012年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC6742] Atkinson, R., Bhatti, S., and S. Rose, \"DNS Resource Records for the Identifier-Locator Network Protocol (ILNP)\", RFC 6742, November 2012.",
      "ja": "[RFC6742]アトキンソン、R.、Bhattiさん、S.、およびS.ローズ、 \"識別子ロケータネットワークプロトコル（ILNP）のためのDNSリソースレコード\"、RFC 6742、2012年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC6743] Atkinson, R. and S. Bhatti, \"ICMPv6 Locator Update Message\", RFC 6743, November 2012.",
      "ja": "[RFC6743]アトキンソン、R.とS. Bhattiさん、 \"ICMPv6のロケータ更新メッセージ\"、RFC 6743、2012年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC6744] Atkinson, R. and S. Bhatti, \"IPv6 Nonce Destination Option for the Identifier-Locator Network Protocol for IPv6 (ILNPv6)\", RFC 6744, November 2012.",
      "ja": "[RFC6744]アトキンソン、R.およびS. Bhattiさん、 \"IPv6のための識別子、ロケータネットワークプロトコル（ILNPv6）のIPv6ノンス宛先オプション\"、RFC 6744、2012年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC6745] Atkinson, R. and S. Bhatti, \"ICMP Locator Update Message for the Identifier-Locator Network Protocol for IPv4 (ILNPv4)\", RFC 6745, November 2012.",
      "ja": "[RFC6745]アトキンソン、R.およびS. Bhattiさん、 \"IPv4の識別子、ロケータネットワークプロトコル（ILNPv4）のためのICMPロケータUpdateメッセージ\"、RFC 6745、2012年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC6746] Atkinson, R. and S. Bhatti, \"IPv4 Options for the Identifier-Locator Network Protocol (ILNP)\", RFC 6746, November 2012.",
      "ja": "[RFC6746]アトキンソン、R.およびS. Bhattiさん、 \"識別子ロケータネットワーク・プロトコルのIPv4オプション（ILNP）\"、RFC 6746、2012年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC6747] Atkinson, R. and S. Bhatti, \"Address Resolution Protocol (ARP) Extension for the Identifier-Locator Network Protocol for IPv4 (ILNPv4)\", RFC 6747, November 2012.",
      "ja": "[RFC6747]アトキンソン、R.およびS. Bhattiさん、 \"IPv4の識別子、ロケータネットワークプロトコル（ILNPv4）のためのアドレス解決プロトコル（ARP）の拡張\"、RFC 6747、2012年11月。"
    },
    {
      "indent": 0,
      "text": "11.2. Informative References",
      "section_title": true,
      "ja": "11.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[8+8] O'Dell, M., \"8+8 - An Alternate Addressing Architecture for IPv6\", Work in Progress, October 1996.",
      "ja": "[8 + 8]オデル、M.、 \"8 + 8  -  IPv6のアーキテクチャを代替アドレス\"、進歩、1996年10月での作業。"
    },
    {
      "indent": 3,
      "text": "[ABH07a] Atkinson, R., Bhatti, S., and S. Hailes, \"Mobility as an Integrated Service Through the Use of Naming\", Proceedings of ACM MobiArch 2007, August 2007, Kyoto, Japan.",
      "ja": "[ABH07a]アトキンソン、R.、Bhattiさん、S.、およびS.ヘイルズ、ACM MobiArch 2007、2007年8月、京都、日本の議事録 \"の命名を使用して、統合されたサービスとしてのモビリティ\"。"
    },
    {
      "indent": 3,
      "text": "[ABH07b] Atkinson, R., Bhatti, S., and S. Hailes, \"A Proposal for Unifying Mobility with Multi-Homing, NAT, & Security\", Proceedings of ACM MobiWAC 2007, Chania, Crete. ACM, October 2007.",
      "ja": "[ABH07b]アトキンソン、R.、Bhattiさん、S.、およびS.ヘイルズ、 \"マルチホーミング、NATとの統一モビリティの提案、＆セキュリティ\"、ACM MobiWAC 2007、ハニア、クレタ島の議事。 ACM、2007年10月。"
    },
    {
      "indent": 3,
      "text": "[ABH08a] Atkinson, R., Bhatti, S., and S. Hailes, \"Mobility Through Naming: Impact on DNS\", Proceedings of ACM MobiArch 2008, August 2008, ACM, Seattle, WA, USA.",
      "ja": "[ABH08a]アトキンソン、R.、Bhattiさん、S.、およびS.ヘイルズ、 \"命名を通してモビリティ：DNSへの影響\" を、ACM MobiArch 2008、2008年8月、ACM、シアトル、WA、USAの議事。"
    },
    {
      "indent": 3,
      "text": "[ABH08b] Atkinson, R., Bhatti, S., and S. Hailes, \"Harmonised Resilience, Security, and Mobility Capability for IP\", Proceedings of IEEE Military Communications (MILCOM) Conference, San Diego, CA, USA, November 2008.",
      "ja": "[ABH08b]アトキンソン、R.、Bhattiさん、S.、およびS.ヘイルズ、 \"IPのための調和弾力性、セキュリティ、およびモビリティ機能\"、IEEE軍事通信の議事録（MILCOM）は会議、サンディエゴ、CA、USA、2008年11月。"
    },
    {
      "indent": 3,
      "text": "[ABH09a] Atkinson, R., Bhatti, S., and S. Hailes, \"Site-Controlled Secure Multi-Homing and Traffic Engineering For IP\", Proceedings of IEEE Military Communications (MILCOM) Conference, Boston, MA, USA, October 2009.",
      "ja": "[ABH09a]アトキンソン、R.、Bhattiさん、S.、およびS.ヘイルズ、 \"サイト制御セキュアマルチホーミングおよびIPのトラフィックエンジニアリング\"、IEEE軍事通信の議事録（MILCOM）会議、ボストン、MA、USA、10月2009。"
    },
    {
      "indent": 3,
      "text": "[ABH09b] Atkinson, R., Bhatti, S., and S. Hailes, \"ILNP: Mobility, Multi-Homing, Localised Addressing and Security Through Naming\", Telecommunications Systems, Volume 42, Number 3-4, pp. 273-291, Springer-Verlag, December 2009, ISSN 1018-4864.",
      "ja": "[ABH09b]アトキンソン、R.、Bhattiさん、S.、およびS.ヘイルズ、 \"ILNP：モビリティ、マルチホーミング、ローカライズされた命名を通じてアドレッシングとセキュリティ\"、電気通信システム、ボリューム42、ナンバー3-4、頁273-。 291、シュプリンガー・フェアラーク、2009年12月、ISSN 1018から4864まで。"
    },
    {
      "indent": 3,
      "text": "[ABH10] Atkinson, R., Bhatti, S., S. Hailes, \"Evolving the Internet Architecture Through Naming\", IEEE Journal on Selected Areas in Communication (JSAC), vol. 28, no. 8, pp. 1319-1325, IEEE, Piscataway, NJ, USA, Oct 2010.",
      "ja": "【ABH10]アトキンソン、R.、Bhattiさん、S.、S.ヘイルズ、通信（JSAC）、VOLの選択された領域に、IEEEジャーナル \"命名を介してインターネットアーキテクチャの進化\"。 28、ありません。 8頁。1319年から1325年、IEEE、ピスカタウェイ、NJ、USA、2010年10月。"
    },
    {
      "indent": 3,
      "text": "[BA11] Bhatti, S. and R. Atkinson, \"Reducing DNS Caching\", Proceedings of IEEE Global Internet Symposium (GI2011), Shanghai, P.R. China, 15 April 2011.",
      "ja": "[BA11] Bhattiさん、S.とR.アトキンソン、 \"DNSキャッシュを削減\"、IEEEグローバルインターネットシンポジウム（GI2011）の議事録、上海、中国P.R.、2011年4月15日。"
    },
    {
      "indent": 3,
      "text": "[BA12] Bhatti, S. and R. Atkinson, \"Secure and Agile Wide-area Virtual Machine Mobility\", Proceedings of IEEE Military Communications Conference (MILCOM), Orlando, FL, USA, Oct 2012.",
      "ja": "[BA12] Bhattiさん、S.とR.アトキンソン、 \"安全でアジャイル広域仮想マシンのモビリティ\"、IEEE軍事通信会議（MILCOM）、オーランド、FL、USA、2012年10月の議事。"
    },
    {
      "indent": 3,
      "text": "[BAK11] Bhatti, S., Atkinson, R., and J. Klemets, \"Integrating Challenged Networks\", Proceedings of IEEE Military Communications Conference (MILCOM), Baltimore, MD, USA, November 2011.",
      "ja": "【BAK11] Bhattiさん、S.、アトキンソン、R.、およびJ. Klemets、 \"チャレンジ・ネットワークの統合\"、IEEE軍事通信会議（MILCOM）の議事録、ボルティモア、MD、USA、2011年11月。"
    },
    {
      "indent": 3,
      "text": "[CA-1995-01] US CERT, \"IP Spoofing Attacks and Hijacked Terminal Connections\", CERT Advisory 1995-01, Issued 23 Jan 1995, Revised 23 Sep 1997.",
      "ja": "[CA-1995から1901】米国CERT、「IPスプーフィング攻撃とハイジャック端子接続」、CERT勧告1995年から1901年には、1995年1月23日に発行、1997年9月23日に改訂します。"
    },
    {
      "indent": 3,
      "text": "[DIA] Defense Intelligence Agency, \"Compartmented Mode Workstation Specification\", Technical Report DDS-2600-6243-87, US Defense Intelligence Agency, Bolling AFB, DC, USA.",
      "ja": "[DIA]国防情報局、 \"コンパートメントモードワークステーションの仕様\"、技術報告書DDS-2600-6243-87、米国防情報局、ボリングAFB、DC、USA。"
    },
    {
      "indent": 3,
      "text": "[DoD85] US National Computer Security Center, \"Department of Defense Trusted Computer System Evaluation Criteria\", DoD 5200.28-STD, US Department of Defense, Ft. Meade, MD, USA, December 1985.",
      "ja": "[DoD85】米国国家のコンピュータセキュリティセンターは、米国国防総省5200.28-STD、防衛、フォートの米国務省「国防総省はコンピュータシステム評価基準を信頼できます」。ミード、MD、USA、1985年12月。"
    },
    {
      "indent": 3,
      "text": "[DoD87] US National Computer Security Center, \"Trusted Network Interpretation of the Trusted Computer System Evaluation Criteria\", NCSC-TG-005, Version 1, US Department of Defense, Ft. Meade, MD, USA, 31 July 1987.",
      "ja": "[DoD87】米国国家のコンピュータセキュリティセンター、「信頼されたコンピュータシステム評価基準の信頼できるネットワーク解釈」、NCSC-TG-005、バージョン1、防衛、フォートの米国務省。ミード、MD、USA、1987年7月31日。"
    },
    {
      "indent": 3,
      "text": "[GSE] O'Dell, M., \"GSE - An Alternate Addressing Architecture for IPv6\", Work in Progress, February 1997.",
      "ja": "[GSE]オデル、M.、 \"GSE  -  IPv6のアーキテクチャを代替アドレス\"、進歩、1997年2月での作業。"
    },
    {
      "indent": 3,
      "text": "[GUF07] Gueye, B., Uhlig, S., and S. Fdida, \"Investigating the Imprecision of IP Block-Based Geolocation\", Lecture Notes in Computer Science, Volume 4427, pp. 237-240, Springer-Verlag, Heidelberg, Germany, 2007.",
      "ja": "、コンピュータサイエンスの講義ノート、ボリューム4427、PP。237-240、シュプリンガー・フェアラーク、ハイデルベルク \"IPブロックベースの地理位置情報の不正確の調査\" [GUF07] Gueye、B.、Uhlig、S.、およびS. Fdida、 、ドイツ、2007年。"
    },
    {
      "indent": 3,
      "text": "[ID-ULA] Hinden, R., Huston, G., and T. Narten, \"Centrally Assigned Unique Local IPv6 Unicast Addresses\", Work in Progress, June 2007.",
      "ja": "[ID-ULA] HindenとR.、ヒューストン、G.、およびT. Narten氏、 \"中心割り当てられた固有のローカルIPv6ユニキャストアドレス\"、進歩、2007年6月に作業。"
    },
    {
      "indent": 3,
      "text": "[IEEE-EUI] IEEE, \"Guidelines for 64-bit Global Identifier (EUI-64) Registration Authority\", Piscataway, NJ, USA, March 1997, <http://standards.ieee.org/regauth/oui/tutorials/ EUI64.html>.",
      "ja": "[IEEE-EUI] IEEE、 \"64ビットのグローバル識別子（EUI-64）登録機関のためのガイドライン\"、ピスカタウェイ、NJ、USA、1997年3月、<http://standards.ieee.org/regauth/oui/tutorials/ EUI64.html>。"
    },
    {
      "indent": 3,
      "text": "[IEN1] Bennett, C., Edge, S., and A. Hinchley, \"Issues in the Interconnection of Datagram Networks\", Internet Experiment Note (IEN) 1, INDRA Note 637, PSPWN 76, 29 July 1977, <http://www.rfc-editor.org/ien/ien1.pdf>.",
      "ja": "[IEN1]ベネット、C.、エッジ、S.、およびA. Hinchley、 \"データグラムネットワークの相互接続での問題\"、インターネット実験ノート（IEN）1、INDRA注637、PSPWN 76、1977年7月29日、<のhttp： //www.rfc-editor.org/ien/ien1.pdf>。"
    },
    {
      "indent": 3,
      "text": "[IEN19] Shoch, J., \"Inter-Network Naming, Addressing, and Routing\", IEN 19, January 1978, <http://www.rfc-editor.org/ien/ien19.txt>.",
      "ja": "[IEN19] Shoch、J.、 \"ネットワーク間ネーミング、アドレシング、およびルーティング\"、IEN 19、1978年1月、<http://www.rfc-editor.org/ien/ien19.txt>。"
    },
    {
      "indent": 3,
      "text": "[IEN23] Cohen, D., \"On Names, Addresses, and Routings\", IEN 23, January 1978, <http://www.rfc-editor.org/ien/ien23.pdf>.",
      "ja": "[IEN23]コーエン、D.、 \"名前、住所、およびルーティングについて\"、IEN 23、1978年1月、<http://www.rfc-editor.org/ien/ien23.pdf>。"
    },
    {
      "indent": 3,
      "text": "[IEN31] Cohen, D., \"On Names, Addresses, and Routings (II)\", IEN 31, April 1978, <http://www.rfc-editor.org/ien/ien31.pdf>.",
      "ja": "【IEN31]コーエン、D.、 \"名前、アドレス、および作業手順について（II）\"、IEN 31、1978年4月、<http://www.rfc-editor.org/ien/ien31.pdf>。"
    },
    {
      "indent": 3,
      "text": "[IEN135] Sunshine, C. and J. Postel, \"Addressing Mobile Hosts in the ARPA Internet Environment\", IEN 135, March 1980, <http://www.rfc-editor.org/ien/ien135.pdf>.",
      "ja": "\"ARPAインターネット環境でのモバイルホストのアドレス指定\" [IEN135]サンシャイン、C.とJ.ポステル、IEN 135、1980年3月、<http://www.rfc-editor.org/ien/ien135.pdf>。"
    },
    {
      "indent": 3,
      "text": "[IPng95] Clark, D., \"A thought on addressing\", electronic mail message to IETF IPng WG, Message-ID: 9501111901.AA28426@caraway.lcs.mit.edu, Laboratory for Computer Science, MIT, Cambridge, MA, USA, 11 January 1995.",
      "ja": "IETFのIPng WGへ[IPng95]クラーク、D.、 \"アドレッシングの思想\"、電子メールメッセージ、メッセージID：9501111901.AA28426@caraway.lcs.mit.edu、コンピュータサイエンス、MITのための研究所、ケンブリッジ、MA、 USA、1995年1月11日。"
    },
    {
      "indent": 3,
      "text": "[LA2006] Liu, C. and P. Albitz, \"DNS & Bind\", 5th Edition, O'Reilly & Associates, Sebastopol, CA, USA, May 2006, ISBN 0-596-10057-4.",
      "ja": "[LA2006]劉、C.およびP. Albitz、 \"DNSおよびバインド\"、第5版、オライリー＆アソシエーツ、セバストポル、CA、USA、2006年5月、ISBN 0-596-10057-4。"
    },
    {
      "indent": 3,
      "text": "[LABH06] Lad, M., Atkinson, R., Bhatti, S., and S. Hailes, \"A Proposal for Coalition Networking in Dynamic Operational Environments\", Proceedings of IEEE Military Communications Conference, Washington, DC, USA, Nov. 2006.",
      "ja": "【LABH06】ラッド、M.、アトキンソン、R.、Bhattiさん、S.、およびS.ヘイルズ、「動的動作環境における連合ネットワークの提案」、IEEE軍事通信会議、ワシントンD.C.、USA、11月の議事2006。"
    },
    {
      "indent": 3,
      "text": "[PHG02] Pappas, A., Hailes, S., and R. Giaffreda, \"Mobile Host Location Tracking through DNS\", Proceedings of IEEE London Communications Symposium, IEEE, London, England, UK, September 2002.",
      "ja": "[PHG02]パパス、A.、ヘイルズ、S.、およびR. Giaffreda、 \"モバイルホストの場所DNSを通じてトラッキング\"、IEEEロンドンコミュニケーションシンポジウム、IEEE、ロンドン、イングランド、イギリス、2002年9月の議事。"
    },
    {
      "indent": 3,
      "text": "[RAB09] Rehunathan, D., Atkinson, R., and S. Bhatti, \"Enabling Mobile Networks Through Secure Naming\", Proceedings of IEEE Military Communications Conference (MILCOM), Boston, MA, USA, October 2009.",
      "ja": "[RAB09] Rehunathan、D.、アトキンソン、R.、およびS. Bhattiさん、 \"セキュア・ネーミングを介してモバイルネットワークの有効化\"、IEEE軍事通信会議（MILCOM）の議事録、ボストン、MA、USA、2009年10月。"
    },
    {
      "indent": 3,
      "text": "[RB10] Rehunathan, D. and S. Bhatti, \"A Comparative Assessment of Routing for Mobile Networks\", Proceedings of IEEE International Conference on Wireless and Mobile Computing Networking and Communications (WiMob), IEEE, Niagara Falls, ON, Canada, Oct. 2010.",
      "ja": "【RB10] Rehunathan、D.およびS. Bhattiさん、「モバイルネットワークのためのルーティングの比較評価」、ワイヤレスおよびモバイルコンピューティングネットワークと通信（WiMob）、IEEE、ナイアガラフォールズ、ON、カナダ、10月にIEEE国際会議の議事録。2010年。"
    },
    {
      "indent": 3,
      "text": "[SBK01] Snoeren, A., Balakrishnan, H., and M. Frans Kaashoek, \"Reconsidering Internet Mobility\", Proceedings of 8th Workshop on Hot Topics in Operating Systems, IEEE, Elmau, Germany, May 2001.",
      "ja": "[SBK01] Snoeren、A.、バラクリシュナン、H.、およびM.フランズ・カアショエック、 \"再考インターネットモビリティ\"、オペレーティングシステム、IEEE、Elmau、ドイツ、2001年5月のホットな話題第8回ワークショップの議事録。"
    },
    {
      "indent": 3,
      "text": "[SIPP94] Smart, B., \"Re: IPng Directorate meeting in Chicago; possible SIPP changes\", electronic mail to the IETF SIPP WG mailing list, Message-ID: 199406020647.AA09887@shark.mel.dit.csiro.au, Commonwealth Scientific & Industrial Research Organisation (CSIRO), Melbourne, VIC, 3001, Australia, 2 June 1994.",
      "ja": "[SIPP94]スマート、B.、 \"日時：シカゴでのIPng理事会;可能SIPPの変更\"、電子メールIETF SIPP WGメーリングリストに、メッセージID：199406020647.AA09887@shark.mel.dit.csiro.au、連邦科学産業研究機構（CSIRO）、メルボルン、VIC、3001、オーストラリア、1994年6月2日。"
    },
    {
      "indent": 3,
      "text": "[SRC84] Saltzer, J., Reed, D., and D. Clark, \"End to End Arguments in System Design\", ACM Transactions on Computer Systems, Volume 2, Number 4, ACM, New York, NY, USA, November 1984.",
      "ja": "[SRC84] Saltzer、J.、リード、D.、およびD.クラーク、 \"システム設計における引数をエンドツーエンド\"、コンピュータシステム、第2巻、ナンバー4、ACM、ニューヨーク、NY、USA、11月にACM取引1984。"
    },
    {
      "indent": 3,
      "text": "[RFC814] Clark, D., \"Name, addresses, ports, and routes\", RFC 814, July 1982.",
      "ja": "[RFC814]クラーク、D.、 \"名前、アドレス、ポート、およびルート\"、RFC 814、1982年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC1112] Deering, S., \"Host extensions for IP multicasting\", STD 5, RFC 1112, August 1989.",
      "ja": "[RFC1112]デアリング、S.、STD 5、RFC 1112、1989年8月 \"IPマルチキャスティングのためのホスト拡大\"。"
    },
    {
      "indent": 3,
      "text": "[RFC1122] Braden, R., Ed., \"Requirements for Internet Hosts - Communication Layers\", STD 3, RFC 1122, October 1989.",
      "ja": "[RFC1122]ブレーデン、R.、エド、 \"インターネットホストのための要件 - 通信層\"。、STD 3、RFC 1122、1989年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC1498] Saltzer, J., \"On the Naming and Binding of Network Destinations\", RFC 1498, August 1993.",
      "ja": "[RFC1498] \"命名オンとネットワーク宛先の結合\" Saltzer、J.、RFC 1498、1993年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC1631] Egevang, K. and P. Francis, \"The IP Network Address Translator (NAT)\", RFC 1631, May 1994.",
      "ja": "[RFC1631] Egevang、K.およびP.フランシス、 \"IPネットワークアドレス変換（NAT）\"、RFC 1631、1994年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC1825] Atkinson, R., \"Security Architecture for the Internet Protocol\", RFC 1825, August 1995.",
      "ja": "[RFC1825]アトキンソン、R.、 \"インターネットプロトコルのためのセキュリティー体系\"、RFC 1825、1995年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC1826] Atkinson, R., \"IP Authentication Header\", RFC 1826, August 1995.",
      "ja": "[RFC1826]アトキンソン、R.、 \"IP認証ヘッダー\"、RFC 1826、1995年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC1827] Atkinson, R., \"IP Encapsulating Security Payload (ESP)\", RFC 1827, August 1995.",
      "ja": "[RFC1827]アトキンソン、R.、 \"IPカプセル化セキュリティペイロード（ESP）\"、RFC 1827、1995年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC1958] Carpenter, B., Ed., \"Architectural Principles of the Internet\", RFC 1958, June 1996.",
      "ja": "[RFC1958]大工、B.、エド。、 \"インターネットの建築原則\"、RFC 1958、1996年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC1992] Castineyra, I., Chiappa, N., and M. Steenstrup, \"The Nimrod Routing Architecture\", RFC 1992, August 1996.",
      "ja": "[RFC1992] Castineyra、I.、Chiappa、N.、およびM. Steenstrup、 \"ニムロッドルーティングアーキテクチャ\"、RFC 1992、1996年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC2002] Perkins, C., Ed., \"IP Mobility Support\", RFC 2002, October 1996.",
      "ja": "[RFC2002]パーキンス、C.、エド。、 \"IPモビリティサポート\"、RFC 2002、1996年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC2101] Carpenter, B., Crowcroft, J., and Y. Rekhter, \"IPv4 Address Behaviour Today\", RFC 2101, February 1997.",
      "ja": "[RFC2101]カーペンター、B.、クロウクロフト、J.、およびY. Rekhter、 \"IPv4アドレス動作今日\"、RFC 2101、1997年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC2136] Vixie, P., Ed., Thomson, S., Rekhter, Y., and J. Bound, \"Dynamic Updates in the Domain Name System (DNS UPDATE)\", RFC 2136, April 1997.",
      "ja": "[RFC2136]いるVixie、P.編、トムソン、S.、Rekhter、Y.、およびJ.はバウンド、 \"ドメインネームシステムにおける動的更新（DNS更新）\"、RFC 2136、1997年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2710] Deering, S., Fenner, W., and B. Haberman, \"Multicast Listener Discovery (MLD) for IPv6\", RFC 2710, October 1999.",
      "ja": "[RFC2710]デアリング、S.、フェナー、W.、およびB.ハーバーマン、 \"IPv6のためのマルチキャストリスナー発見（MLD）\"、RFC 2710、1999年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC2827] Ferguson, P. and D. Senie, \"Network Ingress Filtering: Defeating Denial of Service Attacks which employ IP Source Address Spoofing\", BCP 38, RFC 2827, May 2000.",
      "ja": "[RFC2827]ファーガソン、P.およびD. Senie、 \"ネットワーク入力フィルタリング：IP Source Address Spoofingを使うサービス攻撃の敗北拒否\"、BCP 38、RFC 2827、2000年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC2956] Kaat, M., \"Overview of 1999 IAB Network Layer Workshop\", RFC 2956, October 2000.",
      "ja": "[RFC2956] Kaat、M.、RFC 2956、2000年10月 \"1999 IABネットワーク層のワークショップの概要\" を参照してください。"
    },
    {
      "indent": 3,
      "text": "[RFC3022] Srisuresh, P. and K. Egevang, \"Traditional IP Network Address Translator (Traditional NAT)\", RFC 3022, January 2001.",
      "ja": "[RFC3022] Srisuresh、P.とK. Egevang、 \"伝統的なIPネットワークアドレス変換（NAT繁体字）\"、RFC 3022、2001年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC3027] Holdrege, M. and P. Srisuresh, \"Protocol Complications with the IP Network Address Translator\", RFC 3027, January 2001.",
      "ja": "[RFC3027]ホールドレッジ、M.とP. Srisuresh、RFC 3027、2001年1月 \"IPネットワークアドレス変換とプロトコル合併症\"。"
    },
    {
      "indent": 3,
      "text": "[RFC3177] IAB and IESG, \"IAB/IESG Recommendations on IPv6 Address Allocations to Sites\", RFC 3177, September 2001.",
      "ja": "[RFC3177] IABとIESG、RFC 3177、2001年9月 \"サイトへのIPv6アドレスの割り当てにIAB / IESG勧告\"。"
    },
    {
      "indent": 3,
      "text": "[RFC3376] Cain, B., Deering, S., Kouvelas, I., Fenner, B., and A. Thyagarajan, \"Internet Group Management Protocol, Version 3\", RFC 3376, October 2002.",
      "ja": "[RFC3376]カイン、B.、デアリング、S.、Kouvelas、I.、フェナー、B.、およびA. Thyagarajan、 \"インターネットグループ管理プロトコル、バージョン3\"、RFC 3376、2002年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC3704] Baker, F. and P. Savola, \"Ingress Filtering for Multihomed Networks\", BCP 84, RFC 3704, March 2004.",
      "ja": "[RFC3704]ベイカー、F.およびP. Savola、 \"マルチホームネットワークの入力フィルタリング\"、BCP 84、RFC 3704、2004年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3715] Aboba, B. and W. Dixon, \"IPsec-Network Address Translation (NAT) Compatibility Requirements\", RFC 3715, March 2004.",
      "ja": "[RFC3715] Aboba、B.とW.ディクソン、 \"IPsecでネットワークアドレス変換（NAT）の互換性の要件\"、RFC 3715、2004年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3810] Vida, R., Ed., and L. Costa, Ed., \"Multicast Listener Discovery Version 2 (MLDv2) for IPv6\", RFC 3810, June 2004.",
      "ja": "[RFC3810]ビダ、R.、エド。、およびL.コスタ、エド。、 \"IPv6のマルチキャストリスナ発見バージョン2（MLDv2の）\"、RFC 3810、2004年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC3948] Huttunen, A., Swander, B., Volpe, V., DiBurro, L., and M. Stenberg, \"UDP Encapsulation of IPsec ESP Packets\", RFC 3948, January 2005.",
      "ja": "[RFC3948] Huttunen、A.、Swander、B.、ボルペ、V.、DiBurro、L.、及びM.ステンバーグ、 \"IPsecのESPパケットのUDPカプセル化\"、RFC 3948、2005年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC3971] Arkko, J., Ed., Kempf, J., Zill, B., and P. Nikander, \"SEcure Neighbor Discovery (SEND)\", RFC 3971, March 2005.",
      "ja": "[RFC3971] Arkko、J.、編、ケンプ、J.、Zill、B.、およびP. Nikander、 \"セキュア近隣探索（SEND）\"、RFC 3971、2005年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3972] Aura, T., \"Cryptographically Generated Addresses (CGA)\", RFC 3972, March 2005.",
      "ja": "[RFC3972]オーラ、T.、 \"暗号的に生成されたアドレス（CGA）\"、RFC 3972、2005年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC4193] Hinden, R. and B. Haberman, \"Unique Local IPv6 Unicast Addresses\", RFC 4193, October 2005.",
      "ja": "[RFC4193] HindenとR.とB.ハーバーマン、 \"ユニークローカルIPv6ユニキャストアドレス\"、RFC 4193、2005年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC4291] Hinden, R. and S. Deering, \"IP Version 6 Addressing Architecture\", RFC 4291, February 2006.",
      "ja": "[RFC4291] HindenとR.とS.デアリング、 \"IPバージョン6アドレッシング体系\"、RFC 4291、2006年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC4581] Bagnulo, M. and J. Arkko, \"Cryptographically Generated Addresses (CGA) Extension Field Format\", RFC 4581, October 2006.",
      "ja": "[RFC4581] Bagnulo、M.及びJ. Arkko、 \"暗号化生成アドレス（CGA）の拡張フィールドのフォーマット\"、RFC 4581、2006年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC4941] Narten, T., Draves, R., and S. Krishnan, \"Privacy Extensions for Stateless Address Autoconfiguration in IPv6\", RFC 4941, September 2007.",
      "ja": "[RFC4941] Narten氏、T.、Draves、R.、およびS.クリシュナン、 \"IPv6におけるステートレスアドレス自動設定のための個人情報保護の拡張\"、RFC 4941、2007年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC4982] Bagnulo, M. and J. Arkko, \"Support for Multiple Hash Algorithms in Cryptographically Generated Addresses (CGAs)\", RFC 4982, July 2007.",
      "ja": "[RFC4982] Bagnulo、M.及びJ. Arkko、 \"暗号化生成アドレス（CGAs）の複数のハッシュアルゴリズムのサポート\"、RFC 4982、2007年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC4984] Meyer, D., Ed., Zhang, L., Ed., and K. Fall, Ed., \"Report from the IAB Workshop on Routing and Addressing\", RFC 4984, September 2007.",
      "ja": "[RFC4984]マイヤー、D.、エド。、チャン、L.、エド。、およびK.秋、エド。、 \"ルーティングとアドレッシングのIABワークショップからの報告書\"、RFC 4984、2007年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC5061] Stewart, R., Xie, Q., Tuexen, M., Maruyama, S., and M. Kozuka, \"Stream Control Transmission Protocol (SCTP) Dynamic Address Reconfiguration\", RFC 5061, September 2007.",
      "ja": "[RFC5061]スチュワート、R.、謝、Q.、Tuexen、M.、丸山、S.、およびM.小塚、 \"ストリーム制御伝送プロトコル（SCTP）動的アドレス再構成\"、RFC 5061、2007年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC5570] StJohns, M., Atkinson, R., and G. Thomas, \"Common Architecture Label IPv6 Security Option (CALIPSO)\", RFC 5570, July 2009.",
      "ja": "[RFC5570] StJohns、M.、アトキンソン、R.、およびG.トーマス、 \"共通のアーキテクチャラベルIPv6のセキュリティオプション（CALIPSO）\"、RFC 5570、2009年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC6177] Narten, T., Huston, G., and L. Roberts, \"IPv6 Address Assignment to End Sites\", BCP 157, RFC 6177, March 2011.",
      "ja": "[RFC6177] Narten氏、T.、ヒューストン、G.、およびL.ロバーツ、 \"サイトを終了したIPv6アドレスの割り当て\"、BCP 157、RFC 6177、2011年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC6250] Thaler, D., \"Evolution of the IP Model\", RFC 6250, May 2011.",
      "ja": "[RFC6250]ターラー、D.、 \"IPモデルの進化\"、RFC 6250、2011年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC6275] Perkins, C., Ed., Johnson, D., and J. Arkko, \"Mobility Support in IPv6\", RFC 6275, July 2011.",
      "ja": "[RFC6275]パーキンス、C.、エド。、ジョンソン、D.、およびJ. Arkko、 \"IPv6におけるモビリティサポート\"、RFC 6275、2011年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC6748] Atkinson, R. and S. Bhatti, \"Optional Advanced Deployment Scenarios for the Identifier-Locator Network Protocol (ILNP)\", RFC 6748, November 2012.",
      "ja": "[RFC6748]アトキンソン、R.とS. Bhattiさん、 \"識別子ロケータネットワークプロトコル（ILNP）用のオプションの高度な展開シナリオ\"、RFC 6748、2012年11月。"
    },
    {
      "indent": 0,
      "text": "12. Acknowledgements",
      "section_title": true,
      "ja": "12.謝辞"
    },
    {
      "indent": 3,
      "text": "Steve Blake, Stephane Bortzmeyer, Mohamed Boucadair, Noel Chiappa, Wes George, Steve Hailes, Joel Halpern, Mark Handley, Volker Hilt, Paul Jakma, Dae-Young Kim, Tony Li, Yakov Rehkter, Bruce Simpson, Robin Whittle, and John Wroclawski (in alphabetical order) provided review and feedback on earlier versions of this document. Steve Blake provided an especially thorough review of an early version of the entire ILNP document set, which was extremely helpful. We also wish to thank the anonymous reviewers of the various ILNP papers for their feedback.",
      "ja": "スティーブ・ブレイク、ステファンBortzmeyer、モハメドBoucadair、クリスマスChiappa、ウェス・ジョージ、スティーブ・ヘイルズ、ジョエル・ハルパーン、マーク・ハンドリー、フォルカー柄、ポールJakma、府・ヤング・キム、トニー・リー、ヤコフRehkter、ブルース・シンプソン、ロビンWhittleさん、ジョンWroclawski （アルファベット順）このドキュメントの以前のバージョンのレビューとフィードバックを提供しました。スティーブ・ブレイクは非常に便利だった全体ILNPドキュメントセットの初期のバージョンの特に徹底的な見直しを提供します。我々はまた、彼らのフィードバックのためのさまざまなILNP論文の匿名の査読を感謝したいです。"
    },
    {
      "indent": 3,
      "text": "Roy Arends provided expert guidance on technical and procedural aspects of DNS issues.",
      "ja": "ロイ・アレンズは、DNSの問題の技術的、手続き的側面について専門家の指導を提供します。"
    },
    {
      "indent": 3,
      "text": "Noel Chiappa graciously provided the authors with copies of the original email messages cited here as [SIPP94] and [IPng95], which enabled the precise citation of those messages herein.",
      "ja": "クリスマスChiappaは優雅に、本明細書にそれらのメッセージの正確な引用を有効[SIPP94]としてここに引用された元の電子メールメッセージのコピーと[IPng95]、と著者を提供しました。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "RJ Atkinson Consultant San Jose, CA 95125 USA",
      "ja": "RJアトキンソンコンサルタントサンノゼ、CA 95125 USA"
    },
    {
      "indent": 3,
      "text": "EMail: rja.lists@gmail.com",
      "ja": "メールアドレス：rja.lists@gmail.com"
    },
    {
      "indent": 3,
      "text": "SN Bhatti School of Computer Science University of St Andrews North Haugh, St Andrews Fife KY16 9SX Scotland, UK",
      "ja": "セントアンドリュース北ハウのコンピュータサイエンス大学、セントアンドリュースファイフKY16 9SXスコットランド、英国のSN Bhattiさんの学校"
    },
    {
      "indent": 3,
      "text": "EMail: saleem@cs.st-andrews.ac.uk",
      "ja": "メールアドレス：saleem@cs.st-andrews.ac.uk"
    }
  ]
}