{
  "title": {
    "text": "RFC 6415 - Web Host Metadata",
    "ja": "RFC 6415 - Webホストメタデータ"
  },
  "number": 6415,
  "created_at": "2022-11-23 17:17:17.667674+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)              E. Hammer-Lahav, Ed.\nRequest for Comments: 6415                                       B. Cook\nCategory: Standards Track                                   October 2011\nISSN: 2070-1721",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 27,
      "text": "Web Host Metadata",
      "ja": "Webホストメタデータ"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This specification describes a method for locating host metadata as well as information about individual resources controlled by the host.",
      "ja": "この仕様には、ホストメタデータを見つける方法と、ホストが制御する個々のリソースに関する情報が記載されています。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準トラックドキュメントです。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントは、インターネットエンジニアリングタスクフォース（IETF）の製品です。IETFコミュニティのコンセンサスを表しています。公開レビューを受けており、インターネットエンジニアリングステアリンググループ（IESG）からの出版が承認されています。インターネット標準の詳細については、RFC 5741のセクション2で入手できます。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6415.",
      "ja": "このドキュメントの現在のステータス、任意のERRATA、およびそのフィードバックを提供する方法に関する情報は、http：//www.rfc-editor.org/info/rfc6415で取得できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2011 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2011 IETF Trustおよび文書著者として特定された人。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "このドキュメントは、BCP 78およびIETFドキュメント（http://trustee.ietf.org/license-info）に関連するIETF Trustの法的規定の対象となります。この文書に関するあなたの権利と制限を説明するので、これらの文書を注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、セクション4.Eで説明されている法的規定のセクション4.Eで説明されており、単純化されたBSDライセンスで説明されているように保証なしで提供される簡略化されたBSDライセンステキストを含める必要があります。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n   1.1. Example ....................................................3\n        1.1.1. Processing Resource-Specific Information ............4\n   1.2. Notational Conventions .....................................5\n2. Obtaining host-meta Documents ...................................6\n3. The host-meta Document ..........................................6\n   3.1. XML Document Format ........................................7\n        3.1.1. The \"Link\" Element ..................................7\n4. Processing host-meta Documents ..................................8\n   4.1. Host-Wide Information ......................................9\n   4.2. Resource-Specific Information ..............................9\n5. Security Considerations ........................................10\n6. IANA Considerations ............................................11\n   6.1. The \"host-meta\" Well-Known URI ............................11\n   6.2. The \"host-meta.json\" Well-Known URI .......................11\n   6.3. The \"lrdd\" Relation Type ..................................11\nAppendix A. JRD Document Format ...................................12\nAppendix B. Acknowledgments .......................................15\nNormative References ..............................................15",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "Web-based protocols often require the discovery of host policy or metadata, where \"host\" is not a single resource but the entity controlling the collection of resources identified by Uniform Resource Identifiers (URIs) with a common URI host [RFC3986], which can be served by one or more servers.",
      "ja": "Webベースのプロトコルでは、多くの場合、「ホスト」は単一のリソースではなく、共通のURIホスト[RFC3986]を持つユニフォームリソース識別子（URI）によって識別されるリソースのコレクションを制御するエンティティを制御するエンティティを必要とします。1つ以上のサーバーが提供されます。"
    },
    {
      "indent": 3,
      "text": "While web protocols have a wide range of metadata needs, they often use metadata that is concise, has simple syntax requirements, and can benefit from storing their metadata in a common location used by other related protocols.",
      "ja": "Webプロトコルには幅広いメタデータのニーズがありますが、多くの場合、簡潔なメタデータを使用し、単純な構文要件を備えており、他の関連プロトコルで使用される共通の場所にメタデータを保存することで利益を得ることができます。"
    },
    {
      "indent": 3,
      "text": "Because there is no URI or representation available to describe a host, many of the methods used for associating per-resource metadata (such as HTTP headers) are not available. This often leads to the overloading of the root HTTP resource (e.g., 'http://example.com/') with host metadata that is not specific or relevant to the root resource itself.",
      "ja": "ホストを説明するために利用できるURIまたは表現がないため、リソースごとのメタデータ（HTTPヘッダーなど）の関連付けに使用される方法の多くは利用できません。これは、多くの場合、ルートリソース自体に固有または関連性のないホストメタデータを使用して、ルートHTTPリソース（ 'http://example.com/' '）の過負荷につながります。"
    },
    {
      "indent": 3,
      "text": "This document defines a lightweight metadata document format for describing hosts (thus the name \"host-meta\"), intended for use by web-based protocols. This document also registers the well-known URI suffix \"host-meta\" in the Well-Known URI Registry established by [RFC5785].",
      "ja": "このドキュメントでは、Webベースのプロトコルで使用することを目的としたホスト（「ホストメタ」という名前）を記述するための軽量のメタデータドキュメント形式を定義しています。このドキュメントは、[RFC5785]によって確立されたよく知られているURIレジストリで、よく知られているURI接尾辞「ホストメタ」を登録します。"
    },
    {
      "indent": 3,
      "text": "In addition, there are times when a host-wide scope for policy or metadata is too coarse-grained. host-meta provides two mechanisms for providing resource-specific information:",
      "ja": "さらに、ポリシーまたはメタデータのホスト全体の範囲が粗い粒子が大きすぎる場合があります。ホストメタは、リソース固有の情報を提供するための2つのメカニズムを提供します。"
    },
    {
      "indent": 3,
      "text": "o Link Templates - links using a URI template instead of a fixed target URI, providing a way to define generic rules for generating resource-specific links by applying the individual resource URI to the template.",
      "ja": "o リンクテンプレート - 固定ターゲットURIの代わりにURIテンプレートを使用してリンクし、個々のリソースURIをテンプレートに適用して、リソース固有のリンクを生成するための一般的なルールを定義する方法を提供します。"
    },
    {
      "indent": 3,
      "text": "o Link-based Resource Descriptor Documents (LRDD, pronounced 'lard') - descriptor documents providing resource-specific information, typically information that cannot be expressed using link templates. LRDD documents are linked to resources or host-meta documents using link templates with the \"lrdd\" relation type.",
      "ja": "o リンクベースのリソース記述子ドキュメント（LRDD、「LARD」と発音） - リソース固有の情報、通常はリンクテンプレートを使用して表現できない情報を提供する記述子ドキュメント。LRDDドキュメントは、「LRDD」関係タイプを持つリンクテンプレートを使用して、リソースまたはホストメタドキュメントにリンクされています。"
    },
    {
      "indent": 0,
      "text": "1.1. Example",
      "section_title": true,
      "ja": "1.1. 例"
    },
    {
      "indent": 3,
      "text": "The following is a simple host-meta document including both host-wide and resource-specific information for the 'example.com' host:",
      "ja": "以下は、「Example.com」ホストのホスト全体とリソース固有の情報の両方を含む、シンプルなホストメタドキュメントです。"
    },
    {
      "indent": 3,
      "text": "<?xml version='1.0' encoding='UTF-8'?>\n<XRD xmlns='http://docs.oasis-open.org/ns/xri/xrd-1.0'>",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 5,
      "text": "<!-- Host-Wide Information -->",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 5,
      "text": "<Property type='http://protocol.example.net/version'>1.0</Property>",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 5,
      "text": "<Link rel='copyright'\n href='http://example.com/copyright' />",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 5,
      "text": "<!-- Resource-specific Information -->",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 5,
      "text": "<Link rel='hub'\n template='http://example.com/hub' />",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 5,
      "text": "<Link rel='lrdd'\n type='application/xrd+xml'\n template='http://example.com/lrdd?uri={uri}' />",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 5,
      "text": "<Link rel='author'\n template='http://example.com/author?q={uri}' />",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "</XRD>",
      "ja": "</xrd>"
    },
    {
      "indent": 3,
      "text": "The host-wide information that applies to the host in its entirety provided by the document includes:",
      "ja": "ドキュメントによって提供されるホスト全体に適用されるホスト全体の情報には、以下が含まれます。"
    },
    {
      "indent": 3,
      "text": "o An \"http://protocol.example.net/version\" host property with a value of \"1.0\".",
      "ja": "o 「1.0」の値を持つ「http://protocol.example.net/version」ホストプロパティ。"
    },
    {
      "indent": 3,
      "text": "o A link to the host's copyright policy (\"copyright\").",
      "ja": "o ホストの著作権ポリシーへのリンク（「著作権」）。"
    },
    {
      "indent": 3,
      "text": "The resource-specific information provided by the document includes:",
      "ja": "ドキュメントが提供するリソース固有の情報には次のものが含まれます。"
    },
    {
      "indent": 3,
      "text": "o A link template for receiving real-time updates (\"hub\") about individual resources. Since the template does not include a template variable, the target URI is identical for all resources.",
      "ja": "o 個々のリソースに関するリアルタイムアップデート（「ハブ」）を受信するためのリンクテンプレート。テンプレートにはテンプレート変数が含まれていないため、ターゲットURIはすべてのリソースと同じです。"
    },
    {
      "indent": 3,
      "text": "o A LRDD document link template (\"lrdd\") for obtaining additional resource-specific information contained in a separate document for each individual resource.",
      "ja": "o 個々のリソースごとに別のドキュメントに含まれる追加のリソース固有の情報を取得するためのLRDDドキュメントリンクテンプレート（ \"LRDD\"）。"
    },
    {
      "indent": 3,
      "text": "o A link template for finding information about the author of individual resources (\"author\").",
      "ja": "o 個々のリソースの著者に関する情報を見つけるためのリンクテンプレート（「著者」）。"
    },
    {
      "indent": 0,
      "text": "1.1.1. Processing Resource-Specific Information",
      "section_title": true,
      "ja": "1.1.1. リソース固有の情報の処理"
    },
    {
      "indent": 3,
      "text": "When looking for information about an individual resource -- for example, the resource identified by 'http://example.com/xy' -- the resource URI is applied to the templates found, producing the following links:",
      "ja": "「http://example.com/xy」で識別されたリソースなど、個々のリソースに関する情報を探している場合、リソースURIが見つかったテンプレートに適用され、次のリンクが生成されます。"
    },
    {
      "indent": 4,
      "text": "<Link rel='hub'\n href='http://example.com/hub' />",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "<Link rel='lrdd'\n type='application/xrd+xml'\n href='http://example.com/lrdd?uri=http%3A%2F%2Fexample.com%2Fxy' />",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "<Link rel='author'\n href='http://example.com/author?q=http%3A%2F%2Fexample.com%2Fxy' />",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The LRDD document for 'http://example.com/xy' (obtained via an HTTP \"GET\" request):",
      "ja": "'http://example.com/xy'のLRDDドキュメント（http \"get\" requestで取得）："
    },
    {
      "indent": 5,
      "text": "<?xml version='1.0' encoding='UTF-8'?>\n<XRD xmlns='http://docs.oasis-open.org/ns/xri/xrd-1.0'>",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 7,
      "text": "<Subject>http://example.com/xy</Subject>",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 7,
      "text": "<Property type='http://spec.example.net/color'>red</Property>",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 7,
      "text": "<Link rel='hub'\n href='http://example.com/another/hub' />",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 5,
      "text": "  <Link rel='author'\n   href='http://example.com/john' />\n</XRD>",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Together, the information available about the individual resource (presented as an Extensible Resource Descriptor (XRD) document for illustration purposes) is:",
      "ja": "一緒に、個々のリソース（イラストの目的で拡張可能なリソース記述子（XRD）ドキュメントとして提示される）について利用可能な情報は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "<?xml version='1.0' encoding='UTF-8'?>\n<XRD xmlns='http://docs.oasis-open.org/ns/xri/xrd-1.0'>",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "<Subject>http://example.com/xy</Subject>",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "<Property type='http://spec.example.net/color'>red</Property>",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "<Link rel='hub'\n href='http://example.com/hub' />",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "<Link rel='hub'\n href='http://example.com/another/hub' />",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "<Link rel='author'\n href='http://example.com/john' />",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "<Link rel='author'\n href='http://example.com/author?q=http%3A%2F%2Fexample.com%2Fxy' />",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "</XRD>",
      "ja": "</xrd>"
    },
    {
      "indent": 3,
      "text": "Note that the order of links matters and is based on their original order in the host-meta and LRDD documents. For example, the \"hub\" link obtained from the host-meta link template has a higher priority than the link found in the LRDD document because the host-meta link appears before the \"lrdd\" link.",
      "ja": "リンクの順序が重要であり、ホストメタおよびLRDDドキュメントの元の注文に基づいていることに注意してください。たとえば、ホストメタリンクテンプレートから取得した「ハブ」リンクは、「LRDD」リンクの前にホストメタリンクが表示されるため、LRDDドキュメントで見つかったリンクよりも優先度が高くなります。"
    },
    {
      "indent": 3,
      "text": "On the other hand, the \"author\" link found in the LRDD document has a higher priority than the link found in the host-meta document because it appears after the \"lrdd\" link.",
      "ja": "一方、LRDDドキュメントにある「著者」リンクは、「LRDD」リンクの後に表示されるため、ホストメタドキュメントで見つかったリンクよりも優先度が高くなります。"
    },
    {
      "indent": 0,
      "text": "1.2. Notational Conventions",
      "section_title": true,
      "ja": "1.2. 表記規則"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "キーワードは「必須」、「必要」、「必須」、「shall」、「shall \"、\" bood \"、\" low \"not\"、 \"becommended\"、 \"bodement\"、 \"\"、 \"、\" optional「このドキュメントでは、[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 3,
      "text": "This document uses the Augmented Backus-Naur Form (ABNF) notation of [RFC5234]. Additionally, the following rules are included from [RFC3986]: reserved, unreserved, and pct-encoded.",
      "ja": "このドキュメントでは、[RFC5234]の拡張されたBackus-Naurフォーム（ABNF）表記を使用しています。さらに、[RFC3986]から次のルールが含まれています：予約、予約されていない、およびPCTエンコード。"
    },
    {
      "indent": 0,
      "text": "2. Obtaining host-meta Documents",
      "section_title": true,
      "ja": "2. ホストメタドキュメントの取得"
    },
    {
      "indent": 3,
      "text": "The client obtains the host-meta document for a given host by sending an HTTP [RFC2616] or an HTTPS [RFC2818] GET request to the host for the \"/.well-known/host-meta\" path, using the default ports defined for each protocol (e.g., port 80 for HTTP and port 443 for HTTPS). The scope and meaning of host-meta documents obtained via other protocols or ports is undefined.",
      "ja": "クライアントは、HTTP [RFC2616]またはHTTPS [RFC2818]を送信することにより、特定のホストのホストメタドキュメントを取得します。各プロトコルについて（例：HTTPのポート80、HTTPSのポート443）。他のプロトコルまたはポートを介して取得されたホストメタドキュメントの範囲と意味は未定義です。"
    },
    {
      "indent": 3,
      "text": "The server MUST support at least one protocol but MAY support both. If both protocols are supported, they MUST produce the same document.",
      "ja": "サーバーは少なくとも1つのプロトコルをサポートする必要がありますが、両方をサポートする場合があります。両方のプロトコルがサポートされている場合、同じドキュメントを作成する必要があります。"
    },
    {
      "indent": 3,
      "text": "The decision as to which protocol is used to obtain the host-meta document has significant security ramifications, as described in Section 5.",
      "ja": "セクション5で説明されているように、ホストメタドキュメントの取得にどのプロトコルが使用されるかについての決定には、重要なセキュリティの影響があります。"
    },
    {
      "indent": 3,
      "text": "For example, the following request is used to obtain the host-meta document for the 'example.com' host:",
      "ja": "たとえば、「Example.com」ホストのホストメタドキュメントを取得するために、次のリクエストが使用されます。"
    },
    {
      "indent": 5,
      "text": "GET /.well-known/host-meta HTTP/1.1 Host: example.com",
      "ja": "get/.well-nking/host-meta http/1.1ホスト：example.com"
    },
    {
      "indent": 3,
      "text": "If the server response indicates that the host-meta resource is located elsewhere (a 301, 302, or 307 response status code), the client SHOULD try to obtain the resource from the location provided in the response. This means that the host-meta document for one host MAY be retrieved from another host. Likewise, if the resource is not available or does not exist (e.g., a 404 or 410 response status code), the client SHOULD infer that metadata is not available via this mechanism.",
      "ja": "サーバーの応答が、ホストメタリソースが他の場所にあることを示している場合（301、302、または307応答ステータスコード）、クライアントは応答に記載されている場所からリソースを取得しようとする必要があります。これは、1つのホストのホストメタドキュメントが別のホストから取得される可能性があることを意味します。同様に、リソースが利用できない、または存在しない場合（たとえば、404または410の応答ステータスコード）、クライアントはこのメカニズムを介してメタデータが利用できないと推測する必要があります。"
    },
    {
      "indent": 3,
      "text": "The host-meta document SHOULD be served with the \"application/xrd+xml\" media type.",
      "ja": "ホストメタドキュメントには、「アプリケーション/XRD XML」メディアタイプを添えてください。"
    },
    {
      "indent": 0,
      "text": "3. The host-meta Document",
      "section_title": true,
      "ja": "3. ホストメタドキュメント"
    },
    {
      "indent": 3,
      "text": "The host-meta document uses the XRD 1.0 document format as defined by [OASIS.XRD-1.0], which provides a simple and extensible XML-based schema for describing resources. This specification defines additional processing rules needed to describe hosts. Documents MAY include any elements included in the XRD 1.0 schema that are not explicitly excluded by this specification.",
      "ja": "Host-Metaドキュメントでは、[oasis.xrd-1.0]で定義されたXRD 1.0ドキュメント形式を使用します。これは、リソースを記述するためのシンプルで拡張可能なXMLベースのスキーマを提供します。この仕様では、ホストを記述するために必要な追加の処理ルールを定義します。ドキュメントには、この仕様で明示的に除外されないXRD 1.0スキーマに含まれる要素が含まれる場合があります。"
    },
    {
      "indent": 3,
      "text": "The server MAY offer alternative representations of any XRD document it serves (host-meta, LRDD, or other XRD-based documents). The client MAY request a particular representation using the HTTP \"Accept\" request header field. If no \"Accept\" request header field is included with the request, or if the client requests an \"application/xrd+xml\" representation, the server MUST respond using the REQUIRED XRD 1.0 XML representation described in Section 3.1.",
      "ja": "サーバーは、提供するXRDドキュメント（Host-Meta、LRDD、またはその他のXRDベースのドキュメント）の代替表現を提供する場合があります。クライアントは、HTTP「Accept」要求ヘッダーフィールドを使用して特定の表現を要求する場合があります。「受け入れる」要求ヘッダーフィールドがリクエストに含まれていない場合、またはクライアントが「アプリケーション/XRD XML」表現を要求する場合、サーバーはセクション3.1で説明されている必要なXRD 1.0 XML表現を使用して応答する必要があります。"
    },
    {
      "indent": 3,
      "text": "Applications using the host-meta document MAY require the server to provide a specific alternative representation in addition to the XRD 1.0 XML representation when explicitly requested by the client.",
      "ja": "Host-Metaドキュメントを使用するアプリケーションでは、クライアントが明示的に要求した場合、XRD 1.0 XML表現に加えて、サーバーが特定の代替表現を提供する必要があります。"
    },
    {
      "indent": 3,
      "text": "A JavaScript Object Notation (JSON) Resource Descriptor, known as JRD, is described in Appendix A. It is RECOMMENDED that servers offer the JRD representation in addition to the XRD representation.",
      "ja": "JAVAScriptオブジェクト表記（JSON）リソース記述子は、JRDとして知られています。付録Aに記載されています。Serversは、XRD表現に加えてJRD表現を提供することをお勧めします。"
    },
    {
      "indent": 0,
      "text": "3.1. XML Document Format",
      "section_title": true,
      "ja": "3.1. XMLドキュメント形式"
    },
    {
      "indent": 3,
      "text": "The host-meta document root MUST be an \"XRD\" element. The document SHOULD NOT include a \"Subject\" element, as at this time no URI is available to identify hosts. The use of the \"Alias\" element in host-meta is undefined and NOT RECOMMENDED.",
      "ja": "ホストメタドキュメントルートは、「XRD」要素でなければなりません。この時点では、ホストを識別するためにURIが利用できないため、ドキュメントには「サブジェクト」要素を含めるべきではありません。ホストメタでの「エイリアス」要素の使用は未定義であり、推奨されません。"
    },
    {
      "indent": 3,
      "text": "The subject (or \"context IRI\", as defined by [RFC5988]) of the XRD \"Property\" and \"Link\" elements is the host described by the host-meta document. However, the subject of \"Link\" elements with a \"template\" attribute is the individual resource whose URI is applied to the link template, as described in Section 3.1.1.",
      "ja": "XRD「プロパティ」および「リンク」要素の主題（または[RFC5988]で定義されている「Context IRI」）は、ホスト-Metaドキュメントで説明されているホストです。ただし、セクション3.1.1で説明されているように、「テンプレート」属性を持つ「リンク」要素の主題は、URIがリンクテンプレートに適用される個々のリソースです。"
    },
    {
      "indent": 0,
      "text": "3.1.1. The \"Link\" Element",
      "section_title": true,
      "ja": "3.1.1. 「リンク」要素"
    },
    {
      "indent": 3,
      "text": "The XRD \"Link\" element, when used with the \"href\" attribute, conveys a link relation between the host described by the document and a common target URI.",
      "ja": "XRDの「リンク」要素は、「HREF」属性とともに使用される場合、ドキュメントで記述されたホストと共通のターゲットURI間のリンク関係を伝えます。"
    },
    {
      "indent": 3,
      "text": "For example, the following link declares a common copyright license for the entire scope:",
      "ja": "たとえば、次のリンクは、範囲全体の一般的な著作権ライセンスを宣言します。"
    },
    {
      "indent": 5,
      "text": "<Link rel='copyright' href='http://example.com/copyright' />",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "However, a \"Link\" element with a \"template\" attribute conveys a relation whose context is an individual resource within the host-meta document scope, and whose target is constructed by applying the context resource URI to the template. The template string MAY contain a URI string without any variables to represent a resource-level relation that is identical for every individual resource.",
      "ja": "ただし、「テンプレート」属性を持つ「リンク」要素は、コンテキストがホストメタドキュメント範囲内の個々のリソースであり、コンテキストリソースURIをテンプレートに適用することにより構築される関係を伝えます。テンプレート文字列には、すべての個々のリソースと同一のリソースレベルの関係を表す変数なしのURI文字列を含めることができます。"
    },
    {
      "indent": 3,
      "text": "For example, a blog with multiple authors can provide information about each article's author by providing an endpoint with a parameter set to the URI of each article. Each article has a unique author, but all share the same pattern of where that information is located:",
      "ja": "たとえば、複数の著者を含むブログは、各記事のURIに設定されたエンドポイントを提供することにより、各記事の著者に関する情報を提供できます。各記事にはユニークな著者がいますが、すべてがその情報がある場所と同じパターンを共有しています。"
    },
    {
      "indent": 5,
      "text": "<Link rel='author'\n template='http://example.com/author?article={uri}' />",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "3.1.1.1. Template Syntax",
      "section_title": true,
      "ja": "3.1.1.1. テンプレート構文"
    },
    {
      "indent": 3,
      "text": "This specification defines a simple template syntax for URI transformation. A template is a string containing brace-enclosed (\"{}\") variable names marking the parts of the string that are to be substituted by the corresponding variable values.",
      "ja": "この仕様は、URI変換のための単純なテンプレート構文を定義します。テンプレートは、対応する変数値に置き換える文字列の部分をマークするブレースXlosed（ \"{{}\"）変数名を含む文字列です。"
    },
    {
      "indent": 3,
      "text": "Before substituting template variables, values MUST be encoded using UTF-8, and any character other than unreserved (as defined by [RFC3986]) MUST be percent-encoded per [RFC3986].",
      "ja": "テンプレート変数を置き換える前に、値はUTF-8を使用してエンコードする必要があり、非予約以外の文字（[RFC3986]で定義されている）は[RFC3986]ごとにエンコードされなければなりません。"
    },
    {
      "indent": 3,
      "text": "This specification defines a single variable -- \"uri\" -- as the entire context resource URI. Protocols MAY define additional relation-specific variables and syntax rules, but SHOULD only do so for protocol-specific relation types, and MUST NOT change the meaning of the \"uri\" variable. If a client is unable to successfully process a template (e.g., unknown variable names, unknown or incompatible syntax), the parent \"Link\" element SHOULD be ignored.",
      "ja": "この仕様では、コンテキストリソースURI全体として、単一の変数「URI」を定義します。プロトコルは、追加の関係固有の変数と構文ルールを定義する場合がありますが、プロトコル固有の関係タイプに対してのみそれを行うべきであり、「URI」変数の意味を変更してはなりません。クライアントがテンプレートを正常に処理できない場合（例：不明な変数名、不明または互換性のない構文など）、親の「リンク」要素は無視する必要があります。"
    },
    {
      "indent": 3,
      "text": "The template syntax ABNF follows:",
      "ja": "テンプレートの構文ABNFは次のとおりです。"
    },
    {
      "indent": 4,
      "text": "URI-Template =  *( uri-char / variable )\nvariable     =  \"{\" var-name \"}\"\nuri-char     =  ( reserved / unreserved / pct-encoded )\nvar-name     =  %x75.72.69 / ( 1*var-char ) ; \"uri\" or other names\nvar-char     =  ALPHA / DIGIT / \".\" / \"_\"",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "For example:",
      "ja": "例えば："
    },
    {
      "indent": 4,
      "text": "Input:    http://example.com/r?f=1\nTemplate: http://example.org/?q={uri}\nOutput:   http://example.org/?q=http%3A%2F%2Fexample.com%2Fr%3Ff%3D1",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "4. Processing host-meta Documents",
      "section_title": true,
      "ja": "4. ホストメタドキュメントの処理"
    },
    {
      "indent": 3,
      "text": "Once the host-meta document has been obtained, the client processes its content based on the type of information desired: host-wide or resource-specific.",
      "ja": "ホストメタドキュメントが取得されると、クライアントは、ホスト全体またはリソース固有の情報のタイプに基づいてコンテンツを処理します。"
    },
    {
      "indent": 3,
      "text": "Clients usually look for a link with a specific relation type or other attributes. In such cases, the client does not need to process the entire host-meta document and all linked LRDD documents, but instead process the various documents in their prescribed order until the desired information is found.",
      "ja": "クライアントは通常、特定の関係タイプまたは他の属性を持つリンクを探します。そのような場合、クライアントは、ホストメタドキュメント全体とリンクされたすべてのLRDDドキュメント全体を処理する必要はありませんが、代わりに、目的の情報が見つかるまで、規定の順序でさまざまなドキュメントを処理します。"
    },
    {
      "indent": 3,
      "text": "Protocols using host-meta must indicate whether the information they seek is host-wide or resource-specific -- for example, \"obtain the first host-meta resource-specific link using the 'author' relation type\". If both types are used for the same purpose (e.g., first look for resource-specific, then look for host-wide), the protocol must specify the processing order.",
      "ja": "ホストメタを使用したプロトコルは、「著者」関係タイプを使用して「最初のホストメタリソース固有のリンクを取得する」など、ホスト全体またはリソース固有の情報があるかリソース固有であるかを示す必要があります。両方のタイプが同じ目的に使用される場合（例えば、最初にリソース固有を探してから、ホスト全体を探します）、プロトコルは処理順序を指定する必要があります。"
    },
    {
      "indent": 0,
      "text": "4.1. Host-Wide Information",
      "section_title": true,
      "ja": "4.1. ホスト全体の情報"
    },
    {
      "indent": 3,
      "text": "When looking for host-wide information, the client MUST ignore any \"Link\" elements with a \"template\" attribute, as well as any link using the \"lrdd\" relation type. All other elements are scoped as host-wide.",
      "ja": "ホスト全体の情報を探している場合、クライアントは「テンプレート」属性を持つ「リンク」要素と、「LRDD」関係タイプを使用したリンクを無視する必要があります。他のすべての要素は、ホスト全体としてスコープされています。"
    },
    {
      "indent": 0,
      "text": "4.2. Resource-Specific Information",
      "section_title": true,
      "ja": "4.2. リソース固有の情報"
    },
    {
      "indent": 3,
      "text": "Unlike host-wide information, which is contained solely within the host-meta document, resource-specific information is obtained from host-meta link templates, as well as from linked LRDD documents.",
      "ja": "ホストメタドキュメント内にのみ含まれるホスト全体の情報とは異なり、リソース固有の情報は、リンクされたLRDDドキュメントからホスト-Metaリンクテンプレートから取得されます。"
    },
    {
      "indent": 3,
      "text": "When looking for resource-specific information, the client constructs a resource descriptor by collecting and processing all the host-meta link templates. For each link template:",
      "ja": "リソース固有の情報を探すとき、クライアントはすべてのホストメタリンクテンプレートを収集および処理することにより、リソース記述子を構築します。各リンクテンプレートについて："
    },
    {
      "indent": 3,
      "text": "1. The client applies the URI of the desired resource to the template, producing a resource-specific link.",
      "ja": "1. クライアントは、目的のリソースのURIをテンプレートに適用し、リソース固有のリンクを作成します。"
    },
    {
      "indent": 3,
      "text": "2. If the link's relation type is other than \"lrdd\", the client adds the link to the resource descriptor in order.",
      "ja": "2. リンクの関係タイプが「LRDD」以外の場合、クライアントはリソース記述子にリンクを順番に追加します。"
    },
    {
      "indent": 3,
      "text": "3. If the link's relation type is \"lrdd\":",
      "ja": "3. リンクの関係タイプが「LRDD」の場合："
    },
    {
      "indent": 7,
      "text": "3.1. The client obtains the LRDD document by following the scheme-specific rules for the LRDD document URI. If the document URI scheme is \"http\" or \"https\", the document is obtained via an HTTP \"GET\" request to the identified URI. If the HTTP response status code is 301, 302, or 307, the client MUST follow the redirection response and repeat the request with the provided location.",
      "ja": "3.1. クライアントは、LRDDドキュメントURIのスキーム固有のルールに従ってLRDDドキュメントを取得します。ドキュメントURIスキームが「HTTP」または「HTTPS」の場合、文書は識別されたURIへのHTTP「取得」要求を介して取得されます。HTTP応答ステータスコードが301、302、または307の場合、クライアントはリダイレクト応答に従い、提供された場所でリクエストを繰り返す必要があります。"
    },
    {
      "indent": 7,
      "text": "3.2. The client adds any links found in the LRDD document to the resource descriptor in order, except for any link using the \"lrdd\" relation type (processing is limited to a single level of inclusion). When adding links, the client SHOULD retain any extension attributes and child elements if present (e.g., <Property> or <Title> elements).",
      "ja": "3.2. クライアントは、「LRDD」関係タイプを使用したリンクを除き、LRDDドキュメントで見つかったリンクをリソース記述子に順番に追加します（処理は単一レベルの包含に限定されます）。リンクを追加する場合、クライアントは存在する場合は拡張属性と子要素を保持する必要があります（例：<property>または<title>要素）。"
    },
    {
      "indent": 7,
      "text": "3.3. The client adds any resource properties found in the LRDD document to the resource descriptor in order (e.g., <Alias> or <Property> child elements of the LRDD document <XRD> root element).",
      "ja": "3.3. クライアントは、LRDDドキュメントで見つかったリソースプロパティをリソース記述子に追加します（例：<Alias>または<プロパティ> LRDDドキュメント<XRD>ルート要素の子要素）。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "The host-meta document is designed to be used by other applications explicitly \"opting-in\" to use the facility. Therefore, any such application MUST review the specific security implications of using host-meta documents. By itself, this specification does not provide any protections or guarantees that any given host-meta document is under the control of the appropriate entity as required by each application.",
      "ja": "Host-Metaドキュメントは、他のアプリケーションで使用されるように設計されています。したがって、そのようなアプリケーションは、ホストメタドキュメントを使用することの特定のセキュリティへの影響を確認する必要があります。それ自体、この仕様は、各アプリケーションで要求されるように、特定のホストメタドキュメントが適切なエンティティの管理下にあることを保護したり保証したりしません。"
    },
    {
      "indent": 3,
      "text": "The metadata returned by the host-meta resource is presumed to be under the control of the appropriate authority and representative of all the resources described by it. If this resource is compromised or otherwise under the control of another party, it may represent a risk to the security of the server and data served by it, depending on the applications using it.",
      "ja": "ホストメタリソースによって返されたメタデータは、適切な権限の管理下にあり、それによって記述されたすべてのリソースの代表者であると推定されます。このリソースが侵害されているか、他の当事者の管理下にある場合、それを使用しているアプリケーションに応じて、サーバーのセキュリティとそれが提供するデータのセキュリティに対するリスクを表す可能性があります。"
    },
    {
      "indent": 3,
      "text": "Applications utilizing the host-meta document where the authenticity of the information is necessary MUST require the use of the HTTPS protocol and MUST NOT produce a host-meta document using other means. In addition, such applications MUST require that any redirection leading to the retrieval of a host-meta document also utilize the HTTPS protocol.",
      "ja": "情報の信頼性が必要なホストメタドキュメントを利用するアプリケーションは、HTTPSプロトコルの使用を必要とする必要があり、他の手段を使用してホストメタドキュメントを作成してはなりません。さらに、このようなアプリケーションは、ホストメタドキュメントの取得につながるリダイレクトがHTTPSプロトコルも利用することを要求する必要があります。"
    },
    {
      "indent": 3,
      "text": "Since the host-meta document is authoritative for the entire host, not just the authority (combination of scheme, host, and port) of the host-meta document server, applications MUST ensure that using a host-meta document for another URI authority does not represent a potential security exploit.",
      "ja": "ホストメタドキュメントは、ホストメタドキュメントサーバーの当局（スキーム、ホスト、ポートの組み合わせ）だけでなく、ホスト全体に対して権威あるため、アプリケーションは別のURI機関にホストメタドキュメントを使用することを確認する必要があります。潜在的なセキュリティのエクスプロイトを表すものではありません。"
    },
    {
      "indent": 3,
      "text": "Protocols using host-meta templates must evaluate the construction of their templates as well as any protocol-specific variables or syntax to ensure that the templates cannot be abused by an attacker. For example, a client can be tricked into following a malicious link due to a poorly constructed template that produces unexpected results when its variable values contain unexpected characters.",
      "ja": "ホストメタテンプレートを使用したプロトコルは、テンプレートの構築と、プロトコル固有の変数または構文を評価して、攻撃者がテンプレートを乱用できないことを確認する必要があります。たとえば、クライアントは、変数値に予期しない文字が含まれている場合に予期しない結果を生成するテンプレートが不十分なテンプレートのために、悪意のあるリンクを追跡するようにトリックにすることができます。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAの考慮事項"
    },
    {
      "indent": 0,
      "text": "6.1. The \"host-meta\" Well-Known URI",
      "section_title": true,
      "ja": "6.1. 「ホストメタ」はよく知られています"
    },
    {
      "indent": 3,
      "text": "This specification registers the \"host-meta\" well-known URI in the Well-Known URI Registry as defined by [RFC5785].",
      "ja": "この仕様は、[RFC5785]で定義されているように、よく知られているURIレジストリの「ホストメタ」のよく知られたURIを登録します。"
    },
    {
      "indent": 3,
      "text": "URI suffix: host-meta",
      "ja": "URIサフィックス：ホストメタ"
    },
    {
      "indent": 3,
      "text": "Change controller: IETF",
      "ja": "Change Controller：IETF"
    },
    {
      "indent": 3,
      "text": "Specification document(s): RFC 6415",
      "ja": "仕様文書：RFC 6415"
    },
    {
      "indent": 3,
      "text": "Related information: The \"host-meta\" documents obtained from the same host using the HTTP and HTTPS protocols (using default ports) MUST be identical.",
      "ja": "関連情報：HTTPおよびHTTPSプロトコル（デフォルトポートを使用）を使用して同じホストから取得した「ホストメタ」ドキュメントは同一でなければなりません。"
    },
    {
      "indent": 0,
      "text": "6.2. The \"host-meta.json\" Well-Known URI",
      "section_title": true,
      "ja": "6.2. 「Host-Meta.json」というよく知られたURI"
    },
    {
      "indent": 3,
      "text": "This specification registers the \"host-meta.json\" well-known URI in the Well-Known URI Registry as defined by [RFC5785].",
      "ja": "この仕様は、[RFC5785]で定義されているように、よく知られているURIレジストリの「Host-Meta.json」のよく知られたURIを登録します。"
    },
    {
      "indent": 3,
      "text": "URI suffix: host-meta.json",
      "ja": "URIサフィックス：HOST-META.JSON"
    },
    {
      "indent": 3,
      "text": "Change controller: IETF",
      "ja": "Change Controller：IETF"
    },
    {
      "indent": 3,
      "text": "Specification document(s): RFC 6415",
      "ja": "仕様文書：RFC 6415"
    },
    {
      "indent": 3,
      "text": "Related information: The \"host-meta.json\" documents obtained from the same host using the HTTP and HTTPS protocols (using default ports) MUST be identical.",
      "ja": "関連情報：HTTPおよびHTTPSプロトコル（デフォルトポートを使用）を使用して同じホストから取得した「HOST-META.JSON」ドキュメントは同一でなければなりません。"
    },
    {
      "indent": 0,
      "text": "6.3. The \"lrdd\" Relation Type",
      "section_title": true,
      "ja": "6.3. 「LRDD」関係タイプ"
    },
    {
      "indent": 3,
      "text": "This specification registers the \"lrdd\" relation type in the Link Relation Type Registry defined by [RFC5988]:",
      "ja": "この仕様は、[RFC5988]で定義されたリンク関係タイプレジストリの「LRDD」関係タイプを登録します。"
    },
    {
      "indent": 3,
      "text": "Relation Name: lrdd",
      "ja": "関係名：LRDD"
    },
    {
      "indent": 3,
      "text": "Description: Refers to further information about the link's context, expressed as a LRDD (\"Link-based Resource Descriptor Document\") resource. See RFC 6415 for information about processing this relation type in host-meta documents. When used elsewhere, it refers to additional links and other metadata. Multiple instances indicate additional LRDD resources. LRDD resources MUST have an \"application/xrd+xml\" representation, and MAY have others.",
      "ja": "説明：LRDD（「リンクベースのリソース記述子ドキュメント」）リソースとして表現されたリンクのコンテキストに関する詳細情報を参照してください。ホストメタドキュメントのこの関係タイプの処理については、RFC 6415を参照してください。他の場所で使用する場合、追加のリンクやその他のメタデータを指します。複数のインスタンスが追加のLRDDリソースを示しています。LRDDリソースには、「アプリケーション/XRD XML」表現が必要であり、他のものがある場合があります。"
    },
    {
      "indent": 3,
      "text": "Reference: RFC 6415",
      "ja": "参照：RFC 6415"
    },
    {
      "indent": 0,
      "text": "Appendix A. JRD Document Format",
      "section_title": true,
      "ja": "付録A. JRDドキュメント形式"
    },
    {
      "indent": 3,
      "text": "The JRD document format -- a general-purpose XRD 1.0 representation -- uses the JavaScript Object Notation (JSON) format defined in [RFC4627]. JRD uses the same elements and processing rules described in Section 3.1. The JRD format is designed to include the same base functionality provided by the XML format, with the exception of extensibility, as extensibility is beyond the scope of this specification.",
      "ja": "JRDドキュメント形式（汎用XRD 1.0表現）は、[RFC4627]で定義されているJavaScriptオブジェクト表記（JSON）形式を使用します。JRDは、セクション3.1で説明した同じ要素と処理ルールを使用します。JRD形式は、拡張性がこの仕様の範囲を超えているため、拡張性を除き、XML形式で提供される同じベース機能を含めるように設計されています。"
    },
    {
      "indent": 3,
      "text": "The client MAY request a JRD representation using the HTTP \"Accept\" request header field with a value of \"application/json\". The server MUST include the HTTP \"Content-Type\" response header field with a value of \"application/json\". Any other \"Content-Type\" value (or lack thereof) indicates that the server does not support the JRD format.",
      "ja": "クライアントは、「Application/JSON」の値でHTTP「Accept」要求ヘッダーフィールドを使用してJRD表現を要求できます。サーバーには、「アプリケーション/JSON」の値を持つHTTP「コンテンツタイプ」応答ヘッダーフィールドを含める必要があります。他の「コンテンツタイプ」値（またはその欠如）は、サーバーがJRD形式をサポートしていないことを示しています。"
    },
    {
      "indent": 3,
      "text": "Alternatively, the client MAY request a JRD representation by requesting the \"host-meta.json\" well-known document, by making a GET request for \"/.well-known/host-meta.json\", following the same process used for \"/.well-known/host-meta\". If the server does not support serving a JRD representation at this location, the server MUST respond with an HTTP 404 (Not Found) status code.",
      "ja": "あるいは、クライアントは、「HOST-Meta.json」の有名なドキュメントを要求することにより、JRDの表現を要求することができます。「/.Well-Nownd/Host-meta」。サーバーがこの場所でJRD表現の提供をサポートしていない場合、サーバーはHTTP 404（見つからない）ステータスコードで応答する必要があります。"
    },
    {
      "indent": 3,
      "text": "XRD elements are serialized into a JSON object as follows:",
      "ja": "XRD要素は、次のようにJSONオブジェクトにシリアル化されます。"
    },
    {
      "indent": 3,
      "text": "o The XML document declaration and \"XRD\" element are discarded.",
      "ja": "o XMLドキュメント宣言と「XRD」要素は破棄されます。"
    },
    {
      "indent": 3,
      "text": "o The \"Subject\" element is included as a name/value pair with the name 'subject', and value included as a string.",
      "ja": "o 「サブジェクト」要素は、「件名」という名前の名前/値ペアとして含まれ、文字列として含まれる値が含まれています。"
    },
    {
      "indent": 3,
      "text": "o The \"Expires\" element is included as a name/value pair with the name 'expires', and value included as a string.",
      "ja": "o 「有効期限」要素は、「有効期限が切れる」という名前の名前/値のペアとして含まれ、文字列として含まれる値が含まれています。"
    },
    {
      "indent": 3,
      "text": "o \"Alias\" elements are included as a single name/value pair with the name 'aliases', and value a string array containing the values of each element in order.",
      "ja": "o 「エイリアス」要素は、「エイリアス」という名前の単一名/値ペアとして含まれ、各要素の値を順番に含む文字列アレイを値にします。"
    },
    {
      "indent": 3,
      "text": "o \"Property\" elements are included as a single name/value pair with the name 'properties', and value an object with each element included as a name/value pair with the value of the \"type\" attribute as name, and element value included as a string value. The values of properties with empty values (i.e., using the REQUIRED \"xsi:nil='true'\" attribute) are included as null. If more than one \"Property\" element is present with the same \"type\" attribute, only the last instance is included.",
      "ja": "o 「プロパティ」要素は、「プロパティ」という名前の単一名/値ペアとして含まれ、「タイプ」属性の値を持つ名前/値のペアとして含まれる各要素を持つオブジェクトと、含まれる要素値を含むオブジェクトが含まれます文字列値として。空の値を持つプロパティの値（つまり、必要な「xsi：nil = 'true' \"属性を使用する）がnullとして含まれています。複数の「プロパティ」要素が同じ「タイプ」属性を備えている場合、最後のインスタンスのみが含まれています。"
    },
    {
      "indent": 3,
      "text": "o \"Link\" elements are included as a single name/value pair with the name 'links', and value an array with each element included as an object. Each attribute is included as a name/value pair with the attribute name as name, and value included as a string.",
      "ja": "o 「リンク」要素は、「リンク」という名前の単一名/値ペアとして含まれ、各要素をオブジェクトとして含む配列を値に値します。各属性は、属性名を名前として名前/値ペアとして、文字列として含まれる値として含まれています。"
    },
    {
      "indent": 3,
      "text": "o \"Link\" child \"Property\" elements are included using the same method as XRD-level \"Property\" elements using a name/value pair inside the link object.",
      "ja": "o 「リンク「子」プロパティ」要素は、XRDレベルの「プロパティ」要素と同じ方法を使用して、リンクオブジェクト内の名前/値ペアを使用して含まれます。"
    },
    {
      "indent": 3,
      "text": "o \"Link\" child \"Title\" elements are included as a single object with the name 'titles', and value an object with each element included as a name/value pair with the value of the \"xml:lang\" attribute as name, and element value included as a string value. The names of elements without an \"xml:lang\" attribute are added with the name 'default'. If more than one \"Title\" element is present with the same (or no) \"xml:lang\" attribute, only the last instance is included.",
      "ja": "o 「link \"child\"タイトル \"要素は、「タイトル」という名前の単一オブジェクトとして含まれ、「xml：lang」属性の値を持つ名前/値のペアとして含まれる各要素を持つオブジェクトをhalueし、そして文字列値として含まれる要素値。「xml：lang」属性のない要素の名前は、「デフォルト」という名前で追加されます。複数の「タイトル」要素が同じ（またはno） \"xml：lang\"属性で存在する場合、最後のインスタンスのみが含まれています。"
    },
    {
      "indent": 3,
      "text": "o The conversion of any other element is left undefined.",
      "ja": "o 他の要素の変換は未定義のままです。"
    },
    {
      "indent": 3,
      "text": "For example, the following XRD document...",
      "ja": "たとえば、次のXRDドキュメント..."
    },
    {
      "indent": 4,
      "text": "<?xml version='1.0' encoding='UTF-8'?>\n<XRD xmlns='http://docs.oasis-open.org/ns/xri/xrd-1.0'\n     xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'>",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "<Subject>http://blog.example.com/article/id/314</Subject>\n<Expires>2010-01-30T09:30:00Z</Expires>",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "<Alias>http://blog.example.com/cool_new_thing</Alias>\n<Alias>http://blog.example.com/steve/article/7</Alias>",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "<Property type='http://blgx.example.net/ns/version'>1.2</Property>\n<Property type='http://blgx.example.net/ns/version'>1.3</Property>\n<Property type='http://blgx.example.net/ns/ext' xsi:nil='true' />",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "<Link rel='author' type='text/html'\n      href='http://blog.example.com/author/steve'>\n  <Title>About the Author</Title>\n  <Title xml:lang='en-us'>Author Information</Title>\n  <Property type='http://example.com/role'>editor</Property>\n</Link>",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "<Link rel='author' href='http://example.com/author/john'>\n  <Title>The other guy</Title>\n  <Title>The other author</Title>\n</Link>",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "  <Link rel='copyright'\n        template='http://example.com/copyright?id={uri}' />\n</XRD>",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "...is represented by the following JRD document:",
      "ja": "...次のJRDドキュメントで表されます。"
    },
    {
      "indent": 4,
      "text": "{ \"subject\":\"http://blog.example.com/article/id/314\", \"expires\":\"2010-01-30T09:30:00Z\",",
      "ja": "{\"subject\"： \"http://blog.example.com/article/id/314\"、 \"expires\"： \"2010-01-30t09：30：00z\"、"
    },
    {
      "indent": 6,
      "text": "\"aliases\":[ \"http://blog.example.com/cool_new_thing\", \"http://blog.example.com/steve/article/7\"],",
      "ja": "「エイリアス」：[\"http://blog.example.com/cool_new_thing\"、 \"http://blog.example.com/steve/article/7\"]、"
    },
    {
      "indent": 6,
      "text": "\"properties\":{ \"http://blgx.example.net/ns/version\":\"1.3\", \"http://blgx.example.net/ns/ext\":null },",
      "ja": "「プロパティ」：{\"http://blgx.example.net/ns/version\":1.3\"、 \"http://blgx.example.net/ns/ext\":null}、"
    },
    {
      "indent": 4,
      "text": "  \"links\":[\n    {\n      \"rel\":\"author\",\n      \"type\":\"text/html\",\n      \"href\":\"http://blog.example.com/author/steve\",\n      \"titles\":{\n        \"default\":\"About the Author\",\n        \"en-us\":\"Author Information\"\n      },\n      \"properties\":{\n        \"http://example.com/role\":\"editor\"\n      }\n    },\n    {\n      \"rel\":\"author\",\n      \"href\":\"http://example.com/author/john\",\n      \"titles\":{\n        \"default\":\"The other author\"\n      }\n    },\n    {\n      \"rel\":\"copyright\",\n      \"template\":\"http://example.com/copyright?id={uri}\"\n    }\n  ]\n}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Note that the \"Subject\" and \"Alias\" elements are NOT RECOMMENDED in the context of host-meta documents, and are included in the example for completeness only.",
      "ja": "「サブジェクト」および「エイリアス」要素は、ホストメタドキュメントのコンテキストでは推奨されず、完全性のみの例にのみ含まれていることに注意してください。"
    },
    {
      "indent": 0,
      "text": "Appendix B. Acknowledgments",
      "section_title": true,
      "ja": "付録B. 謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to acknowledge the contributions of everyone who provided feedback and use cases for this specification -- in particular, Dirk Balfanz, DeWitt Clinton, Eve Maler, Breno de Medeiros, Brad Fitzpatrick, James Manger, Will Norris, Mark Nottingham, John Panzer, Drummond Reed, and Peter Saint-Andre.",
      "ja": "著者は、この仕様にフィードバックとユースケースを提供したすべての人の貢献を認めたいと考えています。特に、Dirk Balfanz、Dewitt Clinton、Eve Maler、Breno de Medeiros、Brad Fitzpatrick、James Manger、Will Norris、Mark Nottingham、JohnPanzer、Drummond Reed、Peter Saint-Andre。"
    },
    {
      "indent": 0,
      "text": "Normative References",
      "ja": "引用文献"
    },
    {
      "indent": 3,
      "text": "[OASIS.XRD-1.0] Hammer-Lahav, E., Ed., and W. Norris, Ed., \"Extensible Resource Descriptor (XRD) Version 1.0\", November 2010, <http://docs.oasis-open.org/xri/xrd/v1.0/xrd-1.0.html>.",
      "ja": "[oasis.xrd-1.0] Hammer-Lahav、E.、ed。、およびW. Norris、ed。、 \"Extensible Resource Descriptor（XRD）バージョン1.0\"、2010年11月、<http：//docs.oasis-open。org/xri/xrd/v1.0/xrd-1.0.html>。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119] Bradner、S。、「要件レベルを示すためにRFCで使用するためのキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2616] Fielding, R., Gettys, J., Mogul, J., Frystyk, H., Masinter, L., Leach, P., and T. Berners-Lee, \"Hypertext Transfer Protocol -- HTTP/1.1\", RFC 2616, June 1999.",
      "ja": "[RFC2616] Fielding、R.、Gettys、J.、Mogul、J.、Frystyk、H.、Masinter、L.、Leach、P。、およびT. Berners-Lee、「HyperText Transfer Protocol-HTTP/1.1」、RFC 2616、1999年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC2818] Rescorla, E., \"HTTP Over TLS\", RFC 2818, May 2000.",
      "ja": "[RFC2818] Rescorla、E。、「TLS上のHTTP」、RFC 2818、2000年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC3986] Berners-Lee, T., Fielding, R., and L. Masinter, \"Uniform Resource Identifier (URI): Generic Syntax\", STD 66, RFC 3986, January 2005.",
      "ja": "[RFC3986] Berners-Lee、T.、Fielding、R。、およびL. Masinter、「Uniform Resource Identifier（URI）：Generic Syntax」、Std 66、RFC 3986、2005年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC4627] Crockford, D., \"The application/json Media Type for JavaScript Object Notation (JSON)\", RFC 4627, July 2006.",
      "ja": "[RFC4627] Crockford、D。、「JavaScriptオブジェクト表記（JSON）のアプリケーション/JSONメディアタイプ」、RFC 4627、2006年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC5234] Crocker, D., Ed., and P. Overell, \"Augmented BNF for Syntax Specifications: ABNF\", STD 68, RFC 5234, January 2008.",
      "ja": "[RFC5234] Crocker、D.、ed。、およびP. Overell、「構文仕様のためのBNFの増強」、STD 68、RFC 5234、2008年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC5785] Nottingham, M. and E. Hammer-Lahav, \"Defining Well-Known Uniform Resource Identifiers (URIs)\", RFC 5785, April 2010.",
      "ja": "[RFC5785] Nottingham、M。およびE. Hammer-Lahav、「有名なユニフォームリソース識別子（URI）の定義」、RFC 5785、2010年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC5988] Nottingham, M., \"Web Linking\", RFC 5988, October 2010.",
      "ja": "[RFC5988]ノッティンガム、M。、「Web Linking」、RFC 5988、2010年10月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Eran Hammer-Lahav (editor)",
      "ja": "Eran Hammer-Lahav（編集者）"
    },
    {
      "indent": 3,
      "text": "EMail: eran@hueniverse.com\nURI:   http://hueniverse.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Blaine Cook",
      "ja": "ブレインクック"
    },
    {
      "indent": 3,
      "text": "EMail: romeda@gmail.com\nURI:   http://romeda.org",
      "raw": true,
      "ja": ""
    }
  ]
}