{
  "title": {
    "text": "RFC 6730 - Requirements for IETF Nominations Committee Tools",
    "ja": "RFC 6730 - IETF指名委員会ツールの要件"
  },
  "number": 6730,
  "created_at": "2019-10-29 23:48:49.492727+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                       S. Krishnan\nRequest for Comments: 6730                                    J. Halpern\nCategory: Informational                                         Ericsson\nISSN: 2070-1721                                           September 2012",
      "raw": true
    },
    {
      "indent": 11,
      "text": "Requirements for IETF Nominations Committee Tools",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document defines the requirements for a set of tools for use by the IETF Nominations Committee.",
      "ja": "この文書は、IETF指名委員会で使用するためのツールのセットのための要件を定義します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 IESGによって承認されていないすべての文書がインターネットStandardのどんなレベルの候補です。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6730.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6730で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2012 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2012 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n   1.1. Conventions Used in This Document ..........................2\n2. Meta Requirement ................................................2\n3. Authentication ..................................................3\n4. Security and Access Control .....................................3\n5. Nominations .....................................................4\n6. Accepting and Declining Nominations .............................5\n7. Questionnaires ..................................................6\n8. Feedback Collection .............................................7\n9. Security Considerations .........................................8\n10. Acknowledgements ...............................................8\n12. Normative References ...........................................8\nAppendix A. Example for Key Generation .............................9",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The IETF Nominations Committee (NomCom) is a body that selects candidates for open IESG, IAB, and IAOC positions following the process outlined in [RFC3777]. There is a need for a set of tools to aid the NomCom in efficient operation. This document presents a set of requirements for such a tool.",
      "ja": "IETF指名委員会（NomCom）は[RFC3777]に概略を示す方法以下オープンIESG、IAB、およびIAOC位置の候補を選択する本体です。効率的な運用にNomComを支援するツールのセットが必要です。この文書では、そのようなツールのための要件のセットを提示します。"
    },
    {
      "indent": 0,
      "text": "1.1. Conventions Used in This Document",
      "section_title": true,
      "ja": "1.1. このドキュメントの表記規則"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. Meta Requirement",
      "section_title": true,
      "ja": "2.メタ要件"
    },
    {
      "indent": 3,
      "text": "There is an existing tool for supporting NomCom work. The set of requirements specified in this document are mainly enhancement requirements or behavioral changes to the existing tool. Unless otherwise stated, all of the current functions of the existing NomCom tool need to be supported in the new tool as well.",
      "ja": "NomComの作業を支援するための既存のツールがあります。この文書で指定された要件のセットが主に強化要件や既存のツールに行動の変化です。特に明記しない限り、既存のNomComツールの現在の機能のすべてが同様に新しいツールでサポートする必要があります。"
    },
    {
      "indent": 3,
      "text": "o META-001: The tool MUST provide all the functionality that is provided by the current NomCom tool, except in cases where a requirement specified in this document overrides a current behavior. The current NomCom tool can be found at the following URLs: https://www.ietf.org/group/nomcom/2012/private/ displays the NomCom private parts of the tool (Private NomCom tool) and https://www.ietf.org/group/nomcom/2012/ displays the community member accessible parts of the tool (Public NomCom tool).",
      "ja": "META-001 O：ツールは、この文書で指定された要件は、現在の動作をオーバーライドする場合を除き、現在のNomComツールによって提供されるすべての機能を提供しなければなりません。現在NomComツールは、次のURLで参照できます。https://www.ietf.org/group/nomcom/2012/private/はNomComプライベートツール（プライベートNomComツール）の一部とhttpsを表示：// WWW。 ietf.org/group/nomcom/2012/は、ツール（公開NomComツール）のコミュニティメンバーアクセス可能パーツが表示されます。"
    },
    {
      "indent": 0,
      "text": "3. Authentication",
      "section_title": true,
      "ja": "3.認証"
    },
    {
      "indent": 3,
      "text": "All access to NomCom tools needs to be authenticated. Users of the tools have different privileges based on their role. The tool needs to support at least three levels of access: community member, NomCom member, and NomCom chair. The levels of access are set up by the staff of the IETF Secretariat. It is to be noted that the Secretariat staff do not have any access to the tool. They are responsible for administering the server on which the tool runs; hence, they set up the access control list for the tool.",
      "ja": "NomComツールへのすべてのアクセスは、認証する必要があります。ツールのユーザーは、自分の役割に基づいて異なる権限を持っています。コミュニティメンバー、NomComメンバー、およびNomComチェア：ツールは、アクセスの少なくとも三つのレベルをサポートする必要があります。アクセスのレベルは、IETF事務局の職員によって設定されています。これは、事務局のスタッフが、ツールへのアクセスを持っていないことに留意すべきです。彼らは、ツールを実行するサーバーを管理する責任があります。それゆえ、彼らはツールのアクセス制御リストを設定します。"
    },
    {
      "indent": 3,
      "text": "Community member access is applicable to the Public NomCom tool. The NomCom member access and the NomCom chair access are applicable to the Private NomCom tool. NomCom members can use the interfaces on the Public NomCom tool in the community member role. The NomCom chair access authentication applies to the private webpage in the same fashion as a NomCom member, with the additional ability to update the information on both webpages (i.e., what is visible in the various forms, the templates for the automatic emails, etc.).",
      "ja": "コミュニティメンバーアクセスは公共NomComツールに適用されます。 NomComメンバーのアクセスとNomComの椅子へのアクセスは、プライベートNomComツールに適用されます。 NomComメンバーがコミュニティメンバーの役割で公開NomComツールのインターフェイスを使用することができます。 NomCom椅子のアクセス認証は、両方のウェブページ（すなわち、どのような様々な形で表示され、自動的に電子メールのテンプレートなどの情報を更新する追加機能で、NomComメンバーと同じ方法で、プライベートのWebページに適用されます）。"
    },
    {
      "indent": 3,
      "text": "o AUTH-001: The tool MUST allow members of the community to log in with their existing datatracker.ietf.org credentials.",
      "ja": "O AUTH-001：ツールは、コミュニティのメンバーは、既存のdatatracker.ietf.org認証情報でログインを許可する必要があります。"
    },
    {
      "indent": 3,
      "text": "o AUTH-002: The tool MUST allow members of the community to create a new login using the datatracker.ietf.org login system.",
      "ja": "AUTH-002 O：ツールは、コミュニティのメンバーがdatatracker.ietf.orgのログインシステムを使用して新しいログインを作成することを可能にしなければなりません。"
    },
    {
      "indent": 3,
      "text": "o AUTH-003: The tool MUST allow the secretariat to enter the email address of the NomCom chair and to enter a list of email addresses of the NomCom members. The logins associated with these email addresses MUST be accorded the respective roles.",
      "ja": "O AUTH-003：ツールは、事務局がNomCom議長のメールアドレスを入力すると、NomComメンバーの電子メールアドレスのリストを入力することができなければなりません。これらのメールアドレスに関連付けられているログインがそれぞれの役割を与えられる必要があります。"
    },
    {
      "indent": 0,
      "text": "4. Security and Access Control",
      "section_title": true,
      "ja": "4.セキュリティとアクセス制御"
    },
    {
      "indent": 3,
      "text": "All communication between the community and the NomCom and amongst the members of the NomCom needs to be stored in an encrypted form. This information can only be accessed by members of the NomCom.",
      "ja": "コミュニティとNomComの間とNomComのメンバー間のすべての通信が暗号化された形式で格納する必要があります。この情報は、NomComのメンバーによってアクセスすることができます。"
    },
    {
      "indent": 3,
      "text": "o SEC-001: The security procedures for the tool MUST be structured so that even system administrators do not have routine or accidental visibility to any data accumulated by the tool. This data includes all confidential feedback and discussions.",
      "ja": "O SEC-001：でも、システム管理者がツールによって蓄積されたデータへのルーチンまたは偶発可視性を持っていないように、ツールのセキュリティ手続きは構造化されなければなりません。このデータは、すべての機密情報のフィードバックや議論を含んでいます。"
    },
    {
      "indent": 3,
      "text": "o SEC-002: The tool MUST allow the NomCom chair to input a public key (\"NomCom public key\"). This key is generated by the NomCom chair independent of the tool, for example, using the procedure described in Appendix A.",
      "ja": "SEC-002 O：ツールは、入力した公開鍵（「NomCom公開鍵を」）NomComの椅子を許容しなければなりません。このキーは、付録Aに記載の手順を使用して、例えば、工具のNomComチェア独立して生成されます"
    },
    {
      "indent": 3,
      "text": "o SEC-003: All communication sent to the NomCom mailing list MUST be encrypted with the NomCom public key before being committed to persistent storage.",
      "ja": "O SEC-003：NomComメーリングリストに送信されたすべての通信は、永続ストレージにコミットされる前に、NomCom公開鍵で暗号化されなければなりません。"
    },
    {
      "indent": 3,
      "text": "o SEC-004: All community feedback entered using the NomCom tool MUST be encrypted with the NomCom public key before being committed to persistent storage.",
      "ja": "O SEC-004：すべてのコミュニティからのフィードバックは、永続ストレージにコミットされる前に、NomCom公開鍵で暗号化されなければならないNomComツールを使用して入力しました。"
    },
    {
      "indent": 3,
      "text": "o SEC-005: After logging in, the tool MUST allow the NomCom members to input a private key (\"NomCom private key\") that corresponds to the NomCom public key. This key will be used to decrypt the feedback/communications that the member is trying to access. Once entered, this key MUST be available for the entire length of the session until the user logs out. This private key MUST NOT be stored in plaintext form into persistent storage at any point of time.",
      "ja": "SEC-005 O：ログインした後、ツールは、入力にNomCom公開鍵に対応する秘密鍵（「NomCom秘密鍵」）をNomComメンバーを許容しなければなりません。このキーは、メンバーがアクセスしようとしているフィードバック/通信を復号化するために使用されます。一度入力したユーザがログアウトするまで、このキーは、セッションの全体の長さのために利用可能でなければなりません。この秘密鍵は、時間の任意の時点で永続ストレージに平文形式で保存されてはなりません。"
    },
    {
      "indent": 3,
      "text": "o SEC-006: The tool MUST provide a mechanism for the NomCom Chair to destroy all data collected by the NomCom at the end of the NomCom's term. Since the NomCom's term overlaps with that of the next year's NomCom, the tool MUST ensure that data collected by the next year's NomCom is not affected by this deletion.",
      "ja": "O SEC-006：ツールは、NomCom議長がNomComの期間の終了時にNomComによって収集されたすべてのデータを破壊するためのメカニズムを提供しなければなりません。 NomComの任期は来年のNomComのそれと重なっているので、このツールは、来年のNomComによって収集されたデータは、この削除によって影響を受けないことを保証しなければなりません。"
    },
    {
      "indent": 0,
      "text": "5. Nominations",
      "section_title": true,
      "ja": "5.ノミネート"
    },
    {
      "indent": 3,
      "text": "After the NomCom is constituted, the NomCom chair issues a call for nominations for the open positions. There are two broad ways in which nominees are introduced into the system. The predominant way is that nominations are entered into the system directly by members of the community. The secondary way is that the nominees are entered in by members of the NomCom. The main difference is that members of the NomCom can enter nominations that are originated by other community members. In both of the cases, an email address for the nominee needs to be entered into the tool. Please note that NomCom members usually use the Public NomCom tool, not the Private NomCom tool, to enter their personal nominations and comments.",
      "ja": "NomComが構成された後、NomCom議長は、オープンポジションのノミネートのための呼び出しを発行します。候補者がシステムに導入されている二つの大きな方法があります。主な方法は、指名を直接コミュニティのメンバーによってシステムに入力されていることです。第二の方法は、候補者がNomComのメンバーによってで入力されていることです。主な違いは、NomComのメンバーは、他のコミュニティメンバーによって発信されている指名を入力することができるということです。いずれの場合も、候補者のための電子メールアドレスをツールに入力する必要があります。 NomComメンバーは通常、彼らの個人的な推薦やコメントを入力するには、プライベートNomComツール、公共NomComツールを使用していないことに注意してください。"
    },
    {
      "indent": 3,
      "text": "o NOM-001: The tool MUST allow members of the community to enter nominations into the Public NomCom tool.",
      "ja": "NOM-001 O：ツールは、コミュニティのメンバーが公開NomComツールにノミネートを入力することができなければなりません。"
    },
    {
      "indent": 3,
      "text": "o NOM-002: The tool MUST allow members of the NomCom to enter nominations into the Private NomCom tool. The tool MUST allow the NomCom member to optionally enter information about the originator of the nomination. The tool MUST record the identity of the originator (if known) of the nomination for audit purposes. Note that anonymous nominations are allowed; thus, the actual identity of an originator may not always be entered into the tool.",
      "ja": "OのNOM-002：ツールは、NomComのメンバーがプライベートNomComツールにノミネートを入力することができなければなりません。ツールはNomCom部材が任意に指名の発信元に関する情報を入力できるようにしなければなりません。このツールは、監査目的のために指名の（既知の場合）発信者の身元を記録しなければなりません。匿名のノミネートが許可されていることに注意してください。このように、発信者の実際のアイデンティティは、常にツールに入力することはできません。"
    },
    {
      "indent": 3,
      "text": "o NOM-003: The tool MUST allow the NomCom chair to specify information that is required for the nominations. This information will be entered by the NomCom chair as freeform text and will be presented to the individual performing the nomination.",
      "ja": "NOM-003 O：このツールは、NomCom議長が指名するために必要な情報を指定することができなければなりません。この情報は、自由形式のテキストとしてNomCom議長によって入力され、指名を行い、個々に提示されます。"
    },
    {
      "indent": 3,
      "text": "o NOM-004: The tool MUST email the nominee after the nomination and mention the position(s) that they have been nominated for. This email MUST NOT disclose to the nominee the identity of the person who performed the nomination.",
      "ja": "NOM-004 O：ツールは、彼らがためにノミネートされたことを位置（複数可）を指名した後、候補者に電子メールを送り、言及する必要があります。このメールは、候補者に指名を行った人物の身元を開示してはなりません。"
    },
    {
      "indent": 3,
      "text": "o NOM-005: The tool MUST allow the content of this email to be customized by the NomCom chair.",
      "ja": "O NOM-005：ツールは、このメールの内容はNomCom議長がカスタマイズすることを許可する必要があります。"
    },
    {
      "indent": 3,
      "text": "o NOM-006: The tool MUST automatically attach the questionnaires for the positions for which the nominee has been nominated to this email.",
      "ja": "O NOM-006：ツールが自動的に候補者がこのメールにノミネートされた位置のためのアンケートを添付しなければなりません。"
    },
    {
      "indent": 3,
      "text": "o NOM-007: The tool MUST be able to identify duplicate nominations of the same person with the same email address and consolidate them to point to the same nominee.",
      "ja": "NOM-007 O：このツールは、同じメールアドレスを持つ同一人物の重複指名を特定し、同じ候補者を指すように、それらを統合することができなければなりません。"
    },
    {
      "indent": 3,
      "text": "o NOM-008: In case the same person has been nominated multiple times using different email addresses, the tool MUST allow the NomCom chair to mark duplicate nominations of the same person and consolidate them to point to the same nominee.",
      "ja": "O NOM-008：同じ人が別のメールアドレスを使用して、複数回ノミネートされている場合は、このツールは、NomCom議長が同一人物の重複指名をマークし、同じ候補者を指すように、それらを統合することを可能にしなければなりません。"
    },
    {
      "indent": 3,
      "text": "o NOM-009: The tool MUST allow a communication email address for a nominee to be set to one different than the email address with which they were nominated.",
      "ja": "O NOM-009：候補者は、彼らがノミネートされたときのメールアドレスとは異なるものに設定するためのツールは、通信、電子メールアドレスを許容しなければなりません。"
    },
    {
      "indent": 3,
      "text": "o NOM-010: The tool MUST be able to use the datatracker address book system as the basis for requirements NOM-007, NOM-008, and NOM-009 but MUST allow the NomCom chair to perform manual overrides.",
      "ja": "O NOM-010：ツールは、要件NOM-007、NOM-008、およびNOM-009のための基礎としてdatatrackerアドレス帳のシステムを使用することができなければならないが、NomComの椅子は手動オーバーライドを行うことを可能にしなければなりません。"
    },
    {
      "indent": 3,
      "text": "o NOM-011: The tool MUST keep track of the accept and decline status for the nominees.",
      "ja": "NOM-011 O：このツールは、候補者のために受け入れて、衰退の状態を追跡する必要があります。"
    },
    {
      "indent": 0,
      "text": "6. Accepting and Declining Nominations",
      "section_title": true,
      "ja": "6.指名を受け入れ、衰退"
    },
    {
      "indent": 3,
      "text": "After receiving the nomination mail, nominees usually respond to indicate either that they accept the nomination or that they are unwilling to do so.",
      "ja": "指名のメールを受信した後、候補者は通常、彼らが指名を受け入れること、または、彼らはそうすることが望まないことを示すために応答します。"
    },
    {
      "indent": 3,
      "text": "o AD-001: The tool MUST allow nominees to indicate whether they are accepting or declining their nomination. This is preferably done by providing distinct hyperlinks in the email that the nominees receive.",
      "ja": "AD-001 O：このツールは、候補者は、彼らが彼らの指名を受諾または減少しているかどうかを示すために許容しなければなりません。これは、好ましくは、候補者が受け取る電子メールでの個別のハイパーリンクを提供することによって行われます。"
    },
    {
      "indent": 3,
      "text": "o AD-002: The tool MUST allow the NomCom chair to select specific email responses from the nominees and flag them as having been accepted or declined.",
      "ja": "AD-002 O：受け入れまたは拒否されたようなツールは、候補者、フラグ、それらを特定の電子メールからの応答を選択するために、NomComの椅子を許容しなければなりません。"
    },
    {
      "indent": 3,
      "text": "o AD-003: The tool MUST allow the NomCom chair to manually flag nominees as having accepted or declined the nomination without the need for any nominee action.",
      "ja": "O AD-003：承認または任意の候補者のアクションを必要とせずに指名を辞退したとツールを手動フラグ候補者にNomCom椅子を可能にしなければなりません。"
    },
    {
      "indent": 3,
      "text": "o AD-004: The tool MUST allow NomCom members to view the list of all nominees along with their accept or decline status.",
      "ja": "O AD-004：ツールは、NomComメンバーが受け入れるか拒否ステータスとともに、すべての候補者のリストを表示することができなければなりません。"
    },
    {
      "indent": 3,
      "text": "o AD-005: The tool MUST allow NomCom members to view reports of the accept or decline status both per nominee as well as per open position.",
      "ja": "O AD-005：ツールは、NomComメンバーが開位置ごとだけでなく、候補者ごとに承諾または辞退状態の両方のレポートを表示することを可能にしなければなりません。"
    },
    {
      "indent": 3,
      "text": "o AD-006: The tool MUST be configurable to send reminder mails to all nominees who have not responded, either on specified dates or at specified intervals. The contents of the reminder mails MUST be customizable by the NomCom chair.",
      "ja": "AD-006 O：このツールは、指定した日付に、または指定した間隔でいずれか、応答していないすべての候補者にリマインダーメールを送信するために構成可能でなければなりません。リマインダーメールの内容は、NomCom議長によってカスタマイズでなければなりません。"
    },
    {
      "indent": 3,
      "text": "o AD-007: The tool MUST be able to generate a summary report containing statistics (total/accept/decline/no response) concerning nominations by position.",
      "ja": "O AD-007：ツールは、位置によって指名に関する統計情報を含む要約レポート（合計/受諾/減少/応答なし）を生成することができなければなりません。"
    },
    {
      "indent": 0,
      "text": "7. Questionnaires",
      "section_title": true,
      "ja": "7.アンケート"
    },
    {
      "indent": 3,
      "text": "Nominees fill in a questionnaire for each position for which they accept a nomination. The completed questionnaire is sent in by email to the NomCom mailing list. If a person has been nominated for multiple positions, they may elect to send in a combined questionnaire for a subset (or all) of the positions (QR-002) or fill in one questionnaire per open position (QR-006).",
      "ja": "候補者は、彼らが指名を受諾する各位置のためのアンケートに記入します。完成したアンケートは、NomComメーリングリストに電子メールで送られてきています。人が複数の位置にノミネートされている場合は、位置（QR-002）のサブセット（または全て）のために結合アンケートに送信したり、開いた位置ごとにアンケート（QR-006）を埋めるために選ぶことができます。"
    },
    {
      "indent": 3,
      "text": "o QR-001: The tool MUST allow the NomCom chair to enter a different questionnaire for each open position.",
      "ja": "QR-001 O：このツールは、NomCom議長が開いている各位置ごとに異なるアンケートを入力することができなければなりません。"
    },
    {
      "indent": 3,
      "text": "o QR-002: The tool MUST allow the NomCom chair to point to email responses from the nominees and flag them as questionnaires.",
      "ja": "O QR-002：ツールは、NomCom議長がアンケートとして候補者とフラグそれらをからの応答を電子メールで送信するために指すように許容しなければなりません。"
    },
    {
      "indent": 3,
      "text": "o QR-003: The tool MUST allow NomCom members to directly access questionnaires completed by nominees.",
      "ja": "O QR-003：ツールは、NomComメンバーが直接候補者によって完成したアンケートにアクセスすることを許容しなければなりません。"
    },
    {
      "indent": 3,
      "text": "o QR-004: The tool MUST keep track of the questionnaire receipt status for the nominees. The completed questionnaires are received as emails to the NomCom mailing list.",
      "ja": "QR-004 O：このツールは、候補者のためのアンケート受信ステータスを追跡する必要があります。完成したアンケートは、NomComメーリングリストへの電子メールとして受信されています。"
    },
    {
      "indent": 3,
      "text": "o QR-005: Like all other correspondence on the NomCom mailing list, the completed questionnaires MUST be encrypted by the NomCom public key before being stored.",
      "ja": "QR-005 O：NomComメーリングリスト上の他のすべての対応と同様に、完成したアンケートは、格納される前にNomCom公開鍵で暗号化されなければなりません。"
    },
    {
      "indent": 3,
      "text": "o QR-006: The NomCom chair MUST be able to flag an email as the completed questionnaire for a nominee corresponding to a specific open position.",
      "ja": "QR-006 O：NomCom椅子は、特定の開位置に対応する候補者のための完了アンケートとして電子メールフラグすることができなければなりません。"
    },
    {
      "indent": 3,
      "text": "o QR-007: Once flagged, the questionnaire provided by the nominee for a specific position MUST be directly accessible without needing to look through all other feedback received for that nominee.",
      "ja": "O QR-007：一度フラグを立て、特定の位置のための候補者が提供するアンケートは、他のすべてのフィードバックによってその候補者のために受信見る必要がなく、直接アクセスできる必要があります。"
    },
    {
      "indent": 0,
      "text": "8. Feedback Collection",
      "section_title": true,
      "ja": "8.フィードバックコレクション"
    },
    {
      "indent": 3,
      "text": "Community feedback is very important in the NomCom process. Community feedback about nominees is the primary mechanism by which NomCom members evaluate nominees.",
      "ja": "コミュニティからのフィードバックは、NomComプロセスで非常に重要です。候補者についてのコミュニティからのフィードバックは、NomComメンバーが候補者を評価したことにより、主要なメカニズムです。"
    },
    {
      "indent": 3,
      "text": "o FB-001: The tool MUST allow members of the community to enter feedback about any of the accepting nominees into the Public NomCom tool.",
      "ja": "FB-001 O：ツールは、コミュニティのメンバーが公開NomComツールに受け入れて候補者のいずれかについてのフィードバックを入力できるようにする必要があります。"
    },
    {
      "indent": 3,
      "text": "o FB-002: The tool MUST allow members of the NomCom to enter feedback about any of the accepting nominees into the Private NomCom tool. The tool MUST allow the NomCom member to optionally enter information about the originator of the feedback. Note that, as in NOM-002, anonymous feedback is allowed; thus, the actual identity of an originator may not always be entered into the tool.",
      "ja": "FB-002 O：このツールは、NomComのメンバーがプライベートNomComツールに受け入れて候補者のいずれかについてのフィードバックを入力できるようにする必要があります。ツールはNomCom部材が任意にフィードバックの発信元に関する情報を入力できるようにしなければなりません。 NOM-002のように、匿名のフィードバックが許可されている、ということに注意してください。このように、発信者の実際のアイデンティティは、常にツールに入力することはできません。"
    },
    {
      "indent": 3,
      "text": "o FB-003: The tool MUST allow NomCom members to view feedback entered for each nominee. The identity of the submitter should also be visible with the feedback, unless the submitter wishes to be anonymous.",
      "ja": "FB-003 O：NomComメンバーがフィードバックを表示できるようにしなければならないツールでは、各候補者のために入りました。提出者は匿名を希望しない限り、提出者の身元はまた、フィードバックを表示する必要があります。"
    },
    {
      "indent": 3,
      "text": "o FB-004: The NomCom members MUST be able to enter their interview comments as feedback for the nominee being interviewed.",
      "ja": "FB-004 O：NomComメンバーがインタビューされている候補者のためのフィードバックとして彼らのインタビューのコメントを入力することができなければなりません。"
    },
    {
      "indent": 3,
      "text": "o FB-005: All email received on the NomCom mailing list MUST be archived. This includes all correspondence among the NomCom members, feedback received over email, as well as completed questionnaires.",
      "ja": "FB-005 O：すべての電子メールをアーカイブする必要がありますNomComメーリングリストで受けました。これは、すべてのNomComメンバー間の対応、メールで受け取ったフィードバックだけでなく、完成アンケートを含んでいます。"
    },
    {
      "indent": 3,
      "text": "o FB-006: The tool MUST allow the NomCom chair to manually copy any of the archived mails into the feedback section of one or more nominees for one or more open positions. This is required because a single email may contain feedback concerning more than one nominee or more than one open position.",
      "ja": "FB-006 O：このツールは、NomComの椅子は手動で一つ以上のオープンポジションのための1つまたは複数の候補者のフィードバック部にアーカイブされたメールのいずれかをコピーすることができなければなりません。単一の電子メールが複数の名義人または複数の開いた位置に関するフィードバックが含まれていてもよいので、これが必要です。"
    },
    {
      "indent": 0,
      "text": "9. Security Considerations",
      "section_title": true,
      "ja": "9.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "The tool must authenticate all users and must allow logins to be classified into three roles: NomCom chair, NomCom member, and community member. All communications to/from the NomCom and among members of the NomCom must be stored in an encrypted form.",
      "ja": "このツールは、すべてのユーザーを認証する必要がありますし、ログインは3つの役割に分類することができるようにする必要があります：NomCom議長、NomComメンバー、およびコミュニティメンバー。 /からNomComとNomComのメンバー間の全ての通信は暗号化された形式で格納されなければなりません。"
    },
    {
      "indent": 0,
      "text": "10. Acknowledgements",
      "section_title": true,
      "ja": "10.謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Russ Housley, Barry Leiba, Brian Haberman, Phillip Hallam-Baker, Stewart Bryant, Adrian Farrel, Stephen Farrell, Martin Stiemerling, Benoit Claise, Sean Turner, Ralph Droms, Mary Barnes, Subramanian Moonesamy, and Menachem Dodge for their valuable comments to improve this document.",
      "ja": "著者は、ラスHousley、バリー・レイバ、ブライアンハーバーマン、フィリップハラム - ベイカー、スチュワートブライアント、エードリアンファレル、スティーブン・ファレル、マーティンStiemerling、ブノワClaise、ショーン・ターナー、ラルフDroms、メアリー・バーンズ、サブラマニアンMoonesamy、およびメナヘムダッジに感謝したいと思いますこのドキュメントを改善するための貴重なコメント。"
    },
    {
      "indent": 0,
      "text": "12. Normative References",
      "section_title": true,
      "ja": "12.引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3777] Galvin, J., Ed., \"IAB and IESG Selection, Confirmation, and Recall Process: Operation of the Nominating and Recall Committees\", BCP 10, RFC 3777, June 2004.",
      "ja": "[RFC3777]ガルビン、J.、エド、 \"IABとIESGの選択、確認、およびリコール処理：指名とリコール委員会の操作\"。、BCP 10、RFC 3777、2004年6月。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Example for Key Generation",
      "ja": "鍵生成のための付録A.例"
    },
    {
      "indent": 3,
      "text": "The NomCom chair generates a public/private key pair to be used to encrypt NomCom correspondence and feedback. As an example, the NomCom chair can use openssl to generate the key pair using the following commands:",
      "ja": "NomComの椅子は、NomCom対応やフィードバックを暗号化するために使用される公開鍵/秘密鍵のペアを生成します。例として、NomComの椅子には、以下のコマンドを使用して、鍵ペアを生成するためにOpenSSLを使用することができます。"
    },
    {
      "indent": 3,
      "text": "First, the config file for openssl needs to be created with the following contents (example for the 2012-2013 NomCom).",
      "ja": "まず、OpenSSLのための設定ファイルには、次のような内容（2012-2013 NomComのための一例）を使用して作成する必要があります。"
    },
    {
      "indent": 0,
      "text": "[ req ] distinguished_name = req_distinguished_name string_mask = utf8only x509_extensions = ss_v3_ca",
      "ja": "[REQ] distinguished_name = req_distinguished_name string_mask = utf8only x509_extensions = ss_v3_ca"
    },
    {
      "indent": 0,
      "text": "[ req_distinguished_name ] commonName = Common Name (e.g., NomComYY) commonName_default = NomCom12",
      "ja": "【req_distinguished_name] commonNameの=共通名（例えば、NomComYY）commonName_default = NomCom12"
    },
    {
      "indent": 0,
      "text": "[ ss_v3_ca ]",
      "ja": "[ss_v3_ca]"
    },
    {
      "indent": 0,
      "text": "subjectKeyIdentifier = hash keyUsage = critical, digitalSignature, keyEncipherment, dataEncipherment basicConstraints = critical, CA:true subjectAltName = email:nomcom12@ietf.org extendedKeyUsage= emailProtection",
      "ja": "subjectKeyIdentifier =ハッシュのkeyUsage =クリティカル、デジタル署名、keyEncipherment、dataEncipherment basicConstraintsの=クリティカル、CA：真のsubjectAltName =電子メール：nomcom12@ietf.org extendedKeyUsageの= emailProtection"
    },
    {
      "indent": 0,
      "text": "# modify the email address to match the year.",
      "ja": "＃年に合わせて、電子メールアドレスを変更します。"
    },
    {
      "indent": 22,
      "text": "Figure 1: nomcom-config.cnf",
      "ja": "図1：nomcom-config.cnf"
    },
    {
      "indent": 3,
      "text": "Then the following command needs to be issued in order to generate the private key and the certificate.",
      "ja": "そして、次のコマンドは、秘密鍵と証明書を生成するために発行する必要があります。"
    },
    {
      "indent": 3,
      "text": "$ openssl req -config nomcom-config.cnf -x509 -new -newkey rsa:2048 -sha256 -days 730 -nodes -keyout privateKey.pem -out nomcom12.cert",
      "ja": "$ののopenssl reqを-config nomcom-config.cnf -x509 -new -newkey RSA：2048 -sha256 -days 730 -nodes -keyout privateKey.pem -out nomcom12.cert"
    },
    {
      "indent": 3,
      "text": "The certificate can then be provided to the tool in order to extract the public key.",
      "ja": "証明書は、公開鍵を抽出するために、ツールに提供することができます。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Suresh Krishnan Ericsson 8400 Blvd Decarie Town of Mount Royal, Quebec Canada",
      "ja": "スレシュクリシュナンエリクソンマウントロイヤル、ケベック州、カナダの8400ブルバードDecarieタウン"
    },
    {
      "indent": 3,
      "text": "EMail: suresh.krishnan@ericsson.com",
      "ja": "メールアドレス：suresh.krishnan@ericsson.com"
    },
    {
      "indent": 3,
      "text": "Joel Halpern Ericsson",
      "ja": "ジョエル・ハルパーンエリクソン"
    },
    {
      "indent": 3,
      "text": "EMail: joel.halpern@ericsson.com",
      "ja": "メールアドレス：joel.halpern@ericsson.com"
    }
  ]
}