{
  "title": {
    "text": "RFC 6690 - Constrained RESTful Environments (CoRE) Link Format",
    "ja": "RFC 6690 - 制約付きRESTfulな環境（コア）リンク・フォーマット"
  },
  "number": 6690,
  "created_at": "2019-10-29 06:15:17.340469+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         Z. Shelby\nRequest for Comments: 6690                                     Sensinode\nCategory: Standards Track                                    August 2012\nISSN: 2070-1721",
      "raw": true
    },
    {
      "indent": 10,
      "text": "Constrained RESTful Environments (CoRE) Link Format",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This specification defines Web Linking using a link format for use by constrained web servers to describe hosted resources, their attributes, and other relationships between links. Based on the HTTP Link Header field defined in RFC 5988, the Constrained RESTful Environments (CoRE) Link Format is carried as a payload and is assigned an Internet media type. \"RESTful\" refers to the Representational State Transfer (REST) architecture. A well-known URI is defined as a default entry point for requesting the links hosted by a server.",
      "ja": "この仕様は、ホストされたリソース、その属性、およびリンク間の他の関係を記述するように制約のWebサーバで使用するためのリンク形式を使用してWebリンクを定義します。 RFC 5988で定義されたHTTPリンクヘッダフィールドに基づいて、制約のRESTful環境（コア）リンクフォーマットは、ペイロードとして運ばれ、インターネット・メディア・タイプが割り当てられています。 \"RESTfulなは\" のRepresentational State Transfer（REST）アーキテクチャを指します。よく知られたURIは、サーバによってホストされているリンクを要求するためのデフォルトのエントリポイントとして定義されます。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6690.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、とどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6690で取得してもよいです。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2012 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2012 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n   1.1. Web Linking in CoRE ........................................3\n   1.2. Use Cases ..................................................4\n        1.2.1. Discovery ...........................................4\n        1.2.2. Resource Collections ................................5\n        1.2.3. Resource Directory ..................................5\n   1.3. Terminology ................................................6\n2. Link Format .....................................................6\n   2.1. Target and Context URIs ....................................8\n   2.2. Link Relations .............................................8\n   2.3. Use of Anchors .............................................9\n3. CoRE Link Attributes ............................................9\n   3.1. Resource Type 'rt' Attribute ...............................9\n   3.2. Interface Description 'if' Attribute ......................10\n   3.3. Maximum Size Estimate 'sz' Attribute ......................10\n4. Well-Known Interface ...........................................10\n   4.1. Query Filtering ...........................................12\n5. Examples .......................................................13\n6. Security Considerations ........................................15\n7. IANA Considerations ............................................16\n   7.1. Well-Known 'core' URI .....................................16\n   7.2. New 'hosts' Relation Type .................................16\n   7.3. New 'link-format' Internet Media Type .....................17\n   7.4. Constrained RESTful Environments (CoRE) Parameters\n        Registry ..................................................18\n8. Acknowledgments ................................................19\n9. References .....................................................20\n   9.1. Normative References ......................................20\n   9.2. Informative References ....................................20",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The Constrained RESTful Environments (CoRE) realizes the Representational State Transfer (REST) architecture [REST] in a suitable form for the most constrained nodes (e.g., 8-bit microcontrollers with limited memory) and networks (e.g., IPv6 over Low-Power Wireless Personal Area Networks (6LoWPANs) [RFC4919]). CoRE is aimed at Machine-to-Machine (M2M) applications such as smart energy and building automation.",
      "ja": "制約のRESTful環境（コア）は、最も制約ノード（限られたメモリと、例えば、8ビットマイクロコントローラ）とネットワークに適した形態（例えば、IPv6を介した低電力無線でのRepresentational State Transfer（REST）のアーキテクチャ[REST]を実現しますパーソナル・エリア・ネットワーク（6LoWPANs）[RFC4919]）コアは、スマートエネルギー、ビル・オートメーションなどのマシン・ツー・マシン（M2M）アプリケーションを目指しています。"
    },
    {
      "indent": 3,
      "text": "The discovery of resources hosted by a constrained server is very important in machine-to-machine applications where there are no humans in the loop and static interfaces result in fragility. The discovery of resources provided by an HTTP [RFC2616] web server is typically called \"Web Discovery\" and the description of relations between resources is called \"Web Linking\" [RFC5988]. In the present specification, we refer to the discovery of resources hosted by a constrained web server, their attributes, and other resource relations as CoRE Resource Discovery.",
      "ja": "拘束されたサーバーでホストされている資源の発見がそこには人間がループでないと静的インタフェースが脆弱になり、マシン・ツー・マシンのアプリケーションで非常に重要です。 HTTP [RFC2616]のウェブサーバによって提供されるリソースの発見は、典型的には、「ウェブディスカバリー」と呼ばれ、リソース間の関係の記述は、「ウェブリンク」[RFC5988]と呼ばれています。なお、本明細書において、我々は、コアリソースの発見などに制約Webサーバ、その属性、および他のリソースの関係によってホストされている資源の発見を参照してください。"
    },
    {
      "indent": 3,
      "text": "The main function of such a discovery mechanism is to provide Universal Resource Identifiers (URIs, called links) for the resources hosted by the server, complemented by attributes about those resources and possible further link relations. In CoRE, this collection of links is carried as a resource of its own (as opposed to HTTP headers delivered with a specific resource). This document specifies a link format for use in CoRE Resource Discovery by extending the HTTP Link Header format [RFC5988] to describe these link descriptions. The CoRE Link Format is carried as a payload and is assigned an Internet media type. A well-known relative URI \"/.well-known/core\" is defined as a default entry point for requesting the list of links about resources hosted by a server and thus performing CoRE Resource Discovery. This specification is applicable for use with Constrained Application Protocol (CoAP) [COAP], HTTP, or any other suitable web transfer protocol. The link format can also be saved in file format.",
      "ja": "こうした発見メカニズムの主な機能は、それらの資源や可能性、さらにリンク関係に関する属性によって補完サーバーによってホストされたリソースのためのユニバーサルリソース識別子（のURIと呼ばれるリンク）を提供することです。 （特定のリソースで配信HTTPヘッダではなく）コアでは、リンクのこのコレクションは、独自のリソースとして行われます。この文書では、これらのリンクの説明を記述するためにHTTPリンクヘッダーの形式[RFC5988]を拡張することにより、コアリソース検出に使用するためのリンク形式を指定します。コアリンクフォーマットは、ペイロードとして運ばれ、インターネットメディアタイプが割り当てられます。よく知られた相対URI「/.well-known/coreは、」サーバーによってホストされているリソースに関するリンクのリストを要求するため、コアリソース検出を実行するためのデフォルトのエントリポイントとして定義されます。本明細書は制約アプリケーションプロトコル（CoAP）COAP]、HTTP、または任意の他の適切なウェブ転送プロトコルとの使用に適用可能です。リンク形式は、ファイル形式で保存することができます。"
    },
    {
      "indent": 0,
      "text": "1.1. Web Linking in CoRE",
      "section_title": true,
      "ja": "1.1. コア内のWebリンク"
    },
    {
      "indent": 3,
      "text": "Technically, the CoRE Link Format is a serialization of a typed link as specified in [RFC5988], used to describe relationships between resources, so-called \"Web Linking\". In this specification, Web Linking is extended with specific constrained M2M attributes; links are carried as a message payload rather than in an HTTP Link Header field, and a default interface is defined to discover resources hosted by a server. This specification also defines a new relation type \"hosts\" (from the verb \"to host\"), which indicates that the resource is hosted by the server from which the link document was requested.",
      "ja": "[RFC5988]で指定されている技術的には、コアリンクのフォーマットが入力されたリンクの直列化され、いわゆる「ウェブリンク」、リソース間の関係を記述するために使用されます。本明細書では、ウェブリンクは、特定の制約M2M属性で拡張されています。リンクは、メッセージペイロードとしてではなく、HTTPリンクヘッダーフィールドで運ばれ、デフォルトのインターフェイスはサーバーによってホストされているリソースを発見するために定義されています。また、この仕様は、リソースがリンク文書が要求されたサーバーによってホストされていることを示しており、（「ホストする」動詞から）新しい関係タイプ「ホスト」を定義します。"
    },
    {
      "indent": 3,
      "text": "In HTTP, the Link Header can be used to carry link information about a resource along with an HTTP response. This works well for the typical use case for a web server and browser, where further information about a particular resource is useful after accessing it. In CoRE, the main use case for Web Linking is the discovery of which resources a server hosts in the first place. Although some resources may have further links associated with them, this is expected to be an exception. For that reason, the CoRE Link Format serialization is carried as a resource representation of a well-known URI. The CoRE Link Format does reuse the format of the HTTP Link Header serialization defined in [RFC5988].",
      "ja": "HTTPでは、リンクヘッダーは、HTTPレスポンスと一緒にリソースに関するリンク情報を運ぶために使用することができます。これは、特定のリソースに関する詳細情報がそれにアクセスした後に有用であるウェブサーバとブラウザ、の典型的なユースケースに適しています。コアでは、ウェブリンクのための主なユースケースは、最初の場所でリソースサーバホストの発見です。いくつかのリソースは、それらに関連するさらなるリンクを持っているかもしれないが、これは例外であることが予想されます。そのため、コアリンクのフォーマットのシリアル化は、よく知られているURIのリソース表現として行われます。コアリンクのフォーマットは、[RFC5988]で定義されたHTTPヘッダーのリンクのシリアライゼーションのフォーマットを再利用しません。"
    },
    {
      "indent": 0,
      "text": "1.2. Use Cases",
      "section_title": true,
      "ja": "1.2. ユースケース"
    },
    {
      "indent": 3,
      "text": "Typical use cases for Web Linking on today's web include, e.g., describing the author of a web page or describing relations between web pages (next chapter, previous chapter, etc.). Web Linking can also be applied to M2M applications, where typed links are used to assist a machine client in finding and understanding how to use resources on a server. In this section a few use cases are described for how the CoRE Link Format could be used in M2M applications. For further technical examples, see Section 5. As there is a large range of M2M applications, these use cases are purposely generic. This specification assumes that different deployments or application domains will define the appropriate REST Interface Descriptions along with Resource Types to make discovery meaningful.",
      "ja": "今日のウェブ上のリンクのWebのための典型的な使用例は、ウェブページの作成者を記述したり、Webページ間の関係（次の章、前の章など）を記述し、例えば、含まれています。ウェブリンクはまた、入力されたリンクは見つけて、サーバー上のリソースを使用する方法を理解する上でのマシンのクライアントを支援するために使用されているM2Mアプリケーションに適用することができます。このセクションでは、いくつかのユースケースは、コアリンクのフォーマットは、M2Mアプリケーションで使用することができる方法のために記載されています。 M2Mアプリケーションの広い範囲があるため、さらに技術的な例については、セクション5を参照してください、これらのユースケースは、意図的に一般的なものです。この仕様は異なる展開やアプリケーションドメインが発見は有意義なものにするリソースの種類と一緒に適切なRESTインターフェイスの説明を定義することを前提としています。"
    },
    {
      "indent": 0,
      "text": "1.2.1. Discovery",
      "section_title": true,
      "ja": "1.2.1. 発見"
    },
    {
      "indent": 3,
      "text": "In M2M applications, for example, home or building automation, there is a need for local clients and servers to find and interact with each other without human intervention. The CoRE Link Format can be used by servers in such environments to enable Resource Discovery of the resources hosted by the server.",
      "ja": "M2Mアプリケーションでは、たとえば、家庭やビルオートメーションのために、見つけると人間の介入なしに互いに相互作用するローカルクライアントとサーバの必要性があります。コアリンクフォーマットは、サーバによってホストされているリソースのリソース検出を可能にするために、このような環境でのサーバーで使用することができます。"
    },
    {
      "indent": 3,
      "text": "Resource Discovery can be performed either unicast or multicast. When a server's IP address is already known, either a priori or resolved via the Domain Name System (DNS) [RFC1034][RFC1035], unicast discovery is performed in order to locate the entry point to the resource of interest. In this specification, this is performed using a GET to \"/.well-known/core\" on the server, which returns a payload in the CoRE Link Format. A client would then match the appropriate Resource Type, Interface Description, and possible media type",
      "ja": "リソース検出は、ユニキャストまたはマルチキャストのいずれかを実行することができます。サーバーのIPアドレスはすでに、先験的のいずれかを知られている、またはドメインネームシステム（DNS）[RFC1034] [RFC1035]を通じて解決されると、ユニキャストの発見は、目的のリソースへのエントリポイントを見つけるために行われます。この仕様では、これは、コアリンク形式でペイロードを返すサーバー、上の「/.well-known/core」にGETを使用して行われます。クライアントは、適切なリソースタイプ、インタフェースの説明、および可能なメディアタイプと一致します"
    },
    {
      "indent": 3,
      "text": "[RFC2045] for its application. These attributes may also be included in the query string in order to filter the number of links returned in a response.",
      "ja": "そのアプリケーションの[RFC2045]。これらの属性は、応答で返されたリンクの数をフィルタリングするために、クエリ文字列に含まれていてもよいです。"
    },
    {
      "indent": 3,
      "text": "Multicast Resource Discovery is useful when a client needs to locate a resource within a limited scope, and that scope supports IP multicast. A GET request to the appropriate multicast address is made for \"/.well-known/core\". In order to limit the number and size of responses, a query string is recommended with the known attributes. Typically, a resource would be discovered based on its Resource Type and/or Interface Description, along with possible application-specific attributes.",
      "ja": "クライアントは、限られた範囲内のリソースを見つける必要があり、その範囲はIPマルチキャストをサポートしている場合、マルチキャストリソース検出に有用です。適切なマルチキャストアドレスへのGET要求は「/.well-known/core」のために作られています。応答の数とサイズを制限するために、クエリ文字列は、既知の属性をお勧めします。通常、リソースは、可能なアプリケーション固有の属性と一緒に、そのリソースタイプおよび/またはインタフェース説明に基づいて発見されるだろう。"
    },
    {
      "indent": 0,
      "text": "1.2.2. Resource Collections",
      "section_title": true,
      "ja": "1.2.2. リソースコレクション"
    },
    {
      "indent": 3,
      "text": "RESTful designs of M2M interfaces often make use of collections of resources. For example, an index of temperature sensors on a data collection node or a list of alarms on a home security controller. The CoRE Link Format can be used to make it possible to find the entry point to a collection and traverse its members. The entry point of a collection would always be included in \"/.well-known/core\" to enable its discovery. The members of the collection can be defined either through the Interface Description of the resource along with a parameter resource for the size of the collection or by using the link format to describe each resource in the collection. These links could be located under \"/.well-known/core\" or hosted, for example, in the root resource of the collection.",
      "ja": "M2MインタフェースのRESTfulな設計では、多くの場合、リソースのコレクションを使用しています。例えば、データ収集ノード上の温度センサのインデックスやホームセキュリティコントローラのアラームのリスト。コアリンクフォーマットは、それが可能コレクションにエントリーポイントを見つけるとそのメンバーを横断するために使用することができます。コレクションのエントリポイントは、常にその発見を可能にするために、「/.well-known/core」に含まれることになります。コレクションのメンバーは、いずれかのコレクションのサイズのパラメータのリソースと共にまたはコレクション内の各リソースを記述するためにリンクの形式を使用してリソースのインターフェイス説明で定義することができます。これらのリンクは、コレクションのルートリソースで、例えば、「/.well-known/core」の下に位置するか、またはホストすることができます。"
    },
    {
      "indent": 0,
      "text": "1.2.3. Resource Directory",
      "section_title": true,
      "ja": "1.2.3. リソースディレクトリ"
    },
    {
      "indent": 3,
      "text": "In many deployment scenarios, for example, constrained networks with sleeping servers or large M2M deployments with bandwidth limited access networks, it makes sense to deploy resource directory entities that store links to resources stored on other servers. Think of this as a limited search engine for constrained M2M resources.",
      "ja": "多くの展開シナリオでは、例えば、睡眠サーバーや帯域幅の制限されたアクセスネットワークを持つ大規模なM2Mの導入とネットワークの制約、それが他のサーバーに保存されたリソースへのリンクを格納したリソースディレクトリの実体を展開する意味があります。制約M2Mリソースの限られた検索エンジンと考えます。"
    },
    {
      "indent": 3,
      "text": "The CoRE Link Format can be used by a server to register resources with a resource directory or to allow a resource directory to poll for resources. Resource registration can be achieved by having each server POST their resources to \"/.well-known/core\" on the resource directory. This, in turn, adds links to the resource directory under an appropriate resource. These links can then be discovered by any client by making a request to a resource directory lookup interface.",
      "ja": "コアリンクフォーマットは、リソースディレクトリにリソースを登録するか、リソースディレクトリにリソースをポーリングできるようにするために、サーバで使用することができます。リソースの登録は、各サーバがリソースディレクトリに「/.well-known/core」にそのリソースをPOST有することによって達成することができます。これは、順番に、適切なリソースの下のリソースディレクトリへのリンクを追加します。これらのリンクは、リソースのディレクトリー検索インターフェースに要求を行うことにより、任意のクライアントによって発見することができます。"
    },
    {
      "indent": 0,
      "text": "1.3. Terminology",
      "section_title": true,
      "ja": "1.3. 用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this specification are to be interpreted as described in [RFC2119].",
      "ja": "この仕様でキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、 \"SHOULD\"、 \"べきではない\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 3,
      "text": "This specification makes use of the Augmented Backus-Naur Form (ABNF) [RFC5234] notation, including the core rules defined in Appendix B of that document.",
      "ja": "この仕様は、拡張バッカス・ナウアフォーム（ABNF）そのドキュメントの付録Bで定義されたコア・ルールを含む[RFC5234]表記を使用します。"
    },
    {
      "indent": 3,
      "text": "This specification requires readers to be familiar with all the terms and concepts that are discussed in [RFC5988] and [RFC6454]. In addition, this specification makes use of the following terminology:",
      "ja": "この仕様は、[RFC5988]及び[RFC6454]に記載されているすべての用語や概念に精通している読者を必要とします。また、この仕様は、次の用語を使用します："
    },
    {
      "indent": 3,
      "text": "Web Linking A framework for indicating the relationships between web resources.",
      "ja": "Webリソース間の関係を示すためのフレームワークをリンクするウェブ。"
    },
    {
      "indent": 3,
      "text": "Link Also called \"typed links\" in [RFC5988]. A link is a typed connection between two resources identified by URI and is made up of a context URI, a link relation type, a target URI, and optional target attributes.",
      "ja": "リンクには、[RFC5988]で「入力されたリンク」と呼ばれます。リンクは、2つのリソースURIによって識別され、コンテキストURIで構成され、リンク関係の種類、ターゲットURI、および任意のターゲット属性の間に型指定された接続です。"
    },
    {
      "indent": 3,
      "text": "Link Format A particular serialization of typed links.",
      "ja": "リンクは、入力されたリンクの特定のシリアライズをフォーマットします。"
    },
    {
      "indent": 3,
      "text": "CoRE Link Format A particular serialization of typed links based on the HTTP Link Header field serialization defined in Section 5 of [RFC5988] but carried as a resource representation with a media type.",
      "ja": "コアリンク形式HTTPリンクヘッダーフィールドシリアライゼーション[RFC5988]のセクション5で定義されるが、メディアタイプのリソース表現として実施に基づいて入力したリンクの特定のシリアライゼーション。"
    },
    {
      "indent": 3,
      "text": "Attribute Properly called \"Target Attribute\" in [RFC5988]. A key/value pair that describes the link or its target.",
      "ja": "属性適切に[RFC5988]で「TARGET属性」と呼ばれます。リンクまたはその目標を説明し、キー/値のペア。"
    },
    {
      "indent": 3,
      "text": "CoRE Resource Discovery When a client discovers the list of resources hosted by a server, their attributes, and other link relations by accessing \"/.well-known/core\".",
      "ja": "コアリソースディスカバリークライアントが「/.well-known/core」をアクセスすることにより、サーバー、それらの属性、およびその他のリンク関係によってホストされているリソースのリストを発見した場合。"
    },
    {
      "indent": 0,
      "text": "2. Link Format",
      "section_title": true,
      "ja": "2.リンク・フォーマット"
    },
    {
      "indent": 3,
      "text": "The CoRE Link Format extends the HTTP Link Header field specified in [RFC5988]. The format does not require special XML or binary parsing, is fairly compact, and is extensible -- all important characteristics for CoRE. It should be noted that this link format is just one serialization of typed links defined in [RFC5988]; others",
      "ja": "コアリンクフォーマットは、[RFC5988]で指定されたHTTPリンクヘッダフィールドを拡張します。特殊なXMLまたはバイナリ解析を必要としないフォーマットは、かなりコンパクトで、かつ拡張可能です - コアのすべての重要な特性。このリンク形式は[RFC5988]で定義された入力されたリンクの一つだけのシリアル化であることに留意すべきです。その他"
    },
    {
      "indent": 3,
      "text": "include HTML links, Atom feed links [RFC4287], or HTTP Link Header fields. It is expected that resources discovered in the CoRE Link Format may also be made available in alternative formats on the greater Internet. The CoRE Link Format is only expected to be supported in constrained networks and M2M systems.",
      "ja": "HTMLリンク、Atomフィードのリンク[RFC4287]、またはHTTPリンクヘッダーフィールドを含みます。コア・リンク・フォーマットで発見されたリソースはまた、より大きなインターネット上の代替フォーマットで利用できるようにすることができることが期待されます。コアリンクフォーマットのみが制約ネットワークやM2Mシステムでサポートされる予定です。"
    },
    {
      "indent": 3,
      "text": "Section 5 of [RFC5988] did not require an Internet media type for the defined link format, as it was defined to be carried in an HTTP header. This specification thus defines the Internet media type 'application/link-format' for the CoRE Link Format (see Section 7.3). Whereas the HTTP Link Header field depends on [RFC2616] for its encoding, the CoRE Link Format is encoded as UTF-8 [RFC3629]. A decoder of the format is not expected to validate UTF-8 encoding (but is not prohibited from doing so) and doesn't need to perform any UTF-8 normalization. UTF-8 data can be compared bitwise, which allows values to contain UTF-8 data without any added complexity for constrained nodes.",
      "ja": "それはHTTPヘッダで運ばれるように定義されたように[RFC5988]のセクション5は、定義されたリンク形式のインターネット・メディア・タイプを必要としませんでした。この仕様は、このようにコア・リンク・フォーマットのためのインターネットメディアタイプ「アプリケーション/リンク形式」を定義します（7.3節を参照してください）。 HTTPリンクヘッダフィールドは、その符号化のために[RFC2616]に依存するのに対して、コア・リンク形式は、UTF-8 [RFC3629]として符号化されます。フォーマットのデコーダは、UTF-8エンコーディングを検証することが期待されていない（しかし、そうすることから禁止されていない）、任意のUTF-8正規化を実行する必要はありません。 UTF-8のデータは、値が制約ノードのための任意の追加の複雑さなしでUTF-8のデータを含むことができ、ビット単位を、比較することができます。"
    },
    {
      "indent": 3,
      "text": "The CoRE Link Format is equivalent to the [RFC5988] link format; however, the ABNF in the present specification is repeated with improvements to be compliant with [RFC5234] and includes new link parameters. The link parameter \"href\" is reserved for use as a query parameter for filtering in this specification (see Section 4.1) and MUST NOT be defined as a link parameter. As in [RFC5988], multiple link descriptions are separated by commas. Note that commas can also occur in quoted strings and URIs but do not end a description. In order to convert an HTTP Link Header field to this link format, first the \"Link:\" HTTP header is removed, any linear whitespace (LWS) is removed, the header value is converted to UTF-8, and any percent-encodings are decoded.",
      "ja": "コアリンクフォーマットは、[RFC5988]リンク形式に相当します。しかしながら、本明細書でABNFは、[RFC5234]に準拠するように改良を繰り返し、新たなリンクパラメータを含んでいます。リンクパラメータ「hrefが」この仕様書（第4.1節を参照）でフィルタリングするためのクエリパラメータとして使用するために予約されており、リンクパラメータとして定義することはできません。 [RFC5988]のように、複数のリンクの説明は、コンマで区切られています。コンマも引用符で囲まれた文字列とURIの中で発生する可能性がありますが、説明が終わっていないことに注意してください。まず、このリンク形式に「リンク：」HTTPリンクヘッダーフィールドを変換するためにHTTPヘッダが除去され、任意の線形空白（LWS）は、ヘッダの値はUTF-8に変換され、除去され、そして任意のパーセントエンコーディングでありますデコードされました。"
    },
    {
      "indent": 4,
      "text": "Link = link-value-list link-value-list = [ link-value *[ \",\" link-value ]] link-value = \"<\" URI-Reference \">\" *( \";\" link-param ) link-param = ( ( \"rel\" \"=\" relation-types ) / ( \"anchor\" \"=\" DQUOTE URI-Reference DQUOTE ) / ( \"rev\" \"=\" relation-types ) / ( \"hreflang\" \"=\" Language-Tag ) / ( \"media\" \"=\" ( MediaDesc / ( DQUOTE MediaDesc DQUOTE ) ) ) / ( \"title\" \"=\" quoted-string ) / ( \"title*\" \"=\" ext-value ) / ( \"type\" \"=\" ( media-type / quoted-mt ) ) / ( \"rt\" \"=\" relation-types ) / ( \"if\" \"=\" relation-types ) / ( \"sz\" \"=\" cardinal ) / ( link-extension ) ) link-extension = ( parmname [ \"=\" ( ptoken / quoted-string ) ] )",
      "ja": "リンク=リンク値リストリンク値リスト= [リンク値* [「」リンク値]]リンク値= 『<』 URIリファレンス 『>』 *（ 『;』リンクPARAM）リンク-param =（（ \"REL\" \"=\" リレーションタイプ）/（ \"アンカー\" \"=\" DQUOTE URIリファレンスDQUOTE）/（ \"REV\" \"=\" リレーションタイプ）/（ \"HREFLANG\" \"=\" 言語-tag）/（ \"メディア\" \"=\"（MediaDesc /（DQUOTE MediaDesc DQUOTE）））/（ \"タイトル\" \"=\" 引用符で囲まれた文字列）/（ \"タイトル*\" \"=\" EXT-値）/（「タイプ\" \"=\"（メディアタイプ/引用-MT））/（ \"RT\" \"=\" リレーションタイプ）/（ \"IF\" \"=\" リレーションタイプ）/（ \"SZ\" \"=\" カーディナル）/（リンク拡張））リンク拡張=（parmnameの[ \"=\"（ptoken /引用符で囲まれた文字列）]）"
    },
    {
      "indent": 4,
      "text": " / ( ext-name-star \"=\" ext-value ) ext-name-star = parmname \"*\" ; reserved for RFC-2231-profiled ; extensions. Whitespace NOT ; allowed in between. ptoken = 1*ptokenchar ptokenchar = \"!\" / \"#\" / \"$\" / \"%\" / \"&\" / \"'\" / \"(\" / \")\" / \"*\" / \"+\" / \"-\" / \".\" / \"/\" / DIGIT / \":\" / \"<\" / \"=\" / \">\" / \"?\" / \"@\" / ALPHA / \"[\" / \"]\" / \"^\" / \"_\" / \"`\" / \"{\" / \"|\" / \"}\" / \"~\" media-type = type-name \"/\" subtype-name quoted-mt = DQUOTE media-type DQUOTE relation-types = relation-type / DQUOTE relation-type *( 1*SP relation-type ) DQUOTE relation-type = reg-rel-type / ext-rel-type reg-rel-type = LOALPHA *( LOALPHA / DIGIT / \".\" / \"-\" ) ext-rel-type = URI cardinal = \"0\" / ( %x31-39 *DIGIT ) LOALPHA = %x61-7A ; a-z quoted-string = <defined in [RFC2616]> URI = <defined in [RFC3986]> URI-Reference = <defined in [RFC3986]> type-name = <defined in [RFC4288]> subtype-name = <defined in [RFC4288]> MediaDesc = <defined in [W3C.HTML.4.01]> Language-Tag = <defined in [RFC5646]> ext-value = <defined in [RFC5987]> parmname = <defined in [RFC5987]>",
      "ja": "/（EXT-名星 \"=\" EXT-値）EXT-名-スター= parmname \"*\"; RFC-2231-プロファイリングのために予約。拡張子。空白はありません。間で許可さ。 ptoken = 1 * ptokenchar ptokenchar = \"！\" / \"＃\" / \"$\" / \"％\" / \"＆\" / \"'\" / \"（\" / \"）\" / \"*\" / \"+\" / \" - \" / \"。\" / \"/\" / DIGIT / \"：\" / \"<\" / \"=\" / \">\" / \"？\" / \"@\" / ALPHA / \"[\" / \"]\" / \"^\" / \"_\" / \"`\"/ \"{\"/ \"|\" / \"}\" / \"〜\" メディアタイプ=タイプ名 \"/\" サブタイプ名引用され-MT = DQUOTEメディア型DQUOTE関係-タイプ=関係型/ DQUOTE関係型*（1 * SPの関係式）DQUOTE関係型= REG-REL型/ EXT-REL型REG-REL型= LOALPHA *（LOALPHA / DIGIT / / \"\" \" - \"）EXT-REL型= URIのカーディナル= \"0\" /（x31-39 * DIGIT％）LOALPHA =％x61-7A。で定義されたAZ引用ストリング= <定義に[RFC2616]> URI = <定義に[RFC3986]> URIリファレンス= <定義に[RFC3986]>型名= <定義に[RFC4288]>サブタイプ名= < [RFC4288]> MediaDesc = <> [RFC5987]で定義された[RFC5646]> EXT-値= <で定義されている[W3C.HTML.4.01]>言語タグ= <で定義されparmname = <[RFC5987]で定義されました>"
    },
    {
      "indent": 0,
      "text": "2.1. Target and Context URIs",
      "section_title": true,
      "ja": "2.1. ターゲットとコンテキストのURI"
    },
    {
      "indent": 3,
      "text": "Each link conveys one target URI as a URI-reference inside angle brackets (\"<>\"). The context URI of a link (also called the base URI in [RFC3986]) is determined by the following rules in this specification:",
      "ja": "各リンクは、角括弧（「<>」）内部URI-基準として一つのターゲットURIを伝えます。 （また、[RFC3986]にベースURIと呼ばれる）リンクのコンテキストURIは、本明細書において、次の規則によって決定されます。"
    },
    {
      "indent": 3,
      "text": "(a) The context URI is set to the anchor parameter, when specified.",
      "ja": "（A）コンテキストURIが指定されたアンカーパラメータに設定されています。"
    },
    {
      "indent": 3,
      "text": "(b) Origin of the target URI, when specified.",
      "ja": "（b）は、指定されたターゲットURIの起源。"
    },
    {
      "indent": 3,
      "text": "(c) Origin of the link format resource's base URI.",
      "ja": "（C）リンク・フォーマット・リソースのベースURIの起源。"
    },
    {
      "indent": 0,
      "text": "2.2. Link Relations",
      "section_title": true,
      "ja": "2.2. リンク関係"
    },
    {
      "indent": 3,
      "text": "Since links in the CoRE Link Format are typically used to describe resources hosted by a server, the new relation type \"hosts\" is assumed in the absence of the relation parameter (see Section 7.2). The \"hosts\" relation type (from the verb \"to host\") indicates that the target URI is a resource hosted by the server (i.e., server hosts resource) indicated by the context URI. The target URI MUST be a relative URI of the context URI for this relation type.",
      "ja": "コアリンク形式のリンクは、通常、サーバーによってホストされているリソースを記述するために使用されているので、新しい関係タイプ「ホスト」が関係パラメータが存在しない場合に想定される（7.2節を参照してください）。 （「ホストする」動詞から）「ホスト」関係型ターゲットURIは、コンテキストURIが示すサーバ（すなわち、サーバホストリソース）によってホストされているリソースであることを示しています。ターゲットURIは、この関係タイプのコンテキストURIの相対URIでなければなりません。"
    },
    {
      "indent": 3,
      "text": "To express other relations, links can make use of any registered relation by including the relation parameter. The context of a relation can be defined using the anchor parameter. In this way, relations between resources hosted on a server or between hosted resources and external resources can be expressed.",
      "ja": "他の関係を表現するために、リンクは、関係パラメータを含めることで、登録されているすべての関係を利用することができます。関係のコンテキストはアンカーパラメータを使用して定義することができます。このように、サーバー上でホストされているリソース間またはホストされたリソースと外部リソース間の関係を表現することができます。"
    },
    {
      "indent": 0,
      "text": "2.3. Use of Anchors",
      "section_title": true,
      "ja": "2.3. アンカーの使用"
    },
    {
      "indent": 3,
      "text": "As per Section 5.2 of [RFC5988], a link description MAY include an \"anchor\" parameter, in which case the context is the URI included in that attribute. This is used to describe a relationship between two resources. A consuming implementation can, however, choose to ignore such links. It is not expected that all implementations will be able to derive useful information from explicitly anchored links.",
      "ja": "[RFC5988]のセクション5.2に従って、リンクの説明は、コンテキストがその属性にURIが含まれている場合には「アンカー」パラメータを含むことができます。これは、2つのリソース間の関係を記述するために使用されます。かかる実装は、しかし、そのようなリンクを無視することを選択することができます。すべての実装が明示的に固定されたリンクから有用な情報を引き出すことができると期待されていません。"
    },
    {
      "indent": 0,
      "text": "3. CoRE Link Attributes",
      "section_title": true,
      "ja": "3.コアリンク属性"
    },
    {
      "indent": 3,
      "text": "The following CoRE-specific target attributes are defined in addition to those already defined in [RFC5988]. These attributes describe information useful in accessing the target link of the relation and, in some cases, can use the syntactical form of a URI. Such a URI MAY be dereferenced (for instance, to obtain a description of the link relation), but that is not part of the protocol and MUST NOT be done automatically on link evaluation. When the values of attributes are compared, they MUST be compared as strings.",
      "ja": "以下のコア固有のターゲット属性が既に[RFC5988]で定義されたものに加えて定義されています。これらの属性は、いくつかのケースでは、URIの構文形式を使用することができ、関係のターゲット・リンクにアクセスする際に有用な情報を記述します。そのようなURIは、（例えば、リンク関係の記述を得るために）逆参照されてもよく、それはプロトコルの一部ではなく、リンクの評価に自動的に実行してはいけません。属性の値を比較すると、彼らは文字列として比較されなければなりません。"
    },
    {
      "indent": 0,
      "text": "3.1. Resource Type 'rt' Attribute",
      "section_title": true,
      "ja": "3.1. リソースタイプは、「室温」属性"
    },
    {
      "indent": 3,
      "text": "The Resource Type 'rt' attribute is an opaque string used to assign an application-specific semantic type to a resource. One can think of this as a noun describing the resource. In the case of a temperature resource, this could be, e.g., an application-specific semantic type like \"outdoor-temperature\" or a URI referencing a specific concept in an ontology like \"http://sweet.jpl.nasa.gov/2.0/phys.owl#Temperature\". Multiple Resource Types MAY be included in the value of this parameter, each separated by a space, similar to the relation attribute. The registry for Resource Type values is defined in Section 7.4.",
      "ja": "リソースタイプ「RT」属性は、リソースへのアプリケーション固有のセマンティックタイプを割り当てるために使用される不透明な文字列です。一つは、リソースを記述する名詞と考えることができます。温度リソースの場合、これは可能性があり、例えば、「のようなオントロジー内の特定の概念を参照する「屋外の温度」やURIなどのアプリケーション固有のセマンティックタイプhttp://sweet.jpl.nasa.gov/ 2.0 / phys.owl番号温度」。複数のリソース型は、それぞれが関係属性に似たスペースで区切っ、このパラメータの値に含まれるかもしれません。リソースタイプ値のためのレジストリは、セクション7.4で定義されています。"
    },
    {
      "indent": 3,
      "text": "The Resource Type attribute is not meant to be used to assign a human-readable name to a resource. The \"title\" attribute defined in [RFC5988] is meant for that purpose. The Resource Type attribute MUST NOT appear more than once in a link.",
      "ja": "リソースタイプ属性は、リソースに人間が読める名前を割り当てるために使用されるものではありません。 [RFC5988]で定義された「タイトル」属性は、その目的のために意味されます。リソースタイプの属性は、リンクに一度より多く見えてはいけません。"
    },
    {
      "indent": 0,
      "text": "3.2. Interface Description 'if' Attribute",
      "section_title": true,
      "ja": "3.2. 属性「が」インタフェース説明"
    },
    {
      "indent": 3,
      "text": "The Interface Description 'if' attribute is an opaque string used to provide a name or URI indicating a specific interface definition used to interact with the target resource. One can think of this as describing verbs usable on a resource. The Interface Description attribute is meant to describe the generic REST interface to interact with a resource or a set of resources. It is expected that an Interface Description will be reused by different Resource Types. For example, the Resource Types \"outdoor-temperature\", \"dew-point\", and \"rel-humidity\" could all be accessible using the Interface Description \"http://www.example.org/myapp.wadl#sensor\". Multiple Interface Descriptions MAY be included in the value of this parameter, each separated by a space, similar to the relation attribute. The registry for Interface Description values is defined in Section 7.4.",
      "ja": "インターフェイス説明は「あれば」属性は、ターゲット・リソースと対話するために使用される特定のインターフェース定義を示す名前やURIを提供するために使用不透明な文字列です。一つは、リソース上で使用可能な動詞を記述すると考えることができます。インターフェイス説明属性は、リソースまたはリソースのセットと対話するための汎用的なRESTインターフェースを記載することを意味します。インターフェイスの説明が異なるリソースの種類によって再利用されることが期待されます。例えば、リソース・タイプ「屋外の温度」、「露点」、および「相対湿度」は、すべてのインターフェイスの説明「http://www.example.org/myapp.wadl#sensor」を使用してアクセス可能である可能性があります。複数のインターフェイスの説明は、このパラメータの値は、関係属性と同様の空間によって分離それぞれに含まれるかもしれません。インターフェイス説明値のレジストリは、セクション7.4で定義されています。"
    },
    {
      "indent": 3,
      "text": "The Interface Description could be, for example, the URI of a Web Application Description Language (WADL) [WADL] definition of the target resource \"http://www.example.org/myapp.wadl#sensor\", a URN indicating the type of interface to the resource \"urn:myapp:sensor\", or an application-specific name \"sensor\". The Interface Description attribute MUST NOT appear more than once in a link.",
      "ja": "インターフェイス説明は、例えば、Webアプリケーション記述言語のURI（WADL）ターゲットリソース「http://www.example.org/myapp.wadl#sensor」の[WADL]定義は、URNを示すかもしれません、またはアプリケーション固有名「センサ」リソース「：myappのセンサーURN」へのインタフェースのタイプ。インターフェイス説明属性は、リンクに一度より多く見えてはいけません。"
    },
    {
      "indent": 0,
      "text": "3.3. Maximum Size Estimate 'sz' Attribute",
      "section_title": true,
      "ja": "3.3. 最大サイズの見積もりの​​SZ属性"
    },
    {
      "indent": 3,
      "text": "The maximum size estimate attribute 'sz' gives an indication of the maximum size of the resource representation returned by performing a GET on the target URI. For links to CoAP resources, this attribute is not expected to be included for small resources that can comfortably be carried in a single Maximum Transmission Unit (MTU) but SHOULD be included for resources larger than that. The maximum size estimate attribute MUST NOT appear more than once in a link.",
      "ja": "最大サイズの推定属性「SZ」は、ターゲットURIにGETを実行することにより、返されたリソース表現の最大サイズの指示を与えます。 CoAPリソースへのリンクについては、この属性は、快適に単一の最大伝送ユニット（MTU）で実施することができるが、それよりも大きな資源のために含まれるべきである小さなリソースのために含まれることが期待されていません。最大サイズの見積もり属性がリンクに一度より多く見えてはいけません。"
    },
    {
      "indent": 3,
      "text": "Note that there is no defined upper limit to the value of the 'sz' attributes. Implementations MUST be prepared to accept large values. One implementation strategy is to convert any value larger than a reasonable size limit for this implementation to a special value \"Big\", which in further processing would indicate that a size value was given that was so big that it cannot be processed by this implementation.",
      "ja": "属性「SZ」の値への定義された上限は存在しないことに留意されたいです。実装は大きな値を受け入れるように準備しなければなりません。一つの実装戦略は、さらなる処理にサイズ値はそれはそれは、この実装によって処理することができないほど大きかった与えられたことを示すことになる特別な値「ビッグ」にこの実装のための合理的なサイズ制限を超える任意の値を、変換することです。"
    },
    {
      "indent": 0,
      "text": "4. Well-Known Interface",
      "section_title": true,
      "ja": "4.よく知られているインタフェース"
    },
    {
      "indent": 3,
      "text": "Resource discovery in CoRE is accomplished through the use of a well-known resource URI that returns a list of links about resources hosted by that server and other link relations. Well-known resources have a path component that begins with \"/.well-known/\" as specified in [RFC5785]. This specification defines a new well-known resource for CoRE Resource Discovery: \"/.well-known/core\".",
      "ja": "コアでのリソースの発見は、そのサーバーと他のリンク関係によってホストされているリソースについてのリンクのリストを返し、よく知られたリソースURIを使用することにより達成されます。よく知られているリソースは、[RFC5785]で指定されている「/.well-known/」で始まるパスコンポーネントを持っています。 「/.well-known/core」：この仕様は、コアリソース発見のための新しい、よく知られたリソースを定義します。"
    },
    {
      "indent": 3,
      "text": "A server implementing this specification MUST support this resource on the default port appropriate for the protocol for the purpose of resource discovery. It is, however, up to the application which links are included and how they are organized. The resource \"/.well-known/core\" is meant to be used to return links to the entry points of resource interfaces on a server. More sophisticated link organization can be achieved by including links to CoRE Link Format resources located elsewhere on the server, for example, to achieve an index. In the absence of any links, a zero-length payload is returned. The resource representation of this resource MUST be the CoRE Link Format described in Section 2.",
      "ja": "この仕様を実装するサーバーは、リソース発見を目的としたプロトコルに適したデフォルトのポートでこのリソースをサポートしなければなりません。これは、リンクが含まれており、それらがどのように組織化されているアプリケーションまで、しかし、です。資源「/.well-known/core」はサーバ上のリソース・インターフェースのエントリポイントへのリンクを返すために使用されることを意味しています。より洗練されたリンクの組織は、指標を達成するために、例えば、サーバー上の他の場所に位置するコアリンクのフォーマットリソースへのリンクを含むことによって達成することができます。すべてのリンクが存在しない場合には、長さゼロのペイロードが返されます。このリソースのリソース表現は、第2節で説明したコア・リンク・フォーマットでなければなりません。"
    },
    {
      "indent": 3,
      "text": "The CoRE resource discovery interface supports the following interactions:",
      "ja": "コアリソース発見インターフェースは、以下の相互作用をサポートしています。"
    },
    {
      "indent": 3,
      "text": "o Performing a GET on \"/.well-known/core\" to the default port returns a set of links available from the server (if any) in the CoRE Link Format. These links might describe resources hosted on that server or on other servers or express other kinds of link relations as described in Section 2.",
      "ja": "デフォルトのポートに「/.well-known/core」でGETを実行oをコアリンク形式で（もしあれば）、サーバーから利用可能なリンクのセットを返します。これらのリンクは、そのサーバー上または他のサーバーでホストされているリソースを記述するか、第2節で説明したように、リンク関係の他の種類を表現することがあります。"
    },
    {
      "indent": 3,
      "text": "o Filtering may be performed on any of the link format attributes using a query string as specified in Section 4.1. For example, [GET /.well-known/core?rt=temperature-c] would request resources with the Resource Type temperature-c. A server is not, however, required to support filtering.",
      "ja": "Oフィルタリングはセクション4.1で指定されるようにクエリ文字列を使用して、属性リンク形式のいずれかで実行されてもよいです。例えば、[GET /.well-known/core?rt=temperature-c]リソースタイプ温度-Cとリソースを要求します。サーバは、しかし、フィルタリングをサポートする必要はありません。"
    },
    {
      "indent": 3,
      "text": "o More capable servers such as proxies could support a resource directory by requesting the resource descriptions of other end-points or allowing servers to POST requests to \"/.well-known/ core\". The details of such resource directory functionality is, however, out of the scope of this specification and is expected to be specified separately.",
      "ja": "Oのようなプロキシとしてより可能なサーバーは、他のエンドポイントのリソース記述を要求するか、サーバが「/.well-known/コア」への要求をPOSTできるようにすることで、リソースのディレクトリをサポートすることができます。こうしたリソースディレクトリ機能の詳細については、この仕様の範囲の外に、しかし、で、個別に指定されることが期待されます。"
    },
    {
      "indent": 0,
      "text": "4.1. Query Filtering",
      "section_title": true,
      "ja": "4.1. クエリのフィルタリング"
    },
    {
      "indent": 3,
      "text": "A server implementing this specification MAY recognize the query part of a resource discovery URI as a filter on the resources to be returned. The path and query components together should conform to the following level-4 URI Template [RFC6570]:",
      "ja": "この仕様を実装するサーバーは、返されるリソースのフィルタとして資源発見URIのクエリ部分を認識することができます。パスおよびクエリーコンポーネントは、一緒になって、次のレベル4 URIテンプレート[RFC6570]に準拠する必要があります。"
    },
    {
      "indent": 7,
      "text": "/.well-known/core{?search*}",
      "ja": "／。うぇっｌーｋのｗん／これ｛？せあｒｃｈ＊｝"
    },
    {
      "indent": 3,
      "text": "where the variable \"search\" is a 1-element list that has a single name/value pair, where",
      "ja": "変数「検索」はここで、単一の名前/値のペアを有する1要素のリストであります"
    },
    {
      "indent": 3,
      "text": "o name is either \"href\", a link-param name defined in this specification, or any other link-extension name, and",
      "ja": "名前が「HREF」、本明細書で定義されたリンクPARAM名、または他の任意のリンクの拡張名のいずれかであり、およびo"
    },
    {
      "indent": 3,
      "text": "o value is either a Complete Value String that does not end in an \"*\" (%2A), or a Prefix Value String followed by an \"*\" (%2A).",
      "ja": "O値は「*」（％の2A）で終わっていない完全な値の文字列、または「*」（％の2A）、続いプレフィックス値文字列のいずれかです。"
    },
    {
      "indent": 3,
      "text": "The search name \"href\" refers to the URI-reference between the \"<\" and \">\" characters of a link. Both Value Strings match a target attribute only if it exists. Value Strings are percent-decoded ([RFC3986], Section 2.1) before matching; similarly, any target attributes notated as quoted-string are interpreted as defined in Section 2.2 of [RFC2616]. After these steps, a Complete Value String matches a target attribute if it is bitwise identical. A Prefix Value String matches a target attribute if it is a bitwise prefix of the target attribute (where any string is a prefix of itself). Empty Prefix Value Strings are allowed; by the definition above, they match any target attribute that does exist. Note that relation-type target attributes can contain multiple values, and each value MUST be treated as a separate target attribute when matching.",
      "ja": "検索名「hrefが」リンクの「<」と「>」の文字の間にURI参照を指します。どちらの値文字列は、ターゲットは、それが存在する場合にのみ、属性一致します。値文字列が一致する前に、パーセントデコード（[RFC3986]、セクション2.1）です。同様に、引用符で囲まれた文字列と表記任意のターゲット属性は、[RFC2616]のセクション2.2で定義されるように解釈されます。それはビット単位の同一である場合これらのステップの後、完全な値文字列は、ターゲット属性にマッチします。それは（任意の文字列が自身の接頭辞である）、ターゲット属性のビット単位の接頭辞である場合にはプレフィックス値文字列は、ターゲット属性にマッチします。空のプレフィックス値文字列が許可されます。上記の定義によって、彼らは存在しない任意のターゲット属性に一致します。関係型ターゲット属性が複数の値を含むことができ、及びマッチング時の各値は、別個のターゲット属性として扱わなければならないことに留意されたいです。"
    },
    {
      "indent": 3,
      "text": "It is not expected that very constrained nodes support filtering. Implementations not supporting filtering MUST simply ignore the query string and return the whole resource for unicast requests.",
      "ja": "非常に制約ノードがフィルタリングをサポートすることを期待されていません。フィルタリングをサポートしない実装は、単純にクエリ文字列を無視して、ユニキャスト要求のために全体のリソースを返さなければなりません。"
    },
    {
      "indent": 3,
      "text": "When using a transfer protocol like the Constrained Application Protocol (CoAP) that supports multicast requests, special care needs to be taken. A multicast request with a query string SHOULD NOT be responded to if filtering is not supported or if the filter does not match (to avoid a needless response storm). The exception is in cases where the IP stack interface is not able to indicate that the destination address was multicast.",
      "ja": "マルチキャスト要求をサポートしている制約アプリケーションプロトコル（CoAP）などの転送プロトコルを使用する場合は、特別な注意が必要です。クエリ文字列でのマルチキャスト要求は、フィルタリングがサポートされていない場合に対応されるべきではないか、フィルターが一致しない場合（不必要な応答の嵐を避けるため）。例外は、IPスタック・インタフェースは、宛先アドレスがマルチキャストであったことを示すことができない場合です。"
    },
    {
      "indent": 3,
      "text": "The following are examples of valid query URIs:",
      "ja": "以下は、有効なクエリのURIの例です："
    },
    {
      "indent": 3,
      "text": "o ?href=/foo matches a link-value that is anchored at /foo",
      "ja": "O？HREF = / fooが/ fooのに固定されたリンク値と一致しました"
    },
    {
      "indent": 3,
      "text": "o ?href=/foo* matches a link-value that is anchored at a URI that starts with /foo",
      "ja": "O？HREF = / fooが* / fooで始まりURIに固定されたリンク値と一致しました"
    },
    {
      "indent": 3,
      "text": "o ?foo=bar matches a link-value that has a target attribute named foo with the exact value bar",
      "ja": "O？FOO =バーは正確な値バーでfooという名前のターゲット属性を持つリンクした値と一致します"
    },
    {
      "indent": 3,
      "text": "o ?foo=bar* matches a link-value that has a target attribute named foo, the value of which starts with bar, e.g., bar or barley",
      "ja": "O？FOO =バー*がfooという名前のターゲット属性を持つリンク値と一致する、の値はバー、例えば、バーや大麦で始まります"
    },
    {
      "indent": 3,
      "text": "o ?foo=* matches a link-value that has a target attribute named foo",
      "ja": "O？fooが= * fooという名前のターゲット属性を持つリンクした値と一致します"
    },
    {
      "indent": 0,
      "text": "5. Examples",
      "section_title": true,
      "ja": "5.例"
    },
    {
      "indent": 3,
      "text": "A few examples of typical link descriptions in this format follows. Multiple resource descriptions in a representation are separated by commas. Linefeeds are also included in these examples for readability. Although the following examples use CoAP response codes, the examples are applicable to HTTP as well (the corresponding response code would be 200 OK).",
      "ja": "この形式の典型的なリンク記述のいくつかの例を以下に示します。表現内の複数のリソース記述は、カンマで区切られています。改行は、読みやすくするためにこれらの例に含まれています。以下の実施例は、CoAP応答コードを使用するが、実施例は、（対応する応答コードは200 OKであろう）、ならびにHTTPに適用可能です。"
    },
    {
      "indent": 3,
      "text": "This example includes links to two different sensors sharing the same Interface Description. Note that the default relation type for this link format is \"hosts\" in links with no rel= target attribute. Thus, the links in this example tell that the Origin server from which /.well-known/core was requested (the context) hosts the resources /sensors/temp and /sensors/light (each a target).",
      "ja": "この例では、同じインターフェイス説明を共有する二つの異なるセンサーへのリンクを含みます。このリンク形式のデフォルトの関係タイプが無いのrel = target属性とのリンクで「ホスト」であることに注意してください。したがって、この例ではリンクは/.well-known/coreが要求されたオリジンサーバ（コンテキスト）はリソース/センサー/温度及び/センサー/ライト（各標的）をホストすることを言います。"
    },
    {
      "indent": 3,
      "text": "REQ: GET /.well-known/core",
      "ja": "REQ：GET /.well-known/core"
    },
    {
      "indent": 3,
      "text": "RES: 2.05 Content </sensors/temp>;if=\"sensor\", </sensors/light>;if=\"sensor\"",
      "ja": "RES：2.05コンテンツ</センサー/ TEMP>; = \"センサ\" であれば、</センサ/光>; = \"センサ\" であれば"
    },
    {
      "indent": 3,
      "text": "Without the linefeeds inserted here for readability, the format actually looks as follows.",
      "ja": "次のように読みやすくするためにここに挿入改行せずに、フォーマットが実際に見えます。"
    },
    {
      "indent": 3,
      "text": "</sensors/temp>;if=\"sensor\",</sensors/light>;if=\"sensor\"",
      "ja": "</センサー/ TEMP>; = \"センサ\"、</センサ/光>もし; = \"センサ\" であれば"
    },
    {
      "indent": 3,
      "text": "This example arranges link descriptions hierarchically, with the entry point including a link to a sub-resource containing links about the sensors.",
      "ja": "この例では、センサーに関するリンクを含むサブリソースへのリンクを含むエントリポイントと、階層的にリンクの説明を配置します。"
    },
    {
      "indent": 3,
      "text": "REQ: GET /.well-known/core",
      "ja": "REQ：GET /.well-known/core"
    },
    {
      "indent": 3,
      "text": "RES: 2.05 Content </sensors>;ct=40",
      "ja": "RES：2.05コンテンツ</センサー>; CT = 40"
    },
    {
      "indent": 3,
      "text": "REQ: GET /sensors",
      "ja": "REQ：GET /センサー"
    },
    {
      "indent": 3,
      "text": "RES: 2.05 Content </sensors/temp>;rt=\"temperature-c\";if=\"sensor\", </sensors/light>;rt=\"light-lux\";if=\"sensor\"",
      "ja": "RES：2.05コンテンツ</センサー/ TEMP>; RT = \"温度-C\"; RT = \"光ルクス\"; = \"センサ\"、</センサ/光>もし= \"センサー\" もし"
    },
    {
      "indent": 3,
      "text": "An example query filter may look like:",
      "ja": "たとえば、クエリフィルタは次のようになります。"
    },
    {
      "indent": 3,
      "text": "REQ: GET /.well-known/core?rt=light-lux",
      "ja": "REQ：GET /.well-known/core?rt=light-lux"
    },
    {
      "indent": 3,
      "text": "RES: 2.05 Content </sensors/light>;rt=\"light-lux\";if=\"sensor\"",
      "ja": "RES：2.05コンテンツ</センサ/光>; RT = \"光ルクス\"; = \"センサ\" であれば"
    },
    {
      "indent": 3,
      "text": "Note that relation-type attributes like 'rt', 'if', and 'rel' can have multiple values separated by spaces. A query filter parameter can match any one of those values, as in this example:",
      "ja": "その関係式は、「RT」などの属性に注意してください、「もし」、および「REL」スペースで区切って複数の値を持つことができます。クエリフィルタパラメータは、この例のように、これらの値のいずれかと一致することができます。"
    },
    {
      "indent": 3,
      "text": "REQ: GET /.well-known/core?rt=light-lux",
      "ja": "REQ：GET /.well-known/core?rt=light-lux"
    },
    {
      "indent": 3,
      "text": "RES: 2.05 Content </sensors/light>;rt=\"light-lux core.sen-light\";if=\"sensor\"",
      "ja": "RES：2.05コンテンツ</センサ/光>; RT = \"光ルクスの光core.sen\"; = \"センサ\" であれば"
    },
    {
      "indent": 3,
      "text": "This example shows the use of an \"anchor\" attribute to relate the temperature sensor resource to an external description and to an alternative URI.",
      "ja": "この例では、外部の説明および代替URIに温度センサリソースを関連付けるための「アンカー」属性の使用を示します。"
    },
    {
      "indent": 3,
      "text": "REQ: GET /.well-known/core",
      "ja": "REQ：GET /.well-known/core"
    },
    {
      "indent": 3,
      "text": "RES: 2.05 Content </sensors>;ct=40;title=\"Sensor Index\", </sensors/temp>;rt=\"temperature-c\";if=\"sensor\", </sensors/light>;rt=\"light-lux\";if=\"sensor\", <http://www.example.com/sensors/t123>;anchor=\"/sensors/temp\" ;rel=\"describedby\", </t>;anchor=\"/sensors/temp\";rel=\"alternate\"",
      "ja": "RES：2.05コンテンツ</センサー>; CT = 40;タイトル= \"センサインデックス\"、</センサー/ TEMP>; RT = \"温度-C\";もし= \"センサー\"、</センサ/光>; RT = \"光ルクス\";もし= \"センサー\"、<http://www.example.com/sensors/t123>;アンカー= \"/センサー/ TEMP\"; REL = \"describedbyの\" </ T>;アンカー= \"/センサー/ TEMP\"; REL = \"代替\""
    },
    {
      "indent": 3,
      "text": "If a client is interested in finding relations about a particular resource, it can perform a query on the anchor parameter:",
      "ja": "クライアントは、特定のリソースについての関係を見つけることに興味があるならば、それはアンカーパラメータにクエリを実行することができます。"
    },
    {
      "indent": 3,
      "text": "REQ: GET /.well-known/core?anchor=/sensors/temp",
      "ja": "REQ：GET /.well-known/core?anchor=/sensors/temp"
    },
    {
      "indent": 3,
      "text": "RES: 2.05 Content <http://www.example.com/sensors/temp123>;anchor=\"/sensors/temp\" ;rel=\"describedby\", </t>;anchor=\"/sensors/temp\";rel=\"alternate\"",
      "ja": "RES：2.05コンテンツ<http://www.example.com/sensors/temp123>;アンカー= \"/センサー/ TEMP\";のrel = \"describedbyの\"、</ T>;アンカー= \"/センサー/ TEMP\"; REL =「代替」"
    },
    {
      "indent": 3,
      "text": "The following example shows a large firmware resource with a size attribute. The consumer of this link would use the 'sz' attribute to determine if the resource representation is too large and if block transfer would be required to request it. In this case, a client with only a 64 KiB flash might only support a 16-bit integer for storing the 'sz' attribute. Thus, a special flag or value should be used to indicate \"Big\" (larger than 64 KiB).",
      "ja": "次の例では、サイズ属性を持つ大規模なファームウェアリソースを示しています。リソース表現が大きすぎるとブロック転送が必要になる場合は、それを要求する場合は、このリンクの消費者が判断するために「SZ」属性を使用します。この場合、唯一の64 KiBのフラッシュを持つクライアントは、「SZ」属性を格納するために16ビット整数をサポートする場合があります。このように、特別なフラグまたは値が「ビッグ」（より大きい64 KiBの）を示すために使用されるべきです。"
    },
    {
      "indent": 3,
      "text": "REQ: GET /.well-known/core?rt=firmware",
      "ja": "REQ：GET /.well-known/core?rt=firmware"
    },
    {
      "indent": 3,
      "text": "RES: 2.05 Content </firmware/v2.1>;rt=\"firmware\";sz=262144",
      "ja": "RES：2.05コンテンツ</firmware/v2.1>; RT = \"ファームウェア\"; SZ = 262144"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "This specification has the same security considerations as described in Section 7 of [RFC5988]. The \"/.well-known/core\" resource MAY be protected, e.g., using Datagram Transport Layer Security (DTLS) when hosted on a CoAP server as per [COAP], Section 9.1.",
      "ja": "[RFC5988]のセクション7で説明したように、本明細書では、同じセキュリティ問題を有しています。 「/.well-known/core」リソースは、セクション9.1、[COAP]あたりとしてCoAPサーバ上でホストされているデータグラムトランスポート層セキュリティ（DTLS）を使用して、例えば、保護されていてもよいです。"
    },
    {
      "indent": 3,
      "text": "Some servers might provide resource discovery services to a mix of clients that are trusted to different levels. For example, a lighting control system might allow any client to read state variables, but only certain clients to write state (turn lights on or off). Servers that have authentication and authorization features SHOULD support authentication features of the underlying transport protocols (HTTP or DTLS/TLS) and allow servers to return different lists of links based on a client's identity and authorization. While such servers might not return all links to all requesters, not providing the link does not, by itself, control access to the relevant resource -- a bad actor could know or guess the right URIs. Servers can also lie about the resources available. If it is important for a client to only get information from a known source, then that source needs to be authenticated.",
      "ja": "一部のサーバーは、異なるレベルに信頼されているクライアントのミックスにリソース発見サービスを提供するかもしれません。例えば、（オンまたはオフライトを回す）照明制御システムは、任意のクライアントは、状態変数を読み取ることができかもしれませんが、特定のクライアントのみが状態を記述すること。認証と認可の機能を持っているサーバーは、基礎となるトランスポートプロトコル（HTTPまたはDTLS / TLS）の認証機能をサポートし、サーバがクライアントのIDと承認に基づいて、リンクの異なるリストを返すことができるはずです。そのようなサーバがすべての要求に応えて、すべてのリンクを返さないかもしれませんが、リンクを提供していないことは、それ自体で、関連するリソースへのアクセスを制御しない - 悪い俳優は知っているか、または右のURIを推測することができます。サーバーはまた、利用可能なリソース偽ることができます。それは既知のソースから情報を取得するだけに、クライアントのために重要である場合、そのソースは認証する必要があります。"
    },
    {
      "indent": 3,
      "text": "Multicast requests using CoAP for the well-known link-format resources could be used to perform denial of service on a constrained network. A multicast request SHOULD only be accepted if the request is sufficiently authenticated and secured using, e.g., IPsec or an appropriate object security mechanism.",
      "ja": "よく知られているリンク形式のリソースのためのCoAPを使用して、マルチキャスト要求が制約されたネットワーク上でサービス拒否を実行するために使用することができます。要求が十分に認証され、例えば、IPSecまたは適切なオブジェクトのセキュリティ・メカニズムを使用して固定されている場合、マルチキャスト要求は、受け入れられるべきです。"
    },
    {
      "indent": 3,
      "text": "CoRE Link Format parsers should be aware that a link description may be cyclical, i.e., contain a link to itself. These cyclical links could be direct or indirect (i.e., through referenced link resources). Care should be taken when parsing link descriptions and accessing cyclical links.",
      "ja": "コアリンクフォーマットパーサはすなわち、自分自身へのリンクが含まれている、リンク記述が循環的であってもよいことに注意する必要があります。これらの周期的なリンクは（すなわち、参照リンクリソースを介して）直接または間接的である可能性があります。リンクの説明を解析し、周期的なリンクにアクセスする際には注意が必要です。"
    },
    {
      "indent": 0,
      "text": "7. IANA Considerations",
      "section_title": true,
      "ja": "7. IANAの考慮事項"
    },
    {
      "indent": 0,
      "text": "7.1. Well-Known 'core' URI",
      "section_title": true,
      "ja": "7.1. よく知られている「コア」URI"
    },
    {
      "indent": 3,
      "text": "This memo registers the 'core' well-known URI in the Well-Known URIs registry as defined by [RFC5785].",
      "ja": "[RFC5785]で定義されたこのメモは、よく知られたURIのレジストリに「コア」のよく知られたURIを登録します。"
    },
    {
      "indent": 3,
      "text": "URI suffix: core",
      "ja": "URIサフィックス：コア"
    },
    {
      "indent": 3,
      "text": "Change controller: IETF",
      "ja": "変更コントローラ：IETF"
    },
    {
      "indent": 3,
      "text": "Specification document(s): RFC 6690",
      "ja": "仕様書（S）：RFC 6690"
    },
    {
      "indent": 3,
      "text": "Related information: None",
      "ja": "関連情報：なし"
    },
    {
      "indent": 0,
      "text": "7.2. New 'hosts' Relation Type",
      "section_title": true,
      "ja": "7.2. 新しい「ホストの関係型"
    },
    {
      "indent": 3,
      "text": "This memo registers the new \"hosts\" Web Linking relation type as per [RFC5988].",
      "ja": "このメモは、[RFC5988]あたりのように、新しい「ホスト」のWebリンクの関係タイプを登録します。"
    },
    {
      "indent": 3,
      "text": "Relation Name: hosts",
      "ja": "リレーション名：ホスト"
    },
    {
      "indent": 3,
      "text": "Description: Refers to a resource hosted by the server indicated by the link context.",
      "ja": "説明：リンク文脈によって示され、サーバによってホストされているリソースを参照します。"
    },
    {
      "indent": 3,
      "text": "Reference: RFC 6690",
      "ja": "参考：RFC 6690"
    },
    {
      "indent": 3,
      "text": "Notes: This relation is used in CoRE where links are retrieved as a \"/.well-known/core\" resource representation and is the default relation type in the CoRE Link Format.",
      "ja": "注：この関係は、リンクが「/.well-known/core」リソース表現として取得し、コアリンク形式でデフォルトの関係タイプですされているコアで使用されています。"
    },
    {
      "indent": 3,
      "text": "Application Data: None",
      "ja": "アプリケーションデータ：なし"
    },
    {
      "indent": 0,
      "text": "7.3. New 'link-format' Internet Media Type",
      "section_title": true,
      "ja": "7.3. 新しい「リンク形式のインターネットメディアタイプ"
    },
    {
      "indent": 3,
      "text": "This memo registers the a new Internet media type for the CoRE Link Format, 'application/link-format'.",
      "ja": "このメモは、コアリンクのフォーマット、「アプリケーション/リンク形式」の新しいインターネットメディアタイプを登録します。"
    },
    {
      "indent": 3,
      "text": "Type name: application",
      "ja": "型名：アプリケーション"
    },
    {
      "indent": 3,
      "text": "Subtype name: link-format",
      "ja": "サブタイプ名：リンク形式"
    },
    {
      "indent": 3,
      "text": "Required parameters: None",
      "ja": "必須パラメータ：なし"
    },
    {
      "indent": 3,
      "text": "Optional parameters: None",
      "ja": "オプションのパラメータ：なし"
    },
    {
      "indent": 3,
      "text": "Encoding considerations: Binary data (UTF-8)",
      "ja": "エンコードの考慮事項：バイナリデータ（UTF-8）"
    },
    {
      "indent": 3,
      "text": "Security considerations:",
      "ja": "セキュリティの考慮事項："
    },
    {
      "indent": 3,
      "text": "Multicast requests using CoAP for the well-known link-format resources could be used to perform denial of service on a constrained network. A multicast request SHOULD only be accepted if the request is sufficiently authenticated and secured using, e.g., IPsec or an appropriate object security mechanism.",
      "ja": "よく知られているリンク形式のリソースのためのCoAPを使用して、マルチキャスト要求が制約されたネットワーク上でサービス拒否を実行するために使用することができます。要求が十分に認証され、例えば、IPSecまたは適切なオブジェクトのセキュリティ・メカニズムを使用して固定されている場合、マルチキャスト要求は、受け入れられるべきです。"
    },
    {
      "indent": 3,
      "text": "CoRE Link Format parsers should be aware that a link description may be cyclical, i.e., contain a link to itself. These cyclical links could be direct or indirect (i.e., through referenced link resources). Care should be taken when parsing link descriptions and accessing cyclical links.",
      "ja": "コアリンクフォーマットパーサはすなわち、自分自身へのリンクが含まれている、リンク記述が循環的であってもよいことに注意する必要があります。これらの周期的なリンクは（すなわち、参照リンクリソースを介して）直接または間接的である可能性があります。リンクの説明を解析し、周期的なリンクにアクセスする際には注意が必要です。"
    },
    {
      "indent": 3,
      "text": "Interoperability considerations: None",
      "ja": "相互運用性に関する注意事項：なし"
    },
    {
      "indent": 3,
      "text": "Published specification: RFC 6690",
      "ja": "公開された仕様：RFC 6690"
    },
    {
      "indent": 3,
      "text": "Applications that use this media type: CoAP server and client implementations for resource discovery and HTTP applications that use the link-format as a payload.",
      "ja": "ペイロードとして、リンクの形式を使用し、リソースの発見とHTTPアプリケーションのためのCoAPサーバとクライアントの実装：このメディアタイプを使用するアプリケーション。"
    },
    {
      "indent": 3,
      "text": "Additional information:",
      "ja": "追加情報："
    },
    {
      "indent": 3,
      "text": "Magic number(s):",
      "ja": "マジックナンバー（S）："
    },
    {
      "indent": 3,
      "text": "File extension(s): *.wlnk",
      "ja": "ファイルの拡張子（S）：* .wlnk"
    },
    {
      "indent": 3,
      "text": "Macintosh file type code(s):",
      "ja": "Macintoshのファイルタイプコード（S）："
    },
    {
      "indent": 3,
      "text": "Intended usage: COMMON",
      "ja": "意図している用法：COMMON"
    },
    {
      "indent": 3,
      "text": "Restrictions on usage: None",
      "ja": "使用に関する制限：なし"
    },
    {
      "indent": 3,
      "text": "Author: CoRE WG",
      "ja": "著者：コアWG"
    },
    {
      "indent": 3,
      "text": "Change controller: IETF",
      "ja": "変更コントローラ：IETF"
    },
    {
      "indent": 0,
      "text": "7.4. Constrained RESTful Environments (CoRE) Parameters Registry",
      "section_title": true,
      "ja": "7.4. 制約付きRESTfulな環境（CORE）パラメータレジストリ"
    },
    {
      "indent": 3,
      "text": "This specification establishes a new Constrained RESTful Environments (CoRE) Parameters registry, which contains two new sub-registries of Link Target Attribute values (defined in [RFC5988]), one for Resource Type (rt=) Link Target Attribute values and the other for Interface Description (if=) Link Target Attribute values. No initial entries are defined by this specification for either sub-registry.",
      "ja": "この仕様は、リンク先の二つの新しいサブレジストリは、リソースタイプごとに1つ（RT =）リンクターゲット（[RFC5988]で定義される）の値属性値を属性とするための他含む新しい制約RESTfulな環境（コア）パラメータレジストリを確立しますリンク先は、属性値（=場合）インターフェイス説明。いいえ、最初のエントリは、サブレジストリのいずれかのためにこの仕様で定義されていません。"
    },
    {
      "indent": 3,
      "text": "For both sub-registries, values starting with the characters \"core\" are registered using the IETF Review registration policy [RFC5226]. All other values are registered using the Specification Required policy, which requires review by a designated expert appointed by the IESG or their delegate.",
      "ja": "サブレジストリの両方のために、文字で始まる値は「コア」IETFレビュー登録ポリシー[RFC5226]を使用して登録されています。他のすべての値は、IESGまたはその代理人が任命し、指定の専門家による審査を必要とする仕様が必要でポリシーを使用して登録されています。"
    },
    {
      "indent": 3,
      "text": "The designated expert will enforce the following requirements:",
      "ja": "指定された専門家は、次の要件を強制します。"
    },
    {
      "indent": 3,
      "text": "o Registration values MUST be related to the intended purpose of these attributes as described in Section 3.",
      "ja": "第3節で説明したように、O登録値は、これらの属性の意図した目的に関連していなければなりません。"
    },
    {
      "indent": 3,
      "text": "o Registered values MUST conform to the ABNF reg-rel-type definition of Section 2, meaning that the value starts with a lowercase alphabetic character, followed by a sequence of lowercase alphabetic, numeric, \".\", or \"-\" characters, and contains no white space.",
      "ja": "「」○登録された値は、値は小文字のアルファベットのシーケンスが続く小文字のアルファベット文字、数値、で始まることを意味し、第2のABNF REG-REL型定義に準拠して、またはしなければならない 『 - 』の文字を、そして空白が含まれていません。"
    },
    {
      "indent": 3,
      "text": "o It is recommended that the period \".\" character be used for dividing name segments and that the dash \"-\" character be used for making a segment more readable. Example Interface Description values might be \"core.batch\" and \"core.link-batch\".",
      "ja": "Oそれは、その期間をお勧めします「」文字は、名前のセグメントを分割するために使用することがダッシュすることを「 - 」の文字は、セグメントは、より読みやすくするために使用されます。例インターフェイス説明値は「core.batch」と「core.linkバッチ」かもしれません。"
    },
    {
      "indent": 3,
      "text": "o URIs are reserved for free use as extension values for these attributes and MUST NOT be registered.",
      "ja": "O URIは、これらの属性の拡張値として自由に使用するために予約されており、登録されてはなりません。"
    },
    {
      "indent": 3,
      "text": "Registration requests consist of the completed registration template below, with the reference pointing to the required specification. To allow for the allocation of values prior to publication, the designated expert may approve registration once they are satisfied that a specification will be published.",
      "ja": "登録要求は、要求仕様を指して参照して、以下の完了登録テンプレートで構成されています。彼らは仕様が​​公開されることを確認したら前の出版物への値の割り当てを可能にするため、指定された専門家は、登録を承認することができます。"
    },
    {
      "indent": 3,
      "text": "Note that Link Target Attribute Values can be registered by third parties if the Designated Expert determines that an unregistered Link Target Attribute Value is widely deployed and not likely to be registered in a timely manner.",
      "ja": "リンク先が指定エキスパートが未登録のリンク先は、価値が広く展開されている属性とタイムリーに登録される可能性がないと判断した場合の値が第三者によって登録することができる属性があります。"
    },
    {
      "indent": 3,
      "text": "The registration template for both sub-registries is:",
      "ja": "サブレジストリの両方のための登録テンプレートは以下のとおりです。"
    },
    {
      "indent": 3,
      "text": "o Attribute Value:",
      "ja": "O属性値："
    },
    {
      "indent": 3,
      "text": "o Description:",
      "ja": "O説明："
    },
    {
      "indent": 3,
      "text": "o Reference:",
      "ja": "Oリファレンス："
    },
    {
      "indent": 3,
      "text": "o Notes: [optional]",
      "ja": "O注：[オプション]"
    },
    {
      "indent": 3,
      "text": "Registration requests should be sent to the core-parameters@ietf.org mailing list, marked clearly in the subject line (e.g., \"NEW RESOURCE TYPE - example\" to register an \"example\" relation type or \"NEW INTERFACE DESCRIPTION - example\" to register an \"example\" Interface Description).",
      "ja": "に - 「例」関係タイプまたは「例NEW INTERFACE説明」を登録する - 登録要求は、件名行（例えば、「例えば、新しいリソース・タイプ」に明確にマークされ、core-parameters@ietf.orgメーリングリストに送られるべきです「例えば、」インターフェイスの説明）を登録。"
    },
    {
      "indent": 3,
      "text": "Within at most 14 days of the request, the Designated Expert(s) will either approve or deny the registration request, communicating this decision to the review list and IANA. Denials should include an explanation and, if applicable, suggestions as to how to make the request successful.",
      "ja": "リクエストの最大14日以内に、指定エキスパート（複数可）レビューリストとIANAにこの決定を伝える、登録要求を承認または拒否しますか。否定は説明と、該当する場合、要求を成功させる方法についての提案を含める必要があります。"
    },
    {
      "indent": 3,
      "text": "Decisions (or lack thereof) made by the Designated Expert can be first appealed to Application Area Directors (contactable using the app-ads@tools.ietf.org email address or directly by looking up their email addresses on http://www.iesg.org/ website) and, if the appellant is not satisfied with the response, to the full IESG (using the iesg@ietf.org mailing list).",
      "ja": "//www.iesg：指定専門家による決定（またはその欠如）は、最初のHTTP上で自分のメールアドレスを検索して、直接app-ads@tools.ietf.orgのメールアドレスを使用して（アプリケーション領域取締役への接触を訴えたりすることができます上訴人がいっぱいIESGに、応答に満足していない場合の.org /ウェブサイト）と、（iesg@ietf.orgメーリングリストを使用して）。"
    },
    {
      "indent": 0,
      "text": "8. Acknowledgments",
      "section_title": true,
      "ja": "8.謝辞"
    },
    {
      "indent": 3,
      "text": "Special thanks to Peter Bigot, who has made a considerable number of reviews and text contributions that greatly improved the document. In particular, Peter is responsible for early improvements to the ABNF descriptions and the idea for a new 'hosts' relation type.",
      "ja": "レビューと大幅に文書を改善し、テキストの貢献のかなりの数をしているピーター・ビゴ、に感謝します。具体的には、ピーターはABNFの記述と新しい「ホストの関係型のアイデアへの早期改善を担当しています。"
    },
    {
      "indent": 3,
      "text": "Thanks to Mark Nottingham and Eran Hammer-Lahav for the discussions and ideas that led to this document, and to Carsten Bormann, Martin Thomson, Alexey Melnikov, Julian Reschke, Joel Halpern, Richard Barnes, Barry Leiba, and Peter Saint-Andre for extensive comments and contributions that improved the text.",
      "ja": "豊富なため、この文書にし、カルステンボルマンにつながった議論やアイデアのためのマーク・ノッティンガムとエランハンマー -  Lahavのおかげで、マーティン・トムソンは、アレクセイ・メルニコフ、ジュリアンReschke、ジョエル・ハルパーン、リチャード・バーンズ、バリー・レイバ、そしてピーターサンタンドレコメントやテキストを改善貢献。"
    },
    {
      "indent": 3,
      "text": "Thanks to Michael Stuber, Richard Kelsey, Cullen Jennings, Guido Moritz, Peter Van Der Stok, Adriano Pezzuto, Lisa Dussealt, Alexey Melnikov, Gilbert Clark, Salvatore Loreto, Petri Mutka, Szymon Sasin, Robert Quattlebaum, Robert Cragie, Angelo Castellani, Tom Herbst, Ed Beroset, Gilman Tolle, Robby Simpson, Colin O'Flynn, and David Ryan for helpful comments and discussions that have shaped the document.",
      "ja": "マイケルStuber、リチャード・ケルシー、カレン・ジェニングス、グイド・モリッツ、ピーター・ヴァン・デアSTOK、アドリアーノPezzuto、リサDussealt、アレクセイ・メルニコフ、ギルバート・クラーク、サルヴァトーレ・ロレート、ペトリMutka、のSzymon Sasin、ロバートQuattlebaum、ロバートCragie、アンジェロ・カステラーニ、トムのおかげで有益なコメントや文書を形作ってきた議論のためのハーベスト、エドBeroset、ギルマントッレ、ロビー・シンプソン、コリンO'Flynn、とデビッド・ライアン。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "ja": "9.参考文献"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "ja": "9.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2616] Fielding, R., Gettys, J., Mogul, J., Frystyk, H., Masinter, L., Leach, P., and T. Berners-Lee, \"Hypertext Transfer Protocol -- HTTP/1.1\", RFC 2616, June 1999.",
      "ja": "[RFC2616]フィールディング、R.、ゲティス、J.、モーグル、J.、Frystyk、H.、Masinter、L.、リーチ、P.、およびT.バーナーズ - リー、 \"ハイパーテキスト転送プロトコル -  HTTP / 1.1\" 、RFC 2616、1999年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC3629] Yergeau, F., \"UTF-8, a transformation format of ISO 10646\", STD 63, RFC 3629, November 2003.",
      "ja": "[RFC3629] Yergeau、F.、 \"UTF-8、ISO 10646の変換フォーマット\"、STD 63、RFC 3629、2003年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC3986] Berners-Lee, T., Fielding, R., and L. Masinter, \"Uniform Resource Identifier (URI): Generic Syntax\", STD 66, RFC 3986, January 2005.",
      "ja": "[RFC3986]バーナーズ - リー、T.、フィールディング、R.、およびL. Masinter、 \"ユニフォームリソース識別子（URI）：汎用構文\"、STD 66、RFC 3986、2005年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC4288] Freed, N. and J. Klensin, \"Media Type Specifications and Registration Procedures\", BCP 13, RFC 4288, December 2005.",
      "ja": "[RFC4288]解放され、N.とJ. Klensin、 \"メディアタイプの仕様と登録手順\"、BCP 13、RFC 4288、2005年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC5226] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 5226, May 2008.",
      "ja": "[RFC5226] Narten氏、T.とH. Alvestrand、 \"RFCsにIANA問題部に書くためのガイドライン\"、BCP 26、RFC 5226、2008年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC5234] Crocker, D. and P. Overell, \"Augmented BNF for Syntax Specifications: ABNF\", STD 68, RFC 5234, January 2008.",
      "ja": "[RFC5234]クロッカー、D.、およびP. Overell、 \"構文仕様のための増大しているBNF：ABNF\"、STD 68、RFC 5234、2008年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC5646] Phillips, A. and M. Davis, \"Tags for Identifying Languages\", BCP 47, RFC 5646, September 2009.",
      "ja": "[RFC5646]フィリップス、A.とM.デイヴィス、 \"言語を識別するためのタグ\"、BCP 47、RFC 5646、2009年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC5987] Reschke, J., \"Character Set and Language Encoding for Hypertext Transfer Protocol (HTTP) Header Field Parameters\", RFC 5987, August 2010.",
      "ja": "[RFC5987]、RFC 5987、2010年8月Reschke、J.、 \"ハイパーテキスト転送プロトコル（HTTP）ヘッダフィールドパラメータのセットと言語文字エンコード\"。"
    },
    {
      "indent": 3,
      "text": "[RFC5988] Nottingham, M., \"Web Linking\", RFC 5988, October 2010.",
      "ja": "[RFC5988]ノッティンガム、M.、 \"ウェブリンク\"、RFC 5988、2010年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC6570] Gregorio, J., Fielding, R., Hadley, M., Nottingham, M., and D. Orchard, \"URI Template\", RFC 6570, March 2012.",
      "ja": "[RFC6570]グレゴリオ、J.、フィールディング、R.、ハドリー、M.、ノッティンガム、M.、およびD.オーチャード、 \"URIテンプレート\"、RFC 6570、2012年3月。"
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "ja": "9.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[COAP] Shelby, Z., Hartke, K., Bormann, C., and B. Frank, \"Constrained Application Protocol (CoAP)\", Work in Progress, July 2012.",
      "ja": "【COAP]シェルビー、Z.、HARTKE、K.、ボルマン、C.、およびB.フランク、 \"制約アプリケーションプロトコル（CoAP）\"、進歩、2012年7月に働いています。"
    },
    {
      "indent": 3,
      "text": "[REST] Fielding, R., \"Architectural Styles and the Design of Network-based Software Architectures\", 2000, <http://www.ics.uci.edu/~fielding/pubs/dissertation/ top.htm>.",
      "ja": "[REST]フィールディング、R.、 \"建築スタイルとネットワークベースのソフトウェアアーキテクチャの設計\"、2000年、<http://www.ics.uci.edu/~fielding/pubs/dissertation/ top.htm>。"
    },
    {
      "indent": 3,
      "text": "[RFC1034] Mockapetris, P., \"Domain names - concepts and facilities\", STD 13, RFC 1034, November 1987.",
      "ja": "[RFC1034] Mockapetris、P.、 \"ドメイン名 - 概念と設備\"、STD 13、RFC 1034、1987年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC1035] Mockapetris, P., \"Domain names - implementation and specification\", STD 13, RFC 1035, November 1987.",
      "ja": "[RFC1035] Mockapetris、P.、 \"ドメイン名 - 実装及び仕様\"、STD 13、RFC 1035、1987年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC2045] Freed, N. and N. Borenstein, \"Multipurpose Internet Mail Extensions (MIME) Part One: Format of Internet Message Bodies\", RFC 2045, November 1996.",
      "ja": "[RFC2045]解放され、N.とN. Borenstein、 \"マルチパーパスインターネットメールエクステンション（MIME）第一部：インターネットメッセージ本体のフォーマット\"、RFC 2045、1996年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC2231] Freed, N. and K. Moore, \"MIME Parameter Value and Encoded Word Extensions: Character Sets, Languages, and Continuations\", RFC 2231, November 1997.",
      "ja": "[RFC2231]解放され、N.とK.ムーア、 \"MIMEパラメータ値およびエンコードされたWordの機能拡張：文字セット、言語、および継続の\"、RFC 2231、1997年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC4287] Nottingham, M., Ed. and R. Sayre, Ed., \"The Atom Syndication Format\", RFC 4287, December 2005.",
      "ja": "[RFC4287]ノッティンガム、M.、エド。そして、R.セイヤー、エド。、 \"Atom配信フォーマット\"、RFC 4287、2005年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC4919] Kushalnagar, N., Montenegro, G., and C. Schumacher, \"IPv6 over Low-Power Wireless Personal Area Networks (6LoWPANs): Overview, Assumptions, Problem Statement, and Goals\", RFC 4919, August 2007.",
      "ja": "[RFC4919]クシャルナガル、N.、モンテネグロ、G.、およびC.シューマッハ、 \"低消費電力無線パーソナルエリアネットワーク（6LoWPANs）以上のIPv6：概要、仮定、問題文、および目標\"、RFC 4919、2007年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC5785] Nottingham, M. and E. Hammer-Lahav, \"Defining Well-Known Uniform Resource Identifiers (URIs)\", RFC 5785, April 2010.",
      "ja": "[RFC5785]ノッティンガム、M.とE.ハンマー -  Lahav、 \"既知のUniform Resource Identifier（URI）を定義\"、RFC 5785、2010年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC6454] Barth, A., \"The Web Origin Concept\", RFC 6454, December 2011.",
      "ja": "[RFC6454]バース、A.、 \"ウェブ起源コンセプト\"、RFC 6454、2011年12月。"
    },
    {
      "indent": 3,
      "text": "[W3C.HTML.4.01] Raggett, D., Le Hors, A., and I. Jacobs, \"HTML 4.01 Specification\", World Wide Web Consortium Recommendation REC-html401-19991224, December 1999, <http://www.w3.org/TR/1999/REC-html401-19991224>.",
      "ja": "[W3C.HTML.4.01] Raggett、D.、ル・オードブル、A.、およびI.ジェイコブス、 \"HTML 4.01仕様書\"、World Wide Web Consortium（W3C）の勧告REC-html401-19991224、1999年12月、<のhttp：// WWW。 w3.org/TR/1999/REC-html401-19991224>。"
    },
    {
      "indent": 3,
      "text": "[WADL] Hadley, M., \"Web Application Description Language (WADL)\", 2009, <http://java.net/projects/wadl/sources/svn/content/ trunk/www/wadl20090202.pdf>.",
      "ja": "<http://java.net/projects/wadl/sources/svn/content/トランク/ WWW / wadl20090202.pdf>、ハドリー、M.、 \"Webアプリケーション記述言語（消費）\" 2009年[消費]。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Zach Shelby Sensinode Kidekuja 2 Vuokatti 88600 Finland",
      "ja": "ザックシェルビーSensinode Kidekuja 2ヴォカッティ88600フィンランド"
    },
    {
      "indent": 3,
      "text": "Phone: +358407796297 EMail: zach@sensinode.com",
      "ja": "電話：+358407796297 Eメール：zach@sensinode.com"
    }
  ]
}