{
  "title": {
    "text": "RFC 6167 - URI Scheme for Java(tm) Message Service 1.0",
    "ja": "RFC 6167 - Java用のURIスキーム（TM）メッセージサービス1.0"
  },
  "number": 6167,
  "created_at": "2019-10-29 07:42:15.326451+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                       M. Phillips\nRequest for Comments: 6167                                      P. Adams\nCategory: Informational                                              IBM\nISSN: 2070-1721                                               D. Rokicki\n                                                             Software AG\n                                                              E. Johnson\n                                                                   TIBCO\n                                                              April 2011",
      "raw": true
    },
    {
      "indent": 14,
      "text": "URI Scheme for Java(tm) Message Service 1.0",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document defines the format of Uniform Resource Identifiers (URIs) as defined in RFC 3986, for designating connections and destination addresses used in the Java(tm) Messaging Service (JMS). It was originally designed for particular uses, but applies generally wherever a JMS URI is needed to describe the connection to a JMS provider, and access to a JMS Destination. The syntax of this JMS URI is not compatible with previously existing, but unregistered, \"jms\" URI schemes. However, the expressiveness of the scheme described herein should satisfy the requirements of all existing circumstances.",
      "ja": "この文書は、Java（登録商標）メッセージングサービス（JMS）で使用される接続と宛先アドレスを指定するため、RFC 3986で定義されているURI（Uniform Resource Identifier）の形式を定義します。もともとは、特定の用途のために設計されていますが、JMS URIはJMSプロバイダへの接続、およびJMS宛先へのアクセスを記述するために必要とされるところはどこでも、一般的に適用されました。この構文は、URIのJMS既存との互換性はありませんが、未登録、「JMS」URIスキーム。しかしながら、本明細書に記載されるスキームの表現は、すべての既存の状況の要件を満たさなければなりません。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 IESGによって承認されていないすべての文書がインターネットStandardのどんなレベルの候補です。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6167.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6167で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2011 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2011 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 3,
      "text": "This document may contain material from IETF Documents or IETF Contributions published or made publicly available before November 10, 2008. The person(s) controlling the copyright in some of this material may not have granted the IETF Trust the right to allow modifications of such material outside the IETF Standards Process. Without obtaining an adequate license from the person(s) controlling the copyright in such materials, this document may not be modified outside the IETF Standards Process, and derivative works of it may not be created outside the IETF Standards Process, except to format it for publication as an RFC or to translate it into languages other than English.",
      "ja": "この材料の一部がIETFトラストにこのような材料の変更を許可する権利を与えられていない可能性がありますにこの文書は、2008年、IETFドキュメントまたは11月10日以前に発行または公開さIETF貢献から著作権を支配する者（複数可）材料を含んでいてもよいですIETF標準化プロセスの外。そのような材料の著作権を管理者（単数または複数）から適切なライセンスを取得することなく、この文書は、IETF標準化過程の外側修正されないかもしれません、そして、それの派生物は、IETF標準化過程の外側に作成されない場合があり、それをフォーマットする以外出版RFCとして、英語以外の言語に翻訳します。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n   1.1. Requirements Notation ......................................4\n2. URI Scheme Name .................................................5\n3. Syntax of a JMS URI .............................................5\n4. URI Scheme Semantics ............................................5\n   4.1. Shared Parameters ..........................................6\n   4.2. \"jndi\" Variant .............................................7\n   4.3. Vendor Destination Names -- Variants \"queue\" and \"topic\" ..11\n   4.4. Custom Parameters .........................................12\n5. Encoding Considerations ........................................13\n6. Applications/Protocols That Use the JMS URI ....................13\n7. Interoperability Considerations ................................13\n8. Security Considerations ........................................14\n   8.1. Reliability and Consistency ...............................14\n   8.2. Malicious Construction ....................................14\n   8.3. Back-End Transcoding ......................................15\n   8.4. Semantic Attacks ..........................................15\n   8.5. Other Security Concerns ...................................16\n9. IANA Considerations ............................................16\n   9.1. URI Scheme Registration ...................................16\n   9.2. \"jms\" URI Scheme Registries ...............................17\n10. Contributors ..................................................18\n11. Acknowledgements ..............................................19\n12. References ....................................................20\n   12.1. Normative References .....................................20\n   12.2. Informative References ...................................21",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The \"jms\" URI scheme is used to designate a javax.jms.Destination object and an associated javax.jms.ConnectionFactory object [JMS], and, optionally, to provide additional information concerning the way that the Destination object is to be used. Probably the most common, and certainly the most compatible, way in Java to retrieve such Destinations is via Java Naming and Directory Information (JNDI) [JNDI] methods. So as to extend compatibility to existing vendor mechanisms beyond JNDI lookup, the JMS URI syntax allows variants on the core syntax. The variant exists as an explicit part of the syntax so that tools that are otherwise unfamiliar with the variant can recognize the presence of a URI with an alternate interpretation.",
      "ja": "「JMS」URIスキームはjavax.jms.Destinationのオブジェクトを指定するために使用され、関連javax.jms.ConnectionFactoryのオブジェクト[JMS]、および、必要に応じて、宛先オブジェクトが使用されるような方法に関する追加情報を提供します。おそらく最も一般的な、そして、そのような目的地を検索するためにJavaで確かに最も適合し、方法は、Javaネーミングとディレクトリ情報（JNDI）[JNDI]メソッドを経由しています。 JNDIルックアップを超えて既存のベンダーのメカニズムとの互換性を拡張するように、JMS URIの構文は、コア構文に変形することができます。変異体は、構文の明示的な一部として存在するように、さもなければ代替解釈をURIの存在を認識することができる変異体に慣れていないツール。"
    },
    {
      "indent": 3,
      "text": "In its simplest and most interoperable form, this URI scheme starts with \"jms:jndi:\" plus a JNDI name for a Destination. Since interaction with some resources might require JNDI contextual information or JMS header fields and properties to be specified as well, the \"jndi\" variant of the \"jms\" URI scheme includes support for supplying this additional JNDI information as query parameters.",
      "ja": "「：JNDI：JMSの」プラス宛先のJNDI名その最も簡単かつ相互運用性の形式では、このURIスキームで始まります。いくつかのリソースとの相互作用が同様に指定するJNDIコンテキスト情報またはJMSヘッダフィールドおよびプロパティを必要とするかもしれないので、「JMS」の「JNDI」変異体は、URIスキームは、クエリパラメータとして追加JNDI情報を供給するためのサポートを含みます。"
    },
    {
      "indent": 3,
      "text": "While the \"jndi\" variant provides compatibility, vendors can define additional variants. This specification defines three variants: \"jndi\", \"queue\", and \"topic\". Vendors defining additional variants are strongly encouraged to register them with IANA as documented in Section 9.2.1.",
      "ja": "「JNDI」バリアントは互換性を提供していますが、ベンダーは追加のバリアントを定義することができます。 「JNDI」、「キュー」、および「トピック」：この仕様は3つのバリアントを定義します。追加のバリアントを定義するベンダーが強く、セクション9.2.1に記載されているようにIANAに登録することをお勧めします。"
    },
    {
      "indent": 3,
      "text": "While the \"jms\" URI scheme allows the location of network resources, it does not map to a single underlying protocol, unlike most other URI schemes that do so. Instead, it achieves interoperability through the use of a common Java-based API [JAVA] for messaging. Because of this, interoperability is dependent upon the implementation of the API and its capabilities; two implementations of JMS might or might not interoperate in practice. Furthermore, it might be impractical to use JMS URIs in non-Java environments.",
      "ja": "「JMS」URIスキームがネットワークリソースの場所を可能にするが、それはそう他の多くのURIスキームとは異なり、単一基本プロトコルにマップされません。その代わりに、メッセージングのための一般的なJavaベースのAPI [JAVA]を使用して相互運用性を実現しています。このため、相互運用性は、APIとその機能の実装に依存しています。 JMSの2つの実装は、または実際には相互運用しない場合があります。さらに、非Java環境でのJMS URIを使用することは非現実的かもしれません。"
    },
    {
      "indent": 3,
      "text": "As a consequence of building upon an API, rather than a protocol, the utility of a JMS URI depends on the context in which it is used. That context includes agreement on the same JMS provider or underlying protocol; agreement on how to look up endpoints (JNDI); and, when using serialized Java object messages, sufficiently similar Java Class environments that serialized objects can be appropriately read and written. Users of this scheme need to establish the necessary shared-context parts as just enumerated -- a context that can span the globe, or merely a small local network. With that shared context, this URI scheme enables endpoint identification in a uniform way, and the means to connect to those endpoints.",
      "ja": "むしろプロトコルよりも、APIにより構築の結果として、JMS URIの有用性は、それが使用される文脈に依存します。そのコンテキストは、同じJMSプロバイダまたは基礎となるプロトコルに契約を含みます。エンドポイント（JNDI）をルックアップする方法について合意。直列化されたJavaオブジェクトのメッセージ、シリアライズ十分に類似したJavaクラスの環境を使用した場合と、オブジェクトを適切に読み書きすることができます。世界にまたがることができ、コンテキスト、または単に小さなローカルネットワーク - この方式のユーザーは単に列挙、必要に応じて共有コンテキスト部品を確立する必要があります。その共有文脈で、このURIスキームは、均一な方法でエンドポイントの識別を可能にする、手段は、これらのエンドポイントに接続します。"
    },
    {
      "indent": 0,
      "text": "1.1. Requirements Notation",
      "section_title": true,
      "ja": "1.1. 要件表記"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 3,
      "text": "All syntax descriptions use the ABNF specified by [RFC5234], \"Augmented BNF for Syntax Specifications: ABNF\".",
      "ja": "すべての構文の説明は、[RFC5234]で指定されたABNF、「：ABNF構文仕様のための増大しているBNF」を使用します。"
    },
    {
      "indent": 3,
      "text": "Note that some examples in this document wrap long JMS URIs for readability. The line breaks are not part of the actual URIs.",
      "ja": "このドキュメントのいくつかの例は、読みやすくするために、長いJMS URIをラップすることに注意してください。改行は実際のURIの一部ではありません。"
    },
    {
      "indent": 0,
      "text": "2. URI Scheme Name",
      "section_title": true,
      "ja": "2. URIスキーム名"
    },
    {
      "indent": 3,
      "text": "The name of the URI scheme is \"jms\".",
      "ja": "URIスキームの名前は、「JMS」です。"
    },
    {
      "indent": 0,
      "text": "3. Syntax of a JMS URI",
      "section_title": true,
      "ja": "JMS URIの3構文"
    },
    {
      "indent": 3,
      "text": "The following ABNF describes the \"jms\" scheme URI syntax:",
      "ja": "以下のABNFは、「JMS」スキームURIの構文について説明します。"
    },
    {
      "indent": 5,
      "text": "jms-uri = \"jms:\" jms-variant \":\" jms-dest [ \"?\" param *( \"&\" param ) ]",
      "ja": "JMS-URI = \"JMS：\" JMS-変異体 \"：\" JMS-下痢[ \"？\"アルティメット*（ \"＆\" アルティメット）]"
    },
    {
      "indent": 5,
      "text": "jms-variant = segment-nz-nc",
      "ja": "変異体のようなセグメントNZ = NC"
    },
    {
      "indent": 5,
      "text": "jms-dest = segment-nz ; specific meaning per variant",
      "ja": "JMS-セグメント対効果。バリアントごとに特定の意味"
    },
    {
      "indent": 5,
      "text": "param = param-name \"=\" param-value",
      "ja": "PARAM = PARAM名 \"=\" PARAM値"
    },
    {
      "indent": 5,
      "text": "param-name = 1*(unreserved / pct-encoded)",
      "ja": "PARAM-NAME = 1 *（未予約/ PCTエンコード）"
    },
    {
      "indent": 5,
      "text": "param-value = *(unreserved / pct-encoded)",
      "ja": "PARAM値= *（予約されていない/ PCTエンコード）"
    },
    {
      "indent": 5,
      "text": "segment-nz-nc = <as defined in RFC 3986>",
      "ja": "セグメントNZ-NC = <RFC 3986で定義されています>"
    },
    {
      "indent": 5,
      "text": "path-rootless = <as defined in RFC 3986>",
      "ja": "<RFC 3986で定義されるように>パスルートレス="
    },
    {
      "indent": 5,
      "text": "unreserved = <as defined in RFC 3986>",
      "ja": "予約されていない= <RFC 3986で定義されています>"
    },
    {
      "indent": 5,
      "text": "pct-encoded = <as defined in RFC 3986>",
      "ja": "PCTエンコード= <RFC 3986で定義されています>"
    },
    {
      "indent": 3,
      "text": "The URIs are percent-encoded UTF-8 [RFC3629]. Please see Section 5 of this document for encoding considerations.",
      "ja": "URIはパーセントエンコードUTF-8 [RFC3629]です。エンコードの考慮事項については、このドキュメントのセクション5を参照してください。"
    },
    {
      "indent": 0,
      "text": "4. URI Scheme Semantics",
      "section_title": true,
      "ja": "4. URIスキームセマンティクス"
    },
    {
      "indent": 3,
      "text": "JMS URIs are used to locate JMS [JMS] Destination resources and do not specify actions to be taken on those resources. Operations available on JMS Destinations are fully and normatively defined by the JMS specification and as such are out of scope for this URI specification.",
      "ja": "JMS URIはJMS [JMS]先のリソースを見つけるために使用されており、それらのリソース上で実行するアクションを指定しないでください。 JMS先で利用可能な操作は、完全かつ規範JMS仕様で定義され、そのようなものとして、このURIの仕様の範囲外されています。"
    },
    {
      "indent": 3,
      "text": "The required portions of the syntax include the terminal of \"jms\" for the URI scheme name; the <jms-variant> element to indicate the variant of the scheme; and the <jms-dest> element, which identifies the Destination based on the chosen variant. For the <jms-variant> element, this document defines three values: \"jndi\", \"queue\", and \"topic\". All the terminals resulting from <jms-variant> and <jms-dest> production rules are case-sensitive.",
      "ja": "構文の必要な部分は、URIスキーム名「JMS」の端末を含みます。スキームの変形を示すために、<JMS-変異体>要素。および宛先を識別する<JMS-DEST>要素は、選択された変異体に基づきます。 「JNDI」、「キュー」、および「トピック」：<JMS-バリアント>要素については、このドキュメントでは、3つの値が定義されています。起因する全ての端末は、<JMS-バリアント>と<JMS-DEST>プロダクションルールは、大文字と小文字が区別されます。"
    },
    {
      "indent": 3,
      "text": "Parameters further refine how to locate and use the Destination. The parameter names and values are case-sensitive. They can occur in any order, and each parameter name SHOULD NOT appear more than once. In the event that a parameter appears multiple times, all but the last instance of the parameter MUST be ignored. For comparison purposes, the absence of a parameter does not mean the same thing as a URI with a parameter set to a default value, due to the potential variation in default values as determined by the context of a specific use.",
      "ja": "パラメータはさらに先を見つけて使用する方法を改良します。パラメータ名と値は、大文字と小文字が区別されます。彼らは、任意の順序で発生する可能性があり、各パラメータ名が複数回表示されません。パラメータが複数回表示された場合には、パラメータの最後のインスタンスが、すべてを無視しなければなりません。比較のために、パラメータが存在しない場合は、特定の使用の文脈によって決定されるデフォルト値の潜在的な変動によるデフォルト値に設定されたパラメータとURIと同じことを意味するものではありません。"
    },
    {
      "indent": 3,
      "text": "Each variant can have query parameters specific to that variation. All such variant-specific parameters SHOULD use the name of the variant as the prefix to the parameters. For example, a vendor-specific variant of \"vnd.example.ex\" might also define a parameter with a name like \"vnd.example.exParameter\". Parameters that apply across multiple variants -- perhaps because they are generally applicable, such as JMS settings -- MUST NOT have a name that starts with the name of any known variant. This pattern enables tools that are otherwise unfamiliar with a particular variant to distinguish those parameters that are specific to a variant from those that are more generally applicable.",
      "ja": "各バリアントは、その変化に固有のクエリパラメータを持つことができます。このようなすべてのバリアント固有のパラメータは、パラメータのプレフィックスとしてバリアントの名前を使用する必要があります。たとえば、「vnd.example.ex」のベンダー固有の変異体はまた、「vnd.example.exParameter」のような名前のパラメータを定義できます。このようJMS設定など、おそらく彼らは一般的に適用されているので、 -   - 複数のバリアント間で適用されるパラメータは、任意の既知の変異体の名前で始まる名前を持つことはできません。このパターンは、より一般的に適用可能であるものから変異体に特異的であり、これらのパラメータを区別するために特定の変異を持つそうでなければ不慣れなツールを可能にします。"
    },
    {
      "indent": 3,
      "text": "Examples of the URI scheme include:",
      "ja": "URIスキームの例としては、"
    },
    {
      "indent": 5,
      "text": "jms:jndi:SomeJndiNameForDestination? jndiInitialContextFactory= com.example.jndi.JndiFactory&priority=3",
      "ja": "JMS：JNDI：SomeJndiNameForDestination？ jndiInitialContextFactory = com.example.jndi.JndiFactory＆優先= 3"
    },
    {
      "indent": 5,
      "text": "jms:queue:ExampleQueueName?timeToLive=1000",
      "ja": "JMS：キュー：？ExampleQueueName生存時間= 1000"
    },
    {
      "indent": 0,
      "text": "4.1. Shared Parameters",
      "section_title": true,
      "ja": "4.1. 共有パラメータ"
    },
    {
      "indent": 3,
      "text": "In addition to the required particles, the \"jms\" URI scheme supports the following shared parameters, which are available to all variants. These parameters correspond to headers and properties on the JMS Messages to be sent. For the parameters deliveryMode, timeToLive, and priority, the default values might be specified in the context of a specific use, for example by environment variables, or in the configuration of a particular network application. JMS also defines default values for these properties. The context default is hereby defined as the default value in the context of a specific use, or the JMS default for a particular property if the context does not define a default.",
      "ja": "必要な粒子に加えて、「JMS」URIスキームはすべての亜種に利用可能な次の共有パラメータをサポートしています。これらのパラメータは、送信されるJMSメッセージのヘッダーおよびプロパティに対応します。パラメータ配信モード、生存時間、および優先順位の場合、デフォルト値は、環境変数によって、例えば、特定の用途のコンテキストで指定された、または特定のネットワークアプリケーションの構成にあるかもしれません。 JMSはまた、これらのプロパティのデフォルト値を定義します。コンテキストがデフォルトを定義していない場合は、コンテキストのデフォルトは、本明細書の特定の用途の文脈でのデフォルト値、または特定のプロパティのJMSデフォルトとして定義されます。"
    },
    {
      "indent": 0,
      "text": "4.1.1. deliveryMode",
      "section_title": true,
      "ja": "4.1.1. 配信モード"
    },
    {
      "indent": 3,
      "text": "Indicates whether the request message is persistent or not. This property corresponds to the JMS message header field \"JMSDeliveryMode\" defined in Section 3.4.2 of the JMS 1.1 specification [JMS]. The value of this parameter MUST be \"PERSISTENT\" or \"NON_PERSISTENT\". If this parameter is not specified, then the context default MUST be used.",
      "ja": "要求メッセージが永続的であるかどうかを示します。このプロパティは、JMS 1.1仕様[JMS]のセクション3.4.2で定義されたJMSメッセージヘッダフィールド「たJMSDeliveryMode」に相当します。このパラメータの値は、「PERSISTENT」または「NON_PERSISTENT」でなければなりません。このパラメータが指定されていない場合、コンテキストのデフォルトを使用しなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.1.2. timeToLive",
      "section_title": true,
      "ja": "4.1.2. 有効期間"
    },
    {
      "indent": 3,
      "text": "The lifetime, in milliseconds, of the request message, specified as a decimal number. This property corresponds to the JMS Time-To-Live value defined in Section 4.8 of the JMS 1.1 specification. If this parameter is not specified, then the context default MUST be used.",
      "ja": "寿命は、ミリ秒単位で、要求メッセージ、10進数として指定されました。このプロパティは、JMS 1.1仕様のセクション4.8で定義されたJMSのTime-To-ライブ値に対応します。このパラメータが指定されていない場合、コンテキストのデフォルトを使用しなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.1.3. priority",
      "section_title": true,
      "ja": "4.1.3. 優先"
    },
    {
      "indent": 3,
      "text": "The JMS priority associated with the request message. As per Section 3.4.10 of the JMS 1.1 specification, this MUST be a value between 0 and 9 inclusive, specified as a decimal number. This corresponds to the JMS message header field \"JMSPriority\". If this parameter is not specified, then the context default MUST be used.",
      "ja": "要求メッセージに関連付けられたJMS優先順位。 JMS 1.1仕様のセクション3.4.10に従って、これは10進数として指定された0から9までの間の値でなければなりません。これは、JMSメッセージヘッダフィールド「JMSPriority」に相当します。このパラメータが指定されていない場合、コンテキストのデフォルトを使用しなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.1.4. replyToName",
      "section_title": true,
      "ja": "4.1.4.  replyToName"
    },
    {
      "indent": 3,
      "text": "This property corresponds to the JMS message header field \"JMSReplyTo\" defined in Section 3.4.6 of the JMS 1.1 specification. As interpreted by the particular variant, this property value specifies the JMS Destination object to which a response message ought to be sent.",
      "ja": "このプロパティは、JMS 1.1仕様のセクション3.4.6で定義されたJMSメッセージヘッダフィールド「のJMSReplyTo」に相当します。特定の変形によって解釈されるように、このプロパティの値は、応答メッセージが送信されるべきにJMS宛先オブジェクトを指定します。"
    },
    {
      "indent": 0,
      "text": "4.2. \"jndi\" Variant",
      "section_title": true,
      "ja": "4.2.  「JNDI」バリアント"
    },
    {
      "indent": 3,
      "text": "The \"jndi\" variant implies the use of JNDI for discovering the Destination object. When this is specified as the variant, the <jms-dest> portion of the syntax is the name for JNDI lookup purposes. Additional JNDI-specific parameters can be specified. The JNDI-specific parameters SHOULD only be processed when the URI variant is \"jndi\".",
      "ja": "「JNDI」バリアントは、Destinationオブジェクトを発見するためのJNDIを使用することを意味します。これはバリアントとして指定されている場合、構文の<JMS-DEST>の部分は、JNDIルックアップのために、名前です。追加のJNDI固有のパラメータを指定することができます。 URI変異体は、「JNDI」のときJNDI固有のパラメータのみが処理されるべきです。"
    },
    {
      "indent": 0,
      "text": "4.2.1. JNDI Parameters",
      "section_title": true,
      "ja": "4.2.1.  JNDIパラメータ"
    },
    {
      "indent": 0,
      "text": "4.2.1.1. jndiConnectionFactoryName",
      "section_title": true,
      "ja": "4.2.1.1。 jndiConnectionFactoryName"
    },
    {
      "indent": 3,
      "text": "Specifies the JNDI name of the Java class (see Section 3.8, \"Identifiers\", of [JLS] for the specification of a legal Java class name) providing the connection factory.",
      "ja": "JavaクラスのJNDI名を指定します（3.8節を参照してください、法的なJavaクラス名の仕様について[JLS]の「識別子」、）接続ファクトリーを提供します。"
    },
    {
      "indent": 0,
      "text": "4.2.1.2. jndiInitialContextFactory",
      "section_title": true,
      "ja": "4.2.1.2。 jndiInitialContextFactory"
    },
    {
      "indent": 3,
      "text": "Specifies the fully qualified Java class name of the \"InitialContextFactory\" implementation class to use.",
      "ja": "使用する「INITIALCONTEXTFACTORY」実装クラスの完全修飾Javaクラス名を指定します。"
    },
    {
      "indent": 0,
      "text": "4.2.1.3. jndiURL",
      "section_title": true,
      "ja": "4.2.1.3。 jndiURL"
    },
    {
      "indent": 3,
      "text": "Specifies the JNDI provider URL, in a form consistent with javax.naming.spi.NamingManager.getURLContext(String scheme, Hashtable environment) as defined in the JNDI specification [JNDI].",
      "ja": "JNDI仕様[JNDI]で定義されるようjavax.naming.spi.NamingManager.getURLContext（文字列方式、ハッシュテーブル環境）と一致する形で、JNDIプロバイダURLを指定します。"
    },
    {
      "indent": 0,
      "text": "4.2.1.4. Additional JNDI Parameters",
      "section_title": true,
      "ja": "4.2.1.4。追加のJNDIパラメータ"
    },
    {
      "indent": 3,
      "text": "It is possible that connecting to a JNDI provider requires additional parameters. These parameters can be passed in as custom parameters (see Section 4.4). To identify a custom parameter as JNDI specific, the parameter name needs to start with the prefix \"jndi-\".",
      "ja": "JNDIプロバイダに接続すると、追加のパラメータを必要とするということも可能です。これらのパラメータは、カスタムパラメータ（4.4節を参照）として渡すことができます。特定のJNDIとしてカスタムパラメータを特定するには、パラメータ名は、接頭辞「jndi-」で開始する必要があります。"
    },
    {
      "indent": 3,
      "text": "For example, if the JNDI provider requires a parameter named \"com.example.jndi.someParameter\", you can supply the parameter in the URI as: jndi-com.example.jndi.someParameter=someValue",
      "ja": "JNDIプロバイダが「com.example.jndi.someParameter」という名前のパラメータを必要とする場合たとえば、あなたは、URIにパラメータを指定することができますように：JNDI-com.example.jndi.someParameter = someValueの"
    },
    {
      "indent": 0,
      "text": "4.2.2. Example of Performing a JNDI Lookup",
      "section_title": true,
      "ja": "4.2.2.  JNDIルックアップを実行する例"
    },
    {
      "indent": 3,
      "text": "To perform a lookup based on a \"jndi\" variant URI using Java APIs, an application might start by creating a JNDI InitialContext object. The InitialContext object can then be used to look up the JMS ConnectionFactory object (using the \"jndiConnectionFactoryName\" URI parameter), the target JMS Destination object (using the <jms-dest> portion of the JMS URI), and the \"replyToName\" JMS Destination object (if the \"replyToName\" parameter is specified on the URI). The application creates the InitialContext object by first setting up two properties: \"Context.INITIAL_CONTEXT_FACTORY\", with the value of the jndiInitialContextFactory JMS URI parameter; and \"Context.PROVIDER_URL\", with the value of the jndiURL URI parameter; and then passing the two properties to the InitialContext constructor.",
      "ja": "Java APIを使用して、「JNDI」バリアントURIに基づいて検索を実行するには、アプリケーションは、JNDI InitialContextオブジェクトを作成することによって開始される可能性があります。 InitialContextオブジェクトは、その後、（<JMS-DEST> JMS URIの部分を使用して）、ターゲットJMS先オブジェクト（「jndiConnectionFactoryName」URIパラメータを使用して）JMS接続オブジェクトをルックアップするために使用され、「replyToName」JMSすることができますDestinationオブジェクト（「replyToName」パラメータがURIに指定されている場合）。アプリケーションは、最初の2つのプロパティ設定してInitialContextオブジェクトを作成します。jndiInitialContextFactory JMS URIパラメータの値と、「Context.INITIAL_CONTEXT_FACTORYを」; jndiURL URIパラメータの値を持つと「に、Context.PROVIDER_URL」、。その後、InitialContextコンストラクタに2つのプロパティを渡します。"
    },
    {
      "indent": 3,
      "text": "To locate a connection factory or Destination object, the application passes the name of the object into the InitialContext.lookup() method.",
      "ja": "コネクション・ファクトリまたは宛先オブジェクトを見つけるために、アプリケーションはInitialContext.lookup（）メソッドへのオブジェクトの名前を渡します。"
    },
    {
      "indent": 3,
      "text": "For example, the JMS URI...",
      "ja": "例えば、JMS URI ..."
    },
    {
      "indent": 5,
      "text": "jms:jndi:REQ_QUEUE ?jndiURL=file:/C:/JMSAdmin &jndiInitialContextFactory =com.sun.jndi.fscontext.RefFSContextFactory &jndiConnectionFactoryName=CONNFACT &replyToName=RESP_QUEUE",
      "ja": "JMS：JNDI：？REQ_QUEUE jndiURL =ファイル：/ C：/ JMSAdminの＆jndiInitialContextFactory = com.sun.jndi.fscontext.RefFSContextFactory＆jndiConnectionFactoryName = CONNFACT＆replyToName = RESP_QUEUE"
    },
    {
      "indent": 3,
      "text": "...would be used by the following (non-normative) code sample to locate and retrieve a JMS ConnectionFactory called \"CONNFACT\", and JMS Destinations called \"REQ_QUEUE\" and \"RESP_QUEUE\", from a file-system JNDI context called \"c:/JMSAdmin\".",
      "ja": "...「CONNFACT」と呼ばれるJMS接続ファクトリを見つけて取得するには、次の（非規範的）コードサンプルで使用され、「Cと呼ばれるファイル・システムのJNDIコンテキストから「REQ_QUEUE」と「RESP_QUEUE」と呼ばれるJMS送り先、されるだろう：/ JMSAdminの」。"
    },
    {
      "indent": 5,
      "text": "/*\n * Preconditions on URI:\n * - portion <jms-dest> has been parsed into variable \"jms_dest\"\n * - parameters \"jndiConnectionFactoryName\",\n *   \"jndiInitialContextFactory\", \"replyToName\", and \"jndiURL\" have\n *   been parsed into variables of the same name.\n */\nHashtable environment = new Hashtable();\nenvironment.put(Context.INITIAL_CONTEXT_FACTORY,\n  jndiInitialContextFactory);\nenvironment.put(Context.PROVIDER_URL, jndiURL);\n/*\n *  Create File-System Initial Context\n */\nContext ctx = new InitialContext(environment);\n/*\n * Now get the JMS ConnectionFactory and Destination.  These will\n * be used later on in the application to create the JMS\n * Connection and send/receive messages.\n */\nConnectionFactory jmsConnFact = (ConnectionFactory)\n  ctx.lookup(jndiConnectionFactoryName);\nDestination requestDest = (Destination) ctx.lookup(jms_dest);\nDestination replyDest = (Destination) ctx.lookup(replyToName);",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The ConnectionFactory is used to create a Connection, which itself is used to create a Session. The Session can then be used to create the MessageProducer, which sends messages to the target Destination; and the MessageConsumer, which receives messages from the replyToName Destination (as shown in the following code extract).",
      "ja": "ConnectionFactoryのは、自身がセッションを作成するために使用された接続を作成するために使用されます。セッションは、ターゲットの宛先にメッセージを送信のMessageProducerを作成するために使用することができます。そして（次のコードの抜粋に示すように）replyToName宛先からメッセージを受信するのMessageConsumer、。"
    },
    {
      "indent": 5,
      "text": "/*\n * Create a producer to send a message to the request Destination\n * that was specified in the URI, then create the message, setting\n * the replyToName Destination in the message to the one specified\n * in the URI, and send it.\n */\nMessageProducer producer = sess.createProducer(requestDest);\nBytesMessage reqMsg = sess.createBytesMessage();\nreqMsg.setJMSReplyTo(replyDest);\nproducer.send(reqMsg);\n/*\n * Create a consumer to get a message from the replyToName\n * Destination using a selector to get the specific response to\n * this request.  The responder sets the correlation ID of the\n * response to the message ID of the request message.\n */\nMessageConsumer consumer = sess.createConsumer(replyDest,\n      \"JMSCorrelationID = '\" + reqMsg.getJMSMessageID() + \"'\");\nMessage respMsg = (Message) consumer.receive(300000);",
      "raw": true
    },
    {
      "indent": 0,
      "text": "4.2.2.1. Performing a JNDI Lookup with Custom Parameters",
      "section_title": true,
      "ja": "4.2.2.1。カスタムパラメータを使用したJNDIルックアップを実行します"
    },
    {
      "indent": 3,
      "text": "Any parameters with a prefix of \"jndi-\" MUST be used to set custom properties when establishing a connection to the JNDI provider. The name of the custom property is derived by removing the \"jndi-\" prefix from the URI parameter name, and the value of the property is the value of the parameter.",
      "ja": "「jndi-」の接頭辞を持つ任意のパラメータは、JNDIプロバイダへの接続を確立するときにカスタムプロパティを設定するために使用しなければなりません。カスタムプロパティの名前は、URIパラメータ名から「jndi-」プレフィックスを取り除くことによって導出され、プロパティの値は、パラメータの値です。"
    },
    {
      "indent": 3,
      "text": "For example, the JMS URI...",
      "ja": "例えば、JMS URI ..."
    },
    {
      "indent": 5,
      "text": "jms:jndi:REQ_QUEUE ?jndiURL=file:/C:/JMSAdmin &jndiInitialContextFactory =com.sun.jndi.fscontext.RefFSContextFactory &jndiConnectionFactoryName=CONNFACT &jndi-com.example.jndi.someParameter=someValue",
      "ja": "JMS：JNDI：？REQ_QUEUE jndiURL =ファイル：/ C：/ JMSAdminの＆jndiInitialContextFactory = com.sun.jndi.fscontext.RefFSContextFactory＆jndiConnectionFactoryName = CONNFACT＆JNDI-com.example.jndi.someParameter = someValueの"
    },
    {
      "indent": 3,
      "text": "...instructs the consumer to use the following properties to connect to the JNDI provider:",
      "ja": "...消費者がJNDIプロバイダーに接続するには、次のプロパティを使用するように指示します。"
    },
    {
      "indent": 5,
      "text": "java.naming.provider.url=file:/C:/JMSAdmin java.naming.factory.initial= com.sun.jndi.fscontext.RefFSContextFactory com.example.jndi.someParameter=someValue",
      "ja": "java.naming.provider.url =ファイル：/ C：/ JMSAdminのjava.naming.factory.initialの= com.sun.jndi.fscontext.RefFSContextFactory com.example.jndi.someParameter = someValueの"
    },
    {
      "indent": 0,
      "text": "4.3. Vendor Destination Names -- Variants \"queue\" and \"topic\"",
      "section_title": true,
      "ja": "4.3. ベンダー送信先の名前 - バリアント「キュー」と「トピック」"
    },
    {
      "indent": 3,
      "text": "The JMS Session object provides a means to directly access Queues and Topics. Specifically, it has the methods Session.createQueue(String name) and Session.createTopic(String name). These methods can be used to \"create\" the Java representation of an existing JMS Topic or Queue.",
      "ja": "JMS Sessionオブジェクトは、直接キューとトピックにアクセスするための手段を提供します。具体的には、方法Session.createQueue（文字列名）とSession.createTopic（文字列名）を有しています。これらのメソッドは、既存のJMSトピックまたはキューのJava表現を「作成」するために使用することができます。"
    },
    {
      "indent": 3,
      "text": "Since the Session interface requires external knowledge about whether a given name relates to a Queue or Topic, rather than introducing one new variant, this section defines two variants. A JMS URI can indicate which of these methods to use by specifying the appropriate variant -- either \"queue\" or \"topic\". For example:",
      "ja": "セッション・インターフェースではなく一つの新たな変異を導入するよりも、指定された名前は、キューまたはトピックに関連するかどうかについての外部知識を必要とするため、このセクションでは、2つの変異体を定義します。 「キュー」または「トピック」のどちらか -  JMS URIは、適切なバリアントを指定することで使用するために、これらの方法のかを示すことができます。例えば："
    },
    {
      "indent": 5,
      "text": "jms:queue:ExampleQueueName",
      "ja": "JMS：キュー：ExampleQueueName"
    },
    {
      "indent": 3,
      "text": "to identify a JMS Queue Destination, and",
      "ja": "JMSキュー宛先を識別するために、そして"
    },
    {
      "indent": 5,
      "text": "jms:topic:ExampleTopicName",
      "ja": "JMS：トピック：ExampleTopicName"
    },
    {
      "indent": 3,
      "text": "to identify a JMS Topic Destination.",
      "ja": "JMSトピック宛先を識別するために。"
    },
    {
      "indent": 3,
      "text": "JMS only specifies one way to obtain the names used by these APIs. With a JMS Queue or Topic available, an implementation can call Queue.getQueueName() or Topic.getTopicName(), respectively, both of which return a String object. To create a correct corresponding URI, the resulting string MUST use standard URI escape mechanisms so that the resulting characters conform to the production <jms-dest>.",
      "ja": "JMSは、これらのAPIで使用される名前を取得する1つの方法を指定します。 JMSキューまたはトピック使用可能で、実装は、Stringオブジェクトを返す両方とも、Queue.getQueueName（）またはTopic.getTopicName（）、それぞれを呼び出すことができます。結果の文字が生産<JMS-DEST>に準拠するように正しい対応するURIを作成するには、結果の文字列は、標準的なURIエスケープメカニズムを使用しなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.3.1. Treatment of replyToName Parameter",
      "section_title": true,
      "ja": "4.3.1.  replyToNameパラメータの扱い"
    },
    {
      "indent": 3,
      "text": "When used with the \"queue\" and \"topic\" variants, the replyToName parameter, specified in Section 4.1.4, always refers to a name of a JMS Queue to look up via the Session.createQueue() method, or its equivalent. For either variant, if a JMS Topic is instead required as a response Destination, a JMS URI can employ the \"topicReplyToName\" parameter. This parameter defines a name to look up with the Session.createTopic() method, or its equivalent.",
      "ja": "4.1.4項で指定された「キュー」と「トピック」の変種、replyToNameパラメータと共に使用する場合、必ずSession.createQueue（）メソッド、またはそれに相当経由でルックアップするJMSキューの名前を指します。 JMSトピックが代わりに応答先として要求される場合のいずれかの変異体については、JMS URIは「topicReplyToName」パラメータを利用することができます。このパラメータは、Session.createTopic（）メソッド、またはそれと同等で検索する名前を定義します。"
    },
    {
      "indent": 3,
      "text": "A JMS URI MUST NOT specify both a \"topicReplyToName\" and a \"replyToName\" parameter.",
      "ja": "JMS URIは「topicReplyToName」と「replyToName」パラメータの両方を指定してはなりません。"
    },
    {
      "indent": 0,
      "text": "4.3.2. Obtaining a Session via JNDI",
      "section_title": true,
      "ja": "4.3.2.  JNDI経由でセッションを取得"
    },
    {
      "indent": 3,
      "text": "Using the Session.createQueue() and Session.createTopic() methods assumes that a client program has already obtained a Session object. Where does that Session object come from -- how does a client get it? One way to get a Session is simply to access vendor-specific APIs.",
      "ja": "Session.createQueueを使用して（）とSession.createTopic（）メソッドは、クライアントプログラムがすでにSessionオブジェクトを取得していることを前提としています。そのSessionオブジェクトから来ない場合は - どのようにクライアントがそれを得るのでしょうか？セッションを取得するための一つの方法は、ベンダー固有のAPIにアクセスするだけです。"
    },
    {
      "indent": 3,
      "text": "Another way to get a Session object is to simply revert to using JNDI. That is, if a Session is not available to the client from some other context, the \"queue\" and \"topic\" variants MAY reuse the URL parameters specified in Section 4.2.1, \"JNDI Parameters\". Via JNDI, those parameters will identify a ConnectionFactory, which can then be used to obtain a Session object.",
      "ja": "Sessionオブジェクトを取得するための別の方法は、単純にJNDIを使用してに戻すことです。セッションは、他のいくつかの文脈から、クライアントが利用可能でない場合、つまり、「キュー」と「トピック」変異体は、セクション4.2.1、「JNDIパラメータ」で指定されたURLパラメータを再利用することができます。 JNDI経由して、これらのパラメータは、Sessionオブジェクトを取得するために使用することができたConnectionFactoryを識別します。"
    },
    {
      "indent": 3,
      "text": "Combining the \"queue\" and \"topic\" variants with JNDI lookup for an implementation of ConnectionFactory raises an important consideration for JMS URI clients. Once clients employ JNDI for one part of discovering a Destination, they almost certainly could use a vendor-neutral JNDI lookup for a Destination object itself, rather than using vendor-specific means. As a result, clients need to carefully consider whether it makes sense to use JNDI for one part of this problem, without using it for the other.",
      "ja": "ConnectionFactoryの実装のためにJNDIルックアップで「キュー」と「トピック」の変種を組み合わせることにより、JMS URIのクライアントのための重要な考慮事項を提起します。クライアントが接続先を発見するの一部のためにJNDIを使用したら、彼らはほぼ確実ではなく、ベンダー固有の手段を使用するよりも、Destinationオブジェクト自身のためにベンダー中立JNDIルックアップを使用することができます。その結果、クライアントは、それが他のためにそれを使用せずに、この問題の一部のためにJNDIを使用するために理にかなっているかどうかを慎重に検討する必要があります。"
    },
    {
      "indent": 0,
      "text": "4.3.3. Limitations of \"queue\" and \"topic\"",
      "section_title": true,
      "ja": "4.3.3.  「キュー」と「トピック」の制限事項"
    },
    {
      "indent": 3,
      "text": "The JMS specification clearly identifies the two methods on the Session interface as returning vendor-specific names for Destinations. Consequently, users of the \"jms\" URI scheme ought to carefully consider when these two variants might be employed. If users plan on switching between JMS vendors, they might also need to plan on regenerating resources that contain URIs in this vendor-specific form.",
      "ja": "JMS仕様では、明らかに目的地のベンダー固有の名前を返すようにSessionインターフェース上の2つのメソッドを識別する。その結果、「JMS」のユーザーは、URIスキームは、これら二つの変異体が採用されるかもしれない時に慎重に検討するべきです。ユーザーがJMSベンダー間の切り替えを計画している場合、彼らはまた、このベンダー固有の形式でのURIが含まれているリソースの再生を計画する必要があるかもしれません。"
    },
    {
      "indent": 3,
      "text": "A JMS vendor can provide alternate ways to obtain the names that can be passed to Session.createQueue() and Session.createTopic(). When using names derived from those alternate means, users of this URI specification are encouraged to verify that the obtained names work as expected in all circumstances.",
      "ja": "JMSベンダーはSession.createQueue（）とSession.createTopic（）に渡すことができる名を取得する別の方法を提供することができます。これらの代替手段に由来する名前を使用する場合、このURI仕様のユーザは、すべての状況で期待どおりに得られた名前が動作することを確認することが奨励されます。"
    },
    {
      "indent": 0,
      "text": "4.4. Custom Parameters",
      "section_title": true,
      "ja": "4.4. カスタムパラメータ"
    },
    {
      "indent": 3,
      "text": "The set of parameters is extensible. Any other vendor- or application-defined parameter can be supplied, in the URI, by passing it as <param-name>=<param-value>, just like the set of well-known parameters.",
      "ja": "パラメータのセットは拡張可能です。他のベンダーまたはアプリケーションで定義されたパラメータは、単に周知のパラメータのセットのように、<PARAM名> = <PARAM値>のようにそれを通すことによって、URIで、供給することができます。"
    },
    {
      "indent": 3,
      "text": "WARNING: Vendors and applications MUST NOT include sensitive information (such as authorization tokens) in a URI. Other means of authorization, authentication, and identification ought to be used. Also see the security discussion below about properties that might be duplicated as JMS message properties.",
      "ja": "WARNING：ベンダーとアプリケーションがURIに（例えば、認証トークンなど）の機密情報を含んではいけません。認可、認証、および識別の他の手段が使用されるべきです。また、JMSメッセージ・プロパティとして複製する可能性があるプロパティについて以下のセキュリティの議論を参照してください。"
    },
    {
      "indent": 0,
      "text": "5. Encoding Considerations",
      "section_title": true,
      "ja": "5.エンコードの考慮事項"
    },
    {
      "indent": 3,
      "text": "The \"jms\" URI scheme distinguishes between <unreserved> characters and <pct-encoded> characters, as defined in [RFC3986]. Apart from these encoding considerations, the characters \"?\" and \"&\" MUST be encoded when they appear within the <jms-dest> particle (for example, a JNDI name) or in query parameters. The character \":\" SHOULD be escaped when appearing in the <jms-dest> portion of the syntax.",
      "ja": "「JMS」URIスキームは[RFC3986]で定義されるように、<未予約>文字と<PCTエンコード>文字を区別する。別にこれらのエンコーディングの配慮から、文字「？」それらは（例えば、JNDI名）<JMS-DEST>粒子内またはクエリパラメータに表示されたときに「＆」符号化されなければなりません。文字は「：」構文の<JMS-DEST>の部分に登場する際にエスケープする必要があります。"
    },
    {
      "indent": 3,
      "text": "Conversions to and from Internationalized Resource Identifiers (IRIs) follow the rules of RFC 3987, Sections 3.1 and 3.2. As per Sections 1.2-c. and 6.4 of [RFC3987], all parts of the JMS URI MUST use the UTF-8 encoding when converting to and from the IRI format.",
      "ja": "国際化リソース識別子（のIRI）へ及びからの変換は、RFC 3987、セクション3.1および3.2の規則に従います。セクション1.2-Cあたりとして。およびIRIの形式から変換するときと[RFC3987]の6.4、JMS URIのすべての部分は、UTF-8エンコーディングを使用しなければなりません。"
    },
    {
      "indent": 0,
      "text": "6. Applications/Protocols That Use the JMS URI",
      "section_title": true,
      "ja": "JMS URIを使用してください6.アプリケーション/プロトコル"
    },
    {
      "indent": 3,
      "text": "A variety of vendors provide implementations of the JMS Service Provider Interface (SPI). These products interoperate at the API level, in the Java programming language.",
      "ja": "ベンダーの様々なJMSサービスプロバイダインタフェース（SPI）の実装を提供します。これらの製品は、Javaプログラミング言語で、APIレベルでの相互運用します。"
    },
    {
      "indent": 3,
      "text": "Some vendors have provided additional products that interoperate with their own SPI implementations. These extensions might also be able to make use of this URI scheme.",
      "ja": "一部のベンダーは、独自のSPIの実装と相互運用追加の製品を提供しています。これらの拡張機能は、また、このURIスキームを利用することができるかもしれません。"
    },
    {
      "indent": 3,
      "text": "The vendors working on this URI scheme are also working on a specification for carrying SOAP messages over their respective implementations of JMS [SOAP-JMS]. In addition, the Service Component Architecture Bindings technical committee (TC) [SCA-TC] at OASIS employs the \"jms\" URI scheme to identify JMS Destinations in [SCA-JMS].",
      "ja": "このURIスキームに取り組んベンダーも、JMS [SOAP-JMS]のそれぞれの実装でSOAPメッセージを搬送するための仕様に取り組んでいます。また、OASISにおけるサービス・コンポーネント・アーキテクチャーバインディング技術委員会（TC）[SCA-TCは] [SCA-JMS]でJMS宛先を識別するための \"JMS\" URIスキームを採用しています。"
    },
    {
      "indent": 0,
      "text": "7. Interoperability Considerations",
      "section_title": true,
      "ja": "7.相互運用性に関する注意事項"
    },
    {
      "indent": 3,
      "text": "This \"jms\" URI scheme focuses on identifying a JMS Destination object, and some characteristics of communication using that Destination, and specifically excludes any notion of describing how JMS itself is implemented and how it delivers messages. As a consequence of this focus, interoperability concerns are limited to how implementations obtain and use a Destination object.",
      "ja": "この「JMS」URIスキームは、JMS宛先オブジェクト、及びその宛先を用いた通信のいくつかの特徴を特定することに焦点を当て、特にJMS自体が実装されている方法を記述する任意の概念を排除し、それがメッセージを配信する方法。この焦点の結果として、相互運用性の問題は、実装がDestinationオブジェクトを取得し、使用する方法に限定されています。"
    },
    {
      "indent": 3,
      "text": "This scheme definition describes three variants for obtaining a Destination. These variants achieve their aims with the use of JNDI and JMS APIs, with no new APIs or protocols defined here. As a consequence of using JNDI and JMS, interoperability concerns might arise if implementations do not conform to the specifications for those APIs. Further, the use of Java, and JNDI in particular, means that the configuration of the execution environment and the use of Java ClassLoaders can affect the interpretation of any given URI.",
      "ja": "このスキームの定義は、先を取得するための3つの変形を説明します。これらの変異体は、ここで定義されていない新しいAPIやプロトコルで、JNDIおよびJMS APIを使用して彼らの目的を達成します。実装は、これらのAPIの仕様に準拠していない場合は、JNDIとJMSを使用しての結果として、相互運用性の問題が発生する可能性があります。さらに、特にJava、およびJNDIの使用は、実行環境の設定とJavaクラスローダの使用は任意のURIの解釈に影響を与えることができることを意味します。"
    },
    {
      "indent": 3,
      "text": "Consumers of these URIs are urged to consider the scope and consistency of the environment across which these URIs will be shared.",
      "ja": "これらのURIの消費者はこれらのURIが共有される全体で環境の範囲との整合性を考慮することが要請されています。"
    },
    {
      "indent": 3,
      "text": "As described in Section 4, others can define additional variants, which provide the means to describe how to look up JMS Destination objects in a manner specific to some environment. For any new variant, the shared parameters defined in Section 4.1 MUST have the same meaning in that variant as they do here. That way, tools and people can safely copy these parameters between environments. Note that while additional variants might seem more flexible, employing variants not defined here might make it more difficult to switch to an alternate JMS provider.",
      "ja": "第4節で説明したように、他の人は、いくつかの環境に固有の方法でJMSのDestinationオブジェクトをルックアップする方法を記述するための手段を提供する追加のバリアントを定義することができます。彼らはここでそうであるように任意の新しい亜種については、4.1節で定義された共有パラメータは、そのバリアントで同じ意味を持たなければなりません。その方法、ツール、および人々が安全な環境の間で、これらのパラメータをコピーすることができます。追加の変異体は、より柔軟なように見えるかもしれないが、ここで定義されていないバリエーションを採用することがより困難代替JMSプロバイダに切り替えることになるかもしれないことに注意してください。"
    },
    {
      "indent": 0,
      "text": "8. Security Considerations",
      "section_title": true,
      "ja": "8.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "Section 7 of [RFC3986] identifies some of the security concerns that ought to be addressed by this specification.",
      "ja": "[RFC3986]のセクション7は、本明細書によって対処されるべきセキュリティ上の懸念の一部を識別する。"
    },
    {
      "indent": 0,
      "text": "8.1. Reliability and Consistency",
      "section_title": true,
      "ja": "8.1. 信頼性と一貫性"
    },
    {
      "indent": 3,
      "text": "This specification identifies only the variant (<jms-variant>) and variant-specific details (<jms-dest>) as an essential part of the URI. For reliability and consistency purposes, these variants are the only part that can reasonably be expected to be stable. Other optional JMS configuration and message properties indicated as URI parameters, like \"timeToLive\", can reasonably be determined by the sender of a message, without affecting the recipient. Insofar as a recipient might wish to dictate certain parameters, such as the \"jndiConnectionFactoryName\", those parameters can be specified.",
      "ja": "この仕様は、URIの不可欠な部分としてのみ変異体（<JMS-バリアント>）および変異体の具体的な詳細（<JMS-DEST>）を識別する。信頼性と一貫性の目的のために、これらの変異体は、合理的に安定していることが期待できる唯一の部分です。 「生存時間」のように、URIパラメータとして示される他の任意のJMS構成とメッセージ特性が、合理的に受信者に影響を与えずに、メッセージの送信者により決定することができます。受信者は、このような「jndiConnectionFactoryName」などの特定のパラメータを、口述を希望するかもしれない限りにおいて、これらのパラメータを指定することができます。"
    },
    {
      "indent": 0,
      "text": "8.2. Malicious Construction",
      "section_title": true,
      "ja": "8.2. 悪意のある建設"
    },
    {
      "indent": 0,
      "text": "8.2.1. Recipient Concerns",
      "section_title": true,
      "ja": "8.2.1. 受信者の懸念"
    },
    {
      "indent": 3,
      "text": "A malicious consumer of a service using a JMS URI could send, as part of a JMS message, a URI with a parameter such as \"timeToLive\" with a value specified in the URI that differs from the corresponding JMS message property (\"JMSExpiration\" header field, in this example). In the case of such messages with such URIs, recipients are strongly cautioned to avoid applying processing logic based on particular URI parameters. Discrepancies in the message could be used to exploit differences in behavior between the selectors that a JMS-based application might use to affect which messages it sees, and the processing of the rest of the application. As defined in this document, the parameters of concern include:",
      "ja": "JMS URIを使用してサービスの悪意のある消費者は、JMSメッセージの一部として送信することができ、対応するJMSメッセージプロパティは異なるURIで指定された値を持つような「生存時間」などのパラメータを持つURI（「たJMSExpiration」ヘッダこの例では、フィールド、）。そのようなURIにこのようなメッセージの場合、受信者は強く特定のURIパラメータに基づいて処理ロジックを適用することを避けるために警告されます。メッセージでの不一致はJMSベースのアプリケーションは、それが見ているメッセージに影響するために使用するかもしれないセレクタ、およびアプリケーションの残りの部分の処理動作の違いを利用するために使用することができます。この文書で定義されているように、関心のパラメータは、次のとおりです。"
    },
    {
      "indent": 6,
      "text": "deliveryMode",
      "ja": "配信モード"
    },
    {
      "indent": 6,
      "text": "timeToLive",
      "ja": "有効期間"
    },
    {
      "indent": 6,
      "text": "priority",
      "ja": "優先"
    },
    {
      "indent": 3,
      "text": "Message senders are strongly urged to remove from the URI extra parameters like the above in environments where the data will be redundant with information specified elsewhere in the JMS message.",
      "ja": "メッセージ送信者が強くデータはJMSメッセージ内の他の場所で指定された情報と重複する場所の環境で上記のようなURI追加パラメータから除去するように付勢されています。"
    },
    {
      "indent": 3,
      "text": "Any use of additional parameters, either as a part of a definition of a new variant or for more general use, SHOULD also specify whether those parameters ought to be removed by a sender as specified here. If a recipient is aware of the \"jms\" URI scheme, and it receives a message containing a JMS URI, it MUST ignore or discard parameters that it does not recognize.",
      "ja": "新しい亜種の定義の一部として、または、より一般的な使用のためのいずれかの追加のパラメータの使用は、また、これらのパラメータは、ここで指定された送信者によって除去されるべきであるかどうかを指定する必要があります。受信者が「JMS」URIスキームを認識し、そしてそれはJMS URIを含むメッセージを受信した場合、それは認識されないパラメータを無視するか、捨てなければなりません。"
    },
    {
      "indent": 0,
      "text": "8.2.2. Sender Concerns",
      "section_title": true,
      "ja": "8.2.2. 送信者の懸念"
    },
    {
      "indent": 3,
      "text": "A third party could intercept and replace a URI containing any of the JMS/JNDI configuration parameters, such as \"jndiConnectionFactoryName\", \"jndiInitialContextFactory\", or \"jndiURL\". As these parameters can affect how an implementation establishes an initial connection, such parameters could be used as a means to subvert communications. This could possibly result in re-routing communications to third parties, who could then monitor sent messages. Clients SHOULD NOT use these URI parameters unless assured of their validity in trusted environments.",
      "ja": "第三者は、そのような「jndiConnectionFactoryName」、「jndiInitialContextFactory」、または「jndiURL」としてJMS / JNDIの設定パラメータのいずれかを含むURIを傍受して置き換えることができます。これらのパラメータは実装が初期接続を確立する方法に影響を与えることができるように、そのようなパラメータは、通信を破壊するための手段として使用することができます。これは、おそらくその後、送信されたメッセージを監視することができ、第三者への再ルーティング通信につながる可能性があります。信頼された環境でその有効性が保証されない限り、クライアントはこれらのURIパラメータを使用しないでください。"
    },
    {
      "indent": 0,
      "text": "8.3. Back-End Transcoding",
      "section_title": true,
      "ja": "8.3. バックエンドトランスコーディング"
    },
    {
      "indent": 3,
      "text": "This specification, in using the URI specification and building around the JMS specification, has no particular transcoding issues. Any such issues are problems with the underlying implementation of Java and the Java Messaging Service being employed.",
      "ja": "この仕様は、JMS仕様の周りのURIの仕様と建物を使用して、特別なトランスコーディングの問題を持っていません。任意のそのような問題は、使用されるJavaおよびJavaのメッセージングサービスの基本となる実装に問題があります。"
    },
    {
      "indent": 0,
      "text": "8.4. Semantic Attacks",
      "section_title": true,
      "ja": "8.4. セマンティック攻撃"
    },
    {
      "indent": 3,
      "text": "A possible semantic attack on the \"jndi\" variant could be accomplished by replacing characters of the JMS URI from one language with equivalent-looking characters from another language, known as an \"Internationalized Domain Name (IDN) homograph attack\" [HOMOGRAPH]. This kind of attack could occur in a variety of ways. For example, if an environment allows for the automatic registration of JNDI Destination names, a malicious actor could register and then publicize an alternate of an existing Destination name. Such an environment ought to prevent the use of homograph equivalents, perhaps by restricting allowed characters, so that clients do not accidentally send their requests to unintended Destinations.",
      "ja": "「JNDI」変異体上の可能な意味論的な攻撃は、「国際化ドメイン名（IDN）同形異義語攻撃」[同形異義語]として知られている他の言語、から同等に見える文字を一つの言語からJMS URIの文字を置換することによって達成することができます。この種の攻撃は、さまざまな方法で発生する可能性があります。環境は、JNDI先名の自動登録を可能にした場合、悪質な俳優が登録して、既存の宛先名の代替を公表できます。このような環境では、クライアントが誤って意図しない宛先に自分の要求を送信しないように、おそらく使用できる文字を制限することにより、同形異義語の同等物の使用を防止するべきです。"
    },
    {
      "indent": 3,
      "text": "The \"queue\" and \"topic\" variants are subject to the same concerns as the \"jndi\" variant. In addition, because the Destination names are vendor defined, URIs employing these two variants might employ special characters that significantly change the meaning of the URI. It is possible that the introduction of a single character -- difficult for a human to notice -- might dramatically change the intended meaning of a URI. In situations where this might be an issue, users of this URI are urged to strongly consider the \"jndi\" variant instead.",
      "ja": "「キュー」と「トピック」の変異体は、「JNDI」変種と同じ懸念の対象となっています。また、送信先名は、これら二つの変形を採用するURIは大幅にURIの意味を変更する特殊文字を採用するかもしれない、ベンダーが定義されているためです。困難な人が気づくためには -   - 劇的URIの意図する意味を変更する場合があります単一の文字の導入がいる可能性があります。これが問題になる可能性がある状況では、このURIのユーザーが強く代わりに「JNDI」バリアントを考慮することが要請されています。"
    },
    {
      "indent": 0,
      "text": "8.5. Other Security Concerns",
      "section_title": true,
      "ja": "8.5. その他のセキュリティの懸念"
    },
    {
      "indent": 3,
      "text": "This specification does not define or anticipate any use for IP addresses as part of the URI, so no issues around IP addresses, rare or otherwise, are raised by this specification.",
      "ja": "この仕様は、そのIPアドレスの周りに問題なく、珍しいまたはそれ以外の場合は、URIの一部として、IPアドレスのいずれかの使用を定義したり、予想していない、この仕様によって提起されています。"
    },
    {
      "indent": 3,
      "text": "This specification does not define any characteristics of a \"jms\" scheme URI that contain sensitive information.",
      "ja": "この仕様は、機密情報を含む「JMS」スキームURIのいずれかの特性を定義していません。"
    },
    {
      "indent": 0,
      "text": "9. IANA Considerations",
      "section_title": true,
      "ja": "9. IANAの考慮事項"
    },
    {
      "indent": 0,
      "text": "9.1. URI Scheme Registration",
      "section_title": true,
      "ja": "9.1.  URIスキームの登録"
    },
    {
      "indent": 3,
      "text": "IANA registered the Java Message Service URI scheme described in this document, according to the following scheme registration request, using the template from [RFC4395]:",
      "ja": "IANAは[RFC4395]からテンプレートを使用して、以下のスキーム登録要求に応じて、この文書に記載されたJavaメッセージサービスURIスキームを登録しました："
    },
    {
      "indent": 3,
      "text": "o URI scheme name: jms",
      "ja": "O URIスキーム名：JMS"
    },
    {
      "indent": 3,
      "text": "o Status: Provisional",
      "ja": "Oステータス：暫定"
    },
    {
      "indent": 3,
      "text": "o URI scheme syntax: See Section 3",
      "ja": "URIスキームの構文O：第3節を参照してください。"
    },
    {
      "indent": 3,
      "text": "o URI scheme semantics: See Section 4",
      "ja": "URIスキームのセマンティクスO：第4節を参照してください。"
    },
    {
      "indent": 3,
      "text": "o Encoding considerations: See Section 5",
      "ja": "Oエンコーディングの考慮事項：第5節を参照してください。"
    },
    {
      "indent": 3,
      "text": "o Applications/protocols that use this URI scheme name: See Section 6",
      "ja": "このURIのスキーム名を使用するOアプリケーション/プロトコル：第6節を参照"
    },
    {
      "indent": 3,
      "text": "o Interoperability considerations: See Section 7",
      "ja": "Oの相互運用性に関する注意事項：セクション7を参照してください。"
    },
    {
      "indent": 3,
      "text": "o Security considerations: See Section 8",
      "ja": "Oセキュリティの考慮事項：セクション8を参照してください。"
    },
    {
      "indent": 3,
      "text": "o Contact: See the Authors' Addresses section",
      "ja": "O問い合わせ先：著者のアドレスセクションを参照してください。"
    },
    {
      "indent": 3,
      "text": "o References: See the References section",
      "ja": "O参照：参考資料を参照してください"
    },
    {
      "indent": 0,
      "text": "9.2. \"jms\" URI Scheme Registries",
      "section_title": true,
      "ja": "9.2.  「JMS」URIスキームのレジストリ"
    },
    {
      "indent": 3,
      "text": "Per this URI scheme, IANA has created a registry for possible \"variants\". IANA can reject obviously bogus registrations.",
      "ja": "このURIスキームごとに、IANAは、可能な「変異体」のレジストリを作成しました。 IANAは明らかに偽の登録を拒否することができます。"
    },
    {
      "indent": 0,
      "text": "9.2.1. JMS URI Variants",
      "section_title": true,
      "ja": "9.2.1.  JMS URIバリアント"
    },
    {
      "indent": 3,
      "text": "This registry provides a listing of \"jms\" URI scheme variants. Variant names beginning with \"vnd.\" are reserved for vendor extensions. Such variants should follow a pattern of vnd.<vendorname>.<label>. The <vendorname> corresponds to the iana-vendor-tag production from [RFC6075], and vendor.<vendorname> must already be registered in the Application Configuration Access Protocol (ACAP) Vendor Subtree. The <label> is chosen by said vendor.",
      "ja": "このレジストリは、「JMS」URIスキーム変異体のリストを提供します。バリアント名が始まる「VND。」ベンダー拡張のために予約されています。このような変異体はVNDのパターンに従ってください。<vendorname>。<ラベル>。 <vendorname> [RFC6075]、およびベンダーからIANAベンダータグの製造に対応する。<vendorname>は、既にアプリケーション設定アクセスプロトコル（ACAP）ベンダーサブツリーに登録しなければなりません。 <ラベル>は言っベンダーによって選ばれます。"
    },
    {
      "indent": 3,
      "text": "All variant names are to be registered on a first come, first served basis.",
      "ja": "すべてのバリアント名は先着順に登録されることになります。"
    },
    {
      "indent": 3,
      "text": "Variants must conform to the \"jms-variant\" production above. Since variants occur in URIs, they ought to be short, and MUST NOT be more than forty characters in length.",
      "ja": "バリアントは、上記の「JMS-変異体」の生産に適合しなければなりません。変異体はURIの中で発生しているので、彼らは短くあるべき、との長さ以上の40文字にすることはできません。"
    },
    {
      "indent": 3,
      "text": "This document defines the \"jndi\", \"queue\", and \"topic\" variants initially included in the registry.",
      "ja": "この文書では、「JNDI」、「キュー」、および「トピック」、最初はレジストリに含まバリアントを定義します。"
    },
    {
      "indent": 0,
      "text": "9.2.2. \"jms\" URI Scheme Variant Registration Template",
      "section_title": true,
      "ja": "9.2.2.  「JMS」URIスキームバリアントの登録テンプレート"
    },
    {
      "indent": 3,
      "text": "This template describes the fields that must be present to register a new variant for use in a JMS URI.",
      "ja": "このテンプレートは、JMS URIで使用するための新しいバリアントを登録するために存在しなければならないフィールドについて説明します。"
    },
    {
      "indent": 3,
      "text": "To: iana@iana.org Subject: Registration of JMS URI variant name",
      "ja": "To：iana@iana.org件名：JMS URIの登録バリアント名"
    },
    {
      "indent": 3,
      "text": "JMS URI variant name: Variants must conform to the \"jms-variant\" production above. Since variants occur in URIs, they ought to be short, and MUST NOT be more than forty characters in length.",
      "ja": "JMS URIバリアント名：バリアントは、上記の「JMS-変異体」の生産に適合しなければなりません。変異体はURIの中で発生しているので、彼らは短くあるべき、との長さ以上の40文字にすることはできません。"
    },
    {
      "indent": 3,
      "text": "Description: A description of the purpose of the variant being registered.",
      "ja": "説明：バリアントの目的の説明が登録されています。"
    },
    {
      "indent": 3,
      "text": "Contact Information: Name(s) and email address(es) to contact for more information about this registration.",
      "ja": "連絡先：名前（複数可）とメールアドレス（複数可）は、この登録の詳細については連絡します。"
    },
    {
      "indent": 3,
      "text": "Description URL: If available, a URL for a document describing the details of how the variant works.",
      "ja": "説明URL：利用可能な場合、バリアントがどのように動作するかの詳細を説明する文書のURL。"
    },
    {
      "indent": 3,
      "text": "Comments: Any comments the requester thinks are relevant to this request.",
      "ja": "コメント：要求者がこの要求に関連していると考えて任意のコメント。"
    },
    {
      "indent": 3,
      "text": "Change Controller: Contact information for the person who controls further changes to this variant definition.",
      "ja": "コントローラを変更：このバリアントの定義にさらに変更を支配する者の連絡先情報。"
    },
    {
      "indent": 0,
      "text": "9.2.3. Change Control",
      "section_title": true,
      "ja": "9.2.3. 変更管理"
    },
    {
      "indent": 3,
      "text": "Once a JMS URI variant registration has been published by IANA, the change controller can request a change to its definition. The change request follows the same procedure as the registration request.",
      "ja": "JMS URIバリアントの登録がIANAによって公表された後、変更コントローラはその定義への変更を要求することができます。変更要求は、登録要求と同じ手順に従います。"
    },
    {
      "indent": 3,
      "text": "The change controller of a JMS URI variant can pass responsibility for the JMS URI variant to another person or agency by informing IANA; this can be done without discussion or review.",
      "ja": "JMS URIバリアントの変更コントローラは、IANAに通知することにより、他の人や機関にJMS URIバリアントの責任を渡すことができます。これは、議論や検討せずに行うことができます。"
    },
    {
      "indent": 3,
      "text": "JMS URI variant registrations MUST NOT be deleted; mechanisms that are no longer believed appropriate for use can be marked as obsolete in the Comment field.",
      "ja": "JMS URIバリアントの登録を削除しないでください。もはや使用するのに適したと考えられているメカニズムは、コメント欄で時代遅れとしてマークすることができます。"
    },
    {
      "indent": 3,
      "text": "In exceptional circumstances, the IESG can reassign responsibility for a JMS URI variant.",
      "ja": "例外的な状況では、IESGは、JMS URIバリアントの責任を再割り当てすることができます。"
    },
    {
      "indent": 3,
      "text": "The IESG is considered to be the owner of all JMS URI variants that are on the IETF Standards Track.",
      "ja": "IESGは、IETF標準化過程の上にあるすべてのJMS URI変異体の所有者であると考えられています。"
    },
    {
      "indent": 0,
      "text": "10. Contributors",
      "section_title": true,
      "ja": "10.協力者"
    },
    {
      "indent": 3,
      "text": "The authors gratefully acknowledge the contributions of:",
      "ja": "作者は感謝の貢献を認めます："
    },
    {
      "indent": 6,
      "text": "Phil Adams International Business Machines Corporation EMail: phil_adams@us.ibm.com",
      "ja": "フィル・アダムスたInternational Business Machines Corp.の電子メール：phil_adams@us.ibm.com"
    },
    {
      "indent": 6,
      "text": "Glen Daniels WSO2 EMail: glen@wso2.com",
      "ja": "グレン・ダニエルズWSO2 Eメール：glen@wso2.com"
    },
    {
      "indent": 6,
      "text": "Peter Easton Progress Software EMail: peaston@progress.com",
      "ja": "ピーター・イーストンプログレスソフトウェアEメール：peaston@progress.com"
    },
    {
      "indent": 6,
      "text": "Tim Frank Software AG. EMail: tim.frank@softwareag.com",
      "ja": "ティム・フランク・ソフトウェアAG。メールアドレス：tim.frank@softwareag.com"
    },
    {
      "indent": 6,
      "text": "Lei Jin BEA Systems, Inc. until March 2007",
      "ja": "レイジンBEAシステムズ株式会社2007年3月まで"
    },
    {
      "indent": 6,
      "text": "Eric Johnson TIBCO Software Inc. EMail: eric@tibco.com",
      "ja": "エリック・ジョンソンTIBCO Software Inc.のEメール：eric@tibco.com"
    },
    {
      "indent": 6,
      "text": "Vinod Kumar BEA Systems, Inc. until May 2007",
      "ja": "ビノッド・クマールBEAシステムズ株式会社2007年5月まで"
    },
    {
      "indent": 6,
      "text": "Amelia A. Lewis TIBCO Software Inc. EMail: alewis@tibco.com",
      "ja": "アメリアA.ルイスTIBCO Software Inc.のEメール：alewis@tibco.com"
    },
    {
      "indent": 6,
      "text": "Roland Merrick International Business Machines Corporation until June 2009",
      "ja": "ローランド・メリックインターナショナル・ビジネス・マシーンズ・コーポレーション2009年6月まで"
    },
    {
      "indent": 6,
      "text": "Mark Phillips International Business Machines Corporation EMail: m8philli@uk.ibm.com",
      "ja": "マーク・フィリップスたInternational Business Machines Corp.の電子メール：m8philli@uk.ibm.com"
    },
    {
      "indent": 6,
      "text": "Derek Rokicki Software AG. EMail: derek.rokicki@softwareag.com",
      "ja": "デレクRokickiソフトウェアAG。メール：derek.rokicki@softwareag.com"
    },
    {
      "indent": 6,
      "text": "Stephen Todd International Business Machines Corporation until April 2007",
      "ja": "スティーブン・トッド・インターナショナル・ビジネス・マシーンズ・コーポレーション2007年4月まで"
    },
    {
      "indent": 6,
      "text": "Dongbo Xiao Oracle Corp. EMail: dongbo.xiao@oracle.com",
      "ja": "DongboシャオオラクルEメール：dongbo.xiao@oracle.com"
    },
    {
      "indent": 6,
      "text": "Prasad Yendluri Software AG. EMail: prasad.yendluri@softwareag.com",
      "ja": "プラサドYendluriソフトウェアAG。メールアドレス：prasad.yendluri@softwareag.com"
    },
    {
      "indent": 0,
      "text": "11. Acknowledgements",
      "section_title": true,
      "ja": "11.謝辞"
    },
    {
      "indent": 3,
      "text": "Oracle and Java are registered trademarks of Oracle and/or its affiliates. Other names may be trademarks of their respective owners.",
      "ja": "OracleとJavaは、Oracle Corporationおよび/またはその関連会社の登録商標です。その他の名称はそれぞれの所有者の商標である場合があります。"
    },
    {
      "indent": 0,
      "text": "12. References",
      "section_title": true,
      "ja": "12.参考文献"
    },
    {
      "indent": 0,
      "text": "12.1. Normative References",
      "section_title": true,
      "ja": "12.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[JLS] Sun Microsystems, Inc., \"The Java Language Specification, Third Edition\", January 2005, <http://java.sun.com/docs/books/jls/third_edition/html/ j3TOC.html>.",
      "ja": "[JLS]サン・マイクロシステムズ社、 \"Java言語仕様第3版\"、2005年1月、<http://java.sun.com/docs/books/jls/third_edition/html/ j3TOC.html>。"
    },
    {
      "indent": 3,
      "text": "[JMS] Hapner, M., Burridge, R., Sharma, R., Fialli, J., and K. Stout, \"Java Message Service\", April 2002, <http://java.sun.com/products/jms/>.",
      "ja": "[JMS] Hapner、M.、Burridge、R.、シャルマ、R.、Fialli、J.、およびK.スタウト、 \"Javaメッセージサービス\" 2002年4月、<http://java.sun.com/products/ JMS />。"
    },
    {
      "indent": 3,
      "text": "[JNDI] Sun Microsystems, Inc., \"Java Naming and Directory Interface Application Programming Interface\", July 1999, <http://java.sun.com/products/jndi/docs.html>.",
      "ja": "[JNDI]サン・マイクロシステムズ社、 \"のJavaネーミングとディレクトリインターフェースアプリケーション・プログラミング・インターフェース\"、1999年7月、<http://java.sun.com/products/jndi/docs.html>。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3629] Yergeau, F., \"UTF-8, a transformation format of ISO 10646\", STD 63, RFC 3629, November 2003.",
      "ja": "[RFC3629] Yergeau、F.、 \"UTF-8、ISO 10646の変換フォーマット\"、STD 63、RFC 3629、2003年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC3986] Berners-Lee, T., Fielding, R., and L. Masinter, \"Uniform Resource Identifier (URI): Generic Syntax\", STD 66, RFC 3986, January 2005.",
      "ja": "[RFC3986]バーナーズ - リー、T.、フィールディング、R.、およびL. Masinter、 \"ユニフォームリソース識別子（URI）：汎用構文\"、STD 66、RFC 3986、2005年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC3987] Duerst, M. and M. Suignard, \"Internationalized Resource Identifiers (IRIs)\", RFC 3987, January 2005.",
      "ja": "[RFC3987] Duerst、M.およびM. Suignard、 \"国際化リソース識別Fiers（IRI）\"、RFC 3987、2005年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC4395] Hansen, T., Hardie, T., and L. Masinter, \"Guidelines and Registration Procedures for New URI Schemes\", BCP 35, RFC 4395, February 2006.",
      "ja": "[RFC4395]ハンセン、T.、ハーディ、T.、およびL. Masinter、 \"新しいURIスキームのためのガイドラインと登録手順\"、BCP 35、RFC 4395、2006年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC5234] Crocker, D., Ed., and P. Overell, \"Augmented BNF for Syntax Specifications: ABNF\", STD 68, RFC 5234, January 2008.",
      "ja": "\"構文仕様のための増大しているBNF：ABNF\" [RFC5234]クロッカー、D.、エド、およびP. Overell、。、STD 68、RFC 5234、2008年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC6075] Cridland, D., \"The Internet Assigned Number Authority (IANA) Application Configuration Access Protocol (ACAP) Vendor Subtrees Registry\", RFC 6075, December 2010.",
      "ja": "[RFC6075] Cridland、D.、 \"番号機関（IANA）アプリケーション設定アクセスプロトコル（ACAP）ベンダーサブツリーレジストリの割り当てインターネット\"、RFC 6075、2010年12月。"
    },
    {
      "indent": 0,
      "text": "12.2. Informative References",
      "section_title": true,
      "ja": "12.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[HOMOGRAPH] \"IDN Homograph attack\", 2011, <http://en.wikipedia.org/ w/index.php?title=IDN_homograph_attack&oldid=416746950>.",
      "ja": "[同形異義語] \"IDNホモグラフィ攻撃\"、2011年、<http://en.wikipedia.org/ワット/ index.phpを？タイトル= IDN_homograph_attack＆oldid = 416746950>。"
    },
    {
      "indent": 3,
      "text": "[JAVA] Oracle Corporation, \"Oracle Technology for Java Developers\", 2011, <http://www.oracle.com/technetwork/java/index.html>.",
      "ja": "[JAVA]オラクル・コーポレーション、 \"Javaの開発者のためのOracle Technology\"、2011年、<http://www.oracle.com/technetwork/java/index.html>。"
    },
    {
      "indent": 3,
      "text": "[SCA-JMS] Holdsworth, S. and A. Karmarkar, \"Service Component Architecture JMS Binding Specification Version 1.1\", November 2010, <http://docs.oasis-open.org/opencsa/ sca-bindings/sca-jmsbinding-1.1-spec.html>.",
      "ja": "[SCA-JMS]ホールズワース、S.およびA.カーマーカー、 \"サービス・コンポーネント・アーキテクチャーJMS仕様バージョン1.1をバインド\" 2010年11月、<http://docs.oasis-open.org/opencsa/ SCAバインディング/ SCA-jmsbinding -1.1-spec.html>。"
    },
    {
      "indent": 3,
      "text": "[SCA-TC] \"OASIS Service Component Architecture / Bindings (SCA-Bindings) TC\", <http://www.oasis-open.org/committees/ tc_home.php?wg_abbrev=sca-bindings>.",
      "ja": "[SCA-TC \"OASISサービス・コンポーネント・アーキテクチャ/バインディング（SCA-バインディング）TC\"、<http://www.oasis-open.org/committees/ tc_home.php？wg_abbrev = SCAバインディング>。"
    },
    {
      "indent": 3,
      "text": "[SOAP-JMS] Adams, P., Easton, P., Johnson, E., Merrick, R., and M. Phillips, \"SOAP over Java Message Service 1.0\", October 2010, <http://www.w3.org/TR/2010/WD-soapjms-20101026/>.",
      "ja": "[SOAP-JMS]アダムス、P.、イーストン、P.、ジョンソン、E.、メリック、R.、およびM.フィリップス、2010年10月の \"Java Message Serviceの1.0を超えるSOAP\"、<のhttp：//www.w3 .ORG / TR / 2010 / WD-soapjms-20101026 />。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Mark Phillips International Business Machines Corporation Hursley House, Hursley Park Winchester, Hampshire SO21 2JN United Kingdom",
      "ja": "マーク・フィリップスたInternational Business Machines Corp. Hursleyのハウス、Hursleyの公園ウィンチェスター、ハンプシャーSO21 2JNイギリス"
    },
    {
      "indent": 3,
      "text": "EMail: m8philli@uk.ibm.com",
      "ja": "メールアドレス：m8philli@uk.ibm.com"
    },
    {
      "indent": 3,
      "text": "Phil Adams International Business Machines Corporation 11501 Burnet Rd. Austin, TX 78758 United States",
      "ja": "フィル・アダムスたInternational Business Machines Corp. 11501バーネットRdを。オースティン、TX 78758米国"
    },
    {
      "indent": 3,
      "text": "EMail: phil_adams@us.ibm.com",
      "ja": "メールアドレス：phil_adams@us.ibm.com"
    },
    {
      "indent": 3,
      "text": "Derek Rokicki Software AG. 11700 Plaza America Drive Reston, VA 20190 United States",
      "ja": "デレクRokickiソフトウェアAG。 11700プラザアメリカドライブレストン、バージニア州20190米国"
    },
    {
      "indent": 3,
      "text": "EMail: derek.rokicki@softwareag.com",
      "ja": "メールアドレス：derek.rokicki@softwareag.com"
    },
    {
      "indent": 3,
      "text": "Eric Johnson TIBCO Software Inc. 3303 Hillview Avenue Palo Alto, CA 94304 United States",
      "ja": "エリック・ジョンソンTIBCO Software Inc.の3303ヒルビュー・アベニューパロアルト、CA 94304米国"
    },
    {
      "indent": 3,
      "text": "EMail: eric@tibco.com",
      "ja": "メールアドレス：eric@tibco.com"
    }
  ]
}