{
  "title": {
    "text": "RFC 6652 - Sender Policy Framework (SPF) Authentication Failure Reporting Using the Abuse Reporting Format",
    "ja": "RFC 6652 - 悪用レポート形式を使用したSender Policy Framework（SPF）認証失敗レポート"
  },
  "number": 6652,
  "created_at": "2020-09-07 20:33:08.684211+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                      S. Kitterman\nRequest for Comments: 6652                                         Agari\nUpdates: 4408                                                  June 2012\nCategory: Standards Track\nISSN: 2070-1721",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 5,
      "text": "Sender Policy Framework (SPF) Authentication Failure Reporting Using the Abuse Reporting Format",
      "ja": "悪用レポート形式を使用したSender Policy Framework（SPF）認証失敗レポート"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This memo presents extensions to the Abuse Reporting Format (ARF) and Sender Policy Framework (SPF) specifications to allow for detailed reporting of message authentication failures in an on-demand fashion.",
      "ja": "このメモは、メッセージ認証の失敗をオンデマンドで詳細に報告できるようにする、Abuse Reporting Format（ARF）およびSender Policy Framework（SPF）仕様の拡張機能を示しています。"
    },
    {
      "indent": 3,
      "text": "This memo updates RFC 4408 by providing an IANA registry for SPF modifiers.",
      "ja": "このメモは、SPF修飾子にIANAレジストリを提供することにより、RFC 4408を更新します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の状態"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これはInternet Standards Trackドキュメントです。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントは、IETF（Internet Engineering Task Force）の製品です。これは、IETFコミュニティのコンセンサスを表しています。公開レビューを受け、インターネットエンジニアリングステアリンググループ（IESG）による公開が承認されました。インターネット標準の詳細については、RFC 5741のセクション2をご覧ください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6652.",
      "ja": "このドキュメントの現在の状態、正誤表、およびフィードバックの提供方法に関する情報は、http：//www.rfc-editor.org/info/rfc6652で入手できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2012 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2012 IETF Trustおよびドキュメントの作成者として特定された人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書は、BCP 78およびこの文書の発行日に有効なIETF文書に関するIETFトラストの法的規定（http://trustee.ietf.org/license-info）の対象となります。これらのドキュメントは、このドキュメントに関するあなたの権利と制限を説明しているため、注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、Trust Legal Provisionsのセクション4.eに記載されているSimplified BSD Licenseのテキストが含まれている必要があり、Simplified BSD Licenseに記載されているように保証なしで提供されます。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Definitions .....................................................3\n   2.1. Key Words ..................................................3\n   2.2. Imported Definitions .......................................3\n3. Optional Reporting Address for SPF ..............................3\n4. Requested Reports ...............................................4\n   4.1. Requested Reports for SPF Failures .........................5\n5. IANA Considerations .............................................5\n   5.1. SPF Modifier Registration ..................................5\n6. Security Considerations .........................................6\n   6.1. Identity Selection .........................................6\n   6.2. Report Volume ..............................................6\n7. References ......................................................7\n   7.1. Normative References .......................................7\n   7.2. Informative References .....................................7\nAppendix A. Acknowledgements .......................................8\nAppendix B. Examples ...............................................8\n   B.1. SPF DNS Record for Domain That Sends No Mail but\n        Requests Reports ...........................................8\n   B.2. Minimal SPF DNS Record Change to Add a Reporting\n        Address ....................................................8\n   B.3. SPF DNS Record with Reporting Address, Report\n        Percentage, and Requested Report Type ......................8",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The Abuse Reporting Format [ARF] defines a message format for sending reports of abuse in the messaging infrastructure, with an eye toward automating both the generation and consumption of those reports.",
      "ja": "不正使用報告フォーマット[ARF]は、メッセージングインフラストラクチャで不正使用のレポートを送信するためのメッセージフォーマットを定義し、これらのレポートの生成と消費の両方の自動化を目指しています。"
    },
    {
      "indent": 3,
      "text": "The Sender Policy Framework [SPF] is one mechanism for message sender authentication; it is \"path-based\", meaning it authenticates the route that a message took from origin to destination. The output is a verified domain name that can then be subjected to some sort of evaluation process (e.g., comparison to a known-good list, submission to a reputation service, etc.).",
      "ja": "送信者ポリシーフレームワーク[SPF]は、メッセージ送信者認証のメカニズムの1つです。これは「パスベース」です。つまり、メッセージが発信元から宛先へとたどるルートを認証します。出力は検証済みのドメイン名であり、何らかの評価プロセス（既知の良好なリストとの比較、評判サービスへの提出など）を行うことができます。"
    },
    {
      "indent": 3,
      "text": "This document extends [SPF] to add an optional reporting address and other parameters. Extension of [ARF] to add features required for the reporting of these incidents is covered in [ARF-AUTHFAIL] and [ARF-AS].",
      "ja": "このドキュメントは、[SPF]を拡張して、オプションのレポートアドレスとその他のパラメーターを追加します。これらのインシデントのレポートに必要な機能を追加するための[ARF]の拡張は、[ARF-AUTHFAIL]および[ARF-AS]でカバーされています。"
    },
    {
      "indent": 3,
      "text": "This document additionally creates a an IANA registry of [SPF] record modifiers to avoid modifier namespace collisions.",
      "ja": "このドキュメントはさらに、[SPF]レコード修飾子のIANAレジストリを作成して、修飾子の名前空間の衝突を回避します。"
    },
    {
      "indent": 0,
      "text": "2. Definitions",
      "section_title": true,
      "ja": "2. 定義"
    },
    {
      "indent": 0,
      "text": "2.1. Key Words",
      "section_title": true,
      "ja": "2.1. キーワード"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [KEYWORDS].",
      "ja": "このドキュメントのキーワード「MUST」、「MUST NOT」、「REQUIRED」、「SHALL」、「SHALL NOT」、「SHOULD」、「SHOULD NOT」、「RECOMMENDED」、「MAY」、および「OPTIONAL」は、 [キーワード]で説明されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2.2. Imported Definitions",
      "section_title": true,
      "ja": "2.2. インポートされた定義"
    },
    {
      "indent": 3,
      "text": "The [ABNF] token \"qp-section\" is defined in [MIME].",
      "ja": "[ABNF]トークン「qp-section」は[MIME]で定義されています。"
    },
    {
      "indent": 3,
      "text": "\"local-part\" is defined in [MAIL].",
      "ja": "「local-part」は[MAIL]で定義されています。"
    },
    {
      "indent": 3,
      "text": "\"addr-spec\" is defined in [MAIL].",
      "ja": "「addr-spec」は[MAIL]で定義されています。"
    },
    {
      "indent": 0,
      "text": "3. Optional Reporting Address for SPF",
      "section_title": true,
      "ja": "3. SPFのオプションのレポートアドレス"
    },
    {
      "indent": 3,
      "text": "There exist cases in which an ADministrative Management Domain (ADMD) (see [EMAIL-ARCH]) employing [SPF] for announcing sending practices may want to know when messages are received via unauthorized routing. Currently, there is no such method defined in conjunction with standardized approaches such as [ARF]. Similar information can be gathered using a specially crafted [SPF] record and a special DNS server to track [SPF] record lookups.",
      "ja": "送信慣行を通知するために[SPF]を採用している管理管理ドメイン（ADMD）（[EMAIL-ARCH]を参照）が、不正なルーティングを介してメッセージを受信したことを知りたい場合があります。現在、[ARF]のような標準化されたアプローチと組み合わせて定義されたそのような方法はありません。特別に細工された[SPF]レコードと特別なDNSサーバーを使用して同様の情報を収集し、[SPF]レコードの検索を追跡できます。"
    },
    {
      "indent": 3,
      "text": "This document defines the following optional \"modifier\" (as defined in Section 4.6.1 of [SPF]) to SPF records, using the form defined in that specification:",
      "ja": "このドキュメントでは、次のオプションの「修飾子」（[SPF]のセクション4.6.1で定義）をSPFレコードに、その仕様で定義されている形式を使用して定義しています。"
    },
    {
      "indent": 3,
      "text": "ra= Reporting Address (plain-text; OPTIONAL; no default). MUST be a local-part (see Section 3.4.1 of [MAIL]) specifying an e-mail address to which a report SHOULD be sent when mail claiming to be from this domain (see Section 2.4 of [SPF] for a description of how domains are identified for SPF checks) has failed the evaluation algorithm described in [SPF], in particular because a message arrived via an unauthorized route. To generate a complete address to which the report is sent, the Verifier simply appends to this value an \"@\" followed by the SPF-compliant domain per Section 4.1 of [SPF]. ra= modifiers in a record that was reached by following an \"include\" mechanism (defined in Section 5.2 of [SPF]) MUST be ignored.",
      "ja": "ra =レポートアドレス（プレーンテキスト、オプション、デフォルトなし）。このドメインからのものであると主張するメールの場合にレポートを送信する必要がある電子メールアドレスを指定するローカルパーツ（[MAIL]のセクション3.4.1を参照）である必要があります（[SPF]のセクション2.4を参照）。 SPFチェックのためにドメインがどのように識別されるか）は、[SPF]で説明されている評価アルゴリズムに失敗しました。特に、メッセージが不正なルートを介して到着したためです。レポートの送信先となる完全なアドレスを生成するために、ベリファイアはこの値に「@」を追加し、その後に[SPF]のセクション4.1に従ってSPF準拠ドメインを追加します。 「含める」メカニズム（[SPF]のセクション5.2で定義）に従って到達したレコードのra =修飾子は無視する必要があります。"
    },
    {
      "indent": 6,
      "text": "ABNF:",
      "ja": "ABNF："
    },
    {
      "indent": 6,
      "text": "spf-report-tag = \"ra=\" qp-section",
      "ja": "spf-report-tag = \"ra =\" qp-section"
    },
    {
      "indent": 3,
      "text": "rp= Requested Report Percentage (plain-text; OPTIONAL; default is \"100\"). The value is an integer from 0 to 100 inclusive that indicates what percentage of incidents of SPF failures, selected at random, are to cause reports to be generated. The report generator SHOULD NOT issue reports for more than the requested percentage of incidents. An exception to this might be some out-of-band arrangement between two parties to override it with some mutually agreed value. Report generators MAY make use of the \"Incidents:\" field in [ARF] to indicate that there are more reportable incidents than there are reports.",
      "ja": "rp =リクエストされたレポートの割合（プレーンテキスト、オプション、デフォルトは \"100\"）。値は0から100までの整数で、ランダムに選択されたSPF障害のインシデントの何パーセントがレポートを生成させるかを示します。レポートジェネレータは、要求されたインシデントの割合を超えるレポートを発行してはなりません（SHOULD NOT）。これに対する例外は、相互に合意した値でオーバーライドするための2つのパーティ間の帯域外の取り決めである可能性があります。レポートジェネレーターは、[ARF]の「インシデント：」フィールドを使用して、レポートよりも報告可能なインシデントが多いことを示すことができます。"
    },
    {
      "indent": 6,
      "text": "ABNF:",
      "ja": "ABNF："
    },
    {
      "indent": 6,
      "text": "spf-rp-tag = \"rp=\" 1*12DIGIT \"/\" 1*12DIGIT",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "rr= Requested Reports (plain-text; OPTIONAL; default is \"all\"). The value MUST be a colon-separated list of tokens representing those conditions under which a report is desired. See Section 4.1 for a list of valid tags.",
      "ja": "rr =要求されたレポート（プレーンテキスト、オプション、デフォルトは「すべて」）。値は、レポートが必要な条件を表すトークンのコロンで区切られたリストである必要があります。有効なタグのリストについては、セクション4.1を参照してください。"
    },
    {
      "indent": 6,
      "text": "ABNF:",
      "ja": "ABNF："
    },
    {
      "indent": 6,
      "text": "spf-rr-type = ( \"all\" / \"e\" / \"f\" / \"s\" / \"n\" )",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "spf-rr-tag = \"rr=\" spf-rr-type *( \":\" spf-rr-type )",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "In the absence of an \"ra=\" tag in the SPF record, the \"rp=\" and \"rr=\" tags MUST be ignored, and the report generator MUST NOT issue a report.",
      "ja": "SPFレコードに「ra =」タグがない場合、「rp =」および「rr =」タグは無視する必要があり、レポートジェネレーターはレポートを発行してはなりません（MUST NOT）。"
    },
    {
      "indent": 0,
      "text": "4. Requested Reports",
      "section_title": true,
      "ja": "4. リクエストされたレポート"
    },
    {
      "indent": 3,
      "text": "This memo also includes, as the \"rr\" tokens defined above, the means by which the sender can request reports for specific circumstances of interest. Verifiers MUST NOT generate reports for incidents that do not match a requested report and MUST ignore requests for reports not included in this list.",
      "ja": "このメモには、上記で定義された「rr」トークンとして、送信者が関心のある特定の状況のレポートを要求できる手段も含まれています。検証者は、要求されたレポートと一致しないインシデントのレポートを生成してはならず（MUST NOT）、このリストに含まれていないレポートの要求を無視しなければなりません（MUST NOT）。"
    },
    {
      "indent": 0,
      "text": "4.1. Requested Reports for SPF Failures",
      "section_title": true,
      "ja": "4.1. SPF障害について要求されたレポート"
    },
    {
      "indent": 3,
      "text": "The following report requests are defined for SPF results:",
      "ja": "次のレポート要求がSPF結果に対して定義されています。"
    },
    {
      "indent": 3,
      "text": "all All reports are requested.",
      "ja": "すべてのレポートが要求されます。"
    },
    {
      "indent": 3,
      "text": "e Reports are requested for messages that produced an SPF result of \"TempError\" or \"PermError\".",
      "ja": "eレポートは、 \"TempError\"または \"PermError\"のSPF結果を生成したメッセージに対して要求されます。"
    },
    {
      "indent": 3,
      "text": "f Reports are requested for messages that produced an SPF result of \"Fail\".",
      "ja": "f SPFの結果が「失敗」となったメッセージのレポートが要求されます。"
    },
    {
      "indent": 3,
      "text": "s Reports are requested for messages that produced an SPF result of \"SoftFail\".",
      "ja": "■「SoftFail」のSPF結果を生成したメッセージのレポートが要求されます。"
    },
    {
      "indent": 3,
      "text": "n Reports are requested for messages that produced an SPF result of \"Neutral\" or \"None\".",
      "ja": "n「中立」または「なし」のSPF結果を生成したメッセージのレポートが要求されます。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "ja": "5. IANAに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "As required by [IANA-CONS], this section contains registry information for the new [SPF] modifiers.",
      "ja": "[IANA-CONS]で必要な場合、このセクションには、新しい[SPF]修飾子のレジストリ情報が含まれています。"
    },
    {
      "indent": 0,
      "text": "5.1. SPF Modifier Registration",
      "section_title": true,
      "ja": "5.1. SPF修飾子の登録"
    },
    {
      "indent": 3,
      "text": "IANA has created the Modifier Names registry under Sender Policy Framework Parameters, to include a list of all registered SPF modifier names and their defining documents.",
      "ja": "IANAは、Sender Policy Framework Parametersの下にModifier Namesレジストリを作成し、登録されているすべてのSPF修飾子名とその定義ドキュメントのリストを含めています。"
    },
    {
      "indent": 3,
      "text": "New registrations or updates are to be published in accordance with the \"Specification Required\" guidelines as described in [IANA-CONS]. New registrations and updates MUST contain the following information:",
      "ja": "新規登録または更新は、[IANA-CONS]で説明されている「必要な仕様」のガイドラインに従って公開されます。新規登録と更新には、次の情報が含まれている必要があります。"
    },
    {
      "indent": 3,
      "text": "1. Name of the modifier being registered or updated",
      "ja": "1. 登録または更新される修飾子の名前"
    },
    {
      "indent": 3,
      "text": "2. The document in which the specification of the modifier is published",
      "ja": "2. 修飾子の仕様が公開されている文書"
    },
    {
      "indent": 3,
      "text": "3. New or updated status, which MUST be one of the following:",
      "ja": "3. 新規または更新されたステータス。次のいずれかである必要があります。"
    },
    {
      "indent": 7,
      "text": "Current: The field is in current use",
      "ja": "現在：フィールドは現在使用中です"
    },
    {
      "indent": 7,
      "text": "Deprecated: The field might be in current use but its use is discouraged",
      "ja": "非推奨：フィールドは現在使用されている可能性がありますが、その使用は推奨されません"
    },
    {
      "indent": 7,
      "text": "Historic: The field is no longer in current use",
      "ja": "歴史的：フィールドは現在使用されていません"
    },
    {
      "indent": 3,
      "text": "An update may make a notation on an existing registration indicating that a registered field is historic or deprecated if appropriate.",
      "ja": "更新により、既存の登録に表記が作成され、登録されたフィールドが履歴であるか、必要に応じて非推奨になったことが示される場合があります。"
    },
    {
      "indent": 17,
      "text": "+------------+-----------------+---------+\n| MODIFIER   | REFERENCE       | STATUS  |\n+------------+-----------------+---------+\n| exp        | RFC 4408        | Current |\n| redirect   | RFC 4408        | Current |\n| ra         | (this document) | Current |\n| rp         | (this document) | Current |\n| rr         | (this document) | Current |\n+------------+-----------------+---------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "Inherited considerations: implementers are advised to consider the Security Considerations sections of [SPF], [ARF], [ARF-AS], and [ARF-AUTHFAIL].",
      "ja": "継承される考慮事項：実装者は、[SPF]、[ARF]、[ARF-AS]、および[ARF-AUTHFAIL]のセキュリティに関する考慮事項のセクションを検討することをお勧めします。"
    },
    {
      "indent": 3,
      "text": "In addition to the advice in the Security Considerations section of [ARF-AS], these additional considerations apply to the generation of [SPF] authentication failure reports:",
      "ja": "[ARF-AS]のセキュリティに関する考慮事項セクションのアドバイスに加えて、これらの追加の考慮事項が[SPF]認証失敗レポートの生成に適用されます。"
    },
    {
      "indent": 0,
      "text": "6.1. Identity Selection",
      "section_title": true,
      "ja": "6.1. アイデンティティの選択"
    },
    {
      "indent": 3,
      "text": "Preventing an [SPF] failure for SPF authentication failure reports is essential to mitigate the risk of data loops.",
      "ja": "データループのリスクを軽減するには、SPF認証失敗レポートの[SPF]失敗を防ぐことが不可欠です。"
    },
    {
      "indent": 6,
      "text": "If the [SMTP] return address to be used will not be the NULL return address, i.e., \"MAIL FROM:<>\", then the selected return address MUST be selected such that it will pass [SPF] MAIL FROM checks upon initial receipt.",
      "ja": "使用する[SMTP]返信アドレスがNULL返信アドレスでない場合、つまり「MAIL FROM：<>」の場合、選択した返信アドレスは、最初の受信時に[SPF] MAIL FROMチェックに合格するように選択する必要があります。 。"
    },
    {
      "indent": 6,
      "text": "If the report is passed to the Message Submission Agent (MSA) (MSA is described in [EMAIL-ARCH] using [SMTP]), the HELO/EHLO command parameter SHOULD also be selected so that it will pass [SPF] HELO checks.",
      "ja": "レポートがメッセージ送信エージェント（MSA）に渡される場合（MSAは[SMTP]を使用して[EMAIL-ARCH]で記述されます）、HELO / EHLOコマンドパラメータも選択して、[SPF] HELOチェックに合格するようにする必要があります。"
    },
    {
      "indent": 0,
      "text": "6.2. Report Volume",
      "section_title": true,
      "ja": "6.2. レポート量"
    },
    {
      "indent": 3,
      "text": "It is impossible to predict the volume of reports this facility will generate when enabled by a report receiver. An implementer ought to anticipate substantial volume, since the amount of abuse occurring at receivers cannot be known ahead of time, and may vary rapidly and unpredictably.",
      "ja": "この機能がレポートレシーバーによって有効にされたときに生成するレポートの量を予測することは不可能です。レシーバーで発生する乱用の量は事前に知ることができず、急速に予測できないほど変動する可能性があるため、実装者はかなりの量を予測する必要があります。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7. 参考文献"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "ja": "7.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[ABNF] Crocker, D., Ed., and P. Overell, \"Augmented BNF for Syntax Specifications: ABNF\", STD 68, RFC 5234, January 2008.",
      "ja": "[ABNF] Crocker、D.、Ed。、およびP. Overell、「構文仕様の拡張BNF：ABNF」、STD 68、RFC 5234、2008年1月。"
    },
    {
      "indent": 3,
      "text": "[ARF] Shafranovich, Y., Levine, J., and M. Kucherawy, \"An Extensible Format for Email Feedback Reports\", RFC 5965, August 2010.",
      "ja": "[ARF] Shafranovich、Y.、Levine、J。、およびM. Kucherawy、「電子メールフィードバックレポートの拡張可能な形式」、RFC 5965、2010年8月。"
    },
    {
      "indent": 3,
      "text": "[ARF-AS] Falk, J. and M. Kucherawy, Ed., \"Creation and Use of Email Feedback Reports: An Applicability Statement for the Abuse Reporting Format (ARF)\", RFC 6650, June 2012.",
      "ja": "[ARF-AS] Falk、J。およびM. Kucherawy、編、「電子メールフィードバックレポートの作成と使用：不正使用報告フォーマット（ARF）の適用性に関する声明」、RFC 6650、2012年6月。"
    },
    {
      "indent": 3,
      "text": "[ARF-AUTHFAIL] Fontana, H., \"Authentication Failure Reporting Using the Abuse Reporting Format\", RFC 6591, April 2012.",
      "ja": "[ARF-AUTHFAIL] Fontana、H。、「Abuse Reporting Formatを使用した認証失敗の報告」、RFC 6591、2012年4月。"
    },
    {
      "indent": 3,
      "text": "[IANA-CONS] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 5226, May 2008.",
      "ja": "[IANA-CONS] Narten、T。およびH. Alvestrand、「RFCでIANAに関する考慮事項セクションを作成するためのガイドライン」、BCP 26、RFC 5226、2008年5月。"
    },
    {
      "indent": 3,
      "text": "[KEYWORDS] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[キーワード] Bradner、S。、「RFCで使用して要件レベルを示すためのキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[MAIL] Resnick, P., Ed., \"Internet Message Format\", RFC 5322, October 2008.",
      "ja": "[メール] Resnick、P。、編、「インターネットメッセージ形式」、RFC 5322、2008年10月。"
    },
    {
      "indent": 3,
      "text": "[MIME] Freed, N. and N. Borenstein, \"Multipurpose Internet Mail Extensions (MIME) Part One: Format of Internet Message Bodies\", RFC 2045, November 1996.",
      "ja": "[MIME] Freed、N。およびN. Borenstein、「Multipurpose Internet Mail Extensions（MIME）Part One：Format of Internet Message Bodies」、RFC 2045、1996年11月。"
    },
    {
      "indent": 3,
      "text": "[SMTP] Klensin, J., \"Simple Mail Transfer Protocol\", RFC 5321, October 2008.",
      "ja": "[SMTP] Klensin、J。、「Simple Mail Transfer Protocol」、RFC 5321、2008年10月。"
    },
    {
      "indent": 3,
      "text": "[SPF] Wong, M. and W. Schlitt, \"Sender Policy Framework (SPF) for Authorizing Use of Domains in E-Mail, Version 1\", RFC 4408, April 2006.",
      "ja": "[SPF] Wong、M。およびW. Schlitt、「電子メールでのドメインの使用を許可するための送信者ポリシーフレームワーク（SPF）、バージョン1」、RFC 4408、2006年4月。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "ja": "7.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[EMAIL-ARCH] Crocker, D., \"Internet Mail Architecture\", RFC 5598, July 2009.",
      "ja": "[メールアーク]クロッカーD.、「インターネットメールアーキテクチャ」、RFC 5598、2009年7月。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Acknowledgements",
      "section_title": true,
      "ja": "付録A謝辞"
    },
    {
      "indent": 3,
      "text": "The author wishes to acknowledge the following for their review and constructive criticism of this proposal: Murray Kucherawy, Tim Draegen, Julian Mehnle, and John Levine.",
      "ja": "著者は、この提案のレビューと建設的な批評のために、マレークチェラウィ、ティムドレーゲン、ジュリアンメーンル、およびジョンレバインを認めたいと思います。"
    },
    {
      "indent": 0,
      "text": "Appendix B. Examples",
      "section_title": true,
      "ja": "付録B.例"
    },
    {
      "indent": 0,
      "text": "B.1. SPF DNS Record for Domain That Sends No Mail but Requests Reports",
      "section_title": true,
      "ja": "B.1. メールを送信しないがレポートを要求するドメインのSPF DNSレコード"
    },
    {
      "indent": 3,
      "text": "v=spf1 ra=postmaster -all",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "B.2. Minimal SPF DNS Record Change to Add a Reporting Address",
      "section_title": true,
      "ja": "B.2. レポートアドレスを追加するための最小限のSPF DNSレコードの変更"
    },
    {
      "indent": 3,
      "text": "v=spf1 mx:example.org ra=postmaster -all",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "B.3. SPF DNS Record with Reporting Address, Report Percentage, and Requested Report Type",
      "ja": "B.3. レポートアドレス、レポートの割合、および要求されたレポートタイプを含むSPF DNSレコード"
    },
    {
      "indent": 3,
      "text": "v=spf1 mx:example.org -all ra=postmaster rp=10 rr=e",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Scott Kitterman Agari 3611 Scheel Dr. Ellicott City, MD 21042 US",
      "ja": "Scott Kitterman Agari 3611 Scheel Dr. Ellicott City、MD 21042 US"
    },
    {
      "indent": 3,
      "text": "Phone: +1 301 325 5475\nEMail: scott@kitterman.com",
      "raw": true,
      "ja": ""
    }
  ]
}