{
  "title": {
    "text": "RFC 6093 - On the Implementation of the TCP Urgent Mechanism",
    "ja": "RFC 6093 - TCP緊急メカニズムの実装について"
  },
  "number": 6093,
  "created_at": "2023-01-11 09:17:14.043912+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                           F. Gont\nRequest for Comments: 6093                                       UTN/FRH\nUpdates: 793, 1011, 1122                                  A. Yourtchenko\nCategory: Standards Track                                          Cisco\nISSN: 2070-1721                                             January 2011",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 11,
      "text": "On the Implementation of the TCP Urgent Mechanism",
      "ja": "TCP緊急メカニズムの実装について"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document analyzes how current TCP implementations process TCP urgent indications and how the behavior of some widely deployed middleboxes affects how end systems process urgent indications. This document updates the relevant specifications such that they accommodate current practice in processing TCP urgent indications, raises awareness about the reliability of TCP urgent indications in the Internet, and recommends against the use of urgent indications (but provides advice to applications that do).",
      "ja": "このドキュメントでは、現在のTCP実装がTCPの緊急適応を処理する方法と、広く展開されたミドルボックスの動作が、最終システムが緊急の適応を処理する方法にどのように影響するかを分析します。このドキュメントは、TCPの緊急適応を処理する際の現在の慣行に対応し、インターネットでのTCP緊急適応の信頼性についての認識を高め、緊急適応の使用に対して推奨する（ただし、アプリケーションにアドバイスを提供する）関連する仕様を更新します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準トラックドキュメントです。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントは、インターネットエンジニアリングタスクフォース（IETF）の製品です。IETFコミュニティのコンセンサスを表しています。公開レビューを受けており、インターネットエンジニアリングステアリンググループ（IESG）からの出版が承認されています。インターネット標準の詳細については、RFC 5741のセクション2で入手できます。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6093.",
      "ja": "このドキュメントの現在のステータス、任意のERRATA、およびそのフィードバックを提供する方法に関する情報は、http：//www.rfc-editor.org/info/rfc6093で取得できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2011 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2011 IETF Trustおよび文書著者として特定された人。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "このドキュメントは、BCP 78およびIETFドキュメント（http://trustee.ietf.org/license-info）に関連するIETF Trustの法的規定の対象となります。この文書に関するあなたの権利と制限を説明するので、これらの文書を注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、セクション4.Eで説明されている法的規定のセクション4.Eで説明されており、単純化されたBSDライセンスで説明されているように保証なしで提供される簡略化されたBSDライセンステキストを含める必要があります。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n2. Specification of the TCP Urgent Mechanism .......................3\n   2.1. Semantics of Urgent Indications ............................3\n   2.2. Semantics of the Urgent Pointer ............................4\n   2.3. Allowed Length of \"Urgent Data\" ............................4\n3. Current Implementation Practice of the TCP Urgent Mechanism .....5\n   3.1. Semantics of Urgent Indications ............................5\n   3.2. Semantics of the Urgent Pointer ............................5\n   3.3. Allowed Length of \"Urgent Data\" ............................6\n   3.4. Interaction of Middleboxes with TCP Urgent Indications .....6\n4. Updating RFC 793, RFC 1011, and RFC 1122 ........................6\n5. Advice to New Applications Employing TCP ........................7\n6. Advice to Applications That Make Use of the Urgent Mechanism ....7\n7. Security Considerations .........................................7\n8. Acknowledgements ................................................8\n9. References ......................................................8\n   9.1. Normative References .......................................8\n   9.2. Informative References .....................................8\nAppendix A.  Survey of the Processing of TCP Urgent\n             Indications by Some Popular TCP Implementations ......10\n   A.1. FreeBSD ...................................................10\n   A.2. Linux .....................................................10\n   A.3. NetBSD ....................................................10\n   A.4. OpenBSD ...................................................11\n   A.5. Cisco IOS software ........................................11\n   A.6. Microsoft Windows 2000, Service Pack 4 ....................11\n   A.7. Microsoft Windows 2008 ....................................11\n   A.8. Microsoft Windows 95 ......................................11",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "This document analyzes how some current TCP implementations process TCP urgent indications, and how the behavior of some widely deployed middleboxes affects the processing of urgent indications by hosts. This document updates RFC 793 [RFC0793], RFC 1011 [RFC1011], and RFC 1122 [RFC1122] such that they accommodate current practice in processing TCP urgent indications. It also provides advice to applications using the urgent mechanism and raises awareness about the reliability of TCP urgent indications in the current Internet.",
      "ja": "このドキュメントでは、現在のTCP実装がTCPの緊急適応をどのように処理するか、および広く展開されたミドルボックスの動作が、ホストによる緊急適応の処理にどのように影響するかを分析します。このドキュメントは、RFC 793 [RFC0793]、RFC 1011 [RFC1011]、およびRFC 1122 [RFC1122]を更新し、TCP緊急適応を処理する現在の慣行に対応します。また、緊急メカニズムを使用してアプリケーションにアドバイスを提供し、現在のインターネットでのTCP緊急適応の信頼性についての認識を高めます。"
    },
    {
      "indent": 3,
      "text": "Given the above issues and potential interoperability issues with respect to the currently common default mode operation, it is strongly recommended that applications do not employ urgent indications. Nevertheless, urgent indications are still retained as a mandatory part of the TCP protocol to support the few legacy applications that employ them. However, it is expected that even these applications will have difficulties in environments with middleboxes.",
      "ja": "現在一般的なデフォルトモード操作に関する上記の問題と潜在的な相互運用性の問題を考えると、アプリケーションが緊急の適応症を採用しないことを強くお勧めします。それにもかかわらず、緊急の適応症は、それらを採用するいくつかのレガシーアプリケーションをサポートするために、TCPプロトコルの必須部分として依然として保持されています。ただし、これらのアプリケーションでさえ、ミドルボックスを備えた環境で困難になると予想されます。"
    },
    {
      "indent": 3,
      "text": "Section 2 describes what the current IETF specifications state with respect to TCP urgent indications. Section 3 describes how current TCP implementations actually process TCP urgent indications. Section 4 updates RFC 793 [RFC0793], RFC 1011 [RFC1011], and RFC 1122 [RFC1122], such that they accommodate current practice in processing TCP urgent indications. Section 5 provides advice to new applications employing TCP, with respect to the TCP urgent mechanism. Section 6 provides advice to existing applications that use or rely on the TCP urgent mechanism.",
      "ja": "セクション2では、TCP緊急適応に関して現在のIETF仕様がどのように述べているかについて説明します。セクション3では、現在のTCP実装が実際にTCPの緊急適応を処理する方法について説明します。セクション4は、RFC 793 [RFC0793]、RFC 1011 [RFC1011]、およびRFC 1122 [RFC1122]を更新します。セクション5では、TCP緊急メカニズムに関して、TCPを採用した新しいアプリケーションへのアドバイスを提供します。セクション6では、TCP緊急メカニズムを使用または依存する既存のアプリケーションへのアドバイスを提供します。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "ja": "この文書のキーワード \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", および \"OPTIONAL\" はRFC 2119 [RFC2119]で説明されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. Specification of the TCP Urgent Mechanism",
      "section_title": true,
      "ja": "2. TCP緊急メカニズムの仕様"
    },
    {
      "indent": 0,
      "text": "2.1. Semantics of Urgent Indications",
      "section_title": true,
      "ja": "2.1. 緊急の兆候の意味論"
    },
    {
      "indent": 3,
      "text": "TCP implements an \"urgent mechanism\" that allows the sending user to stimulate the receiving user to accept some \"urgent data\" and that permits the receiving TCP to indicate to the receiving user when all the currently known \"urgent data\" have been read.",
      "ja": "TCPは、送信ユーザーが受信ユーザーがいくつかの「緊急データ」を受け入れることができる「緊急メカニズム」を実装し、現在知られているすべての「緊急データ」が読み取られたときに受信TCPが受信ユーザーに示すことを可能にします。"
    },
    {
      "indent": 3,
      "text": "The TCP urgent mechanism permits a point in the data stream to be designated as the end of urgent information. Whenever this point is in advance of the receive sequence number (RCV.NXT) at the receiving TCP, that TCP must tell the user to go into \"urgent mode\"; when the receive sequence number catches up to the urgent pointer, the TCP must tell user to go into \"normal mode\" [RFC0793]. This means, for example, that data that was received as \"normal data\" might become \"urgent data\" if an urgent indication is received in some successive TCP segment before that data is consumed by the TCP user.",
      "ja": "TCP緊急メカニズムにより、データストリームのポイントが緊急情報の終了として指定されます。このポイントが受信TCPで受信シーケンス番号（RCV.NXT）の前にあるときはいつでも、TCPはユーザーに「緊急モード」に移動するように指示する必要があります。受信シーケンス番号が緊急のポインターに追いつくと、TCPはユーザーに「通常モード」[RFC0793]に移動するように指示する必要があります。これは、たとえば、「通常のデータ」として受信されたデータが、TCPユーザーによってデータが消費される前に、緊急の適応症が連続するTCPセグメントで受信された場合、「緊急データ」になる可能性があることを意味します。"
    },
    {
      "indent": 3,
      "text": "The URG control flag indicates that the \"Urgent Pointer\" field is meaningful and must be added to the segment sequence number to yield the urgent pointer. The absence of this flag indicates that there is no \"urgent data\" outstanding [RFC0793].",
      "ja": "URGコントロールフラグは、「緊急ポインター」フィールドが意味があることを示し、緊急ポインターを生成するためにセグメントシーケンス番号に追加する必要があることを示しています。このフラグがないことは、「緊急データ」が未解決の[RFC0793]がないことを示しています。"
    },
    {
      "indent": 3,
      "text": "The TCP urgent mechanism is NOT a mechanism for sending \"out-of-band\" data: the so-called \"urgent data\" should be delivered \"in-line\" to the TCP user.",
      "ja": "TCPの緊急メカニズムは、「帯域外」データを送信するためのメカニズムではありません。いわゆる「緊急データ」を「緊急データ」は、「インライン」にTCPユーザーに配信する必要があります。"
    },
    {
      "indent": 0,
      "text": "2.2. Semantics of the Urgent Pointer",
      "section_title": true,
      "ja": "2.2. 緊急ポインターのセマンティクス"
    },
    {
      "indent": 3,
      "text": "There is some ambiguity in RFC 793 [RFC0793] with respect to the semantics of the Urgent Pointer. Section 3.1 (page 17) of RFC 793 [RFC0793] states that the Urgent Pointer \"communicates the current value of the urgent pointer as a positive offset from the sequence number in this segment. The urgent pointer points to the sequence number of the octet following the urgent data. This field is only be interpreted in segments with the URG control bit set\" (sic). However, Section 3.9 (page 56) of RFC 793 [RFC0793] states, when describing the processing of the SEND call in the ESTABLISHED and CLOSE-WAIT states, that \"If the urgent flag is set, then SND.UP <- SND.NXT-1 and set the urgent pointer in the outgoing segments\".",
      "ja": "緊急ポインターのセマンティクスに関して、RFC 793 [RFC0793]には曖昧さがあります。RFC 793 [RFC0793]のセクション3.1（17ページ）は、緊急ポインターが「緊急ポインターの現在の値をこのセグメントのシーケンス番号からの正のオフセットとして伝えている」と述べています。緊急のデータ。このフィールドは、URGコントロールビットセットを持つセグメントでのみ解釈されます」（sic）。ただし、RFC 793 [RFC0793]のセクション3.9（56ページ）は、確立された密接な状態で送信コールの処理を説明するとき、「緊急フラグが設定されている場合、snd.up <-snd。NXT-1および発信セグメントに緊急ポインターを設定します」。"
    },
    {
      "indent": 3,
      "text": "RFC 1011 [RFC1011] clarified this ambiguity in RFC 793 stating that \"Page 17 is wrong. The urgent pointer points to the last octet of urgent data (not to the first octet of non-urgent data)\". RFC 1122 [RFC1122] formally updated RFC 793 by stating, in Section 4.2.2.4 (page 84), that \"the urgent pointer points to the sequence number of the LAST octet (not LAST+1) in a sequence of urgent data\".",
      "ja": "RFC 1011 [RFC1011]は、RFC 793のこの曖昧さを明らかにしました。「17ページが間違っている。緊急のポインターは、緊急データの最後のオクテットを指します（非緊急データの最初のオクテットではない）。RFC 1122 [RFC1122]は、セクション4.2.2.4（84ページ）で、「緊急のポインターは、緊急データのシーケンスで最後のオクテットのシーケンス番号（最後の1つではない）を指し示す」と述べて、RFC 793を正式に更新しました。"
    },
    {
      "indent": 0,
      "text": "2.3. Allowed Length of \"Urgent Data\"",
      "section_title": true,
      "ja": "2.3. 許可された「緊急データ」の長さ"
    },
    {
      "indent": 3,
      "text": "RFC 793 [RFC0793] allows TCP peers to send \"urgent data\" of any length, as the TCP urgent mechanism simply provides a pointer to an interesting point in the data stream. In this respect, Section 4.2.2.4 (page 84) of RFC 1122 [RFC1122] explicitly states that \"A TCP MUST support a sequence of urgent data of any length\".",
      "ja": "RFC 793 [RFC0793]を使用すると、TCPピアは任意の長さの「緊急データ」を送信できます。TCP緊急メカニズムは、データストリームの興味深いポイントへのポインターを提供するだけです。この点で、RFC 1122 [RFC1122]のセクション4.2.2.4（84ページ）は、「TCPは任意の長さの一連の緊急データをサポートする必要がある」と明示的に述べています。"
    },
    {
      "indent": 0,
      "text": "3. Current Implementation Practice of the TCP Urgent Mechanism",
      "section_title": true,
      "ja": "3. TCP緊急メカニズムの現在の実装実践"
    },
    {
      "indent": 0,
      "text": "3.1. Semantics of Urgent Indications",
      "section_title": true,
      "ja": "3.1. 緊急の兆候の意味論"
    },
    {
      "indent": 3,
      "text": "As discussed in Section 2, the TCP urgent mechanism simply permits a point in the data stream to be designated as the end of urgent information but does NOT provide a mechanism for sending \"out-of-band\" data.",
      "ja": "セクション2で説明したように、TCPの緊急メカニズムは、データストリームのポイントを緊急情報の終了として指定することを単純に許可しますが、「帯域外」データを送信するメカニズムを提供しません。"
    },
    {
      "indent": 3,
      "text": "Unfortunately, virtually all TCP implementations process TCP urgent indications differently. By default, the last byte of \"urgent data\" is delivered \"out of band\" to the application. That is, it is not delivered as part of the normal data stream [UNPv1]. For example, the \"out-of-band\" byte is read by an application when a recv(2) system call with the MSG_OOB flag set is issued.",
      "ja": "残念ながら、実質的にすべてのTCP実装は、TCPの緊急適応を異なる方法で処理します。デフォルトでは、「緊急データ」の最後のバイトが「バンドから」アプリケーションに配信されます。つまり、通常のデータストリーム[UNPV1]の一部としては提供されません。たとえば、「帯域外」バイトは、MSG_OOBフラグセットを使用したRECV（2）システムコールが発行されたときにアプリケーションによって読み取られます。"
    },
    {
      "indent": 3,
      "text": "Most implementations provide a socket option (SO_OOBINLINE) that allows an application to override the (broken) default processing of urgent indications, so that \"urgent data\" is delivered \"in line\" to the application, thus providing the semantics intended by the IETF specifications.",
      "ja": "ほとんどの実装は、アプリケーションが緊急適応の（壊れた）デフォルト処理をオーバーライドできるようにするソケットオプション（SO_OOBINLINE）を提供し、「緊急データ」がアプリケーションに並んで「緊急データ」が配信され、IETF仕様によって意図されたセマンティクスを提供する。"
    },
    {
      "indent": 0,
      "text": "3.2. Semantics of the Urgent Pointer",
      "section_title": true,
      "ja": "3.2. 緊急ポインターのセマンティクス"
    },
    {
      "indent": 3,
      "text": "All the popular implementations that the authors of this document have been able to test interpret the semantics of the TCP Urgent Pointer as specified in Section 3.1 of RFC 793. This means that even when RFC 1122 formally updated RFC 793 to clarify the ambiguity in the semantics of the Urgent Pointer, this clarification was never reflected in actual implementations (i.e., virtually all implementations default to the semantics of the urgent pointer specified in Section 3.1 of RFC 793).",
      "ja": "このドキュメントの著者がRFC 793のセクション3.1で指定されているように、TCP緊急ポインターのセマンティクスをテストすることができたすべての一般的な実装は、RFC 1122がRFC 793を正式に更新して、セマンティクスの曖昧さを明確にすることを意味します。緊急のポインターのうち、この明確化は実際の実装には決して反映されませんでした（つまり、実質的にすべての実装は、RFC 793のセクション3.1で指定された緊急ポインターのセマンティクスにデフォルトです）。"
    },
    {
      "indent": 3,
      "text": "Some operating systems provide a system-wide toggle to override this behavior and interpret the semantics of the Urgent Pointer as clarified in RFC 1122. However, this system-wide toggle has been found to be inconsistent. For example, Linux provides the sysctl \"tcp_stdurg\" (i.e., net.ipv4.tcp_stdurg) that, when set, supposedly changes the system behavior to interpret the semantics of the TCP Urgent Pointer as specified in RFC 1122. However, this sysctl changes the semantics of the Urgent Pointer only for incoming segments (i.e., not for outgoing segments). This means that if this sysctl is set, an application might be unable to interoperate with itself if both the TCP sender and the TCP receiver are running on the same host.",
      "ja": "一部のオペレーティングシステムは、この動作をオーバーライドし、RFC 1122で明確にした緊急ポインターのセマンティクスを解釈するためのシステム全体のトグルを提供します。しかし、このシステム全体のトグルは矛盾していることがわかっています。たとえば、LinuxはSYSCTL「TCP_STDURG」（つまり、net.ipv4.tcp_stdurg）を提供します。これは、設定された場合、RFC 1122で指定されているTCP緊急ポインターのセマンティクスを解釈するためにシステムの動作を変更します。緊急のポインターのセマンティクスは、着信セグメントのみ（つまり、発信セグメントではありません）。これは、このSYSCTLが設定されている場合、TCP送信者とTCPレシーバーの両方が同じホストで実行されている場合、アプリケーションがそれ自体と相互運用できない可能性があることを意味します。"
    },
    {
      "indent": 0,
      "text": "3.3. Allowed Length of \"Urgent Data\"",
      "section_title": true,
      "ja": "3.3. 許可された「緊急データ」の長さ"
    },
    {
      "indent": 3,
      "text": "While Section 4.2.2.4 (page 84) of RFC 1122 explicitly states that \"A TCP MUST support a sequence of urgent data of any length\", in practice, all those implementations that interpret TCP urgent indications as a mechanism for sending \"out-of-band\" data keep a buffer of a single byte for storing the \"last byte of urgent data\". Thus, if successive indications of \"urgent data\" are received before the application reads the pending \"out-of-band\" byte, that pending byte will be discarded (i.e., overwritten by the new byte of \"urgent data\").",
      "ja": "RFC 1122のセクション4.2.2.2.4（84ページ）（84ページ）は、「TCPは任意の長さの一連の緊急データをサポートする必要がある」と明示的に述べています。-BAND「データは、「緊急データの最後のバイト」を保存するために、単一のバイトのバッファーを保持します。したがって、アプリケーションが保留中の「バンド外」バイトを読み取る前に「緊急データ」の連続的な適応が受信される場合、その保留中のバイトは破棄されます（つまり、「緊急データ」の新しいバイトによって上書きされます）。"
    },
    {
      "indent": 3,
      "text": "In order to avoid \"urgent data\" from being discarded, some implementations queue each of the received \"urgent bytes\", so that even if another urgent indication is received before the pending \"urgent data\" are consumed by the application, those bytes do not need to be discarded. Some of these implementations have been known to fail to enforce any limits on the amount of \"urgent data\" that they queue; thus, they become vulnerable to trivial resource exhaustion attacks [CPNI-TCP].",
      "ja": "「緊急のデータ」が破棄されるのを避けるために、一部の実装は、受信した「緊急バイト」のそれぞれをキューにキューにします。廃棄する必要があります。これらの実装のいくつかは、それらがキューにする「緊急データ」の量の制限を実施できないことが知られています。したがって、それらは些細な資源排出攻撃に対して脆弱になります[CPNI-TCP]。"
    },
    {
      "indent": 3,
      "text": "It should be reinforced that the aforementioned implementations are broken. The TCP urgent mechanism is not a mechanism for delivering \"out-of-band\" data.",
      "ja": "前述の実装が壊れていることを強化する必要があります。TCP緊急メカニズムは、「バンド外」データを提供するメカニズムではありません。"
    },
    {
      "indent": 0,
      "text": "3.4. Interaction of Middleboxes with TCP Urgent Indications",
      "section_title": true,
      "ja": "3.4. ミドルボックスとTCP緊急適応との相互作用"
    },
    {
      "indent": 3,
      "text": "As a result of the publication of Network Intrusion Detection System (NIDS) evasion techniques based on TCP urgent indications [phrack], some middleboxes clear the urgent indications by clearing the URG flag and setting the Urgent Pointer to zero. This causes the \"urgent data\" to become \"in line\" (that is, accessible by the read(2) call or the recv(2) call without the MSG_OOB flag) in the case of those TCP implementations that interpret the TCP urgent mechanism as a facility for delivering \"out-of-band\" data (as described in Section 3.1). An example of such a middlebox is the Cisco PIX firewall [Cisco-PIX]. This should discourage applications from depending on urgent indications for their correct operation, as urgent indications may not be reliable in the current Internet.",
      "ja": "TCP緊急適応[Prack]に基づいて、ネットワーク侵入検知システム（NIDS）回避技術の公開の結果[Prack]に基づいて、いくつかのミドルボックスは、緊急フラグをクリアし、緊急のポインターをゼロに設定することにより、緊急の適応症をクリアします。これにより、「緊急のデータ」が「並んで」になります（つまり、TCP緊急メカニズムを解釈するTCP実装の場合、MSG_OOBフラグなしで読み取り（2）コールまたはRECV（2）コールでアクセスできます）「帯域外」データを提供する施設として（セクション3.1で説明されています）。このようなミドルボックスの例は、Cisco Pixファイアウォール[Cisco-Pix]です。これは、緊急の適応症が現在のインターネットでは信頼できない可能性があるため、正しい操作の緊急の適応症に応じてアプリケーションを阻止するはずです。"
    },
    {
      "indent": 0,
      "text": "4. Updating RFC 793, RFC 1011, and RFC 1122",
      "section_title": true,
      "ja": "4. RFC 793、RFC 1011、およびRFC 1122の更新"
    },
    {
      "indent": 3,
      "text": "Considering that as long as both the TCP sender and the TCP receiver implement the same semantics for the Urgent Pointer there is no functional difference in having the Urgent Pointer point to \"the sequence number of the octet following the urgent data\" vs. \"the last octet of urgent data\", and that all known implementations interpret the semantics of the Urgent Pointer as pointing to \"the sequence number of the octet following the urgent data\", we hereby update RFC 793 [RFC0793], RFC 1011 [RFC1011], and RFC 1122 [RFC1122] such that \"the urgent pointer points to the sequence number of the octet following the urgent data\" (in segments with the URG control bit set), thus accommodating virtually all existing TCP implementations.",
      "ja": "TCP送信者とTCPレシーバーの両方が緊急ポインターの同じセマンティクスを実装する限り、緊急ポインターポイントを「緊急データに続くオクテットのシーケンス番号」と最後のポインターポイントを持つことに機能的な違いはないことを考慮してください。緊急データのオクテット」、およびすべての既知の実装は、緊急ポインターのセマンティクスを「緊急データに続くオクテットのシーケンス番号」を指していると解釈すると、RFC 793 [RFC0793]、RFC 1011 [RFC1011]、およびRFC 1122 [RFC1122]そのような「緊急のポインターは、緊急データに続くオクテットのシーケンス番号を指している」（URGコントロールビットセットのセグメントで）、したがって、既存の実質的な実装に対応します。"
    },
    {
      "indent": 0,
      "text": "5. Advice to New Applications Employing TCP",
      "section_title": true,
      "ja": "5. TCPを採用している新しいアプリケーションへのアドバイス"
    },
    {
      "indent": 3,
      "text": "As a result of the issues discussed in Section 3.2 and Section 3.4, new applications SHOULD NOT employ the TCP urgent mechanism. However, TCP implementations MUST still include support for the urgent mechanism such that existing applications can still use it.",
      "ja": "セクション3.2およびセクション3.4で説明した問題の結果として、新しいアプリケーションはTCP緊急メカニズムを採用すべきではありません。ただし、TCPの実装には、既存のアプリケーションが引き続き使用できるように、緊急メカニズムのサポートを依然として含める必要があります。"
    },
    {
      "indent": 0,
      "text": "6. Advice to Applications That Make Use of the Urgent Mechanism",
      "section_title": true,
      "ja": "6. 緊急のメカニズムを利用するアプリケーションへのアドバイス"
    },
    {
      "indent": 3,
      "text": "Even though applications SHOULD NOT employ the urgent mechanism, applications that still decide to employ it MUST set the SO_OOBINLINE socket option, such that \"urgent data\" is delivered in line, as intended by the IETF specifications.",
      "ja": "アプリケーションは緊急のメカニズムを採用してはなりませんが、それでもITFの仕様が意図しているように、「緊急データ」が並んで配信されるように、SO_Oobinlineソケットオプションを設定する必要があります。"
    },
    {
      "indent": 3,
      "text": "Additionally, applications that still decide to use the urgent mechanism need to be designed for correct operation even when the URG flag is cleared by middleboxes.",
      "ja": "さらに、緊急メカニズムを使用することを決定するアプリケーションは、URGフラグがミドルボックスでクリアされている場合でも、正しい動作のために設計する必要があります。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "ja": "7. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "Multiple factors can affect the data flow that is actually delivered to an application when the TCP urgent mechanism is employed: for example, the two possible interpretations of the semantics of the Urgent Pointer in current implementations (e.g., depending on the value of the tcp_stdurg sysctl), the possible implementation of the urgent mechanism as an \"out-of-band\" (OOB) facility (versus \"in-band\" as intended by the IETF specifications), or middleboxes (such as packet scrubbers) or the end-systems themselves that could cause the \"urgent data\" to be processed \"in line\". This might make it difficult for a Network Intrusion Detection System (NIDS) to track the application-layer data transferred to the destination system and thus lead to false negatives or false positives in the NIDS [CPNI-TCP] [phrack].",
      "ja": "複数の要因が、TCP緊急メカニズムが採用されているときに実際にアプリケーションに配信されるデータフローに影響を与える可能性があります。たとえば、現在の実装における緊急ポインターのセマンティクスの2つの可能な解釈（たとえば、TCP_STDURG SYSCTLの値に応じて）、「IETF仕様で意図した「帯域内」（「帯域内」）またはミドルボックス（パケットスクラバーなど）またはエンドシステムとしての緊急メカニズムの可能な実装（「OOB）施設（「インバンド」）またはエンドシステムとしての実装「緊急のデータ」を「並んで」処理する可能性がある自体。これにより、ネットワーク侵入検知システム（NIDS）が宛先システムに転送されたアプリケーション層データを追跡することを困難にする可能性があり、したがって、NIDS [CPNI-TCP] [Phrack]で偽陰性または偽陽性につながる可能性があります。"
    },
    {
      "indent": 3,
      "text": "Probably the best way to avoid the security implications of TCP \"urgent data\" is to avoid having applications use the TCP urgent mechanism altogether. Packet scrubbers could probably be configured to clear the URG bit and set the Urgent Pointer to zero. This would basically cause the \"urgent data\" to be put \"in line\". However, this might cause interoperability problems or undesired behavior in those applications that rely on the TCP urgent mechanism, such as Telnet [RFC0854] and FTP [RFC0959].",
      "ja": "おそらく、TCPの「緊急データ」のセキュリティへの影響を回避する最良の方法は、アプリケーションがTCP緊急メカニズムを完全に使用することを避けることです。パケットスクラバーは、おそらくURGビットをクリアし、緊急のポインターをゼロに設定するように構成できます。これにより、基本的に「緊急のデータ」が「並んで」になります。ただし、これにより、Telnet [RFC0854]やFTP [RFC0959]などのTCP緊急メカニズムに依存するアプリケーションで、相互運用性の問題または望ましくない動作を引き起こす可能性があります。"
    },
    {
      "indent": 0,
      "text": "8. Acknowledgements",
      "section_title": true,
      "ja": "8. 謝辞"
    },
    {
      "indent": 3,
      "text": "The authors of this document would like to thank (in alphabetical order) Jari Arkko, Ron Bonica, David Borman, Dave Cridland, Ralph Droms, Wesley Eddy, John Heffner, Alfred Hoenes, Alexey Melnikov, Keith Moore, Carlos Pignataro, Tim Polk, Anantha Ramaiah, Joe Touch, Michael Welzl, Dan Wing, and Alexander Zimmermann for providing valuable feedback on earlier versions of this document.",
      "ja": "この文書の著者は、（アルファベット順に）Jari Arkko、Ron Bonica、David Borman、Dave Cridland、Ralph Droms、Wesley Eddy、John Heffner、Alfred Hoenes、Alexey Melnikov、Keith Moore、Carlos Pignataro、Tim Polk、Anantha Ramaiah、Joe Touch、Michael Welzl、Dan Wing、およびAlexander Zimmermannは、このドキュメントの以前のバージョンに関する貴重なフィードバックを提供してくれました。"
    },
    {
      "indent": 3,
      "text": "Fernando would like to thank David Borman and Joe Touch for a fruitful discussion about the TCP urgent mechanism at IETF 73 (Minneapolis).",
      "ja": "フェルナンドは、IETF 73（ミネアポリス）でのTCP緊急メカニズムについての実り多い議論をしてくれたDavid BormanとJoe Touchに感謝したいと思います。"
    },
    {
      "indent": 3,
      "text": "Fernando Gont's attendance to IETF meetings was supported by ISOC's \"Fellowship to the IETF\" program.",
      "ja": "Fernando GontのIETF会議への出席は、ISOCの「IETFへのフェローシップ」プログラムによってサポートされていました。"
    },
    {
      "indent": 3,
      "text": "Finally, Fernando Gont wishes to express deep and heartfelt gratitude to Jorge Oscar Gont and Nelida Garcia for their precious motivation and guidance.",
      "ja": "最後に、フェルナンド・ゴントは、貴重な動機とガイダンスについて、ホルヘ・オスカー・ゴントとネリダ・ガルシアに深く心からの感謝の気持ちを表現したいと考えています。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "ja": "9. 参考文献"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "ja": "9.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC0793] Postel, J., \"Transmission Control Protocol\", STD 7, RFC 793, September 1981.",
      "ja": "[RFC0793] Postel、J。、「トランスミッションコントロールプロトコル」、STD 7、RFC 793、1981年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC1011] Reynolds, J. and J. Postel, \"Official Internet protocols\", RFC 1011, May 1987.",
      "ja": "[RFC1011] Reynolds、J。およびJ. Postel、「公式インターネットプロトコル」、RFC 1011、1987年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC1122] Braden, R., Ed., \"Requirements for Internet Hosts - Communication Layers\", STD 3, RFC 1122, October 1989.",
      "ja": "[RFC1122] Braden、R.、ed。、「インターネットホストの要件 - 通信レイヤー」、STD 3、RFC 1122、1989年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119] Bradner、S。、「要件レベルを示すためにRFCで使用するためのキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "ja": "9.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[CPNI-TCP] Gont, F., \"Security Assessment of the Transmission Control Protocol (TCP)\", \"http://www.cpni.gov.uk/ Docs/tn-03-09-security-assessment-TCP.pdf\", 2009.",
      "ja": "[CPNI-TCP] Gont、F。、「送信制御プロトコル（TCP）のセキュリティ評価」、「http://www.cpni.gov.uk/ docs/tn-03-09-security-assessment-tcp。PDF \"、2009。"
    },
    {
      "indent": 3,
      "text": "[Cisco-PIX] Cisco PIX, \"http://www.cisco.com/en/US/docs/security/ asa/asa70/command/reference/tz.html#wp1288756\".",
      "ja": "[Cisco-PIX] Cisco PIX, \"http://www.cisco.com/en/US/docs/security/ asa/asa70/command/reference/tz.html#wp1288756\"."
    },
    {
      "indent": 3,
      "text": "[FreeBSD] The FreeBSD project, \"http://www.freebsd.org\".",
      "ja": "[FreeBSD] FreeBSDプロジェクト、「http://www.freebsd.org」。"
    },
    {
      "indent": 3,
      "text": "[Linux] The Linux Project, \"http://www.kernel.org\".",
      "ja": "[Linux] Linuxプロジェクト、「http://www.kernel.org」。"
    },
    {
      "indent": 3,
      "text": "[NetBSD] The NetBSD project, \"http://www.netbsd.org\".",
      "ja": "[NetBSD] NetBSDプロジェクト、「http://www.netbsd.org」。"
    },
    {
      "indent": 3,
      "text": "[OpenBSD] The OpenBSD project, \"http://www.openbsd.org\".",
      "ja": "[OpenBSD] OpenBSDプロジェクト、「http://www.openbsd.org」。"
    },
    {
      "indent": 3,
      "text": "[RFC0854] Postel, J. and J. Reynolds, \"Telnet Protocol Specification\", STD 8, RFC 854, May 1983.",
      "ja": "[RFC0854] Postel、J。およびJ. Reynolds、「Telnetプロトコル仕様」、STD 8、RFC 854、1983年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC0959] Postel, J. and J. Reynolds, \"File Transfer Protocol\", STD 9, RFC 959, October 1985.",
      "ja": "[RFC0959] Postel、J。およびJ. Reynolds、「ファイル転送プロトコル」、STD 9、RFC 959、1985年10月。"
    },
    {
      "indent": 3,
      "text": "[UNPv1] Stevens, W., \"UNIX Network Programming, Volume 1. Networking APIs: Sockets and XTI\", Prentice Hall PTR, 1997.",
      "ja": "[UNPV1]スティーブンス、W。、「UNIXネットワークプログラミング、ボリューム1。ネットワーキングAPI：Sockets and XTI」、Prentice Hall Ptr、1997。"
    },
    {
      "indent": 3,
      "text": "[Windows2000] Microsoft Windows 2000, \"http://technet.microsoft.com/ en-us/library/bb726981(printer).aspx\".",
      "ja": "[Windows2000] Microsoft Windows 2000、 \"http://technet.microsoft.com/ en-us/library/bb726981（プリンター）.aspx\"。"
    },
    {
      "indent": 3,
      "text": "[Windows95] Microsoft Windows 95, \"ftp://ftp.demon.co.uk/pub/ mirrors/win95netfaq/faq-c.html\".",
      "ja": "[Windows95] Microsoft Windows 95、「ftp://ftp.demon.co.uk/pub/ mirrors/win95netfaq/faq-c.html」。"
    },
    {
      "indent": 3,
      "text": "[phrack] Ko, Y., Ko, S., and M. Ko, \"NIDS Evasion Method named \"SeolMa\"\", Phrack Magazine, Volume 0x0b, Issue 0x39, Phile #0x03 of 0x12 http://www.phrack.org/ issues.html?issue=57&id=3#article, 2001.",
      "ja": "[Phrack] Ko、Y.、Ko、S。、およびM. Ko、「Seolma」、Phrack Magazine、Volume 0x0b、Issue 0x39、Phile＃0x03 of 0x12 http：//www.phrack。org/ issues.html？issue = 57＆id = 3＃article、2001。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Survey of the Processing of TCP Urgent Indications by Some Popular TCP Implementations",
      "ja": "付録A. いくつかの一般的なTCP実装によるTCP緊急適応の処理の調査"
    },
    {
      "indent": 0,
      "text": "A.1. FreeBSD",
      "section_title": true,
      "ja": "A.1. FreeBSD"
    },
    {
      "indent": 3,
      "text": "FreeBSD 8.0 [FreeBSD] interprets the semantics of the urgent pointer as specified in Section 4 of this document. It does not provide any sysctl to override this behavior.",
      "ja": "FreeBSD 8.0 [FreeBSD]は、このドキュメントのセクション4で指定されているように、緊急ポインターのセマンティクスを解釈します。この動作をオーバーライドするSYSCTLは提供しません。"
    },
    {
      "indent": 3,
      "text": "FreeBSD provides the SO_OOBINLINE socket option that, when set, causes TCP \"urgent data\" to remain \"in line\". That is, it will be accessible by the read(2) call or the recv(2) call without the MSG_OOB flag.",
      "ja": "FreeBSDは、SO_OOBINLINEソケットオプションを提供します。これにより、設定されたときにTCPが「緊急データ」を「並べて」とします。つまり、MSG_OOBフラグなしで、読み取り（2）コールまたはRECV（2）コールによってアクセスできます。"
    },
    {
      "indent": 3,
      "text": "FreeBSD supports only one byte of \"urgent data\". That is, only the byte preceding the Urgent Pointer is considered \"urgent data\".",
      "ja": "FreeBSDは、「緊急データ」の1バイトのみをサポートしています。つまり、緊急のポインターに先行するバイトのみが「緊急データ」と見なされます。"
    },
    {
      "indent": 0,
      "text": "A.2. Linux",
      "section_title": true,
      "ja": "A.2. Linux"
    },
    {
      "indent": 3,
      "text": "Linux 2.6.15-53-386 [Linux] interprets the semantics of the urgent pointer as specified in Section 4 of this document. It provides the net.ipv4.tcp_stdurg sysctl to override this behavior to interpret the Urgent Pointer as specified in RFC 1122 [RFC1122]. However, this sysctl only affects the processing of incoming segments (the Urgent Pointer in outgoing segments will still be set as specified in Section 4 of this document).",
      "ja": "Linux 2.6.15-53-386 [Linux]は、このドキュメントのセクション4で指定されているように、緊急ポインターのセマンティクスを解釈します。net.ipv4.tcp_stdurg sysctlを提供して、この動作をオーバーライドして、RFC 1122 [RFC1122]で指定されている緊急ポインターを解釈します。ただし、このSYSCTLは、着信セグメントの処理にのみ影響します（このドキュメントのセクション4で指定されているように、発信セグメントの緊急ポインターは引き続き設定されます）。"
    },
    {
      "indent": 3,
      "text": "Linux provides the SO_OOBINLINE socket option that, when set, causes TCP \"urgent data\" to remain \"in line\". That is, it will be accessible by the read(2) call or the recv(2) call without the MSG_OOB flag.",
      "ja": "Linuxは、SO_OOBINLINEソケットオプションを提供します。これにより、設定された場合、TCPが「緊急データ」を「並べている」ままにします。つまり、MSG_OOBフラグなしで、読み取り（2）コールまたはRECV（2）コールによってアクセスできます。"
    },
    {
      "indent": 3,
      "text": "Linux supports only one byte of \"urgent data\". That is, only the byte preceding the Urgent Pointer is considered \"urgent data\".",
      "ja": "Linuxは、「緊急データ」の1バイトのみをサポートしています。つまり、緊急のポインターに先行するバイトのみが「緊急データ」と見なされます。"
    },
    {
      "indent": 0,
      "text": "A.3. NetBSD",
      "section_title": true,
      "ja": "A.3. NetBSD"
    },
    {
      "indent": 3,
      "text": "NetBSD 5.0.1 [NetBSD] interprets the semantics of the urgent pointer as specified in Section 4 of this document. It does not provide any sysctl to override this behavior.",
      "ja": "NetBSD 5.0.1 [NetBSD]は、このドキュメントのセクション4で指定されているように、緊急ポインターのセマンティクスを解釈します。この動作をオーバーライドするSYSCTLは提供しません。"
    },
    {
      "indent": 3,
      "text": "NetBSD provides the SO_OOBINLINE socket option that, when set, causes TCP \"urgent data\" to remain \"in line\". That is, it will be accessible by the read(2) call or the recv(2) call without the MSG_OOB flag.",
      "ja": "NetBSDは、SO_OOBINLINEソケットオプションを提供します。これにより、設定された場合、TCPが「緊急データ」を「並べて」とします。つまり、MSG_OOBフラグなしで、読み取り（2）コールまたはRECV（2）コールによってアクセスできます。"
    },
    {
      "indent": 3,
      "text": "NetBSD supports only one byte of \"urgent data\". That is, only the byte preceding the Urgent Pointer is considered \"urgent data\".",
      "ja": "NetBSDは、「緊急データ」の1バイトのみをサポートしています。つまり、緊急のポインターに先行するバイトのみが「緊急データ」と見なされます。"
    },
    {
      "indent": 0,
      "text": "A.4. OpenBSD",
      "section_title": true,
      "ja": "A.4. OpenBSD"
    },
    {
      "indent": 3,
      "text": "OpenBSD 4.2 [OpenBSD] interprets the semantics of the urgent pointer as specified in Section 4 of this document. It does not provide any sysctl to override this behavior.",
      "ja": "OpenBSD 4.2 [OpenBSD]このドキュメントのセクション4で指定されているように、緊急ポインターのセマンティクスを解釈します。この動作をオーバーライドするSYSCTLは提供しません。"
    },
    {
      "indent": 3,
      "text": "OpenBSD provides the SO_OOBINLINE socket option that, when set, causes TCP \"urgent data\" to remain \"in line\". That is, it will be accessible by the read(2) or recv(2) calls without the MSG_OOB flag.",
      "ja": "OpenBSDは、SO_OOBINLINEソケットオプションを提供します。これにより、設定された場合、TCPが「緊急データ」を「並べて」とします。つまり、MSG_OOBフラグなしで読み取り（2）またはRECV（2）の呼び出しでアクセスできます。"
    },
    {
      "indent": 3,
      "text": "OpenBSD supports only one byte of \"urgent data\". That is, only the byte preceding the Urgent Pointer is considered \"urgent data\".",
      "ja": "OpenBSDは、「緊急データ」の1バイトのみをサポートしています。つまり、緊急のポインターに先行するバイトのみが「緊急データ」と見なされます。"
    },
    {
      "indent": 0,
      "text": "A.5. Cisco IOS software",
      "section_title": true,
      "ja": "A.5. Cisco iOSソフトウェア"
    },
    {
      "indent": 3,
      "text": "Cisco IOS Software Releases 12.2(18)SXF7, 12.4(15)T7 interpret the semantics of the urgent pointer as specified in Section 4 of this document.",
      "ja": "Cisco IOSソフトウェアは、このドキュメントのセクション4で指定されているように、緊急ポインターのセマンティクスを解釈する12.2（18）SXF7、12.4（15）T7を解釈します。"
    },
    {
      "indent": 3,
      "text": "The behavior is consistent with having the SO_OOBINLINE socket option turned on, i.e., the data is processed \"in line\".",
      "ja": "動作は、SO_OOBINLINEソケットオプションをオンにすることと一致しています。つまり、データは「ライン」で処理されます。"
    },
    {
      "indent": 0,
      "text": "A.6. Microsoft Windows 2000, Service Pack 4",
      "section_title": true,
      "ja": "A.6. Microsoft Windows 2000、Service Pack 4"
    },
    {
      "indent": 3,
      "text": "Microsoft Windows 2000 [Windows2000] interprets the semantics of the urgent pointer as specified in Section 4 of this document. It provides the TcpUseRFC1122UrgentPointer system-wide variable to override this behavior, interpreting the Urgent Pointer as specified in RFC 1122 [RFC1122].",
      "ja": "Microsoft Windows 2000 [Windows2000]は、このドキュメントのセクション4で指定されているように、緊急ポインターのセマンティクスを解釈します。TCPUSERFC11222222URGENTPOINTERシステム全体の変数を提供して、この動作をオーバーライドし、RFC 1122 [RFC1122]で指定されている緊急ポインターを解釈します。"
    },
    {
      "indent": 3,
      "text": "Tests performed with a sample server application compiled using the cygwin environment has shown that the default behavior is to return the \"urgent data\" \"in line\".",
      "ja": "Cygwin環境を使用してコンパイルされたサンプルサーバーアプリケーションで実行されたテストは、デフォルトの動作が「緊急データ」「並んで」を返すことであることを示しています。"
    },
    {
      "indent": 0,
      "text": "A.7. Microsoft Windows 2008",
      "section_title": true,
      "ja": "A.7. Microsoft Windows 2008"
    },
    {
      "indent": 3,
      "text": "Microsoft Windows 2008 interprets the semantics of the urgent pointer as specified in Section 4 of this document.",
      "ja": "Microsoft Windows 2008は、このドキュメントのセクション4で指定されているように、緊急ポインターのセマンティクスを解釈します。"
    },
    {
      "indent": 0,
      "text": "A.8. Microsoft Windows 95",
      "section_title": true,
      "ja": "A.8. Microsoft Windows95"
    },
    {
      "indent": 3,
      "text": "Microsoft Windows 95 interprets the semantics of the urgent pointer as specified in Section 4 of this document. It provides the BSDUrgent system-wide variable to override this behavior, interpreting the Urgent Pointer as specified in RFC 1122 [RFC1122]. Windows 95 supports only one byte of \"urgent data\". That is, only the byte preceding the Urgent Pointer is considered \"urgent data\" [Windows95].",
      "ja": "Microsoft Windows 95は、このドキュメントのセクション4で指定されているように、緊急ポインターのセマンティクスを解釈します。BSDurgentシステム全体の変数を提供して、この動作をオーバーライドし、RFC 1122 [RFC1122]で指定されている緊急ポインターを解釈します。Windows 95は、「緊急データ」の1バイトのみをサポートしています。つまり、緊急のポインターに先行するバイトのみが「緊急データ」と見なされます[Windows95]。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Fernando Gont Universidad Tecnologica Nacional / Facultad Regional Haedo Evaristo Carriego 2644 Haedo, Provincia de Buenos Aires 1706 Argentina",
      "ja": "Fernando Gont Universidad Tecnologica Nacional / Fancultad Regional Haedo Evaristo Carriego 2644 Haedo、Provincia de Buenos Aires 1706 Argentina"
    },
    {
      "indent": 3,
      "text": "Phone: +54 11 4650 8472\nEMail: fernando@gont.com.ar\nURI:   http://www.gont.com.ar",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Andrew Yourtchenko Cisco De Kleetlaan, 7 Diegem B-1831 Belgium",
      "ja": "Andrew Yourtchenko Cisco de Kleetlaan、7 Diegem B-1831ベルギー"
    },
    {
      "indent": 3,
      "text": "Phone: +32 2 704 5494\nEMail: ayourtch@cisco.com",
      "raw": true,
      "ja": ""
    }
  ]
}