{
  "title": {
    "text": "RFC 6730 - Requirements for IETF Nominations Committee Tools",
    "ja": "RFC 6730 - IETF指名委員会ツールの要件"
  },
  "number": 6730,
  "created_at": "2020-09-06 09:09:29.115522+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                       S. Krishnan\nRequest for Comments: 6730                                    J. Halpern\nCategory: Informational                                         Ericsson\nISSN: 2070-1721                                           September 2012",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 11,
      "text": "Requirements for IETF Nominations Committee Tools",
      "ja": "IETF指名委員会ツールの要件"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document defines the requirements for a set of tools for use by the IETF Nominations Committee.",
      "ja": "このドキュメントは、IETF指名委員会が使用する一連のツールの要件を定義しています。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の状態"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはInternet Standards Trackの仕様ではありません。情報提供を目的として公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントは、IETF（Internet Engineering Task Force）の製品です。これは、IETFコミュニティのコンセンサスを表しています。公開レビューを受け、インターネットエンジニアリングステアリンググループ（IESG）による公開が承認されました。 IESGによって承認されたすべてのドキュメントが、あらゆるレベルのインターネット標準の候補になるわけではありません。 RFC 5741のセクション2をご覧ください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6730.",
      "ja": "このドキュメントの現在のステータス、エラータ、およびフィードバックの提供方法に関する情報は、http：//www.rfc-editor.org/info/rfc6730で入手できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2012 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2012 IETF Trustおよびドキュメントの作成者として特定された人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書は、BCP 78およびこの文書の発行日に有効なIETF文書に関するIETFトラストの法的規定（http://trustee.ietf.org/license-info）の対象となります。これらのドキュメントは、このドキュメントに関するあなたの権利と制限を説明しているため、注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、Trust Legal Provisionsのセクション4.eに記載されているSimplified BSD Licenseのテキストが含まれている必要があり、Simplified BSD Licenseに記載されているように保証なしで提供されます。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n   1.1. Conventions Used in This Document ..........................2\n2. Meta Requirement ................................................2\n3. Authentication ..................................................3\n4. Security and Access Control .....................................3\n5. Nominations .....................................................4\n6. Accepting and Declining Nominations .............................5\n7. Questionnaires ..................................................6\n8. Feedback Collection .............................................7\n9. Security Considerations .........................................8\n10. Acknowledgements ...............................................8\n12. Normative References ...........................................8\nAppendix A. Example for Key Generation .............................9",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The IETF Nominations Committee (NomCom) is a body that selects candidates for open IESG, IAB, and IAOC positions following the process outlined in [RFC3777]. There is a need for a set of tools to aid the NomCom in efficient operation. This document presents a set of requirements for such a tool.",
      "ja": "IETF指名委員会（NomCom）は、[RFC3777]で概説されているプロセスに従って、オープンIESG、IAB、およびIAOCの候補者を選出する組織です。 NomComの効率的な運用を支援する一連のツールが必要です。このドキュメントでは、このようなツールの一連の要件について説明します。"
    },
    {
      "indent": 0,
      "text": "1.1. Conventions Used in This Document",
      "section_title": true,
      "ja": "1.1. このドキュメントで使用される規則"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "このドキュメントのキーワード「MUST」、「MUST NOT」、「REQUIRED」、「SHALL」、「SHALL NOT」、「SHOULD」、「SHOULD NOT」、「RECOMMENDED」、「MAY」、および「OPTIONAL」は、 [RFC2119]で説明されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. Meta Requirement",
      "section_title": true,
      "ja": "2. メタ要件"
    },
    {
      "indent": 3,
      "text": "There is an existing tool for supporting NomCom work. The set of requirements specified in this document are mainly enhancement requirements or behavioral changes to the existing tool. Unless otherwise stated, all of the current functions of the existing NomCom tool need to be supported in the new tool as well.",
      "ja": "NomComの作業をサポートするための既存のツールがあります。このドキュメントで指定されている一連の要件は、主に拡張要件または既存のツールに対する動作の変更です。特に明記しない限り、既存のNomComツールの現在の機能はすべて、新しいツールでもサポートされる必要があります。"
    },
    {
      "indent": 3,
      "text": "o META-001: The tool MUST provide all the functionality that is provided by the current NomCom tool, except in cases where a requirement specified in this document overrides a current behavior. The current NomCom tool can be found at the following URLs: https://www.ietf.org/group/nomcom/2012/private/ displays the NomCom private parts of the tool (Private NomCom tool) and https://www.ietf.org/group/nomcom/2012/ displays the community member accessible parts of the tool (Public NomCom tool).",
      "ja": "o META-001：このドキュメントで指定された要件が現在の動作をオーバーライドする場合を除いて、ツールは現在のNomComツールによって提供されるすべての機能を提供する必要があります。現在のNomComツールは、次のURLにあります。https：//www.ietf.org/group/nomcom/2012/private/は、ツールのNomComプライベート部分（プライベートNomComツール）とhttps：// wwwを表示します。 ietf.org/group/nomcom/2012/は、ツール（パブリックNomComツール）のコミュニティメンバーがアクセスできる部分を表示します。"
    },
    {
      "indent": 0,
      "text": "3. Authentication",
      "section_title": true,
      "ja": "3. 認証"
    },
    {
      "indent": 3,
      "text": "All access to NomCom tools needs to be authenticated. Users of the tools have different privileges based on their role. The tool needs to support at least three levels of access: community member, NomCom member, and NomCom chair. The levels of access are set up by the staff of the IETF Secretariat. It is to be noted that the Secretariat staff do not have any access to the tool. They are responsible for administering the server on which the tool runs; hence, they set up the access control list for the tool.",
      "ja": "NomComツールへのすべてのアクセスは認証される必要があります。ツールのユーザーは、役割に基づいて異なる特権を持っています。このツールは、コミュニティメンバー、NomComメンバー、およびNomCom議長という少なくとも3つのアクセスレベルをサポートする必要があります。アクセスのレベルは、IETF事務局のスタッフによって設定されます。事務局のスタッフはツールにアクセスできないことに注意してください。彼らは、ツールが実行されるサーバーの管理を担当します。したがって、ツールのアクセス制御リストを設定します。"
    },
    {
      "indent": 3,
      "text": "Community member access is applicable to the Public NomCom tool. The NomCom member access and the NomCom chair access are applicable to the Private NomCom tool. NomCom members can use the interfaces on the Public NomCom tool in the community member role. The NomCom chair access authentication applies to the private webpage in the same fashion as a NomCom member, with the additional ability to update the information on both webpages (i.e., what is visible in the various forms, the templates for the automatic emails, etc.).",
      "ja": "コミュニティメンバーアクセスは、パブリックNomComツールに適用されます。 NomComメンバーアクセスとNomComチェアアクセスは、プライベートNomComツールに適用されます。 NomComメンバーは、コミュニティメンバーロールでパブリックNomComツールのインターフェースを使用できます。 NomComチェアアクセス認証は、NomComメンバーと同じ方法でプライベートWebページに適用され、両方のWebページの情報（つまり、さまざまなフォームに表示されるもの、自動メールのテンプレートなど）を更新する追加機能があります。 ）。"
    },
    {
      "indent": 3,
      "text": "o AUTH-001: The tool MUST allow members of the community to log in with their existing datatracker.ietf.org credentials.",
      "ja": "o AUTH-001：コミュニティーのメンバーが既存のdatatracker.ietf.org資格情報を使用してログインできるようにする必要があります。"
    },
    {
      "indent": 3,
      "text": "o AUTH-002: The tool MUST allow members of the community to create a new login using the datatracker.ietf.org login system.",
      "ja": "o AUTH-002：ツールは、コミュニティのメンバーがdatatracker.ietf.orgログインシステムを使用して新しいログインを作成できるようにする必要があります。"
    },
    {
      "indent": 3,
      "text": "o AUTH-003: The tool MUST allow the secretariat to enter the email address of the NomCom chair and to enter a list of email addresses of the NomCom members. The logins associated with these email addresses MUST be accorded the respective roles.",
      "ja": "o AUTH-003：ツールは、事務局がNomCom議長の電子メールアドレスを入力し、NomComメンバーの電子メールアドレスのリストを入力することを許可する必要があります。これらの電子メールアドレスに関連付けられたログインには、それぞれの役割が付与されている必要があります。"
    },
    {
      "indent": 0,
      "text": "4. Security and Access Control",
      "section_title": true,
      "ja": "4. セキュリティとアクセス制御"
    },
    {
      "indent": 3,
      "text": "All communication between the community and the NomCom and amongst the members of the NomCom needs to be stored in an encrypted form. This information can only be accessed by members of the NomCom.",
      "ja": "コミュニティとNomCom間の、およびNomComのメンバー間のすべての通信は、暗号化された形式で保存する必要があります。この情報には、選考委員会のメンバーのみがアクセスできます。"
    },
    {
      "indent": 3,
      "text": "o SEC-001: The security procedures for the tool MUST be structured so that even system administrators do not have routine or accidental visibility to any data accumulated by the tool. This data includes all confidential feedback and discussions.",
      "ja": "o SEC-001：ツールのセキュリティ手順は、システム管理者でさえ、ツールによって蓄積されたデータを定期的または偶発的に見ることができないように構成する必要があります。このデータには、すべての機密フィードバックとディスカッションが含まれています。"
    },
    {
      "indent": 3,
      "text": "o SEC-002: The tool MUST allow the NomCom chair to input a public key (\"NomCom public key\"). This key is generated by the NomCom chair independent of the tool, for example, using the procedure described in Appendix A.",
      "ja": "o SEC-002：ツールは、NomCom議長が公開鍵（「NomCom公開鍵」）を入力できるようにする必要があります。このキーは、たとえば付録Aで説明されている手順を使用して、ツールとは無関係にNomCom議長によって生成されます。"
    },
    {
      "indent": 3,
      "text": "o SEC-003: All communication sent to the NomCom mailing list MUST be encrypted with the NomCom public key before being committed to persistent storage.",
      "ja": "o SEC-003：NomComメーリングリストに送信されるすべての通信は、永続ストレージにコミットする前にNomCom公開鍵で暗号化する必要があります。"
    },
    {
      "indent": 3,
      "text": "o SEC-004: All community feedback entered using the NomCom tool MUST be encrypted with the NomCom public key before being committed to persistent storage.",
      "ja": "o SEC-004：NomComツールを使用して入力されたすべてのコミュニティフィードバックは、永続ストレージにコミットする前にNomCom公開鍵で暗号化する必要があります。"
    },
    {
      "indent": 3,
      "text": "o SEC-005: After logging in, the tool MUST allow the NomCom members to input a private key (\"NomCom private key\") that corresponds to the NomCom public key. This key will be used to decrypt the feedback/communications that the member is trying to access. Once entered, this key MUST be available for the entire length of the session until the user logs out. This private key MUST NOT be stored in plaintext form into persistent storage at any point of time.",
      "ja": "o SEC-005：ログイン後、ツールはNomComメンバーがNomCom公開鍵に対応する秘密鍵（「NomCom秘密鍵」）を入力できるようにする必要があります。このキーは、メンバーがアクセスしようとしているフィードバック/通信を解読するために使用されます。入力された後、このキーは、ユーザーがログアウトするまで、セッションの全期間にわたって使用可能でなければなりません。この秘密鍵は、平文形式で永続ストレージに保存してはいけません（MUST NOT）。"
    },
    {
      "indent": 3,
      "text": "o SEC-006: The tool MUST provide a mechanism for the NomCom Chair to destroy all data collected by the NomCom at the end of the NomCom's term. Since the NomCom's term overlaps with that of the next year's NomCom, the tool MUST ensure that data collected by the next year's NomCom is not affected by this deletion.",
      "ja": "o SEC-006：ツールは、指名委員会の任期の終わりに指名委員会が収集したすべてのデータを破棄するための指名委員会のメカニズムを提供する必要があります。選考委員会の用語は翌年の選考委員会の用語と重複しているため、ツールは、翌年の選考委員会によって収集されたデータがこの削除の影響を受けないようにする必要があります。"
    },
    {
      "indent": 0,
      "text": "5. Nominations",
      "section_title": true,
      "ja": "5. ノミネート"
    },
    {
      "indent": 3,
      "text": "After the NomCom is constituted, the NomCom chair issues a call for nominations for the open positions. There are two broad ways in which nominees are introduced into the system. The predominant way is that nominations are entered into the system directly by members of the community. The secondary way is that the nominees are entered in by members of the NomCom. The main difference is that members of the NomCom can enter nominations that are originated by other community members. In both of the cases, an email address for the nominee needs to be entered into the tool. Please note that NomCom members usually use the Public NomCom tool, not the Private NomCom tool, to enter their personal nominations and comments.",
      "ja": "指名委員会が構成された後、指名委員会の議長は、オープンポジションの指名を求めます。候補者がシステムに導入される方法は2つあります。主な方法は、候補者がコミュニティのメンバーによって直接システムに入力されることです。二番目の方法は、候補者が指名委員会のメンバーによって入力されることです。主な違いは、指名委員会のメンバーは、他のコミュニティメンバーからの推薦を入力できることです。どちらの場合も、候補者のメールアドレスをツールに入力する必要があります。 NomComメンバーは通常、個人の推薦やコメントを入力するために、Private NomComツールではなく、Public NomComツールを使用することに注意してください。"
    },
    {
      "indent": 3,
      "text": "o NOM-001: The tool MUST allow members of the community to enter nominations into the Public NomCom tool.",
      "ja": "o NOM-001：ツールは、コミュニティのメンバーがパブリックNomComツールに指名を入力できるようにする必要があります。"
    },
    {
      "indent": 3,
      "text": "o NOM-002: The tool MUST allow members of the NomCom to enter nominations into the Private NomCom tool. The tool MUST allow the NomCom member to optionally enter information about the originator of the nomination. The tool MUST record the identity of the originator (if known) of the nomination for audit purposes. Note that anonymous nominations are allowed; thus, the actual identity of an originator may not always be entered into the tool.",
      "ja": "o NOM-002：ツールは、指名委員会のメンバーがプライベート指名ツールに指名を入力できるようにする必要があります。ツールは、NomComメンバーがオプションで指名の発信者に関する情報を入力できるようにする必要があります。ツールは、監査目的で指名の発信者（既知の場合）のIDを記録する必要があります。匿名の指名が許可されていることに注意してください。したがって、発信者の実際のIDが常にツールに入力されるとは限りません。"
    },
    {
      "indent": 3,
      "text": "o NOM-003: The tool MUST allow the NomCom chair to specify information that is required for the nominations. This information will be entered by the NomCom chair as freeform text and will be presented to the individual performing the nomination.",
      "ja": "o NOM-003：ツールは、指名に必要な情報をNomCom議長が指定できるようにする必要があります。この情報は、選考委員長が自由形式のテキストとして入力し、指名を行う個人に提示されます。"
    },
    {
      "indent": 3,
      "text": "o NOM-004: The tool MUST email the nominee after the nomination and mention the position(s) that they have been nominated for. This email MUST NOT disclose to the nominee the identity of the person who performed the nomination.",
      "ja": "o NOM-004：ツールは、指名後にノミネートにメールを送信し、指名されたポジションを言及する必要があります。このメールでは、推薦を行った人物の身元を推薦者に開示してはなりません。"
    },
    {
      "indent": 3,
      "text": "o NOM-005: The tool MUST allow the content of this email to be customized by the NomCom chair.",
      "ja": "o NOM-005：ツールでは、このメールの内容をNomCom議長がカスタマイズできるようにする必要があります。"
    },
    {
      "indent": 3,
      "text": "o NOM-006: The tool MUST automatically attach the questionnaires for the positions for which the nominee has been nominated to this email.",
      "ja": "o NOM-006：ツールは、ノミネートされたポジションのアンケートをこのメールに自動的に添付する必要があります。"
    },
    {
      "indent": 3,
      "text": "o NOM-007: The tool MUST be able to identify duplicate nominations of the same person with the same email address and consolidate them to point to the same nominee.",
      "ja": "o NOM-007：ツールは、同じメールアドレスを持つ同じ人物の重複した指名を識別し、それらを統合して同じ被指名者を指すことができる必要があります。"
    },
    {
      "indent": 3,
      "text": "o NOM-008: In case the same person has been nominated multiple times using different email addresses, the tool MUST allow the NomCom chair to mark duplicate nominations of the same person and consolidate them to point to the same nominee.",
      "ja": "o NOM-008：同じ人物が異なるメールアドレスを使用して複数回指名された場合、ツールはNomCom議長が同じ人物の重複した指名をマークし、それらを統合して同じ指名者を指すようにする必要があります。"
    },
    {
      "indent": 3,
      "text": "o NOM-009: The tool MUST allow a communication email address for a nominee to be set to one different than the email address with which they were nominated.",
      "ja": "o NOM-009：ノミネートされたメールアドレスは、ノミネートされたメールアドレスとは異なるものに設定できるようにする必要があります。"
    },
    {
      "indent": 3,
      "text": "o NOM-010: The tool MUST be able to use the datatracker address book system as the basis for requirements NOM-007, NOM-008, and NOM-009 but MUST allow the NomCom chair to perform manual overrides.",
      "ja": "o NOM-010：ツールは、要件NOM-007、NOM-008、およびNOM-009の基礎としてデータトラッカーアドレス帳システムを使用できる必要がありますが、NomCom議長が手動オーバーライドを実行できるようにする必要があります。"
    },
    {
      "indent": 3,
      "text": "o NOM-011: The tool MUST keep track of the accept and decline status for the nominees.",
      "ja": "o NOM-011：ツールは、候補者の承諾と辞退のステータスを追跡する必要があります。"
    },
    {
      "indent": 0,
      "text": "6. Accepting and Declining Nominations",
      "section_title": true,
      "ja": "6. 推薦の承認と拒否"
    },
    {
      "indent": 3,
      "text": "After receiving the nomination mail, nominees usually respond to indicate either that they accept the nomination or that they are unwilling to do so.",
      "ja": "指名メールを受け取った後、指名者は通常、指名を受け入れるか、受け入れたくないかを示すために応答します。"
    },
    {
      "indent": 3,
      "text": "o AD-001: The tool MUST allow nominees to indicate whether they are accepting or declining their nomination. This is preferably done by providing distinct hyperlinks in the email that the nominees receive.",
      "ja": "o AD-001：ツールは、候補者が候補者の指名を受け入れるか拒否するかを示すことを許可する必要があります。これは、候補者が受信する電子メールに個別のハイパーリンクを提供することによって行われることが好ましい。"
    },
    {
      "indent": 3,
      "text": "o AD-002: The tool MUST allow the NomCom chair to select specific email responses from the nominees and flag them as having been accepted or declined.",
      "ja": "o AD-002：ツールは、指名委員長が候補者からの特定の電子メール応答を選択し、それらが受け入れられたか拒否されたかのフラグを立てることを許可する必要があります。"
    },
    {
      "indent": 3,
      "text": "o AD-003: The tool MUST allow the NomCom chair to manually flag nominees as having accepted or declined the nomination without the need for any nominee action.",
      "ja": "o AD-003：ツールは、指名委員会の議長が指名候補者のアクションを必要とせずに指名候補者を承認または拒否したことを指名して手動でフラグを立てることを許可する必要があります。"
    },
    {
      "indent": 3,
      "text": "o AD-004: The tool MUST allow NomCom members to view the list of all nominees along with their accept or decline status.",
      "ja": "o AD-004：ツールは、NomComメンバーがすべての候補者のリストとその受諾または辞退ステータスを表示できるようにする必要があります。"
    },
    {
      "indent": 3,
      "text": "o AD-005: The tool MUST allow NomCom members to view reports of the accept or decline status both per nominee as well as per open position.",
      "ja": "o AD-005：ツールは、指名委員会ごとおよびオープンポジションごとの両方で、承認または拒否ステータスのレポートをNomComメンバーが表示できるようにする必要があります。"
    },
    {
      "indent": 3,
      "text": "o AD-006: The tool MUST be configurable to send reminder mails to all nominees who have not responded, either on specified dates or at specified intervals. The contents of the reminder mails MUST be customizable by the NomCom chair.",
      "ja": "o AD-006：ツールは、指定された日付または指定された間隔で応答しなかったすべての候補者にリマインダーメールを送信するように構成可能でなければなりません。リマインダーメールの内容は指名委員長がカスタマイズできる必要があります。"
    },
    {
      "indent": 3,
      "text": "o AD-007: The tool MUST be able to generate a summary report containing statistics (total/accept/decline/no response) concerning nominations by position.",
      "ja": "o AD-007：ツールは、ポジションによる推薦に関する統計（合計/承認/拒否/応答なし）を含む要約レポートを生成できなければなりません（MUST）。"
    },
    {
      "indent": 0,
      "text": "7. Questionnaires",
      "section_title": true,
      "ja": "7. アンケート"
    },
    {
      "indent": 3,
      "text": "Nominees fill in a questionnaire for each position for which they accept a nomination. The completed questionnaire is sent in by email to the NomCom mailing list. If a person has been nominated for multiple positions, they may elect to send in a combined questionnaire for a subset (or all) of the positions (QR-002) or fill in one questionnaire per open position (QR-006).",
      "ja": "候補者は、候補者が候補者を推薦する各職位についてアンケートに記入します。完成したアンケートは、電子メールでNomComメーリングリストに送信されます。人が複数のポジションにノミネートされている場合、ポジションのサブセット（またはすべて）の組み合わせアンケート（QR-002）を送信するか、オープンポジションごとに1つのアンケート（QR-006）に記入することを選択できます。"
    },
    {
      "indent": 3,
      "text": "o QR-001: The tool MUST allow the NomCom chair to enter a different questionnaire for each open position.",
      "ja": "o QR-001：ツールは、NomCom議長がオープンポジションごとに異なるアンケートを入力できるようにする必要があります。"
    },
    {
      "indent": 3,
      "text": "o QR-002: The tool MUST allow the NomCom chair to point to email responses from the nominees and flag them as questionnaires.",
      "ja": "o QR-002：ツールは、指名委員会の議長が候補者からの電子メール応答をポイントし、アンケートとしてフラグを立てることを許可する必要があります。"
    },
    {
      "indent": 3,
      "text": "o QR-003: The tool MUST allow NomCom members to directly access questionnaires completed by nominees.",
      "ja": "o QR-003：NomComメンバーが候補者が記入したアンケートに直接アクセスできるようにする必要があります。"
    },
    {
      "indent": 3,
      "text": "o QR-004: The tool MUST keep track of the questionnaire receipt status for the nominees. The completed questionnaires are received as emails to the NomCom mailing list.",
      "ja": "o QR-004：ツールは、候補者のアンケートの受領状況を追跡する必要があります。記入済みのアンケートは、NomComメーリングリストへの電子メールとして受信されます。"
    },
    {
      "indent": 3,
      "text": "o QR-005: Like all other correspondence on the NomCom mailing list, the completed questionnaires MUST be encrypted by the NomCom public key before being stored.",
      "ja": "o QR-005：NomComメーリングリストの他のすべての通信と同様に、記入済みのアンケートは、保存する前にNomCom公開鍵で暗号化する必要があります。"
    },
    {
      "indent": 3,
      "text": "o QR-006: The NomCom chair MUST be able to flag an email as the completed questionnaire for a nominee corresponding to a specific open position.",
      "ja": "o QR-006：NomCom議長は、特定のオープンポジションに対応する候補者の完了したアンケートとしてメールにフラグを立てることができなければなりません（MUST）。"
    },
    {
      "indent": 3,
      "text": "o QR-007: Once flagged, the questionnaire provided by the nominee for a specific position MUST be directly accessible without needing to look through all other feedback received for that nominee.",
      "ja": "o QR-007：フラグが立てられると、特定のポジションについて候補者によって提供されたアンケートは、その候補者に対して受け取った他のすべてのフィードバックを調べる必要なく、直接アクセスできる必要があります。"
    },
    {
      "indent": 0,
      "text": "8. Feedback Collection",
      "section_title": true,
      "ja": "8. フィードバックコレクション"
    },
    {
      "indent": 3,
      "text": "Community feedback is very important in the NomCom process. Community feedback about nominees is the primary mechanism by which NomCom members evaluate nominees.",
      "ja": "コミュニティのフィードバックはNomComプロセスで非常に重要です。候補者に関するコミュニティのフィードバックは、NomComメンバーが候補者を評価する主要なメカニズムです。"
    },
    {
      "indent": 3,
      "text": "o FB-001: The tool MUST allow members of the community to enter feedback about any of the accepting nominees into the Public NomCom tool.",
      "ja": "o FB-001：このツールでは、コミュニティのメンバーが、受理候補者に関するフィードバックをパブリックNomComツールに入力できるようにする必要があります。"
    },
    {
      "indent": 3,
      "text": "o FB-002: The tool MUST allow members of the NomCom to enter feedback about any of the accepting nominees into the Private NomCom tool. The tool MUST allow the NomCom member to optionally enter information about the originator of the feedback. Note that, as in NOM-002, anonymous feedback is allowed; thus, the actual identity of an originator may not always be entered into the tool.",
      "ja": "o FB-002：ツールは、選考委員会のメンバーが、受理候補者のいずれかに関するフィードバックをプライベート選考委員会ツールに入力できるようにする必要があります。ツールは、NomComメンバーがオプションでフィードバックの発信者に関する情報を入力できるようにする必要があります。 NOM-002と同様に、匿名のフィードバックが許可されることに注意してください。したがって、発信者の実際のIDが常にツールに入力されるとは限りません。"
    },
    {
      "indent": 3,
      "text": "o FB-003: The tool MUST allow NomCom members to view feedback entered for each nominee. The identity of the submitter should also be visible with the feedback, unless the submitter wishes to be anonymous.",
      "ja": "o FB-003：このツールでは、指名候補者ごとに入力されたフィードバックをNomComメンバーが表示できるようにする必要があります。提出者が匿名であることが望まれない限り、提出者の身元もフィードバックとともに見えるべきです。"
    },
    {
      "indent": 3,
      "text": "o FB-004: The NomCom members MUST be able to enter their interview comments as feedback for the nominee being interviewed.",
      "ja": "o FB-004：NomComメンバーは、面接される候補者へのフィードバックとして面接コメントを入力できる必要があります。"
    },
    {
      "indent": 3,
      "text": "o FB-005: All email received on the NomCom mailing list MUST be archived. This includes all correspondence among the NomCom members, feedback received over email, as well as completed questionnaires.",
      "ja": "o FB-005：NomComメーリングリストで受信したすべての電子メールをアーカイブする必要があります。これには、指名委員会メンバー間のすべてのやり取り、電子メールで受け取ったフィードバック、および完成したアンケートが含まれます。"
    },
    {
      "indent": 3,
      "text": "o FB-006: The tool MUST allow the NomCom chair to manually copy any of the archived mails into the feedback section of one or more nominees for one or more open positions. This is required because a single email may contain feedback concerning more than one nominee or more than one open position.",
      "ja": "o FB-006：ツールは、NomCom議長が1つ以上のオープンポジションの1つ以上の候補者のフィードバックセクションにアーカイブされたメールを手動でコピーできるようにする必要があります。 1つのメールに複数の候補者または複数のオープンポジションに関するフィードバックが含まれる場合があるため、これは必須です。"
    },
    {
      "indent": 0,
      "text": "9. Security Considerations",
      "section_title": true,
      "ja": "9. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "The tool must authenticate all users and must allow logins to be classified into three roles: NomCom chair, NomCom member, and community member. All communications to/from the NomCom and among members of the NomCom must be stored in an encrypted form.",
      "ja": "このツールは、すべてのユーザーを認証し、ログインをNomCom議長、NomComメンバー、コミュニティメンバーの3つの役割に分類できるようにする必要があります。選考委員会とのやり取り、および選考委員会のメンバー間のすべての通信は、暗号化された形式で保存する必要があります。"
    },
    {
      "indent": 0,
      "text": "10. Acknowledgements",
      "section_title": true,
      "ja": "10. 謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Russ Housley, Barry Leiba, Brian Haberman, Phillip Hallam-Baker, Stewart Bryant, Adrian Farrel, Stephen Farrell, Martin Stiemerling, Benoit Claise, Sean Turner, Ralph Droms, Mary Barnes, Subramanian Moonesamy, and Menachem Dodge for their valuable comments to improve this document.",
      "ja": "著者は、ラス・ハスリー、バリー・レイバ、ブライアン・ハーバーマン、フィリップ・ハラム・ベーカー、スチュワート・ブライアント、アドリアン・ファレル、スティーブン・ファレル、マーティン・スティーマーリング、ブノワ・クレイズ、ショーン・ターナー、ラルフ・ドロムス、メアリー・バーンズ、サブラマニアン・ムーネサミー、メナケム・ドッジに感謝しますこのドキュメントを改善するための貴重なコメントに感謝します。"
    },
    {
      "indent": 0,
      "text": "12. Normative References",
      "section_title": true,
      "ja": "12. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119] Bradner、S。、「要件レベルを示すためにRFCで使用するキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3777] Galvin, J., Ed., \"IAB and IESG Selection, Confirmation, and Recall Process: Operation of the Nominating and Recall Committees\", BCP 10, RFC 3777, June 2004.",
      "ja": "[RFC3777] Galvin、J。、編、「IABおよびIESGの選択、確認、およびリコールプロセス：指名委員会およびリコール委員会の運営」、BCP 10、RFC 3777、2004年6月。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Example for Key Generation",
      "section_title": true,
      "ja": "付録A.キー生成の例"
    },
    {
      "indent": 3,
      "text": "The NomCom chair generates a public/private key pair to be used to encrypt NomCom correspondence and feedback. As an example, the NomCom chair can use openssl to generate the key pair using the following commands:",
      "ja": "NomCom議長は、NomComの通信とフィードバックの暗号化に使用される公開鍵と秘密鍵のペアを生成します。例として、NomCom議長はopensslを使用し、次のコマンドを使用してキーペアを生成できます。"
    },
    {
      "indent": 3,
      "text": "First, the config file for openssl needs to be created with the following contents (example for the 2012-2013 NomCom).",
      "ja": "まず、opensslの構成ファイルを次の内容で作成する必要があります（2012-2013 NomComの例）。"
    },
    {
      "indent": 0,
      "text": "[ req ] distinguished_name = req_distinguished_name string_mask = utf8only x509_extensions = ss_v3_ca",
      "ja": "[req]識別名= req_distinguished_name文字列マスク= utf8only x509_extensions = ss_v3_ca"
    },
    {
      "indent": 0,
      "text": "[ req_distinguished_name ] commonName = Common Name (e.g., NomComYY) commonName_default = NomCom12",
      "ja": "[req_distinguished_name] commonName =共通名（例：NomComYY）commonName_default = NomCom12"
    },
    {
      "indent": 0,
      "text": "[ ss_v3_ca ]",
      "ja": "[ss_v3_ca]"
    },
    {
      "indent": 0,
      "text": "subjectKeyIdentifier = hash\nkeyUsage = critical, digitalSignature, keyEncipherment, dataEncipherment\nbasicConstraints = critical, CA:true\nsubjectAltName = email:nomcom12@ietf.org\nextendedKeyUsage= emailProtection",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "# modify the email address to match the year.",
      "ja": "＃年に一致するようにメールアドレスを変更します。"
    },
    {
      "indent": 22,
      "text": "Figure 1: nomcom-config.cnf",
      "ja": "図1：nomcom-config.cnf"
    },
    {
      "indent": 3,
      "text": "Then the following command needs to be issued in order to generate the private key and the certificate.",
      "ja": "次に、秘密鍵と証明書を生成するために、次のコマンドを発行する必要があります。"
    },
    {
      "indent": 3,
      "text": "$ openssl req -config nomcom-config.cnf -x509 -new -newkey rsa:2048\n-sha256 -days 730 -nodes -keyout privateKey.pem -out nomcom12.cert",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The certificate can then be provided to the tool in order to extract the public key.",
      "ja": "次に、証明書をツールに提供して、公開鍵を抽出できます。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Suresh Krishnan Ericsson 8400 Blvd Decarie Town of Mount Royal, Quebec Canada",
      "ja": "Suresh Krishnan Ericsson 8400 Blvd Decarie Town of Mount Royal、Quebec Canada"
    },
    {
      "indent": 3,
      "text": "EMail: suresh.krishnan@ericsson.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Joel Halpern Ericsson",
      "ja": "ジョエル・ハルパーン・エリクソン"
    },
    {
      "indent": 3,
      "text": "EMail: joel.halpern@ericsson.com",
      "raw": true,
      "ja": ""
    }
  ]
}