{
  "title": {
    "text": "RFC 6172 - Deprecation of the Internet Fibre Channel Protocol (iFCP) Address Translation Mode",
    "ja": "RFC 6172 - インターネットファイバチャネルプロトコル（iFCPゲート）アドレス変換モードの廃止"
  },
  "number": 6172,
  "created_at": "2019-10-29 08:49:35.622871+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                          D. Black\nRequest for Comments: 6172                                           EMC\nUpdates: 4172                                                D. Peterson\nCategory: Standards Track                                        Brocade\nISSN: 2070-1721                                               March 2011",
      "raw": true
    },
    {
      "indent": 7,
      "text": "Deprecation of the Internet Fibre Channel Protocol (iFCP)\n                 Address Translation Mode",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "Changes to Fibre Channel have caused the specification of the Internet Fibre Channel Protocol (iFCP) address translation mode to become incorrect. Due to the absence of usage of iFCP address translation mode, it is deprecated by this document. iFCP address transparent mode remains correctly specified.",
      "ja": "ファイバチャネルへの変更は、インターネットファイバチャネルプロトコル（iFCPゲート）アドレス変換モードの仕様が間違ってなることを引き起こしています。原因のiFCPアドレス変換モードの利用の有無に、それはこの文書で推奨されていません。 iFCPアドレス透過モードが正しく指定されたままになります。"
    },
    {
      "indent": 3,
      "text": "iFCP address transparent mode has been implemented and is in current use; therefore, it is not affected by this document.",
      "ja": "iFCPアドレス透過モードが実装され、現在使用されているされています。したがって、このドキュメントの影響を受けません。"
    },
    {
      "indent": 3,
      "text": "This document also records the state of Protocol Number 133, which was allocated for a pre-standard version of the Fibre Channel Internet Protocol (FCIP).",
      "ja": "また、このドキュメントでは、ファイバ・チャネル・インターネット・プロトコル（FCIP）の標準化前のバージョン用に割り当てられたプロトコル番号133、の状態を記録します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6172.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6172で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2011 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2011 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction...................................................3\n2. Conventions Used in This Document..............................3\n3. iFCP Address Translation Mode..................................3\n   3.1. Problem Discussion........................................4\n   3.2. iFCP Address Translation Mode Deprecation.................4\n4. FCIP and Protocol Number 133...................................5\n5. Security Considerations........................................5\n6. IANA Considerations............................................5\n7. Conclusions....................................................5\n8. References.....................................................5\n   8.1. Normative References......................................5\n   8.2. Informative References....................................6\n9. Acknowledgments ...............................................6",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "See Section 3 of [RFC4172] for introductory material on Fibre Channel concepts.",
      "ja": "ファイバチャネルの概念の入門材料のための[RFC4172]のセクション3を参照してください。"
    },
    {
      "indent": 3,
      "text": "The Internet Fibre Channel Protocol (iFCP) [RFC4172] operates in two modes with respect to Fibre Channel N_PORT fabric addresses (24-bit N_PORT_IDs): address transparent mode and address translation mode (both modes are specified in [RFC4172]):",
      "ja": "アドレストランスペアレントモードとアドレス変換モード（両方のモードは、[RFC4172]で指定されている）：インターネットファイバチャネルプロトコル（のiFCP）[RFC4172]は、ファイバチャネルNポートのファブリック・アドレス（24ビットのN_Port_ID）に対して2つのモードで動作します。"
    },
    {
      "indent": 3,
      "text": "o Address transparent mode is a pass-through mode that preserves Fibre Channel N_PORT fabric addresses.",
      "ja": "Oアドレス透過モードでは、ファイバチャネルNポートファブリックアドレスを保持するパススルーモードです。"
    },
    {
      "indent": 3,
      "text": "o Address translation mode is a Fibre Channel analog to Network Address Translation (NAT) in which iFCP gateways change Fibre Channel N_PORT fabric addresses at the boundary between Fibre Channel and the Internet. Both the source (S_ID) and destination (D_ID) N_PORT fabric addresses may be changed by the iFCP gateways.",
      "ja": "Oアドレス変換モードはiFCPゲートゲートウェイは、ファイバチャネルとインターネットとの境界でのFibre Channel N_PORTファブリックアドレスを変更したネットワークアドレス変換（NAT）へのファイバー・チャネル・アナログです。ソース（S_ID）と宛先（D_ID）Nポートのファブリック・アドレスの両方がのiFCPゲートウェイによって変更することができます。"
    },
    {
      "indent": 3,
      "text": "This document deprecates iFCP address translation mode because the specification has not tracked changes in Fibre Channel and because there are no known implementations.",
      "ja": "この文書では、仕様は、ファイバチャネルの変化を追跡していないためのiFCPアドレス変換モードを非推奨と既知の実装が存在しないため。"
    },
    {
      "indent": 3,
      "text": "Protocol Number 133 was allocated for a pre-standard version of the Fibre Channel Internet Protocol (FCIP) that encapsulated FC frames directly in IP packets. That protocol number is not used by the standard FCIP protocol [RFC3821] [FC-BB-3], but implementations of the pre-standard protocol were deployed. Therefore, this document makes no change to the current allocation of Protocol Number 133.",
      "ja": "プロトコル番号133は、IPパケットに直接FCフレームをカプセル化されたファイバ・チャネル・インターネット・プロトコル（FCIP）のプレ標準バージョンのために割り当てられました。そのプロトコル番号は、標準FCIPプロトコル[RFC3821] [FC-BB-3]で使用されていないが、プリ標準プロトコルの実装は、展開されました。したがって、このドキュメントは、プロトコル番号133の現在の割り当てへの変更を行いません。"
    },
    {
      "indent": 0,
      "text": "2. Conventions Used in This Document",
      "section_title": true,
      "ja": "この文書で使用される2.表記"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "3. iFCP Address Translation Mode",
      "section_title": true,
      "ja": "3.のiFCPアドレス変換モード"
    },
    {
      "indent": 3,
      "text": "iFCP address translation mode has to translate addresses embedded in transmitted data. This is analogous to NAT translation of IP addresses embedded in IP packets. Fibre Channel restricts the occurrence of embedded fabric addresses to control messages (frames); N_PORTs send and receive two types of control frames that may contain embedded fabric addresses: o Extended Link Services (ELSs); and",
      "ja": "iFCPアドレス変換モードでは、送信データに埋め込まれたアドレスを変換する必要があります。これは、IPパケットに埋め込まれたIPアドレスのNAT変換に類似しています。ファイバチャネルは、メッセージ（フレーム）を制御するために埋め込まれたファブリックアドレスの発生を制限します。 N_ポートは、ファブリックアドレスが埋め込まれてもよい制御フレームの二種類の送受信：拡張リンクサービス（ELSS）Oを、そして"
    },
    {
      "indent": 3,
      "text": "o FC-4 Link Services (FC-4 LSs) for the Small Computer System Interface (SCSI) over Fibre Channel Protocol (FCP).",
      "ja": "小型コンピュータシステムインタフェース（SCSI）のためのO FC-4リンクサービス（FC-4のLS）ファイバ・チャネル・プロトコル（FCP）を超えます。"
    },
    {
      "indent": 3,
      "text": "The embedded fabric address translations for N_PORT control frames are specified in Section 7.3 of [RFC4172]. These translations were correct as specified for Fibre Channel as of approximately 2003, based on the [FC-FS] standard for ELSs and the [FCP] standard for FCP FC-4 LSs.",
      "ja": "N_PORT制御フレーム用の埋め込みファブリックアドレス変換は、[RFC4172]のセクション7.3で指定されています。 ELSSため[FC-FS]標準とFCP FC-4のLSのための[FCP]規格に基づいて、約2003としてファイバチャネルに指定され、これらの翻訳は正しかったです。"
    },
    {
      "indent": 0,
      "text": "3.1. Problem Discussion",
      "section_title": true,
      "ja": "3.1。問題のディスカッション"
    },
    {
      "indent": 3,
      "text": "Significant changes have been made to FC control frames since the iFCP specification [RFC4172] was published; the currently applicable FC standards are [FC-LS] and [FCP-3], and additional changes are forthcoming in the [FC-LS-2] and [FCP-4] standards projects, which are nearing completion. These changes have caused Section 7.3 of [RFC4172] to become incorrect.",
      "ja": "有意な変化は、公表されたのiFCP仕様[RFC4172]ので、FC制御フレームになされています。現在適用FC規格は[FC-LS]と[FCP-3]であり、追加の変更は、[FC-LS-2]と[FCP-4]完了に近づいている標準プロジェクトに迫っています。これらの変更は、誤っなるために[RFC4172]の7.3節を引き起こしました。"
    },
    {
      "indent": 3,
      "text": "Actual iFCP deployment has diverged significantly from that anticipated during the development of [RFC4172]. All deployments of iFCP known to the authors of this document use iFCP address transparent mode and are used only for FC inter-switch links. iFCP address translation mode as specified in [RFC4172] cannot be used for FC inter-switch links because the necessary embedded fabric address translations for FC inter-switch control messages (Switch Fabric Internal Link Services (ILSs)) have not been specified.",
      "ja": "実際のiFCP展開は[RFC4172]の開発中に予想されることから、大幅に分岐しています。 iFCPのすべての展開は、このドキュメントの使用のiFCPアドレス透過モードの作者に知られており、唯一のFCスイッチ間のリンクに使用されています。 [RFC4172]で指定されているのiFCPアドレス変換モードが指定されていない（ファブリック内部リンク・サービス（ILSS）を切り替える）FCスイッチ間の制御メッセージのために必要な埋め込まれたファブリックアドレス変換なぜならFCスイッチ間のリンクに使用することはできません。"
    },
    {
      "indent": 0,
      "text": "3.2. iFCP Address Translation Mode Deprecation",
      "section_title": true,
      "ja": "3.2。 iFCP変換モード非推奨アドレス"
    },
    {
      "indent": 3,
      "text": "For the reasons described above, it is prudent to deprecate iFCP address translation mode in preference to updating it to the current state of Fibre Channel standards. Updating iFCP address translation mode would create a continuing requirement to update an unused protocol mode to match future changes to FC control frames.",
      "ja": "上記の理由から、ファイバチャネル規格の現在の状態に更新するに優先してのiFCPアドレス変換モードを廃止するのが賢明です。 iFCPアドレス変換モードを更新すると、FC制御フレームに将来の変化に合わせて、未使用のプロトコルモードを更新するために、継続的な要件を作成します。"
    },
    {
      "indent": 3,
      "text": "Therefore, this document deprecates iFCP address translation mode:",
      "ja": "したがって、この文書はのiFCPアドレス変換モードを非難します："
    },
    {
      "indent": 3,
      "text": "o iFCP address translation mode [RFC4172] SHOULD NOT be implemented and SHOULD NOT be used.",
      "ja": "OのiFCPアドレス変換モード[RFC4172]は実装されるべきではないため、使用しないでください。"
    },
    {
      "indent": 3,
      "text": "o The status of [RFC4172] remains Proposed Standard RFC in order to retain the specification of iFCP address transparent mode.",
      "ja": "O [RFC4172]のステータスは、透過モードに対処するのiFCPの仕様を保持するために提案された標準RFC残ります。"
    },
    {
      "indent": 3,
      "text": "o The [RFC4172] specification of iFCP address translation mode should be treated as Historic [RFC2026].",
      "ja": "OのiFCPアドレス変換モードの[RFC4172]仕様は、歴史[RFC2026]として扱われるべきです。"
    },
    {
      "indent": 0,
      "text": "4. FCIP and Protocol Number 133",
      "section_title": true,
      "ja": "4. FCIPおよびプロトコル番号133"
    },
    {
      "indent": 3,
      "text": "Protocol Number 133 was allocated for Fibre Channel (FC) [IANA-IP] and used by a pre-standard version of the FCIP protocol that encapsulates FC frames directly in IP packets. The standard FCIP protocol [RFC3821] [FC-BB-3] encapsulates FC frames in TCP and hence does not use Protocol Number 133, but implementations of the pre-standard version of the FCIP protocol were deployed [MR]. Based on this deployment, the protocol number needs to remain allocated.",
      "ja": "プロトコル番号133は、ファイバチャネル（FC）[IANA-IP]のために割り当てられ、FCは、IPパケットに直接フレームをカプセル化するFCIPプロトコルのプレ標準バージョンによって使用されました。標準FCIPプロトコル[RFC3821] [FC-BB-3]はTCPにFCフレームをカプセル化し、したがって、プロトコル番号133を使用していないが、FCIPプロトコルのプレ標準バージョンの実装は、[MR]展開されました。この展開に基づいて、プロトコル番号が割り当てられたままにする必要があります。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "The security considerations for iFCP continue to apply; see Section 10 of [RFC4172].",
      "ja": "iFCPのためのセキュリティに関する考慮事項が適用されますし続けます。 [RFC4172]のセクション10を参照してください。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has added this document as a supplemental reference for the allocation of Protocol Number 133 but hasn't changed that allocation.",
      "ja": "IANAは、プロトコル番号133の割り当てのための補助的参考としてこの文書を追加したが、その割り当てを変更していません。"
    },
    {
      "indent": 0,
      "text": "7. Conclusions",
      "section_title": true,
      "ja": "7、結論"
    },
    {
      "indent": 3,
      "text": "For the reasons described in this document, iFCP Address Translation mode is deprecated, and the allocation of Protocol Number 133 remains unchanged at this time.",
      "ja": "この文書で説明する理由により、のiFCPアドレス変換モードは廃止され、プロトコル番号133の割り当ては、この時点では変更されません。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8.参照文献"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "ja": "8.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[FC-FS] Fibre Channel Framing and Signaling Interface (FC-FS), ANSI INCITS 373-2003, October 2003.",
      "ja": "[FC-FS]ファイバチャネルフレーミングおよびシグナリングインターフェイス（FC-FS）、ANSI INCITS 373から2003まで、2003年10月。"
    },
    {
      "indent": 3,
      "text": "[FC-LS] Fibre Channel - Link Services (FC-LS), ANSI INCITS 433-2007, July 2007.",
      "ja": "[FC-LS]ファイバチャネル - リンクサービス（FC-LS）、ANSI INCITS 433から2007まで、2007年7月。"
    },
    {
      "indent": 3,
      "text": "[FCP] Fibre Channel Protocol (FCP), ANSI INCITS 269-1996, April 1996.",
      "ja": "[FCP]ファイバチャネルプロトコル（FCP）、ANSI INCITS 269から1996まで、1996年4月。"
    },
    {
      "indent": 3,
      "text": "[FCP-3] Fibre Channel Protocol - 3 (FCP-3), ISO/IEC 14776-223:2008, June 2008.",
      "ja": "[FCP-3]ファイバチャネルプロトコル -  3（FCP-3）、ISO / IEC 14776から223：2008、2008年6月。"
    },
    {
      "indent": 3,
      "text": "[IANA-IP] Assigned Internet Protocol Numbers, IANA Registry, http://www.iana.org, visited October 2010.",
      "ja": "[IANA-IP]割り当てられたインターネットプロトコル番号、IANAレジストリ、http://www.iana.org、2010年10月訪問しました。"
    },
    {
      "indent": 3,
      "text": "[RFC2026] Bradner, S., \"The Internet Standards Process -- Revision 3\", BCP 9, RFC 2026, October 1996.",
      "ja": "[RFC2026]ブラドナーの、S.、 \"インターネット標準化プロセス - リビジョン3\"、BCP 9、RFC 2026、1996年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC4172] Monia, C., Mullendore, R., Travostino, F., Jeong, W., and M. Edwards, \"iFCP - A Protocol for Internet Fibre Channel Storage Networking\", RFC 4172, September 2005.",
      "ja": "[RFC4172]モニア、C.、Mullendore、R.、Travostino、F.、チョン、W.、およびM.エドワーズ、 \"のiFCP  - インターネットファイバチャネルストレージネットワーキングのための議定書\"、RFC 4172、2005年9月。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "ja": "8.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[FC-BB-3] Fibre Channel Backbone - 3 (FC-BB-3), ANSI INCITS 414-2006, July 2006.",
      "ja": "[FC-BB-3]ファイバチャネルバックボーン -  3（FC-BB-3）、ANSI INCITS 414から2006まで、2006年7月。"
    },
    {
      "indent": 3,
      "text": "[FC-LS-2] Fibre Channel - Link Services - 2 (FC-LS-2), INCITS Project 2103-D, Technical Committee T11 (www.t11.org).",
      "ja": "[FC-LS-2]ファイバチャネル - リンクサービス -  2（FC-LS-2）、INCITSプロジェクト2103-D、技術委員会T11（www.t11.org）。"
    },
    {
      "indent": 3,
      "text": "[FCP-4] Fibre Channel Protocol - 4 (FCP-4), INCITS Project 1828-D, Technical Committee T10 (www.t10.org).",
      "ja": "[FCP-4]ファイバチャネルプロトコル -  4（FCP-4）、INCITSプロジェクト1828-D、技術委員会T10（www.t10.org）。"
    },
    {
      "indent": 3,
      "text": "[MR] Rajagopal, M., Private email communication, June 2009.",
      "ja": "[MR] Rajagopal、M.、プライベート電子メール通信、2009年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC3821] Rajagopal, M., Rodriguez, E., and R. Weber, \"Fibre Channel Over TCP/IP (FCIP)\", RFC 3821, July 2004.",
      "ja": "[RFC3821] Rajagopal、M.、ロドリゲス、E.、およびR.ウェーバー、 \"ファイバーチャネルを介したTCP / IP（FCIP）\"、RFC 3821、2004年7月。"
    },
    {
      "indent": 0,
      "text": "9. Acknowledgments",
      "section_title": true,
      "ja": "9.謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Tom Talpey, David Harrington, Joe Touch, Paul Hoffman, and Pekka Savola for helpful comments on this document.",
      "ja": "作者はこのドキュメントの役に立つコメントをトムTalpey、デヴィッド・ハリントン、ジョー・タッチ、ポール・ホフマン、およびペッカSavolaに感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "David L. Black EMC Corporation 176 South Street Hopkinton, MA 01748",
      "ja": "デビッドL.ブラックEMCコーポレーション176サウスストリートホプキントン、MA 01748"
    },
    {
      "indent": 3,
      "text": "Phone: +1 (508) 293-7953 EMail: david.black@emc.com",
      "ja": "電話：+1（508）293-7953 Eメール：david.black@emc.com"
    },
    {
      "indent": 3,
      "text": "David Peterson Brocade Communications 6000 Nathan Lane North Plymouth, MN 55442",
      "ja": "デヴィッド・ピーターソンブロケードコミュニケーションズ6000ネイサン・レイン北プリマス、MN 55442"
    },
    {
      "indent": 3,
      "text": "Phone: +1 (612) 802-3299 EMail: david.peterson@brocade.com",
      "ja": "電話：+1（612）802-3299 Eメール：david.peterson@brocade.com"
    }
  ]
}