{
  "title": {
    "text": "RFC 6292 - Requirements for a Working Group Charter Tool",
    "ja": "RFC 6292 - ワーキンググループチャーターツールの要件"
  },
  "number": 6292,
  "created_at": "2022-12-15 21:17:11.961061+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                        P. Hoffman\nRequest for Comments: 6292                                VPN Consortium\nCategory: Informational                                        June 2011\nISSN: 2070-1721",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 13,
      "text": "Requirements for a Working Group Charter Tool",
      "ja": "ワーキンググループチャーターツールの要件"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "The IETF intends to provide a new tool to Area Directors for the creation, re-chartering, and closing of Working Groups. The tool will also allow the IETF community to view the status of the chartering process. This document describes the requirements for the proposed new tool, and it is intended as input to a later activity for the design and development of such a tool.",
      "ja": "IETFは、ワーキンググループの作成、再請求、および閉鎖のために、ディレクターにエリアディレクターに新しいツールを提供する予定です。このツールにより、IETFコミュニティはチャータープロセスのステータスを表示できます。このドキュメントでは、提案された新しいツールの要件について説明し、そのようなツールの設計と開発のための後のアクティビティへの入力として意図されています。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントは、インターネット標準の追跡仕様ではありません。情報目的で公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントは、インターネットエンジニアリングタスクフォース（IETF）の製品です。IETFコミュニティのコンセンサスを表しています。公開レビューを受けており、インターネットエンジニアリングステアリンググループ（IESG）からの出版が承認されています。IESGによって承認されたすべてのドキュメントが、あらゆるレベルのインターネット標準の候補者ではありません。RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6292.",
      "ja": "このドキュメントの現在のステータス、任意のERRATA、およびそのフィードバックを提供する方法に関する情報は、http：//www.rfc-editor.org/info/rfc6292で取得できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2011 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2011 IETF Trustおよび文書著者として特定された人。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "このドキュメントは、BCP 78およびIETFドキュメント（http://trustee.ietf.org/license-info）に関連するIETF Trustの法的規定の対象となります。この文書に関するあなたの権利と制限を説明するので、これらの文書を注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、セクション4.Eで説明されている法的規定のセクション4.Eで説明されており、単純化されたBSDライセンスで説明されているように保証なしで提供される簡略化されたBSDライセンステキストを含める必要があります。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  3\n  1.1.  WG Charter Process Overview  . . . . . . . . . . . . . . .  3\n2.  General Requirements . . . . . . . . . . . . . . . . . . . . .  3\n  2.1.  WG Records . . . . . . . . . . . . . . . . . . . . . . . .  4\n  2.2.  Comments . . . . . . . . . . . . . . . . . . . . . . . . .  5\n  2.3.  Naming of Charter Text Proposals . . . . . . . . . . . . .  5\n  2.4.  Wording of Announcements . . . . . . . . . . . . . . . . .  5\n  2.5.  Access to the Tool . . . . . . . . . . . . . . . . . . . .  6\n  2.6.  Initializing the Tool  . . . . . . . . . . . . . . . . . .  6\n3.  Creating and Rechartering WGs  . . . . . . . . . . . . . . . .  6\n  3.1.  Chartering a New WG  . . . . . . . . . . . . . . . . . . .  6\n  3.2.  Rechartering an Existing WG  . . . . . . . . . . . . . . .  8\n  3.3.  Ballots for Charter Approval . . . . . . . . . . . . . . .  9\n4.  Requesting the Closing of a WG . . . . . . . . . . . . . . . .  9\n5.  Searching, Comparing, and Tracking Charters  . . . . . . . . .  9\n  5.1.  Viewing and Searching the Charter Database . . . . . . . .  9\n  5.2.  Seeing Differences between Versions of Pre-Approval\n        Wordings . . . . . . . . . . . . . . . . . . . . . . . . . 10\n  5.3.  Tracking Charters with an Atom Feed  . . . . . . . . . . . 10\n6.  Security Considerations  . . . . . . . . . . . . . . . . . . . 10\n7.  Acknowledgements . . . . . . . . . . . . . . . . . . . . . . . 10\n8.  References . . . . . . . . . . . . . . . . . . . . . . . . . . 11\n  8.1.  Normative References . . . . . . . . . . . . . . . . . . . 11\n  8.2.  Informative References . . . . . . . . . . . . . . . . . . 11",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "[RFC2418] describes the guidelines and procedures for formation and operation of IETF Working Groups (WGs). Since the publication of RFC 2418 in 1998, the IETF has started many dozen new WGs, and has shut down many dozen. In that time, many WGs have had some (often dozens) changes to their charters.",
      "ja": "[RFC2418]は、IETFワーキンググループ（WGS）の形成と操作のガイドラインと手順を説明しています。1998年にRFC 2418が発行されて以来、IETFは数十個の新しいWGSを開始し、数十個を閉鎖しています。その間、多くのWGはチャーターにいくつかの（多くの場合数十）変更を行っています。"
    },
    {
      "indent": 3,
      "text": "Today, virtually all of the tasks associated with creating, rechartering, and closing a WG are performed manually. An Area Director (AD) requests one of these actions by manually sending a message to the Secretariat's ticket system. A member of the Secretariat staff manually updates the internal Secretariat database and the IETF Datatracker, manually places the WG on the IESG teleconference agenda (when appropriate), and manually sends out all of the required messages and announcements.",
      "ja": "今日、WGの作成、充電、および閉鎖に関連するすべてのタスクが手動で実行されています。エリアディレクター（AD）は、事務局のチケットシステムにメッセージを手動で送信することにより、これらのアクションの1つを要求します。事務局のスタッフのメンバーは、内部事務局のデータベースとIETF DatAtrackerを手動で更新し、WGをIESG通信アジェンダ（必要に応じて）に手動で配置し、必要なすべてのメッセージと発表を手動で送信します。"
    },
    {
      "indent": 3,
      "text": "The IETF Administrative Oversight Committee (IAOC) would like to create a better tool for those tasks, and this document lists the requirements for such a tool. When complete, this document may be used to issue an RFP for the design and development of the tool. This document was prepared at the request of the IAOC.",
      "ja": "IETF管理監視委員会（IAOC）は、これらのタスクに適したツールを作成したいと考えており、このドキュメントにはそのようなツールの要件がリストされています。完了したら、このドキュメントを使用して、ツールの設計と開発のためにRFPを発行することができます。このドキュメントは、IAOCの要求に応じて作成されました。"
    },
    {
      "indent": 0,
      "text": "1.1. WG Charter Process Overview",
      "section_title": true,
      "ja": "1.1. WGチャータープロセスの概要"
    },
    {
      "indent": 3,
      "text": "As described in [RFC2418], a key responsibility of the IESG is the creation, re-chartering, and closing of WGs. Creation and rechartering of WGs is a multi-step process that involves internal review of a draft charter by the IESG and IAB, an external review of the draft charter by the IETF community and by other standards bodies, and (likely) approval of a final charter by the IESG. The internal review by the IESG and IAB, and the external review by the IETF community, often result in revisions to the draft charter.",
      "ja": "[RFC2418]に記載されているように、IESGの重要な責任は、WGSの作成、再特徴、および閉鎖です。WGSの作成と充電は、IESGおよびIABによるドラフトチャーターの内部レビュー、IETFコミュニティおよびその他の基準機関による憲章ドラフトの外部レビュー、および最終的IESGによるチャーター。IESGとIABによる内部レビュー、およびIETFコミュニティによる外部レビューにより、多くの場合、憲章ドラフトの改訂が行われます。"
    },
    {
      "indent": 3,
      "text": "Closing of a WG does not require review or approval by the IESG. Rather, a WG may be closed at the request of an AD, normally the Area Advisor for the WG.",
      "ja": "WGの閉鎖には、IESGによるレビューまたは承認は必要ありません。むしろ、WGは、通常はWGのエリアアドバイザーであるADの要求に応じて閉鎖される場合があります。"
    },
    {
      "indent": 3,
      "text": "Note that the charter and recharter processes do not involve changing of WG milestones. A tool that handles milestone updates will likely be created in the future.",
      "ja": "チャーターと充電プロセスには、WGマイルストーンの変更が含まれないことに注意してください。マイルストーンの更新を処理するツールは、将来的に作成される可能性があります。"
    },
    {
      "indent": 0,
      "text": "2. General Requirements",
      "section_title": true,
      "ja": "2. 一般的な要件"
    },
    {
      "indent": 3,
      "text": "The tool described here holds records for new WGs that are being considered as well as for all WGs whose charter are under review.",
      "ja": "ここで説明するツールは、チャーターがレビュー中のすべてのWGSと同様に考慮されている新しいWGSの記録を保持しています。"
    },
    {
      "indent": 0,
      "text": "2.1. WG Records",
      "section_title": true,
      "ja": "2.1. WGレコード"
    },
    {
      "indent": 3,
      "text": "A WG record contains the following fields:",
      "ja": "WGレコードには、次のフィールドが含まれています。"
    },
    {
      "indent": 3,
      "text": "o name of the WG",
      "ja": "o WGの名前"
    },
    {
      "indent": 3,
      "text": "o the WG's acronym",
      "ja": "o WGの頭字語"
    },
    {
      "indent": 3,
      "text": "o names of the WG chairs (if known)",
      "ja": "o WG椅子の名前（既知の場合）"
    },
    {
      "indent": 3,
      "text": "o names of the WG secretary (if any)",
      "ja": "o WG秘書の名前（ある場合）"
    },
    {
      "indent": 3,
      "text": "o names of the WG technical advisors (if any)",
      "ja": "o WGテクニカルアドバイザーの名前（ある場合）"
    },
    {
      "indent": 3,
      "text": "o shepherding AD",
      "ja": "o 羊飼い広告"
    },
    {
      "indent": 3,
      "text": "o IETF area",
      "ja": "o IETFエリア"
    },
    {
      "indent": 3,
      "text": "o charter text",
      "ja": "o チャーターテキスト"
    },
    {
      "indent": 3,
      "text": "o mailing list address and archive location",
      "ja": "o メーリングリストの住所とアーカイブの場所"
    },
    {
      "indent": 3,
      "text": "o previous mailing list (if any)",
      "ja": "o 前のメーリングリスト（ある場合）"
    },
    {
      "indent": 3,
      "text": "o other web sites (such as wikis, trackers, and/or project sites, if any) including web sites existing prior to the WG formation",
      "ja": "o WGフォーメーションの前に存在するWebサイトを含む、他のWebサイト（Wiki、トラッカー、プロジェクトサイトなど）"
    },
    {
      "indent": 3,
      "text": "o earlier acronyms for the WG",
      "ja": "o WGの以前の頭字語"
    },
    {
      "indent": 3,
      "text": "o explanation for why the WG is being chartered or rechartered (if any)",
      "ja": "o WGがチャーターまたは充電されている理由の説明（ある場合）"
    },
    {
      "indent": 3,
      "text": "In addition, a WG record contains the state of the WG in the review process. That state has one annotation: whether or not the state is for a proposed WG or for an existing WG undergoing rechartering. Some changes in state cause messages to be sent to the Secretariat so that the Secretariat can perform additional steps, such as sending out mail to various parties about the latest version of the charter text, deadlines for an upcoming decision, and so on.",
      "ja": "さらに、WGレコードには、レビュープロセスのWGの状態が含まれています。その状態には1つの注釈があります。州が提案されたWGのためであるか、既存のWGが充電されているかどうかです。州のいくつかの変更により、メッセージが事務局に送信されるため、事務局は、チャーターテキストの最新バージョンに関するさまざまな関係者にメールを送信する、今後の決定の締め切りなど、追加の手順を実行できるようにします。"
    },
    {
      "indent": 3,
      "text": "When a WG record is displayed, that display should also reflect whether the WG currently exists or has been closed; that data comes from a different part of the Datatracker database.",
      "ja": "WGレコードが表示されると、そのディスプレイは、WGが現在存在するか閉じているかを反映する必要があります。そのデータは、DataTrackerデータベースの異なる部分からのものです。"
    },
    {
      "indent": 3,
      "text": "Any AD can modify fields in an existing WG record. Any AD can use the tool to change the review state of a WG record. The normal order for steps is shown in this document, but an AD can set the state to any valid value at any time.",
      "ja": "任意の広告は、既存のWGレコードのフィールドを変更できます。どの広告もツールを使用して、WGレコードのレビュー状態を変更できます。手順の通常の順序はこのドキュメントに示されていますが、広告は状態をいつでも有効な値に設定できます。"
    },
    {
      "indent": 0,
      "text": "2.2. Comments",
      "section_title": true,
      "ja": "2.2. コメント"
    },
    {
      "indent": 3,
      "text": "During the reviews for WG creation and rechartering, ADs can comment on the reviews. Any AD can add a comment to the record of a WG that is under review. Each comment can be flagged as either \"blocking\" (meaning blocking forward movement until it is resolved) and \"non-blocking\" (meaning that it is only informative or editorial).",
      "ja": "WGの作成と充電のレビュー中、広告はレビューについてコメントできます。どの広告も、レビュー中のWGの記録にコメントを追加できます。各コメントは、「ブロック」（解決するまで前方の動きをブロックすることを意味する）と「非ブロッキング」（それは有益または編集のみであることを意味する）としてフラグを立てることができます。"
    },
    {
      "indent": 0,
      "text": "2.3. Naming of Charter Text Proposals",
      "section_title": true,
      "ja": "2.3. チャーターテキスト提案の命名"
    },
    {
      "indent": 3,
      "text": "Charter text proposals are to be kept for historical purposes. They are kept in files with a specific naming pattern. The pattern for charters before a WG is formed is:",
      "ja": "チャーターテキストの提案は、歴史的な目的のために保持されます。それらは、特定の命名パターンを持つファイルに保持されます。WGが形成される前のチャーターのパターンは次のとおりです。"
    },
    {
      "indent": 3,
      "text": "charter-ietf-wgacronym-nn[-mm]",
      "ja": "charter-itf-wgacronynnn [-mm]"
    },
    {
      "indent": 3,
      "text": "o \"wgacronym\" is the acronym of the proposed WG.",
      "ja": "o 「wgaCrony」は、提案されたWGの頭字語です。"
    },
    {
      "indent": 3,
      "text": "o \"nn\" is a two-digit charter number assigned in sequence. It starts at \"00\" for before the WG is first chartered; the first finished charter has a value of \"01\".",
      "ja": "o 「NN」は、順番に割り当てられた2桁のチャーター番号です。WGが最初にチャーターされる前に「00」で始まります。最初の完成したチャーターには、「01」の値があります。"
    },
    {
      "indent": 3,
      "text": "o \"mm\" is a two-digit proposal number assigned in sequence. It starts at \"00\" for the first proposal for a particular version of charter. It is omitted in the actual charter file.",
      "ja": "o 「MM」は、順番に割り当てられた2桁の提案番号です。チャーターの特定のバージョンの最初の提案のために「00」から始まります。実際のチャーターファイルで省略されています。"
    },
    {
      "indent": 3,
      "text": "For instance, if the \"example\" WG is chartered and then rechartered twice, you might have the following sequence of files:",
      "ja": "たとえば、「例」WGがチャーターされてから2回充電されている場合、次のファイルのシーケンスがある場合があります。"
    },
    {
      "indent": 3,
      "text": "charter-ietf-example-00-00.txt (first proposal) charter-ietf-example-00-01.txt (second proposal) charter-ietf-example-00-02.txt (third proposal) charter-ietf-example-01.txt (first charter) charter-ietf-example-01-00.txt (first recharter proposal) charter-ietf-example-01-01.txt (second recharter proposal) charter-ietf-example-01-02.txt (third recharter proposal) charter-ietf-example-02.txt (second charter) charter-ietf-example-02-00.txt (next recharter proposal) . . . charter-ietf-example-03.txt (third charter)",
      "ja": "Charter-ietf-example-00-00.txt（最初の提案）charter-ietf-example-00-01.txt（2番目の提案）charter-itf-example-00-02.txt（3番目の提案）charter-etf-example-01.txt（最初のチャーター）Charter-etf-example-01-00.txt（最初のrecharter Proposal）charter-itf-example-01-01.txt（2番目のrecharter proposal）charter-itf-example-01-02。TXT（3回目のリチャーター提案）charter-itf-example-02.txt（2番目のチャーター）charter-etf-example-02-00.txt（次のrecharter proposal）。。。charter-itf-example-03.txt（3番目のチャーター）"
    },
    {
      "indent": 0,
      "text": "2.4. Wording of Announcements",
      "section_title": true,
      "ja": "2.4. 発表の文言"
    },
    {
      "indent": 3,
      "text": "An AD can view and edit the standard \"WG Review\" and \"WG Action\" announcements before they are sent out during the WG creation, rechartering, and closing processes. If the AD edits the message, the Secretariat is alerted to that fact when they receive the request.",
      "ja": "広告は、WGの作成、充電、および閉鎖プロセス中に送信される前に、標準の「WGレビュー」および「WGアクション」アナウンスを表示および編集できます。広告がメッセージを編集した場合、事務局はリクエストを受け取ったときにその事実に警告されます。"
    },
    {
      "indent": 0,
      "text": "2.5. Access to the Tool",
      "section_title": true,
      "ja": "2.5. ツールへのアクセス"
    },
    {
      "indent": 3,
      "text": "Area Directors and the IETF Secretariat currently have access to perform some actions in the Datatracker that other community members do not; this access control continues to be used in many of the extensions listed in this document. Further, the IETF Secretariat can perform all actions that can be performed by any AD in this tool.",
      "ja": "地域のディレクターとIETF事務局は現在、他のコミュニティメンバーがそうではないDatAtrackerでいくつかのアクションを実行するためにアクセスできます。このアクセス制御は、このドキュメントにリストされている多くの拡張機能で引き続き使用されています。さらに、IETF事務局は、このツールのADで実行できるすべてのアクションを実行できます。"
    },
    {
      "indent": 0,
      "text": "2.6. Initializing the Tool",
      "section_title": true,
      "ja": "2.6. ツールの初期化"
    },
    {
      "indent": 3,
      "text": "Records for all WGs that are being created, or are in the process of charter updates, will be added before the tool is first publicly deployed.",
      "ja": "作成されている、またはチャーターの更新の過程にあるすべてのWGSのレコードは、ツールが最初に公開される前に追加されます。"
    },
    {
      "indent": 3,
      "text": "The database should also be initialized with current and historical data, namely as much information as is currently known about existing and closed WGs that can be done in a mostly-automated fashion.",
      "ja": "データベースは、現在のデータと履歴データ、すなわち、ほとんど自動化された方法で実行できる既存および閉じたWGSについて現在知られているように多くの情報を使用して初期化する必要があります。"
    },
    {
      "indent": 0,
      "text": "3. Creating and Rechartering WGs",
      "section_title": true,
      "ja": "3. WGSの作成と充電"
    },
    {
      "indent": 0,
      "text": "3.1. Chartering a New WG",
      "section_title": true,
      "ja": "3.1. 新しいWGをチャーターします"
    },
    {
      "indent": 3,
      "text": "Any AD can create a new WG record using a simple web form. Creating a record should succeed as long as there is no other WG with the same name. Names must be unique, so the tool will warn the AD if the acronym that is being proposed has been used in earlier WG charter proposals and suggest against its use for a new charter. By default, the field in the form listing the shepherding AD will be prepopulated with the name of the AD who is filling in the form. The AD can fill in all the fields for the proposed WG. The names of the WG chairs can be left off during the initial chartering process.",
      "ja": "任意の広告は、単純なWebフォームを使用して新しいWGレコードを作成できます。レコードを作成すると、同じ名前の他のWGがない限り、成功する必要があります。名前は一意でなければならないため、提案されている頭字語が以前のWGチャーター提案で使用され、新しいチャーターへの使用に反して提案されている場合、ツールは広告に警告します。デフォルトでは、羊飼いの広告をリストするフォームのフィールドには、フォームに記入している広告の名前が事前に設定されます。広告は、提案されたWGのすべてのフィールドを埋めることができます。WG椅子の名前は、最初のチャータープロセス中に除去できます。"
    },
    {
      "indent": 3,
      "text": "(Some Secretariat tools have trouble with acronyms of more than eight characters: they truncate the name. This will probably be fixed in the future. The new tool should have a configuration setting that is set to 8 initially, and it should be adjusted when the Secretariat tools are updated. There may also be problems with names that have hyphens in them. However, WGs that have more than eight characters in their names, and WGs with hyphens in their names, have existed for over a year.)",
      "ja": "（一部の事務局のツールは、8文字以上の頭字語に問題があります。名前が切り捨てられます。これはおそらく将来修正されます。新しいツールには、最初に8に設定された構成設定が必要であり、調整すると調整する必要があります。事務局のツールが更新されます。また、ハイフンが入っている名前にも問題がある可能性があります。ただし、名前に8文字以上のWGS、および名前にハイフンを含むWGSは1年以上存在しています。"
    },
    {
      "indent": 3,
      "text": "Creating a new WG record causes the Datatracker state for this potential new WG to be \"Informal IESG review\". When the record is created, the AD proposes a length of time (in weeks) for the internal review time; the default is one week.",
      "ja": "新しいWGレコードを作成すると、この潜在的な新しいWGが「非公式のIESGレビュー」になるためのDatAtracker状態が生じます。レコードが作成されると、ADは内部レビュー時間の長さ（週）を提案します。デフォルトは1週間です。"
    },
    {
      "indent": 3,
      "text": "The review states in which a WG can exist during its initial chartering are: o Informal IESG review -- This is the initial state, moved into by the tool when an AD creates a WG record. When the WG record is moved to this state, a message is sent to the Secretariat. The normal next state is \"Internal review\" if the idea is accepted, or \"Not currently under review\" if the idea is abandoned. The tool should prompt the AD if they try to move to the next state in less than the minimum elapsed time set by the AD when creating the WG, but allow the move if the AD responds to the prompt.",
      "ja": "最初のチャーター中にWGが存在する可能性のあるレビュー状態は次のとおりです。o非公式のIESGレビュー - これは、広告がWGレコードを作成したときにツールによって移動された初期状態です。WGレコードがこの状態に移動されると、メッセージが事務局に送信されます。通常の次の状態は、アイデアが受け入れられた場合は「内部レビュー」、またはアイデアが放棄された場合は「現在審査中ではない」です。ツールは、WGを作成するときに広告が設定した最小エルプス時間未満で次の状態に移動しようとする場合、広告をプロンプトする必要がありますが、ADがプロンプトに応答する場合は移動を許可します。"
    },
    {
      "indent": 3,
      "text": "o Internal review -- The IESG and IAB are reviewing the early draft of the charter; this is the initial IESG and IAB review. When moved to this state, a note is sent to the Secretariat to place this on the next IESG telechat and to inform the IAB. The usual next state is \"External review\" if the idea is adopted, or \"Informal IESG review\" if the IESG decides the idea needs more work, or \"Not currently under review\" if the idea is abandoned.",
      "ja": "o 内部レビュー -  IESGとIABは、チャーターの初期ドラフトをレビューしています。これは、最初のIESGおよびIABレビューです。この州に移動すると、次のIESGテレシャットにこれを配置し、IABに通知するために、事務局にメモが送信されます。通常の次の状態は、アイデアが採用されている場合は「外部レビュー」、またはIESGがアイデアにさらに作業を必要とする場合、またはアイデアが放棄された場合は「現在レビュー中」であると判断した場合は「非公式のIESGレビュー」です。"
    },
    {
      "indent": 3,
      "text": "o External review -- The IETF community and possibly other standards development organizations (SDOs) are reviewing the proposed charter. When moved to this state, a note is sent to the Secretariat to send out the external review announcement to the appropriate lists. The external review announcement will be sent out to the normal IETF-related mailing lists. The AD can specify whether or not to send the announcement to other SDOs (with the default being that it should be), and the AD can also specify additional recipients who should receive the announcement. When moved to this state, a separate note is sent to the Secretariat to schedule discussion for the next IESG telechat. The usual next state is \"IESG review\", although it might move to \"Not currently under review\" if the idea is abandoned during the external review.",
      "ja": "o 外部レビュー -  IETFコミュニティおよびおそらく他の標準開発組織（SDO）が提案された憲章をレビューしています。この州に移動すると、メモが事務局に送信され、外部レビューの発表を適切なリストに送信します。外部レビューの発表は、通常のIETF関連のメーリングリストに送信されます。広告は、発表を他のSDOに送信するかどうかを指定できます（デフォルトは本来あるべきです）。また、広告は発表を受けるべき追加の受信者を指定することもできます。この州に移動すると、次のIESGテレシャットの議論をスケジュールするために、別のメモが事務局に送信されます。通常の次の状態は「IESGレビュー」ですが、外部レビュー中にアイデアが放棄された場合、「現在レビュー中ではない」に移動する可能性があります。"
    },
    {
      "indent": 3,
      "text": "o IESG review -- The IESG is reviewing the discussion from the external review of the proposed charter. The usual next state is \"WG exists\", or \"Not currently under review\" if the idea is abandoned.",
      "ja": "o IESGレビュー -  IESGは、提案された憲章の外部レビューからの議論をレビューしています。通常の次の状態は、アイデアが放棄された場合、「WGが存在する」または「現在審査中ではない」です。"
    },
    {
      "indent": 3,
      "text": "o WG exists -- The WG was approved by the IESG. When moved to this state, a note is sent to the Secretariat to publish the charter and send the appropriate announcements. The WG remains in this state until there is a request to update the charter.",
      "ja": "o WGが存在します-WGはIESGによって承認されました。この州に移動すると、憲章を公開し、適切な発表を送信するために事務局にメモが送信されます。WGは、チャーターを更新するリクエストが発生するまでこの状態にとどまります。"
    },
    {
      "indent": 3,
      "text": "o Not currently under review -- The proposed WG is not being considered at this time. A proposed WG charter will remain in this state until an AD moves it to \"Informa1 IESG review\".",
      "ja": "o 現在審査中ではありません - 提案されているWGは現時点では考慮されていません。提案されたWGチャーターは、広告が「Informa1 IESGレビュー」に移動するまでこの状態に残ります。"
    },
    {
      "indent": 3,
      "text": "All states above, except for \"WG exists\", are given the annotation \"Initial chartering\".",
      "ja": "「WGが存在する」を除く上記のすべての状態には、注釈「初期チャーター」が与えられます。"
    },
    {
      "indent": 3,
      "text": "The chartering process involves the proposed charter appearing on two IESG telechats. The tool should allow an AD and/or the Secretariat to select the telechat date for the approval events. When the telechat is selected, the state determines where it appears on that telechat's agenda.",
      "ja": "チャータープロセスには、2つのIESGテレシャットに登場する提案されたチャーターが含まれます。このツールでは、広告および/または事務局が承認イベントのテレシャット日付を選択できるようにする必要があります。テレシャットが選択されると、州はそのテレシャットのアジェンダのどこに表示されるかを決定します。"
    },
    {
      "indent": 0,
      "text": "3.2. Rechartering an Existing WG",
      "section_title": true,
      "ja": "3.2. 既存のWGを充電します"
    },
    {
      "indent": 3,
      "text": "Any AD can request that a WG be rechartered using a simple web form. This form prompts with the current charter and allows all fields to be edited. Asking for a recharter causes the Datatracker state for this WG to be \"Informal IESG review\". When the recharter record is created, the AD proposes a length of time (in weeks) for the internal review time; the default is one week.",
      "ja": "任意の広告では、単純なWebフォームを使用してWGを充電することを要求できます。このフォームは、現在のチャーターでプロンプトされ、すべてのフィールドを編集できるようにします。充電ターを求めると、このWGのDataTracker状態が「非公式のIESGレビュー」になります。Recharterレコードが作成されると、ADは内部レビュー時間の時間（数週間）を提案します。デフォルトは1週間です。"
    },
    {
      "indent": 3,
      "text": "The review states in which a WG can exist during rechartering are:",
      "ja": "充電中にWGが存在する可能性のあるレビュー状態は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "o WG exists; Informal IESG recharter review -- This is the initial state, moved into by the tool when an AD asks for a WG to be rechartered. When the WG record is moved to this state, a message is sent to the Secretariat. The normal next state is \"WG exists; Internal review\" if the idea is accepted, or \"WG exists\" if this attempt to recharter is abandoned. The tool should prompt the AD if they try to move to the next state in less than the minimum elapsed time set by the AD when asking to recharter the WG.",
      "ja": "o WGが存在します。非公式のIESG Recharterレビュー - これは初期状態であり、広告がWGを充電するように要求したときにツールによって移動されました。WGレコードがこの状態に移動されると、メッセージが事務局に送信されます。通常の次の状態は、「WGが存在し、内部レビュー」です。アイデアが受け入れられた場合、またはこの充電の試みが放棄された場合は「WGが存在する」です。ツールは、WGを充電するように求めるときに広告が設定した最小の経過時間未満で次の状態に移動しようとする場合、広告を促す必要があります。"
    },
    {
      "indent": 3,
      "text": "o WG exists; Internal recharter review -- The IESG and IAB are reviewing the proposed new charter; this is the initial IESG and IAB review of the new charter. When moved to this state, a note is sent to the Secretariat to place this on the next IESG telechat and to inform the IAB. The usual next state is \"WG exists; External review\" if the idea is adopted, or \"WG exists; Informal IESG review\" if the IESG decides the idea needs more work, or \"WG exists\" if the current rechartering is abandoned or if the new charter is approved during internal review.",
      "ja": "o WGが存在します。内部charterレビュー -  IESGとIABは、提案された新しい憲章をレビューしています。これは、新しいチャーターの最初のIESGおよびIABレビューです。この州に移動すると、次のIESGテレシャットにこれを配置し、IABに通知するために、事務局にメモが送信されます。通常の次の状態は「wgが存在し、外部レビュー」です。アイデアが採用されている場合、または「WGが存在する場合、非公式のIESGレビュー」がIESGがより多くの作業を必要とする場合、または現在の充電が放棄されている場合は「WGが存在する」新しいチャーターは、内部レビュー中に承認されます。"
    },
    {
      "indent": 3,
      "text": "o WG exists; External recharter review -- The IETF community and possibly other SDOs are reviewing the proposed new charter. When moved to this state, a note is sent to the Secretariat to send out the external review announcement to the appropriate lists. The external review announcement will be sent to the normal IETF-related mailing lists. The AD can specify whether or not to send the announcement to other SDOs (with the default being that it should be), and the AD can also specify additional recipients who should receive the announcement. The usual next state is \"WG exists; IESG review\", although it might move to \"WG exists\" if the current rechartering is abandoned during the external review.",
      "ja": "o WGが存在します。外部charterレビュー -  IETFコミュニティおよびおそらく他のSDOが提案された新しい憲章をレビューしています。この州に移動すると、メモが事務局に送信され、外部レビューの発表を適切なリストに送信します。外部レビューの発表は、通常のIETF関連のメーリングリストに送信されます。広告は、発表を他のSDOに送信するかどうかを指定できます（デフォルトは本来あるべきです）。また、広告は発表を受けるべき追加の受信者を指定することもできます。通常の次の状態は「WGが存在する; IESGレビュー」ですが、外部レビュー中に現在の充電が放棄された場合、「WGが存在する」に移動する可能性があります。"
    },
    {
      "indent": 3,
      "text": "o WG exists; IESG recharter review -- The IESG is reviewing the discussion from the external review of the recharter. When moved to this state, a note is sent to the Secretariat to schedule discussion for the next IESG telechat. The usual next state is \"WG exists\".",
      "ja": "o WGが存在します。IESG Recharterレビュー -  IESGは、Recharterの外部レビューからの議論をレビューしています。この州に移動すると、次のIESGテレシャットの議論をスケジュールするために、事務局にメモが送信されます。通常の次の状態は「WGが存在する」です。"
    },
    {
      "indent": 3,
      "text": "All states above are given the annotation \"Rechartering\".",
      "ja": "上記のすべての状態には、注釈が「充電」されています。"
    },
    {
      "indent": 3,
      "text": "When rechartering existing WGs, the IESG decides whether or not the recharter needs an external review; many do not.",
      "ja": "既存のWGSを充電するとき、IESGは、充電者が外部レビューを必要とするかどうかを決定します。多くはそうではありません。"
    },
    {
      "indent": 3,
      "text": "The rechartering process involves the proposed charter appearing on one or two IESG telechats. The tool should allow an AD and/or the Secretariat to select the telechat date for the approval events. When the telechat is selected, the state determines where it appears on that telechat's agenda.",
      "ja": "充電プロセスには、提案されたチャーターが1つまたは2つのIESGテレカットに表示されます。このツールでは、広告および/または事務局が承認イベントのテレシャット日付を選択できるようにする必要があります。テレシャットが選択されると、州はそのテレシャットのアジェンダのどこに表示されるかを決定します。"
    },
    {
      "indent": 0,
      "text": "3.3. Ballots for Charter Approval",
      "section_title": true,
      "ja": "3.3. チャーター承認のための投票"
    },
    {
      "indent": 3,
      "text": "The current Datatracker has facilities for ballots on adoption of Internet-Drafts to become RFCs. A separate facility needs to be created to allow balloting for initial chartering or rechartering during IESG review. The balloting for charter and rechartering will allow ADs to express \"yes\", \"no\", and \"abstain\" positions, and will allow ADs to change their positions over time.",
      "ja": "現在のDataTrackerには、RFCになるためのインターネットドラフトの採用に関する投票施設があります。IESGレビュー中に、最初のチャーターまたは充電のための投票を可能にするために、別の施設を作成する必要があります。チャーターと充電の投票により、広告は「はい」、「いいえ」、「棄権」の位置を表現し、広告が時間の経過とともにポジションを変更できるようになります。"
    },
    {
      "indent": 3,
      "text": "As described in Section 2.2, comments can be added to the record for a WG. It is expected that such comments will be added during the balloting process.",
      "ja": "セクション2.2で説明されているように、コメントはWGのレコードに追加できます。投票プロセス中にそのようなコメントが追加されることが予想されます。"
    },
    {
      "indent": 0,
      "text": "4. Requesting the Closing of a WG",
      "section_title": true,
      "ja": "4. WGの閉鎖を要求します"
    },
    {
      "indent": 3,
      "text": "An AD can use the tool to request that the Secretariat close an existing WG. The request action will prompt the AD to provide instructions regarding the disposition of each active Internet-Draft (such as to withdraw the draft, move it to another WG, convert it to an individual submission, and so on), wording for the closure announcement, and the status of the WG mailing list (will it remain open or should it be closed).",
      "ja": "広告はツールを使用して、事務局が既存のWGを閉じることを要求できます。リクエストアクションは、広告に各アクティブなインターネットドラフトの処分に関する指示を提供するように促します（ドラフトを引き出し、別のWGに移動し、個々の提出物に変換するなど）、閉鎖発表の言葉遣い、およびWGメーリングリストのステータス（開いたままになるか、閉じた場合は）。"
    },
    {
      "indent": 0,
      "text": "5. Searching, Comparing, and Tracking Charters",
      "section_title": true,
      "ja": "5. チャーターの検索、比較、追跡"
    },
    {
      "indent": 0,
      "text": "5.1. Viewing and Searching the Charter Database",
      "section_title": true,
      "ja": "5.1. チャーターデータベースの表示と検索"
    },
    {
      "indent": 3,
      "text": "All members of the IETF community can view the public portions of the charter database. This public view should have an explanation of the states given in this document. They can also search for a WG record in the tool based on one or more of the following criteria: o WG name (full or partial)",
      "ja": "IETFコミュニティのすべてのメンバーは、チャーターデータベースの公開部分を表示できます。このパブリックビューには、この文書に記載されている州の説明があるはずです。また、次の基準の1つ以上に基づいて、ツール内のWGレコードを検索することもできます。OWG名（フルまたは部分）"
    },
    {
      "indent": 3,
      "text": "o WG acronym",
      "ja": "o WG頭字語"
    },
    {
      "indent": 3,
      "text": "o WG charter state",
      "ja": "o WGチャーターステート"
    },
    {
      "indent": 3,
      "text": "o Shepherding AD",
      "ja": "o 羊飼い広告"
    },
    {
      "indent": 3,
      "text": "o Area",
      "ja": "o 領域"
    },
    {
      "indent": 3,
      "text": "o Text in any of the fields",
      "ja": "o フィールドのいずれかのテキスト"
    },
    {
      "indent": 3,
      "text": "o Earlier acronyms for the WG",
      "ja": "o WGの以前の頭字語"
    },
    {
      "indent": 3,
      "text": "Further, all users can view all snapshots of earlier versions of a WG's charter. Snapshots include the Area, AD, WG name, WG acronym, chairs, and charter text.",
      "ja": "さらに、すべてのユーザーは、WGのチャーターの以前のバージョンのすべてのスナップショットを表示できます。スナップショットには、エリア、AD、WG名、WG頭字語、椅子、チャーターテキストが含まれます。"
    },
    {
      "indent": 0,
      "text": "5.2. Seeing Differences between Versions of Pre-Approval Wordings",
      "section_title": true,
      "ja": "5.2. 承認前の文言のバージョン間の違いを確認します"
    },
    {
      "indent": 3,
      "text": "It needs to be easy to compare differences between different versions of proposed charter language, up to and including the approved version. Using the naming formats given in Section 2, this means that it must be easy to compare wgacronym-charter-ss (for the highest value of \"ss\") with wgacronym-recharter-ss-nn. It must also be possible to compare any two versions of approved charters (that is, of two values for \"ss\" in wgacronym-charter-ss). It also must be easy to compare two versions that have different acronyms in the case that the acronym changes during the chartering process.",
      "ja": "提案されたチャーター言語の異なるバージョン間の違いを簡単に比較することができ、承認されたバージョンまでと含まれる必要があります。セクション2で指定された命名形式を使用すると、これは、WGACrony-Charter-SS（「SS」の最高値のために）とWGACrony-Recharter-SS-NNを簡単に比較するのが簡単でなければならないことを意味します。また、承認されたチャーターの任意の2つのバージョンを比較することも可能である必要があります（つまり、wgaCrony-charter-ssの「ss」の2つの値のうち）。また、チャータープロセス中に頭字語が変化する場合、異なる頭字語を持つ2つのバージョンを簡単に比較することもできなければなりません。"
    },
    {
      "indent": 0,
      "text": "5.3. Tracking Charters with an Atom Feed",
      "section_title": true,
      "ja": "5.3. 原子フィードでチャーターを追跡します"
    },
    {
      "indent": 3,
      "text": "The tool needs to provide an Atom feed [RFC4287] for the changes in a charter. The contents of the feed are the full WG record, plus an indication of what changed since the last entry in the feed.",
      "ja": "このツールは、チャーターの変化のために原子フィード[RFC4287]を提供する必要があります。フィードの内容は、完全なWGレコードに加えて、フィードの最後のエントリ以降に変化したものを示しています。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "Creating a new tool for tracking the charter of WGs does not affect the security of the Internet in any significant fashion.",
      "ja": "WGSの憲章を追跡するための新しいツールを作成しても、インターネットのセキュリティには重要な方法で影響しません。"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgements",
      "section_title": true,
      "ja": "7. 謝辞"
    },
    {
      "indent": 3,
      "text": "This document draws heavily on earlier work done on this topic by other writers, such as previous IESG and IAB members. Various members of the IESG contributed many suggestions to this document. In particular David Harrington, Robert Sparks, and Russ Housley contributed a great deal of wording and many ideas.",
      "ja": "このドキュメントは、以前のIESGやIABメンバーなど、他の作家によってこのトピックに関する以前の作業に大きく描かれています。IESGのさまざまなメンバーが、この文書に多くの提案を提供しました。特に、デビッド・ハリントン、ロバート・スパークス、そしてラス・ヒューズリーは、多くの言葉遣いと多くのアイデアを貢献しました。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8. 参考文献"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "ja": "8.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC2418] Bradner, S., \"IETF Working Group Guidelines and Procedures\", BCP 25, RFC 2418, September 1998.",
      "ja": "[RFC2418] Bradner、S。、「IETFワーキンググループのガイドラインと手順」、BCP 25、RFC 2418、1998年9月。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "ja": "8.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[RFC4287] Nottingham, M., Ed. and R. Sayre, Ed., \"The Atom Syndication Format\", RFC 4287, December 2005.",
      "ja": "[RFC4287]ノッティンガム、M。、編and R. Sayre、ed。、「The Atom Syndication Format」、RFC 4287、2005年12月。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者の連絡先"
    },
    {
      "indent": 3,
      "text": "Paul Hoffman VPN Consortium",
      "ja": "ポール・ホフマンVPNコンソーシアム"
    },
    {
      "indent": 3,
      "text": "EMail: paul.hoffman@vpnc.org",
      "raw": true,
      "ja": ""
    }
  ]
}