{
  "title": {
    "text": "RFC 6676 - Multicast Addresses for Documentation",
    "ja": "RFC 6676 - ドキュメントのマルチキャストアドレス"
  },
  "number": 6676,
  "created_at": "2020-08-20 18:20:01.160007+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         S. Venaas\nRequest for Comments: 6676                                     R. Parekh\nCategory: Informational                                  G. Van de Velde\nISSN: 2070-1721                                            Cisco Systems\n                                                                T. Chown\n                                               University of Southampton\n                                                              M. Eubanks\n                                                 Iformata Communications\n                                                             August 2012",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 17,
      "text": "Multicast Addresses for Documentation",
      "ja": "ドキュメントのマルチキャストアドレス"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document discusses which multicast addresses should be used for documentation purposes and reserves multicast addresses for such use. Some multicast addresses are derived from AS numbers or unicast addresses. This document also explains how these can be used for documentation purposes.",
      "ja": "このドキュメントでは、ドキュメント化の目的で使用するマルチキャストアドレスについて説明し、そのような使用のためにマルチキャストアドレスを予約します。一部のマルチキャストアドレスは、AS番号またはユニキャストアドレスから取得されます。このドキュメントでは、これらをドキュメント化の目的で使用する方法についても説明します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の状態"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはInternet Standards Trackの仕様ではありません。情報提供を目的として公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントは、IETF（Internet Engineering Task Force）の製品です。これは、IETFコミュニティのコンセンサスを表しています。公開レビューを受け、インターネットエンジニアリングステアリンググループ（IESG）による公開が承認されました。 IESGによって承認されたすべてのドキュメントが、あらゆるレベルのインターネット標準の候補になるわけではありません。 RFC 5741のセクション2をご覧ください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6676.",
      "ja": "このドキュメントの現在のステータス、エラータ、およびフィードバックの提供方法に関する情報は、http：//www.rfc-editor.org/info/rfc6676で入手できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2012 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2012 IETF Trustおよびドキュメントの作成者として特定された人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書は、BCP 78およびIETF文書に関するIETFトラストの法的規定（http://trustee.ietf.org/license-info）の対象であり、この文書の発行日に有効です。これらのドキュメントは、このドキュメントに関するあなたの権利と制限を説明しているため、注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、Trust Legal Provisionsのセクション4.eに記載されているSimplified BSD Licenseのテキストが含まれている必要があり、Simplified BSD Licenseに記載されているように保証なしで提供されます。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. IPv4 Multicast Documentation Addresses ..........................3\n   2.1. Administratively Scoped IPv4 Multicast Addresses ...........3\n   2.2. GLOP Multicast Addresses ...................................3\n   2.3. Unicast Prefix-Based IPv4 Multicast Addresses ..............4\n3. IPv6 Multicast Documentation Addresses ..........................4\n   3.1. Unicast Prefix-Based IPv6 Multicast Addresses ..............5\n   3.2. Embedded-RP IPv6 Multicast Addresses .......................5\n4. Security Considerations .........................................5\n5. IANA Considerations .............................................5\n6. Acknowledgments .................................................6\n7. Informative References ..........................................6",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "It is often useful in documentation, IETF documents, etc., to provide examples containing IP multicast addresses. For documentation where examples of general purpose multicast addresses are needed, one should use multicast addresses that will never be assigned or in actual use. There is a risk that addresses used in examples may accidentally be used. It is then important that the same addresses not be used by other multicast applications or services. It may also be beneficial to filter out such addresses from multicast signalling and to filter out multicast data sent to such addresses.",
      "ja": "ドキュメンテーション、IETF文書などでは、IPマルチキャストアドレスを含む例を提供すると便利です。汎用マルチキャストアドレスの例が必要なドキュメントでは、割り当てられない、または実際に使用されることのないマルチキャストアドレスを使用する必要があります。例で使用されているアドレスが誤って使用されるリスクがあります。その場合、同じアドレスが他のマルチキャストアプリケーションまたはサービスで使用されないことが重要です。そのようなアドレスをマルチキャストシグナリングから除外し、そのようなアドレスに送信されたマルチキャストデータを除外することも有益です。"
    },
    {
      "indent": 3,
      "text": "For unicast, there are both IPv4 and IPv6 addresses reserved for this purpose; see [RFC5737] and [RFC3849], respectively. This document reserves multicast addresses for this same purpose.",
      "ja": "ユニキャストの場合、この目的のために予約されているIPv4アドレスとIPv6アドレスの両方があります。 [RFC5737]と[RFC3849]をそれぞれ参照してください。このドキュメントでは、これと同じ目的でマルチキャストアドレスを予約しています。"
    },
    {
      "indent": 3,
      "text": "There are also some multicast addresses that are derived from AS numbers or unicast addresses. For examples where such addresses are desired, one should derive them from the AS numbers and unicast addresses reserved for documentation purposes. This document also discusses the use of these.",
      "ja": "AS番号またはユニキャストアドレスから派生したマルチキャストアドレスもいくつかあります。このようなアドレスが必要な例では、ドキュメント化のために予約されているAS番号とユニキャストアドレスからアドレスを取得する必要があります。このドキュメントでは、これらの使用についても説明します。"
    },
    {
      "indent": 0,
      "text": "2. IPv4 Multicast Documentation Addresses",
      "section_title": true,
      "ja": "2. IPv4マルチキャストドキュメントアドレス"
    },
    {
      "indent": 3,
      "text": "For Any-Source Multicast (ASM), the IPv4 multicast addresses allocated for documentation purposes are 233.252.0.0 - 233.252.0.255 (233.252.0.0/24).",
      "ja": "Any-Source Multicast（ASM）の場合、文書化の目的で割り当てられるIPv4マルチキャストアドレスは233.252.0.0-233.252.0.255（233.252.0.0/24）です。"
    },
    {
      "indent": 3,
      "text": "For Source-Specific Multicast (SSM), it is less important which multicast addresses are used, since a host/application joins a channel identified by both source and group. Any source addresses used in SSM examples should be unicast addresses reserved for documentation purposes. There are three unicast address ranges provided for documentation use in [RFC5737]. The ranges are 192.0.2.0/24, 198.51.100.0/24 and 203.0.113.0/24.",
      "ja": "ホスト/アプリケーションはソースとグループの両方で識別されるチャネルに参加するため、ソース固有のマルチキャスト（SSM）では、どのマルチキャストアドレスを使用するかはそれほど重要ではありません。 SSMの例で使用されている送信元アドレスは、文書化の目的で予約されているユニキャストアドレスである必要があります。 [RFC5737]でのドキュメントの使用のために提供された3つのユニキャストアドレス範囲があります。範囲は192.0.2.0/24、198.51.100.0/24、203.0.113.0/24です。"
    },
    {
      "indent": 3,
      "text": "Sometimes one wants to give examples where a specific type of address is desired. For example, for text about multicast scoping, one might want the examples to use addresses that are to be used for administrative scoping. See below for guidance on how to construct specific types of example addresses.",
      "ja": "特定の種類のアドレスが必要な例を挙げたい場合があります。たとえば、マルチキャストスコープに関するテキストの場合、管理スコープに使用されるアドレスを使用する例が必要になる場合があります。特定のタイプのサンプルアドレスを作成する方法については、以下を参照してください。"
    },
    {
      "indent": 0,
      "text": "2.1. Administratively Scoped IPv4 Multicast Addresses",
      "section_title": true,
      "ja": "2.1. 管理用スコープのIPv4マルチキャストアドレス"
    },
    {
      "indent": 3,
      "text": "Administratively scoped IPv4 multicast addresses [RFC2365] are reserved for scoped multicast. They can be used within a site or an organization. Apart from a small set of scope-relative addresses, these addresses are not assigned. The high order /24 in every scope is reserved for relative assignments. A relative assignment is an integer offset from the highest address in the scope and represents an IPv4 address. For documentation purposes, the integer offset is 10. This provides one multicast address per scope.",
      "ja": "管理スコープのIPv4マルチキャストアドレス[RFC2365]はスコープマルチキャスト用に予約されています。それらはサイトまたは組織内で使用できます。スコープ相対アドレスの小さなセットを除いて、これらのアドレスは割り当てられません。すべてのスコープの上位/ 24は、相対的な割り当てのために予約されています。相対割り当ては、スコープの最上位アドレスからの整数オフセットであり、IPv4アドレスを表します。文書化の目的で、整数オフセットは10です。これにより、スコープごとに1つのマルチキャストアドレスが提供されます。"
    },
    {
      "indent": 3,
      "text": "For example in the Local Scope 239.255.0.0/16, the multicast address for documentation purposes is 239.255.255.245.",
      "ja": "たとえば、ローカルスコープ239.255.0.0/16では、文書化のためのマルチキャストアドレスは239.255.255.245です。"
    },
    {
      "indent": 0,
      "text": "2.2. GLOP Multicast Addresses",
      "section_title": true,
      "ja": "2.2. GLOPマルチキャストアドレス"
    },
    {
      "indent": 3,
      "text": "GLOP [RFC3180] is a method for deriving IPv4 multicast group addresses from 16-bit AS numbers. For examples where GLOP addresses are desired, the addresses should be derived from the AS numbers reserved for documentation use.",
      "ja": "GLOP [RFC3180]は、16ビットAS番号からIPv4マルチキャストグループアドレスを導出する方法です。 GLOPアドレスが必要な例では、アドレスはドキュメント用に予約されているAS番号から取得する必要があります。"
    },
    {
      "indent": 3,
      "text": "The 16-bit AS numbers reserved for documentation use in [RFC5398] are 64496 - 64511. By use of [RFC3180], we then get 16 /24 multicast prefixes for documentation use. The first one is 233.251.240.0/24, and the last one is 233.251.255.0/24.",
      "ja": "[RFC5398]でドキュメント用に予約されている16ビットAS番号は64496-64511です。[RFC3180]を使用すると、ドキュメント用の16/24マルチキャストプレフィックスが取得されます。最初のものは233.251.240.0/24で、最後のものは233.251.255.0/24です。"
    },
    {
      "indent": 0,
      "text": "2.3. Unicast Prefix-Based IPv4 Multicast Addresses",
      "section_title": true,
      "ja": "2.3. ユニキャストプレフィックスベースのIPv4マルチキャストアドレス"
    },
    {
      "indent": 3,
      "text": "IPv4 multicast addresses can be derived from IPv4 unicast prefixes, see [RFC6034]. For examples where this type of address is desired, the addresses should be derived from the unicast addresses reserved for documentation purposes, see [RFC5737].",
      "ja": "IPv4マルチキャストアドレスは、IPv4ユニキャストプレフィックスから派生できます。[RFC6034]を参照してください。このタイプのアドレスが必要な例については、アドレスは、文書化の目的で予約されているユニキャストアドレスから取得する必要があります。[RFC5737]を参照してください。"
    },
    {
      "indent": 3,
      "text": "There are three unicast address ranges provided for documentation use in [RFC5737]. The ranges are 192.0.2.0/24, 198.51.100.0/24, and 203.0.113.0/24. Using [RFC6034], this leaves the unicast prefix-based IPv4 multicast addresses 234.192.0.2, 234.198.51.100, and 234.203.0.113.",
      "ja": "[RFC5737]でのドキュメントの使用のために提供された3つのユニキャストアドレス範囲があります。範囲は192.0.2.0/24、198.51.100.0/24、および203.0.113.0/24です。 [RFC6034]を使用すると、ユニキャストプレフィックスベースのIPv4マルチキャストアドレス234.192.0.2、234.198.51.100、および234.203.0.113が残ります。"
    },
    {
      "indent": 0,
      "text": "3. IPv6 Multicast Documentation Addresses",
      "section_title": true,
      "ja": "3. IPv6マルチキャストドキュメントアドレス"
    },
    {
      "indent": 3,
      "text": "For Any-Source Multicast (ASM), the IPv6 multicast addresses allocated for documentation purposes are FF0X::DB8:0:0/96. This is a /96 prefix so that it can be used with group IDs, according to the allocation guidelines in [RFC3307]. Also note that for these addresses, the transient flag, or \"T-flag\" as defined in [RFC4291], is zero. This is because they are permanently assigned. There can be no permanently assigned addresses for documentation purposes with the transient flag set to one, since the flag set to one means that they are not permanently assigned.",
      "ja": "Any-Source Multicast（ASM）の場合、文書化のために割り当てられたIPv6マルチキャストアドレスはFF0X :: DB8：0：0/96です。これは/ 96プレフィックスなので、[RFC3307]の割り当てガイドラインに従って、グループIDで使用できます。また、これらのアドレスの場合、[RFC4291]で定義されている一時フラグ、つまり「Tフラグ」がゼロであることにも注意してください。これは、それらが永続的に割り当てられるためです。フラグが1に設定されていると永続的に割り当てられないことを意味するため、一時的なフラグを1に設定すると、文書化のために永続的に割り当てられるアドレスはありません。"
    },
    {
      "indent": 3,
      "text": "For Source-Specific Multicast (SSM), it is less important which multicast addresses are used, since a host/application joins a channel identified by both source and group. Any source addresses used in SSM examples should be unicast addresses reserved for documentation purposes. The IPv6 unicast prefix reserved for documentation purposes is 2001:DB8::/32, see [RFC3849].",
      "ja": "ホスト/アプリケーションはソースとグループの両方で識別されるチャネルに参加するため、ソース固有のマルチキャスト（SSM）では、どのマルチキャストアドレスを使用するかはそれほど重要ではありません。 SSMの例で使用されている送信元アドレスは、文書化の目的で予約されているユニキャストアドレスである必要があります。文書化のために予約されているIPv6ユニキャストプレフィックスは2001：DB8 :: / 32です。[RFC3849]を参照してください。"
    },
    {
      "indent": 3,
      "text": "Sometimes one wants to give examples where a specific type of address is desired. For example, for text about multicast scoping, one might want the examples to use addresses that are to be used for administrative scoping. See below for guidance on how to construct specific types of example addresses.",
      "ja": "特定の種類のアドレスが必要な例を挙げたい場合があります。たとえば、マルチキャストスコープに関するテキストの場合、管理スコープに使用されるアドレスを使用する例が必要になる場合があります。特定のタイプのサンプルアドレスを作成する方法については、以下を参照してください。"
    },
    {
      "indent": 0,
      "text": "3.1. Unicast Prefix-Based IPv6 Multicast Addresses",
      "section_title": true,
      "ja": "3.1. ユニキャストプレフィックスベースのIPv6マルチキャストアドレス"
    },
    {
      "indent": 3,
      "text": "IPv6 multicast addresses can be derived from IPv6 unicast prefixes, see [RFC3306]. For examples where this type of address is desired, the addresses should be derived from the unicast addresses reserved for documentation purposes.",
      "ja": "IPv6マルチキャストアドレスは、IPv6ユニキャストプレフィックスから派生できます。[RFC3306]を参照してください。このタイプのアドレスが必要な例では、アドレスは、文書化の目的で予約されているユニキャストアドレスから取得する必要があります。"
    },
    {
      "indent": 3,
      "text": "The IPv6 unicast prefix reserved for documentation purposes is 2001: DB8::/32, see [RFC3849]. This allows a wide range of different IPv6 multicast addresses. Using just the base /32 prefix, one gets the IPv6 multicast prefixes FF3X:20:2001:DB8::/64 -- one for each available scope X. One can also produce longer prefixes from this. Just as an example, one can pick a /64 prefix 2001:DB8:DEAD: BEEF::/64, which gives the multicast prefixes FF3X:40:2001:DB8:DEAD: BEEF::/96 -- one for each available scope X.",
      "ja": "文書化のために予約されているIPv6ユニキャストプレフィックスは2001です：DB8 :: / 32、[RFC3849]を参照してください。これにより、さまざまなIPv6マルチキャストアドレスを幅広く使用できます。ベースの/ 32プレフィックスだけを使用して、IPv6マルチキャストプレフィックスFF3X：20：2001：DB8 :: / 64を取得します。使用可能なスコープXごとに1つです。これからより長いプレフィックスを生成することもできます。例として、/ 64プレフィックス2001：DB8：DEAD：BEEF :: / 64を選択できます。これにより、マルチキャストプレフィックスFF3X：40：2001：DB8：DEAD：BEEF :: / 96が使用可能になります。スコープX。"
    },
    {
      "indent": 0,
      "text": "3.2. Embedded-RP IPv6 Multicast Addresses",
      "section_title": true,
      "ja": "3.2. 組み込みRP IPv6マルチキャストアドレス"
    },
    {
      "indent": 3,
      "text": "There is a type of IPv6 multicast address called an \"Embedded-RP\" address, where the IPv6 address of a Rendezvous-Point (RP) is embedded inside the multicast address, see [RFC3956]. For examples where this type of address is desired, the addresses should be derived from the unicast addresses reserved for documentation purposes, see [RFC3849].",
      "ja": "「Embedded-RP」アドレスと呼ばれるタイプのIPv6マルチキャストアドレスがあり、Rendezvous-Point（RP）のIPv6アドレスがマルチキャストアドレス内に埋め込まれています。[RFC3956]を参照してください。このタイプのアドレスが望ましい例については、アドレスは、文書化の目的で予約されているユニキャストアドレスから派生する必要があります。[RFC3849]を参照してください。"
    },
    {
      "indent": 3,
      "text": "For documentation purposes, the RP address can be any address from the range 2001:DB8::/32 that follows the constraints specified in [RFC3956]. One example address could be 2001:DB8::1. The Embedded-RP multicast prefixes might then be FF7X:120:2001:DB8::/96. Another example could be the RP address 2001:DB8:BEEF:FEED::7, which gives the prefixes FF7X:740:2001:DB8:BEEF:FEED::/96. See also the examples in [RFC3956].",
      "ja": "文書化の目的で、RPアドレスは[RFC3956]で指定された制約に従う2001：DB8 :: / 32の範囲の任意のアドレスにすることができます。たとえば、アドレスは2001：DB8 :: 1のようになります。その場合、Embedded-RPマルチキャストプレフィックスはFF7X：120：2001：DB8 :: / 96になります。別の例としては、RPアドレス2001：DB8：BEEF：FEED :: 7があり、プレフィックスFF7X：740：2001：DB8：BEEF：FEED :: / 96が付与されます。 [RFC3956]の例も参照してください。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "The use of specific multicast addresses for documentation purposes has no negative impact on security.",
      "ja": "文書化のために特定のマルチキャストアドレスを使用しても、セキュリティに悪影響はありません。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "ja": "5. IANAに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has added a reference to this document for the IPv4 MCAST-TEST-NET allocation so that all the different documentation multicast assignments reference this document.",
      "ja": "IANAは、IPv4 MCAST-TEST-NET割り当てに関するこのドキュメントへの参照を追加したため、さまざまなドキュメントのマルチキャスト割り当てすべてがこのドキュメントを参照しています。"
    },
    {
      "indent": 3,
      "text": "IANA has assigned a scope-relative IPv4 address for documentation purposes.",
      "ja": "IANAは、文書化の目的でスコープ相対IPv4アドレスを割り当てました。"
    },
    {
      "indent": 3,
      "text": "IANA has assigned \"variable-scope\" IPv6 multicast addresses for documentation purposes. This is a /96 prefix.",
      "ja": "IANAは、ドキュメント化の目的で「変数スコープ」のIPv6マルチキャストアドレスを割り当てています。これは/ 96プレフィックスです。"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgments",
      "section_title": true,
      "ja": "6. 謝辞"
    },
    {
      "indent": 3,
      "text": "The authors thank Roberta Maglione, Leonard Giuliano and Dave Thaler for providing comments on this document.",
      "ja": "著者は、このドキュメントにコメントを提供してくれたRoberta Maglione、Leonard Giuliano、Dave Thalerに感謝します。"
    },
    {
      "indent": 0,
      "text": "7. Informative References",
      "section_title": true,
      "ja": "7. 参考引用"
    },
    {
      "indent": 3,
      "text": "[RFC2365] Meyer, D., \"Administratively Scoped IP Multicast\", BCP 23, RFC 2365, July 1998.",
      "ja": "[RFC2365] Meyer、D。、「Administratively Scoped IP Multicast」、BCP 23、RFC 2365、1998年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC3180] Meyer, D. and P. Lothberg, \"GLOP Addressing in 233/8\", BCP 53, RFC 3180, September 2001.",
      "ja": "[RFC3180] Meyer、D。およびP. Lothberg、「GLOPアドレッシングin 233/8」、BCP 53、RFC 3180、2001年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC3306] Haberman, B. and D. Thaler, \"Unicast-Prefix-based IPv6 Multicast Addresses\", RFC 3306, August 2002.",
      "ja": "[RFC3306] Haberman、B。およびD. Thaler、「Unicast-Prefix-based IPv6 Multicast Addresses」、RFC 3306、2002年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC3307] Haberman, B., \"Allocation Guidelines for IPv6 Multicast Addresses\", RFC 3307, August 2002.",
      "ja": "[RFC3307] Haberman、B。、「IPv6マルチキャストアドレスの割り当てガイドライン」、RFC 3307、2002年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC3849] Huston, G., Lord, A., and P. Smith, \"IPv6 Address Prefix Reserved for Documentation\", RFC 3849, July 2004.",
      "ja": "[RFC3849] Huston、G.、Lord、A。、およびP. Smith、「ドキュメント用に予約されたIPv6アドレスプレフィックス」、RFC 3849、2004年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC3956] Savola, P. and B. Haberman, \"Embedding the Rendezvous Point (RP) Address in an IPv6 Multicast Address\", RFC 3956, November 2004.",
      "ja": "[RFC3956] Savola、P。およびB. Haberman、「IPv6マルチキャストアドレスへのランデブーポイント（RP）アドレスの埋め込み」、RFC 3956、2004年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC4291] Hinden, R. and S. Deering, \"IP Version 6 Addressing Architecture\", RFC 4291, February 2006.",
      "ja": "[RFC4291] Hinden、R。およびS. Deering、「IPバージョン6アドレッシングアーキテクチャ」、RFC 4291、2006年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC5398] Huston, G., \"Autonomous System (AS) Number Reservation for Documentation Use\", RFC 5398, December 2008.",
      "ja": "[RFC5398] Huston、G。、「Autonomous System（AS）Number Reservation for Documentation Use」、RFC 5398、2008年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC5737] Arkko, J., Cotton, M., and L. Vegoda, \"IPv4 Address Blocks Reserved for Documentation\", RFC 5737, January 2010.",
      "ja": "[RFC5737] Arkko、J.、Cotton、M。、およびL. Vegoda、「ドキュメント用に予約されたIPv4アドレスブロック」、RFC 5737、2010年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC6034] Thaler, D., \"Unicast-Prefix-Based IPv4 Multicast Addresses\", RFC 6034, October 2010.",
      "ja": "[RFC6034]ターラー、D。、「ユニキャストプレフィックスベースのIPv4マルチキャストアドレス」、RFC 6034、2010年10月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Stig Venaas Cisco Systems Tasman Drive San Jose, CA 95134 USA EMail: stig@cisco.com",
      "ja": "Stig Venaas Cisco Systems Tasman Drive San Jose、CA 95134 USA EMail：stig@cisco.com"
    },
    {
      "indent": 3,
      "text": "Rishabh Parekh Cisco Systems Tasman Drive San Jose, CA 95134 USA EMail: riparekh@cisco.com",
      "ja": "Rishabh Parekh Cisco Systems Tasman Drive、SunJosé、95134メール：repare@cisco.com"
    },
    {
      "indent": 3,
      "text": "Gunter Van de Velde Cisco Systems De Kleetlaan 6a Diegem 1831 Belgium Phone: +32 476 476 022 EMail: gvandeve@cisco.com",
      "ja": "Gunter Van de Velde Cisco Systems De Kleetlaan 6a Diegem 1831 Belgium電話：+32 476 476 022電子メール：gvandeve@cisco.com"
    },
    {
      "indent": 3,
      "text": "Tim Chown University of Southampton Highfield Southampton, Hampshire SO17 1BJ United Kingdom EMail: tjc@ecs.soton.ac.uk",
      "ja": "Tim Chown University of Southampton Highfieldサウサンプトン、ハンプシャーSO17 1BJイギリスEメール：tjc@ecs.soton.ac.uk"
    },
    {
      "indent": 3,
      "text": "Marshall Eubanks Iformata Communications 130 W. Second Street Dayton, Ohio 45402 US Phone: +1 703 501 4376 EMail: marshall.eubanks@iformata.com URI: http://www.iformata.com/",
      "ja": "Marshall Eubanks Iformata Communications 130 W. Second Street Dayton、Ohio 45402 US電話：+1 703 501 4376 Eメール：marshall.eubanks@iformata.com URI：http://www.iformata.com/"
    }
  ]
}