{
  "title": {
    "text": "RFC 6032 - Cryptographic Message Syntax (CMS) Encrypted Key Package Content Type",
    "ja": "RFC 6032 - 暗号メッセージ構文（CMS）暗号化されたキーパッケージのコンテンツタイプ"
  },
  "number": 6032,
  "created_at": "2019-10-27 05:16:41.619850+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         S. Turner\nRequest for Comments: 6032                                          IECA\nCategory: Standards Track                                     R. Housley\nISSN: 2070-1721                                           Vigil Security\n                                                           December 2010",
      "raw": true
    },
    {
      "indent": 19,
      "text": "Cryptographic Message Syntax (CMS)\nEncrypted Key Package Content Type",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document defines the Cryptographic Message Syntax (CMS) encrypted key package content type, which can be used to encrypt a content that includes a key package, such as a symmetric key package or an asymmetric key package. It is transport independent. CMS can be used to digitally sign, digest, authenticate, or further encrypt this content type. It is designed to be used with the CMS Content Constraints (CCC) extension, which does not constrain the EncryptedData, EnvelopedData, and AuthEnvelopedData.",
      "ja": "この文書は、暗号メッセージ構文（CMS）は、このような対称鍵パッケージまたは非対称キーパッケージとしてキーパッケージを含むコンテンツを暗号化するために使用することができる鍵パッケージコンテンツタイプを、暗号化された定義します。それは、トランスポート独立しています。 CMSは、デジタル署名、ダイジェスト、認証、またはさらにこのコンテンツタイプを暗号化するために使用することができます。はEncryptedData、EnvelopedDataの、およびAuthEnvelopedDataを制約しないCMSコンテンツ制約（CCC）の拡張、で使用するように設計されています。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6032.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6032で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2010 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2010 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "The Cryptographic Message Syntax (CMS) specification [RFC5652] defines mechanisms to digitally sign, digest, authenticate, or encrypt arbitrary message content. Many specifications define content types intended for use with CMS. [RFC6031] and [RFC5958] define symmetric key package and asymmetric key package content types that can be signed or encrypted using CMS. CMS allows the composition of complex messages with an arbitrary number of layers. CMS has been augmented by several specifications ([RFC3274], [RFC4073], and [RFC5083]) that define additional mechanisms to enable creation of messages of arbitrary depth and breadth using a variety of authentication, encryption, and compression techniques.",
      "ja": "暗号メッセージ構文（CMS）仕様[RFC5652]はデジタル、署名ダイジェスト認証、または任意のメッセージコンテンツを暗号化するためのメカニズムを定義しています。多くの仕様は、CMSでの使用を目的としたコンテンツタイプを定義します。 [RFC6031]及び[RFC5958]はCMSを使用して署名または暗号化することができる対称鍵パッケージと非対称鍵パッケージのコンテンツタイプを定義します。 CMSは、層の任意の数と複雑なメッセージの構成を可能にします。 CMSは、認証、暗号化、圧縮、様々な技術を用いて任意の深さと幅のメッセージの作成を可能にするために追加のメカニズムを定義する複数の仕様（[RFC3274]、[RFC4073]及び[RFC5083]）によって増強されています。"
    },
    {
      "indent": 3,
      "text": "The CMS Content Constraints (CCC) certificate extension [RFC6010] defines an authorization mechanism that allows recipients to determine whether the originator of an authenticated CMS content type is authorized to produce messages of that type. CCC is used to authorize CMS-protected content. CCC cannot be used to constrain the following structures that are used to provide layers of protection: SignedData, EnvelopedData, EncryptedData, DigestData, CompressedData, AuthenticatedData, ContentCollection, ContentWithAttributes, or AuthEnvelopedData.",
      "ja": "CMSコンテンツ制約（CCC）証明書拡張[RFC6010]は受信者が認証されたCMSコンテンツタイプの発信者がそのタイプのメッセージを生成することを許可されているかどうかを決定することを可能にする許可メカニズムを定義します。 CCCは、CMSで保護されたコンテンツを許可するために使用されます。 SignedData、EnvelopedDataの、はEncryptedData、DigestData、CompressedData、AuthenticatedData、ContentCollection、ContentWithAttributes、またはAuthEnvelopedData：CCCは、保護の層を提供するために使用されている以下の構造を制約するために使用することはできません。"
    },
    {
      "indent": 3,
      "text": "Using the existing CMS mechanisms, producers of authenticated plaintext key packages can be authorized by including a CCC extension containing the appropriate content type in the producer's certificate. However, these mechanisms cannot be used to authorize the producers of encrypted key material. In some key management systems, encrypted key packages are exchanged between entities that cannot decrypt the key package. The encrypted key package itself may be authenticated and passed to another entity. In these cases, checking the authorization of the producer of the encrypted key package may be desired at the intermediate points.",
      "ja": "既存のCMSメカニズムを使用して、認証された平文のキーパッケージの生産者は生産者の証明書で適切なコンテンツタイプを含むCCCの拡張子を含めることによって認可することができます。しかし、これらのメカニズムは、暗号化キーマテリアルの生産を許可するために使用することはできません。いくつかの鍵管理システムでは、暗号化されたキーパッケージがキーパッケージを解読することはできませんエンティティ間で交換されています。暗号化キーパッケージ自体が認証され、別のエンティティに渡すことができます。これらのケースでは、暗号化キーパッケージの生産者の許可をチェックし、中間点で所望され得ます。"
    },
    {
      "indent": 3,
      "text": "This document defines the encrypted key package content type, which can be used to encrypt a content that includes a key package, such as a symmetric key package [RFC6031] or an asymmetric key package [RFC5958]. It is transport independent. The Cryptographic Message Syntax (CMS) [RFC5652] can be used to digitally sign, digest, authenticate, or further encrypt this content type.",
      "ja": "この文書では、そのような対称鍵パッケージ[RFC6031]または非対称キーパッケージ[RFC5958]などのキーパッケージを含むコンテンツを暗号化するために使用することができる暗号化されたキーパッケージコンテンツタイプを定義します。それは、トランスポート独立しています。暗号メッセージ構文（CMS）[RFC5652]はデジタル、署名ダイジェスト認証、またはさらに、このコンテンツタイプを暗号化するために使用することができます。"
    },
    {
      "indent": 3,
      "text": "The encrypted key package content type is designed for use with [RFC6010]. To authorize an originator's public key to originate an encrypted key package, the object identifier associated with the encrypted key package content type is included in the originator's public key certificate CCC certificate extension. For CCC to function, originators encapsulate the encrypted key package in a SignedData, EnvelopedData, or AuthEnvelopedData; then, during certificate path validation, the recipient determines whether the originator is authorized to originate the encrypted key package.",
      "ja": "暗号化キーパッケージのコンテンツタイプは、[RFC6010]で使用するために設計されています。暗号化キーパッケージを発信する発信者の公開鍵を許可するには、暗号化キーパッケージのコンテンツタイプに関連付けられているオブジェクト識別子は、発信者の公開鍵証明書CCC証明書拡張に含まれています。 CCCが機能するためには、オリジネーターはSignedDataの、EnvelopedDataの、またはAuthEnvelopedData内の暗号化キーパッケージをカプセル化します。そして、証明書パス検証の際に、受信者は、発信元が、暗号化キーパッケージを発信するために許可されているかどうかを決定します。"
    },
    {
      "indent": 3,
      "text": "In [RFC6010] terminology, the encrypted key package is a leaf node. Additional authorization checks may be required once the key package is decrypted. For example, the key package shown below consists of a SignedData layer that encapsulates an encrypted key package that encapsulates a SignedData layer containing a symmetric key package. A recipient capable of decrypting the key package would perform the following steps prior to accepting the encapsulated symmetric key material:",
      "ja": "[RFC6010]の用語では、暗号化キーパッケージは、リーフノードです。キーパッケージが解読された後、追加の権限チェックが必要な場合があります。例えば、以下に示すキーパッケージは、対称鍵パッケージを含むのSignedData層をカプセル化し、暗号化キーパッケージをカプセル化するのSignedData層からなります。カプセル化された対称鍵材料を受け入れる前に以下の手順を実行することになり、キーパッケージを解読することが可能な受信者："
    },
    {
      "indent": 6,
      "text": "o Verify the signature on the outer SignedData layer per [RFC5652].",
      "ja": "O [RFC5652]あたりの外側のSignedData層の署名を検証します。"
    },
    {
      "indent": 6,
      "text": "o Build and validate a certification path of the outer signer and confirm the outer signer is authorized to produce the encrypted key package per [RFC5280] and [RFC6010].",
      "ja": "Oビルドおよび外側署名者の認証パスを検証し、外側の署名者が暗号化キー[RFC5280]あたりのパッケージと[RFC6010]を生成するために許可されていることを確認。"
    },
    {
      "indent": 6,
      "text": "o Decrypt the encrypted key package.",
      "ja": "O、暗号化キーパッケージを復号化。"
    },
    {
      "indent": 6,
      "text": "o Verify the signature on the inner SignedData layer per [RFC5652].",
      "ja": "O [RFC5652]あたりの内側のSignedData層の署名を検証します。"
    },
    {
      "indent": 6,
      "text": "o Build and validate a certification path to the signer of the inner SignedData and confirm the inner signer is authorized to produce the symmetric key package per [RFC5280] and [RFC6010]. As specified in [RFC6010], the validator may use the attributes and public keys returned from the second step as inputs for this CMS content constraints processing.",
      "ja": "Oビルドと内側のSignedDataの署名者の認証パスを検証し、内側の署名者は、対称鍵[RFC5280]あたりのパッケージと[RFC6010]を生成するために許可されていることを確認。 [RFC6010]で指定されるように、バリデータは、属性を使用してもよいし、公開鍵は、このCMSコンテンツ制約処理のための入力として第二工程から返さ。"
    },
    {
      "indent": 6,
      "text": "o Use the symmetric key material.",
      "ja": "O対称鍵材料を使用してください。"
    },
    {
      "indent": 12,
      "text": "+--------------------------------------+\n| ContentInfo                          |\n|                                      |\n| +----------------------------------+ |\n| | SignedData                       | |\n| |                                  | |\n| | +------------------------------+ | |\n| | | EncryptedKeyPackage          | | |\n| | |   (encrypted)                | | |\n| | |                              | | |\n| | | +-------------------------+  | | |\n| | | | SignedData              |  | | |\n| | | |                         |  | | |\n| | | | +---------------------+ |  | | |\n| | | | | SymmetricKeyPackage | |  | | |\n| | | | +---------------------+ |  | | |\n| | | +-------------------------+  | | |\n| | +------------------------------+ | |\n| +----------------------------------+ |\n+--------------------------------------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "In the example, authorization of the SymmetricKeyPackage originator need not require an intermediate SignedData layer. For example, if the AuthEnvelopedData option within an EncryptedKeyPackage were used, the second authorization check would be performed beginning with the authEnveloped field.",
      "ja": "一例では、SymmetricKeyPackage元の認可は、中間のSignedData層を必要とする必要はありません。 EncryptedKeyPackage内AuthEnvelopedDataオプションを使用した場合、例えば、第二の権限チェックはauthEnvelopedフィールドで始まる実行されます。"
    },
    {
      "indent": 3,
      "text": "This document also defines an unprotected attribute, Content Decryption Key Identifier, for use with EncryptedData.",
      "ja": "この資料はまたはEncryptedDataで使用するために、保護されていない属性、コンテンツの復号鍵識別子を定義します。"
    },
    {
      "indent": 0,
      "text": "1.1. Terminology",
      "section_title": true,
      "ja": "1.1。用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "1.2. ASN.1 Syntax Notation",
      "section_title": true,
      "ja": "1.2。 ASN.1構文記法"
    },
    {
      "indent": 3,
      "text": "The key package is defined using the ASN.1 [X.680], [X.681], [X.682], and [X.683].",
      "ja": "キーパッケージは、[X.683] [X.682]、[X.681]、ASN.1 [X.680]を使用して定義され、以下同様です。"
    },
    {
      "indent": 0,
      "text": "2. Encrypted Key Package",
      "section_title": true,
      "ja": "2.暗号化キーパッケージ"
    },
    {
      "indent": 3,
      "text": "The encrypted key package content type is used to encrypt a content that includes a key package. This content type is usually used to provide encryption of a key package or a signed key package. This content type makes use of the CMS EncryptedData content type [RFC5652], the CMS EnvelopedData content type [RFC5652], or the CMS AuthEnvelopedData content type [RFC5083] depending on the fields that are needed for key management. The difference between the encrypted key package content type and these three protecting content types is the object identifier and one tag; otherwise, the encrypted key package content type is the same as the selected protecting content type, which is either EncryptedData, EnvelopedData, or AuthEnvelopedData.",
      "ja": "暗号化キーパッケージのコンテンツタイプは、キーパッケージを含むコンテンツを暗号化するために使用されます。このコンテンツタイプは、通常、キーパッケージまたは署名キーパッケージの暗号化を提供するために使用されます。このコンテンツタイプは、CMSはEncryptedDataコンテンツタイプ[RFC5652]、CMS EnvelopedDataのコンテンツタイプ[RFC5652]、または鍵管理のために必要とされる分野に応じて、CMS AuthEnvelopedDataコンテンツタイプ[RFC5083]を使用しています。暗号化キーパッケージコンテンツタイプとこれら三つの保護コンテンツタイプの違いは、オブジェクト識別子と一つのタグです。そうでない場合は、暗号化されたキーパッケージコンテンツタイプはEncryptedData、EnvelopedDataの、又はAuthEnvelopedDataのいずれかで選択された保護コンテンツタイプと同じです。"
    },
    {
      "indent": 3,
      "text": "The encrypted key package content type has the following syntax:",
      "ja": "暗号化キーパッケージのコンテンツタイプの構文は次のとおりです。"
    },
    {
      "indent": 6,
      "text": "ct-encrypted-key-package CONTENT-TYPE ::=\n  { TYPE EncryptedKeyPackage\n    IDENTIFIED BY id-ct-KP-encryptedKeyPkg }",
      "raw": true
    },
    {
      "indent": 6,
      "text": "id-ct-KP-encryptedKeyPkg OBJECT IDENTIFIER ::=\n  { joint-iso-itu-t(2) country(16) us(840) organization(1)\n    gov(101) dod(2) infosec(1) formats(2)\n    key-package-content-types(78) 2 }",
      "raw": true
    },
    {
      "indent": 6,
      "text": "EncryptedKeyPackage ::= CHOICE {\n  encrypted        EncryptedData,\n  enveloped        [0] EnvelopedData,\n  authEnveloped    [1] AuthEnvelopedData }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The EncryptedData structure is used for simple symmetric encryption, where the sender and the receiver already share the necessary encryption key. The EncryptedData structure carries an encryption algorithm identifier, and an unprotected attribute can be used to carry an encryption key identifier if one is needed (see Section 3). See [RFC5652] for further discussion of the EncryptedData fields.",
      "ja": "EncryptedData構造は、送信者と受信者が既に必要な暗号鍵を共有するシンプルな対称暗号化に使用されます。 EncryptedData構造は、暗号化アルゴリズム識別子を運び、そして保護されていない属性は、一つは（セクション3を参照）が必要とされている場合、暗号化キーの識別子を運ぶために使用することができます。 EncryptedDataフィールドのさらなる議論のための[RFC5652]を参照してください。"
    },
    {
      "indent": 3,
      "text": "The EnvelopedData structure is used for encryption, where transferred key management information enables decryption by the receiver. Encryption details depend on the key management algorithm used. In addition to the key management information, the EnvelopedData structure carries an encryption algorithm identifier. See [RFC5652] for further discussion of the EnvelopedData fields.",
      "ja": "EnvelopedDataの構造は、鍵管理情報は、受信機によって復号化を可能に移し、暗号化に使用されます。暗号化の詳細は、使用するキー管理アルゴリズムによって異なります。鍵管理情報に加えて、EnvelopedDataの構造は、暗号化アルゴリズム識別子を運びます。 EnvelopedDataのフィールドのさらなる議論のための[RFC5652]を参照してください。"
    },
    {
      "indent": 3,
      "text": "The AuthEnvelopedData structure is used for authenticated encryption, and it includes key management information in a manner similar to EnvelopedData. Encryption details depend on the key management algorithm used. In addition to the key management information, the AuthEnvelopedData structure carries a message authentication code that covers the content as well as authenticated attributes. See [RFC5083] for further discussion of the AuthEnvelopedData fields.",
      "ja": "AuthEnvelopedData構造は、認証された暗号化に使用され、それはEnvelopedDataのと同様に、鍵管理情報を含みます。暗号化の詳細は、使用するキー管理アルゴリズムによって異なります。鍵管理情報に加えて、AuthEnvelopedData構造は、コンテンツだけでなく、認証された属性をカバーするメッセージ認証コードを運びます。 AuthEnvelopedDataフィールドのさらなる議論のための[RFC5083]を参照してください。"
    },
    {
      "indent": 3,
      "text": "Implementations of this document MUST support the EnvelopedData choice, SHOULD support the EncryptedData choice, and MAY support the AuthEnvelopedData.",
      "ja": "このドキュメントの実装ははEncryptedDataの選択をサポートする必要があり、AuthEnvelopedDataをサポートするかもしれない、EnvelopedDataの選択をサポートしなければなりません。"
    },
    {
      "indent": 3,
      "text": "Implementations that support EnvelopedData and EncryptedData to encapsulate with this content type MUST support an EncryptedKeyPackage that encapsulates either a SignedData [RFC5652] that further encapsulates a SymmetricKeyPackage [RFC6031] or a SignedData that further encapsulates an AsymmetricKeyPackage [RFC5958]. Implementations that support AuthEnvelopedData to encapsulate with this content type MUST support an EncryptedKeyPackage that encapsulates either a SymmetricKeyPackage [RFC6031] or an AsymmetricKeyPackage [RFC5958]. It is OPTIONAL for implementations that support AuthEnvelopedData to encapsulate with this content type to support an EncryptedKeyPackage that encapsulates either a SignedData [RFC5652] that further encapsulates a SymmetricKeyPackage [RFC6031] or a SignedData that further encapsulates an AsymmetricKeyPackage [RFC5958]. Likewise, implementations that process this content type to decrypt the encapsulated data MUST support an EncryptedKeyPackage that encapsulates either a SignedData that further encapsulates a SymmetricKeyPackage or a SignedData that further encapsulates an AsymmetricKeyPackage. An EncryptedKeyPackage content type MUST contain at least one SymmetricKeyPackage or AsymmetricKeyPackage. Implementations MAY support additional encapsulating layers.",
      "ja": "EnvelopedDataのとはEncryptedDataをサポートする実装は、カプセル化EncryptedKeyPackageをサポートしなければなりません、このコンテンツタイプにカプセル化するか、さらにSymmetricKeyPackage [RFC6031]またはさらにAsymmetricKeyPackage [RFC5958]をカプセル化するのSignedDataをカプセル化するのSignedData [RFC5652]。このコンテンツタイプにカプセル化するAuthEnvelopedDataをサポートする実装はSymmetricKeyPackage [RFC6031]またはAsymmetricKeyPackage [RFC5958]のいずれかをカプセル化EncryptedKeyPackageをサポートしなければなりません。さらにSymmetricKeyPackage [RFC6031]またはさらにAsymmetricKeyPackage [RFC5958]をカプセル化するのSignedDataをカプセル化するのSignedData [RFC5652]のいずれかをカプセル化EncryptedKeyPackageをサポートするために、このコンテンツタイプにカプセル化するAuthEnvelopedDataをサポートする実装のためにオプションです。同様に、カプセル化されたデータを復号化するために、このコンテンツタイプを処理する実装はさらにさらにAsymmetricKeyPackageをカプセル化SymmetricKeyPackageまたはのSignedDataをカプセル化するのSignedDataのいずれかをカプセル化EncryptedKeyPackageをサポートしなければなりません。 EncryptedKeyPackageのコンテンツタイプは、少なくとも一つのSymmetricKeyPackageまたはAsymmetricKeyPackageを含まなければなりません。実装は、追加の封止層を支持するかもしれません。"
    },
    {
      "indent": 3,
      "text": "Note that interoperability between an originator and a recipient that do not support the same innermost content (e.g., originator supports AsymmetricKeyPackage while recipient supports SymmetricKeyPackage) is not a concern as originators should be aware of the recipient's capabilities; however, the mechanism for the exchange of the recipient's capabilities is beyond the scope of this document.",
      "ja": "オリジネーターが受信者の能力を認識しておく必要がありとして問題ではありません（受信者がSymmetricKeyPackageをサポートしながら、例えば、発信者がAsymmetricKeyPackageをサポートしています）創始者と同じ最も内側のコンテンツをサポートしていない受信者間の相互運用性を注意してください。ただし、受信者の能力を交換するためのメカニズムは、このドキュメントの範囲を超えています。"
    },
    {
      "indent": 0,
      "text": "3. Content Decryption Key Identifier",
      "section_title": true,
      "ja": "3.コンテンツの復号キー識別子"
    },
    {
      "indent": 3,
      "text": "The content-decryption-key-identifier attribute can be used to identify the symmetric keying material that is needed for decryption of the EncryptedData content if there is any ambiguity. The ATTRIBUTE definition is taken from [RFC5912]. There MUST be only one instance of the content-decryption-key-identifier attribute and there MUST be only one value for the content-decryption-key-identifier attribute.",
      "ja": "コンテンツ復号鍵識別子属性は、任意のあいまいさがある場合にはEncryptedDataコンテンツの復号化のために必要とされる対称鍵材料を識別するために使用することができます。属性定義は[RFC5912]から取られます。コンテンツ復号鍵識別子属性のインスタンスは1つだけでなければならないとコンテンツ復号鍵識別子属性の一つの値だけがあるに違いありません。"
    },
    {
      "indent": 3,
      "text": "The content-decryption-key-identifier attribute has the following syntax:",
      "ja": "コンテンツ復号鍵識別子属性の構文は次のとおりです。"
    },
    {
      "indent": 6,
      "text": "aa-content-decrypt-key-identifier ATTRIBUTE ::= {\n  TYPE          ContentDecryptKeyID\n  IDENTIFIED BY id-aa-KP-contentDecryptKeyID }",
      "raw": true
    },
    {
      "indent": 6,
      "text": "id-aa-KP-contentDecryptKeyID OBJECT IDENTIFIER ::= {\n  joint-iso-itu-t(2) country(16) us(840) organization(1) gov(101)\n  dod(2) infosec(1) attributes(5) 66 }",
      "raw": true
    },
    {
      "indent": 6,
      "text": "ContentDecryptKeyID ::= OCTET STRING",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The content decryption key identifier contains an OCTET STRING, and this syntax does not impose any particular structure on the identifier value.",
      "ja": "コンテンツ復号鍵識別子はオクテット文字列が含まれており、この構文は識別子の値に任意の特定の構造を課しません。"
    },
    {
      "indent": 3,
      "text": "Due to multiple layers of encryption, the content-decryption-key-identifier attribute can appear in more than one location in the overall key package. When there are multiple occurrences of the content-decryption-key-identifier attribute, each occurrence is evaluated independently. Each one is used to identify the needed keying material for that layer of encryption.",
      "ja": "暗号化の複数の層に、コンテンツ復号鍵識別子属性は、キー全体のパッケージ内に複数のフォルダに表示することができます。コンテンツ復号鍵識別子属性が複数ある場合、各出現は、独立して評価されます。一人一人が、暗号化の層のために必要な鍵材料を識別するために使用されます。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "Implementers of this protocol are strongly encouraged to consider generally accepted principles of secure key management when integrating this capability within an overall security architecture.",
      "ja": "このプロトコルの実装者が強く全体的なセキュリティアーキテクチャ内でこの機能を統合する際、安全な鍵管理の一般的に受け入れられた原則を考慮することが奨励されています。"
    },
    {
      "indent": 3,
      "text": "The security considerations from [RFC5083], [RFC5652], [RFC5911], [RFC5912], [RFC5958], and [RFC6031] apply. If the CCC extension is used as an authorization mechanism, then the security considerations from [RFC6010] also apply.",
      "ja": "[RFC5083]、[RFC5652]、[RFC5911]、[RFC5912]、[RFC5958]、および[RFC6031]からのセキュリティの考慮事項が適用されます。 CCC拡張子が認証メカニズムとして使用されている場合は、[RFC6010]からのセキュリティの考慮事項も適用されます。"
    },
    {
      "indent": 3,
      "text": "The encrypted key package content type might not provide proof of origin if the content encryption algorithm does not support authenticated key exchange. To provide proof of origin for this content, another security protocol needs to be used. This is the reason that support for encapsulating the SymmetricKeyPackage and AsymmetricKeyPackage with a SignedData content type from [RFC5652] is required for the EnvelopedData and EncryptedData choices.",
      "ja": "コンテンツの暗号化アルゴリズムは、認証済みキー交換をサポートしていない場合、暗号化キーパッケージのコンテンツタイプは、起源の証拠を提供しない場合があります。このコンテンツのための起源の証拠を提供するために、別のセキュリティプロトコルを使用する必要があります。これは[RFC5652] EnvelopedDataのとはEncryptedData選択肢のために必要とされるからのSignedDataコンテンツタイプとSymmetricKeyPackageとAsymmetricKeyPackageをカプセル化するためのサポートの理由です。"
    },
    {
      "indent": 3,
      "text": "When this content type is used the CMS SignedData [RFC5652] validation rules MUST be used. The PKCS #7 [RFC2315] validation rules MUST NOT be used.",
      "ja": "このコンテンツタイプを使用する場合CMSのSignedData [RFC5652]検証ルールを使用しなければなりません。 PKCS＃7 [RFC2315]検証ルールを使用してはいけません。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "ja": "5. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document makes use of object identifiers to identify a CMS content type, a CMS attribute, and the ASN.1 module; all found in Appendix A. All OIDs are registered in an arc delegated by RSADSI to the SMIME Working Group.",
      "ja": "この文書では、CMSコンテンツタイプ、CMS属性、およびASN.1モジュールを識別するためのオブジェクト識別子を使用しています。すべての付録Aで見つかったすべてのOIDはSMIMEワーキンググループにRSADSIによって委任アークに登録されています。"
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "ja": "6.参照"
    },
    {
      "indent": 0,
      "text": "6.1. Normative References",
      "section_title": true,
      "ja": "6.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC5083] Housley, R., \"Cryptographic Message Syntax (CMS) Authenticated-Enveloped-Data Content Type\", RFC 5083, November 2007.",
      "ja": "[RFC5083] Housley氏、R.、 \"暗号メッセージ構文（CMS）認証エンベロープ・データコンテンツの種類\"、RFC 5083、2007年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC5280] Cooper, D., Santesson, S., Farrell, S., Boeyen, S., Housley, R., and W. Polk, \"Internet X.509 Public Key Infrastructure Certificate and Certificate Revocation List (CRL) Profile\", RFC 5280, May 2008.",
      "ja": "[RFC5280]クーパー、D.、Santesson、S.、ファレル、S.、Boeyen、S.、Housley氏、R.、およびW.ポーク、「インターネットX.509公開鍵暗号基盤証明書と証明書失効リスト（CRL）のプロフィール」、RFC 5280、2008年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC5652] Housley, R., \"Cryptographic Message Syntax (CMS)\", STD 70, RFC 5652, September 2009.",
      "ja": "[RFC5652] Housley氏、R.、 \"暗号メッセージ構文（CMS）\"、STD 70、RFC 5652、2009年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC5911] Hoffman, P. and J. Schaad, \"New ASN.1 Modules for Cryptographic Message Syntax (CMS) and S/MIME\", RFC 5911, June 2010.",
      "ja": "[RFC5911]ホフマン、P.及びJ. Schaad、 \"暗号メッセージ構文（CMS）とS / MIMEのための新しいASN.1モジュール\"、RFC 5911、2010年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC5912] Hoffman, P. and J. Schaad, \"New ASN.1 Modules for the Public Key Infrastructure Using X.509 (PKIX)\", RFC 5912, June 2010.",
      "ja": "[RFC5912]ホフマン、P.およびJ. Schaad、RFC 5912、2010年6月 \"公開鍵インフラストラクチャの使用X.509（PKIX）のための新しいASN.1モジュール\"。"
    },
    {
      "indent": 3,
      "text": "[RFC5958] Turner, S., \"Asymmetric Key Packages\", RFC 5958, August 2010.",
      "ja": "[RFC5958]ターナー、S.、 \"非対称鍵パッケージ\"、RFC 5958、2010年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC6010] Housley, R., Ashmore, S., and C. Wallace, \"Cryptographic Message Syntax (CMS) Content Constraints Extension\", RFC 6010, September 2010.",
      "ja": "[RFC6010] Housley氏、R.、モア、S.、およびC.ウォレス、 \"暗号メッセージ構文（CMS）コンテンツ制約拡張\"、RFC 6010、2010年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC6031] Turner, S. and R. Housley, \"Cryptographic Message Syntax (CMS) Symmetric Key Package Content Type\", RFC 6031, December 2010.",
      "ja": "[RFC6031]ターナー、S.とR. Housley氏、 \"暗号メッセージ構文（CMS）対称鍵パッケージのコンテンツタイプ\"、RFC 6031、2010年12月。"
    },
    {
      "indent": 3,
      "text": "[X.680] ITU-T Recommendation X.680 (2002) | ISO/IEC 8824-1:2002. Information Technology - Abstract Syntax Notation One.",
      "ja": "[X.680] ITU-T勧告X.680（2002）| ISO / IEC 8824から1：2002。情報技術 - 抽象構文記法1。"
    },
    {
      "indent": 3,
      "text": "[X.681] ITU-T Recommendation X.681 (2002) | ISO/IEC 8824-2:2002. Information Technology - Abstract Syntax Notation One: Information Object Specification.",
      "ja": "[X.681] ITU-T勧告X.681（2002）| ISO / IEC 8824から2：2002。情報技術 - 抽象構文記法1：情報オブジェクトの仕様。"
    },
    {
      "indent": 3,
      "text": "[X.682] ITU-T Recommendation X.682 (2002) | ISO/IEC 8824-3:2002. Information Technology - Abstract Syntax Notation One: Constraint Specification.",
      "ja": "[X.682] ITU-T勧告X.682（2002）| ISO / IEC 8824から3：2002。情報技術 - 抽象構文記法1：制約の仕様。"
    },
    {
      "indent": 3,
      "text": "[X.683] ITU-T Recommendation X.683 (2002) | ISO/IEC 8824-4:2002. Information Technology - Abstract Syntax Notation One: Parameterization of ASN.1 Specifications.",
      "ja": "[X.683] ITU-T勧告X.683（2002）| ISO / IEC 8824から4：2002。情報技術 - 抽象構文記法1：ASN.1仕様のパラメータ化。"
    },
    {
      "indent": 0,
      "text": "6.2. Informative References",
      "section_title": true,
      "ja": "6.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC2315] Kaliski, B., \"PKCS #7: Cryptographic Message Syntax Version 1.5\", RFC 2315, March 1998.",
      "ja": "[RFC2315] Kaliski、B.、 \"PKCS＃7：暗号メッセージ構文バージョン1.5\"、RFC 2315、1998年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3274] Gutmann, P., \"Compressed Data Content Type for Cryptographic Message Syntax (CMS)\", RFC 3274, June 2002.",
      "ja": "[RFC3274] Gutmann氏、P.、 \"暗号メッセージ構文（CMS）のための圧縮されたデータcontent type\"、RFC 3274、2002年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC4073] Housley, R., \"Protecting Multiple Contents with the Cryptographic Message Syntax (CMS)\", RFC 4073, May 2005.",
      "ja": "[RFC4073] Housley氏、R.、 \"暗号メッセージ構文（CMS）で複数のコンテンツを保護する\"、RFC 4073、2005年5月。"
    },
    {
      "indent": 0,
      "text": "Appendix A. ASN.1 Module",
      "ja": "付録A. ASN.1モジュール"
    },
    {
      "indent": 3,
      "text": "This appendix provides the normative ASN.1 [X.680] definitions for the structures described in this specification using ASN.1, as defined in [X.680] through [X.683].",
      "ja": "[X.683]を通して[X.680]で定義されるように、この付録では、ASN.1を使用して本明細書に記載した構成のための規範的ASN.1 [X.680]の定義を提供します。"
    },
    {
      "indent": 3,
      "text": "EncryptedKeyPackageModuleV1 { iso(1) member-body(2) us(840) rsadsi(113549) pkcs(1) pkcs-9(9) smime(16) modules(0) id-mod-encryptedKeyPkgV1(51) }",
      "ja": "EncryptedKeyPackageModuleV1 {ISO（1）部材本体（2）米国（840）RSADSI（113549）PKCS（1）PKCS-9（9）SMIME（16）モジュール（0）ID-MOD-encryptedKeyPkgV1（51）}"
    },
    {
      "indent": 3,
      "text": "DEFINITIONS IMPLICIT TAGS ::=",
      "raw": true
    },
    {
      "indent": 3,
      "text": "BEGIN",
      "ja": "ベギン"
    },
    {
      "indent": 3,
      "text": "-- EXPORTS ALL --",
      "ja": " - すべてのエクスポート - "
    },
    {
      "indent": 3,
      "text": "IMPORTS",
      "ja": "輸入"
    },
    {
      "indent": 3,
      "text": "-- From New SMIME ASN.1 [RFC5911]",
      "ja": " - から新規SMIME ASN.1 [RFC5911]"
    },
    {
      "indent": 3,
      "text": "EncryptedData, EnvelopedData, CONTENT-TYPE FROM CryptographicMessageSyntax-2009 { iso(1) member-body(2) us(840) rsadsi(113549) pkcs(1) pkcs-9(9) smime(16) modules(0) cms-2004-02(41) }",
      "ja": "EncryptedData、EnvelopedDataの、暗号メッセージ構文-2009 {ISO（1）メンバー本体からコンテンツ・タイプ（2）米国（840）RSADSI（113549）PKCS（1）PKCS-9（9）SMIME（16）モジュール（0）CMS- 2004-02（41）}"
    },
    {
      "indent": 3,
      "text": "-- From New SMIME ASN.1 [RFC5911]",
      "ja": " - から新規SMIME ASN.1 [RFC5911]"
    },
    {
      "indent": 3,
      "text": "AuthEnvelopedData FROM CMS-AuthEnvelopedData-2009 { iso(1) member-body(2) us(840) rsadsi(113549) pkcs(1) pkcs-9(9) smime(16) modules(0) cms-authEnvelopedData-02(43) }",
      "ja": "CMS-AuthEnvelopedData-2009 FROM AuthEnvelopedData {ISO（1）部材本体（2）米国（840）RSADSI（113549）PKCS（1）PKCS-9（9）SMIME（16）モジュール（0）CMS-authEnvelopedData-02（ 43）}"
    },
    {
      "indent": 3,
      "text": "-- From New PKIX ASN.1 [RFC5912]",
      "ja": " - から新規PKIX ASN.1 [RFC5912]"
    },
    {
      "indent": 3,
      "text": "ATTRIBUTE FROM PKIX-CommonTypes-2009 { iso(1) identified-organization(3) dod(6) internet(1) security(5) mechanisms(5) pkix(7) id-mod(0) id-mod-pkixCommon-02(57) }",
      "ja": "PKIX-CommonTypes-2009から属性{ISO（1）同定された組織（3）DOD（6）インターネット（1）セキュリティ（5）メカニズム（5）PKIX（7）ID-MOD（0）ID-MOD-pkixCommon- 02（57）}"
    },
    {
      "indent": 3,
      "text": ";",
      "ja": "；"
    },
    {
      "indent": 3,
      "text": "ContentSet CONTENT-TYPE ::= {\n  ct-encrypted-key-package,\n  ... -- Expect additional content types --\n} ct-encrypted-key-package CONTENT-TYPE ::=\n    { TYPE EncryptedKeyPackage\n      IDENTIFIED BY id-ct-KP-encryptedKeyPkg }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "id-ct-KP-encryptedKeyPkg OBJECT IDENTIFIER ::=\n  { joint-iso-itu-t(2) country(16) us(840) organization(1) gov(101)\n    dod(2) infosec(1) formats(2) key-package-content-types(78) 2 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "EncryptedKeyPackage ::= CHOICE {\n    encrypted        EncryptedData,\n    enveloped        [0] EnvelopedData,\n    authEnveloped    [1] AuthEnvelopedData }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "aa-content-decrypt-key-identifier ATTRIBUTE ::= {\n    TYPE          ContentDecryptKeyID\n    IDENTIFIED BY id-aa-KP-contentDecryptKeyID }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "id-aa-KP-contentDecryptKeyID OBJECT IDENTIFIER ::= {\n  joint-iso-itu-t(2) country(16) us(840) organization(1) gov(101)\n  dod(2) infosec(1) attributes(5) 66 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "ContentDecryptKeyID ::= OCTET STRING",
      "raw": true
    },
    {
      "indent": 3,
      "text": "END",
      "ja": "終わり"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Sean Turner IECA, Inc. 3057 Nutley Street, Suite 106 Fairfax, VA 22031 USA",
      "ja": "ショーン・ターナーIECA株式会社3057ナトリーストリート、スイート106バージニア州フェアファクス22031 USA"
    },
    {
      "indent": 3,
      "text": "EMail: turners@ieca.com",
      "ja": "メールアドレス：turners@ieca.com"
    },
    {
      "indent": 3,
      "text": "Russell Housley Vigil Security, LLC 918 Spring Knoll Drive Herndon, VA 20170 USA",
      "ja": "ラッセルHousley氏ビジルセキュリティ、LLC 918春小山Driveハーンドン、VA 20170 USA"
    },
    {
      "indent": 3,
      "text": "EMail: housley@vigilsec.com",
      "ja": "メールアドレス：housley@vigilsec.com"
    }
  ]
}