{
  "title": {
    "text": "RFC 6562 - Guidelines for the Use of Variable Bit Rate Audio with Secure RTP",
    "ja": "RFC 6562 - セキュアRTPと可変ビットレート・オーディオの使用のためのガイドライン"
  },
  "number": 6562,
  "created_at": "2019-10-27 19:47:26.701321+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                        C. Perkins\nRequest for Comments: 6562                         University of Glasgow\nCategory: Standards Track                                      JM. Valin\nISSN: 2070-1721                                      Mozilla Corporation\n                                                              March 2012",
      "raw": true
    },
    {
      "indent": 16,
      "text": "       Guidelines for the Use of\nVariable Bit Rate Audio with Secure RTP",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This memo discusses potential security issues that arise when using variable bit rate (VBR) audio with the secure RTP profile. Guidelines to mitigate these issues are suggested.",
      "ja": "このメモは、安全なRTPプロファイルを持つ可変ビットレート（VBR）オーディオを使用する場合に生じる潜在的なセキュリティ問題について説明します。これらの問題を軽減するためのガイドラインが提案されています。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6562.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6562で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2012 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2012 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction ...................................................2\n2.  Scenario-Dependent Risk ........................................2\n3.  Guidelines for Use of VBR Audio with SRTP ......................3\n4.  Guidelines for Use of Voice Activity Detection with SRTP .......3\n5.  Padding the Output of VBR Codecs ...............................4\n6.  Security Considerations ........................................5\n7.  Acknowledgements ...............................................5\n8.  References .....................................................5\n    8.1. Normative References ......................................5\n    8.2. Informative References ....................................6",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The Secure RTP (SRTP) framework [RFC3711] is a widely used framework for securing RTP sessions [RFC3550]. SRTP provides the ability to encrypt the payload of an RTP packet, and optionally add an authentication tag, while leaving the RTP header and any header extension in the clear. A range of encryption transforms can be used with SRTP, but none of the predefined encryption transforms use any padding; the RTP and SRTP payload sizes match exactly.",
      "ja": "セキュアRTP（SRTP）フレームワーク[RFC3711]はRTPセッション[RFC3550]を確保するために広く使用されるフレームワークです。 RTPヘッダ及びクリアの任意のヘッダ拡張を残しSRTPは、RTPパケットのペイロードを暗号化し、そして必要に応じて認証タグを追加する能力を提供します。暗号化変換の範囲は、SRTPで使用することができるが、事前に定義された暗号化のいずれも、任意のパディングを使用して変換しません。 RTPおよびSRTPペイロードサイズが正確に一致します。"
    },
    {
      "indent": 3,
      "text": "When using SRTP with voice streams compressed using variable bit rate (VBR) codecs, the length of the compressed packets will depend on the characteristics of the speech signal. This variation in packet size will leak a small amount of information about the contents of the speech signal. This is potentially a security risk for some applications. For example, [spot-me] shows that known phrases in an encrypted call using the Speex codec in VBR mode can be recognized with high accuracy in certain circumstances, and [fon-iks] shows that approximate transcripts of encrypted VBR calls can be derived for some codecs without breaking the encryption. How significant these results are, and how they generalize to other codecs, is still an open question. This memo discusses ways in which such traffic analysis risks may be mitigated.",
      "ja": "可変ビットレート（VBR）コーデックを使用して圧縮音声ストリームとSRTPを使用する場合、圧縮されたパケットの長さは、音声信号の特性に依存するであろう。パケットサイズのこの変化は、音声信号の内容に関する情報の少量の漏れであろう。これは、潜在的にいくつかのアプリケーションのためのセキュリティ上のリスクです。例えば、[スポット-ME]はVBRモードでSpeexコーデックを使用して暗号化されたコールで既知のフレーズが特定の状況では高精度に認識することができることを示し、そして[FON-IKS]暗号化されたVBRコールのおおよその転写を誘導することができることを示しています暗号化を壊すことなく、いくつかのコーデック。どのように重要なこれらの結果は、どのように彼らは他のコーデックに一般、まだ未解決の問題です。このメモは、このようなトラフィック分析、リスクを軽減することができる方法について説明します。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "ja": "この文書のキーワード \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", および \"OPTIONAL\" はRFC 2119 [RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. Scenario-Dependent Risk",
      "section_title": true,
      "ja": "2.シナリオ依存のリスク"
    },
    {
      "indent": 3,
      "text": "Whether the information leaks and attacks discussed in [spot-me], [fon-iks], and similar works are significant is highly dependent on the application and use scenario. In the worst case, using the rate information to recognize a prerecorded message knowing the set of all possible messages would lead to near-perfect accuracy. Even when the audio is not prerecorded, there is a real possibility of being able to recognize contents from encrypted audio when the dialog is highly structured (e.g., when the eavesdropper knows that only a handful of possible sentences are possible), and thus contain only little information. Recognizing unconstrained conversational speech from the rate information alone is unreliable and computationally expensive at present, but does appear possible in some circumstances. These attacks are only likely to improve over time.",
      "ja": "で議論、情報漏洩や攻撃が[スポット-ME]、[FON-IKS]、および同様の作品が重要であるかどうかは、アプリケーションに大きく依存しているとのシナリオを使用しています。最悪の場合には、すべての可能なメッセージのセットを知って事前に録音されたメッセージを認識するためにレート情報を使用すると、ほぼ完璧な精度をもたらすことになります。音声が予め記録されていない場合でも、ダイアログが高度に構造化されたときに暗号化されたオーディオからの内容を認識することができるという現実的な可能性があるため、のみ含まれている（例えば、盗聴者は、可能な文章のほんの一握りが可能であることを知っているとき）ほとんど情報。単独のレート情報から、制約のない会話音声を認識することが信頼できないと現在では計算上高価であるが、いくつかの状況で可能に表示されません。これらの攻撃は、時間の経過とともに改善する唯一の可能性があります。"
    },
    {
      "indent": 3,
      "text": "In practical SRTP scenarios, how significant the information leak is when compared to other SRTP-related information must be considered, such as the fact that the source and destination IP addresses are available.",
      "ja": "このような送信元および宛先IPアドレスが利用可能であることを事実として、考慮しなければならない他のSRTP関連情報と比較した場合、実用的なSRTPシナリオでは、情報漏洩がどのように重要です。"
    },
    {
      "indent": 0,
      "text": "3. Guidelines for Use of VBR Audio with SRTP",
      "section_title": true,
      "ja": "SRTPとVBRオーディオの使用のためのガイドライン3。"
    },
    {
      "indent": 3,
      "text": "It is the responsibility of the application designer to determine the appropriate trade-off between security and bandwidth overhead. As a general rule, VBR codecs should be considered safe in the context of low-value encrypted unstructured calls. However, applications that make use of prerecorded messages where the contents of such prerecorded messages may be of any value to an eavesdropper (i.e., messages beyond standard greeting messages) SHOULD NOT use codecs in VBR mode. Interactive voice response (IVR) applications would be particularly vulnerable since an eavesdropper could easily use the rate information to recognize the prompts being played out. Applications conveying highly sensitive unstructured information SHOULD NOT use codecs in VBR mode.",
      "ja": "セキュリティと帯域幅のオーバーヘッドの間の適切なトレードオフを決定するためにアプリケーション設計者の責任です。一般的なルールとして、VBRコーデックは低値暗号化された非構造化の呼び出しのコンテキスト内で安全に考慮されるべきです。しかしながら、そのような事前に録音されたメッセージの内容を盗聴者に任意の値であってもよい事前に録音されたメッセージを利用するアプリケーション（すなわち、標準的な挨拶メッセージを超えメッセージ）VBRモードでコーデックを使用しないでください。盗聴者は、容易に再生されるプロンプトを認識するレート情報を使用することができるので、対話型音声応答（IVR）アプリケーションは、特に脆弱であろう。機密性の高い非構造化情報を伝達するアプリケーションは、VBRモードでコーデックを使用しないでください。"
    },
    {
      "indent": 3,
      "text": "It is safe to use variable rate coding to adapt the output of a voice codec to match characteristics of a network channel, provided this adaptation is done in a way that does not expose any information on the speech signal. For example, VBR audio can be used for congestion control purposes, where the variation is driven by the available network bandwidth, not by the input speech (i.e., the packet sizes and spacing are constant unless the network conditions change). VBR speech codecs can safely be used in this fashion with SRTP while avoiding leaking information on the contents of the speech signal that might be useful for traffic analysis.",
      "ja": "この適応は、音声信号上の任意の情報を公開しない方法で行われて、ネットワークチャネルの特性に合わせて音声コーデックの出力を適応させるために、可変レート符号化を使用しても安全です。たとえば、VBRオーディオは変化がない入力音声により、利用可能なネットワーク帯域幅によって駆動される輻輳制御の目的に使用することができる（ネットワークの状態が変化しない限り、すなわち、パケットサイズ及び間隔は一定です）。トラフィックの分析に有用であるかもしれない音声信号の内容に漏れた情報を回避しながら、VBRの音声コーデックは、安全にSRTPをこのように使用することができます。"
    },
    {
      "indent": 0,
      "text": "4. Guidelines for Use of Voice Activity Detection with SRTP",
      "section_title": true,
      "ja": "SRTPと音声アクティビティ検出の使用のためのガイドライン4。"
    },
    {
      "indent": 3,
      "text": "Many speech codecs employ some form of voice activity detection (VAD) to either suppress output frames, or generate some form of lower-rate comfort noise frames, during periods when the speaker is not active. If VAD is used on an encrypted speech signal, then some information about the characteristics of that speech signal can be determined by watching the patterns of voice activity. This information leakage is less than with VBR coding since there are only two rates possible.",
      "ja": "多くの音声コーデックは、出力フレームを抑制する、または低レート快適雑音フレームのいくつかのフォームを生成し、スピーカがアクティブでない期間中にするか音声アクティビティ検出（VAD）のいくつかのフォームを使用します。 VADは、暗号化された音声信号に使用されている場合は、その音声信号の特性に関するいくつかの情報は、音声活動のパターンを見て判断することができます。可能な唯一の2つのレートがあるので、この情報漏洩がVBRコーディングよりも小さいです。"
    },
    {
      "indent": 3,
      "text": "The information leakage due to VAD in SRTP audio sessions can be much reduced if the sender adds an unpredictable \"overhang\" period to the end of active speech intervals, obscuring their actual length. An RTP sender using VAD with encrypted SRTP audio SHOULD insert such an overhang period at the end of each talkspurt, delaying the start of the silence/comfort noise by a random interval. The length of the overhang applied to each talkspurt must be randomly chosen in such a way that it is computationally infeasible for an attacker to reliably estimate the length of that talkspurt. This may be more important for short talkspurts, since it seems easier to distinguish between different single word responses based on the exact word length, than to glean meaning from the duration of a longer phrase. The audio data comprising the overhang period must be packetized and transmitted in RTP packets in a manner that is indistinguishable from the other data in the talkspurt.",
      "ja": "送信者が自分の実際の長さを不明瞭に、アクティブな音声区間の終わりに予測できない「オーバーハング」期間を追加する場合SRTPオーディオセッションで原因VADへの情報漏洩を大幅に低減することができます。暗号化されたSRTPオーディオとVADを使用してRTP送信機は、ランダムな間隔で無音/コンフォートノイズの開始を遅らせる、各有音部の末尾に、このようなオーバーハング期間を挿入する必要があります。各有音部に適用されるオーバーハングの長さは、ランダムに攻撃者が確実にその有音部の長さを推定することが計算上実行不可能であるように選択されなければなりません。長いフレーズの期間から意味を収集することよりも、正確なワード長に基づいて、異なる単一ワードの応答を区別しやすいようですので、これは、短い有音部のために、より重要であるかもしれません。オーバーハングの期間を含む音声データをパケット化し、有音部内の他のデータと区別できないようにしてRTPパケットで送信されなければなりません。"
    },
    {
      "indent": 3,
      "text": "The overhang period SHOULD have an exponentially decreasing probability distribution function. This ensures a long tail, while being easy to compute. It is RECOMMENDED to use an overhang with a \"half life\" of a few hundred milliseconds (this should be sufficient to obscure the presence of interword pauses and the lengths of single words spoken in isolation, for example, the digits of a credit card number clearly enunciated for an automated system, but not so long as to significantly reduce the effectiveness of VAD for detecting listening pauses). Despite the overhang (and no matter what the duration is), there is still a small amount of information leaked about the start time of the talkspurt due to the fact that we cannot apply an overhang to the start of a talkspurt without unacceptably affecting intelligibility. For that reason, VAD SHOULD NOT be used in encrypted IVR applications where the content of prerecorded messages may be of any value to an eavesdropper.",
      "ja": "オーバーハング期間は指数関数的に減少する確率分布関数を有しているべきです。これは、計算が簡単でありながら、ロングテールを保証します。それは、数百ミリ秒の「半減期」とのオーバーハングを使用することをお勧めします（これは、例えば単語間のポーズの存在と孤立して話さ単一の単語の長さを、不明瞭するのに十分であるべきで、クレジットカード番号の桁数明確に自動化されたシステムのための言明ではなく、限りかなりリスニングポーズを検出するためのVADの有効性を低減します）。オーバーハング（と期間が何であるかに関係なく）にもかかわらず、原因我々は容認できないほど明瞭度に影響を与えずに、有音部の先頭にオーバーハングを適用することができないという事実に、まだ有音部の開始時間について漏れた少量の情報があります。そのため、VADは、事前に録音されたメッセージの内容が盗聴者に任意の値とすることができる暗号化されたIVRアプリケーションでは使用しないでください。"
    },
    {
      "indent": 3,
      "text": "The application of a random overhang period to each talkspurt will reduce the effectiveness of VAD in SRTP sessions when compared to non-SRTP sessions. However, it is still expected that the use of VAD will provide significant bandwidth savings for many encrypted sessions.",
      "ja": "非SRTPセッションと比較すると、各有音部へのランダムオーバーハングの期間の適用は、SRTPセッションでVADの有効性が低下します。しかし、まだVADの使用は、多くの暗号化されたセッションのためにかなりの帯域幅の節約を提供することが期待されます。"
    },
    {
      "indent": 0,
      "text": "5. Padding the Output of VBR Codecs",
      "section_title": true,
      "ja": "5. VBRコーデックの出力をパディング"
    },
    {
      "indent": 3,
      "text": "For scenarios where VBR is considered unsafe, a constant bit rate (CBR) codec SHOULD be negotiated and used instead, or the VBR codec SHOULD be operated in a CBR mode. However, if the codec does not support CBR, RTP padding SHOULD be used to reduce the information leak to an insignificant level. Packets may be padded to a constant size or to a small range of sizes ([spot-me] achieves good results by padding to the next multiple of 16 octets, but the amount of padding needed to hide the variation in packet size will depend on the codec and the sophistication of the attacker) or may be padded to a size that varies with time. The most secure and RECOMMENDED option is to pad all packets throughout the call to the same size.",
      "ja": "VBRが安全でないと考えられるシナリオでは、固定ビットレート（CBR）コーデックをネゴシエートし、代わりに、またはVBRコーデックは、CBRモードで動作させる必要がされるべきです。コーデックは、CBRをサポートしていない場合は、RTPパディングは微々たる水準に情報漏洩を減らすために使用されるべきです。パケットは、[スポット私を] 16オクテットの倍数にパディングにより良い結果を達成しますが、パケットサイズの変動を隠すために必要なパディングの量が依存します一定の大きさや大きさ（の小さな範囲にパディングすることができますコーデック攻撃者の洗練）又は時間と共に変化するサイズにパディングされてもよいです。最も安全で推奨されるオプションは、パッドに同じサイズの呼び出しを通して、すべてのパケットです。"
    },
    {
      "indent": 3,
      "text": "In the case where the size of the padded packets varies in time, the same concerns as for VAD apply. That is, the padding SHOULD NOT be reduced without waiting for a certain (random) time. The RECOMMENDED \"hold time\" is the same as the one for VAD.",
      "ja": "パディングされたパケットの大きさが時間的に変化する場合には、VADと同じ懸念が当てはまります。これは、パディングは、特定の（ランダム）の時間を待たずに削減されるべきではありません。推奨「ホールド時間」はVADのためのものと同じです。"
    },
    {
      "indent": 3,
      "text": "Note that SRTP encrypts the count of the number of octets of padding added to a packet, but not the bit in the RTP header that indicates that the packet has been padded. For this reason, it is RECOMMENDED to add at least one octet of padding to all packets in a media stream, so an attacker cannot tell which packets needed padding.",
      "ja": "そのSRTPパケットに追加のパディングオクテットの数のカウントではなく、パケットがパディングされたことを示すRTPヘッダ内のビットを暗号化注意。このため、メディアストリーム内のすべてのパケットにパディングの少なくとも1つのオクテットを追加することをお勧めしますので、攻撃者は、必要に応じてパディングをどのパケット伝えることはできません。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "This entire memo is about security. The security considerations of [RFC3711] also apply.",
      "ja": "この全体のメモは、セキュリティに関するものです。 [RFC3711]のセキュリティ上の考慮事項も適用されます。"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgements",
      "section_title": true,
      "ja": "7.謝辞"
    },
    {
      "indent": 3,
      "text": "ZRTP [RFC6189] contains similar recommendations; the purpose of this memo is to highlight these issues to a wider audience, since they are not specific to ZRTP. Thanks are due to Phil Zimmermann, Stefan Doehla, Mats Naslund, Gregory Maxwell, David McGrew, Mark Baugher, Koen Vos, Ingemar Johansson, and Stephen Farrell for their comments and feedback on this memo.",
      "ja": "ZRTP [RFC6189]は同様の勧告を含み、彼らはZRTPに固有のものではありませんので、このメモの目的は、より広い聴衆に、これらの問題を強調することです。おかげで、このメモの彼らのコメントやフィードバックのためのフィル・ジマーマン、ステファンDoehla、マッツ・ナズランド、グレゴリー・マックスウェル、デビッドマグリュー、マーク・Baugher、公園ヴォス、インゲマル・ヨハンソン、そしてステファン・ファレルによるものです。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8.参照文献"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "ja": "8.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3550] Schulzrinne, H., Casner, S., Frederick, R., and V. Jacobson, \"RTP: A Transport Protocol for Real-Time Applications\", STD 64, RFC 3550, July 2003.",
      "ja": "[RFC3550] Schulzrinneと、H.、Casner、S.、フレデリック、R.、およびV.ヤコブソン、 \"RTP：リアルタイムアプリケーションのためのトランスポートプロトコル\"、STD 64、RFC 3550、2003年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC3711] Baugher, M., McGrew, D., Naslund, M., Carrara, E., and K. Norrman, \"The Secure Real-time Transport Protocol (SRTP)\", RFC 3711, March 2004.",
      "ja": "[RFC3711] Baugher、M.、マグリュー、D.、Naslund、M.、カララ、E.、およびK. Norrman、 \"セキュアリアルタイム転送プロトコル（SRTP）\"、RFC 3711、2004年3月。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "ja": "8.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC6189] Zimmermann, P., Johnston, A., and J. Callas, \"ZRTP: Media Path Key Agreement for Unicast Secure RTP\", RFC 6189, April 2011.",
      "ja": "[RFC6189]ツィンマーマン、P.、ジョンストン、A.、およびJ.カラス、 \"ZRTP：ユニキャストセキュアRTPのためのメディアパス鍵合意\"、RFC 6189、2011年4月。"
    },
    {
      "indent": 3,
      "text": "[fon-iks] White, A., Matthews, A., Snow, K., and F. Monrose, \"Phonotactic Reconstruction of Encrypted VoIP Conversations: Hookt on fon-iks\", Proceedings of the IEEE Symposium on Security and Privacy 2011, May 2011.",
      "ja": "[FON-IKS]ホワイト、A.、マシューズ、A.、雪、K.、およびF. Monrose、：セキュリティとプライバシー2011 IEEEシンポジウム、 \"暗号化されたVoIP通話の音素配列論復興FON-IKSにHookt\" 、2011年5月。"
    },
    {
      "indent": 3,
      "text": "[spot-me] Wright, C., Ballard, L., Coull, S., Monrose, F., and G. Masson, \"Spot me if you can: Uncovering spoken phrases in encrypted VoIP conversation\", Proceedings of the IEEE Symposium on Security and Privacy 2008, May 2008.",
      "ja": "[スポット-ME]ライト、C.、バラード、L.、Coull、S.、Monrose、F.、およびG.マッソン、 \"あなたができるなら、私のスポット：暗号化されたVoIP会話の中で話されたフレーズを暴く\"、IEEEの議事録セキュリティとプライバシー2008シンポジウム、2008年5月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Colin Perkins University of Glasgow School of Computing Science Glasgow G12 8QQ UK",
      "ja": "コンピューティング科学グラスゴーG12 8QQ英国のグラスゴー大学のコリン・パーキンス大学"
    },
    {
      "indent": 3,
      "text": "EMail: csp@csperkins.org",
      "ja": "メールアドレス：csp@csperkins.org"
    },
    {
      "indent": 3,
      "text": "Jean-Marc Valin Mozilla Corporation 650 Castro Street Mountain View, CA 94041 USA",
      "ja": "ジャンマルクValinはMozillaの株式会社650カストロストリートマウンテンビュー、CA 94041 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 650 903-0800 EMail: jmvalin@jmvalin.ca",
      "ja": "電話：+1 650 903-0800 Eメール：jmvalin@jmvalin.ca"
    }
  ]
}