{
  "title": {
    "text": "RFC 6232 - Purge Originator Identification TLV for IS-IS",
    "ja": "RFC 6232 - IS-ISのためのパージオリジネーター識別TLV"
  },
  "number": 6232,
  "created_at": "2019-10-31 22:32:12.358357+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                            F. Wei\nRequest for Comments: 6232                                        Y. Qin\nUpdates: 5301, 5304, 5310                                          Z. Li\nCategory: Standards Track                                   China Mobile\nISSN: 2070-1721                                                    T. Li\n                                                     Cisco Systems, Inc.\n                                                                 J. Dong\n                                                     Huawei Technologies\n                                                                May 2011",
      "raw": true
    },
    {
      "indent": 13,
      "text": "Purge Originator Identification TLV for IS-IS",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "At present, an IS-IS purge does not contain any information identifying the Intermediate System (IS) that generates the purge. This makes it difficult to locate the source IS.",
      "ja": "現在では、IS-ISのパージは、パージを生成する中間システム（IS）を識別する情報を含んでいません。これは、それが困難なソースを検索することができます。"
    },
    {
      "indent": 3,
      "text": "To address this issue, this document defines a TLV to be added to purges to record the system ID of the IS generating it. Since normal Link State Protocol Data Unit (LSP) flooding does not change LSP contents, this TLV should propagate with the purge.",
      "ja": "この問題に対処するには、この文書には、それを生成しているのシステムIDを記録するためのパージに追加するTLVを定義します。通常のリンクステートプロトコルデータユニット（LSP）フラッディングがLSPの内容は変更されませんので、このTLVはパージを伝播する必要があります。"
    },
    {
      "indent": 3,
      "text": "This document updates RFC 5301, RFC 5304, and RFC 5310.",
      "ja": "このドキュメントの更新RFC 5301、RFC 5304、およびRFC 5310。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6232.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6232で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2011 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2011 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Requirements Language ...........................................3\n3. The Purge Originator Identification (POI) TLV ...................3\n4. Using the Dynamic Hostname TLV in Purges ........................3\n5. Security Considerations .........................................4\n6. IANA Considerations .............................................4\n7. Acknowledgments .................................................4\n8. Normative References ............................................4",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "The IS-IS [ISO-10589] routing protocol has been widely used in large-scale IP networks because of its strong scalability and fast convergence.",
      "ja": "IS-IS [ISO-10589]ルーティングプロトコルが広く、その強力なスケーラビリティと高速収束の大規模IPネットワークで使用されてきました。"
    },
    {
      "indent": 3,
      "text": "The IS-IS protocol floods purges throughout an area, regardless of which IS initiated the purge. If a network operator would like to investigate the cause of the purge, it is difficult to determine the origin of the purge. At present, the IS-IS protocol has no mechanism to locate the originator of a purge. To address this problem, this document defines a TLV to be added to purges to record the system ID of the IS generating the purge.",
      "ja": "IS-ISプロトコルは、そのパージを開始さにかかわらず、地域全体でパージをフラッディングします。ネットワークオペレータはパージの原因を調査したい場合、パージの起源を決定することは困難です。現時点では、IS-ISプロトコルは、パージの発信元を突き止めるための機構がありません。この問題に対処するために、このドキュメントは、パージを生成しているのシステムIDを記録するためのパージに追加するTLVを定義します。"
    },
    {
      "indent": 3,
      "text": "Field experience has shown several circumstances where an IS can improperly generate a purge. These are all due to implementation deficiencies or implementations that predate [ISO-TC1] and generate a purge when they receive a corrupted Link State Protocol Data Unit (LSP).",
      "ja": "フィールドでの経験は、ISが不適切パージを生成することができますいくつかの状況を示しています。これらはすべて、[ISO-TC1]をさかのぼる実装の不備や実装に起因していると、彼らが破損したリンクステートプロトコルデータユニット（LSP）を受信したときにパージを生成します。"
    },
    {
      "indent": 0,
      "text": "2. Requirements Language",
      "section_title": true,
      "ja": "2.必要な言語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "3. The Purge Originator Identification (POI) TLV",
      "section_title": true,
      "ja": "3.パージ発信識別（POI）TLV"
    },
    {
      "indent": 3,
      "text": "This document defines a TLV to be included in purges. If an IS generates a purge, it SHOULD include this TLV in the purge with its own system ID. If an IS receives a purge that does not include this TLV, then it SHOULD add this TLV with both its own system ID and the system ID of the IS from which it received the purge. This allows ISs receiving purges to log the system ID of the originator, or the upstream source of the purge. This makes it much easier for the network administrator to locate the origin of the purge and thus the cause of the purge. Similarly, this TLV is helpful to developers in lab situations.",
      "ja": "この文書では、パージに含まれるTLVを定義します。 ISは、パージを発生した場合、それは独自のシステムIDとパージでこのTLVを含むべきです。 ISはこのTLVが含まれていないパージを受信した場合、それは独自のシステムIDとそれがパージを受けているから、ISのシステムIDの両方でこのTLVを追加する必要があります。これは、ISSが発信元のシステムID、またはパージの上流のソースを記録するためにパージを受けることができます。これは、パージとパージのため、原因の起源を見つけるために、ネットワーク管理者のために、それははるかに容易になります。同様に、このTLVは、ラボの状況で開発者に便利です。"
    },
    {
      "indent": 3,
      "text": "The POI TLV is defined as:",
      "ja": "POI TLVは以下のように定義されています。"
    },
    {
      "indent": 6,
      "text": "CODE - 13",
      "ja": "CODE  -  13"
    },
    {
      "indent": 6,
      "text": "LENGTH - total length of the value field.",
      "ja": "長さ - 値フィールドの長さの合計。"
    },
    {
      "indent": 6,
      "text": "VALUE -",
      "ja": "VALUE  - "
    },
    {
      "indent": 9,
      "text": "Number of system IDs carried in this TLV (1 octet) -- only the values 1 and 2 are defined.",
      "ja": "このTLV（1オクテット）で運ばれるシステムIDの数 - 値のみ1と2が定義されています。"
    },
    {
      "indent": 9,
      "text": "System ID of the Intermediate System that inserted this TLV.",
      "ja": "このTLVを挿入中間システムのシステムID。"
    },
    {
      "indent": 9,
      "text": "System ID of the Intermediate System from which the purge was received (optional).",
      "ja": "パージが受信された中間体システムのシステムID（オプション）。"
    },
    {
      "indent": 3,
      "text": "The POI TLV SHOULD be found in all purges and MUST NOT be found in LSPs with a non-zero Remaining Lifetime.",
      "ja": "POI TLVはすべてパージで見つけるべきであり、非ゼロの残りの寿命とのLSPに記載されていてはなりません。"
    },
    {
      "indent": 0,
      "text": "4. Using the Dynamic Hostname TLV in Purges",
      "section_title": true,
      "ja": "4.パージでダイナミックホスト名TLVを使用して"
    },
    {
      "indent": 3,
      "text": "This document also extends the use of the Dynamic hostname TLV (type 137) [RFC5301] to further aid in the rapid identification of the system that generated the purge. This TLV MAY be included in purges. Implementations SHOULD include one instance of the Dynamic hostname TLV if the POI TLV is included. Only the local hostname should be inserted.",
      "ja": "この文書はまた、パージを生成したシステムの迅速な同定をさらに助けるために動的ホスト名TLV（タイプ137）[RFC5301]の使用を拡張します。このTLVは、パージに含まれるかもしれません。 POI TLVが含まれている場合、実装は、ダイナミックホスト名TLVの1つのインスタンスを含むべきです。唯一のローカルホスト名を挿入する必要があります。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "Use of the extensions defined here, with authentication as defined in [RFC5304] or [RFC5310], will result in the discarding of purges by legacy systems that are in strict conformance with either of those RFCs. This may compromise the correctness/consistency of the routing database unless all ISs in the network support these extensions. Therefore, all implementations in a domain implementing authentication MUST be upgraded to receive the POI TLV before any IS is allowed to generate a purge with the POI TLV.",
      "ja": "認証と、ここで定義されている拡張の使用、[RFC5304]か[RFC5310]で定義されるように、これらのRFCのいずれかに厳密に準拠しているレガシーシステムによって粛清の廃棄になります。ネットワーク内のすべてのISSは、これらの拡張機能をサポートしていない限り、これはルーティングデータベースの正当性/一貫性を損なうことがあります。そのため、認証を実行するドメイン内のすべての実装は任意のISは、POI TLVでパージを生成するために許可される前にPOI TLVを受け取るためにアップグレードする必要があります。"
    },
    {
      "indent": 3,
      "text": "More interactions between the POI TLV, the Dynamic hostname TLV, and the Authentication TLV are described in [RFC6233].",
      "ja": "POI TLV、ダイナミックホスト名TLV、及び認証TLVとの間のより相互作用は、[RFC6233]に記載されています。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has assigned code point 13 for the 'Purge Originator Identification' TLV from the IS-IS 'TLV Codepoints' registry. The additional values for this TLV should be IIH:n, LSP:y, SNP:n, and Purge:y.",
      "ja": "IANAは、IS-IS「TLVコードポイント」レジストリから「パージ発信元識別」TLVのコードポイント13に割り当てられています。 N、LSP：Y、SNP：N、及びパージ：YこのTLVのための追加の値は、IIHであるべきです。"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgments",
      "section_title": true,
      "ja": "7.謝辞"
    },
    {
      "indent": 3,
      "text": "Many thanks to Adrian Farrel and Daniel King for their comments to improve this document and move it forward.",
      "ja": "彼らのコメントのためのエードリアンファレルとダニエル・キングに感謝し、この文書を改善し、前方に移動します。"
    },
    {
      "indent": 3,
      "text": "The first version of this document was mainly composed by Lianyuan Li.",
      "ja": "このドキュメントの最初のバージョンは、主漣源リーで構成されていました。"
    },
    {
      "indent": 3,
      "text": "Acknowledgments are given to the discussion in the mailing list. Some improvements to this document are based on the discussion.",
      "ja": "謝辞は、メーリングリストでの議論に与えられています。このドキュメントのいくつかの改善が議論に基づいています。"
    },
    {
      "indent": 0,
      "text": "8. Normative References",
      "section_title": true,
      "ja": "8.引用規格"
    },
    {
      "indent": 3,
      "text": "[ISO-10589] ISO, \"Intermediate system to Intermediate system intra-domain routeing information exchange protocol for use in conjunction with the protocol for providing the connectionless-mode Network Service (ISO 8473)\", ISO/IEC 10589:2002.",
      "ja": "[ISO-10589] ISO、「（ISO 8473）コネクションレス型ネットワークサービスを提供するためのプロトコルと共に使用するための情報交換プロトコルをrouteingする中間システムイントラドメインに中間システム」、ISO / IEC 10589：2002。"
    },
    {
      "indent": 3,
      "text": "[ISO-TC1] ISO, \"Intermediate system to Intermediate system intra-domain routeing information exchange protocol for use in conjunction with the protocol for providing the connectionless-mode Network Service (ISO 8473) -- Technical Corrigendum 1\", ISO/IEC 10589:1992/ Cor.1:1993.",
      "ja": "[ISO-TC1] ISO、「コネクションレス型ネットワークサービス（ISO 8473）を提供するためのプロトコルと一緒に使用するための情報交換プロトコルをrouteingする中間システムイントラドメインに中間システム - 技術正誤表1」、ISO / IEC 10589 ：1992 / Cor.1：1993。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC5301] McPherson, D. and N. Shen, \"Dynamic Hostname Exchange Mechanism for IS-IS\", RFC 5301, October 2008.",
      "ja": "[RFC5301]マクファーソン、D.およびN.シェン、 \"IS-ISのための動的ホスト名交換メカニズム\"、RFC 5301、2008年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC5304] Li, T. and R. Atkinson, \"IS-IS Cryptographic Authentication\", RFC 5304, October 2008.",
      "ja": "[RFC5304]李、T.、およびR.アトキンソンは、 \"IS-IS暗号認証\"、RFC 5304、2008年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC5310] Bhatia, M., Manral, V., Li, T., Atkinson, R., White, R., and M. Fanto, \"IS-IS Generic Cryptographic Authentication\", RFC 5310, February 2009.",
      "ja": "[RFC5310]はバティア、M.、Manral、V.は、李、T.、アトキンソン、R.、ホワイト、R.、およびM. Fantoは、 \"IS-ISジェネリック暗号認証\"、RFC 5310、2009年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC6233] Li, T. and L. Ginsberg, \"IS-IS Registry Extension for Purges\", RFC 6233, May 2011.",
      "ja": "[RFC6233]李、T.およびL.ギンズバーグは、RFC 6233、2011年5月 \"パージのレジストリ拡張-ISはIS\"。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Fang Wei China Mobile No. 29, Financial Street, Xicheng District Beijing 100032 P.R. China",
      "ja": "牙魏中国移動第29号、ファイナンシャルストリート、西城区北京100032中華人民共和国"
    },
    {
      "indent": 3,
      "text": "EMail: weifang@chinamobile.com",
      "ja": "メールアドレス：weifang@chinamobile.com"
    },
    {
      "indent": 3,
      "text": "Yue Qin China Mobile No. 29, Financial Street, Xicheng District Beijing 100032 P.R. China",
      "ja": "中国移動通信におけるY uのEQなし。29、金融街、街北京100032中華人民共和国にξ"
    },
    {
      "indent": 3,
      "text": "EMail: qinyue@chinamobile.com",
      "ja": "メールアドレス：qinyue@chinamobile.com"
    },
    {
      "indent": 3,
      "text": "Zhenqiang Li China Mobile Unit2, Dacheng Plaza, No. 28 Xuanwumenxi Ave., Xuanwu District Beijing 100053 P.R. China",
      "ja": "Z強いL Iチャイナモバイルユニット2、DA 5つの吸引AVEによって広場、ノー。28 X Uに、X UA N地区北京100053 P.R.中国無し"
    },
    {
      "indent": 3,
      "text": "EMail: lizhenqiang@chinamobile.com",
      "ja": "メールアドレス：lizhenqiang@chinamobile.com"
    },
    {
      "indent": 3,
      "text": "Tony Li Cisco Systems, Inc. 170 W. Tasman Dr. San Jose, CA 95134 USA",
      "ja": "トニー・リーシスコシステムズ社170 W.タスマン博士はカリフォルニア州サンノゼ95134 USA"
    },
    {
      "indent": 3,
      "text": "EMail: tony.li@tony.li",
      "ja": "メールアドレス：tony.li@tony.li"
    },
    {
      "indent": 3,
      "text": "Jie Dong Huawei Technologies KuiKe Building, No. 9 Xinxi Rd., Haidian District Beijing 100085 P.R. China",
      "ja": "J IE洞胡A.、H低い点はありません、地区北京100085中華人民共和国技術K UI KEの建物です。ラインRDで9 X"
    },
    {
      "indent": 3,
      "text": "EMail: dongjie_dj@huawei.com",
      "ja": "メールアドレス：dongjie_dj@huawei.com"
    }
  ]
}