{
  "title": {
    "text": "RFC 6609 - Sieve Email Filtering: Include Extension",
    "ja": "RFC 6609 - ふるいメールフィルタリング：拡張子を含めます"
  },
  "number": 6609,
  "created_at": "2019-10-28 06:55:08.666701+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                          C. Daboo\nRequest for Comments: 6609                                   Apple, Inc.\nCategory: Standards Track                                       A. Stone\nISSN: 2070-1721                                              Serendipity\n                                                                May 2012",
      "raw": true
    },
    {
      "indent": 16,
      "text": "Sieve Email Filtering: Include Extension",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "The Sieve Email Filtering \"include\" extension permits users to include one Sieve script inside another. This can make managing large scripts or multiple sets of scripts much easier, and allows a site and its users to build up libraries of scripts. Users are able to include their own personal scripts or site-wide scripts.",
      "ja": "ふるいメールフィルタリングは、拡張子が別の内部の1つのSieveスクリプトが含まれるように、ユーザーを許可「が含まれます」。これは、はるかに簡単に大規模なスクリプトまたはスクリプトの複数のセットを管理します、サイトとそのユーザーがスクリプトのライブラリーを構築することを可能にすることができます。ユーザーは、自分の個人的なスクリプトやサイト全体のスクリプトを含めることができます。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6609.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6609で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2012 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2012 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction and Overview .......................................2\n2. Conventions Used in This Document ...............................2\n3. Include Extension ...............................................3\n   3.1. General Considerations .....................................3\n   3.2. Control Structure \"include\" ................................4\n   3.3. Control Structure \"return\" .................................7\n   3.4. Interaction with the \"variables\" Extension .................8\n        3.4.1. Control Structure \"global\" ..........................8\n        3.4.2. Variables Namespace global .........................10\n   3.5. Interaction with Other Extensions .........................11\n4. Security Considerations ........................................12\n5. IANA Considerations ............................................12\n6. References .....................................................13\n   6.1. Normative References ......................................13\n   6.2. Informative References ....................................13\nAppendix A. Acknowledgments .......................................14",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction and Overview",
      "section_title": true,
      "ja": "1.はじめにと概要"
    },
    {
      "indent": 3,
      "text": "It's convenient to be able to break Sieve [RFC5228] scripts down into smaller components that can be reused in a variety of different circumstances. For example, users may want to have a default script and a special 'vacation' script, the latter being activated when the user goes on vacation. In that case, the default actions should continue to be run, but a vacation command should be executed first. One option is to edit the default script to add or remove the vacation command as needed. Another is to have a vacation script that simply has a vacation command and then includes the default script.",
      "ja": "これは、異なる様々な状況で再利用することができます小さなコンポーネントにダウンふるい[RFC5228]スクリプトを破ることができるように便利です。たとえば、ユーザーは、ユーザーが休暇に行くときに、デフォルトのスクリプトと「特別な休暇」スクリプトは、後者が起動して持っている場合があります。その場合には、デフォルトのアクションが実行され続けなければならないが、休暇のコマンドが最初に実行されなければなりません。 1つのオプションは、必要に応じて休暇コマンドを追加または削除するには、デフォルトのスクリプトを編集することです。もう一つは、単に休暇のコマンドを持っていると、デフォルトのスクリプトが含ま休暇スクリプトを持つことです。"
    },
    {
      "indent": 3,
      "text": "This document defines the Sieve Email Filtering \"include\" extension, which permits users to include one Sieve script inside another.",
      "ja": "この文書では、ふるいのメールフィルタリングは、別の内部の1つのSieveスクリプトが含まれるように、ユーザーを許可する拡張子を、「含める」を定義します。"
    },
    {
      "indent": 0,
      "text": "2. Conventions Used in This Document",
      "section_title": true,
      "ja": "この文書で使用される2.表記"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 3,
      "text": "Conventions for notations are as in Sieve [RFC5228], Section 1.1.",
      "ja": "表記の規則は、ふるい[RFC5228]、セクション1.1のようにしています。"
    },
    {
      "indent": 3,
      "text": "The following key phrases are used to describe scripts and script execution:",
      "ja": "以下のキーフレーズは、スクリプトとスクリプトの実行を記述するために使用されています。"
    },
    {
      "indent": 3,
      "text": "script a valid Sieve script.",
      "ja": "スクリプト有効なSieveスクリプト。"
    },
    {
      "indent": 3,
      "text": "script execution an instance of a Sieve interpreter invoked for a given message delivery, starting with the user's active script and continuing through any included scripts until the final disposition of the message (e.g., delivered, forwarded, discarded, rejected, etc.).",
      "ja": "スクリプト実行ふるいインタプリタのインスタンスは、ユーザのアクティブスクリプトで開始し、任意の（例えば、配信、転送、破棄、拒否など）メッセージの最終処分までスクリプトが含まを通じて継続、所与のメッセージ配信のために呼び出されます。"
    },
    {
      "indent": 3,
      "text": "immediate script the individual Sieve script file being executed.",
      "ja": "即時スクリプト個々のSieveスクリプトファイルが実行されています。"
    },
    {
      "indent": 3,
      "text": "including script the individual Sieve script file that had an include statement that included the immediate script.",
      "ja": "すぐにスクリプトが含まれてincludeステートメントを持っていた個々のSieveスクリプトファイルには、スクリプトを含みます。"
    },
    {
      "indent": 0,
      "text": "3. Include Extension",
      "section_title": true,
      "ja": "3.拡張子を含めます"
    },
    {
      "indent": 0,
      "text": "3.1. General Considerations",
      "section_title": true,
      "ja": "3.1。概論"
    },
    {
      "indent": 3,
      "text": "Sieve implementations that implement the \"include\", \"return\", and \"global\" commands described below have an identifier of \"include\" for use with the capability mechanism. If any of the \"include\", \"return\", or \"global\" commands are used in a script, the \"include\" capability MUST be listed in the \"require\" statement in that script.",
      "ja": "「含む」、「戻る」を実装するふるいの実装、及び後述する「グローバル」コマンドが機能機構で使用するために、「含む」の識別子を有します。 「含める」、「リターン」のいずれか、または「グローバル」コマンドはスクリプト内で使用されている場合は、「含める」機能は、そのスクリプトで「必要」の文にリストされなければなりません。"
    },
    {
      "indent": 3,
      "text": "Sieve implementations need to track the use of actions in included scripts so that implicit \"keep\" behavior can be properly determined based on whether any actions have executed in any script.",
      "ja": "ふるいの実装は、暗黙的な行動が適切に何らかのアクションが任意のスクリプトで実行したかどうかに基づいて判断することができる「おく」ように含まれたスクリプト内のアクションの使用を追跡する必要があります。"
    },
    {
      "indent": 3,
      "text": "Sieve implementations are allowed to limit the total number of nested included scripts, but MUST provide for a total of at least three levels of nested scripts including the top-level script. An error MUST be generated either when the script is uploaded to the Sieve repository, or when the script is executed, if any nesting limit is exceeded. If such an error is detected whilst processing a Sieve script, an implicit \"keep\" action MUST be executed to prevent loss of any messages.",
      "ja": "ふるいの実装が含まれるネストされたスクリプトの総数を制限することを許可されているが、トップレベルのスクリプトを含むネストされたスクリプトの少なくとも三つのレベルの合計を提供しなければなりません。スクリプトをふるいリポジトリにアップロードされたときにスクリプトが実行されたときにエラーが生成されなければならないのいずれか、または、任意のネスト制限を超えている場合。このようなエラーがSieveスクリプトを処理しながら、検出された場合は、暗黙の「キープ」アクションは、すべてのメッセージの損失を防ぐために実行する必要があります。"
    },
    {
      "indent": 3,
      "text": "Sieve implementations MUST NOT allow recursive script inclusion. Both direct recursion, where script A includes script A (itself), and indirect recursion, where script A includes script B which includes script A once again, are prohibited.",
      "ja": "ふるいの実装は、再帰的なスクリプトを含めることを許してはなりません。スクリプトAは、スクリプトA（自体）、およびスクリプトAが再びスクリプトAを含むスクリプトBを含む間接的な再帰を含み、両方の直接再帰は、禁止されています。"
    },
    {
      "indent": 3,
      "text": "Sieve implementations MUST generate an error at execution time if an included script is a recursive inclusion. Implementations MUST NOT generate errors for recursive includes at upload time, as this would force an upload ordering requirement upon script authors and generators.",
      "ja": "含まれているスクリプトは再帰包含ある場合ふるい実装は実行時にエラーが発生しなければなりません。実装は、再帰的なため、エラーを発生させてはいけません、これはスクリプトの作成者と発電時に要件を注文アップロードを強制するよう、アップロード時に含まれています。"
    },
    {
      "indent": 3,
      "text": "Sieve implementations MUST generate an error at execution time if an included script does not exist, except when the \":optional\" parameter is specified. Implementations MUST NOT generate errors for scripts missing at upload time, as this would force an upload ordering requirement upon script authors and generators.",
      "ja": "「：オプションの」パラメータに指定されて含まれているスクリプトが存在しない場合はふるいの実装が時を除いて、実行時にエラーを発生させなければなりません。これは、スクリプトの作成者と発電時に要件を注文アップロードを強制するよう実装は、アップロード時に欠落しているスクリプトのエラーを生成してはなりません。"
    },
    {
      "indent": 3,
      "text": "If the Sieve \"variables\" extension [RFC5229] is present, an issue arises with the \"scope\" of variables defined in scripts that may include each other. For example, if a script defines the variable \"${status}\" with one particular meaning or usage, and another defines \"${status}\" with a different meaning, then if one script includes the other there is an issue as to which \"${status}\" is being referenced. To solve this problem, Sieve implementations MUST follow the scoping rules defined in Section 3.4 and support the \"global\" command defined there.",
      "ja": "ふるい「変数」拡張子[RFC5229]が存在する場合、問題がお互いを含むことができるスクリプトで定義された変数の「スコープ」で生じます。スクリプトが定義されている場合、例えば、可変一つの特定の意味または用法と「$ {ステータス}」、および異なる意味を持つ別の定義「$ {ステータス}」、その後のスクリプトが、他を含む場合、問題はどのへとして存在します「$ {ステータス}」は参照されています。この問題を解決するために、ふるいの実装は3.4節で定義されたスコープ規則に従うと、そこに定義された「グローバル」コマンドをサポートしなければなりません。"
    },
    {
      "indent": 0,
      "text": "3.2. Control Structure \"include\"",
      "section_title": true,
      "ja": "3.2。制御構造「が含まれます」"
    },
    {
      "indent": 6,
      "text": "Usage: include [LOCATION] [\":once\"] [\":optional\"] <value: string>",
      "ja": "用法：含める[LOCATION] [ \"：一度\"] [ \"オプション\"] <値：文字列>"
    },
    {
      "indent": 14,
      "text": "LOCATION = \":personal\" / \":global\"",
      "ja": "LOCATION = \"：個人的な\" / \"：グローバル\""
    },
    {
      "indent": 3,
      "text": "The \"include\" command takes an optional \"location\" parameter, an optional \":once\" parameter, an optional \":optional\" parameter, and a single string argument representing the name of the script to include for processing at that point. Implementations MUST restrict script names according to ManageSieve [RFC5804], Section 1.6. The script name argument MUST be a constant string as defined in [RFC5229], Section 3; implementations MUST NOT expand variables in the script name argument.",
      "ja": "「含む」コマンドは、オプションの、オプションの「位置」パラメータを取り「：一度」「オプション」パラメータ、及びその時点での処理のために含めるためにスクリプトの名前を表す単一の文字列引数、パラメータ、オプション。実装はManageSieve [RFC5804]、セクション1.6に応じてスクリプト名を制限する必要があります。スクリプト名引数は、[RFC5229]で定義されるように文字列定数、第3節でなければなりません。実装は、スクリプト名の引数の変数を拡張してはなりません。"
    },
    {
      "indent": 3,
      "text": "The \"location\" parameter MUST default to \":personal\" if not specified. The \"location\" parameter MUST NOT be specified more than once. The \"location\" has the following meanings:",
      "ja": "指定されていない場合：「個人」「場所」パラメータはデフォルトにしなければなりません。 「場所」パラメータは複数回指定することはできません。 「位置」は以下の意味があります。"
    },
    {
      "indent": 3,
      "text": ":personal Indicates that the named script is stored in the user's own personal (private) Sieve repository.",
      "ja": "：個人的には、という名前のスクリプトは、ユーザー自身の個人（プライベート）ふるいリポジトリに格納されていることを示します。"
    },
    {
      "indent": 3,
      "text": ":global Indicates that the named script is stored in a site-wide Sieve repository, accessible to all users of the Sieve system.",
      "ja": "：グローバルは、ふるいシステムのすべてのユーザーがアクセス、名前のスクリプトは、サイト全体のふるいリポジトリに格納されていることを示します。"
    },
    {
      "indent": 3,
      "text": "The \":once\" parameter tells the interpreter only to include the named script if it has not already been included at any other point during script execution. If the script has already been included, processing continues immediately following the \"include\" command. Implementations MUST NOT generate an error if an \"include :once\" command names a script whose inclusion would be recursive; in this case, the script MUST be considered previously included, and therefore \"include :once\" will not include it again.",
      "ja": "「：一度」パラメータは、それがすでにスクリプトの実行中に、他の時点で含まれていない場合のみ、というスクリプトが含まれるようにインタプリタに指示します。スクリプトがすでに含まれている場合、処理はコマンド「を含む」の直後に続きます。 「には、一度」場合、実装は、エラーを生成してはならないコマンド名を持つ含める再帰的になり、スクリプトを。この場合には、スクリプトがあらかじめ含ま考えなければなりませんので、「次のとおりです。一度」再びそれを含んでいません。"
    },
    {
      "indent": 3,
      "text": "Note: It is RECOMMENDED that script authors and generators use the \":once\" parameter only when including a script that performs general duties such as declaring global variables and making sanity checks of the environment.",
      "ja": "注意：「：一度」なグローバル変数を宣言し、環境の健全性チェックを行うなどの一般的な義務を実行するスクリプトを含む唯一のパラメータスクリプトの作成者と発電機を使用することをお勧めします。"
    },
    {
      "indent": 3,
      "text": "The \":optional\" parameter indicates that the script may be missing. Ordinarily, an implementation MUST generate an error during execution if an \"include\" command specifies a script that does not exist. When \":optional\" is specified, implementations MUST NOT generate an error for a missing script, and MUST continue as if the \"include\" command had not been present.",
      "ja": "「：オプションの」パラメータは、スクリプトが欠落することができることを示しています。コマンドが存在していないスクリプトを指定し、「含める」場合は通常、実装は、実行時にエラーを発生させなければなりません。ときに「：オプションの」指定され、実装が不足しているスクリプトのエラーを生成してはならない、と「が含まれる」コマンドが存在していなかったかのように継続する必要があります。"
    },
    {
      "indent": 3,
      "text": "The included script MUST be a valid Sieve script. Implementations MUST validate that each script has its own \"require\" statements for all optional capabilities used by that script. The scope of a \"require\" statement is the script in which it immediately appears, and neither inherits nor passes on capabilities to other scripts during the course of execution.",
      "ja": "含まれているスクリプトは、有効なSieveスクリプトでなければなりません。実装は各スクリプトは、そのスクリプトが使用するすべてのオプション機能の独自の「必要」の文を持っていることを検証する必要があります。 「必要」文のスコープは、それがすぐに表示されるスクリプト、およびどちらも継承されず、実行の過程で他のスクリプトに機能に渡されます。"
    },
    {
      "indent": 3,
      "text": "A \"stop\" command in an included script MUST stop all script processing, including the processing of the scripts that include the immediate one. The \"return\" command (described below) stops processing of the immediate script only, and allows the scripts that include it to continue.",
      "ja": "含まれているスクリプトで「停止」コマンドは即時つを含むスクリプトの処理を含め、すべてのスクリプトの処理を停止する必要があります。 （後述）、「リターン」コマンドは即時にスクリプトの処理を停止し、それを含めるスクリプトが継続することができます。"
    },
    {
      "indent": 3,
      "text": "The \"include\" command MAY appear anywhere in a script where a control structure is legal, and MAY be used within another control structure, e.g., an \"if\" block.",
      "ja": "「含む」コマンドは、制御構造が正当であるスクリプト内の任意の場所に表示されてもよく、例えば、別の制御構造内の「IF」ブロックを併用してもよいです。"
    },
    {
      "indent": 3,
      "text": "Examples:",
      "ja": "例："
    },
    {
      "indent": 3,
      "text": "The user has four scripts stored in their personal repository:",
      "ja": "ユーザーは自分の個人的なリポジトリに格納された4つのスクリプトがあります。"
    },
    {
      "indent": 3,
      "text": "\"default\"",
      "ja": "\"デフォルト\""
    },
    {
      "indent": 6,
      "text": "This is the default active script that includes several others.",
      "ja": "これは、いくつか他の人が含まれてデフォルトのアクティブスクリプトです。"
    },
    {
      "indent": 6,
      "text": "require [\"include\"];",
      "ja": "[「含める」]が必要です。"
    },
    {
      "indent": 6,
      "text": "include :personal \"always_allow\";\ninclude :global \"spam_tests\";\ninclude :personal \"spam_tests\";\ninclude :personal \"mailing_lists\";",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Personal script \"always_allow\"",
      "ja": "個人的なスクリプト「always_allow」"
    },
    {
      "indent": 6,
      "text": "This script special-cases some correspondent email addresses and makes sure any message containing those addresses is always kept.",
      "ja": "このスクリプトは、特別な場合、いくつかの対応の電子メールアドレスを、それらのアドレスを含むすべてのメッセージが常に保たれているを確認します。"
    },
    {
      "indent": 6,
      "text": "if address :is \"from\" \"boss@example.com\"\n{\n    keep;\n}\nelsif address :is \"from\" \"ceo@example.com\"\n{\n    keep;\n}",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Personal script \"spam_tests\" (uses \"reject\" [RFC5429])",
      "ja": "個人スクリプト \"spam_tests\"（[RFC5429]を \"拒否\" 使用しています）"
    },
    {
      "indent": 6,
      "text": "This script does some user-specific spam tests to catch spam messages not caught by the site-wide spam tests.",
      "ja": "このスクリプトは、サイト全体のスパムテストによって捕捉されないスパムメッセージをキャッチするために、いくつかのユーザー固有のスパムテストを行います。"
    },
    {
      "indent": 6,
      "text": "require [\"reject\"];",
      "ja": "[「拒否」]が必要です。"
    },
    {
      "indent": 6,
      "text": "if header :contains \"Subject\" \"XXXX\"\n{\n    reject \"Subject XXXX is unacceptable.\";\n}\nelsif address :is \"from\" \"money@example.com\"\n{\n    reject \"Mail from this sender is unwelcome.\";\n}",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Personal script \"mailing_lists\"",
      "ja": "個人的なスクリプト「mailing_lists」"
    },
    {
      "indent": 6,
      "text": "This script looks for messages from different mailing lists and files each into a mailbox specific to the mailing list.",
      "ja": "このスクリプトは、別のメーリングリストからのメッセージを探して、メーリングリストへの特定のメールボックスにそれぞれのファイル。"
    },
    {
      "indent": 6,
      "text": "require [\"fileinto\"];",
      "ja": "必要[ \"のfileinto\"];"
    },
    {
      "indent": 6,
      "text": "if header :is \"List-ID\" \"sieve.ietf.org\"\n{\n    fileinto \"lists.sieve\";\n}\nelsif header :is \"List-ID\" \"ietf-imapext.imc.org\"\n{\n    fileinto \"lists.imapext\";\n}",
      "raw": true
    },
    {
      "indent": 3,
      "text": "There is one script stored in the global repository:",
      "ja": "グローバルリポジトリに格納されている1つのスクリプトがあります："
    },
    {
      "indent": 3,
      "text": "Site script \"spam_tests\" (uses \"reject\" [RFC5429])",
      "ja": "\"spam_tests\" サイトスクリプトが（ \"拒否\" を使用して、[RFC5429]）"
    },
    {
      "indent": 6,
      "text": "This script does some site-wide spam tests that any user at the site can include in their own scripts at a suitable point. The script content is kept up to date by the site administrator.",
      "ja": "このスクリプトは、そのサイトのすべてのユーザーが、適切な時点で独自のスクリプトに含めることができるいくつかのサイト全体のスパムテストを行います。スクリプトの内容は、サイト管理者は最新の状態に保たれています。"
    },
    {
      "indent": 6,
      "text": "require [\"reject\"];",
      "ja": "[「拒否」]が必要です。"
    },
    {
      "indent": 6,
      "text": "if anyof (header :contains \"Subject\" \"$$\", header :contains \"Subject\" \"Make money\") { reject \"No thank you.\"; }",
      "ja": "anyof（ヘッダー：「件名」「$$が含まれ」、ヘッダを：含まれている「件名」「お金を稼ぐ」）があれば{拒否「いいえ、ありがとうございました。」; }"
    },
    {
      "indent": 0,
      "text": "3.3. Control Structure \"return\"",
      "section_title": true,
      "ja": "3.3。制御構造「復帰」"
    },
    {
      "indent": 6,
      "text": "Usage: return",
      "ja": "使用法：リターン"
    },
    {
      "indent": 3,
      "text": "The \"return\" command stops processing of the immediately included script only and returns processing control to the script that includes it. If used in the main script (i.e., not in an included script), it has the same effect as the \"stop\" command, including the appropriate \"keep\" action if no other actions have been executed up to that point.",
      "ja": "「戻る」コマンドがすぐに含まれているスクリプトの処理のみで、それを含んでいるスクリプトに制御を処理リターンを停止します。メインスクリプトで使用される場合（すなわち、しない含まれているスクリプトで）、それは、他のアクションがその時点までに実行されていない場合、適切な「維持」アクションを含む「停止」コマンドと同じ効果を有します。"
    },
    {
      "indent": 0,
      "text": "3.4. Interaction with the \"variables\" Extension",
      "section_title": true,
      "ja": "3.4。 「変数」拡張との対話"
    },
    {
      "indent": 3,
      "text": "In order to avoid problems of variables in an included script \"overwriting\" those from the script that includes it, this specification requires that all variables defined in a script MUST be kept \"private\" to the immediate script by default -- that is, they are not \"visible\" to other scripts. This ensures that two script authors cannot inadvertently cause problems by choosing the same name for a variable.",
      "ja": "それが含まれたスクリプトからのものを「上書き」含まれているスクリプト内の変数の問題を避けるために、この仕様は、スクリプトで定義されたすべての変数は、デフォルトで即時スクリプトに「プライベート」に保持しなければならないことが必要です - つまり、彼ら他のスクリプトに「可視」ではありません。これは、二つのスクリプト作成者が意図せずに変数に同じ名前を選択することで、問題を引き起こすことができないことを保証します。"
    },
    {
      "indent": 3,
      "text": "However, sometimes there is a need to make a variable defined in one script available to others. This specification defines the new command \"global\" to declare that a variable is shared among scripts. Effectively, two namespaces are defined: one local to the immediate script, and another shared among all scripts. Implementations MUST allow a non-global variable to have the same name as a global variable but have no interaction between them.",
      "ja": "しかし、時には他の人に利用できるひとつのスクリプトで定義された変数を作成する必要があります。この仕様は、変数は、スクリプト間で共有されていることを宣言するために、「グローバル」の新しいコマンドを定義します。即時スクリプトに一つのローカル、および他のすべてのスクリプト間で共有：実際には、2つのネームスペースが定義されています。実装は非グローバル変数はグローバル変数と同じ名前を持っていますが、それらの間に相互作用を持たないようにする必要があります。"
    },
    {
      "indent": 0,
      "text": "3.4.1. Control Structure \"global\"",
      "section_title": true,
      "ja": "3.4.1。制御構造「グローバル」"
    },
    {
      "indent": 6,
      "text": "Usage: global <value: string-list>",
      "ja": "使用法：グローバル<値：文字列のリスト>"
    },
    {
      "indent": 3,
      "text": "The \"global\" command accepts a string list argument that defines one or more names of variables to be stored in the global variable space. Each name MUST be a constant string and conform to the syntax of variable-name as defined in the \"variables\" extension document [RFC5229], Section 3. Match variables cannot be specified, and namespace prefixes are not allowed. An invalid name MUST be detected as a syntax error.",
      "ja": "「グローバル」コマンドは、グローバル変数領域に格納する変数の名前を1つ以上定義する文字列のリストの引数を受け入れます。それぞれの名前は3マッチ変数を指定することができず、名前空間接頭辞が許可されていない節、定数文字列であると、「変数」の拡張文書[RFC5229]で定義されている変数名の構文に従わなければなりません。無効な名前は、構文エラーとして検出されなければなりません。"
    },
    {
      "indent": 3,
      "text": "The \"global\" command is only available when the script has both \"include\" and \"variables\" in its require line. If the \"global\" command appears when only \"include\" or only \"variables\" has been required, an error MUST be generated when the script is uploaded.",
      "ja": "スクリプトがあり、両方の「含める」とその必要行の「変数」と、「グローバル」コマンドにのみ使用可能です。唯一の「含める」のみ「変数」と、「グローバル」コマンドが表示された場合は、スクリプトがアップロードされたときにエラーが生成されなければならない、要求されています。"
    },
    {
      "indent": 3,
      "text": "If a \"global\" command is given the name of a variable that has previously been defined in the immediate script with \"set\", an error MUST be generated either when the script is uploaded or at execution time.",
      "ja": "「グローバル」コマンドは、以前に「設定」とすぐにスクリプト内で定義されている変数の名前を指定された場合、エラーは、スクリプトがアップロードまたは実行時にされたいずれかのときに生成されなければなりません。"
    },
    {
      "indent": 3,
      "text": "If a \"global\" command lists a variable that has not been defined in the \"global\" namespace, the name of the variable is now marked as global, and any subsequent \"set\" command will set the value of the variable in global scope.",
      "ja": "「グローバル」コマンドが「グローバル」名前空間で定義されていない変数を一覧表示した場合は、変数の名前がグローバルとしてマークされ、それ以降の「設定」コマンドは、グローバルスコープ内の変数の値を設定します。"
    },
    {
      "indent": 3,
      "text": "A variable has global scope in all scripts that have declared it with the \"global\" command. If a script uses that variable name without declaring it global, the name specifies a separate, non-global variable within that script.",
      "ja": "変数は、「グローバル」コマンドでそれを宣言したすべてのスクリプトのグローバルスコープを持っています。スクリプトは、それがグローバル宣言せずにその変数名を使用している場合、名前はそのスクリプト内の別々の、非グローバル変数を指定します。"
    },
    {
      "indent": 3,
      "text": "Interpretation of a string containing a variable marked as global, but without any value set, SHALL behave as any other access to an unknown variable, as specified in the \"variables\" extension document [RFC5229], Section 3 (i.e., evaluates to an empty string).",
      "ja": "「変数」の拡張文書[RFC5229]、セクション3（すなわちで指定された変数を含む文字列の解釈は、空と評価され、グローバルとしてマークされますが、任意の値を設定せずに、未知の変数へのその他のアクセスとして振る舞うものと文字列）。"
    },
    {
      "indent": 3,
      "text": "Example:",
      "ja": "例："
    },
    {
      "indent": 3,
      "text": "The active script",
      "ja": "アクティブスクリプト"
    },
    {
      "indent": 6,
      "text": "The included script may contain repetitive code that is effectively a subroutine that can be factored out. In this script, the test that matches last will leave its value in the test_mailbox variable, and the top-level script will file the message into that mailbox. If no tests matched, the message will be implicitly kept in the INBOX.",
      "ja": "含まれているスクリプトは、効果的に因数分解することができるサブルーチンで繰り返しコードを含んでいてもよいです。このスクリプトでは、最後に一致したテストがtest_mailbox変数にその値を残して、そしてトップレベルのスクリプトは、そのメールボックスにメッセージを提出します。何のテストが一致しない場合、メッセージは暗黙のうちINBOXに保持されます。"
    },
    {
      "indent": 6,
      "text": "require [\"fileinto\", \"include\", \"variables\", \"relational\"];\nglobal \"test\";\nglobal \"test_mailbox\";",
      "raw": true
    },
    {
      "indent": 6,
      "text": "set \"test\" \"$$\";\ninclude \"subject_tests\";",
      "raw": true
    },
    {
      "indent": 6,
      "text": "set \"test\" \"Make money\";\ninclude \"subject_tests\";",
      "raw": true
    },
    {
      "indent": 6,
      "text": "if string :count \"eq\" \"${test_mailbox}\" \"1\"\n{\n    fileinto \"${test_mailbox}\";\n    stop;\n}",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Personal script \"subject_tests\"",
      "ja": "個人的なスクリプト「subject_tests」"
    },
    {
      "indent": 6,
      "text": "This script performs a number of tests against the message, sets the global test_mailbox variable with a folder to file the message into, and then falls back to the top-level script.",
      "ja": "このスクリプトは、メッセージに対するテストの数を行うにメッセージを提出するフォルダグローバルtest_mailbox変数を設定し、トップレベルのスクリプトに戻って落ちます。"
    },
    {
      "indent": 6,
      "text": "require [\"include\", \"variables\"];\nglobal [\"test\", \"test_mailbox\"];",
      "raw": true
    },
    {
      "indent": 6,
      "text": "if header :contains \"Subject\" \"${test}\" { set \"test_mailbox\" \"spam-${test}\"; }",
      "ja": "ヘッダ場合： - ; \"$ {試験}スパム\" \"件名\" \"$ {試験}\" {セット \"test_mailbox\" が含まれています}"
    },
    {
      "indent": 0,
      "text": "3.4.2. Variables Namespace global",
      "section_title": true,
      "ja": "3.4.2。変数はグローバル名前空間"
    },
    {
      "indent": 3,
      "text": "In addition to the \"global\" command, this document defines the variables namespace \"global\", in accordance with the \"variables\" extension document [RFC5229], Section 3. The \"global\" namespace has no sub-namespaces (e.g., 'set \"global.data.from\" \"me@example.com\";' is not allowed). The variable-name part MUST be a valid identifier (e.g., 'set \"global.12\" \"value\";' is not valid because \"12\" is not a valid identifier).",
      "ja": "「グローバル」コマンドに加えて、この文書は、「グローバル」変数の名前空間を定義し、「変数」の拡張文書[RFC5229]、セクション3に従って「グローバル」名前空間には、サブ名前空間（例えば、「セットを持っていません\"global.data.from\" \"me@example.com\";」許可されていません）。変数名の部分は有効な識別子でなければなりません（例えば、「セット 『global.12』 『値は』;」12「が有効な識別子でないため、有効ではありません」）。"
    },
    {
      "indent": 3,
      "text": "Note that the \"variables\" extension document [RFC5229], Section 3 suggests that extensions should define a namespace that is the same as its capability string (in this case, \"include\" rather than \"global\"). Nevertheless, references to the \"global\" namespace without a prior require statement for the \"include\" extension MUST cause an error.",
      "ja": "「変数」拡張ドキュメント[RFC5229]は、第3の拡張が（この場合には、「グローバル」、「含む」というよりも）その能力文字列と同じである名前空間を定義する必要があることを示唆していることに留意されたいです。それにもかかわらず、事前のない「グローバル」名前空間への参照は、エラーの原因としなければならない「などが」拡張のための文を必要としています。"
    },
    {
      "indent": 3,
      "text": "Example:",
      "ja": "例："
    },
    {
      "indent": 6,
      "text": "require [\"variables\", \"include\"];",
      "ja": "[「変数」、「含める」]が必要です。"
    },
    {
      "indent": 6,
      "text": "set \"global.i_am_on_vacation\" \"1\";",
      "ja": "「global.i_am_on_vacation」「1」を設定します。"
    },
    {
      "indent": 3,
      "text": "Variables declared global and variables accessed via the \"global\" namespace MUST each be one and the same. In the following example script, we see the variable \"i_am_on_vacation\" used in a \"global\" command, and again with the \"global\" namespace. Consider these as two syntaxes with identical meaning.",
      "ja": "変数はグローバル宣言した変数はそれぞれ1と同じでなければならない「グローバル」名前空間を介してアクセス。次の例のスクリプトでは、「グローバル」名前空間に再び「グローバル」コマンドで使用される変数「i_am_on_vacation」を参照してください、と。同じ意味を持つこれらのような2つの構文を考えてみましょう。"
    },
    {
      "indent": 3,
      "text": "Example:",
      "ja": "例："
    },
    {
      "indent": 6,
      "text": "require [\"variables\", \"include\", \"vacation\"];\nglobal \"i_am_on_vacation\";",
      "raw": true
    },
    {
      "indent": 6,
      "text": "set \"global.i_am_on_vacation\" \"1\";",
      "ja": "「global.i_am_on_vacation」「1」を設定します。"
    },
    {
      "indent": 6,
      "text": "if string :is \"${i_am_on_vacation}\" \"1\" { vacation \"It's true, I am on vacation.\"; }",
      "ja": "文字列があれば：「$ {i_am_on_vacation}」「1」{休暇は「それは本当だ、私は休暇中です」;。 }"
    },
    {
      "indent": 0,
      "text": "3.5. Interaction with Other Extensions",
      "section_title": true,
      "ja": "3.5。その他の拡張との相互作用"
    },
    {
      "indent": 3,
      "text": "When \"include\" is used with the \"editheader\" extension [RFC5293], any changes made to headers in a script MUST be propagated both to and from included scripts. By way of example, if a script deletes one header and adds another, then includes a second script, the included script MUST NOT see the removed header, and MUST see the added header. Likewise, if the included script adds or removes a header, upon returning to the including script, subsequent actions MUST see the added headers and MUST NOT see the removed headers.",
      "ja": "「含む」「editheader」拡張[RFC5293]で使用されるとき、スクリプトのヘッダーに加えられた変更は、および含まれるスクリプトの両方から伝播されなければなりません。スクリプトはつのヘッダを削除し、別のものを追加し、第2のスクリプトを含む場合、一例として、含まれているスクリプトを除去ヘッダを参照してはいけません、そして付加されたヘッダを見なければなりません。含まれているスクリプトを含むスクリプトに戻る際に、ヘッダを追加または削除した場合も同様に、後続のアクションが追加ヘッダを見なければならないし、除去ヘッダを参照してはいけません。"
    },
    {
      "indent": 3,
      "text": "When \"include\" is used with the MIME extension [RFC5703] \"foreverypart\" control structure, the included script MUST be presented with the current MIME part as though it were the entire message. A script SHALL NOT have any special control over the control structure it was included from. The \"break\" command in an included script is not valid on its own and may not terminate a \"foreverypart\" iteration in another script. The included script can use \"return\" to transfer control back to the including script. A global variable can be used to convey results to the including script. A \"stop\" in an included script, even within a \"foreverypart\" loop, still halts all script execution, per Section 3.2.",
      "ja": "「含む」はMIME拡張[RFC5703]「foreverypart」制御構造を使用する場合、それはメッセージ全体であるかのように、含まれているスクリプトは、現在のMIME部分で提示されなければなりません。このスクリプトは、それが含まれていたから、制御構造の上に特別な制御を持っていないものとします。含まれているスクリプトで「ブレーク」コマンドは、自分自身では有効ではありませんし、別のスクリプトで「foreverypart」反復を終了しない場合があります。含まれているスクリプトを含むスクリプトに戻って制御を移す「リターン」を使用することができます。グローバル変数は、以下を含むスクリプトに結果を伝えるために使用することができます。でも「foreverypart」ループ内で、含まれているスクリプトで「停止」、まだ3.2節ごとに、すべてのスクリプトの実行を停止します。"
    },
    {
      "indent": 3,
      "text": "When \"include\" is used with the \"reject\" extension [RFC5429], calling \"reject\" or \"ereject\" at any time sets the reject action on the message, and continues script execution. Apropos of the MIME extension, if an included script sees only a portion of the message and calls a reject, it is the entire message and not the single MIME part that carries the rejection.",
      "ja": "「含む」呼び出し、「拒否」拡張[RFC5429]で使用される場合、「拒否」又はいつでも「ereject」は、メッセージに拒否アクションを設定し、スクリプトの実行を継続します。含まれているスクリプトは、メッセージの一部のみを見ると拒否を呼び出す場合MIME拡張のaproposのは、それがメッセージ全体ではなく拒絶反応を運ぶ単一のMIME部分です。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "Sieve implementations MUST ensure adequate security for the global script repository to prevent unauthorized changes to global scripts. For example, a site policy might enable only certain users with administrative privileges to modify the global scripts. Sites are advised against allowing all users to have write access to the sites' global scripts.",
      "ja": "ふるいの実装は、グローバル・スクリプトへの不正な変更を防止するためのグローバル・スクリプトリポジトリのための十分なセキュリティを確保しなければなりません。たとえば、サイトポリシーはグローバル・スクリプトを変更するには管理者権限を持つ特定のユーザーのみを有効かもしれません。サイトでは、すべてのユーザーがサイトのグローバルなスクリプトへの書き込みアクセス権を持ってできるように反対をお勧めします。"
    },
    {
      "indent": 3,
      "text": "Sieve implementations MUST ensure that script names are checked for validity and proper permissions prior to inclusion, in order to prevent a malicious user from gaining access to files accessible to the mail server software that should not be accessible to the user.",
      "ja": "ふるいの実装は、スクリプト名は、ユーザーがアクセスすべきではないメールサーバーソフトウェアにアクセス可能なファイルにアクセスする悪意のあるユーザーを防ぐために、有効性と包括する前に適切な権限がチェックされていることを確認しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Sieve implementations MUST ensure that script names are safe for use with their storage system. An error MUST be generated either when the script is uploaded or at execution time for a script including a name that could be used as a vector to attack the storage system. By way of example, the following include commands should be considered hostile: 'include \"./../..//etc/passwd\"', 'include \"foo$(`rm star`)\"'.",
      "ja": "ふるいの実装は、そのスクリプト名は、そのストレージ・システムで使用するために安全であることを確認しなければなりません。エラーは、スクリプトは、ストレージシステムを攻撃するためのベクターとして使用することができ名を含むアップロードまたはスクリプトの実行時にされたいずれかのときに生成されなければなりません。一例として、以下のコマンドは敵対的と見なされるべき含まれます：、 『『（ `RM star`）のfoo $』を含める』「『./../..//etc/passwd』が含まれます」。"
    },
    {
      "indent": 3,
      "text": "Beyond these, the \"include\" extension does not raise any security considerations that are not discussed in the base Sieve [RFC5228] document and the \"variables\" extension document [RFC5229].",
      "ja": "これら以外にも、「含める」拡張子がベースふるい[RFC5228]ドキュメントおよび「変数」の拡張文書[RFC5229]で議論されていないすべてのセキュリティ上の考慮事項は発生しません。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "ja": "5. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "The following template specifies the IANA registration of the Sieve extension specified in this document:",
      "ja": "次のテンプレートは、この文書で指定されたSieve拡張のIANA登録を指定します。"
    },
    {
      "indent": 6,
      "text": "To: iana@iana.org Subject: Registration of new Sieve extension",
      "ja": "To：iana@iana.org件名：新しいふるい拡張の登録"
    },
    {
      "indent": 6,
      "text": "Capability name: include Description: adds the \"include\" command to execute other Sieve scripts, the \"return\" action from an included script, and the \"global\" command and \"global\" variables namespace to access variables shared among included scripts. RFC number: this RFC Contact address: the Sieve discussion list <sieve@ietf.org>",
      "ja": "能力名：説明を含めるには：他のSieveスクリプトを実行するコマンド、含まれているスクリプトから「戻り」アクション、および「グローバル」コマンドと付属のスクリプト間で共有変数にアクセスするには、「グローバル」変数の名前空間「を含む」が追加されます。 RFC番号：このRFCの連絡先アドレス：ふるいディスカッションリスト<sieve@ietf.org>"
    },
    {
      "indent": 3,
      "text": "This information has been added to IANA's \"Sieve Extensions\" registry (http://www.iana.org).",
      "ja": "この情報は、IANAの「ふるい拡張機能」レジストリ（http://www.iana.org）に追加されました。"
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "ja": "6.参照"
    },
    {
      "indent": 0,
      "text": "6.1. Normative References",
      "section_title": true,
      "ja": "6.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC5228] Guenther, P., Ed., and T. Showalter, Ed., \"Sieve: An Email Filtering Language\", RFC 5228, January 2008.",
      "ja": "[RFC5228]ギュンター、P.、エド、およびT.ショーウォルター監督、エド、 \"ふるい：メールフィルタリング言語\"。。、RFC 5228、2008年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC5229] Homme, K., \"Sieve Email Filtering: Variables Extension\", RFC 5229, January 2008.",
      "ja": "[RFC5229]オム、K.、 \"ふるいメールフィルタリング：変数の拡張\"、RFC 5229、2008年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC5804] Melnikov, A., Ed., and T. Martin, \"A Protocol for Remotely Managing Sieve Scripts\", RFC 5804, July 2010.",
      "ja": "[RFC5804]メルニコフ、A.編、およびT.マーティン、 \"リモート管理Sieveスクリプトのためのプロトコル\"、RFC 5804、2010年7月。"
    },
    {
      "indent": 0,
      "text": "6.2. Informative References",
      "section_title": true,
      "ja": "6.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC5293] Degener, J. and P. Guenther, \"Sieve Email Filtering: Editheader Extension\", RFC 5293, August 2008.",
      "ja": "[RFC5293] Degener、J.とP.ギュンター、 \"ふるいメールフィルタリング：Editheader拡張\"、RFC 5293、2008年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC5429] Stone, A., Ed., \"Sieve Email Filtering: Reject and Extended Reject Extensions\", RFC 5429, March 2009.",
      "ja": "[RFC5429]ストーン、A.、エド、 \"ふるいメールフィルタリング：拒否や拡張機能を拒否拡張\"、RFC 5429、2009年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC5703] Hansen, T. and C. Daboo, \"Sieve Email Filtering: MIME Part Tests, Iteration, Extraction, Replacement, and Enclosure\", RFC 5703, October 2009.",
      "ja": "[RFC5703]ハンセン、T.とC. Daboo、 \"ふるいメールフィルタリング：MIMEパートのテスト、反復、抽出、置換、およびエンクロージャ\"、RFC 5703、2009年10月。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Acknowledgments",
      "ja": "付録A.謝辞"
    },
    {
      "indent": 3,
      "text": "Thanks to Stephan Bosch, Ned Freed, Arnt Gulbrandsen, Tony Hansen, Kjetil Torgrim Homme, Jeffrey Hutzelman, Barry Leiba, Alexey Melnikov, Ken Murchison, Marc Mutz, and Rob Siemborski, for comments and corrections.",
      "ja": "コメントと修正のためのステファン・ボッシュ、ネッドフリード、ARNT Gulbrandsenの、トニー・ハンセン、はKjetil Torgrimオム、ジェフリーHutzelman、バリー・リーバー、アレクセイ・メルニコフ、ケンマーチソン、マルク・MUTZ、そしてロブSiemborskiのおかげで、。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Cyrus Daboo Apple Inc. 1 Infinite Loop Cupertino, CA 95014 USA",
      "ja": "サイラスDabooされたApple Inc. 1無限ループクパチーノ、CA 95014 USA"
    },
    {
      "indent": 3,
      "text": "EMail: cyrus@daboo.name URI: http://www.apple.com/",
      "ja": "電子メール：cyrus@daboo.name URI：http://www.apple.com/"
    },
    {
      "indent": 3,
      "text": "Aaron Stone Serendipity 1817 California St. #104 San Francisco, CA 94109 USA",
      "ja": "アーロンストーンセレンディピティ1817カリフォルニア州セント第104位サンフランシスコ、CA 94109 USA"
    },
    {
      "indent": 3,
      "text": "EMail: aaron@serendipity.cx",
      "ja": "メールアドレス：aaron@serendipity.cx"
    }
  ]
}