{
  "title": {
    "text": "RFC 6980 - Security Implications of IPv6 Fragmentation with IPv6 Neighbor Discovery",
    "ja": "RFC 6980 - IPv6の近隣探索とIPv6の断片化によるセキュリティへの影響"
  },
  "number": 6980,
  "created_at": "2019-11-02 11:38:23.448094+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                           F. Gont\nRequest for Comments: 6980                        SI6 Networks / UTN-FRH\nUpdates: 3971, 4861                                          August 2013\nCategory: Standards Track\nISSN: 2070-1721",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Security Implications of IPv6 Fragmentation with IPv6 Neighbor Discovery",
      "ja": "IPv6の近隣探索とIPv6の断片化によるセキュリティへの影響"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document analyzes the security implications of employing IPv6 fragmentation with Neighbor Discovery (ND) messages. It updates RFC 4861 such that use of the IPv6 Fragmentation Header is forbidden in all Neighbor Discovery messages, thus allowing for simple and effective countermeasures for Neighbor Discovery attacks. Finally, it discusses the security implications of using IPv6 fragmentation with SEcure Neighbor Discovery (SEND) and formally updates RFC 3971 to provide advice regarding how the aforementioned security implications can be mitigated.",
      "ja": "この文書では、近隣探索（ND）メッセージでのIPv6の断片化を採用したセキュリティへの影響を分析します。これは、IPv6断片化ヘッダーの使用は、このように近隣探索攻撃のためのシンプルかつ効果的な対策を考慮して、すべての近隣探索メッセージで禁止されていることを、このようなRFC 4861を更新します。最後に、それは、安全な近隣探索（SEND）でのIPv6フラグメンテーションを使用してのセキュリティへの影響を説明し、正式に、前述のセキュリティへの影響を緩和することができる方法についてのアドバイスを提供するために、RFC 3971を更新します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6980.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6980で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2013 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2013 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Traditional Neighbor Discovery and IPv6 Fragmentation ...........4\n3. SEcure Neighbor Discovery (SEND) and IPv6 Fragmentation .........5\n4. Rationale for Forbidding IPv6 Fragmentation in Neighbor\n   Discovery .......................................................6\n5. Specification ...................................................6\n6. Operational Advice ..............................................7\n7. Security Considerations .........................................7\n8. Acknowledgements ................................................8\n9. References ......................................................8\n   9.1. Normative References .......................................8\n   9.2. Informative References .....................................9\nAppendix A. Message Size When Carrying Certificates ...............10",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "The Neighbor Discovery Protocol (NDP) is specified in RFC 4861 [RFC4861]. It is used by both hosts and routers. Its functions include Neighbor Discovery (ND), Router Discovery (RD), address autoconfiguration, address resolution, Neighbor Unreachability Detection (NUD), Duplicate Address Detection (DAD), and redirection.",
      "ja": "近隣探索プロトコル（NDP）は、RFC 4861 [RFC4861]で指定されています。これは、ホストとルータの両方で使用されています。その機能は、近隣探索（ND）、ルータ探索（RD）、アドレス自動設定、アドレス解決、近隣到達不能検出（NUD）、重複検出（DAD）、及びリダイレクションアドレスを含みます。"
    },
    {
      "indent": 3,
      "text": "Many of the possible attacks against the Neighbor Discovery Protocol are discussed in detail in [RFC3756]. In order to mitigate the aforementioned possible attacks, SEcure Neighbor Discovery (SEND) was standardized. SEND employs a number of mechanisms to certify the origin of Neighbor Discovery packets and the authority of routers, and to protect Neighbor Discovery packets from being the subject of modification or replay attacks.",
      "ja": "近隣探索プロトコルに対する攻撃の可能性の多くは、[RFC3756]で詳しく説明されています。前述の可能な攻撃を軽減するために、セキュア近隣探索（SEND）が標準化しました。 SENDは、近隣探索パケットの起点とルータの権限を証明するために、変更またはリプレイ攻撃の対象であることから近隣探索パケットを保護するために多くの機構を採用します。"
    },
    {
      "indent": 3,
      "text": "However, a number of factors, such as the high administrative overhead of deploying trust anchors and the unavailability of SEND implementations for many widely deployed operating systems, make SEND hard to deploy [Gont-DPSC]. Thus, in many general scenarios, it may be necessary and/or convenient to use other mitigation techniques for NDP-based attacks. The following mitigations are currently available for NDP attacks:",
      "ja": "しかしながら、このようなトラストアンカーと多くの広く展開オペレーティングシステムのSEND実装の使用不能を展開する高管理オーバーヘッドなどの要因の数は、[Gont-DPSC]を展開するハードSENDします。従って、多くの一般的なシナリオでは、NDPベースの攻撃のための他の緩和技術を使用することが必要及び/又は好都合であり得ます。以下の緩和策は、NDP攻撃のために現在利用可能です。"
    },
    {
      "indent": 3,
      "text": "o Static Access Control Lists (ACLs) in switches",
      "ja": "スイッチ中のOスタティックアクセス制御リスト（ACL）"
    },
    {
      "indent": 3,
      "text": "o Layer-2 filtering of Neighbor Discovery packets (such as RA-Guard [RFC6105])",
      "ja": "（例えば、RA-ガード[RFC6105]のような）近隣探索パケットのOレイヤ2のフィルタリング"
    },
    {
      "indent": 3,
      "text": "o Neighbor Discovery monitoring tools (e.g., NDPMon [NDPMon] and ramond [ramond])",
      "ja": "O近隣探索監視ツール（例えば、NDPMonは[NDPMon]及び[ramond] ramond）"
    },
    {
      "indent": 3,
      "text": "o Intrusion Prevention Systems (IPS)",
      "ja": "O侵入防止システム（IPS）"
    },
    {
      "indent": 3,
      "text": "IPv6 Router Advertisement Guard (RA-Guard) is a mitigation technique for attack vectors based on ICMPv6 Router Advertisement (RA) messages. It is meant to block attack packets at a layer-2 device before the attack packets actually reach the target nodes. [RFC6104] describes the problem statement of \"Rogue IPv6 Router Advertisements\", and [RFC6105] specifies the \"IPv6 Router Advertisement Guard\" functionality.",
      "ja": "IPv6ルーター広告ガード（RA-ガード）は、ICMPv6のルーターアドバタイズ（RA）メッセージに基づいて攻撃ベクトルのための緩和手法です。攻撃パケットが実際にターゲットノードに到達する前にレイヤ2デバイスで攻撃パケットをブロックすることを意味します。 [RFC6104]は、「ローグのIPv6ルータアドバタイズメント」の問題文を記述して、[RFC6105]は、「IPv6ルーター広告ガード」機能を指定します。"
    },
    {
      "indent": 3,
      "text": "Tools such as NDPMon [NDPMon] and ramond [ramond] aim to monitor Neighbor Discovery traffic in the hopes of detecting possible attacks when there are discrepancies between the information advertised in Neighbor Discovery packets and the information stored on a local database.",
      "ja": "そのようなNDPMon [NDPMon]及び[ramond] ramondなどのツールは、近隣探索パケットでアドバタイズ情報とローカルデータベースに格納された情報との間に矛盾がある場合に可能な攻撃を検出することを期待して近隣探索トラフィックを監視することを目指します。"
    },
    {
      "indent": 3,
      "text": "Some Intrusion Prevention Systems (IPS) can mitigate Neighbor Discovery attacks. We recommend that Intrusion Prevention Systems implement mitigations for NDP attacks.",
      "ja": "いくつかの侵入防止システム（IPS）は、近隣探索攻撃を軽減することができます。私たちは、侵入防止システムは、NDP攻撃の緩和策を実施することをお勧めします。"
    },
    {
      "indent": 3,
      "text": "IPv6 fragmentation introduces a key challenge for these mitigation or monitoring techniques, since it is trivial for an attacker to conceal his attack by fragmenting his packets into multiple fragments. This may limit or even eliminate the effectiveness of the aforementioned mitigation or monitoring techniques. Recent work [CPNI-IPv6] indicates that current implementations of the aforementioned mitigations for NDP attacks can be trivially evaded. For example, as noted in [RA-GUARD], current RA-Guard implementations can be trivially evaded by fragmenting the attack packets into multiple fragments, such that the layer-2 device cannot find all the necessary information to perform packet filtering in the same packet. While Neighbor Discovery monitoring tools could (in theory) implement IPv6 fragment reassembly, this is usually an arms-race with the attacker (an attacker can generate lots of forged fragments to \"confuse\" the monitoring tools), and therefore the aforementioned tools are unreliable for the detection of such attacks.",
      "ja": "攻撃者は、複数の断片に自分のパケットを断片化することによって、彼の攻撃を隠すすることは自明であるため、IPv6のフラグメンテーションは、これらの緩和やモニタリング技術のための重要な課題を紹介します。これは、制限あるいは前述の緩和またはモニタリング手法の有効性を排除することができます。最近の研究[CPNI-IPv6は] NDP攻撃前述緩和策の現在の実装は自明に回避することができることを示しています。 [RA-GUARD]で述べたように、例えば、現在のRA-Guardの実装は自明レイヤ2デバイスが同じでパケットフィルタリングを実行するために必要なすべての情報を見つけることができないように、複数の断片に攻撃パケットを断片化することによって回避することができますパケット。近隣探索監視ツールは、（理論的に）のIPv6フラグメント再構成を実装することもできますが、これは通常、攻撃者（監視ツールを「混同」する鍛造破片の多くを生成することができ、攻撃者）と腕のレースであるため、上記のツールは、信頼できませんこのような攻撃の検出のために。"
    },
    {
      "indent": 3,
      "text": "Section 2 analyzes the use of IPv6 fragmentation in traditional Neighbor Discovery. Section 3 analyzes the use of IPv6 fragmentation in SEcure Neighbor Discovery (SEND). Section 4 provides the rationale for forbidding the use of IPv6 fragmentation with Neighbor Discovery. Section 5 formally updates RFC 4861 such that the use of the IPv6 Fragment Header with traditional Neighbor Discovery is forbidden, and also formally updates RFC 3971 by providing advice on the use of IPv6 fragmentation with SEND. Section 6 provides operational advice about interoperability problems arising from the use of IPv6 fragmentation with Neighbor Discovery.",
      "ja": "第2節では、伝統的な近隣探索でのIPv6の断片化の使用を分析します。セクション3は、セキュア近隣探索（SEND）でのIPv6断片化の使用を分析します。セクション4は、近隣探索とIPv6の断片化の使用を禁止するための理論的根拠を提供します。第5節では、正式に伝統的な近隣探索とIPv6のフラグメントヘッダの使用が禁止され、また、正式にSENDとのIPv6断片化の使用に関するアドバイスを提供することにより、RFC 3971を更新するRFC 4861は、更新されます。第6節は、近隣探索でのIPv6断片化の利用から生じる相互運用性の問題についての運用アドバイスを提供します。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "ja": "この文書のキーワード \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", および \"OPTIONAL\" はRFC 2119 [RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. Traditional Neighbor Discovery and IPv6 Fragmentation",
      "section_title": true,
      "ja": "2.従来の近隣探索およびIPv6フラグメンテーション"
    },
    {
      "indent": 3,
      "text": "The only potential use case for IPv6 fragmentation with traditional (i.e., non-SEND) IPv6 Neighbor Discovery would be that in which a Router Advertisement must include a large number of options (Prefix Information Options, Route Information Options, etc.). However, this could still be achieved without employing fragmentation, by splitting the aforementioned information into multiple Router Advertisement messages.",
      "ja": "伝統的な（すなわち、非SEND）とIPv6の断片化のための唯一の潜在的な使用の場合のIPv6近隣探索とは、ルータ広告オプション（プレフィックス情報オプション、ルート情報オプション、等）の多数を含んでいなければならないことであろう。しかし、これはまだ複数のルータ広告メッセージに前述の情報を分割することにより、断片化を用いることなく達成することができます。"
    },
    {
      "indent": 6,
      "text": "Some Neighbor Discovery implementations are known to silently ignore Router Advertisement messages that employ fragmentation. Therefore, splitting the necessary information into multiple RA messages (rather than sending a large RA message that is fragmented into multiple IPv6 fragments) is probably desirable even from an interoperability point of view.",
      "ja": "いくつかの近隣探索の実装は静かに断片化を採用したルータ広告メッセージを無視することが知られています。したがって、複数のRAメッセージに必要な情報を分割（よりもむしろ複数のIPv6フラグメントに断片化された大RAメッセージを送信する）にもビューの相互運用性の点から、おそらく望ましいです。"
    },
    {
      "indent": 3,
      "text": "Thus, avoiding the use of IPv6 fragmentation in traditional Neighbor Discovery would greatly simplify and improve the effectiveness of monitoring and filtering Neighbor Discovery traffic and would also prevent interoperability problems with those implementations that do not support fragmentation in Neighbor Discovery messages.",
      "ja": "このように、大幅に簡素化し、監視とフィルタリング近隣探索トラフィックの有効性を改善する伝統的な近隣探索でのIPv6断片化の使用を回避し、また、近隣探索メッセージの断片化をサポートしていない実装との相互運用性の問題を防止するであろう。"
    },
    {
      "indent": 0,
      "text": "3. SEcure Neighbor Discovery (SEND) and IPv6 Fragmentation",
      "section_title": true,
      "ja": "3.セキュア近隣探索（SEND）とIPv6フラグメンテーション"
    },
    {
      "indent": 3,
      "text": "SEND packets typically carry more information than traditional Neighbor Discovery packets: for example, they include additional options such as the Cryptographically Generated Address (CGA) option and the RSA signature option.",
      "ja": "パケットは、典型的には、伝統的な近隣探索パケットよりも多くの情報を運ぶ送信する：例えば、それらは、暗号化生成アドレス（CGA）オプションとRSA署名オプションとして、追加のオプションを含みます。"
    },
    {
      "indent": 3,
      "text": "When SEND nodes employ any of the Neighbor Discovery messages specified in [RFC4861], the situation is roughly the same: if more information than would fit in a non-fragmented Neighbor Discovery packet needs to be sent, it should be split into multiple Neighbor Discovery messages (such that IPv6 fragmentation is avoided).",
      "ja": "SENDノードは[RFC4861]で指定された近隣探索メッセージのいずれかを採用すると、状況はほぼ同じである：非断片近隣探索パケットに収まるだろうより多くの情報を送信する必要がある場合、それは、複数の近隣探索に分割する必要がありますメッセージ（IPv6の断片化が回避されるように）。"
    },
    {
      "indent": 3,
      "text": "However, Certification Path Advertisement (CPA) messages (specified in [RFC3971]) pose a different situation, since the Certificate Option they include typically contains much more information than any other Neighbor Discovery option. For example, Appendix C of [RFC3971] reports Certification Path Advertisement messages from 1050 to 1066 bytes on an Ethernet link layer. Since the size of CPA messages could potentially exceed the MTU of the local link, Section 5 recommends that fragmented CPA messages be processed normally, but discourages the use of keys that would result in fragmented CPA messages.",
      "ja": "ただし、（[RFC3971]で指定された）証明のパス広告（CPA）のメッセージは、彼らは一般的に、他の近隣探索オプションよりもはるかに多くの情報が含まれて含まれ、証明書オプション以来、さまざまな状況をもたらします。例えば、[RFC3971]の付録Cは、1050年からのイーサネット・リンク層で1066バイトに証明書のパス広告メッセージを報告します。 CPAメッセージのサイズが潜在的にローカルリンクのMTUを超える可能性があるため、第5節では、断片化CPAメッセージが正常に処理されることをお勧めしますが、断片化されたCPAメッセージをもたらすキーの使用を阻止します。"
    },
    {
      "indent": 3,
      "text": "It should be noted that relying on fragmentation opens the door to a variety of IPv6 fragmentation-based attacks against SEND. In particular, if an attacker is located on the same broadcast domain as the victim host and Certification Path Advertisement messages employ IPv6 fragmentation, it would be trivial for the attacker to forge IPv6 fragments such that they result in \"Fragment ID collisions\", causing both the attack fragments and the legitimate fragments to be discarded by the victim node. This would eventually cause Authorization Delegation Discovery (Section 6 of [RFC3971]) to fail, thus leading the host to (depending on local configuration) either fall back to unsecured mode or reject the corresponding Router Advertisement messages (possibly resulting in a denial of service).",
      "ja": "断片化に頼ることはSENDに対するIPv6のフラグメンテーションベースのさまざまな攻撃への扉を開くことに留意すべきです。被害者のホストと証明のパス広告メッセージは、IPv6断片化を採用すると、攻撃者は、彼らは両方を引き起こし、「フラグメントIDの衝突」につながるようなIPv6のフラグメントを偽造するために具体的には、攻撃者が同じブロードキャストドメイン上にある場合、それは些細なことでしょう攻撃フラグメントおよび正当なフラグメントは、被害者ノードによって破棄されます。これは、最終的に、おそらくサービス拒否をもたらす（従ってバックセキュリティで保護されていないモードに落ちるまたは対応するルータ広告メッセージを拒否のいずれか（ローカル設定に応じて）にホストをリード、失敗する権限委譲発見（[RFC3971]のセクション6）を引き起こします）。"
    },
    {
      "indent": 0,
      "text": "4. Rationale for Forbidding IPv6 Fragmentation in Neighbor Discovery",
      "section_title": true,
      "ja": "4.理論的根拠近隣探索でIPv6の断片化を禁止します"
    },
    {
      "indent": 3,
      "text": "A number of considerations should be made regarding the use of IPv6 fragmentation with Neighbor Discovery:",
      "ja": "検討事項の数は、近隣探索でのIPv6断片化の使用に関してなされるべきです。"
    },
    {
      "indent": 3,
      "text": "o A significant number of existing implementations already silently drop fragmented ND messages, so the use of IPv6 fragmentation may hamper interoperability among IPv6 implementations.",
      "ja": "O既存の実装のかなりの数が既にサイレント断片化NDメッセージをドロップするので、IPv6の断片化の使用は、IPv6実装間の相互運用性を妨げることができます。"
    },
    {
      "indent": 3,
      "text": "o Although it is possible to build an ND message that needs to be fragmented, such packets are unlikely to exist in the real world because of the large number of options that would be required for the resulting packet to exceed the minimum IPv6 MTU of 1280 octets.",
      "ja": "Oそれは断片化される必要がNDメッセージを構築することは可能ですが、このようなパケットが原因結果のパケットは1280オクテットの最小のIPv6 MTUを超過するために必要とされるであろう多数のオプションの現実の世界に存在する可能性は低いです。"
    },
    {
      "indent": 3,
      "text": "o If an ND message was so large as to need fragmentation, there is an option to distribute the same information amongst more than one message, each of which is small enough to not need fragmentation.",
      "ja": "NDメッセージが断片化を必要とするほど大きかった場合はO、フラグメンテーションを必要としないように十分に小さいそれぞれが複数のメッセージ、の間で同一の情報を配信するためのオプションがあります。"
    },
    {
      "indent": 3,
      "text": "Thus, forbidding the use of IPv6 fragmentation with Neighbor Discovery normalizes existing behavior and sets the expectations of all implementations to the existing lowest common denominator.",
      "ja": "このように、近隣探索とIPv6の断片化の使用を禁止することは、既存の挙動を正規化し、既存の最小公分母にすべての実装の期待を設定します。"
    },
    {
      "indent": 0,
      "text": "5. Specification",
      "section_title": true,
      "ja": "5.仕様"
    },
    {
      "indent": 3,
      "text": "Nodes MUST NOT employ IPv6 fragmentation for sending any of the following Neighbor Discovery and SEcure Neighbor Discovery messages:",
      "ja": "ノードは、次の近隣探索とセキュア近隣探索メッセージのいずれかを送信するためのIPv6断片化を採用してはいけません。"
    },
    {
      "indent": 3,
      "text": "o Neighbor Solicitation",
      "ja": "O近隣要請"
    },
    {
      "indent": 3,
      "text": "o Neighbor Advertisement",
      "ja": "O近隣広告"
    },
    {
      "indent": 3,
      "text": "o Router Solicitation",
      "ja": "Oルーター要請"
    },
    {
      "indent": 3,
      "text": "o Router Advertisement",
      "ja": "ルータアドバタイズメントO"
    },
    {
      "indent": 3,
      "text": "o Redirect",
      "ja": "Oリダイレクト"
    },
    {
      "indent": 3,
      "text": "o Certification Path Solicitation",
      "ja": "O証明書のパス要請"
    },
    {
      "indent": 3,
      "text": "Nodes SHOULD NOT employ IPv6 fragmentation for sending the following messages (see Section 6.4.2 of [RFC3971]):",
      "ja": "ノードは、次のメッセージを送信するためのIPv6フラグメンテーションを採用すべきではない（[RFC3971]のセクション6.4.2を参照してください）："
    },
    {
      "indent": 3,
      "text": "o Certification Path Advertisement",
      "ja": "O証明経路広告"
    },
    {
      "indent": 3,
      "text": "Nodes MUST silently ignore the following Neighbor Discovery and SEcure Neighbor Discovery messages if the packets carrying them include an IPv6 Fragmentation Header:",
      "ja": "それらを運ぶパケットがIPv6断片化ヘッダーが含まれている場合、ノードは静かに以下の近隣探索とセキュア近隣探索メッセージを無視しなければなりません。"
    },
    {
      "indent": 3,
      "text": "o Neighbor Solicitation",
      "ja": "O近隣要請"
    },
    {
      "indent": 3,
      "text": "o Neighbor Advertisement",
      "ja": "O近隣広告"
    },
    {
      "indent": 3,
      "text": "o Router Solicitation",
      "ja": "Oルーター要請"
    },
    {
      "indent": 3,
      "text": "o Router Advertisement",
      "ja": "ルータアドバタイズメントO"
    },
    {
      "indent": 3,
      "text": "o Redirect",
      "ja": "Oリダイレクト"
    },
    {
      "indent": 3,
      "text": "o Certification Path Solicitation",
      "ja": "O証明書のパス要請"
    },
    {
      "indent": 3,
      "text": "Nodes SHOULD normally process the following messages when the packets carrying them include an IPv6 Fragmentation Header:",
      "ja": "ノードは、通常、それらを運ぶパケットがIPv6断片化ヘッダーを含む以下のメッセージを処理する必要があります。"
    },
    {
      "indent": 3,
      "text": "o Certification Path Advertisement",
      "ja": "O証明経路広告"
    },
    {
      "indent": 3,
      "text": "SEND nodes SHOULD NOT employ keys that would result in fragmented CPA messages.",
      "ja": "断片化されたCPAメッセージにつながるキーを採用すべきではないノードを送信します。"
    },
    {
      "indent": 0,
      "text": "6. Operational Advice",
      "section_title": true,
      "ja": "6.運用アドバイス"
    },
    {
      "indent": 3,
      "text": "An operator detecting that Neighbor Discovery traffic is being silently dropped should find whether the corresponding Neighbor Discovery messages are employing IPv6 fragmentation. If they are, it is likely that the devices receiving such packets are silently dropping them merely because they employ IPv6 fragmentation. In such a case, an operator should check whether the sending device has an option to prevent fragmentation of ND messages, and/or see whether it is possible to reduce the options carried on such messages. We note that solving this (unlikely) problem might require a software upgrade to a version that does not employ IPv6 fragmentation with Neighbor Discovery.",
      "ja": "その近隣探索トラフィックが静かにドロップされる検出オペレータは、対応する近隣探索メッセージは、IPv6断片を用いているかどうかを見つけるべきです。彼らはしている場合、彼らがIPv6の断片化を採用しているため、このようなパケットを受信デバイスは、黙って、単にそれらをドロップしている可能性が高いです。このような場合、オペレータは、送信側デバイスはNDメッセージの断片化を防止するためのオプションを持っているかどうかを確認し、および/またはそのようなメッセージに担持されたオプションを低減することが可能であるかどうかを確認すべきです。私たちは、この（そう）の問題を解決することは近隣探索とIPv6の断片化を採用していないバージョンへのソフトウェアアップグレードを必要とするかもしれないことに注意してください。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "ja": "7.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "The IPv6 Fragmentation Header can be leveraged to circumvent network monitoring tools and current implementations of mechanisms such as RA-Guard [RA-GUARD]. By updating the relevant specifications such that the IPv6 Fragment Header is not allowed in any Neighbor Discovery messages except Certification Path Advertisement messages, protection of local nodes against Neighbor Discovery attacks, as well as the monitoring of Neighbor Discovery traffic, are greatly simplified.",
      "ja": "IPv6の断片化ヘッダは、ネットワーク監視ツールとそのようなRA-ガード[RA-GUARD]などのメカニズムの現在の実装を回避するために活用することができます。 IPv6のフラグメントヘッダが証明経路広告メッセージ、近隣探索攻撃に対するローカルノードの保護だけでなく、近隣探索トラフィックの監視以外の任意の近隣探索メッセージで許可されていないように、関連する仕様を更新することにより、大幅に簡素化されています。"
    },
    {
      "indent": 3,
      "text": "As noted in Section 3, the use of SEND could potentially result in fragmented Certification Path Advertisement messages, thus allowing an attacker to employ IPv6 fragmentation-based attacks against such messages. Therefore, to the extent that is possible, such use of fragmentation should be avoided.",
      "ja": "第3節で述べたように、SENDの使用は、潜在的にこのように、攻撃者がそのようなメッセージに対してのIPv6フラグメンテーションベースの攻撃を使用することができ、断片化された証明経路広告メッセージをもたらし得ます。そのため、可能である程度まで、断片化のような使用は避けるべきです。"
    },
    {
      "indent": 0,
      "text": "8. Acknowledgements",
      "section_title": true,
      "ja": "8.謝辞"
    },
    {
      "indent": 3,
      "text": "The author would like to thank (in alphabetical order) Mikael Abrahamsson, Ran Atkinson, Ron Bonica, Jean-Michel Combes, David Farmer, Adrian Farrel, Stephen Farrell, Roque Gagliano, Brian Haberman, Bob Hinden, Philip Homburg, Ray Hunter, Arturo Servin, Mark Smith, and Martin Stiemerling for providing valuable comments on earlier versions of this document.",
      "ja": "著者は、（アルファベット順）ミカエルAbrahamssonに感謝したいと思い、アトキンソン、ロンBonica、ジャン・ミッシェル・ザコームス、デビッド・ファーマー、エードリアンファレル、スティーブン・ファレル、ロケガリアーノ、ブライアンハーバーマン、ボブHindenとフィリップ・ホンブルク、レイ・ハンター、アルトゥーロ蘭このドキュメントの以前のバージョンで貴重なコメントを提供するためのServin、マーク・スミス、そしてマーティンStiemerling。"
    },
    {
      "indent": 3,
      "text": "The author would also like to thank Roque Gagliano for contributing the information regarding message sizes in Appendix A, and Arturo Servin for presenting this document at IETF 81.",
      "ja": "著者はまた、IETF 81でこの文書を提示するために、付録A、およびアルトゥーロServinでメッセージサイズに関する情報を貢献するためにロケガリアーノに感謝したいと思います。"
    },
    {
      "indent": 3,
      "text": "Finally, the author would like to thank his brother, friend, and colleague, Guillermo Gont, for his love and support.",
      "ja": "最後に、著者は彼の愛と支援のために、彼の兄弟、友人、同僚と、ギジェルモフォントに感謝したいと思います。"
    },
    {
      "indent": 3,
      "text": "This document resulted from the project \"Security Assessment of the Internet Protocol version 6 (IPv6)\" [CPNI-IPv6], carried out by Fernando Gont on behalf of the UK Centre for the Protection of National Infrastructure (CPNI).",
      "ja": "この文書は、国家インフラの保護のための英国センター（CPNI）に代わってフェルナンドGontによって行われたプロジェクト[CPNI-のIPv6]「インターネットプロトコルバージョン6（IPv6）のセキュリティ評価」、から生じました。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "ja": "9.参考文献"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "ja": "9.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3971] Arkko, J., Kempf, J., Zill, B., and P. Nikander, \"SEcure Neighbor Discovery (SEND)\", RFC 3971, March 2005.",
      "ja": "[RFC3971] Arkko、J.、ケンプ、J.、Zill、B.、およびP. Nikander、 \"セキュア近隣探索（SEND）\"、RFC 3971、2005年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC4861] Narten, T., Nordmark, E., Simpson, W., and H. Soliman, \"Neighbor Discovery for IP version 6 (IPv6)\", RFC 4861, September 2007.",
      "ja": "[RFC4861] Narten氏、T.、Nordmarkと、E.、シンプソン、W.、およびH.ソリマン、 \"IPバージョン6（IPv6）のための近隣探索\"、RFC 4861、2007年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC6494] Gagliano, R., Krishnan, S., and A. Kukec, \"Certificate Profile and Certificate Management for SEcure Neighbor Discovery (SEND)\", RFC 6494, February 2012.",
      "ja": "[RFC6494]ガリアーノ、R.、クリシュナン、S.、および \"セキュア近隣探索のための証明書プロファイルおよび証明書の管理（SEND）\" A. Kukec、RFC 6494、2012年2月。"
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "ja": "9.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[CPNI-IPv6] Gont, F., \"Security Assessment of the Internet Protocol version 6 (IPv6)\", UK Centre for the Protection of National Infrastructure, (available on request).",
      "ja": "[CPNI-のIPv6] Gont、F.、「インターネットプロトコルバージョン6（IPv6）のセキュリティ評価」、国家インフラの保護のための英国センター（リクエストに応じてご利用いただけます）。"
    },
    {
      "indent": 3,
      "text": "[Gont-DPSC] Gont, F., \"Results of a Security Assessment of the Internet Protocol version 6 (IPv6)\", DEEPSEC 2011 Conference, Vienna, Austria, November 2011, <http://www.si6networks.com/presentations/deepsec2011/ fgont-deepsec2011-ipv6-security.pdf>.",
      "ja": "[Gont-DPSC] Gont、F.、 \"インターネットプロトコルバージョン6（IPv6）のセキュリティ評価の結果\"、DEEPSEC 2011会議、ウィーン、オーストリア、2011年11月、<http://www.si6networks.com/presentations / deepsec2011 / fgont-deepsec2011-のipv6-security.pdf>。"
    },
    {
      "indent": 3,
      "text": "[NDPMon] SourceForge, \"NDPMon - IPv6 Neighbor Discovery Protocol Monitor\", July 2012, <http://ndpmon.sourceforge.net/>.",
      "ja": "[NDPMon] SourceForgeの、 \"NDPMon  -  IPv6近隣探索プロトコルモニター\"、2012年7月、<http://ndpmon.sourceforge.net/>。"
    },
    {
      "indent": 3,
      "text": "[RA-GUARD] Gont, F., \"Implementation Advice for IPv6 Router Advertisement Guard (RA-Guard)\", Work in Progress, November 2012.",
      "ja": "[RA-GUARD] Gont、F.、 \"IPv6ルーター広告ガード（RA-ガード）の実装のアドバイス\"、進歩、2012年11月での作業。"
    },
    {
      "indent": 3,
      "text": "[ramond] SourceForge, \"ramond\", January 2009, <http://ramond.sourceforge.net/>.",
      "ja": "[ramond] SourceForgeの、 \"ramond\"、2009年1月、<http://ramond.sourceforge.net/>。"
    },
    {
      "indent": 3,
      "text": "[RFC3756] Nikander, P., Kempf, J., and E. Nordmark, \"IPv6 Neighbor Discovery (ND) Trust Models and Threats\", RFC 3756, May 2004.",
      "ja": "[RFC3756] Nikander、P.、ケンプ、J.、およびE. Nordmarkと、 \"IPv6近隣探索（ND）信頼モデルと脅威\"、RFC 3756、2004年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC6104] Chown, T. and S. Venaas, \"Rogue IPv6 Router Advertisement Problem Statement\", RFC 6104, February 2011.",
      "ja": "[RFC6104]のchown、T.とS. Venaas、 \"ローグのIPv6ルータアドバタイズメントの問題に関する声明\"、RFC 6104、2011年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC6105] Levy-Abegnoli, E., Van de Velde, G., Popoviciu, C., and J. Mohacsi, \"IPv6 Router Advertisement Guard\", RFC 6105, February 2011.",
      "ja": "[RFC6105]レヴィ -  Abegnoli、E.、ヴァン・デ・ヴェルデ、G.、Popoviciu、C.、およびJ. Mohacsi、 \"IPv6ルーター広告ガード\"、RFC 6105、2011年2月。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Message Size When Carrying Certificates",
      "ja": "付録A.メッセージサイズの証明書キャリング"
    },
    {
      "indent": 3,
      "text": "This section aims at estimating the size of normal Certification Path Advertisement messages.",
      "ja": "このセクションでは、通常の証明のパス広告メッセージのサイズを推定することを目指しています。"
    },
    {
      "indent": 3,
      "text": "Considering a Certification Path Advertisement (CPA) such as that of Appendix C of [RFC3971] (certification path length of 4, between 1 and 4 address prefix extensions, and a key length of 1024 bits), the certificate lengths range between 864 and 888 bytes (and the corresponding Ethernet packets from 1050 to 1066 bytes) [RFC3971].",
      "ja": "そのような付録C [RFC3971]（4の認証パスの長さ、1〜4アドレスプレフィックス拡張、及び1024ビットの鍵長）のものと証明経路広告（CPA）を考慮すると、証明書の長さは、864と888の間の範囲バイト（1050から1066のバイトに対応するイーサネットパケット）[RFC3971]。"
    },
    {
      "indent": 3,
      "text": "Updating the aforementioned packet size to account for the larger (2048 bits) keys required by [RFC6494] results in packet sizes ranging from 1127 to 1238 bytes, which are smaller than the minimum IPv6 MTU (1280 bytes) and much smaller than the ubiquitous Ethernet MTU (1500 bytes).",
      "ja": "最小のIPv6 MTU（1280バイト）よりも小さく、ユビキタスイーサネット（登録商標）よりもはるかに小さく、1127から1238バイトまでの範囲のパケットサイズに[RFC6494]の結果によって必要に大きい（2048ビット）のキーを考慮するために、前述のパケット・サイズを更新しますMTU（1500バイト）。"
    },
    {
      "indent": 3,
      "text": "However, we note that packet sizes may vary depending on a number of factors, including:",
      "ja": "しかし、我々は、パケットサイズを含む多くの要因に応じて変化しうることに注意してください。"
    },
    {
      "indent": 3,
      "text": "o the number of prefixes included in the certificate",
      "ja": "証明書に含まれるプレフィックスの数O"
    },
    {
      "indent": 3,
      "text": "o the length of Fully Qualified Domain Names (FQDNs) in Trust Anchor (TA) options [RFC3971] (if present)",
      "ja": "トラストアンカー（TA）オプション[RFC3971]（存在する場合）に完全修飾ドメイン名（FQDN）の長さはO"
    },
    {
      "indent": 3,
      "text": "If larger key sizes (e.g., 4096 bits) are required in the future, a larger MTU size might be required to convey such information in Neighbor Discovery packets without the need to employ fragmentation.",
      "ja": "大きいキーのサイズ（例えば、4096ビット）は、将来必要とされる場合、より大きなMTUサイズがフラグメンテーションを使用することなく近隣探索パケットでそのような情報を伝えるために必要とされるかもしれません。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Fernando Gont SI6 Networks / UTN-FRH Evaristo Carriego 2644 Haedo, Provincia de Buenos Aires 1706 Argentina",
      "ja": "フェルナンドGont SI6ネットワーク/ UTN-FRHエバリスト・キャリエゴ2644 Haedo、1706ブエノスアイレス州アルゼンチン"
    },
    {
      "indent": 3,
      "text": "Phone: +54 11 4650 8472 EMail: fgont@si6networks.com URI: http://www.si6networks.com",
      "ja": "電話：+54 11 4650 8472 Eメール：fgont@si6networks.com URI：http://www.si6networks.com"
    }
  ]
}