{
  "title": {
    "text": "RFC 6185 - RTP Payload Format for H.264 Reduced-Complexity Decoding Operation (RCDO) Video",
    "ja": "RFC 6185 - H.264削減、複雑性復号動作（RCDO）ビデオのためのRTPペイロードフォーマット"
  },
  "number": 6185,
  "created_at": "2019-10-29 13:38:16.203029+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                     T. Kristensen\nRequest for Comments: 6185                                      P. Luthi\nCategory: Standards Track                                       TANDBERG\nISSN: 2070-1721                                                 May 2011",
      "raw": true
    },
    {
      "indent": 8,
      "text": "                 RTP Payload Format for\nH.264 Reduced-Complexity Decoding Operation (RCDO) Video",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document describes an RTP payload format for the Reduced-Complexity Decoding Operation (RCDO) for H.264 Baseline profile bitstreams, as specified in ITU-T Recommendation H.241. RCDO reduces the decoding cost and resource consumption of the video processing. The RCDO RTP payload format is based on the H.264 RTP payload format.",
      "ja": "ITU-T勧告H.241に指定され、この文書は、H.264ベースラインプロファイルビットストリームに対して減少複雑復号動作（RCDO）のためのRTPペイロードフォーマットを記述する。 RCDOは、ビデオ処理のデコードコストとリソースの消費を削減します。 RCDO RTPペイロードフォーマットは、H.264 RTPペイロードフォーマットに基づいています。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6185.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6185で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2011 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2011 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 3,
      "text": "This document may contain material from IETF Documents or IETF Contributions published or made publicly available before November 10, 2008. The person(s) controlling the copyright in some of this material may not have granted the IETF Trust the right to allow modifications of such material outside the IETF Standards Process. Without obtaining an adequate license from the person(s) controlling the copyright in such materials, this document may not be modified outside the IETF Standards Process, and derivative works of it may not be created outside the IETF Standards Process, except to format it for publication as an RFC or to translate it into languages other than English.",
      "ja": "この材料の一部がIETFトラストにこのような材料の変更を許可する権利を与えられていない可能性がありますにこの文書は、2008年、IETFドキュメントまたは11月10日以前に発行または公開さIETF貢献から著作権を支配する者（複数可）材料を含んでいてもよいですIETF標準化プロセスの外。そのような材料の著作権を管理者（単数または複数）から適切なライセンスを取得することなく、この文書は、IETF標準化過程の外側修正されないかもしれません、そして、それの派生物は、IETF標準化過程の外側に作成されない場合があり、それをフォーマットする以外出版RFCとして、英語以外の言語に翻訳します。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  2\n2.  Conventions Used in This Document  . . . . . . . . . . . . . .  3\n3.  Media Format Background  . . . . . . . . . . . . . . . . . . .  3\n4.  Payload Format . . . . . . . . . . . . . . . . . . . . . . . .  3\n5.  Congestion Control Considerations  . . . . . . . . . . . . . .  3\n6.  Payload Format Parameters  . . . . . . . . . . . . . . . . . .  3\n  6.1.  Media Type Definition  . . . . . . . . . . . . . . . . . .  4\n7.  Mapping to SDP . . . . . . . . . . . . . . . . . . . . . . . . 19\n  7.1.  Offer/Answer Considerations  . . . . . . . . . . . . . . . 20\n  7.2.  Declarative SDP Considerations . . . . . . . . . . . . . . 20\n8.  IANA Considerations  . . . . . . . . . . . . . . . . . . . . . 20\n9.  Security Considerations  . . . . . . . . . . . . . . . . . . . 20\n10. Acknowledgements . . . . . . . . . . . . . . . . . . . . . . . 21\n11. References . . . . . . . . . . . . . . . . . . . . . . . . . . 21\n  11.1. Normative References . . . . . . . . . . . . . . . . . . . 21\n  11.2. Informative References . . . . . . . . . . . . . . . . . . 21",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "ITU-T Recommendation H.241 [3] specifies a Reduced-Complexity Decoding Operation (RCDO) for use with H.264 [2] Baseline profile bitstreams. It also specifies a bitstream constraint associated with RCDO and a mechanism for signaling RCDO within the bitstream. The RCDO signaling indicates that the bitstream conforms to the bitstream constraint and that the decoder shall apply the RCDO decoding process to the bitstream.",
      "ja": "ITU-T勧告H.241 [3] 264 [2]ベースラインプロファイルビットストリームと共に使用するための削減複雑復号動作（RCDO）を指定します。それはまた、RCDOビットストリーム内RCDOをシグナリングするための機構に関連したビットストリームの制約を指定します。 RCDOシグナリングは、ビットストリームは、ビットストリームの制約に準拠し、デコーダがビットストリームにRCDO復号処理を適用しなければならないことをことを示しています。"
    },
    {
      "indent": 3,
      "text": "RCDO for H.264 offers a solution to support higher resolutions at the same high frame rates used in current implementations. This is achieved by reducing the processing requirements and thus reducing the decoding cost/resource consumption of the video processing.",
      "ja": "H.264のためのRCDOは、現在の実装で使用したのと同じ高フレームレートで高解像度をサポートするためのソリューションを提供しています。これは、処理要件を低減し、従って、映像処理の復号化コスト/リソース消費を低減することによって達成されます。"
    },
    {
      "indent": 3,
      "text": "This document defines media type parameters and allows use in systems based on the Session Description Protocol (SDP) [8] for signaling.",
      "ja": "この文書は、シグナリングのために[8]メディアタイプパラメータを定義し、セッション記述プロトコル（SDP）に基づくシステムでの使用を可能にします。"
    },
    {
      "indent": 0,
      "text": "2. Conventions Used in This Document",
      "section_title": true,
      "ja": "この文書で使用される2.表記"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [4].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[4]で説明されるように解釈されます。"
    },
    {
      "indent": 0,
      "text": "3. Media Format Background",
      "section_title": true,
      "ja": "3. Media形式の背景"
    },
    {
      "indent": 3,
      "text": "The Reduced-Complexity Decoding Operation (RCDO) for H.264 Baseline profile bitstreams is specified in Annex B of H.241 [3]. RCDO is specified as a separate H.264 mode and is distinct from any profile defined in H.264. An RCDO bitstream obeys all the constraints of the Baseline profile.",
      "ja": "低減複雑復号動作（RCDO）H.264ベースラインプロファイルビットストリームのための[3] H.241の付属書Bで指定されています。 RCDOは別個H.264モードとして指定され、264で定義されたプロファイルとは区別されます。 RCDOビットストリームは、ベースラインプロファイルのすべての制約に従います。"
    },
    {
      "indent": 3,
      "text": "The media format is based on the H.264 RTP payload format as specified in RFC 6184 [1]. Therefore, RFC 6184 constitutes the basis for this document and is referred to several times.",
      "ja": "RFC 6184で指定されたメディアフォーマットは、H.264 RTPペイロードフォーマットに基づいている[1]。したがって、RFC 6184は、この文書のための基礎を構成し、複数回呼ばれます。"
    },
    {
      "indent": 3,
      "text": "In order to signal H.264 additional modes, Table 8-13 of H.241 [3] specifies an AdditionalModesSupported parameter. Currently, the only additional mode defined is RCDO.",
      "ja": "264追加のモードをシグナリングするために、H.241の表8-13 [3] AdditionalModesSupportedパラメータを指定します。現在、定義された唯一の追加モードがRCDOです。"
    },
    {
      "indent": 6,
      "text": "Informative note: Other additional modes may be defined in the future. H.264 additional modes may or may not be distinct from the profiles in H.264.",
      "ja": "有益な注意：他の追加のモードは、将来的に定義されてもよいです。 264追加のモードは、OR 264内のプロファイルとは別個であってもなくてもよいです。"
    },
    {
      "indent": 3,
      "text": "A separate media subtype, named H264-RCDO, is defined to ensure backward compatibility with deployed implementations of H.264.",
      "ja": "H264-RCDO名前別のメディアサブタイプは、H.264の展開の実装との下位互換性を確保するために定義されています。"
    },
    {
      "indent": 0,
      "text": "4. Payload Format",
      "section_title": true,
      "ja": "4.ペイロードフォーマット"
    },
    {
      "indent": 3,
      "text": "The payload format defined in Section 5 of RFC 6184 [1] SHALL be used. This includes the RTP header usage and the payload format in RFC 6184. Examples of typical RTP packets can be found in RFC 6184.",
      "ja": "RFC 6184のセクション5で定義されたペイロードフォーマット[1]を使用しなければなりません。これは、RTPヘッダの使用と、典型的なRTPパケットの6184.としては、RFC 6184に見出すことができるRFCにおけるペイロードフォーマットを含みます。"
    },
    {
      "indent": 0,
      "text": "5. Congestion Control Considerations",
      "section_title": true,
      "ja": "5.輻輳制御に関する注意事項"
    },
    {
      "indent": 3,
      "text": "Congestion control for RTP SHALL be used in accordance with RFC 3550 [6] and with any applicable RTP profile, e.g., RFC 3551 [7]. If best-effort service is being used, users of this payload format SHALL monitor packet loss to ensure that the packet loss rate is within acceptable parameters.",
      "ja": "RTPのための輻輳制御は、RFC 3550に従って使用されるもの[6]、該当RTPプロファイルで、例えば、RFC 3551 [7]。ベストエフォート型のサービスが使用されている場合は、このペイロード形式のユーザーは、パケット損失率が許容パラメータの範囲内であることを保証するために、パケット損失を監視しなければなりません。"
    },
    {
      "indent": 0,
      "text": "6. Payload Format Parameters",
      "section_title": true,
      "ja": "6.ペイロードフォーマットのパラメータ"
    },
    {
      "indent": 3,
      "text": "This RTP payload format is identified using the H264-RCDO media subtype, which is registered in accordance with RFC 4855 [10], and using the template of RFC 4288 [13].",
      "ja": "このRTPペイロードフォーマットは、RFC 4855 [10]に応じて登録されてH264-RCDOメディアサブタイプを使用して、およびRFC 4288 [13]のテンプレートを用いて同定されます。"
    },
    {
      "indent": 0,
      "text": "6.1. Media Type Definition",
      "section_title": true,
      "ja": "6.1. メディアタイプの定義"
    },
    {
      "indent": 6,
      "text": "Informative note: The media subtype definition for H264-RCDO is\nbased on the definition of the H264 media subtype as specified in\nSection 8.1 of RFC 6184 [1].  Except for the profile-level-id\nparameter, for which new semantics are specified below, the\noptional parameters are copied from RFC 6184 [1] in order to\nprovide a complete, self-contained media subtype registration to\nIANA.  The references are updated to match the numbering used in\nthis document.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The media subtype for RCDO for H.264 has been allocated from the IETF tree.",
      "ja": "H.264のためのRCDOのためのメディアサブタイプは、IETF木から割り当てられています。"
    },
    {
      "indent": 3,
      "text": "Type name: video",
      "ja": "型名：ビデオ"
    },
    {
      "indent": 3,
      "text": "Subtype name: H264-RCDO",
      "ja": "サブタイプ名：H264-RCDO"
    },
    {
      "indent": 3,
      "text": "Required parameters:",
      "ja": "必須パラメータ："
    },
    {
      "indent": 3,
      "text": "rate: Indicates the RTP timestamp clock rate. The rate value MUST be 90000.",
      "ja": "レートは：RTPタイムスタンプのクロック・レートを示します。レート値は90000でなければなりません。"
    },
    {
      "indent": 3,
      "text": "Optional parameters:",
      "ja": "オプションのパラメータ："
    },
    {
      "indent": 3,
      "text": "profile-level-id: A base16 RFC 4648 [9] (hexadecimal) representation of the following three bytes in the sequence parameter set NAL unit is specified in H.264 [2]: 1) profile_idc, 2) a byte herein referred to as profile-iop, composed of the values of constraint_set0_flag, constraint_set1_flag, constraint_set2_flag, constraint_set3_flag, constraint_set4_flag, constraint_set5_flag, and reserved_zero_2bits in bit-significance order, starting from the most-significant bit, and 3) level_idc. Note that reserved_zero_2bits is required to be equal to 0 in H.264 [2], but other values for it may be specified in the future by ITU-T or ISO/IEC.",
      "ja": "プロファイルレベルID：NALユニットが264で指定されたシーケンス・パラメータ・セットの次の3バイトのbase16のRFC 4648 [9]（16進数）表現[2]：1参照）profile_idc、2）バイト本明細書プロファイルIOPとして、constraint_set0_flag、constraint_set1_flag、constraint_set2_flag、constraint_set3_flag、constraint_set4_flag、constraint_set5_flag、ビット・シグニフィカンス順にreserved_zero_2bits、最上位ビットから出発し、そして3）level_idcの値からなります。 reserved_zero_2bits 264 [2]は0に等しいことが必要であることに注意し、それに対する他の値は、ITU-TやISO / IECによる将来に指定されてもよいです。"
    },
    {
      "indent": 6,
      "text": "The profile-level-id parameter indicates the default sub-profile (i.e., the subset of coding tools that may have been used to generate the stream or that the receiver supports) and the default level of the stream or the receiver supports.",
      "ja": "プロファイルレベル-idパラメータは、デフォルトのサブプロファイルを示している（すなわち、ストリームを生成するために使用される、または受信機がサポートしていることをされていてもよい符号化ツールのサブセット）と、ストリームのデフォルトレベルまたは受信機がサポートしています。"
    },
    {
      "indent": 6,
      "text": "RCDO is distinct from any profile; this implies that the profile value 0 (no profile) and the profile_idc byte of the profile-level-id parameter are equal to 0. An RCDO bitstream MUST obey all the constraints of the Baseline profile. Therefore, only constraint_set0_flag is equal to 1 in the profile-iop part of the profile-level-id parameter; the remaining bits are set to 0.",
      "ja": "RCDOは、任意のプロファイルから区別されます。これは、プロファイル値0（なしプロファイル）とプロファイルレベルIDパラメータのprofile_idcバイトが基準プロファイルのすべての制約に従わなければならない0アンRCDOビットストリームに等しいことを意味します。したがって、唯一constraint_set0_flagは、プロファイルレベルIDパラメータのプロファイルIOP部分的に1に等しいです。残りのビットは0に設定されています。"
    },
    {
      "indent": 6,
      "text": "If the profile-level-id parameter is used to indicate properties of a NAL unit stream, it indicates that, to decode the stream, the minimum subset of coding tools a decoder has to support is the default sub-profile, and the lowest level the decoder has to support is the default level.",
      "ja": "プロファイルレベルIDパラメータは、NALユニットストリームの特性を示すために使用される場合、それはストリームを復号化する、ことを示し、デコーダがサポートしなければならない符号化ツールの最小サブセットは、デフォルトのサブプロファイル、および最低レベルでありますデコーダはサポートしなければ、デフォルトのレベルです。"
    },
    {
      "indent": 6,
      "text": "If the profile-level-id parameter is used for capability exchange or session setup, it indicates the subset of coding tools, which is equal to the default sub-profile, that the codec supports for both receiving and sending. If max-recv-level is not present, the default level from profile-level-id indicates the highest level the codec wishes to support. If max-recv-level is present, it indicates the highest level the codec supports for receiving. For either receiving or sending, all levels that are lower than the highest level supported MUST also be supported.",
      "ja": "プロファイルレベル-idパラメータは、能力交換、またはセッションセットアップのために使用されている場合は、コーデックが、受信と送信の両方のためにサポートされている、既定のサブプロファイルに等しく、符号化ツールのサブセットを示します。 MAX-RECVレベルが存在しない場合、プロファイル・レベル-IDからデフォルトのレベルはコーデックがサポートすることを希望する最高レベルを示します。 MAX-RECVレベルが存在する場合、それはコーデックを受信するためにサポートしている最高レベルを示しています。受信または送信のいずれかのために、サポートされている最高レベルよりも低いすべてのレベルもサポートしなければなりません。"
    },
    {
      "indent": 6,
      "text": "For example, if a codec supports level 1.3, the profile-level-id becomes 00800d, in which 00 indicates the \"no profile\" value, 80 indicates the constraints of the Baseline profile, and 0d indicates level 1.3. When level 2.1 is supported, the profile-level-id becomes 008015.",
      "ja": "コーデックは、レベル1.3をサポートしている場合、例えば、プロファイルレベルIDが80、ベースラインプロファイルの制約を示し、0D、レベル1.3を示し、00が「NOプロファイル」値を示している00800dと、となります。レベル2.1がサポートされている場合、プロファイルレベルIDが008015になります。"
    },
    {
      "indent": 6,
      "text": "If no profile-level-id is present, level 1 (i.e., equivalent to profile-level-id 00800a) MUST be implied.",
      "ja": "何プロファイルレベルIDが存在しない場合、レベル1（プロファイルレベルIDの00800aに、すなわち、等価）が暗示されなければなりません。"
    },
    {
      "indent": 9,
      "text": "Informative note: The definitions of the remaining optional parameters below are copied verbatim from Section 8.1 of RFC 6184 [1]. Only the references are updated to match the numbering used in this document.",
      "ja": "有益注：以下の残りのオプションパラメータの定義は、RFC 6184のセクション8.1からそのままコピーされている[1]。唯一の参照は、このドキュメントで使用される番号と一致するように更新されます。"
    },
    {
      "indent": 3,
      "text": "max-recv-level: This parameter MAY be used to indicate the highest level a receiver supports when the highest level is higher than the default level (the level indicated by profile-level-id). The value of max-recv-level is a base16 (hexadecimal) representation of the two bytes after the syntax element profile_idc in the sequence parameter set NAL unit specified in H.264 [2]: profile-iop (as defined above) and level_idc. If the level_idc byte of max-recv-level is equal to 11 and bit 4 of the profile-iop byte of max-recv-level is equal to 1 or if the level_idc byte of max-recv-level is equal to 9 and bit 4 of the profile-iop byte of max-recv-level is equal to 0, the highest level the receiver supports is Level 1b. Otherwise, the highest level the receiver supports is equal to the level_idc byte of max-recv-level divided by 10.",
      "ja": "MAX-recvをレベル：このパラメータは、最高レベルが既定レベル（プロファイルレベルIDが示すレベル）よりも高い場合、受信機がサポートする最高レベルを示すために使用され得ます。プロファイルIOPを（上記で定義した通り）とlevel_idc：MAX-RECVレベルの値は、構文要素264で指定されたシーケンスパラメータセットNALユニットにおけるprofile_idc [2]後に2バイトのbase16（16進数）であります。 MAX-RECVレベルのlevel_idcバイトが11とMAX-RECVレベルのプロファイルIOPバイトのビット4に等しい場合、1に等しいか又はMAX-RECVレベルのlevel_idcバイトは9ビットに等しい場合MAX-RECVレベルのプロファイルIOPバイトの4が0である、受信機がサポートする最高レベルはレベル1Bあります。そうでなければ、受信機がサポートする最高レベルは10で割ったMAX-RECVレベルのlevel_idcバイトに等しいです。"
    },
    {
      "indent": 6,
      "text": "max-recv-level MUST NOT be present if the highest level the receiver supports is not higher than the default level.",
      "ja": "受信機がサポートする最高レベルがデフォルトレベルよりも高くない場合のmax-recvのレベルが存在してはなりません。"
    },
    {
      "indent": 3,
      "text": "max-mbps, max-smbps, max-fs, max-cpb, max-dpb, and max-br: These parameters MAY be used to signal the capabilities of a receiver implementation. These parameters MUST NOT be used for any other purpose. The highest level conveyed in the value of the profile-level-id parameter or the max-recv-level parameter MUST be such that the receiver is fully capable of supporting. max-mbps, max-smbps, max-fs, max-cpb, max-dpb, and max-br MAY be used to indicate capabilities of the receiver that extend the required capabilities of the signaled highest level, as specified below.",
      "ja": "MAX-Mbpsの、MAX-smbps、MAX-FS、MAX-CPB、MAX-DPB、およびMAX-BR：これらのパラメータは、受信機の実装の機能を知らせるために使用されるかもしれません。これらのパラメータは、他の目的に使用してはいけません。プロファイルレベルIDパラメータまたはMAX-RECVレベルパラメータの値に搬送最高レベルは、受信機がサポートする完全に可能であるようなものでなければなりません。 MAX-Mbpsの、MAX-smbps、MAX-FS、MAX-CPB、MAX-DPB、およびMAX-BRは、以下に指定されるように、シグナリング最高レベルの必要な機能を拡張する受信機の能力を示すために使用され得ます。"
    },
    {
      "indent": 6,
      "text": "When more than one parameter from the set (max-mbps, max-smbps, max-fs, max-cpb, max-dpb, max-br) is present, the receiver MUST support all signaled capabilities simultaneously. For example, if both max-mbps and max-br are present, the signaled highest level with the extension of both the frame rate and bitrate is supported. That is, the receiver is able to decode NAL unit streams in which the macroblock processing rate is up to max-mbps (inclusive), the bitrate is up to max-br (inclusive), the coded picture buffer size is derived as specified in the semantics of the max-br parameter below, and the other properties comply with the highest level specified in the value of the profile-level-id parameter or the max-recv-level parameter.",
      "ja": "セット（MAX-Mbpsの、MAX-smbps、MAX-FS、MAX-CPB、MAX-DPB、MAX-BR）から複数のパラメータが存在する場合、受信機は、全てが同時に機能を合図サポートしなければなりません。 MAX-MbpsおよびMAX-BRの両方が存在する場合、例えば、フレームレート及びビットレートの両方の拡張子を持つシグナリング最高レベルがサポートされています。すなわち、受信機は、ビットレートがMAX-BR（含む）までの、符号化ピクチャバッファサイズが指定ように導出されるマクロブロックの処理速度は（含む）MAX-Mbpsの最大であるNALユニットストリームを復号することができる、あります以下MAX-BRパラメータのセマンティクス、および他の特性は、プロファイルレベルIDパラメータまたはMAX-RECVレベルパラメータの値で指定された最高レベルに準拠します。"
    },
    {
      "indent": 6,
      "text": "If a receiver can support all the properties of Level A, the highest level specified in the value of the profile-level-id parameter or the max-recv-level parameter MUST be Level A (i.e., MUST NOT be lower than Level A). In other words, a receiver MUST NOT signal values of max-mbps, max-fs, max-cpb, max-dpb, and max-br that taken together meet the requirements of a higher level compared to the highest level specified in the value of the profile-level-id parameter or the max-recv-level parameter.",
      "ja": "受信機は、レベルAのすべてのプロパティをサポートできる場合、プロファイルレベルIDパラメータまたはMAX-RECVレベルパラメータの値に指定された最高レベルはレベルA（すなわち、レベルAよりも低くてはいけません）でなければなりません。換言すれば、受信機は、MAX-Mbpsの、MAX-FSの値を通知してはいけません、一緒になってMAX-CPB、MAX-DPB、およびMAX-BRの値で指定された最高レベルと比較して高いレベルの要件を満たしますプロファイルレベルIDパラメータまたはMAX-RECVレベルパラメータ。"
    },
    {
      "indent": 9,
      "text": "Informative note: When the OPTIONAL media type parameters are used to signal the properties of a NAL unit stream, max-mbps, max-smbps, max-fs, max-cpb, max-dpb, and max-br are not present, and the value of profile-level-id must always be such that the NAL unit stream complies fully with the specified profile and level.",
      "ja": "有益注：オプションのメディアタイプパラメータは、NALユニットストリームの特性、MAX-Mbpsの、MAX-smbps、MAX-FS、MAX-CPB、MAX-DPB、およびMAX-BRを知らせるために使用されて存在せず、そしてプロファイルレベルIDの値は常にNALユニットストリームは、指定されたプロファイルとレベルで完全に準拠しようなものでなければなりません。"
    },
    {
      "indent": 3,
      "text": "max-mbps: The value of max-mbps is an integer indicating the maximum macroblock processing rate in units of macroblocks per second. The max-mbps parameter signals that the receiver is capable of decoding video at a higher rate than is required by the signaled highest level conveyed in the value of the profile-level-id parameter or the max-recv-level parameter. When max-mbps is signaled, the receiver MUST be able to decode NAL unit streams that conform to the signaled highest level, with the exception that the MaxMBPS value in Table A-1 of H.264 [2] for the signaled",
      "ja": "MAX-Mbpsの：MAX-Mbpsでの値は、毎秒マクロブロック単位で最大マクロブロック処理率を示す整数です。受信機は、プロファイルレベルIDパラメータまたはMAX-RECVレベルパラメータの値に搬送シグナリング最高レベルで必要とされるよりも速い速度でビデオを復号化することが可能な最大Mbpsのパラメータ信号。 MAX-Mbpsのが通知されたとき、受信機は、表A-1 264の中MaxMBPS値ことを除いて、シグナリング最高レベルに適合NALユニットストリームをデコードできなければならない[2]のシグナリングのために"
    },
    {
      "indent": 6,
      "text": "highest level is replaced with the value of max-mbps. The value of max-mbps MUST be greater than or equal to the value of MaxMBPS given in Table A-1 of H.264 [2] for the highest level. Senders MAY use this knowledge to send pictures of a given size at a higher picture rate than is indicated in the signaled highest level.",
      "ja": "最高レベルはMAX-Mbpsでの値に置き換えられます。 MAX-Mbpsでの値がより大きいか又は表A-1 264 [2]のための最高レベルの中で与えられたMaxMBPSの値に等しくなければなりません。送信者は、合図最高レベルで示されているよりも高いピクチャレートで指定されたサイズの画像を送信するためにこの知識を使用するかもしれません。"
    },
    {
      "indent": 3,
      "text": "max-smbps: The value of max-smbps is an integer indicating the maximum static macroblock processing rate in units of static macroblocks per second, under the hypothetical assumption that all macroblocks are static macroblocks. When max-smbps is signaled, the MaxMBPS value in Table A-1 of H.264 [2] should be replaced with the result of the following computation:",
      "ja": "MAX-smbps：MAX-smbpsの値は、すべてのマクロブロックが静的マクロブロックであることを仮定の仮定の下で、毎秒静的マクロブロック単位で最大静的マクロブロック処理率を示す整数です。 MAX-smbpsが通知された場合に、表A-1 264の中MaxMBPS値[2]次の計算の結果に置き換えなければなりません。"
    },
    {
      "indent": 6,
      "text": "o If the parameter max-mbps is signaled, set a variable MaxMacroblocksPerSecond to the value of max-mbps. Otherwise, set MaxMacroblocksPerSecond equal to the value of MaxMBPS in Table A-1 of H.264 [2] for the signaled highest level conveyed in the value of the profile-level-id parameter or the max-recv-level parameter.",
      "ja": "パラメータMAX-Mbpsのが通知された場合は、O、MAX-Mbpsでの値に変数MaxMacroblocksPerSecondを設定。そうでなければ、プロファイルレベルIDパラメータまたはMAX-RECVレベルパラメータの値に搬送シグナリング最高レベル[2]表A-1 264の中MaxMBPSの値に等しいMaxMacroblocksPerSecondを設定。"
    },
    {
      "indent": 6,
      "text": "o Set a variable P_non-static to the proportion of non-static macroblocks in picture n.",
      "ja": "Oピクチャnの非静的マクロブロックの割合にP_non静的変数を設定します。"
    },
    {
      "indent": 6,
      "text": "o Set a variable P_static to the proportion of static macroblocks in picture n.",
      "ja": "Oピクチャnの静的マクロブロックの割合を可変P_staticを設定します。"
    },
    {
      "indent": 6,
      "text": "o The value of MaxMBPS in Table A-1 of H.264 [2] should be considered by the encoder to be equal to:",
      "ja": "表A-1 264の中MaxMBPSの値O [2]に等しくなるようにエンコーダによって考慮されるべきです。"
    },
    {
      "indent": 9,
      "text": "MaxMacroblocksPerSecond * max-smbps / (P_non-static * max-smbps + P_static * MaxMacroblocksPerSecond)",
      "ja": "MaxMacroblocksPerSecond * MAX-smbps /（P_non-静的* MAX-smbps + P_static * MaxMacroblocksPerSecond）"
    },
    {
      "indent": 6,
      "text": "The encoder should recompute this value for each picture. The value of max-smbps MUST be greater than or equal to the value of MaxMBPS given explicitly as the value of the max-mbps parameter or implicitly in Table A-1 of H.264 [2] for the signaled highest level. Senders MAY use this knowledge to send pictures of a given size at a higher picture rate than is indicated in the signaled highest level.",
      "ja": "エンコーダは、ピクチャ毎にこの値を再計算すべきです。 MAX-smbpsの値が通知最高レベル[2]よりも大きいかまたは最大Mbpsのパラメータの値として、または暗黙的に、表A-1 264の中で明示的に指定MaxMBPSの値に等しくなければなりません。送信者は、合図最高レベルで示されているよりも高いピクチャレートで指定されたサイズの画像を送信するためにこの知識を使用するかもしれません。"
    },
    {
      "indent": 3,
      "text": "max-fs: The value of max-fs is an integer indicating the maximum frame size in units of macroblocks. The max-fs parameter signals that the receiver is capable of decoding larger picture sizes than are required by the signaled highest level conveyed in the value of the profile-level-id parameter or the max-recv-level parameter. When max-fs is signaled, the receiver MUST be able to decode NAL unit streams that conform to the signaled highest level, with the exception that the MaxFS value in Table A-1 of H.264 [2] for the signaled highest level is replaced with the value of max-fs. The value of max-fs MUST be greater than or equal to the value of MaxFS given in Table A-1 of H.264 [2] for the highest level. Senders MAY use this knowledge to send larger pictures at a proportionally lower frame rate than is indicated in the signaled highest level.",
      "ja": "MAX-FS：MAX-FSの値は、マクロブロック単位での最大フレームサイズを示す整数です。受信機は、プロファイルレベルIDパラメータまたはMAX-RECVレベルパラメータの値に搬送シグナリング最高レベルで必要とされるよりも大きな画像サイズを復号することが可能であるMAX-FSパラメータ信号。 MAX-FSが通知されたとき、受信機は、[2]のシグナリング最高レベルのためであり、表A-1 264の中MaxFS値ことを除いて、シグナリング最高レベルに適合NALユニットストリームをデコードできなければなりませんMAX-FSの値に置き換え。 MAX-FSの値がより大きいか最も高いレベルは、表A-1 264 [2]の中で与えられたMaxFSの値に等しくなければなりません。送信者が通知最高レベルで示されているよりも比例的に低いフレームレートで、より大きな画像を送信するためにこの知識を使用するかもしれません。"
    },
    {
      "indent": 3,
      "text": "max-cpb: The value of max-cpb is an integer indicating the maximum coded picture buffer size in units of 1000 bits for the VCL HRD parameters and in units of 1200 bits for the NAL HRD parameters. Note that this parameter does not use units of cpbBrVclFactor and cpbBrNALFactor (see Table A-1 of H.264 [2]). The max-cpb parameter signals that the receiver has more memory than the minimum amount of coded picture buffer memory required by the signaled highest level conveyed in the value of the profile-level-id parameter or the max-recv-level parameter. When max-cpb is signaled, the receiver MUST be able to decode NAL unit streams that conform to the signaled highest level, with the exception that the MaxCPB value in Table A-1 of H.264 [2] for the signaled highest level is replaced with the value of max-cpb (after taking cpbBrVclFactor and cpbBrNALFactor into consideration when needed). The value of max-cpb (after taking cpbBrVclFactor and cpbBrNALFactor into consideration when needed) MUST be greater than or equal to the value of MaxCPB given in Table A-1 of H.264 [2] for the highest level. Senders MAY use this knowledge to construct coded video streams with greater variation of bitrate than can be achieved with the MaxCPB value in Table A-1 of H.264 [2].",
      "ja": "MAX-CPB：MAX-CPBの値は、VCL HRDパラメータの1000ビットの単位とNAL HRDパラメータ1200ビット単位で最大符号化ピクチャバッファサイズを示す整数です。このパラメータは、（表A-1 264の[2]を参照されたい）cpbBrVclFactorとcpbBrNALFactorの単位を使用しないことに留意されたいです。受信機は、プロファイルレベルIDパラメータまたはMAX-RECVレベルパラメータの値に搬送シグナリング最高レベルで必要とされる符号化ピクチャバッファメモリの最小量よりも多くのメモリを有しているMAX-CPBパラメータ信号。 MAX-CPBが通知されたとき、受信機は、[2]のシグナリング最高レベルのためであり、表A-1 264の中MaxCPB値ことを除いて、シグナリング最高レベルに適合NALユニットストリームをデコードできなければなりませんMAX-CPBの値に置き換え（必要なときに考慮cpbBrVclFactorとcpbBrNALFactorを取った後）。 （必要なときに考慮cpbBrVclFactorとcpbBrNALFactor服用後）MAX-CPBの値は、表A-1 264の[2]の最高レベルで与えられたMaxCPBの値より大きいか等しくなければなりません。送信者は、表A-1 264 [2]の中MaxCPB値で達成できるよりもビットレートの大きな変化に符号化されたビデオストリームを構築するためにこの知識を使用するかもしれません。"
    },
    {
      "indent": 9,
      "text": "Informative note: The coded picture buffer is used in the\nhypothetical reference decoder (Annex C of H.264).  The use of\nthe hypothetical reference decoder is recommended in H.264\nencoders to verify that the produced bitstream conforms to the\nstandard and to control the output bitrate.  Thus, the coded\npicture buffer is conceptually independent of any other\npotential buffers in the receiver, including de-interleaving\nand de-jitter buffers.  The coded picture buffer need not be\nimplemented in decoders as specified in Annex C of H.264, but\nrather standard-compliant decoders can have any buffering\narrangements provided that they can decode standard-compliant\nbitstreams.  Thus, in practice, the input buffer for a video\ndecoder can be integrated with de-interleaving and de-jitter\nbuffers of the receiver.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "max-dpb: The value of max-dpb is an integer indicating the maximum decoded picture buffer size in units of 8/3 macroblocks. The max-dpb parameter signals that the receiver has more memory than the minimum amount of decoded picture buffer memory required by the signaled highest level conveyed in the value of the profile-level-id parameter or the max-recv-level parameter. When max-dpb is signaled, the receiver MUST be able to decode NAL unit streams that conform to the signaled highest level, with the exception that the MaxDpbMbs value in Table A-1 of H.264 [2] for the signaled highest level is replaced with the value of max-dpb * 3 / 8. Consequently, a receiver that signals max-dpb MUST be capable of storing the following number of decoded frames, complementary field pairs, and non-paired fields in its decoded picture buffer:",
      "ja": "MAX-DPB：MAX-DPBの値は8/3マクロブロック単位で最大復号ピクチャバッファサイズを示す整数です。受信機は、プロファイルレベルIDパラメータまたはMAX-RECVレベルパラメータの値に搬送シグナリング最高レベルで必要とされる復号ピクチャバッファメモリの最小量よりも多くのメモリを有しているMAX-DPBパラメータ信号。 MAX-DPBが通知されたとき、受信機は、[2]のシグナリング最高レベルのためであり、表A-1 264の中MaxDpbMbs値ことを除いて、シグナリング最高レベルに適合NALユニットストリームをデコードできなければなりませんMAX-DPBの値* 3/8で置換する結果として、MAX-DPBに信号受信機が復号されたフレーム、相補的フィールド対、およびその復号ピクチャバッファ内の非対フィールドの次の番号を記憶することができなければなりません。"
    },
    {
      "indent": 9,
      "text": "Min(max-dpb * 3 / 8 / ( PicWidthInMbs * FrameHeightInMbs), 16)",
      "ja": "MIN（最大-DPB * 3/8 /（PicWidthInMbs FrameHeightInMbs *）、16）"
    },
    {
      "indent": 6,
      "text": "Wherein PicWidthInMbs and FrameHeightInMbs are defined in H.264 [2].",
      "ja": "PicWidthInMbsとFrameHeightInMbs 264に定義されている[2]。"
    },
    {
      "indent": 6,
      "text": "The value of max-dpb MUST be greater than or equal to the value of MaxDpbMbs * 3 / 8, wherein the value of MaxDpbMbs is given in Table A-1 of H.264 [2] for the highest level. Senders MAY use this knowledge to construct coded video streams with improved compression.",
      "ja": "MAX-DPBの値がより大きいかMaxDpbMbsの値は、最高レベルは、表A-1 [2] 264の中に与えられている、請求MaxDpbMbs * 3/8値に等しくなければなりません。送信者は、改善された圧縮と符号化されたビデオストリームを構築するためにこの知識を使用するかもしれません。"
    },
    {
      "indent": 9,
      "text": "Informative note: This parameter was added primarily to complement a similar codepoint in the ITU-T Recommendation H.245, so as to facilitate signaling gateway designs. The decoded picture buffer stores reconstructed samples. There is no relationship between the size of the decoded picture buffer and the buffers used in RTP, especially de-interleaving and de-jitter buffers.",
      "ja": "有益な注：このパラメータは、シグナリングゲートウェイの設計を容易にするように、ITU-T勧告H.245に類似のコードポイントを補完するために主に添加しました。復号ピクチャバッファストアサンプルを再構築しました。復号化ピクチャバッファのサイズとRTPで使用される緩衝剤、特にデインターリーブおよびデジッタバッファとの間の関係はありません。"
    },
    {
      "indent": 9,
      "text": "Informative note: In RFC 3984, which is obsoleted by RFC 6184, the unit of this parameter was 1024 bytes. The unit has been changed to 8/3 macroblocks in this document. The reason for this change was due to the changes from the 2003 version of the H.264 specification referenced by RFC 3984 to the 2010 version of the H.264 specification referenced by this document, particularly the changes to Table A-1 in the H.264 specification due to addition of color formats and bit depths not supported earlier. The changed semantics of this parameter keeps backward compatibility to RFC 3984 and supports all profiles defined in the 2010 version of the H.264 specification.",
      "ja": "有益注：RFC 6184によって廃止されているRFC 3984では、このパラメータの単位は、1024バイトでした。ユニットは、本文書に8/3のマクロブロックに変更されました。この変更の理由は、この文書で参照されるH.264規格2010年版にRFC 3984で参照H.264仕様の2003バージョンから変更、Hで表A-1に特に変化に起因しましたカラーフォーマットとビット深度の添加以前サポートしていないに起因0.264仕様。このパラメータの変更セマンティクスはRFC 3984に後方互換性を維持し、H.264規格の2010年版で定義されているすべてのプロファイルをサポートしています。"
    },
    {
      "indent": 3,
      "text": "max-br: The value of max-br is an integer indicating the maximum video bitrate in units of 1000 bits per second for the VCL HRD parameters and in units of 1200 bits per second for the NAL HRD parameters. Note that this parameter does not use units of cpbBrVclFactor and cpbBrNALFactor (see Table A-1 of H.264 [2]).",
      "ja": "MAX-BR：MAX-BRの値は、VCL HRDパラメータおよびNAL HRDパラメータの毎秒1200ビットの単位で毎秒1000ビットの単位での最大ビデオビットレートを示す整数です。このパラメータは、（表A-1 264の[2]を参照されたい）cpbBrVclFactorとcpbBrNALFactorの単位を使用しないことに留意されたいです。"
    },
    {
      "indent": 6,
      "text": "The max-br parameter signals that the video decoder of the receiver is capable of decoding video at a higher bitrate than is required by the signaled highest level conveyed in the value of the profile-level-id parameter or the max-recv-level parameter.",
      "ja": "受信機のビデオデコーダは、プロファイルレベルIDパラメータまたはMAX-RECVレベルパラメータの値に搬送シグナリング最高レベルで必要とされるよりも高いビットレートで復号ビデオが可能なMAX-BRパラメータ信号。"
    },
    {
      "indent": 6,
      "text": "When max-br is signaled, the video codec of the receiver MUST be able to decode NAL unit streams that conform to the signaled highest level, with the following exceptions in the limits specified by the highest level:",
      "ja": "MAX-BRが通知された場合に、受信機のビデオコーデックは、最高レベルで指定された限界に以下の例外を除いて、シグナリング最高レベルに適合NALユニットストリームをデコードできなければなりません。"
    },
    {
      "indent": 6,
      "text": "o The value of max-br (after taking cpbBrVclFactor and cpbBrNALFactor into consideration when needed) replaces the MaxBR value in Table A-1 of H.264 [2] for the highest level.",
      "ja": "MAX-BRの値O（必要なときに考慮cpbBrVclFactorとcpbBrNALFactorを取った後）最高レベルについて表A-1 [2] 264の中MaxBR値を置き換えます。"
    },
    {
      "indent": 6,
      "text": "o When the max-cpb parameter is not present, the result of the following formula replaces the value of MaxCPB in Table A-1 of H.264 [2]: (MaxCPB of the signaled level) * max-br / (MaxBR of the signaled highest level).",
      "ja": "MAX-CPBパラメータが存在しない場合、O、次式の結果を表にMaxCPBの値を置き換えA-1 264 [2]の：の（シグナリングレベルのMaxCPB）* MAX-BR /（MaxBR合図最高レベル）。"
    },
    {
      "indent": 6,
      "text": "For example, if a receiver signals capability for Main profile Level 1.2 with max-br equal to 1550, this indicates a maximum video bitrate of 1550 kbits/sec for VCL HRD parameters, a maximum video bitrate of 1860 kbits/sec for NAL HRD parameters, and a CPB size of 4036458 bits (1550000 / 384000 * 1000 * 1000).",
      "ja": "MAX-BR 1550等しいメインプロファイルレベル1.2の受信信号能力たとえば、これは、NAL HRDパラメータのVCL HRDパラメータ1550人のキロビット/秒の最大ビデオビットレート、1860人のキロビット/秒の最大ビデオビットレートを示します、および4036458ビットのCPBサイズ（384000分の1550000×1000×1000）。"
    },
    {
      "indent": 6,
      "text": "The value of max-br (after taking cpbBrVclFactor and cpbBrNALFactor into consideration when needed) MUST be greater than or equal to the value MaxBR given in Table A-1 of H.264 [2] for the signaled highest level.",
      "ja": "（必要なときに考慮cpbBrVclFactorとcpbBrNALFactor服用後）MAX-BRの値が通知最高レベルは、表A-1 264 [2]の中で与えられた値MaxBRより大きいか等しくなければなりません。"
    },
    {
      "indent": 6,
      "text": "Senders MAY use this knowledge to send higher bitrate video as allowed in the level definition of Annex A of H.264 to achieve improved video quality.",
      "ja": "H.264の附属書Aのレベルの定義で許可された送信者は、改善されたビデオ品質を達成するために、より高いビットレートの映像を送信するためにこの知識を使用するかもしれません。"
    },
    {
      "indent": 9,
      "text": "Informative note: This parameter was added primarily to complement a similar codepoint in the ITU-T Recommendation H.245, so as to facilitate signaling gateway designs. The assumption that the network is capable of handling such bitrates at any given time cannot be made from the value of this parameter. In particular, no conclusion can be drawn that the signaled bitrate is possible under congestion control constraints.",
      "ja": "有益な注：このパラメータは、シグナリングゲートウェイの設計を容易にするように、ITU-T勧告H.245に類似のコードポイントを補完するために主に添加しました。ネットワークは、任意の時点でそのようなビットレートを取り扱うことが可能であるという仮定は、このパラメータの値から作ることができません。具体的には、いかなる結論はシグナリングビットレートは、輻輳制御制約の下で可能であることを引き出すことはできません。"
    },
    {
      "indent": 3,
      "text": "redundant-pic-cap: This parameter signals the capabilities of a receiver implementation. When equal to 0, the parameter indicates that the receiver makes no attempt to use redundant coded pictures to correct incorrectly decoded primary coded pictures. When equal to 0, the receiver is not capable of using redundant slices; therefore, a sender SHOULD avoid sending redundant slices to save bandwidth. When equal to 1, the receiver is capable of decoding any such redundant slice that covers a corrupted area in a primary decoded picture (at least partly), and therefore a sender MAY send redundant slices. When the parameter is not present, a value of 0 MUST be used for redundant-pic-cap. When present, the value of redundant-pic-cap MUST be either 0 or 1.",
      "ja": "冗長PICキャップ：このパラメータは、受信機の実装の機能を知らせます。とき0に等しく、パラメータは、受信機が誤って復号された一次符号化ピクチャを補正する冗長符号化ピクチャを使用する試みを行っていないことを示しています。場合0に等しい、受信機は、冗長スライスを使用することができません。そのため、送信者は、帯域幅を節約するために冗長スライスを送信することは避けてください。場合1に等しく、受信機は、プライマリ復号画像における破損領域を（少なくとも部分的に）覆う任意のこのような冗長スライスを復号化することが可能であり、したがって、送信者は、冗長スライスを送信することができます。パラメータが存在しない場合、0の値は、冗長-PICキャップするために使用されなければなりません。存在する場合、冗長PICキャップの値が0または1のいずれかでなければなりません。"
    },
    {
      "indent": 6,
      "text": "When the profile-level-id parameter is present in the same signaling as the redundant-pic-cap parameter and the profile indicated in profile-level-id is such that it disallows the use of redundant coded pictures (e.g., Main profile), the value of redundant-pic-cap MUST be equal to 0. When a receiver indicates redundant-pic-cap equal to 0, the received stream SHOULD NOT contain redundant coded pictures.",
      "ja": "プロファイルレベルIDパラメータは、プロファイルレベルIDに示されている冗長PICキャップパラメータとプロファイルと同じシグナリングに存在する場合、それは、冗長符号化ピクチャ（例えば、メインプロファイル）の使用を禁止するようなものです受信機は、受信したストリームは、冗長符号化ピクチャを含むべきではない0に等しい冗長PICキャップを示す場合冗長PICキャップの値が0に等しくなければなりません。"
    },
    {
      "indent": 9,
      "text": "Informative note: Even if redundant-pic-cap is equal to 0, the decoder is able to ignore redundant codec pictures provided that the decoder supports a profile (Baseline, Extended) in which redundant coded pictures are allowed.",
      "ja": "有益な注意：冗長-PIC-キャップが0に等しい場合でもデコーダは、冗長符号化ピクチャが許可されたプロファイル（ベースライン、拡張）をサポートしていることを、デコーダが提供冗長コーデックピクチャを無視することができます。"
    },
    {
      "indent": 9,
      "text": "Informative note: Even if redundant-pic-cap is equal to 1, the receiver may also choose other error concealment strategies to replace or complement decoding of redundant slices.",
      "ja": "有益な注意：冗長-PIC-キャップが1に等しい場合でも、受信機は、冗長スライスの復号化を置き換えるまたは補完する他の誤り隠蔽戦略を選択することができます。"
    },
    {
      "indent": 3,
      "text": "sprop-parameter-sets: This parameter MAY be used to convey any sequence and picture parameter set NAL units (herein referred to as the initial parameter set NAL units) that can be placed in the NAL unit stream to precede any other NAL units in decoding order. The parameter MUST NOT be used to indicate codec capability in any capability exchange procedure. The value of the parameter is a comma-separated (',') list of base64 RFC 4648 [9] representations of parameter set NAL units as specified in Sections 7.3.2.1 and 7.3.2.2 of H.264 [2]. Note that the number of bytes in a parameter set NAL unit is typically less than 10, but a picture parameter set NAL unit can contain several hundred bytes.",
      "ja": "spropパラメータセット：このパラメータは、復号に他のNALユニットに先行するNALユニットストリーム内に配置することができる任意の配列とピクチャパラメータセットNALユニットを（本明細書でNALユニットを設定された初期パラメータと呼ぶ）を伝達するために使用されるかもしれません注文。パラメータは任意の能力交換手順にコーデックの能力を示すために使用してはいけません。パラメータの値は、base64のRFC 4648のカンマ区切り（「」）のリストである[9]のセクション7.3.2.1とH.264の7.3.2.2で指定されたパラメータセットNALユニットの表現[2]。パラメータセットNALユニット内のバイト数が10未満では、典型的には、しかし、ピクチャパラメータセットNALユニットが数百バイトを含むことができることに留意されたいです。"
    },
    {
      "indent": 9,
      "text": "Informative note: When several payload types are offered in the\nSDP Offer/Answer model, each with its own sprop-parameter-sets\nparameter, the receiver cannot assume that those parameter sets\ndo not use conflicting storage locations (i.e., identical\nvalues of parameter set identifiers).  Therefore, a receiver should buffer all sprop-parameter-sets and make them available\nto the decoder instance that decodes a certain payload type.",
      "raw": true
    },
    {
      "indent": 6,
      "text": "The sprop-parameter-sets parameter MUST only contain parameter sets that are conforming to the profile-level-id, i.e., the subset of coding tools indicated by any of the parameter sets MUST be equal to the default sub-profile, and the level indicated by any of the parameter sets MUST be equal to the default level.",
      "ja": "spropパラメータセットのパラメータのみプロファイルレベルIDに適合されているパラメータセットを含まなければならない、すなわち、パラメータセットのいずれかで示される符号化ツールのサブセットがデフォルトサブプロファイル、およびレベルに等しくなければなりませんパラメータセットのいずれかによって示されるデフォルトのレベルに等しくなければなりません。"
    },
    {
      "indent": 3,
      "text": "sprop-level-parameter-sets: This parameter MAY be used to convey any sequence and picture parameter set NAL units (herein referred to as the initial parameter set NAL units) that can be placed in the NAL unit stream to precede any other NAL units in decoding order and that are associated with one or more levels different than the default level. The parameter MUST NOT be used to indicate codec capability in any capability exchange procedure.",
      "ja": "sprop-レベルパラメータセット：このパラメータは、他のNALユニットに先行するNALユニットストリーム内に配置することができる任意の配列とピクチャパラメータセットNALユニットを（本明細書でNALユニットを設定された初期パラメータと呼ぶ）を伝達するために使用されるかもしれませんデコード順でそのデフォルトレベルとは異なる1つまたは複数のレベルに関連しています。パラメータは任意の能力交換手順にコーデックの能力を示すために使用してはいけません。"
    },
    {
      "indent": 6,
      "text": "The sprop-level-parameter-sets parameter contains parameter sets for one or more levels that are different than the default level. All parameter sets associated with one level are clustered and prefixed with a three-byte field that has the same syntax as profile-level-id. This enables the receiver to install the parameter sets for one level and discard the rest. The three-byte field is named PLId, and all parameter sets associated with one level are named PSL, which has the same syntax as sprop-parameter-sets. Parameter sets for each level are represented in the form of PLId:PSL, i.e., PLId followed by a colon (':') and the base64 RFC 4648 [9] representation of the initial parameter set NAL units for the level. Each pair of PLId:PSLs is also separated by a colon. Note that a PSL can contain multiple parameter sets for that level, separated with commas (',').",
      "ja": "spropレベルのパラメータセットのパラメータは、デフォルトのレベルは異なる1つ以上のレベルのためのパラメータセットが含まれています。あるレベルに関連付けられているすべてのパラメータセットは、クラスタとプロファイルレベルIDと同じシンタックスを有する3バイトのフィールドが付いています。これは、1つのレベルのためのパラメータセットをインストールし、残りの部分を破棄し、受信を可能にします。 3バイトのフィールドはPLIDと命名され、そして1つのレベルに関連付けられているすべてのパラメータセットはのspropパラメータセットと同じ構文を持っているPSL、命名されています。各レベルのパラメータセットは、PLIDの形で表され：およびレベルのための初期パラメータセットNALユニットのbase64でRFC 4648 [9]表現：PSLは、すなわち、コロン（「」）が続くPLID。 PLIDの各ペア：PSLSもコロンで分離されています。 （「」）カンマで区切られ、PSLは、そのレベルのための複数のパラメータセットを含むことができることに留意されたいです。"
    },
    {
      "indent": 6,
      "text": "The subset of coding tools indicated by each PLId field MUST be equal to the default sub-profile, and the level indicated by each PLId field MUST be different than the default level. All sequence parameter sets contained in each PSL MUST have the three bytes from profile_idc to level_idc, inclusive, equal to the preceding PLId.",
      "ja": "各PLIDフィールドによって示される符号化ツールのサブセットがデフォルトサブプロファイルに等しくなければならない、そして各PLIDフィールドによって示されるレベルが既定レベルよりも異なっている必要があります。各PSLに含まれるすべてのシーケンスパラメータセットは、包括的、profile_idcからlevel_idcに3つのバイトを持たなければならない、先行PLIDに等しいです。"
    },
    {
      "indent": 9,
      "text": "Informative note: This parameter allows for efficient level downgrade or upgrade in SDP Offer/Answer and out-of-band transport of parameter sets simultaneously.",
      "ja": "有益な注意：このパラメータは、効率的なレベルのダウングレードが可能になりますかSDPオファー/アンサーにアップグレードし、パラメータのアウトオブバンド輸送を同時に設定します。"
    },
    {
      "indent": 3,
      "text": "use-level-src-parameter-sets: This parameter MAY be used to indicate a receiver capability. The value MAY be equal to either 0 or 1. When the parameter is not present, the value MUST be inferred to be equal to 0. The value 0 indicates that the receiver does not understand the sprop-level-parameter-sets parameter, does not understand the \"fmtp\" source attribute as specified in Section 6.3 of RFC 5576 [14], will ignore sprop-level-parameter-sets when present, and will ignore sprop-parameter-sets when conveyed using the \"fmtp\" source attribute. The value 1 indicates that the receiver understands the sprop-level-parameter-sets parameter, understands the \"fmtp\" source attribute as specified in Section 6.3 of RFC 5576 [14], and is capable of using parameter sets contained in the sprop-level-parameter-sets or contained in the sprop-parameter-sets that is conveyed using the \"fmtp\" source attribute.",
      "ja": "レベル-SRC-パラメータセットを使用します。このパラメータは、受信機の性能を示すために使用されるかもしれません。パラメータが存在しない場合の値は、値が値0 0に等しいと推論されなければならない、0または1に等しくてもよいし、受信機がのspropレベルパラメータセットのパラメータを理解していないことを示していますRFC 5576のセクション6.3で指定されるように[14]「のfmtp」ソース属性を理解していない、存在する場合のsprop-レベルパラメータセットを無視し、そして「のfmtp」source属性を使用して搬送する際のspropパラメータセットを無視します。値1は、受信機がのspropレベルパラメータセットのパラメータを理解することを示しているRFC 5576のセクション6.3で指定されるように、「のfmtp」ソース属性を理解し[14]、とのspropレベルに含まれるパラメータセットを用いて可能です-parameterセット又は「のfmtp」ソース属性を使用して搬送されるのspropパラメータセットに含まれています。"
    },
    {
      "indent": 9,
      "text": "Informative note: An RFC 3984 receiver does not understand\nsprop-level-parameter-sets, use-level-src-parameter-sets, or\nthe \"fmtp\" source attribute as specified in Section 6.3 of RFC\n5576 [14].  Therefore, during SDP Offer/Answer, an RFC 3984\nreceiver as the answerer will simply ignore sprop-level-\nparameter-sets when present in an offer and sprop-parameter-\nsets conveyed using the \"fmtp\" source attribute, as specified\nin Section 6.3 of RFC 5576 [14].  Assume that the offered\npayload type was accepted at a level lower than the default\nlevel.  If the offered payload type included sprop-level-\nparameter-sets or included sprop-parameter-sets conveyed using\nthe \"fmtp\" source attribute and if the offerer sees that the\nanswerer has not included use-level-src-parameter-sets equal to\n1 in the answer, the offerer knows that in-band transport of\nparameter sets is needed.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "in-band-parameter-sets: This parameter MAY be used to indicate a receiver capability. The value MAY be equal to either 0 or 1. The value 1 indicates that the receiver discards out-of-band parameter sets in sprop-parameter-sets and sprop-level-parameter-sets; therefore, the sender MUST transmit all parameter sets in-band. The value 0 indicates that the receiver utilizes out-of-band parameter sets included in sprop-parameter-sets and/or sprop-level-parameter-sets. However, in this case, the sender MAY still choose to send parameter sets in-band. When in-band-parameter-sets is equal to 1, use-level-src-parameter-sets MUST NOT be present or MUST be equal to 0. When the parameter is not present, this receiver capability is not specified, and therefore the sender MAY send out-of-band parameter sets only, it MAY send in-band-parameter-sets only, or it MAY send both.",
      "ja": "インバンド・パラメータセット：このパラメータは、受信機の性能を示すために使用されるかもしれません。値が1が示す0または1のいずれかの値に等しくてもよいことを受信廃棄アウトオブバンドのspropパラメータセットとのsprop-レベルパラメータセットのパラメータセット。そのため、送信者は、帯域内のすべてのパラメータセットを伝えなければなりません。値0は、受信機がのspropパラメータセット及び/又はのspropレベルパラメータセットに含まれるアウトオブバンドパラメータセットを利用することを示しています。しかし、この場合には、送信者がまだインバンドパラメータセットを送信するために選ぶかもしれません。帯域内パラメータセットは1に等しい場合、使用レベル-SRC-パラメータセットが存在してはならないか、0に等しくなければならないパラメータが存在しない場合、この受信機の能力を特定するため、されていません送信者が唯一のアウトオブバンドパラメータセットを送信することができ、それが唯一のインバンド・パラメータセットを送信することができ、またはそれは両方を送信することができます。"
    },
    {
      "indent": 3,
      "text": "level-asymmetry-allowed: This parameter MAY be used in SDP Offer/ Answer to indicate whether level asymmetry, i.e., sending media encoded at a different level in the offerer-to-answerer direction than the level in the answerer-to-offerer direction, is allowed. The value MAY be equal to either 0 or 1. When the parameter is not present, the value MUST be inferred to be equal to 0. The value 1 in both the offer and the answer indicates that level asymmetry is allowed. The value of 0 in either the offer or the answer indicates that level asymmetry is not allowed.",
      "ja": "レベル非対称許容：このパラメータは、回答対オファー方向のレベルよりオファーツー回答方向の異なるレベルで符号化されたメディアを送信、すなわち、レベル非対称かどうかを示すためのSDPオファー/アンサーに使用されるかもしれません、 許可されています。パラメータが存在しない場合の値は0または1のいずれかに等しくてもよく、オファーとアンサーの両方に値1 0に等しいと推測しなければならない値は、レベル非対称性が許容されることを示しています。提供または回答のいずれかで0の値は、レベルの非対称性が許可されていないことを示しています。"
    },
    {
      "indent": 6,
      "text": "If level-asymmetry-allowed is equal to 0 (or not present) in either the offer or the answer, level asymmetry is not allowed. In this case, the level to use in the direction from the offerer to the answerer MUST be the same as the level to use in the opposite direction.",
      "ja": "レベル非対称許容オファーまたは回答のいずれかで0（または存在しない）に等しい場合、レベルの非対称性は許可されません。この場合、回答に提供者からの方向で使用するレベルは、反対方向で使用するレベルと同じでなければなりません。"
    },
    {
      "indent": 3,
      "text": "packetization-mode: This parameter signals the properties of an RTP payload type or the capabilities of a receiver implementation. Only a single configuration point can be indicated; thus, when capabilities to support more than one packetization-mode are declared, multiple configuration points (RTP payload types) must be used.",
      "ja": "パケット化モード：このパラメータは、RTPペイロードタイプのプロパティまたは受信機の実装の機能を知らせます。単一の設定点を示すことができます。複数のパケット化モードをサポートする能力が宣言されている場合、したがって、複数の設定点（RTPペイロードタイプ）を使用しなければなりません。"
    },
    {
      "indent": 6,
      "text": "When the value of packetization-mode is equal to 0 or packetization-mode is not present, the single NAL mode MUST be used. This mode is in use in standards using ITU-T Recommendation H.241 [3] (see Section 12.1). When the value of packetization-mode is equal to 1, the non-interleaved mode MUST be used. When the value of packetization-mode is equal to 2, the interleaved mode MUST be used. The value of packetization-mode MUST be an integer in the range of 0 to 2, inclusive.",
      "ja": "パケットモードの値が0に等しいか、またはパケット化モードが存在しない場合、単一NALモードを使用しなければなりません。このモードは、ITU-T勧告H.241を使用して、標準で使用されている[3]（セクション12.1を参照します）。パケットモードの値が1に等しい場合、非インターリーブモードを使用しなければなりません。パケットモードの値が2に等しい場合、インターリーブモードを使用しなければなりません。パケットモードの値を含め0~2の範囲の整数でなければなりません。"
    },
    {
      "indent": 3,
      "text": "sprop-interleaving-depth: This parameter MUST NOT be present when packetization-mode is not present or the value of packetization-mode is equal to 0 or 1. This parameter MUST be present when the value of packetization-mode is equal to 2.",
      "ja": "spropインターリーブ深さ：パケット化モードが存在しないか、またはパケット化モードの値がパケット・モードの値が2に等しい場合、このパラメータが存在しなければならない0または1に等しい場合、このパラメータは存在してはなりません。"
    },
    {
      "indent": 6,
      "text": "This parameter signals the properties of an RTP packet stream. It specifies the maximum number of VCL NAL units that precede any VCL NAL unit in the RTP packet stream in transmission order and that follow the VCL NAL unit in decoding order. Consequently, it is guaranteed that receivers can reconstruct NAL unit decoding order when the buffer size for NAL unit decoding order recovery is at least the value of sprop-interleaving-depth + 1 in terms of VCL NAL units.",
      "ja": "このパラメータは、RTPパケットストリームの性質を知らせます。これは、送信順にRTPパケットストリーム内の任意のVCL NALユニットに先行するVCL NALユニットの最大数を指定し、その復号順序でVCL NALユニットに従います。したがって、NALユニットの復号順序回復のバッファサイズがVCL NALユニットの観点のsprop-インターリーブ深さ+ 1の値が最小であるときに受信機がNALユニットの復号化順序を再構築することができることが保証されます。"
    },
    {
      "indent": 6,
      "text": "The value of sprop-interleaving-depth MUST be an integer in the range of 0 to 32767, inclusive.",
      "ja": "sprop-インターリーブ深さの値は包括32767から0までの範囲の整数でなければなりません。"
    },
    {
      "indent": 3,
      "text": "sprop-deint-buf-req: This parameter MUST NOT be present when packetization-mode is not present or the value of packetization-mode is equal to 0 or 1. It MUST be present when the value of packetization-mode is equal to 2.",
      "ja": "sprop-deint-BUF-REQ：パケット化モードが存在しないか、またはパケット化モードの値が0または1に等しく、パケットモードの値が2に等しいときに存在しなければならない場合、このパラメータは存在してはなりません。"
    },
    {
      "indent": 6,
      "text": "sprop-deint-buf-req signals the required size of the de-interleaving buffer for the RTP packet stream. The value of the parameter MUST be greater than or equal to the maximum buffer occupancy (in units of bytes) required in such a de-interleaving buffer that is specified in Section 7.2 of RFC 6184 [1]. It is guaranteed that receivers can perform the de-interleaving of interleaved NAL units into NAL unit decoding order, when the de-interleaving buffer size is at least the value of sprop-deint-buf-req in terms of bytes.",
      "ja": "sprop-deint-BUF-REQは、RTPパケットストリームのデインタリーブバッファの必要なサイズを通知します。パラメータの値は、RFC 6184のセクション7.2で指定されるようにデインタリーブバッファに必要とさ（バイト単位）の最大バッファ占有率より大きいか等しくなければならない[1]。デインターリーブバッファサイズはバイト単位でのsprop-deint-BUF-REQの値が最小であるとき受信機は、NALユニットの復号化順にインターリーブNAL単位のデインタリーブを行うことができることが保証されます。"
    },
    {
      "indent": 6,
      "text": "The value of sprop-deint-buf-req MUST be an integer in the range of 0 to 4294967295, inclusive.",
      "ja": "sprop-deint-BUF-REQの値は4294967295、包括的に0の範囲の整数でなければなりません。"
    },
    {
      "indent": 9,
      "text": "Informative note: sprop-deint-buf-req indicates the required size of the de-interleaving buffer only. When network jitter can occur, an appropriately sized jitter buffer has to be provisioned for as well.",
      "ja": "有益な注意：のsprop-deint-BUF-REQは、デインタリーブバッファの必要なサイズを示しています。ネットワークジッタが発生することができた場合に、適切なサイズのジッタバッファは、同様にプロビジョニングされなければなりません。"
    },
    {
      "indent": 3,
      "text": "deint-buf-cap: This parameter signals the capabilities of a receiver implementation and indicates the amount of de-interleaving buffer space in units of bytes that the receiver has available for reconstructing the NAL unit decoding order. A receiver is able to handle any stream for which the value of the sprop-deint-buf-req parameter is smaller than or equal to this parameter.",
      "ja": "deint-BUFキャップ：このパラメータは、受信機の実装の機能を通知し、受信機がNALユニットの復号化順序を再構築するために利用できる有するバイト単位にデインターリーブバッファスペースの量を示します。受信機は、のsprop-deint-BUF-REQパラメータの値がこのパラメータより小さいか等しいされている任意のストリームを処理することが可能です。"
    },
    {
      "indent": 6,
      "text": "If the parameter is not present, then a value of 0 MUST be used for deint-buf-cap. The value of deint-buf-cap MUST be an integer in the range of 0 to 4294967295, inclusive.",
      "ja": "パラメータが存在しない場合、0の値は、deint-BUFキャップするために使用されなければなりません。 deint-BUFキャップの値は4294967295、包括的に0の範囲の整数でなければなりません。"
    },
    {
      "indent": 9,
      "text": "Informative note: deint-buf-cap indicates the maximum possible size of the de-interleaving buffer of the receiver only. When network jitter can occur, an appropriately sized jitter buffer has to be provisioned for as well.",
      "ja": "有益な注意：deint-BUFキャップは、受信機のデインタリーブバッファの最大サイズを示しています。ネットワークジッタが発生することができた場合に、適切なサイズのジッタバッファは、同様にプロビジョニングされなければなりません。"
    },
    {
      "indent": 3,
      "text": "sprop-init-buf-time: This parameter MAY be used to signal the properties of an RTP packet stream. The parameter MUST NOT be present if the value of packetization-mode is equal to 0 or 1.",
      "ja": "sprop-INIT-BUF-時間：このパラメータは、RTPパケットストリームの性質を知らせるために使用されるかもしれません。パケットモードの値が0又は1に等しい場合、パラメータが存在してはなりません。"
    },
    {
      "indent": 6,
      "text": "The parameter signals the initial buffering time that a receiver MUST wait before starting decoding to recover the NAL unit decoding order from the transmission order. The parameter is the maximum value of (decoding time of the NAL unit - transmission time of a NAL unit), assuming reliable and instantaneous transmission, the same timeline for transmission and decoding, and commencement of decoding when the first packet arrives.",
      "ja": "パラメータは、受信機が送信順序からNALユニットの復号化順序を回復するために復号化を開始する前に待機しなければならない初期バッファリング時間を知らせます。最初のパケットが到着したときに信頼性が高く、瞬時送信、伝送及び復号化のために同一のタイムライン、および復号化の開始を想定し、 - パラメータが（NALユニットの送信時間NALユニットの復号化時間）の最大値です。"
    },
    {
      "indent": 6,
      "text": "An example of specifying the value of sprop-init-buf-time follows. A NAL unit stream is sent in the following interleaved order, in which the value corresponds to the decoding time and the transmission order is from left to right:",
      "ja": "sprop-INIT-BUF-時間の値を指定する例を以下に示します。 NALユニットストリームは、値が復号時間に対応し、送信順序は左から右へである次のインターリーブ順序で送信されます。"
    },
    {
      "indent": 9,
      "text": "0 2 1 3 5 4 6 8 7 ...",
      "ja": "０ ２ １ ３ ５ ４ ６ ８ ７ 。。。"
    },
    {
      "indent": 6,
      "text": "Assuming a steady transmission rate of NAL units, the transmission times are:",
      "ja": "NALユニットの安定した伝送速度を仮定すると、送信時間は以下のとおりです。"
    },
    {
      "indent": 9,
      "text": "0 1 2 3 4 5 6 7 8 ...",
      "ja": "０ １ ２ ３ ４ ５ ６ ７ ８ 。。。"
    },
    {
      "indent": 6,
      "text": "Subtracting the decoding time from the transmission time column-wise results in the following series:",
      "ja": "以下の一連の送信時間列方向結果から復号時間を差し引きます。"
    },
    {
      "indent": 9,
      "text": "0 -1 1 0 -1 1 0 -1 1 ...",
      "ja": "０ ー１ １ ０ ー１ １ ０ ー１ １ 。。。"
    },
    {
      "indent": 6,
      "text": "Thus, in terms of intervals of NAL unit transmission times, the value of sprop-init-buf-time in this example is 1. The parameter is coded as a non-negative base10 integer representation in clock ticks of a 90-kHz clock. If the parameter is not present, then no initial buffering time value is defined. Otherwise, the value of sprop-init-buf-time MUST be an integer in the range of 0 to 4294967295, inclusive.",
      "ja": "したがって、NALユニットの送信時間間隔の点で、この例でのsprop-INIT-BUF-timeの値は、パラメータがクロックに非負base10整数表現として符号化される1は、90 kHzのクロックの刻みです。パラメータが存在しない場合は、何の初期バッファリング時間値が定義されていません。そうでない場合、のsprop-INIT-BUF-timeの値は4294967295、包括的に0の範囲の整数でなければなりません。"
    },
    {
      "indent": 6,
      "text": "In addition to the signaled sprop-init-buf-time, receivers SHOULD take into account the transmission delay jitter buffering, including buffering for the delay jitter caused by mixers, translators, gateways, proxies, traffic-shapers, and other network elements.",
      "ja": "シグナリングのsprop-INIT-BUF-時間に加えて、受信機は、ミキサ、翻訳、ゲートウェイ、プロキシ、トラフィックシェーパー、および他のネットワーク要素による遅延ジッタバッファリングなど、アカウントに送信遅延ジッタバッファリングを取るべきです。"
    },
    {
      "indent": 3,
      "text": "sprop-max-don-diff: This parameter MAY be used to signal the properties of an RTP packet stream. It MUST NOT be used to signal transmitter, receiver, or codec capabilities. The parameter MUST NOT be present if the value of packetization-mode is equal to 0 or 1. sprop-max-don-diff is an integer in the range of 0 to 32767, inclusive. If sprop-max-don-diff is not present, the value of the parameter is unspecified. sprop-max-don-diff is calculated as follows:",
      "ja": "sprop-MAX-ドン・デフ：このパラメータは、RTPパケットストリームの性質を知らせるために使用されるかもしれません。送信機、受信機、またはコーデック機能を知らせるために使用してはいけません。パケットモードの値が0または1のsprop-MAX-ドン差分に等しい場合、パラメータが存在してはならない包括32767から0までの範囲の整数です。 sprop-MAX-ドン-diffが存在しない場合、パラメータの値が指定されていません。次のようにのsprop-MAX-ドン-diffが計算されます。"
    },
    {
      "indent": 9,
      "text": "sprop-max-don-diff = max{AbsDON(i) - AbsDON(j)}, for any i and\nany j>i,",
      "raw": true
    },
    {
      "indent": 6,
      "text": "where i and j indicate the index of the NAL unit in the transmission order and AbsDON denotes a decoding order number of the NAL unit that does not wrap around to 0 after 65535. In other words, AbsDON is calculated as follows: let m and n be consecutive NAL units in transmission order. For the very first NAL unit in transmission order (whose index is 0), AbsDON(0) = DON(0). For other NAL units, AbsDON is calculated as follows:",
      "ja": "i及びjは、伝送順にNALユニットのインデックスを示し、AbsDONはつまり65535の後に0にラップアラウンドしないNALユニットの復号化順序番号を表し、次のように、AbsDONが計算される：mおよびnせ伝送順序で連続NALユニットです。 （インデックスが0である）、AbsDON送信順序に非常に最初のNALユニットのための（0）= DON（0）。次のように他のNALユニットに対して、AbsDONが計算されます。"
    },
    {
      "indent": 6,
      "text": "If DON(m) == DON(n), AbsDON(n) = AbsDON(m)",
      "ja": "DON（M）== DON（n）は、AbsDON（N）= AbsDON（m）の場合"
    },
    {
      "indent": 6,
      "text": "If (DON(m) < DON(n) and DON(n) - DON(m) < 32768),",
      "ja": "IF（DON（M）<DON（n）とDON（N） -  DON（M）<32768）、"
    },
    {
      "indent": 6,
      "text": "AbsDON(n) = AbsDON(m) + DON(n) - DON(m)",
      "ja": "AbsDON（N）= AbsDON（M）+ DON（N） -  DON（m）は"
    },
    {
      "indent": 6,
      "text": "If (DON(m) > DON(n) and DON(m) - DON(n) >= 32768),",
      "ja": "IF（DON（M）> DON（n）とDON（M） -  DON（N）> = 32768）、"
    },
    {
      "indent": 6,
      "text": "AbsDON(n) = AbsDON(m) + 65536 - DON(m) + DON(n)",
      "ja": "AbsDON（N）= AbsDON（M）+ 65536  -  DON（M）+ DON（n）は"
    },
    {
      "indent": 6,
      "text": "If (DON(m) < DON(n) and DON(n) - DON(m) >= 32768),",
      "ja": "IF（DON（M）<DON（n）とDON（N） -  DON（M）> = 32768）、"
    },
    {
      "indent": 6,
      "text": "AbsDON(n) = AbsDON(m) - (DON(m) + 65536 - DON(n))",
      "ja": "AbsDON（N）= AbsDON（M） - （DON（M）+ 65536  -  DON（n））を"
    },
    {
      "indent": 6,
      "text": "If (DON(m) > DON(n) and DON(m) - DON(n) < 32768),",
      "ja": "（DON（M）> DON（n）とDON（M） -  DON（N）<32768）であれば、"
    },
    {
      "indent": 6,
      "text": "AbsDON(n) = AbsDON(m) - (DON(m) - DON(n))",
      "ja": "AbsDON（N）= AbsDON（M） - （DON（M） -  DON（n））を"
    },
    {
      "indent": 6,
      "text": "where DON(i) is the decoding order number of the NAL unit having index i in the transmission order. The decoding order number is specified in Section 5.5 of RFC 6184 [1].",
      "ja": "ここで、DON（i）は、伝送順序でインデックスiを有するNALユニットの復号化順序番号です。復号化順序番号は、RFC 6184のセクション5.5で指定されている[1]。"
    },
    {
      "indent": 9,
      "text": "Informative note: Receivers may use sprop-max-don-diff to trigger which NAL units in the receiver buffer can be passed to the decoder.",
      "ja": "有益な注意：受信機は受信バッファ内のNALユニットがデコーダに渡すことができるトリガするためのsprop-MAX-ドン差分を使用してもよいです。"
    },
    {
      "indent": 3,
      "text": "max-rcmd-nalu-size: This parameter MAY be used to signal the capabilities of a receiver. The parameter MUST NOT be used for any other purposes. The value of the parameter indicates the largest NALU size in bytes that the receiver can handle efficiently. The parameter value is a recommendation, not a strict upper boundary. The sender MAY create larger NALUs but must be aware that the handling of these may come at a higher cost than NALUs conforming to the limitation.",
      "ja": "MAX-RCMD-NALUサイズ：このパラメータは、受信機の能力を知らせるために使用されるかもしれません。パラメータは、他の目的に使用してはいけません。パラメータの値は、受信機が効率的に扱うことができるバイト数で最大NALUのサイズを示します。パラメータ値は推奨ではなく、厳密な上限です。送信者は、より大きなのNALUを作成することが、これらの取り扱いが制限に準拠するのNALUよりも高い価格で来る可能性があることに注意しなければなりません。"
    },
    {
      "indent": 6,
      "text": "The value of max-rcmd-nalu-size MUST be an integer in the range of 0 to 4294967295, inclusive. If this parameter is not specified, no known limitation to the NALU size exists. Senders still have to consider the MTU size available between the sender and the receiver and SHOULD run MTU discovery for this purpose.",
      "ja": "MAX-RCMD-NALUサイズは4294967295、包括的に0の範囲の整数でなければならないの値。このパラメータが指定されていない場合は、NALUのサイズには既知の制限は存在しません。送信者は、まだ送信者と受信者の間でMTUサイズが使用可能に考慮する必要があり、この目的のためにMTUディスカバリを実行する必要があります。"
    },
    {
      "indent": 6,
      "text": "This parameter is motivated by, for example, an IP to H.223 video telephony gateway, where NALUs smaller than the H.223 transport data unit will be more efficient. A gateway may terminate IP; thus, MTU discovery will normally not work beyond the gateway.",
      "ja": "このパラメータは、のNALUは、H.223トランスポートデータユニットよりも小さく、より効率的になり、例えば、IP H.223のビデオテレフォニーゲートウェイ、によって動機付けされます。ゲートウェイは、IPを終了することができます。このように、MTUの発見は、通常、ゲートウェイを超えて動作しません。"
    },
    {
      "indent": 9,
      "text": "Informative note: Setting this parameter to a lower than necessary value may have a negative impact.",
      "ja": "有益注：必要より低い値に、このパラメータを設定すると、負の影響を有していてもよいです。"
    },
    {
      "indent": 3,
      "text": "sar-understood: This parameter MAY be used to indicate a receiver capability and nothing else. The parameter indicates the maximum value of aspect_ratio_idc (specified in H.264 [2]) smaller than 255 that the receiver understands. Table E-1 of H.264 [2] specifies aspect_ratio_idc equal to 0 as \"unspecified\"; 1 to 16, inclusive, as specific Sample Aspect Ratios (SARs); 17 to 254, inclusive, as \"reserved\"; and 255 as the Extended SAR, for which SAR width and SAR height are explicitly signaled. Therefore, a receiver with a decoder according to H.264 [2] understands aspect_ratio_idc in the range of 1 to 16, inclusive, and aspect_ratio_idc equal to 255, in the sense that the receiver knows exactly what the SAR is. For such a receiver, the value of sar-understood is 16. In the future, if Table E-1 of H.264 [2] is extended, e.g., such that the SAR for aspect_ratio_idc equal to 17 is specified, then for a receiver with a decoder that understands the extension, the value of sar-understood is 17. For a receiver with a decoder according to the 2003 version of H.264 [2], the value of sar-understood is 13, as the minimum reserved aspect_ratio_idc therein is 14.",
      "ja": "SAR-理解：このパラメータは、受信機の能力と他には何を示すのに使用されるかもしれません。パラメータは、受信機が理解255より（[2] 264で指定された）小さなaspect_ratio_idcの最大値を示しています。表E-1 264の[2]「未指定」として0に等しいaspect_ratio_idc指定します。 1〜16（両端を含む）のような特定のサンプルアスペクト比（SARS）。 17 254に、包括的には、のように「予約します」。 255 SAR幅及びSAR高さが明示的にシグナリングされる拡張SAR、など。したがって、H.264によるデコーダを有する受信機[2]受信機はSARが正確に知っているという意味で、1〜16の範囲でaspect_ratio_idcを理解含め、255に等しいaspect_ratio_idc。 H.264の表E-1 [2]に拡張されている場合、このような受信機のために、理解SARの値は17に等しいaspect_ratio_idcためのSARは、次いで、指定されていること、例えば、そのような将来的に16です。拡張、SAR-理解の値を理解し、デコーダを有する受信機は、最小予約[2]、SAR-理解の値は、13であるH.264の2003バージョンに応じてデコーダを有する受信機の場合17でありますaspect_ratio_idcは、その中に14です。"
    },
    {
      "indent": 6,
      "text": "When sar-understood is not present, the value MUST be inferred to be equal to 13.",
      "ja": "SAR理解が存在しない場合、値は13に等しいと推論されなければなりません。"
    },
    {
      "indent": 3,
      "text": "sar-supported: This parameter MAY be used to indicate a receiver capability and nothing else. The value of this parameter is an integer in the range of 1 to sar-understood, inclusive, equal to 255. The value of sar-supported equal to N smaller than 255 indicates that the receiver supports all the SARs corresponding to H.264 aspect_ratio_idc values (see Table E-1 of H.264 [2]) in the range from 1 to N, inclusive, without geometric distortion. The value of sar-supported equal to 255 indicates that the receiver supports all sample aspect ratios that are expressible using two 16-bit integer values as the numerator and denominator, i.e., those that are expressible using the H.264 aspect_ratio_idc value of 255 (Extended_SAR, see Table E-1 of H.264 [2]), without geometric distortion.",
      "ja": "SAR-サポート：このパラメータは、受信機の能力と他には何を示すのに使用されるかもしれません。このパラメータの値が255の値に等しい、包括的に理解SARの1の範囲の整数であり、255よりも小さいNに等しいSAR-サポートは、受信機は、SARが264 aspect_ratio_idcに対応するすべてのサポートされていることを示し値は、幾何学的歪みのない、包括的、1からNまでの範囲内（[2]表E-1 264を参照）。 255に等しいSAR-サポートの値は、（発現可能であるものが255のH.264 aspect_ratio_idc値を用いて、すなわち、受信機は、分子と分母のように2つの16ビット整数値を用いて表現可能であるすべてのサンプルアスペクト比をサポートすることを示しExtended_SARは、幾何学的歪みのない、表E-1 264の[2]）を参照します。"
    },
    {
      "indent": 6,
      "text": "H.264-compliant encoders SHOULD NOT send an aspect_ratio_idc equal to 0 or an aspect_ratio_idc larger than sar-understood and smaller than 255. H.264-compliant encoders SHOULD send an aspect_ratio_idc that the receiver is able to display without geometrical distortion. However, H.264-compliant encoders MAY choose to send pictures using any SAR.",
      "ja": "H.264準拠のエンコーダは、受信機が、幾何学的歪みなしに表示することができるaspect_ratio_idcを送信すべきである0に等しいaspect_ratio_idcまたはSAR-理解さより小さい255 H.264準拠のエンコーダよりも大きいaspect_ratio_idcを送るべきではありません。しかし、H.264準拠のエンコーダは、任意のSARを使用して画像を送信するために選ぶかもしれません。"
    },
    {
      "indent": 6,
      "text": "Note that the actual sample aspect ratio or extended sample aspect ratio, when present, of the stream is conveyed in the Video Usability Information (VUI) part of the sequence parameter set.",
      "ja": "なお、実際のサンプルアスペクト比または拡張サンプルアスペクト比、存在する場合、ストリームはシーケンスパラメータセットのビデオユーザビリティ情報（VUI）部分に搬送されるの。"
    },
    {
      "indent": 3,
      "text": "Encoding considerations: This type is only defined for transfer via RTP (RFC 3550) and is framed and binary (see Section 4.8 in RFC 4288).",
      "ja": "符号化の考慮事項：このタイプのみRTPを介して転送するための（RFC 3550）で定義され、フレームとバイナリ（RFC 4288セクション4.8を参照します）。"
    },
    {
      "indent": 3,
      "text": "Security considerations: See Section 9 of RFC 6185.",
      "ja": "セキュリティの考慮事項：RFC 6185のセクション9を参照してください。"
    },
    {
      "indent": 3,
      "text": "Interoperability considerations: None",
      "ja": "相互運用性に関する注意事項：なし"
    },
    {
      "indent": 3,
      "text": "Published specification: RFC 6185 and its reference section",
      "ja": "公開された仕様：RFC 6185およびその参照セクション"
    },
    {
      "indent": 3,
      "text": "Applications that use this media type: Video streaming and conferencing applications",
      "ja": "このメディアタイプを使用するアプリケーション：ビデオストリーミングと会議アプリケーション"
    },
    {
      "indent": 3,
      "text": "Additional information: None",
      "ja": "追加情報：なし"
    },
    {
      "indent": 6,
      "text": "Magic number(s):",
      "ja": "マジックナンバー（S）："
    },
    {
      "indent": 6,
      "text": "File extension(s):",
      "ja": "ファイルの拡張子（S）："
    },
    {
      "indent": 6,
      "text": "Macintosh file type code(s):",
      "ja": "Macintoshのファイルタイプコード（S）："
    },
    {
      "indent": 3,
      "text": "Person & email address to contact for further information:",
      "ja": "詳細のために連絡する人とEメールアドレス："
    },
    {
      "indent": 6,
      "text": "Tom Kristensen <tom.kristensen@tandberg.com>, <tomkri@ifi.uio.no>",
      "ja": "トム・クリステンセン<tom.kristensen@tandberg.com>、<tomkri@ifi.uio.no>"
    },
    {
      "indent": 3,
      "text": "Intended usage: COMMON",
      "ja": "意図している用法：COMMON"
    },
    {
      "indent": 3,
      "text": "Restrictions on usage: This type depends on RTP framing; hence, it is only defined for transfer via RTP (see RFC 3550). Transport within other framing protocols is not defined at this time.",
      "ja": "使用に関する制限事項：このタイプは、RTP縁どりによって、したがって、それは唯一のRTPを介した転送のために定義されている（RFC 3550を参照）。他のフレーミングプロトコル内の輸送は、この時点で定義されていません。"
    },
    {
      "indent": 3,
      "text": "Author: Tom Kristensen",
      "ja": "著者：トム・クリステンセン"
    },
    {
      "indent": 3,
      "text": "Change controller: IETF Audio/Video Transport Working Group delegated from the IESG",
      "ja": "変更コントローラ：IETFオーディオ/ビデオ輸送ワーキンググループがIESGから委任します"
    },
    {
      "indent": 0,
      "text": "7. Mapping to SDP",
      "section_title": true,
      "ja": "SDPへのマッピング7."
    },
    {
      "indent": 3,
      "text": "The mapping of the above defined payload format media subtype and its parameters SHALL be done according to Section 3 of RFC 4855 [10].",
      "ja": "上記で定義されたペイロードフォーマットメディアサブタイプとそのパラメータのマッピングは、RFC 4855 [10]のセクション3に従って実施されねばなりません。"
    },
    {
      "indent": 3,
      "text": "An example of the \"fmtp\" attribute in the media representation of a level 2.2 bitstream is as follows:",
      "ja": "次のようにレベル2.2ビットストリームのメディア表現における「のfmtp」属性の例です。"
    },
    {
      "indent": 6,
      "text": "a=fmtp:97 profile-level-id=008016",
      "ja": "=のfmtp：97プロファイルレベルID = 008016"
    },
    {
      "indent": 0,
      "text": "7.1. Offer/Answer Considerations",
      "section_title": true,
      "ja": "7.1. オファー/回答の考慮事項"
    },
    {
      "indent": 3,
      "text": "When H264-RCDO is offered over RTP using SDP in an Offer/Answer model [5] for unicast and multicast usage, the limitations and rules described in Section 8.2.2 of RFC 6184 [1] apply. Note that the profile_idc byte of the H264-RCDO profile-level-id parameter can only take the value of 0 (no profile).",
      "ja": "H264-RCDOは、ユニキャストとマルチキャストの使用のためのオファー/アンサーモデル[5]でSDPを使用してRTPの上に提供される場合、制限および規則はRFC 6184のセクション8.2.2に記載の[1]適用します。 H264-RCDOプロファイルレベルIDパラメータのprofile_idcバイトのみ0（なしプロファイル）の値を取ることができることに留意されたいです。"
    },
    {
      "indent": 3,
      "text": "For interoperability with systems not supporting H264-RCDO, it is RECOMMENDED to offer the H264 media subtype as well. As specified in RFC 3264 [5], listing the payload number for H264-RCDO before H264 in the format list on the \"m=\" line signals that H264-RCDO is preferred over H264. Following is an example where this scheme is applied:",
      "ja": "H264-RCDOをサポートしていないシステムとの相互運用性のために、同様にH264メディアサブタイプを提供することをお勧めします。 RFC 3264で指定されるように[5]、H264-H264 RCDOがより好ましい「M =」行の信号にフォーマットリストにH264前H264-RCDOのペイロード番号をリスト。この方式を適用する例を示します。"
    },
    {
      "indent": 6,
      "text": "m=video 5555 RTP/AVP 97 98",
      "ja": "M =映像5555 RTP / AVP 97 98"
    },
    {
      "indent": 6,
      "text": "a=rtpmap:97 H264-RCDO/90000",
      "ja": "= rtpmap：97 H264-RCDO / 90000"
    },
    {
      "indent": 6,
      "text": "a=fmtp:97 profile-level-id=008016;max-mbps=42000;max-smbps=323500",
      "ja": "=のfmtp：97プロファイルレベルID = 008016; MAX-Mbpsの= 42000; MAX-smbps = 323500"
    },
    {
      "indent": 6,
      "text": "a=rtpmap:98 H264/90000",
      "ja": "= rtpmap：98 H264 / 90000"
    },
    {
      "indent": 6,
      "text": "a=fmtp:98 profile-level-id=428016;max-mbps=35000;max-smbps=323500",
      "ja": "=のfmtp：98プロファイルレベルID = 428016; MAX-Mbpsの= 35000; MAX-smbps = 323500"
    },
    {
      "indent": 0,
      "text": "7.2. Declarative SDP Considerations",
      "section_title": true,
      "ja": "7.2. 宣言型SDPの考慮事項"
    },
    {
      "indent": 3,
      "text": "When H264-RCDO over RTP is offered with SDP in a declarative style, as in the Real Time Streaming Protocol (RTSP) [11] or the Session Announcement Protocol (SAP) [12], the considerations in Section 8.2.3 of RFC 6184 [1] apply. Note that the profile_idc byte of the H264- RCDO profile-level-id parameter can only take the value of 0 (no profile).",
      "ja": "RTPオーバーH264-RCDOは、RFC 6184のセクション8.2.3にリアルタイムストリーミングプロトコル（RTSP）[11]またはセッションアナウンスメントプロトコル（SAP）[12]、配慮のように、宣言型スタイルでSDPで提供されている場合[1]適用します。 H264- RCDOプロファイルレベルIDパラメータのprofile_idcバイトのみ0（なしプロファイル）の値を取ることができることに留意されたいです。"
    },
    {
      "indent": 0,
      "text": "8. IANA Considerations",
      "section_title": true,
      "ja": "8. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has registered H264-RCDO as specified in Section 6.1. The media subtype has also been added to the IANA registry for \"RTP Payload Format MIME types\" (http://www.iana.org).",
      "ja": "6.1節に指定されているIANAは、H264-RCDOを登録しています。メディアサブタイプはまた、「RTPペイロードフォーマットのMIMEタイプ」（http://www.iana.org）のためのIANAレジストリに追加されました。"
    },
    {
      "indent": 0,
      "text": "9. Security Considerations",
      "section_title": true,
      "ja": "9.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "RTP packets using the payload format defined in this specification are subject to the security considerations discussed in the RTP specification [6] and in any applicable RTP profile. Refer also to the security considerations of the RTP Payload Format for H.264 Video specification in RFC 6184 [1]. No additional security considerations are introduced by this specification.",
      "ja": "本明細書で定義されたペイロードフォーマットを使用して、RTPパケットは、RTP仕様[6]および該当RTPプロファイルで議論したセキュリティ問題を受けることです。 RFC 6184でのH.264ビデオ仕様のためのRTPペイロードフォーマットのセキュリティ上の考慮事項も参照してください[1]。追加のセキュリティに関する考慮事項は、この仕様で導入されていません。"
    },
    {
      "indent": 0,
      "text": "10. Acknowledgements",
      "section_title": true,
      "ja": "10.謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to acknowledge Gisle Bjoentegaard and Arild Fuldseth for their technical contribution to the specification. In the final phases, Roni Even did a helpful review.",
      "ja": "著者は、仕様への技術的貢献のためGisle BjoentegaardとARILD Fuldsethを確認したいと思います。最終段階では、ロニはでも役に立つ見直しを行いました。"
    },
    {
      "indent": 0,
      "text": "11. References",
      "section_title": true,
      "ja": "11.参考文献"
    },
    {
      "indent": 0,
      "text": "11.1. Normative References",
      "section_title": true,
      "ja": "11.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[1] Wang, Y., Even, R., Kristensen, T., and R. Jesup, \"RTP Payload Format for H.264 Video\", RFC 6184, May 2011.",
      "ja": "[1]王、Y.、でも、R.、クリステンセン、T.、およびR.ジェサップ、 \"H.264ビデオのためのRTPペイロードフォーマット\"、RFC 6184、2011年5月。"
    },
    {
      "indent": 3,
      "text": "[2] International Telecommunications Union, \"Advanced video coding for generic audiovisual services\", ITU-T Recommendation H.264, March 2010.",
      "ja": "[2]国際電気通信連合、「一般的な視聴覚サービスのための高度なビデオコーディング」、ITU-T勧告H.264、2010年3月。"
    },
    {
      "indent": 3,
      "text": "[3] International Telecommunications Union, \"Extended video procedures and control signals for H.300-series terminals\", ITU-T Recommendation H.241, May 2006.",
      "ja": "[3]、ITU-T勧告H.241、2006年5月国際電気通信連合、「H.300シリーズ端末用の拡張映像手順と制御信号」。"
    },
    {
      "indent": 3,
      "text": "[4] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[4]ブラドナーのは、S.は、BCP 14、RFC 2119、1997年3月の \"RFCsにおける使用のためのレベルを示すために\"。"
    },
    {
      "indent": 3,
      "text": "[5] Rosenberg, J. and H. Schulzrinne, \"An Offer/Answer Model with Session Description Protocol (SDP)\", RFC 3264, June 2002.",
      "ja": "[5]ローゼンバーグ、J.、およびH. Schulzrinneと、RFC 3264 \"セッション記述プロトコル（SDP）とのオファー/アンサーモデル\" 2002年6月。"
    },
    {
      "indent": 3,
      "text": "[6] Schulzrinne, H., Casner, S., Frederick, R., and V. Jacobson, \"RTP: A Transport Protocol for Real-Time Applications\", STD 64, RFC 3550, July 2003.",
      "ja": "[6] Schulzrinneと、H.、Casner、S.、フレデリック、R.、およびV.ヤコブソン、 \"RTP：リアルタイムアプリケーションのためのトランスポートプロトコル\"、STD 64、RFC 3550、2003年7月。"
    },
    {
      "indent": 3,
      "text": "[7] Schulzrinne, H. and S. Casner, \"RTP Profile for Audio and Video Conferences with Minimal Control\", STD 65, RFC 3551, July 2003.",
      "ja": "[7] Schulzrinneと、H.とS. Casner、 \"最小量のコントロールがあるオーディオとビデオ会議システムのためのRTPプロフィール\"、STD 65、RFC 3551、2003年7月。"
    },
    {
      "indent": 3,
      "text": "[8] Handley, M., Jacobson, V., and C. Perkins, \"SDP: Session Description Protocol\", RFC 4566, July 2006.",
      "ja": "[8]ハンドリー、M.、ヤコブソン、V.、およびC.パーキンス、 \"SDP：セッション記述プロトコル\"、RFC 4566、2006年7月。"
    },
    {
      "indent": 3,
      "text": "[9] Josefsson, S., \"The Base16, Base32, and Base64 Data Encodings\", RFC 4648, October 2006.",
      "ja": "[9] Josefsson氏、S.、 \"Base16、Base32、およびBase64でデータエンコーディング\"、RFC 4648、2006年10月。"
    },
    {
      "indent": 3,
      "text": "[10] Casner, S., \"Media Type Registration of RTP Payload Formats\", RFC 4855, February 2007.",
      "ja": "[10] Casner、S.、 \"RTPペイロード形式のメディアタイプ登録\"、RFC 4855、2007年2月。"
    },
    {
      "indent": 0,
      "text": "11.2. Informative References",
      "section_title": true,
      "ja": "11.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[11] Schulzrinne, H., Rao, A., and R. Lanphier, \"Real Time Streaming Protocol (RTSP)\", RFC 2326, April 1998.",
      "ja": "[11] SchulzrinneとH.とラオとA.、およびR. Lanphier、 \"リアルタイムのストリーミングプロトコル（RTSP）\"、RFC 2326、1998年4月。"
    },
    {
      "indent": 3,
      "text": "[12] Handley, M., Perkins, C., and E. Whelan, \"Session Announcement Protocol\", RFC 2974, October 2000.",
      "ja": "[12]ハンドレー、M.、パーキンス、C.、およびE.ウィーラン、 \"セッション告知プロトコル\"、RFC 2974、2000年10月。"
    },
    {
      "indent": 3,
      "text": "[13] Freed, N. and J. Klensin, \"Media Type Specifications and Registration Procedures\", BCP 13, RFC 4288, December 2005.",
      "ja": "[13]解放され、N.とJ. Klensin、 \"メディアタイプの仕様と登録手順\"、BCP 13、RFC 4288、2005年12月。"
    },
    {
      "indent": 3,
      "text": "[14] Lennox, J., Ott, J., and T. Schierl, \"Source-Specific Media Attributes in the Session Description Protocol (SDP)\", RFC 5576, June 2009.",
      "ja": "[14]レノックス、J.、オット、J.、およびT. Schierl、RFC 5576、2009年6月 \"ソース固有のメディアセッション記述プロトコル（SDP）の属性\"。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Tom Kristensen TANDBERG Philip Pedersens vei 22 N-1366 Lysaker Norway",
      "ja": "トム・クリステンセンTANDBERGフィリップPedersens VEI 22 N-1366リサーカーノルウェー"
    },
    {
      "indent": 3,
      "text": "Phone: +47 67125125 EMail: tom.kristensen@tandberg.com, tomkri@ifi.uio.no URI: http://www.tandberg.com",
      "ja": "電話：+47 67125125 Eメール：tom.kristensen@tandberg.com、URI tomkri@ifi.uio.no：http://www.tandberg.com"
    },
    {
      "indent": 3,
      "text": "Patrick Luthi TANDBERG Philip Pedersens vei 22 N-1366 Lysaker Norway",
      "ja": "パトリック・ルティTANDBERGフィリップPedersens VEI 22 N-1366リサーカーノルウェー"
    },
    {
      "indent": 3,
      "text": "EMail: patrick.luthi@tandberg.com URI: http://www.tandberg.com",
      "ja": "電子メール：patrick.luthi@tandberg.com URI：http://www.tandberg.com"
    }
  ]
}