{
  "title": {
    "text": "RFC 6003 - Ethernet Traffic Parameters",
    "ja": "RFC 6003 - イーサネットトラフィックパラメータ"
  },
  "number": 6003,
  "created_at": "2019-10-26 20:09:52.215746+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                  D. Papadimitriou\nRequest for Comments: 6003                                Alcatel-Lucent\nUpdates: 3471, 3473                                         October 2010\nCategory: Standards Track\nISSN: 2070-1721",
      "raw": true
    },
    {
      "indent": 22,
      "text": "Ethernet Traffic Parameters",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document describes the support of Metro Ethernet Forum (MEF) Ethernet traffic parameters as described in MEF10.1 when using Generalized Multi-Protocol Label Switching (GMPLS) Resource ReSerVation Protocol - Traffic Engineering (RSVP-TE) signaling.",
      "ja": "トラフィックエンジニアリング（RSVP-TE）シグナリング - 一般化マルチプロトコルラベルスイッチング（GMPLS）リソース予約プロトコルを使用している場合MEF10.1で説明したようにこの文書では、メトロ・イーサネット・フォーラム（MEF）イーサネットトラフィックパラメータのサポートについて説明します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6003.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6003で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2010 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2010 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "Per [RFC3471], Generalized Multi-Protocol Label Switching (GMPLS) allows the inclusion of technology-specific parameters in signaling. This document introduces Ethernet SENDER_TSPEC and FLOWSPEC-specific objects in support of Metro Ethernet Forum (MEF) Ethernet traffic parameters as specified in [MEF10.1] and ITU-T Ethernet Service Switching as discussed in [RFC6004]. For example:",
      "ja": "[RFC3471]、（GMPLS）をスイッチング汎用マルチプロトコルラベルは、シグナル伝達における技術固有のパラメータを含めることを可能にします。 [RFC6004]で議論するように切り替え[MEF10.1]およびITU-Tイーサネットサービス指定され、この文書は、メトロイーサネットフォーラム（MEF）イーサネットトラフィックパラメータをサポートするイーサネットSENDER_TSPECおよびFLOWSPEC固有のオブジェクトを導入します。例えば："
    },
    {
      "indent": 3,
      "text": "o For Ethernet Private Line (EPL) services [MEF6], these traffic parameters are applicable to each Ethernet Virtual Connection (EVC) crossing a given port.",
      "ja": "Oのために、イーサネット専用回線（EPL）サービス[MEF6]は、これらのトラフィックパラメータは、特定のポートを通過する各イーサネット仮想接続（EVC）にも適用可能です。"
    },
    {
      "indent": 3,
      "text": "o For Ethernet Virtual Private Line (EVPL) services [MEF6], these traffic parameters are applicable per Ethernet Virtual Connection (EVC) with a single or multiple Class of Service (CoS), independent of its associated Virtual LAN ID (VID) or set of VIDs.",
      "ja": "Oイーサネット仮想専用線（EVPL）サービス[MEF6]について、これらのトラフィックパラメータは、それに関連付けられた仮想LAN ID（VID）またはセットの独立したサービスクラス（CoS）の単一または複数のクラスを持つイーサネット仮想接続（EVC）あたり適用されますVIDの。"
    },
    {
      "indent": 6,
      "text": "Association between EVC and VIDs is detailed in [MEF10.1]. The format and encoding of the VID (or set of VIDs) is documented in a companion document [RFC6004].",
      "ja": "EVCとのVIDとの間の関連付けは、[MEF10.1]に詳述されています。 VID（またはVIDのセット）のフォーマット及び符号化は仲間ドキュメント[RFC6004]に記載されています。"
    },
    {
      "indent": 3,
      "text": "This does not preclude broader usage of the Ethernet SENDER_TSPEC and FLOWSPEC-specific objects specified this document. For instance, they may also be used for signaling Ethernet Label Switched Paths (LSPs), in the Generalized Label Request (see [RFC3471]), the Switching Type field is set to Layer 2 Switching Capability (L2SC) and the LSP Encoding Type field to Ethernet.",
      "ja": "これは、この文書を指定したイーサネットSENDER_TSPECとFLOWSPEC固有のオブジェクトのより広範な使用を妨げるものではありません。例えば、それらは、イーサネットラベル一般ラベル要求（[RFC3471]を参照）、スイッチングタイプフィールドが2スイッチング能力（L2SC）とLSP符号化タイプフィールドを層に設定されている、（LSPを）パスを交換シグナリングのためにも使用することができますイーサネットへ。"
    },
    {
      "indent": 0,
      "text": "2. Conventions Used in This Document",
      "section_title": true,
      "ja": "この文書で使用される2.表記"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "ja": "この文書のキーワード \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", および \"OPTIONAL\" はRFC 2119 [RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 3,
      "text": "Moreover, the reader is assumed to be familiar with the terminology in [MEF10.1] as well as in [RFC3471] and [RFC3473].",
      "ja": "また、読者は[MEF10.1]ならびに[RFC3471]及び[RFC3473]に用語に精通しているものとします。"
    },
    {
      "indent": 0,
      "text": "3. Overview",
      "section_title": true,
      "ja": "3.概要"
    },
    {
      "indent": 3,
      "text": "In GMPLS RSVP-TE [RFC3473], the SENDER_TSPEC object is used on a Path message to indicate the bandwidth that is requested for the LSP being established, and the FLOWSPEC object is used on a Resv message to indicate the bandwidth actually reserved for the LSP. The Ethernet SENDER_TSPEC/FLOWSPEC object includes the Ethernet link type (switching granularity) of the requested LSP and the MTU value for the LSP. Other information about the requested bandwidth characteristics of the LSP are carried in the Bandwidth Profile as a TLV within the Ethernet SENDER_TSPEC/FLOWSPEC object.",
      "ja": "実際にLSPのために予約された帯域幅を示すために、GMPLS RSVP-TE [RFC3473]において、SENDER_TSPECオブジェクトが確立されているLSPのために要求される帯域幅を示すために、Pathメッセージに使用され、FLOWSPECオブジェクトは、Resvメッセージで使用され。イーサネットSENDER_TSPEC / FLOWSPECオブジェクトは要求されたLSPとLSPのMTU値のイーサネットリンクタイプ（スイッチング粒度）を含みます。 LSPの要求帯域特性に関する他の情報は、イーサネットSENDER_TSPEC / FLOWSPECオブジェクト内のTLVとして帯域幅プロファイルに運ばれます。"
    },
    {
      "indent": 3,
      "text": "The Ethernet SENDER_TSPEC/FLOWSPEC object includes the Ethernet link type (switching granularity) of the requested LSP and the MTU value for the LSP.",
      "ja": "イーサネットSENDER_TSPEC / FLOWSPECオブジェクトは要求されたLSPとLSPのMTU値のイーサネットリンクタイプ（スイッチング粒度）を含みます。"
    },
    {
      "indent": 3,
      "text": "The Bandwidth Profile defines the set of traffic parameters applicable to a sequence of Service Frames, referred to as bandwidth profile parameters (as specified in [MEF10.1]):",
      "ja": "帯域幅プロファイルは、サービスフレームのシーケンスに適用可能なトラフィックパラメータのセットを定義し、（[MEF10.1]で指定されるように）帯域幅プロファイルパラメータと呼びます。"
    },
    {
      "indent": 3,
      "text": "o Committed Rate: indicates the rate at which traffic commits to be sent to the Ethernet LSP. The committed rate is described in terms of the CIR (Committed Information Rate) and CBS (Committed Burst Size) traffic parameters.",
      "ja": "Oコミットレート：トラフィックは、イーサネットLSPに送信されるようにコミットする速度を示します。認定速度はCIR（認定情報レート）とCBS（認定バーストサイズ）トラフィックパラメータの観点から説明されます。"
    },
    {
      "indent": 6,
      "text": "o CIR is defined as the average rate (in bytes per unit of time) up to which the network is committed to transfer frames and meets its performance objectives.",
      "ja": "O CIRは、ネットワークがフレームを転送することを約束し、そのパフォーマンス目標を満たしているアップれる（単位時間当たりのバイト数）平均速度として定義されます。"
    },
    {
      "indent": 6,
      "text": "o CBS defines a limit on the maximum number of information units (e.g., bytes) available for a burst of frames sent at the interface speed to remain CIR-conformant.",
      "ja": "O CBSは、CIRに準拠したままにインターフェイス速度で送信されたフレームのバーストのために利用可能な情報単位（例えば、バイト）の最大数に制限を定義します。"
    },
    {
      "indent": 3,
      "text": "o Excess Rate: indicates the extent by which the traffic sent on an Ethernet LSP exceeds the committed rate. The Excess Rate is described in terms of the EIR (Excess Information Rate) and EBS (Excess Burst Size) traffic parameters.",
      "ja": "O超過レートは：イーサネットLSP上で送信されるトラフィックが認定速度を超過する範囲を示します。超過レートは、EIR（超過情報レート）およびEBS（超過バーストサイズ）トラフィックパラメータの観点から説明されます。"
    },
    {
      "indent": 6,
      "text": "o EIR is defined as the average rate (in bytes per unit of time), in excess of the CIR, up to which the network may transfer frames without any performance objectives.",
      "ja": "EIRは、（単位時間当たりのバイト数）平均速度として定義されるO、CIRを超過し、これまでのネットワークは、任意の性能目標なしでフレームを転送することができます。"
    },
    {
      "indent": 6,
      "text": "o EBS defines a limit on the maximum number of information units (e.g., bytes) available for a burst of frames sent at the interface speed to remain EIR-conformant.",
      "ja": "O EBSは、EIRに準拠したままにインターフェイス速度で送信されたフレームのバーストのために利用可能な情報単位（例えば、バイト）の最大数に制限を定義します。"
    },
    {
      "indent": 3,
      "text": "o Color mode (CM): indicates whether the \"color-aware\" or \"color-blind\" property is employed by the bandwidth profile.",
      "ja": "Oカラーモード（CM）は、「カラー対応」または「カラーブラインド」プロパティは、帯域幅プロファイルによって使用されるかどうかを示します。"
    },
    {
      "indent": 3,
      "text": "o Coupling flag (CF): allows the choice between two modes of operation of the rate enforcement algorithm.",
      "ja": "Oカップリングフラグ（CF）：レート執行アルゴリズムの2つの動作モード間の選択を可能にします。"
    },
    {
      "indent": 0,
      "text": "4. Ethernet SENDER_TSPEC Object",
      "section_title": true,
      "ja": "4.イーサネットSENDER_TSPECオブジェクト"
    },
    {
      "indent": 3,
      "text": "The Ethernet SENDER_TSPEC object (Class-Num = 12, Class-Type = 6) has the following format:",
      "ja": "イーサネットSENDER_TSPECオブジェクト（クラス民12 =、クラスタイプ= 6）は、以下のフォーマットを有します。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|            Length             | Class-Num (12)|   C-Type (6)  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Switching Granularity     |              MTU              |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                                                               |\n~                              TLVs                             ~\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Switching Granularity (SG): 16 bits",
      "ja": "スイッチング粒度（SG）：16ビット"
    },
    {
      "indent": 6,
      "text": "This field indicates the type of link that comprises the requested Ethernet LSP.",
      "ja": "このフィールドは、要求されたイーサネットLSPを備えるリンクのタイプを示します。"
    },
    {
      "indent": 6,
      "text": "The permitted Ethernet Link Type values are:",
      "ja": "許可イーサネットリンクタイプの値は次のとおりです。"
    },
    {
      "indent": 9,
      "text": "Value   Switching Granularity\n-----   ---------------------\n  0     Provided in signaling.  See [RFC6004].\n  1     Ethernet Port (for port-based service)\n  2     Ethernet Frame (for EVC-based service)\n255     Reserved",
      "raw": true
    },
    {
      "indent": 6,
      "text": "Values 0 to 2 are specified by the present document. Values 3 through 239 are to be assigned by IANA via Standards Action [RFC5226]. Value 255 is reserved by the present document (its Length is to be determined by the RFC that will specify it).",
      "ja": "0〜2の値が、本文書で指定されています。 3 239までの値は、標準アクション[RFC5226]を経由してIANAによって割り当てられることになっています。値255は、本文書によって予約されている（その長さは、それを指定しますRFCによって決定されるべきです）。"
    },
    {
      "indent": 6,
      "text": "Values 240 through 254 are reserved for vendor-specific use.",
      "ja": "254までの値240は、ベンダー固有の使用のために予約されています。"
    },
    {
      "indent": 6,
      "text": "Values 256 through 65535 are not assigned at this time.",
      "ja": "65535までの値256は、この時点で割り当てられていません。"
    },
    {
      "indent": 3,
      "text": "MTU: 16 bits",
      "ja": "MTU：16ビット"
    },
    {
      "indent": 6,
      "text": "This is a two-octet value indicating the MTU in octets.",
      "ja": "これは、オクテットでMTUを示す2オクテット値です。"
    },
    {
      "indent": 6,
      "text": "The MTU field MUST NOT take a value smaller than 46 bytes for Ethernet v2 [ETHv2] and 38 bytes for IEEE 802.3 [IEEE802.3].",
      "ja": "MTUフィールドは、イーサネットV2 [ETHv2]とIEEE 802.3 [IEEE802.3]のための38のバイトを46バイトよりも小さい値を取るてはいけません。"
    },
    {
      "indent": 3,
      "text": "TLV (Type-Length-Value):",
      "ja": "TLV（タイプ - 長さ - 値）："
    },
    {
      "indent": 6,
      "text": "The Ethernet SENDER_TSPEC object MUST include at least one TLV and MAY include more than one TLV.",
      "ja": "イーサネットSENDER_TSPECオブジェクトは、少なくとも一つのTLVを含まなければならないし、複数のTLVを含むかもしれません。"
    },
    {
      "indent": 6,
      "text": "Each TLV MUST have the following format:",
      "ja": "各TLVは、次の形式を持つ必要があります。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|              Type             |             Length            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                                                               |\n~                             Value                             ~\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Type: 16 bits",
      "ja": "種類：16ビット"
    },
    {
      "indent": 6,
      "text": "Defined values are:",
      "ja": "定義された値は次のとおりです。"
    },
    {
      "indent": 6,
      "text": "Type     Length   Format            Description\n------------------------------------------------------\n  0         -     Reserved          Reserved value\n  1         -     Reserved          Reserved value\n  2        24     see Section 3.1   Ethernet Bandwidth\n                                    Profile [MEF10.1]\n  3         8     [RFC6004]         Layer 2 Control\n                                    Protocol (L2CP)\n255         -     Reserved          Reserved value",
      "raw": true
    },
    {
      "indent": 6,
      "text": "Values 0, 1, and 255 are reserved by the present document. Values 2 and 3 are specified by the present document.",
      "ja": "値が0、1、および255が、本文書によって予約されています。値は2と3が、本文書で指定されています。"
    },
    {
      "indent": 6,
      "text": "Values 4 through 239 are to be assigned by IANA via Standards Action [RFC5226].",
      "ja": "4 239を介して値が標準アクション[RFC5226]を介して、IANAによって割り当てられます。"
    },
    {
      "indent": 6,
      "text": "Values 240 through 254 are reserved for vendor-specific use.",
      "ja": "254までの値240は、ベンダー固有の使用のために予約されています。"
    },
    {
      "indent": 6,
      "text": "Values 256 through 65535 are not assigned at this time.",
      "ja": "65535までの値256は、この時点で割り当てられていません。"
    },
    {
      "indent": 3,
      "text": "Length: 16 bits",
      "ja": "長さ：16ビット"
    },
    {
      "indent": 6,
      "text": "Indicates the length in bytes of the whole TLV including the Type and Length fields. A value field whose length is not a multiple of four MUST be zero-padded (with trailing zeros) so that the TLV is four-octet aligned.",
      "ja": "タイプと長さフィールドを含む全体TLVの長さをバイト単位で示します。 TLVは4オクテット整列されるように、その長さが4の倍数でない値フィールドは、ゼロパディング（末尾のゼロを有する）でなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.1. Ethernet Bandwidth Profile TLV",
      "section_title": true,
      "ja": "4.1。イーサネット帯域幅プロファイルTLV"
    },
    {
      "indent": 3,
      "text": "The Type 2 TLV specifies the Ethernet Bandwidth Profile (BW profile). It defines an upper bound on the volume of the expected service frames belonging to a particular Ethernet service instance. The Ethernet SENDER_TSPEC object MAY include more than one Ethernet Bandwidth Profile TLV.",
      "ja": "タイプ2のTLVは、イーサネットの帯域幅プロファイル（BWプロファイル）を指定します。これは、特定のイーサネットサービスインスタンスに属する予想サービスフレームの量の上限を規定します。イーサネットSENDER_TSPECオブジェクトは、複数のイーサネット帯域幅プロファイルTLVを含むかもしれません。"
    },
    {
      "indent": 3,
      "text": "The Type 2 TLV has the following format:",
      "ja": "タイプ2のTLVの形式は次のとおりです。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|    Profile    |     Index     |            Reserved           |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                              CIR                              |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                              CBS                              |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                              EIR                              |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                              EBS                              |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Profile: 8 bits",
      "ja": "プロフィール：8ビット"
    },
    {
      "indent": 6,
      "text": "This field is defined as a bit vector of binary flags. The following flags are defined:",
      "ja": "このフィールドは、バイナリフラグのビットベクトルとして定義されます。次のフラグが定義されています。"
    },
    {
      "indent": 9,
      "text": "Flag 1 (bit 0): Coupling Flag (CF) Flag 2 (bit 1): Color Mode (CM)",
      "ja": "フラグ1（ビット0）：カップリングフラグ（CF）、フラグ2（ビット1）：カラーモード（CM）"
    },
    {
      "indent": 6,
      "text": "Where bit 0 is the low order bit. Other flags are reserved, they SHOULD be set to zero when sent, and SHOULD be ignored when received.",
      "ja": "ビット0は、下位ビットです。他のフラグは予約されて送信されたとき、彼らはゼロに設定する必要があり、受信時に無視されるべきです。"
    },
    {
      "indent": 6,
      "text": "A flag is set to value 1 to indicate that the corresponding metering profile is requested.",
      "ja": "フラグは、対応する計量プロファイルが要求されていることを示す値1に設定されています。"
    },
    {
      "indent": 6,
      "text": "The Flag 1 (CF) allows the choice between two modes of operation of the rate enforcement algorithm.",
      "ja": "旗1（CF）は、レート執行アルゴリズムの2つの動作モード間の選択を可能にします。"
    },
    {
      "indent": 6,
      "text": "The Flag 2 (CM) indicates whether the color-aware or color-blind property [MEF10.2] is employed by the bandwidth profile. When Flag 2 is set to value 0 (1), the bandwidth profile algorithm is said to be in color-blind (color-aware) mode.",
      "ja": "フラグ2（CM）[MEF10.2】色認識や色盲性かどうかを示す帯域幅プロファイルによって使用されます。フラグ2を値0に設定されている場合（1）、帯域幅プロファイルアルゴリズムは色盲（カラー対応）モードにあると言われます。"
    },
    {
      "indent": 3,
      "text": "Index: 8 bits",
      "ja": "インデックス：8ビット"
    },
    {
      "indent": 6,
      "text": "The Index field is used to reference bandwidth allocated for a given traffic class in case a multiple-class LSP is being requested. The Index field value MUST correspond to at least one of the Class-Type values included either in the CLASSTYPE object [RFC4124] or in the EXTENDED_CLASSTYPE object [MCOS].",
      "ja": "インデックスフィールドは、ケース内に所定のトラフィック・クラスのためにLSPが要求されている複数のクラスに割り当てられた帯域幅を参照するために使用されます。インデックスフィールドの値は、クラスタイプ値の少なくとも1つに対応しなければならない【のMCO]するClassTypeオブジェクト[RFC4124]またはEXTENDED_CLASSTYPEオブジェクトのいずれかに含まれます。"
    },
    {
      "indent": 6,
      "text": "A given index value j can be associated to at most N Class-Type values CTi (i =< N) of the EXTENDED_CLASSTYPE object. This association applies when a set of one or more CTIs maps to a single (shared) BW profile. An example of value setting consists in assigning an arbitrary value comprised within the range [0x08,0xF8] associated to a set of CTi, the values in the range [0xF8,0xFF] being selected for reserved sets. This allows mapping to one of 248 predefined CTi sets.",
      "ja": "指定されたインデックス値jは、CTI EXTENDED_CLASSTYPEオブジェクトの（I = <N）が最もNクラスタイプでに値関連付けることができます。一の以上のCTIのセットは、単一の（共有）BWプロファイルにマップすると、この関連付けが適用されます。値の設定の例は、CTIのセットに関連する範囲[0x08,0xF8]内に含まれる任意の値を割り当てることからなる、範囲[0xF8,0xFF]の値は、予約設定のために選択されます。これは、248の事前定義されたCTIセットの一つにマッピングすることを可能にします。"
    },
    {
      "indent": 6,
      "text": "A given index value j can be associated to a single CTi (1:1 correspondence). In this case, the index value setting consists in assigning the 3 least significant bits of the Index field itself to the CTi value itself (comprised in the range [0x00,0x07]). This applies in case a single CTi maps a single (dedicated) BW profile or multiple (dedicated) BW profiles. In the former case, the Ethernet SENDER_TSPEC object includes a single Ethernet Bandwidth Profile TLV. In the latter case, the Ethernet SENDER_TSPEC includes a set of more than one Ethernet Bandwidth Profile TLVs (whose respective index value is associated to a single CTi value).",
      "ja": "（1：1対応）指定されたインデックス値jは、単一のCTIに関連付けることができます。この場合、指標値設定（範囲[0x00,0x07]に含まれる）のCTI値自体にインデックスフィールド自体の3つの最下位ビットを割り当てることにあります。これは、単一のCTIは、シングル（専用）BWプロファイルまたは複数の（専用）BWプロファイルをマップする場合に適用されます。前者の場合、イーサネットSENDER_TSPECオブジェクトは、単一のイーサネット帯域幅プロファイルTLVを含みます。後者の場合には、イーサネットSENDER_TSPECは（それぞれのインデックス値の単一のCTI値に関連付けられている）複数のイーサネット帯域幅プロファイルのTLVのセットを含みます。"
    },
    {
      "indent": 6,
      "text": "Note that the current specification allows for combining shared and dedicated BW profiles to the same LSP. That is, an Ethernet SENDER_TSPEC object MAY include multiple Ethernet Bandwidth Profile TLVs whose respective index can be associated on a 1:1 basis to a single CTi or to a set of multiple CTis.",
      "ja": "現在の仕様は同じLSPに共有および専用BWプロファイルを組み合わせることを可能にすることに留意されたいです。単一のCTIまたは複数CTISのセットに1基準：すなわちイーサネットSENDER_TSPECオブジェクトは、そのそれぞれのインデックス1に関連付けることができる複数のイーサネット帯域幅プロファイルTLVを含む場合があります。"
    },
    {
      "indent": 6,
      "text": "For each subobject of the EXTENDED_CLASSTYPE object [MCOS]:",
      "ja": "EXTENDED_CLASSTYPEオブジェクト【のMCO]の各サブオブジェクトのために："
    },
    {
      "indent": 9,
      "text": "o Each CTi value SHOULD correspond 1:1 to the MEF Customer Edge VLAN CoS (CE-VLAN CoS).",
      "ja": "MEFカスタマエッジVLANのCoS（CE-VLANのCoS）に1：O各CTI値が1に対応すべきです。"
    },
    {
      "indent": 9,
      "text": "o The BW requested per CTi field MAY be used for bandwidth accounting purposes.",
      "ja": "O CTI分野ごとに要求されたBWは帯域幅、会計目的で使用することができます。"
    },
    {
      "indent": 6,
      "text": "By default, the value of the Index field MUST be set to 0.",
      "ja": "デフォルトでは、インデックスフィールドの値が0に設定しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Reserved: 16 bits",
      "ja": "予約：16ビット"
    },
    {
      "indent": 6,
      "text": "These bits SHOULD be set to zero when sent and MUST be ignored when received.",
      "ja": "送受信時に無視しなければならない場合、これらのビットはゼロに設定されるべきです。"
    },
    {
      "indent": 3,
      "text": "CIR (Committed Information Rate): 32 bits",
      "ja": "CIR（認定情報レート）：32ビット"
    },
    {
      "indent": 6,
      "text": "The value of the CIR is in units of bytes per second. The CIR is encoded as a 32-bit IEEE single-precision floating-point number (see [RFC4506]).",
      "ja": "CIRの値は、秒あたりのバイトの単位です。 CIRは、32ビットIEEE単精度浮動小数点数として符号化される（[RFC4506]を参照）。"
    },
    {
      "indent": 6,
      "text": "The CIR value MUST be greater than or equal to 0.",
      "ja": "CIR値が0より大きいかまたは等しくなければなりません。"
    },
    {
      "indent": 3,
      "text": "CBS (Committed Burst Size): 32 bits",
      "ja": "CBS（認定バーストサイズ）：32ビット"
    },
    {
      "indent": 6,
      "text": "The value of the CBS is in units of bytes. The CBS is encoded as a 32-bit IEEE single-precision floating-point number (see [RFC4506]).",
      "ja": "CBSの値はバイト単位です。 CBSは、32ビットIEEE単精度浮動小数点数として符号化される（[RFC4506]を参照）。"
    },
    {
      "indent": 6,
      "text": "When CIR is strictly greater than 0 (CIR > 0), the CBS MUST be greater than or equal to the maximum frame size.",
      "ja": "CIRが0（CIR> 0）よりも厳密に大きい場合、CBSは、最大フレームサイズより大きいか等しくなければなりません。"
    },
    {
      "indent": 3,
      "text": "EIR (Excess Information Rate): 32 bits",
      "ja": "EIR（超過情報レート）：32ビット"
    },
    {
      "indent": 6,
      "text": "The value of the EIR is in units of bytes per second. The EIR is encoded as a 32-bit IEEE single-precision floating-point number (see [RFC4506]).",
      "ja": "EIRの値は、秒あたりのバイトの単位です。 EIRは、32ビットIEEE単精度浮動小数点数として符号化される（[RFC4506]を参照）。"
    },
    {
      "indent": 6,
      "text": "The EIR value MUST be greater than or equal to 0.",
      "ja": "EIR値は0以上でなければなりません。"
    },
    {
      "indent": 3,
      "text": "EBS (Excess Burst Size): 32 bits",
      "ja": "EBS（超過バーストサイズ）：32ビット"
    },
    {
      "indent": 6,
      "text": "The value of the EBS is in units of bytes. The EBS is encoded as a 32-bit IEEE single-precision floating-point number (see [RFC4506]).",
      "ja": "EBSの値はバイト単位です。 EBSは、32ビットIEEE単精度浮動小数点数として符号化される（[RFC4506]を参照）。"
    },
    {
      "indent": 6,
      "text": "When EIR is strictly greater than 0 (EIR > 0), the EBS MUST be greater than or equal to the maximum frame size.",
      "ja": "EIRは、0（EIR> 0）よりも厳密に大きい場合、EBSは、最大フレームサイズより大きいか等しくなければなりません。"
    },
    {
      "indent": 0,
      "text": "5. Ethernet FLOWSPEC Object",
      "section_title": true,
      "ja": "5.イーサネットFLOWSPECオブジェクト"
    },
    {
      "indent": 3,
      "text": "The Ethernet FLOWSPEC object (Class-Num = 9, Class-Type = 6) has the same format as the Ethernet SENDER_TSPEC object.",
      "ja": "イーサネットFLOWSPECオブジェクト（クラス民= 9、クラスタイプ= 6）は、イーサネットSENDER_TSPECオブジェクトと同じフォーマットを有します。"
    },
    {
      "indent": 0,
      "text": "6. Ethernet ADSPEC Object",
      "section_title": true,
      "ja": "6.イーサネットadspectオブジェクト"
    },
    {
      "indent": 3,
      "text": "There is no ADSPEC object associated with the Ethernet SENDER_TSPEC object.",
      "ja": "イーサネットSENDER_TSPECオブジェクトに関連付けられADSPECオブジェクトがありません。"
    },
    {
      "indent": 3,
      "text": "Either the ADSPEC object is omitted or an IntServ ADSPEC with the Default General Characterization Parameters and Guaranteed Service fragment is used, see [RFC2210].",
      "ja": "どちらのADSPECオブジェクトは省略またはデフォルトの一般的な特性評価パラメータを使用したイントサーブADSPEC保証サービスフラグメントが使用されている、[RFC2210]を参照してください。"
    },
    {
      "indent": 0,
      "text": "7. Processing",
      "section_title": true,
      "ja": "7.処理"
    },
    {
      "indent": 3,
      "text": "The Ethernet SENDER_TSPEC and FLOWSPEC objects specified in this document MAY be used for signaling Ethernet LSP. For signaling such an LSP, in the Generalized LABEL_REQUEST object (see [RFC3471]), the Switching Type field MUST be set to the value 51 (L2SC) and the LSP Encoding Type field MUST be set to the value 2 (Ethernet).",
      "ja": "この文書で指定されたイーサネットSENDER_TSPECおよびFLOWSPECオブジェクトは、イーサネットLSPをシグナリングするために使用されるかもしれません。そのようなLSPをシグナリングするために、一般化LABEL_REQUESTオブジェクト（[RFC3471]を参照）、スイッチングTypeフィールドは、値51（L2SC）に設定しなければならなくて、LSP符号化タイプフィールドは、値2（イーサネット）に設定しなければなりません。"
    },
    {
      "indent": 3,
      "text": "The Ethernet SENDER_TSPEC object carries the traffic specification generated by the RSVP session sender. The Ethernet SENDER_TSPEC object SHOULD be forwarded and delivered unchanged to both intermediate and egress nodes.",
      "ja": "イーサネットSENDER_TSPECオブジェクトは、RSVPセッションの送信者によって生成されたトラフィック仕様を運びます。イーサネットSENDER_TSPECオブジェクトが転送され、中間及び出力の両方のノードに不変で送達されるべきです。"
    },
    {
      "indent": 3,
      "text": "The Ethernet FLOWSPEC object carries reservation request information generated by receivers. As with any FLOWSPEC object, the Ethernet FLOWSPEC object flows upstream toward the ingress node.",
      "ja": "イーサネットFLOWSPECオブジェクトは、受信機によって生成された予約要求情報を運びます。任意FLOWSPECオブジェクトと同様に、イーサネットFLOWSPECオブジェクトが入口ノードに向かって上流に流れます。"
    },
    {
      "indent": 3,
      "text": "Intermediate and egress nodes MUST verify that the node itself and the interfaces on which the LSP will be established can support the requested Switching Granularity, MTU and values included in subobject TLVs. These nodes MUST be configured with the same predefined CT sets as the index value signaled as part of the Index field of the Ethernet Bandwidth Profile TLV (see Section 4.1). If the requested value(s) cannot be supported, the receiver node MUST generate a PathErr message with the error code \"Traffic Control Error\" and the error value \"Service unsupported\" (see [RFC2205]).",
      "ja": "中間および出力ノードはノード自体とLSPが確立されているインターフェイスは、要求スイッチング粒度、MTUおよびサブオブジェクトのTLVに含まれる値をサポートできることを確認しなければなりません。インデックス値は、TLV（セクション4.1を参照）プロファイルイーサネット帯域のインデックスフィールドの一部としてシグナリングとしてこれらのノードは、同一の事前定義されたCTセットを構成しなければなりません。要求された値（S）をサポートすることができない場合、受信ノードはエラーコード「トラフィック制御誤差」とエラー値「サポートされないサービス」とのPathErrメッセージを発生させなければなりません（[RFC2205]を参照）。"
    },
    {
      "indent": 3,
      "text": "In addition, if the MTU field is received with a value smaller than the minimum transfer unit size of the Ethernet frame (e.g., 46 bytes for Ethernet v2, 38 bytes for IEEE 802.3), the node MUST generate a PathErr message with the error code \"Traffic Control Error\" and the error value \"Bad Tspec value\" (see [RFC2205]).",
      "ja": "MTUフィールドは、イーサネットフレームの最小転送単位のサイズよりも小さい値と受信した場合に加えて、（例えば、イーサネット（登録商標）v2の46バイト、IEEE 802.3のための38バイト）は、ノードはエラーコードでのPathErrメッセージを生成しなければなりません「トラフィック制御誤差」とエラー値「不正のTspec値」（[RFC2205]を参照）。"
    },
    {
      "indent": 3,
      "text": "Error processing of the CLASSTYPE object follows rules defined in [RFC4124]. Error processing of the EXTENDED_CLASSTYPE object follows rules defined in [MCOS]. Moreover, a Label Switching Router (LSR) receiving a Path message with the EXTENDED_CLASSTYPE object, which recognizes the object and the particular Class-Type but does detect a mismatch in the index values, MUST send a PathErr message towards the sender with the error code \"Extended Class-Type Error\" and the error value \"Class-Type mismatch\" (see [RFC2205]).",
      "ja": "するClassTypeオブジェクトのエラー処理は、[RFC4124]で定義されたルールに従います。 EXTENDED_CLASSTYPEオブジェクトのエラー処理は、[のMCO]で定義されたルールに従います。また、オブジェクトおよび特定のクラスタイプを認識するが、インデックス値の不一致を検出しEXTENDED_CLASSTYPEオブジェクトとPathメッセージを受信したルータ（LSR）ラベルスイッチングは、エラーコードを送信側に向けたPathErrメッセージを送らなければなりません「拡張クラスタイプエラー」とエラー値「クラス型の不一致」（[RFC2205]を参照）。"
    },
    {
      "indent": 0,
      "text": "8. Security Considerations",
      "section_title": true,
      "ja": "8.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document introduces no new security considerations to [RFC3473].",
      "ja": "この文書では、[RFC3473]への新しいセキュリティ問題も紹介しません。"
    },
    {
      "indent": 3,
      "text": "GMPLS security is described in Section 11 of [RFC3471] and refers to [RFC3209] for RSVP-TE. Further details of MPLS-TE and GMPLS security can be found in [RFC5920].",
      "ja": "GMPLSセキュリティは、[RFC3471]のセクション11に記載され、RSVP-TEのために[RFC3209]を指します。 MPLS-TEやGMPLSセキュリティのさらなる詳細は、[RFC5920]に見出すことができます。"
    },
    {
      "indent": 0,
      "text": "9. IANA Considerations",
      "section_title": true,
      "ja": "9. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA maintains registries and sub-registries for RSVP-TE as used by GMPLS. IANA has made allocations from these registries as set out in the following sections.",
      "ja": "GMPLSで使用されるIANAは、RSVP-TEのためのレジストリサブレジストリを維持します。 IANAは、次のセクションに記載されたように、これらのレジストリから割り当てを行っています。"
    },
    {
      "indent": 0,
      "text": "9.1. RSVP Objects Class Types",
      "section_title": true,
      "ja": "9.1。 RSVPは、クラスの型オブジェクト"
    },
    {
      "indent": 3,
      "text": "This document introduces two new Class Types for existing RSVP objects. IANA has made allocations from the \"Resource ReSerVation Protocol (RSVP) Parameters\" registry using the \"Class Names, Class Numbers, and Class Types\" sub-registry.",
      "ja": "この文書では、既存のRSVPオブジェクトのための2つの新しいクラスの型を紹介します。 IANAは、「クラス名、クラス番号、およびクラスの型」サブレジストリを使用して、「リソース予約プロトコル（RSVP）パラメータ」レジストリから割り当てを行いました。"
    },
    {
      "indent": 3,
      "text": "Class Number  Class Name                            Reference\n------------  -----------------------               ---------\n9             FLOWSPEC                              [RFC2205]",
      "raw": true
    },
    {
      "indent": 17,
      "text": "Class Type (C-Type):",
      "ja": "クラスタイプ（Cタイプ）："
    },
    {
      "indent": 17,
      "text": "6 Ethernet SENDER_TSPEC [RFC6003]",
      "ja": "6イーサネットSENDER_TSPEC [RFC6003]"
    },
    {
      "indent": 3,
      "text": "Class Number  Class Name                            Reference\n------------  -----------------------               ---------\n12            SENDER_TSPEC                          [RFC2205]",
      "raw": true
    },
    {
      "indent": 17,
      "text": "Class Type (C-Type):",
      "ja": "クラスタイプ（Cタイプ）："
    },
    {
      "indent": 17,
      "text": "6 Ethernet SENDER_TSPEC [RFC6003]",
      "ja": "6イーサネットSENDER_TSPEC [RFC6003]"
    },
    {
      "indent": 0,
      "text": "9.2. Ethernet Switching Granularities",
      "section_title": true,
      "ja": "9.2。イーサネットスイッチング粒度"
    },
    {
      "indent": 3,
      "text": "IANA maintains a registry of GMPLS parameters called \"Generalized Multi-Protocol Label Switching (GMPLS) Signaling Parameters\".",
      "ja": "IANAは、「一般化マルチプロトコルラベルは（GMPLS）シグナリングパラメータの切り替え」と呼ばれるGMPLSパラメータのレジストリを維持します。"
    },
    {
      "indent": 3,
      "text": "IANA has created a new sub-registry called \"Ethernet Switching Granularities\" to contain the values that may be carried in the Switching Granularity field of the Ethernet SENDER_TSPEC object.",
      "ja": "IANAは、イーサネットSENDER_TSPECオブジェクトの切り替え粒度フィールドで行うことができる値が含まれているために、「イーサネットスイッチングの粒度」と呼ばれる新しいサブレジストリを作成しました。"
    },
    {
      "indent": 3,
      "text": "Values are as follows:",
      "ja": "値は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "0-2 See below. 3-239 Unassigned 240-254 Reserved for Vendor-Specific Use 255 Reserved 256-65535 Not assigned at this time",
      "ja": "0-2は、下記を参照してください。予約256から65535は、この時に割り当てられていないベンダー固有の使用255のために予約されて3から239 240から254未割り当て"
    },
    {
      "indent": 3,
      "text": "The registration procedure is Standards Action.",
      "ja": "登録手続きの標準アクションです。"
    },
    {
      "indent": 3,
      "text": "Initial entries in this sub-registry are as follows:",
      "ja": "次のようにこのサブレジストリ内の最初のエントリは次のとおりです。"
    },
    {
      "indent": 3,
      "text": "Value   Switching Granularity                    Reference\n-----   --------------------------------------   ------------------\n  0     Provided in signaling.                   [RFC6003][RFC6004]\n  1     Ethernet Port (for port-based service)   [RFC6003]\n  2     Ethernet Frame (for EVC-based service)   [RFC6003]\n255     Reserved                                 [RFC6003]",
      "raw": true
    },
    {
      "indent": 0,
      "text": "9.3. Ethernet Sender TSpec TLVs",
      "section_title": true,
      "ja": "9.3。イーサネット送信者TSpecのTLVを"
    },
    {
      "indent": 3,
      "text": "IANA maintains a registry of GMPLS parameters called \"Generalized Multi-Protocol Label Switching (GMPLS) Signaling Parameters\".",
      "ja": "IANAは、「一般化マルチプロトコルラベルは（GMPLS）シグナリングパラメータの切り替え」と呼ばれるGMPLSパラメータのレジストリを維持します。"
    },
    {
      "indent": 3,
      "text": "IANA has created a new sub-registry called \"Ethernet Sender TSpec TLVs / Ethernet Flowspec TLVs\" to contain the TLV type values for TLVs carried in the Ethernet SENDER_TSPEC object.",
      "ja": "IANAは、イーサネットSENDER_TSPECオブジェクトで運ばれたTLVのためのTLVタイプの値を含むように、「イーサネット送信者TSpecのTLVを/イーサネットフロースペックのTLV」と呼ばれる新しいサブレジストリを作成しました。"
    },
    {
      "indent": 3,
      "text": "Values are as follows:",
      "ja": "値は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "0-3 See below. 4-239 Unassigned 240-254 Reserved for Vendor-Specific Use 255 Reserved 256-65535 Not assigned at this time",
      "ja": "0-3は、下記を参照してください。予約256から65535は、この時に割り当てられていないベンダー固有の使用255のために予約されて4から239 240から254未割り当て"
    },
    {
      "indent": 3,
      "text": "The registration procedure is Standards Action.",
      "ja": "登録手続きの標準アクションです。"
    },
    {
      "indent": 3,
      "text": "Initial entries in this sub-registry are as follows:",
      "ja": "次のようにこのサブレジストリ内の最初のエントリは次のとおりです。"
    },
    {
      "indent": 3,
      "text": "Type     Description                        Reference\n-----    --------------------------------   ---------\n  0      Reserved                           [RFC6003]\n  1      Reserved                           [RFC6003]\n  2      Ethernet Bandwidth Profile         [RFC6003]\n  3      Layer 2 Control Protocol (L2CP)    [RFC6003]\n255      Reserved                           [RFC6003]",
      "raw": true
    },
    {
      "indent": 0,
      "text": "9.4. Ethernet Bandwidth Profiles",
      "section_title": true,
      "ja": "9.4。イーサネット帯域幅プロファイル"
    },
    {
      "indent": 3,
      "text": "IANA maintains a registry of GMPLS parameters called \"Generalized Multi-Protocol Label Switching (GMPLS) Signaling Parameters\".",
      "ja": "IANAは、「一般化マルチプロトコルラベルは（GMPLS）シグナリングパラメータの切り替え」と呼ばれるGMPLSパラメータのレジストリを維持します。"
    },
    {
      "indent": 3,
      "text": "IANA has created a new sub-registry called \"Ethernet Bandwidth Profiles\" to contain bit flags carried in the Ethernet Bandwidth Profile TLV of the Ethernet SENDER_TSPEC object.",
      "ja": "IANAは、イーサネットSENDER_TSPECオブジェクトのイーサネット帯域幅プロファイルTLVで運ばビットフラグを含むように、「イーサネットの帯域幅プロファイル」と呼ばれる新しいサブレジストリを作成しました。"
    },
    {
      "indent": 3,
      "text": "Bits are to be allocated by IETF Standards Action. Bits are numbered from bit 0 as the low order bit. Initial entries are as follows:",
      "ja": "ビットは、IETF標準化行動によって割り当てられることにあります。ビットが下位ビットとして、ビット0から番号付けされています。次のように初期のエントリは次のとおりです。"
    },
    {
      "indent": 3,
      "text": "Bit   Hex   Description                   Reference\n---   ----  --------------------------    -------------\n 0    0x01  Coupling Flag (CF)            [RFC6003]\n 1    0x02  Color Mode (CM)               [RFC6003]",
      "raw": true
    },
    {
      "indent": 0,
      "text": "10. Acknowledgments",
      "section_title": true,
      "ja": "10.謝辞"
    },
    {
      "indent": 3,
      "text": "Many thanks to Adrian Farrel for his comments. Lou Berger provided the input on control traffic processing.",
      "ja": "彼のコメントのためのエードリアンファレルに感謝します。ルー・バーガーは、制御トラフィック処理に入力を提供します。"
    },
    {
      "indent": 0,
      "text": "11. References",
      "section_title": true,
      "ja": "11.参考文献"
    },
    {
      "indent": 0,
      "text": "11.1. Normative References",
      "section_title": true,
      "ja": "11.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[MEF10.1] The MEF Technical Specification, \"Ethernet Services Attributes Phase 2\", MEF 10.1, November 2006.",
      "ja": "[MEF10.1] MEF技術仕様は、MEF 10.1、2006年11月 \"イーサネットサービスは、フェーズ2属性\"。"
    },
    {
      "indent": 3,
      "text": "[RFC2205] Braden, R., Ed., Zhang, L., Berson, S., Herzog, S., and S. Jamin, \"Resource ReSerVation Protocol (RSVP) -- Version 1 Functional Specification\", RFC 2205, September 1997.",
      "ja": "[RFC2205]ブレーデン、R.、エド、チャン、L.、Berson氏、S.、ハーツォグ、S.、およびS.ヤミン、 \"リソース予約プロトコル（RSVP） - バージョン1の機能的な仕様\"。、RFC 2205、9月1997。"
    },
    {
      "indent": 3,
      "text": "[RFC2210] Wroclawski, J., \"The Use of RSVP with IETF Integrated Services\", RFC 2210, September 1997.",
      "ja": "[RFC2210] Wroclawski、J.、RFC 2210、1997年9月 \"IETF統合サービスとRSVPの使用\"。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3209] Awduche, D., Berger, L., Gan, D., Li, T., Srinivasan, V., and G. Swallow, \"RSVP-TE: Extensions to RSVP for LSP Tunnels\", RFC 3209, December 2001.",
      "ja": "[RFC3209] Awduche、D.、バーガー、L.、ガン、D.、李、T.、スリニヴァサン、V.、およびG.ツバメ、 \"RSVP-TE：LSPトンネルのためのRSVPの拡張\"、RFC 3209年12月2001。"
    },
    {
      "indent": 3,
      "text": "[RFC3471] Berger, L., Ed., \"Generalized Multi-Protocol Label Switching (GMPLS) Signaling Functional Description\", RFC 3471, January 2003.",
      "ja": "[RFC3471]バーガー、L.、エド。は、 \"一般化マルチプロトコルラベルスイッチング（GMPLS）機能説明シグナリング\"、RFC 3471、2003年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC3473] Berger, L., Ed., \"Generalized Multi-Protocol Label Switching (GMPLS) Signaling Resource ReserVation Protocol-Traffic Engineering (RSVP-TE) Extensions\", RFC 3473, January 2003.",
      "ja": "[RFC3473]バーガー、L.、エド。、 \"一般化されたマルチプロトコルラベルスイッチング（GMPLS）シグナリング資源予約プロトコル - トラフィックエンジニアリング（RSVP-TE）を拡張\"、RFC 3473、2003年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC4124] Le Faucheur, F., Ed., \"Protocol Extensions for Support of Diffserv-aware MPLS Traffic Engineering\", RFC 4124, June 2005.",
      "ja": "[RFC4124]ルFaucheur、F.、エド。、 \"Diffservの認識MPLSトラフィックエンジニアリングのサポートのためのプロトコル拡張機能\"、RFC 4124、2005年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC4506] Eisler, M., Ed., \"XDR: External Data Representation Standard\", STD 67, RFC 4506, May 2006.",
      "ja": "[RFC4506]アイスラー、M.、エド、 \"XDR：外部データ表現標準\"。、STD 67、RFC 4506、2006年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC5226] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 5226, May 2008.",
      "ja": "[RFC5226] Narten氏、T.とH. Alvestrand、 \"RFCsにIANA問題部に書くためのガイドライン\"、BCP 26、RFC 5226、2008年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC6004] Berger, L. and D. Fedyk, \"Generalized MPLS (GMPLS) Support for Metro Ethernet Forum and G.8011 Ethernet Services\", RFC 6004, October 2010.",
      "ja": "[RFC6004]バーガー、L.とD. Fedyk、 \"一般化MPLS（GMPLS）、メトロ・イーサネット・フォーラムとG.8011イーサネットサービスのサポート\"、RFC 6004、2010年10月。"
    },
    {
      "indent": 0,
      "text": "11.2. Informative References",
      "section_title": true,
      "ja": "11.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[ETHv2] Digital, Intel, and Xerox, \"The Ethernet -- A Local Area Network: Data Link Layer and Physical Layer Specifications\", Version 2.0, November 1982.",
      "ja": "[ETHv2]デジタル、インテル、およびゼロックス、「イーサネット - ローカルエリアネットワーク：データリンク層と物理層仕様」、バージョン2.0、1982年11月。"
    },
    {
      "indent": 3,
      "text": "[IEEE802.3] IEEE 802.3 LAN/MAN CSMA/CD (Ethernet) Access Method, IEEE Standard for Information technology- Specific requirements - Part 3: Carrier Sense Multiple Access with Collision Detection (CMSA/CD) Access Method and Physical Layer Specifications, IEEE 802.3-2008.",
      "ja": "衝突検出（CMSA / CD）アクセス方法および物理層仕様、搬送波感知多重アクセス：パート3  -  [IEEE802.3] IEEE 802.3 LAN / MAN CSMA / CD（イーサネット）アクセス方法、IEEE規格情報については、具体的な要件を技術 - IEEE 802.3から2008。"
    },
    {
      "indent": 3,
      "text": "[MCOS] Minei, I., Gan, D., Kompella, K., and X. Li, \"Extensions for Differentiated Services-aware Traffic Engineered LSPs\", Work in Progress, June 2006.",
      "ja": "[のMCO] Minei、I.、ガン、D.、Kompella、K.、およびX.李、 \"差別化サービスを意識したトラフィックエンジニアのLSPのための拡張機能\"、進歩、2006年6月での作業。"
    },
    {
      "indent": 3,
      "text": "[MEF6] The Metro Ethernet Forum, \"Ethernet Services Definitions - Phase I\", MEF 6, June 2004.",
      "ja": "[MEF6]メトロ・イーサネット・フォーラム、 \"イーサネットサービスの定義 - フェーズI\"、MEF 6、2004年6月。"
    },
    {
      "indent": 3,
      "text": "[MEF10.2] The MEF Technical Specification, \"Ethernet Services Attributes Phase 2\", MEF 10.2, October 2009.",
      "ja": "[MEF10.2] MEF技術仕様は、MEF 10.2、2009年10月 \"イーサネットサービスは、フェーズ2属性\"。"
    },
    {
      "indent": 3,
      "text": "[RFC5920] Fang, L., Ed., \"Security Framework for MPLS and GMPLS Networks\", RFC 5920, July 2010.",
      "ja": "[RFC5920]牙、L.、エド。、 \"MPLSおよびGMPLSネットワークのセキュリティフレームワーク\"、RFC 5920、2010年7月。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Dimitri Papadimitriou Alcatel-Lucent Bell Copernicuslaan 50 B-2018 Antwerpen, Belgium Phone: +32 3 2408491 EMail: dimitri.papadimitriou@alcatel-lucent.be",
      "ja": "ディミトリPapadimitriouアルカテルLykentペラKopernikoslaan 50 B-2018アントワープ、Velgiomボイス：X2 + 3 2408491メールアドレス：δημήτρη.παπαδημητρίου@αλκατελ-λυκεντ.βε"
    }
  ]
}