{
  "title": {
    "text": "RFC 6587 - Transmission of Syslog Messages over TCP",
    "ja": "RFC 6587 - TCP上のSyslogメッセージの送信"
  },
  "number": 6587,
  "created_at": "2019-10-28 02:46:09.511145+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                       R. Gerhards\nRequest for Comments: 6587                                  Adiscon GmbH\nCategory: Historic                                            C. Lonvick\nISSN: 2070-1721                                      Cisco Systems, Inc.\n                                                              April 2012",
      "raw": true
    },
    {
      "indent": 16,
      "text": "Transmission of Syslog Messages over TCP",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "There have been many implementations and deployments of legacy syslog over TCP for many years. That protocol has evolved without being standardized and has proven to be quite interoperable in practice. This memo describes how TCP has been used as a transport for syslog messages.",
      "ja": "長年にわたり、TCP上で多くの実装とレガシーのsyslogの展開がありました。そのプロトコルが標準化されることなく進化しているし、実際には非常に相互運用可能であることが証明されました。このメモはTCP syslogメッセージのトランスポートとして使用されてきた方法を説明します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for the historical record.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは歴史的な記録のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document defines a Historic Document for the Internet community. This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "この文書は、インターネットコミュニティのための歴史的な文書を定義します。このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 IESGによって承認されていないすべての文書がインターネットStandardのどんなレベルの候補です。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6587.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6587で取得することができます。"
    },
    {
      "indent": 0,
      "text": "IESG Note",
      "ja": "IESG注意"
    },
    {
      "indent": 3,
      "text": "The IESG does not recommend implementing or deploying syslog over plain tcp, which is described in this document, because it lacks the ability to enable strong security [RFC3365].",
      "ja": "それは強力なセキュリティ[RFC3365]を有効にする機能がないためIESGは、この文書に記述されているプレーンなTCP、上のsyslogを実装するか、展開はお勧めしません。"
    },
    {
      "indent": 3,
      "text": "Implementation of the TLS transport [RFC5425] is recommended so that appropriate security features are available to operators who want to deploy secure syslog. Similarly, those security features can be turned off for those who do not want them.",
      "ja": "適切なセキュリティ機能は安全なのsyslogを展開したい事業者が利用できるように、TLS輸送[RFC5425]の実装が推奨されます。同様に、これらのセキュリティ機能は、それらをしたくない人のためにオフにすることができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2012 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2012 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n2. Conventions Used in This Document ...............................5\n3. Message Transmission ............................................5\n   3.1. Character Encoding Scheme ..................................5\n   3.2. Session ....................................................6\n   3.3. Session Initiation .........................................6\n   3.4. Message Transfer ...........................................6\n        3.4.1. Octet Counting ......................................7\n        3.4.2. Non-Transparent-Framing .............................7\n        3.4.3. Method Change .......................................8\n   3.5. Session Closure ............................................8\n4. Applicability Statement .........................................8\n5. Security Considerations .........................................9\n6. Acknowledgments .................................................9\n7. References .....................................................10\n   7.1. Normative References ......................................10\n   7.2. Informative References ....................................10",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The Standards-Track documents in the syslog series recommend using the syslog protocol [RFC5424] with the TLS transport [RFC5425] for all event messages. The authors of this document wholeheartedly support that position and only offer this document to describe what has been observed with legacy syslog over TCP, which appears to still be widely used.",
      "ja": "syslogのシリーズの標準トラック文書は、すべてのイベント・メッセージのためにTLS輸送[RFC5425]でsyslogプロトコル[RFC5424]を使用することをお勧めします。本書の著者は、心をこめてその位置をサポートし、唯一まだ広く使用されているように見えるTCP、オーバーレガシーのsyslogで観察されているかを説明するために、このドキュメントを提供します。"
    },
    {
      "indent": 3,
      "text": "Two primary format options have been observed with legacy syslog being transported over TCP. These have been called \"non-transparent-framing\" and \"octet-counting\". The non-transparent-framing mechanism has some inherent problems.",
      "ja": "二つの主要なフォーマットオプションは、TCPの上に搬送されているレガシーのsyslogで観察されています。これらは、「非透過フレーミング」および「オクテットカウント」と呼ばれています。非透明のフレーミングメカニズムは、いくつかの固有の問題があります。"
    },
    {
      "indent": 3,
      "text": "Diagram 1 shows how all of these syslog transports relate to each other. In this diagram, three originators are seen, labeled A, B, and C, along with one collector. Originator A is using the TCP transport that is described in this document. Originator B is using the UDP transport, which is described in [RFC5426]. Originator C is using the TLS transport, which is described in [RFC5425]. The collector is shown with the capability to accept all three transports.",
      "ja": "図1は、これらのsyslogトランスポートのすべてが互いにどのように関係するかを示しています。この図では、三のオリジネータが見られる一のコレクタと一緒に、A、B、及びCとラベル。発信元Aは、本書に記載されているTCPトランスポートを使用しています。発信者Bは[RFC5426]に記載されているUDPトランスポートを使用しています。発信者Cは、[RFC5425]に記載されているTLSトランスポートを使用しています。コレクタは、すべての3つのトランスポートを受け入れる能力が示されています。"
    },
    {
      "indent": 4,
      "text": "+---------------------+\n| Originator A        |\n|---------------------|\n|  syslog application |\n|                     |\n|---------------------|\n|  syslog transport   |\n|        TCP          |\n|---------------------|\n          v\n          |\n         /                            +---------------------+\n        /                             | Originator B        |\n       /                              |---------------------|\n      /   +----------------------+    |  syslog application |\n     /    | Collector            |    |                     |\n    |     |----------------------|    |---------------------|\n    |     |  syslog application  |    |  syslog transport   |\n    |     |                      |    |        UDP          |\n    |     |----------------------|    |---------------------|\n    |     |  syslog transport    |              v\n    |     |  TCP |  TLS  |  UDP  |              |\n    |     |----------------------|              |\n    |         ^      ^       ^                  |\n    |         |      |       |                  |\n    \\         /      |       \\                  /\n     ---------       |        ------------------\n                     |\n                     |\n                     |     +---------------------+\n                     |     | Originator C        |\n                     |     |---------------------|\n                     |     |  syslog application |\n                     |     |                     |\n                     |     |---------------------|\n                     |     |  syslog transport   |\n                     |     |        TLS          |\n                     |     |---------------------|\n                     |               v\n                     \\               /\n                      ---------------",
      "raw": true
    },
    {
      "indent": 16,
      "text": "Diagram 1. Syslog Layers",
      "ja": "図1. Syslogのレイヤー"
    },
    {
      "indent": 0,
      "text": "2. Conventions Used in This Document",
      "section_title": true,
      "ja": "この文書で使用される2.表記"
    },
    {
      "indent": 3,
      "text": "The terminology defined in Section 3 of [RFC5424] is used throughout this specification. The reader should be familiar with that to follow this discussion.",
      "ja": "[RFC5424]のセクション3で定義された用語は、本明細書を通して使用されます。それがこの議論に従うことを読者は理解しておく必要があります。"
    },
    {
      "indent": 3,
      "text": "This document also references devices that use the syslog message format as described in [RFC3164]. Devices that continue to use that message format (regardless of transport) will be described as \"legacy syslog devices\". Similarly, devices that use the message format as described in [RFC5424] will be described as \"standardized syslog devices\".",
      "ja": "また、このドキュメントは[RFC3164]に記載されているようにシスログメッセージフォーマットを使用するデバイスを参照します。 （関係なく、輸送の）そのメッセージ・フォーマットを使用し続けたデバイスは、「レガシーのsyslogデバイス」として説明します。同様に、[RFC5424]に記載されているようにメッセージフォーマットを使用するデバイスは、「標準化されたsyslogの装置」として説明します。"
    },
    {
      "indent": 0,
      "text": "3. Message Transmission",
      "section_title": true,
      "ja": "3.メッセージ送信"
    },
    {
      "indent": 3,
      "text": "Syslog is simplex in nature. It has been observed that implementations of syslog over TCP also do not use any back-channel mechanism to convey information to the transport sender and, consequently, do not use any application-level acknowledgement for syslog signaling from receiver to sender. Message receipt acknowledgement, reliability, and flow control are provided by the capabilities of TCP.",
      "ja": "syslogは、自然の中でシンプレックスされます。 TCP上のsyslogの実装は、トランスポート送信者に情報を伝えるために、任意のバックチャンネルメカニズムを使用しないと、結果的に、送信側に受信機からのシグナリングsyslogのための任意のアプリケーションレベルの確認応答を使用しないことが観察されています。メッセージ受信確認、信頼性、およびフロー制御は、TCPの機能によって提供されています。"
    },
    {
      "indent": 0,
      "text": "3.1. Character Encoding Scheme",
      "section_title": true,
      "ja": "3.1. 文字コード体系"
    },
    {
      "indent": 3,
      "text": "Syslog over TCP messages contain no indication of the coded character set (e.g., [US-ASCII] or [UNICODE] ) or character encoding scheme (e.g., so-called \"7-bit ASCII\" or UTF-8 [RFC3629]) in use. In these messages, the predominant approach has been to include characters only from the ASCII repertoire (i.e., %d32 to %d126 inclusive) using the \"Network Virtual Terminal\" (NVT) encoding [RFC5198].",
      "ja": "TCPメッセージ経由のSyslog符号化文字集合（たとえば、[US-ASCII]または[UNICODE]）または文字符号化方式（例えば、いわゆる \"7ビットのASCII\" またはUTF-8 [RFC3629]）の兆候を含まないでつかいます。これらのメッセージでは、支配的なアプローチのみASCIIレパートリーから文字を含むようにされている（すなわち、包括％のD126％のD32）、「ネットワーク仮想端末」（NVT）を使用する[RFC5198]をコードします。"
    },
    {
      "indent": 3,
      "text": "The message header usually contains characters only from the ASCII repertoire, in the NVT encoding. This has been observed even in cases where a different encoding (e.g., UTF-8) has been used for the MSG part. However, characters outside the ASCII range have been seen inside the header. In that case, some syslog applications have been known to experience problems processing those messages.",
      "ja": "メッセージヘッダは、通常NVTエンコーディングでのみASCIIレパートリーからの文字を含みます。これは、異なる符号化（例えば、UTF-8）はMSG部に使用されている場合には観察されています。しかし、ASCII範囲外の文字は、ヘッダ内部見られています。その場合には、いくつかのsyslogアプリケーションは、それらのメッセージを処理する問題が発生することが知られています。"
    },
    {
      "indent": 3,
      "text": "In some cases, it has been observed that characters outside of the ASCII range are often being transformed by receivers in an effort to \"escape control characters\". Some receiver implementations simply drop those characters. This is considered to be a poor practice, as it causes problems with coded character sets other than ASCII and character encodings other than NVT, most notably the UTF-8 encoding of Unicode.",
      "ja": "いくつかのケースでは、ASCIIの範囲外の文字は、多くの場合、「制御文字をエスケープ」ための努力の受信機によって変換されていることが観察されています。いくつかの受信機の実装は、単純にそれらの文字をドロップします。それはNVT ASCII以外の文字エンコーディング以外の符号化文字集合、ユニコードの最も顕著なUTF-8エンコーディングで問題が発生しますので、これは、貧しい人々の練習であると考えられています。"
    },
    {
      "indent": 3,
      "text": "It has also been observed that relays will forward messages using the character encoding schemes of messages they receive. In the case where two different senders are using different character encoding schemes, the relay will forward each message to a collector in that character encoding. The collector of these messages will have to be prepared to receive messages from the same relay with different encodings.",
      "ja": "また、リレーは、彼らが受け取るメッセージの文字符号化方式を使用してメッセージを転送することが観察されています。二つの異なる送信者が異なる文字符号化スキームを使用している場合に、リレーは、文字エンコーディングにコレクタに各メッセージを転送します。これらのメッセージのコレクタは異なるエンコーディングと同じリレーからメッセージを受信するために準備する必要があります。"
    },
    {
      "indent": 0,
      "text": "3.2. Session",
      "section_title": true,
      "ja": "3.2. セッション"
    },
    {
      "indent": 3,
      "text": "Like most other protocols, the syslog transport sender is the TCP host that initiates the TCP session. After initiation, messages are sent from the transport sender to the transport receiver. No application-level data is transmitted from the transport receiver to the transport sender. The roles of transport sender and receiver seem to be fixed once the session is established.",
      "ja": "他のほとんどのプロトコルと同様に、syslogのトランスポート送信者がTCPセッションを開始TCPホストです。開始後、メッセージがトランスポート・レシーバへの輸送の送信者から送信されます。いいえアプリケーション・レベルのデータは、トランスポート、送信者への輸送の受信機から送信されません。セッションが確立されると、トランスポート送信者と受信者の役割は固定されているように見えます。"
    },
    {
      "indent": 3,
      "text": "When it has been observed, if an error occurs that cannot be corrected by TCP, the host detecting the error gracefully closes the TCP session. There have been no application-level messages seen that were sent to notify the other host about the state of the host syslog application.",
      "ja": "それが観察されているときにエラーがTCPによって補正することができないことが発生した場合、エラーを検出したホストは、優雅にTCPセッションを閉じます。ホストのsyslogアプリケーションの状態に関する他のホストに通知するために送られた見て何のアプリケーションレベルのメッセージは発生していません。"
    },
    {
      "indent": 0,
      "text": "3.3. Session Initiation",
      "section_title": true,
      "ja": "3.3. セッション開始"
    },
    {
      "indent": 3,
      "text": "The TCP host acting as a syslog transport receiver listens to a TCP port. The TCP transport sender initiates a TCP session to the syslog transport receiver as specified in [RFC0793].",
      "ja": "syslogのトランスポート受信機として動作するTCPホストはTCPポートにリッスンします。 [RFC0793]で指定されたTCPトランスポートの送信者は、syslog転送受信機へのTCPセッションを開始します。"
    },
    {
      "indent": 3,
      "text": "This protocol has no standardized port assignment. In practice, network administrators generally choose something that they feel will not conflict with anything else active in their networks. This has most often been either TCP/514, which is actually allocated to another protocol, or some variant of adding 514 to a multiple of 1000. Please see Section 4 for more information.",
      "ja": "このプロトコルには標準化されたポートの割り当てを持っていません。実際には、ネットワーク管理者は、一般的に、彼らは彼らのネットワークに積極的に何か他のものと競合しないだろうと感じ何かを選択してください。これは、ほとんどの場合、実際には別のプロトコル、または1000の倍数に514の追加の詳細については、セクション4を参照してくださいいくつかのバリアントに割り当てられているTCP / 514、のいずれかとなっています。"
    },
    {
      "indent": 0,
      "text": "3.4. Message Transfer",
      "section_title": true,
      "ja": "3.4. メッセージ転送"
    },
    {
      "indent": 3,
      "text": "Syslog over TCP has been around for a number of years. Just like legacy syslog over UDP, different implementations exist. The older method of non-transparent-framing has problems. The newer method of octet-counting is reliable and has not been seen to cause problems noted with the non-transparent-framing method.",
      "ja": "TCP上のsyslogは、数年前から出回っています。ただ、UDP経由のレガシーsyslogのように、異なる実装が存在します。非透明フレーミングの古い方法は問題があります。オクテットカウントの新しい方法は、信頼性が高く、非透過フレーミング方法と注意問題を引き起こすことが見られませんでした。"
    },
    {
      "indent": 3,
      "text": "In both of these methods, during the message transfer phase, the syslog transport sender sends a stream of messages to the transport receiver. These are sent in sequence and one message is encapsulated inside each TCP frame. Either of the TCP hosts may initiate session closure at any time as specified in Section 3.5 of [RFC0793]. In practice, this is often seen after a prolonged period of inactivity.",
      "ja": "これらの方法の両方において、メッセージ転送フェーズ中に、syslogの輸送の送信者は、トランスポート受信機へのメッセージのストリームを送信します。これらを順に送信され、1つのメッセージは、各TCPフレーム内にカプセル化されます。 [RFC0793]のセクション3.5で指定されたTCPホストのいずれかが任意の時点でセッションの閉鎖を開始することができます。実際には、これは多くの場合、非アクティブの長い期間の後に見られています。"
    },
    {
      "indent": 0,
      "text": "3.4.1. Octet Counting",
      "section_title": true,
      "ja": "3.4.1. オクテットカウント"
    },
    {
      "indent": 3,
      "text": "This framing allows for the transmission of all characters inside a syslog message and is similar to the method used in [RFC5425]. A transport receiver uses the defined message length to delimit a syslog message. As noted in [RFC3164], the upper limit for a legacy syslog message length is 1024 octets. That length has been expanded for standardized syslog.",
      "ja": "このフレーミングは、syslogメッセージ内のすべての文字の伝送を可能にし、[RFC5425]で使用される方法と同様です。トランスポート・レシーバは、syslogメッセージを区切るために定義されたメッセージ長を使用します。 [RFC3164]で述べたように、従来のsyslogメッセージの長さの上限は、1024オクテットです。その長さは、標準化されたsyslogのために拡張されました。"
    },
    {
      "indent": 3,
      "text": "It can be assumed that octet-counting framing is used if a syslog frame starts with a digit.",
      "ja": "syslogフレームが数字で始まる場合、オクテットカウントフレーミングが使用されていると仮定することができます。"
    },
    {
      "indent": 3,
      "text": "All syslog messages can be considered to be TCP \"data\" as per the Transmission Control Protocol [RFC0793]. The syslog message stream has the following ABNF [RFC5234] definition:",
      "ja": "すべてのsyslogメッセージは、伝送制御プロトコル[RFC 0793]のとおりTCP「データ」であると考えることができます。 Syslogメッセージの流れは以下のABNF [RFC 5234]の定義があります。"
    },
    {
      "indent": 7,
      "text": "TCP-DATA = *SYSLOG-FRAME",
      "ja": "TCP-DATA = * SYSLOG-FRAME"
    },
    {
      "indent": 7,
      "text": "SYSLOG-FRAME = MSG-LEN SP SYSLOG-MSG ; Octet-counting ; method",
      "ja": "SYSLOG-FRAME = MSG-LEN SP SYSLOG-MSG。オクテットカウント。方法"
    },
    {
      "indent": 7,
      "text": "MSG-LEN = NONZERO-DIGIT *DIGIT",
      "ja": "MSG-LEN = NONZERO-DIGIT * DIGIT"
    },
    {
      "indent": 7,
      "text": "NONZERO-DIGIT = %d49-57",
      "ja": "NONZERO-DIGIT =％d49-57"
    },
    {
      "indent": 7,
      "text": "SYSLOG-MSG is defined in the syslog protocol [RFC5424] and may also be considered to be the payload in [RFC3164]",
      "ja": "SYSLOG-MSGは、syslogプロトコル[RFC5424]で定義され、また、[RFC3164]にペイロードであると考えることができます"
    },
    {
      "indent": 3,
      "text": "MSG-LEN is the octet count of the SYSLOG-MSG in the SYSLOG-FRAME.",
      "ja": "MSG-LENは、SYSLOG-FRAMEでSYSLOG-MSGのオクテット数です。"
    },
    {
      "indent": 0,
      "text": "3.4.2. Non-Transparent-Framing",
      "section_title": true,
      "ja": "3.4.2. 非透過フレーミング"
    },
    {
      "indent": 3,
      "text": "The non-transparent-framing method inserts a syslog message into a frame and terminates it with a TRAILER character. The TRAILER has usually been a single character and most often is ASCII LF (%d10). However, other characters have also been seen, with ASCII NUL (%d00) being a prominent example. Some devices have also been seen to emit a two-character TRAILER, which is usually CR and LF.",
      "ja": "非透明フレーミング方法は、フレームにSyslogメッセージを挿入し、TRAILER文字でそれを終了します。 TRAILERは、通常、単一の文字となっていると、ほとんどの場合、ASCIIのLF（％のD10）があります。しかし、他の文字も顕著な例であるASCII NUL（％のD00）で、見られています。一部のデバイスはまた、通常、CRとLFである2文字のTRAILERを発するように見られています。"
    },
    {
      "indent": 3,
      "text": "The problem with non-transparent-framing comes from the use of a TRAILER character. In that, the traditional TRAILER character is not escaped within the message, which causes problems for the receiver.",
      "ja": "非透過フレーミングの問題はTRAILER文字を使用することから来ています。その中で、伝統的なTRAILER文字は受信機のための問題を引き起こしたメッセージ内にエスケープされていません。"
    },
    {
      "indent": 3,
      "text": "For example, a message in the style of [RFC3164] containing one or more LF characters may be misinterpreted as multiple messages by the receiving syslog application.",
      "ja": "例えば、1つ以上のLF文字を含む[RFC3164]の形式のメッセージが受信シスログアプリケーションによって複数のメッセージとして誤って解釈されてもよいです。"
    },
    {
      "indent": 3,
      "text": "The ABNF for this is shown here:",
      "ja": "このためABNFは、ここに示されています："
    },
    {
      "indent": 7,
      "text": "TCP-DATA = *SYSLOG-FRAME",
      "ja": "TCP-DATA = * SYSLOG-FRAME"
    },
    {
      "indent": 7,
      "text": "SYSLOG-FRAME = SYSLOG-MSG TRAILER ; non-transparent-framing ; method",
      "ja": "SYSLOG-FRAME = SYSLOG-MSGトレーラー。非透明フレーミング。方法"
    },
    {
      "indent": 7,
      "text": "TRAILER = LF / APP-DEFINED",
      "ja": "TRAILER = LF / APP-DEFINED"
    },
    {
      "indent": 7,
      "text": "APP-DEFINED = 1*2OCTET",
      "ja": "APP-DEFINED = 1 *の2OCTET"
    },
    {
      "indent": 7,
      "text": "SYSLOG-MSG is defined in the syslog protocol [RFC5424] and may also be considered to be the payload in [RFC3164]",
      "ja": "SYSLOG-MSGは、syslogプロトコル[RFC5424]で定義され、また、[RFC3164]にペイロードであると考えることができます"
    },
    {
      "indent": 3,
      "text": "A transport receiver can assume that non-transparent-framing is used if a syslog frame starts with the ASCII character \"<\" (%d60).",
      "ja": "トランスポート・レシーバは、syslogフレームはASCII文字「<」（％のD60）で始まる場合、非透過フレーミングが使用されていると仮定することができます。"
    },
    {
      "indent": 0,
      "text": "3.4.3. Method Change",
      "section_title": true,
      "ja": "3.4.3. 方法変更"
    },
    {
      "indent": 3,
      "text": "In legacy implementations, it has been observed that the framing may change on a frame-by-frame basis. This is probably not a good idea, but it's been seen.",
      "ja": "従来の実装では、フレーミングがフレームごとに変化することが観察されています。これはおそらく良いアイデアではありませんが、それは見られています。"
    },
    {
      "indent": 0,
      "text": "3.5. Session Closure",
      "section_title": true,
      "ja": "3.5. セッション閉鎖"
    },
    {
      "indent": 3,
      "text": "The syslog session is closed when one of the TCP hosts decides to do so. It then initiates a local TCP session closure. Following TCP [RFC0793], it doesn't need to notify the remote TCP host of its intention to close the session, nor does it accept any messages that are still in transit.",
      "ja": "TCPホストの1がそうすることを決定したときのsyslogセッションが閉じられています。これは、ローカルTCPセッションの閉鎖を開始します。 TCP [RFC0793]に続いて、それがセッションを閉じるには、その意思のリモートTCPホストに通知する必要はありません。また、輸送中に残っているすべてのメッセージを受け付けません。"
    },
    {
      "indent": 0,
      "text": "4. Applicability Statement",
      "section_title": true,
      "ja": "4.適用性に関する声明"
    },
    {
      "indent": 3,
      "text": "Again it must be emphasized that the Standards-Track documents in the syslog series recommend using the TLS transport [RFC5425] to transport syslog messages. This document does not recommend that new implementations or deployments use syslog over TCP except for the explicit purpose of interoperating with existing deployments.",
      "ja": "ここでもsyslogシリーズの標準トラック文書がsyslogメッセージを転送するためにTLS輸送[RFC5425]を使用することをお勧めしますことを強調しなければなりません。この文書は、新しい実装や展開は、既存の展開との相互運用の明確な目的を除き、TCP上のsyslogを使用することをお勧めしません。"
    },
    {
      "indent": 3,
      "text": "One of the major problems with interoperability with this protocol is that there is no consistent TCP port assigned. Most of the successful implementations have made the selection of a port a user-configurable option. The most frequently observed port for this has been TCP/514, which is actually assigned to the Shell protocol.",
      "ja": "このプロトコルとの相互運用性を持つ主要な問題の一つは、割り当てられた一貫したTCPポートがないことです。成功の実装のほとんどは、ポートの選択、ユーザ設定可能なオプションなりました。このために最も頻繁に観測されたポートは、実際にShellプロトコルに割り当てられているTCP / 514、となっています。"
    },
    {
      "indent": 3,
      "text": "Operators must carefully select which port to use in their deployment and be prepared to encounter different default port assignments in implementations.",
      "ja": "オペレータは慎重に彼らの展開で使用すると、実装で異なるデフォルトのポート割り当てが発生したために準備されたポートを選択する必要があります。"
    },
    {
      "indent": 3,
      "text": "There are several advantages to using TCP: flow control, error recovery, and reliability, to name a few. These reasons, and the ease of programming, have led people to use this transmission protocol to transmit syslog.",
      "ja": "少数を示すために、フロー制御、エラー回復、および信頼性：TCPを使用することにはいくつかの利点があります。これらの理由から、プログラミングの容易さは、syslogのを送信するために、この伝送プロトコルを使用するように人々を導いてきました。"
    },
    {
      "indent": 3,
      "text": "One potential disadvantage is the buffering mechanism used by TCP. Ordinarily, TCP decides when enough data has been received from the application to form a segment for transmission. This may be adjusted through timers; but still, some application data may wait in a buffer for a relatively long time. Syslog data is not normally time-sensitive, but if this delay is a concern, the syslog transport sender may utilize the PUSH Flag as described in [RFC0793] to have the sending TCP immediately send all buffered data.",
      "ja": "一つの潜在的な欠点は、TCPが使用するバッファリング機構です。十分なデータが送信のためにセグメントを形成するために、アプリケーションから受信された場合、通常、TCPを決定します。これは、タイマーを介して調整することができます。それでも、いくつかのアプリケーションデータは、比較的長い時間のためのバッファで待つことがあります。 Syslogのデータは通常、時間に敏感ではありませんが、この遅延が懸念される場合は、[RFC0793]で説明したように、syslogのトランスポート送信者は送信側TCPはすぐにすべてのバッファされたデータを送信させるPUSHフラグを利用することができます。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "This protocol makes no meaningful provisions for security. It lacks authentication, integrity checking, and privacy. It makes no provision for flow control or end-to-end confirmation of receipt, relying instead on the underlying TCP implementations to approximate these functions. It should not be used if deployment of [RFC5425] on the systems in question is feasible.",
      "ja": "このプロトコルは、セキュリティのために意味のある規定を負いません。これは、認証、整合性チェック、およびプライバシーを欠いています。これは、これらの関数を近似する根本的なTCPの実装に依存する代わりに、フロー制御や領収書のエンド・ツー・エンドの確認のための準備を行いません。問題のシステムでは、[RFC5425]の展開が可能である場合は使用すべきではありません。"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgments",
      "section_title": true,
      "ja": "6.謝辞"
    },
    {
      "indent": 3,
      "text": "The authors wish to thank David Harrington, Tom Petch, Richard Graveman, and all other people who commented on various versions of this proposal. We would also like to thank Peter Saint-Andre for clarifying character encodings.",
      "ja": "作者はデヴィッドハリントン、トム・ペッチ、リチャードGraveman、この提案のさまざまなバージョンについてコメントし、他のすべての人々に感謝したいです。また、文字エンコーディングを明確にするためにピーターサンアンドレに感謝したいと思います。"
    },
    {
      "indent": 3,
      "text": "The authors would also like to thank Randy Presuhn for being our reviewer and document shepherd, and a special thanks to Dan Romascanu for his support and guidance.",
      "ja": "著者らはまた、当社のレビューアおよび文書の羊飼い、彼の支援と指導のためのダンRomascanuに特別な感謝であることのためランディPresuhnに感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7.参考"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "ja": "7.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC0793] Postel, J., \"Transmission Control Protocol\", STD 7, RFC 793, September 1981.",
      "ja": "[RFC0793]ポステル、J.、 \"伝送制御プロトコル\"、STD 7、RFC 793、1981年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC3365] Schiller, J., \"Strong Security Requirements for Internet Engineering Task Force Standard Protocols\", BCP 61, RFC 3365, August 2002.",
      "ja": "[RFC3365]シラー、J.、BCP 61、RFC 3365、2002年8月 \"インターネットエンジニアリングタスクフォース標準プロトコルのための強力なセキュリティ要件\"。"
    },
    {
      "indent": 3,
      "text": "[RFC5198] Klensin, J. and M. Padlipsky, \"Unicode Format for Network Interchange\", RFC 5198, March 2008.",
      "ja": "[RFC5198] Klensin、J.とM. Padlipsky、 \"ネットワークインターチェンジのUnicodeフォーマット\"、RFC 5198、2008年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC5234] Crocker, D. and P. Overell, \"Augmented BNF for Syntax Specifications: ABNF\", STD 68, RFC 5234, January 2008.",
      "ja": "[RFC5234]クロッカー、D.、およびP. Overell、 \"構文仕様のための増大しているBNF：ABNF\"、STD 68、RFC 5234、2008年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC5424] Gerhards, R., \"The Syslog Protocol\", RFC 5424, March 2009.",
      "ja": "[RFC5424] Gerhards氏、R.、 \"Syslogのプロトコル\"、RFC 5424、2009年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC5425] Miao, F., Ma, Y., and J. Salowey, \"Transport Layer Security (TLS) Transport Mapping for Syslog\", RFC 5425, March 2009.",
      "ja": "[RFC5425]ミャオ族、F.、馬、Y.、およびJ. Salowey、 \"トランスポート層セキュリティ（TLS）Syslogのための交通のマッピング\"、RFC 5425、2009年3月。"
    },
    {
      "indent": 3,
      "text": "[US-ASCII] ANSI, \"Coded Character Set -- 7-bit American Standard Code for Information Interchange, ANSI X3.4-1986\", 1986.",
      "ja": "[US-ASCII] ANSIは、 \"コード化文字セット - 情報交換、ANSI X3.4-1986ための7ビットの米国標準コード\"、1986年。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "ja": "7.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC3164] Lonvick, C., \"The BSD Syslog Protocol\", RFC 3164, August 2001.",
      "ja": "[RFC3164] Lonvick、C.、 \"BSDシスログプロトコル\"、RFC 3164、2001年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC3629] Yergeau, F., \"UTF-8, a transformation format of ISO 10646\", STD 63, RFC 3629, November 2003.",
      "ja": "[RFC3629] Yergeau、F.、 \"UTF-8、ISO 10646の変換フォーマット\"、STD 63、RFC 3629、2003年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC5426] Okmianski, A., \"Transmission of Syslog Messages over UDP\", RFC 5426, March 2009.",
      "ja": "[RFC5426] Okmianski、A.、 \"UDP上のSyslogメッセージの送信\"、RFC 5426、2009年3月。"
    },
    {
      "indent": 3,
      "text": "[UNICODE] The Unicode Consortium. The Unicode Standard, Version 6.0.0, (Mountain View, CA: The Unicode Consortium, 2011. ISBN 978-1-936213-01-6), <http://www.unicode.org/versions/Unicode6.0.0/>.",
      "ja": "[UNICODE]ユニコードコンソーシアム。 Unicode標準、バージョン6.0.0、（カリフォルニア州マウンテンビュー：ユニコードコンソーシアム、2011年ISBN 978-1-936213-01-6）、<http://www.unicode.org/versions/Unicode6.0.0/ >。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Rainer Gerhards Adiscon GmbH Mozartstrasse 21 Grossrinderfeld, BW 97950 Germany",
      "ja": "レイナー・ガーハーズAdiscon社Mozartstrasse 21頭の大きな牛フィールド、BW 97950ドイツ"
    },
    {
      "indent": 3,
      "text": "EMail: rgerhards@adiscon.com",
      "ja": "メールアドレス：rgerhards@adiscon.com"
    },
    {
      "indent": 3,
      "text": "Chris Lonvick Cisco Systems, Inc. 12515 Research Blvd. Austin, TX 78759 USA",
      "ja": "クリスLonvickシスコシステムズ、株式会社12515リサーチ・ブルバードオースティン、TX 78759 USA"
    },
    {
      "indent": 3,
      "text": "EMail: clonvick@cisco.com",
      "ja": "メールアドレス：clonvick@cisco.com"
    }
  ]
}