{
  "title": {
    "text": "RFC 6770 - Use Cases for Content Delivery Network Interconnection",
    "ja": "RFC 6770 - コンテンツ配信ネットワークの相互接続のためのユースケース"
  },
  "number": 6770,
  "created_at": "2019-10-30 15:30:47.689085+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                  G. Bertrand, Ed.\nRequest for Comments: 6770                                    E. Stephan\nObsoletes: 3570                                  France Telecom - Orange\nCategory: Informational                                     T. Burbridge\nISSN: 2070-1721                                               P. Eardley\n                                                                      BT\n                                                                   K. Ma\n                                                     Azuki Systems, Inc.\n                                                               G. Watson\n                                                Alcatel-Lucent (Velocix)\n                                                           November 2012",
      "raw": true
    },
    {
      "indent": 9,
      "text": "Use Cases for Content Delivery Network Interconnection",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "Content Delivery Networks (CDNs) are commonly used for improving the End User experience of a content delivery service while keeping cost at a reasonable level. This document focuses on use cases that correspond to identified industry needs and that are expected to be realized once open interfaces and protocols supporting the interconnection of CDNs are specified and implemented. This document can be used to motivate the definition of the requirements to be supported by CDN Interconnection (CDNI) interfaces. It obsoletes RFC 3570.",
      "ja": "コンテンツ配信ネットワーク（CDNのは）一般的に合理的なレベルでコストを維持しながら、コンテンツ配信サービスのエンドユーザー体験を向上させるために使用されています。この文書は、識別された業界のニーズに対応し、指定され実装されてオープンインターフェースとのCDNの相互接続をサポートするプロトコルを一度に実現されることが期待されるユースケースに焦点を当てています。この文書では、CDN相互接続（CDNI）インターフェースによってサポートされる要件の定義を動機づけるために使用することができます。これは、RFC 3570を廃止します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 IESGによって承認されていないすべての文書がインターネットStandardのどんなレベルの候補です。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6770.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6770で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2012 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2012 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  3\n  1.1.  Terminology  . . . . . . . . . . . . . . . . . . . . . . .  3\n  1.2.  Abbreviations  . . . . . . . . . . . . . . . . . . . . . .  3\n  1.3.  Rationale for CDN Interconnection  . . . . . . . . . . . .  4\n2.  Footprint Extension Use Cases  . . . . . . . . . . . . . . . .  6\n  2.1.  Geographic Extension . . . . . . . . . . . . . . . . . . .  6\n  2.2.  Inter-Affiliates Interconnection . . . . . . . . . . . . .  6\n  2.3.  ISP Handling of Third-Party Content  . . . . . . . . . . .  7\n  2.4.  Nomadic Users  . . . . . . . . . . . . . . . . . . . . . .  7\n3.  Offload Use Cases  . . . . . . . . . . . . . . . . . . . . . .  8\n  3.1.  Overload Handling and Dimensioning . . . . . . . . . . . .  8\n  3.2.  Resiliency . . . . . . . . . . . . . . . . . . . . . . . .  9\n    3.2.1.  Failure of Content Delivery Resources  . . . . . . . .  9\n    3.2.2.  Content Acquisition Resiliency . . . . . . . . . . . . 10\n4.  Capability Use Cases . . . . . . . . . . . . . . . . . . . . . 11\n  4.1.  Device and Network Technology Extension  . . . . . . . . . 11\n  4.2.  Technology and Vendor Interoperability . . . . . . . . . . 12\n  4.3.  QoE and QoS Improvement  . . . . . . . . . . . . . . . . . 12\n5.  Enforcement of Content Delivery Policy . . . . . . . . . . . . 12\n6.  Acknowledgments  . . . . . . . . . . . . . . . . . . . . . . . 12\n7.  Security Considerations  . . . . . . . . . . . . . . . . . . . 13\n8.  References . . . . . . . . . . . . . . . . . . . . . . . . . . 13\n  8.1.  Normative References . . . . . . . . . . . . . . . . . . . 13\n  8.2.  Informative References . . . . . . . . . . . . . . . . . . 13\nAppendix A.  Content Service Providers' Delivery Policies  . . . . 14\n  A.1.  Content Delivery Policy Enforcement  . . . . . . . . . . . 14\n  A.2.  Secure Access  . . . . . . . . . . . . . . . . . . . . . . 15\n  A.3.  Branding . . . . . . . . . . . . . . . . . . . . . . . . . 15",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "Content Delivery Networks (CDNs) are commonly used for improving the End User experience of a content delivery service while keeping cost at a reasonable level. This document focuses on use cases that correspond to identified industry needs and that are expected to be realized once open interfaces and protocols supporting the interconnection of CDNs are specified and implemented. The document can be used to motivate the definition of the requirements (as documented in [CDNI-REQ]) to be supported by the set of CDN Interconnection (CDNI) interfaces defined in [RFC6707].",
      "ja": "コンテンツ配信ネットワーク（CDNのは）一般的に合理的なレベルでコストを維持しながら、コンテンツ配信サービスのエンドユーザー体験を向上させるために使用されています。この文書は、識別された業界のニーズに対応し、指定され実装されてオープンインターフェースとのCDNの相互接続をサポートするプロトコルを一度に実現されることが期待されるユースケースに焦点を当てています。ドキュメントは[RFC6707]で定義されたCDN相互接続（CDNI）インターフェイスのセットによって支持される（[CDNI-REQ]に記載されるように）要求の定義を動機づけるために使用することができます。"
    },
    {
      "indent": 3,
      "text": "[RFC3570] describes slightly different terminologies and models for \"Content Internetworking (CDI)\". This document obsoletes RFC 3570 to avoid confusion.",
      "ja": "[RFC3570]は、「コンテンツ・インターネットワーキング（CDI）」のためにわずかに異なる用語とモデルが記載されています。この文書では、混乱を避けるために、RFC 3570を廃止します。"
    },
    {
      "indent": 3,
      "text": "This document identifies the main motivations for a CDN Provider to interconnect its CDN:",
      "ja": "この文書では、そのCDNを相互接続するためのCDNプロバイダーのための主要な動機を識別します。"
    },
    {
      "indent": 3,
      "text": "o CDN Footprint Extension Use Cases (Section 2)",
      "ja": "O CDNフットプリント拡張ユースケース（第2節）"
    },
    {
      "indent": 3,
      "text": "o CDN Offload Use Cases (Section 3)",
      "ja": "O CDNオフロードユースケース（第3節）"
    },
    {
      "indent": 3,
      "text": "o CDN Capability Use Cases (Section 4)",
      "ja": "O CDN機能の使用事例（第4節）"
    },
    {
      "indent": 3,
      "text": "Then, the document highlights the need for interoperability in order to exchange and enforce content delivery policies (Section 5).",
      "ja": "その後、文書はコンテンツ配信ポリシー（第5節）を交換し、実施するために相互運用性の必要性を強調しています。"
    },
    {
      "indent": 0,
      "text": "1.1. Terminology",
      "section_title": true,
      "ja": "1.1。用語"
    },
    {
      "indent": 3,
      "text": "In this document, the first letter of each CDNI-specific term is capitalized. We adopt the terminology described in [RFC6707].",
      "ja": "この文書では、各CDNI固有の用語の最初の文字が大文字になります。私たちは、[RFC6707]で説明された用語を採用しています。"
    },
    {
      "indent": 3,
      "text": "We extend this terminology with the following term:",
      "ja": "我々は、次の項に、この用語を拡張します。"
    },
    {
      "indent": 3,
      "text": "Access CDN:",
      "ja": "アクセスCDN："
    },
    {
      "indent": 3,
      "text": "A CDN that includes Surrogates in the same administrative network as the End User. Such a CDN can use accurate information on the End User's network context to provide additional Content Delivery Services to Content Service Providers.",
      "ja": "エンドユーザーと同じ管理ネットワークでサロゲートを含んでCDN。このようなCDNは、コンテンツサービスプロバイダへの追加コンテンツ配信サービスを提供するために、エンドユーザーのネットワーク状況に正確な情報を使用することができます。"
    },
    {
      "indent": 0,
      "text": "1.2. Abbreviations",
      "section_title": true,
      "ja": "1.2。略語"
    },
    {
      "indent": 3,
      "text": "o CDN: Content Delivery Network, also known as Content Distribution Network",
      "ja": "O CDN：コンテンツ配信ネットワーク、また、コンテンツ配信ネットワークとして知られています"
    },
    {
      "indent": 3,
      "text": "o CSP: Content Service Provider o dCDN: downstream CDN",
      "ja": "O CSP：dCDN Oコンテンツサービスプロバイダー：下流CDN"
    },
    {
      "indent": 3,
      "text": "o DNS: Domain Name System",
      "ja": "OのDNS：ドメインネームシステム"
    },
    {
      "indent": 3,
      "text": "o EU: End User",
      "ja": "米国：エンドユーザー"
    },
    {
      "indent": 3,
      "text": "o ISP: Internet Service Provider",
      "ja": "O ISP：インターネット・サービス・プロバイダ"
    },
    {
      "indent": 3,
      "text": "o NSP: Network Service Provider",
      "ja": "O NSP：ネットワークサービスプロバイダ"
    },
    {
      "indent": 3,
      "text": "o QoE: Quality of Experience",
      "ja": "OのQoE：体感品質"
    },
    {
      "indent": 3,
      "text": "o QoS: Quality of Service",
      "ja": "OのQoSの：サービス品質"
    },
    {
      "indent": 3,
      "text": "o uCDN: upstream CDN",
      "ja": "上流CDN：uCDN O"
    },
    {
      "indent": 3,
      "text": "o URL: Uniform Resource Locator",
      "ja": "OのURL：ユニフォームリソースロケータ"
    },
    {
      "indent": 3,
      "text": "o WiFi: Wireless local area network (WLAN) based on IEEE 802.11",
      "ja": "O無線LAN：無線ローカルエリアネットワーク（WLAN）、IEEE802.11に基づきます"
    },
    {
      "indent": 0,
      "text": "1.3. Rationale for CDN Interconnection",
      "section_title": true,
      "ja": "1.3。 CDN相互接続のための理論的根拠"
    },
    {
      "indent": 3,
      "text": "Content Delivery Networks (CDNs) are used to deliver content because they can:",
      "ja": "コンテンツ配信ネットワーク（CDNのは）彼らができるので、コンテンツを配信するために使用されています。"
    },
    {
      "indent": 3,
      "text": "o improve the experience for the End User; for instance delivery has lower latency (decreased round-trip-time and higher throughput between the user and the delivery server) and better robustness (ability to use multiple delivery servers),",
      "ja": "Oエンドユーザーのエクスペリエンスを向上させます。インスタンス送達が低い待ち時間を有するため、より良好なロバスト性（複数の配信サーバを使用する能力）（ユーザと配信サーバとの間の往復時間およびより高いスループットの減少）"
    },
    {
      "indent": 3,
      "text": "o reduce the network operator's costs; for instance, lower delivery cost (reduced bandwidth usage) for cacheable content,",
      "ja": "Oネットワークオペレータのコストを削減。例えば、キャッシュ可能なコンテンツのためのより低い配信コスト（減少した帯域幅の使用）、"
    },
    {
      "indent": 3,
      "text": "o reduce the Content Service Provider's (CSP) internal infrastructure costs, such as data center capacity, space, and electricity consumption, as popular content is delivered externally through the CDN rather than through the CSP's own servers.",
      "ja": "O削減コンテンツサービスプロバイダ（CSP）などの人気コンテンツがCDN経由ではなく、CSP独自のサーバーを介して外部に配信されたデータセンターの能力、スペース、および電力消費、などの内部インフラストラクチャのコスト、。"
    },
    {
      "indent": 3,
      "text": "Indeed, many Network Service Providers (NSPs) and Enterprise Service Providers are deploying or have deployed their own CDNs. Despite the potential benefits of interconnecting CDNs, today each CDN is a stand-alone network. The objective of CDN Interconnection is to overcome this restriction; the interconnected CDNs should be able to collectively behave as a single delivery infrastructure.",
      "ja": "実際、多くのネットワークサービスプロバイダー（NSPの）およびエンタープライズ・サービス・プロバイダーが展開しているか、独自のCDNを展開しています。相互のCDNの潜在的な利点にもかかわらず、今日の各CDNは、スタンドアローンのネットワークです。 CDN相互接続の目的は、この制限を克服することです。相互接続のCDNをまとめて単一の配信インフラとして動作することができなければなりません。"
    },
    {
      "indent": 3,
      "text": "An example is depicted in Figure 1, where two CDN Providers establish a CDN Interconnection. The Content Service Provider CSP-1 reaches an agreement with CDN Provider 'A' for the delivery of its content. Independently, CDN Provider 'A' and CDN Provider 'B' agree to interconnect their CDNs.",
      "ja": "例は、二つのCDNプロバイダがCDN相互接続を確立する、図1に示されています。コンテンツサービスプロバイダCSP-1「」は、そのコンテンツの配信のためのCDNプロバイダとの合意に達しました。独立して、CDNプロバイダ「A」とCDNプロバイダ「B」自分のCDNを相互接続することに同意します。"
    },
    {
      "indent": 3,
      "text": "When a given User Agent requests content from CSP-1, CDN-A may consider that delivery by CDN-B is appropriate, for instance, because CDN-B is an Access CDN and the user is directly attached to it. Through the CDN Interconnection arrangements put in place between CDN-A and CDN-B (as a result of the CDN Interconnection agreement established between CDN Provider 'A' and CDN Provider 'B'), CDN-A can redirect the request to CDN-B and the content is actually delivered to the User Agent by CDN-B.",
      "ja": "所与のユーザエージェントは、CSP-1からコンテンツを要求すると、CDN-Aは、CDN-Bによってその送達を考慮することができるCDN-BがアクセスCDNであり、ユーザが直接それに接続されているので、例えば、適切です。 （CDNプロバイダ「A」とCDNプロバイダ「B」との間で確立さCDN相互接続協定の結果として）CDN-AとCDN-Bとの間の所定の位置に入れCDN相互接続協定を通じ、CDN-AはCDN-するための要求をリダイレクトすることができますBやコンテンツが実際にCDN-Bによるユーザエージェントに配信されます。"
    },
    {
      "indent": 3,
      "text": "The End User benefits from this arrangement through a better Quality of Experience (QoE, see [RFC6390]), because the content is delivered from a nearby Surrogate (e.g., lower latency, bottlenecks avoided). CDN Provider 'A' benefits because it does not need to deploy such an extensive CDN, while CDN Provider 'B' may receive some compensation for the delivery. CSP-1 benefits because it only needs to make one business agreement and one technical arrangement with CDN Provider 'A', but its End Users get a service quality as though CSP-1 had also gone to the trouble of making a business agreement and technical arrangement with CDN Provider 'B'.",
      "ja": "この構成からの経験の質の向上を通じてエンドユーザーのメリット（QoEのは、[RFC6390]を参照）、コンテンツが近くサロゲート（回避例えば、低遅延、ボトルネック）から配信されているため。 CDNプロバイダ「」恩恵CDNプロバイダ「B」の配信のためのいくつかの補償を受けるかもしれないが、それは、そのような大規模なCDNを展開する必要はありませんので。 CSPは-1の利益をそれだけで1つのビジネス契約と「A」CDNプロバイダと1つの技術的な配置を行うために必要があるため、しかし、CSP-1はまた、ビジネスの契約と技術を作るのトラブルに行っていたかのようにそのエンドユーザーには、サービスの品質を得ますCDNプロバイダ「B」との取り決め。"
    },
    {
      "indent": 3,
      "text": " +-------+ +-------+\n | CSP-1 | | CSP-2 |\n +-------+ +-------+\n     |         |\n    ,--,--,--./            ,--,--,--.\n ,-'          `-.       ,-'          `-.\n(CDN Provider 'A')=====(CDN Provider 'B')\n `-.  (CDN-A) ,-'       `-. (CDN-B)  ,-'\n    `--'--'--'             `--'--'--'\n                               |\n                         +----------+\n                         | End User |\n                         +----------+\n === CDN Interconnection",
      "raw": true
    },
    {
      "indent": 33,
      "text": "Figure 1",
      "ja": "図1"
    },
    {
      "indent": 3,
      "text": "To extend the example, another Content Service Provider, CSP-2, may also reach an agreement with CDN Provider 'A'. However, CSP-2 may not want its content to be distributed by CDN Provider B; for example, CSP-2 may not want to distribute its content in the area where CDN Provider 'B' operates. This example illustrates that policy considerations are an important part of CDNI.",
      "ja": "例を拡張するには、別のコンテンツサービスプロバイダ、CSP-2は、また、CDNプロバイダ「A」との合意に達する可能性があります。しかし、CSP-2は、そのコンテンツがCDNプロバイダーBによって配布されたくないかもしれません。例えば、CSP-2は、CDNプロバイダ「B」の動作領域にそのコンテンツを配信したくないかもしれません。この例では、ポリシーの考慮がCDNIの重要な一部であることを示しています。"
    },
    {
      "indent": 0,
      "text": "2. Footprint Extension Use Cases",
      "section_title": true,
      "ja": "2.フットプリント拡張ユースケース"
    },
    {
      "indent": 3,
      "text": "Footprint extension is expected to be a major use case for CDN Interconnection.",
      "ja": "フットプリントの拡張子は、CDNの相互接続のための主要なユースケースとして期待されています。"
    },
    {
      "indent": 0,
      "text": "2.1. Geographic Extension",
      "section_title": true,
      "ja": "2.1。地理的拡張"
    },
    {
      "indent": 3,
      "text": "In this use case, the CDN Provider wants to extend the geographic distribution that it can offer to its CSPs:",
      "ja": "このユースケースでは、CDNプロバイダは、そのCSPのに提供できる地理的分布を拡張したいです："
    },
    {
      "indent": 3,
      "text": "o without compromising the quality of delivery.",
      "ja": "配信の品質を損なうことなく、O。"
    },
    {
      "indent": 3,
      "text": "o without incurring additional transit and other network costs that would result from serving content from geographically or topologically remote Surrogates.",
      "ja": "地理的またはトポロジ的遠隔サロゲートからコンテンツを提供することから生じる追加の輸送およびその他のネットワークコストをかけずに、O。"
    },
    {
      "indent": 3,
      "text": "o without incurring the cost of deploying and operating Surrogates and the associated CDN infrastructure that may not be justified in the corresponding geographic region (e.g., because of relatively low delivery volume, or conversely because of the high investments that would be needed to satisfy the high volume).",
      "ja": "サロゲートを展開及び動作コストとが比較的低い送達体積の、又は逆に高いために満たすために必要とされる高い投資の、例えば、（対応する地理的領域で正当化されないことがあり、関連CDNインフラを招くことなく、Oボリューム）。"
    },
    {
      "indent": 3,
      "text": "If there are several CDN Providers that have a geographically limited footprint (e.g., restricted to one country), or do not serve all End Users in a geographic area, then interconnecting their CDNs enables these CDN Providers to provide their services beyond their own footprint.",
      "ja": "地理的に限られたフットプリントを持っているいくつかのCDNプロバイダがある場合（例えば、一つの国に限定）、またはその後、彼らのCDNは自分の足跡を超えて、そのサービスを提供するために、これらのCDNプロバイダを可能に相互接続する、地理的領域内のすべてのエンドユーザーにサービスを提供していません。"
    },
    {
      "indent": 3,
      "text": "As an example, suppose a French CSP wants to distribute its TV programs to End Users located in France and various countries in North Africa. It asks a French CDN Provider to deliver the content. The French CDN Provider's network only covers France, so it makes an agreement with another CDN Provider that covers North Africa. Overall, from the CSP's perspective, the French CDN Provider provides a CDN service for both France and North Africa.",
      "ja": "例として、フランスのCSPは、フランスや北アフリカの様々な国に位置してユーザーを終了するには、そのテレビ番組を配布したいとします。これは、コンテンツを配信するためにフランスのCDNプロバイダーに依頼します。フランスのCDNプロバイダーのネットワークは唯一のフランスをカバーし、それは北アフリカをカバーして別のCDNプロバイダとの契約になります。全体的に、CSPの視点から、フランスのCDNプロバイダーは、フランスや北アフリカの両方のためのCDNサービスを提供しています。"
    },
    {
      "indent": 3,
      "text": "In addition to video, this use case applies to other types of content such as automatic software updates (browser updates, operating system patches, virus database update, etc.).",
      "ja": "ビデオに加えて、このユースケースは、自動ソフトウェア更新（ブラウザの更新、オペレーティングシステムのパッチ、ウイルスデータベースの更新など）のような他のタイプのコンテンツにも適用されます。"
    },
    {
      "indent": 0,
      "text": "2.2. Inter-Affiliates Interconnection",
      "section_title": true,
      "ja": "2.2。インターアフィリエイト相互接続"
    },
    {
      "indent": 3,
      "text": "The previous section describes the case of geographic extension between CDNs operated by different entities. A large CDN Provider may have several subsidiaries that each operate their own CDN (which may rely on different CDN technologies, see Section 4.2). In certain",
      "ja": "前のセクションでは、異なるエンティティによって運営のCDNとの間の地理的な拡張の場合について説明します。大規模なCDNプロバイダは、それぞれ独自のCDN動作することを複数の子会社があり（別のCDN技術に依拠することができる、4.2節を参照してください）。一定で"
    },
    {
      "indent": 3,
      "text": "circumstances, the CDN Provider needs to make these CDNs interoperate to provide consistent service to its customers on the whole collective footprint.",
      "ja": "状況は、CDNプロバイダは、これらのCDNは、全体集団フットプリントに、顧客に一貫したサービスを提供するために、相互運用にする必要があります。"
    },
    {
      "indent": 0,
      "text": "2.3. ISP Handling of Third-Party Content",
      "section_title": true,
      "ja": "2.3。サードパーティコンテンツのISP取り扱い"
    },
    {
      "indent": 3,
      "text": "Consider an ISP carrying to its subscribers a lot of content that comes from a third-party CSP and that is injected into the ISP's network by an Authoritative CDN Provider. There are mutual benefits to the ISP (acting as an Access CDN), the Authoritative CDN, and the CSP that would make a case for establishing a CDNI agreement. For example:",
      "ja": "その加入者に、サードパーティのCSPから来ているコンテンツの多くを運ぶISPを考えると、それは権威CDNプロバイダによってISPのネットワーク内に注入されます。 CDNI契約を確立するためのケースになるだろうISP（アクセスCDNとして作用する）、権威CDN、およびCSPに相互の利点があります。例えば："
    },
    {
      "indent": 3,
      "text": "o allowing the CSP to offer improved QoE and QoE services to subscribers, for example, reduced content startup time or increased video quality and resolution of adaptive streaming content.",
      "ja": "CSPは、加入者に向上したQoEとQoEのサービスを提供できるようにO、例えば、コンテンツの起動時間や増加したビデオ品質とアダプティブストリーミングコンテンツの解像度を低下させました。"
    },
    {
      "indent": 3,
      "text": "o allowing the Authoritative CDN to reduce hardware capacity and footprint, by using the ISP caching and delivery capacity.",
      "ja": "権威CDNは、ISPキャッシング及び配信能力を使用して、ハードウェア容量とフットプリントを低減することができ、O。"
    },
    {
      "indent": 3,
      "text": "o allowing the ISP to reduce traffic load on some segments of the network by caching inside of the ISP network.",
      "ja": "ISPは、ISPネットワークの内部をキャッシュすることにより、ネットワークのいくつかのセグメント上のトラフィック負荷を軽減することができ、O。"
    },
    {
      "indent": 3,
      "text": "o allowing the ISP to influence and/or control the traffic ingress points.",
      "ja": "ISPはトラフィックの進入地点に影響を与え、および/または制御することができ、O。"
    },
    {
      "indent": 3,
      "text": "o allowing the ISP to derive some incremental revenue for transport of the traffic and to monetize QoE services.",
      "ja": "ISPはトラフィックの輸送のためのいくつかの増収を導出するとのQoEサービスを収益化することができ、O。"
    },
    {
      "indent": 0,
      "text": "2.4. Nomadic Users",
      "section_title": true,
      "ja": "2.4。遊牧ユーザー"
    },
    {
      "indent": 3,
      "text": "In this scenario, a CSP wishes to allow End Users who move between access networks to continue to access their content. The motivation of this case is to allow nomadic End Users to maintain access to content with a consistent QoE across a range of devices and/or geographic regions.",
      "ja": "このシナリオでは、CSPは、アクセスネットワーク間を移動するエンドユーザーが自分のコンテンツにアクセスし続けることができるようにしたいです。この場合の動機は、遊牧民のエンドユーザーは、デバイスおよび/または地域の範囲にわたって一貫性のQoEとコンテンツへのアクセスを維持することができるようにすることです。"
    },
    {
      "indent": 3,
      "text": "This use case covers situations like:",
      "ja": "このユースケースは次のような状況を説明します。"
    },
    {
      "indent": 3,
      "text": "o End Users moving between different access networks, which may be located within the same geographic region or different geographic regions.",
      "ja": "Oエンドユーザーは、同じ地理的領域または異なる地理的領域内に位置することができる異なるアクセスネットワーク間を移動します。"
    },
    {
      "indent": 3,
      "text": "o End Users switching between different devices or delivery technologies, as discussed in Section 4.",
      "ja": "セクション4で説明したように、Oエンドユーザは、異なるデバイスまたは送達技術切り替えます。"
    },
    {
      "indent": 3,
      "text": "Consider the following example, illustrated in Figure 2: End User A has a subscription to a broadband service from ISP A, her \"home ISP\". ISP A hosts CDN-A. Ordinarily, when End User A accesses content via ISP A (her \"home ISP\"), the content is delivered from CDN-A, which in this example is within ISP A's network.",
      "ja": "図2に示され、以下の例を考えてみましょう：エンドユーザーAはISP A、彼女の「ホームISP」からブロードバンドサービスに加入しています。 ISP Aは、CDN-Aをホストします。エンドユーザーAがISP A（彼女の「ホームISP」）を介してコンテンツにアクセスしたときに通常、コンテンツは、この例では、ISP Aのネットワーク内にあるCDN-A、から配信されます。"
    },
    {
      "indent": 3,
      "text": "However, while End User A is not connected to ISP A's network, for example, because it is connected to a WiFi provider or mobile network, End User A can also access the same content. In this case, End User A may benefit from accessing the same content delivered by an alternate CDN (CDN-B), in this case, hosted in the network of the WiFi or mobile provider (ISP B), rather than from CDN-A in ISP A's network.",
      "ja": "エンドユーザーAがISP Aのネットワークに接続されていない間、それはWiFiのプロバイダやモバイルネットワークに接続されているのでしかし、例えば、エンドユーザーAは、同じコンテンツにアクセスすることができます。この場合、エンドユーザーAはむしろCDN-Aからよりも、WiFiまたはモバイルプロバイダ（ISP B）のネットワークでホストされ、この場合には、代替的なCDN（CDN-B）によって送達同じコンテンツにアクセスから利益を得ることができますISP Aのネットワークインチ"
    },
    {
      "indent": 3,
      "text": "    +-------+\n    |Content|\n    +-------+\n        |\n    ,--,--,--.             ,--,--,--.\n ,-'  ISP A   `-.       ,-'  ISP B   `-.\n(    (CDN-A)     )=====(    (CDN-B)     )\n `-.          ,-'       `-.          ,-'\n    `--'--'--'             `--'--'--'\n         |                     |\n   +------------+      +---------------+\n   + EU A (home)|      | EU A (nomadic)|\n   +------------+      +---------------+\n === CDN Interconnection",
      "raw": true
    },
    {
      "indent": 33,
      "text": "Figure 2",
      "ja": "図2"
    },
    {
      "indent": 3,
      "text": "Though the content of CSP A is not accessible by typical End Users of CDN-B, End User A is able to gain access to her \"home\" content (i.e., the content of CSP A) through the alternate CDN (CDN-B).",
      "ja": "CSP Aの内容は、CDN-Bの典型的なエンドユーザーがアクセスすることはできませんが、エンドユーザーAは、別のCDN（CDN-B）を介して彼女の「ホーム」コンテンツ（すなわち、CSP Aの内容）へのアクセスを得ることが可能です。"
    },
    {
      "indent": 3,
      "text": "Depending on the CSP's content delivery policies (see Appendix A.1), a user moving to a different geographic region may be subject to geo-blocking content delivery restrictions. In this case, he/she may not be allowed to access some pieces of content.",
      "ja": "CSPのコンテンツ配信ポリシーに応じて、異なる地理的領域に移動し、ユーザがジオブロックするコンテンツ配信制限を受ける可能性が、（付録A.1を参照してください）。この場合、彼/彼女は、コンテンツのいくつかの作品にアクセスすることを許可されない場合があります。"
    },
    {
      "indent": 0,
      "text": "3. Offload Use Cases",
      "section_title": true,
      "ja": "3.オフロードユースケース"
    },
    {
      "indent": 0,
      "text": "3.1. Overload Handling and Dimensioning",
      "section_title": true,
      "ja": "3.1。過負荷の処理と寸法"
    },
    {
      "indent": 3,
      "text": "A CDN is likely to be dimensioned to support an expected maximum traffic load. However, unexpected spikes in content popularity (flash crowd) may drive load beyond the expected peak. The prime recurrent time peaks of content distribution may differ between two",
      "ja": "CDNは、予想される最大トラフィック負荷をサポートするような寸法にされる可能性が高いです。しかし、コンテンツの人気（フラッシュクラウド）の予想外のスパイクが予想されるピークを超えて負荷を駆動することができます。コンテンツ配信のプライム再発時間ピークは、二つの間で異なることができます"
    },
    {
      "indent": 3,
      "text": "CDNs. Taking advantage of the different traffic peak times, a CDN may interconnect with another CDN to increase its effective capacity during the peak of traffic. This brings dimensioning savings to the CDNs, as they can use each other's resources during their respective peaks of activity.",
      "ja": "CDN。異なるトラフィックのピーク時を利用して、CDNは、トラフィックのピーク時にその有効容量を増加させる別のCDNと相互接続することができます。彼らは活動のそれぞれのピーク時にお互いのリソースを使用することができ、これは、のCDNに寸法の削減をもたらします。"
    },
    {
      "indent": 3,
      "text": "Offload also applies to planned situations in which a CDN Provider needs CDN capacity in a particular region during a short period of time. For example, a CDN can offload traffic to another CDN for the duration of a specific maintenance operation or for the distribution of a special event, as in the scenario depicted in Figure 3. For instance, consider a TV channel that is the distributor for a major event, such as a celebrity's wedding or a major sport competition, and this TV channel has contracted particular CDNs for the delivery. The CDNs (CDN-A and CDN-B) that the TV channel uses for delivering the content related to this event are likely to experience a flash crowd during the event and will need to offload traffic, while other CDNs (CDN-C) will support a more typical traffic load and be able to handle the offloaded traffic.",
      "ja": "オフロードはまた、CDNプロバイダは、時間の短い期間内に特定の地域にCDNの容量を必要とする計画の状況に適用されます。例えば、CDNは、特定のメンテナンス作業の期間中又は特別なイベントの配信のために別のCDNへのトラフィックをオフロードすることができる。例えば、図3に示されたシナリオのように、分配器のためのものであるTVチャネルを考えますそのような有名人の結婚式や主要なスポーツ競技、このTVチャンネルなどの主要なイベントは、配信のための特定のCDNを契約しています。テレビのチャンネルは、このイベントに関連するコンテンツを配信するために使用することのCDN（CDN-AとCDN-B）は、イベント中にフラッシュ・クラウドを経験する可能性が高いと他のCDN（CDN-C）ながら、トラフィックをオフロードする必要がありますでしょうより一般的なトラフィック負荷をサポートし、オフロードトラフィックを処理することができます。"
    },
    {
      "indent": 3,
      "text": "In this use case, the Delivering CDN on which requests are offloaded should be able to handle the offloaded requests. Therefore, the uCDN might require information on the dCDNs to be aware of the amount of traffic it can offload to each dCDN.",
      "ja": "このユースケースでは、要求がオフロードされている配信するCDNは、オフロード要求を処理することができるはずです。したがって、uCDNは、各dCDNにオフロードすることができ、トラフィックの量に注意するdCDNsに関する情報が必要な場合があります。"
    },
    {
      "indent": 3,
      "text": "  +------------+\n  | TV Channel |\n  +------------+\n      |         \\\n   ,-,--,-.      \\ ,-,--,-.        ,-,--,-.\n ,'        `.    ,'        `.    ,' CDN-C  `.\n(   CDN-A    )  (   CDN-B    )==(  offload   )\n `.        ,'    `.        ,'    `.        ,'\n   `-'--'-'        `-'--'-'        `-'--'-'",
      "raw": true
    },
    {
      "indent": 4,
      "text": "=== CDN Interconnection",
      "ja": "=== CDN相互接続"
    },
    {
      "indent": 33,
      "text": "Figure 3",
      "ja": "図3"
    },
    {
      "indent": 0,
      "text": "3.2. Resiliency",
      "section_title": true,
      "ja": "3.2。回復力"
    },
    {
      "indent": 0,
      "text": "3.2.1. Failure of Content Delivery Resources",
      "section_title": true,
      "ja": "3.2.1。コンテンツ配信リソースの失敗"
    },
    {
      "indent": 3,
      "text": "It is important for CDNs to be able to guarantee service continuity during partial failures (e.g., failure of some Surrogates). In partial failure scenarios, a CDN Provider has at least three options:",
      "ja": "CDNは、部分的な障害時のサービス継続性を保証できるようにすることが重要である（例えば、いくつかのサロゲートの失敗）。部分的な障害のシナリオでは、CDNプロバイダは、少なくとも3つのオプションがあります。"
    },
    {
      "indent": 3,
      "text": "1. if possible, use internal mechanisms to redirect traffic onto surviving equipment,",
      "ja": "1.可能な場合は、機器の存続にトラフィックをリダイレクトするために内部メカニズムを使用して、"
    },
    {
      "indent": 3,
      "text": "2. depending on traffic management policies, forward some requests to the CSP's origin servers, and/or",
      "ja": "2.トラフィック管理ポリシーに応じて、CSPのオリジンサーバへのいくつかの要求を転送、および/または"
    },
    {
      "indent": 3,
      "text": "3. redirect some requests toward another CDN, which must be able to serve the redirected requests.",
      "ja": "3.リダイレクトされた要求にサービスを提供できなければなりません、別のCDNに向けて、いくつかの要求をリダイレクト。"
    },
    {
      "indent": 3,
      "text": "The last option is a use case for CDNI.",
      "ja": "最後のオプションはCDNIのためのユースケースです。"
    },
    {
      "indent": 0,
      "text": "3.2.2. Content Acquisition Resiliency",
      "section_title": true,
      "ja": "3.2.2。コンテンツ取得の回復力"
    },
    {
      "indent": 3,
      "text": "Source content acquisition may be handled in one of two ways:",
      "ja": "ソースコンテンツ取得は、次のいずれかの方法で処理することができます。"
    },
    {
      "indent": 3,
      "text": "o CSP origin, where a CDN acquires content directly from the CSP's origin server, or",
      "ja": "CDNは、CSPのオリジンサーバから直接コンテンツを取得CSPの起源、O、または"
    },
    {
      "indent": 3,
      "text": "o CDN origin, where a downstream CDN acquires content from a Surrogate within an upstream CDN.",
      "ja": "下流CDN上流CDN内サロゲートからコンテンツを取得O CDN起源。"
    },
    {
      "indent": 3,
      "text": "The ability to support content acquisition resiliency is an important use case for interconnected CDNs. When the content acquisition source fails, the CDN might switch to another content acquisition source. Similarly, when several content acquisition sources are available, a CDN might balance the load between these multiple sources.",
      "ja": "コンテンツ取得の耐障害性をサポートする能力は、相互接続のCDNのための重要なユースケースです。コンテンツの取得元に障害が発生した場合、CDNは、別のコンテンツ取得元に切り替えるかもしれません。同様に、いくつかのコンテンツ取得源が利用可能である場合、CDNは、これら複数のソース間で負荷のバランスを取るかもしれません。"
    },
    {
      "indent": 3,
      "text": "Though other server and/or DNS load-balancing techniques may be employed in the network, interconnected CDNs may have a better understanding of origin-server availability, and be better equipped to both distribute load between origin servers and attempt content acquisition from alternate content sources when acquisition failures occur. When normal content acquisition fails, a CDN may need to try other content source options, for example:",
      "ja": "他のサーバーおよび/またはDNS負荷分散技術は、ネットワークで使用することができるが、相互接続されたのCDNがオリジンサーバの可用性のより良い理解を持っている、との両方に優れた装備することができるオリジンサーバ間で負荷を分散し、代替コンテンツソースからのコンテンツの取得を試みます買収の失敗が発生したとき。通常のコンテンツ取得に失敗した場合、CDNは、例えば、他のコンテンツソースのオプションを試してみる必要があるかもしれません。"
    },
    {
      "indent": 3,
      "text": "o an upstream CDN may acquire content from an alternate CSP origin server,",
      "ja": "O上流CDNは、代替CSP元サーバからコンテンツを取得してもよいです。"
    },
    {
      "indent": 3,
      "text": "o a downstream CDN may acquire content from an alternate Surrogate within an upstream CDN,",
      "ja": "O下流CDNは、上流のCDN内代替のサロゲートからコンテンツを取得してもよいです。"
    },
    {
      "indent": 3,
      "text": "o a downstream CDN may acquire content from an alternate upstream CDN, or",
      "ja": "O下流CDNは、代替上流CDNからコンテンツを取得、あるいはよいです"
    },
    {
      "indent": 3,
      "text": "o a downstream CDN may acquire content directly from the CSP's origin server.",
      "ja": "O下流CDNは、CSPのオリジンサーバから直接コンテンツを取得することができます。"
    },
    {
      "indent": 3,
      "text": "Though content acquisition protocols are beyond the scope of CDNI, the selection of content acquisition sources should be considered and facilitated.",
      "ja": "コンテンツ取得プロトコルはCDNIの範囲を超えているものの、コンテンツ取得源の選択が考慮され、促進されるべきです。"
    },
    {
      "indent": 0,
      "text": "4. Capability Use Cases",
      "section_title": true,
      "ja": "4.能力ユースケース"
    },
    {
      "indent": 0,
      "text": "4.1. Device and Network Technology Extension",
      "section_title": true,
      "ja": "4.1。デバイスとネットワーク技術の拡張"
    },
    {
      "indent": 3,
      "text": "In this use case, the CDN Provider may have the right geographic footprint, but may wish to extend the supported range of devices and User Agents or the supported range of delivery technologies. In this case, a CDN Provider may interconnect with a CDN that offers services that:",
      "ja": "このユースケースでは、CDNプロバイダは、右の地理的なフットプリントを持っているかもしれませんが、デバイスおよびユーザエージェントまたは送達技術のサポート範囲のサポート範囲を拡張することもできます。この場合、CDNプロバイダは、そのサービスを提供していますCDNと相互接続することができます。"
    },
    {
      "indent": 3,
      "text": "o the CDN Provider is not willing to provide, or",
      "ja": "CDNプロバイダーが提供することを望んでいない、O、または"
    },
    {
      "indent": 3,
      "text": "o its own CDN is not able to support.",
      "ja": "O独自のCDNをサポートすることができません。"
    },
    {
      "indent": 3,
      "text": "The following examples illustrate this use case:",
      "ja": "次の例では、このユースケースを示しています。"
    },
    {
      "indent": 3,
      "text": "1. CDN-A cannot support a specific delivery protocol. For instance, CDN-A may interconnect with CDN-B to serve a proportion of its traffic that requires HTTPS [RFC2818]. CDN-A may use CDN-B's footprint (which may overlap with its own) to deliver HTTPS without needing to deploy its own infrastructure. This case could also be true of other formats, delivery protocols (e.g., the Real Time Messaging Protocol (RTMP), the Real Time Streaming Protocol (RTSP), etc.), and features (specific forms of authorization such as tokens, per session encryption, etc.).",
      "ja": "1. CDN-Aは、特定の配信プロトコルをサポートすることができません。例えば、CDN-Aは、HTTPS [RFC2818]を必要とし、そのトラフィックの割合を提供するCDN-Bと相互接続することができます。 CDN-Aは、独自のインフラストラクチャを展開することなくHTTPSを送達するために（それ自身と重なっていてもよい）CDN-Bのフットプリントを使用することができます。この場合は、他の形式の真の可能性があり、配信プロトコル（例えば、Real Time Messaging Protocol（RTMP）を、リアルタイムストリーミングプロトコル（RTSP）、など）、および機能（セッションごとに、このようなトークンなどの認証の具体的な形態、暗号化、など）。"
    },
    {
      "indent": 3,
      "text": "2. CDN-A has a footprint covering traditional fixed-line broadband and wants to extend coverage to mobile devices. In this case, CDN-A may contract and interconnect with CDN-B, who has both:",
      "ja": "前記CDN-Aは、従来の固定回線ブロードバンドを覆うフットプリントを有しており、モバイルデバイスにカバレッジを拡張することを望みます。この場合には、CDN-Aは、の両方を有するCDN-B、と契約および相互接続することができます。"
    },
    {
      "indent": 7,
      "text": "* a physical footprint inside the mobile network,",
      "ja": "*モバイルネットワーク内の物理的な設置面積、"
    },
    {
      "indent": 7,
      "text": "* the ability to deliver content over a protocol that is required by specific mobile devices.",
      "ja": "*特定のモバイルデバイスによって必要とされるプロトコルを介してコンテンツを配信する能力。"
    },
    {
      "indent": 3,
      "text": "3. CDN-A only supports IPv4 within its infrastructure but wants to deliver content over IPv6. CDN-B supports both IPv4 and IPv6 within its infrastructure. CDN-A interconnects with CDN-B to serve out its content over native IPv6 connections.",
      "ja": "3. CDN-Aは、そのインフラストラクチャ内のIPv4をサポートしていますが、IPv6を介したコンテンツを提供したいと考えています。 CDN-Bは、そのインフラストラクチャ内でIPv4とIPv6の両方をサポートしています。ネイティブIPv6接続を介してコンテンツをサービスするCDN-BとのCDN-A相互接続。"
    },
    {
      "indent": 3,
      "text": "These cases can apply to many CDN features that a given CDN Provider may not be able to support or not be willing to invest in, and thus, that the CDN Provider would delegate to another CDN.",
      "ja": "これらの例は、CDNプロバイダが別のCDNに委譲することを、与えられたCDNプロバイダは、このようにサポートしてかに投資することをいとわない、とすることができないかもしれない多くのCDN機能に適用することができます。"
    },
    {
      "indent": 0,
      "text": "4.2. Technology and Vendor Interoperability",
      "section_title": true,
      "ja": "4.2。テクノロジーとベンダーの相互運用性"
    },
    {
      "indent": 3,
      "text": "A CDN Provider may deploy a new CDN to run alongside its existing CDN as a simple way of migrating its CDN service to a new technology. In addition, a CDN Provider may have a multi-vendor strategy for its CDN deployment. Finally, a CDN Provider may want to deploy a separate CDN for a particular CSP or a specific network. In all these circumstances, CDNI benefits the CDN Provider, as it simplifies or automates some inter-CDN operations (e.g., migrating the request routing function progressively).",
      "ja": "CDNプロバイダーは、新技術へのCDNサービスを移行する簡単な方法として、既存のCDNと一緒に実行するために、新たなCDNを導入することがあります。また、CDNプロバイダはそのCDNの展開のためのマルチベンダーの戦略を持っていることがあります。最後に、CDNプロバイダは、特定のCSPまたは特定のネットワークに別々のCDNを展開することをお勧めします。それは単純化またはいくつかの間CDNの操作を自動化するように、すべてのこれらの状況では、CDNIは、CDNプロバイダに利益をもたらす（例えば、徐々にリクエストルーティング機能を移行します）。"
    },
    {
      "indent": 0,
      "text": "4.3. QoE and QoS Improvement",
      "section_title": true,
      "ja": "4.3。 QoEおよびQoS改善"
    },
    {
      "indent": 3,
      "text": "Some CSPs are willing to pay a premium for enhanced delivery of content to their End Users. In some cases, even if the CDN Provider could deliver the content to the End Users, it would not meet the CSP's service-level requirements. As a result, the CDN Provider may establish a CDN Interconnection agreement with another CDN Provider that can provide the expected QoE to the End User, e.g., via an Access CDN that is able to deliver content from Surrogates located closer to the End User and with the required service level.",
      "ja": "いくつかのCSPは、エンドユーザーへのコンテンツの強化配信のために保険料を支払うことを喜んでいます。いくつかのケースでは、CDNプロバイダは、エンドユーザーにコンテンツを配信することができたとしても、それはCSPのサービスレベルの要件を満たしていないだろう。その結果、CDNプロバイダは、エンドユーザーに近いとして位置サロゲートからコンテンツを配信することが可能であるアクセスCDNを経由して、例えば、エンドユーザーに期待されたQoEを提供することができ、別のCDNプロバイダとのCDN相互接続契約を確立することができます必要なサービス・レベル。"
    },
    {
      "indent": 0,
      "text": "5. Enforcement of Content Delivery Policy",
      "section_title": true,
      "ja": "コンテンツ配信ポリシーの施行5."
    },
    {
      "indent": 3,
      "text": "An important aspect common to all the above use cases is that CSPs typically want to enforce content delivery policies. A CSP may want to define content delivery policies that specify when, how, and/or to whom the CDN delivers content. These policies apply to all interconnected CDNs (uCDNs and dCDNs) in the same or similar way that a CSP can define content delivery policies for content delivered by a single, non-interconnected CDN. Appendix A provides examples of CSP-defined policies.",
      "ja": "上記のすべてのユースケースに共通する重要な側面は、CSPのは、通常、コンテンツ配信ポリシーを適用したいということです。 CSPは、どのように、および/またはCDNは、コンテンツを配信誰に指定したコンテンツ配信ポリシーを定義することもできます。これらのポリシーは、CSPは、単一の、非相互接続CDNによって配信されたコンテンツのためのコンテンツ配信ポリシーを定義することができるのと同じまたは類似の方法で、すべての相互接続のCDN（uCDNsとdCDNs）に適用されます。付録Aは、CSP-定義されたポリシーの例を示します。"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgments",
      "section_title": true,
      "ja": "6.謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Kent Leung, Francois Le Faucheur, Ben Niven-Jenkins, and Scott Wainner for lively discussions, as well as for their reviews and comments on the mailing list.",
      "ja": "著者は、メーリングリスト上でのレビューやコメントのためだけでなく、活発な議論のためにケントレオン、フランソワ・ルFaucheur、ベン・ニーヴン・ジェンキンス、とスコット・ワイナーに感謝したいと思います。"
    },
    {
      "indent": 3,
      "text": "They also thank the contributors of the EU FP7 OCEAN and ETICS projects for valuable inputs.",
      "ja": "彼らはまた、貴重な入力のためのEU FP7 OCEANとETICSプロジェクトの貢献に感謝します。"
    },
    {
      "indent": 3,
      "text": "Finally, the authors acknowledge the work of the former CDI working group. This document obsoletes [RFC3570] to avoid confusion.",
      "ja": "最後に、著者はかつてのCDIワーキンググループの作業を認めます。この文書では、混乱を避けるために、[RFC3570]を廃止します。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "ja": "7.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document focuses on the motivational use cases for CDN Interconnection and does not analyze the associated threats. Those threats are discussed in [RFC6707]. Appendix A.2 of this document provides example security policies that CSPs might impose on CDNs to mitigate the threats.",
      "ja": "この文書では、CDNの相互接続のための動機付けのユースケースに焦点を当て、関連する脅威を分析しません。これらの脅威は[RFC6707]で議論されています。このドキュメントの付録A.2は、CSPのは、脅威を軽減するためのCDNに課す可能性がある例のセキュリティポリシーを提供します。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8.参照文献"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "ja": "8.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC6707] Niven-Jenkins, B., Le Faucheur, F., and N. Bitar, \"Content Distribution Network Interconnection (CDNI) Problem Statement\", RFC 6707, September 2012.",
      "ja": "[RFC6707]ニーヴン・ジェンキンス、B.、ルFaucheur、F.、およびN.ビタール、 \"コンテンツ配信ネットワーク相互接続（CDNI）問題文\"、RFC 6707、2012年9月。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "ja": "8.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[CDNI-REQ] Leung, K. and Y. Lee, \"Content Distribution Network Interconnection (CDNI) Requirements\", Work in Progress, June 2012.",
      "ja": "[CDNI-REQ]レオン、K.とY.リー、 \"コンテンツ配信ネットワーク相互接続（CDNI）の要件\"、進歩、2012年6月での作業。"
    },
    {
      "indent": 3,
      "text": "[RFC2818] Rescorla, E., \"HTTP Over TLS\", RFC 2818, May 2000.",
      "ja": "[RFC2818]レスコラ、E.、 \"TLSオーバーHTTP\"、RFC 2818、2000年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC3570] Rzewski, P., Day, M., and D. Gilletti, \"Content Internetworking (CDI) Scenarios\", RFC 3570, July 2003.",
      "ja": "[RFC3570] Rzewski、P.、日、M.、およびD. Gilletti、 \"コンテンツインターネットワーキング（CDI）シナリオ\"、RFC 3570、2003年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC6390] Clark, A. and B. Claise, \"Guidelines for Considering New Performance Metric Development\", BCP 170, RFC 6390, October 2011.",
      "ja": "[RFC6390]クラーク、A.およびB. Claise、 \"新パフォーマンスメトリック開発を検討するためのガイドライン\"、BCP 170、RFC 6390、2011年10月。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Content Service Providers' Delivery Policies",
      "ja": "付録A.コンテンツサービスプロバイダの配信ポリシー"
    },
    {
      "indent": 3,
      "text": "CSPs commonly apply different delivery policies to given sets of content assets delivered through CDNs. Interconnected CDNs need to support these policies. This appendix presents examples of CSPs' delivery policies and their consequences on CDNI operations.",
      "ja": "CSPは一般のCDNを通じて配信されたコンテンツ資産の特定のセットに異なる配信ポリシーを適用します。相互接続されたのCDNは、これらのポリシーをサポートする必要があります。この付録では、CSPの配信ポリシーとCDNI業務上のその結果の例を示します。"
    },
    {
      "indent": 0,
      "text": "A.1. Content Delivery Policy Enforcement",
      "ja": "A.1。コンテンツ配信ポリシー施行"
    },
    {
      "indent": 3,
      "text": "The content distribution policies that a CSP attaches to a content asset may depend on many criteria. For instance, distribution policies for audiovisual content often combine constraints of varying levels of complexity and sophistication, for example:",
      "ja": "CSPは、コンテンツ資産に接続するコンテンツ配信ポリシーは、多くの基準に依存してもよいです。例えば、オーディオビジュアルコンテンツの配布ポリシーは、多くの場合、例えば、複雑さと洗練のさまざまなレベルの制約を組み合わせました："
    },
    {
      "indent": 3,
      "text": "o temporal constraints (e.g., available for 24 hours, available 28 days after DVD release, etc.),",
      "ja": "（24時間利用でき、例えば、28日DVDリリース後に使用可能、など）、時間的な制約O、"
    },
    {
      "indent": 3,
      "text": "o user agent platform constraints (e.g., mobile device platforms, desktop computer platforms, set-top-box platforms, etc.),",
      "ja": "Oユーザー・エージェント・プラットフォームの制約（例えば、モバイル・デバイス・プラットフォーム、デスクトップ・コンピュータ・プラットフォーム、セットトップボックスプラットフォーム、等）、"
    },
    {
      "indent": 3,
      "text": "o resolution-based constraints (e.g., high definition vs. standard definition encodings),",
      "ja": "O解像度ベースの制約条件（例えば、高精細対標準精細エンコーディング）"
    },
    {
      "indent": 3,
      "text": "o user agent identification or authorization,",
      "ja": "、ユーザエージェント識別または許可O"
    },
    {
      "indent": 3,
      "text": "o access network constraints (e.g., per NSP), and",
      "ja": "Oアクセスネットワークの制約（例えば、NSP当たり）、及び"
    },
    {
      "indent": 3,
      "text": "o IP geo-blocking constraints (e.g., for a given coverage area).",
      "ja": "O IPジオブロッキング（所与のカバレッジエリアのために、例えば）制約。"
    },
    {
      "indent": 3,
      "text": "CSPs may use sophisticated policies in accordance with their business model. However, the enforcement of those policies does not necessarily require that the delivery network understand the policy rationales or how policies apply to specific content assets. Content delivery policies may be distilled into simple rules that can be commonly enforced across all dCDNs. These rules may influence dCDN delegation and Surrogate selection decisions, for instance, to ensure that the specific rules (e.g., time-window, geo-blocking, pre-authorization validation) can indeed be enforced by the Delivering CDN. In turn, this can guarantee to the CSP that content delivery policies are properly applied.",
      "ja": "CSPは彼らのビジネスモデルに合わせて洗練されたポリシーを使用することができます。しかし、これらのポリシーの施行は、必ずしも配信ネットワークは、ポリシーの根拠を理解したり、どのようにポリシーが特定のコンテンツ資産に適用されることを必要としません。コンテンツ配信ポリシーは、一般的に、すべてのdCDNs渡って実施することができ、単純なルールに蒸留することができます。これらのルールは、特定の規則（例えば、タイムウィンドウ、ジオブロッキング、事前承認の確認）が実際に配信CDNによって実施することができることを確実にするために、例えば、dCDN委任と代理選択決定に影響を及ぼし得ます。ターンでは、これは、コンテンツ配信ポリシーが正しく適用されていることをCSPに保証することができます。"
    },
    {
      "indent": 3,
      "text": "+-----+\n| CSP |  Policies driven by business (e.g., available only\n+-----+  in the UK and only from July 1st to September 1st)\n   \\\n    \\ Translate policies into\n     \\simple rules (e.g., provide an authorization token)\n      \\\n       V\n     +-----+\n     | CDN | Apply simple rules (e.g., check an\n     +-----+ authorization token and enforce geo-blocking)\n         \\\n          \\ Distribute simple rules\n           V\n         +-----+\n         | CDN | Apply simple rules\n         +-----+",
      "raw": true
    },
    {
      "indent": 33,
      "text": "Figure 4",
      "ja": "図4"
    },
    {
      "indent": 0,
      "text": "A.2. Secure Access",
      "ja": "A.2。セキュアなアクセス"
    },
    {
      "indent": 3,
      "text": "Many protocols exist for delivering content to End Users. CSPs may dictate a specific protocol or set of protocols that are acceptable for delivery of their content, especially in the case where a secured content transmission is required (e.g., must use HTTPS). CSPs may also perform a per-request authentication/authorization decision and then have the CDNs enforce that decision (e.g., must validate URL signing, etc.).",
      "ja": "多くのプロトコルは、エンドユーザーにコンテンツを配信するために存在します。 CSPは、特に保護されたコンテンツの伝送が要求される場合（例えば、HTTPSを使用しなければならない）に、特定のプロトコルまたはそれらのコンテンツの配信のために許容されるプロトコルのセットを決定することができます。 CSPはまた、要求ごとの認証/認可の決定を行い、その後のCDN（例えば、など、URLの署名を検証する必要があります）その決定を強制する必要があります。"
    },
    {
      "indent": 0,
      "text": "A.3. Branding",
      "ja": "A.3。ブランディング"
    },
    {
      "indent": 3,
      "text": "Preserving the branding of the CSP throughout delivery is often important to the CSP. CSPs may desire to offer content services under their own name, even when the associated CDN service involves other CDN Providers. For instance, a CSP may desire to ensure that content is delivered with URIs appearing to the End Users under the CSP's own domain name, even when the content delivery involves separate CDN Providers. The CSP may wish to prevent the delivery of its content by specific dCDNs that lack support for such branding preservation features.",
      "ja": "配達を通じてCSPのブランドを維持することは、多くの場合、CSPに重要です。 CSPは関連するCDNサービスは、他のCDNプロバイダーが含まれていても、自分の名前の下にコンテンツサービスを提供することを望むかもしれません。例えば、CSPは、コンテンツ配信が別のCDNプロバイダーが含まれていても、そのコンテンツは、CSPの独自ドメイン名の下にエンドユーザーに表示されるのURIで配信されていることを確認することを望むかもしれません。 CSPは、このようなブランディング保全機能をサポートしていない特定のdCDNsによって、そのコンテンツの配信を防止したい場合があります。"
    },
    {
      "indent": 3,
      "text": "Analogous cases exist when the uCDN wants to offer CDN services under its own branding even if dCDNs are involved, and so it restricts the delivery delegation to a chain that preserves its brand visibility.",
      "ja": "類似の例はuCDNがdCDNsが関与している場合でも、自身のブランドの下でCDNサービスを提供したいと考えたときに存在し、そしてそれは、そのブランドの認知度を維持するチェーンに配信委任を制限します。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Gilles Bertrand (editor) France Telecom - Orange 38-40 rue du General Leclerc Issy les Moulineaux, 92130 FR Phone: +33 1 45 29 89 46 EMail: gilles.bertrand@orange.com",
      "ja": "ジル・ベルトラン（編集者）フランステレコム - オレンジ38-40 RUEデュ一般ルクレールイッシー・レ・ムリノー、92130、FR電話：+33 1 45 29 89 46 Eメール：gilles.bertrand@orange.com"
    },
    {
      "indent": 3,
      "text": "Stephan Emile France Telecom - Orange 2 avenue Pierre Marzin Lannion F-22307 FR EMail: emile.stephan@orange.com",
      "ja": "ステファン・エミールフランステレコム - オレンジ2大通りピエールMarzinラニオンF-22307 FR Eメール：emile.stephan@orange.com"
    },
    {
      "indent": 3,
      "text": "Trevor Burbridge BT B54 Room 70, Adastral Park, Martlesham Ipswich, IP5 3RE UK EMail: trevor.burbridge@bt.com",
      "ja": "トレバー・バーブリッジBT B54ルーム70、Adastral公園、Martleshamイプスウィッチ、IP5 3RE英国Eメール：trevor.burbridge@bt.com"
    },
    {
      "indent": 3,
      "text": "Philip Eardley BT B54 Room 77, Adastral Park, Martlesham Ipswich, IP5 3RE UK EMail: philip.eardley@bt.com",
      "ja": "フィリップEardley BT B54ルーム77、Adastral公園、Martleshamイプスウィッチ、IP5 3RE英国Eメール：philip.eardley@bt.com"
    },
    {
      "indent": 3,
      "text": "Kevin J. Ma Azuki Systems, Inc. 43 Nagog Park Acton, MA 01720 USA Phone: +1 978-844-5100 EMail: kevin.ma@azukisystems.com",
      "ja": "ケヴィン・J.馬小豆システムズ株式会社43 Nagogパーク、アクトン、MA 01720 USA電話：+1 978-844-5100電子メール：kevin.ma@azukisystems.com"
    },
    {
      "indent": 3,
      "text": "Grant Watson Alcatel-Lucent (Velocix) 3 Ely Road Milton, Cambridge CB24 6AA UK EMail: gwatson@velocix.com",
      "ja": "gwatson@velocix.com：ワトソンアルカテル・ルーセント（Velocix）3エリー道路ミルトン、ケンブリッジCB24 6AA、英国の電子メールを付与"
    }
  ]
}