{
  "title": {
    "text": "RFC 6791 - Stateless Source Address Mapping for ICMPv6 Packets",
    "ja": "RFC 6791 - ICMPv6のパケットのためのステートレスソースアドレスのマッピング"
  },
  "number": 6791,
  "created_at": "2019-10-31 01:08:45.813071+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                             X. Li\nRequest for Comments: 6791                                        C. Bao\nUpdates: 6145                          CERNET Center/Tsinghua University\nCategory: Standards Track                                        D. Wing\nISSN: 2070-1721                                         R. Vaithianathan\n                                                                   Cisco\n                                                               G. Huston\n                                                                   APNIC\n                                                           November 2012",
      "raw": true
    },
    {
      "indent": 10,
      "text": "Stateless Source Address Mapping for ICMPv6 Packets",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "A stateless IPv4/IPv6 translator may receive ICMPv6 packets containing non-IPv4-translatable addresses as the source. These packets should be passed across the translator as ICMP packets directed to the IPv4 destination. This document presents recommendations for source address translation in ICMPv6 headers to handle such cases.",
      "ja": "ステートレスのIPv4 / IPv6トランスレータは、ソースなどの非IPv4に翻訳可能なアドレスを含むのICMPv6パケットを受信することができます。これらのパケットは、IPv4宛先に向けICMPパケットとして翻訳を通過しなければなりません。この文書では、このようなケースを処理するためのICMPv6ヘッダーのソースアドレス変換のための勧告を提示しています。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6791.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6791で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2012 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2012 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . . . 2\n2.  Notational Conventions  . . . . . . . . . . . . . . . . . . . . 3\n3.  Problem Statement and Considerations  . . . . . . . . . . . . . 3\n  3.1.  Considerations  . . . . . . . . . . . . . . . . . . . . . . 3\n  3.2.  Recommendations . . . . . . . . . . . . . . . . . . . . . . 3\n4.  ICMP Extension  . . . . . . . . . . . . . . . . . . . . . . . . 4\n5.  Stateless Address Mapping Algorithm . . . . . . . . . . . . . . 4\n6.  Security Considerations . . . . . . . . . . . . . . . . . . . . 4\n7.  Acknowledgments . . . . . . . . . . . . . . . . . . . . . . . . 4\n8.  References  . . . . . . . . . . . . . . . . . . . . . . . . . . 5\n  8.1.  Normative References  . . . . . . . . . . . . . . . . . . . 5\n  8.2.  Informative References  . . . . . . . . . . . . . . . . . . 5",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "Section 5.3 of \"IP/ICMP Translation Algorithm\" [RFC6145] states that \"the IPv6 addresses in the IPv6 header may not be IPv4-translatable addresses and there will be no corresponding IPv4 addresses representing this IPv6 address. In this case, the translator can do stateful translation. A mechanism by which the translator can instead do stateless translation of this address is left for future work.\" This document, \"Stateless Source Address Mapping for ICMPv6 Packets\", provides recommendations for this case.",
      "ja": "「IP / ICMP翻訳アルゴリズム」[RFC6145]のセクション5.3は、IPv6は、IPv4-並進アドレスではないかもしれないIPv6ヘッダのアドレスと、このIPv6アドレスを表す該当するIPv4アドレスで存在しません」と述べている。この場合には、翻訳者ができステートフルな翻訳を行います。翻訳者は、代わりにこのアドレスのステートレスな変換を行うことができる機構が将来の仕事のために残されています。」この文書で、「ICMPv6のパケットのためのステートレスソースアドレスマッピング」、この場合の推奨を提供します。"
    },
    {
      "indent": 3,
      "text": "For the purposes of this document, the term \"IPv4-translatable IPv6 address\" is as defined in Section 2.2 of [RFC6052].",
      "ja": "本文書の目的のために、用語「IPv4に翻訳可能なIPv6アドレスは、」[RFC6052]のセクション2.2で定義した通りです。"
    },
    {
      "indent": 0,
      "text": "2. Notational Conventions",
      "section_title": true,
      "ja": "2.表記規則"
    },
    {
      "indent": 3,
      "text": "The key words MUST, MUST NOT, REQUIRED, SHALL, SHALL NOT, SHOULD, SHOULD NOT, RECOMMENDED, MAY, and OPTIONAL, when they appear in this document, are to be interpreted as described in [RFC2119].",
      "ja": "彼らは、この文書に表示される[RFC2119]で説明したように解釈される際のキーワードは、REQUIREDは、、、、、MAY、推奨、およびオプションのすべきでないないものとものとしてはなりませんしなければなりません。"
    },
    {
      "indent": 0,
      "text": "3. Problem Statement and Considerations",
      "section_title": true,
      "ja": "3.問題文と考慮事項"
    },
    {
      "indent": 3,
      "text": "When a stateless IPv4/IPv6 translator receives an ICMPv6 message [RFC4443] (for example, \"Packet Too Big\") sourced from a non-IPv4- translatable IPv6 address and bound for an IPv4-translatable IPv6 address, the translator needs to pick a source address with which to generate an ICMP message. For the reasons discussed below, this choice is problematic.",
      "ja": "ステートレスのIPv4 / IPv6トランスレータは、ICMPv6メッセージを受信した場合[RFC4443]（例えば、「パケット過大」）は、非IPv4-並進IPv6アドレスとIPv4-並進IPv6アドレスのためのバウンドから供給さ、翻訳者が選択する必要がありますICMPメッセージを生成すると、送信元アドレス。以下で説明する理由により、この選択には問題があります。"
    },
    {
      "indent": 0,
      "text": "3.1. Considerations",
      "section_title": true,
      "ja": "3.1. 検討事項"
    },
    {
      "indent": 3,
      "text": "The source address used SHOULD NOT cause the ICMP packet to be discarded. It SHOULD NOT be drawn from [RFC1918] or [RFC6598] address space, because that address space is likely to be subject to unicast Reverse Path Forwarding (uRPF) [RFC3704] filtering.",
      "ja": "使用されるソースアドレスは、ICMPパケットを破棄するべきではありません。そのアドレス空間は、ユニキャストRPF（uRPFの）[RFC3704]、フィルタリングの対象となる可能性があるので、[RFC1918]または[RFC6598]アドレス空間から引き出されるべきではありません。"
    },
    {
      "indent": 3,
      "text": "IPv4/IPv6 translation is intended for use in contexts where IPv4 addresses may not be readily available. Therefore, it is not considered appropriate to assign IPv4-translatable IPv6 addresses for all internal points in the IPv6 network that may originate ICMPv6 messages.",
      "ja": "IPv4 / IPv6変換は、IPv4アドレスは容易に入手できない場合があり状況下での使用のために意図されます。したがって、ICMPv6メッセージを発信することができるIPv6ネットワーク内のすべての内部点のIPv4-並進IPv6アドレスを割り当てるために適切であると考えていません。"
    },
    {
      "indent": 3,
      "text": "Another consideration for source selection is that it should be possible for the IPv4 recipients of the ICMP message to be able to distinguish between different IPv6 network origination of ICMPv6 messages (for example, to support a traceroute diagnostic utility that provides some limited network-level visibility across the IPv4/ IPv6 translator). This consideration implies that an IPv4/IPv6 translator needs to have a pool of IPv4 addresses for mapping the source address of ICMPv6 packets generated from different origins, or to include the IPv6 source address information for mapping the source address by others means. Currently, the TRACEROUTE and MTR [MTR] are the only consumers of translated ICMPv6 messages that care about the ICMPv6 source address.",
      "ja": "ソース選択のための別の考慮事項は、ICMPメッセージのIPv4の受信者は、ICMPv6メッセージの異なるIPv6ネットワーク元を区別できるようにするために、それは（例えば、いくつかの限られたネットワーク・レベルの可視性を提供するトレースルート診断ユーティリティをサポートすることが可能でなければならないということですIPv4 / IPv6トランスレータにわたります）。この考察は、IPv4 / IPv6トランスレータは、異なる起源から生成されたのICMPv6パケットのソースアドレスをマッピングするためのIPv4アドレスのプールを有するように、又は他の手段によって、送信元アドレスをマッピングするためのIPv6ソースアドレス情報を含める必要があることを意味します。現在、TRACEROUTEとMTR [MTR]は、ICMPv6の送信元アドレスを気に翻訳されたICMPv6メッセージの唯一の消費者があります。"
    },
    {
      "indent": 0,
      "text": "3.2. Recommendations",
      "section_title": true,
      "ja": "3.2. 勧告"
    },
    {
      "indent": 3,
      "text": "The recommended approach to source selection is to use a single (or small pool of) public IPv4 address as the source address of the translated ICMP message and leverage the ICMP extension [RFC5837] to include the IPv6 address as an Interface IP Address Sub-Object.",
      "ja": "ソース選択に推奨されるアプローチは、インターフェースIPアドレスサブオブジェクトとしてIPv6アドレスを含むように翻訳されたICMPメッセージのソースアドレスとして単一の（または小さいプール）パブリックIPv4アドレスを使用して、ICMP拡張[RFC5837]を活用することです。"
    },
    {
      "indent": 0,
      "text": "4. ICMP Extension",
      "section_title": true,
      "ja": "4. ICMP拡張"
    },
    {
      "indent": 3,
      "text": "In the case of either a single public IPv4 address (the IPv4 interface address or loopback address of the translator) or a pool of public IPv4 addresses, the translator SHOULD implement the ICMP extension defined by [RFC5837]. The ICMP message SHOULD include the Interface IP Address Sub-Object and specify the source IPv6 addresses of the original ICMPv6. When an enhanced traceroute application is used, it can derive the real IPv6 source addresses that generated the ICMPv6 messages. Therefore, it would be able improve on visibility towards the origin rather than simply blackholing at or beyond the translator. In the future, a new ICMP extension whose presence indicates that the packet has been translated and that the source address belongs to the translator, not the originating node, can also be considered.",
      "ja": "いずれかの単一のパブリックIPv4アドレス（IPv4インタフェースアドレスまたは翻訳のループバックアドレス）またはパブリックIPv4アドレスのプールの場合、翻訳者は[RFC5837]で定義されたICMP拡張を実装する必要があります。 ICMPメッセージは、インターフェースIPアドレスサブオブジェクトが含まれ、元のICMPv6の送信元IPv6アドレスを指定する必要があります。拡張tracerouteのアプリケーションを使用する場合には、ICMPv6メッセージを生成し、実際のIPv6ソースアドレスを導き出すことができます。したがって、原点に対する可視性ではなく、単に翻訳者で、または超えてブラックホールに向上させることができるでしょう。将来的には、その存在が新しいICMP拡張は、パケットが翻訳されていることを示し、送信元アドレスは、翻訳者に属していること、ない元ノードは、も考慮することができます。"
    },
    {
      "indent": 0,
      "text": "5. Stateless Address Mapping Algorithm",
      "section_title": true,
      "ja": "5.ステートレスアドレスのマッピングアルゴリズム"
    },
    {
      "indent": 3,
      "text": "If a pool of public IPv4 addresses is configured on the translator, it is RECOMMENDED to randomly select the IPv4 source address from the pool. Random selection reduces the probability that two ICMP messages elicited by the same TRACEROUTE might specify the same source address and, therefore, erroneously present the appearance of a routing loop.",
      "ja": "パブリックIPv4アドレスのプールは、翻訳者で構成されている場合は、ランダムプールからIPv4ソースアドレスを選択することをお勧めします。ランダム選択は、同じTRACEROUTEによって誘発される2つのICMPメッセージが同一の送信元アドレスを指定し、従って、誤ってルーティングループの外観を呈するかもしれない可能性を低減します。"
    },
    {
      "indent": 3,
      "text": "[RFC5837] extensions and an enhanced traceroute application, if used, will reveal the IPv6 source addresses that generated the original ICMPv6 messages.",
      "ja": "[RFC5837]の拡張機能と拡張トレースルート・アプリケーションは、使用される場合、元のICMPv6メッセージを生成したIPv6ソースアドレスを明らかにする。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document recommends the generation of IPv4 ICMP messages from IPv6 ICMP messages. These messages would otherwise have been discarded. New considerations are not expected to result from this change. As with a number of ICMP messages, a spoofed source address may result in replies arriving at hosts that did not expect them using the facility of the translator.",
      "ja": "この文書は、IPv6 ICMPメッセージからのIPv4 ICMPメッセージの生成を推奨しています。これらのメッセージは、そうでない場合は破棄されていたであろう。新しい考慮事項は、この変化から生じることが予想されていません。 ICMPメッセージの数と同じように、偽装された送信元アドレスは、トランスレータの機能を使用してそれらを期待していなかったホストに到着した回答になることがあります。"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgments",
      "section_title": true,
      "ja": "7.謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to acknowledge the following contributors of this document: Kevin Yin, Chris Metz, Neeraj Gupta, and Joel Jaeggli. The authors would also like to thank Ronald Bonica, Ray Hunter, George Wes, Yu Guanghui, Sowmini Varadhan, David Farmer, Fred Baker, Leo Vegoda, Joel Jaeggli, Henrik Levkowetz, Randy Bush, and Warren Kumari for their comments and suggestions.",
      "ja": "ケビン・殷、クリス・メッツ、Neerajグプタ、とジョエルJaeggli：著者は、本書の次の貢献者を承認したいと思います。著者はまた、彼らのコメントや提案のためにロナルドBonica、レイ・ハンター、ジョージ・ウェス、ゆう光輝、Sowmini Varadhan、デビッド・ファーマー、フレッド・ベイカー、レオVegoda、ジョエルJaeggli、ヘンリクLevkowetz、ランディブッシュ、とウォーレンクマリに感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8.参照文献"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "ja": "8.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC1918] Rekhter, Y., Moskowitz, R., Karrenberg, D., de Groot, G., and E. Lear, \"Address Allocation for Private Internets\", BCP 5, RFC 1918, February 1996.",
      "ja": "[RFC1918] Rekhter、Y.、モスコウィッツ、R.、Karrenberg、D.、グルート、G.、およびE.リアデ、 \"個人的なインターネットのための配分\"、BCP 5、RFC 1918、1996年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3704] Baker, F. and P. Savola, \"Ingress Filtering for Multihomed Networks\", BCP 84, RFC 3704, March 2004.",
      "ja": "[RFC3704]ベイカー、F.およびP. Savola、 \"マルチホームネットワークの入力フィルタリング\"、BCP 84、RFC 3704、2004年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC4443] Conta, A., Deering, S., and M. Gupta, Ed., \"Internet Control Message Protocol (ICMPv6) for the Internet Protocol Version 6 (IPv6) Specification\", RFC 4443, March 2006.",
      "ja": "[RFC4443]コンタ、A.、デアリング、S.、およびM.グプタ、エド。、 \"インターネット制御メッセージプロトコル（ICMPv6の）インターネットプロトコルバージョン6（IPv6）の仕様について\"、RFC 4443、2006年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC5837] Atlas, A., Ed., Bonica, R., Ed., Pignataro, C., Ed., Shen, N., and JR. Rivers, \"Extending ICMP for Interface and Next-Hop Identification\", RFC 5837, April 2010.",
      "ja": "[RFC5837]アトラス、A.編、Bonica、R.、編、Pignataro、C.、エド。、シェン、N.、およびJR。川は、RFC 5837、2010年4月「インターフェイスおよびネクストホップの識別のためのICMPの拡張します」。"
    },
    {
      "indent": 3,
      "text": "[RFC6052] Bao, C., Huitema, C., Bagnulo, M., Boucadair, M., and X. Li, \"IPv6 Addressing of IPv4/IPv6 Translators\", RFC 6052, October 2010.",
      "ja": "[RFC6052]バオ、C.、のHuitema、C.、Bagnulo、M.、Boucadair、M.、およびX.李、RFC 6052、2010年10月の \"IPv6は、IPv4 / IPv6の翻訳者のアドレス指定\"。"
    },
    {
      "indent": 3,
      "text": "[RFC6145] Li, X., Bao, C., and F. Baker, \"IP/ICMP Translation Algorithm\", RFC 6145, April 2011.",
      "ja": "[RFC6145]のLi、X.、バオ、C.、およびF.ベイカー、 \"IP / ICMP翻訳アルゴリズム\"、RFC 6145、2011年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC6598] Weil, J., Kuarsingh, V., Donley, C., Liljenstolpe, C., and M. Azinger, \"IANA-Reserved IPv4 Prefix for Shared Address Space\", BCP 153, RFC 6598, April 2012.",
      "ja": "[RFC6598]ワイル、J.、Kuarsingh、V.、Donley、C.、Liljenstolpe、C.、およびM. Azinger、 \"IANAリザーブIPv4のプレフィックス共有アドレススペースのための\"、BCP 153、RFC 6598、2012年4月。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "ja": "8.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[MTR] \"BitWizard B.V. - The Linux Experts\", <http://www.bitwizard.nl/mtr/>.",
      "ja": "[MTR] \"BitWizard B.V.社 -  Linuxの専門家\"、<http://www.bitwizard.nl/mtr/>。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Xing Li CERNET Center/Tsinghua University Room 225, Main Building, Tsinghua University Beijing 100084 China",
      "ja": "興李CERNETセンター/清華大学ルーム225、本館、清華大学、北京100084中国"
    },
    {
      "indent": 3,
      "text": "Phone: +86 10-62785983 EMail: xing@cernet.edu.cn",
      "ja": "電話：+86 10-62785983 Eメール：xing@cernet.edu.cn"
    },
    {
      "indent": 3,
      "text": "Congxiao Bao CERNET Center/Tsinghua University Room 225, Main Building, Tsinghua University Beijing 100084 China",
      "ja": "CongxiaoバオCERNETセンター/清華大学ルーム225、本館、清華大学、北京100084中国"
    },
    {
      "indent": 3,
      "text": "Phone: +86 10-62785983 EMail: congxiao@cernet.edu.cn",
      "ja": "電話：+86 10-62785983 Eメール：congxiao@cernet.edu.cn"
    },
    {
      "indent": 3,
      "text": "Dan Wing Cisco Systems, Inc. 170 West Tasman Drive San Jose, CA 95134 United States",
      "ja": "ダン・ウィングシスコシステムズ、株式会社170西タスマン・ドライブサンノゼ、CA 95134米国"
    },
    {
      "indent": 3,
      "text": "EMail: dwing@cisco.com",
      "ja": "メールアドレス：dwing@cisco.com"
    },
    {
      "indent": 3,
      "text": "Ramji Vaithianathan Cisco Systems, Inc. A 5-2, BGL 12-4, SEZ Unit, Cessna Business Park, Varthur Hobli Sarjapur Outer Ring Road Bangalore Karnataka 560 103 India",
      "ja": "ランジVaithianathanシスコシステムズ、株式会社5-2、BGL 12-4、SEZユニット、セスナビジネスパーク、Varthur Hobliサリヤプール外環状道路バンガロールカルナタカ州560 103インド"
    },
    {
      "indent": 3,
      "text": "Phone: +91 80 4426 0895 EMail: rvaithia@cisco.com",
      "ja": "電話：+91 80 4426 0895 Eメール：rvaithia@cisco.com"
    },
    {
      "indent": 3,
      "text": "Geoff Huston APNIC",
      "ja": "ジェフ・ヒューストンAPNIC"
    },
    {
      "indent": 3,
      "text": "EMail: gih@apnic.net",
      "ja": "メールアドレス：gih@apnic.net"
    }
  ]
}