{
  "title": {
    "text": "RFC 6630 - EAP Re-authentication Protocol Extensions for Authenticated Anticipatory Keying (ERP/AAK)",
    "ja": "RFC 6630 - 認証予期キーイングのためのEAP再認証プロトコルの拡張機能（ERP / AAK）"
  },
  "number": 6630,
  "created_at": "2019-10-28 13:26:19.597137+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                            Z. Cao\nRequest for Comments: 6630                                       H. Deng\nCategory: Standards Track                                   China Mobile\nISSN: 2070-1721                                                    Q. Wu\n                                                                  Huawei\n                                                            G. Zorn, Ed.\n                                                             Network Zen\n                                                               June 2012",
      "raw": true
    },
    {
      "indent": 12,
      "text": "   EAP Re-authentication Protocol Extensions\nfor Authenticated Anticipatory Keying (ERP/AAK)",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "The Extensible Authentication Protocol (EAP) is a generic framework supporting multiple types of authentication methods.",
      "ja": "拡張認証プロトコル（EAP）の認証方法の複数のタイプをサポートする汎用的なフレームワークです。"
    },
    {
      "indent": 3,
      "text": "The EAP Re-authentication Protocol (ERP) specifies extensions to EAP and the EAP keying hierarchy to support an EAP method-independent protocol for efficient re-authentication between the peer and an EAP re-authentication server through any authenticator.",
      "ja": "EAP再認証プロトコル（ERP）は、任意のオーセンティケータを介してピア及びEAP再認証サーバとの間の効率的な再認証のためのEAP方式に依存しないプロトコルをサポートするEAPとEAPキーイング階層への拡張を指定します。"
    },
    {
      "indent": 3,
      "text": "Authenticated Anticipatory Keying (AAK) is a method by which cryptographic keying material may be established upon one or more Candidate Attachment Points (CAPs) prior to handover. AAK uses the AAA infrastructure for key transport.",
      "ja": "認証された予期キーイング（AAK）は、暗号化キーイングマテリアルは、ハンドオーバ前に1以上の候補アタッチメントポイント（CAP）をもとに確立することができる方法です。 AAKは、キー輸送のためのAAAインフラストラクチャを使用しています。"
    },
    {
      "indent": 3,
      "text": "This document specifies the extensions necessary to enable AAK support in ERP.",
      "ja": "この文書では、ERPにAAKのサポートを可能にするために必要な拡張子を指定します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6630.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6630で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2012 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2012 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  3\n2.  Terminology  . . . . . . . . . . . . . . . . . . . . . . . . .  3\n  2.1.  Requirements Language  . . . . . . . . . . . . . . . . . .  3\n  2.2.  Acronyms . . . . . . . . . . . . . . . . . . . . . . . . .  3\n3.  ERP/AAK Description  . . . . . . . . . . . . . . . . . . . . .  4\n4.  ERP/AAK Key Hierarchy  . . . . . . . . . . . . . . . . . . . .  7\n  4.1.  Derivation of the pRK and pMSK . . . . . . . . . . . . . .  8\n5.  Packet and TLV Extension . . . . . . . . . . . . . . . . . . .  9\n  5.1.  EAP-Initiate/Re-auth-Start Packet and TLV Extension  . . .  9\n  5.2.  EAP-Initiate/Re-auth Packet and TLV Extension  . . . . . . 10\n  5.3.  EAP-Finish/Re-auth Packet and TLV Extension  . . . . . . . 12\n  5.4.  TV and TLV Attributes  . . . . . . . . . . . . . . . . . . 14\n6.  Lower-Layer Considerations . . . . . . . . . . . . . . . . . . 15\n7.  AAA Transport Considerations . . . . . . . . . . . . . . . . . 15\n8.  Security Considerations  . . . . . . . . . . . . . . . . . . . 15\n9.  IANA Considerations  . . . . . . . . . . . . . . . . . . . . . 16\n10. Acknowledgements . . . . . . . . . . . . . . . . . . . . . . . 18\n11. References . . . . . . . . . . . . . . . . . . . . . . . . . . 18\n  11.1. Normative References . . . . . . . . . . . . . . . . . . . 18\n  11.2. Informative References . . . . . . . . . . . . . . . . . . 19",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "The Extensible Authentication Protocol (EAP) [RFC3748] is a generic framework supporting multiple types of authentication methods. In systems where EAP is used for authentication, it is desirable not to repeat the entire EAP exchange with another authenticator. The EAP Re-authentication Protocol (ERP) [RFC5296] specifies extensions to EAP and the EAP keying hierarchy to support an EAP method-independent protocol for efficient re-authentication between the EAP re-authentication peer and an EAP re-authentication server through any authenticator. The re-authentication server may be in the home network or in the local network to which the mobile host (i.e., the EAP re-authentication peer) is connecting.",
      "ja": "拡張認証プロトコル（EAP）[RFC3748]は認証方法の複数のタイプをサポートする汎用的なフレームワークです。 EAPは認証のために使用されるシステムでは、別のオーセンティケータとの全体のEAP交換を繰り返すことがないことが望ましいです。 EAP再認証プロトコル（ERP）[RFC5296]はいずれかを介してEAP再認証ピア及びEAP再認証サーバとの間の効率的な再認証のためのEAP方式に依存しないプロトコルをサポートするEAPとEAPキーイング階層への拡張を指定しますオーセンティケータ。再認証サーバは、モバイルホスト（即ち、EAP再認証ピア）が接続されたホームネットワークまたはローカルネットワークであってもよいです。"
    },
    {
      "indent": 3,
      "text": "Authenticated Anticipatory Keying (AAK) [RFC5836] is a method by which cryptographic keying material may be established upon one or more Candidate Attachment Points (CAPs) prior to handover. AAK utilizes the AAA infrastructure for key transport.",
      "ja": "認証された予期キーイング（AAK）[RFC5836]は暗号化キーイングマテリアルは、ハンドオーバ前に1以上の候補アタッチメントポイント（CAP）をもとに確立することができる方法です。 AAKは、キー輸送のためのAAAインフラストラクチャを利用しています。"
    },
    {
      "indent": 3,
      "text": "This document specifies the extensions necessary to enable AAK support in ERP.",
      "ja": "この文書では、ERPにAAKのサポートを可能にするために必要な拡張子を指定します。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "ja": "2.用語"
    },
    {
      "indent": 0,
      "text": "2.1. Requirements Language",
      "section_title": true,
      "ja": "2.1。要件言語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2.2. Acronyms",
      "section_title": true,
      "ja": "2.2。略語"
    },
    {
      "indent": 3,
      "text": "The following acronyms are used in this document; see the references for more details.",
      "ja": "以下の頭字語は、本書で使用されています。詳細は、参考文献を参照してください。"
    },
    {
      "indent": 3,
      "text": "AAA Authentication, Authorization, and Accounting [RFC3588]",
      "ja": "AAA認証、許可、アカウンティング[RFC3588]"
    },
    {
      "indent": 3,
      "text": "CAP Candidate Attachment Point [RFC5836]",
      "ja": "CAP候補アタッチメントポイント[RFC5836]"
    },
    {
      "indent": 3,
      "text": "DSRK Domain-Specific Root Key [RFC5295]",
      "ja": "DARKドメイン固有ルートキー[RFC 5295]"
    },
    {
      "indent": 3,
      "text": "EA Abbreviation for \"ERP/AAK\"",
      "ja": "\"ERP / AAK\" のためのEAの略"
    },
    {
      "indent": 3,
      "text": "EA Peer An EAP peer that supports the ERP/AAK. Note that all references to \"peer\" in this document imply an EA peer, unless specifically noted otherwise.",
      "ja": "EAは、ERP / AAKをサポートEAPピアをピア。具体的には、特に断りのない限り、本書では「ピア」へのすべての参照は、EAピアを意味することに留意されたいです。"
    },
    {
      "indent": 3,
      "text": "NAI Network Access Identifier [RFC4282]",
      "ja": "NAIネットワークアクセス識別子[RFC4282]"
    },
    {
      "indent": 3,
      "text": "pMSK pre-established Master Session Key",
      "ja": "pMSK事前に確立マスターセッションキー"
    },
    {
      "indent": 3,
      "text": "pRK pre-established Root Key",
      "ja": "pRK事前に確立されたルートキー"
    },
    {
      "indent": 3,
      "text": "rIK re-authentication Integrity Key [RFC5296]",
      "ja": "RIK再認証完全性キー[RFC5296]"
    },
    {
      "indent": 3,
      "text": "rRK re-authentication Root Key [RFC5296]",
      "ja": "RRK再認証ルートキー[RFC5296]"
    },
    {
      "indent": 3,
      "text": "SAP Serving Attachment Point [RFC5836]",
      "ja": "SAPサービングアタッチメントポイント[RFC5836]"
    },
    {
      "indent": 0,
      "text": "3. ERP/AAK Description",
      "section_title": true,
      "ja": "3. ERP / AAK説明"
    },
    {
      "indent": 3,
      "text": "ERP/AAK is intended to allow (upon request by the peer) the establishment of cryptographic keying materials on a single Candidate Attachment Point prior to the arrival of the peer at the Candidate Access Network (CAN).",
      "ja": "ERP / AAK前候補アクセス・ネットワーク（CAN）のピアの到着に単一候補アタッチメントポイントに（ピアによって要求に応じて）暗号キーイング材料の確立を可能にするように意図されています。"
    },
    {
      "indent": 3,
      "text": "In this document, ERP/AAK support by the peer is assumed. Also, it is assumed that the peer has previously completed full EAP authentication and that either the peer or the SAP knows the identities of neighboring attachment points. Note that the behavior of a peer that does not support the ERP-AAK scheme defined in this specification is out of the scope of this document. Figure 1 shows the general protocol exchange by which the keying material is established on the CAP.",
      "ja": "この文書では、ピアによってERP / AAKサポートが想定されます。また、相手が前に完全なEAP認証を完了し、いずれかのピアまたはSAPが隣接接続点のアイデンティティを知っているとしているものとします。この仕様で定義されたERP-AAKスキームをサポートしていない相手の行動がこの文書の範囲外であることに注意してください。図1は、キーイング材料をキャップ上に確立される一般的なプロトコル交換を示します。"
    },
    {
      "indent": 5,
      "text": "+------+         +-----+        +-----+          +-----------+\n| Peer |         | SAP |        | CAP |          | EA Server |\n+--+---+         +--+--+        +--+--+          +-----+-----+\n   |                |              |                   |\na. | [EAP-Initiate/ |              |                   |\n   | Re-auth-start  |              |                   |\n   | (E flag)]      |              |                   |\n   |<---------------|              |                   |\n   |                |              |                   |\nb. | EAP-Initiate/  |              |                   |\n   | Re-auth        |              |                   |\n   | (E flag)       |              |                   |\n   |--------------->|              |                   |\nc. |                | AAA(EAP-Initiate/Re-auth(E flag))|\n   |                |--------------------------------->|\n   |                |              |         +---------+---------+\n   |                |              |         | CA authorized &   |\nd. |                |              |         |  and EA Keying    |\n   |                |              |         |   Distribution    |\n   |                |              |         +---------+---------+\n   |                |              |                   |\n   |                |              |                   |\nf. |                | AAA (EAP-Finish/Re-auth(E flag)) |\n   |                |<---------------------------------|\ng. | EAP-Finish/    |              |                   |\n   | Re-auth(E flag)|              |                   |\n   |<---------------|              |                   |\n   |                |              |                   |",
      "raw": true
    },
    {
      "indent": 24,
      "text": "Figure 1: ERP/AAK Exchange",
      "ja": "図1：ERP / AAK交換"
    },
    {
      "indent": 18,
      "text": "+-----------+               +---------+\n|           |               |         |\n| EA Server |               |   CAP   |\n|           |               |         |\n+-----|-----+               +----|----+\n      |                          |\n      |                          |\n      |    AAA Request (pMSK)    |\n   e.1|------------------------->|\n      |                          |\n      |                          |\n      |                          |\n      |  AAA Response (Success)  |\n   e.2|<-------------------------|\n      |                          |\n      |                          |\n      |                          |",
      "raw": true
    },
    {
      "indent": 18,
      "text": "Figure 2: Key Distribution for ERP/AAK",
      "ja": "図II：erapaための鍵配布/ AS"
    },
    {
      "indent": 3,
      "text": "ERP/AAK reuses the packet format defined by ERP, but specifies a new flag to differentiate EAP early authentication from EAP re-authentication. The peer initiates ERP/AAK without an external trigger, or initiates ERP/AAK in response to an EAP-Initiate/ Re-Auth-Start message from the SAP.",
      "ja": "ERP / AAKは、ERPで定義されたパケットフォーマットを再利用しますが、EAPの再認証からEAP早期認証を区別するために新しいフラグを指定します。ピアは、外部トリガーなしERP / AAKを開始する、またはSAPからのEAP-開始/再認証スタートメッセージに応答して、ERP / AAKを開始します。"
    },
    {
      "indent": 3,
      "text": "In the latter case, the SAP MAY send the identity of one or more Candidate Attachment Points to which the SAP is adjacent to the peer in the EAP-Initiate/Re-auth-Start message (see step a in Figure 1). The peer SHOULD override the identity of CAP(s) carried in the EAP-Initiate/Re-auth-Start message by sending EAP-Initiate/Re-auth with the E flag set if it knows to which CAP it will move. If the EAP-Initiate/Re-auth-Start packet is not supported by the peer, it MUST be silently discarded.",
      "ja": "後者の場合、SAPは、SAPは、EAP-開始/再AUTH-Startメッセージ（図1の工程Aを参照）内のピアに隣接した1以上の候補アタッチメントポイントのアイデンティティを送信することができます。ピアはEAP-開始/再認証、それが移動するキャップにこれを知っている場合に設定Eフラグで送信することによって、EAP-開始/再認証開始メッセージで運ばCAP（複数可）のアイデンティティをオーバーライドする必要があります。 EAP-開始/再-AUTH-Startパケットがピアによってサポートされていない場合、それは静かに捨てなければなりません。"
    },
    {
      "indent": 3,
      "text": "If the peer initiates ERP/AAK, the peer MAY send an early-authentication request message (EAP-Initiate/Re-auth with the E flag set) containing the keyName-NAI, the CAP-Identifier, rIK, and sequence number (see step b in Figure 1). The realm in the keyName-NAI field is used to locate the peer's ERP/AAK server. The CAP-Identifier is used to identify the CAP. The re-authentication Integrity Key (rIK) is defined by Narayanan & Dondeti in [RFC5296] and is used to protect the integrity of the message. The sequence number is used for replay protection.",
      "ja": "ピアがERP / AAKを開始する場合、ピアは初期認証要求メッセージを送信してもよい（EAPは、開始/ Eフラグが設定された-AUTH RE）keyNameの-NAI、CAP-識別子、RIK、およびシーケンス番号を含む（参照図1のステップb）。 keyNameの-NAIフィールド内のレルムは、ピアのERP / AAKサーバーを見つけるために使用されます。 CAP-識別子はCAPを識別するために使用されます。再認証インテグリティキー（RIK）は[RFC5296]にナラヤナン＆Dondetiによって定義され、メッセージの完全性を保護するために使用されます。シーケンス番号は、リプレイ保護のために使用されています。"
    },
    {
      "indent": 3,
      "text": "The SAP SHOULD verify the integrity of this message at step b. If this verification fails, the SAP MUST send an EAP-Finish/Re-auth message with the Result flag set to '1' (Failure). If the verification succeeds, the SAP SHOULD encapsulate the early-authentication message into a AAA message and send it to the peer's ERP/AAK server in the realm indicated in the keyName-NAI field (see step c in Figure 1).",
      "ja": "SAPは、ステップbで、このメッセージの整合性を確認する必要があります。この検証が失敗した場合、SAPは「1」（失敗）に設定結果フラグとEAP-仕上げ/再認証メッセージを送らなければなりません。検証が成功した場合、SAPはAAAメッセージに初期認証メッセージをカプセル化し、領域内のピアのERP / AAKサーバに送信すべきである（図1のステップcを参照のこと）のkeyName-NAIフィールドで示さ。"
    },
    {
      "indent": 3,
      "text": "Upon receiving the message, the ERP/AAK server MUST first use the keyName indicated in the keyName-NAI to look up the rIK and check the integrity and freshness of the message. Then, the ERP/AAK server MUST verify the identity of the peer by checking the username portion of the KeyName-NAI. If any of the checks fail, the server MUST send an early-authentication finish message (EAP-Finish/Re-auth with E flag set) with the Result flag set to '1'. Next, the server MUST authorize the CAP specified in the CAP-Identifier TLV. In the success case, the server MUST derive a pMSK from the pRK for the CAP carried in the CAP-Identifier field using the sequence number associated with CAP-Identifier as an input to the key derivation. (see step d in Figure 1).",
      "ja": "メッセージを受信すると、ERP / AAKサーバは、最初のkeyNameを使用しなければならないRIKを検索し、メッセージの整合性と新鮮さをチェックするためのkeyName-NAIに示されています。その後、ERP / AAKサーバーがKEYNAME-NAIのユーザ名部分をチェックして、ピアの身元を確かめなければなりません。いずれかのチェックが失敗した場合、サーバは「1」に設定結果フラグと（Eフラグを設定してEAP-仕上げ/再認証）は、初期認証終了メッセージを送らなければなりません。次に、サーバは、CAP-識別子TLVで指定されたCAPを承認しなければなりません。成功の場合、サーバは、鍵導出への入力としてCAP-識別子に関連付けられたシーケンス番号を使用してCAP-Identifierフィールドで運ばCAPのためのpRKからpMSKを導出しなければなりません。 （図1のステップdを参照）。"
    },
    {
      "indent": 3,
      "text": "Then, the ERP/AAK server MUST transport the pMSK to the authorized CAP via AAA (see Section 7) as illustrated above (see steps e.1 and e.2 in Figure 2). Note that key distribution in Figure 2 is one part of step d in Figure 1.",
      "ja": "その後、ERP / AAKサーバは、AAA（セクション7参照）（図2のステップE.1及びE.2を参照）上に示したよう介し許可CAPにpMSKを輸送しなければなりません。図2の鍵配布は、図1のステップDの一部であることに留意されたいです。"
    },
    {
      "indent": 3,
      "text": "Finally, in response to the EAP-Initiate/Re-auth message, the ERP/AAK server SHOULD send the early-authentication finish message (EAP-- -Finish/Re-auth with E flag set) containing the identity of the authorized CAP to the peer via the SAP along with the lifetime of the pMSK. If the peer also requests the rRK Lifetime, the ERP/AAK server SHOULD send the rRK Lifetime in the EAP-Finish/Re-auth message (see steps f and g in Figure 1).",
      "ja": "最後に、EAP-開始/再認証メッセージに応答して、ERP / AAKサーバは、許可CAPのアイデンティティを含む（EフラグがセットされたEAP-- -Finish /再AUTH）初期認証終了メッセージを送りますpMSKの寿命と一緒にSAPを経由してピアに。ピアはまた、RRKの寿命を要求する場合、ERP / AAKサーバ（図1のFおよびGの手順を参照）EAP-仕上げ/再認証メッセージでRRK寿命を送信すべきです。"
    },
    {
      "indent": 0,
      "text": "4. ERP/AAK Key Hierarchy",
      "section_title": true,
      "ja": "4. ERP / AACキー階層"
    },
    {
      "indent": 3,
      "text": "ERP/AAK uses a key hierarchy similar to that of ERP. The ERP/AAK pre-established Root Key (pRK) is derived from either the EMSK or the DSRK as specified below (see Section 4.1). In general, the pRK is derived from the EMSK if the peer is located in the home AAA realm and derived from the DSRK if the peer is in a visited realm. The DSRK is delivered from the EAP server to the ERP/AAK server as specified in [KEYTRAN]. If the peer has previously been authenticated by means of ERP or ERP/AAK, the DSRK SHOULD be directly reused.",
      "ja": "ERP / AAKは、ERPのと同様のキー階層を使用しています。以下に指定されるようにERP / AAK予め確立されたルートキー（のpRK）は（セクション4.1を参照）EMSK又はDSRKのいずれかから誘導されます。ピアがホームAAAレルムに位置し、ピアが訪れた領域にある場合DSRK由来する場合、一般的に、のpRKはEMSKから導出されます。 【KEYTRAN]で指定されるようDSRKは、ERP / AAKサーバにEAPサーバから配信されています。ピアが以前にERPまたはERP / AAKの手段により認証された場合、DSRK直接再利用されるべきです。"
    },
    {
      "indent": 29,
      "text": "    DSRK    EMSK\n     |       |\n +---+---+---+---+\n |\npRK            ...",
      "raw": true
    },
    {
      "indent": 19,
      "text": "Figure 3: ERP/AAK Root Key Derivation",
      "ja": "図3：ERP / AAKルートキー導出"
    },
    {
      "indent": 3,
      "text": "Similarly, the pre-established Master Session Key (pMSK) is derived from the pRK. The pMSK is established for the CAP when the peer early authenticates to the network. The hierarchy relationship is illustrated Figure 4, below.",
      "ja": "同様に、事前に確立されたマスターセッションキー（pMSKは）のpRKから誘導されます。ピアが早期にネットワークに認証するときpMSKは、CAPのために確立されています。階層関係は、以下、図4に示されています。"
    },
    {
      "indent": 28,
      "text": "        pRK\n         |\n+--------+--------+\n|\npMSK             ...",
      "raw": true
    },
    {
      "indent": 22,
      "text": "Figure 4: ERP/AAK Key Hierarchy",
      "ja": "図4：ERP / AACキー階層"
    },
    {
      "indent": 0,
      "text": "4.1. Derivation of the pRK and pMSK",
      "section_title": true,
      "ja": "4.1。公園とpMSKの導出"
    },
    {
      "indent": 3,
      "text": "The rRK is derived as specified in [RFC5295].",
      "ja": "[RFC5295]で指定されるようにRRKが導出されます。"
    },
    {
      "indent": 3,
      "text": "pRK = KDF (K, S), where",
      "ja": "pRK = KDF（K、S）、"
    },
    {
      "indent": 6,
      "text": "K = EMSK or K = DSRK and",
      "ja": "KIM KまたはK =暗く"
    },
    {
      "indent": 6,
      "text": "S = pRK Label | \"\\0\" | length",
      "ja": "S =のpRKラベル| \"\\ 0\" |長さ"
    },
    {
      "indent": 3,
      "text": "The pRK Label is an IANA-assigned 8-bit ASCII string:",
      "ja": "pRKラベルは、IANAによって割り当てられた8ビットのASCII文字列です。"
    },
    {
      "indent": 6,
      "text": "EAP Early-Authentication Root Key@ietf.org",
      "ja": "EAP-初期認証ルートKey@ietf.org"
    },
    {
      "indent": 3,
      "text": "assigned from the \"User Specific Root Keys (USRK) Key Labels\" name space in accordance with Salowey, et al. [RFC5295]. The KDF and algorithm agility for the KDF are also defined in RFC 5295. The KDF algorithm is indicated in the cryptosuite field or list of cryptosuites TLV payload as specified in Sections 5.2 and 5.3.",
      "ja": "「ユーザー固有のルートキー（USRK）キーラベル」Saloweyらに従い、名前空間から割り当てられます。 [RFC5295]。 KDFのためにKDFアルゴリズムアジリティも、セクション5.2および5.3に指定されているKDFアルゴリズムはcryptosuiteフィールドまたはcryptosuites TLVペイロードのリストに示されているRFC 5295.に定義されています。"
    },
    {
      "indent": 3,
      "text": "The pMSK uses the same KDF as pRK and is derived as follows:",
      "ja": "pMSKはのpRKと同じKDFを使用し、次のように導出されています。"
    },
    {
      "indent": 3,
      "text": "pMSK = KDF (K, S), where",
      "ja": "pMSK = KDF（K、S）、"
    },
    {
      "indent": 6,
      "text": "K = pRK and",
      "ja": "K =のpRKと"
    },
    {
      "indent": 6,
      "text": "S = pMSK label | \"\\0\" | SEQ | length",
      "ja": "S = pMSKラベル| \"\\ 0\" | SEQ |長さ"
    },
    {
      "indent": 3,
      "text": "The pMSK label is the 8-bit ASCII string:",
      "ja": "pMSKラベルは8ビットのASCII文字列です。"
    },
    {
      "indent": 6,
      "text": "EAP Early-Authentication Master Session Key@ietf.org",
      "ja": "EAP-初期認証マスターセッションKey@ietf.org"
    },
    {
      "indent": 3,
      "text": "The length field refers to the length of the pMSK in octets encoded as specified in RFC 5295. SEQ is sent by either the peer or the server in the ERP/AAK message using the SEQ field or the Sequence number TLV. It is encoded as a 16-bit number as specified in Sections 5.2 and 5.3.",
      "ja": "長さフィールドは、RFC 5295.配列で指定されるように符号化されたオクテットでpMSKの長さを意味するピアまたはSEQフィールドを使用して、ERP / AAKメッセージまたは配列番号TLVにおけるサーバのいずれかによって送信されます。これは、セクション5.2および5.3に指定された16ビット数として符号化されます。"
    },
    {
      "indent": 0,
      "text": "5. Packet and TLV Extension",
      "section_title": true,
      "ja": "5.パケット及びTLVの拡張"
    },
    {
      "indent": 3,
      "text": "This section describes the packet and TLV extensions for the ERP/AAK exchange.",
      "ja": "このセクションでは、ERP / AAK交換のためのパケットとTLVの拡張機能について説明します。"
    },
    {
      "indent": 0,
      "text": "5.1. EAP-Initiate/Re-auth-Start Packet and TLV Extension",
      "section_title": true,
      "ja": "5.1。 EAP-開始/再認証スタートパケット及びTLV拡張"
    },
    {
      "indent": 3,
      "text": "Figure 5 shows the new parameters contained in the EAP-Initiate/ Re-auth-Start packet defined in [RFC5296].",
      "ja": "図5は、[RFC5296]で定義されたEAP-開始/再認証スタートパケットに含まれる新しいパラメータを示しています。"
    },
    {
      "indent": 5,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Code      |  Identifier   |            Length             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Type      |E| Reserved    |     1 or more TVs or TLVs     ~\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 14,
      "text": "Figure 5: EAP-Initiate/Re-auth-Start Extension",
      "ja": "図5：EAP-開始/再認証スタート拡張"
    },
    {
      "indent": 3,
      "text": "Flags",
      "ja": "国旗"
    },
    {
      "indent": 3,
      "text": "'E' - The E flag is used to indicate early authentication. This field MUST be set to '1' if early authentication is in use, and it MUST be set to '0' otherwise.",
      "ja": "「E」 -  Eフラグが早期に認証を示すために使用されます。初期の認証が使用されている、そしてそれはそれ以外の場合は「0」に設定しなければならない場合、このフィールドは「1」に設定しなければなりません。"
    },
    {
      "indent": 3,
      "text": "The rest of the 7 bits (Reserved) MUST be set to 0 and ignored on reception.",
      "ja": "7ビット（リザーブ）の残りは0に設定され、受信時には無視されなければなりません。"
    },
    {
      "indent": 3,
      "text": "Type/Values (TVs) and TLVs",
      "ja": "タイプ/値（テレビ）とのTLV"
    },
    {
      "indent": 3,
      "text": "CAP-Identifier: Carried in a TLV payload. The format is identical to that of a DiameterIdentity [RFC3588]. It is used by the SAP to advertise the identity of the CAP to the peer. Exactly one CAP-Identifier TLV MAY be included in the EAP-Initiate/Re-auth-Start packet if the SAP has performed CAP discovery.",
      "ja": "CAP-識別子：TLVペイロードで運ばれます。フォーマットはDiameterIdentityに[RFC3588]のものと同一です。ピアへのCAPの身元を宣伝するためにSAPによって使用されます。正確に一つのCAP-識別子TLVはEAP-開始/再-AUTH-StartパケットSAPは、CAPの検出を行った場合に含まれるかもしれません。"
    },
    {
      "indent": 3,
      "text": "If the EAP-Initiate/Re-auth-Start packet is not supported by the peer, it SHOULD be discarded silently.",
      "ja": "EAP-開始/再-AUTH-Startパケットがピアによってサポートされていない場合、それは静かに捨てられるべきです。"
    },
    {
      "indent": 0,
      "text": "5.2. EAP-Initiate/Re-auth Packet and TLV Extension",
      "section_title": true,
      "ja": "5.2。 EAP-開始/再認証パケット及びTLV拡張"
    },
    {
      "indent": 3,
      "text": "Figure 6 illustrates the new parameters contained in the EAP-Initiate/Re-auth packet defined in [RFC5296].",
      "ja": "図6は、[RFC5296]で定義されたEAP-開始/再認証パケットに含まれる新しいパラメータを示します。"
    },
    {
      "indent": 5,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Code      |  Identifier   |            Length             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Type      |R|x|L|E|Resved |             SEQ               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                 1 or more TVs or TLVs                         ~\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n| Cryptosuite  |         Authentication Tag                     ~\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 17,
      "text": "Figure 6: EAP-Initiate/Re-auth Extension",
      "ja": "図6：EAP-開始/再認証拡張"
    },
    {
      "indent": 3,
      "text": "Flags",
      "ja": "国旗"
    },
    {
      "indent": 3,
      "text": "'x' - The x flag is reserved. It MUST be ignored on receipt.",
      "ja": "「X」 -  Xフラグが予約されています。これは、領収書で無視しなければなりません。"
    },
    {
      "indent": 3,
      "text": "'L' - As defined in Section 5.3.2 of [RFC5296], this bit is used to request the key lifetimes from the server.",
      "ja": "「L」 -  [RFC5296]のセクション5.3.2で定義されたように、このビットは、サーバからのキー寿命を要求するために使用されます。"
    },
    {
      "indent": 3,
      "text": "'E' - The E flag is used to indicate early authentication.",
      "ja": "「E」 -  Eフラグが早期に認証を示すために使用されます。"
    },
    {
      "indent": 3,
      "text": "The first bit(R) and final 4 bits (Resved) MUST be set to 0 and ignored on reception.",
      "ja": "最初のビット（R）および最終4ビット（Resved）を0に設定し、受信時には無視されなければなりません。"
    },
    {
      "indent": 3,
      "text": "SEQ",
      "ja": "SEQ"
    },
    {
      "indent": 3,
      "text": "As defined in Section 5.3.2 of [RFC5296], this field is 16-bit sequence number and used for replay protection.",
      "ja": "[RFC5296]のセクション5.3.2で定義されているように、このフィールドは、16ビットのシーケンス番号であり、リプレイ保護のために使用されます。"
    },
    {
      "indent": 3,
      "text": "TVs and TLVs",
      "ja": "テレビとのTLV"
    },
    {
      "indent": 3,
      "text": "keyName-NAI: As defined in [RFC5296], this is carried in a TLV payload. The Type is 1. The NAI is variable in length, not exceeding 253 octets. The username part of the NAI is the EMSKname used to identify the peer. The realm part of the NAI is the peer's home domain name if the peer communicates with the home EA server or the domain to which the peer is currently attached (i.e., local domain name) if the peer communicates with a local EA server. The",
      "ja": "keyNameの-NAI [RFC5296]で定義されるように、これはTLVペイロードで運ばれます。タイプは1 NAIである253個のオクテットを超えない、長さが可変です。 NAIのユーザ名部分は、ピアを識別するために使用さEMSKnameあります。ピアはローカルEAサーバと通信する場合、ピアは、ホームEAサーバまたはピアが現在接続されたドメイン（すなわち、ローカルドメイン名）と通信する場合NAIのレルム部分は、ピアのホームドメイン名です。ザ・"
    },
    {
      "indent": 3,
      "text": "SAP knows whether the KeyName-NAI carries the local domain name by comparing the domain name carried in the KeyName-NAI with the local domain name that is associated with the SAP. Exactly one keyName-NAI attribute SHALL be present in an EAP-Initiate/Re-auth packet and the realm part of it SHOULD follow the use of internationalized domain names defined in [RFC5890].",
      "ja": "SAPはKEYNAME-NAIがSAPに関連付けられているローカルドメイン名とキー名-NAIで運ばれたドメイン名を比較することによって、ローカルドメイン名を運ぶかどうかを知っています。正確に一つのkeyName-NAI属性は、EAP-開始/再認証パケット内に存在しなければならないとのレルム部分は、[RFC5890]で定義された国際化ドメイン名の使用に従うべきです。"
    },
    {
      "indent": 3,
      "text": "CAP-Identifier: Carried in a TLV payload. The Type is 11. This field is used to indicate the Fully Qualified Domain Name (FQDN) of a CAP. The value field MUST be encoded as specified in Section 8 of [RFC3315]. Exactly one instance of the CAP-Identifier TLV MUST be present in the ERP/AAK-Key TLV.",
      "ja": "CAP-識別子：TLVペイロードで運ばれます。タイプこのフィールドは、CAPの完全修飾ドメイン名（FQDN）を示すために使用される11です。 [RFC3315]のセクション8で指定された値のフィールドは、符号化されなければなりません。正確CAP-識別子TLVの1つのインスタンスは、ERP / AAKキーTLVに存在しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Sequence number: The Type is 7. The value field is a 16-bit field and used in the derivation of the pMSK for a CAP.",
      "ja": "配列番号：値フィールドは16ビットフィールドであり、CAPのためpMSKの導出に使用7.です。"
    },
    {
      "indent": 3,
      "text": "Cryptosuite",
      "ja": "Cryptosuite"
    },
    {
      "indent": 3,
      "text": "This field indicates the integrity algorithm used for ERP/AAK. Key lengths and output lengths are either indicated or obvious from the cryptosuite name, e.g., HMAC-SHA256-128 denotes Hashed Message Authentication Code (HMAC) computed using the SHA-256 function [RFC4868] with 256-bit key length and the output truncated to 128 bits [RFC2104]. We specify some cryptosuites below:",
      "ja": "このフィールドは、ERP / AAKに使用する整合性アルゴリズムを示しています。鍵長と出力長がいずれか、例えば、cryptosuite名から指示または明らかであり、HMAC-SHA256-128を表すハッシュメッセージ認証コード（HMAC）は、256ビットの鍵長とSHA-256機能[RFC4868]を用いて計算され、出力は切り捨て128ビット[RFC2104]に。私たちは、以下のいくつかのcryptosuitesを指定します。"
    },
    {
      "indent": 3,
      "text": "0-1 RESERVED",
      "ja": "0-1 RESERVED"
    },
    {
      "indent": 3,
      "text": "2 HMAC-SHA256-128",
      "ja": "2 HMAC-SHA256-128"
    },
    {
      "indent": 3,
      "text": "3 HMAC-SHA256-256",
      "ja": "3 HMAC-SHA256-256"
    },
    {
      "indent": 3,
      "text": "HMAC-SHA256-128 is REQUIRED to implement, and it SHOULD be enabled in the default configuration.",
      "ja": "HMAC-SHA256-128を実装する必要があり、それはデフォルトの設定で有効にする必要があります。"
    },
    {
      "indent": 3,
      "text": "Authentication Tag",
      "ja": "認証タグ"
    },
    {
      "indent": 3,
      "text": "This field contains an integrity checksum over the ERP/AAK packet from the first bit of the Code field to the last bit of the Cryptosuite field, excluding the Authentication Tag field itself. The value field is calculated using the integrity algorithm indicated in the Cryptosuite field and rIK specified in [RFC5296] as the secret key. The length of the field is indicated by the Cryptosuite.",
      "ja": "このフィールドは、認証タグフィールド自体を除く、Cryptosuiteフィールドの最後のビットへのコード・フィールドの最初のビットからERP / AAKパケット以上の整合性チェックサムが含まれています。値フィールドはCryptosuiteフィールドに示されている完全性アルゴリズムを使用して計算され、RIKは秘密鍵として[RFC5296]で指定されています。フィールドの長さはCryptosuiteで示されています。"
    },
    {
      "indent": 3,
      "text": "The peer uses the Authentication Tag to determine the validity of the EAP-Finish/Re-auth message from the server.",
      "ja": "ピアは、サーバからのEAP-仕上げ/再認証メッセージの有効性を決定するために、認証タグを使用します。"
    },
    {
      "indent": 3,
      "text": "If the message doesn't pass verification or the Authentication Tag is not included in the message, the message SHOULD be discarded silently.",
      "ja": "メッセージが検証に合格しないか、認証タグがメッセージに含まれていない場合、メッセージは静かに捨てられるべきです。"
    },
    {
      "indent": 3,
      "text": "If the EAP-Initiate/Re-auth packet is not supported by the SAP, it SHOULD be discarded silently. The peer MUST maintain retransmission timers for reliable transport of the EAP-Initiate/Re-auth message. If there is no response to the EAP-Initiate/Re-auth message from the server after the necessary number of retransmissions (see Section 6), the peer MUST assume that ERP/AAK is not supported by the SAP.",
      "ja": "EAP-開始/再認証パケットがSAPによってサポートされていない場合、それは静かに捨てられるべきです。ピアはEAP-開始/再認証メッセージの信頼性の高い輸送の再送タイマーを維持しなければなりません。再送の必要数（セクション6を参照）の後、サーバからEAP-開始/再認証メッセージに対する応答がない場合、ピアは、ERPは、/ AAKは、SAPによってサポートされていないと仮定しなければなりません。"
    },
    {
      "indent": 0,
      "text": "5.3. EAP-Finish/Re-auth Packet and TLV Extension",
      "section_title": true,
      "ja": "5.3。 EAP-仕上げ/再認証パケット及びTLV拡張"
    },
    {
      "indent": 3,
      "text": "Figure 7 shows the new parameters contained in the EAP-Finish/Re-auth packet defined in [RFC5296].",
      "ja": "図7は、[RFC5296]で定義されたEAP-仕上げ/再認証パケットに含まれる新しいパラメータを示しています。"
    },
    {
      "indent": 5,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Code      |  Identifier   |            Length             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Type      |R|x|L|E|Resved |             SEQ               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                 1 or more TVs or TLVs                         ~\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n| Cryptosuite  |         Authentication Tag                     ~\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 18,
      "text": "Figure 7: EAP-Finish/Re-auth Extension",
      "ja": "図7：EAP-仕上げ/再認証拡張"
    },
    {
      "indent": 3,
      "text": "Flags",
      "ja": "国旗"
    },
    {
      "indent": 3,
      "text": "'R' - As defined in Section 5.3.3 of [RFC5296], this bit is used as the Result flag. This field MUST be set to '1' to indicate success, and it MUST be set to '0' otherwise.",
      "ja": "「R」が -  [RFC5296]のセクション5.3.3で定義されるように、このビットは結果フラグとして使用されます。このフィールドは、成功を示すために「1」に設定しなければならなくて、それはそれ以外の場合は「0」に設定しなければなりません。"
    },
    {
      "indent": 3,
      "text": "'x' - The x flag is reserved. It MUST be ignored on receipt.",
      "ja": "「X」 -  Xフラグが予約されています。これは、領収書で無視しなければなりません。"
    },
    {
      "indent": 3,
      "text": "'L' - As defined in Section 5.3.3 of [RFC5296], this bit is used to request the key lifetimes from the server.",
      "ja": "「L」 -  [RFC5296]のセクション5.3.3で定義されたように、このビットは、サーバからのキー寿命を要求するために使用されます。"
    },
    {
      "indent": 3,
      "text": "'E' - The E flag is used to indicate early authentication.",
      "ja": "「E」 -  Eフラグが早期に認証を示すために使用されます。"
    },
    {
      "indent": 3,
      "text": "The final 4 bits (Resved) MUST be set to 0 and ignored on reception.",
      "ja": "最終的な4ビット（Resved）を0に設定し、受信時には無視されなければなりません。"
    },
    {
      "indent": 3,
      "text": "SEQ",
      "ja": "SEQ"
    },
    {
      "indent": 3,
      "text": "As defined in Section 5.3.3 of [RFC5296], this field is a 16-bit sequence number and is used for replay protection.",
      "ja": "[RFC5296]のセクション5.3.3で定義されているように、このフィールドは、16ビットのシーケンス番号であり、再生保護のために使用されます。"
    },
    {
      "indent": 3,
      "text": "TVs and TLVs",
      "ja": "テレビとのTLV"
    },
    {
      "indent": 3,
      "text": "keyName-NAI: As defined in [RFC5296], this is carried in a TLV payload. The Type is 1. The NAI is variable in length, not exceeding 253 octets. Exactly one keyName-NAI attribute SHALL be present in an EAP-Finish/Re-auth packet.",
      "ja": "keyNameの-NAI [RFC5296]で定義されるように、これはTLVペイロードで運ばれます。タイプは1 NAIである253個のオクテットを超えない、長さが可変です。正確に一つのkeyName-NAI属性は、EAP-仕上げ/再認証パケット内に存在しなければなりません。"
    },
    {
      "indent": 3,
      "text": "ERP/AAK-Key: Carried in a TLV payload for the key container. The Type is 8. Exactly one ERP/AAK-key SHALL be present in an EAP-Finish/Re-auth packet.",
      "ja": "ERP / AAK-キー：キーコンテナのためのTLVペイロードで運ば。タイプ8ちょうど1つのERP / AAKキーはEAP-仕上げ/再認証パケット内に存在しなければならないです。"
    },
    {
      "indent": 3,
      "text": "ERP/AAK-Key ::=\n     { sub-TLV: CAP-Identifier }\n     { sub-TLV: pMSK Lifetime }\n     { sub-TLV: pRK Lifetime }\n     { sub-TLV: Cryptosuites }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "CAP-Identifier Carried in a sub-TLV payload. The Type is 11 (less than 128). This field is used to indicate the identifier of the candidate authenticator. The value field MUST be encoded as specified in Section 8 of [RFC3315]. At least one instance of the CAP-Identifier TLV MUST be present in the ERP/AAK-Key TLV.",
      "ja": "サブTLVペイロードで運ばCAP-識別子。タイプ11（128未満）です。このフィールドは、候補オーセンティケータの識別子を示すために使用されます。 [RFC3315]のセクション8で指定された値のフィールドは、符号化されなければなりません。 CAP-識別子TLVの少なくとも1つのインスタンスは、ERP / AAKキーTLVに存在していなければなりません。"
    },
    {
      "indent": 3,
      "text": "pMSK Lifetime Carried in a sub-TLV payload of the EAP-Finish/Re-auth message. The Type is 10. The value field is an unsigned 32-bit field and contains the lifetime of the pMSK in seconds. This value is calculated by the server after performing the pRK Lifetime computation upon receiving the EAP-Initiate/Re-auth message. The rIK SHOULD share the same lifetime as the pMSK. If the 'L' flag is set, the pMSK Lifetime attribute MUST be present.",
      "ja": "pMSK寿命はEAP-仕上げのサブTLVペイロード/再認証メッセージで運ばれます。タイプ値フィールドは符号なし32ビットのフィールドであり、秒単位でpMSKの寿命を含有する10です。この値は、EAP-開始/再認証メッセージを受信するpRK寿命計算を行った後、サーバにより算出されます。 RIKはpMSKと同じ寿命を共有する必要があります。 「L」フラグが設定されている場合は、pMSK生涯属性が存在しなければなりません。"
    },
    {
      "indent": 3,
      "text": "pRK Lifetime Carried in a sub-TLV payload of EAP-Finish/Re-auth message. The Type is 9. The value field is an unsigned 32-bit field and contains the lifetime of the pRK in seconds. This value is calculated by the server before performing the pMSK Lifetime computation upon receiving a EAP-Initiate/Re-auth message. If the 'L' flag is set, the pRK Lifetime attribute MUST be present.",
      "ja": "pRK寿命はEAP-仕上げ/再認証メッセージのサブTLVペイロードで運ばれます。値フィールドは、符号なしの32ビットのフィールドで、秒単位でのpRKの寿命が含まれています9.タイプです。この値は、EAP-開始/再認証メッセージを受信するとpMSK寿命計算を実行する前に、サーバによって計算されます。 「L」フラグが設定されている場合、のpRK生涯属性が存在しなければなりません。"
    },
    {
      "indent": 3,
      "text": "List of Cryptosuites Carried in a sub-TLV payload. The Type is 5 [RFC5296]. The value field contains a list of cryptosuites (at least one cryptosuite SHOULD be included), each 1 octet in length. The allowed cryptosuite values are as specified in Section 5.2. The server SHOULD include this attribute if the cryptosuite used in the EAP-Initiate/Re-auth message was not acceptable and the message is being rejected. The server MAY include this attribute in other cases. The server MAY use this attribute to signal its cryptographic algorithm capabilities to the peer.",
      "ja": "サブTLVペイロードで運ばCryptosuitesのリスト。タイプ5 [RFC5296]です。値フィールドは、（少なくとも1つのcryptosuiteを含めるべきである）cryptosuitesのリスト、それぞれ長さ1つのオクテットを含んでいます。 5.2節で指定された許可cryptosuite値です。 cryptosuiteは、EAP-開始/再認証メッセージで使用される場合、サーバは、この属性を含むべきで受け入れられないとのメッセージが拒否されています。サーバーは、他のケースでは、この属性を含むかもしれません。サーバーは、ピアにその暗号アルゴリズムの機能を知らせるために、この属性を使用するかもしれません。"
    },
    {
      "indent": 3,
      "text": "Cryptosuite",
      "ja": "Cryptosuite"
    },
    {
      "indent": 3,
      "text": "This field indicates the integrity algorithm and PRF used for ERP/ AAK. HMAC-SHA256-128 is REQUIRED to implement, and it SHOULD be enabled in the default configuration. Key lengths and output lengths are either indicated or obvious from the cryptosuite name.",
      "ja": "このフィールドには、整合性アルゴリズムを示し、PRFは、ERP / AAKに使用しました。 HMAC-SHA256-128を実装する必要があり、それはデフォルトの設定で有効にする必要があります。キーの長さと出力の長さはどちらかcryptosuite名前から示さか明らかにされています。"
    },
    {
      "indent": 3,
      "text": "Authentication Tag",
      "ja": "認証タグ"
    },
    {
      "indent": 3,
      "text": "This field contains the integrity checksum over the ERP/AAK packet from the first bit of the Code field to the last bit of the Cryptosuite field, excluding the Authentication Tag field itself. The value field is calculated using the integrity algorithm indicated in the Cryptosuite field and the rIK [RFC5296] as the integrity key. The length of the field is indicated by the corresponding Cryptosuite.",
      "ja": "このフィールドは、認証タグフィールド自体を除く、Cryptosuiteフィールドの最後のビットへのコード・フィールドの最初のビットからERP / AAKパケット上の整合性チェックサムが含まれています。値フィールドはCryptosuiteフィールドと整合性キーとしてRIK [RFC5296]で示される完全性アルゴリズムを使用して計算されます。フィールドの長さは、対応Cryptosuiteで示されています。"
    },
    {
      "indent": 3,
      "text": "The peer uses the authentication tag to determine the validity of the EAP-Finish/Re-auth message from a server.",
      "ja": "ピアは、サーバからのEAP-仕上げ/再認証メッセージの有効性を決定するために、認証タグを使用します。"
    },
    {
      "indent": 3,
      "text": "If the message doesn't pass verification or the authentication tag is not included in the message, the message SHOULD be discarded silently.",
      "ja": "メッセージが検証に合格しない場合、または認証タグがメッセージに含まれていない場合、メッセージは静かに捨てられるべきです。"
    },
    {
      "indent": 3,
      "text": "If the EAP-Initiate/Re-auth packet is not supported by the SAP, it is discarded silently. The peer MUST maintain retransmission timers for reliable transport of the EAP-Initiate/Re-auth message. If there is no response to the EAP-Initiate/Re-auth message from the server after the necessary number of retransmissions (see Section 6), the peer MUST assume that ERP/AAK is not supported by the SAP.",
      "ja": "EAP-開始/再認証パケットがSAPによってサポートされていない場合、それを黙って破棄されます。ピアはEAP-開始/再認証メッセージの信頼性の高い輸送の再送タイマーを維持しなければなりません。再送の必要数（セクション6を参照）の後、サーバからEAP-開始/再認証メッセージに対する応答がない場合、ピアは、ERPは、/ AAKは、SAPによってサポートされていないと仮定しなければなりません。"
    },
    {
      "indent": 0,
      "text": "5.4. TV and TLV Attributes",
      "section_title": true,
      "ja": "5.4。テレビ、TLV属性"
    },
    {
      "indent": 3,
      "text": "With the exception of the rRK Lifetime and rMSK Lifetime TV payloads, the attributes specified in Section 5.3.4 of [RFC5296] also apply to this document. In this document, new attributes that may be present in the EAP-Initiate and EAP-Finish messages are defined as below: o Sequence number: This is a TV payload. The Type is 7.",
      "ja": "RRKの生涯とrMSK生涯テレビペイロードを除いて、[RFC5296]のセクション5.3.4で指定された属性も、この文書に適用されます。この文書では、新しい属性が中に存在してもよいことがEAP-開始し、EAP-完了メッセージは以下のように定義される：Oシーケンス番号：これは、TVペイロードです。タイプは7です。"
    },
    {
      "indent": 3,
      "text": "o ERP/AAK-Key: This is a TLV payload. The Type is 8.",
      "ja": "O ERP / AAK-キー：これはTLVペイロードです。タイプは8です。"
    },
    {
      "indent": 3,
      "text": "o pRK Lifetime: This is a TV payload. The Type is 9.",
      "ja": "OのpRK寿命：これはテレビのペイロードです。タイプは9です。"
    },
    {
      "indent": 3,
      "text": "o pMSK Lifetime: This is a TV payload. The Type is 10.",
      "ja": "O pMSK寿命：これはテレビのペイロードです。タイプは10です。"
    },
    {
      "indent": 3,
      "text": "o CAP-Identifier: This is a TLV payload. The Type is 11.",
      "ja": "O CAP-識別子：これはTLVペイロードです。タイプは11です。"
    },
    {
      "indent": 0,
      "text": "6. Lower-Layer Considerations",
      "section_title": true,
      "ja": "6.下層の考慮事項"
    },
    {
      "indent": 3,
      "text": "Similar to ERP, some lower-layer specifications may need to be revised to support ERP/AAK; refer to Section 6 of [RFC5296] for additional guidance.",
      "ja": "ERPと同様に、いくつかの下位層の仕様はAAK / ERPをサポートするために改訂する必要があるかもしれません。追加のガイダンスについては、[RFC5296]のセクション6を参照してください。"
    },
    {
      "indent": 0,
      "text": "7. AAA Transport Considerations",
      "section_title": true,
      "ja": "7. AAA輸送の考慮事項"
    },
    {
      "indent": 3,
      "text": "The AAA transport of ERP/AAK messages is the same as that of the ERP message [RFC5296]. In addition, this document requires AAA transport of the ERP/AAK keying materials delivered by the ERP/AAK server to the CAP. Hence, a new AAA message for the ERP/AAK application should be specified to transport the keying materials.",
      "ja": "ERP / AAKメッセージのAAA輸送がERPメッセージ[RFC5296]と同じです。また、この文書は、CAPにERP / AAKサーバによって送達ERP / AAKキーイング材料のAAA輸送を必要とします。したがって、ERP / AAKアプリケーションの新しいAAAメッセージは、キーイング材料を搬送するために指定されなければなりません。"
    },
    {
      "indent": 0,
      "text": "8. Security Considerations",
      "section_title": true,
      "ja": "8.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "This section provides an analysis of the protocol in accordance with the AAA key management requirements specified in [RFC4962].",
      "ja": "このセクションでは、[RFC4962]で指定されたAAAキー管理要件に応じてプロトコルの解析を提供します。"
    },
    {
      "indent": 3,
      "text": "o Cryptographic algorithm independence: ERP-AAK satisfies this requirement. The algorithm chosen by the peer for calculating the authentication tag is indicated in the EAP-Initiate/Re-auth message. If the chosen algorithm is unacceptable, the EAP server returns an EAP-Finish/Re-auth message with a Failure indication.",
      "ja": "O暗号アルゴリズムの独立性：ERP-AAKはこの要件を満たしています。認証タグを計算するためのピアによって選択されたアルゴリズムは、EAP-開始/再認証メッセージ中に示されています。選択されたアルゴリズムが許容できない場合、EAPサーバは障害表示とEAP-仕上げ/再認証メッセージを返します。"
    },
    {
      "indent": 3,
      "text": "o Strong, fresh session keys: ERP-AAK results in the derivation of strong, fresh keys that are unique for the given CAP. A pMSK is always derived on demand when the peer requires a key with a new CAP. The derivation ensures that the compromise of one pMSK does not result in the compromise of a different pMSK at any time.",
      "ja": "O強力な、新鮮なセッションキー：与えられたCAPのためのユニークで強力な、新鮮な鍵の導出におけるERP-AAK結果。ピアが新しいCAPとキーを必要とするときpMSKは常にオンデマンドで導出されます。導出は1 pMSKの妥協はいつでも異なるpMSKの妥協を生じないことを保証します。"
    },
    {
      "indent": 3,
      "text": "o Limit key scope: The scope of all the keys derived by ERP-AAK is well defined. The pRK is used to derive the pMSK for the CAP. Different sequence numbers for each CAP MUST be used to derive a unique pMSK.",
      "ja": "Oキー範囲を制限：ERP-AAKによって派生したすべてのキーの範囲は明確に定義されています。 pRKは、CAPのためpMSKを導出するために使用されます。各CAPのためのさまざまなシーケンス番号がユニークpMSKを導出するために使用されなければなりません。"
    },
    {
      "indent": 3,
      "text": "o Replay detection mechanism: For replay protection, a sequence number associated with the pMSK is used. The peer increments the sequence number by one after it sends an ERP/AAK message. The server sets the expected sequence number to the received sequence number plus one after verifying the validity of the received message, and it responds to the message.",
      "ja": "リプレイ検出機構O：リプレイ保護のため、pMSKに関連付けられたシーケンス番号が使用されます。それはERP / AAKメッセージを送信した後、ピアはいずれかによってシーケンス番号をインクリメントします。サーバは、受信したメッセージの有効性を確認した後に受信したシーケンス番号を加えたものに期待されるシーケンス番号を設定し、それがメッセージに応答します。"
    },
    {
      "indent": 3,
      "text": "o Authenticate all parties: The EAP Re-authentication Protocol provides mutual authentication of the peer and the server. The peer and SAP are authenticated via ERP. The CAP is authenticated and trusted by the SAP.",
      "ja": "Oすべての当事者を認証：EAP再認証プロトコルは、ピアとサーバの相互認証を提供します。ピアとSAPはERPを介して認証されています。 CAPは、SAPにより認証され、信頼されています。"
    },
    {
      "indent": 3,
      "text": "o Peer and authenticator authorization: The peer and authenticator demonstrate possession of the same keying material without disclosing it, as part of the lower-layer secure authentication protocol.",
      "ja": "ピア及びオーセンティケータ認可をO：ピアとオーセンティケータは、下位層のセキュア認証プロトコルの一部として、それを開示することなく、同一のキーイングマテリアルの所有を証明します。"
    },
    {
      "indent": 3,
      "text": "o Keying material confidentiality: The peer and the server derive the keys independently using parameters known to each entity.",
      "ja": "材料の機密性をキーイング（O）ピアとサーバは、独立して各エンティティに知られているパラメータを使用してキーを導出します。"
    },
    {
      "indent": 3,
      "text": "o Uniquely named keys: All keys produced within the ERP context can be referred to uniquely as specified in this document.",
      "ja": "Oユニークキーを名前：この文書で指定されているERPのコンテキスト内で生成されたすべてのキーが一意に参照することができます。"
    },
    {
      "indent": 3,
      "text": "o Prevent the domino effect: Different sequence numbers for each CAP MUST be used to derive the unique pMSK so that the compromise of one pMSK does not hurt any other CAP.",
      "ja": "Oドミノ効果を防ぐ：各CAPのためのさまざまなシーケンス番号が1 pMSKの妥協が他のCAPを傷つけないように、ユニークなpMSKを導出するために使用されなければなりません。"
    },
    {
      "indent": 3,
      "text": "o Bind key to its context: The pMSKs are bound to the context in which the sequence numbers are transmitted.",
      "ja": "OそのコンテキストにキーをバインドしますpMSKsは、シーケンス番号が送信されるコンテキストにバインドされています。"
    },
    {
      "indent": 3,
      "text": "o Confidentiality of identity: This is the same as with ERP [RFC5296].",
      "ja": "アイデンティティの機密性O：これは、ERP [RFC5296]と同じです。"
    },
    {
      "indent": 3,
      "text": "o Authorization restriction: All the keys derived are limited in lifetime by that of the parent key or by server policy. Any domain-specific keys are further restricted to be used only in the domain for which the keys are derived. Any other restrictions of session keys may be imposed by the specific lower layer and are out of scope for this specification.",
      "ja": "O承認制限：派生したすべてのキーが親キーのことにより、またはサーバーポリシーによって寿命が制限されています。任意のドメイン固有のキーは、さらにキーのみが誘導されるため、ドメインで使用されるように制限されています。セッション鍵の任意の他の制限は、特定の下位層によって課されると、本明細書の範囲外であることができます。"
    },
    {
      "indent": 0,
      "text": "9. IANA Considerations",
      "section_title": true,
      "ja": "9. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has assigned five TLVs from the registry of EAP Initiate and Finish Attributes maintained at http://www.iana.org/assignments/eap-numbers/ with the following numbers: o Sequence number: This is a TV payload. The Type is 7.",
      "ja": "Oシーケンス番号：これはテレビのペイロードであるIANAは、開始と終了は、次の番号でhttp://www.iana.org/assignments/eap-numbers/に維持属性EAPのレジストリから5つのTLVを割り当てています。タイプは7です。"
    },
    {
      "indent": 3,
      "text": "o ERP/AAK-Key: This is a TLV payload. The Type is 8.",
      "ja": "O ERP / AAK-キー：これはTLVペイロードです。タイプは8です。"
    },
    {
      "indent": 3,
      "text": "o pRK Lifetime: This is a TLV payload. The Type is 9.",
      "ja": "OのpRK寿命：これはTLVペイロードです。タイプは9です。"
    },
    {
      "indent": 3,
      "text": "o pMSK Lifetime: This is a TLV payload. The Type is 10.",
      "ja": "O pMSK寿命：これはTLVペイロードです。タイプは10です。"
    },
    {
      "indent": 3,
      "text": "o CAP-Identifier: This is a TLV payload. The Type is 11.",
      "ja": "O CAP-識別子：これはTLVペイロードです。タイプは11です。"
    },
    {
      "indent": 3,
      "text": "This document reuses the cryptosuites that were created for \"Re-authentication Cryptosuites\" in [RFC5296].",
      "ja": "この文書では、[RFC5296]で「再認証Cryptosuites」用に作成されたcryptosuitesを再利用します。"
    },
    {
      "indent": 3,
      "text": "Further, IANA has added a new label in the \"User Specific Root Keys (USRK) Key Labels\" sub-registry of the \"Extended Master Session Key (EMSK) Parameters\" registry, as follows:",
      "ja": "次のようにさらに、IANAは、「ユーザー固有のルートキー（USRK）キーラベル」のサブレジストリ「拡張マスターセッションキー（EMSK）パラメータ」レジストリに新しいラベルを追加しました："
    },
    {
      "indent": 6,
      "text": "EAP Early-Authentication Root Key@ietf.org",
      "ja": "EAP-初期認証ルートKey@ietf.org"
    },
    {
      "indent": 3,
      "text": "A new registry for the flags in the EAP Initiate/Re-auth-Start message called the \"EAP Initiate/Re-auth-Start Flags\" has been created and a new flag (E) has been assigned as follows:",
      "ja": "EAPのフラグのための新しいレジストリ開始/再-AUTH-Startメッセージは、いわゆる「EAP開始/再-AUTH-スタートフラグ」が作成されており、次のように新しいフラグ（E）が割り当てられています。"
    },
    {
      "indent": 6,
      "text": "(E) 0x80",
      "ja": "（E）は0x80"
    },
    {
      "indent": 3,
      "text": "The rest of the values in the 8-bit field are reserved. New values can be assigned by Standards Action or IESG Approval [RFC5226].",
      "ja": "8ビットフィールドの値の残りは予約されています。新しい値は、標準アクションまたはIESG承認[RFC5226]で割り当てることができます。"
    },
    {
      "indent": 3,
      "text": "A new registry for the flags in the EAP Initiate/Re-auth message called the \"EAP Initiate/Re-auth Flags\" has also been created. The following flags are reserved:",
      "ja": "EAPのフラグのための新しいレジストリが開始/再認証メッセージも作成されている「EAPを開始/再認証フラグ」と呼ばれます。次のフラグが予約されています："
    },
    {
      "indent": 6,
      "text": "(R) 0x80 [RFC5296]",
      "ja": "（R）は0x80 [RFC5296]"
    },
    {
      "indent": 6,
      "text": "(B) 0x40 [RFC5296]",
      "ja": "（B）0x40の[RFC5296]"
    },
    {
      "indent": 6,
      "text": "(L) 0x20 [RFC5296]",
      "ja": "（L）の0x20 [RFC5296]"
    },
    {
      "indent": 3,
      "text": "This document assigns a new flag (E) as follows:",
      "ja": "次のようにこの文書は、新しいフラグ（E）を割り当てます。"
    },
    {
      "indent": 6,
      "text": "(E) 0x10",
      "ja": "（E）の0x10"
    },
    {
      "indent": 3,
      "text": "The rest of the values in the 8-bit field are reserved. New values can be assigned by Standards Action or IESG Approval.",
      "ja": "8ビットフィールドの値の残りは予約されています。新しい値は、標準アクションまたはIESGの承認によって割り当てることができます。"
    },
    {
      "indent": 3,
      "text": "Further, this document creates a new registry for the flags in the EAP Finish/Re-auth message called the \"EAP Finish/Re-auth Flags\". The following values are assigned.",
      "ja": "さらに、このドキュメントは、EAP完了のフラグのための新しいレジストリを作成/再認証メッセージ「EAP終了/再認証フラグ」と呼ばれます。次の値が割り当てられます。"
    },
    {
      "indent": 6,
      "text": "(R) 0x80 [RFC5296]",
      "ja": "（R）は0x80 [RFC5296]"
    },
    {
      "indent": 6,
      "text": "(B) 0x40 [RFC5296]",
      "ja": "（B）0x40の[RFC5296]"
    },
    {
      "indent": 6,
      "text": "(L) 0x20 [RFC5296]",
      "ja": "（L）の0x20 [RFC5296]"
    },
    {
      "indent": 3,
      "text": "This document assigns a new flag (E) as follows:",
      "ja": "次のようにこの文書は、新しいフラグ（E）を割り当てます。"
    },
    {
      "indent": 6,
      "text": "(E) 0x10",
      "ja": "（E）の0x10"
    },
    {
      "indent": 3,
      "text": "The rest of the values in the 8-bit field are reserved. New values can be assigned by Standards Action or IESG approval.",
      "ja": "8ビットフィールドの値の残りは予約されています。新しい値は、標準アクションまたはIESGの承認によって割り当てることができます。"
    },
    {
      "indent": 0,
      "text": "10. Acknowledgements",
      "section_title": true,
      "ja": "10.謝辞"
    },
    {
      "indent": 3,
      "text": "In writing this document, Yungui Wang contributed to early versions of this document and we have received reviews from many experts in the IETF, including Tom Taylor, Tena Zou, Tim Polk, Tan Zhang, Semyon Mizikovsky, Stephen Farrell, Radia Perlman, Miguel A. Garcia, and Sujing Zhou. We apologize if we miss some of those who have helped us.",
      "ja": "この文書を書くには、Yungui王は、このドキュメントの初期バージョンに貢献し、我々はトム・テイラー、テナゾウ、ティムポーク、タン張、セミヨンMizikovsky、スティーブン・ファレル、ラディア・パールマン、ミゲル・Aなど、IETFでの多くの専門家から評価を受けています。ガルシア、そしてSujing周。私たちは私たちを助けてきた人たちの一部を逃した場合、私たちは謝罪します。"
    },
    {
      "indent": 0,
      "text": "11. References",
      "section_title": true,
      "ja": "11.参考文献"
    },
    {
      "indent": 0,
      "text": "11.1. Normative References",
      "section_title": true,
      "ja": "11.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3315] Droms, R., Bound, J., Volz, B., Lemon, T., Perkins, C., and M. Carney, \"Dynamic Host Configuration Protocol for IPv6 (DHCPv6)\", RFC 3315, July 2003.",
      "ja": "[RFC3315] Droms、R.、バウンド、J.、フォルツ、B.、レモン、T.、パーキンス、C.、およびM.カーニー、 \"IPv6のための動的ホスト構成プロトコル（DHCPv6）\"、RFC 3315、2003年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC4282] Aboba, B., Beadles, M., Arkko, J., and P. Eronen, \"The Network Access Identifier\", RFC 4282, December 2005.",
      "ja": "[RFC4282] Aboba、B.、Beadles、M.、Arkko、J.、およびP. Eronen、 \"ネットワークアクセス識別子\"、RFC 4282、2005年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC5226] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 5226, May 2008.",
      "ja": "[RFC5226] Narten氏、T.とH. Alvestrand、 \"RFCsにIANA問題部に書くためのガイドライン\"、BCP 26、RFC 5226、2008年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC5295] Salowey, J., Dondeti, L., Narayanan, V., and M. Nakhjiri, \"Specification for the Derivation of Root Keys from an Extended Master Session Key (EMSK)\", RFC 5295, August 2008.",
      "ja": "[RFC5295] Salowey、J.、Dondeti、L.、ナラヤナン、V.、およびM. Nakhjiri、RFC 5295 \"拡張マスタセッションキー（EMSK）からルート鍵の導出のための仕様\"、2008年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC5296] Narayanan, V. and L. Dondeti, \"EAP Extensions for EAP Re-authentication Protocol (ERP)\", RFC 5296, August 2008.",
      "ja": "[RFC5296]ナラヤナン、V.およびL. Dondeti、 \"EAP再認証プロトコル（ERP）のためのEAP拡張機能\"、RFC 5296、2008年8月。"
    },
    {
      "indent": 0,
      "text": "11.2. Informative References",
      "section_title": true,
      "ja": "11.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[KEYTRAN] Zorn, G., Wu, W., and V. Cakulev, \"Diameter Attribute-Value Pairs for Cryptographic Key Transport\", Work in Progress, August 2011.",
      "ja": "[KEYTRAN]ソーン、G.、呉、W.、およびV. Cakulev、「暗号鍵輸送のための直径アトリビュートと値のペア」、進歩、2011年8月での作業。"
    },
    {
      "indent": 3,
      "text": "[RFC2104] Krawczyk, H., Bellare, M., and R. Canetti, \"HMAC: Keyed-Hashing for Message Authentication\", RFC 2104, February 1997.",
      "ja": "[RFC2104] Krawczyk、H.、ベラー、M.、およびR.カネッティ、 \"HMAC：メッセージ認証のための鍵付きハッシュ化\"、RFC 2104、1997年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC3588] Calhoun, P., Loughney, J., Guttman, E., Zorn, G., and J. Arkko, \"Diameter Base Protocol\", RFC 3588, September 2003.",
      "ja": "[RFC3588]カルフーン、P.、Loughney、J.、ガットマン、E.、ゾルン、G.、およびJ. Arkko、 \"直径ベースプロトコル\"、RFC 3588、2003年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC3748] Aboba, B., Blunk, L., Vollbrecht, J., Carlson, J., and H. Levkowetz, \"Extensible Authentication Protocol (EAP)\", RFC 3748, June 2004.",
      "ja": "[RFC3748] Aboba、B.、ブルンク、L.、Vollbrecht、J.、カールソン、J.、およびH. Levkowetz、 \"拡張認証プロトコル（EAP）\"、RFC 3748、2004年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC4868] Kelly, S. and S. Frankel, \"Using HMAC-SHA-256, HMAC-SHA-384, and HMAC-SHA-512 with IPsec\", RFC 4868, May 2007.",
      "ja": "[RFC4868]ケリー、S.、およびS.フランケル、 \"HMAC-SHA-256を使用して、HMAC-SHA-384、およびIPSecとHMAC-SHA-512\"、RFC 4868、2007年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC4962] Housley, R. and B. Aboba, \"Guidance for Authentication, Authorization, and Accounting (AAA) Key Management\", BCP 132, RFC 4962, July 2007.",
      "ja": "[RFC4962] Housley氏、R。およびB. Aboba、 \"認証、許可、アカウンティング（AAA）キー管理のための指針\"、BCP 132、RFC 4962、2007年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC5836] Ohba, Y., Wu, Q., and G. Zorn, \"Extensible Authentication Protocol (EAP) Early Authentication Problem Statement\", RFC 5836, April 2010.",
      "ja": "[RFC5836]オオバ、Y.、ウー、Q.、およびG.ゾルン、 \"拡張認証プロトコル（EAP）は、初期認証問題文\"、RFC 5836、2010年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC5890] Klensin, J., \"Internationalized Domain Names for Applications (IDNA): Definitions and Document Framework\", RFC 5890, August 2010.",
      "ja": "[RFC5890] Klensin、J.、 \"アプリケーション（IDNA）のための国際化ドメイン名：定義とドキュメントフレームワーク\"、RFC 5890、2010年8月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Zhen Cao China Mobile 53A Xibianmennei Ave., Xuanwu District Beijing, Beijing 100053 P.R. China",
      "ja": "ZとNC AO中国移動53ax私はドアAVEとなります。、X UA N地区北京、北京100053中華人民共和国なし"
    },
    {
      "indent": 3,
      "text": "EMail: zehn.cao@gmail.com",
      "ja": "メールアドレス：zehn.cao@gmail.com"
    },
    {
      "indent": 3,
      "text": "Hui Deng China Mobile 53A Xibianmennei Ave., Xuanwu District Beijing, Beijing 100053 P.R. China",
      "ja": "ホイ鄧小平中国移動は、私はドアAVEなります53ax。、X UA N地区北京、北京なし100053中華人民共和国"
    },
    {
      "indent": 3,
      "text": "EMail: denghui02@gmail.com",
      "ja": "メールアドレス：denghui02@gmail.com"
    },
    {
      "indent": 3,
      "text": "Qin Wu Huawei Floor 12, HuiHong Mansion, No. 91 BaiXia Rd. Nanjing, Jiangsu 210001 P.R. China",
      "ja": "蕪湖AでのQはありません、床12、ホイ香港大邸宅です。91 BAイクシアRD。南京、江蘇省210001中華人民共和国"
    },
    {
      "indent": 3,
      "text": "Phone: +86 25 56623633 EMail: sunseawq@huawei.com",
      "ja": "電話：+86 25 56623633 Eメール：sunseawq@huawei.com"
    },
    {
      "indent": 3,
      "text": "Glen Zorn (editor) Network Zen 227/358 Thanon Sanphawut Bang Na, Bangkok 10260 Thailand",
      "ja": "グレンソーン（エディタ）ネットワーク禅358分の227タノンSanphawutバンナー、バンコク10260タイ"
    },
    {
      "indent": 3,
      "text": "Phone: +66 (0) 87-040-4617 EMail: glenzorn@gmail.com",
      "ja": "電話：+66（0）87-040-4617 Eメール：glenzorn@gmail.com"
    }
  ]
}