{
  "title": {
    "text": "RFC 2402 - IP Authentication Header",
    "ja": "RFC 2402 - IP認証ヘッダ"
  },
  "number": 2402,
  "created_at": "2019-10-24 04:54:57.298286+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                            S. Kent\nRequest for Comments: 2402                                      BBN Corp\nObsoletes: 1826                                              R. Atkinson\nCategory: Standards Track                                  @Home Network\n                                                           November 1998",
      "raw": true
    },
    {
      "indent": 24,
      "text": "IP Authentication Header",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1998). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1998）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 2,
      "text": "1. Introduction......................................................2\n2. Authentication Header Format......................................3\n   2.1 Next Header...................................................4\n   2.2 Payload Length................................................4\n   2.3 Reserved......................................................4\n   2.4 Security Parameters Index (SPI)...............................4\n   2.5 Sequence Number...............................................5\n   2.6 Authentication Data ..........................................5\n3. Authentication Header Processing..................................5\n   3.1  Authentication Header Location...............................5\n   3.2  Authentication Algorithms....................................7\n   3.3  Outbound Packet Processing...................................8\n      3.3.1  Security Association Lookup.............................8\n      3.3.2  Sequence Number Generation..............................8\n      3.3.3  Integrity Check Value Calculation.......................9\n         3.3.3.1  Handling Mutable Fields............................9\n            3.3.3.1.1  ICV Computation for IPv4.....................10\n               3.3.3.1.1.1 Base Header Fields.......................10\n               3.3.3.1.1.2 Options..................................11\n            3.3.3.1.2  ICV Computation for IPv6.....................11\n               3.3.3.1.2.1 Base Header Fields.......................11\n               3.3.3.1.2.2 Extension Headers Containing Options.....11\n               3.3.3.1.2.3 Extension Headers Not Containing Options.11\n         3.3.3.2  Padding...........................................12\n            3.3.3.2.1  Authentication Data Padding..................12",
      "raw": true
    },
    {
      "indent": 2,
      "text": "            3.3.3.2.2  Implicit Packet Padding......................12\n      3.3.4  Fragmentation..........................................12\n   3.4  Inbound Packet Processing...................................13\n      3.4.1  Reassembly.............................................13\n      3.4.2  Security Association Lookup............................13\n      3.4.3  Sequence Number Verification...........................13\n      3.4.4  Integrity Check Value Verification.....................15\n4. Auditing.........................................................15\n5. Conformance Requirements.........................................16\n6. Security Considerations..........................................16\n7. Differences from RFC 1826........................................16\nAcknowledgements....................................................17\nAppendix A -- Mutability of IP Options/Extension Headers............18\n   A1. IPv4 Options.................................................18\n   A2. IPv6 Extension Headers.......................................19\nReferences..........................................................20\nDisclaimer..........................................................21\nAuthor Information..................................................22\nFull Copyright Statement............................................22",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "The IP Authentication Header (AH) is used to provide connectionless integrity and data origin authentication for IP datagrams (hereafter referred to as just \"authentication\"), and to provide protection against replays. This latter, optional service may be selected, by the receiver, when a Security Association is established. (Although the default calls for the sender to increment the Sequence Number used for anti-replay, the service is effective only if the receiver checks the Sequence Number.) AH provides authentication for as much of the IP header as possible, as well as for upper level protocol data. However, some IP header fields may change in transit and the value of these fields, when the packet arrives at the receiver, may not be predictable by the sender. The values of such fields cannot be protected by AH. Thus the protection provided to the IP header by AH is somewhat piecemeal.",
      "ja": "IP認証ヘッダ（AH）は、（以下、単に「認証」と呼ばれる）IPデータグラムのためのコネクションレス完全性とデータ発信元認証を提供するために、そしてリプレイに対する保護を提供するために使用されます。セキュリティアソシエーションが確立されたときに、この後者のオプションサービスは、受信機によって、選択することができます。 （アンチリプレイのために使用されるシーケンス番号をインクリメントするために、送信者のデフォルトの呼び出しが、サービスは、受信シーケンス番号をチェックした場合にのみ有効である。）AHは、できるだけIPヘッダの多く、ならびにための認証を提供します上位プロトコルデータ。しかし、いくつかのIPヘッダフィールドは、パケットが受信機に到達したとき、送信者が予測できない場合があり、トランジット及びこれらのフィールドの値に変更してもよいです。このようなフィールドの値は、AHで保護することはできません。したがってAHによってIPヘッダに設けられた保護は幾分断片的です。"
    },
    {
      "indent": 3,
      "text": "AH may be applied alone, in combination with the IP Encapsulating Security Payload (ESP) [KA97b], or in a nested fashion through the use of tunnel mode (see \"Security Architecture for the Internet Protocol\" [KA97a], hereafter referred to as the Security Architecture document). Security services can be provided between a pair of communicating hosts, between a pair of communicating security gateways, or between a security gateway and a host. ESP may be used to provide the same security services, and it also provides a confidentiality (encryption) service. The primary difference between the authentication provided by ESP and AH is the extent of the coverage. Specifically, ESP does not protect any IP header fields unless those fields are encapsulated by ESP (tunnel mode). For more details on how to use AH and ESP in various network environments, see the Security Architecture document [KA97a].",
      "ja": "AH IPカプセル化セキュリティペイロード（ESP）[KA97b]と組み合わせて、単独で適用され、又はトンネルモードを使用することにより、ネストされた様式で（[KA97a「インターネットプロトコル用のセキュリティアーキテクチャ」を参照することができる、以下のように呼ばれますセキュリティアーキテクチャ文書）。セキュリティサービスは、セキュリティゲートウェイを通信する対の間、またはセキュリティゲートウェイとホストとの間で、ホストと通信する一対の間に設けることができます。 ESPは、同じセキュリティ・サービスを提供するために使用することができる、そしてそれはまた、機密性（暗号化）サービスを提供しています。 ESPとAHが提供する認証の主な違いは、カバレッジの範囲です。これらのフィールドは、ESP（トンネルモード）によってカプセル化されていない限り、具体的には、ESPは、任意のIPヘッダフィールドを保護しません。さまざまなネットワーク環境でAHとESPを使用する方法の詳細については、セキュリティアーキテクチャ文書[KA97a]を参照してください。"
    },
    {
      "indent": 3,
      "text": "It is assumed that the reader is familiar with the terms and concepts described in the Security Architecture document. In particular, the reader should be familiar with the definitions of security services offered by AH and ESP, the concept of Security Associations, the ways in which AH can be used in conjunction with ESP, and the different key management options available for AH and ESP. (With regard to the last topic, the current key management options required for both AH and ESP are manual keying and automated keying via IKE [HC98].)",
      "ja": "読者は、セキュリティアーキテクチャ文書で説明した用語と概念に精通していることを想定しています。具体的には、読者はAHとESPで利用可能なAHとESPが提供するセキュリティサービスの定義は、セキュリティアソシエーションの概念、AHはESPと組み合わせて使用​​することができる方法、および異なる鍵管理オプションに精通している必要があり。 （最後のトピックに関しては、AHとESPの両方のために必要な電流の鍵管理オプションは、IKE [HC98]経由で手動キー入力および自動化されたキーです。）"
    },
    {
      "indent": 3,
      "text": "The keywords MUST, MUST NOT, REQUIRED, SHALL, SHALL NOT, SHOULD, SHOULD NOT, RECOMMENDED, MAY, and OPTIONAL, when they appear in this document, are to be interpreted as described in RFC 2119 [Bra97].",
      "ja": "彼らは、この文書に表示されるRFC 2119 [Bra97]で説明したように解釈される際のキーワードは、REQUIREDは、、、、、MAY、推奨、およびオプションのすべきでないないものとものとしてはなりませんしなければなりません。"
    },
    {
      "indent": 0,
      "text": "2. Authentication Header Format",
      "section_title": true,
      "ja": "2.認証ヘッダのフォーマット"
    },
    {
      "indent": 3,
      "text": "The protocol header (IPv4, IPv6, or Extension) immediately preceding the AH header will contain the value 51 in its Protocol (IPv4) or Next Header (IPv6, Extension) field [STD-2].",
      "ja": "直ちにAHヘッダの前にプロトコルヘッダ（IPv4の、IPv6の、または拡張）は、そのプロトコル（IPv4）のまたは次のヘッダ（IPv6の拡張）フィールド[STD-2]の値51を含むであろう。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n| Next Header   |  Payload Len  |          RESERVED             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                 Security Parameters Index (SPI)               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                    Sequence Number Field                      |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                                                               |\n+                Authentication Data (variable)                 |\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The following subsections define the fields that comprise the AH format. All the fields described here are mandatory, i.e., they are always present in the AH format and are included in the Integrity Check Value (ICV) computation (see Sections 2.6 and 3.3.3).",
      "ja": "以下のサブセクションでは、AHフォーマットを含むフィールドを定義します。ここで説明するすべてのフィールドは、すなわち、彼らは常にAHフォーマットに存在し、（セクション2.6と3.3.3を参照）整合性チェック値（ICV）の計算に含まれている、必須です。"
    },
    {
      "indent": 0,
      "text": "2.1 Next Header",
      "section_title": true,
      "ja": "2.1次ヘッダ"
    },
    {
      "indent": 3,
      "text": "The Next Header is an 8-bit field that identifies the type of the next payload after the Authentication Header. The value of this field is chosen from the set of IP Protocol Numbers defined in the most recent \"Assigned Numbers\" [STD-2] RFC from the Internet Assigned Numbers Authority (IANA).",
      "ja": "次ヘッダは、認証ヘッダの後の次のペイロードのタイプを識別する8ビットのフィールドです。このフィールドの値は、最新の「割り当て番号」インターネット割り当て番号機関（IANA）から[STD-2] RFCに定義されたIPプロトコル番号のセットから選択されます。"
    },
    {
      "indent": 0,
      "text": "2.2 Payload Length",
      "section_title": true,
      "ja": "2.2ペイロード長"
    },
    {
      "indent": 3,
      "text": "This 8-bit field specifies the length of AH in 32-bit words (4-byte units), minus \"2\". (All IPv6 extension headers, as per RFC 1883, encode the \"Hdr Ext Len\" field by first subtracting 1 (64-bit word) from the header length (measured in 64-bit words). AH is an IPv6 extension header. However, since its length is measured in 32-bit words, the \"Payload Length\" is calculated by subtracting 2 (32 bit words).) In the \"standard\" case of a 96-bit authentication value plus the 3 32-bit word fixed portion, this length field will be \"4\". A \"null\" authentication algorithm may be used only for debugging purposes. Its use would result in a \"1\" value for this field for IPv4 or a \"2\" for IPv6, as there would be no corresponding Authentication Data field (see Section 3.3.3.2.1 on \"Authentication Data Padding\").",
      "ja": "この8ビットのフィールドは、32ビット・ワード（4バイト単位）、マイナス「2」にAHの長さを指定します。 （すべてのIPv6拡張ヘッダは、RFC 1883に従って、最初の64ビット・ワードで測定されたヘッダ長（）から1（64ビットワード）を減算することによって、「HDR拡張レン」フィールドを符号化する。AHは、IPv6拡張ヘッダである。しかし、その長さは32ビットワードで測定されるので、「ペイロード長は」2（32ビットワード）を差し引くことによって計算される。）96ビットの認証値+固定3の32ビットワードの「標準」の場合部分は、このlengthフィールドは、「4」となります。 「ヌル」認証アルゴリズムは、デバッグ目的にのみ使用することができます。その使用には対応する認証データフィールド（「認証データパディング」のセクション3.3.3.2.1を参照）が存在しないであろうように、IPv4の場合、このフィールドまたはIPv6の「2」の「1」値をもたらすであろう。"
    },
    {
      "indent": 0,
      "text": "2.3 Reserved",
      "section_title": true,
      "ja": "予約済み2.3"
    },
    {
      "indent": 3,
      "text": "This 16-bit field is reserved for future use. It MUST be set to \"zero.\" (Note that the value is included in the Authentication Data calculation, but is otherwise ignored by the recipient.)",
      "ja": "この16ビットのフィールドは、将来の使用のために予約されています。これは、に設定しなければならない「ゼロ」。 （値は、認証データの計算に含まれ、それ以外の受信者によって無視されることに注意してください。）"
    },
    {
      "indent": 0,
      "text": "2.4 Security Parameters Index (SPI)",
      "section_title": true,
      "ja": "2.4セキュリティパラメータインデックス（SPI）"
    },
    {
      "indent": 3,
      "text": "The SPI is an arbitrary 32-bit value that, in combination with the destination IP address and security protocol (AH), uniquely identifies the Security Association for this datagram. The set of SPI values in the range 1 through 255 are reserved by the Internet Assigned Numbers Authority (IANA) for future use; a reserved SPI value will not normally be assigned by IANA unless the use of the assigned SPI value is specified in an RFC. It is ordinarily selected by the destination system upon establishment of an SA (see the Security Architecture document for more details).",
      "ja": "SPIは、宛先IPアドレスおよびセキュリティプロトコル（AH）と組み合わせて、一意にこのデータグラムのためのセキュリティアソシエーションを識別し、任意の32ビット値です。 255までの範囲1にSPI値のセットは、将来の使用のためInternet Assigned Numbers Authority（IANA）によって予約されています。割り当てられたSPI値の使用は、RFCで指定されていない限り、予約SPI値は、通常、IANAによって割り当てられません。これは、通常、SAの確立時に宛先システム（詳細は、セキュリティアーキテクチャ文書を参照）によって選択されます。"
    },
    {
      "indent": 3,
      "text": "The SPI value of zero (0) is reserved for local, implementation-specific use and MUST NOT be sent on the wire. For example, a key management implementation MAY use the zero SPI value to mean \"No Security Association Exists\" during the period when the IPsec implementation has requested that its key management entity establish a new SA, but the SA has not yet been established.",
      "ja": "（0）ゼロのSPI値は、ローカル、実装に固有の使用のために予約されており、ワイヤ上で送信してはいけません。例えば、鍵管理の実装は、IPsec実装がその鍵管理エンティティが新しいSAを確立することを要求しましたが、SAがまだ確立されていない期間中に「いいえセキュリティアソシエーションが存在する」ことを意味するゼロSPI値を使用するかもしれません。"
    },
    {
      "indent": 0,
      "text": "2.5 Sequence Number",
      "section_title": true,
      "ja": "2.5シーケンス番号"
    },
    {
      "indent": 3,
      "text": "This unsigned 32-bit field contains a monotonically increasing counter value (sequence number). It is mandatory and is always present even if the receiver does not elect to enable the anti-replay service for a specific SA. Processing of the Sequence Number field is at the discretion of the receiver, i.e., the sender MUST always transmit this field, but the receiver need not act upon it (see the discussion of Sequence Number Verification in the \"Inbound Packet Processing\" section below).",
      "ja": "この符号なし32ビットのフィールドは、単調増加カウンタ値（シーケンス番号）を含みます。これは必須であり、受信機は、特定のSAのためのアンチリプレイサービスを有効にすることを選択しない場合でも常に存在しています。シーケンス番号フィールドの処理は受信機の裁量であり、すなわち、送信者は、常にこのフィールドを伝えなければなりませんが、受信機は、それに基づいて行動（以下「インバウンドパケット処理」セクションにシーケンス番号の検証の議論を参照）する必要はありません。"
    },
    {
      "indent": 3,
      "text": "The sender's counter and the receiver's counter are initialized to 0 when an SA is established. (The first packet sent using a given SA will have a Sequence Number of 1; see Section 3.3.2 for more details on how the Sequence Number is generated.) If anti-replay is enabled (the default), the transmitted Sequence Number must never be allowed to cycle. Thus, the sender's counter and the receiver's counter MUST be reset (by establishing a new SA and thus a new key) prior to the transmission of the 2^32nd packet on an SA.",
      "ja": "SAが確立されたときに、送信者のカウンタと受信側のカウンタが0に初期化されています。 （1のシーケンス番号を持つことになります与えられたSAを使用して送信された最初のパケットは、シーケンス番号の生成方法についての詳細は、3.3.2項を参照してください。）抗リプレイが（デフォルト）有効になっている場合は、送信シーケンス番号が必要サイクルに許されることはありません。したがって、送信側のカウンタと受信側のカウンタは、SAに2 ^ 32パケットの送信に先立って（従って新しいSAと新しい鍵を確立することによって）リセットする必要があります。"
    },
    {
      "indent": 0,
      "text": "2.6 Authentication Data",
      "section_title": true,
      "ja": "2.6認証データ"
    },
    {
      "indent": 3,
      "text": "This is a variable-length field that contains the Integrity Check Value (ICV) for this packet. The field must be an integral multiple of 32 bits in length. The details of the ICV computation are described in Section 3.3.2 below. This field may include explicit padding. This padding is included to ensure that the length of the AH header is an integral multiple of 32 bits (IPv4) or 64 bits (IPv6). All implementations MUST support such padding. Details of how to compute the required padding length are provided below. The authentication algorithm specification MUST specify the length of the ICV and the comparison rules and processing steps for validation.",
      "ja": "これは、Integrityは、このパケットの値（ICV）を確認含ま可変長フィールドです。フィールドは、長さ32ビットの整数倍でなければなりません。 ICV計算の詳細については、以下のセクション3.3.2で説明されています。このフィールドは、明示的なパディングを含むことができます。このパディングは、AHヘッダの長さが32ビット（IPv4）の64ビット（IPv6）の整数倍であることを保証するために含まれます。すべての実装は、このようなパディングをサポートしなければなりません。必要なパディング長さを計算する方法の詳細については、以下に提供されます。認証アルゴリズムの仕様は、検証のためのICVの長さと比較ルール及び処理ステップを指定しなければなりません。"
    },
    {
      "indent": 0,
      "text": "3. Authentication Header Processing",
      "section_title": true,
      "ja": "3.認証ヘッダの処理"
    },
    {
      "indent": 0,
      "text": "3.1 Authentication Header Location",
      "section_title": true,
      "ja": "3.1認証ヘッダの場所"
    },
    {
      "indent": 3,
      "text": "Like ESP, AH may be employed in two ways: transport mode or tunnel mode. The former mode is applicable only to host implementations and provides protection for upper layer protocols, in addition to selected IP header fields. (In this mode, note that for \"bump-in-the-stack\" or \"bump-in-the-wire\" implementations, as defined in the Security Architecture document, inbound and outbound IP fragments may require an IPsec implementation to perform extra IP reassembly/fragmentation in order to both conform to this specification and provide transparent IPsec support. Special care is required to perform such operations within these implementations when multiple interfaces are in use.)",
      "ja": "トランスポート・モードまたはトンネルモード：ESPのように、AHは、2つの方法で使用することができます。前者のモードでは、ホストの実装に適用され、選択されたIPヘッダフィールドに加えて、上位層プロトコルのための保護を提供します。 （このモードでは、セキュリティアーキテクチャ文書で定義されているように、「バンプ・イン・ワイヤー」の実装「で、スタック・バンプ」または、インバウンドとアウトバウンドのIPフラグメントは余分を実行するためにIPsec実装を必要とするかもしれないためのことに注意IP両方のために再組立て/断片化はこの仕様に準拠し、透明IPsecサポートを提供する。複数のインターフェースを使用している場合には、特別な注意がこれらの実装内でこのような動作を行う必要があります。）"
    },
    {
      "indent": 3,
      "text": "In transport mode, AH is inserted after the IP header and before an upper layer protocol, e.g., TCP, UDP, ICMP, etc. or before any other IPsec headers that have already been inserted. In the context of IPv4, this calls for placing AH after the IP header (and any options that it contains), but before the upper layer protocol. (Note that the term \"transport\" mode should not be misconstrued as restricting its use to TCP and UDP. For example, an ICMP message MAY be sent using either \"transport\" mode or \"tunnel\" mode.) The following diagram illustrates AH transport mode positioning for a typical IPv4 packet, on a \"before and after\" basis.",
      "ja": "トランスポートモードでは、AHは、IPヘッダの後等上位層プロトコル、例えば、TCP、UDP、ICMP、前または既に挿入されている他のIPsecヘッダの前に挿入されます。 IPv4の文脈では、これは、IPヘッダ（およびそれに含まれる任意のオプション）の後にAHを配置するための呼び出しが、上位層プロトコルの前に。 （用語「トランスポート」モードはTCPおよびUDPへの使用を制限するように誤解されるべきではないことに注意してください。例えば、ICMPメッセージは、「トランスポート」モードまたは「トンネル」モードのいずれかを使用して送信されるかもしれません。）以下の図は、AHの輸送を示します「前と後」に基づき、一般的なIPv4パケットのためのモードの位置、。"
    },
    {
      "indent": 6,
      "text": "            BEFORE APPLYING AH\n      ----------------------------\nIPv4  |orig IP hdr  |     |      |\n      |(any options)| TCP | Data |\n      ----------------------------",
      "raw": true
    },
    {
      "indent": 6,
      "text": "            AFTER APPLYING AH\n      ---------------------------------\nIPv4  |orig IP hdr  |    |     |      |\n      |(any options)| AH | TCP | Data |\n      ---------------------------------\n      |<------- authenticated ------->|\n           except for mutable fields",
      "raw": true
    },
    {
      "indent": 3,
      "text": "In the IPv6 context, AH is viewed as an end-to-end payload, and thus should appear after hop-by-hop, routing, and fragmentation extension headers. The destination options extension header(s) could appear either before or after the AH header depending on the semantics desired. The following diagram illustrates AH transport mode positioning for a typical IPv6 packet.",
      "ja": "IPv6のコンテキストで、AHは、エンドツーエンドのペイロードと見なされるので、ホップバイホップルーティング、およびフラグメンテーション拡張ヘッダーの後に表示されるべきです。宛先オプション拡張ヘッダ（単数または複数）は、所望のセマンティクスに依存AHヘッダの前または後のいずれかに現れる可能性があります。次の図は、一般的なIPv6パケットのためのAHトランスポートモードの位置を示します。"
    },
    {
      "indent": 6,
      "text": "                 BEFORE APPLYING AH\n      ---------------------------------------\nIPv6  |             | ext hdrs |     |      |\n      | orig IP hdr |if present| TCP | Data |\n      ---------------------------------------",
      "raw": true
    },
    {
      "indent": 6,
      "text": "                AFTER APPLYING AH\n      ------------------------------------------------------------\nIPv6  |             |hop-by-hop, dest*, |    | dest |     |      |\n      |orig IP hdr  |routing, fragment. | AH | opt* | TCP | Data |\n      ------------------------------------------------------------\n      |<---- authenticated except for mutable fields ----------->|",
      "raw": true
    },
    {
      "indent": 17,
      "text": "* = if present, could be before AH, after AH, or both",
      "ja": "* =存在する場合、AHの前、AHの後、あるいはその両方をすることができ"
    },
    {
      "indent": 3,
      "text": "ESP and AH headers can be combined in a variety of modes. The IPsec Architecture document describes the combinations of security associations that must be supported.",
      "ja": "ESPおよびAHヘッダは様々なモードで組み合わせることができます。 IPsecのアーキテクチャ文書はサポートされなければならないセキュリティアソシエーションの組み合わせを説明しています。"
    },
    {
      "indent": 3,
      "text": "Tunnel mode AH may be employed in either hosts or security gateways (or in so-called \"bump-in-the-stack\" or \"bump-in-the-wire\" implementations, as defined in the Security Architecture document). When AH is implemented in a security gateway (to protect transit traffic), tunnel mode must be used. In tunnel mode, the \"inner\" IP header carries the ultimate source and destination addresses, while an \"outer\" IP header may contain distinct IP addresses, e.g., addresses of security gateways. In tunnel mode, AH protects the entire inner IP packet, including the entire inner IP header. The position of AH in tunnel mode, relative to the outer IP header, is the same as for AH in transport mode. The following diagram illustrates AH tunnel mode positioning for typical IPv4 and IPv6 packets.",
      "ja": "トンネルモードAHは、ホストまたはセキュリティゲートウェイのいずれかで使用することができる（いわゆるの「インスタックバンプ」または「バンプ・イン・ザ・ワイヤー」実装は、セキュリティアーキテクチャ文書で定義されています）。 AHは、（通過トラフィックを保護するために）セキュリティゲートウェイに実装されたときに、トンネルモードを使用しなければなりません。 「外部」IPヘッダは別個のIPアドレス、例えば、セキュリティゲートウェイのアドレスを含んでいてもよいしながらトンネルモードでは、「内側」IPヘッダは、最終的な送信元アドレスと宛先アドレスを運びます。トンネルモードでは、AHは、全内部IPヘッダを含む全体の内側IPパケットを、保護します。外側IPヘッダに対して、トンネルモードにおけるAHの位置は、トランスポートモードでのAHと同じです。以下の図は、典型的なIPv4およびIPv6パケットのAHトンネルモードの位置を示します。"
    },
    {
      "indent": 4,
      "text": "      ------------------------------------------------\nIPv4  | new IP hdr* |    | orig IP hdr*  |    |      |\n      |(any options)| AH | (any options) |TCP | Data |\n      ------------------------------------------------\n      |<- authenticated except for mutable fields -->|\n      |           in the new IP hdr                  |",
      "raw": true
    },
    {
      "indent": 4,
      "text": "      --------------------------------------------------------------\nIPv6  |           | ext hdrs*|    |            | ext hdrs*|   |    |\n      |new IP hdr*|if present| AH |orig IP hdr*|if present|TCP|Data|\n      --------------------------------------------------------------\n      |<-- authenticated except for mutable fields in new IP hdr ->|",
      "raw": true
    },
    {
      "indent": 11,
      "text": "* = construction of outer IP hdr/extensions and modification\n    of inner IP hdr/extensions is discussed below.",
      "raw": true
    },
    {
      "indent": 0,
      "text": "3.2 Authentication Algorithms",
      "section_title": true,
      "ja": "3.2認証アルゴリズム"
    },
    {
      "indent": 3,
      "text": "The authentication algorithm employed for the ICV computation is specified by the SA. For point-to-point communication, suitable authentication algorithms include keyed Message Authentication Codes (MACs) based on symmetric encryption algorithms (e.g., DES) or on one-way hash functions (e.g., MD5 or SHA-1). For multicast communication, one-way hash algorithms combined with asymmetric signature algorithms are appropriate, though performance and space considerations currently preclude use of such algorithms. The mandatory-to-implement authentication algorithms are described in Section 5 \"Conformance Requirements\". Other algorithms MAY be supported.",
      "ja": "ICVの計算に使用される認証アルゴリズムはSAによって指定されます。ポイント・ツー・ポイント通信のために、適切な認証アルゴリズムは、対称暗号化アルゴリズム（例えば、DES）または一方向ハッシュ関数（例えば、MD5またはSHA-1）に基づいて、キー付きメッセージ認証コード（MAC）を含みます。性能およびスペースの考慮事項は、現在そのようなアルゴリズムの使用を排除するものでもマルチキャスト通信のために、非対称署名アルゴリズムと組み合わせた一方向ハッシュアルゴリズムは、適切です。実装に必須の認証アルゴリズムは、5章「適合性の要件」で説明されています。他のアルゴリズムをサポートすることができます。"
    },
    {
      "indent": 0,
      "text": "3.3 Outbound Packet Processing",
      "section_title": true,
      "ja": "3.3アウトバウンドパケット処理"
    },
    {
      "indent": 3,
      "text": "In transport mode, the sender inserts the AH header after the IP header and before an upper layer protocol header, as described above. In tunnel mode, the outer and inner IP header/extensions can be inter-related in a variety of ways. The construction of the outer IP header/extensions during the encapsulation process is described in the Security Architecture document.",
      "ja": "上述したように、トランスポートモードでは、送信者は、IPヘッダの後と上位層プロトコルヘッダの前にAHヘッダを挿入します。トンネルモードでは、外側と内側のIPヘッダ/拡張は、様々な方法で相互に関連することができます。カプセル化プロセスの間、外側IPヘッダ/拡張の構成は、セキュリティアーキテクチャ文書に記載されています。"
    },
    {
      "indent": 3,
      "text": "If there is more than one IPsec header/extension required, the order of the application of the security headers MUST be defined by security policy. For simplicity of processing, each IPsec header SHOULD ignore the existence (i.e., not zero the contents or try to predict the contents) of IPsec headers to be applied later. (While a native IP or bump-in-the-stack implementation could predict the contents of later IPsec headers that it applies itself, it won't be possible for it to predict any IPsec headers added by a bump-in-the-wire implementation between the host and the network.)",
      "ja": "必要以上のIPsecヘッダ/拡張がある場合、セキュリティヘッダの適用順序は、セキュリティポリシーによって定義されなければなりません。処理を簡単にするため、各IPsecヘッダ（すなわち、コンテンツを、ゼロまたはコンテンツを予測しようとしない）後で適用するのIPsecヘッダの存在を無視すべきです。 （ネイティブIPまたはバンプ・イン・ザ・スタック実装は、それ自体を適用後のIPsecヘッダの内容を予測できるが、それは、バンプ・イン・ワイヤによって追加任意のIPsecヘッダを予測するために、それができませんホストとネットワークの間で実施。）"
    },
    {
      "indent": 0,
      "text": "3.3.1 Security Association Lookup",
      "section_title": true,
      "ja": "3.3.1セキュリティアソシエーションの検索"
    },
    {
      "indent": 3,
      "text": "AH is applied to an outbound packet only after an IPsec implementation determines that the packet is associated with an SA that calls for AH processing. The process of determining what, if any, IPsec processing is applied to outbound traffic is described in the Security Architecture document.",
      "ja": "AHは、IPsec実装は、パケットがAH処理を要求するSAに関連付けられていることを判断した後にのみ発信パケットに適用されます。もしあれば、IPsec処理がアウトバウンドトラフィックに適用されるものを、決定するプロセスは、セキュリティアーキテクチャ文書に記述されています。"
    },
    {
      "indent": 0,
      "text": "3.3.2 Sequence Number Generation",
      "section_title": true,
      "ja": "3.3.2シーケンス番号の生成"
    },
    {
      "indent": 3,
      "text": "The sender's counter is initialized to 0 when an SA is established. The sender increments the Sequence Number for this SA and inserts the new value into the Sequence Number Field. Thus the first packet sent using a given SA will have a Sequence Number of 1.",
      "ja": "SAが確立されたときに、送信者のカウンタが0に初期化されます。送信側はこのSAのシーケンス番号をインクリメントし、シーケンス番号フィールドに新しい値を挿入します。したがって、所与のSAを使用して送信される最初のパケットは、1のシーケンス番号を有することになります。"
    },
    {
      "indent": 3,
      "text": "If anti-replay is enabled (the default), the sender checks to ensure that the counter has not cycled before inserting the new value in the Sequence Number field. In other words, the sender MUST NOT send a packet on an SA if doing so would cause the Sequence Number to cycle. An attempt to transmit a packet that would result in Sequence Number overflow is an auditable event. (Note that this approach to Sequence Number management does not require use of modular arithmetic.)",
      "ja": "抗リプレイが（デフォルト）有効になっている場合は、送信者のチェックはカウンタがシーケンス番号フィールドに新しい値を挿入する前に循環していないことを確認します。そうすることがサイクルにシーケンス番号を引き起こす言い換えれば、送信者は、SAにパケットを送ってはいけません。シーケンス番号のオーバーフローを引き起こすようなパケットを送信しようとする試みは、監査対象イベントとなります。 （配列番号管理に対するこのアプローチは、剰余演算の使用を必要としないことに注意してください。）"
    },
    {
      "indent": 3,
      "text": "The sender assumes anti-replay is enabled as a default, unless otherwise notified by the receiver (see 3.4.3). Thus, if the counter has cycled, the sender will set up a new SA and key (unless the SA was configured with manual key management).",
      "ja": "送信者は、そうでない場合は受信機（3.4.3を参照）により通知しない限り、アンチリプレイは、デフォルトで有効になっている前提としています。カウンタが循環している場合（SAは手動鍵管理で設定されていない限り）このように、送信側は新しいSAと鍵を設定します。"
    },
    {
      "indent": 3,
      "text": "If anti-replay is disabled, the sender does not need to monitor or reset the counter, e.g., in the case of manual key management (see Section 5.) However, the sender still increments the counter and when it reaches the maximum value, the counter rolls over back to zero.",
      "ja": "アンチリプレイが無効になっている場合、送信者は手動鍵管理の場合には、例えば、カウンタの監視やリセットする必要はありません（5章を参照してください）。ただし、送信者はまだカウンタをインクリメントし、それが最大値に達した場合カウンタがゼロに戻します。"
    },
    {
      "indent": 0,
      "text": "3.3.3 Integrity Check Value Calculation",
      "section_title": true,
      "ja": "3.3.3整合性チェック値の計算"
    },
    {
      "indent": 3,
      "text": "The AH ICV is computed over: o IP header fields that are either immutable in transit or that are predictable in value upon arrival at the endpoint for the AH SA o the AH header (Next Header, Payload Len, Reserved, SPI, Sequence Number, and the Authentication Data (which is set to zero for this computation), and explicit padding bytes (if any)) o the upper level protocol data, which is assumed to be immutable in transit",
      "ja": "AH ICVがにわたって計算される：輸送中の不変のいずれかであるか、またはAHヘッダーO AH SA（次ヘッダ、ペイロードレン、予約、SPI、シーケンス番号のためのエンドポイントでの到着時値に予測可能であることIPヘッダフィールドO、トランジットに不変であると仮定される上位プロトコルデータ、O（この計算のためにゼロに設定されている）認証データ、および、明示的なパディングバイト（もしあれば））"
    },
    {
      "indent": 0,
      "text": "3.3.3.1 Handling Mutable Fields",
      "section_title": true,
      "ja": "変更可能なフィールドの取り扱い3.3.3.1"
    },
    {
      "indent": 3,
      "text": "If a field may be modified during transit, the value of the field is set to zero for purposes of the ICV computation. If a field is mutable, but its value at the (IPsec) receiver is predictable, then that value is inserted into the field for purposes of the ICV calculation. The Authentication Data field is also set to zero in preparation for this computation. Note that by replacing each field's value with zero, rather than omitting the field, alignment is preserved for the ICV calculation. Also, the zero-fill approach ensures that the length of the fields that are so handled cannot be changed during transit, even though their contents are not explicitly covered by the ICV.",
      "ja": "フィールドが通過中に変更することができる場合、フィールドの値がICV計算のためにゼロに設定されます。フィールドが変更可能であるが、（IPsec）の受信機で、その値が予測可能である場合、その値は、ICV計算の目的のためにフィールドに挿入されます。認証データフィールドは、この計算の準備のためにゼロに設定されています。ゼロで各フィールドの値を置き換えるのではなく、フィールドを省略することによって、アライメントがICV計算のために保存されることに留意されたいです。また、ゼロ埋めアプローチはそう扱われるフィールドの長さは、その内容が明示的にICVによってカバーされていないにも関わらず、輸送中に変更することができないことを保証します。"
    },
    {
      "indent": 3,
      "text": "As a new extension header or IPv4 option is created, it will be defined in its own RFC and SHOULD include (in the Security Considerations section) directions for how it should be handled when calculating the AH ICV. If the IP (v4 or v6) implementation encounters an extension header that it does not recognize, it will discard the packet and send an ICMP message. IPsec will never see the packet. If the IPsec implementation encounters an IPv4 option that it does not recognize, it should zero the whole option, using the second byte of the option as the length. IPv6 options (in Destination extension headers or Hop by Hop extension header) contain a flag indicating mutability, which determines appropriate processing for such options.",
      "ja": "新しい拡張ヘッダまたはIPv4オプションが作成されると、それはそれ自身のRFCに定義され、（セキュリティ上の考慮事項のセクションで）AH ICVを計算するときに処理する方法のための指示を含むべきです。 IP（V4またはV6）の実装は、それが認識されない拡張ヘッダを検出した場合、そのパケットを破棄し、ICMPメッセージを送信します。 IPsecは、パケットを見ることはありません。 IPsec実装は、それが認識しないことのIPv4オプションに遭遇した場合、それは長さオプションの第2バイトを使用して、全体のオプションをゼロにする必要があります。 （ホップ拡張ヘッダによって宛先拡張ヘッダまたはホップで）IPv6オプションは、オプションの適切な処理を決定する可変性を示すフラグを含みます。"
    },
    {
      "indent": 0,
      "text": "3.3.3.1.1 ICV Computation for IPv4",
      "section_title": true,
      "ja": "IPv4の3.3.3.1.1 ICV計算"
    },
    {
      "indent": 0,
      "text": "3.3.3.1.1.1 Base Header Fields",
      "section_title": true,
      "ja": "3.3.3.1.1.1基本ヘッダフィールド"
    },
    {
      "indent": 3,
      "text": "The IPv4 base header fields are classified as follows:",
      "ja": "次のようにIPv4の基本ヘッダフィールドが分​​類されます。"
    },
    {
      "indent": 3,
      "text": "Immutable Version Internet Header Length Total Length Identification Protocol (This should be the value for AH.) Source Address Destination Address (without loose or strict source routing)",
      "ja": "不変のバージョンインターネットヘッダ長全長識別プロトコル（緩んでいるか、厳密なソースルーティングなし）（これは、AHの値でなければなりません。）ソースアドレス宛先アドレス"
    },
    {
      "indent": 3,
      "text": "Mutable but predictable Destination Address (with loose or strict source routing)",
      "ja": "（緩んでいるか、厳密なソースルーティングで）可変だが予測可能Destination Address"
    },
    {
      "indent": 3,
      "text": "Mutable (zeroed prior to ICV calculation) Type of Service (TOS) Flags Fragment Offset Time to Live (TTL) Header Checksum",
      "ja": "サービスの変更可能（事前ICV計算にゼロ）タイプ（TOS）フラグフラグメント生存時間（TTL）ヘッダチェックサムオフセット"
    },
    {
      "indent": 6,
      "text": "TOS -- This field is excluded because some routers are known to change the value of this field, even though the IP specification does not consider TOS to be a mutable header field.",
      "ja": "TOSは - 一部のルータは、IPの仕様が変更可能なヘッダフィールドであることをTOSを考慮していないにもかかわらず、このフィールドの値を変更することが知られているため、このフィールドは除外されています。"
    },
    {
      "indent": 6,
      "text": "Flags -- This field is excluded since an intermediate router might set the DF bit, even if the source did not select it.",
      "ja": "フラグ - 中間ルータは、ソースがそれを選択しなかった場合でも、DFビットを設定することもできますので、このフィールドは除外されています。"
    },
    {
      "indent": 6,
      "text": "Fragment Offset -- Since AH is applied only to non-fragmented IP packets, the Offset Field must always be zero, and thus it is excluded (even though it is predictable).",
      "ja": "フラグメントオフセット -  AHは、唯一の非断片化されたIPパケットに適用されるので、オフセットフィールドは常にゼロでなければならず、従って（それが予測可能であっても）は除外されます。"
    },
    {
      "indent": 6,
      "text": "TTL -- This is changed en-route as a normal course of processing by routers, and thus its value at the receiver is not predictable by the sender.",
      "ja": "TTL  - これは専用経路ルータの処理の通常の過程のように変更されるので、受信機でその値が送信者によって予測できません。"
    },
    {
      "indent": 6,
      "text": "Header Checksum -- This will change if any of these other fields changes, and thus its value upon reception cannot be predicted by the sender.",
      "ja": "ヘッダチェックサム - これらの他のフィールドの変更のいずれかの場合、これは変更されますので、受信時に、その値は、送信者が予測することはできません。"
    },
    {
      "indent": 0,
      "text": "3.3.3.1.1.2 Options",
      "section_title": true,
      "ja": "3.3.3.1.1.2オプション"
    },
    {
      "indent": 3,
      "text": "For IPv4 (unlike IPv6), there is no mechanism for tagging options as mutable in transit. Hence the IPv4 options are explicitly listed in Appendix A and classified as immutable, mutable but predictable, or mutable. For IPv4, the entire option is viewed as a unit; so even though the type and length fields within most options are immutable in transit, if an option is classified as mutable, the entire option is zeroed for ICV computation purposes.",
      "ja": "（IPv6のとは違って）IPv4の場合、輸送中の可変などのオプションをタグ付けするためのメカニズムがありません。従ってIPv4オプションが明示的に、付録Aに記載されていると、不変可変だが予測可能、または可変として分類されます。 IPv4の場合、全体のオプションは、ユニットとして見られます。ほとんどのオプション内のタイプと長さフィールドは、輸送中に不変であってもオプションは可変として分類されている場合ので、全体のオプションはICV計算のためにゼロにされます。"
    },
    {
      "indent": 0,
      "text": "3.3.3.1.2 ICV Computation for IPv6",
      "section_title": true,
      "ja": "IPv6の3.3.3.1.2 ICV計算"
    },
    {
      "indent": 0,
      "text": "3.3.3.1.2.1 Base Header Fields",
      "section_title": true,
      "ja": "3.3.3.1.2.1基本ヘッダフィールド"
    },
    {
      "indent": 3,
      "text": "The IPv6 base header fields are classified as follows:",
      "ja": "次のようにIPv6の基本ヘッダフィールドが分​​類されます。"
    },
    {
      "indent": 3,
      "text": "Immutable Version Payload Length Next Header (This should be the value for AH.) Source Address Destination Address (without Routing Extension Header)",
      "ja": "不変のバージョンのペイロード長次ヘッダ（ルーティング拡張ヘッダなし）（これは、AHの値でなければなりません。）ソースアドレス宛先アドレス"
    },
    {
      "indent": 3,
      "text": "Mutable but predictable Destination Address (with Routing Extension Header)",
      "ja": "（ルーティング拡張ヘッダ付き）可変だが予測可能Destination Address"
    },
    {
      "indent": 3,
      "text": "Mutable (zeroed prior to ICV calculation) Class Flow Label Hop Limit",
      "ja": "可変（前ICV計算にゼロ）クラスフローラベルホップ制限"
    },
    {
      "indent": 0,
      "text": "3.3.3.1.2.2 Extension Headers Containing Options",
      "section_title": true,
      "ja": "オプションを含む3.3.3.1.2.2拡張ヘッダ"
    },
    {
      "indent": 3,
      "text": "IPv6 options in the Hop-by-Hop and Destination Extension Headers contain a bit that indicates whether the option might change (unpredictably) during transit. For any option for which contents may change en-route, the entire \"Option Data\" field must be treated as zero-valued octets when computing or verifying the ICV. The Option Type and Opt Data Len are included in the ICV calculation. All options for which the bit indicates immutability are included in the ICV calculation. See the IPv6 specification [DH95] for more information.",
      "ja": "でIPv6オプション拡張ヘッダーオプションが輸送中（予測できない）変更される可能性があるかどうかを示すビットが含まれているホップバイホップと宛先。 ICVを計算または検証するとき内容は、EN-経路変更することができるため、任意のオプションのために、全体の「オプションデータ」フィールドは、ゼロ値のオクテットとして扱わなければなりません。オプションタイプとオプトデータレンは、ICV計算に含まれています。ビットは不変を示しているすべてのオプションはICV計算に含まれています。詳細については、IPv6の仕様[DH95]を参照してください。"
    },
    {
      "indent": 0,
      "text": "3.3.3.1.2.3 Extension Headers Not Containing Options",
      "section_title": true,
      "ja": "3.3.3.1.2.3拡張ヘッダーには、オプションを含みません"
    },
    {
      "indent": 3,
      "text": "The IPv6 extension headers that do not contain options are explicitly listed in Appendix A and classified as immutable, mutable but predictable, or mutable.",
      "ja": "オプションを含まないIPv6拡張ヘッダは、明示的に、付録Aに記載されていると、不変、可変だが予測可能、可変として分類されています。"
    },
    {
      "indent": 0,
      "text": "3.3.3.2 Padding",
      "section_title": true,
      "ja": "3.3.3.2パディング"
    },
    {
      "indent": 0,
      "text": "3.3.3.2.1 Authentication Data Padding",
      "section_title": true,
      "ja": "3.3.3.2.1認証データパディング"
    },
    {
      "indent": 3,
      "text": "As mentioned in section 2.6, the Authentication Data field explicitly includes padding to ensure that the AH header is a multiple of 32 bits (IPv4) or 64 bits (IPv6). If padding is required, its length is determined by two factors:",
      "ja": "セクション2.6で述べたように、認証データフィールドは、明示的にAHヘッダが32ビット（IPv4）の64ビット（IPv6）のの倍数であることを確実にするためにパディングを含みます。パディングが必要な場合は、その長さは2つの要素によって決定されます。"
    },
    {
      "indent": 13,
      "text": "- the length of the ICV\n- the IP protocol version (v4 or v6)",
      "raw": true
    },
    {
      "indent": 3,
      "text": "For example, if the output of the selected algorithm is 96-bits, no padding is required for either IPv4 or for IPv6. However, if a different length ICV is generated, due to use of a different algorithm, then padding may be required depending on the length and IP protocol version. The content of the padding field is arbitrarily selected by the sender. (The padding is arbitrary, but need not be random to achieve security.) These padding bytes are included in the Authentication Data calculation, counted as part of the Payload Length, and transmitted at the end of the Authentication Data field to enable the receiver to perform the ICV calculation.",
      "ja": "選択されたアルゴリズムの出力は96ビットである場合、例えば、パディングは、IPv4のいずれかまたはIPv6のために必要とされません。異なる長さのICVが生成される場合は、異なるアルゴリズムを使用することにより、その後パディング長さとIPプロトコルのバージョンに応じて必要とされ得ます。パディングフィールドの内容は、任意の送信者によって選択されています。 （パディングは任意であるが、セキュリティを達成するためにランダムである必要はない。）これらのパディングバイトは、認証データの計算に含まれるペイロード長の一部としてカウントされ、受信機を有効にする認証データフィールドの終わりに送信されますICV計算を行います。"
    },
    {
      "indent": 0,
      "text": "3.3.3.2.2 Implicit Packet Padding",
      "section_title": true,
      "ja": "3.3.3.2.2暗黙のパケットパディング"
    },
    {
      "indent": 3,
      "text": "For some authentication algorithms, the byte string over which the ICV computation is performed must be a multiple of a blocksize specified by the algorithm. If the IP packet length (including AH) does not match the blocksize requirements for the algorithm, implicit padding MUST be appended to the end of the packet, prior to ICV computation. The padding octets MUST have a value of zero. The blocksize (and hence the length of the padding) is specified by the algorithm specification. This padding is not transmitted with the packet. Note that MD5 and SHA-1 are viewed as having a 1-byte blocksize because of their internal padding conventions.",
      "ja": "いくつかの認証アルゴリズムのために、ICV演算が行われた上のバイト列は、アルゴリズムで指定されたブロックサイズの倍数でなければなりません。 （AHを含む）は、IPパケットの長さはアルゴリズムのブロックサイズ要件と一致しない場合、暗黙のパディング前ICV計算に、パケットの最後に追加されなければなりません。パディングオクテットはゼロの値を持つ必要があります。ブロックサイズ（従って、パディングの長さ）は、アルゴリズムの仕様によって指定されます。このパディングはパケットで送信されていません。 MD5とSHA-1は、それらの内部パディング規則の1バイトのブロックサイズを有するとみなされることに留意されたいです。"
    },
    {
      "indent": 0,
      "text": "3.3.4 Fragmentation",
      "section_title": true,
      "ja": "3.3.4フラグメンテーション"
    },
    {
      "indent": 3,
      "text": "If required, IP fragmentation occurs after AH processing within an IPsec implementation. Thus, transport mode AH is applied only to whole IP datagrams (not to IP fragments). An IP packet to which AH has been applied may itself be fragmented by routers en route, and such fragments must be reassembled prior to AH processing at a receiver. In tunnel mode, AH is applied to an IP packet, the payload of which may be a fragmented IP packet. For example, a security gateway or a \"bump-in-the-stack\" or \"bump-in-the-wire\" IPsec implementation (see the Security Architecture document for details) may apply tunnel mode AH to such fragments.",
      "ja": "必要な場合は、IPフラグメンテーションは、IPsec実装内でAH処理後に発生します。このように、トランスポートモードAHは、（断片をIPにない）IPデータグラム全体に対してのみ適用されます。 AHが適用されたIPパケット自体が途中ルータによって断片化することができ、そのようなフラグメントは、受信機での前AH処理を再組み立てしなければなりません。トンネルモードでは、AHは、IPパケットに適用され、ペイロードは、その断片化されたIPパケットであってもよいです。例えば、セキュリティゲートウェイまたは「イン・ザ・スタック・バンプ」または「バンプ・イン・ザ・ワイヤ」IPsec実装（詳細については、セキュリティアーキテクチャ文書を参照）は、このようなフラグメントにトンネルモードAHを適用することができます。"
    },
    {
      "indent": 0,
      "text": "3.4 Inbound Packet Processing",
      "section_title": true,
      "ja": "3.4インバウンドパケット処理"
    },
    {
      "indent": 3,
      "text": "If there is more than one IPsec header/extension present, the processing for each one ignores (does not zero, does not use) any IPsec headers applied subsequent to the header being processed.",
      "ja": "複数のIPsecヘッダ/拡張が存在する場合、それぞれ無視する処理が任意のIPsecヘッダは、ヘッダが処理されるまで、後続の適用（使用しないゼロでないん）。"
    },
    {
      "indent": 0,
      "text": "3.4.1 Reassembly",
      "section_title": true,
      "ja": "3.4.1再構築"
    },
    {
      "indent": 3,
      "text": "If required, reassembly is performed prior to AH processing. If a packet offered to AH for processing appears to be an IP fragment, i.e., the OFFSET field is non-zero or the MORE FRAGMENTS flag is set, the receiver MUST discard the packet; this is an auditable event. The audit log entry for this event SHOULD include the SPI value, date/time, Source Address, Destination Address, and (in IPv6) the Flow ID.",
      "ja": "必要な場合は、再組み立ては、AH処理の前に行われます。処理のためにAHに提供されるパケットがIP断片であるように見える場合、すなわち、オフセットフィールドが非ゼロであるか、またはそれ以上のフラグメントフラグがセットされ、受信機は、パケットを破棄しなければなりません。これは監査対象イベントとなります。このイベントの監査ログエントリには、SPI値、日付/時刻、送信元アドレス、宛先アドレス、および（IPv6では）フローIDを含むべきです。"
    },
    {
      "indent": 3,
      "text": "NOTE: For packet reassembly, the current IPv4 spec does NOT require either the zero'ing of the OFFSET field or the clearing of the MORE FRAGMENTS flag. In order for a reassembled packet to be processed by IPsec (as opposed to discarded as an apparent fragment), the IP code must do these two things after it reassembles a packet.",
      "ja": "注：パケットの再構成のために、現在のIPv4の仕様では、オフセットフィールドのzero'ing以上のフラグメントフラグのクリアのいずれかを必要としません。それは、パケットを再構成した後にIPsec（見かけの断片として破棄ではなく）によって処理される再構成されたパケットのためのためには、IPコードは、これらの2つのことを行う必要があります。"
    },
    {
      "indent": 0,
      "text": "3.4.2 Security Association Lookup",
      "section_title": true,
      "ja": "3.4.2セキュリティアソシエーションの検索"
    },
    {
      "indent": 3,
      "text": "Upon receipt of a packet containing an IP Authentication Header, the receiver determines the appropriate (unidirectional) SA, based on the destination IP address, security protocol (AH), and the SPI. (This process is described in more detail in the Security Architecture document.) The SA indicates whether the Sequence Number field will be checked, specifies the algorithm(s) employed for ICV computation, and indicates the key(s) required to validate the ICV.",
      "ja": "IP認証ヘッダを含むパケットを受信すると、受信機は、宛先IPアドレス、セキュリティプロトコル（AH）、およびSPIに基づいて、適切な（一方向）SAを決定します。 （このプロセスはセキュリティアーキテクチャ文書でより詳細に記載されている。）SAは、ICVの計算に使用されるアルゴリズム（複数可）を指定し、ICVの検証に必要な鍵を示し、シーケンス番号フィールドがチェックされるかどうかを示します。"
    },
    {
      "indent": 3,
      "text": "If no valid Security Association exists for this session (e.g., the receiver has no key), the receiver MUST discard the packet; this is an auditable event. The audit log entry for this event SHOULD include the SPI value, date/time, Source Address, Destination Address, and (in IPv6) the Flow ID.",
      "ja": "有効なセキュリティアソシエーション（例えば、受信機が鍵を持っていない場合）、このセッションのために存在しない場合、受信機はパケットを捨てなければなりません。これは監査対象イベントとなります。このイベントの監査ログエントリには、SPI値、日付/時刻、送信元アドレス、宛先アドレス、および（IPv6では）フローIDを含むべきです。"
    },
    {
      "indent": 0,
      "text": "3.4.3 Sequence Number Verification",
      "section_title": true,
      "ja": "3.4.3シーケンス番号の検証"
    },
    {
      "indent": 3,
      "text": "All AH implementations MUST support the anti-replay service, though its use may be enabled or disabled by the receiver on a per-SA basis. (Note that there are no provisions for managing transmitted Sequence Number values among multiple senders directing traffic to a single SA (irrespective of whether the destination address is unicast, broadcast, or multicast). Thus the anti-replay service SHOULD NOT be used in a multi-sender environment that employs a single SA.)",
      "ja": "その使用はSA毎に受信側によって有効または無効にすることができるものの、すべてのAH実装は、アンチリプレイサービスをサポートしなければなりません。かかわらず、宛先アドレスがユニキャスト、ブロードキャスト、またはマルチキャストであるか否かの単一SA（にトラフィックを向ける複数の送信者の間で送信されるシーケンス番号値を管理するための規定が存在しないこと（したがって、アンチリプレイサービスで使用すべきではない。）注マルチ差出人単一SAを採用した環境。）"
    },
    {
      "indent": 3,
      "text": "If the receiver does not enable anti-replay for an SA, no inbound checks are performed on the Sequence Number. However, from the perspective of the sender, the default is to assume that anti-replay is enabled at the receiver. To avoid having the sender do unnecessary sequence number monitoring and SA setup (see section 3.3.2), if an SA establishment protocol such as IKE is employed, the receiver SHOULD notify the sender, during SA establishment, if the receiver will not provide anti-replay protection.",
      "ja": "受信側がSAのためのアンチリプレイを有効にしない場合、インバウンドチェックはシーケンス番号に実行されません。しかし、送信者の視点から、デフォルトではアンチリプレイが受信機で有効になっていると仮定することです。受信機が反を提供しない場合、送信者は、IKEなどのSA確立プロトコルが使用される場合、不必要なシーケンス番号監視およびSAのセットアップ（セクション3.3.2を参照）を行うことを回避するために、受信機は、SAの確立中に送信者に通知すべきです-replay保護。"
    },
    {
      "indent": 3,
      "text": "If the receiver has enabled the anti-replay service for this SA, the receiver packet counter for the SA MUST be initialized to zero when the SA is established. For each received packet, the receiver MUST verify that the packet contains a Sequence Number that does not duplicate the Sequence Number of any other packets received during the life of this SA. This SHOULD be the first AH check applied to a packet after it has been matched to an SA, to speed rejection of duplicate packets.",
      "ja": "受信側がこのSAのためのアンチリプレイサービスを有効にしている場合はSAが確立されると、SAのための受信パケットカウンタはゼロに初期化されなければなりません。それぞれがパケットを受信するために、受信機は、パケットがこのSAの寿命の間に受信した他のパケットのシーケンス番号を重複しないシーケンス番号が含まれていることを確かめなければなりません。これは、重複パケットの拒否を高速化するために、SAに一致した後にパケットに適用される最初のAHチェックであるべきである（SHOULD）。"
    },
    {
      "indent": 3,
      "text": "Duplicates are rejected through the use of a sliding receive window. (How the window is implemented is a local matter, but the following text describes the functionality that the implementation must exhibit.) A MINIMUM window size of 32 MUST be supported; but a window size of 64 is preferred and SHOULD be employed as the default. Another window size (larger than the MINIMUM) MAY be chosen by the receiver. (The receiver does NOT notify the sender of the window size.)",
      "ja": "重複は、受信スライディングウィンドウを使用して拒否されます。 （ウィンドウの実装方法はローカルの問題ですが、次のテキストは、実装が示さなければならない機能について説明します。）32の最小ウィンドウサイズをサポートしなければなりません。しかし、64のウィンドウサイズが好まれ、デフォルトとして使用されるべきである（SHOULD）。別のウィンドウサイズ（最小値よりも大きい）は、受信機によって選択されてもよいです。 （受信機は、ウィンドウサイズの送信者に通知しません。）"
    },
    {
      "indent": 3,
      "text": "The \"right\" edge of the window represents the highest, validated Sequence Number value received on this SA. Packets that contain Sequence Numbers lower than the \"left\" edge of the window are rejected. Packets falling within the window are checked against a list of received packets within the window. An efficient means for performing this check, based on the use of a bit mask, is described in the Security Architecture document.",
      "ja": "ウィンドウの「右」端は、このSAで受信した最高の、検証済みのシーケンス番号値を表しています。ウィンドウの「左」端より低いシーケンス番号を含むパケットは拒否されます。ウィンドウ内に入るパケットは、ウィンドウ内で受信したパケットのリストと照合されます。ビットマスクの使用に基づいて、このチェックを実行するための効率的な手段は、セキュリティアーキテクチャ文書に記述されています。"
    },
    {
      "indent": 3,
      "text": "If the received packet falls within the window and is new, or if the packet is to the right of the window, then the receiver proceeds to ICV verification. If the ICV validation fails, the receiver MUST discard the received IP datagram as invalid; this is an auditable event. The audit log entry for this event SHOULD include the SPI value, date/time, Source Address, Destination Address, the Sequence Number, and (in IPv6) the Flow ID. The receive window is updated only if the ICV verification succeeds.",
      "ja": "受信したパケットは、ウィンドウ内に収まると新しいもの、またはパケットは、ウィンドウの右側にある場合、受信機は、ICVの検証に進む。場合ICVの検証が失敗した場合、受信機は無効として、受信したIPデータグラムを捨てなければなりません。これは監査対象イベントとなります。このイベントの監査ログエントリには、SPI値、日付/時刻、送信元アドレス、宛先アドレス、シーケンス番号、および（IPv6では）フローIDを含むべきです。受信ウィンドウは、ICVの検証に成功した場合にのみ更新されます。"
    },
    {
      "indent": 3,
      "text": "DISCUSSION:",
      "ja": "討論："
    },
    {
      "indent": 6,
      "text": "Note that if the packet is either inside the window and new, or is outside the window on the \"right\" side, the receiver MUST authenticate the packet before updating the Sequence Number window data.",
      "ja": "パケットがウィンドウの内側と新しいのいずれかである、または「右」側の窓の外にある場合、受信機は、シーケンス番号のウィンドウのデータを更新する前にパケットを認証しなければいけないことに注意してください。"
    },
    {
      "indent": 0,
      "text": "3.4.4 Integrity Check Value Verification",
      "section_title": true,
      "ja": "3.4.4整合性チェック値の検証"
    },
    {
      "indent": 3,
      "text": "The receiver computes the ICV over the appropriate fields of the packet, using the specified authentication algorithm, and verifies that it is the same as the ICV included in the Authentication Data field of the packet. Details of the computation are provided below.",
      "ja": "受信機は、指定された認証アルゴリズムを使用して、パケットの適切なフィールド上にICVを計算し、それがパケットの認証データフィールドに含まれるICVと同じであることを検証します。計算の詳細については、以下に提供されます。"
    },
    {
      "indent": 3,
      "text": "If the computed and received ICV's match, then the datagram is valid, and it is accepted. If the test fails, then the receiver MUST discard the received IP datagram as invalid; this is an auditable event. The audit log entry SHOULD include the SPI value, date/time received, Source Address, Destination Address, and (in IPv6) the Flow ID.",
      "ja": "計算され、ICVの一致を受け取った場合、データグラムは有効であり、そしてそれが受け入れられています。テストが失敗した場合、受信機は無効として、受信したIPデータグラムを捨てなければなりません。これは監査対象イベントとなります。監査ログエントリには、SPI値、受け取った日付/時刻、送信元アドレス、宛先アドレス、および（IPv6では）フローIDを含むべきです。"
    },
    {
      "indent": 3,
      "text": "DISCUSSION:",
      "ja": "討論："
    },
    {
      "indent": 6,
      "text": "Begin by saving the ICV value and replacing it (but not any Authentication Data padding) with zero. Zero all other fields that may have been modified during transit. (See section 3.3.3.1 for a discussion of which fields are zeroed before performing the ICV calculation.) Check the overall length of the packet, and if it requires implicit padding based on the requirements of the authentication algorithm, append zero-filled bytes to the end of the packet as required. Perform the ICV computation and compare the result with the saved value, using the comparison rules defined by the algorithm specification. (For example, if a digital signature and one-way hash are used for the ICV computation, the matching process is more complex.)",
      "ja": "ゼロ（任意の認証データのパディングではなく）ICV値を保存し、それを置き換えることから始めます。輸送中に変更された可能性がゼロで他のすべてのフィールド。 （フィールドはICV計算を実行する前にゼロにされた議論のセクション3.3.3.1を参照）、パケットの全体の長さを確認し、それが認証アルゴリズムの要件に基づいて暗黙のパディングが必要な場合、ゼロで満たされたバイトを追加必要に応じてパケットの終わり。 ICVの計算を実行し、アルゴリズムの仕様によって定義された比較ルールを使用して、保存された値と結果を比較します。 （デジタル署名と一方向ハッシュがICVの計算に使用される場合、例えば、マッチング処理はより複雑です。）"
    },
    {
      "indent": 0,
      "text": "4. Auditing",
      "section_title": true,
      "ja": "4.監査"
    },
    {
      "indent": 3,
      "text": "Not all systems that implement AH will implement auditing. However, if AH is incorporated into a system that supports auditing, then the AH implementation MUST also support auditing and MUST allow a system administrator to enable or disable auditing for AH. For the most part, the granularity of auditing is a local matter. However, several auditable events are identified in this specification and for each of these events a minimum set of information that SHOULD be included in an audit log is defined. Additional information also MAY be included in the audit log for each of these events, and additional events, not explicitly called out in this specification, also MAY result in audit log entries. There is no requirement for the receiver to transmit any message to the purported sender in response to the detection of an auditable event, because of the potential to induce denial of service via such action.",
      "ja": "ないAHを実装するすべてのシステムが監査機能を実装します。 AHは、監査をサポートするシステムに組み込まれている場合は、その後、AHの実装には、監査をサポートしなければならないし、システム管理者がAHの監査を有効または無効にできるようにしなければなりません。ほとんどの部分については、監査の粒度は、ローカルの問題です。しかし、いくつかの監査可能なイベントは、本明細書および監査ログに含まれるべき情報の最小セットが定義されているこれらのイベントのそれぞれに対して識別されます。追加情報は、また、これらのイベント、および追加のイベントごとに、監査ログに含まれるかもしれ、明示的にも監査ログエントリになることがあり、この仕様で呼び出しません。受信機があるため、このような作用を介してサービス拒否攻撃を誘発する可能性を、監査可能なイベントの検出に応答して主張送信者へのメッセージを送信するための要件はありません。"
    },
    {
      "indent": 0,
      "text": "5. Conformance Requirements",
      "section_title": true,
      "ja": "5.適合要件"
    },
    {
      "indent": 3,
      "text": "Implementations that claim conformance or compliance with this specification MUST fully implement the AH syntax and processing described here and MUST comply with all requirements of the Security Architecture document. If the key used to compute an ICV is manually distributed, correct provision of the anti-replay service would require correct maintenance of the counter state at the sender, until the key is replaced, and there likely would be no automated recovery provision if counter overflow were imminent. Thus a compliant implementation SHOULD NOT provide this service in conjunction with SAs that are manually keyed. A compliant AH implementation MUST support the following mandatory-to-implement algorithms:",
      "ja": "この仕様に準拠する実装は完全にここで説明するAHの構文と処理を実装しなければならないし、セキュリティアーキテクチャ文書のすべての要件を遵守しなければなりません。 ICVを計算するために使用されるキーを手動で分散されている場合、アンチリプレイサービスの正しい提供は鍵が交換されるまで、送信側のカウンタ状態の正確なメンテナンスを必要とする、とそうであれば何の自動回復の規定はないだろうカウンタのオーバーフロー目前に迫りました。このように準拠した実装は、手動で鍵管理されるSAで、このサービスを提供すべきではありません。準拠したAHの実装には、次の実装に必須のアルゴリズムをサポートしなければなりません："
    },
    {
      "indent": 13,
      "text": "- HMAC with MD5 [MG97a]\n- HMAC with SHA-1 [MG97b]",
      "raw": true
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "Security is central to the design of this protocol, and these security considerations permeate the specification. Additional security-relevant aspects of using the IPsec protocol are discussed in the Security Architecture document.",
      "ja": "セキュリティは、このプロトコルの設計の中心であり、これらのセキュリティ上の考慮事項は仕様に浸透します。 IPsecプロトコルを使用しての追加のセキュリティ関連の側面は、セキュリティアーキテクチャ文書で説明されています。"
    },
    {
      "indent": 1,
      "text": "7. Differences from",
      "section_title": true,
      "ja": "から7の違い"
    },
    {
      "indent": 3,
      "text": "This specification of AH differs from RFC 1826 [ATK95] in several important respects, but the fundamental features of AH remain intact. One goal of the revision of RFC 1826 was to provide a complete framework for AH, with ancillary RFCs required only for algorithm specification. For example, the anti-replay service is now an integral, mandatory part of AH, not a feature of a transform defined in another RFC. Carriage of a sequence number to support this service is now required at all times. The default algorithms required for interoperability have been changed to HMAC with MD5 or SHA-1 (vs. keyed MD5), for security reasons. The list of IPv4 header fields excluded from the ICV computation has been expanded to include the OFFSET and FLAGS fields.",
      "ja": "AHのこの仕様は、いくつかの重要な点でRFC 1826 [ATK95]とは異なりますが、AHの基本的な機能はそのまま残ります。 RFC 1826の改定の1つの目標は、アルゴリズムの仕様のために必要な補助的なRFCに、AHのための完全なフレームワークを提供することでした。例えば、アンチリプレイサービスは現在、AHの不可欠な、必須部分ではなく、別のRFCで定義された変換の機能です。このサービスをサポートするためのシーケンス番号のキャリッジは今、すべての回で必要とされます。相互運用性のために必要なデフォルトのアルゴリズムは、セキュリティ上の理由から、MD5やSHA-1（対キー付きMD5）でHMACに変更されました。 ICVの計算から除外されたIPv4ヘッダフィールドのリストは、オフセットおよびフラグフィールドを含むように拡張されています。"
    },
    {
      "indent": 3,
      "text": "Another motivation for revision was to provide additional detail and clarification of subtle points. This specification provides rationale for exclusion of selected IPv4 header fields from AH coverage and provides examples on positioning of AH in both the IPv4 and v6 contexts. Auditing requirements have been clarified in this version of the specification. Tunnel mode AH was mentioned only in passing in RFC 1826, but now is a mandatory feature of AH. Discussion of interactions with key management and with security labels have been moved to the Security Architecture document.",
      "ja": "改訂のためのもう一つの動機は、追加の詳細と微妙なポイントの明確化を提供することでした。この仕様は、AHカバレッジから選択されたIPv4ヘッダフィールドの排除のための根拠を提供し、IPv4とv6のコンテキストの両方におけるAHの位置に例を提供します。監査要件は、仕様のこのバージョンでは明らかにされています。トンネルモードAHだけRFC 1826に渡すことに言及したが、今AHの必須機能がありました。キー管理とセキュリティラベルとの相互作用の議論は、セキュリティアーキテクチャ文書に移動されました。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "For over 3 years, this document has evolved through multiple versions and iterations. During this time, many people have contributed significant ideas and energy to the process and the documents themselves. The authors would like to thank Karen Seo for providing extensive help in the review, editing, background research, and coordination for this version of the specification. The authors would also like to thank the members of the IPsec and IPng working groups, with special mention of the efforts of (in alphabetic order): Steve Bellovin, Steve Deering, Francis Dupont, Phil Karn, Frank Kastenholz, Perry Metzger, David Mihelcic, Hilarie Orman, Norman Shulman, William Simpson, and Nina Yuan.",
      "ja": "3年以上の間、この文書では、複数のバージョンと繰り返しを経て発展してきました。この間、多くの人々は、プロセスやドキュメント自体に重大なアイデアとエネルギーを貢献してきました。著者は、このバージョンの仕様のレビュー、編集、背景調査、およびコーディネートに大規模な支援を提供するためのカレンソに感謝したいと思います。著者らはまた、（アルファベット順）の努力の特別な言及で、IPsecとのIPngワーキンググループのメンバーに感謝したいと思います：スティーブBellovin氏、スティーブデアリング、フランシスデュポン、フィル・カーン、フランクKastenholzと、ペリーメッツガー、デビッドMihelcic 、ヒラリーオーマン、ノーマン・シュルマン、ウィリアム・シンプソン、そしてニーナ元。"
    },
    {
      "indent": 0,
      "text": "Appendix A -- Mutability of IP Options/Extension Headers",
      "ja": "付録A  -  IPオプション/拡張ヘッダの可変性"
    },
    {
      "indent": 0,
      "text": "A1. IPv4 Options",
      "ja": "A1。 IPv4のオプション"
    },
    {
      "indent": 3,
      "text": "This table shows how the IPv4 options are classified with regard to \"mutability\". Where two references are provided, the second one supercedes the first. This table is based in part on information provided in RFC1700, \"ASSIGNED NUMBERS\", (October 1994).",
      "ja": "この表は、IPv4オプションの「可変度」に関する分類されている方法を示しています。 2つの参照が提供される場合には、もう一つは第一に優先します。このテーブルは、RFC1700、「割り当てられた番号」、（1994年10月）で提供される情報に基づいています。"
    },
    {
      "indent": 0,
      "text": "           Opt.\nCopy Class  #   Name                      Reference\n---- ----- ---  ------------------------  ---------\nIMMUTABLE -- included in ICV calculation\n  0   0     0   End of Options List       [RFC791]\n  0   0     1   No Operation              [RFC791]\n  1   0     2   Security                  [RFC1108(historic but in use)]\n  1   0     5   Extended Security         [RFC1108(historic but in use)]\n  1   0     6   Commercial Security       [expired I-D, now US MIL STD]\n  1   0    20   Router Alert              [RFC2113]\n  1   0    21   Sender Directed Multi-    [RFC1770]\n                Destination Delivery\nMUTABLE -- zeroed\n  1   0      3  Loose Source Route        [RFC791]\n  0   2      4  Time Stamp                [RFC791]\n  0   0      7  Record Route              [RFC791]\n  1   0      9  Strict Source Route       [RFC791]\n  0   2     18  Traceroute                [RFC1393]",
      "raw": true
    },
    {
      "indent": 0,
      "text": "EXPERIMENTAL, SUPERCEDED -- zeroed 1 0 8 Stream ID [RFC791, RFC1122 (Host Req)] 0 0 11 MTU Probe [RFC1063, RFC1191 (PMTU)] 0 0 12 MTU Reply [RFC1063, RFC1191 (PMTU)] 1 0 17 Extended Internet Proto [RFC1385, RFC1883 (IPv6)] 0 0 10 Experimental Measurement [ZSu] 1 2 13 Experimental Flow Control [Finn] 1 0 14 Experimental Access Ctl [Estrin] 0 0 15 ??? [VerSteeg] 1 0 16 IMI Traffic Descriptor [Lee] 1 0 19 Address Extension [Ullmann IPv7]",
      "ja": "代わら、実験 -  1 0 8ストリームID [RFC791、RFC1122（ホストREQ）] 0 11 MTUプローブ[RFC1063、RFC1191（PMTU）] 0 12 MTU返信[RFC1063、RFC1191（PMTU）] 1 0 17拡張をゼロインターネットプロト[RFC1385、RFC1883（IPv6）の] 0 10実測[ZSU] 1 2 13実験フロー制御[フィン] 1 0 14実験アクセスのCtl [Estrin] 0 0 15？ [VerSteeg] 1 0 16 IMIトラフィック記述子[イ] 1 0 19アドレス拡張[ウルマンIPv7]"
    },
    {
      "indent": 3,
      "text": "NOTE: Use of the Router Alert option is potentially incompatible with use of IPsec. Although the option is immutable, its use implies that each router along a packet's path will \"process\" the packet and consequently might change the packet. This would happen on a hop by hop basis as the packet goes from router to router. Prior to being processed by the application to which the option contents are directed, e.g., RSVP/IGMP, the packet should encounter AH processing.",
      "ja": "注：ルータアラートオプションの使用は、IPSecを使用すると、潜在的に互換性がありません。オプションは不変であるが、その使用は、そのパケットの経路上の各ルータがします「プロセス」パケットを意味し、その結果、パケットを変更する場合があります。パケットがルータにルータから行くので、これは、ホップバイホップで起こるでしょう。前RSVP / IGMP、例えば、オプションの内容が格納されるために、アプリケーションによって処理されるまで、パケットはAH処理が発生しなければなりません。"
    },
    {
      "indent": 3,
      "text": "However, AH processing would require that each router along the path is a member of a multicast-SA defined by the SPI. This might pose problems for packets that are not strictly source routed, and it requires multicast support techniques not currently available.",
      "ja": "しかし、AH処理経路に沿った各ルータはSPIによって定義されたマルチキャストSAのメンバーであることを必要とするであろう。これは厳密にはソースルーティングされていないパケットのための問題を引き起こす可能性があり、それが現在利用できないマルチキャストサポートの技術を必要とします。"
    },
    {
      "indent": 3,
      "text": "NOTE: Addition or removal of any security labels (BSO, ESO, CIPSO) by systems along a packet's path conflicts with the classification of these IP Options as immutable and is incompatible with the use of IPsec.",
      "ja": "注：パケットのパスに沿ったシステムによる追加または任意のセキュリティラベル（BSO、ESO、CIPSO）の除去は不変として、これらのIPオプションの分類と矛盾するとIPsecの使用と互換性がありません。"
    },
    {
      "indent": 3,
      "text": "NOTE: End of Options List options SHOULD be repeated as necessary to ensure that the IP header ends on a 4 byte boundary in order to ensure that there are no unspecified bytes which could be used for a covert channel.",
      "ja": "注：オプションリストのオプションの終わりには、IPヘッダが隠れチャネルを使用することができる全く不特定のバイトが存在しないことを確実にするために、4バイト境界で終わることを保証するために必要に応じて繰り返されるべきです。"
    },
    {
      "indent": 0,
      "text": "A2. IPv6 Extension Headers",
      "ja": "A2。 IPv6拡張ヘッダー"
    },
    {
      "indent": 3,
      "text": "This table shows how the IPv6 Extension Headers are classified with regard to \"mutability\".",
      "ja": "この表は、IPv6拡張ヘッダーの「可変度」に関する分類されている方法を示しています。"
    },
    {
      "indent": 0,
      "text": "Option/Extension Name                  Reference\n-----------------------------------    ---------\nMUTABLE BUT PREDICTABLE -- included in ICV calculation\n  Routing (Type 0)                    [RFC1883]",
      "raw": true
    },
    {
      "indent": 0,
      "text": "BIT INDICATES IF OPTION IS MUTABLE (CHANGES UNPREDICTABLY DURING TRANSIT) Hop by Hop options [RFC1883] Destination options [RFC1883]",
      "ja": "OPTIONは、可変（TRANSIT中に変化予測できない）の場合、BITは、ホップオプション[RFC1883]宛先オプション[RFC1883]でホップを示しています"
    },
    {
      "indent": 0,
      "text": "NOT APPLICABLE Fragmentation [RFC1883]",
      "ja": "適用できない断片化[RFC1883]"
    },
    {
      "indent": 6,
      "text": "Options -- IPv6 options in the Hop-by-Hop and Destination\n       Extension Headers contain a bit that indicates whether the\n       option might change (unpredictably) during transit.  For\n       any option for which contents may change en-route, the\n       entire \"Option Data\" field must be treated as zero-valued\n       octets when computing or verifying the ICV.  The Option\n       Type and Opt Data Len are included in the ICV calculation.\n       All options for which the bit indicates immutability are\n       included in the ICV calculation.  See the IPv6\n       specification [DH95] for more information.",
      "raw": true
    },
    {
      "indent": 6,
      "text": "Routing (Type 0) -- The IPv6 Routing Header \"Type 0\" will rearrange the address fields within the packet during transit from source to destination. However, the contents of the packet as it will appear at the receiver are known to the sender and to all intermediate hops. Hence, the",
      "ja": "ルーティング（タイプ0） -  IPv6ルーティングヘッダ「タイプ0」は送信元から宛先までの通過中のパケット内のアドレスフィールドを再配置します。しかし、それが受信機に表示されるように、パケットの内容が送信者に、すべての中間ホップに知られています。従って"
    },
    {
      "indent": 13,
      "text": "IPv6 Routing Header \"Type 0\" is included in the\nAuthentication Data calculation as mutable but predictable.\nThe sender must order the field so that it appears as it\nwill at the receiver, prior to performing the ICV\ncomputation.",
      "raw": true
    },
    {
      "indent": 6,
      "text": "Fragmentation -- Fragmentation occurs after outbound IPsec processing (section 3.3) and reassembly occurs before inbound IPsec processing (section 3.4). So the Fragmentation Extension Header, if it exists, is not seen by IPsec.",
      "ja": "断片化 - 断片化は、インバウンドIPsec処理（セクション3.4）の前に発生するアウトバウンドIPsec処理（セクション3.3）と再組立後に生じます。だから、フラグメンテーション拡張ヘッダは、それが存在する場合は、IPsecのでは見られません。"
    },
    {
      "indent": 13,
      "text": "Note that on the receive side, the IP implementation could\nleave a Fragmentation Extension Header in place when it\ndoes re-assembly.  If this happens, then when AH receives\nthe packet, before doing ICV processing, AH MUST \"remove\"\n(or skip over) this header and change the previous header's\n\"Next Header\" field to be the \"Next Header\" field in the\nFragmentation Extension Header.",
      "raw": true
    },
    {
      "indent": 13,
      "text": "Note that on the send side, the IP implementation could give the IPsec code a packet with a Fragmentation Extension Header with Offset of 0 (first fragment) and a More Fragments Flag of 0 (last fragment). If this happens, then before doing ICV processing, AH MUST first \"remove\" (or skip over) this header and change the previous header's \"Next Header\" field to be the \"Next Header\" field in the Fragmentation Extension Header.",
      "ja": "送信側なお、0（最初の断片）のオフセットを用いて、IPの実装は、IPsecコードをフラグメンテーション拡張ヘッダを持つパケットを与えることができると0の複数の断片フラグ（最後のフラグメント）。この場合、その後、ICV処理を行う前に、AHは、最初の「削除」（またはスキップ）このヘッダ及びフラグメンテーション拡張ヘッダの「次ヘッダ」フィールドであることを前のヘッダーの「次ヘッダ」フィールドを変更しなければなりません。"
    },
    {
      "indent": 0,
      "text": "References",
      "ja": "リファレンス"
    },
    {
      "indent": 3,
      "text": "[ATK95] Atkinson, R., \"The IP Authentication Header\", RFC 1826, August 1995.",
      "ja": "[ATK95]アトキンソン、R.、 \"IP認証ヘッダー\"、RFC 1826、1995年8月。"
    },
    {
      "indent": 3,
      "text": "[Bra97] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Level\", BCP 14, RFC 2119, March 1997.",
      "ja": "[Bra97]ブラドナーの、S.、BCP 14、RFC 2119、1997年3月 \"のRFCsにおける使用のためのキーワードは、要求レベルを示すために\"。"
    },
    {
      "indent": 3,
      "text": "[DH95] Deering, S., and B. Hinden, \"Internet Protocol version 6 (IPv6) Specification\", RFC 1883, December 1995.",
      "ja": "[DH95]デアリング、S.、およびB. Hindenと \"インターネットプロトコルバージョン6（IPv6）仕様\"、RFC 1883、1995年12月。"
    },
    {
      "indent": 3,
      "text": "[HC98] Harkins, D., and D. Carrel, \"The Internet Key Exchange (IKE)\", RFC 2409, November 1998.",
      "ja": "[HC98]ハーキンズ、D.、およびD.カレル、 \"インターネットキー交換（IKE）\"、RFC 2409、1998年11月。"
    },
    {
      "indent": 3,
      "text": "[KA97a] Kent, S., and R. Atkinson, \"Security Architecture for the Internet Protocol\", RFC 2401, November 1998.",
      "ja": "[KA97a]ケント、S.、およびR.アトキンソン、 \"インターネットプロトコルのためのセキュリティー体系\"、RFC 2401、1998年11月。"
    },
    {
      "indent": 3,
      "text": "[KA97b] Kent, S., and R. Atkinson, \"IP Encapsulating Security Payload (ESP)\", RFC 2406, November 1998.",
      "ja": "[KA97b]ケント、S.、およびR.アトキンソン、 \"IPカプセル化セキュリティペイロード（ESP）\"、RFC 2406、1998年11月。"
    },
    {
      "indent": 3,
      "text": "[MG97a] Madson, C., and R. Glenn, \"The Use of HMAC-MD5-96 within ESP and AH\", RFC 2403, November 1998.",
      "ja": "[MG97a] Madson、C.、およびR.グレン、 \"ESPおよびAH内のHMAC-MD5-96の使用\"、RFC 2403、1998年11月。"
    },
    {
      "indent": 3,
      "text": "[MG97b] Madson, C., and R. Glenn, \"The Use of HMAC-SHA-1-96 within ESP and AH\", RFC 2404, November 1998.",
      "ja": "[MG97b] Madson、C.、およびR.グレン、 \"ESPおよびAH内のHMAC-SHA-1-96の使用\"、RFC 2404、1998年11月。"
    },
    {
      "indent": 3,
      "text": "[STD-2] Reynolds, J., and J. Postel, \"Assigned Numbers\", STD 2, RFC 1700, October 1994. See also: http://www.iana.org/numbers.html",
      "ja": "[STD-2]レイノルズ、J.、およびJ.ポステル、 \"割り当て番号\"、STD 2、RFC 1700、1994年10月を見る：http://www.iana.org/numbers.html"
    },
    {
      "indent": 0,
      "text": "Disclaimer",
      "ja": "免責条項"
    },
    {
      "indent": 3,
      "text": "The views and specification here are those of the authors and are not necessarily those of their employers. The authors and their employers specifically disclaim responsibility for any problems arising from correct or incorrect implementation or use of this specification.",
      "ja": "ここでビューと仕様は著者のものであり、必ずしもその雇用者のそれではありません。著者とその雇い主は、特に正しいか正しくないの実装や、この仕様の利用から生じるいかなる問題の責任を負いかねます。"
    },
    {
      "indent": 0,
      "text": "Author Information",
      "ja": "著者の情報"
    },
    {
      "indent": 3,
      "text": "Stephen Kent BBN Corporation 70 Fawcett Street Cambridge, MA 02140 USA",
      "ja": "スティーブン・ケントBBN社70フォーセットストリート、ケンブリッジ、MA 02140 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 (617) 873-3988 EMail: kent@bbn.com",
      "ja": "電話：+1（617）873-3988 Eメール：kent@bbn.com"
    },
    {
      "indent": 3,
      "text": "Randall Atkinson @Home Network 425 Broadway, Redwood City, CA 94063 USA",
      "ja": "ランドール・アトキンソン@Homeネットワーク425ブロードウェイ、レッドウッドシティ、CA 94063 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 (415) 569-5000 EMail: rja@corp.home.net",
      "ja": "電話：+1（415）569-5000 Eメール：rja@corp.home.net"
    },
    {
      "indent": 0,
      "text": "Copyright (C) The Internet Society (1998). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1998）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    }
  ]
}