{
  "title": {
    "text": "RFC 2409 - The Internet Key Exchange (IKE)",
    "ja": "RFC 2409 - インターネット鍵交換（IKE）"
  },
  "number": 2409,
  "created_at": "2019-10-24 07:33:20.644413+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                         D. Harkins\nRequest for Comments: 2409                                     D. Carrel\nCategory: Standards Track                                  cisco Systems\n                                                           November 1998",
      "raw": true
    },
    {
      "indent": 20,
      "text": "The Internet Key Exchange (IKE)",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1998). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1998）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Table Of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1 Abstract........................................................  2\n2 Discussion......................................................  2\n3 Terms and Definitions...........................................  3\n3.1 Requirements Terminology......................................  3\n3.2 Notation......................................................  3\n3.3 Perfect Forward Secrecty......................................  5\n3.4 Security Association..........................................  5\n4 Introduction....................................................  5\n5 Exchanges.......................................................  8\n5.1 Authentication with Digital Signatures........................ 10\n5.2 Authentication with Public Key Encryption..................... 12\n5.3 A Revised method of Authentication with Public Key Encryption. 13\n5.4 Authentication with a Pre-Shared Key.......................... 16\n5.5 Quick Mode.................................................... 16\n5.6 New Group Mode................................................ 20\n5.7 ISAKMP Informational Exchanges................................ 20\n6 Oakley Groups................................................... 21\n6.1 First Oakley Group............................................ 21\n6.2 Second Oakley Group........................................... 22\n6.3 Third Oakley Group............................................ 22\n6.4 Fourth Oakley Group........................................... 23\n7 Payload Explosion of Complete Exchange.......................... 23\n7.1 Phase 1 with Main Mode........................................ 23\n7.2 Phase 2 with Quick Mode....................................... 25\n8 Perfect Forward Secrecy Example................................. 27\n9 Implementation Hints............................................ 27",
      "raw": true
    },
    {
      "indent": 3,
      "text": "10 Security Considerations........................................ 28\n11 IANA Considerations............................................ 30\n12 Acknowledgments................................................ 31\n13 References..................................................... 31\nAppendix A........................................................ 33\nAppendix B........................................................ 37\nAuthors' Addresses................................................ 40\nAuthors' Note..................................................... 40\nFull Copyright Statement.......................................... 41",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Abstract",
      "section_title": true,
      "ja": "1.要約"
    },
    {
      "indent": 3,
      "text": "ISAKMP ([MSST98]) provides a framework for authentication and key exchange but does not define them. ISAKMP is designed to be key exchange independant; that is, it is designed to support many different key exchanges.",
      "ja": "ISAKMP（[MSST98]）は、認証及び鍵交換のためのフレームワークを提供するが、それらを定義していません。 ISAKMPは鍵交換に依存しないように設計されています。つまり、多くの異なる鍵交換をサポートするように設計されています。"
    },
    {
      "indent": 3,
      "text": "Oakley ([Orm96]) describes a series of key exchanges-- called \"modes\"-- and details the services provided by each (e.g. perfect forward secrecy for keys, identity protection, and authentication).",
      "ja": "オークリー（[Orm96]）は、「モード」と呼ばれるキーexchanges--一連の説明 - とそれぞれ（例えば、完全な前進の鍵の秘密、ID保護、および認証）が提供するサービスの詳細を示します。"
    },
    {
      "indent": 3,
      "text": "SKEME ([SKEME]) describes a versatile key exchange technique which provides anonymity, repudiability, and quick key refreshment.",
      "ja": "SKEME（[SKEME]）は汎用性の鍵交換匿名性を提供する技術、repudiability、およびクイックキーリフレッシュが記載されています。"
    },
    {
      "indent": 3,
      "text": "This document describes a protocol using part of Oakley and part of SKEME in conjunction with ISAKMP to obtain authenticated keying material for use with ISAKMP, and for other security associations such as AH and ESP for the IETF IPsec DOI.",
      "ja": "この文書では、ISAKMPで使用するための、そのようなIETFのIPsec DOIのためのAHとESPのような他のセキュリティアソシエーションに対して認証鍵材料を得るためにISAKMPと一緒にオークリーとSKEMEの部分の一部を使用してプロトコルを記述する。"
    },
    {
      "indent": 0,
      "text": "2. Discussion",
      "section_title": true,
      "ja": "2.ディスカッション"
    },
    {
      "indent": 3,
      "text": "This memo describes a hybrid protocol. The purpose is to negotiate, and provide authenticated keying material for, security associations in a protected manner.",
      "ja": "このメモは、ハイブリッドプロトコルを記述します。目的は、交渉、および保護された方法で、セキュリティアソシエーションの認証済みの鍵材料を提供することです。"
    },
    {
      "indent": 3,
      "text": "Processes which implement this memo can be used for negotiating virtual private networks (VPNs) and also for providing a remote user from a remote site (whose IP address need not be known beforehand) access to a secure host or network.",
      "ja": "このメモを実装するプロセスは、（IPアドレスが事前に知られてする必要はありません）は、安全なホストまたはネットワークへのアクセスをリモートサイトからリモートユーザに提供するために、仮想プライベートネットワーク（VPN）との交渉のために使用することができます。"
    },
    {
      "indent": 3,
      "text": "Client negotiation is supported. Client mode is where the negotiating parties are not the endpoints for which security association negotiation is taking place. When used in client mode, the identities of the end parties remain hidden.",
      "ja": "クライアントのネゴシエーションがサポートされています。交渉当事者は、セキュリティアソシエーションのネゴシエーションが行われているエンドポイントではないされているようなクライアントモードがあります。クライアントモードで使用する場合、エンド当事者の身元が隠されたまま。"
    },
    {
      "indent": 3,
      "text": "This does not implement the entire Oakley protocol, but only a subset necessary to satisfy its goals. It does not claim conformance or compliance with the entire Oakley protocol nor is it dependant in any way on the Oakley protocol.",
      "ja": "これは、全体オークリープロトコルを実装していませんが、必要なサブセットのみがその目標を満たすために。これは、全体オークリープロトコルに準拠または遵守を主張しておらず、オークリープロトコル上の任意の方法で依存しています。"
    },
    {
      "indent": 3,
      "text": "Likewise, this does not implement the entire SKEME protocol, but only the method of public key encryption for authentication and its concept of fast re-keying using an exchange of nonces. This protocol is not dependant in any way on the SKEME protocol.",
      "ja": "同様に、これは全体SKEMEプロトコルが、認証のための公開鍵暗号の唯一の方法とナンスの交換を使用して高速再キーイングのその概念を実装していません。このプロトコルは、SKEMEプロトコル上の任意の方法で依存していません。"
    },
    {
      "indent": 0,
      "text": "3. Terms and Definitions",
      "section_title": true,
      "ja": "3.用語と定義"
    },
    {
      "indent": 0,
      "text": "3.1 Requirements Terminology",
      "section_title": true,
      "ja": "3.1要件の用語"
    },
    {
      "indent": 3,
      "text": "Keywords \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHOULD\", \"SHOULD NOT\" and \"MAY\" that appear in this document are to be interpreted as described in [Bra97].",
      "ja": "キーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、 \"SHOULD\"、 \"SHOULD NOT\" と[Bra97]で説明したように解釈されるべきであり、この文書に表示される \"MAY\"。"
    },
    {
      "indent": 0,
      "text": "3.2 Notation",
      "section_title": true,
      "ja": "3.2表記"
    },
    {
      "indent": 3,
      "text": "The following notation is used throughout this memo.",
      "ja": "以下の表記は、このメモ全体で使用されています。"
    },
    {
      "indent": 5,
      "text": "HDR is an ISAKMP header whose exchange type is the mode. When writen as HDR* it indicates payload encryption.",
      "ja": "HDRは、その交換型モードでISAKMPヘッダです。 HDRのように記述する場合*それは、ペイロード暗号化を示します。"
    },
    {
      "indent": 5,
      "text": "SA is an SA negotiation payload with one or more proposals. An initiator MAY provide multiple proposals for negotiation; a responder MUST reply with only one.",
      "ja": "SAは、一の以上の提​​案とSAネゴシエーションペイロードです。イニシエータは、交渉のための複数の提案を提供してもよい（MAY）。レスポンダは一つだけで返答しなければなりません。"
    },
    {
      "indent": 5,
      "text": "<P>_b indicates the body of payload <P>-- the ISAKMP generic vpayload is not included.",
      "ja": "ISAKMPジェネリックvpayloadが含まれていない -  <P> _bは、<P>ペイロードの本体を示します。"
    },
    {
      "indent": 5,
      "text": "SAi_b is the entire body of the SA payload (minus the ISAKMP generic header)-- i.e. the DOI, situation, all proposals and all transforms offered by the Initiator.",
      "ja": "すなわちDOI、状況、すべての提案とイニシエータが提供する全ての変換 -  SAi_bは、SAペイロード（マイナスISAKMPジェネリックヘッダ）の全体です。"
    },
    {
      "indent": 5,
      "text": "CKY-I and CKY-R are the Initiator's cookie and the Responder's cookie, respectively, from the ISAKMP header.",
      "ja": "CKY-IとCKY-Rは、ISAKMPヘッダから、それぞれ、イニシエータのクッキーとレスポンダのクッキーです。"
    },
    {
      "indent": 5,
      "text": "g^xi and g^xr are the Diffie-Hellman ([DH]) public values of the initiator and responder respectively.",
      "ja": "G ^ XIおよびg ^ XRは、それぞれイニシエータとレスポンダのディフィ - ヘルマン（[DH]）公開値です。"
    },
    {
      "indent": 5,
      "text": "g^xy is the Diffie-Hellman shared secret.",
      "ja": "G ^ xyがディフィー・ヘルマン共有秘密です。"
    },
    {
      "indent": 5,
      "text": "KE is the key exchange payload which contains the public information exchanged in a Diffie-Hellman exchange. There is no particular encoding (e.g. a TLV) used for the data of a KE payload.",
      "ja": "KEは、DH交換で交換公開情報が含まれている鍵交換ペイロードです。 KEペイロードのデータに使用される特別のエンコード（例えば、TLV）は存在しません。"
    },
    {
      "indent": 5,
      "text": "Nx is the nonce payload; x can be: i or r for the ISAKMP initiator and responder respectively.",
      "ja": "Nxがナンスペイロードです。 Xとすることができる：IまたはrがそれぞれISAKMPイニシエータとレスポンダのため。"
    },
    {
      "indent": 5,
      "text": "IDx is the identification payload for \"x\". x can be: \"ii\" or \"ir\" for the ISAKMP initiator and responder respectively during phase one negotiation; or \"ui\" or \"ur\" for the user initiator and responder respectively during phase two. The ID payload format for the Internet DOI is defined in [Pip97].",
      "ja": "idxが「X」の識別ペイロードです。 Xは、であることができる：フェーズ1ネゴシエーションの間に、それぞれ、ISAKMPイニシエータとレスポンダは、「II」または「IR」。又は「UI」またはユーザイニシエータとレスポンダは、「UR」はそれぞれ第二段階の間。インターネットDOIのIDペイロードフォーマットは、[Pip97]で定義されています。"
    },
    {
      "indent": 5,
      "text": "SIG is the signature payload. The data to sign is exchange-specific.",
      "ja": "SIGは、署名ペイロードです。署名するデータは、Exchange固有です。"
    },
    {
      "indent": 5,
      "text": "CERT is the certificate payload.",
      "ja": "CERTは、証明書ペイロードです。"
    },
    {
      "indent": 5,
      "text": "HASH (and any derivitive such as HASH(2) or HASH_I) is the hash payload. The contents of the hash are specific to the authentication method.",
      "ja": "HASH（およびHASH（2）またはHASH_Iなどの任意derivitive）はハッシュペイロードです。ハッシュの内容は、認証方式に固有のものです。"
    },
    {
      "indent": 5,
      "text": "prf(key, msg) is the keyed pseudo-random function-- often a keyed hash function-- used to generate a deterministic output that appears pseudo-random. prf's are used both for key derivations and for authentication (i.e. as a keyed MAC). (See [KBC96]).",
      "ja": "PRF（キー、MSG）は、多くの場合、キー付き疑似ランダムfunction--擬似ランダム表示される決定論的出力を生成するために使用される鍵付きハッシュfunction--です。 PRFの（すなわち、キー付きMACとして）鍵導出のために、認証の両方に使用されています。 （[KBC96]参照）。"
    },
    {
      "indent": 5,
      "text": "SKEYID is a string derived from secret material known only to the active players in the exchange.",
      "ja": "SKEYIDは交換のみで現役選手に知られている秘密の材料から派生した文字列です。"
    },
    {
      "indent": 5,
      "text": "SKEYID_e is the keying material used by the ISAKMP SA to protect the confidentiality of its messages.",
      "ja": "SKEYID_eは、そのメッセージの機密性を保護するためにISAKMP SAが使用する鍵素材です。"
    },
    {
      "indent": 5,
      "text": "SKEYID_a is the keying material used by the ISAKMP SA to authenticate its messages.",
      "ja": "SKEYID_aは、そのメッセージを認証するためにISAKMP SAが使用する鍵素材です。"
    },
    {
      "indent": 5,
      "text": "SKEYID_d is the keying material used to derive keys for non-ISAKMP security associations.",
      "ja": "SKEYID_dは、非ISAKMPセキュリティアソシエーションのキーを導出するために使用される鍵素材です。"
    },
    {
      "indent": 5,
      "text": "<x>y indicates that \"x\" is encrypted with the key \"y\".",
      "ja": "<x> yが「x」はキー「Y」で暗号化されていることを示します。"
    },
    {
      "indent": 5,
      "text": "--> signifies \"initiator to responder\" communication (requests).",
      "ja": " - >「レスポンダにイニシエータ」通信（要求）を意味します。"
    },
    {
      "indent": 5,
      "text": "<-- signifies \"responder to initiator\" communication (replies).",
      "ja": "< - が意味「イニシエータするレスポンダ」通信（返信）。"
    },
    {
      "indent": 5,
      "text": " | signifies concatenation of information-- e.g. X | Y is the concatentation of X with Y.",
      "ja": "| information--などの連結を意味X | Yは、YとXの連結であります"
    },
    {
      "indent": 5,
      "text": "[x] indicates that x is optional.",
      "ja": "[x]は、xは任意であることを示しています。"
    },
    {
      "indent": 3,
      "text": "Message encryption (when noted by a '*' after the ISAKMP header) MUST begin immediately after the ISAKMP header. When communication is protected, all payloads following the ISAKMP header MUST be encrypted. Encryption keys are generated from SKEYID_e in a manner that is defined for each algorithm.",
      "ja": "メッセージの暗号化（ISAKMPヘッダの後に「*」によって指摘とき）ISAKMPヘッダの直後に開始しなければなりません。通信が保護されている場合、ISAKMPヘッダに続くすべてのペイロードは暗号化されなければなりません。暗号化キーは、各アルゴリズムのために定義された方法でSKEYID_eから生成されます。"
    },
    {
      "indent": 0,
      "text": "3.3 Perfect Forward Secrecy",
      "section_title": true,
      "ja": "3.3完全転送秘密"
    },
    {
      "indent": 3,
      "text": "When used in the memo Perfect Forward Secrecy (PFS) refers to the notion that compromise of a single key will permit access to only data protected by a single key. For PFS to exist the key used to protect transmission of data MUST NOT be used to derive any additional keys, and if the key used to protect transmission of data was derived from some other keying material, that material MUST NOT be used to derive any more keys.",
      "ja": "メモ完全転送秘密（PFS）で使用する場合、単一のキーの妥協は、単一のキーによって保護されたデータのみへのアクセスを可能にするという概念を指します。 PFSが存在するため、データの伝送を保護するために使用されるキーは、追加キーを導出するために使用してはいけません、そしてデータの伝送を保護するために使用されるキーは、いくつかの他のキーイング材料から導出された場合、その材料は、任意のより多くを得るために使用してはいけませんキー。"
    },
    {
      "indent": 3,
      "text": "Perfect Forward Secrecy for both keys and identities is provided in this protocol. (Sections 5.5 and 8).",
      "ja": "鍵とアイデンティティの両方のための完全転送秘密は、このプロトコルで提供されます。 （セクション5.5および8）。"
    },
    {
      "indent": 0,
      "text": "3.4 Security Association",
      "section_title": true,
      "ja": "3.4セキュリティアソシエーション"
    },
    {
      "indent": 3,
      "text": "A security association (SA) is a set of policy and key(s) used to protect information. The ISAKMP SA is the shared policy and key(s) used by the negotiating peers in this protocol to protect their communication.",
      "ja": "セキュリティアソシエーション（SA）情報を保護するために使用されるポリシーおよび鍵（単数または複数）のセットです。 ISAKMP SAは、それらの通信を保護するために、このプロトコルでネゴシエーションピアによって使用される共有ポリシーおよび鍵（単数または複数）です。"
    },
    {
      "indent": 0,
      "text": "4. Introduction",
      "section_title": true,
      "ja": "4.はじめに"
    },
    {
      "indent": 3,
      "text": "Oakley and SKEME each define a method to establish an authenticated key exchange. This includes payloads construction, the information payloads carry, the order in which they are processed and how they are used.",
      "ja": "オークリーとSKEMEそれぞれは、認証鍵交換を確立するための方法を定義します。これは、ペイロードの建設、情報ペイロードを運ぶ、それらが処理され、それらがどのように使用される順序を含んでいます。"
    },
    {
      "indent": 3,
      "text": "While Oakley defines \"modes\", ISAKMP defines \"phases\". The relationship between the two is very straightforward and IKE presents different exchanges as modes which operate in one of two phases.",
      "ja": "オークリーは、「モード」を定義しながら、ISAKMPは、「フェーズ」を定義します。両者の関係は非常に簡単であり、IKEは2つの段階のいずれかで動作モードのような異なる交換を提示します。"
    },
    {
      "indent": 3,
      "text": "Phase 1 is where the two ISAKMP peers establish a secure, authenticated channel with which to communicate. This is called the ISAKMP Security Association (SA). \"Main Mode\" and \"Aggressive Mode\" each accomplish a phase 1 exchange. \"Main Mode\" and \"Aggressive Mode\" MUST ONLY be used in phase 1.",
      "ja": "フェーズ1は、2つのISAKMPピアが通信すると、安全で認証されたチャネルを確立するところです。これは、ISAKMPセキュリティアソシエーション（SA）と呼ばれています。 「メインモード」と「アグレッシブモード」は、それぞれフェーズ1回の交換を行います。 「メインモード」と「アグレッシブモードは、」ONLYフェーズ1で使用しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Phase 2 is where Security Associations are negotiated on behalf of services such as IPsec or any other service which needs key material and/or parameter negotiation. \"Quick Mode\" accomplishes a phase 2 exchange. \"Quick Mode\" MUST ONLY be used in phase 2.",
      "ja": "フェーズ2は、セキュリティアソシエーションは、IPSecまたはキー材料および/またはパラメータの交渉を必要とするその他のサービスなどのサービスに代わって交渉しているところです。 「クイックモードは、」フェーズ2の交換を達成します。 「クイックモードは、」ONLYフェーズ2で使用しなければなりません。"
    },
    {
      "indent": 3,
      "text": "\"New Group Mode\" is not really a phase 1 or phase 2. It follows phase 1, but serves to establish a new group which can be used in future negotiations. \"New Group Mode\" MUST ONLY be used after phase 1.",
      "ja": "「New Groupモード」は本当にフェーズ1またはフェーズ2ではありませんそれはフェーズ1に従うが、今後の交渉で使用することができ、新たなグループを確立するのに役立ちます。 「New Groupモードは」ONLYフェーズ1の後に使用しなければなりません。"
    },
    {
      "indent": 3,
      "text": "The ISAKMP SA is bi-directional. That is, once established, either party may initiate Quick Mode, Informational, and New Group Mode Exchanges. Per the base ISAKMP document, the ISAKMP SA is identified by the Initiator's cookie followed by the Responder's cookie-- the role of each party in the phase 1 exchange dictates which cookie is the Initiator's. The cookie order established by the phase 1 exchange continues to identify the ISAKMP SA regardless of the direction the Quick Mode, Informational, or New Group exchange. In other words, the cookies MUST NOT swap places when the direction of the ISAKMP SA changes.",
      "ja": "ISAKMP SAは双方向です。つまり、一度確立され、いずれかの当事者は、クイックモード、情報、およびNew Groupモード交換を開始することができます。ベースISAKMPドキュメントごとに、ISAKMP SAは、クッキーがイニシエータのあるフェーズ1つの交換おもむくにおける各当事者のレスポンダのcookie--役割が続いイニシエータのクッキーによって識別されます。フェーズ1の交換によって確立されたクッキーの順番は関係なく、方向クイックモード、情報、または新しいグループ交換のISAKMP SAを識別するために続けています。 ISAKMP SAの方向が変化した場合に、他の言葉では、クッキーは場所を交換してはなりません。"
    },
    {
      "indent": 3,
      "text": "With the use of ISAKMP phases, an implementation can accomplish very fast keying when necessary. A single phase 1 negotiation may be used for more than one phase 2 negotiation. Additionally a single phase 2 negotiation can request multiple Security Associations. With these optimizations, an implementation can see less than one round trip per SA as well as less than one DH exponentiation per SA. \"Main Mode\" for phase 1 provides identity protection. When identity protection is not needed, \"Aggressive Mode\" can be used to reduce round trips even further. Developer hints for doing these optimizations are included below. It should also be noted that using public key encryption to authenticate an Aggressive Mode exchange will still provide identity protection.",
      "ja": "必要なときにISAKMPフェーズを使用すると、実装が非常に高速なキーイングを行うことができます。単相1ネゴシエーションは、複数のフェーズ2ネゴシエーションのために使用することができます。さらに、単相2ネゴシエーションは、複数のセキュリティアソシエーションを要求することができます。これらの最適化によって、実装は、SAごと未満1つの往復だけでなく、SAごと未満1つのDHの累乗を見ることができます。フェーズ1は、ID保護を提供するために、「メインモード」。アイデンティティ保護が必要とされていない場合は、「アグレッシブモード」はさらにラウンドトリップを削減するために使用することができます。これらの最適化を行うための開発者向けのヒントは以下に含まれています。また、公開鍵暗号を使用すると、アグレッシブモードの交換はまだ身元保護を提供します認証するために留意すべきです。"
    },
    {
      "indent": 3,
      "text": "This protocol does not define its own DOI per se. The ISAKMP SA, established in phase 1, MAY use the DOI and situation from a non-ISAKMP service (such as the IETF IPSec DOI [Pip97]). In this case an implementation MAY choose to restrict use of the ISAKMP SA for establishment of SAs for services of the same DOI. Alternately, an ISAKMP SA MAY be established with the value zero in both the DOI and situation (see [MSST98] for a description of these fields) and in this case implementations will be free to establish security services for any defined DOI using this ISAKMP SA. If a DOI of zero is used for establishment of a phase 1 SA, the syntax of the identity payloads used in phase 1 is that defined in [MSST98] and not from any DOI-- e.g. [Pip97]-- which may further expand the syntax and semantics of identities.",
      "ja": "このプロトコルは、独自のDOI自体を定義していません。フェーズ1で確立ISAKMP SAは、（例えば、IETFのIPSec DOI [Pip97]のような）非ISAKMPサービスからDOIと状況を使用するかもしれません。この場合、実装は、同じDOIのサービスのためのSAの確立のためのISAKMP SAの使用を制限することを選択するかもしれません。交互に、ISAKMP SAはDOIと状況の両方の値がゼロで確立することができる（これらのフィールドの説明については、[MSST98]参照）、この場合、実装は、このISAKMP SAを使用して、任意の定義されたDOIのセキュリティサービスを確立するために無料になります。ゼロのDOIは、フェーズ1 SA、フェーズ1で使用される識別ペイロードの構文の確立のために使用される場合、[MSST98]でなく、任意DOI--などから定義されていること[Pip97]  - これはさらにアイデンティティの構文とセマンティクスを拡大することができます。"
    },
    {
      "indent": 3,
      "text": "The following attributes are used by IKE and are negotiated as part of the ISAKMP Security Association. (These attributes pertain only to the ISAKMP Security Association and not to any Security Associations that ISAKMP may be negotiating on behalf of other services.)",
      "ja": "次の属性は、IKEで使用され、ISAKMPセキュリティアソシエーションの一部として交渉されています。 （これらの属性は、ISAKMPが他のサービスに代わって交渉することができることをISAKMPセキュリティアソシエーションにはない任意のセキュリティアソシエーションにのみ関係します。）"
    },
    {
      "indent": 6,
      "text": "- encryption algorithm",
      "ja": " - 暗号化アルゴリズム"
    },
    {
      "indent": 6,
      "text": "- hash algorithm",
      "ja": " - ハッシュアルゴリズム"
    },
    {
      "indent": 6,
      "text": "- authentication method",
      "ja": "- 認証方法"
    },
    {
      "indent": 6,
      "text": "- information about a group over which to do Diffie-Hellman.",
      "ja": " - ディフィー・ヘルマンを行う以上のグループに関する情報。"
    },
    {
      "indent": 3,
      "text": "All of these attributes are mandatory and MUST be negotiated. In addition, it is possible to optionally negotiate a psuedo-random function (\"prf\"). (There are currently no negotiable pseudo-random functions defined in this document. Private use attribute values can be used for prf negotiation between consenting parties). If a \"prf\" is not negotiation, the HMAC (see [KBC96]) version of the negotiated hash algorithm is used as a pseudo-random function. Other non-mandatory attributes are described in Appendix A. The selected hash algorithm MUST support both native and HMAC modes.",
      "ja": "これらの属性はすべて必須で、交渉しなければなりません。また、擬似ランダム関数（「PRF」）を交渉する任意することが可能です。 （現在、このドキュメントで定義された有価擬似ランダム機能はありません。プライベート使用属性値が同意当事者間のprf交渉のために使用することができます）。 「PRF」は、ネゴシエーションでない場合、HMACは、ネゴシエートされたハッシュアルゴリズムのバージョンは、擬似ランダム関数として使用されている（[KBC96]参照します）。その他の非必須属性は、選択されたハッシュアルゴリズムは、両方のネイティブとHMACモードをサポートしなければならない付録Aに記載されています。"
    },
    {
      "indent": 3,
      "text": "The Diffie-Hellman group MUST be either specified using a defined group description (section 6) or by defining all attributes of a group (section 5.6). Group attributes (such as group type or prime-- see Appendix A) MUST NOT be offered in conjunction with a previously defined group (either a reserved group description or a private use description that is established after conclusion of a New Group Mode exchange).",
      "ja": "Diffie-Hellmanグループは、定義されたグループ記述（セクション6）を使用して指定またはグループ（セクション5.6）のすべての属性を定義することによってのいずれかでなければなりません。グループ属性（たとえば、グループタイプまたはとしてprime--付録Aを参照してください）以前に定義されたグループ（予約されたグループの説明やNew Groupモード交換の終了後に確立された私的使用の記述のいずれか）と連携して提供してはなりません。"
    },
    {
      "indent": 3,
      "text": "IKE implementations MUST support the following attribute values:",
      "ja": "IKEの実装は次の属性値をサポートしなければなりません："
    },
    {
      "indent": 6,
      "text": "- DES [DES] in CBC mode with a weak, and semi-weak, key check (weak and semi-weak keys are referenced in [Sch96] and listed in Appendix A). The key is derived according to Appendix B.",
      "ja": " -  DES [DES] CBCモードでは弱、および半弱、キーチェック（弱半弱いキーは[Sch96]および付録Aに記載されているで参照される）を有します。キーは、付録Bに従って導出されます"
    },
    {
      "indent": 6,
      "text": "- MD5 [MD5] and SHA [SHA}.",
      "ja": " -  MD5 [MD5]およびSHA [SHA}。"
    },
    {
      "indent": 6,
      "text": "- Authentication via pre-shared keys.",
      "ja": " - 事前共有キーによる認証。"
    },
    {
      "indent": 6,
      "text": "- MODP over default group number one (see below).",
      "ja": " - デフォルトのグループ番号1を超えるMODP（下記参照）。"
    },
    {
      "indent": 3,
      "text": "In addition, IKE implementations SHOULD support: 3DES for encryption; Tiger ([TIGER]) for hash; the Digital Signature Standard, RSA [RSA] signatures and authentication with RSA public key encryption; and MODP group number 2. IKE implementations MAY support any additional encryption algorithms defined in Appendix A and MAY support ECP and EC2N groups.",
      "ja": "また、IKEの実装がサポートする必要があります暗号化のための3DESを。ハッシュのためのタイガー（[TIGER]）。デジタル署名標準、RSA公開鍵暗号とRSA [RSA]署名および認証。そして、MODPグループ番号2. IKEの実装は、付録Aで定義された任意の追加の暗号化アルゴリズムをサポートし、ECPとEC2Nグループをサポートするかもしれません。"
    },
    {
      "indent": 3,
      "text": "The IKE modes described here MUST be implemented whenever the IETF IPsec DOI [Pip97] is implemented. Other DOIs MAY use the modes described here.",
      "ja": "IETFのIPsec DOI [Pip97]が実施されるたびに、ここで説明IKEモードを実装しなければなりません。その他のDOIは、ここに記載された形態を使用するかもしれません。"
    },
    {
      "indent": 0,
      "text": "5. Exchanges",
      "section_title": true,
      "ja": "5.交換"
    },
    {
      "indent": 3,
      "text": "There are two basic methods used to establish an authenticated key exchange: Main Mode and Aggressive Mode. Each generates authenticated keying material from an ephemeral Diffie-Hellman exchange. Main Mode MUST be implemented; Aggressive Mode SHOULD be implemented. In addition, Quick Mode MUST be implemented as a mechanism to generate fresh keying material and negotiate non-ISAKMP security services. In addition, New Group Mode SHOULD be implemented as a mechanism to define private groups for Diffie-Hellman exchanges. Implementations MUST NOT switch exchange types in the middle of an exchange.",
      "ja": "メインモードとアグレッシブモード：認証された鍵交換を確立するために使用される2つの基本的な方法があります。それぞれが短命のDiffie-Hellman交換からの認証済み鍵材料を生成します。メインモードを実装する必要があります。アグレッシブモードを実装する必要があります。また、クイックモードは、新鮮な鍵素材を生成し、非ISAKMPセキュリティサービスを交渉するためのメカニズムとして実装されなければなりません。また、New GroupモードはのDiffie-Hellman交換のためのプライベートグループを定義するための機構として実装する必要があります。実装は、為替の途中で交換の種類を切り替えてはなりません。"
    },
    {
      "indent": 3,
      "text": "Exchanges conform to standard ISAKMP payload syntax, attribute encoding, timeouts and retransmits of messages, and informational messages-- e.g a notify response is sent when, for example, a proposal is unacceptable, or a signature verification or decryption was unsuccessful, etc.",
      "ja": "交換は、例えば、等、提案が受け入れられない、または署名検証または復号が失敗した場合、応答が送信される通知messages--例えばA標準ISAKMPペイロード構文、属性エンコーディング、タイムアウトおよびメッセージの再送に適合、および情報"
    },
    {
      "indent": 3,
      "text": "The SA payload MUST precede all other payloads in a phase 1 exchange. Except where otherwise noted, there are no requirements for ISAKMP payloads in any message to be in any particular order.",
      "ja": "SAペイロードは、フェーズ1交換で他のすべてのペイロードに先行しなければなりません。特記する場合を除いて、任意の特定の順序になるように、任意のメッセージでISAKMPペイロードのための要件はありません。"
    },
    {
      "indent": 3,
      "text": "The Diffie-Hellman public value passed in a KE payload, in either a phase 1 or phase 2 exchange, MUST be the length of the negotiated Diffie-Hellman group enforced, if necessary, by pre-pending the value with zeros.",
      "ja": "必要に応じて、フェーズ1またはフェーズ2の交換のいずれかで、KEペイロードに渡さのDiffie-Hellman公開値はゼロでプリペンディング値によって、強制ネゴシエートのDiffie-Hellmanグループの長さでなければなりません。"
    },
    {
      "indent": 3,
      "text": "The length of nonce payload MUST be between 8 and 256 bytes inclusive.",
      "ja": "ノンス、ペイロードの長さを含めて8と256バイトの間でなければなりません。"
    },
    {
      "indent": 3,
      "text": "Main Mode is an instantiation of the ISAKMP Identity Protect Exchange: The first two messages negotiate policy; the next two exchange Diffie-Hellman public values and ancillary data (e.g. nonces) necessary for the exchange; and the last two messages authenticate the Diffie-Hellman Exchange. The authentication method negotiated as part of the initial ISAKMP exchange influences the composition of the payloads but not their purpose. The XCHG for Main Mode is ISAKMP Identity Protect.",
      "ja": "メインモードは、Exchange保護ISAKMPアイデンティティのインスタンス化したものです：最初の2件のメッセージがポリシーを交渉します。次の二つの交換のDiffie-Hellman公開値と交換するために必要な補助データ（例えば、ナンス）。そして、最後の2件のメッセージがのDiffie-Hellmanの鍵交換認証します。最初のISAKMP交換の一環としてネゴシエートされた認証方法は、ペイロードの構図ではなく、自分の目的に影響を与えます。メインモードのXCHGは、ISAKMPアイデンティティが保護です。"
    },
    {
      "indent": 3,
      "text": "Similarly, Aggressive Mode is an instantiation of the ISAKMP Aggressive Exchange. The first two messages negotiate policy, exchange Diffie-Hellman public values and ancillary data necessary for the exchange, and identities. In addition the second message authenticates the responder. The third message authenticates the initiator and provides a proof of participation in the exchange. The XCHG for Aggressive Mode is ISAKMP Aggressive. The final message MAY NOT be sent under protection of the ISAKMP SA allowing each party to postpone exponentiation, if desired, until negotiation of this exchange is complete. The graphic depictions of Aggressive Mode show the final payload in the clear; it need not be.",
      "ja": "同様に、アグレッシブモードは、ISAKMP積極的な交流をインスタンス化したものです。最初の2件のメッセージがポリシー、交換に必要な為替のDiffie-Hellman公開値及び補助データ、およびアイデンティティを交渉します。加えて、第2のメッセージは、応答を認証します。第3のメッセージは、イニシエータを認証し、交換の参加の証拠を提供します。アグレッシブモードのためXCHGは、ISAKMP積極的です。この交換の交渉が完了するまで、最後のメッセージは、必要に応じて各当事者は、累乗を延期することができISAKMP SAの保護の下で送信されないことがあります。アグレッシブモードのグラフィック描写は明らかで、最終的なペイロードを示しました。それはする必要はありません。"
    },
    {
      "indent": 3,
      "text": "Exchanges in IKE are not open ended and have a fixed number of messages. Receipt of a Certificate Request payload MUST NOT extend the number of messages transmitted or expected.",
      "ja": "IKEでの交換は終了を開くと、メッセージの固定数を持っていません。証明書要求ペイロードの領収書が送信されるか、または予想されるメッセージの数を拡張してはなりません。"
    },
    {
      "indent": 3,
      "text": "Security Association negotiation is limited with Aggressive Mode. Due to message construction requirements the group in which the Diffie-Hellman exchange is performed cannot be negotiated. In addition, different authentication methods may further constrain attribute negotiation. For example, authentication with public key encryption cannot be negotiated and when using the revised method of public key encryption for authentication the cipher and hash cannot be negotiated. For situations where the rich attribute negotiation capabilities of IKE are required Main Mode may be required.",
      "ja": "セキュリティアソシエーションのネゴシエーションがアグレッシブモードで制限されています。メッセージ構成要件に起因したDiffie-Hellman交換が行われるグループがネゴシエートすることができません。また、異なる認証方法は、さらに属性交渉を制約することがあります。例えば、公開鍵暗号による認証をネゴシエートできないと、認証暗号とハッシュのための公開鍵暗号の改定方法を使用しているときに交渉することはできません。 IKEの豊富な属性ネゴシエーション機能は、メインモードを必要としている状況で必要になることがあります。"
    },
    {
      "indent": 3,
      "text": "Quick Mode and New Group Mode have no analog in ISAKMP. The XCHG values for Quick Mode and New Group Mode are defined in Appendix A.",
      "ja": "クイックモードとNew Groupモードは、ISAKMPにはアナログを持っていません。クイックモードとNew GroupモードのためのXCHG値は付録Aで定義されています"
    },
    {
      "indent": 3,
      "text": "Main Mode, Aggressive Mode, and Quick Mode do security association negotiation. Security Association offers take the form of Tranform Payload(s) encapsulated in Proposal Payload(s) encapsulated in Security Association (SA) payload(s). If multiple offers are being made for phase 1 exchanges (Main Mode and Aggressive Mode) they MUST take the form of multiple Transform Payloads for a single Proposal Payload in a single SA payload. To put it another way, for phase 1 exchanges there MUST NOT be multiple Proposal Payloads for a single SA payload and there MUST NOT be multiple SA payloads. This document does not proscribe such behavior on offers in phase 2 exchanges.",
      "ja": "メインモード、アグレッシブモード、クイックモードセキュリティアソシエーションのネゴシエーションを行います。セキュリティアソシエーションは、セキュリティアソシエーション（SA）のペイロード（S）でカプセル化Proposalペイロード（複数可）にカプセル化Tranformペイロード（S）の形をとることができます。複数のオファーは、フェーズ1つの交換（メインモードとアグレッシブモード）のために作られている場合、それらは単一SAペイロード内の単一プロポーザルペイロードのペイロードを変換する複数の形を取らなければなりません。別の言い方をすると、フェーズ1つの交換のための単一のSAペイロードのための複数の提案ペイロードがあってはならないし、複数のSAペイロードがあってはなりません。このドキュメントでは、フェーズ2回の交換での申し出に、そのような行動を禁止していません。"
    },
    {
      "indent": 3,
      "text": "There is no limit on the number of offers the initiator may send to the responder but conformant implementations MAY choose to limit the number of offers it will inspect for performance reasons.",
      "ja": "イニシエータがレスポンダに送るかもしれませんが、準拠実装は、それがパフォーマンス上の理由のために検査しますオファーの数を制限するのを選ぶかもしれオファーの数に制限はありません。"
    },
    {
      "indent": 3,
      "text": "During security association negotiation, initiators present offers for potential security associations to responders. Responders MUST NOT modify attributes of any offer, attribute encoding excepted (see Appendix A). If the initiator of an exchange notices that attribute values have changed or attributes have been added or deleted from an offer made, that response MUST be rejected.",
      "ja": "セキュリティアソシエーションのネゴシエーション中に、レスポンダに潜在的なセキュリティアソシエーションの存在の提供を開始剤です。レスポンダは、任意の提供、除外属性のエンコード（付録Aを参照）の属性を変更してはいけません。属性値を交換通知のイニシエータが変更されているかの属性が作られたプランから追加または削除された場合は、その応答を拒絶しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Four different authentication methods are allowed with either Main Mode or Aggressive Mode-- digital signature, two forms of authentication with public key encryption, or pre-shared key. The value SKEYID is computed seperately for each authentication method.",
      "ja": "四つの異なる認証方法は、公開鍵暗号化、または事前共有鍵と、メインモードまたはアグレッシブMode--デジタル署名のいずれかと認証の2つの形式が許可されています。値SKEYIDは、各認証方式のために別々に計算されます。"
    },
    {
      "indent": 3,
      "text": " For signatures: SKEYID = prf(Ni_b | Nr_b, g^xy) For public key encryption: SKEYID = prf(hash(Ni_b | Nr_b), CKY-I | CKY-R) For pre-shared keys: SKEYID = prf(pre-shared-key, Ni_b | Nr_b)",
      "ja": "SKEYID = PRF（ハッシュ（Ni_b CKY-R | | Nr_b）、CKY-I）事前共有キーの場合：SKEYID = PRF（前|公開鍵暗号化のためのSKEYID = PRF（Nr_b、G ^ XY Ni_b）：署名の-shared-キー、Ni_b | Nr_b）"
    },
    {
      "indent": 3,
      "text": "The result of either Main Mode or Aggressive Mode is three groups of authenticated keying material:",
      "ja": "メインモードまたはアグレッシブモードのいずれかの結果は、認証鍵素材の三つのグループであります："
    },
    {
      "indent": 6,
      "text": "SKEYID_d = prf(SKEYID, g^xy | CKY-I | CKY-R | 0) SKEYID_a = prf(SKEYID, SKEYID_d | g^xy | CKY-I | CKY-R | 1) SKEYID_e = prf(SKEYID, SKEYID_a | g^xy | CKY-I | CKY-R | 2)",
      "ja": "SKEYID_d = PRF（SKEYID、G ^ XY | CKY-I | CKY-R | 0）SKEYID_a = PRF（SKEYID、SKEYID_d | G ^ XY | CKY-I | CKY-R | 1）SKEYID_e = PRF（SKEYID、SKEYID_a | G ^のxy | CKY-I | CKY-R | 2）"
    },
    {
      "indent": 3,
      "text": "and agreed upon policy to protect further communications. The values of 0, 1, and 2 above are represented by a single octet. The key used for encryption is derived from SKEYID_e in an algorithm-specific manner (see appendix B).",
      "ja": "さらに通信を保護するポリシーに同意しました。 0の値は、1、及び2は、上記単一のオクテットによって表されます。暗号化に使用する鍵は、（付録Bを参照）、アルゴリズム特異的にSKEYID_eから誘導されます。"
    },
    {
      "indent": 3,
      "text": "To authenticate either exchange the initiator of the protocol generates HASH_I and the responder generates HASH_R where:",
      "ja": "認証プロトコルのいずれかのイニシエータを交換することHASH_I生成し、レスポンダはHASH_R場所を生成します。"
    },
    {
      "indent": 4,
      "text": "HASH_I = prf(SKEYID, g^xi | g^xr | CKY-I | CKY-R | SAi_b | IDii_b ) HASH_R = prf(SKEYID, g^xr | g^xi | CKY-R | CKY-I | SAi_b | IDir_b )",
      "ja": "HASH_I = PRF（SKEYID、G ^ XI | G ^ XR | CKY-I | CKY-R | SAi_b | IDii_b）HASH_R = PRF（SKEYID、G ^ XR | G ^ XI | CKY-R | CKY-I | SAi_b | IDir_b）"
    },
    {
      "indent": 3,
      "text": "For authentication with digital signatures, HASH_I and HASH_R are signed and verified; for authentication with either public key encryption or pre-shared keys, HASH_I and HASH_R directly authenticate the exchange. The entire ID payload (including ID type, port, and protocol but excluding the generic header) is hashed into both HASH_I and HASH_R.",
      "ja": "デジタル署名の認証のために、HASH_IとHASH_Rは、署名され検証されます。公開鍵暗号化または事前共有キーのいずれかでの認証のために、HASH_IとHASH_Rは直接交換を認証します。 （IDタイプ、ポート、およびプロトコルを含むが、一般的なヘッダを除く）全体IDペイロードはHASH_IとHASH_R双方にハッシュされます。"
    },
    {
      "indent": 3,
      "text": "As mentioned above, the negotiated authentication method influences the content and use of messages for Phase 1 Modes, but not their intent. When using public keys for authentication, the Phase 1 exchange can be accomplished either by using signatures or by using public key encryption (if the algorithm supports it). Following are Phase 1 exchanges with different authentication options.",
      "ja": "前述したように、交渉された認証方法は、彼らの意図フェーズ1モードのためのメッセージの内容や使用に影響はなく、。認証のための公開鍵を使用する場合（アルゴリズムがサポートしている場合）、フェーズ1交換は、署名を使用するか、公開鍵暗号を使用するか、達成することができます。異なる認証オプションとフェーズ1つの交換は以下のとおりです。"
    },
    {
      "indent": 0,
      "text": "5.1 IKE Phase 1 Authenticated With Signatures",
      "section_title": true,
      "ja": "5.1 IKEフェーズ1の署名で認証"
    },
    {
      "indent": 3,
      "text": "Using signatures, the ancillary information exchanged during the second roundtrip are nonces; the exchange is authenticated by signing a mutually obtainable hash. Main Mode with signature authentication is described as follows:",
      "ja": "署名を使用して、補助情報が第2ラウンドトリップ中に交換は一回だけです。交換は相互得られるハッシュに署名することによって認証されます。次のように署名認証の主なモードが記載されています。"
    },
    {
      "indent": 7,
      "text": " Initiator                          Responder\n-----------                        -----------\n HDR, SA                     -->\n                             <--    HDR, SA\n HDR, KE, Ni                 -->\n                             <--    HDR, KE, Nr\n HDR*, IDii, [ CERT, ] SIG_I -->\n                             <--    HDR*, IDir, [ CERT, ] SIG_R",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Aggressive mode with signatures in conjunction with ISAKMP is described as follows:",
      "ja": "次のようにISAKMPと併せて署名とアグレッシブモードが記載されています。"
    },
    {
      "indent": 7,
      "text": " Initiator                          Responder\n-----------                        -----------\n HDR, SA, KE, Ni, IDii       -->\n                             <--    HDR, SA, KE, Nr, IDir,\n                                         [ CERT, ] SIG_R\n HDR, [ CERT, ] SIG_I        -->",
      "raw": true
    },
    {
      "indent": 3,
      "text": "In both modes, the signed data, SIG_I or SIG_R, is the result of the negotiated digital signature algorithm applied to HASH_I or HASH_R respectively.",
      "ja": "両方のモードにおいて、署名されたデータ、SIG_IまたはSIG_Rは、それぞれHASH_IまたはHASH_Rに適用ネゴシエートデジタル署名アルゴリズムの結果です。"
    },
    {
      "indent": 3,
      "text": "In general the signature will be over HASH_I and HASH_R as above using the negotiated prf, or the HMAC version of the negotiated hash function (if no prf is negotiated). However, this can be overridden for construction of the signature if the signature algorithm is tied to a particular hash algorithm (e.g. DSS is only defined with SHA's 160 bit output). In this case, the signature will be over HASH_I and HASH_R as above, except using the HMAC version of the hash algorithm associated with the signature method. The negotiated prf and hash function would continue to be used for all other prescribed pseudo-random functions.",
      "ja": "一般に、署名がネゴシエートPRF、又は（何PRFがネゴシエートされていない場合）ネゴシエートハッシュ関数のHMAC版を用いて上記のようHASH_IとHASH_R上であろう。しかし、この署名アルゴリズムが特定のハッシュアルゴリズムに接続されている場合、署名の構築のためにオーバーライドすることができる（例えば、DSSのみSHAの160ビット出力で定義されます）。この場合、署名は、署名方式に関連付けられたハッシュアルゴリズムのHMAC版を用いた以外は、上記のようにHASH_IとHASH_R上であろう。交渉されたprfとハッシュ関数は、他のすべての所定の擬似ランダム関数のために使用され続けるであろう。"
    },
    {
      "indent": 3,
      "text": "Since the hash algorithm used is already known there is no need to encode its OID into the signature. In addition, there is no binding between the OIDs used for RSA signatures in PKCS #1 and those used in this document. Therefore, RSA signatures MUST be encoded as a private key encryption in PKCS #1 format and not as a signature in PKCS #1 format (which includes the OID of the hash algorithm). DSS signatures MUST be encoded as r followed by s.",
      "ja": "使用されるハッシュアルゴリズムは既に知られているので、署名にそのOIDを符号化する必要はありません。加えて、何PKCS＃1にRSA署名のために使用するOIDと本書で使用されるものとの間の結合は存在しません。したがって、RSA署名は、PKCS＃1形式ではなく、（ハッシュアルゴリズムのOIDを含む）PKCS＃1形式の署名など​​の秘密鍵暗号化として符号化されなければなりません。 DSS署名は、Sに続くRとして符号化されなければなりません。"
    },
    {
      "indent": 3,
      "text": "One or more certificate payloads MAY be optionally passed.",
      "ja": "一つ以上の証明書ペイロードは、必要に応じて渡すことができます。"
    },
    {
      "indent": 0,
      "text": "5.2 Phase 1 Authenticated With Public Key Encryption",
      "section_title": true,
      "ja": "5.2フェーズ1は、公開鍵暗号で認証します"
    },
    {
      "indent": 3,
      "text": "Using public key encryption to authenticate the exchange, the ancillary information exchanged is encrypted nonces. Each party's ability to reconstruct a hash (proving that the other party decrypted the nonce) authenticates the exchange.",
      "ja": "交換を認証するために公開鍵暗号を使用して、補助的な情報は、ナンスを暗号化されて交換しました。 （相手がナンスを復号化されたことを証明する）のハッシュを再構築するために、各当事者の能力が交換を認証します。"
    },
    {
      "indent": 3,
      "text": "In order to perform the public key encryption, the initiator must already have the responder's public key. In the case where the responder has multiple public keys, a hash of the certificate the initiator is using to encrypt the ancillary information is passed as part of the third message. In this way the responder can determine which corresponding private key to use to decrypt the encrypted payloads and identity protection is retained.",
      "ja": "公開鍵暗号化を実行するためには、イニシエータは、すでに応答者の公開鍵を持っている必要があります。レスポンダは、複数の公開鍵を持っている場合には、証明書のハッシュは、開始剤は、第3のメッセージの一部として渡される補助的な情報を暗号化するために使用されます。このように、応答者は、暗号化されたペイロードとアイデンティティの保護を復号化するために使用する秘密鍵に対応するが保持されているかを決定することができます。"
    },
    {
      "indent": 3,
      "text": "In addition to the nonce, the identities of the parties (IDii and IDir) are also encrypted with the other party's public key. If the authentication method is public key encryption, the nonce and identity payloads MUST be encrypted with the public key of the other party. Only the body of the payloads are encrypted, the payload headers are left in the clear.",
      "ja": "ナンスに加えて、パーティー（IDiiとIDIR）のアイデンティティは、相手の公開鍵で暗号化されています。認証方法は、公開鍵暗号である場合は、ナンスとアイデンティティペイロードは、相手の公開鍵で暗号化されなければなりません。ペイロードの本体のみが暗号化され、ペイロードヘッダは明確に残されています。"
    },
    {
      "indent": 3,
      "text": "When using encryption for authentication, Main Mode is defined as follows.",
      "ja": "認証のための暗号化を使用する場合は、次のように、メインモードが定義されています。"
    },
    {
      "indent": 7,
      "text": " Initiator                        Responder\n-----------                      -----------\n HDR, SA                   -->\n                           <--    HDR, SA\n HDR, KE, [ HASH(1), ]\n   <IDii_b>PubKey_r,\n     <Ni_b>PubKey_r        -->\n                                  HDR, KE, <IDir_b>PubKey_i,\n                           <--            <Nr_b>PubKey_i\n HDR*, HASH_I              -->\n                           <--    HDR*, HASH_R",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Aggressive Mode authenticated with encryption is described as follows:",
      "ja": "次のように暗号化と認証されたアグレッシブモードが記載されています："
    },
    {
      "indent": 7,
      "text": " Initiator                        Responder\n-----------                      -----------\n HDR, SA, [ HASH(1),] KE,\n   <IDii_b>Pubkey_r,\n    <Ni_b>Pubkey_r         -->\n                                  HDR, SA, KE, <IDir_b>PubKey_i,\n                           <--         <Nr_b>PubKey_i, HASH_R\n HDR, HASH_I               -->",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Where HASH(1) is a hash (using the negotiated hash function) of the certificate which the initiator is using to encrypt the nonce and identity.",
      "ja": "ここで、HASH（1）は、イニシエータがノンスとアイデンティティを暗号化するために使用される証明書の（ネゴシエートハッシュ関数を使用して）ハッシュです。"
    },
    {
      "indent": 3,
      "text": "RSA encryption MUST be encoded in PKCS #1 format. While only the body of the ID and nonce payloads is encrypted, the encrypted data must be preceded by a valid ISAKMP generic header. The payload length is the length of the entire encrypted payload plus header. The PKCS #1 encoding allows for determination of the actual length of the cleartext payload upon decryption.",
      "ja": "RSA暗号化は、PKCS＃1形式でエンコードされなければなりません。 IDとナンスペイロードの本体のみが暗号化されている一方で、暗号化されたデータは、有効なISAKMPジェネリックヘッダを付ける必要があります。ペイロード長は、全体暗号化されたペイロードを加えたヘッダの長さです。 PKCS＃1の符号化、復号の際に平文ペイロードの実際の長さの決意を可能にします。"
    },
    {
      "indent": 3,
      "text": "Using encryption for authentication provides for a plausably deniable exchange. There is no proof (as with a digital signature) that the conversation ever took place since each party can completely reconstruct both sides of the exchange. In addition, security is added to secret generation since an attacker would have to successfully break not only the Diffie-Hellman exchange but also both RSA encryptions. This exchange was motivated by [SKEME].",
      "ja": "認証のための暗号化を使用すると、plausably否認可能交換を提供します。各当事者が完全に為替の両側を再構築することができるので、会話が今まで起こったこと（デジタル署名のように）証拠はありません。攻撃者がのDiffie-Hellman交換だけでなく、両方のRSAの暗号化だけでなく破るしなければならないので、また、セキュリティが秘密の世代に追加されます。この交換は、[SKEME]によって動機付けました。"
    },
    {
      "indent": 3,
      "text": "Note that, unlike other authentication methods, authentication with public key encryption allows for identity protection with Aggressive Mode.",
      "ja": "他の認証方法とは異なり、公開鍵暗号による認証がアグレッシブモードでのアイデンティティを保護することができます、ということに注意してください。"
    },
    {
      "indent": 0,
      "text": "5.3 Phase 1 Authenticated With a Revised Mode of Public Key Encryption",
      "section_title": true,
      "ja": "公開鍵暗号の改訂モードで認証5.3フェーズ1"
    },
    {
      "indent": 3,
      "text": "Authentication with Public Key Encryption has significant advantages over authentication with signatures (see section 5.2 above). Unfortunately, this is at the cost of 4 public key operations-- two public key encryptions and two private key decryptions. This authentication mode retains the advantages of authentication using public key encryption but does so with half the public key operations.",
      "ja": "公開鍵暗号による認証は、署名（上記のセクション5.2を参照）との認証を超える重要な利点を有しています。残念ながら、これは2つの公開鍵暗号化と2つのプライベートキーデクリプションoperations-- 4公開鍵の費用です。この認証モードでは、公開鍵暗号を使用した認証の利点を保持するが、半分の公開キー操作でそう。"
    },
    {
      "indent": 3,
      "text": "In this mode, the nonce is still encrypted using the public key of the peer, however the peer's identity (and the certificate if it is sent) is encrypted using the negotiated symmetric encryption algorithm (from the SA payload) with a key derived from the nonce. This solution adds minimal complexity and state yet saves two costly public key operations on each side. In addition, the Key Exchange payload is also encrypted using the same derived key. This provides additional protection against cryptanalysis of the Diffie-Hellman exchange.",
      "ja": "（それが送られた場合、証明書）このモードでは、ナンスはまだ、公開ピアの鍵、しかしピアのIDを使用して暗号化されてから派生キーで（SAペイロードから）交渉し、対称暗号化アルゴリズムを使用して暗号化されますナンス。このソリューションは、最小限の複雑さを追加し、状態はまだそれぞれの側にある2つの高価な公開キー操作を保存します。また、鍵交換ペイロードは、同じ派生鍵を使って暗号化されています。これは、のDiffie-Hellman交換の解読法に対して追加的な保護を提供します。"
    },
    {
      "indent": 3,
      "text": "As with the public key encryption method of authentication (section 5.2), a HASH payload may be sent to identify a certificate if the responder has multiple certificates which contain useable public keys (e.g. if the certificate is not for signatures only, either due to certificate restrictions or algorithmic restrictions). If the HASH payload is sent it MUST be the first payload of the second message exchange and MUST be followed by the encrypted nonce. If the HASH payload is not sent, the first payload of the second message exchange MUST be the encrypted nonce. In addition, the initiator my optionally send a certificate payload to provide the responder with a public key with which to respond.",
      "ja": "応答者が使用可能な公開鍵を含む複数の証明書を（持っている場合、認証（セクション5.2）の公開鍵暗号方式と同様に、ハッシュペイロードは、証明書を識別するために送信されても​​よい、例えば証明書のみ、のいずれかにより、証明書への署名のない場合制限やアルゴリズムの制限）。 HASHペイロードが送信された場合には、第2のメッセージ交換の最初のペイロードなければならず、暗号化されたナンスが続かなければなりません。 HASHペイロードが送信されない場合、第2のメッセージ交換の最初のペイロードは、暗号化ナンスでなければなりません。また、イニシエータは、必要に応じて対応するとの公開鍵で応答を提供するために、証明書ペイロードを送る私の。"
    },
    {
      "indent": 3,
      "text": "When using the revised encryption mode for authentication, Main Mode is defined as follows.",
      "ja": "認証のために改訂された暗号化モードを使用する場合は、次のように、メインモードが定義されています。"
    },
    {
      "indent": 7,
      "text": " Initiator                        Responder\n-----------                      -----------\n HDR, SA                   -->\n                           <--    HDR, SA\n HDR, [ HASH(1), ]\n   <Ni_b>Pubkey_r,\n   <KE_b>Ke_i,\n   <IDii_b>Ke_i,\n   [<<Cert-I_b>Ke_i]       -->\n                                  HDR, <Nr_b>PubKey_i,\n                                       <KE_b>Ke_r,\n                           <--         <IDir_b>Ke_r,\n HDR*, HASH_I              -->\n                           <--    HDR*, HASH_R",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Aggressive Mode authenticated with the revised encryption method is described as follows:",
      "ja": "次のように改訂された暗号化方式で認証アグレッシブモードが記載されています："
    },
    {
      "indent": 7,
      "text": " Initiator                        Responder\n-----------                      -----------\n HDR, SA, [ HASH(1),]\n   <Ni_b>Pubkey_r,\n   <KE_b>Ke_i, <IDii_b>Ke_i\n   [, <Cert-I_b>Ke_i ]     -->\n                                  HDR, SA, <Nr_b>PubKey_i,\n                                       <KE_b>Ke_r, <IDir_b>Ke_r,\n                           <--         HASH_R\n HDR, HASH_I               -->",
      "raw": true
    },
    {
      "indent": 3,
      "text": "where HASH(1) is identical to section 5.2. Ke_i and Ke_r are keys to the symmetric encryption algorithm negotiated in the SA payload exchange. Only the body of the payloads are encrypted (in both public key and symmetric operations), the generic payload headers are left in the clear. The payload length includes that added to perform encryption.",
      "ja": "HASH（1）は、セクション5.2と同じです。 Ke_iとKe_rは、SAペイロード交換で交渉対称暗号化アルゴリズムの鍵です。ペイロードの本体のみが（公開鍵と対称操作の両方に）暗号化され、汎用ペイロードヘッダは明確に残されています。ペイロード長は、暗号化を実行するために添加することを含みます。"
    },
    {
      "indent": 3,
      "text": "The symmetric cipher keys are derived from the decrypted nonces as follows. First the values Ne_i and Ne_r are computed:",
      "ja": "次のように対称暗号鍵が復号化ナンスから誘導されます。まず値Ne_iとNe_rが計算されます。"
    },
    {
      "indent": 6,
      "text": "Ne_i = prf(Ni_b, CKY-I) Ne_r = prf(Nr_b, CKY-R)",
      "ja": "Ne_i = PRF（Ni_v、英語）Ne_r = PRF（Nr_v、ENGLISH-P）"
    },
    {
      "indent": 3,
      "text": "The keys Ke_i and Ke_r are then taken from Ne_i and Ne_r respectively in the manner described in Appendix B used to derive symmetric keys for use with the negotiated encryption algorithm. If the length of the output of the negotiated prf is greater than or equal to the key length requirements of the cipher, Ke_i and Ke_r are derived from the most significant bits of Ne_i and Ne_r respectively. If the desired length of Ke_i and Ke_r exceed the length of the output of the prf the necessary number of bits is obtained by repeatedly feeding the results of the prf back into itself and concatenating the result until the necessary number has been achieved. For example, if the negotiated encryption algorithm requires 320 bits of key and the output of the prf is only 128 bits, Ke_i is the most significant 320 bits of K, where",
      "ja": "キーKe_iとKe_rは、その後ネゴシエート暗号化アルゴリズムで使用するための対称鍵を導出するために使用付録Bに記載したように、それぞれNe_iとNe_rから取られます。交渉されたprfの出力の長さがより大きいかまたは暗号の鍵長の要件に等しい場合、Ke_iとKe_rは、それぞれNe_iとNe_rの最上位ビットから導出されます。 Ke_iとKe_rの所望の長さは、PRFの出力ビットの必要数の長さを超えた場合、繰り返しバック自体にPRFの結果を供給し、必要な数が達成されるまで結果を連結することによって得られます。唯一の128ビットネゴシエート暗号アルゴリズム鍵の320ビットを必要とPRFの出力である場合、例えば、Ke_iはKの最上位320ビットであります"
    },
    {
      "indent": 6,
      "text": "K = K1 | K2 | K3 and K1 = prf(Ne_i, 0) K2 = prf(Ne_i, K1) K3 = prf(Ne_i, K2)",
      "ja": "K = K1 | K2 | K3とK1 = PRF（Ne_i、0）K2 = PRF（Ne_i、K1）K3 = PRF（Ne_i、K2）"
    },
    {
      "indent": 3,
      "text": "For brevity, only derivation of Ke_i is shown; Ke_r is identical. The length of the value 0 in the computation of K1 is a single octet. Note that Ne_i, Ne_r, Ke_i, and Ke_r are all ephemeral and MUST be discarded after use.",
      "ja": "簡潔にするため、Ke_iの唯一の導出が示されています。 Ke_rは同じです。 K1の計算における値0の長さは単一オクテットです。 Ne_i、Ne_r、Ke_i、およびKe_rはすべてはかないであり、使用後に廃棄しなければならないことに注意してください。"
    },
    {
      "indent": 3,
      "text": "Save the requirements on the location of the optional HASH payload and the mandatory nonce payload there are no further payload requirements. All payloads-- in whatever order-- following the encrypted nonce MUST be encrypted with Ke_i or Ke_r depending on the direction.",
      "ja": "オプションのHASHペイロードの場所と必須のnonceペイロード上の要件を保存しますそれ以上のペイロード要件はありません。暗号化ナンス次どんなorder--のすべてのpayloads--は方向に応じてKe_iまたはKe_rで暗号化されなければなりません。"
    },
    {
      "indent": 3,
      "text": "If CBC mode is used for the symmetric encryption then the initialization vectors (IVs) are set as follows. The IV for encrypting the first payload following the nonce is set to 0 (zero). The IV for subsequent payloads encrypted with the ephemeral symmetric cipher key, Ke_i, is the last ciphertext block of the previous payload. Encrypted payloads are padded up to the nearest block size. All padding bytes, except for the last one, contain 0x00. The last byte of the padding contains the number of the padding bytes used, excluding the last one. Note that this means there will always be padding.",
      "ja": "CBCモードは、対称暗号化に使用される場合、以下のように、初期化ベクトル（IV）が設定されています。ナンスに続く最初のペイロードを暗号化するためのIVは、0（ゼロ）に設定されています。はかない対称暗号キー、Ke_iで暗号化され、その後のペイロードのためのIVは、前のペイロードの最後の暗号文ブロックです。暗号化されたペイロードは、最寄りのブロックサイズまでパディングされます。すべてのパディングバイトは、最後のものを除いて、0x00に含まれています。パディングの最後のバイトは最後のものを除いて、使用パディングバイト数が含まれています。これは常にパディングがあることを意味していることに注意してください。"
    },
    {
      "indent": 0,
      "text": "5.4 Phase 1 Authenticated With a Pre-Shared Key",
      "section_title": true,
      "ja": "5.4フェーズ1は、事前共有キーで認証します"
    },
    {
      "indent": 3,
      "text": "A key derived by some out-of-band mechanism may also be used to authenticate the exchange. The actual establishment of this key is out of the scope of this document.",
      "ja": "いくつかのアウトオブバンド機構によって導出鍵はまた、交換を認証するために使用されてもよいです。このキーの実際の設立は、この文書の範囲外です。"
    },
    {
      "indent": 3,
      "text": "When doing a pre-shared key authentication, Main Mode is defined as follows:",
      "ja": "事前共有キー認証を行う場合、次のように、メインモードが定義されています。"
    },
    {
      "indent": 13,
      "text": " Initiator                        Responder\n----------                       -----------\n HDR, SA             -->\n                     <--    HDR, SA\n HDR, KE, Ni         -->\n                     <--    HDR, KE, Nr\n HDR*, IDii, HASH_I  -->\n                     <--    HDR*, IDir, HASH_R",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Aggressive mode with a pre-shared key is described as follows:",
      "ja": "次のように事前共有キーでアグレッシブモードが記載されています。"
    },
    {
      "indent": 11,
      "text": " Initiator                        Responder\n-----------                      -----------\n HDR, SA, KE, Ni, IDii -->\n                       <--    HDR, SA, KE, Nr, IDir, HASH_R\n HDR, HASH_I           -->",
      "raw": true
    },
    {
      "indent": 3,
      "text": "When using pre-shared key authentication with Main Mode the key can only be identified by the IP address of the peers since HASH_I must be computed before the initiator has processed IDir. Aggressive Mode allows for a wider range of identifiers of the pre-shared secret to be used. In addition, Aggressive Mode allows two parties to maintain multiple, different pre-shared keys and identify the correct one for a particular exchange.",
      "ja": "メインモードと事前共有キー認証を使用する場合、イニシエータはIDIRを処理した前HASH_Iが計算されなければならないための鍵は、ピアだけのIPアドレスで識別することができます。アグレッシブモードを使用する事前共有秘密の識別子の広い範囲を可能にします。また、アグレッシブモードは、二つの当事者が複数の異なる事前共有キーを維持し、特定の交換のための正しいものを識別することを可能にします。"
    },
    {
      "indent": 0,
      "text": "5.5 Phase 2 - Quick Mode",
      "section_title": true,
      "ja": "5.5フェーズ2  - クイックモード"
    },
    {
      "indent": 3,
      "text": "Quick Mode is not a complete exchange itself (in that it is bound to a phase 1 exchange), but is used as part of the SA negotiation process (phase 2) to derive keying material and negotiate shared policy for non-ISAKMP SAs. The information exchanged along with Quick Mode MUST be protected by the ISAKMP SA-- i.e. all payloads except the ISAKMP header are encrypted. In Quick Mode, a HASH payload MUST immediately follow the ISAKMP header and a SA payload MUST immediately follow the HASH. This HASH authenticates the message and also provides liveliness proofs.",
      "ja": "クイックモード（これはフェーズ1の交換に結合されていることで）完全な交換自体ではなく、鍵材料を導出し、非ISAKMP SAの共有ポリシーを交渉するためにSAのネゴシエーション処理（フェーズ2）の一部として使用されます。クイックモードと一緒に交換される情報は、ISAKMPヘッダを除くすべてのペイロードが暗号化されているISAKMP SA--即ちにより保護されなければなりません。クイックモードでは、HASHペイロードは直ちにISAKMPヘッダに従わなければならなくて、SAペイロードは直ちにHASHに従わなければなりません。このHASHは、メッセージを認証し、また活気証拠を提供します。"
    },
    {
      "indent": 3,
      "text": "The message ID in the ISAKMP header identifies a Quick Mode in progress for a particular ISAKMP SA which itself is identified by the cookies in the ISAKMP header. Since each instance of a Quick Mode uses a unique initialization vector (see Appendix B) it is possible to have multiple simultaneous Quick Modes, based off a single ISAKMP SA, in progress at any one time.",
      "ja": "ISAKMPヘッダ内のメッセージIDは、それ自体がISAKMPヘッダーのクッキーによって識別される特定のISAKMP SAのための進行中のクイックモードを識別する。クイックモードの各インスタンスは一意の初期化ベクトルを使用するので、任意の一時点で進行中で、単一のISAKMP SAオフに基づいて、複数の同時クイックモードを有することが可能である（付録Bを参照）。"
    },
    {
      "indent": 3,
      "text": "Quick Mode is essentially a SA negotiation and an exchange of nonces that provides replay protection. The nonces are used to generate fresh key material and prevent replay attacks from generating bogus security associations. An optional Key Exchange payload can be exchanged to allow for an additional Diffie-Hellman exchange and exponentiation per Quick Mode. While use of the key exchange payload with Quick Mode is optional it MUST be supported.",
      "ja": "クイックモードは、基本的にSAのネゴシエーションと再生保護を提供ナンスの交換です。ナンスは、新鮮なキーマテリアルを生成し、偽のセキュリティアソシエーションを生成するから、リプレイ攻撃を防ぐために使用されています。オプションの鍵交換ペイロードはクイックモードごとの追加のDiffie-Hellman交換と累乗を可能にするために交換することができます。クイックモードで鍵交換ペイロードの使用はオプションですが、それをサポートしなければなりません。"
    },
    {
      "indent": 3,
      "text": "Base Quick Mode (without the KE payload) refreshes the keying material derived from the exponentiation in phase 1. This does not provide PFS. Using the optional KE payload, an additional exponentiation is performed and PFS is provided for the keying material.",
      "ja": "ベースクイックモード（KEペイロードなしの）この1相におけるべき乗に由来する鍵材料は、PFSを提供しないリフレッシュ。オプションのKEペイロードを使用して、追加のべき乗が行われ、PFSは、キーイング材料のために提供されます。"
    },
    {
      "indent": 3,
      "text": "The identities of the SAs negotiated in Quick Mode are implicitly assumed to be the IP addresses of the ISAKMP peers, without any implied constraints on the protocol or port numbers allowed, unless client identifiers are specified in Quick Mode. If ISAKMP is acting as a client negotiator on behalf of another party, the identities of the parties MUST be passed as IDci and then IDcr. Local policy will dictate whether the proposals are acceptable for the identities specified. If the client identities are not acceptable to the Quick Mode responder (due to policy or other reasons), a Notify payload with Notify Message Type INVALID-ID-INFORMATION (18) SHOULD be sent.",
      "ja": "クイックモードで交渉SAのアイデンティティは、暗黙のうちにクライアント識別子がクイックモードで指定されていない限り、許可されたプロトコルやポート番号上の任意の暗黙の制約を受けることなく、ISAKMPピアのIPアドレスであると想定されています。 ISAKMPは、他の当事者に代わってクライアント交渉として動作している場合は、当事者の身元はIDci、その後IDCRとして渡さなければなりません。ローカルポリシーは、提案が指定されたアイデンティティのために許容されるかどうかが決まります。クライアントIDは、（これは、ポリシーまたは他の理由）クイックモードレスポンダに許容されない場合、通知メッセージタイプINVALID-ID-INFORMATION（18）を有する通知ペイロードが送信されるべきです。"
    },
    {
      "indent": 3,
      "text": "The client identities are used to identify and direct traffic to the appropriate tunnel in cases where multiple tunnels exist between two peers and also to allow for unique and shared SAs with different granularities.",
      "ja": "クライアントIDは、一意のを可能にするために、複数のトンネルは、2つのピアとの間に存在する場合には適切なトンネルに識別し、直接トラフィックに使用され、異なる粒度でSAを共有しています。"
    },
    {
      "indent": 3,
      "text": "All offers made during a Quick Mode are logically related and must be consistant. For example, if a KE payload is sent, the attribute describing the Diffie-Hellman group (see section 6.1 and [Pip97]) MUST be included in every transform of every proposal of every SA being negotiated. Similarly, if client identities are used, they MUST apply to every SA in the negotiation.",
      "ja": "クイックモード中に行われたすべてのオファーは、論理的に関連していると一貫性でなければなりません。 KEペイロードが送信される場合、例えば、のDiffie-Hellmanグループを記述する属性（セクション6.1および[Pip97]を参照）ごとにネゴシエートされるすべてのSAのすべての提案の変換に含まれなければなりません。クライアントIDが使用されている場合は同様に、彼らは交渉中のすべてのSAに適用する必要があります。"
    },
    {
      "indent": 3,
      "text": "Quick Mode is defined as follows:",
      "ja": "次のようにクイックモードが定義されています。"
    },
    {
      "indent": 7,
      "text": " Initiator                        Responder\n-----------                      -----------\n HDR*, HASH(1), SA, Ni\n   [, KE ] [, IDci, IDcr ] -->\n                           <--    HDR*, HASH(2), SA, Nr\n                                        [, KE ] [, IDci, IDcr ]\n HDR*, HASH(3)             -->",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Where: HASH(1) is the prf over the message id (M-ID) from the ISAKMP header concatenated with the entire message that follows the hash including all payload headers, but excluding any padding added for encryption. HASH(2) is identical to HASH(1) except the initiator's nonce-- Ni, minus the payload header-- is added after M-ID but before the complete message. The addition of the nonce to HASH(2) is for a liveliness proof. HASH(3)-- for liveliness-- is the prf over the value zero represented as a single octet, followed by a concatenation of the message id and the two nonces-- the initiator's followed by the responder's-- minus the payload header. In other words, the hashes for the above exchange are:",
      "ja": "ここで、HASH（1）すべてのペイロード・ヘッダを含むハッシュを次のメッセージ全体で連結ISAKMPヘッダからメッセージID（M-ID）上PRFであるが、暗号化のために追加されたパディングを除きます。 HASH（2）（1）開始剤のnonce--のNi以外HASHと同一である、マイナスペイロードheader--は、M-IDの後には、完全なメッセージの前に添加されます。 HASHにノンスの添加（2）証明活気のためのものです。 （3）HASH  -  liveliness--ためのメッセージIDの連結に続いて単一のオクテットとして表される値ゼロ、上PRFとイニシエータのresponder's--マイナスペイロードヘッダに続くnonces-- 2です。言い換えれば、上記の交換のためのハッシュは以下のとおりです。"
    },
    {
      "indent": 3,
      "text": "HASH(1) = prf(SKEYID_a, M-ID | SA | Ni [ | KE ] [ | IDci | IDcr ) HASH(2) = prf(SKEYID_a, M-ID | Ni_b | SA | Nr [ | KE ] [ | IDci | IDcr ) HASH(3) = prf(SKEYID_a, 0 | M-ID | Ni_b | Nr_b)",
      "ja": "HASH（1）= PRF（SKEYID_a、M-ID | SA |ニッケル[| KE] [| IDci | IDCR）HASH（2）= PRF（SKEYID_a、M-ID | Ni_b | SA | Nrの[| KE] [| IDci | IDCR）HASH（3）= PRF（SKEYID_a、0 | M-ID | Ni_b | Nr_b）"
    },
    {
      "indent": 3,
      "text": "With the exception of the HASH, SA, and the optional ID payloads, there are no payload ordering restrictions on Quick Mode. HASH(1) and HASH(2) may differ from the illustration above if the order of payloads in the message differs from the illustrative example or if any optional payloads, for example a notify payload, have been chained to the message.",
      "ja": "HASH、SA、およびオプションのIDペイロードを除き、クイックモードには、ペイロードの順序の制限はありません。 HASH（1）とHASH（2）図と異なる場合があり、メッセージ内のペイロードの順序は例示的な実施例とは異なる、または任意のペイロード場合、例えば、通知ペイロードは、メッセージに連鎖されている場合は、上記。"
    },
    {
      "indent": 3,
      "text": "If PFS is not needed, and KE payloads are not exchanged, the new keying material is defined as",
      "ja": "PFSが必要とされていない、とKEペイロードが交換されていない場合は、新しい合わせることの材料は以下のように定義されます"
    },
    {
      "indent": 7,
      "text": "KEYMAT = prf(SKEYID_d, protocol | SPI | Ni_b | Nr_b).",
      "ja": "KEYMAT = PRF鍵（SKEYID_d、プロトコル| SPI | Ni_b | Nr_b）。"
    },
    {
      "indent": 3,
      "text": "If PFS is desired and KE payloads were exchanged, the new keying material is defined as",
      "ja": "PFSが望ましく、KEペイロードが交換された場合は、新しい鍵素材は以下のように定義されます"
    },
    {
      "indent": 7,
      "text": "KEYMAT = prf(SKEYID_d, g(qm)^xy | protocol | SPI | Ni_b | Nr_b)",
      "ja": "KEYMAT = PRF鍵（SKEYID_d、G（QM）^ XY |プロトコル| SPI | Ni_b | Nr_b）"
    },
    {
      "indent": 3,
      "text": "where g(qm)^xy is the shared secret from the ephemeral Diffie-Hellman exchange of this Quick Mode.",
      "ja": "ここで、G（QM）^ XYこのクイックモードの短命のDiffie-Hellman交換から共有秘密です。"
    },
    {
      "indent": 3,
      "text": "In either case, \"protocol\" and \"SPI\" are from the ISAKMP Proposal Payload that contained the negotiated Transform.",
      "ja": "いずれの場合においても、「プロトコル」と「SPI」は変換ネゴシエートを含有ISAKMPプロポーザルペイロードからです。"
    },
    {
      "indent": 3,
      "text": "A single SA negotiation results in two security assocations-- one inbound and one outbound. Different SPIs for each SA (one chosen by the initiator, the other by the responder) guarantee a different key for each direction. The SPI chosen by the destination of the SA is used to derive KEYMAT for that SA.",
      "ja": "1つのインバウンドとアウトバウンドの1 assocations-- 2つのセキュリティにおける単一SAネゴシエーション結果。各SA（イニシエータによって選択される一、レスポンダによって他）に異なるのSPIは、各方向に異なるキーを保証します。 SAの宛先によって選択されたSPIは、SAのKEYMATを導出するために使用されます。"
    },
    {
      "indent": 3,
      "text": "For situations where the amount of keying material desired is greater than that supplied by the prf, KEYMAT is expanded by feeding the results of the prf back into itself and concatenating results until the required keying material has been reached. In other words,",
      "ja": "所望の材料を合わせるの量は、PRFによって供給されるよりも大きい状況では、KEYMATバック自体にPRFの結果を供給し、必要な鍵材料に達するまで結果を連結することによって拡張されます。言い換えると、"
    },
    {
      "indent": 6,
      "text": "KEYMAT = K1 | K2 | K3 | ... where K1 = prf(SKEYID_d, [ g(qm)^xy | ] protocol | SPI | Ni_b | Nr_b) K2 = prf(SKEYID_d, K1 | [ g(qm)^xy | ] protocol | SPI | Ni_b | Nr_b) K3 = prf(SKEYID_d, K2 | [ g(qm)^xy | ] protocol | SPI | Ni_b | Nr_b) etc.",
      "ja": "KEYMAT = K1 | K2 | K3 | ... K1 = PRF鍵（SKEYID_d、[G（QM）^ XY |]プロトコル| SPI | Ni_b | Nr_b）K2 = PRF鍵（SKEYID_d、K1 | [G（QM）^ XY |]プロトコル| SPI | Ni_b | Nr_b）K3 = PRF鍵（SKEYID_d、K2 | [G（QM）^ XY |]プロトコル| SPI | Ni_b | Nr_b）等"
    },
    {
      "indent": 3,
      "text": "This keying material (whether with PFS or without, and whether derived directly or through concatenation) MUST be used with the negotiated SA. It is up to the service to define how keys are derived from the keying material.",
      "ja": "この鍵材料（PFSを伴うまたは伴わないか、直接または連結を介して誘導されたかどうか）をネゴシエートSAを使用する必要があります。これは、キーがキーイング材料に由来している方法を定義するためのサービスまでです。"
    },
    {
      "indent": 3,
      "text": "In the case of an ephemeral Diffie-Hellman exchange in Quick Mode, the exponential (g(qm)^xy) is irretreivably removed from the current state and SKEYID_e and SKEYID_a (derived from phase 1 negotiation) continue to protect and authenticate the ISAKMP SA and SKEYID_d continues to be used to derive keys.",
      "ja": "クイックモードで短命のDiffie-Hellman交換の場合には、指数関数（G（QM）^ X-Y）がirretreivably現在の状態から除去され、（フェーズ1ネゴシエーション由来）SKEYID_eとSKEYID_aは、ISAKMP SAを保護し、認証するために引き続きそしてSKEYID_dは、キーを導出するために使用され続けています。"
    },
    {
      "indent": 3,
      "text": "Using Quick Mode, multiple SA's and keys can be negotiated with one exchange as follows:",
      "ja": "次のようにクイックモードを使用して、複数のSAのとキーが1回の交換と交渉することができます。"
    },
    {
      "indent": 7,
      "text": " Initiator                        Responder\n-----------                      -----------\n HDR*, HASH(1), SA0, SA1, Ni,\n   [, KE ] [, IDci, IDcr ] -->\n                           <--    HDR*, HASH(2), SA0, SA1, Nr,\n                                     [, KE ] [, IDci, IDcr ]\n HDR*, HASH(3)             -->",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The keying material is derived identically as in the case of a single SA. In this case (negotiation of two SA payloads) the result would be four security associations-- two each way for both SAs.",
      "ja": "鍵材料は、単一のSAの場合と同じように導出されます。この場合、（2つのSAペイロードのネゴシエーション）に結果は、両方のSAの各方法2 associations-- 4つのセキュリティであろう。"
    },
    {
      "indent": 0,
      "text": "5.6 New Group Mode",
      "section_title": true,
      "ja": "5.6 New Groupモード"
    },
    {
      "indent": 3,
      "text": "New Group Mode MUST NOT be used prior to establishment of an ISAKMP SA. The description of a new group MUST only follow phase 1 negotiation. (It is not a phase 2 exchange, though).",
      "ja": "New Groupモードは、前ISAKMP SAの確立に使用してはいけません。新しいグループの説明は、フェーズ1ネゴシエーションを従わなければなりません。 （これは、しかし、フェーズ2交換ではありません）。"
    },
    {
      "indent": 7,
      "text": " Initiator                        Responder\n-----------                      -----------\n HDR*, HASH(1), SA        -->\n                          <--     HDR*, HASH(2), SA",
      "raw": true
    },
    {
      "indent": 3,
      "text": "where HASH(1) is the prf output, using SKEYID_a as the key, and the message-ID from the ISAKMP header concatenated with the entire SA proposal, body and header, as the data; HASH(2) is the prf output, using SKEYID_a as the key, and the message-ID from the ISAKMP header concatenated with the reply as the data. In other words the hashes for the above exchange are:",
      "ja": "HASH（1）データのように、キーとしてSKEYID_aを使用して、およびメッセージID全体SA提案、本体とヘッダと連結ISAKMPヘッダから、PRF出力です。 HASH（2）鍵としてSKEYID_aを使用して、PRF出力であり、データとして応答で連結ISAKMPヘッダからメッセージID。つまり、上記の交換のためのハッシュは以下のとおりです。"
    },
    {
      "indent": 6,
      "text": "HASH(1) = prf(SKEYID_a, M-ID | SA) HASH(2) = prf(SKEYID_a, M-ID | SA)",
      "ja": "HASH（1）= PRF（SKEYID_a、M-ID | SA）HASH（2）= PRF（SKEYID_a、M-ID | SA）"
    },
    {
      "indent": 3,
      "text": "The proposal will specify the characteristics of the group (see appendix A, \"Attribute Assigned Numbers\"). Group descriptions for private Groups MUST be greater than or equal to 2^15. If the group is not acceptable, the responder MUST reply with a Notify payload with the message type set to ATTRIBUTES-NOT-SUPPORTED (13).",
      "ja": "提案は（付録A、「属性割り当て番号」を参照）のグループの特性を指定します。プライベートグループのグループの説明は以上2 ^ 15に等しくなければなりません。基が許容できない場合、レスポンダはATTRIBUTES-支持NOT（13）に設定されたメッセージタイプに通知ペイロードで返答しなければなりません。"
    },
    {
      "indent": 3,
      "text": "ISAKMP implementations MAY require private groups to expire with the SA under which they were established.",
      "ja": "ISAKMP実装は、彼らが確立された下SAで期限が切れるように民間団体が必要な場合があります。"
    },
    {
      "indent": 3,
      "text": "Groups may be directly negotiated in the SA proposal with Main Mode. To do this the component parts-- for a MODP group, the type, prime and generator; for a EC2N group the type, the Irreducible Polynomial, Group Generator One, Group Generator Two, Group Curve A, Group Curve B and Group Order-- are passed as SA attributes (see Appendix A). Alternately, the nature of the group can be hidden using New Group Mode and only the group identifier is passed in the clear during phase 1 negotiation.",
      "ja": "グループは、直接メインモードとSAの提案で交渉することができます。プライムと発電MODPグループ、タイプ、このコンポーネントのparts--を行うには、 EC2N・グループのタイプ、既約多項式、グループジェネレータワン、グループジェネレーター二、グループ曲線A、グループBカーブとグループOrder--は（付録Aを参照してください）属性SAとして渡されます。代わりに、グループの性質は、New Groupモードを使用して非表示にすることができ、唯一のグループ識別子は、フェーズ1ネゴシエーションの間に明確に渡されます。"
    },
    {
      "indent": 0,
      "text": "5.7 ISAKMP Informational Exchanges",
      "section_title": true,
      "ja": "5.7 ISAKMP情報交換"
    },
    {
      "indent": 3,
      "text": "This protocol protects ISAKMP Informational Exchanges when possible. Once the ISAKMP security association has been established (and SKEYID_e and SKEYID_a have been generated) ISAKMP Information Exchanges, when used with this protocol, are as follows:",
      "ja": "可能な場合は、このプロトコルは、ISAKMP情報交換を保護します。 ISAKMPの情報交換をISAKMPセキュリティアソシエーションが確立されている（とSKEYID_eとSKEYID_aが生成された）後は、次のように、このプロトコルで使用する場合、以下のとおりです。"
    },
    {
      "indent": 7,
      "text": " Initiator                        Responder\n-----------                      -----------\n HDR*, HASH(1), N/D      -->",
      "raw": true
    },
    {
      "indent": 3,
      "text": "where N/D is either an ISAKMP Notify Payload or an ISAKMP Delete Payload and HASH(1) is the prf output, using SKEYID_a as the key, and a M-ID unique to this exchange concatenated with the entire informational payload (either a Notify or Delete) as the data. In other words, the hash for the above exchange is:",
      "ja": "N / Dは、ISAKMPペイロードを通知したりISAKMPペイロードとHASH（1）鍵としてSKEYID_aを使用して、PRF出力であり、全体の情報ペイロード（いずれかのA通知と連結この交換のM-ID一意の削除のいずれかでありますまたはデータとして）を削除します。言い換えれば、上記の交換のためのハッシュは以下のとおりです。"
    },
    {
      "indent": 6,
      "text": "HASH(1) = prf(SKEYID_a, M-ID | N/D)",
      "ja": "HASH（1）= PRF（SKEYID_a、M-ID | N / D）"
    },
    {
      "indent": 3,
      "text": "As noted the message ID in the ISAKMP header-- and used in the prf computation-- is unique to this exchange and MUST NOT be the same as the message ID of another phase 2 exchange which generated this informational exchange. The derivation of the initialization vector, used with SKEYID_e to encrypt this message, is described in Appendix B.",
      "ja": "メッセージIDは、ISAKMPのheader--に留意し、PRF computation--で使用されるように、この交換に固有であり、この情報交換を発生別のフェーズ2交換のメッセージIDと同じであってはなりません。このメッセージを暗号化するためにSKEYID_eで使用される初期化ベクトルの導出は、付録Bに記載されています"
    },
    {
      "indent": 3,
      "text": "If the ISAKMP security association has not yet been established at the time of the Informational Exchange, the exchange is done in the clear without an accompanying HASH payload.",
      "ja": "ISAKMPセキュリティアソシエーションがまだInformational交換の時に確立されていない場合は、交換を伴うHASHペイロードなしで明確に行われています。"
    },
    {
      "indent": 0,
      "text": "6 Oakley Groups",
      "ja": "6つのオークリーグループ"
    },
    {
      "indent": 3,
      "text": "With IKE, the group in which to do the Diffie-Hellman exchange is negotiated. Four groups-- values 1 through 4-- are defined below. These groups originated with the Oakley protocol and are therefore called \"Oakley Groups\". The attribute class for \"Group\" is defined in Appendix A. All values 2^15 and higher are used for private group identifiers. For a discussion on the strength of the default Oakley groups please see the Security Considerations section below.",
      "ja": "IKEでは、のDiffie-Hellman交換を行うのグループが交渉されています。 1 4--介して四つgroups--値を以下に定義します。これらのグループは、オークリーのプロトコルで発信され、したがって「オークリーグループ」と呼ばれています。 「グループ」の属性クラスは、付録Aに2 ^ 15と高いがプライベートグループ識別子のために使用されているすべての値を定義しています。デフォルトオークリーグループの強さの議論については、以下のセキュリティに関する考慮事項のセクションを参照してください。"
    },
    {
      "indent": 3,
      "text": "These groups were all generated by Richard Schroeppel at the University of Arizona. Properties of these groups are described in [Orm96].",
      "ja": "これらのグループは、すべてのアリゾナ大学のリチャード・シュロエッペルによって生成されました。これらのグループの権利については[Orm96]を参照。"
    },
    {
      "indent": 0,
      "text": "6.1 First Oakley Default Group",
      "section_title": true,
      "ja": "6.1まずオークリーのデフォルトグループ"
    },
    {
      "indent": 3,
      "text": "Oakley implementations MUST support a MODP group with the following prime and generator. This group is assigned id 1 (one).",
      "ja": "オークリーの実装は、以下の素数とジェネレータを持つMODPグループをサポートしなければなりません。このグループが割り当てられているID 1（1）。"
    },
    {
      "indent": 6,
      "text": "The prime is: 2^768 - 2 ^704 - 1 + 2^64 * { [2^638 pi] + 149686 } Its hexadecimal value is",
      "ja": "素数は2 ^ 768から2 ^ 704  -  16進値は1 + 2 ^ 64 * {[2 ^ 638 PI] + 149686}"
    },
    {
      "indent": 9,
      "text": "FFFFFFFF FFFFFFFF C90FDAA2 2168C234 C4C6628B 80DC1CD1 29024E08 8A67CC74 020BBEA6 3B139B22 514A0879 8E3404DD EF9519B3 CD3A431B 302B0A6D F25F1437 4FE1356D 6D51C245 E485B576 625E7EC6 F44C42E9 A63A3620 FFFFFFFF FFFFFFFF",
      "ja": "FFFFFFFF FFFFFFFF C90FDAA2 2168C234 C4C6628B 80DC1CD1 29024E08 8A67CC74 020BBEA6 3B139B22 514A0879 8E3404DD EF9519B3 CD3A431B 302B0A6D F25F1437 4FE1356D 6D51C245 E485B576 625E7EC6 F44C42E9 A63A3620 FFFFFFFF FFFFFFFF"
    },
    {
      "indent": 6,
      "text": "The generator is: 2.",
      "ja": "発電機は、次のとおりです。2。"
    },
    {
      "indent": 0,
      "text": "6.2 Second Oakley Group",
      "section_title": true,
      "ja": "6.2セカンドオークリーグループ"
    },
    {
      "indent": 3,
      "text": "IKE implementations SHOULD support a MODP group with the following prime and generator. This group is assigned id 2 (two).",
      "ja": "IKEの実装は、以下の素数とジェネレータを持つMODPグループをサポートする必要があります。このグループが割り当てられているIDが2（二）。"
    },
    {
      "indent": 3,
      "text": "The prime is 2^1024 - 2^960 - 1 + 2^64 * { [2^894 pi] + 129093 }. Its hexadecimal value is",
      "ja": "2 ^ 960  -   -  1 + 2 ^ 64 * {[2 ^ 894 PI] + 129093}素数は2 ^ 1024。 16進値であります"
    },
    {
      "indent": 9,
      "text": "FFFFFFFF FFFFFFFF C90FDAA2 2168C234 C4C6628B 80DC1CD1\n29024E08 8A67CC74 020BBEA6 3B139B22 514A0879 8E3404DD\nEF9519B3 CD3A431B 302B0A6D F25F1437 4FE1356D 6D51C245\nE485B576 625E7EC6 F44C42E9 A637ED6B 0BFF5CB6 F406B7ED\nEE386BFB 5A899FA5 AE9F2411 7C4B1FE6 49286651 ECE65381\nFFFFFFFF FFFFFFFF",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The generator is 2 (decimal)",
      "ja": "発電機2（10進数）であります"
    },
    {
      "indent": 0,
      "text": "6.3 Third Oakley Group",
      "section_title": true,
      "ja": "6.3サードオークリーグループ"
    },
    {
      "indent": 3,
      "text": "IKE implementations SHOULD support a EC2N group with the following characteristics. This group is assigned id 3 (three). The curve is based on the Galois Field GF[2^155]. The field size is 155. The irreducible polynomial for the field is: u^155 + u^62 + 1. The equation for the elliptic curve is: y^2 + xy = x^3 + ax^2 + b.",
      "ja": "IKEの実装は、次の特性を持つEC2N基をサポートしなければなりません。このグループは、ID 3（3つ）が割り当てられます。曲線は、ガロア体GF [2 ^ 155]に基づいています。フィールドサイズは、フィールドの既約多項式である155である：U ^ 155 + U ^ 62 + 1楕円曲線の方程式である：Y ^ 2 + X-Y = X ^ 3 +斧^ 2 + B。"
    },
    {
      "indent": 3,
      "text": "Field Size: 155 Group Prime/Irreducible Polynomial: 0x0800000000000000000000004000000000000001 Group Generator One: 0x7b Group Curve A: 0x0 Group Curve B: 0x07338f",
      "ja": "フィールドサイズ：155グループプライム/既約多項式：0x0800000000000000000000004000000000000001グループジェネレータワン：0x7BとグループカーブA：0x0のグループカーブB：0x07338f"
    },
    {
      "indent": 3,
      "text": "Group Order: 0X0800000000000000000057db5698537193aef944",
      "ja": "グループ順序：0X0800000000000000000057db5698537193aef944"
    },
    {
      "indent": 3,
      "text": "The data in the KE payload when using this group is the value x from the solution (x,y), the point on the curve chosen by taking the randomly chosen secret Ka and computing Ka*P, where * is the repetition of the group addition and double operations, P is the curve point with x coordinate equal to generator 1 and the y coordinate determined from the defining equation. The equation of curve is implicitly known by the Group Type and the A and B coefficients. There are two possible values for the y coordinate; either one can be used successfully (the two parties need not agree on the selection).",
      "ja": "このグループを使用する溶液（x、y）は、ランダムに選択された秘密のKaをとり、*は基の繰り返しでのKa * Pを計算することにより、選択された曲線上の点のx値であるKEペイロード内のデータまた、ダブル操作、Pは、X 1ジェネレータおよびyは定義式から決定された座標に等しい座標を有する曲線点です。曲線の式は暗黙的にグループの種類と、AとBの係数によって知られています。 Y座標のための2つの可能な値が存在します。どちらか一方を正常に使用することができます（両当事者が選択に同意する必要はありません）。"
    },
    {
      "indent": 0,
      "text": "6.4 Fourth Oakley Group",
      "section_title": true,
      "ja": "6.4第四オークリーグループ"
    },
    {
      "indent": 3,
      "text": "IKE implementations SHOULD support a EC2N group with the following characteristics. This group is assigned id 4 (four). The curve is based on the Galois Field GF[2^185]. The field size is 185. The irreducible polynomial for the field is: u^185 + u^69 + 1. The equation for the elliptic curve is: y^2 + xy = x^3 + ax^2 + b.",
      "ja": "IKEの実装は、次の特性を持つEC2N基をサポートしなければなりません。このグループが割り当てられたID 4（4つ）。曲線は、ガロア体GF [2 ^ 185]に基づいています。フィールドサイズは、フィールドの既約多項式である185である：U ^ 185 + U ^ 69 + 1楕円曲線の方程式である：Y ^ 2 + X-Y = X ^ 3 +斧^ 2 + B。"
    },
    {
      "indent": 3,
      "text": "Field Size: 185 Group Prime/Irreducible Polynomial: 0x020000000000000000000000000000200000000000000001 Group Generator One: 0x18 Group Curve A: 0x0 Group Curve B: 0x1ee9",
      "ja": "フィールドサイズ：185グループプライム/既約多項式：0x020000000000000000000000000000200000000000000001グループジェネレータワン：0x18のグループカーブA：0x0のグループカーブB：0x1ee9"
    },
    {
      "indent": 3,
      "text": "Group Order: 0X01ffffffffffffffffffffffdbf2f889b73e484175f94ebc",
      "ja": "グループ順序：0X01ffffffffffffffffffffffdbf2f889b73e484175f94ebc"
    },
    {
      "indent": 3,
      "text": "The data in the KE payload when using this group will be identical to that as when using Oakley Group 3 (three).",
      "ja": "このグループを使用してKEペイロード内のデータがオークリーグループ3（3）を使用する場合のようなものと同じであろう。"
    },
    {
      "indent": 3,
      "text": "Other groups can be defined using New Group Mode. These default groups were generated by Richard Schroeppel at the University of Arizona. Properties of these primes are described in [Orm96].",
      "ja": "他のグループは新しいグループモードを使用して定義することができます。これらのデフォルト・グループは、アリゾナ大学のリチャード・シュロエッペルによって生成されました。これらの素数の権利については[Orm96]を参照。"
    },
    {
      "indent": 0,
      "text": "7. Payload Explosion for a Complete IKE Exchange",
      "section_title": true,
      "ja": "完全なIKE交換のため7ペイロード爆発"
    },
    {
      "indent": 3,
      "text": "This section illustrates how the IKE protocol is used to:",
      "ja": "このセクションでは、IKEプロトコルがどのように使われるかを示しています。"
    },
    {
      "indent": 6,
      "text": "- establish a secure and authenticated channel between ISAKMP processes (phase 1); and",
      "ja": " -  ISAKMPプロセス（相1）との間の安全かつ認証されたチャネルを確立します。そして"
    },
    {
      "indent": 6,
      "text": "- generate key material for, and negotiate, an IPsec SA (phase 2).",
      "ja": " - のための鍵素材を生成し、交渉、IPsecのSA（フェーズ2）。"
    },
    {
      "indent": 0,
      "text": "7.1 Phase 1 using Main Mode",
      "section_title": true,
      "ja": "メインモードを使用して7.1フェーズ1"
    },
    {
      "indent": 3,
      "text": "The following diagram illustrates the payloads exchanged between the two parties in the first round trip exchange. The initiator MAY propose several proposals; the responder MUST reply with one.",
      "ja": "次の図は、ペイロードは、最初のラウンドトリップ交換二つの当事者間で交換示します。イニシエータは、いくつかの提案を提案することができます。レスポンダは1に返答しなければなりません。"
    },
    {
      "indent": 6,
      "text": " 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n~             ISAKMP Header with XCHG of Main Mode,             ~\n~                  and Next Payload of ISA_SA                   ~\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n!       0       !    RESERVED   !        Payload Length         !\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n!                  Domain of Interpretation                     !\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n!                          Situation                            !\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n!       0       !    RESERVED   !        Payload Length         !\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n!  Proposal #1  ! PROTO_ISAKMP  ! SPI size = 0  | # Transforms  !\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n!    ISA_TRANS  !    RESERVED   !        Payload Length         !\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n!  Transform #1 !  KEY_OAKLEY   |          RESERVED2            !\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n~                   prefered SA attributes                      ~\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n!       0       !    RESERVED   !        Payload Length         !\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n!  Transform #2 !  KEY_OAKLEY   |          RESERVED2            !\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n~                   alternate SA attributes                     ~\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The responder replies in kind but selects, and returns, one transform proposal (the ISAKMP SA attributes).",
      "ja": "種類が、選択、およびリターンの応答者の回答は、1の提案を変換（ISAKMP SA属性）。"
    },
    {
      "indent": 3,
      "text": "The second exchange consists of the following payloads:",
      "ja": "第二の交換は、次のペイロードで構成されています。"
    },
    {
      "indent": 6,
      "text": " 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n~             ISAKMP Header with XCHG of Main Mode,             ~\n~                  and Next Payload of ISA_KE                   ~\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n!    ISA_NONCE  !    RESERVED   !        Payload Length         !\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n~   D-H Public Value  (g^xi from initiator g^xr from responder) ~\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n!       0       !    RESERVED   !        Payload Length         !\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n~         Ni (from initiator) or  Nr (from responder)           ~\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The shared keys, SKEYID_e and SKEYID_a, are now used to protect and authenticate all further communication. Note that both SKEYID_e and SKEYID_a are unauthenticated.",
      "ja": "共有鍵、SKEYID_eとSKEYID_aは、今保護し、すべての通信を認証するために使用されています。 SKEYID_eとSKEYID_aの両方が認証されていないことに注意してください。"
    },
    {
      "indent": 6,
      "text": " 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n~            ISAKMP Header with XCHG of Main Mode,              ~\n~     and Next Payload of ISA_ID and the encryption bit set     ~\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n!    ISA_SIG    !    RESERVED   !        Payload Length         !\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n~        Identification Data of the ISAKMP negotiator           ~\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n!       0       !    RESERVED   !        Payload Length         !\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n~       signature verified by the public key of the ID above    ~\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The key exchange is authenticated over a signed hash as described in section 5.1. Once the signature has been verified using the authentication algorithm negotiated as part of the ISAKMP SA, the shared keys, SKEYID_e and SKEYID_a can be marked as authenticated. (For brevity, certificate payloads were not exchanged).",
      "ja": "セクション5.1で説明したように鍵交換は、署名されたハッシュ上に認証されます。署名は、ISAKMP SAの一部としてネゴシエートされた認証アルゴリズム、共有鍵を用いて検証されたら認証として、SKEYID_eとSKEYID_aをマークすることができます。 （簡潔にするために、証明書ペイロードは交換されませんでした）。"
    },
    {
      "indent": 0,
      "text": "7.2 Phase 2 using Quick Mode",
      "section_title": true,
      "ja": "クイックモードを使用して7.2フェーズ2"
    },
    {
      "indent": 3,
      "text": "The following payloads are exchanged in the first round of Quick Mode with ISAKMP SA negotiation. In this hypothetical exchange, the ISAKMP negotiators are proxies for other parties which have requested authentication.",
      "ja": "以下のペイロードは、ISAKMP SAネゴシエーションとクイックモードの最初のラウンドで交換されます。この仮想的な交流では、ISAKMP交渉は、認証を要求した他の当事者のためのプロキシです。"
    },
    {
      "indent": 6,
      "text": " 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n~            ISAKMP Header with XCHG of Quick Mode,             ~\n~   Next Payload of ISA_HASH and the encryption bit set         ~\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n!     ISA_SA    !    RESERVED   !        Payload Length         !\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n~                 keyed hash of message                         ~\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n!   ISA_NONCE   !    RESERVED   !         Payload Length        !\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n!                 Domain Of Interpretation                      !\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n!                          Situation                            !\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n!       0       !    RESERVED   !        Payload Length         !\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 6,
      "text": "!  Proposal #1  ! PROTO_IPSEC_AH! SPI size = 4  | # Transforms  !\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n~                        SPI (4 octets)                         ~\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n!    ISA_TRANS  !    RESERVED   !        Payload Length         !\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n!  Transform #1 !     AH_SHA    |          RESERVED2            !\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n!                       other SA attributes                     !\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n!       0       !    RESERVED   !        Payload Length         !\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n!  Transform #2 !     AH_MD5    |          RESERVED2            !\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n!                       other SA attributes                     !\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n!    ISA_ID     !    RESERVED   !        Payload Length         !\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n~                            nonce                              ~\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n!    ISA_ID     !    RESERVED   !        Payload Length         !\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n~              ID of source for which ISAKMP is a client        ~\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n!      0        !    RESERVED   !        Payload Length         !\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n~           ID of destination for which ISAKMP is a client      ~\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "where the contents of the hash are described in 5.5 above. The responder replies with a similar message which only contains one transform-- the selected AH transform. Upon receipt, the initiator can provide the key engine with the negotiated security association and the keying material. As a check against replay attacks, the responder waits until receipt of the next message.",
      "ja": "どこハッシュの内容は、上記5.5で説明されています。レスポンダは一つだけが選択されたAHトランスフォームtransform--含まれている同様のメッセージで応答します。受信すると、イニシエータは、ネゴシエートセキュリティアソシエーションとキーイングマテリアルとキーエンジンを提供することができます。リプレイ攻撃に対するチェックとして、レスポンダは、次のメッセージを受信するまで待機します。"
    },
    {
      "indent": 6,
      "text": " 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n~          ISAKMP Header with XCHG of Quick Mode,               ~\n~   Next Payload of ISA_HASH and the encryption bit set         ~\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n!       0       !    RESERVED   !        Payload Length         !\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n~                         hash data                             ~\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "where the contents of the hash are described in 5.5 above.",
      "ja": "どこハッシュの内容は、上記5.5で説明されています。"
    },
    {
      "indent": 0,
      "text": "8. Perfect Forward Secrecy Example",
      "section_title": true,
      "ja": "8.完全転送秘密例"
    },
    {
      "indent": 3,
      "text": "This protocol can provide PFS of both keys and identities. The identies of both the ISAKMP negotiating peer and, if applicable, the identities for whom the peers are negotiating can be protected with PFS.",
      "ja": "このプロトコルは、鍵とアイデンティティの両方のPFSを提供することができます。両方のISAKMP交渉相手のidentiesと、該当する場合は、ピアが交渉している誰のためのアイデンティティはPFSで保護することができます。"
    },
    {
      "indent": 3,
      "text": "To provide Perfect Forward Secrecy of both keys and all identities, two parties would perform the following:",
      "ja": "キーとすべてのアイデンティティの両方の完全転送秘密を提供するために、両当事者は、以下を実行します："
    },
    {
      "indent": 6,
      "text": "o A Main Mode Exchange to protect the identities of the ISAKMP peers. This establishes an ISAKMP SA. o A Quick Mode Exchange to negotiate other security protocol protection. This establishes a SA on each end for this protocol. o Delete the ISAKMP SA and its associated state.",
      "ja": "Oメインモード交換は、ISAKMPピアのアイデンティティを保護します。これは、ISAKMP SAを確立します。 OクイックモードのExchangeは、他のセキュリティプロトコルの保護を交渉します。これは、このプロトコルの各端部にSAを確立します。 O ISAKMP SAとそれに関連付けられた状態を削除します。"
    },
    {
      "indent": 3,
      "text": "Since the key for use in the non-ISAKMP SA was derived from the single ephemeral Diffie-Hellman exchange PFS is preserved.",
      "ja": "非ISAKMP SAで使用するための重要なので、PFSは、保存された単一の短命のDiffie-Hellman交換に由来しました。"
    },
    {
      "indent": 3,
      "text": "To provide Perfect Forward Secrecy of merely the keys of a non-ISAKMP security association, it in not necessary to do a phase 1 exchange if an ISAKMP SA exists between the two peers. A single Quick Mode in which the optional KE payload is passed, and an additional Diffie-Hellman exchange is performed, is all that is required. At this point the state derived from this Quick Mode must be deleted from the ISAKMP SA as described in section 5.5.",
      "ja": "ISAKMP SAは、2つのピア間で存在する場合、それは必要ありませんで、非ISAKMPセキュリティアソシエーションの単なるキーの完全転送秘密を提供するためにフェーズ1交換を行います。任意KEペイロードが渡され、追加のDiffie-Hellman交換が行われ、必要とされる全てである。れた単一のクイックモード5.5節で説明したように、この時点では、このクイックモード由来の状態は、ISAKMP SAから削除する必要があります。"
    },
    {
      "indent": 0,
      "text": "9. Implementation Hints",
      "section_title": true,
      "ja": "9.実装のヒント"
    },
    {
      "indent": 3,
      "text": "Using a single ISAKMP Phase 1 negotiation makes subsequent Phase 2 negotiations extremely quick. As long as the Phase 1 state remains cached, and PFS is not needed, Phase 2 can proceed without any exponentiation. How many Phase 2 negotiations can be performed for a single Phase 1 is a local policy issue. The decision will depend on the strength of the algorithms being used and level of trust in the peer system.",
      "ja": "単一ISAKMPフェーズ1ネゴシエーションを使用すると、後続のフェーズ2つのネゴシエーションが非常に迅速になります。限りフェーズ1の状態はキャッシュされたままとなり、PFSを必要としない、フェーズ2は、任意の指数計算なしで進めることができます。どのように多くのフェーズ2つのネゴシエーション単一フェーズ1のために実行することができ、ローカルポリシーの問題です。決定は、ピア・システムで使用され、レベルの信頼されているアルゴリズムの強度に依存するであろう。"
    },
    {
      "indent": 3,
      "text": "An implementation may wish to negotiate a range of SAs when performing Quick Mode. By doing this they can speed up the \"re-keying\". Quick Mode defines how KEYMAT is defined for a range of SAs. When one peer feels it is time to change SAs they simply use the next one within the stated range. A range of SAs can be established by negotiating multiple SAs (identical attributes, different SPIs) with one Quick Mode.",
      "ja": "実装は、クイックモードを実行する際のSAの範囲を交渉することを望むかもしれません。これを行うことにより、彼らは、「再入力」をスピードアップすることができます。クイックモードはKEYMATがSAの範囲に定義されている方法を定義します。一方のピアは、彼らが単に記載された範囲内の次のいずれかを使用するSAを変更するには時間があると感じた場合。 SAの範囲は、一クイックモードで複数のSA（同じ属性、別のSPI）を交渉することによって確立することができます。"
    },
    {
      "indent": 3,
      "text": "An optimization that is often useful is to establish Security Associations with peers before they are needed so that when they become needed they are already in place. This ensures there would be no delays due to key management before initial data transmission. This optimization is easily implemented by setting up more than one Security Association with a peer for each requested Security Association and caching those not immediately used.",
      "ja": "有用であることがしばしばある最適化は、彼らがすでに配置されている必要になったときにように、彼らが必要とされる前に、ピアとセキュリティアソシエーションを確立することです。これは、初期データ伝送の前に鍵管理のために何の遅れはないだろうが保証されます。この最適化を容易に要求されたセキュリティアソシエーションのピアで複数のセキュリティアソシエーションを設定し、すぐに使用されていないものをキャッシュすることによって実装されています。"
    },
    {
      "indent": 3,
      "text": "Also, if an ISAKMP implementation is alerted that a SA will soon be needed (e.g. to replace an existing SA that will expire in the near future), then it can establish the new SA before that new SA is needed.",
      "ja": "ISAKMP実装はSAがすぐに必要とされるであろうことを警告された場合も、その新しいSAが必要とされる前に、それは新しいSAを確立することができ、（例えば、近い将来に期限切れとなる既存のSAを交換します）。"
    },
    {
      "indent": 3,
      "text": "The base ISAKMP specification describes conditions in which one party of the protocol may inform the other party of some activity-- either deletion of a security association or in response to some error in the protocol such as a signature verification failed or a payload failed to decrypt. It is strongly suggested that these Informational exchanges not be responded to under any circumstances. Such a condition may result in a \"notify war\" in which failure to understand a message results in a notify to the peer who cannot understand it and sends his own notify back which is also not understood.",
      "ja": "ベースISAKMP仕様はプロトコルの一方の当事者は、署名検証に失敗したか、またはペイロードが復号化に失敗したセキュリティアソシエーションのまたはプロトコルで何らかのエラーに応答して、削除のいずれかactivity--いくつかの他の当事者に通知してもよいした条件を記述する。強く、これらの情報交換は、いかなる状況下に反応されていないことが示唆されました。このような状態はそれを理解できないピアに通知し、また、理解されていないバック通知彼自身を送信し、メッセージの結果を理解するのに失敗して「戦争を通知」をもたらすことができます。"
    },
    {
      "indent": 0,
      "text": "10. Security Considerations",
      "section_title": true,
      "ja": "10.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "This entire memo discusses a hybrid protocol, combining parts of Oakley and parts of SKEME with ISAKMP, to negotiate, and derive keying material for, security associations in a secure and authenticated manner.",
      "ja": "この全体のメモは交渉するために、ISAKMPとオークリーとSKEMEの部品の一部を組み合わせた、ハイブリッド・プロトコルを説明し、そして安全で認証された方法で、セキュリティアソシエーションの鍵材料を導出します。"
    },
    {
      "indent": 3,
      "text": "Confidentiality is assured by the use of a negotiated encryption algorithm. Authentication is assured by the use of a negotiated method: a digital signature algorithm; a public key algorithm which supports encryption; or, a pre-shared key. The confidentiality and authentication of this exchange is only as good as the attributes negotiated as part of the ISAKMP security association.",
      "ja": "機密性は、交渉された暗号化アルゴリズムを使用することによって保証されます。認証がネゴシエートされた方法の使用によって保証されるデジタル署名アルゴリズム。暗号化をサポートしている公開鍵アルゴリズム。または、事前共有キー。この交換の機密性と認証は、ISAKMPセキュリティアソシエーションの一部として交渉された属性と同じくらい良いです。"
    },
    {
      "indent": 3,
      "text": "Repeated re-keying using Quick Mode can consume the entropy of the Diffie-Hellman shared secret. Implementors should take note of this fact and set a limit on Quick Mode Exchanges between exponentiations. This memo does not prescribe such a limit.",
      "ja": "繰り返しの再キーイングのDiffie-Hellmanの共有秘密のエントロピーを消費することができるクイックモードを使用しました。実装者はこの事実をメモを取り、べき乗の間にクイックモード交換に制限を設定する必要があります。このメモは、このような制限を規定していません。"
    },
    {
      "indent": 3,
      "text": "Perfect Forward Secrecy (PFS) of both keying material and identities is possible with this protocol. By specifying a Diffie-Hellman group, and passing public values in KE payloads, ISAKMP peers can establish PFS of keys-- the identities would be protected by SKEYID_e from the ISAKMP SA and would therefore not be protected by PFS. If PFS of both keying material and identities is desired, an ISAKMP peer MUST establish only one non-ISAKMP security association (e.g. IPsec Security Association) per ISAKMP SA. PFS for keys and identities is accomplished by deleting the ISAKMP SA (and optionally issuing a DELETE message) upon establishment of the single non-ISAKMP SA. In this way a phase one negotiation is uniquely tied to a single phase two negotiation, and the ISAKMP SA established during phase one negotiation is never used again.",
      "ja": "キーイング材料と同一の両方の完全転送秘密（PFS）は、このプロトコルで可能です。 Diffie-Hellmanグループを指定し、KEペイロードで公開値を渡すことによって、ISAKMPピアはアイデンティティがISAKMP SAからSKEYID_eによって保護されるため、PFSで保護されないことになりkeys--のPFSを確立することができます。キーイング材料と同一の両方のPFSが望まれる場合、ISAKMPピアは、唯一の非ISAKMPセキュリティアソシエーションISAKMP SA当たり（例えばIPsecのセキュリティアソシエーション）を確立しなければなりません。キーと同一のためのPFSは、単一の非ISAKMP SAの確立時にISAKMP SAを削除（および必要に応じて削除メッセージを発行する）ことによって達成されます。このように、第一段階の交渉を一意単相2交渉に縛られ、ISAKMP SAが再び使用されることはありませんフェーズ1ネゴシエーション中に設立しました。"
    },
    {
      "indent": 3,
      "text": "The strength of a key derived from a Diffie-Hellman exchange using any of the groups defined here depends on the inherent strength of the group, the size of the exponent used, and the entropy provided by the random number generator used. Due to these inputs it is difficult to determine the strength of a key for any of the defined groups. The default Diffie-Hellman group (number one) when used with a strong random number generator and an exponent no less than 160 bits is sufficient to use for DES. Groups two through four provide greater security. Implementations should make note of these conservative estimates when establishing policy and negotiating security parameters.",
      "ja": "ここで定義されたグループのいずれかを使用したDiffie-Hellman交換から導出鍵の強度は、グループの固有の強度、使用される指数のサイズ、および使用される乱数発生器によって提供されるエントロピーに依存します。これらの入力には、定義されたグループのいずれかのためのキーの強度を決定することは困難です。デフォルトのDiffie-Hellmanグループ（ナンバーワン）の強力な乱数発生器と指数と共に使用無未満160ビットDESのために使用するのに十分です。 2〜4のグループは、よりセキュリティを提供します。ポリシーを確立し、セキュリティパラメータをネゴシエートするとき、実装はこれらの保守的な見積もりの​​ノートを作る必要があります。"
    },
    {
      "indent": 3,
      "text": "Note that these limitations are on the Diffie-Hellman groups themselves. There is nothing in IKE which prohibits using stronger groups nor is there anything which will dilute the strength obtained from stronger groups. In fact, the extensible framework of IKE encourages the definition of more groups; use of elliptical curve groups will greatly increase strength using much smaller numbers.",
      "ja": "これらの制限はのDiffie-Hellmanグループ自身であることに注意してください。強力なグループを使用禁止にも強いグループから得た強さを希釈します何があるIKEでは何もありません。実際には、IKEの拡張可能なフレームワークは、複数のグループの定義を奨励します。楕円曲線群の使用が大幅にはるかに小さい数字を使用して強度を増加します。"
    },
    {
      "indent": 3,
      "text": "For situations where defined groups provide insufficient strength New Group Mode can be used to exchange a Diffie-Hellman group which provides the necessary strength. In is incumbent upon implementations to check the primality in groups being offered and independently arrive at strength estimates.",
      "ja": "定義された基が強度不足をもたらす状況に関する新規グループモードは、必要な強度を提供するのDiffie-Hellmanグループを交換するために使用することができます。実装は、グループ内の素数が提供されているチェックして、独立して強度の推定に到達する際には、現職です。"
    },
    {
      "indent": 3,
      "text": "It is assumed that the Diffie-Hellman exponents in this exchange are erased from memory after use. In particular, these exponents must not be derived from long-lived secrets like the seed to a pseudo-random generator.",
      "ja": "この交換でのDiffie-Hellman指数は、使用後にメモリから消去されているものとします。特に、これらの指数は、擬似乱数生成器にシードのような長命の秘密から派生してはいけません。"
    },
    {
      "indent": 3,
      "text": "IKE exchanges maintain running initialization vectors (IV) where the last ciphertext block of the last message is the IV for the next message. To prevent retransmissions (or forged messages with valid cookies) from causing exchanges to get out of sync IKE implementations SHOULD NOT update their running IV until the decrypted message has passed a basic sanity check and has been determined to actually advance the IKE state machine-- i.e. it is not a retransmission.",
      "ja": "IKE交換は、最後のメッセージの最後の暗号文ブロックは、次のメッセージのためにIVで初期化ベクトル（IV）を実行して維持します。復号化されたメッセージは、基本的な妥当性検査に合格した、実際にIKEの状態を前進させるために決定されるまで、その実行中のIVを更新しないべきで同期IKEの実装から抜け出すために交流を引き起こしてから再送信（または有効なクッキーと偽造メッセージ）を防ぐために、machine--すなわち、それは再送信ではありません。"
    },
    {
      "indent": 3,
      "text": "While the last roundtrip of Main Mode (and optionally the last message of Aggressive Mode) is encrypted it is not, strictly speaking, authenticated. An active substitution attack on the ciphertext could result in payload corruption. If such an attack corrupts mandatory payloads it would be detected by an authentication failure, but if it corrupts any optional payloads (e.g. notify payloads chained onto the last message of a Main Mode exchange) it might not be detectable.",
      "ja": "最後のメインモードの往復（およびアグレッシブモードの最後のメッセージをオプションで）暗号化されますが、それは、厳密に言えば、認証されていません。暗号文のアクティブ置換攻撃は、ペイロードの破損につながる可能性があります。このような攻撃は必須ペイロードが破損した場合には、認証の失敗によって検出されるであろうが、それは任意のペイロード（例えばメインモード交換の最後のメッセージに連鎖ペイロードを通知する）破損した場合には検出できない可能性があります。"
    },
    {
      "indent": 0,
      "text": "11. IANA Considerations",
      "section_title": true,
      "ja": "11. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document contains many \"magic numbers\" to be maintained by the IANA. This section explains the criteria to be used by the IANA to assign additional numbers in each of these lists.",
      "ja": "この文書は、IANAによって維持することが多く、「マジックナンバー」が含まれています。このセクションでは、これらの各リストに追加番号を割り当てるためにIANAによって使用される基準を説明しています。"
    },
    {
      "indent": 0,
      "text": "11.1 Attribute Classes",
      "section_title": true,
      "ja": "11.1属性クラス"
    },
    {
      "indent": 3,
      "text": "Attributes negotiated in this protocol are identified by their class. Requests for assignment of new classes must be accompanied by a standards-track RFC which describes the use of this attribute.",
      "ja": "このプロトコルで交渉した属性は、そのクラスによって識別されます。新しいクラスの割り当てを求めるには、この属性を使用することが記載さ標準トラックRFCによらなければなりません。"
    },
    {
      "indent": 0,
      "text": "11.2 Encryption Algorithm Class",
      "section_title": true,
      "ja": "11.2暗号化アルゴリズムクラス"
    },
    {
      "indent": 3,
      "text": "Values of the Encryption Algorithm Class define an encryption algorithm to use when called for in this document. Requests for assignment of new encryption algorithm values must be accompanied by a reference to a standards-track or Informational RFC or a reference to published cryptographic literature which describes this algorithm.",
      "ja": "暗号化アルゴリズムクラスの値は、この文書のために呼び出されるときに使用する暗号化アルゴリズムを定義します。新しい暗号化アルゴリズム値の割り当てを求めるには、標準化トラックもしくは情報のRFCへの参照や、このアルゴリズムを説明し、公開暗号文献への参照を添付しなければなりません。"
    },
    {
      "indent": 0,
      "text": "11.3 Hash Algorithm",
      "section_title": true,
      "ja": "11.3ハッシュアルゴリズム"
    },
    {
      "indent": 3,
      "text": "Values of the Hash Algorithm Class define a hash algorithm to use when called for in this document. Requests for assignment of new hash algorithm values must be accompanied by a reference to a standards-track or Informational RFC or a reference to published cryptographic literature which describes this algorithm. Due to the key derivation and key expansion uses of HMAC forms of hash algorithms in IKE, requests for assignment of new hash algorithm values must take into account the cryptographic properties-- e.g it's resistance to collision-- of the hash algorithm itself.",
      "ja": "ハッシュアルゴリズムクラスの値は、この文書のために呼び出されるときに使用するハッシュアルゴリズムを定義します。新しいハッシュアルゴリズム値の割り当てを求めるには、標準化トラックもしくは情報のRFCへの参照や、このアルゴリズムを説明し、公開暗号文献への参照を添付しなければなりません。鍵導出し、IKEでハッシュアルゴリズムのHMAC形式のキーの拡張用途に、新しいハッシュアルゴリズム値の割り当てに対する要求はproperties--例えば、アカウントに暗号を取る必要があり、それは、ハッシュアルゴリズム自体のcollision--への抵抗です。"
    },
    {
      "indent": 0,
      "text": "11.4 Group Description and Group Type",
      "section_title": true,
      "ja": "11.4グループの説明とグループの種類"
    },
    {
      "indent": 3,
      "text": "Values of the Group Description Class identify a group to use in a Diffie-Hellman exchange. Values of the Group Type Class define the type of group. Requests for assignment of new groups must be accompanied by a reference to a standards-track or Informational RFC which describes this group. Requests for assignment of new group types must be accompanied by a reference to a standards-track or Informational RFC or by a reference to published cryptographic or mathmatical literature which describes the new type.",
      "ja": "グループの説明クラスの値は、のDiffie-Hellman交換に使用するグループを識別します。グループのタイプクラスの値は、グループのタイプを定義します。新しいグループの割り当てを求めるには、このグループを記述する標準化トラックもしくは情報のRFCへの参照を添付しなければなりません。新しいグループタイプの割り当てを求めるには、標準化トラックもしくは情報のRFCへの参照によって、または新しいタイプを記述し、公開暗号や数理文献への参照を添付しなければなりません。"
    },
    {
      "indent": 0,
      "text": "11.5 Life Type",
      "section_title": true,
      "ja": "11.5寿命タイプ"
    },
    {
      "indent": 3,
      "text": "Values of the Life Type Class define a type of lifetime to which the ISAKMP Security Association applies. Requests for assignment of new life types must be accompanied by a detailed description of the units of this type and its expiry.",
      "ja": "ライフタイプクラスの値は、ISAKMPセキュリティアソシエーションが適用される寿命のタイプを定義します。新しい人生のタイプの割り当てを求めるには、このタイプとその有効期限の単位の詳細な説明を添付しなければなりません。"
    },
    {
      "indent": 0,
      "text": "12. Acknowledgements",
      "section_title": true,
      "ja": "12.謝辞"
    },
    {
      "indent": 3,
      "text": "This document is the result of close consultation with Hugo Krawczyk, Douglas Maughan, Hilarie Orman, Mark Schertler, Mark Schneider, and Jeff Turner. It relies on protocols which were written by them. Without their interest and dedication, this would not have been written.",
      "ja": "この文書では、ヒューゴKrawczyk、ダグラス・モーガン、ヒラリーオーマン、マークSchertler、マーク・シュナイダー、そしてジェフ・ターナーとの緊密な協議の結果です。それはそれらによって書かれたプロトコルに依存しています。彼らの関心と献身がなければ、これは書かれていません。"
    },
    {
      "indent": 3,
      "text": "Special thanks Rob Adams, Cheryl Madson, Derrell Piper, Harry Varnis, and Elfed Weaver for technical input, encouragement, and various sanity checks along the way.",
      "ja": "技術的な入力、励まし、そして道に沿って様々な健全性チェックのための特別な感謝ロブ・アダムス、シェリルMadson、Derrellパイパー、ハリーVarnis、およびElfedウィーバー。"
    },
    {
      "indent": 3,
      "text": "We would also like to thank the many members of the IPSec working group that contributed to the development of this protocol over the past year.",
      "ja": "我々はまた、一年間このプロトコルの開発に貢献したIPSecワーキンググループの多くのメンバーに感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "13. References",
      "section_title": true,
      "ja": "13.参考文献"
    },
    {
      "indent": 3,
      "text": "[CAST] Adams, C., \"The CAST-128 Encryption Algorithm\", RFC 2144, May 1997.",
      "ja": "[CAST]アダムス、C.、 \"CAST-128暗号化アルゴリズム\"、RFC 2144、1997年5月。"
    },
    {
      "indent": 3,
      "text": "[BLOW] Schneier, B., \"The Blowfish Encryption Algorithm\", Dr. Dobb's Journal, v. 19, n. 4, April 1994.",
      "ja": "[BLOW]シュナイアー、B.、 \"フグ暗号化アルゴリズム\"、博士ドッブのジャーナル、V。19、N。 4、1994年4月。"
    },
    {
      "indent": 3,
      "text": "[Bra97] Bradner, S., \"Key Words for use in RFCs to indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[Bra97]ブラドナーの、S.、 \"要件レベルを示すRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[DES] ANSI X3.106, \"American National Standard for Information Systems-Data Link Encryption\", American National Standards Institute, 1983.",
      "ja": "[DES] ANSI X3.106、「情報のためのアメリカ国立標準システム、データリンク暗号化」、米国規格協会、1983。"
    },
    {
      "indent": 3,
      "text": "[DH] Diffie, W., and Hellman M., \"New Directions in Cryptography\", IEEE Transactions on Information Theory, V. IT-22, n. 6, June 1977.",
      "ja": "[DH]ディフィー、W.、およびヘルマンM.、 \"暗号に関する新\"、情報理論に関するIEEEトランザクション、V. IT-22、N。 6、1977年6月。"
    },
    {
      "indent": 3,
      "text": "[DSS] NIST, \"Digital Signature Standard\", FIPS 186, National Institute of Standards and Technology, U.S. Department of Commerce, May, 1994.",
      "ja": "[DSS] NISTは、「デジタル署名標準」、186、アメリカ国立標準技術研究所、米国商務省が、月、1994 FIPS。"
    },
    {
      "indent": 3,
      "text": "[IDEA] Lai, X., \"On the Design and Security of Block Ciphers,\" ETH Series in Information Processing, v. 1, Konstanz: Hartung-Gorre Verlag, 1992",
      "ja": "[IDEA]ライ、X.、情報処理におけるETHシリーズ、V 1、コンスタンツ \"デザインとブロック暗号の安全保障、オン\"：。アルトゥング-Gorre Verlag社、1992"
    },
    {
      "indent": 3,
      "text": "[KBC96] Krawczyk, H., Bellare, M., and R. Canetti, \"HMAC: Keyed-Hashing for Message Authentication\", RFC 2104, February 1997.",
      "ja": "[KBC96] Krawczyk、H.、ベラー、M.、およびR.カネッティ、 \"HMAC：メッセージ認証のための鍵付きハッシュ化\"、RFC 2104、1997年2月。"
    },
    {
      "indent": 3,
      "text": "[SKEME] Krawczyk, H., \"SKEME: A Versatile Secure Key Exchange Mechanism for Internet\", from IEEE Proceedings of the 1996 Symposium on Network and Distributed Systems Security.",
      "ja": "[SKEME] Krawczyk、H.は、：1996ネットワーク上のシンポジウムや分散システムのセキュリティのIEEE議事録から、「SKEME多彩なインターネットのための鍵交換メカニズムを固定します」。"
    },
    {
      "indent": 3,
      "text": "[MD5] Rivest, R., \"The MD5 Message Digest Algorithm\", RFC 1321, April 1992.",
      "ja": "[MD5] Rivest氏、R.、 \"MD5メッセージダイジェストアルゴリズム\"、RFC 1321、1992年4月。"
    },
    {
      "indent": 3,
      "text": "[MSST98] Maughhan, D., Schertler, M., Schneider, M., and J. Turner, \"Internet Security Association and Key Management Protocol (ISAKMP)\", RFC 2408, November 1998.",
      "ja": "[MSST98] Maughhan、D.、Schertler、M.、シュナイダー、M.、およびJ.ターナー、 \"インターネットセキュリティ協会と鍵管理プロトコル（ISAKMP）\"、RFC 2408、1998年11月。"
    },
    {
      "indent": 3,
      "text": "[Orm96] Orman, H., \"The Oakley Key Determination Protocol\", RFC 2412, November 1998.",
      "ja": "[Orm96]オーマン、H.、 \"オークリーキー決意プロトコル\"、RFC 2412、1998年11月。"
    },
    {
      "indent": 3,
      "text": "[PKCS1] RSA Laboratories, \"PKCS #1: RSA Encryption Standard\", November 1993.",
      "ja": "[PKCS1] RSA Laboratories社、 \"PKCS＃1：RSA暗号化規格\"、1993年11月。"
    },
    {
      "indent": 3,
      "text": "[Pip98] Piper, D., \"The Internet IP Security Domain Of Interpretation for ISAKMP\", RFC 2407, November 1998.",
      "ja": "[Pip98]パイパー、D.、 \"ISAKMPのための解釈のインターネットIPセキュリティー領域\"、RFC 2407、1998年11月。"
    },
    {
      "indent": 3,
      "text": "[RC5] Rivest, R., \"The RC5 Encryption Algorithm\", Dr. Dobb's Journal, v. 20, n. 1, January 1995.",
      "ja": "[RC5]リベスト、R.、 \"RC5暗号化アルゴリズム\"、博士ドッブのジャーナル、V。20、N。 1、1995年1月。"
    },
    {
      "indent": 3,
      "text": "[RSA] Rivest, R., Shamir, A., and Adleman, L., \"A Method for Obtaining Digital Signatures and Public-Key Cryptosystems\", Communications of the ACM, v. 21, n. 2, February 1978.",
      "ja": "[RSA]リベスト、R.、シャミル、A.、およびエーデルマン、L、N、ACM、V 21の通信、 \"デジタル署名と公開鍵暗号を得るための方法\"。 2、1978年2月。"
    },
    {
      "indent": 3,
      "text": "[Sch96] Schneier, B., \"Applied Cryptography, Protocols, Algorithms, and Source Code in C\", 2nd edition.",
      "ja": "[Sch96]シュナイアー、B.、 \"応用暗号、プロトコル、アルゴリズム、およびCにおけるソースコード\"、第2版。"
    },
    {
      "indent": 3,
      "text": "[SHA] NIST, \"Secure Hash Standard\", FIPS 180-1, National Institue of Standards and Technology, U.S. Department of Commerce, May 1994.",
      "ja": "[SHA] NIST、「セキュアハッシュ標準」、180-1、アメリカ国立標準技術研究所、米国商務省が、1994年5月FIPS。"
    },
    {
      "indent": 3,
      "text": "[TIGER] Anderson, R., and Biham, E., \"Fast Software Encryption\", Springer LNCS v. 1039, 1996.",
      "ja": "[TIGER]アンダーソン、R.、およびBiham、E.、 \"高速ソフトウェア暗号化\"、スプリンガーLNCS V。1039、1996。"
    },
    {
      "indent": 0,
      "text": "Appendix A",
      "ja": "付録A"
    },
    {
      "indent": 3,
      "text": "This is a list of DES Weak and Semi-Weak keys. The keys come from [Sch96]. All keys are listed in hexidecimal.",
      "ja": "これは、DES弱いと半弱いキーの一覧です。キーは[Sch96]から来ます。すべてのキーは16進数で記載されています。"
    },
    {
      "indent": 7,
      "text": "DES Weak Keys\n0101 0101 0101 0101\n1F1F 1F1F E0E0 E0E0\nE0E0 E0E0 1F1F 1F1F\nFEFE FEFE FEFE FEFE",
      "raw": true
    },
    {
      "indent": 7,
      "text": "DES Semi-Weak Keys 01FE 01FE 01FE 01FE 1FE0 1FE0 0EF1 0EF1 01E0 01E0 01F1 01F1 1FFE 1FFE 0EFE 0EFE 011F 011F 010E 010E E0FE E0FE F1FE F1FE",
      "ja": "DES半弱の鍵01FE 01FE 01FE 01FE 1FE0 1FE0 0EF1 0EF1 01E0 01E0 01F1 01F1 1FFE 1FFE 0EFE 0EFE 011F 011F 010E 010E E0FE E0FE F1FE F1FE"
    },
    {
      "indent": 7,
      "text": "FE01 FE01 FE01 FE01 E01F E01F F10E F10E E001 E001 F101 F101 FE1F FE1F FE0E FE0E 1F01 1F01 0E01 0E01 FEE0 FEE0 FEF1 FEF1",
      "ja": "FE01 FE01 FE01 FE01 E01F E01F F10E F10E E001 E001 F101 F101 FE1F FE1F FE0E FE0E 1F01 1F01 0E01 0E01 FEE0 FEE0 FEF1 FEF1"
    },
    {
      "indent": 3,
      "text": "Attribute Assigned Numbers",
      "ja": "属性割り当て番号"
    },
    {
      "indent": 3,
      "text": "Attributes negotiated during phase one use the following definitions. Phase two attributes are defined in the applicable DOI specification (for example, IPsec attributes are defined in the IPsec DOI), with the exception of a group description when Quick Mode includes an ephemeral Diffie-Hellman exchange. Attribute types can be either Basic (B) or Variable-length (V). Encoding of these attributes is defined in the base ISAKMP specification as Type/Value (Basic) and Type/Length/Value (Variable).",
      "ja": "フェーズ1の間で交渉の属性は以下の定義を使用します。相二つの属性は、クイックモードが短命のDiffie-Hellman交換を含むグループの説明を除いて、（例えば、IPsecの属性はIPsecのDOIで定義されて）適用DOI仕様で定義されています。タイプは基本（B）または可変長（V）のいずれかとすることができる属性。これらの属性のエンコーディングは、タイプ/値（基本）とタイプ/長さ/値（変数）として基地ISAKMP仕様で定義されています。"
    },
    {
      "indent": 3,
      "text": "Attributes described as basic MUST NOT be encoded as variable. Variable length attributes MAY be encoded as basic attributes if their value can fit into two octets. If this is the case, an attribute offered as variable (or basic) by the initiator of this protocol MAY be returned to the initiator as a basic (or variable).",
      "ja": "基本として説明した属性は、変数としてコード化してはなりません。その値が2つのオクテットに収まることができれば、可変長属性は、基本的な属性として符号化することができます。この場合、このプロトコルのイニシエータによって変数（または塩基）として提供される属性は、基本的な（または変数）としてイニシエータに戻すことができます。"
    },
    {
      "indent": 3,
      "text": "Attribute Classes",
      "ja": "属性クラス"
    },
    {
      "indent": 5,
      "text": "     class                         value              type\n-------------------------------------------------------------------\n Encryption Algorithm                1                 B\n Hash Algorithm                      2                 B\n Authentication Method               3                 B\n Group Description                   4                 B\n Group Type                          5                 B\n Group Prime/Irreducible Polynomial  6                 V\n Group Generator One                 7                 V\n Group Generator Two                 8                 V\n Group Curve A                       9                 V\n Group Curve B                      10                 V\n Life Type                          11                 B\n Life Duration                      12                 V\n PRF                                13                 B\n Key Length                         14                 B\n Field Size                         15                 B\n Group Order                        16                 V",
      "raw": true
    },
    {
      "indent": 3,
      "text": "values 17-16383 are reserved to IANA. Values 16384-32767 are for private use among mutually consenting parties.",
      "ja": "値17-16383は、IANAに予約されています。値は16384から32767は、互いに同意当事者間の私的使用のためのものです。"
    },
    {
      "indent": 3,
      "text": "Class Values",
      "ja": "クラス値"
    },
    {
      "indent": 3,
      "text": "- Encryption Algorithm Defined In DES-CBC 1 RFC 2405 IDEA-CBC 2 Blowfish-CBC 3 RC5-R16-B64-CBC 4 3DES-CBC 5 CAST-CBC 6",
      "ja": " - 暗号化アルゴリズムDES-CBC 1 RFCにおいて定義2405 IDEA-CBC 2フグ-CBC 3 RC5-R16-B64-CBC 4つの3DES-CBC 5 CAST-CBC 6"
    },
    {
      "indent": 5,
      "text": "values 7-65000 are reserved to IANA. Values 65001-65535 are for private use among mutually consenting parties.",
      "ja": "値7から65000は、IANAに予約されています。値は65001から65535は、互いに同意当事者間の私的使用のためのものです。"
    },
    {
      "indent": 3,
      "text": "- Hash Algorithm Defined In MD5 1 RFC 1321 SHA 2 FIPS 180-1 Tiger 3 See Reference [TIGER]",
      "ja": " -  MD5 1 RFC 1321 SHAで定義ハッシュアルゴリズム2つのFIPS 180-1タイガー3参照文献[TIGER]"
    },
    {
      "indent": 5,
      "text": "values 4-65000 are reserved to IANA. Values 65001-65535 are for private use among mutually consenting parties.",
      "ja": "値4から65000は、IANAに予約されています。値は65001から65535は、互いに同意当事者間の私的使用のためのものです。"
    },
    {
      "indent": 3,
      "text": "- Authentication Method pre-shared key 1 DSS signatures 2 RSA signatures 3 Encryption with RSA 4 Revised encryption with RSA 5",
      "ja": " - 認証方法事前共有鍵1人のDSS署名2人のRSA署名RSA 4 RSA 5に改訂暗号化3暗号化"
    },
    {
      "indent": 5,
      "text": "values 6-65000 are reserved to IANA. Values 65001-65535 are for private use among mutually consenting parties.",
      "ja": "値6から65000は、IANAに予約されています。値は65001から65535は、互いに同意当事者間の私的使用のためのものです。"
    },
    {
      "indent": 3,
      "text": "- Group Description default 768-bit MODP group (section 6.1) 1",
      "ja": " - グループ説明デフォルトの768ビットMODPグループ（セクション6.1）1"
    },
    {
      "indent": 6,
      "text": "alternate 1024-bit MODP group (section 6.2) 2",
      "ja": "代替1024ビットMODPグループ（セクション6.2）2"
    },
    {
      "indent": 6,
      "text": "EC2N group on GP[2^155] (section 6.3) 3",
      "ja": "GP [2 ^ 155]（セクション6.3）3でEC2N基"
    },
    {
      "indent": 6,
      "text": "EC2N group on GP[2^185] (section 6.4) 4",
      "ja": "GP [2 ^ 185]（セクション6.4）4にEC2N基"
    },
    {
      "indent": 5,
      "text": "values 5-32767 are reserved to IANA. Values 32768-65535 are for private use among mutually consenting parties.",
      "ja": "値は5から32767は、IANAに予約されています。値は32768から65535は、互いに同意当事者間の私的使用のためのものです。"
    },
    {
      "indent": 3,
      "text": "- Group Type MODP (modular exponentiation group) 1 ECP (elliptic curve group over GF[P]) 2 EC2N (elliptic curve group over GF[2^N]) 3",
      "ja": " - グループの種類MODP（べき乗剰余群）1 ECP 2 EC2N（GF [P]上の楕円曲線群）（GFの上の楕円曲線群[2 ^ N]）3"
    },
    {
      "indent": 5,
      "text": "values 4-65000 are reserved to IANA. Values 65001-65535 are for private use among mutually consenting parties.",
      "ja": "値4から65000は、IANAに予約されています。値は65001から65535は、互いに同意当事者間の私的使用のためのものです。"
    },
    {
      "indent": 3,
      "text": "- Life Type seconds 1 kilobytes 2",
      "ja": " - ライフタイプ秒1キロバイト2"
    },
    {
      "indent": 5,
      "text": "values 3-65000 are reserved to IANA. Values 65001-65535 are for private use among mutually consenting parties. For a given \"Life Type\" the value of the \"Life Duration\" attribute defines the actual length of the SA life-- either a number of seconds, or a number of kbytes protected.",
      "ja": "値3から65000は、IANAに予約されています。値は65001から65535は、互いに同意当事者間の私的使用のためのものです。与えられた「寿命タイプ」の場合は「寿命」の値は、属性は、秒数、または保護されたキロバイト数のいずれかlife-- SAの実際の長さを定義します。"
    },
    {
      "indent": 3,
      "text": "- PRF There are currently no pseudo-random functions defined.",
      "ja": " -  PRF定義された擬似ランダム機能はありません。"
    },
    {
      "indent": 5,
      "text": "values 1-65000 are reserved to IANA. Values 65001-65535 are for private use among mutually consenting parties.",
      "ja": "値は1から65000は、IANAに予約されています。値は65001から65535は、互いに同意当事者間の私的使用のためのものです。"
    },
    {
      "indent": 3,
      "text": "- Key Length",
      "ja": " - キーの長さ"
    },
    {
      "indent": 5,
      "text": "When using an Encryption Algorithm that has a variable length key, this attribute specifies the key length in bits. (MUST use network byte order). This attribute MUST NOT be used when the specified Encryption Algorithm uses a fixed length key.",
      "ja": "可変長キーを持っている暗号化アルゴリズムを使用している場合、この属性は、ビット単位の鍵の長さを指定します。 （ネットワークバイトオーダーを使用しなければなりません）。指定された暗号化アルゴリズムは、固定長キーを使用している場合、この属性を使用してはいけません。"
    },
    {
      "indent": 3,
      "text": "- Field Size",
      "ja": " - フィールドサイズ"
    },
    {
      "indent": 5,
      "text": "The field size, in bits, of a Diffie-Hellman group.",
      "ja": "Diffie-Hellmanグループのビットのフィールドサイズ、。"
    },
    {
      "indent": 3,
      "text": "- Group Order",
      "ja": " - グループの順序"
    },
    {
      "indent": 5,
      "text": "The group order of an elliptical curve group. Note the length of this attribute depends on the field size.",
      "ja": "楕円曲線群のグループ順序。この属性の長さは、フィールドのサイズによって異なります。"
    },
    {
      "indent": 3,
      "text": "Additional Exchanges Defined-- XCHG values Quick Mode 32 New Group Mode 33",
      "ja": "追加の交換Defined-- XCHG値クイックモード32 New Groupモード33"
    },
    {
      "indent": 0,
      "text": "Appendix B",
      "ja": "付録B"
    },
    {
      "indent": 3,
      "text": "This appendix describes encryption details to be used ONLY when encrypting ISAKMP messages. When a service (such as an IPSEC transform) utilizes ISAKMP to generate keying material, all encryption algorithm specific details (such as key and IV generation, padding, etc...) MUST be defined by that service. ISAKMP does not purport to ever produce keys that are suitable for any encryption algorithm. ISAKMP produces the requested amount of keying material from which the service MUST generate a suitable key. Details, such as weak key checks, are the responsibility of the service.",
      "ja": "この付録では、ISAKMPメッセージを暗号化する場合にのみ使用される暗号化の詳細を説明します。 （IPSecなどの変換）サービスは、材料をキーイング生成するISAKMPを利用する場合、（そのようなキーとIV生成、パディング、等...など）は、すべての暗号化アルゴリズムの具体的な詳細が、そのサービスによって定義されなければなりません。 ISAKMPは、これまでの任意の暗号化アルゴリズムに適している鍵を生成するために意図していません。 ISAKMPは、サービスが適切なキーを生成しなければならないから、キーイング材料の要求された量を生成します。このような弱いキーのチェックなどの詳細は、サービスの責任です。"
    },
    {
      "indent": 3,
      "text": "Use of negotiated PRFs may require the PRF output to be expanded due to the PRF feedback mechanism employed by this document. For example, if the (ficticious) DOORAK-MAC requires 24 bytes of key but produces only 8 bytes of output, the output must be expanded three times before being used as the key for another instance of itself. The output of a PRF is expanded by feeding back the results of the PRF into itself to generate successive blocks. These blocks are concatenated until the requisite number of bytes has been acheived. For example, for pre-shared key authentication with DOORAK-MAC as the negotiated PRF:",
      "ja": "交渉さのPRFの使用は、本文書で採用PRFフィードバック機構に拡張するPRF出力が必要な場合があります。 （架空）DOORAK-MACは、鍵の24バイトを必要とするが、出力の唯一の8バイトを生成する場合、例えば、出力は、それ自体の別のインスタンスのためのキーとして使用される前に3倍に拡大されなければなりません。 PRFの出力は、連続したブロックを生成するために、それ自体にPRFの結果をフィードバックすることによって拡張されます。バイトの必要な数がacheivedされるまでこれらのブロックは連結されます。例えば、ネゴシエートされたPRFとしてDOORAK-MACとの事前共有鍵認証のために："
    },
    {
      "indent": 3,
      "text": " BLOCK1-8 = prf(pre-shared-key, Ni_b | Nr_b) BLOCK9-16 = prf(pre-shared-key, BLOCK1-8 | Ni_b | Nr_b) BLOCK17-24 = prf(pre-shared-key, BLOCK9-16 | Ni_b | Nr_b) and SKEYID = BLOCK1-8 | BLOCK9-16 | BLOCK17-24",
      "ja": "BLOCK1-8 = PRF（事前共有鍵、Ni_b | Nr_b）BLOCK9-16 = PRF（事前共有鍵、BLOCK1-8 | Ni_b | Nr_b）BLOCK17-24 = PRF（事前共有鍵、BLOCK9- 16 | Ni_b | Nr_b）とSKEYID = BLOCK1-8 | BLOCK9-16 | BLOCK17-24"
    },
    {
      "indent": 3,
      "text": "so therefore to derive SKEYID_d:",
      "ja": "そのため、SKEYID_dを導出します。"
    },
    {
      "indent": 3,
      "text": " BLOCK1-8 = prf(SKEYID, g^xy | CKY-I | CKY-R | 0) BLOCK9-16 = prf(SKEYID, BLOCK1-8 | g^xy | CKY-I | CKY-R | 0) BLOCK17-24 = prf(SKEYID, BLOCK9-16 | g^xy | CKY-I | CKY-R | 0) and SKEYID_d = BLOCK1-8 | BLOCK9-16 | BLOCK17-24",
      "ja": "BLOCK1-8 = PRF（SKEYID、G ^ XY | CKY-I | CKY-R | 0）BLOCK9-16 = PRF（SKEYID、BLOCK1-8 | G ^ XY | CKY-I | CKY-R | 0）BLOCK17- 24 = PRF（SKEYID、BLOCK9-16 | G ^ XY | CKY-I | CKY-R | 0）とSKEYID_d = BLOCK1-8 | BLOCK9-16 | BLOCK17-24"
    },
    {
      "indent": 3,
      "text": "Subsequent PRF derivations are done similarly.",
      "ja": "後続のPRFの派生も同様に行われます。"
    },
    {
      "indent": 3,
      "text": "Encryption keys used to protect the ISAKMP SA are derived from SKEYID_e in an algorithm-specific manner. When SKEYID_e is not long enough to supply all the necessary keying material an algorithm requires, the key is derived from feeding the results of a pseudo-random function into itself, concatenating the results, and taking the highest necessary bits.",
      "ja": "ISAKMP SAを保護するために使用される暗号鍵は、アルゴリズム固有の方法でSKEYID_eから誘導されます。 SKEYID_eアルゴリズムが必要とするすべての必要な鍵材料を供給するのに十分に長くない場合、キーは、それ自体に擬似ランダム関数の結果を供給する結果を連結し、そして最高必要なビットを取ることに由来します。"
    },
    {
      "indent": 3,
      "text": "For example, if (ficticious) algorithm AKULA requires 320-bits of key (and has no weak key check) and the prf used to generate SKEYID_e only generates 120 bits of material, the key for AKULA, would be the first 320-bits of Ka, where:",
      "ja": "（架空の）アルゴリズムAKULAキーの320ビットを必要とする（そして弱い鍵チェックを持っていない）とSKEYID_eを生成するために使用されるPRFは、材料のみの120ビット、AKULAための鍵を生成する場合、例えば、最初の320ビットであろうカー、："
    },
    {
      "indent": 3,
      "text": " Ka = K1 | K2 | K3 and K1 = prf(SKEYID_e, 0) K2 = prf(SKEYID_e, K1) K3 = prf(SKEYID_e, K2)",
      "ja": "= K1 | K2 | K3とK1 = Prfを（Skeid_i、0）、B 2 = Prfを（Skeid_i、B 1）3​​ = PrfをB（Skeid_i、B 2）"
    },
    {
      "indent": 3,
      "text": "where prf is the negotiated prf or the HMAC version of the negotiated hash function (if no prf was negotiated) and 0 is represented by a single octet. Each result of the prf provides 120 bits of material for a total of 360 bits. AKULA would use the first 320 bits of that 360 bit string.",
      "ja": "ここで、PRFは、交渉されたprfまたはネゴシエートハッシュ関数のHMACバージョンである（非PRFがネゴシエートされなかった場合）、0は単一オクテットで表されます。 PRFの各結果は、360ビットの合計の材料の120ビットを提供します。 AKULAは、360ビット列の最初の320ビットを使用します。"
    },
    {
      "indent": 3,
      "text": "In phase 1, material for the initialization vector (IV material) for CBC mode encryption algorithms is derived from a hash of a concatenation of the initiator's public Diffie-Hellman value and the responder's public Diffie-Hellman value using the negotiated hash algorithm. This is used for the first message only. Each message should be padded up to the nearest block size using bytes containing 0x00. The message length in the header MUST include the length of the pad since this reflects the size of the ciphertext. Subsequent messages MUST use the last CBC encryption block from the previous message as their initialization vector.",
      "ja": "フェーズ1では、CBCモード暗号化アルゴリズムのための初期化ベクトル（IV材料）の材料は、ネゴシエートされたハッシュアルゴリズムを使用して、イニシエータの公開のDiffie-Hellman値とレスポンダの公共のDiffie-Hellman値の連結のハッシュから導出されます。これは、最初のメッセージだけに使用されます。各メッセージには、0x00の含有バイトを使用して、最も近いブロックサイズまでパディングされるべきです。これは、暗号文のサイズを反映するので、ヘッダ内のメッセージの長さは、パッドの長さを含まなければなりません。後続のメッセージは、彼らの初期化ベクトルとして前のメッセージから最後のCBC暗号化ブロックを使用しなければなりません。"
    },
    {
      "indent": 3,
      "text": "In phase 2, material for the initialization vector for CBC mode encryption of the first message of a Quick Mode exchange is derived from a hash of a concatenation of the last phase 1 CBC output block and the phase 2 message id using the negotiated hash algorithm. The IV for subsequent messages within a Quick Mode exchange is the CBC output block from the previous message. Padding and IVs for subsequent messages are done as in phase 1.",
      "ja": "フェーズ2では、クイックモード交換の最初のメッセージのCBCモード暗号化のための初期化ベクトルの材料は、最後のフェーズ1 CBC出力ブロックとネゴシエートされたハッシュアルゴリズムを使用して、フェーズ2のメッセージIDの連結のハッシュから導出されます。クイックモード交換内の後続メッセージのIVは、前のメッセージからCBC出力ブロックです。後続のメッセージのためのパディングとのIVは、フェーズ1のように行われます。"
    },
    {
      "indent": 3,
      "text": "After the ISAKMP SA has been authenticated all Informational Exchanges are encrypted using SKEYID_e. The initiaization vector for these exchanges is derived in exactly the same fashion as that for a Quick Mode-- i.e. it is derived from a hash of a concatenation of the last phase 1 CBC output block and the message id from the ISAKMP header of the Informational Exchange (not the message id from the message that may have prompted the Informational Exchange).",
      "ja": "ISAKMP SAが認証された後、すべての情報交換がSKEYID_eを使用して暗号化されています。これらの交換用initiaizationベクターは、それが情報のISAKMPヘッダから最後のフェーズ1 CBC出力ブロックの連結のハッシュとメッセージIDに由来する、すなわちクイックMode--の場合と全く同じ方法で導出されます取引所（Informational交換を促している可能性がメッセージからではないメッセージID）。"
    },
    {
      "indent": 3,
      "text": "Note that the final phase 1 CBC output block, the result of encryption/decryption of the last phase 1 message, must be retained in the ISAKMP SA state to allow for generation of unique IVs for each Quick Mode. Each post- phase 1 exchange (Quick Modes and",
      "ja": "、最後のフェーズ1メッセージの暗号化/復号化の結果は、ISAKMP SAの状態で保持されなければならない最終フェーズ1 CBC出力ブロックが各クイックモードの一意のIVの生成を可能にすることに留意されたいです。各後フェーズ1交換（クイックモードと"
    },
    {
      "indent": 3,
      "text": "Informational Exchanges) generates IVs independantly to prevent IVs from getting out of sync when two different exchanges are started simultaneously.",
      "ja": "情報交換）二つの異なる交換が同時に開始されたときの同期から抜け出すからIVを防ぐために、独立してIVを生成します。"
    },
    {
      "indent": 3,
      "text": "In all cases, there is a single bidirectional cipher/IV context. Having each Quick Mode and Informational Exchange maintain a unique context prevents IVs from getting out of sync.",
      "ja": "すべての場合において、単一の双方向の暗号/ IVコンテキストがあります。各クイックモードとInformational交換は、ユニークなコンテキストを維持持つことは、同期が取れなくなってからIVを防ぐことができます。"
    },
    {
      "indent": 3,
      "text": "The key for DES-CBC is derived from the first eight (8) non-weak and non-semi-weak (see Appendix A) bytes of SKEYID_e. The IV is the first 8 bytes of the IV material derived above.",
      "ja": "DES-CBCのためのキーは、SKEYID_eの最初の8（8）非弱および非半弱（付録Aを参照）バイトから誘導されます。 IVは上記由来IVの材料の最初の8バイトです。"
    },
    {
      "indent": 3,
      "text": "The key for IDEA-CBC is derived from the first sixteen (16) bytes of SKEYID_e. The IV is the first eight (8) bytes of the IV material derived above.",
      "ja": "IDEA-CBCのためのキーは、SKEYID_eの最初の16（16）バイトから誘導されます。 IVは上記由来IVの材料の最初の8（8）バイトです。"
    },
    {
      "indent": 3,
      "text": "The key for Blowfish-CBC is either the negotiated key size, or the first fifty-six (56) bytes of a key (if no key size is negotiated) derived in the aforementioned pseudo-random function feedback method. The IV is the first eight (8) bytes of the IV material derived above.",
      "ja": "フグ-CBCのためのキーがネゴシエートキーサイズ、キーの第五〇から六（56）バイト（どのキーサイズがネゴシエートされていない場合）は、上記擬似ランダム関数のフィードバック方法に由来のいずれかです。 IVは上記由来IVの材料の最初の8（8）バイトです。"
    },
    {
      "indent": 3,
      "text": "The key for RC5-R16-B64-CBC is the negotiated key size, or the first sixteen (16) bytes of a key (if no key size is negotiated) derived from the aforementioned pseudo-random function feedback method if necessary. The IV is the first eight (8) bytes of the IV material derived above. The number of rounds MUST be 16 and the block size MUST be 64.",
      "ja": "RC5-R16-B64-CBCのためのキーがネゴシエートキーサイズ、または必要に応じて前述の擬似ランダム関数フィードバック方式から導出鍵の最初の16（16）バイト（どのキーサイズがネゴシエートされていない場合）です。 IVは上記由来IVの材料の最初の8（8）バイトです。ラウンド数は16でなければなりませんし、ブロックサイズは64でなければなりません。"
    },
    {
      "indent": 3,
      "text": "The key for 3DES-CBC is the first twenty-four (24) bytes of a key derived in the aforementioned pseudo-random function feedback method. 3DES-CBC is an encrypt-decrypt-encrypt operation using the first, middle, and last eight (8) bytes of the entire 3DES-CBC key. The IV is the first eight (8) bytes of the IV material derived above.",
      "ja": "3DES-CBCのためのキーは、上記擬似ランダム関数フィードバック方式で導出鍵の最初の24（24）バイトです。 3DES-CBCは、まず、中間を使用して暗号化・復号化・暗号化操作であり、全体3DES-CBC鍵の最後の8個のバイト。 IVは上記由来IVの材料の最初の8（8）バイトです。"
    },
    {
      "indent": 3,
      "text": "The key for CAST-CBC is either the negotiated key size, or the first sixteen (16) bytes of a key derived in the aforementioned pseudo-random function feedback method. The IV is the first eight (8) bytes of the IV material derived above.",
      "ja": "CAST-CBCのためのキーがネゴシエートキーサイズ、または前述の擬似ランダム関数フィードバック方式で導出鍵の最初の16（16）バイトのいずれかです。 IVは上記由来IVの材料の最初の8（8）バイトです。"
    },
    {
      "indent": 3,
      "text": "Support for algorithms other than DES-CBC is purely optional. Some optional algorithms may be subject to intellectual property claims.",
      "ja": "DES-CBC以外のアルゴリズムのサポートは純粋にオプションです。いくつかのオプションのアルゴリズムは知的財産の請求を受ける可能性があります。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Dan Harkins cisco Systems 170 W. Tasman Dr. San Jose, California, 95134-1706 United States of America",
      "ja": "ダンハーキンズシスコシステムズ170 W.タスマン博士は、カリフォルニア州サンノゼ、アメリカの95134-1706米国"
    },
    {
      "indent": 3,
      "text": "Phone: +1 408 526 4000 EMail: dharkins@cisco.com",
      "ja": "電話：+1 408 526 4000 Eメール：dharkins@cisco.com"
    },
    {
      "indent": 3,
      "text": "Dave Carrel 76 Lippard Ave. San Francisco, CA 94131-2947 United States of America",
      "ja": "デイブ・カレル76 Lippardアベニュー。アメリカのカリフォルニア州サンフランシスコ94131-2947米国"
    },
    {
      "indent": 3,
      "text": "Phone: +1 415 337 8469 EMail: carrel@ipsec.org",
      "ja": "電話：+1 415 337 8469 Eメール：carrel@ipsec.org"
    },
    {
      "indent": 0,
      "text": "Authors' Note",
      "ja": "著者の注意"
    },
    {
      "indent": 3,
      "text": "The authors encourage independent implementation, and interoperability testing, of this hybrid protocol.",
      "ja": "著者は、このハイブリッドプロトコルに依存し、実装、および相互運用性テストを、奨励します。"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1998). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1998）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    }
  ]
}