{
  "title": {
    "text": "RFC 6328 - IANA Considerations for Network Layer Protocol Identifiers",
    "ja": "RFC 6328 - ネットワーク層プロトコル識別子のためのIANAの考慮事項"
  },
  "number": 6328,
  "created_at": "2019-10-31 03:07:21.968707+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                   D. Eastlake 3rd\nRequest for Comments: 6328                                        Huawei\nBCP: 164                                                       July 2011\nCategory: Best Current Practice\nISSN: 2070-1721",
      "raw": true
    },
    {
      "indent": 7,
      "text": "IANA Considerations for Network Layer Protocol Identifiers",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "Some protocols being developed or extended by the IETF make use of the ISO/IEC (International Organization for Standardization / International Electrotechnical Commission) Network Layer Protocol Identifier (NLPID). This document provides NLPID IANA considerations.",
      "ja": "IETFによって開発または拡張されている一部のプロトコルは、ネットワーク層プロトコル識別子（NLPID）ISO / IEC（標準/国際電気標準会議のための国際機構）を使用しています。この文書では、NLPID IANA問題を提供します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This memo documents an Internet Best Current Practice.",
      "ja": "このメモはインターネット最も良い現在の練習を説明します。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on BCPs is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 BCPの詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6328.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6328で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2011 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2011 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. NLPIDs ..........................................................3\n   2.1. Sub-Ranges of the NLPID ....................................3\n   2.2. Code Point 0x80 ............................................4\n   2.3. NLPIDs Available for IANA Allocation .......................4\n3. IANA Considerations .............................................5\n4. Security Considerations .........................................5\n5. References ......................................................5\n   5.1. Normative References .......................................5\n   5.2. Informative References .....................................6\n6. Acknowledgements ................................................7\nAppendix A. Initial IANA NLPID Web Page ............................8\nAppendix B. RFC References to NLPID ................................9",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "Some protocols being developed or extended by the IETF make use of the ISO/IEC (International Organization for Standardization / International Electrotechnical Commission) Network Layer Protocol Identifier (NLPID).",
      "ja": "IETFによって開発または拡張されている一部のプロトコルは、ネットワーク層プロトコル識別子（NLPID）ISO / IEC（標準/国際電気標準会議のための国際機構）を使用しています。"
    },
    {
      "indent": 3,
      "text": "The term \"NLPID\" is not actually used in [ISO9577], which refers to one-octet IPIs (Initial Protocol Identifiers) and SPIs (Subsequent Protocol Identifiers). While these are two logically separate kinds of one-octet identifiers, most values are usable as both an IPI and an SPI. In the remainder of this document, the term NLPID is used for such values.",
      "ja": "用語「NLPID」は実際には1オクテットIPIの（初期プロトコル識別子）とのSPI（その後のプロトコル識別子）を指す[ISO9577]で使用されていません。これらは1オクテット識別子二論理的に別々の種類があるが、ほとんどの値は、IPIとSPIの両方として使用可能です。この文書の残りでは、用語NLPIDは、そのような値のために使用されます。"
    },
    {
      "indent": 3,
      "text": "The registry of NLPID values is maintained by ISO/IEC by updating [ISO9577]. The procedure specified by ISO/IEC in that document is that an NLPID code point can be allocated without approval by ISO/IEC, as long as the code point is not in a range of values categorized for an organization other than the organization allocating the code point and as long as ISO/IEC JTC1 SC6 is informed.",
      "ja": "NLPID値のレジストリは[ISO9577]を更新することにより、ISO / IECによって維持されます。その文書にISO / IECによって指定された手順は、NLPIDコードポイントがあれば、コードポイントコードを割り当てる組織以外の組織の分類値の範囲内にないように、ISO / IECの承認なしに割り当てることができるということですポイントおよび限り、ISO / IEC JTC1 SC6が通知されます。"
    },
    {
      "indent": 3,
      "text": "This document provides NLPID IANA considerations. That is, it specifies the level of IETF approval necessary for a code point to be allocated for IETF use, the procedures to be used and actions to be taken by IANA in connection with NLPIDs, and related guidelines.",
      "ja": "この文書では、NLPID IANA問題を提供します。すなわち、IETF IETF使用するために割り当てられるコードポイントのために必要な承認、使用される手順とNLPIDs、および関連するガイドラインに関してIANAによって取られるべきアクションのレベルを指定する、です。"
    },
    {
      "indent": 3,
      "text": "[RFC5226] is incorporated herein except to the extent that there are contrary provisions in this document.",
      "ja": "[RFC5226]は、この文書に記載されている反対の規定が存在することを除き、本明細書に組み込まれます。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. NLPIDs",
      "section_title": true,
      "ja": "2. NLPIDs"
    },
    {
      "indent": 3,
      "text": "[ISO9577] defines one-octet network layer protocol identifiers that are commonly called NLPIDs, which is the term used in this document.",
      "ja": "[ISO9577]はこの文書で使用される用語である一般NLPIDs呼ばれる1オクテットのネットワーク層プロトコル識別子を定義します。"
    },
    {
      "indent": 3,
      "text": "NLPIDs are used in a number of protocols. For example, in the mar$pro.type field of the multicast address resolution server protocol [RFC2022], the ar$pro.type field of the NBMA (Non-Broadcast Multi-Access) next hop resolution protocol [RFC2332] and in the IS-IS Protocols Supported TLV [RFC1195]. See Appendix B.",
      "ja": "NLPIDsは、多くのプロトコルで使用されています。例えば、マルチキャストアドレス解決サーバプロトコル[RFC2022]、NBMA（非ブロードキャストマルチアクセス）のARする$ pro.typeフィールドネクストホップ解決プロトコル[RFC2332]の擦傷の$ pro.typeフィールド内とでIS-ISプロトコルはTLV [RFC1195]サポートされています。付録Bを参照してください。"
    },
    {
      "indent": 0,
      "text": "2.1. Sub-Ranges of the NLPID",
      "section_title": true,
      "ja": "2.1。 NLPIDの小範囲"
    },
    {
      "indent": 3,
      "text": "Sub-ranges of the possible NLPID values are categorized by [ISO9577] for organizations as shown below, primarily for the ISO/IEC (International Organization for Standardization / International Electrotechnical Commission) and the ITU-T (International Telecommunication Union - Telecommunication Standardization Sector):",
      "ja": "以下に示すように可能NLPID値のサブレンジを組織に[ISO9577]で分類され、主にISO / IEC（標準/国際電気標準会議国際機構）とITU-Tのための（国際電気通信連合 - 電気通信標準化部門） ："
    },
    {
      "indent": 6,
      "text": "Code Point  Category\n----------  --------\n0x00        ISO/IEC\n0x01-0x0F   ITU-T\n0x10-0x3F   ITU-T Rec. X.25 and ISO/IEC 8208\n0x40-0x43   ISO/IEC\n0x44        ITU-T\n0x45-0x4F   ISO/IEC\n0x50-0x6F   ITU-T Rec. X.25 and ISO/IEC 8208\n0x70-0x7F   Joint ITU-T and ISO/IEC\n0x80        ISO/IEC (see Section 2.2)\n0x81-0x8F   ISO/IEC\n0x90-0xAF   ITU-T Rec. X.25 and ISO/IEC 8208\n0xB0-0xBF   ITU-T\n0xC0-0xCF   Potentially available for IANA (see Section 2.3)\n0xD0-0xEF   ITU-T Rec. X.25 and ISO/IEC 8208\n0xF0-0xFE   Joint ITU-T and ISO/IEC\n0xFF        Reserved for an Extension mechanism to be\n            jointly developed by ITU-T and ISO/IEC",
      "raw": true
    },
    {
      "indent": 0,
      "text": "2.2. Code Point 0x80",
      "section_title": true,
      "ja": "2.2。コードポイントは0x80"
    },
    {
      "indent": 3,
      "text": "NLPID 0x80 is known as the IEEE (Institute of Electrical & Electronics Engineers) SNAP (SubNetwork Access Protocol) code point. It is followed by five octets, using the IEEE SNAP SAP (Service Access Point) conventions, to specify the protocol. Those conventions are described in Section 3 of [RFC5342]. In particular, it is valid for such a five-octet sequence to start with the IANA OUI (Organizationally Unique Identifier) followed by two further octets assigned by IANA as provided in [RFC5342]. The same IANA registry is used for such protocol identifiers whether they are planned to be introduced by the 0x80 NLPID or the IEEE SNAP SAP LSAPs (Link-Layer Service Access Points) (0xAAAA). Values allocated by IANA may be used in either context as appropriate.",
      "ja": "NLPID 0x80では、IEEE（電気電子学会）SNAP（サブネットワークアクセスプロトコル）コード・ポイントとして知られています。これは、プロトコルを指定するには、IEEE SNAPのSAP（サービスアクセスポイント）の規則を使用して、5つのオクテットが続いています。これらの規則は、[RFC5342]のセクション3に記載されています。特に、それは、[RFC5342]に提供されるIANAによって割り当てられた2つの更なるオクテット続いIANA OUI（組織固有識別子）で開始するような5オクテットのシーケンスに対して有効です。同じIANAレジストリは、それらが0x80のNLPIDまたはIEEE SNAP SAPのLSAPs（リンク層サービスアクセスポイント）（0xAAAA）によって導入されるように計画されているかどうか、そのようなプロトコル識別子のために使用されています。 IANAによって割り当てられた値は、必要に応じていずれかの文脈で使用されてもよいです。"
    },
    {
      "indent": 3,
      "text": "Because of the limited number of NLPID code points available for IANA allocation, use of the IEEE SNAP NLPID is RECOMMENDED rather than allocation of a new one-octet NLPID code point.",
      "ja": "なぜならIANA割り当てのために利用可能NLPIDコードポイントの限られた数の、IEEE SNAP NLPIDを使用することはなく、新たな1オクテットNLPIDコードポイントの割り当てよりも推奨されます。"
    },
    {
      "indent": 0,
      "text": "2.3. NLPIDs Available for IANA Allocation",
      "section_title": true,
      "ja": "2.3。 IANAの割り当てに使用できるNLPIDs"
    },
    {
      "indent": 3,
      "text": "A limited number of code points are available that could be allocated by IANA under [ISO9577]. Because of this, it is desirable, where practical, to use code point 0x80, as discussed in Section 2.2 above, or to get code points allocated from the ranges categorized to other organizations. For example, code point 0x8E was allocated for IPv6 [RFC2460], although it is in a range of code points categorized for ISO/IEC. One-byte code points are assigned to TRILL and IEEE 802.1aq as they are intended for use within the IS-IS Protocols Supported TLV [RFC1195].",
      "ja": "コードポイントの限られた数は、[ISO9577]のIANAによって割り当てられることができることを利用可能です。このため、それは、上のセクション2.2で説明したように、コード・ポイントは0x80を使用すること、または他の組織に分類範囲から割り当てられたコードポイントを取得する場合に実用的で、望ましいです。それはISO / IECのための分類コードポイントの範囲内であるが、例えば、コードポイント0x8Eがは、IPv6の[RFC2460]のために割り当てられました。それらはIS-ISプロトコル内での使用を目的としているように、1バイトのコードポイントは、TRILLおよびIEEE 802.1aqに割り当てられている[RFC1195] TLVをサポート。"
    },
    {
      "indent": 3,
      "text": "The table below, which includes two new code point allocations made by this document, shows those still available.",
      "ja": "このドキュメントによって作られた2つの新しいコードポイント割り当てを含む以下の表は、まだ入手可能なものを示しています。"
    },
    {
      "indent": 6,
      "text": "Code Point  Status\n----------  --------\n0xC0        TRILL [RFC6325]\n0xC1        IEEE 802.1aq [802.1aq]\n0xC2-0xCB   Available\n0xCC        IPv4 [RFC791]\n0xCD-0xCE   Available\n0xCF        PPP [RFC1661]",
      "raw": true
    },
    {
      "indent": 0,
      "text": "3. IANA Considerations",
      "section_title": true,
      "ja": "3. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "As long as code points are available, IANA will allocate additional values when required by applying the IETF Review policy as per [RFC5226].",
      "ja": "[RFC5226]に従ってIETFレビューポリシーを適用することによって、必要なときに限り、コードポイントが利用可能であるように、IANAは、追加の値を割り当てます。"
    },
    {
      "indent": 3,
      "text": "Whenever it allocates an NLPID, IANA will inform the IETF liaison to ISO/IEC JTC1 SC6 (Joint Technical Committee 1, Study Committee 6) [JTC1SC6], or if IANA is unable to determine that IETF liaison, the IAB. The liaison (or the IAB) will then ensure that ISO/IEC JTC1 SC6 is informed so that [ISO9577] can be updated since ISO/IEC JTC1 SC6 is the body that maintains [ISO9577]. To simplify this process, it is desirable that the IAB maintain an IETF liaison to ISO/IEC JTC1 SC6.",
      "ja": "それはNLPIDを割り当てるたびに、IANAは[JTC1SC6] ISO / IEC JTC1 SC6（合同技術委員会1、研究会6）にIETF連絡を通知する、またはIANAは、IETF連絡、IABを決定できない場合。リエゾン（又はIAB）を[ISO9577]は、ISO / IEC JTC1 SC6が保持体[ISO9577]があるので、更新することができるように、ISO / IEC JTC1 SC6が通知されることを保証します。このプロセスを簡略化するために、IABは、ISO / IEC JTC1 SC6にIETFの連絡を維持することが望ましいです。"
    },
    {
      "indent": 3,
      "text": "This document allocates the code points 0xC0 and 0xC1 as shown in Section 2.3 and IANA shall request the liaison (or the IAB) to so inform ISO/IEC JTC1 SC6.",
      "ja": "セクション2.3に示すように、このドキュメントは、コードポイント0xC0のと0xC1を割り当て、IANAのでISO / IEC JTC1 SC6を通知する連絡（又はIAB）を要求しなければなりません。"
    },
    {
      "indent": 3,
      "text": "IANA maintains a web page showing NLPIDs that have been allocated to a protocol being developed or extended by the IETF or are otherwise of interest. The initial state of the web page is as shown in Appendix A. IANA will update this web page for (1) NLPIDs allocated by IANA and (2) other allocations or de-allocations when IANA is requested to make such changes to this web page by the IETF liaison mentioned above.",
      "ja": "IANAは、開発やIETFによって拡張されているプロトコルに割り当てられているか、そうでない場合は、関心のあるされていますNLPIDsを示すWebページを維持しています。 IANAは、このWebページへのそのような変更を行うことが要求された場合、付録A. IANAに示すように、ウェブページの初期状態は、（1）IANAによって割り当てられNLPIDs及び（2）他の割当てまたは非割当てのために、このウェブページを更新しますIETFのリエゾンは、上記によります。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "This document is concerned with allocation of NLPIDs. It is not directly concerned with security.",
      "ja": "この文書はNLPIDsの割り当てに関するものです。これは、セキュリティに直接関係はありません。"
    },
    {
      "indent": 0,
      "text": "5. References",
      "section_title": true,
      "ja": "5.参考文献"
    },
    {
      "indent": 0,
      "text": "5.1. Normative References",
      "section_title": true,
      "ja": "5.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[ISO9577] International Organization for Standardization \"Information technology - Telecommunications and Information exchange between systems - Protocol identification in the network layer\", ISO/IEC TR 9577:1999, 1999-12-15.",
      "ja": "[ISO9577]国際標準化機構「情報技術 - システム間のテレコミュニケーションと情報交換 - ネットワーク層におけるプロトコル識別」のため、ISO / IEC TR 9577：1999、1999年12月15日。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC5226] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 5226, May 2008.",
      "ja": "[RFC5226] Narten氏、T.とH. Alvestrand、 \"RFCsにIANA問題部に書くためのガイドライン\"、BCP 26、RFC 5226、2008年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC5342] Eastlake 3rd., D., \"IANA Considerations and IETF Protocol Usage for IEEE 802 Parameters\", BCP 141, RFC 5342, September 2008.",
      "ja": "[RFC5342]イーストレイク3位。、D.、 \"IANAの考慮事項およびIEEE 802個のパラメータのためのIETFプロトコルの使用\"、BCP 141、RFC 5342、2008年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC6325] Radia, P., Eastlake, D., Dutt, D., Gai, S., and A. Ghanwani, \"RBridges: Base Protocol Specification\", RFC 6325, July 2011.",
      "ja": "[RFC6325]のRadia、P.、イーストレーク、D.、ダット、D.、ガイ、S.、およびA. Ghanwani、 \"RBridges：基本プロトコル仕様\"、RFC 6325、2011年7月。"
    },
    {
      "indent": 0,
      "text": "5.2. Informative References",
      "section_title": true,
      "ja": "5.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[802.1aq] Standard for Local and Metropolitan Area Networks / Virtual Bridged Local Area Networks / Amendment 9: Shortest Path Bridging, Draft IEEE P802.1aq/D2.1, 21 August 2009.",
      "ja": "[802.1aq]ローカルおよびメトロポリタンエリアネットワーク/仮想ブリッジローカルエリアネットワーク/修正9のための標準：最短パスブリッジ、ドラフトIEEE P802.1aq / D2.1、2009年8月21日。"
    },
    {
      "indent": 3,
      "text": "[JTC1SC6] ISO/IEC JTC1 SC6 (International Organization for Standardization / International Electrotechnical Commission, Joint Technical Committee 1, Study Committee 6), http://www.iso.org/iso/ iso_technical_committee.html?commid=45072",
      "ja": "[JTC1SC6] ISO / IEC JTC1 SC6（国際標準化機構/国際電気標準会議、合同技術委員会1、調査委員会の6のため）、http://www.iso.org/iso/ iso_technical_committee.html？commid = 45072"
    },
    {
      "indent": 3,
      "text": "[RFC791] Postel, J., \"Internet Protocol\", STD 5, RFC 791, September 1981.",
      "ja": "[RFC791]ポステル、J.、 \"インターネットプロトコル\"、STD 5、RFC 791、1981年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC1195] Callon, R., \"Use of OSI IS-IS for routing in TCP/IP and dual environments\", RFC 1195, December 1990.",
      "ja": "[RFC1195] Callon、R.は、RFC 1195、1990年12月 \"OSIの使用は、TCP / IPやデュアル環境でのルーティングのためIS-IS\"。"
    },
    {
      "indent": 3,
      "text": "[RFC1661] Simpson, W., Ed., \"The Point-to-Point Protocol (PPP)\", STD 51, RFC 1661, July 1994.",
      "ja": "[RFC1661]シンプソン、W.、編、 \"ポイントツーポイントプロトコル（PPP）\"、STD 51、RFC 1661、1994年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC1707] McGovern, M. and R. Ullmann, \"CATNIP: Common Architecture for the Internet\", RFC 1707, October 1994.",
      "ja": "[RFC1707]マクガバン、M.とR.ウルマン、 \"CATNIP：インターネットのための共通のアーキテクチャ\"、RFC 1707、1994年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC2022] Armitage, G., \"Support for Multicast over UNI 3.0/3.1 based ATM Networks\", RFC 2022, November 1996.",
      "ja": "[RFC2022]アーミテージ、G.、RFC 2022、1996年11月 \"ATM網をベースUNI 3.0 / 3.1以上のマルチキャストのサポート\"。"
    },
    {
      "indent": 3,
      "text": "[RFC2332] Luciani, J., Katz, D., Piscitello, D., Cole, B., and N. Doraswamy, \"NBMA Next Hop Resolution Protocol (NHRP)\", RFC 2332, April 1998.",
      "ja": "[RFC2332]ルチアーニ、J.、カッツ、D.、Piscitello、D.、コール、B.、およびN. Doraswamy、 \"NBMAネクストホップ解決プロトコル（NHRP）\"、RFC 2332、1998年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2460] Deering, S. and R. Hinden, \"Internet Protocol, Version 6 (IPv6) Specification\", RFC 2460, December 1998.",
      "ja": "[RFC2460]デアリング、S.とR. Hindenと、 \"インターネットプロトコルバージョン6（IPv6）の仕様\"、RFC 2460、1998年12月。"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgements",
      "section_title": true,
      "ja": "6.謝辞"
    },
    {
      "indent": 3,
      "text": "The contributions and support of the following people, listed in alphabetic order, are gratefully acknowledged:",
      "ja": "アルファベット順にリストされている以下の人々の貢献とサポートは、深く感謝しています。"
    },
    {
      "indent": 6,
      "text": "Ayan Banerjee, Gonzalo Camarillo, Dinesh Dutt, Don Fedyk, Alfred Hines, Russ Housley, Andrew Malis, Radia Perlman, Dan Romascanu, and Peter Ashwood-Smith.",
      "ja": "アヤンバネルジー、ゴンサロ・カマリロ、ディネッシュダット、ドンFedyk、アルフレッド・ハインズ、ラスHousley、アンドリューMalis、ラディア・パールマン、ダンRomascanu、およびピーター・アッシュウッド・スミス。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Initial IANA NLPID Web Page",
      "ja": "付録A.初期IANA NLPIDのWebページ"
    },
    {
      "indent": 3,
      "text": "NLPIDs of Interest",
      "ja": "関心のNLPIDs"
    },
    {
      "indent": 6,
      "text": "Code Point  Use\n----------  --------\n 0x00       Null\n 0x08       Q.933 (RFC 2427)\n 0x80       IEEE SNAP (RFC 6328)\n 0x81       ISO CLNP (Connectionless Network Protocol)\n 0x82       ISO ES-IS\n 0x83       IS-IS (RFC 1195)\n 0x8E       IPv6 (RFC 2460)\n 0xB0       FRF.9 (RFC 2427)\n 0xB1       FRF.12 (RF C2427)\n 0xC0       TRILL (RFC 6325)\n 0xC1       IEEE 802.1aq\n 0xCC       IPv4 (RFC 791)\n 0xCF       PPP (RFC 1661)",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Note: According to [RFC1707], NLPID 0x70 was assigned to IPv7. That assignment appears to no longer be in effect as it is not listed in ISO/IEC 9577. IPv7 was itself a temporary code point assignment made while a decision was being made between three candidates for the next generation of IP after IPv4. Those candidates were assigned IPv6, IPv7, and IPv8. IPv6 was selected.",
      "ja": "注：[RFC1707]によると、NLPID 0x70はIPv7に割り当てられました。その割り当ては、IPv7自体決定はIPv4の後にIPの次の世代のための3つの候補者の間で行われていた間に行われた仮のコードポイント割り当てたISO / IEC 9577.に記載されていないとして、もはや有効ではないように思われます。これらの候補者は、IPv6、IPv7、およびIPv8を割り当てられました。 IPv6が選ばれました。"
    },
    {
      "indent": 0,
      "text": "Appendix B. RFC References to NLPID",
      "ja": "NLPIDの付録B.は、RFCの参考資料"
    },
    {
      "indent": 3,
      "text": "The following RFCs, issued before the end of March 2009, excluding other survey RFCs and obsolete RFCs, reference the NLPID as such:",
      "ja": "次のRFC、2009年3月末以前に発行された他の調査RFCと時代遅れのRFCを除く、参照するようなNLPID："
    },
    {
      "indent": 3,
      "text": "RFC 1195 Use of OSI IS-IS for Routing in TCP/IP and Dual Environments RFC 1356 Multiprotocol Interconnect on X.25 and ISDN in the Packet Mode RFC 1377 The PPP OSI Network Layer Control Protocol (OSINLCP) RFC 1661 The Point-to-Point Protocol (PPP) RFC 1707 CATNIP: Common Architecture for the Internet RFC 1755 ATM Signaling Support for IP over ATM RFC 2022 Support for Multicast over UNI 3.0/3.1 based ATM Networks RFC 2332 NBMA Next Hop Resolution Protocol (NHRP) RFC 2337 Intra-LIS IP multicast among routers over ATM using Sparse Mode PIM RFC 2363 PPP Over FUNI RFC 2390 Inverse Address Resolution Protocol RFC 2427 Multiprotocol Interconnect over Frame Relay RFC 2590 Transmission of IPv6 Packets over Frame Relay Networks Specification RFC 2684 Multiprotocol Encapsulation over ATM Adaptation Layer 5 RFC 2955 Definitions of Managed Objects for Monitoring and Controlling the Frame Relay/ATM PVC Service Interworking Function RFC 3070 Layer Two Tunneling Protocol (L2TP) over Frame Relay RFC 5308 Routing IPv6 with IS-IS",
      "ja": "RFC 1195 OSIの使用パケットモードRFC 1377でのX.25およびISDN上のTCP / IPおよびデュアル環境のRFC 1356マルチプロトコルインターコネクトでのルーティングのためのIS-IS PPP OSIネットワーク層制御プロトコル（OSINLCP）RFC 1661ザポイント・ツーPointプロトコル（PPP）RFC 1707 CATNIP：共通のアーキテクチャインターネットRFC 3.0 / 3.1ベースのATMネットワークスRFC 2332 NBMAネクストホップ解決プロトコル（NHRP）RFC 2337イントラUNI経由のマルチキャストのためのATM RFC 2022のサポートオーバーIPのための1755 ATMシグナリングのサポートのために2363 PPPオーバーFUNI RFC 2390逆アドレス解決プロトコルのRFC 2427マルチインターコネクトフレームリレーRFCを超える2590フレームリレーネットワーク仕様のRFCの上のIPv6パケットのトランスミッション2684マルチプロトコルカプセル化ATM上アダプテーションレイヤ5 RFCをスパースモードPIMのRFCを使用してATM経由ルータ間LIS IPマルチキャスト2955の監視のための管理対象オブジェクトの定義およびフレームリレーRFC 530を介してフレームリレー/ ATM PVCサービスインターワーキング機能RFC 3070レイヤ2トンネリングプロトコル（L2TP）を制御しますIS-ISと8 IPv6ルーティング"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Donald E. Eastlake 3rd Huawei Technologies 155 Beaver Street Milford, MA 01757 USA",
      "ja": "ドナルドE.イーストレイク第三華為技術155ビーバー通りミルフォード、MA 01757 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1-508-333-2270 EMail: d3e3e3@gmail.com",
      "ja": "電話：+ 1-508-333-2270 Eメール：d3e3e3@gmail.com"
    }
  ]
}