{
  "title": {
    "text": "RFC 6362 - Multiple Attachments for Electronic Data Interchange - Internet Integration (EDIINT)",
    "ja": "RFC 6362 - 電子データ交換のための複数の添付ファイル - インターネットの統合（EDIINT）"
  },
  "number": 6362,
  "created_at": "2019-10-31 13:21:20.343008+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                   K. Meadors, Ed.\nRequest for Comments: 6362                          Drummond Group, Inc.\nCategory: Informational                                      August 2011\nISSN: 2070-1721",
      "raw": true
    },
    {
      "indent": 6,
      "text": "                  Multiple Attachments for\nElectronic Data Interchange - Internet Integration (EDIINT)",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "The Electronic Data Interchange - Internet Integration (EDIINT) AS1, AS2, and AS3 messages were designed specifically for the transport of EDI documents. Since multiple interchanges could be placed within a single EDI document, there was not a need for sending multiple EDI documents in a single message. As adoption of EDIINT grew, other uses developed aside from single EDI document transport. Some transactions required multiple attachments to be interpreted together and stored in a single message. This Informational RFC describes how multiple documents, including non-EDI payloads, can be attached and transmitted in a single EDIINT transport message. The attachments are stored within the MIME multipart/related structure. A minimal list of content-types to be supported as attachments is provided.",
      "ja": "電子データ交換 - インターネットの統合（EDIINT）AS1、AS2、およびAS3メッセージがEDI文書の輸送のために特別に設計されました。複数のインターチェンジは、単一のEDI文書内に置くことができるので、単一のメッセージで複数のEDIドキュメントを送信する必要がありませんでした。 EDIINTの採用が成長するにつれて、他の用途では、単一のEDI文書の輸送は別に開発しました。一部のトランザクションは一緒に解釈され、単一のメッセージに格納する複数の添付ファイルを必要としました。この情報RFCは、非EDIペイロードを含むどのように複数のドキュメントを記述する単一EDIINT輸送メッセージに添付して送信することができます。添付ファイルがMIMEマルチパート/関連構造内に格納されます。添付ファイルとしてサポートされるコンテンツ・タイプの最小限のリストが提供されています。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 IESGによって承認されていないすべての文書がインターネットStandardのどんなレベルの候補です。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6362.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6362で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2011 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2011 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 3,
      "text": "This document may contain material from IETF Documents or IETF Contributions published or made publicly available before November 10, 2008. The person(s) controlling the copyright in some of this material may not have granted the IETF Trust the right to allow modifications of such material outside the IETF Standards Process. Without obtaining an adequate license from the person(s) controlling the copyright in such materials, this document may not be modified outside the IETF Standards Process, and derivative works of it may not be created outside the IETF Standards Process, except to format it for publication as an RFC or to translate it into languages other than English.",
      "ja": "この材料の一部がIETFトラストにこのような材料の変更を許可する権利を与えられていない可能性がありますにこの文書は、2008年、IETFドキュメントまたは11月10日以前に発行または公開さIETF貢献から著作権を支配する者（複数可）材料を含んでいてもよいですIETF標準化プロセスの外。そのような材料の著作権を管理者（単数または複数）から適切なライセンスを取得することなく、この文書は、IETF標準化過程の外側修正されないかもしれません、そして、それの派生物は、IETF標準化過程の外側に作成されない場合があり、それをフォーマットする以外出版RFCとして、英語以外の言語に翻訳します。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n   1.1. Requirements Language ......................................3\n2. Using Multiple Attachments in EDIINT ............................3\n   2.1. Multipart/Related Structure ................................3\n   2.2. EDIINT-Features Header .....................................4\n   2.3. MIC Calculation ............................................4\n   2.4. Document Processing ........................................5\n   2.5. Content-Types to Support ...................................5\n3. Example Message .................................................6\n4. Security Considerations .........................................7\n5. Normative References ............................................7",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "The primary work of the EDIINT working group (WG) was to develop a secure means of transporting EDI documents over the Internet. This was described in the three WG-developed standards for secure transport over SMTP AS1 [RFC3335], HTTP AS2 [RFC4130], and FTP AS3 [RFC4823]. For most uses of EDI, all relevant information to complete a single business transaction could be stored in a single document. As adoption of EDIINT grew, new industries and businesses began using AS2 and also needed to include multiple documents in a single message to complete a trading-partner transaction. These documents were a variety of MIME media types. This Informational RFC describes how to use the MIME multipart/related body structure within EDIINT messages to store multiple document attachments. Details of computing the message integrity check (MIC) value over this body are covered. A minimum listing of MIME media types to support within the multipart/related body is given along with information on extracting these documents.",
      "ja": "EDIINTワーキンググループ（WG）の主な仕事は、インターネット上でEDI文書を輸送する安全な手段を開発することでした。これは、SMTP AS1 [RFC3335]を介したセキュアな輸送のための3つのWG-開発された標準、HTTP AS2 [RFC4130]、およびFTP AS3 [RFC4823]で説明されました。 EDIのほとんどの用途のために、単一のビジネストランザクションを完了するためにすべての関連情報は、単一の文書に記憶することができます。 EDIINTの採用が成長するにつれて、新しい産業や企業がAS2を使用して開始し、また、トレーディングパートナーのトランザクションを完了するために、単一のメッセージで複数のドキュメントを含める必要がありました。これらの文書は、MIMEメディアタイプのさまざまでした。この情報のRFCは、複数のドキュメントの添付ファイルを保存するためにEDIINTメッセージ内MIMEマルチパート/関連ボディ構造を使用する方法について説明します。この体を介したメッセージ完全性チェック（MIC）値を計算の詳細は覆われています。マルチパート/関連体はこれらの文書を抽出する上での情報と一緒に与えられている範囲内のMIMEメディアタイプの最小リストはサポートしています。"
    },
    {
      "indent": 0,
      "text": "1.1. Requirements Language",
      "section_title": true,
      "ja": "1.1。要件言語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はありますRFC 2119 [RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. Using Multiple Attachments in EDIINT",
      "section_title": true,
      "ja": "2. EDIINTに複数の添付ファイルを使用します"
    },
    {
      "indent": 0,
      "text": "2.1. Multipart/Related Structure",
      "section_title": true,
      "ja": "2.1。マルチパート/関連構造"
    },
    {
      "indent": 3,
      "text": "Multiple payload attachments for EDIINT messages are stored within a multipart/related MIME body [RFC2387]. The multipart/related structure allows multiple MIME attachments or message payloads to be communicated in a single structure and message.",
      "ja": "EDIINTメッセージの複数のペイロード添付ファイルはマルチパート/関連するMIMEボディ[RFC2387]内に格納されます。マルチパート/関連構造は、複数のMIME添付ファイルまたはメッセージペイロードは、単一の構造およびメッセージで伝達されることを可能にします。"
    },
    {
      "indent": 3,
      "text": "The attached payloads can be of any MIME content-type depending on the trading-partner agreement, but Section 2.5 lists the content-types that MUST be supported. The use and format of the multipart/ related body follows the rules in RFC 2387 [RFC2387], including the required type parameter to determine the root body part. The use of the optional start parameter is RECOMMENDED.",
      "ja": "添付のペイロードは、トレーディングパートナー契約に応じて任意のMIMEコンテンツ・タイプであることが、2.5節のリストサポートしなければならないコンテンツタイプすることができます。マルチパート/関連体の使用及びフォーマットは、ルート本体部分を決定するのに必要なタイプのパラメータを含むRFC 2387 [RFC2387]のルールに従います。オプションのstartパラメータの使用が推奨されます。"
    },
    {
      "indent": 0,
      "text": "2.2. EDIINT-Features Header",
      "section_title": true,
      "ja": "2.2。 EDIINT-機能ヘッダ"
    },
    {
      "indent": 3,
      "text": "To indicate support for multiple attachments (MAs), an EDIINT application MUST use the EDIINT-Features header [RFC6017]. The EDIINT-Features header indicates that the instance application can support various features, such as certification exchange. The header is present in all messages from the instance application, not just those that feature certification exchange.",
      "ja": "複数の添付ファイル（MAS）のためのサポートを示すために、EDIINTアプリケーションはEDIINT-機能ヘッダ[RFC6017]を使用しなければなりません。 EDIINT-機能ヘッダは、インスタンス・アプリケーションは、認証交換のような様々な機能をサポートすることができることを示しています。ヘッダは、インスタンス・アプリケーションからのすべてのメッセージ、認証交換が備わっているだけでなく、それらの中に存在します。"
    },
    {
      "indent": 3,
      "text": "For applications implementing multiple attachments, the MA-Feature-Name MUST be used within the EDIINT-Features header as listed in this ABNF [RFC5234] syntax:",
      "ja": "このABNF [RFC5234]構文に記載されている複数の添付ファイルを実装するアプリケーションのために、MA-機能名は内で使用しなければならないヘッダをEDIINT-特徴："
    },
    {
      "indent": 6,
      "text": "MA-Feature-Name = \"multiple-attachments\"",
      "ja": "MA-機能名= \"複数の添付ファイル\""
    },
    {
      "indent": 3,
      "text": "An example of the EDIINT-Features header in a message from an application supporting MA:",
      "ja": "MAを支持するアプリケーションからのメッセージでEDIINT-機能ヘッダの例："
    },
    {
      "indent": 6,
      "text": "EDIINT-Features: multiple-attachments",
      "ja": "EDIINT-特徴：複数の添付ファイル"
    },
    {
      "indent": 0,
      "text": "2.3. MIC Calculation",
      "section_title": true,
      "ja": "2.3。 MICの計算"
    },
    {
      "indent": 3,
      "text": "MIC calculation in an EDIINT message with multiple attachments is performed in the same manner as for a single EDI payload. The only difference is calculating the message integrity check (MIC) over the whole multipart/related body rather than a single EDI payload. Section 5.2.1 of AS1 [RFC3335] and Section 4 of EDIINT COMPRESSION [RFC5402] describe the MIC calculations used for a single payload document within an EDIINT message. The approach is summarized below for the multipart/related body. Refer to stated sections above for more details.",
      "ja": "複数の添付ファイル付きEDIINTメッセージにMICの計算は、単一のEDIペイロードと同様に行われます。唯一の違いは、全体のマルチパート/関連体ではなく、単一のEDIペイロード上のメッセージ完全性チェック（MIC）を計算します。 AS1 [RFC3335]とEDIINT圧縮[RFC5402]のセクション4のセクション5.2.1 EDIINTメッセージ内の単一のペイロード文書に使用されるMIC計算を記述する。アプローチは、マルチパート/関連ボディのために以下のように要約されます。詳細は、上記のセクションを参照してください。"
    },
    {
      "indent": 3,
      "text": "For a compressed but unsigned message, regardless of encryption, the MIC is calculated over the uncompressed multipart/related body including any applied Content-Transfer-Encoding. The body MUST be canonicalized according to the procedure described in the underlying transport protocol (e.g., HTTP AS2 [RFC4130]) before the MIC is calculated.",
      "ja": "圧縮されたが、署名のないメッセージの場合は、関係なく、暗号化の、MICは、任意の適用されたコンテンツ転送エンコードを含む非圧縮のマルチパート/関連体の上に計算されます。本体は、MICを計算する前に、基礎となるトランスポートプロトコル（例えば、HTTP AS2 [RFC4130]）に記載の手順に従って正規化されなければなりません。"
    },
    {
      "indent": 3,
      "text": "For an encrypted but unsigned and uncompressed message, the MIC is calculated on the decrypted multipart/related body, including the header and all attached documents. The body MUST be canonicalized according to the procedure described in the underlying transport protocol (e.g., HTTP AS2 [RFC4130]) before the MIC is calculated.",
      "ja": "暗号化されたが、未署名の非圧縮メッセージのために、MICは、ヘッダと接続されているすべての文書を含む、復号化されたマルチパート/関連体で計算されます。本体は、MICを計算する前に、基礎となるトランスポートプロトコル（例えば、HTTP AS2 [RFC4130]）に記載の手順に従って正規化されなければなりません。"
    },
    {
      "indent": 3,
      "text": "For an unsigned and unencrypted message, the MIC is calculated over the data inside the multipart/related boundaries prior to Content-Transfer-Encoding. However, unsigned and unencrypted messages SHOULD NOT be sent due to lack of security.",
      "ja": "未署名と暗号化されていないメッセージの場合、MICは、コンテンツ転送エンコードに先立ってマルチパート/関連の境界内のデータに対して計算されます。しかし、符号なしと暗号化されていないメッセージが原因のセキュリティの欠如に送るべきではありません。"
    },
    {
      "indent": 3,
      "text": "If the expected MIC value differs from the calculated MIC value, all attachments MUST be considered invalid and retransmitted.",
      "ja": "期待MIC値が算出したMIC値と異なる場合は、すべての添付ファイルは無効再送考えなければなりません。"
    },
    {
      "indent": 0,
      "text": "2.4. Document Processing",
      "section_title": true,
      "ja": "2.4。文書処理"
    },
    {
      "indent": 3,
      "text": "Upon receipt of an EDIINT message with multiple attachments, the receiving user agent MUST be able to extract the attached payloads from the message rather than only removing the multipart/related body from the message. The storing or processing of the documents as they relate to the pending transaction is implementation dependent.",
      "ja": "複数の添付ファイル付きEDIINTメッセージを受信すると、受信ユーザエージェントは、メッセージからかなりのみメッセージからマルチパート/関連体を除去するよりも、添付のペイロードを抽出できなければなりません。彼らは、保留中のトランザクションに関連して、文書の保存や処理は実装依存です。"
    },
    {
      "indent": 0,
      "text": "2.5. Content-Types to Support",
      "section_title": true,
      "ja": "2.5。コンテンツタイプをサポートします"
    },
    {
      "indent": 3,
      "text": "Documents of the following MIME media types MAY be found in a multipart/related body and MUST be accepted by the user agent. However, any media type can be used depending upon industry need, and other media types MAY be accepted depending upon the trading-partner agreement. Please see [MIMEREG] for the definitions of the media types listed below.",
      "ja": "次のMIMEメディアタイプの文書は、マルチパート/関連体内に見つけることができるとユーザエージェントによって受け入れられなければなりません。しかし、任意のメディアタイプは、業界のニーズに応じて使用することができ、他のメディアタイプは、取引相手の契約によっては受け入れられます。以下に挙げるメディアタイプの定義については、[MIMEREG]を参照してください。"
    },
    {
      "indent": 6,
      "text": "application/xml",
      "ja": "アプリケーション/ XML"
    },
    {
      "indent": 6,
      "text": "application/pdf",
      "ja": "アプリケーション/ PDF"
    },
    {
      "indent": 6,
      "text": "application/msword",
      "ja": "アプリケーション/ mswordは"
    },
    {
      "indent": 6,
      "text": "application/rtf",
      "ja": "アプリケーション/ RTF"
    },
    {
      "indent": 6,
      "text": "application/octet-stream",
      "ja": "アプリケーション/ octet-streamの"
    },
    {
      "indent": 6,
      "text": "application/zip",
      "ja": "アプリケーション/ジップ"
    },
    {
      "indent": 6,
      "text": "image/gif",
      "ja": "画像/ GIF"
    },
    {
      "indent": 6,
      "text": "image/tiff",
      "ja": "画像/ TIFF"
    },
    {
      "indent": 6,
      "text": "image/jpeg",
      "ja": "画像/ JPEG"
    },
    {
      "indent": 6,
      "text": "text/plain text/html",
      "ja": "テキスト/プレーンテキスト/ HTML"
    },
    {
      "indent": 6,
      "text": "text/rtf",
      "ja": "テキスト/ RTF"
    },
    {
      "indent": 6,
      "text": "text/xml",
      "ja": "text / xmlで"
    },
    {
      "indent": 0,
      "text": "3. Example Message",
      "section_title": true,
      "ja": "3.メッセージの例"
    },
    {
      "indent": 3,
      "text": "Below is an example AS2 message that uses two attachments. The first attachment is an XML document, which is the root attachment, and the second attachment is a PDF document. The content of both the XML and PDF documents, as well as the applied digital signature, has been omitted for size consideration. This example is provided as an illustration only and is not considered part of the specification. If the example conflicts with the definitions specified above or in the other referenced RFCs, the example is considered invalid.",
      "ja": "下の2つのアタッチメントを使用する例のAS2メッセージです。最初のアタッチメントは、ルート添付されたXML文書であり、そして第二の取付は、PDF文書です。両方のXMLとPDF文書の内容だけでなく、適用されるデジタル署名は、サイズの検討のために省略されています。この例は、単に例示として提供され、明細書の一部とは見なされません。例では、他の参照RFCの上または中に指定された定義と矛盾する場合は、例は無効であると考えられます。"
    },
    {
      "indent": 6,
      "text": "POST /as2 HTTP/1.1\nHost: www.example.com:8080\nConnection: Close, TE\nMessage-ID: <1109712943488@10.65.122.242>\nSubject: Multiple Attachment Example\nDate: Tue, 01 Mar 2005 21:37:03 GMT\nAS2-To: TradingPartner\nAS2-From: User\nAS2-Version: 1.2\nEDIINT-Features: multiple-attachments\nDisposition-Notification-To: http://www.example.com/as2\nDisposition-Notification-Options:\n   signed-receipt-protocol=optional,pkcs7-signature;\n   signed-receipt-micalg=optional,sha-1\nContent-type: multipart/signed;\n   protocol=\"application/pkcs7-signature\"; micalg=sha-1;\n   boundary=\"OUTER-BOUNDARY\"\nContent-length: 207440",
      "raw": true
    },
    {
      "indent": 6,
      "text": "--OUTER-BOUNDARY Content-type: multipart/related; boundary=\"INNER-BOUNDARY\"; start=\"<root.attachment>\"; type=\"application/xml\"",
      "ja": "--OUTER-BOUNDARYコンテンツタイプ：マルチパート/関連;境界= \"INNER-BOUNDARY\"。スタート= \"<root.attachment>\";タイプ= \"アプリケーション/ xmlの\""
    },
    {
      "indent": 6,
      "text": "--INNER-BOUNDARY Content-type: application/xml Content-ID: <root.attachment>",
      "ja": "--INNER-BOUNDARYコンテンツタイプ：アプリケーション/ XMLコンテンツ-ID：<root.attachment>"
    },
    {
      "indent": 6,
      "text": "[XML DOCUMENT]",
      "ja": "[XMLドキュメント]"
    },
    {
      "indent": 6,
      "text": "--INNER-BOUNDARY Content-type: application/pdf Content-ID: <2nd.attachment>",
      "ja": "--INNER-BOUNDARYコンテンツタイプ：アプリケーション/ PDFコンテンツ-ID：<2nd.attachment>"
    },
    {
      "indent": 6,
      "text": "[PDF DOCUMENT]",
      "ja": "[PDFドキュメント]"
    },
    {
      "indent": 6,
      "text": "--INNER-BOUNDARY--",
      "ja": "--INNER-BOUNDARY--"
    },
    {
      "indent": 6,
      "text": "--OUTER-BOUNDARY Content-type: application/pkcs7-signature",
      "ja": "--OUTER-BOUNDARYコンテンツタイプ：アプリケーション/ PKCS7署名"
    },
    {
      "indent": 6,
      "text": "[DIGITAL SIGNATURE]",
      "ja": "[デジタル署名]"
    },
    {
      "indent": 6,
      "text": "--OUTER-BOUNDARY--",
      "ja": "--OUTER-BOUNDARY--"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "Multiple attachments have security concerns that are very similar to those described in the three EDIINT transport standards. These include the importance of using strong cryptography and the necessity of using valid certificates and chaining to a trusted certification authority (CA). Please refer to these standards -- SMTP AS1 [RFC3335], HTTP AS2 [RFC4130], and FTP AS3 [RFC4823] -- for details of their security considerations.",
      "ja": "複数の添付ファイルは3つのEDIINT輸送規格に記載されているものと非常に類似しているセキュリティ上の懸念を持っています。これらは、強力な暗号化と有効な証明書を使用して、信頼できる認証局（CA）への連鎖の必要性を使用することの重要性を含んでいます。これらの基準を参考にしてください -  SMTP AS1 [RFC3335]、HTTP AS2 [RFC4130]、およびFTP AS3 [RFC4823]  - 彼らのセキュリティの考慮事項の詳細については。"
    },
    {
      "indent": 3,
      "text": "The only additional security consideration is that if the MIC calculation by the user agent differs from the expected MIC calculation, all the attached documents MUST be considered invalid. Because the MIC calculation is over the multipart/related body, the MIC validates the content integrity of all the documents.",
      "ja": "唯一の追加のセキュリティの考慮事項は、ユーザエージェントによるMIC計算が期待MIC計算と異なる場合は、すべての添付文書は無効であると見なさなければならないということです。 MICの計算はマルチパート/関連体の上にあるので、MICは、すべての文書の内容の整合性を検証します。"
    },
    {
      "indent": 0,
      "text": "5. Normative References",
      "section_title": true,
      "ja": "5.引用規格"
    },
    {
      "indent": 3,
      "text": "[MIMEREG] \"MIME Media Types\", <http://www.iana.org/>.",
      "ja": "[MIMEREG] \"MIMEメディアタイプ\"、<http://www.iana.org/>。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2387] Levinson, E., \"The MIME Multipart/Related Content-type\", RFC 2387, August 1998.",
      "ja": "[RFC2387]レビンソン、E.、 \"MIMEマルチパート/関連コンテンツ・タイプ\"、RFC 2387、1998年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC3335] Harding, T., Drummond, R., and C. Shih, \"MIME-based Secure Peer-to-Peer Business Data Interchange over the Internet\", RFC 3335, September 2002.",
      "ja": "[RFC3335]ハーディング、T.、ドラモンド、R.、およびC.シーズー、「MIMEベースのセキュアなピアツーピアのビジネスデータ交換をインターネット上で」、RFC 3335、2002年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC4130] Moberg, D. and R. Drummond, \"MIME-Based Secure Peer-to-Peer Business Data Interchange Using HTTP, Applicability Statement 2 (AS2)\", RFC 4130, July 2005.",
      "ja": "[RFC4130] Moberg、D.およびR.ドラモンド、 \"MIMEベースのセキュアなピアツーピアHTTPを使用してビジネスデータ交換、適用ステートメント2（AS2）\"、RFC 4130、2005年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC4823] Harding, T. and R. Scott, \"FTP Transport for Secure Peer-to-Peer Business Data Interchange over the Internet\", RFC 4823, April 2007.",
      "ja": "[RFC4823]ハーディング、T.およびR.スコット、「インターネット上でのセキュアなピア・ツー・ピアのビジネスデータ交換のためのFTP転送」、RFC 4823、2007年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC5234] Crocker, D., Ed., and P. Overell, \"Augmented BNF for Syntax Specifications: ABNF\", STD 68, RFC 5234, January 2008.",
      "ja": "\"構文仕様のための増大しているBNF：ABNF\" [RFC5234]クロッカー、D.、エド、およびP. Overell、。、STD 68、RFC 5234、2008年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC5402] Harding, T., Ed., \"Compressed Data within an Internet Electronic Data Interchange (EDI) Message\", RFC 5402, February 2010.",
      "ja": "[RFC5402]ハーディング、T.、エド。、 \"インターネット電子データ交換（EDI）メッセージ内の圧縮データ\"、RFC 5402、2010年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC6017] Meadors, K., Ed., \"Electronic Data Interchange - Internet Integration (EDIINT) Features Header Field\", RFC 6017, September 2010.",
      "ja": "[RFC6017] Meadors、K.、エド、 \"電子データ交換 - インターネットの統合（EDIINT）ヘッダーフィールド機能\" 2010年9月、RFC 6017を。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Kyle Meadors (editor) Drummond Group, Inc. Nashville, Tennessee 37221 US",
      "ja": "カイルMeadors（エディタ）ドラモンド・グループ、株式会社ナッシュビル、テネシー州37221米国"
    },
    {
      "indent": 3,
      "text": "Phone: +1 (817) 709-1627 EMail: kyle@drummondgroup.com",
      "ja": "電話：+1（817）709-1627 Eメール：kyle@drummondgroup.com"
    }
  ]
}