{
  "title": {
    "text": "RFC 6968 - FCAST: Object Delivery for the Asynchronous Layered Coding (ALC) and NACK-Oriented Reliable Multicast (NORM) Protocols",
    "ja": "RFC 6968 - FCAST：非同期階層（ALC）をコーディングし、NACK指向リライアブルマルチキャスト（NORM）プロトコルのオブジェクト配達"
  },
  "number": 6968,
  "created_at": "2019-11-02 07:10:37.281165+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                           V. Roca\nRequest for Comments: 6968                                         INRIA\nCategory: Experimental                                        B. Adamson\nISSN: 2070-1721                                Naval Research Laboratory\n                                                               July 2013",
      "raw": true
    },
    {
      "indent": 2,
      "text": "FCAST: Object Delivery for the Asynchronous Layered Coding (ALC) and NACK-Oriented Reliable Multicast (NORM) Protocols",
      "ja": "FCAST：非同期階層（ALC）をコーディングし、NACK指向リライアブルマルチキャスト（NORM）プロトコルのオブジェクト配達"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document introduces the FCAST reliable object (e.g., file) delivery application. It is designed to operate either on top of the underlying Asynchronous Layered Coding (ALC) / Layered Coding Transport (LCT) reliable multicast transport protocol or the NACK-Oriented Reliable Multicast (NORM) transport protocol.",
      "ja": "この文書はFCAST信頼オブジェクト（例えば、ファイル）配信アプリケーションを導入します。どちらかの基礎となる非同期階層（ALC）をコーディング/階層符号化トランスポート（LCT）信頼性の高いマルチキャストトランスポートプロトコルまたはNACK指向リライアブルマルチキャスト（NORM）トランスポートプロトコルの上で動作するように設計されています。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for examination, experimental implementation, and evaluation.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、検査、実験的な実装、および評価のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document defines an Experimental Protocol for the Internet community. This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "この文書は、インターネットコミュニティのためにExperimentalプロトコルを定義します。このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 IESGによって承認されていないすべての文書がインターネットStandardのどんなレベルの候補です。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6968.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6968で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2013 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2013 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n   1.1. Requirements Notation ......................................4\n   1.2. Definitions, Notations, and Abbreviations ..................5\n2. FCAST Data Formats ..............................................6\n   2.1. Compound Object Format .....................................6\n   2.2. Carousel Instance Descriptor Format ........................9\n3. FCAST Principles ...............................................12\n   3.1. FCAST Content Delivery Service ............................12\n   3.2. Compound Object and Metadata Transmission .................13\n   3.3. Metadata Content ..........................................13\n   3.4. Carousel Transmission .....................................15\n   3.5. Carousel Instance Descriptor Special Object ...............15\n   3.6. Compound Object Identification ............................17\n   3.7. FCAST Sender Behavior .....................................18\n   3.8. FCAST Receiver Behavior ...................................19\n4. Requirements for Compliant Implementations .....................20\n   4.1. Requirements Related to the Object Metadata ...............20\n   4.2. Requirements Related to the Carousel Instance Descriptor ..21\n5. Security Considerations ........................................22\n   5.1. Problem Statement .........................................22\n   5.2. Attacks against the Data Flow .............................22\n        5.2.1. Attacks Meant to Gain Access to\n               Confidential Objects ...............................23\n        5.2.2. Attacks Meant to Corrupt Objects ...................23\n   5.3. Attacks against the Session Control Parameters and\n        Associated Building Blocks ................................24\n        5.3.1. Attacks against the Session Description ............25\n        5.3.2. Attacks against the FCAST CID ......................25\n        5.3.3. Attacks against the Object Metadata ................25\n        5.3.4. Attacks against the ALC/LCT and NORM Parameters ....26\n        5.3.5. Attacks against the Associated Building Blocks .....26",
      "raw": true
    },
    {
      "indent": 3,
      "text": "   5.4. Other Security Considerations .............................27\n   5.5. Minimum Security Recommendations ..........................27\n6. Operational Considerations .....................................28\n7. IANA Considerations ............................................29\n   7.1. Creation of the FCAST Object Metadata Format Registry .....29\n   7.2. Creation of the FCAST Object Metadata Encoding Registry ...30\n   7.3. Creation of the FCAST Object Metadata Types Registry ......30\n8. Acknowledgments ................................................32\n9. References .....................................................32\n   9.1. Normative References ......................................32\n   9.2. Informative References ....................................33\nAppendix A. FCAST Examples ........................................35\n  A.1. Simple Compound Object Example .............................35\n  A.2. Carousel Instance Descriptor Example .......................36\nAppendix B. Additional Metadata Transmission Mechanisms ...........37\n  B.1. Supporting Additional Mechanisms ...........................37\n  B.2. Using NORM_INFO Messages with FCAST/NORM ...................38\n    B.2.1. Example ................................................38",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "This document introduces the FCAST reliable and scalable object (e.g., file) delivery application. Two variants of FCAST exist:",
      "ja": "この文書はFCAST信頼性が高くスケーラブルなオブジェクト（例えば、ファイル）配信アプリケーションを導入します。 FCASTの二つの変種が存在します。"
    },
    {
      "indent": 3,
      "text": "o FCAST/ALC, which relies on the Asynchronous Layered Coding (ALC) [RFC5775] and Layered Coding Transport (LCT) [RFC5651] reliable multicast transport protocol, and",
      "ja": "O FCAST /トランスポート（LCT）[RFC5651]信頼できるマルチキャストトランスポートプロトコルコーディング非同期階層符号化（ALC）[RFC5775]及び層状に依存してALC、および"
    },
    {
      "indent": 3,
      "text": "o FCAST/NORM, which relies on the NACK-Oriented Reliable Multicast (NORM) [RFC5740] transport protocol.",
      "ja": "NACK指向高信頼マルチキャスト（NORM）[RFC5740]のトランスポートプロトコルに依存しているO FCAST / NORM、。"
    },
    {
      "indent": 3,
      "text": "Hereafter, the term \"FCAST\" denotes either FCAST/ALC or FCAST/NORM. FCAST is not a new protocol specification per se. Instead, it is a set of data format specifications and instructions on how to use ALC and NORM to implement a file-casting service.",
      "ja": "以下では、用語 \"FCASTは\" FCAST / ALCまたはFCAST / NORMのいずれかを表します。 FCASTは、新しいプロトコル仕様そのものではありません。その代わりに、データフォーマット仕様とファイルキャスティングサービスを実装するためにALCおよびNORMを使用する方法の手順のセットです。"
    },
    {
      "indent": 3,
      "text": "FCAST is expected to work in many different environments and is designed to be flexible. The service provided by FCAST can differ according to the exact conditions under which FCAST is used. For instance, the delivery service provided by FCAST might be fully reliable, or only partially reliable, depending upon the exact way FCAST is used. Indeed, if FCAST/ALC is used for a finite duration over purely unidirectional networks (where no feedback is possible), a fully reliable service may not be possible in practice. This is different with NORM, which can collect reception and loss feedback from receivers. This is discussed in Section 6.",
      "ja": "FCASTは、多くの異なる環境で作業することが予想され、柔軟に設計されています。 FCASTによって提供されるサービスはFCASTが使用されるの下で正確な条件に応じて異なり得ます。例えば、FCASTによって提供される配信サービスはFCASTが使用される正確な方法に応じて、完全に信頼できる、または部分的にのみ信頼できるかもしれません。 FCAST / ALCは（何のフィードバックが可能ではない）純粋に単方向ネットワーク上の有限の期間に使用されている場合確かに、完全に信頼性の高いサービスは、実際にはできないことがあります。これは、受信機からの受信及び損失フィードバックを収集することができるNORMと異なっています。これは、第6節で議論されます。"
    },
    {
      "indent": 3,
      "text": "The delivery service provided by FCAST might also differ in terms of scalability with respect to the number of receivers. The FCAST/ALC service is naturally massively scalable, since neither FCAST nor ALC limits the number of receivers (there is no feedback message at all). Conversely, the scalability of FCAST/NORM is typically limited by NORM itself, as NORM relies on feedback messages from the receivers. However, NORM is designed in such a way to offer a reasonably scalable service (e.g., through the use of proactive Forward Error Correction (FEC) codes [RFC6363]), and so does the service provided by FCAST/NORM. This aspect is also discussed in Section 6.",
      "ja": "FCASTによって提供される配信サービスはまた、受信機の数に対するスケーラビリティの点で異なる場合があります。 FCAST / ALCサービスはどちらもFCASTいるので、自然に大規模な拡張性のあるもALCは、受信機の数を制限します（まったくフィードバックメッセージはありません）。 NORMは、受信機からのフィードバックメッセージに依存しているように、逆に、FCAST / NORMのスケーラビリティは、典型的には、NORM自体によって制限されます。しかしながら、NORMが合理的にスケーラブルなサービスを提供するように設計されている（例えば、プロアクティブ順方向誤り訂正（FEC）符号を使用することにより、[RFC6363]）は、等FCAST / NORMによって提供されるサービスが行います。この態様はまた、セクション6で説明されています。"
    },
    {
      "indent": 3,
      "text": "A design goal behind FCAST is to define a streamlined solution, in order to enable lightweight implementations of the protocol stack and to limit the operational processing and storage requirements. A consequence of this choice is that FCAST cannot be considered a versatile application capable of addressing all the possible use-cases. On the contrary, FCAST has some intrinsic limitations. From this point of view, it differs from the File Delivery over Unidirectional Transport (FLUTE) [RFC6726], which favors flexibility at the expense of some additional complexity.",
      "ja": "FCAST後ろ設計目標は、プロトコルスタックの軽量実装を可能にし、演算処理および記憶要件を制限するために、合理化された溶液を定義することです。この選択の結果はFCASTは、すべての可能なユースケースに対処できる汎用性の高いアプリケーションと考えることができないということです。それどころか、FCASTは、いくつかの固有の制限があります。この観点から、それはいくつかの追加の複雑さを犠牲にして柔軟性を好む単方向交通（FLUTE）[RFC6726]、オーバーファイル配信とは異なります。"
    },
    {
      "indent": 3,
      "text": "A good example of the design choices meant to favor simplicity is the way FCAST manages the object metadata: by default, the metadata and the object content are sent together, in a Compound Object. This solution has many advantages in terms of simplicity, as will be described later on. However, this solution has an intrinsic limitation, since it does not enable a receiver to decide in advance, before beginning the reception of the Compound Object, whether the object is of interest or not, based on the information that may be provided in the metadata. Therefore, this document discusses additional techniques that may be used to mitigate this limitation. When use-cases require that each receiver download the whole set of objects sent in the session (e.g., with mirroring tools), this limitation is not considered a problem.",
      "ja": "デフォルトでは、メタデータとオブジェクトのコンテンツは、複合オブジェクトで、一緒に送信されます。シンプルさを優先するように意図し設計上の選択の良い例はFCASTは、オブジェクトのメタデータを管理方法です。後述するように、このソリューションでは、シンプルさの面で多くの利点があります。それは、オブジェクトがメタデータに提供される情報に基づいて、関心があるか否かを、複合オブジェクトの受信を開始する前に、事前に決定するために受信機を有効にしないので、この解決法は、固有の制限を有しています。したがって、この文書は、この制限を緩和するために使用することができる追加の技法について説明します。ユースケースは、各受信機が（ミラーリングツールを使用して、例えば）セッションで送信されたオブジェクトのセット全体をダウンロードすることを必要とする場合、この制限は問題とは見なされません。"
    },
    {
      "indent": 3,
      "text": "Finally, Section 4 provides guidance for compliant implementation of the specification and identifies those features that are optional.",
      "ja": "最後に、第4節では、仕様の準拠した実装のためのガイダンスを提供し、オプションであり、それらの機能を識別します。"
    },
    {
      "indent": 0,
      "text": "1.1. Requirements Notation",
      "section_title": true,
      "ja": "1.1。要件表記"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "1.2. Definitions, Notations, and Abbreviations",
      "section_title": true,
      "ja": "1.2。定義、表記、および略語"
    },
    {
      "indent": 3,
      "text": "This document uses the following definitions:",
      "ja": "このドキュメントでは、次の定義を使用します。"
    },
    {
      "indent": 3,
      "text": "FCAST/ALC: denotes the FCAST application running on top of the ALC/LCT transport protocol.",
      "ja": "FCAST / ALCは：ALC / LCTトランスポートプロトコルの上で実行されているFCASTアプリケーションを示しています。"
    },
    {
      "indent": 3,
      "text": "FCAST/NORM: denotes the FCAST application running on top of the NORM transport protocol.",
      "ja": "FCAST / NORM：NORMトランスポートプロトコルの上で実行されているFCASTアプリケーションを示しています。"
    },
    {
      "indent": 3,
      "text": "FCAST: denotes either FCAST/ALC or FCAST/NORM.",
      "ja": "FCAST：FCAST / ALCまたはFCAST / NORMのいずれかを表します。"
    },
    {
      "indent": 3,
      "text": "Compound Object: denotes an ALC or NORM transport object composed of the FCAST Header and the Object Data (some Compound Objects may not include any Object Data).",
      "ja": "複合オブジェクトは：FCASTヘッダと対象データの構成ALC又はNORM移送オブジェクトを（いくつかの化合物のオブジェクトは、任意のオブジェクトデータを含まなくてもよい）です。"
    },
    {
      "indent": 3,
      "text": "FCAST Header: denotes the header prepended to the Object Data, which together form the Compound Object. This FCAST Header usually contains the object metadata, among other things.",
      "ja": "FCASTヘッダー：一緒に複合オブジェクトを構成するオブジェクトデータの先頭に追加ヘッダを表します。このFCASTヘッダは、通常、他のものの間で、オブジェクトのメタデータが含まれています。"
    },
    {
      "indent": 3,
      "text": "Object Data: denotes the original object (e.g., a file) that forms the payload of the Compound Object.",
      "ja": "オブジェクトデータは：複合オブジェクトのペイロードを形成する元のオブジェクト（例えば、ファイル）です。"
    },
    {
      "indent": 3,
      "text": "Carousel: denotes the building block that enables an FCAST sender to transmit Compound Objects in a cyclic manner.",
      "ja": "カルーセルは：周期的に複合オブジェクトを送信するFCAST送信者を可能ビルディングブロックです。"
    },
    {
      "indent": 3,
      "text": "Carousel Instance: denotes a fixed set of registered Compound Objects that are sent by the carousel during a certain number of cycles. Whenever Compound Objects need to be added or removed, a new Carousel Instance is defined.",
      "ja": "カルーセルインスタンス：サイクルの特定の数の間カルーセルによって送信され、登録さ化合オブジェクトの固定セットを表します。複合オブジェクトを追加または削除する必要があるときはいつでも、新しいカルーセルインスタンスが定義されています。"
    },
    {
      "indent": 3,
      "text": "Carousel Instance Descriptor (CID): denotes a special object that lists the Compound Objects that comprise a given Carousel Instance.",
      "ja": "カルーセルインスタンス記述子（CID）：指定したカルーセルインスタンスを構成する複合オブジェクトを一覧表示し、特別なオブジェクトを表します。"
    },
    {
      "indent": 3,
      "text": "Carousel Instance IDentifier (CIID): numeric value that identifies a Carousel Instance.",
      "ja": "カルーセルインスタンス識別子（CIID）：カルーセルインスタンスを識別する数値。"
    },
    {
      "indent": 3,
      "text": "Carousel Cycle: denotes a transmission round within which all the Compound Objects registered in the Carousel Instance are transmitted a certain number of times. By default, Compound Objects are transmitted once per cycle, but higher values, which might differ on a per-object basis, are possible.",
      "ja": "カルーセルサイクル：カルーセルインスタンスに登録されている全ての化合物オブジェクトが一定回数送信される内に送信ラウンドを表します。デフォルトでは、化合物のオブジェクトは、1周期に1回送信されますが、オブジェクトごとに異なる可能性がありますより高い値は、可能です。"
    },
    {
      "indent": 3,
      "text": "Transport Object Identifier (TOI): denotes the numeric identifier associated with a specific object by the underlying transport protocol. In the case of ALC, this corresponds to the TOI described in [RFC5651]. In the case of NORM, this corresponds to the NormTransportId described in [RFC5740].",
      "ja": "移送オブジェクト識別子（TOI）は：基礎となるトランスポートプロトコルによって、特定のオブジェクトに関連付けられた数値識別子を表します。 ALCの場合、これは[RFC5651]で説明TOIに相当します。 NORMの場合、これは[RFC5740]で説明NormTransportIdに相当します。"
    },
    {
      "indent": 3,
      "text": "FEC Object Transmission Information (FEC OTI): FEC information associated with an object and that is essential for the FEC decoder to decode a specific object.",
      "ja": "FECオブジェクト伝送情報（FEC OTI）：オブジェクトに関連付けられたFEC情報と、その特定のオブジェクトをデコードするFEC復号のために必須です。"
    },
    {
      "indent": 0,
      "text": "2. FCAST Data Formats",
      "section_title": true,
      "ja": "2. FCASTデータ形式"
    },
    {
      "indent": 3,
      "text": "This section details the various data formats used by FCAST.",
      "ja": "このセクションでは、FCASTで使用される様々なデータ形式を詳述します。"
    },
    {
      "indent": 0,
      "text": "2.1. Compound Object Format",
      "section_title": true,
      "ja": "2.1。複合オブジェクトフォーマット"
    },
    {
      "indent": 3,
      "text": "In an FCAST session, Compound Objects are constructed by prepending the FCAST Header (which usually contains the metadata of the object) to the Object Data (see Section 3.2). Figure 1 illustrates the associated format. All multi-byte fields MUST be in network (Big Endian) byte order.",
      "ja": "FCASTセッションでは、化合物オブジェクトがオブジェクトデータ（通常はオブジェクトのメタデータを含む）FCASTヘッダを付加することによって構築される（セクション3.2参照）。図1は、関連するフォーマットを示します。すべてのマルチバイトのフィールドは、ネットワーク内（ビッグエンディアン）バイトオーダーでなければなりません。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+  ^\n| Ver |Resvd|G|C| MDFmt | MDEnc |           Checksum            |  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+  |\n|                      FCAST Header Length                      |  h\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-|  d\n|               Object Metadata (variable length)               |  r\n|                               +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+  |\n|                               |      Padding (optional)       |  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+  v\n|                                                               |\n.          Object Data (optional, variable length)              .\n.                                                               .\n.                                                               .",
      "raw": true
    },
    {
      "indent": 21,
      "text": "Figure 1: Compound Object Format",
      "ja": "図1：化合物オブジェクトフォーマット"
    },
    {
      "indent": 3,
      "text": "The FCAST Header fields are:",
      "ja": "FCASTヘッダフィールドは、次のとおりです。"
    },
    {
      "indent": 3,
      "text": "+------------+------------------------------------------------------+\n|      Field | Description                                          |\n+------------+------------------------------------------------------+\n|    Version | 3-bit field that MUST be set to 0 in this            |\n|            | specification and that indicates the FCAST protocol  |\n|            | version number.                                      |\n|            |                                                      |\n|   Reserved | 3-bit field that MUST be set to 0 in this            |\n|            | specification and is reserved for future use.        |\n|            | Receivers MUST ignore this field.                    |\n|            |                                                      |\n|          G | 1-bit field that, when set to 1, indicates that the  |\n|            | checksum encompasses the whole Compound Object       |\n|            | (Global checksum).  When set to 0, this field        |\n|            | indicates that the checksum encompasses only the     |\n|            | FCAST Header.                                        |\n|            |                                                      |\n|          C | 1-bit field that, when set to 1, indicates that the  |\n|            | object is a CID.  When set to 0, this field          |\n|            | indicates that the transported object is a standard  |\n|            | object.                                              |\n|            |                                                      |\n|   Metadata | 4-bit field that defines the format of the Object    |\n|     Format | Metadata field (see Section 7).  An HTTP/1.1         |\n|    (MDFmt) | metainformation format [RFC2616] MUST be supported   |\n|            | and is associated to value 0.  Other formats (e.g.,  |\n|            | XML) may be defined in the future.                   |\n|            |                                                      |\n|   Metadata | 4-bit field that defines the optional encoding of    |\n|   Encoding | the Object Metadata field (see Section 7).  Two      |\n|    (MDEnc) | values are currently defined.  A value of 0          |\n|            | indicates that the field contains UTF-8 encoded      |\n|            | [RFC3629] text.  A value of 1 indicates that the     |\n|            | field contains GZIP [RFC1952] compressed UTF-8       |\n|            | encoded text.                                        |\n|            |                                                      |",
      "raw": true
    },
    {
      "indent": 3,
      "text": "|   Checksum | 16-bit field that contains the checksum computed     |\n|            | over either the whole Compound Object (when G is set |\n|            | to 1) or over the FCAST Header (when G is set to 0), |\n|            | using the Internet checksum algorithm specified in   |\n|            | [RFC1071].  More precisely, the Checksum field is    |\n|            | the 16-bit one's complement of the one's complement  |\n|            | sum of all 16-bit words to be considered.  If a      |\n|            | segment contains an odd number of octets to be       |\n|            | checksummed, the last octet is padded on the right   |\n|            | with zeros to form a 16-bit word for checksum        |\n|            | purposes (this pad is not transmitted).  While       |\n|            | computing the checksum, the Checksum field itself    |\n|            | MUST be set to zero.                                 |\n|            |                                                      |\n|      FCAST | 32-bit field indicating total length (in bytes) of   |\n|     Header | all fields of the FCAST Header, except the optional  |\n|     Length | padding.  An FCAST Header Length field set to value  |\n|            | 8 means that there is no metadata included.  When    |\n|            | this size is not a multiple of 32-bit words and when |\n|            | the FCAST Header is followed by non-null Object      |\n|            | Data, padding MUST be added.  It should be noted     |\n|            | that the Object Metadata field maximum size is equal |\n|            | to (2^32 - 8) bytes.                                 |\n|            |                                                      |\n|     Object | Variable-length field that contains the metadata     |\n|   Metadata | associated to the object.  The format and encoding   |\n|            | of this field are defined by the MDFmt and MDEnc     |\n|            | fields, respectively.  With the default format and   |\n|            | encoding, the Object Metadata field, if not empty,   |\n|            | MUST contain UTF-8 encoded text that follows the     |\n|            | \"TYPE\" \":\" \"VALUE\" \"<CR-LF>\" format used in HTTP/1.1 |\n|            | for metainformation [RFC2616].  The various          |\n|            | metadata items can appear in any order.  The         |\n|            | receiver MUST NOT assume that this string is NULL-   |\n|            | terminated.  When no metadata is communicated, this  |\n|            | field MUST be empty and the FCAST Header Length MUST |\n|            | be equal to 8.                                       |\n|            |                                                      |\n|    Padding | Optional, variable-length field of zero-value bytes  |\n|            | to align the start of the Object Data to a 32-bit    |\n|            | boundary.  Padding is only used when the FCAST       |\n|            | Header Length value, in bytes, is not a multiple of  |\n|            | 4 and when the FCAST Header is followed by non-null  |\n|            | Object Data.                                         |\n+------------+------------------------------------------------------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The FCAST Header is then followed by the Object Data, i.e., either an original object (possibly encoded by FCAST) or a CID. Note that the length of the Object Data content is the ALC or NORM transported object length (e.g., as specified by the FEC OTI) minus the FCAST Header Length and optional padding, if any.",
      "ja": "FCASTヘッダーは、次に、オブジェクトデータ、すなわち、（おそらくFCASTによってコードされる）元のオブジェクトまたはCIDのいずれかが続きます。もしあれば、オブジェクトのデータ内容の長さは、ALCまたはNORM被搬送物の長さ（例えば、FEC OTIによって指定されるように）マイナスFCASTヘッダ長および任意のパディングであることに留意されたいです。"
    },
    {
      "indent": 0,
      "text": "2.2. Carousel Instance Descriptor Format",
      "section_title": true,
      "ja": "2.2。カルーセルインスタンスディスクリプタのフォーマット"
    },
    {
      "indent": 3,
      "text": "In an FCAST session, a CID MAY be sent in order to carry the list of Compound Objects that are part of a given Carousel Instance (see Section 3.5). The format of the CID that is sent as a special Compound Object is given in Figure 2. Being a special case of Compound Object, this format is in line with the format described in Section 2.1.",
      "ja": "FCASTセッションでは、CIDは、与えられたカルーセルインスタンス（3.5節を参照）の一部である複合オブジェクトのリストを実行するために送信されるかもしれません。特殊な複合オブジェクトとして送信されるCIDのフォーマットは、化合物の特殊なケースなので、図2に示され、このフォーマットは、セクション2.1で記述されたフォーマットと一致しています。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+  ^\n| Ver |Resvd|G|C| MDFmt | MDEnc |           Checksum            |  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+  |\n|                      FCAST Header Length                      |  h\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-|  d\n|               Object Metadata (variable length)               |  r\n|                               +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+  |\n|                               |      Padding (optional)       |  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+  v\n.                                                               .  ^\n.                Object List (variable length)                  .  |\n.                                                               .  o\n.                                               +-+-+-+-+-+-+-+-+  b\n.                                               |                  j\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+                  v",
      "raw": true
    },
    {
      "indent": 15,
      "text": "Figure 2: Carousel Instance Descriptor Format",
      "ja": "図2：カルーセルインスタンスディスクリプタのフォーマット"
    },
    {
      "indent": 3,
      "text": "Because the CID is transmitted as a special Compound Object, the following CID-specific metadata entries are defined and MUST be supported:",
      "ja": "CIDは、特殊な複合オブジェクトとして送信されるため、以下のCID固有のメタデータエントリが定義されており、支持しなければなりません。"
    },
    {
      "indent": 3,
      "text": "o Fcast-CID-Complete: this is an optional entry that, when set to \"Fcast-CID-Complete: 1\", indicates no new object (if we ignore CID Compound Objects) in addition to the ones whose TOIs are listed in this CID or the ones that have been listed in the previous CID(s), will be sent in the future. Conversely, if it is set to \"Fcast-CID-Complete: 0\", or if this entry is absent, it indicates that the session is not complete. An FCAST sender MUST NOT use any other value for this entry.",
      "ja": "O Fcast-CID-コンプリート：これは「Fcast-CID-コンプリート：1」に設定し、オプションのエントリーです（私たちはCIDの複合オブジェクトを無視した場合）、TOISこの中に記載されていたものに加えて、新たなオブジェクトがないことを示しますCIDまたは前のCID（S）に記載されているものは、将来的に送信されます。逆に、「Fcast-CID-コンプリート：0」に設定されている場合、またはこのエントリが存在しない場合、それはセッションが完了していないことを示しています。 FCASTの送信者は、このエントリの他の値を使用してはなりません。"
    },
    {
      "indent": 3,
      "text": "o Fcast-CID-ID: this entry contains the Carousel Instance IDentifier, or CIID. It starts from 0 upon FCAST session creation and is incremented by 1 for each new Carousel Instance. This entry is optional if the FCAST session consists of a single, complete Carousel Instance (no need for the FCAST sender to specify it and for the FCAST receiver to process it). In all other cases, this entry MUST be defined. In particular, the CIID is used by the TOI equivalence mechanism, thanks to which any object is uniquely identified, even if the TOI is updated (e.g., after re-enqueuing the object with NORM). The Fcast-CID-ID value can also be useful for detecting possible gaps in the Carousel Instances, for instance, gaps caused by long disconnection periods. Finally, it can also be useful for avoiding problems when TOI wrapping to 0 takes place to differentiate the various incarnations of the TOIs if need be.",
      "ja": "O Fcast-CID-ID：このエントリは、カルーセルインスタンス識別子、またはCIIDが含まれています。それはFCASTセッション作成時に0から始まり、それぞれの新しいカルーセルインスタンスの1ずつインクリメントされます。 FCASTセッションは、単一の、完全なカルーセルインスタンス（それを指定するFCASTの送信者と、それを処理するFCAST受信機が不要）で構成されている場合、このエントリはオプションです。他のすべてのケースでは、このエントリを定義する必要があります。特に、CIIDはTOI（例えば、後NORM持つオブジェクトを再エンキュー）が更新された場合でも、TOI等価機構によって任意のオブジェクトを一意に識別されたおかげで使用されます。 Fcast-CID-ID値はまた、長い切断期間に起因するギャップ、例えば、カルーセルインスタンスで可能なギャップを検出するのに有用であり得ます。最後に、それはまた、0にTOIのラッピングが必要であればTOISの様々な化身を区別するために行われたときに問題を回避するために有用であることができます。"
    },
    {
      "indent": 3,
      "text": "The following standard metadata entry types are also used (Section 3.3):",
      "ja": "次の標準メタデータ・エントリ・タイプも（3.3節）を使用しています。"
    },
    {
      "indent": 3,
      "text": "o Content-Length: specifies the size in bytes of the Object List, before any content encoding (if any).",
      "ja": "OのContent-Lengthは：すべてのコンテンツのエンコード（もしあれば）の前に、オブジェクトリストのサイズをバイト単位で指定します。"
    },
    {
      "indent": 3,
      "text": "o Content-Encoding: specifies the optional encoding of the Object List, performed by FCAST.",
      "ja": "Oコンテンツエンコード：FCASTによって行われるオブジェクトリストのオプションのエンコーディングを指定します。"
    },
    {
      "indent": 3,
      "text": "An empty Object List is valid and indicates that the current Carousel Instance does not include any objects (Section 3.5). This can be specified by using the following metadata entry:",
      "ja": "空のオブジェクトリストは有効であり、現在のカルーセルインスタンスは、任意のオブジェクト（3.5節）を含まないことを示しています。これは、次のメタデータエントリを使用して指定することができます。"
    },
    {
      "indent": 9,
      "text": "Content-Length: 0",
      "ja": "コンテンツの長さ：0"
    },
    {
      "indent": 3,
      "text": "or simply by leaving the Object List empty. In both cases, padding MUST NOT be used, and consequently the ALC or NORM transported object length (e.g., as specified by the FEC OTI) minus the FCAST Header Length equals zero.",
      "ja": "あるいは単に空のオブジェクトリストを残すこともできます。両方の場合において、パディングは使用してはいけません、その結果、ALC又はNORM被搬送物の長さ（例えば、FEC OTIによって指定されるように）マイナスFCASTヘッダ長はゼロに等しいです。"
    },
    {
      "indent": 3,
      "text": "The Object List, when non-empty and with MDEnc=0, is UTF-8-encoded text that is not necessarily NULL-terminated. It can contain two things:",
      "ja": "MDEnc = 0で、必ずしもNULL終了ではありませんUTF-8でエンコードされたテキストである非空とオブジェクトのリスト、。それは2つのことを含めることができます。"
    },
    {
      "indent": 3,
      "text": "o a list of TOI values, and",
      "ja": "O TOI値のリスト、および"
    },
    {
      "indent": 3,
      "text": "o a list of TOI equivalences.",
      "ja": "TOIの等価のリストO。"
    },
    {
      "indent": 3,
      "text": "A list of TOIs included in the current Carousel Instance is specified as an ASCII string containing comma-delimited individual TOI values and/or TOI intervals. Individual TOIs consist of a single integer value, while TOI intervals are a hyphen-delimited pair of TOI values to indicate an inclusive range of TOI values (e.g., \"1,2,4-6\" would indicate the list of TOI values of 1, 2, 4, 5, and 6). For a TOI interval indicated by \"TOI_a-TOI_b\", the \"TOI_a\" value MUST be strictly inferior to the \"TOI_b\" value. If a TOI wrapping to 0 occurs in an interval, then two TOI intervals MUST be specified: TOI_a-MAX_TOI and 0-TOI_b.",
      "ja": "TOISのリストは、カンマ区切りの個々のTOI値及び/又はTOI間隔を含むASCII文字列として指定されている現在のカルーセルインスタンスに含まれます。 TOI間隔が1のTOI値のリストを示すであろうTOI値（例えば、「1,2,4-6」の包括範囲を示すために、TOI値のハイフンで区切られたペアであるが、個々のTOISは、単一の整数値から成ります、2、4、5、及び6）。 「TOI_a-TOI_b」で示さTOI間隔については、「TOI_a」値が「TOI_b」の値に厳密に劣っでなければなりません。 0にTOIラッピング間隔で発生した場合、2つのTOI間隔を指定する必要があり：TOI_a-MAX_TOI 0-TOI_bを。"
    },
    {
      "indent": 3,
      "text": "This string can also contain the TOI equivalences, if any. The format is a comma-separated list of equivalence TOI value pairs with a delimiting equals sign '=' to indicate the equivalence assignment (e.g., \" newTOI \"=\" 1stTOI \"/\" 1stCIID \"). Each equivalence indicates that the new TOI, for the current Carousel Instance, is equivalent to (i.e., refers to the same object as) the provided identifier, 1stTOI, for the Carousel Instance of ID 1stCIID. In the case of the NORM protocol, where NormTransportId values need to monotonically increase for NACK-based protocol operation, this allows an object from a prior Carousel Instance to be relisted in a subsequent Carousel Instance with the receiver set informed of the equivalence so that unnecessary retransmission requests can be avoided.",
      "ja": "いずれかの場合には、この文字列はまた、TOIの等価性を含めることができます。フォーマットは、等価割り当て（例えば、「newTOI 『=』 1stTOI 『/』 1stCIID」）を示すために記号「=」を等しく区切りと等価TOI値のペアのコンマ区切りのリストです。各等価新しいTOIは、現在のカルーセル例えば、と等価であることを示すID 1stCIIDのカルーセル例えば、提供される識別子、1stTOI（すなわち、同じオブジェクトを参照）。 NormTransportId値が単調NACKベースのプロトコル動作のために増加する必要がNORMプロトコルの場合、これは前カルーセルインスタンスからオブジェクトが不要になるように等価の通知を受信セットと後続のカルーセルインスタンスに再出品することを可能にします再送要求を回避することができます。"
    },
    {
      "indent": 3,
      "text": "The ABNF [RFC5234] is as follows:",
      "ja": "次のようにABNF [RFC5234]は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "cid-list = *(list-elem *( \",\" list-elem)) list-elem = toi-elem / toieq-elem toi-elem = toi-value / toi-interval toi-value = 1*DIGIT toi-interval = toi-value \"-\" toi-value ; additionally, the first toi-value MUST be ; strictly inferior to the second toi-value toieq-elem = \"(\" toi-value \"=\" toi-value \"/\" ciid-value \")\" ciid-value = 1*DIGIT DIGIT = %x30-39 ; a digit between 0 and 9, inclusive",
      "ja": "CIDリスト= *（リストELEMの*（ \"\" リストELEM））リストELEM = TOI-ELEM / toieq-ELEM TOI-ELEM = TOI値/ TOI間隔TOI値= 1 * DIGIT toi-間隔= TOI値「 - 」TOI値。さらに、最初のTOI値がなければなりません。 ciid値= 1 * DIGITのDIGIT =％x30-39 \"（\" TOI値 \"=\" TOI値 \"/\" ciid値 \"）\" =第TOI値toieq-ELEMに厳密に劣ります。 0〜9の数字、包括的"
    },
    {
      "indent": 3,
      "text": "For readability purposes and to simplify processing, the TOI values in the list MUST be given in increasing order, handling wrap of the TOI space appropriately. TOI equivalence elements MUST be grouped together at the end of the list in increasing newTOI order. Specifying a TOI equivalence for a given newTOI relieves the sender from specifying newTOI explicitly in the TOI list. A receiver MUST be able to handle situations where the same TOI appears both in the TOI value and TOI equivalence lists. Finally, a given TOI value or TOI equivalence item MUST NOT be included multiple times in either list.",
      "ja": "読みやすさのために、処理を簡素化するために、リスト中のTOI値を適切TOIスペースのラップを取り扱い、昇順に与えられなければなりません。 TOI等価要素がnewTOIの昇順でリストの末尾にまとめなければなりません。与えられたnewTOIのためのTOI等価を指定すると、TOIリストで明示的にnewTOIを指定してから送信者を解放します。受信機は、同じTOIは、両方のTOI値と同値TOIのリストに表示される状況を処理できなければなりません。最後に、与えられたTOI値またはTOI同値項目はどちらのリストに複数回を含んではいけません。"
    },
    {
      "indent": 3,
      "text": "For instance, the following Object List specifies that the current Carousel Instance is composed of 8 objects, and that TOIs 100 to 104 are equivalent to TOIs 10 to 14 of Carousel Instance ID 2 and refer to the same objects:",
      "ja": "例えば、以下のオブジェクトリストは、現在のカルーセルインスタンスが8つのオブジェクトから構成されることを指定し、TOISこと100〜104は、カルーセルインスタンスID 2の14にTOIS 10と同等であり、同一のオブジェクトを参照してください。"
    },
    {
      "indent": 3,
      "text": "97,98,99,(100=10/2),(101=11/2),(102=12/2),(103=13/2),(104=14/2)",
      "ja": "９７、９８、９９、（１００＝１０／２）、（１０１＝１１／２）、（１０２＝１２／２）、（１０３＝１３／２）、（１０４＝１４／２）"
    },
    {
      "indent": 3,
      "text": "or equivalently:",
      "ja": "または同等："
    },
    {
      "indent": 3,
      "text": "97-104,(100=10/2),(101=11/2),(102=12/2),(103=13/2),(104=14/2)",
      "ja": "９７ー１０４、（１００＝１０／２）、（１０１＝１１／２）、（１０２＝１２／２）、（１０３＝１３／２）、（１０４＝１４／２）"
    },
    {
      "indent": 0,
      "text": "3. FCAST Principles",
      "section_title": true,
      "ja": "3. FCAST原則"
    },
    {
      "indent": 3,
      "text": "This section details the principles of FCAST.",
      "ja": "このセクションでは、FCASTの原則を詳述します。"
    },
    {
      "indent": 0,
      "text": "3.1. FCAST Content Delivery Service",
      "section_title": true,
      "ja": "3.1。 FCASTコンテンツ配信サービス"
    },
    {
      "indent": 3,
      "text": "The basic goal of FCAST is to transmit objects to a group of receivers in a reliable way, where the receiver set may be restricted to a single receiver or may include possibly a very large number of receivers. FCAST supports two forms of operation:",
      "ja": "FCASTの基本的な目的は、受信機セットは、単一の受信機に限定され得るか、またはおそらく受信機の非常に大きな数を含むことができる信頼性の高い方法で受信機のグループにオブジェクトを送信することです。 FCASTは、操作の二つの形式をサポートしています。"
    },
    {
      "indent": 3,
      "text": "1. FCAST/ALC, where the FCAST application works on top of the ALC/LCT reliable multicast transport protocol, without any feedback from the receivers, and",
      "ja": "FCASTアプリケーションは、受信機からのフィードバックなしに、ALC / LCT信頼できるマルチキャストトランスポートプロトコルの上で動作する1 FCAST / ALC、および"
    },
    {
      "indent": 3,
      "text": "2. FCAST/NORM, where the FCAST application works on top of the NORM transport protocol, which requires positive/negative acknowledgments from the receivers.",
      "ja": "FCASTアプリケーションは、受信機からの肯定/否定応答を必要とNORMトランスポートプロトコルの上で動作する2 FCAST / NORM、。"
    },
    {
      "indent": 3,
      "text": "This specification is designed such that both forms of operation share as much commonality as possible. Section 6 discusses some operational aspects and the content delivery service that is provided by FCAST for a given use-case.",
      "ja": "この仕様は、可能な限り共通として動作共有の両方の形態に設計されています。セクション6は、いくつかの動作態様と所定のユースケースのためFCASTによって提供されるコンテンツ配信サービスを論じています。"
    },
    {
      "indent": 0,
      "text": "3.2. Compound Object and Metadata Transmission",
      "section_title": true,
      "ja": "3.2。複合オブジェクトとメタデータの伝送"
    },
    {
      "indent": 3,
      "text": "FCAST carries metadata elements by prepending them to the object they refer to. As a result, a Compound Object is created that is composed of an FCAST Header followed by the Object Data (Figure 3). This header is itself composed of the object metadata (if any) as well as several fields (e.g., to indicate format, encoding, or boundaries (Section 2.1)).",
      "ja": "FCASTは、彼らが参照オブジェクトにそれらを付加することでメタデータ要素を運びます。結果として、複合オブジェクトは、オブジェクトデータ（図3）続いFCASTヘッダで構成されているが作成されます。このヘッダは、それ自体がオブジェクトのメタデータ（もしあれば）、ならびに複数のフィールドで構成され（例えば、フォーマット、符号化、または境界（セクション2.1）を示します）。"
    },
    {
      "indent": 3,
      "text": "<------------------------ Compound Object ----------------------->\n+-------------------------+--------------------------------------+\n|       FCAST Header      |              Object Data             |\n| (can include metadata)  |       (can be encoded by FCAST)      |\n+-------------------------+--------------------------------------+",
      "raw": true
    },
    {
      "indent": 19,
      "text": "Figure 3: Compound Object Composition",
      "ja": "図3：化合物オブジェクト合成"
    },
    {
      "indent": 3,
      "text": "Attaching the metadata to the object is an efficient solution, since it guarantees that metadata are received along with the associated object, and it allows the transport of the metadata to benefit from any transport-layer erasure protection of the Compound Object (e.g., using FEC encoding and/or NACK-based repair). However, a limit of this scheme is that a client does not know the metadata of an object before beginning its reception, and in the case of erasures affecting the metadata, not until the object decoding is completed. The details of course depend upon the transport protocol and the FEC code used.",
      "ja": "オブジェクトにメタデータを添付することは、メタデータが関連付けられたオブジェクトとともに受信されることを保証するため、効率的なソリューションであり、メタデータのトランスポートがFECを用いて、化合物オブジェクト（例えば、任意のトランスポート層消去保護から利益を得ることができ符号化および/またはNACKベースの修復）。しかし、この方式の限界は、クライアントがその受信を開始する前に、およびメタデータに影響を与える消去の場合は、いないオブジェクト復号が完了するまで、オブジェクトのメタデータを把握していないということです。コースの詳細については、トランスポートプロトコルと使用されるFECコードに依存します。"
    },
    {
      "indent": 3,
      "text": "Appendix B describes extensions that provide additional means to carry metadata, e.g., to communicate metadata ahead of time.",
      "ja": "付録Bは、例えば、メタデータを運ぶために事前にメタデータを通信するために追加的な手段を提供する拡張機能について説明します。"
    },
    {
      "indent": 0,
      "text": "3.3. Metadata Content",
      "section_title": true,
      "ja": "3.3。メタデータコンテンツ"
    },
    {
      "indent": 3,
      "text": "The following metadata types are defined in [RFC2616]:",
      "ja": "次のメタデータの種類は、[RFC2616]で定義されています。"
    },
    {
      "indent": 3,
      "text": "o Content-Location: the URI of the object, which gives the name and location of the object.",
      "ja": "O含有量 - ロケーション：オブジェクトの名前と場所を与えるオブジェクトのURI、。"
    },
    {
      "indent": 3,
      "text": "o Content-Type: a string that contains the MIME type of the object.",
      "ja": "入出力のContent-Type：オブジェクトのMIMEタイプを含む文字列。"
    },
    {
      "indent": 3,
      "text": "o Content-Length: an unsigned 64-bit integer that contains the size in bytes of the initial object, before any content encoding (if any) and without considering the FCAST Header. Note that the use of certain FEC schemes MAY further limit the maximum value of the object.",
      "ja": "入出力のContent-Length：最初のオブジェクトのサイズをバイト単位で格納した符号なし64ビット整数、任意のコンテンツの符号化の前に（もしあれば）とFCASTヘッダを考慮しません。特定のFECスキームの使用は、他の目的の最大値を制限することができることに留意されたいです。"
    },
    {
      "indent": 3,
      "text": "o Content-Encoding: a string that contains the optional encoding of the object performed by FCAST. For instance:",
      "ja": "O含有量をコード：FCASTによって実行されるオブジェクトの任意の符号化を含むストリング。例えば："
    },
    {
      "indent": 12,
      "text": "Content-Encoding: gzip",
      "ja": "コンテンツエンコード：gzipで"
    },
    {
      "indent": 6,
      "text": "indicates that the object has been encoded with GZIP [RFC1952]. If there is no Content-Encoding entry, the receiver MUST assume that FCAST did not modify the original encoding of the object (default).",
      "ja": "オブジェクトはGZIP [RFC1952]で符号化されたことを示します。何のコンテンツをコードするエントリがない場合、受信機はFCASTがオブジェクト（デフォルト）のオリジナルのエンコーディングを変更しなかったと仮定しなければなりません。"
    },
    {
      "indent": 3,
      "text": "The following additional metadata types are defined to check object integrity:",
      "ja": "次の追加のメタデータ・タイプは、オブジェクトの整合性をチェックするために定義されています。"
    },
    {
      "indent": 3,
      "text": "o Fcast-Obj-Digest-SHA256: a string that contains the \"base64\" [RFC4648] encoding of the SHA-256 message digest of the object [RFC3174] [RFC6234], before any content encoding is applied (if any) and without considering the FCAST Header. This digest is meant to protect from transmission and processing errors, not from deliberate attacks by an intelligent attacker (see Section 5). This digest only protects the object, not the header, and therefore not the metadata. A separate checksum is provided for that purpose (Section 2.1).",
      "ja": "O Fcast-OBJダイジェスト-SHA256：任意のコンテンツのエンコーディングがなく適用（もしあれば）とされる前に、「BASE64」オブジェクト[RFC3174]、[RFC6234]のSHA256メッセージダイジェストの[RFC4648]エンコーディングを含む文字列FCASTヘッダーを考慮。このダイジェストは（セクション5を参照）、インテリジェントな攻撃者によって送信、処理エラーからではなく、意図的な攻撃から保護するためのものです。このダイジェストは、オブジェクトではなく、ヘッダ、したがってないメタデータを保護します。別のチェックサムは、その目的（セクション2.1）のために設けられています。"
    },
    {
      "indent": 3,
      "text": "o Fcast-Obj-Digest-SHA1: similar to Fcast-Obj-Digest-SHA256, except that SHA-256 is replaced by SHA-1. An FCAST sender MAY include both an Fcast-Obj-Digest-SHA1 and an Fcast-Obj-Digest-SHA256 message digest in the metadata, in order to let a receiver select the most appropriate algorithm (e.g., depending on local processing power).",
      "ja": "O Fcast-OBJ-ダイジェスト-SHA1：似ているSHA256がSHA1で置き換えられる以外、-OBJ-ダイジェスト -  SHA256をFcastします。 FCAST送信者はFcast-OBJダイジェスト-SHA1とFcast-OBJダイジェスト-SHA256メッセージは受信機が最も適切なアルゴリズムを選択できるようにするために、メタデータにダイジェスト（例えば、ローカル処理能力に応じて）の両方を含むことができます。"
    },
    {
      "indent": 3,
      "text": "The following additional metadata types are used for dealing with very large objects (e.g., objects that largely exceed the working memory of a receiver). When this happens, the metadata associated to each sub-object MUST include the following entries:",
      "ja": "以下の追加のメタデータの種類は非常に大きなオブジェクト（例えば、主に受信機のワーキングメモリを超えるオブジェクト）を扱うために使用されます。このとき、各サブオブジェクトに関連するメタデータは、次のエントリを含める必要があります。"
    },
    {
      "indent": 3,
      "text": "o Fcast-Obj-Slice-Nb: an unsigned 32-bit integer that contains the total number of slices. A value greater than 1 indicates that this object is the result of a split of the original object.",
      "ja": "O Fcast-OBJスライス-NB：スライスの総数を格納した符号なし32ビット整数。 1より大きい値は、このオブジェクトは、元のオブジェクトの分割の結果であることを示しています。"
    },
    {
      "indent": 3,
      "text": "o Fcast-Obj-Slice-Idx: an unsigned 32-bit integer that contains the slice index (in the {0 .. SliceNb - 1} interval).",
      "ja": "O Fcast-OBJスライス-IDX：（{0 .. SliceNb  -  1}に間隔）スライスインデックスを含む、符号なし32ビット整数。"
    },
    {
      "indent": 3,
      "text": "o Fcast-Obj-Slice-Offset: an unsigned 64-bit integer that contains the offset at which this slice starts within the original object.",
      "ja": "O Fcast-OBJスライス-オフセット：このスライスは、元のオブジェクト内の開始オフセットれる格納した符号なし64ビット整数。"
    },
    {
      "indent": 3,
      "text": "Future IANA assignments to extend the set of metadata types supported by FCAST are to be made through Expert Review [RFC5226].",
      "ja": "FCASTでサポートされているメタデータタイプのセットを拡張するために、将来のIANAの割り当ては、専門家レビュー[RFC5226]を介して行われるべきです。"
    },
    {
      "indent": 0,
      "text": "3.4. Carousel Transmission",
      "section_title": true,
      "ja": "3.4。カルーセル伝送"
    },
    {
      "indent": 3,
      "text": "A set of FCAST Compound Objects scheduled for transmission is considered a logical \"Carousel\". A given \"Carousel Instance\" is comprised of a fixed set of Compound Objects. Whenever the FCAST application needs to add new Compound Objects to or remove old Compound Objects from the transmission set, a new Carousel Instance is defined, since the set of Compound Objects changes. Because of the native object multiplexing capability of both ALC and NORM, a sender and receiver(s) are both capable of multiplexing and demultiplexing FCAST Compound Objects.",
      "ja": "送信のためにスケジュールFCAST化合物オブジェクトの集合は、論理的な「カルーセル」と考えられています。与えられた「カルーセルインスタンスは、」複合オブジェクトの固定セットで構成されています。 FCASTアプリケーションは、送信セットから古い複合オブジェクトを新しい複合オブジェクトを追加または削除する必要があるときはいつでも化合物のセットは、変更をオブジェクト以来、新しいカルーセルインスタンスは、定義されています。なぜなら、両方のALCおよびNORM、送信者と受信者（複数可）のネイティブオブジェクト多重機能の多重化及び多重分離FCAST化合オブジェクトの両方が可能です。"
    },
    {
      "indent": 3,
      "text": "For a given Carousel Instance, one or more transmission cycles are possible. During each cycle, all of the Compound Objects comprising the carousel are sent. By default, each object is transmitted once per cycle. However, in order to allow different levels of priority, some objects MAY be transmitted more often than others during a cycle and/or benefit from higher FEC protection than others. For example, this can be the case for the CID objects (Section 3.5), where extra protection can benefit overall carousel integrity. For some FCAST usage (e.g., a unidirectional \"push\" mode), a Carousel Instance may be sent in a single transmission cycle. In other cases, it may be conveyed in a large number of transmission cycles (e.g., in \"on-demand\" mode, where objects are made available for download during a long period of time).",
      "ja": "所与カルーセル例えば、一つ以上の伝送サイクルが可能です。各サイクル中、カルーセルを含む化合物のすべてのオブジェクトが送信されます。デフォルトでは、各オブジェクトは、1周期に1回送信されます。しかし、優先順位の異なるレベルを可能にするために、いくつかのオブジェクトは、サイクル中より頻繁に他よりも送信されても​​よい、および/または他のものよりも高いFEC保護の恩恵を受ける。たとえば、これは特別な保護が全体のカルーセルの整合性を受けることができCIDオブジェクト（3.5節）、の場合ですることができます。一部FCASTの使用（例えば、一方向の「プッシュ」モード）の場合、カルーセルインスタンスは、単一の送信周期で送信されても​​よいです。他の場合には、（オブジェクトは時間の長い期間にダウンロードするための利用可能になる「オンデマンド」モードで例えば、）送信サイクルの多数に搬送することができます。"
    },
    {
      "indent": 0,
      "text": "3.5. Carousel Instance Descriptor Special Object",
      "section_title": true,
      "ja": "3.5。カルーセルインスタンスディスクリプタの特殊オブジェクト"
    },
    {
      "indent": 3,
      "text": "The FCAST sender can transmit an OPTIONAL CID. The CID carries the list of the Compound Objects that are part of a given Carousel Instance by specifying their respective Transport Object Identifiers (TOIs). However, the CID does not describe the objects themselves (i.e., there is no metadata). Additionally, the CID MAY include an \"Fcast-CID-Complete: 1\" metadata entry to indicate that no further modification to the enclosed list will be done in the future. Finally, the CID MAY include a Carousel Instance ID (CIID) that identifies the Carousel Instance it pertains to. These aspects are discussed in Section 2.2.",
      "ja": "FCASTの送信者は、オプションCIDを送信することができます。 CIDは、それぞれのトランスポート・オブジェクト識別子（TOIS）を指定することによって指定されたカルーセルインスタンスの一部である化合物のオブジェクトのリストを運びます。しかしながら、CID（すなわち、いかなるメタデータが存在しない）オブジェクト自体を記載していません。また、CIDは、「Fcast-CID-コンプリート：1」を含むことができる囲まれたリストへの更なる変更は、将来的に行われないことを示すために、メタデータエントリ。最後に、CIDはそれに関連カルーセルインスタンスを識別するカルーセルインスタンスID（CIID）を含むことができます。これらの側面は、2.2節で議論されています。"
    },
    {
      "indent": 3,
      "text": "There is no reserved TOI value for the CID Compound Object itself, since this special object is regarded by ALC/LCT or NORM as a standard object. On the contrary, the nature of this object (CID) is indicated by means of a specific FCAST Header field (the \"C\" flag from Figure 1) so that it can be recognized and processed by the FCAST application as needed. A direct consequence is that since a receiver does not know in advance which TOI will be used for the following CID (in the case of a dynamic session), it MUST NOT filter out packets that are not in the current CID's TOI list. Said differently, the goal of the CID is not to set up ALC or NORM packet filters (this mechanism would not be secure in any case).",
      "ja": "この特別なオブジェクトは、標準オブジェクトとしてALC / LCTまたはNORMによってみなされているので、CIDの複合オブジェクト自体には予約済みのTOI値は、ありません。それは認識され、必要に応じてFCASTアプリケーションによって処理することができるように逆に、このオブジェクト（CID）の性質は、特定FCASTヘッダフィールド（図1の「C」フラグ）によって示されています。直接の結果は、受信機はTOIは（ダイナミックセッションの場合）は、次のCIDのために使用される事前に知っていないので、それは現在のCIDのTOIのリストに含まれていないパケットをフィルタリングしてはならないことです。異なっ言った、CIDの目標は、ALCまたはNORMパケットフィルタを（このメカニズムはどのような場合でも、セキュアではないでしょう）に設定することではありません。"
    },
    {
      "indent": 3,
      "text": "The use of a CID remains OPTIONAL. If it is not used, then the clients progressively learn what files are part of the Carousel Instance by receiving ALC or NORM packets with new TOIs. However, using a CID has several benefits:",
      "ja": "CIDの使用はオプションのまま。それが使用されていない場合、クライアントは徐々に新しいTOISにALCまたはNORMパケットを受信することによって、カルーセルインスタンスの一部であるかのファイルを学びます。しかし、CIDを使用すると、いくつかの利点があります。"
    },
    {
      "indent": 3,
      "text": "o When an \"Fcast-CID-Complete\" metadata entry set to \"Fcast-CID-Complete: 1\" is included, the receivers know when they can leave the session, i.e., when they have received all the objects that are part of the last Carousel Instance of this delivery session.",
      "ja": "「Fcast-CID-完全な」メタデータエントリが「Fcast-CID-コンプリート：1」に設定した場合、Oが含まれ、受信機は、彼らはの一部であるすべてのオブジェクトを受け取ったとき、彼らは、すなわち、セッションを残すことができたときに知っていますこの配信セッションの最後のカルーセルインスタンス。"
    },
    {
      "indent": 3,
      "text": "o In the case of a session with a dynamic set of objects, the sender can reliably inform the receivers that some objects have been removed from the carousel with the CID. This solution is more robust than the Close Object \"B\" flag of ALC/LCT, since a client with intermittent connectivity might lose all the packets containing this \"B\" flag. And while NORM provides a robust object cancellation mechanism in the form of its NORM_CMD(SQUELCH) message in response to receiver NACK repair requests, the use of the CID provides an additional means for receivers to learn of objects for which it is futile to request repair.",
      "ja": "Oオブジェクトの動的セットとのセッションの場合には、送信者が確実にいくつかのオブジェクトは、CIDとカルーセルから除去されたことを受信機に通知することができます。断続的な接続を持つクライアントは、この「B」フラグを含むすべてのパケットが失われる可能性がありますので、このソリューションは、ALC / LCTの近距離物体「B」フラグよりも堅牢です。 NORMがNACK修復要求を受信機に応答して、そのNORM_CMD（SQUELCH）メッセージの形でロバストな物体キャンセル機構を提供しながら、CIDの使用は、受信機は、修理を要求する無益されたオブジェクトを学習するための追加の手段を提供します。"
    },
    {
      "indent": 3,
      "text": "o The TOI equivalence (Section 3.6) is signaled within the CID.",
      "ja": "TOI等価（セクション3.6）O CID内でシグナリングされます。"
    },
    {
      "indent": 3,
      "text": "During idle periods, when the Carousel Instance does not contain any object, a CID with an empty TOI list MAY be transmitted. In that case, a new Carousel Instance ID MUST be used to differentiate this (empty) Carousel Instance from the other ones. This mechanism can be useful to inform the receivers that:",
      "ja": "カルーセルインスタンスは、任意のオブジェクトが含まれていない場合にアイドル期間中、空のTOIリストとCIDを送信してもよいです。その場合、新しいカルーセルインスタンスIDは、他のものの中から、この（空）カルーセルインスタンスを区別するために使用されなければなりません。このメカニズムは、ことを受信機に通知することが有用であることができます。"
    },
    {
      "indent": 3,
      "text": "o all the previously sent objects have been removed from the carousel. This therefore improves the robustness of FCAST even during \"idle\" periods.",
      "ja": "Oのすべての以前に送信されたオブジェクトがカルーセルから削除されました。したがって、これはさえ「アイドル」期間中FCASTの堅牢性を向上させます。"
    },
    {
      "indent": 3,
      "text": "o the session is still active even if there is currently no content being sent. Said differently, it can be used as a heartbeat mechanism. If no \"Fcast-CID-Complete\" metadata entry is included (or if set to \"Fcast-CID-Complete: 0\"), it informs the receivers that the Carousel Instance may be modified and that new objects could be sent in the future.",
      "ja": "Oセッションが現在、コンテンツが送信されていないされている場合であってもアクティブなままです。それは、ハートビート・メカニズムとして使用することができ、違ったと述べました。 （「Fcast-CID-コンプリート：0」に設定されている場合か）は「Fcast-CID-完全な」メタデータエントリが含まれていない場合、それはカルーセルインスタンスが変更されてもよいし、その新しいオブジェクトが将来的に送ることができることを受信者に通知します。"
    },
    {
      "indent": 0,
      "text": "3.6. Compound Object Identification",
      "section_title": true,
      "ja": "3.6。複合オブジェクト識別"
    },
    {
      "indent": 3,
      "text": "The FCAST Compound Objects are directly associated with the object-based transport service that the ALC and NORM protocols provide. In each protocol, the packets containing transport object content are labeled with a numeric transport object identifier: the TOI with ALC, and the NormTransportId with NORM. For the purposes of this document, this identifier in either case (ALC or NORM) is referred to as the TOI.",
      "ja": "FCAST化合物のオブジェクトは直接ALCおよびNORMのプロトコルが提供するオブジェクトベースのトランスポート・サービスに関連しています。 ALCとTOIと、NORMとNormTransportId：各プロトコルでは、トランスポート・オブジェクトのコンテンツを含むパケットは、数値移送オブジェクト識別子で標識されます。本文書の目的のために、いずれの場合も（ALC又はNORM）でこの識別子は、TOIと呼ばれます。"
    },
    {
      "indent": 3,
      "text": "There are several differences between ALC and NORM:",
      "ja": "ALCとNORMの間にいくつかの違いがあります。"
    },
    {
      "indent": 3,
      "text": "o ALC's use of the TOI is rather flexible, since several TOI field sizes are possible (from 16 to 112 bits); since this size can be changed at any time, on a per-packet basis; and since the management of the TOI is totally free as long as each object is associated to a unique TOI (if no wraparound occurred).",
      "ja": "いくつかのTOIフィールドサイズが（16〜112ビットから）可能であるので、O TOIのALCの使用は、かなり柔軟性があります。このサイズは、パケット単位で、いつでも変更することができるからです。そして、TOIの管理は、（何のラップアラウンドが発生していない場合）、各オブジェクトはユニークなTOIに関連付けられている限り、完全に無料ですので、。"
    },
    {
      "indent": 3,
      "text": "o NORM's use of the TOI serves a more \"directive\" purpose, since the TOI field is 16 bits long and since TOIs MUST be managed sequentially.",
      "ja": "TOIフィールドは16ビット長とTOISを順次に管理しなければならないためであるので、O TOIのノルムの使用は、より多くの「指令」の目的を果たします。"
    },
    {
      "indent": 3,
      "text": "In both NORM and ALC, it is possible that the transport identification space eventually wraps for long-lived sessions (especially with NORM, where this phenomenon is expected to happen more frequently). This can possibly introduce some ambiguity in FCAST object identification if a sender retains some older objects in newer Carousel Instances with updated object sets. To avoid ambiguity, the active TOIs (i.e., the TOIs corresponding to objects being transmitted) can only occupy half of the TOI sequence space. If an old object whose TOI has fallen outside the current window needs to be transmitted again, a new TOI must be used for it. In the case of NORM, this constraint limits to 32768 the maximum number of objects that can be part of any Carousel Instance.",
      "ja": "NORMとALCの両方では、トランスポート識別空間は、最終的に（特にこの現象は、より頻繁に発生することが予想されるNORM、との）長寿命のセッションのためにラップしている可能性があります。送信者が更新されたオブジェクトのセットを持つ新しいカルーセルインスタンスにいくつかの古いオブジェクトを保持している場合これは、おそらくFCASTオブジェクトの識別にいくつかのあいまいさを導入することができます。あいまいさを避けるために、アクティブTOIS（送信されるオブジェクトに対応する、すなわち、TOISは）のみTOI配列空間の半分を占めることができます。そのTOI現在のウィンドウの外に落ちた古いオブジェクトを再度送信する必要がある場合は、新しいTOIはそれを使用する必要があります。 NORMの場合、この制約は、32768に任意カルーセルインスタンスの一部とすることができるオブジェクトの最大数を制限します。"
    },
    {
      "indent": 3,
      "text": "In order to allow receivers to properly combine the transport packets with a newly assigned TOI to those associated to the previously assigned TOI, a mechanism is required to equate the objects with the new and the old TOIs. This mechanism consists of signaling, within the CID, that the newly assigned TOI for the current Carousel Instance is equivalent to the TOI used within a previous Carousel Instance. By convention, the reference tuple for any object is the {TOI; CIID} tuple used for its first transmission within a Carousel Instance. This tuple MUST be used whenever a TOI equivalence is provided. Section 2.2 details how to describe these TOI equivalences.",
      "ja": "受信機が正常に以前に割り当てられたTOIに関連したものに新たに割り当てられたTOIとトランスポートパケットを組み合わせることができるようにするために、メカニズムは、新旧TOISを持つオブジェクトを同一視することが必要です。このメカニズムは、現在のカルーセルインスタンスの新しく割り当てられたTOIが前カルーセルインスタンス内で使用されるTOIと同等であること、CID内シグナリングから成ります。慣例により、任意のオブジェクトの参照タプル{TOIです。カルーセルインスタンス内の最初の送信のために使用CIID}タプル。 TOI等価が提供されるたびに、このタプルを使用しなければなりません。 2.2節では、これらのTOIの等価性を記述する方法について説明します。"
    },
    {
      "indent": 0,
      "text": "3.7. FCAST Sender Behavior",
      "section_title": true,
      "ja": "3.7。 FCAST送信者行動"
    },
    {
      "indent": 3,
      "text": "This section provides an informative description of expected FCAST sender behavior. The following operations can take place at a sender:",
      "ja": "このセクションでは、予想FCAST送信者行動の有益な説明を提供します。以下の操作は、送信側で行うことができます。"
    },
    {
      "indent": 3,
      "text": "1. The user (or another application) selects a set of objects (e.g., files) to deliver and submits them, along with their metadata, to the FCAST application.",
      "ja": "1.ユーザー（または他のアプリケーション）を配信するためのオブジェクト（例えば、ファイル）のセットを選択し、FCASTアプリケーションに、そのメタデータと共に、それらを提出します。"
    },
    {
      "indent": 3,
      "text": "2. For each object, FCAST creates the Compound Object and registers it in the Carousel Instance.",
      "ja": "各オブジェクトについて2. FCASTは複合オブジェクトを作成し、カルーセルインスタンスに登録します。"
    },
    {
      "indent": 3,
      "text": "3. The user then informs FCAST that all the objects of the set have been submitted. If the user knows that no new object will be submitted in the future (i.e., if the session's content is now complete), the user informs FCAST. Finally, the user specifies how many transmission cycles are desired (this number may be infinite).",
      "ja": "3.ユーザーは、セットのすべてのオブジェクトが提出されているFCASTを通知します。ユーザーは（すなわち、セッションのコンテンツは現在完了している場合）は、新しいオブジェクトは、将来的に提出されないことを知っている場合、ユーザーはFCASTを通知します。最後に、ユーザは、（この数は無限であってもよい）は、多くの送信周期が所望される方法を指定します。"
    },
    {
      "indent": 3,
      "text": "4. At this point, the FCAST application knows the full list of Compound Objects that are part of the Carousel Instance and can create a CID if desired, possibly with \"Fcast-CID-Complete: 1\" if no new objects will be sent in the future.",
      "ja": "4.この時点で、FCASTアプリケーションは、カルーセルインスタンスの一部である複合オブジェクトの完全なリストを知っているし、必要であれば、おそらく「Fcast-CID-コンプリート：1」で、CIDを作成することができる新しいオブジェクトがに送信されません場合未来。"
    },
    {
      "indent": 3,
      "text": "5. The FCAST application can now define a transmission schedule of these Compound Objects, including the optional CID. This schedule defines in which order the packets of the various Compound Objects should be sent. This document does not specify any scheme. This is left to the developer within the provisions of the underlying ALC or NORM protocol used and the knowledge of the target use-case.",
      "ja": "5. FCASTのアプリケーションは任意CIDを含む、これらの化合物のオブジェクトの送信スケジュールを定義することができます。このスケジュールは、種々の化合物のオブジェクトのパケットが送信されるべき順序は規定しています。このドキュメントは、任意のスキームを指定しません。これは、使用される基本的なALC又はNORMプロトコルとターゲットユースケースの知識の規定内の現像剤に任されています。"
    },
    {
      "indent": 3,
      "text": "6. The FCAST application then starts the carousel transmission, for the number of cycles specified. Transmissions take place until:",
      "ja": "6. FCASTアプリケーションは、指定されたサイクル数のために、カルーセル伝送を開始します。トランスミッションはまで行われます。"
    },
    {
      "indent": 7,
      "text": "* the desired number of transmission cycles has been reached, or",
      "ja": "*伝送サイクルの所望の数に達している、または"
    },
    {
      "indent": 7,
      "text": "* the user wants to prematurely stop the transmissions, or",
      "ja": "*ユーザーは、途中で送信を停止するように望んでいる、または"
    },
    {
      "indent": 7,
      "text": "* the user wants to add one or several new objects to the carousel, or on the contrary wants to remove old objects from the carousel. In that case, a new Carousel Instance must be created.",
      "ja": "*ユーザーは、カルーセル1つのまたは複数の新しいオブジェクトを追加したい、または逆にカルーセルから古いオブジェクトを削除したいです。その場合には、新しいカルーセルインスタンスを作成する必要があります。"
    },
    {
      "indent": 3,
      "text": "7. If the session is not finished, then continue at Step 1 above.",
      "section_title": true,
      "ja": "7.セッションが終了していない場合は、上記の手順1に進みます。"
    },
    {
      "indent": 0,
      "text": "3.8. FCAST Receiver Behavior",
      "section_title": true,
      "ja": "3.8。 FCASTレシーバーの動作"
    },
    {
      "indent": 3,
      "text": "This section provides an informative description of expected FCAST receiver behavior. The following operations can take place at a receiver:",
      "ja": "このセクションでは、予想FCAST受信機の動作の有益な説明を提供します。以下の操作は、受信機で行うことができます。"
    },
    {
      "indent": 3,
      "text": "1. The receiver joins the session and collects incoming packets.",
      "section_title": true,
      "ja": "1.受信機は、セッションに参加し、着信パケットを収集します。"
    },
    {
      "indent": 3,
      "text": "2. If the header portion of a Compound Object is entirely received (which may happen before receiving the entire object with some ALC/NORM configurations), or if the metadata is sent by means of another mechanism prior to the object, the receiver processes the metadata and chooses whether or not to continue to receive the object content.",
      "ja": "2.複合オブジェクトのヘッダ部分は、完全（いくつかのALC / NORM構成でオブジェクト全体を受信する前に起こる可能性がある）を受信した場合、メタデータは、オブジェクトの前に別の機構を用いて送信される場合、または、受信機が処理オブジェクトのコンテンツを受信し続けるかどうかをメタデータと選択します。"
    },
    {
      "indent": 3,
      "text": "3. When a Compound Object has been entirely received, the receiver processes the header, retrieves the object metadata, perhaps decodes the metadata, and processes the object accordingly.",
      "ja": "複合オブジェクトが完全に受信されている3、受信機は、ヘッダを処理対象のメタデータを取得し、おそらくメタデータをデコードし、それに応じてオブジェクトを処理します。"
    },
    {
      "indent": 3,
      "text": "4. When a CID is received, as indicated by the \"C\" flag set in the FCAST Header, the receiver decodes the CID and retrieves the list of objects that are part of the current Carousel Instance. This list can be used to remove objects sent in a previous Carousel Instance that might not have been totally decoded and that are no longer part of the current Carousel Instance.",
      "ja": "4. CIDが受信されると、FCASTヘッダに設定された「C」フラグによって示されるように、受信機は、CIDを復号し、現在のカルーセルインスタンスの一部であるオブジェクトのリストを取得します。このリストは完全にデコードされていないいない可能性がありますと、もはや現在のカルーセルインスタンスの一部である前のカルーセルインスタンスに送信されたオブジェクトを削除するために使用することができます。"
    },
    {
      "indent": 3,
      "text": "5. When a CID is received, the receiver also retrieves the list of TOI equivalences, if any, and takes appropriate measures, for instance, by informing the transport layer.",
      "ja": "CIDが受信されると5あれば、受信機は、TOIの等価のリストを取得し、トランスポート層に通知することにより、例えば、適切な措置をとります。"
    },
    {
      "indent": 3,
      "text": "6. When a receiver receives a CID with an \"Fcast-CID-Complete\" metadata entry set to \"Fcast-CID-Complete: 1\" and has successfully received all the objects of the current Carousel Instance, it can safely exit from the current FCAST session.",
      "ja": "そして正常電流カルーセルインスタンスのすべてのオブジェクトを受信した、それは現在から安全に終了することができる：受信機は「1 Fcast-CID-完了」に設定された「Fcast-CID-完了」メタデータエントリにCIDを受信し6 FCASTセッション。"
    },
    {
      "indent": 3,
      "text": "7. Otherwise, continue at Step 2 above.",
      "section_title": true,
      "ja": "7.それ以外の場合は、上記のステップ2に進みます。"
    },
    {
      "indent": 0,
      "text": "4. Requirements for Compliant Implementations",
      "section_title": true,
      "ja": "準拠する実装のための4要件"
    },
    {
      "indent": 3,
      "text": "This section lists the features that any compliant FCAST/ALC or FCAST/NORM implementation MUST support, and those that remain OPTIONAL, e.g., in order to enable some optimizations for a given use-case, at a receiver.",
      "ja": "このセクションでは、任意の準拠FCAST / ALC又はFCAST / NORM実装は、受信機において、所与のユースケースのためのいくつかの最適化を可能にするために、例えば、サポート、およびオプションのままであるものしなければならない機能を示します。"
    },
    {
      "indent": 0,
      "text": "4.1. Requirements Related to the Object Metadata",
      "section_title": true,
      "ja": "4.1。オブジェクトのメタデータに関する要求事項"
    },
    {
      "indent": 3,
      "text": "Metadata transmission mechanisms:",
      "ja": "メタデータの伝達機構："
    },
    {
      "indent": 3,
      "text": "+------------------+------------------------------------------------+\n| Feature          | Status                                         |\n+------------------+------------------------------------------------+\n| metadata         | An FCAST sender MUST send metadata with the    |\n| transmission     | in-band mechanism provided by FCAST, i.e.,     |\n| using FCAST's    | within the FCAST Header.  All the FCAST        |\n| in-band          | receivers MUST be able to process metadata     |\n| mechanism        | sent with this FCAST in-band mechanism.        |\n|                  |                                                |\n| metadata         | In addition to the FCAST in-band transmission  |\n| transmission     | of metadata, an FCAST sender MAY send a subset |\n| using other      | or all of the metadata using another           |\n| mechanisms       | mechanism.  Supporting this mechanism in a     |\n|                  | compliant FCAST receiver is OPTIONAL, and its  |\n|                  | use is OPTIONAL too.  An FCAST receiver MAY    |\n|                  | support this mechanism and take advantage of   |\n|                  | the metadata sent in this way.  If that is     |\n|                  | not the case, the FCAST receiver will receive  |\n|                  | and process metadata sent in-band anyway.      |\n|                  | See Appendix B.                                |\n+------------------+------------------------------------------------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Metadata format and encoding:",
      "ja": "メタデータのフォーマットとエンコーディング："
    },
    {
      "indent": 3,
      "text": "+-----------------+-------------------------------------------------+\n| Feature         | Status                                          |\n+-----------------+-------------------------------------------------+\n| Metadata Format | All FCAST implementations MUST support an       |\n| (MDFmt field)   | HTTP/1.1 metainformation format [RFC2616].      |\n|                 |                                                 |\n| Metadata        | All FCAST implementations MUST support both     |\n| Encoding (MDEnc | UTF-8 encoded text and GZIP compressed          |\n| field)          | [RFC1952] UTF-8 encoded text for the Object     |\n|                 | Metadata field.                                 |\n+-----------------+-------------------------------------------------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Metadata items (Section 3.3):",
      "ja": "メタデータ項目（3.3節）："
    },
    {
      "indent": 3,
      "text": "+-------------------------------+-----------------------------------+\n| Feature                       | Status                            |\n+-------------------------------+-----------------------------------+\n| Content-Location              | MUST be supported.                |\n|                               |                                   |\n| Content-Type                  | MUST be supported.                |\n|                               |                                   |\n| Content-Length                | MUST be supported.                |\n|                               |                                   |\n| Content-Encoding              | MUST be supported.  All FCAST     |\n|                               | implementations MUST support GZIP |\n|                               | encoding [RFC1952].               |\n|                               |                                   |\n| Fcast-Obj-Digest-SHA1         | MUST be supported.                |\n|                               |                                   |\n| Fcast-Obj-Digest-SHA256       | MUST be supported.                |\n|                               |                                   |\n| Fcast-Obj-Slice-Nb            | MUST be supported.                |\n|                               |                                   |\n| Fcast-Obj-Slice-Idx           | MUST be supported.                |\n|                               |                                   |\n| Fcast-Obj-Slice-Offset        | MUST be supported.                |\n+-------------------------------+-----------------------------------+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "4.2. Requirements Related to the Carousel Instance Descriptor",
      "section_title": true,
      "ja": "4.2。カルーセルインスタンス記述に関する要求事項"
    },
    {
      "indent": 3,
      "text": "Any compliant FCAST implementation MUST support the CID mechanism, in order to list the Compound Objects that are part of a given Carousel Instance. However, its use is OPTIONAL.",
      "ja": "どれに準拠しFCASTの実装では、与えられたカルーセルインスタンスの一部である複合オブジェクトを一覧表示するためには、CIDメカニズムをサポートしなければなりません。しかし、その使用は任意です。"
    },
    {
      "indent": 3,
      "text": "CID-specific Metadata items (Section 2.2):",
      "ja": "CID固有のメタデータ項目（2.2節）："
    },
    {
      "indent": 17,
      "text": "+--------------------+--------------------+\n| Feature            | Status             |\n+--------------------+--------------------+\n| Fcast-CID-Complete | MUST be supported. |\n| Fcast-CID-ID       | MUST be supported. |\n+--------------------+--------------------+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 0,
      "text": "5.1. Problem Statement",
      "section_title": true,
      "ja": "5.1。問題文"
    },
    {
      "indent": 3,
      "text": "A content delivery system may be subject to attacks that target:",
      "ja": "コンテンツ配信システムは、ターゲットの攻撃を受ける可能性があります。"
    },
    {
      "indent": 3,
      "text": "o the network, to compromise the delivery infrastructure (e.g., by creating congestion),",
      "ja": "ネットワークO、（例えば、渋滞を作成することによって）配信インフラストラクチャを妥協します"
    },
    {
      "indent": 3,
      "text": "o the Content Delivery Protocol (CDP), to compromise the delivery mechanism (i.e., FCAST in this case), or",
      "ja": "送達機構（この場合、すなわち、FCAST）を侵害するコンテンツ配信プロトコル（CDP）、O、または"
    },
    {
      "indent": 3,
      "text": "o the content itself, to corrupt the objects being transmitted.",
      "ja": "コンテンツ自体O、破損にオブジェクトが送信されます。"
    },
    {
      "indent": 3,
      "text": "These attacks can be launched against all or any subset of the following:",
      "ja": "これらの攻撃は、すべて、または以下のいずれかのサブセットに対して起動することができます。"
    },
    {
      "indent": 3,
      "text": "o the data flow itself (e.g., by sending forged packets),",
      "ja": "データフロー自体O（例えば、偽造パケットを送信することによって）、"
    },
    {
      "indent": 3,
      "text": "o the session control parameters sent either in-band or out-of-band (e.g., by corrupting the session description, the CID, the object metadata, or the ALC/LCT control parameters), or",
      "ja": "Oセッション制御パラメータは、帯域内または帯域外（例えば、セッション記述を破壊することにより、CID、オブジェクトのメタデータ、またはALC / LCT制御パラメータ）、またはいずれかの送信します"
    },
    {
      "indent": 3,
      "text": "o some associated building blocks (e.g., the congestion control component).",
      "ja": "いくつかの関連するビルディングブロック（例えば、輻輳制御成分）O。"
    },
    {
      "indent": 3,
      "text": "More details on these possible attacks are provided in the following sections, along with possible countermeasures. Recommendations are made in Section 5.5.",
      "ja": "これらの攻撃の可能性についての詳細は、可能な対策とともに、次のセクションで提供されています。勧告は、5.5節で作られています。"
    },
    {
      "indent": 0,
      "text": "5.2. Attacks against the Data Flow",
      "section_title": true,
      "ja": "5.2。データフローに対する攻撃"
    },
    {
      "indent": 3,
      "text": "The following types of attacks against the data flow exist:",
      "ja": "データフローに対する攻撃には、次の種類が存在します。"
    },
    {
      "indent": 3,
      "text": "o attacks that are meant to gain unauthorized access to a confidential object (e.g., obtaining non-free content without purchasing it) and",
      "ja": "O機密オブジェクトへの不正アクセスを得ることを意味している攻撃は（例えば、それを購入しなくても非フリーコンテンツを取得）し、"
    },
    {
      "indent": 3,
      "text": "o attacks that try to corrupt the object being transmitted (e.g., to inject malicious code within an object, or to prevent a receiver from using an object; this would be a denial-of-service (DoS) attack).",
      "ja": "破損へのオブジェクトを試みるO攻撃が送信される（例えば、オブジェクト内の悪意のあるコードを注入する、またはオブジェクトを使用してから受信することを防止するために、これはサービス拒否（DoS）攻撃をすることになります）。"
    },
    {
      "indent": 0,
      "text": "5.2.1. Attacks Meant to Gain Access to Confidential Objects",
      "section_title": true,
      "ja": "5.2.1。攻撃は、機密オブジェクトへのアクセスを得るためのもの"
    },
    {
      "indent": 3,
      "text": "Modern cryptographic mechanisms can provide access control to transmitted objects. One way to do this is by encrypting the entire object prior to transmission, knowing that authenticated receivers have the cryptographic mechanisms to decrypt the content. Another way is to encrypt individual packets using IPsec/ESP [RFC4303] (see also Section 5.5). These two techniques can also provide confidentiality to the objects being transferred.",
      "ja": "現代の暗号化機構は、送信オブジェクトへのアクセス制御を提供することができます。これを行う方法の1つは、認証された受信機は、コンテンツを復号するための暗号化メカニズムを持っていることを知って、送信前に、オブジェクト全体を暗号化することです。もう一つの方法は、（また、5.5節を参照）のIPsec / ESP [RFC4303]を使用して、個々のパケットを暗号化することです。これら二つの技術はまた、転送されているオブジェクトに機密性を提供することができます。"
    },
    {
      "indent": 3,
      "text": "If access control and/or confidentiality services are desired, one of these mechanisms is RECOMMENDED and SHOULD be deployed.",
      "ja": "アクセス制御および/または機密性サービスが望まれている場合は、これらのメカニズムの一つが推奨されており、展開する必要があります。"
    },
    {
      "indent": 0,
      "text": "5.2.2. Attacks Meant to Corrupt Objects",
      "section_title": true,
      "ja": "5.2.2。破損オブジェクトを意図した攻撃"
    },
    {
      "indent": 3,
      "text": "Protection against attacks on the data integrity of the object may be achieved by a mechanism agreed upon between the sender and receiver that features sender authentication and a method to verify that the object integrity has remained intact during transmission. This service can be provided at the object level, but in that case a receiver has no way to identify what symbols are corrupted if the object is detected as corrupted. This service can also be provided at the packet level. In some cases, after removing all corrupted packets, the object may be recovered. Several techniques can provide data integrity and sender authentication services:",
      "ja": "オブジェクトのデータの整合性への攻撃に対する防御は、送信者認証とオブジェクトの完全性は、送信中にそのまま残っていることを確認する方法を特徴とする送信側と受信側との間で合意した機構によって達成することができます。このサービスは、オブジェクト・レベルで提供することができるが、その場合には受信機が破損したように、オブジェクトが検出された場合のシンボルが破損しているかを識別する方法がありません。また、このサービスは、パケットレベルで提供することができます。いくつかのケースでは、すべての破損したパケットを削除した後、オブジェクトが回収することができます。いくつかの技術は、データの整合性と送信者認証サービスを提供することができます。"
    },
    {
      "indent": 3,
      "text": "o At the object level, the object can be digitally signed, for instance, by using RSASSA-PKCS1-v1_5 [RFC3447]. This signature enables a receiver to check the object integrity. Even if digital signatures are computationally expensive, this calculation occurs only once per object, which is usually acceptable.",
      "ja": "オブジェクトレベルでO、オブジェクトがデジタルRSASSA-PKCS1-v1_5の[RFC3447]を使用することにより、例えば、署名することができます。このシグネチャは、オブジェクトの整合性をチェックするための受信機を可能にします。デジタル署名が計算上高価であっても、この計算は通常許容され、唯一のオブジェクトごとに1回発生します。"
    },
    {
      "indent": 3,
      "text": "o At the packet level, each packet can be digitally signed [RFC6584]. A major limitation is the high computational and transmission overheads that this solution requires.",
      "ja": "Oパケットレベルでは、各パケットは、デジタル[RFC6584]を署名することができます。主な制限は、このソリューションが必要で高い計算および伝送オーバーヘッドです。"
    },
    {
      "indent": 3,
      "text": "o At the packet level, a Group-keyed Message Authentication Code (MAC) [RFC2104] [RFC6584] scheme can be used, for instance, by using HMAC-SHA-256 with a secret key shared by all the group members, senders, and receivers. This technique creates a cryptographically secured digest of a packet that is sent along with the packet itself. The Group-keyed MAC scheme does not create prohibitive processing loads or transmission overhead, but it has a major limitation: it only provides a group authentication/integrity service, since all group members share the same secret group key; this means that each member can send a forged packet. It is therefore restricted to situations where group members are fully trusted, or in association with another technique as a preliminary check to quickly detect attacks initiated by non-group members and to discard their packets.",
      "ja": "パケット・レベル、グループキー付きメッセージ認証コード（MAC）[RFC2104]、[RFC6584]スキームは、すべてのグループメンバーによって共有された秘密鍵を用いてHMAC-SHA-256を使用することにより、例えば、使用することができ、送信者、のo-そして受信機。この技術は、パケット自体とともに送信されるパケットの暗号で保護されたダイジェストを作成します。グループキーMAC方式は、法外な処理負荷や伝送のオーバーヘッドを作成しませんが、それは大きな制限があります。それが唯一のグループ認証/完全性サービスを提供し、すべてのグループメンバーが同じ秘密のグループ鍵を共有しているため、これは、各メンバーが偽造パケットを送信できることを意味します。したがって、グループメンバーが完全に信頼、またはすぐに非グループメンバーによって開始された攻撃を検出すると、そのパケットを破棄するように予備検査として、他の技術と関連している状況に制限されています。"
    },
    {
      "indent": 3,
      "text": "o At the packet level, Timed Efficient Stream Loss-Tolerant Authentication (TESLA) [RFC4082] [RFC5776] is an attractive solution that is robust to losses, provides an authentication and integrity verification service, and does not create any prohibitive processing load or transmission overhead. Yet, a delay is incurred in checking a TESLA authenticated packet; this delay may be more than what is desired in some use-cases.",
      "ja": "パケットレベルで、タイミングの効率的なストリーム損失トレラント認証（テスラ）O [RFC4082]、[RFC5776]は、損失に対してロバストである魅力的な解決策である認証および完全性検証サービスを提供し、任意の法外な処理負荷や送信を作成しませんオーバーヘッド。しかし、遅延がTESLA認証されたパケットをチェックして発生しています。この遅延は、いくつかのユースケースで望まれているものより以上であってもよいです。"
    },
    {
      "indent": 3,
      "text": "o At the packet level, IPsec/ESP [RFC4303] can be used to check the integrity and authenticate the sender of all the packets being exchanged in a session (see Section 5.5).",
      "ja": "Oパケットレベルでは、IPsecの/ ESP [RFC4303]は整合性をチェックして、セッション内で交換されるすべてのパケットの送信者を認証するために使用することができます（5.5節を参照してください）。"
    },
    {
      "indent": 3,
      "text": "Techniques relying on public key cryptography (digital signatures and TESLA during the bootstrap process, when used) require that public keys be securely associated to the entities. This can be achieved via a Public Key Infrastructure (PKI), a Pretty Good Privacy (PGP) Web of Trust, or by securely preplacing the public keys of each group member.",
      "ja": "（使用されるブートストラッププロセス中にデジタル署名およびテスラ）、公開鍵暗号方式に依存する技術は、公開鍵が確実エンティティに関連付けられることを必要とします。これは、公開鍵インフラストラクチャ（PKI）、信託のプリティグッドプライバシー（PGP）Web経由、またはしっかりと各グループメンバーの公開鍵をpreplacingすることによって達成することができます。"
    },
    {
      "indent": 3,
      "text": "Techniques relying on symmetric key cryptography (Group-keyed MAC) require that a secret key be shared by all group members. This can be achieved by means of a group key management protocol or simply by securely preplacing the secret key (but this manual solution has many limitations).",
      "ja": "対称鍵暗号（グループキー付きMAC）に依存する技術は、秘密鍵は、すべてのグループメンバーで共有することが必要。これは、グループ鍵管理プロトコルによって、または単に安全に秘密鍵をpreplacingすることによって達成することができる（ただし、このマニュアル溶液は多くの制限を有しています）。"
    },
    {
      "indent": 3,
      "text": "It is up to the developer and deployer, who know the security requirements and features of the target application area, to define which solution is the most appropriate. In any case, whenever there is a threat of object corruption, it is RECOMMENDED that at least one of these techniques be used. Section 5.5 defines minimum security recommendations that can be used to provide such services.",
      "ja": "これは、最も適切なソリューションを定義するには、対象のアプリケーション領域のセキュリティ要件と機能を知っている開発者やデプロイヤ、次第です。オブジェクトの破損の恐れがあるときはいつでもどのような場合に、これらの技術のうちの少なくとも一つを使用することを推奨されています。 5.5節では、このようなサービスを提供するために使用することができる最低限のセキュリティ勧告を定義します。"
    },
    {
      "indent": 0,
      "text": "5.3. Attacks against the Session Control Parameters and Associated Building Blocks",
      "ja": "5.3。セッション制御パラメータと関連するビルディングブロックに対する攻撃"
    },
    {
      "indent": 3,
      "text": "Let us now consider attacks against the session control parameters and the associated building blocks. The attacker can target, among other things, the following:",
      "ja": "私たちは今、セッション制御パラメータと関連するビルディングブロックに対する攻撃を考えてみましょう。攻撃者は、とりわけ、以下をターゲットにすることができます："
    },
    {
      "indent": 3,
      "text": "o the session description,",
      "ja": "Oセッション記述、"
    },
    {
      "indent": 3,
      "text": "o the FCAST CID,",
      "ja": "O FCASTのCID、"
    },
    {
      "indent": 3,
      "text": "o the metadata of an object, o the ALC/LCT parameters, carried within the LCT header, or",
      "ja": "LCTヘッダの中で運ばALC / LCTパラメータ、O、オブジェクトのメタデータO、又は"
    },
    {
      "indent": 3,
      "text": "o the FCAST associated building blocks, for instance, the multiple rate congestion control protocol.",
      "ja": "FCAST関連するビルディングブロックOは、例えば、複数のレート混雑制御プロトコル。"
    },
    {
      "indent": 3,
      "text": "The consequences of these attacks are potentially serious, since they can compromise the behavior of the content delivery system or even compromise the network itself.",
      "ja": "彼らは、コンテンツ配信システムの動作を損なう、あるいはネットワーク自体を危うくすることができますので、これらの攻撃の結果は、潜在的に深刻です。"
    },
    {
      "indent": 0,
      "text": "5.3.1. Attacks against the Session Description",
      "section_title": true,
      "ja": "5.3.1。セッション記述に対する攻撃"
    },
    {
      "indent": 3,
      "text": "An FCAST receiver may potentially obtain an incorrect session description for the session. The consequence is that legitimate receivers with the wrong session description will be unable to correctly receive the session content or will inadvertently try to receive at a much higher rate than they are capable of, thereby possibly disrupting other traffic in the network.",
      "ja": "FCAST受信機は、潜在的にセッションのために間違ったセッション記述を取得してもよいです。その結果は、間違ったセッション記述を持つ、正当な受信機が正しくセッションコンテンツを受信することはできませんか、彼らがすることができるよりも、うっかりそれによって、おそらくネットワーク内の他のトラフィックを中断、はるかに高いレートで受信しようとするということです。"
    },
    {
      "indent": 3,
      "text": "To avoid these problems, it is RECOMMENDED that measures be taken to prevent receivers from accepting incorrect session descriptions. One such measure is sender authentication to ensure that receivers only accept legitimate session descriptions from authorized senders. How these measures are achieved is outside the scope of this document, since this session description is usually carried out-of-band.",
      "ja": "これらの問題を回避するために、対策が間違ったセッション記述を受け入れるのレシーバを防ぐために取られることが推奨されます。そのような措置は、受信機が唯一認可された送信者からの正当なセッション記述を受け入れることを確認するために、送信者認証です。これらの対策が達成されているどのようにこのセッション記述は通常、アウト・オブ・バンド行われるため、このドキュメントの範囲外です。"
    },
    {
      "indent": 0,
      "text": "5.3.2. Attacks against the FCAST CID",
      "section_title": true,
      "ja": "5.3.2。 FCAST CIDに対する攻撃"
    },
    {
      "indent": 3,
      "text": "Corrupting the FCAST CID is one way to create a DoS attack. For example, the attacker can insert an \"Fcast-CID-Complete: 1\" metadata entry to make the receivers believe that no further modification will be done.",
      "ja": "FCASTのCIDを破壊することで、DoS攻撃を作成するための一つの方法です。受信機はそれ以上の変更は行われないことを信じさせるためにメタデータエントリ：たとえば、攻撃者が「1 Fcast-CID-コンプリート」を挿入することができます。"
    },
    {
      "indent": 3,
      "text": "It is therefore RECOMMENDED that measures be taken to guarantee the integrity and to check the sender's identity of the CID. To that purpose, one of the countermeasures mentioned above (Section 5.2.2) SHOULD be used. These measures will either be applied at the packet level or globally over the whole CID object. When there is no packet-level integrity verification scheme, it is RECOMMENDED to digitally sign the CID.",
      "ja": "したがって、対策は整合性を保証し、CIDの送信者の身元を確認するために取られることが推奨されます。そのために、（セクション5.2.2）上記の対策の一つが使用されるべきです。これらの措置は、いずれかのパケット・レベルまたはグローバル全体CIDオブジェクトの上に適用されます。何のパケットレベルの整合性の検証スキームが存在しない場合は、デジタルCIDに署名することをお勧めします。"
    },
    {
      "indent": 0,
      "text": "5.3.3. Attacks against the Object Metadata",
      "section_title": true,
      "ja": "5.3.3。オブジェクトメタデータに対する攻撃"
    },
    {
      "indent": 3,
      "text": "Modifying the object metadata is another way to launch an attack. For example, the attacker may change the message digest associated to an object, leading a receiver to reject an object even if it has been correctly received. More generally, a receiver SHOULD be very careful during metadata processing. For instance, a receiver SHOULD NOT try to follow links (e.g., the URI contained in the",
      "ja": "オブジェクトのメタデータを変更すると、攻撃を開始する別の方法です。例えば、攻撃者は、それが正しく受信された場合でも、オブジェクトを除去する受信機をリードし、オブジェクトに関連付けられたメッセージダイジェストを変更することができます。より一般的には、受信機は、メタデータの処理中に非常に注意しなければなりません。例えば、受信機は、（例えば、URIはに含まれているリンクをたどるしようとすべきではありません"
    },
    {
      "indent": 3,
      "text": "Content-Location metadata). As another example, malformed HTTP content can be used as an attack vector, and a receiver should take great care with such content.",
      "ja": "コンテンツの場所のメタデータ）。別の例として、不正なHTTPコンテンツは、攻撃ベクトルとして使用することができ、受信機は、そのようなコンテンツに細心の注意を払うべきです。"
    },
    {
      "indent": 3,
      "text": "It is therefore RECOMMENDED that measures be taken to guarantee the integrity and to check the identity of the sender of the Compound Object. To that purpose, one of the countermeasures mentioned above (Section 5.2.2) SHOULD be used. These measures will either be applied at the packet level or globally over the whole Compound Object. When there is no packet-level integrity verification scheme, it is RECOMMENDED to digitally sign the Compound Object.",
      "ja": "したがって、対策は整合性を保証するために、化合物のオブジェクトの送信者の身元を確認するために取られることが推奨されます。そのために、（セクション5.2.2）上記の対策の一つが使用されるべきです。これらの措置は、いずれかのパケット・レベルまたはグローバル全体の複合オブジェクトの上に適用されます。何のパケットレベルの整合性の検証スキームが存在しない場合は、デジタル複合オブジェクトに署名することをお勧めします。"
    },
    {
      "indent": 0,
      "text": "5.3.4. Attacks against the ALC/LCT and NORM Parameters",
      "section_title": true,
      "ja": "5.3.4。 ALC / LCTとNORMパラメータに対する攻撃"
    },
    {
      "indent": 3,
      "text": "By corrupting the ALC/LCT header (or header extensions), one can execute attacks on the underlying ALC/LCT implementation. For example, sending forged ALC packets with the Close Session \"A\" flag set to 1 can lead the receiver to prematurely close the session. Similarly, sending forged ALC packets with the Close Object \"B\" flag set to 1 can lead the receiver to prematurely give up the reception of an object. The same comments can be made for NORM.",
      "ja": "ALC / LCTヘッダ（またはヘッダの拡張）を破壊することによって、人は、基礎となるALC / LCT実装への攻撃を実行することができます。例えば、閉じるセッション1にセット「」フラグを持つ偽造ALCパケットが途中でセッションを終了するために受信機を導くことができる送ります。同様に、1に設定さ近距離物体「B」フラグと偽造ALCパケットを送信することは時期尚早オブジェクトの受信を放棄する受信機を導くことができます。同じコメントがNORMのために行うことができます。"
    },
    {
      "indent": 3,
      "text": "It is therefore RECOMMENDED that measures be taken to guarantee the integrity and to check the sender's identity in each ALC or NORM packet received. To that purpose, one of the countermeasures mentioned above (Section 5.2.2) SHOULD be used.",
      "ja": "したがって、対策が整合性を保証するために、各ALCまたは受信NORMパケット内の送信者の身元を確認するために取られることが推奨されます。そのために、（セクション5.2.2）上記の対策の一つが使用されるべきです。"
    },
    {
      "indent": 0,
      "text": "5.3.5. Attacks against the Associated Building Blocks",
      "section_title": true,
      "ja": "5.3.5。関連するビルディングブロックに対する攻撃"
    },
    {
      "indent": 3,
      "text": "Let us first focus on the congestion control building block that may be used in an ALC or NORM session. A receiver with an incorrect or corrupted implementation of the multiple rate congestion control building block may affect the health of the network in the path between the sender and the receiver and may also affect the reception rates of other receivers who joined the session.",
      "ja": "私たちは最初のALCまたはNORMセッションで使用することができる輻輳制御ビルディングブロックに焦点を当ててみましょう。複数のレート混雑制御ビルディングブロックの不正確または破損実装と受信機は、送信側と受信側の間のパスにネットワークの健康に影響を与えることができ、またセッションに参加した他の受信機の受信率に影響を与える可能性があります。"
    },
    {
      "indent": 3,
      "text": "When congestion control is applied with FCAST, it is therefore RECOMMENDED that receivers be authenticated as legitimate receivers before they can join the session. If authenticating a receiver does not prevent that receiver from launching an attack, the network operator will still be able to easily identify the receiver that launched the attack and take countermeasures. The details of how this is done are outside the scope of this document.",
      "ja": "輻輳制御がFCASTに適用されると、それゆえ、彼らがセッションに参加することができます前に、受信機は、正当な受信機として認証することが推奨されます。受信機を認証すると、攻撃を開始からの受信を防止していない場合は、ネットワークオペレータは、まだ簡単に攻撃を開始した受信機を特定し、対策を取ることができるようになります。これがどのように行われるかの詳細は、このドキュメントの範囲外です。"
    },
    {
      "indent": 3,
      "text": "When congestion control is applied with FCAST, it is also RECOMMENDED that a packet-level authentication scheme be used, as explained in Section 5.2.2. Some of them, like TESLA, only provide a delayed authentication service, whereas congestion control requires a rapid reaction. It is therefore RECOMMENDED [RFC5775] that a receiver using TESLA quickly reduce its subscription level when the receiver believes that congestion did occur, even if the packet has not yet been authenticated. Therefore, TESLA will not prevent DoS attacks where an attacker makes the receiver believe that congestion occurred. This is an issue for the receiver, but this will not compromise the network. Other authentication methods that do not feature this delayed authentication might be preferable, or a Group-keyed MAC scheme could be used in parallel with TESLA to prevent attacks launched from outside of the group.",
      "ja": "輻輳制御をFCASTが印加されると、セクション5.2.2で説明したように、また、パケットレベルの認証スキームを使用することを推奨されています。輻輳制御は、迅速な反応を必要とするのに対し、それらのいくつかは、TESLAのように、唯一、遅れた認証サービスを提供しています。したがって、受信機は、パケットがまだ認証されていない場合でも、輻輳が発生しなかったことを考えていたときにTESLAを使用して、受信機が急速にそのサブスクリプションレベルを下げること[RFC5775]を推奨されます。したがって、TESLAは、攻撃者は、受信機が輻輳が発生したことを信じていますDoS攻撃を防ぐことはできません。これは、受信機のための問題ですが、これはネットワークを侵害しません。この遅れの認証を備えていない他の認証方法が好ましいかもしれない、またはグループキー付きMAC方式は、グループ外からの打ち上げ攻撃を防ぐためにTESLAと並行して使用することができます。"
    },
    {
      "indent": 0,
      "text": "5.4. Other Security Considerations",
      "section_title": true,
      "ja": "5.4。その他のセキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "Lastly, we note that the security considerations that apply to, and are described in, ALC [RFC5775], LCT [RFC5651], NORM [RFC5740], and FEC [RFC5052] also apply to FCAST, as FCAST builds on those specifications. In addition, any security considerations that apply to any congestion control building block used in conjunction with FCAST also apply to FCAST. Finally, the security discussion of [RMT-SEC] also applies here.",
      "ja": "FCASTは、これらの仕様に基づいて構築として最後に、我々が適用され、セキュリティ上の考慮事項がに記載されていることに注意して、ALC [RFC5775]、LCT [RFC5651]、NORM [RFC5740]、およびFEC [RFC5052]も、FCASTに適用されます。また、FCASTと組み合わせて使用​​されるすべての輻輳制御ビルディングブロックに適用されるセキュリティ上の配慮もFCASTに適用されます。最後に、[RMT-SEC]のセキュリティ議論もここに適用されます。"
    },
    {
      "indent": 0,
      "text": "5.5. Minimum Security Recommendations",
      "section_title": true,
      "ja": "5.5。最小のセキュリティに関する推奨事項"
    },
    {
      "indent": 3,
      "text": "We now introduce a security configuration that is mandatory to implement but not necessarily mandatory to use, in the sense of [RFC3365]. Since FCAST/ALC relies on ALC/LCT, it inherits the \"baseline secure ALC operation\" of [RFC5775]. Similarly, since FCAST/NORM relies on NORM, it inherits the \"baseline secure NORM operation\" of [RFC5740]. Therefore, IPsec/ESP in transport mode MUST be implemented, but not necessarily used, in accordance with [RFC5775] and [RFC5740]. [RFC4303] explains that ESP can be used to potentially provide confidentiality, data origin authentication, content integrity, anti-replay, and (limited) traffic flow confidentiality. [RFC5775] specifies that the data origin authentication, content integrity, and anti-replay services SHALL be used, and that the confidentiality service is RECOMMENDED. If a short-lived session MAY rely on manual keying, it is also RECOMMENDED that an automated key management scheme be used, especially in the case of long-lived sessions.",
      "ja": "私たちは今、[RFC3365]の意味で、使用することは必ずしも必須で実装するためには必須ではなく、セキュリティ設定を紹介します。 FCAST / ALCのALC / LCTに依存しているので、[RFC5775]の \"ベースラインセキュアALC動作を\" 継承します。 FCAST / NORMはNORMに依存しているので、同様に、それは[RFC5740]の「ベースラインセキュアNORM演算」を継承します。したがって、トランスポート・モードのIPsec / ESPを実装する必要があり、必ずしも[RFC5775]及び[RFC5740]に従って、使用されません。 [RFC4303]はESPが潜在的に機密性、データ発信元認証、コンテンツの完全性、抗リプレイ、および（限定）トラフィックフローの機密性を提供するために使用することができると説明しています。 [RFC5775]は、データ発信元認証、コンテンツの完全性、およびアンチリプレイサービスを使用しなければならないことを指定し、機密性サービスが推奨されていること。短命セッションは、手動キー入力に依存している可能性がある場合、また、自動化された鍵管理スキームが特に長寿命のセッションの場合には、使用することをお勧めします。"
    },
    {
      "indent": 3,
      "text": "Therefore, the RECOMMENDED solution for FCAST provides per-packet security, with data origin authentication, integrity verification, and anti-replay. This is sufficient to prevent most of the in-band attacks listed above. If confidentiality is required, a per-packet encryption SHOULD also be used.",
      "ja": "したがって、FCASTのための推奨されるソリューションは、データ発信元認証、整合性の検証、およびアンチリプレイで、パケットごとのセキュリティを提供します。これは、上記のインバンドの攻撃のほとんどを防止するのに十分です。機密性が必要な場合は、パケット単位の暗号化も使用されるべきです。"
    },
    {
      "indent": 0,
      "text": "6. Operational Considerations",
      "section_title": true,
      "ja": "6.運用の考慮事項"
    },
    {
      "indent": 3,
      "text": "FCAST is compatible with any congestion control protocol designed for ALC/LCT or NORM. However, depending on the use-case, the data flow generated by the FCAST application might not be constant but might instead be bursty in nature. Similarly, depending on the use-case, an FCAST session might be very short. Whether and how this will impact the congestion control protocol is out of the scope of the present document.",
      "ja": "FCASTはALC / LCTまたはNORMのために設計された任意の輻輳制御プロトコルと互換性があります。しかし、ユースケースに応じて、FCASTアプリケーションによって生成されたデータフローは、一定ではないかもしれませんが、代わりに自然の中でバースト的かもしれません。同様に、ユースケースに応じて、FCASTセッションは非常に短いかもしれません。そしてどのようにこれが輻輳制御プロトコルに影響を与えるかどうかは、本文書の範囲外です。"
    },
    {
      "indent": 3,
      "text": "FCAST is compatible with any security mechanism designed for ALC/LCT or NORM. The use of a security scheme is strongly RECOMMENDED (see Section 5).",
      "ja": "FCASTはALC / LCTまたはNORMのために設計されたすべてのセキュリティ・メカニズムと互換性があります。セキュリティ方式の使用を強く（第5節を参照）の使用を推奨します。"
    },
    {
      "indent": 3,
      "text": "FCAST is compatible with any FEC scheme designed for ALC/LCT or NORM. Whether FEC is used or not, and the kind of FEC scheme used, are to some extent transparent to FCAST.",
      "ja": "FCASTはALC / LCTまたはNORMのために設計された任意のFECスキームと互換性があります。 FECが使用されるか、またはない、とFECスキームの種類が使用されているかどうかは、ある程度FCASTに対して透過的です。"
    },
    {
      "indent": 3,
      "text": "FCAST is compatible with both IPv4 and IPv6. Nothing in the FCAST specification has any implication on the source or destination IP address type.",
      "ja": "FCASTは、IPv4とIPv6の両方に対応しています。 FCAST仕様では何も送信元または宛先IPアドレスの種類のいずれかの意味合いを持っていません。"
    },
    {
      "indent": 3,
      "text": "The delivery service provided by FCAST might be fully reliable, or only partially reliable, depending upon:",
      "ja": "FCASTが提供する配信サービスが依存して、完全に信頼性の高い、または部分的にしか信頼できるかもしれません。"
    },
    {
      "indent": 3,
      "text": "o the way ALC or NORM is used (e.g., whether FEC encoding and/or NACK-based repair requests are used or not),",
      "ja": "ALC又はNORMが使用されている方法O（例えば、FEC符号化および/またはNACKベースの修復要求が使用されているかどうか）、"
    },
    {
      "indent": 3,
      "text": "o the way the FCAST carousel is used (e.g., whether the objects are made available for a long time span or not), and",
      "ja": "FCASTカルーセルが使用されている方法O（例えば、オブジェクトは、長い期間のためにか利用可能にされるかどうか）、および"
    },
    {
      "indent": 3,
      "text": "o the way in which FCAST itself is deployed (e.g., whether there is a session control application that might automatically extend an existing FCAST session until all receivers have received the transmitted content).",
      "ja": "自体をFCASTする方法O（例えば、すべての受信機が送信されたコンテンツを受信するまで、自動的に既存のFCASTセッションを延長するかもしれないセッション制御アプリケーションが存在するか否か）に配備されています。"
    },
    {
      "indent": 3,
      "text": "The receiver set can be restricted to a single receiver or possibly a very large number of receivers. While the choice of the underlying transport protocol (i.e., ALC or NORM) and its parameters may limit the practical receiver group size, nothing in FCAST itself limits it. For instance, if FCAST/ALC is used on top of purely unidirectional transport channels with no feedback information at all, which is the default mode of operation, then scalability is at a maximum, since neither FCAST, ALC, UDP, nor IP generates any feedback message. On the contrary, the scalability of FCAST/NORM is typically limited by the scalability of NORM itself. For example, NORM can be configured to operate using proactive FEC without feedback, similar to ALC, with receivers configured to provide NACK and, optionally, ACK feedback, or a hybrid combination of these. Similarly, if FCAST is used along with a session control application that collects reception information from the receivers, then this session control application may limit the scalability of the global object delivery system. This situation can of course be mitigated by using a hierarchy of servers or feedback message aggregation. The details of this are out of the scope of the present document.",
      "ja": "受信機セットは、単一の受信またはおそらく受信機の非常に大きな数に制限することができます。基礎となるトランスポートプロトコル（すなわち、ALC又はNORM）およびそのパラメータの選択は、実用的な受信機のグループのサイズを制限することができるが、FCAST自体には何もそれを制限しません。 FCAST / ALCは、デフォルトの動作モードがあるまったくのフィードバック情報、と純粋に一方向のトランスポート・チャネルの上で使用されている場合たとえば、その後、スケーラビリティはどちらFCAST以来、ALCは、UDP、またIPは、いずれかを生成し、最大でありますフィードバックメッセージ。逆に、FCAST / NORMのスケーラビリティは、典型的には、NORM自体のスケーラビリティによって制限されます。例えば、NORMは、NACKと、必要に応じて、ACKフィードバック、またはこれらのハイブリッドの組み合わせを提供するように構成された受信機と、ALCと同様、フィードバックなしプロアクティブFECを使用して動作するように構成することができます。 FCASTは、受信機からの受信情報を収集セッション制御アプリケーションと共に使用される場合、同様に、このセッション制御アプリケーションは、グローバル・オブジェクト配信システムのスケーラビリティを制限することができます。この状況はもちろん、サーバーまたはフィードバックメッセージ集約の階層を使用することによって緩和することができます。これの詳細は、本書の範囲外です。"
    },
    {
      "indent": 3,
      "text": "The content of a Carousel Instance MAY be described by means of an OPTIONAL CID (Section 3.5). The decision of whether the CID mechanism should be used or not is left to the sender. When it is used, the question of how often and when a CID should be sent is also left to the sender. These considerations depend on many parameters, including the target use-case and the session dynamics. For instance, it may be appropriate to send a CID at the beginning of each new Carousel Instance and then periodically. These operational aspects are out of the scope of the present document.",
      "ja": "カルーセルインスタンスの内容は、任意のCID（3.5節）によって説明することができます。 CIDのメカニズムを使用するかどうかの判断は、送信者に任されています。それを使用する場合、どのくらいの頻度およびCIDが送られるべきときの質問にも、送信者に委ねられています。これらの考慮事項は、ターゲット・ユースケースとセッションダイナミクスを含む多くのパラメータに依存しています。例えば、定期的に、各新しいカルーセルインスタンスの先頭にCIDを送るとすることが適切であろう。これらの運用面では、本書の範囲外です。"
    },
    {
      "indent": 0,
      "text": "7. IANA Considerations",
      "section_title": true,
      "ja": "7. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "Per this specification, IANA has created three new registries.",
      "ja": "この仕様に従って、IANA 3つの新しいレジストリを作成しました。"
    },
    {
      "indent": 0,
      "text": "7.1. Creation of the FCAST Object Metadata Format Registry",
      "section_title": true,
      "ja": "7.1。 FCASTオブジェクトのメタデータ形式レジストリの作成"
    },
    {
      "indent": 3,
      "text": "IANA has created a new registry, \"FCAST Object Metadata Format\" (MDFmt), with a reference to this document. The registry entries consist of a numeric value from 0 to 15, inclusive (i.e., they are 4-bit positive integers), that defines the format of the object metadata (see Section 2.1).",
      "ja": "IANAはこのドキュメントを参照して、新しいレジストリ、「FCASTオブジェクトメタデータフォーマット」（MDFmt）を作成しました。レジストリエントリは、オブジェクトのメタデータ（セクション2.1を参照）の形式を定義する包括0から15までの数値（すなわち、それらは4ビットの正の整数である）、から成ります。"
    },
    {
      "indent": 3,
      "text": "The initial value for this registry is defined below. Future assignments are to be made through Expert Review with Specification Required [RFC5226].",
      "ja": "このレジストリの初期値は以下に定義されます。今後の割り当ては、仕様が必要である[RFC5226]で専門家レビューを通じて行われるべきです。"
    },
    {
      "indent": 3,
      "text": "+-------------+---------------------+--------------+----------------+\n| Value       |     Format Name     |    Format    |   Reference    |\n|             |                     |  Reference   |                |\n+-------------+---------------------+--------------+----------------+\n| 0 (default) |       HTTP/1.1      |  [RFC2616],  |      This      |\n|             |   metainformation   | Section 7.1  | specification  |\n|             |        format       |              |                |\n+-------------+---------------------+--------------+----------------+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "7.2. Creation of the FCAST Object Metadata Encoding Registry",
      "section_title": true,
      "ja": "7.2。 FCASTオブジェクトメタデータのエンコーディングレジストリの作成"
    },
    {
      "indent": 3,
      "text": "IANA has created a new registry, \"FCAST Object Metadata Encoding\" (MDEnc), with a reference to this document. The registry entries consist of a numeric value from 0 to 15, inclusive (i.e., they are 4-bit positive integers), that defines the encoding of the Object Metadata field (see Section 2.1).",
      "ja": "IANAはこのドキュメントを参照して、新しいレジストリ、「FCASTオブジェクトメタデータのエンコーディング」（MDEnc）を作成しました。レジストリエントリは、オブジェクトのメタデータフィールドの符号化を定義する包括0から15までの数値（すなわち、それらは4ビットの正の整数である）、（セクション2.1を参照）からなります。"
    },
    {
      "indent": 3,
      "text": "The initial values for this registry are defined below. Future assignments are to be made through Expert Review [RFC5226].",
      "ja": "このレジストリの初期値は以下のように定義されます。今後の割り当ては、専門家レビュー[RFC5226]を介して行われるべきです。"
    },
    {
      "indent": 3,
      "text": "+---------+------------------+-----------------+--------------------+\n|  Value  |  Encoding Name   |     Encoding    |     Reference      |\n|         |                  |    Reference    |                    |\n+---------+------------------+-----------------+--------------------+\n|    0    |  UTF-8 encoded   |    [RFC3629]    | This specification |\n|         |       text       |                 |                    |\n|         |                  |                 |                    |\n|    1    |  GZIP'ed UTF-8   |    [RFC1952],   | This specification |\n|         |   encoded text   |    [RFC3629]    |                    |\n+---------+------------------+-----------------+--------------------+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "7.3. Creation of the FCAST Object Metadata Types Registry",
      "section_title": true,
      "ja": "7.3。 FCASTオブジェクトのメタデータの種類レジストリの作成"
    },
    {
      "indent": 3,
      "text": "IANA has created a new registry, \"FCAST Object Metadata Types\" (MDType), with a reference to this document. The registry entries consist of additional text metadata type identifiers and descriptions for metadata item types that are specific to FCAST operation and not previously defined in [RFC2616]. The initial values are those described in Section 3.3 of this specification. This table summarizes those initial registry entries. Future assignments are to be made through Expert Review [RFC5226].",
      "ja": "IANAはこのドキュメントを参照して、新しいレジストリ、「FCASTオブジェクトメタデータの種類」（MDType）を作成しました。レジストリエントリがFCAST動作に固有の予め[RFC2616]で定義されていないメタデータ・アイテム・タイプの追加テキストメタデータタイプ識別子と記述から成ります。初期値は、本明細書のセクション3.3に記載されているものです。この表は、これらの初期のレジストリエントリをまとめました。今後の割り当ては、専門家レビュー[RFC5226]を介して行われるべきです。"
    },
    {
      "indent": 3,
      "text": "+-------------------------+-----------------------+-----------------+\n| Metadata Type           | Description           |    Reference    |\n+-------------------------+-----------------------+-----------------+\n| Fcast-Obj-Digest-SHA1   | A string that         |       This      |\n|                         | contains the \"base64\" |  specification  |\n|                         | encoding of the SHA-1 |                 |\n|                         | message digest of the |                 |\n|                         | object before any     |                 |\n|                         | content encoding is   |                 |\n|                         | applied (if any) and  |                 |\n|                         | without considering   |                 |\n|                         | the FCAST Header      |                 |\n|                         |                       |                 |\n| Fcast-Obj-Digest-SHA256 | A string that         |       This      |\n|                         | contains the \"base64\" |  specification  |\n|                         | encoding of the       |                 |\n|                         | SHA-256 message       |                 |\n|                         | digest of the object  |                 |\n|                         | before any content    |                 |\n|                         | encoding is applied   |                 |\n|                         | (if any) and without  |                 |\n|                         | considering the FCAST |                 |\n|                         | Header                |                 |\n|                         |                       |                 |\n| Fcast-Obj-Slice-Nb      | Unsigned 32-bit       |       This      |\n|                         | integer that contains |  specification  |\n|                         | the total number of   |                 |\n|                         | slices.  A value      |                 |\n|                         | greater than 1        |                 |\n|                         | indicates that this   |                 |\n|                         | object is the result  |                 |\n|                         | of a split of the     |                 |\n|                         | original object       |                 |\n|                         |                       |                 |\n| Fcast-Obj-Slice-Idx     | Unsigned 32-bit       |       This      |\n|                         | integer that contains |  specification  |\n|                         | the slice index (in   |                 |\n|                         | the {0 .. SliceNb -   |                 |\n|                         | 1} interval)          |                 |\n|                         |                       |                 |\n| Fcast-Obj-Slice-Offset  | Unsigned 64-bit       |       This      |\n|                         | integer that contains |  specification  |\n|                         | the byte offset at    |                 |\n|                         | which this slice      |                 |\n|                         | starts within the     |                 |\n|                         | original object       |                 |\n+-------------------------+-----------------------+-----------------+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "8. Acknowledgments",
      "section_title": true,
      "ja": "8.謝辞"
    },
    {
      "indent": 3,
      "text": "The authors are grateful to the authors of [ALC-00] for specifying the first version of FCAST/ALC. The authors are also grateful to David Harrington, Gorry Fairhurst, and Lorenzo Vicisano for their valuable comments. The authors are also grateful to Jari Arkko, Ralph Droms, Wesley Eddy, Roni Even, Stephen Farrell, Russ Housley, Chris Lonvick, Pete Resnick, Joseph Yee, and Martin Stiemerling.",
      "ja": "著者らは、FCAST / ALCの最初のバージョンを指定するための[ALC-00]の著者に感謝しています。著者はまた、彼らの貴重なコメントのためのデヴィッドハリントン、Gorry Fairhurst、そしてロレンソVicisanoに感謝しています。著者はヤリArkko、ラルフDroms、ウェズリーエディ、ロニでも、スティーブン・ファレル、ラスHousley、クリスLonvick、ピート・レズニック、ジョセフ・イー、マーティンStiemerlingにも感謝しています。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "ja": "9.参考文献"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "ja": "9.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC1071] Braden, R., Borman, D., Partridge, C., and W. Plummer, \"Computing the Internet checksum\", RFC 1071, September 1988.",
      "ja": "[RFC1071]ブレーデン、R.、ボーマン、D.、ヤマウズラ、C.、およびW.プラマー、 \"インターネットチェックサムの計算\"、RFC 1071、1988年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC1952] Deutsch, P., \"GZIP file format specification version 4.3\", RFC 1952, May 1996.",
      "ja": "[RFC1952]ドイツ、P.、 \"GZIPファイル形式の仕様バージョン4.3\"、RFC 1952、1996年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2616] Fielding, R., Gettys, J., Mogul, J., Frystyk, H., Masinter, L., Leach, P., and T. Berners-Lee, \"Hypertext Transfer Protocol -- HTTP/1.1\", RFC 2616, June 1999.",
      "ja": "[RFC2616]フィールディング、R.、ゲティス、J.、モーグル、J.、Frystyk、H.、Masinter、L.、リーチ、P.、およびT.バーナーズ - リー、 \"ハイパーテキスト転送プロトコル -  HTTP / 1.1\" 、RFC 2616、1999年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC3174] Eastlake, D. and P. Jones, \"US Secure Hash Algorithm 1 (SHA1)\", RFC 3174, September 2001.",
      "ja": "[RFC3174]イーストレイク、D.とP.ジョーンズは、 \"米国は、ハッシュアルゴリズム1（SHA1）を確保\"、RFC 3174、2001年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC3629] Yergeau, F., \"UTF-8, a transformation format of ISO 10646\", STD 63, RFC 3629, November 2003.",
      "ja": "[RFC3629] Yergeau、F.、 \"UTF-8、ISO 10646の変換フォーマット\"、STD 63、RFC 3629、2003年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC4648] Josefsson, S., \"The Base16, Base32, and Base64 Data Encodings\", RFC 4648, October 2006.",
      "ja": "[RFC4648] Josefsson氏、S.、 \"Base16、Base32、およびBase64でデータエンコーディング\"、RFC 4648、2006年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC5226] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 5226, May 2008.",
      "ja": "[RFC5226] Narten氏、T.とH. Alvestrand、 \"RFCsにIANA問題部に書くためのガイドライン\"、BCP 26、RFC 5226、2008年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC5234] Crocker, D. and P. Overell, \"Augmented BNF for Syntax Specifications: ABNF\", STD 68, RFC 5234, January 2008.",
      "ja": "[RFC5234]クロッカー、D.、およびP. Overell、 \"構文仕様のための増大しているBNF：ABNF\"、STD 68、RFC 5234、2008年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC5651] Luby, M., Watson, M., and L. Vicisano, \"Layered Coding Transport (LCT) Building Block\", RFC 5651, October 2009.",
      "ja": "[RFC5651]ルビー、M.、ワトソン、M.、およびL. Vicisano、 \"階層符号化トランスポート（LCT）ビルディングブロック\"、RFC 5651、2009年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC5740] Adamson, B., Bormann, C., Handley, M., and J. Macker, \"NACK-Oriented Reliable Multicast (NORM) Transport Protocol\", RFC 5740, November 2009.",
      "ja": "[RFC5740]アダムソン、B.、ボルマン、C.、ハンドレー、M.、およびJ. Macker、 \"NACK指向高信頼マルチキャスト（NORM）トランスポートプロトコル\"、RFC 5740、2009年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC5775] Luby, M., Watson, M., and L. Vicisano, \"Asynchronous Layered Coding (ALC) Protocol Instantiation\", RFC 5775, April 2010.",
      "ja": "[RFC5775]ルビー、M.、ワトソン、M.、およびL. Vicisano、RFC 5775 \"非同期階層は（ALC）プロトコルインスタンス化コーディング\" 2010年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC6234] Eastlake, D. and T. Hansen, \"US Secure Hash Algorithms (SHA and SHA-based HMAC and HKDF)\", RFC 6234, May 2011.",
      "ja": "[RFC6234]イーストレイク、D.とT.ハンセンは、 \"米国は、ハッシュアルゴリズム（SHAとSHAベースのHMACとHKDF）を確保\"、RFC 6234、2011年5月。"
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "ja": "9.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[ALC-00] Luby, M., Gemmell, J., Vicisano, L., Rizzo, L., Crowcroft, J., and B. Lueckenhoff, \"Asynchronous Layered Coding: A scalable reliable multicast protocol\", Work in Progress, March 2000.",
      "ja": "[ALC-00]ルビー、M.、Gemmell、J.、Vicisano、L.、リゾー、L.、クロウクロフト、J.、およびB. Lueckenhoff、 \"非同期階層コーディング：スケーラブルで信頼性の高いマルチキャストプロトコル\"、ProgressのWork 、2000年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2104] Krawczyk, H., Bellare, M., and R. Canetti, \"HMAC: Keyed-Hashing for Message Authentication\", RFC 2104, February 1997.",
      "ja": "[RFC2104] Krawczyk、H.、ベラー、M.、およびR.カネッティ、 \"HMAC：メッセージ認証のための鍵付きハッシュ化\"、RFC 2104、1997年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC3365] Schiller, J., \"Strong Security Requirements for Internet Engineering Task Force Standard Protocols\", BCP 61, RFC 3365, August 2002.",
      "ja": "[RFC3365]シラー、J.、BCP 61、RFC 3365、2002年8月 \"インターネットエンジニアリングタスクフォース標準プロトコルのための強力なセキュリティ要件\"。"
    },
    {
      "indent": 3,
      "text": "[RFC3447] Jonsson, J. and B. Kaliski, \"Public-Key Cryptography Standards (PKCS) #1: RSA Cryptography Specifications Version 2.1\", RFC 3447, February 2003.",
      "ja": "[RFC3447]ジョンソン、J.とB. Kaliski、 \"公開鍵暗号規格（PKCS）＃1：RSA暗号仕様バージョン2.1\"、RFC 3447、2003年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC4082] Perrig, A., Song, D., Canetti, R., Tygar, J., and B. Briscoe, \"Timed Efficient Stream Loss-Tolerant Authentication (TESLA): Multicast Source Authentication Transform Introduction\", RFC 4082, June 2005.",
      "ja": "[RFC4082] Perrig、A.、歌、D.、カネッティ、R.、Tygar、J.、およびB.ブリスコウ、 \"時限効率ストリーム損失トレラント認証（テスラ）：マルチキャスト発信元認証は、はじめの変換\"、RFC 4082、 2005年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC4303] Kent, S., \"IP Encapsulating Security Payload (ESP)\", RFC 4303, December 2005.",
      "ja": "[RFC4303]ケント、S.、 \"IPカプセル化セキュリティペイロード（ESP）\"、RFC 4303、2005年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC5052] Watson, M., Luby, M., and L. Vicisano, \"Forward Error Correction (FEC) Building Block\", RFC 5052, August 2007.",
      "ja": "[RFC5052]ワトソン、M.、ルビー、M.、およびL. Vicisano、 \"前方誤り訂正（FEC）ビルディングブロック\"、RFC 5052、2007年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC5510] Lacan, J., Roca, V., Peltotalo, J., and S. Peltotalo, \"Reed-Solomon Forward Error Correction (FEC) Schemes\", RFC 5510, April 2009.",
      "ja": "[RFC5510]ラカン、J.、ロカ、V.、Peltotalo、J.、およびS. Peltotalo、 \"リードソロモン前方誤り訂正（FEC）スキーム\"、RFC 5510、2009年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC5776] Roca, V., Francillon, A., and S. Faurite, \"Use of Timed Efficient Stream Loss-Tolerant Authentication (TESLA) in the Asynchronous Layered Coding (ALC) and NACK-Oriented Reliable Multicast (NORM) Protocols\", RFC 5776, April 2010.",
      "ja": "[RFC5776]はロカ、V.、Francillon、A.、およびS. Faurite、「非同期階層符号化（ALC）及びタイミング効率ストリーム損失トレラント認証（テスラ）を使用する高信頼マルチキャスト（NORM）プロトコルNACKを指向します」 、RFC 5776、2010年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC6363] Watson, M., Begen, A., and V. Roca, \"Forward Error Correction (FEC) Framework\", RFC 6363, October 2011.",
      "ja": "[RFC6363]ワトソン、M.、Begen、A.、およびV.ロカ、 \"前方誤り訂正（FEC）フレームワーク\"、RFC 6363、2011年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC6584] Roca, V., \"Simple Authentication Schemes for the Asynchronous Layered Coding (ALC) and NACK-Oriented Reliable Multicast (NORM) Protocols\", RFC 6584, April 2012.",
      "ja": "[RFC6584]ロカ、V.、RFC 6584、2012年4月 \"非同期階層化のための簡単な認証スキームは、信頼性の高いマルチキャスト（NORM）プロトコル（ALC）をコーディングし、NACK指向\"。"
    },
    {
      "indent": 3,
      "text": "[RFC6726] Paila, T., Walsh, R., Luby, M., Roca, V., and R. Lehtonen, \"FLUTE - File Delivery over Unidirectional Transport\", RFC 6726, November 2012.",
      "ja": "[RFC6726] Paila、T.、ウォルシュ、R.、ルビー、M.、ロカ、V.、およびR. Lehtonenの、 \"FLUTE  - 単方向トランスポート上でファイル配信\"、RFC 6726、2012年11月。"
    },
    {
      "indent": 3,
      "text": "[RMT-SEC] Adamson, B., Roca, V., and H. Asaeda, \"Security and Reliable Multicast Transport Protocols: Discussions and Guidelines\", Work in Progress, May 2013.",
      "ja": "[RMT-SEC]アダムソン、B.、ロカ、V.、およびH. Asaeda、 \"セキュリティと信頼性の高いマルチキャストトランスポートプロトコル：ディスカッションとガイドライン\"、進歩、2013年5月での作業。"
    },
    {
      "indent": 0,
      "text": "Appendix A. FCAST Examples",
      "ja": "付録A. FCAST例"
    },
    {
      "indent": 3,
      "text": "This appendix provides informative examples of FCAST Compound Objects and Carousel Instance Descriptor formats.",
      "ja": "この付録では、FCAST化合物のオブジェクトとカルーセルインスタンスの記述形式の有益な例を提供します。"
    },
    {
      "indent": 0,
      "text": "A.1. Simple Compound Object Example",
      "ja": "A.1。単純な複合オブジェクトの例"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|Ver=0|  0  |1|0|MDFmt=0|MDEnc=0|           Checksum            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     FCAST Header Length=41                    |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-|\n.                                                               .\n. \"Content-Location: example_1.txt<CR-LF>\" metadata (33 bytes)  .\n.                                                               .\n+               +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|               |                    Padding                    |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n.                                                               .\n.                         Object Data                           .\n.                                                               .\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 17,
      "text": "Figure 4: Simple Compound Object Example",
      "ja": "図4：単純な複合オブジェクトの例"
    },
    {
      "indent": 3,
      "text": "Figure 4 shows a simple Compound Object where the metadata string, in HTTP/1.1 metainformation format (MDFmt=0), contains:",
      "ja": "：図4は、メタデータ文字列は、HTTP / 1.1メタ情報フォーマット（MDFmt = 0）で、含む単純な複合オブジェクトを示します"
    },
    {
      "indent": 9,
      "text": "Content-Location: example_1.txt<CR-LF>",
      "ja": "コンテンツ所在地：example_1.txt <CR-LF>"
    },
    {
      "indent": 3,
      "text": "This UTF-8 encoded text (since MDEnc=0) is 33 bytes long (there is no final '\\0' character). Therefore, 3 padding bytes are added. There is no Content-Length metadata entry for the object transported (without FCAST additional encoding) in the Object Data field, since this length can easily be calculated by the receiver as the FEC OTI Transfer Length minus the header length. Finally, the checksum encompasses the whole Compound Object (G=1).",
      "ja": "このUTF-8でエンコードされたテキスト（MDEnc = 0であるため）33バイト長である（NO FINAL '\\ 0' 文字はありません）。したがって、3つのパディングバイトが追加されます。この長さは容易FEC OTI転送長マイナスヘッダ長として受信機によって計算することができるので、オブジェクトのデータフィールドに（FCAST追加の符号化せずに）搬送物のためのコンテンツ長メタデータエントリは、存在しません。最後に、チェックサムは全体の複合オブジェクト（G = 1）を包含する。"
    },
    {
      "indent": 0,
      "text": "A.2. Carousel Instance Descriptor Example",
      "ja": "A.2。カルーセルインスタンスの記述例"
    },
    {
      "indent": 6,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|Ver=0|  0  |1|1|MDFmt=0|MDEnc=0|           Checksum            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                   FCAST Header Length=31                      |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-|\n.                                                               .\n.   \"Fcast-CID-Complete: 1<CR-LF>\" metadata string (23 bytes)   .\n.                                                               .\n+                                               +-+-+-+-+-+-+-+-+\n|                                               |    Padding    |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-|\n.                                                               .\n.                Object List string                             .\n.                                                               .\n.               +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n.               |\n+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 15,
      "text": "Figure 5: CID Object Example: Static Session",
      "ja": "図5：CIDオブジェクトの例：静的セッション"
    },
    {
      "indent": 3,
      "text": "Figure 5 shows an example CID object, in the case of a static FCAST session, i.e., a session where the set of objects is set once and for all. The metadata UTF-8 encoded text only contains the following entry, since Fcast-CID-ID is implicit:",
      "ja": "図5は、静的FCASTセッションの場合には、例えば、CIDオブジェクトを示し、すなわち、オブジェクトのセットは、一度、すべての設定されているセッション。 Fcast-CID-IDは暗黙的であるため、メタデータをUTF-8でエンコードされたテキストは、次のエントリが含まれています。"
    },
    {
      "indent": 9,
      "text": "Fcast-CID-Complete: 1<CR-LF>",
      "ja": "Fcast-CID-コンプリート：1 <CR-LF>"
    },
    {
      "indent": 3,
      "text": "This UTF-8 encoded text (since MDEnc=0) is 23 bytes long (there is no final '\\0' character). Therefore, 1 padding byte is added.",
      "ja": "このUTF-8でエンコードされたテキスト（MDEnc = 0であるため）23バイト長である（NO FINAL '\\ 0' 文字はありません）。したがって、1つのパディングバイトが追加されています。"
    },
    {
      "indent": 3,
      "text": "The Object List contains the following 25-byte-long string (there is no final '\\0' character):",
      "ja": "オブジェクトリストは、次の25バイト長の文字列（NO FINAL「\\ 0」文字はありませんが）含まれています。"
    },
    {
      "indent": 9,
      "text": "1,2,3,100-104,200-203,299",
      "ja": "１、２、３、１００ー１０４、２００ー２０３、２９９"
    },
    {
      "indent": 3,
      "text": "There are therefore a total of 3+5+4+1 = 13 objects in the Carousel Instance and therefore in the FCAST session. There is no metadata associated to this CID. As the session is static and composed of a single Carousel Instance, the sender did not feel the necessity to carry a Carousel Instance ID metadata.",
      "ja": "カルーセルインスタンスで、したがってFCASTセッションで3 + 5 + 4 + 1 = 13個のオブジェクトの合計は、したがってあります。このCIDに関連付けられたメタデータがありません。セッションは、静的および単一カルーセルインスタンスで構成されているとして、送信者はカルーセルインスタンスIDメタデータを運ぶために必要性を感じませんでした。"
    },
    {
      "indent": 0,
      "text": "Appendix B. Additional Metadata Transmission Mechanisms",
      "ja": "付録B.追加のメタデータ伝送メカニズム"
    },
    {
      "indent": 0,
      "text": "B.1. Supporting Additional Mechanisms",
      "ja": "B.1。追加メカニズムをサポート"
    },
    {
      "indent": 3,
      "text": "In certain use-cases, FCAST can take advantage of another in-band (e.g., via NORM_INFO messages (Appendix B.2)) or out-of-band signaling mechanism. This section provides an overview of how other signaling mechanisms could be employed and a normative specification for how FCAST information is embedded when NORM_INFO messages are used for carrying FCAST Headers. Such additional signaling schemes can be used to carry the whole metadata, or a subset of it, ahead of time, before the associated Compound Object. Therefore, based on the information retrieved in this way, a receiver could decide in advance (i.e., before beginning the reception of the compound object) whether the object is of interest or not; this would mitigate the limitations of FCAST. While out-of-band techniques are out of the scope of this document, we explain below how this can be achieved in the case of FCAST/NORM.",
      "ja": "特定のユースケースでは、FCASTは、またはアウトオブバンドシグナリングメカニズム（NORM_INFOメッセージ（付録B.2）を介して、例えば）に帯域別の利点を取ることができます。このセクションでは、他のシグナル伝達機構を用いることができる方法の概要とNORM_INFOメッセージがFCASTヘッダを搬送するために使用される場合に埋め込まれている方法FCAST情報に対する規範的仕様を提供します。このような追加のシグナリング方式は、関連する複合オブジェクトの前に、前もって、全体のメタデータ、またはそのサブセットを運ぶために使用することができます。したがって、このように取得した情報に基づいて、受信機がオブジェクトに関心があるか否か（すなわち、化合物のオブジェクトの受信を開始する前に）事前に決定できます。これはFCASTの制限を緩和するでしょう。アウトオブバンド技術は、このドキュメントの範囲外ですが、我々はこれがFCAST / NORMの場合に達成することができる方法の下に説明します。"
    },
    {
      "indent": 3,
      "text": "Supporting additional mechanisms is OPTIONAL in FCAST implementations. In any case, an FCAST sender MUST continue to send all the required metadata in the Compound Object, even if the whole metadata, or a subset of it, is sent by another mechanism (Section 4). Additionally, when metadata is sent several times, there MUST NOT be any contradiction in the information provided by the different mechanisms. If a mismatch is detected, the metadata contained in the Compound Object MUST be used as the definitive source.",
      "ja": "追加メカニズムをサポートするFCAST実装ではオプションです。いずれの場合においても、FCAST送信者は、全メタデータ、またはそのサブセットは、別の機構（第4章）によって送信された場合でも、複合オブジェクトのすべての必要なメタデータを送信し続けなければなりません。また、メタデータが複数回送信されるときに、異なるメカニズムによって提供される情報で矛盾があってはなりません。不一致が検出された場合、複合オブジェクトに含まれるメタデータは、決定的なソースとして使用しなければなりません。"
    },
    {
      "indent": 3,
      "text": "When metadata elements are communicated out-of-band, in advance of data transmission, the following piece of information can be useful:",
      "ja": "メタデータ要素は、アウトオブバンド通信される場合、データ送信に先立って、情報の次の部分が有用であり得ます。"
    },
    {
      "indent": 3,
      "text": "o TOI: a positive integer that contains the Transport Object Identifier (TOI) of the object, in order to enable a receiver to easily associate the metadata to the object. The valid range for TOI values is discussed in Section 3.6.",
      "ja": "O TOI：簡単オブジェクトにメタデータを関連付けるための受信機を有効にするために、対象のトランスポート・オブジェクト識別子（TOI）を含有する正の整数。 TOI値の有効範囲は、セクション3.6で説明されています。"
    },
    {
      "indent": 0,
      "text": "B.2. Using NORM_INFO Messages with FCAST/NORM",
      "ja": "B.2。 FCAST / NORMとNORM_INFOメッセージを使用しました"
    },
    {
      "indent": 3,
      "text": "The NORM_INFO message of NORM can convey \"out-of-band\" content with respect to a given transport object. With FCAST, this message MAY be used as an additional mechanism to transmit metadata. In that case, the NORM_INFO message carries a new Compound Object that contains all the metadata of the original object, or a subset of it. The NORM_INFO Compound Object MUST NOT contain any Object Data field (i.e., it is only composed of the header), it MUST feature a non-global checksum, and it MUST NOT include a Padding field. Finally, note that the availability of NORM_INFO for a given object is signaled through the use of a dedicated flag in the NORM_DATA message header. Along with NORM's NACK-based repair request signaling, it allows a receiver to quickly (and independently) request an object's NORM_INFO content. However, a limitation here is that the FCAST Header MUST fit within the byte size limit defined by the NORM sender's configured \"segment size\" (typically a little less than the network MTU).",
      "ja": "NORMのNORM_INFOメッセージは、所与のトランスポート・オブジェクトに対する「アウトオブバンド」のコンテンツを搬送することができます。 FCASTでは、このメッセージは、メタデータを送信するために追加のメカニズムとして使用することができます。その場合、NORM_INFOメッセージは、すべての元のオブジェクトのメタデータ、またはそのサブセットを含む新しい複合オブジェクトを運びます。 NORM_INFOの複合オブジェクト（すなわち、それはヘッダのみで構成されている）は、任意のオブジェクト・データ・フィールド、それは、非グローバルチェックサムを備えていなければなりませんが含まれていなければならず、パディングフィールドを含んではいけません。最後に、指定されたオブジェクトのNORM_INFOの可用性がNORM_DATAメッセージヘッダ内の専用のフラグの使用を介してシグナリングされることに注意してください。 NORMのNACKベースの修復要求シグナリングと共に、それが受信機に迅速に（独立して）ことができ、オブジェクトのNORM_INFOコンテンツを要求します。しかし、ここでの制限はFCASTヘッダーNORM送信者の構成「セグメントサイズ」（ネットワークMTUより典型的には少し少ない）によって定義されたバイトサイズ制限内に適合しなければならないことです。"
    },
    {
      "indent": 0,
      "text": "B.2.1. Example",
      "ja": "B.2.1。例"
    },
    {
      "indent": 3,
      "text": "In the case of FCAST/NORM, the object metadata (or a subset of it) can be carried as part of a NORM_INFO message, as a new Compound Object that does not contain any Object Data. In the following informative example, we assume that the whole metadata is carried in such a message. Figure 6 shows an example NORM_INFO message that contains the FCAST Header, including metadata. In this example, the first 16 bytes are the NORM_INFO base header; the next 12 bytes are a NORM EXT_FTI header extension containing the FEC Object Transport Information for the associated object; and the remaining bytes are the FCAST Header, including metadata. Note that \"padding\" MUST NOT be used and that the FCAST checksum only encompasses the Compound Object Header (G=0).",
      "ja": "FCAST / NORMの場合には、オブジェクトのメタデータ（又はそのサブセット）が任意のオブジェクトデータを含まない新しい複合オブジェクトとして、NORM_INFOメッセージの一部として実施することができます。以下の参考例では、我々は全体のメタデータがそのようなメッセージで運ばれていることを前提としています。図6は、メタデータを含む、FCASTヘッダを含ん例NORM_INFOメッセージを示しています。この例では、最初の16のバイトはNORM_INFO基本ヘッダです。次の12のバイトは、関連オブジェクトのFECオブジェクト転送情報を含むNORM EXT_FTIヘッダ拡張です。残りのバイトは、メタデータを含む、FCASTヘッダです。 「パディング」は使用してはならないことに注意してくださいとFCASTチェックサムは、複合オブジェクトヘッダ（G = 0）を包含すること。"
    },
    {
      "indent": 3,
      "text": "0                   1                   2                   3\n0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ --\n|version| type=1|  hdr_len = 7  |          sequence             |  ^\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+  |\n|                           source_id                           |  n\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+  o\n|          instance_id          |     grtt      |backoff| gsize |  r\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+  m\n|     flags     |  fec_id = 5   |     object_transport_id       |  v\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ --\n|   HET = 64    |    HEL = 3    |                               |  ^\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+                               +  f\n|                     Transfer Length = 41                      |  t\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+  i\n|   Encoding Symbol Length (E)  | MaxBlkLen (B) |     max_n     |  v\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ --\n|  0  | 0   |0|0|   0   |   0   |           Checksum            |  ^\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+  |\n|                               41                              |  f\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-|  c\n.                                                               .  a\n.            metadata UTF-8 encoded text (32 bytes)             .  s\n.                                                               .  t\n+               +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+  |\n|               |                                                  v\n+-+-+-+-+-+-+-+-+                                                 --",
      "raw": true
    },
    {
      "indent": 4,
      "text": "Figure 6: NORM_INFO Message Containing an EXT_FTI Header Extension and an FCAST Header",
      "ja": "図6：EXT_FTIヘッダ拡張を含むNORM_INFOメッセージとFCASTヘッダ"
    },
    {
      "indent": 3,
      "text": "The NORM_INFO message shown in Figure 6 contains the EXT_FTI header extension to carry the FEC OTI. In this example, the FEC OTI format is that of the Reed-Solomon FEC coding scheme for fec_id = 5, as described in [RFC5510]. Other alternatives for providing the FEC OTI would have been to either include it directly in the metadata of the FCAST Header or to include an EXT_FTI header extension to all NORM_DATA packets (or a subset of them). Note that the NORM \"Transfer Length\" is the total length of the associated Compound Object, i.e., 41 bytes.",
      "ja": "図6に示すNORM_INFOメッセージはFEC OTIを運ぶためEXT_FTIヘッダ拡張を含んでいます。この例では、FEC OTI形式は[RFC5510]に記載されているように、その5 = fec_id用リードソロモンFEC符号化方式です。 FEC OTIを提供するための他の選択肢のいずれかにあったであろうFCASTヘッダのメタデータに直接含まれるか、全てNORM_DATAパケット（またはそれらのサブセット）にEXT_FTIヘッダ拡張を含めること。 NORM「転送長」は、すなわち、41バイト関連化合物の合計の長さであることに留意されたいです。"
    },
    {
      "indent": 3,
      "text": "The Compound Object in this example does contain the same metadata and is formatted as in the example of Figure 4. With the combination of the FEC_OTI and the FCAST metadata, the NORM protocol and FCAST application have all of the information needed to reliably receive and process the associated object. Indeed, the NORM protocol provides rapid (NORM_INFO has precedence over the associated object content), reliable delivery of the NORM_INFO message and its payload, the FCAST Compound Object.",
      "ja": "この例では複合オブジェクトは、同じメタデータを含んで行い、FEC_OTIとFCASTメタデータの組み合わせを用いて、図4の例のようにフォーマットされ、NORMプロトコルとFCASTアプリケーションが確実に受信して処理するために必要なすべての情報を持っています関連するオブジェクト。実際、NORMプロトコルはNORM_INFOメッセージとそのペイロード、FCASTの化合物の、（NORM_INFOは、関連オブジェクトのコンテンツよりも優先され）、迅速な信頼できる配信を提供します。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Vincent Roca INRIA 655, av. de l'Europe Inovallee; Montbonnot ST ISMIER cedex 38334 France",
      "ja": "INRIAヴィンセントロカ655、AV。ドゥヨーロッパInovallée。フランス38334 CEDEX MontbonnotセントIsmier"
    },
    {
      "indent": 3,
      "text": "EMail: vincent.roca@inria.fr URI: http://planete.inrialpes.fr/people/roca/",
      "ja": "電子メール：vincent.roca@inria.fr URI：http://planete.inrialpes.fr/people/roca/"
    },
    {
      "indent": 3,
      "text": "Brian Adamson Naval Research Laboratory Washington, DC 20375 USA",
      "ja": "ブライアン・アダムソン海軍研究所ワシントンD.C. 20375 USA"
    },
    {
      "indent": 3,
      "text": "EMail: adamson@itd.nrl.navy.mil URI: http://cs.itd.nrl.navy.mil",
      "ja": "電子メール：adamson@itd.nrl.navy.mil URI：http://cs.itd.nrl.navy.mil"
    }
  ]
}