{
  "title": {
    "text": "RFC 6909 - IPv4 Traffic Offload Selector Option for Proxy Mobile IPv6",
    "ja": "RFC 6909 - プロキシモバイルIPv6のIPv4トラフィックオフロードセレクター・オプション"
  },
  "number": 6909,
  "created_at": "2019-11-01 10:47:17.464157+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                S. Gundavelli, Ed.\nRequest for Comments: 6909                                         Cisco\nCategory: Standards Track                                        X. Zhou\nISSN: 2070-1721                                          ZTE Corporation\n                                                             J. Korhonen\n                                                          Renesas Mobile\n                                                                G. Feige\n                                                               R. Koodli\n                                                                   Cisco\n                                                              April 2013",
      "raw": true
    },
    {
      "indent": 7,
      "text": "IPv4 Traffic Offload Selector Option for Proxy Mobile IPv6",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This specification defines a new mobility option, the IPv4 Traffic Offload Selector option, for Proxy Mobile IPv6. This option can be used by the local mobility anchor and the mobile access gateway for negotiating IPv4 traffic offload policy for a mobility session. Based on the negotiated IPv4 traffic offload policy, a mobile access gateway can selectively offload some of the IPv4 traffic flows in the access network instead of tunneling back to the local mobility anchor in the home network.",
      "ja": "この仕様は、プロキシモバイルIPv6のために、新しいモビリティオプションはIPv4トラフィックオフロードセレクタオプションを定義します。このオプションは、ローカル・モビリティ・アンカーとモビリティセッションのIPv4トラフィックのオフロードポリシーを交渉するためのモバイルアクセスゲートウェイで使用することができます。交渉されたIPv4トラフィックのオフロードの方針に基づいて、モバイルアクセスゲートウェイを選択IPv4トラフィックの一部が戻ってホームネットワーク内のローカル・モビリティ・アンカーへの代わりに、トンネルのアクセスネットワークに流れるオフロードすることができます。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6909.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6909で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2013 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2013 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Conventions and Terminology .....................................4\n   2.1. Conventions ................................................4\n   2.2. Terminology ................................................4\n3. Solution Overview ...............................................4\n   3.1. IPv4 Traffic Offload Selector Option .......................6\n   3.2. MAG Considerations .........................................8\n   3.3. LMA Considerations .........................................9\n4. Protocol Configuration Variables ...............................11\n5. IANA Considerations ............................................11\n6. Security Considerations ........................................12\n7. Acknowledgements ...............................................12\n8. References .....................................................13\n   8.1. Normative References ......................................13\n   8.2. Informative References ....................................13",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "Mobile operators are expanding their network coverage by integrating various access technology domains (e.g., Wireless LAN, CDMA, and Long-Term Evolution (LTE)) into a common IP mobility core. The Third Generation Partnership Project (3GPP) S2a Proxy Mobile IPv6 [TS23402] reference point, specified by the 3GPP system architecture, defines the protocol interworking for building such integrated multi-access networks. In this scenario, the mobile node's IP traffic is always tunneled back from the mobile access gateway [RFC5213] in the access network to the local mobility anchor in the home network. Currently, there is no mechanism for allowing some of the subscriber's IP flows to be offloaded in the access network.",
      "ja": "携帯電話事業者は、一般的なIPモビリティコアに様々なアクセス技術ドメイン（例えば、無線LAN、CDMA、およびロングタームエボリューション（LTE））を統合することによって、ネットワークのカバレッジを拡大しています。第三世代パートナーシッププロジェクト（3GPP）S2aとプロキシモバイルIPv6 [TS23402]基準点は、3GPPシステム・アーキテクチャによって指定され、そのような統合マルチアクセスネットワークを構築するためのプロトコル相互動作を定義します。このシナリオでは、モバイルノードのIPトラフィックは、常にバックホームネットワーク内のローカル・モビリティ・アンカーへのアクセスネットワークにおけるモバイル・アクセス・ゲートウェイ[RFC5213]からのトンネリングされます。現在、加入者のIPフローのいくつかは、アクセスネットワークにオフロードできるようにするためのメカニズムはありません。"
    },
    {
      "indent": 3,
      "text": "With the exponential growth in mobile data traffic, mobile operators are exploring new ways to offload some of the IP traffic flows at the nearest access edge. The offload is intended either for local service access in the access network or for Internet offload through the access network when there is an Internet peering point. Not all IP traffic flows need to be routed back to the home network; the traffic that does not require IP mobility support can be offloaded at the mobile access gateway in the access network. This approach allows efficient usage of the mobile packet core, which helps in lowering transport costs. To identify the IP flows that need to be offloaded, the local mobility anchor in the home network can deliver the IP flow policy to the mobile access gateway in the access network. It is up to an operator's discretion to classify the traffic for offload. One operator might choose to offload everything except traffic (such as Voice over IP) that requires QoS services. Another might choose to offload only HTTP traffic. This specification is only concerned with matching IP traffic against a given flow selector and classification of IP traffic for offloading purposes. This approach has one limitation with respect to identifying encrypted traffic: IPsec-encrypted traffic with no visibility into the application payload cannot be selected for offload.",
      "ja": "モバイルデータトラフィックが急増すると、携帯電話事業者は、IPトラフィックの一部最寄りのアクセスエッジで流れるの負荷を軽減するための新しい方法を模索しています。オフロードは、アクセスネットワーク内のローカルサービスへのアクセスまたはインターネットピアリングポイントがあり、アクセスネットワークを介してインターネットオフロード用のいずれかのものです。いないすべてのIPトラフィックフローは、ホームネットワークに戻ってルーティングする必要があります。 IPモビリティサポートを必要としないトラフィックは、アクセスネットワークにおけるモバイル・アクセス・ゲートウェイにオフロードすることができます。このアプローチは、輸送コストを下げるのに役立ちますモバイルパケットコアの効率的な使用を可能にします。オフロードする必要があるIPフローを識別するために、ホームネットワーク内のローカル・モビリティ・アンカーは、アクセスネットワークにおけるモバイルアクセスゲートウェイにIPフローポリシーを提供することができます。これは、オフロード用のトラフィックを分類するためのオペレータの裁量に任されています。一つのオペレータは、QoSサービスを必要とする（たとえば、ボイスオーバーIPなど）トラフィック以外のすべてをオフロードすることを選択するかもしれません。もう一つは、HTTPトラフィックのみをオフロードすることを選択するかもしれません。この仕様は、目的の負荷を軽減するためのIPトラフィックの指定されたフローセレクタと分類に対してIPトラフィックが一致する唯一の懸念です。このアプローチは、暗号化されたトラフィックを識別に対する1つの制限があります。アプリケーション・ペイロードにない可視性とのIPsec暗号化トラフィックをオフロードするために選択することができません。"
    },
    {
      "indent": 3,
      "text": "This document defines a new mobility option, the IPv4 Traffic Offload Selector option (see Section 3.1), for Proxy Mobile IPv6 (PMIPv6). This option can be used by the local mobility anchor and the mobile access gateway for negotiating IPv4 traffic offload policy for a mobility session. This IPv4 traffic offload policy identifies the flow selectors that can be used for selecting the flows that can be offloaded at the access edge. Since the mobile node's IP address topologically belongs to the home network, the offloaded IPv4 traffic flows may need to be NAT [RFC2663] translated. These offloaded flows will not have mobility support as the NAT becomes the anchor point for those flows. However, when the traffic is offloaded for local service access as opposed to Internet offload, NAT translation may not be needed if the mobile access gateway is in the path for the return traffic. The decision on when to apply NAT translation can be based on local configuration on the mobile access gateway. There are better ways to address the offload problem for IPv6, and with the goal not to create a NAT66 requirement, this specification therefore does not address traffic offload support for IPv6 flows.",
      "ja": "この文書は、新しいモビリティ・オプションを定義し、プロキシモバイルIPv6のIPv4トラフィックオフロードセレクタオプション（3.1節を参照）、（のPMIPv6）。このオプションは、ローカル・モビリティ・アンカーとモビリティセッションのIPv4トラフィックのオフロードポリシーを交渉するためのモバイルアクセスゲートウェイで使用することができます。このIPv4トラフィックオフロードポリシーは、アクセスエッジにオフロードすることができるフローを選択するために使用することができるフローセレクタを識別する。モバイルノードのIPアドレスがトポロジー的にホームネットワークに属しているので、オフロードIPv4トラフィックフローはNAT [RFC2663]に翻訳する必要があります。 NATは、これらのフローのためのアンカーポイントになるとこれらのオフロードのフローは、モビリティをサポートしていません。モバイルアクセスゲートウェイがリターントラフィックのパスにある場合は、トラフィックがインターネットオフロードとは対照的に、ローカルサービスへのアクセスのためにオフロードされたときに、NAT変換を必要としなくてもよいです。 NAT変換を適用する際の決定は、モバイルアクセスゲートウェイ上のローカル設定に基づくことができます。そこIPv6用のオフロードの問題に対処するためのより良い方法があり、NAT66の要件を作成しないように目標に、この仕様はそのためのIPv6フローのトラフィックのオフロードのサポートに対応していません。"
    },
    {
      "indent": 0,
      "text": "2. Conventions and Terminology",
      "section_title": true,
      "ja": "2.表記と用語"
    },
    {
      "indent": 0,
      "text": "2.1. Conventions",
      "section_title": true,
      "ja": "2.1。表記"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はありますRFC 2119 [RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2.2. Terminology",
      "section_title": true,
      "ja": "2.2。用語"
    },
    {
      "indent": 3,
      "text": "All the mobility-related terms used in this document are to be interpreted as defined in the base Proxy Mobile IPv6 specifications [RFC5213] [RFC5844]. Additionally, this document uses the following terms:",
      "ja": "本書で使用されるすべてのモビリティ関連用語は、ベースプロキシモバイルIPv6仕様[RFC5213]、[RFC5844]で定義されるように解釈されるべきです。また、この文書は、次の用語を使用します。"
    },
    {
      "indent": 3,
      "text": "IP Flow",
      "ja": "IPフロー"
    },
    {
      "indent": 6,
      "text": "IP flow [RFC5101] represents a set of IP packets that match a traffic selector (TS). The selector is typically based on the source IP address, destination IP address, source port, destination port, and other fields in upper-layer headers.",
      "ja": "IPフロー[RFC5101]は、トラフィックセレクタ（TS）と一致するIPパケットの集合を表します。セレクタは、典型的には、送信元IPアドレス、宛先IPアドレス、送信元ポート、宛先ポート、及び上位層ヘッダ内の他のフィールドに基づいています。"
    },
    {
      "indent": 3,
      "text": "IP Traffic Offload",
      "ja": "IPトラフィックのオフロード"
    },
    {
      "indent": 6,
      "text": "IP traffic offload is the approach of selecting specific IP flows and routing them through the access network instead of tunneling them to the home network. Offload can also be between two access networks (e.g., moving some of the traffic from LTE access to WLAN access).",
      "ja": "IPトラフィックのオフロードは、特定のIPフローを選択し、ホームネットワークにそれらをトンネリングするのではなく、アクセスネットワークを介してそれらをルーティングするアプローチです。オフロードは、2個のアクセスネットワーク（例えば、WLANアクセスへLTEアクセスからのトラフィックの一部を移動させる）の間とすることができます。"
    },
    {
      "indent": 0,
      "text": "3. Solution Overview",
      "section_title": true,
      "ja": "3.ソリューションの概要"
    },
    {
      "indent": 3,
      "text": "Figure 1 illustrates the scenario where the mobile access gateway in an access network has enabled IPv4 traffic offload support for a mobility session. The offload decision is based on the IPv4 traffic offload policy that it negotiated with the local mobility anchor in the home network. For example, all the HTTP flows may be offloaded at the mobile access gateway, and all the other flows for that mobility session are tunneled back to the local mobility anchor. The offloaded flows typically have to be NAT translated, and this specification does not impose any restrictions on the location of the NAT function. It is possible for the NAT function to be co-located with the mobile access gateway or located somewhere at the edge of the access network. When the NAT function is not co-located with the mobile access gateway, offloaded traffic flows must be delivered through the local access network between the mobile access gateway and the NAT function, for example, through a VLAN or a point-to-point link. The exact means for this delivery are outside the scope of this document. If the offloaded IPv4 flows are for local service access and reverse traffic from the local service device can be routed to the mobile node through the mobile access gateway, the offloaded flows may be delivered directly to a local service device.",
      "ja": "図1は、アクセスネットワーク内のモバイル・アクセス・ゲートウェイは、モビリティセッションのIPv4トラフィックをオフロードサポートを可能にしたシナリオを示します。オフロードの決定は、それがホームネットワーク内のローカル・モビリティ・アンカーと交渉したIPv4トラフィックのオフロード・ポリシーに基づいています。たとえば、すべてのHTTPフローがモバイル・アクセス・ゲートウェイにオフロードすることができ、そのモビリティセッションの他のすべてのフローがローカル・モビリティ・アンカーに戻ってトンネルされます。オフロードフローは通常、NATが変換する必要があり、この仕様は、NAT機能の場所に制限はありません。 NAT機能は、モバイル・アクセス・ゲートウェイと同じ場所に配置またはアクセスネットワークのエッジにどこかに配置されることが可能です。 NAT機能は、モバイル・アクセス・ゲートウェイと同じ場所に配置されていない場合、トラフィックフローがVLANまたはポイントツーポイントリンクを介して、例えば、モバイルアクセスゲートウェイとNAT機能との間のローカル・アクセス・ネットワークを介して配信されなければならないオフロード。この送達のための正確な手段は、この文書の範囲外です。オフロードのIPv4フローがモバイル・アクセス・ゲートウェイを介して移動ノードにルーティングすることができるローカル・サービス・デバイスからローカル・サービスへのアクセス及び逆方向トラフィックのためのものである場合、オフロードフローは、ローカル・サービス・デバイスに直接送達されてもよいです。"
    },
    {
      "indent": 3,
      "text": "The traffic selectors in the IPv4 traffic offload policy are used to classify the traffic, so it can be offloaded at the access network. These parameters include source IP address, destination IP address, TCP/UDP port numbers, and other fields. The format of the IPv4 binary traffic selector is specified in Section 3.1 of [RFC6088].",
      "ja": "IPv4のトラフィックオフロードポリシーのトラフィックセレクタは、トラフィックを分類するために使用されているので、アクセスネットワークにオフロードすることができます。これらのパラメータは、送信元IPアドレス、宛先IPアドレス、TCP / UDPポート番号、およびその他のフィールドが含まれます。 IPv4のバイナリトラフィックセレクタのフォーマットは、[RFC6088]のセクション3.1で指定されています。"
    },
    {
      "indent": 6,
      "text": "                                _----_\n                              _(      )_\n           :-----------------( Internet )---------------:\n           |                  (_      _)                |\n           |                    '----'                  |\n           |                                            |\n           :                                            |\n(IPv4 Traffic Offload Point)                            |\n           :                                            |\n           |                                            |\n........................................................|....\n           |                              |             |\n+--------+ |                   +---------------------+  |\n|  Local | |                   | Services requiring  |  |\n|Services| |                   | mobility, or service|  |\n+--------+ |                   | treatment           |  |\n     |     |                   +---------------------+  |\n     |   +---+                            |             |\n     |   |NAT|                            |             |\n     |   +---+                            |             |\n     +-----|            _----_            |             |\n        +-----+       _(      )_       +-----+          |\n[MN]----| MAG |======(    IP    )======| LMA |----------\n        +-----+       (_      _)       +-----+  Internet\n                        '----'\n                           .\n                           .\n    [Access Network]       .        [Home Network]\n..........................................................",
      "raw": true
    },
    {
      "indent": 13,
      "text": "Figure 1: IPv4 Traffic Offload Support at the MAG",
      "ja": "図1：MAGでのIPv4トラフィックオフロードのサポート"
    },
    {
      "indent": 3,
      "text": "Figure 2 explains the operational sequence of the Proxy Mobile IPv6 protocol signaling message exchange between the mobile access gateway (MAG) and the local mobility anchor (LMA) for negotiating the IPv4 traffic offload selectors. The details related to DHCP transactions or Router Advertisements on the access link are not shown here as that is not the key focus of this specification. The use of IPv4 Traffic Selector option in the Proxy Binding Update is for allowing the MAG to request the LMA for the IPv4 traffic offload policy.",
      "ja": "図2は、IPv4トラフィックオフロードセレクタを交渉するためのモバイル・アクセス・ゲートウェイ（MAG）およびローカル・モビリティ・アンカー（LMA）との間のメッセージ交換のシグナリングプロキシモバイルIPv6プロトコルの動作シーケンスを説明します。それがこの仕様の重要な焦点ではないとして、アクセスリンク上でDHCPトランザクションまたはルータ広告に関連する詳細はここでは示されていません。プロキシバインディング更新中のIPv4トラフィックセレクタオプションを使用すると、MAGは、IPv4トラフィックのオフロード・ポリシーのLMAを要求することを可能にするためです。"
    },
    {
      "indent": 6,
      "text": "MN    MAG(NAT)   LMA\n|------>|        |    1.  Mobile Node Attach\n|       |------->|    2.  Proxy Binding Update (IPv4TS)\n|       |<-------|    3.  Proxy Binding Acknowledgement (IPv4TS)\n|       |========|    4.  Tunnel/Route Setup\n|       +        |    5.  Installing the traffic offload rules\n|------>|        |    6.  IPv4 packet from mobile node\n|       +        |    7.  Offload rule applied (Tunnel/offload)\n|       |        |",
      "raw": true
    },
    {
      "indent": 11,
      "text": "Figure 2: Exchange of IPv4 Traffic Offload Selectors",
      "ja": "図2：IPv4のトラフィックオフロードセレクタの交換"
    },
    {
      "indent": 0,
      "text": "3.1. IPv4 Traffic Offload Selector Option",
      "section_title": true,
      "ja": "3.1。 IPv4のトラフィックオフロードセレクター・オプション"
    },
    {
      "indent": 3,
      "text": "A new mobility option, the IPv4 Traffic Offload Selector option (53), is defined for use in Proxy Binding Update (PBU) and Proxy Binding Acknowledgement (PBA) messages exchanged between a mobile access gateway and a local mobility anchor. This option is used for carrying the IPv4 traffic offload policy. This policy identifies the IPv4 traffic flow selectors that can be used by the mobile access gateway for enforcing the offload policy.",
      "ja": "新しいモビリティオプションはIPv4トラフィックオフロードセレクタオプション（53）は、確認応答（PBA）メッセージをバインディングアップデート（PBU）およびプロキシプロキシバインディングで使用するために定義されたモバイルアクセスゲートウェイと地元の移動性アンカーの間で交換。このオプションは、IPv4トラフィックのオフロードポリシーを実施するために使用されます。このポリシーは、オフロード・ポリシーを実施するためのモバイル・アクセス・ゲートウェイによって使用することができるIPv4トラフィックフローセレクタを識別する。"
    },
    {
      "indent": 3,
      "text": "The alignment requirement for this option is 4n.",
      "ja": "このオプションのアライメント要件は4Nです。"
    },
    {
      "indent": 3,
      "text": "0                   1                   2                   3\n0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n                                +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n                                |      Type     |   Length      |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|M|                         Reserved                            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                  Traffic Selector Sub-option   ...\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 14,
      "text": "Figure 3: IPv4 Traffic Offload Selector Option",
      "ja": "図3：IPv4のトラフィックオフロードセレクター・オプション"
    },
    {
      "indent": 3,
      "text": "Type 53",
      "ja": "タイプ53"
    },
    {
      "indent": 3,
      "text": "Length 8-bit unsigned integer indicating the length in octets of the option, excluding the type and length fields.",
      "ja": "タイプと長さフィールドを除いたオプションのオクテットの長さを示す長さ8ビットの符号なし整数。"
    },
    {
      "indent": 3,
      "text": "Offload Mode (M) Flag This field indicates the offload mode.",
      "ja": "このフィールドは、オフロードモードを示すモード（M）フラグをオフロード。"
    },
    {
      "indent": 9,
      "text": "If the (M) flag value is set to a value of (0), it is an\nindication that the IPv4 flow(s) that match the traffic\nselectors in the Traffic Selector sub-option [RFC6089] and that\nare associated to that mobility session have to be offloaded at\nthe mobile access gateway.  All the other IPv4 flows associated\nwith that mobility session and not matching the traffic\nselectors have to be tunneled to the local mobility anchor.",
      "raw": true
    },
    {
      "indent": 9,
      "text": "If the (M) flag value is set to a value of (1), it is an indication that all the IPv4 flows associated to that mobility session except the IPv4 flow(s) matching the traffic selectors in the Traffic Selector sub-option have to be offloaded at the mobile access gateway. All the IPv4 flows associated with that mobility session and matching the traffic selectors have to be tunneled back to the local mobility anchor.",
      "ja": "（M）フラグ値を（1）の値に設定されている場合、それは、トラフィックセレクタサブオプション内のトラフィックセレクタ有すると一致するすべてのIPv4は、IPv4フロー（複数可）の代わりにモビリティセッションに関連付けられたフローことの指標でありますモバイル・アクセス・ゲートウェイにオフロードすることができます。すべてのIPv4は、その移動性セッションに関連付けられており、トラフィックセレクタは、ローカル・モビリティ・アンカーに戻ってトンネル化する必要が一致するフロー。"
    },
    {
      "indent": 3,
      "text": "Reserved This field is unused for now. The value MUST be initialized to 0 by the sender and MUST be ignored by the receiver.",
      "ja": "予約済みこのフィールドは今のところ未使用です。値は、送信者によって0に初期化しなければならなくて、受信機で無視しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Traffic Selector Sub-option The Traffic Selector sub-option includes the parameters used to match packets for a specific flow binding. This is an optional sub-option when the IPv4 Traffic Selector option is carried in a Proxy Binding Update message but is a mandatory sub-option when the IPv4 Traffic Selector option is carried in a Proxy Binding Acknowledgement message. The format of the Traffic Selector sub-option is defined in Section 4.2.1.4 of [RFC6089]. This sub-option includes a TS Format field, which identifies the format of the flow specification included in that sub-option. The values for that field are defined in Section 3 of [RFC6088] and are repeated here for completeness. When the value of the TS Format field is set to (1), the format that follows is the IPv4 binary traffic selector specified in Section 3.1 of [RFC6088], and that support is mandatory for this specification. The text specified in this section takes precedence over what is specified in [RFC6088] and [RFC6089].",
      "ja": "トラフィックセレクタサブオプショントラフィックセレクタサブオプションは、特異的結合のフローのためのパケットを一致させるために使用されるパラメータを含みます。これは、IPv4トラフィックセレクタオプションはProxy Binding Updateメッセージで運ばれる場合、オプションのサブオプションであるが、IPv4のトラフィックセレクタオプションはプロキシバインディング肯定応答メッセージで搬送されたときに必須のサブオプションです。トラフィックセレクタサブオプションのフォーマットは、[RFC6089]のセクション4.2.1.4で定義されています。このサブオプションは、そのサブオプションに含まれるフロー仕様のフォーマットを識別するTS形式フィールドを含みます。そのフィールドの値は、[RFC6088]のセクション3で定義され、完全性のためにここで繰り返されます。 TSフォーマットフィールドの値は、（1）に設定されている場合、次のフォーマットは、[RFC6088]のセクション3.1で指定されたIPv4バイナリトラフィックセレクタであり、その支持体は、本明細書のために必須です。このセクションで指定されたテキストは、[RFC6088]と[RFC6089]で指定されているものよりも優先されます。"
    },
    {
      "indent": 9,
      "text": "1: IPv4 binary traffic selector",
      "ja": "1：IPv4のバイナリトラフィックセレクタ"
    },
    {
      "indent": 9,
      "text": "2: IPv6 binary traffic selector (not used by this specification)",
      "ja": "2：IPv6のバイナリトラフィックセレクタ（本明細書では使用されません）"
    },
    {
      "indent": 0,
      "text": "3.2. MAG Considerations",
      "section_title": true,
      "ja": "3.2。 MAGの考慮事項"
    },
    {
      "indent": 3,
      "text": "o If the mobile access gateway is configured to enable IPv4 traffic offload support, then it includes the IPv4 Traffic Offload Selector option (Section 3.1) in the Proxy Binding Update message that it sends to the local mobility anchor. Optionally, the mobile access gateway can also propose a specific offload policy.",
      "ja": "モバイル・アクセス・ゲートウェイは、IPv4トラフィックのオフロードのサポートを有効に設定されている場合は、O、それはそれがローカル・モビリティ・アンカーに送信されたProxy Binding UpdateメッセージでのIPv4トラフィックオフロードセレクタオプション（3.1節）が含まれています。必要に応じて、モバイル・アクセス・ゲートウェイは、特定のオフロード・ポリシーを提案することができます。"
    },
    {
      "indent": 6,
      "text": "* The mobile access gateway MAY choose not to propose any specific IPv4 traffic offload policy but request the local mobility anchor for the offload policy. In this scenario, the IPv4 Traffic Offload Selector option that is carried in the Proxy Binding Update message does not include the Traffic Selector sub-option (see Section 3.1), and the (M) flag (see Section 3.1) in the option MUST be set to a value of (0). Including the IPv4 Traffic Offload Selector option in the Proxy Binding Update without the Traffic Selector sub-option serves as an indication that the mobile access gateway is not proposing any specific offload policy for that mobility session, but rather it makes a request to the local mobility anchor to provide the offload policy.",
      "ja": "*モバイルアクセスゲートウェイは、任意の特定のIPv4トラフィックのオフロードの方針を提案しないことを選択したが、オフロード・ポリシーのローカル・モビリティ・アンカーを要求することができます。このシナリオでは、トラフィックセレクタサブオプションが含まれていないProxy Binding Updateメッセージで運ばれたIPv4トラフィックオフロードセレクタオプション（セクション3.1を参照）しなければならず（M）フラグは、オプションで（セクション3.1を参照します） （0）の値に設定します。トラフィックセレクタのサブオプションは、モバイル・アクセス・ゲートウェイは、そのモビリティセッションのための任意の特定オフロードポリシーを提案していない、むしろそれはローカルモビリティに要求を行うことの指標としての役割を果たすことなく、プロキシバインディング更新中のIPv4トラフィックオフロードセレクタオプションを含みますオフロードのポリシーを提供するために、アンカー。"
    },
    {
      "indent": 6,
      "text": "* The mobile access gateway MAY choose to propose a specific IPv4 traffic offload policy by including the Traffic Selector sub-option in the IPv4 Traffic Offload Selector option (see Section 3.1). The specific details on how the mobile access gateway obtains the mobile node's IPv4 traffic offload policy are outside the scope of this document. When this offload policy is included in the Proxy Binding Update message, it serves as a proposal to the local mobility anchor. The local mobility anchor can override with its own offload policy, or it can agree to the proposed policy. The offload policy has to be translated to a set of selectors that can be used to match the mobile node's IP flows, and these selectors have to be carried in the Traffic Selector sub-option. The Traffic Selector sub-option MUST be constructed as specified in Section 4.2.1.4 of [RFC6089]. This sub-option includes a TS Format field, which identifies the format of the flow specification included in the sub-option. The values for that field and the corresponding message format are defined in Section 3.1 of [RFC6088]. Considerations from Section 3.1 apply with respect to setting the Offload Mode (M) flag.",
      "ja": "*モバイル・アクセス・ゲートウェイは、IPv4トラフィックオフロードセレクタオプション（3.1節を参照）でのトラフィックセレクタサブオプションを含むことにより、特定のIPv4トラフィックのオフロード政策を提案することを選択するかもしれません。モバイル・アクセス・ゲートウェイは、移動ノードのIPv4トラフィックのオフロードポリシーを取得する方法について具体的な詳細は、このドキュメントの範囲外です。このオフロード・ポリシーは、プロキシバインディング更新メッセージに含まれている場合は、ローカル・モビリティ・アンカーへの提案として機能します。ローカル・モビリティ・アンカーは、独自のオフロードポリシーをオーバーライドすることができ、またはそれは、提案されたポリシーに同意することができます。オフロードのポリシーでは、モバイルノードのIPフローを一致させるために使用することができセレクタのセットに変換する必要があり、これらのセレクタは、トラフィックセレクタサブオプションで運ばなければなりません。 [RFC6089]のセクション4.2.1.4で指定されたトラフィックセレクタサブオプションが構成されなければなりません。このサブオプションは、サブオプションに含まれるフロー仕様のフォーマットを識別するTS形式フィールドを含みます。そのフィールドの値と対応するメッセージフォーマットは、[RFC6088]のセクション3.1で定義されています。セクション3.1からの考察はオフロードモード（M）フラグをセットに対して適用します。"
    },
    {
      "indent": 3,
      "text": "o When sending a Proxy Binding Update either for Binding Lifetime Extension or for Binding De-Registration, the mobile access gateway SHOULD copy the IPv4 Traffic Offload Selector option from the initial Proxy Binding Update message. Considerations from Sections 6.9.1.3 and 6.9.1.4 of [RFC5213] MUST be applied.",
      "ja": "長寿命化を結合するためまたは登録解除を結合するためのいずれかのプロキシバインディングアップデートを送信する際、O、モバイル・アクセス・ゲートウェイは、最初のプロキシバインディング更新メッセージからのIPv4トラフィックオフロードセレクタオプションをコピーする必要があります。 [RFC5213]のセクション6.9.1.3および6.9.1.4からの考察が適用されなければなりません。"
    },
    {
      "indent": 3,
      "text": "o If the mobile access gateway is not configured to support IPv4 traffic offload support as specified in this specification, but if the received Proxy Binding Acknowledgement message has the IPv4 Traffic Offload Selector option, then the mobile access gateway MUST ignore the option and process the rest of the message as per [RFC5213].",
      "ja": "Oモバイル・アクセス・ゲートウェイは、本明細書で指定されているIPv4トラフィックをオフロードサポートをサポートするように構成されていないが、受信されたProxy Binding Acknowledgementメッセージは、IPv4トラフィックオフロードセレクタオプションがある場合、モバイル・アクセス・ゲートウェイは、オプションを無視し、残りの部分を処理する必要がある場合[RFC5213]の通りメッセージの。"
    },
    {
      "indent": 3,
      "text": "o If there is no IPv4 Traffic Offload Selector option in the Proxy Binding Acknowledgement message received from the local mobility anchor, it is an indication that the local mobility anchor did not enable IPv4 traffic offload support for that mobility session. Upon accepting the Proxy Binding Acknowledgement message, the mobile access gateway SHOULD NOT enable IPv4 traffic offload support for that mobility session.",
      "ja": "ローカル・モビリティ・アンカーから受信したプロキシBinding AcknowledgementメッセージにはIPv4のトラフィックオフロードセレクタオプションがない場合は、O、ローカル・モビリティ・アンカーは、その移動性セッションのIPv4トラフィックのオフロードのサポートを有効にしなかったことを示しています。プロキシ・バインディング確認メッセージを受け付けると、モバイル・アクセス・ゲートウェイは、モビリティセッションのIPv4トラフィックオフロードのサポートを有効にしないでください。"
    },
    {
      "indent": 3,
      "text": "o If there is an IPv4 Traffic Offload Selector option in the Proxy Binding Acknowledgement message, then the mobile access gateway SHOULD enable IPv4 traffic offload support for that mobility session. The mobility access gateway has to provision the data plane using the flow selectors present in the Traffic Selector sub-option. The IPv4 flows matching the flow selectors have to be offloaded or tunneled back based to the local mobility anchor based on the value of the Offload Mode (M) flag (see Section 3.1).",
      "ja": "プロキシBinding Acknowledgementメッセージ内のIPv4トラフィックオフロードセレクタオプションがある場合は、O、モバイル・アクセス・ゲートウェイは、その移動性セッションのためのIPv4トラフィックのオフロードのサポートを有効にする必要があります。モビリティ・アクセス・ゲートウェイは、プロビジョニングデータプレーントラフィックセレクタサブオプションで本フローセレクタを使用しなければなりません。 IPv4のフローセレクタ（セクション3.1を参照）バックオフロードモード（M）フラグの値に基づいて、ローカル・モビリティ・アンカーに基づくオフロード又はトンネリングする必要が一致流れます。"
    },
    {
      "indent": 0,
      "text": "3.3. LMA Considerations",
      "section_title": true,
      "ja": "3.3。 LMAの考慮事項"
    },
    {
      "indent": 3,
      "text": "o If the received Proxy Binding Update message does not include the IPv4 Traffic Offload Selector option (Section 3.1), then the local mobility anchor MUST NOT enable IPv4 traffic offload support for that mobility session, and the Proxy Binding Acknowledgement message that will be sent in response MUST NOT contain the IPv4 Traffic Offload Selector option.",
      "ja": "O受信されたProxy Binding Updateメッセージは、ローカル・モビリティ・アンカーは、その移動性セッションのIPv4トラフィックのオフロードのサポートを有効にならない（MUST NOT）、IPv4のトラフィックオフロードセレクタオプション（3.1節）を含み、及びに送信されますプロキシBinding Acknowledgementメッセージしていない場合応答は、IPv4トラフィックオフロードセレクタオプションを含めることはできません。"
    },
    {
      "indent": 3,
      "text": "o If the Proxy Binding Update message includes the IPv4 Traffic Offload Selector option, but the local mobility anchor is not configured to support IPv4 traffic offload support, then the local mobility anchor will ignore the option and process the rest of the message as per [RFC5213]. This would have no effect on the operation of the rest of the protocol.",
      "ja": "プロキシバインディング更新メッセージは、IPv4トラフィックオフロードセレクタオプションが含まれていますが、ローカル・モビリティ・アンカーは、IPv4トラフィックのオフロードのサポートをサポートするように設定されていない場合は、O、その後、ローカル・モビリティ・アンカーは、オプションを無視して、[RFC5213に従ってメッセージの残りの部分を処理します]。これは、プロトコルの残りの部分の動作に影響を与えないだろう。"
    },
    {
      "indent": 3,
      "text": "o If the Proxy Binding Update message has the IPv4 Traffic Offload Selector option and if the local mobility anchor is configured to support IPv4 traffic offload support, then the local mobility anchor MUST enable IPv4 traffic offload support for that mobility session. The Proxy Binding Acknowledgement message that will be sent in response MUST include the IPv4 Traffic Offload Selector option. The following considerations apply with respect to constructing the IPv4 Traffic Offload Selector option.",
      "ja": "O場合は、プロキシバインディング更新メッセージは、IPv4トラフィックオフロードセレクタオプションを持っており、ローカル・モビリティ・アンカーは、IPv4トラフィックのオフロードのサポートをサポートするように設定されている場合、ローカルモビリティアンカーは、その移動性セッションのためのIPv4トラフィックのオフロードのサポートを有効にする必要があります。応答で送信されますプロキシBinding Acknowledgementメッセージは、IPv4トラフィックオフロードセレクタオプションを含まなければなりません。次の考慮事項は、IPv4トラフィックオフロードセレクタオプションの構築に関して適用されます。"
    },
    {
      "indent": 6,
      "text": "* The local mobility anchor can obtain the offload policy from the local configuration store or from a network function such as AAA (Authentication, Authorization, and Accounting) or PCRF (Policy and Charging Rule Function). The offload policy has to be translated to a set of selectors that can be used to match the mobile node's IP flows, and these selectors have to be carried in the Traffic Selector sub-option. The Traffic Selector sub-option MUST be constructed as specified in Section 4.2.1.4 of [RFC6089]. Considerations from Section 3.1 apply with respect to the Offload Mode (M) flag setting.",
      "ja": "*ローカル・モビリティ・アンカーは、ローカル構成ストアから、またはそのようなAAA（認証、許可、アカウンティング）またはPCRF（ポリシーおよび課金ルール機能）などのネットワーク機能からオフロードポリシーを取得することができます。オフロードのポリシーでは、モバイルノードのIPフローを一致させるために使用することができセレクタのセットに変換する必要があり、これらのセレクタは、トラフィックセレクタサブオプションで運ばなければなりません。 [RFC6089]のセクション4.2.1.4で指定されたトラフィックセレクタサブオプションが構成されなければなりません。セクション3.1からの考察はオフロードモード（M）フラグ設定に対して適用します。"
    },
    {
      "indent": 6,
      "text": "* If the Proxy Binding Update message includes a specific IPv4 traffic offload policy proposal in the form of the Traffic Selector sub-option [RFC6089], then the local mobility anchor MAY choose to agree to that request by including the same IPv4 traffic offload policy in the Proxy Binding Acknowledgement message. This implies the local mobility anchor has agreed to the IPv4 traffic offload policy provided by the mobile access gateway. The local mobility anchor MAY also choose to override the request by including a different IPv4 traffic offload policy that it wants the mobile access gateway to enforce for that mobility session. This is entirely based on the policy configuration on the local mobility anchor.",
      "ja": "プロキシバインディング更新メッセージは、トラフィックセレクタサブオプション[RFC6089]の形で特定のIPv4トラフィックのオフロードの政策提言が含まれている場合*は、ローカル・モビリティ・アンカーは、内の同じのIPv4トラフィックのオフロードのポリシーを含めることによって、その要求に同意することを選択するかもしれませんプロキシBinding Acknowledgementメッセージ。これは、ローカルモビリティ・アンカーは、モバイルアクセスゲートウェイが提供するのIPv4トラフィックのオフロードポリシーに同意した意味します。ローカル・モビリティ・アンカーはまた、モバイルアクセスゲートウェイが、その移動性セッションのために施行したい異なるIPv4トラフィックのオフロードポリシーを含むことによって、要求を上書きすることを選択するかもしれません。これは完全にローカル・モビリティ・アンカーのポリシー設定に基づいています。"
    },
    {
      "indent": 6,
      "text": "* The IPv4 traffic offload policy that is sent to the mobile access gateway has to be specific to the mobility session identified using the Mobile Node Identifier option [RFC5213]. The offload policy MUST be specific to a mobile node's application traffic. The traffic selectors have to match only the mobile node's application traffic and MUST NOT match any other mobile node's IP traffic. Furthermore, control-plane traffic such as DHCP, Neighbor Discovery (ND), or any other IP traffic that is used for IP address configuration, mobility management, or other control-plane functions MUST NOT be subject to offload.",
      "ja": "*モバイル・アクセス・ゲートウェイに送信されたIPv4トラフィックオフロードポリシーは、移動ノード識別子オプション[RFC5213]を使用して同定モビリティセッションに固有でなければなりません。オフロードのポリシーでは、モバイルノードのアプリケーショントラフィックに対応する必要があります。トラフィックセレクタは、モバイルノードのアプリケーショントラフィックと一致する必要が、他のモバイルノードのIPトラフィックと一致してはなりません。また、IPアドレスの設定、モビリティ管理、または他の制御プレーン機能のために使用されるようにDHCP、近隣探索（ND）、または他の任意のIPトラフィックなどの制御プレーントラフィックは、オフロードの対象であるはずがありません。"
    },
    {
      "indent": 6,
      "text": "* The local mobility anchor MUST NOT make any changes to the mobile node's offload policy during the middle of a mobility session, as long as the mobile node continues to attach to the mobile access gateway that negotiated the offload policy. However, when the mobile node performs an inter-MAG handover, the new mobile access gateway may not be capable of supporting IP Traffic offload and in this scenario, the offload policy may change. Therefore, the IPv4 Traffic Selector option with the Traffic Selector sub-option that is delivered during the initial mobility signaling MUST be the same as the one that is delivered as part of the mobility signaling related to lifetime extension from the same mobile access gateway.",
      "ja": "*ローカル・モビリティ・アンカーは、モバイルノードがオフロードポリシーを交渉し、モバイルアクセスゲートウェイに接続し続ける限り、モビリティセッションの途中で、移動ノードのオフロード・ポリシーに変更を加えてはなりません。しかしながら、モバイルノードがインターMAGハンドオーバを行う場合、新しいモバイル・アクセス・ゲートウェイは、オフロードとこのシナリオでは、オフロード・ポリシーが変更される可能性がありIPトラフィックをサポートすることができないかもしれません。したがって、初期のモビリティシグナリング中に送出されるトラフィックセレクタサブオプションを使用したIPv4トラフィックセレクタのオプションは同じモバイル・アクセス・ゲートウェイからの寿命延長に関連するモビリティシグナリングの一部として提供されるものと同じでなければなりません。"
    },
    {
      "indent": 0,
      "text": "4. Protocol Configuration Variables",
      "section_title": true,
      "ja": "4.プロトコルの構成変数"
    },
    {
      "indent": 3,
      "text": "This specification defines the following configuration variable that controls the IPv4 traffic offload support feature. This configuration variable is internal to the system and has no bearing on interoperability across different implementations.",
      "ja": "この仕様は、IPv4トラフィックのオフロード・サポート機能を制御し、次の設定変数を定義します。この構成変数は、システムの内部にあり、異なる実装間の相互運用性には関係ありません。"
    },
    {
      "indent": 3,
      "text": "The mobility entities, local mobility anchor, and the mobile access gateway have to allow these variables to be configured by the system management. The configured values for these protocol variables have to survive server reboots and service restarts.",
      "ja": "モビリティエンティティ、ローカル・モビリティ・アンカー、およびモバイル・アクセス・ゲートウェイは、これらの変数は、システム管理で設定することができるようにすることがあります。これらのプロトコル変数の設定された値は、サーバーが再起動し、サービスの再起動を生き残るために持っています。"
    },
    {
      "indent": 3,
      "text": "EnableIPv4TrafficOffloadSupport",
      "ja": "IPv4のトラフィックオフロードのサポートを有効にします"
    },
    {
      "indent": 9,
      "text": "This flag indicates whether or not IPv4 traffic offload support\nneeds to be enabled.  This configuration variable is available\nat both the mobile access gateway and the local mobility\nanchor.  The default value for this flag is set to (0),\nindicating that IPv4 traffic offload support is disabled.",
      "raw": true
    },
    {
      "indent": 9,
      "text": "When this flag on the mobile access gateway is set to a value of (1), the mobile access gateway has to enable IPv4 traffic offload support for all mobility sessions, by specifically requesting the IPv4 traffic offload policy from the local mobility anchor by including the IPv4 Traffic Offload Selector option in the Proxy Binding Update message. If the flag is set to a value of (0), the mobile access gateway has to disable IPv4 traffic offload support for all mobility sessions.",
      "ja": "モバイル・アクセス・ゲートウェイに、このフラグは、の値に設定されている場合（1）、モバイル・アクセス・ゲートウェイは、具体的に含めることにより、ローカル・モビリティ・アンカーからのIPv4トラフィックオフロードポリシーを要求することによって、すべてのモビリティセッションのIPv4トラフィックをオフロードサポートを有効にしなければなりませんプロキシバインディング更新メッセージ内のIPv4トラフィックオフロードセレクタオプション。フラグが（0）の値に設定されている場合、モバイル・アクセス・ゲートウェイは、すべてのモビリティセッションのIPv4トラフィックをオフロードサポートを無効にしなければなりません。"
    },
    {
      "indent": 9,
      "text": "Similarly, when this flag on the local mobility anchor is set to a value of (1), the local mobility anchor has to enable IPv4 traffic offload support. If the local mobility anchor chooses to enable IPv4 traffic offload support when there is an offload policy specified for a mobile node, it has to deliver the IPv4 traffic offload policy to the mobile access gateway by including the IPv4 Traffic Offload Selector option in the Proxy Binding Acknowledgement message.",
      "ja": "同様に、ローカル・モビリティ・アンカーにこのフラグが（1）の値に設定されている場合、ローカル・モビリティ・アンカーは、IPv4トラフィックをオフロードサポートを有効にしなければなりません。ローカル・モビリティ・アンカーは、IPv4トラフィックのオフロードのサポートを有効にすることを選択した場合、移動ノードに指定したオフロード・ポリシーがあるとき、それはバインディングプロキシでのIPv4トラフィックオフロードセレクタオプションを含めることによって、モバイルアクセスゲートウェイにIPv4トラフィックのオフロードポリシーを提供しています謝辞メッセージ。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "ja": "5. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "Per this specification, IANA has assigned a new mobility option: the IPv4 Traffic Offload Selector option (53). This option is described in Section 3.1. The Type value for this option has been assigned from the same numbering space as allocated for the other mobility options [RFC6275].",
      "ja": "IPv4のトラフィックオフロードセレクタオプション（53）：この仕様に従って、IANAは新しいモビリティオプションを割り当てています。このオプションは、セクション3.1に記載されています。他のモビリティオプション[RFC6275]に割り当てられたとして、このオプションのタイプ値は、同じ番号空間から割り当てられています。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "The IPv4 Traffic Offload Selector option defined in this specification is for use in Proxy Binding Update and Proxy Binding Acknowledgement messages. This option is carried like any other mobility header option as specified in [RFC5213]. Therefore, it inherits from [RFC5213] its security guidelines and does not require any additional security considerations. Carrying IPv4 traffic offload selectors does not introduce any new security vulnerabilities.",
      "ja": "この仕様で定義されたIPv4トラフィックオフロードセレクタオプションは、アップデートとプロキシバインディング確認メッセージをバインディングプロキシに使用するためのものです。 [RFC5213]で指定されるように、このオプションは、他のモビリティヘッダ・オプションと同様に行われます。したがって、それは[RFC5213]からのセキュリティガイドラインを継承し、追加のセキュリティ上の考慮を必要としません。 IPv4トラフィックのオフロードセレクターを搭載しても、新しいセキュリティの脆弱性を導入しません。"
    },
    {
      "indent": 3,
      "text": "When IPv4 traffic offload support is enabled for a mobile node, the mobile access gateway selectively offloads some of the mobile node's IPv4 traffic flows to the access network. Typically, these offloaded flows get NAT translated, which essentially introduces certain vulnerabilities that are common to any NAT deployment. These vulnerabilities and the related considerations have been well documented in the NAT specification [RFC2663]. There are no additional considerations above and beyond what has already been documented by the NAT specifications and that are unique to the approach specified in this document.",
      "ja": "IPv4トラフィックのオフロードのサポートは、モバイルノードのために有効にすると、モバイルアクセスゲートウェイを選択、移動ノードのIPv4トラフィックのいくつかは、アクセスネットワークに流れるオフロードします。一般的に、これらのオフロードのフローは、NAT、本質的に任意のNATの展開に共通する特定の脆弱性を導入する、変換されます。これらの脆弱性および関連の考察は十分NAT仕様[RFC2663]に記載されています。すでにNAT仕様で文書化され、それは、この文書で指定されたアプローチに固有のものされてきたものを上記と超えて追加の考慮事項はありません。"
    },
    {
      "indent": 3,
      "text": "The mobile node's home network may be equipped with firewall and other security devices to guard against any security threats. When IPv4 traffic offload support is enabled, it potentially exposes the mobile node to some security risks in the access network. This threat can be mitigated by deploying the security features both in the access network and in the home network.",
      "ja": "モバイルノードのホームネットワークは、セキュリティ上の脅威から保護するため、ファイアウォールなどのセキュリティ機器を装備することができます。 IPv4トラフィックのオフロードのサポートが有効になっている場合、それは潜在的にアクセスネットワーク内のいくつかのセキュリティリスクにモバイルノードを公開しています。この脅威は、アクセスネットワークで、ホームネットワーク内の両方のセキュリティ機能を導入することによって軽減することができます。"
    },
    {
      "indent": 3,
      "text": "When IPv4 traffic offload support is enabled for a mobile node, some of the IP flows are sent through the home network, and some other IP flows are routed through the access network. This potentially introduces some complexity with respect to enabling diagnostics or monitoring on the user traffic. The tools that are used for such diagnostics have to be aware of the offload policy that in enabled in the network.",
      "ja": "IPv4トラフィックのオフロードのサポートは、モバイルノードのために有効になっている場合は、IPフローの一部は、ホームネットワークを介して送信され、および他のいくつかのIPフローは、アクセスネットワークを介してルーティングされます。これは、潜在的な診断を可能にするか、ユーザトラフィックに監視に関して、いくつかの複雑さを紹介します。このような診断のために使用されるツールは、ネットワークで有効にオフロード政策を意識する必要があります。"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgements",
      "section_title": true,
      "ja": "7.謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Ahmad Muhanna, Basavaraj Patil, Carlos Bernardos, Eric Voit, Frank Brockners, Hidetoshi Yokota, Marco Liebsch, Mark Grayson, Pierrick Seite, Ryuji Wakikawa, Steve Wood, Barry Leiba, Sean Turner, Pete Resnick, Wesley Eddy, Mary Barnes, Vincent Roca, Ralph Droms, Scott Bradner, Stephen Farrell, Adrian Farrel, Benoit Claise, and Brian Haberman for all the reviews and discussions related to the topic of IPv4 traffic offload.",
      "ja": "著者はアフマドMuhanna、Basavarajパティル、カルロスBernardos、エリック・フォイト、フランクBrockners、横田英俊、マルコLiebsch、マーク・グレイソン、Pierrick Seite、隆次Wakikawa、スティーブ・ウッド、バリー・レイバ、ショーン・ターナー、ピート・レズニック、ウェズリーエディに感謝したいと思います、IPv4トラフィックのオフロードのトピックに関連するすべてのレビューや議論のためのメアリー・バーンズ、ヴィンセントロカ、ラルフDroms、スコット・ブラッドナー、スティーブン・ファレル、エードリアンファレル、ブノワClaise、そしてブライアンハーバーマン。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8.参照文献"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "ja": "8.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC5213] Gundavelli, S., Leung, K., Devarapalli, V., Chowdhury, K., and B. Patil, \"Proxy Mobile IPv6\", RFC 5213, August 2008.",
      "ja": "[Ramphsi 5213] gundavelli、S。、Leunjiは、K.、Devarapalliは、VEの。、Chaudhuriの、K.、aとb。パティル、 \"プロキシモバイル20 6\"、rphak 5213、2008年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC5844] Wakikawa, R. and S. Gundavelli, \"IPv4 Support for Proxy Mobile IPv6\", RFC 5844, May 2010.",
      "ja": "[RFC5844] Wakikawa、R.およびS. Gundavelli、 \"プロキシモバイルIPv6のIPv4サポート\"、RFC 5844、2010年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC6088] Tsirtsis, G., Giarreta, G., Soliman, H., and N. Montavont, \"Traffic Selectors for Flow Bindings\", RFC 6088, January 2011.",
      "ja": "\"フローバインディングのためのトラフィックセレクタ\" [RFC6088] Tsirtsis、G.、Giarreta、G.、ソリマン、H.、およびN. Montavont、RFC 6088、2011年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC6089] Tsirtsis, G., Soliman, H., Montavont, N., Giaretta, G., and K. Kuladinithi, \"Flow Bindings in Mobile IPv6 and Network Mobility (NEMO) Basic Support\", RFC 6089, January 2011.",
      "ja": "[RFC6089] Tsirtsis、G.、ソリマン、H.、Montavont、N.、Giaretta、G.、およびK. Kuladinithi、 \"モバイルIPv6やネットワークモビリティにおけるフローバインディング（NEMO）基本サポート\"、RFC 6089、2011年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC6275] Perkins, C., Johnson, D., and J. Arkko, \"Mobility Support in IPv6\", RFC 6275, July 2011.",
      "ja": "[RFC6275]パーキンス、C.、ジョンソン、D.、およびJ. Arkko、 \"IPv6におけるモビリティサポート\"、RFC 6275、2011年7月。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "ja": "8.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC2663] Srisuresh, P. and M. Holdrege, \"IP Network Address Translator (NAT) Terminology and Considerations\", RFC 2663, August 1999.",
      "ja": "[RFC2663] Srisuresh、P.とM.ホールドレッジ、 \"IPネットワークアドレス変換（NAT）用語と考慮事項\"、RFC 2663、1999年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC5101] Claise, B., \"Specification of the IP Flow Information Export (IPFIX) Protocol for the Exchange of IP Traffic Flow Information\", RFC 5101, January 2008.",
      "ja": "[RFC5101] Claise、B.、 \"IPトラフィックフロー情報を交換するためのIPフロー情報のエクスポート（IPFIX）プロトコルの仕様\"、RFC 5101、2008年1月。"
    },
    {
      "indent": 3,
      "text": "[TS23402] 3GPP, \"Architecture enhancements for non-3GPP accesses\", 2010.",
      "ja": "【TS23402] 3GPP 2010年、 \"非3GPPのためのアーキテクチャの機能拡張アクセス\"。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Sri Gundavelli (editor) Cisco 170 West Tasman Drive San Jose, CA 95134 USA",
      "ja": "スリランカGundavelli（エディタ）のCisco 170西タスマン・ドライブサンノゼ、CA 95134 USA"
    },
    {
      "indent": 3,
      "text": "EMail: sgundave@cisco.com",
      "ja": "メールアドレス：sgundave@cisco.com"
    },
    {
      "indent": 3,
      "text": "Xingyue Zhou ZTE Corporation No.68 Zijinghua Rd Nanjing China",
      "ja": "興月周ZT E法人no.68 Z Iの本質RDはNaN北京中国"
    },
    {
      "indent": 3,
      "text": "EMail: zhou.xingyue@zte.com.cn",
      "ja": "メールアドレス：zhou.xingyue@zte.com.cn"
    },
    {
      "indent": 3,
      "text": "Jouni Korhonen Renesas Mobile Porkkalankatu 24 Helsinki FIN-00180 Finland",
      "ja": "Jouni KorhonenルネサスモバイルPorkkalankatu 24 FIN-00180ヘルシンキフィンランド"
    },
    {
      "indent": 3,
      "text": "EMail: jouni.nospam@gmail.com",
      "ja": "メールアドレス：jouni.nospam@gmail.com"
    },
    {
      "indent": 3,
      "text": "Gaetan Feige Cisco France",
      "ja": "ガエタンFeigeシスコフランス"
    },
    {
      "indent": 3,
      "text": "EMail: gfeige@cisco.com",
      "ja": "メールアドレス：gfeige@cisco.com"
    },
    {
      "indent": 3,
      "text": "Rajeev Koodli Cisco 3650 Cisco Way San Jose, CA 95134 USA",
      "ja": "ラジーブKoodliのCisco 3650のCiscoウェイサンノゼ、CA 95134 USA"
    },
    {
      "indent": 3,
      "text": "EMail: rkoodli@cisco.com",
      "ja": "メールアドレス：rkoodli@cisco.com"
    }
  ]
}