{
  "title": {
    "text": "RFC 6946 - Processing of IPv6 \"Atomic\" Fragments",
    "ja": "RFC 6946 - IPv6の「アトミック」フラグメントの処理"
  },
  "number": 6946,
  "created_at": "2019-11-02 00:27:37.256872+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                           F. Gont\nRequest for Comments: 6946                           Huawei Technologies\nUpdates: 2460, 5722                                             May 2013\nCategory: Standards Track\nISSN: 2070-1721",
      "raw": true
    },
    {
      "indent": 17,
      "text": "Processing of IPv6 \"Atomic\" Fragments",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "The IPv6 specification allows packets to contain a Fragment Header without the packet being actually fragmented into multiple pieces (we refer to these packets as \"atomic fragments\"). Such packets are typically sent by hosts that have received an ICMPv6 \"Packet Too Big\" error message that advertises a Next-Hop MTU smaller than 1280 bytes, and are currently processed by some implementations as normal \"fragmented traffic\" (i.e., they are \"reassembled\" with any other queued fragments that supposedly correspond to the same original packet). Thus, an attacker can cause hosts to employ atomic fragments by forging ICMPv6 \"Packet Too Big\" error messages, and then launch any fragmentation-based attacks against such traffic. This document discusses the generation of the aforementioned atomic fragments and the corresponding security implications. Additionally, this document formally updates RFC 2460 and RFC 5722, such that IPv6 atomic fragments are processed independently of any other fragments, thus completely eliminating the aforementioned attack vector.",
      "ja": "IPv6仕様は、パケットが実際には複数枚（ここでは「アトミックフラグメント」とこれらのパケットを参照）に断片化されたパケットずにフラグメントヘッダを含むことができます。そのようなパケットは、典型的には、ネクストホップMTUをアドバタイズICMPv6の「パケット過大」エラーメッセージより小さい1280のバイトを受信したホストによって送信され、現在（すなわち、それらは「ある通常「断片化されたトラフィック」などのいくつかの実装によって処理されますおそらく）同じ元のパケットに対応する他のキューに入れられた断片と」再組み立て。このため、攻撃者は、ホストはICMPv6の「パケット過大」エラーメッセージを鍛造により、原子フラグメントを採用させ、その後、そのようなトラフィックに対して任意の断片化ベースの攻撃を開始することができます。この文書では、上記の原子フラグメントおよび対応するセキュリティ上の影響の生成を説明します。また、この文書は正式にRFC 2460及びRFC 5722には、IPv6の原子断片がこのように完全に前述の攻撃ベクトルを除去する、独立して、任意の他のフラグメントの処理されるように、更新します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6946.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6946で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2013 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2013 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Terminology .....................................................4\n3. Generation of IPv6 Atomic Fragments .............................4\n4. Updating RFC 2460 and RFC 5722 ..................................5\n5. Security Considerations .........................................6\n6. Acknowledgements ................................................6\n7. References ......................................................7\n   7.1. Normative References .......................................7\n   7.2. Informative References .....................................7\nAppendix A. Survey of Processing of IPv6 Atomic Fragments by\n            Different Operating Systems ............................8",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "[RFC2460] specifies the IPv6 fragmentation mechanism, which allows IPv6 packets to be fragmented into smaller pieces such that they fit in the Path-MTU to the intended destination(s). [RFC2460] allows fragments to overlap, thus leading to ambiguity in the result of the reassembly process, which could be leveraged by attackers to bypass firewall rules and/or evade Network Intrusion Detection Systems (NIDS) [RFC5722].",
      "ja": "[RFC2460]はIPv6パケットは、それらが意図された宛先（複数可）へのパスMTUに収まるように小片に断片化されることを可能にするのIPv6断片化機構を指定します。 [RFC2460]はこのように[RFC5722]をファイアウォールルールをバイパスし、および/またはネットワーク侵入検知システム（NIDS）を回避するために攻撃者によって利用することができる再構成プロセスの結果に曖昧さにつながる、断片が重複することを可能にします。"
    },
    {
      "indent": 3,
      "text": "[RFC5722] forbids overlapping fragments, specifying that when overlapping fragments are detected, all the fragments corresponding to that packet must be silently discarded.",
      "ja": "[RFC5722]は重複断片が検出された場合、そのパケットに対応するすべての断片が静かに捨てなければならないことを指定して、重複断片を禁止します。"
    },
    {
      "indent": 3,
      "text": "As specified in Section 5 of [RFC2460], when a host receives an ICMPv6 \"Packet Too Big\" message advertising a \"Next-Hop MTU\" smaller than 1280 (the minimum IPv6 MTU), it is not required to reduce the assumed Path-MTU, but must simply include a Fragment Header in all subsequent packets sent to that destination. The resulting packets will thus not actually be fragmented into several pieces but will just include a Fragment Header with both the \"Fragment Offset\" and the \"M\" flag set to 0 (we refer to these packets as \"atomic fragments\"). IPv6/IPv4 translators employ the Fragment Identification information found in the Fragment Header to select an appropriate Fragment Identification value for the resulting IPv4 fragments.",
      "ja": "[RFC2460]のセクション5で指定されたホストは、「ネクストホップMTU」より小さい1280（最小のIPv6 MTU）を広告ICMPv6の「パケット過大」メッセージを受信した場合、想定Path-を減少させるために必要とされませんMTUは、単にその宛先に送信されたすべての後続のパケットにフラグメントヘッダーを含める必要があります。得られたパケットは、このように、実際にいくつかの断片に断片化されませんが、単に「フラグメントオフセット」と0に設定された「M」フラグ（ここでは「アトミックフラグメント」とこれらのパケットを参照）の両方でフラグメントヘッダを含むであろう。 IPv6 / IPv4のトランスレータは、得られたIPv4フラグメントのための適切なフラグメント識別値を選択するために、フラグメントヘッダで見つかった断片識別情報を使用します。"
    },
    {
      "indent": 3,
      "text": "While these packets are really atomic fragments (they can be processed by the IPv6 module and handed to the upper-layer protocol without waiting for any other fragments), many IPv6 implementations process them as regular fragments. Namely, they try to perform IPv6 fragment reassembly with the atomic fragment and any other fragments already queued with the same set {IPv6 Source Address, IPv6 Destination Address, Fragment Identification}. For example, in the case of IPv6 implementations that have been updated to support [RFC5722], if a fragment with the same {IPv6 Source Address, IPv6 Destination Address, Fragment Identification} is already queued for reassembly at a host when an atomic fragment is received with the same set {IPv6 Source Address, IPv6 Destination Address, Fragment Identification}, and both fragments overlap, all the fragments will be silently discarded.",
      "ja": "これらのパケットは、本当にアトミック断片（彼らはIPv6モジュールによって処理され、任意の他のフラグメントを待たずに上位層プロトコルに渡すことができます）ですが、多くのIPv6実装は、通常の断片としてそれらを処理します。つまり、彼らはすでに、同じ集合{IPv6のソースアドレス、IPv6宛先アドレス、フラグメント識別}でキューに入れられ、原子フラグメントおよび他の断片とのIPv6フラグメント再構成を実行してみてください。例えば、[RFC5722]をサポートするように更新されたIPv6実装の場合には、同じ有する断片場合{たIPv6ソースアドレス、IPv6宛先アドレス、フラグメント同定}既に原子断片である場合、ホストでの再構成のためにキューイングされます同じ集合{IPv6ソースアドレス、IPv6宛先アドレスは、断片識別}で受信され、両断片が重なっ、すべてのフラグメントは、黙って破棄されます。"
    },
    {
      "indent": 3,
      "text": "Processing of IPv6 atomic fragments as regular fragmented packets clearly provides an unnecessary vector to perform fragmentation-based attacks against non-fragmented traffic (i.e., IPv6 datagrams that are not really split into multiple pieces but that just include a Fragment Header).",
      "ja": "定期的な断片化されたパケットとしてIPv6の原子断片の処理は、明らかに非断片化されたトラフィックに対するフラグメンテーションベースの攻撃を実行するために、不要なベクターを提供する（すなわち、実際に複数の部分に分割しかし、それは単にフラグメントヘッダを含むされていないIPv6データグラム）。"
    },
    {
      "indent": 3,
      "text": "IPv6 fragmentation attacks have been discussed in great detail in [PREDICTABLE-ID] and [CPNI-IPv6], and [RFC5722] describes a specific firewall-circumvention attack that could be performed by leveraging overlapping fragments. The possible IPv6 fragmentation-based attacks are, in most cases, \"ports\" of the IPv4 fragmentation attacks discussed in [RFC6274].",
      "ja": "IPv6の断片化攻撃は[予測可能-ID]と[CPNI-のIPv6]、およびに非常に詳細に議論されてきた[RFC5722]は重複断片を活用することによって行うことができ、特定のファイアウォール迂回攻撃を記述する。可能なIPv6の断片ベースの攻撃は、[RFC6274]で説明したIPv4フラグメンテーション攻撃のほとんどの場合、「ポート」です。"
    },
    {
      "indent": 3,
      "text": "Section 3 describes the generation of IPv6 atomic fragments and how they can be remotely \"triggered\" by a remote attacker. Section 4 formally updates [RFC2460] and [RFC5722] such that the aforementioned attack vector is eliminated. Appendix A contains a survey of the generation and processing of IPv6 atomic fragments in different versions of a number of popular IPv6 implementations.",
      "ja": "第3節では、IPv6、原子フラグメントの生成とそれらがどのようにリモートでリモートの攻撃者によって「トリガー」することができますについて説明します。セクション4正式アップデート[RFC2460]及び[RFC5722]前述の攻撃ベクトルが排除されるようになっています。付録Aには、人気のIPv6実装の数の異なるバージョンでのIPv6原子フラグメントの生成および処理の調査が含まれています。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "ja": "2.用語"
    },
    {
      "indent": 3,
      "text": "IPv6 atomic fragments: IPv6 packets that contain a Fragment Header with the Fragment Offset set to 0 and the M flag set to 0.",
      "ja": "IPv6の原子断片：0に設定され、Mフラグが0に設定されたオフセット断片とフラグメントヘッダを含むIPv6パケット。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はありますRFC 2119 [RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "3. Generation of IPv6 Atomic Fragments",
      "section_title": true,
      "ja": "IPv6の原子フラグメントの3世代"
    },
    {
      "indent": 3,
      "text": "Section 5 of [RFC2460] states:",
      "ja": "[RFC2460]の状態のセクション5："
    },
    {
      "indent": 6,
      "text": "\"In response to an IPv6 packet that is sent to an IPv4 destination (i.e., a packet that undergoes translation from IPv6 to IPv4), the originating IPv6 node may receive an ICMP Packet Too Big message reporting a Next-Hop MTU less than 1280. In that case, the IPv6 node is not required to reduce the size of subsequent packets to less than 1280, but must include a Fragment header in those packets so that the IPv6-to-IPv4 translating router can obtain a suitable Identification value to use in resulting IPv4 fragments. Note that this means the payload may have to be reduced to 1232 octets (1280 minus 40 for the IPv6 header and 8 for the Fragment header), and smaller still if additional extension headers are used.\"",
      "ja": "「IPv4の宛先に送信されるIPv6パケットに応答して（すなわち、IPv6からIPv4への変換を受けるパケット）1280未満のネクストホップMTUを報告するICMPパケット過大メッセージを受信することができる発信元IPv6ノード。その場合には、IPv6ノード未満1280に後続パケットのサイズを小さくする必要はないが、のIPv6からIPv4変換ルータがで使用するのに好適な識別値を取得することができるように、それらのパケットにフラグメントヘッダを含める必要がありますIPv4の断片を生じた。これは、追加の拡張ヘッダが使用される場合、ペイロードは依然として1232個のオクテット（1280マイナスIPv6ヘッダ及びフラグメントヘッダの8 40）に還元されなければならない、小さいできることを意味することに注意してください。」"
    },
    {
      "indent": 3,
      "text": "This means that any ICMPv6 \"Packet Too Big\" message advertising a \"Next-Hop MTU\" smaller than 1280 could trigger the generation of the so-called \"atomic fragments\" (i.e., IPv6 datagrams that include a Fragment Header but that are composed of a single fragment, with both the \"Fragment Offset\" and the \"M\" fields of the Fragment Header set to 0). This can be leveraged to perform a variety of fragmentation-based attacks [PREDICTABLE-ID] [CPNI-IPv6].",
      "ja": "これは、「ネクストホップMTUを」宣伝あらゆるICMPv6の「パケット過大」メッセージが1280よりも小さいが、いわゆる「アトミック断片」フラグメントヘッダーを含める（すなわち、IPv6データグラムの生成を誘発する可能性がありますが構成されていることを意味し「フラグメントオフセット」とフラグメントヘッダの「M」フィールドの両方を有する単一のフラグメントが、）0に設定されます。これは、[予測可能ID] [CPNI-のIPv6]フラグメンテーションベースの攻撃の多様を実行するために活用することができます。"
    },
    {
      "indent": 6,
      "text": "For example, an attacker could forge IPv6 fragments with an appropriate {IPv6 Source Address, IPv6 Destination Address, Fragment Identification} tuple, such that these malicious fragments are incorrectly \"reassembled\" by the destination host together with some of the legitimate fragments of the original packet, thus leading to packet drops (and a potential denial of service).",
      "ja": "例えば、攻撃者は、これらの悪質な断片が誤っオリジナルの合法的な断片の一部と共に宛先ホストによって「再組み立て」されるように、適切な{たIPv6ソースアドレス、IPv6宛先アドレスは、断片識別}タプルとIPv6のフラグメントを偽造することができパケット、これパケットドロップ（およびサービスの潜在的な拒否）につながります。"
    },
    {
      "indent": 3,
      "text": "From a security standpoint, this situation is exacerbated by the following factors:",
      "ja": "セキュリティの観点からは、このような状況は、以下の要因によって悪化します。"
    },
    {
      "indent": 3,
      "text": "o Many implementations fail to perform validation checks on the received ICMPv6 error messages, as recommended in Section 5.2 of [RFC4443] and documented in [RFC5927]. It should be noted that in some cases, such as when an ICMPv6 error message has (supposedly) been elicited by a connectionless transport protocol (or some other connectionless protocol being encapsulated in IPv6), it may be virtually impossible to perform validation checks on the received ICMPv6 error messages.",
      "ja": "[RFC4443]のセクション5.2で推奨及び[RFC5927]に記載されているようにO多くの実装は、受信したICMPv6エラーメッセージの検証チェックを実行することができません。このようなICMPv6エラーメッセージは、（おそらく）コネクションレス型トランスポートプロトコル（またはIPv6にカプセル化されているいくつかの他のコネクションレスプロトコル）によって誘発された、検証チェックを実行することは事実上不可能であるときなど、いくつかの場合には留意すべきですICMPv6エラーメッセージを受け取りました。"
    },
    {
      "indent": 3,
      "text": "o Upon receipt of one of the aforementioned ICMPv6 \"Packet Too Big\" error messages, the Destination Cache [RFC4861] is usually updated to reflect that any subsequent packets to that destination should include a Fragment Header. This means that a single ICMPv6 \"Packet Too Big\" error message might affect multiple communication instances (e.g., TCP connections) with that IPv6 destination address.",
      "ja": "O前述のICMPv6の「パケット過大」のいずれかのエラーメッセージを受信すると、送信先のキャッシュ[RFC4861]は、通常はその宛先への後続のパケットはフラグメントヘッダーを含むべきであることを反映するように更新されます。これは、単一のICMPv6の「パケット過大」エラーメッセージがそのIPv6宛先アドレスを持つ複数の通信インスタンス（例えば、TCP接続）に影響を与える可能性があることを意味します。"
    },
    {
      "indent": 3,
      "text": "o Some implementations employ predictable Fragment Identification values, thus greatly improving the chances of an attacker successfully performing fragmentation-based attacks [PREDICTABLE-ID].",
      "ja": "Oいくつかの実装は大幅[予測可能ID]正常フラグメンテーションベースの攻撃を行う攻撃の可能性を向上させる、予測可能な断片識別値を用います。"
    },
    {
      "indent": 1,
      "text": "4. Updating and",
      "section_title": true,
      "ja": "4.更新と"
    },
    {
      "indent": 3,
      "text": "Section 4.5 of [RFC2460] and Section 4 of [RFC5722] are updated as follows:",
      "ja": "次のように[RFC2460]と[RFC5722]のセクション4のセクション4.5が更新されます。"
    },
    {
      "indent": 6,
      "text": "A host that receives an IPv6 packet that includes a Fragment Header with the \"Fragment Offset\" equal to 0 and the \"M\" flag equal to 0 MUST process that packet in isolation from any other packets/fragments, even if such packets/fragments contain the same set {IPv6 Source Address, IPv6 Destination Address, Fragment Identification}. A received atomic fragment should be \"reassembled\" from the contents of that sole fragment.",
      "ja": "このようなパケット/断片が含まれている場合であっても、0に等しい「オフセットフラグメント」および他のパケット/フラグメントから分離にそのパケットを処理しなければならない0に等しい「M」フラグを有する断片ヘッダを含むIPv6パケットを受信したホスト同じ集合{のIPv6ソースアドレス、IPv6宛先アドレス、フラグメント識別}。受信された原子の断片は、その唯一のフラグメントの内容から「再組立て」でなければなりません。"
    },
    {
      "indent": 9,
      "text": "The Unfragmentable Part of the reassembled packet consists of all headers up to, but not including, the Fragment Header of the received atomic fragment.",
      "ja": "再構成されたパケットのフラグメント化不能一部までのすべてのヘッダーからなるが、受信された原子のフラグメントのフラグメントヘッダは、含みません。"
    },
    {
      "indent": 9,
      "text": "The Next Header field of the last header of the Unfragmentable Part of the reassembled packet is obtained from the Next Header field of the Fragment Header of the received atomic fragment.",
      "ja": "再構成されたパケットのフラグメント化不能部分の最後のヘッダの次ヘッダフィールドは、受信された原子のフラグメントのフラグメントヘッダの次ヘッダフィールドから得られます。"
    },
    {
      "indent": 9,
      "text": "The Payload Length of the reassembled packet is obtained by subtracting the length of the Fragment Header (that is, 8) from the Payload Length of the received atomic fragment.",
      "ja": "再構成されたパケットのペイロード長は、受信された原子フラグメントのペイロードの長さから（すなわち、8）フラグメントヘッダの長さを引いたものです。"
    },
    {
      "indent": 6,
      "text": "Additionally, if any fragments with the same set {IPv6 Source Address, IPv6 Destination Address, Fragment Identification} are present in the fragment reassembly queue when the atomic fragment is received, such fragments MUST NOT be discarded upon receipt of the \"colliding\" IPv6 atomic fragment, since IPv6 atomic fragments MUST NOT interfere with \"normal\" fragmented traffic.",
      "ja": "同じ集合{IPv6ソースアドレス、IPv6宛先アドレスは、断片識別}の任意のフラグメントは、原子断片が受信された断片再組み立てキューに存在する場合に加えて、そのような断片は、「衝突」のIPv6原子の受信時に廃棄してはいけませんフラグメント、IPv6の原子断片が「通常」の断片化されたトラフィックを妨害してはならないからです。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "This document describes how the traditional processing of IPv6 atomic fragments enables the exploitation of fragmentation-based attacks (such as those described in [PREDICTABLE-ID] and [CPNI-IPv6]). This document formally updates [RFC2460] and [RFC5722], such that IPv6 atomic fragments are processed independently of any other fragments, thus completely eliminating the aforementioned attack vector.",
      "ja": "この文書は、IPv6原子フラグメントの伝統的な処理（例えば、[予測可能ID]と[CPNI-のIPv6]に記載されているような）断片化ベースの攻撃の開発を可能にする方法について説明します。この文書では、正式に更新IPv6の原子断片がこのように完全に前述の攻撃ベクトルを排除する、任意の他の断片とは独立に処理されるように[RFC2460]及び[RFC5722]。"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgements",
      "section_title": true,
      "ja": "6.謝辞"
    },
    {
      "indent": 3,
      "text": "The author would like to thank (in alphabetical order) Tore Anderson, Ran Atkinson, Remi Despres, Stephen Farrell, Brian Haberman, Timothy Hartrick, Steinar Haug, Philip Homburg, Simon Josefsson, Simon Perreault, Sean Turner, Florian Weimer, and Bjoern A. Zeeb for providing valuable comments on earlier versions of this document. Additionally, the author would like to thank Alexander Bluhm, who implemented this specification for OpenBSD.",
      "ja": "著者（アルファベット順に）感謝したいと思いますが、アンダーソンをとれアトキンソン、レミ・デプレ、スティーブン・ファレル、ブライアンハーバーマン、ティモシーHartrick、Steinarハウグ、フィリップ・ホンブルク、サイモンJosefsson氏、サイモン・ペロー、ショーン・ターナー、フロリアンWeimerさん、そしてビョルンA蘭。このドキュメントの以前のバージョンで貴重なコメントを提供するためのゼエブ。さらに、著者は、OpenBSDのために、この仕様を実装アレクサンダーBluhmを、感謝したいと思います。"
    },
    {
      "indent": 3,
      "text": "This document is based on the technical report \"Security Assessment of the Internet Protocol version 6 (IPv6)\" [CPNI-IPv6], authored by Fernando Gont on behalf of the UK Centre for the Protection of National Infrastructure (CPNI).",
      "ja": "この文書は、国家インフラの保護に関する英国センター（CPNI）に代わってフェルナンドGontが執筆技術レポート「インターネットプロトコルバージョン6（IPv6）のセキュリティ評価」[CPNI-のIPv6]、に基づいています。"
    },
    {
      "indent": 3,
      "text": "Finally, the author wishes to thank Nelida Garcia and Guillermo Gont for their love and support.",
      "ja": "最後に、著者は彼らの愛とサポートのためNelidaガルシアとギジェルモGontに感謝したいです。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7.参考"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "ja": "7.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2460] Deering, S. and R. Hinden, \"Internet Protocol, Version 6 (IPv6) Specification\", RFC 2460, December 1998.",
      "ja": "[RFC2460]デアリング、S.とR. Hindenと、 \"インターネットプロトコルバージョン6（IPv6）の仕様\"、RFC 2460、1998年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC4443] Conta, A., Deering, S., and M. Gupta, \"Internet Control Message Protocol (ICMPv6) for the Internet Protocol Version 6 (IPv6) Specification\", RFC 4443, March 2006.",
      "ja": "[RFC4443]コンタ、A.、デアリング、S.、およびM.グプタ、 \"インターネットプロトコルバージョン6（IPv6）の仕様のためのインターネット制御メッセージプロトコル（ICMPv6の）\"、RFC 4443、2006年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC4861] Narten, T., Nordmark, E., Simpson, W., and H. Soliman, \"Neighbor Discovery for IP version 6 (IPv6)\", RFC 4861, September 2007.",
      "ja": "[RFC4861] Narten氏、T.、Nordmarkと、E.、シンプソン、W.、およびH.ソリマン、 \"IPバージョン6（IPv6）のための近隣探索\"、RFC 4861、2007年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC5722] Krishnan, S., \"Handling of Overlapping IPv6 Fragments\", RFC 5722, December 2009.",
      "ja": "[RFC5722]クリシュナン、S.、 \"重複のIPv6フラグメントの取り扱い\"、RFC 5722、2009年12月。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "ja": "7.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[CPNI-IPv6] Gont, F., \"Security Assessment of the Internet Protocol version 6 (IPv6)\", UK Centre for the Protection of National Infrastructure, (available on request).",
      "ja": "[CPNI-のIPv6] Gont、F.、「インターネットプロトコルバージョン6（IPv6）のセキュリティ評価」、国家インフラの保護のための英国センター（リクエストに応じてご利用いただけます）。"
    },
    {
      "indent": 3,
      "text": "[PREDICTABLE-ID] Gont, F., \"Security Implications of Predictable Fragment Identification Values\", Work in Progress, March 2013.",
      "ja": "[予測可能-ID] Gont、F.、「予測可能なフラグメント識別値によるセキュリティへの影響」、進歩、2013年3月での作業。"
    },
    {
      "indent": 3,
      "text": "[RFC5927] Gont, F., \"ICMP Attacks against TCP\", RFC 5927, July 2010.",
      "ja": "[RFC5927] Gont、F.、 \"TCPに対するICMP攻撃\"、RFC 5927、2010年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC6274] Gont, F., \"Security Assessment of the Internet Protocol Version 4\", RFC 6274, July 2011.",
      "ja": "[RFC6274] Gont、F.、 \"インターネットプロトコルバージョン4のセキュリティ評価\"、RFC 6274、2011年7月。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Survey of Processing of IPv6 Atomic Fragments by Different Operating Systems",
      "ja": "異なるオペレーティングシステムでのIPv6原子フラグメントの処理の付録A.調査"
    },
    {
      "indent": 3,
      "text": "This section includes a survey of the support of IPv6 atomic fragments in popular operating systems, as tested on October 30, 2012.",
      "ja": "2012年10月30日にテストしたように、このセクションでは、一般的なオペレーティングシステムでのIPv6原子フラグメントの支援の調査を含んでいます。"
    },
    {
      "indent": 3,
      "text": "+---------------------+---------------------+-----------------------+\n|   Operating System  |   Generates atomic  |    Implements this    |\n|                     |      fragments      |     specification     |\n+---------------------+---------------------+-----------------------+\n|     FreeBSD 8.0     |          No         |           No          |\n+---------------------+---------------------+-----------------------+\n|     FreeBSD 8.2     |         Yes         |           No          |\n+---------------------+---------------------+-----------------------+\n|     FreeBSD 9.0     |         Yes         |           No          |\n+---------------------+---------------------+-----------------------+\n|    Linux 3.0.0-15   |         Yes         |          Yes          |\n+---------------------+---------------------+-----------------------+\n|      NetBSD 5.1     |          No         |           No          |\n+---------------------+---------------------+-----------------------+\n|    NetBSD-current   |          No         |          Yes          |\n+---------------------+---------------------+-----------------------+\n|   OpenBSD-current   |         Yes         |          Yes          |\n+---------------------+---------------------+-----------------------+\n|      Solaris 11     |         Yes         |          Yes          |\n+---------------------+---------------------+-----------------------+\n|    Windows XP SP2   |         Yes         |           No          |\n+---------------------+---------------------+-----------------------+\n|    Windows Vista    |         Yes         |           No          |\n|     (Build 6000)    |                     |                       |\n+---------------------+---------------------+-----------------------+\n|    Windows 7 Home   |         Yes         |           No          |\n|       Premium       |                     |                       |\n+---------------------+---------------------+-----------------------+",
      "raw": true
    },
    {
      "indent": 6,
      "text": "Table 1: Processing of IPv6 Atomic Fragments by Different OSes",
      "ja": "表1：さまざまなOSによるIPv6の原子フラグメントの処理"
    },
    {
      "indent": 6,
      "text": "In the table above, \"generates atomic fragments\" notes whether an implementation generates atomic fragments in response to received ICMPv6 \"Packet Too Big\" error messages that advertise an MTU smaller than 1280 bytes.",
      "ja": "上記の表において、「原子フラグメントを生成する」実装1280バイトより小さいMTUを広告受信ICMPv6の「パケット過大」エラーメッセージに応答して、原子の断片を生成するかどうかを指摘しています。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Fernando Gont Huawei Technologies Evaristo Carriego 2644 Haedo, Provincia de Buenos Aires 1706 Argentina",
      "ja": "フェルナンドGont華為技術エバリスト・キャリエゴ2644 Haedo、ブエノスアイレス州アルゼンチン1706"
    },
    {
      "indent": 3,
      "text": "Phone: +54 11 4650 8472 EMail: fgont@si6networks.com",
      "ja": "電話：+54 11 4650 8472 Eメール：fgont@si6networks.com"
    }
  ]
}