{
  "title": {
    "text": "RFC 2912 - Indicating Media Features for MIME Content",
    "ja": "RFC 2912 - MIMEコンテンツのメディアの特徴を示します"
  },
  "number": 2912,
  "created_at": "2019-11-01 09:10:20.025507+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                           G. Klyne\nRequest for Comments: 2912                          Content Technologies\nCategory: Standards Track                                 September 2000",
      "raw": true
    },
    {
      "indent": 15,
      "text": "Indicating Media Features for MIME Content",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2000). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2000）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "In \"A Syntax for Describing Media Feature Sets\", an expression format is presented for describing media feature capabilities using simple media feature tags.",
      "ja": "で、「構文メディア機能セットを記述するための」表現形式は、単純なメディア特徴タグを使用してメディア機能能力を記述するために提示されます。"
    },
    {
      "indent": 3,
      "text": "This memo defines a Multipurpose Internet Mail Extensions (MIME) 'Content-features:' header that can be used to annotate a MIME message part using this expression format, and indicates some ways it might be used.",
      "ja": "このメモは、多目的インターネットメール拡張（MIME）「コンテンツの特徴：」定義ヘッダこの表現形式を使用してMIMEメッセージの一部に注釈を付けるために使用することができ、それが使用されるかもしれないいくつかの方法を示しています。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ...............................................  2\n   1.1 Terminology and document conventions ...................  2\n2. Motivation and goals .......................................  3\n3. The 'Content-features:' MIME header ........................  4\n   3.1 Whitespace and folding long headers ....................  4\n   3.2 Usage considerations ...................................  4\n     3.2.1 Simple message parts ...............................  4\n     3.2.2 Multipart and other composites .....................  5\n     3.2.3 Reference to external data .........................  5\n4. Examples ...................................................  5\n   4.1 Simple message .........................................  5\n   4.2 Fax message ............................................  6\n   4.3 Multipart/alternative data .............................  6\n   4.4 Reference to external message data .....................  8\n   4.5 Compressed data ........................................  8\n   4.6 Multipart/related data .................................  8\n5. Security Considerations ....................................  9\n6. Acknowledgements ........................................... 10\n7. References ................................................. 10\n8. Author's Address ........................................... 10\nFull Copyright Statement ...................................... 11",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "In \"A Syntax for Describing Media Feature Sets\" [1], an expression format is presented for describing media feature capabilities as a combination of simple media feature tags, registered according to \"Media Feature Tag Registration Procedure\" [2]. This provides a format for message handling agents to describe the media feature content of messages that they can handle.",
      "ja": "「構文メディア特徴セットを記述するための」[1]、表現形式が「メディア機能タグ登録手順」によれば、簡単なメディア特徴タグの組み合わせとしてメディア機能能力を説明するために提示登録されている[2]。これは、彼らが扱うことができるメッセージのメディア特徴量を記述するための薬剤を取り扱うメッセージのフォーマットを提供します。"
    },
    {
      "indent": 3,
      "text": "This memo defines a MIME 'Content-features:' header that can be used to annotate a MIME message part using these feature expressions. This header provides a means to indicate media-related features of message content that go beyond the MIME content type.",
      "ja": "このメモは、MIME「コンテンツ機能を」定義これらの機能表現を使用してMIMEメッセージの一部に注釈を付けるために使用することができるヘッダー。このヘッダは、MIMEコンテンツタイプを越えてメッセージコンテンツのメディア関連機能を示すための手段を提供します。"
    },
    {
      "indent": 3,
      "text": "Consideration is also given to how it may be used to present message media content information that is problematic to express within the basic MIME framework.",
      "ja": "考察は、基本的なMIMEフレームワーク内で発現させる問題があるメッセージのメディアコンテンツ情報を提供するために使用することができる方法が好ましいです。"
    },
    {
      "indent": 0,
      "text": "1.1 Terminology and document conventions",
      "section_title": true,
      "ja": "1.1用語とドキュメントの表記規則"
    },
    {
      "indent": 3,
      "text": "This section defines a number of terms and other document conventions, which are used with specific meaning in this memo.",
      "ja": "このセクションでは、用語とこのメモで特定の意味で使用されている他のドキュメント表記の数を定義します。"
    },
    {
      "indent": 3,
      "text": "media feature information that indicates facilities assumed to be available for the message content to be properly rendered or otherwise presented. Media features are not intended to include information that affects message transmission.",
      "ja": "メディアが正しくレンダリングされたまたは他の方法で提示されるメッセージ内容のために利用可能であると仮定施設を示す情報を備えています。メディア機能は、メッセージ送信に影響を与えた情報を含むことが意図されていません。"
    },
    {
      "indent": 3,
      "text": "feature set some set of media features described by a media feature assertion, as described in \"A Syntax for Describing Media Feature Sets\" [1]. (See that memo for a more formal definition of this term.)",
      "ja": "「メディア機能セットを記述するためのA構文」で説明したような特徴は、[1]、メディア機能アサーションによって記述されるメディアの機能のいくつかのセットを設定します。 （この用語のより正式な定義については、そのメモを参照してください。）"
    },
    {
      "indent": 3,
      "text": "feature set expression a string that describes some feature set, formulated according to the rules in \"A Syntax for Describing Media Feature Sets\" [1] (and possibly extended by other specifications).",
      "ja": "特徴[1]（およびおそらく他の仕様によって拡張）「メディア機能セットを記述するための構文」のルールに従って処方いくつかの機能セットを記述する文字列式を設定しました。"
    },
    {
      "indent": 3,
      "text": "This specification uses syntax notation and conventions described in RFC 2234 \"Augmented BNF for Syntax Specifications: ABNF\" [3].",
      "ja": "「：ABNF構文仕様のための増大しているBNF」[3]この仕様は、RFC 2234で説明した構文記法および規則を使用します。"
    },
    {
      "indent": 9,
      "text": "NOTE:  Comments like this provide additional nonessential\ninformation about the rationale behind this document.  Such\ninformation is not needed for building a conformant\nimplementation, but may help those who wish to understand the\ndesign in greater depth.",
      "raw": true
    },
    {
      "indent": 0,
      "text": "2. Motivation and goals",
      "section_title": true,
      "ja": "2.動機と目標"
    },
    {
      "indent": 3,
      "text": "It is envisaged that media feature labelling of message parts may be used in the following ways:",
      "ja": "メッセージ部分のメディア機能の標識は次のように使用されてもよいことが予想されます。"
    },
    {
      "indent": 3,
      "text": "o to supply more detailed media feature information about a message content than can be provided by the 'Content-type:' header.",
      "ja": "ヘッダ：oは「コンテンツタイプ」によって提供され得るよりもメッセージの内容に関する詳細なメディア機能の情報を提供します。"
    },
    {
      "indent": 3,
      "text": "o to provide summary media feature information (possibly including MIME content types) about the content of a composite MIME message part (e.g. 'multipart' or 'message'), without having to open up the inner content of the message.",
      "ja": "メッセージの内側の内容を開くことなく、複合MIMEメッセージ部分（例えば、「マルチパート」または「メッセージ」）の内容について（おそらくMIMEコンテンツタイプを含む）要約メディア機能情報を提供するために、O。"
    },
    {
      "indent": 3,
      "text": "o to supply media feature information about external data referenced by a message part (e.g. 'message/external-body' MIME type). This information would not be available by examination of the message content.",
      "ja": "Oは、メッセージ部分（例えば「メッセージ/外部ボディ」MIMEタイプ）によって参照される外部データについてのメディア機能の情報を提供します。この情報は、メッセージの内容を調べることによって利用できないでしょう。"
    },
    {
      "indent": 3,
      "text": "o to describe the content of a message that is encrypted or encoded using some application-specific file structure that hides the content from a MIME processor. This information also would not be generally available by examination of the message content.",
      "ja": "MIMEプロセッサからコンテンツを非表示にいくつかのアプリケーション固有のファイル構造を使用して暗号化または符号化されたメッセージの内容を説明するためのO。この情報は、メッセージの内容を調べることによって、一般的に利用できないでしょう。"
    },
    {
      "indent": 0,
      "text": "3. The 'Content-features:' MIME header",
      "section_title": true,
      "ja": "3.「コンテンツ・機能：」MIMEヘッダ"
    },
    {
      "indent": 3,
      "text": "A new header field is defined that extends the allowable formats for 'optional-field' [4] with the following syntax:",
      "ja": "新たなヘッダフィールドは、次の構文で「オプション・フィールド」[4]の許容形式を拡張するように定義されています。"
    },
    {
      "indent": 6,
      "text": "optional-field =/ \"Content-features\" \":\" Feature-expr Feature-expr = filter ; See [1], section 4.1",
      "ja": "オプションのフィールド= / \"のContent-機能\" \"：\" 機能-exprの機能-exprの=フィルタ。 [1]、4.1節を参照してください。"
    },
    {
      "indent": 3,
      "text": "where 'filter' is the media feature expression format defined by \"A Syntax for Describing Media Feature Sets\" [1].",
      "ja": "「フィルタ」は、「メディア機能セットを記述するための構文」で定義されたメディア特徴表現形式がどこにある[1]。"
    },
    {
      "indent": 3,
      "text": "This header provides additional information about the message content directly contained or indirectly referenced in the corresponding MIME message part.",
      "ja": "このヘッダは、直接対応するMIMEメッセージ部分に含まれる、または間接的に参照されるメッセージの内容に関する追加情報を提供します。"
    },
    {
      "indent": 0,
      "text": "3.1 Whitespace and folding long headers",
      "section_title": true,
      "ja": "3.1空白と折りたたみ長いヘッダー"
    },
    {
      "indent": 3,
      "text": "In some circumstances, media feature expressions can be very long.",
      "ja": "いくつかの状況では、メディア特徴式は非常に長くなることができます。"
    },
    {
      "indent": 3,
      "text": "According to \"A Syntax for Describing Media Feature Sets\" [1], whitespace is allowed between lexical elements of a media feature expression. Further, RFC822/MIME [4,5] allows folding of long headers at points where whitespace appears to avoid line length restrictions.",
      "ja": "「メディア機能セットの記述のための構文」[1]によれば、空白はメディア特徴表現の字句要素の間に許可されています。さらに、RFC822 / MIME [4,5]は空白の行の長さの制限を回避するように見える点で長いヘッダの折り畳みを可能にします。"
    },
    {
      "indent": 3,
      "text": "Therefore, it is recommended that whitespace is included as permitted, especially in long media feature expressions, to facilitate the folding of headers by agents that do not otherwise understand the syntax of this field.",
      "ja": "したがって、そうでない場合は、このフィールドの構文を理解していない物質によるヘッダの折りたたみを容易にするため、特に長いメディア特徴式で、許可されている空白が含まれていることをお勧めします。"
    },
    {
      "indent": 0,
      "text": "3.2 Usage considerations",
      "section_title": true,
      "ja": "3.2使用に関する注意事項"
    },
    {
      "indent": 0,
      "text": "3.2.1 Simple message parts",
      "section_title": true,
      "ja": "3.2.1シンプルなメッセージ部分"
    },
    {
      "indent": 3,
      "text": "When applied to a simple MIME message part, the header should appear just once and is used to convey additional information about the message part content that goes beyond that provided by the MIME 'Content-type:' header field. The 'Content-features:' header may indicate a content type that is different than that given by the MIME 'Content-type:' header. This is possible but not recommended when applied to a non-composite body part: in any case, MIME content type processing must be performed in accordance with the 'Content-type:' header.",
      "ja": "シンプルなMIMEメッセージ部分に適用された場合、ヘッダーは一度だけ表示されますとMIMEは「Content-type：」とによって提供されるものを超えたメッセージの一部のコンテンツに関する追加情報伝達に使用されたヘッダフィールドを。 'コンテンツ特徴は：「コンテンツタイプ：」ヘッダヘッダは、MIMEによって与えられたものとは異なるコンテンツタイプを示すことができます。これは可能であるが、非複合体の一部に適用された場合に推奨されない：ヘッダ：いずれの場合では、MIMEコンテンツタイプの処理は、「コンテンツタイプ」に従って実行されなければなりません。"
    },
    {
      "indent": 9,
      "text": "NOTE:  Once the message content has been delivered to an\napplication, it is possible that subsequent processing may be\naffected by content type information indicated by the media\nfeature expression.  See example 4.5 below.",
      "raw": true
    },
    {
      "indent": 0,
      "text": "3.2.2 Multipart and other composites",
      "section_title": true,
      "ja": "3.2.2マルチパートや他の複合材料"
    },
    {
      "indent": 3,
      "text": "'Content-features:' headers may be applied to a MIME multipart indicating information about the inner content of the multipart.",
      "ja": "「コンテンツ・機能：」ヘッダがマルチパートの内側のコンテンツに関する情報を示すMIMEマルチパートに適用することができます。"
    },
    {
      "indent": 3,
      "text": "Implementations must not assume a one-to-one relationship between 'Content-features' headers and contained body parts. Headers may appear on a containing multipart wrapper in a different order than the body parts to which they refer; a single header may refer to more than one contained body part; several headers may refer to the same contained body part.",
      "ja": "実装は「コンテンツ・機能」ヘッダと含まれている体の部分との間に1対1の関係を仮定してはいけません。ヘッダは、それらが参照れる身体の部分とは異なる順序で含むマルチ包装に表示されてもよいです。単一のヘッダが複数含まれている身体の部分を指すことができます。いくつかのヘッダは同じ含まれる身体部分を指すことができます。"
    },
    {
      "indent": 3,
      "text": "If it is important to relate specific media features to specific contained MIME body parts, then the 'Content-features:' header should be applied directly to the body part concerned, rather than the surrounding composite.",
      "ja": "それは特定のに特定のメディア機能に関連することが重要である場合MIME本体部分を含有し、「コンテンツ・機能：」ヘッダではなく、周囲の複合材料よりも、当該身体部位に直接適用されるべきです。"
    },
    {
      "indent": 9,
      "text": "NOTE:  The intent here is to allow summary media feature\ninformation to be provided without having to open up and\nexamine the inner content of the MIME message.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Similar usage may apply when the message format is a non-MIME or opaque composite; e.g. 'application/zip', or an encrypted message. In these cases, the option of examining the message content to discover media feature information is not available.",
      "ja": "メッセージフォーマットは、非MIMEまたは不透明な複合体である場合、同様の用法が適用されてもよいです。例えば「アプリケーション/ジップ」、または暗号化されたメッセージ。これらのケースでは、メディアの特徴情報を発見するために、メッセージの内容を検査するオプションは使用できません。"
    },
    {
      "indent": 0,
      "text": "3.2.3 Reference to external data",
      "section_title": true,
      "ja": "外部データへの3.2.3リファレンス"
    },
    {
      "indent": 3,
      "text": "Media feature information about data indirectly referenced by a MIME body part rather than contained within a message can be conveyed using one or more 'Content-features:' headers.",
      "ja": "ヘッダー：メディアは、間接的一つ以上の「コンテンツ・機能」を使用して搬送することができるメッセージ内のMIME本体部分によって参照されるのではなく含まれているデータに関する情報を備えています。"
    },
    {
      "indent": 3,
      "text": "For example, media information --including contained MIME content type(s)-- about the data referenced by a MIME 'Message/external-body' may be conveyed.",
      "ja": "例えば、メディア情報--including含まれるMIMEコンテンツタイプ（S） -  MIME「メッセージ/外部ボディ」によって参照されるデータについては、搬送されてもよいです。"
    },
    {
      "indent": 0,
      "text": "4. Examples",
      "section_title": true,
      "ja": "4.例"
    },
    {
      "indent": 0,
      "text": "4.1 Simple message",
      "section_title": true,
      "ja": "4.1シンプルなメッセージ"
    },
    {
      "indent": 6,
      "text": "Mime-Version: 1.0\nContent-type: text/plain;charset=US-ASCII\nContent-features: (& (paper-size=A4) (ua-media=stationery) )",
      "raw": true
    },
    {
      "indent": 6,
      "text": " : (data) :",
      "ja": "：（データ）："
    },
    {
      "indent": 0,
      "text": "4.2 Fax message",
      "section_title": true,
      "ja": "4.2ファックスメッセージ"
    },
    {
      "indent": 6,
      "text": "Mime-Version: 1.0\nContent-Type: multipart/mixed; boundary=\"break\"\nContent-features:\n  (& (Type=\"image/tiff\")\n     (color=Binary)\n     (image-file-structure=TIFF-S)\n     (dpi=200)\n     (dpi-xyratio=200/100)\n     (paper-size=A4)\n     (image-coding=MH) (MRC-mode=0)\n     (ua-media=stationery) )",
      "raw": true
    },
    {
      "indent": 6,
      "text": "--break Content-Type: image/tiff; name=\"coverpage.tiff\" Content-Transfer-Encoding: base64 Content-Description: This part is a coverpage Content-Disposition: attachment; filename=\"coverpage.tiff\"",
      "ja": "--breakのContent-Type：画像/ TIFF。名前= \"coverpage.tiff\" コンテンツ転送エンコード：base64でのContent-説明：この部分はの表紙のコンテンツディスポジションです：添付ファイル;ファイル名= \"coverpage.tiff\""
    },
    {
      "indent": 6,
      "text": "0M8R4KGxGuEAAAAAAAAAAAAAAAAAAAAAPgADAP7/CQAGAAAAAAAAAAAAAAA AAAAAAAAEAAAZAAAAAEAAAD+////AAAAAAAAAAD//////////////////// : (more data) : --break",
      "ja": "0M8R4KGxGuEAAAAAAAAAAAAAAAAAAAAAPgADAP7 / CQAGAAAAAAAAAAAAAAA AAAAAAAAEAAAZAAAAAEAAAD + //// AAAAAAAAAAD ////////////////////：（より多くのデータ）：--break"
    },
    {
      "indent": 6,
      "text": "Content-Type: image/tiff; name=\"document.tiff\" Content-Transfer-Encoding: base64 Content-Disposition: attachment; filename=\"document.tiff\"",
      "ja": "コンテンツタイプ：画像/ TIFF。名前=「document.tiff」コンテンツ転送エンコード：base64でコンテンツディスポジション：添付ファイル;ファイル名= \"document.tiff\""
    },
    {
      "indent": 6,
      "text": "AAAADgAAAA8AAAAQAAAAEQAAABIAAAATAAAAFAAAABUAAAAWAAAAFwAAABg GgAAABsAAAAcAAAAHQAAAB4AAAAfAAAAIAAAACEAAAAiAAAAIwAAACQAAAA : (more data) : --break--",
      "ja": "AAAADgAAAA8AAAAQAAAAEQAAABIAAAATAAAAFAAAABUAAAAWAAAAFwAAABg GgAAABsAAAAcAAAAHQAAAB4AAAAfAAAAIAAAACEAAAAiAAAAIwAAACQAAAA：（より多くのデータ）：--break--"
    },
    {
      "indent": 0,
      "text": "4.3 Multipart/alternative data",
      "section_title": true,
      "ja": "4.3マルチパート/代替データ"
    },
    {
      "indent": 3,
      "text": "This example illustrates three points:",
      "ja": "この例では、3つのポイントを示しています。"
    },
    {
      "indent": 3,
      "text": "o Information about the various parts in a multipart/alternative can be made available before the alternative body parts are processed. This may facilitiate optimum one-pass processing of multipart/alternative data.",
      "ja": "代替体の部分が処理される前に、Oマルチパート/代替のさまざまな部分についての情報が利用できるようにすることができます。これは、マルチパート/代替データの最適なパス処理をfacilitiateできます。"
    },
    {
      "indent": 3,
      "text": "o There may be alternatives having the same basic MIME content-type, but differing in the content features that they use.",
      "ja": "O選択肢同じ基本的なMIMEコンテンツタイプを持つが、彼らが使用するコンテンツ・機能が異なるがあるかもしれません。"
    },
    {
      "indent": 3,
      "text": "o There is NO defined correspondence between 'Content-features' headers and contained body parts.",
      "ja": "O NO「のContent-機能」ヘッダと含まれている体の部分との間の対応が定義されていません。"
    },
    {
      "indent": 6,
      "text": "Mime-Version: 1.0 Content-Type: multipart/alternative; boundary=\"break\" Content-features: (& (Type=\"text/plain\") (charset=US-ASCII) ) Content-features: (& (Type=\"text/html\") (charset=ISO-8859-1) (color=limited) ) Content-features: (& (Type=\"text/html\") (charset=ISO-8859-1) (color=binary) )",
      "ja": "マイム・バージョン：1.0のContent-Type：マルチパート/代替;境界= \"壊す\" コンテンツの特徴：（＆（タイプ= \"text / plainの\"）（文字セット= US-ASCII））コンテンツの特徴：（＆（タイプ= \"text / htmlの\"）（文字セット= ISO-8859- 1）（色））=限られたコンテンツの特徴：（＆（TYPE = \"text / htmlの\"）（文字セット= ISO-8859-1）（色=バイナリ））"
    },
    {
      "indent": 6,
      "text": "--break Content-type: \"text/plain\";charset=US-ASCII Content-features: (color=binary)",
      "ja": "--breakコンテンツタイプ： \"text / plainの\";のcharset = US-ASCIIコンテンツの特徴：（色=バイナリ）"
    },
    {
      "indent": 6,
      "text": " : (data) : --break Content-type: \"text/plain\";charset=US-ASCII Content-features: (color=limited)",
      "ja": "：（データ）：--breakコンテンツタイプ： \"text / plainの\";のcharset = US-ASCIIコンテンツの特徴：（色=限ります）"
    },
    {
      "indent": 6,
      "text": " : (data) : --break",
      "ja": "：（データ）：--break"
    },
    {
      "indent": 6,
      "text": "Content-type: text/html;charset=iso-8859-1 Content-features: (color=binary)",
      "ja": "コンテンツタイプ：text / htmlの;のcharset = ISO-8859-1コンテンツの特徴：（色=バイナリ）"
    },
    {
      "indent": 6,
      "text": " : (data) : --break Content-type: text/html;charset=iso-8859-1 Content-features: (color=limited)",
      "ja": "（データ）：--breakコンテンツタイプ：text / htmlの;のcharset = ISO-8859-1コンテンツの特徴：（色=限られました）"
    },
    {
      "indent": 6,
      "text": " : (data) : --break--",
      "ja": "：（データ）：--break--"
    },
    {
      "indent": 0,
      "text": "4.4 Reference to external message data",
      "section_title": true,
      "ja": "外部メッセージデータに4.4リファレンス"
    },
    {
      "indent": 6,
      "text": "Mime-Version: 1.0\nContent-type: message/external-body; access-type=URL;\n              URL=\"http://www.foo.com/file1.html\"",
      "raw": true
    },
    {
      "indent": 6,
      "text": "Content-type: Multipart/mixed Content-features: (& (Type=\"text/plain\") (charset=US-ASCII) ) Content-features: (& (Type=\"image/tiff\") (color=limited) )",
      "ja": "コンテンツタイプ：マルチパート/混合コンテンツの特徴：（＆（タイプ= \"text / plainの\"）（文字セット= US-ASCII））コンテンツの特徴：（＆（タイプ= \"画像/ TIFF\"）（色=限ります） ）"
    },
    {
      "indent": 6,
      "text": "<end>",
      "ja": "<終了>"
    },
    {
      "indent": 0,
      "text": "4.5 Compressed data",
      "section_title": true,
      "ja": "4.5圧縮データ"
    },
    {
      "indent": 3,
      "text": "This example shows how the 'Content-features' header can be used to overcome the problem noted in the MIME registration for 'Application/zip' regarding information about the data content.",
      "ja": "この例では、「コンテンツ・機能」ヘッダは、データ・コンテンツに関する情報について「アプリケーション/ ZIP」のMIME登録に注目問題を克服するために使用することができる方法を示しています。"
    },
    {
      "indent": 6,
      "text": "Mime-Version: 1.0 Content-type: application/zip Content-features: (& (Type=\"text/plain\") (charset=US-ASCII) ) Content-features: (& (Type=\"image/tiff\") (color=limited) ) Content-transfer-encoding: base64",
      "ja": "マイム・バージョン：1.0コンテンツタイプ：アプリケーション/ジップコンテンツの特徴：（＆（タイプ= \"text / plainの\"）（文字セット= US-ASCII））コンテンツの特徴：（＆（タイプ= \"画像/ TIFF\"） （色=限られた））コンテンツ転送エンコード：BASE64"
    },
    {
      "indent": 6,
      "text": " : (data) : <end>",
      "ja": "（データ）<終了>"
    },
    {
      "indent": 0,
      "text": "4.6 Multipart/related data",
      "section_title": true,
      "ja": "4.6マルチパート/関連データ"
    },
    {
      "indent": 3,
      "text": "(See also: RFC 2387, \"The MIME Multipart/Related Content-type\" [8])",
      "ja": "（参照：RFC 2387、 \"MIMEマルチパート/関連コンテンツタイプ\" [8]）"
    },
    {
      "indent": 6,
      "text": "Mime-Version: 1.0 Content-Type: multipart/related; boundary=\"boundary-example\"; type=\"text/html\"; start=\"<foo3@foo1@bar.net>\" Content-features: (& (type=\"text/html\") (charset=US-ASCII) ) Content-features: (type=\"image/gif\")",
      "ja": "マイム・バージョン：1.0のContent-Type：マルチパート/関連;境界=「境界例」。タイプ= \"text / htmlの\"; = \"<foo3 @ foo1の@ bar.net>\" コンテンツ・機能を起動します。（＆（タイプ= \"text / htmlの\"）（文字セット= US-ASCII））コンテンツの特徴：（タイプ= \"画像/ GIF\"）"
    },
    {
      "indent": 6,
      "text": "--boundary-example Content-Type: text/html;charset=US-ASCII Content-ID: <foo3@foo1@bar.net>",
      "ja": "--boundary-例のContent-Type：text / htmlの;のcharset = US-ASCIIのContent-ID：<foo3 @ foo1の@ bar.net>"
    },
    {
      "indent": 6,
      "text": "referencing a resource in another body part, for example through a statement such as: <IMG SRC=\"http://www.ietf.cnri.reston.va.us/images/ietflogo.gif\" ALT=\"IETF logo\">",
      "ja": "<IMG SRC =「http://www.ietf.cnri.reston.va.us/images/ietflogo.gif」ALT =「IETFロゴ」>：のようなステートメントを使用して、たとえば、他の身体の部分にリソースを参照します"
    },
    {
      "indent": 6,
      "text": "--boundary-example Content-Location: http://www.ietf.cnri.reston.va.us/images/ietflogo.gif Content-Type: IMAGE/GIF Content-Transfer-Encoding: BASE64",
      "ja": "--boundary-例のContent-場所：http://www.ietf.cnri.reston.va.us/images/ietflogo.gifのContent-Type：IMAGE / GIFコンテンツ転送 - エンコード：BASE64"
    },
    {
      "indent": 6,
      "text": "R0lGODlhGAGgAPEAAP/////ZRaCgoAAAACH+PUNvcHlyaWdodCAoQykgMTk5 NSBJRVRGLiBVbmF1dGhvcml6ZWQgZHVwbGljYXRpb24gcHJvaGliaXRlZC4A etc...",
      "ja": "R0lGODlhGAGgAPEAAP ///// ZRaCgoAAAACH + PUNvcHlyaWdodCAoQykgMTk5 NSBJRVRGLiBVbmF1dGhvcml6ZWQgZHVwbGljYXRpb24gcHJvaGliaXRlZC4A等..."
    },
    {
      "indent": 6,
      "text": "--boundary-example--",
      "ja": "--boundary-example--"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "When applied to simple or multipart MIME formatted data, a media feature expression provides summary information about the message data, which in many cases can be determined by examination of the message content. Under these circumstances, no additional security considerations appear to be raised.",
      "ja": "単純またはマルチパートMIMEフォーマットされたデータに適用した場合、メディア機能の発現は、多くの場合、メッセージの内容を検査することによって決定することができるメッセージ・データに関する要約情報を提供します。このような状況下では、追加のセキュリティ上の考慮事項が提起されるように表示されません。"
    },
    {
      "indent": 3,
      "text": "When applied to other message composites, especially encrypted message content, feature expressions may disclose information that is otherwise unavailable. In these cases, some security considerations associated with media content negotiation [1,2] may have greater relevance.",
      "ja": "他のメッセージの複合材料、特に暗号化されたメッセージの内容に適用すると、機能表現は、そうでなければ利用できない情報を開示することがあります。これらの場合では、メディアコンテンツネゴシエーション[1,2]に関連したいくつかのセキュリティ上の考慮事項は、より関連性を有していてもよいです。"
    },
    {
      "indent": 3,
      "text": "It is suggested here that media feature descriptions may be usefully employed with encrypted message content. In doing this, take care to ensure that the purpose of encryption is not compromised (e.g. encryption might be intended to conceal the fact that a particular application data format is being used, which fact might be disclosed by an injudiciously applied Content-features header).",
      "ja": "メディア機能の説明が有効に暗号化されたメッセージの内容を使用することができることをここで提案されます。これを行うには、暗号化の目的が損なわれないように注意してください（例：暗号化はinjudiciously応用によって開示されるかもしれないという事実、特定のアプリケーションのデータ・フォーマットが使用されているという事実を隠すために意図される可能性がありますヘッダーのContent-ています） 。"
    },
    {
      "indent": 3,
      "text": "If a 'Content-features' header is applied to a multipart/signed object (or indeed outside any other form of signed data) the media feature information is not protected. This unprotected information could be tampered with, possibly fooling implementations into doing inappropriate things with the contained material. (Putting the media feature information inside the signed information would overcome this, at the cost of requiring implementations to parse the inner structure to find it.)",
      "ja": "「コンテンツ・機能」ヘッダは、マルチパート/署名されたオブジェクト（または実際に外部署名されたデータの任意の他の形態）に適用した場合、メディアの特徴情報が保護されていません。この保護されていない情報は、おそらく含まれる物質で、不適切なことをやっに実装をだまし、改ざんすることができます。 （署名された内部情報をメディア特徴情報を置くことは、それを見つけるために、内部構造を解析するための実装を必要とする費用で、これを克服するであろう。）"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgements",
      "section_title": true,
      "ja": "6.謝辞"
    },
    {
      "indent": 3,
      "text": "This proposal draws from discussions with Dan Wing. The fax message example was taken from a proposal by Mike Ruhl. The multipart/related example is developed from RFC 2557 [7].",
      "ja": "この提案は、ダン・ウィングとの議論から描画します。ファックスメッセージの例は、マイク・リュールの提案から取られました。マルチパート/関連する例は、RFC 2557から開発されている[7]。"
    },
    {
      "indent": 3,
      "text": "The author would like to thank the following people who offered comments that led to significant improvements: Mr Hiroshi Tamura, Ted Hardie, Maurizio Codogno, Jacob Palme, Ned Freed.",
      "ja": "氏宏田村、テッドハーディー、マウリツィオコドーニョ、ヤコブパルメ、ネッドフリード：著者は大幅な改善につながったコメントを提供した以下の方々に感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7.参考"
    },
    {
      "indent": 3,
      "text": "[1] Klyne, G., \"A Syntax for Describing Media Feature Sets\", RFC 2533, March 1999.",
      "ja": "[1] \"メディア機能セットの記述のための構文\" Klyne、G.、RFC 2533を、1999年3月。"
    },
    {
      "indent": 3,
      "text": "[2] Holtman, K., Mutz, A. and T. Hardie, \"Media Feature Tag Registration Procedure\", RFC 2506, March 1999.",
      "ja": "[2] Holtman、K.、MUTZ、A.およびT.ハーディ、 \"メディア特徴タグの登録手順\"、RFC 2506、1999年3月。"
    },
    {
      "indent": 3,
      "text": "[3] Crocker, D. and P. Overell, \"Augmented BNF for Syntax Specifications: ABNF\", RFC 2234, November 1997.",
      "ja": "[3]クロッカー、D.、およびP. Overell、 \"構文仕様のための増大しているBNF：ABNF\"、RFC 2234、1997年11月。"
    },
    {
      "indent": 3,
      "text": "[4] Crocker, D., \"Standard for the format of ARPA Internet text messages\", STD 11, RFC 822, August 1982.",
      "ja": "[4]クロッカー、D.、 \"ARPAインターネットテキストメッセージの形式の規格\"、STD 11、RFC 822、1982年8月。"
    },
    {
      "indent": 3,
      "text": "[5] Freed, N. and N. Borenstein, \"Multipurpose Internet Mail Extensions (MIME) Part 1: Format of Internet message bodies\", RFC 2045, November 1996.",
      "ja": "[5]フリード、N.とN. Borenstein、 \"マルチパーパスインターネットメールエクステンション（MIME）パート1：インターネットメッセージ本体のフォーマット\"、RFC 2045、1996年11月。"
    },
    {
      "indent": 3,
      "text": "[6] Levinson, E., \"The MIME Multipart/Related Content-type\", RFC 2387, August 1998.",
      "ja": "[6]レビンソン、E.、 \"MIMEマルチパート/関連コンテンツ・タイプ\"、RFC 2387、1998年8月。"
    },
    {
      "indent": 3,
      "text": "[7] Palme, J., Hopmann, A. and N. Shelness, \"MIME Encapsulation of Aggregate Documents, such as HTML (MHTML)\", RFC 2557, March 1999.",
      "ja": "[7]パルメ、J.、Hopmann、A.及びN. Shelness、RFC 2557、1999マーチ \"は、HTML（MHTML）として集約文書のMIMEカプセル化\"。"
    },
    {
      "indent": 0,
      "text": "8. Author's Address",
      "section_title": true,
      "ja": "8.著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Graham Klyne Content Technologies Ltd. 1220 Parkview, Arlington Business Park Theale Reading, RG7 4SA United Kingdom",
      "ja": "グラハムKlyneコンテンツテクノロジ株式会社1220パークビュー、アーリントンビジネスパークTheale読書、RG7 4SAイギリス"
    },
    {
      "indent": 3,
      "text": "Phone: +44 118 930 1300 Fax: +44 118 930 1301 EMail: GK@ACM.ORG",
      "ja": "電話：+44 118 930 1300ファックス：+44 118 930 1301 Eメール：GK@ACM.ORG"
    },
    {
      "indent": 0,
      "text": "9. Full Copyright Statement",
      "section_title": true,
      "ja": "9.完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2000). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2000）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "了承"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}