{
  "title": {
    "text": "RFC 5788 - IMAP4 Keyword Registry",
    "ja": "RFC 5788 - IMAP4キーワードレジストリ"
  },
  "number": 5788,
  "created_at": "2023-02-09 09:17:45.812065+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                       A. Melnikov\nRequest for Comments: 5788                                   D. Cridland\nCategory: Standards Track                                  Isode Limited\nISSN: 2070-1721                                               March 2010",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 25,
      "text": "IMAP4 Keyword Registry",
      "ja": "IMAP4キーワードレジストリ"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "The aim of this document is to establish a new IANA registry for IMAP keywords and to define a procedure for keyword registration, in order to improve interoperability between different IMAP clients.",
      "ja": "このドキュメントの目的は、IMAPキーワードの新しいIANAレジストリを確立し、異なるIMAPクライアント間の相互運用性を向上させるために、キーワード登録の手順を定義することです。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準トラックドキュメントです。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントは、インターネットエンジニアリングタスクフォース（IETF）の製品です。IETFコミュニティのコンセンサスを表しています。公開レビューを受けており、インターネットエンジニアリングステアリンググループ（IESG）からの出版が承認されています。インターネット標準の詳細については、RFC 5741のセクション2で入手できます。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc5788.",
      "ja": "このドキュメントの現在のステータス、任意のERRATA、およびそのフィードバックを提供する方法に関する情報は、http：//www.rfc-editor.org/info/rfc5788で取得できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2010 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2010 IETF Trustおよび文書著者として特定された人。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "このドキュメントは、BCP 78およびIETFドキュメント（http://trustee.ietf.org/license-info）に関連するIETF Trustの法的規定の対象となります。この文書に関するあなたの権利と制限を説明するので、これらの文書を注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、セクション4.Eで説明されている法的規定のセクション4.Eで説明されており、単純化されたBSDライセンスで説明されているように保証なしで提供される簡略化されたBSDライセンステキストを含める必要があります。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Conventions Used in This Document ...............................2\n3. IANA Considerations .............................................3\n   3.1. Review Guidelines for the Designated Expert Reviewer .......4\n   3.2. Comments on IMAP Keywords' Registrations ...................5\n   3.3. Change Control .............................................5\n   3.4. Initial Registrations ......................................6\n        3.4.1. $MDNSent IMAP Keyword Registration ..................6\n        3.4.2. $Forwarded IMAP Keyword Registration ................7\n        3.4.3. $SubmitPending IMAP Keyword Registration ............8\n        3.4.4. $Submitted IMAP Keyword Registration ................9\n4. Security Considerations ........................................10\n5. Acknowledgements ...............................................10\n6. References .....................................................10\n   6.1. Normative References ......................................10\n   6.2. Informative References ....................................11",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "IMAP keywords [RFC3501] are boolean named flags that can be used by clients to annotate messages in an IMAP mailbox. Although IMAP keywords are an optional feature of IMAP, the majority of IMAP servers can store arbitrary keywords. Many mainstream IMAP clients use a limited set of specific keywords, and some can manage (create, edit, display) arbitrary IMAP keywords.",
      "ja": "IMAPキーワード[RFC3501]は、クライアントがIMAPメールボックスでメッセージに注釈するために使用できるブール式の名前のフラグです。IMAPキーワードはIMAPのオプション機能ですが、IMAPサーバーの大部分は任意のキーワードを保存できます。多くの主流のIMAPクライアントは、特定のキーワードの限られたセットを使用し、一部は任意のIMAPキーワードを管理（作成、編集、表示）できます。"
    },
    {
      "indent": 3,
      "text": "Over the years, some IMAP keywords have become de-facto standards, with some specific semantics associated with them. In some cases, different client implementors decided to define and use keywords with different names, but the same semantics. Some server implementors decided to map such keywords automatically in order to improve cross-client interoperability.",
      "ja": "長年にわたり、一部のIMAPキーワードはデファクト標準になり、いくつかの特定のセマンティクスが関連付けられています。場合によっては、異なるクライアントの実装者が異なる名前でキーワードを定義および使用することを決定しましたが、同じセマンティクスです。一部のサーバーの実装者は、交差クライアントの相互運用性を向上させるために、このようなキーワードを自動的にマッピングすることを決定しました。"
    },
    {
      "indent": 3,
      "text": "In other cases, the same keywords have been used with different semantics, thus causing interoperability problems.",
      "ja": "それ以外の場合、同じキーワードが異なるセマンティクスで使用されているため、相互運用性の問題を引き起こします。"
    },
    {
      "indent": 3,
      "text": "This document attempts to prevent further incompatible uses of IMAP keywords by establishing an \"IMAP Keywords\" registry and allocating a special prefix for standardized keywords.",
      "ja": "このドキュメントは、「IMAPキーワード」レジストリを確立し、標準化されたキーワードに特別なプレフィックスを割り当てることにより、IMAPキーワードのさらなる互換性のない使用を防止しようとします。"
    },
    {
      "indent": 0,
      "text": "2. Conventions Used in This Document",
      "section_title": true,
      "ja": "2. このドキュメントで使用されている規則"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [Kwds].",
      "ja": "「必須」、「そうしない」、「必須」、「必要」、「しない」、「そうしない」、「そうではない」、「そうでない」、「推奨」、「5月」、および「オプション」は、RFC 2119 [KWDS]に記載されているとおりに解釈されます。"
    },
    {
      "indent": 0,
      "text": "3. IANA Considerations",
      "section_title": true,
      "ja": "3. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has established a new registry for IMAP keywords.",
      "ja": "IANAは、IMAPキーワードの新しいレジストリを確立しました。"
    },
    {
      "indent": 3,
      "text": "Registration of an IMAP keyword is requested by filling in the following template and following the instructions on the IANA pages for the registry to submit it to IANA:",
      "ja": "IMAPキーワードの登録は、次のテンプレートに記入し、レジストリのIANAページの指示に従ってIANAに送信することにより要求されます。"
    },
    {
      "indent": 3,
      "text": "Subject: Registration of IMAP keyword X",
      "ja": "件名：IMAPキーワードxの登録"
    },
    {
      "indent": 3,
      "text": "IMAP keyword name:",
      "ja": "IMAPキーワード名："
    },
    {
      "indent": 3,
      "text": "Purpose (description):",
      "ja": "目的（説明）："
    },
    {
      "indent": 3,
      "text": "Private or Shared on a server: (One of PRIVATE, SHARED, or BOTH. PRIVATE means that each different user has a distinct copy of the keyword. SHARED means that all different users see the same value of the keyword. BOTH means that an IMAP server can have the keyword as either private or shared.)",
      "ja": "サーバー上のプライベートまたは共有：（プライベート、共有、またはその両方。プライベートとは、各異なるユーザーがキーワードの明確なコピーを持っていることを意味します。共有は、すべての異なるユーザーがキーワードの同じ値を見ることを意味します。サーバーは、プライベートまたは共有としてキーワードを持つことができます。）"
    },
    {
      "indent": 3,
      "text": "Is it an advisory keyword or may it cause an automatic action:",
      "ja": "アドバイザリーキーワードですか、それとも自動アクションを引き起こす可能性がありますか。"
    },
    {
      "indent": 3,
      "text": "When/by whom the keyword is set/cleared:",
      "ja": "いつ/誰によってキーワードが設定/クリアされます："
    },
    {
      "indent": 3,
      "text": "Related keywords: (for example, \"mutually exclusive with keywords Y and Z\")",
      "ja": "関連キーワード：（たとえば、「キーワードyとzを使用した相互に排他的」）"
    },
    {
      "indent": 3,
      "text": "Related IMAP capabilities:",
      "ja": "関連するIMAP機能："
    },
    {
      "indent": 3,
      "text": "Security considerations:",
      "ja": "セキュリティ上の考慮事項："
    },
    {
      "indent": 3,
      "text": "Published specification (recommended):",
      "ja": "公開された仕様（推奨）："
    },
    {
      "indent": 3,
      "text": "Person & email address to contact for further information:",
      "ja": "詳細については、連絡先への個人およびメールアドレス："
    },
    {
      "indent": 3,
      "text": "Intended usage: (One of COMMON, LIMITED USE, or DEPRECATED (i.e., not recommended for use))",
      "ja": "意図された使用法：（一般的な、限られた使用、または非推奨の1つ（つまり、使用が推奨されない））"
    },
    {
      "indent": 3,
      "text": "Owner/Change controller: (MUST be \"IESG\" for any \"common use\" keyword registration specified in an IETF Review document. See definition of \"common use\" below in this section. When the Owner/Change controller is not a Standardization Organization, the registration request MUST make it clear if the registration is controlled by a company, or the individual performing the registration.)",
      "ja": "所有者/変更コントローラー：（ IETFレビュードキュメントで指定された「一般的な使用」キーワード登録の「IESG」でなければなりません。このセクションの「共通使用」の定義を参照してください。所有者/変更コントローラーが標準化組織ではない場合、登録要求は、登録が会社によって管理されているか、登録を実行している個人が管理しているかどうかを明確にする必要があります。）"
    },
    {
      "indent": 3,
      "text": "Note: (Any other information that the author deems interesting may be added here, for example, if the keyword(s) is supported by existing clients.)",
      "ja": "注：（著者が興味深いと思うその他の情報は、既存のクライアントによってキーワードがサポートされている場合、ここに追加される場合があります。）"
    },
    {
      "indent": 3,
      "text": "Registration of an IMAP keyword requires Expert Review [RFC5226]. Registration of any IMAP keyword is initiated by posting a registration request to the Message Organization WG mailing list <morg@ietf.org> (or its replacement as chosen by the responsible Application Area Director) and CCing IANA (<iana@iana.org>). After allowing for at least two weeks for community input on the designated mailing list, the expert will determine the appropriateness of the registration request and either approve or disapprove the request with notice to the requestor, the mailing list, and IANA. Any refusal must come with a clear explanation.",
      "ja": "IMAPキーワードの登録には、専門家のレビュー[RFC5226]が必要です。IMAPキーワードの登録は、メッセージ組織wgメーリングリスト<morg@ietf.org>（または責任あるアプリケーションエリアディレクターが選択した代替）およびCCing iana（<iana@iana.org>>>その代替品）に登録要求を投稿することにより開始されます。）。指定されたメーリングリストでのコミュニティ入力のために少なくとも2週間許可された後、専門家は登録要求の適切性を決定し、リクエスター、メーリングリスト、およびIANAに通知してリクエストを承認または不承認にします。どんな拒否にも明確な説明が必要です。"
    },
    {
      "indent": 3,
      "text": "The IESG appoints one or more Expert Reviewers for the IMAP keyword registry established by this document.",
      "ja": "IESGは、このドキュメントによって確立されたIMAPキーワードレジストリの1人以上の専門家レビューアを任命します。"
    },
    {
      "indent": 3,
      "text": "The Expert Reviewer should strive for timely reviews. The Expert Reviewer should take no longer than six weeks to make and announce the decision, or notify the mailing list that more time is required.",
      "ja": "専門家のレビュアーは、タイムリーなレビューを求めて努力する必要があります。専門家のレビュアーは、決定を行い、発表するのに6週間かからないか、メーリングリストにもっと時間が必要であることを通知する必要があります。"
    },
    {
      "indent": 3,
      "text": "Decisions (or lack of) made by an Expert Reviewer can be first appealed to Application Area Directors and, if the appellant is not satisfied with the response, to the full IESG.",
      "ja": "専門家のレビュアーによる決定（または不足）は、最初に申請エリアのディレクターに訴えることができます。上訴人が応答に満足していない場合、完全なIESGに訴えます。"
    },
    {
      "indent": 3,
      "text": "There are two types of IMAP keywords in the \"IMAP Keywords\" registry: intended for \"common use\" and vendor-/organization-specific use (also known as \"limited use\"). An IMAP keyword is said to be for \"common use\" if it is reasonably expected to be implemented in at least two independent client implementations. The two types of IMAP keywords have different levels of requirements for registration (see below).",
      "ja": "「IMAPキーワード」レジストリには、「共通使用」とベンダー/組織固有の使用（「限定使用」とも呼ばれる）を対象とした2種類のIMAPキーワードがあります。IMAPキーワードは、少なくとも2つの独立したクライアント実装で実装されると合理的に予想される場合、「一般的な使用」であると言われています。2種類のIMAPキーワードには、登録の要件のレベルが異なります（以下を参照）。"
    },
    {
      "indent": 0,
      "text": "3.1. Review Guidelines for the Designated Expert Reviewer",
      "section_title": true,
      "ja": "3.1. 指定された専門家レビューアのガイドラインを確認します"
    },
    {
      "indent": 3,
      "text": "Expert Reviewers should focus on the following requirements.",
      "ja": "専門家のレビュアーは、次の要件に焦点を当てる必要があります。"
    },
    {
      "indent": 3,
      "text": "Registration of a vendor-/organization-specific (\"limited use\") IMAP keyword is easier. The Expert Reviewer only needs to check that the requested name doesn't conflict with an already registered name, and that the name is not too generic, misleading, etc. The Expert Reviewer MAY request the IMAP keyword name change before approving the registration. The Expert Reviewer SHOULD refuse a registration if there is an already registered IMAP keyword that serves the same purpose, but has a different name.",
      "ja": "ベンダー/組織固有（「限定使用」）IMAPキーワードの登録は簡単です。専門家のレビュアーは、要求された名前が既に登録されている名前と競合せず、名前があまりにも一般的で誤解を招くなどではないことを確認する必要があります。登録を承認する前に、専門家のレビュアーはIMAPキーワード名の変更を要求することができます。専門家のレビューアは、同じ目的を果たすが異なる名前がある既に登録されているIMAPキーワードがある場合、登録を拒否する必要があります。"
    },
    {
      "indent": 3,
      "text": "When registering an IMAP keyword for \"common use\", the Expert Reviewer performs the checks described for vendor-/ organization-specific IMAP keywords, plus additional checks as detailed below.",
      "ja": "「一般的な使用」のIMAPキーワードを登録する場合、専門家のレビュアーは、ベンダー/組織固有のIMAPキーワードに記載されているチェックと、以下に詳述する追加のチェックを実行します。"
    },
    {
      "indent": 3,
      "text": "Keywords intended for \"common use\" SHOULD start with the \"$\" prefix. (Note that this is a SHOULD because some of the commonly used IMAP keywords in widespread use don't follow this convention.)",
      "ja": "「一般的な使用」を目的としたキーワードは、「$」プレフィックスで開始する必要があります。（これは、広く使用されている一般的に使用されるIMAPキーワードの一部が、この慣習に従わないため、そうであることに注意してください。）"
    },
    {
      "indent": 3,
      "text": "IMAP keywords intended for \"common use\" SHOULD be standardized in IETF Review [RFC5226] documents. (Note that IETF Review documents still require Expert Review.)",
      "ja": "「共通使用」を目的としたIMAPキーワードは、IETFレビュー[RFC5226]ドキュメントで標準化する必要があります。（IETFレビュードキュメントにはまだ専門家のレビューが必要であることに注意してください。）"
    },
    {
      "indent": 3,
      "text": "Values in the \"IMAP Keywords\" IANA registry intended for \"common use\" must be clearly documented and likely to ensure interoperability. They must be useful, not harmful to the Internet. In cases when an IMAP keyword being registered is already deployed, Expert Reviewers should favor registering it over requiring perfect documentation and/or requesting a change to the name of the IMAP keyword.",
      "ja": "「共通の使用」を目的とした「IMAPキーワード」IANAレジストリの値は、明確に文書化され、相互運用性を確保する可能性があります。インターネットに有害ではなく、有用でなければなりません。登録されているIMAPキーワードが既に展開されている場合、専門家のレビュアーは、完璧なドキュメントを必要とするか、IMAPキーワードの名前の変更を要求することで登録することを好む必要があります。"
    },
    {
      "indent": 3,
      "text": "The Expert Reviewer MAY automatically \"upgrade\" registration requests for a \"limited use\" IMAP keyword to \"common use\" level. The Expert Reviewer MAY also request that a registration targeted for \"common use\" be registered as \"limited use\" instead.",
      "ja": "エキスパートレビューアは、「制限された使用」IMAPキーワードの「一般的な使用」レベルに対する「登録リクエスト」を自動的に「アップグレード」することができます。また、専門家のレビュアーは、「共通使用」を対象とした登録を代わりに「限定使用」として登録することを要求する場合があります。"
    },
    {
      "indent": 0,
      "text": "3.2. Comments on IMAP Keywords' Registrations",
      "section_title": true,
      "ja": "3.2. IMAPキーワードの登録に関するコメント"
    },
    {
      "indent": 3,
      "text": "Comments on registered IMAP keywords should be sent to both the \"owner\" of the mechanism and to the mailing list designated to IMAP keyword review (see Section 3). This improves the chances of getting a timely response.",
      "ja": "登録されたIMAPキーワードに関するコメントは、メカニズムの「所有者」とIMAPキーワードレビューに指定されたメーリングリストの両方に送信する必要があります（セクション3を参照）。これにより、タイムリーな応答を得る可能性が向上します。"
    },
    {
      "indent": 3,
      "text": "Submitters of comments may, after a reasonable attempt to contact the owner and after soliciting comments on the IMAP mailing list, request the designated Expert Reviewer to attach their comment to the IMAP keyword registration itself. The procedure is similar to requesting an Expert Review for the affected keyword.",
      "ja": "コメントの提出者は、所有者に連絡しようとする合理的な試みの後、IMAPメーリングリストにコメントを求めた後、指定された専門家のレビュー担当者にIMAPキーワード登録自体にコメントを添付するよう要求する場合があります。この手順は、影響を受けるキーワードの専門家のレビューを要求することに似ています。"
    },
    {
      "indent": 0,
      "text": "3.3. Change Control",
      "section_title": true,
      "ja": "3.3. 変更管理"
    },
    {
      "indent": 3,
      "text": "Once an IMAP keyword registration has been published by IANA, the owner may request a change to its definition. The change request (including a change to the \"intended usage\" field) follows the same procedure as the initial registration request, with the exception of changes to the \"Person & email address to contact for further information\" and \"Owner/Change controller\" fields. The latter can be changed by the owner by informing IANA; this can be done without discussion or review.",
      "ja": "IANAによってIMAPキーワード登録が公開されると、所有者はその定義の変更を要求することができます。変更要求（「意図された使用法」フィールドへの変更を含む）は、「詳細については、連絡先への個人および電子メールアドレス」および「所有者/変更コントローラー」の変更を除き、初期登録要求と同じ手順に従います。田畑。後者は、IANAに通知することにより、所有者によって変更される可能性があります。これは、議論やレビューなしで行うことができます。"
    },
    {
      "indent": 3,
      "text": "The IESG may reassign responsibility for an IMAP keyword. The most common case of this will be to enable clarifications to be made to keywords where the owner of the registration has died, moved out of contact, or is otherwise unable to make changes that are important to the community.",
      "ja": "IESGは、IMAPキーワードの責任を再割り当てする場合があります。これの最も一般的なケースは、登録の所有者が死亡した、接触しなくなった、またはコミュニティにとって重要な変更を加えることができないキーワードに対して明確化を可能にすることです。"
    },
    {
      "indent": 3,
      "text": "IMAP keyword registrations MUST NOT be deleted; keywords that are no longer believed appropriate for use can be declared DEPRECATED by a change to their \"intended usage\" field.",
      "ja": "IMAPキーワード登録を削除してはなりません。使用に適していないと考えられているキーワードは、「意図した使用」フィールドの変更によって非推奨されると宣言できます。"
    },
    {
      "indent": 3,
      "text": "The IESG is considered the owner of all \"common use\" IMAP keywords that are published in an IETF Review document.",
      "ja": "IESGは、IETFレビュードキュメントで公開されているすべての「一般的な使用」IMAPキーワードの所有者と見なされます。"
    },
    {
      "indent": 0,
      "text": "3.4. Initial Registrations",
      "section_title": true,
      "ja": "3.4. 初期登録"
    },
    {
      "indent": 3,
      "text": "IANA has registered the IMAP keywords specified in following subsections in the registry established by this document.",
      "ja": "IANAは、このドキュメントで確立されたレジストリの次のサブセクションで指定されたIMAPキーワードを登録しています。"
    },
    {
      "indent": 0,
      "text": "3.4.1. $MDNSent IMAP Keyword Registration",
      "section_title": true,
      "ja": "3.4.1. $ MDNSENT IMAPキーワード登録"
    },
    {
      "indent": 3,
      "text": "Subject: Registration of IMAP keyword $MDNSent",
      "ja": "件名：IMAPキーワード$ mdnsentの登録"
    },
    {
      "indent": 3,
      "text": "IMAP keyword name: $MDNSent",
      "ja": "IMAPキーワード名：$ mdnsent"
    },
    {
      "indent": 3,
      "text": "Purpose (description): Specifies that a Message Disposition Notification (MDN) must not be sent for any message annotated with the $MDNSent IMAP keyword.",
      "ja": "目的（説明）：メッセージ処分通知（MDN）を、$ MDNSENT IMAPキーワードで注釈付けされたメッセージに対して送信してはならないことを指定します。"
    },
    {
      "indent": 3,
      "text": "Private or Shared on a server: SHARED",
      "ja": "プライベートまたはサーバーで共有：共有"
    },
    {
      "indent": 3,
      "text": "Is it an advisory keyword or may it cause an automatic action: This keyword can cause automatic action by the client. See [RFC3503] for more details.",
      "ja": "アドバイザリーキーワードですか、それとも自動アクションを引き起こす可能性があります。このキーワードは、クライアントによる自動アクションを引き起こす可能性があります。詳細については、[RFC3503]を参照してください。"
    },
    {
      "indent": 3,
      "text": "When/by whom the keyword is set/cleared: This keyword is set by an IMAP client when it decides to act on an MDN request, or when uploading a sent or draft message. It can also be set by a delivery agent. Once set, the flag SHOULD NOT be cleared.",
      "ja": "いつ/誰によってキーワードが設定/クリアされます：このキーワードは、MDN要求に基づいて動作することを決定したとき、または送信またはドラフトメッセージのアップロード時にIMAPクライアントによって設定されます。また、配信エージェントによって設定することもできます。設定したら、フラグをクリアしないでください。"
    },
    {
      "indent": 3,
      "text": "Related keywords: None",
      "ja": "関連キーワード：なし"
    },
    {
      "indent": 3,
      "text": "Related IMAP capabilities: None",
      "ja": "関連するIMAP機能：なし"
    },
    {
      "indent": 3,
      "text": "Security considerations: See Section 6 of [RFC3503]",
      "ja": "セキュリティ上の考慮事項：[RFC3503]のセクション6を参照してください"
    },
    {
      "indent": 3,
      "text": "Published specification (recommended): [RFC3503]",
      "ja": "公開された仕様（推奨）：[RFC3503]"
    },
    {
      "indent": 3,
      "text": "Person & email address to contact for further information:\n                        Alexey Melnikov <alexey.melnikov@isode.com>",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Intended usage: COMMON",
      "ja": "意図された使用法：共通"
    },
    {
      "indent": 3,
      "text": "Owner/Change controller: IESG",
      "ja": "所有者/変更コントローラー：IESG"
    },
    {
      "indent": 3,
      "text": "Note:",
      "ja": "ノート："
    },
    {
      "indent": 0,
      "text": "3.4.2. $Forwarded IMAP Keyword Registration",
      "section_title": true,
      "ja": "3.4.2. $転送されたIMAPキーワード登録"
    },
    {
      "indent": 3,
      "text": "Subject: Registration of the IMAP keyword $Forwarded",
      "ja": "件名：IMAPキーワード$の転送の登録"
    },
    {
      "indent": 3,
      "text": "IMAP keyword name: $Forwarded",
      "ja": "IMAPキーワード名：$転送"
    },
    {
      "indent": 3,
      "text": "Purpose (description): $Forwarded is used by several IMAP clients to specify that the message was resent to another email address, embedded within or attached to a new message. This keyword is set by the mail client when it successfully forwards the message to another email address. Typical usage of this keyword is to show a different (or additional) icon for a message that has been forwarded.",
      "ja": "目的（説明）：$転送は、複数のIMAPクライアントによって使用され、メッセージが別のメールアドレスにresし、新しいメッセージに埋め込まれているか、添付されていることを指定します。このキーワードは、メッセージを別のメールアドレスに正常に転送すると、メールクライアントによって設定されます。このキーワードの典型的な使用法は、転送されたメッセージの別の（または追加の）アイコンを表示することです。"
    },
    {
      "indent": 3,
      "text": "Private or Shared on a server: BOTH",
      "ja": "プライベートまたはサーバーで共有：両方"
    },
    {
      "indent": 3,
      "text": "Is it an advisory keyword or may it cause an automatic action: advisory",
      "ja": "アドバイザリーキーワードですか、それとも自動アクションを引き起こす可能性がありますか：アドバイザリー"
    },
    {
      "indent": 3,
      "text": "When/by whom the keyword is set/cleared: This keyword can be set by either a delivery agent or a mail client. Once set, the flag SHOULD NOT be cleared. Notes: There is no way to tell if a message with $Forwarded keyword set was forwarded more than once.",
      "ja": "いつ/誰によってキーワードが設定/クリアされます：このキーワードは、配信エージェントまたはメールクライアントのいずれかによって設定できます。設定したら、フラグをクリアしないでください。注：$転送されたキーワードセットを含むメッセージが複数回転送されたかどうかを判断する方法はありません。"
    },
    {
      "indent": 3,
      "text": "Related keywords: None",
      "ja": "関連キーワード：なし"
    },
    {
      "indent": 3,
      "text": "Related IMAP capabilities: None Security considerations: A server implementing this keyword as a shared keyword may disclose that a confidential message was forwarded.",
      "ja": "関連するIMAP機能：なしセキュリティ上の考慮事項：共有キーワードとしてこのキーワードを実装するサーバーは、機密メッセージが転送されたことを開示する場合があります。"
    },
    {
      "indent": 3,
      "text": "Published specification (recommended): [RFC5550]",
      "ja": "公開された仕様（推奨）：[RFC5550]"
    },
    {
      "indent": 3,
      "text": "Person & email address to contact for further information:\n                        Alexey Melnikov <alexey.melnikov@isode.com>",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Intended usage: COMMON",
      "ja": "意図された使用法：共通"
    },
    {
      "indent": 3,
      "text": "Owner/Change controller: IESG",
      "ja": "所有者/変更コントローラー：IESG"
    },
    {
      "indent": 3,
      "text": "Note:",
      "ja": "ノート："
    },
    {
      "indent": 0,
      "text": "3.4.3. $SubmitPending IMAP Keyword Registration",
      "section_title": true,
      "ja": "3.4.3. $ IMAPキーワード登録を提出します"
    },
    {
      "indent": 3,
      "text": "Subject: Registration of IMAP keyword $SubmitPending",
      "ja": "件名：IMAPキーワード$ submitpendingの登録"
    },
    {
      "indent": 3,
      "text": "IMAP keyword name: $SubmitPending",
      "ja": "IMAPキーワード名：$ submingpending"
    },
    {
      "indent": 3,
      "text": "Purpose (description): The $SubmitPending IMAP keyword designates the message as awaiting to be submitted. This keyword allows storing messages waiting to be submitted in the same mailbox where messages that were already submitted and/or are being edited are stored.",
      "ja": "目的（説明）：$ submindEnding IMAPキーワードは、送信を待っているとメッセージを指定します。このキーワードでは、既に提出された、および/または編集されているメッセージが保存されている同じメールボックスで送信されるのを待っているメッセージを保存することができます。"
    },
    {
      "indent": 27,
      "text": "A message that has both $Submitted and $SubmitPending IMAP keywords set is a message being actively submitted.",
      "ja": "$の送信と$送信のIMAPキーワードセットの両方があるメッセージは、積極的に送信されるメッセージです。"
    },
    {
      "indent": 3,
      "text": "Private or Shared on a server: SHARED",
      "ja": "プライベートまたはサーバーで共有：共有"
    },
    {
      "indent": 3,
      "text": "Is it an advisory keyword or may it cause an automatic action: This keyword can cause automatic action by the client. See Section 5.10 of [RFC5550] for more details.",
      "ja": "アドバイザリーキーワードですか、それとも自動アクションを引き起こす可能性があります。このキーワードは、クライアントによる自動アクションを引き起こす可能性があります。詳細については、[RFC5550]のセクション5.10を参照してください。"
    },
    {
      "indent": 3,
      "text": "When/by whom the keyword is set/cleared: This keyword is set by a mail client when it decides that the message needs to be sent out.",
      "ja": "キーワードが設定/クリアされた場合/whers：このキーワードは、メッセージを送信する必要があると判断したときにメールクライアントによって設定されます。"
    },
    {
      "indent": 3,
      "text": "Related keywords: $Submitted",
      "ja": "関連キーワード：$送信"
    },
    {
      "indent": 3,
      "text": "Related IMAP capabilities: None Security considerations: A server implementing this keyword as a shared keyword may disclose that a confidential message is scheduled to be sent out or is being actively sent out.",
      "ja": "関連するIMAP機能：なしセキュリティ上の考慮事項：共有キーワードとしてこのキーワードを実装するサーバーは、機密メッセージが送信されるようにスケジュールされているか、積極的に送信されていることを開示する場合があります。"
    },
    {
      "indent": 3,
      "text": "Published specification (recommended): [RFC5550]",
      "ja": "公開された仕様（推奨）：[RFC5550]"
    },
    {
      "indent": 3,
      "text": "Person & email address to contact for further information:\n                        Alexey Melnikov <alexey.melnikov@isode.com>",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Intended usage: COMMON",
      "ja": "意図された使用法：共通"
    },
    {
      "indent": 3,
      "text": "Owner/Change controller: IESG",
      "ja": "所有者/変更コントローラー：IESG"
    },
    {
      "indent": 3,
      "text": "Note:",
      "ja": "ノート："
    },
    {
      "indent": 0,
      "text": "3.4.4. $Submitted IMAP Keyword Registration",
      "section_title": true,
      "ja": "3.4.4. $提出されたIMAPキーワード登録"
    },
    {
      "indent": 3,
      "text": "Subject: Registration of IMAP keyword $Submitted",
      "ja": "件名：IMAPキーワード$の登録が送信されました"
    },
    {
      "indent": 3,
      "text": "IMAP keyword name: $Submitted",
      "ja": "IMAPキーワード名：$送信"
    },
    {
      "indent": 3,
      "text": "Purpose (description): The $Submitted IMAP keyword designates the message as being sent out.",
      "ja": "目的（説明）：送信されたIMAPキーワードは、メッセージを送信していると指定します。"
    },
    {
      "indent": 27,
      "text": "A message that has both $Submitted and $SubmitPending IMAP keywords set is a message being actively submitted.",
      "ja": "$の送信と$送信のIMAPキーワードセットの両方があるメッセージは、積極的に送信されるメッセージです。"
    },
    {
      "indent": 3,
      "text": "Private or Shared on a server: SHARED",
      "ja": "プライベートまたはサーバーで共有：共有"
    },
    {
      "indent": 3,
      "text": "Is it an advisory keyword or may it cause an automatic action: This keyword can cause automatic action by the client. See Section 5.10 of [RFC5550] for more details.",
      "ja": "アドバイザリーキーワードですか、それとも自動アクションを引き起こす可能性があります。このキーワードは、クライアントによる自動アクションを引き起こす可能性があります。詳細については、[RFC5550]のセクション5.10を参照してください。"
    },
    {
      "indent": 3,
      "text": "When/by whom the keyword is set/cleared: This keyword is set by a mail client when it decides to start sending it.",
      "ja": "いつ/誰によってキーワードが設定/クリアされます：このキーワードは、送信を開始することを決定したときにメールクライアントによって設定されます。"
    },
    {
      "indent": 3,
      "text": "Related keywords: $SubmitPending",
      "ja": "関連キーワード：$ submingpending"
    },
    {
      "indent": 3,
      "text": "Related IMAP capabilities: None",
      "ja": "関連するIMAP機能：なし"
    },
    {
      "indent": 3,
      "text": "Security considerations: A server implementing this keyword as a shared keyword may disclose that a confidential message was sent or is being actively sent out.",
      "ja": "セキュリティ上の考慮事項：このキーワードを共有キーワードとして実装するサーバーは、機密メッセージが送信されたか、積極的に送信されていることを開示する場合があります。"
    },
    {
      "indent": 3,
      "text": "Published specification (recommended): [RFC5550]",
      "ja": "公開された仕様（推奨）：[RFC5550]"
    },
    {
      "indent": 3,
      "text": "Person & email address to contact for further information:\n                        Alexey Melnikov <alexey.melnikov@isode.com>",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Intended usage: COMMON",
      "ja": "意図された使用法：共通"
    },
    {
      "indent": 3,
      "text": "Owner/Change controller: IESG",
      "ja": "所有者/変更コントローラー：IESG"
    },
    {
      "indent": 3,
      "text": "Note:",
      "ja": "ノート："
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4. セキュリティに関する考慮事項"
    },
    {
      "indent": 4,
      "text": "IMAP keywords are one of the base IMAP features [RFC3501]. This document doesn't change their behavior, so it does not add new security issues.",
      "ja": "IMAPキーワードは、ベースIMAP機能の1つです[RFC3501]。このドキュメントは動作を変更しないため、新しいセキュリティの問題は追加されません。"
    },
    {
      "indent": 4,
      "text": "A particular IMAP keyword might have specific security considerations, which are documented in the IMAP keyword registration template standardized by this document.",
      "ja": "特定のIMAPキーワードには、このドキュメントで標準化されたIMAPキーワード登録テンプレートに文書化されている特定のセキュリティに関する考慮事項がある場合があります。"
    },
    {
      "indent": 0,
      "text": "5. Acknowledgements",
      "section_title": true,
      "ja": "5. 謝辞"
    },
    {
      "indent": 3,
      "text": "The creation of this document was prompted by one of many discussions on the IMAP mailing list.",
      "ja": "このドキュメントの作成は、IMAPメーリングリストに関する多くの議論の1つによって促されました。"
    },
    {
      "indent": 3,
      "text": "John Neystadt co-authored the first version of this document.",
      "ja": "John Neystadtは、このドキュメントの最初のバージョンを共著しました。"
    },
    {
      "indent": 3,
      "text": "Special thanks to Chris Newman, David Harris, Lyndon Nerenberg, Mark Crispin, Samuel Weiler, Alfred Hoenes, Lars Eggert, and Cullen Jennings for reviewing different versions of this document. However, all errors or omissions must be attributed to the authors of this document.",
      "ja": "クリス・ニューマン、デビッド・ハリス、リンドン・ネーレンバーグ、マーク・クリスピン、サミュエル・ワイラー、アルフレッド・ホーネス、ラース・エガート、カレン・ジェニングスに感謝します。ただし、すべてのエラーまたは省略は、このドキュメントの著者に起因する必要があります。"
    },
    {
      "indent": 3,
      "text": "The authors would also like to thank the developers of Mozilla mail clients for providing food for thought.",
      "ja": "著者はまた、Mozilla Mailクライアントの開発者に、思考のために食料を提供してくれたことに感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "ja": "6. 参考文献"
    },
    {
      "indent": 0,
      "text": "6.1. Normative References",
      "section_title": true,
      "ja": "6.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[Kwds] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[KWDS] Bradner、S。、「要件レベルを示すためにRFCで使用するためのキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3501] Crispin, M., \"INTERNET MESSAGE ACCESS PROTOCOL - VERSION 4rev1\", RFC 3501, March 2003.",
      "ja": "[RFC3501] CRISPIN、M。、「インターネットメッセージアクセスプロトコル - バージョン4REV1」、RFC 3501、2003年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC5226] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 5226, May 2008.",
      "ja": "[RFC5226] Narten、T。およびH. Alvestrand、「RFCSでIANA考慮事項セクションを書くためのガイドライン」、BCP 26、RFC 5226、2008年5月。"
    },
    {
      "indent": 0,
      "text": "6.2. Informative References",
      "section_title": true,
      "ja": "6.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[RFC3503] Melnikov, A., \"Message Disposition Notification (MDN) profile for Internet Message Access Protocol (IMAP)\", RFC 3503, March 2003.",
      "ja": "[RFC3503] Melnikov、A。、「メッセージ処理通知（MDN）インターネットメッセージアクセスプロトコル（IMAP）のプロファイル」、RFC 3503、2003年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC5550] Cridland, D., Melnikov, A., and S. Maes, \"The Internet Email to Support Diverse Service Environments (Lemonade) Profile\", RFC 5550, August 2009.",
      "ja": "[RFC5550] Cridland、D.、Melnikov、A。、およびS. Maes、「多様なサービス環境（レモネード）プロファイルをサポートするインターネットメール」、RFC 5550、2009年8月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Alexey Melnikov Isode Limited 5 Castle Business Village 36 Station Road Hampton, Middlesex TW12 2BX UK",
      "ja": "Alexey Melnikov Isode Limited 5 Castle Business Village 36 Station Road Hampton、Middlesex TW12 2BX UK"
    },
    {
      "indent": 3,
      "text": "EMail: Alexey.Melnikov@isode.com\nURI:   http://www.melnikov.ca/",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Dave Cridland Isode Limited 5 Castle Business Village 36 Station Road Hampton, Middlesex TW12 2BX UK",
      "ja": "Dave Cridland Isode Limited 5 Castle Business Village 36 Station Road Hampton、Middlesex TW12 2BX UK"
    },
    {
      "indent": 3,
      "text": "EMail: dave.cridland@isode.com",
      "raw": true,
      "ja": ""
    }
  ]
}