{
  "title": {
    "text": "RFC 5098 - Signaling MIB for PacketCable and IPCablecom Multimedia Terminal Adapters (MTAs)",
    "ja": "RFC 5098 - PacketcableおよびIPCableComマルチメディアターミナルアダプター（MTA）のシグナリングMIB"
  },
  "number": 5098,
  "created_at": "2023-04-26 15:17:53.734891+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                         G. Beacham\nRequest for Comments: 5098                                Motorola, Inc.\nCategory: Standards Track                                       S. Kumar\n                                                       Texas Instruments\n                                                        S. Channabasappa\n                                                               CableLabs\n                                                           February 2008",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 14,
      "text": "Signaling MIB for PacketCable and IPCablecom Multimedia Terminal Adapters (MTAs)",
      "ja": "PacketcableおよびIPCableComマルチメディアターミナルアダプター（MTA）のシグナリングMIB"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "このドキュメントは、インターネットコミュニティのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態とステータスについては、「インターネット公式プロトコル標準」（STD 1）の現在のエディションを参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This memo defines a portion of the Management Information Base (MIB) for use with network management protocols in the Internet community. In particular, it defines a basic set of managed objects for Simple Network Management Protocol (SNMP)-based management of PacketCable-and IPCablecom-compliant Multimedia Terminal Adapter devices.",
      "ja": "このメモは、インターネットコミュニティのネットワーク管理プロトコルで使用するための管理情報ベース（MIB）の一部を定義します。特に、PacketCableおよびIPCableComに準拠したマルチメディアターミナルアダプターデバイスの単純なネットワーク管理プロトコル（SNMP）ベースの管理の管理されたオブジェクトの基本セットを定義します。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. The Internet-Standard Management Framework ......................2\n2. Introduction ....................................................2\n3. Terminology .....................................................3\n   3.1. MTA ........................................................3\n   3.2. Endpoint ...................................................3\n   3.3. L Line Package .............................................4\n   3.4. E Line Package .............................................4\n4. Overview ........................................................4\n   4.1. Structure of the MIB .......................................5\n   4.2. pktcSigMibObjects ..........................................5\n   4.3. pktcSigConformance .........................................6\n5. Definitions .....................................................6\n6. Examples .......................................................69\n7. Acknowledgments ................................................72\n8. Security Considerations ........................................73\n9. IANA Considerations ............................................75\n10. References ....................................................75\n   10.1. Normative References .....................................75\n   10.2. Informative References ...................................76",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. The Internet-Standard Management Framework",
      "section_title": true,
      "ja": "1. インターネット標準の管理フレームワーク"
    },
    {
      "indent": 3,
      "text": "For a detailed overview of the documents that describe the current Internet-Standard Management Framework, please refer to section 7 of RFC 3410 [RFC3410].",
      "ja": "現在のインターネット標準管理フレームワークを説明するドキュメントの詳細な概要については、RFC 3410 [RFC3410]のセクション7を参照してください。"
    },
    {
      "indent": 3,
      "text": "Managed objects are accessed via a virtual information store, termed the Management Information Base or MIB. MIB objects are generally accessed through the Simple Network Management Protocol (SNMP). Objects in the MIB are defined using the mechanisms defined in the Structure of Management Information (SMI). This memo specifies a MIB module that is compliant to the SMIv2, which is described in STD 58, RFC 2578 [RFC2578], STD 58, RFC 2579 [RFC2579] and STD 58, RFC 2580 [RFC2580].",
      "ja": "管理されたオブジェクトは、管理情報ベースまたはMIBと呼ばれる仮想情報ストアからアクセスされます。MIBオブジェクトは通常、単純なネットワーク管理プロトコル（SNMP）からアクセスされます。MIBのオブジェクトは、管理情報の構造（SMI）で定義されたメカニズムを使用して定義されます。このメモは、STD 58、RFC 2578 [RFC2578]、STD 58、RFC 2579 [RFC2579]およびSTD 58、RFC 2580 [RFC2580]に記載されているSMIV2に準拠したMIBモジュールを指定します。"
    },
    {
      "indent": 0,
      "text": "2. Introduction",
      "section_title": true,
      "ja": "2. はじめに"
    },
    {
      "indent": 3,
      "text": "A multimedia terminal adapter (MTA) is used to deliver broadband Internet, data, and/or voice access jointly with telephony service to a subscriber's or customer's premises using a cable network infrastructure. An MTA is normally installed at the customer's or subscriber's premises, and it is coupled to a multiple system operator (MSO) using a hybrid fiber coax (HFC) access network.",
      "ja": "マルチメディアターミナルアダプター（MTA）を使用して、ケーブルネットワークインフラストラクチャを使用して、サブスクライバーまたは顧客の施設へのテレフォニーサービスと共同でブロードバンドインターネット、データ、音声アクセスを提供します。MTAは通常、顧客またはサブスクライバーの施設にインストールされ、ハイブリッドファイバーCoax（HFC）アクセスネットワークを使用して複数のシステムオペレーター（MSO）に結合されます。"
    },
    {
      "indent": 3,
      "text": "An MTA is provisioned by the MSO for broadband Internet, data, and/or voice service. For more information on MTA provisioning, refer to the PacketCable Provisioning Specification [PKT-SP-PROV] and [RFC4682]. MTA devices include one or more endpoints (e.g., telephone ports), which receive call signaling information to establish ring cadence, and codecs used for providing telephony service. For more information on call signaling, refer to the PacketCable Signaling Specification [PKT-SP-MGCP] and [RFC3435]. For more information on codecs refer to the PacketCable Audio/Video Codecs Specification [PKT-SP-CODEC].",
      "ja": "MTAは、ブロードバンドインターネット、データ、および/または音声サービスのためにMSOによってプロビジョニングされます。MTAプロビジョニングの詳細については、PacketCable Provisioning仕様[PKT-SP-Prov]および[RFC4682]を参照してください。MTAデバイスには、1つ以上のエンドポイント（電話ポートなど）が含まれます。これは、リングケーデンスを確立するためのコールシグナル情報を受け取り、テレフォニーサービスの提供に使用されるコーデックが含まれます。コールシグナル伝達の詳細については、Packetcableシグナル伝達仕様[PKT-SP-MGCP]および[RFC3435]を参照してください。コーデックの詳細については、Packetcable Audio/Video Codecs仕様[PKT-SP-Codec]を参照してください。"
    },
    {
      "indent": 3,
      "text": "Telephone systems are typically very complex and often have a wide distribution. It is therefore important for management systems to support MTAs from multiple vendors at the same time, including those from multiple countries. This MIB module provides objects suitable for managing signaling for MTA devices in the widest possible range of markets.",
      "ja": "電話システムは通常非常に複雑であり、多くの場合、幅広い分布を持っています。したがって、管理システムにとって、複数の国からのものを含め、複数のベンダーのMTAを同時にサポートすることが重要です。このMIBモジュールは、可能な限り幅広い市場でMTAデバイスのシグナリングを管理するのに適したオブジェクトを提供します。"
    },
    {
      "indent": 0,
      "text": "3. Terminology",
      "section_title": true,
      "ja": "3. 用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "ja": "この文書のキーワード \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", および \"OPTIONAL\" はRFC 2119 [RFC2119]で説明されているように解釈されます。"
    },
    {
      "indent": 3,
      "text": "The terms \"MIB module\" and \"information module\" are used interchangeably in this memo. As used here, both terms refer to any of the three types of information modules defined in Section 3 of RFC 2578 [RFC2578].",
      "ja": "このメモでは、「MIBモジュール」と「情報モジュール」という用語が同じ意味で使用されます。ここで使用されているように、両方の用語は、RFC 2578 [RFC2578]のセクション3で定義されている3種類の情報モジュールのいずれかを指します。"
    },
    {
      "indent": 0,
      "text": "3.1. MTA",
      "section_title": true,
      "ja": "3.1. MTA"
    },
    {
      "indent": 3,
      "text": "An MTA is a PacketCable or IPCablecom compliant device providing telephony services over a cable or hybrid system used to deliver video signals to a community. It contains an interface to endpoints, a network interface, codecs, and all signaling and encapsulation functions required for Voice-over IP transport, call signaling, and Quality of Service signaling. An MTA can be an embedded or standalone device. An Embedded MTA (E-MTA) is an MTA device containing an embedded Data Over Cable Service Interface Specifications (DOCSIS) Cable Modem. A Standalone MTA (S-MTA) is an MTA device separated from the DOCSIS Cable Modem by non-DOCSIS Media Access Control (MAC) interface (e.g., Ethernet, USB).",
      "ja": "MTAは、ビデオ信号をコミュニティに配信するために使用されるケーブルまたはハイブリッドシステムを介してテレフォニーサービスを提供するパケットまたはIPCableComに準拠したデバイスです。エンドポイントへのインターフェイス、ネットワークインターフェイス、コーデック、およびボイスオーバーIPトランスポート、通話シグナリング、およびサービスの品質シグナリングに必要なすべてのシグナリングおよびカプセル化関数が含まれています。MTAは、組み込みまたはスタンドアロンデバイスにすることができます。埋め込まれたMTA（E-MTA）は、ケーブルサービスインターフェイス仕様（DOCSIS）ケーブルモデムを介して組み込みデータを含むMTAデバイスです。スタンドアロンMTA（S-MTA）は、非ドクシスメディアアクセスコントロール（MAC）インターフェイス（Ethernet、USBなど）によってDOCSISケーブルモデムから分離されたMTAデバイスです。"
    },
    {
      "indent": 0,
      "text": "3.2. Endpoint",
      "section_title": true,
      "ja": "3.2. 終点"
    },
    {
      "indent": 3,
      "text": "An endpoint or MTA endpoint is a standard telephony physical port located on the MTA and used for attaching the telephone device to the MTA.",
      "ja": "エンドポイントまたはMTAエンドポイントは、MTAにある標準のテレフォニー物理ポートであり、電話デバイスをMTAに取り付けるために使用されます。"
    },
    {
      "indent": 0,
      "text": "3.3. L Line Package",
      "section_title": true,
      "ja": "3.3. Lラインパッケージ"
    },
    {
      "indent": 3,
      "text": "The L line package refers to the Media Gateway Control Protocol (MGCP) package for the core signaling functionality, as defined by PacketCable and IPCablecom. An MTA provides all L package elements: however, the operator determines their application.",
      "ja": "L Lineパッケージは、PacketCableおよびIPCableComで定義されているコア信号機能のメディアゲートウェイ制御プロトコル（MGCP）パッケージを指します。MTAはすべてのLパッケージ要素を提供します。ただし、オペレーターはアプリケーションを決定します。"
    },
    {
      "indent": 0,
      "text": "3.4. E Line Package",
      "section_title": true,
      "ja": "3.4. Eラインパッケージ"
    },
    {
      "indent": 3,
      "text": "The E line package refers to the MGCP package extensions, over and above the core L package, defined in support of international requirements. E line package elements are optional, vary from country to country, and are set by operator or regulatory requirements.",
      "ja": "Eラインパッケージは、国際的な要件をサポートして定義されたコアLパッケージの上にあるMGCPパッケージ拡張機能を指します。Eラインパッケージ要素はオプションであり、国によって異なり、オペレーターまたは規制要件によって設定されています。"
    },
    {
      "indent": 0,
      "text": "4. Overview",
      "section_title": true,
      "ja": "4. 概要"
    },
    {
      "indent": 3,
      "text": "This MIB module provides a set of objects required for Multimedia Terminal Adapter (MTA) devices compliant with the PacketCable and IPCablecom signaling specifications published by CableLabs, the European Telecommunications Standards Institute (ETSI), and the International Telecommunication Union Telecommunication Standardization Sector (ITU-T) IPCablecom compliant Multimedia Terminal Adapter (MTA) devices. The Signaling MIB module (PKTC-IETF-SIG-MIB) is intended to update various Signaling MIB modules from which it is partly derived:",
      "ja": "このMIBモジュールは、マルチメディアターミナルアダプター（MTA）デバイスに必要な一連のオブジェクトを提供します。CableLabs、欧州通信基準標準研究所（ETSI）、および国際電気通信連合電気通信標準化（ITU-T-T-T-T-T-T-T-T-T-T-T-T-Communication Starndication Standardizationが公開しているPacketcableおよびIpcablecomシグナル伝達仕様に準拠しています。）IPCABLECOM準拠のマルチメディアターミナルアダプター（MTA）デバイス。シグナリングMIBモジュール（PKTC-IITF-SIG-MIB）は、部分的に導出されるさまざまなシグナル伝達MIBモジュールを更新することを目的としています。"
    },
    {
      "indent": 5,
      "text": "- the PacketCable 1.0 Signaling MIB Specification [PKT-SP-MIB-SIG-1.0],",
      "ja": "- PacketCable 1.0 SignalingMIB仕様[PKT-SP-MIB-SIG-1.0]、"
    },
    {
      "indent": 5,
      "text": "- the PacketCable 1.5 Signaling MIB Specification [PKT-SP-MIB-SIG-1.5],",
      "ja": "- PacketCable 1.5シグナル伝達MIB仕様[PKT-SP-MIB-SIG-1.5]、"
    },
    {
      "indent": 5,
      "text": "- the ITU-T IPCablecom Signaling MIB requirements [ITU-T-J169],",
      "ja": "- ITU-T IPCABLECOMシグナル伝達MIB要件[ITU-T-J169]、"
    },
    {
      "indent": 5,
      "text": "- the ETSI Signaling MIB [ETSI-TS-101-909-9]. The ETSI Signaling MIB requirements also refer to various signal characteristics defined in [ETSI-TS-101-909-4], [ETSI-EN-300-001], [ETSI-EN-300-659-1], [ETSI-EN-300-324-1] and [ETSI-TR-101-183].",
      "ja": "- ETSIシグナル伝達MIB [ETSI-TS-101-909-9]。ETSIシグナル伝達MIB要件は、[ETSI-TS-101-909-4]、[ETSI-EN-300-001]、[ETSI-EN-300-659-1]で定義されているさまざまな信号特性を指します。EN-300-324-1]および[ETSI-TR-101-183]。"
    },
    {
      "indent": 3,
      "text": "Several normative and informative references are used to help define Signaling MIB objects. As a convention, wherever PacketCable and IPCablecom requirements are equivalent, the PacketCable reference is used in the object REFERENCE clause. IPCablecom compliant MTA devices MUST use the equivalent IPCablecom references.",
      "ja": "いくつかの規範的および有益な参照は、シグナリングMIBオブジェクトの定義を支援するために使用されます。慣習として、PacketCableおよびIPCableComの要件が同等の場合はどこでも、PacketCable Referenceはオブジェクト参照条項で使用されます。IPCABLECOM準拠のMTAデバイスは、同等のIPCableCom参照を使用する必要があります。"
    },
    {
      "indent": 3,
      "text": "This MIB module describes the various Signaling MIB objects that are directly related to the PacketCable MTA and the endpoints supported on the MTA, each of which provides services independently. The recognition and distinction of the endpoints are made by utilizing the ifTable (IF-MIB [RFC2863]), where each index (ifIndex) value refers to a unique endpoint. This MIB module also utilizes the syntax definition of the Differentiated Services Code Point (DSCP) from DIFFSERV-DSCP-TC [RFC3289] for defining MIB objects that allow for differentiation between various types of traffic in the service provider network.",
      "ja": "このMIBモジュールは、PacketCable MTAに直接関連するさまざまなシグナル伝達MIBオブジェクトと、それぞれが独立してサービスを提供するMTAでサポートされているエンドポイントについて説明します。エンドポイントの認識と区別は、各インデックス（IFINDEX）値が一意のエンドポイントを指し、IFTable（if-MIB [RFC2863]）を使用することによって行われます。このMIBモジュールは、サービスプロバイダーネットワークのさまざまなタイプのトラフィック間の区別を可能にするMIBオブジェクトを定義するために、DiffServ-DSCP-TC [RFC3289]の差別化されたサービスコードポイント（DSCP）の構文定義も利用しています。"
    },
    {
      "indent": 0,
      "text": "4.1. Structure of the MIB",
      "section_title": true,
      "ja": "4.1. MIBの構造"
    },
    {
      "indent": 3,
      "text": "This MIB module is identified by pktcIetfSigMib and is structured into two major parts:",
      "ja": "このMIBモジュールは、PKTCIETFSIGMIBによって識別され、2つの主要な部分に構成されています。"
    },
    {
      "indent": 3,
      "text": "- Signaling information that controls device and endpoint configuration (pktcSigMibObjects)",
      "ja": "- デバイスとエンドポイントの構成を制御するシグナリング情報（pktcsigmibobjects）"
    },
    {
      "indent": 3,
      "text": "- Module Conformance information(pktcSigConformance)",
      "ja": "- モジュールの適合情報（pktcsigconformance）"
    },
    {
      "indent": 3,
      "text": "The following sections explain each part in further detail. It is to be noted that future enhancements to specify Notification Objects are also allowed (pktcSigNotification).",
      "ja": "次のセクションでは、各部分をさらに詳細に説明します。通知オブジェクトを指定するための将来の機能強化も許可されていることに注意してください（PKTCSIGNOTIFICATION）。"
    },
    {
      "indent": 0,
      "text": "4.2. pktcSigMibObjects",
      "section_title": true,
      "ja": "4.2. pktcsigmibobjects"
    },
    {
      "indent": 3,
      "text": "This is further divided into device-specific elements (pktcSigDevObjects) and endpoint-specific elements (pktcSigEndPntConfigObjects).",
      "ja": "これは、デバイス固有の要素（PKTCSIGDEVOBJECTS）およびエンドポイント固有の要素（PKTCSIGENDPNTCONFIGOBJECTS）にさらに分割されます。"
    },
    {
      "indent": 3,
      "text": "Some highlights of the device-specific elements are as follows:",
      "ja": "デバイス固有の要素のハイライトは次のとおりです。"
    },
    {
      "indent": 3,
      "text": "pktcSigDevCodecTable - this object identifies the codec types available on the device.",
      "ja": "pktcsigdevcodectable-このオブジェクトは、デバイスで利用可能なコーデックタイプを識別します。"
    },
    {
      "indent": 3,
      "text": "pktcSigDevEchoCancellation - this object identifies the capability of echo cancellation on the device.",
      "ja": "PKTCSIGDEVECHOCANCELLATION -このオブジェクトは、デバイス上のエコーキャンセルの機能を識別します。"
    },
    {
      "indent": 3,
      "text": "pktcSigDevSilenceSuppression - this object specifies if the device is capable of silence suppression (Voice Activity Detection).",
      "ja": "PKTCSIGDEVSILENCES -SUPPRESSION -このオブジェクトは、デバイスが沈黙抑制（音声アクティビティ検出）が可能かどうかを指定します。"
    },
    {
      "indent": 3,
      "text": "pktcSigPulseSignalTable - this table selects the various signals used in the application of the metering pulse signal to the twisted pair line.",
      "ja": "pktcsigpulsesignaltable-このテーブルは、メーターパルス信号をツイストペアラインに適用する際に使用されるさまざまな信号を選択します。"
    },
    {
      "indent": 3,
      "text": "pktcSigDevToneTable - this table specifies a flexible structure within which to specify all of the tones used in the MTA.",
      "ja": "PKTCSIGDEVTONETABLE-この表は、MTAで使用されるすべてのトーンを指定する柔軟な構造を指定します。"
    },
    {
      "indent": 3,
      "text": "pktcSigDevMultiFreqToneTable - this table defines the characteristics of tones with multiple frequencies. Each entry in this table represents the frequency reference of a multi-frequency tone.",
      "ja": "pktcsigdevmultifreqtonetable-この表は、複数の周波数を持つトーンの特性を定義します。この表の各エントリは、多頻度トーンの周波数参照を表します。"
    },
    {
      "indent": 3,
      "text": "The endpoint-specific elements are mostly confined to the Endpoint configuration MIB table (pktcSigEndPntConfigTable). This table describes the MTA endPoint configuration. The number of entries in this table represents the number of provisioned endpoints.",
      "ja": "エンドポイント固有の要素は、主にエンドポイント構成MIBテーブル（PKTCSIGENDPNTCONFIGTABLE）に限定されています。この表には、MTAエンドポイント構成について説明します。この表のエントリの数は、プロビジョニングされたエンドポイントの数を表します。"
    },
    {
      "indent": 0,
      "text": "4.3. pktcSigConformance",
      "section_title": true,
      "ja": "4.3. pktcsigconformance"
    },
    {
      "indent": 3,
      "text": "pktcSigDeviceGroup - this group contains all the MIB objects that apply on a per-device basis and need to be implemented by an MTA to claim compliance with the specified MIB module.",
      "ja": "PKTCSIGDEVICEGROUP-このグループには、デバイスごとに適用されるすべてのMIBオブジェクトが含まれており、指定されたMIBモジュールへのコンプライアンスを請求するためにMTAによって実装する必要があります。"
    },
    {
      "indent": 3,
      "text": "pktcSigEndpointGroup - this group contains all the MIB objects that apply on a per-endpoint basis and need to be implemented by an MTA to claim compliance with the specified MIB module.",
      "ja": "PKTCSIGENDPOINTGROUP-このグループには、指定されたMIBモジュールへのコンプライアンスを請求するためにMTAが実装する必要があるすべてのMIBオブジェクトが含まれており、MTAが実装する必要があります。"
    },
    {
      "indent": 3,
      "text": "pktcLLinePackageGroup - this group contains the MIB objects that need to be implemented to support the L line package.",
      "ja": "PKTCLLINEPACKAGEGROUP-このグループには、Lラインパッケージをサポートするために実装する必要があるMIBオブジェクトが含まれています。"
    },
    {
      "indent": 3,
      "text": "pktcELinePackageGroup - this group contains the MIB objects that need to be implemented to support the E line package.",
      "ja": "PKTCELINEPACKAGEGROUP-このグループには、Eラインパッケージをサポートするために実装する必要があるMIBオブジェクトが含まれています。"
    },
    {
      "indent": 3,
      "text": "pktcInternationalGroup - this group contains optional MIB objects designed to support operations over the widest possible range of markets.",
      "ja": "PKTCINTERNATIONALGROUP-このグループには、可能な限り幅広い市場での運用をサポートするように設計されたオプションのMIBオブジェクトが含まれています。"
    },
    {
      "indent": 0,
      "text": "5. Definitions",
      "section_title": true,
      "ja": "5. 定義"
    },
    {
      "indent": 0,
      "text": "PKTC-IETF-SIG-MIB DEFINITIONS ::= BEGIN",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "IMPORTS\n    MODULE-IDENTITY,\n    OBJECT-TYPE,\n    Integer32,\n    Unsigned32,\n    mib-2\n          FROM SNMPv2-SMI                   -- [RFC2578]\n    InetAddressType,\n    InetAddress,\n    InetPortNumber\n          FROM INET-ADDRESS-MIB             -- [RFC4001]\n    TEXTUAL-CONVENTION,\n    RowStatus,\n    TruthValue\n          FROM SNMPv2-TC                    -- [RFC2579]",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "OBJECT-GROUP,\nMODULE-COMPLIANCE\n      FROM SNMPv2-CONF                  -- [RFC2580]\nSnmpAdminString\n      FROM SNMP-FRAMEWORK-MIB           -- [RFC3411]\nifIndex\n      FROM IF-MIB                       -- [RFC2863]\nDscp\n      FROM DIFFSERV-DSCP-TC;            -- [RFC3289]",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcIetfSigMib MODULE-IDENTITY LAST-UPDATED \"200712180000Z\" -- December 18, 2007 ORGANIZATION \"IETF IPCDN Working Group\" CONTACT-INFO \"Sumanth Channabasappa Cable Television Laboratories, Inc. 858 Coal Creek Circle, Louisville, CO 80027, USA Phone: +1 303-661-3307 Email: Sumanth@cablelabs.com",
      "ja": "PKTCIETFSIGMIBモジュールIDULE IDINTITY最終処分「200712180000Z \" -  2007年12月18日「IETF IPCDNワーキンググループ」「連絡先IPCDNワーキンググループ」-661-3307メール：sumanth@cablelabs.com"
    },
    {
      "indent": 9,
      "text": "Gordon Beacham Motorola, Inc. 6450 Sequence Drive, Bldg. 1 San Diego, CA 92121, USA Phone: +1 858-404-2334 Email: gordon.beacham@motorola.com",
      "ja": "Gordon Beacham Motorola、Inc。6450 Sequence Drive、Bldg。1サンディエゴ、CA 92121、米国電話：1 858-404-2334メール：gordon.beacham@motorola.com"
    },
    {
      "indent": 9,
      "text": "Satish Kumar Mudugere Eswaraiah Texas Instruments India (P) Ltd., Golf view, Wind Tunnel Road Murugesh Palya Bangalore 560 017, INDIA Phone: +91 80 5269451 Email: satish.kumar@ti.com",
      "ja": "Satish Kumar Mudugere Eswaraiah Texas Instruments India（P）Ltd.、Golf View、Wind Tunnel Road Murugesh Palya Bangalore 560 017、電話：91 80 5269451メール：satish.kumar@ti.com"
    },
    {
      "indent": 4,
      "text": "IETF IPCDN Working Group\n     General Discussion: ipcdn@ietf.org\n     Subscribe: http://www.ietf.org/mailman/listinfo/ipcdn\n     Archive: ftp://ftp.ietf.org/ietf-mail-archive/ipcdn\n     Co-Chair: Jean-Francois Mule, jf.mule@cablelabs.com\n     Co-Chair: Richard Woundy, Richard_Woundy@cable.comcast.com\"",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "DESCRIPTION \"This MIB module supplies the basic management objects for the PacketCable and IPCablecom Signaling protocols. This version of the MIB includes common signaling and Network Call Signaling (NCS)-related signaling objects.",
      "ja": "説明 \"このMIBモジュールは、PacketCableおよびIPCablecomシグナル伝達プロトコルの基本的な管理オブジェクトを提供します。MIBのこのバージョンには、共通のシグナル伝達とネットワークコールシグナル伝達（NCS）関連シグナル伝達オブジェクトが含まれます。"
    },
    {
      "indent": 4,
      "text": " Copyright (C) The IETF Trust (2008). This version of this MIB module is part of RFC 5098; see the RFC itself for full legal notices.\" REVISION \"200712180000Z\" DESCRIPTION \"Initial version, published as RFC 5098.\"",
      "ja": "著作権（c）The IETF Trust（2008）。このMIBモジュールのこのバージョンは、RFC 5098の一部です。完全な法的通知については、RFC自体を参照してください。「Revision \"200712180000Z」説明「RFC 5098として公開されている初期バージョン。」"
    },
    {
      "indent": 0,
      "text": "::=  { mib-2 169 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- Textual Conventions",
      "ja": " - テキストの慣習"
    },
    {
      "indent": 0,
      "text": "TenthdBm ::= TEXTUAL-CONVENTION\n    DISPLAY-HINT \"d-1\"\n    STATUS       current\n    DESCRIPTION\n        \"This TEXTUAL-CONVENTION represents power levels that are\n         normally expressed in dBm.  Units are in tenths of a dBm;\n         for example, -13.5 dBm will be represented as -135.\"\n    SYNTAX       Integer32",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "PktcCodecType ::= TEXTUAL-CONVENTION\n    STATUS       current\n    DESCRIPTION\n        \" This TEXTUAL-CONVENTION defines various types of codecs\n          that MAY be supported.  The description for each\n          enumeration is listed below:",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 10,
      "text": "Enumeration     Description\nother           a defined codec not in the enumeration\nunknown         a codec not defined by the PacketCable\n                Codec Specification\ng729            ITU-T Recommendation G.729\nreserved        for future use\ng729E           ITU-T Recommendation G.729E\npcmu            Pulse Code Modulation u-law (PCMU)\ng726at32        ITU-T Recommendation G.726-32 (32 kbit/s)\ng728            ITU-T Recommendation G.728\npcma            Pulse Code Modulation a-law (PCMA)\ng726at16        ITU-T Recommendation G.726-16 (16 kbit/s)\ng726at24        ITU-T Recommendation G.726-24 (24 kbit/s)\ng726at40        ITU-T Recommendation G.726-40 (40 kbit/s)\nilbc            IETF Internet low-bit rate codec\nbv16            Broadcom BroadVoice16",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 10,
      "text": "The list of codecs is consistent with the IETF Real-Time Transport Protocol (RTP) Profile registry and the RTP Map Parameters Table in PacketCable Audio/Video Codecs Specification [PKT-SP-CODEC]. The literal codec name for each codec is listed below:",
      "ja": "コーデックのリストは、IETFリアルタイムトランスポートプロトコル（RTP）プロファイルレジストリと、パケット可能なオーディオ/ビデオコーデック仕様[PKT-SP-Codec]のRTPマップパラメーターテーブルと一致しています。各コーデックのリテラルコーデック名は以下にリストされています。"
    },
    {
      "indent": 10,
      "text": "Codec     Literal Codec Name\ng729              G729\ng729E             G729E\npcmu              PCMU\ng726at32          G726-32\ng728              G728\npcma              PCMA\ng726at16          G726-16\ng726at24          G726-24\ng726at40          G726-40\nilbc              iLBC\nbv16              BV16",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "      The literal codec name is the second column of the table\n      with codec RTP Map Parameters.  The Literal Codec Name Column\n      contains the codec name used in the local connection\n      options (LCO) of the NCS messages create connection\n      (CRCX)/modify connection (MDCX) and is also used to\n      identify the codec in the Call Management System (CMS)\n      Provisioning Specification.  The RTP Map Parameter column of\n      the Table contains the string used in the media attribute\n      line (a=) of the session description protocol (SDP)\n      parameters in NCS messages.\"\nSYNTAX INTEGER {\n           other     (1),\n           unknown   (2),\n           g729      (3),\n           reserved  (4),\n           g729E     (5),\n           pcmu      (6),\n           g726at32  (7),\n           g728      (8),\n           pcma      (9),\n           g726at16  (10),\n           g726at24  (11),\n           g726at40  (12),\n           ilbc      (13),\n           bv16      (14)\n}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "PktcRingCadence   ::= TEXTUAL-CONVENTION\n    STATUS        current\n    DESCRIPTION\n          \"This object provides an encoding scheme for ring\n          cadences, including repeatability characteristics.  All\n          fields in this object MUST be encoded in network-byte\n          order.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 10,
      "text": "The first three higher-order octets are reserved. The octets that follow are used to encode a 'bit-string', with each bit corresponding to 50 milliseconds. A bit value of '1' indicates the presence of a ring-tone, and a bit value of '0' indicates the absence of a ring-tone, for that duration (50 ms) (Note: A minimum number of octets required to encode the bit-string MUST be used).",
      "ja": "最初の3つの高次オクテットは予約されています。続くオクテットは、「ビットストリング」をエンコードするために使用され、各ビットは50ミリ秒に対応します。「1」のビット値は、リングトーンの存在を示し、「0」のビット値は、その期間（50ミリ秒）のリングトーンがないことを示します（注：最小オクテット数に必要なオクテット数ビットストリングをエンコードする必要があります）。"
    },
    {
      "indent": 10,
      "text": "The first two of the reserved octets MUST indicate the length of the encoded cadence (in bits) and MUST range between 1 and 264. (Note: The length in bits MUST also be consistent with the number of octets that encode the cadence). The MTA MUST ignore any unused bits in the last octet, but MUST reflect the value as provided on subsequent SNMP GETs.",
      "ja": "予約されたオクテットの最初の2つは、エンコードされたケイデンスの長さ（ビット）を示す必要があり、1〜264の範囲でなければなりません。MTAは、最後のオクテットの未使用のビットを無視する必要がありますが、後続のSNMPが得られる値を反映する必要があります。"
    },
    {
      "indent": 10,
      "text": "The third of the reserved octets indicates 'repeatability' and MUST be either 0x80 or 0x00 -- the former value indicating 'non-repeatability', and the latter indicating 'repeatability'.",
      "ja": "予約されたオクテットの3番目は「再現性」を示し、0x80または0x00でなければなりません - 「非繰り返し可能性」を示す前者の値、後者は「再現性」を示しています。"
    },
    {
      "indent": 10,
      "text": "The MTA MUST reject attempts to set a value that violates any of the above requirements.\"",
      "ja": "MTAは、上記の要件のいずれかに違反する値を設定しようとする試みを拒否する必要があります。」"
    },
    {
      "indent": 4,
      "text": "SYNTAX OCTET STRING (SIZE(4..36))",
      "ja": "構文オクテット文字列（サイズ（4..36））"
    },
    {
      "indent": 0,
      "text": "PktcSigType     ::= TEXTUAL-CONVENTION\n    STATUS       current\n    DESCRIPTION\n        \" This object lists the various types of signaling that may\n          be supported:",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "      other(1) - set when signaling other than NCS is used\n      ncs(2)   - Network Call Signaling is a derivation of MGCP\n                (Media Gateway Control Protocol) defined for\n                 IPCablecom/PacketCable MTAs.\"\nSYNTAX INTEGER {\n               other(1),\n               ncs(2)\n}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "DtmfCode::=TEXTUAL-CONVENTION STATUS current DESCRIPTION \"This TEXTUAL-CONVENTION represents the Dual-Tone Multi-Frequency (DTMF) Character used to indicate the start or end of the digit transition sequence used for caller id or Visual Message Waiting Indicator (VMWI).",
      "ja": "dtmfcode :: = textual-convention status current current \"このテキストコンベンションは、発信者IDまたは視覚メッセージ待機インジケーター（vmwii）に使用される数字遷移シーケンスの開始または終了を示すために使用されるデュアルトーンマルチ周波数（DTMF）文字を表します。）。"
    },
    {
      "indent": 0,
      "text": "         Note: The DTMF code '*' is indicated using 'dtmfcodeStar',\n         and the DTMF code '#' is indicated using ' dtmfcodeHash'.\"\n    SYNTAX       INTEGER {\n                  dtmfcode0(0),\n                  dtmfcode1(1),\n                  dtmfcode2(2),\n                  dtmfcode3(3),\n                  dtmfcode4(4),\n                  dtmfcode5(5),\n                  dtmfcode6(6),\n                  dtmfcode7(7),\n                  dtmfcode8(8),\n                  dtmfcode9(9),\n                  dtmfcodeStar(10),\n                  dtmfcodeHash(11),\n                  dtmfcodeA(12),\n                  dtmfcodeB(13),\n                  dtmfcodeC(14),\n                  dtmfcodeD(15)\n}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "PktcSubscriberSideSigProtocol::=TEXTUAL-CONVENTION STATUS current DESCRIPTION \"This TEXTUAL-CONVENTION represents the Signaling protocol being used for purposes such as caller id or VMWI.",
      "ja": "pktcsubscribersidigprotocol :: = textual-convention status current current \"このテキストコンベンションは、発信者IDやVMWIなどの目的で使用されるシグナル伝達プロトコルを表します。"
    },
    {
      "indent": 9,
      "text": "A value of fsk(1) indicates Frequency Shift Keying\n(FSK).\nA value of dtmf(2) indicates Dual-Tone Multi-Frequency\n(DTMF).\"\nSYNTAX INTEGER {\n       fsk(1),\n       dtmf(2)\n}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigMibObjects OBJECT IDENTIFIER ::= { pktcIetfSigMib 1 }\npktcSigDevObjects OBJECT IDENTIFIER ::=",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "                                        { pktcSigMibObjects 1 }\npktcSigEndPntConfigObjects OBJECT IDENTIFIER ::=\n                                        { pktcSigMibObjects 2 }\n--\n-- The codec table (pktcSigDevCodecTable) defines all combinations\n-- of codecs supported by the Multimedia Terminal Adapter (MTA).\n--\npktcSigDevCodecTable OBJECT-TYPE\n    SYNTAX      SEQUENCE OF PktcSigDevCodecEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n         \" This table describes the MTA-supported codec types.  An MTA\n          MUST populate this table with all possible combinations of\n          codecs it supports for simultaneous operation.  For example,\n          an MTA with two endpoints may be designed with a particular\n          Digital Signal Processing (DSP) and memory architecture that\n          allows it to support the following fixed combinations of\n          codecs for simultaneous operation:",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 10,
      "text": "Codec Type Maximum Number of Simultaneous Codecs PCMA 3",
      "ja": "コーデックタイプの最大数Codecs PCMA 3"
    },
    {
      "indent": 10,
      "text": "PCMA                             2\nPCMU                             1",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 10,
      "text": "PCMA 1",
      "ja": "PCMA 1"
    },
    {
      "indent": 10,
      "text": "PCMU 2",
      "ja": "PCMU 2"
    },
    {
      "indent": 10,
      "text": "PCMU 3",
      "ja": "PCMU 3"
    },
    {
      "indent": 10,
      "text": "PCMA                             1\nG729                             1",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 10,
      "text": "G729 2",
      "ja": "G729 2"
    },
    {
      "indent": 10,
      "text": "PCMU                             1\nG729                             1",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 10,
      "text": "Based on this example, the entries in the codec table would be:",
      "ja": "この例に基づいて、コーデックテーブルのエントリは次のとおりです。"
    },
    {
      "indent": 10,
      "text": "  pktcSigDev        pktcSigDev        pktcSigDev\nCodecComboIndex     CodecType          CodecMax\n       1               pcma                3\n       2               pcma                2\n       2               pcmu                1\n                 3               pcma                1\n       3               pcmu                2\n       4               pcmu                3\n       5               pcma                1\n       5               g729                1\n       6               g729                2\n       7               pcmu                1\n       7               g729                1",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 10,
      "text": "An operator querying this table is able to determine all possible codec combinations the MTA is capable of simultaneously supporting.",
      "ja": "このテーブルをクエリするオペレーターは、MTAが同時にサポートできるすべての可能なコーデックの組み合わせを決定することができます。"
    },
    {
      "indent": 4,
      "text": "      This table MUST NOT include non-voice codecs.\"\n::= { pktcSigDevObjects 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigDevCodecEntry  OBJECT-TYPE\n    SYNTAX      PktcSigDevCodecEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"Each entry represents the maximum number of active\n         connections with a particular codec the MTA is capable of\n         supporting.  Each row is indexed by a composite key\n         consisting of a number enumerating the particular codec\n         combination and the codec type.\"\n    INDEX { pktcSigDevCodecComboIndex, pktcSigDevCodecType }\n    ::= { pktcSigDevCodecTable 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "PktcSigDevCodecEntry  ::= SEQUENCE {\n    pktcSigDevCodecComboIndex    Unsigned32,\n    pktcSigDevCodecType     PktcCodecType,\n    pktcSigDevCodecMax      Unsigned32\n    }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigDevCodecComboIndex  OBJECT-TYPE\n    SYNTAX      Unsigned32 (1..255)\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \" The index value that enumerates a particular codec\n          combination in the pktcSigDevCodecTable.\"\n    ::= { pktcSigDevCodecEntry 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigDevCodecType  OBJECT-TYPE\n    SYNTAX       PktcCodecType\n    MAX-ACCESS   not-accessible\n    STATUS       current\n    DESCRIPTION\n        \" A codec type supported by this MTA.\"\n    ::= { pktcSigDevCodecEntry 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigDevCodecMax  OBJECT-TYPE\n    SYNTAX      Unsigned32(1..255)\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \" The maximum number of simultaneous sessions of a\n          particular codec that the MTA can support.\"\n    ::= { pktcSigDevCodecEntry 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "--\n-- These are the common signaling-related definitions that affect\n-- the entire MTA device.\n--",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigDevEchoCancellation  OBJECT-TYPE\n    SYNTAX       TruthValue\n    MAX-ACCESS   read-only\n    STATUS       current\n    DESCRIPTION\n        \" This object specifies if the device is capable of echo\n          cancellation.  The MTA MUST set this MIB object to a\n          value of true(1) if it is capable of echo\n          cancellation, and a value of false(2) if not.\"\n    ::= { pktcSigDevObjects 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigDevSilenceSuppression  OBJECT-TYPE\n    SYNTAX       TruthValue\n    MAX-ACCESS   read-only\n    STATUS       current\n    DESCRIPTION\n        \" This object specifies if the device is capable of\n          silence suppression (as a result of Voice Activity\n          Detection).  The MTA MUST set this MIB object to a\n          value of true(1) if it is capable of silence\n          suppression, and a value of false(2) if not.\"\n::= { pktcSigDevObjects 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigDevCidSigProtocol OBJECT-TYPE SYNTAX PktcSubscriberSideSigProtocol MAX-ACCESS read-write STATUS current DESCRIPTION \"This object is used to configure the subscriber-line protocol used for signaling on-hook caller id information.",
      "ja": "PKTCSIGDEVCIDSIGPROTOCOLオブジェクトタイプの構文PKTCSUBSCRIMSIGSPROTOCOL MAX-ACCESS READ-WRITEステータス現在の説明 \"このオブジェクトは、オンフックカラーID情報の信号に使用されるサブスクライバーラインプロトコルの構成に使用されます。"
    },
    {
      "indent": 9,
      "text": "Different countries define different caller id signaling protocols to support caller identification.",
      "ja": "さまざまな国が、発信者の識別をサポートするために、さまざまな発信者IDシグナリングプロトコルを定義します。"
    },
    {
      "indent": 9,
      "text": "Setting this object at a value fsk(1) sets the subscriber line protocol to be Frequency Shift Keying (FSK).",
      "ja": "このオブジェクトを値FSK（1）に設定すると、サブスクライバーラインプロトコルを周波数シフトキーイング（FSK）に設定します。"
    },
    {
      "indent": 9,
      "text": "Setting this object at a value dtmf(2) sets the subscriber line protocol to be Dual-Tone Multi-Frequency (DTMF).",
      "ja": "このオブジェクトを値DTMF（2）に設定すると、サブスクライバーラインプロトコルをデュアルトーンマルチ周波数（DTMF）に設定します。"
    },
    {
      "indent": 0,
      "text": "         The value of this MIB object MUST NOT persist across MTA\n         reboots.\"\n     REFERENCE\n        \"ETSI-EN-300-659-1 Specification\"\n     DEFVAL { fsk }\n::= { pktcSigDevObjects 4 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigDevR0Cadence OBJECT-TYPE SYNTAX PktcRingCadence MAX-ACCESS read-write STATUS current DESCRIPTION \" This object specifies ring cadence 0 (a user-defined field).",
      "ja": "PKTCSIGDEVR0CADENCEオブジェクトタイプ構文PKTCRINGCADENCE MAX-ACCESS READ-WRITEステータス現在の説明 \"このオブジェクトは、リングケイデンス0（ユーザー定義フィールド）を指定します。"
    },
    {
      "indent": 4,
      "text": "      The value of this MIB object MUST NOT persist across MTA\n      reboots.\"\n::= { pktcSigDevObjects 5 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigDevR1Cadence OBJECT-TYPE SYNTAX PktcRingCadence MAX-ACCESS read-write STATUS current DESCRIPTION \" This object specifies ring cadence 1 (a user-defined field).",
      "ja": "pktcsigdevr1cadenceオブジェクトタイプ構文pktcringcadence max-access read-writeステータス現在の説明 \"このオブジェクトは、リングケイデンス1（ユーザー定義フィールド）を指定します。"
    },
    {
      "indent": 4,
      "text": "      The value of this MIB object MUST NOT persist across MTA\n      reboots.\"\n::= { pktcSigDevObjects 6 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigDevR2Cadence OBJECT-TYPE SYNTAX PktcRingCadence MAX-ACCESS read-write STATUS current DESCRIPTION \" This object specifies ring cadence 2 (a user-defined field).",
      "ja": "pktcsigdevr2cadence object-type syntax pktcringcadence max-access read-writeステータス現在の説明 \"このオブジェクトは、リングケーデンス2（ユーザー定義フィールド）を指定します。"
    },
    {
      "indent": 4,
      "text": "      The value of this MIB object MUST NOT persist across MTA\n      reboots.\"\n::= { pktcSigDevObjects 7 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigDevR3Cadence OBJECT-TYPE SYNTAX PktcRingCadence MAX-ACCESS read-write STATUS current DESCRIPTION \" This object specifies ring cadence 3 (a user-defined field).",
      "ja": "pktcsigdevr3cadenceオブジェクトタイプ構文pktcringcadence max-access read-writeステータス現在の説明 \"このオブジェクトは、リングケーデンス3（ユーザー定義のフィールド）を指定します。"
    },
    {
      "indent": 4,
      "text": "      The value of this MIB object MUST NOT persist across MTA\n      reboots.\"\n::= { pktcSigDevObjects 8 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigDevR4Cadence OBJECT-TYPE SYNTAX PktcRingCadence MAX-ACCESS read-write STATUS current DESCRIPTION \" This object specifies ring cadence 4 (a user-defined field).",
      "ja": "pktcsigdevr4cadenceオブジェクトタイプ構文pktcringcadence max-access read-writeステータス現在の説明 \"このオブジェクトは、リングケイデンス4（ユーザー定義のフィールド）を指定します。"
    },
    {
      "indent": 4,
      "text": "      The value of this MIB object MUST NOT persist across MTA\n      reboots.\"\n::= { pktcSigDevObjects 9 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigDevR5Cadence OBJECT-TYPE SYNTAX PktcRingCadence MAX-ACCESS read-write STATUS current DESCRIPTION \" This object specifies ring cadence 5 (a user-defined field).",
      "ja": "PKTCSIGDEVR5CADENCEオブジェクトタイプ構文PKTCRINGCADENCE MAX-ACCESS READ-WRITEステータス現在の説明 \"このオブジェクトは、リングケーデンス5（ユーザー定義フィールド）を指定します。"
    },
    {
      "indent": 4,
      "text": "      The value of this MIB object MUST NOT persist across MTA\n      reboots.\"\n::= { pktcSigDevObjects 10 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigDevR6Cadence OBJECT-TYPE SYNTAX PktcRingCadence MAX-ACCESS read-write STATUS current DESCRIPTION \" This object specifies ring cadence 6 (a user-defined field).",
      "ja": "pktcsigdevr6cadenceオブジェクトタイプ構文pktcringcadence max-access read-writeステータス現在の説明 \"このオブジェクトは、リングケイデンス6（ユーザー定義フィールド）を指定します。"
    },
    {
      "indent": 4,
      "text": "      The value of this MIB object MUST NOT persist across MTA\n      reboots.\"\n::= { pktcSigDevObjects 11 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigDevR7Cadence OBJECT-TYPE SYNTAX PktcRingCadence MAX-ACCESS read-write STATUS current DESCRIPTION \" This object specifies ring cadence 7 (a user-defined field).",
      "ja": "pktcsigdevr7cadenceオブジェクトタイプ構文pktcringcadence max-access read-writeステータス現在の説明 \"このオブジェクトは、リングケーデンス7（ユーザー定義フィールド）を指定します。"
    },
    {
      "indent": 4,
      "text": "      The value of this MIB object MUST NOT persist across MTA\n      reboots.\"\n::= { pktcSigDevObjects 12 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigDevRgCadence OBJECT-TYPE SYNTAX PktcRingCadence MAX-ACCESS read-write STATUS current DESCRIPTION \" This object specifies ring cadence rg (a user-defined field).",
      "ja": "pktcsigdevrgcadenceオブジェクトタイプ構文pktcringcadence max-access read-writeステータス現在の説明 \"このオブジェクトは、リングケーデンスRG（ユーザー定義フィールド）を指定します。"
    },
    {
      "indent": 4,
      "text": "      The value of this MIB object MUST NOT persist across MTA\n      reboots.\"\n::= { pktcSigDevObjects 13 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigDevRsCadence OBJECT-TYPE SYNTAX PktcRingCadence MAX-ACCESS read-write STATUS current DESCRIPTION \" This object specifies ring cadence rs (a user-defined field). The MTA MUST reject any attempt to make this object repeatable.",
      "ja": "pktcsigdevrscadenceオブジェクトタイプの構文pktcringcadence max-access read-writeステータス現在の説明 \"このオブジェクトは、リングケーデンスrs（ユーザー定義のフィールド）を指定します。MTAは、このオブジェクトを繰り返し可能にする試みを拒否する必要があります。"
    },
    {
      "indent": 4,
      "text": "      The value of this MIB object MUST NOT persist across MTA\n      reboots.\"\n::= { pktcSigDevObjects 14 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigDefCallSigDscp OBJECT-TYPE SYNTAX Dscp -- RFC 3289: DIFFSERV-DSCP-TC MAX-ACCESS read-write STATUS current DESCRIPTION \" The default value used in the IP header for setting the Differentiated Services Code Point (DSCP) value for call signaling.",
      "ja": "PKTCSIGDEFCALLSIGDSCPオブジェクトタイプ構文DSCP-RFC 3289：DIFFSERV-DSCP-TC MAX-ACCESS READ-WRITEステータス現在の説明 \"DISTERIATED SERVICES CODE POINT（DSCP）値をコールシグナル伝達に設定するためにIPヘッダーで使用されるデフォルト値。"
    },
    {
      "indent": 4,
      "text": "      The value of this MIB object MUST NOT persist across MTA\n      reboots.\"\nDEFVAL { 0 }\n::= { pktcSigDevObjects 15 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigDefMediaStreamDscp OBJECT-TYPE SYNTAX Dscp -- RFC 3289: DIFFSERV-DSCP-TC MAX-ACCESS read-write STATUS current DESCRIPTION \" This object contains the default value used in the IP header for setting the Differentiated Services Code Point (DSCP) value for media stream packets. The MTA MUST NOT update this object with the value supplied by the CMS in the NCS messages (if present). Any currently active connections are not affected by updates to this object. When the value of this object is updated by SNMP, the MTA MUST use the new value as a default starting only from new connections.",
      "ja": "PKTCSIGDEFMEDIASTREAMDSCPオブジェクトタイプ構文DSCP-RFC 3289：DIFSERV-DSCP-TC MAX-ACCESS READ-WRITEステータス現在の説明 \"このオブジェクトには、メディアの差別化されたサービスコードポイント（DSCP）値を設定するためにIPヘッダーに使用されるデフォルト値が含まれています。ストリームパケット。MTAは、NCSメッセージ内のCMSが提供する値でこのオブジェクトを更新してはなりません（存在する場合）。現在アクティブな接続はこのオブジェクトの更新によって影響を受けません。このオブジェクトの値がSNMPによって更新された場合、MTAは、新しい接続からのみ開始するデフォルトとして新しい値を使用する必要があります。"
    },
    {
      "indent": 4,
      "text": "      The value of this MIB object MUST NOT persist across MTA\n      reboots.\"\nDEFVAL { 0 }\n::= { pktcSigDevObjects 16 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "--\n-- pktcSigCapabilityTable - This table defines the valid signaling\n-- types supported by this MTA.\n--",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigCapabilityTable    OBJECT-TYPE\n    SYNTAX        SEQUENCE OF PktcSigCapabilityEntry\n    MAX-ACCESS    not-accessible\n    STATUS        current\n    DESCRIPTION\n        \" This table describes the signaling types supported by this\n          MTA.\"\n    ::= { pktcSigDevObjects 17 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigCapabilityEntry    OBJECT-TYPE\n    SYNTAX        PktcSigCapabilityEntry\n    MAX-ACCESS    not-accessible\n    STATUS        current\n    DESCRIPTION\n        \" Entries in pktcMtaDevSigCapabilityTable - list of\n          supported signaling types, versions, and vendor extensions\n          for this MTA.  Each entry in the list provides for one\n          signaling type and version combination.  If the device\n          supports multiple versions of the same signaling type, it\n          will require multiple entries.\"\n    INDEX { pktcSigCapabilityIndex }\n    ::= { pktcSigCapabilityTable 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "PktcSigCapabilityEntry  ::= SEQUENCE {\n    pktcSigCapabilityIndex             Unsigned32,\n    pktcSigCapabilityType              PktcSigType,\n    pktcSigCapabilityVersion           SnmpAdminString,\n    pktcSigCapabilityVendorExt         SnmpAdminString\n    }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigCapabilityIndex       OBJECT-TYPE\n    SYNTAX        Unsigned32 (1..255)\n    MAX-ACCESS    not-accessible\n    STATUS        current\n    DESCRIPTION\n        \" The index value that uniquely identifies an entry in the\n          pktcSigCapabilityTable.\"\n    ::= { pktcSigCapabilityEntry 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigCapabilityType      OBJECT-TYPE\n    SYNTAX        PktcSigType\n    MAX-ACCESS    read-only\n    STATUS        current\n    DESCRIPTION\n        \" This object identifies the type of signaling used.  This\n          value has to be associated with a single signaling\n          version.\"\n    ::= { pktcSigCapabilityEntry 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigCapabilityVersion      OBJECT-TYPE\n    SYNTAX        SnmpAdminString\n    MAX-ACCESS    read-only\n    STATUS        current\n    DESCRIPTION\n        \" Provides the version of the signaling type - reference\n          pktcSigCapabilityType.  Examples would be 1.0 or 2.33 etc.\"\n    ::= { pktcSigCapabilityEntry 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigCapabilityVendorExt OBJECT-TYPE SYNTAX SnmpAdminString MAX-ACCESS read-only STATUS current DESCRIPTION \" The vendor extension allows vendors to provide a list of",
      "ja": "pktcsigcapabilityvendorext object-type sntax snmpadminstring max-access read-only status current current \"ベンダー拡張機能により、ベンダーはのリストを提供できます"
    },
    {
      "indent": 10,
      "text": "additional capabilities.",
      "ja": "追加の機能。"
    },
    {
      "indent": 10,
      "text": "The syntax for this MIB object in ABNF ([RFC5234]) is specified to be zero or more occurrences of vendor extensions, as follows:",
      "ja": "ABNF（[RFC5234]）のこのMIBオブジェクトの構文は、次のように、ベンダー拡張機能のゼロ以上の発生に指定されています。"
    },
    {
      "indent": 11,
      "text": "pktcSigCapabilityVendorExt  = *(vendor-extension)\nvendor-extension = (ext symbol alphanum) DQUOTE ; DQUOTE\next      = DQUOTE %x58 DQUOTE\nsymbol   = (DQUOTE %x2D DQUOTE)/(DQUOTE %x2D DQUOTE)\nalphanum = 1*6(ALPHA/DIGIT)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "    \"\n::= { pktcSigCapabilityEntry 4 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigDefNcsReceiveUdpPort OBJECT-TYPE SYNTAX InetPortNumber (1025..65535) MAX-ACCESS read-only STATUS current DESCRIPTION \" This object contains the MTA User Datagram Protocol (UDP) receive port that is being used for NCS call signaling. This object should only be changed by the configuration file.",
      "ja": "pktcsigdefncsreceiveudpport object-type syntax inetportnumber（1025..65535）max-access read-only status current current current current \"このオブジェクトには、MTAユーザーデータグラムプロトコル（UDP）が含まれています。構成ファイルによって。"
    },
    {
      "indent": 4,
      "text": "      Unless changed via configuration, this MIB object MUST\n      reflect a value of '2427'.\"\nREFERENCE\n    \"PacketCable NCS Specification\"\n::= { pktcSigDevObjects 18 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigPowerRingFrequency    OBJECT-TYPE\n    SYNTAX       INTEGER {\n                 f20Hz(1),\n                 f25Hz(2),\n                 f33Point33Hz(3),\n                 f50Hz(4),\n                 f15Hz(5),\n                 f16Hz(6),\n                 f22Hz(7),\n                 f23Hz(8),\n                 f45Hz(9)\n    }\n    MAX-ACCESS   read-only\n    STATUS       current\n    DESCRIPTION\n        \" This object must only be provided via the configuration\n          file during the provisioning process.  The power ring\n          frequency is the frequency at which the sinusoidal voltage\n          must travel down the twisted pair to make terminal\n          equipment ring.  Different countries define different\n          electrical characteristics to make terminal equipment\n          ring.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "      The f20Hz setting corresponds to a power ring frequency\n      of 20 Hertz.  The f25Hz setting corresponds to a power ring\n      frequency of 25 Hertz.  The f33Point33Hz setting\n      corresponds to a power ring frequency of 33.33 Hertz.  The\n      f50Hz setting corresponds to a power ring frequency of 50\n      Hertz.  The f15Hz setting corresponds to a power ring\n      frequency of 15 Hertz.  The f16Hz setting corresponds to a\n      power ring frequency of 16 Hertz.  The f22Hz setting\n      corresponds to a power ring frequency of 22 Hertz.  The\n      f23Hz setting corresponds to a power ring frequency of 23\n      Hertz.  The f45Hz setting corresponds to a power ring\n      frequency of 45 Hertz.\"\nREFERENCE\n      \"ETSI-EN-300-001\"\n::= { pktcSigDevObjects 19 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigPulseSignalTable    OBJECT-TYPE\n    SYNTAX       SEQUENCE OF PktcSigPulseSignalEntry\n    MAX-ACCESS   not-accessible\n    STATUS       current\n    DESCRIPTION\n        \" The Pulse signal table defines the pulse signal operation.\n          There are nine types of international pulse signals,\n          with each signal having a set of provisionable parameters.\n          The values of the MIB objects in this table take effect\n          only if these parameters are not defined via signaling, in\n          which case, the latter determines the values of the\n          parameters.  The MIB objects in this table do not persist\n          across MTA reboots.\"\n    REFERENCE\n        \"ETSI-TS-101-909-4 Specification\"\n    ::= { pktcSigDevObjects 20 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigPulseSignalEntry OBJECT-TYPE SYNTAX PktcSigPulseSignalEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \" This object defines the set of parameters associated with each particular value of pktcSigPulseSignalType. Each entry in the pktcSigPulseSignalTable is indexed by the pktcSigPulseSignalType object.",
      "ja": "pktcsigpulsesignalentryオブジェクトタイプ構文pktcsigpulsesignalentry max-access not-accessable current現在の説明 \"このオブジェクトは、pktcsigpulsesignaltypeの各特定の値に関連する各パラメーターのセットを定義します。"
    },
    {
      "indent": 4,
      "text": "      The conceptual rows MUST NOT persist across MTA reboots.\"\nINDEX { pktcSigPulseSignalType }\n::= { pktcSigPulseSignalTable 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "PktcSigPulseSignalEntry ::= SEQUENCE {\n        pktcSigPulseSignalType              INTEGER,\n        pktcSigPulseSignalFrequency         INTEGER,\n        pktcSigPulseSignalDbLevel           TenthdBm,\n        pktcSigPulseSignalDuration          Unsigned32,\n        pktcSigPulseSignalPulseInterval     Unsigned32,\n        pktcSigPulseSignalRepeatCount       Unsigned32\n}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigPulseSignalType    OBJECT-TYPE\n    SYNTAX       INTEGER\n                 {\n                     initialRing(1),\n                     pulseLoopClose(2),\n                     pulseLoopOpen(3),\n                     enableMeterPulse(4),\n                     meterPulseBurst(5),\n                     pulseNoBattery(6),\n                     pulseNormalPolarity(7),\n                     pulseReducedBattery(8),\n                     pulseReversePolarity(9)\n                 }\n    MAX-ACCESS   not-accessible\n    STATUS       current\n    DESCRIPTION\n        \"There are nine types of international pulse signals.  These\n         signals are defined as follows:\n         initial ring\n         pulse loop close\n         pulse loop open\n         enable meter pulse\n         meter pulse burst\n         pulse no battery\n         pulse normal polarity\n         pulse reduced battery\n         pulse reverse polarity\"\n    REFERENCE\n        \"ETSI-EN-300-324-1 Specification\"",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "::= { pktcSigPulseSignalEntry 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigPulseSignalFrequency    OBJECT-TYPE\n    SYNTAX       INTEGER {\n                 twentyfive(1),\n                 twelvethousand(2),\n                 sixteenthousand(3)\n    }\n    MAX-ACCESS   read-write\n    STATUS       current\n    DESCRIPTION\n        \" This object is only applicable to the initialRing,\n          enableMeterPulse, and meterPulseBurst signal types.  This\n          object identifies the frequency of the generated signal.\n          The following table defines the default values for this\n          object depending on signal type:",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 10,
      "text": "pktcSigPulseSignalType     Default\ninitialRing                25\nenableMeterPulse           16000\nmeterPulseBurst            16000",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "      The value of twentyfive MUST only be used for the\n      initialRing signal type.  The values of twelvethousand and\n      sixteenthousand MUST only be used for enableMeterPulse and\n      meterPulseBurst signal types.  An attempt to set this\n      object while the value of pktcSigPulseSignalType is not\n      initialRing, enableMeterPulse, or meterPulseBurst will\n      result in an 'inconsistentValue' error.\"\nREFERENCE\n    \"ETSI-EN-300-001 Specification\"\n     ::= { pktcSigPulseSignalEntry 2}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigPulseSignalDbLevel OBJECT-TYPE SYNTAX TenthdBm (-350..0) UNITS \"1/10 of a dBm\" MAX-ACCESS read-write STATUS current DESCRIPTION \" This object is only applicable to the enableMeterPulse and meterPulseBurst signal types. This is the decibel level for each frequency at which tones could be generated at the a and b terminals (TE connection point). An attempt to set this object while the value of pktcSigPulseSignalType is not enableMeterPulse or meterPulseBurst will result in an 'inconsistentValue' error.\" REFERENCE \"ETSI-EN-300-001 Specification\"",
      "ja": "PKTCSIGPULSESIGNALDBLEVEL OBJECT-TYPE SYNTAX TENTHDBM（-350..0）ユニット \"1/10 of a dbm\" max-access read-writeステータス現在の説明 \"このオブジェクトは、enablemeterpulseおよびmeterpulseburstシグナルタイプにのみ適用できます。AおよびB端子（TE接続ポイント）でトーンを生成できる各周波数について。このオブジェクトを設定しようとすると、PKTCSIGPULSESIGNALTYPEの値が有効化またはメーターパルスバーストが「矛盾した値」エラーになります。参照「Etsi-en-300-001仕様」"
    },
    {
      "indent": 4,
      "text": "DEFVAL { -135 }\n::={pktcSigPulseSignalEntry 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigPulseSignalDuration OBJECT-TYPE",
      "ja": "pktcsigpulsesign aldurationオブジェクトタイプ"
    },
    {
      "indent": 4,
      "text": "SYNTAX Unsigned32 (0..5000) UNITS \"Milliseconds\" MAX-ACCESS read-write STATUS current DESCRIPTION \" This object specifies the pulse duration for each signal type. In addition, the MTA must accept the values in the incremental steps specific for each signal type. The following table defines the default values and the incremental steps for this object depending on the signal type:",
      "ja": "構文Unstax unsigned32（0..5000）ユニット \"milliseconds\" max-access read-writeステータス現在の説明 \"このオブジェクトは、各信号タイプのパルス期間を指定します。さらに、mtaは各信号に固有の増分ステップで値を受け入れる必要があります。タイプ。次の表は、信号タイプに応じて、このオブジェクトのデフォルト値と増分ステップを定義します。"
    },
    {
      "indent": 10,
      "text": "pktcSigPulseSignaltype  Default (ms)   Increment (ms)\ninitialRing                 200             50\npulseLoopClose              200             10\npulseLoopOpen               200             10\nenableMeterPulse            150             10\nmeterPulseBurst             150             10\npulseNoBattery              200             10\npulseNormalPolarity         200             10\npulseReducedBattery         200             10\npulseReversePolarity        200             10",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "      An attempt to set this object to a value that does not\n      fall on one of the increment boundaries, or on the wrong\n      increment boundary for the specific signal type, will\n      result in an 'inconsistentValue' error.\"\nREFERENCE\n    \"ETSI-EN-300-324-1 Specification\"\n     ::= {pktcSigPulseSignalEntry 4 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigPulseSignalPulseInterval OBJECT-TYPE SYNTAX Unsigned32 (0..5000) UNITS \"Milliseconds\" MAX-ACCESS read-write STATUS current DESCRIPTION \" This object specifies the repeat interval, or the period, for each signal type. In addition, the MTA must accept the values in the incremental steps specific for each signal type. The following table defines the default values and the incremental steps for this object, depending on the signal type:",
      "ja": "PKTCSIGPULSESIGNALPULSEINTERVALオブジェクトタイプの構文untisined32（0..5000）ユニット「Milliseconds \"max-access read-writeステータス現在の説明\"このオブジェクトは、各信号タイプの繰り返し間隔、または各期間を指定します。各信号タイプに固有の増分ステップの値。次の表は、信号タイプに応じて、このオブジェクトのデフォルト値と増分ステップを定義します。"
    },
    {
      "indent": 10,
      "text": "pktcSigPulseSignaltype  Default (ms)   Increment (ms)\ninitialRing                 200             50\npulseLoopClose             1000             10\npulseLoopOpen              1000             10\n          enableMeterPulse           1000             10\nmeterPulseBurst            1000             10\npulseNoBattery             1000             10\npulseNormalPolarity        1000             10\npulseReducedBattery        1000             10\npulseReversePolarity       1000             10",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "      An attempt to set this object to a value that does not\n      fall on one of the increment boundaries, or on the wrong\n      increment boundary for the specific signal type, will\n      result in an 'inconsistentValue' error.\"\nREFERENCE\n    \"ETSI-EN-300-324-1 Specification\"\n     ::= { pktcSigPulseSignalEntry 5}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigPulseSignalRepeatCount OBJECT-TYPE SYNTAX Unsigned32 (1..50) MAX-ACCESS read-write STATUS current DESCRIPTION \" This object specifies how many times to repeat a pulse. This object is not used by the enableMeterPulse signal type, and in that case, the value is irrelevant. The following table defines the default values and the valid ranges for this object, depending on the signal type:",
      "ja": "pktcsigpulsesignalrepeatcount object-type sntax untigned32（1..50）max-access read-writeステータス現在の説明 \"このオブジェクトは、パルスを繰り返すために数回指定します。値は無関係です。次の表は、信号タイプに応じて、このオブジェクトのデフォルト値と有効な範囲を定義します。"
    },
    {
      "indent": 10,
      "text": "pktcSigPulseSignaltype Default Range",
      "ja": "PKTCSIGPULSESIGNALTYPEデフォルト範囲"
    },
    {
      "indent": 10,
      "text": "initialRing                1       1-5\npulseLoopClose             1       1-50\npulseLoopOpen              1       1-50\nenableMeterPulse      (any value)(but not used)\nmeterPulseBurst            1       1-50\npulseNoBattery             1       1-50\npulseNormalPolarity        1       1-50\npulseReducedBattery        1       1-50\npulseReversePolarity       1       1-50",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": " An attempt to set this object to a value that does not fall within the range for the specific signal type will result in an 'inconsistentValue' error.\" ::={ pktcSigPulseSignalEntry 6 }",
      "ja": "このオブジェクトを特定の信号タイプの範囲内に該当しない値に設定しようとすると、「一貫性のない値」エラーが発生します。 \":: = {pktcsigpulsesignalentry 6}}}"
    },
    {
      "indent": 0,
      "text": "pktcSigDevCidMode    OBJECT-TYPE\n    SYNTAX       INTEGER {\n                 duringRingingETS(1),\n                 dtAsETS(2),\n                 rpAsETS(3),\n                 lrAsETS(4),\n                 lrETS(5)\n                 }\n    MAX-ACCESS read-write\n    STATUS current\n    DESCRIPTION\n        \" For on-hook caller id, pktcSigDevCidMode selects the method\n          for representing and signaling caller identification.  For\n          the duringRingingETS method, the Frequency Shift Keying\n          (FSK) or the Dual-Tone Multi-Frequency (DTMF) containing\n          the caller identification information is sent between the\n          first and second ring pattern.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 10,
      "text": "For the dtAsETS,rpAsETS, lrAsETS and lrETS methods, the FSK or DTMF containing the caller id information is sent before the first ring pattern.",
      "ja": "DTASET、RPASETS、LRASETS、LRETSメソッドの場合、発信者ID情報を含むFSKまたはDTMFが最初のリングパターンの前に送信されます。"
    },
    {
      "indent": 10,
      "text": "For the dtAsETS method, the FSK or DTMF is sent after the Dual Tone Alert Signal. For the rpAsETS method, the FSK or DTMF is sent after a Ring Pulse.",
      "ja": "DTASETSメソッドの場合、FSKまたはDTMFはデュアルトーンアラート信号の後に送信されます。RPASETSメソッドの場合、FSKまたはDTMFはリングパルスの後に送信されます。"
    },
    {
      "indent": 10,
      "text": "For the lrAsETS method, the Line Reversal occurs first, then the Dual Tone Alert Signal, and, finally, the FSK or DTMF is sent.",
      "ja": "LRASETSメソッドの場合、ライン反転が最初に発生し、次にデュアルトーンアラート信号が発生し、最後にFSKまたはDTMFが送信されます。"
    },
    {
      "indent": 10,
      "text": "For the lrETS method, the Line Reversal occurs first, then the FSK or DTMF is sent.",
      "ja": "LRETSメソッドの場合、ラインの反転が最初に発生し、次にFSKまたはDTMFが送信されます。"
    },
    {
      "indent": 10,
      "text": "The value of this MIB object MUST NOT persist across MTA reboots.\"",
      "ja": "このMIBオブジェクトの値は、MTAの再起動全体で持続してはなりません。」"
    },
    {
      "indent": 4,
      "text": "DEFVAL { rpAsETS}\n::= {pktcSigDevObjects 21 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigDevCidAfterRing OBJECT-TYPE SYNTAX Unsigned32 (0|50..2000) UNITS \"Milliseconds\" MAX-ACCESS read-write STATUS current DESCRIPTION \" This object specifies the delay between the end of first ringing pattern and the start of the transmission of the FSK or DTMF containing the caller id information. It is only used when pktcSigDevCidMode is set to a value of 'duringRingingETS'.",
      "ja": "pktcsigdevcidafterring object-type sntax untigned32（0 | 50..2000）単位 \"milliseconds\" max-access read-writeステータス現在の説明 \"このオブジェクトは、最初のリンギングパターンの終わりとFSKまたはFSKまたは伝送の開始の間の遅延を指定します。発信者ID情報を含むDTMF。これは、PKTCSIGDEVCIDMODEが「ingringingets」の値に設定されている場合にのみ使用されます。"
    },
    {
      "indent": 10,
      "text": "The following table defines the default values for this MIB object, depending on the signal type",
      "ja": "次の表は、信号タイプに応じて、このMIBオブジェクトのデフォルト値を定義しています"
    },
    {
      "indent": 9,
      "text": "(pktcSigDevCidMode), and MUST be followed:",
      "ja": "（pktcsigdevcidmode）、および次のように従う必要があります。"
    },
    {
      "indent": 10,
      "text": "Value of pktcSigDevCidMode Default value",
      "ja": "PKTCSIGDEVCIDMODEデフォルト値の値"
    },
    {
      "indent": 10,
      "text": "duringringingETS                 550 ms\ndtAsETS                          any value (not used)\nrpAsETS                          any value (not used)\nlrAsETS                          any value (not used)\nlrETS                            any value (not used)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 10,
      "text": "An attempt to set this object while the value of pktcSigDevCidMode is not duringringingETS will result in an 'inconsistentValue' error.",
      "ja": "pktcsigdevcidmodeの値が折り畳み中にない間にこのオブジェクトを設定しようとすると、「一貫性のない値」エラーが発生します。"
    },
    {
      "indent": 4,
      "text": "      The value of this MIB object MUST NOT persist across MTA\n      reboots.\"\nREFERENCE\n    \"ETSI-EN-300-659-1 Specification\"\nDEFVAL { 550 }\n::= {pktcSigDevObjects 22 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigDevCidAfterDTAS OBJECT-TYPE SYNTAX Unsigned32 (0|45..500) UNITS \"Milliseconds\" MAX-ACCESS read-write STATUS current DESCRIPTION \" This object specifies the delay between the end of the Dual Tone Alert Signal (DT-AS) and the start of the transmission of the FSK or DTMF containing the caller id information. This object is only used when pktcSigDevCidMode is set to a value of 'dtAsETS' or 'lrAsETS'.",
      "ja": "pktcsigdevcidafterdtas object-type syntax unting32（0 | 45..500）unit \"milliseconds\" max-access read-writeステータス現在の説明 \"このオブジェクトは、デュアルトーンアラート信号（dt-as）の終わりの間の遅延を指定します。発信者ID情報を含むFSKまたはDTMFの送信。このオブジェクトは、PKTCSIGDEVCIDMODEが「dtasets」または「lrasets」の値に設定されている場合にのみ使用されます。"
    },
    {
      "indent": 9,
      "text": " The following table defines the default values for this MIB object, depending on the signal type (pktcSigDevCidMode), and MUST be followed:",
      "ja": "次の表は、信号タイプ（PKTCSIGDEVCIDMODE）に応じて、このMIBオブジェクトのデフォルト値を定義し、次のことを実行する必要があります。"
    },
    {
      "indent": 10,
      "text": "Value of pktcSigDevCidMode Default value",
      "ja": "PKTCSIGDEVCIDMODEデフォルト値の値"
    },
    {
      "indent": 10,
      "text": "duringringingETS                 any value (not used)\ndtAsETS                          50 ms\nrpAsETS                          any value (not used)\nlrAsETS                          50 ms\nlrETS                            any value (not used)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 10,
      "text": "An attempt to set this object while the value of pktcSigDevCidMode is not 'dtAsETS' or 'lrAsETS' will result in an 'inconsistentValue' error.",
      "ja": "pktcsigdevcidmodeの値が「dtasets」または「lrasets」ではない間にこのオブジェクトを設定しようとすると、「一貫性のない値」エラーが発生します。"
    },
    {
      "indent": 4,
      "text": "      The value of this MIB object MUST NOT persist across MTA\n      reboots.\"\nREFERENCE\n    \"ETSI-EN-300-659-1 Specification\"\nDEFVAL { 50 }\n::= {pktcSigDevObjects 23 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigDevCidAfterRPAS OBJECT-TYPE SYNTAX Unsigned32 (0|500..800) UNITS \"Milliseconds\" MAX-ACCESS read-write STATUS current DESCRIPTION \" This object specifies the delay between the end of the Ring Pulse Alert Signal (RP-AS) and the start of the transmission of the FSK or DTMF containing the caller id information. This MIB object is only used when pktcSigDevCidMode is set to a value of 'rpAsETS'. The following table defines the default values for this MIB object, depending on the signal type (pktcSigDevCidMode), and MUST be followed:",
      "ja": "pktcsigdevcidafterrpas object-type syntax unting32（0 | 500..800）units \"milliseconds\" max-access read-writeステータス現在の説明 \"このオブジェクトは、リングパルスアラート信号（RP-AS）のエンドの遅延を指定し、スタート発信者ID情報を含むFSKまたはDTMFの送信。このMIBオブジェクトは、PKTCSIGDEVCIDMODEが「RPASETS」の値に設定されている場合にのみ使用されます。次の表は、信号タイプに応じて、このMIBオブジェクトのデフォルト値を定義します（pktcsigdevcidmode）、および従う必要があります。"
    },
    {
      "indent": 10,
      "text": "Value of pktcSigDevCidMode Default value",
      "ja": "PKTCSIGDEVCIDMODEデフォルト値の値"
    },
    {
      "indent": 10,
      "text": "duringringingETS                 any value  (not used)\ndtAsETS                          any value  (not used)\nrpAsETS                          650 ms\nlrAsETS                          any value  (not used)\nlrETS                            any value  (not used)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 10,
      "text": "An attempt to set this object while the value of pktcSigDevCidMode is not 'rpAsETS' will result in an 'inconsistentValue' error.",
      "ja": "pktcsigdevcidmodeの値が「rpaset」ではない間にこのオブジェクトを設定しようとすると、「矛盾する値」エラーが発生します。"
    },
    {
      "indent": 4,
      "text": "      The value of this MIB object MUST NOT persist across MTA\n      reboots.\"\nREFERENCE\n    \"ETSI-EN-300-659-1 Specification\"\nDEFVAL { 650 }\n::= {pktcSigDevObjects 24 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigDevRingAfterCID OBJECT-TYPE SYNTAX Unsigned32 (0|50..500) UNITS \"Milliseconds\" MAX-ACCESS read-write STATUS current DESCRIPTION \" This object specifies the delay between the end of the complete transmission of the FSK or DTMF containing the caller id information and the start of the first ring pattern. It is only used when pktcSigDevCidMode is set to a value of 'dtAsETS', 'rpAsETS', 'lrAsETS' or 'lrETS'.",
      "ja": "pktcsigdevringaftercid object-type sntax untigned32（0 | 50..500）ユニット \"milliseconds\" max-access read-writeステータス現在の説明 \"このオブジェクトは、発信者ID情報を含むFSKまたはDTMFの完全な伝送の終わりの間の遅延を指定します。最初のリングパターンの開始。PKTCSIGDEVCIDMODEが「dtasets」、「rpasets」、「lrasets」、または 'lrets'の値に設定されている場合にのみ使用されます。"
    },
    {
      "indent": 9,
      "text": " The following table defines the default values for this MIB object, depending on the signal type (pktcSigDevCidMode), and MUST be followed:",
      "ja": "次の表は、信号タイプ（PKTCSIGDEVCIDMODE）に応じて、このMIBオブジェクトのデフォルト値を定義し、次のことを実行する必要があります。"
    },
    {
      "indent": 10,
      "text": "Value of pktcSigDevCidMode Default value",
      "ja": ""
    },
    {
      "indent": 10,
      "text": "duringringingETS                 any value  (not used)\ndtAsETS                          250 ms\nrpAsETS                          250 ms\nlrAsETS                          250 ms\nlrETS                            250 ms",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 10,
      "text": "An attempt to set this object while the value of pktcSigDevCidMode is not 'dtAsETS', 'rpAsETS', 'lrAsETS', or 'lrETS' will result in an 'inconsistent value' error.",
      "ja": "このオブジェクトを設定しようとすると、pktcsigdevcidmodeの値が「dtasets」、「rpasets」、「lrasets」、または「lrets」ではなく、「一貫性のない値」エラーが発生します。"
    },
    {
      "indent": 4,
      "text": "      The value of this MIB object MUST NOT persist across MTA\n      reboots.\"\nREFERENCE\n    \"ETSI-EN-300-659-1 Specification\"\nDEFVAL { 250 }\n::= {pktcSigDevObjects 25 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigDevCidDTASAfterLR OBJECT-TYPE SYNTAX Unsigned32 (50..655) UNITS \"Milliseconds\" MAX-ACCESS read-write STATUS current DESCRIPTION \" This object specifies the delay between the end of the Line Reversal and the start of the Dual Tone Alert Signal (DT-AS). This object is only used when pktcSigDevCidMode is set to a value of 'lrAsETS'.",
      "ja": "pktcsigdevciddtasafterlr object-type syntax untigned32（50..655）unit \"milliseconds\" max-access read-writeステータス現在の説明 \"このオブジェクトは、ラインの逆転と二重トーンアラート信号の開始の間の遅延を指定します（dt- dt-as）。このオブジェクトは、pktcsigdevcidmodeが「lrasets」の値に設定されている場合にのみ使用されます。"
    },
    {
      "indent": 9,
      "text": " The following table defines the default values for this MIB object, depending on the signal type (pktcSigDevCidMode), and MUST be followed:",
      "ja": "次の表は、信号タイプ（PKTCSIGDEVCIDMODE）に応じて、このMIBオブジェクトのデフォルト値を定義し、次のことを実行する必要があります。"
    },
    {
      "indent": 10,
      "text": "Value of pktcSigDevCidMode Default value",
      "ja": "PKTCSIGDEVCIDMODEデフォルト値の値"
    },
    {
      "indent": 10,
      "text": "duringringingETS                 any value  (not used)\ndtAsETS                          any value  (not used)\nrpAsETS                          any value  (not used)\nlrAsETS                          250 ms\nlrETS                            any value  (not used)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 10,
      "text": "An attempt to set this object while the value of pktcSigDevCidMode is not lrAsETS will result in an 'inconsistentValue' error.",
      "ja": "pktcsigdevcidmodeの値がlrasetsではない間にこのオブジェクトを設定しようとすると、「一貫性のない値」エラーが発生します。"
    },
    {
      "indent": 4,
      "text": " The value of this MIB object MUST NOT persist across MTA reboots.\" REFERENCE \"ETSI-EN-300-659-1 Specification\" DEFVAL { 250 }",
      "ja": "このMIBオブジェクトの値は、MTAの再起動全体で持続してはなりません。 \"参照\" ETSI-EN-300-659-1仕様 \"defval {250}"
    },
    {
      "indent": 4,
      "text": "::= {pktcSigDevObjects 26 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigDevVmwiMode    OBJECT-TYPE\n    SYNTAX       INTEGER {\n                 dtAsETS(1),\n                 rpAsETS(2),\n                 lrAsETS(3),\n                 osi(4),\n                 lrETS(5)\n                 }\n    MAX-ACCESS read-write\n    STATUS current\n    DESCRIPTION\n        \" For visual message waiting indicator (VMWI),\n          pktcSigDevVmwiMode selects the alerting signal method.  For\n          the dtAsETS, rpAsETS, lrAsETS, osi, and lrETS methods,\n          the FSK containing the VMWI information is sent after an\n          alerting signal.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 10,
      "text": "For the dtAsETS method, the FSK, or DTMF is sent after the Dual Tone Alert Signal. For the rpAsETS method, the FSK or DTMF is sent after a Ring Pulse.",
      "ja": "DTASETSメソッドの場合、FSK、またはDTMFはデュアルトーンアラート信号の後に送信されます。RPASETSメソッドの場合、FSKまたはDTMFはリングパルスの後に送信されます。"
    },
    {
      "indent": 10,
      "text": "For the lrAsETS method, the Line Reversal occurs first, then the Dual Tone Alert Signal, and, finally, the FSK or DTMF is sent.",
      "ja": "LRASETSメソッドの場合、ライン反転が最初に発生し、次にデュアルトーンアラート信号が発生し、最後にFSKまたはDTMFが送信されます。"
    },
    {
      "indent": 10,
      "text": "For the OSI method, the FSK or DTMF is sent after the Open Switching Interval.",
      "ja": "OSIメソッドの場合、FSKまたはDTMFは、オープンスイッチング間隔の後に送信されます。"
    },
    {
      "indent": 10,
      "text": "For the lrETS method, the Line Reversal occurs first, then the FSK or DTMF is sent.",
      "ja": "LRETSメソッドの場合、ラインの反転が最初に発生し、次にFSKまたはDTMFが送信されます。"
    },
    {
      "indent": 10,
      "text": "The value of this MIB object MUST NOT persist across MTA reboots.\"",
      "ja": "このMIBオブジェクトの値は、MTAの再起動全体で持続してはなりません。」"
    },
    {
      "indent": 4,
      "text": "DEFVAL { rpAsETS }\n::= {pktcSigDevObjects 27 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigDevVmwiAfterDTAS OBJECT-TYPE SYNTAX Unsigned32 (0|45..500) UNITS \"Milliseconds\" MAX-ACCESS read-write STATUS current DESCRIPTION \" This object specifies the delay between the end of the Dual Tone Alert Signal (DT-AS) and the start of the transmission of the FSK or DTMF containing the VMWI information.",
      "ja": "pktcsigdevvmwiafterdtas object-type syntax untigned32（0 | 45..500）ユニット \"milliseconds\" max-access read-writeステータス現在の説明 \"このオブジェクトは、デュアルトーンアラート信号（dt-as）の終わりの間の遅延を指定します。VMWI情報を含むFSKまたはDTMFの送信の。"
    },
    {
      "indent": 10,
      "text": "This object is only used when pktcSigDevVmwiMode is set to a value of 'dtAsETS' or 'lrAsETS'.",
      "ja": "このオブジェクトは、pktcsigdevvmwimodeが「dtasets」または「lrasets」の値に設定されている場合にのみ使用されます。"
    },
    {
      "indent": 9,
      "text": " The following table defines the default values for this MIB object, depending on the signal type (pktcSigDevVmwiMode), and MUST be followed:",
      "ja": "次の表は、信号タイプ（PKTCSIGDEVVMWIMODE）に応じて、このMIBオブジェクトのデフォルト値を定義し、次のことを実行する必要があります。"
    },
    {
      "indent": 10,
      "text": "Value of pktcSigDevVmwiMode Default value",
      "ja": "pktcsigdevvmwimodeデフォルト値の値"
    },
    {
      "indent": 10,
      "text": "dtAsETS                           50 ms\nrpAsETS                           any value  (not used)\nlrAsETS                           50 ms\nlrETS                             any value  (not used)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 10,
      "text": "An attempt to set this object while the value of pktcSigDevVmwiMode is not 'dtAsETS' or 'lrAsETS' will result in an 'inconsistentValue' error.",
      "ja": "pktcsigdevvmwimodeの値が「dtasets」または「lrasets」ではない間にこのオブジェクトを設定しようとすると、「一貫性のない値」エラーが発生します。"
    },
    {
      "indent": 4,
      "text": "      The value of this MIB object MUST NOT persist across MTA\n      reboots.\"\nREFERENCE\n    \"ETSI-EN-300-659-1 Specification\"\nDEFVAL { 50 }\n::= {pktcSigDevObjects 28 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigDevVmwiAfterRPAS OBJECT-TYPE SYNTAX Unsigned32 (0|500..800) UNITS \"Milliseconds\" MAX-ACCESS read-write STATUS current DESCRIPTION \" This object specifies the delay between the end of the Ring Pulse Alert Signal (RP-AS) and the start of the transmission of the FSK or DTMF containing the VMWI information.",
      "ja": "pktcsigdevvmwiafterrpas object-type syntax untigned32（0 | 500..800）ユニット \"milliseconds\" max-access read-writeステータス現在の説明 \"このオブジェクトは、リングパルスアラート信号（rp-as）の末端間の遅延を指定します。VMWI情報を含むFSKまたはDTMFの送信の。"
    },
    {
      "indent": 10,
      "text": "This object is only used when pktcSigDevVmwiMode is set to a value of 'rpAsETS'.",
      "ja": "このオブジェクトは、pktcsigdevvmwimodeが「rpasets」の値に設定されている場合にのみ使用されます。"
    },
    {
      "indent": 9,
      "text": " The following table defines the default values for this MIB object, depending on the signal type (pktcSigDevVmwiMode), and MUST be followed:",
      "ja": "次の表は、信号タイプ（PKTCSIGDEVVMWIMODE）に応じて、このMIBオブジェクトのデフォルト値を定義し、次のことを実行する必要があります。"
    },
    {
      "indent": 10,
      "text": "Value of pktcSigDevVmwiMode Default value",
      "ja": "pktcsigdevvmwimodeデフォルト値の値"
    },
    {
      "indent": 10,
      "text": "dtAsETS                           any value  (not used)\nrpAsETS                           650 ms\nlrAsETS                           any value  (not used)\nlrETS                             any value  (not used)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 10,
      "text": "An attempt to set this object while the value of pktcSigDevVmwiMode is not 'rpAsETS' will result in an 'inconsistentValue' error.",
      "ja": "pktcsigdevvmwimodeの値が「rpaset」ではない間にこのオブジェクトを設定しようとすると、「矛盾する値」エラーが発生します。"
    },
    {
      "indent": 4,
      "text": "      The value of this MIB object MUST NOT persist across MTA\n      reboots.\"\nREFERENCE\n    \"ETSI-EN-300-659-1 Specification\"\nDEFVAL { 650 }\n::= {pktcSigDevObjects 29 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigDevVmwiDTASAfterLR OBJECT-TYPE SYNTAX Unsigned32 (0|50..655) UNITS \"Milliseconds\" MAX-ACCESS read-write STATUS current DESCRIPTION \" This object specifies the delay between the end of the Line Reversal and the start of the Dual Tone Alert Signal (DT-AS) for VMWI information. This object is only used when pktcSigDevVmwiMode is set to a value of 'lrAsETS'.",
      "ja": "pktcsigdevvmwidtasafterlr object-type sntax untigned32（0 | 50..655）ユニット \"milliseconds\" max-access read-write status current current \"このオブジェクトは、ラインの逆転と二重トーンアラート信号の開始の間の遅延を指定します（dt-as）vmwi情報の場合。このオブジェクトは、pktcsigdevvmwimodeが「lrasets」の値に設定されている場合にのみ使用されます。"
    },
    {
      "indent": 9,
      "text": " The following table defines the default values for this MIB object, depending on the signal type (pktcSigDevVmwiMode), and MUST be followed:",
      "ja": "次の表は、信号タイプ（PKTCSIGDEVVMWIMODE）に応じて、このMIBオブジェクトのデフォルト値を定義し、次のことを実行する必要があります。"
    },
    {
      "indent": 10,
      "text": "Value of pktcSigDevVmwiMode Default value",
      "ja": "pktcsigdevvmwimodeデフォルト値の値"
    },
    {
      "indent": 10,
      "text": "dtAsETS                           any value  (not used)\nrpAsETS                           any value  (not used)\nlrAsETS                           250 ms\nlrETS                             any value  (not used)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 10,
      "text": "An attempt to set this object while the value of pktcSigDevVmwiMode is not 'lrAsETS' will result in an 'inconsistentValue' error.",
      "ja": "pktcsigdevvmwimodeの値が「lrasets」ではない間にこのオブジェクトを設定しようとすると、「一貫性のない値」エラーが発生します。"
    },
    {
      "indent": 4,
      "text": "      The value of this MIB object MUST NOT persist across MTA\n      reboots.\"\nREFERENCE\n    \"ETSI-EN-300-659-1 Specification\"\nDEFVAL { 250 }\n::= {pktcSigDevObjects 30 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigDevRingCadenceTable    OBJECT-TYPE\n    SYNTAX       SEQUENCE OF PktcSigDevRingCadenceEntry\n    MAX-ACCESS   not-accessible\n    STATUS       current\n    DESCRIPTION\n        \"Cadence rings are defined by the telco governing\n         body for each country.  The MTA must be able to support\n         various ranges of cadence patterns and cadence periods.\n         The MTA will be able to support country-specific\n         provisioning of the cadence and idle period.  Each\n         cadence pattern will be assigned a unique value ranging\n         from 0-127 (inclusive) corresponding to the value of x,\n         where x is the value sent in the cadence ringing (cr)\n         signal cr(x), requested per the appropriate NCS\n         message, and defined in the E package.  The MTA will derive\n         the cadence periods from the ring cadence table entry, as\n         provisioned by the customer.  The MTA is allowed to provide\n         appropriate default values for each of the ring cadences.\n         This table only needs to be supported when the MTA\n         implements the E package.\"\n    REFERENCE\n        \"ETSI-TS-101-909-4 Specification\"\n    ::= { pktcSigDevObjects 31 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigDevRingCadenceEntry OBJECT-TYPE SYNTAX PktcSigDevRingCadenceEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION",
      "ja": "pktcsigdevringcadenceentryオブジェクトタイプ構文pktcsigdevringcadenceentry max-accessアクセス不可能なステータス現在の説明"
    },
    {
      "indent": 4,
      "text": "    \" Each entry in this row corresponds to a ring cadence\n      that is being supported by the device.  The conceptual\n      rows MUST NOT persist across MTA reboots.\"\nINDEX { pktcSigDevRingCadenceIndex }\n::= { pktcSigDevRingCadenceTable 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "PktcSigDevRingCadenceEntry ::= SEQUENCE {\n        pktcSigDevRingCadenceIndex       Unsigned32,\n        pktcSigDevRingCadence            PktcRingCadence\n    }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigDevRingCadenceIndex    OBJECT-TYPE\n    SYNTAX       Unsigned32 (0..127)\n    MAX-ACCESS   not-accessible\n    STATUS       current\n    DESCRIPTION\n        \" A unique value ranging from 0 to 127 that corresponds to the\n          value sent by the LE based on country-specific cadences,\n          one row per cadence cycle.  In any given system\n          implementation for a particular country, it is anticipated\n          that a small number of ring cadences will be in use.  Thus,\n          this table most likely will not be populated to its full\n          size.\"\n    ::= { pktcSigDevRingCadenceEntry 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigDevRingCadence    OBJECT-TYPE\n    SYNTAX       PktcRingCadence\n    MAX-ACCESS   read-write\n    STATUS       current\n    DESCRIPTION\n        \"This is the Ring Cadence.\"\n    ::= { pktcSigDevRingCadenceEntry 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigDevToneTable OBJECT-TYPE SYNTAX SEQUENCE OF PktcSigDevToneEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \" The Tone Table defines the composition of tones and various tone operations.",
      "ja": "PKTCSIGDEVTONETABLEオブジェクトタイプの構文シーケンスPKTCSIGDEVTONEENTRY MAX-ACCESSアクセス不可能なステータス現在の説明 \"トーンテーブルは、トーンの構成とさまざまなトーン操作を定義します。"
    },
    {
      "indent": 10,
      "text": "The definition of the tones callWaiting1 through callWaiting4 in this table MUST only contain the audible tone itself; the delay between tones or the value of the tone repeat count are not applicable for the call waiting tones.",
      "ja": "このテーブルのCallWaiting4を介したトーンCallWaiting1の定義には、可聴トーン自体のみが含まれている必要があります。トーンの間の遅延またはトーンリピートカウントの値は、コール待機トーンには適用されません。"
    },
    {
      "indent": 10,
      "text": "The delay between tones or the repeat count is controlled by the objects pktcSigEndPntConfigCallWaitingDelay and pktcSigEndPntConfigCallWaitingMaxRep. If the pktcSigDevToneType is set to either of the values callWaiting1, callWaiting2, callWaiting3, or callWaiting4, then the value of the pktcSigDevToneWholeToneRepeatCount object indicates that the particular frequency group is applicable, as a repeatable part of the tone, based on the value of the MIB object pktcSigDevToneWholeToneRepeatCount.",
      "ja": "トーンまたはリピートカウントの間の遅延は、PKTCSIGENDPNTCONFIGCALLWAITINGDELAYおよびPKTCSIGENDPNTCOLLWAITINGMAXREPによって制御されます。pktcsigdevtonetypeが、callwaiting1、callwaiting2、callwaiting3、またはcallwaiting4のいずれかに設定されている場合、pktcsigdevtonewholetonerepeatcountオブジェクトの値は、特定の周波数グループが適用されることを示します。オブジェクトPKTCSIGDEVTONEWHOLETONEREPEATCOUNT。"
    },
    {
      "indent": 10,
      "text": "The MTA MUST make sure that, after the provisioning cycle, the table is fully populated (i.e., for each possible index, an entry MUST be defined) using reasonable defaults for each row that was not defined by the provisioning information delivered via MTA Configuration.",
      "ja": "MTAは、プロビジョニングサイクルの後、テーブルが完全に人口計量されていることを確認する必要があります（つまり、可能なインデックスごとに、エントリを定義する必要があります）。各行の合理的なデフォルトを使用して、MTA構成を介して配信されるプロビジョニング情報によって定義されていないことを確認します。"
    },
    {
      "indent": 10,
      "text": "The frequency composition of each tone is defined by the pktcSigDevMultiFreqToneTable. For each tone type defined in pktcSigDevToneTable, the MTA MUST populate at least one entry in the pktcSigDevMultiFreqToneTable.",
      "ja": "各トーンの周波数構成は、pktcsigdevmultifreqtonetableによって定義されます。pktcsigdevtonetableで定義された各トーンタイプについて、MTAはPKTCSIGDEVMULTIFREQTONETABLEに少なくとも1つのエントリを入力する必要があります。"
    },
    {
      "indent": 10,
      "text": "For each particular value of pktcSigDevToneType, the pktcSigDevToneTable table can define non-repeating and repeating groups of the frequencies defined by the pktcSigDevMultiFreqToneTable, such that each group is represented by the set of the consecutive rows (frequency group) in the pktcSigDevMultiFreqToneTable.",
      "ja": "pktcsigdevtonetypeの各特定の値について、pktcsigdevtonetableテーブルは、pktcsigdevmultifreqtonetableで定義された周波数の非反復グループと繰り返しグループを定義できます。"
    },
    {
      "indent": 4,
      "text": "      Objects in this table do not persist across MTA reboots.\n      For tones with multiple frequencies refer to the MIB table\n      pktcSigDevMultiFreqToneTable.\"\nREFERENCE\n    \"PacketCable NCS Specification, ETSI-TS-101-909-4\n     Specification.\"\n::= { pktcSigDevObjects 32 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigDevToneEntry OBJECT-TYPE SYNTAX PktcSigDevToneEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \" The different tone types that can be provisioned based on country-specific needs.",
      "ja": "PKTCSIGDEVTONEENTRYオブジェクトタイプ構文PKTCSIGDEVTONEENTRY MAX-ACCESS NOT-ACCESSABLEステータス現在の説明 \"国固有のニーズに基づいてプロビジョニングできるさまざまなトーンタイプ。"
    },
    {
      "indent": 10,
      "text": "Each entry contains the tone generation parameters for a specific frequency group of the specific Tone Type.",
      "ja": "各エントリには、特定のトーンタイプの特定の周波数グループのトーン生成パラメーターが含まれています。"
    },
    {
      "indent": 4,
      "text": "      The different parameters can be provisioned via MTA\n      configuration based on country specific needs.\n      An MTA MUST populate all entries of this table for each\n      tone type.\"\nINDEX { pktcSigDevToneType, pktcSigDevToneFreqGroup }\n::= { pktcSigDevToneTable 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "PktcSigDevToneEntry ::= SEQUENCE {\n    pktcSigDevToneType                      INTEGER,\n    pktcSigDevToneFreqGroup                 Unsigned32,\n    pktcSigDevToneFreqCounter               Unsigned32,\n    pktcSigDevToneWholeToneRepeatCount      Unsigned32,\n    pktcSigDevToneSteady                    TruthValue\n    }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigDevToneType        OBJECT-TYPE\n    SYNTAX       INTEGER {\n                 busy(1),\n                 confirmation(2),\n                 dial(3),\n                 messageWaiting(4),\n                 offHookWarning(5),\n                 ringBack(6),\n                 reOrder(7),\n                 stutterdial(8),\n                 callWaiting1(9),\n                 callWaiting2(10),\n                 callWaiting3(11),\n                 callWaiting4(12),\n                 alertingSignal(13),\n                 specialDial(14),\n                 specialInfo(15),\n                 release(16),\n                 congestion(17),\n                 userDefined1(18),\n                 userDefined2(19),\n                 userDefined3(20),\n                 userDefined4(21)\n                 }\n    MAX-ACCESS   not-accessible\n    STATUS       current\n    DESCRIPTION\n        \"A unique value that will correspond to the different\n         tone types.  These tones can be provisioned based on\n         country-specific needs.  This object defines the type\n         of tone being accessed.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "     The alertingSignal, specialDial, specialInfo, release,\n         congestion, userDefined1, userDefined2, userDefined3,\n     and userDefined4 tone types are used in\n     the E line package.\"\n::= { pktcSigDevToneEntry 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigDevToneFreqGroup OBJECT-TYPE SYNTAX Unsigned32(1..4) MAX-ACCESS not-accessible STATUS current DESCRIPTION \"This MIB object represents the Tone Sequence reference of a multi-sequence tone.\" ::={ pktcSigDevToneEntry 2}",
      "ja": "pktcsigdevtonefreqgroup object-type syntax unting32（1..4）最大アクセスアクセス不可能なステータス現在の説明「このMIBオブジェクトは、マルチシーケンストーンのトーンシーケンス参照を表します。」:: = {pktcsigdevtoneentry 2}"
    },
    {
      "indent": 0,
      "text": "pktcSigDevToneFreqCounter OBJECT-TYPE SYNTAX Unsigned32(1..8) MAX-ACCESS read-only STATUS current DESCRIPTION \"This MIB object represents the number of consecutive multi-frequency tones for the particular tone type in the multi-frequency table (pktcSigDevMultiFreqToneTable).",
      "ja": "pktcsigdevtonefreqcounterオブジェクトタイプの構文untisined32（1..8）最大アクセス読み取り専用ステータス現在の説明 \"このMIBオブジェクトは、マルチフクエンシーテーブルの特定のトーンタイプの連続したマルチ周波数トーンの数を表します（pktcsigdevmultifreqtonable）。"
    },
    {
      "indent": 7,
      "text": " Such a sequence of the consecutive multi-frequency tones forms the tone group for the particular tone type in the pktcSigDevToneTable.\" ::={ pktcSigDevToneEntry 3}",
      "ja": "このような一連の連続した多周波トーンは、pktcsigdevtonetableの特定のトーンタイプのトーングループを形成します。 \":: = {pktcsigdevtoneentry 3}"
    },
    {
      "indent": 0,
      "text": "pktcSigDevToneWholeToneRepeatCount OBJECT-TYPE SYNTAX Unsigned32 (0..5000) MAX-ACCESS read-only STATUS current DESCRIPTION \"This is the repeat count, which signifies how many times to repeat the entire on-off cadence sequence. Setting this object may result in a cadence duration longer or shorter than the overall signal duration specified by the time out (TO) object for a particular signal. If the repeat count results in a longer tone duration than the signal duration specified by the TO, the tone duration defined by the TO object for a particular signal always represents the overall signal duration for a tone. In this case, the tone duration repeat count will not be fully exercised, and the desired tone duration will be truncated per the TO setting. If the repeat count results in a shorter tone duration than the signal duration specified by the TO, the tone duration defined by the repeat count takes precedence over the TO and will end the signal event. In this case, the TO represents a time not to be exceeded for the signal. It is recommended to ensure proper telephony signaling so that the TO duration setting should always be longer than the desired repeat count-time duration.\" ::={ pktcSigDevToneEntry 4 }",
      "ja": "PKTCSIGDEVTONEWHOLETONEREPEATCOUNT OBJECT-TYPE SYNTAX UNSIGN32（0..5000）最大アクセス読み取り専用ステータス現在の説明 \"これは繰り返しカウントです。ケイデンスの持続時間は、特定の信号のタイムアウト（to）オブジェクトで指定された全体的な信号持続時間よりも長いか短いです。繰り返しカウントがtoで指定された信号期間よりも長いトーンの持続時間になると、特定の信号のオブジェクトは常にトーンの全体的な信号期間を表します。この場合、トーンの持続時間の繰り返しカウントは完全には行使されず、設定までの繰り返しのカウントが繰り返される場合、目的のトーンの持続時間は切り捨てられます。TOで指定された信号の持続時間よりも短いトーン時間は、繰り返しカウントによって定義されるトーンの持続時間は、信号イベントよりも優先され、シグナルイベントを終了します。この場合、信号を超えない時間を表します。適切な電話信号を確保することをお勧めします。そうすれば、持続時間設定が常に希望する繰り返しカウント時間よりも長くなるようにすることをお勧めします。」:: = {pktcsigdevtoneentry 4}}"
    },
    {
      "indent": 0,
      "text": "pktcSigDevToneSteady OBJECT-TYPE SYNTAX TruthValue MAX-ACCESS read-only STATUS current DESCRIPTION \"This MIB object represents the steady tone status. A value of 'true(1)' indicates that the steady tone is applied, and a value of 'false(2)' indicates otherwise. Devices must play out the on-off cadence sequence for the number of times indicated by the MIB object 'pktcSigDevToneWholeToneRepeatCount' prior to applying the last tone steadily, indefinitely. If the MIB table 'pktcSigDevToneTable' contains multiple rows with this Object set to a value of 'true(1)', the steady tone is applied to the last repeating frequency group of the tone.",
      "ja": "pktcsigdevtonesteadyオブジェクトタイプの構文型ruthvalue max-access読み取り専用ステータス現在の説明 \"このmibオブジェクトは安定したトーンステータスを表します。'それ以外のことを示します。デバイスは、最後のトーンを無限に適用する前に、MIBオブジェクト「pktcsigdevtonewholetonerepeatCount」で示された回数の数に対してオンオフケイデンスシーケンスを実行する必要があります。オブジェクトは「true（1）」の値に設定され、安定したトーンがトーンの最後の繰り返し周波数グループに適用されます。"
    },
    {
      "indent": 9,
      "text": "Setting this MIB object may result in a tone duration that is longer or shorter than the overall signal duration specified by the time out (TO) MIB object for a particular signal. If the repeat count results in a longer tone duration than the signal duration specified by the TO, the tone duration defined by the TO object for a particular signal always represents the overall signal duration for a tone. In this case, the tone duration repeat count will not be fully exercised, and the desired tone duration will be truncated per the TO setting. If the repeat count results in a shorter tone duration than the signal duration specified by the TO, the tone duration defined by the repeat count takes precedence over the TO and will end the signal event. In this case, the TO represents a time not to be exceeded for the signal.",
      "ja": "このMIBオブジェクトを設定すると、特定の信号に対してタイムアウト（to）MIBオブジェクトで指定された全体的な信号持続時間よりも長または短いトーン期間が生じる場合があります。繰り返しカウントがtoで指定された信号期間よりも長いトーンの持続時間がある場合、特定の信号に対してtoオブジェクトによって定義されるトーン時間は、常にトーンの全体的な信号持続時間を表します。この場合、トーン持続時間の繰り返しカウントは完全には行使されず、設定までの目的のトーン持続時間は切り捨てられます。繰り返しカウントがtoで指定された信号期間よりも短いトーンの持続時間になると、繰り返しカウントによって定義されるトーン時間は、信号イベントよりも優先され、終了します。この場合、信号に対して超えない時間を表すこと。"
    },
    {
      "indent": 4,
      "text": " It is recommended to ensure proper telephony signaling that The TO duration setting should always be longer than the desired repeat count-time duration, plus the desired maximum steady tone period.\" ::={ pktcSigDevToneEntry 5 }",
      "ja": "適切な電話の合図を確保することをお勧めします。継続時間設定は、目的の繰り返しカウント時間と目的の最大定常トーン期間よりも常に長くなる必要があります。」:: = {pktcsigdevtoneentry 5}"
    },
    {
      "indent": 3,
      "text": "pktcSigDevMultiFreqToneTable OBJECT-TYPE SYNTAX SEQUENCE OF PktcSigDevMultiFreqToneEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \" This MIB table defines the characteristics of tones with multiple frequencies. The constraints imposed on the tones by the MIB table pktcSigDevToneTable need to be considered for MIB objects in this table as well.",
      "ja": "pktcsigdevmultifreqtoneentry max-access of pktcsigdevmultifreqtoneentry access accessable cunter culling curle current curle descultのpktcsigdevmultifreqtoneTableの構文シーケンスシーケンスシーケンス。テーブルも。"
    },
    {
      "indent": 13,
      "text": "The MTA MUST populate the corresponding row(s) of the pktcSigDevMultiFreqToneTable for each tone defined in the pktcSigDevToneTable.",
      "ja": "MTAは、pktcsigdevtonetableで定義されている各トーンについて、pktcsigdevmultifreqtonetableの対応する行を埋める必要があります。"
    },
    {
      "indent": 7,
      "text": "      The contents of the table may be provisioned via\n      MTA configuration.\"\nREFERENCE\n    \"PacketCable NCS Specification, ETSI-TS-101-909-4\n     Specification.\"\n::= { pktcSigDevObjects 33 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pktcSigDevMultiFreqToneEntry    OBJECT-TYPE\n    SYNTAX       PktcSigDevMultiFreqToneEntry\n    MAX-ACCESS   not-accessible\n    STATUS       current\n    DESCRIPTION\n        \" The different tone types with multiple frequencies\n          that can be provisioned based on country-specific\n          needs.\"\n    INDEX {pktcSigDevToneType, pktcSigDevToneNumber}\n    ::= { pktcSigDevMultiFreqToneTable 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "PktcSigDevMultiFreqToneEntry ::= SEQUENCE {\n      pktcSigDevToneNumber                    Unsigned32,\n      pktcSigDevToneFirstFreqValue            Unsigned32,\n      pktcSigDevToneSecondFreqValue           Unsigned32,\n      pktcSigDevToneThirdFreqValue            Unsigned32,\n      pktcSigDevToneFourthFreqValue           Unsigned32,\n      pktcSigDevToneFreqMode                  INTEGER,\n      pktcSigDevToneFreqAmpModePrtg           Unsigned32,\n      pktcSigDevToneDbLevel                   TenthdBm,\n      pktcSigDevToneFreqOnDuration            Unsigned32,\n      pktcSigDevToneFreqOffDuration           Unsigned32,\n      pktcSigDevToneFreqRepeatCount           Unsigned32\n}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pktcSigDevToneNumber OBJECT-TYPE SYNTAX Unsigned32(1..8) MAX-ACCESS not-accessible STATUS current DESCRIPTION",
      "ja": "pktcsigdevtonenumber object-type syntax unsigned32（1..8）最大アクセスアクセス不可能なステータス現在の説明"
    },
    {
      "indent": 7,
      "text": "   \"This MIB object represents the frequency reference\n    of a multi-frequency tone.\"\n::={ pktcSigDevMultiFreqToneEntry 1}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pktcSigDevToneFirstFreqValue OBJECT-TYPE SYNTAX Unsigned32(0..4000) MAX-ACCESS read-only STATUS current DESCRIPTION \"This MIB object represents the value of the first frequency of a tone type. A value of zero implies absence of the referenced frequency.\" ::={ pktcSigDevMultiFreqToneEntry 2}",
      "ja": "pktcsigdevtonefirstfreqvalue object-type syntax untigned32（0..4000）最大アクセス読み取り専用ステータス現在の説明 \"このMIBオブジェクトは、トーンタイプの最初の周波数の値を表します。:: = {pktcsigdevmultifreqtoneentry 2}"
    },
    {
      "indent": 3,
      "text": "pktcSigDevToneSecondFreqValue OBJECT-TYPE SYNTAX Unsigned32(0..4000) MAX-ACCESS read-only STATUS current DESCRIPTION \"This MIB object represents the value of the second frequency of a tone type. A value of zero implies absence of the referenced frequency.\" ::={ pktcSigDevMultiFreqToneEntry 3}",
      "ja": "pktcsigdevtonecondfreqvalue object-type syntax untigned32（0..4000）max-access読み取り専用ステータス現在の説明 \"このmibオブジェクトは、トーンタイプの2番目の周波数の値を表します。:: = {pktcsigdevmultifreqtoneentry 3}"
    },
    {
      "indent": 3,
      "text": "pktcSigDevToneThirdFreqValue OBJECT-TYPE SYNTAX Unsigned32(0..4000) MAX-ACCESS read-only STATUS current DESCRIPTION \"This MIB object represents the value of the third frequency of a tone type. A value of zero implies absence of the referenced frequency.\" ::={ pktcSigDevMultiFreqToneEntry 4}",
      "ja": "pktcsigdevtonethirdfreqvalue object-type syntax unting32（0..4000）max-access読み取り専用ステータス現在の説明 \"このmibオブジェクトは、トーンタイプの3番目の周波数の値を表します。:: = {pktcsigdevmultifreqtoneentry 4}"
    },
    {
      "indent": 3,
      "text": "pktcSigDevToneFourthFreqValue OBJECT-TYPE SYNTAX Unsigned32(0..4000) MAX-ACCESS read-only STATUS current DESCRIPTION \"This MIB object represents the value of the fourth frequency of a tone type. A value of zero implies absence of the referenced frequency.\" ::={ pktcSigDevMultiFreqToneEntry 5}",
      "ja": "pktcsigdevtonefourthfreqvalue object-type syntax unting32（0..4000）最大アクセス読み取り専用ステータス現在の説明 \"このMIBオブジェクトは、トーンタイプの4番目の周波数の値を表します。:: = {pktcsigdevmultifreqtoneentry 5}"
    },
    {
      "indent": 3,
      "text": "pktcSigDevToneFreqMode OBJECT-TYPE SYNTAX INTEGER { firstModulatedBySecond(1), summation(2)",
      "ja": "pktcsigdevtonefreqmode object-type syntax integer {firstmodulatedbysecond（1）、sumation（2）"
    },
    {
      "indent": 7,
      "text": " } MAX-ACCESS read-only STATUS current DESCRIPTION \"This MIB object provides directive on the modulation or summation of the frequencies involved in the tone.",
      "ja": "} max-access読み取り専用ステータス現在の説明 \"このMIBオブジェクトは、トーンに関与する周波数の変調または合計に関する指示を提供します。"
    },
    {
      "indent": 8,
      "text": "It is to be noted that while summation can be done without any constraint on the number of frequencies, the modulation (amplitude) holds good only when there are two frequencies (first and second).",
      "ja": "周波数の数に制約なしで合計することはできますが、変調（振幅）は2つの周波数（1番目と2番目）がある場合にのみ良く保持されることに注意してください。"
    },
    {
      "indent": 8,
      "text": "Thus: - If the mode is set to a value of 'firstModulatedBySecond(1)', the first frequency MUST be modulated by the second, and the remaining frequencies (third and fourth) ignored. The percentage of amplitude modulation to be applied is defined by the MIB object pktcSigDevToneFreqAmpModePrtg.",
      "ja": "したがって： - モードが「FirstModulatedBysecond（1）」の値に設定されている場合、最初の周波数は2番目で変調する必要があり、残りの周波数（3番目と4番目）は無視されます。適用される振幅変調の割合は、MIBオブジェクトPKTCSIGDEVTONEFREQAMPMODEPRTGによって定義されます。"
    },
    {
      "indent": 7,
      "text": "   - If the mode is set to a value of\n     'summation(2)', all the frequencies MUST be\n     summed without any modulation.\n\"\n::={ pktcSigDevMultiFreqToneEntry 6}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 2,
      "text": "pktcSigDevToneFreqAmpModePrtg OBJECT-TYPE SYNTAX Unsigned32(0..100) MAX-ACCESS read-only STATUS current DESCRIPTION \"This MIB object represents the percentage of amplitude modulation applied to the second frequency when the MIB object pktcSigDevToneFreqMode is set to a value of 'firstModulatedBySecond (1)'.",
      "ja": "pktcsigdevtonefreqampmodeprtg object-type untigned32（0..100）最大アクセス読み取り専用ステータス現在の説明 \"このMIBオブジェクトは、MIBオブジェクトがMIBオブジェクトPKTCSIGDEVTONEFREQMODEがファーストモデューションの値に設定されている場合、2番目の周波数に適用される振幅変調の割合を表します。1） '。"
    },
    {
      "indent": 7,
      "text": " If the MIB object pktcSigDevToneFreqMode is set to value of 'summation (2)', then this MIB object MUST be ignored.\" ::={ pktcSigDevMultiFreqToneEntry 7}",
      "ja": "MIBオブジェクトPKTCSIGDEVTONEFREQMODEが「合計（2）」の値に設定されている場合、このMIBオブジェクトは無視する必要があります。 \":: {pktcsigdevmultifreqtoneintry 7}}}"
    },
    {
      "indent": 2,
      "text": "pktcSigDevToneDbLevel OBJECT-TYPE SYNTAX TenthdBm (-250..-110) UNITS \"1/10 of a dBm\" MAX-ACCESS read-only STATUS current DESCRIPTION \"This MIB object contains the decibel level for each analog signal (tone) that is locally generated (versus in-band supervisory tones) and sourced to the a-b terminals (TE connection point). Each tone in itself may consist of multiple frequencies, as defined by the MIB table pktcSigDevMultiFreqToneTable.",
      "ja": "pktcsigdevtonedblevel object-type syntax tenthdbm（-250 ..- 110）unit \"1/10 of a dbm\" max-access読み取り専用ステータス現在の説明 \"生成された（帯域内の監視トーン）、A-B端子（TE接続ポイント）に供給されます。各トーン自体は、MIBテーブルPKTCSIGDEVMULTIFREQTONETABLEで定義されている複数の周波数で構成されている場合があります。"
    },
    {
      "indent": 11,
      "text": "This MIB object reflects the desired level at the Telco (POTS) a-b (T/R) terminals, including the effect of any MTA receiver gain (loss). This is required so that locally generated tones are consistent with remotely generated in-band tones at the a-b terminals, consistent with user expectations.",
      "ja": "このMIBオブジェクトは、MTAレシーバーゲイン（損失）の影響を含む、Telco（POTS）A-B（T/R）端子での望ましいレベルを反映しています。これは、局所的に生成されたトーンが、ユーザーの期待と一致して、A-B端子でリモートで生成されたバンド内のトーンと一致するように必要です。"
    },
    {
      "indent": 11,
      "text": "This MIB object must be set for each tone. When tones are formed by combining multi-frequencies, the level of each frequency shall be set so as to result in the tone level specified in this object at the a-b (T/R) terminals.",
      "ja": "このMIBオブジェクトは、各トーンに設定する必要があります。トーンが多頻度を組み合わせることで形成される場合、各周波数のレベルを設定して、A-B（T/R）端子でこのオブジェクトで指定されたトーンレベルになります。"
    },
    {
      "indent": 4,
      "text": "       The wide range of levels for this Object is required\n       to provide signal-generator levels across the wide\n       range of gains (losses) -- but does not imply the entire\n       range is to be achievable given the range of gains (losses)\n       in the MTA.\"\nDEFVAL { -120 }\n::={ pktcSigDevMultiFreqToneEntry 8}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pktcSigDevToneFreqOnDuration OBJECT-TYPE SYNTAX Unsigned32(0..5000) UNITS \"milliseconds\" MAX-ACCESS read-only STATUS current DESCRIPTION \"This MIB object represents the duration for which the frequency reference corresponding to the tone type is turned on.\" ::={ pktcSigDevMultiFreqToneEntry 9}",
      "ja": "PKTCSIGDEVTONEFREQONDURATION OBJECT-TYPE SYNTAX UNSIGNED32（0..5000）ユニット「Milliseconds」最大アクセス読み取り専用ステータス現在の説明 \"このMIBオブジェクトは、トーンタイプに対応する周波数参照がオンになる期間を表します。」:: = {pktcsigdevmultifreqtoneentry 9}"
    },
    {
      "indent": 3,
      "text": "pktcSigDevToneFreqOffDuration OBJECT-TYPE SYNTAX Unsigned32(0..5000) UNITS \"milliseconds\" MAX-ACCESS read-only STATUS current DESCRIPTION \"This MIB object represents the duration for which the",
      "ja": "pktcsigdevtonefreqoffduration object-type syntax unting32（0..5000）unit \"milliseconds\" max-access read-only status current current \"このmibオブジェクトは、持続時間を表します。"
    },
    {
      "indent": 7,
      "text": "    frequency reference corresponding to the tone type\n    is turned off.\"\n::={ pktcSigDevMultiFreqToneEntry 10}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pktcSigDevToneFreqRepeatCount OBJECT-TYPE SYNTAX Unsigned32(0..5000) MAX-ACCESS read-only STATUS current DESCRIPTION \"This MIB object indicates the number of times to repeat the cadence cycle represented by the on/off durations (refer to the MIB objects pktcSigDevToneFreqOnDuration and pktcSigDevToneFreqOffDuration).",
      "ja": "PKTCSIGDEVTONEFREPREPEATCOUNT OBJECT-TYPE SYNTAX UNSIGNED32（0..5000）最大アクセス読み取り専用ステータス現在の説明 \"このMIBオブジェクトは、ON/OFF-OFF-OFF-OFF-OFF-OFF-OFF-OFF-OFF-OFF-OFF-OFF-OFFERATIONSで表されるケイデンスサイクルを繰り返す回数を示します（PKSIGDEVTONEFRREQONDURATIONとpktcsigdevtonefreqoffduration）。"
    },
    {
      "indent": 7,
      "text": "Setting this object may result in a tone duration that is longer or shorter than the overall signal duration specified by the time out (TO) object for the corresponding tone type. If the value of this MIB Object indicates a longer duration than that specified by the TO, the latter overrules the former, and the desired tone duration will be truncated according to the TO.",
      "ja": "このオブジェクトを設定すると、対応するトーンタイプのタイムアウト（to）オブジェクトで指定された全体的な信号持続時間よりも長または短いトーン期間が生じる場合があります。このMIBオブジェクトの値がTOで指定されたものよりも長い期間を示している場合、後者は前者を覆し、目的のトーンの持続時間はtoに従って切り捨てられます。"
    },
    {
      "indent": 7,
      "text": "However, if the repeat count results in a shorter tone duration than the signal duration specified by the TO, the tone duration defined by the repeat count takes precedence over the TO and will end the signal event. In this case, the TO represents a time not to be exceeded for the signal. It is recommended, to ensure proper telephony signaling, that the TO duration setting should always be longer than the desired repeat count-time duration. A value of zero means the tone sequence is to be played once but not repeated.\" ::={ pktcSigDevMultiFreqToneEntry 11}",
      "ja": "ただし、繰り返しカウントがtoで指定された信号期間よりも短いトーンの持続時間になると、繰り返しカウントによって定義されるトーンの持続時間がtoよりも優先され、信号イベントが終了します。この場合、信号に対して超えない時間を表すこと。適切なテレフォニーシグナリングを確保するために、持続時間の設定は常に希望の繰り返しカウント時間期間よりも長くなることをお勧めします。ゼロの値は、トーンシーケンスが一度再生されることを意味しますが、繰り返されません。 \":: = {pktcsigdevmultifreqtoneentry 11}}"
    },
    {
      "indent": 3,
      "text": "pktcSigDevCidDelayAfterLR OBJECT-TYPE SYNTAX Unsigned32 (300..800) UNITS \"Milliseconds\" MAX-ACCESS read-write STATUS current DESCRIPTION \"This object specifies the delay between the end of the Line Reversal and the start of the FSK or DTMF signal. This MIB object is used only when pktcSigDevCidMode is set to a value of 'lrETS'. This timing has a range of 300 to 800 ms.",
      "ja": "PKTCSIGDEVCIDDELAYAFTERLRオブジェクトタイプの構文UNSIGN32（300..800）ユニット「Milliseconds」Max-Access Read-Writeステータス現在の説明 \"このオブジェクトは、ラインの逆転とFSKまたはDTMF信号の開始の間の遅延を指定します。オブジェクトは、PKTCSIGDEVCIDMODEが「LRET」の値に設定されている場合にのみ使用されます。このタイミングの範囲は300〜800ミリ秒です。"
    },
    {
      "indent": 11,
      "text": " The following table defines the default values for this MIB object, depending on the signal type (pktcSigDevCidMode), and MUST be followed:",
      "ja": "次の表は、信号タイプ（PKTCSIGDEVCIDMODE）に応じて、このMIBオブジェクトのデフォルト値を定義し、次のことを実行する必要があります。"
    },
    {
      "indent": 10,
      "text": "Value of pktcSigDevCidMode Default value",
      "ja": "PKTCSIGDEVCIDMODEデフォルト値の値"
    },
    {
      "indent": 12,
      "text": "duringringingETS               any value  (not used)\ndtAsETS                        any value  (not used)\nrpAsETS                        any value  (not used)\nlrAsETS                        any value  (not used)\nlrETS                          400",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 12,
      "text": "An attempt to set this object while the value of pktcSigDevCidMode is not set to a value of 'lrETS' will result in an 'inconsistentValue' error.",
      "ja": "PKTCSIGDEVCIDMODEの値が「LRET」の値に設定されていない間、このオブジェクトを設定しようとすると、「一貫性のない値」エラーが発生します。"
    },
    {
      "indent": 7,
      "text": "     The value of this MIB object MUST NOT persist across MTA\n     reboots.\"\nDEFVAL { 400 }\n::= {pktcSigDevObjects 34 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pktcSigDevCidDtmfStartCode OBJECT-TYPE SYNTAX DtmfCode MAX-ACCESS read-write STATUS current DESCRIPTION \"This object identifies optional start codes used when the MIB object pktcSigDevCidSigProtocol is set to a value of 'dtmf(2)'.",
      "ja": "pktcsigdevciddtmfstartcode object-type syntax dtmfcode max-access read-writeステータス現在の説明 \"このオブジェクトは、mibオブジェクトpktcsigdevcdevcidsigprotocolが 'dtmf（2）の値に設定されたときに使用されるオプションの開始コードを識別します。"
    },
    {
      "indent": 12,
      "text": "Different countries define different caller id signaling codes to support caller identification. When Dual-Tone Multi-Frequency (DTMF) is used, the caller id digits are preceded by a 'start code' digit, followed by the digit transmission sequence <S1>...<Sn> (where Sx represents the digits 0-9), and terminated by the 'end code' digit.",
      "ja": "さまざまな国が、発信者の識別をサポートするために、異なる発信者IDシグナリングコードを定義します。デュアルトーンの多周波（DTMF）を使用すると、発信者IDディジットの前に「Start Code」数字が続き、その後に桁伝送シーケンス<S1> ... <SN>（SXが桁0-を表します）が続きます。9）、および「エンドコード」桁によって終了しました。"
    },
    {
      "indent": 12,
      "text": "For example, <A><S1>...<Sn> <D><S1>...<Sn> <B><S1>...<Sn> <C>. The start code for calling number delivery may be DTMF 'A' or 'D'. The start code for redirecting a number may be DTMF 'D'. The DTMF code 'B' may be sent by the network as a start code for the transfer of information values, through which special events can be indicated to the user. In some countries, the '*' or '#' may be used instead of 'A', 'B', 'C', or 'D'.",
      "ja": "たとえば、<a> <s1> ... <sn> <d> <s1> ... <sn> <b> <s1> ... <sn> <c>。番号配信を呼び出すための開始コードは、dtmf 'a'または 'd'である場合があります。番号をリダイレクトするための開始コードは、dtmf 'd'になる場合があります。DTMFコード 'B'は、ユーザーに特別なイベントを示すことができる情報値を転送するための開始コードとしてネットワークによって送信される場合があります。一部の国では、「A」、「B」、「C」、または「D」の代わりに「*」または「＃」が使用される場合があります。"
    },
    {
      "indent": 3,
      "text": "         The value of this MIB object MUST NOT persist across MTA\n            reboots.\"\n    REFERENCE\n         \"ETSI-EN-300-659-1 specification\"\n    DEFVAL {dtmfcodeA}\n::= { pktcSigDevObjects 35 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pktcSigDevCidDtmfEndCode OBJECT-TYPE SYNTAX DtmfCode MAX-ACCESS read-write STATUS current DESCRIPTION \"This object identifies optional end codes used when the pktcSigDevCidSigProtocol is set to a value of 'dtmf(2)'.",
      "ja": "pktcsigdevciddtmfendcode object-type syntax dtmfcode max-access read-writeステータス現在の説明 \"このオブジェクトは、pktcsigdevcidsigprotocolが 'dtmf（2）'の値に設定されている場合に使用されるオプションのエンドコードを識別します。"
    },
    {
      "indent": 12,
      "text": "Different countries define different caller id signaling protocols to support caller identification. When Dual-Tone Multi-Frequency (DTMF) is used, the caller id digits are preceded by a 'start code' digit, followed by the digit transmission sequence <S1>...<Sn> (where Sx represents the digits 0-9), and terminated by the 'end code' digit.",
      "ja": "さまざまな国が、発信者の識別をサポートするために、さまざまな発信者IDシグナリングプロトコルを定義します。デュアルトーンの多周波（DTMF）を使用すると、発信者IDディジットの前に「Start Code」数字が続き、その後に桁伝送シーケンス<S1> ... <SN>（SXが桁0-を表します）が続きます。9）、および「エンドコード」桁によって終了しました。"
    },
    {
      "indent": 12,
      "text": "For example, <A><S1>...<Sn> <D><S1>...<Sn> <B><S1>...<Sn> <C>.",
      "ja": "たとえば、<a> <s1> ... <sn> <d> <s1> ... <sn> <b> <s1> ... <sn> <c>。"
    },
    {
      "indent": 12,
      "text": "The DTMF code 'C' may be sent by the network as an end code for the transfer of information values, through which special events can be indicated to the user. In some countries, the '*' or '#' may be used instead of 'A', 'B', 'C', or 'D'.",
      "ja": "DTMFコード「C」は、情報値を転送するための最終コードとしてネットワークによって送信される場合があります。一部の国では、「A」、「B」、「C」、または「D」の代わりに「*」または「＃」が使用される場合があります。"
    },
    {
      "indent": 3,
      "text": "         The value of this MIB object MUST NOT persist across MTA\n         reboots.\"\n    REFERENCE\n         \"ETSI-EN-300-659-1 specification\"\n    DEFVAL {dtmfcodeC}\n::= { pktcSigDevObjects 36 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pktcSigDevVmwiSigProtocol OBJECT-TYPE SYNTAX PktcSubscriberSideSigProtocol MAX-ACCESS read-write STATUS current DESCRIPTION \"This object identifies the subscriber line protocol used for signaling the information on Visual Message Waiting Indicator (VMWI). Different countries define different VMWI signaling protocols to support VMWI service.",
      "ja": "PKTCSIGDEVVMWISIGPROTOCOLオブジェクトタイプの構文PKTCSUBSDIGPROTOCOL MAX-ACCESS READ-WRITEステータス現在の説明 \"このオブジェクトは、視覚メッセージ待機インジケータ（VMWI）の視覚的なメッセージの情報を示すために使用されるサブスクライバーラインプロトコルを識別します。"
    },
    {
      "indent": 12,
      "text": "Frequency shift keying (FSK) is most commonly used. DTMF is an alternative.",
      "ja": "周波数シフトキーイング（FSK）が最も一般的に使用されます。DTMFは代替品です。"
    },
    {
      "indent": 3,
      "text": "         The value of this MIB object MUST NOT persist across MTA\n         reboots.\"\n     DEFVAL { fsk }\n::= { pktcSigDevObjects 37 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pktcSigDevVmwiDelayAfterLR OBJECT-TYPE SYNTAX Unsigned32 (0|300..800) UNITS \"Milliseconds\" MAX-ACCESS read-write STATUS current DESCRIPTION \"This object specifies the delay between the end of the Line Reversal and the start of the FSK or DTMF signal. This object is only used when pktcSigDevVmwiMode is set to a value of 'lrETS'. This timing has a range of 300 to 800 ms.",
      "ja": "pktcsigdevvmwidelayafterlr object-type syntax untigned32（0 | 300..800）ユニット \"milliseconds\" max-access read-write status current current current \"このオブジェクトは、ラインの反転とFSKまたはDTMF信号の開始の間の遅延を指定します。このオブジェクトは、pktcsigdevvmwimodeが「lrets」の値に設定されている場合にのみ使用されます。このタイミングの範囲は300〜800ミリ秒です。"
    },
    {
      "indent": 11,
      "text": " The following table defines the default values for this MIB object, depending on the signal type (pktcSigDevVmwiMode), and MUST be followed:",
      "ja": "次の表は、信号タイプ（PKTCSIGDEVVMWIMODE）に応じて、このMIBオブジェクトのデフォルト値を定義し、次のことを実行する必要があります。"
    },
    {
      "indent": 12,
      "text": "Value of pktcSigDevVmwiMode Default value",
      "ja": "pktcsigdevvmwimodeデフォルト値の値"
    },
    {
      "indent": 12,
      "text": "duringringingETS                  any value  (not used)\ndtAsETS                           any value  (not used)\nrpAsETS                           any value  (not used)\nlrAsETS                           any value  (not used)\nlrETS                             400",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 12,
      "text": "An attempt to set this object while the value of pktcSigDevVmwiMode is not 'lrETS' will result in an 'inconsistentValue' error.",
      "ja": "PKTCSIGDEVVMWIMODEの値が「LRET」ではない間にこのオブジェクトを設定しようとすると、「一貫性のない値」エラーが発生します。"
    },
    {
      "indent": 12,
      "text": "The value of this MIB object MUST NOT persist across MTA reboots.\"",
      "ja": "このMIBオブジェクトの値は、MTAの再起動全体で持続してはなりません。」"
    },
    {
      "indent": 7,
      "text": "DEFVAL {400}\n    ::= {pktcSigDevObjects 38 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pktcSigDevVmwiDtmfStartCode OBJECT-TYPE SYNTAX DtmfCode MAX-ACCESS read-write STATUS current DESCRIPTION \"This object identifies optional start codes used when",
      "ja": "pktcsigdevvmwidtmfstartcode object-type syntax dtmfcode max-access read-writeステータス現在の説明 \"このオブジェクトは"
    },
    {
      "indent": 12,
      "text": "the pktcSigDevVmwiSigProtocol is set to a value of 'dtmf(2)'. Different countries define different On Hook Data Transmission Protocol signaling codes to support VMWI.",
      "ja": "pktcsigdevvmwisigprotocolは、「dtmf（2）」の値に設定されています。さまざまな国では、VMWIをサポートするために、フックデータ送信プロトコルシグナリングコードが異なります。"
    },
    {
      "indent": 12,
      "text": "When Dual-Tone Multi-Frequency (DTMF) is used, the VMWI digits are preceded by a 'start code' digit, followed by the digit transmission sequence <S1>...<Sn> (where Sx represents the digits 0-9), and terminated by the 'end code' digit.",
      "ja": "デュアルトーンの多周波（DTMF）を使用すると、VMWI桁の前に「Start Code」数字が続き、その後に桁伝送シーケンス<S1> ... <SN>（ここで、SXは桁0-9を表します。）、および「エンドコード」桁によって終了しました。"
    },
    {
      "indent": 12,
      "text": "For example, <A><S1>...<Sn> <D><S1>...<Sn> <B><S1>...<Sn> <C>.",
      "ja": "たとえば、<a> <s1> ... <sn> <d> <s1> ... <sn> <b> <s1> ... <sn> <c>。"
    },
    {
      "indent": 12,
      "text": "The start code for redirecting VMWI may be DTMF 'D' The DTMF code 'B' may be sent by the network as a start code for the transfer of information values, through which special events can be indicated to the user. In some countries, the '*' or '#' may be used instead of 'A', 'B', 'C', or 'D'.",
      "ja": "VMWIをリダイレクトするための開始コードは、DTMF 'D'である場合があります。DTMFコード 'B'は、情報値の転送のための開始コードとしてネットワークによって送信される場合があります。一部の国では、「A」、「B」、「C」、または「D」の代わりに「*」または「＃」が使用される場合があります。"
    },
    {
      "indent": 3,
      "text": "         The value of this MIB object MUST NOT persist across MTA\n         reboots.\"\n    REFERENCE\n         \"ETSI-EN-300-659-1 specification\"\n    DEFVAL {dtmfcodeA}\n::= { pktcSigDevObjects 39 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pktcSigDevVmwiDtmfEndCode OBJECT-TYPE SYNTAX DtmfCode MAX-ACCESS read-write STATUS current DESCRIPTION \"This object identifies an optional end code used when the pktcSigDevVmwiSigProtocol is set to a value of 'dtmf(2)'. Different countries define different on-hook Data Transmission Protocol signaling codes to support VMWI.",
      "ja": "PKTCSIGDEVVMWIDTMFENDCODEオブジェクトタイプの構文DTMFCODE MAX-ACCESS READ-WRITEステータス現在の説明 \"このオブジェクトは、PKTCSIGDEVVMWISIGPROTOCOLが 'DTMF（2）の値に設定されている場合に使用されるPKTCSIGDEVVMWISIGPROTOCOLが設定されている場合に使用されるオプションのエンドコードを識別します。VMWIをサポートするシグナリングコード。"
    },
    {
      "indent": 12,
      "text": "When Dual-Tone Multi-Frequency (DTMF) is used, the VMWI digits are preceded by a 'start code' digit, followed by the digit transmission sequence <S1>...<Sn> (where Sx represents the digits 0-9), and terminated by the 'end code' digit.",
      "ja": "デュアルトーンの多周波（DTMF）を使用すると、VMWI桁の前に「Start Code」数字が続き、その後に桁伝送シーケンス<S1> ... <SN>（ここで、SXは桁0-9を表します。）、および「エンドコード」桁によって終了しました。"
    },
    {
      "indent": 12,
      "text": "For example, <A><S1>...<Sn> <D><S1>...<Sn> <B><S1>...<Sn> <C>.",
      "ja": "たとえば、<a> <s1> ... <sn> <d> <s1> ... <sn> <b> <s1> ... <sn> <c>。"
    },
    {
      "indent": 12,
      "text": "The DTMF code 'C' may be sent by the network as an end code for the transfer of information values, through which special events can be indicated to the user. In some countries, the '*' or '#' may be used instead of 'A', 'B', 'C', or 'D'.",
      "ja": "DTMFコード「C」は、情報値を転送するための最終コードとしてネットワークによって送信される場合があります。一部の国では、「A」、「B」、「C」、または「D」の代わりに「*」または「＃」が使用される場合があります。"
    },
    {
      "indent": 3,
      "text": "         The value of this MIB object MUST NOT persist across MTA\n         reboots.\"\n    REFERENCE\n         \"ETSI-EN-300-659-1 specification\"\n    DEFVAL {dtmfcodeC}\n::= { pktcSigDevObjects 40 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigDevrpAsDtsDuration OBJECT-TYPE SYNTAX Unsigned32 (0|200..500) UNITS \"Milliseconds\" MAX-ACCESS read-write STATUS current DESCRIPTION \" This object specifies the duration of the rpASDTS ring pulse prior to the start of the transmission of the FSK or DTMF containing the caller id information. It is only used when pktcSigDevCidMode is set to a value of 'rpAsETS'.",
      "ja": "pktcsigdevrpasdtsduration object-type syntax unting32（0 | 200..500）unit \"milliseconds read-writeステータス現在の説明\"このオブジェクトは、FSKまたはDTMFの透過の開始前にRPASDTSリングパルスの持続時間を指定します。発信者ID情報を含む。これは、PKTCSIGDEVCIDMODEが「rPasets」の値に設定されている場合にのみ使用されます。"
    },
    {
      "indent": 12,
      "text": " The following table defines the default values for this MIB object, depending on the signal type (pktcSigDevCidMode), and MUST be followed:",
      "ja": "次の表は、信号タイプ（PKTCSIGDEVCIDMODE）に応じて、このMIBオブジェクトのデフォルト値を定義し、次のことを実行する必要があります。"
    },
    {
      "indent": 13,
      "text": "Value of pktcSigDevCidMode Default value",
      "ja": "PKTCSIGDEVCIDMODEデフォルト値の値"
    },
    {
      "indent": 13,
      "text": "duringringingETS                 any value  (not used)\ndtAsETS                          any value  (not used)\nrpAsETS                          250\nlrAsETS                          any value  (not used)\nlrETS                            any value  (not used)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 13,
      "text": "An attempt to set this object while the value of pktcSigDevCidMode is not 'rpAsETS' will result in an 'inconsistentValue' error.",
      "ja": "pktcsigdevcidmodeの値が「rpaset」ではない間にこのオブジェクトを設定しようとすると、「矛盾する値」エラーが発生します。"
    },
    {
      "indent": 7,
      "text": "     The value of this MIB object MUST NOT persist across MTA\n     reboots.\"\nREFERENCE\n    \"ETSI-EN-300-659-1 Specification and Belgacom\n     BGC_D_48_9811_30_09_EDOC version 3.3\"\nDEFVAL { 250 }\n::= {pktcSigDevObjects 41 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "--\n-- The Endpoint Config Table is used to define attributes that\n-- are specific to connection EndPoints.\n--",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigTable  OBJECT-TYPE\n    SYNTAX        SEQUENCE OF PktcSigEndPntConfigEntry\n    MAX-ACCESS    not-accessible\n    STATUS        current\n    DESCRIPTION\n        \" This table describes the information pertaining to each\n          endpoint of the MTA.  All entries in this table represent\n          the provisioned endpoints provisioned with the information\n          required by the MTA to maintain the NCS protocol\n          communication with the CMS.  Each endpoint can be assigned\n          to its own CMS.  If the specific endpoint does not have\n          the corresponding CMS information in this table, the\n          endpoint is considered as not provisioned with voice\n          services.  Objects in this table do not persist across\n          MTA reboots.\"\n   ::=  { pktcSigEndPntConfigObjects 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigEntry  OBJECT-TYPE\n    SYNTAX        PktcSigEndPntConfigEntry\n    MAX-ACCESS    not-accessible\n    STATUS        current\n    DESCRIPTION\n        \"Each entry in the pktcSigEndPntConfigTable represents\n         required signaling parameters for the specific endpoint\n         provisioned with voice services.  The conceptual rows MUST\n         NOT persist across MTA reboots.\"\n    INDEX { ifIndex }\n    ::= { pktcSigEndPntConfigTable 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "PktcSigEndPntConfigEntry  ::= SEQUENCE {\n    pktcSigEndPntConfigCallAgentId             SnmpAdminString,\n    pktcSigEndPntConfigCallAgentUdpPort        InetPortNumber,\n    pktcSigEndPntConfigPartialDialTO           Unsigned32,\n    pktcSigEndPntConfigCriticalDialTO          Unsigned32,\n    pktcSigEndPntConfigBusyToneTO              Unsigned32,\n    pktcSigEndPntConfigDialToneTO              Unsigned32,\n    pktcSigEndPntConfigMessageWaitingTO        Unsigned32,\n    pktcSigEndPntConfigOffHookWarnToneTO       Unsigned32,\n    pktcSigEndPntConfigRingingTO               Unsigned32,\n    pktcSigEndPntConfigRingBackTO              Unsigned32,\n    pktcSigEndPntConfigReorderToneTO           Unsigned32,\n    pktcSigEndPntConfigStutterDialToneTO       Unsigned32,\n    pktcSigEndPntConfigTSMax                   Unsigned32,\n    pktcSigEndPntConfigMax1                    Unsigned32,\n    pktcSigEndPntConfigMax2                    Unsigned32,\n    pktcSigEndPntConfigMax1QEnable             TruthValue,\n    pktcSigEndPntConfigMax2QEnable             TruthValue,\n    pktcSigEndPntConfigMWD                     Unsigned32,\n    pktcSigEndPntConfigTdinit                  Unsigned32,\n    pktcSigEndPntConfigTdmin                   Unsigned32,\n    pktcSigEndPntConfigTdmax                   Unsigned32,\n    pktcSigEndPntConfigRtoMax                  Unsigned32,\n    pktcSigEndPntConfigRtoInit                 Unsigned32,\n    pktcSigEndPntConfigLongDurationKeepAlive   Unsigned32,\n    pktcSigEndPntConfigThist                   Unsigned32,\n    pktcSigEndPntConfigStatus                  RowStatus,\n    pktcSigEndPntConfigCallWaitingMaxRep       Unsigned32,\n    pktcSigEndPntConfigCallWaitingDelay        Unsigned32,\n    pktcSigEndPntStatusCallIpAddressType       InetAddressType,\n    pktcSigEndPntStatusCallIpAddress           InetAddress,\n    pktcSigEndPntStatusError                   INTEGER,\n    pktcSigEndPntConfigMinHookFlash            Unsigned32,\n    pktcSigEndPntConfigMaxHookFlash            Unsigned32,\n    pktcSigEndPntConfigPulseDialInterdigitTime Unsigned32,\n    pktcSigEndPntConfigPulseDialMinMakeTime    Unsigned32,\n    pktcSigEndPntConfigPulseDialMaxMakeTime    Unsigned32,\n    pktcSigEndPntConfigPulseDialMinBreakTime   Unsigned32,\n    pktcSigEndPntConfigPulseDialMaxBreakTime   Unsigned32\n    }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigCallAgentId OBJECT-TYPE SYNTAX SnmpAdminString(SIZE (3..255)) MAX-ACCESS read-create STATUS current DESCRIPTION \" This object contains a string indicating the call agent name (e.g., ca@example.com). The call agent name, after the character '@', MUST be a fully qualified domain name (FQDN) and MUST have a corresponding pktcMtaDevCmsFqdn entry in the pktcMtaDevCmsTable. The object pktcMtaDevCmsFqdn is defined in the PacketCable MIBMTA Specification. For each particular endpoint, the MTA MUST use the current value of this object to communicate with the corresponding CMS. The MTA MUST update this object with the value of the 'Notified Entity' parameter of the NCS message. Because of the high importance of this object to the ability of the MTA to maintain reliable NCS communication with the CMS, it is highly recommended not to change this object's value using SNMP during normal operation.\"",
      "ja": "pktcsigendpntconfigcallagentid object-type sntax snmpadminstring（size（3..255））max-access read-createステータス現在の説明 \"このオブジェクトには、コールエージェント名（ca@example.comなど）を示す文字列が含まれています。文字 '@'の後、完全に資格のあるドメイン名（fqdn）でなければならず、pktcmtadevcmstableの対応するpktcmtadevcmsfqdnエントリが必要です。対応するCMSと通信するこのオブジェクトの値。MTAは、NCSメッセージの「通知されたエンティティ」パラメーターの値でこのオブジェクトを更新する必要があります。CMSとの通信は、通常の動作中にSNMPを使用してこのオブジェクトの値を変更しないことを強くお勧めします。」"
    },
    {
      "indent": 4,
      "text": "::= {  pktcSigEndPntConfigEntry 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigCallAgentUdpPort    OBJECT-TYPE\n    SYNTAX      InetPortNumber (1025..65535)\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n        \" This object contains the current value of the User\n          Datagram Protocol (UDP) receive port on which the\n          call agent will receive NCS from the endpoint.\n          For each particular endpoint, the MTA MUST use the current\n          value of this object to communicate with the corresponding\n          CMS.  The MTA MUST update this object with the value of the\n          'Notified Entity' parameter of the NCS message.  If the\n          Notified Entity parameter does not contain a CallAgent\n          port, the MTA MUST update this object with the default\n          value of 2727.  Because of the high importance of this\n          object to the ability of the MTA to maintain reliable NCS\n          communication with the CMS, it is highly recommended not\n          to change this object's value using SNMP during normal\n          operation.\"\n    REFERENCE\n        \"PacketCable NCS Specification\"\n    DEFVAL    { 2727 }\n    ::= { pktcSigEndPntConfigEntry 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigPartialDialTO     OBJECT-TYPE\n    SYNTAX       Unsigned32\n    UNITS        \"seconds\"\n    MAX-ACCESS   read-create\n    STATUS       current\n    DESCRIPTION\n        \"This object contains the value of the partial dial\n         time out.\n         The time out (TO) elements are intended to limit the time a\n         tone or frequency is generated.  When this MIB object is set\n         to a value of '0', the MTA MUST NOT generate the\n         corresponding frequency or tone, regardless of the\n         definitions pertaining to frequency, tone duration, or\n         cadence.\"\n    REFERENCE\n        \"PacketCable NCS Specification\"\n    DEFVAL { 16 }\n    ::= { pktcSigEndPntConfigEntry 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigCriticalDialTO     OBJECT-TYPE\n    SYNTAX       Unsigned32\n    UNITS        \"seconds\"\n    MAX-ACCESS   read-create\n    STATUS       current\n    DESCRIPTION\n        \"This object contains the value of the critical\n         dial time out.\n         The time out (TO) elements are intended to limit the time a\n         tone or frequency is generated.  When this MIB object is set\n         to a value of '0', the MTA MUST NOT generate the\n         corresponding frequency or tone, regardless of the\n         definitions pertaining to frequency, tone duration, or\n         cadence.\"\n    REFERENCE\n        \"PacketCable NCS Specification\"\n    DEFVAL { 4 }\n    ::= { pktcSigEndPntConfigEntry 4 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigBusyToneTO     OBJECT-TYPE\n    SYNTAX       Unsigned32\n    UNITS        \"seconds\"\n    MAX-ACCESS   read-create\n    STATUS       current\n    DESCRIPTION\n        \" This object contains the default time out value for busy\n          tone.  The MTA MUST NOT update this object with the\n          value provided in the NCS message (if present).  If\n          the value of the object is modified by the SNMP Management\n          Station, the MTA MUST use the new value as a default only\n          for a new signal requested by the NCS message.\n          The time out (TO) elements are intended to limit the time\n          a tone or frequency is generated.  When this MIB object is\n          set to a value of '0', the MTA MUST NOT generate the\n          corresponding frequency or tone, regardless of the\n          definitions pertaining to frequency, tone duration, or\n          cadence.\"\n    REFERENCE\n        \"PacketCable NCS Specification\"\n    DEFVAL    { 30 }\n    ::= { pktcSigEndPntConfigEntry 5 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigDialToneTO     OBJECT-TYPE\n    SYNTAX       Unsigned32\n    UNITS        \"seconds\"\n    MAX-ACCESS   read-create\n    STATUS       current\n    DESCRIPTION\n        \" This object contains the default time out value for dial\n          tone.  The MTA MUST NOT update this object with the\n          value provided in the NCS message (if present).  If\n          the value of the object is modified by the SNMP Management\n          Station, the MTA MUST use the new value as a default only\n          for a new signal requested by the NCS message.\n          The time out (TO) elements are intended to limit the time\n          a tone or frequency is generated.  When this MIB object is\n          set to a value of '0', the MTA MUST NOT generate the\n          corresponding frequency or tone, regardless of the\n          definitions pertaining to frequency, tone duration, or\n          cadence.\"\n    REFERENCE\n        \"PacketCable NCS Specification\"\n    DEFVAL    { 16 }\n    ::= { pktcSigEndPntConfigEntry 6 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigMessageWaitingTO     OBJECT-TYPE\n    SYNTAX       Unsigned32\n    UNITS        \"seconds\"\n    MAX-ACCESS   read-create\n    STATUS       current\n    DESCRIPTION\n        \" This object contains the default time out value for message\n          waiting indicator.  The MTA MUST NOT update this object\n          with the value provided in the NCS message (if\n          present).  If the value of the object is modified by the\n          SNMP Manager application, the MTA MUST use the new value\n          as a default only for a new signal requested by the NCS\n          message.\n          The time out (TO) elements are intended to limit the time\n          a tone or frequency is generated.  When this MIB object is\n          set to a value of '0', the MTA MUST NOT generate the\n          corresponding frequency or tone, regardless of the\n          definitions pertaining to frequency, tone duration, or\n          cadence.\"\n    REFERENCE\n        \"PacketCable NCS Specification\"\n    DEFVAL    { 16 }\n    ::= { pktcSigEndPntConfigEntry 7 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigOffHookWarnToneTO     OBJECT-TYPE\n    SYNTAX       Unsigned32\n    UNITS        \"seconds\"\n    MAX-ACCESS   read-create\n    STATUS       current\n    DESCRIPTION\n        \" This object contains the default time out value for the\n          off-hook warning tone.  The MTA MUST NOT update this object\n          with the value provided in the NCS message (if present).  If\n          the value of the object is modified by the SNMP Manager\n          application, the MTA MUST use the new value as a default\n          only for a new signal requested by the NCS message.  The\n          time out (TO) elements are intended to limit the time a tone\n          or frequency is generated.  When this MIB object is set to a\n          value of '0', the MTA MUST NOT generate the corresponding\n          frequency or tone, regardless of the definitions pertaining\n          to frequency, tone duration, or cadence.\"\n    REFERENCE\n        \"PacketCable NCS Specification\"\n    DEFVAL { 0 }\n    ::= { pktcSigEndPntConfigEntry 8 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigRingingTO     OBJECT-TYPE\n    SYNTAX       Unsigned32\n    UNITS        \"seconds\"\n    MAX-ACCESS   read-create\n    STATUS       current\n    DESCRIPTION\n        \" This object contains the default time out value for\n          ringing.  The MTA MUST NOT update this object with the\n          value provided in the NCS message (if present).  If\n          the value of the object is modified by the SNMP Management\n          Station, the MTA MUST use the new value as a default only\n          for a new signal requested by the NCS message.\n          The time out (TO) elements are intended to limit the time\n          a tone or frequency is generated.  When this MIB object is\n          set to a value of '0', the MTA MUST NOT generate the\n          corresponding frequency or tone, regardless of the\n          definitions pertaining to frequency, tone duration, or\n          cadence.\"\n    REFERENCE\n        \"PacketCable NCS Specification\"\n    DEFVAL    { 180 }\n    ::= { pktcSigEndPntConfigEntry 9 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigRingBackTO     OBJECT-TYPE\n    SYNTAX       Unsigned32\n    UNITS        \"seconds\"\n    MAX-ACCESS   read-create\n    STATUS       current\n    DESCRIPTION\n        \" This object contains the default time out value for ring\n          back.  The MTA MUST NOT update this object with the\n          value provided in the NCS message (if present).  If\n          the value of the object is modified by the SNMP Management\n          Station, the MTA MUST use the new value as a default only\n          for a new signal requested by the NCS message.\n          The time out (TO) elements are intended to limit the time\n          a tone or frequency is generated.  When this MIB object is\n          set to a value of '0', the MTA MUST NOT generate the\n          corresponding frequency or tone, regardless of the\n          definitions pertaining to frequency, tone duration, or\n          cadence.\"\n    REFERENCE\n        \"PacketCable NCS Specification\"\n    DEFVAL    { 180 }\n    ::= { pktcSigEndPntConfigEntry 10 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigReorderToneTO     OBJECT-TYPE\n    SYNTAX       Unsigned32\n    UNITS        \"seconds\"\n    MAX-ACCESS   read-create\n    STATUS       current\n    DESCRIPTION\n        \" This object contains the default time out value for reorder\n          tone.  The MTA MUST NOT update this object with the\n          value provided in the NCS message (if present).  If\n          the value of the object is modified by the SNMP Management\n          Station, the MTA MUST use the new value as a default only\n          for a new signal requested by the NCS message.\n          The time out (TO) elements are intended to limit the time\n          a tone or frequency is generated.  When this MIB object is\n          set to a value of '0', the MTA MUST NOT generate the\n          corresponding frequency or tone, regardless of the\n          definitions pertaining to frequency, tone duration, or\n          cadence.\"\n    REFERENCE\n        \"PacketCable NCS Specification\"\n    DEFVAL    { 30 }\n    ::= { pktcSigEndPntConfigEntry 11 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigStutterDialToneTO     OBJECT-TYPE\n    SYNTAX       Unsigned32\n    UNITS        \"seconds\"\n    MAX-ACCESS   read-create\n    STATUS       current\n    DESCRIPTION\n        \" This object contains the default time out value for stutter\n          dial tone.  The MTA MUST NOT update this object with the\n          value provided in the NCS message (if present).  If\n          the value of the object is modified by the SNMP Management\n          Station, the MTA MUST use the new value as a default only\n          for a new signal requested by the NCS message.\n          The time out (TO) elements are intended to limit the time\n          a tone or frequency is generated.  When this MIB object is\n          set to a value of '0', the MTA MUST NOT generate the\n          corresponding frequency or tone, regardless of the\n          definitions pertaining to frequency, tone duration, or\n          cadence.\"\n    REFERENCE\n          \"PacketCable NCS Specification\"\n    DEFVAL    { 16 }\n    ::= { pktcSigEndPntConfigEntry 12 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigTSMax OBJECT-TYPE SYNTAX Unsigned32 MAX-ACCESS read-create STATUS current DESCRIPTION \"This MIB object is used as part of an NCS retransmission algorithm. Prior to any retransmission, the MTA must check to make sure that the time elapsed since the sending of the initial datagram does not exceed the value specified by this MIB object. If more than Tsmax time has elapsed, then the retransmissions MUST cease.",
      "ja": "pktcsigendpntconfigtsmax object-type syntax untax untigned32 max-access read-createステータス現在の説明 \"このMIBオブジェクトは、NCS再送信アルゴリズムの一部として使用されます。初期データグラムは、このMIBオブジェクトによって指定された値を超えません。TSMAX時間以上が経過した場合、再送信は停止する必要があります。"
    },
    {
      "indent": 4,
      "text": "        Refer to the MIB object pktcSigEndPntConfigThist for\n        information on when the endpoint becomes disconnected.\"\nREFERENCE\n    \"PacketCable NCS Specification\"\nDEFVAL { 20 }\n::= { pktcSigEndPntConfigEntry 13 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigMax1     OBJECT-TYPE\n    SYNTAX      Unsigned32\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n        \"This object contains the suspicious error threshold for\n         signaling messages.  The pktcSigEndPntConfigMax1 object\n         indicates the retransmission threshold at which the MTA MAY\n         actively query the domain name server (DNS) in order to\n         detect the possible change of call agent interfaces.\"\n    REFERENCE\n        \"PacketCable NCS Specification\"\n    DEFVAL { 5 }\n    ::= { pktcSigEndPntConfigEntry 14 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigMax2 OBJECT-TYPE SYNTAX Unsigned32 MAX-ACCESS read-create STATUS current DESCRIPTION",
      "ja": "pktcsigendpntconfigmax2 object-type syntax unsigned32 max-access read-createステータス現在の説明"
    },
    {
      "indent": 4,
      "text": "    \"This object contains the disconnect error threshold for\n     signaling messages.  The pktcSigEndPntConfigMax2 object\n     indicates the retransmission threshold at which the MTA\n     SHOULD contact the DNS one more time to see if any other\n     interfaces to the call agent have become available.\"\nREFERENCE\n    \"PacketCable NCS Specification\"\nDEFVAL { 7 }\n::= { pktcSigEndPntConfigEntry 15 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigMax1QEnable     OBJECT-TYPE\n    SYNTAX      TruthValue\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n        \"This object enables/disables the Max1 domain name server\n         (DNS) query operation when the pktcSigEndPntConfigMax1\n         threshold has been reached.\n         A value of true(1) indicates enabling, and a value of\n         false(2) indicates disabling.\"\n    DEFVAL { true }\n    ::= { pktcSigEndPntConfigEntry 16 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigMax2QEnable     OBJECT-TYPE\n    SYNTAX      TruthValue\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n        \"This object enables/disables the Max2 domain name server\n         (DNS) query operation when the pktcSigEndPntConfigMax2\n         threshold has been reached.\n         A value of true(1) indicates enabling, and a value of\n         false(2) indicates disabling.\"\n    DEFVAL { true }\n    ::= { pktcSigEndPntConfigEntry 17 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigMWD OBJECT-TYPE SYNTAX Unsigned32 UNITS \"seconds\" MAX-ACCESS read-create STATUS current DESCRIPTION \"Maximum Waiting Delay (MWD) contains the maximum number of seconds an MTA waits, after powering on, before initiating the restart procedure with the call agent.\" REFERENCE \"PacketCable NCS Specification\" DEFVAL { 600 }",
      "ja": "pktcsigendpntconfigmwd object-type syntax unstax untigned32 unit \"秒\" max-access read-createステータス現在の説明 \"最大待機遅延（MWD）には、MTAが待機した後、最大秒数が含まれています。「参照「PacketCable NCS仕様」defval {600}"
    },
    {
      "indent": 4,
      "text": "::= { pktcSigEndPntConfigEntry 18 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigTdinit OBJECT-TYPE SYNTAX Unsigned32 UNITS \"seconds\" MAX-ACCESS read-create STATUS current DESCRIPTION \"This MIB object represents the 'disconnected' initial waiting delay within the context of an MTA's 'disconnected procedure'. The 'disconnected procedure' is initiated when an endpoint becomes 'disconnected' while attempting to communicate with a call agent.",
      "ja": "pktcsigendpntconfigtdinit object-type syntax untax untigned32 unit \"秒\" max-access read-createステータス現在の説明 \"このMIBオブジェクトは、MTAの「切断された手順」のコンテキスト内の「切断された」初期待機遅延を表します。コールエージェントとの通信を試みながら、エンドポイントは「切断」されます。"
    },
    {
      "indent": 9,
      "text": "The 'disconnected timer' associated with the 'disconnected Procedure' is initialized to a random value, uniformly distributed between zero and the value contained in this MIB object.",
      "ja": "「切断された手順」に関連付けられた「切断されたタイマー」は、ゼロとこのMIBオブジェクトに含まれる値の間に均一に分布するランダム値に初期化されます。"
    },
    {
      "indent": 4,
      "text": "     For more information on the usage of this timer, please\n     refer to the PacketCable NCS Specification.\"\nREFERENCE\n    \"PacketCable NCS Specification\"\nDEFVAL { 15 }\n::= { pktcSigEndPntConfigEntry 19 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigTdmin     OBJECT-TYPE\n    SYNTAX      Unsigned32\n    UNITS       \"seconds\"\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n            \"This MIB object represents the 'disconnected' minimum\n             waiting delay within the context of an MTA's\n             'disconnected procedure', specifically when local user\n             activity is detected.\n             The 'disconnected procedure' is initiated when\n             an endpoint becomes 'disconnected' while attempting to\n             communicate with a call agent.\n             For more information on the usage of this timer, please\n             refer to the PacketCable NCS Specification.\"\n    REFERENCE\n        \"PacketCable NCS Specification\"\n    DEFVAL { 15 }\n    ::= { pktcSigEndPntConfigEntry 20 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigTdmax     OBJECT-TYPE\n    SYNTAX      Unsigned32\n    UNITS       \"seconds\"\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n        \" This object contains the maximum number of seconds the MTA\n          waits, after a disconnect, before initiating the\n          disconnected procedure with the call agent.\n           \"\n    REFERENCE\n        \"PacketCable NCS Specification\"\n    DEFVAL { 600 }\n    ::= { pktcSigEndPntConfigEntry 21 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigRtoMax     OBJECT-TYPE\n    SYNTAX      Unsigned32\n    UNITS       \"seconds\"\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n        \"This object specifies the maximum number of seconds the MTA\n         waits for a response to an NCS message before initiating\n         a retransmission.\"\n    REFERENCE\n        \"PacketCable NCS Specification\"\n    DEFVAL { 4 }\n    ::= { pktcSigEndPntConfigEntry 22 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigRtoInit     OBJECT-TYPE\n    SYNTAX      Unsigned32\n    UNITS       \"milliseconds\"\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n        \" This object contains the initial number of seconds for the\n          retransmission timer.\"\n    REFERENCE\n        \"PacketCable NCS Specification\"\n    DEFVAL { 200 }\n    ::= { pktcSigEndPntConfigEntry 23 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigLongDurationKeepAlive OBJECT-TYPE SYNTAX Unsigned32 UNITS \"minutes\" MAX-ACCESS read-create STATUS current DESCRIPTION \" Specifies a time out value, in minutes, for sending long duration call notification messages.\"",
      "ja": "PKTCSIGENDPNTCONFIGLONGDURATIONKEEPALIVE OBJECT-TYPE SYNTAX UNSIGNED32 UNITS \"MINTSION\" MAX-ACCESS READ-Createステータス現在の説明 \"長時間のコール通知メッセージを送信するために、数分でタイムアウト値を指定します。」"
    },
    {
      "indent": 4,
      "text": "REFERENCE\n    \"PacketCable NCS Specification\"\nDEFVAL { 60 }\n::= { pktcSigEndPntConfigEntry 24 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigThist  OBJECT-TYPE\n    SYNTAX      Unsigned32\n    UNITS       \"seconds\"\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n        \" Time out period, in seconds, before no response is declared.\"\n    REFERENCE\n        \"PacketCable NCS Specification\"\n    DEFVAL { 30 }\n    ::= { pktcSigEndPntConfigEntry 25 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigStatus     OBJECT-TYPE\n    SYNTAX      RowStatus\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n        \" This object contains the Row Status associated with the\n          pktcSigEndPntConfigTable.  There are no restrictions or\n          dependencies amidst the columnar objects before this\n          row can be activated or for modifications of the\n          columnar objects when this object is set to a\n          value of 'active(1).\"\n    ::= { pktcSigEndPntConfigEntry 26 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigCallWaitingMaxRep     OBJECT-TYPE\n    SYNTAX      Unsigned32 (0..10)\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n        \" This object contains the default value of the maximum\n          number of repetitions of the Call Waiting tone that the\n          MTA will play from a single CMS request.  The MTA MUST NOT\n          update this object with the information provided in the\n          NCS message (if present).  If the value of the object is\n          modified by the SNMP Manager application, the MTA MUST use\n          the new value as a default only for a new signal\n          requested by the NCS message.\"\n    DEFVAL    { 1 }\n    ::= { pktcSigEndPntConfigEntry 27 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigCallWaitingDelay     OBJECT-TYPE\n    SYNTAX       Unsigned32 (1..100)\n    UNITS        \"seconds\"\n    MAX-ACCESS   read-create\n    STATUS       current\n    DESCRIPTION\n        \" This object contains the delay between repetitions of the\n          Call Waiting tone that the MTA will play from a single CMS\n          request.\"\n    DEFVAL    { 10 }\n    ::= { pktcSigEndPntConfigEntry 28 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntStatusCallIpAddressType OBJECT-TYPE SYNTAX InetAddressType MAX-ACCESS read-only STATUS current DESCRIPTION \" This object contains the type of Internet address contained in the MIB object 'pktcSigEndPntStatusCallIpAddress'.",
      "ja": "pktcsigendpntstatuscallipaddresstypeオブジェクトタイプの構文inetaddresstype read-access読み取り専用ステータス現在の説明 \"このオブジェクトには、mibオブジェクトに含まれるインターネットアドレスのタイプが含まれています。"
    },
    {
      "indent": 9,
      "text": "Since pktcSigEndPntStatusCallIpAddress is expected to contain an IP address, a value of dns(16) is disallowed.\"",
      "ja": "pktcsigendpntpntstatuscallipaddressにはIPアドレスが含まれると予想されるため、DNS（16）の値は許可されていません。」"
    },
    {
      "indent": 4,
      "text": "::= { pktcSigEndPntConfigEntry 29 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntStatusCallIpAddress OBJECT-TYPE SYNTAX InetAddress MAX-ACCESS read-only STATUS current DESCRIPTION \" This MIB object contains the chosen IP address of the CMS currently being used for the corresponding endpoint.",
      "ja": "PKTCSIGENDPNTSTATATUSCALLIPADDRESSオブジェクトタイプの構文INETADDRESS MAX-ACCESS READ-ONLYステータス現在の説明 \"このMIBオブジェクトには、対応するエンドポイントに現在使用されているCMSの選択したIPアドレスが含まれています。"
    },
    {
      "indent": 9,
      "text": "The device determines the IP address by using DNS to resolve the IP address of the CMS from the FQDN stored in the MIB object 'pktcSigEndPntConfigCallAgentId'. The processes are outlined in the PacketCable NCS and Security specifications, and MUST be followed by the MTA.",
      "ja": "デバイスは、DNSを使用して、MIBオブジェクト「PKTCSIGENDPNTCONFIGCALLAGENTID」に保存されているFQDNからCMSのIPアドレスを解決することにより、IPアドレスを決定します。プロセスは、パケット可能なNCSおよびセキュリティ仕様で概説されており、MTAが続く必要があります。"
    },
    {
      "indent": 0,
      "text": "         The IP address type contained in this MIB object is\n         indicated by pktcSigEndPntStatusCallIpAddressType.\"\n    REFERENCE\n        \"PacketCable NCS Specification;\n         PacketCable Security specification, [PKT-SP-SEC].\"\n::= { pktcSigEndPntConfigEntry 30 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntStatusError  OBJECT-TYPE\n    SYNTAX INTEGER {\n               operational (1),\n               noSecurityAssociation (2),\n               disconnected (3)\n             }\n    MAX-ACCESS   read-only\n    STATUS  current\n    DESCRIPTION\n       \" This object contains the error status for this interface.\n         The operational status indicates that all operations\n         necessary to put the line in service have occurred, and the\n         CMS has acknowledged the Restart In Progress (RSIP)\n         message successfully.  If pktcMtaDevCmsIpsecCtrl is enabled\n         for the associated call agent, the noSecurityAssociation\n         status indicates that no Security Association (SA) yet\n         exists for this endpoint.  If pktcMtaDevCmsIpsecCtrl is\n         disabled for the associated call agent, the\n         noSecurityAssociation status is not applicable and should\n         not be used by the MTA.  The disconnected status indicates\n         one of the following two:\n         If pktcMtaDevCmsIpsecCtrl is disabled, then no security\n         association is involved with this endpoint.  The NCS\n         signaling software is in process of establishing the NCS\n         signaling link via an RSIP exchange.\n         Otherwise, when pktcMtaDevCmsIpsecCtrl is enabled,\n         security Association has been established, and the NCS\n         signaling software is in process of establishing the NCS\n         signaling link via an RSIP exchange.\"\n    ::= { pktcSigEndPntConfigEntry 31 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigMinHookFlash    OBJECT-TYPE\n    SYNTAX       Unsigned32 (20..1550)\n    UNITS        \"Milliseconds\"\n    MAX-ACCESS   read-only\n    STATUS       current\n    DESCRIPTION\n        \" This is the minimum time a line needs to be on-hook for a\n          valid hook flash.  The value of this object MUST be\n          greater than the value of\n          pktcSigEndPntConfigPulseDialMaxBreakTime.  The value of\n          pktcSigEndPntConfigMinHookFlash MUST be less than\n          pktcSigEndPntConfigMaxHookFlash.  This object MUST only be\n          set via the MTA configuration during the provisioning\n          process.\n             Furthermore, given the possibility for the 'pulse dial'\n             and 'hook flash' to overlap, the value of this object\n             MUST be greater than the value contained by the MIB\n             Object 'pktcSigEndPntConfigPulseDialMaxMakeTime'.\"\n    DEFVAL { 300 }\n    ::= { pktcSigEndPntConfigEntry 32 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigMaxHookFlash    OBJECT-TYPE\n    SYNTAX       Unsigned32 (20..1550)\n    UNITS        \"Milliseconds\"\n    MAX-ACCESS   read-only\n    STATUS       current\n    DESCRIPTION\n        \" This is the maximum time a line needs to be on-hook for a\n          valid hook flash.  The value of\n          pktcSigEndPntConfigMaxHookFlash MUST be greater than\n          pktcSigEndPntConfigMinHookFlash.  This object MUST only be\n          set via the MTA configuration during the provisioning\n          process.\"\n    DEFVAL { 800 }\n    ::= { pktcSigEndPntConfigEntry 33 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigPulseDialInterdigitTime    OBJECT-TYPE\n    SYNTAX       Unsigned32 (100..1500)\n    UNITS        \"Milliseconds\"\n    MAX-ACCESS   read-only\n    STATUS       current\n    DESCRIPTION\n        \" This is the pulse dial inter-digit time out.  This object\n          MUST only be set via the MTA configuration during the\n          provisioning process.\"\n    DEFVAL { 100 }\n    ::= { pktcSigEndPntConfigEntry 34 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigPulseDialMinMakeTime    OBJECT-TYPE\n    SYNTAX       Unsigned32 (20..200)\n    UNITS        \"Milliseconds\"\n    MAX-ACCESS   read-only\n    STATUS       current\n    DESCRIPTION\n        \" This is the minimum make pulse width for the dial pulse.\n          The value of pktcSigEndPntConfigPulseDialMinMakeTime MUST\n          be less than pktcSigEndPntConfigPulseDialMaxMakeTime.  This\n          object MUST only be set via the MTA configuration during\n          the provisioning process.\"\n    DEFVAL { 25 }\n    ::= { pktcSigEndPntConfigEntry 35 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigPulseDialMaxMakeTime OBJECT-TYPE SYNTAX Unsigned32 (20..200) UNITS \"Milliseconds\" MAX-ACCESS read-only STATUS current DESCRIPTION \" This is the maximum make pulse width for the dial pulse.",
      "ja": "pktcsigendpntconfigpulsedialmaxmaketime object-type syntax untigned32（20..200）ユニット \"Milliseconds\" max-access読み取り専用ステータス現在の説明 \"これは、ダイヤルパルスの最大測定パルス幅です。"
    },
    {
      "indent": 4,
      "text": "      The value of pktcSigEndPntConfigPulseDialMaxMakeTime MUST\n      be greater than pktcSigEndPntConfigPulseDialMinMakeTime.\n      This object MUST only be provided via the configuration\n      file during the provisioning process.\n      Furthermore, given the possibility for the 'pulse dial'\n      and 'hook flash' to overlap, the value of this object MUST\n      be less than the value contained by the MIB object\n      pktcSigEndPntConfigMinHookFlash.\"\nDEFVAL { 55 }\n::= { pktcSigEndPntConfigEntry 36 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigPulseDialMinBreakTime    OBJECT-TYPE\n    SYNTAX       Unsigned32 (20..200)\n    UNITS        \"Milliseconds\"\n    MAX-ACCESS   read-only\n    STATUS       current\n    DESCRIPTION\n        \" This is the minimum break pulse width for the dial pulse.\n          The value of pktcSigEndPntConfigPulseDialMinBreakTime MUST\n          be less than pktcSigEndPntConfigPulseDialMaxBreakTime.\n          This object must only be provided via the configuration\n          file during the provisioning process.\"\n    DEFVAL { 45 }\n    ::= { pktcSigEndPntConfigEntry 37 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigEndPntConfigPulseDialMaxBreakTime    OBJECT-TYPE\n    SYNTAX       Unsigned32 (20..200)\n    UNITS        \"Milliseconds\"\n    MAX-ACCESS   read-only\n    STATUS       current\n    DESCRIPTION\n        \" This is the maximum break pulse width for the dial pulse.\n          The value of pktcSigEndPntConfigPulseDialMaxBreakTime MUST\n          be greater than pktcSigEndPntConfigPulseDialMinBreakTime.\n          This object MUST only be provided via the configuration\n          file during the provisioning process.\"\n    DEFVAL { 75 }\n    ::= { pktcSigEndPntConfigEntry 38 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "--\n-- notification group is for future extension.\n--\npktcSigNotification  OBJECT IDENTIFIER ::= { pktcIetfSigMib 0 }\npktcSigConformance   OBJECT IDENTIFIER ::= { pktcIetfSigMib 2 }\npktcSigCompliances   OBJECT IDENTIFIER ::= { pktcSigConformance 1 }\npktcSigGroups        OBJECT IDENTIFIER ::= { pktcSigConformance 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "--",
      "ja": " - "
    },
    {
      "indent": 0,
      "text": "-- compliance statements --",
      "ja": " - コンプライアンスステートメント - "
    },
    {
      "indent": 0,
      "text": "pktcSigBasicCompliance MODULE-COMPLIANCE STATUS current DESCRIPTION \" The compliance statement for MTAs that implement NCS signaling.\"",
      "ja": "PKTCSIGBASICComplianceモジュールコンプライアンスステータス現在の説明「NCSシグナリングを実装するMTAのコンプライアンスステートメント。」"
    },
    {
      "indent": 0,
      "text": "MODULE -- pktcIetfSigMib",
      "ja": "モジュール-PKTCIETFSIGMIB"
    },
    {
      "indent": 0,
      "text": "--- -- Unconditionally mandatory groups for all MTAs ---",
      "ja": "----すべてのMTAの無条件に必須のグループ---"
    },
    {
      "indent": 0,
      "text": "MANDATORY-GROUPS {\n    pktcSigDeviceGroup,\n    pktcSigEndpointGroup\n}\n---\n-- Conditionally mandatory groups for MTAs\n---",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "GROUP pktcInternationalGroup DESCRIPTION \" This group is mandatory only for MTAs implementing international telephony features.\"",
      "ja": "グループPKTCINTERNATIONALGROUP説明「このグループは、国際テレフォニー機能を実装するMTAにのみ必須です。」"
    },
    {
      "indent": 0,
      "text": "GROUP pktcLLinePackageGroup DESCRIPTION \" This group is mandatory only for MTAs implementing the L line package.\"",
      "ja": "グループPKTCLLINEPACKAGEGROUP説明「このグループは、L Lineパッケージを実装するMTAにのみ必須です。」"
    },
    {
      "indent": 0,
      "text": "GROUP pktcELinePackageGroup DESCRIPTION \" This group is mandatory only for MTAs implementing the E Line Package.\" ::={ pktcSigCompliances 1 }",
      "ja": "グループPKTCELINEPACKAGEGROUP説明「このグループは、Eラインパッケージを実装するMTAにのみ必須です。」:: = {pktcsigcompliances 1}"
    },
    {
      "indent": 0,
      "text": "pktcSigDeviceGroup  OBJECT-GROUP\n    OBJECTS {\n    pktcSigDevCodecMax,\n    pktcSigDevEchoCancellation,\n    pktcSigDevSilenceSuppression,\n    pktcSigDevR0Cadence,\n    pktcSigDevR1Cadence,\n    pktcSigDevR2Cadence,\n    pktcSigDevR3Cadence,\n    pktcSigDevR4Cadence,\n    pktcSigDevR5Cadence,\n    pktcSigDevR6Cadence,\n    pktcSigDevR7Cadence,\n    pktcSigDevRgCadence,\n    pktcSigDevRsCadence,\n    pktcSigDefCallSigDscp,\n    pktcSigDefMediaStreamDscp,\n    pktcSigDevVmwiMode,\n    pktcSigCapabilityType,\n    pktcSigCapabilityVersion,\n    pktcSigCapabilityVendorExt,\n    pktcSigDefNcsReceiveUdpPort\n    }\n    STATUS current\n    DESCRIPTION\n          \"Group of MIB objects containing signaling configuration\n           information that is applicable per-device.\"\n    ::= { pktcSigGroups 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcSigEndpointGroup  OBJECT-GROUP\n    OBJECTS {\n    pktcSigEndPntConfigCallAgentId,\n    pktcSigEndPntConfigCallAgentUdpPort,\n    pktcSigEndPntConfigPartialDialTO,\n    pktcSigEndPntConfigCriticalDialTO,\n    pktcSigEndPntConfigBusyToneTO,\n    pktcSigEndPntConfigDialToneTO,\n    pktcSigEndPntConfigMessageWaitingTO,\n    pktcSigEndPntConfigOffHookWarnToneTO,\n    pktcSigEndPntConfigRingingTO,\n    pktcSigEndPntConfigRingBackTO,\n    pktcSigEndPntConfigReorderToneTO,\n    pktcSigEndPntConfigStutterDialToneTO,\n    pktcSigEndPntConfigTSMax,\n    pktcSigEndPntConfigMax1,\n    pktcSigEndPntConfigMax2,\n    pktcSigEndPntConfigMax1QEnable,\n    pktcSigEndPntConfigMax2QEnable,\n    pktcSigEndPntConfigMWD,\n    pktcSigEndPntConfigTdinit,\n    pktcSigEndPntConfigTdmin,\n    pktcSigEndPntConfigTdmax,\n    pktcSigEndPntConfigRtoMax,\n    pktcSigEndPntConfigRtoInit,\n    pktcSigEndPntConfigLongDurationKeepAlive,\n    pktcSigEndPntConfigThist,\n    pktcSigEndPntConfigStatus,\n    pktcSigEndPntConfigCallWaitingMaxRep,\n    pktcSigEndPntConfigCallWaitingDelay,\n    pktcSigEndPntStatusCallIpAddressType,\n    pktcSigEndPntStatusCallIpAddress,\n    pktcSigEndPntStatusError\n    }\n    STATUS current\n    DESCRIPTION\n          \"Group of MIB objects containing signaling configuration\n           information that is applicable per-endpoint.\"\n    ::= { pktcSigGroups 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcInternationalGroup    OBJECT-GROUP\n    OBJECTS {\n    pktcSigEndPntConfigMinHookFlash,\n    pktcSigEndPntConfigMaxHookFlash,\n    pktcSigEndPntConfigPulseDialInterdigitTime,\n    pktcSigEndPntConfigPulseDialMinMakeTime,\n    pktcSigEndPntConfigPulseDialMaxMakeTime,\n    pktcSigEndPntConfigPulseDialMinBreakTime,\n    pktcSigEndPntConfigPulseDialMaxBreakTime,\n    pktcSigDevRingCadence,\n    pktcSigDevCidSigProtocol,\n    pktcSigDevCidDelayAfterLR,\n    pktcSigDevCidDtmfStartCode,\n    pktcSigDevCidDtmfEndCode,\n    pktcSigDevVmwiSigProtocol,\n    pktcSigDevVmwiDelayAfterLR,\n    pktcSigDevVmwiDtmfStartCode,\n    pktcSigDevVmwiDtmfEndCode,\n    pktcSigDevrpAsDtsDuration,\n    pktcSigDevCidMode,\n    pktcSigDevCidAfterRing,\n    pktcSigDevCidAfterDTAS,\n    pktcSigDevCidAfterRPAS,\n    pktcSigDevRingAfterCID,\n    pktcSigDevCidDTASAfterLR,\n    pktcSigDevVmwiMode,\n    pktcSigDevVmwiAfterDTAS,\n    pktcSigDevVmwiAfterRPAS,\n    pktcSigDevVmwiDTASAfterLR,\n    pktcSigPowerRingFrequency,\n    pktcSigPulseSignalFrequency,\n    pktcSigPulseSignalDbLevel,\n    pktcSigPulseSignalDuration,\n    pktcSigPulseSignalPulseInterval,\n    pktcSigPulseSignalRepeatCount,\n    pktcSigDevToneDbLevel,\n    pktcSigDevToneFreqCounter,\n    pktcSigDevToneWholeToneRepeatCount,\n    pktcSigDevToneSteady,\n    pktcSigDevToneFirstFreqValue,\n    pktcSigDevToneSecondFreqValue,\n    pktcSigDevToneThirdFreqValue,\n    pktcSigDevToneFourthFreqValue,\n    pktcSigDevToneFreqMode,\n    pktcSigDevToneFreqAmpModePrtg,\n    pktcSigDevToneFreqOnDuration,\n    pktcSigDevToneFreqOffDuration,\n    pktcSigDevToneFreqRepeatCount\n    }\n    STATUS current\n    DESCRIPTION\n        \" Group of objects that extend the behavior of existing\n          objects to support operations in the widest possible set\n          of international marketplaces.  Note that many of these\n          objects represent a superset of behaviors described in\n          other objects within this MIB module.\"\n    ::= { pktcSigGroups 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcLLinePackageGroup  OBJECT-GROUP\n    OBJECTS {\n    pktcSigDevR0Cadence,\n    pktcSigDevR1Cadence,\n    pktcSigDevR2Cadence,\n    pktcSigDevR3Cadence,\n    pktcSigDevR4Cadence,\n    pktcSigDevR5Cadence,\n    pktcSigDevR6Cadence,\n    pktcSigDevR7Cadence,\n    pktcSigDevRgCadence,\n    pktcSigDevRsCadence\n    }\n    STATUS current\n    DESCRIPTION\n    \"Group of Objects to support the L line package.\"\n    ::= { pktcSigGroups 4 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "pktcELinePackageGroup  OBJECT-GROUP\n    OBJECTS {\n    pktcSigDevR0Cadence,\n    pktcSigDevR1Cadence,\n    pktcSigDevR2Cadence,\n    pktcSigDevR3Cadence,\n    pktcSigDevR4Cadence,\n    pktcSigDevR5Cadence,\n    pktcSigDevR6Cadence,\n    pktcSigDevR7Cadence,\n    pktcSigDevRgCadence,\n    pktcSigDevRsCadence,\n    pktcSigPulseSignalFrequency,\n    pktcSigPulseSignalDbLevel,\n    pktcSigPulseSignalDuration,\n    pktcSigPulseSignalPulseInterval,\n    pktcSigPulseSignalRepeatCount,\n    pktcSigDevRingCadence\n    }\n    STATUS current\n    DESCRIPTION\n        \"Group of Objects to support the E line package.\"\n    ::= { pktcSigGroups 5 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "END",
      "ja": "終わり"
    },
    {
      "indent": 0,
      "text": "6. Examples",
      "section_title": true,
      "ja": "6. 例"
    },
    {
      "indent": 3,
      "text": "This section provides a couple of examples, specifically related to the MIB tables pktcSigDevToneTable and pktcSigDevMultiFreqToneTable.",
      "ja": "このセクションには、特にMIBテーブルpktcsigdevtonetableおよびpktcsigdevmultifreqtonetableに関連するいくつかの例を示します。"
    },
    {
      "indent": 3,
      "text": "Example A: Call Waiting Tone Defined per [ITU-T E.180]:",
      "ja": "例A：[ITU-T e.180]ごとに定義されたコール待機トーン："
    },
    {
      "indent": 3,
      "text": "1) 400 Hz AM modulated by 16 Hz, on for 500ms at -4 dBm 2) 400 Hz AM modulated by 16 Hz, off for 400ms 3) 400 Hz not AM modulated, on for 50 ms at -4 dBm 4) 400 Hz not AM modulated, off for 450 ms 5) 400 Hz not AM modulated, on for 50 ms at -4 dBm 6) 400 Hz not AM modulated, off for 3450 ms 7) 400 Hz not AM modulated, on for 50 ms at -4 dBm 8) 400 Hz not AM modulated, off for 450 ms 9) 400 Hz not AM modulated, on for 50 ms at -4 dBm 10) 400 Hz not AM modulated, off for 3450 ms 11) not repeated, not continuous Assume userDefined1(18) is assigned to this tone:",
      "ja": "1) 400 Hz AMは16 Hzで変調され、-4 dBMで500ms、2）400 Hz AM 16 Hzで変調し、400msでオフ3）400 HzはAM変調されていません。変調、450ミリ秒のためにオフ5）400 Hz AM変調、-4 dBMで50ミリ秒でオンにon -4 dBm 6）400 HzはAM変調ではなく、3450ミリ秒でオフ7）400 Hz AM変調8）400 Hz AM変調、450ミリ秒でオフ）400 Hzは-4 dBMで50ミリ秒で変調されていません10）400 HzはAM変調されていません、3450ミリ秒11）18）このトーンに割り当てられます。"
    },
    {
      "indent": 3,
      "text": "pktcSigDevMultiFreqToneTable:\nToneType|F-1|F-2|F-3|F-4|F-Mode|ModePrtg|DbL|OnDur|OffDur|Rep-Count\n===================================================================\n18       400  16  0   0     1     90     -40  500   400      0\n18       400   0  0   0     2      0     -40   50   450      0\n18       400   0  0   0     2      0     -40   50  3450      0\n18       400   0  0   0     2      0     -40   50   450      0\n18       400   0  0   0     2      0     -40   50  3450      0",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pktcSigDevToneTable:\nToneType|ToneFreqGroup|ToneFreqCounter|ToneRep-Count|Steady\n=============================================================\n18          1             5              0       false(2)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The single row of the pktcSigDevToneTable defines one multi-frequency group of five rows (ToneFreqCounter) defined in the pktcSigDevMultiFreqToneTable and instructs the MTA to play this group only once (non-repeatable as ToneRep-Count equals 0).",
      "ja": "pktcsigdevtonetableの単一行は、pktcsigdevmultifreqtonetableで定義された5行（tonefreqcounter）の1つの多頻度グループ（tonefreqcounter）を定義し、MTAにこのグループを1回だけプレイするように指示します（tonerep-count equals 0として繰り返し可能）。"
    },
    {
      "indent": 3,
      "text": "Example B - Congestion Tone - congestion(17):",
      "ja": "例B-混雑のトーン - 混雑（17）："
    },
    {
      "indent": 3,
      "text": "Note: This example of an embedded cadence is based on an operator variation.",
      "ja": "注：埋め込まれたケイデンスのこの例は、オペレーターのバリエーションに基づいています。"
    },
    {
      "indent": 3,
      "text": "1) 400Hz on for 400ms -10 dBm",
      "ja": "1) 400ms -10 dBmで400Hz"
    },
    {
      "indent": 3,
      "text": "2) 400Hz off for 350ms",
      "ja": "2) 350msで400Hzオフ"
    },
    {
      "indent": 3,
      "text": "3) 400Hz on for 225ms -4 dBm",
      "ja": "3) 225ms -4 dBmで400Hz"
    },
    {
      "indent": 3,
      "text": "4) 400Hz off for 525ms",
      "ja": "4) 525msで400Hzオフ"
    },
    {
      "indent": 3,
      "text": "5) repeat (1) through (4) 5000 times or T0 time out (whichever is the shortest period)",
      "ja": "5) （1）〜（4）5000回またはT0タイムアウトを繰り返します（最短期間のいずれでも）"
    },
    {
      "indent": 3,
      "text": "pktcSigDevMultiFreqToneTable:\nToneType|F-1|F-2|F-3|F-4|F-Mode|ModePrtg|DbL|OnDur|OffDur|Rep-Count\n===================================================================\n17       400  0   0   0    2       0    -100  400   350      0\n17       400  0   0   0    2       0     -40  225   525      0",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pktcSigDevToneTable:\nToneType|ToneFreqGroup|ToneFreqCounter|ToneRep-Count|Steady\n=============================================================\n17          1             2              5000        false(2)\n   Example C - Call Waiting Tone - callWaiting1(9):",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "1) 16 Hz is modulated to carry the 400 Hz signal, ModulationRate within 85%, on for 500msec, at -25 dBm or more but less than -14 dBm",
      "ja": "1) 16 Hzは、500msecで85％以内、-25 dBM以上で、400 Hz信号を搭載し、-14 dBm未満で変調するように変調されています。"
    },
    {
      "indent": 3,
      "text": "2) 16 Hz is modulated to carry the 400 Hz signal, off for 0 ~ 4 secs",
      "ja": "2) 16 Hzは、400 Hz信号を0〜4秒間オフにするように変調されています"
    },
    {
      "indent": 3,
      "text": "3) 400 Hz not modulated, on for 50 ms at -25 dBm or more but less than -14 dBm",
      "ja": "3) 400 Hzは、-25 dBm以上で50ミリ秒で変調されていませんが、-14 dBm未満"
    },
    {
      "indent": 3,
      "text": "4) 400 Hz not modulated, off for 450ms",
      "ja": "4) 400 Hzは変調されておらず、450msでオフ"
    },
    {
      "indent": 3,
      "text": "5) 400 Hz not modulated, on for 50 ms at -25 dBm or more but less than -14 dBm",
      "ja": "5) 400 Hzは、-25 dBm以上で50ミリ秒で変調されていませんが、-14 dBm未満"
    },
    {
      "indent": 3,
      "text": "6) 400 Hz not modulated, off for 3450ms ([4000 - (50+450+50)])",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "7) Steps 3 thru 6 are repeated",
      "ja": "7) 手順3から6が繰り返されます"
    },
    {
      "indent": 3,
      "text": "pktcSigDevMultiFreqToneTable:\nToneType|F-1|F-2|F-3|F-4|F-Mode|ModePrtg|DbL|OnDur|OffDur|Rep-Count\n===================================================================\n9        1   400 16  0   0     1     85     -25  500  1000      0\n9        2   400  0  0   0     2      0     -25   50   450      0\n9        3   400  0  0   0     2      0     -25   50  3450      0",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pktcSigDevToneTable:\nToneType|ToneFreqGroup|ToneFreqCounter|ToneRep-Count|Steady\n=============================================================\n9           1             1              0       false(2)\n9           2             2              1       false(2)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The first row of the pktcSigDevToneTable table instructs the MTA to play one row (ToneFreqCounter) of the pktcSigDevMultiFreqToneTable table only once (non-repeatable as ToneRep-Count equals 0). The second row of the pktcSigDevToneTable table instructs the MTA to play the next two rows (ToneFreqCounter) of the pktcSigDevMultiFreqToneTable table and make this frequency group repeatable (ToneRep-Count is not 0).",
      "ja": "pktcsigdevtonetableテーブルの最初の行は、MTAに、pktcsigdevmultifreqtonetableテーブルの1列（tonefreqcounter）を1回だけ再生するように指示します（tonerep-countが0に等しいため、反復性はありません）。PKTCSIGDEVTONETABLEテーブルの2行目は、MTAにPKTCSIGDEVMULTIFREQTONETABLEテーブルの次の2行（TONEFREQCOUNTER）を再生し、この周波数グループを再現可能にするように指示します（Tonerep-Countは0ではありません）。"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgments",
      "section_title": true,
      "ja": "7. 謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank the members of the IETF IPCDN working group and the CableLabs PacketCable Provisioning focus team for their contributions, comments, and suggestions.",
      "ja": "著者は、IETF IPCDNワーキンググループのメンバーとCableLabs PacketCable Provisioningフォーカスチームの貢献、コメント、提案に感謝したいと思います。"
    },
    {
      "indent": 3,
      "text": "Specifically, the following individuals are recognized:",
      "ja": "具体的には、次の個人が認識されています。"
    },
    {
      "indent": 7,
      "text": "Angela Lyda            Arris Interactive\nRomascanu, Dan         Avaya\nChad Griffiths         Broadcom Corp.\nEugene Nechamkin       Broadcom Corp.\nJean-Francois Mule     CableLabs\nMatt A. Osman          CableLabs\nKlaus Hermanns         Cisco Systems, Inc.\nRich Woundy            Comcast Corp.\nBert Wijnen            Alcatel-Lucent\nRandy Presuhn          Mindspring\nPhillip Freyman        Motorola, Inc.\nRick Vetter            Motorola, Inc.\nSasha Medvinsky        Motorola, Inc.\nWim De Ketelaere       tComLabs\nDavid De Reu           tComLabs\nKristof Sercu          tComLabs\nRoy Spitzer            Telogy Networks, Inc.\nItay Sherman           Texas Instruments, Inc.\nMauricio Sanchez       Texas Instruments, Inc.\nShivakumar Thangapandi Texas Instruments, Inc.\nMike Heard             Consultant",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The current editor (Sumanth Channabasappa) would like to recognize Phillip Freyman and Eugene Nechamkin for their contributions towards the international objects, and Stephane Bortzmeyer for assistance with the ABNF.",
      "ja": "現在の編集者（Sumanth Channabasappa）は、Phillip FreymanとEugene Nechamkinが国際的なオブジェクトへの貢献について、およびABNFの支援についてStephane Bortzmeyerを認識したいと考えています。"
    },
    {
      "indent": 3,
      "text": "The editor also extends appreciation to the IPCDN co-chairs (Jean-Francois Mule, Rich Woundy) and Dan Romascanu for the numerous reviews and valuable comments. Special appreciation is extended to Bert Wijnen, as the MIB doctor, for his ever-useful and constructive comments.",
      "ja": "編集者はまた、多数のレビューと貴重なコメントについて、IPCDNの共同議長（Jean-Francois Mule、Rich Wundy）とDan Romascanuに感謝します。MIBの医師として、彼の絶え間ない建設的なコメントのために、MIBの医師としてのBert Wijnenに特別な評価が拡大されています。"
    },
    {
      "indent": 0,
      "text": "8. Security Considerations",
      "section_title": true,
      "ja": "8. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "There are a number of management objects defined in this MIB module with a MAX-ACCESS clause of read-write and/or read-create. Such objects may be considered sensitive or vulnerable in some network environments. The support for SET operations in a non-secure environment without proper protection can have a negative effect on network operations.",
      "ja": "このMIBモジュールには、読み取りワイトおよび/またはread-Createの最大アクセス句を備えた管理オブジェクトが多数あります。このようなオブジェクトは、一部のネットワーク環境で敏感または脆弱と見なされる場合があります。適切な保護なしの非セキュア環境でのセット操作のサポートは、ネットワーク操作に悪影響を与える可能性があります。"
    },
    {
      "indent": 3,
      "text": "The following Differentiated Services Code Point (DSCP) and mask objects are used to differentiate between various types of traffic in the service provider network:",
      "ja": "次の差別化されたサービスコードポイント（DSCP）とマスクオブジェクトは、サービスプロバイダーネットワークのさまざまなタイプのトラフィックを区別するために使用されます。"
    },
    {
      "indent": 8,
      "text": "pktcSigDefCallSigDscp pktcSigDefMediaStreamDscp",
      "ja": "PKTCSIGDEFCALLSIGDSCP PKTCSIGDEFMEDIASTREAMDSCP"
    },
    {
      "indent": 3,
      "text": "These objects may contain information that may be sensitive from a business perspective. For example, they may represent a customer's service contract that a service provider chooses to apply to a customer's ingress or egress traffic. If these objects are SET maliciously, it may permit unmarked or inappropriately marked signaling and media traffic to enter the service provider network, resulting in unauthorized levels of service for customers.",
      "ja": "これらのオブジェクトには、ビジネスの観点から敏感な情報が含まれている場合があります。たとえば、サービスプロバイダーが顧客の侵入または出力トラフィックに適用することを選択した顧客のサービス契約を表す場合があります。これらのオブジェクトが悪意を持って設定されている場合、マークされていないまたは不適切にマークされたシグナリングとメディアトラフィックがサービスプロバイダーネットワークに入ることを可能にする可能性があり、その結果、顧客向けの不正レベルのサービスが得られます。"
    },
    {
      "indent": 3,
      "text": "The following objects determine ring cadence, repeatable characteristics, signal duration, and caller id subscriber line protocol for telephony operation:",
      "ja": "次のオブジェクトは、リングケイデンス、繰り返し可能な特性、信号期間、およびテレフォニー操作用の発信者IDサブスクライバーラインプロトコルを決定します。"
    },
    {
      "indent": 8,
      "text": "pktcSigDevR0Cadence pktcSigDevR1Cadence pktcSigDevR2Cadence pktcSigDevR3Cadence pktcSigDevR4Cadence pktcSigDevR5Cadence pktcSigDevR6Cadence pktcSigDevR7Cadence pktcSigDevRgCadence pktcSigDevRsCadence pktcSigDevCidSigProtocol pktcSigDevVmwiSigProtocol pktcSigPulseSignalDuration pktcSigPulseSignalPauseDuration",
      "ja": "PKTCSIGDEVR0CADENCE PKTCSIGDEVR1CADENCE PKTCSIGDEVR2CADENCE PKTCSIGDEVR3CADENCE PKTCSIGDEVR4CADENCE PKTCSIGDEVR5CADENCE PKTCSIGDEVR6CSIGDEVR5CADENCE PKTCSIGDEVR6CADENCE PKTCCSGCSCCSCCSCCDENCE devrscadence pktcsigdevcidsigprotocol pktcsigdevvmwisigprotocol pktcsigpulsesignulduration pktcsigpulsesignalpauseuration"
    },
    {
      "indent": 3,
      "text": "If these objects are SET maliciously, it may result in unwanted operation, or a failure to obtain telephony service from client (MTA) devices.",
      "ja": "これらのオブジェクトが悪意を持って設定されている場合、不要な操作、またはクライアント（MTA）デバイスからテレフォニーサービスの取得に失敗する可能性があります。"
    },
    {
      "indent": 3,
      "text": "The objects in the pktcSigEndPntConfigTable are used for endpoint signaling. The pktcSigEndPntConfigCallAgentId object contains the name of the call agent, which includes the call agent Fully Qualified Domain Name (FQDN). If this object is SET maliciously, the MTA will not be able to communicate with the call agent, resulting in a disruption of telephony service. The pktcSigEndPntConfigCallAgentUdpPort object identifies the UDP port for NCS traffic. If this object is SET maliciously, the call agent will not receive NCS traffic from the MTA, also resulting in a disruption of telephony service.",
      "ja": "PKTCSIGENDPNTCONFIGTABLEのオブジェクトは、エンドポイントシグナル伝達に使用されます。PKTCSIGENDPNTCONFIGCALLAGENTIDオブジェクトには、コールエージェントが含まれるコールエージェントの名前が含まれています。このオブジェクトが悪意を持って設定されている場合、MTAはコールエージェントと通信できず、テレフォニーサービスが混乱します。PKTCSIGENDPNTCONFIGCALLAGENTUDPPORTオブジェクトは、NCSトラフィックのUDPポートを識別します。このオブジェクトが悪意を持って設定されている場合、コールエージェントはMTAからNCSトラフィックを受け取らず、テレフォニーサービスの混乱も発生します。"
    },
    {
      "indent": 3,
      "text": "Some of the readable objects in this MIB module (i.e., objects with a MAX-ACCESS other than not-accessible) may be considered sensitive or vulnerable in some network environments. It is thus important to control even GET and/or NOTIFY access to these objects and possibly to even encrypt the values of these objects when sending them over the network via SNMP. The most sensitive is pktcSigEndPntStatusCallIpAddress within pktcSigEndPntConfigTable. This information itself may be valuable to would-be attackers. Other MIB Objects of similar sensitivity include pktcSigEndPntStatusError, which can provide useful information to MTA impersonators, and pktcSigDevCodecMax, which can provide useful information for planning Denial of Service (DoS) attacks on MTAs.",
      "ja": "このMIBモジュールの読み取り可能なオブジェクトのいくつか（つまり、アクセスできないこと以外に最大アクセスを備えたオブジェクト）は、一部のネットワーク環境で敏感または脆弱と見なされる場合があります。したがって、これらのオブジェクトへのアクセスを取得および/または通知することさえ制御し、SNMPを介してネットワーク上に送信するときにこれらのオブジェクトの値を暗号化することも重要です。最も敏感なのは、pktcsigendpntconfigtable内のpktcsigendpntstatuscallipaddressです。この情報自体は、攻撃者になるにとって価値があるかもしれません。同様の感度の他のMIBオブジェクトには、MTAのなりすまし者に有用な情報を提供できるPKTCSIGENDPNTSTATATUSERRORと、PKTCSIGDEVCODECMAXが含まれます。"
    },
    {
      "indent": 3,
      "text": "SNMP versions prior to SNMPv3 did not include adequate security. Even if the network itself is secure (for example by using IPsec), even then, there is no control as to who on the secure network is allowed to access and GET/SET (read/change/create/delete) the objects in this MIB module.",
      "ja": "SNMPV3以前のSNMPバージョンには、適切なセキュリティは含まれていませんでした。ネットワーク自体が（たとえばIPSECを使用して）安全である場合でも、それでもセキュアネットワーク上の誰がアクセス/セット/セット（読み取り/変更/作成/削除/削除）を制御することはできません。MIBモジュール。"
    },
    {
      "indent": 3,
      "text": "It is RECOMMENDED that implementers consider the security features as provided by the SNMPv3 framework (see [RFC3410], section 8), including full support for the SNMPv3 cryptographic mechanisms (for authentication and privacy).",
      "ja": "実装者は、SNMPV3暗号化メカニズム（認証とプライバシー用）の完全なサポートを含む、SNMPV3フレームワーク（[RFC3410]、セクション8を参照）で提供されるセキュリティ機能を考慮することをお勧めします。"
    },
    {
      "indent": 3,
      "text": "Further, deployment of SNMP versions prior to SNMPv3 is NOT RECOMMENDED. Instead, it is RECOMMENDED to deploy SNMPv3 and to enable cryptographic security. It is then a customer/operator responsibility to ensure that the SNMP entity giving access to an instance of this MIB module is properly configured to give access to the objects only to those principals (users) that have legitimate rights to indeed GET or SET (change/create/delete) them.",
      "ja": "さらに、SNMPV3より前のSNMPバージョンの展開は推奨されません。代わりに、SNMPV3を展開し、暗号化セキュリティを有効にすることをお勧めします。その場合、このMIBモジュールのインスタンスへのアクセスを提供するSNMPエンティティが、実際に取得または設定する正当な権利を持つプリンシパル（ユーザー）にのみオブジェクトにアクセスできるように適切に構成されていることを保証するのは、顧客/オペレーターの責任です（変更を変更します（変更）/作成/削除）それら。"
    },
    {
      "indent": 0,
      "text": "9. IANA Considerations",
      "section_title": true,
      "ja": "9. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "The MIB module in this document uses the following IANA-assigned OBJECT IDENTIFIER value recorded in the SMI Numbers registry:",
      "ja": "このドキュメントのMIBモジュールは、SMI番号レジストリに記録された次のIANAによって割り当てられたオブジェクト識別子値を使用します。"
    },
    {
      "indent": 3,
      "text": "Descriptor     OBJECT IDENTIFIER Value\n----------     -----------------------\npktcIetfSigMib     { mib-2 169 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "10. References",
      "section_title": true,
      "ja": "10. 参考文献"
    },
    {
      "indent": 0,
      "text": "10.1. Normative References",
      "section_title": true,
      "ja": "10.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[PKT-SP-MIB-SIG-1.0] PacketCable(TM) 1.0 Signaling MIB Specification, Issued, PKT-SP-MIB-SIG-I09-050812, August 2005. http://www.packetcable.com/specifications/ http://www.cablelabs.com/specifications/archives",
      "ja": "[PKT-SP-MIB-SIG-1.0] PacketCable（TM）1.0シグナル伝達MIB仕様、発行、PKT-SP-MIB-SIG-I09-050812、2005年8月：//www.cablelabs.com/specifications/archives"
    },
    {
      "indent": 3,
      "text": "[PKT-SP-MIB-SIG-1.5] PacketCable(TM) 1.5 Signaling MIB Specification, Issued, PKT-SP-MIB-SIG1.5-I01-050128, January 2005. http://www.packetcable.com/specifications/ http://www.cablelabs.com/specifications/archives",
      "ja": "[PKT-SP-MIB-SIG-1.5] PacketCable（TM）1.5シグナル伝達MIB仕様、発行、PKT-SP-MIB-SIG1.5-I01-050128、2005年1月/http://www.cablelabs.com/specifications/archives"
    },
    {
      "indent": 3,
      "text": "[PKT-SP-SEC] PacketCable Security Specification, Issued, PKT-SP-SEC-I12-050812, August 2005. http://www.packetcable.com/specifications/ http://www.cablelabs.com/specifications/archives",
      "ja": "[PKT-SP-SEC] PacketCableセキュリティ仕様、発行、PKT-SP-SEC-I12-050812、2005年8月。http：//www.packetcable.com/spifications/ http://www.cablelabs.com/specifications/アーカイブ"
    },
    {
      "indent": 3,
      "text": "[ITU-T-J169] IPCablecom Network Call Signaling (NCS) MIB requirements, J.169, ITU-T, March, 2001.",
      "ja": "[ITU-T-J169] IPCABLECOMネットワークコールシグナル伝達（NCS）MIB要件、J.169、ITU-T、2001年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119] Bradner、S。、「要件レベルを示すためにRFCで使用するためのキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2578] McCloghrie, K., Perkins, D., and J. Schoenwaelder, \"Structure of Management Information Version 2 (SMIv2)\", STD 58, RFC 2578, April 1999.",
      "ja": "[RFC2578] McCloghrie、K.、Perkins、D。、およびJ. Schoenwaelder、「管理情報の構造バージョン2（SMIV2）」、STD 58、RFC 2578、1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2579] McCloghrie, K., Perkins, D., and J. Schoenwaelder, \"Textual Conventions for SMIv2\", STD 58, RFC 2579, April 1999.",
      "ja": "[RFC2579] McCloghrie、K.、Perkins、D。、およびJ. Schoenwaelder、「SMIV2のテキストコンベンション」、STD 58、RFC 2579、1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2580] McCloghrie, K., Perkins, D., and J. Schoenwaelder, \"Conformance Statements for SMIv2\", STD 58, RFC 2580, April 1999.",
      "ja": "[RFC2580] McCloghrie、K.、Perkins、D。、およびJ. Schoenwaelder、「SMIV2の適合ステートメント」、STD 58、RFC 2580、1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC3289] Baker, F., Chan, K., and A. Smith, \"Management Information Base for the Differentiated Services Architecture\", RFC 3289, May 2002.",
      "ja": "[RFC3289] Baker、F.、Chan、K。、およびA. Smith、「差別化されたサービスアーキテクチャの管理情報ベース」、RFC 3289、2002年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC4001] Daniele, M., Haberman, B., Routhier, S., and J. Schoenwaelder, \"Textual Conventions for Internet Network Addresses\", RFC 4001, February 2005.",
      "ja": "[RFC4001] Daniele、M.、Haberman、B.、Routhier、S。、およびJ. Schoenwaelder、「インターネットネットワークアドレスのテキストコンベンション」、RFC 4001、2005年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC3411] Harrington, D., Presuhn, R., and B. Wijnen, \"An Architecture for Describing Simple Network Management Protocol (SNMP) Management Frameworks\", STD 62, RFC 3411, December 2002.",
      "ja": "[RFC3411] Harrington、D.、Presuhn、R。、およびB. Wijnen、「単純なネットワーク管理プロトコル（SNMP）管理フレームワークを説明するためのアーキテクチャ」、STD 62、RFC 3411、2002年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC2863] McCloghrie, K. and F. Kastenholz, \"The Interfaces Group MIB\", RFC 2863, June 2000.",
      "ja": "[RFC2863] McCloghrie、K。およびF. Kastenholz、「The Interfaces Group MIB」、RFC 2863、2000年6月。"
    },
    {
      "indent": 3,
      "text": "[PKT-SP-CODEC] PacketCable Audio/Video Codecs Specification PKT-SP-CODEC-IO5-040113.",
      "ja": "[PKT-SP-CODEC] PacketCable Audio/Video Codecs仕様PKT-SP-CODEC-IO5-040113。"
    },
    {
      "indent": 3,
      "text": "[PKT-SP-MGCP] PacketCable Network-Based Call Signaling Protocol Specification PKT-SP-EC-MGCP-I10-040402.",
      "ja": "[PKT-SP-MGCP] PacketCable Networkベースのコールシグナル伝達プロトコル仕様PKT-SP-MGCP-I10-040402。"
    },
    {
      "indent": 3,
      "text": "[PKT-SP-PROV] PacketCable MTA Device Provisioning Specification PKT-SP-PROV-I10-040730.",
      "ja": "[PKT-SP-Prov] PacketCable MTAデバイスプロビジョニング仕様PKT-SP-PROV-I10-040730。"
    },
    {
      "indent": 0,
      "text": "10.2. Informative References",
      "section_title": true,
      "ja": "10.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[RFC3410] Case, J., Mundy, R., Partain, D., and B. Stewart, \"Introduction and Applicability Statements for Internet-Standard Management Framework\", RFC 3410, December 2002.",
      "ja": "[RFC3410] Case、J.、Mundy、R.、Partain、D。、およびB. Stewart、「インターネット標準管理フレームワークの紹介と適用声明」、RFC 3410、2002年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC3435] Andreasen, F. and B. Foster, \"Media Gateway Control Protocol (MGCP) Version 1.0\", RFC 3435, January 2003.",
      "ja": "[RFC3435] Andreasen、F。およびB. Foster、「Media Gateway Control Protocol（MGCP）バージョン1.0」、RFC 3435、2003年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC5234] Crocker, D., Ed., and P. Overell, \"Augmented BNF for Syntax Specifications: ABNF\", STD 68, RFC 5234, January 2008.",
      "ja": "[RFC5234] Crocker、D.、ed。、およびP. Overell、「構文仕様のためのBNFの増強」、STD 68、RFC 5234、2008年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC4682] Nechamkin, E. and J-F. Mule, \"Multimedia Terminal Adapter (MTA) Management Information Base for PacketCable- and IPCablecom-Compliant Devices\", RFC 4682, December 2006.",
      "ja": "[RFC4682] Nechamkin、E。およびJ-F。Mule、「PacketcableおよびIpcablecomに準拠したデバイスのマルチメディアターミナルアダプター（MTA）管理情報ベース」、RFC 4682、2006年12月。"
    },
    {
      "indent": 3,
      "text": "[ETSI-TS-101-909-4] ETSI TS 101 909-4:\"Access and Terminals (AT); Digital Broadband Cable Access to the Public Telecommunications Network; IP Multimedia Time Critical Services; Part 4: Network Call Signaling Protocol\".",
      "ja": "[ETSI-TS-101-909-4] ETSI TS 101 909-4：「アクセスとターミナル（AT）;パブリックテレコミュニケーションネットワークへのデジタルブロードバンドケーブルアクセス; IPマルチメディアタイムクリティカルサービス;パート4：ネットワークコールシグナル伝達プロトコル」。"
    },
    {
      "indent": 3,
      "text": "[ETSI-TS-101-909-9] ETSI TS 101 909-9:\"Access and Terminals (AT); Digital Broadband Cable Access to the Public Telecommunications Network; IP Multimedia Time Critical Services; Part 9: IPCablecom Network Call Signalling (NCS) MIB Requirements\".",
      "ja": "[ETSI-TS-101-909-9] ETSI TS 101 909-9：「アクセスと端末（AT）;パブリックテレコミュニケーションネットワークへのデジタルブロードバンドケーブルアクセス; IPマルチメディアタイムクリティカルサービス;パート9：IPCCABLECOMネットワークコールシグナリング（NCS）MIB要件」。"
    },
    {
      "indent": 3,
      "text": "[ETSI-EN-300-001] ETSI EN 300-001 V1.5.1 (1998-10):\"European Standard (Telecommunications series) Attachments to Public Switched Telephone Network (PSTN); General technical requirements for equipment connected to an analogue subscriber interface in the PSTN; Chapter 3: Ringing signal characteristics (national deviations are in Table 3.1.1)\".",
      "ja": "[ETSI-EN-300-001] ETSI EN 300-001 V1.5.1（1998-10）：「European Standard（Telecommunications Series）Attachments to Public Switched Telephone Network（PSTN）;アナログサブスクライバーに接続された機器の一般的な技術要件PSTNのインターフェース;第3章：リンギング信号特性（国家逸脱は表3.1.1にあります）」。"
    },
    {
      "indent": 3,
      "text": "[ETSI-EN-300-324-1] ETSI EN 300 324-1 V2.1.1 (2000-04):\"V Interfaces at the digital Loop Exchange (LE); V5.1 interface for the support of Access Network (AN); Part 1: V5.1 interface specification\".",
      "ja": "[ETSI-EN-300-324-1] ETSI EN 300 324-1 V2.1.1（2000-04）： \"V Interfaces at the Digital Loop Exchange（LE）; V5.1インターフェイスアクセスネットワークのサポート（）;パート1：v5.1インターフェイス仕様」。"
    },
    {
      "indent": 3,
      "text": "[ETSI-EN-300-659-1] ETSI EN 300 659-1: \"Public Switched Telephone Network (PSTN); Subscriber line protocol over the local loop for display (and related) services; Part 1: On hook data transmission\".",
      "ja": "[ETSI-EN-300-659-1] ETSI EN 300 659-1：「パブリックスイッチド電話ネットワーク（PSTN）;ディスプレイ（および関連）サービスのローカルループ上のサブスクライバーラインプロトコル、パート1：フックデータ送信について」。"
    },
    {
      "indent": 3,
      "text": "[ITU-T-E.180] ITU-T E.180: \"Various Tones Used in National Networks, Supplement 2 to Recommendation E.180\".",
      "ja": "[ITU-T-E.180] ITU-T E.180：「全国ネットワークで使用されるさまざまなトーン、推奨e.180に2を補完する」。"
    },
    {
      "indent": 3,
      "text": "[ETSI-TR-101-183] ETSI TR-101-183: \"Public Switched Telephone Network (PSTN) Analogue Ringing Signals\".",
      "ja": "[ETSI-TR-101-183] ETSI TR-101-183：「パブリックスイッチド電話ネットワーク（PSTN）アナログリンギング信号」。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Gordon Beacham Motorola, Inc. 6450 Sequence Drive, Bldg. 1 San Diego, CA 92121, USA",
      "ja": "Gordon Beacham Motorola、Inc。6450 Sequence Drive、Bldg。1サンディエゴ、CA 92121、米国"
    },
    {
      "indent": 3,
      "text": "Phone: +1 858-404-2334\nEMail: gordon.beacham@motorola.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Satish Kumar Mudugere Eswaraiah Texas Instruments India (P) Ltd., Golf view, Wind Tunnel Road Murugesh Palya Bangalore 560 017, INDIA",
      "ja": "Satish Kumar Mudugere Eswaraiah Texas Instruments India（P）Ltd.、Golf View、Wind Tunnel Road Murugesh Palya Bangalore 560 017、インド"
    },
    {
      "indent": 3,
      "text": "Phone: +91 80 5269451\nEMail: satish.kumar@ti.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Sumanth Channabasappa Cable Television Laboratories, Inc. 858 Coal Creek Circle, Louisville, CO 80027, USA",
      "ja": "Sumanth Channabasappa Cable Television Laboratories、Inc。858 Coal Creek Circle、Louisville、Co 80027、米国"
    },
    {
      "indent": 3,
      "text": "Phone: +1 303-661-3307\nEMail: Sumanth@cablelabs.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The IETF Trust (2008).",
      "ja": "著作権（c）The IETF Trust（2008）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "この文書は、BCP 78に含まれる権利、ライセンス、および制限の対象となり、そこに記載されている場合を除き、著者はすべての権利を保持しています。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE IETF TRUST AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "このドキュメントとここに含まれる情報は、「現状のまま」に基づいて提供され、貢献者、彼/彼女が代表する組織（もしあれば）、インターネット協会、IETFトラスト、インターネットエンジニアリングタスクフォースがすべてを否認します。明示的または黙示的な保証。ここでの情報の使用は、特定の目的に対する商品性または適合性の権利または暗黙の保証を侵害しないという保証を含むがこれらに限定されない。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、知的財産権またはその他の権利の有効性または範囲に関して、本書に記載されている技術の実装または使用、またはそのような権利に基づくライセンスに基づくライセンスの範囲に関連すると主張される可能性のある他の権利に関しては、立場を取得しません。利用可能になります。また、そのような権利を特定するために独立した努力をしたことも表明していません。RFCドキュメントの権利に関する手順に関する情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IETF事務局に行われたIPR開示のコピーと、利用可能にするライセンスの保証、またはこの仕様の実装者またはユーザーによるそのような独自の権利の使用のための一般的なライセンスまたは許可を取得するための試みの結果を取得できます。http://www.ietf.org/iprのIETFオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、関心のある当事者に、著作権、特許、または特許出願、またはこの基準を実装するために必要なテクノロジーをカバーする可能性のあるその他の独自の権利を注意深く招待します。ietf-ipr@ietf.orgのIETFへの情報をお問い合わせください。"
    }
  ]
}