{
  "title": {
    "text": "RFC 5847 - Heartbeat Mechanism for Proxy Mobile IPv6",
    "ja": "RFC 5847 - プロキシモバイルIPv6のハートビートメカニズム"
  },
  "number": 5847,
  "created_at": "2019-10-29 18:39:56.612494+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)               V. Devarapalli, Ed.\nRequest for Comments: 5847                                      WiChorus\nCategory: Standards Track                                 R. Koodli, Ed.\nISSN: 2070-1721                                            Cisco Systems\n                                                                  H. Lim\n                                                                 N. Kant\n                                                                   Stoke\n                                                             S. Krishnan\n                                                             J. Laganier\n                                                           Qualcomm Inc.\n                                                               June 2010",
      "raw": true
    },
    {
      "indent": 15,
      "text": "Heartbeat Mechanism for Proxy Mobile IPv6",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "Proxy Mobile IPv6 (PMIPv6) is a network-based mobility management protocol. The mobility entities involved in the Proxy Mobile IPv6 protocol, the mobile access gateway (MAG) and the local mobility anchor (LMA), set up tunnels dynamically to manage mobility for a mobile node within the Proxy Mobile IPv6 domain. This document describes a heartbeat mechanism between the MAG and the LMA to detect failures, quickly inform peers in the event of a recovery from node failures, and allow a peer to take appropriate action.",
      "ja": "プロキシモバイルIPv6（PMIPv6の）は、ネットワークベースのモビリティ管理プロトコルです。プロキシモバイルIPv6プロトコル、モバイル・アクセス・ゲートウェイ（MAG）およびローカル・モビリティ・アンカー（LMA）に関与モビリティエンティティは、プロキシ・モバイルIPv6ドメイン内のモバイルノードのモビリティを管理するために動的にトンネルを設定します。この文書では、MAGとすぐに、障害を検出ノード障害からの回復の際にピアに通知し、ピアが適切な行動を取ることを可能にするLMA間のハートビートのメカニズムを説明しています。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc5847.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc5847で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2010 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2010 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  3\n2.  Terminology  . . . . . . . . . . . . . . . . . . . . . . . . .  3\n3.  Heartbeat Mechanism  . . . . . . . . . . . . . . . . . . . . .  3\n  3.1.  Failure Detection  . . . . . . . . . . . . . . . . . . . .  4\n  3.2.  Restart Detection  . . . . . . . . . . . . . . . . . . . .  5\n  3.3.  Heartbeat Message  . . . . . . . . . . . . . . . . . . . .  6\n  3.4.  Restart Counter Mobility Option  . . . . . . . . . . . . .  7\n4.  Exchanging Heartbeat Messages over an IPv4 Transport\n    Network  . . . . . . . . . . . . . . . . . . . . . . . . . . .  8\n5.  Configuration Variables  . . . . . . . . . . . . . . . . . . .  8\n6.  Security Considerations  . . . . . . . . . . . . . . . . . . .  8\n7.  IANA Considerations  . . . . . . . . . . . . . . . . . . . . .  9\n8.  Acknowledgements . . . . . . . . . . . . . . . . . . . . . . .  9\n9.  References . . . . . . . . . . . . . . . . . . . . . . . . . .  9\n  9.1.  Normative References . . . . . . . . . . . . . . . . . . .  9\n  9.2.  Informative References . . . . . . . . . . . . . . . . . . 10",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "Proxy Mobile IPv6 (PMIPv6) [RFC5213] enables network-based mobility for IPv6 hosts that do not implement any mobility protocols. The protocol is described in detail in [RFC5213]. In order to facilitate the network-based mobility, the PMIPv6 protocol defines a mobile access gateway (MAG), which acts as a proxy for the Mobile IPv6 [RFC3775] signaling, and the local mobility anchor (LMA), which acts similar to a home agent, anchoring a mobile node's sessions within a PMIPv6 domain. The LMA and the MAG establish a bidirectional tunnel for forwarding all data traffic belonging to the mobile nodes.",
      "ja": "プロキシモバイルIPv6（PMIPv6の）[RFC5213]は、任意のモビリティプロトコルを実装していないIPv6ホストのネットワーク・ベースのモビリティを可能にします。プロトコルは、[RFC5213]に詳細に記載されています。ネットワーク・ベースのモビリティを容易にするために、のPMIPv6プロトコルは、モバイルIPv6 [RFC3775]のシグナリング、及びと同様に作用するローカル・モビリティ・アンカー（LMA）のプロキシとして動作するモバイルアクセスゲートウェイ（MAG）を定義しますPMIPv6ドメイン内の移動ノードのセッションを固定ホームエージェント、。 LMAとMAGは、モバイルノードに属するすべてのデータトラフィックを転送するための双方向トンネルを確立します。"
    },
    {
      "indent": 3,
      "text": "In a distributed environment such as a PMIPv6 domain consisting of LMAs and MAGs, it is necessary for the nodes to 1) have a consistent state about each other's reachability, and 2) quickly inform peers in the event of recovery from node failures. So, when the LMA restarts after a failure, the MAG should (quickly) learn about the restart so that it can take appropriate actions (such as releasing any resources). When there are no failures, a MAG should know about the LMA's reachability (and vice versa) so that the path can be assumed to be functioning.",
      "ja": "LMAとのMAGからなるPMIPv6ドメインのような分散環境では、それは、1）までのノードのために必要である互いの到達可能性に関する一貫性のある状態を有し、2）迅速にノード障害からの回復の際にピアに通知します。 LMAは、障害発生後に再起動したときに、それは（そのようなすべてのリソースを解放するように）適切な行動を取ることができるようにそう、MAGは（すぐに）再起動について学ぶ必要があります。何の障害が存在しない場合にはパスが機能していると仮定することができるように、MAGは、LMAの到達可能性（およびその逆）について知っておくべき。"
    },
    {
      "indent": 3,
      "text": "This document specifies a heartbeat mechanism between the MAG and the LMA to detect the status of reachability between them. This document also specifies a mechanism to indicate node restarts; the mechanism could be used to quickly inform peers of such restarts. The Heartbeat message is a Mobility Header message (protocol type 135) that is periodically exchanged at a configurable threshold of time or sent unsolicited soon after a node restart. This document does not specify the specific actions (such as releasing resources) that a node takes as a response to processing the Heartbeat messages.",
      "ja": "この文書では、MAGとそれらの間の到達可能性の状態を検出するために、LMA間のハートビート・メカニズムを指定します。この文書では、ノードの再起動を指示するためのメカニズムを指定します。メカニズムは、迅速な再起動のピアに通知するために使用することができます。ハートビートメッセージは、定期的に時間の設定可能な閾値で交換又はすぐノードの再起動後に迷惑送信されるモビリティヘッダメッセージ（プロトコルタイプ135）です。この文書では、ノードは、ハートビートメッセージの処理への応答としてとること（そのようなリソースを解放するような）特定のアクションを指定していません。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "ja": "2.用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "3. Heartbeat Mechanism",
      "section_title": true,
      "ja": "3.ハートビートメカニズム"
    },
    {
      "indent": 3,
      "text": "The MAG and the LMA exchange Heartbeat messages every HEARTBEAT_INTERVAL seconds to detect the current status of reachability between them. The MAG initiates the heartbeat exchange to test if the LMA is reachable by sending a Heartbeat Request message to the LMA. Each Heartbeat Request contains a sequence number that is incremented monotonically. The sequence number on the last Heartbeat Request message is always recorded by the MAG, and is used to match the corresponding Heartbeat Response. Similarly, the",
      "ja": "すべてのHEARTBEAT_INTERVAL秒MAGとLMA交換ハートビート・メッセージは、それらの間の到達可能性の現在の状態を検出します。 MAGは、LMAがLMAにハートビート要求メッセージを送信することによって到達可能であるかどうかをテストするために、ハートビートの交換を開始します。各ハートビート要求が単調にインクリメントされたシーケンス番号が含まれています。最後のハートビート要求メッセージのシーケンス番号は常にMAGによって記録され、対応するハートビート応答を一致させるために使用されます。同様に、"
    },
    {
      "indent": 3,
      "text": "LMA also initiates a heartbeat exchange with the MAG, by sending a Heartbeat Request message, to check if the MAG is reachable. The format of the Heartbeat message is described in Section 3.3.",
      "ja": "LMAはまた、MAGが到達可能であるかどうかを確認するために、ハートビート要求メッセージを送信することにより、MAGとハートビート交換を開始します。ハートビートメッセージのフォーマットは、セクション3.3に記載されています。"
    },
    {
      "indent": 3,
      "text": "A Heartbeat Request message can be sent only if the MAG has at least one proxy Binding Cache entry at the LMA for a mobile node attached to the MAG. If there are no proxy Binding Cache entries at the LMA for any of the mobile nodes attached to the MAG, then the Heartbeat message SHOULD NOT be sent. Similarly, the LMA SHOULD NOT send a Heartbeat Request message to a MAG if there is no active Binding Cache entry created by the MAG. A PMIPv6 node MUST respond to a Heartbeat Request message with a Heartbeat Response message, irrespective of whether there is an active Binding Cache entry.",
      "ja": "ハートビート・リクエスト・メッセージは、MAGは、MAGに取り付けられたモバイルノードのためのLMAにおけるキャッシュエントリをバインディング少なくとも一つのプロキシを持つ場合にのみ送信することができます。 MAGに取り付けられたモバイルノードのいずれかのためにLMAでキャッシュエントリを結合ないプロキシが存在しない場合は、ハートビートメッセージを送るべきではありません。 MAGによって作成されたアクティブなバインディングキャッシュエントリが存在しない場合は同様に、LMAは、MAGにハートビート要求メッセージを送るべきではありません。 PMIPv6ノードがアクティブバインディングキャッシュエントリーが存在するか否かにかかわらず、ハートビート応答メッセージでハートビート要求メッセージに応答しなければなりません。"
    },
    {
      "indent": 3,
      "text": "The HEARTBEAT_INTERVAL SHOULD NOT be configured to a value less than 30 seconds. Deployments should be careful in setting the value for the HEARTBEAT_INTERVAL. Sending Heartbeat messages too often may become an overhead on the path between the MAG and the LMA. It could also create congestion in the network and negatively affect network performance. The HEARTBEAT_INTERVAL can be set to a much larger value on the MAG and the LMA, if required, to reduce the burden of sending periodic Heartbeat messages.",
      "ja": "HEARTBEAT_INTERVALは30秒未満の値に設定しないでください。展開がHEARTBEAT_INTERVALの値を設定する際に注意しなければなりません。あまりにも頻繁にハートビートメッセージを送信すると、MAGとLMAとの間のパス上のオーバーヘッドになることがあります。また、ネットワークの輻輳を作成し、マイナスのネットワークのパフォーマンスに影響を与える可能性があります。 HEARTBEAT_INTERVALは、定期的なハートビートメッセージを送信するの負担を軽減するために、必要であれば、MAGとLMA上の非常に大きな値に設定することができます。"
    },
    {
      "indent": 3,
      "text": "If the LMA or the MAG do not support the Heartbeat messages, they respond with a Binding Error message with status set to 2 (unrecognized mobility header (MH) type value) as described in [RFC3775]. When the Binding Error message with status set to 2 is received in response to a Heartbeat Request message, the initiating MAG or the LMA MUST NOT use Heartbeat messages with the other end again.",
      "ja": "LMA又はMAGがハートビートメッセージをサポートしていない場合、それらは2に設定された状態との結合のエラーメッセージで応答する（未認識モビリティヘッダ（MH）値を入力）[RFC3775]に記載されているように。 2に設定された状態で結合エラーメッセージがハートビート要求メッセージに応答して受信されると、開始MAGまたはLMAは再びもう一方の端にハートビートメッセージを使用してはなりません。"
    },
    {
      "indent": 3,
      "text": "If a PMIPv6 node has detected that a peer PMIPv6 node has failed or restarted without retaining the PMIPv6 session state, it should mark the corresponding binding update list or binding cache entries as invalid. The PMIPv6 node may also take other actions, which are outside the scope of this document.",
      "ja": "PMIPv6のノードがピアのPMIPv6ノードがPMIPv6のセッション状態を保持せずに失敗したか、または再起動したことを検出した場合には、対応するバインディング更新リストをマーク、または無効としてキャッシュエントリを結合する必要があります。 PMIPv6のノードは、この文書の範囲外である他のアクションをとることができます。"
    },
    {
      "indent": 3,
      "text": "The detection of failure and restart events may be signaled to network operators by using asynchronous notifications. Future work may define such notifications in a Structure of Management Information Version 2 (SMIv2) Management Information Base (MIB) module.",
      "ja": "故障、再起動イベントの検出は、非同期通知を使用して、ネットワークオペレータに通知することができます。今後の課題は、経営情報バージョン2（SMIv2）管理情報ベース（MIB）モジュールの構造では、そのような通知を定義することができます。"
    },
    {
      "indent": 0,
      "text": "3.1. Failure Detection",
      "section_title": true,
      "ja": "3.1。障害検出"
    },
    {
      "indent": 3,
      "text": "A PMIPv6 node (MAG or LMA) matches every received Heartbeat Response to the Heartbeat Request sent using the sequence number. Before sending the next Heartbeat Request, it increments a local variable",
      "ja": "PMIPv6ノード（MAG又はLMA）は、すべてのシーケンス番号を使用して送信されるハートビート要求にハートビート応答を受信し一致します。次のハートビート要求を送信する前に、それはローカル変数をインクリメント"
    },
    {
      "indent": 3,
      "text": "MISSING_HEARTBEAT if it has not received a Heartbeat Response for the previous request. When this local variable MISSING_HEARTBEAT exceeds a configurable parameter MISSING_HEARTBEATS_ALLOWED, the PMIPv6 node concludes that the peer PMIPv6 node is not reachable. If a Heartbeat Response message is received, the MISSING_HEARTBEATS counter is reset.",
      "ja": "MISSING_HEARTBEATそれは、前の要求のためのハートビート応答を受信して​​いない場合。このローカル変数MISSING_HEARTBEATが設定可能なパラメータMISSING_HEARTBEATS_ALLOWEDを超えたときに、PMIPv6のノードは、ピアのPMIPv6ノードが到達可能ではないと結論づけています。ハートビート応答メッセージを受信した場合、MISSING_HEARTBEATSカウンタがリセットされます。"
    },
    {
      "indent": 0,
      "text": "3.2. Restart Detection",
      "section_title": true,
      "ja": "3.2。再起動検出"
    },
    {
      "indent": 3,
      "text": "The section describes a mechanism for detecting failure recovery without session persistence. In the case that the LMA or the MAG crashes and reboots and loses all state with respect to the PMIPv6 sessions, it would be beneficial for the peer PMIPv6 node to discover the failure and the loss of session state and establish the sessions again.",
      "ja": "セクションでは、セッションの持続性なし障害回復を検出するためのメカニズムについて説明します。ピアのPMIPv6ノードが障害とセッション状態の損失を発見し、再度セッションを確立するためにLMA又はMAGがクラッシュして再起動とは、PMIPv6のセッションに対するすべての状態を失った場合、それは有益であろう。"
    },
    {
      "indent": 3,
      "text": "Each PMIPv6 node (both the MAG and LMA) MUST maintain a monotonically increasing Restart Counter that is incremented every time the node reboots and loses PMIPv6 session state. The counter MUST NOT be incremented if the recovery happens without losing state for the PMIPv6 sessions active at the time of failure. This counter MUST be treated as state that is preserved across reboots. A PMIPv6 node includes a Restart Counter mobility option, described in Section 3.4, in a Heartbeat Response message to indicate the current value of the Restart Counter. Each PMIPv6 node MUST also store the Restart Counter for all the peer PMIPv6 nodes with which it currently has sessions. Stored Restart Counter values for peer PMIPv6 nodes do not need to be preserved across reboots.",
      "ja": "それぞれのPMIPv6ノード（MAG及びLMAの両方）は、ノードが再起動とのPMIPv6セッション状態を失うたびにインクリメントされる単調増加再始動カウンタを維持しなければなりません。回復は、障害時のアクティブPMIPv6のセッションの状態を失わずに発生した場合、カウンタはインクリメントされてはなりません。このカウンタは、リブート後も保持された状態として扱わなければなりません。 PMIPv6のノードが再起動カウンタの現在値を示すハートビート応答メッセージ内のセクション3.4に記載再始動カウンタモビリティオプションを含みます。それぞれのPMIPv6ノードはまた、それが現在のセッションを持っているとすべてのピアのPMIPv6ノードの再起動カウンタを記憶しなければなりません。ピアのPMIPv6ノードの保存された再起動カウンタ値は、再起動後も保持する必要はありません。"
    },
    {
      "indent": 3,
      "text": "The PMIPv6 node that receives the Heartbeat Response message compares the Restart Counter value with the previously received value. If the value is different, the receiving node assumes that the peer PMIPv6 node had crashed and recovered. If the Restart Counter value changes or if there was no previously stored value, the new value is stored by the receiving PMIPv6 node.",
      "ja": "ハートビート応答メッセージを受信するのPMIPv6ノードは、以前に受信した値と再起動カウンタ値とを比較します。値が異なる場合、受信ノードは、ピアのPMIPv6ノードがクラッシュして回復したことを想定しています。再起動カウンタ値が変更された場合、または全く以前に格納された値がなかった場合は、新しい値が受信PMIPv6のノードによって格納されます。"
    },
    {
      "indent": 3,
      "text": "If a PMIPv6 node restarts and loses PMIPv6 session state, it SHOULD send an unsolicited Heartbeat Response message with an incremented Restart Counter to all the PMIPv6 nodes that had previously established PMIPv6 sessions. Note that this is possible only when the PMIPv6 node is capable of storing information about the peers across reboots. The unsolicited Heartbeat Response message allows the peer PMIPv6 nodes to quickly discover the restart. The sequence number field in the unsolicited Heartbeat Response is ignored and no response is necessary; the nodes will synchronize during the next request and response exchange.",
      "ja": "PMIPv6のノードが再起動した場合とのPMIPv6セッション状態を失い、それは以前のPMIPv6セッションを確立していたすべてのPMIPv6ノードにインクリメント再起動カウンタによる迷惑ハートビート応答メッセージを送信する必要があります。これはPMIPv6のノードがリブートピアに関する情報を記憶することができる場合にのみ可能であることに留意されたいです。迷惑ハートビート応答メッセージは、ピアのPMIPv6ノードはすぐに再起動を検出することができます。迷惑ハートビート応答のシーケンス番号フィールドは無視され、応答は必要ありません。ノードは、次の要求と応答の交換時に同期されます。"
    },
    {
      "indent": 0,
      "text": "3.3. Heartbeat Message",
      "section_title": true,
      "ja": "3.3。ハートビートメッセージ"
    },
    {
      "indent": 3,
      "text": "The Heartbeat message is based on the Mobility Header defined in Section 6.1 of [RFC3775]. The MH Type field in the Mobility Header indicates that it is a Heartbeat message. The value MUST be set to 13. This document does not make any other changes to the Mobility Header message. Please refer to [RFC3775] for a description of the fields in the Mobility Header message.",
      "ja": "ハートビートメッセージは、[RFC3775]のセクション6.1で定義されたモビリティヘッダに基づいています。モビリティヘッダのMHタイプフィールドは、ハートビートメッセージであることを示しています。値は、この文書では、モビリティヘッダのメッセージにその他の変更をしない13に設定しなければなりません。モビリティヘッダのメッセージ内のフィールドの説明については、[RFC3775]を参照してください。"
    },
    {
      "indent": 5,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n| Payload Proto |  Header Len   |   MH Type     |   Reserved    |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|           Checksum            |                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+                               |\n|                                                               |\n.                                                               .\n.                       Message Data                            .\n.                                                               .\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 17,
      "text": "Figure 1: Mobility Header Message Format",
      "ja": "図1：モビリティヘッダメッセージの形式"
    },
    {
      "indent": 3,
      "text": "The Heartbeat message follows the Checksum field in the above message. The following illustrates the message format for the Heartbeat Mobility Header message.",
      "ja": "ハートビートメッセージは、上記メッセージのチェックサムフィールドに続きます。以下は、ハートビートモビリティヘッダメッセージのメッセージフォーマットを示します。"
    },
    {
      "indent": 5,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n                                +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n                                |            Reserved       |U|R|\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                       Sequence Number                         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                                                               |\n.                                                               .\n.                        Mobility Options                       .\n.                                                               .\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 20,
      "text": "Figure 2: Heartbeat Message Format",
      "ja": "図2：ハートビートメッセージの形式"
    },
    {
      "indent": 3,
      "text": "Reserved",
      "ja": "予約済み"
    },
    {
      "indent": 6,
      "text": "Set to 0 and ignored by the receiver.",
      "ja": "0に設定すると、受信機で無視。"
    },
    {
      "indent": 3,
      "text": "'U'",
      "ja": "’う’"
    },
    {
      "indent": 6,
      "text": "Set to 1 in Unsolicited Heartbeat Response. Otherwise, set to 0.",
      "ja": "迷惑ハートビートレスポンスを1に設定してください。それ以外の場合は、0に設定します。"
    },
    {
      "indent": 3,
      "text": "'R'",
      "ja": "'R'"
    },
    {
      "indent": 6,
      "text": "A 1-bit flag that indicates whether the message is a request or a response. When the 'R' flag is set to 0, it indicates that the Heartbeat message is a request. When the 'R' flag is set to 1, it indicates that the Heartbeat message is a response.",
      "ja": "メッセージは、要求または応答であるかどうかを示す1ビットのフラグ。 「R」フラグが0に設定されている場合は、ハートビートメッセージが要求であることを示しています。 「R」フラグが1に設定されている場合は、ハートビートメッセージが応答であることを示しています。"
    },
    {
      "indent": 3,
      "text": "Sequence Number",
      "ja": "シーケンス番号"
    },
    {
      "indent": 6,
      "text": "A 32-bit sequence number used for matching the request to the reply.",
      "ja": "応答への要求に合致するために使用される32ビットのシーケンス番号。"
    },
    {
      "indent": 3,
      "text": "Mobility Options",
      "ja": "モビリティオプション"
    },
    {
      "indent": 6,
      "text": "Variable-length field of such length that the complete Mobility Header is an integer that is a multiple of 8 octets long. This field contains zero or more TLV-encoded mobility options. The receiver MUST ignore and skip any options that it does not understand. At the time of writing this document, the Restart Counter mobility option, described in Section 3.4, is the only valid option in this message.",
      "ja": "完全なモビリティヘッダが8つのオクテットの倍数の長さである整数であるような長さの可変長フィールド。このフィールドは、ゼロ個以上のTLVでエンコードされたモビリティオプションが含まれています。受信機は、それが理解していない任意のオプションを無視してスキップしなければなりません。この文書を書いている時点では、3.4節で説明した再起動カウンタモビリティオプションは、このメッセージでのみ有効なオプションです。"
    },
    {
      "indent": 0,
      "text": "3.4. Restart Counter Mobility Option",
      "section_title": true,
      "ja": "3.4。カウンターモビリティオプションを再起動します。"
    },
    {
      "indent": 3,
      "text": "The following shows the message format for a new mobility option for carrying the Restart Counter value in the Heartbeat message. The Restart Counter mobility option is only valid in a Heartbeat Response message. It has an alignment requirement of 4n+2.",
      "ja": "以下は、ハートビートメッセージに再起動カウンタ値を運ぶための新しいモビリティ・オプションのメッセージフォーマットを示します。再起動カウンタモビリティオプションは、ハートビート応答メッセージでのみ有効です。これは、4N + 2の整列要求を有しています。"
    },
    {
      "indent": 5,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n                                +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n                                |      Type     |     Length    |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                       Restart Counter                         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 17,
      "text": "Figure 3: Restart Counter Mobility Option",
      "ja": "図3：再起動カウンタモビリティオプション"
    },
    {
      "indent": 3,
      "text": "Type",
      "ja": "タイプ"
    },
    {
      "indent": 6,
      "text": "An 8-bit field that indicates that it is a Restart Counter mobility option. It MUST be set to 28.",
      "ja": "それが再起動カウンタモビリティオプションであることを示す8ビットのフィールド。それは28に設定しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Length",
      "ja": "長さ"
    },
    {
      "indent": 6,
      "text": "An 8-bit field that indicates the length of the option in octets excluding the Type and Length fields. It is set to 4.",
      "ja": "タイプと長さフィールドを除くオクテット内のオプションの長さを示す8ビットのフィールド。これは4に設定されています。"
    },
    {
      "indent": 3,
      "text": "Restart Counter",
      "ja": "再起動カウンタ"
    },
    {
      "indent": 6,
      "text": "A 32-bit field that indicates the current Restart Counter value.",
      "ja": "現在の再起動カウンタ値を示す32ビットのフィールド。"
    },
    {
      "indent": 0,
      "text": "4. Exchanging Heartbeat Messages over an IPv4 Transport Network",
      "section_title": true,
      "ja": "4. IPv4のトランスポートネットワーク上でハートビートメッセージを交換"
    },
    {
      "indent": 3,
      "text": "In some deployments, the network between the MAG and the LMA may be IPv4-only and not capable of routing IPv6 packets. In this case, the Mobility Header containing the Heartbeat message is carried as specified in Section 4 of [RFC5844], i.e., the Mobility Header is part of the UDP payload inside an IPv4 packet (IPv4-UDP-MH).",
      "ja": "いくつかの展開では、MAGとLMAとの間のネットワークは、IPv4のみとIPv6パケットをルーティングすることができないかもしれません。 [RFC5844]のセクション4で指定されるように、この場合に、ハートビートメッセージを含むモビリティヘッダが行われる、すなわち、モビリティヘッダはIPv4パケット内のUDPペイロード（のIPv4-UDP-MH）の一部です。"
    },
    {
      "indent": 0,
      "text": "5. Configuration Variables",
      "section_title": true,
      "ja": "5.構成変数"
    },
    {
      "indent": 3,
      "text": "The LMA and the MAG must allow the following variables to be configurable.",
      "ja": "LMAとMAGは、以下の変数を設定できるように許可する必要があります。"
    },
    {
      "indent": 3,
      "text": "HEARTBEAT_INTERVAL",
      "ja": "HEARTBEAT_INTERVAL"
    },
    {
      "indent": 6,
      "text": "This variable is used to set the time interval in seconds between two consecutive Heartbeat Request messages. The default value is 60 seconds. It SHOULD NOT be set to less than 30 seconds or more than 3600 seconds.",
      "ja": "この変数は、2つの連続したハートビート・リクエスト・メッセージの時間間隔を秒単位で設定するために使用されます。デフォルト値は60秒です。これは、30秒未満または以上3600秒に設定しないでください。"
    },
    {
      "indent": 3,
      "text": "MISSING_HEARTBEATS_ALLOWED",
      "ja": "MISSING_HEARTBEATS_ALLOWED"
    },
    {
      "indent": 6,
      "text": "This variable indicates the maximum number of consecutive Heartbeat Request messages for which a PMIPv6 node did not receive a response before concluding that the peer PMIPv6 node is not reachable. The default value for this variable is 3.",
      "ja": "この変数は、PMIPv6のノードがピアのPMIPv6ノードに到達できないと結論する前に応答を受信しなかったために連続したハートビート・リクエスト・メッセージの最大数を示します。この変数のデフォルト値は3です。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "The Heartbeat messages are just used for checking reachability between the MAG and the LMA. They do not carry information that is useful for eavesdroppers on the path. Therefore, confidentiality protection is not required. Integrity protection using IPsec [RFC4301] for the Heartbeat messages MUST be supported on the MAG and the LMA. RFC 5213 [RFC5213] describes how to protect the Proxy Binding Update and Acknowledgement signaling messages with IPsec. The Heartbeat message defined in this specification is merely another subtype of the same Mobility Header protocol that is already being protected by IPsec. Therefore, protecting this additional message is possible using the mechanisms and security policy models from these RFCs. The security policy database entries should use the new MH Type, the Heartbeat message, for the MH Type selector.",
      "ja": "ハートビートメッセージは、単にMAGとLMA間の到達可能性をチェックするために使用されています。彼らは、パス上の盗聴者に役立つ情報を運びません。そのため、機密保護が必要とされていません。ハートビートメッセージにIPsec [RFC4301]を使用して完全性保護は、MAGとLMAにサポートしなければなりません。 RFC 5213 [RFC5213]はIPsecでシグナリングメッセージをプロキシバインディング更新と謝辞を保護する方法について説明します。本明細書で定義されたハートビートメッセージは、単に既にのIPsecによって保護されて、同じモビリティヘッダプロトコルの別のサブタイプです。したがって、この追加のメッセージを保護することは、これらのRFCからのメカニズムとセキュリティポリシーモデルを使用して可能です。セキュリティポリシーデータベースエントリはMHタイプセレクタの、新しいMHタイプ、ハートビートメッセージを使用する必要があります。"
    },
    {
      "indent": 3,
      "text": "If dynamic key negotiation between the MAG and the LMA is required, Internet Key Exchange Protocol version 2 (IKEv2) [RFC4306] should be used.",
      "ja": "MAGとLMA間の動的キーのネゴシエーションが必要な場合は、インターネット鍵交換プロトコルバージョン2（IKEv2の）[RFC4306]は使用すべきです。"
    },
    {
      "indent": 0,
      "text": "7. IANA Considerations",
      "section_title": true,
      "ja": "7. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "The Heartbeat message defined in Section 3.3 must have the type value allocated from the same space as the 'MH Type' name space in the Mobility Header defined in RFC 3775 [RFC3775].",
      "ja": "モビリティヘッダの「MHタイプ」名前空間は、RFC 3775 [RFC3775]で定義されるように、セクション3.3で定義されたハートビートメッセージが同じ空間から割り当てられたタイプの値を有していなければなりません。"
    },
    {
      "indent": 3,
      "text": "The Restart Counter mobility option defined in Section 3.4 must have the type value allocated from the same name space as the mobility options defined in RFC 3775 [RFC3775].",
      "ja": "3.4節で定義された再起動カウンタモビリティオプションは、RFC 3775 [RFC3775]で定義されたモビリティオプションと同じ名前空間から割り当て型の値を持つ必要があります。"
    },
    {
      "indent": 0,
      "text": "8. Acknowledgements",
      "section_title": true,
      "ja": "8.謝辞"
    },
    {
      "indent": 3,
      "text": "A heartbeat mechanism for a network-based mobility management protocol was first described in [NETLMM]. The authors would like to thank the members of a NETLMM design team that produced that document. The mechanism described in this document also derives from the path management mechanism described in [GTP].",
      "ja": "ネットワーク・ベースのモビリティ管理プロトコルのためのハートビート機構は、第1 [NETLMM]で説明しました。著者は、その文書を作成しNETLMMの設計チームのメンバーに感謝したいと思います。本書で説明されたメカニズムはまた、[GTP]に記載のパス管理機構に由来します。"
    },
    {
      "indent": 3,
      "text": "We would like to thank Alessio Casati for first suggesting a fault handling mechanism for Proxy Mobile IPv6.",
      "ja": "我々は最初のプロキシモバイルIPv6の障害処理メカニズムを示唆するためにアレッシオカザーティに感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "ja": "9.参考文献"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "ja": "9.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC5213] Gundavelli, S., Leung, K., Devarapalli, V., Chowdhury, K., and B. Patil, \"Proxy Mobile IPv6\", RFC 5213, August 2008.",
      "ja": "[Ramphsi 5213] gundavelli、S。、Leunjiは、K.、Devarapalliは、VEの。、Chaudhuriの、K.、aとb。パティル、 \"プロキシモバイル20 6\"、rphak 5213、2008年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC5844] Wakikawa, R. and S. Gundavelli, \"IPv4 Support for Proxy Mobile IPv6\", RFC 5844, May 2010.",
      "ja": "[RFC5844] Wakikawa、R.およびS. Gundavelli、 \"プロキシモバイルIPv6のIPv4サポート\"、RFC 5844、2010年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC4301] Kent, S. and K. Seo, \"Security Architecture for the Internet Protocol\", RFC 4301, December 2005.",
      "ja": "[RFC4301]ケント、S.とK. Seo、 \"インターネットプロトコルのためのセキュリティアーキテクチャ\"、RFC 4301、2005年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC4306] Kaufman, C., \"Internet Key Exchange (IKEv2) Protocol\", RFC 4306, December 2005.",
      "ja": "[RFC4306]カウフマン、C.、 \"インターネットキーエクスチェンジ（IKEv2の）プロトコル\"、RFC 4306、2005年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC3775] Johnson, D., Perkins, C., and J. Arkko, \"Mobility Support in IPv6\", RFC 3775, June 2004.",
      "ja": "[RFC3775]ジョンソン、D.、パーキンス、C.、およびJ. Arkko、 \"IPv6におけるモビリティサポート\"、RFC 3775、2004年6月。"
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "ja": "9.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[NETLMM] Levkowetz, H., Ed., Giaretta, G., Leung, K., Liebsch, M., Roberts, P., Nishida, K., Yokota, H., and M. Parthasarathy, \"The NetLMM Protocol\", Work in Progress, October 2006.",
      "ja": "【NETLMM] Levkowetz、H.編、Giaretta、G.、レオン、K.、Liebsch、M.、ロバーツ、P.、西田、K.、横田、H.、およびM.パルタサラティ「のNetLMMプロトコル」、進歩、2006年10月に作業。"
    },
    {
      "indent": 3,
      "text": "[GTP] 3rd Generation Partnership Project, \"3GPP Technical Specification 29.060 V7.6.0: \"Technical Specification Group Core Network and Terminals; General Packet Radio Service (GPRS); GPRS Tunnelling Protocol (GTP) across the Gn and Gp interface (Release 7)\"\", July 2007.",
      "ja": "[GTP]第3世代パートナーシッププロジェクト、「3GPP技術仕様29.060 V7.6.0：」技術仕様グループコアネットワークと端末。汎用パケット無線サービス（GPRS）; GnのとGpのインタフェースを介してGPRSトンネリングプロトコル（GTP）（リリース7） \"\"、2007年7月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Vijay Devarapalli (editor) WiChorus 3950 North First Street San Jose, CA 95134 USA",
      "ja": "ビジェイDevarapalli（エディタ）WiChorus 3950北まずストリートサンノゼ、CA 95134 USA"
    },
    {
      "indent": 3,
      "text": "EMail: vijay@wichorus.com",
      "ja": "メールアドレス：vijay@wichorus.com"
    },
    {
      "indent": 3,
      "text": "Rajeev Koodli (editor) Cisco Systems USA",
      "ja": "ラジブkudli（編集）、シスコシステムズ米国"
    },
    {
      "indent": 3,
      "text": "EMail: rkoodli@cisco.com",
      "ja": "メールアドレス：rkoodli@cisco.com"
    },
    {
      "indent": 3,
      "text": "Heeseon Lim Stoke 5403 Betsy Ross Drive Santa Clara, CA 95054 USA",
      "ja": "Heeseonリムストーク5403ベッツィー・ロスドライブサンタクララ、CA 95054 USA"
    },
    {
      "indent": 3,
      "text": "EMail: hlim@stoke.com",
      "ja": "メールアドレス：hlim@stoke.com"
    },
    {
      "indent": 3,
      "text": "Nishi Kant Stoke 5403 Betsy Ross Drive Santa Clara, CA 95054 USA",
      "ja": "西カントストーク5403ベッツィー・ロスドライブサンタクララ、CA 95054 USA"
    },
    {
      "indent": 3,
      "text": "EMail: nishi@stoke.com",
      "ja": "メールアドレス：nishi@stoke.com"
    },
    {
      "indent": 3,
      "text": "Suresh Krishnan Ericsson 8400 Decarie Blvd. Town of Mount Royal, QC Canada",
      "ja": "スレシュクリシュナンエリクソン8400 Decarie大通りマウントロイヤル、QCカナダの町"
    },
    {
      "indent": 3,
      "text": "EMail: suresh.krishnan@ericsson.com",
      "ja": "メールアドレス：suresh.krishnan@ericsson.com"
    },
    {
      "indent": 3,
      "text": "Julien Laganier Qualcomm Incorporated 5775 Morehouse Drive San Diego, CA 92121 USA",
      "ja": "ジュリアンLaganier Qualcomm社5775モアハウスドライブサンディエゴ、CA 92121 USA"
    },
    {
      "indent": 3,
      "text": "EMail: julienl@qualcomm.com",
      "ja": "メールアドレス：julienl@qualcomm.com"
    }
  ]
}