{
  "title": {
    "text": "RFC 5183 - Sieve Email Filtering: Environment Extension",
    "ja": "RFC 5183 - ふるいメールフィルタリング：環境拡張"
  },
  "number": 5183,
  "created_at": "2019-10-24 08:22:30.190397+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                           N. Freed\nRequest for Comments: 5183                              Sun Microsystems\nCategory: Standards Track                                       May 2008",
      "raw": true
    },
    {
      "indent": 14,
      "text": "Sieve Email Filtering: Environment Extension",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document describes the \"environment\" extension to the Sieve email filtering language. The \"environment\" extension gives a Sieve script access to information about the Sieve interpreter itself, where it is running, and about any transport connection currently involved in transferring the message.",
      "ja": "この文書では、Sieveメールフィルタリング言語に「環境」の拡張子を記述しています。 「環境」の拡張は、それが実行されているふるいインタプリタ自体についての情報へのSieveスクリプトへのアクセスを提供し、現在のメッセージを転送に関与するすべてのトランスポート接続について。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "Sieve [RFC5228] is a language for filtering email messages at or around the time of final delivery. It is designed to be implementable on either a mail client or mail server. It is suitable for running on a mail server where users may not be allowed to execute arbitrary programs, such as on black box Internet Message Access Protocol [RFC3501] servers, as it has no user-controlled loops or the ability to run external programs.",
      "ja": "ふるい[RFC5228]は、最終的な配達の時や周りの電子メールメッセージをフィルタリングするための言語です。メールクライアントまたはメールサーバーのいずれかで実施可能となるように設計されています。これにより、ユーザーは、それがユーザ制御ループまたは外部プログラムを実行する機能を持っていないとして、そのようなブラックボックス、インターネットメッセージアクセスプロトコル[RFC3501]のサーバ上などの任意のプログラムを実行することは許されないことがあり、メールサーバー上で実行されているに適しています。"
    },
    {
      "indent": 3,
      "text": "Although Sieve is intended to be independent of access protocol, mail architecture, and operating system, in some cases it is useful to allow scripts to access information about their execution context. The \"environment\" extension provides a new environment test that can be used to implement scripts that behave differently when moved from one system to another, when messages arrive from different remote sources or when otherwise operated in different contexts.",
      "ja": "ふるいは、アクセスプロトコル、メールアーキテクチャ、およびオペレーティングシステムに依存しないように意図されているが、場合によっては、スクリプトがその実行コンテキストに関する情報にアクセスできるようにするために便利です。 「環境」の拡張子は、メッセージが異なるリモートソースから到着したとき、あるいは異なるコンテキストで動作する場合、一つのシステムから別のものに移動したときに異なる動作をするスクリプトを実装するために使用することができ、新しい環境のテストを提供します。"
    },
    {
      "indent": 0,
      "text": "2. Conventions Used in This Document",
      "section_title": true,
      "ja": "この文書で使用される2.表記"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 3,
      "text": "The terms used to describe the various components of the Sieve language are taken from Section 1.1 of [RFC5228].",
      "ja": "ふるい言語の様々な構成要素を記述するために使用される用語は、[RFC5228]のセクション1.1から取られます。"
    },
    {
      "indent": 3,
      "text": "This document refers to the ABNF productions IPv4-address-literal, IPv6-address-literal, and General-address-literal defined in Section 4.1.3 of [RFC2821].",
      "ja": "このドキュメントは[RFC2821]のセクション4.1.3で定義されたABNFプロダクションのIPv4アドレスリテラル、IPv6のアドレスリテラル、および汎用アドレスリテラルを指します。"
    },
    {
      "indent": 3,
      "text": "The location item makes use of standard terms for email service components. Additional information and background on these terms can be found in [EMAIL-ARCH].",
      "ja": "場所の項目は、電子メールサービスコンポーネントのための標準的な用語を使用します。これらの用語に関する追加情報や背景は[EMAIL-ARCH]で見つけることができます。"
    },
    {
      "indent": 0,
      "text": "3. Capability Identifiers",
      "section_title": true,
      "ja": "3.機能識別子"
    },
    {
      "indent": 3,
      "text": "The capability string associated with the extension defined in this document is \"environment\".",
      "ja": "この文書で定義された拡張子に関連付けられた機能の文字列は、「環境」です。"
    },
    {
      "indent": 0,
      "text": "4. Environment Test",
      "section_title": true,
      "ja": "4.環境のテスト"
    },
    {
      "indent": 3,
      "text": "Usage: environment [COMPARATOR] [MATCH-TYPE] <name: string> <key-list: string-list>",
      "ja": "使用法：環境[コンパレータ] [MATCH-TYPE] <名：文字列>の<key-リスト：文字列のリスト>"
    },
    {
      "indent": 3,
      "text": "The environment test retrieves the item of environment information specified by the name string and matches it to the values specified in the key-list argument. The test succeeds if a match occurs. The type of match defaults to \":is\" and the default comparator is \"i;ascii-casemap\".",
      "ja": "環境試験は、名前の文字列で指定された環境情報の項目を取得し、キーリストの引数で指定された値に一致します。マッチが発生した場合、テストは成功します。マッチのデフォルトのタイプは、「：」であり、デフォルトのコンパレータは「I; ASCII-CASEMAP」です。"
    },
    {
      "indent": 3,
      "text": "The current message is not a direct source of information for the environment test; the item of information specified by the name string is extracted from the script's operating environment and the key-list argument comes from the script.",
      "ja": "現在のメッセージは、環境試験のための情報の直接的な源ではありません。名前の文字列で指定された情報の項目は、スクリプトの動作環境から抽出され、キー-list引数は、スクリプトから来ています。"
    },
    {
      "indent": 3,
      "text": "The environment test MUST fail unconditionally if the specified information item does not exist. A script MUST NOT fail with an error if the item does not exist. This allows scripts to be written that handle nonexistent items gracefully. In particular, the test:",
      "ja": "指定された情報項目が存在しない場合、環境試験は、無条件に失敗しなければなりません。アイテムが存在しない場合、スクリプトはエラーで失敗してはなりません。これは、優雅に、存在しないアイテムを扱うことのスクリプトを書き込むことができます。具体的には、テスト："
    },
    {
      "indent": 5,
      "text": "if environment :contains \"item\" \"\" { ... }",
      "ja": "環境の場合：{...}「」「アイテム」が含まれています"
    },
    {
      "indent": 3,
      "text": "only succeeds if \"item\" is known to the implementation, and always succeeds if it is.",
      "ja": "唯一の「項目が」実装によく知られている場合は成功し、常にそれがあれば成功します。"
    },
    {
      "indent": 3,
      "text": "The \"relational\" extension [RFC5231] adds a match type called \":count\". The count of an environment test is 0 if the environment information returned is the empty string, or 1 otherwise.",
      "ja": "「：数」「関係」の拡張[RFC5231]はと呼ばれるマッチタイプを追加します。返された環境情報は、空の文字列、あるいは1である場合には環境試験のカウントが0です。"
    },
    {
      "indent": 3,
      "text": "Environment items can be standardized or vendor-defined. An IANA registry is defined for both types of items. Extensions designed for interoperable use SHOULD be defined in standards track or experimental RFCs.",
      "ja": "環境項目は標準またはベンダー定義することができます。 IANAレジストリは、アイテムの両方のタイプのために定義されています。相互運用性を使用するために設計された拡張機能は、標準トラックや実験的RFCで定義されるべきです。"
    },
    {
      "indent": 0,
      "text": "4.1. Initial Standard Environment Items",
      "section_title": true,
      "ja": "4.1。初期の標準環境項目"
    },
    {
      "indent": 3,
      "text": "The initial set of standardized environment items is as follows:",
      "ja": "次のように標準化された環境項目の初期設定は以下のとおりです。"
    },
    {
      "indent": 4,
      "text": "\"domain\" => The primary DNS domain associated with the Sieve execution context, usually but not always a proper suffix of the host name.",
      "ja": "ホスト名の適切な接尾通常常にではないが、ふるいの実行コンテキストに関連付けられている「ドメイン」=>プライマリDNSドメイン。"
    },
    {
      "indent": 4,
      "text": "\"host\" => The fully-qualified domain name of the host where the Sieve script is executing.",
      "ja": "Sieveスクリプトが実行されているホストの「ホスト」=>完全修飾ドメイン名。"
    },
    {
      "indent": 4,
      "text": "\"location\" => Sieve evaluation can be performed at various different points as messages are processed. This item provides additional information about the type of service that is evaluating the script. Possible values are \"MTA\", meaning the Sieve is being evaluated by a Message Transfer Agent, \"MDA\", meaning evaluation is being performed by a Mail Delivery Agent, \"MUA\", meaning evaluation is being performed by a Mail User Agent, and \"MS\", meaning evaluation is being performed by a Message Store. Additional information and background on these terms can be found in [EMAIL-ARCH].",
      "ja": "メッセージが処理されるように、「場所」=>ふるい評価は、種々の異なる点で行うことができます。こちらの商品は、スクリプトを評価しているサービスの種類に関する追加情報を提供します。可能な値は、ふるいを意味する「MTA」は、評価が「MUA」は、メール配送エージェントによって実行される評価はメールユーザエージェントによって実行されている意味とされている意味、メッセージ転送エージェント、「MDA」によって評価されています「MS」は、意味の評価は、メッセージストアによって実行されています。これらの用語に関する追加情報や背景は[EMAIL-ARCH]で見つけることができます。"
    },
    {
      "indent": 4,
      "text": "\"name\" => The product name associated with the Sieve interpreter.",
      "ja": "ふるいインタプリタに関連する「名前」=>製品名。"
    },
    {
      "indent": 4,
      "text": "\"phase\" => The point relative to final delivery where the Sieve script is being evaluated. Possible values are \"pre\", \"during\", and \"post\", referring respectively to processing before, during, and after final delivery has taken place.",
      "ja": "「相」Sieveスクリプトが評価されている最終的な送達に対する=>ポイント。可能な値は、「前」、「中に」であり、「ポスト」、中に、前処理をそれぞれ参照し、最終的な配信が行われた後。"
    },
    {
      "indent": 4,
      "text": "\"remote-host\" => Host name of remote SMTP/LMTP/Submission client expressed as a Fully Qualified Domain Name (FQDN), if applicable and available. The empty string will be returned if for some reason this information cannot be obtained for the current client.",
      "ja": "適用および利用できる場合は、「リモート・ホストは」=>リモートSMTP / LMTP /提出クライアントのホスト名、完全修飾ドメイン名（FQDN）のように表します。何らかの理由でこの情報は、現在のクライアントのために取得できない場合は、空の文字列が返されます。"
    },
    {
      "indent": 4,
      "text": "\"remote-ip\" => IP address of remote SMTP/LMTP/Submission client, if applicable and available. IPv4, IPv6, and other types of addresses are respectively represented in the formats defined by the IPv4-address-literal, IPv6-address-literal, and General-address-literal productions defined in Section 4.1.3 of [RFC2821].",
      "ja": "\"リモート-IP\" リモートSMTP / LMTP /提出クライアント、該当すると利用可能な場合の=> IPアドレス。 IPv4、IPv6、およびアドレスの他のタイプは、それぞれのIPv4アドレスリテラル、IPv6のアドレスリテラルによって定義された形式で表され、[RFC2821]のセクション4.1.3で定義された一般的なアドレスリテラル制作されています。"
    },
    {
      "indent": 4,
      "text": "\"version\" => The product version associated with the Sieve interpreter. The meaning of the product version string is product-specific and should always be considered in the context of the product name given by the \"name\" item.",
      "ja": "ふるいインタプリタに関連する「バージョン」=>製品のバージョン。製品のバージョン文字列の意味は製品固有であり、常に「名前」の項目で、特定の製品名の文脈で考えるべきです。"
    },
    {
      "indent": 3,
      "text": "Implementations SHOULD support as many of the items on this initial list as possible. Additional standardized items can only be defined in standards-track or experimental RFCs.",
      "ja": "実装は、可能な限り、この最初のリストの項目の多くをサポートする必要があります。追加の標準化されたアイテムのみが標準化過程または実験RFCで定義することができます。"
    },
    {
      "indent": 0,
      "text": "4.2. Vendor-defined Environment Items",
      "section_title": true,
      "ja": "4.2。ベンダー定義の環境アイテム"
    },
    {
      "indent": 3,
      "text": "Environment item names beginning with \"vnd.\" represent vendor-defined extensions. Such extensions are not defined by Internet standards or RFCs, but are still registered with IANA in order to prevent conflicts.",
      "ja": "始まる環境項目名「VND。」ベンダー定義の拡張機能を表します。このような拡張機能は、インターネット標準やRFCで定義されていないが、それでも競合を回避するために、IANAに登録されています。"
    },
    {
      "indent": 0,
      "text": "4.3. IANA Registration of Environment Items",
      "section_title": true,
      "ja": "4.3。環境項目のIANA登録"
    },
    {
      "indent": 3,
      "text": "A registry of environment items is provided by IANA. Item names may be registered on a first-come, first-served basis.",
      "ja": "環境項目の登録はIANAによって提供されます。項目名は、先着順に登録することができます。"
    },
    {
      "indent": 3,
      "text": "Groups of items defined in a standards track or experimental RFC MAY choose to use a common name prefix of the form \"name.\", where \"name\" is a string that identifies the group of related items.",
      "ja": "標準トラックや実験的RFCで定義された項目のグループは、フォームの共通名の接頭辞を使用することを選択するかもしれない「名前を。」、「名前」は、関連項目のグループを識別する文字列です。"
    },
    {
      "indent": 3,
      "text": "Items not defined in a standards track or experimental RFC MUST have a name that begins with the \"vnd.\" prefix, and this prefix is followed by the name of the vendor or product, such as \"vnd.acme.rocket-sled-status\".",
      "ja": "標準トラックや実験的RFCで定義されていない項目はで始まる名前がなければならない「VNDを。」接頭辞、そしてこのプレフィックスは、このような「vnd.acme.rocket-そりステータス」として、ベンダーや製品の名前が続いています。"
    },
    {
      "indent": 0,
      "text": "4.3.1. Template for Environment Registrations",
      "section_title": true,
      "ja": "4.3.1。環境登録のテンプレート"
    },
    {
      "indent": 3,
      "text": "The following template is to be used for registering new Sieve environment item names with IANA.",
      "ja": "次のテンプレートは、IANAに新しいふるい環境項目名を登録するために使用されるべきです。"
    },
    {
      "indent": 6,
      "text": "To: iana@iana.org Subject: Registration of new Sieve environment item",
      "ja": "To：iana@iana.org件名：新しいふるい環境項目の登録"
    },
    {
      "indent": 6,
      "text": "Item name: [the string for use in the 'environment' test] Description: [a brief description of the semantics of the value the item returns]",
      "ja": "項目名：説明[「環境」テストで使用する文字列]：[値の意味を簡単に説明項目に戻ります]"
    },
    {
      "indent": 6,
      "text": "RFC number: [for extensions published as RFCs] Contact address: [email and/or physical address to contact for additional information]",
      "ja": "RFC番号：連絡先アドレス[RFCとして公表の拡張のために]：[電子メールおよび/または物理アドレスの追加情報については、接触します]"
    },
    {
      "indent": 3,
      "text": "Multiple items and descriptions MAY be specified in a single registration request. Both standardized and vendor-defined items use this form.",
      "ja": "複数の項目と説明は、単一の登録要求に指定することができます。両方の標準化ベンダー定義された項目は、このフォームを使用します。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "The environment extension may be used to obtain information about the system the Sieve implementation is running on. This information in turn may reveal details about service provider or enterprise infrastructure.",
      "ja": "環境の拡張は、ふるいの実装が実行されているシステムに関する情報を取得するために使用することができます。順番にこの情報は、サービスプロバイダーやエンタープライズインフラストラクチャの詳細を明らかにすることができます。"
    },
    {
      "indent": 3,
      "text": "An implementation can use any technique to determine the remote-host environment item defined in this specification, and the trustworthiness of the result will vary. One common method will be to perform a PTR DNS lookup on the client IP address. This information may come from an untrusted source. For example, the test:",
      "ja": "実装は、本明細書で定義されたリモート・ホスト環境の項目を決定するために、任意の技術を使用することができ、その結果の信頼性は変化するであろう。 1つの一般的な方法は、クライアントのIPアドレスにPTRのDNSルックアップを実行することになります。この情報は、信頼できないソースから来るかもしれません。たとえば、テスト："
    },
    {
      "indent": 5,
      "text": "if environment :matches \"remote-host\" \"*.example.com\" { ... }",
      "ja": "環境の場合：マッチ「リモート・ホスト」「* .example.comと」{...}"
    },
    {
      "indent": 3,
      "text": "is not a good way to test whether the message came from \"outside\" because anyone who can create a PTR record can create one that refers to whatever domain they choose.",
      "ja": "PTRレコードを作成することができ、誰もが、彼らが選ぶどんなドメインを指すものを作成することができますので、メッセージは「外」から来たかどうかをテストするための良い方法ではありません。"
    },
    {
      "indent": 3,
      "text": "All of the security considerations given in the base Sieve specification also apply to this extension.",
      "ja": "基本ふるい仕様で与えられたセキュリティ上の考慮事項のすべても、この拡張に適用されます。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "The following template specifies the IANA registration of the Sieve extension specified in this document:",
      "ja": "次のテンプレートは、この文書で指定されたSieve拡張のIANA登録を指定します。"
    },
    {
      "indent": 6,
      "text": "To: iana@iana.org Subject: Registration of new Sieve extension",
      "ja": "To：iana@iana.org件名：新しいふるい拡張の登録"
    },
    {
      "indent": 6,
      "text": "Capability name: environment Description: The \"environment\" extension provides a new environment test that can be used to implement scripts that behave differently when moved from one system to another or otherwise operated in different contexts. RFC number: RFC 5183 Contact address: Sieve discussion list <ietf-mta-filters@imc.org>",
      "ja": "能力名：環境説明：「環境」拡張子があるシステムから別のシステムに移動するか、そうでない場合は異なるコンテキストで操作したときに異なる動作をするスクリプトを実装するために使用することができ、新しい環境のテストを提供します。 RFC番号：RFC 5183連絡先アドレス：ふるいディスカッションリスト<ietf-mta-filters@imc.org>"
    },
    {
      "indent": 3,
      "text": "This specification also defines a new IANA registry for Sieve environment item names. The specifics of this registry are given in Section 4.3. The initial contents of the registry are given in the following section.",
      "ja": "また、この仕様はふるい環境項目名のための新しいIANAレジストリを定義します。このレジストリの詳細は、セクション4.3に記載されています。レジストリの初期の内容は、次のセクションに記載されています。"
    },
    {
      "indent": 0,
      "text": "6.1. Initial Environment Item Registrations",
      "section_title": true,
      "ja": "6.1。初期環境項目の登録"
    },
    {
      "indent": 3,
      "text": "The following template specifies the initial IANA registrations for the environment items defined in this document:",
      "ja": "次のテンプレートは、この文書で定義された環境項目の最初のIANA登録を指定します。"
    },
    {
      "indent": 6,
      "text": "To: iana@iana.org Subject: Registration of new Sieve environment items",
      "ja": "To：iana@iana.org件名：新しいふるい環境項目の登録"
    },
    {
      "indent": 6,
      "text": "Capability name: domain Description: The primary DNS domain associated with the Sieve execution context, usually but not always a proper suffix of the host name.",
      "ja": "能力名：ドメイン説明：ふるいの実行コンテキストに関連付けられたプライマリDNSドメイン、通常、常にではないが、ホスト名の適切な接尾辞。"
    },
    {
      "indent": 6,
      "text": "Capability name: host Description: The fully-qualified domain name of the host where the Sieve script is executing.",
      "ja": "能力名：ホスト説明：Sieveスクリプトが実行されているホストの完全修飾ドメイン名。"
    },
    {
      "indent": 6,
      "text": "Capability name: location Description: Type of service executing the Sieve script.",
      "ja": "能力名：場所説明：Sieveスクリプトを実行するサービスのタイプ。"
    },
    {
      "indent": 6,
      "text": "Capability name: name Description: The product name associated with the Sieve interpreter.",
      "ja": "能力名：名説明：ふるいインタプリタに関連付けられている製品名。"
    },
    {
      "indent": 6,
      "text": "Capability name: phase Description: Point relative to final delivery at which the Sieve script is being evaluated.",
      "ja": "機能名：相説明：ポイントSieveスクリプトが評価されている時に、最終的な送達に対して。"
    },
    {
      "indent": 6,
      "text": "Capability name: remote-host Description: Host name of remote SMTP client, if applicable and available.",
      "ja": "能力名：リモート・ホストの説明：該当し、利用可能な場合は、リモートSMTPクライアントのホスト名。"
    },
    {
      "indent": 6,
      "text": "Capability name: remote-ip Description: IP address of remote SMTP client, if applicable and available.",
      "ja": "能力名：リモート-IP説明：リモートSMTPクライアントのIPアドレス、該当すると利用可能な場合。"
    },
    {
      "indent": 6,
      "text": "Capability name: version Description: The product version associated with the Sieve interpreter.",
      "ja": "能力名：version説明：ふるいインタプリタに関連した製品のバージョン。"
    },
    {
      "indent": 6,
      "text": "RFC number: RFC 5183 Contact address: Sieve discussion list <ietf-mta-filters@imc.org>",
      "ja": "RFC番号：RFC 5183連絡先アドレス：ふるいディスカッションリスト<ietf-mta-filters@imc.org>"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7.参考"
    },
    {
      "indent": 0,
      "text": "7.1. Normative references",
      "section_title": true,
      "ja": "7.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2821] Klensin, J., \"Simple Mail Transfer Protocol\", RFC 2821, April 2001.",
      "ja": "[RFC2821] Klensin、J.、 \"簡易メール転送プロトコル\"、RFC 2821、2001年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC5228] Guenther, P. and T. Showalter, \"Sieve: An Email Filtering Language\", RFC 5228, January 2008.",
      "ja": "[RFC5228]ギュンター、P.およびT.ショーウォルター監督、 \"ふるい：メールフィルタリング言語\"、RFC 5228、2008年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC5231] Segmuller, W. and B. Leiba, \"Sieve Email Filtering: Relational Extension\", RFC 5231, January 2008.",
      "ja": "[RFC5231] Segmuller、W.及びB. Leiba、 \"ふるいメールフィルタリング：リレーショナル拡張\"、RFC 5231、2008年1月。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative references",
      "section_title": true,
      "ja": "7.2。有益な参考文献"
    },
    {
      "indent": 3,
      "text": "[EMAIL-ARCH] Crocker, D., \"Internet Mail Architecture\", Work in Progress, February 2008.",
      "ja": "[EMAIL-ARCH]クロッカー、D.、 \"インターネットメールのアーキテクチャ\"、進歩、2008年2月に作業。"
    },
    {
      "indent": 3,
      "text": "[RFC3501] Crispin, M., \"INTERNET MESSAGE ACCESS PROTOCOL - VERSION 4rev1\", RFC 3501, March 2003.",
      "ja": "[RFC3501]のCrispin、M.、 \"インターネットメッセージアクセスプロトコル -  VERSION 4rev1\"、RFC 3501、2003年3月。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Acknowledgements",
      "ja": "付録A.謝辞"
    },
    {
      "indent": 3,
      "text": "Brian Carpenter, Dave Crocker, Cyrus Daboo, Philip Guenther, Kjetil Torgrim Homme, John Klensin, Mark Mallett, Alexey Melnikov, and Dilyan Palauzo provided helpful suggestions and corrections.",
      "ja": "ブライアン・カーペンター、デイブ・クロッカー、サイラスDaboo、フィリップ・ギュンター、はKjetil Torgrimオム、ジョン・クレンシン、マーク・マレット、アレクセイ・メルニコフ、およびDilyan Palauzoは有益な提案や修正を提供しました。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Ned Freed Sun Microsystems 3401 Centrelake Drive, Suite 410 Ontario, CA 92761-1205 USA",
      "ja": "ネッドフリードSun Microsystemsの3401 Centrelakeドライブ、スイート410、オンタリオ、カリフォルニア州92761から1205 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 909 457 4293 EMail: ned.freed@mrochek.com",
      "ja": "電話：+1 909 457 4293 Eメール：ned.freed@mrochek.com"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The IETF Trust (2008).",
      "ja": "著作権（C）IETFトラスト（2008）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "この文書では、BCP 78に含まれる権利と許可と制限の適用を受けており、その中の記載を除いて、作者は彼らのすべての権利を保有します。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE IETF TRUST AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とCONTRIBUTOR「そのまま」、ORGANIZATION HE / SHEが表すまたはインターネットSOCIETY、（もしあれば）を後援し、IETF TRUST ANDインターネットエンジニアリングタスクフォース放棄ALLに設けられています。保証は、明示または黙示、この情報の利用および特定目的に対する権利または商品性または適合性の黙示の保証を侵害しない任意の保証がこれらに限定されません。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、本書またはそのような権限下で、ライセンスがたりないかもしれない程度に記載された技術の実装や使用に関係すると主張される可能性があります任意の知的財産権やその他の権利の有効性または範囲に関していかなる位置を取りません利用可能です。またそれは、それがどのような権利を確認する独自の取り組みを行ったことを示すものでもありません。 RFC文書の権利に関する手続きの情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IPRの開示のコピーが利用できるようにIETF事務局とライセンスの保証に行われた、または本仕様の実装者または利用者がそのような所有権の使用のための一般的なライセンスまたは許可を取得するために作られた試みの結果を得ることができますhttp://www.ietf.org/iprのIETFのオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、その注意にこの標準を実装するために必要とされる技術をカバーすることができる任意の著作権、特許または特許出願、またはその他の所有権を持ってすべての利害関係者を招待します。 ietf-ipr@ietf.orgのIETFに情報を記述してください。"
    }
  ]
}