{
  "title": {
    "text": "RFC 5943 - A Dedicated Routing Policy Specification Language Interface Identifier for Operational Testing",
    "ja": "RFC 5943 - 運用テスト用の専用ルーティングポリシー仕様言語インターフェイス識別子"
  },
  "number": 5943,
  "created_at": "2023-01-25 19:17:46.480138+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                  B. Haberman, Ed.\nRequest for Comments: 5943                                       JHU APL\nCategory: Standards Track                                    August 2010\nISSN: 2070-1721",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 1,
      "text": "A Dedicated Routing Policy Specification Language Interface Identifier for Operational Testing",
      "ja": "運用テスト用の専用ルーティングポリシー仕様言語インターフェイス識別子"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "The deployment of new IP connectivity typically results in intermittent reachability for numerous reasons that are outside the scope of this document. In order to aid in the debugging of these persistent problems, this document proposes the creation of a new Routing Policy Specification Language attribute that allows a network to advertise an IP address that is reachable and can be used as a target for diagnostic tests (e.g., pings).",
      "ja": "通常、新しいIP接続の展開は、このドキュメントの範囲外のさまざまな理由で、断続的な到達可能性をもたらします。これらの永続的な問題のデバッグを支援するために、このドキュメントは、ネットワークが到達可能で診断テストのターゲットとして使用できるIPアドレスを宣伝できる新しいルーティングポリシー仕様言語属性の作成を提案します（例えば、pings）。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準トラックドキュメントです。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントは、インターネットエンジニアリングタスクフォース（IETF）の製品です。IETFコミュニティのコンセンサスを表しています。公開レビューを受けており、インターネットエンジニアリングステアリンググループ（IESG）からの出版が承認されています。インターネット標準の詳細については、RFC 5741のセクション2で入手できます。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc5943.",
      "ja": "このドキュメントの現在のステータス、任意のERRATA、およびそのフィードバックを提供する方法に関する情報は、http：//www.rfc-editor.org/info/rfc5943で取得できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2010 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2010 IETF Trustおよび文書著者として特定された人。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "このドキュメントは、BCP 78およびIETFドキュメント（http://trustee.ietf.org/license-info）に関連するIETF Trustの法的規定の対象となります。この文書に関するあなたの権利と制限を説明するので、これらの文書を注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、セクション4.Eで説明されている法的規定のセクション4.Eで説明されており、単純化されたBSDライセンスで説明されているように保証なしで提供される簡略化されたBSDライセンステキストを含める必要があります。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . . . 2\n2.  RPSL Extension for Diagnostic Address . . . . . . . . . . . . . 2\n3.  Using the RPSL Pingable Attribute . . . . . . . . . . . . . . . 3\n4.  Security Considerations . . . . . . . . . . . . . . . . . . . . 3\n5.  Acknowledgements  . . . . . . . . . . . . . . . . . . . . . . . 4\n6.  Normative References  . . . . . . . . . . . . . . . . . . . . . 4",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The deployment of new IP connectivity typically results in intermittent reachability for numerous reasons that are outside the scope of this document. In order to aid in the debugging of these persistent problems, this document proposes the creation of a new Routing Policy Specification Language attribute [RFC4012] that allows a network to advertise an IP address that is reachable and can be used as a target for diagnostic tests (e.g., pings).",
      "ja": "通常、新しいIP接続の展開は、このドキュメントの範囲外のさまざまな理由で、断続的な到達可能性をもたらします。これらの永続的な問題のデバッグを支援するために、このドキュメントは、ネットワークが到達可能で診断テストのターゲットとして使用できるIPアドレスを宣伝できる新しいルーティングポリシー仕様言語属性[RFC4012]の作成を提案しています。（例：pings）。"
    },
    {
      "indent": 3,
      "text": "The goal of this diagnostic address is to provide operators a means to advertise selected hosts that can be targets of tests for such common issues as reachability and Path MTU discovery.",
      "ja": "この診断アドレスの目標は、オペレーターに、到達可能性やPATH MTU発見などの一般的な問題のテストのターゲットになる可能性のある選択したホストを宣伝する手段を提供することです。"
    },
    {
      "indent": 3,
      "text": "The capitalized key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "大文字のキーワード「必須」、「必要」、「必須」、「shall」、「shall \"、\" shall \"、\" should \"、\" nove \"、\" becommended \"、\" may \"、および\" optional \"[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. RPSL Extension for Diagnostic Address",
      "section_title": true,
      "ja": "2. 診断アドレスのRPSL拡張"
    },
    {
      "indent": 3,
      "text": "Network operators wishing to provide a diagnostic address for their peers, customers, etc., MAY advertise its existence via the Routing Policy Specification Language [RFC4012] [RFC2622]. The pingable attribute is a member of the route and route6 objects in the RPSL. The definition of the pingable attribute is shown in Figure 1.",
      "ja": "同僚や顧客などに診断アドレスを提供したいネットワークオペレーターは、ルーティングポリシー仕様言語[RFC4012] [RFC2622]を介してその存在を宣伝できます。pingable属性は、RPSLのルートおよびルート6オブジェクトのメンバーです。pingable属性の定義を図1に示します。"
    },
    {
      "indent": 3,
      "text": "+-----------+-------------------+--------------+\n| Attribute |       Value       |    Type      |\n+-----------+-------------------+--------------+\n|  pingable | <ipv6-address> or |  optional,   |\n|           | <ipv4-address>    | multi-valued |\n+-----------+-------------------+--------------+\n|  ping-hdl |   <nic-handle>    |  optional,   |\n|           |                   | multi-valued |\n+-----------+-------------------+--------------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 16,
      "text": "Figure 1: Pingable Attribute Specification",
      "ja": "図1：pingable属性仕様"
    },
    {
      "indent": 3,
      "text": "The exact definitions of <ipv4-address> and <nic-handle> can be found in [RFC2622], while the definition of <ipv6-address> is in [RFC4012].",
      "ja": "<ipv4-address>および<nichandle>の正確な定義は[rfc2622]に記載されていますが、<ipv6-address>の定義は[rfc4012]にあります。"
    },
    {
      "indent": 3,
      "text": "The pingable attribute allows a network operator to advertise an IP address of a node that should be reachable from outside networks. This node can be used as a destination address for diagnostic tests. The address specified MUST fall within the IP address range advertised in the route/route6 object containing the pingable attribute. The ping-hdl provides a link to contact information for an entity capable of responding to queries concerning the specified IP address. An example of using the pingable attribute is shown in Figure 2.",
      "ja": "Pingable属性により、ネットワークオペレーターは、外部ネットワークから到達可能なノードのIPアドレスを宣伝できます。このノードは、診断テストの宛先アドレスとして使用できます。指定されたアドレスは、pingable属性を含むルート/route6オブジェクトに宣伝されているIPアドレス範囲内に該当する必要があります。Ping-HDLは、指定されたIPアドレスに関するクエリに応答できるエンティティの連絡先情報へのリンクを提供します。pingable属性を使用する例を図2に示します。"
    },
    {
      "indent": 3,
      "text": "route6: 2001:DB8::/32\norigin: AS64500\npingable: 2001:DB8::DEAD:BEEF\nping-hdl: OPS4-RIPE",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 19,
      "text": "Figure 2: Pingable Attribute Example",
      "ja": "図2：pingable属性の例"
    },
    {
      "indent": 0,
      "text": "3. Using the RPSL Pingable Attribute",
      "section_title": true,
      "ja": "3. RPSLピン可能な属性を使用します"
    },
    {
      "indent": 3,
      "text": "The presence of one or more pingable attributes signals to network operators that the operator of the target network is providing the address(es) for external diagnostic testing. Tests involving the advertised address(es) SHOULD be rate limited to no more than ten probes in a five-minute window unless prior arrangements are made with the maintainer of the attribute.",
      "ja": "1つ以上のpingable属性の存在は、ターゲットネットワークのオペレーターが外部診断テストのためにアドレスを提供していることをネットワーク演算子に信号します。宣伝されたアドレスを含むテストは、属性の保守者との事前の取り決めが行われない限り、5分間のウィンドウで10回以下のプローブに制限される必要があります。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "The use of routing registries based on RPSL requires a significant level of security. In-depth discussion of the authentication and authorization capabilities and weaknesses within RPSL is in [RFC2725]. The application of authentication in RPSL is key considering the vulnerabilities that may arise from the abuse of the pingable attribute by nefarious actors. Additional RPSL security issues are discussed in the Security Considerations sections of [RFC2622] and [RFC4012].",
      "ja": "RPSLに基づいたルーティングレジストリの使用には、かなりのレベルのセキュリティが必要です。RPSL内の認証と承認の能力と短所に関する詳細な議論は[RFC2725]にあります。RPSLにおける認証の適用は、悪意のある主体によるpingable属性の乱用から生じる可能性のある脆弱性を考慮して重要です。追加のRPSLセキュリティの問題は、[RFC2622]および[RFC4012]のセキュリティに関する考慮事項セクションで説明されています。"
    },
    {
      "indent": 3,
      "text": "The publication of this attribute only explicitly signals the availability of an ICMP Echo Request/Echo Response service on the specified IP address. The operator, at his/her discretion, MAY deploy other services at the same IP address. These services may be impacted by the ping service, given its publicity via the RPSL.",
      "ja": "この属性の公開は、指定されたIPアドレスでのICMPエコーリクエスト/エコー応答サービスの可用性を明示的に示しています。オペレーターは、彼/彼女の裁量により、同じIPアドレスに他のサービスを展開できます。これらのサービスは、RPSLを介した宣伝を考えると、Pingサービスの影響を受ける可能性があります。"
    },
    {
      "indent": 3,
      "text": "While this document specifies that external users of the pingable attribute rate limit their probes, there is no guarantee that they will do so. Operators publicizing a pingable attribute are encouraged to deploy their own rate limiting for the advertised IP address in order to reduce the risk of a denial-of-service attack. Services, protocols, and ports on the advertised IP address should be filtered if they are not intended for external users.",
      "ja": "このドキュメントは、pingable属性レートの外部ユーザーがプローブを制限することを指定していますが、それらがそうするという保証はありません。pingable属性を宣伝するオペレーターは、サービス拒否攻撃のリスクを減らすために、広告されたIPアドレスに制限する独自のレートを展開することをお勧めします。広告されたIPアドレスのサービス、プロトコル、およびポートは、外部ユーザーを対象としていない場合は、フィルタリングする必要があります。"
    },
    {
      "indent": 0,
      "text": "5. Acknowledgements",
      "section_title": true,
      "ja": "5. 謝辞"
    },
    {
      "indent": 3,
      "text": "Randy Bush and David Farmer provided the original concept for the pingable attribute and useful comments on preliminary versions of this document. Joe Abley provided comments that justified moving the attribute to the route/route6 object and the inclusion of a point of contact. Larry Blunk, Tony Tauber, David Harrington, Nicolas Williams, Sean Turner, and Peter Saint-Andre provided useful comments to improve the document.",
      "ja": "Randy BushとDavid Farmerは、この文書の予備バージョンに関するPingable属性の元のコンセプトと有用なコメントを提供しました。Joe Ableyは、属性をRoute/Route6オブジェクトに移動し、コンタクトポイントを含めることを正当化するコメントを提供しました。ラリー・ブランク、トニー・タウバー、デビッド・ハリントン、ニコラス・ウィリアムズ、ショーン・ターナー、ピーター・セント・アンドレは、文書を改善するために有用なコメントを提供しました。"
    },
    {
      "indent": 0,
      "text": "6. Normative References",
      "section_title": true,
      "ja": "6. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119] Bradner、S。、「要件レベルを示すためにRFCで使用するためのキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2622] Alaettinoglu, C., Villamizar, C., Gerich, E., Kessens, D., Meyer, D., Bates, T., Karrenberg, D., and M. Terpstra, \"Routing Policy Specification Language (RPSL)\", RFC 2622, June 1999.",
      "ja": "[RFC2622] Alaettinoglu、C.、Villamizar、C.、Gerich、E.、Kessens、D.、Meyer、D.、Bates、T.、Karrenberg、D。、およびM. Terpstra、「ルーティングポリシー仕様言語（RPSL））」、RFC 2622、1999年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC2725] Villamizar, C., Alaettinoglu, C., Meyer, D., and S. Murphy, \"Routing Policy System Security\", RFC 2725, December 1999.",
      "ja": "[RFC2725] Villamizar、C.、Alaettinoglu、C.、Meyer、D。、およびS. Murphy、「ルーティングポリシーシステムセキュリティ」、RFC 2725、1999年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC4012] Blunk, L., Damas, J., Parent, F., and A. Robachevsky, \"Routing Policy Specification Language next generation (RPSLng)\", RFC 4012, March 2005.",
      "ja": "[RFC4012] Blunk、L.、Damas、J.、Parent、F。、およびA. Robachevsky、「ルーティングポリシー仕様言語次世代（RPSLNG）」、RFC 4012、2005年3月。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者の連絡先"
    },
    {
      "indent": 3,
      "text": "Brian Haberman (editor) Johns Hopkins University Applied Physics Lab 11100 Johns Hopkins Road Laurel, MD 20723-6099 US",
      "ja": "ブライアンハーバーマン（編集者）ジョンズホプキンス大学応用物理学ラボ11100ジョンズホプキンスロードローレル、メリーランド20723-6099 US"
    },
    {
      "indent": 3,
      "text": "Phone: +1 443 778 1319\nEMail: brian@innovationslab.net",
      "raw": true,
      "ja": ""
    }
  ]
}