{
  "title": {
    "text": "RFC 5960 - MPLS Transport Profile Data Plane Architecture",
    "ja": "RFC 5960 - MPLS輸送プロファイルデータプレーンアーキテクチャ"
  },
  "number": 5960,
  "created_at": "2023-01-23 21:17:46.341879+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                     D. Frost, Ed.\nRequest for Comments: 5960                                S. Bryant, Ed.\nCategory: Standards Track                                  Cisco Systems\nISSN: 2070-1721                                            M. Bocci, Ed.\n                                                          Alcatel-Lucent\n                                                             August 2010",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 13,
      "text": "MPLS Transport Profile Data Plane Architecture",
      "ja": "MPLS輸送プロファイルデータプレーンアーキテクチャ"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "The Multiprotocol Label Switching Transport Profile (MPLS-TP) is the set of MPLS protocol functions applicable to the construction and operation of packet-switched transport networks. This document specifies the subset of these functions that comprises the MPLS-TP data plane: the architectural layer concerned with the encapsulation and forwarding of packets within an MPLS-TP network.",
      "ja": "マルチプロトコルラベルスイッチングトランスポートプロファイル（MPLS-TP）は、パケットスイッチされた輸送ネットワークの構築と動作に適用されるMPLSプロトコル関数のセットです。このドキュメントは、MPLS-TPデータプレーン、MPLS-TPネットワーク内のパケットの転送に関係するMPLS-TPデータプレーンを含むこれらの機能のサブセットを指定します。"
    },
    {
      "indent": 3,
      "text": "This document is a product of a joint Internet Engineering Task Force (IETF) / International Telecommunication Union Telecommunication Standardization Sector (ITU-T) effort to include an MPLS Transport Profile within the IETF MPLS and Pseudowire Emulation Edge-to-Edge (PWE3) architectures to support the capabilities and functionalities of a packet transport network.",
      "ja": "このドキュメントは、IETF MPLSおよびPSEUDOWIREエミュレーションエッジ（PWE3）アーキテクチャ内にMPLS輸送プロファイルを含めるための共同インターネットエンジニアリングタスクフォース（IETF） /国際電気通信連合電気通信標準化セクター（ITU-T）の製品です。パケット輸送ネットワークの機能と機能をサポートする。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準トラックドキュメントです。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントは、インターネットエンジニアリングタスクフォース（IETF）の製品です。IETFコミュニティのコンセンサスを表しています。公開レビューを受けており、インターネットエンジニアリングステアリンググループ（IESG）からの出版が承認されています。インターネット標準の詳細については、RFC 5741のセクション2で入手できます。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc5960.",
      "ja": "このドキュメントの現在のステータス、任意のERRATA、およびそのフィードバックを提供する方法に関する情報は、http：//www.rfc-editor.org/info/rfc5960で取得できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2010 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2010 IETF Trustおよび文書著者として特定された人。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "このドキュメントは、BCP 78およびIETFドキュメント（http://trustee.ietf.org/license-info）に関連するIETF Trustの法的規定の対象となります。この文書に関するあなたの権利と制限を説明するので、これらの文書を注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、セクション4.Eで説明されている法的規定のセクション4.Eで説明されており、単純化されたBSDライセンスで説明されているように保証なしで提供される簡略化されたBSDライセンステキストを含める必要があります。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  3\n  1.1.  Scope  . . . . . . . . . . . . . . . . . . . . . . . . . .  3\n  1.2.  Terminology  . . . . . . . . . . . . . . . . . . . . . . .  4\n  1.3.  Requirements Language  . . . . . . . . . . . . . . . . . .  4\n2.  MPLS-TP Packet Encapsulation and Forwarding  . . . . . . . . .  4\n3.  MPLS-TP Transport Entities . . . . . . . . . . . . . . . . . .  5\n  3.1.  Label Switched Paths . . . . . . . . . . . . . . . . . . .  5\n    3.1.1.  LSP Packet Encapsulation and Forwarding  . . . . . . .  6\n    3.1.2.  LSP Payloads . . . . . . . . . . . . . . . . . . . . .  7\n    3.1.3.  LSP Types  . . . . . . . . . . . . . . . . . . . . . .  7\n  3.2.  Sections . . . . . . . . . . . . . . . . . . . . . . . . .  8\n  3.3.  Pseudowires  . . . . . . . . . . . . . . . . . . . . . . .  9\n4.  MPLS-TP Generic Associated Channel . . . . . . . . . . . . . . 10\n5.  Server-Layer Considerations  . . . . . . . . . . . . . . . . . 11\n6.  Security Considerations  . . . . . . . . . . . . . . . . . . . 11\n7.  References . . . . . . . . . . . . . . . . . . . . . . . . . . 12\n  7.1.  Normative References . . . . . . . . . . . . . . . . . . . 12\n  7.2.  Informative References . . . . . . . . . . . . . . . . . . 14",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The MPLS Transport Profile (MPLS-TP) is the set of functions that meet the requirements [RFC5654] for the application of MPLS to the construction and operation of packet-switched transport networks. MPLS-based packet-switched transport networks, and the overall architecture of the MPLS-TP, are defined and described in [RFC5921]. It is assumed that the reader is familiar with that document.",
      "ja": "MPLS輸送プロファイル（MPLS-TP）は、パケットスイッチされた輸送ネットワークの構築と動作にMPLSを適用するための要件[RFC5654]を満たす関数のセットです。MPLSベースのパケットスイッチ輸送ネットワーク、およびMPLS-TPの全体的なアーキテクチャは、[RFC5921]で定義および説明されています。読者はそのドキュメントに精通していると想定されています。"
    },
    {
      "indent": 3,
      "text": "This document defines the set of functions that comprise the MPLS-TP data plane: the architectural layer concerned with the encapsulation and forwarding of packets within an MPLS-TP network. This layer is based on the data plane architectures for MPLS ([RFC3031] and [RFC3032]) and for pseudowires [RFC3985].",
      "ja": "このドキュメントでは、MPLS-TPデータプレーンを含む関数のセットを定義します。MPLS-TPネットワーク内のパケットのカプセル化と転送に関係するアーキテクチャ層です。このレイヤーは、MPLS（[RFC3031]および[RFC3032]）のデータプレーンアーキテクチャと擬似動物[RFC3985]に基づいています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of a joint Internet Engineering Task Force (IETF) / International Telecommunication Union Telecommunication Standardization Sector (ITU-T) effort to include an MPLS Transport Profile within the IETF MPLS and PWE3 architectures to support the capabilities and functionalities of a packet transport network.",
      "ja": "このドキュメントは、IETF MPLSおよびPWE3アーキテクチャ内にMPLS輸送プロファイルを含めるための共同インターネットエンジニアリングタスクフォース（IETF） /国際電気通信連合電気通信標準化セクター（ITU-T）の製品です。輸送ネットワーク。"
    },
    {
      "indent": 0,
      "text": "1.1. Scope",
      "section_title": true,
      "ja": "1.1. 範囲"
    },
    {
      "indent": 3,
      "text": "This document has the following purposes:",
      "ja": "このドキュメントには次の目的があります。"
    },
    {
      "indent": 3,
      "text": "o To identify the data plane functions within the MPLS Transport Profile; and",
      "ja": "o MPLS輸送プロファイル内のデータプレーン機能を識別する。と"
    },
    {
      "indent": 3,
      "text": "o To indicate which of these data plane functions an MPLS-TP implementation is required to support.",
      "ja": "o これらのデータプレーン機能を示すには、MPLS-TP実装がサポートする必要があります。"
    },
    {
      "indent": 3,
      "text": "This document defines the encapsulation and forwarding functions applicable to packets traversing an MPLS-TP Label Switched Path (LSP), pseudowire (PW), or section (see Section 3 for the definitions of these transport entities). Encapsulation and forwarding functions for packets outside an MPLS-TP LSP, PW, or section, and mechanisms for delivering packets to or from MPLS-TP LSPs, PWs, and sections, are outside the scope of this document.",
      "ja": "このドキュメントでは、MPLS-TPラベルスイッチドパス（LSP）、擬似ワイヤ（PW）、またはセクションを横断するパケットに適用されるカプセル化および転送機能を定義します（これらの輸送エンティティの定義についてはセクション3を参照）。MPLS-TP LSP、PW、またはセクションの外側のパケットのカプセル化と転送機能、およびMPLS-TP LSP、PWS、およびセクションとの間でパケットを配信するためのメカニズムは、このドキュメントの範囲外です。"
    },
    {
      "indent": 0,
      "text": "1.2. Terminology",
      "section_title": true,
      "ja": "1.2. 用語"
    },
    {
      "indent": 3,
      "text": "Term    Definition\n------- -------------------------------------------\nACH     Associated Channel Header\nG-ACh   Generic Associated Channel\nGAL     G-ACh Label\nLER     Label Edge Router\nLSE     Label Stack Entry\nLSP     Label Switched Path\nLSR     Label Switching Router\nMPLS-TP MPLS Transport Profile\nOAM     Operations, Administration, and Maintenance\nPW      Pseudowire\nQoS     Quality of Service\nS-PE    PW Switching Provider Edge\nT-PE    PW Terminating Provider Edge\nTTL     Time To Live",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Additional definitions and terminology can be found in [RFC5921] and [RFC5654].",
      "ja": "追加の定義と用語は、[RFC5921]および[RFC5654]に記載されています。"
    },
    {
      "indent": 0,
      "text": "1.3. Requirements Language",
      "section_title": true,
      "ja": "1.3. 要件言語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "ja": "この文書のキーワード \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", および \"OPTIONAL\" はRFC 2119 [RFC2119]で説明されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. MPLS-TP Packet Encapsulation and Forwarding",
      "section_title": true,
      "ja": "2. MPLS-TPパケットカプセル化と転送"
    },
    {
      "indent": 3,
      "text": "MPLS-TP packet encapsulation and forwarding SHALL operate according to the MPLS data plane architecture described in [RFC3031] and [RFC3032] and to the data plane architectures for single-segment pseudowires and multi-segment pseudowires (see Section 3.3), except as noted otherwise in this document. The MPLS-TP data plane satisfies the requirements specified in [RFC5654].",
      "ja": "MPLS-TPパケットのカプセル化と転送は、[RFC3031]および[RFC3032]に記載されているMPLSデータプレーンアーキテクチャに従って動作し、単一セグメントの擬似ワイヤとマルチセグメントの擬似ワイヤのデータプレーンアーキテクチャ（セクション3.3を参照）を除く場合の場合を除きます。それ以外の場合は、このドキュメントで。MPLS-TPデータプレーンは、[RFC5654]で指定された要件を満たします。"
    },
    {
      "indent": 3,
      "text": "Since an MPLS-TP packet is an MPLS packet as defined in [RFC3031] and [RFC3032], it will have an associated label stack, and the 'push', 'pop', and 'swap' label processing operations specified in those documents apply. The label stack represents a hierarchy of Label Switched Paths (LSPs). A label is pushed to introduce an additional level of LSP hierarchy and popped to remove it. Such an additional level may be introduced by any pair of LSRs, whereupon they become adjacent at this new level, and are then known as Label Edge Routers (LERs) with respect to the new LSP.",
      "ja": "MPLS-TPパケットは[RFC3031]および[RFC3032]で定義されているMPLSパケットであるため、関連するラベルスタック、およびそれらのドキュメントで指定された「プッシュ」、「ポップ」、「スワップ」ラベル処理操作があります。申し込み。ラベルスタックは、ラベルスイッチ付きパス（LSP）の階層を表します。ラベルは、LSP階層の追加レベルを導入するためにプッシュされ、それを削除するためにポップしました。このような追加レベルは、LSRの任意のペアによって導入される場合があり、この新しいレベルで隣接するようになり、新しいLSPに関してラベルエッジルーター（LERS）として知られています。"
    },
    {
      "indent": 3,
      "text": "In contrast to, for example, Section 3.10 of [RFC3031], support for Internet Protocol (IP) host and router data plane functionality by MPLS-TP interfaces and in MPLS-TP networks is OPTIONAL.",
      "ja": "たとえば、[RFC3031]のセクション3.10とは対照的に、MPLS-TPインターフェイスおよびMPLS-TPネットワークでのインターネットプロトコル（IP）ホストおよびルーターデータプレーン機能のサポートはオプションです。"
    },
    {
      "indent": 3,
      "text": "MPLS-TP forwarding is based on the label that identifies an LSP or PW. The label value specifies the processing operation to be performed by the next hop at that level of encapsulation. A swap of this label is an atomic operation in which the contents of the packet (after the swapped label) are opaque to the forwarding function. The only event that interrupts a swap operation is Time To Live (TTL) expiry.",
      "ja": "MPLS-TP転送は、LSPまたはPWを識別するラベルに基づいています。ラベル値は、そのレベルのカプセル化で次のホップによって実行される処理操作を指定します。このラベルの交換は、パケットの内容（スワップラベルの後）が転送機能に不透明である原子操作です。スワップ操作を中断する唯一のイベントは、ライブ（TTL）有効期限です。"
    },
    {
      "indent": 3,
      "text": "At an LSR, S-PE, or T-PE, further processing to determine the context of a packet occurs when a swap operation is interrupted by TTL expiry. If the TTL of an LSP label expires, then the label with the S (Bottom of Stack) bit set is inspected to determine if it is a reserved label. If it is a reserved label, the packet is processed according to the rules of that reserved label. For example, if it is a Generic Associated Channel Label (GAL), then it is processed as a packet on the Generic Associated Channel (G-ACh); see Section 4. If the TTL of a PW expires at an S-PE or T-PE, then the packet is examined to determine if a Generic Associated Channel Header (ACH) is present immediately below the PW label. If so, then the packet is processed as a packet on the G-ACh.",
      "ja": "LSR、S-PE、またはT-PEでは、パケットのコンテキストを決定するためのさらなる処理が、TTLの有効期限によってスワップ操作が中断されたときに発生します。LSPラベルのTTLが期限切れになった場合、S（Stackの下部）ビットセットのあるラベルが検査され、予約ラベルかどうかが判断されます。予約されたラベルの場合、パケットはその予約されたラベルのルールに従って処理されます。たとえば、一般的な関連チャネルラベル（GAL）の場合、一般的な関連チャネル（g-ach）のパケットとして処理されます。セクション4を参照してください。PWのTTLがS-PEまたはT-PEで期限切れになった場合、パケットを調べて、ジェネリック関連チャネルヘッダー（ACH）がPWラベルのすぐ下に存在するかどうかを判断します。その場合、パケットはG-achのパケットとして処理されます。"
    },
    {
      "indent": 3,
      "text": "Similarly, if a pop operation at an LER exposes a reserved label at the top of the label stack, then the packet is processed according to the rules of that reserved label.",
      "ja": "同様に、LERでのポップ操作がラベルスタックの上部に予約ラベルを公開する場合、パケットはその予約されたラベルのルールに従って処理されます。"
    },
    {
      "indent": 3,
      "text": "If no such exception occurs, the packet is forwarded according to the procedures in [RFC3031] and [RFC3032].",
      "ja": "そのような例外が発生しない場合、パケットは[RFC3031]および[RFC3032]の手順に従って転送されます。"
    },
    {
      "indent": 0,
      "text": "3. MPLS-TP Transport Entities",
      "section_title": true,
      "ja": "3. MPLS-TP輸送エンティティ"
    },
    {
      "indent": 3,
      "text": "The MPLS Transport Profile includes the following data plane transport entities:",
      "ja": "MPLS輸送プロファイルには、次のデータプレーントランスポートエンティティが含まれています。"
    },
    {
      "indent": 3,
      "text": "o Label Switched Paths (LSPs)",
      "ja": "o ラベルスイッチ付きパス（LSP）"
    },
    {
      "indent": 3,
      "text": "o sections",
      "ja": "o セクション"
    },
    {
      "indent": 3,
      "text": "o pseudowires (PWs)",
      "ja": "o Pseudowires（PWS）"
    },
    {
      "indent": 0,
      "text": "3.1. Label Switched Paths",
      "section_title": true,
      "ja": "3.1. ラベルスイッチ付きパス"
    },
    {
      "indent": 3,
      "text": "MPLS-TP LSPs are ordinary MPLS LSPs as defined in [RFC3031], except as specifically noted otherwise in this document.",
      "ja": "MPLS-TP LSPは、[RFC3031]で定義されている通常のMPLS LSPです。ただし、このドキュメントで特に指摘されている場合を除きます。"
    },
    {
      "indent": 0,
      "text": "3.1.1. LSP Packet Encapsulation and Forwarding",
      "section_title": true,
      "ja": "3.1.1. LSPパケットカプセル化と転送"
    },
    {
      "indent": 3,
      "text": "Encapsulation and forwarding of packets traversing MPLS-TP LSPs MUST follow standard MPLS packet encapsulation and forwarding as defined in [RFC3031], [RFC3032], [RFC5331], and [RFC5332], except as explicitly stated otherwise in this document.",
      "ja": "MPLS-TP LSPを横断するパケットのカプセル化と転送は、[RFC3031]、[RFC3032]、[RFC5331]、および[RFC5332]で定義されているように、標準のMPLSパケットカプセル化と転送に従う必要があります。"
    },
    {
      "indent": 3,
      "text": "Data plane Quality of Service capabilities are included in the MPLS-TP in the form of Traffic Engineered (TE) LSPs [RFC3209] and the MPLS Differentiated Services (Diffserv) architecture [RFC3270]. Both E-LSP and L-LSP MPLS Diffserv modes are included. The Traffic Class field (formerly the EXP field) of an MPLS label follows the definition of [RFC5462] and [RFC3270] and MUST be processed according to the rules specified in those documents.",
      "ja": "データプレーンサービス機能の品質は、MPLS-TPに、トラフィックエンジニアリング（TE）LSP [RFC3209]およびMPLS差別化サービス（DIFFSERV）アーキテクチャ[RFC3270]の形で含まれています。E-LSPおよびL-LSP MPLS DiffServモードの両方が含まれています。MPLSラベルのトラフィッククラスフィールド（以前のEXPフィールド）は、[RFC5462]および[RFC3270]の定義に従い、それらの文書で指定されたルールに従って処理する必要があります。"
    },
    {
      "indent": 3,
      "text": "Except for transient packet reordering that may occur, for example, during fault conditions, packets are delivered in order on L-LSPs, and on E-LSPs within a specific ordered aggregate.",
      "ja": "たとえば、断層条件中に発生する可能性のある一時的なパケットの並べ替えを除き、パケットはL-LSPで、特定の順序付けられた集計内のE-LSPで配信されます。"
    },
    {
      "indent": 3,
      "text": "The Uniform, Pipe, and Short Pipe Diffserv tunneling and TTL processing models described in [RFC3270] and [RFC3443] MAY be used for MPLS-TP LSPs. Note, however, that support for the Pipe or Short Pipe models is REQUIRED for typical transport applications in which the topology and QoS characteristics of the MPLS-TP server layer are independent of the client layer. Specific applications MAY place further requirements on the Diffserv tunneling and TTL processing models an LSP can use.",
      "ja": "[RFC3270]および[RFC3443]で説明されている均一、パイプ、および短パイプDiffservトンネルおよびTTL処理モデルは、MPLS-TP LSPに使用できます。ただし、MPLS-TPサーバーレイヤーのトポロジーとQoS特性がクライアントレイヤーに依存しない典型的な輸送アプリケーションには、パイプまたは短いパイプモデルのサポートが必要であることに注意してください。特定のアプリケーションは、LSPが使用できるDiffServトンネルおよびTTL処理モデルにさらに要件を置く場合があります。"
    },
    {
      "indent": 3,
      "text": "Per-platform, per-interface, or other context-specific label space [RFC5331] MAY be used for MPLS-TP LSPs. Downstream [RFC3031] or upstream [RFC5331] label allocation schemes MAY be used for MPLS-TP LSPs. The requirements of a particular LSP type may, however, dictate which label spaces or allocation schemes LSPs of that type can use.",
      "ja": "プラットフォームごと、インターフェイスごと、またはその他のコンテキスト固有のラベル空間[RFC5331]は、MPLS-TP LSPに使用できます。下流[RFC3031]または上流[RFC5331]ラベル割り当てスキームは、MPLS-TP LSPに使用できます。ただし、特定のLSPタイプの要件は、そのタイプのLSPを使用できるラベルスペースまたは割り当てスキームを決定する場合があります。"
    },
    {
      "indent": 3,
      "text": "Equal-Cost Multi-Path (ECMP) load-balancing MUST NOT be performed on an MPLS-TP LSP. MPLS-TP LSPs as defined in this document MAY operate over a server layer that supports load-balancing, but this load-balancing MUST operate in such a manner that it is transparent to MPLS-TP. This does not preclude the future definition of new MPLS-TP LSP types that have different requirements regarding the use of ECMP in the server layer.",
      "ja": "Equ-Cost Multi-Path（ECMP）負荷分散は、MPLS-TP LSPで実行しないでください。このドキュメントで定義されているMPLS-TP LSPは、負荷分散をサポートするサーバーレイヤーで動作する場合がありますが、この負荷分散は、MPLS-TPに対して透過的であるように動作する必要があります。これは、サーバーレイヤーでのECMPの使用に関して異なる要件を持つ新しいMPLS-TP LSPタイプの将来の定義を排除するものではありません。"
    },
    {
      "indent": 3,
      "text": "Penultimate Hop Popping (PHP) MUST be disabled by default on MPLS-TP LSPs.",
      "ja": "MPLS-TP LSPでデフォルトで無効にする必要があります。"
    },
    {
      "indent": 0,
      "text": "3.1.2. LSP Payloads",
      "section_title": true,
      "ja": "3.1.2. LSPペイロード"
    },
    {
      "indent": 3,
      "text": "The MPLS-TP includes support for the following LSP payload types:",
      "ja": "MPLS-TPには、次のLSPペイロードタイプのサポートが含まれています。"
    },
    {
      "indent": 3,
      "text": "o Network-layer protocol packets (including MPLS-labeled packets)",
      "ja": "o ネットワーク層プロトコルパケット（MPLS標識パケットを含む）"
    },
    {
      "indent": 3,
      "text": "o Pseudowire packets",
      "ja": "o Pseudowireパケット"
    },
    {
      "indent": 3,
      "text": "The rules for processing LSP payloads that are network-layer protocol packets SHALL be as specified in [RFC3032].",
      "ja": "ネットワーク層プロトコルパケットであるLSPペイロードを処理するためのルールは、[RFC3032]で指定されているとおりです。"
    },
    {
      "indent": 3,
      "text": "The rules for processing LSP payloads that are pseudowire packets SHALL be as defined in the data plane pseudowire specifications (see Section 3.3).",
      "ja": "擬似動物パケットであるLSPペイロードを処理するためのルールは、データプレーンの擬似ワイヤの仕様で定義されているものとします（セクション3.3を参照）。"
    },
    {
      "indent": 3,
      "text": "The payload of an MPLS-TP LSP may be a packet that itself contains an MPLS label stack. This is true, for instance, when the payload is a pseudowire or an MPLS LSP. In such cases, the label stack is contiguous between the MPLS-TP LSP and its payload, and exactly one LSE in this stack SHALL have the S (Bottom of Stack) bit set to 1. This behavior reflects best current practice in MPLS but differs slightly from [RFC3032], which uses the S bit to identify when MPLS label processing stops and network-layer processing starts.",
      "ja": "MPLS-TP LSPのペイロードは、MPLSラベルスタックを含むパケットである可能性があります。たとえば、これは、ペイロードが擬似ワイヤーまたはMPLS LSPである場合に当てはまります。そのような場合、ラベルスタックはMPLS-TP LSPとそのペイロードの間で隣接しており、このスタックの1つのLSEは1に設定されています。[RFC3032]からわずかに、Sビットを使用して、MPLSラベル処理の停止とネットワーク層処理が開始される時期を識別します。"
    },
    {
      "indent": 0,
      "text": "3.1.3. LSP Types",
      "section_title": true,
      "ja": "3.1.3. LSPタイプ"
    },
    {
      "indent": 3,
      "text": "The MPLS-TP includes the following LSP types:",
      "ja": "MPLS-TPには、次のLSPタイプが含まれています。"
    },
    {
      "indent": 3,
      "text": "o Point-to-point unidirectional",
      "ja": "o ポイントツーポイント単方向"
    },
    {
      "indent": 3,
      "text": "o Point-to-point associated bidirectional",
      "ja": "o ポイントツーポイント関連の双方向"
    },
    {
      "indent": 3,
      "text": "o Point-to-point co-routed bidirectional",
      "ja": "o ポイントツーポイントの共同ルート双方向"
    },
    {
      "indent": 3,
      "text": "o Point-to-multipoint unidirectional",
      "ja": "o ポイントツーマルチポイント単方向"
    },
    {
      "indent": 3,
      "text": "Point-to-point unidirectional LSPs are supported by the basic MPLS architecture [RFC3031] and are REQUIRED to function in the same manner in the MPLS-TP data plane, except as explicitly stated otherwise in this document.",
      "ja": "ポイントツーポイント単方向LSPは、基本的なMPLSアーキテクチャ[RFC3031]によってサポートされており、このドキュメントで明示的に述べられている場合を除き、MPLS-TPデータプレーンで同じ方法で機能する必要があります。"
    },
    {
      "indent": 3,
      "text": "A point-to-point associated bidirectional LSP between LSRs A and B consists of two unidirectional point-to-point LSPs, one from A to B and the other from B to A, which are regarded as a pair providing a single logical bidirectional transport path.",
      "ja": "LSRS AとBの間のポイントツーポイントに関連する双方向LSPは、AからBからBからAまでの2つの単方向ポイントツーポイントLSPで構成されています。道。"
    },
    {
      "indent": 3,
      "text": "A point-to-point co-routed bidirectional LSP is a point-to-point associated bidirectional LSP with the additional constraint that its two unidirectional component LSPs in each direction follow the same path (in terms of both nodes and links). An important property of co-routed bidirectional LSPs is that their unidirectional component LSPs share fate.",
      "ja": "ポイントツーポイントコロウトされた双方向LSPは、各方向の2つの単方向コンポーネントLSPが同じパスをたどるという追加の制約を伴う、ポイントツーポイントに関連する双方向LSPです（ノードとリンクの両方の観点から）。共同双方向LSPの重要な特性は、それらの単方向コンポーネントLSPが運命を共有することです。"
    },
    {
      "indent": 3,
      "text": "A point-to-multipoint unidirectional LSP functions in the same manner in the data plane, with respect to basic label processing and packet-switching operations, as a point-to-point unidirectional LSP, with one difference: an LSR may have more than one (egress interface, outgoing label) pair associated with the LSP, and any packet it transmits on the LSP is transmitted out all associated egress interfaces. Point-to-multipoint LSPs are described in [RFC4875] and [RFC5332]. TTL processing and exception handling for point-to-multipoint LSPs is the same as for point-to-point LSPs and is described in Section 2.",
      "ja": "ポイントツーマルチポイント単方向LSPは、基本的なラベル処理とパケットスイッチング操作に関して、ポイントツーポイント単方向LSPとして、1つの違いを持つ：An LSRにはこれ以上のものがある場合があります。LSPに関連付けられた1つの（出口インターフェイス、発信ラベル）ペア、およびLSPに送信されるパケットは、関連するすべての出力インターフェイスを送信します。ポイントツーマルチポイントLSPは[RFC4875]および[RFC5332]で説明されています。ポイントツーマルチポイントLSPのTTL処理と例外処理は、ポイントツーポイントLSPの場合と同じであり、セクション2で説明されています。"
    },
    {
      "indent": 0,
      "text": "3.2. Sections",
      "section_title": true,
      "ja": "3.2. セクション"
    },
    {
      "indent": 3,
      "text": "Two MPLS-TP LSRs are considered to be topologically adjacent at a particular layer n >= 0 of the MPLS-TP LSP hierarchy if there exists connectivity between them at the next lowest network layer, and if there is no MPLS layer processing at layer n between the two LSRs (other than at the LSRs themselves). Such connectivity, if it exists, will be either an MPLS-TP LSP (if n > 0) or a data-link provided by the underlying server layer network (if n = 0), and is referred to as an MPLS-TP section at layer n of the MPLS-TP LSP hierarchy. Thus, the links traversed by a layer n+1 MPLS-TP LSP are layer n MPLS-TP sections. Such an LSP is referred to as a client of the section layer, and the section layer is referred to as the server layer with respect to its clients.",
      "ja": "2つのMPLS-TP LSRは、次の低いネットワークレイヤーにそれらの間に接続性が存在する場合、およびレイヤーNでMPLSレイヤー処理がない場合、MPLS-TP LSP階層の特定の層n> = 0でトポロジカルに隣接すると見なされます。2つのLSRの間（LSR自体以外）。このような接続性は、存在する場合、MPLS-TP LSP（n> 0の場合）または基礎となるサーバーレイヤーネットワーク（n = 0の場合）によって提供されるデータリンクのいずれかで、MPLS-TPセクションと呼ばれます。MPLS-TP LSP階層のレイヤーNで。したがって、レイヤーn 1 MPLS-TP LSPによって移動されるリンクは、層N MPLS-TPセクションです。このようなLSPは、セクションレイヤーのクライアントと呼ばれ、セクションレイヤーはクライアントに関するサーバーレイヤーと呼ばれます。"
    },
    {
      "indent": 3,
      "text": "The MPLS label stack associated with an MPLS-TP section at layer n consists of n labels, in the absence of stack optimization mechanisms. In order for two LSRs to exchange non-IP MPLS-TP control packets over a section, an additional label, the G-ACh Label (GAL) (see Section 4) MUST appear at the bottom of the label stack.",
      "ja": "レイヤーnのMPLS-TPセクションに関連付けられたMPLSラベルスタックは、スタック最適化メカニズムがない場合、Nラベルで構成されています。2つのLSRがセクションで非IP MPLS-TPコントロールパケットを交換するには、追加のラベルであるG-achラベル（GAL）（セクション4を参照）がラベルスタックの下部に表示される必要があります。"
    },
    {
      "indent": 3,
      "text": "An MPLS-TP section may provide one or more of the following types of service to its client layer:",
      "ja": "MPLS-TPセクションは、クライアントレイヤーに次の種類のサービスの1つ以上を提供できます。"
    },
    {
      "indent": 3,
      "text": "o Point-to-point bidirectional",
      "ja": "o ポイントツーポイント双方向"
    },
    {
      "indent": 3,
      "text": "o Point-to-point unidirectional",
      "ja": "o ポイントツーポイント単方向"
    },
    {
      "indent": 3,
      "text": "o Point-to-multipoint unidirectional The manner in which a section provides such a service is outside the scope of the MPLS-TP.",
      "ja": "o ポイントツーマルチポイント単方向そのようなサービスを提供する方法は、MPLS-TPの範囲外です。"
    },
    {
      "indent": 3,
      "text": "An LSP of any of the types listed in Section 3.1.3 may serve as a section for a client-layer transport entity as long as it supports the type of service the client requires.",
      "ja": "セクション3.1.3にリストされているタイプのLSPは、クライアントが必要とするサービスの種類をサポートする限り、クライアント層輸送エンティティのセクションとして機能する場合があります。"
    },
    {
      "indent": 3,
      "text": "A section MUST provide a means of identifying the type of payload it carries. If the section is a data-link, link-specific mechanisms such as a protocol type indication in the data-link header MAY be used. If the section is an LSP, this information MAY be implied by the LSP label or, if the LSP payload is MPLS-labeled, by the setting of the S bit. Additional labels MAY also be used if necessary to distinguish different payload types; see [RFC5921] for examples and further discussion.",
      "ja": "セクションは、携帯するペイロードの種類を識別する手段を提供する必要があります。セクションがデータリンクの場合、データリンクヘッダーのプロトコルタイプの表示などのリンク固有のメカニズムを使用できます。セクションがLSPの場合、この情報はLSPラベルによって、またはLSPペイロードがMPLS標識である場合、Sビットの設定によって暗示される場合があります。必要に応じて、さまざまなペイロードタイプを区別するために追加のラベルを使用することもできます。例とさらなる議論については、[RFC5921]を参照してください。"
    },
    {
      "indent": 0,
      "text": "3.3. Pseudowires",
      "section_title": true,
      "ja": "3.3. 擬似ワイヤ"
    },
    {
      "indent": 3,
      "text": "The data plane architectures for single-segment pseudowires [RFC3985] and multi-segment pseudowires [RFC5659] are included in the MPLS-TP.",
      "ja": "単一セグメントの擬似動物[RFC3985]およびマルチセグメントの擬似動物[RFC5659]のデータプレーンアーキテクチャは、MPLS-TPに含まれています。"
    },
    {
      "indent": 3,
      "text": "Data plane processing procedures for pseudowires are defined and described in a number of IETF documents. Some example pseudowire data plane procedures include:",
      "ja": "擬似動物のデータプレーン処理手順は、多くのIETFドキュメントで定義および説明されています。擬似動物のデータプレーン手順の例は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "o Pseudowire Emulation Edge-to-Edge (PWE3) Control Word for Use over an MPLS PSN [RFC4385]",
      "ja": "o PSEUDOWIREエミュレーションエッジツーエッジ（PWE3）MPLS PSNを介した使用の単語を制御[RFC4385]"
    },
    {
      "indent": 3,
      "text": "o Encapsulation Methods for Transport of Ethernet over MPLS Networks [RFC4448]",
      "ja": "o MPLSネットワークを介したイーサネットの輸送のためのカプセル化方法[RFC4448]"
    },
    {
      "indent": 3,
      "text": "o Structure-Agnostic Time Division Multiplexing (TDM) over Packet (SAToP) [RFC4553]",
      "ja": "o 構造 - 存在時の時除算マルチプレックス（TDM）パケット（SATOP）[RFC4553]"
    },
    {
      "indent": 3,
      "text": "o Encapsulation Methods for Transport of PPP/High-Level Data Link Control (HDLC) over MPLS Networks [RFC4618]",
      "ja": "o MPLSネットワークを介したPPP/高レベルデータリンク制御（HDLC）の輸送のためのカプセル化方法[RFC4618]"
    },
    {
      "indent": 3,
      "text": "o Encapsulation Methods for Transport of Frame Relay over Multiprotocol Label Switching (MPLS) Networks [RFC4619]",
      "ja": "o マルチプロトコルラベルスイッチング（MPLS）ネットワークを介したフレームリレーの輸送のためのカプセル化方法[RFC4619]"
    },
    {
      "indent": 3,
      "text": "o Encapsulation Methods for Transport of Asynchronous Transfer Mode (ATM) over MPLS Networks [RFC4717]",
      "ja": "o MPLSネットワークを介した非同期転送モード（ATM）の輸送のためのカプセル化方法[RFC4717]"
    },
    {
      "indent": 3,
      "text": "o Pseudowire Emulation Edge-to-Edge (PWE3) Asynchronous Transfer Mode (ATM) Transparent Cell Transport Service [RFC4816]",
      "ja": "o PSEUDOWIREエミュレーションエッジツーエッジ（PWE3）非同期転送モード（ATM）透明細胞輸送サービス[RFC4816]"
    },
    {
      "indent": 3,
      "text": "o Synchronous Optical Network/Synchronous Digital Hierarchy (SONET/ SDH) Circuit Emulation over Packet (CEP) [RFC4842]",
      "ja": "o 同期光ネットワーク/同期デジタル階層（SONET/ SDH）回路エミュレーション上のパケット（CEP）[RFC4842]"
    },
    {
      "indent": 3,
      "text": "o Structure-Aware Time Division Multiplexed (TDM) Circuit Emulation Service over Packet Switched Network (CESoPSN) [RFC5086]",
      "ja": "o 構造対応の時刻分割多重化（TDM）回路エミュレーションサービスパケットスイッチネットワーク（CESOPSN）[RFC5086]"
    },
    {
      "indent": 3,
      "text": "o Time Division Multiplexing over IP (TDMoIP) [RFC5087]",
      "ja": "o IP（TDMOIP）を介した時分割多重化[RFC5087]"
    },
    {
      "indent": 3,
      "text": "o Encapsulation Methods for Transport of Fibre Channel frames Over MPLS Networks [FC-ENCAP]",
      "ja": "o MPLSネットワークを介したファイバーチャネルフレームの輸送のためのカプセル化方法[FC-Encap]"
    },
    {
      "indent": 3,
      "text": "This document specifies no modifications or extensions to pseudowire data plane architectures or protocols.",
      "ja": "このドキュメントは、擬似化データプレーンアーキテクチャまたはプロトコルの変更または拡張機能を指定していません。"
    },
    {
      "indent": 0,
      "text": "4. MPLS-TP Generic Associated Channel",
      "section_title": true,
      "ja": "4. MPLS-TPジェネリック関連チャネル"
    },
    {
      "indent": 3,
      "text": "The MPLS Generic Associated Channel (G-ACh) mechanism is specified in [RFC5586] and included in the MPLS-TP. The G-ACh provides an auxiliary logical data channel associated with MPLS-TP sections, LSPs, and PWs in the data plane. The primary purpose of the G-ACh in the context of MPLS-TP is to support control, management, and Operations, Administration, and Maintenance (OAM) traffic associated with MPLS-TP transport entities. The G-ACh MUST NOT be used to transport client layer network traffic in MPLS-TP networks.",
      "ja": "MPLSジェネリック関連チャネル（g-ach）メカニズムは[RFC5586]で指定され、MPLS-TPに含まれています。G-achは、データプレーン内のMPLS-TPセクション、LSP、およびPWSに関連付けられた補助論理データチャネルを提供します。MPLS-TPのコンテキストにおけるG-achの主な目的は、MPLS-TP輸送エンティティに関連する制御、管理、および運用、管理、およびメンテナンス（OAM）トラフィックをサポートすることです。G-achは、MPLS-TPネットワークのクライアントレイヤーネットワークトラフィックを輸送するために使用してはなりません。"
    },
    {
      "indent": 3,
      "text": "For pseudowires, the G-ACh uses the first four bits of the PW control word to provide the initial discrimination between data packets and packets belonging to the associated channel, as described in [RFC4385]. When this first nibble of a packet, immediately following the label at the bottom of stack, has a value of '1', then this packet belongs to a G-ACh. The first 32 bits following the bottom of stack label then have a defined format called an Associated Channel Header (ACH), which further defines the content of the packet. The ACH is therefore both a demultiplexer for G-ACh traffic on the PW, and a discriminator for the type of G-ACh traffic.",
      "ja": "PSEUDOWIRESの場合、G-achは、[RFC4385]に記載されているように、PW制御ワードの最初の4ビットを使用して、関連するチャネルに属するデータパケットとパケット間の初期差別を提供します。パケットのこの最初のニブルは、スタックの下部にあるラベルの直後に「1」の値がある場合、このパケットはG-achに属します。スタックラベルの下部に続く最初の32ビットには、関連するチャネルヘッダー（ACH）と呼ばれる定義済み形式があり、パケットのコンテンツをさらに定義します。したがって、ACHは、PWのG-achトラフィックのデマルチプレクサーと、G-achトラフィックのタイプの識別器の両方です。"
    },
    {
      "indent": 3,
      "text": "When the control message is carried over a section or an LSP, rather than over a PW, it is necessary to provide an indication in the packet that the payload is something other than a client data packet. This is achieved by including a reserved label with a value of 13 at the bottom of the label stack. This reserved label is referred to as the G-ACh Label (GAL) and is defined in [RFC5586]. When a GAL is found, it indicates that the payload begins with an ACH. The GAL is thus a demultiplexer for G-ACh traffic on the section or the LSP, and the ACH is a discriminator for the type of traffic carried on the G-ACh. MPLS-TP forwarding follows the normal MPLS model, and thus a GAL is invisible to an LSR unless it is the top label in the label stack. The only other circumstance under which the label stack may be inspected for a GAL is when the TTL has expired. Normal packet forwarding MAY continue concurrently with this inspection. All operations on the label stack are in accordance with [RFC3031] and [RFC3032].",
      "ja": "コントロールメッセージがPWを超えるのではなく、セクションまたはLSPに掲載される場合、ペイロードがクライアントデータパケット以外のものであることをパケットに表示する必要があります。これは、ラベルスタックの下部に13の値の予約ラベルを含めることによって達成されます。この予約されたラベルは、G-achラベル（GAL）と呼ばれ、[RFC5586]で定義されています。GALが見つかると、ペイロードがAChで始まることを示します。したがって、GALは、セクションまたはLSPのG-achトラフィックの非gultiplexerであり、ACHはG-achに携帯されるトラフィックの種類の識別器です。MPLS-TP転送は通常のMPLSモデルに従うため、ラベルスタックのトップレーベルでない限り、GALはLSRに見えません。ラベルスタックがGALの検査を検査する可能性のある他の唯一の状況は、TTLの有効期限が切れたときです。通常のパケット転送は、この検査と同時に続く場合があります。ラベルスタックのすべての操作は、[RFC3031]および[RFC3032]に従っています。"
    },
    {
      "indent": 3,
      "text": "An application processing a packet received over the G-ACh may require packet-specific context (such as the receiving interface or received label stack). Data plane implementations MUST therefore provide adequate context to the application that is to process a G-ACh packet. The definition of the context required MUST be provided as part of the specification of the application using the G-ACh.",
      "ja": "g-achで受信したパケットを処理するアプリケーションには、パケット固有のコンテキスト（受信インターフェイスや受信ラベルスタックなど）が必要になる場合があります。したがって、データプレーンの実装は、G-achパケットを処理するためのアプリケーションに適切なコンテキストを提供する必要があります。必要なコンテキストの定義は、G-achを使用してアプリケーションの仕様の一部として提供する必要があります。"
    },
    {
      "indent": 0,
      "text": "5. Server-Layer Considerations",
      "section_title": true,
      "ja": "5. サーバー層の考慮事項"
    },
    {
      "indent": 3,
      "text": "The MPLS-TP network has no awareness of the internals of the server layer of which it is a client; it requires only that the server layer be capable of delivering the type of service required by the MPLS-TP transport entities that make use of it. Note that what appears to be a single server-layer link to the MPLS-TP network may be a complicated construct underneath, such as an LSP or a collection of underlying links operating as a bundle. Special care may be needed in network design and operation when such constructs are used as a server layer for MPLS-TP.",
      "ja": "MPLS-TPネットワークは、クライアントであるサーバーレイヤーの内部について認識されていません。サーバーレイヤーが、それを利用するMPLS-TPトランスポートエンティティが必要とするサービスの種類を配信できることのみが必要です。MPLS-TPネットワークへの単一のサーバー層リンクと思われるものは、LSPやバンドルとして動作する基礎となるリンクのコレクションなど、その下の複雑な構成要素である可能性があることに注意してください。そのようなコンストラクトがMPLS-TPのサーバーレイヤーとして使用される場合、ネットワーク設計と操作には特別な注意が必要になる場合があります。"
    },
    {
      "indent": 3,
      "text": "Encapsulation of MPLS-TP packets for transport over specific server-layer media is outside the scope of this document.",
      "ja": "特定のサーバー層メディアを介したトランスポート用のMPLS-TPパケットのカプセル化は、このドキュメントの範囲外です。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "The MPLS data plane (and therefore the MPLS-TP data plane) does not provide any security mechanisms in and of itself. Client layers that wish to secure data carried over MPLS-TP transport entities are REQUIRED to apply their own security mechanisms.",
      "ja": "MPLSデータプレーン（したがって、MPLS-TPデータプレーン）は、それ自体のセキュリティメカニズムを提供しません。MPLS-TPトランスポートエンティティに搭載されたデータを保護したいクライアントレイヤーは、独自のセキュリティメカニズムを適用するために必要です。"
    },
    {
      "indent": 3,
      "text": "Where management or control plane protocols are used to install label-switching operations necessary to establish MPLS-TP transport paths, those protocols are equipped with security features that network operators may use to securely create the transport paths.",
      "ja": "MPLS-TPトランスポートパスの確立に必要なラベルスイッチング操作をインストールするために管理または制御プレーンプロトコルが使用される場合、これらのプロトコルには、ネットワークオペレーターが使用するセキュリティ機能が装備されています。"
    },
    {
      "indent": 3,
      "text": "Where enhanced security is desirable, and a trust relationship exists between an LSR and its peer, the LSR MAY choose to implement the following policy for the processing of MPLS packets received from one or more of its neighbors:",
      "ja": "強化されたセキュリティが望ましい場合、LSRとそのピアの間に信頼関係が存在する場合、LSRは、1つ以上の隣人から受信したMPLSパケットの処理のために次のポリシーを実装することを選択できます。"
    },
    {
      "indent": 6,
      "text": "Upon receipt of an MPLS packet, discard the packet unless one of the following two conditions holds: 1. Any MPLS label in the packet's label stack processed at the receiving LSR, such as an LSP or PW label, has a label value that the receiving LSR has distributed to that neighbor; or",
      "ja": "MPLSパケットを受け取ったら、次の2つの条件のいずれかが保持されない限り、パケットを破棄します。1。LSPやPWラベルなどの受信LSRで処理されたパケットのラベルスタックのMPLSラベルには、受信したラベル値があります。LSRはその隣人に配布しました。また"
    },
    {
      "indent": 6,
      "text": "2. Any MPLS label in the packet's label stack processed at the receiving LSR, such as an LSP or PW label, has a label value that the receiving LSR has previously distributed to the peer beyond that neighbor (i.e., when it is known that the path from the system to which the label was distributed to the receiving system is via that neighbor).",
      "ja": "2. 受信LSRで処理されたPacketのラベルスタックのMPLSラベル（LSPやPWラベルなど）には、受信LSRが以前にその隣接を超えてピアに配布していたラベル値があります（つまり、からのパスが知られている場合です。ラベルが受信システムに配布されたシステムは、その隣接を介してです）。"
    },
    {
      "indent": 3,
      "text": "Further details of MPLS and MPLS-TP security can be found in [RFC5921] and [RFC5920].",
      "ja": "MPLSおよびMPLS-TPセキュリティの詳細については、[RFC5921]および[RFC5920]をご覧ください。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7. 参考文献"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "ja": "7.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119] Bradner、S。、「要件レベルを示すためにRFCで使用するためのキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3031] Rosen, E., Viswanathan, A., and R. Callon, \"Multiprotocol Label Switching Architecture\", RFC 3031, January 2001.",
      "ja": "[RFC3031] Rosen、E.、Viswanathan、A。、およびR. Callon、「Multiprotocolラベルスイッチングアーキテクチャ」、RFC 3031、2001年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC3032] Rosen, E., Tappan, D., Fedorkow, G., Rekhter, Y., Farinacci, D., Li, T., and A. Conta, \"MPLS Label Stack Encoding\", RFC 3032, January 2001.",
      "ja": "[RFC3032] Rosen、E.、Tappan、D.、Fedorkow、G.、Rekhter、Y.、Farinacci、D.、Li、T。、およびA. conta、「Mpls Label Stack Encoding」、RFC 3032、2001年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC3209] Awduche, D., Berger, L., Gan, D., Li, T., Srinivasan, V., and G. Swallow, \"RSVP-TE: Extensions to RSVP for LSP Tunnels\", RFC 3209, December 2001.",
      "ja": "[RFC3209] Awduche、D.、Berger、L.、Gan、D.、Li、T.、Srinivasan、V。、およびG. Swallow、 \"RSVP-TE：LSP TunnelsのRSVPへの拡張\"、RFC 3209、12月2001年。"
    },
    {
      "indent": 3,
      "text": "[RFC3270] Le Faucheur, F., Wu, L., Davie, B., Davari, S., Vaananen, P., Krishnan, R., Cheval, P., and J. Heinanen, \"Multi-Protocol Label Switching (MPLS) Support of Differentiated Services\", RFC 3270, May 2002.",
      "ja": "[RFC3270] Le Faucheur、F.、Wu、L.、Davie、B.、Davari、S.、Vaananen、P.、Krishnan、R.、Cheval、P。、およびJ. Heinanen、「Multi-Protocol Label Switching」（MPLS）差別化されたサービスのサポート」、RFC 3270、2002年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC3443] Agarwal, P. and B. Akyol, \"Time To Live (TTL) Processing in Multi-Protocol Label Switching (MPLS) Networks\", RFC 3443, January 2003.",
      "ja": "[RFC3443] Agarwal、P。およびB. Akyol、「マルチプロトコルラベルスイッチング（MPLS）ネットワークでのライブ（TTL）処理」、RFC 3443、2003年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC4385] Bryant, S., Swallow, G., Martini, L., and D. McPherson, \"Pseudowire Emulation Edge-to-Edge (PWE3) Control Word for Use over an MPLS PSN\", RFC 4385, February 2006.",
      "ja": "[RFC4385] Bryant、S.、Swallow、G.、Martini、L。、およびD. McPherson、「Pseudowire Emulation Edge-to-Edge（PWE3）がMPLS PSNを介して使用するコントロールワード」、RFC 4385、2006年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC4448] Martini, L., Rosen, E., El-Aawar, N., and G. Heron, \"Encapsulation Methods for Transport of Ethernet over MPLS Networks\", RFC 4448, April 2006.",
      "ja": "[RFC4448] Martini、L.、Rosen、E.、El-Aawar、N。、およびG. Heron、「MPLSネットワーク上のイーサネットの輸送のためのカプセル化方法」、RFC 4448、2006年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC4553] Vainshtein, A. and YJ. Stein, \"Structure-Agnostic Time Division Multiplexing (TDM) over Packet (SAToP)\", RFC 4553, June 2006.",
      "ja": "[RFC4553] Vainshtein、A。およびYJ。Stein、「パケット（SATOP）上の構造に依存しない時刻分割多重化（TDM）」、RFC 4553、2006年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC4618] Martini, L., Rosen, E., Heron, G., and A. Malis, \"Encapsulation Methods for Transport of PPP/High-Level Data Link Control (HDLC) over MPLS Networks\", RFC 4618, September 2006.",
      "ja": "[RFC4618] Martini、L.、Rosen、E.、Heron、G。、およびA. Malis、「MPLSネットワーク上のPPP/高レベルデータリンク制御（HDLC）の輸送のためのカプセル化方法」、RFC 4618、2006年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC4619] Martini, L., Kawa, C., and A. Malis, \"Encapsulation Methods for Transport of Frame Relay over Multiprotocol Label Switching (MPLS) Networks\", RFC 4619, September 2006.",
      "ja": "[RFC4619] Martini、L.、Kawa、C。、およびA. Malis、「マルチプロトコルラベルスイッチング（MPLS）ネットワークを介したフレームリレーの輸送のためのカプセル化方法」、RFC 4619、2006年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC4717] Martini, L., Jayakumar, J., Bocci, M., El-Aawar, N., Brayley, J., and G. Koleyni, \"Encapsulation Methods for Transport of Asynchronous Transfer Mode (ATM) over MPLS Networks\", RFC 4717, December 2006.",
      "ja": "[RFC4717] Martini、L.、Jayakumar、J.、Bocci、M.、El-Aawar、N.、Brayley、J。、およびG. Koleyni、「MPLSネットワーク上の非同期移転モード（ATM）の輸送のためのカプセル化方法」\"、RFC 4717、2006年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC4816] Malis, A., Martini, L., Brayley, J., and T. Walsh, \"Pseudowire Emulation Edge-to-Edge (PWE3) Asynchronous Transfer Mode (ATM) Transparent Cell Transport Service\", RFC 4816, February 2007.",
      "ja": "[RFC4816] Malis、A.、Martini、L.、Brayley、J。、およびT. Walsh、「Pseudowire Emulation Edge-to-Edge（PWE3）非同期転送モード（ATM）透明細胞輸送サービス」、RFC 4816、2月2007年。"
    },
    {
      "indent": 3,
      "text": "[RFC4842] Malis, A., Pate, P., Cohen, R., and D. Zelig, \"Synchronous Optical Network/Synchronous Digital Hierarchy (SONET/SDH) Circuit Emulation over Packet (CEP)\", RFC 4842, April 2007.",
      "ja": "[RFC4842] Malis、A.、Pate、P.、Cohen、R。、およびD. Zelig、「同期光学ネットワーク/同期デジタル階層（SONET/SDH）回路エミュレーション（CEP）（CEP）（CEP）（CEP）（CEP）（CEP））、RFC 4842、2007年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC4875] Aggarwal, R., Papadimitriou, D., and S. Yasukawa, \"Extensions to Resource Reservation Protocol - Traffic Engineering (RSVP-TE) for Point-to-Multipoint TE Label Switched Paths (LSPs)\", RFC 4875, May 2007.",
      "ja": "[RFC4875] Aggarwal、R.、Papadimitriou、D。、およびS. Yasukawa、「リソース予約プロトコルへの拡張 - ポイントツーマルチポイントTEラベルスイッチドパス（LSP）のトラフィックエンジニアリング（RSVP-TE）」、RFC 4875、2007年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC5331] Aggarwal, R., Rekhter, Y., and E. Rosen, \"MPLS Upstream Label Assignment and Context-Specific Label Space\", RFC 5331, August 2008.",
      "ja": "[RFC5331] Aggarwal、R.、Rekhter、Y。、およびE. Rosen、「MPLS Upstream Labelの割り当てとコンテキスト固有のラベルスペース」、RFC 5331、2008年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC5332] Eckert, T., Rosen, E., Aggarwal, R., and Y. Rekhter, \"MPLS Multicast Encapsulations\", RFC 5332, August 2008.",
      "ja": "[RFC5332] Eckert、T.、Rosen、E.、Aggarwal、R。、およびY. Rekhter、「MPLSマルチキャストカプセル」、RFC 5332、2008年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC5462] Andersson, L. and R. Asati, \"Multiprotocol Label Switching (MPLS) Label Stack Entry: \"EXP\" Field Renamed to \"Traffic Class\" Field\", RFC 5462, February 2009.",
      "ja": "[RFC5462] Andersson、L。and R. Asati、「マルチプロトコルラベルスイッチング（MPLS）ラベルスタックエントリ：「Exp」フィールド「トラフィッククラス」フィールドに改名されたフィールド、RFC 5462、2009年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC5586] Bocci, M., Vigoureux, M., and S. Bryant, \"MPLS Generic Associated Channel\", RFC 5586, June 2009.",
      "ja": "[RFC5586] Bocci、M.、Vigoureux、M。、およびS. Bryant、「Mpls Generic Associated Channel」、RFC 5586、2009年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC5654] Niven-Jenkins, B., Brungard, D., Betts, M., Sprecher, N., and S. Ueno, \"Requirements of an MPLS Transport Profile\", RFC 5654, September 2009.",
      "ja": "[RFC5654] Niven-Jenkins、B.、Brungard、D.、Betts、M.、Sprecher、N。、およびS. Ueno、「MPLS輸送プロファイルの要件」、RFC 5654、2009年9月。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "ja": "7.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[FC-ENCAP] Black, D. and L. Dunbar, \"Encapsulation Methods for Transport of Fibre Channel frames Over MPLS Networks\", Work in Progress, June 2010.",
      "ja": "[FC-Encap] Black、D。およびL. Dunbar、「MPLSネットワーク上のファイバーチャネルフレームの輸送のためのカプセル化方法」、2010年6月、進行中の作業。"
    },
    {
      "indent": 3,
      "text": "[RFC3985] Bryant, S. and P. Pate, \"Pseudo Wire Emulation Edge-to-Edge (PWE3) Architecture\", RFC 3985, March 2005.",
      "ja": "[RFC3985] Bryant、S。およびP. Pate、「Pseudo Wire Emulation Edge-to-Edge（PWE3）アーキテクチャ」、RFC 3985、2005年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC5086] Vainshtein, A., Sasson, I., Metz, E., Frost, T., and P. Pate, \"Structure-Aware Time Division Multiplexed (TDM) Circuit Emulation Service over Packet Switched Network (CESoPSN)\", RFC 5086, December 2007.",
      "ja": "[RFC5086] Vainshtein、A.、Sasson、I.、Metz、E.、Frost、T.、およびP. Pate、「構造対応の時刻分割多重化（TDM）回路エミュレーションサービス上のパケットスイッチドネットワーク（CESOPSN）」RFC 5086、2007年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC5087] Stein, Y(J)., Shashoua, R., Insler, R., and M. Anavi, \"Time Division Multiplexing over IP (TDMoIP)\", RFC 5087, December 2007.",
      "ja": "[RFC5087] Stein、Y（J）。、Shashoua、R.、Insler、R.、およびM. Anavi、「IP（TDMOIP）上の時間分割多重化」、RFC 5087、2007年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC5659] Bocci, M. and S. Bryant, \"An Architecture for Multi-Segment Pseudowire Emulation Edge-to-Edge\", RFC 5659, October 2009.",
      "ja": "[RFC5659] Bocci、M。およびS. Bryant、「マルチセグメントの擬似ワイヤーエミュレーションエッジツーエッジのアーキテクチャ」、RFC 5659、2009年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC5920] Fang, L., \"Security Framework for MPLS and GMPLS Networks\", RFC 5920, July 2010.",
      "ja": "[RFC5920] Fang、L。、「MPLSおよびGMPLSネットワークのセキュリティフレームワーク」、RFC 5920、2010年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC5921] Bocci, M., Bryant, S., Frost, D., Levrau, L., and L. Berger, \"A Framework for MPLS in Transport Networks\", RFC 5921, July 2010.",
      "ja": "[RFC5921] Bocci、M.、Bryant、S.、Frost、D.、Levrau、L。、およびL. Berger、「輸送ネットワークにおけるMPLのフレームワーク」、RFC 5921、2010年7月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Dan Frost (editor) Cisco Systems",
      "ja": "Dan Frost（編集者）Cisco Systems"
    },
    {
      "indent": 3,
      "text": "EMail: danfrost@cisco.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Stewart Bryant (editor) Cisco Systems",
      "ja": "スチュワートブライアント（編集者）シスコシステム"
    },
    {
      "indent": 3,
      "text": "EMail: stbryant@cisco.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Matthew Bocci (editor) Alcatel-Lucent",
      "ja": "Matthew Bocci（編集者）Alcatel-Lucent"
    },
    {
      "indent": 3,
      "text": "EMail: matthew.bocci@alcatel-lucent.com",
      "raw": true,
      "ja": ""
    }
  ]
}