{
  "title": {
    "text": "RFC 5149 - Service Selection for Mobile IPv6",
    "ja": "RFC 5149 - モバイルIPv6のサービス選択"
  },
  "number": 5149,
  "created_at": "2023-04-21 07:17:52.195715+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                        J. Korhonen\nRequest for Comments: 5149                                    U. Nilsson\nCategory: Informational                                      TeliaSonera\n                                                          V. Devarapalli\n                                                                  Azaire\n                                                           February 2008",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 19,
      "text": "Service Selection for Mobile IPv6",
      "ja": "モバイルIPv6のサービス選択"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモは、インターネットコミュニティに情報を提供します。いかなる種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "In some Mobile IPv6 deployments, identifying the mobile node or the mobility service subscriber is not enough to distinguish between multiple services possibly provisioned to the said mobile node and its mobility service subscription. A capability to specify different services in addition to the mobile node identity can be leveraged to provide flexibility for mobility service providers on provisioning multiple services to one mobility service subscription. This document describes a Service Selection Mobility Option for both conventional Mobile IPv6 and Proxy Mobile IPv6 that is intended to assist home agents to make a specific service selection for the mobility service subscription during the binding registration procedure.",
      "ja": "一部のモバイルIPv6の展開では、モバイルノードまたはモビリティサービスサブスクライバーを識別するだけでは、モバイルノードにプロビジョニングされている可能性のある複数のサービスとそのモビリティサービスサブスクリプションを区別するのに十分ではありません。モバイルノードのアイデンティティに加えてさまざまなサービスを指定する機能を活用して、1つのモビリティサービスサブスクリプションに複数のサービスをプロビジョニングするモビリティサービスプロバイダーに柔軟性を提供できます。このドキュメントでは、拘束力のある登録手順中にモビリティサービスサブスクリプションの特定のサービス選択を行うのを支援することを目的とした、従来のモバイルIPv6とプロキシモバイルIPv6の両方のサービス選択モビリティオプションについて説明します。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . . . 2\n2.  Requirements  . . . . . . . . . . . . . . . . . . . . . . . . . 3\n3.  Service Selection Mobility Option . . . . . . . . . . . . . . . 3\n4.  Processing Considerations . . . . . . . . . . . . . . . . . . . 4\n  4.1.  Mobile Node Considerations  . . . . . . . . . . . . . . . . 4\n  4.2.  Home Agent Considerations . . . . . . . . . . . . . . . . . 5\n  4.3.  Correspondent Node Considerations . . . . . . . . . . . . . 5\n5.  Security Considerations . . . . . . . . . . . . . . . . . . . . 6\n6.  IANA Considerations . . . . . . . . . . . . . . . . . . . . . . 6\n7.  Acknowledgements  . . . . . . . . . . . . . . . . . . . . . . . 6\n8.  References  . . . . . . . . . . . . . . . . . . . . . . . . . . 6\n  8.1.  Normative References  . . . . . . . . . . . . . . . . . . . 6\n  8.2.  Informative References  . . . . . . . . . . . . . . . . . . 7",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "Mobile IPv6 [2] can identify mobile nodes in various ways, including home addresses [2], Network Access Identifiers (NAIs) [6][7], and credentials suitable for the Internet Key Exchange Protocol version 2 (IKEv2) [10]. In some Mobile IPv6 deployments, identifying the mobile node or the mobility service subscriber via a Proxy Mobile IPv6 client [5] (hereafter, the mobile node and the Proxy Mobile IPv6 client are used interchangeably) is not enough to distinguish between multiple services possibly provisioned to the said mobile node and its mobility service subscription.",
      "ja": "モバイルIPv6 [2]は、ホームアドレス[2]、ネットワークアクセス識別子（NAIS）[6] [7]、およびインターネットキーエクスチェンジプロトコルバージョン2（IKEV2）[10]に適した資格情報など、さまざまな方法でモバイルノードを識別できます。。一部のモバイルIPv6の展開では、プロキシモバイルIPv6クライアント[5]を介してモバイルノードまたはモビリティサービスサブスクライバーを識別します（以下、モバイルノードとプロキシモバイルIPv6クライアントは同じ意味で使用されます）。上記のモバイルノードとそのモビリティサービスサブスクリプションに。"
    },
    {
      "indent": 3,
      "text": "The capability to specify different services in addition to the mobile node identity can be leveraged to provide flexibility for mobility service providers to provide multiple services within the same mobility service subscription. For example:",
      "ja": "モバイルノードのアイデンティティに加えてさまざまなサービスを指定する機能を活用して、モビリティサービスプロバイダーが同じモビリティサービスサブスクリプション内で複数のサービスを提供できる柔軟性を提供できます。例えば："
    },
    {
      "indent": 3,
      "text": "o Provide an enterprise data access for which the mobility service provider hosts connectivity and mobility services on behalf of the enterprise.",
      "ja": "o モビリティサービスプロバイダーがエンタープライズに代わって接続とモビリティサービスをホストするエンタープライズデータアクセスを提供します。"
    },
    {
      "indent": 3,
      "text": "o Provide access to service domains that are otherwise not accessible from public networks because of some mobility service provider's business reasons.",
      "ja": "o モビリティサービスプロバイダーのビジネス上の理由により、パブリックネットワークからアクセスできないサービスドメインへのアクセスを提供します。"
    },
    {
      "indent": 3,
      "text": "o Provide simultaneous access to different service domains that are separated based on policies of the mobility service provider.",
      "ja": "o モビリティサービスプロバイダーのポリシーに基づいて分離されたさまざまなサービスドメインへの同時アクセスを提供します。"
    },
    {
      "indent": 3,
      "text": "o Enable easier policy and quality of service assignment for mobility service providers based on the subscribed services.",
      "ja": "o サブスクライブサービスに基づいて、モビリティサービスプロバイダーのより簡単なポリシーとサービスの割り当てを有効にします。"
    },
    {
      "indent": 3,
      "text": "o In the absence of a specifically indicated service, the home agent MUST act as if the default service, plain Internet access, had been requested. There is no absolute requirement that this default service be allowed to all subscribers, but it is highly RECOMMENDED in order to avoid having normal subscribers employ operator-specific configuration values in order to get basic service.",
      "ja": "o 具体的に指定されたサービスがない場合、ホームエージェントは、デフォルトのサービスであるプレーンインターネットアクセスが要求されているかのように行動する必要があります。このデフォルトのサービスをすべてのサブスクライバーに許可するという絶対的な要件はありませんが、基本サービスを取得するために通常のサブスクライバーにオペレーター固有の構成値を採用することを避けるために強くお勧めします。"
    },
    {
      "indent": 3,
      "text": "This document describes a Service Selection Mobility Option for Mobile IPv6 that is intended to assist home agents to make specific service selections for the mobility service subscription during the binding registration procedure. The service selection may affect home agent routing decisions, Home Address or Home Network Prefix assignment policies, firewall settings, and security policies. The Service Selection option should be used in every Binding Update that makes a new registration to the home agent.",
      "ja": "このドキュメントでは、バインディング登録手順中にホームエージェントがモビリティサービスサブスクリプションの特定のサービス選択を行うのを支援することを目的としたモバイルIPv6のサービス選択モビリティオプションについて説明します。サービスの選択は、ホームエージェントルーティングの決定、ホームアドレスまたはホームネットワークのプレフィックス割り当てポリシー、ファイアウォール設定、セキュリティポリシーに影響を与える可能性があります。サービス選択オプションは、ホームエージェントに新しい登録を行うすべてのバインディングアップデートで使用する必要があります。"
    },
    {
      "indent": 3,
      "text": "Some of the potential use-cases were listed earlier in this section. The general aim is better manageability of services and service provisioning from the point of view of both operators and service providers. However, it should be understood that there are potential deployment possibilities where selecting a certain service may restrict simultaneous access to other services from a user's point of view. For example, services may be located in different administrative domains or external customer networks that practice excessive filtering of inbound and outbound traffic.",
      "ja": "潜在的なユースケースのいくつかは、このセクションの前にリストされています。一般的な目的は、オペレーターとサービスプロバイダーの両方の観点から、サービスの管理とサービスプロビジョニングのより良い管理性です。ただし、特定のサービスを選択すると、ユーザーの観点から他のサービスへの同時アクセスを制限する可能性がある場合、潜在的な展開の可能性があることを理解する必要があります。たとえば、サービスは、インバウンドトラフィックとアウトバウンドトラフィックの過度のフィルタリングを実践するさまざまな管理ドメインまたは外部顧客ネットワークに配置される場合があります。"
    },
    {
      "indent": 0,
      "text": "2. Requirements",
      "section_title": true,
      "ja": "2. 要件"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [1].",
      "ja": "「必須」、「そうしない」、「必須」、「shall」、「shall \"、\" ingle \"、\" should \"、\" not \"、\" becommended \"、\" bay \"、および「optional」は、[1]に記載されているとおりに解釈される。"
    },
    {
      "indent": 0,
      "text": "3. Service Selection Mobility Option",
      "section_title": true,
      "ja": "3. サービス選択モビリティオプション"
    },
    {
      "indent": 3,
      "text": "At most one Service Selection Mobility Option MAY be included in any Binding Update message. If the Binding Update message includes any authorization-related options (such as the Binding Authorization Data option [2]) or authentication related options (such as the Mobility Message Authentication option [8]), then the Service Selection option MUST appear before any mobility message authorization- or authentication-related options.",
      "ja": "せいぜい1つのサービス選択モビリティオプションは、任意のバインディングアップデートメッセージに含まれる場合があります。バインディングアップデートメッセージに承認関連オプション（バインディング認証データオプション[2]など）または認証関連オプション（モビリティメッセージ認証オプション[8]など）が含まれている場合、モビリティの前にサービス選択オプションが表示される必要がありますメッセージ認証 - 認証関連オプション。"
    },
    {
      "indent": 3,
      "text": "The Service Selection option SHOULD NOT be sent to a correspondent node. The mobile node cannot assume that the correspondent node has any knowledge about a specific service selection made between the mobile node and the home agent.",
      "ja": "サービス選択オプションは、特派員ノードに送信しないでください。モバイルノードは、特派員ノードがモバイルノードとホームエージェントの間で行われた特定のサービスの選択に関する知識を持っていると想定することはできません。"
    },
    {
      "indent": 3,
      "text": "The Service Selection option has no alignment requirement as such.",
      "ja": "サービス選択オプションには、そのようなアライメント要件がありません。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n                                +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n                                |  Type = 20    |   Length      |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n| Identifier...\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 21,
      "text": "Service Selection Mobility Option",
      "ja": "サービス選択モビリティオプション"
    },
    {
      "indent": 3,
      "text": "o Type: 8-bit identifier set to 20 of the type of the skipable mobility option.",
      "ja": "o タイプ：スキップ可能なモビリティオプションのタイプの20に設定された8ビット識別子。"
    },
    {
      "indent": 3,
      "text": "o Length: 8-bit unsigned integer, representing the length of the Service Selection Mobility Option in octets, excluding the Option Type and Option Length fields. A value of zero (0) is not allowed.",
      "ja": "o "
    },
    {
      "indent": 3,
      "text": "o Identifier: A variable-length encoded service identifier string used to identify the requested service. The identifier string length is between 1 and 255 octets. This specification allows international identifier strings that are based on the use of Unicode characters, encoded as UTF-8 [3], and formatted using Normalization Form KC (NFKC) as specified in [4].",
      "ja": "o 識別子：要求されたサービスを識別するために使用される可変長エンコードサービス識別子文字列。識別子文字列の長さは1〜255オクテットです。この仕様により、UTF-8 [3]としてエンコードされ、[4]で指定された正規化フォームKC（NFKC）を使用してフォーマットされたユニコード文字の使用に基づいた国際識別子文字列が可能になります。"
    },
    {
      "indent": 6,
      "text": "'ims', 'voip', and 'voip.companyxyz.example.com' are valid examples of Service Selection option Identifiers. At minimum, the Identifier MUST be unique among the home agents to which the mobile node is authorized to register.",
      "ja": "「IMS」、「VoIP」、および「voip.companyxyz.example.com」は、サービス選択オプション識別子の有効な例です。少なくとも、識別子は、モバイルノードが登録する権限があるホームエージェントの中で一意でなければなりません。"
    },
    {
      "indent": 0,
      "text": "4. Processing Considerations",
      "section_title": true,
      "ja": "4. 考慮事項の処理"
    },
    {
      "indent": 0,
      "text": "4.1. Mobile Node Considerations",
      "section_title": true,
      "ja": "4.1. モバイルノードの考慮事項"
    },
    {
      "indent": 3,
      "text": "A mobile node or a Proxy Mobile IPv6 client MAY include, at most, one Service Selection Mobility Option into a Binding Update message. The option is used to identify the service to be associated with the binding registration and SHOULD only be included into the initial Binding Update message sent to a home agent. If the mobile node wishes to change the selected service, it is RECOMMENDED that the mobile node de-register the existing binding with the home agent before proceeding with a binding registration for a different service. The provisioning of the service identifiers to the mobile node or to the Proxy Mobile IPv6 client is out of the scope of this specification.",
      "ja": "モバイルノードまたはプロキシモバイルIPv6クライアントには、せいぜい1つのサービス選択モビリティオプションをバインディングアップデートメッセージに含めることができます。このオプションは、拘束力のある登録に関連するサービスを特定するために使用され、ホームエージェントに送信された最初のバインディングアップデートメッセージにのみ含める必要があります。モバイルノードが選択したサービスの変更を希望する場合、モバイルノードは、別のサービスの拘束力のある登録を進める前に、ホームエージェントとの既存のバインディングを解除することをお勧めします。モバイルノードまたはプロキシモバイルIPv6クライアントへのサービス識別子のプロビジョニングは、この仕様の範囲外です。"
    },
    {
      "indent": 3,
      "text": "The placement of the Service Selection option is as follows: when present, this option MUST appear after the Mobile Node-Network Access Identifier (MN-NAI) option, if the MN-NAI option is present, and before any authorization- and authentication-related options. The Service Selection option can be used with any mobile node identification method such as a home address, an MN-NAI, and credentials suitable for IKEv2.",
      "ja": "サービス選択オプションの配置は次のとおりです。存在する場合、このオプションはモバイルノードネットワークアクセス識別子（MN-NAI）オプションの後、MN-NAIオプションが存在する場合、および認証および認証の前に表示する必要があります。関連オプション。サービス選択オプションは、自宅の住所、MN-NAI、IKEV2に適した資格情報などのモバイルノード識別方法で使用できます。"
    },
    {
      "indent": 3,
      "text": "If the mobile node receives a Binding Acknowledgement with a Status Code set to SERVICE_AUTHORIZATION_FAILED and the mobile node has an existing binding with the Home Address or the Home Network Prefix used in the failed Binding Update message, the mobile node MUST delete the existing binding. If there is no existing binding, the mobile node proceeds as with any failed initial binding registration.",
      "ja": "MobileノードがService_Authorization_Failedに設定されたステータスコードを使用してバインディングの確認を受信し、モバイルノードが障害のあるバインディングアップデートメッセージで使用されるホームアドレスまたはホームネットワークのプレフィックスとの既存のバインディングを持つ場合、モバイルノードは既存のバインディングを削除する必要があります。既存のバインディングがない場合、モバイルノードは、初期バインディング登録の失敗と同様に進行します。"
    },
    {
      "indent": 0,
      "text": "4.2. Home Agent Considerations",
      "section_title": true,
      "ja": "4.2. ホームエージェントの考慮事項"
    },
    {
      "indent": 3,
      "text": "Upon receiving a Binding Update message with a Service Selection option, the home agent authenticates and authorizes the mobile node. If the home agent supports the Service Selection, it MUST also verify that the mobile node is authorized for the service it included in the Service Selection option. The services the mobile node is authorized for SHOULD be part of the general mobile node subscription profile. If the mobile node is not authorized for the service, the home agent MUST deny the registration and send a Binding Acknowledgement with a Status Code set to SERVICE_AUTHORIZATION_FAILED (151).",
      "ja": "サービス選択オプションを使用してバインディングアップデートメッセージを受信すると、ホームエージェントはモバイルノードを認証および承認します。ホームエージェントがサービスの選択をサポートしている場合、モバイルノードがサービス選択オプションに含まれるサービスに対して許可されていることを確認する必要があります。モバイルノードが許可されているサービスは、一般的なモバイルノードサブスクリプションプロファイルの一部である必要があります。モバイルノードがサービスに対して許可されていない場合、ホームエージェントは登録を拒否し、service_authorization_failed（151）に設定されたステータスコードを使用して拘束力のある承認を送信する必要があります。"
    },
    {
      "indent": 3,
      "text": "The Service Selection option is used to assist the authorization and identifies a specific service that is to be authorized. The Service Selection option MAY also affect the Home Address or the Home Network Prefix allocation when, for example, used with the MN-NAI option. For example, for the same NAI there MAY be different Home Addresses or Home Network Prefixes depending on the identified service. Furthermore, the Service Selection option MAY also affect the routing of the outbound IP packets in the home agent depending on the selected service. The home agent MAY also apply different policy or quality of service treatment to traffic flows based on the selected service.",
      "ja": "サービス選択オプションは、承認を支援するために使用され、承認される特定のサービスを特定します。たとえば、MN-NAIオプションで使用される場合、サービス選択オプションはホームアドレスまたはホームネットワークのプレフィックス割り当てにも影響します。たとえば、同じNAIの場合、特定されたサービスに応じて、異なるホームアドレスまたはホームネットワークのプレフィックスがある場合があります。さらに、選択したサービスに応じて、サービス選択オプションは、ホームエージェントのアウトバウンドIPパケットのルーティングにも影響する場合があります。また、ホームエージェントは、選択したサービスに基づいて、さまざまなポリシーまたはサービスの扱いをトラフィックフローに適用する場合があります。"
    },
    {
      "indent": 3,
      "text": "If the newly arrived Binding Update message with a Service Selection option indicates a change in the selected service, then the home agent MUST re-authorize the mobile node. Depending on the home agent policies, the services policies, Home Address or Home Network Prefix allocation policies, and the subscription policies, the home agent may or may not be able to authorize the mobile node to the new service. For example, the existing service and the new service could require different Home Network Prefixes. If the authorization fails, then the home agent MUST deny the registration, delete any binding with the existing Home Address or Home Network Prefix, and send a Binding Acknowledgement with a Status Code set to SERVICE_AUTHORIZATION_FAILED (151).",
      "ja": "新しく到着したバインディングアップデートメッセージがサービス選択オプションを使用して選択したサービスの変更を示した場合、ホームエージェントはモバイルノードを再承認する必要があります。ホームエージェントのポリシー、サービスポリシー、ホームアドレス、またはホームネットワークのプレフィックス割り当てポリシー、およびサブスクリプションポリシーに応じて、ホームエージェントはモバイルノードを新しいサービスに承認できる場合とできない場合があります。たとえば、既存のサービスと新しいサービスには、異なるホームネットワークのプレフィックスが必要になる場合があります。承認が失敗した場合、ホームエージェントは登録を拒否し、既存のホームアドレスまたはホームネットワークのプレフィックスとのバインディングを削除し、service_authorization_failed（151）に設定されたステータスコードを使用して拘束力のある確認を送信する必要があります。"
    },
    {
      "indent": 0,
      "text": "4.3. Correspondent Node Considerations",
      "section_title": true,
      "ja": "4.3. 特派員ノードの考慮事項"
    },
    {
      "indent": 3,
      "text": "Unless the correspondent node and the home agent share the same knowledge about mobility services, the Service Selection option is more or less useless information to the correspondent node. The correspondent node SHOULD silently ignore the Service Selection option in this case.",
      "ja": "特派員ノードとホームエージェントがモビリティサービスに関する同じ知識を共有しない限り、サービスの選択オプションは、通信者ノードに対する多かれ少なかれ役に立たない情報です。この場合、特派員ノードはサービス選択オプションを静かに無視する必要があります。"
    },
    {
      "indent": 3,
      "text": "There are deployment cases where the home agent and a correspondent node, for example, belong to the same administrative domain. In this case, it is possible that the correspondent node shares the same knowledge of the services as the home agent. Therefore, the correspondent node is, for example, able to provide service-based traffic handling to mobile nodes.",
      "ja": "たとえば、ホームエージェントと特派員ノードが同じ管理ドメインに属する展開ケースがあります。この場合、特派員ノードがホームエージェントと同じサービスの知識を共有する可能性があります。したがって、特派員ノードは、たとえば、モバイルノードにサービスベースのトラフィック処理を提供できます。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "The protection for the Service Selection Mobility Option depends on the service that is being identified and eventually selected. If the service selection information should not be revealed on the wire, Binding Updates and Binding Acknowledgements should use Encapsulating Security Payload (ESP) [9] in transport mode with a non-null encryption transform to provide message confidentiality.",
      "ja": "サービス選択モビリティオプションの保護は、特定され、最終的に選択されているサービスによって異なります。ワイヤーでサービスの選択情報を明らかにしない場合、拘束力のある更新と拘束力のある謝辞は、非ヌル暗号化変換を使用して輸送モードでカプセル化セキュリティペイロード（ESP）[9]を使用してメッセージの機密性を提供する必要があります。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "A new Mobile IPv6 Mobility Option type has been assigned for the following new mobility option described in Section 3:",
      "ja": "セクション3で説明されている次の新しいモビリティオプションに、新しいモバイルIPv6モビリティオプションタイプが割り当てられています。"
    },
    {
      "indent": 7,
      "text": "Service Selection Mobility Option is set to 20",
      "ja": "サービス選択モビリティオプションは20に設定されています"
    },
    {
      "indent": 3,
      "text": "A new Mobile IPv6 registration denied by home agent Status Code has been assigned. The Status Code was allocated from the range 128-255:",
      "ja": "ホームエージェントステータスコードによって拒否された新しいモバイルIPv6登録が割り当てられました。ステータスコードは、範囲128-255から割り当てられました。"
    },
    {
      "indent": 7,
      "text": "SERVICE_AUTHORIZATION_FAILED is set to 151",
      "ja": "service_authorization_failedは151に設定されています"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgements",
      "section_title": true,
      "ja": "7. 謝辞"
    },
    {
      "indent": 3,
      "text": "Jouni Korhonen would like to thank the TEKES MERCoNe project for providing funding to work on this document. The authors would like to thank Jari Arkko for his thorough review.",
      "ja": "Jouni Korhonenは、この文書に取り組むための資金提供を提供してくれたTekes Mercone Projectに感謝したいと思います。著者は、Jari Arkkoの徹底的なレビューに感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8. 参考文献"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "ja": "8.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[1] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[1] Bradner、S。、「要件レベルを示すためにRFCで使用するためのキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[2] Johnson, D., Perkins, C., and J. Arkko, \"Mobility Support in IPv6\", RFC 3775, June 2004.",
      "ja": "[2] Johnson、D.、Perkins、C。、およびJ. Arkko、「IPv6のモビリティサポート」、RFC 3775、2004年6月。"
    },
    {
      "indent": 3,
      "text": "[3] Yergeau, F., \"UTF-8, a transformation format of ISO 10646\", STD 63, RFC 3629, November 2003.",
      "ja": "[3] Yergeau、F。、「UTF-8、ISO 10646の変換形式」、STD 63、RFC 3629、2003年11月。"
    },
    {
      "indent": 3,
      "text": "[4] Davis, M. and M. Duerst, \"Unicode Standard Annex #15; Unicode Normalization Forms\", Unicode 5.0.0, October 2006.",
      "ja": "[4] Davis、M。およびM. Duerst、「Unicode Standard Annex＃15; Unicode Normalization Forms」、Unicode 5.0.0、2006年10月。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "ja": "8.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[5] Gundavelli, S., Leung, K., Devarapalli, V., Chowdhury, K., and B. Patil, \"Proxy Mobile IPv6\", Work in Progress, December 2007.",
      "ja": "[5] Gundavelli、S.、Leung、K.、Devarapalli、V.、Chowdhury、K。、およびB. Patil、「Proxy Mobile IPv6」、2007年12月の進行中。"
    },
    {
      "indent": 3,
      "text": "[6] Aboba, B., Beadles, M., Arkko, J., and P. Eronen, \"The Network Access Identifier\", RFC 4282, December 2005.",
      "ja": "[6] Aboba、B.、Beadles、M.、Arkko、J。、およびP. Eronen、「ネットワークアクセス識別子」、RFC 4282、2005年12月。"
    },
    {
      "indent": 3,
      "text": "[7] Patel, A., Leung, K., Khalil, M., Akhtar, H., and K. Chowdhury, \"Mobile Node Identifier Option for Mobile IPv6 (MIPv6)\", RFC 4283, November 2005.",
      "ja": "[7] Patel、A.、Leung、K.、Khalil、M.、Akhtar、H。、およびK. Chowdhury、「モバイルIPv6のモバイルノード識別子オプション」、RFC 4283、2005年11月。"
    },
    {
      "indent": 3,
      "text": "[8] Patel, A., Leung, K., Khalil, M., Akhtar, H., and K. Chowdhury, \"Authentication Protocol for Mobile IPv6\", RFC 4285, January 2006.",
      "ja": "[8] Patel、A.、Leung、K.、Khalil、M.、Akhtar、H。、およびK. Chowdhury、「モバイルIPv6の認証プロトコル」、RFC 4285、2006年1月。"
    },
    {
      "indent": 3,
      "text": "[9] Kent, S., \"IP Encapsulating Security Payload (ESP)\", RFC 4303, December 2005.",
      "ja": "[9] Kent、S。、「セキュリティペイロード（ESP）のカプセル化IP」、RFC 4303、2005年12月。"
    },
    {
      "indent": 3,
      "text": "[10] Devarapalli, V. and F. Dupont, \"Mobile IPv6 Operation with IKEv2 and the Revised IPsec Architecture\", RFC 4877, April 2007.",
      "ja": "[10] Devarapalli、V。およびF. Dupont、「IKEV2および改訂されたIPSECアーキテクチャによるモバイルIPv6操作」、RFC 4877、2007年4月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Jouni Korhonen TeliaSonera Corporation P.O. Box 970 FIN-00051 Sonera Finland",
      "ja": "Jouni Korhonen Teliasonera Corporation P.O.ボックス970 FIN-00051ソネラフィンランド"
    },
    {
      "indent": 3,
      "text": "EMail: jouni.korhonen@teliasonera.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Ulf Nilsson TeliaSonera Corporation Marbackagatan 11 S-123 86 Farsta Sweden",
      "ja": "Ulf Nilsson Teliasonera Corporation Marbackagatan 11 S-123 86 Farsta Sweden"
    },
    {
      "indent": 3,
      "text": "EMail: ulf.s.nilsson@teliasonera.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Vijay Devarapalli Azaire Networks 4800 Great America Pkwy Santa Clara, CA 95054 USA",
      "ja": "Vijay Devarapalli Azaire Networks 4800 Great America Pkwy Santa Clara、CA 95054 USA"
    },
    {
      "indent": 3,
      "text": "EMail: vijay.devarapalli@azairenet.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The IETF Trust (2008).",
      "ja": "著作権（c）The IETF Trust（2008）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "この文書は、BCP 78に含まれる権利、ライセンス、および制限の対象となり、そこに記載されている場合を除き、著者はすべての権利を保持しています。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE IETF TRUST AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "このドキュメントとここに含まれる情報は、「現状のまま」に基づいて提供され、貢献者、彼/彼女が代表する組織（もしあれば）、インターネット協会、IETFトラスト、インターネットエンジニアリングタスクフォースがすべてを否認します。明示的または黙示的な保証。ここでの情報の使用は、特定の目的に対する商品性または適合性の権利または暗黙の保証を侵害しないという保証を含むがこれらに限定されない。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、知的財産権またはその他の権利の有効性または範囲に関して、この文書に記載されている技術の実装または使用、またはそのような権利に基づくライセンスがどの程度であるかについての使用に関連すると主張する可能性があるという立場はありません。利用可能になります。また、そのような権利を特定するために独立した努力をしたことも表明していません。RFCドキュメントの権利に関する手順に関する情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IETF事務局に行われたIPR開示のコピーと、利用可能にするライセンスの保証、またはこの仕様の実装者またはユーザーによるそのような独自の権利の使用のための一般的なライセンスまたは許可を取得しようとする試みの結果を取得できます。http://www.ietf.org/iprのIETFオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、関心のある当事者に、著作権、特許、または特許出願、またはこの基準を実装するために必要な技術をカバーする可能性のあるその他の独自の権利を注意深く招待するよう招待しています。ietf-ipr@ietf.orgのIETFへの情報をお問い合わせください。"
    }
  ]
}