{
  "title": {
    "text": "RFC 5857 - IKEv2 Extensions to Support Robust Header Compression over IPsec",
    "ja": "RFC 5857 - IKEv2の拡張機能は、IPsec上でロバストヘッダ圧縮をサポートします"
  },
  "number": 5857,
  "created_at": "2019-10-29 23:03:45.905643+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                        E. Ertekin\nRequest for Comments: 5857                                   C. Christou\nCategory: Standards Track                                      R. Jasani\nISSN: 2070-1721                                      Booz Allen Hamilton\n                                                              T. Kivinen\n                                                         AuthenTec, Inc.\n                                                              C. Bormann\n                                                 Universitaet Bremen TZI\n                                                                May 2010",
      "raw": true
    },
    {
      "indent": 4,
      "text": "IKEv2 Extensions to Support Robust Header Compression over IPsec",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "In order to integrate Robust Header Compression (ROHC) with IPsec, a mechanism is needed to signal ROHC channel parameters between endpoints. Internet Key Exchange (IKE) is a mechanism that can be leveraged to exchange these parameters. This document specifies extensions to IKEv2 that will allow ROHC and its associated channel parameters to be signaled for IPsec Security Associations (SAs).",
      "ja": "IPsecでロバストヘッダ圧縮（ROHC）を統合するために、機構は、エンドポイント間のROHCチャネルパラメータをシグナリングするために必要とされます。インターネット鍵交換（IKE）は、これらのパラメータを交換するために活用することができる仕組みです。この文書では、IPsecセキュリティアソシエーション（SA）の合図をするROHCおよびそれに関連するチャネルパラメータを許可するのIKEv2への拡張を指定します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc5857.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc5857で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2010 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2010 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 3,
      "text": "This document may contain material from IETF Documents or IETF Contributions published or made publicly available before November 10, 2008. The person(s) controlling the copyright in some of this material may not have granted the IETF Trust the right to allow modifications of such material outside the IETF Standards Process. Without obtaining an adequate license from the person(s) controlling the copyright in such materials, this document may not be modified outside the IETF Standards Process, and derivative works of it may not be created outside the IETF Standards Process, except to format it for publication as an RFC or to translate it into languages other than English.",
      "ja": "この材料の一部がIETFトラストにこのような材料の変更を許可する権利を与えられていない可能性がありますにこの文書は、2008年、IETFドキュメントまたは11月10日以前に発行または公開さIETF貢献から著作権を支配する者（複数可）材料を含んでいてもよいですIETF標準化プロセスの外。そのような材料の著作権を管理者（単数または複数）から適切なライセンスを取得することなく、この文書は、IETF標準化過程の外側修正されないかもしれません、そして、それの派生物は、IETF標準化過程の外側に作成されない場合があり、それをフォーマットする以外出版RFCとして、英語以外の言語に翻訳します。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n2. Terminology .....................................................3\n3. ROHC Channel Initialization for ROHCoIPsec ......................3\n   3.1. ROHC_SUPPORTED Notify Message ..............................3\n        3.1.1. ROHC Attributes .....................................5\n        3.1.2. ROHC Attribute Types ................................6\n   3.2. ROHC Channel Parameters That Are Implicitly Set ............9\n4. Security Considerations .........................................9\n5. IANA Considerations .............................................9\n6. Acknowledgments ................................................10\n7. References .....................................................11\n   7.1. Normative References ......................................11\n   7.2. Informative References ....................................12",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "Increased packet header overhead due to IPsec [IPSEC] can result in the inefficient utilization of bandwidth. Coupling ROHC [ROHC] with IPsec offers an efficient way to transfer protected IP traffic.",
      "ja": "原因のIPsec [IPSEC]にパケットヘッダのオーバーヘッドを増加することは、帯域幅の非効率的な利用をもたらすことができます。 IPsecのとのカップリングROHC [ROHC]は保護されたIPトラフィックを転送するための効率的な方法を提供しています。"
    },
    {
      "indent": 3,
      "text": "ROHCoIPsec [ROHCOIPSEC] requires configuration parameters to be initialized at the compressor and decompressor. Current specifications for hop-by-hop ROHC negotiate these parameters through a link-layer protocol such as the Point-to-Point Protocol (PPP) (i.e., ROHC over PPP [ROHC-PPP]). Since key exchange protocols (e.g., IKEv2 [IKEV2]) can be used to dynamically establish parameters between IPsec peers, this document defines extensions to IKEv2 to signal ROHC parameters for ROHCoIPsec.",
      "ja": "ROHCoIPsec [ROHCOIPSEC]はコンプレッサーと減圧時に初期化される設定パラメータを必要とします。ホップバイホップROHCのための現在の仕様は、ポイントツーポイントプロトコル（PPP）（PPPオーバーすなわち、ROHC [ROHC-PPP]）のようなリンク層プロトコルを介してこれらのパラメータを交渉します。鍵交換プロトコル（例えば、IKEv2の【のIKEv2]）を動的にIPsecピア間でパラメータを確立するために使用することができるので、この文書はROHCoIPsecためROHCパラメータを知らせるためのIKEv2への拡張を定義します。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "ja": "2.用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [BRA97].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はありますRFC 2119 [BRA97]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "3. ROHC Channel Initialization for ROHCoIPsec",
      "section_title": true,
      "ja": "ROHCoIPsec 3. ROHCチャンネルの初期化"
    },
    {
      "indent": 3,
      "text": "The following subsections define extensions to IKEv2 that enable an initiator and a responder to signal parameters required to establish a ROHC channel for a ROHCoIPsec session.",
      "ja": "以下のサブセクションでは、イニシエータとROHCoIPsecセッションのROHCチャネルを確立するために必要なパラメータを通知する応答を有効にするのIKEv2の拡張機能を定義します。"
    },
    {
      "indent": 0,
      "text": "3.1. ROHC_SUPPORTED Notify Message",
      "section_title": true,
      "ja": "3.1. メッセージを通知ROHC_SUPPORTED"
    },
    {
      "indent": 3,
      "text": "ROHC channel parameters MUST be signaled separately for each ROHC-enabled IPsec SA. Specifically, a new Notify message type MUST be included in the IKE_AUTH and CREATE_CHILD_SA exchanges whenever a new ROHC-enabled IPsec SA is created, or an existing one is rekeyed.",
      "ja": "ROHCチャネルパラメータは、各ROHC対応のIPsec SAのために別々にシグナリングされなければなりません。具体的には、新たな通知メッセージのタイプは、新しいROHC対応のIPsec SAが作成された、または既存のがリキーされるたびIKE_AUTHとCREATE_CHILD_SA交換に含まれなければなりません。"
    },
    {
      "indent": 3,
      "text": "The Notify payload sent by the initiator MUST contain the channel parameters for the ROHC session. These parameters indicate the capabilities of the ROHC decompressor at the initiator. Upon receipt of the initiator's request, the responder will either ignore the payload (if it doesn't support ROHC or the proposed parameters) or respond with a Notify payload that contains its own ROHC channel parameters.",
      "ja": "イニシエータによって送信された通知ペイロードがROHCセッションのためのチャネルパラメータを含まなければなりません。これらのパラメータは、イニシエータでROHCデコンプレッサの能力を示しています。 （それはROHCや提案のパラメータをサポートしていない場合）、イニシエータの要求を受信すると、レスポンダはペイロードを無視するか、または独自のROHCチャンネルパラメータを含む通知ペイロードで応答します。"
    },
    {
      "indent": 3,
      "text": "Note that only one Notify payload is used to convey ROHC parameters. If multiple Notify payloads containing ROHC parameters are received, all but the first such Notify payload MUST be dropped. If the initiator does not receive a Notify payload with the responder's ROHC channel parameters, ROHC MUST NOT be enabled on the Child SA.",
      "ja": "一つだけがROHCパラメータを伝えるために使用されたペイロードを通知することに注意してください。複数のROHCパラメータを含むペイロードが受信された通知した場合、最初の通知そのようなペイロードが、すべては廃棄されなければなりません。イニシエータは、レスポンダのROHCチャンネルパラメータで通知ペイロードを受信しない場合、ROHCは子供SA上で有効にすることはできません。"
    },
    {
      "indent": 3,
      "text": "A new Notify Message Type value, denoted ROHC_SUPPORTED, indicates that the Notify payload is conveying ROHC channel parameters (Section 4).",
      "ja": "ROHC_SUPPORTEDを付し、メッセージタイプ値を新たな通知、通知ペイロードがROHCチャネルパラメータ（セクション4）を搬送していることを示します。"
    },
    {
      "indent": 3,
      "text": "The Notify payload (defined in RFC 4306 [IKEV2]) is illustrated in Figure 1.",
      "ja": "（【のIKEv2] RFC 4306で定義された）通知ペイロードは、図1に示されています。"
    },
    {
      "indent": 6,
      "text": "                     1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n! Next Payload  !C!  RESERVED   !         Payload Length        !\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n!  Protocol ID  !   SPI Size    !      Notify Message Type      !\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n!                                                               !\n~                Security Parameter Index (SPI)                 ~\n!                                                               !\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n!                                                               !\n~                       Notification Data                       ~\n!                                                               !\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 25,
      "text": "Figure 1. Notify Payload Format",
      "ja": "図1.ペイロードフォーマットを通知します"
    },
    {
      "indent": 3,
      "text": "The fields of the Notify payload are set as follows:",
      "ja": "次のように通知ペイロードのフィールドが設定されています。"
    },
    {
      "indent": 3,
      "text": "Next Payload (1 octet)",
      "ja": "次ペイロード（1つのオクテット）"
    },
    {
      "indent": 6,
      "text": "Identifier for the payload type of the next payload in the message. Further details can be found in RFC 4306 [IKEV2].",
      "ja": "メッセージの次のペイロードのペイロードタイプの識別子。さらなる詳細は、RFC 4306 [IKEv2の]に見出すことができます。"
    },
    {
      "indent": 3,
      "text": "Critical (1 bit)",
      "ja": "クリティカル（1ビット）"
    },
    {
      "indent": 6,
      "text": "Since all IKEv2 implementations support the Notify payload, this value MUST be set to zero.",
      "ja": "全てのIKEv2実装が通知ペイロードをサポートするので、この値はゼロに設定しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Payload Length (2 octets)",
      "ja": "ペイロード長（2つのオクテット）"
    },
    {
      "indent": 6,
      "text": "As defined in RFC 4306 [IKEV2], this field indicates the length of the current payload, including the generic payload header.",
      "ja": "【のIKEv2] RFC 4306で定義されているように、このフィールドは、汎用ペイロード・ヘッダを含め、現在のペイロードの長さを示します。"
    },
    {
      "indent": 3,
      "text": "Protocol ID (1 octet)",
      "ja": "プロトコルID（1つのオクテット）"
    },
    {
      "indent": 6,
      "text": "Since this notification message is used during the creation of a Child SA, this field MUST be set to zero.",
      "ja": "この通知メッセージは、子SAの作成時に使用されているので、このフィールドはゼロに設定しなければなりません。"
    },
    {
      "indent": 3,
      "text": "SPI Size (1 octet)",
      "ja": "SPIサイズ（1つのオクテット）"
    },
    {
      "indent": 6,
      "text": "This value MUST be set to zero, since no SPI is applicable (ROHC parameters are set at SA creation; thus, the SPI has not been defined).",
      "ja": "この値は、ゼロに設定されなければならないというSPIが適用されないので（ROHCパラメータは、SAの作成時に設定されているため、SPIは、定義されていません）。"
    },
    {
      "indent": 3,
      "text": "Notify Message Type (2 octets)",
      "ja": "メッセージタイプを通知する（2つのオクテット）"
    },
    {
      "indent": 6,
      "text": "This field MUST be set to ROHC_SUPPORTED.",
      "ja": "このフィールドはROHC_SUPPORTEDに設定しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Security Parameter Index (SPI)",
      "ja": "セキュリティパラメータインデックス（SPI）"
    },
    {
      "indent": 6,
      "text": "Since the SPI Size field is 0, this field MUST NOT be transmitted.",
      "ja": "SPIサイズフィールドが0であるので、このフィールドは、送信してはなりません。"
    },
    {
      "indent": 3,
      "text": "Notification Data (variable)",
      "ja": "通知データ（変数）"
    },
    {
      "indent": 6,
      "text": "This field MUST contain at least three ROHC Attributes (Section 3.1.1).",
      "ja": "このフィールドには、少なくとも3つのROHCの属性（3.1.1項）を含まなければなりません。"
    },
    {
      "indent": 0,
      "text": "3.1.1. ROHC Attributes",
      "section_title": true,
      "ja": "3.1.1.  ROHCの属性"
    },
    {
      "indent": 3,
      "text": "The ROHC_SUPPORTED Notify message is used to signal channel parameters between ROHCoIPsec compressor and decompressor. The message contains a list of \"ROHC Attributes\", which contain the parameters required for the ROHCoIPsec session.",
      "ja": "ROHC_SUPPORTED通知メッセージはROHCoIPsecコンプレッサとデコンプレッサとの間のチャネルパラメータを通知するために使用されます。メッセージはROHCoIPsecセッションのために必要なパラメータが含まれている「ROHC属性」のリストが含まれています。"
    },
    {
      "indent": 3,
      "text": "The format for signaling ROHC Attributes takes a similar format to the Transform Attributes described in Section 3.3.5 of RFC 4306 [IKEV2]. The format of the ROHC Attribute is shown in Figure 2.",
      "ja": "ROHC属性をシグナリングするためのフォーマットは、RFC 4306 [のIKEv2]のセクション3.3.5に記載の変換属性と同様の形式をとります。 ROHC属性のフォーマットは、図2に示されています。"
    },
    {
      "indent": 7,
      "text": "                     1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n!A!     ROHC Attribute Type     !  AF=0  ROHC Attribute Length  !\n!F!                             !  AF=1  ROHC Attribute Value   !\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n!                   AF=0  ROHC Attribute Value                  !\n!                   AF=1  Not Transmitted                       !\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 17,
      "text": "Figure 2. Format of the ROHC Attribute",
      "ja": "ROHC属性の図2.フォーマット"
    },
    {
      "indent": 3,
      "text": "o Attribute Format (AF) (1 bit) - If the AF bit is a zero (0), then the ROHC Attribute is expressed in a Type/Length/Value format. If the AF bit is a one (1), then the ROHC attribute is expressed in a Type/Value (TV) format.",
      "ja": "Oフォーマット（AF）（1ビット）属性 -  AFビットがゼロ（0）、次いで、ROHC属性がタイプ/長さ/値の形式で表現される場合。 AFビットが1（1）であれば、ROHC属性がタイプ/値（TV）形式で表現されます。"
    },
    {
      "indent": 3,
      "text": "o ROHC Attribute Type (15 bits) - Unique identifier for each type of ROHC attribute (Section 3.1.2).",
      "ja": "ROHC属性の種類ごとに一意の識別子（セクション3.1.2） -  O ROHCは、タイプ（15ビット）属性。"
    },
    {
      "indent": 3,
      "text": "o ROHC Attribute Length (2 octets) - Length (in octets) of the Attribute Value. When the AF bit is a one (1), the ROHC Attribute Value is 2 octets and the ROHC Attribute Length field is not present.",
      "ja": "O ROHC属性長さ（2つのオクテット） - 属性値の長さ（オクテットで）。 AFビットが1（1）である場合に、ROHCの属性値は2つのオクテットであり、ROHC属性長フィールドは存在しません。"
    },
    {
      "indent": 3,
      "text": "o ROHC Attribute Value (variable length) - Value of the ROHC Attribute associated with the ROHC Attribute Type. If the AF bit is a zero (0), this field's length is defined by the ROHC Attribute Length field. If the AF bit is a one (1), the length of the ROHC Attribute Value is 2 octets.",
      "ja": "ROHC属性タイプに関連付けられたROHC属性の値 -  O ROHCは、値（可変長）属性。 AFビットがゼロである場合（0）、このフィールドの長さは、ROHC属性Lengthフィールドによって定義されます。 AFビットが1（1）である場合は、ROHCの属性値の長さは2つのオクテットです。"
    },
    {
      "indent": 0,
      "text": "3.1.2. ROHC Attribute Types",
      "section_title": true,
      "ja": "3.1.2.  ROHCの属性タイプ"
    },
    {
      "indent": 3,
      "text": "This section describes five ROHC Attribute Types: MAX_CID, ROHC_PROFILE, ROHC_INTEG, ROHC_ICV_LEN, and MRRU. The value allocated for each ROHC Attribute Type is specified in Section 4.",
      "ja": "MAX_CID、ROHC_PROFILE、ROHC_INTEG、ROHC_ICV_LEN、およびMRRU：このセクションでは、5 ROHCの属性タイプについて説明します。各ROHC属性タイプのために割り当てられた値は、セクション4で指定されています。"
    },
    {
      "indent": 3,
      "text": "MAX_CID (Maximum Context Identifier, AF = 1)",
      "ja": "MAX_CID（最大コンテキスト識別子、AF = 1）"
    },
    {
      "indent": 6,
      "text": "The MAX_CID attribute is a mandatory attribute. Exactly one MAX_CID attribute MUST be sent. The MAX_CID field indicates the maximum value of a context identifier supported by the ROHCoIPsec decompressor. This attribute value is 2 octets in length. The value for MAX_CID MUST be at least 0 and at most 16383. Since CIDs can take values between 0 and MAX_CID, the actual number of contexts that can be used are MAX_CID+1. If MAX_CID is 0, this implies having one context. The recipient of the MAX_CID Attribute MUST only use context identifiers up to MAX_CID for compression.",
      "ja": "MAX_CID属性は必須属性です。正確に一つMAX_CID属性を送らなければなりません。 MAX_CIDフィールドはROHCoIPsecデコンプレッサによってサポートされるコンテキスト識別子の最大値を示しています。この属性の値は、長さは2つのオクテットです。 CIDが0とMAX_CID間の値を取ることができるのでMAX_CIDの値が0以上と多くとも16383でなければなりません、使用することができるコンテキストの実際の数はMAX_CID + 1です。 MAX_CIDが0の場合、これは1つのコンテキストを持つ意味します。唯一のコンテキストを使用しなければならないMAX_CID属性の受信者は、圧縮のためにMAX_CIDまでの識別子。"
    },
    {
      "indent": 6,
      "text": "Note that the MAX_CID parameter is a one-way notification (i.e., the sender of the attribute indicates what it can handle to the other end); therefore, different values for MAX_CID may be announced in each direction.",
      "ja": "（すなわち、属性の送信者は、それがもう一方の端に扱うことができるかを示す）MAX_CIDパラメータが一方向の通知であることに注意してください。従って、MAX_CIDに対する異なる値は、各方向に発表されてもよいです。"
    },
    {
      "indent": 3,
      "text": "ROHC_PROFILE (ROHC Profile, AF = 1)",
      "ja": "ROHC_PROFILE（ROHCプロファイル、AF = 1）"
    },
    {
      "indent": 6,
      "text": "The ROHC_PROFILE attribute is a mandatory attribute. Each ROHC_PROFILE attribute has a fixed length of 4 octets, and its attribute value is a 2-octet long ROHC Profile Identifier [ROHCPROF]. There MUST be at least one ROHC_PROFILE attribute included in the ROHC_SUPPORTED Notify message. If multiple ROHC_PROFILE attributes are sent, the order is arbitrary. The recipient of a ROHC_PROFILE attribute(s) MUST only use the profile(s) proposed for compression.",
      "ja": "ROHC_PROFILE属性は必須の属性です。各ROHC_PROFILE属性は4つのオクテットの固定長を有し、その属性値が2オクテット長ROHCプロファイル識別子[ROHCPROF]です。 ROHC_SUPPORTEDに含まれる少なくとも1つのROHC_PROFILE属性がメッセージを通知があるに違いありません。複数ROHC_PROFILE属性が送信された場合、順序は任意です。 ROHC_PROFILE属性（単数または複数）の受信者は、圧縮のために提案されたプロファイル（単数または複数）を使用しなければなりません。"
    },
    {
      "indent": 6,
      "text": "Several common profiles are defined in RFCs 3095 [ROHCV1] and 5225 [ROHCV2]. Note, however, that two versions of the same profile MUST NOT be signaled. For example, if a ROHCoIPsec decompressor supports both ROHCv1 UDP (0x0002) and ROHCv2 UDP (0x0102), both profiles MUST NOT be signaled. This restriction is needed, as packets compressed by ROHC express only the 8 least-significant bits of the profile identifier; since the 8 least-significant bits for corresponding profiles in ROHCv1 and ROHCv2 are identical, the decompressor is not capable of determining the ROHC version that was used to compress the packet.",
      "ja": "いくつかの一般的なプロファイルは、RFCの3095 [ROHCV1]と5225 [ROHCV2]で定義されています。同じプロファイルの2つのバージョンが通知されてはならないこと、しかし、注意してください。 ROHCoIPsecデコンプレッサはROHCv1 UDP（0×0002）とROHCv2 UDP（0x0102）の両方をサポートしている場合たとえば、両方のプロファイルが合図してはなりません。 ROHCによって圧縮されたパケットは、プロファイル識別子の唯一の8最下位ビットを表現するように、この制限は、必要とされます。 ROHCv1とROHCv2に対応するプロファイルの8最下位ビットが同じであるため、減圧装置はパケットを圧縮するために使用されたROHCのバージョンを決定することができません。"
    },
    {
      "indent": 6,
      "text": "Note that the ROHC_PROFILE attribute is a one-way notification; therefore, different values for ROHC_PROFILE may be announced in each direction.",
      "ja": "ROHC_PROFILE属性は一方向の通知であることに注意してください。従って、ROHC_PROFILEに対する異なる値は、各方向に発表されてもよいです。"
    },
    {
      "indent": 3,
      "text": "ROHC_INTEG (Integrity Algorithm for Verification of Decompressed Headers, AF = 1)",
      "ja": "ROHC_INTEG（解凍ヘッダを検証するための整合性アルゴリズム、AF = 1）"
    },
    {
      "indent": 6,
      "text": "The ROHC_INTEG attribute is a mandatory attribute. There MUST be at least one ROHC_INTEG attribute contained within the ROHC_SUPPORTED Notify message. The attribute value contains the identifier of an integrity algorithm that is used to ensure the integrity of the decompressed packets (i.e., ensure that the decompressed packet headers are identical to the original packet headers prior to compression).",
      "ja": "ROHC_INTEG属性は必須の属性です。メッセージを通知ROHC_SUPPORTED中に含まれる少なくとも1つのROHC_INTEG属性があるに違いありません。属性値が解凍パケットの完全性を保証するために使用される完全性アルゴリズムの識別子を含む（すなわち、解凍パケットヘッダを圧縮する前に、元のパケットヘッダと同一であることを確認）。"
    },
    {
      "indent": 6,
      "text": "Authentication algorithms that MUST be supported are specified in the \"Authentication Algorithms\" table in Section 3.1.1 (\"ESP Encryption and Authentication Algorithms\") of RFC 4835 [CRYPTO-ALG] (or its successor).",
      "ja": "サポートしなければならない認証アルゴリズムは、RFC 4835のセクション3.1.1（「ESP暗号化と認証アルゴリズム」）CRYPTO-ALG（またはその後継）に「認証アルゴリズム」テーブルで指定されています。"
    },
    {
      "indent": 6,
      "text": "The integrity algorithm is represented by a 2-octet value that corresponds to the value listed in the IKEv2 Parameters registry [IKEV2-PARA], \"Transform Type 3 - Integrity Algorithm Transform IDs\" section. Upon receipt of the ROHC_INTEG attribute(s), the responder MUST select exactly one of the proposed algorithms; the chosen value is sent back in the ROHC_SUPPORTED Notify message returned by the responder to the initiator. The selected integrity algorithm MUST be used in both directions. If the responder does not accept any of the algorithms proposed by the initiator, ROHC MUST NOT be enabled on the SA.",
      "ja": "セクション - インテグリティアルゴリズムはIKEv2のパラメータレジストリ[IKEv2のパラ]、「インテグリティアルゴリズムIDを変換タイプ3の変換」に記載されている値に対応する2オクテットの値によって表されます。 ROHC_INTEG属性（単数または複数）を受信すると、レスポンダは正確提案アルゴリズムのいずれかを選択しなければなりません。選択された値は、イニシエータに応答によって返さROHC_SUPPORTED通知メッセージに返信されます。選択された完全性アルゴリズムは両方向で使用しなければなりません。レスポンダは、イニシエータによって提案されたアルゴリズムのいずれかを受け入れない場合は、ROHCがSAで有効になってはなりません。"
    },
    {
      "indent": 6,
      "text": "It is noted that:",
      "ja": "これは、ことが注目されます。"
    },
    {
      "indent": 6,
      "text": "1. The keys (one for each direction) for this integrity algorithm are derived from the IKEv2 KEYMAT (see [IKEV2], Section 2.17). For the purposes of this key derivation, ROHC is considered to be an IPsec protocol. When a ROHC-enabled CHILD_SA is rekeyed, the key associated with this integrity algorithm is rekeyed as well.",
      "ja": "1.この完全性アルゴリズムのためのキー（各方向に1つ）は（[のIKEv2]セクション2.17を参照）のIKEv2 KEYMATから誘導されます。このキー導出の目的のために、ROHCは、IPsecプロトコルであると考えられます。 ROHC対応CHILD_SAがリキーされた場合、この整合性アルゴリズムに関連付けられたキーも同様に再 - 合わせています。"
    },
    {
      "indent": 6,
      "text": "2. A ROHCoIPsec initiator MAY signal a value of zero (0x0000) in a ROHC_INTEG attribute. This corresponds to \"NONE\" in the \"IKEv2 Integrity Algorithm Transform IDs\" registry. The ROHCoIPsec responder MAY select this value by responding to the initiator with a ROHC_INTEG attribute of zero (0x0000). In this scenario, no integrity algorithm is applied in either direction.",
      "ja": "2. A ROHCoIPsec開始剤はROHC_INTEG属性にゼロ（0000）の値をシグナリングすることができます。これは、「IKEv2の整合性アルゴリズムのIDを変換する」レジストリで「NONE」に対応します。 ROHCoIPsecレスポンダはゼロ（0000）のROHC_INTEG属性を持つイニシエータに応答することによって、この値を選択してもよいです。このシナリオでは、整合性アルゴリズムがどちらの方向に適用されません。"
    },
    {
      "indent": 6,
      "text": "3. The ROHC_INTEG attribute is a parameter that is negotiated between two ends. In other words, the initiator indicates what it supports, the responder selects one of the ROHC_INTEG values proposed and sends the selected value to the initiator.",
      "ja": "3. ROHC_INTEG属性は、両端の間で交渉されるパラメータです。換言すれば、イニシエータはレスポンダが提案ROHC_INTEG値のいずれかを選択し、イニシエータに選択された値を送信し、それがサポートするかを示します。"
    },
    {
      "indent": 3,
      "text": "ROHC_ICV_LEN (Integrity Algorithm Length, AF = 1)",
      "ja": "ROHC_ICV_LEN（整合性アルゴリズムの長さ、AF = 1）"
    },
    {
      "indent": 6,
      "text": "The ROHC_ICV_LEN attribute is an optional attribute. There MAY be zero or one ROHC_ICV_LEN attribute contained within the ROHC_SUPPORTED Notify message. The attribute specifies the number of Integrity Check Value (ICV) octets the sender expects to receive on incoming ROHC packets. The ICV of the negotiated ROHC_INTEG algorithms MUST be truncated to ROHC_ICV_LEN bytes by taking the first ROHC_ICV_LEN bytes of the output. Both the initiator and responder announce a single value for their own ICV length. The recipient of the ROHC_ICV_LEN attribute MUST truncate the ICV to the length contained in the message. If the value of the ROHC_ICV_LEN attribute is zero, then an ICV MUST NOT be sent. If no ROHC_ICV_LEN attribute is sent at all or if the ROHC_ICV_LEN is larger than the length of the ICV of selected algorithm, then the full ICV length as specified by the ROHC_INTEG algorithm MUST be sent.",
      "ja": "ROHC_ICV_LEN属性はオプション属性です。メッセージを通知ROHC_SUPPORTED内に含まれ、ゼロまたは1 ROHC_ICV_LEN属性があるかもしれません。属性が指定するの整合性の数をチェック値（ICV）は、送信者が着信ROHCパケットで受信することを期待オクテット。ネゴシエートROHC_INTEGアルゴリズムのICVは、出力の最初のROHC_ICV_LENバイトを取ることによってROHC_ICV_LENバイトに切り捨てなければなりません。イニシエータとレスポンダの両方が自分のICVの長さのために単一の値を発表します。 ROHC_ICV_LEN属性の受信者は、メッセージに含まれる長さにICVを切り捨てなければなりません。 ROHC_ICV_LEN属性の値がゼロの場合は、ICVを送ってはいけません。何ROHC_ICV_LEN属性が全く場合、または送信されない場合ROHC_ICV_LENが選択されたアルゴリズムのICVの長さよりも大きい、ROHC_INTEGアルゴリズムによって指定されるように、次いで完全ICV長を送らなければなりません。"
    },
    {
      "indent": 6,
      "text": "Note that the ROHC_ICV_LEN attribute is a one-way notification; therefore, different values for ROHC_ICV_LEN may be announced in each direction.",
      "ja": "ROHC_ICV_LEN属性は一方向の通知であることに注意してください。従って、ROHC_ICV_LENに対する異なる値は、各方向に発表されてもよいです。"
    },
    {
      "indent": 3,
      "text": "MRRU (Maximum Reconstructed Reception Unit, AF = 1)",
      "ja": "MRRU（最大再構築受信部、AF = 1）"
    },
    {
      "indent": 6,
      "text": "The MRRU attribute is an optional attribute. There MAY be zero or one MRRU attribute contained within the ROHC_SUPPORTED Notify message. The attribute value is 2 octets in length. The attribute specifies the size of the largest reconstructed unit in octets that the ROHCoIPsec decompressor is expected to reassemble from ROHC segments (see Section 5.2.5 of [ROHCV1]). This size includes the Cyclic Redundancy Check (CRC) and the ROHC ICV. If",
      "ja": "MRRU属性はオプション属性です。メッセージを通知ROHC_SUPPORTED内に含まれ、ゼロまたは1 M​​RRU属性があるかもしれません。属性値の長さは2つのオクテットです。属性はROHCoIPsec伸張がROHCセグメント（[ROHCV1]のセクション5.2.5を参照）から再構築することが予想されるオクテットで最大の再構成されたユニットのサイズを指定します。このサイズは、巡回冗長検査（CRC）とROHC ICVが含まれています。もし"
    },
    {
      "indent": 6,
      "text": "MRRU is 0 or if no MRRU attribute is sent, segment headers MUST NOT be transmitted on the ROHCoIPsec channel.",
      "ja": "MRRUは0であるか、または全くMRRU属性が送信されない場合は、セグメントヘッダーはROHCoIPsecチャネル上で送信してはいけません。"
    },
    {
      "indent": 6,
      "text": "Note that the MRRU attribute is a one-way notification; therefore, different values for MRRU may be announced in each direction.",
      "ja": "MRRU属性は一方向の通知であることに注意してください。従って、MRRUのための異なる値は、各方向に発表されてもよいです。"
    },
    {
      "indent": 3,
      "text": "If an unknown ROHC Attribute Type Value is received, it MUST be silently ignored.",
      "ja": "未知のROHC属性タイプ値を受信した場合、それは静かに無視しなければなりません。"
    },
    {
      "indent": 0,
      "text": "3.2. ROHC Channel Parameters That Are Implicitly Set",
      "section_title": true,
      "ja": "3.2. 暗黙的に設定されているROHCチャネルパラメータ"
    },
    {
      "indent": 3,
      "text": "The following ROHC channel parameters MUST NOT be signaled:",
      "ja": "次ROHCチャンネルパラメータが通知されてはなりません。"
    },
    {
      "indent": 3,
      "text": "o LARGE_CIDS: This value is implicitly determined by the value of MAX_CID (i.e., if MAX_CID is <= 15, LARGE_CIDS is assumed to be 0).",
      "ja": "O LARGE_CIDS：この値は、暗黙的に（MAX_CIDが<= 15である場合、すなわち、LARGE_CIDSが0であると仮定される）MAX_CIDの値によって決定されます。"
    },
    {
      "indent": 3,
      "text": "o FEEDBACK_FOR: When a pair of SAs is created (one in each direction), the ROHC channel parameter FEEDBACK_FOR MUST be set implicitly to the other SA of the pair (i.e., the SA pointing in the reverse direction).",
      "ja": "O FEEDBACK_FOR：SAの一対（各方向に1つずつ）が作成されると、ROHCチャネルパラメータFEEDBACK_FORが対の他のSAに暗黙的に設定しなければならない（すなわち、逆方向のSA指します）。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "The ability to negotiate the length of the ROHC ICV may introduce vulnerabilities to the ROHCoIPsec protocol. Specifically, the capability to signal a short ICV length may result in scenarios where erroneous packets are forwarded into the protected domain. This security consideration is documented in further detail in Section 6.1.4 of [ROHCOIPSEC] and Section 5 of [IPSEC-ROHC].",
      "ja": "ROHC ICVの長さを交渉する能力はROHCoIPsecプロトコルに脆弱性を導入することができます。具体的には、短いICVの長さを通知する機能は、誤ったパケットが保護されたドメインに転送されたシナリオをもたらすことができます。このセキュリティの考慮事項は、[ROHCOIPSEC]のセクション6.1.4および[IPSEC-ROHC]のセクション5でさらに詳細に記載されています。"
    },
    {
      "indent": 3,
      "text": "This security consideration can be mitigated by using longer ICVs, but this comes at the cost of additional overhead, which reduces the overall benefits offered by ROHCoIPsec.",
      "ja": "このセキュリティの考慮事項は長いたICVを使用することによって緩和することができるが、これはROHCoIPsecによって提供される全体的な利益を減少させ、追加のオーバーヘッドのコスト、でてきます。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "ja": "5. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document defines a new Notify message (Status Type). Therefore, IANA has allocated one value from the \"IKEv2 Notify Message Types\" registry to indicate ROHC_SUPPORTED.",
      "ja": "この文書は、新しい通知メッセージ（ステータスタイプ）を定義します。したがって、IANAはROHC_SUPPORTEDを示すために「のIKEv2は、メッセージタイプを通知する」レジストリから一つの値を割り当てています。"
    },
    {
      "indent": 3,
      "text": "In addition, IANA has created a new \"ROHC Attribute Types\" registry in the \"Internet Key Exchange Version 2 (IKEv2) Parameters\" registry [IKEV2-PARA]. Within the \"ROHC Attribute Types\" registry, this document allocates the following values:",
      "ja": "また、IANAは、「インターネット鍵交換バージョン2（IKEv2の）パラメータ」レジストリ[IKEv2の-PARA]で新しい「ROHCの属性タイプ」レジストリを作成しました。 「ROHCの属性タイプ」レジストリ内では、この文書には、次の値を割り当てます。"
    },
    {
      "indent": 0,
      "text": "Registry:\nValue        ROHC Attribute Type                        Format Reference\n-----------  --------------------------------------     ------ ---------\n0            RESERVED                                          [RFC5857]\n1            Maximum Context Identifier (MAX_CID)        TV    [RFC5857]\n2            ROHC Profile (ROHC_PROFILE)                 TV    [RFC5857]\n3            ROHC Integrity Algorithm (ROHC_INTEG)       TV    [RFC5857]\n4            ROHC ICV Length in bytes (ROHC_ICV_LEN)     TV    [RFC5857]\n5            Maximum Reconstructed Reception Unit (MRRU) TV    [RFC5857]\n6-16383      Unassigned\n16384-32767  Private use                                       [RFC5857]",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Following the policies outlined in [IANA-CONSIDERATIONS], the IANA policy for assigning new values for the ROHC Attribute Types registry shall be Expert Review.",
      "ja": "[IANA-考察]に概説された方針に続き、ROHC属性タイプレジストリに新しい値を割り当てるためのIANAポリシーはエキスパートレビューしなければなりません。"
    },
    {
      "indent": 3,
      "text": "For registration requests, the responsible IESG Area Director will appoint the Designated Expert. The Designated Expert will post a request to both the ROHC and IPsec mailing lists (or a successor designated by the Area Director) for comment and review. The Designated Expert will either approve or deny the registration request and publish a notice of the decision to both mailing lists (or their successors), as well as informing IANA. A denial notice must be justified by an explanation.",
      "ja": "登録要求のために、責任がIESGエリアディレクターは、指定専門家を任命します。指定ExpertはコメントとレビューのためにROHCとIPsecメーリングリスト（または地域ディレクターが指定する後継者）の両方にリクエストを掲載します。指定ExpertはIANAに知らせるだけでなく、承認または登録要求を拒否し、両方のメーリングリスト（またはその後継）に決定の通知を発行しますか。拒否通知は説明によって正当化されなければなりません。"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgments",
      "section_title": true,
      "ja": "6.謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Sean O'Keeffe, James Kohler, and Linda Noone of the Department of Defense, as well as Rich Espy of OPnet for their contributions and support in the development of this document.",
      "ja": "作者はこのドキュメントの開発に貢献し、支援のためのショーン・オキーフ、ジェームズ・コーラー、および国防総省のリンダ・ヌーン、だけでなく、OPNETのリッチEspyのを感謝したいと思います。"
    },
    {
      "indent": 3,
      "text": "The authors would also like to thank Yoav Nir and Robert A Stangarone Jr.: both served as committed document reviewers for this specification.",
      "ja": "著者らはまたヨアフニール、ロバート・A Stangaroneジュニアに感謝したいと思います。：両方は、この仕様書のためのコミット文書の校閲を務めていました。"
    },
    {
      "indent": 3,
      "text": "In addition, the authors would like to thank the following for their numerous reviews and comments to this document:",
      "ja": "また、作者はこのドキュメントへの彼らの数々のレビューやコメントのために以下のことを感謝したいと思います："
    },
    {
      "indent": 3,
      "text": "o Magnus Westerlund",
      "ja": "マグヌスウェスターO"
    },
    {
      "indent": 3,
      "text": "o Stephen Kent",
      "ja": "Oスティーブン・ケント"
    },
    {
      "indent": 3,
      "text": "o Lars-Erik Jonsson",
      "ja": "Oラース - エリックジョンソン"
    },
    {
      "indent": 3,
      "text": "o Pasi Eronen",
      "ja": "いいえパシEronenありません"
    },
    {
      "indent": 3,
      "text": "o Jonah Pezeshki o Carl Knutsson",
      "ja": "ヨナPezeshkiカールKnutsson〇〇"
    },
    {
      "indent": 3,
      "text": "o Joseph Touch",
      "ja": "Oジョセフ・タッチ"
    },
    {
      "indent": 3,
      "text": "o David Black",
      "ja": "Oデビッド・ブラック"
    },
    {
      "indent": 3,
      "text": "o Glen Zorn",
      "ja": "グレンツォルンO"
    },
    {
      "indent": 3,
      "text": "Finally, the authors would also like to thank Tom Conkle, Michele Casey, and Etzel Brower.",
      "ja": "最後に、著者らはまた、トムConkle、ミシェルケーシー、とEtzelブラウワーに感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7.参考"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "ja": "7.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[IPSEC] Kent, S. and K. Seo, \"Security Architecture for the Internet Protocol\", RFC 4301, December 2005.",
      "ja": "[IPSEC]ケント、S.とK. Seo、 \"インターネットプロトコルのためのセキュリティアーキテクチャ\"、RFC 4301、2005年12月。"
    },
    {
      "indent": 3,
      "text": "[ROHC] Sandlund, K., Pelletier, G., and L-E. Jonsson, \"The RObust Header Compression (ROHC) Framework\", RFC 5795, March 2010.",
      "ja": "[ROHC] Sandlund、K.、ペルティエ、G.、およびL-E。ヨンソン、 \"ロバストヘッダ圧縮（ROHC）フレームワーク\"、RFC 5795、2010年3月。"
    },
    {
      "indent": 3,
      "text": "[IKEV2] Kaufman, C., \"Internet Key Exchange (IKEv2) Protocol\", RFC 4306, December 2005.",
      "ja": "[IKEv2の]カウフマン、C.、 \"インターネットキーエクスチェンジ（IKEv2の）プロトコル\"、RFC 4306、2005年12月。"
    },
    {
      "indent": 3,
      "text": "[BRA97] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[BRA97]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[ROHCV1] Bormann, C., Burmeister, C., Degermark, M., Fukushima, H., Hannu, H., Jonsson, L-E., Hakenberg, R., Koren, T., Le, K., Liu, Z., Martensson, A., Miyazaki, A., Svanbro, K., Wiebke, T., Yoshimura, T., and H. Zheng, \"RObust Header Compression (ROHC): Framework and four profiles: RTP, UDP, ESP, and uncompressed\", RFC 3095, July 2001.",
      "ja": "【ROHCV1]ボルマン、C.、Burmeister、C.、Degermark、M.、福島、H.、ハンヌ、H.、ジョンソン、LE。、Hakenberg、R.、コレン、T.、ル、K.、劉、 Z.、Martenssonから、A.、宮崎、A.、Svanbro、K.、Wiebke、T.、吉村、T.、およびH.鄭、「ロバストヘッダ圧縮（ROHC）：フレームワークおよび4つのプロファイル：RTP、UDP、 ESP、および非圧縮」、RFC 3095、2001年7月。"
    },
    {
      "indent": 3,
      "text": "[ROHCV2] Pelletier, G. and K. Sandlund, \"RObust Header Compression Version 2 (ROHCv2): Profiles for RTP, UDP, IP, ESP and UDP-Lite\", RFC 5225, April 2008.",
      "ja": "[ROHCV2]ペルティエ、G.およびK. Sandlund、 \"ロバストヘッダ圧縮バージョン2（ROHCv2）：RTP、UDP、IP、ESPとUDP-Liteのプロファイル\"、RFC 5225、2008年4月。"
    },
    {
      "indent": 3,
      "text": "[IPSEC-ROHC] Ertekin, E., Christou, C., and C. Bormann, \"IPsec Extensions to Support Robust Header Compression over IPsec\", RFC 5858, May 2010.",
      "ja": "[IPSEC-ROHC] Ertekin、E.、Christouの、C.、およびC.ボルマン、 \"IPsec拡張機能は、IPsec上でロバストヘッダ圧縮をサポートするために\"、RFC 5858、2010年5月。"
    },
    {
      "indent": 3,
      "text": "[IANA-CONSIDERATIONS] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 5226, May 2008.",
      "ja": "[IANA-考察] Narten氏、T.とH. Alvestrand、 \"RFCsにIANA問題部に書くためのガイドライン\"、BCP 26、RFC 5226、2008年5月。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "ja": "7.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[ROHCOIPSEC] Ertekin, E., Jasani, R., Christou, C., and C. Bormann, \"Integration of Header Compression over IPsec Security Associations\", RFC 5856, May 2010.",
      "ja": "[ROHCOIPSEC] Ertekin、E.、Jasani、R.、Christouの、C.、およびC.ボルマン、 \"IPsecセキュリティアソシエーションにおけるヘッダ圧縮の統合\"、RFC 5856、2010年5月。"
    },
    {
      "indent": 3,
      "text": "[ROHC-PPP] Bormann, C., \"Robust Header Compression (ROHC) over PPP\", RFC 3241, April 2002.",
      "ja": "[ROHC-PPP]ボルマン、C.、 \"PPPオーバーロバストヘッダ圧縮（ROHC）\"、RFC 3241、2002年4月。"
    },
    {
      "indent": 3,
      "text": "[ROHCPROF] IANA, \"RObust Header Compression (ROHC) Profile Identifiers\", <http://www.iana.org>.",
      "ja": "【ROHCPROF] IANA、 \"ロバストヘッダ圧縮（ROHC）プロファイル識別子\"、<http://www.iana.org>。"
    },
    {
      "indent": 3,
      "text": "[CRYPTO-ALG] Manral, V., \"Cryptographic Algorithm Implementation Requirements for Encapsulating Security Payload (ESP) and Authentication Header (AH)\", RFC 4835, April 2007.",
      "ja": "[CRYPTO-ALG] Manral、V.、RFC 4835、2007年4月 \"カプセル化セキュリティペイロード（ESP）と認証ヘッダー（AH）のための暗号アルゴリズム実装要件\"。"
    },
    {
      "indent": 3,
      "text": "[IKEV2-PARA] IANA, \"Internet Key Exchange Version 2 (KEv2) Parameters\", <http://www.iana.org>.",
      "ja": "[IKEv2の-PARA] IANA、 \"インターネット鍵交換バージョン2（KEv2）パラメータ\"、<http://www.iana.org>。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Emre Ertekin Booz Allen Hamilton 5220 Pacific Concourse Drive, Suite 200 Los Angeles, CA 90045 US",
      "ja": "エムレErtekinブーズ・アレン・ハミルトン5220太平洋コンコースドライブ、スイート200ロサンゼルス、CA 90045米国"
    },
    {
      "indent": 3,
      "text": "EMail: ertekin_emre@bah.com",
      "ja": "メールアドレス：ertekin_emre@bah.com"
    },
    {
      "indent": 3,
      "text": "Chris Christou Booz Allen Hamilton 13200 Woodland Park Dr. Herndon, VA 20171 US",
      "ja": "クリストスChristouのボアズ・アレン・ハミルトン13200ウッドランドパーク博士聞いた、NE 20171米国"
    },
    {
      "indent": 3,
      "text": "EMail: christou_chris@bah.com",
      "ja": "メールアドレス：christou_chris@bah.com"
    },
    {
      "indent": 3,
      "text": "Rohan Jasani Booz Allen Hamilton 13200 Woodland Park Dr. Herndon, VA 20171 US",
      "ja": "ロハンJasaniブーズ・アレン・ハミルトン13200ウッドランドパーク博士ハーンドン、VA 20171米国"
    },
    {
      "indent": 3,
      "text": "EMail: ro@breakcheck.com",
      "ja": "メールアドレス：ro@breakcheck.com"
    },
    {
      "indent": 3,
      "text": "Tero Kivinen AuthenTec, Inc. Fredrikinkatu 47 HELSINKI FI",
      "ja": "TERO Kivinenオーセンテック社HELSINKI Fredrikinkatu 47 EN"
    },
    {
      "indent": 3,
      "text": "EMail: kivinen@iki.fi",
      "ja": "メールアドレス：kivinen@iki.fi"
    },
    {
      "indent": 3,
      "text": "Carsten Bormann Universitaet Bremen TZI Postfach 330440 Bremen D-28334 Germany",
      "ja": "カルステンボルマンUniversitaetブレーメンTZI POSTFACH 330440 D-28334ブレーメンドイツ"
    },
    {
      "indent": 3,
      "text": "EMail: cabo@tzi.org",
      "ja": "メールアドレス：cabo@tzi.org"
    }
  ]
}