{
  "title": {
    "text": "RFC 5735 - Special Use IPv4 Addresses",
    "ja": "RFC 5735 - 特別な使用IPv4アドレス"
  },
  "number": 5735,
  "created_at": "2023-02-14 15:17:45.893157+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         M. Cotton\nRequest for Comments: 5735                                     L. Vegoda\nBCP: 153                                                           ICANN\nObsoletes: 3330                                             January 2010\nCategory: Best Current Practice\nISSN: 2070-1721",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 23,
      "text": "Special Use IPv4 Addresses",
      "ja": "特別な使用IPv4アドレス"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document obsoletes RFC 3330. It describes the global and other specialized IPv4 address blocks that have been assigned by the Internet Assigned Numbers Authority (IANA). It does not address IPv4 address space assigned to operators and users through the Regional Internet Registries, nor does it address IPv4 address space assigned directly by IANA prior to the creation of the Regional Internet Registries. It also does not address allocations or assignments of IPv6 addresses or autonomous system numbers.",
      "ja": "このドキュメントはRFC 3330を廃止します。インターネットが割り当てられた番号局（IANA）によって割り当てられたグローバルおよびその他の専門的なIPv4アドレスブロックについて説明しています。地域のインターネットレジストリを介してオペレーターとユーザーに割り当てられたIPv4アドレススペースには対応しておらず、地域のインターネットレジストリの作成前にIANAによって直接割り当てられたIPv4アドレススペースに対処しません。また、IPv6アドレスまたは自律システム番号の割り当てまたは割り当てにも対処しません。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This memo documents an Internet Best Current Practice.",
      "ja": "このメモは、インターネットの最高の現在の練習を文書化しています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on BCPs is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントは、インターネットエンジニアリングタスクフォース（IETF）の製品です。IETFコミュニティのコンセンサスを表しています。公開レビューを受けており、インターネットエンジニアリングステアリンググループ（IESG）からの出版が承認されています。BCPの詳細については、RFC 5741のセクション2で入手できます。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc5735.",
      "ja": "このドキュメントの現在のステータス、任意のERRATA、およびそのフィードバックを提供する方法に関する情報は、http：//www.rfc-editor.org/info/rfc5735で取得できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2010 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2010 IETF Trustおよび文書著者として特定された人。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "このドキュメントは、BCP 78およびIETFドキュメント（http://trustee.ietf.org/license-info）に関連するIETF Trustの法的規定の対象となります。この文書に関するあなたの権利と制限を説明するので、これらの文書を注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、セクション4.Eで説明されている法的規定のセクション4.Eで説明されており、単純化されたBSDライセンスで説明されているように保証なしで提供される簡略化されたBSDライセンステキストを含める必要があります。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 0,
      "text": "1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  3\n2.  Terminology  . . . . . . . . . . . . . . . . . . . . . . . . .  3\n3.  Global and Other Specialized Address Blocks  . . . . . . . . .  3\n4.  Summary Table  . . . . . . . . . . . . . . . . . . . . . . . .  6\n5.  Assignments of IPv4 Blocks for New Specialized Uses  . . . . .  6\n6.  IANA Considerations  . . . . . . . . . . . . . . . . . . . . .  6\n7.  Security Considerations  . . . . . . . . . . . . . . . . . . .  7\n8.  Acknowledgments  . . . . . . . . . . . . . . . . . . . . . . .  7\n9.  References . . . . . . . . . . . . . . . . . . . . . . . . . .  7\n  9.1.  Normative References . . . . . . . . . . . . . . . . . . .  7\n  9.2.  Informative References . . . . . . . . . . . . . . . . . .  7\nAppendix A.  Differences between This Document and RFC 3330  . . . 10\n1.  Introduction",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Throughout its history, the Internet has employed a central Internet Assigned Numbers Authority (IANA) responsible for the allocation and assignment of various identifiers needed for the operation of the Internet [RFC1174]. In the case of the IPv4 address space, the IANA allocates parts of the address space to Regional Internet Registries (RIRs) according to their established needs. These RIRs are responsible for the registration of IPv4 addresses to operators and users of the Internet within their regions.",
      "ja": "その歴史を通じて、インターネットは、インターネットの運用に必要なさまざまな識別子の割り当てと割り当てを担当する中央インターネット割り当てされた数字当局（IANA）を採用してきました[RFC1174]。IPv4アドレス空間の場合、IANAはアドレス空間の一部を、確立されたニーズに応じて地域のインターネットレジストリ（RIRS）に割り当てます。これらのRIRは、地域内のインターネットのオペレーターとユーザーへのIPv4アドレスの登録を担当しています。"
    },
    {
      "indent": 3,
      "text": "On an ongoing basis, the IANA has been designated by the IETF to make assignments in support of the Internet Standards Process [RFC2860]. Section 4 of that document describes that assignment process.",
      "ja": "継続的に、IANAはIETFによって指定され、インターネット標準プロセス[RFC2860]をサポートするために割り当てを行いました。そのドキュメントのセクション4では、その割り当てプロセスについて説明します。"
    },
    {
      "indent": 3,
      "text": "Small portions of the IPv4 address space have been allocated or assigned directly by the IANA for global or other specialized purposes. These allocations and assignments have been documented in a variety of RFCs and other documents. This document is intended to collect these scattered references and provide a current list of special use IPv4 addresses.",
      "ja": "IPv4アドレス空間のごく一部は、グローバルまたはその他の専門的な目的でIANAによって直接割り当てまたは割り当てられています。これらの割り当てと割り当ては、さまざまなRFCやその他の文書で文書化されています。このドキュメントは、これらの散在する参照を収集し、特別な使用IPv4アドレスの現在のリストを提供することを目的としています。"
    },
    {
      "indent": 3,
      "text": "This document is a revision of RFC 3330 [RFC3330], which it obsoletes; its primary purpose is to reflect the changes to the list of special IPv4 assignments since the publication of RFC 3330. It is a companion to [RFC5156], which describes special IPv6 addresses.",
      "ja": "このドキュメントは、RFC 3330 [RFC3330]の改訂版で、これは廃止されています。その主な目的は、RFC 3330の公開以来、特別なIPv4割り当てのリストの変更を反映することです。これは、特別なIPv6アドレスを説明する[RFC5156]の仲間です。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "ja": "2. 用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14, [RFC2119].",
      "ja": "「必須」、「そうしない」、「必須」、「必要」、「しない」、「そうしない」、「そうではない」、「そうでない」、「推奨」、「5月」、および「オプション」は、BCP 14、[RFC2119]に記載されているように解釈される。"
    },
    {
      "indent": 0,
      "text": "3. Global and Other Specialized Address Blocks",
      "section_title": true,
      "ja": "3. グローバルおよびその他の専門的なアドレスブロック"
    },
    {
      "indent": 3,
      "text": "0.0.0.0/8 - Addresses in this block refer to source hosts on \"this\" network. Address 0.0.0.0/32 may be used as a source address for this host on this network; other addresses within 0.0.0.0/8 may be used to refer to specified hosts on this network ([RFC1122], Section 3.2.1.3).",
      "ja": "0.0.0.0/8-このブロックのアドレスは、「この」ネットワーク上のソースホストを参照しています。アドレス0.0.0.0/32は、このネットワーク上のこのホストのソースアドレスとして使用できます。0.0.0.0/8以内の他のアドレスを使用して、このネットワーク上の指定されたホストを参照することができます（[RFC1122]、セクション3.2.1.3）。"
    },
    {
      "indent": 3,
      "text": "10.0.0.0/8 - This block is set aside for use in private networks. Its intended use is documented in [RFC1918]. As described in that RFC, addresses within this block do not legitimately appear on the public Internet. These addresses can be used without any coordination with IANA or an Internet registry.",
      "ja": "10.0.0.0/8-このブロックは、プライベートネットワークで使用するために確保されています。その目的の使用は[RFC1918]に記録されています。そのRFCで説明されているように、このブロック内のアドレスは、パブリックインターネットに正当に表示されません。これらのアドレスは、IANAまたはインターネットレジストリとの調整なしに使用できます。"
    },
    {
      "indent": 3,
      "text": "127.0.0.0/8 - This block is assigned for use as the Internet host loopback address. A datagram sent by a higher-level protocol to an address anywhere within this block loops back inside the host. This is ordinarily implemented using only 127.0.0.1/32 for loopback. As described in [RFC1122], Section 3.2.1.3, addresses within the entire 127.0.0.0/8 block do not legitimately appear on any network anywhere.",
      "ja": "127.0.0.0/8-このブロックは、インターネットホストループバックアドレスとして使用するために割り当てられています。高レベルのプロトコルによって送信されたデータグラムは、このブロック内の任意のアドレスにホスト内に戻るアドレスに送信されます。これは通常、ループバック用の127.0.0.1/32のみを使用して実装されます。[RFC1122]、セクション3.2.1.3で説明されているように、127.0.0.0/8ブロック全体のアドレスは、どこにでもネットワークに正当に表示されません。"
    },
    {
      "indent": 3,
      "text": "169.254.0.0/16 - This is the \"link local\" block. As described in [RFC3927], it is allocated for communication between hosts on a single link. Hosts obtain these addresses by auto-configuration, such as when a DHCP server cannot be found.",
      "ja": "169.254.0.0/16-これは「Link Local」ブロックです。[RFC3927]で説明されているように、単一のリンク上のホスト間の通信に割り当てられます。ホストは、DHCPサーバーが見つからない場合など、自動構成によってこれらのアドレスを取得します。"
    },
    {
      "indent": 3,
      "text": "172.16.0.0/12 - This block is set aside for use in private networks. Its intended use is documented in [RFC1918]. As described in that RFC, addresses within this block do not legitimately appear on the public Internet. These addresses can be used without any coordination with IANA or an Internet registry.",
      "ja": "172.16.0.0/12-このブロックは、プライベートネットワークで使用するために確保されています。その目的の使用は[RFC1918]に記録されています。そのRFCで説明されているように、このブロック内のアドレスは、パブリックインターネットに正当に表示されません。これらのアドレスは、IANAまたはインターネットレジストリとの調整なしに使用できます。"
    },
    {
      "indent": 3,
      "text": "192.0.0.0/24 - This block is reserved for IETF protocol assignments. At the time of writing this document, there are no current assignments. Allocation policy for future assignments is given in [RFC5736].",
      "ja": "192.0.0.0/24-このブロックは、IETFプロトコルの割り当て用に予約されています。このドキュメントを書いている時点では、現在の割り当てはありません。将来の割り当ての配分ポリシーは[RFC5736]に記載されています。"
    },
    {
      "indent": 3,
      "text": "192.0.2.0/24 - This block is assigned as \"TEST-NET-1\" for use in documentation and example code. It is often used in conjunction with domain names example.com or example.net in vendor and protocol documentation. As described in [RFC5737], addresses within this block do not legitimately appear on the public Internet and can be used without any coordination with IANA or an Internet registry. See [RFC1166].",
      "ja": "192.0.2.0/24-このブロックは、ドキュメントとサンプルコードで使用するために「Test-Net-1」として割り当てられています。多くの場合、ドメイン名のembler.comまたはベンダーおよびプロトコルのドキュメントでexample.netと組み合わせて使用されます。[RFC5737]で説明されているように、このブロック内のアドレスは、パブリックインターネットに合法的に表示されず、IANAまたはインターネットレジストリとの調整なしに使用できます。[RFC1166]を参照してください。"
    },
    {
      "indent": 3,
      "text": "192.88.99.0/24 - This block is allocated for use as 6to4 relay anycast addresses, in [RFC3068]. In contrast with previously described blocks, packets destined to addresses from this block do appear in the public Internet. [RFC3068], Section 7, describes operational practices to prevent the malicious use of this block in routing protocols.",
      "ja": "192.88.99.0/24-このブロックは、[RFC3068]で6to4リレーAnycastアドレスとして使用するために割り当てられています。前述のブロックとは対照的に、このブロックからのアドレスが運命づけられているパケットは、パブリックインターネットに表示されます。[RFC3068]、セクション7は、ルーティングプロトコルでのこのブロックの悪意のある使用を防ぐための運用慣行について説明します。"
    },
    {
      "indent": 3,
      "text": "192.168.0.0/16 - This block is set aside for use in private networks. Its intended use is documented in [RFC1918]. As described in that RFC, addresses within this block do not legitimately appear on the public Internet. These addresses can be used without any coordination with IANA or an Internet registry.",
      "ja": "192.168.0.0/16-このブロックは、プライベートネットワークで使用するために確保されています。その目的の使用は[RFC1918]に記録されています。そのRFCで説明されているように、このブロック内のアドレスは、パブリックインターネットに正当に表示されません。これらのアドレスは、IANAまたはインターネットレジストリとの調整なしに使用できます。"
    },
    {
      "indent": 3,
      "text": "198.18.0.0/15 - This block has been allocated for use in benchmark tests of network interconnect devices. [RFC2544] explains that this range was assigned to minimize the chance of conflict in case a testing device were to be accidentally connected to part of the Internet. Packets with source addresses from this range are not meant to be forwarded across the Internet.",
      "ja": "198.18.0.0/15-このブロックは、ネットワーク相互接続デバイスのベンチマークテストで使用するために割り当てられています。[RFC2544]は、テストデバイスが誤ってインターネットの一部に接続される場合に備えて、この範囲が競合の可能性を最小限に抑えるために割り当てられたと説明しています。この範囲のソースアドレスを備えたパケットは、インターネット上に転送されることを意図していません。"
    },
    {
      "indent": 3,
      "text": "198.51.100.0/24 - This block is assigned as \"TEST-NET-2\" for use in documentation and example code. It is often used in conjunction with domain names example.com or example.net in vendor and protocol documentation. As described in [RFC5737], addresses within this block do not legitimately appear on the public Internet and can be used without any coordination with IANA or an Internet registry.",
      "ja": "198.51.100.0/24-このブロックは、ドキュメントとサンプルコードで使用するための「Test-Net-2」として割り当てられています。多くの場合、ドメイン名のembler.comまたはベンダーおよびプロトコルのドキュメントでexample.netと組み合わせて使用されます。[RFC5737]で説明されているように、このブロック内のアドレスは、パブリックインターネットに合法的に表示されず、IANAまたはインターネットレジストリとの調整なしに使用できます。"
    },
    {
      "indent": 3,
      "text": "203.0.113.0/24 - This block is assigned as \"TEST-NET-3\" for use in documentation and example code. It is often used in conjunction with domain names example.com or example.net in vendor and protocol documentation. As described in [RFC5737], addresses within this block do not legitimately appear on the public Internet and can be used without any coordination with IANA or an Internet registry.",
      "ja": "203.0.113.0/24-このブロックは、ドキュメントとサンプルコードで使用するための「Test-Net-3」として割り当てられています。多くの場合、ドメイン名のembler.comまたはベンダーおよびプロトコルのドキュメントでexample.netと組み合わせて使用されます。[RFC5737]で説明されているように、このブロック内のアドレスは、パブリックインターネットに合法的に表示されず、IANAまたはインターネットレジストリとの調整なしに使用できます。"
    },
    {
      "indent": 3,
      "text": "224.0.0.0/4 - This block, formerly known as the Class D address space, is allocated for use in IPv4 multicast address assignments. The IANA guidelines for assignments from this space are described in [RFC3171].",
      "ja": "224.0.0.0/4-以前はクラスDアドレススペースとして知られていたこのブロックは、IPv4マルチキャストアドレスの割り当てで使用するために割り当てられています。このスペースからの割り当てのIANAガイドラインは、[RFC3171]で説明されています。"
    },
    {
      "indent": 3,
      "text": "240.0.0.0/4 - This block, formerly known as the Class E address space, is reserved for future use; see [RFC1112], Section 4.",
      "ja": "240.0.0.0/4-以前はクラスEアドレススペースとして知られていたこのブロックは、将来の使用のために予約されています。[RFC1112]、セクション4を参照してください。"
    },
    {
      "indent": 3,
      "text": "The one exception to this is the \"limited broadcast\" destination address 255.255.255.255. As described in [RFC0919] and [RFC0922], packets with this destination address are not forwarded at the IP layer.",
      "ja": "これの1つの例外は、「限られた放送」宛先アドレス255.255.255.255です。[RFC0919]および[RFC0922]で説明されているように、この宛先アドレスを持つパケットはIPレイヤーに転送されません。"
    },
    {
      "indent": 0,
      "text": "4. Summary Table",
      "section_title": true,
      "ja": "4. 概要表"
    },
    {
      "indent": 0,
      "text": "Address Block       Present Use                Reference\n------------------------------------------------------------------\n0.0.0.0/8           \"This\" Network             RFC 1122, Section 3.2.1.3\n10.0.0.0/8          Private-Use Networks       RFC 1918\n127.0.0.0/8         Loopback                   RFC 1122, Section 3.2.1.3\n169.254.0.0/16      Link Local                 RFC 3927\n172.16.0.0/12       Private-Use Networks       RFC 1918\n192.0.0.0/24        IETF Protocol Assignments  RFC 5736\n192.0.2.0/24        TEST-NET-1                 RFC 5737\n192.88.99.0/24      6to4 Relay Anycast         RFC 3068\n192.168.0.0/16      Private-Use Networks       RFC 1918\n198.18.0.0/15       Network Interconnect\n                    Device Benchmark Testing   RFC 2544\n198.51.100.0/24     TEST-NET-2                 RFC 5737\n203.0.113.0/24      TEST-NET-3                 RFC 5737\n224.0.0.0/4         Multicast                  RFC 3171\n240.0.0.0/4         Reserved for Future Use    RFC 1112, Section 4\n255.255.255.255/32  Limited Broadcast          RFC 919, Section 7\n                                               RFC 922, Section 7",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "5. Assignments of IPv4 Blocks for New Specialized Uses",
      "section_title": true,
      "ja": "5. 新しい専門用途向けのIPv4ブロックの割り当て"
    },
    {
      "indent": 3,
      "text": "The IANA has responsibility for making assignments of protocol parameters used in the Internet according to the requirements of the \"Memorandum of Understanding Concerning the Technical Work of the Internet Assigned Numbers Authority\" [RFC2860]. Among other things, [RFC2860] requires that protocol parameters be assigned according to the criteria and procedures specified in RFCs, including Proposed, Draft, and full Internet Standards and Best Current Practice documents, and any other RFC that calls for IANA assignment.",
      "ja": "IANAは、「インターネットに割り当てられた数字当局の技術的な仕事に関する覚書」[RFC2860]の要件に従って、インターネットで使用されるプロトコルパラメーターの割り当てを行う責任を負っています。とりわけ、[RFC2860]は、提案、ドラフト、および完全な現在の実践文書、およびIANAの割り当てを必要とするその他のRFCを含むRFCSで指定された基準と手順に従ってプロトコルパラメーターを割り当てる必要があります。"
    },
    {
      "indent": 3,
      "text": "The domain name and IP address spaces involve policy issues (in addition to technical issues) so that the requirements of [RFC2860] do not apply generally to those spaces. Nonetheless, the IANA is responsible for ensuring assignments of IPv4 addresses as needed in support of the Internet Standards Process. When a portion of the IPv4 address space is specifically required by an RFC, the technical requirements (e.g., size, prefix length) for the portion should be described [RFC5226]. Immediately before the RFC is published, the IANA will, in consultation with the Regional Internet Registries, make the necessary assignment and notify the RFC Editor of the particulars for inclusion in the RFC as published.",
      "ja": "ドメイン名とIPアドレススペースには、[RFC2860]の要件が一般的にそれらのスペースに適用されないように、ポリシーの問題（技術的な問題に加えて）が含まれます。それにもかかわらず、IANAは、インターネット標準プロセスをサポートするために必要に応じてIPv4アドレスの割り当てを確保する責任があります。IPv4アドレス空間の一部がRFCで特別に必要な場合、部分の技術要件（サイズ、プレフィックスの長さなど）を説明する必要があります[RFC5226]。RFCが公開される直前に、IANAは、地域のインターネットレジストリと協議して、必要な割り当てを行い、公開されているRFCに含めるためにRFCエディターに通知します。"
    },
    {
      "indent": 3,
      "text": "As required by [RFC2860], the IANA will also make necessary experimental assignments of IPv4 addresses, also in consultation with the Regional Internet Registries.",
      "ja": "[RFC2860]で要求されているように、IANAはまた、地域のインターネットレジストリと相談して、IPv4アドレスの必要な実験的割り当ても行います。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document describes the IANA's past and current practices and does not create any new requirements for assignments or allocations by the IANA.",
      "ja": "このドキュメントは、IANAの過去および現在の慣行について説明しており、IANAによる割り当てまたは割り当ての新しい要件を作成しません。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "ja": "7. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "The particular assigned values of special use IPv4 addresses cataloged in this document do not directly raise security issues. However, the Internet does not inherently protect against abuse of these addresses. If you expect (for instance) that all packets from a private address space such as the 10.0.0.0/8 block or the link local block 169.254.0.0/16 originate within your subnet, all routers at the border of your network should filter such packets that originate from outside your network. Attacks have been mounted that depend on the unexpected use of some of these addresses.",
      "ja": "このドキュメントでカタログされている特別な使用IPv4アドレスの特定の割り当てられた値は、セキュリティの問題を直接提起しません。ただし、インターネットは本質的にこれらの住所の乱用から保護していません。10.0.0.0/8ブロックやリンクローカルブロック169.254.0.0/16などのプライベートアドレススペースからのすべてのパケットがサブネット内で発生すると予想される場合、ネットワークの境界のすべてのルーターはそのようなフィルタリングを行うはずですネットワークの外部から発生するパケット。これらのアドレスの一部の予期しない使用に依存する攻撃が取り付けられています。"
    },
    {
      "indent": 3,
      "text": "It should also be noted that some of these address spaces may be used legitimately outside a single administrative domain, and may appear on the global Internet. Security policy SHOULD NOT blindly filter all of these address spaces without due consideration, and network operators are encouraged to review this document, and references contained therein, and determine what security policies should be associated with each of these address blocks within their specific operating environments.",
      "ja": "また、これらのアドレススペースの一部は、単一の管理ドメインの外で合法的に使用され、グローバルインターネットに表示される可能性があることに注意する必要があります。セキュリティポリシーは、これらのアドレススペースを十分に考慮せずに盲目的にフィルタリングするべきではありません。ネットワークオペレーターは、このドキュメントとその中に含まれる参照を確認し、特定の動作環境内のこれらの各アドレスブロックに関連付けられるセキュリティポリシーを決定することをお勧めします。"
    },
    {
      "indent": 0,
      "text": "8. Acknowledgments",
      "section_title": true,
      "ja": "8. 謝辞"
    },
    {
      "indent": 3,
      "text": "Many people have made comments on draft versions of this document. The authors would especially like to thank Scott Bradner, Randy Bush, Harald Alvestrand, Peter Koch, Alfred Hoenes, and Jari Arkko for their constructive feedback and comments. They would also like to offer a special note of thanks to APNIC, which nominated 198.51.100.0/24 and 203.0.113.0/24.",
      "ja": "多くの人々がこのドキュメントのドラフトバージョンについてコメントしています。著者は、特に、Scott Bradner、Randy Bush、Harald Alvestrand、Peter Koch、Alfred Hoenes、Jari Arkkoの建設的なフィードバックとコメントに感謝したいと思います。また、198.51.100.0/24および203.0.113.0/24をノミネートしたApnicに感謝の特別なメモを提供したいと思います。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "ja": "9. 参考文献"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "ja": "9.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119] Bradner、S。、「要件レベルを示すためにRFCで使用するためのキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "ja": "9.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[RFC0919] Mogul, J., \"Broadcasting Internet Datagrams\", STD 5, RFC 919, October 1984.",
      "ja": "[RFC0919] Mogul、J。、「ブロードキャストインターネットデータグラム」、STD 5、RFC 919、1984年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC0922] Mogul, J., \"Broadcasting Internet datagrams in the presence of subnets\", STD 5, RFC 922, October 1984.",
      "ja": "[RFC0922] Mogul、J。、「サブネットの存在下でのインターネットデータグラムを放送」、STD 5、RFC 922、1984年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC1112] Deering, S., \"Host extensions for IP multicasting\", STD 5, RFC 1112, August 1989.",
      "ja": "[RFC1112] Deering、S。、「IPマルチキャストのホスト拡張」、STD 5、RFC 1112、1989年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC1122] Braden, R., \"Requirements for Internet Hosts - Communication Layers\", STD 3, RFC 1122, October 1989.",
      "ja": "[RFC1122] Braden、R。、「インターネットホストの要件 - 通信レイヤー」、STD 3、RFC 1122、1989年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC1166] Kirkpatrick, S., Stahl, M., and M. Recker, \"Internet numbers\", RFC 1166, July 1990.",
      "ja": "[RFC1166] Kirkpatrick、S.、Stahl、M。、およびM. Recker、「インターネット番号」、RFC 1166、1990年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC1174] Cerf, V., \"IAB recommended policy on distributing internet identifier assignment and IAB recommended policy change to internet \"connected\" status\", RFC 1174, August 1990.",
      "ja": "[RFC1174] Cerf、V。、「IABは、インターネット識別子の割り当ての配布とIABの推奨ポリシーとIABがインターネットの「接続された」ステータス、RFC 1174、1990年8月へのポリシー変更を推奨しました。"
    },
    {
      "indent": 3,
      "text": "[RFC1700] Reynolds, J. and J. Postel, \"Assigned Numbers\", RFC 1700, October 1994.",
      "ja": "[RFC1700] Reynolds、J。およびJ. Postel、「割り当てられた番号」、RFC 1700、1994年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC1918] Rekhter, Y., Moskowitz, R., Karrenberg, D., Groot, G., and E. Lear, \"Address Allocation for Private Internets\", BCP 5, RFC 1918, February 1996.",
      "ja": "[RFC1918] Rekhter、Y.、Moskowitz、R.、Karrenberg、D.、Groot、G。、およびE. Lear、「Private Internetsのアドレス割り当て」、BCP 5、RFC 1918、1996年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC2544] Bradner, S. and J. McQuaid, \"Benchmarking Methodology for Network Interconnect Devices\", RFC 2544, March 1999.",
      "ja": "[RFC2544] Bradner、S。およびJ. McQuaid、「ネットワーク相互接続デバイスのベンチマーク方法論」、RFC 2544、1999年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2860] Carpenter, B., Baker, F., and M. Roberts, \"Memorandum of Understanding Concerning the Technical Work of the Internet Assigned Numbers Authority\", RFC 2860, June 2000.",
      "ja": "[RFC2860] Carpenter、B.、Baker、F。、およびM. Roberts、「インターネットが割り当てられた番号当局の技術作業に関する覚書」、RFC 2860、2000年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC3068] Huitema, C., \"An Anycast Prefix for 6to4 Relay Routers\", RFC 3068, June 2001.",
      "ja": "[RFC3068] Huitema、C。、「6to4リレールーターのAnycast Prefix」、RFC 3068、2001年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC3171] Albanna, Z., Almeroth, K., Meyer, D., and M. Schipper, \"IANA Guidelines for IPv4 Multicast Address Assignments\", BCP 51, RFC 3171, August 2001.",
      "ja": "[RFC3171] Albanna、Z.、Almeroth、K.、Meyer、D。、およびM. Schipper、「IPv4マルチキャストアドレス割り当てのIANAガイドライン」、BCP 51、RFC 3171、2001年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC3330] IANA, \"Special-Use IPv4 Addresses\", RFC 3330, September 2002.",
      "ja": "[RFC3330] IANA、「特別使用IPv4アドレス」、RFC 3330、2002年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC3927] Cheshire, S., Aboba, B., and E. Guttman, \"Dynamic Configuration of IPv4 Link-Local Addresses\", RFC 3927, May 2005.",
      "ja": "[RFC3927] Cheshire、S.、Aboba、B。、およびE. Guttman、「IPv4 Link-Localアドレスの動的構成」、RFC 3927、2005年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC5156] Blanchet, M., \"Special-Use IPv6 Addresses\", RFC 5156, April 2008.",
      "ja": "[RFC5156] Blanchet、M。、「Special-Use IPv6アドレス」、RFC 5156、2008年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC5226] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 5226, May 2008.",
      "ja": "[RFC5226] Narten、T。およびH. Alvestrand、「RFCSでIANA考慮事項セクションを書くためのガイドライン」、BCP 26、RFC 5226、2008年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC5736] Huston, G., Cotton, M., and L. Vegoda, \"IANA IPv4 Special Purpose Address Registry\", RFC 5736, January 2010.",
      "ja": "[RFC5736] Huston、G.、Cotton、M。、およびL. Vegoda、「Iana IPv4 Special目的アドレスレジストリ」、RFC 5736、2010年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC5737] Arkko, J., Cotton, M., and L. Vegoda, \"IPv4 Address Blocks Reserved for Documentation\", RFC 5737, January 2010.",
      "ja": "[RFC5737] Arkko、J.、Cotton、M。、およびL. Vegoda、「IPv4アドレスブロックはドキュメント用に予約されています」、RFC 5737、2010年1月。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Differences between This Document and RFC 3330",
      "section_title": true,
      "ja": "付録A. このドキュメントとRFC 3330の違い"
    },
    {
      "indent": 3,
      "text": "Address blocks that were reserved for a special purpose in RFC 3330 but are no longer reserved for any special purpose and are available for allocation are no longer listed in Sections 4 or 5. The following blocks have become available:",
      "ja": "RFC 3330の特別な目的のために予約されていたが、特別な目的のために予約されなくなり、割り当てに利用できるアドレスブロックは、セクション4または5にリストされなくなりました。次のブロックが利用可能になりました。"
    },
    {
      "indent": 3,
      "text": "- 14.0.0.0/8 is no longer set aside for assignments to the international system of Public Data Networks [RFC1700], page 181. It is now available for allocation to RIRs in the normal way.",
      "ja": "- 14.0.0.0/8は、181ページのパブリックデータネットワークの国際システム[RFC1700]への割り当てのために確保されなくなりました。これは、通常の方法でRIRSへの割り当てに利用できるようになりました。"
    },
    {
      "indent": 3,
      "text": "- 24.0.0.0/8 is no longer listed as the addresses in that block have been managed by the American Registry for Internet Numbers (ARIN) in the normal way since 2001.",
      "ja": "- 24.0.0.0/8は、そのブロックのアドレスが2001年以来通常の方法でアメリカのインターネット番号登録簿（ARIN）によって管理されているため、もはやリストされていません。"
    },
    {
      "indent": 3,
      "text": "- 39.0.0.0/8 is no longer listed as it has been subject to allocation to an RIR for assignment in the normal manner since 2001.",
      "ja": "- 39.0.0.0/8は、2001年以降、通常の方法で割り当てのためにRIRへの割り当ての対象となっているため、リストされなくなりました。"
    },
    {
      "indent": 3,
      "text": "- 128.0.0.0/16 is not reserved and is subject to future allocation by a Regional Internet Registry for assignment in the normal manner.",
      "ja": "- 128.0.0.0/16は予約されておらず、通常の方法で割り当てのために地域のインターネットレジストリによる将来の割り当ての対象となります。"
    },
    {
      "indent": 3,
      "text": "- 191.255.0.0/16 is not reserved and is subject to future allocation by a RIR for assignment in the normal manner.",
      "ja": "- 191.255.0.0/16は予約されておらず、通常の方法での割り当てのためにRIRによる将来の割り当ての対象となります。"
    },
    {
      "indent": 3,
      "text": "- 198.51.100.0/24 is assigned as \"TEST-NET-2\" for use in documentation and example code.",
      "ja": "- 198.51.100.0/24は、ドキュメントおよびサンプルコードで使用するための「Test-Net-2」として割り当てられています。"
    },
    {
      "indent": 3,
      "text": "- 203.0.113.0/24 is assigned as \"TEST-NET-3\" for use in documentation and example code.",
      "ja": "- 203.0.113.0/24は、ドキュメントおよびサンプルコードで使用するための「Test-Net-3」として割り当てられています。"
    },
    {
      "indent": 3,
      "text": "- 223.255.255.0/24 is not reserved and is subject to future allocation by an RIR for assignment in the normal manner.",
      "ja": "- 223.255.255.0/24は予約されておらず、通常の方法での割り当てのためにRIRによる将来の割り当ての対象となります。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Michelle Cotton Internet Corporation for Assigned Names and Numbers 4676 Admiralty Way, Suite 330 Marina del Rey, CA 90292 USA",
      "ja": "割り当てられた名前と数字のためのミシェルコットンインターネットコーポレーション4676 ADMIRALTY WAY、SUITE 330 MARINA DEL REY、CA 90292 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1-310-823-9358\nEMail: michelle.cotton@icann.org\nURI:   http://www.iana.org/",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Leo Vegoda Internet Corporation for Assigned Names and Numbers 4676 Admiralty Way, Suite 330 Marina del Rey, CA 90292 USA",
      "ja": "割り当てられた名前と番号4676 Admiralty Way、Suite 330 Marina Del Rey、CA 90292 USAのレオベゴダインターネットコーポレーション"
    },
    {
      "indent": 3,
      "text": "Phone: +1-310-823-9358\nEMail: leo.vegoda@icann.org\nURI:   http://www.iana.org/",
      "raw": true,
      "ja": ""
    }
  ]
}