{
  "title": {
    "text": "RFC 5691 - RTP Payload Format for Elementary Streams with MPEG Surround Multi-Channel Audio",
    "ja": "RFC 5691 - MPEGサラウンドマルチチャンネルオーディオと基本ストリームのためのRTPペイロードフォーマット"
  },
  "number": 5691,
  "created_at": "2019-10-27 14:07:02.604863+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                         F. de Bont\nRequest for Comments: 5691                           Philips Electronics\nUpdates: 3640                                                  S. Doehla\nCategory: Standards Track                                 Fraunhofer IIS\n                                                              M. Schmidt\n                                                      Dolby Laboratories\n                                                        R. Sperschneider\n                                                          Fraunhofer IIS\n                                                            October 2009",
      "raw": true
    },
    {
      "indent": 15,
      "text": "RTP Payload Format for Elementary Streams\n  with MPEG Surround Multi-Channel Audio",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This memo describes extensions for the RTP payload format defined in RFC 3640 for the transport of MPEG Surround multi-channel audio. Additional Media Type parameters are defined to signal backwards-compatible transmission inside an MPEG-4 Audio elementary stream. In addition, a layered transmission scheme that doesn't use the MPEG-4 systems framework is presented to transport an MPEG Surround elementary stream via RTP in parallel with an RTP stream containing the downmixed audio data.",
      "ja": "このメモは、MPEGサラウンドマルチチャンネルオーディオの輸送のためにRFC 3640で定義されたRTPペイロード形式の拡張を記述しています。追加のメディアタイプパラメータは、MPEG-4オーディオエレメンタリストリーム内の下位互換送信を通知するために定義されています。また、MPEG-4システムのフレームワークを使用していない層状伝送方式は、ダウンミックスオーディオデータを含むRTPストリームと並行してRTPを介しMPEGサラウンドエレメンタリストリームを搬送するために提示されています。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2009 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2009 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクション4.eに記載されており、BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Conventions .....................................................3\n3. Definitions and Abbreviations ...................................3\n   3.1. Definitions ................................................3\n   3.2. Abbreviations ..............................................4\n4. Transport of MPEG Surround ......................................4\n   4.1. Embedded Spatial Audio Data in AAC Payloads ................4\n   4.2. MPEG Surround Elementary Stream ............................5\n        4.2.1. Low Bitrate MPEG Surround ...........................7\n        4.2.2. High Bitrate MPEG Surround ..........................8\n5. IANA Considerations .............................................8\n   5.1. Media Type Registration ....................................9\n   5.2. Registration of Mode Definitions with IANA .................9\n   5.3. Usage of SDP ..............................................10\n6. Security Considerations ........................................10\n7. References .....................................................11\n   7.1. Normative References ......................................11\n   7.2. Informative References ....................................11",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "MPEG Surround (Spatial Audio Coding, SAC) [23003-1] is an International Standard that was finalized by MPEG in January 2007. It is capable of re-creating N channels based on M < N transmitted channels and additional control data. In the preferred modes of operating the Spatial Audio Coding system, the M channels can either be a single mono channel or a stereo channel pair. The control data represents a significantly lower data rate than the data rate required for transmitting all N channels, making the coding very efficient while at the same time ensuring compatibility with M channel devices.",
      "ja": "MPEGサラウンド（空間オーディオコーディング、SAC）は[23003から1】また、M <Nの送信チャネル及び追加の制御データに基づいて再作成Nチャネルの可能な2007年1月にMPEGによって確定された国際規格です。空間オーディオコーディングシステムを操作する好ましい様式において、Mチャンネルは単一のモノチャネルまたはステレオチャンネル対のいずれかであり得ます。制御データは、すべてのNチャネルの送信と同時に、Mチャンネル装置との互換性を確保しつつ、符号化を非常に効率的にするために必要なデータレートよりかなり低いデータレートを表しています。"
    },
    {
      "indent": 3,
      "text": "The MPEG Surround standard incorporates a number of tools that enable features that allow for broad application of the standard. A key feature is the ability to scale the spatial image quality gradually from very low spatial overhead towards transparency. Another key feature is that the decoder input can be made compatible to existing matrixed surround technologies.",
      "ja": "MPEGサラウンド標準は、標準の広範な適用を可能な機能を可能にするツールの数が組み込まれています。主な特徴は、透明性に向けて非常に低い空間頭上から徐々に空間画像品質をスケーリングする機能です。もう一つの重要な特徴は、デコーダ入力は、既存のマトリクス化サラウンド技術を両立させることができるということです。"
    },
    {
      "indent": 3,
      "text": "As an example, for 5.1 multi-channel audio, the MPEG Surround encoder creates a stereo (or mono) downmix signal and spatial information describing the full 5.1 material in a highly efficient, parameterised format. The spatial information is transmitted alongside the downmix.",
      "ja": "一例として、5.1マルチチャンネルオーディオのため、MPEGサラウンドエンコーダは、ステレオ（又はモノラル）ダウンミックス信号と高効率、パラメータ化形式でフル5.1材料を記述する空間情報を生成します。空間情報は、ダウンミックスと一緒に送信されます。"
    },
    {
      "indent": 3,
      "text": "By using MPEG Surround, existing services can easily be upgraded to provide surround sound in a backwards-compatible fashion. While a stereo decoder in an existing legacy consumer device ignores the MPEG Surround data and plays back the stereo signal without any quality degradation, an MPEG-Surround-enabled decoder will deliver high quality, multi-channel audio.",
      "ja": "MPEGサラウンドを使用することにより、既存のサービスを簡単に後方互換性の方法でのサラウンドサウンドを提供するためにアップグレードすることができます。既存のレガシーコンシューマデバイスにおけるステレオデコーダは、MPEGサラウンドデータを無視し、任意の品質を低下させることなくステレオ信号を再生しながら、MPEGサラウンド対応のデコーダは、高品質、マルチチャンネルオーディオを提供します。"
    },
    {
      "indent": 3,
      "text": "The MPEG Surround decoder can operate in modes that render the multi-channel signal to multi-channel or stereo output, or it can operate in a two-channel headphone mode to produce a virtual surround output signal.",
      "ja": "MPEGサラウンドデコーダは、マルチチャネル又はステレオ出力するマルチチャネル信号をレンダリングモードで動作することができ、またはそれは、仮想サラウンド出力信号を生成する2チャンネルヘッドホンモードで動作することができます。"
    },
    {
      "indent": 0,
      "text": "2. Conventions",
      "section_title": true,
      "ja": "2.表記"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "3. Definitions and Abbreviations",
      "section_title": true,
      "ja": "3.定義および略語"
    },
    {
      "indent": 0,
      "text": "3.1. Definitions",
      "section_title": true,
      "ja": "3.1. 定義"
    },
    {
      "indent": 3,
      "text": "This memo makes use of the definitions specified in [14496-1], [14496-3], [23003-1], and [RFC3640]. Frequently used terms are summed up for convenience:",
      "ja": "このメモは、[14496-1]、[14496-3]、[23003から1]、および[RFC3640]で指定された定義を使用しています。頻繁に使用される用語は便宜的にまとめています。"
    },
    {
      "indent": 3,
      "text": "Access Unit: An MPEG Access Unit is the smallest data entity to which timing information is attributed. In the case of audio, an Access Unit is the smallest individually accessible portion of coded audio data within an elementary stream.",
      "ja": "アクセスユニット：MPEGアクセスユニットは、タイミング情報帰属された最小のデータエンティティです。オーディオの場合には、アクセスユニットをエレメンタリーストリーム内の符号化されたオーディオデータの最小個別にアクセスする部分です。"
    },
    {
      "indent": 3,
      "text": "AudioSpecificConfig(): Extends the class DecoderSpecificInfo(), as defined in [14496-1], when the objectType indication refers to a stream complying with [14496-3]. AudioSpecificConfig() is used as the configuration structure for MPEG-4 audio as specified in [14496-3]. It contains the field audioObjectType, which distinguishes between the different audio codecs defined in [14496-3], general audio information (e.g., the sampling frequency and number of channels), and further codec-dependent information structures.",
      "ja": "AudioSpecificConfig（）：objectTypeに指示が[14496-3]に準拠したストリームを指す場合、[14496-1]で定義されるように、）（クラスDecoderSpecificInfoを拡張。 [14496-3]で指定されるようAudioSpecificConfig（）は、MPEG-4オーディオのためのコンフィギュレーション構造として使用されます。それは[14496-3]で定義された異なるオーディオコーデックを区別するフィールドaudioObjectTypeを含んで、一般的なオーディオ情報（例えば、サンプリング周波数及びチャンネル数）、およびさらにコーデック依存情報構造。"
    },
    {
      "indent": 3,
      "text": "SpatialSpecificConfig(): Configuration structure for MPEG Surround audio coding, as specified in [23003-1]. An AudioSpecificConfig() with an audioObjectType of value 30 contains a SpatialSpecificConfig() structure.",
      "ja": "SpatialSpecificConfig（）：23003から1]で指定されるようにMPEGサラウンドオーディオ符号化のためのコンフィギュレーション構造。値30のaudioObjectTypeとAudioSpecificConfigは（）SpatialSpecificConfig（）構造を含みます。"
    },
    {
      "indent": 0,
      "text": "3.2. Abbreviations",
      "section_title": true,
      "ja": "3.2. 略語"
    },
    {
      "indent": 5,
      "text": "AOT:    Audio Object Type\nAAC:    Advanced Audio Coding\nASC:    AudioSpecificConfig() structure\nAU:     Access Unit\nHE AAC: High Efficiency AAC\nPLI:    Profile and Level Indication\nSSC:    SpatialSpecificConfig() structure",
      "raw": true
    },
    {
      "indent": 0,
      "text": "4. Transport of MPEG Surround",
      "section_title": true,
      "ja": "MPEGサラウンドの4交通"
    },
    {
      "indent": 3,
      "text": "From a top-level perspective, MPEG Surround data can be subdivided into configuration data contained in the SpatialSpecificConfig() (SSC) and the SpatialFrame(), which contains the MPEG Surround payload. The configuration data can be signaled in-band or out-of-band. In the case of in-band signaling the SSC is conveyed in a SacDataFrame() jointly with a SpatialFrame(). In the case of out-of-band signaling, the SSC is transmitted to the decoder separately, e.g., by Session Description Protocol (SDP) [RFC4566] means.",
      "ja": "トップレベルの観点から、MPEGサラウンドデータSpatialSpecificConfig（）（SSC）とMPEGサラウンドペイロードを含むSpatialFrame（）に含まれるコンフィギュレーションデータに細分化することができます。構成データは、帯域内または帯域外シグナリングすることができます。インバンドSSCシグナリングの場合に共同SpatialFrameとSacDataFrame（）（）に搬送されます。アウトオブバンドシグナリングの場合には、SSCは、セッション記述プロトコル（SDP）によって、例えば、別々にデコーダに送信される[RFC4566]は意味します。"
    },
    {
      "indent": 3,
      "text": "SpatialFrame()s may be transmitted either embedded into the downmix stream (Section 4.1) or as individual elementary streams besides the downmix audio stream (Section 4.2).",
      "ja": "SpatialFrame（）は、Sは送信のいずれかでダウンミックスオーディオストリーム（セクション4.2）の他に、ダウンミックスストリーム（セクション4.1）として、または個々のエレメンタリストリームの中に埋め込まれてもよいです。"
    },
    {
      "indent": 3,
      "text": "The buffer definition for AAC decoders limits the size of an AU, as specified in [14496-3]. For high-bitrate applications that exceed this limit, all MPEG Surround data MUST be put in a separate stream, as defined in Section 4.2.",
      "ja": "[14496-3]で指定されるようにAACデコーダのバッファ定義は、AUのサイズを制限します。セクション4.2で定義されるようにこの制限を超える高ビットレートアプリケーション用に、全てのMPEGサラウンドデータは、別々のストリームに入れなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.1. Embedded Spatial Audio Data in AAC Payloads",
      "section_title": true,
      "ja": "4.1.  AACのペイロードに空間オーディオデータを組み込み"
    },
    {
      "indent": 3,
      "text": "[14496-3] defines the extension_payload() as a mechanism for transport of extension data inside AAC payloads. Typical extension data include Spectral Band Replication (SBR) data and MPEG Surround data, i.e., a SacDataFrame() in extension_payload()s of type EXT_SAC_DATA. extension_payload()s reside inside the downmix AAC elementary stream. The resulting single elementary stream is transported as specified in [RFC3640]. As AAC decoders are required to skip unknown extension data, MPEG Surround data can be embedded in backwards-compatible fashion and be transported with the mechanism already described in [RFC3640].",
      "ja": "[14496-3] AACペイロード内の拡張データを搬送するための機構としてextension_payload（）を定義します。典型的な拡張データは、スペクトル帯域複製（SBR）データとMPEGサラウンドデータ、すなわち、extension_payloadでSacDataFrame（）（）S型EXT_SAC_DATAのが挙げられます。ダウンミックスAACエレメンタリストリーム内部extension_payload（）の存在。 [RFC3640]で指定されるように得られた単一のエレメンタリストリームが搬送されます。 AACデコーダが不明拡張データをスキップするために必要とされるように、MPEGサラウンドデータは、後方互換性のやり方で埋め込むことができ、すでに[RFC3640]に記載の機構で搬送すること。"
    },
    {
      "indent": 3,
      "text": "The SacDataFrame() includes a SpatialFrame() and an optional header that contains an SSC. Any SSC in a SacDataFrame() MUST be identical to the SSC conveyed via SDP for that stream.",
      "ja": "SacDataFrame（）はSpatialFrame（）およびSSCを含むオプションヘッダを含みます。 SacDataFrame内の任意のSSC（）は、そのストリームのためのSDPを介して伝達SSCと同一でなければなりません。"
    },
    {
      "indent": 3,
      "text": "No new mode is introduced for SpatialFrame()s being embedded into AAC payloads. Either the mode AAC-lbr or the mode AAC-hbr SHOULD be used. The additional Media Type parameters, as defined in Section 5.1, SHOULD be present when SpatialFrame()s are embedded into AAC payloads.",
      "ja": "新しいモードは、（）■AACペイロードに埋め込まれているSpatialFrameのために導入されていません。モードAAC-LBRやモードAAC-HBrのどちらかを使用する必要があります。 SpatialFrame（）SはAACペイロードに埋め込まれている場合、追加のメディアタイプパラメータは、セクション5.1で定義されるように、存在すべきです。"
    },
    {
      "indent": 3,
      "text": "For example:",
      "ja": "例えば："
    },
    {
      "indent": 3,
      "text": "m=audio 5000 RTP/AVP 96 a=rtpmap:96 mpeg4-generic/48000/2 a=fmtp:96 streamType=5; profile-level-id=44; mode=AAC-hbr; config=131 056E598; sizeLength=13; indexLength=3; indexDeltaLength=3; constant Duration=2048; MPS-profile-level-id=55; MPS-config=F1B4CF920442029B 501185B6DA00;",
      "ja": "M =オーディオ5000 RTP / AVP 96 = rtpmap：96 MPEG4-ジェネリック/ 2分の48000 A =のfmtp：96 streamType = 5。プロファイルレベルID = 44。モード= AAC-のHBr;設定= 131 056E598。 sizeLength = 13。 indexLength = 3。 indexDeltaLength = 3。一定の期間= 2048; MPS-プロファイルレベルID = 55。 MPS-config設定= F1B4CF920442029B 501185B6DA00。"
    },
    {
      "indent": 3,
      "text": "In this example, the stream specifies the HE AAC Profile at Level 2\n[Profile and Level Indication (PLI) 44] and the config string\ncontains the hexadecimal representation of the HE AAC ASC\n[audioObjectType=2 (AAC LC); extensionAudioObjectType=5 (SBR);\nsamplingFrequencyIndex=0x6 (24kHz);\nextensionSamplingFrequencyIndex=0x3 (48kHz); channelConfiguration=2\n(2.0 channels)] of the downmix AAC elementary stream that is using\nexplicit backwards-compatible signaling.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Furthermore, the stream specifies the MPEG Surround Baseline Profile at Level 3 (PLI55) and the MPS-config string contains the hexadecimal representation of the MPEG Surround ASC [audioObjectType=30 (MPEG Surround); samplingFrequencyIndex=0x3 (48kHz); channelConfiguration=6 (5.1 channels); sacPayloadEmbedding=1; SSC=(48 kHz; 32 slots; 525 tree; ResCoding=1; ResBands=[0,13,13,13])].",
      "ja": "また、ストリームは、レベル3（PLI55）でMPEGサラウンドベースラインプロファイルを指定し、MPS-設定ストリングは、MPEGサラウンドASC [audioObjectType = 30（MPEGサラウンド）の進表現を含みます。 samplingFrequencyIndex = 0x3の（48kHzの）。 channelConfiguration = 6（5.1チャンネル） sacPayloadEmbedding = 1。 SSC =（48 kHzで、32スロット、525ツリー; ResCoding = 1; ResBands = [0,13,13,13]）]。"
    },
    {
      "indent": 3,
      "text": "Note that the a=fmtp line of the example above has been wrapped to fit the page; it would comprise a single line in the SDP file.",
      "ja": "例のA =のfmtpラインは上記のページに収まるようにラップされていることに注意してください。それは、SDPファイル内の1行を含むであろう。"
    },
    {
      "indent": 0,
      "text": "4.2. MPEG Surround Elementary Stream",
      "section_title": true,
      "ja": "4.2.  MPEGサラウンド・エレメンタリ・ストリーム"
    },
    {
      "indent": 3,
      "text": "MPEG Surround SpatialFrame()s can be present in an individual elementary stream. This stream complements the stream containing the downmix audio data, which may be coded by an arbitrary coding scheme. MPEG Surround elementary streams are packetized as specified in [RFC3640]. The mode signaled and used for an MPEG Surround elementary stream MUST be either MPS-hbr or MPS-lbr. The MPS-hbr mode SHALL be used when the frame size may exceed 63 bytes, e.g., when high-bitrate residual coding is in use.",
      "ja": "MPEGサラウンドSpatialFrame（）Sは、個々のエレメンタリストリーム中に存在することができます。このストリームは、任意の符号化方式で符号化されてもよいダウンミックスオーディオデータを含むストリームを補完します。 [RFC3640]で指定されるようにMPEGサラウンドエレメンタリストリームがパケット化されます。 MPEGサラウンドエレメンタリストリームの合図と使用されるモードは、MPS-のHBrまたはMPS-LBRのいずれかでなければなりません。フレームサイズは、例えば、63バイトを超えることができる場合、高ビットレートの残差符号化が使用されているときMPS-HBrのモードは、使用しなければなりません。"
    },
    {
      "indent": 3,
      "text": "The dependency relationships between the MPEG Surround elementary stream and the downmix stream are signaled as specified in [RFC5583].",
      "ja": "[RFC5583]で指定されるようにMPEGサラウンドエレメンタリストリームとダウンミックスストリーム間の依存関係が通知されます。"
    },
    {
      "indent": 3,
      "text": "The media clocks of the MPEG Surround elementary stream and the downmix stream SHALL operate in the same clock domain, i.e., the clocks are derived from a common clock and MUST NOT drift. RTCP sender reports MUST indicate that the stream timestamps are not drifting, i.e., that a single sender report for each stream is sufficient to establish unambiguous timing. The sampling rate of the MPEG Surround signal and the decoded downmix signal MUST be identical.",
      "ja": "MPEGサラウンドエレメンタリストリームとダウンミックスストリームのメディアクロック、すなわち、クロックが共通クロックに由来し、ドリフトしてはいけません、同じクロック・ドメインで動作しなければなりません。 RTCP送信者レポートは、ストリームのタイムスタンプは、各ストリームのための単一の送信者レポートは、明確な時期を確立するのに十分であること、すなわち、漂流していないことを示す必要があります。 MPEGサラウンド信号と復号化されたダウンミックス信号のサンプリングレートは同一でなければなりません。"
    },
    {
      "indent": 3,
      "text": "If HE AAC is used as the coding scheme for the downmix, the RTP clock-rate of the downmix MAY be the sampling rate of the AAC core, i.e., the clock-rate of the MPEG Surround elementary stream is an integer multiple of the clock-rate of the downmix stream.",
      "ja": "HE AACをダウンミックスするための符号化方式として使用される場合、ダウンミックスのRTPクロックレートは、AACコアのサンプリングレートであってもよく、すなわち、MPEGサラウンドエレメンタリストリームのクロック・レートは、クロックの整数倍でありますダウンミックスストリームの-rate。"
    },
    {
      "indent": 3,
      "text": "Note that separate RTP streams have different random RTP timestamp offsets, and therefore RTCP MUST be used to synchronize the coded downmix audio data and the MPEG Surround elementary stream.",
      "ja": "別個のRTPストリームが異なるランダムRTPタイムスタンプオフセットを有し、したがって、RTCPは、符号化されたダウンミックスオーディオデータとMPEGサラウンドエレメンタリストリームを同期させるために使用されなければならないことに留意されたいです。"
    },
    {
      "indent": 3,
      "text": "For example:",
      "ja": "例えば："
    },
    {
      "indent": 3,
      "text": "a=group:DDP L1 L2",
      "ja": "=グループ：DDP L1 L2"
    },
    {
      "indent": 3,
      "text": "m=audio 5000 RTP/AVP 96 a=rtpmap:96 mpeg4-generic/48000/2 a=fmtp:96 streamType=5; profile-level-id=44; mode=AAC-hbr; config=2B1 18800; sizeLength=13; indexLength=3; indexDeltaLength=3; constantDu ration=2048 a=mid:L1",
      "ja": "M =オーディオ5000 RTP / AVP 96 = rtpmap：96 MPEG4-ジェネリック/ 2分の48000 A =のfmtp：96 streamType = 5。プロファイルレベルID = 44。モード= AAC-のHBr;コンフィグ= 2B1 18800; sizeLength = 13。 indexLength = 3。 indexDeltaLength = 3。 constantDu比= 2048 =中旬：L1"
    },
    {
      "indent": 3,
      "text": "m=audio 5002 RTP/AVP 97 a=rtpmap:97 mpeg4-generic/48000/6 a=fmtp:97 streamType=5; profile-level-id=55; mode=MPS-hbr; config=F1B 0CF920460029B601189E79E70; sizeLength=13; indexLength=3; indexDelt aLength=3; constantDuration=2048 a=mid:L2 a=depend:97 lay L1:96",
      "ja": "M =オーディオ5002 RTP / AVP 97 = rtpmap：97 MPEG4-ジェネリック/ 6分の48000 A =のfmtp：97 streamType = 5。プロファイルレベルID = 55。モード= MPS-のHBr;コンフィグ= F1B 0CF920460029B601189E79E70。 sizeLength = 13。 indexLength = 3。 indexDelt aLength = 3。 constantDuration = 2048 =ミッド：L2のA =は依存：97 L1レイ96"
    },
    {
      "indent": 3,
      "text": "In this example, the first stream specifies the HE AAC Profile at\nLevel 2 (PLI44) and the config string contains the hexadecimal\nrepresentation of the HE AAC ASC [audioObjectType=2 (AAC LC);\nextensionAudioObjectType=5 (SBR); samplingFrequencyIndex=0x6 (24kHz);\nextensionSamplingFrequencyIndex=0x3 (48kHz); channelConfiguration=2\n(2.0 channels)].",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The second stream specifies Baseline MPEG Surround Profile at Level 3\n(PLI55) and the config string contains the hexadecimal representation\nof the ASC [AOT=30(MPEG Surround); 48 kHz; 5.1-ch;\nsacPayloadEmbedding=0; SSC=(48 kHz; 32 slots; 525 tree; ResCoding=1;\nResBands=[7,7,7,7])].",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Note that the a=fmtp lines of the example above have been wrapped to fit the page; they would each comprise a single line in the SDP file.",
      "ja": "例のA =のfmtpラインは上記のページに収まるようにラップされていることに注意してください。彼らは、各SDPファイル内の1行を含むであろう。"
    },
    {
      "indent": 0,
      "text": "4.2.1. Low Bitrate MPEG Surround",
      "section_title": true,
      "ja": "4.2.1. 低ビットレートのMPEGサラウンド"
    },
    {
      "indent": 3,
      "text": "This mode is signaled by mode=MPS-lbr. This mode supports the transport of one or more complete Access Units, each consisting of a single MPEG Surround SpatialFrame(). The AUs can be variably sized and interleaved. The maximum size of a SpatialFrame() is 63 bytes. Fragmentation MUST NOT be used in this mode. Receivers MUST support de-interleaving.",
      "ja": "このモードは、モード= MPS-LBRによって通知されます。このモードは、それぞれ単一のMPEGサラウンドSpatialFrameからなる、一つ以上の完全なアクセスユニットのトランスポートをサポート（）。 AUは、可変サイズとインターリーブすることができます。 SpatialFrame（）の最大サイズは63バイトです。断片化は、このモードで使用してはいけません。レシーバは、デインターリーブをサポートしなければなりません。"
    },
    {
      "indent": 3,
      "text": "The payload configuration is the same as in the AAC-lbr mode. It consists of the AU Header Section, followed by concatenated AUs. Note that Access Units are byte-aligned. The Auxiliary Section MUST be empty in the MPS-lbr mode. The 1-octet AU-header MUST provide:",
      "ja": "ペイロード構成は、AAC-LBRモードと同じです。これは、連結のAUが続く、AUヘッダーセクションから構成されています。アクセス単位はバイト整列されていることに注意してください。補助部は、MPS-LBRモードでは空でなければなりません。 1オクテットAU-ヘッダが指定する必要があります。"
    },
    {
      "indent": 3,
      "text": "1. the size of each AAC frame, encoded as 6 bits.",
      "section_title": true,
      "ja": "6ビットで符号化された各AACフレームの1サイズ。"
    },
    {
      "indent": 3,
      "text": "2. 2 bits of index information for computing the sequence (and hence timing) of each SpatialFrame().",
      "ja": "2.各SpatialFrameのシーケンスを計算する（したがってタイミング）のインデックス情報の2ビット（）。"
    },
    {
      "indent": 3,
      "text": "The concatenated AU Header Section MUST be preceded by the 16-bit AU-headers-length field.",
      "ja": "連結AUヘッダセクションは、16ビットAU-ヘッダ長フィールドが先行されなければなりません。"
    },
    {
      "indent": 3,
      "text": "In addition to the required Media format parameters, the following parameters MUST be present with fixed values: sizeLength (fixed value 6), indexLength (fixed value 2), and indexDeltaLength (fixed value 2). The parameter maxDisplacement MUST be present when interleaving. SpatialFrame()s always have a fixed duration per AU; the fixed duration MUST be signaled by the Media format parameter constantDuration.",
      "ja": "sizeLength（固定値6）、indexLength（固定値2）、及びindexDeltaLength（固定値2）：必要なメディアフォーマットのパラメータに加えて、以下のパラメータは、固定値で存在しなければなりません。インターリーブときパラメータmaxDisplacementが存在しなければなりません。 SpatialFrame（）は常にAUあたりの固定期間を有するSであり、固定された期間はメディアフォーマットパラメータconstantDurationによってシグナリングされなければなりません。"
    },
    {
      "indent": 3,
      "text": "The value of the \"config\" parameter is the hexadecimal representation of the ASC, as defined in [14496-3], with an AOT of 30 and the sacPayloadEmbedding flag set to 0.",
      "ja": "30のAOTと0に設定sacPayloadEmbeddingフラグで、[14496-3]で定義されるように「設定」パラメータの値は、ASCの16進表現です。"
    },
    {
      "indent": 3,
      "text": "The \"profile-level-id\" parameter SHALL contain a valid PLI for MPEG Surround, as specified in [14496-3].",
      "ja": "[14496-3]で指定されるように、「プロファイルレベルID」パラメータは、MPEGサラウンドの有効PLIを含まなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.2.2. High Bitrate MPEG Surround",
      "section_title": true,
      "ja": "4.2.2. 高ビットレートMPEGサラウンド"
    },
    {
      "indent": 3,
      "text": "This mode is signaled by mode=MPS-hbr. This mode supports the transportation of either one fragment of an Access Unit or one complete AU or several complete AUs. Each AU consists of a single MPEG Surround SpatialFrame(). The AUs can be variably sized and interleaved. The maximum size of a SpatialFrame() is 8191 bytes. Receivers MUST support de-interleaving.",
      "ja": "このモードは、モード= MPS-のHBrによって通知されます。このモードは、アクセスユニットの一つの断片または1つの完全なAUまたは複数の完全なのAUのいずれかの輸送をサポートしています。各AU（）は、単一のMPEGサラウンドSpatialFrameから成ります。 AUは、可変サイズとインターリーブすることができます。 SpatialFrame（）の最大サイズは8191バイトです。レシーバは、デインターリーブをサポートしなければなりません。"
    },
    {
      "indent": 3,
      "text": "The payload configuration is the same as in the AAC-hbr mode. It consists of the AU Header Section, followed by either one SpatialFrame(), a fragment of a SpatialFrame(), or several concatenated SpatialFrame()s. Note that Access Units are byte-aligned. The Auxiliary Section MUST be empty in the MPS-hbr mode. The 2-octet AU-header MUST provide:",
      "ja": "ペイロード構成は、AAC-HBrのモードと同じです。それはいずれかSpatialFrame（）続いて、AUヘッダセクションから構成され、SpatialFrameの断片（）、又はいくつかの連結SpatialFrame（）S。アクセス単位はバイト整列されていることに注意してください。補助部は、MPS-HBrのモードでは空でなければなりません。 2オクテットAU-ヘッダが指定する必要があります。"
    },
    {
      "indent": 3,
      "text": "1. the size of each AAC frame, encoded as 13 bits.",
      "section_title": true,
      "ja": "13ビットとしてエンコード各AACフレームの1サイズ。"
    },
    {
      "indent": 3,
      "text": "2. 3 bits of index information for computing the sequence (and hence timing) of each SpatialFrame(), i.e., the AU-Index or AU-Index-delta field.",
      "ja": "各SpatialFrame（）、即ち、AU-INDEXまたはAU-インデックスデルタフィールドのシーケンスを計算する（したがってタイミング）のインデックス情報の2ビット3。"
    },
    {
      "indent": 3,
      "text": "Each AU-Index field MUST be coded with the value 0. The concatenated AU Header Section MUST be preceded by the 16-bit AU-headers-length field.",
      "ja": "各AU-Indexフィールドは、連結AUヘッダセクション0の値で符号化されなければならない16ビットAU-ヘッダ長フィールドが先行されなければなりません。"
    },
    {
      "indent": 3,
      "text": "In addition to the required Media format parameters, the following parameters MUST be present with fixed values: sizeLength (fixed value 13), indexLength (fixed value 3), and indexDeltaLength (fixed value 3). The parameter maxDisplacement MUST be present when interleaving. SpatialFrame()s always have a fixed duration per AU; the fixed duration MUST be signaled by the Media format parameter constantDuration.",
      "ja": "sizeLength（固定値13）、indexLength（固定値3）、及びindexDeltaLength（固定値3）：必要なメディアフォーマットのパラメータに加えて、以下のパラメータは、固定値で存在しなければなりません。インターリーブときパラメータmaxDisplacementが存在しなければなりません。 SpatialFrame（）は常にAUあたりの固定期間を有するSであり、固定された期間はメディアフォーマットパラメータconstantDurationによってシグナリングされなければなりません。"
    },
    {
      "indent": 3,
      "text": "The value of the \"config\" parameter is the hexadecimal representation of the ASC, as defined in [14496-3], with an AOT of 30 and the sacPayloadEmbedding flag set to 0.",
      "ja": "30のAOTと0に設定sacPayloadEmbeddingフラグで、[14496-3]で定義されるように「設定」パラメータの値は、ASCの16進表現です。"
    },
    {
      "indent": 3,
      "text": "The \"profile-level-id\" parameter SHALL contain a valid PLI for MPEG Surround, as specified in [14496-3].",
      "ja": "[14496-3]で指定されるように、「プロファイルレベルID」パラメータは、MPEGサラウンドの有効PLIを含まなければなりません。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "ja": "5. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This memo defines additional optional format parameters to the Media type \"audio\" and its subtype \"mpeg4-generic\". These parameters SHALL only be used in combination with the AAC-lbr or AAC-hbr modes (cf. Section 3.3 of [RFC3640]) of \"mpeg4-generic\".",
      "ja": "このメモはメディアタイプ「オーディオ」とそのサブタイプ「mpeg4-ジェネリック」に追加のオプションフォーマットパラメータを定義します。これらのパラメータのみAAC-LBRまたはAAC-HBrのモードと組み合わせて使用​​されなければならない（の参照セクション3.3 [RFC3640]）、「MPEG4-ジェネリック」の。"
    },
    {
      "indent": 0,
      "text": "5.1. Media Type Registration",
      "section_title": true,
      "ja": "5.1. メディアタイプ登録"
    },
    {
      "indent": 3,
      "text": "This memo defines the following additional optional parameters, which SHALL be used if MPEG Surround data is present inside the payload of an AAC elementary stream.",
      "ja": "このメモは、MPEGサラウンドデータはAACエレメンタリーストリームのペイロード内に存在する場合に使用しなければならない以下の追加のオプションのパラメータを定義します。"
    },
    {
      "indent": 3,
      "text": "MPS-profile-level-id: A decimal representation of the MPEG Surround Profile and Level indication as defined in [14496-3]. This parameter MUST be used in the capability exchange or session set-up procedure to indicate the MPEG Surround Profile and Level that the decoder must be capable of in order to decode the stream.",
      "ja": "MPS-プロファイルレベルID：[14496-3]で定義されるようにMPEGサラウンドプロファイルとレベル表示の10進表現。このパラメータは、デコーダがストリームをデコードするためにすることができなければならないことをMPEGサラウンドプロファイルとレベルを示すために、能力交換、またはセッション設定手順で使用されなければなりません。"
    },
    {
      "indent": 3,
      "text": "MPS-config: A hexadecimal representation of an octet string that expresses the AudioSpecificConfig (ASC), as defined in [14496-3], for MPEG Surround. The ASC is mapped onto the hexadecimal octet string in a most significant bit (MSB)-first basis. The AOT in this ASC SHALL have the value 30. The SSC inside the ASC MUST have the sacPayloadEmbedding flag set to 1.",
      "ja": "MPS-設定：MPEGサラウンドのために、[14496-3]で定義されるように、AudioSpecificConfig（ASC）を発現オクテットストリングの16進表現。 ASCは、最上位ビット（MSB）-first基づい16進オクテット列にマッピングされます。このASCでAOTは1に設定さsacPayloadEmbeddingフラグを持たなければならない値30 ASC内部SSCを持たなければなりません。"
    },
    {
      "indent": 0,
      "text": "5.2. Registration of Mode Definitions with IANA",
      "section_title": true,
      "ja": "5.2.  IANAとモードの定義の登録"
    },
    {
      "indent": 3,
      "text": "This section of this memo requests the registration of the \"MPS-hbr\" value and the \"MPS-lbr\" value for the \"mode\" parameter of the \"mpeg4- generic\" media subtype within the media type \"audio\". The \"mpeg4- generic\" media subtype is defined in [RFC3640], and [RFC3640] defines a repository for the \"mode\" parameter. This memo registers the modes \"MPS-hbr\" and \"MPS-lbr\" to support MPEG Surround elementary streams.",
      "ja": "このメモのこのセクションでは、「MPS-HBrの」値と「MPS-LBR」メディアタイプ「オーディオ」内の「mpeg4-ジェネリック」メディアサブタイプの「モード」パラメータの値の登録を要求します。 「mpeg4-ジェネリック」メディアサブタイプは[RFC3640]で定義され、そして[RFC3640]は、「モード」パラメータのリポジトリを定義します。このメモは、MPEGサラウンドエレメンタリストリームをサポートするために、モード「MPS-のHBr」および「MPS-LBR」を登録します。"
    },
    {
      "indent": 3,
      "text": "Media type name:",
      "ja": "メディアタイプ名："
    },
    {
      "indent": 6,
      "text": "audio",
      "ja": "オーディオ"
    },
    {
      "indent": 3,
      "text": "Subtype name:",
      "ja": "サブタイプ名："
    },
    {
      "indent": 6,
      "text": "mpeg4-generic",
      "ja": "mpeg4-ジェネリック"
    },
    {
      "indent": 3,
      "text": "Required parameters:",
      "ja": "必須パラメータ："
    },
    {
      "indent": 6,
      "text": "The \"mode\" parameter is required by [RFC3640]. This memo specifies the additional modes \"MPS-hbr\" and \"MPS-lbr\", in accordance with [RFC3640].",
      "ja": "「モード」パラメータは、[RFC3640]によって必要とされます。このメモは、[RFC3640]に従って、追加モード \"MPS-のHBr\" と \"MPS-LBR\" を指定します。"
    },
    {
      "indent": 3,
      "text": "Optional parameters:",
      "ja": "オプションのパラメータ："
    },
    {
      "indent": 6,
      "text": "For the modes \"AAC-hbr\" and \"AAC-lbr\", this memo specifies the additional optional parameters \"MPS-profile-level-id\" and \"MPS-config\". See Section 4.1 for usage details.",
      "ja": "モード「AAC-のHBr」および「AAC-LBR」は、このメモは、追加のオプションパラメータ「MPS-プロファイルレベルID」と「MPS-設定」を指定します。使用方法の詳細については、セクション4.1を参照してください。"
    },
    {
      "indent": 6,
      "text": "Optional parameters for the modes \"MPS-hbr\" and \"MPS-lbr\" may be used as specified in [RFC3640]. The optional parameters \"MPS-profile-level-id\" and \"MPS-config\" SHALL NOT be used for the modes \"MPS-hbr\" and \"MPS-lbr\".",
      "ja": "[RFC3640]で指定されるようにモード「MPS-のHBr」および「MPS-LBR」のオプションのパラメータが使用されてもよいです。オプションのパラメータ \"MPS-プロファイルレベルID\" と \"MPS-configが\" モード \"MPS-のHBr\" および \"MPS-LBR\" に使用してはなりません。"
    },
    {
      "indent": 0,
      "text": "5.3. Usage of SDP",
      "section_title": true,
      "ja": "5.3.  SDPの使い方"
    },
    {
      "indent": 3,
      "text": "It is assumed that the Media format parameters are conveyed via an SDP message, as specified in Section 4.4 of [RFC3640].",
      "ja": "[RFC3640]のセクション4.4で指定されているメディアフォーマットのパラメータは、SDPメッセージを介して搬送されているものとします。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "RTP packets using the payload format defined in this specification are subject to the security considerations discussed in the RTP specification [RFC3550], in the RTP payload format specification for MPEG-4 elementary streams [RFC3640] (which is extended with this memo), and in any applicable RTP profile. The main security considerations for the RTP packet carrying the RTP payload format defined within this memo are confidentiality, integrity, and source authenticity. Confidentiality is achieved by encryption of the RTP payload. Integrity of the RTP packets is achieved through a suitable cryptographic integrity-protection mechanism. Such a cryptographic system may also allow the authentication of the source of the payload. A suitable security mechanism for this RTP payload format should provide confidentiality, integrity protection, and source authentication capable of at least determining if an RTP packet is from a member of the RTP session.",
      "ja": "本明細書で定義されたペイロードフォーマットを使用して、RTPパケットが（このメモで拡張される）MPEG-4エレメンタリストリーム[RFC3640]のためのRTPペイロードフォーマット仕様で、RTP仕様[RFC3550]で説明したセキュリティ問題を受けることがあり、そして適用可能なRTPプロファイルインチこのメモ内で定義されたRTPペイロードフォーマットを運ぶRTPパケットのための主要なセキュリティ上の考慮事項は、機密性、完全性、およびソース信憑です。機密性は、RTPペイロードの暗号化によって達成されます。 RTPパケットの整合性は、適切な暗号の完全性保護機構を介して達成されます。そのような暗号化システムはまた、ペイロードのソースの認証を可能にすることができます。このRTPペイロードフォーマットに適したセキュリティ・メカニズムは、機密性、完全性保護、及び少なくともRTPパケットがRTPセッションのメンバーからのものであるかどうかを決定することができるソース認証を提供すべきです。"
    },
    {
      "indent": 3,
      "text": "The AAC audio codec includes an extension mechanism to transmit extra data within a stream that is gracefully skipped by decoders that do not support this extra data. This covert channel may be used to transmit unauthorized data in an otherwise valid stream.",
      "ja": "AACオーディオコーデックは、優雅に、この余分なデータをサポートしていないデコーダによってスキップされたストリーム内の余分なデータを送信するための拡張機構を備えています。この隠れチャネルは、そうでない場合は有効なストリームで不正なデータを送信するために使用することができます。"
    },
    {
      "indent": 3,
      "text": "Note that the appropriate mechanism to provide security to RTP and payloads following this memo may vary. It is dependent on the application, the transport, and the signaling protocol employed. Therefore, a single mechanism is not sufficient; although, if suitable, usage of the Secure Real-time Transport Protocol (SRTP) [RFC3711] is recommended. Other mechanisms that may be used are IPsec [RFC4301] and Transport Layer Security (TLS) [RFC5246] (RTP over TCP); other alternatives may exist.",
      "ja": "このメモ以下RTPとペイロードにセキュリティを提供するための適切な機構が変化してもよいことに留意されたいです。これは、アプリケーション、輸送、および使用されるシグナリングプロトコルに依存しています。したがって、単一のメカニズムは十分ではありません。 、にもかかわらず、適切な場合には、セキュアリアルタイム転送プロトコル（SRTP）[RFC3711]の使用が推奨されます。使用できる他のメカニズムは、IPsec [RFC4301]およびTransport Layer Security（TLS）[RFC5246]（TCP上のRTP）をしています。他の選択肢が存在してもよいです。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7.参考"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "ja": "7.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[14496-1] MPEG, \"ISO/IEC International Standard 14496-1 - Coding of audio-visual objects, Part 1 Systems\", 2004.",
      "ja": "[14496-1] MPEG、 \"ISO / IEC国際規格14496-1  - オーディオビジュアルオブジェクトのコーディング、パート1つのシステム\"、2004年。"
    },
    {
      "indent": 3,
      "text": "[14496-3] MPEG, \"ISO/IEC International Standard 14496-3 - Coding of audio-visual objects, Part 3 Audio\", 2009.",
      "ja": "[14496-3] MPEG、 \"ISO / IEC国際規格14496-3  - オーディオビジュアルオブジェクトのコーディング、パート3オーディオ\"、2009年。"
    },
    {
      "indent": 3,
      "text": "[23003-1] MPEG, \"ISO/IEC International Standard 23003-1 - MPEG Surround (MPEG D)\", 2007.",
      "ja": "[23003から1】MPEG、 \"ISO / IEC国際規格23003から1  -  MPEGサラウンド（MPEG D）\"、2007年"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3550] Schulzrinne, H., Casner, S., Frederick, R., and V. Jacobson, \"RTP: A Transport Protocol for Real-Time Applications\", STD 64, RFC 3550, July 2003.",
      "ja": "[RFC3550] Schulzrinneと、H.、Casner、S.、フレデリック、R.、およびV.ヤコブソン、 \"RTP：リアルタイムアプリケーションのためのトランスポートプロトコル\"、STD 64、RFC 3550、2003年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC3640] van der Meer, J., Mackie, D., Swaminathan, V., Singer, D., and P. Gentric, \"RTP Payload Format for Transport of MPEG-4 Elementary Streams\", RFC 3640, November 2003.",
      "ja": "[RFC3640]ファンデミーア、J.、マッキー、D.、スワミナサン、V.、歌手、D.、およびP. Gentric、 \"MPEG-4エレメンタリ・ストリームのトランスポートのためのRTPペイロードフォーマット\"、RFC 3640、2003年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC4566] Handley, M., Jacobson, V., and C. Perkins, \"SDP: Session Description Protocol\", RFC 4566, July 2006.",
      "ja": "[RFC4566]ハンドリー、M.、ヤコブソン、V.、およびC.パーキンス、 \"SDP：セッション記述プロトコル\"、RFC 4566、2006年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC5583] Schierl, T. and S. Wenger, \"Signaling Media Decoding Dependency in the Session Description Protocol (SDP)\", RFC 5583, July 2009.",
      "ja": "[RFC5583] Schierl、T.とS.ベンゲル監督、 \"セッション記述プロトコルにおけるシグナリングメディアのデコード依存（SDP）\"、RFC 5583、2009年7月。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "ja": "7.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC3711] Baugher, M., McGrew, D., Naslund, M., Carrara, E., and K. Norrman, \"The Secure Real-time Transport Protocol (SRTP)\", RFC 3711, March 2004.",
      "ja": "[RFC3711] Baugher、M.、マグリュー、D.、Naslund、M.、カララ、E.、およびK. Norrman、 \"セキュアリアルタイム転送プロトコル（SRTP）\"、RFC 3711、2004年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC4301] Kent, S. and K. Seo, \"Security Architecture for the Internet Protocol\", RFC 4301, December 2005.",
      "ja": "[RFC4301]ケント、S.とK. Seo、 \"インターネットプロトコルのためのセキュリティアーキテクチャ\"、RFC 4301、2005年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC5246] Dierks, T. and E. Rescorla, \"The Transport Layer Security (TLS) Protocol Version 1.2\", RFC 5246, August 2008.",
      "ja": "[RFC5246]ダークス、T.およびE.レスコラ、 \"トランスポート層セキュリティ（TLS）プロトコルバージョン1.2\"、RFC 5246、2008年8月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Frans de Bont Philips Electronics High Tech Campus 5 5656 AE Eindhoven, NL",
      "ja": "フランス・デ・ボン・フィリップス・エレクトロニクスハイテクキャンパス5 5656 AEアイントホーフェン、NL"
    },
    {
      "indent": 3,
      "text": "Phone: ++31 40 2740234 EMail: frans.de.bont@philips.com",
      "ja": "電話：++ 31 40 2740234 Eメール：frans.de.bont@philips.com"
    },
    {
      "indent": 3,
      "text": "Stefan Doehla Fraunhofer IIS Am Wolfmantel 33 91058 Erlangen, DE",
      "ja": "トーマスDoehlaフラウンホーファーIISアムWolfmantel 33 91058エアランゲン、DE"
    },
    {
      "indent": 3,
      "text": "Phone: +49 9131 776 6042 EMail: stefan.doehla@iis.fraunhofer.de",
      "ja": "電話：+49 9131 776 6042 Eメール：stefan.doehla@iis.fraunhofer.de"
    },
    {
      "indent": 3,
      "text": "Malte Schmidt Dolby Laboratories Deutschherrnstr. 15-19 90537 Nuernberg, DE",
      "ja": "マルテ・シュミットドルビーラボラトリーズDeutschherrnstr。 15-19 90537ニュルンベルク、DE"
    },
    {
      "indent": 3,
      "text": "Phone: +49 911 928 91 42 EMail: malte.schmidt@dolby.com",
      "ja": "電話：+49 911 928 91 42 Eメール：malte.schmidt@dolby.com"
    },
    {
      "indent": 3,
      "text": "Ralph Sperschneider Fraunhofer IIS Am Wolfmantel 33 91058 Erlangen, DE",
      "ja": "ラルフSperschneider望遠鏡IISアムWolfsmantel 33 91058エアランゲン、DE"
    },
    {
      "indent": 3,
      "text": "Phone: +49 9131 776 6167 EMail: ralph.sperschneider@iis.fraunhofer.de",
      "ja": "電話：+49 9131 776 6167 Eメール：ralph.sperschneider@iis.fraunhofer.de"
    }
  ]
}