{
  "title": {
    "text": "RFC 5781 - The rsync URI Scheme",
    "ja": "RFC 5781 - rsyncのURIスキーム"
  },
  "number": 5781,
  "created_at": "2019-10-28 21:41:15.166802+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         S. Weiler\nRequest for Comments: 5781                                  SPARTA, Inc.\nCategory: Informational                                          D. Ward\nISSN: 2070-1721                                                  Juniper\n                                                              R. Housley\n                                                          Vigil Security\n                                                           February 2010",
      "raw": true
    },
    {
      "indent": 26,
      "text": "The rsync URI Scheme",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document specifies the rsync Uniform Resource Identifier (URI) scheme.",
      "ja": "この文書では、rsyncの統一資源識別子（URI）方式を指定します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 IESGによって承認されていないすべての文書がインターネットStandardのどんなレベルの候補です。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc5781.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc5781で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2010 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2010 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "URIs were previously defined in RFC 2396, which was obsoleted by RFC 3986 [RFC3986]. The procedures for registering new URI schemes are defined in RFC 4395 [RFC4395]. The rsync utility provides fast incremental file transfer [rsync]. This document defines a URI scheme for rsync.",
      "ja": "URIは、以前RFC 3986 [RFC3986]によって廃止されたRFC 2396で定義されました。新しいURIスキームを登録するための手順は、RFC 4395 [RFC4395]で定義されています。 rsyncのユーティリティは、[rsyncの]高速増分ファイル転送を提供します。この文書では、rsyncのためのURIスキームを定義します。"
    },
    {
      "indent": 0,
      "text": "2. rsync URI registration",
      "section_title": true,
      "ja": "2. rsyncのURI登録"
    },
    {
      "indent": 3,
      "text": "This section contains the registration template for the rsync URI scheme in accordance with RFC 4395 [RFC4395]. This URI scheme is for the rsync protocol using TCP as the transport protocol. Other transports, such as rsync over SSH, are not supported by this URI scheme.",
      "ja": "このセクションでは、RFC 4395 [RFC4395]に従ってrsyncのURIスキームの登録テンプレートを含みます。このURIスキームは、トランスポートプロトコルとしてTCPを使ってrsyncプロトコルのためです。このようSSH経由でrsyncをなどの他のトランスポートは、このURIスキームによってサポートされていません。"
    },
    {
      "indent": 3,
      "text": "URI scheme name: rsync",
      "ja": "URIのスキーム名：rsyncの"
    },
    {
      "indent": 3,
      "text": "Status: provisional",
      "ja": "ステータス：暫定"
    },
    {
      "indent": 3,
      "text": "URI scheme syntax: An rsync URI describes a source or destination for the rsync application including a hostname, path, and optional user and port. The generic form of the rsync URI is:",
      "ja": "URIスキームの構文：rsyncのURIは、ホスト名、パス、およびオプションのユーザとポートを含むrsyncのアプリケーションのソースまたは宛先を記載しています。 rsyncのURIの一般的な形式は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "rsync://[user@]host[:PORT]/Source",
      "ja": "rsyncを：// [ユーザー@]ホスト[：PORT] /ソース"
    },
    {
      "indent": 3,
      "text": "The rsync URI follows the general syntax from RFC 3986 and is defined by the following ABNF [RFC5234]:",
      "ja": "rsyncのURIは、RFC 3986からの一般的な構文に従うと、以下のABNF [RFC5234]で定義されます。"
    },
    {
      "indent": 6,
      "text": "rsyncuri = \"rsync:\" hier-part ; See RFC 3986 for the definition ; of hier-part",
      "ja": "rsyncuri = \"rsyncを：\" のhier-部分;定義については、RFC 3986を参照してください。 hier-部分の"
    },
    {
      "indent": 3,
      "text": "URI scheme semantics: An rsync URI may be used as either a source or destination for the rsync application. If the port is not specified, it defaults to 873.",
      "ja": "URIスキームのセマンティクス：URIは、rsyncのアプリケーションのソースまたは宛先として使用することができるのrsync。 873へのポートが指定されていない場合、それがデフォルトになります。"
    },
    {
      "indent": 3,
      "text": "Encoding considerations: Since the rsync URI is defined using standard elements from RFC 3986, no special encoding considerations are present.",
      "ja": "符号の考慮：rsyncのURIは、RFC 3986の標準的な要素を使用して定義されているので、特別な符号化の考慮事項が存在しません。"
    },
    {
      "indent": 3,
      "text": "Applications/protocols that use this URI scheme name: The only application that uses rsync URIs is rsync.",
      "ja": "このURIのスキーム名を使用するアプリケーション/プロトコル：rsyncのURIはrsyncのある使用する唯一のアプリケーション。"
    },
    {
      "indent": 3,
      "text": "Interoperability considerations: Since only one application is expected to make use of rsync URIs, this URI scheme is expected to have few interoperability concerns.",
      "ja": "相互運用性に関する注意事項：唯一のアプリケーションはのrsyncのURIを使用することが期待されているので、このURIスキームは、いくつかの相互運用性の懸念を持っていることが予想されます。"
    },
    {
      "indent": 3,
      "text": "Security considerations: Section 7 of RFC 3986 describes general security considerations for URI schemes. The considerations about reliability and consistency, malicious construction, rare IP address formats, sensitive information, and semantic attacks all apply to rsync URIs. The considerations about transcoding do not apply. Given how rsync is regularly used, it is expected that most applications will not be bothered by data accessed via a given rsync URI changing over time.",
      "ja": "セキュリティの考慮事項：RFC 3986のセクション7は、URIスキームのための一般的なセキュリティ上の考慮事項について説明します。信頼性と一貫性、悪質な建設、珍しいIPアドレス形式、機密情報、およびセマンティック攻撃に関する注意事項は全てのURIをrsyncをするために適用されます。トランスコーディングに関する考慮事項が適用されません。 rsyncのが定期的に使用されているかを考えると、ほとんどのアプリケーションは、URIが時間とともに変化する特定のrsync経由でアクセスされるデータに悩まされることはありませんことを期待されています。"
    },
    {
      "indent": 3,
      "text": "Contact: Russ Housley <housley@vigilsec.com>",
      "ja": "連絡先：ラスHousley <housley@vigilsec.com>"
    },
    {
      "indent": 3,
      "text": "Author/Change controller: Russ Housley <housley@vigilsec.com>",
      "ja": "著者/変更コントローラ：ラスHousley <housley@vigilsec.com>"
    },
    {
      "indent": 3,
      "text": "References: see Section 5.",
      "ja": "参考資料：第5節を参照してください。"
    },
    {
      "indent": 0,
      "text": "3. IANA Considerations",
      "section_title": true,
      "ja": "3. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has registered the rsync provisional URI scheme using the template in Section 2.",
      "ja": "IANAは、第2節では、テンプレートを使ってrsync暫定URIスキームを登録しています。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "Many security considerations for the usage of URIs are discussed in Section 7 of [RFC3986]. The considerations about reliability and consistency, malicious construction, rare IP address formats, sensitive information, and semantic attacks all apply to rsync URIs. The considerations about transcoding do not apply. The rsync URI scheme has no particularly unique security considerations.",
      "ja": "URIの使用のための多くのセキュリティ上の考慮事項は、[RFC3986]のセクション7で説明されています。信頼性と一貫性、悪質な建設、珍しいIPアドレス形式、機密情報、およびセマンティック攻撃に関する注意事項は全てのURIをrsyncをするために適用されます。トランスコーディングに関する考慮事項が適用されません。 rsyncのURIスキームには、特にユニークなセキュリティ上の配慮を持っていません。"
    },
    {
      "indent": 3,
      "text": "The security considerations of the rsync protocol are not covered in this document.",
      "ja": "rsyncのプロトコルのセキュリティ上の考慮事項は、この文書でカバーされていません。"
    },
    {
      "indent": 0,
      "text": "5. Normative References",
      "section_title": true,
      "ja": "5.引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC3986] Berners-Lee, T., Fielding, R., and L. Masinter, \"Uniform Resource Identifier (URI): Generic Syntax\", STD 66, RFC 3986, January 2005.",
      "ja": "[RFC3986]バーナーズ - リー、T.、フィールディング、R.、およびL. Masinter、 \"ユニフォームリソース識別子（URI）：汎用構文\"、STD 66、RFC 3986、2005年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC4395] Hansen, T., Hardie, T., and L. Masinter, \"Guidelines and Registration Procedures for New URI Schemes\", BCP 35, RFC 4395, February 2006.",
      "ja": "[RFC4395]ハンセン、T.、ハーディ、T.、およびL. Masinter、 \"新しいURIスキームのためのガイドラインと登録手順\"、BCP 35、RFC 4395、2006年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC5234] Crocker, D., Ed., and P. Overell, \"Augmented BNF for Syntax Specifications: ABNF\", STD 68, RFC 5234, January 2008.",
      "ja": "\"構文仕様のための増大しているBNF：ABNF\" [RFC5234]クロッカー、D.、エド、およびP. Overell、。、STD 68、RFC 5234、2008年1月。"
    },
    {
      "indent": 0,
      "text": "6. Informative References",
      "section_title": true,
      "ja": "6.参考文献"
    },
    {
      "indent": 3,
      "text": "[rsync] http://rsync.samba.org/.",
      "ja": "【のrsync] http://rsync.samba.org/。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Samuel Weiler SPARTA, Inc. 7110 Samuel Morse Drive Columbia, Maryland 21046 US",
      "ja": "サミュエル・ワイラーSPARTA、Inc.の7110サミュエル・モールスドライブコロンビア、メリーランド州21046米国"
    },
    {
      "indent": 3,
      "text": "EMail: weiler@tislabs.com",
      "ja": "メールアドレス：weiler@tislabs.com"
    },
    {
      "indent": 3,
      "text": "Dave Ward Juniper Networks 1194 North Mathilda Avenue Sunnyvale, California 94089-1206 US",
      "ja": "デイブ・ワードジュニパーネットワークスの1194北マチルダアベニューサニーベール、カリフォルニア州94089から1206米"
    },
    {
      "indent": 3,
      "text": "EMail: dward@juniper.net",
      "ja": "メールアドレス：dward@juniper.net"
    },
    {
      "indent": 3,
      "text": "Russ Housley Vigil Security, LLC 918 Spring Knoll Drive Herndon, Virginia 20170 US",
      "ja": "ラスHousleyビジルセキュリティ、LLC 918春小山Driveハーンドン、バージニア州20170米国"
    },
    {
      "indent": 3,
      "text": "EMail: housley@vigilsec.com",
      "ja": "メールアドレス：housley@vigilsec.com"
    }
  ]
}