{
  "title": {
    "text": "RFC 5385 - Version 2.0 Microsoft Word Template for Creating Internet Drafts and RFCs",
    "ja": "RFC 5385 - インターネットドラフトやRFCを作成するためのバージョン2.0のMicrosoft Wordテンプレート"
  },
  "number": 5385,
  "created_at": "2019-10-27 04:56:49.834600+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Independent Submission                                          J. Touch\nRequest for Comments: 5385                                       USC/ISI\nObsoletes: 3285                                            February 2010\nCategory: Informational\nISSN: 2070-1721",
      "raw": true
    },
    {
      "indent": 17,
      "text": " Version 2.0 Microsoft Word Template\nfor Creating Internet Drafts and RFCs",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document describes the properties and use of a revised Microsoft Word template (.dot) for writing Internet Drafts and RFCs. It replaces the initial template described in RFC 3285 to more fully support Word's outline modes and to be easier to use. This template can be direct-printed and direct-viewed, where either is line-for-line identical with RFC Editor-compliant ASCII output. This version obsoletes RFC 3285.",
      "ja": "この文書はインターネットドラフトやRFCを書くために改訂されたMicrosoft Wordのテンプレート（.DOT）の性質及び使用を記載しています。これは、より完全にWordのアウトラインモードをサポートするために、使いやすいように、RFC 3285で説明した初期テンプレートを置き換えます。このテンプレートは、ラインのためのラインRFCエディタ準拠のASCII出力と同一であるいずれかの場合は、プリントダイレクトと直接閲覧することができます。このバージョンはRFC 3285を廃止します。"
    },
    {
      "indent": 3,
      "text": "The most recent version of this template and post-processing scripts are available at http://www.isi.edu/touch/tools.",
      "ja": "このテンプレートおよび後処理スクリプトの最新バージョンは、http://www.isi.edu/touch/toolsでご利用いただけます。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This is a contribution to the RFC Series, independently of any other RFC stream. The RFC Editor has chosen to publish this document at its discretion and makes no statement about its value for implementation or deployment. Documents approved for publication by the RFC Editor are not a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "これは、独立して、他のRFCストリームの、RFCシリーズへの貢献です。 RFC Editorはその裁量でこの文書を公開することを選択し、実装や展開のためにその値についての声明を出すていません。 RFC編集者によって公表のために承認されたドキュメントは、インターネット標準の任意のレベルの候補ではありません。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc5385.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc5385で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2010 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2010 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n2. Use .............................................................3\n   2.1. Setting up Your Version of Word to Edit RFCs ...............4\n   2.2. Editing ....................................................4\n   2.3. Saving the File ............................................6\n   2.4. Generating Output ..........................................6\n        2.4.1. Printing Direct to a Printer ........................6\n        2.4.2. Printing the Text File ..............................6\n        2.4.3. XML Support .........................................7\n3. Changes from RFC 3285 ...........................................7\n   3.1. Heading Styles .............................................7\n   3.2. References Style ...........................................8\n   3.3. Boilerplate ................................................9\n   3.4. Simplification .............................................9\n   3.5. Ability to Direct Print and Direct View ....................9\n4. Compatibility Issues ...........................................10\n5. Security Considerations ........................................10\n6. Acknowledgments ................................................10\nAppendix A. Template Configuration Details ........................11\n   A.1. Configure Styles ..........................................11\n        A.1.1. Redefine Existing Styles ...........................11\n        A.1.2. Add New Styles .....................................12\n        A.1.3. Hidden Styles ......................................13\n   A.2. Define Page Layout ........................................13\n   A.3. Insert Boilerplate ........................................14\n   A.4. Automatic Fields ..........................................15\nAppendix B. Post-Processor Script (Perl) ..........................17\nInformative References ............................................20",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "Internet Drafts and RFCs are predominantly written in embedded-text, compile-based formatting systems [1][4][5]. The primary and first such system is NROFF, a text-formatting utility based on manual entry of embedded configuration commands, such as \".p\" for new paragraphs. XML is a more recent alternative that uses structure tags instead of explicit formatting commands to allow a single file (.xml) to be 'compiled' into ASCII output, HTML, or a variety of other formats as desired [7].",
      "ja": "インターネットドラフトおよびRFCは、主に埋め込まれたテキストで記述され、コンパイルベースのフォーマットシステム[1] [4] [5]。一次および第一このようなシステムは、NROFF、新たな段落の「.P」として埋め込まれたコンフィギュレーションコマンドの手動入力に基づいて、テキストフォーマットユーティリティです。 XMLは、必要に応じて単一のファイル（.xmlファイル）をASCII出力、HTML、または他の様々なフォーマットに「コンパイル」されることを可能にするコマンドの明示的なフォーマットの代わりに、構造のタグを使用してより最近の代替物である[7]。"
    },
    {
      "indent": 3,
      "text": "Although XML adds more modern semantic information to the structure tags, neither system supports modern WYSIWYG (what-you-see-is-what-you-get) editing. Editors such as Microsoft Word and Corel WordPerfect provide not only WYSIWYG editing, but also semantic tags as well as outline-mode capabilities. To that end, a Word template called 2-Word.template.rtf was created that supports authoring RFCs, as described in RFC 3285 [6]. That version succeeded in enabling Word-based RFC editing, but did not support Word's outline mode renumbering capabilities.",
      "ja": "XMLは、構造タグに、より現代的な意味情報を追加しますが、どちらのシステムでは、近代的なWYSIWYG（何であるか - あなたは、見- - あなたは、何を得る - ）の編集をサポートしています。 Microsoft WordやCorelのWordPerfectのよう編集者は、WYSIWYG編集、だけでなく、意味タグだけでなく、アウトラインモード機能だけでなく、提供しています。 RFC 3285に記載されているように、その端部に、2- Word.template.rtf呼ばれるWordテンプレートは、[6]、オーサリングRFCをサポートするように作成しました。このバージョンは、WordベースのRFCの編集を可能に成功しましたが、Wordのアウトラインモードのリナンバリング機能をサポートしていませんでした。"
    },
    {
      "indent": 3,
      "text": "This document describes the properties and use of a revised Microsoft Word template (.dot) file that supports Internet Draft and RFC formatting, intended as an update to that of RFC 3285. This version, called 2-Word-v2.0.template.dot, addresses a number of issues with the preliminary version:",
      "ja": "この文書は、RFC 3285. 2ワードv2.0.templateと呼ばれるこのバージョンのものに更新するものでプロパティとインターネットドラフトやRFCのフォーマットをサポートしてい改訂のMicrosoft Wordテンプレート（.DOT）ファイルを使用する方法について説明します。ドットは、予備的なバージョンと多くの問題に対処します。"
    },
    {
      "indent": 3,
      "text": "o redefines basic styles (Normal, Heading1, etc.) rather than creating new styles,",
      "ja": "oはむしろ、新しいスタイルを作成するよりも、基本的なスタイル（ノーマル、見出し1など）を再定義し、"
    },
    {
      "indent": 3,
      "text": "o updates the boilerplate according to BCP 78,",
      "ja": "oは、BCP 78に係る定型を更新します"
    },
    {
      "indent": 3,
      "text": "o uses more conventional methods for autonumbered references and figures, including support for name-based references (e.g., \"[Tou2005]\"), and",
      "ja": "Oは、名前ベースの参考文献（例えば、「[Tou2005]」）のサポートを含むautonumbered参照および図面のためのより多くの従来の方法を使用し、及び"
    },
    {
      "indent": 3,
      "text": "o supports direct output to a printer from the .doc source, as well as RFC-3285-style 'print to text' with post-processing on Windows-based PCs.",
      "ja": "oは直接の.docソースからプリンタへの出力だけでなく、WindowsベースのPC上での後処理でRFC-3285-スタイル「テキストに印刷」をサポートしています。"
    },
    {
      "indent": 3,
      "text": "This document assumes familiarity with Microsoft Windows operating systems and the Word application.",
      "ja": "この文書では、Microsoft WindowsオペレーティングシステムやWordアプリケーションに精通している前提としています。"
    },
    {
      "indent": 0,
      "text": "2. Use",
      "section_title": true,
      "ja": "2."
    },
    {
      "indent": 3,
      "text": "To use this template, double-click on it in Windows (it may work in MacOS and/or OpenOffice, but this has not been confirmed). The result should be a 'new' document. Do NOT open this document from within Word, e.g., via the File->Open menu; this will edit the template, rather than using the template to create a new template-based document.",
      "ja": "このテンプレートを使用するには、Windowsでそれをダブルクリックします（これはMacOSの、および/またはOpenOfficeので働くかもしれないが、これは確認されていません）。その結果は、「新しい」文書でなければなりません。 [ファイル]> [開く]メニューを経由して、例えば、単語の中から、この文書を開けないでください。これはむしろ、新しいテンプレートベースのドキュメントを作成するためのテンプレートを使用するよりも、テンプレートを編集します。"
    },
    {
      "indent": 0,
      "text": "2.1. Setting up Your Version of Word to Edit RFCs",
      "section_title": true,
      "ja": "2.1.  Wordのバージョンを設定すると、RFCを編集します"
    },
    {
      "indent": 3,
      "text": "Unfortunately, Word does not have a way to save some useful settings in a template. It may be useful to configure autoformatting to avoid using smart quotes or hyphens. However, this template is compatible with these features as its post-processor script translates such non-standard character codes into their RFC-compatible ASCII equivalents.",
      "ja": "残念ながら、Wordのテンプレート内のいくつかの便利な設定を保存する方法がありません。スマート引用符やハイフンを使用しないようにオートフォーマットを設定することが有用であり得ます。そのポストプロセッサのスクリプトは、そのRFC互換のASCII同等物にこのような非標準の文字コードを変換するようしかし、このテンプレートは、これらの機能と互換性があります。"
    },
    {
      "indent": 0,
      "text": "2.2. Editing",
      "section_title": true,
      "ja": "2.2. 編集"
    },
    {
      "indent": 3,
      "text": "The template provides a number of styles for use (for details, see Appendix A). Some are redefined internal styles and some are new, as follows. Throughout the document, avoid the use of bold, italics, or any other character formatting, as well as any graphics or paragraph or table borders. Smart hyphens and quotes need not be avoided and will be translated during post-processing.",
      "ja": "テンプレートは、使用するスタイルの数を（詳細については、付録Aを参照）を提供します。一部には、内部のスタイルを再定義されており、以下のようにいくつかは、新しいです。ドキュメントでは、太字、斜体、または任意の他の文字書式、ならびに任意のグラフィックスや段落やテーブルの境界線の使用を避けます。スマートハイフンおよび引用符を回避する必要はなく、ポスト処理中に変換されます。"
    },
    {
      "indent": 3,
      "text": "The current styles allow existing hyphens to break (wrap) across lines, but do not add hyphenation. To insert a non-breaking hyphen, type <CTL-_> (control-underscore); this is particularly useful in URLs, which are more readable if not line-wrapped.",
      "ja": "現在のスタイルは、既存のハイフンが行に渡って（ラップ）を破ることができますが、ハイフネーションを追加しないでください。非破断ハイフンを挿入するには、タイプ<CTL -_>（制御下線）。これは、ラインラップされていない場合より読みやすくしているのURLに特に便利です。"
    },
    {
      "indent": 3,
      "text": "Note that it is critical NOT to use any styles other than those provided by this template.",
      "ja": "このテンプレートによって提供されたもの以外の任意のスタイルを使用することが重要ではないことに注意してください。"
    },
    {
      "indent": 3,
      "text": "o Redefined internal styles for general use:",
      "ja": "O一般的な使用のための内部のスタイルを再定義："
    },
    {
      "indent": 6,
      "text": "Normal, Heading1-9, Caption, Header, Footer:",
      "ja": "通常、Heading1-9、キャプション、ヘッダー、フッター："
    },
    {
      "indent": 9,
      "text": "Use in the normal fashion. Tabs can be used as desired.",
      "ja": "通常の方法で使用してください。所望に応じてタブを使用することができます。"
    },
    {
      "indent": 3,
      "text": "o New styles:",
      "ja": "新しいスタイルO："
    },
    {
      "indent": 6,
      "text": "RFC Title:",
      "ja": "RFCタイトル："
    },
    {
      "indent": 9,
      "text": "For the document title only.",
      "ja": "文書のタイトルの場合のみ。"
    },
    {
      "indent": 6,
      "text": "RFC Figure:",
      "ja": "RFCの図："
    },
    {
      "indent": 9,
      "text": "For ASCII-art figures. Single spaced, kept together.",
      "ja": "アスキーアートの数字のために。シングルスペースは、一緒に続けました。"
    },
    {
      "indent": 6,
      "text": "RFC List Bullet:",
      "ja": "RFCリスト弾丸："
    },
    {
      "indent": 9,
      "text": "For bulleted lists.",
      "ja": "箇条書きのために。"
    },
    {
      "indent": 6,
      "text": "RFC List Numbered:",
      "ja": "RFCリストは番号："
    },
    {
      "indent": 9,
      "text": "For numbered lists. Use 'restart numbering' as desired for new list sequences.",
      "ja": "番号付きリストのため。新しいリストシーケンスのために、必要に応じて「再起動番号」を使用してください。"
    },
    {
      "indent": 6,
      "text": "RFC References:",
      "ja": "RFC参考資料："
    },
    {
      "indent": 9,
      "text": "For normative and informative references. Do not restart numbering for informative references.",
      "ja": "規範的かつ有益参照ください。有益な参照のために番号付け再起動しないでください。"
    },
    {
      "indent": 9,
      "text": "NOTE: references can use an alternate unnumbered style that relies on use of Word's bookmark feature to set cross-reference tags.",
      "ja": "注：参照が相互参照タグを設定するにはWordのブックマーク機能の使用に依存している別のアンナンバードスタイルを使用することができます。"
    },
    {
      "indent": 6,
      "text": "RFC App:",
      "ja": "RFCアプリケーション："
    },
    {
      "indent": 9,
      "text": "For appendix titles, using \"Appendix A.\" format. Starts at the top of a new page. If appendices are used, start the references (after appendices) at the top of a new page (insert 'page break').",
      "ja": "「付録A」を使用して、付録のタイトルについては、フォーマット。新しいページの先頭に開始します。付録が使用されている場合は、新しいページ（挿入「改ページ」）の上部にある（付録の後）の参照を開始します。"
    },
    {
      "indent": 6,
      "text": "RFC App H1-5:",
      "ja": "RFCアプリケーションH1-5："
    },
    {
      "indent": 9,
      "text": "For appendix headings (\"A.1.\" format).",
      "ja": "付録の見出し（ \"A.1。\" フォーマット）の場合。"
    },
    {
      "indent": 9,
      "text": "NOTE: these headings will NOT auto-renumber when promoted/demoted in outline mode.",
      "ja": "注：アウトラインモードで降格/昇格時にこれらの見出しは、自動再番号付けしません。"
    },
    {
      "indent": 3,
      "text": "o Redefined internal styles not generally accessed by users:",
      "ja": "O一般ユーザーがアクセスしていない内部のスタイルを再定義："
    },
    {
      "indent": 6,
      "text": "TOC1-9:",
      "ja": "TO1目："
    },
    {
      "indent": 9,
      "text": "For table of contents entries.",
      "ja": "内容エントリのテーブルのために。"
    },
    {
      "indent": 6,
      "text": "RFC Instructions:",
      "ja": "RFC手順："
    },
    {
      "indent": 9,
      "text": "For instructions to authors. These notes must be deleted.",
      "ja": "作者への指示については。これらのノートは削除する必要があります。"
    },
    {
      "indent": 6,
      "text": "RFC H1 - no num:",
      "ja": "RFC H1  - いいえNUM："
    },
    {
      "indent": 9,
      "text": "For unnumbered headings in end boilerplate text.",
      "ja": "エンド定型テキストで番号無し見出しのため。"
    },
    {
      "indent": 6,
      "text": "RFC H1 - no TOC no num:",
      "ja": "RFC H1  - なしなしTOC番号："
    },
    {
      "indent": 9,
      "text": "For unnumbered, unlisted (in TOC) headings in front boilerplate text.",
      "ja": "フロント定型テキストで番号なし、非上場（TOC）で見出してください。"
    },
    {
      "indent": 0,
      "text": "2.3. Saving the File",
      "section_title": true,
      "ja": "2.3. ファイルの保存"
    },
    {
      "indent": 3,
      "text": "The template is provided as a Word 97-2003 \".dot\" template; Word 2007 uses an XML-based variant called \".dotx\". Word 2007 can use \".dot\" templates in \"Compatibility Mode\". If the file is saved in that mode, it has a \".doc\" suffix; if saved in native Word 2007 mode, it has a \".docx\" format. It does not matter which saved file format is used.",
      "ja": "テンプレートはWordの97-2003「の.dot」のテンプレートとして提供されます。 Word 2007が「.dotx」と呼ばれるXMLベースのバリアントを使用しています。 Word 2007が 『互換モード』の「の.dot」テンプレートを使用することができます。ファイルは、そのモードで保存されている場合、それは「.DOC」接尾辞を持っています。ネイティブWord 2007のモードで保存されている場合、それは「.docxの」形式を持っています。ファイル形式が使用されて保存されている問題ではありません。"
    },
    {
      "indent": 0,
      "text": "2.4. Generating Output",
      "section_title": true,
      "ja": "2.4. 生成出力"
    },
    {
      "indent": 3,
      "text": "This template supports printing similar output both to regular printers (8.5 x 11 inch paper) and as Internet-Draft/RFC-compatible text files. Printing to a printer is designed for Windows XP and Vista and may work with earlier versions of Windows; it has not been tested with other OS's. The template is currently in a Word 97-2003 format (.dot); this can be used in \"Compatibility Mode\" in Word 2007.",
      "ja": "このテンプレートは、両方の通常のプリンタ（8.5×11インチの紙）へとインターネットドラフト/ RFC互換のテキストファイルとして印刷と同様の出力をサポートしています。プリンタへの印刷は、Windows XPおよびVista用に設計されており、Windowsの以前のバージョンでも動作します。それは他のOSでテストされていません。テンプレートは、Word 97-2003形式（.DOT）に現在あります。これは、Word 2007で「互換モード」で使用することができます。"
    },
    {
      "indent": 3,
      "text": "Printing to text is supported only for Windows at this time. There is no current support for XML. Details are provided as follows.",
      "ja": "テキストへの印刷は、現時点ではWindowsのみでサポートされています。 XMLには、現在サポートされていません。次のように詳細が提供されています。"
    },
    {
      "indent": 0,
      "text": "2.4.1. Printing Direct to a Printer",
      "section_title": true,
      "ja": "2.4.1. プリンタへの直接印刷"
    },
    {
      "indent": 3,
      "text": "The template produces output direct to a printer that is line-for-line, page-for-page identical with the text-only version, with a few minor exceptions:",
      "ja": "テンプレートは、ページのためのページいくつかのマイナーな例外を除いて、テキストのみのバージョンと同じラインのためのラインであるプリンタへの直接出力を生成します："
    },
    {
      "indent": 3,
      "text": "o Single and double quotes may be angled (left quote, right quote), rather than straight, depending on whether 'smart quotes' are enabled in Tools->Autocorrect options.",
      "ja": "Oシングルと二重引用符は、「スマート引用符」が[ツール]  - > [オートコレクトのオプションで有効になっているかどうかに応じて、むしろストレートよりも、（左引用符、右引用符）角度を付けることができます。"
    },
    {
      "indent": 3,
      "text": "o Hyphens may print as an em dash or en dash, depending on whether 'smart hyphens' are enabled in Tools->Autocorrect options.",
      "ja": "Oハイフンは「スマートハイフン」の[ツール]  - > [オートコレクトのオプションで有効になっているかどうかに応じて、全角ダッシュとダッシュエン印刷することができます。"
    },
    {
      "indent": 0,
      "text": "2.4.2. Printing the Text File",
      "section_title": true,
      "ja": "2.4.2. テキストファイルの印刷"
    },
    {
      "indent": 3,
      "text": "Printing to an ASCII text file is currently known to work only on Windows-XP and Windows-Vista PCs; appropriate ASCII-output drivers for MacOS or Unix boxes running OpenOffice are not currently known.",
      "ja": "ASCIIテキストファイルへの印刷は、現在唯一のWindows XPおよびWindows Vistaでは、PC上で動作することが知られています。 OpenOfficeのを実行しているのMacOSやUnixのボックスに適切なASCII出力ドライバは、現在知られていません。"
    },
    {
      "indent": 3,
      "text": "To generate .txt output on a Windows-XP or Windows Vista PC, use a two-step process. First, generate a .prn file by printing the document to a text-only printer. Second, apply post-processing to clean up the text and apply 'new page' characters.",
      "ja": "Windows-XPまたはWindows Vista PC上で.txtの出力を生成するには、2段階のプロセスを使用します。まず、テキストのみのプリンタにドキュメントを印刷して.PRNファイルを生成します。第二に、テキストをクリーンアップし、「新しいページ」文字を適用するために後処理を適用します。"
    },
    {
      "indent": 3,
      "text": "Install the \"Generic/Text Only\" printer, as found under \"Generic\" in the available print drivers list. Configure the printer to save to a file or click 'save to file' when printing. A printed file will have a .prn file suffix.",
      "ja": "使用可能な印刷ドライバのリストで「一般」の下に見られるように、「汎用/テキストのみの」プリンタをインストールします。ファイルに保存したり、印刷するときに「ファイルに保存」をクリックするプリンタを設定します。印刷されたファイルは、.PRNファイル拡張子を持つことになります。"
    },
    {
      "indent": 3,
      "text": "The printed output needs to be run through a post-processor to generate valid Internet-Draft or RFC formatted text. Run the .prn file through the post-processing as described in Appendix B. This performs the following operations:",
      "ja": "印刷出力は、有効なインターネットドラフトやRFCフォーマットされたテキストを生成するために、ポストプロセッサを介して実行する必要があります。付録Bに記載されているようにこれは以下の動作を行う後処理を通して.PRNファイルを実行します。"
    },
    {
      "indent": 3,
      "text": "o Omits <CR>s (converts <CR><LF> to <LF> and omits bare <CR>s).",
      "ja": "O省略<CR> S（<CR> <LF>を変換<LF>および<CR> S裸省略）。"
    },
    {
      "indent": 3,
      "text": "o Converts smart quotes and hyphens to their ASCII counterparts.",
      "ja": "oは彼らのASCIIの対応にスマート引用符とハイフンに変換します。"
    },
    {
      "indent": 3,
      "text": "o Omits blank lines between the footer of one page and the header of the next, and inserts a <CTL-L> (form-feed) between the two.",
      "ja": "Oは、1ページのフッタと次のヘッダとの間の空白行を省略し、両者の間に<CTL-L>（フォームフィード）を挿入します。"
    },
    {
      "indent": 3,
      "text": "o Checks for remaining illegal characters (not printable ASCII, CR, LF), as required.",
      "ja": "必要に応じて、（ない印刷可能なASCII、CR、LF）不正な文字を残りのためのOチェック。"
    },
    {
      "indent": 0,
      "text": "2.4.3. XML Support",
      "section_title": true,
      "ja": "2.4.3.  XMLのサポート"
    },
    {
      "indent": 3,
      "text": "There is no current support for XML in this template. Although Word 2003 provides XML support, its use is counterintuitive to most Word users. XML fields are edited using a separate database editor, rather than in the native Word input screen. Future support for XML is being considered for a future revision of this template.",
      "ja": "このテンプレートでのXMLのための現在のサポートはありません。 Word 2003のは、XMLのサポートを提供していますが、その使用は、ほとんどのWordのユーザーに直感に反します。 XMLフィールドはむしろネイティブワード入力画面よりも、別のデータベース・エディタを使用して編集されています。 XMLの今後のサポートは、このテンプレートの今後の改訂のために検討されています。"
    },
    {
      "indent": 1,
      "text": "3. Changes from",
      "section_title": true,
      "ja": "3.変更から"
    },
    {
      "indent": 3,
      "text": "This document and the \".dot\" template borrow heavily from RFC 3285 [6]. Notably, all specifics of point sizes, tab locations, and the automatic date fields are directly from that template. This document builds on that information as follows.",
      "ja": "このドキュメントおよび「.DOT」テンプレートは、RFC 3285 [6]から多額の借り入れ。特に、ポイントサイズ、タブ位置、および自動日付フィールドのすべての詳細は、そのテンプレートから直接です。次のようにこの文書では、その情報に基づいています。"
    },
    {
      "indent": 0,
      "text": "3.1. Heading Styles",
      "section_title": true,
      "ja": "3.1. 見出しスタイル"
    },
    {
      "indent": 3,
      "text": "This document redefines Normal, Heading1-9, Header, Footer, and Caption, rather than defining new RFC-named styles as in RFC 3285. The use of internal style names is required for proper operation of outline mode, notably when promoting/demoting sections of text with subsequent renumbering of headings therein.",
      "ja": "この文書では、特に促進/降格のセクションではなく、内部のスタイル名の使用がアウトラインモードの適切な動作のために必要とされるRFC 3285.のように新しいRFC-という名前のスタイルを定義するよりも、通常、Heading1-9、ヘッダー、フッター、およびキャプションを再定義しますその中の見出しの後続のリナンバリングのテキストの。"
    },
    {
      "indent": 3,
      "text": "Note that this use of redefined standard styles is the common practice, both in Microsoft-supplied templates as well as templates from the IEEE and ACM, among others.",
      "ja": "とりわけ、マイクロソフトが提供するテンプレートならびにIEEEとACMからのテンプレートの両方、再定義の標準スタイルのこの使用が一般的であることに注意してください。"
    },
    {
      "indent": 3,
      "text": "Additional heading styles RFC App and RFC App H1-9 were added to support alternate numbering used in appendices, although these styles exhibit the previous deficiency of custom styles in outline mode (will not auto-renumber on promote/demote).",
      "ja": "これらのスタイルは、アウトラインモードでのカスタムスタイルの以前の欠乏を（/降格を推進する上で自動再番号付けません）を示すが、追加の見出しスタイルRFCアプリケーションおよびRFCのApp H1-9は、付録に使用される代替番号をサポートするために追加されました。"
    },
    {
      "indent": 0,
      "text": "3.2. References Style",
      "section_title": true,
      "ja": "3.2. 参考文献スタイル"
    },
    {
      "indent": 3,
      "text": "There are two different reference styles -- RFC References, and RFC References Bookmark. The former cross-references using numbers (e.g., [1]); the latter uses Word's bookmarking cross-reference features to support name/year cross-references (e.g., [Tou2005]). The latter is expected to be the preferred format for future I-Ds and RFCs.",
      "ja": "2つのがあり異なる基準スタイルです -  RFCの参考文献は、およびRFCはブックマークを参照します。数字（例えば、[1]）を使用して、前者の相互参照。後者は、名前/年の相互参照をサポートするために、Wordのブックマーク相互参照機能を使用して（例えば、[Tou2005]）。後者は、将来のI-DSおよびRFCのための好ましい形式であると予想されます。"
    },
    {
      "indent": 3,
      "text": "RFC References is a body text paragraph style that autonumbers based on the \"[1]\" format. Again, it is common practice, both among Microsoft-supplied templates as well as templates from the IEEE and ACM, to use autonumbered paragraphs in the body text for references. This differs from RFC 3285, in which references were inserted as endnotes, rather than as main body text.",
      "ja": "RFC参照は、「[1]」のフォーマットに基づいてautonumbers本文テキストの段落スタイルです。ここでも、それは参照のため本文にautonumbered段落を使用するために、マイクロソフトが提供するテンプレートの中だけでなく、IEEEとACMからのテンプレートの両方、一般的に行われています。これは、参照が文末としてではなく、本体テキストとして挿入されたRFC 3285とは異なります。"
    },
    {
      "indent": 3,
      "text": "Putting references in endnotes has unexpected behavior. In particular, the reference is defined by its first use as a citation and is cross-referenced by subsequent citations. Removing the first citation removes the reference entirely, despite other cross-references. This is not the case with body text autonumbered paragraphs, which persist regardless of which cross-references are deleted.",
      "ja": "文末に参照を置くことは、予期しない動作があります。具体的には、参照は引用としてその最初の使用によって定義され、それに続く引用によって相互参照されます。最初の引用を削除すると、他のクロスリファレンスにもかかわらず、全体の参照を除去します。これは関係なく、相互参照が削除されるの持続本文autonumbered段落、とそうではありません。"
    },
    {
      "indent": 3,
      "text": "Note that Word does not provide a way to ensure that all RFC Reference paragraphs are cross-referenced, i.e., users can insert references that are not cited. This can be desired, however, e.g., for bibliographies of supplemental material.",
      "ja": "WordはすべてRFC参照段落が相互参照されていることを確認する方法を提供しないことに注意してください、すなわち、ユーザーが引用されていない参照を挿入することができます。これは、補足資料の参考文献のために、しかし、例えば、所望され得ます。"
    },
    {
      "indent": 3,
      "text": "RFC References Bookmark is a body text paragraph style that does not use autonumbering. Currently, authors are expected to manually format their references using name-based tags between square brackets (\"[]\"). There is no required format, but a suggested format would use the first three letters of the first author, together with the four numbers of the document year, e.g., for this document's reference \"[2]\", the reference would now appear as:",
      "ja": "RFCは、ブックマークは自動番号を使用していない本文テキストの段落スタイルで参照します。現在、筆者は手動で角括弧（「[]」）の間で名前ベースのタグを使用して参照をフォーマットすることが期待されています。 「[2]」、参照が今のように表示されます。そこには必要な形式はありませんが、推奨される形式は、このドキュメントの参照のために、例えば、一緒にドキュメント年の4つの数字で、最初の著者の最初の3つの文字を使用します。"
    },
    {
      "indent": 3,
      "text": "[Bra2004] Bradner, S., \"IETF Rights...\"",
      "ja": "[Bra2004]ブラドナーの、S.、 \"IETFの権利...\""
    },
    {
      "indent": 3,
      "text": "The author is expected to select the text of the reference \"[Bra2004]\" and insert a bookmark at that point with whatever name is convenient for the author. It can then be cited as usual as a cross-reference to the bookmark: [Bra2004]. Note that Word bookmark names must start with a letter, and may include numbers but not spaces.",
      "ja": "著者は、「[Bra2004]」参照のテキストを選択し、任意の名前で、その時点でブックマークを挿入することが期待されている著者のために便利です。その後、ブックマークへのクロスリファレンスとして通常通り挙げることができる：[Bra2004]。 Wordのブックマーク名は文字で始まる必要があり、数字ではなく、スペースを含むことができることに注意してください。"
    },
    {
      "indent": 3,
      "text": "When two references collide, e.g., for two papers written by Bradner in 2004, a trailing lowercase letter should be used to distinguish them, e.g., [Bra2004a] and [Bra2004b].",
      "ja": "2つの参照が衝突するとき、例えば、2004年のブラドナーによって書かれた2つの論文のために、後続の小文字は、[Bra2004b] [Bra2004a]、例えば、それらを区別するために使用されるべきです。"
    },
    {
      "indent": 0,
      "text": "3.3. Boilerplate",
      "section_title": true,
      "ja": "3.3. ボイラープレート"
    },
    {
      "indent": 3,
      "text": "The boilerplate in this template was updated to conform with current RFC Editor requirements, notably BCP 78 rights statements, as well as pending guidelines for Internet Draft and RFC authors [2][3][5].",
      "ja": "このテンプレートでは、定型は、現在のRFC Editorの要件、特にBCP 78の権利文だけでなく、インターネットドラフトの保留中のガイドラインとRFCの作者に準拠するように更新されました[2] [3] [5]。"
    },
    {
      "indent": 3,
      "text": "The boilerplate is written in regular text, and can be easily edited by authors to keep the template up-to-date as BCP 78 is revised.",
      "ja": "定型は、通常のテキストで書かれている、と簡単にBCP 78が改訂されるように最新のテンプレートを維持するために、著者によって編集することができます。"
    },
    {
      "indent": 0,
      "text": "3.4. Simplification",
      "section_title": true,
      "ja": "3.4. 簡素化"
    },
    {
      "indent": 3,
      "text": "Headers and footers use more conventional tabbing to control formatting, rather than tables.",
      "ja": "ヘッダーとフッターではなく、テーブルよりも、書式設定を制御するための多くの従来のタブ移動を使用しています。"
    },
    {
      "indent": 3,
      "text": "Users no longer need to avoid the use of smart quotes or hyphens; these are automatically translated to RFC-compliant ASCII characters during post-processing.",
      "ja": "ユーザーはもはやスマート引用符やハイフンの使用を避ける必要がありません。これらは自動的に後処理中にRFC準拠のASCII文字に変換されます。"
    },
    {
      "indent": 3,
      "text": "A number of styles include grouping configuration, designed to provide more readable output. In particular, all headings are \"keep with next\" to avoid widowed heading lines, and all list items, references, and figure lines are \"keep together\" to avoid inadvertent splitting across page boundaries.",
      "ja": "スタイルの数は、より読みやすい出力を提供するために設計されたグループの構成が含まれます。具体的には、すべての見出しは、ページの境界を越えて、不注意による分裂を避けるために、「一緒に保つ」されている未亡人の見出し行を避けるために、「次を保つ」、およびすべてのリスト項目、参照、フィギュア線です。"
    },
    {
      "indent": 0,
      "text": "3.5. Ability to Direct Print and Direct View",
      "section_title": true,
      "ja": "3.5. ダイレクトプリントと直接表示する機能"
    },
    {
      "indent": 3,
      "text": "This template can print directly to a printer, generating output that is line-for-line, page-for-page identical with the compliant ASCII text output, excepting minor formatting of hyphens and quotes.",
      "ja": "このテンプレートは、ハイフンおよび引用符のマイナーフォーマットを除いて、ラインのためのライン、ページ用ページ準拠したASCIIテキスト出力と同一である出力を生成、プリンタに直接印刷することができます。"
    },
    {
      "indent": 3,
      "text": "Further, this template can be previewed in File->Print Preview or View->Print Layout, again generating screen images that are line-for-line, page-for-page identical with the compliant ASCII text output. This allows true WYSIWYG (what-you-see-is-what-you-get) editing and printing.",
      "ja": "さらに、このテンプレートは、再びラインのためのライン、ページ用ページ準拠したASCIIテキスト出力と同一である画面イメージを生成し、[ファイル]  - > [印刷プレビュー]または[表示]  - > [印刷レイアウトでプレビューすることができます。これが真WYSIWYG（何であるか - あなたは、見- - あなたは、何を得る - ）編集および印刷することができます。"
    },
    {
      "indent": 0,
      "text": "4. Compatibility Issues",
      "section_title": true,
      "ja": "4.互換性の問題"
    },
    {
      "indent": 3,
      "text": "There are no known compatibility issues at this time. This version of the template was designed under Windows XP and Word 2002, and has also been tested under Windows Vista and Word 2007. It is not yet known whether previous versions of Windows/Word are supported using this template.",
      "ja": "現時点では、既知の互換性の問題がありません。テンプレートのこのバージョンは、Windows XPおよびWord 2002の下に設計された、およびWindows /以前のバージョンのWordは、このテンプレートを使用してサポートされているかどうかもWindows VistaとWordのそれはまだ知られていない2007年の下でテストされています。"
    },
    {
      "indent": 3,
      "text": "As noted in Sec. 3.1, this template redefines predefined styles, which is common practice.",
      "ja": "節で述べたように。 3.1は、このテンプレートは、一般的に行われている定義済みのスタイルを、再定義します。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "There are many security issues in the general use of Microsoft operating systems and applications. This template is not known to expose any new security issues; it contains no macros as developed and deployed. The author considered including the MD5 signatures of the current versions of the .dot template and .pl post-processor files. The current processor .pl file is included in this document as an appendix. The .dot file is updated to track the current requirements of the IETF boilerplate, so its MD5 signature cannot be included here, but is posted on our website for verification.",
      "ja": "マイクロソフトのオペレーティングシステムやアプリケーションの一般的な使用には多くのセキュリティ上の問題があります。このテンプレートは、どんな新しいセキュリティ問題を公開することが知られていません。開発および展開として、それにはマクロが含まれていません。著者は.DOTテンプレートと.plのポストプロセッサフ​​ァイルの現在のバージョンのMD5シグネチャを含め検討しました。付録として、この文書に含まれているの.plファイルを現在のプロセッサ。 .DOTファイルは、そのMD5署名はここに含めることはできませんので、IETF定型の電流要件を追跡するために更新されますが、検証のために、当社のウェブサイトに掲載されています。"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgments",
      "section_title": true,
      "ja": "6.謝辞"
    },
    {
      "indent": 3,
      "text": "The author acknowledges the substantial efforts of the authors of the previous version of the Word template, Mike Gahrns and Tony Hain [6]. This document is intended to build upon their work. Thanks also to Lars-Erik Jonsson for feedback on this template and post-processor script, as well as suggestions on making it more generic to support earlier versions of Windows, and to Jixiong Dong for finding an obscure bug in the formatting.",
      "ja": "著者は、Wordテンプレートの以前のバージョンの著者の実質的な成果を認める、マイクGahrnsとトニー・ハイン[6]。この文書は、自分の仕事の上に構築することを意図しています。このテンプレートとポストプロセッサのスクリプトと同様に、それはより一般的なWindowsの以前のバージョンをサポートすることについての提案に関するフィードバックのためのラース・エリックジョンソンにも感謝し、フォーマットにあいまいなバグを見つけるためのJixiong東へ。"
    },
    {
      "indent": 3,
      "text": "This document was prepared using 2-Word-v2.0.template.dot.",
      "ja": "この文書は2-Word-v2.0.template.dotを用いて調製しました。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Template Configuration Details",
      "ja": "付録A.テンプレートの設定の詳細"
    },
    {
      "indent": 3,
      "text": "The Word 97-2003 \".dot\" template, compatible with Word 2007, consists of a set of default configuration settings, a set of modified and newly-defined styles, and an initial template of text. This section in particular assumes familiarity with Microsoft Word configuration and modification of styles. Note that use of the template does not require understanding this section; this merely documents the settings already in the \".dot\" file.",
      "ja": "Word 2007のと互換性のWord 97-2003「の.dot」テンプレートは、デフォルトの構成設定のセット、修正と新たに定義されたスタイルのセット、およびテキストの初期テンプレートで構成されています。特にここでは、Microsoft Wordの構成やスタイルの変更に精通を想定しています。テンプレートの使用は、このセクションを理解する必要はありません。これは単に「の.dot」ファイル内に既に設定について説明します。"
    },
    {
      "indent": 0,
      "text": "A.1. Configure Styles",
      "ja": "A.1。スタイルを設定します"
    },
    {
      "indent": 3,
      "text": "Modify paragraph styles as indicated. In general use, only the redefined existing styles Normal, Heading1-9, Header, Footer, and Caption, and new styles RFC Figure, RFC References, RFC List Bullet, RFC List Numbered, RFC App, and RFC App H1-5 need be used by authors.",
      "ja": "示されるように、段落スタイルを変更します。一般的な使用では、唯一の再定義既存のスタイル通常、Heading1-9、ヘッダー、フッター、およびキャプション、および新しいスタイルRFC図、RFC参照、RFC一覧弾丸は、RFCリストは、番号、RFCアプリケーション、およびRFCのApp H1-5は、である必要著者が使用します。"
    },
    {
      "indent": 3,
      "text": "Other styles, such as redefined TOC1-9, RFC Hidden, RFC H1 - no num, and RFC H1 - no TOC no num are used by the template, but are typically hidden in the styles list, and need not be explicitly applied by authors.",
      "ja": "いいえNUM、およびRFC H1  -   - このように再定義TOC1-9、RFC隠し、RFC H1などの他のスタイル、いいえTOCいいえnumがテンプレートで使用されているが、一般的なスタイルのリストに隠されている、と明示的に著者によって適用する必要はありません。"
    },
    {
      "indent": 3,
      "text": "All measurement units below are in points. Change measurement units to points to set.",
      "ja": "以下のすべての測定単位はポイントです。設定するにはポイントに測定単位を変更します。"
    },
    {
      "indent": 0,
      "text": "A.1.1. Redefine Existing Styles",
      "ja": "A.1.1。既存のスタイルを再定義"
    },
    {
      "indent": 3,
      "text": "Redefine the Normal style first; all others are based on Normal, except as noted.",
      "ja": "最初の標準スタイルを再定義。他のすべてが注目されている場合を除き、通常に基づいています。"
    },
    {
      "indent": 3,
      "text": "1. Normal: font Courier New, font size 12 point, next style Normal, line spacing EXACTLY 12 point, spacing before 0 pt, spacing after 12 pt, indent left 21.6 pts, widow/orphan control, left tabs at every 3 spaces (1 space = 7.2 points, given 72 points/inch and 10 characters/inch): 21.6, 43.2, 64.8, 86.4, 108, 129.6, 151.2,172.8, 194.4, 216, 237.6, 259.2, 280.8, 302.4, 324, 345.6,367.2, 388.8, 410.4, 432, 453.6, 475.2, 496.8.",
      "ja": "1.通常：フォントのCourier新しい、フォントサイズ12ポイント、EXACTLY 12ポイントの間隔次のスタイルノーマル、行、0 ptの前にスペース、12ポイントの後の間隔、インデントは、（すべての3つのスペースで21.6 PTS、寡婦/オーファンコントロール、左のタブを左に1つのスペース= 7.2点、所与72ポイント/インチ及び10文字/インチ）：21.6、43.2、64.8、86.4、108、129.6、151.2,172.8、194.4、216、237.6、259.2、280.8、302.4、324、345.6、 367.2、388.8、410.4、432、453.6、475.2、496.8。"
    },
    {
      "indent": 6,
      "text": "NOTE: 12 point fonts are 12 points tall, i.e., 6 lines/inch vertically; 12-point Courier is 10 characters/inch horizontally.",
      "ja": "注：12ポイントフォントが12ポイント背が高い、すなわち、6行/インチ上下。 12ポイントのクーリエは、水平方向に10文字/インチです。"
    },
    {
      "indent": 3,
      "text": "2. Heading 1-9: Normal + indent left 0 pt, hanging 21.6 pts, keep with next, set autonumbering as \"1. \", \"1.1. \", \"1.1.1. \", etc. Note the space after the right-most period; type this in the",
      "ja": "2. 1-9見出し：ノーマル+インデントは、「1」、「1.1」として次の設定自動番号を保つ、21.6 PTSをぶら下げ、0 PTを左、右等の後のスペースに注意してください「1.1.1。」 - ほとんどの期間;でこれを入力します"
    },
    {
      "indent": 6,
      "text": "\"number format\" field, and leave the \"follow number with\" field as 'nothing' (click on the 'more' button to see this field if it is not already visible).",
      "ja": "「番号形式」フィールド、およびまま「何もない」などのフィールド「と番号をたどる」（表示されていない場合、このフィールドを参照するために「もっと」ボタンをクリックしてください）。"
    },
    {
      "indent": 6,
      "text": "NOTE: change the autonumbering ONCE and in ONE format; in that format, change all subsequent levels.",
      "ja": "注：ONCEとONE形式で自動番号を変更します。その形式で、後続のすべてのレベルを変更します。"
    },
    {
      "indent": 3,
      "text": "3. TOC 1-9: Normal + paragraph flush, clear tabs, add new Right tab at 504 pts that includes a \"...\" leader. Add indent left as follows: TOC 1: 21.6, TOC 2: 43.2, TOC 3: 64.8, TOC 4: 86.4, TOC 5: 108, TOC 6: 129.6, TOC 7: 151.2, TOC 8: 172.8, TOC 9: 194.4.",
      "ja": "3. TOC 1-9：ノーマル+段落フラッシュ、明確なタブは、「...」リーダーを含み504のPTSで新しい右のタブを追加します。次のように左インデントを追加：TOC 1：21.6、TOC 2：43.2、TOC 3：64.8、TOC 4：86.4、TOC 5：108、TOC 6：129.6、TOC 7：151.2、TOC 8：172.8、TOC 9：194.4 。"
    },
    {
      "indent": 3,
      "text": "4. Header: Normal + space after 0 pts, next style Header, clear tabs, and add centered tab at 252 pts, tab right at 504 pts.",
      "ja": "4.ヘッダー：0 PTS後のノーマル+スペース、次のスタイルのヘッダー、明確なタブ、および252のPTS、504のPTSのタブの右側を中心とタブを追加します。"
    },
    {
      "indent": 3,
      "text": "5. Footer: Header + next style Footer.",
      "section_title": true,
      "ja": "5.フッター：ヘッダー+次のスタイルのフッター。"
    },
    {
      "indent": 3,
      "text": "6. Caption: Normal + centered, autonumbered \"Figure #\".",
      "section_title": true,
      "ja": "6.キャプション：ノーマル+が中心は、 \"図の＃を\" autonumbered。"
    },
    {
      "indent": 0,
      "text": "A.1.2. Add New Styles",
      "ja": "A.1.2。新しいスタイルを追加します。"
    },
    {
      "indent": 3,
      "text": "NOTE: \"keep lines together\" is optional for lists and references; it helps avoid breaking individual items across pages.",
      "ja": "注：リストおよび参照のためのオプションである「一緒にラインを保ちます」。それは、ページ間で、個々のアイテムを壊す避けることができます。"
    },
    {
      "indent": 3,
      "text": "1. RFC Figure: Normal + space after 0 pts, keep with next, keep lines together, next style RFC figure (also used for authors' addresses).",
      "ja": "1. RFC図：0 PTS後のノーマル+スペース、一緒にラインを保つため、次に保つには、次のスタイルのRFCの図は、（また、著者のアドレスに使用します）。"
    },
    {
      "indent": 3,
      "text": "2. RFC List Bullet: Normal + custom bulleted, \"o\" bullet style, aligned at 21.6 pts, bullet tab after 43.2 pts, bullet indent at 43.2 pts, next style RFC List Bullet, keep lines together.",
      "ja": "2. RFCリスト弾丸：ノーマル+カスタム、一緒にラインを保つ21.6 PTS、43.2 PTS後の弾丸タブ、43.2 PTSでの弾丸のインデント、次のスタイルRFCの一覧箇条書きに整列、箇条書きスタイル「O」、箇条書き。"
    },
    {
      "indent": 3,
      "text": "3. RFC List Numbered: Normal + custom numbered, \"1. \" number format, aligned at 21.6 pts, bullet tab after 43.2 pts, bullet indent at 43.2 pts, next style RFC List Numbered, keep lines together.",
      "ja": "3. RFCリストは番号：ノーマル+カスタムは、番号、21.6 PTS、43.2 PTS後の弾丸タブ、43.2 PTS、番号付き次のスタイルのRFCリストで箇条書きのインデント、で並んで「1」番号の形式は、一緒にラインをキープ。"
    },
    {
      "indent": 3,
      "text": "4. RFC References: Normal + hanging 43.2 pts, outline level body text, remove tabs at 21.6 and 43.2 pts, custom numbering with format \"[1]\", numbering left aligned 21.6 pts, number tab space after at 64.8 pts, number text indent at 64.8 pts, next style RFC References, keep lines together (used for both normative and informative references).",
      "ja": "4. RFCの参考文献：ノーマル+ 43.2 PTS、アウトラインレベルの本文テキスト、64.8 PTSで、番号テキストの後にカスタム形式で番号付け、21.6および43.2 PTSで「[1]」、左の整列21.6 PTSの番号、番号タブのスペースをタブを削除をぶら下げ64.8 PTS、次のスタイルのRFCの参照でインデントは、（規範的で有益両方の参照に使用）一緒にラインをキープ。"
    },
    {
      "indent": 3,
      "text": "5. RFC References Bookmark: Normal + hanging 72 pts, no num, remove tabs less than 72 pts, keep lines together (used for both normative and informative references).",
      "ja": "5. RFCは、ブックマークを参照します：72のPTSをぶら下げノーマル+、無numが、（規範的で有益両方の参照に使用）一緒にラインを保つため、72の未満PTSのタブを削除します。"
    },
    {
      "indent": 3,
      "text": "6. RFC Title: Normal + space after 24 pts, centered (used for document title).",
      "ja": "6. RFCタイトル：24のPTS後のノーマル+スペース、中心（文書のタイトルのために使用されます）。"
    },
    {
      "indent": 3,
      "text": "7. RFC App: RFC H1 - no num + page break before, custom outline numbered, outline number style \"Appendix A.\", outline level 1, follow number with nothing, outline number at 0 pts, outline indent text at 0 pts, (used for Appendix titles).",
      "ja": "7. RFCアプリケーション：RFC H1  - 前なしNUM +ページ区切り、カスタムアウトライン番号、アウトライン番号のスタイル「付録A.」、アウトラインレベル1は、0 PTSで何も、アウトライン番号の数に従う、0 PTSでインデントテキストを概説し、 （付録のタイトルのために使用されます）。"
    },
    {
      "indent": 3,
      "text": "8. RFC App H1-5: RFC H1 - no num + paragraph level 2-6, custom outline numbered, outline number style \"A.1.\" - \"A.1.1.1.1.1.\", follow number with nothing, outline number at 0 pts, outline indent text at 0 pts, (link with RFC App at level 2-6), (used for Appendix heading levels).",
      "ja": "8. RFCのApp H1-5：RFC H1  - なしNUM +段落レベル2-6、カスタムアウトライン番号、アウトライン番号のスタイル \"A.1。\" - 「A.1.1.1.1.1」、（付録見出しレベルを使用）、（レベル2-6でRFCアプリケーションとのリンク）、0 PTSでインデントテキストを概説し、0 PTSで何も、アウトライン番号の数に従ってください。"
    },
    {
      "indent": 0,
      "text": "A.1.3. Hidden Styles",
      "ja": "A.1.3。隠されたスタイル"
    },
    {
      "indent": 3,
      "text": "These are used for pre-formatted components or instructions and are configured to be hidden from the list of available styles.",
      "ja": "これらは、事前にフォーマットされたコンポーネントまたは手順のために使用され、使用可能なスタイルのリストから隠されるように構成されています。"
    },
    {
      "indent": 3,
      "text": "1. RFC H1 - no num: Normal + indent left 0 pts, outline Level 1, keep with next (used for base template trailer headers -- Copyright, etc.).",
      "ja": "1. RFC H1  - いいえNUM：ノーマル+インデントは、（ - 著作権などの基本テンプレートトレーラーヘッダに使用）0 PTS、アウトラインレベル1、次を続けるを残しました。"
    },
    {
      "indent": 3,
      "text": "2. RFC H1 - no TOC nonum: Normal + indent left 0 pts, (outline level body text, as with Normal), keep with next (used for base template front matter headers -- Abstract, Status, TOC header, etc.).",
      "ja": "2. RFC H1は - ないTOCのNONUM：ノーマル+はインデントは、とおく（通常と同様に、アウトラインレベルの本文）、0 PTSを残さない（ベーステンプレートフロント物質ヘッダに使用 - 抽象的、ステータス、TOCヘッダ、等）次。"
    },
    {
      "indent": 3,
      "text": "3. RFC Instructions: Normal, character bold. This style is not normally shown and is used for instructions that should be removed before publication.",
      "ja": "3. RFC手順：ノーマル、ボールド文字。このスタイルは、通常は示されておらず、公表前に除去しなければならない命令に使用されます。"
    },
    {
      "indent": 0,
      "text": "A.2. Define Page Layout",
      "ja": "A.2。ページレイアウトの定義"
    },
    {
      "indent": 3,
      "text": "Configure Page Setup as follows:",
      "ja": "次のようにページ設定を設定します。"
    },
    {
      "indent": 3,
      "text": "1. Margins:",
      "section_title": true,
      "ja": "1.マージン："
    },
    {
      "indent": 6,
      "text": "Portrait orientation.",
      "ja": "縦向き。"
    },
    {
      "indent": 9,
      "text": "Top: 72 pts Bottom: 60 pts (72 + 60 +_660 [55 lines] = 792 [11 in]) Left: 36 pts (5 characters at 7.2 pts/char) Right: 57.6 pts (8.5\"-7.2\" = 1.3in = 93.6 pts - 36 for left) Gutter: 0 pts Header: 0 pts Footer: 0 pts",
      "ja": "上部：72のPTS下：60のPTS（72 + 60 + _660 [55行] = 792 [11]）左：36のPTS（/チャー7.2 PTSに5文字）右：57.6 PTS（8.5 \"-7.2\" = 1.3 IN = 93.6 PTS  - 左）ガター36：0 PTSヘッダ：0 PTSフッター：0 PTS"
    },
    {
      "indent": 6,
      "text": "If the error message \"One or more margins are outside the printable area\" appears, select Ignore. This may depend on the printer currently selected.",
      "ja": "「一の以上の余白が印刷可能領域外にある」というエラーメッセージが表示された場合は、無視]を選択します。これは、現在選択されているプリンタに依存してもよいです。"
    },
    {
      "indent": 3,
      "text": "2. Paper size:",
      "section_title": true,
      "ja": "2.用紙サイズ："
    },
    {
      "indent": 6,
      "text": "Paper size \"letter\".",
      "ja": "用紙サイズ「手紙」。"
    },
    {
      "indent": 6,
      "text": "Width: 612 pts Height: 792 pts (55 lines/page + 132 for top and bottom margins)",
      "ja": "幅：612 PTS高さ：792、PTS（上下の余白のために55本/ページ+ 132）"
    },
    {
      "indent": 3,
      "text": "3. Layout:",
      "section_title": true,
      "ja": "3.レイアウト："
    },
    {
      "indent": 6,
      "text": "Different headers and footers on the first page.",
      "ja": "最初のページに異なるヘッダーとフッター。"
    },
    {
      "indent": 6,
      "text": "Header: 72 pts from edge Footer: 60 pts from edge",
      "ja": "ヘッダ：エッジフッターから72のPTS：エッジから60のPTS"
    },
    {
      "indent": 0,
      "text": "A.3. Insert Boilerplate",
      "ja": "A.3。挿入ボイラープレート"
    },
    {
      "indent": 3,
      "text": "See below for definitions of {ACDt}, {ACDy}, {AEM}, {AEY}, {AP}.",
      "ja": "{ACDT}、{ACDy}、{AEM}、{AEY}、{AP}の定義については以下を参照されたいです。"
    },
    {
      "indent": 3,
      "text": "First page header:",
      "ja": "最初のページのヘッダー："
    },
    {
      "indent": 6,
      "text": "{blank line} {blank line} <Working Group Name>{tab}<Initial. Lastname> Internet Draft{tab}<Affiliation> Intended status: <e.g., Informational>{tab}{ACDy} Expires: {AEM}{AEY} {blank line} {blank line}",
      "ja": "{空白行} {空白行} <ワーキンググループ名> {タブ} <初期。姓>インターネットドラフト{タブ} <所属>対象の状態：<例えば、情報> {タブ} {ACDy}は有効期限：{AEM} {AEY} {ブランク行} {ブランク行}"
    },
    {
      "indent": 3,
      "text": "Footer (same on first and subsequent pages):",
      "ja": "フッター（最初のページ以降に同じ）："
    },
    {
      "indent": 6,
      "text": "{blank line} {blank line} {blank line} <Lastname>{tab}Expires: {AEM} {ACDy}, {AEY}{tab}[Page {AP}] {blank line}",
      "ja": "{空白行} {ブランク行} {ブランク行} <姓> {タブ}期限：{AEM} {ACDy}、{AEY} {タブ} [ページ{AP}] {空白行}"
    },
    {
      "indent": 3,
      "text": "The front text and end text are as specified in BCP 78 [2]. For Internet Drafts, the sentence declaring the expiration dates uses automatic fields as needed, as with the headers and footers. Note that some of these fields will not be updated properly until the document has been saved and/or printed.",
      "ja": "BCP 78 [2]で指定されるように、フロントテキストとエンドテキストがあります。必要に応じてインターネットドラフトについては、有効期限を宣言文には、ヘッダーとフッターのように、自動フィールドを使用しています。文書が保存され、および/または印刷されるまで、これらのフィールドの一部が正しく更新されないことに注意してください。"
    },
    {
      "indent": 3,
      "text": "A basic document outline with examples is provided in the Word template to demonstrate the use of automatic fields, including a table of contents.",
      "ja": "例の基本的な文書のアウトラインは、内容のテーブルを含む自動フィールドの使用を実証するWordテンプレートで提供されます。"
    },
    {
      "indent": 0,
      "text": "A.4. Automatic Fields",
      "ja": "A.4。自動フィールド"
    },
    {
      "indent": 3,
      "text": "Most of these are self-explanatory; the expiry month is set 6 months in advance. The expiry year rolls-over (+1), if needed. The expiry day is a copy of the current date.",
      "ja": "これらのほとんどは自明です。有効期限の月は、事前に6ヶ月を設定されています。有効期限年のロールオーバー（+1）、必要に応じて。有効期限日が現在の日付のコピーです。"
    },
    {
      "indent": 3,
      "text": "NOTE: expiry date can generate invalid dates, e.g., April 31, February 30, etc.",
      "ja": "注：有効期限が無効な日付を生成することができ、例えば、4月31日、2月30日、など"
    },
    {
      "indent": 3,
      "text": "o {AEM} means auto expiry month, and is a field code =",
      "ja": "O {AEMは} =自動満了月を意味し、フィールドコードであります"
    },
    {
      "indent": 3,
      "text": " { IF { SAVEDATE \\@ \"M\" \\* MERGEFORMAT } = 1 July { IF { SAVEDATE \\@ \"M\" \\* MERGEFORMAT } = 2 August { IF { SAVEDATE \\@ \"M\" \\* MERGEFORMAT } = 3 September { IF { SAVEDATE \\@ \"M\" \\* MERGEFORMAT } = 4 October { IF { SAVEDATE \\@ \"M\" \\* MERGEFORMAT } = 5 November { IF { SAVEDATE \\@ \"M\" \\* MERGEFORMAT } = 6 December { IF { SAVEDATE \\@ \"M\" \\* MERGEFORMAT } = 7 January { IF { SAVEDATE \\@ \"M\" \\* MERGEFORMAT } = 8 February { IF { SAVEDATE \\@ \"M\" \\* MERGEFORMAT } = 9 March { IF { SAVEDATE \\@ \"M\" \\* MERGEFORMAT } = 10 April { IF { SAVEDATE \\@ \"M\" \\* MERGEFORMAT } = 11 May { IF { SAVEDATE \\@ \"M\" \\* MERGEFORMAT } = 12 June \"Fail\" *\\ MERGEFORMAT } *\\ MERGEFORMAT } *\\ MERGEFORMAT } *\\ MERGEFORMAT } *\\ MERGEFORMAT } *\\ MERGEFORMAT } *\\ MERGEFORMAT } *\\ MERGEFORMAT } *\\ MERGEFORMAT } *\\ MERGEFORMAT } *\\ MERGEFORMAT } *\\ MERGEFORMAT }",
      "ja": "{IF {SAVEDATE \\ \"M\" \\ * MERGEFORMAT} = 7月1日{@ IF {SAVEDATE \\ \"M\" \\ * MERGEFORMAT} = 8月2日{IF @ {SAVEDATE \\ \"M\" \\ * MERGEFORMAT} = 9月3日{IF @ {SAVEDATE \\ \"M\" \\ * MERGEFORMAT @} = 10月4日{IF {SAVEDATE \\ \"M\" \\ * MERGEFORMAT} = 11月5日{IF {SAVEDATE \\ \"M\" \\ * MERGEFORMAT} = 12月6日@ {IF {SAVEDATE @ \\ @ \"M\" \\ * MERGEFORMAT} = 1月7日{IF {SAVEDATE \\ \"M\" \\ * MERGEFORMAT @} = 2月8日{IF {SAVEDATE \\ \"M\" \\ * MERGEFORMAT} = 3月9日{@ IF {SAVEDATE \\ @ \"M\" \\ * MERGEFORMAT}が{IF {SAVEDATE \\ \"M\" \\ * MERGEFORMAT @} = 5月11日{IF {SAVEDATE \\ \"M\" \\ * MERGEFORMAT} = 6月12日 \"失敗\" * \\ MERGEFORMAT @} * 4月10日を= \\ * MERGEFORMAT} \\ * MERGEFORMAT}の\\のMERGEFORMAT} * \\ * MERGEFORMAT} \\ * MERGEFORMAT}の\\ MERGEFORMAT} * \\ * MERGEFORMAT} \\ * MERGEFORMAT}の\\ MERGEFORMAT} * \\ * MERGEFORMAT} \\} MERGEFORMAT"
    },
    {
      "indent": 3,
      "text": "o {ACDt} means auto current date, and is a field code =",
      "ja": "O {ACDTは} =自動現在の日付を意味し、フィールドコードであります"
    },
    {
      "indent": 6,
      "text": "{ SAVEDATE \\@ \"MMMM d, yyyy\" }",
      "ja": "{SAVEDATE \\ @ \"MMMM dを、YYYY\"}"
    },
    {
      "indent": 3,
      "text": "o {ACDy} means auto current day, and is a field code =",
      "ja": "O {ACDyは} =自動現在の日を意味し、そしてフィールドコードであります"
    },
    {
      "indent": 6,
      "text": "{ SAVEDATE \\@ \"d \" }",
      "ja": "{SAVEDATE \\ \"D\" @}"
    },
    {
      "indent": 3,
      "text": "o {AEY} means auto expiry year, and is a field code =",
      "ja": "O {AEYは} =自動満了年意味し、フィールドコードであります"
    },
    {
      "indent": 4,
      "text": " { IF { SAVEDATE \\@ \"M\" \\* MERGEFORMAT } < 7 { SAVEDATE \\@ \"YYYY\" \\* MERGEFORMAT } { IF { SAVEDATE \\@ \"M\" \\* MERGEFORMAT } > 6 { = { SAVEDATE \\@ \"YYYY\" \\* MERGEFORMAT } + 1 \\* MERGEFORMAT } \"FAIL\" \\* MERGEFORMAT \\* MERGEFORMAT } \\* MERGEFORMAT }",
      "ja": "{{SAVEDATE \\ \"M\" \\ * MERGEFORMAT} <7 {SAVEDATE \\ \"YYYY\" \\ * MERGEFORMAT} {@ {SAVEDATE \\ \"M\" \\ * MERGEFORMAT} @ IF> 6 {= {SAVEDATE \\ \"YYYY\" @ IF \\ * MERGEFORMAT} + 1 \\ * MERGEFORMAT} \"FAIL\" \\ * MERGEFORMAT \\ * MERGEFORMAT} \\ * MERGEFORMAT}"
    },
    {
      "indent": 3,
      "text": "o {AP} means auto page, and is a field code =",
      "ja": "O {APは} =自動ページを意味し、フィールドコードであります"
    },
    {
      "indent": 6,
      "text": "{ Page }",
      "ja": "{ページ}"
    },
    {
      "indent": 0,
      "text": "Appendix B. Post-Processor Script (Perl)",
      "ja": "付録B.ポストプロセッサスクリプト（Perlの）"
    },
    {
      "indent": 3,
      "text": "#!/local/bin/perl\n# ------------------------------------------------------------------\n#                          2-Word-post-v2.0\n# Perl post-processor for MS Word RFC/Internet-draft template output\n#\n#                              J. Touch\n#                           touch@isi.edu\n#                      http://www.isi.edu/touch\n#\n#            USC Information Sciences Institute (USC/ISI)\n#               Marina del Rey, California 90292, USA\n#                         Copyright (c) 2004-2009\n#\n# Revision date: May 5, 2009\n# ------------------------------------------------------------------\n#\n# usage:\n#        2-Word-post-v2.0.pl [inputfile.txt] > [outputfile.txt]\n#\n# function:\n#     removes indent on each line (blank print margin, typ. 5 chars)\n#        converts cr/lf to cr\n#     converts 'smart quotes' to regular quotes (single and double)\n#     converts 'smart hyphens' (em dash, en dash) to regular hyphen\n#     omits blank lines between footer and next-page header\n#     inserts formfeed (ff) between footer and next-page header\n#     removes end-of-line whitespace\n#     checks for illegal chars (not printable ASCII, cr, lf, ff)\n#     checks for page lengths exceeded\n#     checks for line lengths exceeded\n#     prints errors indicating page and line on that page\n#\n#        illegal character errors are posted to STDERR\n#\n#        returns the logical OR of codes indicating errors found:\n#                0x00 no error\n#                0x01 if any illegal characters found\n#                0x02 if any page length exceeds $maxpagelen\n#                0x04 if any line length exceeds $maxlinelen\n#\n# ------------------------------------------------------------------",
      "raw": true
    },
    {
      "indent": 3,
      "text": "# ------------------------------------------------------------------\n# VARIABLES\n# ------------------------------------------------------------------",
      "raw": true
    },
    {
      "indent": 3,
      "text": "$pagenum = 1; # start on page 1, not 0",
      "ja": "$ PAGENUM = 1; ＃0、1ページのないスタート"
    },
    {
      "indent": 3,
      "text": "$maxpagelen = 66; # max lines per page",
      "ja": "$ MAXPAGELEN = 66;ページあたり＃最大ライン"
    },
    {
      "indent": 3,
      "text": "$maxlinelen = 72; # max chars per line",
      "ja": "$引数maxlinelen = 72;行あたりの最大＃文字"
    },
    {
      "indent": 3,
      "text": " # specific error codes %codes = ( 'none' => 0x00, 'char' => 0x01, 'page' => 0x02, 'line' => 0x04, );",
      "ja": "＃特定のエラーコード％コード=（ 'なし' => 0x00で、 '文字' => 0×01 'ページ' => 0×02 '行' => 0x04の、）;"
    },
    {
      "indent": 3,
      "text": "%codestrings = ( 'none' => '(no error)', 'char' => 'invalid character code', 'line' => 'exceeded $maxpagelen lines per page', 'page' => 'exceeded $maxlinelen chars per line', );",
      "ja": "％codestrings =（ 'なし' => '（エラーなし）'、 '文字' => '無効な文字コード'、=> '行' 'は、ページあたり$ MAXPAGELENラインを超えた'、 'ページ' =>「は$引数maxlinelenを超えました行あたりの文字」）;"
    },
    {
      "indent": 3,
      "text": "$errorcode = $codes{'none'};",
      "ja": "$エラーコード= $コード{ 'なし';}"
    },
    {
      "indent": 3,
      "text": "$indentlen = -1; # how many spaces to eat from the beginning # of each line; ought to be 5. negative flag # means it is not yet initialized",
      "ja": "$ indentlen = -1; ＃各行の先頭の＃から食べてどのように多くのスペース。 5.負のフラグ＃が、それがまだ初期化されていないことを意味するべきです"
    },
    {
      "indent": 3,
      "text": "$indentstr = \" \"; # until known otherwise, assume 5 spaces",
      "ja": "$ indentstr = \"「; ＃それ以外知られるまで、5つのスペースを想定"
    },
    {
      "indent": 3,
      "text": "$killwhite = 1; # flag kills space between footer, header # start in 'between footer and header' mode, # so eats all whitespace before the first line",
      "ja": "$ killwhite = 1; ＃フラグが「フッタとヘッダの間」モードでフッタ、ヘッダ＃開始との間の空間を殺す、＃は、第1の行の前にすべての空白を食べます"
    },
    {
      "indent": 3,
      "text": "# ------------------------------------------------------------------\n# ERROR SUBROUTINE\n# ------------------------------------------------------------------\nsub printerr ($) {\n  my ($errstring) = shift;",
      "raw": true
    },
    {
      "indent": 3,
      "text": "  print STDERR \"ERROR: $codestrings{$errstring} \",\n    \"on line $linenum on page $pagenum of text input file\\n\";\n  $errorcode |= $codes{$errstring};\n  return;\n}",
      "raw": true
    },
    {
      "indent": 3,
      "text": "# ------------------------------------------------------------------\n# MAIN\n# ------------------------------------------------------------------",
      "raw": true
    },
    {
      "indent": 3,
      "text": "while ($line = <>) {\n  $line =~ s/\\r//g;         # remove Unix-style end-of-line\n  # if this line is NOT empty, start printing again (see below)\n  if ($line !~ /^\\s*$/) {\n    $killwhite = 0;\n    if ($indentlen < 0) {\n      # discover margin indent\n      $line =~ /^((\\s)*)/;\n      $indentstr = $1;\n      $indentlen = length($indentstr);\n    }\n  }\n  # remove the margin indent\n  $line =~ s/^($indentstr)//;\n  # change special hyphens, quotes to regular ones\n  $line =~ tr/\\221\\222\\223\\224\\226\\227/\\'\\'\\\"\\\"\\-\\-/;\n  # omit end-of-line whitespace\n  $line =~ s/\\s+\\n/\\n/g;\n  # print unless we're between the end of one page\n  # and the beginning of the next\n  if ($killwhite != 1) {\n    # check to see if we have any invalid characters left\n    # 012 = new line, 014 = form feed, 015 = carriage return\n    # 040-176 = printable ASCIIs\n    if ($line !~ /^([\\012\\014\\015\\040-\\176])*$/) {\n      printerr('char');\n      # note -- we don't stop here, so we can find all the\n      # unprintable characters in one pass\n    }\n    $linenum++;\n    if ($linenum > $maxpagelen) {\n      printerr('page');\n    }\n    if ($#line > $maxlinelen) {\n      printerr('line');\n    }\n    print $line;\n  }\n  # check to see if this is the end of a page;\n  # if so, then print a form feed (ctl-L), and\n  # kill the printing of subsequent empty lines\n  if ($line =~ /\\[Page \\d+\\]\\s+$/) {\n    print \"\\f\\n\";\n    $killwhite = 1;",
      "raw": true
    },
    {
      "indent": 3,
      "text": "    $linenum = 0;\n    $pagenum++;\n  }\n}\nexit($errorcode);",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Informative References",
      "ja": "参考文献"
    },
    {
      "indent": 3,
      "text": "[1] Reynolds, J., Ed., and R. Braden, Ed., \"Instructions to Request for Comments (RFC) Authors\", Work in Progress, August 2004.",
      "ja": "[1]レイノルズ、J.、エド。、およびR.ブレーデン、エド。、進歩、2004年8月で、ワーク \"命令は、コメント（RFC）作者を要求します\"。"
    },
    {
      "indent": 3,
      "text": "[2] Bradner, S., Ed., and J. Contreras, Ed., \"Rights Contributors Provide to the IETF Trust\", BCP 78, RFC 5378, November 2008.",
      "ja": "[2]ブラドナー、S.、エド。、およびJ.コントレラス、エド。、2008年11月、BCP 78、RFC 5378の \"権利貢献者は、IETFトラストに提供します\"。"
    },
    {
      "indent": 3,
      "text": "[3] Bradner, S., Ed., \"Intellectual Property Rights in IETF Technology\", BCP 79, RFC 3979, March 2005.",
      "ja": "[3]ブラドナーの、S.、エド。、 \"IETF技術の知的財産権\"、BCP 79、RFC 3979、2005年3月。"
    },
    {
      "indent": 3,
      "text": "[4] RFC Editor, \"Formatting RFCS\", http://www.rfc-editor.org/formatting.html.",
      "ja": "[4] RFCエディタ、 \"フォーマットRFCS\"、http://www.rfc-editor.org/formatting.html。"
    },
    {
      "indent": 3,
      "text": "[5] IETF, \"Guidelines to Authors of Internet Drafts\". Available as 1id-guidelines.txt at http://www.ietf.org.",
      "ja": "[5] IETF、「インターネットドラフトの作者にガイドライン」。 http://www.ietf.orgで1ID-guidelines.txtとして利用できます。"
    },
    {
      "indent": 3,
      "text": "[6] Gahrns, M. and T. Hain, \"Using Microsoft Word to create Internet Drafts and RFCs\", RFC 3285, May 2002.",
      "ja": "[6] Gahrns、M.とT.ハインを、RFC 3285、2002年5月 \"インターネットドラフトやRFCを作成するために、Microsoft Wordを使用します\"。"
    },
    {
      "indent": 3,
      "text": "[7] Rose, M., \"Writing I-Ds and RFCs using XML\", RFC 2629, June 1999.",
      "ja": "[7]ローズ、M.、 \"ライティングI-DSおよびXMLを使用しているRFC\"、RFC 2629、1999年6月。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Joe Touch USC/ISI 4676 Admiralty Way Marina del Rey, CA 90292-6695 U.S.A.",
      "ja": "ジョー・タッチUSC / ISI 4676アドミラルティWayマリナデルレイ、カリフォルニア州90292から6695 U.S.A."
    },
    {
      "indent": 3,
      "text": "Phone: +1 (310) 448-9151 Fax: +1 (310) 448-9300 EMail: touch@isi.edu",
      "ja": "電話：+1（310）448-9151ファックス：+1（310）448-9300 Eメール：touch@isi.edu"
    }
  ]
}