{
  "title": {
    "text": "RFC 5896 - Generic Security Service Application Program Interface (GSS-API): Delegate if Approved by Policy",
    "ja": "RFC 5896 - ジェネリックセキュリティサービスアプリケーションプログラムインターフェイス（GSS-API）：ポリシーで承認された場合は委任"
  },
  "number": 5896,
  "created_at": "2023-01-29 19:17:45.883332+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)              L. Hornquist Astrand\nRequest for Comments: 5896                                   Apple, Inc.\nUpdates: 4120                                                 S. Hartman\nCategory: Standards Track                         Painless Security, LLC\nISSN: 2070-1721                                                June 2010",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Generic Security Service Application Program Interface (GSS-API): Delegate if Approved by Policy",
      "ja": "ジェネリックセキュリティサービスアプリケーションプログラムインターフェイス（GSS-API）：ポリシーで承認された場合は委任"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "Several Generic Security Service Application Program Interface (GSS-API) applications work in a multi-tiered architecture, where the server takes advantage of delegated user credentials to act on behalf of the user and contact additional servers. In effect, the server acts as an agent on behalf of the user. Examples include web applications that need to access e-mail or file servers, including CIFS (Common Internet File System) file servers. However, delegating the user credentials to a party who is not sufficiently trusted is problematic from a security standpoint. Kerberos provides a flag called OK-AS-DELEGATE that allows the administrator of a Kerberos realm to communicate that a particular service is trusted for delegation. This specification adds support for this flag and similar facilities in other authentication mechanisms to GSS-API (RFC 2743).",
      "ja": "いくつかの一般的なセキュリティサービスアプリケーションプログラムインターフェイス（GSS-API）アプリケーションは、マルチ層アーキテクチャで動作します。そこでは、サーバーが委任されたユーザー資格情報を利用してユーザーに代わって行動し、追加サーバーに連絡します。実際、サーバーはユーザーに代わってエージェントとして機能します。例には、CIF（共通のインターネットファイルシステム）ファイルサーバーなど、電子メールまたはファイルサーバーにアクセスする必要があるWebアプリケーションが含まれます。ただし、ユーザーの資格情報を十分に信頼していない当事者に委任することは、セキュリティの観点から問題があります。Kerberosは、Kerberos Realmの管理者が特定のサービスが委任に対して信頼されていることを伝えることを可能にするDelegateと呼ばれる旗を提供します。この仕様は、GSS-APIに他の認証メカニズムにおけるこのフラグと同様の施設のサポートを追加します（RFC 2743）。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準トラックドキュメントです。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントは、インターネットエンジニアリングタスクフォース（IETF）の製品です。IETFコミュニティのコンセンサスを表しています。公開レビューを受けており、インターネットエンジニアリングステアリンググループ（IESG）からの出版が承認されています。インターネット標準の詳細については、RFC 5741のセクション2で入手できます。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc5896.",
      "ja": "このドキュメントの現在のステータス、任意のERRATA、およびそのフィードバックを提供する方法に関する情報は、http：//www.rfc-editor.org/info/rfc5896で取得できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2010 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2010 IETF Trustおよび文書著者として特定された人。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "このドキュメントは、BCP 78およびIETFドキュメント（http://trustee.ietf.org/license-info）に関連するIETF Trustの法的規定の対象となります。この文書に関するあなたの権利と制限を説明するので、これらの文書を注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、セクション4.Eで説明されている法的規定のセクション4.Eで説明されており、単純化されたBSDライセンスで説明されているように保証なしで提供される簡略化されたBSDライセンステキストを含める必要があります。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . . . 2\n2.  Requirements Notation . . . . . . . . . . . . . . . . . . . . . 3\n3.  GSS-API flag, C binding . . . . . . . . . . . . . . . . . . . . 3\n4.  GSS-API Behavior  . . . . . . . . . . . . . . . . . . . . . . . 3\n5.  Kerberos GSS-API Behavior . . . . . . . . . . . . . . . . . . . 4\n6.  Rationale . . . . . . . . . . . . . . . . . . . . . . . . . . . 4\n7.  Security Considerations . . . . . . . . . . . . . . . . . . . . 5\n8.  Acknowledgements  . . . . . . . . . . . . . . . . . . . . . . . 5\n9.  Normative References  . . . . . . . . . . . . . . . . . . . . . 5",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "Several GSS-API applications work in a multi-tiered architecture, where the server takes advantage of delegated user credentials to act on behalf of the user and contact additional servers. In effect, the server acts as an agent on behalf of the user. Examples include web applications that need to access e-mail or file servers, including CIFS file servers. However, delegating user credentials to a party who is not sufficiently trusted is problematic from a security standpoint.",
      "ja": "いくつかのGSS-APIアプリケーションは、マルチ層アーキテクチャで機能します。そこでは、サーバーが委任されたユーザー資格情報を利用してユーザーに代わって行動し、追加サーバーに連絡します。実際、サーバーはユーザーに代わってエージェントとして機能します。例には、CIFSファイルサーバーを含む電子メールまたはファイルサーバーにアクセスする必要があるWebアプリケーションが含まれます。ただし、ユーザーの資格情報を十分に信頼していない当事者に委任することは、セキュリティの観点から問題があります。"
    },
    {
      "indent": 3,
      "text": "Today, GSS-API [RFC2743] leaves the determination of whether delegation is desired to the client application. An application requests delegation by setting the deleg_req_flag when calling init_sec_context. This requires client applications to know what services should be trusted for delegation.",
      "ja": "今日、GSS-API [RFC2743]は、委任がクライアントアプリケーションに望まれているかどうかの決定を残しています。init_sec_contextを呼び出すときに、deleg_req_flagを設定することにより、アプリケーションは委任を要求します。これには、クライアントアプリケーションが委任に対して信頼されるサービスを知るためにクライアントアプリケーションが必要です。"
    },
    {
      "indent": 3,
      "text": "However, blindly delegating to services for applications that do not need delegation is problematic. In some cases, a central authority is in a better position than the client application to know what services should receive delegation. Some GSS-API mechanisms have a facility to allow an administrator to communicate that a particular service is an appropriate target for delegation. For example, a Kerberos [RFC4121] KDC can set the OK-AS-DELEGATE flag in issued tickets as such an indication. It is desirable to expose this knowledge to the GSS-API client so the client can request delegation if and only if central policy recommends delegation to the given service.",
      "ja": "ただし、委任を必要としないアプリケーションのサービスに盲目的に委任することには問題があります。場合によっては、中央当局がクライアントアプリケーションよりも優れた位置にあり、どのサービスが委任されるべきかを知ることができます。一部のGSS-APIメカニズムには、管理者が特定のサービスが委任の適切なターゲットであることを通信できるようにする機能があります。たとえば、Kerberos [RFC4121] KDCは、発行されたチケットにOK-AS DELEGATEフラグをそのような表示として設定できます。この知識をGSS-APIクライアントに公開することが望ましいので、中央政策が特定のサービスに委任を推奨する場合にのみ、クライアントが委任を要求できます。"
    },
    {
      "indent": 3,
      "text": "This specification adds a new input flag to gss_init_sec_context() to request delegation when approved by central policy. In addition, a constant value to be used in the GSS-API C bindings [RFC2744] is defined. Finally, the behavior for the Kerberos mechanism [RFC4121] is specified.",
      "ja": "この仕様は、GSS_INIT_SEC_CONTEXT（）に新しい入力フラグを追加して、中央ポリシーで承認された場合に委任を要求します。さらに、GSS-API Cバインディング[RFC2744]で使用される一定の値が定義されています。最後に、Kerberosメカニズム[RFC4121]の動作が指定されています。"
    },
    {
      "indent": 0,
      "text": "2. Requirements Notation",
      "section_title": true,
      "ja": "2. 要件表記"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "「必須」、「そうしない」、「必須」、「必要」、「しない」、「そうしない」、「そうではない」、「そうでない」、「推奨」、「5月」、および「オプション」は、[RFC2119]に記載されているように解釈される。"
    },
    {
      "indent": 0,
      "text": "3. GSS-API flag, C binding",
      "section_title": true,
      "ja": "3. GSS-APIフラグ、Cバインディング"
    },
    {
      "indent": 3,
      "text": "The gss_init_sec_context API is extended to gain a new input flag, deleg_policy_req_flag, and a new output flag, deleg_policy_state BOOLEAN. If the deleg_policy_req_flag is set, then delegation SHOULD be performed if recommended by central policy. When delegation was recommended by the central policy and when delegation was done, the output flag deleg_policy_state will be set.",
      "ja": "GSS_INIT_SEC_CONTEXT APIは、新しい入力フラグdeleg_policy_req_flag、および新しい出力フラグdeleg_policy_state booleanを取得するように拡張されています。DELEG_POLICY_REQ_FLAGが設定されている場合、中央ポリシーで推奨される場合は、委任を実行する必要があります。中央ポリシーによって委任が推奨され、委任が完了したときに、出力フラグDELEG_POLICY_STATEが設定されます。"
    },
    {
      "indent": 3,
      "text": "In addition, the C bindings are extended to define the following constant to represent both deleg_policy_req_flag and deleg_policy_state (just like GSS_C_DELEG_FLAG maps to two flags).",
      "ja": "さらに、cバインディングは拡張され、次の定数を定義してDeleg_policy_req_flagとdeleg_policy_stateの両方を表します（GSS_C_DELEG_FLAGマップに2つのフラグにマップします）。"
    },
    {
      "indent": 3,
      "text": "#define GSS_C_DELEG_POLICY_FLAG 32768",
      "ja": "#define gss_c_deleg_policy_flag 32768"
    },
    {
      "indent": 0,
      "text": "4. GSS-API Behavior",
      "section_title": true,
      "ja": "4. GSS-API動作"
    },
    {
      "indent": 3,
      "text": "As before, if the deleg_req_flag is set, the GSS-API mechanism will attempt delegation of user credentials. When delegation is successful, deleg_state will return TRUE in both the initiator and acceptor output state (gss_init_sec_context and gss_accept_sec_context, respectively).",
      "ja": "前と同様に、DELEG_REQ_FLAGが設定されている場合、GSS-APIメカニズムはユーザー資格情報の委任を試みます。委任が成功すると、DELEG_STATEは、イニシエーターとアクセプター出力状態（GSS_INIT_SEC_CONTEXTとGSS_ACCEPT_SEC_CONTEXT）の両方でTRUEを返します。"
    },
    {
      "indent": 3,
      "text": "Similarly, if the deleg_policy_req_flag is set, then the GSS-API mechanism will attempt delegation if the mechanism-specific policy recommends to do so. When delegation is allowed and successful, deleg_state will return TRUE in both initiator and acceptor output state. In addition, deleg_policy_state will be set in the initiator output state.",
      "ja": "同様に、DELEG_POLICY_REQ_FLAGが設定されている場合、メカニズム固有のポリシーがそうすることを推奨する場合、GSS-APIメカニズムは委任を試みます。委任が許可され、成功すると、DELEG_STATEはイニシエーターとアクセプター出力状態の両方でTRUEを返します。さらに、DELEG_POLICY_STATEは、イニシエーター出力状態に設定されます。"
    },
    {
      "indent": 3,
      "text": "If the initiator sets both the deleg_req_flag and deleg_policy_req_flag, delegation will be attempted unconditionally. When delegation is successful, deleg_state will return TRUE in the initiator and acceptor. When delegation was successful, the deleg_state will return TRUE in the initiator and acceptor. Additionally, if the mechanism-specific policy recommended delegation, the deleg_policy_state will additionally return TRUE for the initiator (only).",
      "ja": "イニシエーターがDELEG_REQ_FLAGとDELEG_POLICY_REQ_FLAGの両方を設定すると、委任は無条件に試みられます。委任が成功すると、DELEG_STATEはイニシエーターとアクセプターでTRUEを返します。委任が成功したとき、DELEG_STATEはイニシエーターとアクセプターでTRUEを返します。さらに、メカニズム固有のポリシーが代表団を推奨する場合、Deleg_Policy_Stateはさらにイニシエーターに対してtrueを返します（のみ）。"
    },
    {
      "indent": 3,
      "text": "Note that deleg_policy_req_flag and deleg_policy_state apply the initiator only. Their state is never sent over the wire.",
      "ja": "deleg_policy_req_flagおよびdeleg_policy_stateがイニシエーターのみを適用することに注意してください。彼らの状態は電線の上に送られることはありません。"
    },
    {
      "indent": 0,
      "text": "5. Kerberos GSS-API Behavior",
      "section_title": true,
      "ja": "5. Kerberos GSS-API行動"
    },
    {
      "indent": 3,
      "text": "If the initiator sets the deleg_policy_req_flag (and not deleg_req_flag), the Kerberos GSS-API mechanism MUST only delegate if OK-AS-DELEGATE is set [RFC4120] in the service ticket. Other policy checks MAY be applied. If the initiator sets deleg_req_flag (and not deleg_policy_req_flag), the behavior will be as defined by [RFC2743]. If the initiator set both the deleg_req_flag and deleg_policy_req_flag, delegation will be attempted unconditionally.",
      "ja": "イニシエーターがDELEG_POLICY_REQ_FLAG（DELEG_REQ_FLAGではなく）を設定した場合、Kerberos GSS-APIメカニズムは、サービスチケットにOK-As-Delegateが設定されている場合にのみ委任する必要があります。他のポリシーチェックが適用される場合があります。イニシエーターがDELEG_REQ_FLAGを設定する場合（DELEG_POLICY_REQ_FLAGではなく）、動作は[RFC2743]で定義されています。イニシエーターがDELEG_REQ_FLAGとDELEG_POLICY_REQ_FLAGの両方を設定した場合、代表団は無条件に試みられます。"
    },
    {
      "indent": 3,
      "text": "[RFC4120] does not adequately describe the behavior of the OK-AS-DELEGATE flag in a cross realm environment. This document clarifies that behavior. If the initiator sets the deleg_policy_req_flag, the GSS-API Kerberos mechanism MUST examine the OK-AS-DELEGATE flag in the service ticket, and it MUST examine all cross realm tickets in the traversal from the user's initial ticket-granting-ticket (TGT) to the service ticket. If any of the intermediate cross realm TGTs do not have the OK-AS-DELEGATE flag set, the mechanism MUST NOT delegate credentials.",
      "ja": "[RFC4120]は、クロスレルム環境におけるOK-AS DELEGATEフラグの挙動を適切に説明していません。このドキュメントは、その動作を明確にします。イニシエーターがDELEG_POLICY_REQ_FLAGを設定した場合、GSS-API KerberosメカニズムはサービスチケットのOK-AS DELEGATEフラグを調べる必要があり、ユーザーの最初のチケットグラントチケット（TGT）からトラバーサルのすべてのクロスレルムチケットを調べる必要があります。サービスチケットへ。中間のクロスレルムTGTのいずれかに、DELEGAS AS DELEGATEフラグが設定されていない場合、メカニズムは資格情報を委任してはなりません。"
    },
    {
      "indent": 0,
      "text": "6. Rationale",
      "section_title": true,
      "ja": "6. 根拠"
    },
    {
      "indent": 3,
      "text": "Strictly speaking, the deleg_req_flag behavior in [RFC2743] could be interpreted the same as deleg_policy_req_flag is described in this document. However, in practice, the new flag is required because existing applications and user expectations depend upon GSS-API mechanism implementations without the described behavior, i.e., they do not respect OK-AS-DELEGATE.",
      "ja": "厳密に言えば、[RFC2743]のDELEG_REQ_FLAGの動作は、DELEG_POLICY_REQ_FLAGがこのドキュメントで説明されているのと同じと解釈できます。ただし、実際には、既存のアプリケーションとユーザーの期待は、記載されている動作なしのGSS-APIメカニズムの実装に依存するため、新しいフラグが必要です。"
    },
    {
      "indent": 3,
      "text": "In hind sight, the deleg_req_flag should not have been implemented to mean unconditional delegation. Such promiscuous delegation reduces overall security by unnecessarily exposing user credentials, including to hosts and services that the user has no reason to trust.",
      "ja": "後ろの視界では、DELEG_REQ_FLAGは、無条件の委任を意味するように実装されるべきではありませんでした。このような無差別な代表団は、ユーザーが信頼する理由がないホストやサービスなど、ユーザーの資格情報を不必要に公開することにより、全体的なセキュリティを削減します。"
    },
    {
      "indent": 3,
      "text": "Today there are Kerberos implementations that do not support the OK-AS-DELEGATE flag in the Kerberos database. If the implementation of the deleg_req_flag were changed to honor the OK-AS-DELEGATE flag, users who deploy new client software would never achieve credential delegation because the KDC would never issue a ticket with the OK-AS-DELEGATE flag set. Changing the client software behavior in this way would cause a negative user experience for those users. This is compounded by the fact that users often deploy new software without coordinating with site administrators.",
      "ja": "今日、KerberosデータベースのDelegate As DelegateフラグをサポートしていないKerberosの実装があります。DELEG_REQ_FLAGの実装が変更された場合、DELEGAS AS DELEGATEフラグを称えるために、KDCがOK-As Delegateフラグセットでチケットを発行しないため、新しいクライアントソフトウェアを展開するユーザーは資格委員会を達成しません。この方法でクライアントソフトウェアの動作を変更すると、ユーザーにとってネガティブなユーザーエクスペリエンスが発生します。これは、ユーザーがサイト管理者と調整せずに新しいソフトウェアを展開することが多いという事実によって悪化します。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "ja": "7. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "This document introduces a flag that allows the client to get help from the KDC in determining to which servers one should delegate credentials, and the servers to which the client can delegate.",
      "ja": "このドキュメントでは、クライアントがKDCのヘルプを取得できるフラグを紹介します。これは、クレデンシャルを委任するサーバーと、クライアントが委任できるサーバーを決定する際に紹介します。"
    },
    {
      "indent": 3,
      "text": "The new flag deleg_policy_req_flag is not communicated over the wire, and thus does not present a new opportunity for spoofing or downgrading policy in and of itself.",
      "ja": "新しいFlag Deleg_Policy_Req_Flagは、ワイヤー上で通信されないため、ポリシー自体をスプーフィングまたは格下げする新しい機会はありません。"
    },
    {
      "indent": 3,
      "text": "Mechanisms should use a trusted/authenticated means of determining delegation policy, and it must not be spoofable on the network.",
      "ja": "メカニズムは、委任ポリシーを決定する信頼できる/認証された手段を使用する必要があり、ネットワーク上でスプーフィングしてはなりません。"
    },
    {
      "indent": 3,
      "text": "Delegating the user's TGT is still too powerful and dangerous. Ideally, one would delegate specific service tickets, but this is out of scope of this document.",
      "ja": "ユーザーのTGTを委任することは、依然として強力で危険です。理想的には、特定のサービスチケットを委任しますが、これはこのドキュメントの範囲外です。"
    },
    {
      "indent": 3,
      "text": "A client's failure to specify deleg_policy_req_flag can at worst result in NOT delegating credentials. This means that the client does not expand its trust, which is generally safer than the alternative.",
      "ja": "deleg_policy_req_flagを指定しなかったクライアントが最悪の場合、資格情報を委任しない可能性があります。これは、クライアントが信頼を拡大しないことを意味します。これは一般に代替よりも安全です。"
    },
    {
      "indent": 0,
      "text": "8. Acknowledgements",
      "section_title": true,
      "ja": "8. 謝辞"
    },
    {
      "indent": 3,
      "text": "Thanks to Disco Vince Giffin, Thomas Maslen, Ken Raeburn, Martin Rex, Alexey Melnikov, Jacques Vidrine, Tom Yu, Hilarie Orman, and Shawn Emery for reviewing the document and providing suggestions for improvements.",
      "ja": "Disco Vince Giffin、Thomas Maslen、Ken Raeburn、Martin Rex、Alexey Melnikov、Jacques Vidrine、Tom Yu、Hilarie Orman、Shawn Emeryに感謝し、ドキュメントをレビューし、改善の提案を提供してくれたことに感謝します。"
    },
    {
      "indent": 0,
      "text": "9. Normative References",
      "section_title": true,
      "ja": "9. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119] Bradner、S。、「要件レベルを示すためにRFCで使用するためのキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2743] Linn, J., \"Generic Security Service Application Program Interface Version 2, Update 1\", RFC 2743, January 2000.",
      "ja": "[RFC2743] Linn、J。、「Generic Security Service Application Program Interfaceバージョン2、Update 1」、RFC 2743、2000年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC2744] Wray, J., \"Generic Security Service API Version 2 : C-bindings\", RFC 2744, January 2000.",
      "ja": "[RFC2744] Wray、J。、「ジェネリックセキュリティサービスAPIバージョン2：C-Bindings」、RFC 2744、2000年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC4120] Neuman, C., Yu, T., Hartman, S., and K. Raeburn, \"The Kerberos Network Authentication Service (V5)\", RFC 4120, July 2005.",
      "ja": "[RFC4120] Neuman、C.、Yu、T.、Hartman、S。、およびK. Raeburn、「The Kerberos Network Authentication Service（V5）」、RFC 4120、2005年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC4121] Zhu, L., Jaganathan, K., and S. Hartman, \"The Kerberos Version 5 Generic Security Service Application Program Interface (GSS-API) Mechanism: Version 2\", RFC 4121, July 2005.",
      "ja": "[RFC4121] Zhu、L.、Jaganathan、K。、およびS. Hartman、「Kerberosバージョン5ジェネリックセキュリティサービスアプリケーションプログラムインターフェイス（GSS-API）メカニズム：バージョン2、RFC 4121、2005年7月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Love Hornquist Astrand Apple, Inc.",
      "ja": "Love Hornquist Astrand Apple、Inc。"
    },
    {
      "indent": 3,
      "text": "EMail: lha@apple.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Sam Hartman Painless Security, LLC",
      "ja": "Sam Hartman Painless Security、LLC"
    },
    {
      "indent": 3,
      "text": "EMail: hartmans-ietf@mit.edu",
      "raw": true,
      "ja": ""
    }
  ]
}