{
  "title": {
    "text": "RFC 5986 - Discovering the Local Location Information Server (LIS)",
    "ja": "RFC 5986 - 発見ローカル位置情報サーバー（LIS）"
  },
  "number": 5986,
  "created_at": "2019-10-31 21:44:21.311065+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                        M. Thomson\nRequest for Comments: 5986                               J. Winterbottom\nCategory: Standards Track                             Andrew Corporation\nISSN: 2070-1721                                           September 2010",
      "raw": true
    },
    {
      "indent": 8,
      "text": "Discovering the Local Location Information Server (LIS)",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "Discovery of the correct Location Information Server (LIS) in the local access network is necessary for Devices that wish to acquire location information from the network. A method is described for the discovery of a LIS in the access network serving a Device. Dynamic Host Configuration Protocol (DHCP) options for IP versions 4 and 6 are defined that specify a domain name. This domain name is then used as input to a URI-enabled NAPTR (U-NAPTR) resolution process.",
      "ja": "ローカルアクセスネットワーク内の正しい位置情報サーバー（LIS）の発見は、ネットワークから位置情報を取得したいデバイスのために必要です。方法は、デバイスにサービスを提供するアクセス・ネットワーク内のLISの発見のために記載されています。 IPバージョン4と6のための動的ホスト構成プロトコル（DHCP）のオプションは、そのドメイン名を指定して定義されています。このドメイン名は、URI対応NAPTR（U-NAPTR）解決プロセスへの入力として使用されます。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc5986.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc5986で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2010 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2010 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction and Overview  . . . . . . . . . . . . . . . . . .  2\n  1.1.  Discovery Procedure Overview . . . . . . . . . . . . . . .  3\n  1.2.  Terminology  . . . . . . . . . . . . . . . . . . . . . . .  3\n2.  LIS Discovery Procedure  . . . . . . . . . . . . . . . . . . .  4\n  2.1.  Residential Gateways . . . . . . . . . . . . . . . . . . .  6\n  2.2.  Virtual Private Networks (VPNs)  . . . . . . . . . . . . .  7\n3.  Determining a Domain Name  . . . . . . . . . . . . . . . . . .  7\n  3.1.  Domain Name Encoding . . . . . . . . . . . . . . . . . . .  7\n  3.2.  Access Network Domain Name DHCPv4 Option . . . . . . . . .  8\n  3.3.  Access Network Domain Name DHCPv6 Option . . . . . . . . .  8\n  3.4.  Alternative Domain Names . . . . . . . . . . . . . . . . .  9\n4.  U-NAPTR Resolution of a LIS URI  . . . . . . . . . . . . . . . 10\n5.  Security Considerations  . . . . . . . . . . . . . . . . . . . 11\n6.  IANA Considerations  . . . . . . . . . . . . . . . . . . . . . 13\n  6.1.  Registration of DHCPv4 and DHCPv6 Option Codes . . . . . . 13\n  6.2.  Registration of a Location Server Application Service\n        Tag  . . . . . . . . . . . . . . . . . . . . . . . . . . . 13\n  6.3.  Registration of a Location Server Application Protocol\n        Tag for HELD . . . . . . . . . . . . . . . . . . . . . . . 13\n7.  Acknowledgements . . . . . . . . . . . . . . . . . . . . . . . 14\n8.  References . . . . . . . . . . . . . . . . . . . . . . . . . . 14\n  8.1.  Normative References . . . . . . . . . . . . . . . . . . . 14\n  8.2.  Informative References . . . . . . . . . . . . . . . . . . 15",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction and Overview",
      "section_title": true,
      "ja": "1.はじめにと概要"
    },
    {
      "indent": 3,
      "text": "The location of a Device is a useful and sometimes necessary part of many services. A Location Information Server (LIS) is responsible for providing that location information to Devices with attached access networks used to provide Internet access. The LIS uses knowledge of the access network and its physical topology to generate and serve location information to Devices.",
      "ja": "デバイスの位置は、多くのサービスの有用な、時には必要な部分です。位置情報サーバ（LIS）は、インターネットへのアクセスを提供するために使用する付属のアクセスネットワークとデバイスにその位置情報を提供する責任があります。 LISは、デバイスに位置情報を生成して提供するために、アクセスネットワークの知識とその物理トポロジを使用しています。"
    },
    {
      "indent": 3,
      "text": "Each access network requires specific knowledge about topology. Therefore, it is important to discover the LIS that has the specific knowledge necessary to locate a Device, that is, the LIS that serves the current access network. Automatic discovery is important where there is any chance of movement outside a single access network. Reliance on static configuration can lead to unexpected errors if a Device moves between access networks.",
      "ja": "各アクセスネットワークは、トポロジーに関する具体的な知識が必要です。したがって、それは、現在のアクセスネットワークを提供していLISで、デバイスの位置を特定するために必要な特定の知識を有するLISを発見することが重要です。単一のアクセスネットワーク外の動きのいずれかのチャンスがある場合の自動発見が重要です。デバイスがアクセスネットワーク間を移動する場合は、静的な構成への依存度は、予期しないエラーにつながることができます。"
    },
    {
      "indent": 3,
      "text": "This document describes a process that a Device can use to discover a LIS. This process uses a DHCP option and the DNS. The product of this discovery process is an HTTP [RFC2616] or HTTPS [RFC2818] URI that identifies a LIS.",
      "ja": "この文書では、デバイスは、LISを発見するために使用できるプロセスについて説明します。このプロセスは、DHCPオプションとDNSを使用しています。この発見プロセスの生成物は、LISを識別するHTTP [RFC2616]またはHTTPS [RFC2818] URIです。"
    },
    {
      "indent": 3,
      "text": "The URI result from the discovery process is suitable for location configuration only; that is, the Device MUST dereference the URI using the process described in HTTP-Enabled Location Delivery (HELD) [RFC5985]. URIs discovered in this way are not \"location URIs\" [RFC5808]; dereferencing one of them provides the location of the requestor only. Devices MUST NOT embed these URIs in fields in other protocols designed to carry the location of the Device.",
      "ja": "発見プロセスからURI結果は、位置設定するのに適しています。すなわち、HTTP対応ロケーション配信（保持）に記載された方法を使用してURI間接参照デバイスMUST [RFC5985]です。この方法で発見されたURIは、[RFC5808]「場所のURI」ではありません。そのうちの一つを参照解除することのみ要求元の場所を提供します。デバイスは、デバイスの場所を運ぶために設計された他のプロトコル内のフィールドにこれらのURIを埋め込むてはなりません。"
    },
    {
      "indent": 0,
      "text": "1.1. Discovery Procedure Overview",
      "section_title": true,
      "ja": "1.1. ディスカバリー手順の概要"
    },
    {
      "indent": 3,
      "text": "DHCP ([RFC2131], [RFC3315]) is a commonly used mechanism for providing bootstrap configuration information that allows a Device to operate in a specific network environment. The DHCP information is largely static, consisting of configuration information that does not change over the period that the Device is attached to the network. Physical location information might change over this time; however, the address of the LIS does not. Thus, DHCP is suitable for configuring a Device with the address of a LIS.",
      "ja": "DHCP（[RFC2131]、[RFC3315]）は、デバイスが特定のネットワーク環境で動作することを可能にするブートストラップ構成情報を提供するために一般的に使用されるメカニズムです。 DHCP情報は、装置がネットワークに接続されている期間にわたって変化しない設定情報からなる、主に静的です。物理的な位置情報は、この時間の経過とともに変更される可能性があります。しかし、LISのアドレスにはありません。このように、DHCPは、LISのアドレスを持つデバイスを構成するのに適しています。"
    },
    {
      "indent": 3,
      "text": "This document defines a DHCP option that produces a domain name that identifies the local access network in Section 3.",
      "ja": "この文書では、第3節では、ローカルアクセスネットワークを識別するドメイン名を作成するDHCPオプションを定義します。"
    },
    {
      "indent": 3,
      "text": "Section 4 describes a method that uses URI-enabled NAPTR (U-NAPTR) [RFC4848], a Dynamic Delegation Discovery Service (DDDS) profile that produces a URI for the LIS. The input to this process is provided by the DHCP option.",
      "ja": "セクション4はURI-有効NAPTR（U-NAPTR）[RFC4848]を使用する方法、LISのためのURIを生成するダイナミックな委譲ディスカバリサービス（DDDS）プロファイルを記述する。このプロセスへの入力は、DHCPオプションによって提供されます。"
    },
    {
      "indent": 3,
      "text": "For the LIS discovery DDDS application, an Application Service tag \"LIS\" and an Application Protocol tag \"HELD\" have been created and registered with the IANA. Based on the domain name, this U-NAPTR application uses the two tags to determine a URI for a LIS that supports the HELD protocol.",
      "ja": "LISの発見DDDSアプリケーションでは、アプリケーション・サービス・タグ「LIS」と「開催された」アプリケーションプロトコルタグが作成され、IANAに登録します。ドメイン名に基づいて、このU-NAPTRアプリケーションを開催プロトコルをサポートLISのURIを決定するために2個のタグを使用しています。"
    },
    {
      "indent": 0,
      "text": "1.2. Terminology",
      "section_title": true,
      "ja": "1.2. 用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 3,
      "text": "This document also uses the term \"Device\" to refer to an end host or client consistent with its use in HELD. In HELD and RFC 3693 [RFC3693] parlance, the Device is also the Target.",
      "ja": "また、このドキュメントでは、HELDでの使用と一致エンドホストまたはクライアントを参照するために用語「デバイス」を使用しています。保持し、RFC 3693 [RFC3693]用語では、デバイスはまた、標的です。"
    },
    {
      "indent": 3,
      "text": "The term \"access network\" refers to the network to which a Device connects for Internet access. The \"access network provider\" is the entity that operates the access network. This is consistent with the definition in [RFC5687], which combines the Internet Access Provider",
      "ja": "用語「アクセス網」は、デバイスがインターネットにアクセスするための接続先のネットワークを指します。 「アクセスネットワークプロバイダは、」アクセスネットワークを運営するエンティティです。これは、インターネットアクセスプロバイダを組み合わせた、[RFC5687]で定義と一致しています"
    },
    {
      "indent": 3,
      "text": "(IAP) and Internet Service Provider (ISP). The access network provider is responsible for allocating the Device a public IP address and for directly or indirectly providing a LIS service.",
      "ja": "（IAP）およびインターネットサービスプロバイダ（ISP）。アクセス・ネットワーク・プロバイダは、デバイスにパブリックIPアドレスを割り当てると、直接または間接的にLISサービスを提供する責任があります。"
    },
    {
      "indent": 0,
      "text": "2. LIS Discovery Procedure",
      "section_title": true,
      "ja": "2. LISディスカバリー手順"
    },
    {
      "indent": 3,
      "text": "A Device that has multiple network interfaces could potentially be served by a different access network on each interface, each with a different LIS. The Device SHOULD attempt to discover the LIS applicable to each network interface, stopping when a LIS is successfully discovered on any interface.",
      "ja": "複数のネットワークインターフェースを持つデバイスは、潜在的にそれぞれ異なるLISと、各インターフェイス上の異なるアクセスネットワークによって配信することができます。デバイスは、LISが正常に任意のインターフェイス上で発見されたときに停止し、各ネットワークインターフェイスに適用LISを発見しようとすべきです。"
    },
    {
      "indent": 3,
      "text": "The LIS discovery procedure follows this process:",
      "ja": "LIS発見手順は、次のプロセスに従います"
    },
    {
      "indent": 3,
      "text": "1. Acquire the access network domain name (Section 3).",
      "section_title": true,
      "ja": "1.アクセス・ネットワーク・ドメイン名（第3節）を取得。"
    },
    {
      "indent": 7,
      "text": "This process might be repeated for each of the network interfaces\non the Device.  Domain names acquired from other sources might\nalso be added.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "2. Apply U-NAPTR resolution (Section 4) to discover a LIS URI.",
      "section_title": true,
      "ja": "2. LIS URIを発見するためにU-NAPTR解像度（第4章）を適用します。"
    },
    {
      "indent": 7,
      "text": "The U-NAPTR process is applied using each of the domain names as\ninput.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "3. Verify that the LIS is able to provide location information.",
      "section_title": true,
      "ja": "3. LISは、位置情報を提供することができることを確認します。"
    },
    {
      "indent": 7,
      "text": "The first URI that results in a successful response from the LIS\nis used.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "A Device MUST support discovery using the access network domain name DHCP option (Section 3) as input to U-NAPTR resolution (Section 4). If this option is not available, DHCPv4 option 15 [RFC2132] is used. Other domain names MAY be used, as described in Section 3.4.",
      "ja": "デバイスは、U-NAPTR解像度（セクション4）への入力として、アクセスネットワークドメイン名DHCPオプション（セクション3）を使用してディスカバリをサポートしなければなりません。このオプションが利用できない場合は、DHCPv4のオプション15 [RFC2132]は使用されています。 3.4節で説明したように、他のドメイン名を使用することができます。"
    },
    {
      "indent": 3,
      "text": "A Device that discovers a LIS URI MUST attempt to verify that the LIS is able to provide location information. For the HELD protocol, the Device verifies the URI by making a location request to the LIS. Any HTTP 200 response containing a HELD response signifies success. This includes HELD error responses, with the exception of the \"notLocatable\" error.",
      "ja": "LIS URIを発見デバイスは、LISは、位置情報を提供することが可能であることを確認しようとしなければなりません。 HELDプロトコルのために、デバイスがLISへロケーション要求を行うことで、URIを検証します。 HELD応答を含む任意のHTTP 200応答は成功を意味します。これは、「notLocatable」エラーを除いて、HELDエラー応答を含んでいます。"
    },
    {
      "indent": 3,
      "text": "If -- at any time -- the LIS responds to a request with the \"notLocatable\" error code (see Section 4.3.2 of [RFC5985]), the Device MUST continue or restart the discovery process. A Device SHOULD NOT make further requests to a LIS that provides a \"notLocatable\" error until its network attachment changes, or it discovers the LIS on an alternative network interface.",
      "ja": "場合 - いつでも -  LISは（[RFC5985]のセクション4.3.2を参照）、「notLocatable」エラーコードで要求に応答する、デバイスは、発見プロセスを続行するか再起動する必要があります。デバイスは、そのネットワーク接続が変更されるまで「notLocatable」エラーを提供し、またはそれが代替ネットワークインタフェース上のLISを発見LISへのさらなる要求を行うべきではありません。"
    },
    {
      "indent": 3,
      "text": "Static configuration of a domain name or a LIS URI MAY be used. Note that if a Device has moved from its customary location, static configuration might indicate a LIS that is unable to provide accurate location information.",
      "ja": "ドメイン名またはLIS URIの静的な構成を使用することができます。デバイスがその慣用の場所から移動した場合、静的構成は、正確な位置情報を提供することができないLISを示すかもしれないことに留意されたいです。"
    },
    {
      "indent": 3,
      "text": "The product of the LIS discovery process for HELD is an HTTPS or HTTP URI. Nothing distinguishes this URI from other URIs with the same scheme, aside from the fact that it is the product of this process. Only URIs produced by the discovery process can be used for location configuration using HELD.",
      "ja": "HELDのためのLISの発見プロセスの製品は、HTTPSまたはHTTP URIです。何も、それは、このプロセスの産物であるという事実は別に、同じスキームで他のURIから、このURIを区別しません。検出プロセスによって製造さURIのみを保持使用して位置設定のために使用することができます。"
    },
    {
      "indent": 3,
      "text": "The overall discovery process is summarized in Figure 1.",
      "ja": "全体の検出プロセスを図1に要約されています。"
    },
    {
      "indent": 4,
      "text": "   -----------\n  (   Start   )\n   -----+-----\n        |<--------------------------------------+\n        |                                       |\n        V                                       |\n  ------^-------            ------^------       |\n /              \\          /      1.     \\      |\n< Next interface >-------><  Get domain   >-----+\n \\              / Y  ^     \\             /  N\n  ------v-------     |      ------v------\n        | N          |            | Y\n        |            |            V\n        |            |      ------^------\n        |            |     /      2.     \\\n        |            +----<    Get URI    ><----+\n        |               N  \\             /      |\n        |                   ------v------       |\n        |                         | Y           |\n        |                         V             |\n        |                   ------^------       |\n        |                  /      3.     \\      |\n        |                 <   Check URI   >-----+\n        |                  \\             /  N\n        |                   ------v------\n        |                         | Y\n        V                         V\n   -----------               -----------\n  (  Failure  )             (  Success  )\n   -----------               -----------",
      "raw": true
    },
    {
      "indent": 21,
      "text": "Figure 1: LIS Discovery Flowchart",
      "ja": "図1：LISディスカバリーフローチャート"
    },
    {
      "indent": 0,
      "text": "2.1. Residential Gateways",
      "section_title": true,
      "ja": "2.1. レジデンシャルゲートウェイ"
    },
    {
      "indent": 3,
      "text": "The options available in residential gateways will affect the success of this algorithm in residential network scenarios. A fixed wireline scenario is described in more detail in [RFC5687], Section 3.1. In this fixed wireline environment, an intervening residential gateway exists between the Device and the access network. If the residential gateway does not provide the appropriate information to the Devices it serves, those Devices are unable to discover a LIS.",
      "ja": "住宅用ゲートウェイで使用可能なオプションは、住宅ネットワークのシナリオでは、このアルゴリズムの成功に影響を与えます。固定有線シナリオは、[RFC5687]、セクション3.1でより詳細に記載されています。この固定有線環境では、介在レジデンシャルゲートウェイは、デバイスとアクセスネットワークとの間に存在します。レジデンシャルゲートウェイは、それが機能デバイスへの適切な情報を提供していない場合は、それらのデバイスは、LISを発見することはできません。"
    },
    {
      "indent": 3,
      "text": "Support of this specification by residential gateways ensures that the Devices they serve are able to acquire location information. In many cases, the residential gateway configures the Devices it serves using DHCP. A residential gateway is able to use DHCP to assist Devices in gaining access to their location information. This can be accomplished by providing an access network domain name DHCP option suitable for LIS discovery, or by acting as a LIS directly. To actively assist Devices, a residential gateway can either:",
      "ja": "住宅用ゲートウェイによって、この仕様のサポートは、彼らが仕えるデバイスが位置情報を取得することができることを保証します。多くの場合、レジデンシャルゲートウェイは、DHCPを使用して機能デバイスを構成します。レジデンシャルゲートウェイは、自分の位置情報へのアクセスを獲得するにはデバイスを支援するためにDHCPを使用することができます。これは、直接LISとして作用することにより、LISの発見に適したアクセスネットワークドメイン名DHCPオプションを提供することによって達成することができます。積極的にデバイスを支援するために、住宅用ゲートウェイのいずれかを実行できます。"
    },
    {
      "indent": 3,
      "text": "o acquire an access network domain name from the access network provider (possibly using DHCP) and pass the resulting value to Devices; or",
      "ja": "O（おそらくDHCPを使用して）アクセスネットワークプロバイダからアクセス・ネットワーク・ドメイン名を取得し、デバイスに得られた値を渡します。または"
    },
    {
      "indent": 3,
      "text": "o discover a LIS on its external interface, then provide Devices with the domain name that was used to successfully discover the LIS; or",
      "ja": "Oして正常LISを発見するために使用されたドメイン名を持つデバイスを提供し、その外部インターフェイス上のLISを発見。または"
    },
    {
      "indent": 3,
      "text": "o explicitly include configuration that refers to a particular LIS; or",
      "ja": "O明示的に特定のLISを指す構成を含みます。または"
    },
    {
      "indent": 3,
      "text": "o act as a LIS and directly provide location information to the Devices it serves, including providing a means to discover this service.",
      "ja": "O LISとして作用し、直接サービスを発見するための手段を提供することを含む、それが機能するデバイスに位置情報を提供します。"
    },
    {
      "indent": 3,
      "text": "As with Devices, configuration of a specific domain name or location information is only accurate as long as the residential gateway does not move. If a residential gateway that relies on configuration rather than automatic discovery is moved, the Devices it serves could be provided with inaccurate information. Devices could be led to discover a LIS that is unable to provide accurate location information, or -- if location is configured on the residential gateway -- the residential gateway could provide incorrect location information.",
      "ja": "デバイスと同様に、特定のドメイン名や位置情報の構成は限りレジデンシャルゲートウェイが動かないようにのみ正確です。自動検出ではなく、コンフィギュレーションに依存している住宅用ゲートウェイが移動された場合、それが機能デバイスは、不正確な情報を提供することができます。場所は、レジデンシャルゲートウェイ上で設定されている場合 -   - レジデンシャルゲートウェイは間違った位置情報を提供できるデバイスは、あるいは正確な位置情報を提供することができないLISを発見するために導くことができました。"
    },
    {
      "indent": 0,
      "text": "2.2. Virtual Private Networks (VPNs)",
      "section_title": true,
      "ja": "2.2. 仮想プライベートネットワーク（VPN）"
    },
    {
      "indent": 3,
      "text": "A Device MUST NOT attempt LIS discovery over a VPN network interface until it has attempted and failed to perform discovery on all other non-VPN interfaces. A Device MAY perform discovery over a VPN network interface if it has first attempted discovery on non-VPN interfaces, but a LIS discovered in this way is unlikely to have the information necessary to determine an accurate location.",
      "ja": "それが試みられ、他のすべての非VPNインターフェイスで検出を実行するために失敗するまでデバイスがVPNネットワークインタフェースを介してLISの発見を試みてはなりません。それが最初の非VPNインターフェイス上の発見を試みたが、LISは、このようにして発見された場合、デバイスは、VPNネットワークインタフェースを介して検出を実行するかもしれ正確な位置を決定するのに必要な情報を持っている可能性は低いです。"
    },
    {
      "indent": 3,
      "text": "Not all interfaces connected to a VPN can be detected by Devices or the software running on them. In these cases, it might be that a LIS on the remote side of a VPN is inadvertently discovered. A LIS provides a \"notLocatable\" error code in response to a request that it is unable to fulfill (see [RFC5985], Section 6.3). This ensures that even if a Device discovers a LIS over the VPN, it does not rely on a LIS that is unable to provide accurate location information.",
      "ja": "VPNに接続されていないすべてのインターフェイスは、デバイスまたはそれらの上で実行されるソフトウェアによって検出することができます。これらの例では、VPNのリモート側のLISが不注意に発見されていることかもしれません。 LISは、（[RFC5985]、セクション6.3を参照）を満たすことができないことを要求に応じて、「notLocatable」エラー・コードを提供します。これは、デバイスがVPN経由LISを発見した場合でも、それは正確な位置情報を提供することができないLISに依存しないことを保証します。"
    },
    {
      "indent": 0,
      "text": "3. Determining a Domain Name",
      "section_title": true,
      "ja": "3.ドメイン名の決定"
    },
    {
      "indent": 3,
      "text": "DHCP provides a direct means for the access network provider to configure a Device. The access network domain name option identifies a domain name that is suitable for service discovery within the access network. This domain name is used as input to the U-NAPTR resolution process for LIS discovery.",
      "ja": "DHCPは、デバイスを設定するには、アクセスネットワークプロバイダのための直接的な手段を提供します。アクセスネットワークドメイン名オプションは、アクセスネットワーク内のサービス発見のために適しているドメイン名を識別します。このドメイン名は、LIS発見のためのU-NAPTR解決プロセスへの入力として使用されます。"
    },
    {
      "indent": 3,
      "text": "The domain name provided in this option is one owned by the access network operator. This domain name is intended for use in discovering services within the access network.",
      "ja": "このオプションで提供ドメイン名は、アクセスネットワークオペレータが所有するものです。このドメイン名は、アクセスネットワーク内のサービスを発見して使用することを意図しています。"
    },
    {
      "indent": 3,
      "text": "This document registers a DHCP option for the access network domain name for both IPv4 and IPv6.",
      "ja": "この文書では、IPv4とIPv6の両方のためのアクセスネットワークのドメイン名のDHCPオプションを登録します。"
    },
    {
      "indent": 0,
      "text": "3.1. Domain Name Encoding",
      "section_title": true,
      "ja": "3.1. ドメイン名のエンコーディング"
    },
    {
      "indent": 3,
      "text": "This section describes the encoding of the domain name used in the DHCPv4 option defined in Section 3.2 and also used in the DHCPv6 option defined in Section 3.3.",
      "ja": "このセクションでは、3.2節で定義されたDHCPv4オプションで使用され、また、3.3節で定義されたDHCPv6のオプションで使用されるドメイン名のエンコーディングを記述しています。"
    },
    {
      "indent": 3,
      "text": "The domain name is encoded according to Section 3.1 of [RFC1035]. Each label is represented as a one-octet length field followed by that number of octets. Since every domain name ends with the null label of the root, a domain name is terminated by a length byte of zero. The high-order two bits of every length octet MUST be zero, and the remaining six bits of the length field limit the label to 63 octets or less. To simplify implementations, the total length of a domain name (i.e., label octets and label length octets) is restricted to 255 octets or less.",
      "ja": "ドメイン名は、[RFC1035]のセクション3.1に従って符号化されます。各ラベルは、オクテットの数続く1オクテットの長さフィールドとして表されます。すべてのドメイン名がルートのヌルラベルで終わるので、ドメイン名はゼロの長さバイトで終了します。すべての長さオクテットの上位2ビットはゼロでなければならない、と長さフィールドの残りの6ビットは、63オクテット以下にラベルを制限します。実装を簡単にするために、ドメイン名（すなわち、ラベルオクテットとラベル長オクテット）の全長は255オクテット以下に制限されています。"
    },
    {
      "indent": 3,
      "text": "For example, the domain \"example.com.\" is encoded in 13 octets as:",
      "ja": "たとえば、ドメインが「example.com。」ように13オクテットで符号化されます。"
    },
    {
      "indent": 6,
      "text": "+---+---+---+---+---+---+---+---+---+---+---+---+---+\n| 7 | e | x | a | m | p | l | e | 3 | c | o | m | 0 |\n+---+---+---+---+---+---+---+---+---+---+---+---+---+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Note that the length field in either option represents the length of the entire domain name encoding, whereas the length fields in the domain name encoding is the length of a single domain name label.",
      "ja": "ドメイン名のエンコーディングの長さフィールドは、単一のドメイン名ラベルの長さであるのに対し、いずれかのオプションの長さフィールドは、全体のドメイン名のエンコーディングの長さを表すことに留意されたいです。"
    },
    {
      "indent": 0,
      "text": "3.2. Access Network Domain Name DHCPv4 Option",
      "section_title": true,
      "ja": "3.2. アクセスネットワークドメイン名のDHCPv4オプション"
    },
    {
      "indent": 3,
      "text": "This section defines a DHCP for IPv4 (DHCPv4) option for the domain name associated with the access network.",
      "ja": "このセクションでは、アクセスネットワークに関連付けられているドメイン名のIPv4（DHCPv4の）オプションのDHCPを定義します。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Code      |   Length      |  Access Network Domain Name   .\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n.            Access Network Domain Name (cont.)                 .\n.                              ...                              .\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 12,
      "text": "Figure 2: Access Network Domain Name DHCPv4 Option",
      "ja": "図2：アクセスネットワークドメイン名のDHCPv4オプション"
    },
    {
      "indent": 3,
      "text": "option-code: OPTION_V4_ACCESS_DOMAIN (213).",
      "ja": "オプションコード：OPTION_V4_ACCESS_DOMAIN（213）。"
    },
    {
      "indent": 3,
      "text": "option-length: The length of the entire access network domain name option in octets.",
      "ja": "オプションの長さ：オクテットで、全体のアクセスネットワークドメイン名オプションの長さ。"
    },
    {
      "indent": 3,
      "text": "option-value: The domain name associated with the access network, encoded as described in Section 3.1.",
      "ja": "オプション値：3.1節で説明したようにエンコードされたアクセスネットワークに関連付けられているドメイン名、。"
    },
    {
      "indent": 3,
      "text": "A DHCPv4 client MAY request an access network domain name option in a Parameter Request List option, as described in [RFC2131].",
      "ja": "DHCPv4クライアントは[RFC2131]で説明したように、パラメータ要求一覧オプションにアクセスネットワークドメイン名オプションを要求することができます。"
    },
    {
      "indent": 3,
      "text": "This option contains a single domain name and, as such, MUST contain precisely one root label.",
      "ja": "このオプションは、単一のドメイン名が含まれており、のような、正確に1つのルートのラベルを含まなければなりません。"
    },
    {
      "indent": 0,
      "text": "3.3. Access Network Domain Name DHCPv6 Option",
      "section_title": true,
      "ja": "3.3. アクセスネットワークドメイン名DHCPv6のオプション"
    },
    {
      "indent": 3,
      "text": "This section defines a DHCP for IPv6 (DHCPv6) option for the domain name associated with the access network. The DHCPv6 option for this parameter is similarly formatted to the DHCPv4 option.",
      "ja": "このセクションでは、アクセスネットワークに関連付けられているドメイン名のIPv6（DHCPv6の）オプションのDHCPを定義します。このパラメータのDHCPv6のオプションは、同様のDHCPv4オプションにフォーマットされます。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|    OPTION_V6_ACCESS_DOMAIN    |           Length              |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n.                  Access Network Domain Name                   .\n.                              ...                              .\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 12,
      "text": "Figure 3: DHCPv6 Access Network Domain Name Option",
      "ja": "図3：DHCPv6のアクセスネットワークドメイン名オプション"
    },
    {
      "indent": 3,
      "text": "option-code: OPTION_V6_ACCESS_DOMAIN (57).",
      "ja": "オプションコード：OPTION_V6_ACCESS_DOMAIN（57）。"
    },
    {
      "indent": 3,
      "text": "option-length: The length of the entire access network domain name option in octets.",
      "ja": "オプションの長さ：オクテットで、全体のアクセスネットワークドメイン名オプションの長さ。"
    },
    {
      "indent": 3,
      "text": "option-value: The domain name associated with the access network, encoded as described in Section 3.1.",
      "ja": "オプション値：3.1節で説明したようにエンコードされたアクセスネットワークに関連付けられているドメイン名、。"
    },
    {
      "indent": 3,
      "text": "A DHCPv6 client MAY request an access network domain name option in an Options Request Option (ORO), as described in [RFC3315].",
      "ja": "[RFC3315]で説明したようにDHCPv6クライアントは、オプション要求オプション（ORO）で、アクセスネットワークドメイン名オプションを要求することができます。"
    },
    {
      "indent": 3,
      "text": "This option contains a single domain name and, as such, MUST contain precisely one root label.",
      "ja": "このオプションは、単一のドメイン名が含まれており、のような、正確に1つのルートのラベルを含まなければなりません。"
    },
    {
      "indent": 0,
      "text": "3.4. Alternative Domain Names",
      "section_title": true,
      "ja": "3.4. 代替ドメイン名"
    },
    {
      "indent": 3,
      "text": "The U-NAPTR resolution method described requires a domain name as input. The access network domain name DHCP options (Sections 3.2 and 3.3) are one source of this domain name.",
      "ja": "説明U-NAPTR解決方法は、入力として、ドメイン名を必要とします。アクセスネットワークドメイン名DHCPオプション（セクション3.2および3.3）は、このドメイン名の一つのソースです。"
    },
    {
      "indent": 3,
      "text": "If a Device knows one or more alternative domain names that might be used for discovery, it MAY repeat the U-NAPTR process using those domain names as input. For instance, static configuration of a Device might be used to provide a Device with a domain name.",
      "ja": "デバイスを発見するために使用されるかもしれない1つ以上の代替ドメイン名を知っている場合、それは、入力として、これらのドメイン名を使用してU-NAPTRプロセスを繰り返してもよいです。例えば、デバイスの静的な構成は、ドメイン名でデバイスを提供するために使用される可能性があります。"
    },
    {
      "indent": 3,
      "text": "DHCPv4 option 15 [RFC2132] provides an indication of the domain name that a host uses when resolving hostnames in DNS. This option is used when the DHCPv4 access domain name is not available.",
      "ja": "DHCPv4のオプション15は、[RFC2132]はDNSでホスト名を解決するときにホストが使用するドメイン名の表示を提供します。 DHCPv4のアクセスドメイン名が利用できない場合に、このオプションは使用されています。"
    },
    {
      "indent": 3,
      "text": "DHCPv4 option 15 might not be suitable for some network deployments. For instance, a global enterprise could operate multiple sites, with Devices at all sites using the same value for option 15. In this type of deployment, it might be desirable to discover a LIS local to a site. The access domain name option can be given a different value at each site to enable discovery of a LIS at that site.",
      "ja": "DHCPv4のオプション15は、いくつかのネットワークの展開に適していない可能性があります。たとえば、グローバル企業は、このタイプの配置でオプション15に同じ値を使用して、すべてのサイトでのデバイスと、サイトへのローカルLISを発見するのが望ましいかもしれないが、複数のサイトを動作することができます。アクセスドメイン名オプションは、そのサイトでのLISの発見を可能にするために、各サイトで異なる値を与えることができます。"
    },
    {
      "indent": 3,
      "text": "Alternative domain names MUST NOT be used unless the access network domain name option is unsuccessful or where external information indicates that a particular domain name is to be used.",
      "ja": "アクセスネットワークドメイン名オプションが失敗した場合や、外部の情報は、特定のドメイン名が使用されることを示していない限り代替ドメイン名を使用してはいけません。"
    },
    {
      "indent": 3,
      "text": "Other domain names might be provided by a DHCP server (for example, [RFC4702] for DHCPv4, [RFC4704] for DHCPv6). However, these domain names could be provided without considering their use for LIS discovery; therefore, it is not likely that these other domain names contain useful values.",
      "ja": "他のドメイン名は、DHCPサーバ（DHCPv4の例えば、[RFC4702]、DHCPv6の[RFC4704]）によって提供される可能性があります。しかし、これらのドメイン名は、LISの発見のためのそれらの使用を考慮せずに提供することができます。したがって、これらの他のドメイン名が有用な値が含まれている可能性はありません。"
    },
    {
      "indent": 0,
      "text": "4. U-NAPTR Resolution of a LIS URI",
      "section_title": true,
      "ja": "4.インNAPTR LIS URIの決議"
    },
    {
      "indent": 3,
      "text": "U-NAPTR [RFC4848] resolution for a LIS takes a domain name as input and produces a URI that identifies the LIS. This process also requires an Application Service tag and an Application Protocol tag, which differentiate LIS-related NAPTR records from other records for that domain.",
      "ja": "U-NAPTR LISのために[RFC4848]の分解能は、入力として、ドメイン名を取得し、LISを識別するURIを生成します。このプロセスは、そのドメインの他のレコードからLIS関連のNAPTRレコードを区別するアプリケーションサービスタグおよびアプリケーションプロトコルタグが必要です。"
    },
    {
      "indent": 3,
      "text": "Section 6.2 defines an Application Service tag of \"LIS\", which is used to identify the location service for a given domain. The Application Protocol tag \"HELD\", defined in Section 6.3, is used to identify a LIS that understands the HELD protocol [RFC5985].",
      "ja": "セクション6.2は、特定のドメインのための位置サービスを識別するために使用される「LIS」のアプリケーション・サービス・タグを定義します。セクション6.3で定義された「開催された」アプリケーションプロトコルタグは、開催プロトコル[RFC5985]を理解LISを識別するために使用されます。"
    },
    {
      "indent": 3,
      "text": "The NAPTR records in the following example demonstrate the use of the Application Service and Protocol tags. Iterative NAPTR resolution is used to delegate responsibility for the LIS service from \"zonea.example.net.\" and \"zoneb.example.net.\" to \"outsource.example.com.\".",
      "ja": "次の例のNAPTRレコードは、アプリケーションサービスとプロトコルタグの使用方法を示しています。反復NAPTR解像度はからLISサービスの責任委任するために使用されている「zonea.example.netを。」そして \"zoneb.example.net。\" \"outsource.example.com。\" へ。"
    },
    {
      "indent": 6,
      "text": "zonea.example.net. ;; order pref flags IN NAPTR 100 10 \"\" \"LIS:HELD\" ( ; service \"\" ; regex outsource.example.com. ; replacement ) zoneb.example.net. ;; order pref flags IN NAPTR 100 10 \"\" \"LIS:HELD\" ( ; service \"\" ; regex outsource.example.com. ; replacement ) outsource.example.com. ;; order pref flags IN NAPTR 100 10 \"u\" \"LIS:HELD\" ( ; service \"!.*!https://lis.example.org:4802/?c=ex!\" ; regex . ; replacement )",
      "ja": "zonea.example.net。 ;; （。;サービス \"\";正規表現outsource.example.com;交換）zoneb.example.net：NAPTR 100 10 \"\" \"が開催されLISを\" 県旗を注文します。 ;; （。;サービス \"\";正規表現outsource.example.com;交換）outsource.example.com：NAPTR 100 10 \"\" \"が開催されLISを\" 県旗を注文します。 ;; \"（;サービス \"を開催*します。https：//lis.example.org：4802 / C = EX\";正規表現;交換！。！？！。）\" LIS NAPTR 100 10に \"U\" の県旗を注文"
    },
    {
      "indent": 14,
      "text": "Figure 4: Sample LIS:HELD Service NAPTR Records",
      "ja": "図4：サンプルLIS：HELDサービスNAPTRレコード"
    },
    {
      "indent": 3,
      "text": "Details for the \"LIS\" Application Service tag and the \"HELD\" Application Protocol tag are included in Section 6.",
      "ja": "「LIS」アプリケーション・サービス・タグおよび「開催された」アプリケーションプロトコルタグの詳細は、セクション6に含まれています。"
    },
    {
      "indent": 3,
      "text": "U-NAPTR resolution might produce multiple results from each iteration of the algorithm. Order and preference values in the NAPTR record determine which value is chosen. A Device MAY attempt to use alternative choices if the first choice is not successful. However, if a request to the resulting URI produces a HELD \"notLocatable\" response, or equivalent, the Device SHOULD NOT attempt to use any alternative choices from the same domain name.",
      "ja": "U-NAPTR分解能は、アルゴリズムの各反復からの複数の結果を生成する可能性があります。 NAPTRレコードの順序と優先値が選択される値を決定します。デバイスは、最初の選択肢が成功しなかった場合、代替の選択肢を使用しようとするかもしれません。結果のURIへのリクエストが開催された「notLocatable」応答、または同等のものを生産する場合は、デバイスは、同じドメイン名から任意の代替選択肢を使用することを試みるべきではありません。"
    },
    {
      "indent": 3,
      "text": "An HTTPS LIS URI that is a product of U-NAPTR MUST be authenticated using the domain name method described in Section 3.1 of RFC 2818 [RFC2818]. The domain name that is used in this authentication is the one extracted from the URI, not the one that was input to the U-NAPTR resolution process.",
      "ja": "U-NAPTRの積であるHTTPS LIS URIは、RFC 2818 [RFC2818]のセクション3.1に記載のドメイン名の方法を使用して認証されなければなりません。この認証で使用されているドメイン名は、URIから抽出された1ではなく、U-NAPTR解決プロセスに入力されたものです。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "The address of a LIS is usually well-known within an access network; therefore, interception of messages does not introduce any specific concerns.",
      "ja": "LISのアドレスは、通常、アクセスネットワーク内でよく知られています。そのため、メッセージの傍受は、任意の特定の懸念を導入していません。"
    },
    {
      "indent": 3,
      "text": "The primary attack against the methods described in this document is one that would lead to impersonation of a LIS. The LIS is responsible for providing location information, and this information is critical to a number of network services; furthermore, a Device does not necessarily have a prior relationship with a LIS. Several methods are described here that can limit the probability of, or provide some protection against, such an attack. These methods MUST be applied unless similar protections are in place, or in cases -- such as an emergency -- where location information of dubious origin is arguably better than none at all.",
      "ja": "この文書に記載された方法に対する一次攻撃はLISの偽装につながるものです。 LISは、位置情報を提供する責任があり、この情報には、ネットワークサービスの数に重要です。さらに、デバイスは必ずしもLISとの事前の関係はありません。いくつかの方法がある確率を制限し、またはそのような攻撃に対するいくつかの保護を提供できるよう、ここで説明されています。これらの方法は、同様の保護が適所にない限り適用され、または場合でなければなりません - 疑わしい原点の位置情報が全く間違いなくどれよりも優れている - そのような緊急事態として。"
    },
    {
      "indent": 3,
      "text": "An attacker could attempt to compromise LIS discovery at any of three stages:",
      "ja": "攻撃者は、3つの段階のいずれかでLIS発見を侵害しようとする可能性があり："
    },
    {
      "indent": 3,
      "text": "1. providing a falsified domain name to be used as input to U-NAPTR",
      "section_title": true,
      "ja": "1. U-NAPTRへの入力として使用される偽造ドメイン名を提供"
    },
    {
      "indent": 3,
      "text": "2. altering the DNS records used in U-NAPTR resolution",
      "section_title": true,
      "ja": "2. U-NAPTR解決に使用されるDNSレコードを変更します"
    },
    {
      "indent": 3,
      "text": "3. impersonating the LIS",
      "section_title": true,
      "ja": "3. LISを偽装"
    },
    {
      "indent": 3,
      "text": "The domain name that used to authenticate the LIS is the domain name input to the U-NAPTR process, not the output of that process [RFC3958], [RFC4848]. As a result, the results of DNS queries do not need integrity protection.",
      "ja": "LISを認証するために使用されるドメイン名は、U-NAPTRプロセスにドメイン名入力ではなく、そのプロセスの出力[RFC3958]、[RFC4848]です。その結果、DNSクエリの結果は、完全性保護を必要としません。"
    },
    {
      "indent": 3,
      "text": "An HTTPS URI is authenticated using the method described in Section 3.1 of [RFC2818]. HTTP client implementations frequently do not provide a means to authenticate based on a domain name other than the one indicated in the request URI, namely the U-NAPTR output. To avoid having to authenticate the LIS with a domain name that is different from the one used to identify it, a client MAY choose to reject URIs that contain a domain name that is different to the U-NAPTR input. To support endpoints that enforce the above restriction on URIs, network administrators SHOULD ensure that the domain name in the DHCP option is the same as the one contained in the resulting URI.",
      "ja": "HTTPS URIは、[RFC2818]のセクション3.1に記載した方法を使用して認証されます。 HTTPクライアントの実装は、頻繁にリクエストURI、すなわちU-NAPTR出力に示されているもの以外のドメイン名に基づいて認証するための手段を提供していません。それを識別するために使用されるものとは異なるドメイン名でLISを認証することを避けるために、クライアントは、U-NAPTR入力に異なるドメイン名を含むURIを拒否することを選ぶかもしれません。 URIの上に上記制限を強制エンドポイントをサポートするために、ネットワーク管理者は、DHCPオプションのドメイン名が得られたURIに含まれているものと同じであることを確実にすべきです。"
    },
    {
      "indent": 3,
      "text": "Authentication of a LIS relies on the integrity of the domain name acquired from DHCP. An attacker that is able to falsify a domain name circumvents the protections provided. To ensure that the access network domain name DHCP option can be relied upon, preventing DHCP messages from being modified or spoofed by attackers is necessary. Physical- or link-layer security are commonly used to reduce the possibility of such an attack within an access network. DHCP authentication [RFC3118] might also provide a degree of protection against modification or spoofing.",
      "ja": "LISの認証はDHCPから取得したドメイン名の整合性に依存しています。ドメイン名を改ざんすることができ、攻撃者は、提供の保護を回避します。アクセスネットワークドメイン名DHCPオプションが攻撃者によって変更またはスプーフィングされてからのDHCPメッセージを防止し、頼ることができることを確実にするために必要です。 Physical-またはリンク層のセキュリティは、一般的に、アクセスネットワーク内でこのような攻撃の可能性を減らすために使用されています。 DHCP認証[RFC3118]も変更またはなりすましに対する保護の程度を提供するかもしれません。"
    },
    {
      "indent": 3,
      "text": "A LIS that is identified by an HTTP URI cannot be authenticated. Use of unsecured HTTP also does not meet requirements in HELD for confidentiality and integrity. If an HTTP URI is the product of LIS discovery, this leaves Devices vulnerable to several attacks. Lower-layer protections, such as Layer 2 traffic separation might be used to provide some guarantees.",
      "ja": "HTTP URIで識別されるLISは認証できません。無担保HTTPの使用は、機密性と整合性保持の要求事項を満たしていません。 HTTP URIは、LISの発見の産物である場合、これはいくつかの攻撃に対して脆弱デバイスを残します。そのようなレイヤ2トラフィックの分離などの下位層の保護は、いくつかの保証を提供するために使用される可能性があります。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAの考慮事項"
    },
    {
      "indent": 0,
      "text": "6.1. Registration of DHCPv4 and DHCPv6 Option Codes",
      "section_title": true,
      "ja": "6.1.  DHCPv4とDHCPv6のオプションコードの登録"
    },
    {
      "indent": 3,
      "text": "The IANA has assigned an option code of 213 for the DHCPv4 option for an access network domain name option, as described in Section 3.2 of this document.",
      "ja": "このドキュメントのセクション3.2で説明したようにIANAは、アクセスネットワークドメイン名オプションのためのDHCPv4オプションの213のオプションコードが割り当てられています。"
    },
    {
      "indent": 3,
      "text": "The IANA has assigned an option code of 57 for the DHCPv6 option for an access network domain name option, as described in Section 3.3 of this document.",
      "ja": "このドキュメントのセクション3.3で説明したようにIANAは、アクセスネットワークドメイン名オプションのためのDHCPv6オプションのための57のオプションコードが割り当てられています。"
    },
    {
      "indent": 0,
      "text": "6.2. Registration of a Location Server Application Service Tag",
      "section_title": true,
      "ja": "6.2. ロケーションサーバアプリケーションサービスタグの登録"
    },
    {
      "indent": 3,
      "text": "This section registers a new S-NAPTR/U-NAPTR Application Service tag for LIS, as mandated by [RFC3958].",
      "ja": "[RFC3958]で義務付けられ、このセクションでは、LISのための新たなS-NAPTR / U-NAPTRアプリケーションサービスタグを登録します。"
    },
    {
      "indent": 3,
      "text": "Application Service Tag: LIS",
      "ja": "アプリケーション・サービス・タグ：LIS"
    },
    {
      "indent": 3,
      "text": "Intended usage: Identifies a service that provides a Device with its location information.",
      "ja": "使用目的：その位置情報をデバイスに提供するサービスを識別する。"
    },
    {
      "indent": 3,
      "text": "Defining publication: RFC 5986",
      "ja": "定義出版：RFC 5986"
    },
    {
      "indent": 3,
      "text": "Related publications: HELD [RFC5985]",
      "ja": "関連資料：HELD [RFC5985]"
    },
    {
      "indent": 3,
      "text": "Contact information: The authors of this document",
      "ja": "連絡先情報：この文書の著者"
    },
    {
      "indent": 3,
      "text": "Author/Change controller: The IESG",
      "ja": "著者/変更コントローラ：IESG"
    },
    {
      "indent": 0,
      "text": "6.3. Registration of a Location Server Application Protocol Tag for HELD",
      "ja": "6.3.  HELDのための場所サーバーアプリケーションプロトコルタグの登録"
    },
    {
      "indent": 3,
      "text": "This section registers a new S-NAPTR/U-NAPTR Application Protocol tag for the HELD protocol [RFC5985], as mandated by [RFC3958].",
      "ja": "[RFC3958]で義務付けられ、このセクションでは、HELDプロトコル[RFC5985]のための新たなS-NAPTR / U-NAPTRアプリケーションプロトコルタグを登録します。"
    },
    {
      "indent": 3,
      "text": "Application Protocol Tag: HELD",
      "ja": "アプリケーションプロトコルタグ：HELD"
    },
    {
      "indent": 3,
      "text": "Intended Usage: Identifies the HELD protocol.",
      "ja": "使用目的：HELDプロトコルを識別します。"
    },
    {
      "indent": 3,
      "text": "Applicable Service Tag(s): LIS",
      "ja": "該当するサービスタグ（S）：LIS"
    },
    {
      "indent": 3,
      "text": "Terminal NAPTR Record Type(s): U",
      "ja": "ターミナルNAPTRレコードタイプ（S）：U"
    },
    {
      "indent": 3,
      "text": "Defining Publication: RFC 5986",
      "ja": "定義出版：RFC 5986"
    },
    {
      "indent": 3,
      "text": "Related Publications: HELD [RFC5985]",
      "ja": "関連資料：HELD [RFC5985]"
    },
    {
      "indent": 3,
      "text": "Contact Information: The authors of this document",
      "ja": "お問い合わせ先：このドキュメントの作者"
    },
    {
      "indent": 3,
      "text": "Author/Change Controller: The IESG",
      "ja": "著者/変更コントローラ：IESG"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgements",
      "section_title": true,
      "ja": "7.謝辞"
    },
    {
      "indent": 3,
      "text": "This document uses a mechanism that is largely identical to that in [RFC5222] and [RFC5223]. The authors would like to thank Leslie Daigle for her work on U-NAPTR; Peter Koch for feedback on how not to use DNS for discovery; Andy Newton for constructive suggestions with regards to document direction; Richard Barnes, Joe Salowey, Barbara Stark, and Hannes Tschofenig for input and reviews; and Dean Willis for constructive feedback.",
      "ja": "このドキュメントは[RFC5222]及び[RFC5223]のものとほぼ同一であるメカニズムを使用します。著者は、U-NAPTRの彼女の仕事のためレスリーDaigle氏に感謝したいと思います。発見のためにDNSを使用しない方法についてのフィードバックのためのピーター・コッホ。文書方向へに関して建設的な提案のためのアンディ・ニュートン。入力およびレビューのためのリチャード・バーンズ、ジョーSalowey、バーバラ・スターク、およびハンネスTschofenig。建設的なフィードバックのためのディーンウィリス。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8.参照文献"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "ja": "8.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC1035] Mockapetris, P., \"Domain names - implementation and specification\", STD 13, RFC 1035, November 1987.",
      "ja": "[RFC1035] Mockapetris、P.、 \"ドメイン名 - 実装及び仕様\"、STD 13、RFC 1035、1987年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2131] Droms, R., \"Dynamic Host Configuration Protocol\", RFC 2131, March 1997.",
      "ja": "[RFC2131] Droms、R.、 \"動的ホスト構成プロトコル\"、RFC 2131、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2132] Alexander, S. and R. Droms, \"DHCP Options and BOOTP Vendor Extensions\", RFC 2132, March 1997.",
      "ja": "[RFC2132]アレクサンダー、S.とR. Droms、 \"DHCPオプションとBOOTPベンダー拡張機能\"、RFC 2132、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2616] Fielding, R., Gettys, J., Mogul, J., Frystyk, H., Masinter, L., Leach, P., and T. Berners-Lee, \"Hypertext Transfer Protocol -- HTTP/1.1\", RFC 2616, June 1999.",
      "ja": "[RFC2616]フィールディング、R.、ゲティス、J.、モーグル、J.、Frystyk、H.、Masinter、L.、リーチ、P.、およびT.バーナーズ - リー、 \"ハイパーテキスト転送プロトコル -  HTTP / 1.1\" 、RFC 2616、1999年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC2818] Rescorla, E., \"HTTP Over TLS\", RFC 2818, May 2000.",
      "ja": "[RFC2818]レスコラ、E.、 \"TLSオーバーHTTP\"、RFC 2818、2000年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC3315] Droms, R., Bound, J., Volz, B., Lemon, T., Perkins, C., and M. Carney, \"Dynamic Host Configuration Protocol for IPv6 (DHCPv6)\", RFC 3315, July 2003.",
      "ja": "[RFC3315] Droms、R.、バウンド、J.、フォルツ、B.、レモン、T.、パーキンス、C.、およびM.カーニー、 \"IPv6のための動的ホスト構成プロトコル（DHCPv6）\"、RFC 3315、2003年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC4033] Arends, R., Austein, R., Larson, M., Massey, D., and S. Rose, \"DNS Security Introduction and Requirements\", RFC 4033, March 2005.",
      "ja": "[RFC4033]アレンズ、R.、Austeinと、R.、ラーソン、M.、マッシー、D.、およびS.ローズ、 \"DNSセキュリティ序論と要件\"、RFC 4033、2005年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC4702] Stapp, M., Volz, B., and Y. Rekhter, \"The Dynamic Host Configuration Protocol (DHCP) Client Fully Qualified Domain Name (FQDN) Option\", RFC 4702, October 2006.",
      "ja": "[RFC4702]スタップ、M.、フォルツ、B.、およびY. Rekhter、 \"動的ホスト構成プロトコル（DHCP）クライアント完全修飾ドメイン名（FQDN）オプション\"、RFC 4702、2006年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC4704] Volz, B., \"The Dynamic Host Configuration Protocol for IPv6 (DHCPv6) Client Fully Qualified Domain Name (FQDN) Option\", RFC 4704, October 2006.",
      "ja": "[RFC4704]フォルツ、B.、 \"IPv6の動的ホスト構成プロトコル（DHCPv6）クライアント完全修飾ドメイン名（FQDN）オプション\"、RFC 4704、2006年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC4848] Daigle, L., \"Domain-Based Application Service Location Using URIs and the Dynamic Delegation Discovery Service (DDDS)\", RFC 4848, April 2007.",
      "ja": "[RFC4848] Daigle氏、L.、 \"ドメインベースのアプリケーションサービスの場所のURIを使用し、ダイナミックな委譲発見サービス（DDDS）\"、RFC 4848、2007年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC5985] Barnes, M., Ed., \"HTTP-Enabled Location Delivery (HELD)\", RFC 5985, September 2010.",
      "ja": "[RFC5985]バーンズ、M.、エド。、 \"HTTP対応の場所の配達（保持）\"、RFC 5985、2010年9月。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "ja": "8.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC3118] Droms, R. and W. Arbaugh, \"Authentication for DHCP Messages\", RFC 3118, June 2001.",
      "ja": "[RFC3118] Droms、R.とW. Arbaugh、 \"DHCPメッセージの認証\"、RFC 3118、2001年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC3693] Cuellar, J., Morris, J., Mulligan, D., Peterson, J., and J. Polk, \"Geopriv Requirements\", RFC 3693, February 2004.",
      "ja": "[RFC3693]クエリャル、J.、モリス、J.、マリガン、D.、ピーターソン、J.、およびJ.ポーク、 \"Geopriv要件\"、RFC 3693、2004年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC3958] Daigle, L. and A. Newton, \"Domain-Based Application Service Location Using SRV RRs and the Dynamic Delegation Discovery Service (DDDS)\", RFC 3958, January 2005.",
      "ja": "[RFC3958] Daigle氏、L.とA.ニュートン、RFC 3958、2005年1月 \"SRVのRRを使用したアプリケーションサービスの場所とダイナミックな委譲発見サービス（DDDS）をドメインベース\"。"
    },
    {
      "indent": 3,
      "text": "[RFC5222] Hardie, T., Newton, A., Schulzrinne, H., and H. Tschofenig, \"LoST: A Location-to-Service Translation Protocol\", RFC 5222, August 2008.",
      "ja": "[RFC5222]ハーディ、T.、ニュートン、A.、Schulzrinneと、H.、およびH. Tschofenig、 \"失われた：場所・ツー・サービス翻訳・プロトコル\"、RFC 5222、2008年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC5223] Schulzrinne, H., Polk, J., and H. Tschofenig, \"Discovering Location-to-Service Translation (LoST) Servers Using the Dynamic Host Configuration Protocol (DHCP)\", RFC 5223, August 2008.",
      "ja": "[RFC5223] Schulzrinneと、H.、ポーク、J.、およびH. Tschofenig、RFC 5223、2008年8月 \"動的ホスト構成プロトコルを（DHCP）を使用する場所・ツー・サービス翻訳（LOST）サーバーの検出\"。"
    },
    {
      "indent": 3,
      "text": "[RFC5687] Tschofenig, H. and H. Schulzrinne, \"GEOPRIV Layer 7 Location Configuration Protocol: Problem Statement and Requirements\", RFC 5687, March 2010.",
      "ja": "[RFC5687] Tschofenig、H.およびH. Schulzrinneと、 \"GEOPRIVレイヤ7場所構成プロトコル：問題文と要件\"、RFC 5687、2010年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC5808] Marshall, R., \"Requirements for a Location-by-Reference Mechanism\", RFC 5808, May 2010.",
      "ja": "[RFC5808]マーシャル、R.、 \"場所・バイ・リファレンス・メカニズムのための要件\"、RFC 5808、2010年5月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Martin Thomson Andrew Corporation Andrew Building (39) Wollongong University Campus Northfields Avenue Wollongong, NSW 2522 AU",
      "ja": "マーティン・トムソンアンドリュー・コーポレーションアンドリュービル（39）ウーロンゴン大学キャンパスNorthfieldsアベニューウロンゴン、NSW 2522 AU"
    },
    {
      "indent": 3,
      "text": "Phone: +61 2 4221 2915 EMail: martin.thomson@andrew.com",
      "ja": "電話：+61 2 4221 2915 Eメール：martin.thomson@andrew.com"
    },
    {
      "indent": 3,
      "text": "James Winterbottom Andrew Corporation Andrew Building (39) Wollongong University Campus Northfields Avenue Wollongong, NSW 2522 AU",
      "ja": "ジェームズ・ウィンターボトムアンドリュー・コーポレーションアンドリュービル（39）ウーロンゴン大学キャンパスNorthfieldsアベニューウロンゴン、NSW 2522 AU"
    },
    {
      "indent": 3,
      "text": "Phone: +61 2 4221 2938 EMail: james.winterbottom@andrew.com",
      "ja": "電話：+61 2 4221 2938 Eメール：james.winterbottom@andrew.com"
    }
  ]
}