{
  "title": {
    "text": "RFC 5752 - Multiple Signatures in Cryptographic Message Syntax (CMS)",
    "ja": "RFC 5752 - 暗号メッセージ構文（CMS）で複数の署名"
  },
  "number": 5752,
  "created_at": "2019-10-28 09:10:35.235017+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         S. Turner\nRequest for Comments: 5752                                          IECA\nCategory: Standards Track                                      J. Schaad\nISSN: 2070-1721                                             Soaring Hawk\n                                                            January 2010",
      "raw": true
    },
    {
      "indent": 7,
      "text": "Multiple Signatures in Cryptographic Message Syntax (CMS)",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "Cryptographic Message Syntax (CMS) SignedData includes the SignerInfo structure to convey per-signer information. SignedData supports multiple signers and multiple signature algorithms per signer with multiple SignerInfo structures. If a signer attaches more than one SignerInfo, there are concerns that an attacker could perform a downgrade attack by removing the SignerInfo(s) with the 'strong' algorithm(s). This document defines the multiple-signatures attribute, its generation rules, and its processing rules to allow signers to convey multiple SignerInfo objects while protecting against downgrade attacks. Additionally, this attribute may assist during periods of algorithm migration.",
      "ja": "暗号メッセージ構文（CMS）のSignedDataごとの署名者情報を伝達するためのSignerInfo構造を含みます。 SignedDataは、複数の署名者と複数のSignerInfo構造を持つ署名者ごとに複数の署名アルゴリズムをサポートしています。署名者が複数のSignerInfoを添付した場合、攻撃者は「強い」アルゴリズム（複数可）とのSignerInfo（複数可）を除去することにより、ダウングレード攻撃を行う可能性が懸念されています。この文書では、署名者がダウングレード攻撃から保護しながら、複数のSignerInfoオブジェクトを伝えることができるように複数のシグネチャの属性、その生成規則、及びその処理規則を定義します。また、この属性は、アルゴリズムの移行期間中に助けることができます。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc5752.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc5752で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2010 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2010 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 3,
      "text": "This document may contain material from IETF Documents or IETF Contributions published or made publicly available before November 10, 2008. The person(s) controlling the copyright in some of this material may not have granted the IETF Trust the right to allow modifications of such material outside the IETF Standards Process. Without obtaining an adequate license from the person(s) controlling the copyright in such materials, this document may not be modified outside the IETF Standards Process, and derivative works of it may not be created outside the IETF Standards Process, except to format it for publication as an RFC or to translate it into languages other than English.",
      "ja": "この材料の一部がIETFトラストにこのような材料の変更を許可する権利を与えられていない可能性がありますにこの文書は、2008年、IETFドキュメントまたは11月10日以前に発行または公開さIETF貢献から著作権を支配する者（複数可）材料を含んでいてもよいですIETF標準化プロセスの外。そのような材料の著作権を管理者（単数または複数）から適切なライセンスを取得することなく、この文書は、IETF標準化過程の外側修正されないかもしれません、そして、それの派生物は、IETF標準化過程の外側に作成されない場合があり、それをフォーマットする以外出版RFCとして、英語以外の言語に翻訳します。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n   1.1. Conventions Used in This Document ..........................3\n2. Rationale .......................................................3\n   2.1. Attribute Design Requirements ..............................4\n3. Multiple Signature Indication ...................................5\n4. Message Generation and Processing ...............................6\n   4.1. SignedData Type ............................................6\n   4.2. EncapsulatedContentInfo Type ...............................7\n   4.3. SignerInfo Type ............................................7\n   4.4. Message Digest Calculation Process .........................7\n        4.4.1. multiple-signatures Signed Attribute Generation .....7\n        4.4.2. Message Digest Calculation Process ..................7\n   4.5. Signature Generation Process ...............................8\n   4.6. Signature Verification Process .............................8\n5. Signature Evaluation Processing .................................8\n   5.1. Evaluation of a SignerInfo Object ..........................9\n   5.2. Evaluation of a SignerInfo Set .............................9\n   5.3. Evaluation of a SignedData Set ............................10\n6. Security Considerations ........................................11\n7. References .....................................................11\n   7.1. Normative References ......................................11\n   7.2. Informative References ....................................12\nAppendix A. ASN.1 Module...........................................13\nAppendix B. Background.............................................15\n   B.1. Attacks....................................................15\n   B.2. Hashes in CMS..............................................15",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The Cryptographic Message Syntax (CMS; see [CMS]) defined SignerInfo to provide data necessary for relying parties to verify the signer's digital signature, which is also included in the SignerInfo structure. Signers include more than one SignerInfo in a SignedData if they use different digest or signature algorithms. Each SignerInfo exists independently and new SignerInfo structures can be added or existing ones removed without perturbing the remaining signatures.",
      "ja": "暗号メッセージ構文（CMS; [CMS]参照）ものSignerInfo構造に含まれている署名者のデジタル署名を検証するために依拠当事者に必要なデータを提供するためのSignerInfoを定義しました。それらは異なるダイジェスト又は署名アルゴリズムを使用する場合、署名者は、のSignedDataに複数のSignerInfoを含みます。それぞれのSignerInfoは、独立して存在し、残りの署名を乱すことなく、新規のSignerInfo構造を追加することができ、または既存のものを除去しました。"
    },
    {
      "indent": 3,
      "text": "The concern is that if an attacker successfully attacked a hash or signature algorithm, the attacker could remove all SignerInfo structures except the SignerInfo with the successfully attacked hash or signature algorithm. The relying party is then left with the attacked SignerInfo even though the relying party supported more than just the attacked hash or signature algorithm.",
      "ja": "懸念は、攻撃者がハッシュまたは署名アルゴリズムを攻撃した場合、攻撃者がハッシュまたは署名アルゴリズムを攻撃したとのSignerInfo以外のすべてのSignerInfo構造を削除する可能性があることです。依存者は、証明書利用者は、単に攻撃ハッシュまたは署名アルゴリズムよりも多くをサポートしていても攻撃のSignerInfoが残されています。"
    },
    {
      "indent": 3,
      "text": "A solution is to have signers include a pointer to all the signer's SignerInfo structures. If an attacker removes any SignerInfo, then relying parties will be aware that an attacker has removed one or more SignerInfo objects.",
      "ja": "解決策は、署名者は、すべての署名者のSignerInfo構造体へのポインタを含めることです。攻撃者が任意ののSignerInfoを削除する場合は、依拠当事者は、攻撃者が1つの以上のSignerInfoオブジェクトを削除したことに気づくであろう。"
    },
    {
      "indent": 3,
      "text": "Note that this attribute ought not be confused with the countersignature attribute (see Section 11.4 of [CMS]) as this is not intended to sign over an existing signature. Rather, it is to provide a pointer to additional signatures by the signer that are all at the same level. That is, countersignature provides a serial signature while the attribute defined herein provides pointers to parallel signatures by the same signer.",
      "ja": "これは、既存の署名の上に署名することを意図していないとして（[CMS]のセクション11.4を参照）、この属性は副署属性と混同しないべきであることに注意してください。むしろ、それは同じレベルである署名者が追加のシグネチャへのポインタを提供することです。すなわち、本明細書で定義される属性は、同じ署名者が署名を平行にポインタを提供しながら、副署シリアル署名を提供するものです。"
    },
    {
      "indent": 0,
      "text": "1.1. Conventions Used in This Document",
      "section_title": true,
      "ja": "1.1. このドキュメントの表記規則"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. Rationale",
      "section_title": true,
      "ja": "2.理由"
    },
    {
      "indent": 3,
      "text": "The rationale for this specification is to protect against downgrade attacks that remove the 'strong' signature to leave the 'weak' signature, which has presumably been successfully attacked. If a CMS SignedData object has multiple SignerInfo objects, then the attacker, whether it be Alice, Bob, or Mallory, can remove a SignerInfo object without the relying party being aware that more than one was generated.",
      "ja": "この仕様のための理論的根拠は、おそらく成功し攻撃された「弱い」署名を残すために「強い」の署名を削除ダウングレード攻撃から保護することです。 CMS SignedDataオブジェクトは、複数のSignerInfoオブジェクトを持っている場合、攻撃者は、それはアリス、ボブ、またはマロリーあるかどうか、証明書利用者が複数のが生成されたことを意識することなく、のSignerInfoオブジェクトを削除することができます。"
    },
    {
      "indent": 3,
      "text": "Removal of a SignerInfo does not render the signature invalid nor does it constitute an error. In the following scenario, a signer generates a SignedData with two SignerInfo objects, one with a 'weak' algorithm and one with a 'strong' algorithm; there are three types of relying parties:",
      "ja": "SignerInfoの除去は、無効な署名がレンダリングされません。また、エラーを構成するものでもありません。次のシナリオでは、署名者は、二つのSignerInfoオブジェクト、「弱い」アルゴリズム及び「強い」アルゴリズムを有するものとの一方とのSignedDataを生成します。依拠当事者の3つのタイプがあります。"
    },
    {
      "indent": 3,
      "text": "1) Those that support only a 'weak' algorithm. If both SignerInfo objects are present, the relying party processes the algorithm it supports. If both SignerInfo objects are not present, the relying party can easily determine that another SignerInfo has been removed, but not changed. In both cases, if the 'weak' signature verifies, the relying party MAY consider the signature valid.",
      "ja": "1）のみ「弱い」のアルゴリズムをサポートするもの。両方のSignerInfoオブジェクトが存在している場合は、証明書利用者は、それがサポートするアルゴリズムを処理します。両方のSignerInfoオブジェクトが存在しない場合、証明書利用者は簡単に別のSignerInfoが削除されたことを判断するが、変更することはできません。どちらの場合も、「弱い」署名検証場合、依存者は、署名が有効で検討することができます。"
    },
    {
      "indent": 3,
      "text": "2) Those that support only a 'strong' algorithm. If both SignerInfo objects are present, the relying party processes the algorithm it supports. If both SignerInfo objects are not present, the relying party can easily determine that another SignerInfo has been removed, but the relying party doesn't care. In both cases, if the 'strong' signature verifies, the relying party MAY consider the signature valid.",
      "ja": "2）のみ「強い」アルゴリズムをサポートするもの。両方のSignerInfoオブジェクトが存在している場合は、証明書利用者は、それがサポートするアルゴリズムを処理します。両方のSignerInfoオブジェクトが存在しない場合、証明書利用者は簡単に別のSignerInfoが削除されたことを判断することができますが、証明書利用者は気にしません。どちらの場合も、「強い」の署名検証場合、依存者は、有効な署名を考慮することができます。"
    },
    {
      "indent": 3,
      "text": "3) Those that support both a 'weak' algorithm and a 'strong' algorithm. If both SignerInfo objects are present, the relying party processes both algorithms. If both SignerInfo objects are not present, the relying party can easily determine that another SignerInfo has been removed. In both cases, if the 'strong' and/or 'weak' signatures verify, the relying party MAY consider the signature valid. (Policy may dictate that both signatures are required to validate if present.)",
      "ja": "3）「弱い」アルゴリズム及び「強い」アルゴリズムの両方をサポートするもの。両方のSignerInfoオブジェクトが存在している場合は、証明書利用者は、両方のアルゴリズムを処理します。両方のSignerInfoオブジェクトが存在しない場合、証明書利用者は簡単に別のSignerInfoが削除されたことを判断することができます。 「強い」および/または「弱い」署名が検証した場合どちらの場合も、依存者は、有効な署名を考慮することができます。 （ポリシーは、両方の署名が存在するかどうかを検証するために必要とされることを指示してもよいです。）"
    },
    {
      "indent": 3,
      "text": "Local policy MAY dictate that the removal of the 'strong' algorithm results in an invalid signature. See Section 5 for further processing.",
      "ja": "ローカルポリシーは、無効な署名で「強い」アルゴリズムの結果を除去することを指示することができます。さらなる処理のため、セクション5を参照してください。"
    },
    {
      "indent": 0,
      "text": "2.1. Attribute Design Requirements",
      "section_title": true,
      "ja": "2.1. 設計要件属性"
    },
    {
      "indent": 3,
      "text": "The attribute will have the following characteristics:",
      "ja": "属性には次の特徴があります。"
    },
    {
      "indent": 3,
      "text": "1) Use CMS attribute structure;",
      "ja": "1）CMS属性構造を使用します。"
    },
    {
      "indent": 3,
      "text": "2) Be computable before any signatures are applied;",
      "ja": "いずれかの署名が適用される前に、2）計算可能。"
    },
    {
      "indent": 3,
      "text": "3) Contain enough information to identify individual signatures (i.e., a particular SignerInfo); and",
      "ja": "3）個々の署名（すなわち、特定のSignerInfo）を識別するのに十分な情報を含みます。そして"
    },
    {
      "indent": 3,
      "text": "4) Contain enough information to resist collision, preimage, and second preimage attacks.",
      "ja": "4）衝突、プレイメージ、及び第二プレイメージ攻撃に抵抗するために十分な情報を含みます。"
    },
    {
      "indent": 0,
      "text": "3. Multiple Signature Indication",
      "section_title": true,
      "ja": "前記複数の署名表示"
    },
    {
      "indent": 3,
      "text": "The multiple-signatures attribute type specifies a pointer to a signer's other multiple-signatures attribute(s). For example, if a signer applies three signatures, there must be two attribute values for multiple-signatures in each SignerInfo. The 1st SignerInfo object points to the 2nd and 3rd SignerInfo objects. The 2nd SignerInfo object points to the 1st and 3rd SignerInfo objects. The 3rd SignerInfo object points to the 1st and 2nd SignerInfo objects.",
      "ja": "複数の署名タイプは、署名者の他の複数のシグネチャの属性（複数可）へのポインタを指定する属性。署名者三人の署名を適用する場合、例えば、それぞれのSignerInfoに複数の署名のための2つの属性値が存在しなければなりません。第二と第三のSignerInfoオブジェクトへの第一のSignerInfoオブジェクトポイント。第一と第三のSignerInfoオブジェクトへの第二のSignerInfoオブジェクトポイント。第一及び第二のSignerInfoオブジェクトへの第三のSignerInfoオブジェクトポイント。"
    },
    {
      "indent": 3,
      "text": "The multiple-signatures attribute MUST be a signed attribute. The number of attribute values included in a SignerInfo is the number of signatures applied by a signer less one. This attribute is multi-valued, and there MAY be more than one AttributeValue present. The following object identifier identifies the multiple-signatures attribute:",
      "ja": "複数のシグネチャの属性は、署名された属性である必要があります。 SignerInfoに含まれる属性値の数は、一つ少ない署名者によって適用された署名の数です。この属性は複数値であり、複数のAttributeValueの存在がある可能性があります。以下のオブジェクト識別子は、複数のシグネチャの属性を識別する。"
    },
    {
      "indent": 6,
      "text": "id-aa-multipleSignatures OBJECT IDENTIFIER ::= {\n  iso(1) member-body(2) us(840) rsadsi(113549) pkcs(1) pkcs9(9)\n  id-aa(16) 51 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "multiple-signatures attribute values have the ASN.1 type MultipleSignatures:",
      "ja": "複数の署名は、値がASN.1タイプMultipleSignaturesを持っている属性："
    },
    {
      "indent": 6,
      "text": "MultipleSignatures ::= SEQUENCE {\n  bodyHashAlg     DigestAlgorithmIdentifier,\n  signAlg         SignatureAlgorithmIdentifier,\n  signAttrsHash   SignAttrsHash,\n  cert            ESSCertIDv2 OPTIONAL}",
      "raw": true
    },
    {
      "indent": 6,
      "text": "SignAttrsHash ::= SEQUENCE {\n  algID            DigestAlgorithmIdentifier,\n  hash             OCTET STRING }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The fields in MultipleSignatures have the following meaning:",
      "ja": "MultipleSignaturesのフィールドは以下の意味があります。"
    },
    {
      "indent": 3,
      "text": "- bodyHashAlg includes the digest algorithmIdentifier for the referenced multiple-signatures attribute.",
      "ja": " -  bodyHashAlgは、参照複数の署名属性のダイジェストのAlgorithmIdentifierを含みます。"
    },
    {
      "indent": 3,
      "text": "- signAlg includes the signature algorithmIdentifier for the referenced multiple-signatures attribute.",
      "ja": " -  signAlgは、参照複数の署名属性の署名のAlgorithmIdentifierを含みます。"
    },
    {
      "indent": 3,
      "text": "- signAttrsHash has two fields:",
      "ja": " -  signAttrsHashは、2つのフィールドがあります。"
    },
    {
      "indent": 5,
      "text": "-- algId MUST match the digest algorithm for the SignerInfo in which this multiple-signatures attribute value is placed.",
      "ja": " -  algIdこの複数の署名が配置されている属性値のSignerInfoするためのダイジェストアルゴリズムと一致しなければなりません。"
    },
    {
      "indent": 5,
      "text": "-- hash is the hash value of the signedAttrs (see Section 4.3).",
      "ja": " - ハッシュはsignedAttrsのハッシュ値である（4.3節を参照してください）。"
    },
    {
      "indent": 3,
      "text": "- cert is optional. It identities the certificate used to sign the SignerInfo that contains the other multiple-signatures attribute(s). It MUST be present if the fields in the other multiple-signatures attribute(s) are the same.",
      "ja": " -  CERTは任意です。これは、他の複数の署名属性（複数可）を含んでいるのSignerInfoの署名に使用する証明書をなIDを。他の複数のシグネチャの属性（複数可）のフィールドが同じである場合、それが存在しなければなりません。"
    },
    {
      "indent": 3,
      "text": "The following is an example:",
      "ja": "次に例を示します。"
    },
    {
      "indent": 6,
      "text": "SignedData DigestAlg=sha1,sha256 SignerInfo1 SignerInfo2 digestAlg=sha1 digestAlg=sha256 signatureAlg=dsawithsha1 signatureAlg=ecdsawithsha256 signedAttrs= signedAttrs= signingTime1 signingTime1 messageDigest1 messageDigest2 multiSig1= multiSig2= bodyHash=sha256 bodyHash=sha1 signAlg=ecdsawithsha256 signAlg=dsawithsha1 signAttrsHash= signAttrsHash= algID=sha1 algID=sha256 hash=value1 hash=value2",
      "ja": "SignedData DigestAlg = SHA1、SHA256 SignerInfo1 SignerInfo2 digestAlg = SHA1 digestAlg = SHA256 signatureAlg = dsawithsha1 signatureAlg = ecdsawithsha256 signedAttrs = signedAttrs = signingTime1 signingTime1 messageDigest1 messageDigest2 multiSig1 = multiSig2 = bodyHash = SHA256 bodyHash = SHA1 signAlg = ecdsawithsha256 signAlg = dsawithsha1 signAttrsHash = signAttrsHash = algID = SHA1 algID = SHA256ハッシュ= VALUE1のハッシュ値2 ="
    },
    {
      "indent": 0,
      "text": "4. Message Generation and Processing",
      "section_title": true,
      "ja": "4.メッセージの生成および処理"
    },
    {
      "indent": 3,
      "text": "The following are the additional procedures for message generation when using the multiple-signatures attribute. These paragraphs track with Sections 5.1-5.6 in [CMS].",
      "ja": "複数のシグネチャの属性を使用する場合は、次のメッセージを生成するための追加の手順です。これらの段落は、セクション[CMS]で5.1から5.6に追跡します。"
    },
    {
      "indent": 0,
      "text": "4.1. SignedData Type",
      "section_title": true,
      "ja": "4.1.  SignedDataタイプ"
    },
    {
      "indent": 3,
      "text": "The following steps MUST be followed by a signer when generating SignedData:",
      "ja": "SignedDataを生成するときに、次の手順では、署名者が続かなければなりません。"
    },
    {
      "indent": 3,
      "text": "- The signer MUST indicate the CMS version.",
      "ja": " - 署名者は、CMSのバージョンを指定する必要があります。"
    },
    {
      "indent": 3,
      "text": "- The signer SHOULD include the digest algorithm used in SignedData.digestAlgorithms, if the digest algorithm's identifier is not already present.",
      "ja": " - ダイジェストアルゴリズムの識別子が存在しない場合、署名者は、SignedData.digestAlgorithmsで使用されるダイジェストアルゴリズムを含むべきです。"
    },
    {
      "indent": 3,
      "text": "- The signer MUST include the encapContentInfo. Note that the encapContentInfo is the same for all signers in this SignedData.",
      "ja": " - 署名者はencapContentInfoを含まなければなりません。 encapContentInfoはこのSignedDataの中のすべての署名者に対して同じであることに注意してください。"
    },
    {
      "indent": 3,
      "text": "- The signer SHOULD add certificates sufficient to contain certificate paths from a recognized \"root\" or \"top-level certification authority\" to the signer, if the signer's certificates are not already present.",
      "ja": " - 署名者の証明書が既に存在していない場合、署名者は、署名者に認められ、「ルート」または「トップレベルの認証局」からの証明書パスを含むのに十分な証明書を追加する必要があります。"
    },
    {
      "indent": 3,
      "text": "- The signer MAY include the Certificate Revocation Lists (CRLs) necessary to validate the digital signature, if the CRLs are not already present.",
      "ja": " -  CRLが既に存在しない場合、署名者は、デジタル署名を検証するために必要な証明書失効リスト（CRL）を含むことができます。"
    },
    {
      "indent": 3,
      "text": "- The signer MUST:",
      "ja": " - 署名者の必要があります。"
    },
    {
      "indent": 5,
      "text": "-- Retain the existing signerInfo objects.",
      "ja": " - 既存のSignerInfoオブジェクトを保持します。"
    },
    {
      "indent": 5,
      "text": "-- Include their signerInfo object(s).",
      "ja": " - 自分のSignerInfoオブジェクト（複数可）を含めます。"
    },
    {
      "indent": 0,
      "text": "4.2. EncapsulatedContentInfo Type",
      "section_title": true,
      "ja": "4.2.  EncapsulatedContentInfoタイプ"
    },
    {
      "indent": 3,
      "text": "The procedures for generating EncapsulatedContentInfo are as specified in Section 5.2 of [CMS].",
      "ja": "[CMS]のセクション5.2で指定されるようにEncapsulatedContentInfoを生成するための手順です。"
    },
    {
      "indent": 0,
      "text": "4.3. SignerInfo Type",
      "section_title": true,
      "ja": "4.3.  SignerInfoタイプ"
    },
    {
      "indent": 3,
      "text": "The procedures for generating SignerInfo are as specified in Section 4.4.1 of [CMS] with the following addition:",
      "ja": "SignerInfoを生成するための手順は、以下を添加した[CMS]のセクション4.4.1で指定されます。"
    },
    {
      "indent": 3,
      "text": "The signer MUST include the multiple-signatures attribute in signedAttrs.",
      "ja": "署名者はsignedAttrsで複数の署名属性を含まなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.4. Message Digest Calculation Process",
      "section_title": true,
      "ja": "4.4. メッセージダイジェストの計算処理"
    },
    {
      "indent": 0,
      "text": "4.4.1. multiple-signatures Signed Attribute Generation",
      "section_title": true,
      "ja": "4.4.1. 複数の署名署名している属性の生成"
    },
    {
      "indent": 3,
      "text": "The procedure for generating the multiple-signatures signed attribute is as follows:",
      "ja": "以下のように複数の署名署名された属性を生成するための手順は以下のとおりです。"
    },
    {
      "indent": 3,
      "text": "1) All other signed attributes are placed in the respective SignerInfo structures, but the signatures are not yet computed for the SignerInfo.",
      "ja": "1）他のすべての署名された属性は、それぞれのSignerInfo構造内に配置されているが、署名はまだのSignerInfoについて計算されていません。"
    },
    {
      "indent": 3,
      "text": "2) The multiple-signatures attributes are added to each of the SignerInfo structures with the SignAttrsHash.hash field containing a zero-length octet string.",
      "ja": "2）複数のシグネチャの属性は長さゼロのオクテット文字列を含むSignAttrsHash.hashフィールドとのSignerInfo構造の各々に添加します。"
    },
    {
      "indent": 3,
      "text": "3) The correct SignAttrsHash.hash value is computed for each of the SignerInfo structures.",
      "ja": "3）正しいSignAttrsHash.hash値のSignerInfo構造の各々について計算されます。"
    },
    {
      "indent": 3,
      "text": "4) After all hash values have been computed, the correct hash values are placed into their respective SignAttrsHash.hash fields.",
      "ja": "すべてのハッシュ値が計算された後4）、正しいハッシュ値がそれぞれSignAttrsHash.hashフィールドに配置されています。"
    },
    {
      "indent": 0,
      "text": "4.4.2. Message Digest Calculation Process",
      "section_title": true,
      "ja": "4.4.2. メッセージダイジェストの計算処理"
    },
    {
      "indent": 3,
      "text": "The remaining procedures for generating the message-digest attribute are as specified in Section 5.4 of [CMS].",
      "ja": "[CMS]のセクション5.4で指定されたメッセージダイジェスト属性を生成するための残りの手順があります。"
    },
    {
      "indent": 0,
      "text": "4.5. Signature Generation Process",
      "section_title": true,
      "ja": "4.5. 署名生成処理"
    },
    {
      "indent": 3,
      "text": "The procedures for signature generation are as specified in Section 5.5 of [CMS].",
      "ja": "[CMS]のセクション5.5で指定されるように署名生成のための手順です。"
    },
    {
      "indent": 0,
      "text": "4.6. Signature Verification Process",
      "section_title": true,
      "ja": "4.6. 署名検証プロセス"
    },
    {
      "indent": 3,
      "text": "The procedures for signature verification are as specified in Section 5.6 of [CMS] with the following addition:",
      "ja": "署名検証の手順は、以下を添加した[CMS]のセクション5.6で指定されます。"
    },
    {
      "indent": 3,
      "text": "If the SignedData signerInfo includes the multiple-signatures attribute, the attribute's values must be calculated as described in Section 4.4.1.",
      "ja": "SignedDataのSignerInfoは、複数の署名の属性が含まれている場合は、セクション4.4.1で説明したように、属性の値が計算されなければなりません。"
    },
    {
      "indent": 3,
      "text": "For every SignerInfo to be considered present for a given signer, the number of MultipleSignatures AttributeValue(s) present in a given SignerInfo MUST equal the number of SignerInfo objects for that signer less one and the hash value present in each of the MultipleSignatures AttributeValue(s) MUST match the output of the message digest calculation from Section 4.4.1 for each SignerInfo.",
      "ja": "すべてのSignerInfoが所与の署名者のために存在するとみなされるためには、所与のSignerInfoに存在MultipleSignatures AttributeValueの（S）の数は、その署名者一つ少なくとMultipleSignatures AttributeValueの（複数のそれぞれに存在するハッシュ値のためのSignerInfoオブジェクトの数に等しくなければなりません）それぞれのSignerInfoについては、セクション4.4.1から算出メッセージダイジェストの出力と一致しなければなりません。"
    },
    {
      "indent": 3,
      "text": "The hash corresponding to the n-th SignerInfo must match the value in the multiple-signatures attribute that points to the n-th SignerInfo present in all other SignerInfo objects.",
      "ja": "複数の署名の値と一致している必要があり、n番目のSignerInfoに対応するハッシュ属性他のすべてのSignerInfoオブジェクトのn番目のSignerInfo存在を指しています。"
    },
    {
      "indent": 0,
      "text": "5. Signature Evaluation Processing",
      "section_title": true,
      "ja": "5.署名評価処理"
    },
    {
      "indent": 3,
      "text": "This section describes recommended processing of signatures when there are more than one SignerInfo present in a message. This may be due to either multiple SignerInfo objects being present in a single SignedData object or multiple SignerData objects embedded in each other.",
      "ja": "このセクションでは、メッセージ内に存在する複数のSignerInfoがあるシグネチャの推奨される処理について説明します。これは、単一のSignedDataオブジェクト又は複数SignerDataに存在する複数のSignerInfoオブジェクトがお互いに埋め込まれたオブジェクトのいずれかにあってもよいです。"
    },
    {
      "indent": 3,
      "text": "The text in this section is non-normative. The processing described is highly recommended, but is not forced. Changes in the processing that have the same results with somewhat different orders of processing is sufficient.",
      "ja": "このセクション内のテキストは非規範的です。説明した処理を強くお勧めしますが、強制されていません。処理の多少異なる順序で同一の結果を有する処理の変化は十分です。"
    },
    {
      "indent": 3,
      "text": "Order of operations:",
      "ja": "操作の順序："
    },
    {
      "indent": 3,
      "text": "1) Evaluate each SignerInfo object independently.",
      "ja": "1）それぞれ独立のSignerInfoオブジェクトを評価します。"
    },
    {
      "indent": 3,
      "text": "2) Combine the results of all SignerInfo objects at the same level (i.e., attached to the same SignerData object).",
      "ja": "2）同じレベルで全てのSignerInfoオブジェクトの結果を結合（すなわち、）同じSignerDataオブジェクトに取り付けられました。"
    },
    {
      "indent": 3,
      "text": "3) Combine the results of the nested SignerData objects. Note that this should ignore the presence of other CMS objects between the SignedData objects.",
      "ja": "3）ネストSignerDataオブジェクトの結果を組み合わせます。これはのSignedDataオブジェクト間の他のCMSオブジェクトの存在を無視する必要があることに注意してください。"
    },
    {
      "indent": 0,
      "text": "5.1. Evaluation of a SignerInfo Object",
      "section_title": true,
      "ja": "5.1.  SignerInfoオブジェクトの評価"
    },
    {
      "indent": 3,
      "text": "When evaluating a SignerInfo object, there are three different pieces that need to be examined.",
      "ja": "SignerInfoオブジェクトを評価する場合、検査する必要がある三つの異なるピースがあります。"
    },
    {
      "indent": 3,
      "text": "The first piece is the mathematics of the signature itself (i.e., can one actually successfully do the computations and get the correct answer?). This result is one of three results. The mathematics succeeds, the mathematics fails, or the mathematics cannot be evaluated. The type of things that lead to the last state are non-implementation of an algorithm or required inputs, such as the public key, are missing.",
      "ja": "最初の作品は、署名自体（すなわち、1が実際に成功した計算を行うと、正しい答えを得ることができますか？）の数学です。この結果は、3つの結果の一つです。数学は成功し、数学が失敗する、または数学を評価することができません。最後の状態につながるものの種類は、アルゴリズムや公開鍵など必要な入力、非実装され、不足しています。"
    },
    {
      "indent": 3,
      "text": "The second piece is the validation of the source of the public key. For CMS, this is generally determined by extracting the public key from a certificate. The certificate needs to be evaluated. This is done by the procedures outlined in [PROFILE]. In addition to the processing described in that document, there may be additional requirements on certification path processing that are required by the application in question. One such set of additional processing is described in [SMIME-CERT]. One piece of information that is part of this additional certificate path processing is local and application policy. The output of this processing can actually be one of four different states: Success, Failure, Indeterminate, and Warning. The first three states are described in [PROFILE]; Warning would be generated when it is possible that some information is currently acceptable, but may not be acceptable either in the near future or under some circumstances.",
      "ja": "2枚目の公開鍵のソースの検証です。 CMSの場合、これは一般的に、証明書から公開鍵を抽出することによって決定されます。証明書は、評価する必要があります。これは、[PROFILE]に概説された手順によって行われます。その文書で説明した処理に加えて、当該アプリケーションによって必要とされる認証パス処理に追加の要件があるかもしれません。追加の処理のような一組は[SMIME-CERT]に記載されています。この追加の証明書パス処理の一部である情報の一つは、ローカルおよびアプリケーションポリシーです。成功、失敗、不定、および警告：この処理の出力は、実際には4つの異なる状態のいずれかになります。最初の三つの状態は、[PROFILE]に記載されています。いくつかの情報は、現在受け入れ可能であるが、近い将来にまたはいくつかの状況下でいずれかの許容できない可能性があると警告が生成されるであろう。"
    },
    {
      "indent": 3,
      "text": "The third piece of the validation is local and application policy as applied to the contents of the SignerInfo object. This would cover such issues as the requirements on mandatory signed attributes or requirements on signature algorithms.",
      "ja": "SignerInfoオブジェクトの内容に適用される検証の3枚目は、ローカルおよびアプリケーションポリシーです。これは、必須の署名属性または署名アルゴリズムの要件に関する要件などの問題をカバーします。"
    },
    {
      "indent": 0,
      "text": "5.2. Evaluation of a SignerInfo Set",
      "section_title": true,
      "ja": "5.2.  SignerInfoセットの評価"
    },
    {
      "indent": 3,
      "text": "Combining the results of the individual SignerInfo objects into a result for a SignedData object requires knowledge of the results for the individual SignerInfo objects, the required application policy, and any local policies. The default processing if no other rules are applied should be:",
      "ja": "SignedDataオブジェクトのための結果に個別のSignerInfoオブジェクトの結果を組み合わせることで、個々のSignerInfoオブジェクト、必要なアプリケーションポリシー、およびローカルポリシーの結果の知識が必要です。他のルールが適用されない場合、デフォルトの処理は次のようになります。"
    },
    {
      "indent": 3,
      "text": "1) Group the SignerInfo objects by the signer.",
      "ja": "1）署名者のSignerInfoオブジェクトのグループ。"
    },
    {
      "indent": 3,
      "text": "2) Take the best result from each signer.",
      "ja": "2）各署名者から最良の結果を取ります。"
    },
    {
      "indent": 3,
      "text": "3) Take the worst result from all of the different signers; this is the result for the SignedData object.",
      "ja": "3）異なる署名者のすべてから最悪の結果を取ります。これはSignedDataオブジェクトのための結果です。"
    },
    {
      "indent": 3,
      "text": "Application and local policy can affect each of the steps outlined above.",
      "ja": "アプリケーションとローカルポリシーは、上記の手順のそれぞれに影響を与えることができます。"
    },
    {
      "indent": 3,
      "text": "In Step 1:",
      "ja": "ステップ1："
    },
    {
      "indent": 3,
      "text": "- If the subject name or subject alternative name(s) cannot be used to determine if two SignerInfo objects were created by the same identity, then applications need to specify how such matching is to be done. As an example, the S/MIME message specification [SMIME-MSG] could say that as long as the same rfc822Name exists in either the subject name or the subject alt name they are the same identity. This would be true even if other information that did not match existed in these fields.",
      "ja": " - サブジェクト名またはサブジェクト代替名（複数可）は、2つのSignerInfoオブジェクトが同じIDによって作成されたかどうかを決定するために使用することができない場合、アプリケーションは、マッチングが行われるべき方法を指定する必要があります。一例として、S / MIMEメッセージ仕様[SMIME-MSG]は限り同じrfc822Nameでは、サブジェクト名またはサブジェクト代替名のいずれかに存在するように、それらが同じ同一であることを言うことができます。これは一致しませんでした他の情報は、これらのフィールドに存在していた場合も同様だろう。"
    },
    {
      "indent": 3,
      "text": "- Some applications may specify that this step should be skipped; this has the effect of making each SignerInfo object independent of all other SignerInfo objects even if the signing identity is the same. Applications that specify this need to be aware that algorithm rollover will not work correctly in this case.",
      "ja": " - 一部のアプリケーションでは、このステップをスキップするように指定することができます。これは、他のすべてのSignerInfoのそれぞれのSignerInfoオブジェクトの独立したが、署名IDが同じであってもオブジェクトにする効果があります。このニーズを指定するアプリケーションは、アルゴリズムのロールオーバーは、このケースでは正しく動作しないことに注意してします。"
    },
    {
      "indent": 3,
      "text": "In Step 2:",
      "ja": "ステップ2では："
    },
    {
      "indent": 3,
      "text": "- The major policy implication at this step is the treatment of and order for the indeterminate states. In most cases, this state would be placed between the failure and warning states. Part of the issue is the question of having a multi-state or a binary answer as to success or failure of an evaluation. Not every application can deal with the statement \"try again later\". It may also be dependent on what the reason for the indeterminate state is. It makes more sense to try again later if the problem is that a CRL cannot be found than if you are not able to evaluate the algorithm for the signature.",
      "ja": " - この段階で主要な政策含意は不確定な状態のための治療法と秩序があります。ほとんどの場合、この状態は、障害や警告状態の間に配置されるだろう。問題の一部は、評価の成功または失敗のようなマルチ状態またはバイナリの答えを持っていることの問題です。すべてのアプリケーションは、ステートメント「後でもう一度やり直し」に対処することができません。また、不確定な状態の理由が何であるかに依存することができます。これは、問題は、あなたが署名のためのアルゴリズムを評価することができない場合よりも、CRLが見つからないことであれば、後で再試行するより理にかなっています。"
    },
    {
      "indent": 3,
      "text": "In Step 3:",
      "ja": "ステップ3："
    },
    {
      "indent": 3,
      "text": "- The same policy implications from Step 2 apply here.",
      "ja": " - ステップ2から同じ政策的含意が適用されます。"
    },
    {
      "indent": 0,
      "text": "5.3. Evaluation of a SignedData Set",
      "section_title": true,
      "ja": "5.3.  SignedDataのセットの評価"
    },
    {
      "indent": 3,
      "text": "Simple applications will generally use the worst single outcome (success, unknown, failure) as the outcome for a set of SignedData objects (i.e., one failure means the entire item fails). However, not all applications will want to have this behavior.",
      "ja": "シンプルなアプリケーションでは、一般的に（すなわち、1つの失敗はアイテム全体が失敗した意味）のSignedDataオブジェクトのセットのための結果として最悪の単一結果（成功、不明、失敗）を使用します。ただし、すべてのアプリケーションがこの動作を持っていることになるでしょう。"
    },
    {
      "indent": 3,
      "text": "A work flow application could work as follows:",
      "ja": "次のようにワークフローアプリケーションは、仕事ができます："
    },
    {
      "indent": 3,
      "text": "The second signer will modify the original content, keep the original signature, and then sign the message. This means that only the outermost signature is of significance during evaluation. The second signer is asserting that they successfully validated the inner signature as part of its processing.",
      "ja": "第二の署名者は、元のコンテンツを変更し、元の署名を維持し、メッセージに署名します。これは、最も外側の署名が評価中に重要であることを意味しています。第二の署名者は、彼らが正常にその処理の一部として、内部署名を検証することを主張しています。"
    },
    {
      "indent": 3,
      "text": "A Signed Mail application could work as follows:",
      "ja": "次のように署名されたメールアプリケーションが動作することができます："
    },
    {
      "indent": 3,
      "text": "If signatures are added for the support of [ESS] features, then the fact that an outer layer signature cannot be validated can be treated as a non-significant failure. The only thing that matters is that the originator signature is valid. This means that all outer layer signatures that fail can be stripped from the message prior to display leaving only the inner-most valid signature to be displayed.",
      "ja": "署名が[ESS]機能のサポートのために追加される場合、外層署名が検証できないという事実は、非有意失敗として扱うことができます。唯一の問題は、発信元の署名が有効であるということです。これが失敗し、すべての外層署名が表示されるのみ最も内側の有効な署名を残して表示する前にメッセージから除去することができることを意味します。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "Security considerations from the hash and signature algorithms used to produce the SignerInfo apply.",
      "ja": "SignerInfo生成するために使用されるハッシュと署名アルゴリズムからのセキュリティに関する考慮事項が適用されます。"
    },
    {
      "indent": 3,
      "text": "If the hashing and signing operations are performed by different entities, the entity creating the signature must ensure that the hash comes from a \"trustworthy\" source. This can be partially mitigated by requiring that multiple hashes using different algorithms are provided.",
      "ja": "ハッシュと署名操作が異なるエンティティによって実行されている場合は、署名を生成するエンティティは、ハッシュは、「信頼できる」ソースから来ていることを確認する必要があります。これは、部分的に異なるアルゴリズムを使用して複数のハッシュが提供されることを要求することによって緩和することができます。"
    },
    {
      "indent": 3,
      "text": "This attribute cannot be relied upon in the event that all of the algorithms used in the signer attribute are 'cracked'. It is not possible for a verifier to determine that a collision could not be found that satisfies all of the algorithms.",
      "ja": "この属性は、署名者の属性に使用されるアルゴリズムのすべてが、「ひび割れ」されているイベントに依拠することはできません。これは、衝突がアルゴリズムのすべてを満たす見つからないことを決定するために、検証のためには不可能です。"
    },
    {
      "indent": 3,
      "text": "Local policy and applications greatly affect signature processing. The application of local policy and the requirements specific to an application can both affect signature processing. This means that a signature valid in one context or location can fail validation in a different context or location.",
      "ja": "ローカルポリシーとアプリケーションが大幅に署名処理に影響を与えます。ローカルポリシーのアプリケーションとアプリケーションに固有の要件は、両方の署名処理に影響を与えることができます。これは、1つのコンテキストまたは位置で有効な署名が別のコンテキストまたは位置に検証に失敗することができることを意味します。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7.参考"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "ja": "7.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[CMS] Housley, R., \"Cryptographic Message Syntax (CMS)\", RFC 5652, September 2009.",
      "ja": "[CMS] Housley氏、R.、 \"暗号メッセージ構文（CMS）\"、RFC 5652、2009年9月。"
    },
    {
      "indent": 3,
      "text": "[PROFILE] Cooper, D., Santesson, S., Farrell, S., Boeyen, S., Housley, R., and W. Polk, \"Internet X.509 Public Key Infrastructure Certificate and Certificate Revocation List (CRL) Profile\", RFC 5280, May 2008.",
      "ja": "[PROFILE]クーパー、D.、Santesson、S.、ファレル、S.、Boeyen、S.、Housley氏、R.、およびW.ポーク、「インターネットX.509公開鍵暗号基盤証明書と証明書失効リスト（CRL）のプロフィール」、RFC 5280、2008年5月。"
    },
    {
      "indent": 3,
      "text": "[SMIME-CERT] Ramsdell, B. and S. Turner, \"Secure/Multipurpose Internet Mail Extensions (S/MIME) Version 3.2 Certificate Handling\", RFC 5750, January 2010.",
      "ja": "[SMIME-CERT] Ramsdell、B.とS.ターナーは、RFC 5750、2010年1月 \"/多目的インターネットメール拡張（S / MIME）バージョン3.2証明書の処理を固定します\"。"
    },
    {
      "indent": 3,
      "text": "[SMIME-MSG] Ramsdell, B. and S. Turner, \"Secure/Multipurpose Internet Mail Extensions (S/MIME) Version 3.2 Message Specification\", RFC 5751, January 2010.",
      "ja": "[SMIME-MSG] Ramsdell、B.、およびS.ターナー、 \"/セキュア多目的インターネットメール拡張（S / MIME）バージョン3.2メッセージ仕様\"、RFC 5751、2010年1月。"
    },
    {
      "indent": 3,
      "text": "[ESS] Hoffman, P., Ed., \"Enhanced Security Services for S/MIME\", RFC 2634, June 1999.",
      "ja": "[ESS]ホフマン、P.、エド。、 \"セキュリティ強化サービスS / MIMEのために\"、RFC 2634、1999年6月。"
    },
    {
      "indent": 3,
      "text": "[ESSCertID] Schaad, J., \"Enhanced Security Services (ESS) Update: Adding CertID Algorithm Agility\", RFC 5035, August 2007.",
      "ja": "[ESSCertID] Schaad、J.、 \"拡張セキュリティサービス（ESS）更新：CertIDアルゴリズムアジリティを追加\"、RFC 5035、2007年8月。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "ja": "7.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[ATTACK] Hoffman, P. and B. Schneier, \"Attacks on Cryptographic Hashes in Internet Protocols\", RFC 4270, November 2005.",
      "ja": "[ATTACK]ホフマン、P.とB.シュナイアー、 \"インターネットプロトコルで暗号化ハッシュに対する攻撃\"、RFC 4270、2005年11月。"
    },
    {
      "indent": 0,
      "text": "Appendix A. ASN.1 Module",
      "ja": "付録A. ASN.1モジュール"
    },
    {
      "indent": 0,
      "text": "MultipleSignatures-2008",
      "ja": "MultipleSignatures-2008"
    },
    {
      "indent": 2,
      "text": "{ iso(1) member-body(2) us(840) rsadsi(113549) pkcs(1) pkcs9(9) smime(16) modules(0) id-mod-multipleSig-2008(34) }",
      "ja": "{ISO（1）部材本体（2）米国（840）RSADSI（113549）PKCS（1）pkcs9（9）SMIME（16）モジュール（0）ID-MOD-multipleSig-2008（34）}"
    },
    {
      "indent": 3,
      "text": "DEFINITIONS IMPLICIT TAGS ::=",
      "raw": true
    },
    {
      "indent": 3,
      "text": "BEGIN",
      "ja": "ベギン"
    },
    {
      "indent": 0,
      "text": "-- EXPORTS All",
      "ja": " - すべてのエクスポート"
    },
    {
      "indent": 0,
      "text": "-- The types and values defined in this module are exported for use -- in the other ASN.1 modules. Other applications may use them for -- their own purposes.",
      "ja": " - このモジュールで定義されたタイプと値は使用のためにエクスポートされる - 他のASN.1モジュールに。独自の目的 - 他のアプリケーションがためにそれらを使用することができます。"
    },
    {
      "indent": 0,
      "text": "IMPORTS",
      "ja": "輸入"
    },
    {
      "indent": 0,
      "text": "-- Imports from RFC 5652 [CMS], 12.1",
      "ja": " -  RFC 5652 [CMS]、12.1からの輸入"
    },
    {
      "indent": 5,
      "text": "DigestAlgorithmIdentifier, SignatureAlgorithmIdentifier\nFROM CryptographicMessageSyntax2004\n  { iso(1) member-body(2) us(840) rsadsi(113549)\n    pkcs(1) pkcs9(9) smime(16) modules(0) cms-2004(24) }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "-- Imports from RFC 5035 [ESSCertID], Appendix A",
      "ja": " -  RFC 5035 [ESSCertID]、付録Aからの輸入"
    },
    {
      "indent": 5,
      "text": "ESSCertIDv2\nFROM ExtendedSecurityServices-2006\n  { iso(1) member-body(2) us(840) rsadsi(113549)\n    pkcs(1) pkcs9(9) smime(16) modules(0) id-mod-ess-2006(30) }",
      "raw": true
    },
    {
      "indent": 0,
      "text": ";",
      "ja": "；"
    },
    {
      "indent": 0,
      "text": "-- Section 3.0",
      "ja": " - セクション3.0"
    },
    {
      "indent": 0,
      "text": "id-aa-multipleSignatures OBJECT IDENTIFIER ::= { iso(1) member-body(2)\nus(840) rsadsi(113549) pkcs(1) pkcs9(9) id-aa(2) 51 }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "MultipleSignatures ::= SEQUENCE {\n  bodyHashAlg     DigestAlgorithmIdentifier,\n  signAlg         SignatureAlgorithmIdentifier,\n  signAttrsHash   SignAttrsHash,\n  cert            ESSCertIDv2 OPTIONAL }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "SignAttrsHash ::= SEQUENCE {\n  algID            DigestAlgorithmIdentifier,\n  hash             OCTET STRING }",
      "raw": true
    },
    {
      "indent": 0,
      "text": "END -- of MultipleSignatures-2008",
      "ja": "END  -  MultipleSignatures-2008の"
    },
    {
      "indent": 0,
      "text": "Appendix B. Background",
      "ja": "付録B.背景"
    },
    {
      "indent": 3,
      "text": "This is an informational appendix. This appendix enumerates all locations in CMS where hashes are used and the possible attacks on those hash locations.",
      "ja": "これは情報付録です。この付録では、ハッシュが使用されているCMS内のすべての場所と、それらのハッシュの場所の攻撃の可能性を列挙します。"
    },
    {
      "indent": 0,
      "text": "B.1. Attacks",
      "ja": "B.1。攻撃"
    },
    {
      "indent": 3,
      "text": "As noted in [ATTACK], the following types of resistance are needed against known attacks:",
      "ja": "[ATTACK]で述べたように、抵抗の次のタイプは、既知の攻撃に対して必要とされます。"
    },
    {
      "indent": 3,
      "text": "1) Collision Resistance: Find x and y where x != y and H(x) = H(y)",
      "ja": "1）衝突耐性：検索Xおよび​​Y X = Y及びH（X）= H（y）と"
    },
    {
      "indent": 3,
      "text": "2) Preimage Resistance: Given y, find x where H(x) = y",
      "ja": "2）プリイメージ耐性：与えられたY、Xここで、H（X）= Yを見つけます"
    },
    {
      "indent": 3,
      "text": "3) Second Preimage Resistance: Given y, find x where H(x) = H(y)",
      "ja": "3）第2プレイメージ抵抗：Xを見つけ、Yが与えられる場合、H（X）= H（y）と"
    },
    {
      "indent": 3,
      "text": "Note: It is known that a collision resistance attack is simpler than a second preimage resistance attack, and it is presumed that a second preimage resistance attack is simpler than a preimage attack.",
      "ja": "注意：衝突耐性攻撃が第二プレイメージ抵抗攻撃よりも単純であり、第二プレイメージ抵抗攻撃が原像攻撃よりも簡単であることが推定されることが知られています。"
    },
    {
      "indent": 0,
      "text": "B.2. Hashes in CMS",
      "ja": "B.2。 CMSでのハッシュ"
    },
    {
      "indent": 3,
      "text": "Within a SignerInfo there are two places where hashes are applied and hence can be attacked: the body and the signed attributes. The following outlines the entity that creates the hash, the entity that attacks the hash, and the type of resistance required:",
      "ja": "本体と署名された属性：のSignerInfo内のハッシュが適用され、従って攻撃することができる2つの場所があります。以下は、ハッシュ、ハッシュを攻撃するエンティティ、および必要な抵抗値の型を作成するエンティティの概要を示します。"
    },
    {
      "indent": 3,
      "text": "1) Hash of the Body (i.e., the octets comprising the value of the encapContentInfo.eContent OCTET STRING omitting the tag and length octets, as per 5.4 of [CMS]).",
      "ja": "身体の1）ハッシュ（すなわち、オクテット[CMS]の5.4に従って、タグと長さオクテットを省略encapContentInfo.eContentオクテット文字列の値を含みます）。"
    },
    {
      "indent": 6,
      "text": "a) If Alice creates the body to be hashed, then:",
      "ja": "A）アリスは、その後、ハッシュ化されるように体を作成する場合："
    },
    {
      "indent": 9,
      "text": "i) Alice can attack the hash. This attack requires a successful collision resistance attack.",
      "ja": "ⅰ）アリスは、ハッシュを攻撃することができます。この攻撃は成功した衝突耐性攻撃が必要です。"
    },
    {
      "indent": 8,
      "text": "ii) Mallory can attack the hash. This attack requires a successful second preimage resistance attack.",
      "ja": "ⅱ）マロリーは、ハッシュを攻撃することができます。この攻撃は成功した二プレイメージ抵抗攻撃が必要です。"
    },
    {
      "indent": 6,
      "text": "b) If Alice hashes a body provided by Bob, then:",
      "ja": "B）アリスはボブが提供するボディをハッシュした場合は、次のようになります。"
    },
    {
      "indent": 9,
      "text": "i) Alice can attack the hash. This attack requires a successful second preimage attack.",
      "ja": "ⅰ）アリスは、ハッシュを攻撃することができます。この攻撃は成功した二プレイメージアタックが必要です。"
    },
    {
      "indent": 8,
      "text": "ii) Bob can attack the hash. This attack requires a successful Collision Resistance attack. If Alice has the ability to \"change\" the content of the body in some fashion, then this attack requires a successful second preimage attack. (One example would be to use a keyed hash function.)",
      "ja": "ⅱ）ボブは、ハッシュを攻撃することができます。この攻撃は成功した衝突抵抗攻撃が必要です。アリスはいくつかの方法で体の内容を「変更」する能力を持っている場合は、この攻撃が成功した二プレイメージアタックが必要です。 （一例としては、鍵付きハッシュ関数を使用することであろう。）"
    },
    {
      "indent": 7,
      "text": "iii) Mallory can attack the hash. This attack requires a successful second preimage attack.",
      "ja": "ⅲ）マロリーは、ハッシュを攻撃することができます。この攻撃は成功した二プレイメージアタックが必要です。"
    },
    {
      "indent": 6,
      "text": "c) If Alice signs using a hash value provided by Bob (in this case, Alice is presumed to never see the body in question), then:",
      "ja": "C）ボブが提供するハッシュ値を使用してアリスの兆候が（このケースでは、アリスは）問題の身体を見ることはないと推測されている場合は、次のようになります。"
    },
    {
      "indent": 9,
      "text": "i) Alice can attack the hash. This attack requires a successful preimage attack.",
      "ja": "ⅰ）アリスは、ハッシュを攻撃することができます。この攻撃は成功したプリイメージ攻撃が必要です。"
    },
    {
      "indent": 8,
      "text": "ii) Bob can attack the hash. This attack requires a successful collision resistance attack. Unlike case (b), there is nothing that Alice can do to upgrade the attack.",
      "ja": "ⅱ）ボブは、ハッシュを攻撃することができます。この攻撃は成功した衝突耐性攻撃が必要です。ケースとは異なり、（b）は、アリスが攻撃をアップグレードするためにできることは何もありません。"
    },
    {
      "indent": 7,
      "text": "iii) Mallory can attack the hash. This requires a successful preimage attack if the content is unavailable to Mallory and a successful second preimage attack if the content is available to Mallory.",
      "ja": "ⅲ）マロリーは、ハッシュを攻撃することができます。コンテンツはマロリーとコンテンツがマロリーに利用可能である場合に成功した二プリイメージ攻撃に利用できない場合、これは成功したプリイメージ攻撃が必要です。"
    },
    {
      "indent": 3,
      "text": "2) Hash of signed attributes (i.e., the complete Distinguished Encoding Rules (DER) encoding of the SignedAttrs value contained in the signedAttrs field, as per 5.4 of [CMS]).",
      "ja": "署名された属性の2）ハッシュ（すなわち、完全な識別符号化規則（DER）[CMS]の5.4に従って、signedAttrsフィールドに含まSignedAttrs値の符号化）。"
    },
    {
      "indent": 6,
      "text": "There is a difference between hashing the body and hashing the SignedAttrs value in that one should not accept a sequence of attributes to be signed from a third party. In fact, one should not accept attributes to be included in the signed attributes list from a third party. The attributes are about the signature you are applying and not about the body. If there is meta-information that needs to be attached to the body by a third party, then they need to provide their own signature and you need to add a countersignature. (Note: The fact that the signature is to be used as a countersignature is a piece of information that should be accepted, but it does not directly provide an attribute that is inserted in the signed attribute list.)",
      "ja": "第三者から署名される属性の順序を受け入れるべきではありません1つでSignedAttrs値を体をハッシュおよびハッシュの間に違いがあります。実際には、一つは、第三者からの署名属性リストに含まれる属性を受け入れるべきではありません。属性は、あなたが身体について適用するとされていない署名についてです。第三者によって身体に装着する必要があるメタ情報があれば、彼らは自分の署名を提供する必要があり、あなたが副署を追加する必要があります。 （注：署名が副署として使用されるという事実は受け入れなければならない情報であるが、それは、直接符号付き属性リストに挿入された属性を提供しません。）"
    },
    {
      "indent": 6,
      "text": "a) Alice can attack the hash. This requires a successful collision resistance attack.",
      "ja": "A）アリスは、ハッシュを攻撃することができます。これが成功した衝突耐性攻撃が必要です。"
    },
    {
      "indent": 6,
      "text": "b) Mallory can attack the hash. This requires a successful second preimage resistance attack.",
      "ja": "b）のマロリーは、ハッシュを攻撃することができます。これが成功した二プレイメージ抵抗攻撃が必要です。"
    },
    {
      "indent": 6,
      "text": "c) Bob can attack the hash and Bob controls the value of the message digest attribute used. This case is analogous to the current attacks [ATTACK]. Bob can attack the hash value generated by Alice based on a prediction of the signed attributes and the hash algorithm Alice will be using to create the signature. If Bob successfully predicts these items, the attack requires a successful collision resistance attack. (It is expected that if Alice uses a keyed hashing function as part of the signature, this attack will be more difficult as Bob would have a harder time prediction the key value.)",
      "ja": "C）ボブは、ハッシュを攻撃することができ、ボブが使用するメッセージダイジェスト属性の値を制御します。この場合は、現在の攻撃[ATTACK]に類似しています。ボブは、署名された属性の予測と、アリスが署名を作成するために使用するハッシュアルゴリズムに基づいてアリスによって生成されたハッシュ値を攻撃することができます。ボブが正常にこれらの項目を予測した場合、攻撃が成功した衝突耐性攻撃が必要です。 （アリスが署名の一部として、鍵付きハッシュ関数を使用する場合、ボブは難しく、時間予測にキー値を有するであろうように、この攻撃がより困難になることが予想されます。）"
    },
    {
      "indent": 3,
      "text": "It should be noted that both of these attacks are considered to be more difficult than the attack on the body since more structure is designed into the data to be hashed than is frequently found in the body and the data is shorter in length than that of the body.",
      "ja": "より多くの構造が頻繁に体で発見されたよりも、ハッシュ化されるようにデータに設計されており、データはよりも長さが短いされているので、これらの攻撃の両方が身体への攻撃よりも困難であると考えられていることに留意すべきです体。"
    },
    {
      "indent": 3,
      "text": "The successful prediction of the signing-time attribute is expected to be more difficult than with certificates as the time would not generally be rounded. Time stamp services can make this more unpredictable by using a random delay before issuing the signature.",
      "ja": "署名時刻属性の成功予測は、時間などの証明書を持つよりも困難であることが予想され、一般的に丸められないでしょう。タイムスタンプサービスは、署名を発行する前に、ランダム遅延を使用して、これはより予測不可能にすることができます。"
    },
    {
      "indent": 3,
      "text": "Allowing a third party to provide a hash value could potentially make an attack simpler when keyed hash functions are used since there is more data than can be modified without changing the overall structure of the signed attribute structure.",
      "ja": "署名された属性構造の全体的な構造を変更することなく変更することができるよりも多くのデータがあるので、鍵付きハッシュ関数が使用される場合、ハッシュ値を提供するためにサードパーティを許可すると、潜在的な攻撃を簡単にできました。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Sean Turner IECA, Inc. 3057 Nutley Street, Suite 106 Fairfax, VA 22031 USA",
      "ja": "ショーン・ターナーIECA株式会社3057ナトリーストリート、スイート106バージニア州フェアファクス22031 USA"
    },
    {
      "indent": 3,
      "text": "EMail: turners@ieca.com",
      "ja": "メールアドレス：turners@ieca.com"
    },
    {
      "indent": 3,
      "text": "Jim Schaad Soaring Hawk Consulting",
      "ja": "ジムSchaad高騰ホークコンサルティング"
    },
    {
      "indent": 3,
      "text": "EMail: jimsch@exmsft.com",
      "ja": "メールアドレス：jimsch@exmsft.com"
    }
  ]
}