{
  "title": {
    "text": "RFC 5645 - Update to the Language Subtag Registry",
    "ja": "RFC 5645 - 言語サブタグレジストリへのアップデート"
  },
  "number": 5645,
  "created_at": "2019-10-24 07:28:03.711226+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                      D. Ewell, Ed.\nRequest for Comments: 5645                                    Consultant\nCategory: Informational                                   September 2009",
      "raw": true
    },
    {
      "indent": 17,
      "text": "Update to the Language Subtag Registry",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This memo defines the procedure used to update the IANA Language Subtag Registry, in conjunction with the publication of RFC 5646, for use in forming tags for identifying languages.",
      "ja": "このメモは、言語を識別するためのタグを形成する際に使用するために、RFC 5646の刊行物に関連して、IANA言語サブタグレジストリを更新するために使用される手順を定義します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモはインターネットコミュニティのための情報を提供します。それはどんな種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2009 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2009 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents in effect on the date of publication of this document (http://trustee.ietf.org/license-info). Please review these documents carefully, as they describe your rights and restrictions with respect to this document.",
      "ja": "この文書では、BCP 78と、この文書（http://trustee.ietf.org/license-info）の発行日に有効なIETFドキュメントに関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  2\n2.  Updating the Registry  . . . . . . . . . . . . . . . . . . . .  2\n  2.1.  Starting Point . . . . . . . . . . . . . . . . . . . . . .  2\n  2.2.  New Language Subtags . . . . . . . . . . . . . . . . . . .  4\n  2.3.  Modified Language Subtags  . . . . . . . . . . . . . . . .  5\n  2.4.  New Region Subtags . . . . . . . . . . . . . . . . . . . .  6\n  2.5.  Grandfathered and Redundant Tags . . . . . . . . . . . . .  6\n  2.6.  Preferred-Value Changes  . . . . . . . . . . . . . . . . .  9\n  2.7.  Additional Changes . . . . . . . . . . . . . . . . . . . .  9\n3.  Updated Registry Contents  . . . . . . . . . . . . . . . . . . 10\n4.  Security Considerations  . . . . . . . . . . . . . . . . . . . 10\n5.  IANA Considerations  . . . . . . . . . . . . . . . . . . . . . 11\n6.  References . . . . . . . . . . . . . . . . . . . . . . . . . . 11\n  6.1.  Normative References . . . . . . . . . . . . . . . . . . . 11\n  6.2.  Informative References . . . . . . . . . . . . . . . . . . 12\nAppendix A.  Acknowledgements  . . . . . . . . . . . . . . . . . . 13",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "[RFC4646] provides for a Language Subtag Registry and describes its format. The initial contents of the registry and rules for determining them are specified in [RFC4645].",
      "ja": "[RFC4646]は言語サブタグレジストリを提供し、そのフォーマットを記述する。これらを決定するための最初の登録の内容とルールは、[RFC4645]で指定されています。"
    },
    {
      "indent": 3,
      "text": "[RFC5646] expands on [RFC4646] by adding support for approximately 7,500 new primary and extended language subtags based on [ISO639-3] and [ISO639-5] alpha-3 code elements, and seven new region subtags based on [ISO3166-1] exceptionally reserved code elements. This memo describes the process of updating the registry to include these additional subtags and to make secondary changes to the registry that result from adding the new subtags and from other decisions made by the Language Tag Registry Update (LTRU) Working Group.",
      "ja": "[RFC5646]は[ISO639-3]に基づいて、約7,500の新しいプライマリおよび拡張言語サブタグのサポートと[ISO639-5]アルファ-3コード要素、および[ISO3166-1に基づいて、7つの新しい領域サブタグを追加することによって、[RFC4646]に拡大します】例外コード要素を予約。このメモは、これらの追加サブタグを含めるようにして、新しいサブタグを追加するのと言語タグレジストリの更新（LTRU）ワーキンググループによって行われた他の決定から生じるレジストリへの二次的変更を加えるために、レジストリを更新する処理を記述しています。"
    },
    {
      "indent": 3,
      "text": "In writing this document, a complete replacement of the contents of the Language Subtag Registry was provided to the Internet Assigned Numbers Authority (IANA) to record the necessary updates.",
      "ja": "この文書を書くには、言語サブタグレジストリの内容の完全な交換が必要な更新を記録するために、IANA（Internet Assigned Numbers Authority）のに提供されました。"
    },
    {
      "indent": 3,
      "text": "The format of the Language Subtag Registry as well as the definition and intended purpose of each of the fields are described in [RFC5646].",
      "ja": "各フィールドの言語サブタグレジストリの形式並びに定義と意図される目的は、[RFC5646]に記載されています。"
    },
    {
      "indent": 3,
      "text": "The registry is expected to change over time, as new subtags are registered and existing subtags are modified or deprecated. The process of updating the registry is described in Section 3 of [RFC5646].",
      "ja": "新しいサブタグが登録されており、既存のサブタグが変更または廃止されて、レジストリは、時間の経過とともに変化することが予想されます。レジストリを更新する処理は、[RFC5646]のセクション3に記載されています。"
    },
    {
      "indent": 3,
      "text": "Many of the subtags defined in the Language Subtag Registry are based on code elements defined in [ISO639-1], [ISO639-2], [ISO639-3], [ISO639-5], [ISO3166-1], [ISO15924], and [UN_M.49]. The registry is not a mirror of the code lists defined by these standards and should not be used as one.",
      "ja": "言語サブタグレジストリに定義されたサブタグの多くは、[ISO639-1]、[ISO639-2]、[ISO639-3]、[ISO639-5]、[ISO3166-1]、[ISO15924]で定義されたコード要素に基づいています、および[UN_M.49]。レジストリは、これらの規格で定義されたコードのリストのミラーではなく、一つとして使用すべきではありません。"
    },
    {
      "indent": 0,
      "text": "2. Updating the Registry",
      "section_title": true,
      "ja": "2.レジストリの更新"
    },
    {
      "indent": 3,
      "text": "This section describes the process for determining the updated contents of the Language Subtag Registry.",
      "ja": "このセクションでは、言語サブタグレジストリの更新された内容を決定するためのプロセスについて説明します。"
    },
    {
      "indent": 0,
      "text": "2.1. Starting Point",
      "section_title": true,
      "ja": "2.1。出発点"
    },
    {
      "indent": 3,
      "text": "The version of the Language Subtag Registry that was current at the time of IESG approval of this memo served as the starting point for this update. This version was created according to the process described in [RFC4645] and maintained according to the process described in [RFC4646].",
      "ja": "このメモのIESG承認の時点で最新だった言語サブタグレジストリのバージョンは、このアップデートのための出発点として役立ちました。このバージョンは、[RFC4646]に記載の方法に従って、[RFC4645]に記載の方法に従って作成され、維持されました。"
    },
    {
      "indent": 3,
      "text": "The source data for [ISO639-3] used for this update consisted of three files, available from the official site of the ISO 639-3 Registration Authority. (Note that this file is updated from time to time. The version used in the preparation of this memo was the one in place on February 24, 2009.)",
      "ja": "このアップデートに使用する[ISO639-3]のソースデータは、ISO 639-3登録機関の公式サイトから入手できる3つのファイルで構成されていました。 （このファイルは随時更新されることに注意してください。このメモの作成に使用されたバージョンを代わりに一つは、2009年2月24日にありました）"
    },
    {
      "indent": 3,
      "text": "o [iso-639-3_20090210] is a list of all language code elements in [ISO639-3], including the alpha-3 code element and reference name for each code element. For example, the entry for the Dari language contained the code element 'prs' and the name \"Dari\" (among other information).",
      "ja": "O [ISO-639-3_20090210は、各コード要素のアルファ-3コード要素と参照名を含む[ISO639-3]内のすべての言語のコード要素のリストです。例えば、ダリー語のエントリは、コード要素「PRS」と名称「ダリー」（他の情報のうち）を含有しました。"
    },
    {
      "indent": 3,
      "text": "o [iso-639-3_Name_Index_20090210] is a list containing all names associated with each language according to [ISO639-3], including both inverted and non-inverted forms where appropriate. An \"inverted\" name is one that is altered from the usual English-language order by moving adjectival qualifiers to the end, after the main language name and separated by a comma. A code element may have more than one entry in this file; the reference name and its inverted form are usually, but not always, given in the first entry. For example, this file contained an entry for the code element 'prs' with the name \"Dari\" (twice) and another entry with the names \"Eastern Farsi\" and \"Farsi, Eastern\".",
      "ja": "O [ISO-639-3_Name_Index_20090210]は、適切な場合、両方の反転および非反転の形態を含む[ISO639-3]に従って各言語に関連付けられているすべての名前を含むリストです。 「逆」の名前は、主言語名の後に、末尾に形容詞修飾子を移動させることにより、通常の英語の順序から変更し、コンマで分離されたものです。コード要素は、このファイルに複数のエントリを有していてもよいです。参照名とその反転形式は、通常は、常にではないが、最初のエントリに与えられました。たとえば、このファイルの名前は「ダリ」（2回）と名称「東ペルシア語」と「ペルシャ語、東」と別のエントリでコード要素「PRS」のエントリが含まれていました。"
    },
    {
      "indent": 3,
      "text": "o [iso-639-3-macrolanguages_20090120] is a list of all alpha-3 code elements for languages that are encompassed by a macrolanguage in [ISO639-3], together with the alpha-3 code element for the macrolanguage. For example, a line containing the code elements 'fas' and 'prs' indicated that the macrolanguage \"Persian\" encompasses the individual language \"Dari\". (Note that these alpha-3 code elements may not have corresponded directly to subtags in the registry, which uses 2-letter subtags derived from [ISO639-1] when possible.)",
      "ja": "O [ISO-639-3-macrolanguages_20090120]は共にmacrolanguageのアルファ-3コード要素と、全てのアルファ-3 [ISO639-3]でmacrolanguageに包含される言語のコード要素のリストです。例えば、コード要素「FAS」と「PRS」を含む行はmacrolanguage「ペルシャ」は、個々の言語「ダリー」を包含することを示しました。 （これらのアルファ-3コード要素が[ISO639-1]可能な場合に由来する2文字のサブタグを使用して、レジストリ内のサブタグに直接対応していないかもしれないことに注意してください。）"
    },
    {
      "indent": 3,
      "text": "The source data for [ISO639-5] used for this update consisted of one file, available from the official site of the ISO 639-5 Registration Authority. (Note that this file is updated from time to time. The version used in the preparation of this memo was the one in place on February 24, 2009.)",
      "ja": "[ISO639-5]このアップデートに使用するためのソースデータはISO 639から5登録機関の公式サイトから入手できる一つのファイルからなっていました。 （このファイルは随時更新されることに注意してください。このメモの作成に使用されたバージョンを代わりに一つは、2009年2月24日にありました）"
    },
    {
      "indent": 3,
      "text": "o [iso639-5.tab.txt] is a list of all language code elements in [ISO639-5], including the alpha-3 code elements and English name for each code element. For example, this file includes an entry containing the code element 'ira' and the name \"Iranian languages\" (among other information).",
      "ja": "O [iso639-5.tab.txt各コード要素のアルファ-3コード要素と英語名を含む[ISO639-5]内のすべての言語のコード要素のリストです。例えば、このファイルはコード要素「IRA」と名前（他の情報の中で）「イランの言語」を含むエントリを含みます。"
    },
    {
      "indent": 3,
      "text": "Language code elements that were already retired in all of the source standards prior to IESG approval of this memo were not listed in these files and, consequently, were not considered in this update.",
      "ja": "すでにこのメモのIESG承認する前に、ソース基準のすべてに引退された言語コード要素は、結果的に、このアップデートでは考慮されなかった、これらのファイルに記載されているとされませんでした。"
    },
    {
      "indent": 3,
      "text": "The values of the File-Date field, the Added date for each new subtag record, and the Deprecated date for each existing grandfathered or redundant tag deprecated by this update were set to a date as near as practical to the date this memo was approved for publication by IESG.",
      "ja": "このメモは、承認された日付に関する実用に近いとファイル・日付フィールドの値は、それぞれの新しいサブタグレコードを追加しました日付、およびこの更新によって廃止予定の既存の各適用除外や冗長タグの廃止予定の日付が日付に設定されましたIESGによる刊行。"
    },
    {
      "indent": 0,
      "text": "2.2. New Language Subtags",
      "section_title": true,
      "ja": "2.2。新しい言語サブタグ"
    },
    {
      "indent": 3,
      "text": "For each language in [ISO639-3] that was not already represented by a language subtag in the Language Subtag Registry, a new language subtag was added to the registry, using the [ISO639-3] code element as the value for the Subtag field and using each of the non-inverted [ISO639-3] names as a separate Description field. The [ISO639-3] reference name is represented by the first Description field.",
      "ja": "既に言語サブタグレジストリの言語サブタグで表されなかった、新しい言語サブタグがサブタグフィールドの値として[ISO639-3]コード要素を使用して、レジストリに追加したISO639-3]における各言語の別個の記述フィールドとして非反転[ISO639-3]名のそれぞれを使用して。 【ISO639-3]参照名は、最初に説明フィールドで表されます。"
    },
    {
      "indent": 3,
      "text": "If the language was encompassed by one of the [ISO639-3] macrolanguages 'ar' (Arabic), 'kok' (Konkani), 'ms' (Malay), 'sw' (Swahili), 'uz' (Uzbek), or 'zh' (Chinese), as determined by [iso-639-3-macrolanguages_20090120], an extended language subtag was also added, with the primary language subtag of the macrolanguage as the value for the Prefix field. These macrolanguage subtags were already present in the Language Subtag Registry and were chosen because they were determined by the LTRU Working Group to have been used to represent a single dominant language as well as the macrolanguage as a whole, making the extended language mechanism suitable for languages encompassed by the macrolanguage.",
      "ja": "言語は[ISO639-3] macrolanguages 'AR'（アラビア語）、 'コック'（コンカニ）、 'MS'（マレー）、 'SW'（スワヒリ語）、 'UZ'（ウズベク）のいずれかによって包含された場合、又は「ZH」（中国語）は、[ISO-639-3-macrolanguages_20090120]によって決定されるように、拡張言語サブタグもPrefixフィールドの値としてmacrolanguageの主要言語サブタグで、添加しました。これらのmacrolanguageサブタグは、言語サブタグレジストリ内に既に存在し、それらは言語に適した拡張言語メカニズムを作り、一つの支配的な言語だけでなく、全体としてmacrolanguageを表すために使用されているとLTRUワーキンググループによって決定されたので選ばれましたmacrolanguageに包含されます。"
    },
    {
      "indent": 3,
      "text": "If the name of the language included the word \"Sign\", an extended language subtag was added, with the string \"sgn\" as the value for the Prefix field. This is a special case that treats the existing primary language subtag for \"Sign languages\" as if it were a macrolanguage encompassing all sign languages.",
      "ja": "言語の名前が単語が含まれている場合拡張言語サブタグは、プレフィックスフィールドの値として文字列「SGN」と、加えて、「サイン」。これは、すべての手話を網羅macrolanguageであるかのように「手話」のための既存の第一言語サブタグを扱う特殊なケースです。"
    },
    {
      "indent": 3,
      "text": "All extended language subtags were added with a Preferred-Value equal to the corresponding primary language subtag.",
      "ja": "すべての拡張言語サブタグは、対応する一次言語サブタグに等しい優先値を有する添加しました。"
    },
    {
      "indent": 3,
      "text": "If the language was encompassed by a macrolanguage, as determined by [iso-639-3-macrolanguages_20090120], a Macrolanguage field was added for the encompassed language, with a value equal to the subtag of the macrolanguage. (Note that 'sgn' is defined as a \"collection code\" by [ISO639-3] and hence is not included in that standard; therefore, no Macrolanguage field was added for sign language subtags.)",
      "ja": "[ISO-639-3-macrolanguages_20090120]によって決定されるような言語は、macrolanguageによって包含された場合、Macrolanguageフィールドはmacrolanguageのサブタグに等しい値で、包含言語のために添加しました。 （「SGNが」[ISO639-3]によって「コレクション・コード」として定義され、従って、その標準に含まれていないことに注意してください。そのため、Macrolanguageフィールドは手話サブタグのために添加しませんでした。）"
    },
    {
      "indent": 3,
      "text": "If the language was assigned a \"Scope\" value of 'M' (Macrolanguage) in [iso-639-3_20090210], a Scope value of \"macrolanguage\" was added",
      "ja": "言語は[ISO-639-3_20090210]に「M」（Macrolanguage）の「スコープ」の値を割り当てられている場合、「macrolanguage」の範囲の値を加え"
    },
    {
      "indent": 3,
      "text": "for the language. Otherwise, if the language was assigned a \"Scope\" value of 'S' (Special), a Scope value of \"special\" was added. Most languages in [ISO639-3] have scope 'I' (Individual) and thus were not assigned a Scope value in the registry.",
      "ja": "言語のため。言語は「S」（スペシャル）の「範囲」の値を割り当てられている場合それ以外の場合は、「特別」の範囲の値が追加されました。 [ISO639-3]でほとんどの言語は、スコープ「I」（個人）を持っているので、レジストリ内のスコープ値が割り当てられていませんでした。"
    },
    {
      "indent": 3,
      "text": "For each language in [iso639-5.tab.txt] that was not already represented by a language subtag in the Language Subtag Registry, a new language subtag was added to the registry, using the [ISO639-5] code element as the value for the Subtag field and using the \"English name\" field as the Description field. Each of these languages was assigned a Scope value of \"collection\" in the registry.",
      "ja": "既に言語サブタグレジストリの言語サブタグで表されなかった[iso639-5.tab.txt]の各言語に対して、新しい言語サブタグ値として[ISO639-5]コード要素を使用して、レジストリに追加されましたサブタグフィールドと説明フィールドとして「英語名」フィールドを使用します。これらの言語のそれぞれには、レジストリに「コレクション」のスコープ値を割り当てました。"
    },
    {
      "indent": 3,
      "text": "All subtags were added to the registry maintaining alphabetical order within each type of subtag: all 2-letter \"language\" subtags first, then all 3-letter \"language\" subtags, and finally all \"extlang\" subtags. Some existing records were moved to ensure this order.",
      "ja": "最終的には最初にすべての2文字の「言語」サブタグ、すべての3文字の「言語」サブタグ、およびすべての「extlang」サブタグ：すべてのサブタグは、サブタグの各タイプ内でアルファベット順を維持し、レジストリに追加されました。いくつかの既存のレコードは、この順序を保証するために移動しました。"
    },
    {
      "indent": 0,
      "text": "2.3. Modified Language Subtags",
      "section_title": true,
      "ja": "2.3。変更された言語サブタグ"
    },
    {
      "indent": 3,
      "text": "For each language in [ISO639-3] that was already represented by a language subtag in the Language Subtag Registry, Description fields were added as necessary to reflect all non-inverted names listed for that language in [iso-639-3_Name_Index_20090210]. Any existing Description fields that reflected inverted names or that represented a strict subset of the information provided by the [ISO639-3] name were deleted. An example of the latter was the name \"Ainu\" for the subtag 'ain', which provided less information than the [ISO639-3] name \"Ainu (Japan)\".",
      "ja": "既に言語サブタグレジストリの言語サブタグで表さしたISO639-3]の各言語については、説明フィールドはでその言語のために記載されているすべての非反転名を反映するように必要に応じて添加した[ISO-639-3_Name_Index_20090210]。反転名前を反射またはそれが[ISO639-3]名によって提供される情報の厳密なサブセットを表して既存の記述フィールドが削除されました。後者の例は、[ISO639-3]名「アイヌ（日本）」よりも少ない情報を提供サブタグ「AIN」の名称「アイヌ」でした。"
    },
    {
      "indent": 3,
      "text": "The order of Description fields was adjusted to ensure that the reference name from [ISO639-3] was listed first, followed by other names from [ISO639-3] in the order presented by that standard, followed by any other names already existing in the registry. In some cases, this resulted in a reordering of Description fields for existing entries, even when no new values were added.",
      "ja": "説明フィールドの順序は、最初に列挙されている規格で提示された順序で[ISO639-3]から他の名前に続いて、既に存在する任意の他の名前が続いた[ISO639-3]から参照名ことを確実にするために調整しました。レジストリ。いくつかのケースでは、これは何も新しい値が追加されなかった場合でも、既存のエントリの説明フィールドの並べ替えになりました。"
    },
    {
      "indent": 3,
      "text": "For each language that was encompassed by a macrolanguage in [ISO639-3], a Macrolanguage field was added, with a value equal to the subtag of the macrolanguage.",
      "ja": "【ISO639-3]でmacrolanguageに包含された言語ごとに、Macrolanguageフィールドはmacrolanguageのサブタグに等しい値で、添加しました。"
    },
    {
      "indent": 3,
      "text": "For each language in [iso639-5.tab.txt] that was already represented in the Language Subtag Registry, the Description field was adjusted as necessary to match the \"English name\" field in [iso639-5.tab.txt]. Names in inverted form were rearranged to remove the inversion. Each of these languages was assigned a Scope value of \"collection\". Existing language subtags whose code elements were assigned prior to the publication of [ISO639-3] or [ISO639-5] and that were identified by the [ISO639-3] Registration Authority as representing collections",
      "ja": "既に言語サブタグレジストリに示された[iso639-5.tab.txt]の各言語については、説明フィールドは、[iso639-5.tab.txt]における「英語名」フィールドと一致するように必要に応じて調整しました。反転形式で名前が反転を取り除くために再配列されました。これらの言語のそれぞれは、「コレクション」のスコープ値を割り当てました。そのコード要素のコレクションを表すようISO639-3]登録機関によって[ISO639-3]または[ISO639-5]の出版前に割り当てられ、それが同定された既存の言語サブタグ"
    },
    {
      "indent": 3,
      "text": "were also assigned a Scope value of \"collection\", even though they are not listed as such in [iso639-5.tab.txt].",
      "ja": "また、彼らは[iso639-5.tab.txt]でそのように記載されていないにもかかわらず、「コレクション」のスコープ値を割り当てました。"
    },
    {
      "indent": 3,
      "text": "Note in particular that the change from [ISO639-2] names such as \"Afro-Asiatic (Other)\" to [ISO639-5] names such as \"Afro-Asiatic languages\" implies a broadening of scope for some of these subtags, designated \"remainder groups\" in [ISO639-5]. While [iso639-5.tab.txt] includes a field indicating which code elements are designated as \"groups\" or \"remainder groups\" in [ISO639-2], [RFC5646] does not make this distinction, and consequently this field was not used in updating the Language Subtag Registry.",
      "ja": "例えば、このような「アフロ・アジア言語」などの名前[ISO639-5]に「アフロ・アジア（その他）」などの名前[ISO639-2]からの変化は、これらのサブタグのいくつかのスコープの拡大を意味することを特に注意し、指定されました【ISO639-5]の「余り基」。 【iso639-5.tab.txt]は、コード要素が[ISO639-2]、[RFC5646]はこの区別をしない、その結果、この分野ではなかったで「グループ」または「残り基」として指定される示すフィールドを含むが言語サブタグレジストリの更新に使用されます。"
    },
    {
      "indent": 3,
      "text": "A Scope value of \"private-use\" was added for the unique record with Subtag value 'qaa..qtz'. This record has a Description of \"Private use\" (changed from \"PRIVATE USE\") and corresponds to a range of code elements that is reserved for private use in [ISO639-2]. The Description fields for script and region private-use subtags were also capitalized as \"Private use\".",
      "ja": "「私的使用」の範囲の値をサブタグ値「qaa..qtz」で一意のレコードのために追加されました。このレコードは、（「私的使用」から変更）「私的使用」の説明があり、[ISO639-2]で私的使用のために予約されているコード要素の範囲に相当します。スクリプトと地域私的使用のためのサブタグ説明フィールドも、「私的使用」として資産計上されました。"
    },
    {
      "indent": 0,
      "text": "2.4. New Region Subtags",
      "section_title": true,
      "ja": "2.4。新しい地域サブタグ"
    },
    {
      "indent": 3,
      "text": "[RFC5646] expands the scope of region subtags by adding subtags based on code elements defined as \"exceptionally reserved\" in [ISO3166-1]. These code elements are reserved by the ISO 3166 Maintenance Agency \"at the request of national ISO member bodies, governments and international organizations\". At the time of IESG approval of this memo, ISO 3166/MA had defined nine exceptionally reserved code elements, all of which were added to the Language Subtag Registry except for the following:",
      "ja": "[RFC5646]は[ISO3166-1]に「非常に予約済み」として定義されたコード要素に基づいサブタグを追加することにより、領域サブタグの範囲を拡大します。これらのコード要素は、「国家のISO会員団体、政府や国際機関の要請に応じて、」ISO 3166維持管理機関によって予約されています。このメモのIESG承認の時には、ISO 3166 / MAは、以下を除き、言語サブタグレジストリに追加されたすべてが9つの非常に予約済みのコード要素を、定義されていました："
    },
    {
      "indent": 3,
      "text": "o 'FX' (Metropolitan France) was already present in the Language Subtag Registry because it was an assigned [ISO3166-1] code element from 1993 to 1997, but was deprecated with a Preferred-Value of \"FR\".",
      "ja": "それは1993年から1997年まで割り当て[ISO3166-1]コード​​要素であったが、「FR」の優先値を有する非推奨されたため、O「FX」（メトロポリタンフランス）が既に言語サブタグレジストリに存在しました。"
    },
    {
      "indent": 3,
      "text": "o 'UK' (United Kingdom) was not added because it is associated with the same UN M.49 code (826) as the existing region subtag 'GB'. [RFC5646], Section 3.4, item 15 (D) states that a new region subtag is not added to the Language Subtag Registry if it carries the same meaning as an existing region subtag.",
      "ja": "それは既存の地域サブタグ「GB」と同じUN M.49コード（826）に関連付けられているので、O '英国（イギリス）を添加しませんでした。 [RFC5646]、セクション3.4、項目15（D）は、既存の領域サブタグと同じ意味を運ぶ場合、新しい領域サブタグ言語サブタグレジストリに追加されないことを述べています。"
    },
    {
      "indent": 0,
      "text": "2.5. Grandfathered and Redundant Tags",
      "section_title": true,
      "ja": "2.5。適用除外と冗長タグ"
    },
    {
      "indent": 3,
      "text": "As stated in [RFC5646], \"grandfathered\" and \"redundant\" tags are complete tags in the Language Subtag Registry that were registered under [RFC1766] or [RFC3066] and remain valid. Grandfathered tags cannot be generated from a valid combination of subtags, while redundant tags can be.",
      "ja": "[RFC5646]で述べたように、「適用除外」と「冗長」タグ[RFC1766]か[RFC3066]の下に登録し、有効なままにされた言語サブタグレジストリに完全なタグです。冗長なタグをすることができるが、適用除外のタグは、サブタグの有効な組み合わせから生成することができません。"
    },
    {
      "indent": 3,
      "text": "Under certain conditions, registration of a subtag under [RFC5646] may cause a grandfathered tag to be reclassified as redundant. It may also enable the creation of a generative tag with the same meaning as a grandfathered or redundant tag; in that case, the grandfathered or redundant tag is marked as Deprecated, and the generative tag (including the new subtag) becomes its Preferred-Value.",
      "ja": "特定の条件下では、[RFC5646]のサブタグの登録は、冗長として再分類される適用除外タグを引き起こす可能性があります。それはまた、適用除外または冗長タグと同じ意味を持つ生成的タグの作成を可能にすることができます。その場合には、適用除外または冗長タグは廃止とマークされ、そして（新しいサブタグを含む）を生成的なタグは、その好ましい-値となります。"
    },
    {
      "indent": 3,
      "text": "As a result of adding the new subtags in this update, each of the following grandfathered tags became composable, were reclassified as redundant, and were deprecated with the indicated generative tag serving as the Preferred-Value:",
      "ja": "この更新で新しいサブタグを追加した結果、以下の適用除外タグのそれぞれが構成可能になり、冗長として再分類し、そして好ましい-値として示される生成的タグと非推奨されました。"
    },
    {
      "indent": 6,
      "text": "zh-cmn (Preferred-Value: cmn)",
      "ja": "ZH-CMN（優先-値：CMN）"
    },
    {
      "indent": 6,
      "text": "zh-cmn-Hans (Preferred-Value: cmn-Hans)",
      "ja": "ZH-CMN-彼（優先-値：CMN-彼）"
    },
    {
      "indent": 6,
      "text": "zh-cmn-Hant (Preferred-Value: cmn-Hant)",
      "ja": "ZH-CMN-ハント（優先-値：CMN-ハント）"
    },
    {
      "indent": 6,
      "text": "zh-gan (Preferred-Value: gan)",
      "ja": "ZH-のGaN（優先-値：窒化ガリウム）"
    },
    {
      "indent": 6,
      "text": "zh-wuu (Preferred-Value: wuu)",
      "ja": "ZH-彼（優先-値：彼）"
    },
    {
      "indent": 6,
      "text": "zh-yue (Preferred-Value: yue)",
      "ja": "この - 月（推奨値：ヶ月）"
    },
    {
      "indent": 3,
      "text": "The following grandfathered tags were deprecated, with the indicated generative tag serving as the Preferred-Value:",
      "ja": "以下の適用除外タグが示された生成タグが好ましい-値として用いて、非推奨されました。"
    },
    {
      "indent": 6,
      "text": "i-ami (Preferred-Value: ami)",
      "ja": "I-AMI（優先-値：AMI）"
    },
    {
      "indent": 6,
      "text": "i-bnn (Preferred-Value: bnn)",
      "ja": "I-BNN（優先-値：BNN）"
    },
    {
      "indent": 6,
      "text": "i-pwn (Preferred-Value: pwn)",
      "ja": "I-PWN（優先-値：PWN）"
    },
    {
      "indent": 6,
      "text": "i-tao (Preferred-Value: tao)",
      "ja": "I-TAO（優先-値：TAO）"
    },
    {
      "indent": 6,
      "text": "i-tay (Preferred-Value: tay)",
      "ja": "I-テイ（優先-値：テイ）"
    },
    {
      "indent": 6,
      "text": "i-tsu (Preferred-Value: tsu)",
      "ja": "I-TSU（優先-値：TSU）"
    },
    {
      "indent": 6,
      "text": "zh-hakka (Preferred-Value: hak)",
      "ja": "ZH-客家（優先-値：HAK）"
    },
    {
      "indent": 6,
      "text": "zh-min (no Preferred-Value; see below)",
      "ja": "ZH-分（NO好ましい-値;以下を参照のこと）"
    },
    {
      "indent": 6,
      "text": "zh-min-nan (Preferred-Value: nan)",
      "ja": "ZH-MIN-に（優先-値：時）"
    },
    {
      "indent": 6,
      "text": "zh-xiang (Preferred-Value: hns)",
      "ja": "ZH-翔（優先-値：HNS）"
    },
    {
      "indent": 3,
      "text": "The tag \"zh-min\", originally registered under [RFC1766], is a special case: it represents a small class of Chinese languages, but is not a true macrolanguage. The string \"min\" could not ever be used to tag these languages since the [ISO639-3] code element 'min' is assigned to an individual language (Minangkabau) that is not related to Chinese ('zh'). Because it is not believed to represent a useful linguistic entity for tagging purposes, it was deprecated without a Preferred-Value.",
      "ja": "それは中国の言語の小さなクラスを表すが、真macrolanguageではありません。元々[RFC1766]の下に登録されたタグ「ZH-min」は、特殊なケースです。 [ISO639-3]コード要素「分」が中国に関連していない個々の言語（ミナンカバウ）（「ZH」）に割り当てられているので、文字列「min」はこれまでにこれらの言語をタグ付けするために使用することができませんでした。それはタグ付けのために便利な言語的実体を表すと考えられていないので、それが優先-値なしで廃止されました。"
    },
    {
      "indent": 3,
      "text": "The following grandfathered and redundant sign language tags were deprecated, with the indicated generative tag serving as the Preferred-Value:",
      "ja": "以下の適用除外冗長手話タグが示された生成タグが好ましい-値として用いて、非推奨されました。"
    },
    {
      "indent": 6,
      "text": "sgn-BE-FR (Preferred-Value: sfb)",
      "ja": "SGN-BE-FR（優先-値：SFB）"
    },
    {
      "indent": 6,
      "text": "sgn-BE-NL (Preferred-Value: vgt)",
      "ja": "SGN-BE-NL（優先-値：VGT）"
    },
    {
      "indent": 6,
      "text": "sgn-BR (Preferred-Value: bzs)",
      "ja": "SGN-BR（優先-値：BZS）"
    },
    {
      "indent": 6,
      "text": "sgn-CH-DE (Preferred-Value: sgg)",
      "ja": "SGN-CH-DE（優先-値：SGG）"
    },
    {
      "indent": 6,
      "text": "sgn-CO (Preferred-Value: csn)",
      "ja": "SGN-CO（優先-値：CSN）"
    },
    {
      "indent": 6,
      "text": "sgn-DE (Preferred-Value: gsg)",
      "ja": "SGN-DE（優先-値：GSG）"
    },
    {
      "indent": 6,
      "text": "sgn-DK (Preferred-Value: dsl)",
      "ja": "SGN-DK（優先-値：DSL）"
    },
    {
      "indent": 6,
      "text": "sgn-ES (Preferred-Value: ssp)",
      "ja": "SGN-ES（優先-値：SSP）"
    },
    {
      "indent": 6,
      "text": "sgn-FR (Preferred-Value: fsl)",
      "ja": "SGN-FR（優先-値：FSL）"
    },
    {
      "indent": 6,
      "text": "sgn-GB (Preferred-Value: bfi)",
      "ja": "SGN-GB（優先-値：BFI）"
    },
    {
      "indent": 6,
      "text": "sgn-GR (Preferred-Value: gss)",
      "ja": "SGN-GR（優先-値：GSS）"
    },
    {
      "indent": 6,
      "text": "sgn-IE (Preferred-Value: isg)",
      "ja": "SGN-IE（優先-値：ISG）"
    },
    {
      "indent": 6,
      "text": "sgn-IT (Preferred-Value: ise)",
      "ja": "SGN-IT（優先-値：ISE）"
    },
    {
      "indent": 6,
      "text": "sgn-JP (Preferred-Value: jsl)",
      "ja": "SGN-JP（優先-値：JSL）"
    },
    {
      "indent": 6,
      "text": "sgn-MX (Preferred-Value: mfs)",
      "ja": "SGN-MX（優先-値：MFS）"
    },
    {
      "indent": 6,
      "text": "sgn-NI (Preferred-Value: ncs)",
      "ja": "SGN-NI（優先-値：NCS）"
    },
    {
      "indent": 6,
      "text": "sgn-NL (Preferred-Value: dse)",
      "ja": "SGN-NL（優先-値：DSE）"
    },
    {
      "indent": 6,
      "text": "sgn-NO (Preferred-Value: nsl) sgn-PT (Preferred-Value: psr)",
      "ja": "SGN-NO（優先-値：NSL）SGN-PT（優先-値：PSR）"
    },
    {
      "indent": 6,
      "text": "sgn-SE (Preferred-Value: swl)",
      "ja": "SGN-SE（優先-値：SWL）"
    },
    {
      "indent": 6,
      "text": "sgn-US (Preferred-Value: ase)",
      "ja": "SGN-US（優先-値：ASE）"
    },
    {
      "indent": 6,
      "text": "sgn-ZA (Preferred-Value: sfs)",
      "ja": "SGN-ZA（優先-値：SFS）"
    },
    {
      "indent": 3,
      "text": "No change was made to the Description field(s) for any of the grandfathered or redundant tags. For example, the redundant tag \"sgn-US\" continues to carry the Description \"American Sign Language\". The sign language tags registered prior to [RFC4646] remain an exception to the general principle that the meaning of a non-grandfathered tag can be derived from its component subtags.",
      "ja": "変化は、適用除外または冗長タグのいずれかに対する記述フィールド（複数可）になされませんでした。例えば、冗長タグ「SGN-USは、」説明「アメリカの手話」を運ぶために続けています。先行[RFC4646]に登録されている手話タグが非適用除外タグの意味は、そのコンポーネントサブタグから誘導することができるという一般原則に対する例外残ります。"
    },
    {
      "indent": 3,
      "text": "In previous versions of the registry, grandfathered tags that had been deprecated as a result of adding an ISO 639-based language subtag included a Comments field, with a value of the form \"replaced by ISO code xxx\", where 'xxx' represented the new language subtag. These comments duplicated the information contained within the Preferred-Value field and were deleted as part of this update. No changes were made to other Comments fields.",
      "ja": "レジストリの以前のバージョンでは、ISO 639に基づく言語サブタグを追加した結果として、廃止された適用除外タグは、「XXX」は表さ、「ISOコードXXXで置き換え」形式の値と、コメントフィールドを含ま新しい言語サブタグ。これらのコメントは優先-Value]フィールドに含まれる情報を複製し、このアップデートの一部として削除されました。変更は、他のコメント欄に行われませんでした。"
    },
    {
      "indent": 0,
      "text": "2.6. Preferred-Value Changes",
      "section_title": true,
      "ja": "2.6。好適な価値の変更"
    },
    {
      "indent": 3,
      "text": "[RFC5646], Section 3.1.7 provides for the value of Preferred-Value fields to be updated as necessary to reflect changes in one of the source standards. Accordingly, the Preferred-Value fields for the following deprecated tags were changed:",
      "ja": "[RFC5646]、セクション3.1.7は、ソース規格の一つの変更を反映するために、必要に応じて更新されることが好ましいバリューフィールドの値を提供します。したがって、次の非推奨タグの優先値フィールドが変更されました："
    },
    {
      "indent": 6,
      "text": "i-hak (changed from zh-hakka to hak)",
      "ja": "そして、-HAK（ZH-客家からこのハックを変更）"
    },
    {
      "indent": 6,
      "text": "zh-guoyu (changed from zh-cmn to cmn)",
      "ja": "ZH-guoyu（ZH-CMN CMNへの変更）"
    },
    {
      "indent": 3,
      "text": "This makes it unnecessary for consumers of the Language Subtag Registry to follow a \"chain\" of Preferred-Values in order to arrive at a non-deprecated subtag.",
      "ja": "これは、不要な言語サブタグレジストリの消費者は非非推奨サブタグに到達するために優先値の「連鎖」に従うようになります。"
    },
    {
      "indent": 0,
      "text": "2.7. Additional Changes",
      "section_title": true,
      "ja": "2.7。その他の変更点"
    },
    {
      "indent": 3,
      "text": "For consistency with the handling of alternative names in language subtags, Description fields for script subtags taken from [ISO15924] that represent alternative names were converted to multiple Description fields. For example, the Description \"Han (Hanzi, Kanji, Hanja)\" was converted to four separate Description fields. Some Description fields for script subtags contained parenthetical material that was explanatory, rather than identifying alternative names; these fields were not altered.",
      "ja": "言語サブタグにおける代替名の取り扱いとの整合性のために、代替名を表す[ISO15924]から取られたスクリプトサブタグに対する記述フィールドは、複数の記述フィールドに変換しました。例えば、説明「漢（漢字、漢字、漢字）は、」4つの別個の記述フィールドに変換しました。スクリプトサブタグのためのいくつかの説明フィールドではなく代替名を特定するよりも、説明であった括弧材料を含ま。これらのフィールドは変更されませんでした。"
    },
    {
      "indent": 3,
      "text": "This situation does not apply to region subtags taken from [ISO3166-1] and [UN_M.49] because those standards do not provide freely available alternative names for code elements.",
      "ja": "この状況は、これらの基準は、コード要素のために自由に利用可能な代替名を提供していないので、[UN_M.49]と[ISO3166-1]から取られた領域サブタグには適用されません。"
    },
    {
      "indent": 3,
      "text": "Description fields in inverted form for script and region subtags were rearranged to remove the inversion, for consistency with the handling of language subtags in Sections 2.2 and 2.3. For example, the Description field \"Korea, Republic of\" was changed to \"Republic of Korea\".",
      "ja": "スクリプト地域サブタグ用反転形式で記述フィールドは、セクション2.2および2.3で言語サブタグの取り扱いとの整合性のために、反転を除去するために再配置しました。たとえば、説明フィールド「韓国、共和国の」は「大韓民国」に変更されました。"
    },
    {
      "indent": 3,
      "text": "The capitalization of the Subtag fields for certain grandfathered and redundant tags (sgn-BE-fr, sgn-BE-nl, sgn-CH-de, and yi-latn) was modified to conform with the capitalization conventions described in [RFC5646], Section 2.1.1. This has no effect on the validity or meaning of these tags.",
      "ja": "特定の適用除外冗長タグのサブタグフィールドの大文字（SGN-BE-FR、SGN-BE-NL、SGN-CHド、及びYI-LATN）は、[RFC5646]に記載の資本規則に適合するように変更されました2.1.1。これは、これらのタグの有効性や意味には影響を与えません。"
    },
    {
      "indent": 3,
      "text": "The Description field for subtag 'sgn' was capitalized as \"Sign languages\" to match the capitalization used for other languages in [ISO639-5], even though this capitalization does not exactly match that used for code element 'sgn' in any of the ISO 639 parts.",
      "ja": "「SGN」は、この総額は正確にしないのいずれかのコード要素「SGN」のために使用試合にもかかわらず、[ISO639-5]で他の言語を使用大文字と小文字を一致させるために、「言語のサイン」として資産計上されたサブタグのための説明フィールドISO 639の部品。"
    },
    {
      "indent": 3,
      "text": "The Deprecated field for the region subtag TP was modified from 2002- 11-15 to 2002-05-20, to correct a clerical error. The corrected date reflects the actual date the code element TP was withdrawn in [ISO3166-1].",
      "ja": "領域サブタグTPのための推奨されないフィールドが誤記を修正するために、2002年5月20日に2002- 11-15から変更されました。補正された日付は、コード要素TPが[ISO3166-1]で回収された実際の日付を反映しています。"
    },
    {
      "indent": 3,
      "text": "The order of fields within records in the registry was adjusted as necessary to match the order in which these fields are described in [RFC5646], Section 3.1.2. This ordering is not required by [RFC5646] and may not necessarily be reflected in future additions or modifications to the registry.",
      "ja": "レジストリ内のレコード内のフィールドの順序は、これらのフィールドは、[RFC5646]に記載された順序、セクション3.1.2と一致するように必要に応じて調整しました。この順序は、[RFC5646]によって必要とされず、必ずしもレジストリへの将来の追加または修正に反映されないかもしれません。"
    },
    {
      "indent": 0,
      "text": "3. Updated Registry Contents",
      "section_title": true,
      "ja": "3.更新されたレジストリの内容"
    },
    {
      "indent": 3,
      "text": "IANA has updated the Language Subtag Registry according to the provided replacement contents. The replacement content was listed in the working draft of this document, but was deleted prior to publication as an RFC to avoid potential confusion with the registry itself. The Language Subtag Registry is available from the IANA website, <http://www.iana.org>.",
      "ja": "IANAが提供する交換用の内容に応じて言語サブタグレジストリを更新しました。置換コンテンツは、この文書の草案に記載されていたが、レジストリ自体の潜在的な混乱を避けるためにRFCとして公表する前に削除されました。言語サブタグレジストリは、<http://www.iana.org>、IANAのWebサイトから入手可能です。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "For security considerations relevant to the Language Subtag Registry and the use of language tags, see [RFC5646].",
      "ja": "言語サブタグレジストリと言語タグの使用に関連するセキュリティ上の考慮事項については、[RFC5646]を参照してください。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "ja": "5. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has updated the Language Subtag Registry, which can be found via <http://www.iana.org>. For details on the procedures for the format and ongoing maintenance of this registry, see RFC 5646.",
      "ja": "IANAは、<http://www.iana.org>を経由して見つけることができる言語サブタグレジストリを更新しました。フォーマットと、このレジストリの継続的なメンテナンスのための手順の詳細については、RFC 5646を参照してください。"
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "ja": "6.参照"
    },
    {
      "indent": 0,
      "text": "6.1. Normative References",
      "section_title": true,
      "ja": "6.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[ISO639-3] International Organization for Standardization, \"ISO 639- 3:2007. Codes for the representation of names of languages - Part 3: Alpha-3 code for comprehensive coverage of languages\", February 2007.",
      "ja": "標準化のための[ISO639-3]国際組織、「ISO 639- 3：2007の言語の名前の表現のためのコード - 第3部：言語の包括的なカバレッジのためのアルファ3コード」、2007年2月。"
    },
    {
      "indent": 3,
      "text": "[ISO639-5] International Organization for Standardization, \"ISO 639- 5:2008. Codes for the representation of names of languages -- Part 5: Alpha-3 code for language families and groups\", May 2008.",
      "ja": "標準化のための[ISO639-5]国際組織、「ISO 639- 5：2008の言語の名前の表現のためのコード - 第5部：言語の家族やグループのためのアルファ3コード」、2008年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC5646] Phillips, A., Ed. and M. Davis, Ed., \"Tags for Identifying Languages\", RFC 5646, September 2009.",
      "ja": "[RFC5646]フィリップス、A.編。そして、M.デイヴィス、エド。、 \"言語を識別するためのタグ\"、RFC 5646、2009年9月。"
    },
    {
      "indent": 3,
      "text": "[iso-639-3-macrolanguages_20090120] International Organization for Standardization, \"ISO 639-3 Macrolanguage Mappings\", January 2009, <http:// www.sil.org/iso639-3/ iso-639-3-macrolanguages_20090120.tab>.",
      "ja": "[ISO-639-3-macrolanguages_20090120]国際標準化機構、 \"ISO 639-3 Macrolanguageマッピング\"、2009年1月、<のhttp：// www.sil.org/iso639-3/ iso-639-3-macrolanguages_20090120.tab >。"
    },
    {
      "indent": 3,
      "text": "[iso-639-3_20090210] International Organization for Standardization, \"ISO 639-3 Code Set\", February 2009, <http://www.sil.org/iso639-3/iso-639-3_20090210.tab>.",
      "ja": "[ISO-639-3_20090210]国際標準化機構、 \"ISO 639-3コードセット\"、2009年2月、<http://www.sil.org/iso639-3/iso-639-3_20090210.tab>。"
    },
    {
      "indent": 3,
      "text": "[iso-639-3_Name_Index_20090210] International Organization for Standardization, \"ISO 639-3 Language Names Index\", February 2009, <http://www.sil.org/ iso639-3/iso-639-3_Name_Index_20090210.tab>.",
      "ja": "[ISO-639-3_Name_Index_20090210]国際標準化機構、 \"ISO 639-3言語名インデックス\"、2009年2月、<http://www.sil.org/ iso639-3 / iso-639-3_Name_Index_20090210.tab>。"
    },
    {
      "indent": 3,
      "text": "[iso639-5.tab.txt] International Organization for Standardization, \"ISO 639-5 code list, Tab-delimited text\", February 2009, <http://www.loc.gov/standards/iso639-5/iso639-5.tab.txt>.",
      "ja": "[iso639-5.tab.txt]国際標準化機構、「ISO 639から5コードリスト、タブ区切りのテキスト」、2009年2月、<http://www.loc.gov/standards/iso639-5/iso639- 5.tab.txt>。"
    },
    {
      "indent": 0,
      "text": "6.2. Informative References",
      "section_title": true,
      "ja": "6.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[ISO15924] International Organization for Standardization, \"ISO 15924:2004. Information and documentation -- Codes for the representation of names of scripts\", January 2004.",
      "ja": "[ISO15924]国際標準化機構、「ISO 15924：2004の情報とドキュメンテーション - スクリプトの名前の表現のためのコード。」、2004年1月。"
    },
    {
      "indent": 3,
      "text": "[ISO3166-1] International Organization for Standardization, \"ISO 3166- 1:2006. Codes for the representation of names of countries and their subdivisions -- Part 1: Country codes\", November 2006.",
      "ja": "[ISO3166-1]標準化、国際機関「ISO 3166- 1：2006年の国とその下位区分の名前の表現のためのコード - 第1部：国コード」、2006年11月。"
    },
    {
      "indent": 3,
      "text": "[ISO639-1] International Organization for Standardization, \"ISO 639- 1:2002. Codes for the representation of names of languages -- Part 1: Alpha-2 code\", July 2002.",
      "ja": "標準化のための[ISO639-1]国際組織、「ISO 639- 1：2002の言語の名前の表現のためのコード - パート1：アルファ2コード」、2002年7月。"
    },
    {
      "indent": 3,
      "text": "[ISO639-2] International Organization for Standardization, \"ISO 639- 2:1998. Codes for the representation of names of languages -- Part 2: Alpha-3 code\", October 1998.",
      "ja": "[ISO639-2]標準化、国際機関「ISO 639- 2：1998の言語の名前の表現のためのコード - パート2：アルファ3コード」、1998年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC1766] Alvestrand, H., \"Tags for the Identification of Languages\", RFC 1766, March 1995.",
      "ja": "[RFC1766] Alvestrand、H.、 \"言語識別のためのタグ\"、RFC 1766、1995年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3066] Alvestrand, H., \"Tags for the Identification of Languages\", RFC 3066, January 2001.",
      "ja": "[RFC3066] Alvestrand、H.、 \"言語識別のためのタグ\"、RFC 3066、2001年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC4645] Ewell, D., \"Initial Language Subtag Registry\", RFC 4645, September 2006.",
      "ja": "[RFC4645]イーウェル、D.、 \"初期言語サブタグレジストリ\"、RFC 4645、2006年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC4646] Phillips, A. and M. Davis, \"Tags for Identifying Languages\", BCP 47, RFC 4646, September 2006.",
      "ja": "[RFC4646]フィリップス、A.とM.デイヴィス、 \"言語を識別するためのタグ\"、BCP 47、RFC 4646、2006年9月。"
    },
    {
      "indent": 3,
      "text": "[UN_M.49] Statistics Division, United Nations, \"Standard Country or Area Codes for Statistical Use\", Revision 4 (United Nations publication, Sales No. 98.XVII.9, June 1999.",
      "ja": "[UN_M.49]統計局、国連、「統計の使用のための標準的な国または地域コード」、リビジョン4（国連出版、販売号98.XVII.9、1999年6月。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Acknowledgements",
      "ja": "付録A.謝辞"
    },
    {
      "indent": 3,
      "text": "This memo is a collaborative work of the Language Tag Registry Update (LTRU) Working Group. All of its members have made significant contributions to this memo and to its predecessor, [RFC4645].",
      "ja": "このメモは、言語タグレジストリの更新（LTRU）ワーキンググループの共同作業です。そのメンバーのすべてがこのメモにし、その前身、[RFC4645]への重要な貢献をしました。"
    },
    {
      "indent": 3,
      "text": "Specific contributions to this memo were made by Stephane Bortzmeyer, John Cowan, Mark Davis, Martin Duerst, Frank Ellermann, Debbie Garside, Kent Karlsson, Gerard Lang, Addison Phillips, Randy Presuhn, and CE Whitehead.",
      "ja": "このメモへの具体的な貢献はステファンBortzmeyer、ジョン・コーワン、マーク・デイビス、マーティンDuerst、フランクEllermann、デビーGarside、ケント・カールソン、ジェラール・ラング、アディソン・フィリップス、ランディPresuhn、およびCEホワイトヘッドによって作られました。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Doug Ewell (editor) Consultant",
      "ja": "ダグイーウェル（編集者）コンサルタント"
    },
    {
      "indent": 3,
      "text": "EMail: doug@ewellic.org URI: http://www.ewellic.org",
      "ja": "電子メール：doug@ewellic.org URI：http://www.ewellic.org"
    }
  ]
}