{
  "title": {
    "text": "RFC 5398 - Autonomous System (AS) Number Reservation for Documentation Use",
    "ja": "RFC 5398 - ドキュメントの使用のための自律システム（AS）番号予約"
  },
  "number": 5398,
  "created_at": "2023-03-27 11:18:07.322268+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                          G. Huston\nRequest for Comments: 5398                                 December 2008\nCategory: Informational",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "Autonomous System (AS) Number Reservation for Documentation Use",
      "ja": "ドキュメントの使用のための自律システム（AS）番号予約"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモは、インターネットコミュニティに情報を提供します。いかなる種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2008 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2008 IETF Trustおよび文書著者として特定された人。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/ license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document.",
      "ja": "このドキュメントは、BCP 78およびIETFドキュメント（http://trustee.ietf.org/ license-info）に関連するIETF Trustの法的規定の対象となります。この文書に関するあなたの権利と制限を説明するので、これらの文書を注意深く確認してください。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "To reduce the likelihood of conflict and confusion when relating documented examples to deployed systems, two blocks of Autonomous System numbers (ASNs) are reserved for use in examples in RFCs, books, documentation, and the like. This document describes the reservation of two blocks of ASNs as reserved numbers for use in documentation.",
      "ja": "文書化された例を展開システムに関連付ける際に競合と混乱の可能性を減らすために、2つのブロックの自律システム数（ASN）は、RFC、書籍、ドキュメントなどの例で使用するために予約されています。このドキュメントでは、ドキュメントで使用するための予約数としての2つのブロックのASNの予約について説明しています。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "To reduce the likelihood of conflict and confusion when relating documented examples to deployed systems, two blocks of Autonomous System numbers (ASNs) are reserved for use in examples in RFCs, books, documentation, and the like. This document describes the reservation of two blocks of ASNs as reserved numbers for use in documentation.",
      "ja": "文書化された例を展開システムに関連付ける際に競合と混乱の可能性を減らすために、2つのブロックの自律システム数（ASN）は、RFC、書籍、ドキュメントなどの例で使用するために予約されています。このドキュメントでは、ドキュメントで使用するための予約数としての2つのブロックのASNの予約について説明しています。"
    },
    {
      "indent": 3,
      "text": "The problems such conflicts may cause have already been encountered with IPv4 addresses where literal use of documented examples in a production environment causes address and routing conflicts with existing services. Since private-use ASNs already have a context of use in deployed networks, these ASNs cannot be used in many example situations. In making an explicit allocation of a set of AS numbers reserved for documentation use, it is intended that any such operational problems may be avoided in the future.",
      "ja": "そのような競合が引き起こす可能性のある問題は、生産環境で文書化された例を文字通り使用することにより、既存のサービスとの対立とルーティングの競合を引き起こすIPv4アドレスですでに遭遇しています。個人用ASNはすでに展開されたネットワークで使用のコンテキストを持っているため、これらのASNは多くの例で使用することはできません。ドキュメントの使用のために予約されているASのセットの明示的な割り当てを行う際に、そのような運用上の問題は将来回避されることを意図しています。"
    },
    {
      "indent": 3,
      "text": "Similar considerations have been applied to IPv4 addresses [IANA.IPv4], IPv6 addresses [RFC3849], and domain names [RFC2606], and reservations have been made for similar purposes.",
      "ja": "同様の考慮事項は、IPv4アドレス[IANA.IPv4]、IPv6アドレス[RFC3849]、およびドメイン名[RFC2606]に適用され、同様の目的のために予約が行われました。"
    },
    {
      "indent": 0,
      "text": "2. ASNs for Documentation Use",
      "section_title": true,
      "ja": "2. ドキュメントの使用のためのASN"
    },
    {
      "indent": 3,
      "text": "To allow documentation to accurately describe deployment examples, the use of public or private-use AS numbers is inappropriate, and a reserved block of AS numbers is required. This ensures that documentation does not clash with public- or private-use AS numbers in deployed networks, and mitigates the risks to operational integrity of the network through inappropriate use of documentation to perform literal configuration of routing elements on production systems.",
      "ja": "ドキュメントが展開の例を正確に説明できるようにするために、数字としてのパブリックまたはプライベート使用の使用は不適切であり、AS数の予約ブロックが必要です。これにより、ドキュメントは、展開されたネットワークの数字としての公開または個人用の使用と衝突しないことを保証し、ドキュメントの不適切な使用を通じて、生産システム上のルーティング要素の文字通りの構成を実行することにより、ネットワークの運用上の完全性に対するリスクを軽減することが保証されます。"
    },
    {
      "indent": 3,
      "text": "To allow for examples relating to the transition to use of 32-bit AS numbers to be correctly described, a reservation of two blocks of AS numbers is proposed in this document. One reserved block of 16 contiguous AS numbers is to lie in the range of numbers that can be expressed as a 16-bit AS number value (i.e., values less than 65536), and a second reserved block of 16 contiguous AS numbers is to lie in the range of numbers that can only be expressed as 32-bit AS numbers (values greater than 65535).",
      "ja": "正しく説明する数字として32ビットの使用への移行に関連する例を許可するために、このドキュメントでは2つのブロックのAS数ブロックの予約が提案されています。数字として16の隣接する16の予約ブロックの1つは、16ビットとして数値として表現できる数値の範囲（つまり、65536未満の値）にあること、および数字が嘘をつくことは16の2番目の予約ブロックの隣接ブロックにあることです。数字として32ビットとしてのみ表現できる数値（65535を超える値）の範囲。"
    },
    {
      "indent": 0,
      "text": "3. Operational Implications",
      "section_title": true,
      "ja": "3. 運用上の意味"
    },
    {
      "indent": 3,
      "text": "This assignment implies that BGP operational configurations should not peer with neighboring ASes that are numbered from this reserved AS number set.",
      "ja": "この割り当ては、BGPの動作構成は、この予約された数字として数字から数えられている隣接するASEと覗き込むべきではないことを意味します。"
    },
    {
      "indent": 0,
      "text": "4. IANA Considerations",
      "section_title": true,
      "ja": "4. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has reserved a contiguous block of 16 Autonomous System numbers from the unallocated number range within the \"16-bit\" number set for documentation purposes, namely 64496 - 64511, and a contiguous block of 16 Autonomous System numbers from the \"32-bit\" number set for documentation, namely 65536 - 65551. These reservations have been documented in the IANA AS Number Registry [IANA.AS].",
      "ja": "IANAは、ドキュメントの目的で設定された「16ビット」番号セット、すなわち64496-64511、および「32ビット」からの16の自律システム番号の隣接するブロック内の「16ビット」数の範囲から16の自律システム数の連続ブロックを予約しています。ドキュメント用に設定された番号、すなわち65536-65551。これらの予約は、IANAで番号レジストリ[IANA.AS]として文書化されています。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "AS number reservations do not have any direct impact on Internet infrastructure security.",
      "ja": "数の予約は、インターネットインフラストラクチャのセキュリティに直接的な影響を与えないためです。"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgements",
      "section_title": true,
      "ja": "6. 謝辞"
    },
    {
      "indent": 3,
      "text": "The author acknowledges the work of Tomoya Yoshida, Gaurab Upadhaya, and Philip Smith in authoring a policy proposal that was submitted to the APNIC Policy Process in 2008 relating to the reservation of AS numbers for documentation purposes.",
      "ja": "著者は、2008年に文書目的でのAS番号の留保に関するAPNIC政策プロセスに提出された政策提案を執筆している際に、トモヤ・ヨシダ、ガウラブ・ウパダヤ、およびフィリップ・スミスの研究を認めています。"
    },
    {
      "indent": 0,
      "text": "7. Informative References",
      "section_title": true,
      "ja": "7. 参考引用"
    },
    {
      "indent": 3,
      "text": "[IANA.AS] IANA, \"Autonomous System (AS) Numbers\", Sep 2008, <http://www.iana.org>.",
      "ja": "[IANA.AS] IANA、「自律システム（AS）番号」、2008年9月、<http://www.iana.org>。"
    },
    {
      "indent": 3,
      "text": "[IANA.IPv4] IANA, \"IPv4 Global Unicast Address Assignments\", Sep 2008, <http://www.iana.org>.",
      "ja": "[iana.ipv4] iana、 \"IPv4グローバルユニキャストアドレスの割り当て\"、2008年9月、<http://www.iana.org>。"
    },
    {
      "indent": 3,
      "text": "[RFC2606] Eastlake, D. and A. Panitz, \"Reserved Top Level DNS Names\", BCP 32, RFC 2606, June 1999.",
      "ja": "[RFC2606] Eastlake、D。およびA. Panitz、「予約されたトップレベルDNS名」、BCP 32、RFC 2606、1999年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC3849] Huston, G., Lord, A., and P. Smith, \"IPv6 Address Prefix Reserved for Documentation\", RFC 3849, July 2004.",
      "ja": "[RFC3849] Huston、G.、Lord、A。、およびP. Smith、「IPv6アドレスはドキュメント用に予約されている」、RFC 3849、2004年7月。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者の連絡先"
    },
    {
      "indent": 3,
      "text": "Geoff Huston",
      "ja": "ジェフ・ヒューストン"
    },
    {
      "indent": 3,
      "text": "EMail: gih@apnic.net",
      "raw": true,
      "ja": ""
    }
  ]
}