{
  "title": {
    "text": "RFC 5084 - Using AES-CCM and AES-GCM Authenticated Encryption in the Cryptographic Message Syntax (CMS)",
    "ja": "RFC 5084 - AES-CCMおよび暗号メッセージ構文におけるAES-GCM認証暗号（CMS）を使用して、"
  },
  "number": 5084,
  "created_at": "2019-10-23 02:49:35.658858+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                         R. Housley\nRequest for Comments: 5084                                Vigil Security\nCategory: Standards Track                                  November 2007",
      "raw": true
    },
    {
      "indent": 11,
      "text": "Using AES-CCM and AES-GCM Authenticated Encryption\n    in the Cryptographic Message Syntax (CMS)",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document specifies the conventions for using the AES-CCM and the AES-GCM authenticated encryption algorithms with the Cryptographic Message Syntax (CMS) authenticated-enveloped-data content type.",
      "ja": "この文書では、AES-CCMを使用するための規則を指定し、AES-GCMは暗号メッセージ構文（CMS）認証されたエンベロープデータコンテンツタイプに暗号化アルゴリズムを認証されました。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "This document specifies the conventions for using Advanced Encryption Standard-Counter with Cipher Block Chaining-Message Authentication Code (AES-CCM) and AES-Galois/Counter Mode (GCM) authenticated encryption algorithms as the content-authenticated-encryption algorithm with the Cryptographic Message Syntax [CMS] authenticated-enveloped-data content type [AuthEnv].",
      "ja": "この文書は、暗号メッセージとコンテンツ認証・暗号化アルゴリズムとして認証された暗号ブロック連鎖、メッセージ認証コード（AES-CCM）とAES-ガロア/カウンタモード（GCM）でのAdvanced Encryption Standard-カウンタを使用するための規則暗号化アルゴリズムを指定します構文[CMS]認証されたエンベロープデータのコンテンツタイプ[AuthEnv]。"
    },
    {
      "indent": 0,
      "text": "1.1. Terminology",
      "section_title": true,
      "ja": "1.1. 用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [STDWORDS].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はありますRFC 2119 [STDWORDS]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "1.2. ASN.1",
      "section_title": true,
      "ja": "1.2.  ASN.1"
    },
    {
      "indent": 3,
      "text": "CMS values are generated using ASN.1 [X.208-88], which uses the Basic Encoding Rules (BER) [X.209-88] and the Distinguished Encoding Rules (DER) [X.509-88].",
      "ja": "CMS値は、基本符号化規則（BER）[X.209-88]と識別符号化規則（DER）[X.509-88]を使用してASN.1 [X.208-88]を使用して生成されます。"
    },
    {
      "indent": 0,
      "text": "1.3. AES",
      "section_title": true,
      "ja": "1.3.  AES"
    },
    {
      "indent": 3,
      "text": "Dr. Joan Daemen and Dr. Vincent Rijmen, both from Belgium, developed the Rijndael block cipher algorithm, and they submitted it for consideration as the Advanced Encryption Standard (AES). Rijndael was selected by the National Institute for Standards and Technology (NIST), and it is specified in a U.S. Federal Information Processing Standard (FIPS) Publication [AES]. NIST selected the Rijndael algorithm for AES because it offers a combination of security, performance, efficiency, ease of implementation, and flexibility. Specifically, the algorithm performs well in both hardware and software across a wide range of computing environments. Also, the very low memory requirements of the algorithm make it very well suited for restricted-space environments. The AES is widely used by organizations, institutions, and individuals outside of the U.S. Government.",
      "ja": "博士はジョアン・ダウメン博士とヴィンセントRijmen両氏は、両方のベルギーから、Rijndaelのブロック暗号アルゴリズムを開発し、彼らは、AES（Advanced Encryption Standard）として検討のためにそれを提出しました。ラインダールは、標準技術研究所（NIST）によって選定された、そしてそれは、米国連邦情報処理標準（FIPS）出版[AES]で指定されています。それは、セキュリティ、パフォーマンス、効率、実装の容易性、および柔軟性の組み合わせを提供していますので、NISTはAESのためのRijndaelアルゴリズムを選択しました。具体的には、アルゴリズムは、コンピューティング環境の幅広いハードウェアとソフトウェアの両方で良好に機能します。また、アルゴリズムの非常に低いメモリ要件は、制限された空間環境のために、それは非常によく最適です。 AESは広く団体、機関、米国政府の外で個人によって使用されています。"
    },
    {
      "indent": 3,
      "text": "The AES specifies three key sizes: 128, 192, and 256 bits.",
      "ja": "128、192、および256ビット：AESは、3つの主要なサイズを指定します。"
    },
    {
      "indent": 0,
      "text": "1.4. AES-CCM",
      "section_title": true,
      "ja": "1.4.  AES-CCM"
    },
    {
      "indent": 3,
      "text": "The Counter with CBC-MAC (CCM) mode of operation is specified in [CCM]. CCM is a generic authenticated encryption block cipher mode. CCM is defined for use with any 128-bit block cipher, but in this document, CCM is used with the AES block cipher.",
      "ja": "操作のCBC-MAC（CCM）モードとカウンタ[CCM]で指定されています。 CCMは、一般的な認証された暗号化ブロック暗号モードです。 CCMは、任意の128ビットのブロック暗号で使用するために定義されているが、この文書では、CCMは、AESブロック暗号で使用されます。"
    },
    {
      "indent": 3,
      "text": "AES-CCM has four inputs: an AES key, a nonce, a plaintext, and optional additional authenticated data (AAD). AES-CCM generates two outputs: a ciphertext and a message authentication code (also called an authentication tag).",
      "ja": "AES鍵、ナンス、平文、及び任意の追加認証データ（AAD）：AES-CCMは、4つの入力を有します。暗号文と（また、認証タグと呼ばれる）メッセージ認証コード：AES-CCMは、2つの出力を生成します。"
    },
    {
      "indent": 3,
      "text": "The nonce is generated by the party performing the authenticated encryption operation. Within the scope of any authenticated-encryption key, the nonce value MUST be unique. That is, the set of nonce values used with any given key MUST NOT contain any duplicate values. Using the same nonce for two different messages encrypted with the same key destroys the security properties.",
      "ja": "ナンスは、認証された暗号化操作を実行するパーティによって生成されます。すべての認証済みの暗号化キーの範囲内で、一回だけの値は一意である必要があります。これは、重複値を含めることはできません任意のキーで使用されたnonce値のセットです。同じキーで暗号化された二つの異なるメッセージに対して同じnonceを使用すると、セキュリティプロパティを破棄します。"
    },
    {
      "indent": 3,
      "text": "AAD is authenticated but not encrypted. Thus, the AAD is not included in the AES-CCM output. It can be used to authenticate plaintext packet headers. In the CMS authenticated-enveloped-data content type, authenticated attributes comprise the AAD.",
      "ja": "AADは、認証されたが、暗号化されていません。このように、AADはAES-CCMの出力に含まれていません。平文パケットヘッダを認証するために使用することができます。 CMS認証されたエンベロープデータのコンテンツタイプでは、認証された属性はAADを含みます。"
    },
    {
      "indent": 0,
      "text": "1.5. AES-GCM",
      "section_title": true,
      "ja": "1.5.  AES-GCM"
    },
    {
      "indent": 3,
      "text": "The Galois/Counter Mode (GCM) is specified in [GCM]. GCM is a generic authenticated encryption block cipher mode. GCM is defined for use with any 128-bit block cipher, but in this document, GCM is used with the AES block cipher.",
      "ja": "ガロア/カウンタ・モード（GCM）GCM]で指定されています。 GCMは、一般的な認証された暗号化ブロック暗号モードです。 GCMは、任意の128ビットのブロック暗号で使用するために定義されているが、この文書では、GCMは、AESブロック暗号で使用されます。"
    },
    {
      "indent": 3,
      "text": "AES-GCM has four inputs: an AES key, an initialization vector (IV), a plaintext content, and optional additional authenticated data (AAD). AES-GCM generates two outputs: a ciphertext and message authentication code (also called an authentication tag). To have a common set of terms for AES-CCM and AES-GCM, the AES-GCM IV is referred to as a nonce in the remainder of this document.",
      "ja": "AES鍵、初期化ベクトル（IV）、平文コンテンツ、および任意の追加認証データ（AAD）：AES-GCMは、4つの入力を有します。 （また、認証タグと呼ばれる）暗号文とメッセージ認証コード：AES-GCMは、2つの出力を生成します。 AES-CCMとAES-GCMのための用語の共通セットを有するように、AES-GCM IVは、本文書の残りの部分にノンスと呼ばれます。"
    },
    {
      "indent": 3,
      "text": "The nonce is generated by the party performing the authenticated encryption operation. Within the scope of any authenticated-encryption key, the nonce value MUST be unique. That is, the set of nonce values used with any given key MUST NOT contain any duplicate values. Using the same nonce for two different messages encrypted with the same key destroys the security properties.",
      "ja": "ナンスは、認証された暗号化操作を実行するパーティによって生成されます。すべての認証済みの暗号化キーの範囲内で、一回だけの値は一意である必要があります。これは、重複値を含めることはできません任意のキーで使用されたnonce値のセットです。同じキーで暗号化された二つの異なるメッセージに対して同じnonceを使用すると、セキュリティプロパティを破棄します。"
    },
    {
      "indent": 3,
      "text": "AAD is authenticated but not encrypted. Thus, the AAD is not included in the AES-GCM output. It can be used to authenticate plaintext packet headers. In the CMS authenticated-enveloped-data content type, authenticated attributes comprise the AAD.",
      "ja": "AADは、認証されたが、暗号化されていません。このように、AADはAES-GCMの出力に含まれていません。平文パケットヘッダを認証するために使用することができます。 CMS認証されたエンベロープデータのコンテンツタイプでは、認証された属性はAADを含みます。"
    },
    {
      "indent": 0,
      "text": "2. Automated Key Management",
      "section_title": true,
      "ja": "2.自動化キー管理"
    },
    {
      "indent": 3,
      "text": "The reuse of an AES-CCM or AES-GCM nonce/key combination destroys the security guarantees. As a result, it can be extremely difficult to use AES-CCM or AES-GCM securely when using statically configured keys. For safety's sake, implementations MUST use an automated key management system [KEYMGMT].",
      "ja": "AES-CCMまたはAES-GCMナンス/キーの組み合わせの再利用は、安全保障を破壊します。その結果、静的に構成されたキーを使用するときに確実にAES-CCMまたはAES-GCMを使用することは非常に困難であることができます。安全のため、実装は自動化された鍵管理システム[KEYMGMT]を使用しなければなりません。"
    },
    {
      "indent": 3,
      "text": "The CMS authenticated-enveloped-data content type supports four general key management techniques:",
      "ja": "CMS認証されたエンベロープデータのコンテンツタイプは、4つの一般的な鍵管理技術をサポートしています。"
    },
    {
      "indent": 6,
      "text": "Key Transport: the content-authenticated-encryption key is encrypted in the recipient's public key;",
      "ja": "主な交通機関：コンテンツ認証・暗号化キーが受信者の公開鍵で暗号化されます。"
    },
    {
      "indent": 6,
      "text": "Key Agreement: the recipient's public key and the sender's private key are used to generate a pairwise symmetric key, then the content-authenticated-encryption key is encrypted in the pairwise symmetric key;",
      "ja": "主要な協定：受信者の公開鍵と送信者の秘密鍵は、コンテンツ認証・暗号鍵はペアワイズ対称鍵で暗号化されて、ペアワイズ対称鍵を生成するために使用されています。"
    },
    {
      "indent": 6,
      "text": "Symmetric Key-Encryption Keys: the content-authenticated-encryption key is encrypted in a previously distributed symmetric key-encryption key; and",
      "ja": "対称キー暗号化キー：コンテンツ認証・暗号化キーが以前に分配された左右対称鍵暗号鍵で暗号化されます。そして"
    },
    {
      "indent": 6,
      "text": "Passwords: the content-authenticated-encryption key is encrypted in a key-encryption key that is derived from a password or other shared secret value.",
      "ja": "パスワード：コンテンツの認証・暗号化キーは、パスワードやその他の共有秘密値から導出されるキー暗号化キーで暗号化されています。"
    },
    {
      "indent": 3,
      "text": "All of these key management techniques meet the automated key management system requirement as long as a fresh content-authenticated-encryption key is generated for the protection of each content. Note that some of these key management techniques use one key-encryption key to encrypt more than one content-authenticated- encryption key during the system life cycle. As long as fresh content-authenticated-encryption key is used each time, AES-CCM and AES-GCM can be used safely with the CMS authenticated-enveloped-data content type.",
      "ja": "これらの鍵管理技術の全ては限り新鮮なコンテンツ認証・暗号鍵は、各コンテンツの保護のために生成されるよう、自動鍵管理システムの要件を満たしています。これらの鍵管理技術のいくつかは、システムのライフサイクルの間に、複数のコンテンツ・authenticated-暗号化キーを暗号化するために1つのキーの暗号化キーを使用することに注意してください。限り新鮮なコンテンツ認証・暗号鍵が毎回使用され、AES-CCMとAES-GCMは、CMS認証されたエンベロープデータコンテンツタイプに安全に使用することができます。"
    },
    {
      "indent": 3,
      "text": "In addition to these four general key management techniques, CMS supports other key management techniques. See Section 6.2.5 of [CMS]. Since the properties of these key management techniques are unknown, no statement can be made about whether these key management techniques meet the automated key management system requirement. Designers and implementers must perform their own analysis if one of these other key management techniques is supported.",
      "ja": "これらの4つの一般的な鍵管理手法に加えて、CMSは、他の鍵管理技術をサポートしています。 [CMS]のセクション6.2.5を参照してください。これらの鍵管理手法の性質が不明なので、何の声明は、これらの鍵管理技術は、自動鍵管理システムの要件を満たしているかどうかについて行うことはできません。これらの他の鍵管理技術の一つがサポートされている場合は設計者と実装者が独自の分析を実行する必要があります。"
    },
    {
      "indent": 0,
      "text": "3. Content-Authenticated Encryption Algorithms",
      "section_title": true,
      "ja": "3.コンテンツ認証暗号化アルゴリズム"
    },
    {
      "indent": 3,
      "text": "This section specifies the conventions employed by CMS implementations that support content-authenticated encryption using AES-CCM or AES-GCM.",
      "ja": "このセクションでは、AES-CCMまたはAES-GCMを使用して、コンテンツ認証の暗号化をサポートするCMS実装によって使われたコンベンションを指定します。"
    },
    {
      "indent": 3,
      "text": "Content-authenticated encryption algorithm identifiers are located in the AuthEnvelopedData EncryptedContentInfo contentEncryptionAlgorithm field.",
      "ja": "コンテンツ認証暗号化アルゴリズム識別子はAuthEnvelopedData EncryptedContentInfo contentEncryptionAlgorithmフィールドに位置しています。"
    },
    {
      "indent": 3,
      "text": "Content-authenticated encryption algorithms are used to encipher the content located in the AuthEnvelopedData EncryptedContentInfo encryptedContent field and to provide the message authentication code for the AuthEnvelopedData mac field. Note that the message authentication code provides integrity protection for both the AuthEnvelopedData authAttrs and the AuthEnvelopedData EncryptedContentInfo encryptedContent.",
      "ja": "コンテンツ認証暗号化アルゴリズムはAuthEnvelopedData EncryptedContentInfo暗号化コンテンツフィールドにあるコンテンツを暗号化するとAuthEnvelopedData MACフィールドのためのメッセージ認証コードを提供するために使用されています。メッセージ認証コードがAuthEnvelopedData authAttrsとAuthEnvelopedData EncryptedContentInfo暗号化コンテンツの両方のための完全性保護を提供することに注意してください。"
    },
    {
      "indent": 0,
      "text": "3.1. AES-CCM",
      "section_title": true,
      "ja": "3.1.  AES-CCM"
    },
    {
      "indent": 3,
      "text": "The AES-CCM authenticated encryption algorithm is described in [CCM]. A brief summary of the properties of AES-CCM is provided in Section 1.4.",
      "ja": "AES-CCM認証された暗号化アルゴリズムは、[CCM]に記載されています。 AES-CCMのプロパティの概要は、セクション1.4で提供されています。"
    },
    {
      "indent": 3,
      "text": "Neither the plaintext content nor the optional AAD inputs need to be padded prior to invoking AES-CCM.",
      "ja": "平文のコンテンツもオプションのAAD入力はいずれも、AES-CCMを呼び出す前にパディングする必要があります。"
    },
    {
      "indent": 3,
      "text": "There are three algorithm identifiers for AES-CCM, one for each AES key size:",
      "ja": "AES-CCM、各AESキーのサイズのための1つのための3つのアルゴリズム識別子があります。"
    },
    {
      "indent": 6,
      "text": "aes OBJECT IDENTIFIER ::= { joint-iso-itu-t(2) country(16) us(840)\n    organization(1) gov(101) csor(3) nistAlgorithm(4) 1 }",
      "raw": true
    },
    {
      "indent": 6,
      "text": "id-aes128-CCM OBJECT IDENTIFIER ::= { aes 7 }",
      "raw": true
    },
    {
      "indent": 6,
      "text": "id-aes192-CCM OBJECT IDENTIFIER ::= { aes 27 }",
      "raw": true
    },
    {
      "indent": 6,
      "text": "id-aes256-CCM OBJECT IDENTIFIER ::= { aes 47 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "With all three AES-CCM algorithm identifiers, the AlgorithmIdentifier parameters field MUST be present, and the parameters field must contain a CCMParameter:",
      "ja": "すべての3つのAES-CCMアルゴリズム識別子では、AlgorithmIdentifierパラメタ分野は存在しなければならない、とパラメータフィールドがCCMParameterが含まれている必要があります。"
    },
    {
      "indent": 6,
      "text": "CCMParameters ::= SEQUENCE {\n  aes-nonce         OCTET STRING (SIZE(7..13)),\n  aes-ICVlen        AES-CCM-ICVlen DEFAULT 12 }",
      "raw": true
    },
    {
      "indent": 6,
      "text": "AES-CCM-ICVlen ::= INTEGER (4 | 6 | 8 | 10 | 12 | 14 | 16)",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The aes-nonce parameter field contains 15-L octets, where L is the size of the length field. With the CMS, the normal situation is for the content-authenticated-encryption key to be used for a single content; therefore, L=8 is RECOMMENDED. See [CCM] for a discussion of the trade-off between the maximum content size and the size of the nonce. Within the scope of any content-authenticated-encryption key, the nonce value MUST be unique. That is, the set of nonce values used with any given key MUST NOT contain any duplicate values.",
      "ja": "AES-ナンスパラメータフィールドは、Lは、長さフィールドのサイズである15-Lのオクテットを含んでいます。 CMSを使用すると、通常の状況では、単一のコンテンツに使用されるコンテンツ認証・暗号化キーのためです。従って、L = 8が推奨されます。最大コンテンツサイズとノンスのサイズとのトレードオフの議論のために[CCM]参照。任意のコンテンツ認証、暗号化キーの範囲内で、一回だけの値は一意である必要があります。これは、重複値を含めることはできません任意のキーで使用されたnonce値のセットです。"
    },
    {
      "indent": 3,
      "text": "The aes-ICVlen parameter field tells the size of the message authentication code. It MUST match the size in octets of the value in the AuthEnvelopedData mac field. A length of 12 octets is RECOMMENDED.",
      "ja": "AES-ICVlenパラメータフィールドは、メッセージ認証コードのサイズを伝えます。それはAuthEnvelopedData MACフィールドの値のオクテットでサイズと一致する必要があります。 12オクテットの長さが推奨されます。"
    },
    {
      "indent": 0,
      "text": "3.2. AES-GCM",
      "section_title": true,
      "ja": "3.2.  AES-GCM"
    },
    {
      "indent": 3,
      "text": "The AES-GCM authenticated encryption algorithm is described in [GCM]. A brief summary of the properties of AES-CCM is provided in Section 1.5.",
      "ja": "AES-GCM認証された暗号化アルゴリズムは、[GCM]に記載されています。 AES-CCMのプロパティの概要は、セクション1.5で提供されています。"
    },
    {
      "indent": 3,
      "text": "Neither the plaintext content nor the optional AAD inputs need to be padded prior to invoking AES-GCM.",
      "ja": "平文のコンテンツもオプションのAAD入力はいずれも、AES-GCMを呼び出す前にパディングする必要があります。"
    },
    {
      "indent": 3,
      "text": "There are three algorithm identifiers for AES-GCM, one for each AES key size:",
      "ja": "AES-GCM、各AESキーのサイズのための1つのための3つのアルゴリズム識別子があります。"
    },
    {
      "indent": 6,
      "text": "aes OBJECT IDENTIFIER ::= { joint-iso-itu-t(2) country(16) us(840)\n    organization(1) gov(101) csor(3) nistAlgorithm(4) 1 }",
      "raw": true
    },
    {
      "indent": 6,
      "text": "id-aes128-GCM OBJECT IDENTIFIER ::= { aes 6 }",
      "raw": true
    },
    {
      "indent": 6,
      "text": "id-aes192-GCM OBJECT IDENTIFIER ::= { aes 26 }",
      "raw": true
    },
    {
      "indent": 6,
      "text": "id-aes256-GCM OBJECT IDENTIFIER ::= { aes 46 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "With all three AES-GCM algorithm identifiers, the AlgorithmIdentifier parameters field MUST be present, and the parameters field must contain a GCMParameter:",
      "ja": "すべての3つのAES-GCMのアルゴリズム識別子と、AlgorithmIdentifierパラメタ分野は存在しなければならない、とパラメータフィールドがGCMParameterが含まれている必要があります。"
    },
    {
      "indent": 6,
      "text": "GCMParameters ::= SEQUENCE {\n  aes-nonce        OCTET STRING, -- recommended size is 12 octets\n  aes-ICVlen       AES-GCM-ICVlen DEFAULT 12 }",
      "raw": true
    },
    {
      "indent": 6,
      "text": "AES-GCM-ICVlen ::= INTEGER (12 | 13 | 14 | 15 | 16)",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The aes-nonce is the AES-GCM initialization vector. The algorithm specification permits the nonce to have any number of bits between 1 and 2^64. However, the use of OCTET STRING within GCMParameters requires the nonce to be a multiple of 8 bits. Within the scope of any content-authenticated-encryption key, the nonce value MUST be unique, but need not have equal lengths. A nonce value of 12 octets can be processed more efficiently, so that length is RECOMMENDED.",
      "ja": "AES-ノンスは、AES-GCM初期化ベクトルです。アルゴリズム仕様は、1及び2 ^ 64の間の任意のビット数を有することがnonceを可能にします。しかし、GCMParameters内​​オクテットストリングの使用は8ビットの倍数であることがナンスを必要とします。任意のコンテンツ認証、暗号化キーの範囲内で、一回だけの値はユニークである必要がありますが、等しい長さを有する必要はありません。 12オクテットのノンス値をより効率的に処理することができるので、その長さが推奨されます。"
    },
    {
      "indent": 3,
      "text": "The aes-ICVlen parameter field tells the size of the message authentication code. It MUST match the size in octets of the value in the AuthEnvelopedData mac field. A length of 12 octets is RECOMMENDED.",
      "ja": "AES-ICVlenパラメータフィールドは、メッセージ認証コードのサイズを伝えます。それはAuthEnvelopedData MACフィールドの値のオクテットでサイズと一致する必要があります。 12オクテットの長さが推奨されます。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "AES-CCM and AES-GCM make use of the AES block cipher in counter mode to provide encryption. When used properly, counter mode provides strong confidentiality. Bellare, Desai, Jokipii, and Rogaway show in [BDJR] that the privacy guarantees provided by counter mode are at least as strong as those for Cipher Block Chaining (CBC) mode when using the same block cipher.",
      "ja": "AES-CCMとAES-GCMは、暗号化を提供するために、カウンタモードでAESブロック暗号を利用します。適切に使用すると、カウンタモードは、強力な機密性を提供します。ベラー、デサイ、Jokipii、及びRogawayショー[BDJR]で同じブロック暗号を使用した場合、カウンタモードによって提供されるプライバシーの保証は、暗号ブロック連鎖（CBC）モードのものと少なくとも同程度に強力であること。"
    },
    {
      "indent": 3,
      "text": "Unfortunately, it is easy to misuse counter mode. If counter block values are ever used for more than one encryption operation with the same key, then the same key stream will be used to encrypt both plaintexts, and the confidentiality guarantees are voided.",
      "ja": "残念ながら、カウンタモードを誤用するのは簡単です。カウンタブロック値は、これまでと同じキーを持つ複数の暗号化操作のために使用されている場合は、同じキーストリームは、両方の平文を暗号化するために使用され、機密性の保証が無効とされています。"
    },
    {
      "indent": 3,
      "text": "Fortunately, the CMS AuthEnvelopedData provides all the tools needed to avoid misuse of counter mode. Automated key management is discussed in Section 2.",
      "ja": "幸いなことに、CMS AuthEnvelopedDataはカウンタモードの誤用を避けるために必要なすべてのツールを提供します。自動化された鍵管理は、第2節で議論されます。"
    },
    {
      "indent": 3,
      "text": "There are fairly generic precomputation attacks against the use of any block cipher in counter mode that allow a meet-in-the-middle attack against the key [H][B][MF]. AES-CCM and AES-GCM both make use of counter mode for encryption. These precomputation attacks require the creation and searching of huge tables of ciphertext associated with known plaintext and known keys. Assuming that the memory and processor resources are available for a precomputation attack, then the theoretical strength of any block cipher in counter mode is limited to 2^(n/2) bits, where n is the number of bits in the key. The use of long keys is the best countermeasure to precomputation attacks. Use of an unpredictable nonce value in the counter block significantly increases the size of the table that the attacker must compute to mount a successful precomputation attack.",
      "ja": "キー[H] [B] [MF]に対する中間一致攻撃を許可するカウンタモードで任意のブロック暗号の使用に対するかなり一般的な事前計算攻撃があります。 AES-CCMとAES-GCMは、両方の暗号化のためのカウンタモードを利用します。これらの事前計算攻撃は、既知の平文と知られたキーに関連付けられた暗号文の巨大なテーブルの作成と検索を必要としています。メモリとプロセッサリソースが事前計算攻撃に利用可能であると仮定すると、カウンタモードにおける任意のブロック暗号の理論強度は、nが鍵のビット数は2 ^（N / 2）ビットに制限されています。長いキーを使用すると、攻撃を事前計算するための最良の対策です。カウンタブロックで予測できない一回だけの値を使用すると、大幅に攻撃が成功した事前計算攻撃を仕掛けるために計算しなければならないテーブルのサイズが大きくなります。"
    },
    {
      "indent": 3,
      "text": "Implementations must randomly generate content-authenticated-encryption keys. The use of inadequate pseudo-random number generators (PRNGs) to generate cryptographic keys can result in little or no security. An attacker may find it much easier to reproduce the PRNG environment that produced the keys, and then searching the resulting small set of possibilities, rather than brute force searching the whole key space. The generation of quality random numbers is difficult. RFC 4086 [RANDOM] offers important guidance in this area.",
      "ja": "実装はランダムにコンテンツ認証・暗号化キーを生成する必要があります。暗号鍵を生成するために不十分な疑似乱数発生器（のPRNG）の使用は、ほとんどまたは全くセキュリティをもたらすことができます。攻撃者はそれをはるかに簡単に鍵を生成して、キー全体のスペースを検索結果として起こる小さい可能性はなく、ブルートフォースを検索PRNG環境を再現するかもしれません。品質の乱数の生成が困難です。 RFC 4086 [RANDOM]はこの領域で重要な指導を提供しています。"
    },
    {
      "indent": 0,
      "text": "5. References",
      "section_title": true,
      "ja": "5.参考文献"
    },
    {
      "indent": 0,
      "text": "5.1. Normative References",
      "section_title": true,
      "ja": "5.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[AES] NIST, FIPS PUB 197, \"Advanced Encryption Standard (AES)\", November 2001.",
      "ja": "[AES] NIST、FIPS PUBの197、 \"高度暗号化標準（AES）\"、2001年11月。"
    },
    {
      "indent": 3,
      "text": "[CCM] Whiting, D., Housley, R., and N. Ferguson, \"Counter with CBC-MAC (CCM)\", RFC 3610, September 2003.",
      "ja": "[CCM]ホワイティング、D.、Housley氏、R.、およびN.ファーガソン、 \"CBC-MAC（CCM）とカウンター\"、RFC 3610、2003年9月。"
    },
    {
      "indent": 3,
      "text": "[CMS] Housley, R., \"Cryptographic Message Syntax (CMS)\", RFC 3852, July 2004.",
      "ja": "[CMS] Housley氏、R.、 \"暗号メッセージ構文（CMS）\"、RFC 3852、2004年7月。"
    },
    {
      "indent": 3,
      "text": "[GCM] Dworkin, M., \"NIST Special Publication 800-38D: Recommendation for Block Cipher Modes of Operation: Galois/Counter Mode (GCM) and GMAC.\" , U.S. National Institute of Standards and Technology http://csrc.nist.gov/publications/nistpubs/800-38D/SP-800-38D.pdf",
      "ja": "[GCM] Dworkin、M.、 \"は、NIST Special Publication 800-38D：動作のブロック暗号モードのための推薦：ガロア/カウンタ・モード（GCM）とGMAC\"米国国立標準技術研究所http://csrc.nist.gov/publications/nistpubs/800-38D/SP-800-38D.pdf"
    },
    {
      "indent": 3,
      "text": "[STDWORDS] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[STDWORDS]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[X.208-88] CCITT. Recommendation X.208: Specification of Abstract Syntax Notation One (ASN.1). 1988.",
      "ja": "【X.208-88] CCITT。勧告X.208：抽象構文記法1（ASN.1）の仕様。 1988。"
    },
    {
      "indent": 3,
      "text": "[X.209-88] CCITT. Recommendation X.209: Specification of Basic Encoding Rules for Abstract Syntax Notation One (ASN.1). 1988.",
      "ja": "【X.209-88] CCITT。勧告X. 209：抽象構文記法1（ASN.1）のための基本的な符号化規則の仕様。 1988。"
    },
    {
      "indent": 3,
      "text": "[X.509-88] CCITT. Recommendation X.509: The Directory-Authentication Framework. 1988.",
      "ja": "【X.509-88] CCITT。勧告X.509：ディレクトリ - 認証フレームワーク。 1988。"
    },
    {
      "indent": 0,
      "text": "5.2. Informative References",
      "section_title": true,
      "ja": "5.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[AuthEnv] Housley, R., \"Cryptographic Message Syntax (CMS) Authenticated-Enveloped-Data Content Type\", RFC 5083, November 2007.",
      "ja": "[AuthEnv] Housley氏、R.、 \"暗号メッセージ構文（CMS）認証されたエンベロープ・データコンテンツの種類\"、RFC 5083、2007年11月。"
    },
    {
      "indent": 3,
      "text": "[B] Biham, E., \"How to Forge DES-Encrypted Messages in 2^28 Steps\", Technion Computer Science Department Technical Report CS0884, 1996.",
      "ja": "[B] Biham、E.、テクニオンコンピュータサイエンス学部技術報告書CS0884、1996年 \"どのように2 ^ 28のステップでDESで暗号化されたメッセージを偽造します\"。"
    },
    {
      "indent": 3,
      "text": "[BDJR] Bellare, M, Desai, A., Jokipii, E., and P. Rogaway, \"A Concrete Security Treatment of Symmetric Encryption: Analysis of the DES Modes of Operation\", Proceedings 38th Annual Symposium on Foundations of Computer Science, 1997.",
      "ja": "[BDJR]ベラー、M、デサイ、A.、Jokipii、E.、およびP. Rogaway、「対称暗号化の具体的なセキュリティ処理：DES運転モードの分析」、会報第38回シンポジウムコンピュータサイエンスの基礎に、 1997。"
    },
    {
      "indent": 3,
      "text": "[H] Hellman, M. E., \"A cryptanalytic time-memory trade-off\", IEEE Transactions on Information Theory, July 1980, pp. 401-406.",
      "ja": "[H]ヘルマン、M. E.、「暗号解読時間メモリトレードオフ」、情報理論、1980年7月、頁401-406にIEEEトランザクション。"
    },
    {
      "indent": 3,
      "text": "[KEYMGMT] Bellovin, S. and R. Housley, \"Guidelines for Cryptographic Key Management\", BCP 107, RFC 4107, June 2005.",
      "ja": "[KEYMGMT] Bellovin氏、S.とR. Housley氏、 \"暗号鍵管理のためのガイドライン\"、BCP 107、RFC 4107、2005年6月。"
    },
    {
      "indent": 3,
      "text": "[MF] McGrew, D., and S. Fluhrer, \"Attacks on Additive Encryption of Redundant Plaintext and Implications on Internet Security\", The Proceedings of the Seventh Annual Workshop on Selected Areas in Cryptography (SAC 2000), Springer-Verlag, August, 2000.",
      "ja": "[MF]マグリュー、D.、およびS. Fluhrer、「インターネットセキュリティ上の冗長平文と含意の添加剤暗号に対する攻撃」、第7回ワークショップの議事暗号化（SAC 2000）、シュプリンガー・フェアラーク、8月中に選択された領域に2000年。"
    },
    {
      "indent": 3,
      "text": "[RANDOM] Eastlake, D., 3rd, Schiller, J., and S. Crocker, \"Randomness Requirements for Security\", BCP 106, RFC 4086, June 2005.",
      "ja": "[ランダム]イーストレーク、D.、3、シラー、J.、およびS.クロッカー、 \"セキュリティのためのランダム要件\"、BCP 106、RFC 4086、2005年6月。"
    },
    {
      "indent": 0,
      "text": "Appendix: ASN.1 Module",
      "ja": "付録：ASN.1モジュール"
    },
    {
      "indent": 3,
      "text": "CMS-AES-CCM-and-AES-GCM { iso(1) member-body(2) us(840) rsadsi(113549) pkcs(1) pkcs-9(9) smime(16) modules(0) cms-aes-ccm-and-gcm(32) }",
      "ja": "CMS-AES-CCM-と-AES-GCM {ISO（1）部材本体（2）米国（840）RSADSI（113549）PKCS（1）PKCS-9（9）SMIME（16）モジュール（0）CMS- AES-CCM-と、GCM（32）}"
    },
    {
      "indent": 3,
      "text": "DEFINITIONS IMPLICIT TAGS ::= BEGIN",
      "raw": true
    },
    {
      "indent": 3,
      "text": "-- EXPORTS All",
      "ja": " - すべてのエクスポート"
    },
    {
      "indent": 3,
      "text": "-- Object Identifiers",
      "ja": " - オブジェクト識別子"
    },
    {
      "indent": 3,
      "text": "aes OBJECT IDENTIFIER ::= { joint-iso-itu-t(2) country(16) us(840)\n    organization(1) gov(101) csor(3) nistAlgorithm(4) 1 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "id-aes128-CCM OBJECT IDENTIFIER ::= { aes 7 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "id-aes192-CCM OBJECT IDENTIFIER ::= { aes 27 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "id-aes256-CCM OBJECT IDENTIFIER ::= { aes 47 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "id-aes128-GCM OBJECT IDENTIFIER ::= { aes 6 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "id-aes192-GCM OBJECT IDENTIFIER ::= { aes 26 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "id-aes256-GCM OBJECT IDENTIFIER ::= { aes 46 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "-- Parameters for AigorithmIdentifier",
      "ja": " - のAlgorithmIdentifierのパラメータ"
    },
    {
      "indent": 3,
      "text": "CCMParameters ::= SEQUENCE {\n  aes-nonce         OCTET STRING (SIZE(7..13)),\n  aes-ICVlen        AES-CCM-ICVlen DEFAULT 12 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "AES-CCM-ICVlen ::= INTEGER (4 | 6 | 8 | 10 | 12 | 14 | 16)",
      "raw": true
    },
    {
      "indent": 3,
      "text": "GCMParameters ::= SEQUENCE {\n  aes-nonce        OCTET STRING, -- recommended size is 12 octets\n  aes-ICVlen       AES-GCM-ICVlen DEFAULT 12 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "AES-GCM-ICVlen ::= INTEGER (12 | 13 | 14 | 15 | 16)",
      "raw": true
    },
    {
      "indent": 3,
      "text": "END",
      "ja": "終わり"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Russell Housley Vigil Security, LLC 918 Spring Knoll Drive Herndon, VA 20170 USA",
      "ja": "ラッセルHousley氏ビジルセキュリティ、LLC 918春小山Driveハーンドン、VA 20170 USA"
    },
    {
      "indent": 3,
      "text": "EMail: housley@vigilsec.com",
      "ja": "メールアドレス：housley@vigilsec.com"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The IETF Trust (2007).",
      "ja": "著作権（C）IETFトラスト（2007）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "この文書では、BCP 78に含まれる権利と許可と制限の適用を受けており、その中の記載を除いて、作者は彼らのすべての権利を保有します。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE IETF TRUST AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とCONTRIBUTOR「そのまま」、ORGANIZATION HE / SHEが表すまたはインターネットSOCIETY、（もしあれば）を後援し、IETF TRUST ANDインターネットエンジニアリングタスクフォース放棄ALLに設けられています。保証は、明示または黙示、この情報の利用および特定目的に対する権利または商品性または適合性の黙示の保証を侵害しない任意の保証がこれらに限定されません。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、本書またはそのような権限下で、ライセンスがたりないかもしれない程度に記載された技術の実装や使用に関係すると主張される可能性があります任意の知的財産権やその他の権利の有効性または範囲に関していかなる位置を取りません利用可能です。またそれは、それがどのような権利を確認する独自の取り組みを行ったことを示すものでもありません。 RFC文書の権利に関する手続きの情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IPRの開示のコピーが利用できるようにIETF事務局とライセンスの保証に行われた、または本仕様の実装者または利用者がそのような所有権の使用のための一般的なライセンスまたは許可を取得するために作られた試みの結果を得ることができますhttp://www.ietf.org/iprのIETFのオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、その注意にこの標準を実装するために必要とされる技術をカバーすることができる任意の著作権、特許または特許出願、またはその他の所有権を持ってすべての利害関係者を招待します。 ietf-ipr@ietf.orgのIETFに情報を記述してください。"
    }
  ]
}