{
  "title": {
    "text": "RFC 5485 - Digital Signatures on Internet-Draft Documents",
    "ja": "RFC 5485 - インターネットドラフトドキュメントのデジタル署名"
  },
  "number": 5485,
  "created_at": "2023-03-18 07:17:28.360859+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                         R. Housley\nRequest for Comments: 5485                                Vigil Security\nCategory: Informational                                       March 2009",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 13,
      "text": "Digital Signatures on Internet-Draft Documents",
      "ja": "インターネットドラフトドキュメントのデジタル署名"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモは、インターネットコミュニティに情報を提供します。いかなる種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2009 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2009 IETF Trustおよび文書著者として特定された人。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents in effect on the date of publication of this document (http://trustee.ietf.org/license-info). Please review these documents carefully, as they describe your rights and restrictions with respect to this document.",
      "ja": "このドキュメントは、BCP 78およびこのドキュメントの公開日（http://trustee.ietf.org/license-info）に有効なIETFドキュメントに関連するIETF Trustの法的規定の対象となります。この文書に関するあなたの権利と制限を説明するので、これらの文書を注意深く確認してください。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document specifies the conventions for digital signatures on Internet-Drafts. The Cryptographic Message Syntax (CMS) is used to create a detached signature, which is stored in a separate companion file so that no existing utilities are impacted by the addition of the digital signature.",
      "ja": "このドキュメントは、インターネットドラフトのデジタル署名の規則を指定しています。暗号化メッセージ構文（CMS）は、デジタル署名の追加によって既存のユーティリティが影響を受けないように、別のコンパニオンファイルに保存されるデタッチされた署名を作成するために使用されます。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "This document specifies the conventions for storing a digital signature on Internet-Drafts. The Cryptographic Message Syntax (CMS) [CMS] is used to create a detached signature. The signature is stored in a separate companion file so that no existing utilities are impacted by the addition of the digital signature.",
      "ja": "このドキュメントは、インターネットドラフトにデジタル署名を保存するための規則を指定しています。暗号化メッセージ構文（CMS）[CMS]は、分離した署名を作成するために使用されます。署名は別のコンパニオンファイルに保存されているため、既存のユーティリティがデジタル署名の追加によって影響を受けません。"
    },
    {
      "indent": 3,
      "text": "Shortly after the IETF Secretariat posts the Internet-Draft in the repository, the digital signature is generated and posted as a companion file in the same repository. The digital signature allows anyone to confirm that the contents of the Internet-Draft have not been altered since the time that the document was posted in the repository.",
      "ja": "IETF事務局がリポジトリにインターネットドラフトを投稿した直後に、デジタル署名が生成され、同じリポジトリのコンパニオンファイルとして投稿されます。デジタル署名により、誰もがインターネットドラフトの内容がリポジトリに投稿されてから変更されていないことを確認できます。"
    },
    {
      "indent": 3,
      "text": "The signature of the IETF Secretariat is intended to provide a straightforward way for anyone to determine whether a particular file contains the document that was made available by the IETF Secretariat. The signing-time included by the IETF Secretariat provides the wall-clock time; it is not intended to provide a trusted timestamp.",
      "ja": "IETF事務局の署名は、特定のファイルがIETF事務局によって利用可能になったドキュメントが含まれているかどうかを判断するための簡単な方法を提供することを目的としています。IETF事務局に含まれる署名時間には、壁1杯の時間が提供されます。信頼できるタイムスタンプを提供することを意図したものではありません。"
    },
    {
      "indent": 0,
      "text": "1.1. Terminology",
      "section_title": true,
      "ja": "1.1. 用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [STDWORDS].",
      "ja": "「必須」、「そうしない」、「必須」、「shall」、「shall \"、\" ingle \"、\" should \"、\" not \"、\" becommended \"、\" bay \"、および「optional」は、RFC 2119 [stdwords]に記載されているとおりに解釈されます。"
    },
    {
      "indent": 0,
      "text": "1.2. ASN.1",
      "section_title": true,
      "ja": "1.2. ASN.1"
    },
    {
      "indent": 3,
      "text": "The CMS uses Abstract Syntax Notation One (ASN.1) [X.680]. ASN.1 is a formal notation used for describing data protocols, regardless of the programming language used by the implementation. Encoding rules describe how the values defined in ASN.1 will be represented for transmission. The Basic Encoding Rules (BER) [X.690] are the most widely employed rule set, but they offer more than one way to represent data structures. For example, both definite-length encoding and indefinite-length encoding are supported. This flexibility is not desirable when digital signatures are used. As a result, the Distinguished Encoding Rules (DER) [X.690] were invented. DER is a subset of BER that ensures a single way to represent a given value. For example, DER always employs definite-length encoding.",
      "ja": "CMSは、抽象的な構文表記1（asn.1）[x.680]を使用します。ASN.1は、実装で使用されるプログラミング言語に関係なく、データプロトコルの説明に使用される正式な表記です。エンコーディングルールは、ASN.1で定義されている値が送信のためにどのように表されるかを説明しています。基本的なエンコーディングルール（BER）[X.690]は、最も広く採用されているルールセットですが、データ構造を表現するための複数の方法を提供します。たとえば、明確な長さのエンコーディングと無期限の長さの両方のエンコードがサポートされています。この柔軟性は、デジタル署名を使用する場合、望ましくありません。その結果、著名なエンコードルール（der）[x.690]が発明されました。Derは、特定の値を表す単一の方法を保証するBERのサブセットです。たとえば、DERは常に明確な長さのエンコードを使用します。"
    },
    {
      "indent": 0,
      "text": "2. Internet-Draft Signature File",
      "section_title": true,
      "ja": "2. インターネットドラフト署名ファイル"
    },
    {
      "indent": 3,
      "text": "All Internet-Draft file names begin with \"draft-\". The next portion of the file name depends on the source of the document. For example, documents from IETF working groups usually have \"ietf-\" followed by the working group abbreviation, and this is followed by a string that helps people figure out the subject of the document.",
      "ja": "すべてのインターネットドラフトファイル名は「ドラフト」から始まります。ファイル名の次の部分は、ドキュメントのソースによって異なります。たとえば、IETFワーキンググループからのドキュメントには通常、「IETF」に続いてワーキンググループの略語が続き、これに続いて、人々がドキュメントの主題を把握するのに役立つ文字列が続きます。"
    },
    {
      "indent": 3,
      "text": "All Internet-Draft file names end with a hyphen followed by a two-digit version number and a suffix. The suffix indicates the type of file. A plain text file with a suffix of \".txt\" is required. Other formats may also be provided, and they employ the appropriate suffix for the file format.",
      "ja": "すべてのインターネットドラフトファイル名はハイフンで終わり、2桁のバージョン番号とサフィックスが続きます。接尾辞はファイルのタイプを示します。「.txt」の接尾辞を備えたプレーンテキストファイルが必要です。他の形式も提供される場合があり、ファイル形式に適切なサフィックスを使用します。"
    },
    {
      "indent": 3,
      "text": "The companion signature file has exactly the same file name as the Internet-Draft, except that \".p7s\" is added to the end. This file name suffix conforms to the conventions in [MSG]. Here are a few example names:",
      "ja": "コンパニオンシグネチャファイルのファイル名は、インターネットドラフトとまったく同じファイル名ですが、「.p7s」が最後に追加されます。このファイル名の接尾辞は、[MSG]の規則に準拠しています。ここにいくつかの例があります："
    },
    {
      "indent": 6,
      "text": "Internet-Draft: draft-ietf-example-widgets-03.txt Signature File: draft-ietf-example-widgets-03.txt.p7s",
      "ja": "インターネットドラフト：draft-itef-example-widgets-03.txt署名ファイル：draft-itf-example-widgets-03.txt.p7s"
    },
    {
      "indent": 6,
      "text": "Internet-Draft: draft-ietf-example-widgets-03.ps Signature File: draft-ietf-example-widgets-03.ps.p7s",
      "ja": "インターネットドラフト：Draft-ITETF-Example-Widgets-03.PS Signature File：Draft-ITETF-Example-Widgets-03.PS.P7S"
    },
    {
      "indent": 6,
      "text": "Internet-Draft: draft-housley-internet-draft-sig-file-00.txt Signature File: draft-housley-internet-draft-sig-file-00.txt.p7s",
      "ja": "インターネットドラフト：Draft-Housley-Internet-Draft-Sig-File-00.txt署名ファイル：Draft-Housley-Internet-Draft-Sig-File-00.txt.p7s"
    },
    {
      "indent": 3,
      "text": "The IETF Secretariat will post the signature file in the repository shortly after the Internet-Draft is posted.",
      "ja": "IETF事務局は、インターネットドラフトが投稿された直後に署名ファイルをリポジトリに投稿します。"
    },
    {
      "indent": 0,
      "text": "2.1. Need for Canonicalization",
      "section_title": true,
      "ja": "2.1. 標準化の必要性"
    },
    {
      "indent": 3,
      "text": "In general, the content of the Internet-Draft is treated like a single octet string for the generation of the digital signature. Unfortunately, the plain text file requires canonicalization to avoid signature validation problems. The primary concern is the manner in which different operating systems indicate the end of a line of text. Some systems use a single new-line character, other systems use the combination of the carriage-return character followed by a line-feed character, and other systems use fixed-length records padded with space characters. For the digital signature to validate properly, a single convention must be employed.",
      "ja": "一般に、インターネットドラフトのコンテンツは、デジタル署名の生成のための単一のオクテット文字列のように扱われます。残念ながら、プレーンテキストファイルでは、署名の検証の問題を回避するために標準化が必要です。主な関心事は、異なるオペレーティングシステムがテキストの行の終わりを示す方法です。一部のシステムでは、単一の新しいライン文字を使用し、他のシステムはキャリッジリターン文字の組み合わせに続いてラインフィード文字が使用され、他のシステムはスペース文字がパッド付きの固定長レコードを使用します。デジタル署名が適切に検証するには、単一の条約を採用する必要があります。"
    },
    {
      "indent": 0,
      "text": "2.2. Text File Canonicalization",
      "section_title": true,
      "ja": "2.2. テキストファイルCanonicalization"
    },
    {
      "indent": 3,
      "text": "The canonicalization procedure follows the conventions used for text files in the File Transfer Protocol (FTP) [FTP]. Such files must be supported by FTP implementations, so code reuse seems likely.",
      "ja": "標準化手順は、ファイル転送プロトコル（FTP）[FTP]のテキストファイルに使用される規則に従います。このようなファイルはFTP実装によってサポートされる必要があるため、コードの再利用の可能性が高いようです。"
    },
    {
      "indent": 3,
      "text": "The canonicalization procedure converts the data from its internal character representation to the standard 8-bit NVT-ASCII representation (see TELNET [TELNET]). In accordance with the NVT standard, the <CRLF> sequence MUST be used to denote the end of a line of text. Using the standard NVT-ASCII representation means that data MUST be interpreted as 8-bit bytes.",
      "ja": "標準化手順は、データをその内部文字表現から標準の8ビットNVT-ASCII表現に変換します（Telnet [Telnet]を参照）。NVT標準に従って、<CRLF>シーケンスを使用して、テキストの行の終わりを示す必要があります。標準のNVT-ASCII表現を使用すると、データは8ビットバイトとして解釈する必要があることを意味します。"
    },
    {
      "indent": 3,
      "text": "Trailing space characters MUST NOT appear on a line of text. That is, the space character must not be followed by the <CRLF> sequence. Thus, a blank line is represented solely by the <CRLF> sequence.",
      "ja": "トレーリングスペースの文字は、テキストの行に表示されてはなりません。つまり、スペース文字の後に<CRLF>シーケンスを続けてはなりません。したがって、空白線は<CRLF>シーケンスでのみ表されます。"
    },
    {
      "indent": 3,
      "text": "The form-feed nonprintable character (0x0C) is expected in Internet-Drafts. Other nonprintable characters, such as tab and backspace, are not expected, but they do occur. For robustness, any nonprintable or non-ASCII characters (ones outside the range 0x20 to 0x7E) MUST NOT be changed in any way not covered by the rules for end-of-line handling in the previous paragraph.",
      "ja": "インターネットドラフトでは、フォームフィードの非印刷可能な文字（0x0C）が予想されます。タブやバックスペースなどの他の印刷できない文字は予想されませんが、それらは発生します。堅牢性のために、前の段落での終了処理のルールでカバーされない方法で、印刷できないまたは非ASCII文字（範囲0x20〜0x7eの外側）を変更してはなりません。"
    },
    {
      "indent": 3,
      "text": "Trailing blank lines MUST NOT appear at the end of the file. That is, the file must not end with multiple consecutive <CRLF> sequences.",
      "ja": "後続の空白線は、ファイルの最後に表示されてはなりません。つまり、ファイルは複数の連続した<CRLF>シーケンスで終了してはなりません。"
    },
    {
      "indent": 3,
      "text": "Any end-of-file marker used by an operating system is not considered to be part of the file content. When present, such end-of-file markers MUST NOT be processed by the digital signature algorithm.",
      "ja": "オペレーティングシステムで使用されるファイル終了マーカーは、ファイルコンテンツの一部であるとは見なされません。存在する場合、そのようなファイル終了マーカーをデジタル署名アルゴリズムによって処理してはなりません。"
    },
    {
      "indent": 3,
      "text": "Note: This text file canonicalization procedure is consistent with the ASCII NVT definition offered in Appendix B of RFC 5198 [UFNI].",
      "ja": "注：このテキストファイルの正規化手順は、RFC 5198 [UFNI]の付録Bで提供されているASCII NVT定義と一致しています。"
    },
    {
      "indent": 0,
      "text": "2.3. XML File Canonicalization",
      "section_title": true,
      "ja": "2.3. XMLファイルCanonicalization"
    },
    {
      "indent": 3,
      "text": "In accordance with the guidance of the World Wide Web Consortium (W3C) in Section 2.11 of [R20060816], a <LF> character MUST be used to denote the end of a line of text within an XML file. Any two-character <CRLF> sequence and any <CR> that is not followed by <LF> are to be translated to a single <LF> character.",
      "ja": "[R20060816]のセクション2.11におけるWorld Wide Webコンソーシアム（W3C）のガイダンスに従って、XMLファイル内のテキスト行の終わりを示すために<LF>文字を使用する必要があります。2文字<CRLF>シーケンスと<CR>は、<LF>が続いていない<CR>は、単一の<LF>文字に翻訳されます。"
    },
    {
      "indent": 0,
      "text": "2.4. Canonicalization of Other File Formats",
      "section_title": true,
      "ja": "2.4. 他のファイル形式の正規化"
    },
    {
      "indent": 3,
      "text": "No canonicalization is needed for file formats currently used for Internet-Drafts other than plain text files and XML files. Other file formats are treated as a simple sequence of octets by the digital signature algorithm.",
      "ja": "プレーンテキストファイルやXMLファイル以外のインターネットドラフトに現在使用されているファイル形式には、標準化は必要ありません。他のファイル形式は、デジタル署名アルゴリズムによってオクテットの単純なシーケンスとして扱われます。"
    },
    {
      "indent": 0,
      "text": "3. CMS Profile",
      "section_title": true,
      "ja": "3. CMSプロファイル"
    },
    {
      "indent": 3,
      "text": "CMS is used to construct the detached signature of the Internet-Draft. The CMS ContentInfo content type MUST always be present, and it MUST encapsulate the CMS SignedData content type. Since a detached signature is being created, the CMS SignedData content type MUST NOT encapsulate the Internet-Draft. The CMS detached signature is summarized by:",
      "ja": "CMSは、インターネットドラフトの分離署名を構築するために使用されます。CMS ContentInfoコンテンツタイプは常に存在する必要があり、CMS SignedDataコンテンツタイプをカプセル化する必要があります。分離された署名が作成されているため、CMS署名Dataコンテンツタイプはインターネットドラフトをカプセル化してはなりません。CMSデタッチされた署名は、次のように要約されています。"
    },
    {
      "indent": 4,
      "text": "ContentInfo {\n  contentType          id-signedData, -- (1.2.840.113549.1.7.2)\n  content              SignedData\n}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "SignedData {\n  version              CMSVersion, -- Always set to 3\n  digestAlgorithms     DigestAlgorithmIdentifiers,\n  encapContentInfo     EncapsulatedContentInfo,\n  certificates         CertificateSet, -- Secretariat certificate(s)\n  crls                 CertificateRevocationLists, -- Optional\n  signerInfos          SET OF SignerInfo -- Only one signer\n}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "SignerInfo {\n  version              CMSVersion, -- Always set to 3\n  sid                  SignerIdentifier,\n  digestAlgorithm      DigestAlgorithmIdentifier,\n  signedAttrs          SignedAttributes, -- Always present\n  signatureAlgorithm   SignatureAlgorithmIdentifier,\n  signature            SignatureValue,\n  unsignedAttrs        UnsignedAttributes -- Optional\n}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "EncapsulatedContentInfo {\n  eContentType         id-ct-asciiTextWithCRLF,\n                                   -- (1.2.840.113549.1.9.16.1.27)\n  eContent             OCTET STRING  -- Always absent\n}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "3.1. ContentInfo",
      "section_title": true,
      "ja": "3.1. contentinfo"
    },
    {
      "indent": 3,
      "text": "The CMS requires the outer-most encapsulation to be ContentInfo [CMS]. The fields of ContentInfo are used as follows:",
      "ja": "CMSでは、最も外側のカプセル化がcontentinfo [cms]である必要があります。ContentInfoのフィールドは次のように使用されます。"
    },
    {
      "indent": 6,
      "text": "contentType indicates the type of the associated content. For the detached Internet-Draft signature file, the encapsulated type is always SignedData, so the id-signedData (1.2.840.113549.1.7.2) object identifier MUST be present in this field.",
      "ja": "contentType関連するコンテンツのタイプを示します。分離されたインターネットドラフト署名ファイルの場合、カプセル化されたタイプは常に署名されているため、ID-SignedData（1.2.840.113549.1.7.2）オブジェクト識別子がこのフィールドに存在する必要があります。"
    },
    {
      "indent": 6,
      "text": "content holds the content. For the detached Internet-Draft signature file, the content is always a SignedData content.",
      "ja": "コンテンツはコンテンツを保持します。分離されたインターネットドラフト署名ファイルの場合、コンテンツは常にSignedDataコンテンツです。"
    },
    {
      "indent": 0,
      "text": "3.2. SignedData",
      "section_title": true,
      "ja": "3.2. SignedData"
    },
    {
      "indent": 3,
      "text": "The SignedData content type [CMS] contains the signature of the Internet-Draft and information to aid in the validation of that signature. The fields of SignedData are used as follows:",
      "ja": "SignedDataコンテンツタイプ[CMS]には、インターネットドラフトの署名とその署名の検証を支援する情報が含まれています。SignedDataのフィールドは次のように使用されます。"
    },
    {
      "indent": 6,
      "text": "version is the syntax version number. For this specification, the version number MUST be set to 3.",
      "ja": "バージョンは構文バージョン番号です。この仕様では、バージョン番号を3に設定する必要があります。"
    },
    {
      "indent": 6,
      "text": "digestAlgorithms is a collection of one-way hash function identifiers. It MUST contain the identifier used by the IETF Secretariat to generate the digital signature. See the discussion of digestAlgorithm in Section 3.2.1.",
      "ja": "Digestalgorithmsは、一方向ハッシュ関数識別子のコレクションです。IETF事務局がデジタル署名を生成するために使用する識別子を含める必要があります。セクション3.2.1の消化器gorthmの説明を参照してください。"
    },
    {
      "indent": 6,
      "text": "encapContentInfo is the signed content, including a content type identifier. Since a detached signature is being created, it does not encapsulate the Internet-Draft. The use of the EncapsulatedContentInfo type is discussed further in Section 3.2.2.",
      "ja": "EncapContentInfoは、コンテンツタイプ識別子を含む署名されたコンテンツです。独立した署名が作成されているため、インターネットドラフトをカプセル化しません。concapsulatedContentInfoタイプの使用については、セクション3.2.2でさらに説明します。"
    },
    {
      "indent": 6,
      "text": "certificates is an optional collection of certificates. It SHOULD include the X.509 certificate needed to validate the digital signature value. Certification Authority (CA) certificates and end entity certificates MUST conform to the certificate profile specified in [PKIX1].",
      "ja": "証明書は、オプションの証明書のコレクションです。デジタル署名値を検証するために必要なX.509証明書を含める必要があります。認証局（CA）証明書およびエンティティ証明書は、[PKIX1]で指定された証明書プロファイルに準拠する必要があります。"
    },
    {
      "indent": 6,
      "text": "crls is an optional collection of certificate revocation lists (CRLs). It SHOULD NOT include any CRLs; however, any CRLs that are present MUST conform to the CRL profile specified in [PKIX1].",
      "ja": "CRLSは、証明書取消リスト（CRLS）のオプションのコレクションです。CRLSを含めるべきではありません。ただし、存在するCRLは、[PKIX1]で指定されたCRLプロファイルに適合する必要があります。"
    },
    {
      "indent": 6,
      "text": "signerInfos is a collection of per-signer information. For this specification, each item in the collection must represent the IETF Secretariat. More than one SignerInfo MAY appear to facilitate transitions between keys or algorithms. The use of the SignerInfo type is discussed further in Section 3.2.1.",
      "ja": "SignerInfosは、署名者ごとの情報のコレクションです。この仕様では、コレクション内の各アイテムはIETF事務局を表す必要があります。複数のSignerinfoがキーまたはアルゴリズム間の遷移を容易にするように見える場合があります。SignerINFOタイプの使用については、セクション3.2.1でさらに説明します。"
    },
    {
      "indent": 0,
      "text": "3.2.1. SignerInfo",
      "section_title": true,
      "ja": "3.2.1. Signerinfo"
    },
    {
      "indent": 3,
      "text": "The IETF Secretariat is represented in the SignerInfo type. The fields of SignerInfo are used as follows:",
      "ja": "IETF事務局は、Signerinfoタイプで表されます。Signerinfoのフィールドは次のように使用されます。"
    },
    {
      "indent": 6,
      "text": "version is the syntax version number. In this specification, the version MUST be set to 3.",
      "ja": "バージョンは構文バージョン番号です。この仕様では、バージョンを3に設定する必要があります。"
    },
    {
      "indent": 6,
      "text": "sid identifies the IETF Secretariat's public key. In this specification, the subjectKeyIdentifier alternative is always used, which identifies the public key directly. This identifier MUST match the value included in the subjectKeyIdentifier certificate extension in the IETF Secretariat's X.509 certificate.",
      "ja": "SIDは、IETF事務局の公開鍵を識別します。この仕様では、SubjectKeyIdentifierの代替案が常に使用され、公開キーを直接識別します。この識別子は、IETF事務局のX.509証明書のSubjectKeyIdentifier証明書延長に含まれる値と一致する必要があります。"
    },
    {
      "indent": 6,
      "text": "digestAlgorithm identifies the one-way hash function, and any associated parameters, used by the IETF Secretariat to generate the digital signature.",
      "ja": "Digestalgorithmは、Digital Signatureを生成するためにIETF事務局が使用する一元配置ハッシュ関数と、関連するパラメーターを識別します。"
    },
    {
      "indent": 6,
      "text": "signedAttrs is an optional set of attributes that are signed along with the content. The signedAttrs are optional in the CMS, but signedAttrs is required by this specification. The SET OF Attribute must be encoded with the distinguished encoding rules (DER) [X.690]. Section 3.2.3 of this document lists the signed attributes that MUST be included in the collection. Other signed attributes MAY also be included.",
      "ja": "SigneDattrsは、コンテンツとともに署名されたオプションの属性セットです。SigneDattrsはCMSではオプションですが、この仕様ではSigneDattrsが必要です。一連の属性は、識別式エンコードルール（der）[x.690]でエンコードする必要があります。このドキュメントのセクション3.2.3には、コレクションに含める必要がある署名された属性をリストします。その他の署名された属性も含めることができます。"
    },
    {
      "indent": 6,
      "text": "signatureAlgorithm identifies the digital signature algorithm, and any associated parameters, used by the IETF Secretariat to generate the digital signature.",
      "ja": "SignatureAlgorithmは、IETF Secretariatがデジタル署名を生成するために使用するデジタル署名アルゴリズムと、関連するパラメーターを識別します。"
    },
    {
      "indent": 6,
      "text": "signature is the digital signature value generated by the IETF Secretariat.",
      "ja": "署名は、IETF事務局によって生成されたデジタル署名値です。"
    },
    {
      "indent": 6,
      "text": "unsignedAttrs is an optional set of attributes that are not signed. Unsigned attributes are usually omitted; however, the unsigned attributes MAY hold a trusted timestamp generated in accordance with [TSP]. Appendix A of [TSP] provides more information about this unsigned attribute.",
      "ja": "Unsignedattrsは、署名されていないオプションの属性セットです。通常、署名されていない属性は省略されています。ただし、署名されていない属性は、[TSP]に従って生成された信頼できるタイムスタンプを保持する場合があります。[TSP]の付録Aでは、この署名されていない属性の詳細について説明します。"
    },
    {
      "indent": 0,
      "text": "3.2.2. EncapsulatedContentInfo",
      "section_title": true,
      "ja": "3.2.2. cankulatedContentInfo"
    },
    {
      "indent": 3,
      "text": "The EncapsulatedContentInfo structure contains a content type identifier. Since a detached signature is being created, it does not encapsulate the Internet-Draft. The fields of EncapsulatedContentInfo are used as follows:",
      "ja": "cancopturatedContentInfo構造には、コンテンツ型識別子が含まれています。独立した署名が作成されているため、インターネットドラフトをカプセル化しません。cankulatedContentInfoのフィールドは次のように使用されます。"
    },
    {
      "indent": 6,
      "text": "eContentType is an object identifier that uniquely specifies the content type. The content type associated with the plain text file MUST be id-ct-asciiTextWithCRLF. Other file formats may also be posted, and the appropriate content type for each format is discussed in Section 4. Additional file formats can be added if the Internet community chooses.",
      "ja": "EcontentTypeは、コンテンツタイプを一意に指定するオブジェクト識別子です。プレーンテキストファイルに関連付けられているコンテンツタイプは、ID-CT-ASCIITEXTWITHCRLFでなければなりません。他のファイル形式も投稿される場合があり、各形式の適切なコンテンツタイプについてセクション4で説明します。インターネットコミュニティが選択した場合、追加ファイル形式を追加できます。"
    },
    {
      "indent": 6,
      "text": "eContent is optional. When an encapsulated signature is generated, the content to be signed is carried in this field. Since a detached signature is being created, eContent MUST be absent.",
      "ja": "econtentはオプションです。カプセル化された署名が生成されると、署名されるコンテンツがこのフィールドで運ばれます。独立した署名が作成されているため、econtentは存在しない必要があります。"
    },
    {
      "indent": 0,
      "text": "3.2.3. Signed Attributes",
      "section_title": true,
      "ja": "3.2.3. 署名された属性"
    },
    {
      "indent": 3,
      "text": "The IETF Secretariat MUST digitally sign a collection of attributes along with the Internet-Draft. Each attribute in the collection MUST be DER-encoded. The syntax for attributes is defined in [X.501], and the X.500 Directory provides a rich attribute syntax. A very simple subset of this syntax is used extensively in [CMS], where ATTRIBUTE.&Type and ATTRIBUTE.&id are the only parts of the ATTRIBUTE class that are employed.",
      "ja": "IETF事務局は、インターネットドラフトとともに属性のコレクションにデジタル的に署名する必要があります。コレクション内の各属性は、der-Encodedでなければなりません。属性の構文は[x.501]で定義されており、x.500ディレクトリはリッチ属性構文を提供します。この構文の非常にシンプルなサブセットは、[CMS]で広く使用されています。ここでは、属性。＆タイプと属性。＆IDは、使用されている属性クラスの唯一の部分です。"
    },
    {
      "indent": 3,
      "text": "Each of the attributes used with this CMS profile has a single attribute value. Even though the syntax is defined as a SET OF AttributeValue, there MUST be exactly one instance of AttributeValue present.",
      "ja": "このCMSプロファイルで使用される各属性には、単一の属性値があります。構文は属性のセットとして定義されていますが、属性の存在の1つのインスタンスが正確に1つある必要があります。"
    },
    {
      "indent": 3,
      "text": "The SignedAttributes syntax within signerInfo is defined as a SET OF Attribute. The SignedAttributes MUST include only one instance of any particular attribute.",
      "ja": "SignerInfo内のSigneDattributes構文は、属性のセットとして定義されます。SigneDattributesには、特定の属性の1つのインスタンスのみを含める必要があります。"
    },
    {
      "indent": 3,
      "text": "The IETF Secretariat MUST include the content-type, message-digest, and signing-time attributes. The IETF Secretariat MAY also include the binary-signing-time signed attribute as well as any other attribute that is deemed appropriate. The intent is to allow additional signed attributes to be included if a future need is identified. This does not cause an interoperability concern because unrecognized signed attributes are ignored at verification.",
      "ja": "IETF事務局には、コンテンツタイプ、メッセージダイジスト、および署名時間属性を含める必要があります。IETF事務局には、適切と見なされる他の属性と同様に、バイナリ署名時間署名属性も含まれる場合があります。意図は、将来のニーズが特定された場合、追加の署名属性を含めることを許可することです。認識されていない署名された属性が検証時に無視されるため、これは相互運用性の懸念を引き起こしません。"
    },
    {
      "indent": 0,
      "text": "3.2.3.1. Content-Type Attribute",
      "section_title": true,
      "ja": "3.2.3.1. コンテンツタイプの属性"
    },
    {
      "indent": 3,
      "text": "A content-type attribute is required to contain the same object identifier as the content type contained in the EncapsulatedContentInfo. The appropriate content type for each format is discussed in Section 4. The IETF Secretariat MUST include a content-type attribute containing the appropriate content type. Section 11.1 of [CMS] defines the content-type attribute.",
      "ja": "Content-Type属性は、capsulatedContentInfoに含まれるコンテンツタイプと同じオブジェクト識別子を含める必要があります。各形式の適切なコンテンツタイプについては、セクション4で説明します。IETF事務局には、適切なコンテンツタイプを含むコンテンツタイプの属性を含める必要があります。[CMS]のセクション11.1は、コンテンツタイプの属性を定義します。"
    },
    {
      "indent": 0,
      "text": "3.2.3.2. Message-Digest Attribute",
      "section_title": true,
      "ja": "3.2.3.2. Message-Digest属性"
    },
    {
      "indent": 3,
      "text": "The IETF Secretariat MUST include a message-digest attribute, having as its value the output of a one-way hash function computed on the Internet-Draft that is being signed. Section 11.2 of [CMS] defines the message-digest attribute.",
      "ja": "IETF事務局には、署名されているインターネットドラフトで計算された一方向ハッシュ関数の出力を値として、メッセージダイジェスト属性を含める必要があります。[CMS]のセクション11.2は、メッセージダイジスト属性を定義しています。"
    },
    {
      "indent": 0,
      "text": "3.2.3.3. Signing-Time Attribute",
      "section_title": true,
      "ja": "3.2.3.3. 署名時の属性"
    },
    {
      "indent": 3,
      "text": "The IETF Secretariat MUST include a signing-time attribute, specifying the time, based on the local system clock, at which the digital signature was applied to the Internet-Draft. Since the IETF Secretariat may choose to perform signatures in batches, the signing-time may be several hours or days after the time that the Internet-Draft was actually posted. Section 11.3 of [CMS] defines the content-type attribute.",
      "ja": "IETF事務局には、インターネットドラフトにデジタル署名が適用されたローカルシステムクロックに基づいて、時間を指定する署名時間属性を含める必要があります。IETF事務局はバッチで署名を実行することを選択する可能性があるため、署名時間は、インターネットドラフトが実際に掲載された時間から数時間または数日後になる場合があります。[CMS]のセクション11.3は、コンテンツタイプの属性を定義します。"
    },
    {
      "indent": 0,
      "text": "3.2.3.4. Binary-Signing-Time Attribute",
      "section_title": true,
      "ja": "3.2.3.4. バイナリ署名時間属性"
    },
    {
      "indent": 3,
      "text": "The IETF Secretariat MAY include a binary-signing-time attribute, specifying the time at which the digital signature was applied to the Internet-Draft. If present, the time that is represented MUST match the time represented in the signing-time attribute. The binary-signing-time attribute is defined in [BinTime].",
      "ja": "IETF事務局には、デジタル署名がインターネットドラフトに適用された時間を指定するバイナリ署名時間属性が含まれる場合があります。存在する場合、表される時間は、署名時の属性で表される時間と一致する必要があります。バイナリ署名時間属性は[Bintime]で定義されます。"
    },
    {
      "indent": 0,
      "text": "3.2.4. Unsigned Attributes",
      "section_title": true,
      "ja": "3.2.4. 署名されていない属性"
    },
    {
      "indent": 3,
      "text": "Unsigned attributes are usually omitted. However, an unsigned attribute MAY hold a trusted timestamp generated in accordance with [TSP]. The idea is to timestamp the IETF Secretariat digital signature to prove that it was created before a given time. If the IETF Secretariat's certificate is revoked the timestamp allows a verifier to know whether the signature was created before or after the revocation date. Appendix A of [TSP] defines the signature time-stamp attribute that can be used to timestamp a digital signature.",
      "ja": "通常、署名されていない属性は省略されています。ただし、署名されていない属性は、[TSP]に従って生成された信頼できるタイムスタンプを保持する場合があります。アイデアは、IETF事務局のデジタル署名をタイムスタンプして、特定の時間より前に作成されたことを証明することです。IETF事務局の証明書が取り消された場合、タイムスタンプにより、Verifierは署名が取り消し日の前または後に作成されたかどうかを知ることができます。[TSP]の付録Aは、デジタル署名のタイムスタンプに使用できる署名タイムスタンプ属性を定義しています。"
    },
    {
      "indent": 0,
      "text": "4. Content Types",
      "section_title": true,
      "ja": "4. コンテンツタイプ"
    },
    {
      "indent": 3,
      "text": "This section lists the content types that are used in this specification. The eContentType field as described in Section 3.2.2 contains a content type identifier, and the same value appears in the content-type attribute as described in Section 3.2.3.1.",
      "ja": "このセクションには、この仕様で使用されるコンテンツタイプをリストします。セクション3.2.2で説明されているEcontentTypeフィールドには、コンテンツ型識別子が含まれており、セクション3.2.3.1で説明されているように、コンテンツタイプの属性に同じ値が表示されます。"
    },
    {
      "indent": 3,
      "text": "The following table lists the file formats and the associated content type.",
      "ja": ""
    },
    {
      "indent": 6,
      "text": "File Format                        Content Type\n-----------                        ------------\nPlain text                         id-ct-asciiTextWithCRLF\nExtensible Markup Language (XML)   id-ct-xml\nPortable Document Format (PDF)     id-ct-pdf\nPostScript                         id-ct-postscript",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The object identifiers associated with the content types listed in the above table are:",
      "ja": "上記の表にリストされているコンテンツタイプに関連付けられているオブジェクト識別子は次のとおりです。"
    },
    {
      "indent": 6,
      "text": "id-ct  OBJECT IDENTIFIER  ::= { iso(1) member-body(2)\n     us(840) rsadsi(113549) pkcs(1) pkcs9(9) smime(16) 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "id-ct-asciiTextWithCRLF  OBJECT IDENTIFIER  ::= { id-ct 27 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "id-ct-xml  OBJECT IDENTIFIER  ::= { id-ct 28 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "id-ct-pdf  OBJECT IDENTIFIER  ::= { id-ct 29 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "id-ct-postscript  OBJECT IDENTIFIER  ::= { id-ct 30 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "The IETF Secretariat MUST protect its private key. The use of a hardware security module (HSM) is strongly RECOMMENDED because compromise of the IETF Secretariat's private key permits masquerade.",
      "ja": "IETF事務局は、秘密鍵を保護する必要があります。IETF事務局の秘密鍵の妥協が仮面舞踏会を許可するため、ハードウェアセキュリティモジュール（HSM）の使用は強くお勧めします。"
    },
    {
      "indent": 3,
      "text": "The IETF Secretariat currently maintains servers at a primary location and a backup location. This configuration requires two HSMs, one at each location. However, the two HSMs do not need to use the same signing key. Each HSM can have a different signing key, as long as each one has their own certificate.",
      "ja": "IETF事務局は現在、主要な場所とバックアップ場所にサーバーを維持しています。この構成には、各場所に1つずつ2つのHSMが必要です。ただし、2つのHSMは同じ署名キーを使用する必要はありません。各HSMには、それぞれが独自の証明書を持っている限り、異なる署名キーを持つことができます。"
    },
    {
      "indent": 3,
      "text": "The generation of a public/private key pair for signature operations relies on random number generation. The use of an inadequate pseudo-random number generator (PRNG) can result in little or no security. An attacker may find it much easier to reproduce the PRNG environment that produced the key pair, searching the resulting small set of possibilities, than to brute-force search the whole private key space. The generation of quality random numbers is difficult, but [RANDOM] offers important guidance in this area.",
      "ja": "署名操作のためのパブリック/プライベートキーペアの生成は、乱数の生成に依存しています。不十分な擬似ランダム数ジェネレーター（PRNG）を使用すると、セキュリティがほとんどまたはまったくなりません。攻撃者は、主要なペアを検索して、主要なキーペア全体を検索するよりも、主要なペアを生成するPRNG環境を再現する方がはるかに簡単になる場合があります。品質の乱数の生成は困難ですが、[ランダム]はこの分野で重要なガイダンスを提供します。"
    },
    {
      "indent": 3,
      "text": "The IETF Secretariat should be aware that cryptographic algorithms become weaker with time. As new cryptanalysis techniques are developed and computing performance improves, the work factor to break a particular digital signature algorithm or one-way hash function will be reduced. Therefore, it SHOULD be possible to migrate these algorithms. That is, the IETF Secretariat SHOULD be prepared for the supported algorithms to change over time.",
      "ja": "IETF事務局は、暗号化アルゴリズムが時間とともに弱くなることに注意する必要があります。新しい暗号化技術が開発され、コンピューティングのパフォーマンスが向上すると、特定のデジタル署名アルゴリズムまたは一方向ハッシュ関数を破る作業要因が削減されます。したがって、これらのアルゴリズムを移行できるはずです。つまり、IETF事務局は、サポートされているアルゴリズムが時間の経過とともに変更されるために準備する必要があります。"
    },
    {
      "indent": 3,
      "text": "The IETF Secretariat must take care to use the correct time in signing-time and binary-signing-time attributes. The inclusion of a date within the Internet-Draft by the authors that is shortly before the signing time attributes supplied by the IETF Secretariat provides confidence about the date that the Internet-Draft was posted to the repository. However, the IETF Secretariat may choose to perform signatures in batches, and the signing-time may be several hours or days after the time that the Internet-Draft was actually posted.",
      "ja": "IETF事務局は、署名時およびバイナリ署名時間の属性で正しい時間を使用するように注意する必要があります。IETF事務局が提供する署名時間属性の直前にインターネットドラフト内に日付を含めることは、インターネットドラフトがリポジトリに掲載された日付について自信を与えます。ただし、IETF事務局はバッチで署名を実行することを選択する場合があり、署名時間は、インターネットドラフトが実際に掲載された時間から数時間または数日後になる場合があります。"
    },
    {
      "indent": 3,
      "text": "As stated above, the IETF Secretariat may choose to sign Internet-Drafts in batches. This allows a single HSM to be used if multiple servers are located in one geographic location, and it allows the HSM to be off-line except when signatures are being generated. Further, this allows the IETF Secretariat to include manual steps, such as entering an HSM passphrase or inserting a smartcard, as part of the signing procedure to improve operations security.",
      "ja": "上記のように、IETF事務局は、バッチでインターネットドラフトに署名することを選択できます。これにより、複数のサーバーが1つの地理的位置に配置されている場合、単一のHSMを使用でき、署名が生成されている場合を除き、HSMをオフラインにすることができます。さらに、これにより、IETF事務局は、運用セキュリティを改善するための署名手順の一部として、HSMパスフレーズの入力やSmartCardの挿入など、手動の手順を含めることができます。"
    },
    {
      "indent": 0,
      "text": "6. Deployment and Operational Considerations",
      "section_title": true,
      "ja": "6. 展開と運用上の考慮事項"
    },
    {
      "indent": 3,
      "text": "The private key used to generate the IETF Secretariat signature ought to be stored in an HSM to provide protection from unauthorized disclosure. While the HSM will be operated by the IETF Secretariat, it ought to be owned by the IETF Trust. Accordingly, the Trustees of the IETF Trust will designate an appropriate certification authority to issue a certificate to the IETF Secretariat, and they will approve any procedures used by the IETF Secretariat for signing documents consistent with this specification.",
      "ja": "IETF事務局の署名を生成するために使用される秘密鍵は、不正な開示からの保護を提供するためにHSMに保存されるべきです。HSMはIETF事務局によって運営されますが、IETF Trustが所有する必要があります。したがって、IETF Trustの受託者は、IETF事務局に証明書を発行する適切な認証機関を指定し、IETF事務局がこの仕様と一致する文書に署名するために使用する手順を承認します。"
    },
    {
      "indent": 0,
      "text": "7. Design Rationale",
      "section_title": true,
      "ja": "7. デザインの理論的根拠"
    },
    {
      "indent": 3,
      "text": "A detached signature is used for all file formats. Some file formats, such as PDF and XML, have file-format-specific ways of handling digital signatures. These file-format-specific approaches are not used for two reasons. First, a single way to sign Internet-Drafts will ease implementation by the IETF Secretariat. Second, if the author includes a signature using one of these file-format-specific approaches, the IETF Secretariat signature does not harm it in any way.",
      "ja": "すべてのファイル形式に分離された署名が使用されます。PDFやXMLなどの一部のファイル形式には、デジタル署名を処理するファイル形式固有の方法があります。これらのファイル形式固有のアプローチは、2つの理由で使用されません。まず、インターネットドラフトに署名する単一の方法は、IETF事務局による実装を容易にします。第二に、著者がこれらのファイル形式固有のアプローチのいずれかを使用して署名を含めた場合、IETF事務局の署名はそれを決して害しません。"
    },
    {
      "indent": 3,
      "text": "File names are the means linking the detached signature to the signed document. A CMS signed attribute could have been specified to include another form of linkage, and this could be added in the future. At this point in time, it is important to support signature validation of expired Internet-Drafts that are obtained from non-IETF repositories. Therefore, the appropriate value for such a signed attribute is unclear. This specification allows an Internet-Draft and companion signature file to be stored anywhere without hindering signature validation.",
      "ja": "ファイル名は、分離された署名を署名されたドキュメントにリンクする手段です。CMS署名属性は、別の形式のリンケージを含めるように指定されている可能性があり、これは将来追加される可能性があります。この時点で、非ITFリポジトリから取得した期限切れのインターネットドラフトの署名検証をサポートすることが重要です。したがって、そのような署名された属性に対する適切な値は不明です。この仕様により、署名の検証を妨げることなく、インターネットドラフトとコンパニオン署名ファイルをどこにでも保存できます。"
    },
    {
      "indent": 0,
      "text": "8. Acknowledgments",
      "section_title": true,
      "ja": "8. 謝辞"
    },
    {
      "indent": 3,
      "text": "The idea for the Internet-Draft signature file came from a discussion with Scott Bradner at IETF 69 in Chicago. Many helpful suggestions came from Jim Schaad, Pasi Eronen, and Chris Newman.",
      "ja": "インターネットドラフト署名ファイルのアイデアは、シカゴのIETF 69でのスコットブラッドナーとの議論から来ました。多くの有益な提案は、ジム・シャード、パシ・エロネン、クリス・ニューマンから来ました。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "ja": "9. 参考文献"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "ja": "9.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[CMS] Housley, R., \"Cryptographic Message Syntax (CMS)\", RFC 3852, July 2004.",
      "ja": "[CMS] Housley、R。、「暗号化メッセージ構文（CMS）」、RFC 3852、2004年7月。"
    },
    {
      "indent": 3,
      "text": "[PKIX1] Cooper, D., Santesson, S., Farrell, S., Boeyen, S., Housley, R., and W. Polk, \"Internet X.509 Public Key Infrastructure Certificate and Certificate Revocation List (CRL) Profile\", RFC 5280, May 2008.",
      "ja": "[PKIX1] Cooper、D.、Santesson、S.、Farrell、S.、Boeyen、S.、Housley、R.、およびW. Polk、「Internet X.509公開キーインフラストラクチャ証明書および証明書取消リスト（CRL）プロファイル\"、RFC 5280、2008年5月。"
    },
    {
      "indent": 3,
      "text": "[STDWORDS] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[stdwords] Bradner、S。、「要件レベルを示すためにRFCで使用するためのキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[X.680] ITU-T Recommendation X.680: ISO/IEC 8824-1:2002, Information technology - Abstract Syntax Notation One (ASN.1): Specification of basic notation, 2002.",
      "ja": "[X.680] ITU-T推奨X.680：ISO/IEC 8824-1：2002、情報技術 - 抽象的構文表記1（ASN.1）：基本表記の仕様、2002。"
    },
    {
      "indent": 3,
      "text": "[X.690] ITU-T Recommendation X.690: ISO/IEC 8825-1:2002, Information technology - ASN.1 encoding rules: Specification of Basic Encoding Rules (BER), Canonical Encoding Rules (CER) and Distinguished Encoding Rules (DER), 2002.",
      "ja": "[X.690] ITU-Tの推奨X.690：ISO/IEC 8825-1：2002、情報技術-ASN.1エンコーディングルール：基本エンコーディングルール（BER）、標準エンコーディングルール（CER）、および区別されたエンコードルールの仕様（der）、2002年。"
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "ja": "9.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[BinTime] Housley, R., \"BinaryTime: An Alternate Format for Representing Date and Time in ASN.1\", RFC 4049, April 2005.",
      "ja": "[Bintime] Housley、R。、「Binarytime：Asn.1で日付と時刻を表すための代替形式」、RFC 4049、2005年4月。"
    },
    {
      "indent": 3,
      "text": "[FTP] Postel, J. and J. Reynolds, \"File Transfer Protocol\", STD 9, RFC 959, October 1985.",
      "ja": "[FTP] Postel、J。およびJ. Reynolds、「ファイル転送プロトコル」、STD 9、RFC 959、1985年10月。"
    },
    {
      "indent": 3,
      "text": "[MSG] Ramsdell, B., Ed., \"Secure/Multipurpose Internet Mail Extensions (S/MIME) Version 3.1 Message Specification\", RFC 3851, July 2004.",
      "ja": "[MSG] Ramsdell、B.、ed。、「Secure/Multipurpose Internet Mail Extensions（S/MIME）バージョン3.1メッセージ仕様」、RFC 3851、2004年7月。"
    },
    {
      "indent": 3,
      "text": "[OpenSSL] \"OpenSSL: The Open Source toolkit for SSL/TLS\", http://www.openssl.org/.",
      "ja": "[OpenSSL] \"OpenSSL：SSL/TLS用のオープンソースツールキット\"、http://www.openssl.org/。"
    },
    {
      "indent": 3,
      "text": "[R20060816] Bray, T., J. Paoli, C. M. Sperberg-McQueen, E. Maler, and F. Yergeau, \"Extensible Markup Language (XML) 1.0 (Fourth Edition)\", W3C Recommendation, 16 August 2006, http://www.w3.org/TR/2006/REC-xml-20060816/.",
      "ja": "[R20060816] Bray、T.、J。Paoli、C。M。Sperberg-Mcqueen、E。Maler、およびF. Yergeau、「拡張可能なマークアップ言語（XML）1.0（第4版）」、W3C推奨、2006年8月16日、http：//www.w3.org/tr/2006/rec-xml-20060816/"
    },
    {
      "indent": 3,
      "text": "[RANDOM] Eastlake, D., 3rd, Schiller, J., and S. Crocker, \"Randomness Requirements for Security\", BCP 106, RFC 4086, June 2005.",
      "ja": "[ランダム] Eastlake、D.、3rd、Schiller、J。、およびS. Crocker、「セキュリティのランダム性要件」、BCP 106、RFC 4086、2005年6月。"
    },
    {
      "indent": 3,
      "text": "[TELNET] Postel, J. and J. Reynolds, \"Telnet Protocol Specification\", STD 8, RFC 854, May 1983.",
      "ja": "[Telnet] Postel、J。およびJ. Reynolds、「Telnetプロトコル仕様」、STD 8、RFC 854、1983年5月。"
    },
    {
      "indent": 3,
      "text": "[TSP] Adams, C., Cain, P., Pinkas, D., and R. Zuccherato, \"Internet X.509 Public Key Infrastructure Time-Stamp Protocol (TSP)\", RFC 3161, August 2001.",
      "ja": "[TSP] Adams、C.、Cain、P.、Pinkas、D。、およびR. Zuccherato、「インターネットX.509公開キーインフラストラクチャタイムスタンププロトコル（TSP）」、RFC 3161、2001年8月。"
    },
    {
      "indent": 3,
      "text": "[UFNI] Klensin, J. and M. Padlipsky, \"Unicode Format for Network Interchange\", RFC 5198, March 2008.",
      "ja": "[UFNI] Klensin、J。およびM. Padlipsky、「ネットワークインターチェンジのユニコード形式」、RFC 5198、2008年3月。"
    },
    {
      "indent": 3,
      "text": "[X.501] ITU-T Recommendation X.501: Information Technology - Open Systems Interconnection - The Directory: Models, 1993.",
      "ja": "[X.501] ITU -Tの推奨X.501：情報技術 - オープンシステムの相互接続 - ディレクトリ：モデル、1993。"
    },
    {
      "indent": 0,
      "text": "Appendix: A",
      "ja": "付録：a"
    },
    {
      "indent": 3,
      "text": "OpenSSL 0.9.9 [OpenSSL] includes an implementation of CMS. The following command line can be used to verify an Internet-Draft signature:",
      "ja": "OpenSSL 0.9.9 [OpenSSL]には、CMSの実装が含まれます。次のコマンドラインを使用して、インターネットドラフトの署名を確認できます。"
    },
    {
      "indent": 5,
      "text": "openssl cms -verify -CAfile <cert-file> -content <internet-draft> /\n     -inform DER -in <p7s-file> -out /dev/null",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The arguments need to be provided as follows:",
      "ja": "引数は次のように提供する必要があります。"
    },
    {
      "indent": 6,
      "text": "<cert-file> the name of the file containing the trust anchor, which is typically the self-signed certificate of the certification authority that issued a certificate to the IETF Secretariat.",
      "ja": "<cert-file>トラストアンカーを含むファイルの名前。これは通常、IETF事務局に証明書を発行した認証当局の自己署名証明書です。"
    },
    {
      "indent": 6,
      "text": "<internet-draft> the name of the file containing the Internet-Draft after canonicalization.",
      "ja": "<Internet-Draft>標準化後のインターネットドラフトを含むファイルの名前。"
    },
    {
      "indent": 6,
      "text": "<p7s-file> the name of the file containing the detached signature that was generated in accordance with this specification.",
      "ja": "<p7s-file>この仕様に従って生成された分離した署名を含むファイルの名前。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者の連絡先"
    },
    {
      "indent": 3,
      "text": "Russell Housley Vigil Security, LLC 918 Spring Knoll Drive Herndon, VA 20170 USA",
      "ja": "Russell Housley Vigil Security、LLC 918 Spring Knoll Drive Herndon、VA 20170 USA"
    },
    {
      "indent": 3,
      "text": "EMail: housley@vigilsec.com",
      "raw": true,
      "ja": ""
    }
  ]
}