{
  "title": {
    "text": "RFC 5881 - Bidirectional Forwarding Detection (BFD) for IPv4 and IPv6 (Single Hop)",
    "ja": "RFC 5881 - IPv4およびIPv6（シングルホップ）の双方向転送検出（BFD）"
  },
  "number": 5881,
  "created_at": "2023-01-31 11:17:45.828481+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                           D. Katz\nRequest for Comments: 5881                                       D. Ward\nCategory: Standards Track                               Juniper Networks\nISSN: 2070-1721                                                June 2010",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 16,
      "text": "Bidirectional Forwarding Detection (BFD) for IPv4 and IPv6 (Single Hop)",
      "ja": "IPv4およびIPv6（シングルホップ）の双方向転送検出（BFD）"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document describes the use of the Bidirectional Forwarding Detection (BFD) protocol over IPv4 and IPv6 for single IP hops.",
      "ja": "このドキュメントでは、単一のIPホップにIPv4およびIPv6を介した双方向転送検出（BFD）プロトコルの使用について説明します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準トラックドキュメントです。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントは、インターネットエンジニアリングタスクフォース（IETF）の製品です。IETFコミュニティのコンセンサスを表しています。公開レビューを受けており、インターネットエンジニアリングステアリンググループ（IESG）からの出版が承認されています。インターネット標準の詳細については、RFC 5741のセクション2で入手できます。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc5881.",
      "ja": "このドキュメントの現在のステータス、任意のERRATA、およびそのフィードバックを提供する方法に関する情報は、http：//www.rfc-editor.org/info/rfc5881で取得できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2010 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2010 IETF Trustおよび文書著者として特定された人。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "このドキュメントは、BCP 78およびIETFドキュメント（http://trustee.ietf.org/license-info）に関連するIETF Trustの法的規定の対象となります。この文書に関するあなたの権利と制限を説明するので、これらの文書を注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、セクション4.Eで説明されている法的規定のセクション4.Eで説明されており、単純化されたBSDライセンスで説明されているように保証なしで提供される簡略化されたBSDライセンステキストを含める必要があります。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "One very desirable application for Bidirectional Forwarding Detection (BFD) [BFD] is to track IPv4 and IPv6 connectivity between directly connected systems. This could be used to supplement the detection mechanisms in routing protocols or to monitor router-host connectivity, among other applications.",
      "ja": "双方向転送検出（BFD）[BFD]の非常に望ましいアプリケーションの1つは、直接接続されたシステム間のIPv4とIPv6接続を追跡することです。これを使用して、ルーティングプロトコルの検出メカニズムを補完したり、他のアプリケーションの中でもルーターホスト接続を監視するために使用できます。"
    },
    {
      "indent": 3,
      "text": "This document describes the particulars necessary to use BFD in this environment. Interactions between BFD and other protocols and system functions are described in the BFD Generic Applications document [BFD-GENERIC].",
      "ja": "このドキュメントでは、この環境でBFDを使用するために必要な詳細について説明します。BFDと他のプロトコルとシステム関数間の相互作用は、BFDジェネリックアプリケーションドキュメント[BFD-Generic]で説明されています。"
    },
    {
      "indent": 0,
      "text": "1.1. Conventions Used in This Document",
      "section_title": true,
      "ja": "1.1. このドキュメントで使用されている規則"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [KEYWORDS].",
      "ja": "「必須」、「そうしない」、「必須」、「必要」、「しない」、「そうしない」、「そうではない」、「そうでない」、「推奨」、「5月」、および「オプション」は、RFC 2119 [キーワード]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. Applications and Limitations",
      "section_title": true,
      "ja": "2. アプリケーションと制限"
    },
    {
      "indent": 3,
      "text": "This application of BFD can be used by any pair of systems communicating via IPv4 and/or IPv6 across a single IP hop that is associated with an incoming interface. This includes, but is not limited to, physical media, virtual circuits, and tunnels.",
      "ja": "BFDのこのアプリケーションは、着信インターフェイスに関連付けられている単一のIPホップでIPv4および/またはIPv6を介して通信する任意のシステムで使用できます。これには、物理メディア、仮想回路、トンネルが含まれますが、これらに限定されません。"
    },
    {
      "indent": 3,
      "text": "Each BFD session between a pair of systems MUST traverse a separate network-layer path in both directions. This is necessary for demultiplexing to work properly, and also because (by definition) multiple sessions would otherwise be protecting the same path.",
      "ja": "システム間の各BFDセッションは、両方向に別のネットワーク層パスを通過する必要があります。これは、非gultiplexingが適切に機能するために必要であり、また（定義上）複数のセッションが同じパスを保護するためです。"
    },
    {
      "indent": 3,
      "text": "If BFD is to be used in conjunction with both IPv4 and IPv6 on a particular path, a separate BFD session MUST be established for each protocol (and thus encapsulated by that protocol) over that link.",
      "ja": "特定のパスでBFDをIPv4とIPv6の両方と組み合わせて使用する場合、そのリンクを介して各プロトコル（したがってそのプロトコルによってカプセル化された）に対して個別のBFDセッションを確立する必要があります。"
    },
    {
      "indent": 3,
      "text": "If the BFD Echo function is used, transmitted packets are immediately routed back towards the sender on the interface over which they were sent. This may interact with other mechanisms that are used on the two systems that employ BFD. In particular, ingress filtering [BCP38] is incompatible with the way Echo packets need to be sent. Implementations that support the Echo function MUST ensure that ingress filtering is not used on an interface that employs the Echo function or make an exception for ingress filtering Echo packets.",
      "ja": "BFDエコー関数を使用すると、送信されたパケットは、送信されたインターフェイス上の送信者にすぐに戻ります。これは、BFDを使用する2つのシステムで使用される他のメカニズムと相互作用する場合があります。特に、イングレスフィルタリング[BCP38]は、エコーパケットの送信方法と互換性がありません。エコー関数をサポートする実装は、エコー関数を使用するインターフェイスでイングレスフィルタリングが使用されないことを保証する必要があります。"
    },
    {
      "indent": 3,
      "text": "An implementation of the Echo function also requires Application Programming Interfaces (APIs) that may not exist on all systems. A system implementing the Echo function MUST be capable of sending packets to its own address, which will typically require bypassing the normal forwarding lookup. This typically requires access to APIs that bypass IP-layer functionality.",
      "ja": "Echo関数の実装には、すべてのシステムに存在しない可能性のあるアプリケーションプログラミングインターフェイス（API）も必要です。エコー関数を実装するシステムは、通常、通常の転送検索をバイパスする必要がある独自のアドレスにパケットを送信できる必要があります。これには通常、IP層機能をバイパスするAPIへのアクセスが必要です。"
    },
    {
      "indent": 3,
      "text": "Please note that BFD is intended as an Operations, Administration, and Maintenance (OAM) mechanism for connectivity check and connection verification. It is applicable for network-based services (e.g. router-to-router, subscriber-to-gateway, LSP/circuit endpoints, and service appliance failure detection). In these scenarios it is required that the operator correctly provision the rates at which BFD is transmitted to avoid congestion (e.g link, I/O, CPU) and false failure detection. It is not applicable for application-to-application failure detection across the Internet because it does not have sufficient capability to do necessary congestion detection and avoidance and therefore cannot prevent congestion collapse. Host-to-host or application-to-application deployment across the Internet will require the encapsulation of BFD within a transport that provides \"TCP-friendly\" [TFRC] behavior.",
      "ja": "BFDは、接続チェックと接続検証のための運用、管理、およびメンテナンス（OAM）メカニズムとして意図されていることに注意してください。ネットワークベースのサービス（例：ルーターからルーター、サブスクライバーからゲートウェイ、LSP/回路エンドポイント、およびサービスアプライアンスの障害検出など）に適用されます。これらのシナリオでは、オペレーターが、輻輳（リンク、I/O、CPUなど）および誤った障害検出を避けるために、BFDが送信されるレートを正しく提供する必要があります。必要な混雑検出と回避を行うのに十分な能力がなく、したがって輻輳の崩壊を防ぐことができないため、インターネット全体でアプリケーションからアプリケーションへの障害検出には適用できません。インターネット全体でホストからホストまたはアプリケーションへの展開には、「TCPフレンドリー」[TFRC]動作を提供するトランスポート内のBFDのカプセル化が必要です。"
    },
    {
      "indent": 0,
      "text": "3. Initialization and Demultiplexing",
      "section_title": true,
      "ja": "3. 初期化と脱ultiplexing"
    },
    {
      "indent": 3,
      "text": "In this application, there will be only a single BFD session between two systems over a given interface (logical or physical) for a particular protocol. The BFD session must be bound to this interface. As such, both sides of a session MUST take the \"Active\" role (sending initial BFD Control packets with a zero value of Your Discriminator), and any BFD packet from the remote machine with a zero value of Your Discriminator MUST be associated with the session bound to the remote system, interface, and protocol.",
      "ja": "このアプリケーションでは、特定のプロトコルに対して、特定のインターフェイス（論理または物理）にわたって2つのシステム間に単一のBFDセッションのみがあります。BFDセッションは、このインターフェイスにバインドする必要があります。そのため、セッションの両側は、「アクティブ」の役割（識別子のゼロ値で初期BFD制御パケットを送信する）を取る必要があり、差別器の値がゼロのリモートマシンからのBFDパケットは、リモートシステム、インターフェイス、およびプロトコルにバインドされたセッション。"
    },
    {
      "indent": 0,
      "text": "4. Encapsulation",
      "section_title": true,
      "ja": "4. カプセル化"
    },
    {
      "indent": 3,
      "text": "BFD Control packets MUST be transmitted in UDP packets with destination port 3784, within an IPv4 or IPv6 packet. The source port MUST be in the range 49152 through 65535. The same UDP source port number MUST be used for all BFD Control packets associated with a particular session. The source port number SHOULD be unique among all BFD sessions on the system. If more than 16384 BFD sessions are simultaneously active, UDP source port numbers MAY be reused on multiple sessions, but the number of distinct uses of the same UDP source port number SHOULD be minimized. An implementation MAY use the UDP port source number to aid in demultiplexing incoming BFD Control packets, but ultimately the mechanisms in [BFD] MUST be used to demultiplex incoming packets to the proper session.",
      "ja": "BFD制御パケットは、IPv4またはIPv6パケット内の宛先ポート3784を備えたUDPパケットに送信する必要があります。ソースポートは、49152から65535の範囲にある必要があります。特定のセッションに関連付けられたすべてのBFD制御パケットに、同じUDPソースポート番号を使用する必要があります。ソースポート番号は、システム上のすべてのBFDセッションの中で一意である必要があります。16384を超えるBFDセッションが同時にアクティブな場合、UDPソースポート番号は複数のセッションで再利用される可能性がありますが、同じUDPソースポート番号の明確な使用数を最小限に抑える必要があります。実装では、UDPポートソース番号を使用して、BFD制御パケットの逆流を再評価するのに役立ちますが、最終的には[BFD]のメカニズムを使用して、適切なセッションに着信パケットを再退屈させる必要があります。"
    },
    {
      "indent": 3,
      "text": "BFD Echo packets MUST be transmitted in UDP packets with destination UDP port 3785 in an IPv4 or IPv6 packet. The setting of the UDP source port is outside the scope of this specification. The destination address MUST be chosen in such a way as to cause the remote system to forward the packet back to the local system. The source address MUST be chosen in such a way as to preclude the remote system from generating ICMP or Neighbor Discovery Redirect messages. In particular, the source address SHOULD NOT be part of the subnet bound to the interface over which the BFD Echo packet is being transmitted, and it SHOULD NOT be an IPv6 link-local address, unless it is known by other means that the remote system will not send Redirects.",
      "ja": "BFDエコーパケットは、IPv4またはIPv6パケットで宛先UDPポート3785を備えたUDPパケットに送信する必要があります。UDPソースポートの設定は、この仕様の範囲外です。宛先アドレスは、リモートシステムがパケットをローカルシステムに戻すように選択する必要があります。ソースアドレスは、リモートシステムがICMPまたはNeighbor Discoveryリダイレクトメッセージの生成を妨げるような方法で選択する必要があります。特に、ソースアドレスは、BFDエコーパケットが送信されているインターフェイスにバインドされたサブネットの一部であってはなりません。また、リモートシステムが他の意味でわかっていない限り、IPv6リンクローカルアドレスであるべきではありません。リダイレクトは送信されません。"
    },
    {
      "indent": 3,
      "text": "BFD Echo packets MUST be transmitted in such a way as to ensure that they are received by the remote system. On multiaccess media, for example, this requires that the destination datalink address corresponds to the remote system.",
      "ja": "BFDエコーパケットは、リモートシステムによって受信されるようにするような方法で送信する必要があります。たとえば、Multiaccess Mediaでは、宛先Datalinkアドレスがリモートシステムに対応する必要があります。"
    },
    {
      "indent": 3,
      "text": "The above requirements may require the bypassing of some common IP layer functionality, particularly in host implementations.",
      "ja": "上記の要件では、特にホストの実装では、いくつかの一般的なIPレイヤー機能をバイパスする必要があります。"
    },
    {
      "indent": 0,
      "text": "5. TTL/Hop Limit Issues",
      "section_title": true,
      "ja": "5. TTL/ホップ制限の問題"
    },
    {
      "indent": 3,
      "text": "If BFD authentication is not in use on a session, all BFD Control packets for the session MUST be sent with a Time to Live (TTL) or Hop Limit value of 255. All received BFD Control packets that are demultiplexed to the session MUST be discarded if the received TTL or Hop Limit is not equal to 255. A discussion of this mechanism can be found in [GTSM].",
      "ja": "セッションでBFD認証が使用されていない場合、セッションのすべてのBFD制御パケットは、255のライブ（TTL）またはホップ制限値で送信する必要があります。受信したTTLまたはホップ制限が255に等しくない場合。このメカニズムの議論は[GTSM]に記載されています。"
    },
    {
      "indent": 3,
      "text": "If BFD authentication is in use on a session, all BFD Control packets MUST be sent with a TTL or Hop Limit value of 255. All received BFD Control packets that are demultiplexed to the session MAY be discarded if the received TTL or Hop Limit is not equal to 255. If the TTL/Hop Limit check is made, it MAY be done before any cryptographic authentication takes place if this will avoid unnecessary calculation that would be detrimental to the receiving system.",
      "ja": "セッションでBFD認証が使用されている場合、すべてのBFD制御パケットはTTLまたはホップ制限値255で送信する必要があります。255に等しい。TTL/ホップ制限チェックが行われた場合、受信システムに有害な不必要な計算を回避する場合、暗号化認証が行われる前に実行される場合があります。"
    },
    {
      "indent": 3,
      "text": "In the context of this section, \"authentication in use\" means that the system is sending BFD Control packets with the Authentication bit set and with the Authentication Section included and that all unauthenticated packets demultiplexed to the session are discarded, per the BFD base specification.",
      "ja": "このセクションのコンテキストでは、「使用中の認証」とは、システムが認証ビットセットと認証セクションを含むBFD制御パケットを送信していることを意味し、BFDベースの仕様に従って、セッションに反転したすべての認証パケットが破棄されます。"
    },
    {
      "indent": 0,
      "text": "6. Addressing Issues",
      "section_title": true,
      "ja": "6. 問題への対処"
    },
    {
      "indent": 3,
      "text": "Implementations MUST ensure that all BFD Control packets are transmitted over the one-hop path being protected by BFD.",
      "ja": "実装は、すべてのBFD制御パケットがBFDによって保護されている1ホップパスに送信されるようにする必要があります。"
    },
    {
      "indent": 3,
      "text": "On a multiaccess network, BFD Control packets MUST be transmitted with source and destination addresses that are part of the subnet (addressed from and to interfaces on the subnet).",
      "ja": "Multiaccessネットワークでは、BFD制御パケットは、サブネットの一部（サブネットのインターフェイスからアドレス指定）の一部であるソースおよび宛先アドレスを送信する必要があります。"
    },
    {
      "indent": 3,
      "text": "On a point-to-point link, the source address of a BFD Control packet MUST NOT be used to identify the session. This means that the initial BFD packet MUST be accepted with any source address, and that subsequent BFD packets MUST be demultiplexed solely by the Your Discriminator field (as is always the case). This allows the source address to change if necessary. If the received source address changes, the local system MUST NOT use that address as the destination in outgoing BFD Control packets; rather, it MUST continue to use the address configured at session creation. An implementation MAY notify the application that the neighbor's source address has changed, so that the application might choose to change the destination address or take some other action. Note that the TTL/Hop Limit check described in section 5 (or the use of authentication) precludes the BFD packets from having come from any source other than the immediate neighbor.",
      "ja": "ポイントツーポイントリンクでは、BFDコントロールパケットのソースアドレスを使用してセッションを識別してはなりません。これは、最初のBFDパケットを任意のソースアドレスで受け入れなければならず、その後のBFDパケットは、識別子フィールドのみによって非難される必要があることを意味します（常にそうです）。これにより、必要に応じてソースアドレスを変更できます。受信したソースアドレスが変更された場合、ローカルシステムは、そのアドレスを発信BFD制御パケットの宛先として使用してはなりません。むしろ、セッション作成時に構成されたアドレスを引き続き使用する必要があります。実装は、近隣のソースアドレスが変更されたことをアプリケーションに通知する場合があり、アプリケーションが宛先アドレスを変更したり、他のアクションを実行するかを選択する場合があります。セクション5（または認証の使用）で説明されているTTL/ホップ制限チェックは、BFDパケットがすぐ近く以外のソースから来たことを排除することに注意してください。"
    },
    {
      "indent": 0,
      "text": "7. BFD for Use with Tunnels",
      "section_title": true,
      "ja": "7. トンネルで使用するBFD"
    },
    {
      "indent": 3,
      "text": "A number of mechanisms are available to tunnel IPv4 and IPv6 over arbitrary topologies. If the tunnel mechanism does not decrement the TTL or Hop Limit of the network protocol carried within, the mechanism described in this document may be used to provide liveness detection for the tunnel. The BFD authentication mechanism SHOULD be used and is strongly encouraged.",
      "ja": "任意のトポロジーよりも多くのメカニズムがIPv4とIPv6をトンネルしています。トンネルメカニズムが内部にあるネットワークプロトコルのTTLまたはホップ制限を減少させない場合、このドキュメントに記載されているメカニズムを使用して、トンネルのlivenives検出を提供できます。BFD認証メカニズムを使用する必要があり、強く奨励されています。"
    },
    {
      "indent": 0,
      "text": "8. IANA Considerations",
      "section_title": true,
      "ja": "8. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "Ports 3784 and 3875 were assigned by IANA for use with the BFD Control and BFD Echo protocols, respectively.",
      "ja": "ポート3784および3875は、それぞれBFDコントロールとBFDエコープロトコルで使用するためにIANAによって割り当てられました。"
    },
    {
      "indent": 0,
      "text": "9. Security Considerations",
      "section_title": true,
      "ja": "9. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "In this application, the use of TTL=255 on transmit and receive, coupled with an association to an incoming interface, is viewed as supplying equivalent security characteristics to other protocols used in the infrastructure, as it is not trivially spoofable. The security implications of this mechanism are further discussed in [GTSM].",
      "ja": "このアプリケーションでは、送信および受信でTTL = 255を使用して、着信インターフェイスとの関連付けと組み合わせて、インフラストラクチャで使用される他のプロトコルに同等のセキュリティ特性を提供すると見なされます。このメカニズムのセキュリティへの影響については、[GTSM]でさらに説明します。"
    },
    {
      "indent": 3,
      "text": "The security implications of the use of BFD authentication are discussed in [BFD].",
      "ja": "BFD認証の使用のセキュリティへの影響については、[BFD]で説明されています。"
    },
    {
      "indent": 3,
      "text": "The use of the TTL=255 check simultaneously with BFD authentication provides a low overhead mechanism for discarding a class of unauthorized packets and may be useful in implementations in which cryptographic checksum use is susceptible to denial-of-service attacks. The use or non-use of this mechanism does not impact interoperability.",
      "ja": "BFD認証と同時にTTL = 255を使用すると、不正なパケットのクラスを破棄するためのオーバーヘッドメカニズムが低く、暗号化チェックサムの使用がサービス攻撃を拒否しやすい実装に役立つ可能性があります。このメカニズムの使用または不使用は、相互運用性に影響しません。"
    },
    {
      "indent": 0,
      "text": "10. References",
      "section_title": true,
      "ja": "10. 参考文献"
    },
    {
      "indent": 0,
      "text": "10.1. Normative References",
      "section_title": true,
      "ja": "10.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[BFD] Katz, D. and D. Ward, \"Bidirectional Forwarding Detection\", RFC 5880, June 2010.",
      "ja": "[BFD] Katz、D。およびD. Ward、「双方向転送検出」、RFC 5880、2010年6月。"
    },
    {
      "indent": 3,
      "text": "[BFD-GENERIC] Katz, D. and D. Ward, \"Generic Application of Bidirectional Forwarding Detection (BFD)\", RFC 5882, June 2010.",
      "ja": "[BFD-Generic] Katz、D。およびD. Ward、「双方向転送検出（BFD）の一般的な応用」、RFC 5882、2010年6月。"
    },
    {
      "indent": 3,
      "text": "[GTSM] Gill, V., Heasley, J., Meyer, D., Savola, P., Ed., and C. Pignataro, \"The Generalized TTL Security Mechanism (GTSM)\", RFC 5082, October 2007.",
      "ja": "[GTSM] Gill、V.、Heasley、J.、Meyer、D.、Savola、P.、Ed。、およびC. Pignataro、「一般化されたTTLセキュリティメカニズム（GTSM）」、RFC 5082、2007年10月。"
    },
    {
      "indent": 3,
      "text": "[KEYWORDS] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[キーワード] Bradner、S。、「要件レベルを示すためにRFCで使用するためのキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 0,
      "text": "10.2. Informative References",
      "section_title": true,
      "ja": "10.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[BCP38] Ferguson, P. and D. Senie, \"Network Ingress Filtering: Defeating Denial of Service Attacks which employ IP Source Address Spoofing\", BCP 38, RFC 2827, May 2000.",
      "ja": "[BCP38] Ferguson、P。およびD. Senie、「ネットワークイングレスフィルタリング：IPソースアドレススプーフィングを採用するサービス拒否攻撃の敗北」、BCP 38、RFC 2827、2000年5月。"
    },
    {
      "indent": 3,
      "text": "[TFRC] Floyd, S., Handley, M., Padhye, J., and J. Widmer, \"TCP Friendly Rate Control (TFRC): Protocol Specification\", RFC 5348, September 2008.",
      "ja": "[TFRC] Floyd、S.、Handley、M.、Padhye、J。、およびJ. Widmer、「TCPフレンドリーレートコントロール（TFRC）：プロトコル仕様」、RFC 5348、2008年9月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Dave Katz Juniper Networks 1194 N. Mathilda Ave. Sunnyvale, CA 94089-1206 USA",
      "ja": "Dave Katz Juniper Networks 1194 N. Mathilda Ave. Sunnyvale、CA 94089-1206 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1-408-745-2000\nEMail: dkatz@juniper.net",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Dave Ward Juniper Networks 1194 N. Mathilda Ave. Sunnyvale, CA 94089-1206 USA",
      "ja": "Dave Ward Juniper Networks 1194 N. Mathilda Ave. Sunnyvale、CA 94089-1206 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1-408-745-2000\nEMail: dward@juniper.net",
      "raw": true,
      "ja": ""
    }
  ]
}