{
  "title": {
    "text": "RFC 5872 - IANA Rules for the Protocol for Carrying Authentication for Network Access (PANA)",
    "ja": "RFC 5872 - ネットワークアクセスの認証を実施するためのプロトコルのためのIANA規則（PANA）"
  },
  "number": 5872,
  "created_at": "2019-10-30 02:56:26.812553+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                          J. Arkko\nRequest for Comments: 5872                                      Ericsson\nUpdates: 5191                                                   A. Yegin\nCategory: Standards Track                                        Samsung\nISSN: 2070-1721                                                 May 2010",
      "raw": true
    },
    {
      "indent": 5,
      "text": "                      IANA Rules for the\nProtocol for Carrying Authentication for Network Access (PANA)",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document relaxes the IANA rules for the Protocol for Carrying Authentication for Network Access (PANA).",
      "ja": "この文書では、ネットワークアクセス（PANA）の認証を実施するためのプロトコルのためのIANA規則を緩和します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc5872.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc5872で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2010 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2010 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "This document relaxes the IANA rules for the Protocol for Carrying Authentication for Network Access (PANA) [RFC5191]. Rules for the following protocol fields, all defined in [RFC5191], are affected:",
      "ja": "この文書では、ネットワークアクセス（PANA）[RFC5191]の認証を実施するためのプロトコルのIANAルールを緩和します。以下のプロトコルフィールドのための規則、すべてが[RFC5191]で定義されたが、影響を受けます。"
    },
    {
      "indent": 3,
      "text": "o Message Types",
      "ja": "Oメッセージの種類"
    },
    {
      "indent": 3,
      "text": "o Message Flags",
      "ja": "Oメッセージフラグ"
    },
    {
      "indent": 3,
      "text": "o Attribute-Value Pair (AVP) Flags",
      "ja": "O属性値ペア（AVP）のフラグ"
    },
    {
      "indent": 3,
      "text": "o Result-Code AVP Values",
      "ja": "O-結果コードAVP値を"
    },
    {
      "indent": 3,
      "text": "o Termination-Cause AVP Values",
      "ja": "終了 - 原因AVP値O"
    },
    {
      "indent": 3,
      "text": "The rationale for this update is that there can be situations in which it makes sense to grant an allocation under special circumstances. At the time of this writing, the IETF is in the process of approving one such allocation. By changing the current IANA rules to allow for IESG Approval [RFC5226] as well, it has become possible for the Internet Engineering Steering Group (IESG) to consider an allocation request, even if it does not fulfill the default rule. For instance, an experimental protocol extension could perhaps deserve an allocation from a field of reserved bits, as long as a sufficient number of bits still remain for other purposes, and the PANA community is happy with such allocation.",
      "ja": "このアップデートのための理論的根拠は、それが特別な状況下での割り当てを許可することは理にかなっている状況があり得ることです。この記事の執筆時点では、IETFはそのような割り当てを承認するプロセスです。 IESG承認[RFC5226]のためにできるように、現在のIANAのルールを変更することでも、それがデフォルトのルールを満たしていない場合でも、割り当て要求を検討するには、インターネットエンジニアリング運営グループ（IESG）のために可能となりました。例えば、実験プロトコルの拡張は、おそらく限り十分なビット数は、依然として他の目的のために残っているように、予約ビットのフィールドから割り当てを受けるに値することができ、及びPANAコミュニティは、このような割り当てに満足です。"
    },
    {
      "indent": 0,
      "text": "2. IANA Considerations",
      "section_title": true,
      "ja": "2. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has updated the registries related to PANA Message Types, Message Flags, AVP Flags, Result-Code AVP Values, and Termination-Cause AVP Values, as specified below. All other PANA IANA registries are to remain unchanged.",
      "ja": "以下に指定としてIANAは、PANAのメッセージの種類、メッセージフラグ、AVPフラグに関連するレジストリ、結果-コードAVP値、および終了 - 原因AVP値を更新しました。他のすべてのPANA IANAレジストリは変更されないままになっています。"
    },
    {
      "indent": 0,
      "text": "2.1. Message Types",
      "section_title": true,
      "ja": "2.1. メッセージタイプ"
    },
    {
      "indent": 3,
      "text": "The Message Types namespace is used to identify PANA messages. Value 0 is not used and is not assigned by IANA. The range of values from 1 - 65,519 are for permanent, standard Message Types, allocated by IETF Review or IESG Approval [RFC5226]. Previously, the rule for this range was allocation by IETF Review only. [RFC5191] defined the range of values from 1 - 4. The same Message Type is used for both the request and the answer messages, except for type 1. The Request bit distinguishes requests from answers.",
      "ja": "メッセージタイプのネームスペースは、PANAメッセージを識別するために使用されます。値0は使用されず、IANAによって割り当てられていません。 1の値の範囲 -  65519は、IETFレビューまたはIESG承認[RFC5226]によって割り当てられた恒久、標準メッセージタイプ、のためのものです。以前は、この範囲のためのルールは、IETFレビューによって割り当てました。タイプ1ビットが回答からの要求を識別する要求を除いて、同じメッセージタイプが要求および応答メッセージの両方のために使用される4  -  [RFC5191]は1の値の範囲を定義しました。"
    },
    {
      "indent": 3,
      "text": "The range of values from 65,520 - 65,535 (hexadecimal values 0xfff0 - 0xffff) is reserved for experimental messages. As these codes are only for experimental and testing purposes, no guarantee is made for interoperability between the communicating PANA Client (PaC) and PANA Authentication Agent (PAA) using experimental commands, as outlined in [RFC3692].",
      "ja": "65,535  -  65520の値の範囲（16進数値0xfff0は -  0xFFFFの）実験的なメッセージのために予約されています。これらのコードは、実験とテスト目的のためだけであるので、保証は、[RFC3692]に概説するように、実験的なコマンドを使用して通信PANAクライアント（PAC）とPANA認証エージェント（PAA）との間の相互運用性のために作られていません。"
    },
    {
      "indent": 0,
      "text": "2.2. Message Flags",
      "section_title": true,
      "ja": "2.2. メッセージフラグ"
    },
    {
      "indent": 3,
      "text": "There are 16 bits in the Flags field of the PANA message header. Section 6.2 of [RFC5191] assigned bit 0 ('R'), 1 ('S'), 2 ('C'), 3 ('A'), 4 ('P'), and 5 ('I'). Allocations from the remaining free bits in the PANA header Flag field are made via Standards Action or IESG Approval [RFC5226]. Previously, the rule for these bits was allocation by Standards Action only.",
      "ja": "PANAメッセージヘッダのフラグフィールドの16ビットがあります。 [RFC5191]に割り当てられたビット0（R ''）、1（ 'S'）、2（ 'C'）のセクション6.2、3（ 'A'）、4（ 'P'）、及び5（ 'I'） 。 PANAヘッダフラグフィールドの残りの空きビットから割り当ては標準アクションまたはIESG承認[RFC5226]を介して行われます。以前は、これらのビットのためのルールは、標準化アクションによって割り当てました。"
    },
    {
      "indent": 0,
      "text": "2.3. AVP Flags",
      "section_title": true,
      "ja": "2.3.  AVPフラグ"
    },
    {
      "indent": 3,
      "text": "There are 16 bits in the AVP Flags field of the AVP header, defined in Section 6.3 of [RFC5191]. That RFC also assigned bit 0 ('V'). The remaining bits are assigned via Standards Action or IESG Approval [RFC5226]. Previously, the rule for these bits was allocation by Standards Action only.",
      "ja": "[RFC5191]のセクション6.3で定義されたAVPヘッダのAVPフラグフィールドの16ビットが存在します。そのRFCはまた、ビット0（ 'V'）を割り当てます。残りのビットは、標準アクションまたはIESG承認[RFC5226]を介して割り当てられます。以前は、これらのビットのためのルールは、標準化アクションによって割り当てました。"
    },
    {
      "indent": 0,
      "text": "2.4. Result-Code AVP Values",
      "section_title": true,
      "ja": "2.4. 結果コードAVP値"
    },
    {
      "indent": 3,
      "text": "As defined in Section 8.7 of [RFC5191], the Result-Code AVP (AVP Code 7) defines the values from 0 - 2.",
      "ja": "2  -  [RFC5191]のセクション8.7で定義されているように、結果-コードAVP（AVPコード7）は0の値を定義します。"
    },
    {
      "indent": 3,
      "text": "All remaining values are available for assignment via IETF Review or IESG Approval [RFC5226]. Previously, the rule for these values was allocation by IETF Review only.",
      "ja": "残りのすべての値はIETFレビューまたはIESG承認[RFC5226]を介して、割り当てのために利用可能です。以前は、これらの値のルールは、IETFレビューによって割り当てました。"
    },
    {
      "indent": 0,
      "text": "2.5. Termination-Cause AVP Values",
      "section_title": true,
      "ja": "2.5. 終了 - 原因AVP値"
    },
    {
      "indent": 3,
      "text": "As defined in Section 8.9 of [RFC5191], the Termination-Cause AVP (AVP Code 9) defines the values 1, 4, and 8.",
      "ja": "[RFC5191]のセクション8.9で定義されているように、終端-原因AVP（AVPコード9）は値1,4、および8定義します。"
    },
    {
      "indent": 3,
      "text": "All remaining values are available for assignment via IETF Review or IESG Approval [RFC5226]. Previously, the rule for these values was allocation by IETF Review only.",
      "ja": "残りのすべての値はIETFレビューまたはIESG承認[RFC5226]を介して、割り当てのために利用可能です。以前は、これらの値のルールは、IETFレビューによって割り当てました。"
    },
    {
      "indent": 0,
      "text": "3. Security Considerations",
      "section_title": true,
      "ja": "3.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "This specification does not change the security properties of PANA.",
      "ja": "この仕様は、PANAのセキュリティプロパティを変更しません。"
    },
    {
      "indent": 3,
      "text": "However, a few words are necessary about the use of the experimental code points defined in Section 2.1. Potentially harmful side effects from the use of the experimental values need to be carefully evaluated before deploying any experiment across networks that the owner of the experiment does not entirely control. Guidance given in [RFC3692] about the use of experimental values needs to be followed.",
      "ja": "しかし、いくつかの単語は、セクション2.1で定義された実験的なコードポイントの使用について必要です。実験値を使用することから、潜在的に有害な副作用は慎重に実験の所有者が完全に制御していないネットワークを介して任意の実験を展開する前に評価する必要があります。実験値の使用について[RFC3692]で与えられたガイダンスに従うことが必要です。"
    },
    {
      "indent": 0,
      "text": "4. References",
      "section_title": true,
      "ja": "4.参考文献"
    },
    {
      "indent": 0,
      "text": "4.1. Normative References",
      "section_title": true,
      "ja": "4.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC5191] Forsberg, D., Ohba, Y., Patil, B., Tschofenig, H., and A. Yegin, \"Protocol for Carrying Authentication for Network Access (PANA)\", RFC 5191, May 2008.",
      "ja": "[RFC5191]フォースバーグ、D.、オオバ、Y.、パティル、B.、Tschofenig、H.、およびA. Yegin、RFC 5191、2008年5月 \"ネットワークアクセス（PANA）の認証を搬送するプロトコル\"。"
    },
    {
      "indent": 3,
      "text": "[RFC5226] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 5226, May 2008.",
      "ja": "[RFC5226] Narten氏、T.とH. Alvestrand、 \"RFCsにIANA問題部に書くためのガイドライン\"、BCP 26、RFC 5226、2008年5月。"
    },
    {
      "indent": 0,
      "text": "4.2. Informative References",
      "section_title": true,
      "ja": "4.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC3692] Narten, T., \"Assigning Experimental and Testing Numbers Considered Useful\", BCP 82, RFC 3692, January 2004.",
      "ja": "[RFC3692] Narten氏、T.、 \"役に立つと考えられ割り当て実験とテスト番号\"、BCP 82、RFC 3692、2004年1月。"
    },
    {
      "indent": 1,
      "text": "Appendix A. Changes from",
      "ja": "付録A.からの変更点"
    },
    {
      "indent": 3,
      "text": "This document changes the IANA rules for: Message Types, Message Flags, AVP Flags, Result-Code AVP Values, and Termination-Cause AVP Values.",
      "ja": "結果 - コードAVP値、および終了 - 原因AVP値、メッセージの種類、メッセージフラグ、AVPフラグ：この文書は、IANAのためのルールを変更します。"
    },
    {
      "indent": 0,
      "text": "Appendix B. Acknowledgments",
      "ja": "付録B.謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Yoshihiro Ohba, Ralph Droms, Magnus Westerlund, and Alfred Hoenes for reviews and comments on this topic.",
      "ja": "著者は、このトピックに関するレビューやコメントのため義弘大場、ラルフDroms、マグヌスウェスター、とアルフレッドHoenesに感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Jari Arkko Ericsson Jorvas 02420 Finland",
      "ja": "ヤリArkkoエリクソン02420 Jorvasフィンランド"
    },
    {
      "indent": 3,
      "text": "EMail: jari.arkko@piuha.net",
      "ja": "メールアドレス：jari.arkko@piuha.net"
    },
    {
      "indent": 3,
      "text": "Alper Yegin Samsung Istanbul Turkey",
      "ja": "アルパースティラーサムスンイスタンブールトルコ"
    },
    {
      "indent": 3,
      "text": "EMail: alper.yegin@yegin.org",
      "ja": "メールアドレス：alper.yegin@yegin.org"
    }
  ]
}