{
  "title": {
    "text": "RFC 5021 - Extended Kerberos Version 5 Key Distribution Center (KDC) Exchanges over TCP",
    "ja": "RFC 5021 - TCP上の拡張Kerberosバージョン5キー配布センター（KDC）交流"
  },
  "number": 5021,
  "created_at": "2019-10-22 00:38:43.326590+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                       S. Josefsson\nRequest for Comments: 5021                                           SJD\nUpdates: 4120                                                August 2007\nCategory: Standards Track",
      "raw": true
    },
    {
      "indent": 7,
      "text": "Extended Kerberos Version 5 Key Distribution Center (KDC)\n                    Exchanges over TCP",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The IETF Trust (2007).",
      "ja": "著作権（C）IETFトラスト（2007）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document describes an extensibility mechanism for the Kerberos V5 protocol when used over TCP transports. The mechanism uses the reserved high-bit in the length field. It can be used to negotiate TCP-specific Kerberos extensions.",
      "ja": "このドキュメントは、TCPトランスポート上で使用されるKerberos V5プロトコルの拡張メカニズムを説明しています。機構は、長さフィールドに貯留高いビットを使用します。 TCP固有のKerberosの拡張機能を交渉するために使用することができます。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . . . 2\n2.  Conventions Used in This Document . . . . . . . . . . . . . . . 2\n3.  Extension Mechanism for TCP Transport . . . . . . . . . . . . . 2\n4.  Interoperability Consideration  . . . . . . . . . . . . . . . . 3\n5.  Security Considerations . . . . . . . . . . . . . . . . . . . . 4\n6.  IANA Considerations . . . . . . . . . . . . . . . . . . . . . . 4\n7.  Acknowledgements  . . . . . . . . . . . . . . . . . . . . . . . 5\n8.  Normative References  . . . . . . . . . . . . . . . . . . . . . 5\nAppendix A.  Copying Conditions . . . . . . . . . . . . . . . . . . 6",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The Kerberos V5 [3] specification, in section 7.2.2, reserves the high order bit in the initial length field for TCP transport for future expansion. This document updates [3] to describe the behaviour when that bit is set. This mechanism is intended for extensions that are specific for the TCP transport.",
      "ja": "ケルベロスV5 [3]仕様は、セクション7.2.2で、将来の拡張のためにTCPトランスポートのための初期の長さフィールドの上位ビットを予約します。そのビットがセットされている場合は、このドキュメントの更新は、[3]の動作を説明します。このメカニズムは、TCPトランスポートに特異的な拡張のために意図されます。"
    },
    {
      "indent": 0,
      "text": "2. Conventions Used in This Document",
      "section_title": true,
      "ja": "この文書で使用される2.表記"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [1].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はありますRFC 2119に記載されるように解釈される[1]。"
    },
    {
      "indent": 0,
      "text": "3. Extension Mechanism for TCP Transport",
      "section_title": true,
      "ja": "TCPトランスポート3.拡張機能機構"
    },
    {
      "indent": 3,
      "text": "The reserved high bit of the request length field is used to signal the use of this extension mechanism. When the reserved high bit is set in the length field, the remaining 31 bits of the initial 4 octets are interpreted as a bitmap. Each bit in the bitmask can be used to request a particular extension. The 31 bits form the \"extension bitmask\". It is expected that other documents will describe the details associated with particular bits.",
      "ja": "リクエスト長フィールドの予約高いビットは、この拡張機構の使用を通知するために使用されます。リザーブ高いビット長フィールドに設定されている場合、最初の4つのオクテットの残りの31ビットは、ビットマップとして解釈されます。ビットマスクの各ビットは、特定の拡張を要求するために使用することができます。 31ビットは、「拡張ビットマスク」を形成します。他の文書は、特定のビットに関連付けられた詳細を説明することが期待されます。"
    },
    {
      "indent": 3,
      "text": "A 4-octet value with only the high bit set, and thus the extension bitmask all zeros, is called a PROBE. A client may send a probe to find out which extensions a KDC supports. A client may also set particular bits in the extension bitmask directly, if it does not need to query the KDC for available extensions before deciding which extension to request.",
      "ja": "唯一の高ビットがセットされた4オクテットの値、ひいては拡張がすべてゼロビットマスクは、プローブと呼ばれます。クライアントは、KDCがサポートする拡張モジュールをどの見つけるためにプローブを送信することができます。それが要求するために、どの拡張子を決定する前に利用できる拡張のためにKDCを照会する必要がない場合、クライアントはまた、ビットマスクを直接拡張に特定のビットをセットすることができます。"
    },
    {
      "indent": 3,
      "text": "Note that clients are not forced to use this extension mechanism, and further, clients are expected to only use it when they wish to negotiate a particular extension.",
      "ja": "クライアントは、この拡張メカニズムを使用するように強制されていない、そしてさらに、クライアントは、彼らが特定の拡張子を交渉したい場合にのみ、それを使用することが期待されていることに注意してください。"
    },
    {
      "indent": 3,
      "text": "The protocol is as follows. The client MUST begin by sending a 4-octet value with the high bit set. The packet is thus either a PROBE or a specific request for some extension(s). The client MUST NOT send additional data before the server has responded.",
      "ja": "次のようにプロトコルです。クライアントは、高いビットセットと4オクテットの値を送信することによって開始しなければなりません。パケットは、このようにプローブまたはいくつかの拡張（S）のための特定の要求のいずれかです。サーバーが応答した前に、クライアントが追加のデータを送ってはいけません。"
    },
    {
      "indent": 3,
      "text": "If a KDC receives a request for a set of extensions that it supports, it MUST respond by sending a 4-octet zero value, i.e., 0x00000000. The KDC MAY directly send additional data after the zero value, without waiting for the client to respond, as specified by the particular negotiated extension. (Note: A 4-octet zero value can never be sent by an implementation that conforms to RFC 4120 and that does not support this extension mechanism, because a KRB-ERROR is always of non-zero size.)",
      "ja": "KDCはそれがサポートする拡張セットの要求を受信した場合、それは4オクテットゼロ値、すなわち、0x00000000のを送信することによって応答しなければなりません。 KDCは、直接クライアントが特定のネゴシエート拡張子で指定され、応答するのを待つことなく、ゼロ値の後に追加のデータを送信することができます。 （注：KRB-ERRORがゼロサイズで常にあるため、4オクテットゼロ値は、RFC 4120に準拠し、かつ、この拡張機構をサポートしていない実装によって送信することはできません。）"
    },
    {
      "indent": 3,
      "text": "If a KDC receives a PROBE, or if a KDC does not support all extensions corresponding to set bits in the extension bitmask, the KDC MUST return 4 octets with the high bit set, and with the remaining bitmask indicating which extensions it supports. The KDC then MUST wait, and the client MUST send a second 4-octet value with the high bit set. If the second 4-octet value is a PROBE or an unsupported extension, the KDC MUST close the connection. This can be used by the client to shut down a session when the KDC did not support an extension that is required by the client. If the second 4-octet value is a supported extension, the KDC MUST respond by sending a 4-octet zero value, i.e., 0x00000000. The KDC MAY directly send additional data after the zero value, as specified by the particular negotiated extension.",
      "ja": "KDCは、プローブを受信した場合、KDCは、拡張ビットマスク内のビットをセットに対応するすべての拡張機能をサポートしていない場合、または、KDCは、高いビットセットで4つのオクテットを返し、それがサポートする拡張モジュールを示し、残りのビットマスクとしなければなりません。 KDCは、待たなければなりません、そして、クライアントは、高ビットが設定された第2の4オクテット値を送らなければなりません。第4オクテットの値は、プローブまたはサポートされていない拡張である場合、KDCは接続を閉じなければなりません。これは、KDCは、クライアントによって要求された拡張機能をサポートしていませんでしたときにセッションをシャットダウンするために、クライアントで使用することができます。第4オクテットの値がサポートされている拡張された場合、KDCは、すなわち、0x00000000の4オクテットゼロ値を送信することによって応答しなければなりません。特定のネゴシエート拡張子によって指定されるようにKDCを直接、ゼロ値の後に追加のデータを送信することができます。"
    },
    {
      "indent": 3,
      "text": "The client and KDC SHOULD wait for the other side to respond according to this protocol, and the client and KDC SHOULD NOT close the connection prematurely. Resource availability considerations may influence whether, and for how long, the client and KDC will wait for the other side to respond to a request.",
      "ja": "クライアントとKDCは、他の側は、このプロトコルに従って応答するのを待ち、そしてクライアントとKDCは途中で接続を閉じるすべきでありません。リソースの可用性の考慮事項は、他の側が要求に応答するためにどのくらいの期間、クライアントとKDCが待機するかどうか、とのために影響を与える可能性があります。"
    },
    {
      "indent": 3,
      "text": "The KDC MUST NOT support the extension mechanism if it does not support any extensions. If no extensions are supported, the KDC MUST return a KRB-ERROR message with the error KRB_ERR_FIELD_TOOLONG and MUST close the TCP stream, similar to what an implementation that does not understand this extension mechanism would do.",
      "ja": "それは任意の拡張子をサポートしていない場合、KDCは、拡張メカニズムをサポートしてはなりません。何の拡張機能がサポートされていない場合、KDCはエラーKRB_ERR_FIELD_TOOLONGでKRB-ERRORメッセージを返さなければなりませんし、この拡張メカニズムを理解していない実装がどうなるのかと似TCPストリームを、閉じる必要があります。"
    },
    {
      "indent": 3,
      "text": "The behaviour when more than one non-high bit is set depends on the particular extension mechanisms. If a requested extension (bit X) does not specify how it interacts with another requested extension (bit Y), the KDC MUST treat the request as a PROBE or unsupported extension, and proceed as above.",
      "ja": "複数の非高ビットがセットされている動作は、特定の拡張メカニズムに依存します。要求された拡張（ビットX）は、それが別の要求拡張（ビットY）と相互作用する方法を指定しない場合、KDCは、プローブまたはサポートされていない拡張機能として要求を処理し、上記のように進行しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Each extension MUST describe the structure of protocol data beyond the length field, and the behaviour of the client and KDC. In particular, the structure may be a protocol with its own message framing. If an extension mechanism reserves multiple bits, it MUST describe how they interact.",
      "ja": "各拡張は、長さフィールドを超えたプロトコルデータの構造、およびクライアントとKDCの行動を説明しなければなりません。具体的には、構造は、独自のメッセージフレーミングを持つプロトコルであってもよいです。拡張メカニズムは、複数のビットを予約した場合、それは彼らがどのように相互作用するかを説明しなければなりません。"
    },
    {
      "indent": 0,
      "text": "4. Interoperability Consideration",
      "section_title": true,
      "ja": "4.相互運用性の検討"
    },
    {
      "indent": 3,
      "text": "Implementations with support for TCP that do not claim to conform to RFC 4120 may not handle the high bit correctly. The KDC behaviour may include closing the TCP connection without any response, and logging an error message in the KDC log. When this was written, this problem existed in modern versions of popular KDC implementations. Implementations experiencing trouble getting the expected responses from a KDC might assume that the KDC does not support this extension mechanism. A client might remember this semi-permanently, to avoid triggering the same problematic behaviour on the KDC every time. Care should be taken to avoid unexpected behaviour for the user when the KDC is eventually upgraded. Implementations might also provide a way to enable and disable this extension on a per-realm basis. How to handle these backwards compatibility quirks are in general left unspecified.",
      "ja": "正しく高ビットを処理できませんRFC 4120に準拠するように主張しないTCPをサポートする実装。 KDCの動作は、任意の応答なしでTCP接続を閉じると、KDCログにエラーメッセージを記録挙げられます。これが書かれた場合は、この問題は、人気のKDC実装の最近のバージョンに存在していました。 KDCから期待される応答を得るトラブルを経験した実装は、KDCは、この拡張メカニズムをサポートしていないと仮定することがあります。クライアントは、KDCで同じ問題行動するたびにトリガーを避けるために、この半恒久的に覚えているかもしれません。ケアは、KDCが最終的にアップグレードされたときに、ユーザーのために予期しない動作を避けるために注意しなければなりません。また、実装はレルム単位でこの拡張機能を有効または無効にする方法を提供するかもしれません。これらの下位互換性癖を処理する方法の一般的な左で規定されていません。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "Because the initial length field is not protected, it is possible for an active attacker (i.e., one that is able to modify traffic between the client and the KDC) to make it appear to the client that the server does not support this extension mechanism (a downgrade attack). Further, active attackers can also interfere with the negotiation of which extensions are supported, which may also result in a downgrade attack. This problem can be solved by having a policy in the clients and in the KDC to reject connections that do not have the desired properties. The problem can also be mitigated by having the negotiated extension send a cryptographic checksum of the offered extensions.",
      "ja": "初期の長さフィールドが保護されていないので、それがアクティブな攻撃が可能です（つまり、クライアントとKDC間のトラフィックを変更することが可能である1）サーバがこの拡張メカニズムをサポートしていないことをクライアントに見えるようにします（ダウングレード攻撃）。さらに、能動的攻撃者はまた、ダウングレード攻撃をもたらす可能性の拡張機能がサポートされているの交渉に干渉することができます。この問題は、所望の特性を持っていない接続を拒否し、クライアントにし、KDCにポリシーを持っていることによって解決することができます。問題は、交渉され拡張子が提供エクステンションの暗号チェックサムを送信することによって緩和することができます。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has created a new registry for \"Kerberos TCP Extensions\". The initial contents of this registry are:",
      "ja": "IANAは、「KerberosのTCP拡張機能」のための新しいレジストリを作成しました。このレジストリの初期の内容は以下のとおりです。"
    },
    {
      "indent": 3,
      "text": "Bit #                                             Reference\n-----                                             ---------\n0..29         AVAILABLE for registration.\n30            RESERVED.                           RFC 5021",
      "raw": true
    },
    {
      "indent": 3,
      "text": "IANA will register values 0 to 29 after IESG Approval, as defined in BCP 64 [2]. Assigning value 30 requires a Standards Action that updates or obsoletes this document.",
      "ja": "BCP 64 [2]で定義されるようにIANAは、IESGの承認後29に値0を登録します。値30を代入すると、この文書を更新または廃止基準アクションが必要です。"
    },
    {
      "indent": 3,
      "text": "Registration policy: The IESG will act as a steward for the namespace, considering whether the registration is justified given the limited size of the namespace. The IESG will also confirm that proposed registrations are not harmful to the Internet.",
      "ja": "登録ポリシー：IESGは登録が名前空間の限られたサイズ与えられた正当化されるかどうかを検討し、名前空間のためのスチュワードとして機能します。 IESGも提案登録がインターネットに有害でないことを確認します。"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgements",
      "section_title": true,
      "ja": "7.謝辞"
    },
    {
      "indent": 3,
      "text": "Nicolas Williams, Jeffrey Hutzelman, Sam Hartman, and Chris Newman provided comments that improved the protocol and document.",
      "ja": "ニコラス・ウィリアムズ、ジェフリーHutzelman、サム・ハートマン、そしてクリス・ニューマンは、プロトコルおよびドキュメントを改善し、コメントを提供しました。"
    },
    {
      "indent": 3,
      "text": "Thanks to Andrew Bartlett who pointed out that some implementations (MIT Kerberos and Heimdal) did not follow RFC 4120 properly with regards to the high bit, which resulted in an Interoperability Consideration.",
      "ja": "いくつかの実装（MIT KerberosとのHeimdal）は相互運用性を考慮した結果、高ビットに関して、と正しくRFC 4120に従わなかったことを指摘したアンドリュー・バートレットに感謝します。"
    },
    {
      "indent": 0,
      "text": "8. Normative References",
      "section_title": true,
      "ja": "8.引用規格"
    },
    {
      "indent": 3,
      "text": "[1] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[1]ブラドナーのは、S.は、BCP 14、RFC 2119、1997年3月の \"RFCsにおける使用のためのレベルを示すために\"。"
    },
    {
      "indent": 3,
      "text": "[2] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 2434, October 1998.",
      "ja": "[2] Narten氏、T.とH. Alvestrand、 \"RFCsにIANA問題部に書くためのガイドライン\"、BCP 26、RFC 2434、1998年10月。"
    },
    {
      "indent": 3,
      "text": "[3] Neuman, C., Yu, T., Hartman, S., and K. Raeburn, \"The Kerberos Network Authentication Service (V5)\", RFC 4120, July 2005.",
      "ja": "[3]ノイマン、C.、ゆう、T.、ハルトマン、S.、およびK.レイバーン、 \"ケルベロスネットワーク認証サービス（V5）\"、RFC 4120、2005年7月。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Copying Conditions",
      "ja": "付録A.コピー条件"
    },
    {
      "indent": 3,
      "text": "Regarding this entire document or any portion of it, the author makes no guarantees and is not responsible for any damage resulting from its use. The author grants irrevocable permission to anyone to use, modify, and distribute it in any way that does not diminish the rights of anyone else to use, modify, and distribute it, provided that redistributed derivative works do not contain misleading author or version information. Derivative works need not be licensed under similar terms.",
      "ja": "この文書全体またはその一部については、作者は保証しませんし、その使用に起因するいかなる損害についても責任を負いません。派生作品を再配布提供し、それを使用、変更、および、使用変更する他の誰の権利を損なわない任意の方法でそれを配布し、配布するための誰にも著者の補助金取消不能の許可は、著作者またはバージョンの情報が誤解を招く含まれていません。派生作品は、同様の条件の下でライセンスされる必要はありません。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Simon Josefsson SJD",
      "ja": "サイモンJosefsson氏SJD"
    },
    {
      "indent": 3,
      "text": "EMail: simon@josefsson.org",
      "ja": "メールアドレス：simon@josefsson.org"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The IETF Trust (2007).",
      "ja": "著作権（C）IETFトラスト（2007）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "この文書では、BCP 78に含まれる権利と許可と制限の適用を受けており、その中の記載を除いて、作者は彼らのすべての権利を保有します。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE IETF TRUST AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とCONTRIBUTOR「そのまま」、ORGANIZATION HE / SHEが表すまたはインターネットSOCIETY、（もしあれば）を後援し、IETF TRUST ANDインターネットエンジニアリングタスクフォース放棄ALLに設けられています。保証は、明示または黙示、この情報の利用および特定目的に対する権利または商品性または適合性の黙示の保証を侵害しない任意の保証がこれらに限定されません。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、本書またはそのような権限下で、ライセンスがたりないかもしれない程度に記載された技術の実装や使用に関係すると主張される可能性があります任意の知的財産権やその他の権利の有効性または範囲に関していかなる位置を取りません利用可能です。またそれは、それがどのような権利を確認する独自の取り組みを行ったことを示すものでもありません。 RFC文書の権利に関する手続きの情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IPRの開示のコピーが利用できるようにIETF事務局とライセンスの保証に行われた、または本仕様の実装者または利用者がそのような所有権の使用のための一般的なライセンスまたは許可を取得するために作られた試みの結果を得ることができますhttp://www.ietf.org/iprのIETFのオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、その注意にこの標準を実装するために必要とされる技術をカバーすることができる任意の著作権、特許または特許出願、またはその他の所有権を持ってすべての利害関係者を招待します。 ietf-ipr@ietf.orgのIETFに情報を記述してください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}