{
  "title": {
    "text": "RFC 5620 - RFC Editor Model (Version 1)",
    "ja": "RFC 5620 - RFCエディターモデル（バージョン1）"
  },
  "number": 5620,
  "created_at": "2023-03-04 11:17:21.062186+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                    O. Kolkman, Ed.\nRequest for Comments: 5620                                           IAB\nCategory: Informational                                      August 2009",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 22,
      "text": "RFC Editor Model (Version 1)",
      "ja": "RFCエディターモデル（バージョン1）"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "The RFC Editor performs a number of functions that may be carried out by various persons or entities. The RFC Editor model presented in this document divides the responsibilities for the RFC Series into four functions: The RFC Series Editor, the Independent Submission Editor, the RFC Production Center, and the RFC Publisher. It also introduces the RFC Series Advisory Group and an (optional) Independent Submission Stream Editorial Board. The model outlined here is intended to increase flexibility and operational support options, provide for the orderly succession of the RFC Editor, and ensure the continuity of the RFC series, while maintaining RFC quality and timely processing, ensuring document accessibility, reducing costs, and increasing cost transparency.",
      "ja": "RFCエディターは、さまざまな人またはエンティティが実行できる多数の機能を実行します。このドキュメントに示されているRFCエディターモデルは、RFCシリーズの責任を4つの機能に分割します。RFCシリーズエディター、独立した提出エディター、RFC制作センター、RFC出版社です。また、RFCシリーズアドバイザリーグループと（オプションの）独立した提出ストリーム編集委員会を紹介します。ここで概説するモデルは、柔軟性と運用サポートオプションを増やし、RFCエディターの整然とした継承を提供し、RFCシリーズの継続性を確保することを目的としています。コストの透明性。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモは、インターネットコミュニティに情報を提供します。いかなる種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2009 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2009 IETF Trustおよび文書著者として特定された人。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents in effect on the date of publication of this document (http://trustee.ietf.org/license-info). Please review these documents carefully, as they describe your rights and restrictions with respect to this document.",
      "ja": "このドキュメントは、BCP 78およびこのドキュメントの公開日（http://trustee.ietf.org/license-info）に有効なIETFドキュメントに関連するIETF Trustの法的規定の対象となります。この文書に関するあなたの権利と制限を説明するので、これらの文書を注意深く確認してください。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n2. IAOC Implementation .............................................4\n   2.1. Expenses for the RFC Editor ................................4\n3. RFC Editor Model ................................................5\n   3.1. RFC Series Editor ..........................................6\n   3.2. Independent Submission Editor ..............................8\n   3.3. RFC Production Center ......................................9\n   3.4. RFC Publisher .............................................11\n4. Committees .....................................................11\n   4.1. RFC Series Advisory Group (RSAG) ..........................11\n        4.1.1. Charter ............................................11\n        4.1.2. Membership .........................................12\n        4.1.3. Disagreements among RFC Editor Entities ............13\n   4.2. Independent Submission Stream Editorial Board .............14\n5. IANA Considerations ............................................14\n6. Security Considerations ........................................14\n7. Acknowledgments ................................................15\n8. References .....................................................16\n   8.1. Normative References ......................................16\n   8.2. Informative References.....................................16\nAppendix A. 2009 Selection Process ................................17\n   A.1. Ad Hoc Advisory Committee(s) ..............................17\n   A.2. The IAB Selection Process of an RFC Series Editor\n        and/or an Independent Submission Editor ...................17\n        A.2.1. Nominations and Eligibility ........................17\n        A.2.2. Committees in 2009 .................................18\n        A.2.3. Selection ..........................................18\n        A.2.4. Care of Personal Information........................18\n        A.2.5. Term of Office and Selection Time Frame ............19",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The IAB, on behalf of the Internet technical community, is concerned with ensuring the continuity of the RFC Series, orderly RFC Editor succession, maintaining RFC quality, and RFC document accessibility. The IAB is also sensitive to the concerns of the IETF Administrative Oversight Committee (IAOC) about providing the necessary services in a cost-effective and efficient manner.",
      "ja": "IABは、インターネット技術コミュニティを代表して、RFCシリーズの継続性、秩序あるRFCエディターの継承、RFC品質の維持、およびRFCドキュメントアクセシビリティを確保することに関心があります。IABは、必要なサービスを費用対効果の高い効率的な方法で提供することについて、IETF管理監視委員会（IAOC）の懸念にも敏感です。"
    },
    {
      "indent": 3,
      "text": "The definition of the RFC series is described in RFC 4844 [1]. Section 3.1 of RFC 4844 defines \"RFC Editor\":",
      "ja": "RFCシリーズの定義は、RFC 4844 [1]で説明されています。RFC 4844のセクション3.1は、「RFCエディター」を定義しています。"
    },
    {
      "indent": 1,
      "text": "| 3.1. RFC Editor\n|\n|  Originally, there was a single person acting as editor of the RFC\n|  Series (the RFC Editor).  The task has grown, and the work now\n|  requires the organized activity of several experts, so there are RFC\n|  Editors, or an RFC Editor organization.  In time, there may be\n|  multiple organizations working together to undertake the work\n|  required by the RFC Series.  For simplicity's sake, and without\n|  attempting to predict how the role might be subdivided among them,\n|  this document refers to this collection of experts and organizations\n|  as the \"RFC Editor\".\n|\n|  The RFC Editor is an expert technical editor and series editor,\n|  acting to support the mission of the RFC Series.  As such, the RFC\n|  Editor is the implementer handling the editorial management of the\n|  RFC Series, in accordance with the defined processes.  In addition,\n|  the RFC Editor is expected to be the expert and prime mover in\n|  discussions about policies for editing, publishing, and archiving\n|  RFCs.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "RFC 4844 makes no attempt to explore the internal organization of the RFC Editor. However, RFC 4844 envisions changes in the RFC Editor organizational structure. In discussion with the Internet community, the IAB considered changes that increase flexibility and operational support options, provide for the orderly succession of the RFC Editor, and ensure the continuity of the RFC series, while maintaining RFC quality and timely processing, ensuring document accessibility, reducing costs, and increasing cost transparency. The model set forth below is the result of those discussions, and examines the internal organization of the RFC Editor, while remaining consistent with RFC 4844.",
      "ja": "RFC 4844は、RFCエディターの内部組織を調査しようとはしません。ただし、RFC 4844は、RFCエディターの組織構造の変更を想定しています。IABは、インターネットコミュニティとの議論で、柔軟性と運用サポートオプションを増やし、RFCエディターの整然とした継承を提供し、RFCシリーズの継続性を確保し、RFCの品質とタイムリーな処理を維持し、ドキュメントのアクセシビリティを確保し、ドキュメントのアクセシビリティを確保する変更を検討しました。コストの削減、およびコストの透明性の向上。以下に示すモデルは、これらの議論の結果であり、RFC 4844と一致しながら、RFCエディターの内部組織を調べます。"
    },
    {
      "indent": 3,
      "text": "Note that RFC 4844 uses the term \"RFC Editor function\" or \"RFC Editor\" as the collective set of responsibilities for which this memo provides a model for internal organization. This memo introduces the term \"RFC Series Editor\" or \"Series Editor\" for one of the organizational components.",
      "ja": "RFC 4844は、「RFCエディター関数」または「RFCエディター」という用語を、このメモが内部組織のモデルを提供する責任の集合セットとして使用していることに注意してください。このメモでは、組織コンポーネントの1つについて「RFCシリーズエディター」または「シリーズエディター」という用語を紹介します。"
    },
    {
      "indent": 3,
      "text": "While the IAB approved the initial version of this RFC Editor model on October 1, 2008, the model has received clarifications since. It should be noted that the publication of the document as an RFC does not cast the model in stone, as the primary purpose of this document, throughout the publication process, is to encourage normal community review in order to ascertain consensus to work to this model as a first step. The document, and the resulting structures, will be modified as needed through normal procedures. The IAB will continue to monitor discussions within the community about potential adjustments to the RFC Editor model and recognizes that the process described in this document may need to be adjusted to align with any changes that result from such discussions, hence the version number in the title.",
      "ja": "IABは2008年10月1日にこのRFCエディターモデルの初期バージョンを承認しましたが、モデルはそれ以来明確化を受け取りました。このドキュメントとしてのドキュメントの公開は、このドキュメントの主な目的は、公開プロセス全体を通してモデルをまとめていないことに注意する必要があります。最初のステップとして。ドキュメントと結果の構造は、通常の手順により必要に応じて変更されます。IABは、RFCエディターモデルへの潜在的な調整に関するコミュニティ内での議論を引き続き監視し、このドキュメントに記載されているプロセスを、そのような議論から生じる変更に合わせて調整する必要があることを認識しているため、タイトルのバージョン番号。"
    },
    {
      "indent": 3,
      "text": "In particular, the document will be reviewed after the various transition periods and mechanisms specified in this version are completed.",
      "ja": "特に、このバージョンで指定されたさまざまな移行期間とメカニズムが完了した後、ドキュメントはレビューされます。"
    },
    {
      "indent": 0,
      "text": "2. IAOC Implementation",
      "section_title": true,
      "ja": "2. IAOC実装"
    },
    {
      "indent": 3,
      "text": "The model is constructed in such a way that it allows for all these functions to be implemented jointly or under separate contractual arrangements. In fact, a bidder could put together a proposal that includes one or more subcontractors. The reporting structure will depend on the manner that the contracts are awarded, and they are subject to change over time. As a result, the model describes only responsibilities, procedures, and process. The exact implementation is a responsibility of the IAOC.",
      "ja": "このモデルは、これらすべての機能を共同または別々の契約上の取り決めの下で実装できるように構築されます。実際、入札者は、1人以上の下請業者を含む提案をまとめることができます。報告構造は、契約の授与方法に依存し、時間とともに変更される場合があります。その結果、モデルは責任、手順、およびプロセスのみを説明します。正確な実装は、IAOCの責任です。"
    },
    {
      "indent": 0,
      "text": "2.1. Expenses for the RFC Editor",
      "section_title": true,
      "ja": "2.1. RFCエディターの費用"
    },
    {
      "indent": 3,
      "text": "The expenses discussed in this document are not new expenses. They are part of the IASA budget. Today, these expenses are part of the RFC Editor contract with the University of Southern California's Information Sciences Institute.",
      "ja": "この文書で議論されている費用は、新しい費用ではありません。彼らはIASA予算の一部です。今日、これらの費用は、南カリフォルニア大学情報科学研究所とのRFC編集者契約の一部です。"
    },
    {
      "indent": 0,
      "text": "3. RFC Editor Model",
      "section_title": true,
      "ja": "3. RFCエディターモデル"
    },
    {
      "indent": 3,
      "text": "The RFC Editor model divides the responsibilities for the RFC Series into the following components:",
      "ja": "RFCエディターモデルは、RFCシリーズの責任を次のコンポーネントに分割します。"
    },
    {
      "indent": 3,
      "text": "o RFC Series Editor (\"RSE\").",
      "ja": "o RFCシリーズエディター（ \"RSE\"）。"
    },
    {
      "indent": 3,
      "text": "o Independent Submission Editor (\"ISE\").",
      "ja": "o 独立した提出エディター（「ISE」）。"
    },
    {
      "indent": 3,
      "text": "o RFC Production Center.",
      "ja": "o RFC生産センター。"
    },
    {
      "indent": 3,
      "text": "o RFC Publisher.",
      "ja": "o RFC出版社。"
    },
    {
      "indent": 3,
      "text": "The RFC Series production and process under this structure is schematically represented by the figure below. (The figure does not depict oversight and escalation relations.)",
      "ja": "この構造の下でのRFCシリーズの生産とプロセスは、以下の図で概略的に表されています。（この図は、監視とエスカレーションの関係を描写していません。）"
    },
    {
      "indent": 3,
      "text": "           ------     -----     ------     ---------\nStream    |      |   |     |   |      |   |Community|\nPro-      | IETF |   | IAB |   | IRTF |   |   at    |\nducers    |      |   |     |   |      |   |  Large  |\n           --^---     --^--     ---^--     ----^----\n             |          |          |           |\n             |          |          |           |             -------\n             |          |          |           |            | Indep.|\n           --v---    ---v---    ---v--     ----v------      | Stream|\nStream    |      |   |     |   |      |   |Independent|     | Edi-  |\nAppro-    | IESG |   | IAB |   | IRSG |   |Submission |.....| torial|\nvers      |      |   |     |   |      |   |  Editor   |     | Board |\n           ----^-    ---^---   ----^---    ----^------       -------\n               |        |          |           |\n               |        |          |           |             -------\n               |        |          |           |            | RFC   |\n ------      --v--------v----------v-----------v-----       | Series|\n|      |    |                                        |      | Adv.  |\n| IANA | <->|        RFC Production Center           <---.  | Group |\n|      |    |                                        |   |   -------\n ------      -----------------^----------------------    |     |\n                              |                          |     |\n                              |                    ------v-------\n                        ------v---------          |              |\n                       |                |         |  RFC Series  |\n                       |  RFC Publisher |<------->|    Editor    |\n                       |                |         |              |\n                        ----------------           --------------",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 11,
      "text": "Figure 1: Ordinary RFC Series production and process",
      "ja": "図1：通常のRFCシリーズの制作とプロセス"
    },
    {
      "indent": 3,
      "text": "In this model, documents are produced and approved through multiple document streams. The four that now exist are described in [1]. Documents from these streams are edited and processed by the Production Center and published by the Publisher. The RFC Series Editor will exercise executive-level management over many of the activities of the RFC Publisher and the RFC Production Center (which can be seen as back-office functions) and will be the entity that:",
      "ja": "このモデルでは、ドキュメントは複数のドキュメントストリームを通じて作成および承認されます。現在存在する4つは[1]で説明されています。これらのストリームからのドキュメントは、制作センターによって編集および処理され、出版社によって公開されます。RFCシリーズエディターは、RFC出版社とRFCプロダクションセンター（バックオフィス機能と見なすことができる）の多くの活動に対してエグゼクティブレベルの管理を行使し、次のエンティティになります。"
    },
    {
      "indent": 3,
      "text": "o Faces the community.",
      "ja": "o コミュニティに直面しています。"
    },
    {
      "indent": 3,
      "text": "o Works with the IAOC for contractual responsibilities.",
      "ja": "o 契約上の責任についてIAOCと連携します。"
    },
    {
      "indent": 3,
      "text": "o In collaboration with the RFC Series Advisory Group (RSAG), identifies and leads community discussion of important issues and opportunities facing the RFC Series.",
      "ja": "o RFCシリーズアドバイザリーグループ（RSAG）と協力して、RFCシリーズが直面している重要な問題と機会のコミュニティディスカッションを特定してリードしています。"
    },
    {
      "indent": 3,
      "text": "while the IAB and IAOC maintain their chartered responsibility. More details about the collaboration with the RSAG and the IAB responsibilities can be found in Section 4.1.",
      "ja": "IABとIAOCは、チャーターされた責任を維持しています。RSAGとIABの責任とのコラボレーションの詳細については、セクション4.1をご覧ください。"
    },
    {
      "indent": 3,
      "text": "The RSE does not have the authority to hire or fire RFC Editor contractors or personnel (see Section 4.1.3).",
      "ja": "RSEには、RFCエディターの請負業者または担当者を雇ったり解雇したりする権限はありません（セクション4.1.3を参照）。"
    },
    {
      "indent": 0,
      "text": "3.1. RFC Series Editor",
      "section_title": true,
      "ja": "3.1. RFCシリーズエディター"
    },
    {
      "indent": 3,
      "text": "The RFC Series Editor is an individual who may have assistants and who will regularly be provided support from an advisory group (see Section 4.1). The RSE is responsible for:",
      "ja": "RFCシリーズエディターは、アシスタントを持ち、アドバイザリーグループから定期的にサポートを提供する個人です（セクション4.1を参照）。RSEは次の責任を負います。"
    },
    {
      "indent": 3,
      "text": "1. Identifying appropriate steps for RFC Series continuity;",
      "ja": "1. RFCシリーズの継続性の適切な手順を特定します。"
    },
    {
      "indent": 3,
      "text": "2. Exercising executive-level management over the implementation of policies, processes, and procedures established to ensure the quality and consistency for the RFC Series. The RFC Series Editor will work with the RSAG, and, where appropriate, the IAB and IAOC to develop new policy and see that contractual agreements are met;",
      "ja": "2. RFCシリーズの品質と一貫性を確保するために確立されたポリシー、プロセス、および手順の実装をめぐるエグゼクティブレベルの管理を行使します。RFCシリーズエディターはRSAGと連携し、必要に応じてIABとIAOCが新しいポリシーを作成し、契約上の契約が満たされていることを確認します。"
    },
    {
      "indent": 3,
      "text": "3. Taking proposed changes to the community, and working with the IAB so that the IAB can ensure that there is sufficient community review before significant policies or policy changes are adopted;",
      "ja": "3. コミュニティに提案された変更を行い、IABと協力して、IABが重要なポリシーまたはポリシーの変更が採用される前に十分なコミュニティレビューがあることを保証できるようにします。"
    },
    {
      "indent": 3,
      "text": "4. Coordinating with the IAB and/or IAOC and, together with the IAB and/or IAOC, participating in reviews of the RFC Publisher, RFC Production Center, and Independent Submission Editor functions to ensure the above-mentioned continuity;",
      "ja": "4. IABおよび/またはIAOCと調整し、IABおよび/またはIAOCとともに、RFCパブリッシャー、RFCプロダクションセンター、および独立した提出エディター機能のレビューに参加して、上記の継続性を確保します。"
    },
    {
      "indent": 3,
      "text": "5. Developing, maintaining, and publishing the RFC Style Manual for use by authors, editors, the stream managers, the RFC Production Center, and the RFC Publisher;",
      "ja": "5. 著者、編集者、ストリームマネージャー、RFCプロダクションセンター、RFC出版社が使用するためのRFCスタイルマニュアルの開発、維持、公開。"
    },
    {
      "indent": 3,
      "text": "6. Managing the RFC errata process;",
      "ja": "6. RFC Errataプロセスの管理。"
    },
    {
      "indent": 3,
      "text": "7. Liaising with the IAB;",
      "ja": "7. IABとの連絡;"
    },
    {
      "indent": 3,
      "text": "8. Overseeing consistency of RFCs with the RFC Series and RFC Style Manual.",
      "ja": "8. RFCシリーズおよびRFCスタイルマニュアルを使用したRFCの一貫性を監督します。"
    },
    {
      "indent": 3,
      "text": "There are many potential issues with respect to RFC Series continuity. To name a few: look and feel of the series, indexing methodologies, accessibility of the publications, IPR and copyright issues, and formatting issues. After identifying the appropriate steps to address such issues, the implementation of those steps resides mostly with the RFC production and publishing functions. Since the IAOC maintains oversight of the implementation, the RFC Series Editor is expected to be invited and to participate in reviews of that implementation.",
      "ja": "RFCシリーズの連続性に関しては、多くの潜在的な問題があります。いくつかの名前をつけるには、シリーズのルックアンドフィール、インデックス作成方法論、出版物のアクセシビリティ、IPRおよび著作権の問題、およびフォーマットの問題。そのような問題に対処するための適切な手順を特定した後、これらの手順の実装は、主にRFCの生産および公開機能にあります。IAOCは実装の監視を維持しているため、RFCシリーズエディターが招待され、その実装のレビューに参加することが期待されています。"
    },
    {
      "indent": 3,
      "text": "The RFC Series Editor is a senior technology professional with the following qualifications:",
      "ja": "RFCシリーズエディターは、次の資格を持つシニアテクノロジーの専門家です。"
    },
    {
      "indent": 3,
      "text": "1. Strong understanding of the IETF and RFC process.",
      "ja": "1. IETFおよびRFCプロセスの強力な理解。"
    },
    {
      "indent": 3,
      "text": "2. Executive management experience suitable to managing the requirements outlined elsewhere in this document and the many aspects of this role, and to coordinating the overall RFC Editor process.",
      "ja": "2. このドキュメントの他の場所で概説されている要件と、この役割の多くの側面を管理し、RFCエディター全体のプロセス全体の調整に適した経営管理の経験。"
    },
    {
      "indent": 3,
      "text": "3. Good understanding of the English language and technical terminology related to the Internet.",
      "ja": "3. インターネットに関連する英語と技術用語のよく理解。"
    },
    {
      "indent": 3,
      "text": "4. Good communication skills.",
      "ja": "4. よいコミュニケーション力。"
    },
    {
      "indent": 3,
      "text": "5. Experience with editorial processes.",
      "ja": "5. 編集プロセスの経験。"
    },
    {
      "indent": 3,
      "text": "6. Independent worker.",
      "ja": "6. 独立した労働者。"
    },
    {
      "indent": 3,
      "text": "7. Experience as an RFC author desired.",
      "ja": "7. RFCの著者としての経験が望ましい。"
    },
    {
      "indent": 3,
      "text": "There are alternative selection methods for selecting the individual to serve as the RFC Series Editor:",
      "ja": "RFCシリーズエディターとして機能する個人を選択するための代替選択方法があります。"
    },
    {
      "indent": 3,
      "text": "The first alternative involves a Request for Proposal (RFP) process run by the IAOC. The IAOC would seek a person with the listed qualifications in a broadly distributed RFP. The winner would be selected by the IAOC in consultation with the IAB, and then, the IAOC would contract for the services. Contract terms, including length of contract, extensions, and renewals, shall be as provided in the RFP. The opportunity to bid shall be broadly available. Fees and expenses to support the administrative operation of the RFC Series Editor would be part of the awarded contract and be part of the IASA budget.",
      "ja": "最初の代替案には、IAOCが実行する提案（RFP）プロセスの要求が含まれます。IAOCは、広く分散されたRFPでリストされた資格を持つ人を探します。勝者はIAOCによってIABと相談して選択され、その後、IAOCはサービスと契約します。契約期間、延長、更新を含む契約条件は、RFPで提供されているとおりです。入札する機会は広く利用可能です。RFCシリーズエディターの管理運営をサポートするための料金と費用は、授与された契約の一部であり、IASA予算の一部となります。"
    },
    {
      "indent": 3,
      "text": "The second alternative involves a nomination and confirmation process. Candidates are nominated, and then an individual with the listed qualifications is selected by the Internet community and confirmed by the IAB. An approach similar to the one used by the IAB to select an IAOC member every other year (as described in Appendix A) will be used. Once the selection is made, a contract will be negotiated between the person selected and the IAOC, following the general model above. Financial compensation and expenses to support the administrative operation of the RFC Series Editor selected in this manner would be part of the IASA budget.",
      "ja": "2番目の代替案には、指名と確認プロセスが含まれます。候補者は指名され、その後、リストされた資格を持つ個人がインターネットコミュニティによって選択され、IABによって確認されます。IABが使用するアプローチと同様のアプローチは、IAOCメンバーを隔年（付録Aで説明する）を選択するために使用されます。選択が行われると、上記の一般的なモデルに従って、選択された人とIAOCの間で契約が交渉されます。この方法で選択されたRFCシリーズエディターの管理運営をサポートするための財務報酬と費用は、IASA予算の一部です。"
    },
    {
      "indent": 3,
      "text": "Based on an Request for Information (RFI) issued by the IAOC in December 2008, the IAOC recommended that the second alternative is chosen for the selection cycle to be completed in 2009.",
      "ja": "2008年12月にIAOCによって発行された情報（RFI）のリクエストに基づいて、IAOCは、2009年に選択サイクルが完了する2番目の代替案が選択されることを推奨しました。"
    },
    {
      "indent": 0,
      "text": "3.2. Independent Submission Editor",
      "section_title": true,
      "ja": "3.2. 独立した提出エディター"
    },
    {
      "indent": 3,
      "text": "The Independent Submission Editor is an individual who may have assistants and who is responsible for:",
      "ja": "独立した提出エディターは、アシスタントを持っていて、責任を負う可能性のある個人です。"
    },
    {
      "indent": 3,
      "text": "1. Maintaining technical quality of the Independent Submission stream.",
      "ja": "1. 独立した提出ストリームの技術的品質を維持します。"
    },
    {
      "indent": 3,
      "text": "2. Reviewing, approving, and processing Independent Submissions.",
      "ja": "2. 独立した提出物のレビュー、承認、および処理。"
    },
    {
      "indent": 3,
      "text": "3. Forwarding to the Production Center the Internet-Drafts that have been accepted for publication as RFCs in the Independent Submission Stream.",
      "ja": "3. 生産センターへの転送は、独立した提出ストリームでRFCSとして公開されているために受け入れられたインターネットドラフト。"
    },
    {
      "indent": 3,
      "text": "4. Reviewing and approving RFC errata in Independent Submissions.",
      "ja": "4. 独立した提出でRFC Errataのレビューと承認。"
    },
    {
      "indent": 3,
      "text": "5. Coordinating work and conforming to general RFC Series policies as specified by the IAB and RSE.",
      "ja": "5. IABおよびRSEによって指定されているように、作業の調整と一般的なRFCシリーズポリシーへの適合。"
    },
    {
      "indent": 3,
      "text": "6. Providing statistics and documentation as requested by the RSE and/or IAOC.",
      "ja": "6. RSEおよび/またはIAOCの要求に従って統計とドキュメントを提供します。"
    },
    {
      "indent": 3,
      "text": "The Independent Submission Editor is a senior position for which the following qualifications are desired: 1. Technical competence, i.e., broad technical experience and perspective across the whole range of Internet technologies and applications, and specifically, the ability to work effectively with portions of that spectrum in which no personal expertise exists.",
      "ja": "独立した提出エディターは、次の資格が必要な上級職です。1。技術的な能力、つまり、インターネットテクノロジーとアプリケーションの全範囲にわたる幅広い技術的経験と視点、特にその一部と効果的に作業する能力個人的な専門知識が存在しないスペクトル。"
    },
    {
      "indent": 3,
      "text": "2. Thorough familiarity with the RFC series.",
      "ja": "2. RFCシリーズに徹底的に精通しています。"
    },
    {
      "indent": 3,
      "text": "3. An ability to define and constitute advisory and document review arrangements. If those arrangements include an Editorial Board similar to the current one or some equivalent arrangement, assess the technical competence of potential Editorial Board members.",
      "ja": "3. アドバイザリーと文書のレビューの取り決めを定義および構成する機能。これらの取り決めには、現在の1つまたは同等の取り決めに類似した編集委員会が含まれている場合は、潜在的な編集委員会メンバーの技術的能力を評価します。"
    },
    {
      "indent": 3,
      "text": "4. Good standing in the technical community, in and beyond the IETF.",
      "ja": "4. IETF内外の技術コミュニティにおける良好な地位。"
    },
    {
      "indent": 3,
      "text": "5. Demonstrated editorial skills, good command of the English language, and demonstrated history of being able to work effectively with technical documents and materials created by others.",
      "ja": "5. 実証された編集スキル、英語の適切な指揮、および他者が作成した技術文書や資料で効果的に協力できるという歴史を実証しました。"
    },
    {
      "indent": 3,
      "text": "6. The ability to work effectively in a multi-actor environment with divided authority and responsibility similar to that described in this document.",
      "ja": "6. この文書に記載されているものと同様の権限と責任が分割されている多芽環境で効果的に作業する能力。"
    },
    {
      "indent": 3,
      "text": "The Independent Submission Editor may seek support from an advisory board (see Section 4.2) and may form a team to perform the activities needed to fulfill their responsibilities.",
      "ja": "独立した提出編集者は、諮問委員会からサポートを求め（セクション4.2を参照）、責任を果たすために必要な活動を実行するためにチームを形成することができます。"
    },
    {
      "indent": 3,
      "text": "The individual with the listed qualifications will be selected by the IAB after input is collected from the community. An approach similar to the one used by the IAB to select an IAOC member every other year (as described in Appendix A) should be used. While the ISE itself is considered a volunteer function, the IAB considers maintaining the Independent Submission stream within the RFC Series part of the IAB's supported activities, and will include the expenses made for the support of the ISE in its IASA-supported budget.",
      "ja": "リストされた資格を持つ個人は、コミュニティから入力が収集された後、IABによって選択されます。IABが使用するアプローチと同様のアプローチは、IAOCメンバーを隔年（付録Aで説明する）を選択するために使用する必要があります。ISE自体はボランティア機能と見なされますが、IABはIABのサポートされている活動のRFCシリーズの一部内で独立した提出ストリームを維持することを検討しており、ISEがサポートする予算でISEのサポートのために作られた費用が含まれます。"
    },
    {
      "indent": 0,
      "text": "3.3. RFC Production Center",
      "section_title": true,
      "ja": "3.3. RFC生産センター"
    },
    {
      "indent": 3,
      "text": "RFC Production is performed by a paid contractor, and the contractor responsibilities include:",
      "ja": "RFCの生産は有料請負業者によって行われ、請負業者の責任には以下が含まれます。"
    },
    {
      "indent": 3,
      "text": "1. Editing inputs from all RFC streams to comply with the RFC Style Manual;",
      "ja": "1. すべてのRFCストリームからの入力を編集して、RFCスタイルマニュアルに準拠しています。"
    },
    {
      "indent": 3,
      "text": "2. Creating records of edits performed on documents;",
      "ja": "2. ドキュメントで実行された編集のレコードを作成します。"
    },
    {
      "indent": 3,
      "text": "3. Identifying where editorial changes might have technical impact and seeking necessary clarification;",
      "ja": "3. 編集上の変更が技術的な影響を与える可能性があることを特定し、必要な明確化を求めます。"
    },
    {
      "indent": 3,
      "text": "4. Engaging in dialogue with authors, document shepherds, IANA, and/or stream-dependent contacts when clarification is needed;",
      "ja": "4. 著者との対話に従事し、説明が必要な場合に羊飼い、IANA、および/または河川依存の連絡先を文書化します。"
    },
    {
      "indent": 3,
      "text": "5. Creating records of dialogue with document authors;",
      "ja": "5. 文書著者との対話の記録を作成する。"
    },
    {
      "indent": 3,
      "text": "6. Requesting advice from the RFC Series Editor as needed;",
      "ja": "6. 必要に応じて、RFCシリーズエディターからアドバイスを要求します。"
    },
    {
      "indent": 3,
      "text": "7. Providing suggestions to the RFC Series Editor as needed;",
      "ja": "7. 必要に応じて、RFCシリーズエディターに提案を提供します。"
    },
    {
      "indent": 3,
      "text": "8. Coordinating with IANA to perform protocol parameter registry actions;",
      "ja": "8. IANAと調整して、プロトコルパラメーターレジストリアクションを実行します。"
    },
    {
      "indent": 3,
      "text": "9. Assigning RFC numbers;",
      "ja": "9. RFC番号の割り当て。"
    },
    {
      "indent": 3,
      "text": "10. Establishing publication readiness of each document through communication with the authors, document shepherds, IANA and/or stream-dependent contacts, and, if needed, with the RFC Series Editor;",
      "ja": "10. 著者との通信、文書羊飼い、IANAおよび/または河川依存の連絡先、および必要に応じてRFCシリーズエディターとの通信を通じて、各文書の出版物の準備を確立します。"
    },
    {
      "indent": 3,
      "text": "11. Forwarding ready-to-publish documents to the RFC Publisher;",
      "ja": "11. RFCパブリッシャーに、公開できるドキュメントをすぐに転送します。"
    },
    {
      "indent": 3,
      "text": "12. Forwarding records of edits and author dialogue to the RFC Publisher so these can be preserved;",
      "ja": "12. 編集の記録と著者の対話をRFC出版社に転送するため、これらを保存できます。"
    },
    {
      "indent": 3,
      "text": "13. Liaising with IESG and IAB.",
      "ja": "13. IESGとIABとの連絡。"
    },
    {
      "indent": 3,
      "text": "The RFC Production Center contractor is to be selected by the IAOC through an RFP process. The IAOC will seek a bidder who, among other things, is able to provide a professional, quality, timely, and cost-effective service against the established style and production guidelines. Contract terms, including length of contract, extensions and renewals, shall be as defined in an RFP. The opportunity to bid shall be broadly available.",
      "ja": "RFC生産センターの請負業者は、RFPプロセスを通じてIAOCによって選択されます。IAOCは、とりわけ、確立されたスタイルと制作ガイドラインに対して、専門的、品質、タイムリー、および費用対効果の高いサービスを提供できる入札者を探します。契約期間、延長、更新を含む契約条件は、RFPで定義されているものとするものとします。入札する機会は広く利用可能です。"
    },
    {
      "indent": 3,
      "text": "As described in Section 3.1, this model allows the IAOC to recommend the RSE position to be selected through an RFP process. In that case, the model also allows combining the RFC Production Center bid with the RSE bid. For 2009, the recommendation was made that the RSE is selected through an IAB-led selection process.",
      "ja": "セクション3.1で説明したように、このモデルにより、IAOCはRFPプロセスを通じてRSE位置を選択することを推奨できます。その場合、このモデルでは、RFC生産センターの入札とRSE入札を組み合わせることもできます。2009年には、IAB主導の選択プロセスを通じてRSEが選択されることが推奨されました。"
    },
    {
      "indent": 0,
      "text": "3.4. RFC Publisher",
      "section_title": true,
      "ja": "3.4. RFC出版社"
    },
    {
      "indent": 3,
      "text": "The RFC Publisher responsibilities include:",
      "ja": "RFC出版社の責任には次のものがあります。"
    },
    {
      "indent": 3,
      "text": "1. Announcing and providing on-line access to RFCs.",
      "ja": "1. RFCへのオンラインアクセスを発表して提供します。"
    },
    {
      "indent": 3,
      "text": "2. Providing on-line system to submit RFC Errata.",
      "ja": "2. RFC Errataを送信するためのオンラインシステムを提供します。"
    },
    {
      "indent": 3,
      "text": "3. Providing on-line access to approved RFC Errata.",
      "ja": "3. 承認されたRFC Errataへのオンラインアクセスを提供します。"
    },
    {
      "indent": 3,
      "text": "4. Providing backups.",
      "ja": "4. バックアップを提供します。"
    },
    {
      "indent": 3,
      "text": "5. Providing storage and preservation of records.",
      "ja": "5. 記録の保管と保存を提供します。"
    },
    {
      "indent": 3,
      "text": "6. Authenticating RFCs for legal proceedings.",
      "ja": "6. 法的手続きのためのRFCの認証。"
    },
    {
      "indent": 3,
      "text": "All these activities will be done under general supervision of the RSE and need some level of coordination with various submission streams and the RSE.",
      "ja": "これらのすべてのアクティビティは、RSEの一般的な監督の下で行われ、さまざまな提出ストリームとRSEとある程度の調整が必要です。"
    },
    {
      "indent": 3,
      "text": "Implementation of the RFC Publisher function can be pursued in two different ways. The choice between these alternatives will be based on an RFI issued by the IAOC in January 2009.",
      "ja": "RFCパブリッシャー機能の実装は、2つの異なる方法で追求できます。これらの選択肢の選択は、2009年1月にIAOCが発行したRFIに基づいています。"
    },
    {
      "indent": 3,
      "text": "The first alternative is to modify the IETF Secretariat contract to include these services. Expenses to support these services would be part of the revised contract.",
      "ja": "最初の選択肢は、これらのサービスを含めるためにIETF事務局の契約を変更することです。これらのサービスをサポートするための費用は、改訂された契約の一部です。"
    },
    {
      "indent": 3,
      "text": "The second alternative is a separate vendor selected by the IAOC through an RFP process, possibly as part of the same contract as the RFC Series Editor. Expenses to support these services would be part of the awarded contract.",
      "ja": "2番目の代替案は、RFCシリーズエディターと同じ契約の一部として、RFPプロセスを通じてIAOCによって選択された別のベンダーです。これらのサービスをサポートするための費用は、授与された契約の一部です。"
    },
    {
      "indent": 0,
      "text": "4. Committees",
      "section_title": true,
      "ja": "4. 委員会"
    },
    {
      "indent": 0,
      "text": "4.1. RFC Series Advisory Group (RSAG)",
      "section_title": true,
      "ja": "4.1. RFCシリーズアドバイザリーグループ（RSAG）"
    },
    {
      "indent": 0,
      "text": "4.1.1. Charter",
      "section_title": true,
      "ja": "4.1.1. チャーター"
    },
    {
      "indent": 3,
      "text": "The purpose of the RSAG is to provide expert, informed guidance (chiefly, to the RSE) in matters affecting the RFC Series operation and development. Such matters include, but are not limited to, issues in operation of the RFC model components, and consideration of additional RFC streams, to give a sense of the range of topics covered.",
      "ja": "RSAGの目的は、RFCシリーズの運用と開発に影響を与える問題について、専門家の情報に基づいたガイダンス（主にRSEに）を提供することです。このような問題には、RFCモデルコンポーネントの操作における問題、および追加のRFCストリームの検討には、カバーされているトピックの範囲の感覚が含まれます。"
    },
    {
      "indent": 3,
      "text": "The RSAG is chartered by the IAB. As such, it operates independently of the IAB to fulfill that charter, and provides periodic reports to the IAB via the RSE.",
      "ja": "RSAGはIABによってチャーターされています。そのため、IABとは独立してそのチャーターを満たすために動作し、RSEを介してIABに定期的なレポートを提供します。"
    },
    {
      "indent": 3,
      "text": "The group provides guidance to the RSE, who in turn addresses immediate operational issues or opportunities with the ISE, Production Center, or Publisher. In cases where these issues have contractual side-effects, the RSE provides guidance to the IETF Administrative Director (IAD). The RSAG also serves to provide advice to the RSE on longer-term, larger-scale developments for the RFC Series. This informs the proposals the RSE takes to the community for discussion, and the IAD/IAOC as proposals for implementation.",
      "ja": "このグループは、RSEにガイダンスを提供し、RSEはISE、生産センター、または出版社の即時の運用上の問題または機会に取り組んでいます。これらの問題に契約上の副作用がある場合、RSEはIETF管理ディレクター（IAD）にガイダンスを提供します。RSAGは、RFCシリーズの長期的で大規模な開発に関するRSEにアドバイスを提供するのにも役立ちます。これは、RSEが議論のためにコミュニティにとる提案を、実装の提案としてIAD/IAOCに通知します。"
    },
    {
      "indent": 3,
      "text": "The RSAG will assist the RSE in identifying and leading community discussion of important issues and opportunities facing the RFC Series. The IAB retains its oversight role and is responsible for ensuring that adequate community discussion has been held on any such significant topics.",
      "ja": "RSAGは、RFCシリーズが直面している重要な問題と機会のコミュニティディスカッションを特定し、リードするRSEを支援します。IABは監視の役割を維持し、このような重要なトピックについて適切なコミュニティディスカッションが開催されていることを確認する責任があります。"
    },
    {
      "indent": 0,
      "text": "4.1.2. Membership",
      "section_title": true,
      "ja": "4.1.2. メンバーシップ"
    },
    {
      "indent": 3,
      "text": "The RSAG full members are all at-large members, selected for their experience and interest in the RFC Series, to provide consistency and constancy of the RFC Series interpretation over time; the members do not represent a particular RFC stream or any organizations. In particular, there is no requirement or expectation that RSAG members will be IAB members. The RSAG members are proposed by the Series Editor in consultation with the sitting RSAG members, and then confirmed and formally appointed by the IAB. In addition to these full members, each RFC stream approver will appoint a liaison to the RSAG to provide context specific to their stream. The liaisons do not have to be members of the stream approval bodies. Initially, there will be no IAOC or IAB liaison for their oversight role; however, as experience is gained, the IAOC, IAB, or RSAG may request such liaisons.",
      "ja": "RSAGフルメンバーはすべて、RFCシリーズの経験と関心のために選択され、RFCシリーズの解釈の一貫性と恒常性を時間の経過とともに提供するために選択されています。メンバーは、特定のRFCストリームまたは組織を代表していません。特に、RSAGメンバーがIABメンバーになるという要件や期待はありません。RSAGメンバーは、シリーズエディターによってシッティングRSAGメンバーと相談され、IABによって確認され、正式に任命されます。これらのフルメンバーに加えて、各RFCストリーム承認者は、RSAGにリエゾンを任命し、ストリームに固有のコンテキストを提供します。リエゾンは、ストリーム承認団体のメンバーである必要はありません。当初、監視の役割についてはIAOCまたはIABリエゾンはありません。ただし、経験が得られると、IAOC、IAB、またはRSAGがそのようなリエゾンを要求する場合があります。"
    },
    {
      "indent": 3,
      "text": "The RSAG does not select or appoint the RSE, or any other component of the RFC Editor model, although it acts as an important resource for informing any selection process.",
      "ja": "RSAGは、RSEまたはRFCエディターモデルのその他のコンポーネントを選択または任命しませんが、選択プロセスを通知するための重要なリソースとして機能します。"
    },
    {
      "indent": 3,
      "text": "It is envisioned that the RSAG will be composed of appointed full members serving staggered 3 year terms, plus the RSE. The full members will serve at the pleasure of the IAB -- appointed by the IAB, and if necessary, removed by the IAB.",
      "ja": "RSAGは、3年間の任期に加えてRSEに加えて、任命されたフルメンバーで構成されることが想定されています。完全なメンバーはIABの喜びで奉仕します -  IABによって任命され、必要に応じてIABによって削除されます。"
    },
    {
      "indent": 3,
      "text": "In order to provide continuity and to assist with a smooth transition of the RFC Editor function, the members of the existing RFC Editor Editorial Board who are willing to do so are asked to serve as an interim RSAG, effective as of the time of approval of this document. Within one year from the time the RFC Editor function transitions to the new model and after consideration of the operation of the new model in practice, the interim RSAG and RSE will formulate recommendations to the IAB about this model, regarding the regular composition, size, and selection process for the permanent RSAG in particular.",
      "ja": "継続性を提供し、RFCエディター機能のスムーズな移行を支援するために、そうすることをいとわない既存のRFCエディターエディトリアルボードのメンバーは、承認時に有効な暫定RSAGとして機能するように求められます。このドキュメント。RFCエディター関数が新しいモデルに移行し、実際に新しいモデルの動作を検討した後、1年以内に、暫定RSAGとRSEは、通常の構成、サイズ、特に永続的なRSAGの選択プロセス。"
    },
    {
      "indent": 0,
      "text": "4.1.3. Disagreements among RFC Editor Entities",
      "section_title": true,
      "ja": "4.1.3. RFCエディターエンティティ間の意見の相違"
    },
    {
      "indent": 3,
      "text": "If during the execution of their activities, a disagreement arises over an implementation decision made by one of the entities in the model, any relevant party should first request a review and reconsideration of the decision. If that party still disagrees after the reconsideration, that party may ask the RSE to decide or, especially if the RSE is involved, that party may ask the IAB Chair (for a technical or procedural matter) or IAD (for an administrative or contractual one) to mediate or appoint a mediator to aid in the discussions, although neither is obligated to do so. All parties should work informally and in good faith to reach a mutually agreeable conclusion.",
      "ja": "彼らの活動の実行中に、モデル内のエンティティのいずれかが行った実装決定に対して意見の相違が生じた場合、関連する当事者は最初に決定のレビューと再考を要求する必要があります。その当事者が再検討後もまだ同意しない場合、その当事者はRSEに決定するように頼むことができます。特にRSEが関与している場合、その当事者はIAB議長（技術的または手続き上の問題の場合）またはIAD（管理または契約上の椅子）に尋ねることができます）議論を支援するために調停者を仲介または任命することも、どちらもそうする義務はありません。すべての当事者は、相互に快適な結論に達するために、非公式に、そして誠意を持って働くべきです。"
    },
    {
      "indent": 3,
      "text": "If such a conclusion is not possible through those informal processes, then the matter must be registered with the RFC Series Advisory Group. The RSAG may choose to offer advice to the RSE or more general advice to the parties involved and may ask the RSE to defer a decision until it formulates its advice. However, if a timely decision cannot be reached through discussion, mediation, and mutual agreement, the Series Editor is expected to make whatever decisions are needed to ensure the smooth functioning of the RFC Editor function; those decisions are final.",
      "ja": "これらの非公式プロセスを通じてそのような結論が不可能な場合、問題はRFCシリーズアドバイザリーグループに登録する必要があります。RSAGは、関係者にRSEまたはより一般的なアドバイスにアドバイスを提供することを選択し、RSEにアドバイスを策定するまで決定を延期するように依頼することができます。ただし、ディスカッション、調停、相互の合意を通じてタイムリーな決定に到達できない場合、シリーズエディターは、RFCエディター機能のスムーズな機能を確保するために必要な決定を行うことが期待されます。これらの決定は最終的なものです。"
    },
    {
      "indent": 3,
      "text": "RSE decisions of this type are limited to the functioning of the process and evaluation of whether current policies are appropriately implemented in the decision or need adjustment. In particular, it should be noted that final decisions about the technical content of individual documents are the exclusive responsibility of the stream approvers for those documents, as shown in the illustration in Figure 1.",
      "ja": "このタイプのRSE決定は、プロセスの機能と、現在のポリシーが決定に適切に実装されているか、調整が必要かの評価に限定されます。特に、図1の図に示すように、個々の文書の技術的内容に関する最終決定は、これらのドキュメントのストリーム承認者の排他的な責任であることに注意する必要があります。"
    },
    {
      "indent": 3,
      "text": "If a disagreement or decision has immediate or future contractual consequences, the Series Editor must identify the issue to the IAOC and, if the RSAG has provided advice, forward that advice as well.",
      "ja": "意見の相違または決定が即時または将来の契約上の結果をもたらす場合、シリーズエディターはIAOCに問題を特定する必要があり、RSAGがアドバイスを提供している場合、そのアドバイスも転送します。"
    },
    {
      "indent": 3,
      "text": "After the IAOC has notified the IAB, the IAD as guided by the IAOC, with advice provided by the Series Editor, has the responsibility to resolve these contractual issues.",
      "ja": "IAOCがIABに通知した後、IAOCのガイド付きIADは、シリーズエディターが提供するアドバイスを受けて、これらの契約上の問題を解決する責任を負います。"
    },
    {
      "indent": 3,
      "text": "If informal agreements cannot be reached and formal RSAG review and/or RSE or stream approver decisions are required, the RSE must identify the issues involved to the community and report them to the IAB in its oversight capacity. The RSE and IAB shall mutually develop a satisfactory mechanism for this type of reporting when and if it is necessary.",
      "ja": "非公式の契約に到達できず、正式なRSAGレビューおよび/またはRSEまたはストリーム承認の決定が必要な場合、RSEはコミュニティに関連する問題を特定し、監視能力でIABに報告する必要があります。RSEとIABは、このタイプのレポートが必要な場合に満足のいくメカニズムを相互に開発するものとします。"
    },
    {
      "indent": 3,
      "text": "IAB and community discussion of any patterns of disputes are expected to inform future changes to Series policies including possible updates to this document.",
      "ja": "IABと紛争パターンのコミュニティディスカッションは、このドキュメントの可能な更新を含む、シリーズポリシーの将来の変更を通知することが期待されています。"
    },
    {
      "indent": 0,
      "text": "4.2. Independent Submission Stream Editorial Board",
      "section_title": true,
      "ja": "4.2. 独立した提出ストリーム編集委員会"
    },
    {
      "indent": 3,
      "text": "Today the RFC Editor is supported by an Editorial Board for the review of Independent Submission stream documents. This board is expected to evolve in what we will call the Independent Submission Stream Editorial Board. This volunteer Editorial Board will exist at the pleasure of the ISE, and the members serve at the pleasure of the ISE. The existence of this board is simply noted within this model, and additional discussion of such is considered out of scope of this document.",
      "ja": "今日、RFCエディターは、独立した提出ストリーム文書のレビューのために編集委員会によってサポートされています。このボードは、独立した提出ストリーム編集委員会と呼ばれるもので進化することが期待されています。このボランティア編集委員会は、ISEの喜びに存在し、メンバーはISEの喜びに奉仕します。このボードの存在は、このモデル内で単純に注目されており、そのような追加の議論はこの文書の範囲外であると見なされます。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "ja": "5. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document defines several functions within the overall RFC Editor structure, and it places the responsibility for coordination of registry value assignments with the RFC Production Center. The IAOC will facilitate the establishment of the relationship between the RFC Production Center and IANA.",
      "ja": "このドキュメントでは、RFCエディター構造全体のいくつかの機能を定義し、RFC生産センターとレジストリ値割り当ての調整の責任を負います。IAOCは、RFC生産センターとIANAの関係の確立を促進します。"
    },
    {
      "indent": 3,
      "text": "This document does not create a new registry nor does it register any values in existing registries, and no IANA action is required.",
      "ja": "このドキュメントは、新しいレジストリを作成することはなく、既存のレジストリに値を登録することも、IANAアクションは必要ありません。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "The same security considerations as those in RFC 4844 apply. The processes for the publication of documents must prevent the introduction of unapproved changes. Since the RFC Editor maintains the index of publications, sufficient security must be in place to prevent these published documents from being changed by external parties. The archive of RFC documents, any source documents needed to recreate the RFC documents, and any associated original documents (such as lists of errata, tools, and, for some early items, non-machine-readable originals) need to be secured against failure of the storage medium and other similar disasters.",
      "ja": "RFC 4844のものと同じセキュリティ上の考慮事項が適用されます。ドキュメントを公開するプロセスは、承認されていない変更の導入を防ぐ必要があります。RFCエディターは出版物のインデックスを維持しているため、これらの公開されたドキュメントが外部関係者によって変更されるのを防ぐために十分なセキュリティを整える必要があります。RFCドキュメントのアーカイブ、RFCドキュメントを再作成するために必要なソースドキュメント、および関連する元のドキュメント（ERRATA、ツールのリスト、およびいくつかの初期項目の場合、マシンで読み取れないオリジナルなど）を失敗に対して保護する必要があります。ストレージ媒体およびその他の同様の災害の。"
    },
    {
      "indent": 3,
      "text": "The IAOC should take these security considerations into account during the implementation of this RFC Editor model.",
      "ja": "IAOCは、このRFCエディターモデルの実装中に、これらのセキュリティ上の考慮事項を考慮に入れる必要があります。"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgments",
      "section_title": true,
      "ja": "7. 謝辞"
    },
    {
      "indent": 3,
      "text": "The RFC Editor model was conceived and discussed in hallways and on mail lists. The first iteration of the text on which this document is based was drafted by Leslie Daigle, Russ Housley, and Ray Pelletier. In addition to the members of the IAOC and IAB in conjunction with those roles, major and minor contributions were made by (in alphabetical order): Bob Braden, Brian Carpenter, Sandy Ginoza, Alice Hagens, Joel M. Halpern, Alfred Hoenes, Paul Hoffman, John Klensin, Subramanian Moonesamy, and Jim Schaad.",
      "ja": "RFCエディターモデルは、廊下やメールリストで考案され、議論されました。このドキュメントが基づいているテキストの最初の反復は、レスリー・デイグル、ラス・ヒューズリー、レイ・ペレティエによって起草されました。IAOCとIABのメンバーに加えて、これらの役割と協力して、主要な貢献とマイナーな貢献は（アルファベット順に）行われました。Hoffman、John Klensin、Subramanian Moonesamy、およびJim Schaad。"
    },
    {
      "indent": 3,
      "text": "The IAOC members at the time the RFC Editor model was approved were (in alphabetical order): Fred Baker, Bob Hinden, Russ Housley, Ole Jacobsen, Ed Juskevicius, Olaf Kolkman, Ray Pelletier (non-voting), Lynn St. Amour, and Jonne Soininen. In addition, Marshall Eubanks was serving as the IAOC Scribe.",
      "ja": "RFCエディターモデルが承認されたときのIAOCメンバーは（アルファベット順に）承認されました：フレッドベイカー、ボブヒンデン、ラスハウズリー、オレヤコブセン、エドジュスケビシウス、オラフコルクマン、レイペレティエ（ノンボーティング）、リンセントアモール、ジョンヌ・ソイニネン。さらに、マーシャル・ユーバンクスはIAOC筆記者として働いていました。"
    },
    {
      "indent": 3,
      "text": "The IAB members at the time the initial RFC Editor model was approved were (in alphabetical order): Loa Andersson, Gonzalo Camarillo, Stuart Cheshire, Russ Housley, Olaf Kolkman, Gregory Lebovitz, Barry Leiba, Kurtis Lindqvist, Andrew Malis, Danny McPherson, David Oran, Dave Thaler, and Lixia Zhang. In addition, the IAB included two ex-officio members: Dow Street, who was serving as the IAB Executive Director, and Aaron Falk, who was serving as the IRTF Chair.",
      "ja": "最初のRFCエディターモデルが承認された時点でのIABメンバーは（アルファベット順に）承認されました：Loa Andersson、Gonzalo Camarillo、Stuart Cheshire、Russ Housley、Olaf Kolkman、Gregory Lebitz、Barry Leiba、Kurtis Lindqvist、Anderem Malis、Danny McPhersonデビッド・オラン、デイブ・ターラー、リクシア・チャン。さらに、IABには、IABのエグゼクティブディレクターを務めていたダウストリートと、IRTFチェアを務めるアーロンフォークの2人の元職員メンバーが含まれていました。"
    },
    {
      "indent": 3,
      "text": "The IAB members at the time the this RFC was approved were (in alphabetical order): Marcelo Bagnulo, Gonzalo Camarillo, Stuart Cheshire, Vijay Gill, Russ Housley, John Klensin, Olaf Kolkman, Gregory Lebovitz, Andrew Malis, Danny McPherson, David Oran, Jon Peterson, and Dave Thaler.",
      "ja": "このRFCが承認された当時のIABメンバーは（アルファベット順に）承認されていました：マルセロバグヌーロ、ゴンザロカマリロ、スチュアートチェシャー、ヴィジェイギル、ラシュハウズリー、ジョンクレンシン、オラフコルクマン、グレゴリーレボビッツ、アンドリューマリス、ダニーマクファーソン、デイビッド、ダニーマクファーソン、ダニーマクファーソン、ジョン・ピーターソンとデイブ・ターラー。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8. 参考文献"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "ja": "8.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[1] Daigle, L. and Internet Architecture Board, \"The RFC Series and RFC Editor\", RFC 4844, July 2007.",
      "ja": "[1] Daigle、L。およびInternet Architecture Board、「The RFC Series and RFC Editor」、RFC 4844、2007年7月。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "ja": "8.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[2] Huston, G. and B. Wijnen, \"The IETF Administrative Oversight Committee (IAOC) Member Selection Guidelines and Process\", BCP 113, RFC 4333, December 2005.",
      "ja": "[2] Huston、G。およびB. Wijnen、「IETF管理監視委員会（IAOC）メンバー選択ガイドラインとプロセス」、BCP 113、RFC 4333、2005年12月。"
    },
    {
      "indent": 0,
      "text": "Appendix A. 2009 Selection Process",
      "section_title": true,
      "ja": "付録A. 2009年の選択プロセス"
    },
    {
      "indent": 3,
      "text": "In 2009, the IAB is responsible for the selection of the RFC Series Editor and for the selection of the Independent Submission Editor. The IAOC selects the RFC Production Center and the RFC Publisher from vendors that choose to submit a proposal. The IAOC procurement process is not described in this document.",
      "ja": "2009年、IABはRFCシリーズエディターの選択と、独立した提出エディターの選択を担当しています。IAOCは、提案を提出することを選択したベンダーからRFC生産センターとRFC出版社を選択します。IAOC調達プロセスは、このドキュメントでは説明されていません。"
    },
    {
      "indent": 3,
      "text": "The selection process for the ISE and RSE is taken from [2] but modified to allow for subject-matter experts to advise the IAB, to take into account that the community with interest in the RFC series extends beyond the IETF community.",
      "ja": "ISEとRSEの選択プロセスは[2]から取得されますが、主題の専門家がIABにアドバイスするように変更され、RFCシリーズに関心を持つコミュニティがIETFコミュニティを超えて拡張されることを考慮します。"
    },
    {
      "indent": 0,
      "text": "A.1. Ad Hoc Advisory Committee(s)",
      "section_title": true,
      "ja": "A.1. アドホックアドバイザリー委員会"
    },
    {
      "indent": 3,
      "text": "It is expected that the IAB and IAOC will, during the various stages of the bidding process, establish one or more ad hoc advisory committees to assist them in the selection of the various functions. The names of the members of the committees, who do not need to be IAB members or IETF participants, will be made public through the IAB and IAOC minutes and possibly other mechanisms as well.",
      "ja": "IABとIAOCは、入札プロセスのさまざまな段階で、さまざまな機能の選択を支援するために、1つ以上のアドホックアドバイザリー委員会を設立することが期待されています。IABメンバーやIETF参加者である必要はない委員会のメンバーの名前は、IABおよびIAOCの議事録、および場合によっては他のメカニズムを通じて公開されます。"
    },
    {
      "indent": 3,
      "text": "Members of these committees are expected to have an understanding of the RFC series and related processes, and of procedures and interests of the various streams.",
      "ja": "これらの委員会のメンバーは、RFCシリーズと関連プロセス、およびさまざまなストリームの手順と関心を理解することが期待されています。"
    },
    {
      "indent": 3,
      "text": "Members of the subcommittees will be privy to confidential material and are expected to honor confidentiality. Because they are subject to confidential material, they are recused from bidding on any of the functions for which financial compensation is offered.",
      "ja": "小委員会のメンバーは、機密資料を知ることであり、機密性を尊重することが期待されています。彼らは機密資料の対象となるため、金融補償が提供される機能のいずれかについての入札を拒否されます。"
    },
    {
      "indent": 3,
      "text": "The IAB and IAOC bear the responsibility for the selections of the candidates for defined functions. The committees provide advice and recommendations but are not expected to act as nomination or selection committees.",
      "ja": "IABとIAOCは、定義された機能の候補者の選択に対する責任を負います。委員会はアドバイスと勧告を提供しますが、指名委員会または選択委員会として行動することは期待されていません。"
    },
    {
      "indent": 0,
      "text": "A.2. The IAB Selection Process of an RFC Series Editor and/or an Independent Submission Editor",
      "section_title": true,
      "ja": "A.2. RFCシリーズエディターおよび/または独立した提出エディターのIAB選択プロセス"
    },
    {
      "indent": 0,
      "text": "A.2.1. Nominations and Eligibility",
      "section_title": true,
      "ja": "A.2.1. 指名と適格性"
    },
    {
      "indent": 3,
      "text": "The IAB will be making a broad public call for nominations. The public call will specify the manner by which nominations will be accepted and the means by which the list of nominees will be published. Self-nominations are permitted. Along with the name and contact information for each candidate, details about the candidate's background and qualifications for the position should be attached to the nomination.",
      "ja": "IABは、ノミネートを幅広く公開する予定です。パブリックコールは、ノミネートが受け入れられる方法と、候補者のリストが公開される手段を指定します。自己ノミネーションが許可されています。各候補者の名前と連絡先情報に加えて、候補者の経歴に関する詳細とそのポジションの資格を指名に添付する必要があります。"
    },
    {
      "indent": 3,
      "text": "People that served on the ad-hoc advisory committee(s) mentioned above are not eligible. There are no further limitations. Specifically, nominees do not have to be actively contributing to the IETF and active participation as a working group chair, an IETF Nominating Committee member, or an IAB or IESG member is not a limitation.",
      "ja": "上記のアドホックアドバイザリー委員会に参加した人々は資格がありません。それ以上の制限はありません。具体的には、候補者は、ワーキンググループの議長、IETF指名委員会メンバー、またはIABまたはIESGメンバーとしてのIETFと積極的な参加に積極的に貢献する必要はありません。"
    },
    {
      "indent": 3,
      "text": "IAB members who accept a nomination for an IAB-selected position will recuse themselves from IAB selection discussions.",
      "ja": "IABが選択したポジションの指名を受け入れるIABメンバーは、IABの選択ディスカッションから自分自身を拒否します。"
    },
    {
      "indent": 0,
      "text": "A.2.2. Committees in 2009",
      "section_title": true,
      "ja": "A.2.2. 2009年の委員会"
    },
    {
      "indent": 3,
      "text": "During the 2009 selection process, a committee assisted the IAOC/IAB in creating the job descriptions and statements of work. This committee may also assist in assessing the bids made to the IAOC for the Production Center and the RFC Publisher. Another committee, the Ad Hoc Committee for Selection of Editorial Functions, assists the IAB in the assessment of the RFC Series Editor and the Independent Submission Editor candidates.",
      "ja": "2009年の選択プロセス中に、委員会はIAOC/IABの仕事の説明と作業声明の作成を支援しました。また、この委員会は、生産センターとRFC出版社のIAOCへの入札の評価を支援する場合があります。別の委員会である編集機能の選択のためのアドホック委員会は、RFCシリーズ編集者と独立した提出編集者候補者の評価においてIABを支援します。"
    },
    {
      "indent": 0,
      "text": "A.2.3. Selection",
      "section_title": true,
      "ja": "A.2.3. 選択"
    },
    {
      "indent": 3,
      "text": "The IAB will publish the list of nominated persons prior to making a decision, allowing time for the community to pass any relevant comments to the IAB. When established, the advisory committee will be asked to provide a motivated shortlist. The IAB will review the nomination material, any submitted comments, the shortlist from the advisory committee, and make its selection.",
      "ja": "IABは、決定を下す前に指名された人のリストを公開し、コミュニティが関連するコメントをIABに渡す時間を確保します。設立された場合、諮問委員会はやる気のある候補者リストを提供するよう求められます。IABは、指名資料、提出されたコメント、諮問委員会の最終候補者を確認し、その選択を行います。"
    },
    {
      "indent": 3,
      "text": "It is noted that the community mentioned above is the community with an interest in RFCs and the RFC Editor's functioning; the IETF community is only a part of that community.",
      "ja": "上記のコミュニティは、RFCSとRFCエディターの機能に関心のあるコミュニティであることに注意してください。IETFコミュニティは、そのコミュニティの一部にすぎません。"
    },
    {
      "indent": 3,
      "text": "The main intent is to select the superior candidate, taking the continuity of the series into account.",
      "ja": "主な意図は、シリーズの連続性を考慮に入れて、優れた候補を選択することです。"
    },
    {
      "indent": 0,
      "text": "A.2.4. Care of Personal Information",
      "section_title": true,
      "ja": "A.2.4. 個人情報のケア"
    },
    {
      "indent": 3,
      "text": "The following procedures will be used by the IAB in managing candidates' personal information:",
      "ja": "次の手順は、候補者の個人情報の管理においてIABによって使用されます。"
    },
    {
      "indent": 3,
      "text": "o The candidate's name will be published, with all other candidate names, at the close of the nominations period.",
      "ja": "o 候補者の名前は、ノミネート期間の終了時に、他のすべての候補者名とともに公開されます。"
    },
    {
      "indent": 3,
      "text": "o Except as noted above, all information provided to the IAB during this process will be kept as confidential to the IAB and, when established, the advisory committee.",
      "ja": "o 上記の場合を除き、このプロセス中にIABに提供されたすべての情報は、IABおよび設立された場合、諮問委員会の機密として保持されます。"
    },
    {
      "indent": 0,
      "text": "A.2.5. Term of Office and Selection Time Frame",
      "section_title": true,
      "ja": "A.2.5. 任期および選択期間"
    },
    {
      "indent": 3,
      "text": "Subject to further negotiations and in the interest of providing stability, terms of office are expected to be five years with no restrictions on renewals and with provision for shorter actual contracts and intermediate reviews. In addition, an effort should be made so that terms of office for the RSE, ISE, and RFC Production Center do not terminate concurrently.",
      "ja": "さらなる交渉と安定性を提供するために、職務条件は5年になると予想されます。更新の制限はなく、実際の契約と中級レビューの短い規定があります。さらに、RSE、ISE、およびRFCの生産センターの任期が同時に終了しないように、努力を払う必要があります。"
    },
    {
      "indent": 3,
      "text": "The selection timeframe for 2009 is roughly:",
      "ja": "2009年の選択時間枠はおおよそ次のとおりです。"
    },
    {
      "indent": 6,
      "text": "June - IAB calls for nominations for ISE and RSE positions;",
      "ja": "6月-IABは、ISEおよびRSEポジションの指名を求めています。"
    },
    {
      "indent": 6,
      "text": "July - A Committee conducts interviews;",
      "ja": "7月 - 委員会がインタビューを実施します。"
    },
    {
      "indent": 6,
      "text": "Mid-August - Committee recommends individuals to IAB for ISE and RSE positions;",
      "ja": "8月中旬 - 委員会は、ISEおよびRSEポジションのために個人をIABに推奨しています。"
    },
    {
      "indent": 6,
      "text": "Second half of September - IAB appoints ISE and RSE, subject to successful negotiations of agreement with IAOC;",
      "ja": "9月後半-IABはISEとRSEを任命し、IAOCとの合意の交渉が成功する場合。"
    },
    {
      "indent": 6,
      "text": "Mid-October - Memorandums of understanding (MOUs) executed with IAD, ISE for expenses, RSE for stipend and expenses;",
      "ja": "10月中旬 -  IADで実行された理解の覚書（MOU）、ISEは費用のために、RSEは奨学金と費用のために実行されます。"
    },
    {
      "indent": 6,
      "text": "Mid-October - Transition begins;",
      "ja": "10月中旬 - 移行が始まります。"
    },
    {
      "indent": 6,
      "text": "January 2010 - Contract begins.",
      "ja": "2010年1月 - 契約が始まります。"
    },
    {
      "indent": 3,
      "text": "The timeline for future selections is subject to recommendation from the RSAG and review by the IAB.",
      "ja": "将来の選択のタイムラインは、IABによるRSAGからの推奨事項の対象となります。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Olaf M. Kolkman (editor)",
      "ja": "Olaf M. Kolkman（編集者）"
    },
    {
      "indent": 3,
      "text": "EMail: olaf@nlnetlabs.nl",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Internet Architecture Board",
      "ja": "インターネットアーキテクチャボード"
    },
    {
      "indent": 3,
      "text": "EMail: iab@iab.org",
      "raw": true,
      "ja": ""
    }
  ]
}