{
  "title": {
    "text": "RFC 5398 - Autonomous System (AS) Number Reservation for Documentation Use",
    "ja": "RFC 5398 - ドキュメントの使用のための自律システム（AS）番号予約"
  },
  "number": 5398,
  "created_at": "2019-10-27 09:14:40.367342+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                          G. Huston\nRequest for Comments: 5398                                 December 2008\nCategory: Informational",
      "raw": true
    },
    {
      "indent": 4,
      "text": "Autonomous System (AS) Number Reservation for Documentation Use",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモはインターネットコミュニティのための情報を提供します。それはどんな種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2008 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2008 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/ license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/ライセンス情報）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "To reduce the likelihood of conflict and confusion when relating documented examples to deployed systems, two blocks of Autonomous System numbers (ASNs) are reserved for use in examples in RFCs, books, documentation, and the like. This document describes the reservation of two blocks of ASNs as reserved numbers for use in documentation.",
      "ja": "紛争と展開システムへの文書例に関連する混同の可能性を減らすために、自律システム番号（ASNを）の二つのブロックは、RFCに、書籍、文書、などの例で使用するために予約されています。このドキュメントは、ドキュメントで使用するために予約番号などのASNの2つのブロックの予約を説明しています。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "To reduce the likelihood of conflict and confusion when relating documented examples to deployed systems, two blocks of Autonomous System numbers (ASNs) are reserved for use in examples in RFCs, books, documentation, and the like. This document describes the reservation of two blocks of ASNs as reserved numbers for use in documentation.",
      "ja": "紛争と展開システムへの文書例に関連する混同の可能性を減らすために、自律システム番号（ASNを）の二つのブロックは、RFCに、書籍、文書、などの例で使用するために予約されています。このドキュメントは、ドキュメントで使用するために予約番号などのASNの2つのブロックの予約を説明しています。"
    },
    {
      "indent": 3,
      "text": "The problems such conflicts may cause have already been encountered with IPv4 addresses where literal use of documented examples in a production environment causes address and routing conflicts with existing services. Since private-use ASNs already have a context of use in deployed networks, these ASNs cannot be used in many example situations. In making an explicit allocation of a set of AS numbers reserved for documentation use, it is intended that any such operational problems may be avoided in the future.",
      "ja": "このような競合が発生することがあり問題は、すでに本番環境での文書化例の文字通りの使用は、既存のサービスとのアドレスとルーティングのコンフリクトを起こしIPv4アドレスと遭遇しています。私的使用のAS番号が既に展開されたネットワークでの使用のコンテキストを持っているので、これらのASNは、多くの例の状況で使用することはできません。ドキュメントの使用のために予約AS番号のセットの明示的な割り当てを行うには、そのような操作上の問題が将来的に回避することができることが意図されています。"
    },
    {
      "indent": 3,
      "text": "Similar considerations have been applied to IPv4 addresses [IANA.IPv4], IPv6 addresses [RFC3849], and domain names [RFC2606], and reservations have been made for similar purposes.",
      "ja": "同様の考察は、IPv4に適用されている[IANA.IPv4]、IPv6アドレス[RFC3849]、およびドメイン名[RFC2606]を対処し、そして予約は同様の目的のために行われています。"
    },
    {
      "indent": 0,
      "text": "2. ASNs for Documentation Use",
      "section_title": true,
      "ja": "ドキュメントの使用のための2のASN"
    },
    {
      "indent": 3,
      "text": "To allow documentation to accurately describe deployment examples, the use of public or private-use AS numbers is inappropriate, and a reserved block of AS numbers is required. This ensures that documentation does not clash with public- or private-use AS numbers in deployed networks, and mitigates the risks to operational integrity of the network through inappropriate use of documentation to perform literal configuration of routing elements on production systems.",
      "ja": "ドキュメントが正確に展開例を記述できるようにするには、AS番号のパブリックまたはプライベート利用の使用が不適切である、とAS番号の予約ブロックが必要です。これは、ドキュメントが展開されたネットワークにおけるAS番号公的または私的利用と衝突しないことを保証し、生産システム上のルーティング要素のリテラルのコンフィギュレーションを実行するために文書の不適切な使用を介してネットワークの動作の完全性へのリスクを軽減します。"
    },
    {
      "indent": 3,
      "text": "To allow for examples relating to the transition to use of 32-bit AS numbers to be correctly described, a reservation of two blocks of AS numbers is proposed in this document. One reserved block of 16 contiguous AS numbers is to lie in the range of numbers that can be expressed as a 16-bit AS number value (i.e., values less than 65536), and a second reserved block of 16 contiguous AS numbers is to lie in the range of numbers that can only be expressed as 32-bit AS numbers (values greater than 65535).",
      "ja": "数字を正しく説明するように、32ビットの使用に遷移に関する実施例を可能にするために、AS番号の2つのブロックの予約は、この文書で提案されています。 AS番号16回の連続の一個の予約ブロック（すなわち、65536未満の値）数値として16ビットとして表すことができる数値の範囲にあることであり、AS番号16回の連続の第二の予備ブロックは嘘であります唯一のAS番号32ビットとして表すことができる数の範囲内（65535を超える値）。"
    },
    {
      "indent": 0,
      "text": "3. Operational Implications",
      "section_title": true,
      "ja": "3.運用影響"
    },
    {
      "indent": 3,
      "text": "This assignment implies that BGP operational configurations should not peer with neighboring ASes that are numbered from this reserved AS number set.",
      "ja": "この割り当ては、BGPの動作構成は数セットとしてリザーブから番号付けされている隣接のASとピアはならないことを意味します。"
    },
    {
      "indent": 0,
      "text": "4. IANA Considerations",
      "section_title": true,
      "ja": "4. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has reserved a contiguous block of 16 Autonomous System numbers from the unallocated number range within the \"16-bit\" number set for documentation purposes, namely 64496 - 64511, and a contiguous block of 16 Autonomous System numbers from the \"32-bit\" number set for documentation, namely 65536 - 65551. These reservations have been documented in the IANA AS Number Registry [IANA.AS].",
      "ja": "64511、および「32ビット」から16の自律システム番号の連続したブロック -  IANAは、文書化目的のために設定された「16ビット」数、すなわち64496内の未割り当ての番号範囲から16の自律システム番号の連続したブロックを予約しましたドキュメントに設定された数は、すなわち65536  -  65551.これらの予約は数レジストリ[IANA.AS] AS IANAに記載されています。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "AS number reservations do not have any direct impact on Internet infrastructure security.",
      "ja": "AS番号の予約は、インターネットインフラストラクチャのセキュリティ上の任意の直接的な影響はありません。"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgements",
      "section_title": true,
      "ja": "6.謝辞"
    },
    {
      "indent": 3,
      "text": "The author acknowledges the work of Tomoya Yoshida, Gaurab Upadhaya, and Philip Smith in authoring a policy proposal that was submitted to the APNIC Policy Process in 2008 relating to the reservation of AS numbers for documentation purposes.",
      "ja": "著者は、文書化のためAS番号の予約に関連し、2008年にAPNIC政策過程に提出された政策提言をオーサリング中智也吉田、Gaurab Upadhaya、フィリップ・スミスの仕事を認めています。"
    },
    {
      "indent": 0,
      "text": "7. Informative References",
      "section_title": true,
      "ja": "7.参考文献"
    },
    {
      "indent": 3,
      "text": "[IANA.AS] IANA, \"Autonomous System (AS) Numbers\", Sep 2008, <http://www.iana.org>.",
      "ja": "[IANA.AS] IANA、 \"自律システム（AS）番号\"、2008年9月、<http://www.iana.org>。"
    },
    {
      "indent": 3,
      "text": "[IANA.IPv4] IANA, \"IPv4 Global Unicast Address Assignments\", Sep 2008, <http://www.iana.org>.",
      "ja": "[IANA.IPv4] IANA、 \"IPv4のグローバルユニキャストアドレスの割り当て\"、2008年9月、<http://www.iana.org>。"
    },
    {
      "indent": 3,
      "text": "[RFC2606] Eastlake, D. and A. Panitz, \"Reserved Top Level DNS Names\", BCP 32, RFC 2606, June 1999.",
      "ja": "[RFC2606]イーストレイク、D.とA. Panitz、 \"予約トップレベルDNS名\"、BCP 32、RFC 2606、1999年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC3849] Huston, G., Lord, A., and P. Smith, \"IPv6 Address Prefix Reserved for Documentation\", RFC 3849, July 2004.",
      "ja": "[RFC3849]ヒューストン、G.、主よ、A.、およびP.スミス、 \"ドキュメンテーションのためのIPv6アドレスプレフィックス予約\"、RFC 3849、2004年7月。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Geoff Huston",
      "ja": "ジェフ・ヒューストン"
    },
    {
      "indent": 3,
      "text": "EMail: gih@apnic.net",
      "ja": "メールアドレス：gih@apnic.net"
    }
  ]
}