{
  "title": {
    "text": "RFC 5462 - Multiprotocol Label Switching (MPLS) Label Stack Entry: \"EXP\" Field Renamed to \"Traffic Class\" Field",
    "ja": "RFC 5462 - マルチプロトコルラベルスイッチング（MPLS）ラベルスタックエントリ：「Exp」フィールド「トラフィッククラス」フィールドに改名されたフィールド"
  },
  "number": 5462,
  "created_at": "2023-03-20 17:17:43.288249+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                       L. Andersson\nRequest for Comments: 5462                                      Acreo AB\nUpdates: 3032, 3270, 3272, 3443, 3469,                          R. Asati\n         3564, 3985, 4182, 4364, 4379,                     Cisco Systems\n         4448, 4761, 5129                                  February 2009\nCategory: Standards Track",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 8,
      "text": "Multiprotocol Label Switching (MPLS) Label Stack Entry: \"EXP\" Field Renamed to \"Traffic Class\" Field",
      "ja": "マルチプロトコルラベルスイッチング（MPLS）ラベルスタックエントリ：「Exp」フィールド「トラフィッククラス」フィールドに改名されたフィールド"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "このドキュメントは、インターネットコミュニティのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態とステータスについては、「インターネット公式プロトコル標準」（STD 1）の現在のエディションを参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2009 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2009 IETF Trustおよび文書著者として特定された人。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents in effect on the date of publication of this document (http://trustee.ietf.org/license-info). Please review these documents carefully, as they describe your rights and restrictions with respect to this document.",
      "ja": "このドキュメントは、BCP 78およびこのドキュメントの公開日（http://trustee.ietf.org/license-info）に有効なIETFドキュメントに関連するIETF Trustの法的規定の対象となります。この文書に関するあなたの権利と制限を説明するので、これらの文書を注意深く確認してください。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "The early Multiprotocol Label Switching (MPLS) documents defined the form of the MPLS label stack entry. This includes a three-bit field called the \"EXP field\". The exact use of this field was not defined by these documents, except to state that it was to be \"reserved for experimental use\".",
      "ja": "初期のマルチプロトコルラベルスイッチング（MPLS）ドキュメントは、MPLSラベルスタックエントリの形式を定義しました。これには、「Expフィールド」と呼ばれる3ビットフィールドが含まれます。このフィールドの正確な使用は、これらのドキュメントでは定義されていませんでしたが、「実験用に予約されている」と述べています。"
    },
    {
      "indent": 3,
      "text": "Although the intended use of the EXP field was as a \"Class of Service\" (CoS) field, it was not named a CoS field by these early documents because the use of such a CoS field was not considered to be sufficiently defined. Today a number of standards documents define its usage as a CoS field.",
      "ja": "EXPフィールドの使用は「サービスのクラス」（COS）フィールドとしてでしたが、このようなCOSフィールドの使用は十分に定義されているとは見なされなかったため、これらの初期の文書でCOSフィールドと名付けられていませんでした。今日、多くの標準文書がその使用法をCOSフィールドとして定義しています。"
    },
    {
      "indent": 3,
      "text": "To avoid misunderstanding about how this field may be used, it has become increasingly necessary to rename this field. This document changes the name of the field to the \"Traffic Class field\" (\"TC field\"). In doing so, it also updates documents that define the current use of the EXP field.",
      "ja": "このフィールドがどのように使用されるかについての誤解を避けるために、このフィールドの名前を変更することがますます必要になっています。このドキュメントは、フィールドの名前を「トラフィッククラスフィールド」（「TCフィールド」）に変更します。そうすることで、EXPフィールドの現在の使用を定義するドキュメントも更新します。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  2\n2.  Details of Change  . . . . . . . . . . . . . . . . . . . . . .  3\n  2.1.  RFC 3032 . . . . . . . . . . . . . . . . . . . . . . . . .  3\n  2.2.  RFC 3270 . . . . . . . . . . . . . . . . . . . . . . . . .  5\n  2.3.  RFC 5129 . . . . . . . . . . . . . . . . . . . . . . . . .  6\n  2.4.  The Scope of This Change . . . . . . . . . . . . . . . . .  7\n3.  Use of the TC field  . . . . . . . . . . . . . . . . . . . . .  7\n4.  Security Considerations  . . . . . . . . . . . . . . . . . . .  8\n5.  Acknowledgments  . . . . . . . . . . . . . . . . . . . . . . .  8\n6.  References . . . . . . . . . . . . . . . . . . . . . . . . . .  8\n  6.1.  Normative References . . . . . . . . . . . . . . . . . . .  8\n  6.2.  Informative References . . . . . . . . . . . . . . . . . .  9",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The format of an MPLS label stack entry is defined by RFC 3032 [RFC3032] to include a three-bit field called the \"EXP field\". The exact use of this field is not defined by RFC 3032, except to state that it is to be \"reserved for experimental use\".",
      "ja": "MPLSラベルスタックエントリの形式は、RFC 3032 [RFC3032]によって定義され、「EXPフィールド」と呼ばれる3ビットフィールドを含めます。このフィールドの正確な使用は、RFC 3032で定義されていませんが、「実験用に予約される」ことを除いて。"
    },
    {
      "indent": 3,
      "text": "The EXP field, from the start, was intended to carry \"Class of Service\" (CoS) information. The field was actually called the \"Class of Service field\" in early versions of the working group document that was published as RFC 3032. However, at the time that RFC 3032 was published, the exact usage of this \"Class of Service\" field was not agreed upon and the field was designated as \"experimental use\"; hence, the name has since been the \"EXP field\".",
      "ja": "EXPフィールドは、最初から「サービスのクラス」（COS）情報を運ぶことを目的としていました。このフィールドは、実際には、RFC 3032として公開されたワーキンググループドキュメントの初期バージョンの「サービスフィールド」と呼ばれていました。ただし、RFC 3032が公開されていたとき、この「サービスのクラス」フィールドの正確な使用法は合意されておらず、フィールドは「実験的使用」として指定されました。したがって、その名前はその後「Expフィールド」でした。"
    },
    {
      "indent": 3,
      "text": "The designation \"for experimental use\" has led other Standards Development Organizations (SDOs) and implementors to assume that it is possible to use the field for other purposes. This document changes the name of the field to clearly indicate its use as a traffic classification field.",
      "ja": "「実験用」の指定により、他の標準開発組織（SDO）と実装者が他の目的でフィールドを使用できると仮定することができました。このドキュメントは、フィールドの名前を変更して、トラフィック分類フィールドとしての使用を明確に示しています。"
    },
    {
      "indent": 3,
      "text": "At first, we discussed using the original \"CoS field\" as the name for the field, but it has been pointed out that this name does not cover the following changes that have occurred with respect to its usage since RFC 3032 was published.",
      "ja": "最初は、オリジナルの「COSフィールド」をフィールドの名前として使用することについて説明しましたが、この名前は、RFC 3032が公開されて以来、その使用に関して発生した以下の変更をカバーしていないことが指摘されています。"
    },
    {
      "indent": 3,
      "text": "1. The use of the EXP field was first defined in RFC 3270 [RFC3270], where a method to define a variant of Diffserv Label Switched Paths (LSP), called EXP-Inferred-PSC LSP (E-LSPs), was specified. PSC is a two-stage acronym that is expanded as PHB (Per Hop Behavior) Scheduling Class (PSC).",
      "ja": "1. EXPフィールドの使用は、最初にRFC 3270 [RFC3270]で定義されました。ここでは、Expinferred-PSC LSP（E-LSP）と呼ばれるDiffServラベルスイッチ付きパス（LSP）のバリアントを定義する方法が指定されました。PSCは、PHB（ホップごとの動作ごと）スケジューリングクラス（PSC）として拡張される2段階の頭字語です。"
    },
    {
      "indent": 3,
      "text": "2. The use of the EXP field as defined in RFC 3270 has been further extended in RFC 5129 [RFC5129], where methods for explicit congestion marking in MPLS are defined.",
      "ja": "2. RFC 3270で定義されているEXPフィールドの使用は、RFC 5129 [RFC5129]でさらに拡張されており、MPLSの明示的な輻輳マーキングの方法が定義されています。"
    },
    {
      "indent": 3,
      "text": "This document, hence, uses the name \"Traffic Class field (TC field)\", which better covers the potential use. The MPLS TC field relates to an MPLS encapsulated packet the same way as the IPv6 TC field relates to an IPv6 encapsulated packet or the IPv4 Precedence field relates to an IPv4 encapsulated packet.",
      "ja": "したがって、このドキュメントは、「トラフィッククラスフィールド（TCフィールド）」という名前を使用します。これは、潜在的な使用をよりよくカバーしています。MPLS TCフィールドは、IPv6 TCフィールドがIPv6カプセル化されたパケットに関連するのと同じ方法で、MPLSカプセル化されたパケットに関連しています。または、IPv4の優先度フィールドは、IPv4カプセル化されたパケットに関連しています。"
    },
    {
      "indent": 3,
      "text": "The definitions of how the EXP field is used are perfectly clear in RFC 3270 and RFC 5129. However, these RFCs do not explicitly state they update RFC 3032, and this fact was not captured in the RFC repository until after work on this document was started.",
      "ja": "EXPフィールドの使用方法の定義は、RFC 3270およびRFC 5129で完全に明確です。ただし、これらのRFCはRFC 3032を更新することを明示的に述べていません。。"
    },
    {
      "indent": 3,
      "text": "This document updates RFC 3032, RFC 3270, and RFC 5129 to clarify the intended usage of the TC field. The changes to these RFCs requires some changes to the actual text in those documents; Section 2 explains the changes.",
      "ja": "このドキュメントは、RFC 3032、RFC 3270、およびRFC 5129を更新して、TCフィールドの意図した使用法を明確にします。これらのRFCの変更には、これらのドキュメントの実際のテキストにいくつかの変更が必要です。セクション2では、変更について説明します。"
    },
    {
      "indent": 3,
      "text": "This document also updates several other RFCs; see Section 2.4. For these documents, the change is limited to changing the name of the Label Stack entry field.",
      "ja": "このドキュメントは、他のいくつかのRFCを更新します。セクション2.4を参照してください。これらのドキュメントの場合、変更はラベルスタックエントリフィールドの名前を変更することに限定されています。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "ja": "この文書のキーワード \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", および \"OPTIONAL\" はRFC 2119 [RFC2119]で説明されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. Details of Change",
      "section_title": true,
      "ja": "2. 変更の詳細"
    },
    {
      "indent": 3,
      "text": "The three RFCs 3032, 3270, and 5129 are now updated according to the following.",
      "ja": "3つのRFCS 3032、3270、および5129は、以下に従って更新されました。"
    },
    {
      "indent": 0,
      "text": "2.1. RFC 3032",
      "section_title": true,
      "ja": "2.1. RFC 3032"
    },
    {
      "indent": 3,
      "text": "RFC 3032 states on page 4:",
      "ja": "4ページのRFC 3032州："
    },
    {
      "indent": 6,
      "text": "3. Experimental Use",
      "ja": "3. 実験的使用"
    },
    {
      "indent": 6,
      "text": "This three-bit field is reserved for experimental use.",
      "ja": "この3ビットフィールドは、実験用に予約されています。"
    },
    {
      "indent": 3,
      "text": "This paragraph is now changed to:",
      "ja": "この段落は次のように変更されます。"
    },
    {
      "indent": 6,
      "text": "3. Traffic Class (TC) field",
      "ja": "3. トラフィッククラス（TC）フィールド"
    },
    {
      "indent": 6,
      "text": "This three-bit field is used to carry traffic class information, and the change of the name is applicable to all places it occurs in IETF RFCs and other IETF documents.",
      "ja": "この3ビットフィールドは、トラフィッククラスの情報を携帯するために使用され、名前の変更は、IETF RFCSおよびその他のIETFドキュメントで発生するすべての場所に適用されます。"
    },
    {
      "indent": 6,
      "text": "RFC 3270 and RFC 5129 update the definition of the TC field and describe how to use the field.",
      "ja": "RFC 3270およびRFC 5129 TCフィールドの定義を更新し、フィールドの使用方法を説明します。"
    },
    {
      "indent": 3,
      "text": "In Figure 1 on page 3 in RFC 3032, the format of a label stack entry is specified as:",
      "ja": "RFC 3032の3ページの図1では、ラベルスタックエントリの形式が次のように指定されています。"
    },
    {
      "indent": 1,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ Label\n|                Label                  | Exp |S|       TTL     | Stack\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ Entry",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 21,
      "text": "Label: Label Value, 20 bits Exp: Experimental Use, 3 bits S: Bottom of Stack, 1 bit TTL: Time to Live, 8 bits",
      "ja": "ラベル値：ラベル値、20ビットExp：実験用使用、3ビットS：スタックの下部、1ビットTTL：ライブの時間、8ビット"
    },
    {
      "indent": 30,
      "text": "Figure 1",
      "ja": "図1"
    },
    {
      "indent": 3,
      "text": "Figure 1 in RFC 3032 is now changed to match the change of name to TC field:",
      "ja": "RFC 3032の図1は、名前の変更をTCフィールドに一致させるように変更されました。"
    },
    {
      "indent": 1,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ Label\n|                Label                  | TC  |S|       TTL     | Stack\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ Entry",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 21,
      "text": "Label: Label Value, 20 bits TC: Traffic Class field, 3 bits S: Bottom of Stack, 1 bit TTL: Time to Live, 8 bits",
      "ja": "ラベル値：ラベル値、20ビットTC：トラフィッククラスフィールド、3ビットS：スタックの下部、1ビットTTL：ライブの時間、8ビット"
    },
    {
      "indent": 31,
      "text": "Figure 1 (new)",
      "ja": "図1（新）"
    },
    {
      "indent": 3,
      "text": "Note: The designation of the picture above as \"Figure 1 (new)\" is introduced as a way to distinguish the figures in this document. It will still be \"Figure 1\" in RFC 3032.",
      "ja": "注：上の写真の「図1（新しい）」としての指定は、このドキュメントの図を区別する方法として紹介されています。RFC 3032の「図1」になります。"
    },
    {
      "indent": 0,
      "text": "2.2. RFC 3270",
      "section_title": true,
      "ja": "2.2. RFC 3270"
    },
    {
      "indent": 3,
      "text": "RFC 3270 says on page 6:",
      "ja": "RFC 3270は6ページに記載されています："
    },
    {
      "indent": 3,
      "text": "1.2 EXP-Inferred-PSC LSPs (E-LSP)",
      "ja": "1.2 expinferred-PSC LSP（e-lsp）"
    },
    {
      "indent": 6,
      "text": "A single LSP can be used to support one or more OAs. Such LSPs can support up to eight BAs of a given FEC, regardless of how many OAs these BAs span. With such LSPs, the EXP field of the MPLS Shim Header is used by the LSR to determine the PHB to be applied to the packet. This includes both the PSC and the drop preference.",
      "ja": "単一のLSPを使用して、1つ以上のOASをサポートできます。このようなLSPは、これらのBASスパンの数に関係なく、特定のFECの最大8つのBASをサポートできます。このようなLSPを使用すると、MPLSシムヘッダーのEXPフィールドがLSRによって使用され、パケットに適用されるPHBを決定します。これには、PSCとドロップ選好の両方が含まれます。"
    },
    {
      "indent": 6,
      "text": "We refer to such LSPs as \"EXP-inferred-PSC LSPs\" (E-LSP), since the PSC of a packet transported on this LSP depends on the EXP field value for that packet.",
      "ja": "このLSPで輸送されたパケットのPSCは、そのパケットのEXPフィールド値に依存するため、このようなLSPは「Exp Inferred-PSC LSPS」（E-LSP）と呼びます。"
    },
    {
      "indent": 6,
      "text": "The mapping from the EXP field to the PHB (i.e., to PSC and drop precedence) for a given such LSP, is either explicitly signaled at label set-up or relies on a pre-configured mapping.",
      "ja": "特定のLSPのEXPフィールドからPHBへのマッピング（つまり、PSCおよびドロップの優先順位）は、ラベルセットアップで明示的に信号を送るか、事前に構成されたマッピングに依存しています。"
    },
    {
      "indent": 6,
      "text": "Detailed operations of E-LSPs are specified in section 3 below.",
      "ja": "E-LSPの詳細な操作は、以下のセクション3に指定されています。"
    },
    {
      "indent": 3,
      "text": "RFC 3270 is now updated like this:",
      "ja": "RFC 3270は次のように更新されました："
    },
    {
      "indent": 3,
      "text": "a. A new paragraph is added at the end of Section 1 \"Introduction\":",
      "ja": "a. セクション1の「はじめに」の最後に新しい段落が追加されます。"
    },
    {
      "indent": 10,
      "text": "The EXP field has been renamed the TC field, and thus all references in RFC 3270 to the EXP field now refer to the TC field.",
      "ja": "EXPフィールドはTCフィールドの名前が変更されているため、RFC 3270のすべての参照がEXPフィールドへのすべての参照がTCフィールドを参照しています。"
    },
    {
      "indent": 3,
      "text": "b. A new term is added to Section 1.1 \"Terminology\":",
      "ja": "b. セクション1.1の「用語」に新しい用語が追加されます。"
    },
    {
      "indent": 10,
      "text": "TC Traffic Class (replaces the term EXP)",
      "ja": "TCトラフィッククラス（Expという用語を置き換えます）"
    },
    {
      "indent": 3,
      "text": "c. In Section 1.1 \"Terminology\", the acronym E-LSP is now understood to mean:",
      "ja": "c. セクション1.1「用語」では、頭字語E-LSPは次のことを理解しています。"
    },
    {
      "indent": 10,
      "text": "E-LSP Explicitly TC-encoded-PSC LSP",
      "ja": "E-LSPは明示的にTCエンコード-PSC LSPです"
    },
    {
      "indent": 3,
      "text": "Section 1.2 on page 6 in RFC 3270 is now changed to:",
      "ja": "RFC 3270の6ページのセクション1.2は次のように変更されます。"
    },
    {
      "indent": 3,
      "text": "1.2 Explicitly TC-encoded-PSC LSPs (E-LSP)",
      "ja": "1.2 明示的にTCエンコード-PSCLSP（E-LSP）"
    },
    {
      "indent": 6,
      "text": "The EXP field has been renamed to the TC field, and thus all references in RFC 3270 to EXP field now refer to the TC field. However, we retain the acronym E-LSP (Explicitly TC-encoded-PSC LSP) as the acronym is in widespread use.",
      "ja": "EXPフィールドはTCフィールドに名前が変更されているため、RFC 3270のすべての参照がEXPフィールドにTCフィールドを参照しています。ただし、頭字語が広く使用されているため、頭字語E-LSP（明示的にTCエンコード-PSC LSP）を保持します。"
    },
    {
      "indent": 6,
      "text": "A single LSP can be used to support one or more OAs. Such LSPs can support up to eight BAs of a given FEC, regardless of how many OAs these BAs span. With such LSPs, the TC field of the MPLS Shim Header is used by the LSR to determine the PHB to be applied to the packet. This includes both the PSC and the drop preference.",
      "ja": "単一のLSPを使用して、1つ以上のOASをサポートできます。このようなLSPは、これらのBASスパンの数に関係なく、特定のFECの最大8つのBASをサポートできます。このようなLSPを使用すると、MPLSシムヘッダーのTCフィールドがLSRによって使用され、パケットに適用されるPHBを決定します。これには、PSCとドロップ選好の両方が含まれます。"
    },
    {
      "indent": 6,
      "text": "We refer to such LSPs as \"Explicitly TC-encoded-PSC LSPs\" (E-LSPs), since the PSC of a packet transported on this LSP depends on the TC field (previously called the EXP field) value for that packet.",
      "ja": "このLSPは、このLSPで輸送されたパケットのPSCは、そのパケットのTCフィールド（以前はEXPフィールドと呼ばれていた）値に依存するため、このようなLSPを「明示的にTCエンコード-PSC LSPS」（E-LSP）と呼びます。"
    },
    {
      "indent": 6,
      "text": "The mapping from the TC field to the PHB (i.e., to PSC and drop precedence) for a given such LSP is either explicitly signaled at label set-up or relies on a pre-configured mapping.",
      "ja": "特定のLSPのTCフィールドからPHBへのマッピング（すなわち、PSCおよびドロップの優先順位）は、ラベルセットアップで明示的に信号されるか、事前に構成されたマッピングに依存しています。"
    },
    {
      "indent": 6,
      "text": "This is an update to RFC 3032 [RFC3032], in line with the original intent of how this field in the MPLS Shim Header should be used (as a TC field). RFC 3270 has itself been updated by RFC 5129 [RFC5129].",
      "ja": "これは、MPLSシムヘッダーのこのフィールドを使用する方法（TCフィールドとして）の元の意図に沿って、RFC 3032 [RFC3032]の更新です。RFC 3270自体がRFC 5129 [RFC5129]によって更新されました。"
    },
    {
      "indent": 6,
      "text": "Detailed operations of E-LSPs are specified in Section 3 of RFC 3270.",
      "ja": "E-LSPの詳細な操作は、RFC 3270のセクション3で指定されています。"
    },
    {
      "indent": 0,
      "text": "2.3. RFC 5129",
      "section_title": true,
      "ja": "2.3. RFC 5129"
    },
    {
      "indent": 3,
      "text": "RFC 5129 is now updated like this:",
      "ja": "RFC 5129は次のように更新されました："
    },
    {
      "indent": 3,
      "text": "A new paragraph is added at the end of Section 1.1 \"Background\":",
      "ja": "セクション1.1の「背景」の最後に新しい段落が追加されます。"
    },
    {
      "indent": 6,
      "text": "The EXP field has been renamed to the TC field, and thus all references in RFC 5129 to the EXP field now refer to the TC field.",
      "ja": "EXPフィールドはTCフィールドに名前が変更されているため、RFC 5129のすべての参照がEXPフィールドへのすべての参照がTCフィールドを参照しています。"
    },
    {
      "indent": 3,
      "text": "Section 2 (bullet 5) on page 7 of RFC 5129 says:",
      "ja": "RFC 5129の7ページのセクション2（弾丸5）は次のように述べています。"
    },
    {
      "indent": 3,
      "text": "o A third possible approach was suggested by [Shayman]. In this scheme, interior LSRs assume that the endpoints are ECN-capable, but this assumption is checked when the final label is popped. If an interior LSR has marked ECN in the EXP field of the shim header, but the IP header says the endpoints are not ECN-capable, the edge router (or penultimate router, if using penultimate hop popping) drops the packet. We recommend this scheme, which we call `per-domain ECT checking', and define it more precisely in the following section. Its chief drawback is that it can cause packets to be forwarded after encountering congestion only to be dropped at the egress of the MPLS domain. The rationale for this decision is given in Section 8.1.",
      "ja": "o [Shayman]によって3番目の可能なアプローチが提案されました。このスキームでは、インテリアLSRはエンドポイントがECN対応であると想定していますが、この仮定は最終ラベルがポップされたときにチェックされます。インテリアLSRがShimヘッダーのEXPフィールドでECNをマークしたが、IPヘッダーはエンドポイントがECN対応ではないと述べている場合、エッジルーター（または最後から2番目のルーター、ペノアルティテーションホップポップを使用する場合）はパケットをドロップします。このスキームをお勧めします。このスキームは、「ドメインあたりECTチェック」と呼ばれ、次のセクションでより正確に定義します。その主な欠点は、MPLSドメインの出口でのみ輻輳に遭遇した後にパケットを転送する可能性があることです。この決定の理論的根拠は、セクション8.1に記載されています。"
    },
    {
      "indent": 3,
      "text": "Section 2 (bullet 5) of RFC 5129 is now updated to:",
      "ja": "RFC 5129のセクション2（弾丸5）は、次のように更新されます。"
    },
    {
      "indent": 3,
      "text": "o A third possible approach was suggested by [Shayman]. In this scheme, interior LSRs assume that the endpoints are ECN-capable, but this assumption is checked when the final label is popped. If an interior LSR has marked ECN in the TC field of the shim header, but the IP header says the endpoints are not TC-capable, the edge router (or penultimate router, if using penultimate hop popping) drops the packet. We recommend this scheme, which we call `per-domain ECT checking', and define it more precisely in the following section. Its chief drawback is that it can cause packets to be forwarded after encountering congestion only to be dropped at the egress of the MPLS domain. The rationale for this decision is given in Section 8.1. This scheme is an update to RFC 3032 [RFC3032] and RFC 3270 [RFC3270].",
      "ja": "o [Shayman]によって3番目の可能なアプローチが提案されました。このスキームでは、インテリアLSRはエンドポイントがECN対応であると想定していますが、この仮定は最終ラベルがポップされたときにチェックされます。インテリアLSRがShimヘッダーのTCフィールドでECNをマークしたが、IPヘッダーはエンドポイントがTCに対応できないと言っている場合、エッジルーター（または最後から2番目のホップポップを使用する場合は最後から2番目のルーター）がパケットをドロップします。このスキームをお勧めします。このスキームは、「ドメインあたりECTチェック」と呼ばれ、次のセクションでより正確に定義します。その主な欠点は、MPLSドメインの出口でのみ輻輳に遭遇した後にパケットを転送する可能性があることです。この決定の理論的根拠は、セクション8.1に記載されています。このスキームは、RFC 3032 [RFC3032]およびRFC 3270 [RFC3270]の更新です。"
    },
    {
      "indent": 0,
      "text": "2.4. The Scope of This Change",
      "section_title": true,
      "ja": "2.4. この変更の範囲"
    },
    {
      "indent": 3,
      "text": "There are several places in the RFCs that are explicitly updated by this document that reference the \"Exp field\", sometimes they refer to the field as \"Exp bits\", \"EXP bits\", or \"EXP\". In all those instances, the references now reference the TC field.",
      "ja": "RFCには、「EXPフィールド」を参照するこのドキュメントで明示的に更新されるいくつかの場所があり、フィールドを「EXPビット」、「EXPビット」、または「EXP」と呼ぶこともあります。これらすべてのインスタンスで、参照はTCフィールドを参照します。"
    },
    {
      "indent": 3,
      "text": "There are also other RFCs (e.g., RFC 3272 [RFC3272], RFC 3443 [RFC3443], RFC 3469 [RFC3469], RFC 3564 [RFC3564], RFC 3985 [RFC3985], RFC 4182 [RFC4182], RFC 4364 [RFC4364], RFC 4379 [RFC4379], RFC 4448 [RFC4448], and RFC 4761 [RFC4761]) that reference the \"Exp field\"; sometimes they refer to the field as \"Exp bits\", \"EXP bits\", and \"EXP\". For all RFCs, including but not limited to those mentioned in this paragraph, such references now reference the TC field.",
      "ja": "他のRFC（例：RFC 3272 [RFC3272]、RFC 3443 [RFC3443]、RFC 3469 [RFC3469]、RFC 3564 [RFC3564]、RFC 3985 [RFC385]、RFC4182RFC 4379 [RFC4379]、RFC 4448 [RFC448]、およびRFC 4761 [RFC4761]）は、「EXPフィールド」を参照しています。時々、彼らはフィールドを「Exp Bits」、「Exp Bits」、および「Exp」と呼んでいます。この段落に記載されているものを含むがこれらに限定されないすべてのRFCについて、このような参考文献はTCフィールドを参照しています。"
    },
    {
      "indent": 0,
      "text": "3. Use of the TC field",
      "section_title": true,
      "ja": "3. TCフィールドの使用"
    },
    {
      "indent": 3,
      "text": "Due to the limited number of bits in the TC field, their use for QoS and ECN (Explicit Congestion Notification) functions is intended to be flexible. These functions may rewrite all or some of the bits in the TC field.",
      "ja": "TCフィールドのビットの数が限られているため、QoSおよびECN（明示的な輻輳通知）関数への使用は、柔軟性があることを目的としています。これらの関数は、TCフィールドのすべてまたは一部のビットを書き換える場合があります。"
    },
    {
      "indent": 3,
      "text": "Current implementations look at the TC field with and without label context, and the TC field may be copied to the label stack entries that are pushed onto the label stack. This is done to avoid label stack entries that are pushed onto an existing label stack having different TC fields from the rest of the label stack entries.",
      "ja": "現在の実装は、ラベルコンテキストの有無にかかわらずTCフィールドを見て、TCフィールドをラベルスタックにプッシュされるラベルスタックエントリにコピーすることができます。これは、ラベルスタックエントリの残りの部分とは異なるTCフィールドを持つ既存のラベルスタックにプッシュされるラベルスタックエントリを避けるために行われます。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "This document only changes the name of one field in the MPLS shim header, and thus does not introduce any new security considerations.",
      "ja": "このドキュメントは、MPLSシムヘッダーの1つのフィールドの名前のみを変更するため、新しいセキュリティに関する考慮事項は導入されません。"
    },
    {
      "indent": 0,
      "text": "5. Acknowledgments",
      "section_title": true,
      "ja": "5. 謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Stewart Bryant, Bruce Davie, George Swallow, and Francois Le Faucheur for their input to and review of the current document.",
      "ja": "著者は、現在の文書への入力とレビューについて、スチュワート・ブライアント、ブルース・デイビー、ジョージ・スワロー、フランソワ・ル・ファウチュールに感謝したいと思います。"
    },
    {
      "indent": 3,
      "text": "The authors would also like to thank George Swallow, Khatri Paresh, and Phil Bedard for their help with grammar and spelling; a special thanks to Adrian Farrel for his careful review and help trawling the RFC-sea for RFCs that reference the EXP field.",
      "ja": "著者はまた、ジョージ・スワロー、カトリ・パレシュ、フィル・ベダードに、文法と綴りを助けてくれたことにも感謝したいと思います。Adrian Farrelに注意深いレビューをしてくれたことに感謝し、EXPフィールドを参照するRFCのRFC-SEAのトロールを支援してくれました。"
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "ja": "6. 参考文献"
    },
    {
      "indent": 0,
      "text": "6.1. Normative References",
      "section_title": true,
      "ja": "6.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119] Bradner、S。、「要件レベルを示すためにRFCで使用するためのキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3032] Rosen, E., Tappan, D., Fedorkow, G., Rekhter, Y., Farinacci, D., Li, T., and A. Conta, \"MPLS Label Stack Encoding\", RFC 3032, January 2001.",
      "ja": "[RFC3032] Rosen、E.、Tappan、D.、Fedorkow、G.、Rekhter、Y.、Farinacci、D.、Li、T。、およびA. conta、「Mpls Label Stack Encoding」、RFC 3032、2001年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC3270] Le Faucheur, F., Wu, L., Davie, B., Davari, S., Vaananen, P., Krishnan, R., Cheval, P., and J. Heinanen, \"Multi-Protocol Label Switching (MPLS) Support of Differentiated Services\", RFC 3270, May 2002.",
      "ja": "[RFC3270] Le Faucheur、F.、Wu、L.、Davie、B.、Davari、S.、Vaananen、P.、Krishnan、R.、Cheval、P。、およびJ. Heinanen、「Multi-Protocol Label Switching」（MPLS）差別化されたサービスのサポート」、RFC 3270、2002年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC3272] Awduche, D., Chiu, A., Elwalid, A., Widjaja, I., and X. Xiao, \"Overview and Principles of Internet Traffic Engineering\", RFC 3272, May 2002.",
      "ja": "[RFC3272] Awduche、D.、Chiu、A.、Elwalid、A.、Widjaja、I。、およびX. Xiao、「インターネットトラフィックエンジニアリングの概要と原則」、RFC 3272、2002年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC3443] Agarwal, P. and B. Akyol, \"Time To Live (TTL) Processing in Multi-Protocol Label Switching (MPLS) Networks\", RFC 3443, January 2003.",
      "ja": "[RFC3443] Agarwal、P。およびB. Akyol、「マルチプロトコルラベルスイッチング（MPLS）ネットワークでのライブ（TTL）処理」、RFC 3443、2003年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC3469] Sharma, V. and F. Hellstrand, \"Framework for Multi-Protocol Label Switching (MPLS)-based Recovery\", RFC 3469, February 2003.",
      "ja": "[RFC3469] Sharma、V。およびF. Hellstrand、「マルチプロトコルラベルスイッチング（MPLS）ベースの回復のフレームワーク」、RFC 3469、2003年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC3564] Le Faucheur, F. and W. Lai, \"Requirements for Support of Differentiated Services-aware MPLS Traffic Engineering\", RFC 3564, July 2003.",
      "ja": "[RFC3564] Le Faucheur、F。およびW. Lai、「差別化されたサービス認識MPLSトラフィックエンジニアリングのサポートの要件」、RFC 3564、2003年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC3985] Bryant, S. and P. Pate, \"Pseudo Wire Emulation Edge-to-Edge (PWE3) Architecture\", RFC 3985, March 2005.",
      "ja": "[RFC3985] Bryant、S。およびP. Pate、「Pseudo Wire Emulation Edge-to-Edge（PWE3）アーキテクチャ」、RFC 3985、2005年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC4182] Rosen, E., \"Removing a Restriction on the use of MPLS Explicit NULL\", RFC 4182, September 2005.",
      "ja": "[RFC4182] Rosen、E。、「MPLS明示的ヌルの使用に関する制限の削除」、RFC 4182、2005年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC4364] Rosen, E. and Y. Rekhter, \"BGP/MPLS IP Virtual Private Networks (VPNs)\", RFC 4364, February 2006.",
      "ja": "[RFC4364] Rosen、E。およびY. Rekhter、「BGP/MPLS IP仮想プライベートネットワーク（VPNS）」、RFC 4364、2006年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC4379] Kompella, K. and G. Swallow, \"Detecting Multi-Protocol Label Switched (MPLS) Data Plane Failures\", RFC 4379, February 2006.",
      "ja": "[RFC4379] Kompella、K。およびG. Swallow、「Multi-Protocol Label Switched（MPLS）データプレーン障害の検出」、RFC 4379、2006年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC4448] Martini, L., Rosen, E., El-Aawar, N., and G. Heron, \"Encapsulation Methods for Transport of Ethernet over MPLS Networks\", RFC 4448, April 2006.",
      "ja": "[RFC4448] Martini、L.、Rosen、E.、El-Aawar、N。、およびG. Heron、「MPLSネットワーク上のイーサネットの輸送のためのカプセル化方法」、RFC 4448、2006年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC4761] Kompella, K. and Y. Rekhter, \"Virtual Private LAN Service (VPLS) Using BGP for Auto-Discovery and Signaling\", RFC 4761, January 2007.",
      "ja": "[RFC4761] Kompella、K。およびY. Rekhter、「自動ディスコービリとシグナル伝達のためにBGPを使用した仮想プライベートLANサービス（VPLS）」、RFC 4761、2007年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC5129] Davie, B., Briscoe, B., and J. Tay, \"Explicit Congestion Marking in MPLS\", RFC 5129, January 2008.",
      "ja": "[RFC5129] Davie、B.、Briscoe、B。、およびJ. Tay、「MPLSでの明示的な渋滞マーク」、RFC 5129、2008年1月。"
    },
    {
      "indent": 0,
      "text": "6.2. Informative References",
      "section_title": true,
      "ja": "6.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[Shayman] Shayman, M. and R. Jaeger, \"Using ECN to Signal Congestion Within an MPLS Domain\", Work in Progress, November 2000.",
      "ja": "[Shayman] Shayman、M。およびR. Jaeger、「ECNを使用してMPLSドメイン内の輻輳を知らせる」、2000年11月、進行中の作業。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Loa Andersson Acreo AB",
      "ja": "Loa Andersson Acreo AB"
    },
    {
      "indent": 3,
      "text": "EMail: loa@pi.nu",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Rajiv Asati Cisco Systems",
      "ja": "Rajiv Asati Cisco Systems"
    },
    {
      "indent": 3,
      "text": "EMail: rajiva@cisco.com",
      "raw": true,
      "ja": ""
    }
  ]
}