{
  "title": {
    "text": "RFC 5685 - Redirect Mechanism for the Internet Key Exchange Protocol Version 2 (IKEv2)",
    "ja": "RFC 5685 - インターネット鍵交換プロトコルバージョン2（IKEv2の）するためのメカニズムのリダイレクト"
  },
  "number": 5685,
  "created_at": "2019-10-27 12:33:35.122298+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                     V. Devarapalli\nRequest for Comments: 5685                                      WiChorus\nCategory: Standards Track                                     K. Weniger\n                                                            Unaffiliated\n                                                           November 2009",
      "raw": true
    },
    {
      "indent": 10,
      "text": "              Redirect Mechanism for\nthe Internet Key Exchange Protocol Version 2 (IKEv2)",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "The Internet Key Exchange Protocol version 2 (IKEv2) is a protocol for setting up Virtual Private Network (VPN) tunnels from a remote location to a gateway so that the VPN client can access services in the network behind the gateway. This document defines an IKEv2 extension that allows an overloaded VPN gateway or a VPN gateway that is being shut down for maintenance to redirect the VPN client to attach to another gateway. The proposed mechanism can also be used in Mobile IPv6 to enable the home agent to redirect the mobile node to another home agent.",
      "ja": "インターネット鍵交換プロトコルバージョン2（IKEv2の）VPNクライアントがゲートウェイの背後にあるネットワーク内のサービスにアクセスできるように、ゲートウェイに遠隔地から仮想プライベートネットワーク（VPN）トンネルを設定するためのプロトコルです。この文書では、オーバーロードVPNゲートウェイまたは別のゲートウェイに接続するVPNクライアントをリダイレクトするためのメンテナンスのためにシャットダウンされているVPNゲートウェイを可能にするIKEv2の拡張を定義します。提案されたメカニズムは、別のホームエージェントにモバイルノードをリダイレクトするホームエージェントを有効にするために、モバイルIPv6で使用することができます。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2009 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2009 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクション4.eに記載されており、BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 3,
      "text": "This document may contain material from IETF Documents or IETF Contributions published or made publicly available before November 10, 2008. The person(s) controlling the copyright in some of this material may not have granted the IETF Trust the right to allow modifications of such material outside the IETF Standards Process. Without obtaining an adequate license from the person(s) controlling the copyright in such materials, this document may not be modified outside the IETF Standards Process, and derivative works of it may not be created outside the IETF Standards Process, except to format it for publication as an RFC or to translate it into languages other than English.",
      "ja": "この材料の一部がIETFトラストにこのような材料の変更を許可する権利を与えられていない可能性がありますにこの文書は、2008年、IETFドキュメントまたは11月10日以前に発行または公開さIETF貢献から著作権を支配する者（複数可）材料を含んでいてもよいですIETF標準化プロセスの外。そのような材料の著作権を管理者（単数または複数）から適切なライセンスを取得することなく、この文書は、IETF標準化過程の外側修正されないかもしれません、そして、それの派生物は、IETF標準化過程の外側に作成されない場合があり、それをフォーマットする以外出版RFCとして、英語以外の言語に翻訳します。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Terminology .....................................................3\n3. IKEv2 Initial Exchange with Redirect ............................3\n4. Use of Anycast Addresses with the Redirect Mechanism ............5\n5. Redirect during an Active Session ...............................6\n6. Redirect during IKE_AUTH Exchange ...............................7\n7. Handling Redirect Loops .........................................8\n8. Using the Redirect Mechanism with Mobile IPv6 ...................8\n9. Redirect Messages ...............................................9\n   9.1. REDIRECT_SUPPORTED .........................................9\n   9.2. REDIRECT ..................................................10\n   9.3. REDIRECTED_FROM ...........................................11\n10. Use of the Redirect Mechanism between IKEv2 Peers .............12\n11. Security Considerations .......................................12\n12. IANA Considerations ...........................................13\n13. Acknowledgements ..............................................13\n14. References ....................................................14\n   14.1. Normative References .....................................14\n   14.2. Informative References ...................................14",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "IKEv2 [2] is used for setting up IPsec-based [7] VPNs. The IP address of the VPN gateway can be configured on the VPN client. But this does not scale well when the number of VPN gateways is large. Dynamic discovery of VPN gateways using DNS is quite widely used too. However, using DNS is not flexible when it comes to assigning a VPN gateway to the VPN client based on the load on the VPN gateways. The VPN client typically tries to connect to the IP address of the VPN gateway that appears first in the DNS response. If the VPN tunnel setup fails, then the VPN client tries to attach to the other VPN gateways returned in the DNS response.",
      "ja": "[2]のIKEv2は、IPsecベースの[7] VPNを設定するために使用されます。 VPNゲートウェイのIPアドレスは、VPNクライアント上で設定することができます。 VPNゲートウェイの数が多いときしかし、これはうまくスケールしません。 DNSを使用してVPNゲートウェイの動的な発見は非常に広く、あまりにも使用されています。それはVPNゲートウェイの負荷に基づいて、VPNクライアントにVPNゲートウェイを割り当てるに来るときしかし、DNSを使用すると、柔軟ではありません。 VPNクライアントは通常、DNS応答の最初に表示されるVPNゲートウェイのIPアドレスに接続しようとします。 VPNトンネルのセットアップが失敗した場合は、VPNクライアントは、DNS応答で返された他のVPNゲートウェイに接続しようとします。"
    },
    {
      "indent": 3,
      "text": "This document proposes a redirect mechanism for IKEv2 that enables a VPN gateway to redirect the VPN client to another VPN gateway, for example, based on the load condition. The redirect can be done during the IKE_SA_INIT or the IKE_AUTH exchange. Gateway-initiated redirect in the middle of a session is also supported. The redirect mechanism can also be used in conjunction with anycast addresses. In this case, an anycast address for the cluster of VPN gateways is stored in the DNS instead of a list of unicast IP addresses of the VPN gateways.",
      "ja": "この文書では、負荷条件に基づいて、例えば、別のVPNゲートウェイにVPNクライアントをリダイレクトするためにVPNゲートウェイを可能にするのIKEv2のリダイレクト機構を提案します。リダイレクトはIKE_SA_INITやIKE_AUTH交換中に行うことができます。セッションの途中でゲートウェイが開始したリダイレクトもサポートされています。リダイレクト機構はまた、エニーキャストアドレスと併せて使用することができます。この場合、VPNゲートウェイのクラスタのエニーキャストアドレスは、DNSの代わりに、VPNゲートウェイのユニキャストIPアドレスのリストに格納されています。"
    },
    {
      "indent": 3,
      "text": "The redirect can also happen because of administrative or optimal-routing reasons. This document does not attempt to provide an exhaustive list of reasons for redirecting a VPN client to another VPN gateway.",
      "ja": "リダイレクトもあるため、管理者または最適なルーティングの理由で発生する可能性があります。この文書は、他のVPNゲートウェイにVPNクライアントをリダイレクトするための理由の完全なリストを提供しようとしません。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "ja": "2.用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [1].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[1]に記載のように解釈されます。"
    },
    {
      "indent": 0,
      "text": "3. IKEv2 Initial Exchange with Redirect",
      "section_title": true,
      "ja": "リダイレクトと3.のIKEv2初期交換"
    },
    {
      "indent": 3,
      "text": "This section describes the use of the redirect mechanism during the IKE_SA_INIT exchange. Gateway-initiated redirect during an active session and the use of redirect during IKE_AUTH exchange are explained in subsequent sections.",
      "ja": "このセクションでは、IKE_SA_INIT交換時のリダイレクトメカニズムの使用を記載しています。ゲートウェイ開始アクティブセッション中にリダイレクトとIKE_AUTH交換時のリダイレクトを使用することは、後続のセクションで説明されています。"
    },
    {
      "indent": 3,
      "text": "The VPN client indicates support for the IKEv2 redirect mechanism and its willingness to be redirected by including a REDIRECT_SUPPORTED notification message in the initial IKE_SA_INIT request (see Section 9.1). The gateway MUST keep track of those clients that indicated support for the redirect mechanism and those that didn't.",
      "ja": "VPNクライアントは、最初のIKE_SA_INIT要求（セクション9.1を参照）REDIRECT_SUPPORTED通知メッセージを含むことによってリダイレクトするIKEv2のためのサポートリダイレクト機構とその意欲を示しています。ゲートウェイは、リダイレクトメカニズムをサポートしていなかったものを示したそれらのクライアントを追跡する必要があります。"
    },
    {
      "indent": 3,
      "text": "To redirect an IKEv2 session to another VPN gateway, the VPN gateway that initially received the IKE_SA_INIT request selects another VPN gateway (how the selection is made is beyond the scope of this document) and replies with an IKE_SA_INIT response containing a REDIRECT notification message (see Section 9.2). The notification includes information about the selected VPN gateway and the nonce data from the Ni payload in the IKE_SA_INIT request. If the IKE_SA_INIT request did not indicate support for the redirect mechanism, the responder MUST NOT send the REDIRECT payload to the VPN client. This is applicable to all REDIRECT scenarios described in this document.",
      "ja": "別のVPNゲートウェイに最初に別のVPNゲートウェイ（選択が行われている方法は、この文書の範囲を超えて）、リダイレクト通知メッセージを含むIKE_SA_INIT応答で応答選択IKE_SA_INIT要求を受信し、VPNゲートウェイのIKEv2セッションをリダイレクトする（参照9.2節）。通知は、選択されたVPNゲートウェイとIKE_SA_INIT要求のNiペイロードからノンスデータに関する情報を含みます。 IKE_SA_INIT要求がリダイレクトメカニズムのサポートを示していなかった場合、応答者は、VPNクライアントへのリダイレクトペイロードを送ってはいけません。これは、この文書に記載されているすべてのREDIRECTのシナリオに適用されます。"
    },
    {
      "indent": 3,
      "text": "Note that when the IKE_SA_INIT response includes the REDIRECT notification, the exchange does not result in the creation of an IKE_SA and the responder Security Parameter Index (SPI) will be zero.",
      "ja": "IKE_SA_INIT応答がREDIRECT通知を含んでいる場合には、交換がIKE_SAの作成にはならないと応答セキュリティパラメータインデックス（SPI）がゼロになることに注意してください。"
    },
    {
      "indent": 7,
      "text": "Initiator                    Responder (initial VPN GW)\n---------                    -------------------------",
      "raw": true
    },
    {
      "indent": 4,
      "text": "(IP_I:500 -> Initial_IP_R:500) HDR(A,0), SAi1, KEi, Ni, --> N(REDIRECT_SUPPORTED)",
      "ja": "（IP_I：500  - > Initial_IP_R：500）HDR（A、0）、SAI1啓、ニッケル、 - > N（REDIRECT_SUPPORTED）"
    },
    {
      "indent": 26,
      "text": "    (Initial_IP_R:500 -> IP_I:500)\n<-- HDR(A,0), N(REDIRECT, New_GW_ID, Ni_data)",
      "raw": true
    },
    {
      "indent": 3,
      "text": "When the client receives the IKE_SA_INIT response, it MUST verify that the nonce data matches the value sent in the IKE_SA_INIT request. If the values do not match, the client MUST silently discard the response (and keep waiting for another response). This prevents certain denial-of-service (DoS) attacks on the initiator that could be caused by an attacker injecting IKE_SA_INIT responses with REDIRECT payloads.",
      "ja": "クライアントは、IKE_SA_INIT応答を受信すると、ナンスデータは、IKE_SA_INIT要求で送信された値と一致することを確かめなければなりません。値が一致しない場合、クライアントは黙って応答を破棄（および他の応答を待っておく）しなければなりません。これは、REDIRECTペイロードをIKE_SA_INIT応答を注入する攻撃者によって引き起こされる可能性がイニシエータ上の特定のサービス拒否（DoS）攻撃を防ぐことができます。"
    },
    {
      "indent": 3,
      "text": "After verifying the nonce data, the client initiates a new IKE_SA_INIT exchange with the VPN gateway listed in the REDIRECT payload, provided this is allowed by its Peer Authorization Database (PAD) entries. In the IKE_SA_INIT exchange with the new VPN gateway, the client MUST include the REDIRECTED_FROM payload (see Section 9.3). The VPN client includes the IP address of the original VPN gateway that redirected the client in the REDIRECTED_FROM notification. The IKEv2 exchange then proceeds as it would have proceeded with the original VPN gateway.",
      "ja": "乱数データを検証した後、クライアントは、REDIRECTペイロードに記載されているVPNゲートウェイとの新しいIKE_SA_INIT交換を開始これは、そのピア認証データベース（PAD）のエントリによって許可されました。新しいVPNゲートウェイとのIKE_SA_INIT交換では、クライアントは、（セクション9.3を参照）REDIRECTED_FROMペイロードを含まなければなりません。 VPNクライアントはREDIRECTED_FROM通知にクライアントをリダイレクト元VPNゲートウェイのIPアドレスを含んでいます。 IKEv2の交換は、それが元のVPNゲートウェイを進めてきたと同じように進行します。"
    },
    {
      "indent": 7,
      "text": "Initiator                   Responder (Selected VPN GW)\n---------                   ---------------------------",
      "raw": true
    },
    {
      "indent": 4,
      "text": "(IP_I:500 -> IP_R:500) HDR(A,0), SAi1, KEi, Ni, --> N(REDIRECTED_FROM, Initial_IP_R)",
      "ja": "（IP_I：500  - > IP_R：500）HDR（A、0）、SAI1啓、ニッケル、 - > N（REDIRECTED_FROM、Initial_IP_R）"
    },
    {
      "indent": 26,
      "text": "    (IP_R:500 -> IP_I:500)\n<-- HDR(A,B), SAr1, KEr, Nr,[CERTREQ]",
      "raw": true
    },
    {
      "indent": 4,
      "text": "(IP_I:500 -> IP_R:500) HDR(A,B), SK {IDi, [CERT,] [CERTREQ,] [IDr,]AUTH, SAi2, TSi, TSr} -->",
      "ja": "（IP_I：500  - > IP_R：500）HDR（A、B）、SK {IDI、[CERT、] [CERTREQ、] [IDR、】AUTH、SAI2、をTSi、TSrを}  - >"
    },
    {
      "indent": 26,
      "text": "    (IP_R:500 -> IP_I:500)\n<-- HDR(A,B), SK {IDr, [CERT,] AUTH,\n                       SAr2, TSi, TSr}",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The client MAY get redirected again by the new VPN gateway if the new VPN gateway also cannot serve the client. The client does not have to include the REDIRECT_SUPPORTED payload again in the IKE_SA_INIT exchange with the new gateway after a redirect. The presence of the REDIRECT_FROM payload in the IKE_SA_INIT exchange with the new gateway indicates to the new gateway that the client supports the redirect mechanism.",
      "ja": "新しいVPNゲートウェイは、クライアントにサービスを提供できない場合、クライアントは、新しいVPNゲートウェイによって再びリダイレクトされることがあります。クライアントは、リダイレクト後に新しいゲートウェイとのIKE_SA_INIT交換において再びREDIRECT_SUPPORTEDペイロードを含める必要はありません。新しいゲートウェイとのIKE_SA_INIT交換中REDIRECT_FROMペイロードの存在は、クライアントがリダイレクトメカニズムをサポートする新しいゲートウェイに示します。"
    },
    {
      "indent": 3,
      "text": "When the client gets redirected, it MUST use the same Peer Authorization Database (PAD) and Security Policy Database (SPD) entries as it would have used with the original gateway. Receiving a redirect notification MUST NOT result in the modification of any PAD or SPD entries. In practice, this means the new gateway either has to use the same responder identity (IDr) as the original gateway, or both should be part of a group of responders that are authorized by the same PAD entry. See Section 4.4.3.1 of [7] on using DNS names to represent a group of peers in a PAD entry.",
      "ja": "クライアントがリダイレクトされる場合には、それが本来のゲートウェイで使用しているだろうと、それは同じピア認証データベース（PAD）とセキュリティポリシーデータベース（SPD）エントリを使用しなければなりません。リダイレクト通知を受信すると、任意のパッドまたはSPDエントリの変更につながるなりません。実際には、これは新しいゲートウェイは、元のゲートウェイと同じレスポンダ識別（IDR）を使用しなければならないのいずれか、または両方が同一のPADエントリによって許可された応答者のグループの一部でなければならないことを意味します。 PADのエントリにピアのグループを表すために、DNS名を使用して、[7]のセクション4.4.3.1を参照してください。"
    },
    {
      "indent": 3,
      "text": "This document allows the client to be redirected in several protocol states. In some of them, the gateway is already authenticated at the point of redirect; in others, it is not. We emphasize that the above rules regarding the identity of the new gateway and the PAD and SPD entries apply equally to all these scenarios.",
      "ja": "この文書では、クライアントは、いくつかのプロトコル状態にリダイレクトすることができます。そのうちのいくつかでは、ゲートウェイは、既にリダイレクトの時点で認証されます。他の人に、そうではありません。私たちは、新しいゲートウェイとパッドとSPDエントリのアイデンティティに関する上記のルールは、これらすべてのシナリオに等しく適用されることを強調する。"
    },
    {
      "indent": 0,
      "text": "4. Use of Anycast Addresses with the Redirect Mechanism",
      "section_title": true,
      "ja": "エニーキャストの4.は、リダイレクトメカニズムとアドレス"
    },
    {
      "indent": 3,
      "text": "Using anycast addresses will avoid the necessity of configuring a particular VPN gateway's IP address in the DNS. Instead, the anycast address that represents the group of VPN gateways is stored in the DNS. When the VPN client performs a DNS lookup for the VPN gateway, it receives the anycast address of the VPN gateway in the DNS response.",
      "ja": "エニーキャストアドレスを使用すると、DNSに特定のVPNゲートウェイのIPアドレスを設定する必要性を回避します。代わりに、VPNゲートウェイの基を表し、エニーキャストアドレスがDNSに格納されています。 VPNクライアントがVPNゲートウェイのDNSルックアップを実行すると、それは、DNS応答でVPNゲートウェイのエニーキャストアドレスを受信します。"
    },
    {
      "indent": 3,
      "text": "If an anycast address is returned in response to the DNS resolution of a Fully Qualified Domain Name (FQDN), the VPN client sends the IKE_SA_INIT request to the anycast address. The REDIRECT_SUPPORTED payload is included in the IKE_SA_INIT request sent to the anycast address. The IKE_SA_INIT request is routed to one of the VPN gateways that is part of the anycast group. The VPN gateway that receives the IKE_SA_INIT request responds with an IKE_SA_INIT reply from the anycast address.",
      "ja": "エニーキャストアドレスは、完全修飾ドメイン名（FQDN）のDNS解決に応答して返された場合、VPNクライアントは、エニーキャストアドレスにIKE_SA_INIT要求を送信します。 REDIRECT_SUPPORTEDペイロードは、エニーキャストアドレスに送信されたIKE_SA_INIT要求に含まれています。 IKE_SA_INIT要求は、エニーキャストグループの一部であるVPNゲートウェイのいずれかに送られます。 IKE_SA_INIT要求を受信したVPNゲートウェイは、エニーキャストアドレスからのIKE_SA_INIT応答で応答します。"
    },
    {
      "indent": 7,
      "text": "Initiator                    Responder (any VPN GW)\n---------                    -------------------------",
      "raw": true
    },
    {
      "indent": 4,
      "text": "(IP_I:500 -> ANYCAST:500) HDR(A,0), SAi1, KEi, Ni) --> N(REDIRECT_SUPPORTED)",
      "ja": "（IP_I：500  - > ANYCAST：500）HDR（A、0）、SAI1啓、Ni）の - > N（REDIRECT_SUPPORTED）"
    },
    {
      "indent": 26,
      "text": "    (ANYCAST:500 -> IP_I:500)\n<-- HDR(A,0), N(REDIRECT, New_GW_ID, Ni_data)",
      "raw": true
    },
    {
      "indent": 3,
      "text": "If the destination address on the IKE_SA_INIT request is an anycast address, the VPN gateway that received the IKE_SA_INIT request MUST include the REDIRECT payload to redirect the VPN client to a unicast address of one of the VPN gateways. The VPN gateway that received the IKE_SA_INIT request MAY redirect the client to its own unicast address if it is not overloaded.",
      "ja": "IKE_SA_INIT要求の宛先アドレスがエニーキャストアドレスである場合、IKE_SA_INIT要求を受信したVPNゲートウェイは、VPNゲートウェイのいずれかのユニキャストアドレスにVPNクライアントをリダイレクトするREDIRECTペイロードを含まなければなりません。それが過負荷にされていない場合はIKE_SA_INIT要求を受けたVPNゲートウェイは、自身のユニキャストアドレスにクライアントをリダイレクトすることができます。"
    },
    {
      "indent": 3,
      "text": "The rest of the IKEv2 exchange is the same as described in Section 3.",
      "ja": "第3節で説明したようにのIKEv2交換の残りの部分は同じです。"
    },
    {
      "indent": 0,
      "text": "5. Redirect during an Active Session",
      "section_title": true,
      "ja": "5.アクティブ・セッション中にリダイレクト"
    },
    {
      "indent": 3,
      "text": "The redirect mechanism may also be used by a VPN gateway to redirect the client to another VPN gateway in the middle of a session. To redirect a client, the gateway should send an INFORMATIONAL message with the REDIRECT Notify payload. The REDIRECT payload MUST carry information about the new VPN gateway. The gateway MUST NOT include any nonce data in the REDIRECT payload, since it is a gateway-initiated redirect and is protected by the IKEv2 security association. When the client receives this message, it sends a response (usually empty) to the gateway. The gateway retransmits the redirect INFORMATIONAL message as described in [2], until it gets a response. The following illustrates the INFORMATIONAL message exchange for gateway-initiated redirect.",
      "ja": "リダイレクト機構は、セッションの途中で別のVPNゲートウェイにクライアントをリダイレクトするためにVPNゲートウェイによって使用されてもよいです。クライアントをリダイレクトするために、ゲートウェイは、ペイロードを通知REDIRECTを示す通知メッセージを送信しなければなりません。 REDIRECTペイロードが新しいVPNゲートウェイについての情報を運ばなければなりません。それは、ゲートウェイによって開始リダイレクトとのIKEv2セキュリティアソシエーションにより保護されているため、ゲートウェイは、REDIRECTペイロード内の任意の乱数データを含んではいけません。クライアントがこのメッセージを受信すると、ゲートウェイに（通常は空の）応答を送信します。 [2]で説明したように、応答を取得するまで、ゲートウェイは、リダイレクト情報メッセージを再送します。以下は、ゲートウェイによって開始リダイレクトするための情報メッセージの交換を示します。"
    },
    {
      "indent": 7,
      "text": "Initiator (VPN client)        Responder (VPN GW)\n----------------------        ------------------",
      "raw": true
    },
    {
      "indent": 31,
      "text": "<-- HDR, SK {N(REDIRECT, New_GW_ID)}",
      "ja": "< -  HDR、SK {N（REDIRECT、New_GW_ID）}"
    },
    {
      "indent": 5,
      "text": "HDR, SK {} -->",
      "ja": "HDR、SK {}  - >"
    },
    {
      "indent": 3,
      "text": "The INFORMATIONAL message exchange described above is protected by the existing IKEv2 SA between the client and the gateway.",
      "ja": "上記情報メッセージ交換は、クライアントとゲートウェイの間に存在するのIKEv2 SAによって保護されています。"
    },
    {
      "indent": 3,
      "text": "Once the client sends an acknowledgement to the gateway, it SHOULD delete the existing security associations with the old gateway by sending an INFORMATIONAL message with a DELETE payload. The gateway MAY also decide to delete the security associations without any signaling from the client, again by sending an INFORMATIONAL message with a DELETE payload; however, it should allow sufficient time for the client to set up the required security associations with the new security gateway. This time period should be configurable on the gateway.",
      "ja": "クライアントがゲートウェイに確認応答を送信すると、それはDELETEペイロードに情報メッセージを送信することによって、古いゲートウェイとの既存のセキュリティアソシエーションを削除する必要があります。また、ゲートウェイは、DELETEペイロードを持つ情報メッセージを送信することによって、再び、クライアントからのシグナリングせずにセキュリティアソシエーションを削除するように決定することができます。しかし、それは、クライアントが新しいセキュリティゲートウェイに必要なセキュリティアソシエーションを設定するための十分な時間を許可する必要があります。この期間は、ゲートウェイ上で設定する必要があります。"
    },
    {
      "indent": 0,
      "text": "6. Redirect during IKE_AUTH Exchange",
      "section_title": true,
      "ja": "6. IKE_AUTH交換時にリダイレクト"
    },
    {
      "indent": 3,
      "text": "If the gateway decides to redirect the client during the IKE_AUTH exchange, based on the identity presented by the client in the IKE_AUTH request message, it prevents the creation of a CHILD SA and sends the REDIRECT payload in the IKE_AUTH response. The gateway MUST verify the client's AUTH payload before sending the REDIRECT payload, and the client MUST verify the gateway's AUTH payload before acting on the REDIRECT payload. Since the AUTH payloads were exchanged and successfully verified, the IKEv2 security association is valid. When the client receives the IKE_AUTH response with the REDIRECT payload, it SHOULD delete the IKEv2 security association with the gateway by sending an INFORMATIONAL message with a DELETE payload.",
      "ja": "ゲートウェイは、IKE_AUTH要求メッセージ内のクライアントが提示するIDに基づいて、IKE_AUTH交換中にクライアントをリダイレクトすることを決定した場合、それはCHILD SAの作成を防ぎ、IKE_AUTH応答でREDIRECTペイロードを送信します。ゲートウェイは、REDIRECTペイロードを送信する前に、クライアントのAUTHペイロードを確かめなければなりませんし、クライアントはREDIRECTペイロードに作用する前に、ゲートウェイのAUTHペイロードを確かめなければなりません。 AUTHペイロードを交換し、正常に確認されたので、IKEv2のセキュリティアソシエーションが有効です。クライアントはREDIRECTペイロードとIKE_AUTHレスポンスを受信すると、削除ペイロードを示す通知メッセージを送信することによって、ゲートウェイとのIKEv2セキュリティアソシエーションを削除する必要があります。"
    },
    {
      "indent": 8,
      "text": "Initiator                    Responder (VPN GW)\n---------                    ------------------",
      "raw": true
    },
    {
      "indent": 4,
      "text": "(IP_I:500 -> IP_R:500) HDR(A,0), SAi1, KEi, Ni, --> N(REDIRECTED_SUPPORTED)",
      "ja": "（IP_I：500  - > IP_R：500）HDR（A、0）、SAI1啓、ニッケル、 - > N（REDIRECTED_SUPPORTED）"
    },
    {
      "indent": 30,
      "text": "    (IP_R:500 -> IP_I:500)\n<-- HDR(A,B), SAr1, KEr, Nr,[CERTREQ]",
      "raw": true
    },
    {
      "indent": 4,
      "text": "(IP_I:500 -> IP_R:500) HDR(A,B), SK {IDi, [CERT,] [CERTREQ,] [IDr,]AUTH, SAi2, TSi, TSr} -->",
      "ja": "（IP_I：500  - > IP_R：500）HDR（A、B）、SK {IDI、[CERT、] [CERTREQ、] [IDR、】AUTH、SAI2、をTSi、TSrを}  - >"
    },
    {
      "indent": 30,
      "text": "    (IP_R:500 -> IP_I:500)\n<-- HDR(A,B), SK {IDr, [CERT,] AUTH,\n             N(REDIRECT, New_GW_ID)}",
      "raw": true
    },
    {
      "indent": 3,
      "text": "In case the IKE_AUTH exchange involves Extensible Authentication Protocol (EAP) authentication (as described in Section 2.16 of RFC 4306 [2]) or multiple authentication methods (as described in RFC 4739 [6]), the gateway may decide to redirect the client based on the interaction with the Authentication, Authorization, and Accounting (AAA) server or the external authentication server. In this case, the gateway MUST send the REDIRECT Notify payload in either the first or the last IKE_AUTH response. The client and the gateway MUST verify the AUTH payloads as described above.",
      "ja": "（RFC 4739に記載されているように[6]）の場合にIKE_AUTH交換は、ゲートウェイはベースのクライアントをリダイレクトすることを決定することができる拡張認証プロトコル（EAP）認証（RFC 4306のセクション2.16に記載されているように[2]）または複数の認証方法を含みます認証、許可、アカウンティング（AAA）サーバまたは外部認証サーバとの相互作用。この場合、ゲートウェイは、リダイレクトが最初または最後のIKE_AUTH応答のいずれかでペイロードを通知送らなければなりません。上述したように、クライアントとゲートウェイは、AUTHペイロードを確認しなければなりません。"
    },
    {
      "indent": 3,
      "text": "When EAP is used, the gateway MAY also redirect the client based on the unauthenticated identity presented by the client in the first IKE_AUTH exchange, itself. Since EAP is used as the authentication mechanism, the client does not include AUTH payload to authenticate its identity, but the server MUST still include its own AUTH payload, and the client MUST verify it. Note that the IKEv2 SA is not created in this case and the client does not have to explicitly delete the IKEv2 SA.",
      "ja": "EAPを使用する場合、ゲートウェイは、第一のIKE_AUTH交換、それ自体がクライアントによって提示された非認証IDに基づいてクライアントをリダイレクトすることができます。 EAP認証メカニズムとして使用されているので、クライアントは、そのIDを認証するためにAUTHペイロードを含んでいませんが、サーバーは、まだ自身のAUTHペイロードを含まなければならない、そしてクライアントはそれを確かめなければなりません。 IKEv2のSAは、この場合には作成されず、クライアントが明示的にIKEv2のSAを削除する必要がないことに注意してください。"
    },
    {
      "indent": 3,
      "text": "In all of the cases above, the client MUST accept the REDIRECT notification only in the first IKE_AUTH response or the last IKE_AUTH response. It MUST NOT accept the REDIRECT notification in an intermediate IKE_AUTH response.",
      "ja": "上記の例すべてでは、クライアントは最初のIKE_AUTH応答または最後IKE_AUTH応答にREDIRECT通知を受け入れなければなりません。これは、中間IKE_AUTH応答でREDIRECT通知を受け入れてはいけません。"
    },
    {
      "indent": 0,
      "text": "7. Handling Redirect Loops",
      "section_title": true,
      "ja": "リダイレクトループの取り扱い7."
    },
    {
      "indent": 3,
      "text": "The client could end up getting redirected multiple times in a sequence, either because of a wrong configuration or a DoS attack. The client could even end up in a loop with two or more gateways redirecting the client to each other. This could deny service to the client. To prevent this, the client SHOULD be configured to not accept more than a certain number of redirects (MAX_REDIRECTS) within a short time period (REDIRECT_LOOP_DETECT_PERIOD) for a particular IKEv2 SA setup. The default value for the MAX_REDIRECTS configuration variable is 5. The default value for the REDIRECT_LOOP_DETECT_PERIOD configuration variable is 300 seconds. Client implementations may allow these variables to be configured, depending on a specific deployment or system configuration.",
      "ja": "クライアントは、シーケンス内で複数回リダイレクトされ、いずれかのために間違った設定やDoS攻撃の取得てしまう可能性があります。クライアントでもお互いにクライアントをリダイレクトする2つの以上のゲートウェイとのループで終わることができました。これは、クライアントへのサービスを拒否することができます。これを防止するために、クライアントは、特定のIKEv2 SAのセットアップのために短時間（REDIRECT_LOOP_DETECT_PERIOD）内にリダイレクト（MAX_REDIRECTS）の一定数以上を受け入れないように構成されるべきです。 MAX_REDIRECTS構成変数のデフォルト値はREDIRECT_LOOP_DETECT_PERIOD設定変数のデフォルト値は300秒である5です。クライアントの実装は、特定のデプロイメントまたはシステム構成に応じて、これらの変数を設定することを可能にすることができます。"
    },
    {
      "indent": 0,
      "text": "8. Using the Redirect Mechanism with Mobile IPv6",
      "section_title": true,
      "ja": "8.モバイルIPv6とのリダイレクト機構を使用"
    },
    {
      "indent": 3,
      "text": "Mobile IPv6 [3] may use IKEv2 for mutual authentication between the mobile node and the home agent, for home address configuration, and for setting up security associations for protecting Mobile IPv6 signaling messages [4]. The IKEv2 exchange, if IKEv2 is used, precedes the exchange of Mobile IPv6 signaling messages. Therefore, the mechanism described in this document can also be used by a Mobile IPv6 home agent to redirect a mobile node to another home agent.",
      "ja": "モバイルIPv6 [3]ホームアドレス構成のためのモバイルノードとホームエージェントとの間の相互認証のためのIKEv2を使用することができ、及びモバイルIPv6シグナリングメッセージを保護するためのセキュリティアソシエーションを設定するための[4]。 IKEv2の交換は、IKEv2のが使用される場合、モバイルIPv6シグナリングメッセージの交換に先行します。したがって、本書で説明されたメカニズムは、別のホームエージェントにモバイルノードをリダイレクトするためにモバイルIPv6ホームエージェントによって使用することもできます。"
    },
    {
      "indent": 3,
      "text": "There is a Home Agent Switch mechanism available for redirecting a mobile node to another home agent, described in [5]. The Home Agent Switch mechanism can only be used after the binding cache has been created at the home agent for the mobile node. The disadvantage with this is that quite a bit of state is created on the home agent before the mobile node can be redirected to another home agent. The mechanism described in this document can be used for redirecting a mobile node before any state related to the Mobile IPv6 binding is created on the home agent.",
      "ja": "[5]に記載された他のホームエージェントにモバイルノードを、リダイレクトするために利用可能なホームエージェントスイッチ機構があります。バインディングキャッシュは、モバイルノードのホームエージェントで作成された後、ホームエージェントスイッチ機構にのみ使用することができます。これの欠点は、モバイルノードが別のホームエージェントにリダイレクトすることができる前の状態のかなりのビットは、ホームエージェント上で作成されていることです。この文書で説明するメカニズムは、モバイルIPv6バインディングに関連する状態がホームエージェント上で作成される前に、モバイルノードをリダイレクトするために使用することができます。"
    },
    {
      "indent": 3,
      "text": "When running IKEv2 between a Mobile IPv6 mobile node (MN) and home agent (HA), redirecting the IKEv2 exchange to another HA is not enough; the Mobile IPv6 signaling also needs to be sent to the new HA address. The MN MAY treat the information received in the IKE_SA_INIT response in a similar way as it would treat HA discovery information received from other unauthenticated (and potentially untrustworthy) sources (such as DNS lookups not protected with DNS Security (DNSSEC)). However, if the MN has authenticated information about its home agent, it MUST NOT be updated based on the IKE_SA_INIT response.",
      "ja": "モバイルIPv6モバイルノード（MN）とホームエージェント（HA）の間のIKEv2を実行している場合は、別のHAへのIKEv2交換をリダイレクトするだけでは十分ではありません。モバイルIPv6シグナリングはまた、新しいHAアドレスに送信する必要があります。 MNは、それが（例えばDNSセキュリティ（DNSSEC）で保護されていないDNSルックアップなど）他の認証されていない（および潜在的に信用できない）のソースから受信したHAの発見情報を扱いますと同様の方法で、IKE_SA_INIT応答で受信した情報を扱うかもしれ。 MNがそのホームエージェントに関する情報を認証している場合は、それはIKE_SA_INIT応答に基づいて更新されてはなりません。"
    },
    {
      "indent": 3,
      "text": "If the REDIRECT notification is received during the IKE_AUTH exchange (after the HA has been authenticated; see Section 6), the MN MAY pass the new address to Mobile IPv6 and treat it in a similar fashion as information from the Home Agent Switch message [5].",
      "ja": "REDIRECT通知がIKE_AUTH交換中に受信された場合（HAが認証された後、第6節を参照）、MNは、モバイルIPv6に新しいアドレスを渡し、ホームエージェントスイッチのメッセージからの情報として、同様の方法でそれを扱うかもしれ[5 ]。"
    },
    {
      "indent": 3,
      "text": "Gateway-initiated REDIRECT notifications exchanged in INFORMATIONAL exchanges (see Section 5) MUST NOT result in updating any Mobile IPv6 state. In such cases, the Home Agent Switch message specified in [5] is used instead.",
      "ja": "ゲートウェイが開始しREDIRECTの通知は、任意のモバイルIPv6の状態の更新になりてはならない（第5節を参照）INFORMATIONAL交換に交換しました。このような場合には、[5]で指定されたホームエージェントスイッチのメッセージが代わりに使用されます。"
    },
    {
      "indent": 0,
      "text": "9. Redirect Messages",
      "section_title": true,
      "ja": "9.リダイレクトメッセージ"
    },
    {
      "indent": 0,
      "text": "9.1. REDIRECT_SUPPORTED",
      "section_title": true,
      "ja": "9.1。 REDIRECT_SUPPORTED"
    },
    {
      "indent": 3,
      "text": "The REDIRECT_SUPPORTED payload is included in the initial IKE_SA_INIT request by the initiator to indicate support for the IKEv2 redirect mechanism described in this document.",
      "ja": "REDIRECT_SUPPORTEDペイロードは、本書では説明のIKEv2リダイレクトメカニズムのサポートを示すために、イニシエータによって初期IKE_SA_INIT要求に含まれています。"
    },
    {
      "indent": 4,
      "text": "                     1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n| Next Payload  |C|  RESERVED   |         Payload Length        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|Protocol ID(=0)| SPI Size (=0) |      Notify Message Type      |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The 'Next Payload', 'Payload Length', 'Protocol ID', 'SPI Size', and 'Notify Message Type' fields are the same as described in Section 3.10 of [2]. The 'SPI Size' field MUST be set to 0 to indicate that the SPI is not present in this message. The 'Protocol ID' MUST be set to 0, since the notification is not specific to a particular security association.",
      "ja": "「次にペイロード」、「ペイロード長」、「プロトコルID」、「SPIサイズ」、及び[2]のセクション3.10に記載されているようにフィールドと同じである「メッセージタイプ通知」が。 「SPIサイズ」フィールドは、SPIがこのメッセージに存在しないことを示すために0に設定しなければなりません。通知は、特定のセキュリティアソシエーションに固有ではないので、「プロトコルID」は、0に設定しなければなりません。"
    },
    {
      "indent": 3,
      "text": "The 'Payload Length' field is set to the length in octets of the entire payload, including the generic payload header. The 'Notify Message Type' field is set to indicate the REDIRECT_SUPPORTED payload (16406).",
      "ja": "「ペイロード長」フィールドは、汎用ペイロード・ヘッダを含むペイロード全体のオクテットの長さに設定されています。 「NOTIFYメッセージタイプ」フィールドはREDIRECT_SUPPORTEDペイロード（16406）を示すように設定されています。"
    },
    {
      "indent": 0,
      "text": "9.2. REDIRECT",
      "section_title": true,
      "ja": "9.2。リダイレクト"
    },
    {
      "indent": 3,
      "text": "When the responder wants to redirect the initiator to another VPN gateway, the REDIRECT payload is included in either an IKE_SA_INIT response from the responder or an INFORMATIONAL message from the responder. The message includes the new responder's IP address or DNS name.",
      "ja": "応答者が別のVPNゲートウェイに開始剤をリダイレクトしたい場合、REDIRECTペイロードは、レスポンダからのIKE_SA_INIT応答または応答からの情報メッセージのいずれかに含まれています。メッセージは、新しい応答者のIPアドレスまたはDNS名が含まれています。"
    },
    {
      "indent": 4,
      "text": "                     1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n| Next Payload  |C|  RESERVED   |         Payload Length        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|Protocol ID(=0)| SPI Size (=0) |      Notify Message Type      |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n| GW Ident Type |  GW Ident Len |                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+                               ~\n~                   New Responder GW Identity                   ~\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                                                               |\n~                        Nonce Data                             ~\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The 'Next Payload', 'Payload Length', 'Protocol ID', 'SPI Size', and 'Notify Message Type' fields are the same as described in Section 3.10 of [2]. The 'SPI Size' field MUST be set to 0 to indicate that the SPI is not present in this message. The 'Protocol ID' MUST be set to 0, since the notification is not specific to a particular security association.",
      "ja": "「次にペイロード」、「ペイロード長」、「プロトコルID」、「SPIサイズ」、及び[2]のセクション3.10に記載されているようにフィールドと同じである「メッセージタイプ通知」が。 「SPIサイズ」フィールドは、SPIがこのメッセージに存在しないことを示すために0に設定しなければなりません。通知は、特定のセキュリティアソシエーションに固有ではないので、「プロトコルID」は、0に設定しなければなりません。"
    },
    {
      "indent": 3,
      "text": "The 'Payload Length' field is set to the length in octets of the entire payload, including the generic payload header. The 'Notify Message Type' field is set to indicate the REDIRECT payload (16407). The 'GW Identity Type' field indicates the type of information that is sent to identify the new VPN gateway. The following values are valid in the REDIRECT payload.",
      "ja": "「ペイロード長」フィールドは、汎用ペイロード・ヘッダを含むペイロード全体のオクテットの長さに設定されています。 「NOTIFYメッセージタイプ」フィールドはREDIRECTペイロード（16407）を示すように設定されています。 「GWのIdentity Type」フィールドは、新しいVPNゲートウェイを識別するために送信される情報の種類を示します。次の値がREDIRECTペイロードに有効です。"
    },
    {
      "indent": 6,
      "text": "1 - IPv4 address of the new VPN gateway",
      "ja": "1  - 新しいVPNゲートウェイのIPv4アドレス"
    },
    {
      "indent": 6,
      "text": "2 - IPv6 address of the new VPN gateway",
      "ja": "2  - 新しいVPNゲートウェイのIPv6アドレス"
    },
    {
      "indent": 6,
      "text": "3 - FQDN of the new VPN gateway",
      "ja": "3  - 新しいVPNゲートウェイのFQDN"
    },
    {
      "indent": 3,
      "text": "The 'GW Ident Len' field is set to the length of the gateway identity information. The identity of the new VPN gateway is carried in the 'New Responder GW Identity' field. The IPv4 address, the IPv6 address, or the FQDN of the new VPN gateway MUST be encoded as described in Section 3.5 of [2].",
      "ja": "「GWのIdentレン」フィールドは、ゲートウェイの識別情報の長さに設定されています。新しいVPNゲートウェイのアイデンティティは「新レスポンダGWアイデンティティ」フィールドで運ばれます。 [2]のセクション3.5に記載されているように、IPv4アドレス、IPv6アドレス、または新しいVPNゲートウェイのFQDNは、符号化されなければなりません。"
    },
    {
      "indent": 3,
      "text": "The 'Nonce Data' field carries the nonce data from the Ni payload sent by the initiator. The size of the nonce MUST be between 16 and 256 bytes, as described in Section 3.9 of [2]. The 'Nonce Data' field is present in the REDIRECT payload only when the REDIRECT payload is sent in the IKE_SA_INIT response message. It MUST NOT be included in the REDIRECT payload if sent in an IKE_AUTH response or in a gateway-initiated redirect message.",
      "ja": "「乱数データ」フィールドには、イニシエータによって送信されたNiペイロードから乱数データを運びます。 [2]のセクション3.9に記載されているようにノンスのサイズは、16と256バイトの間でなければなりません。 「乱数データ」フィールドには、リダイレクトペイロードをIKE_SA_INIT応答メッセージで送信された場合にのみREDIRECTペイロードに存在します。 IKE_AUTH応答またはゲートウェイによって開始リダイレクトメッセージで送信された場合には、リダイレクトのペイロードに含まれてはいけません。"
    },
    {
      "indent": 0,
      "text": "9.3. REDIRECTED_FROM",
      "section_title": true,
      "ja": "9.3。 REDIRECTED_FROM"
    },
    {
      "indent": 3,
      "text": "The REDIRECTED_FROM Notify payload is included in the IKE_SA_INIT request from the initiator to the new VPN gateway to indicate the IP address of the original VPN gateway that redirected the initiator. The original VPN gateway's IP address is included in the message. If the IKE_SA_INIT request was sent to any anycast address (see Section 4), then the anycast address is included in the message. This payload also serves the purpose of indicating support for the redirect mechanism to the new VPN gateway after a redirect.",
      "ja": "REDIRECTED_FROM通知ペイロードは、イニシエータをリダイレクト元のVPNゲートウェイのIPアドレスを示すために新しいVPNゲートウェイへのイニシエータからのIKE_SA_INIT要求に含まれています。元VPNゲートウェイのIPアドレスがメッセージに含まれています。 IKE_SA_INIT要求は、任意のエニーキャストアドレス（セクション4を参照）に送信された場合、エニーキャストアドレスがメッセージに含まれています。このペイロードはまた、リダイレクト後に新しいVPNゲートウェイにリダイレクト機構のサポートを示すの目的を果たします。"
    },
    {
      "indent": 4,
      "text": "                     1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n| Next Payload  |C|  RESERVED   |         Payload Length        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|Protocol ID(=0)| SPI Size (=0) |      Notify Message Type      |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n| GW Ident Type |  GW Ident Len |                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+                               ~\n~                   Original Responder GW Identity              ~\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The 'Next Payload', 'Payload Length', 'Protocol ID', 'SPI Size', and 'Notify Message Type' fields are the same as described in Section 3.10 of [2]. The 'SPI Size' field MUST be set to 0 to indicate that the SPI is not present in this message. The 'Protocol ID' MUST be set to 0, since the notification is not specific to a particular security association.",
      "ja": "「次にペイロード」、「ペイロード長」、「プロトコルID」、「SPIサイズ」、及び[2]のセクション3.10に記載されているようにフィールドと同じである「メッセージタイプ通知」が。 「SPIサイズ」フィールドは、SPIがこのメッセージに存在しないことを示すために0に設定しなければなりません。通知は、特定のセキュリティアソシエーションに固有ではないので、「プロトコルID」は、0に設定しなければなりません。"
    },
    {
      "indent": 3,
      "text": "The 'Payload Length' field is set to the length in octets of the entire payload, including the generic payload header. The 'Notify Message Type' field is set to indicate the REDIRECTED_FROM payload (16408). The 'GW Identity Type' field indicates the type of information that is sent to identify the new VPN gateway. The following values are valid in the REDIRECTED_FROM payload.",
      "ja": "「ペイロード長」フィールドは、汎用ペイロード・ヘッダを含むペイロード全体のオクテットの長さに設定されています。 「NOTIFYメッセージタイプ」フィールドはREDIRECTED_FROMペイロード（16408）を示すように設定されています。 「GWのIdentity Type」フィールドは、新しいVPNゲートウェイを識別するために送信される情報の種類を示します。次の値がREDIRECTED_FROMペイロードに有効です。"
    },
    {
      "indent": 6,
      "text": "1 - IPv4 address of the original VPN gateway",
      "ja": "1  - 元のVPNゲートウェイのIPv4アドレス"
    },
    {
      "indent": 6,
      "text": "2 - IPv6 address of the original VPN gateway",
      "ja": "2  - 元のVPNゲートウェイのIPv6アドレス"
    },
    {
      "indent": 3,
      "text": "The 'GW Ident Len' field is set to the length of the gateway identity information. The identity of the original VPN gateway is carried in the 'Original Responder GW Identity' field.",
      "ja": "「GWのIdentレン」フィールドは、ゲートウェイの識別情報の長さに設定されています。元VPNゲートウェイのアイデンティティは「オリジナルレスポンダGWアイデンティティ」フィールドで運ばれます。"
    },
    {
      "indent": 0,
      "text": "10. Use of the Redirect Mechanism between IKEv2 Peers",
      "section_title": true,
      "ja": "IKEv2のピア間のリダイレクト機構の10."
    },
    {
      "indent": 3,
      "text": "The redirect mechanism described in this document is mainly intended for use in client-gateway scenarios. However, the mechanism can also be used between any two IKEv2 peers. But this protocol is asymmetric, meaning that only the original responder can redirect the original initiator to another server.",
      "ja": "本書では説明リダイレクト機構は、主にクライアント・ゲートウェイのシナリオで使用するために意図されています。しかし、機構は、任意の2つのIKEv2ピア間でも使用することができます。しかし、このプロトコルは、唯一のオリジナルレスポンダは別のサーバーに、元のイニシエータをリダイレクトすることができることを意味、非対称です。"
    },
    {
      "indent": 0,
      "text": "11. Security Considerations",
      "section_title": true,
      "ja": "11.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "An eavesdropper on the path between a VPN client and server may send a redirect to the client upon receiving an IKE_SA_INIT message from this client. This is no problem regarding DoS attacks for the VPN connection, since an on-path-attacker can as well drop the IKE_SA_INIT requests to prevent VPN access for the client. But an eavesdropper on the path between VPN client and server can redirect a large number of clients to a victim, which is then flooded with IKE_SA_INIT requests. Flooding only happens if many clients initiate IKEv2 exchange at almost the same time, which is considered a rare event. However, this may happen if a home agent / VPN server is shutdown for maintenance and all clients need to re-establish VPN connections with another home agent / VPN server, or if the on-path attacker forces all IPsec security associations to expire by dropping all received IKEv2 messages.",
      "ja": "VPNクライアントとサーバとの間の経路上の盗聴者は、このクライアントからのIKE_SA_INITメッセージを受信すると、クライアントにリダイレクトを送信してもよいです。上のパス-の攻撃者だけでなく、クライアントのためのVPNアクセスを防ぐために、IKE_SA_INIT要求をドロップすることができますので、これは、VPN接続のためのDoS攻撃に関しては問題ありません。しかし、VPNクライアントとサーバー間のパス上の盗聴者は、その後、IKE_SA_INITリクエストが殺到している被害者に多数のクライアントをリダイレクトすることができます。多くのクライアントがまれなイベントと見なされるほぼ同時に、でのIKEv2交換を開始した場合フラッディングのみ発生します。ホームエージェント/ VPNサーバーメンテナンスのためにシャットダウンされ、すべてのクライアントが別のホームエージェント/ VPNサーバーとのVPN接続を再確立する必要がある、または上のパス攻撃力ならば、すべてのIPsecセキュリティアソシエーションがドロップすることにより、有効期限が切れるようにただし、これは起こるかもしれませんすべてのIKEv2メッセージを受け取りました。"
    },
    {
      "indent": 3,
      "text": "The use of the REDIRECTED_FROM payload is intended to discourage a rogue VPN gateway from redirecting a large number of VPN clients to a particular VPN gateway. It does not prevent such a DoS attack.",
      "ja": "REDIRECTED_FROMペイロードの使用は、特定のVPNゲートウェイにVPNクライアントの多数をリダイレクトから不正なVPNゲートウェイを阻止することを意図しています。このようなDoS攻撃を防ぐことはできません。"
    },
    {
      "indent": 3,
      "text": "The redirect mechanism MUST NOT update any state on the client apart from the VPN gateway information. When used with Mobile IPv6, care must be taken to ensure that the home agent information that the mobile node has configured is not modified wrongly by the redirect message.",
      "ja": "リダイレクト機構は、VPNゲートウェイ情報とは別に、クライアント上の任意の状態を更新してはいけません。モバイルIPv6で使用される場合、注意は、モバイルノードが構成されたホームエージェント情報は、リダイレクトメッセージによって誤って変更されないように注意しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Redirecting based on the unauthenticated identities from the client might leak out information about the user when an active attacker, pretending to be a VPN client, can get information on the gateway to which the real user was redirected. If redirection is based on some internal information of the user, it might leak information (that might not be available otherwise) about the user to the attacker. To prevent these kinds of attacks, redirection based on unauthenticated IDs should be avoided and should be done only after the client has also authenticated itself.",
      "ja": "VPNクライアントのふりをアクティブに攻撃者は、実際のユーザーがリダイレクトされた先のゲートウェイの情報を得ることができたときに、ユーザーに関する情報を漏れる可能性があるクライアントから認証されていないアイデンティティに基づいてリダイレクトします。リダイレクトがユーザーのいくつかの内部情報に基づいている場合、それは攻撃者にユーザーに関する（そうでなければ利用できない場合があります）情報を漏らす可能性があります。攻撃のこれらの種類を防ぐために、認証されていないIDに基づいてリダイレクトは避けるべきであると、クライアントはそれ自体を認証した後にのみ行われるべきです。"
    },
    {
      "indent": 0,
      "text": "12. IANA Considerations",
      "section_title": true,
      "ja": "12. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document defines three new IKEv2 Notify Message Types, as described in Section 9. The three Notify Message Types have been assigned the following values:",
      "ja": "この文書では、9章で説明したように、3つの新しいIKEv2のは、メッセージタイプを通知定義3通知し、以下の値が割り当てられているメッセージタイプ："
    },
    {
      "indent": 6,
      "text": "16406 - REDIRECT_SUPPORTED",
      "ja": "16406  -  REDIRECT_SUPPORTED"
    },
    {
      "indent": 6,
      "text": "16407 - REDIRECT",
      "ja": "16407  -  REDIRECT"
    },
    {
      "indent": 6,
      "text": "16408 - REDIRECTED_FROM",
      "ja": "16408  -  REDIRECTED_FROM"
    },
    {
      "indent": 3,
      "text": "This document creates a new namespace called the \"Gateway Identity Type\". This is used to indicate the type of information regarding the VPN gateway that is carried in the REDIRECT (Section 9.2) and REDIRECTED_FROM (Section 9.3) Notify payloads. The following values have been assigned.",
      "ja": "この文書では、「ゲートウェイアイデンティティタイプ」と呼ばれる新しい名前空間を作成します。これはREDIRECT（セクション9.2）とREDIRECTED_FROM（セクション9.3）のペイロードを通知で運ばれるVPNゲートウェイに関する情報のタイプを示すために使用されます。次の値が割り当てられています。"
    },
    {
      "indent": 6,
      "text": "1 - IPv4 address of the VPN gateway",
      "ja": "1  -  VPNゲートウェイのIPv4アドレス"
    },
    {
      "indent": 6,
      "text": "2 - IPv6 address of the VPN gateway",
      "ja": "2  -  VPNゲートウェイのIPv6アドレス"
    },
    {
      "indent": 6,
      "text": "3 - FQDN of the VPN gateway",
      "ja": "3  -  VPNゲートウェイのFQDN"
    },
    {
      "indent": 3,
      "text": "Value '0' is reserved. Values 4-240 are unassigned. New values can be allocated by Expert Review [8]. Values 241-255 are set aside for private use. A specification that extends this registry MUST also mention which of the new values are valid in which Notify payload.",
      "ja": "値「0」が予約されています。値4-240は割り当てられていません。新しい値は、専門家レビュー[8]で割り当てることができます。値241-255は、私的使用のために確保されています。このレジストリを拡張仕様では、ペイロードを通知する有効な新しい値のどの言及する必要があります。"
    },
    {
      "indent": 0,
      "text": "13. Acknowledgements",
      "section_title": true,
      "ja": "13.謝辞"
    },
    {
      "indent": 3,
      "text": "The use of anycast addresses with IKEv2 was first proposed by K. Weniger and F. Dupont in the context of home agent assignment in Mobile IPv6 / Network Mobility (NEMO) bootstrapping. It was then added to an early version of [4] and later removed before the RFC was published. The authors of RFC 5026 are acknowledged.",
      "ja": "IKEv2とエニーキャストアドレスの使用は、最初のモバイルIPv6 /ネットワークモビリティ（NEMO）ブートストラップにおけるホームエージェントの割り当ての文脈においてK. Weniger及びF.デュポン社によって提案されました。 RFCが発行された前に、それを次に、[4]と後で除去の初期のバージョンに追加されました。 RFC 5026の作者は認めています。"
    },
    {
      "indent": 3,
      "text": "Thanks to Pasi Eronen, with whom the solution described in this document was extensively discussed. Thanks to Tero Kivinen for suggesting the use of the REDIRECTED_FROM payload and other comments that helped improve the document. The authors would also like to thank Yaron Sheffer, Sunil Kumar, Fan Zhao, Yoav Nir, Richard Graveman, Kanagavel Rajan, Srini Addepalli, Raj Singh, and Arnaud Ebalard for their reviews and comments.",
      "ja": "パシEronenのおかげで、誰と、この文書で説明するソリューションを幅広く議論されました。文書を改善する助けREDIRECTED_FROMペイロードや他のコメントの使用を示唆ためTERO Kivinenに感謝します。著者はまた、彼らのレビューとコメントのためにヤロンシェファー、スニル・クマール、ファン趙、ヨアフニール、リチャードGraveman、Kanagavelラジャン、Srini Addepalli、ラジ・シン、およびアルノーEbalardに感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "14. References",
      "section_title": true,
      "ja": "14.参考文献"
    },
    {
      "indent": 0,
      "text": "14.1. Normative References",
      "section_title": true,
      "ja": "14.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[1] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[1]ブラドナーのは、S.は、BCP 14、RFC 2119、1997年3月の \"RFCsにおける使用のためのレベルを示すために\"。"
    },
    {
      "indent": 3,
      "text": "[2] Kaufman, C., \"Internet Key Exchange (IKEv2) Protocol\", RFC 4306, December 2005.",
      "ja": "[2]カウフマン、C.、 \"インターネットキーエクスチェンジ（IKEv2の）プロトコル\"、RFC 4306、2005年12月。"
    },
    {
      "indent": 0,
      "text": "14.2. Informative References",
      "section_title": true,
      "ja": "14.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[3] Johnson, D., Perkins, C., and J. Arkko, \"Mobility Support in IPv6\", RFC 3775, June 2004.",
      "ja": "[3]ジョンソン、D.、パーキンス、C.、およびJ. Arkko、 \"IPv6におけるモビリティサポート\"、RFC 3775、2004年6月。"
    },
    {
      "indent": 3,
      "text": "[4] Giaretta, G., Kempf, J., and V. Devarapalli, \"Mobile IPv6 Bootstrapping in Split Scenario\", RFC 5026, October 2007.",
      "ja": "[4] Giaretta、G.、ケンプ、J.、およびV. Devarapalli、 \"分割シナリオにおけるモバイルIPv6ブートストラップ\"、RFC 5026、2007年10月。"
    },
    {
      "indent": 3,
      "text": "[5] Haley, B., Devarapalli, V., Deng, H., and J. Kempf, \"Mobility Header Home Agent Switch Message\", RFC 5142, January 2008.",
      "ja": "[5]ヘイリー、B.、Devarapalli、V.、鄧小平、H.、およびJ.ケンプ、 \"モビリティヘッダホーム・エージェント・スイッチ・メッセージ\"、RFC 5142、2008年1月。"
    },
    {
      "indent": 3,
      "text": "[6] Eronen, P. and J. Korhonen, \"Multiple Authentication Exchanges in the Internet Key Exchange (IKEv2) Protocol\", RFC 4739, November 2006.",
      "ja": "[6] Eronen、P.およびJ. Korhonen、 \"インターネットキーエクスチェンジ（IKEv2の）プロトコルで複数の認証交換\"、RFC 4739、2006年11月。"
    },
    {
      "indent": 3,
      "text": "[7] Kent, S. and K. Seo, \"Security Architecture for the Internet Protocol\", RFC 4301, December 2005.",
      "ja": "[7]ケント、S.とK. Seo、 \"インターネットプロトコルのためのセキュリティアーキテクチャ\"、RFC 4301、2005年12月。"
    },
    {
      "indent": 3,
      "text": "[8] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 5226, May 2008.",
      "ja": "[8] Narten氏、T.とH. Alvestrand、 \"RFCsにIANA問題部に書くためのガイドライン\"、BCP 26、RFC 5226、2008年5月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Vijay Devarapalli WiChorus 3590 North First St San Jose, CA 95134 USA",
      "ja": "勝利Devraplli Vicorus 3590北まず聖サンノゼ、95134それ"
    },
    {
      "indent": 3,
      "text": "EMail: vijay@wichorus.com",
      "ja": "メールアドレス：vijay@wichorus.com"
    },
    {
      "indent": 3,
      "text": "Kilian Weniger Unaffiliated",
      "ja": "キリアン少ない無所属"
    },
    {
      "indent": 3,
      "text": "EMail: kilian.weniger@googlemail.com",
      "ja": "メールアドレス：kilian.weniger@googlemail.com"
    }
  ]
}