{
  "title": {
    "text": "RFC 5641 - Layer 2 Tunneling Protocol Version 3 (L2TPv3) Extended Circuit Status Values",
    "ja": "RFC 5641 - レイヤー2トンネルプロトコルバージョン3（L2TPV3）拡張回路ステータス値"
  },
  "number": 5641,
  "created_at": "2023-02-24 07:17:45.918856+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                          N. McGill\nRequest for Comments: 5641                                  C. Pignataro\nUpdates: 3931, 4349, 4454, 4591, 4719                      Cisco Systems\nCategory: Standards Track                                    August 2009",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 13,
      "text": "Layer 2 Tunneling Protocol Version 3 (L2TPv3) Extended Circuit Status Values",
      "ja": "レイヤー2トンネルプロトコルバージョン3（L2TPV3）拡張回路ステータス値"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document defines additional Layer 2 Tunneling Protocol Version 3 (L2TPv3) bit values to be used within the \"Circuit Status\" Attribute Value Pair (AVP) to communicate finer-grained error states for Attachment Circuits (ACs) and pseudowires (PWs). It also generalizes the Active bit and deprecates the use of the New bit in the Circuit Status AVP, updating RFC 3931, RFC 4349, RFC 4454, RFC 4591, and RFC 4719.",
      "ja": "このドキュメントでは、追加のレイヤー2トンネルプロトコルバージョン3（L2TPV3）ビット値を「回路ステータス」属性値ペア（AVP）内で使用して、アタッチメントサーキット（ACS）および擬似ワイヤ（PWS）の細かいエラー状態を通知します。また、アクティブなビットを一般化し、回路ステータスAVPでの新しいビットの使用を非難し、RFC 3931、RFC 4349、RFC 4454、RFC 4591、およびRFC 4719を更新します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "このドキュメントは、インターネットコミュニティのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態とステータスについては、「インターネット公式プロトコル標準」（STD 1）の現在のエディションを参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2009 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2009 IETF Trustおよび文書著者として特定された人。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents in effect on the date of publication of this document (http://trustee.ietf.org/license-info). Please review these documents carefully, as they describe your rights and restrictions with respect to this document.",
      "ja": "このドキュメントは、BCP 78およびこのドキュメントの公開日（http://trustee.ietf.org/license-info）に有効なIETFドキュメントに関連するIETF Trustの法的規定の対象となります。この文書に関するあなたの権利と制限を説明するので、これらの文書を注意深く確認してください。"
    },
    {
      "indent": 3,
      "text": "This document may contain material from IETF Documents or IETF Contributions published or made publicly available before November 10, 2008. The person(s) controlling the copyright in some of this material may not have granted the IETF Trust the right to allow modifications of such material outside the IETF Standards Process. Without obtaining an adequate license from the person(s) controlling the copyright in such materials, this document may not be modified outside the IETF Standards Process, and derivative works of it may not be created outside the IETF Standards Process, except to format it for publication as an RFC or to translate it into languages other than English.",
      "ja": "このドキュメントには、2008年11月10日までに公開または公開されたIETFドキュメントまたはIETFの寄付からの資料が含まれている場合があります。IETF標準プロセスの外。そのような資料の著作権を制御する人から適切なライセンスを取得せずに、このドキュメントはIETF標準プロセスの外側に変更されない場合があり、その派生作業は、ITF標準プロセスの外側で作成されない場合があります。RFCとしての出版またはそれを英語以外の言語に翻訳するため。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  2\n  1.1.  Specification of Requirements  . . . . . . . . . . . . . .  2\n  1.2.  Abbreviations  . . . . . . . . . . . . . . . . . . . . . .  3\n2.  L2TPv3 Extended Circuit Status Values  . . . . . . . . . . . .  3\n3.  Circuit Status Usage and Clarifications  . . . . . . . . . . .  7\n4.  Updates to Existing RFCs . . . . . . . . . . . . . . . . . . .  8\n5.  Security Considerations  . . . . . . . . . . . . . . . . . . .  9\n6.  IANA Considerations  . . . . . . . . . . . . . . . . . . . . .  9\n7.  Acknowledgements . . . . . . . . . . . . . . . . . . . . . . .  9\n8.  References . . . . . . . . . . . . . . . . . . . . . . . . . .  9\n  8.1.  Normative References . . . . . . . . . . . . . . . . . . .  9\n  8.2.  Informative References . . . . . . . . . . . . . . . . . . 10",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "Currently, the L2TPv3 Circuit Status AVP [RFC3931] is able to convey the UP/DOWN status of an access circuit. However, a finer granularity is often useful to determine the direction of the fault, as has been added for MPLS-based pseudowires and is used in the pseudowire control protocol using the Label Distribution Protocol (LDP); see Section 3.5 of [RFC4446] and Section 5.4.2 of [RFC4447].",
      "ja": "現在、L2TPV3回路ステータスAVP [RFC3931]は、アクセス回路のアップ/ダウンステータスを伝達できます。ただし、MPLSベースの擬似動物に追加されており、ラベル分布プロトコル（LDP）を使用して擬似ワイヤー制御プロトコルで使用されているように、断層の方向を決定するのに細かい粒度性がよく役立ちます。[RFC446]のセクション3.5および[RFC447]のセクション5.4.2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Additionally, it is useful (in session-level redundancy scenarios) to be able to indicate if a pseudowire is in a standby state, where it is fully established by signaling and allows Operations, Administration, and Maintenance, but is not switching data. Again, such functionality is available for MPLS-based pseudowires using LDP, see [PREF-FWD].",
      "ja": "さらに、（セッションレベルの冗長シナリオ）、擬似ワイヤーがシグナリングによって完全に確立され、運用、管理、メンテナンスを許可するがデータの切り替えによって完全に確立されているかどうかを示すことができるのは有用です（セッションレベルの冗長シナリオ）。繰り返しますが、このような機能は、LDPを使用したMPLSベースの擬似動物で利用できます。[Pref-FWD]を参照してください。"
    },
    {
      "indent": 3,
      "text": "This document provides extended circuit status bit values for L2TPv3 and adds them in a manner such that it is backwards compatible with the current Circuit Status AVP. These new bits are applicable to all pseudowire types that use the Circuit Status AVP.",
      "ja": "このドキュメントは、L2TPV3の拡張回路ステータスビット値を提供し、現在の回路ステータスAVPと逆方向に互換性があるようにそれらを追加します。これらの新しいビットは、回路ステータスAVPを使用するすべての擬似型タイプに適用できます。"
    },
    {
      "indent": 0,
      "text": "1.1. Specification of Requirements",
      "section_title": true,
      "ja": "1.1. 要件の仕様"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "「必須」、「そうしない」、「必須」、「必要」、「しない」、「そうしない」、「そうではない」、「そうでない」、「推奨」、「5月」、および「オプション」は、[RFC2119]に記載されているように解釈される。"
    },
    {
      "indent": 0,
      "text": "1.2. Abbreviations",
      "section_title": true,
      "ja": "1.2. 略語"
    },
    {
      "indent": 3,
      "text": "The following abbreviations are used in this document and in the documents that it updates. L2TPv3 Control Message Types are listed in Section 6 of [RFC3931].",
      "ja": "次の略語は、このドキュメントとそれが更新するドキュメントで使用されています。L2TPV3コントロールメッセージタイプは、[RFC3931]のセクション6にリストされています。"
    },
    {
      "indent": 5,
      "text": "AC Attachment Circuit AVP Attribute Value Pair LCCE L2TP Control Connection Endpoint NNI Network-Network Interface PE Provider Edge PSN Packet Switched Network PW Pseudowire",
      "ja": "ACアタッチメント回路AVP属性値ペアLCCE L2TPコントロール接続エンドポイントNNIネットワークネットワークインターフェイスPEプロバイダーEDGE PSNパケットスイッチネットワークPW PSEUDOWIRE"
    },
    {
      "indent": 0,
      "text": "2. L2TPv3 Extended Circuit Status Values",
      "section_title": true,
      "ja": "2. L2TPV3拡張回路ステータス値"
    },
    {
      "indent": 3,
      "text": "The Circuit Status AVP (ICRQ, ICRP, ICCN, OCRQ, OCRP, OCCN, SLI), Attribute Type 71, indicates the initial status of, or a status change in, the circuit to which the session is bound.",
      "ja": "回路ステータスAVP（ICRQ、ICRP、ICCN、OCRQ、OCRP、OCCN、SLI）、属性タイプ71は、セッションがバインドされる回路の初期ステータスまたはステータスの変更を示します。"
    },
    {
      "indent": 3,
      "text": "The Attribute Value field for this AVP, currently defined in [RFC3931], has the following format:",
      "ja": "現在[RFC3931]で定義されているこのAVPの属性値フィールドには、次の形式があります。"
    },
    {
      "indent": 5,
      "text": " 0                   1\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         Reserved          |N|A|\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 5,
      "text": "Bit  Bit-Value   Name\n----------------------------------------------------------------\n(A)  15  0x0001  Active\n(N)  14  0x0002  New",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "As currently defined in [RFC3931] and replicated in [RFC4349], [RFC4454], [RFC4591], and [RFC4719], the two bits have the following meanings:",
      "ja": "現在[RFC3931]で定義されており、[RFC4349]、[RFC4454]、[RFC4591]、および[RFC4719]で複製されているように、2つのビットには次の意味があります。"
    },
    {
      "indent": 3,
      "text": "o The A (Active) bit indicates whether the circuit is up/active/ ready (1) or down/inactive/not-ready (0).",
      "ja": "o A（アクティブ）ビットは、回路がアップ/アクティブ/準備ができている（1）か、ダウン/非アクティブ/非対応（0）かを示します。"
    },
    {
      "indent": 3,
      "text": "o The N (New) bit indicates whether the circuit status indication is for a new circuit (1) or an existing circuit (0).",
      "ja": "o n（新しい）ビットは、回路ステータス表示が新しい回路（1）または既存の回路（0）のかどうかを示します。"
    },
    {
      "indent": 3,
      "text": "This document updates the semantics of the A and N bits as follows (see also Section 4): The A (Active) bit indicates whether the local pseudowire endpoint (including the local Attachment Circuit (AC) and local Packet Switched Network (PSN)-facing pseudowire termination) has no faults present and is up/active/ready (1) or has faults present and is down/ inactive/not-ready (0).",
      "ja": "このドキュメントは、次のようにAとNビットのセマンティクスを更新します（セクション4も参照）：A（Active）ビットは、ローカルな擬似ワイヤエンドポイント（ローカルアタッチメント回路（AC）とローカルパケットスイッチドットネットワーク（PSN）を含むかどうかを示します。擬似力の終了に直面する）障害が存在せず、アップ/アクティブ/準備ができている（1）、または障害が存在し、ダウン/非アクティブ/非準備（0）です。"
    },
    {
      "indent": 3,
      "text": "The N (New) bit indicates if the notification is for a new circuit (1) or an existing circuit (0), and is provided to emulate Network-Network Interface (NNI) signaling between Provider Edge (PE) routers, e.g., Frame Relay NNI. It MAY be used to convey that a circuit has been re-provisioned or newly provisioned at the PE, which can already be inferred from the L2TP control message type. It is therefore uncertain as to what use the receiving PE can make of this bit, although it MAY include logging. This document deprecates this bit as it is of little or no use, hence this bit SHOULD be ignored on receipt and is OPTIONAL to set on sending. For reference, see Section 3.4 of [RFC4591], which does not specify any additional usage beyond the setting of the N bit in the ICRQ, ICRP (and OCRQ, OCRP) and the clearing of it in all other control messages.",
      "ja": "N（新しい）ビットは、通知が新しい回路（1）または既存の回路（0）のかどうかを示し、プロバイダーエッジ（PE）ルーターの間のネットワークネットワークインターフェイス（NNI）シグナル伝達をエミュレートするために提供されています。リレーnni。回路がPEで再構成または新しくプロビジョニングされていることを伝えるために使用される場合があります。これは、L2TPコントロールメッセージタイプからすでに推測できます。したがって、ロギングが含まれる場合がありますが、受信PEがこのビットを使用できるものについては不確かです。このドキュメントは、このビットがほとんどまたはまったく役に立たないため、このビットを非難します。したがって、このビットは受領時に無視され、送信時に設定することがオプションです。参照については、[RFC4591]のセクション3.4を参照してください。これは、ICRQ、ICRP（およびOCRQ、OCRP）のnビットの設定を超えて追加の使用法を指定し、他のすべての制御メッセージでそれをクリアすることを指定していません。"
    },
    {
      "indent": 3,
      "text": "This document also extends this bitmap of values to allow for finer granularity of local pseudowire (i.e., Attachment Circuit or PSN-facing endpoint) status reporting.",
      "ja": "また、このドキュメントは、この値のビットマップを拡張して、ローカルな擬似ワイヤ（つまり、アタッチメント回路またはPSNに向かうエンドポイント）ステータスレポートのより細かい粒度を可能にします。"
    },
    {
      "indent": 3,
      "text": "The Attribute Value field for the Circuit Status AVP, including the new values, has the following format:",
      "ja": "新しい値を含む回路ステータスAVPの属性値フィールドには、次の形式があります。"
    },
    {
      "indent": 5,
      "text": " 0                   1\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Reserved    |S|E|I|T|R|N|A|\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 5,
      "text": "Bit  Bit-Value   Name\n-----------------------------------------------------------------\n(A)  15  0x0001  Active: Pseudowire has no faults\n(N)  14  0x0002  New [use deprecated]\n(R)  13  0x0004  Local Attachment Circuit (ingress) Receive Fault\n(T)  12  0x0008  Local Attachment Circuit (egress) Transmit Fault\n(I)  11  0x0010  Local PSN-facing PW (ingress) Receive Fault\n(E)  10  0x0020  Local PSN-facing PW (egress) Transmit Fault\n(S)   9  0x0040  Pseudowire is in Standby mode",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The new bit values have the following meanings: (R), Local Attachment Circuit (ingress) Receive Fault",
      "ja": "新しいビット値には次の意味があります：（r）、ローカルアタッチメント回路（侵入）が障害を受け取ります"
    },
    {
      "indent": 4,
      "text": "Fault Here\n     |\n     |\n     |   +----------------------+         +----------------------+\n     | Rx|         LCCE         |Egress   |       Peer LCCE      |\n   --X-->|                      |-------->|                      |\n         |             L2TPv3   |  [PSN]  |   L2TPv3             |\n       Tx| Circuit   Pseudowire |Ingress  | Pseudowire   Circuit |\n   <-----|                      |<--------|                      |\n         +----------------------+         +----------------------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "An alarm or fault has occurred at the local Attachment Circuit such that it is unable to receive traffic. It can still transmit traffic.",
      "ja": "ローカルアタッチメント回路でアラームまたは障害が発生し、トラフィックを受信できないようにします。それでもトラフィックを送信できます。"
    },
    {
      "indent": 3,
      "text": "(T), Local Attachment Circuit (egress) Transmit Fault",
      "ja": "（t）、ローカルアタッチメント回路（出口）障害を送信"
    },
    {
      "indent": 5,
      "text": "        +----------------------+         +----------------------+\n      Rx|         LCCE         |Egress   |       Peer LCCE      |\n  ----->|                      |-------->|                      |\n        |             L2TPv3   |  [PSN]  |   L2TPv3             |\n      Tx| Circuit   Pseudowire |Ingress  | Pseudowire   Circuit |\n  <--X--|                      |<--------|                      |\n     |  +----------------------+         +----------------------+\n     |\n     |\nFault Here",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "A fault has occurred at the local Attachment Circuit such that it is unable to transmit traffic. It can still receive traffic.",
      "ja": "ローカルアタッチメント回路で障害が発生しており、トラフィックを送信できないようにしています。それでもトラフィックを受けることができます。"
    },
    {
      "indent": 3,
      "text": "(I), Local PSN-facing PW (ingress) Receive Fault",
      "ja": "（i）、ローカルPSNに面したPW（イングレス）障害を受け取る"
    },
    {
      "indent": 7,
      "text": "      +----------------------+         +----------------------+\n    Rx|         LCCE         |Egress   |       Peer LCCE      |\n----->|                      |-------->|                      |\n      |             L2TPv3   |  [PSN]  |   L2TPv3             |\n    Tx| Circuit   Pseudowire |Ingress  | Pseudowire   Circuit |\n<-----|                      |<---X----|                      |\n      +----------------------+    |    +----------------------+\n                                  |\n                                  |\n                             Fault Here",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "A fault has occurred in the receive direction between the local endpoint and the remote L2TP endpoint.",
      "ja": "ローカルエンドポイントとリモートL2TPエンドポイントの間の受信方向に障害が発生しています。"
    },
    {
      "indent": 6,
      "text": "Note that a fault at the session level would not necessarily trigger an L2TP control connection timeout. The means of detecting this fault are outside the scope of this document; as an example, detection may be via PW Type-specific means, Bidirectional Forwarding Detection (BFD), or other methods.",
      "ja": "セッションレベルでの障害は、必ずしもL2TP制御接続タイムアウトをトリガーしないことに注意してください。この障害を検出する手段は、この文書の範囲外です。例として、検出は、PWタイプ固有の平均、双方向転送検出（BFD）、またはその他の方法を介して行われる場合があります。"
    },
    {
      "indent": 3,
      "text": "(E), Local PSN-facing PW (egress) Transmit Fault",
      "ja": "（e）、ローカルPSNに直面するPW（出口）障害"
    },
    {
      "indent": 7,
      "text": "                               Fault Here\n                                    |\n                                    |\n      +----------------------+      |  +----------------------+\n    Rx|         LCCE         |Egress|  |       Peer LCCE      |\n----->|                      |------X->|                      |\n      |             L2TPv3   |  [PSN]  |   L2TPv3             |\n    Tx| Circuit   Pseudowire |Ingress  | Pseudowire   Circuit |\n<-----|                      |<--------|                      |\n      +----------------------+         +----------------------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "A fault has occurred in the transmit direction between the local endpoint and the remote L2TP endpoint.",
      "ja": "ローカルエンドポイントとリモートL2TPエンドポイントの間の送信方向に障害が発生しています。"
    },
    {
      "indent": 6,
      "text": "Note that a fault at the session level would not necessarily trigger an L2TP control connection timeout. The means of detecting this fault are outside the scope of this document; as an example, detection may be via PW Type-specific means, BFD, or other methods.",
      "ja": "セッションレベルでの障害は、必ずしもL2TP制御接続タイムアウトをトリガーしないことに注意してください。この障害を検出する手段は、この文書の範囲外です。例として、検出はPWタイプ固有の平均、BFD、またはその他の方法を介して行われる場合があります。"
    },
    {
      "indent": 3,
      "text": "(S), Pseudowire is in Standby mode",
      "ja": "（s）、Pseudowireはスタンバイモードです"
    },
    {
      "indent": 7,
      "text": "                               Standby\n                                 |\n                                 |\n      +----------------------+   |     +----------------------+\n    Rx|         LCCE         |Egress   |       Peer LCCE      |\n----->|                      |---X---->|                      |\n      |             L2TPv3   |  [PSN]  |   L2TPv3             |\n    Tx| Circuit   Pseudowire |Ingress  | Pseudowire   Circuit |\n<-----|                      |<--X-----|                      |\n      +----------------------+   |     +----------------------+\n                                 |\n                                 |\n                               Standby",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "The pseudowire has been placed into a Standby mode, which means that although it was signaled (during setup of the PW) and is operational, it is NOT switching user traffic. Any received user traffic SHOULD be dropped. User traffic MUST NOT be transmitted.",
      "ja": "擬似ワイヤはスタンバイモードに配置されています。つまり、合図されていますが（PWのセットアップ中）、動作しているが、ユーザートラフィックの切り替えではないことを意味します。受け取ったユーザートラフィックはすべて削除する必要があります。ユーザートラフィックを送信してはなりません。"
    },
    {
      "indent": 6,
      "text": "A standby pseudowire also allows for means to check its data plane liveness in order to ensure its ability to switch data packets end-to-end. This is achieved, for example, as detailed in [RFC5085] or [VCCV-BFD]. However, data is not forwarded from an Attachment Circuit (AC) into the L2TPv3 session, or from the L2TPv3 session out to the AC.",
      "ja": "また、スタンバイの擬似ワイヤは、データパケットをエンドツーエンドに切り替える能力を確保するために、データプレーンの活性をチェックする手段も可能にします。これは、たとえば、[RFC5085]または[VCCV-BFD]で詳述されているように達成されます。ただし、データは、アタッチメント回路（AC）からL2TPV3セッションに、またはL2TPV3セッションからACに転送されません。"
    },
    {
      "indent": 0,
      "text": "3. Circuit Status Usage and Clarifications",
      "section_title": true,
      "ja": "3. 回路ステータスの使用と説明"
    },
    {
      "indent": 3,
      "text": "In implementations prior to this specification, bits 0-13 MUST be set to zero (see Section 5.4.5 of [RFC3931]). This allows for legacy implementations to interwork properly with new implementations.",
      "ja": "この仕様の前の実装では、ビット0-13をゼロに設定する必要があります（[RFC3931]のセクション5.4.5を参照）。これにより、レガシーの実装が新しい実装と適切にインターワークできるようになります。"
    },
    {
      "indent": 3,
      "text": "The following are clarifications regarding the usage of the Circuit Status AVP bits as defined in this specification:",
      "ja": "以下は、この仕様で定義されている回路ステータスAVPビットの使用に関する説明です。"
    },
    {
      "indent": 3,
      "text": "o The (R), (T), (I), and (E) bits are collectively referred to as \"fault status bits\".",
      "ja": "o （r）、（t）、（i）、および（e）ビットは、集合的に「障害ステータスビット」と呼ばれます。"
    },
    {
      "indent": 3,
      "text": "o [RFC3931] defined the (A) bit as pertaining to local access circuit state only. This document redefines it as meaning that \"no faults are present on the local pseudowire endpoint.\"",
      "ja": "o [RFC3931]は、（a）ビットをローカルアクセス回路状態のみに関連するものとして定義しました。このドキュメントは、「地元の擬似ワイヤのエンドポイントに障害が存在しない」という意味としてそれを再定義します。"
    },
    {
      "indent": 3,
      "text": "o If multiple faults occur, all the fault status bits corresponding to each fault MUST be set (i.e., they MUST be bitwise ORed together).",
      "ja": "o 複数の障害が発生した場合、各障害に対応するすべての障害ステータスビットを設定する必要があります（つまり、それらは一緒にビットごとに並べなければなりません）。"
    },
    {
      "indent": 3,
      "text": "o The (A) bit MUST NOT be set until all fault status bits are cleared. This behavior allows an endpoint to be backwards compatible with a remote endpoint that does not understand these new status bits.",
      "ja": "o （a）ビットは、すべての障害ステータスビットがクリアされるまで設定しないでください。この動作により、エンドポイントは、これらの新しいステータスビットを理解していないリモートエンドポイントとの逆方向に互換性があります。"
    },
    {
      "indent": 3,
      "text": "o If any of the fault status bits are set, then the (A) bit MUST be cleared. That is, the fault status bits (R, T, I, E) are a more granular definition of (A), such that ORing the bits provides an inverted (A).",
      "ja": "o 障害ステータスビットのいずれかが設定されている場合、（a）ビットをクリアする必要があります。つまり、障害ステータスビット（r、t、i、e）は（a）のより細い定義であり、ビットの輪が逆（a）を提供するようにします。"
    },
    {
      "indent": 3,
      "text": "o If (A) is clear and the fault status bits (R, T, I, E) are clear, it means that there is no extended circuit status. That is, the circuit is down/inactive/not-ready (from the (A) bit), without a more granular (extended) indication.",
      "ja": "o （a）が明確で、障害ステータスビット（r、t、i、e）が明確である場合、拡張回路ステータスがないことを意味します。つまり、回路は、より粒状（拡張）を示すことなく、（（a）ビットから）ダウン/非アクティブ/非対応です。"
    },
    {
      "indent": 3,
      "text": "o The (S) bit can be set in conjunction with any other bit, including (A). A pseudowire endpoint in Standby (S bit set) can be up/active/ready (A bit set) or experiencing a fault (A bit cleared and one or more of the fault status bits (R, T, I, E) set.",
      "ja": "o （s）ビットは、（a）を含む他のビットと組み合わせて設定できます。スタンバイ（Sビットセット）の偽のエンドポイントは、アップ/アクティブ/準備ができている（ビットセット）または障害（少しクリアされ、1つ以上の障害ステータスビット（r、t、i、e）セット）を経験することができます。"
    },
    {
      "indent": 3,
      "text": "o Leaving Standby mode is indicated by the clearing of the (S) bit.",
      "ja": "o スタンバイモードを離れることは、（s）ビットのクリアによって示されます。"
    },
    {
      "indent": 3,
      "text": "o The usage of the (N) bit has been deprecated.",
      "ja": "o （n）ビットの使用法は非推奨されています。"
    },
    {
      "indent": 0,
      "text": "4. Updates to Existing RFCs",
      "section_title": true,
      "ja": "4. 既存のRFCの更新"
    },
    {
      "indent": 3,
      "text": "This document updates existing RFCs that define (either generically or in the context of a specific set of PW Types) the Active and New bits of the Circuit Status AVP. The Active and New bits of the Circuit Status AVP are specified in Section 5.4.5 of [RFC3931]. Those definitions are adapted to specific Attachment Circuits and replicated in Section 3.4 of [RFC4349] (High-Level Data Link Control Frames over L2TPv3), Section 8 of [RFC4454] (Asynchronous Transfer Mode over L2TPv3), Section 3.4 of [RFC4591] (Frame Relay over L2TPv3), and Section 2.3.3 of [RFC4719] (Ethernet Frames over L2TPv3). This document updates the definitions in all five of these references to say:",
      "ja": "このドキュメントは、回路ステータスAVPのアクティブおよび新しいビットを（一般的または特定のPWタイプのセットのコンテキストで）定義する既存のRFCを更新します。回路ステータスAVPのアクティブおよび新しいビットは、[RFC3931]のセクション5.4.5で指定されています。これらの定義は、特定のアタッチメント回路に適合しており、[RFC4349]のセクション3.4（L2TPV3の高レベルデータリンク制御フレーム）、[RFC4454]のセクション8（L2TPV3上の非同期転送モード）、[RFC4591]のセクション3.4で再現されています。[RFC4719]のセクション2.3.3（L2TPV3を超えるイーサネットフレーム）を介したフレームリレー。このドキュメントは、これらの5つの参照すべての定義を更新します。"
    },
    {
      "indent": 6,
      "text": "The A (Active) bit indicates whether the local pseudowire endpoint (including the local Attachment Circuit and local PSN-facing pseudowire termination) has no faults present and is up/active/ ready (1) or has faults present and is down/inactive/not-ready (0).",
      "ja": "A（アクティブ）ビットは、ローカルの擬似ワイヤのエンドポイント（ローカルアタッチメント回路とローカルPSNに直面する擬似ワイヤー終了を含む）が障害を持たず、アップ/アクティブ/準備ができている（1）か、障害が存在し、ダウン/非アクティブ/準備ができていない（0）。"
    },
    {
      "indent": 6,
      "text": "The N (New) bit usage is deprecated; it SHOULD be ignored on receipt and is OPTIONAL to set on sending.",
      "ja": "N（新しい）ビットの使用法は非推奨です。受信時に無視する必要があり、送信時に設定することがオプションです。"
    },
    {
      "indent": 3,
      "text": "This document also updates Section 2.2 (bullet c) of [RFC4719], removing the following two sentences:",
      "ja": "このドキュメントは、[RFC4719]のセクション2.2（弾丸C）を更新し、次の2つの文を削除します。"
    },
    {
      "indent": 6,
      "text": "For ICRQ and ICRP, the Circuit Status AVP MUST indicate that the circuit status is for a new circuit (refer to N bit in Section 2.3.3).",
      "ja": "ICRQおよびICRPの場合、回路ステータスAVPは、回路ステータスが新しい回路用であることを示す必要があります（セクション2.3.3のNビットを参照）。"
    },
    {
      "indent": 6,
      "text": "For ICCN and SLI (refer to Section 2.3.2), the Circuit Status AVP MUST indicate that the circuit status is for an existing circuit (refer to N bit in Section 2.3.3) and reflect the current status of the link (refer to A bit in Section 2.3.3).",
      "ja": "ICCNおよびSLI（セクション2.3.2を参照）の場合、回路ステータスAVPは、回路ステータスが既存の回路（セクション2.3.3のNビットを参照）のものであることを示し、リンクの現在のステータスを反映する必要があります（参照セクション2.3.3で少し）。"
    },
    {
      "indent": 3,
      "text": "And finally, this document updates Section 3.1 of [RFC4349], Section 3.1 of [RFC4454], Section 3.1 of [RFC4591], and Section 2.2 of [RFC4719] with the following paragraph addition:",
      "ja": "最後に、このドキュメントは、[RFC4349]のセクション3.1、[RFC4454]のセクション3.1、[RFC4591]のセクション3.1、[RFC4719]のセクション2.2を次の段落の追加を更新します。"
    },
    {
      "indent": 6,
      "text": "The usage of the N bit in the Circuit Status AVP is deprecated. Therefore, for ICRQ and ICRP, the Circuit Status AVP need not indicate on sending (nor check on receipt) that the circuit status is for a new circuit, and for ICCN and SLI, the Circuit Status AVP need not indicate on sending (nor check on receipt) that the circuit status is for an existing circuit.",
      "ja": "回路ステータスAVPでのnビットの使用法は非推奨です。したがって、ICRQとICRPの場合、回路ステータスAVPは、回路ステータスが新しい回路用であることを送信時に示す必要はありません。領収書で）回路ステータスは既存の回路用であること。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "Security considerations for the Circuit Status AVP are covered in the base L2TPv3 specification (see Section 8 of [RFC3931]). No additional security considerations exist with extending this attribute.",
      "ja": "回路ステータスAVPのセキュリティに関する考慮事項は、ベースL2TPV3仕様でカバーされています（[RFC3931]のセクション8を参照）。この属性を拡張する際には、追加のセキュリティ上の考慮事項は存在しません。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "The Circuit Status Bits number space [IANA-l2tp] is managed by IANA as per Section 10.7 of [RFC3931]. Five new bits (bits 9 through 13) and one updated bit (bit 14) have been assigned as follows:",
      "ja": "回路ステータスビット数スペース[IANA-L2TP]は、[RFC3931]のセクション10.7に従ってIANAによって管理されます。5つの新しいビット（ビット9〜13）と1つの更新ビット（ビット14）が次のように割り当てられています。"
    },
    {
      "indent": 3,
      "text": "Circuit Status Bits - per [RFC3931]\n-------------------",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Bit 9 - S (Standby) bit Bit 10 - E (Local PSN-facing PW (egress) Tx Fault) bit Bit 11 - I (Local PSN-facing PW (ingress) Rx Fault) bit Bit 12 - T (Local AC (egress) Tx Fault) bit Bit 13 - R (Local AC (ingress) Rx Fault) bit Bit 14 - N (New) bit [use deprecated]",
      "ja": "ビット9 -S（スタンバイ）ビット10 -E（ローカルPSNに面したPW（出口）TX障害）ビット11 -I（ローカルPSN直面PW（イングレス）RX障害）ビット12 -T（ローカルAC（出力）TX障害）ビットビット13 -R（ローカルAC（イングレス）RX障害）ビットビット14 -N（new）ビット[非推奨]"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgements",
      "section_title": true,
      "ja": "7. 謝辞"
    },
    {
      "indent": 3,
      "text": "The authors wish to thank Muhammad Yousuf, Mark Townsley, George Wilkie, Prashant Jhingran, Pawel Sowinski, and Ignacio Goyret for useful comments received.",
      "ja": "著者は、Muhammad Yousuf、Mark Townsley、George Wilkie、Prashant Jhingran、Pawel Sowinski、およびIgnacio Goyretに有用なコメントを受け取ってくれたことに感謝します。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8. 参考文献"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "ja": "8.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119] Bradner、S。、「要件レベルを示すためにRFCで使用するためのキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3931] Lau, J., Townsley, M., and I. Goyret, \"Layer Two Tunneling Protocol - Version 3 (L2TPv3)\", RFC 3931, March 2005.",
      "ja": "[RFC3931] Lau、J.、Townsley、M。、およびI. Goyret、「レイヤー2つのトンネルプロトコル - バージョン3（L2TPV3）」、RFC 3931、2005年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC4349] Pignataro, C. and M. Townsley, \"High-Level Data Link Control (HDLC) Frames over Layer 2 Tunneling Protocol, Version 3 (L2TPv3)\", RFC 4349, February 2006.",
      "ja": "[RFC4349] Pignataro、C。およびM. Townsley、「高レベルのデータリンクコントロール（HDLC）フレームオーバーレイヤー2トンネルプロトコル、バージョン3（L2TPV3）」、RFC 4349、2006年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC4454] Singh, S., Townsley, M., and C. Pignataro, \"Asynchronous Transfer Mode (ATM) over Layer 2 Tunneling Protocol Version 3 (L2TPv3)\", RFC 4454, May 2006.",
      "ja": "[RFC4454] Singh、S.、Townsley、M。、およびC. Pignataro、「非同期転送モード（ATM）層2トンネルプロトコルバージョン3（L2TPV3）、RFC 4454、2006年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC4591] Townsley, M., Wilkie, G., Booth, S., Bryant, S., and J. Lau, \"Frame Relay over Layer 2 Tunneling Protocol Version 3 (L2TPv3)\", RFC 4591, August 2006.",
      "ja": "[RFC4591] Townsley、M.、Wilkie、G.、Booth、S.、Bryant、S.、およびJ. Lau、「Frame Relay Over Layer 2 Tunneling Protocolバージョン3（L2TPV3）」、RFC 4591、2006年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC4719] Aggarwal, R., Townsley, M., and M. Dos Santos, \"Transport of Ethernet Frames over Layer 2 Tunneling Protocol Version 3 (L2TPv3)\", RFC 4719, November 2006.",
      "ja": ""
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "ja": "8.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[IANA-l2tp] Internet Assigned Numbers Authority, \"Layer Two Tunneling Protocol 'L2TP'\", <http://www.iana.org>.",
      "ja": "[IANA-L2TP]インターネットに割り当てられた番号の権限、「レイヤー2トンネリングプロトコル 'L2TP」、<http://www.iana.org>。"
    },
    {
      "indent": 3,
      "text": "[PREF-FWD] Muley, P., Bocci, M., and L. Martini, \"Preferential Forwarding Status bit definition\", Work in Progress, September 2008.",
      "ja": "[Pref-Fwd] Muley、P.、Bocci、M。、およびL. Martini、「優先転送ステータスビット定義」、2008年9月、進行中の作業。"
    },
    {
      "indent": 3,
      "text": "[RFC4446] Martini, L., \"IANA Allocations for Pseudowire Edge to Edge Emulation (PWE3)\", BCP 116, RFC 4446, April 2006.",
      "ja": "[RFC4446] Martini、L。、「Pseudowire Edge to Edge Emulation（PWE3）のIANAの割り当て」、BCP 116、RFC 4446、2006年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC4447] Martini, L., Rosen, E., El-Aawar, N., Smith, T., and G. Heron, \"Pseudowire Setup and Maintenance Using the Label Distribution Protocol (LDP)\", RFC 4447, April 2006.",
      "ja": "[RFC4447] Martini、L.、Rosen、E.、El-Aawar、N.、Smith、T.、およびG. Heron、「ラベル分布プロトコル（LDP）を使用したPseudowireのセットアップとメンテナンス」、RFC 4447、2006年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC5085] Nadeau, T. and C. Pignataro, \"Pseudowire Virtual Circuit Connectivity Verification (VCCV): A Control Channel for Pseudowires\", RFC 5085, December 2007.",
      "ja": "[RFC5085] Nadeau、T。およびC. Pignataro、「Pseudowire仮想回路接続検証（VCCV）：Pseudowiresの制御チャネル」、RFC 5085、2007年12月。"
    },
    {
      "indent": 3,
      "text": "[VCCV-BFD] Nadeau, T. and C. Pignataro, \"Bidirectional Forwarding Detection (BFD) for the Pseudowire Virtual Circuit Connectivity Verification (VCCV)\", Work in Progress, July 2009.",
      "ja": "[VCCV-BFD] Nadeau、T。およびC. Pignataro、「Pseudowire仮想回路接続検証（VCCV）の双方向転送検出（BFD）」、2009年7月の作業。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Neil McGill Cisco Systems 7025-4 Kit Creek Road PO Box 14987 Research Triangle Park, NC 27709 USA",
      "ja": "Neil McGill Cisco Systems 7025-4 Kit Creek Road PO Box 14987 Research Triangle Park、NC 27709 USA"
    },
    {
      "indent": 3,
      "text": "EMail: nmcgill@cisco.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Carlos Pignataro Cisco Systems 7200-12 Kit Creek Road PO Box 14987 Research Triangle Park, NC 27709 USA",
      "ja": "Carlos Pignataro Cisco Systems 7200-12 Kit Creek Road PO Box 14987 Research Triangle Park、NC 27709 USA"
    },
    {
      "indent": 3,
      "text": "EMail: cpignata@cisco.com",
      "raw": true,
      "ja": ""
    }
  ]
}