{
  "title": {
    "text": "RFC 5542 - Definitions of Textual Conventions for Pseudowire (PW) Management",
    "ja": "RFC 5542 - Pseudowire（PW）管理のためのテキストコンベンションの定義"
  },
  "number": 5542,
  "created_at": "2023-03-12 13:17:04.835487+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                     T. Nadeau, Ed.\nRequest for Comments: 5542                                            BT\nCategory: Standards Track                                  D. Zelig, Ed.\n                                                                  Oversi\n                                                        O. Nicklass, Ed.\n                                                               RADVISION\n                                                                May 2009",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Definitions of Textual Conventions for Pseudowire (PW) Management",
      "ja": "Pseudowire（PW）管理のためのテキストコンベンションの定義"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "このドキュメントは、インターネットコミュニティのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態とステータスについては、「インターネット公式プロトコル標準」（STD 1）の現在のエディションを参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2009 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2009 IETF Trustおよび文書著者として特定された人。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents in effect on the date of publication of this document (http://trustee.ietf.org/license-info). Please review these documents carefully, as they describe your rights and restrictions with respect to this document.",
      "ja": "このドキュメントは、BCP 78およびこのドキュメントの公開日（http://trustee.ietf.org/license-info）に有効なIETFドキュメントに関連するIETF Trustの法的規定の対象となります。この文書に関するあなたの権利と制限を説明するので、これらの文書を注意深く確認してください。"
    },
    {
      "indent": 3,
      "text": "This document may contain material from IETF Documents or IETF Contributions published or made publicly available before November 10, 2008. The person(s) controlling the copyright in some of this material may not have granted the IETF Trust the right to allow modifications of such material outside the IETF Standards Process. Without obtaining an adequate license from the person(s) controlling the copyright in such materials, this document may not be modified outside the IETF Standards Process, and derivative works of it may not be created outside the IETF Standards Process, except to format it for publication as an RFC or to translate it into languages other than English.",
      "ja": "このドキュメントには、2008年11月10日までに公開または公開されたIETFドキュメントまたはIETFの貢献からの資料が含まれている場合があります。IETF標準プロセスの外。そのような資料の著作権を制御する人から適切なライセンスを取得しないと、このドキュメントはIETF標準プロセスの外側に変更されない場合があり、その派生作業は、ITF標準プロセスの外側で作成されない場合があります。RFCとしての出版または英語以外の言語に翻訳する。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This memo defines a Management Information Base (MIB) module that contains textual conventions (TCs) to represent commonly used pseudowire (PW) management information. The intent is that these TCs will be imported and used in PW-related MIB modules that would otherwise define their own representations.",
      "ja": "このメモは、一般的に使用される擬似条項（PW）管理情報を表すテキストコンベンション（TCS）を含む管理情報ベース（MIB）モジュールを定義します。意図は、これらのTCがインポートされ、それ以外の場合は独自の表現を定義するPW関連のMIBモジュールで使用されることです。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. The Internet-Standard Management Framework ......................2\n3. Conventions Used in This Document ...............................2\n4. Object Definitions ..............................................3\n5. Security Considerations .........................................9\n6. IANA Considerations .............................................9\n7. References .....................................................10\n   7.1. Normative References ......................................10\n   7.2. Informative References ....................................10",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "This memo defines a portion of the Management Information Base (MIB) for use with network management protocols in the Internet community. In particular, it defines textual conventions used for pseudowire (PW) technology and for Pseudowire Edge-to-Edge Emulation (PWE3) MIB modules.",
      "ja": "このメモは、インターネットコミュニティのネットワーク管理プロトコルで使用するための管理情報ベース（MIB）の一部を定義します。特に、Pseudowire（PW）テクノロジーとPseudowire Edge-to-Edge Emulation（PWE3）MIBモジュールに使用されるテキストコンベンションを定義します。"
    },
    {
      "indent": 0,
      "text": "2. The Internet-Standard Management Framework",
      "section_title": true,
      "ja": "2. インターネット標準の管理フレームワーク"
    },
    {
      "indent": 3,
      "text": "For a detailed overview of the documents that describe the current Internet-Standard Management Framework, please refer to section 7 of RFC 3410 [RFC3410].",
      "ja": "現在のインターネット標準管理フレームワークを説明するドキュメントの詳細な概要については、RFC 3410 [RFC3410]のセクション7を参照してください。"
    },
    {
      "indent": 3,
      "text": "Managed objects are accessed via a virtual information store, termed the Management Information Base or MIB. MIB objects are generally accessed through Simple Network Management Protocol (SNMP). Objects in the MIB are defined using the mechanisms defined in the Structure of Management Information (SMI). This memo specifies a MIB module that is compliant to the SMIv2, which is described in STD 58, RFC 2578 [RFC2578], STD 58, RFC 2579 [RFC2579] and STD 58, RFC 2580 [RFC2580].",
      "ja": "管理されたオブジェクトは、管理情報ベースまたはMIBと呼ばれる仮想情報ストアからアクセスされます。MIBオブジェクトは、通常、単純なネットワーク管理プロトコル（SNMP）を介してアクセスされます。MIBのオブジェクトは、管理情報の構造（SMI）で定義されたメカニズムを使用して定義されます。このメモは、STD 58、RFC 2578 [RFC2578]、STD 58、RFC 2579 [RFC2579]およびSTD 58、RFC 2580 [RFC2580]に記載されているSMIV2に準拠したMIBモジュールを指定します。"
    },
    {
      "indent": 0,
      "text": "3. Conventions Used in This Document",
      "section_title": true,
      "ja": "3. このドキュメントで使用されている規則"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "「必須」、「そうしない」、「必須」、「shall」、「shall \"、\" ingle \"、\" should \"、\" not \"、\" becommended \"、\" bay \"、および「optional」は、[RFC2119]に記載されているように解釈される。"
    },
    {
      "indent": 0,
      "text": "4. Object Definitions",
      "section_title": true,
      "ja": "4. オブジェクト定義"
    },
    {
      "indent": 3,
      "text": "PW-TC-STD-MIB DEFINITIONS ::= BEGIN",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "IMPORTS MODULE-IDENTITY, Unsigned32, mib-2 FROM SNMPv2-SMI -- [RFC2578]",
      "ja": "Intorts Module-Identity、unsigned32、MIB-2からSNMPV2-SMI  -  [RFC2578]"
    },
    {
      "indent": 6,
      "text": "TEXTUAL-CONVENTION FROM SNMPv2-TC; -- [RFC2579]",
      "ja": "snmpv2-tcからのテキストコンベンション。 -  [RFC2579]"
    },
    {
      "indent": 3,
      "text": "pwTcStdMIB MODULE-IDENTITY LAST-UPDATED \"200904210000Z\" -- 21 April 2009 00:00:00 GMT ORGANIZATION \"Pseudowire Edge-to-Edge Emulation (PWE3) Working Group\" CONTACT-INFO \" Thomas D. Nadeau Email: tom.nadeau@bt.com",
      "ja": "PWTCSTDMIBモジュール同一性最終アップデーション「200904210000Z \" -  2009年4月21日00:00:00 GMT組織\" PSEUDOWIRE EDGE-TO-EDED EMULALTION（PWE3）ワーキンググループ \"Contact-INFO\" Thomas D. Nadeauメール：Tom.Nadeau@@@bt.com"
    },
    {
      "indent": 8,
      "text": "David Zelig Email: davidz@oversi.com",
      "ja": "David Zeligメール：Davidz@oversi.com"
    },
    {
      "indent": 8,
      "text": "Orly Nicklass Email: orlyn@radvision.com",
      "ja": "orly nicklassメール：orlyn@radvision.com"
    },
    {
      "indent": 7,
      "text": " The PWE3 Working Group (email distribution pwe3@ietf.org, http://www.ietf.org/html.charters/pwe3-charter.html) \"",
      "ja": "PWE3ワーキンググループ（電子メールディストリビューションpwe3@ietf.org、http：//www.ietf.org/html.charters/pwe3-charter.html） \""
    },
    {
      "indent": 6,
      "text": "DESCRIPTION \"This MIB module defines TEXTUAL-CONVENTIONS for concepts used in pseudowire edge-to-edge networks.",
      "ja": "説明 \"このMIBモジュールは、擬似ワイヤーのエッジツーエッジネットワークで使用される概念のテキストコンベニオンを定義します。"
    },
    {
      "indent": 9,
      "text": "Copyright (c) 2009 IETF Trust and the persons identified as authors of the code. All rights reserved.",
      "ja": "Copyright（c）2009 IETF TrustおよびCodeの著者として特定された人。全著作権所有。"
    },
    {
      "indent": 9,
      "text": "Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:",
      "ja": "変更とバイナリ形式での再配布と使用は、変更を伴うまたは伴わない場合、次の条件が満たされている場合が許可されています。"
    },
    {
      "indent": 9,
      "text": "- Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.",
      "ja": "- ソースコードの再配布は、上記の著作権通知、この条件リスト、および次の免責事項を保持する必要があります。"
    },
    {
      "indent": 9,
      "text": "- Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.",
      "ja": "- バイナリ形式の再配布は、上記の著作権通知、この条件のリスト、および分布に提供されたドキュメントおよび/またはその他の資料の次の免責事項を再現する必要があります。"
    },
    {
      "indent": 9,
      "text": "- Neither the name of Internet Society, IETF or IETF Trust, nor the names of specific contributors, may be used to endorse or promote products derived from this software without specific prior written permission.",
      "ja": "- インターネット社会、IETFまたはIETFトラストの名前も、特定の貢献者の名前も、特定の事前の書面による許可なしにこのソフトウェアから派生した製品を支持または宣伝するために使用することはできません。"
    },
    {
      "indent": 9,
      "text": "THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 'AS IS' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.",
      "ja": "このソフトウェアは、著作権所有者と貢献者が「現状で」提供し、特定の目的に対する商品性とフィットネスの暗黙の保証を含むがこれらに限定されない明示的または黙示的な保証によって提供されます。いかなる場合でも、著作権所有者または貢献者は、直接的、間接的、偶発的、特別な、模範的、または結果的な損害（代替品またはサービスの調達を含むがこれらに限定されない、使用の損失、データ、または利益に対して責任を負いません。ただし、契約、厳格責任、または不法行為（過失などを含む）であろうと、このソフトウェアの使用から何らかの形で発生するかどうかにかかわらず、責任の理論に起因します。"
    },
    {
      "indent": 9,
      "text": "This version of this MIB module is part of RFC 5542; see the RFC itself for full legal notices.\"",
      "ja": "このMIBモジュールのこのバージョンは、RFC 5542の一部です。完全な法的通知については、RFC自体を参照してください。」"
    },
    {
      "indent": 6,
      "text": "-- Revision history.",
      "ja": " - 改訂履歴。"
    },
    {
      "indent": 6,
      "text": "REVISION \"200904210000Z\"  -- 21 April 2009 00:00:00 GMT\nDESCRIPTION\n     \"Original Version\"\n   ::= { mib-2 188 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "PwGroupID ::= TEXTUAL-CONVENTION\n   DISPLAY-HINT \"d\"\n   STATUS      current\n   DESCRIPTION\n        \"An administrative identification for grouping a\n         set of service-specific pseudowire services.\"\n   SYNTAX  Unsigned32",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "PwIDType ::= TEXTUAL-CONVENTION\n   DISPLAY-HINT \"d\"\n   STATUS      current\n      DESCRIPTION\n        \"Pseudowire Identifier.  Used to identify the PW\n         (together with some other fields) in the signaling\n         session.\"\n   SYNTAX  Unsigned32",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "PwIndexType ::= TEXTUAL-CONVENTION\n   DISPLAY-HINT \"d\"\n   STATUS      current\n   DESCRIPTION\n        \"Pseudowire Index.  A unique value, greater than zero,\n        for each locally defined PW.  Used for indexing\n        several MIB tables associated with the particular PW.\n        It is recommended that values are assigned contiguously\n        starting from 1.  The value for each PW MUST remain\n        constant at least from one re-initialization\n        to the next re-initialization.\"\n   SYNTAX  Unsigned32 (1..4294967295)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "PwIndexOrZeroType ::= TEXTUAL-CONVENTION\n   DISPLAY-HINT \"d\"\n   STATUS      current\n   DESCRIPTION\n        \"This TEXTUAL-CONVENTION is an extension of the\n         PwIndexType convention.  The latter defines a greater-\n         than-zero value used to identify a pseudowire\n         in the managed system.  This extension permits the\n         additional value of zero.  The zero value is object-specific\n         and MUST therefore be defined as part of the description of\n         any object that uses this syntax.  Examples of the usage of\n         zero might include situations where pseudowire was unknown,\n         or where none or all pseudowires need to be referenced.\"\n    SYNTAX  Unsigned32 (0..4294967295)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "PwOperStatusTC ::= TEXTUAL-CONVENTION\n   STATUS      current\n   DESCRIPTION\n     \"Indicates the operational status of the PW.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 8,
      "text": "- up(1): Ready to pass packets. - down(2): PW signaling is not yet finished, or indications available at the service level indicate that the PW is not passing packets. - testing(3): AdminStatus at the PW level is set to test.",
      "ja": "- UP（1）：パケットを渡す準備ができました。 - ダウン（2）：PWシグナル伝達はまだ終了していません。または、サービスレベルで利用可能な適応症は、PWがパケットを通過していないことを示しています。 - テスト（3）：PWレベルのadminStatusがテストするように設定されています。"
    },
    {
      "indent": 4,
      "text": "    - dormant(4):        The PW is not in a condition to pass\n                         packets but is in a 'pending' state,\n                         waiting for some external event.\n    - notPresent(5):     Some component is missing to accomplish\n                         the setup of the PW.  It can be\n                         configuration error, incomplete\n                         configuration, or a missing H/W component.\n    - lowerLayerDown(6): One or more of the lower-layer interfaces\n                         responsible for running the underlying PSN\n                         is not in OperStatus 'up' state.\"\nSYNTAX   INTEGER {\n    up(1),\n    down(2),\n    testing(3),\n    dormant(4),\n    notPresent(5),\n    lowerLayerDown(6)\n    }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "PwAttachmentIdentifierType ::= TEXTUAL-CONVENTION\n   STATUS      current\n   DESCRIPTION\n      \"An octet string used in the generalized Forward Error\n       Correction (FEC) element for identifying attachment forwarder\n       and groups.  A NULL identifier is of zero length.\n      \"\n  SYNTAX    OCTET STRING (SIZE (0..255))",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "PwGenIdType ::= TEXTUAL-CONVENTION\n   STATUS      current\n   DESCRIPTION\n      \"Represents the Attachment Group Identifier (AGI) Type and\n       Attachment Individual Identifier (AII) Type in generalized FEC\n       signaling and configuration.\n      \"\n  SYNTAX    Unsigned32( 0..254 )",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "PwCwStatusTC ::= TEXTUAL-CONVENTION\n   STATUS      current\n   DESCRIPTION\n      \"Indicates the status of the control word (CW) negotiation\n       based on the local configuration and the indications received\n       from the peer node.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 10,
      "text": "waitingForNextMsg(1) indicates that the node is waiting for another label mapping from the peer.",
      "ja": "waitefornextmsg（1）は、ノードがピアからの別のラベルマッピングを待っていることを示します。"
    },
    {
      "indent": 10,
      "text": "sentWrongBitErrorCode(2) indicates that the local node has notified the peer about a mismatch in the C-bit.",
      "ja": "sentwrongbiterrorcode（2）は、ローカルノードがCビットの不一致についてピアに通知したことを示しています。"
    },
    {
      "indent": 10,
      "text": "rxWithdrawWithWrongBitErrorCode(3) indicates that a withdraw message has been received with the wrong C-bit error code.",
      "ja": "rxwithdrawwithwrongbiterrorcode（3）は、間違ったCビットエラーコードで撤回メッセージが受信されたことを示します。"
    },
    {
      "indent": 10,
      "text": "illegalReceivedBit(4) indicates a C-bit configuration with the peer that is not compatible with the PW type.",
      "ja": "IllegalReceivedBit（4）は、PWタイプと互換性のないピアを使用したCビット構成を示します。"
    },
    {
      "indent": 10,
      "text": "cwPresent(5) indicates that the CW is present for this PW. If signaling is used, the C-bit is set and agreed upon between the nodes. For manually configured PW, the local configuration requires the use of the CW.",
      "ja": "Cwpresent（5）は、このPWにCWが存在することを示しています。シグナリングを使用すると、Cビットが設定され、ノード間で合意されます。手動で構成されたPWの場合、ローカル構成にはCWの使用が必要です。"
    },
    {
      "indent": 10,
      "text": "cwNotPresent(6) indicates that the CW is not present for this PW. If signaling is used, the C-bit is reset and agreed upon between the nodes. For manually configured PW, the local configuration requires that the CW not be used.",
      "ja": "CWNOTPRESENT（6）は、このPWにCWが存在しないことを示しています。シグナリングを使用すると、Cビットがリセットされ、ノード間で合意されます。手動で構成されたPWの場合、ローカル構成では、CWを使用しない必要があります。"
    },
    {
      "indent": 6,
      "text": " notYetKnown(7) indicates that a label mapping has not yet been received from the peer. \" REFERENCE \"Martini, et al., 'Pseudowire Setup and Maintenance Using the Label Distribution Protocol', [RFC4447].\"",
      "ja": "NotyetKnown（7）は、ラベルマッピングがピアからまだ受信されていないことを示しています。「リファレンス」マルティニ等、「ラベル分布プロトコルを使用した擬似ワイヤーのセットアップとメンテナンス」、[RFC4447]。」"
    },
    {
      "indent": 6,
      "text": "SYNTAX    INTEGER {\n           waitingForNextMsg(1),\n           sentWrongBitErrorCode(2),\n           rxWithdrawWithWrongBitErrorCode(3),\n           illegalReceivedBit(4),\n           cwPresent(5),\n           cwNotPresent(6),\n           notYetKnown(7)\n           }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "PwStatus ::= TEXTUAL-CONVENTION\n   STATUS      current\n   DESCRIPTION\n      \"Indicates the status of the PW and the interfaces affecting\n       this PW.  If none of the bits are set, it indicates no faults\n       are reported.\n      \"",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "SYNTAX   BITS {\n  pwNotForwarding(0),\n  servicePwRxFault(1),\n  servicePwTxFault(2),\n  psnPwRxFault(3),\n  psnPwTxFault(4)\n  }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "PwFragSize ::= TEXTUAL-CONVENTION\n   DISPLAY-HINT \"d\"\n   STATUS      current\n   DESCRIPTION\n      \"If set to a value other than zero, it indicates the desired\n       fragmentation length in bytes.  If set to zero,\n       fragmentation is not desired for PSN bound packets.\n      \"\n   SYNTAX   Unsigned32",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "PwFragStatus ::= TEXTUAL-CONVENTION\n   STATUS      current\n   DESCRIPTION\n      \"Indicates the status of the fragmentation/reassembly process\n       based on local configuration and peer capability.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 10,
      "text": "noFrag(0) bit indicates that local configuration is for no fragmentation.",
      "ja": "nofrag（0）ビットは、ローカル構成が断片化なしであることを示します。"
    },
    {
      "indent": 10,
      "text": "cfgFragGreaterThanPsnMtu(1) bit indicates that the local node is set to fragment, but the fragmentation size is greater than the MTU available at the PSN between the nodes. Fragmentation is not done in this case.",
      "ja": "CFGFRAGGREARTERTHANPSNMTU（1）ビットは、ローカルノードがフラグメントに設定されていることを示しますが、フラグメンテーションサイズはノード間のPSNで使用可能なMTUよりも大きいことを示します。この場合、断片化は行われません。"
    },
    {
      "indent": 10,
      "text": "cfgFragButRemoteIncapable(2) bit indicates that the local configuration conveys the desire for fragmentation but the peer is not capable of reassembly.",
      "ja": "CFGFRAGBUTREMOTEINCAPABLE（2）ビットは、ローカル構成が断片化の欲求を伝えるが、ピアは再組み立てを行うことができないことを示します。"
    },
    {
      "indent": 10,
      "text": "remoteFragCapable(3) bit indicates that the remote node is capable to accept fragmented PDUs.",
      "ja": "RemoteFragCapable（3）ビットは、リモートノードが断片化されたPDUを受け入れることができることを示します。"
    },
    {
      "indent": 10,
      "text": "fragEnabled(4) bit indicates that fragmentation will be used on this PW. Fragmentation can be used if the local node was configured for fragmentation, the peer has the capability to accept fragmented packets, and the CW is in use for this PW.\"",
      "ja": "FrageNabled（4）ビットは、このPWでフラグメンテーションが使用されることを示します。断片化は、ローカルノードがフラグメンテーションのために構成されている場合、ピアには断片化されたパケットを受け入れる機能があり、CWがこのPWに使用されている場合に使用できます。」"
    },
    {
      "indent": 6,
      "text": "REFERENCE \"Malis, A. and M. Townsley, 'Pseudowire Emulation Edge-to-Edge (PWE3) Fragmentation and Reassembly', [RFC4623].\"",
      "ja": "参照「Malis、A。and M. Townsley、「Pseudowire Emulation Edge-to-Edge（PWE3）の断片化と再組み立て」、[RFC4623]。」"
    },
    {
      "indent": 6,
      "text": "SYNTAX   BITS {\n   noFrag(0),\n   cfgFragGreaterThanPsnMtu(1),\n   cfgFragButRemoteIncapable(2),\n   remoteFragCapable(3),\n   fragEnabled(4)\n   }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "PwCfgIndexOrzero ::= TEXTUAL-CONVENTION\n   DISPLAY-HINT \"d\"\n   STATUS      current\n   DESCRIPTION\n        \"Index in any of the relevant configuration tables for\n        supplement information regarding configuration of the\n        specific technology.  Value zero implies no additional\n        configuration information is applicable.\"\n   SYNTAX  Unsigned32 (0..4294967295)\nEND",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "This module does not define any management objects. Instead, it defines a set of textual conventions that may be used by other PWE3 MIB modules to define management objects.",
      "ja": "このモジュールは、管理オブジェクトを定義しません。代わりに、他のPWE3 MIBモジュールが管理オブジェクトを定義するために使用できる一連のテキスト規則を定義します。"
    },
    {
      "indent": 3,
      "text": "Meaningful security considerations can only be written in the MIB modules that define management objects. Therefore, this document has no impact on the security of the Internet.",
      "ja": "意味のあるセキュリティ上の考慮事項は、管理オブジェクトを定義するMIBモジュールでのみ作成できます。したがって、このドキュメントは、インターネットのセキュリティに影響を与えません。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "The MIB module in this document uses the following IANA-assigned OBJECT IDENTIFIER value recorded in the SMI Numbers registry:",
      "ja": "このドキュメントのMIBモジュールは、SMI番号レジストリに記録された次のIANAによって割り当てられたオブジェクト識別子値を使用します。"
    },
    {
      "indent": 9,
      "text": "Descriptor        OBJECT IDENTIFIER value\n----------        -----------------------\npwTcStdMIB         { mib-2 188 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7. 参考文献"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "ja": "7.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119] Bradner、S。、「要件レベルを示すためにRFCで使用するためのキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2578] McCloghrie, K., Perkins, D., and J. Schoenwaelder, \"Structure of Management Information Version 2 (SMIv2)\", STD 58, RFC 2578, April 1999.",
      "ja": "[RFC2578] McCloghrie、K.、Perkins、D。、およびJ. Schoenwaelder、「管理情報の構造バージョン2（SMIV2）」、STD 58、RFC 2578、1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2579] McCloghrie, K., Perkins, D., and J. Schoenwaelder, \"Textual Conventions for SMIv2\", STD 58, RFC 2579, April 1999.",
      "ja": "[RFC2579] McCloghrie、K.、Perkins、D。、およびJ. Schoenwaelder、「SMIV2のテキストコンベンション」、STD 58、RFC 2579、1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2580] McCloghrie, K., Perkins, D., and J. Schoenwaelder, \"Conformance Statements for SMIv2\", STD 58, RFC 2580, April 1999.",
      "ja": "[RFC2580] McCloghrie、K.、Perkins、D。、およびJ. Schoenwaelder、「SMIV2の適合ステートメント」、STD 58、RFC 2580、1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC4447] Martini, L., Ed., Rosen, E., El-Aawar, N., Smith, T., and G. Heron, \"Pseudowire Setup and Maintenance Using the Label Distribution Protocol (LDP)\", RFC 4447, April 2006.",
      "ja": "[RFC4447] Martini、L.、Ed。、Rosen、E.、El-Aawar、N.、Smith、T。、およびG. Heron、「ラベル分布プロトコル（LDP）を使用した擬似ワイヤーのセットアップとメンテナンス」、RFC 4447、2006年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC4623] Malis, A. and M. Townsley, \"Pseudowire Emulation Edge-to-Edge (PWE3) Fragmentation and Reassembly\", RFC 4623, August 2006.",
      "ja": "[RFC4623] Malis、A。およびM. Townsley、「Pseudowire Emulation Edge-to-Edge（PWE3）の断片化と再組み立て」、RFC 4623、2006年8月。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "ja": "7.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[RFC3410] Case, J., Mundy, R., Partain, D., and B. Stewart, \"Introduction and Applicability Statements for Internet-Standard Management Framework\", RFC 3410, December 2002.",
      "ja": "[RFC3410] Case、J.、Mundy、R.、Partain、D。、およびB. Stewart、「インターネット標準管理フレームワークの紹介と適用声明」、RFC 3410、2002年12月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Thomas D. Nadeau (editor) BT BT Centre 81 Newgate Street London EC1A 7AJ United Kingdom",
      "ja": "トーマスD.ナドー（編集者）BT BTセンター81 Newgate Street London EC1A 7AJイギリス"
    },
    {
      "indent": 3,
      "text": "EMail: tom.nadeau@bt.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "David Zelig (editor) Oversi Networks 1 Rishon Letzion St. Petah Tikva Israel",
      "ja": "David Zelig（編集者）Oversiネットワーク1 Rishon Letzion St. Petah Tikva Israel"
    },
    {
      "indent": 3,
      "text": "Phone: +972 77 3337 750\nEMail: davidz@oversi.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Orly Nicklass (editor) RADVISION 24 Raul Wallenberg Tel Aviv",
      "ja": "Orly Nicklass（編集者）Radvision 24 Raul Wallenberg Tel Aviv"
    },
    {
      "indent": 3,
      "text": "Phone: +972 3 776 9444\nEMail: orlyn@radvision.com",
      "raw": true,
      "ja": ""
    }
  ]
}