{
  "title": {
    "text": "RFC 5012 - Requirements for Emergency Context Resolution with Internet Technologies",
    "ja": "RFC 5012 - インターネットテクノロジーによる緊急コンテキスト解決の要件"
  },
  "number": 5012,
  "created_at": "2023-05-05 19:17:39.765410+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                     H. Schulzrinne\nRequest for Comments: 5012                                   Columbia U.\nCategory: Informational                                 R. Marshall, Ed.\n                                                                     TCS\n                                                            January 2008",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 11,
      "text": "Requirements for Emergency Context Resolution with Internet Technologies",
      "ja": "インターネットテクノロジーによる緊急コンテキスト解決の要件"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモは、インターネットコミュニティに情報を提供します。いかなる種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document defines terminology and enumerates requirements for the context resolution of emergency calls placed by the public using voice-over-IP (VoIP) and general Internet multimedia systems, where Internet protocols are used end to end.",
      "ja": "このドキュメントでは、用語を定義し、インターネットプロトコルが終了するためにインターネットプロトコルが使用される一般的なインターネットマルチメディアシステムを使用して、一般に公開された緊急コールのコンテキスト解決の要件を列挙します。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  2\n2.  Requirements Terminology . . . . . . . . . . . . . . . . . . .  3\n3.  Terminology  . . . . . . . . . . . . . . . . . . . . . . . . .  3\n  3.1.  Emergency Services . . . . . . . . . . . . . . . . . . . .  3\n  3.2.  Service Providers  . . . . . . . . . . . . . . . . . . . .  3\n  3.3.  Actors . . . . . . . . . . . . . . . . . . . . . . . . . .  4\n  3.4.  Call Routing Entities  . . . . . . . . . . . . . . . . . .  5\n  3.5.  Location . . . . . . . . . . . . . . . . . . . . . . . . .  5\n  3.6.  Identifiers, Numbers, and Dial Strings . . . . . . . . . .  6\n  3.7.  Mapping  . . . . . . . . . . . . . . . . . . . . . . . . .  7\n4.  Basic Actors . . . . . . . . . . . . . . . . . . . . . . . . .  8\n5.  High-Level Requirements  . . . . . . . . . . . . . . . . . . . 10\n6.  Identifying the Caller's Location  . . . . . . . . . . . . . . 12\n7.  Emergency Service Identifier . . . . . . . . . . . . . . . . . 14\n8.  Mapping Protocol . . . . . . . . . . . . . . . . . . . . . . . 16\n9.  Security Considerations  . . . . . . . . . . . . . . . . . . . 20\n10. Contributors . . . . . . . . . . . . . . . . . . . . . . . . . 20\n11. Acknowledgments  . . . . . . . . . . . . . . . . . . . . . . . 21\n12. References . . . . . . . . . . . . . . . . . . . . . . . . . . 21\n  12.1. Normative References . . . . . . . . . . . . . . . . . . . 21\n  12.2. Informative References . . . . . . . . . . . . . . . . . . 21",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "Users of both voice-centric (telephone-like) and non-voice services, such as text communication for hearing-disabled users (see [RFC3351] and [toip]), expect to be able to initiate a request for help in case of an emergency.",
      "ja": "聴覚障害のあるユーザー向けのテキスト通信などの音声中心（電話様）および非声サービスの両方のユーザー（[rfc3351]および[toip]を参照）は、の場合、ヘルプのリクエストを開始できると予想しています。緊急事態。"
    },
    {
      "indent": 3,
      "text": "Unfortunately, the existing mechanisms to support emergency calls that have evolved within the public circuit-switched telephone network (PSTN) are not appropriate to handle evolving IP-based voice, text, and real-time multimedia communications. This document outlines the key requirements that IP-based end systems and network elements, such as Session Initiation Protocol (SIP) [RFC3261] proxies, need to satisfy in order to provide emergency call services, which at a minimum, offer the same functionality as existing PSTN services, with the additional overall goal of making emergency calling more robust, less costly to implement, and multimedia-capable.",
      "ja": "残念ながら、パブリックサーキットスイッチの電話ネットワーク（PSTN）内で進化した緊急コールをサポートする既存のメカニズムは、進化するIPベースの音声、テキスト、リアルタイムのマルチメディア通信を処理するのに適していません。このドキュメントでは、セッション開始プロトコル（SIP）[RFC3261]プロキシなどのIPベースのエンドシステムとネットワーク要素が、緊急コールサービスを提供するために満たす必要がある重要な要件の概要を示しています。既存のPSTNサービス。緊急通話をより堅牢で、実装するのに費用がかかり、マルチメディアに対応するという追加の目標があります。"
    },
    {
      "indent": 3,
      "text": "This document only focuses on end-to-end IP-based calls, i.e., where the emergency call originates from an IP end system and terminates in an IP-capable public safety answering point (PSAP), conveyed entirely over an IP network.",
      "ja": "このドキュメントは、エンドツーエンドのIPベースの呼び出しにのみ焦点を当てています。つまり、緊急コールはIPエンドシステムから発生し、IP対応の公共安全応答ポイント（PSAP）で終了し、IPネットワークで完全に伝えられます。"
    },
    {
      "indent": 3,
      "text": "We first define terminology in Section 3. The document then outlines various functional issues that relate to placing an IP-based emergency call, including a description of baseline requirements (Section 5), identification of the emergency caller's location (Section 6), use of a service identifier to declare a call to be an emergency call (Section 7), and finally, the mapping function required to route the call to the appropriate PSAP (Section 8).",
      "ja": "最初にセクション3の用語を定義します。その後、ドキュメントは、ベースライン要件の説明（セクション5）、緊急発信者の場所の識別（セクション6）、使用、使用、使用の使用、IPベースの緊急コールの配置に関連するさまざまな機能的問題の概要を説明します。呼び出しを緊急コール（セクション7）と宣言するサービス識別子、そして最後に、コールを適切なPSAP（セクション8）にルーティングするために必要なマッピング関数。"
    },
    {
      "indent": 3,
      "text": "The primary purpose of the mapping protocol is to produce a PSAP URI drawn from a preferred set of URI schemes such as SIP or SIPS URIs, based on both location information [RFC4119] and a service identifier in order to facilitate the IP end-to-end completion of an emergency call.",
      "ja": "マッピングプロトコルの主な目的は、IPのエンドツートゥ - を促進するために、位置情報[RFC4119]とサービス識別子の両方に基づいて、SIPまたはSIP URISなどの優先されたURIスキームから描かれたPSAP URIを生成することです。緊急電話の終了完了。"
    },
    {
      "indent": 3,
      "text": "Aside from obtaining a PSAP URI, the mapping protocol is useful for obtaining other information as well. There may be a case, for example, where an appropriate emergency number is not known, only the location. The mapping protocol can then return a geographically appropriate emergency number based on the input.",
      "ja": "PSAP URIを取得する以外に、マッピングプロトコルは他の情報を取得するのにも役立ちます。たとえば、適切な緊急電話番号が不明な場合、場所のみが存在する場合があります。マッピングプロトコルは、入力に基づいて地理的に適切な緊急番号を返すことができます。"
    },
    {
      "indent": 3,
      "text": "Since some PSAPs may not immediately support IP, or because some user equipment (UE) may not initially support emergency service identifiers, it may be necessary to also support emergency service identifiers that utilize less-preferred URI schemes, such as a tel URI in order to complete an emergency call via the PSTN.",
      "ja": "一部のPSAPはすぐにIPをサポートしない可能性がある場合、または一部のユーザー機器（UE）が最初に緊急サービス識別子をサポートしていない可能性があるため、TelURIなどのより順調なPREFERED URIスキームを使用する緊急サービス識別子をサポートする必要がある場合があります。PSTNを介して緊急通話を完了します。"
    },
    {
      "indent": 3,
      "text": "Identification of the caller, while not incompatible with the requirements for messaging outlined within this document, is considered to be outside the scope of this document.",
      "ja": "発信者の識別は、このドキュメント内で概説されているメッセージングの要件と互換性がないが、このドキュメントの範囲外であると見なされます。"
    },
    {
      "indent": 3,
      "text": "Location is required for two separate purposes: first, to support the routing of the emergency call to the appropriate PSAP and second, to display the caller's location to the call taker to help in dispatching emergency assistance to the appropriate location.",
      "ja": "場所は、2つの個別の目的に必要です。1つ目は、適切なPSAPへの緊急コールのルーティングをサポートするために必要です。"
    },
    {
      "indent": 3,
      "text": "This latter use, the display of location information to the PSAP, is orthogonal to the mapping protocol, and is outside the scope of this document.",
      "ja": "この後者の使用、PSAPへの位置情報の表示は、マッピングプロトコルの直交であり、このドキュメントの範囲外です。"
    },
    {
      "indent": 0,
      "text": "2. Requirements Terminology",
      "section_title": true,
      "ja": "2. 要件用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119], with the important qualification that, unless otherwise stated, these terms apply to the design of the mapping protocol, not its implementation or application.",
      "ja": "この文書におけるキーワード「MUST」、「MUST NOT」、「REQUIRED」、「SHALL」、「SHALL NOT」、「SHOULD」、「SHOULD NOT」、「RECOMMENDED」、「MAY」、および「OPTIONAL」は、RFC 2119 [RFC2119] に記述されているように解釈されますが、重要な注意点として、特に断りのない限り、これらの用語はマッピングプロトコルの実装や適用ではなく、設計に適用されるという点です。"
    },
    {
      "indent": 0,
      "text": "3. Terminology",
      "section_title": true,
      "ja": "3. 用語"
    },
    {
      "indent": 0,
      "text": "3.1. Emergency Services",
      "section_title": true,
      "ja": "3.1. 緊急サービス"
    },
    {
      "indent": 3,
      "text": "Basic emergency service: Basic emergency service allows a caller to reach a PSAP serving its current location, but the PSAP may not be able to determine the identity or geographic location of the caller, except by the call taker asking the caller.",
      "ja": "基本的な緊急サービス：基本的な緊急サービスにより、発信者は現在の場所にサービスを提供するPSAPに到達できますが、PSAPは発信者に尋ねる場合を除き、発信者の身元または地理的位置を決定できない場合があります。"
    },
    {
      "indent": 3,
      "text": "Enhanced emergency service: In enhanced emergency service, the PSAP call taker can determine the caller's current location.",
      "ja": "緊急サービスの強化：緊急サービスの強化において、PSAPコールテイカーは発信者の現在の場所を決定できます。"
    },
    {
      "indent": 0,
      "text": "3.2. Service Providers",
      "section_title": true,
      "ja": "3.2. サービスプロバイダー"
    },
    {
      "indent": 3,
      "text": "Internet Access Provider (IAP): An organization that provides physical and data link (layer 2) network connectivity to its customers or users, e.g., through digital subscriber lines, cable TV plants, Ethernet, leased lines, or radio frequencies. Examples of such organizations include telecommunication carriers, municipal utilities, larger enterprises with their own network infrastructure, and government organizations, such as the military.",
      "ja": "インターネットアクセスプロバイダー（IAP）：顧客またはユーザーに物理リンクとデータリンク（レイヤー2）ネットワーク接続を提供する組織、例えば、デジタルサブスクライバーライン、ケーブルテレビプラント、イーサネット、リースライン、または無線周波数を介して。このような組織の例には、電気通信航空会社、地方自治体の公益事業、独自のネットワークインフラストラクチャを持つ大企業、軍隊などの政府組織が含まれます。"
    },
    {
      "indent": 3,
      "text": "Internet Service Provider (ISP): An organization that provides IP network-layer services to its customers or users. This entity may or may not provide the physical-layer and data link (layer-2) connectivity, such as fiber or Ethernet, i.e., it may or may not play the role of an IAP.",
      "ja": "インターネットサービスプロバイダー（ISP）：顧客またはユーザーにIPネットワーク層サービスを提供する組織。このエンティティは、ファイバーやイーサネットなどの物理的層とデータリンク（レイヤー2）接続を提供する場合と提供する場合があります。つまり、IAPの役割を果たす場合としない場合があります。"
    },
    {
      "indent": 3,
      "text": "Application Service Provider (ASP): The organization or entity that provides application-layer services, which may include voice (see \"Voice Service Provider\"). This entity can be a private individual, an enterprise, a government, or a service provider. An ASP is more general than a Voice Service Provider, since emergency calls may use other media beyond voice, including text and video. For a particular user, the ASP may or may not be the same organization as his IAP or ISP.",
      "ja": "アプリケーションサービスプロバイダー（ASP）：音声を含む可能性のあるアプリケーション層サービスを提供する組織またはエンティティ（「音声サービスプロバイダー」を参照）。このエンティティは、個人、企業、政府、またはサービスプロバイダーである可能性があります。ASPは、緊急通話がテキストやビデオを含む音声を超えた他のメディアを使用する可能性があるため、音声サービスプロバイダーよりも一般的です。特定のユーザーの場合、ASPは彼のIAPまたはISPと同じ組織である場合と同じ場合があります。"
    },
    {
      "indent": 3,
      "text": "Voice Service Provider (VSP): A specific type of Application Service Provider that provides voice related services based on IP, such as call routing, a SIP URI, or PSTN termination. In this document, unless noted otherwise, any reference to \"Voice Service Provider\" or \"VSP\" may be used interchangeably with \"Application/Voice Service Provider\" or \"ASP/VSP\".",
      "ja": "Voice Service Provider（VSP）：コールルーティング、SIP URI、PSTN終了など、IPに基づいて音声関連サービスを提供する特定のタイプのアプリケーションサービスプロバイダー。このドキュメントでは、特に明記しない限り、「音声サービスプロバイダー」または「VSP」への言及は、「アプリケーション/音声サービスプロバイダー」または「ASP/VSP」と同じ意味で使用できます。"
    },
    {
      "indent": 0,
      "text": "3.3. Actors",
      "section_title": true,
      "ja": "3.3. 俳優"
    },
    {
      "indent": 3,
      "text": "(Emergency) caller: The term \"caller\" or \"emergency caller\" refers to the person placing an emergency call or sending an emergency instant message (IM).",
      "ja": "（緊急）発信者：「発信者」または「緊急発信者」という用語は、緊急電話をかけるか、緊急即時メッセージ（IM）を送信する人を指します。"
    },
    {
      "indent": 3,
      "text": "User Equipment (UE): User equipment is the device or software operated by the caller to place an emergency call. A SIP user agent (UA) is an example of user equipment.",
      "ja": "ユーザー機器（UE）：ユーザー機器は、緊急電話をかけるために発信者が操作するデバイスまたはソフトウェアです。SIPユーザーエージェント（UA）は、ユーザー機器の例です。"
    },
    {
      "indent": 3,
      "text": "Call taker: A call taker is an agent at the PSAP that accepts calls and may dispatch emergency help. Sometimes the functions of call taking and dispatching are handled by different groups of people, but these divisions of labor are not generally visible to the caller and thus do not concern us here.",
      "ja": "コールテイカー：コールテイカーは、通話を受け入れるPSAPのエージェントであり、緊急ヘルプを派遣する場合があります。時々、コールテイクとディスパッチの機能はさまざまな人々のグループによって処理されますが、これらの労働部門は一般に発信者には見えず、したがってここでは私たちに関係しません。"
    },
    {
      "indent": 0,
      "text": "3.4. Call Routing Entities",
      "section_title": true,
      "ja": "3.4. ルーティングエンティティを呼び出します"
    },
    {
      "indent": 3,
      "text": "Emergency Service Routing Proxy (ESRP): An ESRP is an emergency call routing support entity that invokes the location-to-PSAP URI mapping function, to return an appropriate PSAP URI, or the URI for another ESRP. Client mapping requests could also be performed by a number of entities, including entities that instantiate the SIP proxy role and the SIP user agent client role.",
      "ja": "緊急サービスルーティングプロキシ（ESRP）：ESRPは、適切なPSAP URIを返して、別のESRPのURIを返すために、PSAPからPSAPへのURIマッピング機能を呼び出す緊急コールルーティングサポートエンティティです。クライアントマッピングリクエストは、SIPプロキシロールとSIPユーザーエージェントクライアントロールをインスタンス化するエンティティを含む、多くのエンティティによって実行される可能性もあります。"
    },
    {
      "indent": 3,
      "text": "Public Safety Answering Point (PSAP): A PSAP is a facility where emergency calls are received under the responsibility of a public authority. (This terminology is used by both the European Telecommunications Standards Institute (ETSI), in ETSI SR 002 180, and the National Emergency Number Association (NENA).) In the United Kingdom, PSAPs are called Operator Assistance Centres; in New Zealand, Communications Centres. Within this document, it is assumed, unless stated otherwise, that PSAPs support the receipt of emergency calls over IP, using appropriate application layer protocols, such as SIP for call signaling and RTP for media.",
      "ja": "公共安全留守ポイント（PSAP）：PSAPは、公的機関の責任の下で緊急電話を受け取る施設です。（この用語は、ETSI SR 002 180の欧州通信基準研究所（ETSI）と国立緊急番号協会（NENA）の両方で使用されています。）英国のPSAPは、オペレーター支援センターと呼ばれます。ニュージーランドでは、通信センター。このドキュメント内では、特に明記しない限り、PSAPは、コールシグナリングのSIPやメディア用のRTPなど、適切なアプリケーションレイヤープロトコルを使用して、IPに対する緊急コールの受信をサポートしていると想定されています。"
    },
    {
      "indent": 0,
      "text": "3.5. Location",
      "section_title": true,
      "ja": "3.5. 位置"
    },
    {
      "indent": 3,
      "text": "Location: A geographic identification assigned to a region or feature based on a specific coordinate system, or by other precise information such as a street number and name. It can be either a civic or geographic location.",
      "ja": "場所：特定の座標系に基づいて地域または機能に割り当てられた地理的識別、または路上番号や名前などの他の正確な情報。市民または地理的な場所のいずれかです。"
    },
    {
      "indent": 3,
      "text": "Civic location: A described location based on some reference system, such as jurisdictional region or postal delivery grid. A street address is a common example of a civic location.",
      "ja": "市民の場所：管轄区域や郵便配達グリッドなど、一部の参照システムに基づいた記述場所。路上住所は、市民の場所の一般的な例です。"
    },
    {
      "indent": 3,
      "text": "Geographic location: A reference to a point that is able to be located, as described by a set of defined coordinates within a geographic coordinate system, such as latitude and longitude within the WGS-84 datum. For example, a 2-D geographic location is defined as an (x,y) coordinate value pair according to the distance north or south of the equator and east or west of the prime meridian.",
      "ja": "地理的場所：WGS-84データム内の緯度や経度など、地理的座標系内の一連の定義された座標によって説明されているように、配置できるポイントへの参照。たとえば、2D地理的位置は、赤道の北または南、プライム子午線の東または西に応じた（x、y）座標値のペアとして定義されます。"
    },
    {
      "indent": 3,
      "text": "Location validation: A caller location is considered valid if the civic or geographic location is recognizable within an acceptable location reference system (e.g., United States Postal Address or the WGS-84 datum) and can be mapped to one or more PSAPs. While it is desirable to determine that a location exists, validation may not ensure that such a location exists, but rather may only ensure that the location falls within some range of known values. Location validation ensures that a location is able to be referenced for mapping, but makes no assumption about the association between the caller and the caller's location.",
      "ja": "位置の検証：ChivicまたはGeographic Locationが許容可能な位置参照システム（米国郵便住所やWGS-84データムなど）内で認識できる場合、発信者の場所は有効であると見なされ、1つ以上のPSAPにマッピングできます。場所が存在することを判断することが望ましいが、検証はそのような場所が存在することを保証することはなく、場所が既知の値の範囲内にあることを保証する場合がある。場所の検証により、場所をマッピングのために参照できるようになりますが、発信者と発信者の場所との間の関連性については仮定しません。"
    },
    {
      "indent": 0,
      "text": "3.6. Identifiers, Numbers, and Dial Strings",
      "section_title": true,
      "ja": "3.6. 識別子、番号、およびダイヤル文字列"
    },
    {
      "indent": 3,
      "text": "(Emergency) service number: The (emergency) service number is a string of digits used to reach the (emergency) service. The emergency service number is often just called the emergency number. It is the number typically dialed on devices directly connected to the PSTN and the number reserved for emergency calls by national or regional numbering authorities. It only contains the digits 0 through 9, #, and *. The service number may depend on the location of the caller. For example, the general emergency service number in the United States is 911 and the poison control service number is 18002221222. In most cases, the service number and dial string are the same; they may differ in some private phone networks. A service number may be carried in tel URLs [RFC3966], along with a context identifier. In the North American numbering plan, some service numbers are three-digit N11 or service codes, but not all emergency numbers have three digits. A caller may have to dial a service dial string (below) that differs from the service number when using a PBX.",
      "ja": "（緊急）サービス番号：（緊急）サービス番号は、（緊急の）サービスに到達するために使用される一連の数字です。緊急サービス番号は、多くの場合、緊急番号と呼ばれます。これは、通常、PSTNに直接接続されたデバイスにダイヤルされる数と、国または地域の番号付け当局による緊急電話のために予約されている数字です。桁0から9、＃、および *のみが含まれます。サービス番号は、発信者の場所によって異なります。たとえば、米国の一般的な緊急サービス番号は911で、毒物管理サービス番号は18002221222です。ほとんどの場合、サービス番号とダイヤル文字列は同じです。一部のプライベート電話ネットワークで異なる場合があります。サービス番号は、コンテキスト識別子とともに、Tel URLS [RFC3966]に携帯することができます。北米の番号付け計画では、一部のサービス番号は3桁のN11またはサービスコードですが、すべての緊急数に3桁の桁があるわけではありません。発信者は、PBXを使用するときにサービス番号とは異なるサービスダイヤル文字列（下）をダイヤルする必要がある場合があります。"
    },
    {
      "indent": 3,
      "text": "(Emergency) service dial string: The service dial string identifies the string of digits that a caller must dial to reach a particular (emergency) service. In devices directly connected to the PSTN, the service dial string is the same as the service number and may thus depend on the location of the caller. However, in private phone networks, such as in PBXs, the service dial string consists of a dialing prefix to reach an outside line, followed by the emergency number. For example, in a hotel, the dial string for emergency services in the United States might be 9911. Dial strings may contain indications of pauses or wait-for-secondary-dial-tone indications. Service dial strings are outside the scope of this document.",
      "ja": "（緊急）サービスダイヤル文字列：サービスダイヤル文字列は、発信者が特定の（緊急）サービスに到達するためにダイヤルしなければならない一連の数字を識別します。PSTNに直接接続されているデバイスでは、サービスダイヤル文字列はサービス番号と同じであるため、発信者の場所に依存する場合があります。ただし、PBXSなどのプライベート電話ネットワークでは、サービスダイヤル文字列は、外側のラインに到達するためのダイヤルプレフィックスで構成され、その後に緊急番号が続きます。たとえば、ホテルでは、米国の緊急サービスのダイヤルストリングは9911である可能性があります。ダイヤル文字列には、一時停止の兆候または中等派の対応の兆候が含まれている場合があります。サービスダイヤル文字列は、このドキュメントの範囲外です。"
    },
    {
      "indent": 3,
      "text": "(Emergency) service identifier: The (emergency) service identifier describes the emergency service, independent of the user interface mechanism, the signaling protocol that is used to reach the service, or the caller's geographic location. It is a protocol constant and used within the mapping and signaling protocols. An example is the service URN [RFC5031].",
      "ja": "（緊急）サービス識別子：（緊急）サービス識別子は、ユーザーインターフェイスメカニズム、サービスに到達するために使用されるシグナリングプロトコル、または発信者の地理的位置とは無関係に、緊急サービスを説明します。これはプロトコル定数であり、マッピングおよびシグナル伝達プロトコル内で使用されます。例は、サービスURN [RFC5031]です。"
    },
    {
      "indent": 3,
      "text": "(Emergency) service URL: The service URL is a protocol-specific (e.g., SIP) or protocol-agnostic (e.g., im: [RFC3860]) identifier that contains the address of the PSAP or other emergency service. It depends on the specific signaling or data transport protocol used to reach the emergency service.",
      "ja": "（緊急）サービスURL：サービスURLは、PSAPまたはその他の緊急サービスのアドレスを含むプロトコル固有の（例えば、SIP）またはプロトコルと存在する識別子です。これは、緊急サービスに到達するために使用される特定の信号またはデータ輸送プロトコルに依存します。"
    },
    {
      "indent": 3,
      "text": "Service URN: A service URN is an implementation of a service identifier, which can be applied to both emergency and non-emergency contexts, e.g., urn:service:sos or urn:service:counseling. Within this document, service URNs are referred to as 'emergency service URNs' [RFC5031].",
      "ja": "Service URN：サービスURNはサービス識別子の実装であり、緊急事態と非緊急のコンテキストの両方に適用できます。このドキュメント内では、サービスのurnsは「緊急サービスURN」と呼ばれます[RFC5031]。"
    },
    {
      "indent": 3,
      "text": "Home emergency number: A home emergency number is the emergency number valid at the caller's customary home location, e.g., his permanent residence. The home location may or may not coincide with the service area of the caller's VSP.",
      "ja": "家の緊急電話番号：家庭の緊急電話番号は、発信者の慣習的な住宅の場所、たとえば彼の永住地で有効な緊急番号です。家の場所は、発信者のVSPのサービスエリアと一致する場合と一致しない場合があります。"
    },
    {
      "indent": 3,
      "text": "Home emergency dial string: A home dial string is the dial string valid at the caller's customary home location, e.g., his permanent residence.",
      "ja": "ホーム緊急ダイヤルストリング：ホームダイヤルストリングは、発信者の慣習的なホームロケーション、たとえば彼の永続的な居住地で有効なダイヤルストリングです。"
    },
    {
      "indent": 3,
      "text": "Visited emergency number: A visited emergency number is the emergency number valid at the caller's current physical location. We distinguish the visited emergency number if the caller is traveling outside his home region.",
      "ja": "訪問された緊急電話番号：訪問された緊急電話番号は、発信者の現在の物理的な場所で有効な緊急番号です。発信者が故郷の地域の外を移動している場合、訪問した緊急電話番号を区別します。"
    },
    {
      "indent": 3,
      "text": "Visited emergency dial string: A visited emergency dial string is the dial string number valid at the caller's current physical location.",
      "ja": "訪問された緊急ダイヤル文字列：訪問された緊急ダイヤル文字列は、発信者の現在の物理的な場所で有効なダイヤル文字列番号です。"
    },
    {
      "indent": 0,
      "text": "3.7. Mapping",
      "section_title": true,
      "ja": "3.7. マッピング"
    },
    {
      "indent": 3,
      "text": "Mapping: Mapping is the process of resolving a location to one or more PSAP URIs that directly identify a PSAP, or point to an intermediary that knows about a PSAP and that is designated as responsible for serving that location.",
      "ja": "マッピング：マッピングは、PSAPを直接識別する1つ以上のPSAP URIに場所を解決するプロセス、またはPSAPを知っており、その場所を提供する責任があると指定されている仲介者を指すプロセスです。"
    },
    {
      "indent": 3,
      "text": "Mapping client: A mapping client interacts with the mapping server to learn one or more PSAP URIs for a given location.",
      "ja": "マッピングクライアント：マッピングクライアントは、マッピングサーバーと対話して、特定の場所で1つ以上のPSAP URIを学習します。"
    },
    {
      "indent": 3,
      "text": "Mapping protocol: A protocol used to convey the mapping request and response.",
      "ja": "マッピングプロトコル：マッピングリクエストと応答を伝えるために使用されるプロトコル。"
    },
    {
      "indent": 3,
      "text": "Mapping server: The mapping server holds information about the location-to-PSAP URI mapping.",
      "ja": "マッピングサーバー：マッピングサーバーは、場所からPSAPのURIマッピングに関する情報を保持します。"
    },
    {
      "indent": 3,
      "text": "Mapping service: A network service that uses a distributed mapping protocol to perform a mapping between a location and a PSAP, or intermediary that knows about the PSAP, and is used to assist in routing an emergency call.",
      "ja": "マッピングサービス：分散マッピングプロトコルを使用して場所とPSAPまたはPSAPについて知っている仲介者の間のマッピングを実行し、緊急通話のルーティングを支援するために使用されるネットワークサービス。"
    },
    {
      "indent": 0,
      "text": "4. Basic Actors",
      "section_title": true,
      "ja": "4. 基本的なアクター"
    },
    {
      "indent": 3,
      "text": "In order to support emergency services covering a large physical area, various infrastructure elements are necessary, including Internet Access Providers (IAPs), Application/Voice Service Providers (ASP/VSPs), Emergency Service Routing Proxy (ESRP) providers, mapping service providers, and PSAPs.",
      "ja": "大きな物理エリアをカバーする緊急サービスをサポートするために、インターネットアクセスプロバイダー（IAP）、アプリケーション/音声サービスプロバイダー（ASP/VSP）、緊急サービスルーティングプロキシ（ESRP）プロバイダー、マッピングサービスプロバイダーなど、さまざまなインフラストラクチャ要素が必要です。とpsaps。"
    },
    {
      "indent": 3,
      "text": "This section outlines which entities will be considered in the routing scenarios discussed.",
      "ja": "このセクションでは、説明したルーティングシナリオで考慮されるエンティティの概要を説明します。"
    },
    {
      "indent": 5,
      "text": " Location\n Information     +-----------------+\n     |(1)        |Internet         |   +-----------+\n     v           |Access           |   |           |\n+-----------+    |Provider         |   | Mapping   |\n|           |    | (3)             |   | Service   |\n| Emergency |<---+-----------------+-->|           |\n| Caller    |    | (2)             |   +-----------+\n|           |<---+-------+         |          ^\n+-----------+    |  +----|---------+------+   |\n     ^           |  |   Location   |      |   |\n     |           |  |   Information<-+    |   |\n     |           +--+--------------+ |(5) |   | (6)\n     |              |                |    |   |\n     |              |    +-----------v+   |   |\n     |   (4)        |    |            |   |   |\n     +--------------+--->|    ESRP    |<--+---+\n     |              |    |            |   |\n     |              |    +------------+   |\n     |              |          ^          |\n     |              |      (7) |          |  +----+--+\n     |    (8)       |          +------------>|       |\n     +--------------+----------------------->| PSAP  |\n                    |                     |  |       |\n                    |Application/         |  +----+--+\n                    |Voice                |\n                    |Service              |\n                    |Provider             |\n                    +---------------------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 14,
      "text": "Figure 1: Framework for Emergency Call Routing",
      "ja": "図1：緊急通話ルーティングのフレームワーク"
    },
    {
      "indent": 3,
      "text": "Figure 1 shows the interaction between the entities involved in the call. There are a number of different deployment choices, as can be easily seen from the figure.",
      "ja": "図1は、コールに関与するエンティティ間の相互作用を示しています。図から簡単に見ることができるように、さまざまな展開の選択肢があります。"
    },
    {
      "indent": 3,
      "text": "Is the Internet Access Provider also the Application/Voice Service Provider? In the Internet today, the roles of Internet access provider and application/voice service provider are typically provided by different entities. As a consequence, the Application/ Voice Service Provider is typically not able to directly determine the physical location of the emergency caller.",
      "ja": "インターネットアクセスプロバイダーはアプリケーション/音声サービスプロバイダーでもありますか？今日のインターネットでは、インターネットアクセスプロバイダーとアプリケーション/音声サービスプロバイダーの役割は、通常、さまざまなエンティティによって提供されます。結果として、アプリケーション/音声サービスプロバイダーは通常、緊急発信者の物理的位置を直接決定することができません。"
    },
    {
      "indent": 3,
      "text": "The overlapping squares in the figure indicate that some functions can be collapsed into a single entity. As an example, the Application/Voice Service Provider might be the same entity as the Internet Access Provider. There is, however, no requirement that this must be the case. Additionally, we consider that end systems might act as their own ASP/VSP, e.g., either for enterprises or for residential users.",
      "ja": "図の重複した正方形は、一部の関数が単一のエンティティに崩壊する可能性があることを示しています。例として、アプリケーション/ボイスサービスプロバイダーは、インターネットアクセスプロバイダーと同じエンティティである可能性があります。ただし、これが事実でなければならないという要件はありません。さらに、ENDシステムは、企業または住宅ユーザーのいずれかの場合、独自のASP/VSPとして機能する可能性があると考えています。"
    },
    {
      "indent": 3,
      "text": "Various potential interactions between the entities depicted in Figure 1 are described below:",
      "ja": "図1に示すエンティティ間のさまざまな潜在的な相互作用を以下に示します。"
    },
    {
      "indent": 3,
      "text": "1. Location information might be available to the end host itself.",
      "ja": "1. 最終ホスト自体では、位置情報が利用可能になる場合があります。"
    },
    {
      "indent": 3,
      "text": "2. Location information might, however, also be obtained from the Internet Access Provider.",
      "ja": "2. ただし、位置情報は、インターネットアクセスプロバイダーからも取得される場合があります。"
    },
    {
      "indent": 3,
      "text": "3. The emergency caller might need to consult a mapping service to determine the PSAP (or other relevant information) that is appropriate for the physical location of the emergency caller, possibly considering other attributes, such as appropriate language support by the emergency call taker.",
      "ja": "3. 緊急発信者は、緊急発信者の物理的位置に適したPSAP（またはその他の関連情報）を決定するために、マッピングサービスに相談する必要がある場合があります。"
    },
    {
      "indent": 3,
      "text": "4. The emergency caller might get assistance for emergency call routing by infrastructure elements that are emergency call routing support entities, such as an Emergency Service Routing Proxy (ESRP) in SIP.",
      "ja": "4. 緊急発信者は、SIPの緊急サービスルーティングプロキシ（ESRP）などの緊急通話ルーティングサポートエンティティであるインフラストラクチャ要素による緊急コールルーティングの支援を受ける可能性があります。"
    },
    {
      "indent": 3,
      "text": "5. Location information is used by emergency call routing support entities for subsequent mapping requests.",
      "ja": "5. 位置情報は、後続のマッピングリクエストのために緊急通話ルーティングサポートエンティティによって使用されます。"
    },
    {
      "indent": 3,
      "text": "6. Emergency call routing support entities might need to consult a mapping service to determine where to route the emergency call.",
      "ja": "6. 緊急通話ルーティングサポートエンティティは、緊急コールをルーティングする場所を決定するためにマッピングサービスに相談する必要がある場合があります。"
    },
    {
      "indent": 3,
      "text": "7. For infrastructure-based emergency call routing (in contrast to UE-based emergency call routing), the emergency call routing support entity needs to forward the call to the PSAP.",
      "ja": "7. インフラストラクチャベースの緊急通話ルーティング（UEベースの緊急コールルーティングとは対照的に）の場合、緊急通話ルーティングサポートエンティティはPSAPに通話を転送する必要があります。"
    },
    {
      "indent": 3,
      "text": "8. The emergency caller may interact directly with the PSAP, where the UE invokes mapping, and initiates a connection, without relying on any intermediary emergency call routing support entities.",
      "ja": "8. 緊急発信者は、PSAPと直接相互作用する場合があります。ここでは、UEがマッピングを呼び出し、中間緊急コールルーティングサポートエンティティに依存せずに接続を開始できます。"
    },
    {
      "indent": 0,
      "text": "5. High-Level Requirements",
      "section_title": true,
      "ja": "5. 高レベルの要件"
    },
    {
      "indent": 3,
      "text": "Below, we summarize high-level architectural requirements that guide some of the component requirements detailed later in the document.",
      "ja": "以下に、ドキュメントの後半で詳述されているコンポーネント要件の一部をガイドする高レベルのアーキテクチャ要件を要約します。"
    },
    {
      "indent": 3,
      "text": "Re1. Application/Voice service provider existence: The initiation of an IP-based emergency call SHOULD NOT assume the existence of an Application/Voice Service Provider (ASP/VSP).",
      "ja": "re1。アプリケーション/音声サービスプロバイダーの存在：IPベースの緊急通話の開始は、アプリケーション/音声サービスプロバイダー（ASP/VSP）の存在を想定すべきではありません。"
    },
    {
      "indent": 6,
      "text": "Motivation: The caller may not have an application/voice service provider. For example, a residence may have its own DNS domain and run its own SIP proxy server for that domain. On a larger scale, a university might provide voice services to its students and staff, but might not be a telecommunication provider.",
      "ja": "動機：発信者には、アプリケーション/音声サービスプロバイダーがない場合があります。たとえば、住居には独自のDNSドメインがあり、そのドメイン用に独自のSIPプロキシサーバーを実行する場合があります。大規模には、大学は学生とスタッフに音声サービスを提供するかもしれませんが、通信プロバイダーではないかもしれません。"
    },
    {
      "indent": 3,
      "text": "Re2. International applicability: Regional, political, and organizational aspects MUST be considered during the design of protocols and protocol extensions that support IP-based emergency calls.",
      "ja": "RE2。国際的な適用性：地域、政治、および組織の側面は、IPベースの緊急コールをサポートするプロトコルとプロトコル拡張の設計中に考慮する必要があります。"
    },
    {
      "indent": 6,
      "text": "Motivation: It must be possible for a device or software developed or purchased in one country to place emergency calls in another country. System components should not be biased towards a particular set of emergency numbers or languages. Also, different countries have evolved different ways of organizing emergency services, e.g., either centralizing them or having smaller regional subdivisions, such as the United States or municipalities, handle emergency calls within their jurisdiction.",
      "ja": "動機：ある国で開発または購入したデバイスまたはソフトウェアが別の国に緊急電話をかけることが可能である必要があります。システムコンポーネントは、特定の一連の緊急番号や言語に偏ってはいけません。また、さまざまな国が緊急サービスを組織するさまざまな方法を進化させています。たとえば、それらを集中化するか、米国や自治体などの地域の細分化が小さいため、管轄内の緊急電話を処理しています。"
    },
    {
      "indent": 3,
      "text": "Re3. Distributed administration: Deployment of IP-based emergency services MUST NOT depend on a single central administrative authority.",
      "ja": "RE3。分散管理：IPベースの緊急サービスの展開は、単一の中央管理当局に依存してはなりません。"
    },
    {
      "indent": 6,
      "text": "Motivation: The design of the mapping protocol must make it possible to deploy and administer emergency calling features on a regional or national basis without requiring coordination with other regions or nations. The system cannot assume, for example, that there is a single global entity issuing certificates for PSAPs, ASP/VSPs, IAPs, or other participants.",
      "ja": "動機：マッピングプロトコルの設計により、他の地域や国との調整を必要とせずに、地域または全国的に緊急通話機能を展開および管理できるようにする必要があります。たとえば、PSAP、ASP/VSP、IAP、または他の参加者の証明書を発行する単一のグローバルエンティティがあるとは想定できません。"
    },
    {
      "indent": 3,
      "text": "Re4. Multi-mode communication: IP-based emergency calls MUST support multiple communication modes, including, for example, audio, video, and text.",
      "ja": "RE4。マルチモード通信：IPベースの緊急通話は、たとえばオーディオ、ビデオ、テキストなど、複数の通信モードをサポートする必要があります。"
    },
    {
      "indent": 6,
      "text": "Motivation: Within the PSTN, voice and text telephony (often called TTY or text-phone in North America) are the only commonly supported media. Emergency calling must support a variety of media. Such media should include voice, conversational text (RFC 4103 [RFC4103]), instant messaging, and video.",
      "ja": "動機：PSTN内では、音声とテキストテレフォニー（北米ではTTYまたは教科書と呼ばれることが多い）が、一般的にサポートされている唯一のメディアです。緊急通話は、さまざまなメディアをサポートする必要があります。このようなメディアには、音声、会話テキスト（RFC 4103 [RFC4103]）、インスタントメッセージング、ビデオが含まれている必要があります。"
    },
    {
      "indent": 3,
      "text": "Re5. Mapping result usability: The mapping protocol MUST return one or more URIs that are usable within a standard signaling protocol (i.e., without special emergency extensions).",
      "ja": "RE5。マッピング結果のユーザビリティ：マッピングプロトコルは、標準のシグナル伝達プロトコル内で使用可能な1つ以上のURIを返す必要があります（つまり、特別な緊急拡張なし）。"
    },
    {
      "indent": 6,
      "text": "Motivation: For example, a SIP URI that is returned by the mapping protocol needs to be usable by any SIP-capable phone within a SIP-initiated emergency call. This is in contrast to a \"special purpose\" URI, which may not be recognizable by a legacy SIP device.",
      "ja": "動機：たとえば、マッピングプロトコルによって返されるSIP URIは、SIP開始の緊急コール内のSIP対応の電話で使用できる必要があります。これは、「特別な目的」URIとは対照的であり、レガシーSIPデバイスでは認識できない場合があります。"
    },
    {
      "indent": 3,
      "text": "Re6. PSAP URI accessibility: The mapping protocol MUST support interaction between the client and server where no enrollment to a mapping service exists or is required.",
      "ja": "re6。PSAP URIアクセシビリティ：マッピングプロトコルは、マッピングサービスへの登録が存在しないか、必要なクライアントとサーバー間の相互作用をサポートする必要があります。"
    },
    {
      "indent": 6,
      "text": "Motivation: The mapping server may well be operated by a service provider, but access to the server offering the mapping must not require use of a specific ISP or ASP/VSP.",
      "ja": "動機：マッピングサーバーはサービスプロバイダーによって操作される場合がありますが、マッピングを提供するサーバーへのアクセスは、特定のISPまたはASP/VSPを使用する必要はありません。"
    },
    {
      "indent": 3,
      "text": "Re7. Common data structures and formats: The mapping protocol SHOULD support common formats (e.g., PIDF-LO) for location data.",
      "ja": "RE7。一般的なデータ構造と形式：マッピングプロトコルは、位置データの共通形式（PIDF-LOなど）をサポートする必要があります。"
    },
    {
      "indent": 6,
      "text": "Motivation: Location databases should not need to be transformed or modified in any unusual or unreasonable way in order for the mapping protocol to use the data. For example, a database that contains civic addresses used by location servers may be used for multiple purposes and applications beyond emergency service location-to-PSAP URI mapping.",
      "ja": "動機：マッピングプロトコルがデータを使用するために、場所データベースを異常または不合理な方法で変換または変更する必要はありません。たとえば、ロケーションサーバーで使用されるシビックアドレスを含むデータベースは、緊急サービスの場所からPSAPのURIマッピングを超えて、複数の目的とアプリケーションに使用できます。"
    },
    {
      "indent": 3,
      "text": "Re8. Anonymous mapping: The mapping protocol MUST NOT require the true identity of the target for which the location information is attributed.",
      "ja": "Re8。匿名マッピング：マッピングプロトコルは、位置情報が起因するターゲットの真のIDを必要としないはずです。"
    },
    {
      "indent": 6,
      "text": "Motivation: Ideally, no identity information is provided via the mapping protocol. Where identity information is provided, it may be in the form of an unlinked pseudonym (RFC 3693 [RFC3693]).",
      "ja": "動機：理想的には、マッピングプロトコルを介してID情報は提供されていません。ID情報が提供される場合、それはリンクされていない仮名の形である可能性があります（RFC 3693 [RFC3693]）。"
    },
    {
      "indent": 0,
      "text": "6. Identifying the Caller's Location",
      "section_title": true,
      "ja": "6. 発信者の場所を特定します"
    },
    {
      "indent": 3,
      "text": "Location can either be provided directly (by value), or via a pointer (by reference), and represents either a civic location, or a geographic location. An important question is how and when to attach location information to the VoIP emergency signaling messages. In general, we can distinguish three modes of operation of how a location is associated with an emergency call:",
      "ja": "場所は、直接（価値によって）、またはポインターを介して（参照により）提供でき、市民の場所、または地理的な場所を表します。重要な質問は、VoIP緊急信号メッセージに位置情報をどのように、いつ添付するかです。一般に、場所が緊急通話にどのように関連付けられているかについて、3つの操作モードを区別できます。"
    },
    {
      "indent": 3,
      "text": "UA-inserted: The caller's user agent inserts the location information into the call-signaling message.",
      "ja": "UA-Inserted：発信者のユーザーエージェントは、位置情報をコールシグナルメッセージに挿入します。"
    },
    {
      "indent": 3,
      "text": "UA-referenced: The caller's user agent provides a pointer (i.e., a location reference), via a permanent or temporary identifier, to the location information, which is stored by a location server somewhere else and then retrieved by the PSAP, ESRP, or other authorized entity.",
      "ja": "UA-Referenced：発信者のユーザーエージェントは、永続的または一時的な識別子を介してポインター（つまり、位置参照）を提供します。これは、どこか他の場所に位置するサーバーによって保存され、PSAP、ESRP、または取得されます。その他の承認されたエンティティ。"
    },
    {
      "indent": 3,
      "text": "Proxy-inserted: A proxy along the call path inserts the location or location reference.",
      "ja": "プロキシ挿入：コールパスに沿ったプロキシは、場所または場所の参照を挿入します。"
    },
    {
      "indent": 3,
      "text": "The following requirements apply:",
      "ja": "次の要件が適用されます。"
    },
    {
      "indent": 3,
      "text": "Lo1. Reference datum: The mapping protocol MUST support the WGS-84 coordinate reference system and MAY support other coordinate reference systems.",
      "ja": "LO1。参照データ"
    },
    {
      "indent": 6,
      "text": "Motivation: Though many different datums exist around the world, this document recommends the WGS-84 datum since it is designed to describe the whole earth, rather than a single continent or other region, and is commonly used to represent Global Positioning System coordinates.",
      "ja": "動機：世界中に多くの異なるデータムが存在しますが、このドキュメントは、単一の大陸または他の地域ではなく地球全体を記述するように設計されているため、WGS-84データムを推奨しており、一般的にグローバルなポジショニングシステム座標を表すために使用されます。"
    },
    {
      "indent": 3,
      "text": "Lo2. Location delivery by-value: The mapping protocol MUST support the delivery of location information using a by-value method, though it MAY also support de-referencing a URL that references a location object.",
      "ja": "LO2。位置配信バリュー：マッピングプロトコルは、バリュー方法を使用して位置情報の配信をサポートする必要がありますが、ロケーションオブジェクトを参照するURLの参照の解除もサポートする場合があります。"
    },
    {
      "indent": 6,
      "text": "Motivation: The mapping protocol is not required to support the ability to de-reference specific location references.",
      "ja": "動機：特定の位置参照を再参照する機能をサポートするために、マッピングプロトコルは必要ありません。"
    },
    {
      "indent": 3,
      "text": "Lo3. Alternate community names: The mapping protocol MUST support both the jurisdictional community name and the postal community name fields within the PIDF-LO [RFC4119] data.",
      "ja": "LO3。代替コミュニティ名：マッピングプロトコルは、PIDF-LO [RFC4119]データ内の管轄コミュニティ名と郵便コミュニティ名フィールドの両方をサポートする必要があります。"
    },
    {
      "indent": 6,
      "text": "Motivation: The mapping protocol must accept queries with either a postal or jurisdictional community name field, or both, and provide appropriate responses. If a mapping query contains only one community name and the database contains both jurisdictional and postal community names, the mapping protocol response SHOULD return both community names.",
      "ja": "動機：マッピングプロトコルは、郵便または管轄コミュニティ名フィールドのいずれかを備えたクエリを受け入れ、適切な応答を提供する必要があります。マッピングクエリには1つのコミュニティ名のみが含まれており、データベースに管轄権と郵便コミュニティ名の両方が含まれている場合、マッピングプロトコル応答は両方のコミュニティ名を返す必要があります。"
    },
    {
      "indent": 3,
      "text": "Lo4. Validation of civic location: The mapping protocol MUST be able to report the results of validating civic locations (street addresses).",
      "ja": "LO4。市民の場所の検証：マッピングプロトコルは、市民の場所を検証した結果を報告できる必要があります（路上住所）。"
    },
    {
      "indent": 6,
      "text": "Motivation: Location validation provides an opportunity to help ascertain ahead of time whether or not a successful mapping to the appropriate PSAP will likely occur when it is required. Validation may also help to avoid delays during emergency call setup due to invalid location data.",
      "ja": "動機：ロケーション検証は、適切なPSAPへのマッピングが必要な場合に発生する可能性が高いかどうかを事前に確認するのに役立つ機会を提供します。検証は、ロケーションデータが無効なため、緊急コールセットアップ中の遅延を回避するのにも役立ちます。"
    },
    {
      "indent": 3,
      "text": "Lo5. Information about location data used for mapping: The mapping protocol MUST support the ability to provide ancillary information about the resolution of location data used to retrieve a PSAP URI.",
      "ja": "LO5。マッピングに使用される位置データに関する情報：マッピングプロトコルは、PSAP URIの取得に使用される位置データの解像度に関する補助情報を提供する機能をサポートする必要があります。"
    },
    {
      "indent": 6,
      "text": "Motivation: The mapping server may not use all the data elements in the provided location information to determine a match, or may be able to find a match based on all of the information except for some specific data elements. The uniqueness of this information set may be used to differentiate among emergency jurisdictions. Precision or resolution in the context of this requirement might mean, for example, explicit identification of the data elements that were used successfully in the mapping.",
      "ja": "動機：マッピングサーバーは、提供された位置情報のすべてのデータ要素を使用して一致を決定することも、特定のデータ要素を除くすべての情報に基づいて一致を見つけることもできます。この情報セットの独自性は、緊急の管轄区域を区別するために使用できます。この要件のコンテキストでの精度または解像度は、たとえば、マッピングで正常に使用されたデータ要素の明示的な識別を意味する場合があります。"
    },
    {
      "indent": 3,
      "text": "Lo6. Contact for location problems: The mapping protocol MUST support a mechanism to contact an appropriate authority to resolve mapping-related issues for the queried location. For example, the querier may want to report problems with the response values or indicate that the mapping database is mistaken on declaring a civic location as non-existent.",
      "ja": "LO6。場所の問題の連絡先：マッピングプロトコルは、適切な権限に連絡して、クエリの場所のマッピング関連の問題を解決するメカニズムをサポートする必要があります。たとえば、Querierは、応答値の問題を報告するか、マッピングデータベースが市民の場所を存在しないと宣言することで間違っていることを示したい場合があります。"
    },
    {
      "indent": 6,
      "text": "Motivation: Initially, authorities may provide URLs where a human user can report problems with an address or location. In addition, web services may be defined to automate such reporting. For example, the querier may wish to report that the mapping database may be missing a newly built or renamed street or house number.",
      "ja": "動機：当初、当局は、人間のユーザーが住所や場所で問題を報告できるURLを提供する場合があります。さらに、このようなレポートを自動化するためにWebサービスを定義することができます。たとえば、Querierは、マッピングデータベースに新たに構築または改名されたストリートまたはハウス番号が欠落している可能性があることを報告したい場合があります。"
    },
    {
      "indent": 3,
      "text": "Lo7. Limits to validation: Successful validation of a civic location MUST NOT be required to place an emergency call.",
      "ja": "LO7。検証の制限：市民の場所の検証の成功は、緊急電話を行うために必要ではない。"
    },
    {
      "indent": 6,
      "text": "Motivation: In some cases, a civic location may not be considered valid. This fact should not result in the call being dropped or rejected by any entity along the call setup signaling path to the PSAP.",
      "ja": "動機：場合によっては、市民の場所が有効とは見なされない場合があります。この事実は、PSAPへのコールセットアップシグナリングパスに沿って、エンティティによってコールがドロップまたは拒否されることになるべきではありません。"
    },
    {
      "indent": 3,
      "text": "Lo8. 3D sensitive mapping: The mapping protocol MUST implement support for both 2D and 3D location information, and MAY accept either a 2D or 3D mapping request as input.",
      "ja": "LO8。3D Sensitive Mapping：マッピングプロトコルは、2Dおよび3Dの両方の位置情報の両方のサポートを実装する必要があり、2Dまたは3Dマッピングリクエストを入力として受け入れることができます。"
    },
    {
      "indent": 6,
      "text": "Motivation: It is expected that queriers may provide either 2D or 3D data. When a 3D request is presented within an area only defined by 2D data within the mapping server, the mapping result would be the same as if the height or altitude coordinate had been omitted from the mapping request.",
      "ja": "動機：Querierが2Dまたは3Dデータを提供できることが期待されています。マッピングサーバー内の2Dデータによってのみ定義される領域内で3D要求が表示される場合、マッピング結果は、マッピングリクエストから高さまたは高度座標が省略されていた場合と同じです。"
    },
    {
      "indent": 3,
      "text": "Lo9. Database type indicator: The mapping protocol MAY support a mechanism that provides an indication describing a specific type of location database used.",
      "ja": "LO9。データベースタイプインジケーター：マッピングプロトコルは、使用される特定のタイプの位置データベースを説明する表示を提供するメカニズムをサポートする場合があります。"
    },
    {
      "indent": 6,
      "text": "Motivation: It is useful to know the source of the data stored in the database used for location validation, either for civic or geographic location matching. In the United States, sources of data could include the United States Postal Service, the Master Street Address Guide (MSAG), or commercial map data providers.",
      "ja": "動機：市民または地理的な場所のマッチングで、場所検証に使用されるデータベースに保存されているデータのソースを知ることは便利です。米国では、データのソースには、米国郵政公社、マスターストリートアドレスガイド（MSAG）、または商業マップデータプロバイダーが含まれます。"
    },
    {
      "indent": 0,
      "text": "7. Emergency Service Identifier",
      "section_title": true,
      "ja": "7. 緊急サービス識別子"
    },
    {
      "indent": 3,
      "text": "Emergency service identifiers are protocol constants that allow protocol entities, such as SIP proxy servers, to distinguish emergency calls from non-emergency calls and to identify the specific emergency service desired. Emergency service identifiers are a subclass of service identifiers that more generally identify services reachable by callers. An example of a service identifier is the service URN [RFC5031], but other identifiers, such as tel URIs [RFC3966], may also serve this role during a transition period.",
      "ja": "緊急サービス識別子は、SIPプロキシサーバーなどのプロトコルエンティティを許可するプロトコル定数であり、緊急コールと非緊急呼び出しを区別し、希望する特定の緊急サービスを特定できるようにします。緊急サービス識別子は、より一般的には発信者が到達可能なサービスを識別するサービス識別子のサブクラスです。サービス識別子の例はサービスURN [RFC5031]ですが、TelURIS [RFC3966]などの他の識別子も、移行期間中にこの役割を果たすことができます。"
    },
    {
      "indent": 3,
      "text": "Since this document only addresses emergency services, we use the terms \"emergency service identifier\" and \"service identifier\" interchangeably. Requirements for these identifiers include:",
      "ja": "このドキュメントは緊急サービスのみに対応するため、「緊急サービス識別子」と「サービス識別子」という用語を交換可能に使用します。これらの識別子の要件には次のものが含まれます。"
    },
    {
      "indent": 3,
      "text": "Id1. Multiple emergency services: The mapping protocol MUST be able to support different emergency services distinguished by different service identifiers.",
      "ja": "id1。複数の緊急サービス：マッピングプロトコルは、さまざまなサービス識別子によって区別されるさまざまな緊急サービスをサポートできる必要があります。"
    },
    {
      "indent": 6,
      "text": "Motivation: Some jurisdictions may offer multiple types of emergency services that operate independently and can be contacted directly; for example, fire, police, and ambulance services.",
      "ja": "動機：一部の管轄区域では、独立して動作し、直接連絡できる複数のタイプの緊急サービスを提供する場合があります。たとえば、火災、警察、救急車サービス。"
    },
    {
      "indent": 3,
      "text": "Id2. Extensible emergency service identifiers: The mapping protocol MUST support an extensible list of emergency identifiers, though it is not required to provide mappings for every possible service.",
      "ja": "id2。拡張可能な緊急サービス識別子：マッピングプロトコルは、緊急識別子の拡張可能なリストをサポートする必要がありますが、可能なすべてのサービスにマッピングを提供する必要はありません。"
    },
    {
      "indent": 6,
      "text": "Motivation: Extensibility is required since new emergency services may be introduced over time, either globally or in some jurisdictions. The availability of emergency services depends on the locations. For example, the Netherlands are unlikely to offer a mountain rescue service.",
      "ja": "動機：新しい緊急サービスは、グローバルまたは一部の管轄区域のいずれかで、時間の経過とともに導入される可能性があるため、拡張性が必要です。緊急サービスの可用性は、場所によって異なります。たとえば、オランダは山の救助サービスを提供する可能性は低いです。"
    },
    {
      "indent": 3,
      "text": "Id3. Discovery of emergency number: The mapping protocol MUST be able to return the location-dependent emergency number for the location indicated in the query.",
      "ja": "id3。緊急電話番号の発見：マッピングプロトコルは、クエリに示されている場所の場所に依存する緊急電話番号を返すことができなければなりません。"
    },
    {
      "indent": 6,
      "text": "Motivation: Users are trained to dial the appropriate emergency number to reach emergency services. There needs to be a way to figure out the emergency number at the current location of the caller.",
      "ja": "動機：ユーザーは、適切な緊急番号をダイヤルするようにトレーニングを受けて、緊急サービスに到達します。発信者の現在の場所で緊急番号を把握する方法が必要です。"
    },
    {
      "indent": 3,
      "text": "Id4. Home emergency number recognition: User equipment MUST be able to translate a home emergency number into an emergency service identifier.",
      "ja": "id4。家の緊急番号認識：ユーザー機器は、家庭用緊急番号を緊急サービス識別子に変換できる必要があります。"
    },
    {
      "indent": 6,
      "text": "Motivation: The UE could be pre-provisioned with the appropriate information in order to perform such a translation or could discover the emergency number by querying the mapping protocol with its home location.",
      "ja": "動機：UEは、そのような翻訳を実行するために適切な情報を事前に生成したり、自宅の場所でマッピングプロトコルを照会して緊急番号を発見することができます。"
    },
    {
      "indent": 3,
      "text": "Id5. Emergency number replacement: There SHOULD be support for replacement of the emergency number with the appropriate emergency service identifier for each signaling protocol used for an emergency call, based on local conventions, regulations, or preference (e.g., as in the case of an enterprise).",
      "ja": "id5。緊急電話番号の交換：緊急事態番号を、緊急コールに使用される各シグナル伝達プロトコルの適切な緊急サービス識別子を、現地の条約、規制、または好みに基づいて、緊急サービス識別子を交換することをサポートする必要があります（例えば、企業の場合のように）。"
    },
    {
      "indent": 6,
      "text": "Motivation: Any signaling protocol requires the use of some identifier to indicate the called party, and the user equipment may lack the capability to determine the actual service URL (PSAP URI). The use of local conventions may be required as a transition mechanism. Since relying on recognizing local numbering conventions makes it difficult for devices to be used outside their home context and for external devices to be introduced into a network, protocols should use standardized emergency service identifiers.",
      "ja": "動機：シグナル伝達プロトコルでは、識別子を使用して呼び出された当事者を示す必要があり、ユーザー機器には実際のサービスURL（PSAP URI）を決定する能力がない場合があります。遷移メカニズムとして、ローカル規則の使用が必要になる場合があります。ローカル番号の慣習を認識することに依存すると、デバイスをホームコンテキストの外で使用し、外部デバイスをネットワークに導入することが困難であるため、プロトコルは標準化された緊急サービス識別子を使用する必要があります。"
    },
    {
      "indent": 3,
      "text": "Id6. Emergency service identifier marking: Signaling protocols MUST support emergency service identifiers to mark a call as an emergency call.",
      "ja": "id6。緊急サービス識別子マーキング：シグナリングプロトコルは、緊急サービス識別子をサポートして、緊急通話としてコールをマークする必要があります。"
    },
    {
      "indent": 6,
      "text": "Motivation: Marking ensures proper handling as an emergency call by downstream elements that may not recognize, for example, a local variant of a logical emergency address. This marking mechanism is related to, but independent of, marking calls for prioritized call handling [RFC4412].",
      "ja": "動機：マーキングは、たとえば論理的な緊急住所のローカルバリアントを認識しない可能性のある下流要素による緊急コールとして適切な取り扱いを保証します。このマーキングメカニズムは、優先順位付けされたコール処理[RFC4412]の呼び出しに関連していますが、独立しています。"
    },
    {
      "indent": 3,
      "text": "Id7. Handling unrecognized emergency service identifiers: There MUST be support for calls that are initiated as emergency calls even if the specific emergency service requested is not recognized by the ESRP. Such calls will then be routed to a generic emergency service.",
      "ja": "id7。認識されていない緊急サービス識別子の処理：要求された特定の緊急サービスがESRPによって認識されない場合でも、緊急通話として開始されるコールをサポートする必要があります。そのような呼び出しは、一般的な緊急サービスにルーティングされます。"
    },
    {
      "indent": 6,
      "text": "Motivation: Fallback routing allows new emergency services to be introduced incrementally, while avoiding non-routable emergency calls. For example, a call for marine rescue services would be routed to a general PSAP if the caller's location does not offer marine rescue services yet.",
      "ja": "モチベーション：フォールバックルーティングにより、新しい緊急サービスを段階的に導入でき、不可能な緊急コールを避けます。たとえば、発信者の場所がまだ海洋救助サービスを提供していない場合、海洋救助サービスの呼びかけは一般的なPSAPにルーティングされます。"
    },
    {
      "indent": 3,
      "text": "Id8. Return fallback service identifier: The mapping protocol MUST be able to report back the actual service mapped if the mapping protocol substitutes another service for the one requested.",
      "ja": "id8。返品フォールバックサービス識別子：マッピングプロトコルは、マッピングプロトコルが要求されたサービスを別のサービスに置き換える場合、マッピングされた実際のサービスを報告できる必要があります。"
    },
    {
      "indent": 6,
      "text": "Motivation: A mapping server may be configured to automatically look up the PSAP for another service if the user-requested service is not available for that location. For example, if there is no marine rescue service, the mapping protocol might return the PSAP URL for general emergencies and include the \"urn:service.sos\" identifier in the response to alert the querier to that fact.",
      "ja": "モチベーション：ユーザーがリクエストしたサービスがその場所で利用できない場合、別のサービスのPSAPを自動的に検索するようにマッピングサーバーを構成することができます。たとえば、海洋救助サービスがない場合、マッピングプロトコルは一般的な緊急事態のPSAP URLを返し、その事実にクエリエに警告するために「urn：service.sos」識別子を含む可能性があります。"
    },
    {
      "indent": 3,
      "text": "Id9. Discovery of visited emergency numbers: The mapping protocol MUST support a mechanism to allow the end device to learn visited emergency numbers.",
      "ja": "id9。訪問された緊急番号の発見：マッピングプロトコルは、エンドデバイスが訪問した緊急番号を学習できるようにするメカニズムをサポートする必要があります。"
    },
    {
      "indent": 6,
      "text": "Motivation: Travelers visiting a foreign country may observe the local emergency number, e.g., seeing it painted on the side of a fire truck, and then rightfully expect to be able to dial that emergency number. Similarly, a local \"good Samaritan\" may use a tourist's cell phone to summon help.",
      "ja": "動機：外国を訪れる旅行者は、地元の緊急電話番号を観察するかもしれません。たとえば、消防車の側面に塗装されているのを見て、その緊急電話番号をダイヤルできることを正当に期待しています。同様に、地元の「良いサマリア人」は、観光客の携帯電話を使用してヘルプを召喚する場合があります。"
    },
    {
      "indent": 0,
      "text": "8. Mapping Protocol",
      "section_title": true,
      "ja": "8. マッピングプロトコル"
    },
    {
      "indent": 3,
      "text": "There are two basic approaches to invoke the mapping protocol. We refer to these as caller-based and mediated. In each case, the mapping client initiates a request to a mapping server via a mapping protocol. A proposed mapping protocol, LoST, is outlined in [lost].",
      "ja": "マッピングプロトコルを呼び出すための2つの基本的なアプローチがあります。これらを発信者ベースと媒介と呼びます。いずれの場合も、マッピングクライアントは、マッピングプロトコルを介してマッピングサーバーへの要求を開始します。提案されたマッピングプロトコル（Lost）は[Lost]で概説されています。"
    },
    {
      "indent": 3,
      "text": "For caller-based resolution, the caller's user agent invokes the mapping protocol to determine the appropriate PSAP based on the location provided. The resolution may take place well before the actual emergency call is placed, or at the time of the call.",
      "ja": "発信者ベースの解像度の場合、発信者のユーザーエージェントはマッピングプロトコルを呼び出して、提供された場所に基づいて適切なPSAPを決定します。解決策は、実際の緊急通話が行われる前、または呼び出し時に行われる可能性があります。"
    },
    {
      "indent": 3,
      "text": "For mediated resolution, an emergency call routing support entity, such as a SIP (outbound) proxy or redirect server, invokes the mapping service.",
      "ja": "媒介解像度のために、SIP（アウトバウンド）プロキシやリダイレクトサーバーなどの緊急通話ルーティングサポートエンティティがマッピングサービスを呼び出します。"
    },
    {
      "indent": 3,
      "text": "Since servers may be used as outbound proxy servers by clients that are not in the same geographic area as the proxy server, any proxy server has to be able to translate any caller location to the appropriate PSAP. (A traveler may, for example, accidentally or intentionally configure its home proxy server as its outbound proxy server, even while far away from home.)",
      "ja": "サーバーは、プロキシサーバーと同じ地理的領域にないクライアントがアウトバウンドプロキシサーバーとして使用できるため、プロキシサーバーは、発信者の場所を適切なPSAPに変換できる必要があります。（たとえば、旅行者は、自宅から遠く離れていても、偶然または意図的にホームプロキシサーバーをアウトバウンドプロキシサーバーとして構成することができます。）"
    },
    {
      "indent": 3,
      "text": "Ma1. Baseline query protocol: A mandatory-to-implement protocol MUST be specified.",
      "ja": "MA1。ベースラインクエリプロトコル：必須の実装プロトコルを指定する必要があります。"
    },
    {
      "indent": 6,
      "text": "Motivation: An over-abundance of similarly capable choices appears undesirable for interoperability.",
      "ja": "動機：同様に有能な選択肢の過剰豊富さは、相互運用性のために望ましくないように見えます。"
    },
    {
      "indent": 3,
      "text": "Ma2. Extensible protocol: The mapping protocol MUST be designed to support the extensibility of location data elements, both for new and existing fields.",
      "ja": "MA2。拡張可能なプロトコル：マッピングプロトコルは、新しいフィールドと既存のフィールドの両方で、位置データ要素の拡張性をサポートするように設計する必要があります。"
    },
    {
      "indent": 6,
      "text": "Motivation: This is needed, for example, to accommodate future extensions-to-location information that might be included in the PIDF-LO ([RFC4119]).",
      "ja": "動機：これは、たとえば、PIDF-LO（[RFC4119]）に含まれる可能性のある将来の拡張情報に対応するために必要です。"
    },
    {
      "indent": 3,
      "text": "Ma3. Incrementally deployable: The mapping protocol MUST be designed to support its incremental deployment.",
      "ja": "MA3。インクリメンタル展開：マッピングプロトコルは、増分展開をサポートするように設計する必要があります。"
    },
    {
      "indent": 6,
      "text": "Motivation: It must not be necessary, for example, to have a global street level database before deploying the system. It is acceptable to have some misrouting of calls when the database does not (yet) contain accurate PSAP service area information.",
      "ja": "動機：たとえば、システムを展開する前にグローバルストリートレベルのデータベースを持つ必要はないはずです。データベースに（まだ）正確なPSAPサービスエリア情報が含まれていない場合、コールの誤った誤った誤ったものを持つことは許容されます。"
    },
    {
      "indent": 3,
      "text": "Ma4. Any time mapping: The mapping protocol MUST support the ability of the mapping function to be invoked at any time, including while an emergency call is in process and before an emergency call is initiated.",
      "ja": "MA4。いつでもマッピング：マッピングプロトコルは、緊急通話が進行中および緊急通話が開始される前に、いつでも呼び出されるマッピング機能の機能をサポートする必要があります。"
    },
    {
      "indent": 6,
      "text": "Motivation: If the mapping query fails at call time, it may be advantageous to be able to fall back to the result of an earlier mapping query. This prior knowledge would be obtained by performing a mapping query at any time prior to an emergency call.",
      "ja": "動機：マッピングクエリが通話時に失敗した場合、以前のマッピングクエリの結果に戻ることができることが有利かもしれません。この事前知識は、緊急電話の前にいつでもマッピングクエリを実行することにより得られます。"
    },
    {
      "indent": 3,
      "text": "Ma5. Anywhere mapping: The mapping protocol MUST support the ability to provide mapping information in response to an individual query from any (earthly) location, regardless of where the mapping client is located, either geographically or by network location.",
      "ja": "MA5。どこでもマッピング：マッピングプロトコルは、地理的またはネットワークの場所のいずれかで、マッピングクライアントがどこにあるかに関係なく、任意の（地球の）場所からの個々のクエリに応じてマッピング情報を提供する機能をサポートする必要があります。"
    },
    {
      "indent": 6,
      "text": "Motivation: The mapping client, such as an ESRP, may not necessarily be anywhere close to the caller or the appropriate PSAP, but must still be able to obtain mapping information.",
      "ja": "動機：ESRPなどのマッピングクライアントは、必ずしも発信者や適切なPSAPに近い場所にあるとは限りませんが、マッピング情報を取得できる必要があります。"
    },
    {
      "indent": 3,
      "text": "Ma6. Appropriate PSAP: The mapping protocol MUST support the routing of an emergency call to the PSAP responsible for a particular geographic area.",
      "ja": "MA6。適切なPSAP：マッピングプロトコルは、特定の地理的領域を担当するPSAPへの緊急コールのルーティングをサポートする必要があります。"
    },
    {
      "indent": 6,
      "text": "Motivation: Routing to the wrong PSAP will result in delays in handling emergencies as calls are redirected, and therefore will also result in inefficient use of PSAP resources at the initial point of contact. It is important that the location determination mechanism not be fooled by the location of IP telephony gateways or dial-in lines into a corporate LAN (and dispatch emergency help to the gateway or campus, rather than the caller), multi-site LANs and similar arrangements.",
      "ja": "動機：間違ったPSAPへのルーティングは、呼び出しがリダイレクトされるため、緊急事態の処理が遅れ、したがって、最初の接触点でPSAPリソースを非効率的に使用することになります。IPテレフォニーゲートウェイやダイヤルインラインの場所によって、企業LANへのダイヤルインライン（および発信者ではなくゲートウェイやキャンパスへの緊急ヘルプを派遣）によって、場所の決定メカニズムがだまされないことが重要です。マルチサイトLANなど段取り。"
    },
    {
      "indent": 3,
      "text": "Ma7. Multiple PSAP URIs: The mapping protocol MUST support a method to return multiple PSAP URIs, which cover the same geographic area.",
      "ja": "MA7。複数のPSAP URI：マッピングプロトコルは、同じ地理的領域をカバーする複数のPSAP URIを返す方法をサポートする必要があります。"
    },
    {
      "indent": 6,
      "text": "Motivation: Different contact protocols (e.g., PSTN via tel URIs and IP via SIP URIs) may be routed to different PSAPs. Less likely, two PSAPs may overlap in their coverage region.",
      "ja": "動機：異なる連絡先プロトコル（たとえば、Tel URIを介したPSTNおよびSIP URIを介したIP）は、異なるPSAPにルーティングされる場合があります。可能性は低いため、2つのPSAPがカバレッジ領域で重複する可能性があります。"
    },
    {
      "indent": 3,
      "text": "Ma8. Single primary URI per contact protocol: Though the mapping protocol may be able to include multiple URIs in the response, it SHOULD return only one primary URI per contact protocol used, so that clients are not required to select among different targets for the same contact protocol.",
      "ja": "MA8。単一のプライマリURI連絡先プロトコル：マッピングプロトコルは応答に複数のURIを含めることができますが、使用した連絡先プロトコルごとに1つのプライマリURIのみを返す必要があるため、クライアントは同じ連絡先プロトコルの異なるターゲットから選択する必要はありません。。"
    },
    {
      "indent": 6,
      "text": "Motivation: There may be two or more URIs returned when multiple contact protocols are available (e.g., SIP and SMS). The client may select among multiple contact protocols based on its capabilities, preference settings, or availability.",
      "ja": "動機：複数の接触プロトコルが利用可能になったときに2つ以上のURIが返される場合があります（SIPやSMSなど）。クライアントは、その機能、設定設定、または可用性に基づいて、複数の連絡先プロトコルを選択できます。"
    },
    {
      "indent": 3,
      "text": "Ma9. Non-preferred URI schemes: The mapping protocol MAY support the return of a less-preferred URI scheme, such as a tel URI.",
      "ja": "MA9。非適切なURIスキーム：マッピングプロトコルは、Tel URIなどの非提携URIスキームの復帰をサポートする場合があります。"
    },
    {
      "indent": 6,
      "text": "Motivation: In order to provide incremental support to non-IP PSAPs, it may be necessary to be able to complete an emergency call via the PSTN.",
      "ja": "動機：IP以外のPSAPに漸進的なサポートを提供するには、PSTNを介して緊急電話を完了する必要がある場合があります。"
    },
    {
      "indent": 3,
      "text": "Ma10. URI properties: The mapping protocol MUST support the ability to provide ancillary information about a contact that allows the mapping client to determine relevant properties of the PSAP URI.",
      "ja": "MA10。URIプロパティ：マッピングプロトコルは、マッピングクライアントがPSAP URIの関連プロパティを決定できるようにする連絡先に関する補助情報を提供する機能をサポートする必要があります。"
    },
    {
      "indent": 6,
      "text": "Motivation: In some cases, the same geographic area is served by several PSAPs; for example, a corporate campus might be served by both a corporate security department and the municipal PSAP. The mapping protocol should then return URIs for both, with information allowing the querying entity to choose one or the other. This determination could be made by either an ESRP, based on local policy, or by direct user choice, in the case of caller-based methods.",
      "ja": "動機：場合によっては、同じ地理的領域にいくつかのPSAPが提供されます。たとえば、コーポレートキャンパスには、企業のセキュリティ部門と自治体のPSAPの両方が提供される場合があります。マッピングプロトコルは、クエリエンティティがいずれかを選択できるようにする情報を使用して、両方に対してURIを返す必要があります。この決定は、発信者ベースの方法の場合、ローカルポリシーに基づいて、または直接ユーザーの選択に基づいて、ESRPによって行うことができます。"
    },
    {
      "indent": 3,
      "text": "Ma11. Mapping referral: The mapping protocol MUST support a mechanism for the mapping client to contact any mapping server and be referred to another mapping server that is more qualified to answer the query.",
      "ja": "MA11。マッピング紹介：マッピングプロトコルは、マッピングクライアントが任意のマッピングサーバーに連絡するメカニズムをサポートし、クエリに応答する資格のある別のマッピングサーバーに紹介する必要があります。"
    },
    {
      "indent": 6,
      "text": "Motivation: Referrals help mitigate the impact of incorrect configuration that directs a client to the wrong initial mapping server.",
      "ja": "動機：紹介は、クライアントを間違った初期マッピングサーバーに指示する誤った構成の影響を軽減するのに役立ちます。"
    },
    {
      "indent": 3,
      "text": "Ma12. Split responsibility: The mapping protocol MUST support the division of data subset handling between multiple mapping servers within a single level of a civic location hierarchy.",
      "ja": "MA12。分割責任：マッピングプロトコルは、シビックロケーション階層の単一レベル内の複数のマッピングサーバー間のデータサブセット処理の分割をサポートする必要があります。"
    },
    {
      "indent": 6,
      "text": "Motivation: For example, two mapping servers for the same city or county may handle different streets within that city or county.",
      "ja": "動機：たとえば、同じ都市または郡の2つのマッピングサーバーは、その都市または郡内の異なる通りを処理する場合があります。"
    },
    {
      "indent": 3,
      "text": "Ma13. URL for error reporting: The mapping protocol MUST support the ability to return a URL that can be used to report a suspected or known error within the mapping database.",
      "ja": "MA13。エラーレポートのURL：マッピングプロトコルは、マッピングデータベース内で疑わしいエラーまたは既知のエラーを報告するために使用できるURLを返す機能をサポートする必要があります。"
    },
    {
      "indent": 6,
      "text": "Motivation: If an error is returned, for example, there needs to be a URL that points to a resource that can explain or potentially help resolve the error.",
      "ja": "動機：たとえば、エラーが返された場合、エラーを説明または解決するのに役立つリソースを指すURLが必要です。"
    },
    {
      "indent": 3,
      "text": "Ma14. Resilience to mapping server failure: The mapping protocol MUST support a mechanism that enables the client to fail over to different (replica) mapping server.",
      "ja": "MA14。マッピングサーバーの障害に対する回復力：マッピングプロトコルは、クライアントが異なる（レプリカ）マッピングサーバーに失敗できるようにするメカニズムをサポートする必要があります。"
    },
    {
      "indent": 6,
      "text": "Motivation: The failure of a mapping server should not preclude the mapping client from receiving an answer to its query.",
      "ja": "モチベーション：マッピングサーバーの障害により、マッピングクライアントがクエリに対する回答を受信することを妨げるものではありません。"
    },
    {
      "indent": 3,
      "text": "Ma15. Traceable resolution: The mapping protocol SHOULD support the ability of the mapping client to be able to determine the entity or entities that provided the emergency address resolution information.",
      "ja": "MA15。追跡可能な解像度：マッピングプロトコルは、マッピングクライアントが緊急住所解決情報を提供するエンティティまたはエンティティを決定できるようにする機能をサポートする必要があります。"
    },
    {
      "indent": 6,
      "text": "Motivation: To improve reliability and performance, it is important to be able to trace which servers contributed to the resolution of a query.",
      "ja": "動機：信頼性とパフォーマンスを向上させるには、どのサーバーがクエリの解決に寄与したかを追跡できることが重要です。"
    },
    {
      "indent": 3,
      "text": "Ma16. Minimal additional delay: Mapping protocol execution SHOULD minimize the amount of delay within the overall call-setup time.",
      "ja": "MA16。追加の追加遅延：マッピングプロトコル実行は、コールセットアップ時間全体の遅延量を最小限に抑える必要があります。"
    },
    {
      "indent": 6,
      "text": "Motivation: Since outbound proxies will likely be asked to resolve the same geographic coordinates repeatedly, a suitable time-limited caching mechanism should be supported.",
      "ja": "動機：アウトバウンドプロキシは、同じ地理的座標を繰り返し解決するように求められる可能性が高いため、適切な時間制限されたキャッシュメカニズムをサポートする必要があります。"
    },
    {
      "indent": 3,
      "text": "Ma17. Freshness indication: The mapping protocol SHOULD support an indicator describing how current the information provided by the mapping source is.",
      "ja": "MA17。新鮮さの表示：マッピングプロトコルは、マッピングソースによって提供される情報がどのように電流であるかを説明するインジケータをサポートする必要があります。"
    },
    {
      "indent": 6,
      "text": "Motivation: This is especially useful when an alternate mapping is requested, and alternative sources of mapping data may not have been created or updated with the same set of information or within the same time frame. Differences in currency between mapping data contained within mapping sources should be minimized.",
      "ja": "動機：これは、代替マッピングが要求され、マッピングデータの代替ソースが同じ情報セットまたは同じ時間枠内で作成または更新されていない場合に特に役立ちます。マッピングソース内に含まれるマッピングデータ間の通貨の違いを最小限に抑える必要があります。"
    },
    {
      "indent": 0,
      "text": "9. Security Considerations",
      "section_title": true,
      "ja": "9. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "Threats and security requirements are discussed in a separate document [RFC5069].",
      "ja": "脅威とセキュリティの要件は、別のドキュメント[RFC5069]で説明されています。"
    },
    {
      "indent": 0,
      "text": "10. Contributors",
      "section_title": true,
      "ja": "10. 貢献者"
    },
    {
      "indent": 3,
      "text": "The information in this document is partially derived from text written by the following contributors:",
      "ja": "このドキュメントの情報は、次の貢献者によって書かれたテキストから部分的に導き出されます。"
    },
    {
      "indent": 3,
      "text": "Nadine Abbott nabbott@telcordia.com",
      "ja": "Nadine Abbott nabbott@telcordia.com"
    },
    {
      "indent": 3,
      "text": "Hideki Arai arai859@oki.com",
      "ja": "hideki arai arai859@oki.com"
    },
    {
      "indent": 3,
      "text": "Martin Dawson Martin.Dawson@andrew.com",
      "ja": "Martin Dawson Martin.dawson@andrew.com"
    },
    {
      "indent": 3,
      "text": "Motoharu Kawanishi kawanishi381@oki.com",
      "ja": "Motoharu Kawanishi Kawanishi381@oki.com"
    },
    {
      "indent": 3,
      "text": "Brian Rosen br@brianrosen.net",
      "ja": "Brian Rosen br@brianrosen.net"
    },
    {
      "indent": 3,
      "text": "Richard Stastny Richard.Stastny@oefeg.at",
      "ja": "Richard Stastny Richard.stastny@oefeg.at"
    },
    {
      "indent": 3,
      "text": "Martin Thomson Martin.Thomson@andrew.com",
      "ja": "Martin Thomson Martin.thomson@andrew.com"
    },
    {
      "indent": 3,
      "text": "James Winterbottom James.Winterbottom@andrew.com",
      "ja": "James Winterbottom James.winterbottom@andrew.com"
    },
    {
      "indent": 0,
      "text": "11. Acknowledgments",
      "section_title": true,
      "ja": "11. 謝辞"
    },
    {
      "indent": 3,
      "text": "In addition to thanking those listed above, we would like to also thank Guy Caron, Barry Dingle, Keith Drage, Tim Dunn, Patrik Faltstrom, Clive D.W. Feather, Raymond Forbes, Randall Gellens, Michael Haberler, Michael Hammer, Ted Hardie, Gunnar Hellstrom, Cullen Jennings, Marc Linsner, Rohan Mahy, Patti McCalmont, Don Mitchell, John Morris, Andrew Newton, Steve Norreys, Jon Peterson, James Polk, Benny Rodrig, John Rosenberg, Jonathan Rosenberg, John Schnizlein, Shida Schubert, James Seng, Byron Smith, Barbara Stark, Richard Stastny, Tom Taylor, Hannes Tschofenig, and Nate Wilcox for their helpful input.",
      "ja": "上記のものに感謝することに加えて、Guy Caron、Barry Dingle、Keith Drage、Tim Dunn、Patrik Faltstrom、Clive D.W.フェザー、レイモンド・フォーブス、ランドール・ゲレンズ、マイケル・ハーバーラー、マイケル・ハンマー、テッド・ハーディ、ガンナール・ヘルストロム、カレン・ジェニングス、マーク・リンナー、ロハン・マヒー、パティ・マッカルモント、ドン・ミッチェル、ジョン・モリス、アンドリュー・ニュートン、スティーブ・ノーリーズ、ジョン・ペットソン、ジェームズ・ペットソンベニー・ロドリグ、ジョン・ローゼンバーグ、ジョナサン・ローゼンバーグ、ジョン・シューニズライン、シダ・シューベルト、ジェームズ・セン、バイロン・スミス、バーバラ・スターク、リチャード・スタスティニー、トム・テイラー、ハネス・ツェフェニグ、ネイト・ウィルコックスの有益な入力。"
    },
    {
      "indent": 0,
      "text": "12. References",
      "section_title": true,
      "ja": "12. 参考文献"
    },
    {
      "indent": 0,
      "text": "12.1. Normative References",
      "section_title": true,
      "ja": "12.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119] Bradner、S。、「要件レベルを示すためにRFCで使用するためのキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 0,
      "text": "12.2. Informative References",
      "section_title": true,
      "ja": "12.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[RFC3261] Rosenberg, J., Schulzrinne, H., Camarillo, G., Johnston, A., Peterson, J., Sparks, R., Handley, M., and E. Schooler, \"SIP: Session Initiation Protocol\", RFC 3261, June 2002.",
      "ja": "[RFC3261] Rosenberg、J.、Schulzrinne、H.、Camarillo、G.、Johnston、A.、Peterson、J.、Sparks、R.、Handley、M。、およびE. Schooler、「SIP：SESSION INTIANIATION Protocol」、RFC 3261、2002年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC3351] Charlton, N., Gasson, M., Gybels, G., Spanner, M., and A. van Wijk, \"User Requirements for the Session Initiation Protocol (SIP) in Support of Deaf, Hard of Hearing and Speech-impaired Individuals\", RFC 3351, August 2002.",
      "ja": "[RFC3351] Charlton、N.、Gasson、M.、Gybels、G.、Spanner、M.、およびA. Van Wijk、「聴覚障害、聴覚、スピーチをサポートするセッション開始プロトコル（SIP）のユーザー要件 - 障害のある個人」、RFC 3351、2002年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC3693] Cuellar, J., Morris, J., Mulligan, D., Peterson, J., and J. Polk, \"Geopriv Requirements\", RFC 3693, February 2004.",
      "ja": "[RFC3693] Cuellar、J.、Morris、J.、Mulligan、D.、Peterson、J.、およびJ. Polk、「Geopriv Recomission」、RFC 3693、2004年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC3860] Peterson, J., \"Common Profile for Instant Messaging (CPIM)\", RFC 3860, August 2004.",
      "ja": "[RFC3860]ピーターソン、J。、「インスタントメッセージングの共通プロファイル（CPIM）」、RFC 3860、2004年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC3966] Schulzrinne, H., \"The tel URI for Telephone Numbers\", RFC 3966, December 2004.",
      "ja": "[RFC3966] Schulzrinne、H。、「電話番号のTel URI」、RFC 3966、2004年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC4103] Hellstrom, G. and P. Jones, \"RTP Payload for Text Conversation\", RFC 4103, June 2005.",
      "ja": "[RFC4103] Hellstrom、G。およびP. Jones、「テキスト会話のためのRTPペイロード」、RFC 4103、2005年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC4119] Peterson, J., \"A Presence-based GEOPRIV Location Object Format\", RFC 4119, December 2005.",
      "ja": "[RFC4119] Peterson、J。、「存在ベースのGeoprivロケーションオブジェクト形式」、RFC 4119、2005年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC4412] Schulzrinne, H. and J. Polk, \"Communications Resource Priority for the Session Initiation Protocol (SIP)\", RFC 4412, February 2006.",
      "ja": "[RFC4412] Schulzrinne、H。およびJ. Polk、「セッション開始プロトコル（SIP）の通信リソースの優先順位」、RFC 4412、2006年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC5031] Schulzrinne, H., \"A Uniform Resource Name (URN) for Emergency and Other Well-Known Services\", RFC 5031, January 2008.",
      "ja": "[RFC5031] Schulzrinne、H。、「緊急およびその他の有名なサービスのためのユニフォームリソース名（URN）」、RFC 5031、2008年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC5069] Taylor, T., Ed., Tschofenig, H., Schulzrinne, H., and M. Shanmugam, \"Security Threats and Requirements for Emergency Call Marking and Mapping\", RFC 5069, January 2008.",
      "ja": "[RFC5069] Taylor、T.、Ed。、Tschofenig、H.、Schulzrinne、H。、およびM. Shanmugam、「緊急コールマーキングとマッピングのセキュリティの脅威と要件」、RFC 5069、2008年1月。"
    },
    {
      "indent": 3,
      "text": "[lost] Hardie, T., \"LoST: A Location-to-Service Translation Protocol\", Work in Progress, August 2007.",
      "ja": "[Lost] Hardie、T。、「Lost：A Location-s-Service translation Protocol」、2007年8月、作業中。"
    },
    {
      "indent": 3,
      "text": "[toip] Wijk, A. and G. Gybels, \"Framework for real-time text over IP using the Session Initiation Protocol (SIP)\", Work in Progress, August 2006.",
      "ja": "[TOIP] Wijk、A。、およびG. Gybels、「セッション開始プロトコル（SIP）を使用したIP上のリアルタイムテキストのフレームワーク」、2006年8月の作業。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Henning Schulzrinne Columbia University Department of Computer Science 450 Computer Science Building New York, NY 10027 US",
      "ja": "ヘニングシュルツリンコロンビア大学コンピュータサイエンス学科450コンピューターサイエンスビル、ニューヨーク、ニューヨーク10027米国"
    },
    {
      "indent": 3,
      "text": "Phone: +1 212 939 7004\nEMail: hgs+ecrit@cs.columbia.edu\nURI:   http://www.cs.columbia.edu",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Roger Marshall (editor) TeleCommunication Systems, Inc. 2401 Elliott Avenue 2nd Floor Seattle, WA 98121 US",
      "ja": "Roger Marshall（編集者）Telecommunication Systems、Inc。2401 Elliott Avenue 2階シアトル、ワシントン州98121 US"
    },
    {
      "indent": 3,
      "text": "Phone: +1 206 792 2424\nEMail: rmarshall@telecomsys.com\nURI:   http://www.telecomsys.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The IETF Trust (2008).",
      "ja": "著作権（c）The IETF Trust（2008）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "この文書は、BCP 78に含まれる権利、ライセンス、および制限の対象となり、そこに記載されている場合を除き、著者はすべての権利を保持しています。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE IETF TRUST AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "このドキュメントとここに含まれる情報は、「現状のまま」に基づいて提供され、貢献者、彼/彼女が代表する組織（もしあれば）、インターネット協会、IETFトラスト、インターネットエンジニアリングタスクフォースがすべてを否認します。明示的または黙示的な保証。ここでの情報の使用は、特定の目的に対する商品性または適合性の権利または暗黙の保証を侵害しないという保証を含むがこれらに限定されない。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、知的財産権またはその他の権利の有効性または範囲に関して、本書に記載されている技術の実装または使用、またはそのような権利に基づくライセンスに基づくライセンスの範囲に関連すると主張される可能性のある他の権利に関しては、立場を取得しません。利用可能になります。また、そのような権利を特定するために独立した努力をしたことも表明していません。RFCドキュメントの権利に関する手順に関する情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IETF事務局に行われたIPR開示のコピーと、利用可能にするライセンスの保証、またはこの仕様の実装者またはユーザーによるそのような独自の権利の使用のための一般的なライセンスまたは許可を取得するための試みの結果を取得できます。http://www.ietf.org/iprのIETFオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、関心のある当事者に、著作権、特許、または特許出願、またはこの基準を実装するために必要な技術をカバーする可能性のあるその他の独自の権利を注意深く招待するよう招待しています。ietf-ipr@ietf.orgのIETFへの情報をお問い合わせください。"
    }
  ]
}