{
  "title": {
    "text": "RFC 9017 - Special-Purpose Label Terminology",
    "ja": "RFC 9017 - 専用ラベル用語"
  },
  "number": 9017,
  "created_at": "2021-04-25 09:37:15.932811+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                      L. Andersson\nRequest for Comments: 9017                      Bronze Dragon Consulting\nUpdates: 3032, 7274                                          K. Kompella\nCategory: Standards Track                               Juniper Networks\nISSN: 2070-1721                                                A. Farrel\n                                                      Old Dog Consulting\n                                                              April 2021",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 19,
      "text": "Special-Purpose Label Terminology",
      "ja": "専用ラベル用語"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document discusses and recommends terminology that may be used when MPLS Special-Purpose Labels (SPLs) are specified and documented.",
      "ja": "この文書は、MPLS特殊目的ラベル（SPL）が指定され文書化されているときに使用できる用語について説明し、推奨します。"
    },
    {
      "indent": 3,
      "text": "This document applies that terminology change to the relevant IANA registry and also clarifies the use of the Entropy Label Indicator (7) when immediately preceded by the Extension Label (15).",
      "ja": "この文書は、関連するIANAレジストリへのその用語の変更を適用し、拡張ラベル（15）の直前にエントロピーラベルインジケータ（7）の使用を明確にします。"
    },
    {
      "indent": 3,
      "text": "This document updates RFCs 3032 and 7274.",
      "ja": "この文書はRFCS 3032および7274を更新します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これはインターネット規格のトラック文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 7841.",
      "ja": "この文書は、インターネットエンジニアリングタスクフォース（IETF）の製品です。IETFコミュニティのコンセンサスを表します。それは公開レビューを受け、インターネットエンジニアリングステアリンググループ（IESG）による出版の承認を受けました。インターネット規格に関する詳細情報は、RFC 7841のセクション2で利用できます。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at https://www.rfc-editor.org/info/rfc9017.",
      "ja": "この文書の現在のステータス、任意のエラータ、およびフィードバックを提供する方法に関する情報は、https://www.rfc-editor.org/info/frfc9017で入手できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2021 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2021 IETF信頼と文書著者として識別された人。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (https://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "このドキュメントは、このドキュメントの発行日に有効なBCP 78およびIETFドキュメントに関連するIETFトラストの法的規定（https://trustee.ietf.org/license-info）の対象となります。 これらのドキュメントは、このドキュメントに関するお客様の権利と制限について説明しているため、注意深く確認してください。 このドキュメントから抽出されたコードコンポーネントには、Trust LegalProvisionsのセクション4.eで説明されているSimplifiedBSD Licenseテキストが含まれている必要があり、Simplified BSDLicenseで説明されているように保証なしで提供されます。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction\n  1.1.  Terminology\n2.  Background\n  2.1.  GMPLS Special-Purpose Labels\n3.  Terminology and Abbreviations\n4.  Clarification on Handling of the Entropy Label Indicator\n5.  Security Considerations\n6.  IANA Considerations\n7.  References\n  7.1.  Normative References\n  7.2.  Informative References\nAcknowledgements\nContributors\nAuthors' Addresses",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "RFC 7274 [RFC7274] made some changes to the terminology used for MPLS Special-Purpose Labels but did not define consistent terminology.",
      "ja": "RFC 7274 [RFC7274] MPLS専用ラベルに使用される用語にいくつかの変更を加えましたが、一貫した用語を定義していませんでした。"
    },
    {
      "indent": 3,
      "text": "One thing that RFC 7274 did was to deprecate the use of the term \"reserved labels\" when describing a range of labels allocated from a registry maintained by IANA. The term \"Reserved\" in such a registry means \"set aside, not to be used\", but that range of labels was available for allocation according to the policies set out in that registry. The name \"Special-Purpose Labels\" was introduced in RFC 7274 in place of the previous term, and the abbreviation \"SPL\" was recommended.",
      "ja": "RFC 7274がしたことの1つのことは、IANAによって維持されたレジストリから割り当てられたラベルの範囲を記述するときの「予約ラベル」という用語の使用を廃止することでした。このようなレジストリ内の「予約済み」という用語は、「使用されないように設定されている」という意味であるが、そのレジストリに記載されているポリシーに従って割り当てのためにラベルの範囲が利用可能であった。「専用ラベル」という名前は、前の用語の代わりにRFC 7274で導入され、略語「SPL」が推奨されました。"
    },
    {
      "indent": 3,
      "text": "At the time of writing the first draft version of this document, the IETF was in the process of allocating the very first SPLs from the Extended SPL (eSPL) range [RFC8595]. This document discusses and recommends terminology and abbreviations to be used when talking about and documenting Special-Purpose Labels.",
      "ja": "この文書の最初のドラフト版を書くときに、IETFは拡張SPL（ESPL）範囲[RFC8595]から非常に最初のSPLを割り当てるプロセスにありました。この文書は、専用のラベルについて話して文書化するときに使用される用語と略語について説明し、勧告を推奨しています。"
    },
    {
      "indent": 3,
      "text": "This document updates RFC 3032 [RFC3032] and RFC 7274 [RFC7274] in that it changes the terminology for both Base SPLs (previously referred to simply as \"Special-Purpose Labels\") and Extended SPLs.",
      "ja": "このドキュメントは、RFC 3032 [RFC3032]とRFC 7274 [RFC7274]を更新します（これまでに「専用ラベル」とは単に「特殊目的のラベル」と呼ばれる）と拡張SPLの両方の用語を変更します。"
    },
    {
      "indent": 3,
      "text": "This document applies that terminology change to the relevant IANA registry and also clarifies the use of the Entropy Label Indicator (7) when immediately preceded by the Extension Label (15).",
      "ja": "この文書は、関連するIANAレジストリへのその用語の変更を適用し、拡張ラベル（15）の直前にエントロピーラベルインジケータ（7）の使用を明確にします。"
    },
    {
      "indent": 0,
      "text": "1.1. Terminology",
      "section_title": true,
      "ja": "1.1. 用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14 [RFC2119] [RFC8174] when, and only when, they appear in all capitals, as shown here.",
      "ja": "この文書のキーワード \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", および \"OPTIONAL\" はBCP 14 [RFC2119] [RFC8174]で説明されているように、すべて大文字の場合にのみ解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. Background",
      "section_title": true,
      "ja": "2. バックグラウンド"
    },
    {
      "indent": 3,
      "text": "Two sets of SPLs are defined for use in MPLS:",
      "ja": "MPLSでの使用には2セットのSPLが定義されています。"
    },
    {
      "indent": 3,
      "text": "* The range 0-15 (Base Special-Purpose Labels (bSPLs) as described in this document) is specified in RFC 3032 [RFC3032].",
      "ja": "* 0~15の範囲（この文書に記載されている基本専用ラベル（BSPL））は、RFC 3032 [RFC3032]に規定されています。"
    },
    {
      "indent": 3,
      "text": "* The range 0-1048575 of eSPLs is specified in RFC 7274 [RFC7274].",
      "ja": "* ESPLSの範囲はRFC 7274 [RFC7274]に指定されています。"
    },
    {
      "indent": 6,
      "text": "- The values 0-15 have been reserved and are never to be allocated.",
      "ja": "- 値0~15は予約されており、割り当てられていません。"
    },
    {
      "indent": 6,
      "text": "- The values 16-239 are available for allocation.",
      "ja": "- 値16~239は割り当て可能です。"
    },
    {
      "indent": 6,
      "text": "- The values 240-255 are for experimental use.",
      "ja": "- 値240~255は実験的な使用のためのものです。"
    },
    {
      "indent": 6,
      "text": "- The values 256-1048575 are currently not available for allocation. A Standards Track RFC would be needed to change this rule, and that RFC would need to define the ranges that are made available for allocation and the registration policy for those ranges.",
      "ja": "- 値256-1048575は現在割り当てには利用できません。この規則を変更するために標準トラックRFCが必要になり、RFCはそれらの範囲の割り当ておよび登録ポリシーに使用できる範囲を定義する必要があります。"
    },
    {
      "indent": 0,
      "text": "2.1. GMPLS Special-Purpose Labels",
      "section_title": true,
      "ja": "2.1. GMPLS専用ラベル"
    },
    {
      "indent": 3,
      "text": "Note that IANA maintains a registry that is called \"Special-Purpose Generalized Label Values\". Labels in that registry have special meaning when present in certain signaling objects, are 32 bits long, and are not to be confused with MPLS forwarding-plane labels. This document does not make any changes to the GMPLS registry or to how labels from that registry are described.",
      "ja": "IANAは、「特殊な一般化されたラベル値」と呼ばれるレジストリを管理しています。そのレジストリのラベルは、特定のシグナリングオブジェクトに存在するときに特別な意味を持ち、32ビットの長さで、MPLS転送プレーンラベルと混同されません。このドキュメントは、GMPLSレジストリを変更したり、そのレジストリーのラベルについて説明したりしません。"
    },
    {
      "indent": 0,
      "text": "3. Terminology and Abbreviations",
      "section_title": true,
      "ja": "3. 用語と略語"
    },
    {
      "indent": 3,
      "text": "Prior to the publication of this document, IANA maintained a name space for \"Special-Purpose Multiprotocol Label Switching (MPLS) Label Values\" code points [SPL-NAME-SPACE]. Within this name space, there are two registries. One was called the \"Special-Purpose MPLS Label Values\" registry [bSPL]. The other was called the \"Extended Special-Purpose MPLS Label Values\" registry [eSPL].",
      "ja": "この文書の公表の前に、IANAは「専用のマルチプロトコルラベルスイッチング（MPLS）ラベル値」コードポイント[SPL-NAME-SPACE]の名前空間を維持しました。この名前空間内には、2つのレジストリがあります。1つは「特殊目的のMPLSラベル値」レジストリ[BSPL]と呼ばれていました。もう1つは「拡張専用MPLSラベル値」レジストリ[ESPL]と呼ばれていました。"
    },
    {
      "indent": 3,
      "text": "The difference in the name of the name space and the first registry is only that the MPLS abbreviation is expanded. This document makes no change to the name of the name space itself (i.e., \"Special-Purpose Multiprotocol Label Switching (MPLS) Label Values\"). This document changes the name of the first registry to \"Base Special-Purpose MPLS Label Values\" but leaves the name of the latter registry unchanged as \"Extended Special-Purpose MPLS Label Values\".",
      "ja": "名前空間の名前と最初のレジストリの名前の違いは、MPLSの省略形が拡張されているだけです。この文書は、名前空間自体の名前を変更しない（すなわち、特殊目的のマルチプロトコルラベルスイッチング（MPLS）ラベル値」）。この文書は、最初のレジストリの名前を \"Base Special-Purpose MPLSラベル値\"に変更しますが、後者のレジストリの名前が「拡張特殊目的のMPLSラベル値」として変更されます。"
    },
    {
      "indent": 3,
      "text": "The following conventions will be used in specifications and when talking about SPLs.",
      "ja": "以下の規則は仕様書およびSPLについて話すときに使用されます。"
    },
    {
      "indent": 3,
      "text": "* Collectively, the two (unrelated) ranges (0-15 and 16-1048575) are known as \"Special-Purpose Labels\" (SPLs).",
      "ja": "* まとめると、2つの（無関係な）範囲（0-15および16-1048575）は、「特殊目的のラベル」（SPL）として知られています。"
    },
    {
      "indent": 3,
      "text": "* SPLs from the range 0-15 are called \"Base Special-Purpose Labels\" (bSPLs).",
      "ja": "* 0~15の範囲からのSPLを「ベース専用ラベル」（BSPL）と呼びます。"
    },
    {
      "indent": 3,
      "text": "* SPLs from the range 16-1048575 are called \"Extended Special-Purpose Labels\" (eSPLs). (Note that the reserved values 0-15 from the \"Extended Special-Purpose MPLS Label Values\" registry do not need a name, as they are not available for allocation and MUST NOT be used.)",
      "ja": "* 16-1048575の範囲からのSPLを「拡張専用ラベル」（ESPL）と呼ばれます。（「拡張特殊目的MPLSラベル値」レジストリからの予約値0~15は、割り当てに使用できないため、使用できず、使用しないでください。）"
    },
    {
      "indent": 3,
      "text": "* The combination of the Extension Label (XL) (value 15, which is a bSPL and is also called the \"xSPL\") and an eSPL is called a \"Composite Special-Purpose Label\" (cSPL).",
      "ja": "* 拡張ラベル（XL）の組み合わせ（BSPLで、「XSPL」とも呼ばれる）、ESPLを「複合専用ラベル」（CSPL）と呼ばれます。"
    },
    {
      "indent": 3,
      "text": "This results in label stacks such as the examples shown in Figures 1 and 2.",
      "ja": "これにより、図1および図2に示す例のようなラベルスタックが得られる。"
    },
    {
      "indent": 9,
      "text": "          0                                  31\n          |     MPLS Label Stack entry        |\n          +--------+--------+--------+--------+\n          |     MPLS Label Stack entry        |\n          +--------+--------+--------+--------+\nbSPL      |             Base SPL              |\n          +--------+--------+--------+--------+\n          |  MPLS Label Stack entry (cont.)   |",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 22,
      "text": "Figure 1: Example of Label Stack",
      "ja": "図1：ラベルスタックの例"
    },
    {
      "indent": 9,
      "text": "          0                                  31\n          |     MPLS Label Stack entry        |\n          +--------+--------+--------+--------+\n          |     MPLS Label Stack entry        |\n          +--------+--------+--------+--------+\nxSPL      |       Extension Label (XL)        | <--+\n          +--------+--------+--------+--------+    |--- cSPL\neSPL      |           Extended SPL            | <--+\n          +--------+--------+--------+--------+\n          |  MPLS Label Stack entry (cont.)   |",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 22,
      "text": "Figure 2: Example of Label Stack",
      "ja": "図2：ラベルスタックの例"
    },
    {
      "indent": 0,
      "text": "4. Clarification on Handling of the Entropy Label Indicator",
      "section_title": true,
      "ja": "4. エントロピーラベルインジケータの取り扱いに関する明確化"
    },
    {
      "indent": 3,
      "text": "Section 3.1 of [RFC7274] contains two paragraphs that describe the handling of the Entropy Label Indicator (label 7). These paragraphs have introduced some confusion about whether the Entropy Label Indicator can be present when immediately preceded by the Extension Label. This document updates [RFC7274] by replacing those paragraphs as follows.",
      "ja": "[RFC7274]のセクション3.1には、エントロピーラベルインジケータの取り扱いを説明する2つの段落が含まれています（ラベル7）。これらの段落は、エントロピーラベルインジケータが拡張ラベルが直前に存在できるかどうかについての混乱を紹介しています。この文書は、次のようにこれらの段落を置き換えることによって[RFC7274]を更新します。"
    },
    {
      "indent": 3,
      "text": "OLD",
      "ja": "古い"
    },
    {
      "indent": 3,
      "text": "|  Values 0-15 of the \"Extended Special-Purpose MPLS Label Values\"\n|  registry are set aside as reserved.  Furthermore, values 0-6 and\n|  8-15 MUST NOT appear in the data plane following an XL; an LSR\n|  processing a packet with an XL at the top of the label stack\n|  followed by a label with value 0-6 or 8-15 MUST drop the packet.\n|\n|  Label 7 (when received) retains its meaning as Entropy Label\n|  Indicator (ELI) whether a regular special-purpose label or an\n|  ESPL; this is because of backwards compatibility with existing\n|  implemented and deployed code and hardware that looks for the ELI\n|  without verifying if the previous label is XL or not.  However,\n|  when an LSR inserts an entropy label, it MUST insert the ELI as a\n|  regular special-purpose label, not as an ESPL.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "NEW",
      "ja": "新着"
    },
    {
      "indent": 3,
      "text": "|  Values 0-15 of the \"Extended Special-Purpose MPLS Label Values\"\n|  registry are set aside as reserved.  Furthermore, an\n|  implementation MUST NOT place a label with a value in the range\n|  0-15 in the label stack immediately following an XL; an LSR\n|  processing a packet with an XL at the top of the label stack\n|  immediately followed by a label with a value in the range 0-15\n|  MUST drop the packet.\n|\n|  When inspecting a label stack to find an Entropy Label Indicator\n|  (ELI -- label 7), a preexisting implementation may fail to inspect\n|  the previous label and thus not notice that it is an XL.  Such\n|  systems can continue to process the entropy information and\n|  forward the packet when the previous label is an XL without\n|  causing harm.  However, the packet will be dropped when the XL\n|  reaches the top of the stack at another LSR.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "END",
      "ja": "終わり"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "This document describes the terminology to be used when describing and specifying the use of SPLs. It does not affect forwarding in the MPLS data plane, nor does it have any effect on how Label Switched Paths are established by an MPLS control plane or by a centralized controller.",
      "ja": "このドキュメントでは、SPLの使用を説明し指定するときに使用される用語について説明します。MPLSデータプレーンでの転送には転送されず、ラベルの切り替えパスがMPLSコントロールプレーンまたは集中型コントローラによってどのように確立されるかに影響を与えません。"
    },
    {
      "indent": 3,
      "text": "This document does not aim to describe existing implementations of SPLs or potential vulnerabilities of SPLs.",
      "ja": "この文書は、SPLの既存の実装やSPLの潜在的な脆弱性を説明することを目的としていません。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has changed the name of the registry once called \"Special-Purpose MPLS Label Values\" to now be called \"Base Special-Purpose MPLS Label Values\" [bSPL].",
      "ja": "IANAは、「専用MPLSラベル値」と呼ばれるレジストリの名前を「Base Special-Putmoy MPLSラベル値」[BSPL]と呼ばれています。"
    },
    {
      "indent": 3,
      "text": "IANA has also updated the \"Base Special-Purpose MPLS Label Values\" registry by changing the description for value 15 from \"Extension Label\" to \"Extension Label (XL)\" and also adding this document as a reference.",
      "ja": "IANAは、「拡張ラベル」から「拡張ラベル（XL）」への値15の説明を変更し、参照としてこの文書を追加することで、「基本特殊目的MPLSラベル値」レジストリを更新しました。"
    },
    {
      "indent": 11,
      "text": "+=======+======================+====================+\n| Value |     Description      |     Reference      |\n+=======+======================+====================+\n| 15    | Extension Label (XL) | RFC 7274, RFC 9017 |\n+-------+----------------------+--------------------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 14,
      "text": "Table 1: Updated Entry for Value 15 in the \"Base Special-Purpose MPLS Label Values\" Registry",
      "ja": "表1：「基本専用MPLSラベル値」レジストリの値15の更新されたエントリ"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7. 参考文献"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "ja": "7.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[bSPL] IANA, \"Base Special-Purpose MPLS Label Values\", <https://www.iana.org/assignments/mpls-label-values/>.",
      "ja": "[BSPL] IANA、「ベース特殊目的MPLSラベル値」、<https://www.iana.org/assignments/mpls-label-values/>。"
    },
    {
      "indent": 3,
      "text": "[eSPL] IANA, \"Extended Special-Purpose MPLS Label Values\", <https://www.iana.org/assignments/mpls-label-values/>.",
      "ja": "[ESPL] IANA、「拡張特殊目的MPLSラベル値」、<https：//www.iana.org/assignments/mpls-label-values/>。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <https://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119] BRADNER、S、「RFCSで使用するためのキーワード」、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<https：//www.rfc-editor.org/info/RFC2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC3032] Rosen, E., Tappan, D., Fedorkow, G., Rekhter, Y., Farinacci, D., Li, T., and A. Conta, \"MPLS Label Stack Encoding\", RFC 3032, DOI 10.17487/RFC3032, January 2001, <https://www.rfc-editor.org/info/rfc3032>.",
      "ja": "[RFC3032]ローゼン、E.、Tappan、D.、Fedorkow、G.、Rekhter、Y.、Farinacci、D.、Li、T.、およびA. CONTA、「MPLSラベルスタックエンコーディング」、RFC 3032、DOI 10.17487/ RFC3032、2001年1月、<https://www.rfc-editor.org/info/rfc3032>。"
    },
    {
      "indent": 3,
      "text": "[RFC7274] Kompella, K., Andersson, L., and A. Farrel, \"Allocating and Retiring Special-Purpose MPLS Labels\", RFC 7274, DOI 10.17487/RFC7274, June 2014, <https://www.rfc-editor.org/info/rfc7274>.",
      "ja": "[RFC7274] Kompella、K.、Andersson、L.、およびA. Farrel、「特殊目的のMPLSラベルの割り当て」、RFC 7274、DOI 10.17487 / RFC7274、2014年6月、<https：///www.rfc-編集者.org / info / rfc7274>。"
    },
    {
      "indent": 3,
      "text": "[RFC8174] Leiba, B., \"Ambiguity of Uppercase vs Lowercase in RFC 2119 Key Words\", BCP 14, RFC 8174, DOI 10.17487/RFC8174, May 2017, <https://www.rfc-editor.org/info/rfc8174>.",
      "ja": "[RFC8174] Leiba、B、「RFC 2119キーワードの大文字の曖昧さ」、BCP 14、RFC 8174、DOI 10.17487 / RFC8174、2017年5月、<https：//www.rfc-editor.org/info/RFC8174>。"
    },
    {
      "indent": 3,
      "text": "[SPL-NAME-SPACE] IANA, \"Special-Purpose Multiprotocol Label Switching (MPLS) Label Values\", <https://www.iana.org/assignments/mpls-label-values/>.",
      "ja": "[SPL-name-space] IANA、「特殊目的マルチプロトコルラベルスイッチング（MPLS）ラベル値」、<https://www.iana.org/assignments/mpls-label-values/>。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "ja": "7.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[RFC8595] Farrel, A., Bryant, S., and J. Drake, \"An MPLS-Based Forwarding Plane for Service Function Chaining\", RFC 8595, DOI 10.17487/RFC8595, June 2019, <https://www.rfc-editor.org/info/rfc8595>.",
      "ja": "[RFC8595] Farrel、A.、Bryant、S.、J. Drake、「サービス機能連鎖のためのMPLSベースの転送面」、RFC 8595、DOI 10.17487 / RFC8595、2019年6月、<https：//www.rfc-editor.org/info/rfc8595>。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "We would like to thank the Routing Directorate reviewer, Eric Gray, for a detailed, careful, and insightful review, and Tom Petch for pointing out several issues of clarity.",
      "ja": "私たちは、ルーティングディレクトリレビューア、エリックグレー、詳細、注意深く、そして洞察豊かなレビュー、そして明確さのいくつかの問題を指摘するためのトムのペッチに感謝します。"
    },
    {
      "indent": 0,
      "text": "Contributors",
      "ja": "貢献者"
    },
    {
      "indent": 3,
      "text": "The following individual contributed text to this document:",
      "ja": "この文書への以下の個々の貢献されたテキスト："
    },
    {
      "indent": 3,
      "text": "Stewart Bryant Futurewei Technologies Inc.",
      "ja": "スチュワートブライアントフューチャーワイテクノロジーズ"
    },
    {
      "indent": 3,
      "text": "Email: stewart.bryant@gmail.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者の住所"
    },
    {
      "indent": 3,
      "text": "Loa Andersson Bronze Dragon Consulting",
      "ja": "LOA Andersson Bronze Dragon Consulting."
    },
    {
      "indent": 3,
      "text": "Email: loa@pi.nu",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Kireeti Kompella Juniper Networks",
      "ja": "Kireeti Kompella Juniperネットワーク"
    },
    {
      "indent": 3,
      "text": "Email: kireeti@juniper.net",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Adrian Farrel Old Dog Consulting",
      "ja": "エイドリアンファーレルオールドドッグコンサルティング"
    },
    {
      "indent": 3,
      "text": "Email: adrian@olddog.co.uk",
      "raw": true,
      "ja": ""
    }
  ]
}