{
  "title": {
    "text": "RFC 9670 - JSON Meta Application Protocol (JMAP) Sharing",
    "ja": "RFC 9670 - JSONメタアプリケーションプロトコル（JMAP）共有"
  },
  "number": 9670,
  "created_at": "2024-11-22 23:24:36.548115+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                   N. Jenkins, Ed.\nRequest for Comments: 9670                                      Fastmail\nUpdates: 8620                                              November 2024\nCategory: Standards Track                                               \nISSN: 2070-1721",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "JSON Meta Application Protocol (JMAP) Sharing",
      "section_title": true,
      "ja": "JSONメタアプリケーションプロトコル（JMAP）共有"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "section_title": true,
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document specifies a data model for sharing data between users using the JSON Meta Application Protocol (JMAP). Future documents can reference this document when defining data types to support a consistent model of sharing.",
      "ja": "このドキュメントは、JSONメタアプリケーションプロトコル（JMAP）を使用してユーザー間でデータを共有するためのデータモデルを指定します。将来のドキュメントは、一貫した共有モデルをサポートするためにデータ型を定義する際にこのドキュメントを参照できます。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "section_title": true,
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準トラックドキュメントです。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 7841.",
      "ja": "このドキュメントは、インターネットエンジニアリングタスクフォース（IETF）の製品です。IETFコミュニティのコンセンサスを表しています。公開レビューを受けており、インターネットエンジニアリングステアリンググループ（IESG）からの出版が承認されています。インターネット標準の詳細については、RFC 7841のセクション2で入手できます。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at https://www.rfc-editor.org/info/rfc9670.",
      "ja": "このドキュメントの現在のステータス、任意のERRATA、およびそのフィードバックを提供する方法に関する情報は、https://www.rfc-editor.org/info/rfc9670で取得できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "section_title": true,
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2024 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（c）2024 IETF Trustおよび文書著者として特定された人。無断転載を禁じます。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (https://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Revised BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Revised BSD License.",
      "ja": "このドキュメントは、BCP 78およびIETFドキュメント（https://trustee.ietf.org/license-info）に関連するIETF Trustの法的規定の対象となります。この文書に関するあなたの権利と制限を説明するので、これらの文書を注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、セクション4.Eで説明されている法的規定のセクション4.Eで説明されており、改訂されたBSDライセンスで説明されている保証なしで提供されるように、改訂されたBSDライセンステキストを含める必要があります。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "section_title": true,
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction\n  1.1.  Notational Conventions\n  1.2.  Terminology\n  1.3.  Data Model Overview\n  1.4.  Subscribing to Shared Data\n  1.5.  Addition to the Capabilities Object\n    1.5.1.  urn:ietf:params:jmap:principals\n    1.5.2.  urn:ietf:params:jmap:principals:owner\n2.  Principals\n  2.1.  Principal/get\n  2.2.  Principal/changes\n  2.3.  Principal/set\n  2.4.  Principal/query\n    2.4.1.  Filtering\n  2.5.  Principal/queryChanges\n3.  ShareNotifications\n  3.1.  ShareNotification/get\n  3.2.  ShareNotification/changes\n  3.3.  ShareNotification/set\n  3.4.  ShareNotification/query\n    3.4.1.  Filtering\n    3.4.2.  Sorting\n  3.5.  ShareNotification/queryChanges\n4.  Framework for Shared Data\n  4.1.  Example\n5.  Internationalization Considerations\n6.  Security Considerations\n  6.1.  Spoofing\n  6.2.  Unnoticed Sharing\n  6.3.  Denial of Service\n  6.4.  Unauthorized Principals\n7.  IANA Considerations\n  7.1.  JMAP Capability Registration for \"principals\"\n  7.2.  JMAP Capability Registration for \"principals:owner\"\n  7.3.  JMAP Data Type Registration for \"Principal\"\n  7.4.  JMAP Data Type Registration for \"ShareNotification\"\n8.  References\n  8.1.  Normative References\n  8.2.  Informative References\nAuthor's Address",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The JSON Meta Application Protocol (JMAP) [RFC8620] is a generic protocol for synchronizing data, such as mail, calendars, or contacts, between a client and a server. It is optimized for mobile and web environments and provides a consistent interface to query, read, and modify different data types, including comprehensive error handling.",
      "ja": "JSON Meta Application Protocol（JMAP）[RFC8620]は、クライアントとサーバー間のメール、カレンダー、連絡先などのデータを同期するための一般的なプロトコルです。モバイル環境とWeb環境用に最適化されており、包括的なエラー処理を含むさまざまなデータ型をクエリ、読み取り、変更するための一貫したインターフェイスを提供します。"
    },
    {
      "indent": 3,
      "text": "This specification defines a data model to represent entities in a collaborative environment and a framework for sharing data between them that can be used to provide a consistent sharing model for different data types. It does not define _what_ may be shared or the granularity of permissions, as this will depend on the data in question.",
      "ja": "この仕様では、共同環境のエンティティを表すデータモデルと、さまざまなデータ型の一貫した共有モデルを提供するために使用できるデータを共有するためのフレームワークを定義します。これは問題のデータに依存するため、_what_が共有される可能性があるか、許可の粒度を定義しません。"
    },
    {
      "indent": 0,
      "text": "1.1. Notational Conventions",
      "section_title": true,
      "ja": "1.1. 表記規則"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14 [RFC2119] [RFC8174] when, and only when, they appear in all capitals, as shown here.",
      "ja": "「必須」、「必要」、「必須」、「shall」、「shall」、「suff」、 \"not\"、 \"becommended\"、 \"becommented\"、 \"may\"、 \"optional「このドキュメントでは、BCP 14 [RFC2119] [RFC8174]で説明されているように解釈されます。"
    },
    {
      "indent": 3,
      "text": "Type signatures, examples, and property descriptions in this document follow the conventions established in Section 1.1 of [RFC8620]. Data types defined in the core specification are also used in this document.",
      "ja": "このドキュメントのタイプシグネチャ、例、およびプロパティの説明は、[RFC8620]のセクション1.1で確立された規則に従っています。コア仕様で定義されているデータ型は、このドキュメントでも使用されています。"
    },
    {
      "indent": 3,
      "text": "Examples of API exchanges only show the methodCalls array of the Request object or the methodResponses array of the Response object. For compactness, the rest of the Request/Response object is omitted.",
      "ja": "API交換の例は、リクエストオブジェクトのメソッドコールの配列または応答オブジェクトのメソッドリスポンズの配列のみを示しています。コンパクトさのために、リクエスト/応答オブジェクトの残りの部分は省略されています。"
    },
    {
      "indent": 0,
      "text": "1.2. Terminology",
      "section_title": true,
      "ja": "1.2. 用語"
    },
    {
      "indent": 3,
      "text": "The same terminology is used in this document as in the core JMAP specification. See [RFC8620], Section 1.6.",
      "ja": "このドキュメントでは、Core JMAP仕様と同じ用語が使用されています。[RFC8620]、セクション1.6を参照してください。"
    },
    {
      "indent": 3,
      "text": "The terms \"Principal\" and \"ShareNotification\" (with this specific capitalization) are used to refer to the data types defined in this document and instances of those data types.",
      "ja": "「プリンシパル」と「共有測定」という用語（この特定の大文字とともに）は、このドキュメントで定義されているデータ型とそれらのデータ型のインスタンスを参照するために使用されます。"
    },
    {
      "indent": 0,
      "text": "1.3. Data Model Overview",
      "section_title": true,
      "ja": "1.3. データモデルの概要"
    },
    {
      "indent": 3,
      "text": "A Principal (see Section 2) represents an individual, team, or resource (e.g., a room or projector). The object contains information about the entity being represented, such as a name, description, and time zone. It may also hold domain-specific information. A Principal may be associated with zero or more Accounts (see [RFC8620], Section 1.6.2) containing data belonging to the Principal. Managing the set of Principals within a system is out of scope for this specification, as it is highly domain specific. It is likely to map directly from a directory service or other user management system.",
      "ja": "プリンシパル（セクション2を参照）は、個人、チーム、またはリソース（部屋またはプロジェクターなど）を表します。オブジェクトには、名前、説明、タイムゾーンなど、表現されているエンティティに関する情報が含まれています。また、ドメイン固有の情報を保持する場合があります。プリンシパルは、プリンシパルに属するデータを含むゼロ以上のアカウント（[RFC8620]、セクション1.6.2を参照）に関連付けられている場合があります。システム内のプリンシパルのセットを管理することは、非常にドメイン固有であるため、この仕様の範囲外です。ディレクトリサービスまたは他のユーザー管理システムから直接マッピングする可能性があります。"
    },
    {
      "indent": 3,
      "text": "Data types may allow users to share data with others by assigning permissions to Principals. When a user's permissions are changed, a ShareNotification object is created for them so a client can inform the user of the changes.",
      "ja": "データ型により、ユーザーはプリンシパルにアクセス許可を割り当てることにより、他の人とデータを共有できる場合があります。ユーザーのアクセス許可が変更されると、クライアントがユーザーに変更を通知できるように、共有化オブジェクトが作成されます。"
    },
    {
      "indent": 0,
      "text": "1.4. Subscribing to Shared Data",
      "section_title": true,
      "ja": "1.4. 共有データを購読します"
    },
    {
      "indent": 3,
      "text": "Permissions determine whether a user _may_ access data but not whether they _want_ to. Some shared data is of equal importance as the user's own, while other data is just there should the user wish to explicitly go find it. Clients will often want to differentiate the two. For example, a company may share mailing list archives for all departments with all employees, but a user may only generally be interested in the few they belong to. They would have _permission_ to access many mailboxes but can _subscribe_ to just the ones they care about. The client would provide separate interfaces for reading mail in subscribed mailboxes and browsing all mailboxes they have permission to access in order to manage those that they are subscribed to.",
      "ja": "権限ユーザーがデータにアクセスするかどうかを決定しますが、_want_ to。一部の共有データはユーザー自身と同様に重要ですが、他のデータは、ユーザーが明示的に見つけたいと考えている場合に存在します。多くの場合、クライアントは2つを区別したいと思うでしょう。たとえば、企業はすべての従業員とすべての部門のメーリングリストアーカイブを共有する場合がありますが、ユーザーは通常、属する少数に関心がある場合があります。彼らは多くのメールボックスにアクセスする_permission_を持っていますが、彼らが気にするものだけに_subscribe_を_subscribe_することができます。クライアントは、購読されたメールボックスでメールを読み取るための個別のインターフェイスを提供し、サブスクライブされているものを管理するためにアクセスする許可があるすべてのメールボックスを閲覧します。"
    },
    {
      "indent": 3,
      "text": "The JMAP Session object (see [RFC8620], Section 2) is defined to include an object in the \"accounts\" property for every Account that the user has access to. Collaborative systems may share data between a very large number of Principals, most of which the user does not care about day to day. For servers implementing this specification, the Session object MUST only include Accounts where either the user is subscribed to at least one record (see [RFC8620], Section 1.6.3) in the Account or the Account belongs to the user. StateChange events ([RFC8620], Section 7.1) for changes to data SHOULD only be sent for data the user has subscribed to and MUST NOT be sent for any Account where the user is not subscribed to any records in the Account, except where that Account belongs to the user.",
      "ja": "JMAPセッションオブジェクト（[RFC8620]、セクション2を参照）は、ユーザーがアクセスできるすべてのアカウントの「アカウント」プロパティにオブジェクトを含めるように定義されています。共同システムは、非常に多数のプリンシパル間でデータを共有する場合があります。そのほとんどは、ユーザーが日々気にしません。この仕様を実装するサーバーの場合、セッションオブジェクトには、ユーザーが少なくとも1つのレコード（[RFC8620]、セクション1.6.3を参照）にサブスクライブされるか、アカウントまたはアカウントがユーザーに属するアカウントのみを含める必要があります。データの変更については、データの変更については、ユーザーがサブスクライブしているデータに対してのみ送信される必要があり、ユーザーがアカウント内のレコードにサブスクライブされない場合を除き、ユーザーがアカウントに送信してはなりません。ユーザーに属します。"
    },
    {
      "indent": 3,
      "text": "The server MAY reject the user's attempt to subscribe to some resources even if they have permission to access them (e.g., a calendar representing a location).",
      "ja": "サーバーは、ユーザーがアクセスする許可がある場合でも、一部のリソースをサブスクライブする試みを拒否する場合があります（場所を表すカレンダーなど）。"
    },
    {
      "indent": 3,
      "text": "A user can query the set of Principals they have access to with \"Principal/query\" (see Section 2.4). The Principal object will contain an Account object for all Accounts where the user has permission to access data for that Principal, even if they are not yet subscribed.",
      "ja": "ユーザーは、「プリンシパル/クエリ」でアクセスできる一連のプリンシパルを照会できます（セクション2.4を参照）。プリンシパルオブジェクトには、たとえサブスクライブされていなくても、ユーザーがそのプリンシパルのデータにアクセスする許可を持つすべてのアカウントのアカウントオブジェクトが含まれます。"
    },
    {
      "indent": 0,
      "text": "1.5. Addition to the Capabilities Object",
      "section_title": true,
      "ja": "1.5. 機能オブジェクトに加えます"
    },
    {
      "indent": 3,
      "text": "The capabilities object is returned as part of the JMAP Session object; see [RFC8620], Section 2. This document defines two additional capability URIs.",
      "ja": "機能オブジェクトは、JMAPセッションオブジェクトの一部として返されます。[RFC8620]、セクション2を参照してください。このドキュメントでは、2つの追加機能URIを定義しています。"
    },
    {
      "indent": 0,
      "text": "1.5.1. urn:ietf:params:jmap:principals",
      "section_title": true,
      "ja": "1.5.1. urn：ietf：params：jmap：principals"
    },
    {
      "indent": 3,
      "text": "The urn:ietf:params:jmap:principals capability represents support for the Principal and ShareNotification data types and associated API methods.",
      "ja": "urn：ietf：params：jmap：principals機能は、プリンシパルおよび共有データ型および関連するAPIメソッドのサポートを表します。"
    },
    {
      "indent": 3,
      "text": "The value of this property in the JMAP Session \"capabilities\" property is an empty object.",
      "ja": "JMAPセッション「機能」プロパティのこのプロパティの値は、空のオブジェクトです。"
    },
    {
      "indent": 3,
      "text": "The value of this property in an Account's \"accountCapabilities\" property is an object that MUST contain the following information on server capabilities and permissions for that Account:",
      "ja": "アカウントの「accountcapability」プロパティ内のこのプロパティの値は、そのアカウントのサーバー機能と許可に関する次の情報を含める必要があるオブジェクトです。"
    },
    {
      "indent": 3,
      "text": "*currentUserPrincipalId*: Id|null",
      "ja": "*currentuserprincipalid*：id | null"
    },
    {
      "indent": 12,
      "text": "The id of the Principal in this Account that corresponds to the user fetching this object, if any.",
      "ja": "このアカウントのプリンシパルのIDは、ユーザーがこのオブジェクトを取得することに対応しています。"
    },
    {
      "indent": 0,
      "text": "1.5.2. urn:ietf:params:jmap:principals:owner",
      "section_title": true,
      "ja": "1.5.2. urn：ietf：params：jmap：principals：所有者"
    },
    {
      "indent": 3,
      "text": "The URI urn:ietf:params:jmap:principals:owner is solely used as a key in an Account's \"accountCapabilities\" property. It does not appear in the JMAP Session capabilities -- support is indicated by the urn:ietf:params:jmap:principals URI being present in the session capabilities.",
      "ja": "URI URN：IETF：PARAMS：JMAP：PRICNIPALS：所有者は、アカウントの「勘定責任」プロパティのキーとしてのみ使用されます。JMAPセッション機能には表示されません - サポートはurn：ietf：params：jmap：principals uriがセッション機能に存在することで示されます。"
    },
    {
      "indent": 3,
      "text": "If urn:ietf:params:jmap:principals:owner is a key in an Account's \"accountCapabilities\" property, that Account (and the data therein) is owned by a Principal. Some Accounts may not be owned by a Principal (e.g., the Account that contains the data for the Principals themselves), in which case this property is omitted.",
      "ja": "urn：ietf：params：jmap：principals：所有者はアカウントの「accountcapability」プロパティの鍵であり、そのアカウント（およびそのデータ）は元本が所有しています。一部のアカウントは、プリンシパル（たとえば、プリンシパル自体のデータを含むアカウント）が所有することはできません。この場合、このプロパティは省略されています。"
    },
    {
      "indent": 3,
      "text": "The value of this property is an object with the following properties:",
      "ja": "このプロパティの値は、次のプロパティを持つオブジェクトです。"
    },
    {
      "indent": 3,
      "text": "*accountIdForPrincipal*: Id",
      "ja": "*accountidforprincipal*：id"
    },
    {
      "indent": 12,
      "text": "The id of an Account with the urn:ietf:params:jmap:principals capability that contains the corresponding Principal object.",
      "ja": "urnを使用したアカウントのID：ietf：params：jmap：対応する主要なオブジェクトを含むプリンシパル機能。"
    },
    {
      "indent": 3,
      "text": "*principalId*:Id",
      "ja": "*校長*：id"
    },
    {
      "indent": 12,
      "text": "The id of the Principal that owns this Account.",
      "ja": "このアカウントを所有する校長のID。"
    },
    {
      "indent": 0,
      "text": "2. Principals",
      "section_title": true,
      "ja": "2. 校長"
    },
    {
      "indent": 3,
      "text": "A Principal represents an individual, a group, a location (e.g., a room), a resource (e.g., a projector), or another entity in a collaborative environment. Sharing in JMAP is generally configured by assigning rights to certain data within an Account to other Principals. For example, a user may assign permission to read their calendar to a Principal representing another user or their team.",
      "ja": "プリンシパルは、個人、グループ、場所（部屋など）、リソース（プロジェクターなど）、または共同環境の別のエンティティを表します。JMAPでの共有は、一般に、アカウント内の特定のデータに他のプリンシパルに特定のデータに割り当てることによって構成されます。たとえば、ユーザーは、別のユーザーまたはチームを表すプリンシパルにカレンダーを読む許可を割り当てることができます。"
    },
    {
      "indent": 3,
      "text": "In a shared environment, such as a workplace, a user may have access to a large number of Principals.",
      "ja": "職場などの共有環境では、ユーザーが多数のプリンシパルにアクセスできる場合があります。"
    },
    {
      "indent": 3,
      "text": "In most systems, the user will have access to a single Account containing Principal objects. In some situations, for example, when aggregating data from different places, there may be multiple Accounts containing Principal objects.",
      "ja": "ほとんどのシステムでは、ユーザーは主要なオブジェクトを含む単一のアカウントにアクセスできます。たとえば、さまざまな場所からデータを集約する場合、一部の状況では、主要なオブジェクトを含む複数のアカウントが存在する場合があります。"
    },
    {
      "indent": 3,
      "text": "A *Principal* object has the following properties:",
      "ja": "*プリンシパル *オブジェクトには次のプロパティがあります。"
    },
    {
      "indent": 3,
      "text": "*id*: Id (immutable; server-set)",
      "ja": "*id*：id（inmutable; server-set）"
    },
    {
      "indent": 12,
      "text": "The id of the Principal.",
      "ja": "校長のID。"
    },
    {
      "indent": 3,
      "text": "*type*: String",
      "ja": "*タイプ*：文字列"
    },
    {
      "indent": 12,
      "text": "This MUST be one of the following values:",
      "ja": "これは次の値の1つでなければなりません。"
    },
    {
      "indent": 6,
      "text": "* \"individual\": This represents a single person.",
      "ja": "* 「個人」：これは一人の人を表しています。"
    },
    {
      "indent": 6,
      "text": "* \"group\": This represents a group of other Principals.",
      "ja": "* 「グループ」：これは他の校長のグループを表しています。"
    },
    {
      "indent": 6,
      "text": "* \"resource\": This represents some resource, e.g., a projector.",
      "ja": "* 「リソース」：これは、プロジェクターなどのリソースを表しています。"
    },
    {
      "indent": 6,
      "text": "* \"location\": This represents a location.",
      "ja": "* 「場所」：これは場所を表します。"
    },
    {
      "indent": 6,
      "text": "* \"other\": This represents some other undefined Principal.",
      "ja": "* 「その他」：これは他の未定義の校長を表しています。"
    },
    {
      "indent": 3,
      "text": "*name*: String",
      "ja": "*名前*：文字列"
    },
    {
      "indent": 12,
      "text": "The name of the Principal, e.g., \"Jane Doe\" or \"Room 4B\".",
      "ja": "校長の名前、例えば「ジェーン・ドゥ」または「ルーム4B」。"
    },
    {
      "indent": 3,
      "text": "*description*: String|null",
      "ja": "*説明*：文字列| null"
    },
    {
      "indent": 12,
      "text": "A longer description of the Principal, for example, details about the facilities of a resource, or null if no description is available.",
      "ja": "たとえば、プリンシパルの長い説明、リソースの施設に関する詳細、または説明がない場合はnull。"
    },
    {
      "indent": 3,
      "text": "*email*: String|null",
      "ja": "*電子メール*：文字列| null"
    },
    {
      "indent": 12,
      "text": "An email address for the Principal, or null if no email is available. If given, the value MUST conform to the \"addr-spec\" syntax, as defined in [RFC5322], Section 3.4.1.",
      "ja": "プリンシパルのメールアドレス、またはメールがない場合はnull。与えられた場合、値は[RFC5322]で定義されている「addr-spec」構文に準拠する必要があります。セクション3.4.1。"
    },
    {
      "indent": 3,
      "text": "*timeZone*: String|null",
      "ja": "*TimeZone*：string | null"
    },
    {
      "indent": 12,
      "text": "The time zone for this Principal, if known. If not null, the value MUST be a time zone name from the IANA Time Zone Database [IANA-TZDB].",
      "ja": "既知の場合、このプリンシパルのタイムゾーン。NULLでない場合、値はIANAタイムゾーンデータベース[IANA-TZDB]のタイムゾーン名でなければなりません。"
    },
    {
      "indent": 3,
      "text": "*capabilities*: String[Object] (server-set)",
      "ja": "*機能*：string [object]（server-set）"
    },
    {
      "indent": 12,
      "text": "A map of JMAP capability URIs to domain-specific information about the Principal in relation to that capability, as defined in the document that registered the capability.",
      "ja": "JMAP機能のマップは、機能を登録したドキュメントで定義されているように、その機能に関連してプリンシパルに関するドメイン固有の情報に対するurisのマップです。"
    },
    {
      "indent": 3,
      "text": "*accounts*: Id[Account]|null (server-set)",
      "ja": "*アカウント*：id [アカウント] | null（サーバーセット）"
    },
    {
      "indent": 12,
      "text": "A map of Account id to Account object for each JMAP Account containing data for this Principal that the user has access to, or null if none.",
      "ja": "ユーザーがアクセスできるこのプリンシパルのデータを含む各JMAPアカウントのアカウントIDのマップ、またはなしの場合はnull。"
    },
    {
      "indent": 0,
      "text": "2.1. Principal/get",
      "section_title": true,
      "ja": "2.1. プリンシパル/get"
    },
    {
      "indent": 3,
      "text": "This is a standard \"/get\" method as described in [RFC8620], Section 5.1.",
      "ja": "これは、[RFC8620]、セクション5.1で説明されている標準「/get」メソッドです。"
    },
    {
      "indent": 0,
      "text": "2.2. Principal/changes",
      "section_title": true,
      "ja": "2.2. プリンシパル/変更"
    },
    {
      "indent": 3,
      "text": "This is a standard \"/changes\" method as described in [RFC8620], Section 5.2.",
      "ja": "これは、[RFC8620]、セクション5.2で説明されている標準の「/変更」メソッドです。"
    },
    {
      "indent": 12,
      "text": "Note: Implementations backed by an external directory may be unable to calculate changes. In this case, they will always return a \"cannotCalculateChanges\" error as described in the core JMAP specification.",
      "ja": "注：外部ディレクトリに裏付けられた実装では、変更を計算できない場合があります。この場合、Core JMAP仕様で説明されているように、常に「Can Can Calculatechanges」エラーを返します。"
    },
    {
      "indent": 0,
      "text": "2.3. Principal/set",
      "section_title": true,
      "ja": "2.3. プリンシパル/セット"
    },
    {
      "indent": 3,
      "text": "This is a standard \"/set\" method as described in [RFC8620], Section 5.3.",
      "ja": "これは、[RFC8620]、セクション5.3で説明されている標準の「/セット」メソッドです。"
    },
    {
      "indent": 3,
      "text": "Managing Principals is likely tied to a directory service or some other vendor-specific solution. This management may occur out of band or via an additional capability defined elsewhere. Allowing direct user modification of properties has security considerations, as noted in Section 6. A server MUST reject any change it doesn't allow with a \"forbidden\" SetError.",
      "ja": "プリンシパルの管理は、ディレクトリサービスまたは他のベンダー固有のソリューションに関連付けられている可能性があります。この管理は、バンド外または他の場所で定義されている追加の機能を介して発生する場合があります。セクション6に記載されているように、プロパティの直接ユーザーの変更にセキュリティ上の考慮事項があります。サーバーは、「禁止された」セットナーで許可されていない変更を拒否する必要があります。"
    },
    {
      "indent": 3,
      "text": "Where a server does support changes via this API, it SHOULD allow an update to the \"name\", \"description\", and \"timeZone\" properties of the Principal with the same id as the \"currentUserPrincipalId\" in the Account capabilities. This allows the user to update their own details.",
      "ja": "サーバーがこのAPIを介して変更をサポートする場合、アカウント機能の「currentuserprincipalid」と同じIDを持つ「名前」、「説明」、および「TimeZone」プロパティの更新を許可する必要があります。これにより、ユーザーは独自の詳細を更新できます。"
    },
    {
      "indent": 0,
      "text": "2.4. Principal/query",
      "section_title": true,
      "ja": "2.4. プリンシパル/クエリ"
    },
    {
      "indent": 3,
      "text": "This is a standard \"/query\" method as described in [RFC8620], Section 5.5.",
      "ja": "これは、[RFC8620]、セクション5.5で説明されている標準「/クエリ」メソッドです。"
    },
    {
      "indent": 0,
      "text": "2.4.1. Filtering",
      "section_title": true,
      "ja": "2.4.1. フィルタリング"
    },
    {
      "indent": 3,
      "text": "A *FilterCondition* object has the following properties, all of which are optional:",
      "ja": "A * FilterCondition *オブジェクトには次のプロパティがあり、そのすべてがオプションです。"
    },
    {
      "indent": 3,
      "text": "*accountIds*: String[]",
      "ja": "*accountids*：string []"
    },
    {
      "indent": 12,
      "text": "A list of Account ids. The Principal matches if any of the ids in this list are keys in the Principal's \"accounts\" property (i.e., if any of the Account ids belong to the Principal).",
      "ja": "アカウントIDのリスト。このリストのIDのいずれかがプリンシパルの「アカウント」プロパティのキーである場合（つまり、アカウントIDがプリンシパルに属している場合）、プリンシパルは一致します。"
    },
    {
      "indent": 3,
      "text": "*email*: String",
      "ja": "*電子メール*：文字列"
    },
    {
      "indent": 12,
      "text": "The email property of the Principal contains the given string.",
      "ja": "プリンシパルの電子メールプロパティには、指定された文字列が含まれています。"
    },
    {
      "indent": 3,
      "text": "*name*: String",
      "ja": "*名前*：文字列"
    },
    {
      "indent": 12,
      "text": "The name property of the Principal contains the given string.",
      "ja": "プリンシパルの名前のプロパティには、指定された文字列が含まれています。"
    },
    {
      "indent": 3,
      "text": "*text*: String",
      "ja": "*テキスト*：文字列"
    },
    {
      "indent": 12,
      "text": "The name, email, or description property of the Principal contains the given string.",
      "ja": "プリンシパルの名前、電子メール、または説明プロパティには、指定された文字列が含まれています。"
    },
    {
      "indent": 3,
      "text": "*type*: String",
      "ja": "*タイプ*：文字列"
    },
    {
      "indent": 12,
      "text": "The type must be exactly as given to match the condition.",
      "ja": "このタイプは、条件に合わせて与えられたものでなければなりません。"
    },
    {
      "indent": 3,
      "text": "*timeZone*: String",
      "ja": "*TimeZone*：文字列"
    },
    {
      "indent": 12,
      "text": "The timeZone must be exactly as given to match the condition.",
      "ja": "タイムゾーンは、条件に合わせて与えられたものでなければなりません。"
    },
    {
      "indent": 3,
      "text": "All given conditions in the FilterCondition object must match for the Principal to match.",
      "ja": "フィルターコンディションオブジェクトのすべての条件は、プリンシパルが一致するように一致する必要があります。"
    },
    {
      "indent": 3,
      "text": "Text matches for \"contains\" SHOULD be simple substring matches.",
      "ja": "「contains」のテキストマッチは、単純なサブストリングマッチである必要があります。"
    },
    {
      "indent": 0,
      "text": "2.5. Principal/queryChanges",
      "section_title": true,
      "ja": "2.5. プリンシパル/QueryChanges"
    },
    {
      "indent": 3,
      "text": "This is a standard \"/queryChanges\" method as described in [RFC8620], Section 5.6.",
      "ja": "これは、[RFC8620]、セクション5.6で説明されている標準「/QueryChanges」メソッドです。"
    },
    {
      "indent": 12,
      "text": "Note: Implementations backed by an external directory may be unable to calculate changes. In this case, they will always return a \"cannotCalculateChanges\" error as described in the core JMAP specification.",
      "ja": "注：外部ディレクトリに裏付けられた実装では、変更を計算できない場合があります。この場合、Core JMAP仕様で説明されているように、常に「Can Can Calculatechanges」エラーを返します。"
    },
    {
      "indent": 0,
      "text": "3. ShareNotifications",
      "section_title": true,
      "ja": "3. シェレンティフィケーション"
    },
    {
      "indent": 3,
      "text": "The ShareNotification data type records when the user's permissions to access a shared object changes. ShareNotifications are only created by the server; users cannot create them explicitly. They are stored in the same Account as the Principals.",
      "ja": "共有データ型は、共有オブジェクトにアクセスするためのユーザーの許可が変更されたときに記録します。共有視力は、サーバーによってのみ作成されます。ユーザーはそれらを明示的に作成することはできません。それらは、プリンシパルと同じアカウントに保存されます。"
    },
    {
      "indent": 3,
      "text": "Clients may present the list of notifications to the user and allow the user to dismiss them. To dismiss a notification, use a standard \"/set\" call to destroy it.",
      "ja": "クライアントは、ユーザーに通知のリストを提示し、ユーザーがそれらを却下できるようにすることができます。通知を却下するには、標準の「/セット」呼び出しを使用して破壊します。"
    },
    {
      "indent": 3,
      "text": "The server SHOULD create a ShareNotification whenever the user's permissions change on an object. It MAY choose not to create a notification for permission changes to a group Principal, even if the user is in the group, if this is more likely to be overwhelming than helpful, or if it would create excessive notifications within the system.",
      "ja": "ユーザーのアクセス許可がオブジェクトに変更されるたびに、サーバーは共有測定を作成する必要があります。ユーザーがグループにいる場合でも、これが役立つよりも圧倒的である可能性が高い場合、またはシステム内で過度の通知を作成する場合でも、グループプリンシパルに許可変更の通知を作成しないことを選択できます。"
    },
    {
      "indent": 3,
      "text": "The server MAY limit the maximum number of notifications it will store for a user. When the limit is reached, any new notification will cause the previously oldest notification to be automatically deleted.",
      "ja": "サーバーは、ユーザー用に保存する通知の最大数を制限する場合があります。制限に到達すると、新しい通知があれば、以前の最も古い通知が自動的に削除されます。"
    },
    {
      "indent": 3,
      "text": "The server MAY coalesce notifications if appropriate or remove notifications after a certain period of time or that it deems are no longer relevant.",
      "ja": "サーバーは、必要に応じて通知を合体したり、一定期間後に通知を削除したり、関連性がないと判断します。"
    },
    {
      "indent": 3,
      "text": "A *ShareNotification* object has the following properties:",
      "ja": "A * Sharenotification *オブジェクトには次のプロパティがあります。"
    },
    {
      "indent": 3,
      "text": "*id*: String (immutable; server-set)",
      "ja": "*id*：string（inmatable; server-set）"
    },
    {
      "indent": 12,
      "text": "The id of the ShareNotification.",
      "ja": "共有測定のID。"
    },
    {
      "indent": 3,
      "text": "*created*: UTCDate (immutable; server-set)",
      "ja": "*作成*：utcdate（Immutable; server-set）"
    },
    {
      "indent": 12,
      "text": "The time this notification was created.",
      "ja": "この通知が作成された時。"
    },
    {
      "indent": 3,
      "text": "*changedBy*: Entity (immutable; server-set)",
      "ja": "*変更by*：entity（Immutable; server-set）"
    },
    {
      "indent": 12,
      "text": "Who made the change. An *Entity* object has the following properties:",
      "ja": "誰が変更を加えたか。* entity *オブジェクトには次のプロパティがあります。"
    },
    {
      "indent": 6,
      "text": "*name*: String",
      "ja": "*名前*：文字列"
    },
    {
      "indent": 15,
      "text": "The name of the entity who made the change.",
      "ja": "変更を加えたエンティティの名前。"
    },
    {
      "indent": 6,
      "text": "*email*: String|null",
      "ja": "*電子メール*：文字列| null"
    },
    {
      "indent": 15,
      "text": "The email of the entity who made the change, or null if no email is available.",
      "ja": "変更を行ったエンティティの電子メール、またはメールがない場合はnull。"
    },
    {
      "indent": 6,
      "text": "*principalId*: Id|null",
      "ja": "*校長*：id | null"
    },
    {
      "indent": 15,
      "text": "The id of the Principal corresponding to the entity who made the change, or null if no associated Principal.",
      "ja": "変更を行ったエンティティに対応するプリンシパルのID、または関連するプリンシパルがない場合はnull。"
    },
    {
      "indent": 3,
      "text": "*objectType*: String (immutable; server-set)",
      "ja": "*ObjectType*：string（Immutable; server-set）"
    },
    {
      "indent": 12,
      "text": "The name of the data type for the object whose permissions have changed, as registered in the IANA \"JMAP Data Types\" registry [IANA-JMAP], e.g., \"Calendar\" or \"Mailbox\".",
      "ja": "IANAの「JMAPデータ型」レジストリ[IANA-JMAP]、「カレンダー」または「メールボックス」に登録されているように、権限が変更されたオブジェクトのデータ型の名前。"
    },
    {
      "indent": 3,
      "text": "*objectAccountId*: Id (immutable; server-set)",
      "ja": "*ObjectAccountid*：id（Immutable; server-set）"
    },
    {
      "indent": 12,
      "text": "The id of the Account where this object exists.",
      "ja": "このオブジェクトが存在するアカウントのID。"
    },
    {
      "indent": 3,
      "text": "*objectId*: Id (immutable; server-set)",
      "ja": "*ObjectId*：id（Immutable; server-set）"
    },
    {
      "indent": 12,
      "text": "The id of the object that this notification is about.",
      "ja": "この通知が存在するオブジェクトのID。"
    },
    {
      "indent": 3,
      "text": "*oldRights*: String[Boolean]|null (immutable; server-set)",
      "ja": "*oldrights*：string [boolean] | null（inmutable; server-set）"
    },
    {
      "indent": 12,
      "text": "The \"myRights\" property of the object for the user before the change.",
      "ja": "変更前のユーザーのオブジェクトの「マイライト」プロパティ。"
    },
    {
      "indent": 3,
      "text": "*newRights*: String[Boolean]|null (immutable; server-set)",
      "ja": "*newrights*：string [boolean] | null（inmutable; server-set）"
    },
    {
      "indent": 12,
      "text": "The \"myRights\" property of the object for the user after the change.",
      "ja": "変更後のユーザーのオブジェクトの「マイライト」プロパティ。"
    },
    {
      "indent": 3,
      "text": "*name*: String (immutable; server-set)",
      "ja": "*name*：string（inmatable; server-set）"
    },
    {
      "indent": 12,
      "text": "The name of the object at the time the notification was made. Determining the name will depend on the data type in question. For example, it might be the \"title\" property of a CalendarEvent or the \"name\" of a Mailbox. The name is to show users who have had their access rights to the object removed what it is that they can no longer access.",
      "ja": "通知が作成された時点でのオブジェクトの名前。名前を決定すると、問題のデータ型によって異なります。たとえば、CalendareVentの「タイトル」プロパティまたはメールボックスの「名前」のプロパティかもしれません。名前は、オブジェクトへのアクセス権を持っているユーザーに、アクセスできないということを削除することです。"
    },
    {
      "indent": 0,
      "text": "3.1. ShareNotification/get",
      "section_title": true,
      "ja": "3.1. シェレノット化/取得"
    },
    {
      "indent": 3,
      "text": "This is a standard \"/get\" method as described in [RFC8620], Section 5.1.",
      "ja": "これは、[RFC8620]、セクション5.1で説明されている標準「/get」メソッドです。"
    },
    {
      "indent": 0,
      "text": "3.2. ShareNotification/changes",
      "section_title": true,
      "ja": "3.2. 共有測定/変更"
    },
    {
      "indent": 3,
      "text": "This is a standard \"/changes\" method as described in [RFC8620], Section 5.2.",
      "ja": "これは、[RFC8620]、セクション5.2で説明されている標準の「/変更」メソッドです。"
    },
    {
      "indent": 0,
      "text": "3.3. ShareNotification/set",
      "section_title": true,
      "ja": "3.3. 共有測定/セット"
    },
    {
      "indent": 3,
      "text": "This is a standard \"/set\" method as described in [RFC8620], Section 5.3.",
      "ja": "これは、[RFC8620]、セクション5.3で説明されている標準の「/セット」メソッドです。"
    },
    {
      "indent": 3,
      "text": "Only destroy is supported; any attempt to create/update MUST be rejected with a \"forbidden\" SetError.",
      "ja": "破壊のみがサポートされています。作成/更新の試みは、「禁じられた」セットナーで拒否されなければなりません。"
    },
    {
      "indent": 0,
      "text": "3.4. ShareNotification/query",
      "section_title": true,
      "ja": "3.4. シェレノット化/クエリ"
    },
    {
      "indent": 3,
      "text": "This is a standard \"/query\" method as described in [RFC8620], Section 5.5.",
      "ja": "これは、[RFC8620]、セクション5.5で説明されている標準「/クエリ」メソッドです。"
    },
    {
      "indent": 0,
      "text": "3.4.1. Filtering",
      "section_title": true,
      "ja": "3.4.1. フィルタリング"
    },
    {
      "indent": 3,
      "text": "A *FilterCondition* object has the following properties, all of which are optional:",
      "ja": "A * FilterCondition *オブジェクトには次のプロパティがあり、そのすべてがオプションです。"
    },
    {
      "indent": 3,
      "text": "*after*: UTCDate|null",
      "ja": "*後*：utcdate | null"
    },
    {
      "indent": 12,
      "text": "The creation date must be on or after this date to match the condition.",
      "ja": "作成日は、条件に合わせてこの日付以降に行う必要があります。"
    },
    {
      "indent": 3,
      "text": "*before*: UTCDate|null",
      "ja": "*前*：utcdate | null"
    },
    {
      "indent": 12,
      "text": "The creation date must be before this date to match the condition.",
      "ja": "作成日は、この日付の前に条件に一致する必要があります。"
    },
    {
      "indent": 3,
      "text": "*objectType*: String",
      "ja": "*ObjectType*：文字列"
    },
    {
      "indent": 12,
      "text": "The objectType value must be identical to the given value to match the condition.",
      "ja": "ObjectType値は、条件と一致するために指定された値と同一でなければなりません。"
    },
    {
      "indent": 3,
      "text": "*objectAccountId*: Id",
      "ja": "*ObjectAccountid*：id"
    },
    {
      "indent": 12,
      "text": "The objectAccountId value must be identical to the given value to match the condition.",
      "ja": "ObjectAccountid値は、条件に合わせて指定された値と同一でなければなりません。"
    },
    {
      "indent": 3,
      "text": "All given conditions in the FilterCondition object must match for the ShareNotification to match.",
      "ja": "フィルターコンディションオブジェクト内のすべての条件は、シェレノット化が一致するために一致する必要があります。"
    },
    {
      "indent": 0,
      "text": "3.4.2. Sorting",
      "section_title": true,
      "ja": "3.4.2. ソート"
    },
    {
      "indent": 3,
      "text": "The \"created\" property MUST be supported for sorting.",
      "ja": "「作成された」プロパティは、ソートのためにサポートする必要があります。"
    },
    {
      "indent": 0,
      "text": "3.5. ShareNotification/queryChanges",
      "section_title": true,
      "ja": "3.5. シェレノット化/QueryChanges"
    },
    {
      "indent": 3,
      "text": "This is a standard \"/queryChanges\" method as described in [RFC8620], Section 5.6.",
      "ja": "これは、[RFC8620]、セクション5.6で説明されている標準「/QueryChanges」メソッドです。"
    },
    {
      "indent": 0,
      "text": "4. Framework for Shared Data",
      "section_title": true,
      "ja": "4. 共有データのフレームワーク"
    },
    {
      "indent": 3,
      "text": "Shareable data types MUST define the following three properties:",
      "ja": "共有可能なデータ型は、次の3つのプロパティを定義する必要があります。"
    },
    {
      "indent": 3,
      "text": "*isSubscribed*: Boolean",
      "ja": "*Issubscribed*：boolean"
    },
    {
      "indent": 12,
      "text": "The value true indicates that the user wishes to subscribe to see this data. The value false indicates that the user does not wish to subscribe to see this data. The initial value for this property when data is shared by another user is implementation dependent, although data types may give advice on appropriate defaults.",
      "ja": "値は、ユーザーがこのデータを表示するために購読したいことを示しています。値のfalseは、ユーザーがこのデータを表示するために購読したくないことを示しています。データ型が適切なデフォルトに関するアドバイスを提供する場合がありますが、別のユーザーがデータが共有される場合、このプロパティの初期値は実装依存です。"
    },
    {
      "indent": 3,
      "text": "*myRights*: String[Boolean]",
      "ja": "*MyRights*：String [boolean]"
    },
    {
      "indent": 12,
      "text": "The set of permissions the user currently has. Appropriate permissions are domain specific and must be defined per data type. Each key is the name of a permission defined for that data type. The value for the key is true if the user has the permission or false if they do not.",
      "ja": "ユーザーが現在持っている許可のセット。適切な権限はドメイン固有であり、データ型ごとに定義する必要があります。各キーは、そのデータ型に対して定義された許可の名前です。キーの値は、ユーザーが許可を持っている場合、またはそうでない場合は偽りを持っている場合は真です。"
    },
    {
      "indent": 3,
      "text": "*shareWith*: Id[String[Boolean]]|null",
      "ja": "*ShareWith*：id [String [boolean]] | null"
    },
    {
      "indent": 12,
      "text": "The value of this property is null if the data is not shared with anyone. Otherwise, it is a map where each key is the id of a Principal with which this data is shared, and the value associated with that key is the rights to give that Principal, in the same format as the \"myRights\" property. The Account id for the Principal id can be found in the capabilities of the Account this object is in (see Section 1.5.2).",
      "ja": "データが誰とも共有されない場合、このプロパティの値はヌルです。それ以外の場合は、各キーがこのデータが共有されるプリンシパルのIDであり、そのキーに関連する値は、「マイライト」プロパティと同じ形式でそのプリンシパルを与える権利です。プリンシパルIDのアカウントIDは、このオブジェクトがあるアカウントの機能に記載されています（セクション1.5.2を参照）。"
    },
    {
      "indent": 12,
      "text": "Users with appropriate permission may set this property to modify who the data is shared with. The Principal that owns the Account that this data is in MUST NOT be in the map, since the owner's rights are implicit.",
      "ja": "適切な許可を得てユーザーは、このプロパティを設定して、データが誰と共有されるかを変更する場合があります。所有者の権利は暗黙的であるため、このデータが含まれているアカウントを所有している校長はマップに載ってはなりません。"
    },
    {
      "indent": 0,
      "text": "4.1. Example",
      "section_title": true,
      "ja": "4.1. 例"
    },
    {
      "indent": 3,
      "text": "Suppose we are designing a data model for a very simple to-do list. There is a Todo data type representing a single item to do, each of which belongs to a single TodoList. The specification makes the TodoLists shareable by referencing this document and defining the common properties.",
      "ja": "非常にシンプルなTo Doリストのデータモデルを設計しているとします。1つのアイテムを表すTODOデータ型があり、それぞれが単一のトドリストに属します。この仕様により、このドキュメントを参照し、共通の特性を定義することにより、トドーリストが共有可能になります。"
    },
    {
      "indent": 3,
      "text": "First, it would define a set of domain-specific rights. For example, a TodoListRights object may have the following properties:",
      "ja": "まず、ドメイン固有の権利のセットを定義します。たとえば、Todolistrightsオブジェクトには次のプロパティがある場合があります。"
    },
    {
      "indent": 3,
      "text": "*mayRead*: Boolean",
      "ja": "*mayread*：boolean"
    },
    {
      "indent": 12,
      "text": "The user may fetch this TodoList and any Todos that belong to this TodoList.",
      "ja": "ユーザーは、このトドリストとこのトドリストに属するすべてのトドを取得する場合があります。"
    },
    {
      "indent": 3,
      "text": "*mayWrite*: Boolean",
      "ja": "*メイライト*：ブール"
    },
    {
      "indent": 12,
      "text": "The user may create, update, or destroy Todos that belong to this TodoList and may change the \"name\" property of this TodoList.",
      "ja": "ユーザーは、このトドリストに属するTODOを作成、更新、または破壊し、このトドリストの「名前」プロパティを変更する場合があります。"
    },
    {
      "indent": 3,
      "text": "*mayAdmin*: Boolean",
      "ja": "*Mayadmin*：boolean"
    },
    {
      "indent": 12,
      "text": "The user may see and modify the \"myRights\" property of this TodoList and may destroy this TodoList.",
      "ja": "ユーザーは、このトドーリストの「マイライト」の財産を見て変更し、このトドリストを破壊する場合があります。"
    },
    {
      "indent": 3,
      "text": "Then in the TodoList data type, we would include the three common properties described in Section 4, in addition to any type-specific properties (like \"name\" in this case):",
      "ja": "次に、Todolistのデータ型では、セクション4で説明されている3つの一般的なプロパティを含めます。"
    },
    {
      "indent": 3,
      "text": "*id*: Id (immutable; server-set)",
      "ja": "*id*：id（inmutable; server-set）"
    },
    {
      "indent": 12,
      "text": "The id of the object.",
      "ja": "オブジェクトのID。"
    },
    {
      "indent": 3,
      "text": "*name*: String",
      "ja": "*名前*：文字列"
    },
    {
      "indent": 12,
      "text": "A name for this list of Todos.",
      "ja": "トドスのこのリストの名前。"
    },
    {
      "indent": 3,
      "text": "*isSubscribed*: Boolean",
      "ja": "*Issubscribed*：boolean"
    },
    {
      "indent": 12,
      "text": "True if the user has indicated they wish to see this list. If false, clients should not display this TodoList with the user's other TodoLists but should provide a means for users to see and subscribe to all TodoLists that have been shared with them.",
      "ja": "ユーザーがこのリストを見たいと思っていることを示している場合はtrue。falseの場合、クライアントはユーザーの他のトドーリストと一緒にこのトドリストを表示すべきではなく、ユーザーが共有されているすべてのトドーリストを見て購読する手段を提供する必要があります。"
    },
    {
      "indent": 3,
      "text": "*myRights*: TodoListRights",
      "ja": "*MyRights*：Todolistrights"
    },
    {
      "indent": 12,
      "text": "The set of permissions the user currently has for this TodoList.",
      "ja": "ユーザーが現在このトドリストに対して持っている一連の権限。"
    },
    {
      "indent": 3,
      "text": "*shareWith*: Id[TodoListRights]|null",
      "ja": "*ShareWith*：id [todolistrights] | null"
    },
    {
      "indent": 12,
      "text": "If not shared with anyone, the value is null. Otherwise, it's a map where the keys are Principal ids and the values are the rights given to those Principals. Users with the \"mayAdmin\" right may set this property to modify who the data is shared with. The Principal that owns the Account that this data is in MUST NOT be in the map; their rights are implicit.",
      "ja": "誰かと共有されていない場合、値はヌルです。それ以外の場合は、キーが主要なIDであり、値がそれらのプリンシパルに与えられる権利であるマップです。「MayAdmin」権利のユーザーは、このプロパティを設定して、データが誰と共有されているかを変更する場合があります。このデータが含まれているアカウントを所有しているプリンシパルは、マップに含まれてはなりません。彼らの権利は暗黙的です。"
    },
    {
      "indent": 3,
      "text": "We would also define a new Principal capability with two properties:",
      "ja": "また、2つのプロパティを使用して新しい主要な機能を定義します。"
    },
    {
      "indent": 3,
      "text": "*accountId*: Id|null",
      "ja": "*accountid*：id | null"
    },
    {
      "indent": 12,
      "text": "The accountId containing the Todo data for this Principal, if it has been shared with the requesting user.",
      "ja": "要求ユーザーと共有されている場合、このプリンシパルのTODOデータを含むAccountID。"
    },
    {
      "indent": 3,
      "text": "*mayShareWith*: Boolean",
      "ja": "*maysharewith*：boolean"
    },
    {
      "indent": 12,
      "text": "The user may give this Principal permission to access a TodoList.",
      "ja": "ユーザーは、この主な許可をdoweristしている場合があります。"
    },
    {
      "indent": 3,
      "text": "A client wishing to let the user configure sharing would look at the \"capabilities\" for the Account containing the user's Todo data and find the \"urn:ietf:params:jmap:principals:owner\" property, as per Section 1.5.2. For example, the JMAP Session object might contain:",
      "ja": "ユーザーに共有を構成させたいクライアントは、ユーザーのTODOデータを含むアカウントの「機能」を調べ、「urn：ietf：params：jmap：principals：所有者」プロパティをセクション1.5.2に従って見つけます。たとえば、JMAPセッションオブジェクトには以下が含まれる場合があります。"
    },
    {
      "indent": 3,
      "text": "{\n  \"accounts\": {\n    \"u12345678\": {\n      \"name\": \"jane.doe@example.com\",\n      \"isPersonal\": true,\n      \"isReadOnly\": false,\n      \"accountCapabilities\": {\n        \"urn:com.example:jmap:todo\": {},\n        \"urn:ietf:params:jmap:principals:owner\": {\n          \"accountIdForPrincipal\": \"u33084183\",\n          \"principalId\": \"P105aga511jaa\"\n        }\n      }\n    },\n    ...\n  },\n  ...\n}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 18,
      "text": "Figure 1: Part of a JMAP Session Object",
      "ja": "図1：JMAPセッションオブジェクトの一部"
    },
    {
      "indent": 3,
      "text": "From this, the client now knows which Account has the Principal data, and it can fetch the list of Principals and offer to share it with the user by making an API request like this:",
      "ja": "このことから、クライアントはどのアカウントが主要なデータを持っているかを知っており、プリンシパルのリストを取得し、次のようなAPI要求を行うことでユーザーと共有することを申し出ることができます。"
    },
    {
      "indent": 3,
      "text": "[[ \"Principal/get\", {\n  \"accountId\": \"u33084183\",\n  \"ids\": null\n}, \"0\" ]]",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 13,
      "text": "Figure 2: \"methodCalls\" Property of a JMAP Request",
      "ja": "図2：JMAP要求の「MethodCalls」プロパティ"
    },
    {
      "indent": 3,
      "text": "Here's an example response (where \"Joe Bloggs\" is another user that this user could share their TodoList with; Joe has not shared any of their own data with this user, so the \"accounts\" property is null):",
      "ja": "ここに応答の例があります（「Joe Bloggs」は、このユーザーがTodolistを共有できる別のユーザーです。Joeはこのユーザーと独自のデータを共有していないため、「アカウント」プロパティはnullです）："
    },
    {
      "indent": 3,
      "text": "[[ \"Principal/get\", {\n  \"accountId\": \"u33084183\",\n  \"state\": \"7b8eff5zz\",\n  \"list\": [{\n    \"id\": \"P2342fnddd20\",\n    \"type\": \"individual\",\n    \"name\": \"Joe Bloggs\",\n    \"description\": null,\n    \"email\": \"joe.bloggs@example.com\",\n    \"timeZone\": \"Australia/Melbourne\",\n    \"capabilities\": {\n        \"urn:com.example:jmap:todo\": {\n            \"accountId\": null,\n            \"mayShareWith\": true\n        }\n    },\n    \"accounts\": null\n  }, {\n    \"id\": \"P674pp24095qo49pr\",\n    \"name\": \"Board room\",\n    \"type\": \"location\",\n    ...\n  }, ... ],\n  \"notFound\": []\n}, \"0\" ]]",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 10,
      "text": "Figure 3: \"methodResponses\" Property of a JMAP Response",
      "ja": "図3：JMAP応答の「MethodSponses」プロパティ"
    },
    {
      "indent": 3,
      "text": "A TodoList can be shared with \"Joe Bloggs\" by updating its shareWith property, as in this example request:",
      "ja": "この例のリクエストのように、Todolistは「Joe Bloggs」と共有することができます。"
    },
    {
      "indent": 3,
      "text": "[[ \"TodoList/set\", {\n  \"accountId\": \"u12345678\",\n  \"update\": {\n    \"tl01n231\": {\n        \"shareWith\": {\n            \"P2342fnddd20\": {\n                \"mayRead\": true,\n                \"mayWrite\": true,\n                \"mayAdmin\": false\n            }\n        }\n    }\n  }\n}, \"0\" ]]",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 13,
      "text": "Figure 4: \"methodCalls\" Property of a JMAP Request",
      "ja": "図4：JMAP要求の「MethodCalls」プロパティ"
    },
    {
      "indent": 0,
      "text": "5. Internationalization Considerations",
      "section_title": true,
      "ja": "5. 国際化の考慮事項"
    },
    {
      "indent": 3,
      "text": "Experience has shown that unrestricted use of Unicode can lead to problems such as inconsistent rendering, users reading text and interpreting it differently than intended, and unexpected results when copying text from one location to another. Servers MAY choose to mitigate this by restricting the set of characters allowed in otherwise unconstrained String fields. The FreeformClass, as documented in [RFC8264], Section 4.3, might be a good starting point for this.",
      "ja": "経験によると、Unicodeの無制限の使用は、一貫性のないレンダリング、ユーザーがテキストを読んで、意図したものとは異なる方法で解釈するなどの問題につながる可能性があり、ある場所から別の場所にテキストをコピーする際の予期しない結果が得られることが示されています。サーバーは、制約のない文字列フィールドで許可されている文字のセットを制限することにより、これを軽減することを選択できます。[RFC8264]で文書化されているフリーフォームクラス、セクション4.3は、これの良い出発点かもしれません。"
    },
    {
      "indent": 3,
      "text": "Attempts to set a value containing code points outside of the permissible set can be handled in a few ways by the server. The first option is to simply strip the forbidden characters and store the resulting string. This is likely to be appropriate for control characters, for example, where they can end up in data accidentally due to copy-and-paste issues and are probably invisible to the end user. JMAP allows the server to transform data on create/update, as long as any changed properties are returned to the client in the \"/set\" response so it knows what has changed, as per [RFC8620], Section 5.3. Alternatively, the server MAY just reject the create/ update with an \"invalidProperties\" SetError.",
      "ja": "許容セットの外側にコードポイントを含む値を設定する試みは、サーバーによっていくつかの方法で処理できます。最初のオプションは、禁じられた文字を単純に剥がし、結果の文字列を保存することです。これは、たとえばコントロールキャラクターに適している可能性があります。たとえば、コピーアンドペーストの問題により誤ってデータに到達することができ、おそらくエンドユーザーには見えないでしょう。JMAPを使用すると、サーバーは、[/set]応答で変更されたプロパティがクライアントに返される限り、[RFC8620]に従って変更されたものを知っている限り、作成/更新のデータを変換できます。あるいは、サーバーは、「nivalidproperties」setErrorで作成/更新を拒否するだけです。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "All security considerations of JMAP [RFC8620] apply to this specification. Additional considerations are detailed below.",
      "ja": "JMAP [RFC8620]のすべてのセキュリティ上の考慮事項は、この仕様に適用されます。追加の考慮事項を以下に詳しく説明してください。"
    },
    {
      "indent": 0,
      "text": "6.1. Spoofing",
      "section_title": true,
      "ja": "6.1. スプーフィング"
    },
    {
      "indent": 3,
      "text": "Allowing users to edit their own Principal's name (and, to a lesser extent, email, description, or type) could allow a user to change their Principal to look like another user in the system, potentially tricking others into sharing private data with them. Servers may choose to forbid this and SHOULD keep logs of such changes to provide an audit trail.",
      "ja": "ユーザーが自分のプリンシパルの名前を編集できるようにする（そして、程度は低い範囲で、電子メール、説明、またはタイプ）により、ユーザーがシステム内の別のユーザーのように見えるようにユーザーが変更できるようになり、他のユーザーとプライベートデータを共有する可能性があります。サーバーはこれを禁止することを選択し、そのような変更のログを保持して監査証跡を提供する必要があります。"
    },
    {
      "indent": 3,
      "text": "Note that simply forbidding the use of a name already in the system is insufficient protection, as a malicious user could still change their name to something easily confused with the existing name by using trivial misspellings or visually similar Unicode characters.",
      "ja": "悪意のあるユーザーは、些細な間違いまたは視覚的に類似したユニコード文字を使用して、既存の名前と簡単に混同されるものに名前を変更できるため、システム内ですでに名前の使用を使用することは不十分であることに注意してください。"
    },
    {
      "indent": 0,
      "text": "6.2. Unnoticed Sharing",
      "section_title": true,
      "ja": "6.2. 気付かれていない共有"
    },
    {
      "indent": 3,
      "text": "Sharing data with another user allows someone to turn a transitory account compromise (e.g., brief access to an unlocked or logged-in client) into a persistent compromise (by setting up sharing with a user that is controlled by the attacker). This can be mitigated by requiring further authorization for configuring sharing or sending notifications to the sharer via another channel whenever a new permission is added.",
      "ja": "別のユーザーとデータを共有すると、誰かが一時的なアカウントの妥協（例：ロック解除またはログインしたクライアントへの簡単なアクセス）を永続的な妥協に変えることができます（攻撃者が制御するユーザーと共有をセットアップすることにより）。これは、新しい許可が追加されるたびに、別のチャネルを介して共有の共有を構成または共有者に送信するためのさらなる許可を要求することにより、軽減できます。"
    },
    {
      "indent": 0,
      "text": "6.3. Denial of Service",
      "section_title": true,
      "ja": "6.3. サービス拒否"
    },
    {
      "indent": 3,
      "text": "By creating many changes to the sharing status of objects, a user can cause many ShareNotifications to be generated, which could lead to resource exhaustion. Servers can mitigate this by coalescing multiple changes to the same object into a single notification, limiting the maximum number of notifications it stores per user and/ or rate-limiting the changes to sharing permissions in the first place. Automatically deleting older notifications after reaching a limit can mean the user is not made aware of a sharing change, which can itself be a security issue. For this reason, it is better to coalesce changes and use other mitigation strategies.",
      "ja": "オブジェクトの共有ステータスに多くの変更を作成することにより、ユーザーは多くの共有視力を生成する可能性があり、リソースの疲労につながる可能性があります。サーバーは、同じオブジェクトへの複数の変更を単一の通知に合わせて緩和し、ユーザーごとに保存する通知の最大数を制限し、最初に変更許可の共有権限へのレート制限を制限することにより、これを軽減できます。制限に達した後に古い通知を自動的に削除すると、ユーザーがセキュリティの問題になる可能性のある共有の変更を認識しないことを意味します。このため、変更を合体し、他の緩和戦略を使用する方が良いでしょう。"
    },
    {
      "indent": 0,
      "text": "6.4. Unauthorized Principals",
      "section_title": true,
      "ja": "6.4. 不正な校長"
    },
    {
      "indent": 3,
      "text": "The set of Principals within a shared environment MUST be strictly controlled. If adding a new Principal is open to the public, risks include:",
      "ja": "共有環境内のプリンシパルのセットは、厳密に制御する必要があります。新しいプリンシパルを追加することが一般に公開されている場合、リスクには次のものが含まれます。"
    },
    {
      "indent": 6,
      "text": "* An increased risk of a user accidentally sharing data with an unintended person.",
      "ja": "* ユーザーが意図しない人と誤ってデータを共有するリスクの増加。"
    },
    {
      "indent": 6,
      "text": "* An attacker sharing unwanted or offensive information with the user.",
      "ja": "* ユーザーと不要なまたは攻撃的な情報を共有する攻撃者。"
    },
    {
      "indent": 6,
      "text": "* An attacker sharing items with spam content in the names in order to generate ShareNotification objects, which are likely to be prominently displayed to the user receiving them.",
      "ja": "* 攻撃者は、ShareNotificationオブジェクトを生成するために、名前のスパムコンテンツでアイテムを共有します。"
    },
    {
      "indent": 0,
      "text": "7. IANA Considerations",
      "section_title": true,
      "ja": "7. IANAの考慮事項"
    },
    {
      "indent": 0,
      "text": "7.1. JMAP Capability Registration for \"principals\"",
      "section_title": true,
      "ja": "7.1. 「プリンシパル」のJMAP機能登録"
    },
    {
      "indent": 3,
      "text": "IANA has registered \"principals\" in the \"JMAP Capabilities\" registry as follows:",
      "ja": "IANAは、次のように「JMAP機能」レジストリに「プリンシパル」を登録しています。"
    },
    {
      "indent": 3,
      "text": "Capability Name:",
      "ja": "機能名："
    },
    {
      "indent": 12,
      "text": "urn:ietf:params:jmap:principals",
      "ja": "urn：ietf：params：jmap：principals"
    },
    {
      "indent": 3,
      "text": "Intended Use:",
      "ja": "使用目的："
    },
    {
      "indent": 12,
      "text": "common",
      "ja": "一般"
    },
    {
      "indent": 3,
      "text": "Change Controller:",
      "ja": "Change Controller："
    },
    {
      "indent": 12,
      "text": "IETF",
      "ja": "IETF"
    },
    {
      "indent": 3,
      "text": "Security and Privacy Considerations:",
      "ja": "セキュリティとプライバシーの考慮事項："
    },
    {
      "indent": 12,
      "text": "RFC 9670, Section 6",
      "ja": "RFC 9670、セクション6"
    },
    {
      "indent": 3,
      "text": "Reference:",
      "ja": "参照："
    },
    {
      "indent": 12,
      "text": "RFC 9670",
      "ja": "RFC 9670"
    },
    {
      "indent": 0,
      "text": "7.2. JMAP Capability Registration for \"principals:owner\"",
      "section_title": true,
      "ja": "7.2. 「プリンシパル：所有者」のJMAP機能登録"
    },
    {
      "indent": 3,
      "text": "IANA has registered \"principals:owner\" in the \"JMAP Capabilities\" registry as follows:",
      "ja": "IANAは、「JMAP機能」レジストリに「校長：所有者」を次のように登録しています。"
    },
    {
      "indent": 3,
      "text": "Capability Name:",
      "ja": "機能名："
    },
    {
      "indent": 12,
      "text": "urn:ietf:params:jmap:principals:owner",
      "ja": "urn：ietf：params：jmap：principals：所有者"
    },
    {
      "indent": 3,
      "text": "Intended Use:",
      "ja": "使用目的："
    },
    {
      "indent": 12,
      "text": "common",
      "ja": "一般"
    },
    {
      "indent": 3,
      "text": "Change Controller:",
      "ja": "Change Controller："
    },
    {
      "indent": 12,
      "text": "IETF",
      "ja": "IETF"
    },
    {
      "indent": 3,
      "text": "Security and Privacy Considerations:",
      "ja": "セキュリティとプライバシーの考慮事項："
    },
    {
      "indent": 12,
      "text": "RFC 9670, Section 6",
      "ja": "RFC 9670、セクション6"
    },
    {
      "indent": 3,
      "text": "Reference:",
      "ja": "参照："
    },
    {
      "indent": 12,
      "text": "RFC 9670",
      "ja": "RFC 9670"
    },
    {
      "indent": 0,
      "text": "7.3. JMAP Data Type Registration for \"Principal\"",
      "section_title": true,
      "ja": "7.3. JMAPデータ型「プリンシパル」の登録"
    },
    {
      "indent": 3,
      "text": "IANA has registered \"Principal\" in the \"JMAP Data Types\" registry as follows:",
      "ja": "IANAは、次のように「JMAPデータ型」レジストリに「プリンシパル」を登録しています。"
    },
    {
      "indent": 3,
      "text": "Type Name:",
      "ja": "タイプ名："
    },
    {
      "indent": 12,
      "text": "Principal",
      "ja": "主要"
    },
    {
      "indent": 3,
      "text": "Can Reference Blobs:",
      "ja": "塊を参照できます："
    },
    {
      "indent": 12,
      "text": "No",
      "ja": "いいえ"
    },
    {
      "indent": 3,
      "text": "Can Use for State Change:",
      "ja": "状態の変更に使用できます："
    },
    {
      "indent": 12,
      "text": "Yes",
      "ja": "はい"
    },
    {
      "indent": 3,
      "text": "Capability:",
      "ja": "能力："
    },
    {
      "indent": 12,
      "text": "urn:ietf:params:jmap:principals",
      "ja": "urn：ietf：params：jmap：principals"
    },
    {
      "indent": 3,
      "text": "Reference:",
      "ja": "参照："
    },
    {
      "indent": 12,
      "text": "RFC 9670",
      "ja": "RFC 9670"
    },
    {
      "indent": 0,
      "text": "7.4. JMAP Data Type Registration for \"ShareNotification\"",
      "section_title": true,
      "ja": "7.4. JMAPデータ型「共有測定」の登録"
    },
    {
      "indent": 3,
      "text": "IANA has registered \"ShareNotification\" in the \"JMAP Data Types\" registry as follows:",
      "ja": "IANAは、次のように「JMAPデータ型」レジストリに「共有測定」を登録しています。"
    },
    {
      "indent": 3,
      "text": "Type Name:",
      "ja": "タイプ名："
    },
    {
      "indent": 12,
      "text": "ShareNotification",
      "ja": "共有化"
    },
    {
      "indent": 3,
      "text": "Can Reference Blobs:",
      "ja": "塊を参照できます："
    },
    {
      "indent": 12,
      "text": "No",
      "ja": "いいえ"
    },
    {
      "indent": 3,
      "text": "Can Use for State Change:",
      "ja": "状態の変更に使用できます："
    },
    {
      "indent": 12,
      "text": "Yes",
      "ja": "はい"
    },
    {
      "indent": 3,
      "text": "Capability:",
      "ja": "能力："
    },
    {
      "indent": 12,
      "text": "urn:ietf:params:jmap:principals",
      "ja": "urn：ietf：params：jmap：principals"
    },
    {
      "indent": 3,
      "text": "Reference:",
      "ja": "参照："
    },
    {
      "indent": 12,
      "text": "RFC 9670",
      "ja": "RFC 9670"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8. 参考文献"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "ja": "8.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC2119]  Bradner, S., \"Key words for use in RFCs to Indicate\n           Requirement Levels\", BCP 14, RFC 2119,\n           DOI 10.17487/RFC2119, March 1997,\n           <https://www.rfc-editor.org/info/rfc2119>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC5322]  Resnick, P., Ed., \"Internet Message Format\", RFC 5322,\n           DOI 10.17487/RFC5322, October 2008,\n           <https://www.rfc-editor.org/info/rfc5322>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC8174]  Leiba, B., \"Ambiguity of Uppercase vs Lowercase in RFC\n           2119 Key Words\", BCP 14, RFC 8174, DOI 10.17487/RFC8174,\n           May 2017, <https://www.rfc-editor.org/info/rfc8174>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC8620]  Jenkins, N. and C. Newman, \"The JSON Meta Application\n           Protocol (JMAP)\", RFC 8620, DOI 10.17487/RFC8620, July\n           2019, <https://www.rfc-editor.org/info/rfc8620>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "ja": "8.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[IANA-JMAP]\n           IANA, \"JMAP Data Types\",\n           <https://www.iana.org/assignments/jmap>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[IANA-TZDB]\n           IANA, \"Time Zone Database\",\n           <https://www.iana.org/time-zones>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC8264]  Saint-Andre, P. and M. Blanchet, \"PRECIS Framework:\n           Preparation, Enforcement, and Comparison of\n           Internationalized Strings in Application Protocols\",\n           RFC 8264, DOI 10.17487/RFC8264, October 2017,\n           <https://www.rfc-editor.org/info/rfc8264>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "section_title": true,
      "ja": "著者の連絡先"
    },
    {
      "indent": 3,
      "text": "Neil Jenkins (editor)\nFastmail\nPO Box 234, Collins St West\nMelbourne VIC 8007\nAustralia\nEmail: neilj@fastmailteam.com\nURI:   https://www.fastmail.com",
      "raw": true,
      "ja": ""
    }
  ]
}