{
  "title": {
    "text": "RFC 9476 - The .alt Special-Use Top-Level Domain",
    "ja": "RFC 9476 - .Alt Special-Useのトップレベルドメイン"
  },
  "number": 9476,
  "created_at": "2023-09-17 23:48:01.935104+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         W. Kumari\nRequest for Comments: 9476                                        Google\nCategory: Standards Track                                     P. Hoffman\nISSN: 2070-1721                                                    ICANN\n                                                          September 2023",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 17,
      "text": "The .alt Special-Use Top-Level Domain",
      "ja": ".Alt Special-Useのトップレベルドメイン"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document reserves a Top-Level Domain (TLD) label \"alt\" to be used in non-DNS contexts. It also provides advice and guidance to developers creating alternative namespaces.",
      "ja": "このドキュメントは、非DNSコンテキストで使用されるトップレベルドメイン（TLD）ラベル「Alt」を留保します。また、代替名空間を作成する開発者にアドバイスとガイダンスを提供します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準トラックドキュメントです。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 7841.",
      "ja": "このドキュメントは、インターネットエンジニアリングタスクフォース（IETF）の製品です。IETFコミュニティのコンセンサスを表しています。公開レビューを受けており、インターネットエンジニアリングステアリンググループ（IESG）からの出版が承認されています。インターネット標準の詳細については、RFC 7841のセクション2で入手できます。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at https://www.rfc-editor.org/info/rfc9476.",
      "ja": "このドキュメントの現在のステータス、任意のERRATA、およびそのフィードバックを提供する方法に関する情報は、https：//www.rfc-editor.org/info/rfc9476で取得できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2023 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（c）2023 IETF Trustおよび文書著者として特定された人。無断転載を禁じます。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (https://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Revised BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Revised BSD License.",
      "ja": "このドキュメントは、BCP 78およびIETFドキュメント（https://trustee.ietf.org/license-info）に関連するIETF Trustの法的規定の対象となります。この文書に関するあなたの権利と制限を説明するので、これらの文書を注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、セクション4.Eで説明されている法的規定のセクション4.Eで説明されており、改訂されたBSDライセンスで説明されている保証なしで提供されるように、改訂されたBSDライセンステキストを含める必要があります。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction\n  1.1.  Terminology\n  1.2.  Requirements Terminology\n2.  The .alt Namespace\n3.  IANA Considerations\n  3.1.  Special-Use Domain Name Registry\n  3.2.  Domain Name Reservation Considerations\n4.  Privacy Considerations\n5.  Security Considerations\n6.  References\n  6.1.  Normative References\n  6.2.  Informative References\nAcknowledgements\nAuthors' Addresses",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "Many Internet protocols need to name entities. Names that look like DNS names (a series of labels separated with dots) have become common, even in systems that are not part of the global DNS administered by IANA. This document reserves the top-level label \"alt\" (short for \"alternative\") as a special-use domain name [RFC6761]. This top-level label can be used as the final (rightmost) label to signify that the name is not rooted in the global DNS and that it should not be resolved using the DNS protocol.",
      "ja": "多くのインターネットプロトコルは、エンティティに名前を付ける必要があります。DNS名（ドットで区切られた一連のラベル）のように見える名前は、IANAが管理するグローバルDNSの一部ではないシステムでも一般的になりました。このドキュメントは、最高レベルのラベル「Alt」（「代替」の略）を特別使用ドメイン名[RFC6761]として留保します。このトップレベルのラベルは、ファイナル（右端の）ラベルとして使用して、名前がグローバルDNSに根付いておらず、DNSプロトコルを使用して解決すべきではないことを意味します。"
    },
    {
      "indent": 3,
      "text": "Throughout the rest of this document, the top-level \"alt\" label is shown as \".alt\" to match the common presentation form of DNS names.",
      "ja": "このドキュメントの残りの部分を通して、DNS名の一般的なプレゼンテーション形式と一致するように、トップレベルの「alt」ラベルが「.alt」として表示されます。"
    },
    {
      "indent": 3,
      "text": "As detailed in Section 3.1, IANA has added the .alt name to the \"Special-Use Domain Name\" registry. IANA sets aside names in that registry, as described in <https://www.iana.org/domains/reserved>.",
      "ja": "セクション3.1で詳述されているように、IANAは「Special-Use Domain Name」レジストリに.Alt名を追加しました。IANAは、<https://www.iana.org/domains/reserved>に記載されているように、そのレジストリに名前を脇に置いています。"
    },
    {
      "indent": 3,
      "text": "The techniques in this document are primarily intended to address some of the issues discussed in [RFC8244], which contains additional background on the issues with special-use domain names.",
      "ja": "このドキュメントの手法は、主に[RFC8244]で説明されている問題のいくつかに対処することを目的としています。"
    },
    {
      "indent": 3,
      "text": "In this document, \".alt\" was chosen for the special-use domain name instead of something like \"alt.arpa\" so that systems that use the name do not have to worry that a parent of their name would be resolved if the name leaked to the Internet. Historically, some systems that want to use non-DNS names wanted the entire name to be not in the DNS, and reserving \".alt\" fulfills that use case.",
      "ja": "このドキュメントでは、「alt.arpa」のようなものではなく、特別使用ドメイン名に「.alt」が選択されたため、名前を使用するシステムは、名前の親が解決されることを心配する必要がありません。インターネットに漏れました。歴史的に、非DNS名を使用したいシステムの一部は、名前全体がDNSにないことを望んでおり、「.Alt」がそのユースケースを満たしていることを望んでいます。"
    },
    {
      "indent": 0,
      "text": "1.1. Terminology",
      "section_title": true,
      "ja": "1.1. 用語"
    },
    {
      "indent": 3,
      "text": "This document assumes familiarity with DNS terms; please see [RFC8499]. Terminology that is specific to this document is:",
      "ja": "このドキュメントは、DNS用語に精通していることを想定しています。[RFC8499]を参照してください。このドキュメントに固有の用語は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "DNS name: Domain names that are intended to be used with DNS resolution, either in the global DNS or in some other context.",
      "ja": "DNS名：グローバルDNSまたは他のコンテキストで、DNS解像度で使用することを目的としたドメイン名。"
    },
    {
      "indent": 3,
      "text": "DNS context: The namespace anchored at the globally unique DNS root and administered by IANA. This is the namespace or context that \"normal\" DNS uses.",
      "ja": "DNSコンテキスト：グローバルにユニークなDNSルートに固定され、IANAによって管理された名前空間。これは、「通常の」DNSが使用する名前空間またはコンテキストです。"
    },
    {
      "indent": 3,
      "text": "non-DNS context: Any other (alternative) namespace.",
      "ja": "非DNSコンテキスト：その他の（代替）名前空間。"
    },
    {
      "indent": 3,
      "text": "pseudo-TLD: A label that appears in a fully qualified domain name in the position of a TLD, which is not part of the global DNS. This term is not intended to be pejorative.",
      "ja": "Pseudo-TLD：グローバルDNSの一部ではないTLDの位置にある完全に適格なドメイン名に表示されるラベル。この用語は、軽jor的であることを意図したものではありません。"
    },
    {
      "indent": 3,
      "text": "TLD: See the definition in Section 2 of [RFC8499].",
      "ja": "TLD：[RFC8499]のセクション2の定義を参照してください。"
    },
    {
      "indent": 0,
      "text": "1.2. Requirements Terminology",
      "section_title": true,
      "ja": "1.2. 要件用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14 [RFC2119] [RFC8174] when, and only when, they appear in all capitals, as shown here.",
      "ja": "この文書のキーワード \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", および \"OPTIONAL\" はBCP 14 [RFC2119] [RFC8174]で説明されているように、すべて大文字の場合にのみ解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. The .alt Namespace",
      "section_title": true,
      "ja": "2. .Alt名空間"
    },
    {
      "indent": 3,
      "text": "This document reserves the .alt label for use as an unmanaged pseudo-TLD namespace. The .alt label can be used in any domain name as a pseudo-TLD to signify that this is an alternative (non-DNS) namespace and should not be looked up in a DNS context.",
      "ja": "このドキュメントは、.ALTラベルを管理していない擬似TLD名空間として使用するために留保されます。.Altラベルは、任意のドメイン名で擬似TLDとして使用して、これが代替（非DNS）名前空間であり、DNSコンテキストで調べてはならないことを示します。"
    },
    {
      "indent": 3,
      "text": "This document uses \".alt\" for the pseudo-TLD in the presentation format for the DNS, corresponding to a 0x03616c7400 suffix in DNS wire format. The on-the-wire formats for non-DNS protocols might be different.",
      "ja": "このドキュメントは、DNSワイヤ形式の0x03616C7400サフィックスに対応するDNSのプレゼンテーション形式で、擬似-TLDの「.Alt」を使用します。非DNSプロトコルのオンザワイヤ形式は異なる場合があります。"
    },
    {
      "indent": 3,
      "text": "Because names beneath .alt are in an alternative namespace, they have no significance in the regular DNS context. DNS stub and recursive resolvers do not need to look them up in the DNS context.",
      "ja": ".Altの下の名前は別の名前空間にあるため、通常のDNSコンテキストでは意味がありません。DNSスタブと再帰リゾルバーは、DNSコンテキストでそれらを調べる必要はありません。"
    },
    {
      "indent": 3,
      "text": "DNS resolvers that serve the DNS protocol and non-DNS protocols at the same time might consider .alt like a DNS entry in the \"Transport-Independent Locally-Served DNS Zone Registry\" that is part of IANA's \"Locally-Served DNS Zones\" registry, except that .alt is always used to denote names that are to be resolved by non-DNS protocols. Note that this document does not request adding .alt to these registries because .alt, by this specification, is not a DNS name.",
      "ja": "DNSプロトコルと非DNSプロトコルを同時に提供するDNSリゾルバーは、IANAの「輸送に依存しないDNSゾーンレジストリ」のDNSエントリのように.Altを検討する可能性があります。、それを除いて、.Altは常に非DNSプロトコルによって解決される名前を示すために使用されます。このドキュメントは、これらのレジストリへの追加を要求しないことに注意してください。"
    },
    {
      "indent": 3,
      "text": "Note that using .alt as a pseudo-TLD does not mandate how the non-DNS protocol will handle the name. To maximize compatibility with existing applications, it is suggested, but not required, that non-DNS protocols using names that end in .alt follow DNS name syntax. If the non-DNS protocol has a wire format like the DNS wire format, it might append the null label at the end of the name, but it also might not. This document does not make any suggestion for how non-DNS protocols deal with the wire format of their names.",
      "ja": "擬似-TLDとして.Altを使用しても、非DNSプロトコルが名前をどのように処理するかを義務付けていないことに注意してください。既存のアプリケーションとの互換性を最大化するために、.ALTで終了する名前を使用して非DNSプロトコルがDNS名構文に従うことを提案されていますが、必須ではありません。非DNSプロトコルにDNSワイヤ形式のようなワイヤ形式がある場合、名前の最後にnullラベルを追加する可能性がありますが、そうではないかもしれません。このドキュメントでは、非DNSプロトコルが名前のワイヤー形式をどのように扱うかについての提案はありません。"
    },
    {
      "indent": 3,
      "text": "Groups wishing to create new alternative namespaces may create their alternative namespace under a label that names their namespace under the .alt pseudo-TLD. This document defines neither a registry nor a governance model for the .alt namespace, as it is not managed by the IETF or IANA. There is no guarantee of unambiguous mappings from names to name resolution mechanisms. Mitigation or resolution of collisions that occur under .alt are outside the scope of this document and outside the IETF's remit. Users are advised to consider the associated risks when using names under .alt.",
      "ja": "新しい代替名空間を作成したいグループは、.Alt Pseudo-TLDの下に名前空間に名前を付けるラベルの下に代替名空間を作成する場合があります。このドキュメントでは、IETFまたはIANAによって管理されていないため、.Alt Namespaceのレジストリモデルもガバナンスモデルも定義されていません。名前からの明確なマッピングのマッピングの保証はありません。.ALTの下で発生する衝突の緩和または解決は、このドキュメントの範囲外およびIETFの送金の外側にあります。ユーザーは、.Altの下で名前を使用する場合、関連するリスクを考慮することをお勧めします。"
    },
    {
      "indent": 3,
      "text": "Regardless of the expectations above, names in the .alt pseudo-TLD will leak outside the context in which they are valid. Decades of experience show that such names will appear at recursive resolvers and will thus also appear at the root servers for the global DNS.",
      "ja": "上記の期待に関係なく、.alt pseudo-tldの名前は、それらが有効なコンテキストの外に漏れます。数十年の経験は、そのような名前が再帰的なリゾルバーに表示され、したがってグローバルDNSのルートサーバーにも表示されることを示しています。"
    },
    {
      "indent": 3,
      "text": "Sending traffic to the root servers that is known to always elicit an NXDOMAIN response, such as queries for names ending in .alt, wastes resources on both the resolver and the root server. Caching resolvers performing aggressive use of DNSSEC-validated caches (described in [RFC8198]) may mitigate this by synthesizing negative answers from cached NSEC records for names under .alt. Similarly, caching resolvers using QNAME minimization (described in [RFC9156]) will cause less of this traffic to the root servers because the negative responses will cover all names under .alt.",
      "ja": ".Altで終わる名前のクエリなど、常にNXDomain応答を引き出すことが知られているルートサーバーにトラフィックを送信すると、リゾルバーサーバーとルートサーバーの両方でリソースを無駄にします。DNSSEC検証キャッシュ（[RFC8198]に記載）の積極的な使用を実行するキャッシュリゾルバーは、.Altの名前のキャッシュされたNSECレコードからの否定的な答えを合成することにより、これを軽減する可能性があります。同様に、QNAME最小化（[RFC9156]で説明）を使用したキャッシュリゾルバーは、ネガティブな応答が.ALTのすべての名前をカバーするため、ルートサーバーへのこのトラフィックの原因が少なくなります。"
    },
    {
      "indent": 3,
      "text": "Currently deployed projects and protocols that are using pseudo-TLDs are recommended to move under the .alt pseudo-TLD, but this is not a requirement. Rather, the .alt pseudo-TLD is being reserved so that current and future projects of a similar nature have a designated place to create alternative resolution namespaces that will not conflict with the regular DNS context.",
      "ja": "擬似TLDを使用している現在展開されているプロジェクトとプロトコルは、.Alt擬似-TLDの下で移動するために推奨されますが、これは要件ではありません。むしろ、.Alt Pseudo-TLDは予約されているため、同様の性質の現在および将来のプロジェクトには、通常のDNSコンテキストと競合しない代替解像度名空間を作成するための指定された場所があります。"
    },
    {
      "indent": 0,
      "text": "3. IANA Considerations",
      "section_title": true,
      "ja": "3. IANAの考慮事項"
    },
    {
      "indent": 0,
      "text": "3.1. Special-Use Domain Name Registry",
      "section_title": true,
      "ja": "3.1. 特別使用ドメイン名レジストリ"
    },
    {
      "indent": 3,
      "text": "The IANA has added the .alt name to the \"Special-Use Domain Name\" registry [RFC6761] with a reference to this RFC.",
      "ja": "IANAは、このRFCを参照して、「Special-Use Domain Name」レジストリ[RFC6761]に.Alt名を追加しました。"
    },
    {
      "indent": 0,
      "text": "3.2. Domain Name Reservation Considerations",
      "section_title": true,
      "ja": "3.2. ドメイン名の予約に関する考慮事項"
    },
    {
      "indent": 3,
      "text": "This section exists to meet the requirements of [RFC6761]. The questions posed in [RFC6761] were largely written assuming a DNS resolution system, and so some of the questions are not especially relevant or well suited.",
      "ja": "このセクションは、[RFC6761]の要件を満たすために存在します。[RFC6761]で提起された質問は、DNS解像度システムを仮定して主に書かれているため、質問の一部は特に関連性がないか、適切ではありません。"
    },
    {
      "indent": 3,
      "text": "1. Users might or might not recognize that names in the .alt pseudo-TLD as special.",
      "ja": "1. ユーザーは、.alt pseudo-tldの名前を特別なものとして認識している場合と認識している場合があります。"
    },
    {
      "indent": 3,
      "text": "2. Application software that uses alternative namespaces in the .alt pseudo-TLD are expected to have their own processing rules for their own names, probably in specialized resolver APIs, libraries, and/or application software. Application software that is not specifically designed to use names in the .alt pseudo-TLD are not expected to make their software recognize these names as special.",
      "ja": "2. .Alt Pseudo-TLDで代替名空間を使用するアプリケーションソフトウェアは、おそらく専門のローバーAPI、ライブラリ、および/またはアプリケーションソフトウェアで、独自の名前の独自の処理ルールを持つことが期待されます。.Alt Pseudo-TLDで名前を使用するように特別に設計されていないアプリケーションソフトウェアは、ソフトウェアにこれらの名前を特別なものとして認識させることは期待されていません。"
    },
    {
      "indent": 3,
      "text": "3. Developers of name resolution APIs and libraries that are specifically designed to implement resolution of an alternative name resolution system are expected to recognize names in the .alt pseudo-TLD as special and thus perform resolution of those names. The exact mechanism used by the name resolution APIs and libraries will obviously depend on the particular alternative resolution system. Regular DNS resolution APIs and libraries are not expected to recognize or treat names in the .alt pseudo-TLD differently.",
      "ja": "3. 名前解像度APIおよびライブラリの開発者は、代替名解決システムの解像度を実装するように特別に設計されているため、.Alt Pseudo-TLDの名前を特別なものとして認識し、したがってそれらの名前の解決を実行することが期待されます。名前解像度APIとライブラリで使用される正確なメカニズムは、明らかに特定の代替解像度システムに依存します。通常のDNS解像度APIとライブラリは、.Alt Pseudo-TLDの名前を異なる方法で認識または扱うことは期待されていません。"
    },
    {
      "indent": 3,
      "text": "4. Caching DNS servers SHOULD NOT recognize names in the .alt pseudo-TLD as special and SHOULD NOT perform any special handling with them.",
      "ja": "4. キャッシュDNSサーバーは、.Alt Pseudo-TLDの名前を特別なものとして認識してはならず、特別な取り扱いを実行してはなりません。"
    },
    {
      "indent": 3,
      "text": "5. Authoritative DNS servers SHOULD NOT recognize names in the .alt pseudo-TLD as special and SHOULD NOT perform any special handling with them.",
      "ja": "5. 権威あるDNSサーバーは、.Alt Pseudo-TLDの名前を特別なものとして認識してはならず、特別な取り扱いを実行すべきではありません。"
    },
    {
      "indent": 3,
      "text": "6. DNS server operators will treat names in the .alt pseudo-TLD as they would names in any other TLD not in the global DNS. DNS server operators may be aware that queries for names ending in .alt are not DNS names and that queries for those names were leaked into the DNS context. This information can be useful for support or debugging purposes.",
      "ja": "6. DNSサーバーオペレーターは、グローバルDNSではない他のTLDの名前と同様に、.Alt Pseudo-TLDの名前を扱います。DNSサーバーオペレーターは、.altで終わる名前のクエリがDNS名ではなく、それらの名前のクエリがDNSコンテキストにリークされたことを認識している場合があります。この情報は、サポートやデバッグの目的に役立ちます。"
    },
    {
      "indent": 3,
      "text": "7. It is not possible for DNS registries/registrars to register DNS names in the .alt pseudo-TLD as the .alt will not exist in the global DNS root.",
      "ja": "7. DNSレジストリ/レジストラは、.AltがグローバルDNSルートに存在しないため、.Alt Pseudo-TLDにDNS名を登録することはできません。"
    },
    {
      "indent": 0,
      "text": "4. Privacy Considerations",
      "section_title": true,
      "ja": "4. プライバシーに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "This document reserves .alt to be used to indicate that a name is not a DNS name. Unfortunately, these queries will undoubtedly leak into the global DNS. This is a general problem with alternative namespaces and not confined to names ending in .alt.",
      "ja": "このドキュメントは、名前がDNS名ではないことを示すために使用されます。残念ながら、これらのクエリは間違いなくグローバルDNSに漏れます。これは、代替名空間の一般的な問題であり、.Altで終わる名前に限定されません。"
    },
    {
      "indent": 3,
      "text": "For example, a value such as \"example.alt\" could easily cause a privacy issue for any names in that namespace that are leaked to the Internet. In addition, if a name ending in .alt is sufficiently unique, long-lasting, and frequently leaks into the global DNS, then regardless of how the name is constructed, it can act similar to a web cookie with all the associated downsides of identification or re-identification.",
      "ja": "たとえば、「example.alt」などの値は、インターネットにリークされている名前空間の名前のプライバシーの問題を簡単に引き起こす可能性があります。さらに、.Altで終了する名前が十分に一意で、長持ちし、グローバルDNSに頻繁に漏れている場合、名前の構築方法に関係なく、識別のすべての関連する欠点を持つWeb Cookieと同様に作用できます。または再識別。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "Because names in the .alt pseudo-TLD are explicitly outside of the DNS context, it is impossible to rely on any DNS-related security considerations. Care must be taken when mapping the pseudo-TLD into its corresponding non-DNS name resolution system in order to get whatever security is offered by that system.",
      "ja": ".alt擬似-TLDの名前はDNSコンテキストの外側に明示的にあるため、DNS関連のセキュリティに関する考慮事項に依存することは不可能です。そのシステムが提供するセキュリティを取得するために、擬似-TLDを対応する非DNS名解像度システムにマッピングするときは、注意する必要があります。"
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "ja": "6. 参考文献"
    },
    {
      "indent": 0,
      "text": "6.1. Normative References",
      "section_title": true,
      "ja": "6.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <https://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119] Bradner、S。、「要件レベルを示すためにRFCで使用するためのキーワード」、BCP 14、RFC 2119、DOI 10.17487/RFC2119、1997年3月、<https://www.rfc-editor.org/info/RFC2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC6761] Cheshire, S. and M. Krochmal, \"Special-Use Domain Names\", RFC 6761, DOI 10.17487/RFC6761, February 2013, <https://www.rfc-editor.org/info/rfc6761>.",
      "ja": "[RFC6761] Cheshire、S。およびM. Krochmal、「特別使用ドメイン名」、RFC 6761、DOI 10.17487/RFC6761、2013年2月、<https://www.rfc-editor.org/info/rfc6761>。"
    },
    {
      "indent": 3,
      "text": "[RFC8174] Leiba, B., \"Ambiguity of Uppercase vs Lowercase in RFC 2119 Key Words\", BCP 14, RFC 8174, DOI 10.17487/RFC8174, May 2017, <https://www.rfc-editor.org/info/rfc8174>.",
      "ja": "[RFC8174] Leiba、B。、「RFC 2119キーワードの大文字と小文字の曖昧さ」、BCP 14、RFC 8174、DOI 10.17487/RFC8174、2017年5月、<https：//www.rfc-editor.org/info/RFC8174>。"
    },
    {
      "indent": 3,
      "text": "[RFC8244] Lemon, T., Droms, R., and W. Kumari, \"Special-Use Domain Names Problem Statement\", RFC 8244, DOI 10.17487/RFC8244, October 2017, <https://www.rfc-editor.org/info/rfc8244>.",
      "ja": "[RFC8244] Lemon、T.、Droms、R。、およびW. Kumari、「Special-Use Domain Name Problem Statement」、RFC 8244、DOI 10.17487/RFC8244、2017年10月、<https：//www.rfc-editor。org/info/rfc8244>。"
    },
    {
      "indent": 0,
      "text": "6.2. Informative References",
      "section_title": true,
      "ja": "6.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[RFC8198] Fujiwara, K., Kato, A., and W. Kumari, \"Aggressive Use of DNSSEC-Validated Cache\", RFC 8198, DOI 10.17487/RFC8198, July 2017, <https://www.rfc-editor.org/info/rfc8198>.",
      "ja": "[RFC8198] Fujiwara、K.、Kato、A。、およびW. Kumari、「DNSSEC検証キャッシュの積極的な使用」、RFC 8198、DOI 10.17487/RFC8198、2017年7月、<https：//www.rfc-editor。org/info/rfc8198>。"
    },
    {
      "indent": 3,
      "text": "[RFC8499] Hoffman, P., Sullivan, A., and K. Fujiwara, \"DNS Terminology\", BCP 219, RFC 8499, DOI 10.17487/RFC8499, January 2019, <https://www.rfc-editor.org/info/rfc8499>.",
      "ja": "[RFC8499] Hoffman、P.、Sullivan、A。、およびK. Fujiwara、「DNS用語」、BCP 219、RFC 8499、DOI 10.17487/RFC8499、2019年1月、<https://www.rfc-editor.org/情報/RFC8499>。"
    },
    {
      "indent": 3,
      "text": "[RFC9156] Bortzmeyer, S., Dolmans, R., and P. Hoffman, \"DNS Query Name Minimisation to Improve Privacy\", RFC 9156, DOI 10.17487/RFC9156, November 2021, <https://www.rfc-editor.org/info/rfc9156>.",
      "ja": "[RFC9156] Bortzmeyer、S.、Dolmans、R。、およびP. Hoffman、「プライバシーを改善するためのDNSクエリ名の最小化」、RFC 9156、DOI 10.17487/RFC9156、2021年11月、<https：//ww.rfc-editor。org/info/rfc9156>。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "We would like to thank Joe Abley, Mark Andrews, Erik Auerswald, Roy Arends, Ray Bellis, Vittorio Bertola, Marc Blanchet, John Bond, Stphane Bortzmeyer, David Cake, Vint Cerf, David Conrad, Steve Crocker, Vladimir Cunat, Brian Dickson, Ralph Droms, Robert Edmonds, Patrik Fltstrm, Bernd Fix, Christian Grothoff, Olafur Gudmundsson, Ted Hardie, Bob Harold, Wes Hardaker, Geoff Huston, Joel Jaeggli, John C Klensin, Eliot Lear, Barry Leiba, Ted Lemon, Edward Lewis, John Levine, George Michaelson, Ed Pascoe, Libor Peltan, Jim Reid, Martin Schanzenbach, Ben Schwartz, Arturo Servin, Peter Thomassen, Paul Vixie, Duane Wessels, Paul Wouters, and Suzanne Woolf for feedback.",
      "ja": "ジョー・イーブリー、マーク・アンドリュース、エリック・オーアーズヴァルト、ロイ・アレンズ、レイ・ベリス、ヴィッツーリオ・ベルトラ、マーク・ブランシェ、ジョン・ボンド、セントファン・ボルツマイヤー、デビッド・ケーキ、ヴィント・カーフ、デビッド・コンラッド、スティーブ・クロッカー、ウラジミール・クナト、ブライアン・ディックソン、ラルフ・ドロムズ、ロバート・エドモンズ、パトリック・フルトストルム、ベルンド・フィックス、クリスチャン・グロソフ、オラファー・グドムンドソン、テッド・ハーディー、ボブ・ハロルド、ウェス・ハーデイカー、ジェフ・ヒューストン、ジョエル・ジェグリ、ジョン・C・クレンシン、エリオット・リア、バリー・ライバ、テッド・レモン、エドワード・レウイス、ジョンレヴァイン、ジョージ・マイケルソン、エド・パスコー、リボール・ペルタン、ジム・リード、マーティン・シャンゼンバッハ、ベン・シュワルツ、アルトゥーロ・セルヴィン、ピーター・トーマセン、ポール・ビクシー、デュアン・ウェッセル、ポール・ウーターズ、スザンヌ・ウルフのフィードバック。"
    },
    {
      "indent": 3,
      "text": "This document was many years in the making, and we would like to sincerely apologize for anyone whom we forgot to credit.",
      "ja": "この文書は長年にわたって行われてきたので、私たちが信用を忘れた人を心から謝罪したいと思います。"
    },
    {
      "indent": 3,
      "text": "We would also like to thank Rob Wilton for serving as Responsible AD for this document.",
      "ja": "また、このドキュメントの責任ある広告としてRob Wiltonに感謝します。"
    },
    {
      "indent": 3,
      "text": "In addition, Andrew Sullivan was an author from adoption (2015) through version 14 (2021).",
      "ja": "さらに、アンドリュー・サリバンは、養子縁組（2015年）からバージョン14（2021）から著者でした。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Warren Kumari Google 1600 Amphitheatre Parkway Mountain View, CA 94043 United States of America Email: warren@kumari.net",
      "ja": "Warren Kumari Google 1600 Amphitheater Parkway Mountain View、CA 94043アメリカ合衆国電子メール：warren@kumari.net"
    },
    {
      "indent": 3,
      "text": "Paul Hoffman ICANN Email: paul.hoffman@icann.org",
      "ja": "Paul Hoffman Icann Email：paul.hoffman@icann.org"
    }
  ]
}