{
  "title": {
    "text": "RFC 9567 - DNS Error Reporting",
    "ja": "RFC 9567 - DNSエラーレポート"
  },
  "number": 9567,
  "created_at": "2024-04-29 23:24:58.257378+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         R. Arends\nRequest for Comments: 9567                                     M. Larson\nCategory: Standards Track                                          ICANN\nISSN: 2070-1721                                               April 2024",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 26,
      "text": "DNS Error Reporting",
      "title": true,
      "section_title": true,
      "ja": "DNSエラーレポート"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "section_title": true,
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "DNS error reporting is a lightweight reporting mechanism that provides the operator of an authoritative server with reports on DNS resource records that fail to resolve or validate. A domain owner or DNS hosting organization can use these reports to improve domain hosting. The reports are based on extended DNS errors as described in RFC 8914.",
      "ja": "DNSエラーレポートは、解決または検証に失敗したDNSリソースレコードに関するレポートを権威あるサーバーのオペレーターに提供する軽量レポートメカニズムです。ドメイン所有者またはDNSホスティング組織は、これらのレポートを使用してドメインホスティングを改善できます。レポートは、RFC 8914で説明されている拡張DNSエラーに基づいています。"
    },
    {
      "indent": 3,
      "text": "When a domain name fails to resolve or validate due to a misconfiguration or an attack, the operator of the authoritative server may be unaware of this. To mitigate this lack of feedback, this document describes a method for a validating resolver to automatically signal an error to a monitoring agent specified by the authoritative server. The error is encoded in the QNAME; thus, the very act of sending the query is to report the error.",
      "ja": "誤った構成または攻撃のためにドメイン名が解決または検証に失敗した場合、権威あるサーバーのオペレーターはこれを認識していない可能性があります。このフィードバックの欠如を軽減するために、このドキュメントでは、検証型のリゾルバーが権威あるサーバーによって指定された監視エージェントにエラーを自動的に信号する方法について説明します。エラーはQNAMEでエンコードされています。したがって、クエリを送信するまさにその行為は、エラーを報告することです。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "section_title": true,
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準トラックドキュメントです。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 7841.",
      "ja": "このドキュメントは、インターネットエンジニアリングタスクフォース（IETF）の製品です。IETFコミュニティのコンセンサスを表しています。公開レビューを受けており、インターネットエンジニアリングステアリンググループ（IESG）からの出版が承認されています。インターネット標準の詳細については、RFC 7841のセクション2で入手できます。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at https://www.rfc-editor.org/info/rfc9567.",
      "ja": "このドキュメントの現在のステータス、任意のERRATA、およびそのフィードバックを提供する方法に関する情報は、https://www.rfc-editor.org/info/rfc9567で取得できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "section_title": true,
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2024 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（c）2024 IETF Trustおよび文書著者として特定された人。無断転載を禁じます。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (https://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Revised BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Revised BSD License.",
      "ja": "このドキュメントは、BCP 78およびIETFドキュメント（https://trustee.ietf.org/license-info）に関連するIETF Trustの法的規定の対象となります。この文書に関するあなたの権利と制限を説明するので、これらの文書を注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、セクション4.Eで説明されている法的規定のセクション4.Eで説明されており、改訂されたBSDライセンスで説明されている保証なしで提供されるように、改訂されたBSDライセンステキストを含める必要があります。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "section_title": true,
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction\n2.  Requirements Notation\n3.  Terminology\n4.  Overview\n  4.1.  Example\n5.  EDNS0 Option Specification\n6.  DNS Error Reporting Specification\n  6.1.  Reporting Resolver Specification\n    6.1.1.  Constructing the Report Query\n  6.2.  Authoritative Server Specification\n  6.3.  Monitoring Agent Specification\n7.  IANA Considerations\n8.  Operational Considerations\n  8.1.  Choosing an Agent Domain\n  8.2.  Managing Caching Optimizations\n9.  Security Considerations\n10. References\n  10.1.  Normative References\n  10.2.  Informative References\nAcknowledgements\nAuthors' Addresses",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "When an authoritative server serves a stale DNSSEC-signed zone, the cryptographic signatures over the resource record sets (RRsets) may have lapsed. A validating resolver will fail to validate these resource records.",
      "ja": "権威あるサーバーが古いDNSECに署名したゾーンを提供する場合、リソースレコードセット（RRSET）の暗号化署名が失効している可能性があります。検証リゾルバーは、これらのリソースレコードの検証に失敗します。"
    },
    {
      "indent": 3,
      "text": "Similarly, when there is a mismatch between the Delegation Signer (DS) records at a parent zone and the key signing key at the child zone, a validating resolver will fail to authenticate records in the child zone.",
      "ja": "同様に、親ゾーンでの代表団の署名者（DS）レコードとチャイルドゾーンでのキー署名キーの間に不一致がある場合、検証済みのリゾルバーはチャイルドゾーンでレコードを認証できません。"
    },
    {
      "indent": 3,
      "text": "These are two of several failure scenarios that may go unnoticed for some time by the operator of a zone.",
      "ja": "これらは、ゾーンのオペレーターによってしばらく見過ごされる可能性のあるいくつかの障害シナリオのうちの2つです。"
    },
    {
      "indent": 3,
      "text": "Today, there is no direct relationship between operators of validating resolvers and authoritative servers. Outages are often noticed indirectly by end users and reported via email or social media (if reported at all).",
      "ja": "今日、リゾルバーを検証するオペレーターと権威あるサーバーの間に直接的な関係はありません。多くの場合、停止はエンドユーザーによって間接的に気づかれ、電子メールまたはソーシャルメディアを介して報告されます（まったく報告されている場合）。"
    },
    {
      "indent": 3,
      "text": "When records fail to validate, there is no facility to report this failure in an automated way. If there is any indication that an error or warning has happened, it may be buried in log files of the resolver or not logged at all.",
      "ja": "レコードが検証に失敗した場合、この障害を自動化した方法で報告する施設はありません。エラーまたは警告が発生していることを示すものがある場合、リゾルバーのログファイルに埋め込まれるか、まったく記録されていない可能性があります。"
    },
    {
      "indent": 3,
      "text": "This document describes a method that can be used by validating resolvers to report DNSSEC validation errors in an automated way.",
      "ja": "このドキュメントでは、リゾルバーを検証してDNSSEC検証エラーを自動化された方法で報告することで使用できる方法について説明します。"
    },
    {
      "indent": 3,
      "text": "It allows an authoritative server to announce a monitoring agent to which validating resolvers can report issues if those resolvers are configured to do so.",
      "ja": "これにより、権威あるサーバーは、それらのリゾルバーがそうするように構成されている場合、検証型のリゾルバーが問題を報告できる監視エージェントを発表することができます。"
    },
    {
      "indent": 3,
      "text": "The burden to report a failure falls on the validating resolver. It is important that the effort needed to report failure is low, with minimal impact to its main functions. To accomplish this goal, the DNS itself is utilized to report the error.",
      "ja": "失敗を報告する負担は、検証済みのリゾルバーにあります。障害を報告するために必要な努力が低いことが重要であり、その主な機能には最小限の影響を与えています。この目標を達成するために、DNS自体がエラーを報告するために利用されます。"
    },
    {
      "indent": 0,
      "text": "2. Requirements Notation",
      "section_title": true,
      "ja": "2. 要件表記"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14 [RFC2119] [RFC8174] when, and only when, they appear in all capitals, as shown here.",
      "ja": "「必須」、「必要」、「必須」、「shall」、「shall」、「suff」、 \"not\"、 \"becommended\"、 \"becommented\"、 \"may\"、 \"optional「このドキュメントでは、BCP 14 [RFC2119] [RFC8174]で説明されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "3. Terminology",
      "section_title": true,
      "ja": "3. 用語"
    },
    {
      "indent": 3,
      "text": "This document uses DNS terminology defined in BCP 219 [RFC9499]. This document also defines and uses the following terms:",
      "ja": "このドキュメントでは、BCP 219 [RFC9499]で定義されたDNS用語を使用しています。このドキュメントは、次の用語も定義および使用します。"
    },
    {
      "indent": 3,
      "text": "Reporting resolver:",
      "ja": "レポートリゾルバー："
    },
    {
      "indent": 12,
      "text": "A validating resolver that supports DNS error reporting.",
      "ja": "DNSエラーレポートをサポートする検証リゾルバー。"
    },
    {
      "indent": 3,
      "text": "Report query:",
      "ja": "レポートクエリ："
    },
    {
      "indent": 12,
      "text": "The DNS query used to report an error. A report query is for a DNS TXT resource record type. The content of the error report is encoded in the QNAME of a DNS request to the monitoring agent.",
      "ja": "エラーの報告に使用されるDNSクエリ。レポートクエリは、DNS TXTリソースレコードタイプのものです。エラーレポートの内容は、監視エージェントへのDNSリクエストのQNAMEにエンコードされます。"
    },
    {
      "indent": 3,
      "text": "Monitoring agent:",
      "ja": "監視エージェント："
    },
    {
      "indent": 12,
      "text": "An authoritative server that receives and responds to report queries. This facility is indicated by a domain name, referred to as the \"agent domain\".",
      "ja": "クエリのレポートに受信して応答する権威あるサーバー。この機能は、「エージェントドメイン」と呼ばれるドメイン名で示されています。"
    },
    {
      "indent": 3,
      "text": "Agent domain:",
      "ja": "エージェントドメイン："
    },
    {
      "indent": 12,
      "text": "A domain name that is returned in the EDNS0 Report-Channel option and indicates where DNS resolvers can send error reports.",
      "ja": "EDNS0レポートチャネルオプションで返され、DNSリゾルバーがエラーレポートを送信できる場所を示します。"
    },
    {
      "indent": 0,
      "text": "4. Overview",
      "section_title": true,
      "ja": "4. 概要"
    },
    {
      "indent": 3,
      "text": "An authoritative server indicates support for DNS error reporting by including an EDNS0 Report-Channel option with OPTION-CODE 18 and the agent domain in the response. The agent domain is a fully qualified, uncompressed domain name in DNS wire format. The authoritative server MUST NOT include this option in the response if the configured agent domain is empty or is the null label (which would indicate the DNS root).",
      "ja": "権威あるサーバーは、Option-Code 18と応答にエージェントドメインを含むEDNS0レポートチャネルオプションを含めることにより、DNSエラーレポートのサポートを示します。エージェントドメインは、DNSワイヤ形式の完全に適格で非圧縮ドメイン名です。構成されたエージェントドメインが空であるか、nullラベル（DNSルートを示す）である場合、権威あるサーバーは応答にこのオプションを含めてはなりません。"
    },
    {
      "indent": 3,
      "text": "The authoritative server includes the EDNS0 Report-Channel option unsolicited. That is, the option is included in a response despite the EDNS0 Report-Channel option being absent in the request.",
      "ja": "権威あるサーバーには、EDNS0レポートチャネルオプションがunloclitedを含みます。つまり、EDNS0レポートチャネルオプションがリクエストに存在しないにもかかわらず、オプションは応答に含まれています。"
    },
    {
      "indent": 3,
      "text": "If the authoritative server has indicated support for DNS error reporting and there is an issue that can be reported via extended DNS errors, the reporting resolver encodes the error report in the QNAME of the report query. The reporting resolver builds this QNAME by concatenating the \"_er\" label, the QTYPE, the QNAME that resulted in failure, the extended DNS error code (as described in [RFC8914]), the label \"_er\" again, and the agent domain. See the example in Section 4.1 and the specification in Section 6.1.1. Note that a regular RCODE is not included because the RCODE is not relevant to the extended DNS error code.",
      "ja": "権威あるサーバーがDNSエラーレポートのサポートを示しており、拡張されたDNSエラーを介して報告できる問題がある場合、レポートリゾルバーはレポートクエリのQNAMEのエラーレポートをエンコードします。レポートリゾルバーは、「_er」ラベル、qtype、障害をもたらしたqname、拡張DNSエラーコード（[rfc8914]で説明されている）、ラベル「_ er」、およびエージェントドメインを連結することにより、このqNameを構築します。セクション4.1の例とセクション6.1.1の仕様を参照してください。rcodeは拡張DNSエラーコードに関連していないため、通常のRcodeは含まれていません。"
    },
    {
      "indent": 3,
      "text": "The resulting report query is sent as a standard DNS query for a TXT DNS resource record type by the reporting resolver.",
      "ja": "結果のレポートクエリは、レポートリゾルバーによってTXT DNSリソースレコードタイプの標準DNSクエリとして送信されます。"
    },
    {
      "indent": 3,
      "text": "The report query will ultimately arrive at the monitoring agent. A response is returned by the monitoring agent, which in turn can be cached by the reporting resolver. This caching is essential. It dampens the number of report queries sent by a reporting resolver for the same problem (that is, with caching, one report query per TTL is sent). However, certain optimizations, such as those described in [RFC8020] and [RFC8198], may reduce the number of error report queries as well.",
      "ja": "レポートクエリは、最終的に監視エージェントに到着します。監視エージェントによって応答が返され、レポートリゾルバーがキャッシュできます。このキャッシングは不可欠です。同じ問題についてレポートリゾルバーによって送信されたレポートクエリの数を減衰させます（つまり、キャッシュすると、TTLごとに1つのレポートクエリが送信されます）。ただし、[RFC8020]や[RFC8198]に記載されているような特定の最適化は、エラーレポートクエリの数も減らす可能性があります。"
    },
    {
      "indent": 3,
      "text": "This document gives no guidance on the content of the RDATA in the TXT resource record.",
      "ja": "このドキュメントは、TXTリソースレコードのRDATAのコンテンツに関するガイダンスを提供しません。"
    },
    {
      "indent": 0,
      "text": "4.1. Example",
      "section_title": true,
      "ja": "4.1. 例"
    },
    {
      "indent": 3,
      "text": "A query for \"broken.test.\", type A, is sent by a reporting resolver.",
      "ja": "「broken.test。」のクエリ、タイプAは、レポートリゾルバーによって送信されます。"
    },
    {
      "indent": 3,
      "text": "The domain \"test.\" is hosted on a set of authoritative servers. One of these authoritative servers serves a stale version of the \"test.\" zone. This authoritative server has an agent domain configured as \"a01.agent-domain.example.\".",
      "ja": "ドメイン「テスト」。権威あるサーバーのセットでホストされています。これらの権威あるサーバーの1つは、「テスト」の古いバージョンを提供します。ゾーン。この権威あるサーバーには、「a01.agent-domain.example」として構成されたエージェントドメインがあります。"
    },
    {
      "indent": 3,
      "text": "The authoritative server with the stale \"test.\" zone receives the request for \"broken.test.\". It returns a response that includes the EDNS0 Report-Channel option with the domain name \"a01.agent-domain.example.\".",
      "ja": "古い「テスト」を備えた権威あるサーバー。ゾーンは「broken.test」のリクエストを受け取ります。ドメイン名「a01.agent-domain.example」を含むEDNS0レポートチャネルオプションを含む応答を返します。"
    },
    {
      "indent": 3,
      "text": "The reporting resolver is unable to validate the \"broken.test.\" RRset for type A (an RR type with value 1), due to an RRSIG record with an expired signature.",
      "ja": "レポートリゾルバーでは、「broken.test」を検証できません。期限切れの署名を持つRRSIGレコードのため、タイプA（値1のRRタイプ）のRRSET。"
    },
    {
      "indent": 3,
      "text": "The reporting resolver constructs the QNAME \"_er.1.broken.test.7._er.a01.agent-domain.example.\" and resolves it. This QNAME indicates extended DNS error 7 occurred while trying to validate \"broken.test.\" for a type A (an RR type with value 1) record.",
      "ja": "レポートリゾルバーは、QName \"_er.1.broken.test.7._er.a01.agent-domain.exampleを構築します。\"そしてそれを解決します。このQNameは、「broken.test」の検証を試みたときに拡張されたDNSエラー7が発生したことを示します。タイプA（値1のRRタイプ）レコードの場合。"
    },
    {
      "indent": 3,
      "text": "When this query is received at the monitoring agent (the operators of the authoritative server for \"a01.agent-domain.example.\"), the agent can determine the \"test.\" zone contained an expired signature record (extended DNS error 7) for type A for the domain name \"broken.test.\". The monitoring agent can contact the operators of \"test.\" to fix the issue.",
      "ja": "このクエリが監視エージェント（「a01.agent-domain.example。」の権威あるサーバーの演算子）で受信されると、エージェントは「テスト」を決定できます。ゾーンには、ドメイン名「broken.test」のタイプAの有効期限切れの署名レコード（拡張DNSエラー7）が含まれていました。監視エージェントは、「テスト」のオペレーターに連絡できます。問題を修正します。"
    },
    {
      "indent": 0,
      "text": "5. EDNS0 Option Specification",
      "section_title": true,
      "ja": "5. EDNS0オプション仕様"
    },
    {
      "indent": 3,
      "text": "This method uses an EDNS0 [RFC6891] option to indicate the agent domain in DNS responses. The option is structured as follows:",
      "ja": "この方法では、EDNS0 [RFC6891]オプションを使用して、DNS応答でエージェントドメインを示します。オプションは次のように構成されています。"
    },
    {
      "indent": 3,
      "text": "                     1 1 1 1 1 1 1 1 1 1 2 2 2 2 2 2 2 2 2 2 3 3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|        OPTION-CODE = 18       |       OPTION-LENGTH           |\n+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+\n/                         AGENT DOMAIN                          /\n+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Field definition details:",
      "ja": "フィールド定義の詳細："
    },
    {
      "indent": 3,
      "text": "OPTION-CODE:",
      "ja": "オプションコード："
    },
    {
      "indent": 12,
      "text": "2 octets; an EDNS0 code that is used in an EDNS0 option to indicate support for error reporting. The name for this EDNS0 option code is Report-Channel.",
      "ja": "2オクテット;EDNS0オプションで使用されるEDNS0コードは、エラーレポートのサポートを示しています。このEDNS0オプションコードの名前はレポートチャネルです。"
    },
    {
      "indent": 3,
      "text": "OPTION-LENGTH:",
      "ja": "オプション長："
    },
    {
      "indent": 12,
      "text": "2 octets; contains the length of the AGENT DOMAIN field in octets.",
      "ja": "2オクテット;オクテットのエージェントドメインフィールドの長さが含まれています。"
    },
    {
      "indent": 3,
      "text": "AGENT DOMAIN:",
      "ja": "エージェントドメイン："
    },
    {
      "indent": 12,
      "text": "A fully qualified domain name [RFC9499] in uncompressed DNS wire format.",
      "ja": "非圧縮DNSワイヤ形式の完全資格のドメイン名[RFC9499]。"
    },
    {
      "indent": 0,
      "text": "6. DNS Error Reporting Specification",
      "section_title": true,
      "ja": "6. DNSエラー報告仕様"
    },
    {
      "indent": 3,
      "text": "The various errors that a reporting resolver may encounter are listed in [RFC8914]. Note that not all listed errors may be supported by the reporting resolver. This document does not specify what is or is not an error.",
      "ja": "レポートリゾルバーが遭遇する可能性のあるさまざまなエラーは、[RFC8914]にリストされています。すべてのリストされたエラーがレポートリゾルバーによってサポートされるわけではないことに注意してください。このドキュメントでは、エラーとは何かを指定していません。"
    },
    {
      "indent": 3,
      "text": "The DNS class is not specified in the error report.",
      "ja": "DNSクラスは、エラーレポートでは指定されていません。"
    },
    {
      "indent": 0,
      "text": "6.1. Reporting Resolver Specification",
      "section_title": true,
      "ja": "6.1. レポートリゾルバー仕様"
    },
    {
      "indent": 3,
      "text": "Care should be taken when additional DNS resolution is needed to resolve the QNAME that contains the error report. This resolution itself could trigger another error report to be created. A maximum expense or depth limit MUST be used to prevent cascading errors.",
      "ja": "エラーレポートを含むQNAMEを解決するために追加のDNS解像度が必要な場合は、注意する必要があります。この解像度自体は、別のエラーレポートを作成する可能性があります。カスケードエラーを防ぐために、最大費用または深度制限を使用する必要があります。"
    },
    {
      "indent": 3,
      "text": "The EDNS0 Report-Channel option MUST NOT be included in queries.",
      "ja": "EDNS0レポートチャネルオプションをクエリに含めてはなりません。"
    },
    {
      "indent": 3,
      "text": "The reporting resolver MUST NOT use DNS error reporting if the authoritative server returned an empty AGENT DOMAIN field in the EDNS0 Report-Channel option.",
      "ja": "Reporting Resolverは、権威あるサーバーがEDNS0レポートチャネルオプションで空のエージェントドメインフィールドを返した場合、DNSエラーレポートを使用してはなりません。"
    },
    {
      "indent": 3,
      "text": "For the monitoring agent to gain more confidence that the report is not spoofed, the reporting resolver SHOULD send error reports over TCP [RFC7766] or other connection-oriented protocols or SHOULD use DNS Cookies [RFC7873]. This makes it harder to falsify the source address.",
      "ja": "監視エージェントがレポートがスプーフィングされていないというより多くの自信を得るために、レポートリゾルバーはTCP [RFC7766]または他の接続指向のプロトコルを介してエラーレポートを送信するか、DNS Cookie [RFC7873]を使用する必要があります。これにより、ソースアドレスを偽造することが難しくなります。"
    },
    {
      "indent": 3,
      "text": "A reporting resolver MUST validate responses received from the monitoring agent. There is no special treatment for responses to error-reporting queries. Section 9 (\"Security Considerations\") contains the rationale behind this.",
      "ja": "レポートリゾルバーは、監視エージェントから受信した回答を検証する必要があります。エラー報告クエリに対する応答に対する特別な治療はありません。セクション9（「セキュリティ上の考慮事項」）には、この背後にある根拠が含まれています。"
    },
    {
      "indent": 0,
      "text": "6.1.1. Constructing the Report Query",
      "section_title": true,
      "ja": "6.1.1. レポートクエリの構築"
    },
    {
      "indent": 3,
      "text": "The QNAME for the report query is constructed by concatenating the following elements:",
      "ja": "レポートクエリのQNameは、次の要素を連結することによって構築されます。"
    },
    {
      "indent": 6,
      "text": "* A label containing the string \"_er\".",
      "ja": "* 文字列「_er」を含むラベル。"
    },
    {
      "indent": 6,
      "text": "* The QTYPE that was used in the query that resulted in the extended DNS error, presented as a decimal value, in a single DNS label. If additional QTYPEs were present in the query, such as described in [MULTI-QTYPES], they are represented as unique, ordered decimal values separated by a hyphen. As an example, if both QTYPE A and AAAA were present in the query, they are presented as the label \"1-28\".",
      "ja": "* 単一のDNSラベルで、10進値として表示される拡張DNSエラーをもたらしたクエリで使用されたQTYPE。[Multi-QTypes]に記載されているようなクエリに追加のQTypesが存在する場合、それらはハイフンによって区切られた一意の順序付けられた小数値として表されます。例として、QType AとAAAAの両方がクエリに存在する場合、それらはラベル「1-28」として提示されます。"
    },
    {
      "indent": 6,
      "text": "* The list of non-null labels representing the query name that is the subject of the DNS error report.",
      "ja": "* DNSエラーレポートの主題であるクエリ名を表す非ヌルラベルのリスト。"
    },
    {
      "indent": 6,
      "text": "* The extended DNS error code, presented as a decimal value, in a single DNS label.",
      "ja": "* 単一のDNSラベルで小数点として表示される拡張DNSエラーコード。"
    },
    {
      "indent": 6,
      "text": "* A label containing the string \"_er\".",
      "ja": "* 文字列「_er」を含むラベル。"
    },
    {
      "indent": 6,
      "text": "* The agent domain. The agent domain as received in the EDNS0 Report-Channel option set by the authoritative server.",
      "ja": "* エージェントドメイン。権威あるサーバーによって設定されたEDNS0レポートチャネルオプションで受信されたエージェントドメイン。"
    },
    {
      "indent": 3,
      "text": "If the QNAME of the report query exceeds 255 octets, it MUST NOT be sent.",
      "ja": "レポートクエリのQNameが255オクテットを超える場合、送信してはなりません。"
    },
    {
      "indent": 3,
      "text": "The \"_er\" labels allow the monitoring agent to differentiate between the agent domain and the faulty query name. When the specified agent domain is empty, or is a null label (despite being not allowed in this specification), the report query will have \"_er\" as a top-level domain, and not the top-level domain from the query name that was the subject of this error report. The purpose of the first \"_er\" label is to indicate that a complete report query has been received instead of a shorter report query due to query minimization.",
      "ja": "「_er」ラベルにより、監視エージェントはエージェントドメインと故障したクエリ名を区別できます。指定されたエージェントドメインが空の場合、またはnullラベルである場合（この仕様では許可されていないにもかかわらず）、レポートクエリにはトップレベルのドメインとして「_er」があり、クエリ名のトップレベルドメインではなく、このエラーレポートの対象でした。最初の「_er」ラベルの目的は、クエリの最小化により、より短いレポートクエリの代わりに完全なレポートクエリが受信されたことを示すことです。"
    },
    {
      "indent": 0,
      "text": "6.2. Authoritative Server Specification",
      "section_title": true,
      "ja": "6.2. 権威あるサーバー仕様"
    },
    {
      "indent": 3,
      "text": "The authoritative server MUST NOT include more than one EDNS0 Report-Channel option in a response.",
      "ja": "権威あるサーバーは、応答に複数のEDNS0レポートチャネルオプションを含めることはできません。"
    },
    {
      "indent": 3,
      "text": "The authoritative server includes the EDNS0 Report-Channel option unsolicited in responses. There is no requirement that the EDNS0 Report-Channel option be present in queries.",
      "ja": "権威あるサーバーには、回答が承認されていないEDNS0レポートチャネルオプションが含まれています。EDNS0レポートチャネルオプションがクエリに存在するという要件はありません。"
    },
    {
      "indent": 0,
      "text": "6.3. Monitoring Agent Specification",
      "section_title": true,
      "ja": "6.3. 監視エージェント仕様"
    },
    {
      "indent": 3,
      "text": "It is RECOMMENDED that the authoritative server for the agent domain reply with a positive response (i.e., not with NODATA or NXDOMAIN) containing a TXT record.",
      "ja": "TXTレコードを含む肯定的な応答（つまり、nodataまたはnxdomainではなく）を使用して、エージェントドメインの権威あるサーバーを応答することをお勧めします。"
    },
    {
      "indent": 3,
      "text": "The monitoring agent SHOULD respond to queries received over UDP that have no DNS Cookie set with a response that has the truncation bit (TC bit) set to challenge the resolver to requery over TCP.",
      "ja": "監視エージェントは、DNS CookieセットがないUDPを介して受信したクエリに応答する必要があります。TCPを介してリクリーにリゾルバーに挑戦するように設定された回答（TCビット）が設定されています。"
    },
    {
      "indent": 0,
      "text": "7. IANA Considerations",
      "section_title": true,
      "ja": "7. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has assigned the following in the \"DNS EDNS0 Option Codes (OPT)\" registry:",
      "ja": "IANAは、「DNS EDNS0オプションコード（OPT）」レジストリで以下を割り当てました。"
    },
    {
      "indent": 10,
      "text": "          +=======+================+==========+===========+\n          | Value | Name           | Status   | Reference |\n          +=======+================+==========+===========+\n          | 18    | Report-Channel | Standard | RFC 9567  |\n          +-------+----------------+----------+-----------+\n\n                               Table 1",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "IANA has assigned the following in the \"Underscored and Globally Scoped DNS Node Names\" registry:",
      "ja": "IANAは、「Undercored and Global Scoped DNSノード名」レジストリで以下を割り当てました。"
    },
    {
      "indent": 16,
      "text": "                +=========+============+===========+\n                | RR Type | _NODE NAME | Reference |\n                +=========+============+===========+\n                | TXT     | _er        | RFC 9567  |\n                +---------+------------+-----------+\n\n                              Table 2",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "8. Operational Considerations",
      "section_title": true,
      "ja": "8. 運用上の考慮事項"
    },
    {
      "indent": 0,
      "text": "8.1. Choosing an Agent Domain",
      "section_title": true,
      "ja": "8.1. エージェントドメインの選択"
    },
    {
      "indent": 3,
      "text": "It is RECOMMENDED that the agent domain be kept relatively short to allow for a longer QNAME in the report query. The agent domain MUST NOT be a subdomain of the domain it is reporting on. That is, if the authoritative server hosts the foo.example domain, then its agent domain MUST NOT end in foo.example.",
      "ja": "レポートクエリでより長いQNameを許可するために、エージェントドメインを比較的短く保つことをお勧めします。エージェントドメインは、報告しているドメインのサブドメインである必要があります。つまり、権威あるサーバーがfoo.exampleドメインをホストしている場合、そのエージェントドメインはfoo.exampleで終了してはなりません。"
    },
    {
      "indent": 0,
      "text": "8.2. Managing Caching Optimizations",
      "section_title": true,
      "ja": "8.2. キャッシュの最適化の管理"
    },
    {
      "indent": 3,
      "text": "The reporting resolver may utilize various caching optimizations that inhibit subsequent error reporting to the same monitoring agent.",
      "ja": "レポートリゾルバーは、同じ監視エージェントへの後続のエラー報告を阻害するさまざまなキャッシング最適化を利用する場合があります。"
    },
    {
      "indent": 3,
      "text": "If the monitoring agent were to respond with NXDOMAIN (name error), [RFC8020] states that any name at or below that domain should be considered unreachable, and negative caching would prohibit subsequent queries for anything at or below that domain for a period of time, depending on the negative TTL [RFC2308].",
      "ja": "監視エージェントがNXDomain（名前エラー）で応答する場合、[RFC8020]は、そのドメイン以下の名前は到達不能と見なされるべきであり、負のキャッシュはそのドメイン以下の後続のクエリを一定期間禁止すると述べています。、負のTTL [RFC2308]に依存します。"
    },
    {
      "indent": 3,
      "text": "Since the monitoring agent may not know the contents of all the zones for which it acts as a monitoring agent, the monitoring agent MUST NOT respond with NXDOMAIN for domains it is monitoring because that could inhibit subsequent queries. One method to avoid NXDOMAIN is to use a wildcard domain name [RFC4592] in the zone for the agent domain.",
      "ja": "監視エージェントは、監視剤として機能するすべてのゾーンの内容を知らない可能性があるため、監視剤は、後続のクエリを阻害できるため、監視でNXDomainで応答してはなりません。NxDomainを回避する1つの方法は、エージェントドメインのゾーンでWildCardドメイン名[RFC4592]を使用することです。"
    },
    {
      "indent": 3,
      "text": "When the agent domain is signed, a resolver may use aggressive negative caching (described in [RFC8198]). This optimization makes use of NSEC and NSEC3 (without opt-out) records and allows the resolver to do the wildcard synthesis. When this happens, the resolver does not send subsequent queries because it will be able to synthesize a response from previously cached material.",
      "ja": "エージェントドメインに署名された場合、リゾルバーは積極的なネガティブキャッシュを使用する場合があります（[RFC8198]で説明）。この最適化により、NSECおよびNSEC3（オプトアウトなし）レコードが使用され、リゾルバーがワイルドカード合成を行うことができます。これが起こると、リゾルバーは以前にキャッシュされた素材からの応答を合成できるため、後続のクエリを送信しません。"
    },
    {
      "indent": 3,
      "text": "A solution is to avoid DNSSEC for the agent domain. Signing the agent domain will incur an additional burden on the reporting resolver, as it has to validate the response. However, this response has no utility to the reporting resolver other than dampening the query load for error reports.",
      "ja": "解決策は、エージェントドメインのDNSSECを回避することです。エージェントドメインに署名すると、応答を検証する必要があるため、レポートリゾルバーに追加の負担が発生します。ただし、この応答には、エラーレポートのクエリ負荷を減衰させる以外に、レポートリゾルバーのユーティリティはありません。"
    },
    {
      "indent": 0,
      "text": "9. Security Considerations",
      "section_title": true,
      "ja": "9. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "Use of DNS error reporting may expose local configuration mistakes in the reporting resolver, such as stale DNSSEC trust anchors, to the monitoring agent.",
      "ja": "DNSエラーレポートの使用により、描かれたDNSSECトラストアンカーなどのレポートリゾルバーのローカル構成ミスが監視エージェントに公開される場合があります。"
    },
    {
      "indent": 3,
      "text": "DNS error reporting SHOULD be done using DNS query name minimization [RFC9156] to improve privacy.",
      "ja": "DNSエラーレポートは、DNSクエリ名の最小化[RFC9156]を使用してプライバシーを改善する必要があります。"
    },
    {
      "indent": 3,
      "text": "DNS error reporting is done without any authentication between the reporting resolver and the authoritative server of the agent domain.",
      "ja": "DNSエラーレポートは、レポートリゾルバーとエージェントドメインの信頼できるサーバーの間に認証なしで実行されます。"
    },
    {
      "indent": 3,
      "text": "Resolvers that send error reports SHOULD send them over TCP [RFC7766] or SHOULD use DNS Cookies [RFC7873]. This makes it hard to falsify the source address. The monitoring agent SHOULD respond to queries received over UDP that have no DNS Cookie set with a response that has the truncation bit (TC bit) set to challenge the resolver to requery over TCP.",
      "ja": "エラーレポートを送信するリゾルバーは、TCP [RFC7766]を介してそれらを送信するか、DNS Cookie [RFC7873]を使用する必要があります。これにより、ソースアドレスを偽造することが難しくなります。監視エージェントは、DNS CookieセットがないUDPを介して受信したクエリに応答する必要があります。TCPを介してリクリーにリゾルバーに挑戦するように設定された回答（TCビット）が設定されています。"
    },
    {
      "indent": 3,
      "text": "Well-known addresses of reporting resolvers can provide a higher level of confidence in the error reports and potentially enable more automated processing of these reports.",
      "ja": "レポートリゾルバーのよく知られたアドレスは、エラーレポートにより高いレベルの信頼性を提供し、これらのレポートのより自動化された処理を可能にする可能性があります。"
    },
    {
      "indent": 3,
      "text": "Monitoring agents that receive error reports over UDP should consider that the source of the reports and the reports themselves may be false.",
      "ja": "UDPを介してエラーレポートを受け取る監視エージェントは、レポートとレポート自体のソースが虚偽である可能性があることを考慮する必要があります。"
    },
    {
      "indent": 3,
      "text": "The method described in this document will cause additional queries by the reporting resolver to authoritative servers in order to resolve the report query.",
      "ja": "このドキュメントで説明されている方法は、レポートクエリを解決するために、信頼できるサーバーへのレポートリゾルバーによる追加のクエリを引き起こします。"
    },
    {
      "indent": 3,
      "text": "This method can be abused by intentionally deploying broken zones with agent domains that are delegated to victims. This is particularly effective when DNS requests that trigger error messages are sent through open resolvers [RFC9499] or widely distributed network monitoring systems that perform distributed queries from around the globe.",
      "ja": "この方法は、被害者に委任されたエージェントドメインを使用して壊れたゾーンを意図的に展開することにより、乱用することができます。これは、DNSがトリガーエラーメッセージがオープンリゾルバー[RFC9499]または世界中から分散クエリを実行する広く分散したネットワーク監視システムを介して送信されることを要求する場合に特に効果的です。"
    },
    {
      "indent": 3,
      "text": "An adversary may create massive error report flooding to camouflage an attack.",
      "ja": "敵は、攻撃をカモフラージュするために大規模なエラーレポートの洪水を引き起こす可能性があります。"
    },
    {
      "indent": 3,
      "text": "Though this document gives no guidance on the content of the RDATA in the TXT resource record, if the RDATA content is logged, the monitoring agent MUST assume the content can be malicious and take appropriate measures to avoid exploitation. One such method could be to log in hexadecimal. This would avoid remote code execution through logging string attacks, such as the vulnerability described in [CVE-2021-44228].",
      "ja": "このドキュメントは、TXTリソースレコードのRDATAのコンテンツに関するガイダンスを提供しませんが、RDATAコンテンツが記録されている場合、監視エージェントは、搾取を避けるためにコンテンツが悪意を持ち、適切な対策を講じることができると仮定する必要があります。そのような方法の1つは、16進数にログインすることです。これにより、[CVE-2021-44228]に記載されている脆弱性など、ロギング文字列攻撃を介してリモートコードの実行が回避されます。"
    },
    {
      "indent": 3,
      "text": "The rationale behind mandating DNSSEC validation for responses from a reporting agent, even if the agent domain is proposed to remain unsigned, is to mitigate the risk of a downgrade attack orchestrated by adversaries. In such an attack, a victim's legitimately signed domain could be deceptively advertised as an agent domain by malicious actors. Consequently, if the validating resolver treats it as unsigned, it is exposed to potential cache poisoning attacks. By enforcing DNSSEC validation, this vulnerability is preemptively addressed.",
      "ja": "報告エージェントからの応答のDNSSEC検証の義務的根拠は、たとえエージェントドメインが署名されたままであると提案されている場合でも、敵によって倒れた攻撃のリスクを軽減することです。このような攻撃では、被害者の合法的に署名されたドメインは、悪意のある俳優によってエージェントドメインとして誤って宣伝される可能性があります。その結果、検証型のリゾルバーがそれを署名していないと扱う場合、潜在的なキャッシュ中毒攻撃にさらされます。DNSSEC検証を実施することにより、この脆弱性は先制的に対処されます。"
    },
    {
      "indent": 0,
      "text": "10. References",
      "section_title": true,
      "ja": "10. 参考文献"
    },
    {
      "indent": 0,
      "text": "10.1. Normative References",
      "section_title": true,
      "ja": "10.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC2119]  Bradner, S., \"Key words for use in RFCs to Indicate\n           Requirement Levels\", BCP 14, RFC 2119,\n           DOI 10.17487/RFC2119, March 1997,\n           <https://www.rfc-editor.org/info/rfc2119>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC8174]  Leiba, B., \"Ambiguity of Uppercase vs Lowercase in RFC\n           2119 Key Words\", BCP 14, RFC 8174, DOI 10.17487/RFC8174,\n           May 2017, <https://www.rfc-editor.org/info/rfc8174>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "10.2. Informative References",
      "section_title": true,
      "ja": "10.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[CVE-2021-44228]\n           CVE, \"CVE-2021-44228\", 26 November 2021,\n           <https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-\n           2021-44228>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[MULTI-QTYPES]\n           Bellis, R., \"DNS Multiple QTYPEs\", Work in Progress,\n           Internet-Draft, draft-ietf-dnssd-multi-qtypes-00, 4\n           December 2023, <https://datatracker.ietf.org/doc/html/\n           draft-ietf-dnssd-multi-qtypes-00>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC2308]  Andrews, M., \"Negative Caching of DNS Queries (DNS\n           NCACHE)\", RFC 2308, DOI 10.17487/RFC2308, March 1998,\n           <https://www.rfc-editor.org/info/rfc2308>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC4592]  Lewis, E., \"The Role of Wildcards in the Domain Name\n           System\", RFC 4592, DOI 10.17487/RFC4592, July 2006,\n           <https://www.rfc-editor.org/info/rfc4592>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC6891]  Damas, J., Graff, M., and P. Vixie, \"Extension Mechanisms\n           for DNS (EDNS(0))\", STD 75, RFC 6891,\n           DOI 10.17487/RFC6891, April 2013,\n           <https://www.rfc-editor.org/info/rfc6891>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC7766]  Dickinson, J., Dickinson, S., Bellis, R., Mankin, A., and\n           D. Wessels, \"DNS Transport over TCP - Implementation\n           Requirements\", RFC 7766, DOI 10.17487/RFC7766, March 2016,\n           <https://www.rfc-editor.org/info/rfc7766>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC7873]  Eastlake 3rd, D. and M. Andrews, \"Domain Name System (DNS)\n           Cookies\", RFC 7873, DOI 10.17487/RFC7873, May 2016,\n           <https://www.rfc-editor.org/info/rfc7873>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC8020]  Bortzmeyer, S. and S. Huque, \"NXDOMAIN: There Really Is\n           Nothing Underneath\", RFC 8020, DOI 10.17487/RFC8020,\n           November 2016, <https://www.rfc-editor.org/info/rfc8020>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC8198]  Fujiwara, K., Kato, A., and W. Kumari, \"Aggressive Use of\n           DNSSEC-Validated Cache\", RFC 8198, DOI 10.17487/RFC8198,\n           July 2017, <https://www.rfc-editor.org/info/rfc8198>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC8914]  Kumari, W., Hunt, E., Arends, R., Hardaker, W., and D.\n           Lawrence, \"Extended DNS Errors\", RFC 8914,\n           DOI 10.17487/RFC8914, October 2020,\n           <https://www.rfc-editor.org/info/rfc8914>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC9156]  Bortzmeyer, S., Dolmans, R., and P. Hoffman, \"DNS Query\n           Name Minimisation to Improve Privacy\", RFC 9156,\n           DOI 10.17487/RFC9156, November 2021,\n           <https://www.rfc-editor.org/info/rfc9156>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC9499]  Hoffman, P. and K. Fujiwara, \"DNS Terminology\", BCP 219,\n           RFC 9499, DOI 10.17487/RFC9499, March 2024,\n           <https://www.rfc-editor.org/info/rfc9499>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "section_title": true,
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "This document is based on an idea by Roy Arends and David Conrad. The authors would like to thank Peter van Dijk, Stephane Bortzmeyer, Shane Kerr, Vladimir Cunat, Paul Hoffman, Philip Homburg, Mark Andrews, Libor Peltan, Matthijs Mekking, Willem Toorop, Tom Carpay, Dick Franks, Ben Schwartz, Yaron Sheffer, Viktor Dukhovni, Wes Hardaker, James Gannon, Tim Wicinski, Warren Kumari, Gorry Fairhurst, Benno Overeinder, Paul Wouters, and Petr Spacek for their contributions.",
      "ja": "このドキュメントは、Roy ArendsとDavid Conradのアイデアに基づいています。著者は、ピーター・ヴァン・ディック、ステファン・ボルツマイヤー、シェーン・カー、ウラジミール・カナト、ポール・ホフマン、フィリップ・ホンブルク、マーク・アンドリュース、リボール・ペルタン、マティ・テロップ、トム・カーペイ、ディック・フランク、ベン・シュワルツ、ヤロン・シェファー、Dukhovni、Wes Hardaker、James Gannon、Tim Wicinski、Warren Kumari、Gorry Fairhurst、Benno Overeinder、Paul Wouters、Petr Spacekの貢献。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "section_title": true,
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Roy Arends\nICANN\nEmail: roy.arends@icann.org",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Matt Larson\nICANN\nEmail: matt.larson@icann.org",
      "raw": true,
      "ja": ""
    }
  ]
}