{
  "title": {
    "text": "RFC 9453 - Applicability and Use Cases for IPv6 over Networks of Resource-constrained Nodes (6lo)",
    "ja": "RFC 9453 - リソース制約ノードのネットワーク上のIPv6の適用性とユースケース（6lo）"
  },
  "number": 9453,
  "created_at": "2024-03-02 16:48:32.387203+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         Y-G. Hong\nRequest for Comments: 9453                            Daejeon University\nCategory: Informational                                         C. Gomez\nISSN: 2070-1721                                                      UPC\n                                                                 Y. Choi\n                                                                    ETRI\n                                                                A. Sangi\n                                                 Wenzhou-Kean University\n                                                          S. Chakrabarti\n                                                                 Verizon\n                                                          September 2023",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "Applicability and Use Cases for IPv6 over Networks of Resource-constrained Nodes (6lo)",
      "title": true,
      "section_title": true,
      "ja": "リソース制約ノードのネットワーク上のIPv6の適用性とユースケース（6lo）"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "section_title": true,
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document describes the applicability of IPv6 over constrained-node networks (6lo) and provides practical deployment examples. In addition to IEEE Std 802.15.4, various link-layer technologies are used as examples, such as ITU-T G.9959 (Z-Wave), Bluetooth Low Energy (Bluetooth LE), Digital Enhanced Cordless Telecommunications - Ultra Low Energy (DECT-ULE), Master-Slave/Token Passing (MS/TP), Near Field Communication (NFC), and Power Line Communication (PLC). This document targets an audience who would like to understand and evaluate running end-to-end IPv6 over the constrained-node networks for local or Internet connectivity.",
      "ja": "このドキュメントでは、制約付きノードネットワーク（6LO）よりもIPv6の適用性について説明し、実用的な展開の例を提供します。IEEE STD 802.15.4に加えて、ITU-T G.9959（Z-Wave）、Bluetooth Low Energy（Bluetooth LE）、デジタル強化コードレス通信 - 超低エネルギー（超低エネルギー（dect-ule）、マスタースレーブ/トークンパッシング（MS/TP）、近いフィールド通信（NFC）、および電力線通信（PLC）。このドキュメントは、ローカルまたはインターネット接続のために制約されたノードネットワークを介して、実行中のエンドツーエンドIPv6を理解して評価したい視聴者を対象としています。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "section_title": true,
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントは、インターネット標準の追跡仕様ではありません。情報目的で公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are candidates for any level of Internet Standard; see Section 2 of RFC 7841.",
      "ja": "このドキュメントは、インターネットエンジニアリングタスクフォース（IETF）の製品です。IETFコミュニティのコンセンサスを表しています。公開レビューを受けており、インターネットエンジニアリングステアリンググループ（IESG）からの出版が承認されています。IESGによって承認されたすべてのドキュメントが、インターネット標準のあらゆるレベルの候補者であるわけではありません。RFC 7841のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at https://www.rfc-editor.org/info/rfc9453.",
      "ja": "このドキュメントの現在のステータス、任意のERRATA、およびそのフィードバックを提供する方法に関する情報は、https：//www.rfc-editor.org/info/rfc9453で取得できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "section_title": true,
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2023 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（c）2023 IETF Trustおよび文書著者として特定された人。無断転載を禁じます。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (https://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Revised BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Revised BSD License.",
      "ja": "このドキュメントは、BCP 78およびIETFドキュメント（https://trustee.ietf.org/license-info）に関連するIETF Trustの法的規定の対象となります。この文書に関するあなたの権利と制限を説明するので、これらの文書を注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、セクション4.Eで説明されている法的規定のセクション4.Eで説明されており、改訂されたBSDライセンスで説明されている保証なしで提供されるように、改訂されたBSDライセンステキストを含める必要があります。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "section_title": true,
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction\n2.  6lo Link-Layer Technologies\n  2.1.  ITU-T G.9959\n  2.2.  Bluetooth LE\n  2.3.  DECT-ULE\n  2.4.  MS/TP\n  2.5.  NFC\n  2.6.  PLC\n  2.7.  Comparison between 6lo Link-Layer Technologies\n3.  Guidelines for Adopting an IPv6 Stack (6lo)\n4.  6lo Deployment Examples\n  4.1.  Wi-SUN Usage of 6lo in Network Layer\n  4.2.  Thread Usage of 6lo in the Network Layer\n  4.3.  G3-PLC Usage of 6lo in Network Layer\n  4.4.  Netricity Usage of 6lo in the Network Layer\n5.  6lo Use-Case Examples\n  5.1.  Use Case of ITU-T G.9959: Smart Home\n  5.2.  Use Case of Bluetooth LE: Smartphone-Based Interaction\n  5.3.  Use Case of DECT-ULE: Smart Home\n  5.4.  Use Case of MS/TP: Building Automation Networks\n  5.5.  Use Case of NFC: Alternative Secure Transfer\n  5.6.  Use Case of PLC: Smart Grid\n6.  IANA Considerations\n7.  Security Considerations\n8.  References\n  8.1.  Normative References\n  8.2.  Informative References\nAppendix A.  Design Space Dimensions for 6lo Deployment\nAcknowledgements\nAuthors' Addresses",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "Running IPv6 on constrained-node networks presents challenges due to the characteristics of these networks, such as small packet size, low power, low bandwidth, and large number of devices, among others [RFC4919] [RFC7228]. For example, many IEEE Std 802.15.4 variants [IEEE-802.15.4] exhibit a frame size of 127 octets, whereas IPv6 requires its underlying layer to support an MTU of 1280 bytes. Furthermore, those IEEE Std 802.15.4 variants do not offer fragmentation and reassembly functionality. (It is noted that IEEE Std 802.15.9-2021 provides a multiplexing and fragmentation layer for the IEEE Std 802.15.4 [IEEE-802.15.9].) Therefore, an appropriate adaptation layer supporting fragmentation and reassembly must be provided below IPv6. Also, the limited IEEE Std 802.15.4 frame size and low energy consumption requirements motivate the need for packet header compression. The IETF IPv6 over Low-Power Wireless Personal Area Network (6LoWPAN) Working Group published a suite of specifications that provides an adaptation layer to support IPv6 over IEEE Std 802.15.4 comprising the following functionalities:",
      "ja": "制約付きノードネットワークでIPv6を実行すると、パケットサイズ、低電力、低帯域幅、多数のデバイスなど、これらのネットワークの特性[RFC4919] [RFC7228]など、これらのネットワークの特性により課題があります。たとえば、多くのIEEE STD 802.15.4バリアント[IEEE-802.15.4]は127オクテットのフレームサイズを示しますが、IPv6は1280バイトのMTUをサポートするために基礎となる層を必要とします。さらに、これらのIEEE STD 802.15.4バリアントは、断片化と再組み立て機能を提供しません。（IEEE STD 802.15.9-2021は、IEEE STD 802.15.4 [IEEE-802.15.9]の多重化層と断片化層を提供することに注意してください。したがって、IPv6以下の断片化と再組み立てをサポートする適切な適応層を提供する必要があります。また、限られたIEEE STD 802.15.4フレームサイズと低エネルギー消費要件は、パケットヘッダー圧縮の必要性を動機付けます。低電力ワイヤレスパーソナルエリアネットワーク（6lowpan）ワーキンググループを介したIETF IPv6は、以下の機能を含むIEEE STD 802.15.4を超えるIPv6をサポートする適応レイヤーを提供する一連の仕様を公開しました。"
    },
    {
      "indent": 6,
      "text": "* fragmentation and reassembly, address autoconfiguration, and a frame format [RFC4944]",
      "ja": "* 断片化と再組み立て、Autoconfiguration、およびフレーム形式[RFC4944]に対処する"
    },
    {
      "indent": 6,
      "text": "* IPv6 (and UDP) header compression [RFC6282]",
      "ja": "* IPv6（およびUDP）ヘッダー圧縮[RFC6282]"
    },
    {
      "indent": 6,
      "text": "* Neighbor Discovery Optimization for 6LoWPAN [RFC6775] [RFC8505]",
      "ja": "* 6lowpan [RFC6775] [RFC8505]の近隣発見最適化"
    },
    {
      "indent": 3,
      "text": "As Internet of Things (IoT) services become more popular, the IETF has defined adaptation layer functionality to support IPv6 over various link-layer technologies other than IEEE Std 802.15.4, such as Bluetooth Low Energy (Bluetooth LE), ITU-T G.9959 (Z-Wave), Digital Enhanced Cordless Telecommunications - Ultra Low Energy (DECT-ULE), Master-Slave/Token Passing (MS/TP), Near Field Communication (NFC), and Power Line Communication (PLC). The 6lo adaptation layers use a variation of the 6LoWPAN stack applied to each particular link-layer technology.",
      "ja": "モノのインターネット（IoT）サービスがより一般的になるにつれて、IETFは、Bluetooth Low Energy（Bluetooth LE）、ITU-T Gなど、IEEE STD 802.15.4以外のさまざまなリンクレイヤーテクノロジーでIPv6をサポートする適応レイヤー機能を定義しています。.9959（Z-wave）、デジタル拡張コードレステレコミュニケーション - 超低エネルギー（DECT-ule）、マスタースレーブ/トークンパス（MS/TP）、近接フィールド通信（NFC）、およびパワーライン通信（PLC）。6LO適応層は、特定のリンク層テクノロジーに適用される6lowpanスタックのバリエーションを使用します。"
    },
    {
      "indent": 3,
      "text": "The 6LoWPAN Working Group produced the document entitled \"Design and Application Spaces for IPv6 over Low-Power Wireless Personal Area Networks (6LoWPANs)\" [RFC6568], which describes potential application scenarios and use cases for LoWPANs. The present document aims to provide guidance to an audience that is new to the IPv6 over constrained-node networks (6lo) concept and want to assess its application to the constrained-node network of their interest. This 6lo applicability document describes a few sets of practical 6lo deployment scenarios and use-case examples. In addition, it considers various network design space dimensions, such as Deployment, Network Size, Power Source, Connectivity, Multi-Hop Communication, Traffic pattern, Mobility, and QoS requirements (see Appendix A).",
      "ja": "6lowpanワーキンググループは、低電力のワイヤレスパーソナルエリアネットワーク（6lowpans）を超える「IPv6用の設計およびアプリケーションスペース」[RFC6568]を作成しました。現在のドキュメントは、Constrained-Node Networks（6LO）の概念を介してIPv6を使用した視聴者にガイダンスを提供し、そのアプリケーションを関心のある制約付きノードネットワークに評価することを目的としています。この6LOアプリケーションドキュメントでは、実用的な6LO展開シナリオとユースケースの例のいくつかのセットについて説明しています。さらに、展開、ネットワークサイズ、電源、接続、マルチホップ通信、トラフィックパターン、モビリティ、QoS要件など、さまざまなネットワーク設計スペースの寸法を考慮しています（付録Aを参照）。"
    },
    {
      "indent": 3,
      "text": "This document provides the applicability and use cases of 6lo, considering the following aspects:",
      "ja": "このドキュメントは、次の側面を考慮して、6LOの適用性とユースケースを提供します。"
    },
    {
      "indent": 6,
      "text": "* Various IoT-related wired or wireless link-layer technologies providing practical information about such technologies.",
      "ja": "* このような技術に関する実用的な情報を提供するさまざまなIoT関連の有線またはワイヤレスリンク層テクノロジー。"
    },
    {
      "indent": 6,
      "text": "* General guidelines on how the 6LoWPAN stack can be modified for a given L2 technology.",
      "ja": "* 特定のL2テクノロジーの6lowpanスタックをどのように変更できるかに関する一般的なガイドライン。"
    },
    {
      "indent": 6,
      "text": "* Various 6lo use cases and practical deployment examples.",
      "ja": "* さまざまな6LOユースケースと実用的な展開の例。"
    },
    {
      "indent": 3,
      "text": "Note that the use of \"master\" and \"slave\" have been retained in this document to align with use within the industry (e.g., [TIA-485-A] and [BACnet]).",
      "ja": "このドキュメントでは、「マスター」と「奴隷」の使用が保持されていることに注意して、業界内での使用（[TIA-485-A]および[BACNET]など）で整合しています。"
    },
    {
      "indent": 0,
      "text": "2. 6lo Link-Layer Technologies",
      "section_title": true,
      "ja": "2. 6LOリンク層テクノロジー"
    },
    {
      "indent": 0,
      "text": "2.1. ITU-T G.9959",
      "section_title": true,
      "ja": "2.1. ITU-T G.9959"
    },
    {
      "indent": 3,
      "text": "The ITU-T G.9959 Recommendation [G.9959] targets LoWPANs and defines physical-layer and link-layer functionality. Physical layers of 9.6 kbit/s, 40 kbit/s, and 100 kbit/s are supported. [G.9959] defines how a unique 32-bit HomeID network identifier is assigned by a network controller and how an 8-bit NodeID host identifier is allocated to each node. NodeIDs are unique within the network identified by the HomeID. The G.9959 HomeID represents an IPv6 subnet that is identified by one or more IPv6 prefixes [RFC7428]. ITU-T G.9959 can be used for smart home applications, and the transmission range is 100 meters per hop.",
      "ja": "ITU-T G.9959の推奨[G.9959]はローパンをターゲットにし、物理層とリンク層の機能を定義します。9.6 kbit/s、40 kbit/s、および100 kbit/sの物理層がサポートされています。[G.9959]は、一意の32ビットHomeIDネットワーク識別子がネットワークコントローラーによってどのように割り当てられ、8ビットNodeIDホスト識別子が各ノードに割り当てられるかを定義します。nodeidsは、HomeIDによって識別されるネットワーク内で一意です。G.9959 HomeIDは、1つ以上のIPv6プレフィックス[RFC7428]によって識別されるIPv6サブネットを表します。ITU-T G.9959はスマートホームアプリケーションに使用でき、トランスミッション範囲は1ホップあたり100メートルです。"
    },
    {
      "indent": 0,
      "text": "2.2. Bluetooth LE",
      "section_title": true,
      "ja": "2.2. Bluetooth le"
    },
    {
      "indent": 3,
      "text": "Bluetooth LE was introduced in Bluetooth 4.0, enhanced in Bluetooth 4.1, and developed further in successive versions. The data rate of Bluetooth LE is 125 kb/s, 500 kb/s, 1 Mb/s, 2 Mb/s; and max transmission range is around 100 meters (outdoors). The Bluetooth Special Interest Group (Bluetooth SIG) has also published the Internet Protocol Support Profile (IPSP). The IPSP enables discovery of IP-enabled devices and establishment of link-layer connections for transporting IPv6 packets. IPv6 over Bluetooth LE is dependent on both Bluetooth 4.1 [BTCorev5.4] and IPSP 1.0 [IPSP] or newer.",
      "ja": "Bluetooth LeはBluetooth 4.0で導入され、Bluetooth 4.1で強化され、連続バージョンでさらに開発されました。Bluetooth LEのデータレートは、125 kb/s、500 kb/s、1 mb/s、2 mb/sです。最大トランスミッション範囲は約100メートル（屋外）です。Bluetooth Special Interest Group（Bluetooth SIG）は、インターネットプロトコルサポートプロファイル（IPSP）も公開しています。IPSPにより、IP対応デバイスの発見と、IPv6パケットを輸送するためのリンク層接続の確立が可能になります。Bluetooth LE上のIPv6は、Bluetooth 4.1 [BTCOREV5.4]とIPSP 1.0 [IPSP]以下の両方に依存しています。"
    },
    {
      "indent": 3,
      "text": "Many devices such as mobile phones, notebooks, tablets, and other handheld computing devices that support Bluetooth 4.0 or subsequent versions also support the low-energy variant of Bluetooth. Bluetooth LE is also being included in many different types of accessories that collaborate with mobile devices. An example of a use case for a Bluetooth LE accessory is a heart rate monitor that sends data via the mobile phone to a server on the Internet [RFC7668]. A typical usage of Bluetooth LE is smartphone-based interaction with constrained devices. Bluetooth LE was originally designed to enable star topology networks. However, recent Bluetooth versions support the formation of extended topologies, and IPv6 support for mesh networks of Bluetooth LE devices has been developed [RFC9159].",
      "ja": "Bluetooth 4.0またはその後のバージョンをサポートする携帯電話、ノートブック、タブレット、およびその他のハンドヘルドコンピューティングデバイスなどの多くのデバイスも、Bluetoothの低エネルギーバリアントをサポートしています。Bluetooth Leは、モバイルデバイスと協力するさまざまな種類のアクセサリーにも含まれています。Bluetooth Leアクセサリーのユースケースの例は、携帯電話を介してインターネット上のサーバーにデータを送信する心拍数モニターです[RFC7668]。Bluetooth LEの典型的な使用法は、制約付きデバイスとのスマートフォンベースの相互作用です。Bluetooth Leは、もともとスタートポロジーネットワークを有効にするように設計されていました。ただし、最近のBluetoothバージョンは、拡張トポロジの形成をサポートしており、Bluetooth LEデバイスのメッシュネットワークのIPv6サポートが開発されています[RFC9159]。"
    },
    {
      "indent": 0,
      "text": "2.3. DECT-ULE",
      "section_title": true,
      "ja": "2.3. dect-ule"
    },
    {
      "indent": 3,
      "text": "DECT-ULE is a low-power air interface technology that is designed to support both circuit-switched services, such as voice communication, and packet-mode data services at modest data rate [TS102.939-1] [TS102.939-2].",
      "ja": "DECT-LULEは、音声通信などの回路縮小サービスと控えめなデータレートでのパケットモードデータサービスをサポートするように設計された低電力エアインターフェイステクノロジー[TS102.939-1] [TS102.939-2]。"
    },
    {
      "indent": 3,
      "text": "The DECT-ULE protocol stack consists of the physical layer operating at frequencies in the dedicated 1880 - 1920 MHz frequency band depending on the region and uses a symbol rate of 1.152 Mbps. Radio bearers are allocated by use of Frequency-Division Multiplex (FDMA), Time-Division Multiple Access (TDMA), and Time-Division Duplex (TDD) techniques. The coverage distance is from 70 meters (indoors) to 600 meters (outdoors).",
      "ja": "Dect -uleプロトコルスタックは、地域に応じて専用の1880〜1920 MHz周波数帯域の周波数で動作する物理層で構成され、1.152 Mbpsのシンボルレートを使用します。ラジオベアラーは、周波数分割マルチプレックス（FDMA）、時間分割多重アクセス（TDMA）、および時間分割デュプレックス（TDD）技術を使用して割り当てられます。カバレッジ距離は、70メートル（屋内）から600メートル（屋外）までです。"
    },
    {
      "indent": 3,
      "text": "In its generic network topology, DECT is defined as a cellular network technology. However, the most common configuration is a star network with a single Fixed Part (FP) defining the network with a number of Portable Parts (PPs) attached. The Medium Access Control (MAC) layer supports classical DECT as this is used for services like discovery, pairing, and security features. All these features have been reused from DECT.",
      "ja": "ジェネリックネットワークトポロジでは、DECTはセルラーネットワークテクノロジーとして定義されています。ただし、最も一般的な構成は、単一の固定部品（FP）を備えたSTARネットワークで、多くのポータブルパーツ（PP）が添付されているネットワークを定義します。Medium Access Control（MAC）レイヤーは、発見、ペアリング、セキュリティ機能などのサービスに使用されるため、古典的なDECTをサポートします。これらすべての機能はDECTから再利用されています。"
    },
    {
      "indent": 3,
      "text": "The DECT-ULE device can switch to the ULE mode of operation, utilizing the new Ultra Low Energy (ULE) MAC layer features. The DECT-ULE Data Link Control (DLC) provides multiplexing as well as segmentation and re-assembly for larger packets from layers above. The DECT-ULE layer also implements per-message authentication and encryption. The DLC layer ensures packet integrity and preserves packet order, but delivery is based on best effort.",
      "ja": "Dect-uleデバイスは、新しい超低エネルギー（ULE）MACレイヤー機能を利用して、ULE動作モードに切り替えることができます。Dect-uleデータリンクコントロール（DLC）は、上記のレイヤーからのより大きなパケットのセグメンテーションと再組み立てをマルチプレックスします。Dect-ule層は、認証と暗号化ごとにも実装されます。DLCレイヤーはパケットの整合性を保証し、パケットの順序を保持しますが、配信は最善の努力に基づいています。"
    },
    {
      "indent": 3,
      "text": "The current DECT-ULE MAC layer standard supports low bandwidth data broadcast. However, the usage of this broadcast service has not yet been standardized for higher layers [RFC8105]. DECT-ULE can be used for smart metering in a home.",
      "ja": "現在のDECT-ULE MACレイヤー標準は、低帯域幅データブロードキャストをサポートしています。ただし、このブロードキャストサービスの使用は、高層のためにまだ標準化されていません[RFC8105]。Dect-uleは、家でのスマートメーターに使用できます。"
    },
    {
      "indent": 0,
      "text": "2.4. MS/TP",
      "section_title": true,
      "ja": "2.4. MS/TP"
    },
    {
      "indent": 3,
      "text": "MS/TP is a MAC protocol for the RS-485 [TIA-485-A] physical layer and is used primarily in building automation networks.",
      "ja": "MS/TPは、RS-485 [TIA-485-A]物理層のMACプロトコルであり、主に自動化ネットワークの構築に使用されます。"
    },
    {
      "indent": 3,
      "text": "An MS/TP device is typically based on a low-cost microcontroller with limited processing power and memory. These constraints, together with low data rates and a small MAC address space, are similar to those faced in 6LoWPAN networks. MS/TP differs significantly from 6LoWPAN in at least three respects:",
      "ja": "MS/TPデバイスは、通常、処理能力とメモリが限られている低コストのマイクロコントローラーに基づいています。これらの制約は、低データレートと小さなMACアドレス空間とともに、6lowpanネットワークで直面しているものと似ています。MS/TPは、少なくとも3つの点で6lowpanとは大きく異なります。"
    },
    {
      "indent": 8,
      "text": "a. MS/TP devices are typically mains powered.",
      "ja": "a. MS/TPデバイスは通常、主電源です。"
    },
    {
      "indent": 8,
      "text": "b. All MS/TP devices on a segment can communicate directly, so there are no hidden node issues or mesh routing issues.",
      "ja": "b. セグメント上のすべてのMS/TPデバイスは直接通信できるため、非表示のノードの問題やメッシュルーティングの問題はありません。"
    },
    {
      "indent": 8,
      "text": "c. The latest MS/TP specification provides support for large payloads, eliminating the need for fragmentation and reassembly below IPv6.",
      "ja": "c. 最新のMS/TP仕様は、大きなペイロードをサポートし、IPv6以下の断片化と再組み立ての必要性を排除します。"
    },
    {
      "indent": 3,
      "text": "MS/TP is designed to enable multidrop networks over shielded twisted pair wiring. It can support network segments up to 1000 meters in length at a data rate of 115.2 kbit/s or segments up to 1200 meters in length at lower bit rates. An MS/TP interface requires only a Universal Asynchronous Receiver Transmitter (UART), an RS-485 [TIA-485-A] transceiver with a driver that can be disabled, and a 5 ms resolution timer. The MS/TP MAC is typically implemented in software.",
      "ja": "MS/TPは、シールドされたツイストペア配線よりもマルチドロップネットワークを有効にするように設計されています。低いビットレートでは、長さ115.2 kbit/sまたは最大1200メートルのセグメントのデータレートで最大1000メートルのネットワークセグメントをサポートできます。MS/TPインターフェイスには、無効化できる普遍的な非同期レシーバートランスミッター（UART）、RS-485 [TIA-485-A]トランシーバーが無効になる可能性のあるドライバー、および5 MS解像度タイマーのみが必要です。MS/TP MACは通常、ソフトウェアに実装されます。"
    },
    {
      "indent": 3,
      "text": "Because of its long range (~1 km), MS/TP can be used to connect remote devices (such as district heating controllers) to the nearest building control infrastructure over a single link [RFC8163].",
      "ja": "長距離（〜1 km）のため、MS/TPを使用して、リモートデバイス（地区暖房コントローラーなど）を単一のリンクで最も近い建物制御インフラストラクチャに接続できます[RFC8163]。"
    },
    {
      "indent": 0,
      "text": "2.5. NFC",
      "section_title": true,
      "ja": "2.5. NFC"
    },
    {
      "indent": 3,
      "text": "NFC technology enables secure interactions between electronic devices, allowing consumers to perform contactless transactions, access digital content, and connect electronic devices with a single touch [LLCP-1.4]. The distance between sender and receiver is 10 cm or less. NFC complements many popular consumer-level wireless technologies by utilizing the key elements in existing standards for contactless card technology.",
      "ja": "NFCテクノロジーにより、電子デバイス間の安全な相互作用が可能になり、消費者が非接触型トランザクションを実行し、デジタルコンテンツにアクセスし、電子デバイスを1回のタッチで接続できます[LLCP-1.4]。送信者と受信機の間の距離は10 cm以下です。NFCは、非接触カードテクノロジーの既存の標準の重要な要素を利用することにより、多くの一般的な消費者レベルのワイヤレステクノロジーを補完します。"
    },
    {
      "indent": 3,
      "text": "Extending the capability of contactless card technology, NFC also enables devices to share information at a distance that is less than 10 cm with a maximum communication speed of 424 kbps. Users can share business cards, make transactions, access information from a smart poster, or provide credentials for access control systems with a simple touch.",
      "ja": "NFCは、非接触型カードテクノロジーの機能を拡張することで、最大通信速度が424 kbpsの10 cm未満の距離で情報を共有することもできます。ユーザーは、名刺を共有したり、トランザクションを作成したり、スマートポスターから情報をアクセスしたり、簡単なタッチでアクセス制御システムの資格情報を提供したりできます。"
    },
    {
      "indent": 3,
      "text": "NFC's bidirectional communication ability is suitable for establishing connections with other technologies by the simplicity of touch. In addition to the easy connection and quick transactions, simple data sharing is available [RFC9428]. NFC can be used for secure transfer services where privacy is important.",
      "ja": "NFCの双方向のコミュニケーション能力は、タッチの単純さによって他のテクノロジーとのつながりを確立するのに適しています。簡単な接続と迅速なトランザクションに加えて、単純なデータ共有が利用可能です[RFC9428]。NFCは、プライバシーが重要な安全な転送サービスに使用できます。"
    },
    {
      "indent": 0,
      "text": "2.6. PLC",
      "section_title": true,
      "ja": "2.6. plc"
    },
    {
      "indent": 3,
      "text": "PLC is a data transmission technique that utilizes power conductors as the medium [RFC9354]. Unlike other dedicated communication infrastructure, power conductors are widely available indoors and outdoors. Moreover, wired technologies cause less interference to the radio medium than wireless technologies and are more reliable than their wireless counterparts.",
      "ja": "PLCは、電力導体を媒体[RFC9354]として利用するデータ伝送手法です。他の専用通信インフラストラクチャとは異なり、電力導体は屋内および屋外で広く利用可能です。さらに、有線技術は、ワイヤレステクノロジーよりも無線媒体への干渉が少なく、ワイヤレスの対応物よりも信頼性が高くなります。"
    },
    {
      "indent": 3,
      "text": "The table below shows some available open standards defining PLC.",
      "ja": "以下の表は、PLCを定義するいくつかの利用可能なオープン標準を示しています。"
    },
    {
      "indent": 3,
      "text": "+=============+=================+============+===========+==========+\n| PLC Systems | Frequency Range |    Type    |    Data   | Distance |\n|             |                 |            |    Rate   |          |\n+=============+=================+============+===========+==========+\n|  IEEE 1901  |    < 100 MHz    | Broadband  |    200    |  1000 m  |\n|             |                 |            |    Mbps   |          |\n+-------------+-----------------+------------+-----------+----------+\n| IEEE 1901.1 |     < 12 MHz    |  PLC-IoT   |     10    |  2000 m  |\n|             |                 |            |    Mbps   |          |\n+-------------+-----------------+------------+-----------+----------+\n| IEEE 1901.2 |    < 500 kHz    | Narrowband |    200    |  3000 m  |\n|             |                 |            |    kbps   |          |\n+-------------+-----------------+------------+-----------+----------+\n|    G3-PLC   |    < 500 kHz    | Narrowband |    234    |  3000 m  |\n|             |                 |            |    kbps   |          |\n+-------------+-----------------+------------+-----------+----------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 15,
      "text": "Table 1: Some Available Open Standards in PLC",
      "ja": "表1：PLCで利用可能ないくつかのオープン標準"
    },
    {
      "indent": 3,
      "text": "IEEE Std 1901 [IEEE-1901] defines a broadband variant of PLC, but it is only effective within short range. This standard addresses the requirements of high data rates such as the Internet, HDTV, audio, and gaming.",
      "ja": "IEEE STD 1901 [IEEE-1901]は、PLCのブロードバンドバリアントを定義しますが、短距離内でのみ効果的です。この標準は、インターネット、HDTV、オーディオ、ゲームなどの高いデータレートの要件に対応しています。"
    },
    {
      "indent": 3,
      "text": "IEEE Std 1901.1 [IEEE-1901.1] defines a medium frequency band (less than 12 MHz) broadband PLC technology for smart grid applications based on Orthogonal Frequency Division Multiplexing (OFDM). By achieving an extended communication range with medium speeds, this standard can be applied in both indoor and outdoor scenarios, such as Advanced Metering Infrastructure (AMI), street lighting, electric vehicle charging, and a smart city.",
      "ja": "IEEE STD 1901.1 [IEEE-1901.1]は、直交周波数除算マルチプレックス（OFDM）に基づいて、スマートグリッドアプリケーション向けの中程度の周波数帯域（12 MHz未満）ブロードバンドPLCテクノロジーを定義しています。中速で拡張された通信範囲を達成することにより、この標準は、高度な計量インフラストラクチャ（AMI）、街路照明、電気自動車充電、スマートシティなど、屋内と屋外の両方のシナリオに適用できます。"
    },
    {
      "indent": 3,
      "text": "IEEE Std 1901.2 [IEEE-1901.2] defines a narrowband variant of PLC with a lower data rate but a significantly higher transmission range that could be used in an indoor or even an outdoor environment. A typical use case of PLC is a smart grid.",
      "ja": "IEEE STD 1901.2 [IEEE-1901.2]は、データレートが低いが、屋内または屋外環境でさえ使用できる伝送範囲が大幅に高いPLCの狭帯域変異体を定義しています。PLCの典型的なユースケースはスマートグリッドです。"
    },
    {
      "indent": 3,
      "text": "G3-PLC [G3-PLC] is a narrowband PLC technology that is based on the ITU-T G.9903 Recommendation [G.9903]. The ITU-T G.9903 Recommendation contains the physical layer and data link-layer specification for the G3-PLC narrowband OFDM power line communication transceivers, for communications via alternating current and direct current electric power lines over frequency bands below 500 kHz.",
      "ja": "G3-PLC [G3-PLC]は、ITU-T G.9903の推奨[G.9903]に基づいた狭帯域PLCテクノロジーです。ITU-T G.9903の推奨には、500 kHz未満の周波数帯域上の交互の電流および直流電力線を介した通信用の通信用に、DM電力線通信トランシーバーのG3-PLCナローバンドの物理層とデータリンク層仕様が含まれています。"
    },
    {
      "indent": 0,
      "text": "2.7. Comparison between 6lo Link-Layer Technologies",
      "section_title": true,
      "ja": "2.7. 6LOリンク層技術の比較"
    },
    {
      "indent": 3,
      "text": "In the above subsections, various 6lo link-layer technologies are described. The following table shows the dominant parameters of each use case corresponding to the 6lo link-layer technology.",
      "ja": "上記のサブセクションでは、さまざまな6LOリンク層技術について説明します。次の表は、6LOリンク層テクノロジーに対応する各ユースケースの支配的なパラメーターを示しています。"
    },
    {
      "indent": 3,
      "text": "+=========+========+===========+========+========+========+=========+\n|         | Z-Wave | Bluetooth |DECT-ULE| MS/TP  |  NFC   |   PLC   |\n|         |        |     LE    |        |        |        |         |\n+=========+========+===========+========+========+========+=========+\n|  Usage  |  Home  |  Interact | Meter  |Building| Secure |  Smart  |\n|         | Autom. |  w/ Smart |Reading | Autom. |Transfer|   Grid  |\n|         |        |   Phone   |        |        |        |         |\n+=========+--------+-----------+--------+--------+--------+---------+\n| Topology|L2-mesh |   Star &  | Star,  | MS/TP, |  P2P,  |Star Tree|\n|    &    |   or   |    Mesh   |No mesh |No mesh |L2-mesh |   Mesh  |\n|  Subnet |L3-mesh |           |        |        |        |         |\n+=========+--------+-----------+--------+--------+--------+---------+\n| Mobility|   No   |    Yes    |   No   |   No   |  Yes   |    No   |\n|   Req.  |        |           |        |        |        |         |\n+=========+--------+-----------+--------+--------+--------+---------+\n|Buffering|  Yes   |    Yes    |  Yes   |  Yes   |  Yes   |   Yes   |\n|   Req.  |        |           |        |        |        |         |\n+=========+--------+-----------+--------+--------+--------+---------+\n| Latency,|  Yes   |    Yes    |  Yes   |  Yes   |  Yes   |   Yes   |\n| QoS Req.|        |           |        |        |        |         |\n+=========+--------+-----------+--------+--------+--------+---------+\n| Frequent|   No   |     No    |   No   |  Yes   |   No   |    No   |\n| Tx Req. |        |           |        |        |        |         |\n+=========+--------+-----------+--------+--------+--------+---------+\n|   RFC   |RFC 7428|  RFC 7668 |RFC 8105|RFC 8163|RFC 9428| RFC 9354|\n|         |        |  RFC 9159 |        |        |        |         |\n+=========+--------+-----------+--------+--------+--------+---------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 10,
      "text": "Table 2: Comparison between 6lo Link-Layer Technologies",
      "ja": "表2：6LOリンク層技術の比較"
    },
    {
      "indent": 0,
      "text": "3. Guidelines for Adopting an IPv6 Stack (6lo)",
      "section_title": true,
      "ja": "3. IPv6スタックを採用するためのガイドライン（6LO）"
    },
    {
      "indent": 3,
      "text": "6lo aims to reuse and/or adapt existing 6LoWPAN functionality in order to efficiently support IPv6 over a variety of IoT L2 technologies. The following guideline targets new candidate-constrained L2 technologies that may be considered for running a modified 6LoWPAN stack on top. The modification of the 6LoWPAN stack should be based on the following:",
      "ja": "6LOは、さまざまなIoT L2テクノロジーでIPv6を効率的にサポートするために、既存の6lowpan機能を再利用および/または適応させることを目指しています。次のガイドラインは、変更された6lowpanスタックを上部に実行するために考慮される可能性のある新しい候補者が制約した新しいテクノロジーを対象としています。6lowpanスタックの変更は、次のことに基づいている必要があります。"
    },
    {
      "indent": 3,
      "text": "Addressing Model:",
      "ja": "アドレス指定モデル："
    },
    {
      "indent": 12,
      "text": "The addressing model determines whether the device is capable of forming IPv6 link-local and global addresses, and what is the best way to derive the IPv6 addresses for the constrained L2 devices. IPv6 addresses that are derived from an L2 address are specified in [RFC4944], but there are implications for privacy. The reason is that the L2 address in 6lo link-layer technologies is a little short, and devices can become vulnerable to the various threats. For global usage, a unique IPv6 address must be derived using an assigned prefix and a unique interface ID. [RFC8065] provides such guidelines. For MAC-derived IPv6 addresses, refer to [RFC8163] for mapping examples. Broadcast and multicast support are dependent on the L2 networks. Most low-power L2 implementations map multicast to broadcast networks. So care must be taken in the design for when to use broadcast, trying to stick to unicast messaging whenever possible.",
      "ja": "アドレス指定モデルは、デバイスがIPv6リンクローカルおよびグローバルアドレスを形成できるかどうか、および制約付きL2デバイスのIPv6アドレスを導出する最良の方法を決定します。L2アドレスから派生したIPv6アドレスは[RFC4944]で指定されていますが、プライバシーには影響があります。その理由は、6LOリンク層テクノロジーのL2アドレスが少し短く、デバイスがさまざまな脅威に対して脆弱になる可能性があるためです。グローバル使用のためには、割り当てられたプレフィックスと一意のインターフェイスIDを使用して、一意のIPv6アドレスを導出する必要があります。[RFC8065]は、このようなガイドラインを提供します。Mac由来のIPv6アドレスについては、例については[RFC8163]を参照してください。ブロードキャストとマルチキャストのサポートは、L2ネットワークに依存します。ほとんどの低電力L2実装は、マルチキャストをブロードキャストネットワークにマッピングします。したがって、可能な限りユニキャストメッセージに固執しようとして、いつ放送を使用するかについては、設計には注意が必要です。"
    },
    {
      "indent": 3,
      "text": "MTU Considerations:",
      "ja": "MTUの考慮事項："
    },
    {
      "indent": 12,
      "text": "The deployment should consider packet maximum transmission unit (MTU) needs over the link layer and should consider if fragmentation and reassembly of packets are needed at the 6LoWPAN layer. For example, if the link layer supports fragmentation and reassembly of packets, then the 6LoWPAN layer may not need to support fragmentation and reassembly. In fact, for greatest efficiency, choosing a low-power link layer that can carry unfragmented application packets would be optimal for packet transmission if the deployment can afford it. Please refer to 6lo RFCs [RFC7668], [RFC8163], and [RFC8105] for example guidance.",
      "ja": "展開では、リンクレイヤーのパケット最大送信ユニット（MTU）のニーズを考慮し、6lowpanレイヤーでパケットの断片化と再組み立てが必要かどうかを考慮する必要があります。たとえば、リンクレイヤーがパケットの断片化と再組み立てをサポートする場合、6lowpanレイヤーは断片化と再組み立てをサポートする必要がない場合があります。実際、最大の効率を得るために、展開が展開できればパケット送信に最適です。たとえば、ガイダンスなど、6lo RFCS [RFC7668]、[RFC8163]、および[RFC8105]を参照してください。"
    },
    {
      "indent": 3,
      "text": "Mesh or L3 Routing:",
      "ja": "メッシュまたはL3ルーティング："
    },
    {
      "indent": 12,
      "text": "6LoWPAN specifications provide mechanisms to support mesh routing at L2, a configuration called \"mesh-under\" [RFC6606]. It is also possible to use an L3 routing protocol in 6LoWPAN, an approach known as \"route-over\". [RFC6550] defines RPL, an L3 routing protocol for low-power and lossy networks using directed acyclic graphs. 6LoWPAN is routing-protocol-agnostic and does not specify any particular L2 or L3 routing protocol to use with a 6LoWPAN stack.",
      "ja": "6Lowpan仕様は、「Mesh-Under」[RFC6606]と呼ばれる構成であるL2でのメッシュルーティングをサポートするメカニズムを提供します。6lowpanでL3ルーティングプロトコルを使用することも可能です。これは、「ルートオーバー」として知られるアプローチです。[RFC6550]は、指示された非環式グラフを使用して、低電力および損失のあるネットワークのL3ルーティングプロトコルであるRPLを定義します。6lowpanはルーティングプロトコルに依存しており、6lowpanスタックで使用する特定のL2またはL3ルーティングプロトコルを指定していません。"
    },
    {
      "indent": 3,
      "text": "Address Assignment:",
      "ja": "アドレス割り当て："
    },
    {
      "indent": 12,
      "text": "6LoWPAN developed a new version of IPv6 Neighbor Discovery [RFC4861] [RFC4862]. 6LoWPAN Neighbor Discovery [RFC6775] [RFC8505] inherits from IPv6 Neighbor Discovery for mechanisms such as Stateless Address Autoconfiguration (SLAAC) and Neighbor Unreachability Detection (NUD). A 6LoWPAN node is also expected to be an IPv6 host per [RFC8200], which means it should ignore consumed routing headers and hop-by-hop options. When operating in an RPL network [RFC6550], it is also beneficial to support IP-in-IP encapsulation [RFC9008]. The 6LoWPAN node should also support the registration extensions defined in [RFC8505] and use the mechanism as the default Neighbor Discovery method. It is the responsibility of the deployment to ensure unique global IPv6 addresses for Internet connectivity. For local-only connectivity, IPv6 Unique Local Address (ULA) may be used. [RFC6775] and [RFC8505] specify the 6LoWPAN Border Router (6LBR), which is responsible for prefix assignment to the 6LoWPAN network. A 6LBR can be connected to the Internet or to an enterprise network via one of the interfaces. Please refer to [RFC7668] and [RFC8105] for examples of address assignment considerations. In addition, privacy considerations in [RFC8065] must be consulted for applicability. In certain scenarios, the deployment may not support IPv6 address autoconfiguration due to regulatory and business reasons and may choose to offer a separate address assignment service. Address-Protected Neighbor Discovery [RFC8928] enables source address validation [RFC6620] and protects the address ownership against impersonation attacks.",
      "ja": "6lowpanは、IPv6 Neighbor Discovery [RFC4861] [RFC4862]の新しいバージョンを開発しました。6lowpan Neighbor Discovery [RFC6775] [RFC8505]は、Stateless Address Autoconfiguration（SLAAC）やNeighbore Uneachability Detection（NUD）などのメカニズムをIPv6 Neighbor Discoveryから継承します。6lowpanノードは、[RFC8200]ごとにIPv6ホストになると予想されています。つまり、消費されたルーティングヘッダーとホップバイホップオプションを無視する必要があります。RPLネットワーク[RFC6550]で動作する場合、IP-in-IPカプセル化[RFC9008]をサポートすることも有益です。6lowpanノードは、[RFC8505]で定義されている登録拡張機能もサポートし、メカニズムをデフォルトのNeightre Discoveryメソッドとして使用する必要があります。インターネット接続のための一意のグローバルIPv6アドレスを確保することは、展開の責任です。ローカルのみの接続には、IPv6一意のローカルアドレス（ULA）を使用できます。[RFC6775]および[RFC8505]は、6Lowpanネットワークへのプレフィックス割り当てを担当する6Lowpan Border Router（6LBR）を指定します。6LBRは、インターフェイスのいずれかを介してインターネットまたはエンタープライズネットワークに接続できます。アドレス割り当ての考慮事項の例については、[RFC7668]および[RFC8105]を参照してください。さらに、[RFC8065]のプライバシーに関する考慮事項には、適用性について相談する必要があります。特定のシナリオでは、展開は、規制およびビジネス上の理由によりIPv6アドレスアドレスをサポートしない場合があり、別のアドレス割り当てサービスを提供することを選択できます。住所保護された近隣発見[RFC8928]は、ソースアドレスの検証[RFC6620]を可能にし、住所の所有権をなりすまし攻撃から保護します。"
    },
    {
      "indent": 3,
      "text": "Broadcast Avoidance:",
      "ja": "放送回避："
    },
    {
      "indent": 12,
      "text": "6LoWPAN Neighbor Discovery aims to reduce the amount of multicast traffic of classic Neighbor Discovery, since IP-level multicast translates into L2 broadcast in many L2 technologies [RFC6775]. 6LoWPAN Neighbor Discovery relies on a proactive registration to avoid the use of multicast for address resolution. It also uses a unicast method for Duplicate Address Detection (DAD) and avoids multicast lookups from all nodes by using non-onlink prefixes. Router Advertisements (RAs) are also sent in unicast, in response to Router Solicitations (RSs).",
      "ja": "6Lowpan Neighbor Discoveryは、IPレベルのマルチキャストが多くのL2テクノロジーでL2ブロードキャストに変換されるため、古典的な近隣発見のマルチキャストトラフィックの量を減らすことを目指しています[RFC6775]。6Lowpan Neighbor Discoveryは、アドレス解決のためにマルチキャストの使用を避けるために、積極的な登録に依存しています。また、Unicastメソッドを使用して、アドレス検出（DAD）を複製し、非Onlinkプレフィックスを使用してすべてのノードからのマルチキャストルックアップを回避します。ルーター広告（RAS）も、ルーターの勧誘（RSS）に応じて、ユニキャストで送信されます。"
    },
    {
      "indent": 3,
      "text": "Host-to-Router Interface:",
      "ja": "ホストからルーターへのインターフェイス："
    },
    {
      "indent": 12,
      "text": "6lo has defined registration extensions for 6LoWPAN Neighbor Discovery [RFC8505]. This effort provides a host-to-router interface by which a host can request its router to ensure reachability for the address registered with the router. Note that functionality has been developed to ensure that such a host can benefit from routing services in a RPL network [RFC9010].",
      "ja": "6loは、6lowpan Neighbor Discovery [RFC8505]の登録拡張機能を定義しています。この取り組みは、ホストがルーターに登録されているアドレスの到達可能性を確保するために、ホストがルーターを要求できるホスト間インターフェイスを提供します。このようなホストがRPLネットワークでのルーティングサービスの恩恵を受けることができるように機能が開発されていることに注意してください[RFC9010]。"
    },
    {
      "indent": 3,
      "text": "Proxy Neighbor Discovery:",
      "ja": "プロキシネイバーディスカバリー："
    },
    {
      "indent": 12,
      "text": "Further functionality also allows a device (e.g., an energy-constrained device that needs to sleep most of the time) to request proxy Neighbor Discovery services from a 6LoWPAN Backbone Router (6BBR) [RFC8505] [RFC8929]. The latter RFC federates a number of links into a multi-link subnet.",
      "ja": "また、さらなる機能により、デバイス（ほとんどの場合、睡眠が必要なエネルギー制約のデバイス）が6lowpanバックボーンルーター（6BBR）[RFC8505] [RFC8929]からプロキシNeighbor Discovery Servicesを要求することができます。後者のRFCは、多数のリンクをマルチリンクサブネットに採用しています。"
    },
    {
      "indent": 3,
      "text": "Header Compression:",
      "ja": "ヘッダー圧縮："
    },
    {
      "indent": 12,
      "text": "IPv6 header compression [RFC6282] is a vital part of IPv6 over low-power communication. Examples of header compression over different link-layer specifications are found in [RFC7668], [RFC8163], and [RFC8105]. A generic header compression technique is specified in [RFC7400]. For 6LoWPAN networks where RPL is the routing protocol, there are 6LoWPAN header compression extensions that allow compressing the RPL artifacts used when forwarding packets in the route-over mesh [RFC8138] [RFC9035].",
      "ja": "IPv6ヘッダー圧縮[RFC6282]は、低電力通信よりもIPv6の重要な部分です。異なるリンク層仕様にわたるヘッダー圧縮の例は、[RFC7668]、[RFC8163]、および[RFC8105]にあります。[RFC7400]で一般的なヘッダー圧縮技術が指定されています。RPLがルーティングプロトコルである6lowpanネットワークの場合、ルートオーバーメッシュ[RFC8138] [RFC9035]でパケットを転送するときに使用されるRPLアーティファクトを圧縮できる6lowpanヘッダー圧縮エクステンションがあります。"
    },
    {
      "indent": 3,
      "text": "Security and Encryption:",
      "ja": "セキュリティと暗号化："
    },
    {
      "indent": 12,
      "text": "Though 6LoWPAN basic specifications do not address security at the network layer, the assumption is that L2 security must be present. Nevertheless, care must be taken since specific L2 technologies may exhibit security gaps. Typically, 6lo L2 technologies (see Section 2) offer security properties such as confidentiality and/ or message authentication. In addition, end-to-end security is highly desirable. Protocols such as DTLS/TLS, as well as Object Security, are being used in the constrained-node network domain [SEC-PROT-COMP]. The relevant IETF working groups should be consulted for application and transport level security. The IETF has worked on address authentication [RFC8928], and secure bootstrapping is also being discussed in the IETF. However, there may be other security mechanisms available in a deployment through other standards, such as hardware-level security or certificates for the initial booting process. In order to use security mechanisms, the implementation needs to be able to afford it in terms of processing capabilities and energy consumption.",
      "ja": "6lowpanの基本仕様はネットワークレイヤーのセキュリティに対処していませんが、L2セキュリティが存在する必要があると仮定しています。それにもかかわらず、特定のL2テクノロジーがセキュリティギャップを示す可能性があるため、注意が必要です。通常、6lo L2テクノロジー（セクション2を参照）は、機密性やメッセージ認証などのセキュリティプロパティを提供します。さらに、エンドツーエンドのセキュリティが非常に望ましいです。DTLS/TLSなどのプロトコルやオブジェクトセキュリティは、制約されたノードネットワークドメイン[SEC-PROT-COMP]で使用されています。関連するIETFワーキンググループは、アプリケーションおよび輸送レベルのセキュリティについて参照する必要があります。IETFはアドレス認証[RFC8928]に取り組んでおり、安全なブートストラップについてもIETFで説明しています。ただし、ハードウェアレベルのセキュリティや初期ブートプロセスの証明書など、他の標準を通じて展開中に利用できる他のセキュリティメカニズムがある場合があります。セキュリティメカニズムを使用するために、実装は、処理能力とエネルギー消費の観点からそれを提供できるようにする必要があります。"
    },
    {
      "indent": 3,
      "text": "Additional Processing:",
      "ja": "追加処理："
    },
    {
      "indent": 12,
      "text": "[RFC8066] defines guidelines for ESC dispatch octets used in the 6LoWPAN header. The ESC type is defined to use additional dispatch octets in the 6LoWPAN header. An implementation may take advantage of the ESC header to offer a deployment-specific processing of 6LoWPAN packets.",
      "ja": "[RFC8066] 6lowpanヘッダーで使用されているESCディスパッチオクテットのガイドラインを定義します。ESCタイプは、6Lowpanヘッダーに追加のディスパッチオクテットを使用するように定義されています。実装では、ESCヘッダーを利用して、6Lowpanパケットの展開固有の処理を提供する場合があります。"
    },
    {
      "indent": 0,
      "text": "4. 6lo Deployment Examples",
      "section_title": true,
      "ja": "4. 6LO展開の例"
    },
    {
      "indent": 0,
      "text": "4.1. Wi-SUN Usage of 6lo in Network Layer",
      "section_title": true,
      "ja": "4.1. ネットワークレイヤーでの6loのWi-SUN使用"
    },
    {
      "indent": 3,
      "text": "Wireless Smart Ubiquitous Network (Wi-SUN) [Wi-SUN] is a technology based on IEEE Std 802.15.4g [IEEE-802.15.4]. Wi-SUN networks support star and mesh topologies as well as hybrid star/mesh deployments, but these are typically laid out in a mesh topology where each node relays data for the network to provide network connectivity. Wi-SUN networks are deployed on both grid-powered and battery-operated devices [RFC8376].",
      "ja": "ワイヤレススマートユビキタスネットワーク（Wi-Sun）[Wi-Sun]は、IEEE STD 802.15.4G [IEEE-802.15.4]に基づくテクノロジーです。Wi-Sunネットワークは、スタートポロジとメッシュトポロジ、ハイブリッドスター/メッシュの展開をサポートしますが、これらは通常、ネットワークの接続性を提供するために各ノードがネットワークのデータをリレーするメッシュトポロジでレイアウトされています。Wi-Sunネットワークは、グリッド駆動型デバイスとバッテリー操作デバイスの両方に展開されています[RFC8376]。"
    },
    {
      "indent": 3,
      "text": "The main application domains using Wi-SUN are smart utility and smart city networks. The Wi-SUN Alliance Field Area Network (FAN) primarily covers outdoor networks. The Wi-SUN FAN specification defines an IPv6-based protocol suite that includes TCP/UDP, IPv6, 6lo adaptation layer, DHCPv6 for IPv6 address management, RPL, and ICMPv6.",
      "ja": "Wi-Sunを使用する主なアプリケーションドメインは、スマートユーティリティとスマートシティネットワークです。Wi-Sun Alliance Field Area Network（FAN）は、主に屋外ネットワークをカバーしています。Wi-Sunファン仕様は、IPv6アドレス管理、RPL、およびICMPv6用のTCP/UDP、IPv6、6lo適応層、DHCPV6を含むIPv6ベースのプロトコルスイートを定義します。"
    },
    {
      "indent": 0,
      "text": "4.2. Thread Usage of 6lo in the Network Layer",
      "section_title": true,
      "ja": "4.2. ネットワークレイヤーでの6loのスレッド使用量"
    },
    {
      "indent": 3,
      "text": "Thread is an IPv6-based networking protocol stack built on open standards, designed for smart home environments, and based on low-power IEEE Std 802.15.4 mesh networks. Because of its IPv6 foundation, Thread can support existing popular application layers and IoT platforms, provide end-to-end security, ease development, and enable flexible designs [Thread].",
      "ja": "Threadは、Smart Home環境向けに設計され、低電力IEEES STD 802.15.4メッシュネットワークに基づいて、オープン標準に基づいて構築されたIPv6ベースのネットワークプロトコルスタックです。IPv6ファンデーションにより、Threadは既存の一般的なアプリケーションレイヤーとIoTプラットフォームをサポートし、エンドツーエンドのセキュリティを提供し、開発を容易にし、柔軟な設計を有効にします[スレッド]。"
    },
    {
      "indent": 3,
      "text": "The Thread specification uses the IEEE Std 802.15.4 [IEEE-802.15.4] physical and MAC layers operating at 250 kbps in the 2.4 GHz band.",
      "ja": "スレッド仕様では、IEEE STD 802.15.4 [IEEE-802.15.4] 2.4 GHzバンドで250 kbpsで動作する物理およびMac層を使用しています。"
    },
    {
      "indent": 3,
      "text": "Thread devices use 6LoWPAN, as defined in [RFC4944] and [RFC6282], for transmission of IPv6 packets over IEEE Std 802.15.4 networks. Header compression is used within the Thread network, and devices transmitting messages compress the IPv6 header to minimize the size of the transmitted packet. The mesh header is supported for link-layer (i.e., mesh-under) forwarding. The mesh header as used in Thread also allows efficient end-to-end fragmentation of messages rather than the hop-by-hop fragmentation specified in [RFC4944]. Mesh-under routing in Thread is based on a distance vector protocol in a full mesh topology.",
      "ja": "スレッドデバイスは、[RFC4944]および[RFC6282]で定義されているように、IEEE STD 802.15.4ネットワークを介したIPv6パケットの送信に6lowpanを使用します。ヘッダー圧縮はスレッドネットワーク内で使用され、メッセージを送信するデバイスはIPv6ヘッダーを圧縮して、送信されたパケットのサイズを最小限に抑えます。メッシュヘッダーは、リンク層（つまり、メッシュアンダー）転送にサポートされています。スレッドで使用されるメッシュヘッダーは、[RFC4944]で指定されたホップバイホップフラグメンテーションではなく、メッセージの効率的なエンドツーエンドの断片化も可能にします。スレッドのメッシュアンダールーティングは、フルメッシュトポロジの距離ベクトルプロトコルに基づいています。"
    },
    {
      "indent": 0,
      "text": "4.3. G3-PLC Usage of 6lo in Network Layer",
      "section_title": true,
      "ja": "4.3. ネットワーク層の6LOのG3-PLC使用"
    },
    {
      "indent": 3,
      "text": "G3-PLC [G3-PLC] is a narrowband PLC technology that is based on the ITU-T G.9903 Recommendation [G.9903]. G3-PLC supports multi-hop mesh network topology and facilitates highly reliable, long-range communication. With the abilities to support IPv6 and to cross transformers, G3-PLC is regarded as one of the next-generation narrowband PLC technologies. G3-PLC has got massive deployments over several countries, e.g., Japan and France.",
      "ja": "G3-PLC [G3-PLC]は、ITU-T G.9903の推奨[G.9903]に基づいた狭帯域PLCテクノロジーです。G3-PLCは、マルチホップメッシュネットワークトポロジをサポートし、非常に信頼性の高い長距離通信を促進します。IPv6をサポートし、トランスをクロスする能力により、G3-PLCは次世代の狭帯域PLCテクノロジーの1つと見なされています。G3-PLCは、日本やフランスなど、いくつかの国に大規模な展開を行っています。"
    },
    {
      "indent": 3,
      "text": "The main application domains using G3-PLC are smart grid and smart cities. This includes, but is not limited to, the following applications:",
      "ja": "G3-PLCを使用する主なアプリケーションドメインは、スマートグリッドとスマートシティです。これには、次のアプリケーションが含まれますが、これらに限定されません。"
    },
    {
      "indent": 6,
      "text": "* smart metering",
      "ja": "* スマートメーター"
    },
    {
      "indent": 6,
      "text": "* vehicle-to-grid communication",
      "ja": "* 車両間通信"
    },
    {
      "indent": 6,
      "text": "* demand response",
      "ja": "* 需要応答"
    },
    {
      "indent": 6,
      "text": "* distribution automation",
      "ja": "* 配布自動化"
    },
    {
      "indent": 6,
      "text": "* home/building energy management systems",
      "ja": "* ホーム/建物のエネルギー管理システム"
    },
    {
      "indent": 6,
      "text": "* smart street lighting",
      "ja": "* スマートストリート照明"
    },
    {
      "indent": 6,
      "text": "* AMI backbone network",
      "ja": "* AMIバックボーンネットワーク"
    },
    {
      "indent": 6,
      "text": "* wind/solar farm monitoring",
      "ja": "* 風力/ソーラーファームの監視"
    },
    {
      "indent": 3,
      "text": "In the G3-PLC specification, the 6lo adaption layer utilizes the 6LoWPAN functions (e.g., header compression, fragmentation, and reassembly). However, due to the different characteristics of the PLC media, the 6LoWPAN adaptation layer cannot perfectly fulfill the requirements [RFC9354]. The ESC dispatch type is used in the G3-PLC to provide fundamental mesh routing and bootstrapping functionalities [RFC8066].",
      "ja": "G3-PLC仕様では、6LO適応層が6lowpan関数（例：ヘッダー圧縮、断片化、再組み立て）を利用します。ただし、PLCメディアの特性が異なるため、6lowpan適応層は要件を完全に満たすことはできません[RFC9354]。G3-PLCでは、ESCの衝突タイプが使用され、基本的なメッシュルーティングとブートストラップ機能[RFC8066]を提供します。"
    },
    {
      "indent": 0,
      "text": "4.4. Netricity Usage of 6lo in the Network Layer",
      "section_title": true,
      "ja": "4.4. ネットワークレイヤーでの6LOのネトリック使用"
    },
    {
      "indent": 3,
      "text": "The Netricity program in the HomePlug Powerline Alliance [NETRICITY] promotes the adoption of products built on the IEEE Std 1901.2 low-frequency narrowband PLC standard [IEEE-1901.2], which provides for urban and long-distance communications and propagation through transformers of the distribution network using frequencies below 500 kHz. The technology also addresses requirements that assure communication privacy and secure networks.",
      "ja": "HomePlug Powerline Alliance [Netricity]のネトリックプログラムは、IEEE STD 1901.2低周波狭帯域PLC標準[IEEE-1901.2]に基づいて構築された製品の採用を促進します。500 kHz未満の周波数を使用したネットワーク。このテクノロジーは、通信プライバシーと安全なネットワークを保証する要件にも対処しています。"
    },
    {
      "indent": 3,
      "text": "The main application domains using Netricity are smart grid and smart cities. This includes, but is not limited to, the following applications:",
      "ja": "ネトリックを使用した主なアプリケーションドメインは、スマートグリッドとスマートシティです。これには、次のアプリケーションが含まれますが、これらに限定されません。"
    },
    {
      "indent": 6,
      "text": "* utility grid modernization",
      "ja": "* ユーティリティグリッドの近代化"
    },
    {
      "indent": 6,
      "text": "* distribution automation",
      "ja": "* 配布自動化"
    },
    {
      "indent": 6,
      "text": "* meter-to-grid connectivity",
      "ja": "* メーター間接続"
    },
    {
      "indent": 6,
      "text": "* microgrids",
      "ja": "* マイクログリッド"
    },
    {
      "indent": 6,
      "text": "* grid sensor communications",
      "ja": "* グリッドセンサー通信"
    },
    {
      "indent": 6,
      "text": "* load control",
      "ja": "* 負荷制御"
    },
    {
      "indent": 6,
      "text": "* demand response",
      "ja": "* 需要応答"
    },
    {
      "indent": 6,
      "text": "* net metering",
      "ja": "* ネットメータリング"
    },
    {
      "indent": 6,
      "text": "* street lighting control",
      "ja": "* 街路照明制御"
    },
    {
      "indent": 6,
      "text": "* photovoltaic panel monitoring",
      "ja": "* 太陽光発電パネルの監視"
    },
    {
      "indent": 3,
      "text": "The Netricity system architecture is based on the physical and MAC layers of IEEE Std 1901.2. Regarding the 6lo adaptation layer and an IPv6 network layer, Netricity utilizes IPv6 protocol suite including 6lo/6LoWPAN header compression, DHCPv6 for IP address management, RPL routing protocol, ICMPv6, and unicast/multicast forwarding. Note that the L3 routing in Netricity uses RPL in non-storing mode with the MRHOF (Minimum Rank with Hysteresis Objective Function) based on their own defined Estimated Transmission Time (ETT) metric.",
      "ja": "ネトリックシステムアーキテクチャは、IEEE STD 1901.2の物理的およびMAC層に基づいています。6LO適応層とIPv6ネットワークレイヤーに関して、Netricityは6LO/6LOWPANヘッダー圧縮、IPアドレス管理用のDHCPV6、RPLルーティングプロトコル、ICMPV6、ユニキャスト/マルチキャスト転送などのIPv6プロトコルスイートを利用しています。ネトリックのL3ルーティングは、独自の定義された推定透過時間（ETT）メトリックに基づいて、MRHOF（ヒステリシス目的関数の最小ランク）を使用して、非貯蓄モードでRPLを使用していることに注意してください。"
    },
    {
      "indent": 0,
      "text": "5. 6lo Use-Case Examples",
      "section_title": true,
      "ja": "5. 6LOユースケースの例"
    },
    {
      "indent": 3,
      "text": "As IPv6 stacks for constrained-node networks use a variation of the 6LoWPAN stack applied to each particular link-layer technology, various 6lo use cases can be provided. In this section, various 6lo use cases, which are based on different link-layer technologies, are described.",
      "ja": "制約付きノードネットワークのIPv6スタックは、特定のリンク層テクノロジーに適用される6lowpanスタックのバリエーションを使用するため、さまざまな6LOユースケースを提供できます。このセクションでは、さまざまなリンク層技術に基づいたさまざまな6LOユースケースについて説明します。"
    },
    {
      "indent": 0,
      "text": "5.1. Use Case of ITU-T G.9959: Smart Home",
      "section_title": true,
      "ja": "5.1. ITU-T G.9959のユースケース：スマートホーム"
    },
    {
      "indent": 3,
      "text": "Z-Wave is one of the main technologies that may be used to enable smart home applications. Born as a proprietary technology, Z-Wave was specifically designed for this particular use case. Recently, the Z-Wave radio interface (physical and MAC layers) has been standardized as the ITU-T G.9959 specification [G.9959].",
      "ja": "Z-Waveは、スマートホームアプリケーションを有効にするために使用できる主要なテクノロジーの1つです。独自の技術として生まれたZ-Waveは、この特定のユースケース向けに特別に設計されています。最近、Z-Wave無線インターフェイス（物理レイヤーとMACレイヤー）は、ITU-T G.9959仕様[G.9959]として標準化されています。"
    },
    {
      "indent": 3,
      "text": "Example: Use of ITU-T G.9959 for Home Automation",
      "ja": "例：Home AutomationのためのITU-T G.9959の使用"
    },
    {
      "indent": 3,
      "text": " A variety of home devices (e.g., light dimmers/switches, plugs, thermostats, blinds/curtains, and remote controls) are augmented with ITU-T G.9959 interfaces. A user may turn home appliances on and off, or the user may control them by pressing a wall switch or a button on a remote control. Scenes may be programmed so that the home devices adopt a specific configuration after a given event. Sensors may also periodically send measurements of several parameters (e.g., gas presence, light, temperature, humidity), which are collected at a sink device, or may generate commands for actuators (e.g., a smoke sensor may send an alarm message to a safety system).",
      "ja": "さまざまなホームデバイス（例：光調光器/スイッチ、プラグ、サーモスタット、ブラインド/カーテン、リモートコントロールなど）は、ITU-T G.9959インターフェイスで増強されています。ユーザーは、オン /オフを自宅に渡すことができます。または、ユーザーは、リモートコントロールのウォールスイッチまたはボタンを押すことでそれらを制御できます。シーンは、特定のイベントの後にホームデバイスが特定の構成を採用するようにプログラムできます。センサーはまた、シンクデバイスで収集されるいくつかのパラメーター（ガスの存在、光、温度、湿度など）の測定値を定期的に送信したり、アクチュエーターのコマンドを生成する場合があります（たとえば、煙センサーは安全にアラームメッセージを送信する場合があります。システム）。"
    },
    {
      "indent": 3,
      "text": "The devices involved in the described scenario are nodes of a network that follows the mesh topology, which is suitable for path diversity to face indoor multipath propagation issues. The multi-hop paradigm allows end-to-end connectivity when direct range communication is not possible.",
      "ja": "説明されたシナリオに関与するデバイスは、メッシュトポロジに従うネットワークのノードであり、パスの多様性が屋内マルチパス伝播の問題に直面するのに適しています。マルチホップパラダイムは、ダイレクトレンジ通信が不可能な場合、エンドツーエンドの接続を可能にします。"
    },
    {
      "indent": 0,
      "text": "5.2. Use Case of Bluetooth LE: Smartphone-Based Interaction",
      "section_title": true,
      "ja": "5.2. Bluetooth LEのユースケース：スマートフォンベースのインタラクション"
    },
    {
      "indent": 3,
      "text": "The key feature behind the current high Bluetooth LE momentum is its support in a large majority of smartphones in the market. Bluetooth LE can be used to allow interaction between a smartphone and surrounding sensors or actuators. Furthermore, Bluetooth LE is also the main radio interface currently available in wearables. Since a smartphone typically has several radio interfaces that provide Internet access, such as Wi-Fi or cellular, a smartphone can act as a gateway for nearby devices, such as sensors, actuators, or wearables. Bluetooth LE may be used in several domains, including healthcare, sports/wellness, and home automation.",
      "ja": "現在のHigh Bluetooth Le Momentumの背後にある重要な機能は、市場の大多数のスマートフォンでのサポートです。Bluetooth Leを使用して、スマートフォンと周囲のセンサーまたはアクチュエーター間の相互作用を可能にすることができます。さらに、Bluetooth Leは、現在ウェアラブルで利用可能なメインラジオインターフェイスでもあります。スマートフォンには通常、Wi-Fiやセルラーなどのインターネットアクセスを提供するいくつかの無線インターフェイスがあるため、スマートフォンはセンサー、アクチュエータ、ウェアラブルなどの近くのデバイスのゲートウェイとして機能します。Bluetooth Leは、ヘルスケア、スポーツ/ウェルネス、ホームオートメーションなど、いくつかのドメインで使用できます。"
    },
    {
      "indent": 3,
      "text": "Example: Use of a Body Area Network Based on Bluetooth LE for Fitness",
      "ja": "例：フィットネスのためのBluetoothleに基づくボディエリアネットワークの使用"
    },
    {
      "indent": 3,
      "text": " A person wears a smartwatch for fitness purposes. The smartwatch has several sensors (e.g., heart rate, accelerometer, gyrometer, GPS, and temperature), a display, and a Bluetooth LE radio interface. The smartwatch can show fitness-related statistics on its display. However, when a paired smartphone is in range of the smartwatch, the latter can report almost real-time measurements of its sensors to the smartphone, which can forward the data to a cloud service on the Internet. 6lo enables this use case by providing efficient end-to-end IPv6 support. In addition, the smartwatch can receive notifications (e.g., alarm signals) from the cloud service via the smartphone. On the other hand, the smartphone may locally generate messages for the smartwatch, such as e-mail reception or calendar notifications.",
      "ja": "人はフィットネスのためにスマートウォッチを着用しています。スマートウォッチには、いくつかのセンサー（たとえば、心拍数、加速度計、ジャイロメーター、GPS、温度）、ディスプレイ、Bluetooth LE無線インターフェイスがあります。スマートウォッチは、そのディスプレイにフィットネス関連の統計を表示できます。ただし、ペアのスマートフォンがスマートウォッチの範囲にある場合、後者はセンサーのほぼリアルタイム測定値をスマートフォンに報告できます。これにより、データをインターネット上のクラウドサービスに転送できます。6LOは、効率的なエンドツーエンドのIPv6サポートを提供することにより、このユースケースを有効にします。さらに、スマートウォッチは、スマートフォンを介してクラウドサービスから通知（アラーム信号など）を受信できます。一方、スマートフォンは、電子メール受信やカレンダー通知など、スマートウォッチのメッセージを局所的に生成する場合があります。"
    },
    {
      "indent": 3,
      "text": "The functionality supported by the smartwatch may be complemented by other devices, such as other on-body sensors, wireless headsets, or head-mounted displays. All such devices may connect to the smartphone, creating a star topology network whereby the smartphone is the central component. Support for extended network topologies (e.g., mesh networks) is being developed as of the writing of this document.",
      "ja": "スマートウォッチでサポートされる機能は、他のボディセンサー、ワイヤレスヘッドセット、ヘッドマウントディスプレイなど、他のデバイスによって補完される場合があります。そのようなデバイスはすべてスマートフォンに接続し、スタートフォンが中央のコンポーネントであるStarトポロジネットワークを作成できます。このドキュメントの執筆時点で、拡張ネットワークトポロジ（メッシュネットワークなど）のサポートが開発されています。"
    },
    {
      "indent": 0,
      "text": "5.3. Use Case of DECT-ULE: Smart Home",
      "section_title": true,
      "ja": "5.3. Dect-uleのユースケース：スマートホーム"
    },
    {
      "indent": 3,
      "text": "DECT is a technology widely used for wireless telephone communications in residential scenarios. Since DECT-ULE is a low-power variant of DECT, DECT-ULE can be used to connect constrained devices (such as sensors and actuators) to a Fixed Part (FP), a device that typically acts as a base station for wireless telephones. In this case, additionally, the FP must have a data network connection. Therefore, DECT-ULE is especially suitable for the connected home space in application areas such as home automation, smart metering, safety, and healthcare. Since DECT-ULE uses dedicated bandwidth, it avoids this coexistence issues suffered by other technologies that use, for example, Industrial, Scientific, and Medical (ISM) frequency bands.",
      "ja": "DECTは、住宅シナリオでのワイヤレス電話通信に広く使用されている技術です。Dect-uleはDECTの低電力バリアントであるため、Dect-uleを使用して、制約付きデバイス（センサーやアクチュエーターなど）を固定部品（FP）に接続できます。。この場合、さらに、FPにはデータネットワーク接続が必要です。したがって、Dect-uleは、ホームオートメーション、スマートメーター、安全性、ヘルスケアなどのアプリケーションエリアの接続されたホームスペースに特に適しています。Dect-uleは専用の帯域幅を使用しているため、たとえば産業、科学、医療（ISM）周波数帯域を使用する他の技術が被ったこの共存の問題を回避します。"
    },
    {
      "indent": 3,
      "text": "Example: Use of DECT-ULE for Smart Metering",
      "ja": "例：スマートメータリングのためのDect-uleの使用"
    },
    {
      "indent": 3,
      "text": " The smart electricity meter of a home is equipped with a DECT-ULE transceiver. This device is in the coverage range of the FP of the home. The FP can act as a router connected to the Internet. This way, the smart meter can transmit electricity consumption readings through the DECT-ULE link with the FP, and the latter can forward such readings to the utility company using Wide Area Network (WAN) links. The meter can also receive queries from the utility company or from an advanced energy control system controlled by the user, which may also be connected to the FP via DECT-ULE.",
      "ja": "家のスマート電気メーターには、dect-uleトランシーバーが装備されています。このデバイスは、家のFPのカバレッジ範囲にあります。FPは、インターネットに接続されたルーターとして機能することができます。このようにして、スマートメーターはFPとのDECT-uleリンクを介して電力消費の測定値を送信でき、後者はそのような測定値をWide Area Network（WAN）リンクを使用してユーティリティ会社に転送できます。メーターは、ユーティリティ会社またはユーザーが制御する高度なエネルギー制御システムからクエリを受信することもできます。これは、Dect-uleを介してFPに接続される場合があります。"
    },
    {
      "indent": 0,
      "text": "5.4. Use Case of MS/TP: Building Automation Networks",
      "section_title": true,
      "ja": "5.4. MS/TPのユースケース：自動化ネットワークの構築"
    },
    {
      "indent": 3,
      "text": "The primary use case for IPv6 over MS/TP (6LoBAC) is in building automation networks. [BACnet] is the open, international standard protocol for building automation, and MS/TP is defined in [BACnet] Clause 9. MS/TP was designed to be a low-cost, multi-drop field bus to interconnect the most numerous elements (sensors and actuators) of a building automation network to their controllers. A key aspect of 6LoBAC is that it is designed to co-exist with BACnet MS/TP on the same link, easing the ultimate transition of some BACnet networks to fundamental end-to-end IPv6 transport protocols. New applications for 6LoBAC may be found in other domains where low cost, long distance, and low latency are required. Note that BACnet comprises various networking solutions other than MS/TP, including the recently emerged BACnet IP. However, the latter is based on high-speed Ethernet infrastructure, and it is outside of the constrained-node network scope.",
      "ja": "MS/TP（6LOBAC）を超えるIPv6の主要なユースケースは、自動化ネットワークの構築にあります。[BACNET]は、自動化のためのオープンな国際標準プロトコルであり、MS/TPは[BACNET]節9で定義されています。MS/TPは、最も多くの要素を相互接続するための低コストのマルチドロップフィールドバスになるように設計されています。建物の自動化ネットワークの（センサーとアクチュエーター）コントローラーへの。6loBACの重要な側面は、同じリンクでBACNET MS/TPと共存するように設計されており、一部のBACNETネットワークの基本的なエンドツーエンドのIPv6輸送プロトコルへの最終的な遷移を緩和することです。6lobacの新しいアプリケーションは、低コスト、長距離、および低遅延が必要な他のドメインで見つけることができます。BACNETは、最近出現したBACNET IPを含むMS/TP以外のさまざまなネットワークソリューションで構成されていることに注意してください。ただし、後者は高速イーサネットインフラストラクチャに基づいており、制約付きノードネットワークスコープの外側にあります。"
    },
    {
      "indent": 3,
      "text": "Example: Use of 6LoBAC in Building Automation Networks",
      "ja": "例：自動化ネットワークの構築における6lobacの使用"
    },
    {
      "indent": 3,
      "text": " The majority of installations for MS/TP are for \"terminal\" or \"unitary\" controllers, i.e., single zone or room controllers that may connect to HVAC or other controls such as lighting or blinds. The economics of daisy chaining a single twisted pair between multiple devices is often preferred over home-run, Cat-5-style wiring.",
      "ja": "MS/TPのインストールの大部分は、「ターミナル」または「単一」コントローラー、つまり、HVACまたは照明やブラインドなどの他のコントロールに接続する可能性のある単一ゾーンまたはルームコントローラー用です。複数のデバイス間で単一のねじれたペアを連れて行くデイジーの経済学は、多くの場合、ホームランのCAT-5スタイルの配線よりも好まれます。"
    },
    {
      "indent": 3,
      "text": "A multi-zone controller might be implemented as an IP router between a classical Ethernet link and several 6LoBAC links, fanning out to multiple terminal controllers.",
      "ja": "マルチゾーンコントローラーは、クラシックイーサネットリンクといくつかの6LOBACリンクの間のIPルーターとして実装され、複数の端子コントローラーに扇動されます。"
    },
    {
      "indent": 3,
      "text": "The superior distance capabilities of MS/TP (~1 km) compared to other 6lo media may suggest its use in applications to connect remote devices to the nearest building infrastructure. For example, remote pumping or measuring stations with moderate bandwidth requirements can benefit from the low-cost and robust capabilities of MS/TP over other wired technologies such as DSL, without the line-of-sight restrictions or hop-by-hop latency of many low-cost wireless solutions.",
      "ja": "他の6LOメディアと比較してMS/TP（〜1 km）の優れた距離機能は、リモートデバイスを最も近い建物インフラストラクチャに接続するためのアプリケーションでの使用を示唆する場合があります。たとえば、中程度の帯域幅の要件を備えたリモートポンプまたは測定ステーションは、DSLなどの他の有線技術を介したMS/TPの低コストで堅牢な機能の恩恵を受けることができます。多くの低コストのワイヤレスソリューション。"
    },
    {
      "indent": 0,
      "text": "5.5. Use Case of NFC: Alternative Secure Transfer",
      "section_title": true,
      "ja": "5.5. NFCのユースケース：代替セキュアな転送"
    },
    {
      "indent": 3,
      "text": "In different applications, a variety of secured data can be handled and transferred. Depending on the security level of the data, different transfer methods can be alternatively selected.",
      "ja": "さまざまなアプリケーションでは、さまざまな保護されたデータを処理および転送できます。データのセキュリティレベルに応じて、異なる転送方法を選択して選択できます。"
    },
    {
      "indent": 3,
      "text": "Example: Use of NFC for Secure Transfer in Healthcare Services with Tele-Assistance",
      "ja": "例：Tele-Assistanceを使用したヘルスケアサービスにおける安全な転送のためのNFCの使用"
    },
    {
      "indent": 3,
      "text": " An older adult who lives alone wears one to several wearable 6lo devices to measure heartbeat, pulse rate, etc. Other 6lo devices are densely installed at home for movement detection. A 6LBR at home will send the sensed information to a connected healthcare center. Portable base stations with displays may be used to check the data at home, as well. Data is gathered in both periodic and event-driven fashion. In this application, event-driven data can be very time critical. In addition, privacy becomes a serious issue in this case, as the sensed data is very personal.",
      "ja": "一人暮らしの高齢者は、ハートビート、パルスレートなどを測定するために1〜複数のウェアラブル6LOデバイスを着用します。他の6LOデバイスは、運動検出のために自宅に密に設置されています。自宅の6LBRは、感知された情報を接続されたヘルスケアセンターに送信します。ディスプレイ付きのポータブルベースステーションは、自宅のデータを確認するためにも使用できます。データは、定期的な方法とイベント主導の両方の方法で収集されます。このアプリケーションでは、イベント駆動型のデータは非常に時間的に重要です。さらに、この場合、センセッドデータは非常に個人的なものであるため、プライバシーが深刻な問題になります。"
    },
    {
      "indent": 3,
      "text": "While the older adult is provided audio and video healthcare services by a tele-assistance based on cellular connections, the older adult can alternatively use NFC connections to transfer the personal sensed data to the tele-assistance. Hackers can overhear the data based on the cellular connection, but they cannot gather the personal data over the NFC connection.",
      "ja": "高齢者には、携帯電話接続に基づいたテレアシスタンスによってオーディオおよびビデオヘルスケアサービスが提供されますが、高齢者はNFC接続を使用して、個人の検知データをテレアシスタンスに転送することができます。ハッカーは、セルラー接続に基づいてデータを耳にすることができますが、NFC接続を介して個人データを収集することはできません。"
    },
    {
      "indent": 0,
      "text": "5.6. Use Case of PLC: Smart Grid",
      "section_title": true,
      "ja": "5.6. PLCのユースケース：スマートグリッド"
    },
    {
      "indent": 3,
      "text": "The smart grid concept is based on deploying numerous operational and energy measuring subsystems in an electricity grid system. It comprises multiple administrative levels and segments to provide connectivity among these numerous components. Last mile connectivity is established over the Low-Voltage segment, whereas connectivity over electricity distribution takes place over the High-Voltage segment. Smart grid systems include AMI, Demand Response, Home Energy Management System, and Wide Area Situational Awareness (WASA), among others.",
      "ja": "スマートグリッドの概念は、電気グリッドシステムに多数の運用およびエネルギー測定サブシステムを展開することに基づいています。これらの多数のコンポーネント間で接続性を提供するための複数の管理レベルとセグメントで構成されています。最後のマイル接続は低電圧セグメントにわたって確立されていますが、電力分布に対する接続性は高電圧セグメントで行われます。スマートグリッドシステムには、AMI、需要対応、ホームエネルギー管理システム、広範な状況認識（WASA）などがあります。"
    },
    {
      "indent": 3,
      "text": "Although other wired and wireless technologies are also used in a smart grid, PLC benefits from reliable data communication over electrical power lines that are already present, and the deployment cost can be comparable to wireless technologies. The 6lo-related scenarios for PLC mainly lie in the Low-Voltage PLC networks with most applications in the area of advanced metering infrastructure, vehicle-to-grid communications, in-home energy management, and smart street lighting.",
      "ja": "他の有線技術とワイヤレステクノロジーもスマートグリッドで使用されていますが、PLCはすでに存在している電力線を介した信頼できるデータ通信の恩恵を受け、展開コストはワイヤレステクノロジーに匹敵する可能性があります。PLCの6LO関連シナリオは、主に、高度な計量インフラストラクチャ、車両間通信、在宅エネルギー管理、スマートストリート照明の分野にほとんどのアプリケーションを備えた低電圧PLCネットワークにあります。"
    },
    {
      "indent": 3,
      "text": "Example: Use of PLC for AMI",
      "ja": "例：AMIのPLCの使用"
    },
    {
      "indent": 3,
      "text": " Household electricity meters transmit time-based data of electric power consumption through PLC. Data concentrators receive all the meter data in their corresponding living districts and send them to the Meter Data Management System through a WAN network (e.g., Medium-Voltage PLC, Ethernet, or General Packet Radio Service (GPRS)) for storage and analysis. Two-way communications are enabled, which means smart meters can perform actions like notification of electricity charges according to the commands from the utility company.",
      "ja": "家庭用電力メーターは、PLCを介して電力消費の時間ベースのデータを送信します。データコンセントレーターは、対応するリビング地区のすべてのメーターデータを受け取り、WANネットワーク（例：中電圧PLC、イーサネット、または一般的なパケット無線サービス（GPRS））を介してメーターデータ管理システムに送信します。双方向通信が有効になっています。つまり、スマートメーターは、ユーティリティ会社のコマンドに従って電気料金の通知などのアクションを実行できます。"
    },
    {
      "indent": 3,
      "text": "With the existing power line infrastructure as a communication medium, the cost of building up the PLC network is naturally saved, and more importantly, labor and operational costs can be minimized from a long-term perspective. Furthermore, this AMI application speeds up electricity charging, reduces losses by restraining power theft, and helps to manage the health of the grid based on line loss analysis.",
      "ja": "既存の電力線インフラストラクチャが通信媒体としてあるため、PLCネットワークを構築するコストは自然に節約され、さらに重要なことに、労働と運用コストは長期的な観点から最小限に抑えることができます。さらに、このAMIアプリケーションは、電力充電をスピードアップし、電力盗難を抑制することで損失を減らし、ライン損失分析に基づいてグリッドの健康を管理するのに役立ちます。"
    },
    {
      "indent": 3,
      "text": "Example: Use of PLC (IEEE Std 1901.1) for WASA in a Smart Grid",
      "ja": "例：スマートグリッドでのワサのPLC（IEEE STD 1901.1）の使用"
    },
    {
      "indent": 3,
      "text": " Many subsystems of a smart grid require low data rates, and narrowband variants (e.g., IEEE Std 1901.1) of PLC fulfill such requirements. Recently, more complex scenarios are emerging that require higher data rates.",
      "ja": "スマートグリッドの多くのサブシステムには、低データレートが必要であり、PLCの狭帯域バリアント（IEEE STD 1901.1）がそのような要件を満たしています。最近、より高いデータレートを必要とするより複雑なシナリオが出現しています。"
    },
    {
      "indent": 3,
      "text": "A WASA subsystem is an appropriate example that collects large amounts of information about the current state of the grid over a wide area from electric substations as well as power transmission lines. The collected feedback is used for monitoring, controlling, and protecting all the subsystems.",
      "ja": "WASAサブシステムは、電力変電所からの広い領域にわたってグリッドの現在の状態に関する大量の情報を収集する適切な例です。収集されたフィードバックは、すべてのサブシステムの監視、制御、保護に使用されます。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document has no IANA actions.",
      "ja": "このドキュメントにはIANAアクションがありません。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "ja": "7. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "This document does not create security concerns in addition to those described in the Security Considerations sections of the 6lo adaptation layers considered in this document [RFC7428], [RFC7668], [RFC8105], [RFC8163], [RFC9159], [RFC9428], and [RFC9354].",
      "ja": "このドキュメントは、このドキュメント[RFC7428]、[RFC7668]、[RFC8105]、[RFC8163]、[RFC9159]、[RFC9428]、[RFC7428]、[RFC8105]、[RFC8163]、[RFC9428]、[RFC7428]、[RFC8105]、[RFC9159]）で検討されている6LO適応層のセキュリティに関する考慮事項セクションに記載されているものに加えて、セキュリティ上の懸念を作成するものではありません。および[RFC9354]。"
    },
    {
      "indent": 3,
      "text": "Neighbor Discovery in 6lo links may be susceptible to threats as detailed in [RFC3756]. Mesh routing is expected to be common in some 6lo networks, such as ITU-T G.9959 networks, Bluetooth LE mesh networks, and PLC networks. This implies additional threats due to ad hoc routing as per [KW03]. Most of the L2 technologies considered in this document (i.e., ITU-T G.9959, Bluetooth LE, DECT-ULE, and PLC) support link-layer security. Making use of such provisions will alleviate the threats mentioned above. Note that NFC is often considered to offer intrinsic security properties due to its short link range. MS/TP does not support link-layer security, since in its original BACnet protocol stack, security is provided at the network layer; thus, alternative security functionality needs to be used for a 6lo-based protocol stack over MS/TP.",
      "ja": "6LOリンクでの隣接発見は、[RFC3756]で詳述されているように、脅威の影響を受けやすい場合があります。メッシュルーティングは、ITU-T G.9959ネットワーク、Bluetooth LEメッシュネットワーク、PLCネットワークなど、約6LOネットワークで一般的であると予想されます。これは、[KW03]に従ってアドホックルーティングによる追加の脅威を意味します。このドキュメントで検討されているL2技術のほとんど（つまり、ITU-T G.9959、Bluetooth LE、Dect-ule、およびPLC）は、リンク層セキュリティをサポートしています。そのような規定を利用することで、上記の脅威が軽減されます。NFCは、リンクの範囲が短いため、本質的なセキュリティプロパティを提供するとしばしば考慮されていることに注意してください。MS/TPは、元のBacnetプロトコルスタックでは、セキュリティがネットワークレイヤーで提供されるため、リンク層セキュリティをサポートしていません。したがって、MS/TPを介した6LOベースのプロトコルスタックには、代替セキュリティ機能を使用する必要があります。"
    },
    {
      "indent": 3,
      "text": "End-to-end communication is expected to be secured by means of common mechanisms, such as IPsec, DTLS/TLS, Object Security [RFC8613], and Ephemeral Diffie-Hellman Over COSE (EDHOC) [EDHOC].",
      "ja": "エンドツーエンドの通信は、IPSEC、DTLS/TLS、オブジェクトセキュリティ[RFC8613]、COSE（EDHOC）を超えるEphemeral Diffie-Hellmanなどの一般的なメカニズムを使用して保護されると予想されます。"
    },
    {
      "indent": 3,
      "text": "The 6lo stack uses the IPv6 addressing model. The implications for privacy and network performance of using L2-address-derived IPv6 addresses need to be considered [RFC8065].",
      "ja": "6LOスタックは、IPv6アドレス指定モデルを使用します。L2-Address由来のIPv6アドレスを使用することのプライバシーとネットワークパフォーマンスへの影響を考慮する必要があります[RFC8065]。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8. 参考文献"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "ja": "8.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC4861]  Narten, T., Nordmark, E., Simpson, W., and H. Soliman,\n           \"Neighbor Discovery for IP version 6 (IPv6)\", RFC 4861,\n           DOI 10.17487/RFC4861, September 2007,\n           <https://www.rfc-editor.org/info/rfc4861>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC4862]  Thomson, S., Narten, T., and T. Jinmei, \"IPv6 Stateless\n           Address Autoconfiguration\", RFC 4862,\n           DOI 10.17487/RFC4862, September 2007,\n           <https://www.rfc-editor.org/info/rfc4862>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC4919]  Kushalnagar, N., Montenegro, G., and C. Schumacher, \"IPv6\n           over Low-Power Wireless Personal Area Networks (6LoWPANs):\n           Overview, Assumptions, Problem Statement, and Goals\",\n           RFC 4919, DOI 10.17487/RFC4919, August 2007,\n           <https://www.rfc-editor.org/info/rfc4919>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC4944]  Montenegro, G., Kushalnagar, N., Hui, J., and D. Culler,\n           \"Transmission of IPv6 Packets over IEEE 802.15.4\n           Networks\", RFC 4944, DOI 10.17487/RFC4944, September 2007,\n           <https://www.rfc-editor.org/info/rfc4944>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC6568]  Kim, E., Kaspar, D., and JP. Vasseur, \"Design and\n           Application Spaces for IPv6 over Low-Power Wireless\n           Personal Area Networks (6LoWPANs)\", RFC 6568,\n           DOI 10.17487/RFC6568, April 2012,\n           <https://www.rfc-editor.org/info/rfc6568>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC6606]  Kim, E., Kaspar, D., Gomez, C., and C. Bormann, \"Problem\n           Statement and Requirements for IPv6 over Low-Power\n           Wireless Personal Area Network (6LoWPAN) Routing\",\n           RFC 6606, DOI 10.17487/RFC6606, May 2012,\n           <https://www.rfc-editor.org/info/rfc6606>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC7228]  Bormann, C., Ersue, M., and A. Keranen, \"Terminology for\n           Constrained-Node Networks\", RFC 7228,\n           DOI 10.17487/RFC7228, May 2014,\n           <https://www.rfc-editor.org/info/rfc7228>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC7400]  Bormann, C., \"6LoWPAN-GHC: Generic Header Compression for\n           IPv6 over Low-Power Wireless Personal Area Networks\n           (6LoWPANs)\", RFC 7400, DOI 10.17487/RFC7400, November\n           2014, <https://www.rfc-editor.org/info/rfc7400>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC7428]  Brandt, A. and J. Buron, \"Transmission of IPv6 Packets\n           over ITU-T G.9959 Networks\", RFC 7428,\n           DOI 10.17487/RFC7428, February 2015,\n           <https://www.rfc-editor.org/info/rfc7428>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC7668]  Nieminen, J., Savolainen, T., Isomaki, M., Patil, B.,\n           Shelby, Z., and C. Gomez, \"IPv6 over BLUETOOTH(R) Low\n           Energy\", RFC 7668, DOI 10.17487/RFC7668, October 2015,\n           <https://www.rfc-editor.org/info/rfc7668>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC8105]  Mariager, P., Petersen, J., Ed., Shelby, Z., Van de Logt,\n           M., and D. Barthel, \"Transmission of IPv6 Packets over\n           Digital Enhanced Cordless Telecommunications (DECT) Ultra\n           Low Energy (ULE)\", RFC 8105, DOI 10.17487/RFC8105, May\n           2017, <https://www.rfc-editor.org/info/rfc8105>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC8163]  Lynn, K., Ed., Martocci, J., Neilson, C., and S.\n           Donaldson, \"Transmission of IPv6 over Master-Slave/Token-\n           Passing (MS/TP) Networks\", RFC 8163, DOI 10.17487/RFC8163,\n           May 2017, <https://www.rfc-editor.org/info/rfc8163>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC8200]  Deering, S. and R. Hinden, \"Internet Protocol, Version 6\n           (IPv6) Specification\", STD 86, RFC 8200,\n           DOI 10.17487/RFC8200, July 2017,\n           <https://www.rfc-editor.org/info/rfc8200>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC9159]  Gomez, C., Darroudi, S.M., Savolainen, T., and M. Spoerk,\n           \"IPv6 Mesh over BLUETOOTH(R) Low Energy Using the Internet\n           Protocol Support Profile (IPSP)\", RFC 9159,\n           DOI 10.17487/RFC9159, December 2021,\n           <https://www.rfc-editor.org/info/rfc9159>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC9354]  Hou, J., Liu, B., Hong, Y-G., Tang, X., and C. Perkins,\n           \"Transmission of IPv6 Packets over Power Line\n           Communication (PLC) Networks\", RFC 9354,\n           DOI 10.17487/RFC9354, January 2023,\n           <https://www.rfc-editor.org/info/rfc9354>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "ja": "8.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[BACnet]   ASHRAE, \"BACnet-A Data Communication Protocol for Building\n           Automation and Control Networks (ANSI Approved)\", ASHRAE\n           Standard 135-2020, October 2020,\n           <https://www.techstreet.com/standards/ashrae-\n           135-2020?product_id=2191852>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[BTCorev5.4]\n           Bluetooth, \"Core Specification Version 5.4\", January 2012,\n           <https://www.bluetooth.com/specifications/specs/core-\n           specification-5-4/>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[EDHOC]    Selander, G., Preuß Mattsson, J., and F. Palombini,\n           \"Ephemeral Diffie-Hellman Over COSE (EDHOC)\", Work in\n           Progress, Internet-Draft, draft-ietf-lake-edhoc-22, 25\n           August 2023, <https://datatracker.ietf.org/doc/html/draft-\n           ietf-lake-edhoc-22>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[G.9903]   ITU-T, \"Narrowband orthogonal frequency division\n           multiplexing power line communication transceivers for\n           G3-PLC networks\", ITU-T Recommendation G.9903, August\n           2017, <https://www.itu.int/rec/T-REC-G.9903-201708-I/en>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[G.9959]   ITU-T, \"Short range narrow-band digital radiocommunication\n           transceivers - PHY, MAC, SAR and LLC layer\n           specifications\", ITU-T Recommendation G.9959, January\n           2015, <https://www.itu.int/rec/T-REC-G.9959-201501-I/en>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[G3-PLC]   \"G3-Alliance\", <https://g3-plc.com>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[IEEE-1901]\n           IEEE, \"IEEE Standard for Broadband over Power Line\n           Networks: Medium Access Control and Physical Layer\n           Specifications\", DOI 10.1109/IEEESTD.2010.5678772, IEEE\n           Std 1901-2010, December 2010,\n           <https://standards.ieee.org/ieee/1901/4953/>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[IEEE-1901.1]\n           IEEE, \"IEEE Standard for Medium Frequency (less than 12\n           MHz) Power Line Communications for Smart Grid\n           Applications\", DOI 10.1109/IEEESTD.2018.8360785, IEEE\n           Std 1901.1-2018, May 2018,\n           <https://ieeexplore.ieee.org/document/8360785>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[IEEE-1901.2]\n           IEEE, \"IEEE Standard for Low-Frequency (less than 500 kHz)\n           Narrowband Power Line Communications for Smart Grid\n           Applications\", DOI 10.1109/IEEESTD.2013.6679210, IEEE\n           Std 1901.2-2013, December 2013,\n           <https://standards.ieee.org/ieee/1901.2/4833/>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[IEEE-802.15.4]\n           IEEE, \"IEEE Standard for Low-Rate Wireless Networks\",\n           DOI 10.1109/IEEESTD.2020.9144691, IEEE Std 802.15.4-2020,\n           July 2020,\n           <https://standards.ieee.org/ieee/802.15.4/7029/>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[IEEE-802.15.9]\n           IEEE, \"IEEE Standard for Transport of Key Management\n           Protocol (KMP) Datagrams\",\n           DOI 10.1109/IEEESTD.2022.9690134, IEEE Std 802.15.9-2021,\n           January 2022,\n           <https://ieeexplore.ieee.org/document/9690134>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[IPSP]     Bluetooth, \"Internet Protocol Support Profile 1.0\",\n           December 2014,\n           <https://www.bluetooth.com/specifications/specs/internet-\n           protocol-support-profile-1-0/>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[KW03]     Karlof, C. and D. Wagner, \"Secure routing in wireless\n           sensor networks: attacks and countermeasures\", Volume 1,\n           Issues 2-3, Pages 293-315,\n           DOI 10.1016/S1570-8705(03)00008-8, September 2003,\n           <https://doi.org/10.1016/S1570-8705(03)00008-8>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[LLCP-1.4] NFC Forum, \"Logical Link Control Protocol Technical\n           Specification\", Version 1.4, December 2022, <https://nfc-\n           forum.org/build/specifications/logical-link-control-\n           protocol-technical-specification/>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[NETRICITY]\n           Netricity, \"The Netricity program addresses the need for\n           long range powerline networking for outside-the-home,\n           smart meter-to-grid, and industrial control applications\",\n           <https://www.netricity.org/>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC3756]  Nikander, P., Ed., Kempf, J., and E. Nordmark, \"IPv6\n           Neighbor Discovery (ND) Trust Models and Threats\",\n           RFC 3756, DOI 10.17487/RFC3756, May 2004,\n           <https://www.rfc-editor.org/info/rfc3756>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC6282]  Hui, J., Ed. and P. Thubert, \"Compression Format for IPv6\n           Datagrams over IEEE 802.15.4-Based Networks\", RFC 6282,\n           DOI 10.17487/RFC6282, September 2011,\n           <https://www.rfc-editor.org/info/rfc6282>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC6550]  Winter, T., Ed., Thubert, P., Ed., Brandt, A., Hui, J.,\n           Kelsey, R., Levis, P., Pister, K., Struik, R., Vasseur,\n           JP., and R. Alexander, \"RPL: IPv6 Routing Protocol for\n           Low-Power and Lossy Networks\", RFC 6550,\n           DOI 10.17487/RFC6550, March 2012,\n           <https://www.rfc-editor.org/info/rfc6550>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC6620]  Nordmark, E., Bagnulo, M., and E. Levy-Abegnoli, \"FCFS\n           SAVI: First-Come, First-Served Source Address Validation\n           Improvement for Locally Assigned IPv6 Addresses\",\n           RFC 6620, DOI 10.17487/RFC6620, May 2012,\n           <https://www.rfc-editor.org/info/rfc6620>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC6775]  Shelby, Z., Ed., Chakrabarti, S., Nordmark, E., and C.\n           Bormann, \"Neighbor Discovery Optimization for IPv6 over\n           Low-Power Wireless Personal Area Networks (6LoWPANs)\",\n           RFC 6775, DOI 10.17487/RFC6775, November 2012,\n           <https://www.rfc-editor.org/info/rfc6775>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC8065]  Thaler, D., \"Privacy Considerations for IPv6 Adaptation-\n           Layer Mechanisms\", RFC 8065, DOI 10.17487/RFC8065,\n           February 2017, <https://www.rfc-editor.org/info/rfc8065>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC8066]  Chakrabarti, S., Montenegro, G., Droms, R., and J.\n           Woodyatt, \"IPv6 over Low-Power Wireless Personal Area\n           Network (6LoWPAN) ESC Dispatch Code Points and\n           Guidelines\", RFC 8066, DOI 10.17487/RFC8066, February\n           2017, <https://www.rfc-editor.org/info/rfc8066>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC8138]  Thubert, P., Ed., Bormann, C., Toutain, L., and R. Cragie,\n           \"IPv6 over Low-Power Wireless Personal Area Network\n           (6LoWPAN) Routing Header\", RFC 8138, DOI 10.17487/RFC8138,\n           April 2017, <https://www.rfc-editor.org/info/rfc8138>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC8352]  Gomez, C., Kovatsch, M., Tian, H., and Z. Cao, Ed.,\n           \"Energy-Efficient Features of Internet of Things\n           Protocols\", RFC 8352, DOI 10.17487/RFC8352, April 2018,\n           <https://www.rfc-editor.org/info/rfc8352>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC8376]  Farrell, S., Ed., \"Low-Power Wide Area Network (LPWAN)\n           Overview\", RFC 8376, DOI 10.17487/RFC8376, May 2018,\n           <https://www.rfc-editor.org/info/rfc8376>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC8505]  Thubert, P., Ed., Nordmark, E., Chakrabarti, S., and C.\n           Perkins, \"Registration Extensions for IPv6 over Low-Power\n           Wireless Personal Area Network (6LoWPAN) Neighbor\n           Discovery\", RFC 8505, DOI 10.17487/RFC8505, November 2018,\n           <https://www.rfc-editor.org/info/rfc8505>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC8613]  Selander, G., Preuß Mattsson, J., Palombini, F., and L.\n           Seitz, \"Object Security for Constrained RESTful\n           Environments (OSCORE)\", RFC 8613, DOI 10.17487/RFC8613,\n           July 2019, <https://www.rfc-editor.org/info/rfc8613>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC8928]  Thubert, P., Ed., Sarikaya, B., Sethi, M., and R. Struik,\n           \"Address-Protected Neighbor Discovery for Low-Power and\n           Lossy Networks\", RFC 8928, DOI 10.17487/RFC8928, November\n           2020, <https://www.rfc-editor.org/info/rfc8928>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC8929]  Thubert, P., Ed., Perkins, C.E., and E. Levy-Abegnoli,\n           \"IPv6 Backbone Router\", RFC 8929, DOI 10.17487/RFC8929,\n           November 2020, <https://www.rfc-editor.org/info/rfc8929>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC9008]  Robles, M.I., Richardson, M., and P. Thubert, \"Using RPI\n           Option Type, Routing Header for Source Routes, and IPv6-\n           in-IPv6 Encapsulation in the RPL Data Plane\", RFC 9008,\n           DOI 10.17487/RFC9008, April 2021,\n           <https://www.rfc-editor.org/info/rfc9008>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC9010]  Thubert, P., Ed. and M. Richardson, \"Routing for RPL\n           (Routing Protocol for Low-Power and Lossy Networks)\n           Leaves\", RFC 9010, DOI 10.17487/RFC9010, April 2021,\n           <https://www.rfc-editor.org/info/rfc9010>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC9035]  Thubert, P., Ed. and L. Zhao, \"A Routing Protocol for Low-\n           Power and Lossy Networks (RPL) Destination-Oriented\n           Directed Acyclic Graph (DODAG) Configuration Option for\n           the 6LoWPAN Routing Header\", RFC 9035,\n           DOI 10.17487/RFC9035, April 2021,\n           <https://www.rfc-editor.org/info/rfc9035>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC9428]  Choi, Y., Ed., Hong, Y., and J. Youn, \"Transmission of\n           IPv6 Packets over Near Field Communication\", RFC 9428,\n           DOI 10.17487/RFC9428, July 2023,\n           <https://www.rfc-editor.org/info/rfc9428>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[SEC-PROT-COMP]\n           Preuß Mattsson, J., Palombini, F., and M. Vučinić,\n           \"Comparison of CoAP Security Protocols\", Work in Progress,\n           Internet-Draft, draft-ietf-iotops-security-protocol-\n           comparison-02, 11 April 2023,\n           <https://datatracker.ietf.org/doc/html/draft-ietf-iotops-\n           security-protocol-comparison-02>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[Thread]   Thread, \"Resources\",\n           <https://www.threadgroup.org/Support>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[TIA-485-A]\n           TIA, \"Electrical Characteristics of Generators and\n           Receivers for Use in Balanced Digital Multipoint Systems\",\n           TIA-485-A, Revision of TIA-485, March 1998,\n           <https://global.ihs.com/\n           doc_detail.cfm?item_s_key=00032964>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[TS102.939-1]\n           ETSI, \"Digital Enhanced Cordless Telecommunications\n           (DECT); Ultra Low Energy (ULE); Machine to Machine\n           Communications; Part 1: Home Automation Network (phase\n           1)\", V1.2.1, ETSI-TS 102 939-1, March 2015,\n           <https://www.etsi.org/deliver/\n           etsi_ts/102900_102999/10293901/01.02.01_60/\n           ts_10293901v010201p.pdf>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[TS102.939-2]\n           ETSI, \"Digital Enhanced Cordless Telecommunications\n           (DECT); Ultra Low Energy (ULE); Machine to Machine\n           Communications; Part 2: Home Automation Network (phase\n           2)\", V1.1.1, ETSI TS 102 939-2, March 2015,\n           <https://www.etsi.org/deliver/\n           etsi_ts/102900_102999/10293902/01.01.01_60/\n           ts_10293902v010101p.pdf>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[Wi-SUN]   \"Wi-SUN Alliance\", <https://www.wi-sun.org>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Appendix A. Design Space Dimensions for 6lo Deployment",
      "section_title": true,
      "ja": "付録A. 6LO展開用のスペース寸法を設計します"
    },
    {
      "indent": 3,
      "text": "[RFC6568] lists the dimensions used to describe the design space of wireless sensor networks in the context of the 6LoWPAN Working Group. The design space is already limited by the unique characteristics of a LoWPAN (e.g., low power, short range, low bit rate). In Section 2 of [RFC6568], the following design space dimensions are described: Deployment, Network Size, Power Source, Connectivity, Multi-Hop Communication, Traffic Pattern, Mobility, and Quality of Service (QoS). However, in this document, the following design space dimensions are considered:",
      "ja": "[RFC6568]は、6Lowpanワーキンググループのコンテキストでワイヤレスセンサーネットワークの設計スペースを説明するために使用される寸法をリストしています。設計スペースは、ローパンのユニークな特性によってすでに制限されています（たとえば、低電力、短距離、低ビットレート）。[RFC6568]のセクション2では、展開、ネットワークサイズ、電源、接続、マルチホップ通信、トラフィックパターン、モビリティ、およびサービス品質（QO）の設計スペースの寸法について説明します。ただし、このドキュメントでは、次の設計空間寸法が考慮されます。"
    },
    {
      "indent": 3,
      "text": "Deployment/Bootstrapping:",
      "ja": "展開/ブートストラップ："
    },
    {
      "indent": 12,
      "text": "6lo nodes can be connected randomly or in an organized manner. The bootstrapping has different characteristics for each link-layer technology.",
      "ja": "6LOノードは、ランダムに接続するか、組織化された方法で接続できます。ブートストラップには、リンク層テクノロジーごとに異なる特性があります。"
    },
    {
      "indent": 3,
      "text": "Topology:",
      "ja": "トポロジー："
    },
    {
      "indent": 12,
      "text": "Topology of 6lo networks may inherently follow the characteristics of each link-layer technology. Point-to-point, star, tree, or mesh topologies can be configured, depending on the link-layer technology considered.",
      "ja": "6LOネットワークのトポロジーは、各リンク層技術の特性に本質的に従う可能性があります。ポイントツーポイント、スター、ツリー、またはメッシュトポロジは、考慮されるリンク層テクノロジーに応じて、構成できます。"
    },
    {
      "indent": 3,
      "text": "L2-mesh or L3-mesh:",
      "ja": "l2-meshまたはl3-mesh："
    },
    {
      "indent": 12,
      "text": "L2-mesh and L3-mesh may inherently follow the characteristics of each link-layer technology. Some link-layer technologies may support L2-mesh and some may not.",
      "ja": "L2-MeshとL3-Meshは、各リンク層技術の特性に本質的に従うことがあります。リンク層テクノロジーにはL2-Meshをサポートする場合もあれば、そうでない場合もあります。"
    },
    {
      "indent": 3,
      "text": "Multi-link Subnet and Single Subnet:",
      "ja": "マルチリンクサブネットとシングルサブネット："
    },
    {
      "indent": 12,
      "text": "The selection of a multi-link subnet and a single subnet depends on connectivity and the number of 6lo nodes.",
      "ja": "マルチリンクサブネットと単一のサブネットの選択は、接続性と6LOノードの数に依存します。"
    },
    {
      "indent": 3,
      "text": "Data Rate:",
      "ja": "データレート："
    },
    {
      "indent": 12,
      "text": "Typically, the link-layer technologies of 6lo have a low rate of data transmission. However, by adjusting the MTU, it can deliver a higher upper-layer data rate.",
      "ja": "通常、6LOのリンク層テクノロジーのデータ送信率は低くなっています。ただし、MTUを調整することにより、より高い高層データレートを提供できます。"
    },
    {
      "indent": 3,
      "text": "Buffering Requirements:",
      "ja": "バッファリング要件："
    },
    {
      "indent": 12,
      "text": "Some 6lo use case may require a higher data rate than the link-layer technology support. In this case, a buffering mechanism, telling the application to throttle its generation of data, and compression of the data are possible to manage the data.",
      "ja": "約6LOのユースケースでは、リンク層テクノロジーサポートよりも高いデータレートが必要になる場合があります。この場合、バッファリングメカニズムは、データの生成をスロットルするためのアプリケーションを指示し、データを管理するためにデータの圧縮が可能です。"
    },
    {
      "indent": 3,
      "text": "Security and Privacy Requirements:",
      "ja": "セキュリティとプライバシーの要件："
    },
    {
      "indent": 12,
      "text": "Some 6lo use cases can involve transferring some important and personal data between 6lo nodes. In this case, high-level security support is required.",
      "ja": "いくつかの6LOユースケースには、6LOノード間でいくつかの重要な個人データを転送することが含まれます。この場合、高レベルのセキュリティサポートが必要です。"
    },
    {
      "indent": 3,
      "text": "Mobility across 6lo Networks and Subnets:",
      "ja": "6LOネットワークとサブネットのモビリティ："
    },
    {
      "indent": 12,
      "text": "The movement of 6lo nodes depends on the 6lo use case. If the 6lo nodes can move or be moved around, a mobility management mechanism is required.",
      "ja": "6LOノードの動きは、6LOユースケースに依存します。6LOノードが移動したり、移動したりできる場合は、モビリティ管理メカニズムが必要です。"
    },
    {
      "indent": 3,
      "text": "Time Synchronization Requirements:",
      "ja": "時間同期の要件："
    },
    {
      "indent": 12,
      "text": "The requirement of time synchronization of the upper-layer service is dependent on the use case. For some 6lo use cases related to health service, the measured data must be recorded with the exact time.",
      "ja": "上層層サービスの時間同期の要件は、ユースケースに依存します。健康サービスに関連する約6LOのユースケースの場合、測定されたデータは正確な時間とともに記録する必要があります。"
    },
    {
      "indent": 3,
      "text": "Reliability and QoS:",
      "ja": "信頼性とQos："
    },
    {
      "indent": 12,
      "text": "Some 6lo use cases require high reliability, for example, real-time or health-related services.",
      "ja": "6LOのユースケースには、リアルタイムや健康関連のサービスなど、高い信頼性が必要です。"
    },
    {
      "indent": 3,
      "text": "Traffic Patterns:",
      "ja": "交通パターン："
    },
    {
      "indent": 12,
      "text": "6lo use cases may involve various traffic patterns. For example, some 6lo use cases may require short data lengths and random transmission. Some 6lo use cases may require continuous data transmission and discontinuous data transmission.",
      "ja": "6LOユースケースには、さまざまなトラフィックパターンが含まれる場合があります。たとえば、6LOのユースケースでは、データの長さとランダム伝送が必要になる場合があります。いくつかの6LOユースケースでは、継続的なデータ送信と不連続データ送信が必要になる場合があります。"
    },
    {
      "indent": 3,
      "text": "Security Bootstrapping:",
      "ja": "セキュリティブートストラップ："
    },
    {
      "indent": 12,
      "text": "Without the external operations, 6lo nodes must have a security bootstrapping mechanism.",
      "ja": "外部操作がなければ、6LOノードにはセキュリティブートストラップメカニズムが必要です。"
    },
    {
      "indent": 3,
      "text": "Power Use Strategy:",
      "ja": "電力使用戦略："
    },
    {
      "indent": 12,
      "text": "To enable certain use cases, there may be requirements on the class of energy availability and the strategy followed for using power for communication [RFC7228]. Each link-layer technology defines a particular power use strategy that may be tuned [RFC8352]. Readers are expected to be familiar with the terminology found in [RFC7228].",
      "ja": "特定のユースケースを有効にするために、エネルギーの利用可能性のクラスと、通信のために電力を使用するために続く戦略に要件があるかもしれません[RFC7228]。各リンク層技術は、調整される可能性のある特定の電力使用戦略を定義します[RFC8352]。読者は、[RFC7228]で見つかった用語に精通していることが期待されています。"
    },
    {
      "indent": 3,
      "text": "Update Firmware Requirements:",
      "ja": "ファームウェアの要件を更新します："
    },
    {
      "indent": 12,
      "text": "Most 6lo use cases will need a mechanism to update firmware. In these cases, support for over-the-air updates is required, probably in a broadcast mode when bandwidth is low and the number of identical devices is high.",
      "ja": "ほとんどの6LOユースケースには、ファームウェアを更新するメカニズムが必要です。これらの場合、帯域幅が低く、同一のデバイスの数が多い放送モードで、オーバーザエアの更新のサポートが必要です。"
    },
    {
      "indent": 3,
      "text": "Wired vs. Wireless:",
      "ja": "有線対ワイヤレス："
    },
    {
      "indent": 12,
      "text": "Plenty of 6lo link-layer technologies are wireless, except MS/TP and PLC. The selection of wired or wireless link-layer technology is mainly dependent on the requirements of the 6lo use cases and the characteristics of wired and wireless technologies.",
      "ja": "MS/TPとPLCを除き、6LOのリンク層技術はワイヤレスです。有線またはワイヤレスリンク層技術の選択は、主に6LOユースケースの要件と、有線技術とワイヤレステクノロジーの特性に依存しています。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "section_title": true,
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Carles Gomez has been funded in part by the Spanish Government through the Jose Castillejo CAS15/00336 grant, the TEC2016-79988-P grant, and the PID2019-106808RA-I00 grant as well as by Secretaria d'Universitats i Recerca del Departament d'Empresa i Coneixement de la Generalitat de Catalunya through grants 2017 SGR 376 and 2021 SGR 00330. His contribution to this work has been carried out in part during his stay as a visiting scholar at the Computer Laboratory of the University of Cambridge.",
      "ja": "カールズ・ゴメスは、ホセ・カスティルホCAS15/00336助成金、TEC2016-79988-P助成金、およびPID2019-1068088ra-I00助成金、およびセクレアリアd'大学の助成金を通じて、スペイン政府によって部分的に資金提供を受けています。empresa i coneixement de la generalitat de catalunyaは、Grants 2017 Sgr 376および2021 Sgr 00330を介してカタルーニャです。"
    },
    {
      "indent": 3,
      "text": "Thomas Watteyne, Pascal Thubert, Xavier Vilajosana, Daniel Migault, Jianqiang Hou, Kerry Lynn, S.V.R. Anand, and Seyed Mahdi Darroudi have provided valuable feedback for this document.",
      "ja": "Thomas Watteyne、Pascal Thubert、Xavier Vilajosana、Daniel Migault、Jianqiang Hou、Kerry Lynn、S.V.R。AnandとSeyed Mahdi Darroudiは、この文書に貴重なフィードバックを提供しました。"
    },
    {
      "indent": 3,
      "text": "Das Subir and Michel Veillette have provided valuable information of jupiterMesh, and Paul Duffy has provided valuable information of Wi-SUN for this document. Also, Jianqiang Hou has provided valuable information of G3-PLC and Netricity for this document. Take Aanstoot, Kerry Lynn, and Dave Robin have provided valuable information of MS/TP and practical use case of MS/TP for this document.",
      "ja": "Das SubirとMichel VeilletteはJupitermeshの貴重な情報を提供し、Paul Duffyはこの文書にWi-Sunの貴重な情報を提供しました。また、Jianqiang Houは、このドキュメントにG3-PLCとネトリック性の貴重な情報を提供しています。Take Aanstoot、Kerry Lynn、およびDave Robinは、このドキュメントにMS/TPの貴重な情報とMS/TPの実用的なケースを提供しました。"
    },
    {
      "indent": 3,
      "text": "Deoknyong Ko has provided relevant text of LTE-MTC, and he shared his experience to deploy IPv6 and 6lo technologies over LTE MTC in SK Telecom.",
      "ja": "Deoknyong KoはLTE-MTCの関連テキストを提供しており、SK TelecomのLTE MTCにIPv6と6LOテクノロジーを展開する経験を共有しました。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "section_title": true,
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Yong-Geun Hong\nDaejeon University\n62 Daehak-ro, Dong-gu\nDaejeon\n34520\nSouth Korea\nPhone: +82 42 280 4841\nEmail: yonggeun.hong@gmail.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Carles Gomez\nUniversitat Politecnica de Catalunya\nC/Esteve Terradas, 7\n08860 Castelldefels\nSpain\nEmail: carles.gomez@upc.edu",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Younghwan Choi\nETRI\n218 Gajeongno, Yuseong\nDaejeon\n34129\nSouth Korea\nPhone: +82 42 860 1429\nEmail: yhc@etri.re.kr",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Abdur Rashid Sangi\nWenzhou-Kean University\n88 Daxue Road, Ouhai, Wenzhou\nZhejiang\n325060\nChina\nEmail: sangi_bahrian@yahoo.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Samita Chakrabarti\nVerizon\nBedminster, NJ\nUnited States of America\nEmail: samita.chakrabarti@verizon.com",
      "raw": true,
      "ja": ""
    }
  ]
}