{
  "title": {
    "text": "RFC 9176 - Constrained RESTful Environments (CoRE) Resource Directory (RFC 9176)",
    "ja": "RFC 9176 - 制約された安らかな環境（コア）リソースディレクトリ（RFC 9176）"
  },
  "number": 9176,
  "created_at": "2022-05-02 03:00:02.539261+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                    C. Amsüss, Ed.\nRequest for Comments: 9176\nCategory: Standards Track                                      Z. Shelby\nISSN: 2070-1721                                             Edge Impulse\n                                                               M. Koster\n                                                            PassiveLogic\n                                                              C. Bormann\n                                                  Universität Bremen TZI\n                                                         P. van der Stok\n                                                  vanderstok consultancy\n                                                              April 2022",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 7,
      "text": "Constrained RESTful Environments (CoRE) Resource Directory",
      "ja": "制約されたRESTFUL環境（コア）リソースディレクトリ"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "In many Internet of Things (IoT) applications, direct discovery of resources is not practical due to sleeping nodes or networks where multicast traffic is inefficient. These problems can be solved by employing an entity called a Resource Directory (RD), which contains information about resources held on other servers, allowing lookups to be performed for those resources. The input to an RD is composed of links, and the output is composed of links constructed from the information stored in the RD. This document specifies the web interfaces that an RD supports for web servers to discover the RD and to register, maintain, look up, and remove information on resources. Furthermore, new target attributes useful in conjunction with an RD are defined.",
      "ja": "多くのモノのインターネット（IoT）アプリケーションでは、マルチキャストトラフィックが非効率的な睡眠ノードまたはネットワークのために、リソースの直接発見は実用的ではありません。これらの問題は、他のサーバーに保持されているリソースに関する情報を含むリソースディレクトリ（RD）と呼ばれるエンティティを使用することで解決でき、それらのリソースに対してルックアップを実行できます。RDへの入力はリンクで構成され、出力はRDに保存されている情報から構築されたリンクで構成されています。このドキュメントは、RDがWebサーバーをサポートするWebインターフェイスを指定して、RDを発見し、リソースに関する情報を登録、維持、検索、削除します。さらに、RDと組み合わせて役立つ新しいターゲット属性が定義されています。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準トラックドキュメントです。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 7841.",
      "ja": "このドキュメントは、インターネットエンジニアリングタスクフォース（IETF）の製品です。IETFコミュニティのコンセンサスを表しています。公開レビューを受けており、インターネットエンジニアリングステアリンググループ（IESG）からの出版が承認されています。インターネット標準の詳細については、RFC 7841のセクション2で入手できます。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at https://www.rfc-editor.org/info/rfc9176.",
      "ja": "このドキュメントの現在のステータス、任意のERRATA、およびそのフィードバックを提供する方法に関する情報は、https：//www.rfc-editor.org/info/rfc9176で取得できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2022 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（c）2022 IETF Trustおよび文書著者として特定された人。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (https://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Revised BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Revised BSD License.",
      "ja": "このドキュメントは、BCP 78およびIETFドキュメント（https://trustee.ietf.org/license-info）に関連するIETF Trustの法的規定の対象となります。この文書に関するあなたの権利と制限を説明するので、これらの文書を注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、セクション4.Eで説明されている法的規定のセクション4.Eで説明されており、修正されたBSDライセンスで説明されているように保証なしで提供される修正されたBSDライセンステキストを含める必要があります。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction\n2.  Terminology\n3.  Architecture and Use Cases\n  3.1.  Principles\n  3.2.  Architecture\n  3.3.  RD Content Model\n  3.4.  Link-Local Addresses and Zone Identifiers\n  3.5.  Use Case: Cellular M2M\n  3.6.  Use Case: Home and Building Automation\n  3.7.  Use Case: Link Catalogues\n4.  RD Discovery and Other Interface-Independent Components\n  4.1.  Finding a Resource Directory\n    4.1.1.  Resource Directory Address Option (RDAO)\n    4.1.2.  Using DNS-SD to Discover a Resource Directory\n  4.2.  Payload Content Formats\n  4.3.  URI Discovery\n5.  Registration\n  5.1.  Simple Registration\n  5.2.  Third-Party Registration\n  5.3.  Operations on the Registration Resource\n    5.3.1.  Registration Update\n    5.3.2.  Registration Removal\n    5.3.3.  Further Operations\n    5.3.4.  Request Freshness\n6.  RD Lookup\n  6.1.  Resource Lookup\n  6.2.  Lookup Filtering\n  6.3.  Resource Lookup Examples\n  6.4.  Endpoint Lookup\n7.  Security Policies\n  7.1.  Endpoint Name\n    7.1.1.  Random Endpoint Names\n  7.2.  Entered Links\n  7.3.  Link Confidentiality\n  7.4.  Segmentation\n  7.5.  \"First Come First Remembered\": A Default Policy\n8.  Security Considerations\n  8.1.  Discovery\n  8.2.  Endpoint Identification and Authentication\n  8.3.  Access Control\n  8.4.  Denial-of-Service Attacks\n  8.5.  Skipping Freshness Checks\n9.  IANA Considerations\n  9.1.  Resource Types\n  9.2.  IPv6 ND Resource Directory Address Option\n  9.3.  RD Parameters Registry\n    9.3.1.  Full Description of the \"Endpoint Type\" RD Parameter\n  9.4.  Endpoint Type (et=) RD Parameter Values\n  9.5.  Multicast Address Registration\n  9.6.  Well-Known URIs\n  9.7.  Service Name and Transport Protocol Port Number Registry\n10. Examples\n  10.1.  Lighting Installation\n    10.1.1.  Installation Characteristics\n    10.1.2.  RD Entries\n  10.2.  OMA Lightweight M2M (LwM2M)\n11. References\n  11.1.  Normative References\n  11.2.  Informative References\nAppendix A.  Groups Registration and Lookup\nAppendix B.  Web Links and the Resource Directory\n  B.1.  A Simple Example\n    B.1.1.  Resolving the URIs\n    B.1.2.  Interpreting Attributes and Relations\n  B.2.  A Slightly More Complex Example\n  B.3.  Enter the Resource Directory\n  B.4.  A Note on Differences between Link-Format and Link Header\n        Fields\nAppendix C.  Limited Link Format\nAcknowledgments\nAuthors' Addresses",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "In the work on Constrained RESTful Environments (CoRE), a Representational State Transfer (REST) architecture suitable for constrained nodes (e.g., with limited RAM and ROM [RFC7228]) and networks (e.g., IPv6 over Low-Power Wireless Personal Area Network (6LoWPAN) [RFC4944]) has been established and is used in Internet of Things (IoT) or machine-to-machine (M2M) applications, such as smart energy and building automation.",
      "ja": "制約付きの安らかな環境（Core）に関する作業では、制約されたノード（例：RAMおよびROM [RFC7228]が限られている）に適した表現状態転送（REST）アーキテクチャとネットワーク（例：低電力ワイヤレスパーソナルエリアネットワーク（例：IPv6）（例：6lowpan）[RFC4944]）が確立されており、スマートエネルギーや建物の自動化など、モノのインターネット（IoT）またはマシンからマシン（M2M）アプリケーションで使用されています。"
    },
    {
      "indent": 3,
      "text": "The discovery of resources offered by a constrained server is very important in machine-to-machine applications where there are no humans in the loop and static interfaces result in fragility. The discovery of resources provided by an HTTP web server is typically called web linking [RFC8288]. The use of web linking for the description and discovery of resources hosted by constrained web servers is specified by the CoRE Link Format [RFC6690]. However, [RFC6690] only describes how to discover resources from the web server that hosts them by querying /.well-known/core. In many constrained scenarios, direct discovery of resources is not practical due to sleeping nodes or networks where multicast traffic is inefficient. These problems can be solved by employing an entity called a Resource Directory (RD), which contains information about resources held on other servers, allowing lookups to be performed for those resources.",
      "ja": "制約されたサーバーによって提供されるリソースの発見は、ループに人間がいないマシンからマシンへのアプリケーションで非常に重要であり、静的インターフェイスは脆弱性をもたらします。HTTP Webサーバーが提供するリソースの発見は、通常、Webリンク[RFC8288]と呼ばれます。制約されたWebサーバーによってホストされているリソースの説明と発見のためにWebリンクの使用は、コアリンク形式[RFC6690]によって指定されています。ただし、[RFC6690]は、Querying /.Well-NownS /CoreによってホストするWebサーバーからリソースを発見する方法のみを説明しています。多くの制約されたシナリオでは、マルチキャストトラフィックが非効率的な睡眠ノードまたはネットワークのために、リソースの直接的な発見は実用的ではありません。これらの問題は、他のサーバーに保持されているリソースに関する情報を含むリソースディレクトリ（RD）と呼ばれるエンティティを使用することで解決でき、それらのリソースに対してルックアップを実行できます。"
    },
    {
      "indent": 3,
      "text": "This document specifies the web interfaces that an RD supports for web servers to discover the RD and to register, maintain, look up, and remove information on resources. Furthermore, new target attributes useful in conjunction with an RD are defined. Although the examples in this document show the use of these interfaces with the Constrained Application Protocol (CoAP) [RFC7252], they can be applied in an equivalent manner to HTTP [RFC7230].",
      "ja": "このドキュメントは、RDがWebサーバーをサポートするWebインターフェイスを指定して、RDを発見し、リソースに関する情報を登録、維持、検索、削除します。さらに、RDと組み合わせて役立つ新しいターゲット属性が定義されています。このドキュメントの例は、制約付きアプリケーションプロトコル（COAP）[RFC7252]でこれらのインターフェイスを使用していることを示していますが、HTTP [RFC7230]と同等の方法で適用できます。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "ja": "2. 用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14 [RFC2119] [RFC8174] when, and only when, they appear in all capitals, as shown here.",
      "ja": "この文書のキーワード \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", および \"OPTIONAL\" はBCP 14 [RFC2119] [RFC8174]で説明されているように、すべて大文字の場合にのみ解釈されます。"
    },
    {
      "indent": 3,
      "text": "The term \"byte\" is used in its now customary sense as a synonym for \"octet\".",
      "ja": "「バイト」という用語は、「Octet」の同義語として現在慣習的な意味で使用されています。"
    },
    {
      "indent": 3,
      "text": "This specification requires readers to be familiar with all the terms and concepts that are discussed in [RFC3986], [RFC8288], and [RFC6690]. Readers should also be familiar with the terms and concepts discussed in [RFC7252]. To describe the REST interfaces defined in this specification, the URI Template format is used [RFC6570].",
      "ja": "この仕様では、読者は[RFC3986]、[RFC8288]、および[RFC6690]で議論されているすべての用語と概念に精通する必要があります。読者は、[RFC7252]で説明されている用語と概念にも精通している必要があります。この仕様で定義されているRESTインターフェイスを記述するために、URIテンプレート形式が使用されます[RFC6570]。"
    },
    {
      "indent": 3,
      "text": "This specification makes use of the following additional terminology:",
      "ja": "この仕様では、次の追加用語を使用します。"
    },
    {
      "indent": 3,
      "text": "Resolve Against The expression \"a URI reference is _resolved against_ a base URI\" is used to describe the process of [RFC3986], Section 5.2. Noteworthy corner cases include the following: (1) if the URI reference is a (full) URI, resolving against any base URI gives the original full URI and (2) resolving an empty URI reference gives the base URI without any fragment identifier.",
      "ja": "「uri参照は_ resolved _ ress_ a base uri」という式に対して解決されます。注目に値するコーナーケースには次のものが含まれます。（1）URI参照が（完全）URIである場合、任意のベースに対して解決することは元の完全なURIを与え、（2）空のURI参照を解決することは、フラグメント識別子なしでベースURIを与えます。"
    },
    {
      "indent": 3,
      "text": "Resource Directory (RD) A web entity that stores information about web resources and implements the REST interfaces defined in this specification for discovery, for the creation, maintenance, and removal of registrations, and for lookup of the registered resources.",
      "ja": "Resource Directory（RD）Webリソースに関する情報を保存し、この仕様で定義されているRESTインターフェイスを、登録の作成、メンテナンス、削除、および登録リソースの検索のために定義されたRESTインターフェイスを実装するWebエンティティ。"
    },
    {
      "indent": 3,
      "text": "Sector In the context of an RD, a sector is a logical grouping of endpoints.",
      "ja": "RDのコンテキストでは、セクターはエンドポイントの論理的なグループ化です。"
    },
    {
      "indent": 6,
      "text": "The abbreviation \"d=\" is used for the sector in query parameters for compatibility with deployed implementations.",
      "ja": "略語「d =」は、展開された実装と互換性のためのクエリパラメーターのセクターに使用されます。"
    },
    {
      "indent": 3,
      "text": "Endpoint (EP) Endpoint (EP) is a term used to describe a web server or client in [RFC7252]. In the context of this specification, an endpoint is used to describe a web server that registers resources to the RD. An endpoint is identified by its endpoint name, which is included during registration, and has a unique name within the associated sector of the registration.",
      "ja": "エンドポイント（EP）エンドポイント（EP）は、[RFC7252]のWebサーバーまたはクライアントを記述するために使用される用語です。この仕様のコンテキストでは、エンドポイントがRDにリソースを登録するWebサーバーを記述するために使用されます。エンドポイントは、登録中に含まれるエンドポイント名によって識別され、登録の関連部門内に一意の名前があります。"
    },
    {
      "indent": 3,
      "text": "Registration Base URI The base URI of a registration is a URI that typically gives scheme and authority information about an endpoint. The registration base URI is provided at registration time and is used by the RD to resolve relative references of the registration into URIs.",
      "ja": "登録ベースURI登録のベースURIは、通常、エンドポイントに関するスキームと権限の情報を提供するURIです。登録ベースのURIは登録時に提供され、RDがURIへの登録の相対的な参照を解決するために使用されます。"
    },
    {
      "indent": 3,
      "text": "Target The target of a link is the destination address (URI) of the link. It is sometimes identified with \"href=\" or displayed as <target>. Relative targets need resolving with respect to the base URI (Section 5.2 of [RFC3986]).",
      "ja": "ターゲットリンクのターゲットは、リンクの宛先アドレス（URI）です。「href =」で識別されることもあります。相対ターゲットは、ベースURI（[RFC3986]のセクション5.2）に関して解決する必要があります。"
    },
    {
      "indent": 6,
      "text": "This use of the term \"target\" is consistent with the use in [RFC8288].",
      "ja": "「ターゲット」という用語の使用は、[RFC8288]での使用と一致しています。"
    },
    {
      "indent": 3,
      "text": "Context The context of a link is the source address (URI) of the link and describes which resource is linked to the target. A link's context is made explicit in serialized links as the \"anchor=\" attribute.",
      "ja": "コンテキストリンクのコンテキストは、リンクのソースアドレス（URI）であり、どのリソースがターゲットにリンクされているかを説明します。リンクのコンテキストは、「Anchor =」属性としてシリアル化されたリンクで明示的になります。"
    },
    {
      "indent": 6,
      "text": "This use of the term \"context\" is consistent with the use in [RFC8288].",
      "ja": "「コンテキスト」という用語の使用は、[RFC8288]での使用と一致しています。"
    },
    {
      "indent": 3,
      "text": "Directory Resource A directory resource is a resource in the RD containing registration resources.",
      "ja": "ディレクトリリソースディレクトリリソースは、登録リソースを含むRDのリソースです。"
    },
    {
      "indent": 3,
      "text": "Registration Resource A registration resource is a resource in the RD that contains information about an endpoint and its links.",
      "ja": "登録リソース登録リソースは、エンドポイントとそのリンクに関する情報を含むRDのリソースです。"
    },
    {
      "indent": 3,
      "text": "Commissioning Tool (CT) A Commissioning Tool (CT) is a device that assists during installation events by assigning values to parameters, naming endpoints and groups, or adapting the installation to the needs of the applications.",
      "ja": "試運転ツール（CT）A Commistioning Tool（CT）は、パラメーターに値を割り当て、エンドポイントとグループの名前を付けたり、アプリケーションのニーズにインストールしたりすることにより、インストールイベント中にイベントを支援するデバイスです。"
    },
    {
      "indent": 3,
      "text": "Registrant-EP A registrant-EP is the endpoint that is registered into the RD. The registrant-EP can register itself, or a CT registers the registrant-EP.",
      "ja": "登録者-EP登録者-EPは、RDに登録されているエンドポイントです。登録者-EPはそれ自体を登録することができます。または、CTは登録者EPを登録します。"
    },
    {
      "indent": 3,
      "text": "Resource Directory Address Option (RDAO) A Resource Directory Address Option (RDAO) is a new IPv6 Neighbor Discovery option defined for announcing an RD's address.",
      "ja": "Resource Directoryアドレスオプション（RDAO）リソースディレクトリアドレスオプション（RDAO）は、RDのアドレスを発表するために定義された新しいIPv6ネイバーディスカバリーオプションです。"
    },
    {
      "indent": 0,
      "text": "3. Architecture and Use Cases",
      "section_title": true,
      "ja": "3. アーキテクチャとユースケース"
    },
    {
      "indent": 0,
      "text": "3.1. Principles",
      "section_title": true,
      "ja": "3.1. 原則"
    },
    {
      "indent": 3,
      "text": "The RD is primarily a tool to make discovery operations more efficient than querying /.well-known/core on all connected devices or across boundaries that would limit those operations.",
      "ja": "RDは、主に、すべての接続されたデバイスまたはそれらの操作を制限する境界を越えて /.Well-Known/Coreをクエリするよりも発見操作をより効率的にするためのツールです。"
    },
    {
      "indent": 3,
      "text": "It provides information about resources hosted by other devices that could otherwise only be obtained by directly querying the /.well-known/core resource on these other devices, either by a unicast request or a multicast request.",
      "ja": "それ以外の場合は、ユニキャスト要求またはマルチキャストリクエストのいずれかで、これらの他のデバイスの /.Well-kond/Coreリソースを直接クエリすることによってのみ取得できる他のデバイスがホストするリソースに関する情報を提供します。"
    },
    {
      "indent": 3,
      "text": "Information SHOULD only be stored in the RD if it can be obtained by querying the described device's /.well-known/core resource directly.",
      "ja": "情報は、記載されているデバイスの /.Well-Nownd/Coreリソースを直接クエリすることによって取得できる場合にのみ、RDに保存する必要があります。"
    },
    {
      "indent": 3,
      "text": "Data in the RD can only be provided by the device that hosts the data or a dedicated Commissioning Tool (CT). These CTs act on behalf of endpoints too constrained, or generally unable, to present that information themselves. No other client can modify data in the RD. Changes to the information in the RD do not propagate automatically back to the web servers from where the information originated.",
      "ja": "RDのデータは、データまたは専用の試運転ツール（CT）をホストするデバイスによってのみ提供できます。これらのCTは、その情報を自ら提示するには、エンドポイントがあまりにも制約されているか、一般に不可能なエンドポイントに代わって機能します。他のクライアントはRDのデータを変更できません。RDの情報を変更すると、情報が発生した場所からWebサーバーに自動的に戻ることはありません。"
    },
    {
      "indent": 0,
      "text": "3.2. Architecture",
      "section_title": true,
      "ja": "3.2. 建築"
    },
    {
      "indent": 3,
      "text": "The RD architecture is illustrated in Figure 1. An RD is used as a repository of registrations describing resources hosted on other web servers, also called endpoints (EPs). An endpoint is a web server associated with a scheme, IP address, and port. A physical node may host one or more endpoints. The RD implements a set of REST interfaces for endpoints to register and maintain RD registrations and for endpoints to look up resources from the RD. An RD can be logically segmented by the use of sectors.",
      "ja": "RDアーキテクチャを図1に示します。RDは、エンドポイント（EPS）とも呼ばれる他のWebサーバーでホストされているリソースを説明する登録のリポジトリとして使用されます。エンドポイントは、スキーム、IPアドレス、およびポートに関連付けられたWebサーバーです。物理ノードは、1つ以上のエンドポイントをホストする場合があります。RDは、RD登録を登録および維持するためのエンドポイントと、RDからリソースを検索するエンドポイントのレストインターフェイスのセットを実装しています。RDは、セクターの使用によって論理的にセグメント化できます。"
    },
    {
      "indent": 3,
      "text": "A mechanism to discover an RD using CoRE Link Format [RFC6690] is defined.",
      "ja": "コアリンク形式[RFC6690]を使用してRDを発見するメカニズムが定義されています。"
    },
    {
      "indent": 3,
      "text": "Registrations in the RD are soft state and need to be periodically refreshed.",
      "ja": "RDの登録はソフトステートであり、定期的に更新する必要があります。"
    },
    {
      "indent": 3,
      "text": "An endpoint uses specific interfaces to register, update, and remove a registration. It is also possible for an RD to fetch web links from endpoints and add their contents to its registrations.",
      "ja": "エンドポイントは、特定のインターフェイスを使用して、登録、更新、削除を削除します。また、RDがエンドポイントからWebリンクを取得し、その内容を登録に追加することも可能です。"
    },
    {
      "indent": 3,
      "text": "At the first registration of an endpoint, a \"registration resource\" is created, the location of which is returned to the registering endpoint. The registering endpoint uses this registration resource to manage the contents of registrations.",
      "ja": "エンドポイントの最初の登録では、「登録リソース」が作成され、その場所は登録エンドポイントに返されます。登録エンドポイントは、この登録リソースを使用して登録の内容を管理します。"
    },
    {
      "indent": 3,
      "text": "A lookup interface for discovering any of the web links stored in the RD is provided using the CoRE Link Format.",
      "ja": "RDに保存されているWebリンクを検出するためのルックアップインターフェイスは、コアリンク形式を使用して提供されます。"
    },
    {
      "indent": 3,
      "text": "           Registration         Lookup\n            Interface         Interface\n+----+          |                 |\n| EP |----      |                 |\n+----+    ----  |                 |\n              --|-    +------+    |\n+----+          | ----|      |    |     +--------+\n| EP | ---------|-----|  RD  |----|-----| Client |\n+----+          | ----|      |    |     +--------+\n              --|-    +------+    |\n+----+    ----  |                 |\n| CT |----      |                 |\n+----+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 23,
      "text": "Figure 1: The RD Architecture",
      "ja": "図1：RDアーキテクチャ"
    },
    {
      "indent": 3,
      "text": "A registrant-EP MAY keep concurrent registrations to more than one RD at the same time if explicitly configured to do so, but that is not expected to be supported by typical EP implementations. Any such registrations are independent of each other. The usual expectation when multiple discovery mechanisms or addresses are configured is that they constitute a fall-back path for a single registration.",
      "ja": "登録者-EPは、明示的に設定されている場合、同時に同時に登録を複数のRDに保持する場合がありますが、典型的なEP実装ではサポートされるとは予想されていません。そのような登録は互いに独立しています。複数の発見メカニズムまたはアドレスが構成されている場合の通常の期待は、それらが単一の登録のためのフォールバックパスを構成することです。"
    },
    {
      "indent": 0,
      "text": "3.3. RD Content Model",
      "section_title": true,
      "ja": "3.3. RDコンテンツモデル"
    },
    {
      "indent": 3,
      "text": "The Entity-Relationship (ER) models shown in Figures 2 and 3 model the contents of /.well-known/core and the RD respectively, with entity-relationship diagrams [ER]. Entities (rectangles) are used for concepts that exist independently. Attributes (ovals) are used for concepts that exist only in connection with a related entity. Relations (diamonds) give a semantic meaning to the relation between entities. Numbers specify the cardinality of the relations.",
      "ja": "図2および3に示すエンティティ関連（ER）モデルは、それぞれ /.Well-Nownd/CoreとRDの内容をモデルし、エンティティ関連図[ER]を使用しています。エンティティ（長方形）は、独立して存在する概念に使用されます。属性（卵子）は、関連するエンティティに関連してのみ存在する概念に使用されます。関係（ダイヤモンド）は、エンティティ間の関係に対して意味的な意味を与えます。数字は、関係のカーディナリティを指定します。"
    },
    {
      "indent": 3,
      "text": "Some of the attribute values are URIs. Those values are always full URIs and never relative references in the information model. However, they can be expressed as relative references in serializations, and they often are.",
      "ja": "属性値の一部はurisです。これらの値は常に完全なurisであり、情報モデルでは決して相対的な参照ではありません。ただし、シリアル化における相対的な参照として表現することができ、しばしばそうです。"
    },
    {
      "indent": 3,
      "text": "These models provide an abstract view of the information expressed in link-format documents and an RD. They cover the concepts but not necessarily all details of an RD's operation; they are meant to give an overview and not be a template for implementations.",
      "ja": "これらのモデルは、リンク形式のドキュメントとRDで表現された情報の抽象的なビューを提供します。それらは概念をカバーしていますが、必ずしもRDの操作のすべての詳細ではありません。それらは、概要を示し、実装のテンプレートではありません。"
    },
    {
      "indent": 3,
      "text": "           +----------------------+\n           |   /.well-known/core  |\n           +----------------------+\n                      |\n                      | 1\n              ////////\\\\\\\\\\\\\\\n             <    contains   >\n              \\\\\\\\\\\\\\\\///////\n                      |\n                      | 0+\n            +--------------------+\n            |      link          |\n            +--------------------+\n                      |\n                      |  1   oooooooo\n                      +-----o target o\n                      |      oooooooo\n oooooooooooo   0+    |\no    target  o--------+\no  attribute o        | 0+   oooooo\n oooooooooooo         +-----o rel  o\n                      |      oooooo\n                      |\n                      | 1    ooooooooo\n                      +-----o context o\n                             ooooooooo",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 11,
      "text": "Figure 2: ER Model of the Content of /.well-known/core",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Figure 2 models the contents of /.well-known/core, which contains a set of links belonging to the hosting web server.",
      "ja": "図2は、ホスティングWebサーバーに属する一連のリンクを含む /.Well-Nownd/Coreの内容をモデル化しています。"
    },
    {
      "indent": 3,
      "text": "The web server is free to choose links it deems appropriate to be exposed in its /.well-known/core. Typically, the links describe resources that are served by the host, but the set can also contain links to resources on other servers (see examples in Section 5 of [RFC6690]). The set does not necessarily contain links to all resources served by the host.",
      "ja": "Webサーバーは、 /.Well-Nowned/Coreで公開されるのに適していると思われるリンクを無料で選択できます。通常、リンクはホストが提供するリソースを説明しますが、セットには他のサーバー上のリソースへのリンクも含めることができます（[RFC6690]のセクション5の例を参照）。このセットには、ホストが提供するすべてのリソースへのリンクが必ずしも含まれていません。"
    },
    {
      "indent": 3,
      "text": "A link has the following attributes (see Section 5 of [RFC8288]):",
      "ja": "リンクには次の属性があります（[RFC8288]のセクション5を参照）："
    },
    {
      "indent": 3,
      "text": "* Zero or more link relations: They describe relations between the link context and the link target.",
      "ja": "* ゼロ以上のリンク関係：リンクコンテキストとリンクターゲットとの関係について説明します。"
    },
    {
      "indent": 6,
      "text": "In link-format serialization, they are expressed as space-separated values in the \"rel\" attribute and default to \"hosts\".",
      "ja": "リンク形式のシリアル化では、それらは「rel」属性の空間分離値として表現され、デフォルトで「ホスト」になります。"
    },
    {
      "indent": 3,
      "text": "* A link context URI: It defines the source of the relation, e.g., _who_ \"hosts\" something.",
      "ja": "* リンクコンテキストURI：関係のソースを定義します。"
    },
    {
      "indent": 6,
      "text": "In link-format serialization, it is expressed in the \"anchor\" attribute and defaults to the Origin of the target (practically, the target with its path and later components removed).",
      "ja": "リンク形式のシリアル化では、「アンカー」属性で表現され、デフォルトはターゲットの原点にデフォルトです（実際には、そのパスを備えたターゲットと後のコンポーネントが削除されます）。"
    },
    {
      "indent": 3,
      "text": "* A link target URI: It defines the destination of the relation (e.g., _what_ is hosted) and is the topic of all target attributes.",
      "ja": "* リンクターゲットURI：関係の宛先（_what_がホストされている）を定義し、すべてのターゲット属性のトピックです。"
    },
    {
      "indent": 6,
      "text": "In link-format serialization, it is expressed between angular brackets and sometimes called the \"href\".",
      "ja": "リンク形式のシリアル化では、角度ブラケットの間で表現され、「href」と呼ばれることもあります。"
    },
    {
      "indent": 3,
      "text": "* Other target attributes (e.g., resource type (rt), interface (if), or content format (ct)): These provide additional information about the target URI.",
      "ja": "* その他のターゲット属性（例：リソースタイプ（RT）、インターフェイス（IF）、またはコンテンツ形式（CT））：これらは、ターゲットURIに関する追加情報を提供します。"
    },
    {
      "indent": 3,
      "text": "                 +--------------+\n                 +      RD      +\n                 +--------------+\n                        | 1\n                        |\n                        |\n                        |\n                        |\n                   //////\\\\\\\\\n                  < contains >\n                   \\\\\\\\\\/////\n                        |\n                     0+ |\n ooooooo     1  +---------------+\no  base o-------|  registration |\n ooooooo        +---------------+\n                    |       | 1\n                    |       +--------------+\n       oooooooo   1 |                      |\n      o  href  o----+                 /////\\\\\\\\\n       oooooooo     |                < contains >\n                    |                 \\\\\\\\\\/////\n       oooooooo   1 |                      |\n      o   ep   o----+                      | 0+\n       oooooooo     |             +------------------+\n                    |             |      link        |\n       oooooooo 0-1 |             +------------------+\n      o    d   o----+                      |\n       oooooooo     |                      |  1   oooooooo\n                    |                      +-----o target o\n       oooooooo   1 |                      |      oooooooo\n      o   lt   o----+     ooooooooooo   0+ |\n       oooooooo     |    o  target   o-----+\n                    |    o attribute o     | 0+   oooooo\n    ooooooooooo 0+  |     ooooooooooo      +-----o rel  o\n   o  endpoint o----+                      |      oooooo\n   o attribute o                           |\n    ooooooooooo                            | 1   ooooooooo\n                                           +----o context o\n                                                 ooooooooo",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 16,
      "text": "Figure 3: ER Model of the Content of the RD",
      "ja": "図3：RDの内容のERモデル"
    },
    {
      "indent": 3,
      "text": "Figure 3 models the contents of the RD, which contains, in addition to /.well-known/core, 0 to n registrations of endpoints.",
      "ja": "図3は、 /.well-nowned/coreに加えて、エンドポイントのn登録に加えて、RDの内容をモデル化します。"
    },
    {
      "indent": 3,
      "text": "A registration is associated with one endpoint. A registration defines a set of links, as defined for /.well-known/core. A registration has six types of attributes:",
      "ja": "登録は1つのエンドポイントに関連付けられています。登録は、 /.well-nown /core用に定義されているリンクのセットを定義します。登録には6種類の属性があります。"
    },
    {
      "indent": 3,
      "text": "* an endpoint name (\"ep\", a Unicode string) unique within a sector",
      "ja": "* セクター内でユニークなエンドポイント名（ \"ep\"、unicode文字列）"
    },
    {
      "indent": 3,
      "text": "* a registration base URI (\"base\", a URI typically describing the scheme://authority part)",
      "ja": "* 登録ベースURI（「ベース」、通常、スキームを説明するURI：//権限部分）"
    },
    {
      "indent": 3,
      "text": "* a lifetime (\"lt\")",
      "ja": "* 生涯（ \"lt\"）"
    },
    {
      "indent": 3,
      "text": "* a registration resource location inside the RD (\"href\")",
      "ja": "* RD内の登録リソースの場所（「HREF」）"
    },
    {
      "indent": 3,
      "text": "* optionally, a sector (\"d\", a Unicode string)",
      "ja": "* オプションで、セクター（ \"d\"、unicode文字列）"
    },
    {
      "indent": 3,
      "text": "* optional additional endpoint attributes (from Section 9.3)",
      "ja": "* オプションの追加エンドポイント属性（セクション9.3から）"
    },
    {
      "indent": 3,
      "text": "The cardinality of \"base\" is currently 1; future documents are invited to extend the RD specification to support multiple values (e.g., [COAP-PROT-NEG]). Its value is used as a base URI when resolving URIs in the links contained in the endpoint.",
      "ja": "「ベース」のカーディナリティは現在1です。将来のドキュメントは、RD仕様を拡張して複数の値（[Coap-Prot-neg]など）をサポートするために招待されています。その値は、エンドポイントに含まれるリンクでURIを解決する際にベースURIとして使用されます。"
    },
    {
      "indent": 3,
      "text": "Links are modeled as they are in Figure 2.",
      "ja": "リンクは、図2にあるようにモデル化されています。"
    },
    {
      "indent": 0,
      "text": "3.4. Link-Local Addresses and Zone Identifiers",
      "section_title": true,
      "ja": "3.4. Link-Localアドレスとゾーン識別子"
    },
    {
      "indent": 3,
      "text": "Registration base URIs can contain link-local IP addresses. To be usable across hosts, those cannot be serialized to contain zone identifiers (see [RFC6874], Section 1).",
      "ja": "登録ベースURIには、リンクローカルIPアドレスを含めることができます。ホスト間で使用できるようにするには、ゾーン識別子を含めるようにシリアル化することはできません（[RFC6874]、セクション1を参照）。"
    },
    {
      "indent": 3,
      "text": "Link-local addresses can only be used on a single link (therefore, RD servers cannot announce them when queried on a different link), and lookup clients using them need to keep track of which interface they got them from.",
      "ja": "Link-Localアドレスは、単一のリンクでのみ使用できます（したがって、RDサーバーは別のリンクで照会されたときにそれらを発表することはできません）。"
    },
    {
      "indent": 3,
      "text": "Therefore, it is advisable in many scenarios to use addresses with larger scopes, if available.",
      "ja": "したがって、多くのシナリオでは、利用可能な場合は、より大きなスコープを持つアドレスを使用することをお勧めします。"
    },
    {
      "indent": 0,
      "text": "3.5. Use Case: Cellular M2M",
      "section_title": true,
      "ja": "3.5. ユースケース：セルラーM2M"
    },
    {
      "indent": 3,
      "text": "Over the last few years, mobile operators around the world have focused on development of M2M solutions in order to expand the business to the new type of users: machines. The machines are connected directly to a mobile network using an appropriate embedded wireless interface (GSM/General Packet Radio Service (GPRS), Wideband Code Division Multiple Access (W-CDMA), LTE, etc.) or via a gateway providing short- and wide-range wireless interfaces. The ambition in such systems is to build them from reusable components. These speed up development and deployment and enable shared use of machines across different applications. One crucial component of such systems is the discovery of resources (and thus the endpoints they are hosted on) capable of providing required information at a given time or acting on instructions from the end users.",
      "ja": "過去数年間、世界中のモバイルオペレーターは、ビジネスを新しいタイプのユーザーであるマシンに拡大するために、M2Mソリューションの開発に焦点を当ててきました。マシンは、適切な埋め込みワイヤレスインターフェイス（GSM/一般的なパケットラジオサービス（GPRS）、ワイドバンドコードディビジョン多重アクセス（W-CDMA）、LTEなど）を使用して、または短絡を提供するゲートウェイを介して、モバイルネットワークに直接接続されています。ワイドレンジワイヤレスインターフェイス。そのようなシステムの野望は、再利用可能なコンポーネントからそれらを構築することです。これらは、開発と展開をスピードアップし、さまざまなアプリケーションでマシンの共有使用を可能にします。このようなシステムの重要なコンポーネントの1つは、特定の時間に必要な情報を提供したり、エンドユーザーからの指示に基づいて行動できるリソースの発見（したがって、それらがホストされているエンドポイント）です。"
    },
    {
      "indent": 3,
      "text": "Imagine a scenario where endpoints installed on vehicles enable tracking of the position of these vehicles for fleet management purposes and allow monitoring of environment parameters. During the boot-up process, endpoints register with an RD, which is hosted by the mobile operator or somewhere in the cloud. Periodically, these endpoints update their registration and may modify resources they offer.",
      "ja": "車両にエンドポイントがインストールされているシナリオを想像してください。フリート管理の目的でこれらの車両の位置を追跡し、環境パラメーターの監視を可能にするシナリオを想像してください。起動プロセス中、エンドポイントはRDに登録します。RDは、モバイルオペレーターまたはクラウド内のどこかによってホストされています。定期的に、これらのエンドポイントは登録を更新し、提供するリソースを変更する場合があります。"
    },
    {
      "indent": 3,
      "text": "When endpoints are not always connected, for example, because they enter a sleep mode, a remote server is usually used to provide proxy access to the endpoints. Mobile apps or web applications for environment monitoring contact the RD, look up the endpoints capable of providing information about the environment using an appropriate set of link parameters, obtain information on how to contact them (URLs of the proxy server), and then initiate interaction to obtain information that is finally processed, displayed on the screen, and usually stored in a database. Similarly, fleet management systems provide the appropriate link parameters to the RD to look up for EPs deployed on the vehicles the application is responsible for.",
      "ja": "たとえば、エンドポイントが常に接続されていない場合、たとえば、スリープモードに入るため、リモートサーバーは通常、エンドポイントへのプロキシアクセスを提供するために使用されます。環境監視用のモバイルアプリまたはWebアプリケーションRDに連絡し、適切なリンクパラメーターを使用して環境に関する情報を提供できるエンドポイントを検索し、それらに連絡する方法（プロキシサーバーのURL）に関する情報を取得し、インタラクションを開始する最終的に処理され、画面に表示され、通常はデータベースに保存される情報を取得します。同様に、フリート管理システムは、適切なリンクパラメーターをRDに提供して、アプリケーションが担当する車両に展開されているEPSを検索します。"
    },
    {
      "indent": 0,
      "text": "3.6. Use Case: Home and Building Automation",
      "section_title": true,
      "ja": "3.6. ユースケース：ホームおよび建物の自動化"
    },
    {
      "indent": 3,
      "text": "Home and commercial building automation systems can benefit from the use of IoT web services. The discovery requirements of these applications are demanding. Home automation usually relies on run-time discovery to commission the system, whereas, in building automation, a combination of professional commissioning and run-time discovery is used. Both home and building automation involve peer-to-peer interactions between endpoints and involve battery-powered sleeping devices. Both can use the common RD infrastructure to establish device interactions efficiently but can pick security policies suitable for their needs.",
      "ja": "ホームおよび商業ビルの自動化システムは、IoT Webサービスの使用から利益を得ることができます。これらのアプリケーションの発見要件は要求が厳しいです。ホームオートメーションは通常、システムを委託するためのランタイムディスカバリーに依存していますが、自動化の構築において、専門的な試運転とランタイム発見の組み合わせが使用されます。自宅と建物の自動化の両方には、エンドポイント間のピアツーピアの相互作用が含まれ、バッテリー駆動の睡眠デバイスが含まれます。どちらも一般的なRDインフラストラクチャを使用して、デバイスの相互作用を効率的に確立することができますが、ニーズに適したセキュリティポリシーを選択できます。"
    },
    {
      "indent": 3,
      "text": "Two phases can be discerned for a network servicing the system: (1) installation and (2) operation. During the operational phase, the network is connected to the Internet with a border router (e.g., a 6LoWPAN Border Router (6LBR) [RFC6775]), and the nodes connected to the network can use the Internet services that are provided by the IP or network administrator. During the installation phase, the network is completely stand-alone, no border router is connected, and the network only supports the IP communication between the connected nodes. The installation phase is usually followed by the operational phase. As an RD's operations work without hard dependencies on names or addresses, it can be used for discovery across both phases.",
      "ja": "システムをサービスするネットワークでは、2つのフェーズを識別できます。（1）インストールと（2）操作。動作段階では、ネットワークはボーダールーターを使用してインターネットに接続されています（たとえば、6lowpan Border Router（6LBR）[RFC6775]）、ネットワークに接続されたノードは、IPまたはIPによって提供されるインターネットサービスを使用できます。ネットワーク管理者。インストールフェーズ中、ネットワークは完全にスタンドアロンで、ボーダールーターは接続されておらず、ネットワークは接続ノード間のIP通信のみをサポートします。通常、設置フェーズの後に運用フェーズが続きます。RDの操作は、名前や住所に厳しい依存関係を持つことなく動作するため、両方のフェーズでの発見に使用できます。"
    },
    {
      "indent": 0,
      "text": "3.7. Use Case: Link Catalogues",
      "section_title": true,
      "ja": "3.7. ユースケース：リンクカタログ"
    },
    {
      "indent": 3,
      "text": "Resources may be shared through data brokers that have no knowledge beforehand of who is going to consume the data. An RD can be used to hold links about resources and services hosted anywhere to make them discoverable by a general class of applications.",
      "ja": "リソースは、誰がデータを消費するかについて事前に知らないデータブローカーを通じて共有される場合があります。RDは、一般的なクラスのアプリケーションで発見できるようにするために、どこでもホストされているリソースとサービスに関するリンクを保持するために使用できます。"
    },
    {
      "indent": 3,
      "text": "For example, environmental and weather sensors that generate data for public consumption may provide data to an intermediary server or broker. Sensor data are published to the intermediary upon changes or at regular intervals. Descriptions of the sensors that resolve to links to sensor data may be published to an RD. Applications wishing to consume the data can use RD lookup to discover and resolve links to the desired resources and endpoints. The RD service need not be coupled with the data intermediary service. Mapping of RDs to data intermediaries may be many-to-many.",
      "ja": "たとえば、公共消費のためにデータを生成する環境および気象センサーは、仲介サーバーまたはブローカーにデータを提供する場合があります。センサーデータは、変更時または定期的な間隔で中間に公開されます。センサーデータへのリンクに解決するセンサーの説明は、RDに公開される場合があります。データを消費したいアプリケーションは、RDルックアップを使用して、目的のリソースとエンドポイントへのリンクを発見および解決できます。RDサービスは、データ仲介サービスと結合する必要はありません。RDSのデータ仲介業者へのマッピングは、多くの人から多数です。"
    },
    {
      "indent": 3,
      "text": "Metadata in web link formats, such as the one defined in [RFC6690], which may be internally stored as triples or relation/attribute pairs providing metadata about resource links, need to be supported by RDs. External catalogues that are represented in other formats may be converted to common web linking formats for storage and access by RDs. Since it is common practice for these to be encoded in URNs [RFC8141], simple and lossless structural transforms should generally be sufficient to store external metadata in RDs.",
      "ja": "[RFC6690]で定義されているものなど、ウェブリンク形式のメタデータは、リソースリンクに関するメタデータを提供するトリプルまたは関係/属性ペアとして内部に保存される場合があります。RDSによってサポートされる必要があります。他の形式で表される外部カタログは、RDSによるストレージとアクセスのために、一般的なWebリンク形式に変換される場合があります。これらがURN [RFC8141]でエンコードされることが一般的な慣行であるため、一般に、RDSに外部メタデータを保存するには、一般的に十分である必要があります。"
    },
    {
      "indent": 3,
      "text": "The additional features of an RD allow sectors to be defined to enable access to a particular set of resources from particular applications. This provides isolation and protection of sensitive data when needed. Application groups with multicast addresses may be defined to support efficient data transport.",
      "ja": "RDの追加機能により、セクターを定義して、特定のアプリケーションから特定のリソースセットにアクセスできるようにします。これにより、必要に応じて機密データの分離と保護が提供されます。マルチキャストアドレスを持つアプリケーショングループは、効率的なデータ輸送をサポートするために定義できます。"
    },
    {
      "indent": 0,
      "text": "4. RD Discovery and Other Interface-Independent Components",
      "section_title": true,
      "ja": "4. RDディスカバリーおよびその他のインターフェイスに依存しないコンポーネント"
    },
    {
      "indent": 3,
      "text": "This and the following sections define the required set of REST interfaces between an RD, endpoints, and lookup clients. Although the examples throughout these sections assume the use of CoAP [RFC7252], these REST interfaces can also be realized using HTTP [RFC7230]. The multicast discovery and simple registration operations are exceptions to that, as they rely on mechanisms unavailable in HTTP. In all definitions in these sections, both CoAP response codes (with dot notation) and HTTP response codes (without dot notation) are shown. An RD implementing this specification MUST support the discovery, registration, update, lookup, and removal interfaces.",
      "ja": "これと次のセクションでは、RD、エンドポイント、ルックアップクライアントの間の必要な休憩インターフェイスのセットを定義します。これらのセクション全体の例は、COAP [RFC7252]の使用を想定していますが、これらの休憩インターフェイスはHTTP [RFC7230]を使用して実現することもできます。マルチキャストの発見と簡単な登録操作は、HTTPでは利用できないメカニズムに依存しているため、それの例外です。これらのセクションのすべての定義では、COAP応答コード（ドット表記付き）とHTTP応答コード（ドット表記なし）の両方が表示されます。この仕様を実装するRDは、発見、登録、更新、ルックアップ、および削除インターフェイスをサポートする必要があります。"
    },
    {
      "indent": 3,
      "text": "All operations on the contents of the RD MUST be atomic and idempotent.",
      "ja": "RDの内容のすべての操作は、原子および等容量でなければなりません。"
    },
    {
      "indent": 3,
      "text": "For several operations, interface templates are given in list form; those describe the operation participants, request codes, URIs, content formats, and outcomes. Sections of those templates contain normative content about Interaction, Method, URI Template, and URI Template Variables, as well as the details of the Success condition. The additional sections for options (such as Content-Format) and for Failure codes give typical cases that an implementation of the RD should deal with. Those serve to illustrate the typical responses to readers who are not yet familiar with all the details of CoAP-based interfaces; they do not limit how a server may respond under atypical circumstances.",
      "ja": "いくつかの操作では、インターフェイステンプレートがリスト形式で提供されます。これらは、オペレーション参加者、リクエストコード、URI、コンテンツフォーマット、および結果について説明します。これらのテンプレートのセクションには、相互作用、メソッド、URIテンプレート、およびURIテンプレート変数に関する規範的なコンテンツ、および成功条件の詳細が含まれています。オプション（コンテンツフォーマットなど）および障害コードの追加セクションは、RDの実装が対処すべき典型的なケースを提供します。それらは、COAPベースのインターフェイスのすべての詳細にまだ精通していない読者に対する典型的な反応を説明するのに役立ちます。彼らは、非定型の状況下でサーバーがどのように応答するかを制限しません。"
    },
    {
      "indent": 3,
      "text": "REST clients (registrant-EPs and CTs during registration and maintenance, lookup clients, and RD servers during simple registrations) must be prepared to receive any unsuccessful code and act upon it according to its definition, options, and/or payload to the best of their capabilities, falling back to failing the operation if recovery is not possible. In particular, they SHOULD retry the request upon 5.03 (Service Unavailable; 503 in HTTP) according to the Max-Age (Retry-After in HTTP) option and SHOULD fall back to link format when receiving 4.15 (Unsupported Content-Format; 415 in HTTP).",
      "ja": "RESTクライアント（登録およびメンテナンス中の登録者とCTS、ルックアップクライアント、および簡単な登録時にRDサーバー）は、失敗したコードを受け取る準備を整え、その定義、オプション、および/または最善のペイロードに従ってそれに基づいて行動する必要があります回復が不可能な場合、操作に失敗することに戻る能力。特に、Max-Age（HTTPで再試行後）オプションに従って5.03（サービスは利用できない、HTTPで503）に応じてリクエストを再試行する必要があり、4.15（サポートされていないコンテンツフォーマット、415を受信するときにリンク形式に戻る必要があります。http）。"
    },
    {
      "indent": 3,
      "text": "An RD MAY make the information submitted to it available to further directories (subject to security policies on link confidentiality) if it can ensure that a loop does not form. The protocol used between directories to ensure loop-free operation is outside the scope of this document.",
      "ja": "RDは、ループが形成されないことを保証できる場合、追加のディレクトリ（リンクの機密性に関するセキュリティポリシーの対象となる）で提出された情報を利用可能にすることができます。ディレクトリ間で使用されるプロトコルは、ループフリーの操作がこのドキュメントの範囲外であることを確認します。"
    },
    {
      "indent": 0,
      "text": "4.1. Finding a Resource Directory",
      "section_title": true,
      "ja": "4.1. リソースディレクトリを見つける"
    },
    {
      "indent": 3,
      "text": "A (re)starting device may want to find one or more RDs before it can discover their URIs. Dependent on the operational conditions, one or more of the techniques below apply.",
      "ja": "（再）開始デバイスは、URIを発見する前に1つ以上のRDを見つけたい場合があります。運用条件に応じて、以下の1つ以上の手法が適用されます。"
    },
    {
      "indent": 3,
      "text": "The device may be preconfigured to exercise specific mechanisms for finding the RD:",
      "ja": "このデバイスは、RDを見つけるための特定のメカニズムを行使するために事前に設定される場合があります。"
    },
    {
      "indent": 3,
      "text": "1. It may be configured with a specific IP address for the RD. That IP address may also be an anycast address, allowing the network to forward RD requests to an RD that is topologically close; each target network environment in which some of these preconfigured nodes are to be brought up is then configured with a route for this anycast address that leads to an appropriate RD. (Instead of using an anycast address, a multicast address can also be preconfigured. The RD servers then need to configure one of their interfaces with this multicast address.)",
      "ja": "1. RDの特定のIPアドレスで構成される場合があります。そのIPアドレスはまた、Anycastアドレスである可能性があり、ネットワークがRD要求をトポロジカルに近いRDに転送できるようにします。これらの事前に構成されたノードのいくつかを育てる各ターゲットネットワーク環境は、適切なRDにつながるこのAnycastアドレスのルートで構成されます。（Anycastアドレスを使用する代わりに、マルチキャストアドレスを事前に設定することもできます。RDサーバーは、このマルチキャストアドレスでインターフェイスの1つを構成する必要があります。）"
    },
    {
      "indent": 3,
      "text": "2. It may be configured with a DNS name for the RD and use DNS to return the IP address of the RD; it can find a DNS server to perform the lookup using the usual mechanisms for finding DNS servers.",
      "ja": "2. RDのDNS名で構成され、DNSを使用してRDのIPアドレスを返します。DNSサーバーを見つけるための通常のメカニズムを使用してルックアップを実行するDNSサーバーを見つけることができます。"
    },
    {
      "indent": 3,
      "text": "3. It may be configured to use a service discovery mechanism, such as DNS-based Service Discovery (DNS-SD), as outlined in Section 4.1.2.",
      "ja": "3. セクション4.1.2で概説されているように、DNSベースのサービスディスカバリー（DNS-SD）などのサービスディスカバリーメカニズムを使用するように構成される場合があります。"
    },
    {
      "indent": 3,
      "text": "For cases where the device is not specifically configured with a way to find an RD, the network may want to provide a suitable default.",
      "ja": "デバイスがRDを見つける方法で特別に構成されていない場合、ネットワークは適切なデフォルトを提供することを望む場合があります。"
    },
    {
      "indent": 3,
      "text": "1. The IPv6 Neighbor Discovery option RDAO (Section 4.1.1) can do that.",
      "ja": "1. IPv6 Neighbor Discovery Option RDAO（セクション4.1.1）はそれを行うことができます。"
    },
    {
      "indent": 3,
      "text": "2. When DHCP is in use, this could be provided via a DHCP option (no such option is defined at the time of writing).",
      "ja": "2. DHCPが使用されている場合、これはDHCPオプションを介して提供できます（執筆時点ではそのようなオプションは定義されていません）。"
    },
    {
      "indent": 3,
      "text": "Finally, if neither the device nor the network offers any specific configuration, the device may want to employ heuristics to find a suitable RD.",
      "ja": "最後に、デバイスもネットワークも特定の構成を提供しない場合、デバイスは、適切なRDを見つけるためにヒューリスティックを使用したい場合があります。"
    },
    {
      "indent": 3,
      "text": "The present specification does not fully define these heuristics but suggests a number of candidates:",
      "ja": "現在の仕様では、これらのヒューリスティックを完全に定義するものではなく、多くの候補者を示唆しています。"
    },
    {
      "indent": 3,
      "text": "1. In a 6LoWPAN, just assume the 6LBR can act as an RD (using the Authoritative Border Router Option (ABRO) to find that [RFC6775]). Confirmation can be obtained by sending a unicast GET to coap://[6LBR]/.well-known/core?rt=core.rd*.",
      "ja": "1. 6lowpanでは、6LBRがRDとして機能すると仮定します（[RFC6775]を見つけるために、権威ある境界ルーターオプション（ABRO）を使用）。確認は、Unicast Get get in coap：// [6lbr] /.well-nking/core?rt=core.rd*を送信することで取得できます。"
    },
    {
      "indent": 3,
      "text": "2. In a network that supports multicast well, discover the RD using a multicast query for /.well-known/core, as specified in CoRE Link Format [RFC6690], and send a Multicast GET to coap://[ff0x::fe]/.well-known/core?rt=core.rd*. RDs within the multicast scope will answer the query.",
      "ja": "2. マルチキャストウェルをサポートするネットワークでは、コアリンク形式[RFC6690]で指定されているように、/.Well-known/Coreのマルチキャストクエリを使用してRDを発見し、マルチキャストをCoap：// [ff0x :: fe]に送信します/.WELL-NOWNES/CORE?RT=CORE.RD*。マルチキャストスコープ内のRDSがクエリに回答します。"
    },
    {
      "indent": 3,
      "text": "When answering a multicast request directed at a link-local group, the RD may want to respond from a routable address; this makes it easier for registrants to use one of their own routable addresses for registration. When source addresses are selected using the mechanism described in [RFC6724], this can be achieved by applying the changes of its Section 10.4, picking public addresses in Rule 7 of its Section 5, and superseding Rule 8 with preferring the source address's precedence.",
      "ja": "Link-Localグループに向けられたマルチキャストリクエストに答えるとき、RDはルーティング可能なアドレスから応答したい場合があります。これにより、登録者は登録に独自のルーティング可能なアドレスの1つを簡単に使用できます。[RFC6724]で説明されているメカニズムを使用してソースアドレスを選択すると、セクション10.4の変更を適用し、セクション5のルール7でパブリックアドレスを選択し、ソースアドレスの優先順位を好むルール8に取って代わることで実現できます。"
    },
    {
      "indent": 3,
      "text": "As some of the RD addresses obtained by the methods listed here are just (more or less educated) guesses, endpoints MUST make use of any error messages to very strictly rate-limit requests to candidate IP addresses that don't work out. For example, an ICMP Destination Unreachable message (and, in particular, the port unreachable code for this message) may indicate the lack of a CoAP server on the candidate host, or a CoAP error response code, such as 4.05 (Method Not Allowed), may indicate unwillingness of a CoAP server to act as a directory server.",
      "ja": "ここにリストされている方法で取得されたRDアドレスの一部は、（多かれ少なかれ教育を受けた）推測であるため、エンドポイントは、うまくいかない候補IPアドレスに対する非常に厳密にレート制限リクエストにエラーメッセージを使用する必要があります。たとえば、ICMP宛先の到達不可能なメッセージ（特に、このメッセージのポートの到達不可能なコード）は、候補ホストにCOAPサーバーがないこと、または4.05などのCOAPエラー応答コード（許可されていない方法）を示している場合があります。、COAPサーバーがディレクトリサーバーとして機能することを不本意であることを示している場合があります。"
    },
    {
      "indent": 3,
      "text": "The following RD discovery mechanisms are recommended:",
      "ja": "次のRD発見メカニズムが推奨されます。"
    },
    {
      "indent": 3,
      "text": "* In managed networks with border routers that need stand-alone operation, the RDAO is recommended (e.g., the operational phase described in Section 3.6).",
      "ja": "* スタンドアロン操作が必要なボーダールーターを備えたマネージドネットワークでは、RDAOが推奨されます（たとえば、セクション3.6で説明されている動作段階）。"
    },
    {
      "indent": 3,
      "text": "* In managed networks without border routers (no Internet services available), the use of a preconfigured anycast address is recommended (e.g., the installation phase described in Section 3.6).",
      "ja": "* ボーダールーターのないマネージドネットワーク（インターネットサービスは利用できません）では、事前に構成されたAnycastアドレスの使用が推奨されます（たとえば、セクション3.6で説明されているインストールフェーズ）。"
    },
    {
      "indent": 3,
      "text": "* In networks managed using DNS-SD, the use of DNS-SD for discovery, as described in Section 4.1.2, is recommended.",
      "ja": "* DNS-SDを使用して管理されたネットワークでは、セクション4.1.2で説明されているように、DNS-SDの使用を推奨します。"
    },
    {
      "indent": 3,
      "text": "The use of multicast discovery in mesh networks is NOT RECOMMENDED.",
      "ja": "メッシュネットワークでのマルチキャストディスカバリーの使用は推奨されません。"
    },
    {
      "indent": 0,
      "text": "4.1.1. Resource Directory Address Option (RDAO)",
      "section_title": true,
      "ja": "4.1.1. リソースディレクトリアドレスオプション（RDAO）"
    },
    {
      "indent": 3,
      "text": "The Resource Directory Address Option (RDAO) carries information about the address of the RD in RAs (Router Advertisements) of IPv6 Neighbor Discovery (ND), similar to how Recursive DNS Server (RDNSS) options [RFC8106] are sent. This information is needed when endpoints cannot discover the RD with a link-local or realm-local scope multicast address, for instance, because the endpoint and the RD are separated by a 6LBR. In many circumstances, the availability of DHCP cannot be guaranteed during commissioning of the network either. The presence and the use of the RD is essential during commissioning.",
      "ja": "リソースディレクトリアドレスオプション（RDAO）は、再帰的なDNSサーバー（RDNSS）オプション[RFC8106]の送信方法と同様に、IPv6 Neighbor Discovery（ND）のRAS（Router Advertisements）のRDのアドレスに関する情報を伝達します。エンドポイントは、エンドポイントとRDが6LBRで分離されているため、エンドポイントがリンクローカルまたはレルムローカルスコープマルチキャストアドレスを持つRDを発見できない場合に必要です。多くの場合、ネットワークの試運転中にもDHCPの可用性を保証することはできません。RDの存在と使用は、試運転中に不可欠です。"
    },
    {
      "indent": 3,
      "text": "It is possible to send multiple RDAOs in one message, indicating as many RD addresses.",
      "ja": "複数のRDAOを1つのメッセージに送信することができ、多くのRDアドレスを示すことができます。"
    },
    {
      "indent": 3,
      "text": "The RDAO format is:",
      "ja": "RDAO形式は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "0                   1                   2                   3\n0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Type      |  Length = 3   |          Reserved             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                        Valid Lifetime                         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                                                               |\n+                                                               +\n|                                                               |\n+                          RD Address                           +\n|                                                               |\n+                                                               +\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 16,
      "text": "Figure 4: Resource Directory Address Option",
      "ja": "図4：リソースディレクトリアドレスオプション"
    },
    {
      "indent": 3,
      "text": "Fields:",
      "ja": "田畑："
    },
    {
      "indent": 3,
      "text": "Type: 41",
      "ja": "タイプ：41"
    },
    {
      "indent": 3,
      "text": "Length: 8-bit unsigned integer. The length of the option in units of 8 bytes. Always 3.",
      "ja": "長さ：8ビットの符号なし整数。8バイトの単位単位のオプションの長さ。常に3。"
    },
    {
      "indent": 3,
      "text": "Reserved: This field is unused. It MUST be initialized to zero by the sender and MUST be ignored by the receiver.",
      "ja": "予約済み：このフィールドは未使用です。送信者はゼロに初期化する必要があり、受信機は無視する必要があります。"
    },
    {
      "indent": 3,
      "text": "Valid Lifetime: 32-bit unsigned integer. The length of time in seconds (relative to the time the packet is received) that this RD address is valid. A value of all zero bits (0x0) indicates that this RD address is not valid anymore.",
      "ja": "有効な寿命：32ビットの符号なし整数。このRDアドレスが有効であるという秒単位の時間（パケットが受信される時間と比較して）。すべてのゼロビット（0x0）の値は、このRDアドレスがもはや有効ではないことを示しています。"
    },
    {
      "indent": 3,
      "text": "RD Address: IPv6 address of the RD.",
      "ja": "RDアドレス：RDのIPv6アドレス。"
    },
    {
      "indent": 0,
      "text": "4.1.2. Using DNS-SD to Discover a Resource Directory",
      "section_title": true,
      "ja": "4.1.2. DNS-SDを使用してリソースディレクトリを発見します"
    },
    {
      "indent": 3,
      "text": "An RD can advertise its presence in DNS-SD [RFC6763] using the service names defined in this document: _core-rd._udp (for CoAP), _core-rd-dtls._udp (for CoAP over DTLS), _core-rd._tcp (for CoAP over TCP), or _core-rd-tls._tcp (for CoAP over TLS). (For the WebSocket transports of CoAP, no service is defined, as DNS-SD is typically unavailable in environments where CoAP over WebSockets is used.)",
      "ja": "RDは、このドキュメントで定義されているサービス名を使用して、DNS-SD [RFC6763]でその存在を宣伝できます：_CORE-RD._UDP（coap）、_core-rd-dtls._udp（dtls over dtls over dtls）、_core-rd。_TCP（TCPを超えるCOAP用）、または_Core-RD-TLS._TCP（TLSを超えるCoAP用）。（COAPのWebSocket Transportsの場合、DNS-SDは通常、WebSocketsのCOAPが使用される環境では利用できないため、サービスは定義されていません。）"
    },
    {
      "indent": 3,
      "text": "The selection of the service indicates the protocol used, and the SRV record points the client to a host name and port to use as a starting point for the \"URI discovery\" steps of Section 4.3.",
      "ja": "サービスの選択は使用されたプロトコルを示し、SRVレコードはクライアントをホスト名とポートに指して、セクション4.3の「URI発見」ステップの出発点として使用します。"
    },
    {
      "indent": 3,
      "text": "This section is a simplified, concrete application of the more generic mechanism specified in [CORE-RD-DNS-SD].",
      "ja": "このセクションは、[core-rd-dns-sd]で指定されたより一般的なメカニズムの単純化された具体的なアプリケーションです。"
    },
    {
      "indent": 0,
      "text": "4.2. Payload Content Formats",
      "section_title": true,
      "ja": "4.2. ペイロードコンテンツフォーマット"
    },
    {
      "indent": 3,
      "text": "RDs implementing this specification MUST support the application/ link-format content format (ct=40).",
      "ja": "この仕様を実装するRDSは、アプリケーション/リンク形式のコンテンツ形式（CT = 40）をサポートする必要があります。"
    },
    {
      "indent": 3,
      "text": "RDs implementing this specification MAY support additional content formats.",
      "ja": "この仕様を実装するRDSは、追加のコンテンツ形式をサポートする場合があります。"
    },
    {
      "indent": 3,
      "text": "Any additional content format supported by an RD implementing this specification SHOULD be able to express all the information expressible in link format. It MAY be able to express information that is inexpressible in link format, but those expressions SHOULD be avoided where possible.",
      "ja": "この仕様を実装するRDによってサポートされる追加のコンテンツ形式は、リンク形式で表現可能なすべての情報を表現できるはずです。リンク形式では表現できない情報を表現できる場合がありますが、可能な場合はこれらの式を避ける必要があります。"
    },
    {
      "indent": 0,
      "text": "4.3. URI Discovery",
      "section_title": true,
      "ja": "4.3. URIディスカバリー"
    },
    {
      "indent": 3,
      "text": "Before an endpoint can make use of an RD, it must first know the RD's address and port and the URI path information for its REST APIs. This section defines discovery of the RD and its URIs using the well-known interface of the CoRE Link Format [RFC6690] after having discovered a host, as described in Section 4.1.",
      "ja": "エンドポイントがRDを使用する前に、最初にRDのアドレスとポートとそのREST APIのURIパス情報を知る必要があります。このセクションでは、セクション4.1で説明されているように、ホストを発見した後、コアリンク形式[RFC6690]のよく知られたインターフェイスを使用して、RDとそのURIの発見を定義します。"
    },
    {
      "indent": 3,
      "text": "Discovery of the RD registration URI is performed by sending either a multicast or unicast GET request to /.well-known/core and including a resource type (rt) parameter [RFC6690] with the value \"core.rd\" in the query string. Likewise, a resource type parameter value of \"core.rd-lookup*\" is used to discover the URIs for RD lookup operations, and \"core.rd*\" is used to discover all URIs for RD operations. Upon success, the response will contain a payload with a link format entry for each RD function discovered, indicating the URI of the RD function returned and the corresponding resource type. When performing multicast discovery, the multicast IP address used will depend on the scope required and the multicast capabilities of the network (see Section 9.5).",
      "ja": "RD登録URIの発見は、マルチキャストまたはユニキャストGETリクエストを /.Well-Nowned/Coreに送信し、クエリ文字列に値「Core.RD」を含むリソースタイプ（RT）パラメーター[RFC6690]を含めて実行されます。同様に、「core.rd-lookup*」のリソースタイプパラメーター値を使用して、RDルックアップ操作のURISを発見し、「core.rd*」を使用して、RD操作のすべてのURIを発見します。成功すると、応答には、発見された各RD関数のリンク形式エントリを備えたペイロードが含まれ、RD関数のURIが返され、対応するリソースタイプが示されます。マルチキャスト発見を実行する場合、使用されるマルチキャストIPアドレスは、必要なスコープとネットワークのマルチキャスト機能に依存します（セクション9.5を参照）。"
    },
    {
      "indent": 3,
      "text": "An RD MAY provide hints about the content formats it supports in the links it exposes or registers, using the \"ct\" target attribute, as shown in the example below. Clients MAY use these hints to select alternate content formats for interaction with the RD.",
      "ja": "RDは、以下の例に示すように、「CT」ターゲット属性を使用して、「CT」ターゲット属性を使用して、公開またはレジスタでサポートするコンテンツ形式に関するヒントを提供できます。クライアントは、これらのヒントを使用して、RDとのやり取りのために代替コンテンツ形式を選択できます。"
    },
    {
      "indent": 3,
      "text": "HTTP does not support multicast, and, consequently, only unicast discovery can be supported using the HTTP /.well-known/core resource.",
      "ja": "HTTPはマルチキャストをサポートしておらず、その結果、HTTP /.Well-Nownd/Coreリソースを使用してユニキャストの発見のみをサポートできます。"
    },
    {
      "indent": 3,
      "text": "RDs implementing this specification MUST support query filtering for the rt parameter, as defined in [RFC6690].",
      "ja": "[RFC6690]で定義されているように、この仕様を実装するRDSは、RTパラメーターのクエリフィルタリングをサポートする必要があります。"
    },
    {
      "indent": 3,
      "text": "While the link targets in this discovery step are often expressed in path-absolute form, this is not a requirement. Clients of the RD SHOULD therefore accept URIs of all schemes they support, both as URIs and relative references, and not limit the set of discovered URIs to those hosted at the address used for URI discovery.",
      "ja": "この発見ステップのリンクターゲットは、多くの場合、パスアブソリュート形式で表されることがよくありますが、これは要件ではありません。したがって、RDのクライアントは、URISと相対的な参照としてサポートするすべてのスキームのURIを受け入れる必要があり、発見されたURIのセットをURIディスカバリーに使用したアドレスでホストされているものに制限する必要はありません。"
    },
    {
      "indent": 3,
      "text": "With security policies where the client requires the RD to be authorized to act as an RD, that authorization may be limited to resources on which the authorized RD advertises the adequate resource types. Clients that have obtained links they cannot rely on yet can repeat the \"URI discovery\" step at the /.well-known/core resource of the indicated host to obtain the resource type information from an authorized source.",
      "ja": "クライアントがRDがRDとして行動することを許可することを要求するセキュリティポリシーでは、その認可は、認定されたRDが適切なリソースタイプを宣伝するリソースに限定される場合があります。まだ依存できないリンクを取得したクライアントは、指定されたホストの /.Well-Nownd/Coreリソースで「URI Discovery」ステップを繰り返して、承認されたソースからリソースタイプ情報を取得できます。"
    },
    {
      "indent": 3,
      "text": "The URI discovery operation can yield multiple URIs of a given resource type. The client of the RD can try out any of the discovered addresses.",
      "ja": "URIディスカバリー操作は、特定のリソースタイプの複数のURIを生成できます。RDのクライアントは、発見されたアドレスを試してみることができます。"
    },
    {
      "indent": 3,
      "text": "The discovery request interface is specified as follows (this is exactly the well-known interface of [RFC6690], Section 4, with the additional requirement that the server MUST support query filtering):",
      "ja": "ディスカバリーリクエストインターフェイスは、次のように指定されています（これは[RFC6690]、セクション4のよく知られたインターフェイスであり、サーバーがクエリフィルタリングをサポートする必要があるという追加要件があります）："
    },
    {
      "indent": 3,
      "text": "Interaction:  EP, CT, or Client -> RD",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Method: GET",
      "ja": "方法：取得します"
    },
    {
      "indent": 3,
      "text": "URI Template:  /.well-known/core{?rt}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "URI Template Variables:",
      "ja": "URIテンプレート変数："
    },
    {
      "indent": 6,
      "text": "rt := Resource Type. SHOULD contain one of the values \"core.rd\", \"core.rd-lookup*\", \"core.rd-lookup-res\", \"core.rd-lookup-ep\", or \"core.rd*\"",
      "ja": "RT：=リソースタイプ。値「core.rd」、「core.rd-lookup*」、「core.rd-lookup-res」、「core.rd-lookup-ep」、または「core.rd*」の値の1つを含める必要があります。"
    },
    {
      "indent": 3,
      "text": "Accept: absent, application/link-format, or any other media type representing web links",
      "ja": "受け入れ：不在、アプリケーション/リンク形式、またはWebリンクを表すその他のメディアタイプ"
    },
    {
      "indent": 3,
      "text": "The following response is expected on this interface:",
      "ja": "このインターフェイスでは、次の応答が予想されます。"
    },
    {
      "indent": 3,
      "text": "Success: 2.05 (Content) or 200 (OK) with an application/link-format or other web link payload containing one or more matching entries for the RD resource.",
      "ja": "成功：RDリソースの1つ以上のマッチングエントリを含むアプリケーション/リンクフォーマットまたはその他のWebリンクペイロードを使用した2.05（コンテンツ）または200（OK）。"
    },
    {
      "indent": 3,
      "text": "The following example shows an endpoint discovering an RD using this interface, thus learning that the directory resource location in this example is /rd and that the content format delivered by the server hosting the resource is application/link-format (ct=40). Note that it is up to the RD to choose its RD locations.",
      "ja": "次の例は、このインターフェイスを使用してRDを発見するエンドポイントを示しているため、この例のディレクトリリソースの場所が /RDであり、リソースをホストするサーバーが配信するコンテンツ形式がアプリケーション /リンクフォーマット（CT = 40）であることがわかります。RDの場所を選択するのはRD次第であることに注意してください。"
    },
    {
      "indent": 3,
      "text": "Req: GET coap://[ff02::fe]/.well-known/core?rt=core.rd*",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Res: 2.05 Content\nPayload:\n</rd>;rt=core.rd;ct=40,\n</rd-lookup/ep>;rt=core.rd-lookup-ep;ct=40,\n</rd-lookup/res>;rt=core.rd-lookup-res;ct=40",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 20,
      "text": "Figure 5: Example Discovery Exchange",
      "ja": "図5：発見の例"
    },
    {
      "indent": 3,
      "text": "The following example shows the way of indicating that a client may request alternate content formats. The Content-Format code attribute \"ct\" MAY include a space-separated sequence of Content-Format codes, as specified in Section 7.2.1 of [RFC7252], indicating that multiple content formats are available. The example below shows the required Content-Format 40 (application/link-format) indicated, as well as Concise Binary Object Representation (CBOR) and JSON representations in the style of [CORE-LINKS-JSON] (for which the experimental values 65060 and 65050 are used in this example). The RD resource locations /rd and /rd-lookup are example values. The server in this example also indicates that it is capable of providing observation on resource lookups.",
      "ja": "次の例は、クライアントが代替コンテンツ形式を要求できることを示す方法を示しています。コンテンツフォーマットコード属性「CT」には、[RFC7252]のセクション7.2.1で指定されているように、コンテンツ形式コードのスペース分離シーケンスが含まれる場合があり、複数のコンテンツ形式が利用可能であることを示します。以下の例は、必要なコンテンツフォーマット40（アプリケーション/リンク形式）と、[Core-Links-JSON]のスタイルの簡潔なバイナリオブジェクト表現（CBOR）およびJSON表現を示しています（実験値65060この例では65050が使用されています）。RD Resource Locations /RDおよび /RD-Lookupは例の値です。この例のサーバーは、リソースの検索に関する観察を提供できることも示しています。"
    },
    {
      "indent": 3,
      "text": "Req: GET coap://[ff02::fe]/.well-known/core?rt=core.rd*",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Res: 2.05 Content\nPayload:\n</rd>;rt=core.rd;ct=40,\n</rd-lookup/res>;rt=core.rd-lookup-res;ct=\"40 65060 65050\";obs,\n</rd-lookup/ep>;rt=core.rd-lookup-ep;ct=\"40 65060 65050\"",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 9,
      "text": "Figure 6: Example Discovery Exchange Indicating Additional Content-Formats",
      "ja": "図6：追加のコンテンツ形式を示す発見交換の例"
    },
    {
      "indent": 3,
      "text": "For maintenance, management, and debugging, it can be useful to identify the components that constitute the RD server. The identification can be used to find client-server incompatibilities, supported features, required updates, and other aspects. The well-known interface described in Section 4 of [RFC6690] can be used to find such data.",
      "ja": "メンテナンス、管理、およびデバッグの場合、RDサーバーを構成するコンポーネントを識別することが役立ちます。識別を使用して、クライアントサーバーの非互換性、サポートされている機能、必要な更新、その他の側面を見つけることができます。[RFC6690]のセクション4で説明されているよく知られているインターフェイスを使用して、そのようなデータを見つけることができます。"
    },
    {
      "indent": 3,
      "text": "It would typically be stored in an implementation information link (as described in [T2TRG-REL-IMPL]).",
      "ja": "通常、実装情報リンクに保存されます（[T2TRG-REL-IMPL]で説明されています）。"
    },
    {
      "indent": 3,
      "text": "Req: GET /.well-known/core?rel=impl-info",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Res: 2.05 Content\nPayload:\n<http://software.example.com/shiny-resource-directory/1.0beta1>;\n    rel=impl-info",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 9,
      "text": " Figure 7: Example Exchange of Obtaining Implementation Information Using the Relation Type Currently Proposed in [T2TRG-REL-IMPL]",
      "ja": "図7：[T2TRG-REL-IMPL]で現在提案されている関係タイプを使用して、実装情報を取得することの例交換"
    },
    {
      "indent": 3,
      "text": "Note that, depending on the particular server's architecture, such a link could be anchored at the RD server's root (as in this example) or at individual RD components. The latter is to be expected when different applications are run on the same server.",
      "ja": "特定のサーバーのアーキテクチャに応じて、このようなリンクは、RDサーバーのルート（この例のように）または個々のRDコンポーネントに固定される可能性があることに注意してください。後者は、同じサーバーで異なるアプリケーションが実行されると予想されます。"
    },
    {
      "indent": 0,
      "text": "5. Registration",
      "section_title": true,
      "ja": "5. 登録"
    },
    {
      "indent": 3,
      "text": "After discovering the location of an RD, a registrant-EP or CT MAY register the resources of the registrant-EP using the registration interface. This interface accepts a POST from an endpoint containing the list of resources to be added to the directory as the message payload in the CoRE Link Format [RFC6690] or other representations of web links, along with query parameters indicating the name of the endpoint and, optionally, the sector, lifetime, and base URI of the registration. It is expected that other specifications will define further parameters (see Section 9.3). The RD then creates a new registration resource in the RD and returns its location. The receiving endpoint MUST use that location when refreshing registrations using this interface. Registration resources in the RD are kept active for the period indicated by the lifetime parameter. The creating endpoint is responsible for refreshing the registration resource within this period, using either the registration or update interface. The registration interface MUST be implemented to be idempotent, so that registering twice with the same endpoint parameters ep and d (sector) does not create multiple registration resources.",
      "ja": "RDの場所を発見した後、登録者のEPまたはCTは、登録インターフェイスを使用して登録者-EPのリソースを登録することができます。このインターフェイスは、コアリンク形式[RFC6690]のメッセージペイロードとしてディレクトリに追加されるリソースのリストを含むエンドポイントからの投稿を受け入れます。オプションで、登録のセクター、生涯、および基地URI。他の仕様がさらなるパラメーターを定義することが期待されています（セクション9.3を参照）。その後、RDはRDに新しい登録リソースを作成し、その場所を返します。受信エンドポイントは、このインターフェイスを使用して登録を更新するときにその場所を使用する必要があります。 RDの登録リソースは、生涯パラメーターで示される期間、アクティブに保たれます。作成エンドポイントは、登録インターフェイスまたは更新インターフェイスのいずれかを使用して、この期間内に登録リソースを更新する責任があります。登録インターフェイスは、同じエンドポイントパラメーターEPおよびD（セクター）に2回登録しても、複数の登録リソースを作成しないように、等程度になるように実装する必要があります。"
    },
    {
      "indent": 3,
      "text": "The following rules apply for a registration request targeting a given (ep, d) value pair:",
      "ja": "次のルールは、特定の（EP、d）値ペアをターゲットとする登録要求に適用されます。"
    },
    {
      "indent": 3,
      "text": "* When the (ep, d) value pair of the registration request is different from any existing registration, a new registration is generated.",
      "ja": "* 登録要求の（ep、d）値ペアが既存の登録とは異なる場合、新しい登録が生成されます。"
    },
    {
      "indent": 3,
      "text": "* When the (ep, d) value pair of the registration request is equal to an existing registration, the content and parameters of the existing registration are replaced with the content of the registration request. As with changes to registration resources, security policies (Section 7) usually require such requests to come from the same device.",
      "ja": "* 登録要求の（ep、d）値ペアが既存の登録に等しい場合、既存の登録のコンテンツとパラメーターは登録要求のコンテンツに置き換えられます。登録リソースの変更と同様に、セキュリティポリシー（セクション7）は通常、同じデバイスからのリクエストを必要とします。"
    },
    {
      "indent": 3,
      "text": "The posted link-format document can (and typically does) contain relative references both in its link targets and in its anchors; it can also contain empty anchors. The RD server needs to resolve these references in order to faithfully represent them in lookups. They are resolved against the base URI of the registration, which is provided either explicitly in the base parameter or constructed implicitly from the requester's URI, as constructed from its network address and scheme.",
      "ja": "投稿されたリンクフォーマットドキュメントには、リンクターゲットとアンカーの両方に相対的な参照を含めることができます（および通常そうする）ことができます。空のアンカーも含めることができます。RDサーバーは、ルックアップで忠実に表現するために、これらの参照を解決する必要があります。それらは、ネットワークアドレスとスキームから構築されたように、登録のベースURIに対して解決されます。"
    },
    {
      "indent": 3,
      "text": "For media types to which Appendix C applies (i.e., documents in application/link-format), request bodies MUST be expressed in Limited Link Format.",
      "ja": "付録Cが適用されるメディアタイプ（つまり、アプリケーション/リンクフォーマットのドキュメント）の場合、リクエストボディは限られたリンク形式で表現する必要があります。"
    },
    {
      "indent": 3,
      "text": "The registration request interface is specified as follows:",
      "ja": "登録要求インターフェイスは、次のように指定されています。"
    },
    {
      "indent": 3,
      "text": "Interaction:  EP or CT -> RD",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Method: POST",
      "ja": "方法：投稿"
    },
    {
      "indent": 3,
      "text": "URI Template:  {+rd}{?ep,d,lt,base,extra-attrs*}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "URI Template Variables:",
      "ja": "URIテンプレート変数："
    },
    {
      "indent": 6,
      "text": "rd := RD registration URI (mandatory). This is the location of the RD, as obtained from discovery.",
      "ja": "RD：= RD登録URI（必須）。これは、発見から得られたRDの場所です。"
    },
    {
      "indent": 6,
      "text": "ep := Endpoint name (mostly mandatory). The endpoint name is an identifier that MUST be unique within a sector.",
      "ja": "EP：=エンドポイント名（ほとんど必須）。エンドポイント名は、セクター内で一意でなければならない識別子です。"
    },
    {
      "indent": 9,
      "text": "As the endpoint name is a Unicode string, it is encoded in UTF-8 (and possibly percent encoded) during variable expansion (see [RFC6570], Section 3.2.1). The endpoint name MUST NOT contain any character in the inclusive ranges 0-31 or 127-159.",
      "ja": "エンドポイント名はユニコード文字列であるため、可変拡張中にUTF-8（およびおそらくエンコードされた割合）でエンコードされます（[RFC6570]、セクション3.2.1を参照）。エンドポイント名には、包括的な範囲0〜31または127-159に文字が含まれてはなりません。"
    },
    {
      "indent": 9,
      "text": "The maximum length of this parameter is 63 bytes encoded in UTF-8.",
      "ja": "このパラメーターの最大長は、UTF-8でエンコードされた63バイトです。"
    },
    {
      "indent": 9,
      "text": "If the RD is configured to recognize the endpoint that is to be authorized to use exactly one endpoint name, the RD assigns that name. In that case, giving the endpoint name becomes optional for the client; if the client gives any other endpoint name, it is not authorized to perform the registration.",
      "ja": "RDが1つのエンドポイント名を正確に使用することを許可されるエンドポイントを認識するように構成されている場合、RDはその名前を割り当てます。その場合、エンドポイント名を与えることはクライアントにとってオプションになります。クライアントが他のエンドポイント名を指定した場合、登録を実行することは許可されていません。"
    },
    {
      "indent": 6,
      "text": "d := Sector (optional). This is the sector to which this endpoint belongs. When this parameter is not present, the RD MAY associate the endpoint with a configured default sector (possibly based on the endpoint's authorization) or leave it empty.",
      "ja": "D：=セクター（オプション）。これは、このエンドポイントが属するセクターです。このパラメーターが存在しない場合、RDはエンドポイントを構成されたデフォルトセクター（おそらくエンドポイントの承認に基づいて）に関連付けるか、空のままにしておくことがあります。"
    },
    {
      "indent": 9,
      "text": "The sector is encoded like the ep parameter and is limited to 63 bytes encoded in UTF-8 as well.",
      "ja": "セクターはEPパラメーターのようにエンコードされており、UTF-8でもエンコードされた63バイトに制限されています。"
    },
    {
      "indent": 6,
      "text": "lt := Lifetime (optional). This is the lifetime of the registration in seconds, with a range of 1-4294967295. If no lifetime is included in the initial registration, a default value of 90000 (25 hours) SHOULD be assumed.",
      "ja": "LT：= lifetime（オプション）。これは、1-4294967295の範囲で、数秒での登録の寿命です。最初の登録に寿命が含まれていない場合、90000（25時間）のデフォルト値を想定する必要があります。"
    },
    {
      "indent": 6,
      "text": "base := Base URI (optional). This parameter sets the base URI of the registration, under which the relative links in the payload are to be interpreted. The specified URI typically does not have a path component of its own and MUST be suitable as a base URI to resolve any relative references given in the registration. The parameter is therefore usually of the shape \"scheme://authority\" for HTTP and CoAP URIs. The URI SHOULD NOT have a query or fragment component, as any non-empty relative part in a reference would remove those parts from the resulting URI.",
      "ja": "ベース：=ベースURI（オプション）。このパラメーターは、登録のベースURIを設定します。その下には、ペイロードの相対リンクが解釈されます。指定されたURIには通常、独自のパスコンポーネントがなく、登録で与えられた相対的な参照を解決するためのベースURIとして適している必要があります。したがって、パラメーターは通常、HTTPおよびCOAP URIの形状「Scheme：// Authority」です。参照内の空でない相対部品が得られたURIからそれらの部分を削除するため、URIにはクエリまたはフラグメントコンポーネントがないはずです。"
    },
    {
      "indent": 9,
      "text": "In the absence of this parameter, the scheme of the protocol, the source address, and the source port of the registration request are assumed. The base URI is consecutively constructed by concatenating the used protocol's scheme with the characters \"://\", the requester's source address as an address literal, and \":\" followed by its port (if it was not the protocol's default one). This is analogous to the process described in [RFC7252], Section 6.5.",
      "ja": "このパラメーターがない場合、プロトコルのスキーム、ソースアドレス、および登録要求のソースポートが想定されます。ベースのURIは、使用されたプロトコルのスキームを文字「：//」と連結することにより連続して構築されます。リクエスト担当者のソースアドレスはリテラルとして、「：」に続いてポートが続きます（プロトコルのデフォルトのものではなかった場合）。これは、[RFC7252]、セクション6.5で説明されているプロセスに類似しています。"
    },
    {
      "indent": 9,
      "text": "This parameter is mandatory when the directory is filled by a third party, such as a commissioning tool.",
      "ja": "このパラメーターは、試運転ツールなどの第三者によってディレクトリが入力されている場合に必須です。"
    },
    {
      "indent": 9,
      "text": "If the registrant-EP uses an ephemeral port to register with, it MUST include the base parameter in the registration to provide a valid network path.",
      "ja": "登録者-EPが一時的なポートを使用して登録する場合、登録にベースパラメーターを含めて有効なネットワークパスを提供する必要があります。"
    },
    {
      "indent": 9,
      "text": "A registrant that cannot be reached by potential lookup clients at the address it registers from (e.g., because it is behind some form of Network Address Translation (NAT)) MUST provide a reachable base address with its registration.",
      "ja": "登録するアドレスで潜在的なルックアップクライアントが到達できない登録者（たとえば、何らかの形のネットワークアドレス変換（NAT）の背後にあるため）は、登録に到達可能なベースアドレスを提供する必要があります。"
    },
    {
      "indent": 9,
      "text": "If the base URI contains a link-local IP literal, it MUST NOT contain a Zone Identifier and MUST be local to the link on which the registration request is received.",
      "ja": "ベースのURIにリンクローカルIPリテラルが含まれている場合、ゾーン識別子を含めてはならず、登録要求が受信されるリンクにローカルでなければなりません。"
    },
    {
      "indent": 9,
      "text": "Endpoints that register with a base that contains a path component cannot efficiently express their registrations in Limited Link Format (Appendix C). Those applications should use different representations of links to which Appendix C is not applicable (e.g., [CORE-CORAL]).",
      "ja": "パスコンポーネントを含むベースに登録するエンドポイントは、限られたリンク形式で登録を効率的に表現できません（付録C）。これらのアプリケーションは、付録Cが適用されないリンクの異なる表現を使用する必要があります（例：[コアコラル]）。"
    },
    {
      "indent": 6,
      "text": "extra-attrs := Additional registration attributes (optional). The endpoint can pass any parameter registered in Section 9.3 to the directory. If the RD is aware of the parameter's specified semantics, it processes the parameter accordingly. Otherwise, it MUST store the unknown key and its value(s) as an endpoint attribute for further lookup.",
      "ja": "extra-attrs：=追加の登録属性（オプション）。エンドポイントは、セクション9.3に登録されているパラメーターをディレクトリに渡すことができます。RDがパラメーターの指定されたセマンティクスを認識している場合、それに応じてパラメーターを処理します。それ以外の場合は、未知のキーとその値を、さらに検索するためのエンドポイント属性として保存する必要があります。"
    },
    {
      "indent": 3,
      "text": "Content-Format: application/link-format or any other indicated media type representing web links",
      "ja": "コンテンツフォーマット：アプリケーション/リンクフォーマットまたはWebリンクを表すその他の指定されたメディアタイプ"
    },
    {
      "indent": 3,
      "text": "The following response is expected on this interface:",
      "ja": "このインターフェイスでは、次の応答が予想されます。"
    },
    {
      "indent": 3,
      "text": "Success: 2.01 (Created) or 201 (Created). The Location-Path option or Location header field MUST be included in the response. This location MUST be a stable identifier generated by the RD, as it is used for all subsequent operations on this registration resource. The registration resource location thus returned is for the purpose of updating the lifetime of the registration and for maintaining the content of the registered links, including updating and deleting links.",
      "ja": "成功：2.01（作成）または201（作成）。ロケーションパスオプションまたはロケーションヘッダーフィールドを応答に含める必要があります。この場所は、この登録リソースの後続のすべての操作に使用されるため、RDによって生成される安定した識別子でなければなりません。このように返される登録リソースの場所は、登録の寿命を更新する目的で、リンクの更新と削除を含む登録リンクのコンテンツを維持するためです。"
    },
    {
      "indent": 6,
      "text": "A registration with an already-registered ep and d value pair responds with the same success code and location as the original registration; the set of links registered with the endpoint is replaced with the links from the payload.",
      "ja": "既に登録されているEPおよびD値ペアの登録は、元の登録と同じ成功コードと場所で応答します。エンドポイントに登録されているリンクのセットは、ペイロードからのリンクに置き換えられます。"
    },
    {
      "indent": 6,
      "text": "The location MUST NOT have a query or fragment component, as that could conflict with query parameters during the registration update operation. Therefore, the Location-Query option MUST NOT be present in a successful response.",
      "ja": "登録更新操作中にクエリパラメーターと競合する可能性があるため、場所にはクエリまたはフラグメントコンポーネントがないようにしてはなりません。したがって、ロケーションクエリオプションが成功した応答で存在してはなりません。"
    },
    {
      "indent": 3,
      "text": "If the registration fails, including request timeouts, or if delays from Service Unavailable responses with Max-Age or Retry-After accumulate to exceed the registrant's configured timeouts, it SHOULD pick another registration URI from the \"URI discovery\" step of Section 4.3, and, if there is only one or the list is exhausted, pick other choices from the \"finding a resource directory\" step of Section 4.1. Care has to be taken to consider the freshness of results obtained earlier, e.g., the result of a /.well-known/core response, the lifetime of an RDAO, and DNS responses. Any rate limits and persistent errors from the \"finding a resource directory\" step must be considered for the whole registration time, not only for a single operation.",
      "ja": "リクエストのタイムアウトを含む登録が失敗した場合、または最大年齢または再試行後のサービスからの遅延が登録者の設定されたタイムアウトを超えて蓄積した場合、セクション4.3の「URI発見」ステップから別の登録URIを選択するはずです。、1つのみがある場合、またはリストが使い果たされている場合は、セクション4.1の「リソースディレクトリの検索」ステップから他の選択肢を選択します。以前に得られた結果の新鮮さを考慮するには注意が必要です。たとえば、a /.well-kond/core応答の結果、RDAOの寿命、およびDNS応答の結果です。「リソースディレクトリの検索」ステップからの任意の制限と永続的なエラーは、単一の操作だけでなく、登録時間全体で考慮する必要があります。"
    },
    {
      "indent": 3,
      "text": "The following example shows a registrant-EP with the name \"node1\" registering two resources to an RD using this interface. The location \"/rd\" is an example RD location discovered in a request similar to Figure 5.",
      "ja": "次の例は、このインターフェイスを使用して2つのリソースをRDに登録する「node1」という名前の登録者EPを示しています。場所「/rd」は、図5と同様のリクエストで発見されたRDの例です。"
    },
    {
      "indent": 3,
      "text": "Req: POST coap://rd.example.com/rd?ep=node1\nContent-Format: 40\nPayload:\n</sensors/temp>;rt=temperature-c;if=sensor,\n<http://www.example.com/sensors/temp>;\n  anchor=\"/sensors/temp\";rel=describedby",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Res: 2.01 Created\nLocation-Path: /rd/4521",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 19,
      "text": "Figure 8: Example Registration Payload",
      "ja": "図8：登録ペイロードの例"
    },
    {
      "indent": 3,
      "text": "An RD may optionally support HTTP. Here is an example of almost the same registration operation above when done using HTTP.",
      "ja": "RDはオプションでHTTPをサポートする場合があります。HTTPを使用して行われた場合、上記の上記の登録操作の例を以下に示します。"
    },
    {
      "indent": 3,
      "text": "Req:\nPOST /rd?ep=node1&base=http://[2001:db8:1::1] HTTP/1.1\nHost: rd.example.com\nContent-Type: application/link-format",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "</sensors/temp>;rt=temperature-c;if=sensor,\n<http://www.example.com/sensors/temp>;\n  anchor=\"/sensors/temp\";rel=describedby",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Res:\nHTTP/1.1 201 Created\nLocation: /rd/4521",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 7,
      "text": "Figure 9: Example Registration Payload as Expressed Using HTTP",
      "ja": "図9：HTTPを使用して表現されている登録ペイロードの例"
    },
    {
      "indent": 0,
      "text": "5.1. Simple Registration",
      "section_title": true,
      "ja": "5.1. 簡単な登録"
    },
    {
      "indent": 3,
      "text": "Not all endpoints hosting resources are expected to know how to upload links to an RD, as described in Section 5. Instead, simple endpoints can implement the simple registration approach described in this section. An RD implementing this specification MUST implement simple registration. However, there may be security reasons why this form of directory discovery would be disabled.",
      "ja": "セクション5で説明されているように、すべてのエンドポイントホスティングリソースがRDにリンクをアップロードする方法を知っているとは限りません。代わりに、単純なエンドポイントはこのセクションで説明されている簡単な登録アプローチを実装できます。この仕様を実装するRDは、簡単な登録を実装する必要があります。ただし、この形式のディレクトリ発見が無効になるセキュリティ上の理由があるかもしれません。"
    },
    {
      "indent": 3,
      "text": "This approach requires that the registrant-EP makes available the hosted resources that it wants to be discovered as links on its /.well-known/core interface, as specified in [RFC6690]. The links in that document are subject to the same limitations as the payload of a registration (with respect to Appendix C).",
      "ja": "このアプローチでは、登録者-EPが[RFC6690]で指定されているように、 /.well-nown /coreインターフェイスのリンクとして発見したいホストリソースを利用できるようにする必要があります。そのドキュメントのリンクは、登録のペイロードと同じ制限の対象となります（付録Cに関して）。"
    },
    {
      "indent": 3,
      "text": "* The registrant-EP finds one or more addresses of the directory server, as described in Section 4.1.",
      "ja": "* 登録者-EPは、セクション4.1で説明されているように、ディレクトリサーバーの1つ以上のアドレスを見つけます。"
    },
    {
      "indent": 3,
      "text": "* The registrant-EP sends (and regularly refreshes with) a POST request to the /.well-known/rd URI of the directory server of choice. The body of the POST request is empty and triggers the resource directory server to perform GET requests (redone before lifetime expiry) at the requesting registrant-EP's /.well-known/ core to obtain the link-format payload to register.",
      "ja": "* 登録者-EPは、選択したディレクトリサーバーの /.well-nking/rd uriにPOSTリクエストを送信します（および定期的にリフレッシュします）。POSTリクエストの本文は空で、リクエストリクエスト（Lifetime Expiryの前にやり直します）を要求する登録済みの[well-nown / coreでGet Requests（Lifetime Expiryの前にやり直し）を実行するためにリソースディレクトリサーバーをトリガーします。リンクフォーマットペイロードを取得します。"
    },
    {
      "indent": 6,
      "text": "The registrant-EP includes the same registration parameters in the POST request as it would with a regular registration, per Section 5. The registration base URI of the registration is taken from the registrant-EP's network address (as is default with regular registrations).",
      "ja": "登録者-EPには、セクション5ごとに、通常の登録と同じ登録パラメーターがポストリクエストに含まれています。登録の登録ベースURIは、登録者-EPのネットワークアドレスから取得されます（通常の登録ではデフォルトである）。"
    },
    {
      "indent": 6,
      "text": "The following is an example request from the registrant-EP to the RD (unanswered until the next step):",
      "ja": "以下は、登録者からRDへの例の例です（次のステップまで未回答）："
    },
    {
      "indent": 6,
      "text": "Req: POST /.well-known/rd?lt=6000&ep=node1\n(No payload)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 7,
      "text": "Figure 10: First-Half Example Exchange of a Simple Registration",
      "ja": "図10：簡単な登録の前半例交換"
    },
    {
      "indent": 3,
      "text": "* The RD queries the registrant-EP's discovery resource to determine the success of the operation. It SHOULD keep a cache of the discovery resource and not query it again as long as it is fresh.",
      "ja": "* RDは、登録者-EPの発見リソースを照会して、操作の成功を決定します。発見リソースのキャッシュを保持し、新鮮である限り再度照会する必要はありません。"
    },
    {
      "indent": 6,
      "text": "The following is an example request from the RD to the registrant-EP:",
      "ja": "以下は、RDから登録者への例の例です。"
    },
    {
      "indent": 6,
      "text": "Req: GET /.well-known/core\nAccept: 40",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "Res: 2.05 Content\nContent-Format: 40\nPayload:\n</sen/temp>",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "Figure 11: Example Exchange of the RD Querying the Simple Endpoint",
      "ja": "図11：単純なエンドポイントをクエリするRDの例の例"
    },
    {
      "indent": 3,
      "text": "With this response, the RD would answer the previous step's request:",
      "ja": "この応答により、RDは前のステップの要求に応答します。"
    },
    {
      "indent": 3,
      "text": "Res: 2.04 Changed",
      "ja": "Res：2.04が変更されました"
    },
    {
      "indent": 6,
      "text": "Figure 12: Second-Half Example Exchange of a Simple Registration",
      "ja": "図12：簡単な登録の後半例交換"
    },
    {
      "indent": 3,
      "text": "The sequence of fetching the registration content before sending a successful response was chosen to make responses reliable, and the point about caching was chosen to still allow very constrained registrants. Registrants MUST be able to serve a GET request to /.well-known/core after having requested registration. Constrained devices MAY regard the initial request as temporarily failed when they need RAM occupied by their own request to serve the RD's GET and retry later when the RD already has a cached representation of their discovery resources. Then, the RD can reply immediately, and the registrant can receive the response.",
      "ja": "成功した応答を送信する前に登録コンテンツをフェッチするシーケンスが選択され、応答が信頼できるようになり、キャッシュに関するポイントは、非常に制約された登録者を許可するために選択されました。登録者は、登録を要求した後、 /.well-known/coreにget requestを提供できる必要があります。制約されたデバイスは、RDのGetを提供するという独自の要求によってRAMが占有され、RDが発見リソースのキャッシュされた表現を既に持っている場合に、RAMが自分のリクエストを使用する必要がある場合に一時的に失敗したと見なす場合があります。その後、RDはすぐに返信でき、登録者は応答を受け取ることができます。"
    },
    {
      "indent": 3,
      "text": "The simple registration request interface is specified as follows:",
      "ja": "簡単な登録要求インターフェイスは、次のように指定されています。"
    },
    {
      "indent": 3,
      "text": "Interaction:  EP -> RD",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Method: POST",
      "ja": "方法：投稿"
    },
    {
      "indent": 3,
      "text": "URI Template:  /.well-known/rd{?ep,d,lt,extra-attrs*}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "URI Template Variables are the same as for registration in Section 5. The base attribute is not accepted to keep the registration interface simple; that rules out registration over CoAP-over-TCP or HTTP that would need to specify one. For some time during this document's development, the URI Template /.well-known/core{?ep,...} was in use instead.",
      "ja": "URIテンプレート変数は、セクション5の登録と同じです。登録インターフェイスをシンプルに保つために、ベース属性は受け入れられません。これは、Coap-Over-TCPまたはHTTPを介した登録を排除し、1つを指定する必要があります。このドキュメントの開発中しばらくの間、URIテンプレート /.Well-Nowned/Core {？Ep、...}は代わりに使用されていました。"
    },
    {
      "indent": 3,
      "text": "The following response is expected on this interface:",
      "ja": "このインターフェイスでは、次の応答が予想されます。"
    },
    {
      "indent": 3,
      "text": "Success: 2.04 (Changed)",
      "ja": "成功：2.04（変更）"
    },
    {
      "indent": 3,
      "text": "For the second interaction triggered by the above, the registrant-EP takes the role of server and the RD takes the role of client. (Note that this is exactly the well-known interface of [RFC6690], Section 4):",
      "ja": "上記でトリガーされた2番目の相互作用の場合、登録者-EPはサーバーの役割を引き受け、RDはクライアントの役割を引き受けます。（これはまさに[RFC6690]、セクション4のよく知られているインターフェースであることに注意してください）："
    },
    {
      "indent": 3,
      "text": "Interaction:  RD -> EP",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Method: GET",
      "ja": "方法：取得します"
    },
    {
      "indent": 3,
      "text": "URI Template:  /.well-known/core",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The following response is expected on this interface:",
      "ja": "このインターフェイスでは、次の応答が予想されます。"
    },
    {
      "indent": 3,
      "text": "Success: 2.05 (Content)",
      "ja": "成功：2.05（コンテンツ）"
    },
    {
      "indent": 3,
      "text": "When the RD uses any authorization credentials to access the endpoint's discovery resource or when it is deployed in a location where third parties might reach it but not the endpoint, it SHOULD verify that the apparent registrant-EP intends to register with the given registration parameters before revealing the obtained discovery information to lookup clients. An easy way to do that is to verify the simple registration request's sender address using the Echo option, as described in [RFC9175], Section 2.4.",
      "ja": "RDが承認資格情報を使用してエンドポイントのディスカバリーリソースにアクセスする場合、またはエンドポイントではなく第三者が到達する場所に展開された場合、見かけの登録者-EPが前に特定の登録パラメーターに登録する予定であることを確認する必要があります。クライアントを検索するための取得した発見情報を明らかにします。それを行う簡単な方法は、[RFC9175]、セクション2.4で説明されているように、Echoオプションを使用してSimple登録要求の送信者アドレスを確認することです。"
    },
    {
      "indent": 3,
      "text": "The RD MUST delete registrations created by simple registration after the expiration of their lifetime. Additional operations on the registration resource cannot be executed because no registration location is returned.",
      "ja": "RDは、生涯の満了後に簡単な登録によって作成された登録を削除する必要があります。登録場所が返されないため、登録リソースの追加操作は実行できません。"
    },
    {
      "indent": 0,
      "text": "5.2. Third-Party Registration",
      "section_title": true,
      "ja": "5.2. サードパーティの登録"
    },
    {
      "indent": 3,
      "text": "For some applications, even simple registration may be too taxing for some very constrained devices, in particular, if the security requirements become too onerous.",
      "ja": "一部のアプリケーションでは、特にセキュリティ要件があまりにも面倒になった場合、非常に制約されたデバイスに対して単純な登録でさえ課税されすぎる場合があります。"
    },
    {
      "indent": 3,
      "text": "In a controlled environment (e.g., building control), the RD can be filled by a third-party device, called a Commissioning Tool (CT). The CT can fill the RD from a database or other means. For that purpose scheme, the IP address and port of the URI of the registered device is the value of the \"base\" parameter of the registration described in Section 5.",
      "ja": "制御された環境（建物制御など）では、RDは、試運転ツール（CT）と呼ばれるサードパーティのデバイスで埋めることができます。CTは、データベースまたはその他の手段からRDを埋めることができます。その目的のスキームのために、登録されたデバイスのURIのIPアドレスとポートは、セクション5で説明されている登録の「ベース」パラメーターの値です。"
    },
    {
      "indent": 3,
      "text": "It should be noted that the value of the \"base\" parameter applies to all the links of the registration and has consequences for the anchor value of the individual links, as exemplified in Appendix B. A potential (currently nonexistent) \"base\" attribute of the link is not affected by the value of \"base\" parameter in the registration.",
      "ja": "「ベース」パラメーターの値は、登録のすべてのリンクに適用され、付録Bに例示されているように、個々のリンクのアンカー値に結果をもたらすことに注意する必要があります。リンクは、登録中の「ベース」パラメーターの値の影響を受けません。"
    },
    {
      "indent": 0,
      "text": "5.3. Operations on the Registration Resource",
      "section_title": true,
      "ja": "5.3. 登録リソースの操作"
    },
    {
      "indent": 3,
      "text": "This section describes how the registering endpoint can maintain the registrations that it created. The registering endpoint can be the registrant-EP or the CT. The registrations are resources of the RD.",
      "ja": "このセクションでは、登録エンドポイントが作成した登録を維持する方法について説明します。登録エンドポイントは、登録者のEPまたはCTです。登録はRDのリソースです。"
    },
    {
      "indent": 3,
      "text": "An endpoint should not use this interface for registrations that it did not create. This is usually enforced by security policies, which, in general, require equivalent credentials for creation of and operations on a registration.",
      "ja": "エンドポイントは、作成されなかった登録にこのインターフェイスを使用しないでください。これは通常、セキュリティポリシーによって実施されます。これは、一般に、登録の作成と運用のために同等の資格情報を必要とします。"
    },
    {
      "indent": 3,
      "text": "After the initial registration, the registering endpoint retains the returned location of the registration resource for further operations, including refreshing the registration in order to extend the lifetime and \"keep-alive\" the registration. When the lifetime of the registration has expired, the RD SHOULD NOT respond to discovery queries concerning this endpoint. The RD SHOULD continue to provide access to the registration resource after a registration timeout occurs in order to enable the registering endpoint to eventually refresh the registration. The RD MAY eventually remove the registration resource for the purpose of garbage collection. If the registration resource is removed, the corresponding endpoint will need to be reregistered.",
      "ja": "最初の登録後、登録エンドポイントは、登録リソースの返された場所を保持し、登録を更新して登録を延長し、登録を「維持」することを含めます。登録の寿命が切れた場合、RDはこのエンドポイントに関するディスカバリークエリに応答してはなりません。RDは、登録エンドポイントが最終的に登録を更新できるようにするために、登録タイムアウトが発生した後も登録リソースへのアクセスを引き続き提供する必要があります。RDは、最終的にガベージコレクションを目的として登録リソースを削除する場合があります。登録リソースが削除された場合、対応するエンドポイントを再登録する必要があります。"
    },
    {
      "indent": 3,
      "text": "The registration resource may also be used to cancel the registration using DELETE and to perform further operations beyond the scope of this specification.",
      "ja": "登録リソースは、削除を使用して登録をキャンセルし、この仕様の範囲を超えてさらなる操作を実行するためにも使用できます。"
    },
    {
      "indent": 3,
      "text": "Operations on the registration resource are sensitive to reordering; Section 5.3.4 describes how order is restored.",
      "ja": "登録リソースの操作は、並べ替えに敏感です。セクション5.3.4では、順序の復元方法について説明します。"
    },
    {
      "indent": 3,
      "text": "The operations on the registration resource are described below.",
      "ja": "登録リソースの操作については、以下に説明します。"
    },
    {
      "indent": 0,
      "text": "5.3.1. Registration Update",
      "section_title": true,
      "ja": "5.3.1. 登録更新"
    },
    {
      "indent": 3,
      "text": "The update interface is used by the registering endpoint to refresh or update its registration with an RD. To use the interface, the registering endpoint sends a POST request to the registration resource returned by the initial registration operation.",
      "ja": "更新インターフェイスは、登録エンドポイントによって使用され、RDでの登録を更新または更新します。インターフェイスを使用するには、登録エンドポイントは、最初の登録操作によって返される登録リソースにPOSTリクエストを送信します。"
    },
    {
      "indent": 3,
      "text": "An update MAY update registration parameters, such as lifetime, base URI, or others. Parameters that are not being changed should not be included in an update. Adding parameters that have not changed increases the size of the message but does not have any other implications. Parameters are included as query parameters in an update operation, as in Section 5.",
      "ja": "更新は、Lifetime、Base URIなどの登録パラメーターを更新する場合があります。変更されていないパラメーターは、更新に含まれないでください。変更されていないパラメーターを追加すると、メッセージのサイズが増加しますが、他の意味はありません。セクション5のように、パラメーターは更新操作のクエリパラメーターとして含まれています。"
    },
    {
      "indent": 3,
      "text": "A registration update resets the timeout of the registration to the (possibly updated) lifetime of the registration, independent of whether an lt parameter was given.",
      "ja": "登録更新では、LTパラメーターが指定されたかどうかとは無関係に、登録のタイムアウトを登録の（更新される可能性のある）寿命にリセットします。"
    },
    {
      "indent": 3,
      "text": "If the base URI of the registration is changed in an update, relative references submitted in the original registration or later updates are resolved anew against the new base.",
      "ja": "登録のベースURIが更新で変更された場合、元の登録または後の更新で提出された相対的な参照は、新しいベースに対して新たに解決されます。"
    },
    {
      "indent": 3,
      "text": "The registration update operation only describes the use of POST with an empty payload. Future standards might describe the semantics of using content formats and payloads with the POST method to update the links of a registration (see Section 5.3.3).",
      "ja": "登録更新操作では、空のペイロードを使用した投稿の使用のみを説明します。将来の標準では、登録のリンクを更新するために、POSTメソッドを使用してコンテンツフォーマットとペイロードを使用するセマンティクスを説明する場合があります（セクション5.3.3を参照）。"
    },
    {
      "indent": 3,
      "text": "The update registration request interface is specified as follows:",
      "ja": "更新登録要求インターフェイスは、次のように指定されています。"
    },
    {
      "indent": 3,
      "text": "Interaction:  EP or CT -> RD",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Method: POST",
      "ja": "方法：投稿"
    },
    {
      "indent": 3,
      "text": "URI Template:  {+location}{?lt,base,extra-attrs*}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "URI Template Variables:",
      "ja": "URIテンプレート変数："
    },
    {
      "indent": 6,
      "text": "location := This is the location returned by the RD as a result of a successful earlier registration.",
      "ja": "場所：=これは、以前の登録が成功した結果、RDによって返された場所です。"
    },
    {
      "indent": 6,
      "text": "lt := Lifetime (optional). This is the lifetime of the registration in seconds, with a range of 1-4294967295. If no lifetime is included, the previous last lifetime set on a previous update or the original registration (falling back to 90000) SHOULD be used.",
      "ja": "LT：= lifetime（オプション）。これは、1-4294967295の範囲で、数秒での登録の寿命です。寿命が含まれていない場合は、以前の更新または元の登録（90000に戻る）に前回の最後の生涯セットを使用する必要があります。"
    },
    {
      "indent": 6,
      "text": "base := Base URI (optional). This parameter updates the base URI established in the original registration to a new value and is subject to the same restrictions as in the registration.",
      "ja": "ベース：=ベースURI（オプション）。このパラメーターは、元の登録で確立されたベースURIを新しい値に更新し、登録と同じ制限の対象となります。"
    },
    {
      "indent": 9,
      "text": "If the parameter is set in an update, it is stored by the RD as the new base URI under which to interpret the relative links present in the payload of the original registration.",
      "ja": "パラメーターがアップデートで設定されている場合、RDによって保存され、元の登録のペイロードに存在する相対リンクを解釈する新しいベースURIとして保存されます。"
    },
    {
      "indent": 9,
      "text": "If the parameter is not set in the request but was set before, the previous base URI value is kept unmodified.",
      "ja": "パラメーターがリクエストに設定されていないが以前に設定されていた場合、以前のベースURI値は変更されていません。"
    },
    {
      "indent": 9,
      "text": "If the parameter is not set in the request and was not set before either, the source address and source port of the update request are stored as the base URI.",
      "ja": "パラメーターがリクエストに設定されておらず、どちらも前に設定されていない場合、更新リクエストのソースアドレスとソースポートはベースURIとして保存されます。"
    },
    {
      "indent": 6,
      "text": "extra-attrs := Additional registration attributes (optional). As with the registration, the RD processes them if it knows their semantics. Otherwise, unknown attributes are stored as endpoint attributes, overriding any previously stored endpoint attributes of the same key.",
      "ja": "extra-attrs：=追加の登録属性（オプション）。登録と同様に、RDはセマンティクスを知っている場合にそれらを処理します。それ以外の場合、未知の属性はエンドポイント属性として保存され、同じキーの以前に保存されたエンドポイント属性をオーバーライドします。"
    },
    {
      "indent": 9,
      "text": "Note that this default behavior does not allow removing an endpoint attribute in an update. For attributes whose functionality depends on the endpoints' ability to remove them in an update, it can make sense to define a value whose presence is equivalent to the absence of a value. As an alternative, an extension can define different updating rules for their attributes. That necessitates either discovering whether the RD is aware of that extension or tolerating the default behavior.",
      "ja": "このデフォルトの動作により、更新でエンドポイント属性を削除することはできないことに注意してください。機能性がエンドポイントの更新でそれらを削除する能力に依存する属性の場合、存在が値の欠如に相当する値を定義することは理にかなっています。別の方法として、拡張機能は属性の異なる更新ルールを定義できます。そのためには、RDがその拡張を認識しているかどうかを発見するか、デフォルトの動作を許容する必要があります。"
    },
    {
      "indent": 3,
      "text": "Content-Format: none (no payload)",
      "ja": "コンテンツフォーマット：なし（ペイロードなし）"
    },
    {
      "indent": 3,
      "text": "The following responses are expected on this interface:",
      "ja": "このインターフェイスでは、次の回答が予想されます。"
    },
    {
      "indent": 3,
      "text": "Success: 2.04 (Changed) or 204 (No Content) if the update was successfully processed.",
      "ja": "成功：2.04（変更）または204（コンテンツなし）アップデートが正常に処理された場合。"
    },
    {
      "indent": 3,
      "text": "Failure: 4.04 (Not Found) or 404 (Not Found). Registration does not exist (e.g., may have been removed).",
      "ja": "障害：4.04（見つかりません）または404（見つかりません）。登録は存在しません（例：削除された可能性があります）。"
    },
    {
      "indent": 3,
      "text": "If the registration update fails in any way, including \"Not Found\" and request timeouts, or if the time indicated in a Service Unavailable Max-Age/Retry-After exceeds the remaining lifetime, the registering endpoint SHOULD attempt registration again.",
      "ja": "登録の更新が「見つかりません」を含む方法で失敗し、タイムアウトを要求する場合、またはサービスで表示されていない最大年齢/再試行後の時間が残りの寿命を超える場合、登録エンドポイントは再び登録を試みるはずです。"
    },
    {
      "indent": 3,
      "text": "The following example shows how the registering endpoint resets the timeout on its registration resource at an RD using this interface with the example location value /rd/4521:",
      "ja": "次の例は、登録エンドポイントが、このインターフェイスを使用して、このインターフェイスを使用して、登録リソースのタイムアウトをどのようにリセットするかを示しています。"
    },
    {
      "indent": 3,
      "text": "Req: POST /rd/4521",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Res: 2.04 Changed",
      "ja": "Res：2.04が変更されました"
    },
    {
      "indent": 16,
      "text": "Figure 13: Example Update of a Registration",
      "ja": "図13：登録の更新の例"
    },
    {
      "indent": 3,
      "text": "The following example shows the registering endpoint updating its registration resource at an RD using this interface with the example location value /rd/4521. The initial registration by the registering endpoint set the following values:",
      "ja": "次の例は、登録エンドポイントが、このインターフェイスを使用して、このインターフェイスを使用して、場所の値 /RD /4521を使用してRDで登録リソースを更新することを示しています。登録エンドポイントによる初期登録は、次の値を設定します。"
    },
    {
      "indent": 3,
      "text": "* endpoint name (ep)=endpoint1",
      "ja": "* エンドポイント名（EP）= EndPoint1"
    },
    {
      "indent": 3,
      "text": "* lifetime (lt)=500",
      "ja": "* 生涯（LT）= 500"
    },
    {
      "indent": 3,
      "text": "* base URI (base)=coap://local-proxy-old.example.com",
      "ja": "* base uri（base）= coap：//local-proxy old.example.com"
    },
    {
      "indent": 3,
      "text": "* payload of Figure 8",
      "ja": "* 図8のペイロード"
    },
    {
      "indent": 3,
      "text": "The initial state of the RD is reflected in the following request:",
      "ja": "RDの初期状態は、次の要求に反映されています。"
    },
    {
      "indent": 3,
      "text": "Req: GET /rd-lookup/res?ep=endpoint1",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Res: 2.05 Content\nPayload:\n<coap://local-proxy-old.example.com/sensors/temp>;\n    rt=temperature-c;if=sensor,\n<http://www.example.com/sensors/temp>;\n    anchor=\"coap://local-proxy-old.example.com/sensors/temp\";\n    rel=describedby",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 7,
      "text": "Figure 14: Example Lookup Before a Change to the Base Address",
      "ja": "図14：ベースアドレスを変更する前の例の例"
    },
    {
      "indent": 3,
      "text": "The following example shows the registering endpoint changing the base URI to coaps://new.example.com:5684:",
      "ja": "次の例は、登録エンドポイントがベースURIをCoapsに変更する：//new.example.com：5684："
    },
    {
      "indent": 3,
      "text": "Req: POST /rd/4521?base=coaps://new.example.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Res: 2.04 Changed",
      "ja": "Res：2.04が変更されました"
    },
    {
      "indent": 4,
      "text": "Figure 15: Example Registration Update that Changes the Base Address",
      "ja": "図15：ベースアドレスを変更する登録更新の例"
    },
    {
      "indent": 3,
      "text": "The consecutive query returns:",
      "ja": "連続したクエリが返されます："
    },
    {
      "indent": 3,
      "text": "Req: GET /rd-lookup/res?ep=endpoint1",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Res: 2.05 Content\nPayload:\n<coaps://new.example.com/sensors/temp>;\n    rt=temperature-c;if=sensor,\n<http://www.example.com/sensors/temp>;\n    anchor=\"coaps://new.example.com/sensors/temp\";\n    rel=describedby",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 8,
      "text": "Figure 16: Example Lookup After a Change to the Base Address",
      "ja": "図16：ベースアドレスへの変更後の例の例"
    },
    {
      "indent": 0,
      "text": "5.3.2. Registration Removal",
      "section_title": true,
      "ja": "5.3.2. 登録削除"
    },
    {
      "indent": 3,
      "text": "Although RD registrations have soft state and will eventually time out after their lifetime, the registering endpoint SHOULD explicitly remove an entry from the RD if it knows it will no longer be available (for example, on shutdown). This is accomplished using a removal interface on the RD by performing a DELETE on the endpoint resource.",
      "ja": "RD登録にはソフトステートがあり、最終的には寿命の後にタイムアウトしますが、登録エンドポイントは、それが利用できなくなったことがわかっている場合（たとえば、シャットダウン時）、RDからエントリを明示的に削除するはずです。これは、エンドポイントリソースで削除を実行することにより、RDの削除インターフェイスを使用して達成されます。"
    },
    {
      "indent": 3,
      "text": "The removal request interface is specified as follows:",
      "ja": "削除要求インターフェイスは、次のように指定されています。"
    },
    {
      "indent": 3,
      "text": "Interaction:  EP or CT -> RD",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Method: DELETE",
      "ja": "方法：削除します"
    },
    {
      "indent": 3,
      "text": "URI Template:  {+location}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "URI Template Variables:",
      "ja": "URIテンプレート変数："
    },
    {
      "indent": 6,
      "text": "location := This is the location returned by the RD as a result of a successful earlier registration.",
      "ja": "場所：=これは、以前の登録が成功した結果、RDによって返された場所です。"
    },
    {
      "indent": 3,
      "text": "The following responses are expected on this interface:",
      "ja": "このインターフェイスでは、次の回答が予想されます。"
    },
    {
      "indent": 3,
      "text": "Success: 2.02 (Deleted) or 204 (No Content) upon successful deletion.",
      "ja": "成功：2.02（削除）または204（コンテンツなし）削除が成功したとき。"
    },
    {
      "indent": 3,
      "text": "Failure: 4.04 (Not Found) or 404 (Not Found). Registration does not exist (e.g., may already have been removed).",
      "ja": "障害：4.04（見つかりません）または404（見つかりません）。登録は存在しません（例えば、すでに削除されている可能性があります）。"
    },
    {
      "indent": 3,
      "text": "The following example shows successful removal of the endpoint from the RD with example location value /rd/4521:",
      "ja": "次の例では、RD /RD /4521の例でRDからエンドポイントの削除が成功したことを示しています。"
    },
    {
      "indent": 3,
      "text": "Req: DELETE /rd/4521",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Res: 2.02 Deleted",
      "ja": "RES：2.02削除"
    },
    {
      "indent": 16,
      "text": "Figure 17: Example of a Registration Removal",
      "ja": "図17：登録削除の例"
    },
    {
      "indent": 0,
      "text": "5.3.3. Further Operations",
      "section_title": true,
      "ja": "5.3.3. さらなる操作"
    },
    {
      "indent": 3,
      "text": "Additional operations on the registration can be specified in future documents, for example:",
      "ja": "登録に関する追加の操作は、将来のドキュメントで指定できます。"
    },
    {
      "indent": 3,
      "text": "* Send iPATCH (or PATCH) updates [RFC8132] to add, remove, or change the links of a registration.",
      "ja": "* iPatch（またはパッチ）更新[RFC8132]を送信して、登録のリンクを追加、削除、または変更します。"
    },
    {
      "indent": 3,
      "text": "* Use GET to read the currently stored set of links in a registration resource.",
      "ja": "* 使用して、登録リソースの現在保存されているリンクのセットを読み取ります。"
    },
    {
      "indent": 3,
      "text": "Those operations are out of scope of this document and will require media types suitable for modifying sets of links.",
      "ja": "これらの操作はこのドキュメントの範囲外であり、リンクのセットを変更するのに適したメディアタイプが必要です。"
    },
    {
      "indent": 0,
      "text": "5.3.4. Request Freshness",
      "section_title": true,
      "ja": "5.3.4. 新鮮さをリクエストします"
    },
    {
      "indent": 3,
      "text": "Some security mechanisms usable with an RD allow out-of-order request processing or do not even mandate replay protection at all. The RD needs to ensure that operations on the registration resource are executed in an order that does not distort the client's intentions.",
      "ja": "RDで使用可能な一部のセキュリティメカニズムは、オーダー外の要求処理を可能にするか、リプレイ保護をまったく義務付けないことさえできません。RDは、登録リソースの操作が、クライアントの意図を歪めない順序で実行されることを確認する必要があります。"
    },
    {
      "indent": 3,
      "text": "This ordering of operations is expressed in terms of freshness, as defined in [RFC9175]. Requests that alter a resource's state need to be fresh relative to the latest request that altered that state in a conflicting way.",
      "ja": "この操作の順序は、[RFC9175]で定義されているように、新鮮さの観点から表されます。リソースの状態を変更する要求は、その状態を矛盾する方法で変更した最新の要求に関連して新鮮である必要があります。"
    },
    {
      "indent": 3,
      "text": "An RD SHOULD determine a request's freshness and MUST use the Echo option if it requires request freshness and cannot determine it in any other way. An endpoint MUST support the use of the Echo option. (One reason why an RD would not require freshness is when no relevant registration properties are covered by its security policies.)",
      "ja": "RDは、リクエストの新鮮さを決定し、リクエストの新鮮さが必要であり、他の方法でそれを決定できない場合は、エコーオプションを使用する必要があります。エンドポイントは、エコーオプションの使用をサポートする必要があります。（RDが新鮮さを必要としない理由の1つは、関連する登録プロパティがセキュリティポリシーの対象となっている場合です。）"
    },
    {
      "indent": 0,
      "text": "5.3.4.1. Efficient Use of Echo by an RD",
      "section_title": true,
      "ja": "5.3.4.1. RDによるエコーの効率的な使用"
    },
    {
      "indent": 3,
      "text": "To keep latency and traffic added by the freshness requirements to a minimum, RDs should avoid naive (sufficient but inefficient) freshness criteria.",
      "ja": "新鮮さの要件によって最小限に追加されたレイテンシとトラフィックを維持するために、RDSは素朴な（十分ではあるが非効率的な）鮮度基準を避ける必要があります。"
    },
    {
      "indent": 3,
      "text": "Some simple mechanisms the RD can employ are:",
      "ja": "RDが採用できるいくつかの単純なメカニズムは次のとおりです。"
    },
    {
      "indent": 3,
      "text": "* State counter. The RD can keep a monotonous counter that increments whenever a registration changes. For every registration resource, it stores the post-increment value of that resource's last change. Requests altering them need to have at least that value encoded in their Echo option and are otherwise rejected with a 4.01 (Unauthorized) and the current counter value as the Echo value. If other applications on the same server use Echo as well, that encoding may include a prefix indicating that it pertains to the RD's counter.",
      "ja": "* ステートカウンター。RDは、登録が変更されるたびに増加する単調なカウンターを保持できます。登録リソースごとに、そのリソースの最後の変更のポストインクリメント値を保存します。それらを変更するリクエストには、少なくともその値がエコーオプションでエンコードされ、それ以外の場合は4.01（不正）および現在のカウンター値がエコー値として拒否される必要があります。同じサーバー上の他のアプリケーションもエコーを使用している場合、そのエンコードには、RDのカウンターに関係することを示すプレフィックスが含まれる場合があります。"
    },
    {
      "indent": 6,
      "text": "The value associated with a resource needs to be kept across the removal of registrations if the same registration resource is to be reused.",
      "ja": "同じ登録リソースを再利用する場合、リソースに関連付けられた値を登録の削除全体に維持する必要があります。"
    },
    {
      "indent": 6,
      "text": "The counter can be reset (and the values of removed resources forgotten) when all previous security associations are reset.",
      "ja": "以前のすべてのセキュリティ関連がリセットされている場合、カウンターはリセット（および忘れられた削除されたリソースの値）をリセットできます。"
    },
    {
      "indent": 6,
      "text": "This is the \"Persistent Counter\" method of [RFC9175], Appendix A.",
      "ja": "これは[RFC9175]の「永続的なカウンター」方法です。"
    },
    {
      "indent": 3,
      "text": "* Preemptive Echo values. The current state counter can be sent in an Echo option not only when requests are rejected with 4.01 (Unauthorized) but also with successful responses. Thus, clients can be provided with Echo values sufficient for their next request on a regular basis. This is also described in Section 2.3 of [RFC9175]",
      "ja": "* 先制エコー値。現在の状態カウンターは、リクエストが4.01（不正）で拒否された場合だけでなく、応答が成功した場合だけでなく、エコーオプションで送信できます。したがって、クライアントには、定期的に次のリクエストに十分なエコー値を提供できます。これは[RFC9175]のセクション2.3でも説明されています"
    },
    {
      "indent": 6,
      "text": "While endpoints may discard received Echo values at leisure between requests, they are encouraged to retain these values for the next request to avoid additional round trips.",
      "ja": "エンドポイントは、リクエストの合間にレジャーで受信されたエコー値を破棄する場合がありますが、追加の往復を避けるために次のリクエストのためにこれらの値を保持することが奨励されています。"
    },
    {
      "indent": 3,
      "text": "* If the RD can ensure that only one security association has modifying access to any registration at any given time and that security association provides order on the requests, that order is sufficient to show request freshness.",
      "ja": "* RDが、1つのセキュリティ協会のみが任意の時間に登録へのアクセスを変更し、セキュリティ協会がリクエストに注文を提供できるようにすることができる場合、その注文はリクエストの新鮮さを示すのに十分です。"
    },
    {
      "indent": 0,
      "text": "5.3.4.2. Examples of Echo Usage",
      "section_title": true,
      "ja": "5.3.4.2. エコー使用の例"
    },
    {
      "indent": 3,
      "text": "Figure 18 shows the interactions of an endpoint that has forgotten the server's latest Echo value and temporarily reduces its registration lifetime:",
      "ja": "図18は、サーバーの最新のエコー値を忘れており、登録の寿命を一時的に削減したエンドポイントの相互作用を示しています。"
    },
    {
      "indent": 3,
      "text": "Req: POST /rd/4521?lt=7200",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Res: 4.01 Unauthorized Echo: 0x0123",
      "ja": "RES：4.01不正なエコー：0x0123"
    },
    {
      "indent": 3,
      "text": "(EP tries again immediately.)",
      "ja": "（EPはすぐに再び試みます。）"
    },
    {
      "indent": 3,
      "text": "Req: POST /rd/4521?lt=7200\nEcho: 0x0123",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Res: 2.04 Changed Echo: 0x0124",
      "ja": "RES：2.04変更エコー：0x0124"
    },
    {
      "indent": 3,
      "text": "(Later, the EP regains its confidence in its long-term reachability.)",
      "ja": "（後で、EPは長期的な到達可能性に対する自信を取り戻します。）"
    },
    {
      "indent": 3,
      "text": "Req: POST /rd/4521?lt=90000\nEcho: 0x0124",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Res: 2.04 Changed Echo: 0x0247",
      "ja": "RES：2.04変更エコー：0x0247"
    },
    {
      "indent": 16,
      "text": "Figure 18: Example Update of a Registration",
      "ja": "図18：登録の更新の例"
    },
    {
      "indent": 3,
      "text": "The other examples do not show Echo options for two reasons: (1) for simplicity and (2) because they lack the context for any example values to have meaning.",
      "ja": "他の例は、2つの理由でエコーオプションを示していません。（1）単純さのための、（2）意味を持つ値を持つためのコンテキストがないためです。"
    },
    {
      "indent": 0,
      "text": "6. RD Lookup",
      "section_title": true,
      "ja": "6. RDルックアップ"
    },
    {
      "indent": 3,
      "text": "To discover the resources registered with the RD, a lookup interface must be provided. This lookup interface is defined as a default, and it is assumed that RDs may also support lookups to return resource descriptions in alternative formats (e.g., JSON or CBOR link format [CORE-LINKS-JSON]) or use more advanced interfaces (e.g., supporting context- or semantic-based lookup) on different resources that are discovered independently.",
      "ja": "RDに登録されているリソースを発見するには、ルックアップインターフェイスを提供する必要があります。このルックアップインターフェイスはデフォルトとして定義されており、RDSはルックアップをサポートして代替形式でリソースの説明を返すこともできます（たとえば、JSONまたはCBORリンク形式[Core-Links-JSON]）またはより高度なインターフェイス（例えば、独立して発見されたさまざまなリソースで、コンテキストまたはセマンティックベースのルックアップをサポートします。"
    },
    {
      "indent": 3,
      "text": "RD lookup allows lookups for endpoints and resources using attributes defined in this document and for use with the CoRE Link Format. The result of a lookup request is the list of links (if any) corresponding to the type of lookup. Thus, an endpoint lookup MUST return a list of endpoints, and a resource lookup MUST return a list of links to resources.",
      "ja": "RD Lookupを使用すると、このドキュメントで定義されている属性を使用し、コアリンク形式で使用するエンドポイントとリソースのルックアップが可能になります。ルックアップリクエストの結果は、ルックアップのタイプに対応するリンクのリスト（ある場合）です。したがって、エンドポイントの検索はエンドポイントのリストを返す必要があり、リソースルックアップはリソースへのリンクのリストを返す必要があります。"
    },
    {
      "indent": 3,
      "text": "The lookup type implemented by a lookup resource is indicated by a resource type, as per Table 1:",
      "ja": "ルックアップリソースによって実装されるルックアップタイプは、表1に従って、リソースタイプで示されています。"
    },
    {
      "indent": 13,
      "text": "+=============+====================+===========+\n| Lookup Type | Resource Type      | Mandatory |\n+=============+====================+===========+\n| Resource    | core.rd-lookup-res | Mandatory |\n+-------------+--------------------+-----------+\n| Endpoint    | core.rd-lookup-ep  | Mandatory |\n+-------------+--------------------+-----------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 26,
      "text": "Table 1: Lookup Types",
      "ja": "表1：ルックアップタイプ"
    },
    {
      "indent": 0,
      "text": "6.1. Resource Lookup",
      "section_title": true,
      "ja": "6.1. リソースの検索"
    },
    {
      "indent": 3,
      "text": "Resource lookup results in links that are semantically equivalent to the links submitted to the RD by the registrant. The links and link parameters returned by the lookup are equal to the originally submitted ones, except that the target reference is fully resolved and that the anchor reference is fully resolved if it is present in the lookup result at all.",
      "ja": "リソースの検索により、登録者がRDに提出したリンクと意味的に同等のリンクが得られます。ルックアップによって返されるリンクとリンクパラメーターは、元々提出されたものと等しくなりますが、ターゲット参照が完全に解決され、アンカー参照がルックアップ結果に存在する場合、アンカー参照が完全に解決されます。"
    },
    {
      "indent": 3,
      "text": "Links that did not have an anchor attribute in the registration are returned without an anchor attribute. Links of which href or anchor was submitted as a (full) URI are returned with the respective attribute unmodified.",
      "ja": "登録にアンカー属性がないリンクは、アンカー属性なしで返されます。（完全な）URIとしてHREFまたはアンカーが提出されたリンクは、それぞれの属性が変更されていないと返されます。"
    },
    {
      "indent": 3,
      "text": "The above rules allow the client to interpret the response as links without any further knowledge of the storage conventions of the RD. The RD MAY replace the registration base URIs with a configured intermediate proxy, e.g., in the case of an HTTP lookup interface for CoAP endpoints.",
      "ja": "上記のルールにより、クライアントは、RDのストレージ規則に関するさらなる知識なしに、応答をリンクとして解釈することができます。RDは、COAPエンドポイントのHTTPルックアップインターフェイスの場合、登録ベースのURIを構成された中間プロキシに置き換えることができます。"
    },
    {
      "indent": 3,
      "text": "If the base URI of a registration contains a link-local address, the RD MUST NOT show its links unless the lookup was made from the link on which the registered endpoint can be reached. The RD MUST NOT include zone identifiers in the resolved URIs.",
      "ja": "登録のベースURIにリンクローカルアドレスが含まれている場合、登録されたエンドポイントに到達できるリンクからルックアップが作成されない限り、RDはリンクを表示してはなりません。RDには、解決されたURIにゾーン識別子を含めてはなりません。"
    },
    {
      "indent": 0,
      "text": "6.2. Lookup Filtering",
      "section_title": true,
      "ja": "6.2. ルックアップフィルタリング"
    },
    {
      "indent": 3,
      "text": "Using the Accept option, the requester can control whether the returned list is returned in CoRE Link Format (application/link-format, default) or in alternate content formats (e.g., from [CORE-LINKS-JSON]).",
      "ja": "受け入れオプションを使用すると、リクエスターは、返されたリストがコアリンク形式（アプリケーション/リンクフォーマット、デフォルト）または代替コンテンツ形式（[Core-Links-JSON]から）で返されるかどうかを制御できます。"
    },
    {
      "indent": 3,
      "text": "Multiple search criteria MAY be included in a lookup. All included criteria MUST match for a link to be returned. The RD MUST support matching with multiple search criteria.",
      "ja": "複数の検索基準を検索に含めることができます。含まれるすべての基準は、リンクを返すために一致する必要があります。RDは、複数の検索基準とのマッチングをサポートする必要があります。"
    },
    {
      "indent": 3,
      "text": "A link matches a search criterion if it has an attribute of the same name and the same value, allowing for a trailing \"*\" wildcard operator, as in Section 4.1 of [RFC6690]. Attributes that are defined as relation-types (in the link-format ABNF) match if the search value matches any of their values (see Section 4.1 of [RFC6690]; for example, ?if=tag:example.net,2020:sensor matches ;if=\"example.regname tag:example.net,2020:sensor\";. A resource link also matches a search criterion if its endpoint would match the criterion, and vice versa, an endpoint link matches a search criterion if any of its resource links matches it.",
      "ja": "[RFC6690]のセクション4.1のように、同じ名前と同じ値の属性と同じ値の属性がある場合、リンクは検索基準と一致します。検索値がその値のいずれかと一致する場合、関係タイプとして定義される属性（リンクフォーマットABNF）は一致します（[RFC6690]のセクション4.1を参照、？一致; if = \"example.regnameタグ：example.net、2020：センサー\";。エンドポイントが基準と一致する場合、リソースリンクも検索基準と一致し、その逆の場合、エンドポイントリンクは検索基準と一致しますそのリソースリンクはそれと一致します。"
    },
    {
      "indent": 3,
      "text": "Note that href is a valid search criterion and matches target references. Like all search criteria, on a resource lookup, it can match the target reference of the resource link itself but also the registration resource of the endpoint that registered it. Queries for resource link targets MUST be in URI form (i.e., not relative references) and are matched against a resolved link target. Queries for endpoints SHOULD be expressed in path-absolute form if possible and MUST be expressed in URI form otherwise; the RD SHOULD recognize either. The anchor attribute is usable for resource lookups and, if queried, MUST be in URI form as well.",
      "ja": "HREFは有効な検索基準であり、ターゲット参照と一致することに注意してください。すべての検索基準と同様に、リソースの検索では、リソースリンク自体のターゲット参照だけでなく、登録したエンドポイントの登録リソースと一致させることができます。リソースリンクターゲットのクエリは、URI形式（つまり、相対的な参照ではなく）でなければならず、解決されたリンクターゲットと一致している必要があります。エンドポイントのクエリは、可能であればパスアブソリュート形式で表現する必要があり、そうでない場合はURI形式で表現する必要があります。RDはどちらかを認識する必要があります。アンカー属性は、リソースの検索に使用可能であり、照会された場合、URI形式でもある必要があります。"
    },
    {
      "indent": 3,
      "text": "Additional query parameters \"page\" and \"count\" are used to obtain lookup results in specified increments using pagination, where count specifies how many links to return and page specifies which subset of links organized in sequential pages, each containing 'count' links, starting with link zero and page zero. Thus, specifying a count of 10 and page of 0 will return the first 10 links in the result set (links 0-9). Specifying a count of 10 and page of 1 will return the next 'page' containing links 10-19, and so on. Unlike block-wise transfer of a complete result set, these parameters ensure that each chunk of results can be interpreted on its own. This simplifies the processing but can result in duplicate or missed items when coinciding with changes from the registration interface.",
      "ja": "追加のクエリパラメーター「ページ」と「カウント」を使用して、パジネーションを使用して特定の増分でルックアップ結果を取得するために使用されます。カウントは、countのリンクとページのリンクの数を指定し、それぞれが「カウント」リンクを含むリンクのサブセットを指定します。リンクゼロとページゼロ付き。したがって、10のカウントと0ページを指定すると、結果セットの最初の10リンクが返されます（リンク0-9）。10のカウントと1ページを指定すると、リンク10-19などを含む次の「ページ」などが返されます。完全な結果セットのブロックごとの転送とは異なり、これらのパラメーターは、結果の各チャンクを単独で解釈できることを保証します。これにより、処理が簡素化されますが、登録インターフェイスからの変更と一致する場合、アイテムが重複しているか見逃された場合があります。"
    },
    {
      "indent": 3,
      "text": "Endpoints that are interested in a lookup result repeatedly or continuously can use mechanisms such as ETag caching, resource observation [RFC7641], or any future mechanism that might allow more efficient observations of collections. These are advertised, detected, and used according to their own specifications and can be used with the lookup interface as with any other resource.",
      "ja": "ルックアップ結果に関心のあるエンドポイントは、繰り返しまたは継続的に継続的に、ETAGキャッシング、リソース観察[RFC7641]、またはコレクションのより効率的な観測を可能にする可能性のある将来のメカニズムなどのメカニズムを使用できます。これらは、独自の仕様に従って宣伝され、検出され、使用され、他のリソースと同様にルックアップインターフェイスで使用できます。"
    },
    {
      "indent": 3,
      "text": "When resource observation is used, every time the set of matching links changes or the content of a matching link changes, the RD sends a notification with the matching link set. The notification contains the successful current response to the given request, especially with respect to representing zero matching links (see \"Success\" item below).",
      "ja": "リソースの観察が使用されると、一致するリンクのセットが変更されたり、一致するリンクのコンテンツが変更されるたびに、RDは一致するリンクセットで通知を送信します。通知には、特にゼロマッチングリンクを表すことに関して、指定された要求に対する現在の応答が成功しています（以下の「成功」項目を参照）。"
    },
    {
      "indent": 3,
      "text": "The lookup interface is specified as follows:",
      "ja": "ルックアップインターフェイスは、次のように指定されています。"
    },
    {
      "indent": 3,
      "text": "Interaction:  Client -> RD",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Method: GET",
      "ja": "方法：取得します"
    },
    {
      "indent": 3,
      "text": "URI Template:  {+type-lookup-location}{?page,count,search*}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "URI Template Variables:",
      "ja": "URIテンプレート変数："
    },
    {
      "indent": 6,
      "text": "type-lookup-location := RD lookup URI for a given lookup type (mandatory). The address is discovered as described in Section 4.3.",
      "ja": "タイプルックアップロケーション：=特定のルックアップタイプ（必須）のRDルックアップURI。アドレスは、セクション4.3で説明されているように発見されます。"
    },
    {
      "indent": 6,
      "text": "search := Search criteria for limiting the number of results (optional). The search criteria are an associative array, expressed in a form-style query, as per the URI Template (see [RFC6570], Sections 2.4.2 and 3.2.8).",
      "ja": "検索：=結果の数を制限するための検索基準（オプション）。検索基準は、URIテンプレート（[RFC6570]、セクション2.4.2および3.2.8を参照）に従って、フォームスタイルのクエリで表現される連想配列です。"
    },
    {
      "indent": 6,
      "text": "page := Page (optional). This parameter cannot be used without the count parameter. Results are returned from result set in pages that contain 'count' links starting from index (page * count). Page numbering starts with zero.",
      "ja": "ページ：= page（optional）。このパラメーターは、カウントパラメーターなしでは使用できません。結果は、インデックス（ページ *カウント）から始まる「カウント」リンクを含むページで結果セットから返されます。ページ番号はゼロから始まります。"
    },
    {
      "indent": 6,
      "text": "count := Count (optional). The number of results is limited to this parameter value. If the page parameter is also present, the response MUST only include 'count' links starting with the (page * count) link in the result set from the query. If the count parameter is not present, then the response MUST return all matching links in the result set. Link numbering starts with zero.",
      "ja": "count：= count（optional）。結果の数は、このパラメーター値に制限されています。ページパラメーターも存在する場合、応答には、クエリから結果セットの（page * count）リンクから始まる「カウント」リンクのみを含める必要があります。カウントパラメーターが存在しない場合、応答は結果セットのすべての一致するリンクを返す必要があります。リンク番号はゼロで始まります。"
    },
    {
      "indent": 3,
      "text": "Accept: absent, application/link-format, or any other indicated media type representing web links",
      "ja": "受け入れ：不在、アプリケーション/リンク形式、またはWebリンクを表すその他の指示されたメディアタイプ"
    },
    {
      "indent": 3,
      "text": "The following responses codes are defined for this interface:",
      "ja": "次の応答コードは、このインターフェイスに対して定義されています。"
    },
    {
      "indent": 3,
      "text": "Success: 2.05 (Content) or 200 (OK) with an application/link-format or other web link payload containing matching entries for the lookup.",
      "ja": "成功：2.05（コンテンツ）または200（OK）アプリケーション/リンクフォーマットまたはその他のWebリンクペイロードを使用して、ルックアップのマッチングエントリを含みます。"
    },
    {
      "indent": 6,
      "text": "The payload can contain zero links (which is an empty payload in the link format described in [RFC6690] but could also be [] in JSON-based formats), indicating that no entities matched the request.",
      "ja": "ペイロードにはゼロリンク（[RFC6690]で説明されているリンク形式の空のペイロードであるが、JSONベースの形式で[]になる可能性がある）を含むことができ、リクエストと一致したエンティティがないことを示しています。"
    },
    {
      "indent": 0,
      "text": "6.3. Resource Lookup Examples",
      "section_title": true,
      "ja": "6.3. リソースルックアップの例"
    },
    {
      "indent": 3,
      "text": "The examples in this section assume the existence of CoAP hosts with a default CoAP port 61616. HTTP hosts are possible and do not change the nature of the examples.",
      "ja": "このセクションの例は、デフォルトのCOAPポート61616を持つCoAPホストの存在を想定しています。HTTPホストは可能であり、例の性質を変えません。"
    },
    {
      "indent": 3,
      "text": "The following example shows a client performing a resource lookup with the example resource lookup locations discovered in Figure 5:",
      "ja": "次の例は、図5で発見されたリソースルックアップの例を使用して、リソースルックアップを実行するクライアントを示しています。"
    },
    {
      "indent": 3,
      "text": "Req: GET /rd-lookup/res?rt=tag:example.org,2020:temperature",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Res: 2.05 Content\nPayload:\n<coap://[2001:db8:3::123]:61616/temp>;\n    rt=\"tag:example.org,2020:temperature\"",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 18,
      "text": "Figure 19: Example of a Resource Lookup",
      "ja": "図19：リソース検索の例"
    },
    {
      "indent": 3,
      "text": "A client that wants to be notified of new resources as they show up can use this observation:",
      "ja": "新しいリソースが表示されているときに通知されたいクライアントは、この観察結果を使用できます。"
    },
    {
      "indent": 3,
      "text": "Req: GET /rd-lookup/res?rt=tag:example.org,2020:light\nObserve: 0",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Res: 2.05 Content Observe: 23 Payload: empty",
      "ja": "Res：2.05コンテンツオブザーブ：23ペイロード：空"
    },
    {
      "indent": 3,
      "text": "(at a later point in time)",
      "ja": "（後の時点で）"
    },
    {
      "indent": 3,
      "text": "Res: 2.05 Content\nObserve: 24\nPayload:\n<coap://[2001:db8:3::124]/west>;rt=\"tag:example.org,2020:light\",\n<coap://[2001:db8:3::124]/south>;rt=\"tag:example.org,2020:light\",\n<coap://[2001:db8:3::124]/east>;rt=\"tag:example.org,2020:light\"",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 13,
      "text": "Figure 20: Example of an Observing Resource Lookup",
      "ja": "図20：観測リソースの検索の例"
    },
    {
      "indent": 3,
      "text": "The following example shows a client performing a paginated resource lookup:",
      "ja": "次の例は、クライアントがページングされたリソースの検索を実行することを示しています。"
    },
    {
      "indent": 3,
      "text": "Req: GET /rd-lookup/res?page=0&count=5",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Res: 2.05 Content\nPayload:\n<coap://[2001:db8:3::123]:61616/res/0>;ct=60,\n<coap://[2001:db8:3::123]:61616/res/1>;ct=60,\n<coap://[2001:db8:3::123]:61616/res/2>;ct=60,\n<coap://[2001:db8:3::123]:61616/res/3>;ct=60,\n<coap://[2001:db8:3::123]:61616/res/4>;ct=60",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Req: GET /rd-lookup/res?page=1&count=5",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Res: 2.05 Content\nPayload:\n<coap://[2001:db8:3::123]:61616/res/5>;ct=60,\n<coap://[2001:db8:3::123]:61616/res/6>;ct=60,\n<coap://[2001:db8:3::123]:61616/res/7>;ct=60,\n<coap://[2001:db8:3::123]:61616/res/8>;ct=60,\n<coap://[2001:db8:3::123]:61616/res/9>;ct=60",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 14,
      "text": "Figure 21: Example of Paginated Resource Lookup",
      "ja": "図21：塗装されたリソース検索の例"
    },
    {
      "indent": 3,
      "text": "The following example shows a client performing a lookup of all resources of all endpoints of a given endpoint type. It assumes that two endpoints (with endpoint names sensor1 and sensor2) have previously registered with their respective addresses (coap://sensor1.example.com and coap://sensor2.example.com) and posted the very payload of the 6th response of Section 5 of [RFC6690].",
      "ja": "次の例は、特定のエンドポイントタイプのすべてのエンドポイントのすべてのリソースのルックアップを実行するクライアントを示しています。これは、2つのエンドポイント（エンドポイント名Sensor1とSensor2を含む）がそれぞれのアドレス（coap：//sensor1.example.comおよびcoap：//sensor2.example.com）に以前に登録されており、6番目の応答の非常にペイロードを投稿していると想定しています。[RFC6690]のセクション5の。"
    },
    {
      "indent": 3,
      "text": "It demonstrates how absolute link targets stay unmodified, while relative ones are resolved:",
      "ja": "それは、相対的なリンクのターゲットがどのように修正されていないかを示していますが、相対的なターゲットは解決されます。"
    },
    {
      "indent": 3,
      "text": "Req: GET /rd-lookup/res?et=tag:example.com,2020:platform",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Res: 2.05 Content\nPayload:\n<coap://sensor1.example.com/sensors>;ct=40;title=\"Sensor Index\",\n<coap://sensor1.example.com/sensors/temp>;rt=temperature-c;if=sensor,\n<coap://sensor1.example.com/sensors/light>;rt=light-lux;if=sensor,\n<http://www.example.com/sensors/t123>;rel=describedby;\n    anchor=\"coap://sensor1.example.com/sensors/temp\",\n<coap://sensor1.example.com/t>;rel=alternate;\n    anchor=\"coap://sensor1.example.com/sensors/temp\",\n<coap://sensor2.example.com/sensors>;ct=40;title=\"Sensor Index\",\n<coap://sensor2.example.com/sensors/temp>;rt=temperature-c;if=sensor,\n<coap://sensor2.example.com/sensors/light>;rt=light-lux;if=sensor,\n<http://www.example.com/sensors/t123>;rel=describedby;\n    anchor=\"coap://sensor2.example.com/sensors/temp\",\n<coap://sensor2.example.com/t>;rel=alternate;\n    anchor=\"coap://sensor2.example.com/sensors/temp\"",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "Figure 22: Example of a Resource Lookup from Multiple Endpoints",
      "ja": "図22：複数のエンドポイントからのリソース検索の例"
    },
    {
      "indent": 0,
      "text": "6.4. Endpoint Lookup",
      "section_title": true,
      "ja": "6.4. エンドポイントルックアップ"
    },
    {
      "indent": 3,
      "text": "The endpoint lookup returns links to and information about registration resources, which themselves can only be manipulated by the registering endpoint.",
      "ja": "エンドポイントルックアップは、登録リソースへのリンクと情報を返します。これは、登録エンドポイントによってのみ操作できます。"
    },
    {
      "indent": 3,
      "text": "Endpoint registration resources are annotated with their endpoint names (ep), sectors (d, if present), and registration base URI (base; reports the registrant-EP's address if no explicit base was given), as well as a constant resource type (rt=\"core.rd-ep\"); the lifetime (lt) is not reported. Additional endpoint attributes are added as target attributes to their endpoint link unless their specification says otherwise.",
      "ja": "エンドポイント登録リソースには、エンドポイント名（EP）、セクター（d、存在する場合）、および登録ベースのURI（ベース;明示的なベースが与えられていない場合は登録者-EPの住所を報告します）と定数リソースタイプ（登録者-EPの住所を報告します）に注釈が付けられます（基本）rt = \"core.rd-ep\"）;生涯（LT）は報告されていません。仕様が特に言われない限り、追加のエンドポイント属性がエンドポイントリンクにターゲット属性として追加されます。"
    },
    {
      "indent": 3,
      "text": "Links to endpoints SHOULD be presented in path-absolute form or, if required, as (full) URIs. (This ensures that the output conforms to Limited Link Format, as described in Appendix C.)",
      "ja": "エンドポイントへのリンクは、パスアブソリュート形式で、または必要に応じて（フル）urisとして提示する必要があります。（これにより、付録Cで説明されているように、出力が限られたリンク形式に適合することが保証されます）"
    },
    {
      "indent": 3,
      "text": "Base addresses that contain link-local addresses MUST NOT include zone identifiers, and such registrations MUST NOT be shown unless the lookup was made from the same link from which the registration was made.",
      "ja": "リンクローカルアドレスを含むベースアドレスにはゾーン識別子を含めるべきではなく、登録が行われたのと同じリンクから検索が行われない限り、そのような登録は表示されないでください。"
    },
    {
      "indent": 3,
      "text": "While the endpoint lookup does expose the registration resources, the RD does not need to make them accessible to clients. Clients SHOULD NOT attempt to dereference or manipulate them.",
      "ja": "エンドポイントの検索では登録リソースが公開されますが、RDはクライアントがアクセスできるようにする必要はありません。クライアントは、それらを繰り返しや操作しようとしないでください。"
    },
    {
      "indent": 3,
      "text": "An RD can report registrations in lookup whose URI scheme and authority differ from that of the lookup resource. Lookup clients MUST be prepared to see arbitrary URIs as registration resources in the results and treat them as opaque identifiers; the precise semantics of such links are left to future specifications.",
      "ja": "RDは、URIスキームと権限がルックアップリソースとは異なるルックアップの登録を報告できます。ルックアップクライアントは、任意のURIを結果の登録リソースとして見るために準備し、それらを不透明な識別子として扱う必要があります。このようなリンクの正確なセマンティクスは、将来の仕様に任されています。"
    },
    {
      "indent": 3,
      "text": "The following example shows a client performing an endpoint lookup that is limited to endpoints of endpoint type tag:example.com,2020:platform:",
      "ja": "次の例は、エンドポイントタイプのエンドポイントに限定されたエンドポイントルックアップを実行するクライアントを示しています。"
    },
    {
      "indent": 3,
      "text": "Req: GET /rd-lookup/ep?et=tag:example.com,2020:platform",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Res: 2.05 Content\nPayload:\n</rd/1234>;base=\"coap://[2001:db8:3::127]:61616\";ep=node5;\n    et=\"tag:example.com,2020:platform\";ct=40;rt=core.rd-ep,\n</rd/4521>;base=\"coap://[2001:db8:3::129]:61616\";ep=node7;\n    et=\"tag:example.com,2020:platform\";ct=40;d=floor-3;\n    rt=core.rd-ep",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 19,
      "text": "Figure 23: Example of Endpoint Lookup",
      "ja": "図23：エンドポイントルックアップの例"
    },
    {
      "indent": 0,
      "text": "7. Security Policies",
      "section_title": true,
      "ja": "7. セキュリティポリシー"
    },
    {
      "indent": 3,
      "text": "The security policies that are applicable to an RD strongly depend on the application and are not set out normatively here.",
      "ja": "RDに適用可能なセキュリティポリシーは、アプリケーションに強く依存しており、ここで規範的に設定されていません。"
    },
    {
      "indent": 3,
      "text": "This section provides a list of aspects that applications should consider when describing their use of the RD, without claiming to cover all cases. It uses terminology of [ACE-OAUTH-AUTHZ], in which the RD acts as the Resource Server (RS), and both registrant-EPs and lookup clients act as Clients (C) with support from an Authorization Server (AS), without the intention of ruling out other schemes (e.g., those based on certificates/Public Key Infrastructures (PKIs)).",
      "ja": "このセクションでは、すべてのケースをカバーすると主張することなく、RDの使用を説明する際にアプリケーションが考慮すべき側面のリストを提供します。RDがリソースサーバー（RS）として機能する[Ace-oauth-authz]の用語を使用し、登録者EPとルックアップクライアントの両方が、認証サーバーのサポート（as）からサポートを使用してクライアントとして（c）を使用します。他のスキーム（例：証明書/公開インフラストラクチャ（PKIS）に基づくスキーム）を排除する意図。"
    },
    {
      "indent": 3,
      "text": "Any, all, or none of the below can apply to an application. Which are relevant depends on its protection objectives.",
      "ja": "以下のいずれか、または以下のいずれも、アプリケーションに適用できません。関連するものは、その保護目標によって異なります。"
    },
    {
      "indent": 3,
      "text": "Security policies are set by configuration of the RD or by choice of the implementation. Lookup clients (and, where relevant, endpoints) can only trust an RD to uphold them if it is authenticated and authorized to serve as an RD according to the application's requirements.",
      "ja": "セキュリティポリシーは、RDの構成または実装の選択によって設定されます。ルックアップクライアント（および関連する場合、エンドポイント）は、アプリケーションの要件に従ってRDとして認証され、許可されている場合にのみ、RDを支持することを信頼できます。"
    },
    {
      "indent": 0,
      "text": "7.1. Endpoint Name",
      "section_title": true,
      "ja": "7.1. エンドポイント名"
    },
    {
      "indent": 3,
      "text": "Whenever an RD needs to provide trustworthy results to clients doing endpoint lookup or resource lookup with filtering on the endpoint name, the RD must ensure that the registrant is authorized to use the given endpoint name. This applies both to registration and later to operations on the registration resource. It is immaterial whether the client is the registrant-EP itself or a CT is doing the registration. The RD cannot tell the difference, and CTs may use authorization credentials authorizing only operations on that particular endpoint name or a wider range of endpoint names.",
      "ja": "RDがエンドポイントのルックアップまたはエンドポイント名のフィルタリングを使用してエンドポイントルックアップまたはリソースルックアップを行うクライアントに信頼できる結果を提供する必要がある場合は、登録者が指定されたエンドポイント名を使用することを許可されていることを確認する必要があります。これは、登録と登録リソースの運用の両方に適用されます。クライアントが登録者のEP自体であるか、CTが登録を行っているかは重要ではありません。RDは違いを伝えることができず、CTSは、その特定のエンドポイント名またはより広いエンドポイント名の操作のみを承認する承認資格情報を使用する場合があります。"
    },
    {
      "indent": 3,
      "text": "It is up to the concrete security policy to describe how the endpoint name and sector are transported when certificates are used. For example, it may describe how SubjectAltName dNSName entries are mapped to endpoint and domain names.",
      "ja": "証明書が使用されているときにエンドポイント名とセクターがどのように輸送されるかを説明するのは、具体的なセキュリティポリシー次第です。たとえば、subjectaltname dnsnameエントリがエンドポイントとドメイン名にマッピングされる方法を説明する場合があります。"
    },
    {
      "indent": 0,
      "text": "7.1.1. Random Endpoint Names",
      "section_title": true,
      "ja": "7.1.1. ランダムエンドポイント名"
    },
    {
      "indent": 3,
      "text": "Conversely, in applications where the RD does not check the endpoint name, the authorized registering endpoint can generate a random number (or string) that identifies the endpoint. The RD should then remember unique properties of the registrant, associate them with the registration for as long as its registration resource is active (which may be longer than the registration's lifetime), and require the same properties for operations on the registration resource.",
      "ja": "逆に、RDがエンドポイント名をチェックしないアプリケーションでは、承認された登録エンドポイントは、エンドポイントを識別する乱数（または文字列）を生成できます。その後、RDは、登録者の一意のプロパティを覚えており、登録リソースがアクティブである限り（登録の生涯よりも長い場合がある場合）、登録リソースの操作に同じプロパティを必要とする限り、登録に関連付けます。"
    },
    {
      "indent": 3,
      "text": "Registrants that are prepared to pick a different identifier when their initial attempt (or attempts, in the unlikely case of two subsequent collisions) at registration is unauthorized should pick an identifier at least twice as long as would be needed to enumerate the expected number of registrants; registrants without any such recovery options should pick significantly longer endpoint names (e.g., using Universally Unique Identifier (UUID) URNs [RFC4122]).",
      "ja": "登録時に最初の試行（または2回の衝突のありそうもないケースで試行）が不正である場合に別の識別子を選択する準備ができている登録者は、登録者の予想数を列挙するために必要な識別子を少なくとも2倍長く選択する必要があります;このような回復オプションのない登録者は、非常に長いエンドポイント名を選択する必要があります（たとえば、普遍的に一意の識別子（UUID）URN [RFC4122]を使用して）。"
    },
    {
      "indent": 0,
      "text": "7.2. Entered Links",
      "section_title": true,
      "ja": "7.2. リンクを入力しました"
    },
    {
      "indent": 3,
      "text": "When lookup clients expect that certain types of links can only originate from certain endpoints, then the RD needs to apply filtering to the links an endpoint may register.",
      "ja": "ルックアップクライアントが特定の種類のリンクが特定のエンドポイントからのみ発生することを期待する場合、RDはエンドポイントが登録できるリンクにフィルタリングを適用する必要があります。"
    },
    {
      "indent": 3,
      "text": "For example, if clients use an RD to find a server that provides firmware updates, then any registrant that wants to register (or update) links to firmware sources will need to provide suitable credentials to do so, independently of its endpoint name.",
      "ja": "たとえば、クライアントがRDを使用してファームウェアの更新を提供するサーバーを見つけた場合、ファームウェアソースへのリンクを登録（または更新）したい登録者は、エンドポイント名とは独立して適切な資格情報を提供する必要があります。"
    },
    {
      "indent": 3,
      "text": "Note that the impact of having undesirable links in the RD depends on the application. If the client requires the firmware server to present credentials as a firmware server, a fraudulent link's impact is limited to the client revealing its intention to obtain updates and slowing down the client until it finds a legitimate firmware server; if the client accepts any credentials from the server as long as they fit the provided URI, the impact is larger.",
      "ja": "RDに望ましくないリンクを持つことの影響は、アプリケーションによって異なることに注意してください。クライアントがファームウェアサーバーに資格情報をファームウェアサーバーとして提示する必要がある場合、不正なリンクの影響は、クライアントに制限され、アップデートを取得する意図を明らかにし、正当なファームウェアサーバーが見つかるまでクライアントを遅くすることができます。クライアントが提供されたURIに適合している限り、サーバーからの資格情報を受け入れると、影響が大きくなります。"
    },
    {
      "indent": 3,
      "text": "An RD may also require that links are only registered if the registrant is authorized to publish information about the anchor (or even target) of the link. One way to do this is to demand that the registrant present the same credentials in its role as a registering client that it would need to present in its role as a server when contacted at the resources' URI. These credentials may include using the address and port that are part of the URI. Such a restriction places severe practical limitations on the links that can be registered.",
      "ja": "RDは、リンクのアンカー（またはターゲット）に関する情報を公開することを登録者が許可されている場合にのみ、リンクが登録されることを要求する場合があります。これを行う1つの方法は、登録者が、リソースのURIで連絡したときにサーバーとしての役割で提示する必要がある登録クライアントと同じ資格を提示することを要求することです。これらの資格情報には、URIの一部であるアドレスとポートの使用が含まれます。このような制限は、登録できるリンクに深刻な実際的な制限をもたらします。"
    },
    {
      "indent": 3,
      "text": "As above, the impact of undesirable links depends on the extent to which the lookup client relies on the RD. To avoid the limitations, RD applications should consider prescribing that lookup clients only use the discovered information as hints and describe which pieces of information need to be verified because they impact the application's security. A straightforward way to verify such information is to request it again from an authorized server, typically the one that hosts the target resource. That is similar to what happens in Section 4.3 when the \"URI discovery\" step is repeated.",
      "ja": "上記のように、望ましくないリンクの影響は、ルックアップクライアントがRDに依存する程度に依存します。制限を回避するために、RDアプリケーションは、検出された情報をヒントとしてのみ使用することをルックアップクライアントのみを処方し、アプリケーションのセキュリティに影響を与えるため、どの情報を検証する必要があるかを説明することを検討する必要があります。そのような情報を確認する簡単な方法は、承認されたサーバー、通常はターゲットリソースをホストするサーバーから再度リクエストすることです。これは、「URIディスカバリー」ステップが繰り返されるセクション4.3で起こることに似ています。"
    },
    {
      "indent": 0,
      "text": "7.3. Link Confidentiality",
      "section_title": true,
      "ja": "7.3. 機密性をリンクします"
    },
    {
      "indent": 3,
      "text": "When registrants publish information in the RD that is not available to any client that would query the registrant's /.well-known/core interface, or when lookups to that interface are subject to stricter firewalling than lookups to the RD, the RD may need to limit which lookup clients may access the information.",
      "ja": "登録者がRDで、登録者の /.well-nking/coreインターフェイスを照会するクライアントが利用できない情報を公開する場合、またはそのインターフェイスを検索する場合、RDの検索よりも厳しいファイアーの対象となる場合、RDはする必要があります。どのルックアップクライアントが情報にアクセスできるかを制限します。"
    },
    {
      "indent": 3,
      "text": "In this case, the endpoint (and not the lookup clients) needs to be careful to check the RD's authorization. The RD needs to check any lookup client's authorization before revealing information directly (in resource lookup) or indirectly (when using it to satisfy a resource lookup search criterion).",
      "ja": "この場合、エンドポイント（ルックアップクライアントではなく）は、RDの承認を確認するように注意する必要があります。RDは、情報を直接（リソース検索中）または間接的に（リソースルックアップ検索条件を満たすために使用する場合）、[リソースの検索でも）直接表示する前に、ルックアップクライアントの承認を確認する必要があります。"
    },
    {
      "indent": 0,
      "text": "7.4. Segmentation",
      "section_title": true,
      "ja": "7.4. セグメンテーション"
    },
    {
      "indent": 3,
      "text": "Within a single RD, different security policies can apply.",
      "ja": "単一のRD内では、異なるセキュリティポリシーが適用できます。"
    },
    {
      "indent": 3,
      "text": "One example of this are multi-tenant deployments separated by the sector (d) parameter. Some sectors might apply limitations on the endpoint names available, while others use a random identifier approach to endpoint names and place limits on the entered links based on their attributes instead.",
      "ja": "この1つの例は、セクター（d）パラメーターによって区切られたマルチテナント展開です。一部のセクターは、利用可能なエンドポイント名に制限を適用する場合がありますが、他のセクターは、代わりに属性に基づいて入力されたリンクにエンドポイント名と配置制限にランダム識別子アプローチを使用します。"
    },
    {
      "indent": 3,
      "text": "Care must be taken in such setups to determine the applicable access control measures to each operation. One easy way to do that is to mandate the use of the sector parameter on all operations, as no credentials are suitable for operations across sector borders anyway.",
      "ja": "このようなセットアップには、各操作に対する該当するアクセス制御測定を決定するために注意する必要があります。それを行う簡単な方法の1つは、とにかくセクターの境界全体の運用に適した資格情報はないため、すべての操作でセクターパラメーターの使用を義務付けることです。"
    },
    {
      "indent": 0,
      "text": "7.5. \"First Come First Remembered\": A Default Policy",
      "section_title": true,
      "ja": "7.5. 「最初に最初に覚えている」：デフォルトのポリシー"
    },
    {
      "indent": 3,
      "text": "The \"First Come First Remembered\" policy is provided both as a reference example for a security policy definition and as a policy that implementations may choose to use as default policy in the absence of any other configuration. It is designed to enable efficient discovery operations even in ad hoc settings.",
      "ja": "「First Come First Remembered」ポリシーは、セキュリティポリシーの定義の参照例として、また実装が他の構成がない場合にデフォルトポリシーとして使用することを選択できるポリシーの両方として提供されます。アドホックな設定でも効率的な発見操作を可能にするように設計されています。"
    },
    {
      "indent": 3,
      "text": "Under this policy, the RD accepts registrations for any endpoint name that is not assigned to an active registration resource and only accepts registration updates from the same endpoint. The policy is minimal in that it does not make any promises to lookup clients about the claims of Sections 7.2 and 7.3, and promises about the claims in Section 7.1 are limited to the lifetime of that endpoint's registration. It does however promise the endpoint that, for the duration of its registration, its links will be discoverable on the RD.",
      "ja": "このポリシーでは、RDは、アクティブな登録リソースに割り当てられていないエンドポイント名の登録を受け入れ、同じエンドポイントからの登録更新のみを受け入れます。このポリシーは、セクション7.2および7.3の主張についてクライアントを検索することを約束しないという点で最小限であり、セクション7.1の主張についての約束は、そのエンドポイントの登録の寿命に限定されています。ただし、登録期間中、そのリンクがRDで発見できるというエンドポイントを約束します。"
    },
    {
      "indent": 3,
      "text": "When a registration or operation is attempted, the RD MUST determine the client's subject name or public key:",
      "ja": "登録または操作が試みられた場合、RDはクライアントの件名または公開キーを決定する必要があります。"
    },
    {
      "indent": 3,
      "text": "* If the client's credentials indicate any subject name that is certified by any authority that the RD recognizes (which may be the system's trust anchor store), all such subject names are stored. With credentials based on CWT or JWT (as common with Authentication and Authorization for Constrained Environments (ACE)), the Subject (sub) claim is stored as a single name, if it exists. With X.509 certificates, the Common Name (CN) and the complete list of SubjectAltName entries are stored. In both cases, the authority that certified the claim is stored along with the subject, as the latter may only be locally unique.",
      "ja": "* クライアントの資格情報が、RDが認識している当局（システムの信頼アンカーストアである可能性がある）によって認定された件名名を示している場合、そのようなサブジェクト名はすべて保存されます。CWTまたはJWTに基づく資格情報（制約環境の認証と認可（ACE）に共通）では、件名（SUB）のクレームは、存在する場合、単一の名前として保存されます。X.509証明書を使用すると、共通名（CN）とsubjectaltnameエントリの完全なリストが保存されます。どちらの場合も、請求を認定した当局は、主題とともに保存されます。後者は地元でのみユニークである可能性があるためです。"
    },
    {
      "indent": 3,
      "text": "* Otherwise, if the client proves possession of a private key, the matching public key is stored. This applies both to raw public keys and to the public keys indicated in certificates that failed the above authority check.",
      "ja": "* それ以外の場合、クライアントが秘密鍵の所有権を証明した場合、一致する公開キーが保存されます。これは、生の公開キーと、上記の権限チェックに失敗した証明書に示されている公開キーの両方に適用されます。"
    },
    {
      "indent": 3,
      "text": "* If neither is present, a reference to the security session itself is stored. With (D)TLS, that is the connection itself or the session resumption information, if available. With OSCORE, that is the security context.",
      "ja": "* どちらも存在しない場合、セキュリティセッション自体への参照が保存されます。（d）TLSでは、利用可能な場合、接続自体またはセッション再開情報です。OSCOREでは、それがセキュリティコンテキストです。"
    },
    {
      "indent": 3,
      "text": "As part of the registration operation, that information is stored along with the registration resource.",
      "ja": "登録操作の一環として、その情報は登録リソースとともに保存されます。"
    },
    {
      "indent": 3,
      "text": "The RD MUST accept all registrations whose registration resource is not already active, as long as they are made using a security layer supported by the RD.",
      "ja": "RDは、RDがサポートするセキュリティレイヤーを使用して作成されている限り、登録リソースがまだアクティブではないすべての登録を受け入れる必要があります。"
    },
    {
      "indent": 3,
      "text": "Any operation on a registration resource, including registrations that lead to an existing registration resource, MUST be rejected by the RD unless all the stored information is found in the new request's credentials.",
      "ja": "既存の登録リソースにつながる登録を含む登録リソースの操作は、すべての保存された情報が新しいリクエストの資格情報で見つかっていない限り、RDによって拒否される必要があります。"
    },
    {
      "indent": 3,
      "text": "Note that, even though subject names are compared in this policy, they are never directly compared to endpoint names, and an endpoint cannot expect to \"own\" any particular endpoint name outside of an active registration -- even if a certificate says so. It is an accepted shortcoming of this approach that the endpoint has no indication of whether the RD remembers it by its subject name or public key; recognition by subject happens on a best-effort basis (given the RD may not recognize any authority). Clients MUST be prepared to pick a different endpoint name when rejected by the RD initially or after a change in their credentials; picking an endpoint name, as per Section 7.1.1, is an easy option for that.",
      "ja": "このポリシーではサブジェクト名が比較されていても、エンドポイント名と直接比較されることはなく、エンドポイントは、証明書がそう言っていても、アクティブな登録以外の特定のエンドポイント名を「所有」することを期待できないことに注意してください。このアプローチの受け入れられている欠点は、エンドポイントに、RDが主題名または公開鍵でそれを覚えているかどうかを示していないことです。被験者による認識は、最高の効果ベースで行われます（RDが権限を認識しない場合がある場合）。クライアントは、最初にRDによって拒否されたときまたは資格情報の変更後に別のエンドポイント名を選択する準備をする必要があります。セクション7.1.1に従って、エンドポイント名を選択することは、そのための簡単なオプションです。"
    },
    {
      "indent": 3,
      "text": "For this policy to be usable without configuration, clients should not set a sector name in their registrations. An RD can set a default sector name for registrations accepted under this policy, which is especially useful in a segmented setup where different policies apply to different sectors. The configuration of such a behavior, as well as any other configuration applicable to such an RD (i.e., the set of recognized authorities), is out of scope for this document.",
      "ja": "このポリシーが構成なしで使用できるようにするために、クライアントは登録にセクター名を設定しないでください。RDは、このポリシーに基づいて受け入れられた登録のデフォルトセクター名を設定できます。これは、異なるセクターに異なるポリシーが適用されるセグメント化されたセットアップで特に役立ちます。このような動作の構成と、そのようなRDに適用されるその他の構成（つまり、認識された当局のセット）は、この文書の範囲外です。"
    },
    {
      "indent": 0,
      "text": "8. Security Considerations",
      "section_title": true,
      "ja": "8. セキュリティ上の考慮事項"
    },
    {
      "indent": 3,
      "text": "The security considerations as described in Section 5 of [RFC8288] and Section 6 of [RFC6690] apply. The /.well-known/core resource may be protected, e.g., using DTLS when hosted on a CoAP server, as described in [RFC7252].",
      "ja": "[RFC8288]のセクション5および[RFC6690]のセクション6で説明されているセキュリティ上の考慮事項が適用されます。[RFC7252]で説明されているように、 /.Well-Nownd/Coreリソースは、たとえば、COAPサーバーでホストする場合にDTLSを使用して保護できます。"
    },
    {
      "indent": 3,
      "text": "Access that is limited or affects sensitive data SHOULD be protected, e.g., using (D)TLS or OSCORE [RFC8613]; which aspects of the RD this affects depends on the security policies of the application (see Section 7).",
      "ja": "制限されている、または機密データに影響を与えるアクセスは、（d）TLSまたはOSCORE [RFC8613]を使用して保護する必要があります。これに影響するRDのどの側面が、アプリケーションのセキュリティポリシーに依存します（セクション7を参照）。"
    },
    {
      "indent": 0,
      "text": "8.1. Discovery",
      "section_title": true,
      "ja": "8.1. 発見"
    },
    {
      "indent": 3,
      "text": "Most steps in discovery of the RD, and possibly its resources, are not covered by CoAP's security mechanisms. This will not endanger the security properties of the registrations and lookup itself (where the client requires authorization of the RD if it expects any security properties of the operation) but may leak the client's intention to third parties and allow them to slow down the process.",
      "ja": "RDの発見におけるほとんどのステップ、およびおそらくそのリソースは、COAPのセキュリティメカニズムの対象ではありません。これは、登録とルックアップ自体のセキュリティプロパティを危険にさらすことはありません（クライアントが操作のセキュリティプロパティを期待する場合、クライアントがRDの承認を必要とする場合）が、クライアントの意図を第三者に漏らし、プロセスを遅らせることができます。"
    },
    {
      "indent": 3,
      "text": "To mitigate that, clients can retain the RD's address, use secure discovery options (such as configured addresses), and send queries for RDs in a very general form (e.g., ?rt=core.rd* rather than ?rt=core.rd-lookup-ep).",
      "ja": "それを軽減するために、クライアントはRDのアドレスを保持し、安全なディスカバリーオプション（構成アドレスなど）を使用し、RDのクエリを非常に一般的な形式で送信できます（例：？rt = core.rd*ではなく？rt = core.rd-lookup-ep）。"
    },
    {
      "indent": 0,
      "text": "8.2. Endpoint Identification and Authentication",
      "section_title": true,
      "ja": "8.2. エンドポイントの識別と認証"
    },
    {
      "indent": 3,
      "text": "An endpoint (name, sector) pair is unique within the set of endpoints registered by the RD. An endpoint MUST NOT be identified by its protocol, port, or IP address, as these may change over the lifetime of an endpoint.",
      "ja": "エンドポイント（名前、セクター）ペアは、RDによって登録されているエンドポイントのセット内で一意です。エンドポイント、ポート、またはIPアドレスによってエンドポイントを識別してはなりません。これらはエンドポイントの寿命にわたって変化する可能性があるためです。"
    },
    {
      "indent": 3,
      "text": "Every operation performed by an endpoint on an RD SHOULD be mutually authenticated using a pre-shared key, a raw public key, or certificate-based security.",
      "ja": "RDのエンドポイントによって実行されるすべての操作は、事前共有キー、生の公開キー、または証明書ベースのセキュリティを使用して相互に認証される必要があります。"
    },
    {
      "indent": 3,
      "text": "Consider the following threat: two devices, A and B, are registered at a single server. Both devices have unique, per-device credentials for use with DTLS to make sure that only parties with authorization to access A or B can do so.",
      "ja": "次の脅威を考慮してください。2つのデバイス、AとBは、単一のサーバーに登録されています。両方のデバイスには、DTLSで使用するユニークなデバイスごとの資格情報があり、AまたはBにアクセスする許可を持つ当事者のみができることを確認します。"
    },
    {
      "indent": 3,
      "text": "Now, imagine that a malicious device A wants to sabotage the device B. It uses its credentials during the DTLS exchange. Then, it specifies the endpoint name of device B as the name of its own endpoint in device A. If the server does not check whether the identifier provided in the DTLS handshake matches the identifier used at the CoAP layer, then it may be inclined to use the endpoint name for looking up what information to provision to the malicious device.",
      "ja": "さて、悪意のあるデバイスAがデバイスBを妨害したいと考えていると想像してください。DTLS交換中に資格情報を使用します。次に、デバイスBのエンドポイント名をデバイスAの独自のエンドポイントの名前として指定します。DTLSハンドシェイクで提供されている識別子がCOAPレイヤーで使用される識別子と一致するかどうかをサーバーが確認しない場合、エンドポイント名を使用して、悪意のあるデバイスにプロビジョニングする情報を検索します。"
    },
    {
      "indent": 3,
      "text": "Endpoint authorization needs to be checked on registration and registration resource operations independently of whether there are configured requirements on the credentials for a given endpoint name and sector (Section 7.1) or whether arbitrary names are accepted (Section 7.1.1).",
      "ja": "エンドポイントの承認は、特定のエンドポイント名とセクターの資格情報に構成された要件があるかどうか（セクション7.1）または任意の名前が受け入れられているかどうか（セクション7.1.1）かどうかとは無関係に、登録および登録リソースの操作について確認する必要があります。"
    },
    {
      "indent": 3,
      "text": "Simple registration could be used to circumvent address-based access control. An attacker would send a simple registration request with the victim's address as the source address and later look up the victim's /.well-known/core content in the RD. Mitigation for this is recommended in Section 5.1.",
      "ja": "簡単な登録を使用して、アドレスベースのアクセス制御を回避できます。攻撃者は、被害者の住所に簡単な登録リクエストを送信元住所として送信し、後でRDの /.Well-Nowned/Coreコンテンツを調べます。このための緩和は、セクション5.1で推奨されます。"
    },
    {
      "indent": 3,
      "text": "The registration resource path is visible to any client that is allowed endpoint lookup and can be extracted by resource lookup clients as well. The same goes for registration attributes that are shown as target attributes or lookup attributes. The RD needs to consider this in the choice of registration resource paths, as do administrators or endpoints in their choice of attributes.",
      "ja": "登録リソースパスは、エンドポイントルックアップが許可されているクライアントに表示され、リソースルックアップクライアントによっても抽出できます。ターゲット属性またはルックアップ属性として表示される登録属性についても同じことが言えます。RDは、属性の選択における管理者またはエンドポイントと同様に、登録リソースパスの選択でこれを考慮する必要があります。"
    },
    {
      "indent": 0,
      "text": "8.3. Access Control",
      "section_title": true,
      "ja": "8.3. アクセス制御"
    },
    {
      "indent": 3,
      "text": "Access control SHOULD be performed separately for the RD registration and lookup API paths, as different endpoints may be authorized to register with an RD from those authorized to look up endpoints from the RD. Such access control SHOULD be performed in as fine-grained a level as possible. For example, access control for lookups could be performed either at the sector, endpoint, or resource level.",
      "ja": "RD登録とルックアップAPIパスのアクセス制御は、RDのエンドポイントを検索することが許可されたものからRDに登録することを許可することが許可される場合があるため、RD登録とルックアップAPIパスのために個別に実行する必要があります。このようなアクセス制御は、可能な限り細かい粒度のAレベルで実行する必要があります。たとえば、ルックアップのアクセス制御は、セクター、エンドポイント、またはリソースレベルで実行できます。"
    },
    {
      "indent": 3,
      "text": "The precise access controls necessary (and the consequences of failure to enforce them) depend on the protection objectives of the application and the security policies (Section 7) derived from them.",
      "ja": "必要な正確なアクセス制御（およびそれらを強制しないことの結果）は、アプリケーションの保護目標とそれらから派生したセキュリティポリシー（セクション7）に依存します。"
    },
    {
      "indent": 0,
      "text": "8.4. Denial-of-Service Attacks",
      "section_title": true,
      "ja": "8.4. サービス拒否攻撃"
    },
    {
      "indent": 3,
      "text": "Services that run over UDP unprotected are vulnerable to unknowingly amplify and distribute a DoS attack, as UDP does not require a return routability check. Since RD lookup responses can be significantly larger than requests, RDs are prone to this.",
      "ja": "UDPが返品ルー上のチェックを必要としないため、UDPを保護されていないUDPを介して実行されているサービスは、無意識のうちに増幅および配布することに対して脆弱です。RDルックアップ応答はリクエストよりも大幅に大きくなる可能性があるため、RDSはこれになりやすいです。"
    },
    {
      "indent": 3,
      "text": "[RFC7252] describes this at length in its Section 11.3, including some mitigation by using small block sizes in responses. [RFC9175] updates that by describing a source address verification mechanism using the Echo option.",
      "ja": "[RFC7252]は、応答の小さなブロックサイズを使用したいくつかの緩和を含む、セクション11.3で長々と説明しています。[RFC9175]は、ECHOオプションを使用してソースアドレス検証メカニズムを記述することにより、それを更新します。"
    },
    {
      "indent": 0,
      "text": "8.5. Skipping Freshness Checks",
      "section_title": true,
      "ja": "8.5. 新鮮さのチェックをスキップします"
    },
    {
      "indent": 3,
      "text": "When RD-based applications are built in which request freshness checks are not performed, these concerns need to be balanced:",
      "ja": "RDベースのアプリケーションが構築されている場合、リクエストの新鮮さのチェックが実行されない場合、これらの懸念はバランスをとる必要があります。"
    },
    {
      "indent": 3,
      "text": "* When alterations to registration attributes are reordered, an attacker may create any combination of attributes ever set, with the attack difficulty determined by the security layer's replay properties.",
      "ja": "* 登録属性の変更が再注文されると、攻撃者はこれまでに設定された属性の任意の組み合わせを作成する場合があり、攻撃の難易度はセキュリティレイヤーのリプレイプロパティによって決定されます。"
    },
    {
      "indent": 6,
      "text": "For example, if Figure 18 were conducted without freshness assurances, an attacker could later reset the lifetime back to 7200. Thus, the device is made unreachable to lookup clients.",
      "ja": "たとえば、図18が新鮮さを保証せずに実施された場合、攻撃者は後に寿命を7200に戻すことができます。したがって、デバイスはルックアップクライアントに到達できなくなります。"
    },
    {
      "indent": 3,
      "text": "* When registration updates without query parameters (which just serve to restart the lifetime) can be reordered, an attacker can use intercepted messages to give the appearance of the device being alive to the RD.",
      "ja": "* クエリパラメーターのない登録の更新（生涯を再起動するためだけに役立つ）を並べ替えることができれば、攻撃者はインターセプトされたメッセージを使用して、RDに生きているデバイスの外観を与えることができます。"
    },
    {
      "indent": 6,
      "text": "This is unacceptable when the RD's security policy promises reachability of endpoints (e.g., when disappearing devices would trigger further investigation) but may be acceptable with other policies.",
      "ja": "これは、RDのセキュリティポリシーがエンドポイントの到達可能性を約束する場合（たとえば、デバイスが消えるとさらなる調査をトリガーする場合）、他のポリシーで受け入れられる場合があります。"
    },
    {
      "indent": 0,
      "text": "9. IANA Considerations",
      "section_title": true,
      "ja": "9. IANAの考慮事項"
    },
    {
      "indent": 0,
      "text": "9.1. Resource Types",
      "section_title": true,
      "ja": "9.1. リソースタイプ"
    },
    {
      "indent": 3,
      "text": "IANA has added the following values to the \"Resource Type (rt=) Link Target Attribute Values\" subregistry of the \"Constrained RESTful Environments (CoRE) Parameters\" registry defined in [RFC6690]:",
      "ja": "IANAは、[RFC6690]で定義されている「制約付きRESTFUL環境（CORE）パラメーター」レジストリの「リソースタイプ（rt =）リンクターゲット属性値」のサブレジストリに次の値を追加しました。"
    },
    {
      "indent": 4,
      "text": "+====================+=============================+=============+\n| Value              | Description                 | Reference   |\n+====================+=============================+=============+\n| core.rd            | Directory resource of an RD | RFC 9176,   |\n|                    |                             | Section 4.3 |\n+--------------------+-----------------------------+-------------+\n| core.rd-lookup-res | Resource lookup of an RD    | RFC 9176,   |\n|                    |                             | Section 4.3 |\n+--------------------+-----------------------------+-------------+\n| core.rd-lookup-ep  | Endpoint lookup of an RD    | RFC 9176,   |\n|                    |                             | Section 4.3 |\n+--------------------+-----------------------------+-------------+\n| core.rd-ep         | Endpoint resource of an RD  | RFC 9176,   |\n|                    |                             | Section 6   |\n+--------------------+-----------------------------+-------------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 10,
      "text": "Table 2: Additions to Resource Type (rt=) Link Target Attribute Values Subregistry",
      "ja": "表2：リソースタイプへの追加（rt =）リンクターゲット属性値サブレジストリ"
    },
    {
      "indent": 0,
      "text": "9.2. IPv6 ND Resource Directory Address Option",
      "section_title": true,
      "ja": "9.2. IPv6 ndリソースディレクトリアドレスオプション"
    },
    {
      "indent": 3,
      "text": "IANA has registered one new ND option type in the \"IPv6 Neighbor Discovery Option Formats\" subregistry of the \"Internet Control Message Protocol version 6 (ICMPv6) Parameters\" registry:",
      "ja": "IANAは、「IPv6 Neighbor Discovery Option Formats」に「Internter Control Message Protocolバージョン6（ICMPV6）パラメーター」のサブレジストリに1つの新しいNDオプションタイプを登録しています。レジストリ："
    },
    {
      "indent": 9,
      "text": "+======+===================================+===========+\n| Type | Description                       | Reference |\n+======+===================================+===========+\n| 41   | Resource Directory Address Option | RFC 9176  |\n+------+-----------------------------------+-----------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 11,
      "text": "Table 3: Addition to IPv6 Neighbor Discovery Option Formats Subregistry",
      "ja": "表3：IPv6 Neighbor Discovery Option Formats Subregistryに追加"
    },
    {
      "indent": 0,
      "text": "9.3. RD Parameters Registry",
      "section_title": true,
      "ja": "9.3. RDパラメータレジストリ"
    },
    {
      "indent": 3,
      "text": "This specification defines a new subregistry for registration and lookup parameters called \"RD Parameters\" within the \"Constrained RESTful Environments (CoRE) Parameters\" registry. Although this specification defines a basic set of parameters, it is expected that other standards that make use of this interface will define new ones.",
      "ja": "この仕様は、「制約付きのRESTFUL環境（CORE）パラメーター」内の「RDパラメーター」と呼ばれる登録およびルックアップパラメーターの新しいサブレジストリを定義します。この仕様は基本的なパラメーターセットを定義しますが、このインターフェイスを使用する他の標準が新しい標準を定義することが期待されています。"
    },
    {
      "indent": 3,
      "text": "Each entry in the registry must include:",
      "ja": "レジストリ内の各エントリには以下を含める必要があります。"
    },
    {
      "indent": 3,
      "text": "* the human-readable name of the parameter,",
      "ja": "* パラメーターの人間の読み取り可能な名前、"
    },
    {
      "indent": 3,
      "text": "* the short name, as used in query parameters or target attributes,",
      "ja": "* クエリパラメーターまたはターゲット属性で使用される短い名前、"
    },
    {
      "indent": 3,
      "text": "* syntax and validity requirements (if any),",
      "ja": "* 構文と妥当性の要件（ある場合）、"
    },
    {
      "indent": 3,
      "text": "* indication of whether it can be passed as a query parameter at registration of endpoints, passed as a query parameter in lookups, or expressed as a target attribute,",
      "ja": "* エンドポイントの登録時にクエリパラメーターとして渡すことができるか、ルックアップでクエリパラメーターとして渡されるか、ターゲット属性として表現できるかどうかを示しています。"
    },
    {
      "indent": 3,
      "text": "* a description, and",
      "ja": "* 説明、そして"
    },
    {
      "indent": 3,
      "text": "* a link to reference documentation.",
      "ja": "* 参照ドキュメントへのリンク。"
    },
    {
      "indent": 3,
      "text": "The query parameter MUST be both a valid URI query key [RFC3986] and a token as used in [RFC8288].",
      "ja": "クエリパラメーターは、有効なURIクエリキー[RFC3986]と[RFC8288]で使用されているトークンの両方である必要があります。"
    },
    {
      "indent": 3,
      "text": "The reference documentation must give details on whether the parameter can be updated and how it is to be processed in lookups.",
      "ja": "参照ドキュメントは、パラメーターを更新できるかどうか、およびルックアップでどのように処理するかについての詳細を提供する必要があります。"
    },
    {
      "indent": 3,
      "text": "The mechanisms around new RD parameters should be designed in such a way that they tolerate RD implementations that are unaware of the parameter and expose any parameter passed at registration or updates in endpoint lookups. (For example, if a parameter used at registration were to be confidential, the registering endpoint should be instructed to only set that parameter if the RD advertises support for keeping it confidential at the discovery step.)",
      "ja": "新しいRDパラメーターをめぐるメカニズムは、パラメーターを認識しないRD実装に許容し、エンドポイントルックアップの登録または更新時に渡されたパラメーターを公開するように設計する必要があります。（たとえば、登録時に使用されたパラメーターが機密である場合、RDがディスカバリーステップで機密を維持するためのサポートを宣伝する場合にのみ、登録エンドポイントにそのパラメーターを設定するように指示する必要があります。）"
    },
    {
      "indent": 3,
      "text": "Initial entries in this subregistry are as follows:",
      "ja": "このサブレジストリの初期エントリは次のとおりです。"
    },
    {
      "indent": 4,
      "text": "+==============+=======+==============+=====+=====================+\n| Name         | Short | Validity     | Use | Description         |\n+==============+=======+==============+=====+=====================+\n| Endpoint     | ep    | Unicode*     | RLA | Name of the         |\n| Name         |       |              |     | endpoint            |\n+--------------+-------+--------------+-----+---------------------+\n| Lifetime     | lt    | 1-4294967295 | R   | Lifetime of the     |\n|              |       |              |     | registration in     |\n|              |       |              |     | seconds             |\n+--------------+-------+--------------+-----+---------------------+\n| Sector       | d     | Unicode*     | RLA | Sector to which     |\n|              |       |              |     | this endpoint       |\n|              |       |              |     | belongs             |\n+--------------+-------+--------------+-----+---------------------+\n| Registration | base  | URI          | RLA | The scheme,         |\n| Base URI     |       |              |     | address, port, and  |\n|              |       |              |     | path at which this  |\n|              |       |              |     | server is available |\n+--------------+-------+--------------+-----+---------------------+\n| Page         | page  | Integer      | L   | Used for pagination |\n+--------------+-------+--------------+-----+---------------------+\n| Count        | count | Integer      | L   | Used for pagination |\n+--------------+-------+--------------+-----+---------------------+\n| Endpoint     | et    | RFC 9176,    | RLA | Semantic type of    |\n| Type         |       | Section      |     | the endpoint (see   |\n|              |       | 9.3.1        |     | RFC 9176,           |\n|              |       |              |     | Section 9.4)        |\n+--------------+-------+--------------+-----+---------------------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 20,
      "text": "Table 4: New RD Parameters Registry",
      "ja": "表4：新しいRDパラメータレジストリ"
    },
    {
      "indent": 3,
      "text": "Where:",
      "ja": "ただし："
    },
    {
      "indent": 3,
      "text": "Short: Short name used in query parameters or target attributes",
      "ja": "ショート：クエリパラメーターまたはターゲット属性で使用される短い名前"
    },
    {
      "indent": 3,
      "text": "Validity:",
      "ja": "有効："
    },
    {
      "indent": 6,
      "text": "Unicode* = up to 63 bytes of UTF-8-encoded Unicode, with no control characters as per Section 5",
      "ja": "Unicode* = UTF-8エンコードされたUnicodeの最大63バイトから、セクション5に従って制御文字はありません"
    },
    {
      "indent": 3,
      "text": "Use:",
      "ja": "使用する："
    },
    {
      "indent": 6,
      "text": "R = used at registration L = used at lookup A = expressed in the target attribute",
      "ja": "r =登録時に使用l =ルックアップで使用a =ターゲット属性で表現"
    },
    {
      "indent": 3,
      "text": "The descriptions for the options defined in this document are only summarized here. To which registrations they apply and when they are to be shown are described in the respective sections of this document. All their reference documentation entries point to this document.",
      "ja": "このドキュメントで定義されているオプションの説明は、ここでのみ要約されています。どの登録が適用され、それらが表示される場合に、このドキュメントのそれぞれのセクションで説明されています。すべての参照ドキュメントエントリは、このドキュメントを指しています。"
    },
    {
      "indent": 3,
      "text": "The IANA policy for future additions to the subregistry is Expert Review, as described in [RFC8126]. The evaluation should consider formal criteria, duplication of functionality (i.e., is the new entry redundant with an existing one?), topical suitability (e.g., is the described property actually a property of the endpoint and not a property of a particular resource, in which case it should go into the payload of the registration and need not be registered?), and the potential for conflict with commonly used target attributes (e.g., if could be used as a parameter for conditional registration if it were not to be used in lookup or attributes but would make a bad parameter for lookup because a resource lookup with an if query parameter could ambiguously filter by the registered endpoint property or the target attribute [RFC6690]).",
      "ja": "[RFC8126]に記載されているように、サブレジストリへの将来の追加に関するIANAポリシーは専門家のレビューです。評価では、正式な基準、機能の複製（つまり、新しいエントリは既存のものと冗長性がありますか？）、局所的適合性を考慮する必要があります（たとえば、記述されたプロパティは実際にはエンドポイントのプロパティであり、特定のリソースのプロパティではなく、登録のペイロードに移動する必要があり、登録する必要はありませんか？）、および一般的に使用されるターゲット属性との競合の可能性（たとえば、使用しない場合は条件付き登録のパラメーターとして使用できる場合は、検索または属性ですが、ifクエリパラメーターを使用したリソースルックアップは、登録されたエンドポイントプロパティまたはターゲット属性[RFC6690]によってあいまいにフィルタリングできるため、ルックアップの悪いパラメーターを作成します。"
    },
    {
      "indent": 0,
      "text": "9.3.1. Full Description of the \"Endpoint Type\" RD Parameter",
      "section_title": true,
      "ja": "9.3.1. 「エンドポイントタイプ」RDパラメーターの完全な説明"
    },
    {
      "indent": 3,
      "text": "An endpoint registering at an RD can describe itself with endpoint types, similar to how resources are described with resource types in [RFC6690]. An endpoint type is expressed as a string, which can be either a URI or one of the values defined in the \"Endpoint Type (et=) RD Parameter Values\" subregistry. Endpoint types can be passed in the et query parameter as part of extra-attrs at the \"registration\" step of Section 5, are shown on endpoint lookups using the et target attribute, and can be filtered for using et as a search criterion in resource and endpoint lookup. Multiple endpoint types are given as separate query parameters or link attributes.",
      "ja": "RDで登録するエンドポイントは、[RFC6690]のリソースタイプでリソースの説明方法と同様に、エンドポイントタイプでそれ自体を記述できます。エンドポイントタイプは文字列として表されます。これは、URIまたは「エンドポイントタイプ（ET =）RDパラメーター値」で定義されている値のいずれかである可能性があります。エンドポイントタイプは、セクション5の「登録」ステップでエクストラアトトルの一部としてETクエリパラメーターに渡すことができ、ETターゲット属性を使用してエンドポイントルックアップに表示され、リソースの検索基準としてETとして使用するためにフィルタリングできます。エンドポイントルックアップ。複数のエンドポイントタイプには、個別のクエリパラメーターまたはリンク属性として与えられます。"
    },
    {
      "indent": 3,
      "text": "Note that the endpoint type differs from the resource type in that it uses multiple attributes rather than space-separated values. As a result, RDs implementing this specification automatically support correct filtering in the lookup interfaces from the rules for unknown endpoint attributes.",
      "ja": "エンドポイントタイプは、スペース分離値ではなく複数の属性を使用するという点で、リソースタイプとは異なることに注意してください。その結果、この仕様を実装するRDSは、不明なエンドポイント属性のルールからのルックアップインターフェイスでの正しいフィルタリングを自動的にサポートします。"
    },
    {
      "indent": 0,
      "text": "9.4. Endpoint Type (et=) RD Parameter Values",
      "section_title": true,
      "ja": "9.4. エンドポイントタイプ（ET =）RDパラメーター値"
    },
    {
      "indent": 3,
      "text": "This specification establishes a new subregistry called \"Endpoint Type (et=) RD Parameter Values\" within the \"Constrained RESTful Environments (CoRE) Parameters\" registry. The registry properties (required policy, requirements, and template) are identical to those of the \"Resource Type (rt=) Link Target Attribute Values\" subregistry defined in [RFC6690]; in short, the review policy is IETF Review for values starting with \"core\" and Specification Required for others.",
      "ja": "この仕様は、「制約付きのRESTFUL環境（CORE）パラメーター」レジストリ内の「エンドポイントタイプ（ET =）RDパラメーター値」と呼ばれる新しいサブレジストリを確立します。レジストリプロパティ（必要なポリシー、要件、およびテンプレート）は、[RFC6690]で定義されている「リソースタイプ（rt =）リンクターゲット属性値」サブレジストリのものと同一です。要するに、レビューポリシーは、「コア」と他の人に必要な仕様から始まる値のIETFレビューです。"
    },
    {
      "indent": 3,
      "text": "The requirements to be enforced are:",
      "ja": "施行される要件は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "* The values MUST be related to the purpose described in Section 9.3.1.",
      "ja": "* 値は、セクション9.3.1で説明されている目的に関連している必要があります。"
    },
    {
      "indent": 3,
      "text": "* The registered values MUST conform to the ABNF reg-rel-type definition of [RFC6690] and MUST NOT be a URI.",
      "ja": "* 登録値は、[RFC6690]のABNF REG-RELタイプの定義に準拠する必要があり、URIであってはなりません。"
    },
    {
      "indent": 3,
      "text": "* It is recommended to use the period \".\" character for segmentation.",
      "ja": "* 期間を使用することをお勧めします。セグメンテーションのキャラクター。"
    },
    {
      "indent": 3,
      "text": "The initial contents of the registry are as follows:",
      "ja": "レジストリの最初の内容は次のとおりです。"
    },
    {
      "indent": 4,
      "text": "+===============+====================================+===========+\n| Value         | Description                        | Reference |\n+===============+====================================+===========+\n| core.rd-group | An application group, as described | RFC 9176  |\n|               | in RFC 9176, Appendix A.           |           |\n+---------------+------------------------------------+-----------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "Table 5: New Endpoint Type (et=) RD Parameter Values Registry",
      "ja": "表5：新しいエンドポイントタイプ（ET =）RDパラメーター値レジストリ"
    },
    {
      "indent": 0,
      "text": "9.5. Multicast Address Registration",
      "section_title": true,
      "ja": "9.5. マルチキャストアドレス登録"
    },
    {
      "indent": 3,
      "text": "IANA has assigned the following multicast addresses for use by CoAP nodes:",
      "ja": "IANAは、COAPノードで使用するために次のマルチキャストアドレスを割り当てました。"
    },
    {
      "indent": 3,
      "text": "IPv4 -- \"All CoRE Resource Directories\" address 224.0.1.190, in the \"Internetwork Control Block (224.0.1.0 - 224.0.1.255 (224.0.1/24))\" subregistry within the \"IPv4 Multicast Address Space Registry\". As the address is used for discovery that may span beyond a single network, it has come from the Internetwork Control Block (224.0.1.x) [RFC5771].",
      "ja": "IPv4-「すべてのコアリソースディレクトリ」は、「インターネットワーク制御ブロック（224.0.1.0-224.0.1.255（224.0.1/24））」で、「IPv4マルチキャストアドレススペースレジストリ」内のサブレジストリで、224.0.1.1.190アドレス224.0.1.190を扱います。アドレスは、単一のネットワークを超えて及ぶ発見に使用されるため、インターネットワーク制御ブロック（224.0.1.x）[RFC5771]から来ています。"
    },
    {
      "indent": 3,
      "text": "IPv6 -- \"All CoRE Resource Directories\" address ff0x::fe, in the \"Variable Scope Multicast Addresses\" subregistry within the \"IPv6 Multicast Address Space Registry\" [RFC3307]. Note that there is a distinct multicast address for each scope that interested CoAP nodes should listen to; CoAP needs the link-local and site-local scopes only.",
      "ja": "IPv6-「すべてのコアリソースディレクトリ」アドレスFF0X :: FE、「IPv6マルチキャストアドレススペースレジストリ」[RFC3307]内の「可変スコープマルチキャストアドレス」サブレジストリ。興味のあるCOAPノードが聞く必要がある各スコープには、明確なマルチキャストアドレスがあることに注意してください。COAPには、Link-LocalおよびSite-Local Scopesのみが必要です。"
    },
    {
      "indent": 0,
      "text": "9.6. Well-Known URIs",
      "section_title": true,
      "ja": "9.6. 有名なウリス"
    },
    {
      "indent": 3,
      "text": "IANA has registered the URI suffix \"rd\" in the \"Well-Known URIs\" registry as follows:",
      "ja": "IANAは、次のように、「有名なURIS」レジストリにURIサフィックス「RD」を登録しています。"
    },
    {
      "indent": 8,
      "text": "+============+===================+===========+===========+\n| URI Suffix | Change Controller | Reference | Status    |\n+============+===================+===========+===========+\n| rd         | IETF              | RFC 9176  | permanent |\n+------------+-------------------+-----------+-----------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 14,
      "text": "Table 6: Addition to Well-Known URIs Registry",
      "ja": "表6：よく知られているURISレジストリへの追加"
    },
    {
      "indent": 0,
      "text": "9.7. Service Name and Transport Protocol Port Number Registry",
      "section_title": true,
      "ja": "9.7. サービス名と輸送プロトコルポート番号レジストリ"
    },
    {
      "indent": 3,
      "text": "IANA has added four new items to the \"Service Name and Transport Protocol Port Number Registry\" as follows:",
      "ja": "IANAは、次のように「サービス名と輸送プロトコルポート番号レジストリ」に4つの新しいアイテムを追加しました。"
    },
    {
      "indent": 6,
      "text": "+==============+===========+=====================+===========+\n| Service Name | Transport | Description         | Reference |\n|              | Protocol  |                     |           |\n+==============+===========+=====================+===========+\n| core-rd      | udp       | Resource Directory  | RFC 9176  |\n|              |           | accessed using CoAP |           |\n+--------------+-----------+---------------------+-----------+\n| core-rd-dtls | udp       | Resource Directory  | RFC 9176  |\n|              |           | accessed using CoAP |           |\n|              |           | over DTLS           |           |\n+--------------+-----------+---------------------+-----------+\n| core-rd      | tcp       | Resource Directory  | RFC 9176  |\n|              |           | accessed using CoAP |           |\n|              |           | over TCP            |           |\n+--------------+-----------+---------------------+-----------+\n| core-rd-tls  | tcp       | Resource Directory  | RFC 9176  |\n|              |           | accessed using CoAP |           |\n|              |           | over TLS            |           |\n+--------------+-----------+---------------------+-----------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 8,
      "text": "Table 7: Additions to Service Name and Transport Protocol Port Number Registry",
      "ja": "表7：サービス名と輸送プロトコルのポート番号レジストリへの追加"
    },
    {
      "indent": 0,
      "text": "10. Examples",
      "section_title": true,
      "ja": "10. 例"
    },
    {
      "indent": 3,
      "text": "Two examples are presented: a lighting installation example in Section 10.1 and a Lightweight M2M (LwM2M) example in Section 10.2.",
      "ja": "2つの例を示します。セクション10.1の照明設置例と、セクション10.2の軽量M2M（LWM2M）の例。"
    },
    {
      "indent": 0,
      "text": "10.1. Lighting Installation",
      "section_title": true,
      "ja": "10.1. 照明の設置"
    },
    {
      "indent": 3,
      "text": "This example shows a simplified lighting installation that makes use of the RD with a CoAP interface to facilitate the installation and startup of the application code in the lights and sensors. In particular, the example leads to the definition of a group and the enabling of the corresponding multicast address, as described in Appendix A. No conclusions must be drawn on the realization of actual installation or naming procedures, because the example only emphasizes some of the issues that may influence the use of the RD and does not pretend to be normative.",
      "ja": "この例は、COAPインターフェイスを備えたRDを利用して、ライトとセンサーのアプリケーションコードの設置と起動を容易にする簡略化された照明設置を示しています。特に、この例は、グループの定義と、付録Aで説明されているように、対応するマルチキャストアドレスの有効化につながります。実際のインストールまたは命名手順の実現について結論を導き出さなければなりません。RDの使用に影響を与え、規範的であるふりをしない問題。"
    },
    {
      "indent": 0,
      "text": "10.1.1. Installation Characteristics",
      "section_title": true,
      "ja": "10.1.1. インストール特性"
    },
    {
      "indent": 3,
      "text": "The example assumes that the installation is managed. That means that a Commissioning Tool (CT) is used to authorize the addition of nodes, name them, and name their services. The CT can be connected to the installation in many ways: the CT can be part of the installation network, connected by Wi-Fi to the installation network, connected via GPRS link, or connected by another method.",
      "ja": "この例は、インストールが管理されていると仮定しています。つまり、試運転ツール（CT）を使用して、ノードの追加を承認し、名前を付けて、サービスに名前を付けます。CTは多くの方法でインストールに接続できます。CTは、インストールネットワークの一部であり、Wi-Fiによってインストールネットワークに接続され、GPRSリンクを介して接続されているか、別の方法で接続できます。"
    },
    {
      "indent": 3,
      "text": "It is assumed that there are two naming authorities for the installation: (1) the network manager that is responsible for the correct operation of the network and the connected interfaces and (2) the lighting manager that is responsible for the correct functioning of networked lights and sensors. The result is the existence of two naming schemes coming from the two managing entities.",
      "ja": "インストールには2つの命名当局があると想定されています。（1）ネットワークと接続されたインターフェイスの正しい動作を担当するネットワークマネージャーと（2）ネットワークライトの正しい機能を担当する照明マネージャーおよびセンサー。その結果、2つの管理エンティティからの2つの命名スキームが存在します。"
    },
    {
      "indent": 3,
      "text": "The example installation consists of one presence sensor and two luminaries, luminary1 and luminary2, each with their own wireless interface. Each luminary contains three lamps: left, right, and middle. Each luminary is accessible through one endpoint. For each lamp, a resource exists to modify the settings of a lamp in a luminary. The purpose of the installation is that the presence sensor notifies the presence of persons to a group of lamps. The group of lamps consists of the middle and left lamps of luminary1 and the right lamp of luminary2.",
      "ja": "インストールの例は、1つの存在感センサーと2つの輝度、Luminar1とLuminar2で構成されており、それぞれ独自のワイヤレスインターフェイスを備えています。各Luminaryには、左、右、および中央の3つのランプが含まれています。各LUMINARINARは、1つのエンドポイントからアクセスできます。各ランプについて、リソースが存在し、ランプの設定を明すべてで変更します。インストールの目的は、存在感センサーがランプのグループに人の存在を通知することです。ランプのグループは、Luminar1の中央および左ランプとLuminary2の右ランプで構成されています。"
    },
    {
      "indent": 3,
      "text": "Before commissioning by the lighting manager, the network is installed, and access to the interfaces is proven to work by the network manager.",
      "ja": "照明マネージャーが試運転する前に、ネットワークがインストールされ、インターフェイスへのアクセスがネットワークマネージャーによって機能することが証明されています。"
    },
    {
      "indent": 3,
      "text": "At the moment of installation, the network under installation is not necessarily connected to the DNS infrastructure. Therefore, Stateless Address Autoconfiguration (SLAAC) IPv6 addresses are assigned to CT, RD, luminaries, and the sensor. The addresses shown in Table 8 below stand in for these in the following examples.",
      "ja": "インストールの時点で、インストール中のネットワークは必ずしもDNSインフラストラクチャに接続されているわけではありません。したがって、ステートレスアドレスAutoconfiguration（SLAAC）IPv6アドレスは、CT、RD、著名人、およびセンサーに割り当てられます。以下の表8に示すアドレスは、次の例でこれらを表しています。"
    },
    {
      "indent": 19,
      "text": "+=================+================+\n| Name            | IPv6 address   |\n+=================+================+\n| luminary1       | 2001:db8:4::1  |\n+-----------------+----------------+\n| luminary2       | 2001:db8:4::2  |\n+-----------------+----------------+\n| Presence sensor | 2001:db8:4::3  |\n+-----------------+----------------+\n| RD              | 2001:db8:4::ff |\n+-----------------+----------------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 22,
      "text": "Table 8: Addresses Used in the Examples",
      "ja": "表8：例で使用されているアドレス"
    },
    {
      "indent": 3,
      "text": "In Section 10.1.2, the use of RD during installation is presented.",
      "ja": "セクション10.1.2では、インストール中のRDの使用が提示されています。"
    },
    {
      "indent": 0,
      "text": "10.1.2. RD Entries",
      "section_title": true,
      "ja": "10.1.2. RDエントリ"
    },
    {
      "indent": 3,
      "text": "It is assumed that access to the DNS infrastructure is not always possible during installation. Therefore, the SLAAC addresses are used in this section.",
      "ja": "DNSインフラストラクチャへのアクセスは、インストール中に必ずしも可能ではないと想定されています。したがって、このセクションではSLAACアドレスが使用されます。"
    },
    {
      "indent": 3,
      "text": "For discovery, the resource types (rt) of the devices are important. The lamps in the luminaries have rt=tag:example.com,2020:light, and the presence sensor has rt=tag:example.com,2020:p-sensor. The endpoints have names that are relevant to the light installation manager. In this case, luminary1, luminary2, and the presence sensor are located in room 2-4-015, where luminary1 is located at the window and luminary2 and the presence sensor are located at the door. The endpoint names reflect this physical location. The middle, left, and right lamps are accessed via path /light/middle, /light/left, and /light/right, respectively. The identifiers relevant to the RD are shown in Table 9.",
      "ja": "発見のために、デバイスのリソースタイプ（RT）が重要です。著名人のランプにはrt = tag：example.com、2020：light、および存在感センサーにはrt = tag：example.com、2020：p-sensorがあります。エンドポイントには、Light Installation Managerに関連する名前があります。この場合、luminary1、Luminar2、および存在センサーは、窓にある部屋2-4-015にあります。Luminar1は窓にあり、Luminar2があり、存在センサーはドアにあります。エンドポイント名はこの物理的な場所を反映しています。中央、左、右のランプは、それぞれパス /ライト /ミドル、 /ライト /左、および /右 /右からアクセスできます。RDに関連する識別子を表9に示します。"
    },
    {
      "indent": 3,
      "text": "+=========+================+========+===============================+\n|Name     |Endpoint        |Resource| Resource Type                 |\n|         |                |Path    |                               |\n+=========+================+========+===============================+\n|luminary1|lm_R2-4-015_wndw|/light/ | tag:example.com,2020:light    |\n|         |                |left    |                               |\n+---------+----------------+--------+-------------------------------+\n|luminary1|lm_R2-4-015_wndw|/light/ | tag:example.com,2020:light    |\n|         |                |middle  |                               |\n+---------+----------------+--------+-------------------------------+\n|luminary1|lm_R2-4-015_wndw|/light/ | tag:example.com,2020:light    |\n|         |                |right   |                               |\n+---------+----------------+--------+-------------------------------+\n|luminary2|lm_R2-4-015_door|/light/ | tag:example.com,2020:light    |\n|         |                |left    |                               |\n+---------+----------------+--------+-------------------------------+\n|luminary2|lm_R2-4-015_door|/light/ | tag:example.com,2020:light    |\n|         |                |middle  |                               |\n+---------+----------------+--------+-------------------------------+\n|luminary2|lm_R2-4-015_door|/light/ | tag:example.com,2020:light    |\n|         |                |right   |                               |\n+---------+----------------+--------+-------------------------------+\n|Presence |ps_R2-4-015_door|/ps     | tag:example.com,2020:p-sensor |\n|sensor   |                |        |                               |\n+---------+----------------+--------+-------------------------------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 26,
      "text": "Table 9: RD Identifiers",
      "ja": "表9：RD識別子"
    },
    {
      "indent": 3,
      "text": "It is assumed that the CT has performed RD discovery and has received a response like the one in the example in Section 4.3.",
      "ja": "CTはRD発見を実行し、セクション4.3の例のような応答を受け取ったと想定されています。"
    },
    {
      "indent": 3,
      "text": "The CT inserts the endpoints of the luminaries and the sensor in the RD using the registration base URI parameter (base) to specify the interface address:",
      "ja": "CTは、登録ベースのURIパラメーター（ベース）を使用して、RDの著名人とセンサーのエンドポイントを挿入して、インターフェイスアドレスを指定します。"
    },
    {
      "indent": 3,
      "text": "Req: POST coap://[2001:db8:4::ff]/rd\n  ?ep=lm_R2-4-015_wndw&base=coap://[2001:db8:4::1]&d=R2-4-015\nPayload:\n</light/left>;rt=\"tag:example.com,2020:light\",\n</light/middle>;rt=\"tag:example.com,2020:light\",\n</light/right>;rt=\"tag:example.com,2020:light\"",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Res: 2.01 Created\nLocation-Path: /rd/4521",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Req: POST coap://[2001:db8:4::ff]/rd\n  ?ep=lm_R2-4-015_door&base=coap://[2001:db8:4::2]&d=R2-4-015\nPayload:\n</light/left>;rt=\"tag:example.com,2020:light\",\n</light/middle>;rt=\"tag:example.com,2020:light\",\n</light/right>;rt=\"tag:example.com,2020:light\"",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Res: 2.01 Created\nLocation-Path: /rd/4522",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Req: POST coap://[2001:db8:4::ff]/rd\n  ?ep=ps_R2-4-015_door&base=coap://[2001:db8:4::3]&d=R2-4-015\nPayload:\n</ps>;rt=\"tag:example.com,2020:p-sensor\"",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Res: 2.01 Created\nLocation-Path: /rd/4523",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 9,
      "text": "Figure 24: Example of Registrations a CT Enters into an RD",
      "ja": "図24：登録の例CTがRDに入る"
    },
    {
      "indent": 3,
      "text": "The sector name d=R2-4-015 has been added for an efficient lookup because filtering on the \"ep\" name is more awkward. The same sector name is communicated to the two luminaries and the presence sensor by the CT.",
      "ja": "セクター名D = R2-4-015は、「EP」名のフィルタリングがより厄介であるため、効率的な検索のために追加されました。同じセクター名が2つの著名人とCTによって存在感センサーに通信されます。"
    },
    {
      "indent": 3,
      "text": "The group is specified in the RD. The base parameter is set to the site-local multicast address allocated to the group. In the POST in the example below, the resources supported by all group members are published.",
      "ja": "グループはRDで指定されています。ベースパラメーターは、グループに割り当てられたサイトローカルマルチキャストアドレスに設定されます。以下の例の投稿では、すべてのグループメンバーがサポートするリソースが公開されています。"
    },
    {
      "indent": 3,
      "text": "Req: POST coap://[2001:db8:4::ff]/rd\n  ?ep=grp_R2-4-015&et=core.rd-group&base=coap://[ff05::1]\nPayload:\n</light/left>;rt=\"tag:example.com,2020:light\",\n</light/middle>;rt=\"tag:example.com,2020:light\",\n</light/right>;rt=\"tag:example.com,2020:light\"",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Res: 2.01 Created\nLocation-Path: /rd/501",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 7,
      "text": "Figure 25: Example of a Multicast Group a CT Enters into an RD",
      "ja": "図25：マルチキャストグループA CTの例がRDに入ります"
    },
    {
      "indent": 3,
      "text": "After the filling of the RD by the CT, the application in the luminaries can learn to which groups they belong and enable their interface for the multicast address.",
      "ja": "CTによるRDの充填後、著名人のアプリケーションは、どのグループに属しているかを学び、マルチキャストアドレスのインターフェイスを有効にすることができます。"
    },
    {
      "indent": 3,
      "text": "The luminary, knowing its sector and being configured to join any group containing lights, searches for candidate groups and joins them:",
      "ja": "そのセクターを知っており、ライトを含むグループに参加するように構成され、候補グループを検索し、それらに参加するように構成されています。"
    },
    {
      "indent": 3,
      "text": "Req: GET coap://[2001:db8:4::ff]/rd-lookup/ep\n  ?d=R2-4-015&et=core.rd-group&rt=light",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Res: 2.05 Content\nPayload:\n</rd/501>;ep=grp_R2-4-015;et=core.rd-group;\n          base=\"coap://[ff05::1]\";rt=core.rd-ep",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 10,
      "text": "Figure 26: Example of a Lookup Exchange to Find Suitable Multicast Addresses",
      "ja": "図26：適切なマルチキャストアドレスを見つけるためのルックアップ交換の例"
    },
    {
      "indent": 3,
      "text": "From the returned base parameter value, the luminary learns the multicast address of the multicast group.",
      "ja": "返されたベースパラメーター値から、Luminaryはマルチキャストグループのマルチキャストアドレスを学習します。"
    },
    {
      "indent": 3,
      "text": "The presence sensor can learn the presence of groups that support resources with rt=tag:example.com,2020:light in its own sector by sending the same request, as used by the luminary. The presence sensor learns the multicast address to use for sending messages to the luminaries.",
      "ja": "存在感センサーは、RT = tag：Example.com、2020：Light of the Luminaryが使用するのと同じリクエストを送信することにより、独自のセクターのライトを使用してリソースをサポートするグループの存在を学習できます。存在感センサーは、著名人にメッセージを送信するために使用するマルチキャストアドレスを学習します。"
    },
    {
      "indent": 0,
      "text": "10.2. OMA Lightweight M2M (LwM2M)",
      "section_title": true,
      "ja": "10.2. OMA軽量M2M（LWM2M）"
    },
    {
      "indent": 3,
      "text": "OMA LwM2M is a profile for device services based on CoAP, providing interfaces and operations for device management and device service enablement.",
      "ja": "OMA LWM2Mは、COAPに基づいたデバイスサービスのプロファイルであり、デバイス管理とデバイスサービスの有効化にインターフェイスと操作を提供します。"
    },
    {
      "indent": 3,
      "text": "An LwM2M server is an instance of an LwM2M middleware service layer, containing an RD ([LwM2M], starting at page 36).",
      "ja": "LWM2Mサーバーは、36ページから始まるRD（[LWM2M]）を含むLWM2Mミドルウェアサービスレイヤーのインスタンスです。"
    },
    {
      "indent": 3,
      "text": "That RD only implements the registration interface, and no lookup is implemented. Instead, the LwM2M server provides access to the registered resources in a similar way to a reverse proxy.",
      "ja": "そのRDは登録インターフェイスのみを実装しており、検索は実装されていません。代わりに、LWM2Mサーバーは、逆プロキシと同様の方法で登録リソースへのアクセスを提供します。"
    },
    {
      "indent": 3,
      "text": "The location of the LwM2M server and RD URI path is provided by the LwM2M bootstrap process, so no dynamic discovery of the RD is used. LwM2M servers and endpoints are not required to implement the /.well-known/core resource.",
      "ja": "LWM2MサーバーとRD URIパスの位置は、LWM2Mブートストラッププロセスによって提供されるため、RDの動的な発見は使用されません。LWM2Mサーバーとエンドポイントは、 /.well-nown /coreリソースを実装するために必要はありません。"
    },
    {
      "indent": 0,
      "text": "11. References",
      "section_title": true,
      "ja": "11. 参考文献"
    },
    {
      "indent": 0,
      "text": "11.1. Normative References",
      "section_title": true,
      "ja": "11.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <https://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119] Bradner、S。、「要件レベルを示すためにRFCで使用するためのキーワード」、BCP 14、RFC 2119、DOI 10.17487/RFC2119、1997年3月、<https://www.rfc-editor.org/info/RFC2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC3986] Berners-Lee, T., Fielding, R., and L. Masinter, \"Uniform Resource Identifier (URI): Generic Syntax\", STD 66, RFC 3986, DOI 10.17487/RFC3986, January 2005, <https://www.rfc-editor.org/info/rfc3986>.",
      "ja": "[RFC3986] Berners-Lee、T.、Fielding、R。、およびL. Masinter、「Uniform Resource Identifier（URI）：Generic Syntax」、Std 66、RFC 3986、DOI 10.17487/RFC3986、2005年1月、<https：//www.rfc-editor.org/info/rfc3986>。"
    },
    {
      "indent": 3,
      "text": "[RFC6570] Gregorio, J., Fielding, R., Hadley, M., Nottingham, M., and D. Orchard, \"URI Template\", RFC 6570, DOI 10.17487/RFC6570, March 2012, <https://www.rfc-editor.org/info/rfc6570>.",
      "ja": "[RFC6570]グレゴリオ、J。、フィールディング、R。、ハドリー、M。、ノッティンガム、M。、およびD.オーチャード、「URIテンプレート」、RFC 6570、DOI 10.17487/RFC6570、2012年3月、<https：// wwwwwwwwwwwwww.rfc-editor.org/info/rfc6570>。"
    },
    {
      "indent": 3,
      "text": "[RFC6690] Shelby, Z., \"Constrained RESTful Environments (CoRE) Link Format\", RFC 6690, DOI 10.17487/RFC6690, August 2012, <https://www.rfc-editor.org/info/rfc6690>.",
      "ja": "[RFC6690]シェルビー、Z。、「制約付き安静環境（コア）リンク形式」、RFC 6690、DOI 10.17487/RFC6690、2012年8月、<https://www.rfc-editor.org/info/rfc690>"
    },
    {
      "indent": 3,
      "text": "[RFC6763] Cheshire, S. and M. Krochmal, \"DNS-Based Service Discovery\", RFC 6763, DOI 10.17487/RFC6763, February 2013, <https://www.rfc-editor.org/info/rfc6763>.",
      "ja": "[RFC6763] Cheshire、S。およびM. Krochmal、「DNSベースのサービスディスカバリー」、RFC 6763、DOI 10.17487/RFC6763、2013年2月、<https://www.rfc-editor.org/info/rfc6763>"
    },
    {
      "indent": 3,
      "text": "[RFC7230] Fielding, R., Ed. and J. Reschke, Ed., \"Hypertext Transfer Protocol (HTTP/1.1): Message Syntax and Routing\", RFC 7230, DOI 10.17487/RFC7230, June 2014, <https://www.rfc-editor.org/info/rfc7230>.",
      "ja": "[RFC7230] Fielding、R.、ed。and J. Reschke、ed。、「HyperText Transfer Protocol（HTTP/1.1）：メッセージの構文とルーティング」、RFC 7230、DOI 10.17487/RFC7230、2014年6月、<https://www.rfc-editor.org/info/RFC7230>。"
    },
    {
      "indent": 3,
      "text": "[RFC7252] Shelby, Z., Hartke, K., and C. Bormann, \"The Constrained Application Protocol (CoAP)\", RFC 7252, DOI 10.17487/RFC7252, June 2014, <https://www.rfc-editor.org/info/rfc7252>.",
      "ja": "[RFC7252] Shelby、Z.、Hartke、K。、およびC. Bormann、「制約付きアプリケーションプロトコル（COAP）」、RFC 7252、DOI 10.17487/RFC7252、2014年6月、<https：//www.rfc-editor。org/info/rfc7252>。"
    },
    {
      "indent": 3,
      "text": "[RFC8126] Cotton, M., Leiba, B., and T. Narten, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 8126, DOI 10.17487/RFC8126, June 2017, <https://www.rfc-editor.org/info/rfc8126>.",
      "ja": "[RFC8126] Cotton、M.、Leiba、B。、およびT. Narten、「RFCSでIANA考慮事項セクションを書くためのガイドライン」、BCP 26、RFC 8126、DOI 10.17487/RFC8126、2017年6月、<https：// wwwwwwwwwwwwwwwwwwww.rfc-editor.org/info/rfc8126>。"
    },
    {
      "indent": 3,
      "text": "[RFC8174] Leiba, B., \"Ambiguity of Uppercase vs Lowercase in RFC 2119 Key Words\", BCP 14, RFC 8174, DOI 10.17487/RFC8174, May 2017, <https://www.rfc-editor.org/info/rfc8174>.",
      "ja": "[RFC8174] Leiba、B。、「RFC 2119キーワードの大文字と小文字のあいまいさ」、BCP 14、RFC 8174、DOI 10.17487/RFC8174、2017年5月、<https：//www.rfc-editor.org/info/RFC8174>。"
    },
    {
      "indent": 3,
      "text": "[RFC8288] Nottingham, M., \"Web Linking\", RFC 8288, DOI 10.17487/RFC8288, October 2017, <https://www.rfc-editor.org/info/rfc8288>.",
      "ja": "[RFC8288]ノッティンガム、M。、「Webリンク」、RFC 8288、DOI 10.17487/RFC8288、2017年10月、<https://www.rfc-editor.org/info/rfc8288>。"
    },
    {
      "indent": 3,
      "text": "[RFC9175] Amsüss, C., Preuß Mattsson, J., and G. Selander, \"Constrained Application Protocol (CoAP): Echo, Request-Tag, and Token Processing\", RFC 9175, DOI 10.17487/RFC9175, February 2022, <https://www.rfc-editor.org/info/rfc9175>.",
      "ja": "[RFC9175]Amsüss、C.、PreußMattsson、J。、およびG. Selander、「制約付きアプリケーションプロトコル（COAP）：Echo、Request-Tag、およびToken Processing」、RFC 9175、DOI 10.17487/RFC9175、2月2022年、<<<<https://www.rfc-editor.org/info/rfc9175>。"
    },
    {
      "indent": 0,
      "text": "11.2. Informative References",
      "section_title": true,
      "ja": "11.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[ACE-OAUTH-AUTHZ] Seitz, L., Selander, G., Wahlstroem, E., Erdtman, S., and H. Tschofenig, \"Authentication and Authorization for Constrained Environments (ACE) using the OAuth 2.0 Framework (ACE-OAuth)\", Work in Progress, Internet-Draft, draft-ietf-ace-oauth-authz-46, 8 November 2021, <https://datatracker.ietf.org/doc/html/draft-ietf-ace-oauth-authz-46>.",
      "ja": "[Ace-oauth-authz] Seitz、L.、Selander、G.、Wahlstroem、E.、Erdtman、S。、およびH. Tschofenig、「OAUTH 2.0フレームワークを使用した制約環境（ACE）の認証と認証（ACE）（ACE-oauth） \"、進行中の作業、インターネットドラフト、ドラフト-iitf-ace-oauth-authz-46、2021年11月8日、<https://datatracker.ietf.org/doc/html/draft-ietf-ace-oauth-authz-46>。"
    },
    {
      "indent": 3,
      "text": "[COAP-PROT-NEG] Silverajan, B. and M. Ocak, \"CoAP Protocol Negotiation\", Work in Progress, Internet-Draft, draft-silverajan-core-coap-protocol-negotiation-09, 2 July 2018, <https://datatracker.ietf.org/doc/html/draft-silverajan-core-coap-protocol-negotiation-09>.",
      "ja": "[Coap-Prot-neg] Silverajan、B。and M. Ocak、「Coap Protocol Negotiation」、Work in Progress、Internet-Draft、Draft-Silverajan-Core-Coap-Protocol-Negotiation-09、2018、<https：//datatracker.ietf.org/doc/html/draft-silverajan-core-coap-protocol-negotiation-09>。"
    },
    {
      "indent": 3,
      "text": "[CORE-CORAL] Amsüss, C. and T. Fossati, \"The Constrained RESTful Application Language (CoRAL)\", Work in Progress, Internet-Draft, draft-ietf-core-coral-05, 7 March 2022, <https://datatracker.ietf.org/doc/html/draft-ietf-core-coral-05>.",
      "ja": "[Core-coral]Amsüss、C。and T. Fossati、「The Constared Restful Application Language（Coral）」、Progress、Internet-Draft、Draft-Itef-Core-Coral-05、2022年3月7日、<HTTPS：//datatracker.ietf.org/doc/html/draft-ietf-core-coral-05>。"
    },
    {
      "indent": 3,
      "text": "[CORE-LINKS-JSON] Li, K., Rahman, A., and C. Bormann, Ed., \"Representing Constrained RESTful Environments (CoRE) Link Format in JSON and CBOR\", Work in Progress, Internet-Draft, draft-ietf-core-links-json-10, 26 February 2018, <https://datatracker.ietf.org/doc/html/draft-ietf-core-links-json-10>.",
      "ja": "[Core-Links-Json] Li、K.、Rahman、A。、およびC. Bormann、ed。、「JSONおよびCBORの制約された安らかな環境（コア）リンク形式を表す」、進行中の作業、インターネットドラフト、ドラフト-ietf-core-links-json-10、2018年2月26日、<https://datatracker.ietf.org/doc/html/draft-ietf-core-links-json-10>。"
    },
    {
      "indent": 3,
      "text": "[CORE-RD-DNS-SD] van der Stok, P., Koster, M., and C. Amsuess, \"CoRE Resource Directory: DNS-SD mapping\", Work in Progress, Internet-Draft, draft-ietf-core-rd-dns-sd-05, 7 July 2019, <https://datatracker.ietf.org/doc/html/draft-ietf-core-rd-dns-sd-05>.",
      "ja": "[core-rd-dns-sd] van der Stok、P.、Koster、M。、およびC. Amsuess、「コアリソースディレクトリ：DNS-SDマッピング」、進行中の作業、インターネットドラフト、ドラフト-ITEF-CORE-rd-dns-sd-05、2019年7月7日、<https://datatracker.ietf.org/doc/html/draft-ietf-core-rd-dns-sd-05>。"
    },
    {
      "indent": 3,
      "text": "[ER] Chen, P., \"The entity-relationship model--toward a unified view of data\", ACM Transactions on Database Systems, Vol. 1, pp. 9-36, DOI 10.1145/320434.320440, March 1976, <https://doi.org/10.1145/320434.320440>.",
      "ja": "[ER] Chen、P。、「エンティティ関連モデル - データの統一ビュー」、データベースシステムのACMトランザクション、Vol。1、pp。9-36、DOI 10.1145/320434.320440、1976年3月、<https://doi.org/10.1145/320434.320440>。"
    },
    {
      "indent": 3,
      "text": "[LwM2M] Open Mobile Alliance, \"Lightweight Machine to Machine Technical Specification: Transport Bindings (Candidate Version 1.1)\", June 2018, <https://openmobilealliance.org/RELEASE/LightweightM2M/ V1_1-20180612-C/OMA-TS-LightweightM2M_Transport-V1_1-20180612-C.pdf>.",
      "ja": "[LWM2M]オープンモバイルアライアンス、「機械技術仕様への軽量マシン：輸送バインディング（候補バージョン1.1）」、2018年6月、<https://openmobilealliance.org/Release/LightWeightM2M/ V1_1-20180612-C/OMA-TS-LightWeightM2M_TRANSPORT-V1_1-20180612-C.PDF>。"
    },
    {
      "indent": 3,
      "text": "[RFC3306] Haberman, B. and D. Thaler, \"Unicast-Prefix-based IPv6 Multicast Addresses\", RFC 3306, DOI 10.17487/RFC3306, August 2002, <https://www.rfc-editor.org/info/rfc3306>.",
      "ja": "[RFC3306] Haberman、B。and D. Thaler、「Unicast-PrefixベースのIPv6マルチキャストアドレス」、RFC 3306、DOI 10.17487/RFC3306、2002年8月、<https://www.rfc-editor.org/info/RFC33066>。"
    },
    {
      "indent": 3,
      "text": "[RFC3307] Haberman, B., \"Allocation Guidelines for IPv6 Multicast Addresses\", RFC 3307, DOI 10.17487/RFC3307, August 2002, <https://www.rfc-editor.org/info/rfc3307>.",
      "ja": "[RFC3307] Haberman、B。、「IPv6マルチキャストアドレスの割り当てガイドライン」、RFC 3307、DOI 10.17487/RFC3307、2002年8月、<https://www.rfc-editor.org/info/rfc3307>。"
    },
    {
      "indent": 3,
      "text": "[RFC3849] Huston, G., Lord, A., and P. Smith, \"IPv6 Address Prefix Reserved for Documentation\", RFC 3849, DOI 10.17487/RFC3849, July 2004, <https://www.rfc-editor.org/info/rfc3849>.",
      "ja": "[RFC3849] Huston、G.、Lord、A。、およびP. Smith、「IPv6アドレスはドキュメント用に予約されている」、RFC 3849、DOI 10.17487/RFC3849、2004年7月、<https://www.rfc-editor.org/info/rfc3849>。"
    },
    {
      "indent": 3,
      "text": "[RFC4122] Leach, P., Mealling, M., and R. Salz, \"A Universally Unique IDentifier (UUID) URN Namespace\", RFC 4122, DOI 10.17487/RFC4122, July 2005, <https://www.rfc-editor.org/info/rfc4122>.",
      "ja": "[RFC4122] Leach、P.、Mealling、M.、およびR. Salz、「普遍的にユニークな識別子（UUID）URNネームスペース」、RFC 4122、DOI 10.17487/RFC4122、2005年7月、<https：//www.rfc-editor.org/info/rfc4122>。"
    },
    {
      "indent": 3,
      "text": "[RFC4944] Montenegro, G., Kushalnagar, N., Hui, J., and D. Culler, \"Transmission of IPv6 Packets over IEEE 802.15.4 Networks\", RFC 4944, DOI 10.17487/RFC4944, September 2007, <https://www.rfc-editor.org/info/rfc4944>.",
      "ja": "[RFC4944] Montenegro、G.、Kushalnagar、N.、Hui、J。、およびD. Culler、「IEEE 802.15.4ネットワークを介したIPv6パケットの送信」、RFC 4944、DOI 10.17487/RFC4944、2007年9月、<HTPS：//www.rfc-editor.org/info/rfc4944>。"
    },
    {
      "indent": 3,
      "text": "[RFC5771] Cotton, M., Vegoda, L., and D. Meyer, \"IANA Guidelines for IPv4 Multicast Address Assignments\", BCP 51, RFC 5771, DOI 10.17487/RFC5771, March 2010, <https://www.rfc-editor.org/info/rfc5771>.",
      "ja": "[RFC5771] Cotton、M.、Vegoda、L。、およびD. Meyer、「IPv4マルチキャストアドレス割り当てのIANAガイドライン」、BCP 51、RFC 5771、DOI 10.17487/RFC5771、2010年3月、<https：//www.rfc-editor.org/info/rfc5771>。"
    },
    {
      "indent": 3,
      "text": "[RFC6724] Thaler, D., Ed., Draves, R., Matsumoto, A., and T. Chown, \"Default Address Selection for Internet Protocol Version 6 (IPv6)\", RFC 6724, DOI 10.17487/RFC6724, September 2012, <https://www.rfc-editor.org/info/rfc6724>.",
      "ja": "[RFC6724] Thaler、D.、Ed。、ed。、Draves、R.、Matsumoto、A。、およびT. Chown、「インターネットプロトコルバージョン6（IPv6）のデフォルトアドレス選択」、RFC 6724、DOI 10.17487/RFC6724、2012年9月、<https://www.rfc-editor.org/info/rfc6724>。"
    },
    {
      "indent": 3,
      "text": "[RFC6775] Shelby, Z., Ed., Chakrabarti, S., Nordmark, E., and C. Bormann, \"Neighbor Discovery Optimization for IPv6 over Low-Power Wireless Personal Area Networks (6LoWPANs)\", RFC 6775, DOI 10.17487/RFC6775, November 2012, <https://www.rfc-editor.org/info/rfc6775>.",
      "ja": "[RFC6775] Shelby、Z.、Ed。、Chakrabarti、S.、Nordmark、E。、およびC. Bormann、「低電力ワイヤレスパーソナルエリアネットワーク（6lowpans）を超えるIPv6の近隣発見最適化」、RFC 6775、DOI 10.17487/RFC6775、2012年11月、<https://www.rfc-editor.org/info/rfc6775>。"
    },
    {
      "indent": 3,
      "text": "[RFC6874] Carpenter, B., Cheshire, S., and R. Hinden, \"Representing IPv6 Zone Identifiers in Address Literals and Uniform Resource Identifiers\", RFC 6874, DOI 10.17487/RFC6874, February 2013, <https://www.rfc-editor.org/info/rfc6874>.",
      "ja": "[RFC6874] Carpenter、B.、Cheshire、S。、およびR. Hinden、「住所リテラルおよび均一なリソース識別子のIPv6ゾーン識別子を表す」、RFC 6874、DOI 10.17487/RFC6874、2013年2月、<https：// www。rfc-editor.org/info/rfc6874>。"
    },
    {
      "indent": 3,
      "text": "[RFC7228] Bormann, C., Ersue, M., and A. Keranen, \"Terminology for Constrained-Node Networks\", RFC 7228, DOI 10.17487/RFC7228, May 2014, <https://www.rfc-editor.org/info/rfc7228>.",
      "ja": "[RFC7228] Bormann、C.、Ersue、M。、およびA. Keranen、「制約ノードネットワークの用語」、RFC 7228、DOI 10.17487/RFC7228、2014年5月、<https://www.rfc-editor.org/info/rfc7228>。"
    },
    {
      "indent": 3,
      "text": "[RFC7641] Hartke, K., \"Observing Resources in the Constrained Application Protocol (CoAP)\", RFC 7641, DOI 10.17487/RFC7641, September 2015, <https://www.rfc-editor.org/info/rfc7641>.",
      "ja": "[RFC7641] Hartke、K。、「制約付きアプリケーションプロトコル（COAP）のリソースの観察」、RFC 7641、DOI 10.17487/RFC7641、2015年9月、<https://www.rfc-editor.org/info/rfc7641>。"
    },
    {
      "indent": 3,
      "text": "[RFC8106] Jeong, J., Park, S., Beloeil, L., and S. Madanapalli, \"IPv6 Router Advertisement Options for DNS Configuration\", RFC 8106, DOI 10.17487/RFC8106, March 2017, <https://www.rfc-editor.org/info/rfc8106>.",
      "ja": "[RFC8106] Jeong、J.、Park、S.、Beloeil、L。、およびS. Madanapalli、「DNS構成のIPv6ルーター広告オプション」、RFC 8106、DOI 10.17487/RFC8106、2017年3月、<https：//.rfc-editor.org/info/rfc8106>。"
    },
    {
      "indent": 3,
      "text": "[RFC8132] van der Stok, P., Bormann, C., and A. Sehgal, \"PATCH and FETCH Methods for the Constrained Application Protocol (CoAP)\", RFC 8132, DOI 10.17487/RFC8132, April 2017, <https://www.rfc-editor.org/info/rfc8132>.",
      "ja": "[RFC8132] van der Stok、P.、Bormann、C。、およびA. Sehgal、「制約付きアプリケーションプロトコル（COAP）のパッチおよびフェッチ方法」、RFC 8132、DOI 10.17487/RFC8132、2017年4月、<https：/<https：//www.rfc-editor.org/info/rfc8132>。"
    },
    {
      "indent": 3,
      "text": "[RFC8141] Saint-Andre, P. and J. Klensin, \"Uniform Resource Names (URNs)\", RFC 8141, DOI 10.17487/RFC8141, April 2017, <https://www.rfc-editor.org/info/rfc8141>.",
      "ja": "[RFC8141] Saint-Andre、P。and J. Klensin、「Uniform Resource名（URNS）」、RFC 8141、DOI 10.17487/RFC8141、2017年4月、<https://www.rfc-editor.org/info/rfc8141141>。"
    },
    {
      "indent": 3,
      "text": "[RFC8613] Selander, G., Mattsson, J., Palombini, F., and L. Seitz, \"Object Security for Constrained RESTful Environments (OSCORE)\", RFC 8613, DOI 10.17487/RFC8613, July 2019, <https://www.rfc-editor.org/info/rfc8613>.",
      "ja": "[RFC8613] Selander、G.、Mattsson、J.、Palombini、F.、およびL. Seitz、「制約された安らかな環境のオブジェクトセキュリティ（OSCORE）」、RFC 8613、DOI 10.17487/RFC8613、2019年7月、<HTTPS：//www.rfc-editor.org/info/rfc8613>。"
    },
    {
      "indent": 3,
      "text": "[T2TRG-REL-IMPL] Bormann, C., \"impl-info: A link relation type for disclosing implementation information\", Work in Progress, Internet-Draft, draft-bormann-t2trg-rel-impl-02, 27 September 2020, <https://datatracker.ietf.org/doc/html/ draft-bormann-t2trg-rel-impl-02>.",
      "ja": "[T2TRG-REL-IMPL] Bormann、C。、「Impl-info：実装情報を開示するためのリンク関係タイプ」、進行中の作業、インターネットドラフト、ドラフトボルマン-T2TRG-REL-IMPL-02、2020年9月27日、<https://datatracker.ietf.org/doc/html/ draft-bormann-t2trg-rel-impl-02>。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Groups Registration and Lookup",
      "section_title": true,
      "ja": "付録A.グループ登録と検索"
    },
    {
      "indent": 3,
      "text": "The RD-Group's usage pattern allows announcing application groups inside an RD.",
      "ja": "RDグループの使用パターンにより、RD内のアプリケーショングループを発表できます。"
    },
    {
      "indent": 3,
      "text": "Groups are represented by endpoint registrations. Their base address is a multicast address, and they SHOULD be entered with the endpoint type core.rd-group. The endpoint name can also be referred to as a group name in this context.",
      "ja": "グループはエンドポイント登録で表されます。彼らのベースアドレスはマルチキャストアドレスであり、エンドポイントタイプのcore.rd-groupで入力する必要があります。エンドポイント名は、このコンテキストではグループ名とも呼ばれます。"
    },
    {
      "indent": 3,
      "text": "The registration is inserted into the RD by a Commissioning Tool, which might also be known as a group manager here. It performs third-party registration and registration updates.",
      "ja": "登録は、ここでグループマネージャーとしても知られている可能性のある試運転ツールによってRDに挿入されます。サードパーティの登録と登録の更新を実行します。"
    },
    {
      "indent": 3,
      "text": "The links it registers SHOULD be available on all members that join the group. Depending on the application, members that lack some resources MAY be permissible if requests to them fail gracefully.",
      "ja": "Registersのリンクは、グループに参加するすべてのメンバーで利用できるようにする必要があります。アプリケーションに応じて、リソースをリクエストする場合、いくつかのリソースが不足しているメンバーは、優雅に失敗した場合に許容される場合があります。"
    },
    {
      "indent": 3,
      "text": "The following example shows a CT registering a group with the name \"lights\", which provides two resources. The directory resource path /rd is an example RD location discovered in a request similar to Figure 5. The group address in the example is constructed from the reserved 2001:db8:: prefix in [RFC3849] as a unicast-prefix-based site-local address (see [RFC3306]).",
      "ja": "次の例は、2つのリソースを提供する「Lights」という名前のグループを登録するCTを示しています。ディレクトリリソースパス /RDは、図5と同様のリクエストで発見されたRDの例です。例のグループアドレスは、2001年に予約された2001年から構築されています。ローカルアドレス（[RFC3306]を参照）。"
    },
    {
      "indent": 3,
      "text": "Req: POST coap://rd.example.com/rd?ep=lights&et=core.rd-group\n                           &base=coap://[ff35:30:2001:db8:f1::8000:1]\nContent-Format: 40\nPayload:\n</light>;rt=\"tag:example.com,2020:light\";\n     if=\"tag:example.net,2020:actuator\",\n</color-temperature>;if=\"tag:example.net,2020:parameter\";u=K",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Res: 2.01 Created\nLocation-Path: /rd/12",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 17,
      "text": "Figure 27: Example Registration of a Group",
      "ja": "図27：グループの登録の例"
    },
    {
      "indent": 3,
      "text": "In this example, the group manager can easily permit devices that have no writable color-temperature to join, as they would still respond to brightness-changing commands. Had the group instead contained a single resource that sets brightness and color-temperature atomically, endpoints would need to support both properties.",
      "ja": "この例では、グループマネージャーは、輝度を変えるコマンドに応答するため、書き込み可能な色温度のないデバイスを簡単に許可できます。代わりに、グループに明るさと色温度を原子的に設定する単一のリソースが含まれていた場合、エンドポイントは両方のプロパティをサポートする必要があります。"
    },
    {
      "indent": 3,
      "text": "The resources of a group can be looked up like any other resource, and the group registrations (along with any additional registration parameters) can be looked up using the endpoint lookup interface.",
      "ja": "グループのリソースは他のリソースと同様に調べることができ、グループ登録は（追加の登録パラメーターとともに）エンドポイントルックアップインターフェイスを使用して調べることができます。"
    },
    {
      "indent": 3,
      "text": "The following example shows a client performing an endpoint lookup for all groups:",
      "ja": "次の例は、すべてのグループのエンドポイントルックアップを実行するクライアントを示しています。"
    },
    {
      "indent": 3,
      "text": "Req: GET /rd-lookup/ep?et=core.rd-group",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Res: 2.05 Content\nPayload:\n</rd/12>;ep=lights&et=core.rd-group;\n         base=\"coap://[ff35:30:2001:f1:db8::8000:1]\";rt=core.rd-ep",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 20,
      "text": "Figure 28: Example Lookup of Groups",
      "ja": "図28：グループの例の検索"
    },
    {
      "indent": 3,
      "text": "The following example shows a client performing a lookup of all resources of all endpoints (groups) with et=core.rd-group:",
      "ja": "次の例は、ET = Core.RD-Groupを使用して、すべてのエンドポイント（グループ）のすべてのリソースのルックアップを実行するクライアントを示しています。"
    },
    {
      "indent": 3,
      "text": "Req: GET /rd-lookup/res?et=core.rd-group",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Res: 2.05 Content\nPayload:\n<coap://[ff35:30:2001:db8:f1::8000:1]/light>;\n     rt=\"tag:example.com,2020:light\";\n     if=\"tag:example.net,2020:actuator\",\n<coap://[ff35:30:2001:db8:f1::8000:1]/color-temperature>;\n     if=\"tag:example.net,2020:parameter\";u=K,",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 12,
      "text": "Figure 29: Example Lookup of Resources Inside Groups",
      "ja": "図29：グループ内のリソースの例の例"
    },
    {
      "indent": 0,
      "text": "Appendix B. Web Links and the Resource Directory",
      "section_title": true,
      "ja": "付録B. Webリンクとリソースディレクトリ"
    },
    {
      "indent": 3,
      "text": "Understanding the semantics of a link-format document and its URI references is a journey through different documents ([RFC3986] defining URIs, [RFC6690] defining link-format documents based on [RFC8288], which defines Link header fields, and [RFC7252] providing the transport). This appendix summarizes the mechanisms and semantics at play from an entry in /.well-known/core to a resource lookup.",
      "ja": "リンクフォーマットドキュメントとそのURI参照のセマンティクスを理解することは、さまざまなドキュメントを通る旅です（[RFC3986] URIS、[RFC6690]リンクヘッダーフィールドを定義する[RFC8288]に基づくリンク形式ドキュメントを定義し、[RFC72522]を定義する[RFC7252]輸送を提供する）。この付録は、 /.well-known /coreのエントリからリソースルックアップまでのメカニズムとセマンティクスを要約しています。"
    },
    {
      "indent": 3,
      "text": "This text is primarily aimed at people entering the field of Constrained Restful Environments from applications that previously did not use web mechanisms.",
      "ja": "このテキストは、主に、以前はWebメカニズムを使用していなかったアプリケーションから制約された安らかな環境の分野に入る人々を対象としています。"
    },
    {
      "indent": 0,
      "text": "B.1. A Simple Example",
      "section_title": true,
      "ja": "B.1. 簡単な例"
    },
    {
      "indent": 3,
      "text": "Let's start this example with a very simple host, 2001:db8:f0::1. A client that follows classical CoAP discovery ([RFC7252], Section 7) sends the following multicast request to learn about neighbors supporting resources with resource-type \"temperature\".",
      "ja": "この例を非常にシンプルなホスト、2001：db8：f0 :: 1から始めましょう。古典的なCOAPディスカバリー（[RFC7252]、セクション7）に続くクライアントは、次のマルチキャストリクエストを送信して、リソースタイプの「温度」でリソースをサポートする隣人について学習します。"
    },
    {
      "indent": 3,
      "text": "The client sends a link-local multicast:",
      "ja": "クライアントはリンクローカルマルチキャストを送信します："
    },
    {
      "indent": 3,
      "text": "Req: GET coap://[ff02::fd]:5683/.well-known/core?rt=temperature",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Res: 2.05 Content\nPayload:\n</sensors/temp>;rt=temperature;ct=0",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 14,
      "text": "Figure 30: Example of Direct Resource Discovery",
      "ja": "図30：直接的なリソース発見の例"
    },
    {
      "indent": 3,
      "text": "where the response is sent by the server, [2001:db8:f0::1]:5683.",
      "ja": "応答がサーバーによって送信される場所[2001：DB8：F0 :: 1]：5683。"
    },
    {
      "indent": 3,
      "text": "While a practical client side implementation might just go ahead and create a new request to [2001:db8:f0::1]:5683 with Uri-Path sensors and temp, the full resolution steps for insertion into and retrieval from the RD without any shortcuts are as follows.",
      "ja": "実際のクライアント側の実装が先に進み、[2001：DB8：F0 :: 1]への新しいリクエストを作成するかもしれませんが、URI-PATHセンサーと温度を使用して、RDへの挿入と検索の完全な解像度の手順は、ショートカットは次のとおりです。"
    },
    {
      "indent": 0,
      "text": "B.1.1. Resolving the URIs",
      "section_title": true,
      "ja": "B.1.1. URIの解決"
    },
    {
      "indent": 3,
      "text": "The client parses the single returned link. Its target (sometimes called \"href\") is /sensors/temp, which is a relative URI that needs resolving. The base URI coap://[ff02::fd]:5683/.well-known/core is used to resolve the reference against /sensors/temp.",
      "ja": "クライアントは、シングルリンクリンクを解析します。そのターゲット（「HREF」と呼ばれることもあります）は /センサー /温度であり、解決が必要な相対的なURIです。ベースURI COAP：// [FF02 :: FD]：5683/.Well-known/Coreは、/センサー/温度に対する参照を解決するために使用されます。"
    },
    {
      "indent": 3,
      "text": "The base URI of the requested resource can be composed from the options of the CoAP GET request by following the steps of [RFC7252], Section 6.5 (with an addition at the end of Section 8.2) into coap://[2001:db8:f0::1]/.well-known/core.",
      "ja": "要求されたリソースのベースURIは、[RFC7252]の手順に従って、セクション6.5（セクション8.2の終わりに追加）の手順に従って、COAP GETリクエストのオプションから構成できます：// [2001：DB8：f0 :: 1]/。有名/コア。"
    },
    {
      "indent": 3,
      "text": "Because /sensors/temp starts with a single slash, the link's target is resolved by replacing the path /.well-known/core from the base URI ([RFC3986], Section 5.2) with the relative target URI /sensors/temp into coap://[2001:db8:f0::1]/sensors/temp.",
      "ja": "/センサー /温度は単一のスラッシュで始まるため、リンクのターゲットは、ベースURI（[RFC3986]、セクション5.2）のパス /.Well-NownS/Coreを相対ターゲットURI /センサー /TEMPからCOAPに置き換えることで解決されます。：// [2001：db8：f0 :: 1]/センサー/温度。"
    },
    {
      "indent": 0,
      "text": "B.1.2. Interpreting Attributes and Relations",
      "section_title": true,
      "ja": "B.1.2. 属性と関係の解釈"
    },
    {
      "indent": 3,
      "text": "Some more information about the link's target can be obtained from the payload: the resource type of the target is \"temperature\", and its content format is text/plain (ct=0).",
      "ja": "リンクのターゲットに関するいくつかの情報は、ペイロードから取得できます。ターゲットのリソースタイプは「温度」であり、そのコンテンツ形式はテキスト/プレーン（CT = 0）です。"
    },
    {
      "indent": 3,
      "text": "A relation in a web link is a three-part statement that specifies a named relation between the so-called \"context resource\" and the target resource, like \"_This page_ has _its table of contents_ at _/ toc.html_\". In link-format documents, there is an implicit \"host relation\" specified with default parameter rel=\"hosts\".",
      "ja": "Webリンクの関係は、いわゆる「コンテキストリソース」とターゲットリソースの間の名前付き関係を指定する3部構成のステートメントです。リンク形式のドキュメントには、デフォルトのパラメーターrel = \"hosts\"で指定された暗黙の「ホスト関係」があります。"
    },
    {
      "indent": 3,
      "text": "In our example, the context resource of the link is implied to be coap:://[2001:db8:f0::1] by the default value of the anchor (see Appendix B.4). A full English expression of the \"host relation\" is:",
      "ja": "この例では、リンクのコンテキストリソースは、アンカーのデフォルト値によってCOAP :: // [2001：DB8：F0 :: 1]であることを暗示しています（付録B.4を参照）。「ホスト関係」の完全な英語の表現は次のとおりです。"
    },
    {
      "indent": 6,
      "text": "coap://[2001:db8:f0::1] is hosting the resource coap://[2001:db8:f0::1]/sensors/temp, which is of the resource type \"temperature\" and can be read in the text/plain content format.",
      "ja": "coap：// [2001：db8：f0 :: 1]はリソースをホストしていますcoap：// [2001：db8：f0 :: 1]/センサー/温度は、リソースタイプの「温度」であり、読むことができますテキスト/プレーンコンテンツ形式。"
    },
    {
      "indent": 0,
      "text": "B.2. A Slightly More Complex Example",
      "section_title": true,
      "ja": "B.2. 少し複雑な例"
    },
    {
      "indent": 3,
      "text": "Omitting the rt=temperature filter, the discovery query would have given some more links in the payload:",
      "ja": "RT =温度フィルターを省略すると、ディスカバリークエリはペイロードにさらにいくつかのリンクが与えられます。"
    },
    {
      "indent": 3,
      "text": "Req: GET coap://[ff02::fd]:5683/.well-known/core",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Res: 2.05 Content\nPayload:\n</sensors/temp>;rt=temperature;ct=0,\n</sensors/light>;rt=light-lux;ct=0,\n</t>;anchor=\"/sensors/temp\";rel=alternate,\n<http://www.example.com/sensors/t123>;anchor=\"/sensors/temp\";\n    rel=describedby",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 10,
      "text": "Figure 31: Extended Example of Direct Resource Discovery",
      "ja": "図31：直接的なリソース発見の拡張例"
    },
    {
      "indent": 3,
      "text": "Parsing the third link, the client encounters the \"anchor\" parameter. It is a URI relative to the base URI of the request and is thus resolved to coap://[2001:db8:f0::1]/sensors/temp. That is the context resource of the link, so the \"rel\" statement is not about the target and the base URI any more but about the target and the resolved URI. Thus, the third link could be read as:",
      "ja": "3番目のリンクを解析すると、クライアントは「アンカー」パラメーターに遭遇します。これは、リクエストのベースURIに対するURIであるため、Coap：// [2001：db8：f0 :: 1]/センサー/温度に解決されます。これがリンクのコンテキストリソースであるため、「Rel」ステートメントは、ターゲットとベースURIに関するものではなく、ターゲットと解決されたURIに関するものではありません。したがって、3番目のリンクは次のように読み取ることができます。"
    },
    {
      "indent": 6,
      "text": "coap://[2001:db8:f0::1]/sensors/temp has an alternate representation at coap://[2001:db8:f0::1]/t.",
      "ja": "coap：// [2001：db8：f0 :: 1]/センサー/温度には、coap：// [2001：db8：f0 :: 1]/tで代替表現があります。"
    },
    {
      "indent": 3,
      "text": "Following the same resolution steps, the fourth link can be read as coap://[2001:db8:f0::1]/sensors/temp is described by http://www.example.com/sensors/t123.",
      "ja": "同じ解像度の手順に続いて、4番目のリンクはcoap：// [2001：db8：f0：1]/センサー/温度として読み取ることができます。http://www.example.com/sensors/t123"
    },
    {
      "indent": 0,
      "text": "B.3. Enter the Resource Directory",
      "section_title": true,
      "ja": "B.3. リソースディレクトリを入力します"
    },
    {
      "indent": 3,
      "text": "The RD tries to carry the semantics obtainable by classical CoAP discovery over to the resource lookup interface as faithfully as possible.",
      "ja": "RDは、クラシックコップディスカバリーによって得られるセマンティクスを、可能な限り忠実にリソースルックアップインターフェイスに持ち込むことを試みます。"
    },
    {
      "indent": 3,
      "text": "For the following queries, we will assume that the simple host has used simple registration to register at the RD that was announced to it, sending this request from its UDP port [2001:db8:f0::1]:6553:",
      "ja": "次のクエリでは、Simple HostがSimple登録を使用して発表されたRDに登録し、UDPポート[2001：DB8：F0 :: 1]：6553からこのリクエストを送信したと仮定します。"
    },
    {
      "indent": 3,
      "text": "Req: POST coap://[2001:db8:f0::ff]/.well-known/rd?ep=simple-host1",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Res: 2.04 Changed",
      "ja": "Res：2.04が変更されました"
    },
    {
      "indent": 16,
      "text": "Figure 32: Example of a Simple Registration",
      "ja": "図32：簡単な登録の例"
    },
    {
      "indent": 3,
      "text": "The RD would have accepted the registration and queried the simple host's /.well-known/core by itself. As a result, the host is registered as an endpoint in the RD with the name \"simple-host1\". The registration is active for 90000 seconds, and the endpoint registration base URI is coap://[2001:db8:f0::1], following the resolution steps described in Appendix B.1.1. It should be remarked that the base URI constructed that way always yields a URI of the form scheme://authority without path suffix.",
      "ja": "RDは登録を受け入れ、シンプルなホストの /.Well-known/Coreを単独で照会しました。その結果、ホストは「Simple-Host1」という名前のRDのエンドポイントとして登録されます。登録は90000秒間アクティブであり、エンドポイント登録ベースのURIはCOAP：// [2001：db8：f0 :: 1]であり、付録B.1.1で説明されている解決手順に従います。そのように構築されたベースのURIは、常にフォームのscheme：// authorityの接尾辞のないuriを生成することに注意する必要があります。"
    },
    {
      "indent": 3,
      "text": "If the client now queries the RD as it would previously have issued a multicast request, it would go through the RD discovery steps by fetching coap://[2001:db8:f0::ff]/.well-known/core?rt=core.rd-lookup-res, obtain coap://[2001:db8:f0::ff]/rd-lookup/res as the resource lookup endpoint, and ask it for all temperature resources:",
      "ja": "クライアントが以前にマルチキャストリクエストを発行したようにRDを照会した場合、coap：// [2001：db8：f0 :: ff]/.well-nown/core?rtを取得することにより、RDディスカバリーステップを通過します。= core.rd-lookup-res、coap：// [2001：db8：f0 :: ff]/rd-lookup/resをリソースルックアップエンドポイントとして取得し、すべての温度リソースを尋ねます。"
    },
    {
      "indent": 3,
      "text": "Req: GET coap://[2001:db8:f0::ff]/rd-lookup/res?rt=temperature",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Res: 2.05 Content\nPayload:\n<coap://[2001:db8:f0::1]/sensors/temp>;rt=temperature;ct=0",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 11,
      "text": "Figure 33: Example Exchange Performing Resource Lookup",
      "ja": "図33：リソース検索を実行するExchange Exchange"
    },
    {
      "indent": 3,
      "text": "This is not _literally_ the same response that it would have received from a multicast request, but it contains the equivalent statement:",
      "ja": "これは、マルチキャストリクエストから受け取ったのと同じ応答ではありませんが、同等のステートメントが含まれています。"
    },
    {
      "indent": 6,
      "text": "coap://[2001:db8:f0::1] is hosting the resource coap://[2001:db8:f0::1]/sensors/temp, which is of the resource type \"temperature\" and can be accessed using the text/plain content format.",
      "ja": "coap：// [2001：db8：f0 :: 1]はリソースをホストしていますcoap：// [2001：db8：f0 :: 1]/センサー/温度は、リソースタイプの「温度」であり、アクセスできますテキスト/プレーンコンテンツ形式を使用します。"
    },
    {
      "indent": 3,
      "text": "To complete the examples, the client could also query all resources hosted at the endpoint with the known endpoint name \"simple-host1\":",
      "ja": "例を完了するために、クライアントは、既知のエンドポイント名「Simple-Host1」でエンドポイントでホストされているすべてのリソースを照会することもできます。"
    },
    {
      "indent": 3,
      "text": "Req: GET coap://[2001:db8:f0::ff]/rd-lookup/res?ep=simple-host1",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Res: 2.05 Content\nPayload:\n<coap://[2001:db8:f0::1]/sensors/temp>;rt=temperature;ct=0,\n<coap://[2001:db8:f0::1]/sensors/light>;rt=light-lux;ct=0,\n<coap://[2001:db8:f0::1]/t>;\n    anchor=\"coap://[2001:db8:f0::1]/sensors/temp\";rel=alternate,\n<http://www.example.com/sensors/t123>;\n    anchor=\"coap://[2001:db8:f0::1]/sensors/temp\";rel=describedby",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "Figure 34: Extended Example Exchange Performing Resource Lookup",
      "ja": "図34：リソースルックアップを実行する拡張例交換の例"
    },
    {
      "indent": 3,
      "text": "All the target and anchor references are already in absolute form there, which don't need to be resolved any further.",
      "ja": "すべてのターゲットとアンカーの参照はすでに絶対的な形であり、これ以上解決する必要はありません。"
    },
    {
      "indent": 3,
      "text": "Had the simple host done an equivalent full registration with a base= parameter (e.g., ?ep=simple-host1&base=coap+tcp://sh1.example.com), that context would have been used to resolve the relative anchor values instead, giving the following and analogous links:",
      "ja": "Simple HostがBase = Parameter（例えば、？ep = simple-host1＆base = coap tcp：//sh1.example.com）で同等の完全な登録を行った場合、そのコンテキストは代わりに相対アンカー値を解決するために使用されていました。次のリンクと類似のリンクを与える："
    },
    {
      "indent": 3,
      "text": "<coap+tcp://sh1.example.com/sensors/temp>;rt=temperature;ct=0",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 7,
      "text": "Figure 35: Example Payload of a Response to a Resource Lookup with a Dedicated Base URI",
      "ja": "図35：専用ベースURIを使用したリソースルックアップへの応答のペイロードの例"
    },
    {
      "indent": 0,
      "text": "B.4. A Note on Differences between Link-Format and Link Header Fields",
      "section_title": true,
      "ja": "B.4. リンクフォーマットとリンクヘッダーフィールドの違いに関するメモ"
    },
    {
      "indent": 3,
      "text": "While link-format and Link header fields look very similar and are based on the same model of typed links, there are some differences between [RFC6690] and [RFC8288]. When implementing an RD or interacting with an RD, care must be taken to follow the behavior described in [RFC6690] whenever application/link-format representations are used.",
      "ja": "リンクフォーマットとリンクヘッダーフィールドは非常によく似ており、タイプされたリンクの同じモデルに基づいていますが、[RFC6690]と[RFC8288]の間にはいくつかの違いがあります。RDを実装したり、RDと対話する場合、アプリケーション/リンク形式の表現が使用されるたびに[RFC6690]に記載されている動作に従うように注意する必要があります。"
    },
    {
      "indent": 3,
      "text": "* \"Default value of anchor\": Under both [RFC6690] and [RFC8288], relative references in the term inside the angle brackets (the target) and the anchor attribute are resolved against the relevant base URI (which usually is the URI used to retrieve the entity) and independent of each other.",
      "ja": "* 「アンカーのデフォルト値」：[RFC6690]と[RFC8288]の両方で、角度ブラケット（ターゲット）内の用語の相対的な参照とアンカー属性は、関連するベースURIに対して解決されます（通常、これはURIです。エンティティ）および互いに独立しています。"
    },
    {
      "indent": 6,
      "text": "When, in a Link header [RFC8288], the anchor attribute is absent, the link's context is the URI of the selected representation (and usually equal to the base URI).",
      "ja": "リンクヘッダー[RFC8288]で、アンカー属性が存在しない場合、リンクのコンテキストは選択された表現のURIです（通常はベースURIに等しい）。"
    },
    {
      "indent": 6,
      "text": "In links per [RFC6690], if the anchor attribute is absent, the default value is the Origin of (for all relevant cases, the URI reference / resolved against) the link's target.",
      "ja": "[RFC6690]あたりのリンクでは、アンカー属性が存在しない場合、デフォルト値は（関連するすべての場合、URI参照 /解決）の原点です。"
    },
    {
      "indent": 3,
      "text": "* There is no percent encoding in link-format documents.",
      "ja": "* リンクフォーマットドキュメントにエンコードパーセントはありません。"
    },
    {
      "indent": 6,
      "text": "A link-format document is a UTF-8-encoded string of Unicode characters and does not have percent encoding, while Link header fields are practically ASCII strings that use percent encoding for non-ASCII characters, stating the encoding explicitly when required.",
      "ja": "リンク形式のドキュメントはUTF-8エンコードのユニコード文字の文字列であり、エンコードパーセントはありませんが、リンクヘッダーフィールドは、必要に応じて明示的にエンコードを記載している非ASCII文字にエンコードパーセントを使用するASCII文字列です。"
    },
    {
      "indent": 6,
      "text": "For example, while a Link header field in a page about a Swedish city might read:",
      "ja": "たとえば、スウェーデンの都市に関するページのリンクヘッダーフィールドは、次のことを読むかもしれませんが、"
    },
    {
      "indent": 6,
      "text": "Link: </temperature/Malm%C3%B6>;rel=live-environment-data",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "a link-format document from the same source might describe the link as:",
      "ja": "同じソースからのリンク形式のドキュメントは、リンクを次のように説明する場合があります。"
    },
    {
      "indent": 6,
      "text": "</temperature/Malmö>;rel=live-environment-data",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Appendix C. Limited Link Format",
      "section_title": true,
      "ja": "付録C.限定リンク形式"
    },
    {
      "indent": 3,
      "text": "The CoRE Link Format, as described in [RFC6690], has been interpreted differently by implementers, and a strict implementation rules out some use cases of an RD (e.g., base values with path components in combination with absent anchors).",
      "ja": "[RFC6690]で説明されているコアリンク形式は、実装者によって異なる方法で解釈されており、厳密な実装はRDの一部のユースケースを除外します（たとえば、アンカーがないと組み合わせたパスコンポーネントを備えたベース値）。"
    },
    {
      "indent": 3,
      "text": "This appendix describes a subset of link format documents called the Limited Link Format. The one rule herein is not very limiting in practice -- all examples in [RFC6690] and all deployments the authors are aware of already stick to them -- but eases the implementation of RD servers.",
      "ja": "この付録では、Limited Link形式と呼ばれるリンク形式ドキュメントのサブセットについて説明しています。ここでの1つのルールは実際にはそれほど制限されていません -  [RFC6690]のすべての例とすべての展開は、著者がすでにそれらに固執していることを認識していますが、RDサーバーの実装を緩和します。"
    },
    {
      "indent": 3,
      "text": "It is applicable to representations in the application/link-format media type and any other media types that inherit [RFC6690], Section 2.1.",
      "ja": "アプリケーション/リンク形式のメディアタイプおよび[RFC6690]、セクション2.1を継承するその他のメディアタイプの表現に適用できます。"
    },
    {
      "indent": 3,
      "text": "A link format representation is in the Limited Link Format if, for each link in it, the following applies:",
      "ja": "リンク形式の表現は、リンクごとにリンクごとに、以下が適用される場合、限られたリンク形式です。"
    },
    {
      "indent": 3,
      "text": "All URI references either follow the URI or the path-absolute ABNF rule of [RFC3986] (i.e., the target and anchor each either start with a scheme or with a single slash).",
      "ja": "すべてのURI参照は、[RFC3986]のURIまたはパスアブソルートABNFルールに従います（つまり、ターゲットとアンカーはそれぞれスキームまたは単一のスラッシュで始まります）。"
    },
    {
      "indent": 0,
      "text": "Acknowledgments",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Oscar Novo, Srdjan Krco, Szymon Sasin, Kerry Lynn, Esko Dijk, Anders Brandt, Matthieu Vial, Jim Schaad, Mohit Sethi, Hauke Petersen, Hannes Tschofenig, Sampo Ukkola, Linyi Tian, Jan Newmarch, Matthias Kovatsch, Jaime Jimenez, and Ted Lemon have provided helpful comments, discussions, and ideas to improve and shape this document. Zach would also like to thank his colleagues from the EU FP7 SENSEI project, where many of the RD concepts were originally developed.",
      "ja": "オスカー・ノヴォ、Srdjan Krco、Szymon Sasin、Kerry Lynn、Esko Dijk、Anders Brandt、Matthieu Vial、Jim Schaad、Mohit Sethi、Hauke Petersen、Hannes Tschofenig、Sampo Ukkola、Linyi Tian、Jan New Newmarkias kovatsch、レモンは、このドキュメントを改善および形成するための有益なコメント、ディスカッション、アイデアを提供しています。ザックはまた、RDコンセプトの多くが元々開発されたEU FP7先生プロジェクトの同僚に感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Christian Amsüss (editor) Email: christian@amsuess.com",
      "ja": "ChristianAmsüss（編集者）電子メール：churist@amsuess.com"
    },
    {
      "indent": 3,
      "text": "Zach Shelby Edge Impulse 3031 Tisch Way San Jose, 95128 United States of America Email: zach@edgeimpulse.com",
      "ja": "Zach Shelby Edge Impulse 3031 Tisch Way San Jose、95128 United States of America Email：zach@edgempulse.com"
    },
    {
      "indent": 3,
      "text": "Michael Koster PassiveLogic 524 H Street Antioch, CA 94509 United States of America Phone: +1-707-502-5136 Email: michaeljohnkoster@gmail.com",
      "ja": "Michael Koster Passivelogic 524 H Street Antioch、CA 94509アメリカ合衆国電話：1-707-502-5136メール：MichaelJohnkoster@gmail.com"
    },
    {
      "indent": 3,
      "text": "Carsten Bormann Universität Bremen TZI Postfach 330440 D-28359 Bremen Germany Phone: +49-421-218-63921 Email: cabo@tzi.org",
      "ja": "Carsten BormannUniversitätBremenTziPostfach 330440 D-28359 Bremen Germany電話：49-421-218-63921メール：cabo@tzi.org"
    },
    {
      "indent": 3,
      "text": "Peter van der Stok vanderstok consultancy Email: stokcons@bbhmail.nl",
      "ja": "Peter van der Stok Vanderstok Consultancyメール：stokcons@bbhmail.nl"
    }
  ]
}