{
  "title": {
    "text": "RFC 9406 - HyStart++: Modified Slow Start for TCP",
    "ja": "RFC 9406 - Hystart：TCPの変更スロースタート"
  },
  "number": 9406,
  "created_at": "2023-05-17 02:47:40.468044+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                P. Balasubramanian\nRequest for Comments: 9406                                     Confluent\nCategory: Standards Track                                       Y. Huang\nISSN: 2070-1721                                                 M. Olson\n                                                               Microsoft\n                                                                May 2023",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 17,
      "text": "HyStart++: Modified Slow Start for TCP",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document describes HyStart++, a simple modification to the slow start phase of congestion control algorithms. Slow start can overshoot the ideal send rate in many cases, causing high packet loss and poor performance. HyStart++ uses increase in round-trip delay as a heuristic to find an exit point before possible overshoot. It also adds a mitigation to prevent jitter from causing premature slow start exit.",
      "ja": "このドキュメントでは、Hystartについて説明します。これは、うっ血制御アルゴリズムのスロースタートフェーズの単純な変更です。スロースタートは、多くの場合、理想的な送信率をオーバーシュートする可能性があり、高いパケット損失とパフォーマンスの低下を引き起こします。Hystartは、ヒューリスティックとして往復遅延の増加を使用して、オーバーシュートの前に出口ポイントを見つけます。また、ジッターが早期のスロースタート出口を引き起こすのを防ぐための緩和を追加します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準トラックドキュメントです。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 7841.",
      "ja": "このドキュメントは、インターネットエンジニアリングタスクフォース（IETF）の製品です。IETFコミュニティのコンセンサスを表しています。公開レビューを受けており、インターネットエンジニアリングステアリンググループ（IESG）からの出版が承認されています。インターネット標準の詳細については、RFC 7841のセクション2で入手できます。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at https://www.rfc-editor.org/info/rfc9406.",
      "ja": "このドキュメントの現在のステータス、任意のERRATA、およびそのフィードバックを提供する方法に関する情報は、https：//www.rfc-editor.org/info/rfc9406で取得できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2023 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（c）2023 IETF Trustおよび文書著者として特定された人。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (https://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Revised BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Revised BSD License.",
      "ja": "このドキュメントは、BCP 78およびIETFドキュメント（https://trustee.ietf.org/license-info）に関連するIETF Trustの法的規定の対象となります。この文書に関するあなたの権利と制限を説明するので、これらの文書を注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、セクション4.Eで説明されている法的規定のセクション4.Eで説明されており、改訂されたBSDライセンスで説明されている保証なしで提供されるように、改訂されたBSDライセンステキストを含める必要があります。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction\n2.  Terminology\n3.  Definitions\n4.  HyStart++ Algorithm\n  4.1.  Summary\n  4.2.  Algorithm Details\n  4.3.  Tuning Constants and Other Considerations\n5.  Deployments and Performance Evaluations\n6.  Security Considerations\n7.  IANA Considerations\n8.  References\n  8.1.  Normative References\n  8.2.  Informative References\nAcknowledgments\nAuthors' Addresses",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "[RFC5681] describes the slow start congestion control algorithm for TCP. The slow start algorithm is used when the congestion window (cwnd) is less than the slow start threshold (ssthresh). During slow start, in the absence of packet loss signals, TCP increases the cwnd exponentially to probe the network capacity. This fast growth can overshoot the ideal sending rate and cause significant packet loss that cannot always be recovered efficiently.",
      "ja": "[RFC5681]は、TCPのスロースタート輻輳制御アルゴリズムを説明しています。うっ血ウィンドウ（CWND）がスロースタートしきい値（SSTHRESH）よりも少ない場合、スロースタートアルゴリズムが使用されます。スロースタート中、パケット損失信号がない場合、TCPはCWNDを指数関数的に増加させてネットワーク容量をプローブします。この急速な成長は、理想的な送信率をオーバーシュートし、常に効率的に回復することはできない重大なパケット損失を引き起こす可能性があります。"
    },
    {
      "indent": 3,
      "text": "HyStart++ builds upon Hybrid Start (HyStart), originally described in [HyStart]. HyStart++ uses increase in round-trip delay as a signal to exit slow start before potential packet loss occurs as a result of overshoot. This is one of two algorithms specified in [HyStart] for finding a safe exit point for slow start. After the slow start exit, a new Conservative Slow Start (CSS) phase is used to determine whether the slow start exit was premature and to resume slow start. This mitigation improves performance in the presence of jitter. HyStart++ reduces packet loss and retransmissions, and improves goodput in lab measurements and real-world deployments.",
      "ja": "Hystartは、もともと[Hystart]で説明されているハイブリッドスタート（Hystart）に基づいています。Hystartは、オーバーシュートの結果として潜在的なパケット損失が発生する前に、潜在的なパケット損失が発生する前に、スロースタートを終了するための信号として、往復遅延の増加を使用します。これは、[Hystart]で指定された2つのアルゴリズムの1つであり、ゆっくりと開始するための安全な出口ポイントを見つけます。スロースタート出口の後、新しい保守的なスロースタート（CSS）フェーズを使用して、スロースタート出口が時期尚早であり、スロースタートを再開します。この緩和により、ジッターの存在下でのパフォーマンスが向上します。Hystartはパケットの損失と再送信を減らし、ラボの測定と現実世界の展開のGoodputを改善します。"
    },
    {
      "indent": 3,
      "text": "While this document describes HyStart++ for TCP, it can also be used for other transport protocols that use slow start, such as QUIC [RFC9002] or the Stream Control Transmission Protocol (SCTP) [RFC9260].",
      "ja": "このドキュメントでは、TCPのHystartについて説明していますが、QUIC [RFC9002]やストリーム制御伝送プロトコル（SCTP）[RFC9260]など、スロースタートを使用する他のトランスポートプロトコルにも使用できます。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "ja": "2. 用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14 [RFC2119] [RFC8174] when, and only when, they appear in all capitals, as shown here.",
      "ja": "この文書のキーワード \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", および \"OPTIONAL\" はBCP 14 [RFC2119] [RFC8174]で説明されているように、すべて大文字の場合にのみ解釈されます。"
    },
    {
      "indent": 0,
      "text": "3. Definitions",
      "section_title": true,
      "ja": "3. 定義"
    },
    {
      "indent": 3,
      "text": "To aid the reader, we repeat some definitions from [RFC5681]:",
      "ja": "読者を支援するために、[RFC5681]からいくつかの定義を繰り返します。"
    },
    {
      "indent": 3,
      "text": "SENDER MAXIMUM SEGMENT SIZE (SMSS): The size of the largest segment that the sender can transmit. This value can be based on the maximum transmission unit of the network, the Path MTU Discovery algorithm [RFC1191] [RFC4821], RMSS (see next item), or other factors. The size does not include the TCP/IP headers and options.",
      "ja": "送信者の最大セグメントサイズ（SMSS）：送信者が送信できる最大セグメントのサイズ。この値は、ネットワークの最大送信ユニット、PATH MTU Discoveryアルゴリズム[RFC1191] [RFC4821]、RMSS（次のアイテムを参照）、またはその他の要因に基づいています。サイズには、TCP/IPヘッダーとオプションは含まれません。"
    },
    {
      "indent": 3,
      "text": "RECEIVER MAXIMUM SEGMENT SIZE (RMSS): The size of the largest segment that the receiver is willing to accept. This is the value specified in the MSS option sent by the receiver during connection startup. Or, if the MSS option is not used, it is 536 bytes [RFC1122]. The size does not include the TCP/IP headers and options.",
      "ja": "受信機の最大セグメントサイズ（RMSS）：受信者が受け入れる意思がある最大セグメントのサイズ。これは、接続スタートアップ中に受信機が送信したMSSオプションで指定された値です。または、MSSオプションを使用していない場合、536バイト[RFC1122]です。サイズには、TCP/IPヘッダーとオプションは含まれません。"
    },
    {
      "indent": 3,
      "text": "RECEIVER WINDOW (rwnd): The most recently advertised receiver window.",
      "ja": "レシーバーウィンドウ（RWND）：最近宣伝されたレシーバーウィンドウ。"
    },
    {
      "indent": 3,
      "text": "CONGESTION WINDOW (cwnd): A TCP state variable that limits the amount of data a TCP can send. At any given time, a TCP MUST NOT send data with a sequence number higher than the sum of the highest acknowledged sequence number and the minimum of the cwnd and rwnd.",
      "ja": "うっ血ウィンドウ（CWND）：TCPが送信できるデータの量を制限するTCP状態変数。いつでも、TCPは、CWNDおよびRWNDの最低値と最小値の合計よりも高いシーケンス番号を持つデータを送信してはなりません。"
    },
    {
      "indent": 0,
      "text": "4. HyStart++ Algorithm",
      "section_title": true,
      "ja": "4. Hystartアルゴリズム"
    },
    {
      "indent": 0,
      "text": "4.1. Summary",
      "section_title": true,
      "ja": "4.1. まとめ"
    },
    {
      "indent": 3,
      "text": "[HyStart] specifies two algorithms (a \"Delay Increase\" algorithm and an \"Inter-Packet Arrival\" algorithm) to be run in parallel to detect that the sending rate has reached capacity. In practice, the Inter-Packet Arrival algorithm does not perform well and is not able to detect congestion early, primarily due to ACK compression. The idea of the Delay Increase algorithm is to look for spikes in RTT (round-trip time), which suggest that the bottleneck buffer is filling up.",
      "ja": "[Hystart] 2つのアルゴリズム（「遅延増加」アルゴリズムと「パケット間到着」アルゴリズム）を並行して実行して、送信率が容量に達したことを検出します。実際には、パケット間到着アルゴリズムはうまく機能せず、主にACK圧縮のために輻輳を早期に検出することができません。遅延増加アルゴリズムのアイデアは、RTT（往復時間）のスパイクを探すことです。これは、ボトルネックバッファがいっぱいになっていることを示唆しています。"
    },
    {
      "indent": 3,
      "text": "In HyStart++, a TCP sender uses standard slow start and then uses the Delay Increase algorithm to trigger an exit from slow start. But instead of going straight from slow start to congestion avoidance, the sender spends a number of RTTs in a Conservative Slow Start (CSS) phase to determine whether the exit from slow start was premature. During CSS, the congestion window is grown exponentially in a fashion similar to regular slow start, but with a smaller exponential base, resulting in less aggressive growth. If the RTT reduces during CSS, it's concluded that the RTT spike was not related to congestion caused by the connection sending at a rate greater than the ideal send rate, and the connection resumes slow start. If the RTT inflation persists throughout CSS, the connection enters congestion avoidance.",
      "ja": "Hystartでは、TCP Senderが標準のスロースタートを使用し、遅延増加アルゴリズムを使用してスロースタートからの出口をトリガーします。しかし、スロースタートから混雑回避に直接進む代わりに、送信者は保守的なスロースタート（CSS）フェーズで多くのRTTを費やして、スロースタートからの出口が時期尚早かどうかを判断します。CSSの間、輻輳ウィンドウは、通常のスロースタートと同様に形で指数関数的に成長しますが、指数ベースが小さく、攻撃的な成長が少なくなります。RTTがCSS中に減少した場合、RTTスパイクは、理想的な送信レートよりも大きいレートで接続の送信によって引き起こされる混雑とは関係がなく、接続がスロースタートを再開すると結論付けられています。RTTのインフレがCSS全体で持続している場合、接続は混雑回避に入ります。"
    },
    {
      "indent": 0,
      "text": "4.2. Algorithm Details",
      "section_title": true,
      "ja": "4.2. アルゴリズムの詳細"
    },
    {
      "indent": 3,
      "text": "The following pseudocode uses a limit, L, to control the aggressiveness of the cwnd increase during both standard slow start and CSS. While an arriving ACK may newly acknowledge an arbitrary number of bytes, the HyStart++ algorithm limits the number of those bytes applied to increase the cwnd to L*SMSS bytes.",
      "ja": "次の擬似コードは、制限lを使用して、標準のスロースタートとCSSの両方の間にCWND増加の攻撃性を制御します。到着するACKは任意の数のバイトを新たに認めている可能性がありますが、ハイスタートアルゴリズムは、CWNDをL*SMSSバイトに増やすために適用されるバイトの数を制限します。"
    },
    {
      "indent": 3,
      "text": "lastRoundMinRTT and currentRoundMinRTT are initialized to infinity at the initialization time. currRTT is the RTT sampled from the latest incoming ACK and initialized to infinity.",
      "ja": "lastroundminrttおよびcurrentRoundMinrttは、初期化時に無限に初期化されます。Currrttは、最新の着信ACKからサンプリングされ、Infinityに初期化されたRTTです。"
    },
    {
      "indent": 3,
      "text": "lastRoundMinRTT = infinity currentRoundMinRTT = infinity currRTT = infinity",
      "ja": "LastroundMinrtt = Infinity CurrentRoundMinrtt = Infinity Currrtt = Infinity"
    },
    {
      "indent": 3,
      "text": "HyStart++ measures rounds using sequence numbers, as follows:",
      "ja": "次のように、Hystartはシーケンス番号を使用してラウンドを測定します。"
    },
    {
      "indent": 3,
      "text": "* Define windowEnd as a sequence number initialized to SND.NXT.",
      "ja": "* WindowEndをSND.NXTに初期化されたシーケンス番号として定義します。"
    },
    {
      "indent": 3,
      "text": "* When windowEnd is ACKed, the current round ends and windowEnd is set to SND.NXT.",
      "ja": "* WindowEndがAckedを使用すると、現在のラウンドが終了し、WindowEndはsnd.nxtに設定されます。"
    },
    {
      "indent": 3,
      "text": "At the start of each round during standard slow start [RFC5681] and CSS, initialize the variables used to compute the last round's and current round's minimum RTT:",
      "ja": "標準のスロースタート[RFC5681]およびCSS中の各ラウンドの開始時に、最後のラウンドと現在のラウンドの最小RTTを計算するために使用される変数を初期化します。"
    },
    {
      "indent": 3,
      "text": "lastRoundMinRTT = currentRoundMinRTT currentRoundMinRTT = infinity rttSampleCount = 0",
      "ja": "lastroundMinrtt = currentRoundMinrtt currentRoundMinrtt = infinity rttsamplecount = 0"
    },
    {
      "indent": 3,
      "text": "For each arriving ACK in slow start, where N is the number of previously unacknowledged bytes acknowledged in the arriving ACK:",
      "ja": "スロースタートでACKが到着するたびに、nは到着したACKで認められた以前に承認されていないバイトの数です。"
    },
    {
      "indent": 3,
      "text": "Update the cwnd:",
      "ja": "CWNDを更新します："
    },
    {
      "indent": 5,
      "text": "cwnd = cwnd + min(N, L * SMSS)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Keep track of the minimum observed RTT:",
      "ja": "観測された最小のRTTを追跡します："
    },
    {
      "indent": 5,
      "text": "currentRoundMinRTT = min(currentRoundMinRTT, currRTT)\nrttSampleCount += 1",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "For rounds where at least N_RTT_SAMPLE RTT samples have been obtained and currentRoundMinRTT and lastRoundMinRTT are valid, check to see if delay increase triggers slow start exit:",
      "ja": "少なくともN_RTT_SAMPLE RTTサンプルが取得されており、CurrentRoundMinRTTとLastRoundMinRTTが有効なラウンドの場合、遅延増加トリガーが遅い開始出口を増やすかどうかを確認してください。"
    },
    {
      "indent": 3,
      "text": "if ((rttSampleCount >= N_RTT_SAMPLE) AND\n    (currentRoundMinRTT != infinity) AND\n    (lastRoundMinRTT != infinity))\n  RttThresh = max(MIN_RTT_THRESH,\n    min(lastRoundMinRTT / MIN_RTT_DIVISOR, MAX_RTT_THRESH))\n  if (currentRoundMinRTT >= (lastRoundMinRTT + RttThresh))\n    cssBaselineMinRtt = currentRoundMinRTT\n    exit slow start and enter CSS",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "For each arriving ACK in CSS, where N is the number of previously unacknowledged bytes acknowledged in the arriving ACK:",
      "ja": "CSSに到着するACKごとに、Nは到着したACKで認められていた以前の未把持バイトの数です。"
    },
    {
      "indent": 3,
      "text": "Update the cwnd:",
      "ja": "CWNDを更新します："
    },
    {
      "indent": 3,
      "text": "cwnd = cwnd + (min(N, L * SMSS) / CSS_GROWTH_DIVISOR)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Keep track of the minimum observed RTT:",
      "ja": "観測された最小のRTTを追跡します："
    },
    {
      "indent": 3,
      "text": "currentRoundMinRTT = min(currentRoundMinRTT, currRTT)\nrttSampleCount += 1",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "For CSS rounds where at least N_RTT_SAMPLE RTT samples have been obtained, check to see if the current round's minRTT drops below baseline (cssBaselineMinRtt) indicating that slow start exit was spurious:",
      "ja": "少なくともN_RTT_Sample RTTサンプルが取得されているCSSラウンドの場合、現在のラウンドのMinRTTがベースライン（CSSBaseLineminRTT）の下にドロップするかどうかを確認して、スロースタートの出口が偽りであることを示しています。"
    },
    {
      "indent": 3,
      "text": "if (currentRoundMinRTT < cssBaselineMinRtt) cssBaselineMinRtt = infinity resume slow start including HyStart++",
      "ja": "if（currentRoundMinrtt <cssbaselineminrtt）cssbaselineminrtt = infinity resume slowスタートを含むスロースタート"
    },
    {
      "indent": 3,
      "text": "CSS lasts at most CSS_ROUNDS rounds. If the transition into CSS happens in the middle of a round, that partial round counts towards the limit.",
      "ja": "CSSはほとんどのCSS_ROUNDSラウンドで持続します。CSSへの移行がラウンドの途中で発生した場合、その部分ラウンドは限界にカウントされます。"
    },
    {
      "indent": 3,
      "text": "If CSS_ROUNDS rounds are complete, enter congestion avoidance by setting the ssthresh to the current cwnd.",
      "ja": "CSS_Roundsラウンドが完了した場合は、SSThreshを現在のCWNDに設定して、混雑回避を入力します。"
    },
    {
      "indent": 3,
      "text": "ssthresh = cwnd",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "If loss or Explicit Congestion Notification (ECN) marking is observed at any time during standard slow start or CSS, enter congestion avoidance by setting the ssthresh to the current cwnd.",
      "ja": "標準のスロースタートまたはCSS中にいつでも紛失または明示的な混雑通知（ECN）マーキングが観察される場合、SSThreshを現在のCWNDに設定することにより、混雑回避を入力します。"
    },
    {
      "indent": 3,
      "text": "ssthresh = cwnd",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "4.3. Tuning Constants and Other Considerations",
      "section_title": true,
      "ja": "4.3. チューニング定数およびその他の考慮事項"
    },
    {
      "indent": 3,
      "text": "It is RECOMMENDED that a HyStart++ implementation use the following constants:",
      "ja": "Hystart実装では、次の定数を使用することをお勧めします。"
    },
    {
      "indent": 3,
      "text": "MIN_RTT_THRESH = 4 msec MAX_RTT_THRESH = 16 msec MIN_RTT_DIVISOR = 8 N_RTT_SAMPLE = 8 CSS_GROWTH_DIVISOR = 4 CSS_ROUNDS = 5 L = infinity if paced, L = 8 if non-paced",
      "ja": "min_rtt_thresh = 4 msec max_rtt_thresh = 16 msec min_rtt_divisor = 8 n_rtt_sample = 8 css_growth_divisor = 4 css_rounds = 5 l =無限"
    },
    {
      "indent": 3,
      "text": "These constants have been determined with lab measurements and real-world deployments. An implementation MAY tune them for different network characteristics.",
      "ja": "これらの定数は、実験室の測定と現実世界の展開で決定されています。実装は、異なるネットワーク特性に対してそれらをチューニングする場合があります。"
    },
    {
      "indent": 3,
      "text": "The delay increase sensitivity is determined by MIN_RTT_THRESH and MAX_RTT_THRESH. Smaller values of MIN_RTT_THRESH may cause spurious exits from slow start. Larger values of MAX_RTT_THRESH may result in slow start not exiting until loss is encountered for connections on large RTT paths.",
      "ja": "遅延の増加感度は、min_rtt_threshおよびmax_rtt_threshによって決定されます。min_rtt_threshの値が小さい場合は、スロースタートからスプリアスエックスを引き起こす可能性があります。MAX_RTT_THRESHの値が大きくなると、大きなRTTパスでの接続の損失が発生するまで、ゆっくりと開始しない場合があります。"
    },
    {
      "indent": 3,
      "text": "MIN_RTT_DIVISOR is a fraction of RTT to compute the delay threshold. A smaller value would mean a larger threshold and thus less sensitivity to delay increase, and vice versa.",
      "ja": "min_rtt_divisorは、遅延しきい値を計算するためのRTTのほんの一部です。値が小さくなると、しきい値が大きくなり、遅延増加に対する感度が低くなり、逆も同様です。"
    },
    {
      "indent": 3,
      "text": "While all TCP implementations are REQUIRED to take at least one RTT sample each round, implementations of HyStart++ are RECOMMENDED to take at least N_RTT_SAMPLE RTT samples. Using lower values of N_RTT_SAMPLE will lower the accuracy of the measured RTT for the round; higher values will improve accuracy at the cost of more processing.",
      "ja": "すべてのTCP実装は、少なくとも1つのRTTサンプルを各ラウンドで採取するために必要ですが、Hystartの実装は、少なくともN_RTT_SAMPER RTTサンプルを採取することをお勧めします。N_RTT_SAMPLEの低い値を使用すると、ラウンドの測定されたRTTの精度が低下します。値が高いと、より多くの処理の犠牲を払って精度が向上します。"
    },
    {
      "indent": 3,
      "text": "The minimum value of CSS_GROWTH_DIVISOR MUST be at least 2. A value of 1 results in the same aggressive behavior as regular slow start. Values larger than 4 will cause the algorithm to be less aggressive and maybe less performant.",
      "ja": "CSS_GROWTH_DIVISORの最小値は、少なくとも2でなければなりません。4を超える値により、アルゴリズムの攻撃性が低く、パフォーマンスが低下します。"
    },
    {
      "indent": 3,
      "text": "Smaller values of CSS_ROUNDS may miss detecting jitter, and larger values may limit performance.",
      "ja": "CSS_ROUNDSの値が少ない場合は、ジッターの検出を見逃し、値が大きいとパフォーマンスが制限される場合があります。"
    },
    {
      "indent": 3,
      "text": "Packet pacing [ASA00] is a possible mechanism to avoid large bursts and their associated harm. A paced TCP implementation SHOULD use L = infinity. Burst concerns are mitigated by pacing, and this setting allows for optimal cwnd growth on modern networks.",
      "ja": "パケットペース[ASA00]は、大きなバーストとそれに関連する害を避けるための可能なメカニズムです。ペースのTCP実装では、L = Infinityを使用する必要があります。バーストの懸念はペーシングによって軽減され、この設定により、最新のネットワークで最適なCWND成長が可能になります。"
    },
    {
      "indent": 3,
      "text": "For TCP implementations that pace to mitigate burst concerns, L values smaller than infinity may suffer performance problems due to slow cwnd growth in high-speed networks. For non-paced TCP implementations, L values smaller than 8 may suffer performance problems due to slow cwnd growth in high-speed networks; L values larger than 8 may cause an increase in burstiness and thereby loss rates, and result in poor performance.",
      "ja": "バーストの懸念を緩和するペースを持つTCP実装の場合、高速ネットワークのCWND成長が遅いため、無限よりも小さい値がパフォーマンスの問題に苦しむ可能性があります。ペースのないTCP実装の場合、L値は8未満の値が高速ネットワークのCWND成長が遅いためパフォーマンスの問題に苦しむ可能性があります。l値が8を超える値は、バーストの増加とそれによって損失率の増加を引き起こし、パフォーマンスが低下する可能性があります。"
    },
    {
      "indent": 3,
      "text": "An implementation SHOULD use HyStart++ only for the initial slow start (when the ssthresh is at its initial value of arbitrarily high per [RFC5681]) and fall back to using standard slow start for the remainder of the connection lifetime. This is acceptable because subsequent slow starts will use the discovered ssthresh value to exit slow start and avoid the overshoot problem. An implementation MAY use HyStart++ to grow the restart window [RFC5681] after a long idle period.",
      "ja": "実装では、最初のスロースタートでのみHystartを使用する必要があります（SSthreshが[RFC5681]ごとに任意に高くなっている初期値がある場合）。これは、その後のスロースタートが発見されたSSThresh値を使用してスロースタートを終了し、オーバーシュートの問題を回避するため、許容されます。実装では、長いアイドル期間の後にハイスタートを使用して再起動ウィンドウ[RFC5681]を栽培する場合があります。"
    },
    {
      "indent": 3,
      "text": "In application-limited scenarios, the amount of data in flight could fall below the bandwidth-delay product (BDP) and result in smaller RTT samples, which can trigger an exit back to slow start. It is expected that a connection might oscillate between CSS and slow start in such scenarios. But this behavior will neither result in a connection prematurely entering congestion avoidance nor cause overshooting compared to slow start.",
      "ja": "アプリケーションに制限されたシナリオでは、飛行中のデータの量は帯域幅遅延製品（BDP）を下回り、RTTサンプルが小さくなり、出口をトリガーしてスロースタートをトリガーできます。このようなシナリオでは、接続がCSSの間で振動し、スロースタートが発生する可能性があります。しかし、この動作は、ゆっくりとしたスタートと比較して、混合回避を早期に接続したり、オーバーシュートを引き起こすこともありません。"
    },
    {
      "indent": 0,
      "text": "5. Deployments and Performance Evaluations",
      "section_title": true,
      "ja": "5. 展開とパフォーマンス評価"
    },
    {
      "indent": 3,
      "text": "At the time of this writing, HyStart++ as described in this document has been default enabled for all TCP connections in the Windows operating system for over two years with pacing disabled and an actual L = 8.",
      "ja": "この執筆時点で、このドキュメントで説明されているようにHystartは、WindowsオペレーティングシステムのすべてのTCP接続に対して2年以上にわたってデフォルトが有効になっており、ペーシング障害と実際のL = 8があります。"
    },
    {
      "indent": 3,
      "text": "In lab measurements with Windows TCP, HyStart++ shows goodput improvements as well as reductions in packet loss and retransmissions compared to standard slow start. For example, across a variety of tests on a 100 Mbps link with a bottleneck buffer size of bandwidth-delay product, HyStart++ reduces bytes retransmitted by 50% and retransmission timeouts (RTOs) by 36%.",
      "ja": "Windows TCPを使用したラボ測定では、Hystartは、標準の遅いスタートと比較して、パケットの損失と再送信の削減と同様に、グッドポットの改善と削減を示しています。たとえば、帯域幅遅延製品のボトルネックバッファーサイズを使用した100 Mbpsリンクのさまざまなテストで、Hystartは50％の再送信バイトと再送信タイムアウト（RTO）を36％削減します。"
    },
    {
      "indent": 3,
      "text": "In an A/B test where we compared an implementation of HyStart++ (based on an earlier draft version of this document) to standard slow start across a large Windows device population, out of 52 billion TCP connections, 0.7% of connections move from 1 RTO to 0 RTOs and another 0.7% of connections move from 2 RTOs to 1 RTO with HyStart++. This test did not focus on send-heavy connections, and the impact on send-heavy connections is likely much higher. We plan to conduct more such production experiments to gather more data in the future.",
      "ja": "A/Bテストでは、Hystartの実装（このドキュメントの以前のドラフトバージョンに基づく）を比較して、520億のTCP接続のうち、1つのRTOから0.7％が移動する大規模なWindowsデバイス母集団にわたって標準のスロースタートと比較しました。0 rtosと、接続の別の0.7％が2 rtosからHystartを使用して1 RTOに移動します。このテストでは、送信が多い接続に焦点を当てておらず、送信が多い接続への影響ははるかに高い可能性があります。将来、より多くのデータを収集するために、このような生産実験を実施する予定です。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "HyStart++ enhances slow start and inherits the general security considerations discussed in [RFC5681].",
      "ja": "Hystartはスロースタートを強化し、[RFC5681]で説明した一般的なセキュリティ上の考慮事項を継承します。"
    },
    {
      "indent": 3,
      "text": "An attacker can cause HyStart++ to exit slow start prematurely and impair the performance of a TCP connection by, for example, dropping data packets or their acknowledgments.",
      "ja": "攻撃者は、ハイスタートが早期にスタートスタートを終了し、たとえばデータパケットやその謝辞を削除することにより、TCP接続のパフォーマンスを損なう可能性があります。"
    },
    {
      "indent": 3,
      "text": "The ACK division attack outlined in [SCWA99] does not affect HyStart++ because the congestion window increase in HyStart++ is based on the number of bytes newly acknowledged in each arriving ACK rather than by a particular constant on each arriving ACK.",
      "ja": "[SCWA99]で概説されているACK部門攻撃は、ハイスタートの混雑ウィンドウの増加は、到着する各ACKで特定の定数ではなく、到着する各ACKで新たに認められているバイト数に基づいているため、ハイスタートに影響しません。"
    },
    {
      "indent": 0,
      "text": "7. IANA Considerations",
      "section_title": true,
      "ja": "7. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document has no IANA actions.",
      "ja": "このドキュメントにはIANAアクションがありません。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8. 参考文献"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "ja": "8.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <https://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119] Bradner、S。、「要件レベルを示すためにRFCで使用するためのキーワード」、BCP 14、RFC 2119、DOI 10.17487/RFC2119、1997年3月、<https://www.rfc-editor.org/info/RFC2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC5681] Allman, M., Paxson, V., and E. Blanton, \"TCP Congestion Control\", RFC 5681, DOI 10.17487/RFC5681, September 2009, <https://www.rfc-editor.org/info/rfc5681>.",
      "ja": "[RFC5681] Allman、M.、Paxson、V.、およびE. Blanton、「TCP混雑制御」、RFC 5681、DOI 10.17487/RFC5681、2009年9月、<https://www.rfc-editor.org/info/RFC5681>。"
    },
    {
      "indent": 3,
      "text": "[RFC8174] Leiba, B., \"Ambiguity of Uppercase vs Lowercase in RFC 2119 Key Words\", BCP 14, RFC 8174, DOI 10.17487/RFC8174, May 2017, <https://www.rfc-editor.org/info/rfc8174>.",
      "ja": "[RFC8174] Leiba、B。、「RFC 2119キーワードの大文字と小文字の曖昧さ」、BCP 14、RFC 8174、DOI 10.17487/RFC8174、2017年5月、<https：//www.rfc-editor.org/info/RFC8174>。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "ja": "8.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[ASA00] Aggarwal, A., Savage, S., and T. Anderson, \"Understanding the performance of TCP pacing\", Proceedings IEEE INFOCOM 2000, DOI 10.1109/INFCOM.2000.832483, March 2000, <https://doi.org/10.1109/INFCOM.2000.832483>.",
      "ja": "[ASA00] Aggarwal、A.、Savage、S。、およびT. Anderson、「TCPペーシングのパフォーマンスの理解」、Proceedings IEEE Infocom 2000、DOI 10.1109/Infcom.2000.832483、2000年3月、<https://doi.org/10.1109/infcom.2000.832483>。"
    },
    {
      "indent": 3,
      "text": "[HyStart] Ha, S. and I. Rhee, \"Taming the elephants: New TCP slow start\", Computer Networks vol. 55, no. 9, pp. 2092-2110, DOI 10.1016/j.comnet.2011.01.014, June 2011, <https://doi.org/10.1016/j.comnet.2011.01.014>.",
      "ja": "[Hystart] Ha、S。およびI. Rhee、「象の飼いならされた：新しいTCPスロースタート」、Computer Networks Vol。55、いいえ。9、pp。2092-2110、doi 10.1016/j.comnet.2011.01.014、2011年6月、<https://doi.org/10.1016/j.comnet.2011.01.014>。"
    },
    {
      "indent": 3,
      "text": "[RFC1122] Braden, R., Ed., \"Requirements for Internet Hosts - Communication Layers\", STD 3, RFC 1122, DOI 10.17487/RFC1122, October 1989, <https://www.rfc-editor.org/info/rfc1122>.",
      "ja": "[RFC1122] Braden、R.、ed。、「インターネットホストの要件 - 通信レイヤー」、STD 3、RFC 1122、DOI 10.17487/RFC1122、1989年10月、<https://www.rfc-editor.org/info/RFC1122>。"
    },
    {
      "indent": 3,
      "text": "[RFC1191] Mogul, J. and S. Deering, \"Path MTU discovery\", RFC 1191, DOI 10.17487/RFC1191, November 1990, <https://www.rfc-editor.org/info/rfc1191>.",
      "ja": "[RFC1191] Mogul、J。およびS. Deering、「Path MTU Discovery」、RFC 1191、DOI 10.17487/RFC1191、1990年11月、<https://www.rfc-editor.org/info/rfc1191>。"
    },
    {
      "indent": 3,
      "text": "[RFC4821] Mathis, M. and J. Heffner, \"Packetization Layer Path MTU Discovery\", RFC 4821, DOI 10.17487/RFC4821, March 2007, <https://www.rfc-editor.org/info/rfc4821>.",
      "ja": "[RFC4821] Mathis、M。およびJ. Heffner、「Packetization Layer Path MTU Discovery」、RFC 4821、DOI 10.17487/RFC4821、2007年3月、<https://www.rfc-editor.org/info/rfc4821>。"
    },
    {
      "indent": 3,
      "text": "[RFC9002] Iyengar, J., Ed. and I. Swett, Ed., \"QUIC Loss Detection and Congestion Control\", RFC 9002, DOI 10.17487/RFC9002, May 2021, <https://www.rfc-editor.org/info/rfc9002>.",
      "ja": "[RFC9002] Iyengar、J.、ed。and I. Swett、ed。、「QUIC損失検出と輻輳制御」、RFC 9002、DOI 10.17487/RFC9002、2021年5月、<https://www.rfc-editor.org/info/rfc9002>。"
    },
    {
      "indent": 3,
      "text": "[RFC9260] Stewart, R., Txen, M., and K. Nielsen, \"Stream Control Transmission Protocol\", RFC 9260, DOI 10.17487/RFC9260, June 2022, <https://www.rfc-editor.org/info/rfc9260>.",
      "ja": "[RFC9260] Stewart、R.、Txen、M。、およびK. Nielsen、「Stream Control Transmission Protocol」、RFC 9260、DOI 10.17487/RFC9260、2022年6月、<https://www.rfc-editor.org/info/RFC9260>。"
    },
    {
      "indent": 3,
      "text": "[SCWA99] Savage, S., Cardwell, N., Wetherall, D., and T. Anderson, \"TCP congestion control with a misbehaving receiver\", ACM SIGCOMM Computer Communication Review, vol. 29, issue 5, pp. 71-78, DOI 10.1145/505696.505704, October 1999, <https://doi.org/10.1145/505696.505704>.",
      "ja": "[Scwa99] Savage、S.、Cardwell、N.、Wetherall、D。、およびT. Anderson、「不正行為レシーバーによるTCP混雑制御」、ACM Sigcomm Computer Communication Review、vol。29、第5号、pp。71-78、DOI 10.1145/505696.505704、1999年10月、<https://doi.org/10.1145/505696.505704>。"
    },
    {
      "indent": 0,
      "text": "Acknowledgments",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "During the discussions of this work on the TCPM mailing list and in working group meetings, helpful comments, critiques, and reviews were received from (listed alphabetically by last name) Mark Allman, Bob Briscoe, Neal Cardwell, Yuchung Cheng, Junho Choi, Martin Duke, Reese Enghardt, Christian Huitema, Ilpo Jrvinen, Yoshifumi Nishida, Randall Stewart, and Michael Txen.",
      "ja": "TCPMメーリングリストとワーキンググループ会議でのこの作業の議論の中で、有益なコメント、批評、レビューは（姓ごとにアルファベット順にリストされています）Mark Allman、Bob Briscoe、Neal Cardwell、Yuchung Cheng、Junho Choi、Martininデューク、リース・エンガルト、クリスチャン・フイテマ、イルポ・ジュリヴィネン、ヨシフミ・ヨシフミダ、ランドール・スチュワート、マイケル・トクセン。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Praveen Balasubramanian Confluent 899 West Evelyn Ave Mountain View, CA 94041 United States of America Email: pravb.ietf@gmail.com",
      "ja": "Praveen Balasubramanian Confluent 899 West Evelyn Ave Mountain View、CA 94041アメリカ合衆国電子メール：pravb.ietf@gmail.com"
    },
    {
      "indent": 3,
      "text": "Yi Huang Microsoft One Microsoft Way Redmond, WA 98052 United States of America Phone: +1 425 703 0447 Email: huanyi@microsoft.com",
      "ja": "Yi Huang Microsoft One Microsoft Way Redmond、WA 98052アメリカ合衆国電話：1 425 703 0447メール：huanyi@microsoft.com"
    },
    {
      "indent": 3,
      "text": "Matt Olson Microsoft One Microsoft Way Redmond, WA 98052 United States of America Phone: +1 425 538 8598 Email: maolson@microsoft.com",
      "ja": "Matt Olson Microsoft One Microsoft Way Redmond、WA 98052アメリカ合衆国電話：1 425 538 8598メール：maolson@microsoft.com"
    }
  ]
}