{
  "title": {
    "text": "RFC 9845 - Challenges and Opportunities in Management for Green Networking",
    "ja": "RFC 9845 - グリーン ネットワーキングの管理における課題と機会"
  },
  "number": 9845,
  "created_at": "2025-10-08 23:24:06.750043+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Research Task Force (IRTF)                        A. Clemm, Ed.\nRequest for Comments: 9845                                     Sympotech\nCategory: Informational                                C. Pignataro, Ed.\nISSN: 2070-1721               NC State University & Blue Fern Consulting\n                                                             C. Westphal\n                                    University of California, Santa Cruz\n                                                            L. Ciavaglia\n                                                                   Nokia\n                                                             J. Tantsura\n                                                                  Nvidia\n                                                              M-P. Odini\n                                                            October 2025",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Challenges and Opportunities in Management for Green Networking",
      "section_title": true,
      "ja": "グリーンネットワーキングの管理における課題と機会"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "section_title": true,
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "Reducing humankind's environmental footprint and making technology more environmentally sustainable are among the biggest challenges of our age. Networks play an important part in this challenge. On one hand, they enable applications that help to reduce this footprint. On the other hand, they significantly contribute to this footprint themselves. Therefore, methods to make networking technology itself \"greener\" and to manage and operate networks in ways that reduce their environmental footprint without impacting their utility need to be explored. This document outlines a corresponding set of opportunities, along with associated research challenges, for networking technology in general and management technology in particular to become greener, i.e., more sustainable, with reduced greenhouse gas emissions and less negative impact on the environment.",
      "ja": "人類の環境フットプリントを削減し、技術をより環境的に持続可能にすることは、私たちの時代の最大の課題の一つです。ネットワークは、この課題で重要な役割を果たします。一方では、このフットプリントを減らすのに役立つアプリケーションを有効にします。一方、彼らはこのフットプリント自身に大きく貢献しています。したがって、ネットワーキングテクノロジー自体を「より環境に優しい」ようにし、ユーティリティに影響を与えることなく環境フットプリントを減らす方法でネットワークを管理および運用する方法を調査する必要があります。このドキュメントでは、関連する研究の課題に加えて、対応する一連の機会と、一般的なネットワーキングテクノロジーと、特に管理技術がより環境に優しい、つまり、温室効果ガスの排出削減と環境へのマイナスの影響が少ないため、より環境に優しいものになります。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Network Management Research Group (NMRG) of the Internet Research Task Force (IRTF). This document reflects the consensus of the research group. It is not a candidate for any level of Internet Standard and is published for informational purposes.",
      "ja": "この文書は、インターネット研究タスクフォース (IRTF) のネットワーク管理研究グループ (NMRG) の成果物です。この文書は研究グループの合意を反映しています。これは、どのレベルのインターネット標準の候補でもありません。情報提供を目的として公開されています。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "section_title": true,
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "この文書は Internet Standards Track 仕様ではありません。情報提供を目的として公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Research Task Force (IRTF). The IRTF publishes the results of Internet-related research and development activities. These results might not be suitable for deployment. This RFC represents the consensus of the Network Management Research Group of the Internet Research Task Force (IRTF). Documents approved for publication by the IRSG are not candidates for any level of Internet Standard; see Section 2 of RFC 7841.",
      "ja": "この文書は Internet Research Task Force (IRTF) の成果物です。IRTF は、インターネット関連の研究開発活動の結果を公開しています。これらの結果は、展開には適していない可能性があります。この RFC は、インターネット研究タスクフォース (IRTF) のネットワーク管理研究グループの合意を表しています。IRSG によって公開が承認された文書は、どのレベルのインターネット標準の候補でもありません。RFC 7841 のセクション 2 を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at https://www.rfc-editor.org/info/rfc9845.",
      "ja": "この文書の現在のステータス、正誤表、およびそれに対するフィードバックの提供方法に関する情報は、https://www.rfc-editor.org/info/rfc9845 で入手できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "section_title": true,
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2025 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright (c) 2025 IETF Trust および文書の著者として特定された人物。無断転載を禁じます。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (https://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document.",
      "ja": "このドキュメントは、BCP 78およびIETFドキュメント（https://trustee.ietf.org/license-info）に関連するIETF Trustの法的規定の対象となります。この文書に関するあなたの権利と制限を説明するので、これらの文書を注意深く確認してください。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "section_title": true,
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction\n  1.1.  Motivation\n  1.2.  Approaching the Problem\n  1.3.  Structuring the Problem Space\n2.  Definitions and Acronyms\n3.  Network Energy Consumption Characteristics and Implications\n4.  Challenges and Opportunities - Equipment Level\n  4.1.  Hardware and Manufacturing\n  4.2.  Visibility and Instrumentation\n5.  Challenges and Opportunities - Protocol Level\n  5.1.  Protocol Enablers for Carbon Optimization Mechanisms\n  5.2.  Protocol Optimization\n  5.3.  Data Volume Reduction\n  5.4.  Network Addressing\n6.  Challenges and Opportunities - Network Level\n  6.1.  Network Optimization and Energy/Carbon/Pollution-Aware\n        Networking\n  6.2.  Assessing Carbon Footprint and Network-Level\n        Instrumentation\n  6.3.  Dimensioning and Peak Shaving\n  6.4.  Convergence Schemes\n  6.5.  The Role of Topology\n7.  Challenges and Opportunities - Architecture Level\n8.  Conclusions\n9.  IANA Considerations\n10. Security Considerations\n11. Informative References\nAcknowledgments\nContributors\nAuthors' Addresses",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 0,
      "text": "1.1. Motivation",
      "section_title": true,
      "ja": "1.1. モチベーション"
    },
    {
      "indent": 3,
      "text": "Climate change and the need to curb greenhouse gas (GHG) emissions have been recognized by the United Nations and by most governments as one of the big challenges of our time. As a result, curbing those emissions is becoming increasingly important for society and for many industries. The networking industry is no exception.",
      "ja": "気候変動と温室効果ガス (GHG) 排出量を抑制する必要性は、現代の大きな課題の 1 つとして国連およびほとんどの政府によって認識されています。その結果、これらの排出量を抑制することは、社会や多くの産業にとってますます重要になっています。ネットワーク業界も例外ではありません。"
    },
    {
      "indent": 3,
      "text": "The science behind greenhouse gas emissions and their relationship with climate change is complex. However, there is overwhelming scientific consensus pointing toward a clear correlation between climate change and a rising amount of greenhouse gases in the atmosphere. When we say 'greenhouse gases' or GHG, we are referring to gases in the Earth's atmosphere that trap heat and contribute to the greenhouse effect. They include carbon dioxide (CO2), methane (CH4), nitrous oxide (N2O), and fluorinated gases (as covered under the Kyoto Protocol and Paris Agreement). In terms of emissions from human activity, the dominant greenhouse gas is carbon dioxide (CO2). CO2 is emitted in the process of burning fuels to generate energy that is used, for example, to power electrical devices such as networking equipment. Those fuels often include fossil fuels (such as oil), which releases CO2 that had long been removed from the earth's atmosphere, as opposed to the use of renewable or sustainable fuels that do not \"add\" to the amount of CO2 in the atmosphere. Other GHGs such as CH4 and N2O are associated with electricity generation as well. Although they are emitted in smaller quantities, they have an even higher Global Warming Potential (GWP). To facilitate accounting for them, they are collectively simply converted into CO2 equivalents (CO2e).",
      "ja": "温室効果ガスの排出と気候変動との関係の背後にある科学は複雑です。しかし、気候変動と大気中の温室効果ガスの量の増加との間には明確な相関関係があることを指摘する圧倒的な科学的コンセンサスが存在します。私たちが「温室効果ガス」または GHG と言うとき、熱を閉じ込めて温室効果に寄与する地球の大気中のガスを指します。これらには、二酸化炭素 (CO2)、メタン (CH4)、亜酸化窒素 (N2O)、およびフッ素化ガス (京都議定書およびパリ協定でカバーされている) が含まれます。人間の活動による排出という点では、主な温室効果ガスは二酸化炭素 (CO2) です。CO2 は、ネットワーク機器などの電気機器に電力を供給するために使用されるエネルギーを生成するために燃料を燃焼させる過程で排出されます。これらの燃料には、大気中の CO2 量を「増加」させない再生可能または持続可能な燃料の使用とは対照的に、化石燃料 (石油など) が含まれることが多く、地球の大気から長い間除去されていた CO2 を放出します。CH4 や N2O などの他の GHG も同様に発電に関係します。それらは排出量は少ないですが、地球温暖化係数 (GWP) はさらに高くなります。それらの計算を容易にするために、それらはまとめて単純に CO2 換算量 (CO2e) に変換されます。"
    },
    {
      "indent": 3,
      "text": "Greenhouse gas emissions are in turn correlated with the need to power technology, including networks. Reducing those emissions can be achieved by reducing the amount of fossil fuels needed to generate the energy that is needed to power those networks. This can be achieved by improving the energy mix to include increasing amounts of low-carbon and/or renewable (and hence sustainable) energy sources, such as wind or solar. It can also be achieved by increasing energy savings and improving energy efficiency so that the same outcomes are achieved while consuming less energy in the first place.",
      "ja": "温室効果ガスの排出量は、ネットワークを含む電力技術の必要性と相関しています。これらの排出量の削減は、ネットワークに電力を供給するために必要なエネルギーを生成するために必要な化石燃料の量を減らすことで達成できます。これは、エネルギーミックスを改善して、風力や太陽光などの低炭素および/または再生可能（したがって持続可能な）エネルギー源の量を増やすことで達成できます。また、エネルギーの節約を強化し、エネルギー効率を改善することによっても達成でき、最初のエネルギー消費量を減らしながら同じ結果が得られます。"
    },
    {
      "indent": 3,
      "text": "The amount of greenhouse gases that an activity adds to the atmosphere, such as CO2 that is emitted in burning fossil fuels to generate the required energy, is also referred to as the \"greenhouse footprint\" or the \"carbon footprint\" (accounting for greenhouse gases other than CO2 in terms of CO2 equivalents). Reducing this footprint to net zero is hence a major sustainability goal. However, sustainability encompasses other factors beyond carbon, such as the sustainable use of other natural resources, the preservation of natural habitats and biodiversity, and the avoidance of any form of pollution.",
      "ja": "必要なエネルギーを生成するために化石燃料で放出されるCO2など、アクティビティが大気に追加する温室効果ガスの量は、「温室フットプリント」または「炭素フットプリント」とも呼ばれます（CO2等価物以外の温室効果ガスを占める）。したがって、このフットプリントをNet Zeroに削減することは、主要な持続可能性の目標です。しかし、持続可能性には、他の天然資源の持続可能な使用、自然の生息地と生物多様性の保存、あらゆる形態の汚染の回避など、炭素以外の他の要因が含まれます。"
    },
    {
      "indent": 3,
      "text": "In the context of this document, we refer to networking technology that helps to improve its own networking sustainability as \"green\". Green, in that sense, includes technology that helps to lower networking's greenhouse gas emissions including the carbon footprint, which in turn includes technology that helps increase efficiency and realize energy savings as well as facilitates managing networks toward a stronger use of renewables.",
      "ja": "このドキュメントの文脈では、ネットワーク自体の持続可能性の向上に役立つネットワーク テクノロジを「グリーン」と呼びます。その意味で、グリーンには、二酸化炭素排出量を含むネットワークの温室効果ガス排出量の削減に役立つテクノロジーが含まれます。これには、効率の向上とエネルギー節約の実現に役立つだけでなく、再生可能エネルギーのより強力な利用に向けてネットワークの管理を容易にするテクノロジーも含まれます。"
    },
    {
      "indent": 3,
      "text": "Arguably, networks can already be considered a green technology in that networks enable many applications that allow users and whole industries to save energy and thus become environmentally more sustainable in a significant way. For example, they allow (at least to an extent) to substitute travel with teleconferencing. They enable many employees to work from home and telecommute, thus reducing the need for actual commuting. IoT applications that facilitate automated monitoring and control from remote sites help make agriculture more sustainable by minimizing the usage of water, fertilizer, and land. Networked smart buildings allow for greater energy optimization and sparser use of lighting and HVAC (heating, ventilation, air conditioning) than their non-networked, not-so-smart counterparts. That said, calculating precise benefits in terms of net sustainability contributions and savings is complex, as a holistic picture involves many effects including substitution effects (perhaps saving on emissions caused by travel but incurring additional costs associated with additional home office use) as well as behavioral changes (perhaps a higher number of meetings than if travel were involved).",
      "ja": "おそらくネットワークは、ユーザーや業界全体がエネルギーを節約し、大幅に環境をより持続可能にする多くのアプリケーションを可能にするという点で、すでにグリーン テクノロジーとみなすことができます。たとえば、（少なくともある程度は）旅行をテレビ会議に置き換えることができます。これにより、多くの従業員が在宅勤務や在宅勤務を行えるようになり、実際の通勤の必要性が軽減されます。遠隔サイトからの自動監視と制御を容易にする IoT アプリケーションは、水、肥料、土地の使用を最小限に抑えて農業をより持続可能なものにするのに役立ちます。ネットワーク化されたスマート ビルディングでは、ネットワーク化されていないスマート ビルディングに比べて、エネルギーの最適化がさらに強化され、照明と HVAC (暖房、換気、空調) の使用が少なくなります。とはいえ、サステナビリティへの正味の貢献と節約に関する正確な利益を計算することは複雑です。全体像には、代替効果（おそらく、旅行による排出量は削減されますが、ホームオフィスの使用量の増加に伴う追加コストが発生します）や行動の変化（おそらく旅行が関与した場合よりも会議の数が増える）など、多くの効果が含まれるからです。"
    },
    {
      "indent": 3,
      "text": "The IETF has recently initiated a reflection on the energy cost of hosting meetings three times a year (see [IETF-Net0]). It conducted a study of the carbon emissions of a typical meeting and found out that 99% of the emissions were due to air travel. In the same vein, [Framework] compared an in-person with a virtual meeting and found a reduction in energy of 66% for a virtual meeting. These findings confirm that networking technology can reduce emissions when acting as a virtual substitution for physical events.",
      "ja": "IETF は最近、年 3 回の会議開催にかかるエネルギーコストの検討を開始しました ([IETF-Net0] を参照)。典型的な会議における二酸化炭素排出量の調査を実施したところ、排出量の 99% が飛行機による移動によるものであることが判明しました。同様に、[Framework] は対面会議と仮想会議を比較し、仮想会議ではエネルギーが 66% 削減されることを発見しました。これらの調査結果は、ネットワーク技術が物理的イベントの仮想代替として機能する場合に排出量を削減できることを裏付けています。"
    },
    {
      "indent": 3,
      "text": "That said, networks themselves consume significant amounts of energy. Therefore, the networking industry has an important role to play in meeting sustainability goals, not just by enabling others to reduce their reliance on energy but also by reducing its own. Future networking advances will increasingly need to focus on becoming more energy efficient and reducing the carbon footprint, for reasons of both corporate responsibility and economics. This shift has already begun, and sustainability is becoming an important concern for network providers. In some cases, such as in the context of networked data centers, the ability to procure enough energy becomes a bottleneck, prohibiting further growth, and greater sustainability thus becomes a business necessity.",
      "ja": "とはいえ、ネットワーク自体は大量のエネルギーを消費します。したがって、ネットワーク業界は、他の企業がエネルギーへの依存を削減できるようにするだけでなく、自社のエネルギーへの依存も削減することで、持続可能性の目標を達成する上で重要な役割を果たします。将来のネットワークの進歩では、企業の責任と経済性の両方の理由から、エネルギー効率の向上と二酸化炭素排出量の削減にますます重点を置く必要があります。この変化はすでに始まっており、持続可能性はネットワークプロバイダーにとって重要な懸念事項となっています。場合によっては、ネットワーク化されたデータセンターなど、十分なエネルギーを調達する能力がボトルネックとなり、さらなる成長が妨げられ、持続可能性の向上がビジネスの必須条件となります。"
    },
    {
      "indent": 3,
      "text": "For example, in its annual report, Telefónica reports that in 2024, its network's energy consumption per petabyte (PB) of data amounted to 38 megawatt-hours (MWh) [Telefonica2024]. This represents an improvement of about 90% since the 2015 base year (400 MWh/PB), achieved through steady year-on-year efficiency gains, although these are still partly offset by simultaneous growth in data volume. The same report highlights an important corporate goal: continuing on this trajectory and further reducing overall greenhouse gas emissions.",
      "ja": "たとえば、年次報告書では、テレフォニカは2024年に、そのネットワークのペタバイトあたりのエネルギー消費量（PB）のデータが38メガワット時（MWH）[Telefonica2024]に相当したと報告しています。これは、2015年の基準年（400 MWH/PB）以降の約90％の改善を表しており、前年比で安定した効率の向上を通じて達成されますが、データ量の同時成長によって部分的に相殺されます。同じレポートは、重要な企業の目標を強調しています。この軌跡を継続し、さらに温室効果ガスの排出量をさらに削減します。"
    },
    {
      "indent": 0,
      "text": "1.2. Approaching the Problem",
      "section_title": true,
      "ja": "1.2. 問題にアプローチする"
    },
    {
      "indent": 3,
      "text": "One way in which gains in network sustainability can be achieved involves reducing the amount of energy needed to provide communication services and improving the efficiency with which networks utilize power during their use phase. However, for a holistic approach, other aspects need to be considered as well.",
      "ja": "ネットワークの持続可能性の利益を達成できる1つの方法は、コミュニケーションサービスを提供するために必要なエネルギーの量を減らし、使用段階でネットワークが電力を利用する効率を改善することです。ただし、全体的なアプローチのためには、他の側面も考慮する必要があります。"
    },
    {
      "indent": 3,
      "text": "The environmental footprint is not determined by energy consumption alone. The sustainability of power sources needs to be considered as well. A deployment that includes devices that are less energy efficient but powered by a sustainable energy source can arguably be considered greener than a deployment that includes highly efficient devices that are powered by diesel generators. In fact, in the same Telefónica report mentioned earlier, extensive reliance on renewable energy sources is emphasized.",
      "ja": "環境フットプリントはエネルギー消費量だけで決まるわけではありません。電源の持続可能性も考慮する必要があります。エネルギー効率は低いが、持続可能なエネルギー源によって電力供給されるデバイスを含む導入は、おそらく、ディーゼル発電機によって電力供給される高効率のデバイスを含む導入よりも環境に優しいと考えられます。実際、前述したテレフォニカの同じ報告書では、再生可能エネルギー源への広範な依存が強調されています。"
    },
    {
      "indent": 3,
      "text": "Similarly, deployments can take other environmental factors into account that affect the carbon footprint. For example, deployments where the need for cooling is reduced or where excessive heat generated by equipment can be put to a productive use will be considered greener than deployments where this is not the case. Examples include deployments in cooler natural surroundings (e.g., in colder climates) where that is an option. Likewise, manufacturing and recycling networking equipment are also part of the sustainability equation, as the production itself consumes energy and results in a carbon cost embedded as part of the device itself. Extending the lifetime of equipment may in many cases be preferable over replacing it earlier with equipment that is slightly more energy efficient, but that requires the embedded carbon cost to be amortized over a much shorter period of time.",
      "ja": "同様に、展開は、二酸化炭素排出量に影響を与える他の環境要因を考慮に入れることができます。たとえば、冷却の必要性が低下したり、機器によって生成される過度の熱を生産的に使用できる展開は、これが当てはまらない展開よりも環境に優しいと見なされます。例には、それがオプションであるより涼しい自然環境（寒い気候など）での展開が含まれます。同様に、生産自体がエネルギーを消費し、デバイス自体の一部として埋め込まれた炭素コストをもたらすため、製造およびリサイクルネットワーキング機器も持続可能性方程式の一部です。多くの場合、機器の寿命を延長することは、以前にエネルギー効率が高い機器に以前に置き換えることよりも好ましいかもしれませんが、それは埋め込まれた炭素コストをはるかに短い期間にわたって償却する必要があります。"
    },
    {
      "indent": 3,
      "text": "Network management has an outsized role to play in approaching those problems. To reduce the amount of energy used, network providers need to maximize the use of scarce resources and eliminate the use of resources that are not strictly needed. They need to optimize the way in which networks are deployed, which resources are placed where, and how equipment lifecycles and upgrades are being managed -- all of which constitute classic operational problems. As best practices, methods, and algorithms are developed, they need to be automated to the greatest extent possible, migrated over time into the network, and performed on increasingly short timescales, transcending management and control planes.",
      "ja": "ネットワーク管理は、これらの問題に対処する上で非常に大きな役割を果たします。エネルギーの使用量を削減するために、ネットワーク プロバイダーは希少なリソースを最大限に活用し、厳密に必要でないリソースの使用を排除する必要があります。ネットワークの展開方法、どのリソースをどこに配置するか、機器のライフサイクルとアップグレードの管理方法を最適化する必要があります。これらすべてが古典的な運用上の問題を構成します。ベスト プラクティス、手法、アルゴリズムが開発されるにつれて、それらは可能な限り自動化され、時間をかけてネットワークに移行され、管理プレーンやコントロール プレーンを超えて、ますます短いタイムスケールで実行される必要があります。"
    },
    {
      "indent": 0,
      "text": "1.3. Structuring the Problem Space",
      "section_title": true,
      "ja": "1.3. 問題空間の構造化"
    },
    {
      "indent": 3,
      "text": "From a technical perspective, multiple vectors along which networks can be made greener should be considered:",
      "ja": "技術的な観点から、ネットワークをより環境に優しいものにするための複数のベクトルを考慮する必要があります。"
    },
    {
      "indent": 6,
      "text": "* Equipment level:",
      "ja": "* 装備レベル:"
    },
    {
      "indent": 10,
      "text": "Perhaps the most promising vector for improving networking sustainability concerns the network equipment itself. At the most fundamental level, networks (even softwarized ones) involve appliances, i.e., equipment that relies on electrical power to perform its function. There are two distinct layers with different opportunities for improvement:",
      "ja": "おそらく、ネットワークの持続可能性を向上させるための最も有望なベクトルは、ネットワーク機器自体に関係します。最も基本的なレベルでは、ネットワーク (ソフトウェア化されたネットワークであっても) にはアプライアンス、つまり機能を実行するために電力に依存する機器が含まれます。改善の機会が異なる 2 つの異なる層があります。"
    },
    {
      "indent": 12,
      "text": "- Hardware: Reducing embedded carbon during material extraction and manufacturing; improving energy efficiency and reducing energy consumption during operations; and increasing reuse, repurposing, and recycling.",
      "ja": "- ハードウェア：材料の抽出および製造中に埋め込まれた炭素の削減。エネルギー効率の向上と、運用中のエネルギー消費の削減。再利用、再利用、リサイクルの増加。"
    },
    {
      "indent": 12,
      "text": "- Software: Improving software energy efficiency, maximizing utilization of processing devices, and allowing for software to interact with hardware to improve sustainability.",
      "ja": "- ソフトウェア：ソフトウェアのエネルギー効率を改善し、処理デバイスの利用を最大化し、ソフトウェアがハードウェアと対話して持続可能性を向上させることができます。"
    },
    {
      "indent": 10,
      "text": "Beyond making network appliances merely more energy efficient, there are other important ways in which equipment can help networks become greener. This includes aspects such as supporting port power-saving modes or down-speeding links to reduce power consumption for resources that are not fully utilized. To fully tap into the potential of such features requires accompanying management functionality, for example to determine when it is \"safe\" to down-speed a link or enter a power saving mode, and operate the network in such a way that conditions to do so are maximized.",
      "ja": "ネットワークアプライアンスを単にエネルギー効率を高めるだけでなく、機器がネットワークがより環境に優しいのに役立つ他の重要な方法があります。これには、ポート電源モードのサポートやダウンスピードリンクなどの側面が含まれ、十分に活用されていないリソースの消費電力を削減します。このような機能の可能性を完全に活用するには、たとえば、リンクをダウンスピードしたり、電力保存モードに入力するのが「安全」であるかを判断し、条件が最大化されるようにネットワークを操作するために、管理機能が付随する必要があります。"
    },
    {
      "indent": 10,
      "text": "Most importantly, from a management perspective, improving sustainability at the equipment level involves providing management instrumentation that allows for precise monitoring and managing power usage and doing so at different levels of granularity, for example, accounting separately for the contributions of CPU, memory, and different ports. This enables (for example) controller applications to optimize energy usage across the network and to leverage control loops to assess the effectiveness (e.g., in terms of reducing power use) of the measures that are taken.",
      "ja": "最も重要なことは、管理の観点から、機器レベルでの持続可能性を改善するには、正確な監視と電力使用量の管理を可能にする管理手段を提供し、たとえばCPU、メモリ、およびさまざまなポートの貢献について別々に会計処理することができます。これにより、（たとえば）コントローラーアプリケーションがネットワーク全体でエネルギー使用量を最適化し、コントロールループを活用して、実行される測定の有効性（電力使用量の削減という点で）を評価することができます。"
    },
    {
      "indent": 10,
      "text": "As a side note, the terms \"device\" and \"equipment\", as used in the context of this document, are used to refer to networking equipment. We are not taking into consideration end-user devices and endpoints such as mobile phones or computing equipment.",
      "ja": "補足として、このドキュメントの文脈で使用される「デバイス」および「機器」という用語は、ネットワーク機器を指すために使用されます。携帯電話やコンピューティング機器などのエンドユーザー デバイスやエンドポイントは考慮されていません。"
    },
    {
      "indent": 6,
      "text": "* Protocol level:",
      "ja": "* プロトコルレベル："
    },
    {
      "indent": 10,
      "text": "Energy-efficiency and \"greenness\" are aspects that are rarely considered when designing network protocols. This suggests that there may be plenty of untapped potential. Some aspects involve designing protocols in ways that reduce the need for redundant or wasteful transmission of data, allowing not only for better network utilization but for greater goodput per unit of energy being consumed. Techniques might include approaches that reduce the \"header tax\" incurred by payloads as well as methods resulting in the reduction of wasteful retransmissions. Similarly, there may be cases where chattiness of protocols may be preventing equipment from going into sleep mode. Designing protocols that reduce chattiness in such scenarios, for example, that reduce dependence on periodic updates or heartbeats, may result in greener outcomes. Likewise, aspects such as restructuring addresses in ways that minimize the size of lookup tables, associated memory sizes, and hence energy use, can play a role as well.",
      "ja": "エネルギー効率と「グリーン性」は、ネットワーク プロトコルを設計するときにほとんど考慮されない側面です。これは、未開発の可能性がたくさんある可能性があることを示唆しています。一部の側面には、冗長または無駄なデータ送信の必要性を減らす方法でプロトコルを設計することが含まれ、これにより、ネットワークの利用率が向上するだけでなく、消費されるエネルギーの単位あたりの利益も向上します。技術には、ペイロードによって発生する「ヘッダー税」を削減するアプローチや、無駄な再送信を削減する方法が含まれる場合があります。同様に、プロトコルのおしゃべりが原因で機器がスリープ モードに移行できない場合もあります。このようなシナリオでのおしゃべり性を減らすプロトコル (たとえば、定期的な更新やハートビートへの依存を減らすプロトコル) を設計すると、より環境に優しい結果が得られる可能性があります。同様に、ルックアップ テーブルのサイズ、関連するメモリ サイズ、ひいてはエネルギー使用量を最小限に抑える方法でアドレスを再構築するなどの側面も役割を果たす可能性があります。"
    },
    {
      "indent": 10,
      "text": "Another role of protocols concerns the enabling of management functionality to improve energy efficiency at the network level, such as discovery protocols that allow for quick adaptation to network components being taken dynamically into and out of service depending on network conditions, as well as protocols that can assist with functions such as the collection of energy telemetry data from the network.",
      "ja": "プロトコルのもう 1 つの役割は、ネットワーク レベルでのエネルギー効率を向上させるための管理機能の有効化に関するものです。たとえば、ネットワークの状態に応じて動的にサービスに投入されたりサービスから外されたりするネットワーク コンポーネントに迅速に適応できるディスカバリ プロトコルや、ネットワークからのエネルギー テレメトリ データの収集などの機能を支援できるプロトコルなどです。"
    },
    {
      "indent": 6,
      "text": "* Network level:",
      "ja": "* ネットワークレベル:"
    },
    {
      "indent": 10,
      "text": "Perhaps the greatest opportunities to realize power savings exist at the level of the network as whole. Many of these opportunities are directly related to management functionality. For example, optimizing energy efficiency may involve directing traffic in such a way that it allows the isolation of equipment that might not be needed at certain moments so that it can be powered down or brought into power-saving mode. By the same token, traffic should be directed in a way that requires bringing additional equipment online or out of power-saving mode in cases where alternative traffic paths are available for which the incremental energy cost would amount to zero. Likewise, some networking devices may have a lower sustainability rating, be less energy-efficient, or be powered less-sustainable energy sources than others. Their use might be avoided except during periods of peak capacity demands. Generally, incremental carbon emissions can be viewed as a cost metric that networks should strive to minimize and consider as part of routing and network path optimization.",
      "ja": "おそらく、省電力を実現する最大のチャンスは、ネットワーク全体のレベルに存在します。これらの機会の多くは、管理機能に直接関連しています。たとえば、エネルギー効率の最適化には、特定の瞬間に不要になる可能性のある機器を分離して、電源をオフにしたり省電力モードに移行したりできるような方法でトラフィックを方向付けることが含まれる場合があります。同様に、増分エネルギーコストがゼロになる代替トラフィック パスが利用可能な場合には、追加の機器をオンラインにするか、省電力モードを解除する必要がある方法でトラフィックを誘導する必要があります。同様に、一部のネットワーキング デバイスは、他のデバイスよりも持続可能性の評価が低く、エネルギー効率が低く、持続可能性の低いエネルギー源を使用している場合があります。容量需要のピーク時を除いて、その使用は避けられる可能性があります。一般に、二酸化炭素排出量の増加は、ネットワークが最小限に抑えるよう努力し、ルーティングとネットワーク パスの最適化の一環として考慮すべきコストの指標とみなすことができます。"
    },
    {
      "indent": 6,
      "text": "* Architecture level:",
      "ja": "* アーキテクチャレベル:"
    },
    {
      "indent": 10,
      "text": "The current network architecture supports a wide range of applications but does not consider energy efficiency as one of its design parameters. One can argue that the most energy efficient shift of the last two decades has been the deployment of Content Delivery Network overlays: while these were set up to reduce latency and minimize bandwidth consumption, from a network perspective, retrieving the content from a local cache is also much greener. What other architectural shifts can produce energy consumption reduction?",
      "ja": "現在のネットワーク アーキテクチャは幅広いアプリケーションをサポートしていますが、エネルギー効率は設計パラメータの 1 つとして考慮されていません。過去 20 年間で最もエネルギー効率の高い変化は、コンテンツ配信ネットワーク オーバーレイの導入であると主張できます。これらは、遅延を削減し、帯域幅の消費を最小限に抑えるために設定されましたが、ネットワークの観点から見ると、ローカル キャッシュからコンテンツを取得することもはるかに環境に優しいものです。他にどのようなアーキテクチャの変更によってエネルギー消費量の削減を実現できますか?"
    },
    {
      "indent": 3,
      "text": "In this document, we will explore each of those vectors in further detail and attempt to articulate specific challenges that could make a difference when addressed. As our starting point, we borrow some material from \"Challenges and Opportunities in Green Networking\" [GreenNet22]. For this document, this material has been both expanded (for example, in terms of some of the opportunities) and pruned (for example, in terms of background on prior scholarly work).",
      "ja": "この文書では、これらのベクトルのそれぞれをさらに詳しく調査し、対処することで変化をもたらす可能性がある具体的な課題を明確にしようとします。出発点として、「グリーン ネットワーキングにおける課題と機会」[GreenNet22] から資料を借用します。この文書では、この資料は（たとえば、いくつかの機会に関して）拡張され、（たとえば、以前の学術研究の背景に関して）削除されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Network Management Research Group (NMRG) of the Internet Research Task Force (IRTF). This document reflects the consensus of the research group and was discussed and presented multiple times, each time receiving positive feedback and no objections. It is not a candidate for any level of Internet Standard and is published for informational purposes.",
      "ja": "このドキュメントは、インターネット研究タスクフォース（IRTF）のネットワーク管理研究グループ（NMRG）の製品です。このドキュメントは、研究グループのコンセンサスを反映しており、肯定的なフィードバックを受け取って異議を唱えないたびに議論および提示されました。インターネット標準のレベルの候補者ではなく、情報目的で公開されています。"
    },
    {
      "indent": 0,
      "text": "2. Definitions and Acronyms",
      "section_title": true,
      "ja": "2. 定義と頭字語"
    },
    {
      "indent": 3,
      "text": "Below you find acronyms used in this document:",
      "ja": "以下に、このドキュメントで使用されている頭字語があります。"
    },
    {
      "indent": 3,
      "text": "Carbon Footprint:",
      "ja": "二酸化炭素排出量:"
    },
    {
      "indent": 12,
      "text": "As used in this document, the amount of carbon emissions associated with the use or deployment of technology, usually correlated with the amount of energy consumption",
      "ja": "この文書で使用されているように、テクノロジーの使用または展開に関連する炭素排出量は、通常、エネルギー消費量と相関しています。"
    },
    {
      "indent": 3,
      "text": "CDN:",
      "ja": "CDN:"
    },
    {
      "indent": 12,
      "text": "Content Delivery Network",
      "ja": "コンテンツ配信ネットワーク"
    },
    {
      "indent": 3,
      "text": "CPU:",
      "ja": "CPU:"
    },
    {
      "indent": 12,
      "text": "Central Processing Unit (that is, the main processor in a server)",
      "ja": "中央処理ユニット（つまり、サーバー内のメインプロセッサ）"
    },
    {
      "indent": 3,
      "text": "DC:",
      "ja": "DC:"
    },
    {
      "indent": 12,
      "text": "Data Center",
      "ja": "データセンター"
    },
    {
      "indent": 3,
      "text": "FCT:",
      "ja": "FCT:"
    },
    {
      "indent": 12,
      "text": "Flow Completion Time",
      "ja": "フロー完了時間"
    },
    {
      "indent": 3,
      "text": "GHG:",
      "ja": "GHG:"
    },
    {
      "indent": 12,
      "text": "Greenhouse Gas",
      "ja": "温室効果ガス"
    },
    {
      "indent": 3,
      "text": "GPU:",
      "ja": "GPU:"
    },
    {
      "indent": 12,
      "text": "Graphical Processing Unit",
      "ja": "グラフィカル処理ユニット"
    },
    {
      "indent": 3,
      "text": "HVAC:",
      "ja": "HVAC："
    },
    {
      "indent": 12,
      "text": "Heating, Ventilation, Air Conditioning",
      "ja": "暖房、換気、エアコン"
    },
    {
      "indent": 3,
      "text": "ICN:",
      "ja": "ICN:"
    },
    {
      "indent": 12,
      "text": "Information-Centric Network",
      "ja": "情報中心のネットワーク"
    },
    {
      "indent": 3,
      "text": "IGP:",
      "ja": "IGP:"
    },
    {
      "indent": 12,
      "text": "Interior Gateway Protocol",
      "ja": "インテリアゲートウェイプロトコル"
    },
    {
      "indent": 3,
      "text": "IoT:",
      "ja": "IoT:"
    },
    {
      "indent": 12,
      "text": "Internet of Things",
      "ja": "モノのインターネット"
    },
    {
      "indent": 3,
      "text": "LEED:",
      "ja": "リード："
    },
    {
      "indent": 12,
      "text": "Leadership in Energy and Environmental Design (a green building rating system)",
      "ja": "エネルギーと環境設計におけるリーダーシップ (グリーンビルディング評価システム)"
    },
    {
      "indent": 3,
      "text": "LEO:",
      "ja": "LEO:"
    },
    {
      "indent": 12,
      "text": "Low Earth Orbit",
      "ja": "低い地球軌道"
    },
    {
      "indent": 3,
      "text": "LPM:",
      "ja": "LPM:"
    },
    {
      "indent": 12,
      "text": "Longest Prefix Match (a method to look up prefixes in a forwarding element)",
      "ja": "最長プレフィックス マッチ (転送要素内のプレフィックスを検索する方法)"
    },
    {
      "indent": 3,
      "text": "MPLS:",
      "ja": "MPLS："
    },
    {
      "indent": 12,
      "text": "Multiprotocol Label Switching",
      "ja": "マルチプロトコルラベルスイッチング"
    },
    {
      "indent": 3,
      "text": "MTU:",
      "ja": "MTU:"
    },
    {
      "indent": 12,
      "text": "Maximum Transmission Unit (the largest packet size that can be transmitted over a network)",
      "ja": "最大送信単位 (ネットワーク上で送信できる最大パケット サイズ)"
    },
    {
      "indent": 3,
      "text": "NIC:",
      "ja": "NIC:"
    },
    {
      "indent": 12,
      "text": "Network Interface Card",
      "ja": "ネットワークインターフェースカード"
    },
    {
      "indent": 3,
      "text": "QoE:",
      "ja": "QoE:"
    },
    {
      "indent": 12,
      "text": "Quality of Experience",
      "ja": "エクスペリエンスの質"
    },
    {
      "indent": 3,
      "text": "QoS:",
      "ja": "QoS:"
    },
    {
      "indent": 12,
      "text": "Quality of Service",
      "ja": "サービスの品質"
    },
    {
      "indent": 3,
      "text": "QUIC:",
      "ja": "quic："
    },
    {
      "indent": 12,
      "text": "the name of a UDP-based, stream-multiplexing, encrypted transport protocol [RFC9000].",
      "ja": "UDP ベースのストリーム多重化暗号化トランスポート プロトコルの名前 [RFC9000]。"
    },
    {
      "indent": 3,
      "text": "SDN:",
      "ja": "SDN:"
    },
    {
      "indent": 12,
      "text": "Software-Defined Networking",
      "ja": "ソフトウェア定義のネットワーク"
    },
    {
      "indent": 3,
      "text": "TCP:",
      "ja": "TCP:"
    },
    {
      "indent": 12,
      "text": "Transport Control Protocol",
      "ja": "トランスポート制御プロトコル"
    },
    {
      "indent": 3,
      "text": "TE:",
      "ja": "TE:"
    },
    {
      "indent": 12,
      "text": "Traffic Engineering",
      "ja": "交通工学"
    },
    {
      "indent": 3,
      "text": "TPU:",
      "ja": "TPU:"
    },
    {
      "indent": 12,
      "text": "Tensor Processing Unit",
      "ja": "テンソル処理ユニット"
    },
    {
      "indent": 3,
      "text": "WAN:",
      "ja": "WAN:"
    },
    {
      "indent": 12,
      "text": "Wide Area Network",
      "ja": "ワイドエリアネットワーク"
    },
    {
      "indent": 0,
      "text": "3. Network Energy Consumption Characteristics and Implications",
      "section_title": true,
      "ja": "3. ネットワークエネルギー消費の特性と意味"
    },
    {
      "indent": 3,
      "text": "The carbon footprint and, with it, greenhouse gas emissions are determined by several factors. A main factor is network energy consumption, as the energy consumed can be considered a proxy for the burning of fuels required for corresponding power generation. Network energy consumption by itself does not tell the whole story, as it does not take the sustainability of energy sources and the energy mix into account. Likewise, there are other factors such as the carbon cost expended in the manufacturing of networking hardware. Nonetheless, network energy consumption is an excellent predictor of a carbon footprint and its reduction, which is key to sustainable solutions. Hence, exploring possibilities to improve energy efficiency is a key factor for greener, more sustainable, less carbon-intensive networks.",
      "ja": "二酸化炭素排出量とそれに伴う温室効果ガス排出量は、いくつかの要因によって決まります。主な要因はネットワークのエネルギー消費です。消費されるエネルギーは、対応する発電に必要な燃料の燃焼の代用と考えることができるためです。ネットワークのエネルギー消費だけでは、エネルギー源とエネルギー構成の持続可能性が考慮されていないため、全体像を伝えることはできません。同様に、ネットワーク ハードウェアの製造に費やされる炭素コストなど、他の要因もあります。それにもかかわらず、ネットワークのエネルギー消費は二酸化炭素排出量とその削減を予測する優れた指標であり、持続可能なソリューションの鍵となります。したがって、エネルギー効率を向上させる可能性を探ることは、より環境に優しく、より持続可能で、炭素集約度の低いネットワークを実現するための重要な要素となります。"
    },
    {
      "indent": 3,
      "text": "It is important to understand some of the characteristics of power consumption by networks and which aspects contribute the most. This helps to identify where the greatest potential is, not just for power savings but also for sustainability improvements.",
      "ja": "ネットワークによる消費電力の特性のいくつかを理解することと、どの側面が最も貢献するかを理解することが重要です。これは、最大の可能性がどこにあるかを特定するのに役立ちます。これは、発電の節約だけでなく、持続可能性の改善のためでもあります。"
    },
    {
      "indent": 3,
      "text": "Power is ultimately drawn by devices. Devices are not monoliths but are composed of multiple components. The power consumption of the device can be divided into the consumption of the core device -- the backplane and CPU, if you will -- as well as additional consumption incurred per port and line card. In addition, the GPU and TPU may be used in the network and may have different power consumption profiles. Furthermore, it is important to understand the difference between power consumption when a resource is idling versus when it is under load. This helps to understand the incremental cost of additional transmission versus the initial cost of transmission.",
      "ja": "電源は最終的にデバイスによって描画されます。デバイスはモノリスではありませんが、複数のコンポーネントで構成されています。デバイスの消費電力は、コアデバイスの消費（バックプレーンとCPU）に分割することができます。さらに、GPUとTPUはネットワークで使用される場合があり、異なる消費電力プロファイルを持つ場合があります。さらに、リソースがアイドリングしているときと負荷がかかっている場合と、電力消費の違いを理解することが重要です。これにより、追加の送信の増分と伝送の初期コストを理解するのに役立ちます。"
    },
    {
      "indent": 3,
      "text": "In typical networking devices, only roughly half of the energy consumption is associated with the data plane [Bolla2011energy]. An idle base system typically consumes more than half of the energy that the same system would consume when running at full load [Chabarek08] [Cervero15]. Generally, the cost of sending the first bit is very high, as it requires powering up a device, port, etc. The incremental energy cost of transmission of additional bits (beyond the first) is many orders of magnitude lower. Likewise, the incremental cost of the incremental CPU and memory needed to process additional packets becomes fairly negligible.",
      "ja": "一般的なネットワーク デバイスでは、データ プレーンに関連するエネルギー消費はおよそ半分だけです [Bolla2011energy]。通常、アイドル状態のベース システムは、同じシステムが全負荷で動作しているときに消費するエネルギーの半分以上を消費します [Chabarek08] [Cervero15]。一般に、最初のビットの送信コストは、デバイスやポートなどの電源をオンにする必要があるため、非常に高くなります。(最初のビットを超えた) 追加ビットの送信の増分エネルギー コストは、何桁も低くなります。同様に、追加のパケットを処理するために必要な CPU とメモリの追加コストもかなり無視できます。"
    },
    {
      "indent": 3,
      "text": "This means that a device's energy consumption does not increase linearly with the volume of forwarded traffic. Instead, it resembles a step function in which energy consumption stays roughly the same up to a certain volume of traffic, followed by a sudden jump when additional resources need to be procured to support a higher volume of traffic.",
      "ja": "これは、デバイスのエネルギー消費量が転送されたトラフィックの量で直線的に増加しないことを意味します。代わりに、エネルギー消費が特定の量のトラフィックまでほぼ同じままであるというステップ関数に似ています。その後、大量のトラフィックをサポートするために追加のリソースを調達する必要があるときに突然ジャンプします。"
    },
    {
      "indent": 3,
      "text": "By the same token, it is generally more energy efficient to transmit a large volume of data in one burst (and subsequently turn off or down-speed the interface when idling) than to continuously transmit at a lower rate. In that sense, it can be the duration of the transmission that dominates the energy consumption -- not the actual data rate.",
      "ja": "同様に、一般に、大量のデータを 1 回のバーストで送信する (その後、アイドリング時にインターフェイスをオフにするか速度を下げる) 方が、低速で継続的に送信するよりもエネルギー効率が高くなります。その意味で、エネルギー消費を支配するのは実際のデータ レートではなく、送信時間である可能性があります。"
    },
    {
      "indent": 3,
      "text": "The implications on green networking from an energy-savings standpoint are significant. Of utmost importance are schemes that allow for \"peak shaving\": networks are typically dimensioned for periods of peak demand and usage, yet any excess capacity during periods of non-peak usage does not result in corresponding energy savings. Peak shaving techniques that reduce peak traffic spikes and waste during non-peak periods may result in outsize sustainability gains. Peak shaving could be accomplished by techniques such as spreading spikes out over geographies (e.g., routing traffic across more costly but less utilized routes) or over time (e.g., postponing and buffering non-urgent traffic).",
      "ja": "エネルギー節約の観点からのグリーンネットワーキングへの影響は重要です。最も重要なのは、「ピークシェービング」を可能にするスキームです。ネットワークは通常、ピークの需要と使用量の期間に寸法がありますが、非ピーク使用期間中の過剰な容量は、対応するエネルギー節約につながりません。ピークのトラフィックスパイクと廃棄物を非ピーク期間に削減するピークシェービングテクニックは、異なる持続可能性の向上をもたらす可能性があります。ピークシェービングは、地域にスパイクを広めるなどの技術（たとえば、よりコストがかかりますが使用されていないルートを横切るトラフィックをルーティングする）または時間の経過とともに（例えば、緊急のトラフィックを延期してバッファリングするなど）などの技術によって達成できます。"
    },
    {
      "indent": 3,
      "text": "Likewise, large gains can be made whenever network resources can effectively be taken offline for at least some of the time, managing networks in a way that enables resources to be removed from service so they can be powered down (or put into a more energy-saving state, such as when down-speeding ports) while not needed. Of course, any such methods need to take into account the overhead of taking resources offline and bringing them back online. This typically takes some amount of time, requiring accurate predictive capabilities to avoid situations in which network resources are not available at times when they would be needed. In addition, there is additional overhead, such as synchronization of state, to be accounted for.",
      "ja": "同様に、ネットワークリソースを少なくとも一部の時間オフラインにすることができる場合はいつでも大きな利益を上げることができ、リソースをサービスから削除できるようにネットワークを管理して、必要ではないが、ダウンスピードポートの場合など、より省エネ状態に入れることができます）。もちろん、このような方法では、リソースをオフラインにしてオンラインに戻すというオーバーヘッドを考慮する必要があります。通常、これにはある程度の時間がかかり、ネットワークリソースが必要な場合に使用できない状況を回避するために正確な予測機能が必要です。さらに、説明する状態の同期など、追加のオーバーヘッドがあります。"
    },
    {
      "indent": 3,
      "text": "At the same time, any non-idle resources should be utilized to the greatest extent possible, as the incremental energy cost is negligible. Of course, this needs to occur while still taking other operational goals into consideration, such as protection against failures (allowing for readily available redundancy and spare capacity in case of failure) and load balancing (for increased operational robustness). As data transmission needs tend to fluctuate wildly and occur in bursts, any optimization schemes need to be highly adaptable and allow control loops at very fast time scales.",
      "ja": "同時に、インクリメンタルエネルギーコストは無視できるため、アイドル以外のリソースは可能な限り最大限に活用する必要があります。もちろん、これは、障害に対する保護（障害の場合に容易に利用可能な冗長性と予備の容量を可能にする）や負荷分散（運用の堅牢性の向上）など、他の運用目標を考慮しながら発生する必要があります。データ送信のニーズは乱暴に変動し、バーストで発生する傾向があるため、最適化スキームは非常に順応性が高く、非常に高速な時間スケールで制御ループを可能にする必要があります。"
    },
    {
      "indent": 3,
      "text": "Similarly, for applications where this is possible, it may be desirable to replace continuous traffic at low data rates with traffic that is sent in bursts at high data rates in order to potentially maximize the time during which resources can be idled.",
      "ja": "同様に、これが可能なアプリケーションの場合、低データレートでの継続的なトラフィックを、リソースをアイドリングできる時間を最大化するために、高いデータレートでバーストで送信されるトラフィックに送られるトラフィックに置き換えることが望ましい場合があります。"
    },
    {
      "indent": 3,
      "text": "As a result, emphasis needs to be placed on technology that enables, for example, very efficient and rapid discovery, monitoring, and control of networking resources. This allows devices to be dynamically taken offline or brought back online without extensive network-level state convergence, route recalculation, or other complex optimizations at the network level. To facilitate such schemes, rapid power cycle and initialization schemes should be supported at the device level. There may be some lessons that can be applied here from IoT, which has long had to contend with power-constrained end devices that need to spend much of their time in power-saving states to conserve battery.",
      "ja": "その結果、非常に効率的かつ迅速な発見、監視、およびネットワーキングリソースの制御を可能にするテクノロジーに重点を置く必要があります。これにより、デバイスは、ネットワークレベルでの広範なネットワークレベルの状態収束、ルートの再計算、またはその他の複雑な最適化なしに、デバイスをオフラインで動的に採用したり、オンラインに戻すことができます。このようなスキームを促進するには、デバイスレベルで急速なパワーサイクルと初期化スキームをサポートする必要があります。ここでは、IoTから適用できるレッスンがいくつかある場合があります。これは、バッテリーを節約するために電力節約状態で多くの時間を費やす必要がある電力制約のエンドデバイスと長い間争わなければなりませんでした。"
    },
    {
      "indent": 0,
      "text": "4. Challenges and Opportunities - Equipment Level",
      "section_title": true,
      "ja": "4. 課題と機会 - 装備レベル"
    },
    {
      "indent": 3,
      "text": "We are categorizing challenges and opportunities to improve sustainability at the network equipment level along the following lines:",
      "ja": "次の行に沿って、ネットワーク機器レベルでの持続可能性を改善するための課題と機会を分類しています。"
    },
    {
      "indent": 6,
      "text": "* Hardware and manufacturing: Related opportunities are arguably among the most obvious and perhaps \"largest\". However, solutions here lie largely outside the scope of networking researchers.",
      "ja": "* ハードウェアと製造: 関連する機会はおそらく最も明白で、おそらく「最大」のものの 1 つです。ただし、ここでの解決策は、ネットワーキング研究者の範囲を大きく超えています。"
    },
    {
      "indent": 6,
      "text": "* Visibility and instrumentation: Instrumenting equipment to provide visibility into how they consume energy is key to management solutions and control loops to facilitate optimization schemes.",
      "ja": "* 可視性と計装：エネルギーを消費する方法を可視化するための機器の機器は、管理ソリューションの鍵であり、最適化スキームを容易にするためにループを制御します。"
    },
    {
      "indent": 0,
      "text": "4.1. Hardware and Manufacturing",
      "section_title": true,
      "ja": "4.1. ハードウェアと製造"
    },
    {
      "indent": 3,
      "text": "Perhaps the most obvious opportunities to make networking technology more energy efficient exist at the equipment level. After all, networking involves physical equipment to receive and transmit data. Making such equipment more power efficient, having it dissipate less heat to consume less energy and reduce the need for cooling, sourcing sustainable materials, and facilitating the recycling of equipment at the end of its lifecycle all contribute to making networks greener. Reducing the energy usage of transmission technology, from wireless (antennas) to optical (lasers), is a strategy that is unique to networking.",
      "ja": "おそらく、ネットワーキングテクノロジーをよりエネルギー効率を高めるための最も明白な機会は、機器レベルで存在します。結局のところ、ネットワーキングには、データを受信および送信する物理的な機器が含まれます。このような機器をより効率的にするために、より少ない熱を消費してエネルギーを消費し、冷却の必要性を減らし、持続可能な材料を調達し、ライフサイクルの終わりに機器のリサイクルを促進することは、ネットワークの環境に貢献します。ワイヤレス（アンテナ）から光学（レーザー）まで、トランスミッションテクノロジーのエネルギー使用量を削減することは、ネットワークに固有の戦略です。"
    },
    {
      "indent": 3,
      "text": "One critical aspect of the energy cost of networking is the cost to manufacture and deploy the networking equipment. In addition, even the development process itself comes with its own carbon footprint. This is outside of the scope of this document: we only consider the energy cost of running the network during the operational part of the equipment's lifecycle. However, a holistic approach would include the embedded energy that is included in the networking equipment. As part of this, aspects such as the impact of deploying new protocols on the rate of obsolescence of existing equipment should be considered. For instance, incremental approaches that do not require replacing equipment right away -- or even that extend the lifetime of deployed equipment -- would have a lower carbon footprint. This is one important benefit also of technologies such as Software-Defined Networking and network function virtualization, as they may allow support for new networking features through software updates without requiring hardware replacements.",
      "ja": "ネットワーキングのエネルギーコストの重要な側面の1つは、ネットワーキング機器を製造および展開するコストです。さらに、開発プロセス自体にも独自の二酸化炭素排出量が付いています。これは、このドキュメントの範囲外です。機器のライフサイクルの運用部分中にネットワークを実行するエネルギーコストのみを考慮します。ただし、全体的なアプローチには、ネットワーキング機器に含まれる埋め込みエネルギーが含まれます。この一部として、既存の機器の陳腐化率に対する新しいプロトコルを展開することの影響などの側面を考慮する必要があります。たとえば、すぐに機器の交換を必要としない増分アプローチ、または展開された機器の寿命を延ばすことで、二酸化炭素排出量が少なくなります。これは、ハードウェアの交換を必要とせずにソフトウェアの更新を通じて新しいネットワーク機能のサポートを可能にする可能性があるため、ソフトウェア定義のネットワークやネットワーク機能仮想化などのテクノロジーの重要な利点の1つです。"
    },
    {
      "indent": 3,
      "text": "[Emergy] describes an attempt to compute not only the energy of running a network but also the energy embedded into manufacturing the equipment. This is denoted by \"emergy\", a portmanteau for embedded energy. Likewise, [Junkyard] describes an approach to recycling equipment and a proof of concept using old mobile phones recycled into a \"junkyard\" data center.",
      "ja": "[Emergy]は、ネットワークを実行するエネルギーだけでなく、機器の製造に埋め込まれたエネルギーを計算しようとする試みについて説明しています。これは、埋め込まれたエネルギーのポルトマントーである「エネルギー」で示されています。同様に、[Junkyard]は、機器をリサイクルするアプローチと、古い携帯電話を使用した「Junkyard」データセンターに使用した概念実証について説明しています。"
    },
    {
      "indent": 3,
      "text": "One trade-off to consider at this level is the selection of a platform that can be hardware-optimized for energy efficiency versus a platform that is versatile and can run multiple functions. For instance, a switch could run on an efficient hardware platform or run as a software module (container) over some multipurpose platform. While the first one is operationally more energy efficient, it may have a higher embedded energy from a smaller scale, a less efficient production process, as well as a shorter shelf life once new functions need to be added to the platform.",
      "ja": "このレベルで考慮すべきトレードオフの 1 つは、エネルギー効率を高めるためにハードウェアを最適化できるプラットフォームを選択するか、多用途で複数の機能を実行できるプラットフォームを選択するかです。たとえば、スイッチは効率的なハードウェア プラットフォーム上で実行することも、何らかの多目的プラットフォーム上でソフトウェア モジュール (コンテナ) として実行することもできます。1 つ目の方法は運用上エネルギー効率が高いですが、小規模でより高いエネルギーが組み込まれ、生産プロセスの効率が低くなり、プラットフォームに新しい機能を追加する必要がある場合、保存期間が短くなる可能性があります。"
    },
    {
      "indent": 0,
      "text": "4.2. Visibility and Instrumentation",
      "section_title": true,
      "ja": "4.2. 可視性と計装"
    },
    {
      "indent": 3,
      "text": "Beyond \"first-order\" opportunities, as outlined in Section 4.1, network equipment just as importantly plays a role in enabling and supporting green networking at other levels. Of prime importance is the equipment's ability to provide visibility to the management and control planes into its current energy usage. Such visibility enables control loops for energy optimization schemes, allowing applications to obtain feedback regarding the energy implications of their actions, from setting up paths across the network that require the least incremental amount of energy to quantifying metrics related to energy cost to optimize forwarding decisions. Absent an actual measurement of energy usage (and until such measurement is put in place), the network equipment could advertise some proxy of its power consumption. For example, it could use a labeling scheme of silver, gold, or platinum similar to the LEED sustainability metric in building codes, or the Energy Star label in home appliances, or a description of the type of the device as using CPU vs. GPU vs. TPU processors with different power profiles.",
      "ja": "セクション4.1で概説されているように、「一次」の機会を超えて、ネットワーク機器は、他のレベルでのグリーンネットワーキングを可能にし、サポートする上で役割を果たしています。主に重要なのは、機器が管理機を現在のエネルギー使用量に把握し、制御する能力を備えていることです。このような可視性により、エネルギー最適化スキームの制御ループが可能になり、アプリケーションがアクションのエネルギーへの影響に関するフィードバックを得ることができます。これは、最小限のエネルギー量のエネルギーを必要とするネットワーク全体のパスのセットアップから、転送コストに関連するエネルギーコストに関連するメトリックを定量化することです。エネルギー使用量の実際の測定がなければ（およびそのような測定が導入されるまで）、ネットワーク機器はその消費電力のプロキシを宣伝することができます。たとえば、建築基準のLEEDサステナビリティメトリックと同様の銀、金、またはプラチナのラベルスキーム、または家電製品のエネルギースターラベル、または異なるパワープロファイルを持つCPU対GPU対TPUプロセッサを使用しているデバイスのタイプの説明を使用できます。"
    },
    {
      "indent": 3,
      "text": "One prerequisite to such schemes is to have proper instrumentation in place that allows for monitoring current power consumption at the level of networking devices as a whole, line cards, and individual ports. Such instrumentation should also allow for assessing the energy efficiency and carbon footprint of the device as a whole. In addition, it will be desirable to relate this power consumption to data rates and to current traffic, for example, to indicate current energy consumption relative to interface speeds, as well as for incremental energy consumption that is expected for incremental traffic (to aid control schemes that aim to \"shave\" power off current services or to minimize the incremental use of power for additional traffic). This is an area where the current state of the art is sorely lacking, and standardization lags behind. For example, as of today, standardized YANG data models [RFC7950] for network energy consumption that can be used in conjunction with management and control protocols have yet to be defined.",
      "ja": "このような方式の前提条件の 1 つは、ネットワーキング デバイス全体、ラインカード、および個々のポートのレベルで現在の電力消費を監視できる適切な機器を設置することです。このような計測器は、デバイス全体のエネルギー効率と二酸化炭素排出量の評価も可能にする必要があります。さらに、この電力消費をデータレートおよび現在のトラフィックに関連付けることが望ましい。たとえば、インターフェース速度に対する現在のエネルギー消費量、および増分トラフィックに予想される増分エネルギー消費量を示す（現在のサービスの電源を「削減」すること、または追加のトラフィックに対する電力の増分使用を最小限に抑えることを目的とした制御スキームを支援するため）。これは、現在の最先端技術が著しく不足しており、標準化が遅れている分野です。たとえば、今日の時点では、管理および制御プロトコルと組み合わせて使用できる、ネットワークのエネルギー消費に関する標準化された YANG データ モデル [RFC7950] はまだ定義されていません。"
    },
    {
      "indent": 3,
      "text": "To remedy this situation, efforts to define sets of green networking metrics [GREEN_METRICS] as well as YANG data models that include objects that provide visibility into power measurements (e.g., [POWER_YANG]) were underway in 2024. Agreed sets of metrics and corresponding data models will provide the basis for further steps, beginning with their implementation as part of management and control instrumentation.",
      "ja": "この状況を改善するために、グリーン ネットワーキング メトリクスのセット [GREEN_METRICS] と、電力測定の可視性を提供するオブジェクト (例: [POWER_YANG]) を含む YANG データ モデルを定義する取り組みが 2024 年に進行しました。合意されたメトリクスのセットと対応するデータ モデルは、管理および制御計測の一部としての実装から始まるさらなるステップの基礎となります。"
    },
    {
      "indent": 3,
      "text": "Instrumentation should also take into account the possibility of virtualization, introducing layers of indirection to assess the actual energy usage. For example, virtualized networking functions could be hosted on containers or virtual machines that are hosted on a CPU in a data center instead of a regular network appliance such as a router or a switch, leading to very different power consumption characteristics. For example, a data center CPU's power consumption could be more efficient and more proportional to actual CPU load. Instrumentation needs to reflect these facts and facilitate attributing power consumption in a correct manner.",
      "ja": "計測機器では仮想化の可能性も考慮に入れ、実際のエネルギー使用量を評価するために間接層を導入する必要があります。たとえば、仮想化されたネットワーク機能は、ルーターやスイッチなどの通常のネットワーク アプライアンスではなく、データ センターの CPU でホストされるコンテナまたは仮想マシンでホストされる可能性があり、その結果、電力消費特性が大きく異なります。たとえば、データセンターの CPU の電力消費はより効率的で、実際の CPU 負荷に比例する可能性があります。計測器はこれらの事実を反映し、正しい方法で消費電力の推定を容易にする必要があります。"
    },
    {
      "indent": 3,
      "text": "Beyond monitoring and providing visibility into power consumption, control knobs are needed to configure energy-saving policies. For instance, power-saving modes are common in endpoints (such as mobile phones or notebook computers) but sorely lacking in networking equipment.",
      "ja": "電力消費量を監視して可視化するだけでなく、省エネ ポリシーを構成するには制御ノブが必要です。たとえば、省電力モードはエンドポイント (携帯電話やノートブック コンピュータなど) では一般的ですが、ネットワーク機器では非常に不足しています。"
    },
    {
      "indent": 3,
      "text": "The following summarizes some challenges and opportunities in this space that can provide the basis for advances in greener networking:",
      "ja": "以下は、この分野のいくつかの課題と機会をまとめたもので、より環境に優しいネットワーキングの進歩の基礎を提供できます。"
    },
    {
      "indent": 6,
      "text": "* Basic equipment categorization as \"energy efficient\" (or not) as a first step to identify immediate potential improvements, akin to the Energy Star program from the US's Environmental Protection Agency.",
      "ja": "* 米国の環境保護庁のエネルギースタープログラムに似た、即時の潜在的な改善を特定するための最初のステップとしての「エネルギー効率の良い」（またはそうでない）としての基本的な機器の分類。"
    },
    {
      "indent": 6,
      "text": "* Equipment instrumentation advances for improved energy awareness; definition and standardization of granular management information.",
      "ja": "* エネルギー認識を改善するための機器計装の進歩。粒状管理情報の定義と標準化。"
    },
    {
      "indent": 6,
      "text": "* Virtualized energy and carbon metrics and assessment of their effectiveness in solutions that optimize carbon footprints in virtualized environments (including SDN, network slicing, network function virtualization, etc.).",
      "ja": "* 仮想化されたエネルギーと炭素指標、および仮想化された環境（SDN、ネットワークスライシング、ネットワーク機能仮想化など）の二酸化炭素排出量を最適化するソリューションにおけるそれらの有効性の評価。"
    },
    {
      "indent": 6,
      "text": "* Certification and compliance assessment methods that ensure that green instrumentation cannot be manipulated to give false and misleading data.",
      "ja": "* グリーン機器が操作されて誤った誤解を招くデータが提供されないことを保証する認証およびコンプライアンス評価方法。"
    },
    {
      "indent": 6,
      "text": "* Methods that allow for the energy mix of the power sources that are used to power equipment to be taken into account, in order to facilitate solutions that optimize the actual carbon footprint and minimize pollution beyond mere energy efficiency [Hossain2019].",
      "ja": "* 実際の二酸化炭素排出量を最適化し、単なるエネルギー効率を超えて汚染を最小限に抑えるソリューションを促進するために、機器に電力を供給するために使用される電源のエネルギーミックスを考慮できる方法 [Hossain2019]。"
    },
    {
      "indent": 0,
      "text": "5. Challenges and Opportunities - Protocol Level",
      "section_title": true,
      "ja": "5. 課題と機会 - プロトコルレベル"
    },
    {
      "indent": 3,
      "text": "There are several opportunities to improve network sustainability at the protocol level, which can be categorized as follows. The first and arguably most impactful category concerns protocols that enable carbon footprint optimization schemes at the network level and management towards those goals. Other categories concern protocols designed to optimize data transmission rates under energy considerations, protocols designed to reduce the volume of data to be transmitted, and protocol aspects related to network addressing schemes. While those categories may be less impactful, even areas with smaller gains should be explored.",
      "ja": "プロトコル レベルでネットワークの持続可能性を向上させる機会はいくつかあり、次のように分類できます。最初の、おそらく最も影響力のあるカテゴリは、ネットワーク レベルでの二酸化炭素排出量の最適化スキームと、それらの目標に向けた管理を可能にするプロトコルに関するものです。他のカテゴリは、エネルギーを考慮してデータ送信速度を最適化するように設計されたプロトコル、送信されるデータ量を削減するように設計されたプロトコル、およびネットワーク アドレス指定スキームに関連するプロトコルの側面に関係します。これらのカテゴリーは影響力が低いかもしれませんが、利益が小さい領域でも調査する必要があります。"
    },
    {
      "indent": 3,
      "text": "There is also substantial work in the area of IoT, which has had to contend with energy-constrained devices for a long time. Much of that work was motivated not by sustainability concerns but practical concerns such as battery life. However, many aspects appear to also apply in the context of sustainability, such as reducing chattiness to allow IoT equipment to go into low-power mode. Accordingly, there is an opportunity to extend IoT work to more generalized scenarios. The use of power-constrained protocols in the wider Internet happens regularly. For instance, ARM-based chipsets initially designed for energy efficiency in battery-operated mobile devices have been embraced in data centers for a similar trajectory.",
      "ja": "また、IoTの分野にはかなりの作業があり、エネルギーが制約のあるデバイスと長い間争わなければなりませんでした。その作業の多くは、持続可能性の懸念ではなく、バッテリー寿命などの実際的な懸念によって動機付けられました。ただし、多くの側面は、IoT機器が低電力モードになるようにおしゃべりを減らすなど、持続可能性のコンテキストにも適用されるようです。したがって、IoT作業をより一般化されたシナリオに拡張する機会があります。より広いインターネットでの電力制約のプロトコルの使用は、定期的に起こります。たとえば、バッテリー操作のモバイルデバイスのエネルギー効率向けに最初に設計されたアームベースのチップセットは、同様の軌跡のためにデータセンターに採用されています。"
    },
    {
      "indent": 0,
      "text": "5.1. Protocol Enablers for Carbon Optimization Mechanisms",
      "section_title": true,
      "ja": "5.1. 炭素最適化メカニズムのプロトコルイネーブラー"
    },
    {
      "indent": 3,
      "text": "As discussed in Section 6, energy-aware and pollution-aware schemes can help improve network sustainability but require awareness of related data. To facilitate such schemes, protocols are needed that are able to discover what links are available along with their energy efficiency. For instance, links may be turned off in order to save energy and turned back on based upon the elasticity of the demand. Protocols should be devised to discover when this happens and to have a dynamic view of the topology that keeps up with frequent updates due to power cycling of the network resources.",
      "ja": "セクション6で説明したように、エネルギー認識と公害を受けたスキームは、ネットワークの持続可能性を改善するのに役立ちますが、関連データの認識が必要です。このようなスキームを促進するために、エネルギー効率とともに利用可能なリンクを発見できるプロトコルが必要です。たとえば、エネルギーを節約するためにリンクをオフにすることができ、需要の弾力性に基づいて戻ってきます。プロトコルは、これがいつ発生するかを発見し、ネットワークリソースのパワーサイクリングのために頻繁に更新するトポロジの動的ビューを持つように考案する必要があります。"
    },
    {
      "indent": 3,
      "text": "Also, protocols are required to quickly converge onto an energy-efficient path once a new topology is created by turning links on/ off. Current routing protocols may provide for fast recovery in the case of failure. However, failures are hopefully relatively rare events, while we expect an energy-efficient network to aggressively try to turn off links. There may be synergies with Time-Variant Routing [TVR_REQS] that can be explored, in which the topology varies over time with nodes and links turned on or off according to a schedule. There may be overlaps in use cases, for example, when regular changes in the energy mix (and hence carbon footprint) of some nodes occur that coincide with the time of day (such as switching from solar to fossil fuels at night).",
      "ja": "また、リンクをオン/オフにすることで新しいトポロジが作成されると、プロトコルはエネルギー効率の高いパスに迅速に収束する必要があります。現在のルーティングプロトコルは、障害の場合に迅速な回復を提供する場合があります。ただし、障害は比較的まれなイベントであることを願っていますが、エネルギー効率の高いネットワークがリンクを積極的にオフにしようとすることを期待しています。調査できる時間変数ルーティング[TVR_REQS]との相乗効果があります。これは、スケジュールに応じてノードとリンクがオンまたはオフになるとトポロジが時間とともに変化します。たとえば、いくつかのノードのエネルギー混合（したがって二酸化炭素排出量）の定期的な変化が、時間の時間と一致する場合（夜間の太陽から化石燃料への切り替えなど）。"
    },
    {
      "indent": 3,
      "text": "Some mechanism is needed to present to the management layer a view of the network that identifies opportunities to turn off resources (e.g., routers or links) while still providing an acceptable level of Quality of Experience (QoE) to the users. This gets more complex as the level of QoE shifts from the current best-effort delivery model to more sophisticated mechanisms with, for instance, latency, bandwidth, or reliability guarantees.",
      "ja": "ユーザーに許容可能なレベルの体験品質 (QoE) を提供しながら、リソース (ルーターやリンクなど) をオフにする機会を特定するネットワークのビューを管理層に提示するには、何らかのメカニズムが必要です。QoE のレベルが現在のベストエフォート配信モデルから、レイテンシー、帯域幅、信頼性の保証などを備えたより洗練されたメカニズムに移行するにつれて、この問題はさらに複雑になります。"
    },
    {
      "indent": 3,
      "text": "Similarly, schemes might be devised in which links across paths with a favorable energy mix are preferred over other paths. This implies that the discovery of topology should be able support corresponding parameters. More generally speaking, any mechanism that provides applications with network visibility is a candidate for scrutinization as to whether it should be extended to provide support for sustainability-related parameters.",
      "ja": "同様に、有利なエネルギー構成を持つパス間のリンクが他のパスよりも優先されるスキームが考案される可能性があります。これは、トポロジーの検出が対応するパラメーターをサポートできる必要があることを意味します。より一般的に言えば、アプリケーションにネットワークの可視性を提供するメカニズムは、持続可能性関連のパラメーターのサポートを提供するために拡張されるべきかどうかについて精査の対象となります。"
    },
    {
      "indent": 3,
      "text": "The following summarizes some challenges and opportunities in this space that can provide the basis for advances in greener networking:",
      "ja": "以下は、この分野のいくつかの課題と機会をまとめたもので、より環境に優しいネットワーキングの進歩の基礎を提供できます。"
    },
    {
      "indent": 6,
      "text": "* Protocol advances to enable rapidly taking down, bringing back online, and discovering availability and power-saving status of networking resources while minimizing the need for reconvergence and propagation of state.",
      "ja": "* プロトコルの進歩により、状態の再コンバージェンスと伝播の必要性を最小限に抑えながら、ネットワーク リソースの迅速な停止、オンラインへの復帰、可用性と省電力ステータスの検出が可能になります。"
    },
    {
      "indent": 6,
      "text": "* An assessment of which protocols could be extended with energy-and sustainability-related parameters in ways that would enable greener networking solutions, and an exploration of those solutions.",
      "ja": "* どのプロトコルを、より環境に優しいネットワーキングソリューションを可能にする方法で、エネルギーとサステナビリティ関連のパラメーターを使用して拡張できる評価と、それらのソリューションの探索を評価できます。"
    },
    {
      "indent": 0,
      "text": "5.2. Protocol Optimization",
      "section_title": true,
      "ja": "5.2. プロトコルの最適化"
    },
    {
      "indent": 3,
      "text": "The second category involves designing protocols in such a way that the rate of transmission is chosen to maximize energy efficiency. For example, Traffic Engineering (TE) can be manipulated to impact the rate adaptation mechanism [Ren2018jordan]. By choosing where to send the traffic, TE can artificially congest links so as to trigger rate adaptation and therefore reduce the total amount of traffic. Most TE systems attempt to minimize Maximum Link Utilization but energy-saving mechanisms could decide to do the opposite (i.e., maximize Minimum Link Utilization) and attempt to turn off some resources to save power.",
      "ja": "2 番目のカテゴリには、エネルギー効率を最大化するように伝送速度が選択されるようにプロトコルを設計することが含まれます。たとえば、トラフィック エンジニアリング (TE) を操作して、レート適応メカニズムに影響を与えることができます [Ren2018jordan]。トラフィックの送信先を選択することで、TE は人為的にリンクを混雑させてレート適応をトリガーし、トラフィックの総量を削減できます。ほとんどの TE システムは最大リンク使用率を最小限に抑えようとしますが、省エネ メカニズムはその逆 (つまり、最小リンク使用率を最大化) を決定し、電力を節約するために一部のリソースをオフにしようとする可能性があります。"
    },
    {
      "indent": 3,
      "text": "Another example is to set up the proper rate of transmission to minimize the flow completion time (FCT) so as to enable opportunities to turn off links. In a wireless context, [TradeOff] studies how setting the proper initial value for the congestion window can reduce the FCT and therefore allow the equipment to go faster into a low-energy mode. By sending the data faster, the energy cost can be significantly reduced. This is a simple proof of concept, but protocols that allow for turning links into a low-power mode by transmitting the data over shorter periods could be designed for other types of networks beyond Wi-Fi access. This should be done carefully: a sudden very high rate of transmission over a short period of time may create bursts that the network would need to accommodate, with all attendant complications of bursty traffic. We conjecture there is a sweet spot between trying to complete flows faster while controlling for burstiness in the network. It is probably advisable to attempt to send traffic paced yet in bulk rather than spread out over multiple round trips. This is an area of worthwhile exploration.",
      "ja": "別の例は、リンクをオフにする機会を可能にするために、フロー完了時間（FCT）を最小化するために適切な伝送速度を設定することです。ワイヤレスのコンテキストでは、[トレードオフ]は、輻輳ウィンドウの適切な初期値を設定することでFCTを減らし、したがって、機器を低エネルギーモードに速くする方法を研究します。データをより速く送信することにより、エネルギーコストを大幅に削減できます。これは単純な概念の証明ですが、より短い期間にわたってデータを送信することでリンクを低電力モードに変えることを可能にするプロトコルは、Wi-Fiアクセス以外の他のタイプのネットワーク向けに設計できます。これは慎重に行う必要があります。短期間にわたる突然の非常に高い送信率は、ネットワークに対応する必要があるバーストを作成する可能性があり、すべての付随的な交通の合併症があります。ネットワーク内の爆発を制御しながら、より速くフローを完了しようとすることの間にスイートスポットがあると推測します。おそらく、複数のラウンド旅行に広がるのではなく、ペースのあるトラフィックを大量に送信しようとすることをお勧めします。これは価値のある探索の分野です。"
    },
    {
      "indent": 3,
      "text": "The following summarizes some challenges and opportunities in this space that can provide the basis for advances in greener networking:",
      "ja": "以下は、より環境に優しいネットワーキングの進歩の基礎を提供できる、この分野におけるいくつかの課題と機会をまとめたものです。"
    },
    {
      "indent": 6,
      "text": "* Protocol advances that allow greater control over traffic pacing to account for fluctuations in carbon cost, i.e., control knobs to \"bulk up\" transmission over short periods or to smooth it out over longer periods.",
      "ja": "* 炭素コストの変動を考慮してトラフィックペーシングのより大きな制御を可能にするプロトコルの進歩、つまり短期間にわたって「一括」するか、長期間にわたって滑らかにするためのノブを制御します。"
    },
    {
      "indent": 6,
      "text": "* Protocol advances for optimizing link utilization according to different goals and strategies (including maximizing Minimal Link Utilization vs. minimizing Maximal Link Utilization, etc.)",
      "ja": "* さまざまな目標と戦略に従ってリンク使用率を最適化するためのプロトコルの進歩 (最小リンク使用率の最大化と最大リンク使用率の最小化などを含む)"
    },
    {
      "indent": 6,
      "text": "* Assessments of the carbon impact of such strategies.",
      "ja": "* そのような戦略の二酸化炭素への影響の評価。"
    },
    {
      "indent": 0,
      "text": "5.3. Data Volume Reduction",
      "section_title": true,
      "ja": "5.3. データ量の削減"
    },
    {
      "indent": 3,
      "text": "The third category involves designing protocols in such a way that they reduce the volume of data that needs to be transmitted for any given purpose. Loosely speaking, by reducing this volume, more traffic can be served by the same amount of networking infrastructure, hence reducing overall energy consumption. Possibilities here include protocols that avoid unnecessary retransmissions. At the application layer, protocols may also use coding mechanisms that encode information close to the Shannon limit [Shannon]. Currently, most of the traffic over the Internet consists of video streaming. Video encoders are already quite efficient and keep improving all the time. This results in energy savings as one of many benefits, even if some of those savings may be partially offset by increasingly higher resolution. It is not clear that the extra work to achieve higher compression ratios for the payloads results in a net energy gain: what is saved over the network may be offset by the compression/decompression effort. Further research on this aspect is necessary.",
      "ja": "3番目のカテゴリには、特定の目的で送信する必要があるデータの量を減らすようにプロトコルを設計することが含まれます。このボリュームを減らすことにより、同じ量のネットワーキングインフラストラクチャによってより多くのトラフィックを提供できるため、より多くのトラフィックを提供できるため、全体的なエネルギー消費を削減できます。ここでの可能性には、不必要な再送信を避けるプロトコルが含まれます。アプリケーションレイヤーでは、プロトコルは、シャノンリミット[シャノン]の近くに情報をエンコードするコーディングメカニズムを使用する場合があります。現在、インターネット上のトラフィックのほとんどはビデオストリーミングで構成されています。ビデオエンコーダーはすでに非常に効率的であり、常に改善し続けています。これにより、これらの節約のいくつかが、ますます高い解像度によって部分的に相殺される場合でも、多くの利点の1つとしてエネルギー節約がもたらされます。ペイロードのより高い圧縮比を達成するための追加作業が正味のエネルギーゲインをもたらすことは明らかではありません。ネットワーク上に保存されるものは、圧縮/減圧の取り組みによって相殺される可能性があります。この側面に関するさらなる研究が必要です。"
    },
    {
      "indent": 3,
      "text": "At the transport protocol layer, TCP and to some extent QUIC react to congestion by dropping packets. This is an extremely energy inefficient method to signal congestion because (a) the network has to wait one RTT to be aware that the congestion has occurred, and (b) the effort to transmit the packet from the source up until it is dropped ends up being wasted. This calls for new transport protocols that react to congestion without dropping packets. ECN [RFC3168] is a possible solution, however, it is not widely deployed. DCTCP [Alizadeh2010DCTCP] is tuned for data centers; Low Latency, Low Loss, and Scalable Throughput (L4S) is an attempt to port similar functionality to the Internet [RFC9330]. Qualitative Communication [QUAL] [Westphal2021qualitative] allows the nodes to react to congestion by dropping only some of the data in the packet, thereby only partially wasting the resource consumed by transmitted the packet up to that point. Novel transport protocols for the WAN can ensure that no energy is wasted transmitting packets that will be eventually dropped.",
      "ja": "トランスポート プロトコル層では、TCP とある程度の QUIC はパケットをドロップすることで輻輳に対応します。これは、輻輳を通知するための非常にエネルギー効率の悪い方法です。その理由は、(a) ネットワークは輻輳が発生したことを認識するまでに 1 RTT 待機する必要があり、(b) パケットがドロップされるまで送信元からパケットを送信する労力が無駄になってしまうからです。これには、パケットをドロップせずに輻輳に対応する新しいトランスポート プロトコルが必要です。ECN [RFC3168] は可能な解決策ですが、広く導入されていません。DCTCP [Alizadeh2010DCTCP] はデータセンター向けに調整されています。低遅延、低損失、スケーラブル スループット (L4S) は、同様の機能をインターネットに移植する試みです [RFC9330]。質的通信 [QUAL] [Westpal2021qualitative] では、ノードがパケット内のデータの一部のみをドロップすることで輻輳に対応できるため、それまでにパケットの送信によって消費されたリソースの一部のみが無駄になります。WAN 用の新しいトランスポート プロトコルにより、最終的にドロップされるパケットの送信にエネルギーが無駄にならないようにできます。"
    },
    {
      "indent": 3,
      "text": "Another solution to reduce the bandwidth of network protocols is by reducing their header tax, for example, by applying header compression. An example in IETF is RObust Header Compression (ROHC) [RFC3095]. Again, reducing protocol header size saves energy to forward packets, but at the cost of maintaining a state for compression/decompression, plus computing these operations. The gain from such protocol optimization further depends on the application and whether it sends packets with (a) large payloads close to the MTU, thus limiting the header tax and any savings, or (b) very small payload size, thus increasing the header tax and the savings.",
      "ja": "ネットワークプロトコルの帯域幅を削減するもう1つのソリューションは、たとえばヘッダー圧縮を適用するなど、ヘッダー税を削減することです。IETFの例は、堅牢なヘッダー圧縮（ROHC）[RFC3095]です。繰り返しになりますが、プロトコルヘッダーサイズを削減すると、エネルギーを節約することができますが、圧縮/減圧のために状態を維持し、これらの操作を計算します。このようなプロトコルの最適化からの利益は、アプリケーションと、（a）MTUの近くで大きなペイロードを送信するかどうか、したがって、ヘッダー税と貯蓄、または（b）非常に小さなペイロードサイズを制限し、ヘッダー税と貯蓄を増やすかどうかに依存します。"
    },
    {
      "indent": 3,
      "text": "An alternative to reducing the amount of protocol data is to design routing protocols that are more efficient to process at each node. For instance, path-based forwarding/labels such as MPLS [RFC3031] facilitate the next hop lookup, thereby reducing the energy consumption. It is unclear if some state at router to speed up lookup is more energy efficient than \"no state + lookup\", which is more computationally intensive. Other methods to speed up a next-hop lookup include geographic routing (e.g., [Herzen2011PIE]). Some network protocols could be designed to reduce the next hop lookup computation at a router. It is unclear whether Longest Prefix Match (LPM) is energy efficient or a significant energy burden for router operation.",
      "ja": "プロトコルデータの量を減らす代わりに、各ノードでの処理がより効率的なルーティングプロトコルを設計することです。たとえば、MPLS [RFC3031]などのパスベースの転送/ラベルが次のホップ検索を促進し、それによりエネルギー消費を削減します。ルーターの一部の状態がルックアップをスピードアップする状態が、「状態 +ルックアップなし」よりもエネルギー効率が高いかどうかは不明です。次のホップルックアップをスピードアップする他の方法には、地理的ルーティング（[Herzen2011Pie]など）が含まれます。一部のネットワークプロトコルは、ルーターでの次のホップルックアップ計算を減らすように設計できます。最長のプレフィックスマッチ（LPM）がエネルギー効率が高いのか、ルーター操作に大きなエネルギー負担があるのかは不明です。"
    },
    {
      "indent": 3,
      "text": "Beyond the volume of data itself, another consideration is the number of messages and chattiness of the protocol. Some protocols rely on frequent periodic updates or heartbeats, which may prevent equipment from going into sleep mode. In such cases, it makes sense to explore the use of feasible alternatives that rely on different communication patterns and fewer messages.",
      "ja": "データ自体の量を超えて、もう1つの考慮事項は、プロトコルのメッセージとおしゃべりの数です。一部のプロトコルは、頻繁な定期的な更新またはハートビートに依存しているため、機器が睡眠モードに入るのを防ぐことができます。そのような場合、さまざまな通信パターンとより少ないメッセージに依存する実行可能な代替案の使用を調査することは理にかなっています。"
    },
    {
      "indent": 3,
      "text": "The following summarizes some challenges and opportunities in this space that can provide the basis for advances in greener networking:",
      "ja": "以下は、この分野のいくつかの課題と機会をまとめたもので、より環境に優しいネットワーキングの進歩の基礎を提供できます。"
    },
    {
      "indent": 6,
      "text": "* Assessments of energy-related trade-offs regarding protocol design space and trade-offs, such as maintaining state versus more compact encodings, or extra computation for transcoding operations versus larger data volume.",
      "ja": "* 状態とよりコンパクトなエンコーディングの維持など、プロトコルの設計スペースとトレードオフに関するエネルギー関連のトレードオフの評価、またはトランスコーディング操作とより大きなデータボリュームの追加計算。"
    },
    {
      "indent": 6,
      "text": "* Protocol advances for improving the ratio of goodput to throughput and to reduce waste; this includes advances such as coding improvements, reductions in header tax, lower protocol verbosity, and reduced need for retransmissions.",
      "ja": "* スループットに対するグッドプットの比率を改善し、無駄を削減するためのプロトコルの進歩。これには、コーディングの改善、ヘッダー税の削減、プロトコルの詳細度の低下、再送信の必要性の削減などの進歩が含まれます。"
    },
    {
      "indent": 6,
      "text": "* Protocols that allow for managing transmission patterns in ways that facilitate periods of link inactivity, such as burstiness and chattiness.",
      "ja": "* 破裂やおしゃべりなど、リンクの不活性の期間を促進する方法で伝送パターンを管理できるプロトコル。"
    },
    {
      "indent": 0,
      "text": "5.4. Network Addressing",
      "section_title": true,
      "ja": "5.4. ネットワークアドレス指定"
    },
    {
      "indent": 3,
      "text": "Network addressing is another way to shave off energy usage from networks. Address tables can get very large, resulting in large forwarding tables that require considerable amount of memory, in addition to large amounts of state needing to be maintained and synchronized. Memory as well as the processing needed to maintain and synchronize state both consume energy. Exploring ways to reduce the amount of memory and synchronization of state that is required offers opportunities to reduce energy use. At the protocol level, rethinking how addresses are structured can allow for flexible addressing schemes that can be exploited in network deployments that are less energy-intensive by design. This can be complemented by supporting clever address allocation schemes that minimize the number of required forwarding entries as part of deployments.",
      "ja": "ネットワークアドレス指定は、ネットワークからエネルギー使用量を削除するもう1つの方法です。アドレステーブルは非常に大きくなる可能性があり、その結果、かなりの量のメモリを必要とする大規模な転送テーブルが維持され、同期する必要があることに加えて、かなりの量のメモリを必要とします。メモリと、状態を維持および同期するために必要な処理は、両方ともエネルギーを消費します。必要な状態のメモリの量と同期を減らす方法を探ることは、エネルギー使用を減らす機会を提供します。プロトコルレベルでは、アドレスがどのように構造化されているかを再考することで、設計によるエネルギー集約型のネットワーク展開で悪用される可能性のある柔軟なアドレス指定スキームが可能になります。これは、展開の一部として必要な転送エントリの数を最小限に抑える巧妙なアドレス割り当てスキームをサポートすることで補完できます。"
    },
    {
      "indent": 3,
      "text": "Alternatively, the addressing could be designed to allow for more efficient processing than LPM. For instance, a geographic type of addressing (where the next hop is computed as a simple distance calculation based on the respective position of the current node, of its neighbors and of the destination) [Herzen2011PIE] could be potentially more energy efficient.",
      "ja": "あるいは、LPM よりも効率的な処理ができるようにアドレス指定を設計することもできます。たとえば、地理的タイプのアドレス指定 (次のホップが、現在のノード、その隣接ノード、および宛先のそれぞれの位置に基づいて単純な距離計算として計算される) [Herzen2011PIE] は、潜在的にエネルギー効率が高くなる可能性があります。"
    },
    {
      "indent": 3,
      "text": "The following summarizes some challenges and opportunities in this space that can provide the basis for advances in greener networking:",
      "ja": "以下は、より環境に優しいネットワーキングの進歩の基礎を提供できる、この分野におけるいくつかの課題と機会をまとめたものです。"
    },
    {
      "indent": 6,
      "text": "* Devise methods to assess the magnitude of the carbon footprint that is associated with addressing schemes.",
      "ja": "* メソッドを考案して、スキームへの対処に関連する二酸化炭素排出量の大きさを評価します。"
    },
    {
      "indent": 6,
      "text": "* Devise methods to improve addressing schemes, as well as address assignment schemes, to minimize their footprint.",
      "ja": "* アドレス指定スキームとアドレス割り当てスキームを改善して、フットプリントを最小限に抑える方法を考案します。"
    },
    {
      "indent": 0,
      "text": "6. Challenges and Opportunities - Network Level",
      "section_title": true,
      "ja": "6. 課題と機会 - ネットワークレベル"
    },
    {
      "indent": 0,
      "text": "6.1. Network Optimization and Energy/Carbon/Pollution-Aware Networking",
      "section_title": true,
      "ja": "6.1. ネットワークの最適化とエネルギー/炭素/汚染対応ネットワーキング"
    },
    {
      "indent": 3,
      "text": "Networks have been optimized for many years under many criteria, for example, to optimize (maximize) network utilization and to optimize (minimize) cost. Hence, it is straightforward to add optimization for greenness (including energy efficiency, power consumption, carbon footprint) as important criteria.",
      "ja": "ネットワークは、ネットワーク利用の最適化 (最大化) やコストの最適化 (最小化) など、多くの基準に基づいて長年にわたって最適化されてきました。したがって、グリーン性 (エネルギー効率、電力消費、二酸化炭素排出量など) の最適化を重要な基準として追加するのは簡単です。"
    },
    {
      "indent": 3,
      "text": "This includes assessing the carbon footprints of paths and optimizing those paths so that overall footprint is minimized, then applying techniques such as path-aware networking or segment routing [RFC8402] to steer traffic along those paths. (As mentioned earlier, other proxy measures could be used for carbon footprint, such as energy-efficiency ratings of traversed equipment.) It also includes aspects such as considering the incremental carbon footprint in routing decisions. Optimizing cost has long been an area of focus in networking; many of the existing mechanisms can be leveraged for greener networking simply by introducing the carbon footprint as a cost factor. Low-hanging fruit includes adding carbon-related parameters as a cost parameter in control planes, whether distributed (e.g., IGP) or conceptually centralized via SDN controllers. Likewise, there are opportunities to smartly place functionality in the network for optimal effectiveness. An example is placement of virtualized network functions in carbon-optimized ways. For example, virtualized network functions can be cohosted on fewer servers to achieve higher server utilization, which is more effective from an energy and carbon perspective than larger numbers of servers with lower utilization. Likewise, they can be placed in close proximity to each other in order to avoid unnecessary overhead in long-distance control traffic.",
      "ja": "これには、パスの二酸化炭素排出量を評価し、全体の排出量が最小限になるようにそれらのパスを最適化し、その後、パスを意識したネットワーキングやセグメント ルーティング [RFC8402] などの技術を適用して、それらのパスに沿ってトラフィックを誘導することが含まれます。（前述したように、通過する機器のエネルギー効率評価など、他の代替指標を二酸化炭素排出量に使用することもできます。）これには、経路決定の際に二酸化炭素排出量の増分を考慮するなどの側面も含まれます。コストの最適化は、ネットワーキングにおける長年の焦点の分野でした。既存のメカニズムの多くは、二酸化炭素排出量をコスト要素として導入するだけで、より環境に優しいネットワーキングに活用できます。簡単に実現できる成果には、分散 (IGP など) か、SDN コントローラーを介して概念的に集中化されているかにかかわらず、コントロール プレーンのコスト パラメーターとして炭素関連パラメーターを追加することが含まれます。同様に、最適な効果を得るためにネットワーク内に機能を賢く配置する機会もあります。一例としては、二酸化炭素を最適化した方法で仮想化されたネットワーク機能を配置することが挙げられます。たとえば、仮想化されたネットワーク機能を少数のサーバーで共同ホストしてサーバー使用率を高めることができます。これは、使用率が低い多数のサーバーを使用するよりも、エネルギーと炭素の観点からより効果的です。同様に、長距離制御トラフィックにおける不必要なオーバーヘッドを回避するために、これらを互いに近接して配置することもできます。"
    },
    {
      "indent": 3,
      "text": "Other opportunities concern adding carbon awareness to dynamic path selection schemes. This is sometimes referred to as \"energy-aware networking\" (or \"pollution-aware networking\" [Hossain2019] or \"carbon-aware networking\", when parameters beyond simply energy consumption are taken into account). Again, considerable energy savings can potentially be realized by taking resources offline (e.g., putting them into power-saving or hibernation mode) when they are not needed under current network demand and load conditions. Therefore, weaning resources from traffic is an important consideration for energy-efficient traffic steering. This approach contrasts and indeed conflicts with existing schemes that typically aim to create redundancy and load-balance traffic across a network to achieve even resource utilization across larger numbers of network resources as a means to increase network resilience, optimize service levels, and ensure fairness. Thus, a big challenge is how resource-weaning schemes to realize energy savings can be accommodated without cannibalizing other important goals, counteracting other established mechanisms, or destabilizing the network.",
      "ja": "その他の機会は、動的なパス選択スキームに炭素認識を追加することに関するものです。これは、「エネルギーを意識したネットワーキング」（または、単にエネルギー消費を超えたパラメータが考慮される場合、「汚染を意識したネットワーキング」[Hossain2019] または「炭素を意識したネットワーキング」）と呼ばれることもあります。繰り返しますが、現在のネットワーク需要と負荷条件下でリソースが必要ない場合に、リソースをオフラインにする (たとえば、省電力モードまたは休止状態モードにする) ことで、大幅なエネルギー節約が実現できる可能性があります。したがって、エネルギー効率の高い交通誘導を行うには、交通からリソースを切り離すことが重要な考慮事項となります。このアプローチは、ネットワークの復元力を高め、サービス レベルを最適化し、公平性を確保する手段として、多数のネットワーク リソースにわたって均等なリソース使用率を達成するために、ネットワーク全体に冗長性を作成し、トラフィックの負荷を分散することを通常目的とする既存のスキームとは対照的であり、実際に競合します。したがって、他の重要な目標を共食いしたり、他の確立されたメカニズムに対抗したり、ネットワークを不安定にしたりすることなく、エネルギー節約を実現するためのリソースウィーニング計画にどのように対応できるかが大きな課題となります。"
    },
    {
      "indent": 3,
      "text": "An opportunity may lie in making a distinction between \"energy modes\" of different domains. For instance, in a highly trafficked core, the energy challenge is to transmit the traffic efficiently. The amount of traffic is relatively fluid (due to multiplexing of multiple sessions) and the traffic is predictable. In this case, there is no need to optimize on a per-session basis or at a short timescale. In the access networks connecting to that core, though, there are opportunities for this fast convergence: traffic is much more bursty and less predictable, and the network should be able to be more reactive. Other domains such as DCs may have more variable workloads and different traffic patterns.",
      "ja": "機会は、異なるドメインの「エネルギーモード」を区別することにあるかもしれません。たとえば、非常に人身売買されたコアでは、エネルギーの課題はトラフィックを効率的に送信することです。トラフィックの量は比較的流動的であり（複数のセッションの多重化による）、トラフィックは予測可能です。この場合、セッションごとまたは短いタイムスケールで最適化する必要はありません。ただし、そのコアに接続するアクセスネットワークでは、この高速な収束の機会があります。トラフィックははるかに破裂し、予測可能ではなく、ネットワークはより反応的になることができるはずです。DCSなどの他のドメインには、ワークロードが大きくなり、トラフィックパターンが異なる場合があります。"
    },
    {
      "indent": 3,
      "text": "The following summarizes some challenges and opportunities in this space that can provide the basis for advances in greener networking:",
      "ja": "以下は、より環境に優しいネットワーキングの進歩の基礎を提供できる、この分野におけるいくつかの課題と機会をまとめたものです。"
    },
    {
      "indent": 6,
      "text": "* Devise methods for carbon-aware traffic steering and routing; treat carbon footprint as a traffic cost metric to optimize.",
      "ja": "* カーボンアウェアトラフィックステアリングとルーティングの方法を考案します。カーボンフットプリントを最適化するための交通コストメトリックとして扱います。"
    },
    {
      "indent": 6,
      "text": "* Apply Machine Learning (ML) and AI methods to optimize networks for carbon footprint; assess applicability of game theoretic approaches.",
      "ja": "* 機械学習（ML）およびAIメソッドを適用して、二酸化炭素排出量のネットワークを最適化します。ゲーム理論的アプローチの適用性を評価します。"
    },
    {
      "indent": 6,
      "text": "* Articulate and, as applicable, moderate trade-offs between carbon awareness and other operational goals such as robustness and redundancy.",
      "ja": "* 明確であり、該当する場合、炭素認識と堅牢性や冗長性などの他の運用目標との間の中程度のトレードオフ。"
    },
    {
      "indent": 6,
      "text": "* Extend control plane protocols with carbon-related parameters.",
      "ja": "* 炭素関連パラメータを使用してコントロール プレーン プロトコルを拡張します。"
    },
    {
      "indent": 6,
      "text": "* Consider security issues imposed by greater energy awareness, to minimize the new attack surfaces that would allow an adversary to turn off resources or to waste energy.",
      "ja": "* より大きなエネルギー認識によって課せられるセキュリティの問題を考慮して、敵が資源をオフにしたり、エネルギーを無駄にしたりできるようにする新しい攻撃面を最小限に抑えます。"
    },
    {
      "indent": 0,
      "text": "6.2. Assessing Carbon Footprint and Network-Level Instrumentation",
      "section_title": true,
      "ja": "6.2. 二酸化炭素排出量とネットワークレベルの計測の評価"
    },
    {
      "indent": 3,
      "text": "As an important prerequisite to capture many of the opportunities outlined in Section 6.1, good abstractions (and corresponding instrumentation) for easily assessing energy cost and carbon footprint will be required. These abstractions need to account for not only the energy cost associated with packet forwarding across a given path, but also the related cost for processing, for memory, and for maintaining of state, to result in a holistic picture.",
      "ja": "セクション 6.1 で概説した多くの機会を捉えるための重要な前提条件として、エネルギーコストと二酸化炭素排出量を簡単に評価するための優れた抽象化 (および対応する手段) が必要になります。これらの抽象化では、全体像を得るために、特定のパスを介したパケット転送に関連するエネルギー コストだけでなく、処理、メモリ、および状態の維持に関連するコストも考慮する必要があります。"
    },
    {
      "indent": 3,
      "text": "In many cases, optimization of carbon footprint has trade-offs that involve not only packet forwarding but also aspects such as keeping state, caching data, or running computations at the edge instead of elsewhere. (Note: There may be a differential in running a computation at an edge server vs. at a hyperscale DC. The latter is often better optimized than the former.) Likewise, other aspects of carbon footprint beyond mere energy-intensity should be considered. For instance, some network segments may be powered by more sustainable energy sources than others, and some network equipment may be more environmentally friendly to build, deploy, and recycle, all of which can be reflected in abstractions to consider.",
      "ja": "多くの場合、二酸化炭素排出量の最適化には、パケット転送だけでなく、状態の保持、データのキャッシュ、他の場所ではなくエッジでの計算の実行などの側面も関係するトレードオフがあります。(注: エッジ サーバーとハイパースケール DC での計算の実行には違いがある可能性があります。多くの場合、後者の方が前者より最適化されています。) 同様に、単なるエネルギー原単位を超えた二酸化炭素排出量の他の側面も考慮する必要があります。たとえば、一部のネットワーク セグメントは他のセグメントよりも持続可能なエネルギー源で電力を供給されている場合や、一部のネットワーク機器は構築、展開、リサイクルがより環境に優しい場合があり、これらすべてを考慮すべき抽象化に反映できます。"
    },
    {
      "indent": 3,
      "text": "Assessing carbon footprint at the network level requires instrumentation that associates that footprint not just with individual devices (as outlined in Section 4.2) but also with concepts that are meaningful at the network level, i.e., to flows and to paths. For example, it will be useful to provide visibility into the carbon intensity of a path: Can the carbon cost of traffic transmitted over the path be aggregated? Does the path include outliers, i.e., segments with equipment with a particularly large carbon footprint?",
      "ja": "ネットワーク レベルで二酸化炭素排出量を評価するには、その排出量を個々のデバイス (セクション 4.2 で概説) だけでなく、ネットワーク レベルで意味のある概念、つまりフローやパスと関連付ける計測機器が必要です。たとえば、パスの炭素強度を可視化すると便利です。パスを介して送信されるトラフィックの炭素コストを集計できますか?パスには外れ値、つまり二酸化炭素排出量が特に大きい機器を備えたセグメントが含まれていますか?"
    },
    {
      "indent": 3,
      "text": "Similarly, how can the carbon cost of a flow be assessed? That might serve many purposes beyond network optimization, from the option to introduce green billing and charging schemes that account for the amount of carbon-equivalent emissions that are attributed to the use of communication services by particular users to the ability to raise carbon awareness by end users.",
      "ja": "同様に、フローの炭素コストをどのように評価できますか？それは、特定のユーザーによるコミュニケーションサービスの使用に起因する炭素等価排出量を説明する緑の請求および充電スキームを導入するオプションから、エンドユーザーによる炭素意識を高める能力に起因する多くの目的に役立つかもしれません。"
    },
    {
      "indent": 3,
      "text": "The following summarizes some challenges and opportunities in this space that can provide the basis for advances in greener networking:",
      "ja": "以下は、この分野のいくつかの課題と機会をまとめたもので、より環境に優しいネットワーキングの進歩の基礎を提供できます。"
    },
    {
      "indent": 6,
      "text": "* Devise methods to assess, estimate, and predict the carbon intensity of paths.",
      "ja": "* 経路の炭素強度を評価、推定、予測する方法を考案します。"
    },
    {
      "indent": 6,
      "text": "* Devise methods to account for the carbon footprint of flows and networking services.",
      "ja": "* フローとネットワーキング サービスの二酸化炭素排出量を考慮する方法を考案します。"
    },
    {
      "indent": 0,
      "text": "6.3. Dimensioning and Peak Shaving",
      "section_title": true,
      "ja": "6.3. 寸法とピークシェービング"
    },
    {
      "indent": 3,
      "text": "As mentioned in Section 3, the overall energy usage of a network is in large part determined by how the network is dimensioned, specifically: which and how many pieces of network equipment are deployed and turned on. A significant portion of energy is drawn even when simply in idle state. Hence, minimizing the amount of equipment that needs to be turned on in the first place presents one of the biggest energy-saving opportunities.",
      "ja": "セクション3で述べたように、ネットワークの全体的なエネルギー使用量は、ネットワークがどのように寸法化されているか、具体的には次のように主に決定されます。単にアイドル状態であっても、エネルギーのかなりの部分が描かれます。したがって、そもそもオンにする必要がある機器の量を最小限に抑えることは、最大の省エネの機会の1つです。"
    },
    {
      "indent": 3,
      "text": "Network deployments are generally dimensioned for periods of peak traffic, resulting in excess capacity during periods of non-peak usage that nonetheless consumes power. Shaving peak usage may thus result in outsized sustainability gains, as it reduces energy usage during peak traffic but, more importantly, waste during non-peak periods.",
      "ja": "一般に、ネットワーク展開はピーク トラフィックの期間に合わせて設計されるため、非ピーク使用期間には過剰な容量が発生し、それでも電力を消費します。したがって、ピーク使用量を削減すると、ピーク交通時のエネルギー使用量が削減されますが、より重要なことに、非ピーク時の無駄が削減されるため、持続可能性が大幅に向上する可能性があります。"
    },
    {
      "indent": 3,
      "text": "While traffic volume is largely a function of demand traffic that network providers have little influence over, some peak shaving can nevertheless be accomplished by techniques such as spreading spikes out over geographies (e.g., redirecting some traffic across more costly but less utilized routes, particularly in cases when traffic spikes are of a more local or regional nature) or over time (e.g., postponing non-urgent traffic, storing or buffering using edge clouds or extra storage where feasible).",
      "ja": "トラフィック量は主に、ネットワーク プロバイダーがほとんど影響を及ぼさない需要トラフィックの関数ですが、それでも、スパイクを地理的に分散する (例: 一部のトラフィックをより高価だが利用率の低いルートにリダイレクトする、特にトラフィックのスパイクがよりローカルまたは地域的な性質のものである場合) または時間の経過 (例: 緊急でないトラフィックを延期する、エッジ クラウドを使用して保存またはバッファリングする) などの手法によって達成できる場合もあります。\n\n可能な場合は追加のストレージ）。"
    },
    {
      "indent": 3,
      "text": "To make techniques effective, accurate learning and prediction of traffic patterns are required. This includes the ability to perform forecasting to ensure that additional resources can be spun up in time should they be needed. Clearly, this presents interesting challenges, yet also opportunities for technical advances to make a difference.",
      "ja": "テクニックを効果的で正確な学習とトラフィックパターンの予測にするには、必要です。これには、予測を実行して、追加のリソースが必要に応じて時間内にスピンアップできるようにする機能が含まれます。明らかに、これは興味深い課題を提示しますが、技術的な進歩が変化をもたらす機会もあります。"
    },
    {
      "indent": 3,
      "text": "The following summarizes some challenges and opportunities in this space that can provide the basis for advances in greener networking:",
      "ja": "以下は、この分野のいくつかの課題と機会をまとめたもので、より環境に優しいネットワーキングの進歩の基礎を提供できます。"
    },
    {
      "indent": 6,
      "text": "* Support methods for monitoring and forecasting traffic demand, involving new mechanisms and/or performance improvements of existing mechanisms to support the collection of telemetry and generation of traffic matrices at very high velocity and scale.",
      "ja": "* 非常に高速かつ大規模なテレメトリの収集とトラフィック マトリクスの生成をサポートするための、新しいメカニズムや既存のメカニズムのパフォーマンス向上を伴う、トラフィック需要の監視と予測のサポート方法。"
    },
    {
      "indent": 6,
      "text": "* Additional methods for distributing traffic load evenly across the network, i.e., load balancing on a network scale, and enablement of those methods through control protocol extensions as needed.",
      "ja": "* ネットワーク全体にトラフィック負荷を均等に配布するための追加の方法、つまりネットワークスケールでの負荷分散、および必要に応じて制御プロトコル拡張を介してこれらのメソッドを有効にします。"
    },
    {
      "indent": 0,
      "text": "6.4. Convergence Schemes",
      "section_title": true,
      "ja": "6.4. 収束スキーム"
    },
    {
      "indent": 3,
      "text": "One set of challenges of carbon-aware networking concerns the fact that many schemes result in much greater dynamicity and continuous change in the network, as resources may be steered away from (when possible) and then leveraged again (when necessary) in rapid succession. This imposes significant stress on convergence schemes that results in challenges to the scalability of solutions and their ability to perform in a fast-enough manner. Network-wide convergence imposes high cost and incurs significant delay and thus is not susceptible to such schemes. In order to mitigate this problem, mechanisms should be investigated that do not require convergence beyond the vicinity of the affected network device. The impact of churn needs to be minimized, especially in cases where central network controllers (responsible for the configuration of paths and the positioning of network functions and that aim for global optimization) are involved. This means that, for example, discovery, rediscovery, and update schemes need to be simplified, and extensive recalculation (e.g., of routes and paths based on the current energy state of the network) needs to be avoided.",
      "ja": "カーボンアウェア ネットワーキングの一連の課題の 1 つは、リソースが (可能な場合) 遠ざけられ、その後 (必要に応じて) 立て続けに再び利用される可能性があるため、多くのスキームがネットワーク内でより大きな動的性と継続的な変化をもたらすという事実に関係しています。これにより、コンバージェンス スキームに大きなストレスがかかり、ソリューションのスケーラビリティや十分な速度で実行する能力に課題が生じます。ネットワーク全体のコンバージェンスには高いコストがかかり、大幅な遅延が生じるため、そのようなスキームの影響を受けません。この問題を軽減するには、影響を受けるネットワーク デバイスの近くを超えてコンバージェンスを必要としないメカニズムを調査する必要があります。チャーンの影響は、特に中央ネットワーク コントローラー (パスの構成とネットワーク機能の配置を担当し、グローバルな最適化を目指す) が関与する場合には、最小限に抑える必要があります。これは、たとえば、検出、再検出、および更新スキームを簡素化する必要があり、大規模な再計算（たとえば、ネットワークの現在のエネルギー状態に基づくルートおよびパスの）を回避する必要があることを意味します。"
    },
    {
      "indent": 3,
      "text": "The following summarizes some challenges and opportunities in this space that can provide the basis for advances in greener networking:",
      "ja": "以下は、より環境に優しいネットワーキングの進歩の基礎を提供できる、この分野におけるいくつかの課題と機会をまとめたものです。"
    },
    {
      "indent": 6,
      "text": "* Protocols that facilitate rapid convergence (per Section 5.1).",
      "ja": "* 迅速なコンバージェンスを促進するプロトコル (セクション 5.1 に従って)。"
    },
    {
      "indent": 6,
      "text": "* Investigate methods that mitigate effects of churn, including methods that maintain memory or state as well as methods relying on prediction, inference, and interpolation.",
      "ja": "* 記憶や状態を維持する方法、予測、推論、補間に依存する方法を含む、チャーンの効果を軽減する方法を調査します。"
    },
    {
      "indent": 0,
      "text": "6.5. The Role of Topology",
      "section_title": true,
      "ja": "6.5. トポロジーの役割"
    },
    {
      "indent": 3,
      "text": "One of the most important network management constructs is that of the network topology. A network topology can usually be represented as a database or as a mathematical graph, with vertices or nodes, edges or links, representing networking nodes, links connecting their interfaces, and all their characteristics. Examples of these network topology representations include routing protocols' link-state databases (LSDBs) and service function chaining graphs.",
      "ja": "最も重要なネットワーク管理構造の1つは、ネットワークトポロジの構成要素です。ネットワークトポロジは通常、データベースまたは数学的グラフとして表現でき、頂点またはノード、エッジまたはリンクを使用して、ネットワーキングノードを表し、インターフェイスを接続するリンク、およびそのすべての特性を表します。これらのネットワークトポロジ表現の例には、ルーティングプロトコルのリンク状態データベース（LSDB）とサービス関数チェーングラフが含まれます。"
    },
    {
      "indent": 3,
      "text": "As part of adding carbon and energy awareness into networks, it is useful also for topology information to provide visibility into sustainability data. Such capabilities can help to assess sustainability of the network overall and can enable automated applications to improve it.",
      "ja": "炭素とエネルギーの認識をネットワークに追加することの一環として、トポロジー情報が持続可能性データの可視性を提供することも役立ちます。このような機能は、ネットワーク全体の持続可能性を評価するのに役立ち、自動化されたアプリケーションがそれを改善できるようにすることができます。"
    },
    {
      "indent": 3,
      "text": "The following summarizes some challenges and opportunities in this space that can provide the basis for advances in greener networking:",
      "ja": "以下は、より環境に優しいネットワーキングの進歩の基礎を提供できる、この分野におけるいくつかの課題と機会をまとめたものです。"
    },
    {
      "indent": 6,
      "text": "* Embedding carbon and energy awareness into the representation of topologies, whether considering IGP LSDBs and their advertisements, BGP-LS (BGP Link-State), or metadata for the rendering of service function paths in a service chain.",
      "ja": "* IGP LSDB とそのアドバタイズメント、BGP-LS (BGP リンクステート)、またはサービス チェーン内のサービス機能パスのレンダリングのためのメタデータを考慮するかどうかにかかわらず、トポロジの表現に炭素とエネルギーの認識を埋め込みます。"
    },
    {
      "indent": 6,
      "text": "* Use of those carbon-aware attributes to optimize topology as a whole under end-to-end energy and carbon considerations.",
      "ja": "* エンドツーエンドのエネルギーと炭素の考慮事項の下でトポロジー全体を最適化するために、これらの炭素対応属性を使用します。"
    },
    {
      "indent": 0,
      "text": "7. Challenges and Opportunities - Architecture Level",
      "section_title": true,
      "ja": "7. 課題と機会 - アーキテクチャレベル"
    },
    {
      "indent": 3,
      "text": "Another possibility to improve network energy efficiency is to organize networks in a way that they allow important applications to reduce energy consumption. Examples include facilitating retrieval of content or performing computation in ways that minimize the amount of communication needed in the first place, even if energy savings within the network may be offset (at least in part) by additional energy consumption elsewhere. The following examples suggest that it may be worthwhile to reconsider the ways in which networks are architected to minimize their carbon footprint.",
      "ja": "ネットワークのエネルギー効率を向上させるもう 1 つの可能性は、重要なアプリケーションがエネルギー消費を削減できるようにネットワークを組織することです。例としては、ネットワーク内のエネルギー節約が他の場所での追加のエネルギー消費によって (少なくとも部分的に) 相殺される可能性がある場合でも、コンテンツの検索を容易にしたり、そもそも必要な通信量を最小限に抑える方法で計算を実行したりすることが含まれます。次の例は、二酸化炭素排出量を最小限に抑えるためにネットワークを構築する方法を再検討する価値があることを示唆しています。"
    },
    {
      "indent": 3,
      "text": "For example, Content Delivery Networks (CDNs) have reduced the energy expenditure of the Internet by downloading content near the users. The content is sent only a few times over the WAN and then is served locally. This shifts the energy consumption from networking to storage. Further methods can reduce the energy usage even more [Bianco2016energy] [Mathew2011energy] [Islam2012evaluating]. Whether overall energy savings are net positive depends on the actual deployment, but from the network operator's perspective, at least it shifts the energy bill away from the network to the CDN operator.",
      "ja": "たとえば、コンテンツ配信ネットワーク (CDN) は、ユーザーの近くでコンテンツをダウンロードすることにより、インターネットのエネルギー消費を削減しました。コンテンツは WAN 経由で数回だけ送信され、その後ローカルで提供されます。これにより、エネルギー消費がネットワークからストレージに移行します。さらに別の方法を使用すると、エネルギー使用量をさらに削減できます [Bianco2016energy] [Mathew2011energy] [Islam2012evaluating]。全体的なエネルギー節約が正味プラスになるかどうかは、実際の導入状況によって異なりますが、ネットワーク オペレーターの観点から見ると、少なくとも、エネルギー料金がネットワークから CDN オペレーターに移されます。"
    },
    {
      "indent": 3,
      "text": "While CDNs operate as an overlay, another architecture has been proposed to provide the CDN features directly in the network -- namely, Information-Centric Networks [Ahlgren2012survey], also studied in the ICNRG of the IRTF. However, this shifts the energy consumption back to the network operator and requires some power-hungry hardware, such as chips for larger name lookups and memory for the in-network cache. As a result, it is unclear if there is an actual energy gain from the dissemination and retrieval of content within in-network caches.",
      "ja": "CDN はオーバーレイとして動作しますが、CDN 機能をネットワーク内で直接提供する別のアーキテクチャが提案されています。それは、情報中心ネットワーク [Ahlgren2012survey] であり、これも IRTF の ICNRG で研究されています。ただし、これによりエネルギー消費がネットワーク オペレータに戻され、より大きな名前検索用のチップやネットワーク内キャッシュ用のメモリなど、電力を大量に消費するハードウェアが必要になります。その結果、ネットワーク内キャッシュ内のコンテンツの配布と取得によって実際にエネルギーが得られるかどうかは不明です。"
    },
    {
      "indent": 3,
      "text": "Fog computing and placing intelligence at the edge are other architectural directions for reducing the amount of energy that is spent on packet forwarding and in the network. There again, the trade-off is between performing computational tasks (a) in an energy-optimized data center at very large scale (but requiring transmission of significant volumes of data across many nodes and long distances) versus (b) at the edge where the energy may not be used as efficiently (less multiplexing of resources and inherently lower efficiency of smaller sites due to their smaller scale) but the amount of long-distance network traffic and energy required for the network is significantly reduced. Softwarization, containers, and microservices are direct enablers of such architectures. Their realization will be further aided by the deployment of programmable network infrastructure, such as Infrastructure Processing Units (IPUs) or Smart NICs that offload some computations from the CPU onto the NIC. However, the power consumption characteristics of CPUs are different from those of NPUs; this is another aspect to be considered in conjunction with virtualization.",
      "ja": "霧のコンピューティングとインテリジェンスの配置は、パケット転送やネットワーク内で費やされるエネルギーの量を減らすための他のアーキテクチャの方向です。繰り返しになりますが、トレードオフは、非常に大規模なエネルギー最適化データセンターで計算タスク（a）の実行（a）（ただし、多くのノードと長距離にわたってかなりの量のデータを送信する必要があります）と（b）エネルギーが効率的に使用されないエッジ（ネットワークのマルチプレックスが少なく、エネルギーが必要であるため、本質的に小規模なエネルギーが必要です）減少。ソフトウェア化、コンテナ、およびマイクロサービスは、このようなアーキテクチャの直接的なイネーブラーです。彼らの実現は、インフラストラクチャ処理ユニット（IPU）やCPUからのいくつかの計算をNICにオフロードするスマートNICなどのプログラム可能なネットワークインフラストラクチャの展開によってさらに支援されます。ただし、CPUの消費電力特性は、NPUの消費電力特性とは異なります。これは、仮想化と組み合わせて考慮されるもう1つの側面です。"
    },
    {
      "indent": 3,
      "text": "Other possibilities are taking economic aspects into consideration, such as providing incentives to users of networking services in order to minimize energy consumption and emission impact. In [Wolf2014choicenet], an example is provided that could be expanded to include energy incentives.",
      "ja": "他の可能性は、エネルギー消費と排出への影響を最小限に抑えるために、ネットワーキングサービスのユーザーにインセンティブを提供するなど、経済的側面を考慮に入れています。[wolf2014choicenet]では、エネルギーインセンティブを含むように拡張できる例が提供されています。"
    },
    {
      "indent": 3,
      "text": "Other approaches consider performing a late binding of the data and the functions to be performed on it [Krol2017NFaaS]. The COINRG of the IRTF focuses on similar issues. Jointly optimizing for the total energy cost that takes into account networking as well as computing (along with the different energy cost of computing in a hyperscale DC vs. at an edge node) is still an area of open research.",
      "ja": "他のアプローチでは、データと機能の遅延結合を実行することを検討します[krol2017nfaas]。IRTFのコインは、同様の問題に焦点を当てています。ネットワーキングとコンピューティング（エッジノードでのハイパースケールDC対の異なるエネルギーコストとともに）を考慮した総エネルギーコストを共同で最適化することは、依然としてオープンリサーチの領域です。"
    },
    {
      "indent": 3,
      "text": "In summary, rethinking the overall network (and networked application) architecture can be an opportunity to significantly reduce the energy cost at the network layer, for example, by performing tasks that involve massive communications closer to the user. To what extent these shifts result in a net reduction of carbon footprint is an important question that requires further analysis on a case-by-case basis.",
      "ja": "要約すると、ネットワーク (およびネットワーク化されたアプリケーション) 全体のアーキテクチャを再考することは、たとえば、大規模な通信を伴うタスクをユーザーの近くで実行することによって、ネットワーク層でのエネルギー コストを大幅に削減する機会となる可能性があります。これらの変化がどの程度二酸化炭素排出量の純削減につながるかは重要な問題であり、ケースバイケースでのさらなる分析が必要です。"
    },
    {
      "indent": 3,
      "text": "The following summarizes some challenges and opportunities in this space that can provide the basis for advances in greener networking:",
      "ja": "以下は、この分野のいくつかの課題と機会をまとめたもので、より環境に優しいネットワーキングの進歩の基礎を提供できます。"
    },
    {
      "indent": 6,
      "text": "* Investigate organization of networking architecture for important classes of applications (e.g., content delivery, most suitable placement of computational intelligence and network functionality within the network design, industrial operations and control, massively distributed ML and AI) to optimize overall sustainability and holistic approaches to trade off carbon footprint between forwarding, storage, and computation.",
      "ja": "* ネットワーキングアーキテクチャの組織を調査し、重要なクラスのアプリケーション（例：コンテンツ配信、ネットワーク設計、産業運用と制御内の計算インテリジェンスとネットワーク機能の最も適切な配置、大規模に分布したMLおよびAI）を調査して、全体的な持続可能性と総合的なアプローチを最適化して、転送、ストレージ、および計算の間で炭素排出率を取引します。"
    },
    {
      "indent": 6,
      "text": "* Models to assess and compare alternatives in providing networked services, e.g., evaluate carbon impact relative to where to perform computation, what information to cache, and what communication exchanges to conduct.",
      "ja": "* ネットワーク化されたサービスを提供する際の代替案を評価および比較するためのモデル。たとえば、計算を実行する場所、キャッシュする情報、および実行する通信交換に関連して炭素への影響を評価します。"
    },
    {
      "indent": 0,
      "text": "8. Conclusions",
      "section_title": true,
      "ja": "8. 結論"
    },
    {
      "indent": 3,
      "text": "How to make networks greener and reduce their carbon footprint is an important problem for the networking industry to address, both for societal and for economic reasons. This document has highlighted a number of the technical challenges and opportunities in that regard.",
      "ja": "ネットワークをより環境に優しいものにし、それらの二酸化炭素排出量を削減する方法は、社会的および経済的理由の両方で、ネットワーク業界が対処するための重要な問題です。この文書は、その点で多くの技術的な課題と機会を強調しています。"
    },
    {
      "indent": 3,
      "text": "Of those, perhaps the key challenge to address right away is the ability to expose at a fine granularity the energy impact of any networking actions. Providing visibility into this will enable many approaches to come towards a solution. It will be key to implementing optimization via control loops that can assess the energy impact of a decision taken. It will also help to answer questions such as (but not limited to) the following:",
      "ja": "それらのうち、おそらくすぐに対処すべき重要な課題は、ネットワーク動作によるエネルギーへの影響を細かい粒度で明らかにする機能です。これを可視化することで、解決策に向けた多くのアプローチが可能になります。これは、決定によるエネルギーへの影響を評価できる制御ループを介して最適化を実装するための鍵となります。また、次のような質問 (ただし、これらに限定されません) に答えるのにも役立ちます。"
    },
    {
      "indent": 6,
      "text": "* Is caching (with the associated storage) better than retransmitting from a different server (with the associated networking cost)?",
      "ja": "* キャッシュ（関連するストレージを使用して）は、別のサーバーからの再送信（関連するネットワーキングコスト）よりも優れていますか？"
    },
    {
      "indent": 6,
      "text": "* Is compression more energy efficient once factoring in the computation cost of compression vs. transmitting uncompressed data? Which compression scheme is more energy efficient?",
      "ja": "* 圧縮と非圧縮データの送信の計算コストを考慮すると、圧縮のほうがエネルギー効率が良いのでしょうか?どの圧縮方式がよりエネルギー効率が高いでしょうか?"
    },
    {
      "indent": 6,
      "text": "* Is energy saving of computing at an efficient hyperscale DC compensated by the networking cost to reach that DC?",
      "ja": "* 効率的なハイパースケールDCでのコンピューティングのエネルギー節約は、そのDCに到達するためのネットワーキングコストによって補償されていますか？"
    },
    {
      "indent": 6,
      "text": "* Is the overhead of gathering and transmitting fine-grained energy telemetry data offset by the total energy gain resulting from the better decisions that this data enables?",
      "ja": "* このデータが有効にするより良い決定に起因する総エネルギーゲインによって、きめ細かいエネルギーテレメトリデータの収集と送信のオーバーヘッドは？"
    },
    {
      "indent": 6,
      "text": "* Is the energy cost needed to transmit data to a Low Earth Orbit (LEO) satellite constellation offset by the fact that the constellation and any networking within it are powered by solar energy?",
      "ja": "* 地球低軌道 (LEO) 衛星群にデータを送信するために必要なエネルギー コストは、衛星群とその中のネットワークが太陽エネルギーによって電力供給されているという事実によって相殺されますか?"
    },
    {
      "indent": 6,
      "text": "* Is the energy cost of sending rockets to place routers in LEO amortized over time?",
      "ja": "* ロケットを送信するためのエネルギーコストは、レオのルーターを時間の経過とともに償却するために配置していますか？"
    },
    {
      "indent": 3,
      "text": "Determining where the sweet spots are and optimizing networks along those lines will be a key towards making networks greener. We expect to see significant advances across these areas and believe that researchers, developers, and operators of networking technology have an important role to play in this.",
      "ja": "スイートスポットがどこにあるかを決定し、それらのラインに沿ってネットワークを最適化することは、ネットワークをより環境に優しいものにするための鍵となります。これらの分野で大きな進歩を見て、ネットワーキング技術の研究者、開発者、およびオペレーターがこれにおいて重要な役割を果たしていると考えています。"
    },
    {
      "indent": 0,
      "text": "9. IANA Considerations",
      "section_title": true,
      "ja": "9. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document has no IANA actions.",
      "ja": "この文書には IANA のアクションはありません。"
    },
    {
      "indent": 0,
      "text": "10. Security Considerations",
      "section_title": true,
      "ja": "10. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "Security considerations may appear to be orthogonal to green networking considerations. However, there are a number of important caveats.",
      "ja": "セキュリティ上の考慮事項は、グリーンネットワーキングの考慮事項に対する直交のように見える場合があります。ただし、多くの重要な注意事項があります。"
    },
    {
      "indent": 3,
      "text": "Security vulnerabilities of networks may manifest themselves in compromised energy efficiency. For example, attackers could aim at increasing energy consumption to drive up attack victims' energy bills. Specific vulnerabilities will depend on the particular mechanisms. For example, in the case of monitoring energy consumption data, tampering with such data might result in compromised energy optimization control loops. Hence, any mechanisms to instrument and monitor the network for such data need to be properly secured to ensure authenticity.",
      "ja": "ネットワークのセキュリティの脆弱性は、エネルギー効率の低下として現れる場合があります。たとえば、攻撃者はエネルギー消費量を増加させ、攻撃対象者のエネルギー料金を押し上げることを狙う可能性があります。特定の脆弱性は特定のメカニズムによって異なります。たとえば、エネルギー消費データを監視する場合、そのようなデータを改ざんすると、エネルギー最適化制御ループが侵害される可能性があります。したがって、そのようなデータをネットワークで計測および監視するメカニズムは、信頼性を確保するために適切に保護される必要があります。"
    },
    {
      "indent": 3,
      "text": "In some cases, there are inherent trade-offs between security and maximal energy efficiency that might otherwise be achieved. An example is encryption, which requires additional computation for encryption and decryption activities and security handshakes, in addition to the need to send more traffic than necessitated by the entropy of the actual data stream. Likewise, mechanisms that allow to turn resources on or off could become a target for attackers.",
      "ja": "場合によっては、セキュリティと最大限のエネルギー効率の間には、別の方法で達成できる固有のトレードオフが存在します。例としては暗号化が挙げられます。暗号化では、実際のデータ ストリームのエントロピーによって必要とされるよりも多くのトラフィックを送信する必要があることに加えて、暗号化と復号化アクティビティおよびセキュリティ ハンドシェイクのための追加の計算が必要になります。同様に、リソースをオンまたはオフにできるメカニズムも攻撃者の標的になる可能性があります。"
    },
    {
      "indent": 3,
      "text": "Energy consumption can be used to create covert channels, which is a security risk for information leakage. For instance, the temperature of an element can be used to create a Thermal Covert Channel [TCC], or the reading/sharing of the measured energy consumption can be abused to create a covert channel (see for instance [DRAM] or [NewClass]). Power information may be used to create side-channel attacks. For instance, [SideChannel] provides a review of 20 years of study on this topic. Any new parameters considered in protocol designs or in measurements are susceptible to create such covert or side channels, and this should be taken into account while designing energy-efficient protocols.",
      "ja": "エネルギー消費は秘密チャネルの作成に使用される可能性があり、情報漏洩のセキュリティ リスクとなります。たとえば、要素の温度を使用して熱秘密チャネル [TCC] を作成したり、測定されたエネルギー消費の読み取り/共有を悪用して秘密チャネルを作成したりできます (たとえば、[DRAM] または [NewClass] を参照)。電力情報は、サイドチャネル攻撃を作成するために使用される可能性があります。たとえば、[SideChannel] は、このトピックに関する 20 年間の研究のレビューを提供しています。プロトコル設計または測定で考慮される新しいパラメータは、そのような秘密チャネルまたはサイドチャネルを作成する可能性があるため、エネルギー効率の高いプロトコルを設計する際にはこれを考慮する必要があります。"
    },
    {
      "indent": 0,
      "text": "11. Informative References",
      "section_title": true,
      "ja": "11. 参考引用"
    },
    {
      "indent": 3,
      "text": "[Ahlgren2012survey]\n           Ahlgren, B., Dannewitz, C., Imbrenda, C., Kutscher, D.,\n           and B. Ohlman, \"A survey of information-centric\n           networking\", IEEE Communications Magazine, vol. 50, no. 7,\n           pp. 26-36, DOI 10.1109/MCOM.2012.6231276, 2012,\n           <https://doi.org/10.1109/MCOM.2012.6231276>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[Alizadeh2010DCTCP]\n           Alizadeh, M., Greenberg, A., Maltz, D., Padhye, J., Patel,\n           P., Prabhakar, B., Sengupta, S., and M. Sridharan, \"Data\n           Center TCP (DCTCP)\", ACM SIGCOMM Computer Communication\n           Review, vol. 40, no. 4, pp. 63-74,\n           DOI 10.1145/1851275.1851192, 2010,\n           <https://doi.org/10.1145/1851275.1851192>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[Bianco2016energy]\n           Bianco, A., Mashayekhi, R., and M. Meo, \"Energy\n           consumption for data distribution in content delivery\n           networks\", IEEE International Conference on Communications\n           (ICC), pp. 1-6, DOI 10.1109/ICC.2016.7511356, 2016,\n           <https://doi.org/10.1109/ICC.2016.7511356>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[Bolla2011energy]\n           Bolla, R., Bruschi, R., Davoli, F., and F. Cucchietti,\n           \"Energy Efficiency in the Future Internet: A Survey of\n           Existing Approaches and Trends in Energy-Aware Fixed\n           Network Infrastructures\", IEEE Communications Surveys and\n           Tutorials, vol. 13, no. 2, pp. 223-244,\n           DOI 10.1109/SURV.2011.071410.00073, 2011,\n           <https://doi.org/10.1109/SURV.2011.071410.00073>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[Cervero15]\n           Cervero, A. G., Chincoli, M., Dittmann, L., Fischer, A.,\n           Garcia, A., Galán-Jiménez, J., Lefevre, L., Meer, H. D.,\n           Monteil, T., Monti, P., Orgerie, A., Pau, L., Phillips,\n           C., Ricciardi, S., Sharrock, R., Stolf, P., Trinh, T., and\n           L. Valcarenghi, \"Green Wired Networks\", Large-Scale\n           Distributed Systems and Energy Efficiency, pp. 41-80,\n           DOI 10.1002/9781118981122.ch3, 2015,\n           <https://doi.org/10.1002/9781118981122.ch3>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[Chabarek08]\n           Chabarek, J., Sommers, J., Barford, P., Estan, C., Tsiang,\n           D., and S. Wright, \"Power Awareness in Network Design and\n           Routing\", IEEE INFOCOM 2008 - The 27th Conference on\n           Computer Communications, pp. 457-465,\n           DOI 10.1109/INFOCOM.2008.93, 2008,\n           <https://doi.org/10.1109/INFOCOM.2008.93>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[DRAM]     Paiva, T. B., Navaridas, J., and R. Terada, \"Robust Covert\n           Channels Based on DRAM Power Consumption\", Information\n           Security, ISC 2019, Lecture Notes in Computer Science, vol\n           11723, DOI 10.1007/978-3-030-30215-3_16, 2019,\n           <https://doi.org/10.1007/978-3-030-30215-3_16>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[Emergy]   Raghavan, B. and J. Ma, \"The Energy and Emergy of the\n           Internet\", Proceedings of the 10th ACM Workshop on Hot\n           Topics in Networks, no. 9, pp. 1-6,\n           DOI 10.1145/2070562.2070571, 2011,\n           <https://doi.org/10.1145/2070562.2070571>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[Framework]\n           Faber, G., \"A framework to estimate emissions from virtual\n           conferences\", International Journal of Environmental\n           Studies, vol. 78, no. 4, pp. 608-623,\n           DOI 10.1080/00207233.2020.1864190, 2021,\n           <https://doi.org/10.1080/00207233.2020.1864190>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[GreenNet22]\n           Clemm, A. and C. Westphal, \"Challenges and Opportunities\n           in Green Networking\", 1st International Workshop on\n           Network Energy Efficiency in the Softwarization Era, IEEE\n           NetSoft 2022, DOI 10.1109/NetSoft54395.2022.9844020, June\n           2022, <https://doi.org/10.1109/NetSoft54395.2022.9844020>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[GREEN_METRICS]\n           Clemm, A., Ed., Pignataro, C., Ed., Schooler, E.,\n           Ciavaglia, L., Rezaki, A., Mirsky, G., and J. Tantsura,\n           \"Green Networking Metrics for Environmentally Sustainable\n           Networking\", Work in Progress, Internet-Draft, draft-cx-\n           green-green-metrics-00, 21 October 2024,\n           <https://datatracker.ietf.org/doc/html/draft-cx-green-\n           green-metrics-00>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[Herzen2011PIE]\n           Herzen, J., Westphal, C., and P. Thiran, \"Scalable routing\n           easy as PIE: A practical isometric embedding protocol\",\n           19th IEEE International Conference on Network Protocols\n           (ICNP), pp. 49-58, DOI 10.1109/ICNP.2011.6089081, 2011,\n           <https://doi.org/10.1109/ICNP.2011.6089081>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[Hossain2019]\n           Hossain, M., Georges, J., Rondeau, E., and T. Divoux,\n           \"Energy, Carbon and Renewable Energy: Candidate Metrics\n           for Green-Aware Routing?\", Sensors, vol. 19, no. 3,\n           DOI 10.3390/s19132901, June 2019,\n           <https://hal.science/hal-02169758/>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[IETF-Net0]\n           Daley, J., \"Towards a net zero IETF\", IETF News, 6 May\n           2022,\n           <https://www.ietf.org/blog/towards-a-net-zero-ietf/>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[Islam2012evaluating]\n           Islam, S. U. and J. Pierson, \"Evaluating Energy\n           Consumption in CDN Servers\", Proceedings of the Second\n           International Conference on ICT as Key Technology against\n           Global Warming, Lecture Notes in Computer Science, vol\n           7453, pp. 64-78, DOI 10.1007/978-3-642-32606-6_6, 2012,\n           <https://doi.org/10.1007/978-3-642-32606-6_6>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[Junkyard] Switzer, J., Kastner, R., and P. Pannuto, \"Architecture of\n           a Junkyard Datacenter\", DOI 10.48550/arXiv.2110.06870,\n           arXiv: 2110.06870v1, 2021,\n           <https://arxiv.org/abs/2110.06870v1>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[Krol2017NFaaS]\n           Krol, M. and I. Psaras, \"NFaaS: Named Function as a\n           Service\", ICN '17: Proceedings of the 4th ACM Conference\n           on Information-Centric Networking, pp. 134-144,\n           DOI 10.1145/3125719.3125727, 2017,\n           <https://doi.org/10.1145/3125719.3125727>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[Mathew2011energy]\n           Mathew, V., Sitaraman, R., and P. Shenoy, \"Energy-Aware\n           Load Balancing in Content Delivery Networks\",\n           DOI 10.48550/arXiv.1109.5641, arXiv: 1109.5641v1, 2011,\n           <https://arxiv.org/abs/1109.5641>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[NewClass] Khatamifard, S. K., Wang, L., Kose, S., and U. R.\n           Karpuzcu, \"A New Class of Covert Channels Exploiting Power\n           Management Vulnerabilities\", IEEE Computer Architecture\n           Letters, vol. 15, no. 2, pp. 201-204,\n           DOI 10.1109/LCA.2018.2860006, 2018,\n           <https://doi.org/10.1109/LCA.2018.2860006>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[POWER_YANG]\n           Li, T. and R. Bonica, \"A YANG model for Power Management\",\n           Work in Progress, Internet-Draft, draft-li-green-power-00,\n           17 October 2024, <https://datatracker.ietf.org/doc/html/\n           draft-li-green-power-00>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[QUAL]     Li, R., Makhijani, K., Yousefi, H., Westphal, C., Xong,\n           L., Wauters, T., and F. D. Turck, \"A Framework for\n           Qualitative Communications using Big Packet Protocol\",\n           NEAT'19: Proceedings of the ACM Sigcomm Workshop On\n           Networking For Emerging Applications And Technologies, pp.\n           22-28, DOI 10.1145/3341558.3342201, 2019,\n           <https://doi.org/10.1145/3341558.3342201>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[Ren2018jordan]\n           Ren, J., Lu, K., Westphal, C., Wang, J., Wang, J., Song,\n           T., Liu, S., and J. Wang, \"JORDAN: A Novel Traffic\n           Engineering Algorithm for Dynamic Adaptive Streaming over\n           HTTP\", 2018 International Conference on Computing,\n           Networking and Communications (ICNC), pp. 581-587,\n           DOI 10.1109/ICCNC.2018.8390337, 2018,\n           <https://doi.org/10.1109/ICCNC.2018.8390337>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC3031]  Rosen, E., Viswanathan, A., and R. Callon, \"Multiprotocol\n           Label Switching Architecture\", RFC 3031,\n           DOI 10.17487/RFC3031, January 2001,\n           <https://www.rfc-editor.org/info/rfc3031>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC3095]  Bormann, C., Burmeister, C., Degermark, M., Fukushima, H.,\n           Hannu, H., Jonsson, L., Hakenberg, R., Koren, T., Le, K.,\n           Liu, Z., Martensson, A., Miyazaki, A., Svanbro, K.,\n           Wiebke, T., Yoshimura, T., and H. Zheng, \"RObust Header\n           Compression (ROHC): Framework and four profiles: RTP, UDP,\n           ESP, and uncompressed\", RFC 3095, DOI 10.17487/RFC3095,\n           July 2001, <https://www.rfc-editor.org/info/rfc3095>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC3168]  Ramakrishnan, K., Floyd, S., and D. Black, \"The Addition\n           of Explicit Congestion Notification (ECN) to IP\",\n           RFC 3168, DOI 10.17487/RFC3168, September 2001,\n           <https://www.rfc-editor.org/info/rfc3168>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC7950]  Bjorklund, M., Ed., \"The YANG 1.1 Data Modeling Language\",\n           RFC 7950, DOI 10.17487/RFC7950, August 2016,\n           <https://www.rfc-editor.org/info/rfc7950>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC8402]  Filsfils, C., Ed., Previdi, S., Ed., Ginsberg, L.,\n           Decraene, B., Litkowski, S., and R. Shakir, \"Segment\n           Routing Architecture\", RFC 8402, DOI 10.17487/RFC8402,\n           July 2018, <https://www.rfc-editor.org/info/rfc8402>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC9000]  Iyengar, J., Ed. and M. Thomson, Ed., \"QUIC: A UDP-Based\n           Multiplexed and Secure Transport\", RFC 9000,\n           DOI 10.17487/RFC9000, May 2021,\n           <https://www.rfc-editor.org/info/rfc9000>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC9330]  Briscoe, B., Ed., De Schepper, K., Bagnulo, M., and G.\n           White, \"Low Latency, Low Loss, and Scalable Throughput\n           (L4S) Internet Service: Architecture\", RFC 9330,\n           DOI 10.17487/RFC9330, January 2023,\n           <https://www.rfc-editor.org/info/rfc9330>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[Shannon]  Shannon, C. E., \"A Mathematical Theory of Communication\",\n           The Bell System Technical Journal, vol. 27, no. 3, pp.\n           379-423, DOI 10.1002/j.1538-7305.1948.tb01338.x, July\n           1948,\n           <https://doi.org/10.1002/j.1538-7305.1948.tb01338.x>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[SideChannel]\n           Randolph, M. and W. Diehl, \"Power Side-Channel Attack\n           Analysis: A Review of 20 Years of Study for the Layman\",\n           Cryptography, vol. 4, no. 2,\n           DOI 10.3390/cryptography4020015, 2020,\n           <https://doi.org/10.3390/cryptography4020015>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[TCC]      Rahimi, P., Singh, A. K., and X. Wang, \"Selective Noise\n           Based Power-Efficient and Effective Countermeasure Against\n           Thermal Covert Channel Attacks in Multi-Core Systems\",\n           Journal on Low Power Electronics and Applications, vol.\n           12, no. 2, DOI 10.3390/jlpea12020025, 2022,\n           <https://doi.org/10.3390/jlpea12020025>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[Telefonica2024]\n           Telefonica, \"Telefonica Consolidated Annual Report 2024\",\n           2025, <https://www.telefonica.com/en/wp-\n           content/uploads/sites/5/2025/02/Consolidated-Annual-\n           Accounts-2024.pdf>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[TradeOff] Welzl, M., \"Not a Trade-Off: On the Wi-Fi Energy\n           Efficiency of Effective Internet Congestion Control\", 2022\n           17th Wireless On-Demand Network Systems and Services\n           Conference (WONS), pp. 1-4,\n           DOI 10.23919/WONS54113.2022.9764413, 2022,\n           <https://doi.org/10.23919/WONS54113.2022.9764413>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[TVR_REQS] King, D., Contreras, L. M., Sipos, B., and L. Zhang, \"TVR\n           (Time-Variant Routing) Requirements\", Work in Progress,\n           Internet-Draft, draft-ietf-tvr-requirements-06, 7 July\n           2025, <https://datatracker.ietf.org/doc/html/draft-ietf-\n           tvr-requirements-06>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[Westphal2021qualitative]\n           Westphal, C., He, D., Makhijani, K., and R. Li,\n           \"Qualitative Communications for Augmented Reality and\n           Virtual Reality\", 22nd IEEE International Conference on\n           High Performance Switching and Routing (HPSR), pp. 1-6,\n           DOI 10.1109/HPSR52026.2021.9481793, 2021,\n           <https://doi.org/10.1109/HPSR52026.2021.9481793>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[Wolf2014choicenet]\n           Tilman, W., Griffioen, J., Calvert, L., Dutta, R.,\n           Rouskas, G., Baldin, I., and A. Nagurney, \"ChoiceNet:\n           Toward an Economy Plane for the Internet\", ACM SIGCOMM\n           Computer Communications Review, vol. 44, no. 3, pp. 58-65,\n           DOI 10.1145/2656877.2656886, July 2014,\n           <https://doi.org/10.1145/2656877.2656886>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Acknowledgments",
      "section_title": true,
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "The authors thank Dave Oran for providing the information regarding covert channels using energy measurements and Mike King for an exceptionally thorough review and useful comments.",
      "ja": "著者は、エネルギー測定を使用して秘密のチャネルに関する情報を提供してくれたDave Oranに感謝し、Mike Kingは非常に徹底的にレビューと有用なコメントを求めています。"
    },
    {
      "indent": 0,
      "text": "Contributors",
      "section_title": true,
      "ja": "貢献者"
    },
    {
      "indent": 3,
      "text": "Michael Welzl\nUniversity of Oslo\nEmail: michawe@ifi.uio.no",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "section_title": true,
      "ja": "著者の住所"
    },
    {
      "indent": 3,
      "text": "Alexander Clemm (editor)\nSympotech\nLos Gatos, CA\nUnited States of America\nEmail: ludwig@clemm.org",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Carlos Pignataro (editor)\nNorth Carolina State University & Blue Fern Consulting\nUnited States of America\nEmail: cmpignat@ncsu.edu, carlos@bluefern.consulting",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Cedric Westphal\nDepartment of Computer Science and Engineering\nUniversity of California, Santa Cruz\nEmail: cedric@ucsc.edu",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Laurent Ciavaglia\nNokia\nEmail: laurent.ciavaglia@nokia.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Jeff Tantsura\nNvidia\nEmail: jefftant.ietf@gmail.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Marie-Paule Odini\nEmail: mp.odini@orange.fr",
      "raw": true,
      "ja": ""
    }
  ]
}