{
  "title": {
    "text": "RFC 9245 - IETF Discussion List Charter (RFC 9245)",
    "ja": "RFC 9245 - IETFディスカッションリストチャーター（RFC 9245）"
  },
  "number": 9245,
  "created_at": "2022-06-23 02:59:03.401432+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         L. Eggert\nRequest for Comments: 9245                                        NetApp\nBCP: 45                                                        S. Harris\nObsoletes: 3005                                                June 2022\nUpdates: 3683\nCategory: Best Current Practice\nISSN: 2070-1721",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 22,
      "text": "IETF Discussion List Charter",
      "ja": "IETFディスカッションリストチャーター"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "The Internet Engineering Task Force (IETF) discussion mailing list furthers the development and specification of Internet technology through the general discussion of technical, procedural, operational, and other topics for which no dedicated mailing lists exist. As this is the most general IETF mailing list, considerable latitude in terms of topics is allowed, but there are posts and topics that are unsuitable for this mailing list. This document defines the charter for the IETF discussion list and explains its scope.",
      "ja": "インターネットエンジニアリングタスクフォース（IETF）ディスカッションメーリングリストは、専用の郵送リストが存在しない技術、手続き、運用、およびその他のトピックの一般的な議論を通じて、インターネットテクノロジーの開発と仕様を促進します。これは最も一般的なIETFメーリングリストであるため、トピックに関してかなりの緯度が許可されていますが、このメーリングリストには不適切な投稿やトピックがあります。このドキュメントは、IETFディスカッションリストのチャーターを定義し、その範囲を説明します。"
    },
    {
      "indent": 3,
      "text": "This document obsoletes RFC 3005 and updates RFC 3683.",
      "ja": "このドキュメントは、RFC 3005を廃止し、RFC 3683を更新します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This memo documents an Internet Best Current Practice.",
      "ja": "このメモは、インターネットの最高の現在の練習を文書化しています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on BCPs is available in Section 2 of RFC 7841.",
      "ja": "このドキュメントは、インターネットエンジニアリングタスクフォース（IETF）の製品です。IETFコミュニティのコンセンサスを表しています。公開レビューを受けており、インターネットエンジニアリングステアリンググループ（IESG）からの出版が承認されています。BCPの詳細については、RFC 7841のセクション2で入手できます。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at https://www.rfc-editor.org/info/rfc9245.",
      "ja": "このドキュメントの現在のステータス、任意のERRATA、およびそのフィードバックを提供する方法に関する情報は、https：//www.rfc-editor.org/info/rfc9245で取得できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2022 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（c）2022 IETF Trustおよび文書著者として特定された人。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (https://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Revised BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Revised BSD License.",
      "ja": "このドキュメントは、BCP 78およびIETFドキュメント（https://trustee.ietf.org/license-info）に関連するIETF Trustの法的規定の対象となります。この文書に関するあなたの権利と制限を説明するので、これらの文書を注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、セクション4.Eで説明されている法的規定のセクション4.Eで説明されており、修正されたBSDライセンスで説明されているように保証なしで提供される修正されたBSDライセンステキストを含める必要があります。"
    },
    {
      "indent": 3,
      "text": "This document may contain material from IETF Documents or IETF Contributions published or made publicly available before November 10, 2008. The person(s) controlling the copyright in some of this material may not have granted the IETF Trust the right to allow modifications of such material outside the IETF Standards Process. Without obtaining an adequate license from the person(s) controlling the copyright in such materials, this document may not be modified outside the IETF Standards Process, and derivative works of it may not be created outside the IETF Standards Process, except to format it for publication as an RFC or to translate it into languages other than English.",
      "ja": "このドキュメントには、2008年11月10日までに公開または公開されたIETFドキュメントまたはIETFの寄付からの資料が含まれている場合があります。IETF標準プロセスの外。そのような資料の著作権を制御する人から適切なライセンスを取得せずに、このドキュメントはIETF標準プロセスの外側に変更されない場合があり、その派生作業は、ITF標準プロセスの外側で作成されない場合があります。RFCとしての出版またはそれを英語以外の言語に翻訳するため。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction\n2.  Charter for the IETF Discussion List\n3.  Moderation\n4.  Security Considerations\n5.  IANA Considerations\n6.  References\n  6.1.  Normative References\n  6.2.  Informative References\nAcknowledgements\nAuthors' Addresses",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The IETF discussion list [IETF-DISCUSS] furthers the development and specification of Internet technology through the general discussion of technical, procedural, operational, and other topics for which no dedicated mailing lists exist. As this is the most general IETF mailing list, considerable latitude in terms of topics is allowed. However, there are posts and topics that are unsuitable for this mailing list. This document defines the charter for the IETF discussion list and explains its scope.",
      "ja": "IETFディスカッションリスト[IETF-Discuss]は、専用のメーリングリストが存在しない技術的、手続き的、運用的、およびその他のトピックの一般的な議論を通じて、インターネットテクノロジーの開発と仕様を促進します。これは最も一般的なIETFメーリングリストであるため、トピックに関してかなりの緯度が許可されています。ただし、このメーリングリストには不適切な投稿やトピックがあります。このドキュメントは、IETFディスカッションリストのチャーターを定義し、その範囲を説明します。"
    },
    {
      "indent": 3,
      "text": "The IETF Note Well [NOTE-WELL] applies to discussions on the IETF discussion list and all other IETF mailing lists, and requires conformance with the IETF Guidelines for Conduct [RFC7154] and the Anti-Harassment Policy [RFC7776], among others.",
      "ja": "IETF Noteは、IETFディスカッションリストおよびその他のすべてのIETFメーリングリストに関するディスカッションに適用され、IETFガイドライン[RFC7154]および反ハラスメントポリシー[RFC7776]などに適合する必要があります。"
    },
    {
      "indent": 3,
      "text": "This document obsoletes [RFC3005], as it documents the use of other mailing lists for discussions that were previously in scope for the IETF discussion list, refers to applicable policies such as the Guidelines for Conduct [RFC7154] and the Anti-Harassment Policy [RFC7776], and clarifies moderation procedures. It also updates part of Section 1 of [RFC3683], which copies the list of \"inappropriate postings\" from [RFC3005]. The list in [RFC3683] is hence updated by the new list in Section 2.",
      "ja": "このドキュメントは、以前はIETFディスカッションリストの範囲であったディスカッションのために他のメーリングリストの使用を文書化しているため、廃止[RFC3005]であり、行動のガイドライン[RFC7154]や反ハラスメントポリシー[RFC7776などの該当するポリシーを指します。]、およびモデレート手順を明確にします。また、[RFC3683]のセクション1の一部を更新し、[RFC3005]の「不適切な投稿」のリストをコピーします。したがって、[RFC3683]のリストは、セクション2の新しいリストによって更新されます。"
    },
    {
      "indent": 0,
      "text": "2. Charter for the IETF Discussion List",
      "section_title": true,
      "ja": "2. IETFディスカッションリストのチャーター"
    },
    {
      "indent": 3,
      "text": "The IETF discussion list is meant for discussions for which a more appropriate list does not exist, such as discussions that do not fall within the scope of any working group, area, or other established list. When there is an existing venue for discussion, this should be noted and discussion should be moved there.",
      "ja": "IETFディスカッションリストは、ワーキンググループ、エリア、またはその他の確立されたリストの範囲内に該当しないディスカッションなど、より適切なリストが存在しない議論を目的としています。議論のための既存の会場がある場合、これは注意し、議論をそこに移動する必要があります。"
    },
    {
      "indent": 3,
      "text": "When no dedicated mailing list exists for a topic, it may be preferable to request that one be created [NON-WG-LISTS] rather than discuss it on the IETF discussion list. Availability of the new list may be announced on the IETF discussion list and on other related lists, such as area lists.",
      "ja": "トピックに専用のメーリングリストが存在しない場合、IETFディスカッションリストで議論するよりも[非WGリスト]を作成することを要求することが望ましい場合があります。新しいリストの可用性は、IETFディスカッションリストおよびエリアリストなどのその他の関連リストで発表される場合があります。"
    },
    {
      "indent": 3,
      "text": "Appropriate postings to the IETF discussion list include:",
      "ja": "IETFディスカッションリストへの適切な投稿には次のものがあります。"
    },
    {
      "indent": 3,
      "text": "* Initial discussion of technical issues that are candidates for IETF work, but appropriate mailing lists have not yet been identified.",
      "ja": "* IETF作業の候補者であるが、適切なメーリングリストがまだ特定されていない技術的な問題の最初の議論はまだ特定されていません。"
    },
    {
      "indent": 3,
      "text": "* Questions and clarifications concerning practical aspects of IETF meetings, although most of these topics are better brought up on the discussion list for IETF LLC administrative issues [ADMIN-DISCUSS] or the attendee discussion list for a given IETF meeting.",
      "ja": "* IETF会議の実用的な側面に関する質問と説明は、これらのトピックのほとんどは、IETF LLCの管理問題[管理訓練]のディスカッションリストまたは特定のIETF会議の出席者ディスカッションリストでより適切に作成されています。"
    },
    {
      "indent": 3,
      "text": "* Announcements of conferences, events, or activities that are sponsored or endorsed by the IETF, IRTF, IAB or the Internet Society, although the IETF announcement list [IETF-ANNOUNCE] is the preferred list for these.",
      "ja": "* IETF、IRTF、IAB、またはインターネット協会が後援または承認された会議、イベント、または活動の発表。"
    },
    {
      "indent": 3,
      "text": "* Discussions of IETF direction, policy, and the standards process in general, when a more suitable list (such as the discussion list for IETF LLC administrative issues [ADMIN-DISCUSS], the IAB discussion list for architectural issues [ARCH-DISCUSS], a meeting attendees list, a process-oriented WG list, etc.) cannot be identified.",
      "ja": "* より適切なリスト（IETF LLCの管理問題のディスカッションリスト[管理者discuss]などのIETF方向、ポリシー、および標準プロセスの議論、建築問題のIABディスカッションリスト[Arch Discuss]、A出席者リスト、プロセス指向のWGリストなど）を特定することはできません。"
    },
    {
      "indent": 3,
      "text": "These topics used to be in scope for the IETF discussion list, but have since moved to dedicated lists:",
      "ja": "これらのトピックは、以前はIETFディスカッションリストの範囲にありましたが、その後、専用リストに移行しました。"
    },
    {
      "indent": 3,
      "text": "* Last Call discussions of documents now take place on the IETF Last Calls mailing list [LAST-CALLS].",
      "ja": "* ドキュメントの最後のコールディスカッションは、IETFの最後の呼び出しメーリングリスト[ラストコール]で行われます。"
    },
    {
      "indent": 3,
      "text": "* Discussion of IETF administrative policies now takes place on the discussion list for IETF LLC administrative issues [ADMIN-DISCUSS].",
      "ja": "* IETF管理ポリシーの議論は、IETF LLCの管理問題[管理者紛争]のディスカッションリストで行われます。"
    },
    {
      "indent": 3,
      "text": "Inappropriate postings include:",
      "ja": "不適切な投稿には次のものがあります。"
    },
    {
      "indent": 3,
      "text": "* Advertising and other unsolicited bulk e-mail",
      "ja": "* 広告およびその他の未承諾のバルク電子メール"
    },
    {
      "indent": 3,
      "text": "* Discussion of subjects unrelated to IETF policy, meetings, activities, or technical topics",
      "ja": "* IETFのポリシー、会議、活動、または技術的なトピックとは無関係の被験者の議論"
    },
    {
      "indent": 3,
      "text": "* Uncivil commentary, regardless of the general subject, per the IETF Note Well [NOTE-WELL]",
      "ja": "* 一般的な主題に関係なく、uncivilの解説は、ietf note well [note-well]によると"
    },
    {
      "indent": 3,
      "text": "* Announcements of conferences, events, or activities that are not sponsored or endorsed by the IETF, IRTF, IAB, or the Internet Society.",
      "ja": "* IETF、IRTF、IAB、またはインターネット協会が後援または承認されていない会議、イベント、または活動の発表。"
    },
    {
      "indent": 0,
      "text": "3. Moderation",
      "section_title": true,
      "ja": "3. 節度"
    },
    {
      "indent": 3,
      "text": "The IETF Chair appoints _Moderators_ (previously known as the \"sergeant-at-arms\") for the IETF discussion list that are empowered to restrict posting by a person, or to an email thread, when the content is inappropriate and represents a pattern of abuse. They are encouraged to take into account the overall nature of the postings by an individual and whether particular postings are typical or an aberration.",
      "ja": "IETF椅子は、コンテンツが不適切であり、虐待のパターンを表す場合、人による投稿を制限する権限を与えられているIETFディスカッションリストの_moderators_（以前は「軍曹」として知られていました）を任命します。。彼らは、個人による投稿の全体的な性質と、特定の投稿が典型的であるか異常であるかを考慮することを奨励されています。"
    },
    {
      "indent": 3,
      "text": "Moderation of the IETF discussion list, including the handling of any appeals, is guided by the IETF discussion list charter specified in Section 2, and the related guidance from Section 1 that applies to all mailing lists. The moderators are selected from within the community to moderate the community. Because the IESG and IAB are in the appeals chain for moderator decisions (see below), the IETF Chair therefore should not appoint a moderator who is serving in such a role. If a moderator is selected for the IESG or IAB, they will step down from the moderator team.",
      "ja": "Appealの取り扱いを含むIETFディスカッションリストの緩和は、セクション2で指定されたIETFディスカッションリストチャーターと、すべてのメーリングリストに適用されるセクション1の関連ガイダンスによって導かれます。モデレーターは、コミュニティを緩和するためにコミュニティ内から選択されます。IESGとIABは、モデレーターの決定のためにアピールチェーンにいるため（以下を参照）、IETF椅子はそのような役割を果たしているモデレーターを任命すべきではありません。IESGまたはIABにモデレーターが選択されている場合、モデレーターチームから辞任します。"
    },
    {
      "indent": 3,
      "text": "Apart from appointing moderators, the IETF Chair should refrain from the day-to-day operation and management of the moderator team. The moderator team will independently define, publish, and execute their role; see the current set of operating procedures [MOD-SOP] and abuse patterns [MOD-UPC]. The moderator team should reach out to the IETF Chair for any conflict resolution in a timely manner.",
      "ja": "モデレーターの任命とは別に、IETFチェアは、モデレーターチームの日々の運用と管理を控える必要があります。モデレーターチームは、その役割を独立して定義、公開、および実行します。現在の一連の操作手順[MOD-SOP]および乱用パターン[MOD-UPC]を参照してください。モデレーターチームは、タイムリーに紛争解決のためにIETFチェアに連絡する必要があります。"
    },
    {
      "indent": 3,
      "text": "Because a moderator serves at the discretion of the IETF Chair -- even if the IETF Chair is not otherwise involved in the operation of the moderator team -- any moderator decision can be appealed to the IETF Chair, per [RFC2026]. Decisions by the IETF Chair can be appealed to the IESG as whole, again per [RFC2026].",
      "ja": "モデレーターは、IETF椅子の裁量で、IETF椅子がモデレーターチームの運用に関与していなくても、モデレーターの決定をIETF椅子に訴えることができるため、[RFC2026]に訴えることができます。IETF椅子による決定は、再び[RFC2026]に従って、IESG全体に訴えることができます。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4. セキュリティ上の考慮事項"
    },
    {
      "indent": 3,
      "text": "The usual security considerations [RFC3552] do not apply to this document.",
      "ja": "通常のセキュリティに関する考慮事項[RFC3552]は、このドキュメントには適用されません。"
    },
    {
      "indent": 3,
      "text": "Potential abuse of the moderation process for the suppression of undesired opinions is counteracted by the availability of an appeals process, per Section 3.",
      "ja": "望ましくない意見の抑制のための緩和プロセスの潜在的な乱用は、セクション3によると、控訴プロセスの利用可能性によって打ち消されます。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "ja": "5. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document does not request any IANA actions.",
      "ja": "このドキュメントでは、IANAアクションを要求しません。"
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "ja": "6. 参考文献"
    },
    {
      "indent": 0,
      "text": "6.1. Normative References",
      "section_title": true,
      "ja": "6.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC2026] Bradner, S., \"The Internet Standards Process -- Revision 3\", BCP 9, RFC 2026, DOI 10.17487/RFC2026, October 1996, <https://www.rfc-editor.org/info/rfc2026>.",
      "ja": "[RFC2026] Bradner、S。、「インターネット標準プロセス - 改訂3」、BCP 9、RFC 2026、DOI 10.17487/RFC2026、1996年10月、<https://www.rfc-editor.org/info/rfc26>。"
    },
    {
      "indent": 0,
      "text": "6.2. Informative References",
      "section_title": true,
      "ja": "6.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[ADMIN-DISCUSS] IETF, \"admin-discuss -- Discussion list for IETF LLC administrative issues\", <https://ietf.org/mailman/listinfo/admin-discuss>.",
      "ja": "[Admin-Discuss] IETF、「Admin-Discuss-IETF LLC管理問題のディスカッションリスト」、<https://ietf.org/mailman/listinfo/admin-discuss>。"
    },
    {
      "indent": 3,
      "text": "[ARCH-DISCUSS] IAB, \"Architecture-discuss -- open discussion forum for long/wide-range architectural issues\", <https://ietf.org/mailman/listinfo/architecture-discuss>.",
      "ja": "[Arch Discuss] IAB、「Architecture-Discuss-ロング/ワイドレンジアーキテクチャの問題のためのオープンディスカッションフォーラム」、<https://ietf.org/mailman/listinfo/architecture-discuss>。"
    },
    {
      "indent": 3,
      "text": "[IETF-ANNOUNCE] IETF, \"IETF-Announce -- IETF announcement list. No discussions.\", <https://ietf.org/mailman/listinfo/ietf-announce>.",
      "ja": "[IETF-Announce] IETF、「IETF-Announce-IETFアナウンスリスト。議論なし。」、<https://ietf.org/mailman/listinfo/ietf-announce>。"
    },
    {
      "indent": 3,
      "text": "[IETF-DISCUSS] IETF, \"ietf -- IETF-Discussion\", <https://ietf.org/mailman/listinfo/ietf>.",
      "ja": "[ietf-discuss] ietf、 \"ietf-ietf-discussion\"、<https://ietf.org/mailman/listinfo/ietf>。"
    },
    {
      "indent": 3,
      "text": "[LAST-CALLS] IETF, \"last-call -- IETF Last Calls\", <https://ietf.org/mailman/listinfo/last-call>.",
      "ja": "[last-calls] ietf、 \"last-call-ietf last calls\"、<https://ietf.org/mailman/listinfo/last-call>。"
    },
    {
      "indent": 3,
      "text": "[MOD-SOP] IETF, \"Sergeant-at-Arms Standard Operating Procedures\", commit c1abcb0 , 9 October 2019, <https://github.com/ietf/saa/blob/main/sop.md>.",
      "ja": "[mod-sop] IETF、「軍曹標準操作手順」、Commit C1ABCB0、2019年10月9日、<https://github.com/ietf/saa/blob/main/sop.md>。"
    },
    {
      "indent": 3,
      "text": "[MOD-UPC] IETF, \"Unprofessional commentary\", commit e120305 , 8 October 2019, <https://github.com/ietf/saa/blob/main/ unprofessional-commentary.md>.",
      "ja": "[mod-upc] IETF、 \"Unprofessional Commentary\"、Commit E120305、2019年10月8日、<https://github.com/ietf/saa/blob/main/ unprofessional-commentary.md>。"
    },
    {
      "indent": 3,
      "text": "[NON-WG-LISTS] IETF, \"Non-Working Group Email List Guidelines\", <https://ietf.org/how/lists/nonwglist-guidelines/>.",
      "ja": "[Non-WG-Lists] IETF、「非操作グループのメーリングリストガイドライン」、<https://ietf.org/how/lists/nonwglist-guidelines/>。"
    },
    {
      "indent": 3,
      "text": "[NOTE-WELL] IETF, \"Note Well\", <https://ietf.org/about/note-well/>.",
      "ja": "[note-well] ietf、 \"note well\"、<https://ietf.org/about/note-well/>。"
    },
    {
      "indent": 3,
      "text": "[RFC3005] Harris, S., \"IETF Discussion List Charter\", BCP 45, RFC 3005, DOI 10.17487/RFC3005, November 2000, <https://www.rfc-editor.org/info/rfc3005>.",
      "ja": "[RFC3005] Harris、S。、「IETFディスカッションリストチャーター」、BCP 45、RFC 3005、DOI 10.17487/RFC3005、2000年11月、<https://www.rfc-editor.org/info/rfc3005>。"
    },
    {
      "indent": 3,
      "text": "[RFC3160] Harris, S., \"The Tao of IETF - A Novice's Guide to the Internet Engineering Task Force\", RFC 3160, DOI 10.17487/RFC3160, August 2001, <https://www.rfc-editor.org/info/rfc3160>.",
      "ja": "[RFC3160]ハリス、S。、「IETFのタオ - インターネット工学タスクフォースへの初心者のガイド」、RFC 3160、DOI 10.17487/RFC3160、2001年8月、<https://www.rfc-editor.org/info/RFC3160>。"
    },
    {
      "indent": 3,
      "text": "[RFC3184] Harris, S., \"IETF Guidelines for Conduct\", RFC 3184, DOI 10.17487/RFC3184, October 2001, <https://www.rfc-editor.org/info/rfc3184>.",
      "ja": "[RFC3184] Harris、S。、「行動のためのIETFガイドライン」、RFC 3184、DOI 10.17487/RFC3184、2001年10月、<https://www.rfc-editor.org/info/rfc3184>。"
    },
    {
      "indent": 3,
      "text": "[RFC3552] Rescorla, E. and B. Korver, \"Guidelines for Writing RFC Text on Security Considerations\", BCP 72, RFC 3552, DOI 10.17487/RFC3552, July 2003, <https://www.rfc-editor.org/info/rfc3552>.",
      "ja": "[RFC3552] Rescorla、E。and B. Korver、「セキュリティに関する考慮事項に関するRFCテキストを書くためのガイドライン」、BCP 72、RFC 3552、DOI 10.17487/RFC3552、2003年7月、<https：//www.rfc-editor.org/情報/RFC3552>。"
    },
    {
      "indent": 3,
      "text": "[RFC3683] Rose, M., \"A Practice for Revoking Posting Rights to IETF Mailing Lists\", BCP 83, RFC 3683, DOI 10.17487/RFC3683, March 2004, <https://www.rfc-editor.org/info/rfc3683>.",
      "ja": "[RFC3683] Rose、M。、「IETFメーリングリストへの投稿権を取り消すための慣行」、BCP 83、RFC 3683、DOI 10.17487/RFC3683、2004年3月、<https://www.rfc-editor.org/info/RFC3683>。"
    },
    {
      "indent": 3,
      "text": "[RFC7154] Moonesamy, S., Ed., \"IETF Guidelines for Conduct\", BCP 54, RFC 7154, DOI 10.17487/RFC7154, March 2014, <https://www.rfc-editor.org/info/rfc7154>.",
      "ja": "[RFC7154] Moonesamy、S.、ed。、「行動のためのIETFガイドライン」、BCP 54、RFC 7154、DOI 10.17487/RFC7154、2014年3月、<https://www.rfc-editor.org/info/rfc7154>"
    },
    {
      "indent": 3,
      "text": "[RFC7776] Resnick, P. and A. Farrel, \"IETF Anti-Harassment Procedures\", BCP 25, RFC 7776, DOI 10.17487/RFC7776, March 2016, <https://www.rfc-editor.org/info/rfc7776>.",
      "ja": "[RFC7776] Resnick、P。and A. Farrel、「IETF Anti Harassment手順」、BCP 25、RFC 7776、DOI 10.17487/RFC7776、2016年3月、<https://www.rfc-edtor.org/info/rfc7776>。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Susan R. Harris authored [RFC3005], which this document replaces. In addition to many technical contributions to the IETF, Susan authored a number of other foundational documents, such as the original \"IETF Guidelines for Conduct\" [RFC3184] and the original \"Tao of the IETF\" [RFC3160]. Susan R. Harris passed away in early 2022. This document is dedicated to her memory, as a small token of appreciation of her many contributions.",
      "ja": "スーザンR.ハリスは[RFC3005]を作成しました。この文書は置き換えられています。IETFへの多くの技術的貢献に加えて、スーザンは、元の「IETFガイドラインの行動ガイドライン」[RFC3184]や元の「IETFのTAO」[RFC3160]など、他の多くの基本文書を執筆しました。スーザン・R・ハリスは2022年初頭に亡くなりました。この文書は、彼女の多くの貢献に対する感謝の小さなトークンとして、彼女の記憶に捧げられています。"
    },
    {
      "indent": 3,
      "text": "The following people have made other contributions to this document:",
      "ja": "次の人々は、この文書に他の貢献をしています。"
    },
    {
      "indent": 3,
      "text": "* Adrian Farrel",
      "ja": "* エイドリアン・ファレル"
    },
    {
      "indent": 3,
      "text": "* Barry Leiba",
      "ja": "* バリー・レイバ"
    },
    {
      "indent": 3,
      "text": "* Ben Kaduk",
      "ja": "* ベン・カドゥク"
    },
    {
      "indent": 3,
      "text": "* Brian Carpenter",
      "ja": "* ブライアンカーペンター"
    },
    {
      "indent": 3,
      "text": "* Carsten Bormann",
      "ja": "* Carsten Bormann"
    },
    {
      "indent": 3,
      "text": "* Christian Huitema",
      "ja": "* クリスチャンフイテマ"
    },
    {
      "indent": 3,
      "text": "* Dhruv Dhody",
      "ja": "* dhruv dhody"
    },
    {
      "indent": 3,
      "text": "* Eric Rescorla",
      "ja": "* エリック・レスコルラ"
    },
    {
      "indent": 3,
      "text": "* Eric Vyncke",
      "ja": "* エリック・ヴィンケ"
    },
    {
      "indent": 3,
      "text": "* Francesca Palombini",
      "ja": "* フランチェスカ・パロビニ"
    },
    {
      "indent": 3,
      "text": "* John Scudder",
      "ja": "* ジョン・スカダー"
    },
    {
      "indent": 3,
      "text": "* Lloyd Wood",
      "ja": "* ロイドウッド"
    },
    {
      "indent": 3,
      "text": "* Martin Thomson",
      "ja": "* マーティン・トムソン"
    },
    {
      "indent": 3,
      "text": "* Robert Wilton",
      "ja": "* ロバート・ウィルトン"
    },
    {
      "indent": 3,
      "text": "* Subramanian Moonesamy",
      "ja": "* スブラマニアンムーネミー"
    },
    {
      "indent": 3,
      "text": "* Stephen Farrell",
      "ja": "* スティーブン・ファレル"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Lars Eggert NetApp Stenbergintie 12 B FI-02700 Kauniainen Finland Email: lars@eggert.org URI: https://eggert.org/",
      "ja": "Lars EggertApp Stenbergintie 12 B FI-02700 Kauniainen Finland Email：lars@eggert.org Uri：https：//eggert.org/"
    },
    {
      "indent": 3,
      "text": "Susan Harris",
      "ja": "スーザン・ハリス"
    }
  ]
}