{
  "title": {
    "text": "RFC 9239 - Updates to ECMAScript Media Types (RFC 9239)",
    "ja": "RFC 9239 - ECMAScriptメディアタイプの更新（RFC 9239）"
  },
  "number": 9239,
  "created_at": "2022-05-10 03:00:02.580347+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         M. Miller\nRequest for Comments: 9239\nObsoletes: 4329                                                M. Borins\nCategory: Informational                                           GitHub\nISSN: 2070-1721                                                M. Bynens\n                                                                  Google\n                                                               B. Farias\n                                                                May 2022",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 19,
      "text": "Updates to ECMAScript Media Types",
      "ja": "ECMAScriptメディアタイプの更新"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document describes the registration of media types for the ECMAScript and JavaScript programming languages and conformance requirements for implementations of these types. This document obsoletes RFC 4329 (\"Scripting Media Types)\", replacing the previous registrations with information and requirements aligned with common usage and implementation experiences.",
      "ja": "このドキュメントでは、ECMAScriptおよびJavaScriptプログラミング言語のメディアタイプの登録と、これらのタイプの実装に関する適合要件について説明します。このドキュメントは、RFC 4329（「スクリプトメディアタイプ）」を廃止し、以前の登録を一般的な使用と実装の経験に沿った情報と要件に置き換えます。"
    },
    {
      "indent": 0,
      "text": "IESG Note",
      "ja": "IESGノート"
    },
    {
      "indent": 3,
      "text": "This document records the relationship between the work of Ecma International's Technical Committee 39 and the media types used to identify relevant payloads.",
      "ja": "このドキュメントは、ECMA Internationalの技術委員会39の作業と、関連するペイロードを特定するために使用されるメディアタイプとの関係を記録します。"
    },
    {
      "indent": 3,
      "text": "That relationship was developed outside of the IETF and as a result is unfortunately not aligned with the best practices of BCP 13. Consequently, consensus exists in the IETF to document the relationship and update the relevant IANA registrations for those media types, but this is not an IETF endorsement of the media types chosen for this work.",
      "ja": "その関係はIETF以外で開発され、その結果、残念ながらBCP 13のベストプラクティスとは一致していません。その結果、IETFにはコンセンサスが存在し、関係を文書化し、それらのメディアタイプの関連するIANA登録を更新しますが、これはそうではありません。この作業に選択されたメディアタイプのIETFの承認。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントは、インターネット標準の追跡仕様ではありません。情報目的で公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are candidates for any level of Internet Standard; see Section 2 of RFC 7841.",
      "ja": "このドキュメントは、インターネットエンジニアリングタスクフォース（IETF）の製品です。IETFコミュニティのコンセンサスを表しています。公開レビューを受けており、インターネットエンジニアリングステアリンググループ（IESG）からの出版が承認されています。IESGによって承認されたすべてのドキュメントが、インターネット標準のあらゆるレベルの候補者であるわけではありません。RFC 7841のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at https://www.rfc-editor.org/info/rfc9239.",
      "ja": "このドキュメントの現在のステータス、任意のERRATA、およびそのフィードバックを提供する方法に関する情報は、https：//www.rfc-editor.org/info/rfc9239で取得できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2022 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（c）2022 IETF Trustおよび文書著者として特定された人。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (https://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Revised BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Revised BSD License.",
      "ja": "このドキュメントは、BCP 78およびIETFドキュメント（https://trustee.ietf.org/license-info）に関連するIETF Trustの法的規定の対象となります。この文書に関するあなたの権利と制限を説明するので、これらの文書を注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、セクション4.Eで説明されている法的規定のセクション4.Eで説明されており、修正されたBSDライセンスで説明されているように保証なしで提供される修正されたBSDライセンステキストを含める必要があります。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction\n  1.1.  Terminology\n2.  Compatibility\n3.  Modules\n4.  Encoding\n  4.1.  Charset Parameter\n  4.2.  Character Encoding Scheme Detection\n  4.3.  Character Encoding Scheme Error Handling\n5.  Security Considerations\n6.  IANA Considerations\n  6.1.  Common JavaScript Media Types\n    6.1.1.  text/javascript\n  6.2.  Historic JavaScript Media Types\n    6.2.1.  text/ecmascript\n7.  References\n  7.1.  Normative References\n  7.2.  Informative References\nAppendix A.  Changes from RFC 4329\nAcknowledgements\nAuthors' Addresses",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "This memo describes media types for the JavaScript and ECMAScript programming languages. Refer to the sections \"Introduction\" and \"Overview\" in [ECMA-262] for background information on these languages. This document updates the descriptions and registrations for these media types to reflect existing usage on the Internet, and it provides up-to-date security considerations.",
      "ja": "このメモは、JavaScriptおよびECMAScriptプログラミング言語のメディアタイプについて説明しています。これらの言語の背景情報については、[ECMA-262]のセクション「紹介」と「概要」を参照してください。このドキュメントは、これらのメディアタイプの説明と登録を更新して、インターネット上の既存の使用を反映しており、最新のセキュリティに関する考慮事項を提供します。"
    },
    {
      "indent": 3,
      "text": "This document replaces the media type registrations in [RFC4329] and updates the requirements for implementations using those media types defined in [RFC4329] based on current existing practices. As a consequence, this document obsoletes [RFC4329].",
      "ja": "このドキュメントは、[RFC4329]のメディアタイプの登録を置き換え、現在の既存のプラクティスに基づいて[RFC4329]で定義されているメディアタイプを使用して実装の要件を更新します。結果として、この文書は廃止されます[RFC4329]。"
    },
    {
      "indent": 0,
      "text": "1.1. Terminology",
      "section_title": true,
      "ja": "1.1. 用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14 [RFC2119] [RFC8174] when, and only when, they appear in all capitals, as shown here.",
      "ja": "この文書のキーワード \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", および \"OPTIONAL\" はBCP 14 [RFC2119] [RFC8174]で説明されているように、すべて大文字の場合にのみ解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. Compatibility",
      "section_title": true,
      "ja": "2. 互換性"
    },
    {
      "indent": 3,
      "text": "This document defines equivalent processing requirements for the various script media types. The most widely supported media type in use is text/javascript; all others are considered historical and obsolete aliases of text/javascript.",
      "ja": "このドキュメントでは、さまざまなスクリプトメディアタイプの同等の処理要件を定義します。使用されている最も広くサポートされているメディアタイプは、Text/JavaScriptです。他のすべては、テキスト/javascriptの歴史的および時代遅れのエイリアスと見なされます。"
    },
    {
      "indent": 3,
      "text": "The types defined in this document are applicable to scripts written in [ECMA-262]. New editions of [ECMA-262] are subjected to strong obligations of backward compatibility, imposed by the standardization process of Ecma International's Technical Committee 39 (TC39). As a result, JavaScript code based on an earlier edition is generally compatible with a JavaScript engine adhering to a later edition. The few exceptions to this are documented in [ECMA-262] in the section \"Additions and Changes That Introduce Incompatibilities with Prior Editions\". JavaScript developers commonly use feature detection to ensure that modern JavaScript features are only used when available in the current environment. Later editions of [ECMA-262] are not directly addressed in this document, although it is expected that implementations will behave as if applicability were extended to them. This document does not address other extensions to [ECMA-262] or scripts written in other languages.",
      "ja": "このドキュメントで定義されているタイプは、[ECMA-262]で書かれたスクリプトに適用されます。[ECMA-262]の新しいエディションは、ECMA Internationalの技術委員会39（TC39）の標準化プロセスによって課される、後方互換性の強力な義務を科せられます。その結果、以前のエディションに基づいたJavaScriptコードは、一般に後のエディションを順守するJavaScriptエンジンと互換性があります。これに対するいくつかの例外は、[ECMA-262]に「以前のエディションとの非互換性を導入する追加と変更」セクションに文書化されています。JavaScript開発者は一般に、機能検出を使用して、現在の環境で利用可能な場合にのみ最新のJavaScript機能が使用されるようにします。[ECMA-262]の後のエディションは、このドキュメントでは直接対処されていませんが、実装が適用可能性が拡張されたかのように動作することが予想されます。このドキュメントは、[ECMA-262]または他の言語で記述されたスクリプトの他の拡張機能には対応していません。"
    },
    {
      "indent": 3,
      "text": "This document may be updated to take other content into account. Updates of this document may introduce new optional parameters; implementations must consider the impact of such an update.",
      "ja": "このドキュメントは、他のコンテンツを考慮に入れるために更新される場合があります。このドキュメントの更新により、新しいオプションのパラメーターが導入される場合があります。実装は、このような更新の影響を考慮する必要があります。"
    },
    {
      "indent": 3,
      "text": "This document does not define how fragment identifiers in resource identifiers [RFC3986] [RFC3987] for documents labeled with one of the media types defined in this document are resolved. An update of this document may define processing of fragment identifiers.",
      "ja": "このドキュメントでは、このドキュメントで定義されたメディアタイプの1つにラベル付けされたドキュメントについて、リソース識別子[RFC3986] [RFC3987]のフラグメント識別子が解決される方法を定義しません。このドキュメントの更新では、フラグメント識別子の処理を定義する場合があります。"
    },
    {
      "indent": 3,
      "text": "Note that this use of the \"text\" media type tree willfully does not\nalign with its original intent per [RFC2045].  The reason for this is\nhistorical.  [RFC4329] registered both the text/* and application/*\ntypes, marking the text/* types obsolete.  This was done to encourage\npeople toward application/*, matching the guidance in [RFC4288], the\npredecessor to [RFC6838].  Since then, however, the industry widely\nadopted text/* anyway.  The definitions in this document reflect the\ncurrent state of implementation across the JavaScript ecosystem, in\nweb browsers and other environments such as Node.js alike, in order\nto guarantee backward compatibility with existing applications as\nmuch as possible.  Future registrations should not view this as a\nrepeatable precedent.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "3. Modules",
      "section_title": true,
      "ja": "3. モジュール"
    },
    {
      "indent": 3,
      "text": "In order to formalize support for modular programs, [ECMA-262] (starting with the 6th Edition) defines two top-level goal symbols (or roots to the abstract syntax tree) for the ECMAScript grammar: Module and Script. The Script goal represents the original structure where the code executes in the global scope, while the Module goal represents the module system built into ECMAScript starting with the 6th Edition. See the section \"ECMAScript Language: Scripts and Modules\" in [ECMA-262] for details.",
      "ja": "モジュラープログラムのサポートを正式にするために、[ECMA-262]（第6版から始まる）は、ECMAScript文法の2つのトップレベルのゴールシンボル（または抽象的構文ツリーへのルーツ）を定義します：モジュールとスクリプト。スクリプトの目標は、コードがグローバルスコープで実行される元の構造を表し、モジュール目標は第6版から始まるECMAScriptに組み込まれたモジュールシステムを表します。詳細については、[ECMA-262]の[ECMAScript言語：スクリプトとモジュール]セクションを参照してください。"
    },
    {
      "indent": 3,
      "text": "This separation means that (in the absence of additional information) there are two possible interpretations for any given ECMAScript source text.",
      "ja": "この分離は、（追加情報がない場合）、特定のECMAScriptソーステキストに対して2つの可能な解釈があることを意味します。"
    },
    {
      "indent": 3,
      "text": "Ecma International's Technical Committee 39 (TC39), the standards body in charge of ECMAScript, has determined that media types are outside of their scope of work [TC39-MIME-ISSUE].",
      "ja": "ECMAScriptを担当する基準機関であるECMA Internationalの技術委員会39（TC39）は、メディアタイプが作業の範囲外であると判断しました[TC39-Mime-Issue]。"
    },
    {
      "indent": 3,
      "text": "It is not possible to fully determine if a source text of ECMAScript is meant to be parsed using the Module or Script grammar goals based upon content or media type alone. Therefore, as permitted by the media types in this document, scripting environments use out-of-band information in order to determine what goal should be used. Some scripting environments have chosen to adopt the file extension of .mjs for this purpose.",
      "ja": "ECMAScriptのソーステキストが、コンテンツまたはメディアタイプのみに基づいてモジュールまたはスクリプトの文法目標を使用して解析されることを意図しているかどうかを完全に判断することはできません。したがって、このドキュメントのメディアタイプで許可されているように、スクリプト環境は、どの目標を使用すべきかを決定するために、バンド外情報を使用します。一部のスクリプト環境は、この目的のために.mjsのファイル拡張機能を採用することを選択しています。"
    },
    {
      "indent": 0,
      "text": "4. Encoding",
      "section_title": true,
      "ja": "4. エンコーディング"
    },
    {
      "indent": 3,
      "text": "Refer to [RFC6365] for a discussion of terminology used in this section. Source text (as defined in the section \"Source Text\" in [ECMA-262]) can be binary source text. Binary source text is a textual data object that represents source text encoded using a character encoding scheme. A textual data object is a whole text protocol message or a whole text document, or a part of it, that is treated separately for purposes of external storage and retrieval. An implementation's internal representation of source text is not considered binary source text.",
      "ja": "このセクションで使用されている用語の議論については、[RFC6365]を参照してください。ソーステキスト（[ECMA-262]のセクション「ソーステキスト」で定義されているように）は、バイナリソーステキストです。バイナリソーステキストは、文字エンコードスキームを使用してエンコードされたソーステキストを表すテキストデータオブジェクトです。テキストデータオブジェクトは、テキストプロトコルメッセージまたはテキストドキュメント全体、または外部ストレージと取得の目的で個別に扱われるものです。ソーステキストの実装の内部表現は、バイナリソーステキストとは見なされません。"
    },
    {
      "indent": 3,
      "text": "Implementations need to determine a character encoding scheme in order to decode binary source text to source text. The media types defined in this document allow an optional charset parameter to explicitly specify the character encoding scheme used to encode the source text.",
      "ja": "実装は、バイナリソーステキストをソーステキストにデコードするために、文字エンコードスキームを決定する必要があります。このドキュメントで定義されているメディアタイプにより、オプションのcharsetパラメーターは、ソーステキストをエンコードするために使用される文字エンコードスキームを明示的に指定できます。"
    },
    {
      "indent": 3,
      "text": "In order to ensure interoperability and align with widespread\nimplementation practices, the charset parameter is optional rather\nthan required, despite the recommendation in BCP 13 [RFC6838] for\ntext/* types.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "How implementations determine the character encoding scheme can be subject to processing rules that are out of the scope of this document. For example, transport protocols can require that a specific character encoding scheme is to be assumed if the optional charset parameter is not specified, or they can require that the charset parameter is used in certain cases. Such requirements are not defined by this document.",
      "ja": "実装が文字エンコードスキームを決定する方法は、このドキュメントの範囲外の処理ルールの対象となります。たとえば、輸送プロトコルでは、オプションのcharsetパラメーターが指定されていない場合、特定の文字エンコードスキームを想定する必要があります。または、特定の場合にcharsetパラメーターを使用することを要求できます。このような要件は、このドキュメントで定義されていません。"
    },
    {
      "indent": 3,
      "text": "Implementations that support binary source text MUST support binary source text encoded using the UTF-8 [RFC3629] character encoding scheme. Module goal sources MUST be encoded as UTF-8; all other encodings will fail. Source goal sources SHOULD be encoded as UTF-8; other character encoding schemes MAY be supported but are discouraged. Whether U+FEFF is processed as a Byte Order Mark (BOM) signature or not depends on the host environment and is not defined by this document.",
      "ja": "バイナリソーステキストをサポートする実装は、UTF-8 [RFC3629]文字エンコードスキームを使用してエンコードされたバイナリソーステキストをサポートする必要があります。モジュールの目標ソースは、UTF-8としてエンコードする必要があります。他のすべてのエンコーディングは失敗します。ソースの目標ソースは、UTF-8としてエンコードする必要があります。他のキャラクターエンコーディングスキームはサポートされる場合がありますが、落胆しています。u feffがバイトオーダーマーク（BOM）の署名として処理されているかどうかは、ホスト環境に依存し、このドキュメントで定義されていません。"
    },
    {
      "indent": 0,
      "text": "4.1. Charset Parameter",
      "section_title": true,
      "ja": "4.1. チャーセットパラメーター"
    },
    {
      "indent": 3,
      "text": "The charset parameter provides a means to specify the character encoding scheme of binary source text. If present, the value of the charset parameter MUST be a registered charset [CHARSETS] and is considered valid if it matches the mime-charset production defined in Section 2.3 of [RFC2978].",
      "ja": "Charsetパラメーターは、バイナリソーステキストの文字エンコードスキームを指定する手段を提供します。存在する場合、charsetパラメーターの値は登録されたcharset [charsets]でなければならず、[RFC2978]のセクション2.3で定義されているMime-Charsetの生成と一致する場合、有効と見なされます。"
    },
    {
      "indent": 3,
      "text": "The charset parameter is only used when processing a Script goal source; Module goal sources MUST always be processed as UTF-8.",
      "ja": "Charsetパラメーターは、スクリプトの目標ソースを処理するときにのみ使用されます。モジュールの目標ソースは、常にUTF-8として処理する必要があります。"
    },
    {
      "indent": 0,
      "text": "4.2. Character Encoding Scheme Detection",
      "section_title": true,
      "ja": "4.2. 文字エンコードスキーム検出"
    },
    {
      "indent": 3,
      "text": "It is possible that implementations cannot interoperably determine a single character encoding scheme simply by complying with all requirements of the applicable specifications. To foster interoperability in such cases, the following algorithm is defined. Implementations apply this algorithm until a single character encoding scheme is determined.",
      "ja": "実装は、該当する仕様のすべての要件を順守するだけで、単一の文字エンコードスキームを相互に繰り返すことができない可能性があります。そのような場合に相互運用性を促進するために、次のアルゴリズムが定義されています。実装は、単一の文字エンコードスキームが決定されるまで、このアルゴリズムを適用します。"
    },
    {
      "indent": 3,
      "text": "1. If the binary source text is not already determined to be using a Module goal and starts with a Unicode encoding form signature, the signature determines the encoding. The following octet sequences, at the very beginning of the binary source text, are considered with their corresponding character encoding schemes:",
      "ja": "1. バイナリソーステキストがモジュールの目標を使用しているとまだ決定されておらず、ユニコードエンコードフォームの署名から始まる場合、署名はエンコードを決定します。次のオクテットシーケンスは、バイナリソーステキストのまさに始まりに、対応する文字エンコードスキームで考慮されます。"
    },
    {
      "indent": 7,
      "text": "+==================+==========+\n| Leading sequence | Encoding |\n+==================+==========+\n| EF BB BF         | UTF-8    |\n+------------------+----------+\n| FF FE            | UTF-16LE |\n+------------------+----------+\n| FE FF            | UTF-16BE |\n+------------------+----------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 19,
      "text": "Table 1",
      "ja": "表1"
    },
    {
      "indent": 7,
      "text": "Implementations of this step MUST use these octet sequences to determine the character encoding scheme, even if the determined scheme is not supported. If this step determines the character encoding scheme, the octet sequence representing the Unicode encoding form signature MUST be ignored when decoding the binary source text.",
      "ja": "このステップの実装は、これらのOctetシーケンスを使用して、決定されたスキームがサポートされていなくても、文字エンコードスキームを決定する必要があります。このステップが文字エンコードスキームを決定する場合、バイナリソーステキストをデコードするときに、ユニコードエンコードフォームの署名を表すオクテットシーケンスを無視する必要があります。"
    },
    {
      "indent": 3,
      "text": "2. Else, if a charset parameter is specified and its value is valid and supported by the implementation, the value determines the character encoding scheme.",
      "ja": "2. それ以外の場合、charsetパラメーターが指定され、その値が実装によって有効でサポートされている場合、値は文字エンコードスキームを決定します。"
    },
    {
      "indent": 3,
      "text": "3. Else, the character encoding scheme is assumed to be UTF-8.",
      "ja": "3. それ以外の場合、文字エンコードスキームはUTF-8であると想定されています。"
    },
    {
      "indent": 3,
      "text": "If the character encoding scheme is determined to be UTF-8 through any means other than step 1 as defined above and the binary source text starts with the octet sequence EF BB BF, the octet sequence is ignored when decoding the binary source text.",
      "ja": "上記のようにステップ1以外の任意の手段を使用して文字エンコードスキームがUTF-8であると判断され、バイナリソーステキストがOctetシーケンスEF BB BFで始まる場合、バイナリソーステキストをデコードするときにOctetシーケンスは無視されます。"
    },
    {
      "indent": 0,
      "text": "4.3. Character Encoding Scheme Error Handling",
      "section_title": true,
      "ja": "4.3. 文字エンコードスキームエラー処理"
    },
    {
      "indent": 3,
      "text": "Binary source text that is not properly encoded for the determined character encoding can pose a security risk, as discussed in Section 5. That said, because of the varied and complex environments scripts are executed in, most of the error handling specifics are left to the processors. The following are broad guidelines that processors follow.",
      "ja": "セクション5で説明したように、決定された文字エンコードに対して適切にエンコードされていないバイナリソーステキストは、セキュリティリスクを引き起こす可能性があります。プロセッサ。以下は、プロセッサが従う幅広いガイドラインです。"
    },
    {
      "indent": 3,
      "text": "If binary source text is determined to have been encoded using a certain character encoding scheme that the implementation is unable to process, implementations can consider the resource unsupported (i.e., do not decode the binary source text using a different character encoding scheme).",
      "ja": "バイナリソーステキストが、実装が処理できない特定の文字エンコードスキームを使用してエンコードされたと判断された場合、実装はサポートされていないリソースを検討できます（つまり、異なる文字エンコードスキームを使用してバイナリソーステキストをデコードしないでください）。"
    },
    {
      "indent": 3,
      "text": "Binary source text can be determined to have been encoded using a certain character encoding scheme but contain octet sequences that are not valid according to that scheme. Implementations can substitute those invalid sequences with the replacement character U+FFFD (properly encoded for the scheme) or stop processing altogether.",
      "ja": "バイナリソーステキストは、特定の文字エンコードスキームを使用してエンコードされたが、そのスキームに従って有効ではないオクテットシーケンスが含まれていると判断できます。実装は、これらの無効なシーケンスを置換文字u fffd（スキームに適切にエンコード）に置き換えるか、完全に処理を停止することができます。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5. セキュリティ上の考慮事項"
    },
    {
      "indent": 3,
      "text": "Refer to [RFC3552] for a discussion of terminology used in this section. Examples in this section and discussions of interactions of host environments with scripts, modules, and extensions to [ECMA-262] are to be understood as non-exhaustive and of a purely illustrative nature.",
      "ja": "このセクションで使用されている用語の議論については、[RFC3552]を参照してください。このセクションの例と、ホスト環境と[ECMA-262]への拡張とのホスト環境との相互作用の議論は、網羅的ではなく純粋に説明的な性質として理解されるべきです。"
    },
    {
      "indent": 3,
      "text": "The programming language defined in [ECMA-262] is not intended to be computationally self-sufficient; rather, it is expected that the computational environment provides facilities to programs to enable specific functionality. Such facilities constitute unknown factors and are thus not defined by this document.",
      "ja": "[ECMA-262]で定義されているプログラミング言語は、計算的に自給自足することを意図していません。むしろ、計算環境が特定の機能を有効にするためのプログラムに設備を提供することが期待されています。このような施設は未知の要因を構成するため、このドキュメントでは定義されていません。"
    },
    {
      "indent": 3,
      "text": "Derived programming languages are permitted to include additional functionality that is not described in [ECMA-262]; such functionality constitutes an unknown factor and is thus not defined by this document. In particular, extensions to [ECMA-262] defined for the JavaScript programming language are not discussed in this document.",
      "ja": "派生したプログラミング言語は、[ECMA-262]で説明されていない追加の機能を含めることができます。このような機能は未知の要因を構成するため、このドキュメントで定義されていません。特に、JavaScriptプログラミング言語で定義された[ECMA-262]の拡張は、このドキュメントでは説明されていません。"
    },
    {
      "indent": 3,
      "text": "Uncontrolled execution of scripts can be exceedingly dangerous. Implementations that execute scripts MUST give consideration to their application's threat models and those of the individual features they implement; in particular, they MUST ensure that untrusted content is not executed in an unprotected environment.",
      "ja": "スクリプトの制御されていない実行は非常に危険です。スクリプトを実行する実装は、アプリケーションの脅威モデルと実装する個々の機能の実装を考慮する必要があります。特に、信頼されていないコンテンツが保護されていない環境で実行されないことを確認する必要があります。"
    },
    {
      "indent": 3,
      "text": "Module scripts in ECMAScript can request the fetching and processing of additional scripts; this is called \"importing\". Implementations that support modules need to process imported sources in the same way as scripts. See the section \"ECMAScript Language: Scripts and Modules\" in [ECMA-262] for details. Further, there may be additional privacy and security concerns, depending on the location(s) the original script and its imported modules are obtained from. For instance, a script obtained from \"host-a.example\" could request to import a script from \"host-b.example\", which could expose information about the executing environment (e.g., IP address) to \"host-b.example\".",
      "ja": "ECMAScriptのモジュールスクリプトは、追加のスクリプトの取得と処理を要求できます。これは「インポート」と呼ばれます。モジュールをサポートする実装は、スクリプトと同じ方法でインポートされたソースを処理する必要があります。詳細については、[ECMA-262]の[ECMAScript言語：スクリプトとモジュール]セクションを参照してください。さらに、元のスクリプトとそのインポートされたモジュールが取得される場所に応じて、追加のプライバシーとセキュリティの懸念がある場合があります。たとえば、「host-a.example」から取得したスクリプトは、「Host-b.example」からスクリプトをインポートすることを要求できます。\"。"
    },
    {
      "indent": 3,
      "text": "Specifications for host environment facilities and for derived programming languages should include security considerations. If an implementation supports such facilities, the respective security considerations apply. In particular, if scripts can be referenced from or included in specific document formats, the considerations for the embedding or referencing document format apply.",
      "ja": "ホスト環境施設および派生プログラミング言語の仕様には、セキュリティに関する考慮事項が含まれている必要があります。実装がそのような施設をサポートする場合、それぞれのセキュリティ上の考慮事項が適用されます。特に、スクリプトを特定のドキュメント形式から参照または含めることができる場合、ドキュメント形式の埋め込みまたは参照の考慮事項が適用されます。"
    },
    {
      "indent": 3,
      "text": "For example, scripts embedded in application/xhtml+xml [RFC3236] documents could be enabled through the host environment to manipulate the document instance, which could cause the retrieval of remote resources; security considerations regarding retrieval of remote resources of the embedding document would apply in this case.",
      "ja": "たとえば、アプリケーション/XHTML XML [RFC3236]に埋め込まれたスクリプトは、ホスト環境を通じてドキュメントインスタンスを操作することができ、リモートリソースの検索を引き起こす可能性があります。この場合、埋め込み文書のリモートリソースの検索に関するセキュリティ上の考慮事項が適用されます。"
    },
    {
      "indent": 3,
      "text": "This circumstance can further be used to make information that is normally only available to the script also available to a web server by encoding the information in the resource identifier of the resource, which can further enable eavesdropping attacks. Implementation of such facilities is subject to the security considerations of the host environment, as discussed above.",
      "ja": "この状況はさらに、リソースのリソース識別子の情報をエンコードすることにより、通常、スクリプトでのみ利用可能な情報をWebサーバーでのみ利用できる情報を作成するために使用できます。このような施設の実装は、上記で説明したように、ホスト環境のセキュリティ上の考慮事項の対象となります。"
    },
    {
      "indent": 3,
      "text": "The programming language defined in [ECMA-262] does include facilities to loop, cause computationally complex operations, or consume large amounts of memory; this includes, but is not limited to, facilities that allow dynamically generated source text to be executed (e.g., the eval() function); uncontrolled execution of such features can cause denial of service, which implementations MUST protect against.",
      "ja": "[ECMA-262]で定義されているプログラミング言語には、ループする施設、計算的に複雑な操作を引き起こす、または大量のメモリを消費する施設が含まれます。これには、動的に生成されたソーステキストを実行できる施設（例：eval（）関数）が含まれますが、これに限定されません。このような機能の制御されていない実行は、サービスの拒否を引き起こす可能性があり、その実装は保護する必要があります。"
    },
    {
      "indent": 3,
      "text": "With the addition of SharedArrayBuffer objects in ECMAScript version 8, it could be possible to implement a high-resolution timer, which could lead to certain types of timing and side-channel attacks (e.g., [SPECTRE]). Implementations can take steps to mitigate this concern, such as disabling or removing support for SharedArrayBuffer objects, or can take additional steps to ensure that this shared memory is only accessible between execution contexts that have some form of mutual trust.",
      "ja": "ECMAScriptバージョン8にSharedArrayBufferオブジェクトを追加すると、高解像度タイマーを実装することができ、特定のタイプのタイミングやサイドチャネル攻撃（[Specter]など）につながる可能性があります。実装は、SharedArrayBufferオブジェクトのサポートを無効にしたり削除したりするなど、この懸念を軽減するための措置を講じることができます。また、この共有メモリが相互信頼のある形の実行コンテキスト間でのみアクセスできるように追加の措置を講じることができます。"
    },
    {
      "indent": 3,
      "text": "A host environment can provide facilities to access external input. Scripts that pass such input to the eval() function or similar language features can be vulnerable to code injection attacks. Scripts are expected to protect against such attacks.",
      "ja": "ホスト環境は、外部入力にアクセスするための施設を提供できます。そのような入力をeval（）関数または同様の言語機能に渡すスクリプトは、コードインジェクション攻撃に対して脆弱です。スクリプトは、そのような攻撃から保護することが期待されています。"
    },
    {
      "indent": 3,
      "text": "A host environment can provide facilities to output computed results in a user-visible manner. For example, host environments supporting a graphical user interface can provide facilities that enable scripts to present certain messages to the user. Implementations MUST take steps to avoid confusion of the origin of such messages. In general, the security considerations for the host environment apply in such a case as discussed above.",
      "ja": "ホスト環境は、ユーザー可視的な方法で計算された結果を出力するための施設を提供できます。たとえば、グラフィカルユーザーインターフェイスをサポートするホスト環境は、スクリプトが特定のメッセージをユーザーに提示できるようにする機能を提供できます。実装は、そのようなメッセージの起源の混乱を避けるための措置を講じる必要があります。一般に、ホスト環境のセキュリティ上の考慮事項は、上記のような場合に適用されます。"
    },
    {
      "indent": 3,
      "text": "Implementations are required to support the UTF-8 character encoding scheme; the security considerations of [RFC3629] apply. Additional character encoding schemes may be supported; support for such schemes is subject to the security considerations of those schemes.",
      "ja": "UTF-8文字エンコードスキームをサポートするには、実装が必要です。[RFC3629]のセキュリティ上の考慮事項が適用されます。追加の文字エンコードスキームがサポートされる場合があります。このようなスキームのサポートは、これらのスキームのセキュリティ上の考慮事項の対象となります。"
    },
    {
      "indent": 3,
      "text": "Source text is expected to be in Unicode Normalization Form C. Scripts and implementations MUST consider security implications of unnormalized source text and data. For a detailed discussion of such implications, refer to the security considerations in [RFC3629].",
      "ja": "ソーステキストは、Unicode Normalization Form Cを使用することが期待されています。スクリプトと実装は、非正規化されたソーステキストとデータのセキュリティへの影響を考慮する必要があります。このような意味の詳細な議論については、[RFC3629]のセキュリティ上の考慮事項を参照してください。"
    },
    {
      "indent": 3,
      "text": "Scripts can be executed in an environment that is vulnerable to code injection attacks. For example, a Common Gateway Interface (CGI) script [RFC3875] echoing user input could allow the inclusion of untrusted scripts that could be executed in an otherwise trusted environment. This threat scenario is subject to security considerations that are out of the scope of this document.",
      "ja": "スクリプトは、コードインジェクション攻撃に対して脆弱な環境で実行できます。たとえば、一般的なゲートウェイインターフェイス（CGI）スクリプト[RFC3875]をエコーユーザー入力により、信頼できる環境で実行できる信頼できないスクリプトを含めることができます。この脅威シナリオは、このドキュメントの範囲外であるセキュリティ上の考慮事項の対象となります。"
    },
    {
      "indent": 3,
      "text": "The \"data\" resource identifier scheme [RFC2397], in combination with the types defined in this document, could be used to cause execution of untrusted scripts through the inclusion of untrusted resource identifiers in otherwise trusted content. Security considerations of [RFC2397] apply.",
      "ja": "「データ」リソース識別子スキーム[RFC2397]は、このドキュメントで定義されているタイプと組み合わせて、信頼できるコンテンツに信頼できないリソース識別子を含めることにより、信頼されていないスクリプトの実行を引き起こすために使用できます。[RFC2397]のセキュリティ上の考慮事項が適用されます。"
    },
    {
      "indent": 3,
      "text": "Implementations can fail to implement a specific security model or other means to prevent possibly dangerous operations. Such failure could possibly be exploited to gain unauthorized access to a system or sensitive information; such failure constitutes an unknown factor and is thus not defined by this document.",
      "ja": "実装は、おそらく危険な操作を防ぐための特定のセキュリティモデルまたはその他の手段を実装できない場合があります。このような障害は、システムまたは機密情報への不正アクセスを得るために悪用される可能性があります。このような障害は未知の要因を構成するため、このドキュメントで定義されていません。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "The media type registrations herein are divided into two major categories: (1) the sole media type \"text/javascript\", which is now in common usage and (2) all of the media types that are obsolete (i.e., \"application/ecmascript\", \"application/javascript\", \"application/x-ecmascript\", \"application/x-javascript\", \"text/ ecmascript\", \"text/javascript1.0\", \"text/javascript1.1\", \"text/ javascript1.2\", \"text/javascript1.3\", \"text/javascript1.4\", \"text/ javascript1.5\", \"text/jscript\", \"text/livescript\", and \"text/ x-ecmascript\").",
      "ja": "本書のメディアタイプの登録は、2つの主要なカテゴリに分割されます。（1）唯一のメディアタイプ「テキスト/JavaScript」。現在、一般的な使用法と（2）廃止されたすべてのメディアタイプ（つまり、 \"Application/EcMascript\"、\" application/javascript \"、\" application/x-ecmascript \"、\" application/x-javascript \"、\" text/ecmascript \"、\" text/javascript1.0 \"、\" text/javascript1.1 \"、\" text/javascript1.2 \"、\" text/javascript1.3 \"、\" text/javascript1.4 \"、\" text/javascript1.5 \"、\" text/jscript \"、\" text/livescript \"、および\" text/x-ecmascript \"）。"
    },
    {
      "indent": 3,
      "text": "For both categories, the \"Published specification\" entry for the media types is updated to reference [ECMA-262]. In addition, a new file extension of .mjs has been added to the list of file extensions with the restriction that contents should be parsed using the Module goal. Finally, the [HTML] specification uses \"text/javascript\" as the default media type of ECMAScript when preparing script tags; therefore, \"text/javascript\" intended usage has been moved from OBSOLETE to COMMON.",
      "ja": "両方のカテゴリについて、メディアタイプの「公開された仕様」エントリが更新され、参照[ECMA-262]が更新されます。さらに、.MJSの新しいファイル拡張子がファイル拡張機能のリストに追加され、モジュールの目標を使用してコンテンツを解析することを制限しています。最後に、[HTML]仕様は、スクリプトタグを準備する際に、「テキスト/JavaScript」をデフォルトのメディアタイプのECMAScriptとして使用します。したがって、「Text/JavaScript」の意図的な使用法は、時代遅れから共通に移行されました。"
    },
    {
      "indent": 3,
      "text": "These changes have been reflected in the IANA \"Media Types\" registry in accordance with [RFC6838]. All registrations will point to this document as the reference. The outdated note stating that the \"text/ javascript\" media type has been \"OBSOLETED in favor of application/ javascript\" has been removed. The outdated note stating that the \"text/ecmascript\" media type has been \"OBSOLETED in favor of application/ecmascript\" has been removed. IANA has added the note \"OBSOLETED in favor of text/javascript\" to all registrations except \"text/javascript\"; that is, this note has been added to the \"text/ ecmascript\", \"application/javascript\", and \"application/ecmascript\" registrations.",
      "ja": "これらの変更は、[RFC6838]に従って、IANAの「メディアタイプ」レジストリに反映されています。すべての登録は、このドキュメントを参照として指します。「Text/ JavaScript」メディアタイプが「アプリケーション/ JavaScriptを支持して廃止された」と述べている時代遅れのメモが削除されました。「テキスト/ECMAScript」メディアタイプが「アプリケーション/ECMAScriptを支持して廃止された」と述べている時代遅れのメモが削除されました。IANAは、「テキスト/javascript」を除くすべての登録に「テキスト/javascriptを有利に廃止した」メモを追加しました。つまり、このメモは「Text/EcMascript」、「Application/JavaScript」、および「Application/ECMAScript」登録に追加されました。"
    },
    {
      "indent": 3,
      "text": "Four of the legacy media types in this document have a subtype starting with the \"x-\" prefix:",
      "ja": "このドキュメントの4つのレガシーメディアタイプには、「X-」プレフィックスから始まるサブタイプがあります。"
    },
    {
      "indent": 3,
      "text": "* application/x-ecmascript",
      "ja": "* Application/X-ecmascript"
    },
    {
      "indent": 3,
      "text": "* application/x-javascript",
      "ja": "* アプリケーション/x-javascript"
    },
    {
      "indent": 3,
      "text": "* text/x-ecmascript",
      "ja": "* テキスト/x-mascript"
    },
    {
      "indent": 3,
      "text": "* text/x-javascript",
      "ja": "* テキスト/x-javascript"
    },
    {
      "indent": 3,
      "text": "Note that these are grandfathered media types registered as per Appendix A of [RFC6838]. These registrations predate BCP 178 [RFC6648], which they violate, and are only included in this document for backward compatibility.",
      "ja": "これらは、[RFC6838]の付録Aに従って登録されている祖父メディアタイプであることに注意してください。これらの登録は、BCP 178 [RFC6648]より前の登録であり、違反しており、このドキュメントには後方互換性のためにのみ含まれています。"
    },
    {
      "indent": 0,
      "text": "6.1. Common JavaScript Media Types",
      "section_title": true,
      "ja": "6.1. 一般的なJavaScriptメディアタイプ"
    },
    {
      "indent": 0,
      "text": "6.1.1. text/javascript",
      "section_title": true,
      "ja": "6.1.1. テキスト/javascript"
    },
    {
      "indent": 3,
      "text": "Type name: text",
      "ja": "タイプ名：テキスト"
    },
    {
      "indent": 3,
      "text": "Subtype name: javascript",
      "ja": "サブタイプ名：JavaScript"
    },
    {
      "indent": 3,
      "text": "Required parameters: N/A",
      "ja": "必要なパラメーター：n/a"
    },
    {
      "indent": 3,
      "text": "Optional parameters: charset. See Section 4.1 of RFC 9239.",
      "ja": "オプションのパラメーター：charset。RFC 9239のセクション4.1を参照してください。"
    },
    {
      "indent": 3,
      "text": "Encoding considerations: Binary",
      "ja": "考慮事項のエンコード：バイナリ"
    },
    {
      "indent": 3,
      "text": "Security considerations: See Section 5 of RFC 9239.",
      "ja": "セキュリティ上の考慮事項：RFC 9239のセクション5を参照してください。"
    },
    {
      "indent": 3,
      "text": "Interoperability considerations: It is expected that implementations will behave as if this registration applies to later editions of [ECMA-262], and its published specification references may be updated accordingly from time to time. Although this expectation is unusual among media type registrations, it matches widespread industry conventions. See Section 2 of RFC 9239.",
      "ja": "相互運用性の考慮事項：この登録が[ECMA-262]の後期版に適用されるかのように実装が動作することが期待され、その公開された仕様参照は、それに応じて時々更新される場合があります。この期待はメディアタイプの登録では珍しいことですが、広範な業界の慣習と一致しています。RFC 9239のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Published specification: [ECMA-262]",
      "ja": "公開された仕様：[ECMA-262]"
    },
    {
      "indent": 3,
      "text": "Applications that use this media type: Script interpreters as discussed in RFC 9239.",
      "ja": "このメディアタイプを使用するアプリケーション：RFC 9239で説明されているスクリプト通訳者。"
    },
    {
      "indent": 3,
      "text": "Additional information:\n   Deprecated alias names for this type:  application/javascript,\n      application/x-javascript, text/javascript1.0, text/\n      javascript1.1, text/javascript1.2, text/javascript1.3, text/\n      javascript1.4, text/javascript1.5, text/jscript, text/\n      livescript\n   Magic number(s):  N/A\n   File extension(s):  .js, .mjs\n   Macintosh File Type Code(s):  TEXT",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Person & email address to contact for further information: See the Authors' Addresses sections of RFC 9239 and [RFC4329].",
      "ja": "連絡先の個人およびメールアドレス詳細については、RFC 9239および[RFC4329]の著者のアドレスセクションを参照してください。"
    },
    {
      "indent": 3,
      "text": "Intended usage: COMMON",
      "ja": "意図された使用法：共通"
    },
    {
      "indent": 3,
      "text": "Restrictions on usage: The .mjs file extension signals that the file represents a JavaScript module. Execution environments that rely on file extensions to determine how to process inputs parse .mjs files using the Module grammar of [ECMA-262].",
      "ja": "使用法の制限：.mjsファイル拡張機能は、ファイルがJavaScriptモジュールを表すことを示しています。ファイル拡張機能に依存する実行環境[ECMA-262]のモジュール文法を使用して、入力を処理する方法を.mjsファイルを解析する方法を決定します。"
    },
    {
      "indent": 3,
      "text": "Author: See the Authors' Addresses sections of RFC 9239 and [RFC4329].",
      "ja": "著者：著者の住所を参照してください。RFC9239および[RFC4329]。"
    },
    {
      "indent": 3,
      "text": "Change controller:  IESG <iesg@ietf.org>",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "6.2. Historic JavaScript Media Types",
      "section_title": true,
      "ja": "6.2. 歴史的なJavaScriptメディアタイプ"
    },
    {
      "indent": 3,
      "text": "The following media types and legacy aliases are added or updated for historical purposes. All herein have an intended usage of OBSOLETE and are not expected to be in use with modern implementations.",
      "ja": "以下のメディアタイプとレガシーエイリアスは、歴史的な目的で追加または更新されます。ここではすべて、時代遅れの使用を意図しており、最新の実装で使用されることは期待されていません。"
    },
    {
      "indent": 0,
      "text": "6.2.1. text/ecmascript",
      "section_title": true,
      "ja": "6.2.1. テキスト/ecmascript"
    },
    {
      "indent": 3,
      "text": "Type name: text",
      "ja": "タイプ名：テキスト"
    },
    {
      "indent": 3,
      "text": "Subtype name: ecmascript",
      "ja": "サブタイプ名：ECMAScript"
    },
    {
      "indent": 3,
      "text": "Required parameters: N/A",
      "ja": "必要なパラメーター：n/a"
    },
    {
      "indent": 3,
      "text": "Optional parameters: charset. See Section 4.1 of RFC 9239.",
      "ja": "オプションのパラメーター：charset。RFC 9239のセクション4.1を参照してください。"
    },
    {
      "indent": 3,
      "text": "Encoding considerations: Binary",
      "ja": "考慮事項のエンコード：バイナリ"
    },
    {
      "indent": 3,
      "text": "Security considerations: See Section 5 of RFC 9239.",
      "ja": "セキュリティ上の考慮事項：RFC 9239のセクション5を参照してください。"
    },
    {
      "indent": 3,
      "text": "Interoperability considerations: It is expected that implementations will behave as if this registration applies to later editions of [ECMA-262], and its published specification references may be updated accordingly from time to time. Although this expectation is unusual among media type registrations, it matches widespread industry conventions. See Section 2 of RFC 9239.",
      "ja": "相互運用性の考慮事項：この登録が[ECMA-262]の後期版に適用されるかのように実装が動作することが期待され、その公開された仕様参照は、それに応じて時々更新される場合があります。この期待はメディアタイプの登録では珍しいことですが、広範な業界の慣習と一致しています。RFC 9239のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Published specification: [ECMA-262]",
      "ja": "公開された仕様：[ECMA-262]"
    },
    {
      "indent": 3,
      "text": "Applications that use this media type: Script interpreters as discussed in RFC 9239.",
      "ja": "このメディアタイプを使用するアプリケーション：RFC 9239で説明されているスクリプト通訳者。"
    },
    {
      "indent": 3,
      "text": "Additional information:\n   Deprecated alias names for this type:  application/ecmascript,\n      application/x-ecmascript, text/x-ecmascript\n   Magic number(s):  N/A\n   File extension(s):  .es, .mjs\n   Macintosh File Type Code(s):  TEXT",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Person & email address to contact for further information: See the Authors' Addresses sections of RFC 9239 and [RFC4329].",
      "ja": "連絡先の個人およびメールアドレス詳細については、RFC 9239および[RFC4329]の著者のアドレスセクションを参照してください。"
    },
    {
      "indent": 3,
      "text": "Intended usage: OBSOLETE",
      "ja": "意図された使用法：時代遅れ"
    },
    {
      "indent": 3,
      "text": "Restrictions on usage: This media type is obsolete; current implementations should use text/javascript as the only JavaScript/ ECMAScript media type. The .mjs file extension signals that the file represents a JavaScript module. Execution environments that rely on file extensions to determine how to process inputs parse .mjs files using the Module grammar of [ECMA-262].",
      "ja": "使用に関する制限：このメディアタイプは時代遅れです。現在の実装では、Text/ JavaScriptを唯一のJavaScript/ ECMAScriptメディアタイプとして使用する必要があります。.mjsファイル拡張機能は、ファイルがJavaScriptモジュールを表すことを示しています。ファイル拡張機能に依存する実行環境[ECMA-262]のモジュール文法を使用して、入力を処理する方法を.mjsファイルを解析する方法を決定します。"
    },
    {
      "indent": 3,
      "text": "Author: See the Authors' Addresses sections of RFC 9239 and [RFC4329].",
      "ja": "著者：著者の住所を参照してください。RFC9239および[RFC4329]。"
    },
    {
      "indent": 3,
      "text": "Change controller:  IESG <iesg@ietf.org>",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7. 参考文献"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "ja": "7.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[CHARSETS] IANA, \"Character Sets\", <https://www.iana.org/assignments/character-sets>.",
      "ja": "[charsets] iana、「キャラクターセット」、<https://www.iana.org/assignments/character-sets>。"
    },
    {
      "indent": 3,
      "text": "[ECMA-262] Ecma International, \"ECMA-262 12th Edition, June 2021. ECMAScript 2021 language specification\", June 2021, <https://262.ecma-international.org/12.0/>.",
      "ja": "[ECMA-262] ECMA International、「ECMA-262第12版、2021年6月。ECMAScript2021言語仕様」、2021年6月、<https://262.ecma-international.org/12.0/>。"
    },
    {
      "indent": 3,
      "text": "[RFC2045] Freed, N. and N. Borenstein, \"Multipurpose Internet Mail Extensions (MIME) Part One: Format of Internet Message Bodies\", RFC 2045, DOI 10.17487/RFC2045, November 1996, <https://www.rfc-editor.org/info/rfc2045>.",
      "ja": "[RFC2045] Freed、N。およびN. Borenstein、「多目的インターネットメール拡張機能（MIME）パート1：インターネットメッセージボディの形式」、RFC 2045、DOI 10.17487/RFC2045、1996年11月、<https：//www.rfc-editor.org/info/rfc2045>。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <https://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119] Bradner、S。、「要件レベルを示すためにRFCで使用するためのキーワード」、BCP 14、RFC 2119、DOI 10.17487/RFC2119、1997年3月、<https://www.rfc-editor.org/info/RFC2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC2397] Masinter, L., \"The \"data\" URL scheme\", RFC 2397, DOI 10.17487/RFC2397, August 1998, <https://www.rfc-editor.org/info/rfc2397>.",
      "ja": "[RFC2397] Masinter、L。、「データ」URLスキーム \"、RFC 2397、DOI 10.17487/RFC2397、1998年8月、<https://www.rfc-editor.org/info/rfc2397>。"
    },
    {
      "indent": 3,
      "text": "[RFC2978] Freed, N. and J. Postel, \"IANA Charset Registration Procedures\", BCP 19, RFC 2978, DOI 10.17487/RFC2978, October 2000, <https://www.rfc-editor.org/info/rfc2978>.",
      "ja": "[RFC2978] Freed、N。およびJ. Postel、「Iana Charset登録手順」、BCP 19、RFC 2978、DOI 10.17487/RFC2978、2000年10月、<https://www.rfc-editor.org/info/rfc2978>。"
    },
    {
      "indent": 3,
      "text": "[RFC3552] Rescorla, E. and B. Korver, \"Guidelines for Writing RFC Text on Security Considerations\", BCP 72, RFC 3552, DOI 10.17487/RFC3552, July 2003, <https://www.rfc-editor.org/info/rfc3552>.",
      "ja": "[RFC3552] Rescorla、E。and B. Korver、「セキュリティに関する考慮事項に関するRFCテキストを書くためのガイドライン」、BCP 72、RFC 3552、DOI 10.17487/RFC3552、2003年7月、<https：//www.rfc-editor.org/情報/RFC3552>。"
    },
    {
      "indent": 3,
      "text": "[RFC3629] Yergeau, F., \"UTF-8, a transformation format of ISO 10646\", STD 63, RFC 3629, DOI 10.17487/RFC3629, November 2003, <https://www.rfc-editor.org/info/rfc3629>.",
      "ja": "[RFC3629] Yergeau、F。、「UTF-8、ISO 10646の変換形式」、STD 63、RFC 3629、DOI 10.17487/RFC3629、2003年11月、<https://www.rfc-editor.org/info/RFC3629>。"
    },
    {
      "indent": 3,
      "text": "[RFC4288] Freed, N. and J. Klensin, \"Media Type Specifications and Registration Procedures\", RFC 4288, DOI 10.17487/RFC4288, December 2005, <https://www.rfc-editor.org/info/rfc4288>.",
      "ja": "[RFC4288] Freed、N。およびJ. Klensin、「メディアタイプの仕様と登録手順」、RFC 4288、DOI 10.17487/RFC4288、2005年12月、<https://www.rfc-editor.org/info/RFC4288>"
    },
    {
      "indent": 3,
      "text": "[RFC4329] Hoehrmann, B., \"Scripting Media Types\", RFC 4329, DOI 10.17487/RFC4329, April 2006, <https://www.rfc-editor.org/info/rfc4329>.",
      "ja": "[RFC4329] Hoehrmann、B。、「スクリプトメディアタイプ」、RFC 4329、DOI 10.17487/RFC4329、2006年4月、<https://www.rfc-editor.org/info/rfc4329>。"
    },
    {
      "indent": 3,
      "text": "[RFC6365] Hoffman, P. and J. Klensin, \"Terminology Used in Internationalization in the IETF\", BCP 166, RFC 6365, DOI 10.17487/RFC6365, September 2011, <https://www.rfc-editor.org/info/rfc6365>.",
      "ja": "[RFC6365]ホフマン、P。およびJ.クレンシン、「IETFの国際化で使用される用語」、BCP 166、RFC 6365、DOI 10.17487/RFC6365、2011年9月、<https://www.rfc-editor.org/info/RFC6365>。"
    },
    {
      "indent": 3,
      "text": "[RFC6648] Saint-Andre, P., Crocker, D., and M. Nottingham, \"Deprecating the \"X-\" Prefix and Similar Constructs in Application Protocols\", BCP 178, RFC 6648, DOI 10.17487/RFC6648, June 2012, <https://www.rfc-editor.org/info/rfc6648>.",
      "ja": "[RFC6648] Saint-Andre、P.、Crocker、D。、およびM. Nottingham、「アプリケーションプロトコルにおける「X」プレフィックスと同様のコンストラクトを非難する」、BCP 178、RFC 6648、DOI 10.17487/RFC6648、2012年6月、<https://www.rfc-editor.org/info/rfc6648>。"
    },
    {
      "indent": 3,
      "text": "[RFC6838] Freed, N., Klensin, J., and T. Hansen, \"Media Type Specifications and Registration Procedures\", BCP 13, RFC 6838, DOI 10.17487/RFC6838, January 2013, <https://www.rfc-editor.org/info/rfc6838>.",
      "ja": "[RFC6838] Freed、N.、Klensin、J。、およびT. Hansen、「メディアタイプの仕様と登録手順」、BCP 13、RFC 6838、DOI 10.17487/RFC6838、2013年1月、<https：//www.rfc-editor.org/info/rfc6838>。"
    },
    {
      "indent": 3,
      "text": "[RFC8174] Leiba, B., \"Ambiguity of Uppercase vs Lowercase in RFC 2119 Key Words\", BCP 14, RFC 8174, DOI 10.17487/RFC8174, May 2017, <https://www.rfc-editor.org/info/rfc8174>.",
      "ja": "[RFC8174] Leiba、B。、「RFC 2119キーワードの大文字と小文字のあいまいさ」、BCP 14、RFC 8174、DOI 10.17487/RFC8174、2017年5月、<https：//www.rfc-editor.org/info/RFC8174>。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "ja": "7.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[HTML] WHATWG, \"HTML Living Standard\", May 2022, <https://html.spec.whatwg.org/multipage/ scripting.html#prepare-a-script>.",
      "ja": "[HTML] Whatwg、 \"HTML Living Standard\"、2022年5月、<https://html.spec.whatwg.org/multipage/ scripting.html＃prepare-a-script>。"
    },
    {
      "indent": 3,
      "text": "[RFC3236] Baker, M. and P. Stark, \"The 'application/xhtml+xml' Media Type\", RFC 3236, DOI 10.17487/RFC3236, January 2002, <https://www.rfc-editor.org/info/rfc3236>.",
      "ja": "[RFC3236] Baker、M。and P. Stark、「Application/xhtml 'Media Type」、RFC 3236、DOI 10.17487/RFC3236、2002年1月、<https://www.rfc-editor.org/info/RFC3236>。"
    },
    {
      "indent": 3,
      "text": "[RFC3875] Robinson, D. and K. Coar, \"The Common Gateway Interface (CGI) Version 1.1\", RFC 3875, DOI 10.17487/RFC3875, October 2004, <https://www.rfc-editor.org/info/rfc3875>.",
      "ja": "[RFC3875] Robinson、D。およびK. Coar、「Common Gateway Interface（CGI）バージョン1.1」、RFC 3875、DOI 10.17487/RFC3875、2004年10月、<https://www.rfc-editor.org/info/RFC3875>。"
    },
    {
      "indent": 3,
      "text": "[RFC3986] Berners-Lee, T., Fielding, R., and L. Masinter, \"Uniform Resource Identifier (URI): Generic Syntax\", STD 66, RFC 3986, DOI 10.17487/RFC3986, January 2005, <https://www.rfc-editor.org/info/rfc3986>.",
      "ja": "[RFC3986] Berners-Lee、T.、Fielding、R。、およびL. Masinter、「Uniform Resource Identifier（URI）：Generic Syntax」、Std 66、RFC 3986、DOI 10.17487/RFC3986、2005年1月、<https：//www.rfc-editor.org/info/rfc3986>。"
    },
    {
      "indent": 3,
      "text": "[RFC3987] Duerst, M. and M. Suignard, \"Internationalized Resource Identifiers (IRIs)\", RFC 3987, DOI 10.17487/RFC3987, January 2005, <https://www.rfc-editor.org/info/rfc3987>.",
      "ja": "[RFC3987] Duerst、M。and M. Suignard、「国際化されたリソース識別子（IRIS）」、RFC 3987、DOI 10.17487/RFC3987、2005年1月、<https://www.rfc-editor.org/info/rfc3987>"
    },
    {
      "indent": 3,
      "text": "[SPECTRE] Kocher, P., Genkin, D., Gruss, D., Haas, W., Hamburg, M., Lipp, M., Mangard, S., Prescher, T., Schwarz, M., and Y. Yarom, \"Spectre Attacks: Exploiting Speculative Execution\", DOI 10.48550/arXiv.1801.01203, January 2018, <https://arxiv.org/abs/1801.01203>.",
      "ja": "[スペクター] Kocher、P.、Genkin、D.、Gruss、D.、Haas、W.、Hamburg、M.、Lipp、M.、Mangard、S.、Prescher、T.、Schwarz、M。、Y Y。Yarom、「Spectre Attacks：Exploeding -Quationative Decution」、doi 10.48550/arxiv.1801.01203、2018年1月、<https://arxiv.org/abs/1801.01203>。"
    },
    {
      "indent": 3,
      "text": "[TC39-MIME-ISSUE] TC39, \"Add 'application/javascript+module' mime to remove ambiguity\", Wayback Machine archive, August 2017, <https:/ /web.archive.org/web/20170814193912/https://github.com/ tc39/ecma262/issues/322>.",
      "ja": "[TC39-MIME-ISSUE] TC39、「Add 'Application/JavaScript Module' Mime 'Mime' Mime 'Mime' Mime 'Mime' Mime \"、Wayback Machine Archive、2017年8月、<https：//web.archive.org/web/20170814193912/https://githubububububub.com/tc39/ecma262/issues/322>。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Changes from RFC 4329",
      "section_title": true,
      "ja": "付録A. RFC 4329からの変更"
    },
    {
      "indent": 3,
      "text": "* Added a section discussing ECMAScript modules and the impact on processing.",
      "ja": "* ECMAScriptモジュールと処理への影響を議論するセクションを追加しました。"
    },
    {
      "indent": 3,
      "text": "* Updated the Security Considerations section to discuss concerns associated with ECMAScript modules and SharedArrayBuffers.",
      "ja": "* セキュリティに関する考慮事項セクションを更新して、ECMAScriptモジュールとShareDarrayBuffersに関連する懸念について説明しました。"
    },
    {
      "indent": 3,
      "text": "* Updated the character encoding scheme detection to remove normative guidance on its use, to better reflect operational reality.",
      "ja": "* キャラクターエンコードスキーム検出を更新して、その使用に関する規範的なガイダンスを削除し、運用上の現実をよりよく反映しました。"
    },
    {
      "indent": 3,
      "text": "* Changed the intended usage of the media type \"text/javascript\" from OBSOLETE to COMMON.",
      "ja": "* メディアタイプの「Text/JavaScript」の意図した使用法を廃止から共通に変更しました。"
    },
    {
      "indent": 3,
      "text": "* Changed the intended usage for all other script media types to obsolete.",
      "ja": "* 他のすべてのスクリプトメディアタイプの意図した使用法を廃止しました。"
    },
    {
      "indent": 3,
      "text": "* Updated various references where the original has been obsoleted.",
      "ja": "* オリジナルが廃止されたさまざまな参照を更新しました。"
    },
    {
      "indent": 3,
      "text": "* Updated references to ECMA-262 to match the version at the time of publication.",
      "ja": "* ECMA-262への参照を更新して、出版時にバージョンと一致しました。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "This work builds upon its antecedent document, authored by Björn Höhrmann. The authors would like to thank Adam Roach, Alexey Melnikov, Allen Wirfs-Brock, Anne van Kesteren, Ben Campbell, Benjamin Kaduk, Éric Vyncke, Francesca Palombini, James Snell, Kirsty Paine, Mark Nottingham, Murray Kucherawy, Ned Freed, Robert Sparks, and Suresh Krishnan for their guidance and feedback throughout this process.",
      "ja": "この作品は、BjörnHöhrmannが作成した前件の文書に基づいています。著者は、Adam Roach、Alexey Melnikov、Allen Wirfs-Brock、Anne Van Kesteren、Ben Campbell、Benjamin Kaduk、Eric Vyncke、Francesca Palombini、James Snell、Kirsty Paine、Marra、およびこのプロセス全体のガイダンスとフィードバックについてのSuresh Krishnan。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Matthew A. Miller Email: linuxwolf+ietf@outer-planes.net",
      "ja": "Matthew A. Millerメール：Linuxwolf ietf@outer-planes.net"
    },
    {
      "indent": 3,
      "text": "Myles Borins GitHub Email: mylesborins@github.com",
      "ja": "Myles Borins Githubメール：mylesborins@github.com"
    },
    {
      "indent": 3,
      "text": "Mathias Bynens Google Email: mths@google.com",
      "ja": "Mathias Bynens Googleメール：mths@google.com"
    },
    {
      "indent": 3,
      "text": "Bradley Farias Email: bradley.meck@gmail.com",
      "ja": "Bradley Fariasメール：bradley.meck@gmail.com"
    }
  ]
}