{
  "title": {
    "text": "RFC 9602 - Segment Routing over IPv6 (SRv6) Segment Identifiers in the IPv6 Addressing Architecture",
    "ja": "RFC 9602 - IPv6（SRV6）のセグメント識別子のセグメントルーティングIPv6アドレス指定アーキテクチャのセグメント識別子"
  },
  "number": 9602,
  "created_at": "2024-10-22 23:24:36.443845+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                       S. Krishnan\nRequest for Comments: 9602                                         Cisco\nCategory: Informational                                     October 2024\nISSN: 2070-1721",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Segment Routing over IPv6 (SRv6) Segment Identifiers in the IPv6 Addressing Architecture",
      "section_title": true,
      "ja": "IPv6（SRV6）のセグメント識別子のセグメントルーティングIPv6アドレス指定アーキテクチャのセグメント識別子"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "section_title": true,
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "Segment Routing over IPv6 (SRv6) uses IPv6 as the underlying data plane. Thus, Segment Identifiers (SIDs) used by SRv6 can resemble IPv6 addresses and behave like them while exhibiting slightly different behaviors in some situations. This document explores the characteristics of SRv6 SIDs and focuses on the relationship of SRv6 SIDs to the IPv6 Addressing Architecture. This document allocates and makes a dedicated prefix available for SRv6 SIDs.",
      "ja": "IPv6を介したセグメントルーティング（SRV6）は、IPv6を基礎となるデータプレーンとして使用します。したがって、SRV6が使用するセグメント識別子（SIDS）は、IPv6アドレスに似ており、状況によってはわずかに異なる動作を示しながら、それらのように動作する可能性があります。このドキュメントでは、SRV6 SIDSの特性を調査し、SRV6 SIDとIPv6アドレス指定アーキテクチャとの関係に焦点を当てています。このドキュメントは、SRV6 SIDSに専用のプレフィックスを割り当て、使用できるようにします。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "section_title": true,
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントは、インターネット標準の追跡仕様ではありません。情報目的で公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are candidates for any level of Internet Standard; see Section 2 of RFC 7841.",
      "ja": "このドキュメントは、インターネットエンジニアリングタスクフォース（IETF）の製品です。IETFコミュニティのコンセンサスを表しています。公開レビューを受けており、インターネットエンジニアリングステアリンググループ（IESG）からの出版が承認されています。IESGによって承認されたすべてのドキュメントが、インターネット標準のあらゆるレベルの候補者であるわけではありません。RFC 7841のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at https://www.rfc-editor.org/info/rfc9602.",
      "ja": "このドキュメントの現在のステータス、任意のERRATA、およびそのフィードバックを提供する方法に関する情報は、https://www.rfc-editor.org/info/rfc9602で取得できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "section_title": true,
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2024 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（c）2024 IETF Trustおよび文書著者として特定された人。無断転載を禁じます。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (https://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Revised BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Revised BSD License.",
      "ja": "このドキュメントは、BCP 78およびIETFドキュメント（https://trustee.ietf.org/license-info）に関連するIETF Trustの法的規定の対象となります。この文書に関するあなたの権利と制限を説明するので、これらの文書を注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、セクション4.Eで説明されている法的規定のセクション4.Eで説明されており、修正されたBSDライセンスで説明されている保証なしで提供されるように、改訂されたBSDライセンステキストを含める必要があります。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "section_title": true,
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction\n2.  Terminology\n3.  SRv6 SIDs and the IPv6 Addressing Architecture\n4.  Special Considerations for Compressed SIDs\n5.  Allocation of a Prefix for SIDs\n6.  IANA Considerations\n7.  Security Considerations\n8.  References\n  8.1.  Normative References\n  8.2.  Informative References\nAcknowledgments\nAuthor's Address",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "Segment Routing over IPv6 (SRv6) [RFC8754] uses IPv6 as the underlying data plane. In SRv6, SR source nodes initiate packets with a Segment Identifier (SID) in the Destination Address of the IPv6 header, and SR segment endpoint nodes process a local segment present in the Destination Address of an IPv6 header. Thus, SIDs in SRv6 can, and do, appear in the Destination Address of IPv6 datagrams by design. This document explores the characteristics of SRv6 SIDs and focuses on the relationship of SRv6 SIDs to the IPv6 Addressing Architecture [RFC4291]. This document allocates and makes a dedicated prefix available for SRv6 SIDs.",
      "ja": "IPv6（SRV6）[RFC8754]のセグメントルーティングは、IPv6を基礎となるデータプレーンとして使用します。SRV6では、SRソースノードは、IPv6ヘッダーの宛先アドレスにセグメント識別子（SID）でパケットを開始し、SRセグメントエンドポイントノードはIPv6ヘッダーの宛先アドレスに存在するローカルセグメントを処理します。したがって、SRV6のSIDSは、設計によりIPv6データグラムの宛先アドレスに表示される可能性があります。このドキュメントでは、SRV6 SIDSの特性を調査し、SRV6 SIDSとIPv6アドレス指定アーキテクチャ[RFC4291]との関係に焦点を当てています。このドキュメントは、SRV6 SIDSに専用のプレフィックスを割り当て、使用できるようにします。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "ja": "2. 用語"
    },
    {
      "indent": 3,
      "text": "The following terms are used as defined in [RFC8402].",
      "ja": "次の用語は、[RFC8402]で定義されているように使用されます。"
    },
    {
      "indent": 6,
      "text": "* Segment Routing (SR)",
      "ja": "* セグメントルーティング（SR）"
    },
    {
      "indent": 6,
      "text": "* SR Domain",
      "ja": "* SRドメイン"
    },
    {
      "indent": 6,
      "text": "* Segment",
      "ja": "* セグメント"
    },
    {
      "indent": 6,
      "text": "* Segment Identifier (SID)",
      "ja": "* セグメント識別子（SID）"
    },
    {
      "indent": 6,
      "text": "* SRv6",
      "ja": "* SRV6"
    },
    {
      "indent": 6,
      "text": "* SRv6 SID",
      "ja": "* SRV6 SID"
    },
    {
      "indent": 3,
      "text": "The following terms are used as defined in [RFC8754].",
      "ja": "次の用語は、[RFC8754]で定義されているように使用されます。"
    },
    {
      "indent": 6,
      "text": "* Segment Routing Header (SRH)",
      "ja": "* セグメントルーティングヘッダー（SRH）"
    },
    {
      "indent": 6,
      "text": "* SR Source Node",
      "ja": "* SRソースノード"
    },
    {
      "indent": 6,
      "text": "* Transit Node",
      "ja": "* トランジットノード"
    },
    {
      "indent": 6,
      "text": "* SR Segment Endpoint Node",
      "ja": "* SRセグメントエンドポイントノード"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14 [RFC2119] [RFC8174] when, and only when, they appear in all capitals, as shown here.",
      "ja": "キーワード「必須」、「必要」、「必須」、「shall」、「shall」、「shill \"of\"、 \"nove\"、 \"becommended\"、 \"becommented\"、 \"may\"、 \"optional「このドキュメントでは、BCP 14 [RFC2119] [RFC8174]で説明されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "3. SRv6 SIDs and the IPv6 Addressing Architecture",
      "section_title": true,
      "ja": "3. SRV6 SIDSおよびIPV6アドレス指定アーキテクチャ"
    },
    {
      "indent": 3,
      "text": "[RFC8754] defines the Segment List of the SRH as a contiguous array of 128-bit IPv6 addresses; further, it states that each of the elements in this list are SIDs. But all of these elements are not necessarily made equal. Some of these elements may represent a local interface as described in Section 4.3 of [RFC8754] as \"A FIB entry that represents a local interface, not locally instantiated as an SRv6 SID\". It follows that not all the SIDs that appear in the SRH are SRv6 SIDs as defined by [RFC8402].",
      "ja": "[RFC8754]は、SRHのセグメントリストを128ビットIPv6アドレスの連続配列として定義します。さらに、このリストの各要素はSIDSであると述べています。しかし、これらの要素はすべて、必ずしも等しくなるとは限りません。これらの要素の一部は、[RFC8754]のセクション4.3で説明されているように、「SRV6 SIDとして局所的にインスタンス化されていないローカルインターフェイスを表すFIBエントリ」としてローカルインターフェイスを表す場合があります。SRHに表示されるすべてのSIDが[RFC8402]で定義されているようにSRV6 SIDSであるわけではありません。"
    },
    {
      "indent": 3,
      "text": "As stated above, the non-SRv6-SID elements that appear in the SRH SID list are simply IPv6 addresses assigned to local interfaces, and they need to conform to [RFC4291]. So, the following discussions are applicable solely to SRv6 SIDs that are not assigned to local interfaces.",
      "ja": "上記のように、SRH SIDリストに表示される非SRV6-SID要素は、ローカルインターフェイスに割り当てられたIPv6アドレスであり、[RFC4291]に準拠する必要があります。したがって、次の議論は、ローカルインターフェイスに割り当てられていないSRV6 SIDにのみ適用されます。"
    },
    {
      "indent": 3,
      "text": "One of the key questions to address is how these SRv6 SIDs appearing as IPv6 Destination Addresses are perceived and treated by \"transit nodes\" (that are not required to be capable of processing a Segment or the Segment Routing Header).",
      "ja": "対処すべき重要な質問の1つは、IPv6の宛先アドレスとして表示されるこれらのSRV6 SIDが、「トランジットノード」（セグメントまたはセグメントルーティングヘッダーの処理が必要である必要はない）によってどのように知覚および扱われるかです。"
    },
    {
      "indent": 3,
      "text": "Section 3.1 of [RFC8986] describes the format of an SRv6 SID as being composed of three parts, LOC:FUNCT:ARG, where a locator (LOC) is encoded in the L most significant bits of the SID followed by F bits of function (FUNCT) and A bits of arguments (ARG). If L+F+A < 128, the ARG is followed by enough zero bits to fill the 128-bit SID. Such an SRv6 SID is assigned to a node within a prefix defined as a Locator of length L. When an SRv6 SID occurs in the IPv6 Destination Address of an IPv6 header, only the longest matching prefix corresponding to the Locator [BCP198] is used by the transit node to forward the packet to the node identified by the Locator.",
      "ja": "[RFC8986]のセクション3.1は、SRV6 SIDの形式を3つの部分で構成されていると説明しています。Loc：funct：arg、ここで、ロケーター（loc）がsidの最も重要なビットでエンコードされ、その後の機能のビットが続きます（funct）および一連の議論（arg）。L+F+A <128の場合、ARGの後に128ビットSIDを埋めるのに十分なゼロビットが続きます。このようなSRV6 SIDは、長さLのロケーターとして定義されたプレフィックス内のノードに割り当てられます。SRV6SIDがIPv6ヘッダーのIPv6宛先アドレスで発生すると、ロケーター[BCP198]に対応する最長の一致するプレフィックスのみが使用されます。トランジットノードは、ロケーターによって識別されたノードにパケットを転送します。"
    },
    {
      "indent": 3,
      "text": "It is clear that this format for SRv6 SIDs is not compliant with the requirements set forth in [RFC4291] for IPv6 addresses, but it is also clear that SRv6 SIDs are not intended for assignment onto interfaces on end hosts. They look and act like other mechanisms that use IPv6 addresses with different formats, such as those described in \"IPv6 Addressing of IPv4/IPv6 Translators\" [RFC6052] and \"An IPv6 Prefix for Overlay Routable Cryptographic Hash Identifiers Version 2 (ORCHIDv2)\" [RFC7343].",
      "ja": "SRV6 SIDSのこの形式は、IPv6アドレスの[RFC4291]に記載されている要件に準拠していないことは明らかですが、SRV6 SIDSがエンドホストのインターフェイスへの割り当てを意図していないことも明らかです。彼らは、「IPv4/IPv6翻訳者のIPv6アドレス指定」[RFC6052]や「オーバーレイルーティング可能な暗号化ハッシュ識別子バージョンバージョン2（orchidv2）」の「IPv4/IPv6翻訳者のアドレス指定」[RFC6052] [RFC6052]に記載されているような、さまざまな形式でIPv6アドレスを使用する他のメカニズムのように見えます。RFC7343]。"
    },
    {
      "indent": 3,
      "text": "While looking at the transit nodes, it becomes apparent that these addresses are used purely for forwarding and not for packet delivery to end hosts. Hence, the relevant specification to apply here is [BCP198], which requires implementations to support the use of variable-length prefixes in forwarding while explicitly decoupling IPv6 routing and forwarding from the IPv6 address/prefix semantics described in [RFC4291]. Please note that [BCP198] does not override the rules in [RFC4291]: it merely limits where their impact is observed.",
      "ja": "トランジットノードを見ている間、これらのアドレスは純粋に転送に使用され、ホストを終了するためのパケット配信ではなく使用されることが明らかになります。したがって、ここで適用するための関連する仕様は[BCP198]です。これは、[RFC4291]で説明されているIPv6アドレス/プレフィックスセマンティクスからのIPv6ルーティングと転送を明示的に分離しながら、転送に変数長のプレフィックスの使用をサポートするための実装が必要です。[BCP198]は[RFC4291]のルールを無効にしないことに注意してください。それは、その影響が観察される場所を制限するだけです。"
    },
    {
      "indent": 3,
      "text": "Furthermore, in the SRv6 specifications, all SIDs assigned within a given Locator prefix are located inside the node identified by Locator. Therefore, there does not appear to be a conflict with Section 2.6.1 of [RFC4291] since subnet-router anycast addresses are neither required nor useful within a node.",
      "ja": "さらに、SRV6仕様では、特定のロケータープレフィックス内に割り当てられたすべてのSIDは、ロケーターによって識別されるノード内にあります。したがって、サブネットルーターのaycastアドレスはノード内では必要でも有用でもないため、[RFC4291]のセクション2.6.1との競合はないようです。"
    },
    {
      "indent": 0,
      "text": "4. Special Considerations for Compressed SIDs",
      "section_title": true,
      "ja": "4. 圧縮されたSIDの特別な考慮事項"
    },
    {
      "indent": 3,
      "text": "[CSID] introduces an encoding for Compressed-SIDs (C-SIDs), and describes how to use a single entry in the Segment List as a container for multiple SIDs. A node taking part in this mechanism accomplishes this by using the ARG part [RFC8986] of the Destination Address of the IPv6 header to derive a new Destination Address. That is, the Destination Address field of the packet changes at a segment endpoint in a way similar to how the address changes as the result of processing a segment in the SRH.",
      "ja": "[CSID]は、圧縮されたSID（C-SIDS）のエンコーディングを導入し、セグメントリストの単一のエントリを複数のSIDのコンテナとして使用する方法について説明します。このメカニズムに参加しているノードは、IPv6ヘッダーの宛先アドレスのArg部分[RFC8986]を使用して新しい宛先アドレスを導出することにより、これを達成します。つまり、パケットの宛先アドレスフィールドは、SRHのセグメントを処理した結果としてアドレスがどのように変化するかと同様に、セグメントエンドポイントで変更されます。"
    },
    {
      "indent": 3,
      "text": "One key thing to note here is that the Locator Block at the beginning of the address does not get modified by the operations needed for supporting C-SIDs. As we have established that the SRv6 SIDs are being treated simply as routing prefixes on transit nodes within the SR Domain, this does not constitute a modification to the IPv6 data plane on such transit nodes: any changes are restricted to SR-aware nodes.",
      "ja": "ここで注意すべき重要なことの1つは、アドレスの先頭にあるロケーターブロックが、C-SIDをサポートするために必要な操作によって変更されないことです。SRV6 SIDSがSRドメイン内のトランジットノードのルーティングプレフィックスとして単純に扱われていることを確認したため、これはそのようなトランジットノードのIPv6データプレーンの変更を構成するものではありません。変更はSR-Awareノードに制限されています。"
    },
    {
      "indent": 0,
      "text": "5. Allocation of a Prefix for SIDs",
      "section_title": true,
      "ja": "5. SIDSのプレフィックスの割り当て"
    },
    {
      "indent": 3,
      "text": "All of the SRv6-related specifications discussed above are intended to be applicable to a contained SR Domain or between collaborating SR Domains. Nodes either inside or outside the SR Domains that are not SR-aware will not perform any special behavior for SRv6 SIDs and will treat them solely as IPv6 routing prefixes.",
      "ja": "上記のすべてのSRV6関連の仕様は、含まれているSRドメインに適用されることを目的としています。SR-AwareではないSRドメインの内側または外側のノードは、SRV6 SIDSの特別な動作を実行せず、IPv6ルーティングのプレフィックスとしてのみ扱います。"
    },
    {
      "indent": 3,
      "text": "As an added factor of security, it is desirable to allocate some address space that explicitly signals that the addresses within that space cannot be expected to comply with [RFC4291]. As described in Section 3, there is precedent for mechanisms that use IPv6 addresses in a manner different from that specified in [RFC4291]. This would be useful in identifying and potentially filtering packets at the edges of the SR Domains to make it simpler for the SR Domain to fail closed.",
      "ja": "セキュリティの追加要因として、そのスペース内のアドレスが[RFC4291]に準拠することが期待できないことを明示的に信号するいくつかのアドレス空間を割り当てることが望ましい。セクション3で説明されているように、[RFC4291]で指定されているものとは異なる方法でIPv6アドレスを使用するメカニズムの先例があります。これは、SRドメインのエッジでパケットを識別し、潜在的にフィルタリングして、SRドメインが閉じたままになるようにするのに役立ちます。"
    },
    {
      "indent": 3,
      "text": "At the time of writing, global DNS [RFC9499] SHOULD NOT reference addresses assigned from this block. Further specifications are needed to describe the conventions and guidelines for the use of this newly allocated address block. The SRv6 operational community, which is the first intended user of this block, is requested to come up with such conventions and guidelines in line with their requirements.",
      "ja": "執筆時点では、グローバルDNS [RFC9499]は、このブロックから割り当てられたアドレスを参照するべきではありません。この新しく割り当てられたアドレスブロックを使用するための規則とガイドラインを説明するために、さらなる仕様が必要です。このブロックの最初の意図されたユーザーであるSRV6 Operational Communityは、要件に沿ってそのような慣習とガイドラインを考案するように要求されています。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has assigned the following /16 address block for the purposes described in Section 5 and recorded the allocation in the \"IANA IPv6 Special-Purpose Address Registry\" [SPECIAL] as follows:",
      "ja": "IANAは、セクション5で説明されている目的のために次の /16アドレスブロックを割り当て、「IANA IPv6 Special-Purposeアドレスレジストリ」[Special]の割り当てを次のように記録しました。"
    },
    {
      "indent": 3,
      "text": "Address Block:",
      "ja": "アドレスブロック："
    },
    {
      "indent": 12,
      "text": "5f00::/16",
      "ja": "5F00 ::/16"
    },
    {
      "indent": 3,
      "text": "Name:",
      "ja": "名前："
    },
    {
      "indent": 12,
      "text": "Segment Routing (SRv6) SIDs",
      "ja": "セグメントルーティング（SRV6）SIDS"
    },
    {
      "indent": 3,
      "text": "RFC:",
      "ja": "RFC:"
    },
    {
      "indent": 12,
      "text": "RFC 9602",
      "ja": "RFC 9602"
    },
    {
      "indent": 3,
      "text": "Allocation Date:",
      "ja": "割り当て日："
    },
    {
      "indent": 12,
      "text": "2024-04",
      "ja": "2024-04"
    },
    {
      "indent": 3,
      "text": "Termination Date:",
      "ja": "終了日："
    },
    {
      "indent": 12,
      "text": "N/A",
      "ja": "n/a"
    },
    {
      "indent": 3,
      "text": "Source:",
      "ja": "ソース："
    },
    {
      "indent": 12,
      "text": "True",
      "ja": "真実"
    },
    {
      "indent": 3,
      "text": "Destination:",
      "ja": "行き先："
    },
    {
      "indent": 12,
      "text": "True",
      "ja": "真実"
    },
    {
      "indent": 3,
      "text": "Forwardable:",
      "ja": "フォローダブル："
    },
    {
      "indent": 12,
      "text": "True",
      "ja": "真実"
    },
    {
      "indent": 3,
      "text": "Globally Reachable:",
      "ja": "グローバルに到達可能："
    },
    {
      "indent": 12,
      "text": "False",
      "ja": "間違い"
    },
    {
      "indent": 3,
      "text": "Reserved-by-Protocol:",
      "ja": "プロトコルごとに予約済み："
    },
    {
      "indent": 12,
      "text": "False",
      "ja": "間違い"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "ja": "7. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "The security considerations for the use of Segment Routing [RFC8402], SRv6 [RFC8754], and SRv6 network programming [RFC8986] apply to the use of these addresses. The use of IPv6 tunneling mechanisms (including SRv6) also brings up additional concerns such as those described in [RFC6169]. The usage of the prefix allocated by this document improves security by making it simpler to filter traffic at the edge of the SR Domains.",
      "ja": "セグメントルーティング[RFC8402]、SRV6 [RFC8754]、およびSRV6ネットワークプログラミング[RFC8986]の使用に関するセキュリティ上の考慮事項は、これらのアドレスの使用に適用されます。IPv6トンネルメカニズム（SRV6を含む）の使用は、[RFC6169]に記載されているような追加の懸念をもたらします。このドキュメントによって割り当てられたプレフィックスの使用は、SRドメインの端でトラフィックをフィルタリングするように簡単にすることにより、セキュリティを改善します。"
    },
    {
      "indent": 3,
      "text": "In case the deployments do not use this allocated prefix, additional care needs to be exercised at network ingress and egress points so that SRv6 packets do not leak out of SR Domains and do not accidentally enter SR-unaware Domains. Similarly, as stated in Section 5.1 of [RFC8754], the SR Domain needs to be configured to filter out packets entering that use the selected prefix.",
      "ja": "展開がこの割り当てられたプレフィックスを使用しない場合、SRV6パケットがSRドメインから漏れなくなり、誤ってSR-Unawareドメインに入らないように、ネットワークイングレスポイントと出力ポイントで追加のケアを行使する必要があります。同様に、[RFC8754]のセクション5.1で述べたように、選択したプレフィックスを使用するパケットをフィルタリングするようにSRドメインを構成する必要があります。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8. 参考文献"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "ja": "8.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[BCP198]   Best Current Practice 198,\n           <https://www.rfc-editor.org/info/bcp198>.\n           At the time of writing, this BCP comprises the following:\n\n           Boucadair, M., Petrescu, A., and F. Baker, \"IPv6 Prefix\n           Length Recommendation for Forwarding\", BCP 198, RFC 7608,\n           DOI 10.17487/RFC7608, July 2015,\n           <https://www.rfc-editor.org/info/rfc7608>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC2119]  Bradner, S., \"Key words for use in RFCs to Indicate\n           Requirement Levels\", BCP 14, RFC 2119,\n           DOI 10.17487/RFC2119, March 1997,\n           <https://www.rfc-editor.org/info/rfc2119>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC4291]  Hinden, R. and S. Deering, \"IP Version 6 Addressing\n           Architecture\", RFC 4291, DOI 10.17487/RFC4291, February\n           2006, <https://www.rfc-editor.org/info/rfc4291>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC8174]  Leiba, B., \"Ambiguity of Uppercase vs Lowercase in RFC\n           2119 Key Words\", BCP 14, RFC 8174, DOI 10.17487/RFC8174,\n           May 2017, <https://www.rfc-editor.org/info/rfc8174>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC8402]  Filsfils, C., Ed., Previdi, S., Ed., Ginsberg, L.,\n           Decraene, B., Litkowski, S., and R. Shakir, \"Segment\n           Routing Architecture\", RFC 8402, DOI 10.17487/RFC8402,\n           July 2018, <https://www.rfc-editor.org/info/rfc8402>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC8754]  Filsfils, C., Ed., Dukes, D., Ed., Previdi, S., Leddy, J.,\n           Matsushima, S., and D. Voyer, \"IPv6 Segment Routing Header\n           (SRH)\", RFC 8754, DOI 10.17487/RFC8754, March 2020,\n           <https://www.rfc-editor.org/info/rfc8754>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC8986]  Filsfils, C., Ed., Camarillo, P., Ed., Leddy, J., Voyer,\n           D., Matsushima, S., and Z. Li, \"Segment Routing over IPv6\n           (SRv6) Network Programming\", RFC 8986,\n           DOI 10.17487/RFC8986, February 2021,\n           <https://www.rfc-editor.org/info/rfc8986>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "ja": "8.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[CSID]     Cheng, W., Filsfils, C., Li, Z., Decraene, B., and F.\n           Clad, \"Compressed SRv6 Segment List Encoding\", Work in\n           Progress, Internet-Draft, draft-ietf-spring-srv6-srh-\n           compression-18, 22 July 2024,\n           <https://datatracker.ietf.org/doc/html/draft-ietf-spring-\n           srv6-srh-compression-18>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC6052]  Bao, C., Huitema, C., Bagnulo, M., Boucadair, M., and X.\n           Li, \"IPv6 Addressing of IPv4/IPv6 Translators\", RFC 6052,\n           DOI 10.17487/RFC6052, October 2010,\n           <https://www.rfc-editor.org/info/rfc6052>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC6169]  Krishnan, S., Thaler, D., and J. Hoagland, \"Security\n           Concerns with IP Tunneling\", RFC 6169,\n           DOI 10.17487/RFC6169, April 2011,\n           <https://www.rfc-editor.org/info/rfc6169>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC7343]  Laganier, J. and F. Dupont, \"An IPv6 Prefix for Overlay\n           Routable Cryptographic Hash Identifiers Version 2\n           (ORCHIDv2)\", RFC 7343, DOI 10.17487/RFC7343, September\n           2014, <https://www.rfc-editor.org/info/rfc7343>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC9499]  Hoffman, P. and K. Fujiwara, \"DNS Terminology\", BCP 219,\n           RFC 9499, DOI 10.17487/RFC9499, March 2024,\n           <https://www.rfc-editor.org/info/rfc9499>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[SPECIAL]  IANA, \"IANA IPv6 Special-Purpose Address Registry\",\n           <https://www.iana.org/assignments/iana-ipv6-special-\n           registry>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Acknowledgments",
      "section_title": true,
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "The author would like to extend a special note of thanks to Brian Carpenter and Erik Kline for their precisely summarized thoughts on this topic that provided the seed of this document. The author would also like to thank Andrew Alston, Fred Baker, Ron Bonica, Nick Buraglio, Bruno Decraene, Dhruv Dhody, Darren Dukes, Linda Dunbar, Reese Enghardt, Adrian Farrel, Clarence Filsfils, Jim Guichard, Joel Halpern, Ted Hardie, Bob Hinden, Murray Kucherawy, Cheng Li, Acee Lindem, Jen Linkova, Gyan Mishra, Yingzhen Qu, Robert Raszuk, Alvaro Retana, Michael Richardson, John Scudder, Petr Spacek, Mark Smith, Dirk Steinberg, Ole Troan, Eduard Vasilenko, Éric Vyncke, Rob Wilton, Jingrong Xie, Chongfeng Xie, and Juan Carlos Zuniga for their ideas and comments to improve this document.",
      "ja": "著者は、このドキュメントの種を提供するこのトピックに関する正確に要約された考えについて、ブライアン・カーペンターとエリック・クラインに感謝の特別なメモを拡張したいと思います。著者はまた、アンドリュー・アルストン、フレッド・ベイカー、フレッド・ベイカー、ロン・ボニカ、ニック・ブラグリオ、ニック・ブラグリオ、ブルーノ・デクレエン、ドルフ・ドディ、ドゥルフ・ドディ、ダレン・デュークス、ダレン・デューク、リンダ・ダンバル、リース・エンガルト、リース・エンガルト、エイドリアン・ファレル、クラレンス・フィルズ、ジミー・グイチャード、ジム・グイチャード、ジム・グイチャード、ジム・ギチャード、ボブ・ボブ・ボブ・ボブ・ボブ、ヒンデン、マレー・クチェラウィ、チェン・リー、エイシー・リンデム、ジェン・リンカバ、ギャン・ミシュラ、インズヘン・ク、ロバート・ラシュク、アルバロ・レターナ、マイケル・リチャードソン、ジョン・スカダー、ペトル・スペースこの文書を改善するためのアイデアとコメントについて、ロブ・ウィルトン、ジングロン・シー、チョンフェン・Xie、およびフアン・カルロス・ズニガ。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "section_title": true,
      "ja": "著者の連絡先"
    },
    {
      "indent": 3,
      "text": "Suresh Krishnan\nCisco\nEmail: suresh.krishnan@gmail.com",
      "raw": true,
      "ja": ""
    }
  ]
}