{
  "title": {
    "text": "RFC 9606 - DNS Resolver Information",
    "ja": "RFC 9606 - DNSリゾルバー情報"
  },
  "number": 9606,
  "created_at": "2024-06-30 23:24:09.911026+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                        T. Reddy.K\nRequest for Comments: 9606                                         Nokia\nCategory: Standards Track                                   M. Boucadair\nISSN: 2070-1721                                                   Orange\n                                                               June 2024",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "DNS Resolver Information",
      "section_title": true,
      "ja": "DNSリゾルバー情報"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "section_title": true,
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document specifies a method for DNS resolvers to publish information about themselves. DNS clients can use the resolver information to identify the capabilities of DNS resolvers. How DNS clients use such information is beyond the scope of this document.",
      "ja": "このドキュメントは、DNSリゾルバーが自分に関する情報を公開する方法を指定しています。DNSクライアントは、Resolver情報を使用して、DNSリゾルバーの機能を識別できます。DNSクライアントがそのような情報を使用する方法は、このドキュメントの範囲を超えています。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "section_title": true,
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準トラックドキュメントです。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 7841.",
      "ja": "このドキュメントは、インターネットエンジニアリングタスクフォース（IETF）の製品です。IETFコミュニティのコンセンサスを表しています。公開レビューを受けており、インターネットエンジニアリングステアリンググループ（IESG）からの出版が承認されています。インターネット標準の詳細については、RFC 7841のセクション2で入手できます。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at https://www.rfc-editor.org/info/rfc9606.",
      "ja": "このドキュメントの現在のステータス、任意のERRATA、およびそのフィードバックを提供する方法に関する情報は、https://www.rfc-editor.org/info/rfc9606で取得できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "section_title": true,
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2024 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（c）2024 IETF Trustおよび文書著者として特定された人。無断転載を禁じます。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (https://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Revised BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Revised BSD License.",
      "ja": "このドキュメントは、BCP 78およびIETFドキュメント（https://trustee.ietf.org/license-info）に関連するIETF Trustの法的規定の対象となります。この文書に関するあなたの権利と制限を説明するので、これらの文書を注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、セクション4.Eで説明されている法的規定のセクション4.Eで説明されており、修正されたBSDライセンスで説明されている保証なしで提供されるように、改訂されたBSDライセンステキストを含める必要があります。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "section_title": true,
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction\n2.  Terminology\n3.  Retrieving Resolver Information\n4.  Format of the Resolver Information\n5.  Resolver Information Keys/Values\n6.  An Example\n7.  Security Considerations\n8.  IANA Considerations\n  8.1.  RESINFO RR Type\n  8.2.  DNS Resolver Information Keys Registration\n  8.3.  Guidelines for the Designated Experts\n9.  References\n  9.1.  Normative References\n  9.2.  Informative References\nAcknowledgments\nAuthors' Addresses",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "Historically, DNS clients communicated with recursive resolvers without needing to know anything about the features supported by these resolvers. However, more and more recursive resolvers expose different features that may impact delivered DNS services (privacy preservation, filtering, transparent behavior, etc.). DNS clients can discover and authenticate encrypted DNS resolvers provided by a local network, for example, using the Discovery of Network-designated Resolvers (DNR) [RFC9463] and the Discovery of Designated Resolvers (DDR) [RFC9462]. However, these DNS clients can't retrieve information from the discovered recursive resolvers about their capabilities to feed the resolver selection process. Instead of depending on opportunistic approaches, DNS clients need a more reliable mechanism to discover the features that are configured on these resolvers.",
      "ja": "歴史的に、DNSクライアントは、これらのリゾルバーでサポートされている機能について何も知る必要なく、再帰的なリゾルバーと通信しました。ただし、ますます再帰的なリゾルバーは、提供されたDNSサービス（プライバシー保存、フィルタリング、透明行動など）に影響を与える可能性のあるさまざまな機能を公開します。DNSクライアントは、ネットワーク指定リゾルバー（DNR）[RFC9463]の発見と指定されたリゾルバー（DDR）[RFC9462]の発見など、ローカルネットワークが提供する暗号化されたDNSリゾルバーを発見および認証できます。ただし、これらのDNSクライアントは、リゾルバーの選択プロセスに供給する機能について、発見された再帰リゾルバーから情報を取得することはできません。DNSクライアントは、日和見的なアプローチに依存するのではなく、これらのリゾルバーで構成されている機能を発見するために、より信頼できるメカニズムを必要とします。"
    },
    {
      "indent": 3,
      "text": "This document fills that void by specifying a mechanism that allows communication of DNS resolver information to DNS clients for use in resolver selection decisions. For example, the resolver selection procedure may use the retrieved resolver information to prioritize privacy-preserving resolvers over those that don't enable QNAME minimisation [RFC9156]. Another example is when a DNS client selects a resolver based on its filtering capability. For instance, a DNS client can choose a resolver that filters domains according to a security policy using the Blocked (15) Extended DNS Error (EDE) [RFC8914]. Alternatively, the client may have a policy not to select a resolver that forges responses using the Forged Answer (4) EDE. However, it is out of the scope of this document to define the selection procedure and policies. Once a resolver is selected by a DNS client, and unless explicitly mentioned, this document does not interfere with that resolver's DNS operations.",
      "ja": "このドキュメントは、Resolver選択の決定に使用するためにDNSリゾルバー情報とDNSクライアントとの通信を可能にするメカニズムを指定することにより、その無効化を埋めます。たとえば、リゾルバーの選択手順では、検索されたリゾルバー情報を使用して、QName最小化[RFC9156]を有効にしないプライバシーを提供するリゾルバーに優先順位を付けることができます。別の例は、DNSクライアントがフィルタリング機能に基づいてリゾルバーを選択する場合です。たとえば、DNSクライアントは、ブロックされた（15）拡張DNSエラー（EDE）[RFC8914]を使用して、セキュリティポリシーに従ってドメインをフィルタリングするリゾルバーを選択できます。あるいは、クライアントには、偽造回答（4）EDEを使用して応答を構築するリゾルバーを選択しないポリシーがある場合があります。ただし、選択手順とポリシーを定義するのは、このドキュメントの範囲外です。DNSクライアントによってリゾルバーが選択されると、明示的に言及されていない限り、このドキュメントはそのリゾルバーのDNS操作を妨げません。"
    },
    {
      "indent": 3,
      "text": "Specifically, this document defines a new resource record (RR) type for DNS clients to query the recursive resolvers. The initial information that a resolver might want to expose is defined in Section 5. That information is scoped to cover properties that are used to infer privacy and transparency policies of a resolver. Other information can be registered in the future per the guidance in Section 8.2. The information is not intended for end-user consumption.",
      "ja": "具体的には、このドキュメントでは、DNSクライアントが再帰的なリゾルバーを照会するための新しいリソースレコード（RR）タイプを定義します。リゾルバーが公開したい可能性のある初期情報は、セクション5で定義されています。この情報は、リゾルバーのプライバシーと透明性ポリシーを推測するために使用されるプロパティをカバーするために範囲されています。その他の情報は、セクション8.2のガイダンスに従って将来登録できます。情報は、エンドユーザーの消費を目的としていません。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "ja": "2. 用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14 [RFC2119] [RFC8174] when, and only when, they appear in all capitals, as shown here.",
      "ja": "「必須」、「必要」、「必須」、「shall」、「shall」、「suff」、 \"not\"、 \"becommended\"、 \"becommented\"、 \"may\"、 \"optional「このドキュメントでは、BCP 14 [RFC2119] [RFC8174]で説明されているように解釈されます。"
    },
    {
      "indent": 3,
      "text": "This document makes use of the terms defined in [RFC9499]. The following additional terms are used:",
      "ja": "このドキュメントでは、[RFC9499]で定義されている用語を使用します。次の追加項が使用されます。"
    },
    {
      "indent": 3,
      "text": "Encrypted DNS:",
      "ja": "暗号化されたDNS："
    },
    {
      "indent": 12,
      "text": "Refers to a DNS scheme where DNS exchanges are transported over an encrypted channel between a DNS client and server (e.g., DNS over HTTPS (DoH) [RFC8484], DNS over TLS (DoT) [RFC7858], or DNS over QUIC (DoQ) [RFC9250]).",
      "ja": "DNS交換がDNSクライアントとサーバーの間の暗号化されたチャネルを介して輸送されるDNSスキーム（例：HTTPS（DOH）[RFC8484]、TLS（DOT）上のDNS（DOT）[RFC7858]、またはDNS over Quic（DOQ）を超えるDNSを指します。[RFC9250]）。"
    },
    {
      "indent": 3,
      "text": "Encrypted DNS resolver:",
      "ja": "暗号化されたDNSリゾルバー："
    },
    {
      "indent": 12,
      "text": "Refers to a DNS resolver that supports any encrypted DNS scheme.",
      "ja": "暗号化されたDNSスキームをサポートするDNSリゾルバーを指します。"
    },
    {
      "indent": 3,
      "text": "Reputation:",
      "ja": "評判："
    },
    {
      "indent": 12,
      "text": "Defined as \"the estimation in which an identifiable actor is held, especially by the community or the Internet public generally\" per Section 1 of [RFC7070].",
      "ja": "[RFC7070]のセクション1ごとに、「特定可能なアクターが、特にコミュニティまたはインターネットの一般に一般的に一般的に保持される推定」として定義されています。"
    },
    {
      "indent": 0,
      "text": "3. Retrieving Resolver Information",
      "section_title": true,
      "ja": "3. リゾルバー情報の取得"
    },
    {
      "indent": 3,
      "text": "A DNS client that wants to retrieve the resolver information may use the RR type \"RESINFO\" defined in this document. The content of the RDATA in a response to a query for RESINFO RR QTYPE is defined in Section 5. If the resolver understands the RESINFO RR type, the RRset MUST have exactly one record. Invalid records MUST be silently ignored by DNS clients. RESINFO is a property of the resolver and is not subject to recursive resolution.",
      "ja": "Resolver情報を取得したいDNSクライアントは、このドキュメントで定義されているRRタイプの「Resinfo」を使用する場合があります。RDATAのコンテンツは、Resinfo RR QTypeのクエリへの応答においてセクション5で定義されています。リゾルバーがResinfo RRタイプを理解している場合、RRSetには正確に1つのレコードが必要です。無効なレコードは、DNSクライアントによって静かに無視されなければなりません。Resinfoはリゾルバーの財産であり、再帰解決の対象ではありません。"
    },
    {
      "indent": 3,
      "text": "A DNS client can retrieve the resolver information using the RESINFO RR type and the QNAME of the domain name that is used to authenticate the DNS resolver (referred to as the Authentication Domain Name (ADN) in DNR [RFC9463]).",
      "ja": "DNSクライアントは、DNSリゾルバー（DNR [RFC9463]の認証ドメイン名（ADN）と呼ばれる）を認証するために使用されるドメイン名のresinfo RRタイプとQNameを使用して、リゾルバー情報を取得できます。"
    },
    {
      "indent": 3,
      "text": "If the Special-Use Domain Name \"resolver.arpa\", defined in [RFC9462], is used to discover an encrypted DNS resolver, the client can retrieve the resolver information using the RESINFO RR type and QNAME of \"resolver.arpa\". In this case, a client has to contend with the risk that a resolver does not support RESINFO. The resolver might pass the query upstream, and then the client can receive a positive RESINFO response from either a legitimate DNS resolver or an attacker.",
      "ja": "[RFC9462]で定義されている特殊使用ドメイン名「Resolver.Arpa」が暗号化されたDNSリゾルバーを発見するために使用された場合、クライアントは「Resolver.Arpa」のResinfo RRタイプとQNameを使用してリゾルバー情報を取得できます。この場合、クライアントは、リゾルバーがResinfoをサポートしていないというリスクと闘う必要があります。リゾルバーはクエリを上流に渡す可能性があり、クライアントは正当なDNSリゾルバーまたは攻撃者のいずれかから肯定的な樹脂FO応答を受信できます。"
    },
    {
      "indent": 3,
      "text": "The DNS client MUST set the Recursion Desired (RD) bit of the query to 0. The DNS client MUST discard the response if the AA flag in the response is set to 0, indicating that the DNS resolver is not authoritative for the response.",
      "ja": "DNSクライアントは、クエリの希望の再帰（RD）ビットを0に設定する必要があります。DNSクライアントは、応答のAAフラグが0に設定されている場合、DNSリゾルバーが応答に対して権威がないことを示しています。"
    },
    {
      "indent": 3,
      "text": "If a group of resolvers is sharing the same ADN and/or anycast address, then these instances SHOULD expose a consistent RESINFO.",
      "ja": "リソースバーのグループが同じADNおよび/またはanycastアドレスを共有している場合、これらのインスタンスは一貫した樹脂を公開する必要があります。"
    },
    {
      "indent": 0,
      "text": "4. Format of the Resolver Information",
      "section_title": true,
      "ja": "4. リゾルバー情報の形式"
    },
    {
      "indent": 3,
      "text": "The resolver information record uses the same format as DNS TXT records. The format rules for TXT records are defined in the base DNS specification (Section 3.3.14 of [RFC1035]) and are further elaborated in the DNS-based Service Discovery (DNS-SD) specification (Section 6.1 of [RFC6763]). The recommendations to limit the TXT record size are discussed in Section 6.1 of [RFC6763].",
      "ja": "Resolver Information Recordは、DNS TXTレコードと同じ形式を使用します。TXTレコードの形式ルールは、ベースDNS仕様（[RFC1035]のセクション3.3.14）で定義されており、DNSベースのサービスディスカバリー（DNS-SD）仕様（[RFC6763のセクション6.1]）でさらに詳述されています。TXTレコードサイズを制限する推奨事項については、[RFC6763]のセクション6.1で説明します。"
    },
    {
      "indent": 3,
      "text": "Similar to DNS-SD, the RESINFO RR type uses \"key/value\" pairs to convey the resolver information. Each key/value pair is encoded using the format rules defined in Section 6.3 of [RFC6763]. Using standardized key/value syntax within the RESINFO RR type makes it easier for future keys to be defined. If a DNS client sees unknown keys in a RESINFO RR type, it MUST silently ignore them. The same rules for the keys, as defined in Section 6.4 of [RFC6763], MUST be followed for RESINFO.",
      "ja": "DNS-SDと同様に、Resinfo RRタイプは「キー/バリュー」ペアを使用してリゾルバー情報を伝えます。各キー/値ペアは、[RFC6763]のセクション6.3で定義されている形式のルールを使用してエンコードされます。Resinfo RRタイプ内で標準化されたキー/値の構文を使用すると、将来のキーが定義されやすくなります。DNSクライアントが樹脂RRタイプで不明なキーを表示する場合、それらを静かに無視する必要があります。[RFC6763]のセクション6.4で定義されているように、キーの同じルールに従う必要があります。"
    },
    {
      "indent": 3,
      "text": "Resolver information keys MUST either be defined in the IANA registry (Section 8.2) or begin with the substring \"temp-\" for names defined for local use only.",
      "ja": "Resolver Information Keyは、IANAレジストリ（セクション8.2）で定義するか、ローカル使用のみで定義された名前のサブストリング「Temp-」から始めなければなりません。"
    },
    {
      "indent": 0,
      "text": "5. Resolver Information Keys/Values",
      "section_title": true,
      "ja": "5. リゾルバー情報キー/値"
    },
    {
      "indent": 3,
      "text": "The following resolver information keys are defined:",
      "ja": "次のリゾルバー情報キーが定義されています。"
    },
    {
      "indent": 3,
      "text": "qnamemin:",
      "ja": "QNAMEMIN："
    },
    {
      "indent": 12,
      "text": "The presence of this key indicates that the DNS resolver supports QNAME minimisation [RFC9156] to improve DNS privacy. Note that, per the rules for the keys defined in Section 6.4 of [RFC6763], if there is no '=' in a key, then it is a boolean attribute, simply identified as being present, with no value.",
      "ja": "このキーの存在は、DNSリゾルバーがQNAME最小化[RFC9156]をサポートしてDNSプライバシーを改善することを示しています。[RFC6763]のセクション6.4で定義されているキーのルールに従って、キーに '='がない場合、それは単純に存在すると識別され、価値のないブール属性であることに注意してください。"
    },
    {
      "indent": 12,
      "text": "The presence of this key indicates that the DNS resolver is configured to minimise the amount of privacy-sensitive data sent to an authoritative name server.",
      "ja": "このキーの存在は、DNSリゾルバーが、権威ある名前サーバーに送信されるプライバシーに敏感なデータの量を最小化するように構成されていることを示しています。"
    },
    {
      "indent": 12,
      "text": "This is an optional attribute.",
      "ja": "これはオプションの属性です。"
    },
    {
      "indent": 3,
      "text": "exterr:",
      "ja": "exterr："
    },
    {
      "indent": 12,
      "text": "If the DNS resolver supports the EDE option defined in [RFC8914] to return additional information about the cause of DNS errors, the value of this key lists the possible EDE codes that can be returned by this DNS resolver. A value can be an individual EDE or a range of EDEs. Range values MUST be identified by \"-\". When multiple non-contiguous values are present, these values MUST be comma-separated.",
      "ja": "DNSリゾルバーが[RFC8914]で定義されているEDEオプションをサポートしてDNSエラーの原因に関する追加情報を返した場合、このキーの値は、このDNSリゾルバーによって返される可能性のあるEDEコードをリストします。値は、個々のエデまたは範囲のエドにすることができます。範囲値は「 - 」で識別する必要があります。複数の非連続値が存在する場合、これらの値はコンマを分離する必要があります。"
    },
    {
      "indent": 12,
      "text": "Returned EDEs (e.g., Blocked (15), Censored (16), and Filtered (17)) indicate whether the DNS resolver is configured to reveal the reason why a query was filtered/blocked when such an event happens. If the resolver's capabilities are updated to include new similar error codes, the resolver can terminate the TLS session, prompting the client to initiate a new TLS connection and retrieve the resolver information again. This allows the client to become aware of the resolver's updated capabilities. Alternatively, if the client receives an EDE for a DNS request, but that EDE was not listed in the \"exterr\", the client can query the resolver again to learn about the updated resolver's capabilities to return new error codes. If a mismatch still exists, the client can identify that the resolver information is inaccurate and discard it.",
      "ja": "返されたエド（例：ブロックされた（15）、検閲（16）、およびフィルタリング（17））は、DNSリゾルバーがそのようなイベントが発生したときにクエリがフィルタリング/ブロックされた理由を明らかにするように構成されているかどうかを示します。Resolverの機能が更新されて新しい類似のエラーコードが含まれている場合、ResolverはTLSセッションを終了し、クライアントに新しいTLS接続を開始し、再度リゾルバー情報を再び取得するように促すことができます。これにより、クライアントはリゾルバーの更新された機能を認識することができます。あるいは、クライアントがDNSリクエストのEDEを受信したが、そのEDEが「Exterr」にリストされていなかった場合、クライアントは再びリゾルバーを照会して、更新されたResolverの機能を学習して新しいエラーコードを返すことができます。不一致がまだ存在する場合、クライアントはリゾルバー情報が不正確であることを識別し、破棄できます。"
    },
    {
      "indent": 12,
      "text": "This is an optional attribute.",
      "ja": "これはオプションの属性です。"
    },
    {
      "indent": 3,
      "text": "infourl:",
      "ja": "Infourl："
    },
    {
      "indent": 12,
      "text": "A URL that points to the generic unstructured resolver information (e.g., DoH APIs supported, possible HTTP status codes returned by the DoH server, or how to report a problem) for troubleshooting purposes. The server that exposes such information is called \"resolver information server\".",
      "ja": "トラブルシューティングの目的で、一般的な非構造化リゾルバー情報（たとえば、DOHサーバーによって返される可能なHTTPステータスコード、または問題を報告する方法）を指すURL。そのような情報を公開するサーバーは、「Resolver Information Server」と呼ばれます。"
    },
    {
      "indent": 12,
      "text": "The resolver information server MUST support only the content-type \"text/html\" for the resolver information. The DNS client MUST reject the URL as invalid if the scheme is not \"https\". Invalid URLs MUST be ignored. The URL MUST be treated only as diagnostic information for IT staff. It is not intended for end-user consumption as the URL can possibly provide misleading information.",
      "ja": "Resolver Information Serverは、Resolver情報のコンテンツタイプの「テキスト/HTML」のみをサポートする必要があります。スキームが「https」ではない場合、DNSクライアントは無効としてURLを拒否する必要があります。無効なURLは無視する必要があります。URLは、ITスタッフの診断情報としてのみ扱わなければなりません。URLは誤解を招く情報を提供できる可能性があるため、エンドユーザーの消費を意図したものではありません。"
    },
    {
      "indent": 12,
      "text": "This key can be used by IT staff to retrieve other useful information about the resolver and also the procedure to report problems (e.g., invalid filtering).",
      "ja": "このキーは、ITスタッフがリゾルバーに関する他の有用な情報と、問題を報告する手順（無効なフィルタリングなど）を取得するために使用できます。"
    },
    {
      "indent": 12,
      "text": "This is an optional attribute.",
      "ja": "これはオプションの属性です。"
    },
    {
      "indent": 3,
      "text": "New keys can be defined as per the procedure defined in Section 8.2.",
      "ja": "新しいキーは、セクション8.2で定義されている手順に従って定義できます。"
    },
    {
      "indent": 0,
      "text": "6. An Example",
      "section_title": true,
      "ja": "6. 例"
    },
    {
      "indent": 3,
      "text": "Figure 1 shows an example of a published resolver information record.",
      "ja": "図1は、公開されているリゾルバー情報レコードの例を示しています。"
    },
    {
      "indent": 5,
      "text": "resolver.example.net. 7200 IN RESINFO qnamemin exterr=15-17\n                      infourl=https://resolver.example.com/guide",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 11,
      "text": "Figure 1: An Example of a Resolver Information Record",
      "ja": "図1：リゾルバー情報レコードの例"
    },
    {
      "indent": 3,
      "text": "As mentioned in Section 3, a DNS client that discovers the ADN \"resolver.example.net\" of its resolver using DNR will issue a query for RESINFO RR QTYPE for that ADN and will learn that:",
      "ja": "セクション3で述べたように、DNRを使用してResolver.example.net」をResolver.example.net」と発見するDNSクライアントは、そのADNのresinfo rr qtypeのクエリを発行し、次のことを学びます。"
    },
    {
      "indent": 6,
      "text": "* the resolver enables QNAME minimisation,",
      "ja": "* リゾルバーはQNameの最小化を有効にします。"
    },
    {
      "indent": 6,
      "text": "* the resolver can return Blocked (15), Censored (16), and Filtered (17) EDEs, and",
      "ja": "* リゾルバーは、ブロックされた（15）、検閲（16）、フィルター（17）エド、および"
    },
    {
      "indent": 6,
      "text": "* more information can be retrieved from \"https://resolver.example.com/guide\".",
      "ja": "* 詳細については、「https://resolver.example.com/guide」から取得できます。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "ja": "7. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "DNS clients communicating with discovered DNS resolvers MUST use one of the following measures to prevent DNS response forgery attacks:",
      "ja": "発見されたDNSリゾルバーと通信するDNSクライアントは、DNS応答の偽造攻撃を防ぐために、次の測定値のいずれかを使用する必要があります。"
    },
    {
      "indent": 8,
      "text": "1. Establish an authenticated secure connection to the DNS resolver.",
      "ja": "1. DNSリゾルバーへの認証された安全な接続を確立します。"
    },
    {
      "indent": 8,
      "text": "2. Implement local DNSSEC validation (Section 10 of [RFC9499]) to verify the authenticity of the resolver information.",
      "ja": "2. ローカルDNSSEC検証（[RFC9499]のセクション10）を実装して、リゾルバー情報の信頼性を検証します。"
    },
    {
      "indent": 3,
      "text": "It is important to note that, of these two measures, only the first one can apply to queries for \"resolver.arpa\".",
      "ja": "これらの2つの測定値のうち、最初の測定値のみが「resolver.arpa」のクエリに適用できることに注意することが重要です。"
    },
    {
      "indent": 3,
      "text": "An encrypted resolver may return incorrect information in RESINFO. If the client cannot validate the attributes received from the resolver, which will be used for resolver selection or displayed to the end user, the client should process those attributes only if the encrypted resolver has sufficient reputation according to local policy (e.g., user configuration, administrative configuration, or a built-in list of reputable resolvers). This approach limits the ability of a malicious encrypted resolver to cause harm with false claims.",
      "ja": "暗号化されたリゾルバーは、resinfoの誤った情報を返す場合があります。リゾルバーの選択に使用される、またはエンドユーザーに表示されるリゾルバーから受信した属性をクライアントが検証できない場合、クライアントは、暗号化されたリゾルバーがローカルポリシー（ユーザー構成、ユーザーの構成に従って十分な評判がある場合にのみ、それらの属性を処理する必要があります。管理構成、または評判の良いリゾルバーの組み込みリスト）。このアプローチは、悪意のある暗号化されたリゾルバーが虚偽の主張に害を及ぼす能力を制限します。"
    },
    {
      "indent": 0,
      "text": "8. IANA Considerations",
      "section_title": true,
      "ja": "8. IANAの考慮事項"
    },
    {
      "indent": 0,
      "text": "8.1. RESINFO RR Type",
      "section_title": true,
      "ja": "8.1. Resinfo rrタイプ"
    },
    {
      "indent": 3,
      "text": "IANA has updated the \"Resource Record (RR) TYPEs\" registry under the \"Domain Name System (DNS) Parameters\" registry group [RRTYPE] as follows:",
      "ja": "IANAは、「ドメイン名システム（DNS）パラメーター」レジストリグループ[RRTYPE]の下で「リソースレコード（RR）タイプ」レジストリを次のように更新しました。"
    },
    {
      "indent": 3,
      "text": "Type:",
      "ja": "タイプ："
    },
    {
      "indent": 12,
      "text": "RESINFO",
      "ja": "Resinfo"
    },
    {
      "indent": 3,
      "text": "Value:",
      "ja": "値："
    },
    {
      "indent": 12,
      "text": "261",
      "ja": "261"
    },
    {
      "indent": 3,
      "text": "Meaning:",
      "ja": "意味："
    },
    {
      "indent": 12,
      "text": "Resolver Information as Key/Value Pairs",
      "ja": "キー/値のペアとしてのリゾルバー情報"
    },
    {
      "indent": 3,
      "text": "Reference:",
      "ja": "参照："
    },
    {
      "indent": 12,
      "text": "RFC 9606",
      "ja": "RFC 9606"
    },
    {
      "indent": 0,
      "text": "8.2. DNS Resolver Information Keys Registration",
      "section_title": true,
      "ja": "8.2. DNS Resolver Information Keys登録"
    },
    {
      "indent": 3,
      "text": "IANA has created a new registry called \"DNS Resolver Information Keys\" under the \"Domain Name System (DNS) Parameters\" registry group [IANA-DNS]. This new registry contains definitions of the keys that can be used to provide the resolver information.",
      "ja": "IANAは、「ドメイン名システム（DNS）パラメーター」レジストリグループ[IANA-DNS]の下に「DNS Resolver Information Keys」と呼ばれる新しいレジストリを作成しました。この新しいレジストリには、リゾルバー情報の提供に使用できるキーの定義が含まれています。"
    },
    {
      "indent": 3,
      "text": "The registration procedure is Specification Required (Section 4.6 of [RFC8126]). Designated experts should carefully consider the security implications of allowing a resolver to include new keys in this registry. Additional considerations are provided in Section 8.3.",
      "ja": "登録手順は、[RFC8126]のセクション4.6）が必要です。指定された専門家は、リゾルバーがこのレジストリに新しいキーを含めることを許可することのセキュリティへの影響を慎重に検討する必要があります。追加の考慮事項は、セクション8.3に記載されています。"
    },
    {
      "indent": 3,
      "text": "The structure of the registry is as follows:",
      "ja": "レジストリの構造は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "Name:",
      "ja": "名前："
    },
    {
      "indent": 12,
      "text": "The key name. The name MUST conform to the definition in Section 4 of this document. The IANA registry MUST NOT register names that begin with \"temp-\" so that these names can be used freely by any implementer.",
      "ja": "キー名。名前は、このドキュメントのセクション4の定義に準拠する必要があります。IANAレジストリは、これらの名前を任意の実装者が自由に使用できるように、「Temp-」で始まる名前を登録してはなりません。"
    },
    {
      "indent": 3,
      "text": "Description:",
      "ja": "説明："
    },
    {
      "indent": 12,
      "text": "A description of the registered key.",
      "ja": "登録キーの説明。"
    },
    {
      "indent": 3,
      "text": "Reference:",
      "ja": "参照："
    },
    {
      "indent": 12,
      "text": "The reference specification for the registered element.",
      "ja": "登録要素の参照仕様。"
    },
    {
      "indent": 3,
      "text": "The initial contents of this registry are provided in Table 1.",
      "ja": "このレジストリの初期内容を表1に示します。"
    },
    {
      "indent": 6,
      "text": "+==========+=====================================+===========+\n| Name     | Description                         | Reference |\n+==========+=====================================+===========+\n| qnamemin | The presence of the key name        |  RFC 9606 |\n|          | indicates that QNAME minimisation   |           |\n|          | is enabled.                         |           |\n+----------+-------------------------------------+-----------+\n| exterr   | Lists the set of enabled extended   |  RFC 9606 |\n|          | DNS errors.  It must be an INFO-    |           |\n|          | CODE decimal value in the \"Extended |           |\n|          | DNS Error Codes\" registry           |           |\n|          | <https://www.iana.org/assignments/  |           |\n|          | dns-parameters/>.                   |           |\n+----------+-------------------------------------+-----------+\n| infourl  | Provides a URL that points to       |  RFC 9606 |\n|          | unstructured resolver information   |           |\n|          | that is used for troubleshooting.   |           |\n+----------+-------------------------------------+-----------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 8,
      "text": "Table 1: Initial Contents of the DNS Resolver Information Keys Registry",
      "ja": "表1：DNS Resolver Information Keysレジストリの初期内容"
    },
    {
      "indent": 0,
      "text": "8.3. Guidelines for the Designated Experts",
      "section_title": true,
      "ja": "8.3. 指定された専門家のためのガイドライン"
    },
    {
      "indent": 3,
      "text": "It is suggested that multiple designated experts be appointed for registry change requests.",
      "ja": "複数の指定された専門家がレジストリの変更リクエストに任命されることをお勧めします。"
    },
    {
      "indent": 3,
      "text": "Criteria that should be applied by the designated experts include determining whether the proposed registration duplicates existing entries and whether the registration description is clear and fits the purpose of this registry.",
      "ja": "指定された専門家が適用すべき基準には、提案された登録が既存のエントリを複製するかどうか、登録の説明が明確であるかどうかを決定することが含まれ、このレジストリの目的に適合します。"
    },
    {
      "indent": 3,
      "text": "Registration requests are evaluated within a two-week review period on the advice of one or more designated experts. Within the review period, the designated experts will either approve or deny the registration request, communicating this decision to IANA. Denials should include an explanation and, if applicable, suggestions as to how to make the request successful.",
      "ja": "登録要求は、1人以上の指定された専門家のアドバイスに関する2週間のレビュー期間内に評価されます。レビュー期間内に、指定された専門家は登録要求を承認または拒否し、この決定をIANAに伝えます。拒否には説明を含める必要があります。必要に応じて、リクエストを成功させる方法に関する提案が含まれます。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "ja": "9. 参考文献"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "ja": "9.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC1035]  Mockapetris, P., \"Domain names - implementation and\n           specification\", STD 13, RFC 1035, DOI 10.17487/RFC1035,\n           November 1987, <https://www.rfc-editor.org/info/rfc1035>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC2119]  Bradner, S., \"Key words for use in RFCs to Indicate\n           Requirement Levels\", BCP 14, RFC 2119,\n           DOI 10.17487/RFC2119, March 1997,\n           <https://www.rfc-editor.org/info/rfc2119>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC6763]  Cheshire, S. and M. Krochmal, \"DNS-Based Service\n           Discovery\", RFC 6763, DOI 10.17487/RFC6763, February 2013,\n           <https://www.rfc-editor.org/info/rfc6763>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC8126]  Cotton, M., Leiba, B., and T. Narten, \"Guidelines for\n           Writing an IANA Considerations Section in RFCs\", BCP 26,\n           RFC 8126, DOI 10.17487/RFC8126, June 2017,\n           <https://www.rfc-editor.org/info/rfc8126>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC8174]  Leiba, B., \"Ambiguity of Uppercase vs Lowercase in RFC\n           2119 Key Words\", BCP 14, RFC 8174, DOI 10.17487/RFC8174,\n           May 2017, <https://www.rfc-editor.org/info/rfc8174>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC8914]  Kumari, W., Hunt, E., Arends, R., Hardaker, W., and D.\n           Lawrence, \"Extended DNS Errors\", RFC 8914,\n           DOI 10.17487/RFC8914, October 2020,\n           <https://www.rfc-editor.org/info/rfc8914>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC9156]  Bortzmeyer, S., Dolmans, R., and P. Hoffman, \"DNS Query\n           Name Minimisation to Improve Privacy\", RFC 9156,\n           DOI 10.17487/RFC9156, November 2021,\n           <https://www.rfc-editor.org/info/rfc9156>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC9462]  Pauly, T., Kinnear, E., Wood, C. A., McManus, P., and T.\n           Jensen, \"Discovery of Designated Resolvers\", RFC 9462,\n           DOI 10.17487/RFC9462, November 2023,\n           <https://www.rfc-editor.org/info/rfc9462>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC9463]  Boucadair, M., Ed., Reddy.K, T., Ed., Wing, D., Cook, N.,\n           and T. Jensen, \"DHCP and Router Advertisement Options for\n           the Discovery of Network-designated Resolvers (DNR)\",\n           RFC 9463, DOI 10.17487/RFC9463, November 2023,\n           <https://www.rfc-editor.org/info/rfc9463>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "ja": "9.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[IANA-DNS] IANA, \"Domain Name System (DNS) Parameters\",\n           <https://www.iana.org/assignments/dns-parameters/>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RESINFO]  Sood, P. and P. Hoffman, \"DNS Resolver Information Self-\n           publication\", Work in Progress, Internet-Draft, draft-pp-\n           add-resinfo-02, 27 June 2020,\n           <https://datatracker.ietf.org/doc/html/draft-pp-add-\n           resinfo-02>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC7070]  Borenstein, N. and M. Kucherawy, \"An Architecture for\n           Reputation Reporting\", RFC 7070, DOI 10.17487/RFC7070,\n           November 2013, <https://www.rfc-editor.org/info/rfc7070>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC7858]  Hu, Z., Zhu, L., Heidemann, J., Mankin, A., Wessels, D.,\n           and P. Hoffman, \"Specification for DNS over Transport\n           Layer Security (TLS)\", RFC 7858, DOI 10.17487/RFC7858, May\n           2016, <https://www.rfc-editor.org/info/rfc7858>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC8484]  Hoffman, P. and P. McManus, \"DNS Queries over HTTPS\n           (DoH)\", RFC 8484, DOI 10.17487/RFC8484, October 2018,\n           <https://www.rfc-editor.org/info/rfc8484>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC9250]  Huitema, C., Dickinson, S., and A. Mankin, \"DNS over\n           Dedicated QUIC Connections\", RFC 9250,\n           DOI 10.17487/RFC9250, May 2022,\n           <https://www.rfc-editor.org/info/rfc9250>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC9499]  Hoffman, P. and K. Fujiwara, \"DNS Terminology\", BCP 219,\n           RFC 9499, DOI 10.17487/RFC9499, March 2024,\n           <https://www.rfc-editor.org/info/rfc9499>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RRTYPE]   IANA, \"Resource Record (RR) TYPEs\",\n           <https://www.iana.org/assignments/dns-parameters/>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Acknowledgments",
      "section_title": true,
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "This specification leverages the work that has been documented in [RESINFO].",
      "ja": "この仕様では、[Resinfo]で文書化された作業を活用します。"
    },
    {
      "indent": 3,
      "text": "Thanks to Tommy Jensen, Vittorio Bertola, Vinny Parla, Chris Box, Ben Schwartz, Tony Finch, Daniel Kahn Gillmor, Eric Rescorla, Shashank Jain, Florian Obser, Richard Baldry, and Martin Thomson for the discussion and comments.",
      "ja": "トミー・ジェンセン、ヴィットリオ・ベルトラ、ヴィニー・パラ、クリス・ボックス、ベン・シュワルツ、トニー・フィンチ、ダニエル・カーン・ギルモール、エリック・レスカルラ、シャシャンク・ジャイン、フロリアン・オブザー、リチャード・バルドリー、マーティン・トムソンの議論とコメントに感謝します。"
    },
    {
      "indent": 3,
      "text": "Thanks to Mark Andrews, Joe Abley, Paul Wouters, and Tim Wicinski for the discussion on RR formatting rules.",
      "ja": "RRフォーマットルールに関する議論をしてくれたマークアンドリュース、ジョーアベイ、ポールウーターズ、ティムウィシンスキーに感謝します。"
    },
    {
      "indent": 3,
      "text": "Special thanks to Tommy Jensen for the careful and thoughtful Shepherd review.",
      "ja": "慎重で思慮深い羊飼いのレビューをしてくれたTommy Jensenに感謝します。"
    },
    {
      "indent": 3,
      "text": "Thanks to Johan Stenstam and Jim Reid for the dns-dir reviews, Ray Bellis for the RRTYPE allocation review, Arnt Gulbrandsen for the ART review, and Mallory Knodel for the gen-art review.",
      "ja": "DNS-DIRレビューのJohan StenstamとJim Reid、RRType Allocation ReviewのRay Bellis、Arnt Gulbrandsen for the Art Review、Gen-ArtレビューのMallory Knodelに感謝します。"
    },
    {
      "indent": 3,
      "text": "Thanks to Éric Vyncke for the AD review.",
      "ja": "広告レビューをしてくれたエリック・ヴィンケに感謝します。"
    },
    {
      "indent": 3,
      "text": "Thanks to Gunter Van de Velde, Erik Kline, Paul Wouters, Orie Steele, Warren Kumari, Roman Danyliw, and Murray Kucherawy for the IESG review.",
      "ja": "IESGレビューをしてくれたGunter Van De Velde、Erik Kline、Paul Wouters、Orie Steele、Warren Kumari、Roman Danyliw、Murray Kucherawyに感謝します。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "section_title": true,
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Tirumaleswar Reddy.K\nNokia\nIndia\nEmail: kondtir@gmail.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Mohamed Boucadair\nOrange\n35000 Rennes\nFrance\nEmail: mohamed.boucadair@orange.com",
      "raw": true,
      "ja": ""
    }
  ]
}