{
  "title": {
    "text": "RFC 9274 - A Cost Mode Registry for the Application-Layer Traffic Optimization (ALTO) Protocol",
    "ja": "RFC 9274 - アプリケーション層トラフィック最適化（ALTO）プロトコルのコストモードレジストリ"
  },
  "number": 9274,
  "created_at": "2022-08-05 02:47:12.306515+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                      M. Boucadair\nRequest for Comments: 9274                                        Orange\nUpdates: 7285                                                      Q. Wu\nCategory: Standards Track                                         Huawei\nISSN: 2070-1721                                                July 2022",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 2,
      "text": "A Cost Mode Registry for the Application-Layer Traffic Optimization (ALTO) Protocol",
      "ja": "アプリケーション層トラフィック最適化（ALTO）プロトコルのコストモードレジストリ"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document creates a new IANA registry for tracking cost modes supported by the Application-Layer Traffic Optimization (ALTO) Protocol. Also, this document relaxes a constraint that was imposed by the ALTO specification on allowed cost mode values.",
      "ja": "このドキュメントでは、アプリケーション層トラフィックオプティメーション（ALTO）プロトコルでサポートされているコストモードを追跡するための新しいIANAレジストリを作成します。また、このドキュメントは、許可されたコストモード値に関するALTOの仕様によって課された制約を緩和します。"
    },
    {
      "indent": 3,
      "text": "This document updates RFC 7285.",
      "ja": "このドキュメントは、RFC 7285を更新します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準トラックドキュメントです。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 7841.",
      "ja": "このドキュメントは、インターネットエンジニアリングタスクフォース（IETF）の製品です。IETFコミュニティのコンセンサスを表しています。公開レビューを受けており、インターネットエンジニアリングステアリンググループ（IESG）からの出版が承認されています。インターネット標準の詳細については、RFC 7841のセクション2で入手できます。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at https://www.rfc-editor.org/info/rfc9274.",
      "ja": "このドキュメントの現在のステータス、任意のERRATA、およびそのフィードバックを提供する方法に関する情報は、https：//www.rfc-editor.org/info/rfc9274で取得できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2022 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（c）2022 IETF Trustおよび文書著者として特定された人。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (https://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Revised BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Revised BSD License.",
      "ja": "このドキュメントは、BCP 78およびIETFドキュメント（https://trustee.ietf.org/license-info）に関連するIETF Trustの法的規定の対象となります。この文書に関するあなたの権利と制限を説明するので、これらの文書を注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、セクション4.Eで説明されている法的規定のセクション4.Eで説明されており、修正されたBSDライセンスで説明されているように保証なしで提供される修正されたBSDライセンステキストを含める必要があります。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction\n2.  Terminology\n3.  Updates to RFC 7285\n  3.1.  Updates to Section 6.1.2 of RFC 7285\n  3.2.  Updates to Section 10.5 of RFC 7285\n4.  Backward Compatibility Considerations\n5.  IANA Considerations\n6.  Security Considerations\n7.  References\n  7.1.  Normative References\n  7.2.  Informative References\nAcknowledgements\nAuthors' Addresses",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The cost mode attribute indicates how costs should be interpreted when communicated as described in \"Application-Layer Traffic Optimization (ALTO) Protocol\" [RFC7285], which includes a provision for only two modes:",
      "ja": "コストモード属性は、「アプリケーションレイヤートラフィック最適化（ALTO）プロトコル」[RFC7285]で説明されているように、通信する場合にコストを解釈する方法を示します。"
    },
    {
      "indent": 3,
      "text": "\"numerical\": Indicates that numerical operations can be performed (e.g., normalization) on the returned costs (Section 6.1.2.1 of [RFC7285]).",
      "ja": "「数値」：返されたコスト（[RFC7285]のセクション6.1.2.1）で数値操作（例：正規化）を実行できることを示します。"
    },
    {
      "indent": 3,
      "text": "\"ordinal\": Indicates that the cost values in a cost map represent ranking (relative to all other values in a cost map), not actual costs (Section 6.1.2.2 of [RFC7285]).",
      "ja": "「序数」：コストマップのコスト値が、実際のコスト（[RFC7285]のセクション6.1.2.2）ではなく、ランキング（コストマップ内の他のすべての値と比較して）を表していることを示します。"
    },
    {
      "indent": 3,
      "text": "Additional cost modes are required for specific ALTO deployment cases (e.g., [ALTO-PV]). In order to allow for such use cases, this document relaxes the constraint imposed by the base ALTO specification on allowed cost modes (Section 3) and creates a new ALTO registry to track new cost modes (Section 5).",
      "ja": "特定のALTO展開ケース（[Alto-PV]など）には、追加のコストモードが必要です。このようなユースケースを許可するために、このドキュメントは、許可されたコストモード（セクション3）の基本ALTO仕様によって課される制約を緩和し、新しいALTOレジストリを作成して新しいコストモードを追跡します（セクション5）。"
    },
    {
      "indent": 3,
      "text": "The mechanisms defined in [RFC7285] are used to advertise the support of new cost modes for specific cost metrics. Refer to Section 4 for more details.",
      "ja": "[RFC7285]で定義されているメカニズムは、特定のコストメトリックの新しいコストモードのサポートを宣伝するために使用されます。詳細については、セクション4を参照してください。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "ja": "2. 用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14 [RFC2119] [RFC8174] when, and only when, they appear in all capitals, as shown here.",
      "ja": "この文書のキーワード \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", および \"OPTIONAL\" はBCP 14 [RFC2119] [RFC8174]で説明されているように、すべて大文字の場合にのみ解釈されます。"
    },
    {
      "indent": 3,
      "text": "This document makes use of the terms defined in [RFC7285].",
      "ja": "このドキュメントでは、[RFC7285]で定義されている用語を使用しています。"
    },
    {
      "indent": 0,
      "text": "3. Updates to RFC 7285",
      "section_title": true,
      "ja": "3. RFC 7285の更新"
    },
    {
      "indent": 0,
      "text": "3.1. Updates to Section 6.1.2 of RFC 7285",
      "section_title": true,
      "ja": "3.1. RFC 7285のセクション6.1.2の更新"
    },
    {
      "indent": 3,
      "text": "This document updates Section 6.1.2 of [RFC7285] as follows:",
      "ja": "このドキュメントは、[RFC7285]のセクション6.1.2を次のように更新します。"
    },
    {
      "indent": 3,
      "text": "OLD:",
      "ja": "年："
    },
    {
      "indent": 6,
      "text": "The cost mode attribute indicates how costs should be interpreted. Specifically, the cost mode attribute indicates whether returned costs should be interpreted as numerical values or ordinal rankings.",
      "ja": "コストモード属性は、コストの解釈方法を示します。具体的には、コストモード属性は、返品コストを数値値または序数のランキングとして解釈する必要があるかどうかを示します。"
    },
    {
      "indent": 6,
      "text": "It is important to communicate such information to ALTO clients, as certain operations may not be valid on certain costs returned by an ALTO server. For example, it is possible for an ALTO server to return a set of IP addresses with costs indicating a ranking of the IP addresses. Arithmetic operations that would make sense for numerical values, do not make sense for ordinal rankings. ALTO clients may handle such costs differently.",
      "ja": "ALTOサーバーによって返される特定のコストで特定の操作が有効でない場合があるため、そのような情報をALTOクライアントに伝えることが重要です。たとえば、ALTOサーバーは、IPアドレスのランキングを示すコストで一連のIPアドレスを返すことができます。数値の値を意味する算術操作は、序数のランキングについては意味がありません。ALTOのクライアントは、そのようなコストを異なる方法で処理する場合があります。"
    },
    {
      "indent": 6,
      "text": "Cost modes are indicated in protocol messages as strings.",
      "ja": "コストモードは、プロトコルメッセージに文字列として示されています。"
    },
    {
      "indent": 3,
      "text": "NEW:",
      "ja": "新着："
    },
    {
      "indent": 6,
      "text": "The cost mode attribute indicates how costs should be interpreted. Two cost modes (numerical values and ordinal rankings) are defined, but additional cost modes can be defined in the future.",
      "ja": "コストモード属性は、コストの解釈方法を示します。2つのコストモード（数値値と順序ランキング）が定義されていますが、追加のコストモードは将来定義できます。"
    },
    {
      "indent": 6,
      "text": "It is important to communicate such information to ALTO clients, as certain operations may not be valid on certain costs returned by an ALTO server. For example, it is possible for an ALTO server to return a set of IP addresses with costs indicating a ranking of the IP addresses. Arithmetic operations that would make sense for numerical values, do not make sense for ordinal rankings. ALTO clients may handle such costs differently.",
      "ja": "ALTOサーバーによって返される特定のコストで特定の操作が有効でない場合があるため、そのような情報をALTOクライアントに伝えることが重要です。たとえば、ALTOサーバーは、IPアドレスのランキングを示すコストで一連のIPアドレスを返すことができます。数値の値を意味する算術操作は、序数のランキングについては意味がありません。ALTOのクライアントは、そのようなコストを異なる方法で処理する場合があります。"
    },
    {
      "indent": 6,
      "text": "Cost modes are indicated in protocol messages as strings.",
      "ja": "コストモードは、プロトコルメッセージに文字列として示されています。"
    },
    {
      "indent": 6,
      "text": "For any future documents that defines a new cost mode, indicating whether that new cost mode applies to all or a subset of cost metrics is strongly recommended. This recommendation is meant to prevent nondeterministic behaviors that may result in presenting a cost mode with a specific metric, while such an association does not make sense or can't be unambiguously interpreted by ALTO implementations.",
      "ja": "新しいコストモードがすべてまたはコストメトリックのサブセットに適用されるかどうかを示す新しいコストモードを定義する将来のドキュメントの場合、強く推奨されます。この推奨事項は、特定のメトリックでコストモードを提示する可能性のある非決定的行動を防ぐことを目的としていますが、そのような関連性はALTOの実装では意味がない、または明確に解釈することはできません。"
    },
    {
      "indent": 6,
      "text": "If the definition of a cost mode does not indicate whether that cost mode applies to a subset of cost metrics, ALTO implementations MUST be prepared to accept that cost mode for any cost metric.",
      "ja": "コストモードの定義が、そのコストモードがコストメトリックのサブセットに適用されるかどうかを示していない場合、ALTOの実装は、コストメトリックのコストモードを受け入れるために準備する必要があります。"
    },
    {
      "indent": 0,
      "text": "3.2. Updates to Section 10.5 of RFC 7285",
      "section_title": true,
      "ja": "3.2. RFC 7285のセクション10.5の更新"
    },
    {
      "indent": 3,
      "text": "This document updates Section 10.5 of [RFC7285] as follows:",
      "ja": "このドキュメントは、[RFC7285]のセクション10.5を次のように更新します。"
    },
    {
      "indent": 3,
      "text": "OLD:",
      "ja": "年："
    },
    {
      "indent": 6,
      "text": "A cost mode is encoded as a string. The string MUST have a value of either \"numerical\" or \"ordinal\".",
      "ja": "コストモードは文字列としてエンコードされます。文字列には、「数値」または「序数」の値が必要です。"
    },
    {
      "indent": 3,
      "text": "NEW:",
      "ja": "新着："
    },
    {
      "indent": 6,
      "text": "A cost mode is encoded as a string. The string MUST be no more than 32 characters, and it MUST NOT contain characters other than US-ASCII alphanumeric characters (U+0030-U+0039, U+0041-U+005A, and U+0061-U+007A), the hyphen-minus ('-', U+002D), the colon (':', U+003A), or the low line ('_', U+005F). Cost modes reserved for Private Use are prefixed with \"priv:\" (Section 5). Otherwise, the cost mode MUST have a value that is listed in the registry created in Section 5 of [RFC9274].",
      "ja": "コストモードは文字列としてエンコードされます。文字列は32文字以下である必要があり、US-ASCII英数字（U 0030-U 0039、U 0041-U 005A、およびU 0061-U 007A）以外の文字を含めてはなりません。 -  '、u 002d）、コロン（'： '、u 003a）、または低線（' _ '、u 005f）。プライベート使用のために予約されているコストモードには、「PRIV：」（セクション5）が付いています。それ以外の場合、コストモードには、[RFC9274]のセクション5に作成されたレジストリにリストされている値が必要です。"
    },
    {
      "indent": 0,
      "text": "4. Backward Compatibility Considerations",
      "section_title": true,
      "ja": "4. 後方互換性の考慮事項"
    },
    {
      "indent": 3,
      "text": "ALTO servers that support new cost modes for specific cost metrics will use the mechanism specified in Section 9.2 of [RFC7285] to advertise their capabilities. ALTO clients (including legacy) will use that information to specify cost constraints in their requests (e.g., indicate a cost metric and a cost mode). An example of such a behavior is depicted in Section 9.2.3 of [RFC7285].",
      "ja": "特定のコストメトリックの新しいコストモードをサポートするALTOサーバーは、[RFC7285]のセクション9.2で指定されたメカニズムを使用して機能を宣伝します。ALTOのクライアント（レガシーを含む）は、その情報を使用して、リクエストのコスト制約を指定します（たとえば、コストメトリックとコストモードを示します）。このような行動の例は、[RFC7285]のセクション9.2.3に示されています。"
    },
    {
      "indent": 3,
      "text": "If an ALTO client includes a cost mode that is not supported by an ALTO server, the server indicates such an error with the error code E_INVALID_FIELD_VALUE as per Section 8.5.2 of [RFC7285]. In practice, legacy ALTO servers will reply with the error code E_INVALID_FIELD_VALUE to requests that include a cost type other than \"numerical\" or \"ordinal\" for the \"routingcost\" cost metric.",
      "ja": "ALTOクライアントにALTOサーバーによってサポートされていないコストモードが含まれている場合、サーバーは[RFC7285]のセクション8.5.2に従って、エラーコードE_INVALID_FIELD_VALUEでそのようなエラーを示します。実際には、Legacy Alto Serversは、エラーコードE_INVALID_FIELD_VALUEを使用して、「routingCost」コストメトリックの「数値」または「序数」以外のコストタイプを含むリクエストに返信します。"
    },
    {
      "indent": 3,
      "text": "The encoding constraints in Section 3.2 do not introduce any interoperability issue given that currently implemented cost modes adhere to these constrains (mainly, those in [RFC7285] and [ALTO-PV]).",
      "ja": "セクション3.2のエンコーディング制約は、現在実装されているコストモードがこれらの制約（主に[RFC7285]および[ALTO-PV]の制約）を順守することを考えると、相互運用性の問題を導入しません。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "ja": "5. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has created the new \"ALTO Cost Modes\" subregistry within the \"Application-Layer Traffic Optimization (ALTO) Protocol\" registry available at [ALTO].",
      "ja": "IANAは、[ALTO]で利用可能な「アプリケーションレイヤートラフィック最適化（ALTO）プロトコル」レジストリ内で、新しい「ALTOコストモード」サブレジストリを作成しました。"
    },
    {
      "indent": 3,
      "text": "The assignment policy for this subregistry is \"IETF Review\" (Section 4.8 of [RFC8126]).",
      "ja": "このサブレジストリの割り当てポリシーは「IETFレビュー」です（[RFC8126]のセクション4.8）。"
    },
    {
      "indent": 3,
      "text": "Requests to register a new ALTO cost mode must include the following information:",
      "ja": "新しいALTOコストモードを登録するリクエストには、次の情報を含める必要があります。"
    },
    {
      "indent": 3,
      "text": "Identifier: The name of the ALTO cost mode. Refer to Section 3.2 for more details on allowed encoding.",
      "ja": "識別子：ALTOコストモードの名前。許可エンコードの詳細については、セクション3.2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Description: A short description of the requested ALTO cost mode.",
      "ja": "説明：要求されたALTOコストモードの簡単な説明。"
    },
    {
      "indent": 3,
      "text": "Intended Semantics: A reference to where the semantic of the requested cost mode is defined.",
      "ja": "意図されたセマンティクス：要求されたコストモードのセマンティックが定義されている場所への参照。"
    },
    {
      "indent": 3,
      "text": "Reference: A reference to the document that registers the requested cost mode.",
      "ja": "参照：要求されたコストモードを登録するドキュメントへの参照。"
    },
    {
      "indent": 3,
      "text": "Cost modes prefixed with \"priv:\" are reserved for Private Use (Section 4.1 of [RFC8126]). IANA has added the following note to the new subregistry:",
      "ja": "「priv：」が付いたコストモードは、私的使用のために予約されています（[RFC8126]のセクション4.1）。IANAは次のメモを新しいサブレジストリに追加しました。"
    },
    {
      "indent": 18,
      "text": "Identifiers prefixed with \"priv:\" are reserved for Private Use (see RFC 9274, Section 5).",
      "ja": "「priv：」が付いた識別子は、私的使用のために予約されています（RFC 9274、セクション5を参照）。"
    },
    {
      "indent": 3,
      "text": "The subregistry is initially populated with the following values:",
      "ja": "サブレジストリには当初、次の値が入力されています。"
    },
    {
      "indent": 3,
      "text": "+============+=============================+============+===========+\n| Identifier | Description                 | Intended   | Reference |\n|            |                             | Semantics  |           |\n+============+=============================+============+===========+\n| numerical  | Indicates that numerical    | Section    | RFC 9274  |\n|            | operations can be performed | 6.1.2.1    |           |\n|            | on the returned costs       | of         |           |\n|            |                             | [RFC7285]  |           |\n+------------+-----------------------------+------------+-----------+\n| ordinal    | Indicates that the cost     | Section    | RFC 9274  |\n|            | values in a cost map        | 6.1.2.2    |           |\n|            | represent ranking           | of         |           |\n|            |                             | [RFC7285]  |           |\n+------------+-----------------------------+------------+-----------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 26,
      "text": "Table 1: ALTO Cost Modes",
      "ja": "表1：ALTOコストモード"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "This document does not introduce new concerns other than those already discussed in Section 15 of [RFC7285].",
      "ja": "この文書は、[RFC7285]のセクション15ですでに説明したもの以外の新しい懸念を導入していません。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7. 参考文献"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "ja": "7.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <https://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119] Bradner、S。、「要件レベルを示すためにRFCで使用するためのキーワード」、BCP 14、RFC 2119、DOI 10.17487/RFC2119、1997年3月、<https://www.rfc-editor.org/info/RFC2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC7285] Alimi, R., Ed., Penno, R., Ed., Yang, Y., Ed., Kiesel, S., Previdi, S., Roome, W., Shalunov, S., and R. Woundy, \"Application-Layer Traffic Optimization (ALTO) Protocol\", RFC 7285, DOI 10.17487/RFC7285, September 2014, <https://www.rfc-editor.org/info/rfc7285>.",
      "ja": "[RFC7285] Alimi、R.、Ed。、Penno、R.、Ed。、Yang、Y.、ed。、Kiesel、S.、Previdi、S.、Roome、W.、Shalunov、S.、およびR.傷、「アプリケーションレイヤートラフィック最適化（ALTO）プロトコル」、RFC 7285、DOI 10.17487/RFC7285、2014年9月、<https://www.rfc-editor.org/info/rfc7285>。"
    },
    {
      "indent": 3,
      "text": "[RFC8126] Cotton, M., Leiba, B., and T. Narten, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 8126, DOI 10.17487/RFC8126, June 2017, <https://www.rfc-editor.org/info/rfc8126>.",
      "ja": "[RFC8126] Cotton、M.、Leiba、B。、およびT. Narten、「RFCSでIANA考慮事項セクションを書くためのガイドライン」、BCP 26、RFC 8126、DOI 10.17487/RFC8126、2017年6月、<https：// wwwwwwwwwwwwwwwwwwww.rfc-editor.org/info/rfc8126>。"
    },
    {
      "indent": 3,
      "text": "[RFC8174] Leiba, B., \"Ambiguity of Uppercase vs Lowercase in RFC 2119 Key Words\", BCP 14, RFC 8174, DOI 10.17487/RFC8174, May 2017, <https://www.rfc-editor.org/info/rfc8174>.",
      "ja": "[RFC8174] Leiba、B。、「RFC 2119キーワードの大文字と小文字のあいまいさ」、BCP 14、RFC 8174、DOI 10.17487/RFC8174、2017年5月、<https：//www.rfc-editor.org/info/RFC8174>。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "ja": "7.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[ALTO] IANA, \"Application-Layer Traffic Optimization (ALTO) Protocol\", <https://www.iana.org/assignments/alto-protocol/>.",
      "ja": "[Alto] Iana、「アプリケーションレイヤートラフィック最適化（ALTO）プロトコル」、<https://www.iana.org/assignments/alto-protocol/>。"
    },
    {
      "indent": 3,
      "text": "[ALTO-PV] Gao, K., Lee, Y., Randriamasy, S., Yang, Y. R., and J. J. Zhang, \"An ALTO Extension: Path Vector\", Work in Progress, Internet-Draft, draft-ietf-alto-path-vector-25, 20 March 2022, <https://datatracker.ietf.org/doc/html/draft-ietf-alto-path-vector-25>.",
      "ja": "[Alto-PV] Gao、K.、Lee、Y.、Randriamasy、S.、Yang、Y。R。、およびJ. J. Zhang、「Alto Extension：Path Vector」、Work in Progress、Internet-Draft、Draft-Iitf-Alto-path-vector-25、2022年3月20日、<https://datatracker.ietf.org/doc/html/draft-alto-path-vector-25>。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Many thanks to Benjamin Kaduk for spotting the issue during the review of [ALTO-PV].",
      "ja": "[ALTO-PV]のレビュー中に問題を見つけてくれたベンジャミン・カドゥクに感謝します。"
    },
    {
      "indent": 3,
      "text": "Thanks to Adrian Farrel, Dhruv Dhody, Luis Miguel Contreras Murillo, Sabine Randriamasy, and Qiao Xiang for the review and comments.",
      "ja": "エイドリアン・ファレル、ドゥルフ・ドディ、ルイス・ミゲル・コントレラス・ムリラ、サビン・ランドリア・アマシー、Qiao Xiangのレビューとコメントに感謝します。"
    },
    {
      "indent": 3,
      "text": "Special thanks to Kai Gao for Shepherding the document.",
      "ja": "文書を羊飼いしてくれたKai Gaoに感謝します。"
    },
    {
      "indent": 3,
      "text": "Thanks to Martin Duke for the AD review.",
      "ja": "広告レビューをしてくれたMartin Dukeに感謝します。"
    },
    {
      "indent": 3,
      "text": "Thanks to Roni Even for the gen-art review, Jaime Jimenez for the artart review, and Stephen Farrell for the secdir review.",
      "ja": "Gen-Artのレビュー、Artart ReviewのJaime Jimenez、Secdir ReviewのStephen FarrellでもRoniに感謝します。"
    },
    {
      "indent": 3,
      "text": "Thanks to Robert Wilton, Lars Eggert, Francesca Palombini, Roman Danyliw, Paul Wouters, and Murray Kucherawy for the IESG review.",
      "ja": "Robert Wilton、Lars Eggert、Francesca Palombini、Roman Danyliw、Paul Wouters、Murray Kucherawyに感謝します。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Mohamed Boucadair Orange 35000 Rennes France Email: mohamed.boucadair@orange.com",
      "ja": "Mohamed Boucadair Orange 35000 Rennes Franceメール：Mohamed.Boucadair@orange.com"
    },
    {
      "indent": 3,
      "text": "Qin Wu Huawei Yuhua District 101 Software Avenue Nanjing Jiangsu, 210012 China Email: bill.wu@huawei.com",
      "ja": "Qin Wu Huawei Yuhua District 101 Software Avenue Nanjing Jiangsu、210012 China Email：bill.wu@huawei.com"
    }
  ]
}