{
  "title": {
    "text": "RFC 9501 - Open Participation Principle regarding Remote Registration Fee",
    "ja": "RFC 9501 - リモート登録料に関するオープン参加原則"
  },
  "number": 9501,
  "created_at": "2023-12-16 23:47:35.822831+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                      M. Khlewind\nRequest for Comments: 9501                                      Ericsson\nBCP: 239                                                         J. Reed\nCategory: Best Current Practice                                  R. Salz\nISSN: 2070-1721                                      Akamai Technologies\n                                                           December 2023",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 5,
      "text": "Open Participation Principle regarding Remote Registration Fee",
      "ja": "リモート登録料に関するオープン参加原則"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document outlines a principle for open participation that extends the open process principle defined in RFC 3935 by stating that there must be a free option for online participation to IETF meetings and, if possible, related IETF-hosted events.",
      "ja": "このドキュメントは、IETFミーティングへのオンライン参加の無料オプションが必要であり、可能であれば関連するIETFホストイベントには無料のオプションが必要であると述べて、RFC 3935で定義されたオープンプロセスの原則を拡張するオープン参加の原則を概説しています。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This memo documents an Internet Best Current Practice.",
      "ja": "このメモは、インターネットの最高の現在の練習を文書化しています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on BCPs is available in Section 2 of RFC 7841.",
      "ja": "このドキュメントは、インターネットエンジニアリングタスクフォース（IETF）の製品です。IETFコミュニティのコンセンサスを表しています。公開レビューを受けており、インターネットエンジニアリングステアリンググループ（IESG）からの出版が承認されています。BCPSの詳細については、RFC 7841のセクション2で入手できます。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at https://www.rfc-editor.org/info/rfc9501.",
      "ja": "このドキュメントの現在のステータス、任意のERRATA、およびそのフィードバックを提供する方法に関する情報は、https：//www.rfc-editor.org/info/rfc9501で取得できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2023 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（c）2023 IETF Trustおよび文書著者として特定された人。無断転載を禁じます。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (https://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Revised BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Revised BSD License.",
      "ja": "このドキュメントは、BCP 78およびIETFドキュメント（https://trustee.ietf.org/license-info）に関連するIETF Trustの法的規定の対象となります。この文書に関するあなたの権利と制限を説明するので、これらの文書を注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、セクション4.Eで説明されている法的規定のセクション4.Eで説明されており、改訂されたBSDライセンスで説明されている保証なしで提供されるように、改訂されたBSDライセンステキストを含める必要があります。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction\n2.  Principle of Open Participation\n3.  Financial Impact\n4.  Considerations on Use and Misuse of a Free Participation Option\n5.  Security Considerations\n6.  IANA Considerations\n7.  References\n  7.1.  Normative References\n  7.2.  Informative References\nAcknowledgments\nAuthors' Addresses",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "Remote participation for IETF in-person meetings has evolved over time from email-only to live chat and audio streaming, and, from there, to a fully online meeting system that is tightly integrated with the in-room session and enables interactive audio and video participation. Remote participation has historically been free for remote attendees.",
      "ja": "IETFの対面会議へのリモート参加は、電子メールのみからライブチャットやオーディオストリーミングに時間の経過とともに進化し、そこから、室内セッションと密接に統合され、インタラクティブなオーディオとビデオを可能にする完全なオンライン会議システムに至るまで進化しました。参加。リモート参加は、歴史的にリモート参加者にとって無料でした。"
    },
    {
      "indent": 3,
      "text": "Given this more full-blown participation option, the IETF has started to see an increase in the number of remote participants. This increase can be explained by the ease with which new participants can join a meeting or only attend selected parts of the meeting agenda, and also by a decrease in the perceived need to attend every meeting in person. Financial considerations may also be a factor. In order to better understand these trends, the IETF started to require registration for remote participation, still without any registration fee applied.",
      "ja": "このより本格的な参加オプションを考えると、IETFはリモート参加者の数が増加し始めました。この増加は、新しい参加者が会議に参加したり、会議の議題の選択された部分のみに参加できるようにしたり、すべての会議に直接参加する必要性の減少を減らすことができることによって説明できます。経済的考慮事項も要因になる可能性があります。これらの傾向をよりよく理解するために、IETFは、まだ登録料が適用されていないリモート参加のために登録を要求し始めました。"
    },
    {
      "indent": 3,
      "text": "With the move to fully online meetings in 2020 and 2021, however, there was no distinction between remote and on-site participants for those meetings. Because IETF meeting costs and other costs still needed to be covered, a meeting fee was charged for remote participants, replacing the free participation that was previously available for all remote attendees.",
      "ja": "ただし、2020年と2021年に完全にオンラインの会議に移行したことで、これらの会議では、リモート参加者とオンサイトの参加者の間に区別はありませんでした。IETFの会議費用やその他の費用をカバーする必要があるため、遠隔参加者に会議料金が請求され、以前はすべてのリモート参加者が利用できる無料参加に取って代わりました。"
    },
    {
      "indent": 3,
      "text": "The introduction of a fee for remote participation raised concerns about the potential impact on both those who regularly attend IETF meetings remotely and those who are considering attending an IETF meeting for the first time. In both cases, even a small registration fee can be a barrier to participation.",
      "ja": "リモート参加の料金の導入は、IETF会議にリモートで定期的に出席する人々と、初めてIETF会議に参加することを検討している人々の両方に潜在的な影響について懸念をもたらしました。どちらの場合も、少額の登録料でさえ、参加に対する障壁になる可能性があります。"
    },
    {
      "indent": 0,
      "text": "2. Principle of Open Participation",
      "section_title": true,
      "ja": "2. オープン参加の原則"
    },
    {
      "indent": 3,
      "text": "This document outlines the principle of open participation that the IETF Administration LLC (IETF LLC) is expected to incorporate into decisions about the registration fee structure for remote participation.",
      "ja": "このドキュメントは、IETF Administration LLC（IETF LLC）がリモート参加のための登録料の構造に関する決定に組み込むことが期待されるというオープン参加の原則の概要を示しています。"
    },
    {
      "indent": 3,
      "text": "The principle is simple: there must be an option for free remote participation in any IETF meeting, regardless of whether the meeting has a physical presence. Related events collocated with an IETF meeting are part of the IETF's open process [RFC3935] and are encouraged to follow this principle as well, if they offer remote participation at all.",
      "ja": "原則は簡単です。IETFミーティングには、会議に物理的な存在感があるかどうかにかかわらず、IETF会議に無料でリモート参加するオプションが必要です。IETF会議と共同の関連イベントは、IETFのオープンプロセス[RFC3935]の一部であり、リモート参加を提供する場合は、この原則にも従うことが奨励されています。"
    },
    {
      "indent": 3,
      "text": "This principle aims to support the openness principle of the IETF as defined in [RFC3935]:",
      "ja": "この原則は、[RFC3935]で定義されているように、IETFのオープン性の原則をサポートすることを目的としています。"
    },
    {
      "indent": 18,
      "text": "Open process - any interested person can participate in the work, know what is being decided, and make his or her voice heard on the issue. Part of this principle is our commitment to making our documents, our WG mailing lists, our attendance lists, and our meeting minutes publicly available on the Internet.",
      "ja": "オープンプロセス - 関心のある人は仕事に参加し、何が決定されているかを知り、問題について彼または彼女の声を聞かせることができます。この原則の一部は、ドキュメント、WGメーリングリスト、出席リスト、およびインターネットで公開されている会議議事録を作成するという私たちのコミットメントです。"
    },
    {
      "indent": 3,
      "text": "While [RFC3935] explicitly notes that this principle requires our documents and materials to be open and accessible over the Internet, it was primarily written with email interactions in mind when talking about participation. This document extends this principle to explicitly cover remote participation at meetings. Particularly in this context, openness should be seen as open and free.",
      "ja": "[RFC3935]は、この原則にはドキュメントと資料がインターネットを介してオープンでアクセス可能であることが必要であることを明示的に指摘していますが、参加について話すときに、電子メールのやり取りを念頭に置いて書かれています。このドキュメントは、この原則を拡張して、会議でのリモート参加を明示的にカバーしています。特にこの文脈では、開放性はオープンで自由であると見なされるべきです。"
    },
    {
      "indent": 3,
      "text": "This document does not stipulate that all IETF meetings or related IETF events must have a remote participation option, because there could be technical or other reasons why that might not be possible. However, if remote participation is provided, there should always be a free option to make the process as open as possible. At a minimum, working group sessions, BoFs, and the administrative plenary are expected to provide a remote participation option.",
      "ja": "このドキュメントでは、すべてのIETF会議または関連するIETFイベントには、それが不可能な技術的またはその他の理由がある可能性があるため、リモート参加オプションが必要であると規定されていません。ただし、リモート参加が提供されている場合は、プロセスを可能な限りオープンにするための無料のオプションが常にある必要があります。少なくとも、ワーキンググループセッション、BOFS、および管理全体がリモート参加オプションを提供することが期待されています。"
    },
    {
      "indent": 3,
      "text": "Note that this document does not specify the implementation details of the free option and leaves this to the LLC. At the time of publication, an approach to request a fee waiver was implemented.",
      "ja": "このドキュメントでは、無料オプションの実装の詳細を指定せず、これをLLCに任せることに注意してください。出版時には、料金の免除を要求するアプローチが実施されました。"
    },
    {
      "indent": 3,
      "text": "Moreover, in order to fully remove barriers to participation, any free registration option must offer the same degree of interactivity and functionality available to paid remote participants. Specifically, it must not be possible to identify participants that used the free option. However, of course this does not mean that all services must be provided for free to participants using the free registration option, but only those services that are provided as part of the regular registration. Offering additional services to a subset or all participants at an additional charge is still possible, e.g., if special needs are required. However, to promote inclusivity, whether those services can also be offered without charge for those who are in need and cannot afford the fee should be considered.",
      "ja": "さらに、参加に対する障壁を完全に削除するには、無料の登録オプションは、有料のリモート参加者が利用できる同じ程度のインタラクティブ性と機能を提供する必要があります。具体的には、無料オプションを使用した参加者を識別することは不可能です。ただし、もちろん、これはすべてのサービスを無料登録オプションを使用して参加者に無料で提供する必要があることを意味しませんが、通常の登録の一部として提供されるサービスのみを意味します。追加料金でサブセットまたはすべての参加者に追加サービスを提供することは、特別なニーズが必要な場合でも可能です。ただし、包括性を促進するために、これらのサービスを困needしていて、料金を支払うことができない人に料金なしで提供できるかどうかを考慮する必要があります。"
    },
    {
      "indent": 3,
      "text": "The free option must be clearly and prominently listed on the meeting website and registration page. If the free option requires additional registration steps, such as applying for a fee waiver, those requirements should be clearly documented. In particular, to avoid any potential negative implications on inclusivity, any personal information that is collected with respect to the use of the free remote participation option must be kept confidential.",
      "ja": "無料のオプションは、会議Webサイトと登録ページに明確かつ顕著にリストされている必要があります。無料オプションに追加の登録手順が必要な場合、料金免除の申請など、それらの要件を明確に文書化する必要があります。特に、包括性に対する潜在的な否定的な影響を回避するために、無料のリモート参加オプションの使用に関して収集された個人情報は、機密に保つ必要があります。"
    },
    {
      "indent": 0,
      "text": "3. Financial Impact",
      "section_title": true,
      "ja": "3. 経済的影響"
    },
    {
      "indent": 3,
      "text": "Fully online meetings as well as remote participation incur expenses, as do other services that the IETF provides. This includes items such as mailing lists, document access via the datatracker or other online platforms, as well as support for videoconferencing (e.g., Meetecho). Meeting fees are a way to distribute these and other operating costs of the IETF among participants, even though they do not fully offset the costs of either holding the meeting or operating the IETF. As such, the intention of this document and the principle stated herein is not to make remote participation free for everyone, but to always offer a free remote option that enables remote participation without any barriers other than the application for free registration when the registration fee is a barrier to participation. This principle applies to remote participation only, thereby providing one free option for participation. In-person participation is not in scope for this document as the cost considerations are broader than just the registration fee.",
      "ja": "IETFが提供する他のサービスと同様に、完全にオンラインの会議とリモート参加が費用がかかります。これには、メーリングリスト、DataTrackerまたはその他のオンラインプラットフォームを介したドキュメントアクセスなどのアイテム、およびビデオ会議のサポート（MeeteChoなど）が含まれます。会議料金は、会議を開催したり、IETFを運営したりするコストを完全に相殺していなくても、参加者間でIETFのこれらおよびその他の運用コストを配布する方法です。そのため、このドキュメントの意図とここに記載されている原則は、すべての人にリモート参加を無料にすることではなく、登録料があるときに無料登録の障壁以外の障壁なしでリモート参加を可能にする無料のリモートオプションを常に提供することです。参加に対する障壁。この原則は、リモート参加のみに適用されるため、参加のための無料オプションが1つ提供されます。対面の参加は、コストの考慮事項が登録料だけよりも広いため、このドキュメントの範囲にありません。"
    },
    {
      "indent": 3,
      "text": "Changes to the IETF's fee structure or overall funding model are not in scope for this document. As defined in [RFC8711], it is the IETF LLC's responsibility to manage the IETF's finances and budget and as such \"[t]he IETF LLC is expected to act responsibly so as to minimize risks to IETF participants and to the future of the IETF as a whole, such as financial risks.\" Further, it is the responsibility of the IETF LLC Board \"to act consistently with the documented consensus of the IETF community\" [RFC8711], taking into account agreed principles like the one described in this document.",
      "ja": "IETFの料金構造または全体的な資金調達モデルの変更は、このドキュメントの範囲ではありません。[RFC8711]で定義されているように、IETFの財務と予算を管理するIETF LLCの責任であり、そのため、IETF LLCはIETF参加者とIETFの将来へのリスクを最小限に抑えるために責任を持って行動することが期待されています。全体として、金融リスクなど。」さらに、IETF LLC委員会の責任は、「IETFコミュニティの文書化されたコンセンサスと一貫して行動する」[RFC8711]であり、この文書に記載されているような合意された原則を考慮しています。"
    },
    {
      "indent": 3,
      "text": "If unlimited free remote participation is determined to adversely affect financial sustainability of the IETF, e.g., if the number of paying participants or the cost of free participation emerges as a significant factor, the LLC is expected to implement additional measures to manage these costs. This document does not and cannot restrict the LLC in its financial responsibility and therefore does not impose any limitation on the use of appropriate measures. If the LLC decides to implement additional measures, they should share their decision and rationale with the community and consider whether community consultation as specified in Section 4.4 of [RFC8711] is needed \"to obtain consensus-based community input on key issues\". Further, they should describe the implemented process in sufficient detail for participants to make an informed decision about use of the free option.",
      "ja": "無制限の無料リモート参加がIETFの財政的持続可能性に悪影響を与えると判断された場合、たとえば有料参加者の数または無料参加のコストが重要な要因として浮上した場合、LLCはこれらのコストを管理するための追加の措置を実施することが期待されます。この文書は、LLCを財政的責任に制限しておらず、したがって、適切な措置の使用に制限を課しません。LLCが追加の措置を実施することを決定した場合、彼らは意思決定と理論的根拠をコミュニティと共有し、[RFC8711]のセクション4.4で指定されているコミュニティ相談が「重要な問題に関するコンセンサスベースのコミュニティ入力を得るために必要であるかどうかを検討する必要があります。さらに、参加者が無料オプションの使用について情報に基づいた決定を下すために、実装されたプロセスを十分に詳細に説明する必要があります。"
    },
    {
      "indent": 3,
      "text": "As discussed in the next section, assessment of eligibility is difficult. Consequently, any limit on the number of available free registrations, which likely requires an assessment of eligibility, can cause unfairness and negatively impact openness, which should be considered seriously in any LLC decision. As such, this document defines the principle of free participation but leaves implementation details to the LLC. Specifically, it does not provide guidance on appropriate measures against misuse, as any measures need to be adapted to the specific problem in a specific situation in order to minimize both the financial risk and its impact on openness and inclusivity.",
      "ja": "次のセクションで説明したように、適格性の評価は困難です。その結果、適格性の評価が必要な可能性が高い利用可能な無料登録の数の制限は不公平を引き起こし、LLCの決定で真剣に検討する必要があります。そのため、このドキュメントは無料参加の原則を定義しますが、実装の詳細をLLCに残します。具体的には、金融リスクと開放性と包括性への影響の両方を最小限に抑えるために、特定の状況で特定の問題に適応する必要があるため、誤用に対する適切な措置に関するガイダンスを提供しません。"
    },
    {
      "indent": 0,
      "text": "4. Considerations on Use and Misuse of a Free Participation Option",
      "section_title": true,
      "ja": "4. 無料参加オプションの使用と誤用に関する考慮事項"
    },
    {
      "indent": 3,
      "text": "This document does not provide specific requirements on when it is appropriate for an IETF community member to use or not use the free option to remotely attend a meeting. The purpose of the free option is to enable everybody who is interested in participation to join meetings without the meeting fee imposing a financial barrier. These cases cannot be limited to a certain group, like students or \"self-funded\" participants, nor to any other specific restrictions like the number of meetings previously attended or previous level of involvement. The purpose is simply to maximize participation without barriers in order to make the standards process as open as possible.",
      "ja": "このドキュメントでは、IETFコミュニティメンバーが無料オプションを使用するか使用して会議にリモートに参加することが適切である場合に特定の要件を提供しません。無料のオプションの目的は、参加に関心のあるすべての人が、財政的障壁を課す会議料金なしで会議に参加できるようにすることです。これらのケースは、学生や「自己資金提供された」参加者などの特定のグループや、以前に出席した会議の数や以前の関与レベルなどの他の特定の制限に限定することはできません。目的は、標準プロセスを可能な限りオープンにするために、単に障壁なしで参加を最大化することです。"
    },
    {
      "indent": 3,
      "text": "It is expected that participants who have financial support to use the paid regular registration option will do so. Paying a registration fee is a way for their sponsor to support the sustainability of the IETF. For example, a higher late payment charge can be used to maximize this financial support. However, this document does not comment on the actual payment structure of the IETF meeting fee other than requiring a free remote option. The fee payment structure is set by the IETF LLC such that the viability of the IETF and the ability of IETF participants to work productively within the IETF can be ensured.",
      "ja": "有料の通常の登録オプションを使用するための財政的支援を受けた参加者がそうすることが期待されます。登録料を支払うことは、スポンサーがIETFの持続可能性をサポートする方法です。たとえば、この財政的支援を最大化するために、より高い遅い支払い料金を使用できます。ただし、このドキュメントでは、無料のリモートオプションを必要とする以外のIETF会議料金の実際の支払い構造についてはコメントしていません。料金の支払い構造は、IETF LLCによって設定され、IETFの実行可能性とIETF参加者がIETF内で生産的に作業する能力を確保することができます。"
    },
    {
      "indent": 3,
      "text": "The LLC is responsible for ensuring the financial stability of the IETF; therefore, they should monitor trends in the use of the free participation option that could endanger the viability of the IETF and, if necessary, manage the associated costs. Aggregated data on the number and percentage of free registrations used should be published, as this will permit analysis of the use and change in use over time of the free registration option without revealing personal information.",
      "ja": "LLCは、IETFの財政的安定性を確保する責任があります。したがって、IETFの実行可能性を危険にさらす可能性のある無料参加オプションの使用の傾向を監視し、必要に応じて関連するコストを管理する必要があります。使用される無料登録の数と割合に関する集約されたデータを公開する必要があります。これにより、個人情報を公開することなく、無料登録オプションの時間の経過に伴う使用と使用の変更が可能になるためです。"
    },
    {
      "indent": 3,
      "text": "As the principle defined in this document aims to promote openness and thereby enhance participation, an increase in use of free registrations is a success, because it is likely a sign of increased interest and not necessarily a sign of misuse. The increase should not be linked to the number of paid registrations. In particular, the number of paid registrations may decrease for various reasons other than misuse, such as restrictions on travel to physical meetings due to cost savings or environmental reasons, general cost savings and lesser focus on standardization work, or simply loss of business interest. Such trends can impact the sustainability of the IETF due to its dependency on meeting fees to cross-finance other costs, independent of use of the free registrations.",
      "ja": "このドキュメントで定義されている原則は、開放性を促進し、それによって参加を強化することを目的としているため、無料登録の使用の増加は成功です。増加は、有料登録の数にリンクするべきではありません。特に、コスト削減や環境上の理由、一般的なコスト削減、標準化作業への焦点の少ない、または単にビジネス上の利益の損失など、物理的な会議への旅行の制限など、誤用以外のさまざまな理由で有料登録の数が減少する場合があります。このような傾向は、無料の登録の使用とは無関係に、他のコストを越えて他の費用を交差する費用に依存するため、IETFの持続可能性に影響を与える可能性があります。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "This document introduces no new concerns for the security of Internet protocols.",
      "ja": "このドキュメントでは、インターネットプロトコルのセキュリティに関する新しい懸念を紹介しません。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document has no IANA actions.",
      "ja": "このドキュメントにはIANAアクションがありません。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7. 参考文献"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "ja": "7.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC3935] Alvestrand, H., \"A Mission Statement for the IETF\", BCP 95, RFC 3935, DOI 10.17487/RFC3935, October 2004, <https://www.rfc-editor.org/info/rfc3935>.",
      "ja": "[RFC3935] Alvestrand、H。、「IETFのミッションステートメント」、BCP 95、RFC 3935、DOI 10.17487/RFC3935、2004年10月、<https://www.rfc-editor.org/info/rfc3935>"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "ja": "7.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[RFC8711] Haberman, B., Hall, J., and J. Livingood, \"Structure of the IETF Administrative Support Activity, Version 2.0\", BCP 101, RFC 8711, DOI 10.17487/RFC8711, February 2020, <https://www.rfc-editor.org/info/rfc8711>.",
      "ja": "[RFC8711] Haberman、B.、Hall、J。、およびJ. Livingood、「IETF管理サポートアクティビティの構造、バージョン2.0、BCP 101、RFC 8711、DOI 10.17487/RFC8711、2020年2月、<https：//www.rfc-editor.org/info/rfc8711>。"
    },
    {
      "indent": 0,
      "text": "Acknowledgments",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Thanks to everybody involved in the SHMOO Working Group discussion, especially Brian Carpenter, Jason Livingood, Lars Eggert, and Charles Eckel for proposing concrete improvements and their in-depth reviews.",
      "ja": "Shmooワーキンググループのディスカッション、特にブライアンカーペンター、ジェイソンリビングフード、ラースエガート、チャールズエッケルに携わる具体的な改善と詳細なレビューを提案してくれたすべての人に感謝します。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Mirja Khlewind Ericsson Email: mirja.kuehlewind@ericsson.com",
      "ja": "Mirja Khlewind Ericssonメール：mirja.kuehlewind@ericsson.com"
    },
    {
      "indent": 3,
      "text": "Jon Reed Akamai Technologies Email: jreed@akamai.com",
      "ja": "Jon Reed Akamai Technologies Email：jreed@akamai.com"
    },
    {
      "indent": 3,
      "text": "Rich Salz Akamai Technologies Email: rsalz@akamai.com",
      "ja": "Rich Salz Akamai Technologies Email：rsalz@akamai.com"
    }
  ]
}