{
  "title": {
    "text": "RFC 9048 - Improved Extensible Authentication Protocol Method for 3GPP Mobile Network Authentication and Key Agreement (EAP-AKA')",
    "ja": "RFC 9048 - 3GPPモバイルネットワーク認証とキー契約（EAP-AKA '）のための改良された拡張認証プロトコルメソッド"
  },
  "number": 9048,
  "created_at": "2021-10-30 03:00:04.375158+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                          J. Arkko\nRequest for Comments: 9048                                 V. Lehtovirta\nUpdates: 4187, 5448                                          V. Torvinen\nCategory: Informational                                         Ericsson\nISSN: 2070-1721                                                P. Eronen\n                                                             Independent\n                                                            October 2021",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Improved Extensible Authentication Protocol Method for 3GPP Mobile Network Authentication and Key Agreement (EAP-AKA')",
      "ja": "3GPPモバイルネットワーク認証とキー契約（EAP-AKA '）のための改良された拡張認証プロトコルメソッド"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "The 3GPP mobile network Authentication and Key Agreement (AKA) is an authentication mechanism for devices wishing to access mobile networks. RFC 4187 (EAP-AKA) made the use of this mechanism possible within the Extensible Authentication Protocol (EAP) framework. RFC 5448 (EAP-AKA') was an improved version of EAP-AKA.",
      "ja": "3GPPモバイルネットワーク認証およびキー契約（AKA）は、モバイルネットワークにアクセスすることを望む装置の認証メカニズムである。RFC 4187（EAP-AKA）は、拡張認証プロトコル（EAP）フレームワーク内で可能なメカニズムを使用しました。RFC 5448（EAP-AKA '）は、EAP-AKAの改良版でした。"
    },
    {
      "indent": 3,
      "text": "This document is the most recent specification of EAP-AKA', including, for instance, details about and references related to operating EAP-AKA' in 5G networks.",
      "ja": "この文書は、例えば、5GネットワーズのEAP-AKAの操作に関する詳細について、EAP-AKAの最新の仕様です。"
    },
    {
      "indent": 3,
      "text": "EAP-AKA' differs from EAP-AKA by providing a key derivation function that binds the keys derived within the method to the name of the access network. The key derivation function has been defined in the 3rd Generation Partnership Project (3GPP). EAP-AKA' allows its use in EAP in an interoperable manner. EAP-AKA' also updates the algorithm used in hash functions, as it employs SHA-256 / HMAC-SHA-256 instead of SHA-1 / HMAC-SHA-1, which is used in EAP-AKA.",
      "ja": "EAP-AKA 'は、メソッド内で導出されたキーをアクセスネットワークの名前にバインドするキー派生機能を提供することによって、EAP-AKAとは異なります。鍵導出機能は、第3世代パートナーシップ・プロジェクト（3GPP）で定義されています。EAP-AKA 'は、相互運用可能な方法でEAPでの使用を可能にします。EAP-AKA 'はまた、EAP-AKAで使用されるSHA-1 / HMAC-SHA-1の代わりにSHA-256 / HMAC-SHA-256を採用しているため、ハッシュ関数で使用されているアルゴリズムを更新します。"
    },
    {
      "indent": 3,
      "text": "This version of the EAP-AKA' specification defines the protocol behavior for both 4G and 5G deployments, whereas the previous version defined protocol behavior for 4G deployments only. While EAP-AKA' as defined in RFC 5448 is not obsolete, this document defines the most recent and fully backwards-compatible specification of EAP-AKA'. This document updates both RFCs 4187 and 5448.",
      "ja": "このバージョンのEAP-AKAの仕様は、4G展開と5G展開の両方のプロトコル動作を定義しますが、4G展開のための以前のバージョン定義プロトコル動作。RFC 5448で定義されているEAP-AKA 'が廃止されていない間、このドキュメントはEAP-AKAの最新かつ完全に互換性のある仕様を定義しています。この文書はRFCS 4187と5448の両方を更新します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "この文書はインターネット標準のトラック仕様ではありません。それは情報提供のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are candidates for any level of Internet Standard; see Section 2 of RFC 7841.",
      "ja": "この文書はインターネットエンジニアリングタスクフォース（IETF）の製品です。IETFコミュニティのコンセンサスを表します。それはパブリックレビューを受け、インターネットエンジニアリングステアリンググループ（IESG）による出版の承認を受けました。IESGによって承認されたすべての文書がすべてのレベルのインターネット規格の候補者であるわけではありません。RFC 7841のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at https://www.rfc-editor.org/info/rfc9048.",
      "ja": "この文書の現在のステータス、任意のエラータ、およびフィードバックを提供する方法は、https://www.rfc-editor.org/info/rfc9048で入手できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2021 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（C）2021 IETFの信頼と文書著者として識別された人。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (https://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "このドキュメントは、このドキュメントの発行日に有効なBCP 78およびIETFドキュメントに関連するIETFトラストの法的規定（https://trustee.ietf.org/license-info）の対象となります。 これらのドキュメントは、このドキュメントに関するお客様の権利と制限について説明しているため、注意深く確認してください。 このドキュメントから抽出されたコードコンポーネントには、Trust LegalProvisionsのセクション4.eで説明されているSimplifiedBSD Licenseテキストが含まれている必要があり、Simplified BSDLicenseで説明されているように保証なしで提供されます。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction\n2.  Requirements Language\n3.  EAP-AKA'\n  3.1.  AT_KDF_INPUT\n  3.2.  AT_KDF\n  3.3.  Key Derivation\n  3.4.  Hash Functions\n    3.4.1.  PRF'\n    3.4.2.  AT_MAC\n    3.4.3.  AT_CHECKCODE\n  3.5.  Summary of Attributes for EAP-AKA'\n4.  Bidding Down Prevention for EAP-AKA\n  4.1.  Summary of Attributes for EAP-AKA\n5.  Peer Identities\n  5.1.  Username Types in EAP-AKA' Identities\n  5.2.  Generating Pseudonyms and Fast Re-Authentication Identities\n  5.3.  Identifier Usage in 5G\n    5.3.1.  Key Derivation\n    5.3.2.  EAP Identity Response and EAP-AKA' AT_IDENTITY\n            Attribute\n6.  Exported Parameters\n7.  Security Considerations\n  7.1.  Privacy\n  7.2.  Discovered Vulnerabilities\n  7.3.  Pervasive Monitoring\n  7.4.  Security Properties of Binding Network Names\n8.  IANA Considerations\n  8.1.  Type Value\n  8.2.  Attribute Type Values\n  8.3.  Key Derivation Function Namespace\n9.  References\n  9.1.  Normative References\n  9.2.  Informative References\nAppendix A.  Changes from RFC 5448\nAppendix B.  Changes to RFC 4187\nAppendix C.  Importance of Explicit Negotiation\nAppendix D.  Test Vectors\nAcknowledgments\nContributors\nAuthors' Addresses",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The 3GPP mobile network Authentication and Key Agreement (AKA) is an authentication mechanism for devices wishing to access mobile networks. [RFC4187] (EAP-AKA) made the use of this mechanism possible within the Extensible Authentication Protocol (EAP) framework [RFC3748].",
      "ja": "3GPPモバイルネットワーク認証およびキー契約（AKA）は、モバイルネットワークにアクセスすることを望む装置の認証メカニズムである。[RFC4187]（EAP-AKA）は、拡張認証プロトコル（EAP）フレームワーク[RFC3748]内で可能なメカニズムを使用しました。"
    },
    {
      "indent": 3,
      "text": "EAP-AKA' is an improved version of EAP-AKA. EAP-AKA' was defined in RFC 5448 [RFC5448], and it updated EAP-AKA [RFC4187].",
      "ja": "EAP-AKA 'はEAP-AKAの改良版です。EAP-AKA 'はRFC 5448 [RFC5448]で定義され、EAP-AKA [RFC4187]を更新しました。"
    },
    {
      "indent": 3,
      "text": "This document is the most recent specification of EAP-AKA', including, for instance, details about and references related to operating EAP-AKA' in 5G networks. This document does not obsolete RFC 5448; however, this document is the most recent and fully backwards-compatible specification.",
      "ja": "この文書は、例えば、5GネットワーズのEAP-AKAの操作に関する詳細について、EAP-AKAの最新の仕様です。この文書はRFC 5448を廃止しません。ただし、この文書は最新かつ完全に互換性のある仕様です。"
    },
    {
      "indent": 3,
      "text": "EAP-AKA' is commonly implemented in mobile phones and network equipment. It can be used for authentication to gain network access via Wireless LAN networks and, with 5G, also directly to mobile networks.",
      "ja": "EAP-AKA 'は一般的に携帯電話およびネットワーク機器に実装されています。認証には、無線LANネットワークを介してネットワークアクセスをゲインするために、そして5Gを介して、モバイルネットワークへの直接のネットワークアクセスを得ることができます。"
    },
    {
      "indent": 3,
      "text": "EAP-AKA' differs from EAP-AKA by providing a different key derivation function. This function binds the keys derived within the method to the name of the access network. This limits the effects of compromised access network nodes and keys. EAP-AKA' also updates the algorithm used for hash functions.",
      "ja": "EAP-AKA 'は、異なるキー導出機能を提供することによってEAP-AKAとは異なります。この関数は、メソッド内で派生したキーをアクセスネットワークの名前にバインドします。これにより、アクセスネットワークノードとキーの侵入先の影響が制限されます。EAP-AKA 'はまたハッシュ関数に使用されるアルゴリズムを更新します。"
    },
    {
      "indent": 3,
      "text": "The EAP-AKA' method employs the derived keys CK' and IK' from the 3GPP specification [TS-3GPP.33.402] and updates the hash function that is used to SHA-256 [FIPS.180-4] and HMAC to HMAC-SHA-256. Otherwise, EAP-AKA' is equivalent to EAP-AKA. Given that a different EAP method Type value is used for EAP-AKA and EAP-AKA', a mutually supported method may be negotiated using the standard mechanisms in EAP [RFC3748].",
      "ja": "EAP-AKA 'メソッドは、3GPP仕様[TS-3GPP.33.402]から派生キーCK'およびIK 'を使用し、SHA-256 [FIPS.180-4]とHMACに使用されるハッシュ関数を更新します。SHA-256。それ以外の場合、EAP-AKA 'はEAP-AKAと同じです。EAP-AKAおよびEAP-AKAに異なるEAPメソッドタイプの値が使用されることを考えると、相互にサポートされている方法はEAP [RFC3748]の標準メカニズムを使用して交渉することができます。"
    },
    {
      "indent": 9,
      "text": "Note that any change of the key derivation must be unambiguous to both sides in the protocol. That is, it must not be possible to accidentally connect old equipment to new equipment and get the key derivation wrong or to attempt to use incorrect keys without getting a proper error message. See Appendix C for further information.",
      "ja": "鍵導出の変更は、プロトコル内の両側に明確でなければならないことに注意してください。つまり、古い機器を新しい機器に誤って接続し、正しいエラーメッセージを受けることなく鍵の派生を誤って入手することができないか、または誤ったキーを使用しようとすることはできません。詳細については付録Cを参照してください。"
    },
    {
      "indent": 9,
      "text": "Note also that choices in authentication protocols should be secure against bidding down attacks that attempt to force the participants to use the least secure function. See Section 4 for further information.",
      "ja": "また、認証プロトコルの選択肢は、参加者に安全な機能を使用するように強制すると試みる攻撃の入札を安全にする必要があります。詳細についてはセクション4を参照してください。"
    },
    {
      "indent": 3,
      "text": "This specification makes the following changes from RFC 5448:",
      "ja": "この仕様は、RFC 5448から次のような変更を加えます。"
    },
    {
      "indent": 3,
      "text": "* Updates the reference that specifies how the Network Name field is constructed in the protocol. This update ensures that EAP-AKA' is compatible with 5G deployments. RFC 5448 referred to the Release 8 version of [TS-3GPP.24.302]. This document points to the first 5G version, Release 16.",
      "ja": "* ネットワーク名フィールドがプロトコル内で構築されている方法を指定する参照を更新します。このアップデートにより、EAP-AKA 'は5G展開と互換性があります。RFC 5448リリース8バージョンの[TS-3GPP.24.302]を参照してください。このドキュメントは最初の5Gバージョン、リリース16を指しています。"
    },
    {
      "indent": 3,
      "text": "* Specifies how EAP and EAP-AKA' use identifiers in 5G. Additional identifiers are introduced in 5G, and for interoperability, it is necessary that the right identifiers are used as inputs in the key derivation. In addition, for identity privacy it is important that when privacy-friendly identifiers in 5G are used, no trackable, permanent identifiers are passed in EAP-AKA', either.",
      "ja": "* EAPとEAP-AKAの識別子を5Gで使用する方法を指定します。追加の識別子が5Gで導入され、相互運用性のために、右の識別子がキー導出における入力として使用されることが必要である。さらに、IDのプライバシーのために、5Gのプライバシーにやさしい識別子が使用されているとき、追跡可能な、恒久的な識別子がEAP-AKAに渡されない場合であることが重要です。"
    },
    {
      "indent": 3,
      "text": "* Specifies session identifiers and other exported parameters, as those were not specified in [RFC5448] despite requirements set forward in [RFC5247] to do so. Also, while [RFC5247] specified session identifiers for EAP-AKA, it only did so for the full authentication case, not for the case of fast re-authentication.",
      "ja": "* [RFC5247]では、[RFC5247]で設定されているにもかかわらず、[RFC5448]で指定されていないので、セッション識別子およびその他のエクスポートされたパラメーターを指定します。また、[RFC5247] EAP-AKAのセッション識別子が指定されている間、それは高速再認証の場合に限らず、完全認証の場合にのみされました。"
    },
    {
      "indent": 3,
      "text": "* Updates the requirements on generating pseudonym usernames and fast re-authentication identities to ensure identity privacy.",
      "ja": "* IDのプライバシーを確保するために、PSEudonymのユーザー名と高速再認証IDの生成に関する要件を更新します。"
    },
    {
      "indent": 3,
      "text": "* Describes what has been learned about any vulnerabilities in AKA or EAP-AKA'.",
      "ja": "* AKAまたはEAP-AKAの何らかの脆弱性について学んだことを説明します。"
    },
    {
      "indent": 3,
      "text": "* Describes the privacy and pervasive monitoring considerations related to EAP-AKA'.",
      "ja": "* EAP-AKAに関連するプライバシーと普及監視に関する考慮事項について説明します。"
    },
    {
      "indent": 3,
      "text": "* Adds summaries of the attributes.",
      "ja": "* 属性の要約を追加します。"
    },
    {
      "indent": 3,
      "text": "Some of the updates are small. For instance, the reference update to [TS-3GPP.24.302] does not change the 3GPP specification number, only the version. But this reference is crucial for the correct calculation of the keys that result from running the EAP-AKA' method, so an RFC update pointing to the newest version was warranted.",
      "ja": "いくつかの更新は小さいです。たとえば、[TS-3GPP.24.302]への参照更新は、3GPP仕様番号を変更しません。バージョンだけです。しかし、このリファレンスはEAP-AKA 'メソッドの実行から生じるキーの正しい計算に不可欠ですので、最新バージョンを指すRFCの更新が保証されました。"
    },
    {
      "indent": 9,
      "text": "Note: Any further updates in 3GPP specifications that affect, for instance, key derivation is something that EAP-AKA' implementations need to take into account. Upon such updates, there will be a need to update both this specification and the implementations.",
      "ja": "注：例えばキー導出に影響を与える3GPP仕様の更新は、EAP-AKAの実装が考慮する必要があるものです。そのような更新時に、この仕様と実装の両方を更新する必要があります。"
    },
    {
      "indent": 3,
      "text": "It is an explicit non-goal of this specification to include any other technical modifications, addition of new features, or other changes. The EAP-AKA' base protocol is stable and needs to stay that way. If there are any extensions or variants, those need to be proposed as standalone extensions or even as different authentication methods.",
      "ja": "他の技術的な変更、新機能の追加、またはその他の変更を含むのは、この仕様の明示的な非目標です。EAP-AKAの基本プロトコルは安定しており、そのように滞在する必要があります。拡張または変形がある場合は、それらをスタンドアロンの拡張子として、あるいは異なる認証方法としても提案する必要があります。"
    },
    {
      "indent": 3,
      "text": "The rest of this specification is structured as follows. Section 3 defines the EAP-AKA' method. Section 4 adds support to EAP-AKA to prevent bidding down attacks from EAP-AKA'. Section 5 specifies requirements regarding the use of peer identities, including how 5G identifiers are used in the EAP-AKA' context. Section 6 specifies which parameters EAP-AKA' exports out of the method. Section 7 explains the security differences between EAP-AKA and EAP-AKA'. Section 8 describes the IANA considerations, and Appendix A and Appendix B explain the updates to RFC 5448 (EAP-AKA') and RFC 4187 (EAP-AKA) that have been made in this specification. Appendix C explains some of the design rationale for creating EAP-AKA'. Finally, Appendix D provides test vectors.",
      "ja": "この仕様の残りは以下のように構成されています。セクション3はEAP-AKAの方法を定義します。セクション4 EAP-AKAからの攻撃を入札しないように、EAP-AKAにサポートを追加します。セクション5は、EAP-AKAのコンテキストで5G識別子を使用する方法を含む、ピアIDの使用に関する要件を指定します。セクション6は、どのパラメータEAP-AKA 'がメソッドからエクスポートするかを指定します。セクション7は、EAP-AKAとEAP-AKAのセキュリティの違いを説明しています。セクション8はIANAの考慮事項を説明し、付録Aおよび付録Bは、この仕様で行われたRFC 5448（EAP-AKA '）およびRFC 4187（EAP-AKA）の更新を説明しています。付録C EAP-AKAを作成するための設計根拠の一部を説明します。最後に、付録Dはテストベクトルを提供します。"
    },
    {
      "indent": 0,
      "text": "2. Requirements Language",
      "section_title": true,
      "ja": "2. 要件言語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14 [RFC2119] [RFC8174] when, and only when, they appear in all capitals, as shown here.",
      "ja": "この文書のキーワード \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", および \"OPTIONAL\" はBCP 14 [RFC2119] [RFC8174]で説明されているように、すべて大文字の場合にのみ解釈されます。"
    },
    {
      "indent": 0,
      "text": "3. EAP-AKA'",
      "section_title": true,
      "ja": "3. EAP-AKA '"
    },
    {
      "indent": 3,
      "text": "EAP-AKA' is an EAP method that follows the EAP-AKA specification [RFC4187] in all respects except the following:",
      "ja": "EAP-AKA 'は、次の点を除くすべての点でEAP-AKA仕様[RFC4187]に続くEAPメソッドです。"
    },
    {
      "indent": 3,
      "text": "* It uses the Type code 0x32, not 0x17 (which is used by EAP-AKA).",
      "ja": "* 0x17（EAP-AKAで使用されている）のタイプコード0x32を使用します。"
    },
    {
      "indent": 3,
      "text": "* It carries the AT_KDF_INPUT attribute, as defined in Section 3.1, to ensure that both the peer and server know the name of the access network.",
      "ja": "* PeerとServerの両方がアクセスネットワークの名前を知っていることを確認するために、セクション3.1で定義されているように、AT_KDF_INPUT属性を搭載しています。"
    },
    {
      "indent": 3,
      "text": "* It supports key derivation function negotiation via the AT_KDF attribute (Section 3.2) to allow for future extensions.",
      "ja": "* 将来の拡張機能を可能にするために、AT_KDF属性（セクション3.2）を介したキー派生関数ネゴシエーションをサポートします。"
    },
    {
      "indent": 3,
      "text": "* It calculates keys as defined in Section 3.3, not as defined in EAP-AKA.",
      "ja": "* EAP-AKAで定義されていないセクション3.3で定義されているキーを計算します。"
    },
    {
      "indent": 3,
      "text": "* It employs SHA-256 / HMAC-SHA-256 [FIPS.180-4], not SHA-1 / HMAC-SHA-1 [RFC2104] (see Section 3.4).",
      "ja": "* SHA-1 / HMAC-SHA1 [RFC 2104]ではなくSHA256 / HMAC-SHA-256 [FIPS.180-4]を採用しています（セクション3.4を参照）。"
    },
    {
      "indent": 3,
      "text": "Figure 1 shows an example of the authentication process. Each message AKA'-Challenge and so on represents the corresponding message from EAP-AKA, but with the EAP-AKA' Type code. The definition of these messages, along with the definition of attributes AT_RAND, AT_AUTN, AT_MAC, and AT_RES can be found in [RFC4187].",
      "ja": "認証処理の一例を図1に示す。各メッセージAKA'-Challengeなどは、EAP-AKAからの対応するメッセージを表しますが、EAP-AKAのタイプコードを表します。これらのメッセージの定義は、属性AT_RAND、AT_AUTN、AT_MAC、およびAT_RESの定義とともに、[RFC4187]にあります。"
    },
    {
      "indent": 3,
      "text": " Peer                                                    Server\n    |                       EAP-Request/Identity             |\n    |<-------------------------------------------------------|\n    |                                                        |\n    |  EAP-Response/Identity                                 |\n    |  (Includes user's Network Access Identifier, NAI)      |\n    |------------------------------------------------------->|\n    |         +--------------------------------------------------+\n    |         | Server determines the network name and ensures   |\n    |         | that the given access network is authorized to   |\n    |         | use the claimed name.  The server then runs the  |\n    |         | AKA' algorithms generating RAND and AUTN, and    |\n    |         | derives session keys from CK' and IK'.  RAND and |\n    |         | AUTN are sent as AT_RAND and AT_AUTN attributes, |\n    |         | whereas the network name is transported in the   |\n    |         | AT_KDF_INPUT attribute.  AT_KDF signals the used |\n    |         | key derivation function.  The session keys are   |\n    |         | used in creating the AT_MAC attribute.           |\n    |         +--------------------------------------------------+\n    |                         EAP-Request/AKA'-Challenge     |\n    |        (AT_RAND, AT_AUTN, AT_KDF, AT_KDF_INPUT, AT_MAC)|\n    |<-------------------------------------------------------|\n+------------------------------------------------------+     |\n| The peer determines what the network name should be, |     |\n| based on, e.g., what access technology it is using.  |     |\n| The peer also retrieves the network name sent by     |     |\n| the network from the AT_KDF_INPUT attribute.  The    |     |\n| two names are compared for discrepancies, and if     |     |\n| necessary, the authentication is aborted.  Otherwise,|     |\n| the network name from AT_KDF_INPUT attribute is      |     |\n| used in running the AKA' algorithms, verifying AUTN  |     |\n| from AT_AUTN and MAC from AT_MAC attributes.  The    |     |\n| peer then generates RES.  The peer also derives      |     |\n| session keys from CK'/IK'.  The AT_RES and AT_MAC    |     |\n| attributes are constructed.                          |     |\n+------------------------------------------------------+     |\n    | EAP-Response/AKA'-Challenge                            |\n    | (AT_RES, AT_MAC)                                       |\n    |------------------------------------------------------->|\n    |         +--------------------------------------------------+\n    |         | Server checks the RES and MAC values received    |\n    |         | in AT_RES and AT_MAC, respectively.  Success     |\n    |         | requires both to be found correct.               |\n    |         +--------------------------------------------------+\n    |                                           EAP-Success  |\n    |<-------------------------------------------------------|",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 17,
      "text": "Figure 1: EAP-AKA' Authentication Process",
      "ja": "図1：EAP-AKAの認証プロセス"
    },
    {
      "indent": 3,
      "text": "EAP-AKA' can operate on the same credentials as EAP-AKA and employ the same identities. However, EAP-AKA' employs different leading characters than EAP-AKA for the conventions given in Section 4.1.1 of [RFC4187] for usernames based on International Mobile Subscriber Identifier (IMSI). For 4G networks, EAP-AKA' MUST use the leading character \"6\" (ASCII 36 hexadecimal) instead of \"0\" for IMSI-based permanent usernames. For 5G networks, the leading character \"6\" is not used for IMSI-based permanent usernames. Identifier usage in 5G is specified in Section 5.3. All other usage and processing of the leading characters, usernames, and identities is as defined by EAP-AKA [RFC4187]. For instance, the pseudonym and fast re-authentication usernames need to be constructed so that the server can recognize them. As an example, a pseudonym could begin with a leading \"7\" character (ASCII 37 hexadecimal) and a fast re-authentication username could begin with \"8\" (ASCII 38 hexadecimal). Note that a server that implements only EAP-AKA may not recognize these leading characters. According to Section 4.1.4 of [RFC4187], such a server will re-request the identity via the EAP-Request/AKA-Identity message, making obvious to the peer that EAP-AKA and associated identity are expected.",
      "ja": "EAP-AKA 'はEAP-AKAと同じ資格情報で動作し、同じIDを採用できます。ただし、EAP-AKA 'は、国際的なモバイル加入者識別子（IMSI）に基づくユーザ名については、4.1.1 [RFC4187]のセクション4.1.1に記載されている規則については、EAP-AKAよりも先行文字を採用しています。 4Gネットワーネットワークでは、IPSIベースの永続ユーザー名の場合は「0」の代わりに、「6」（ASCII 36 16進数）を使用する必要があります。 5Gネットワークの場合、先頭の文字 \"6\"はIMSIベースの永続的なユーザー名には使用されません。 5Gの識別子使用量はセクション5.3で指定されています。先頭文字、ユーザー名、およびIDの他のすべての使用法と処理は、EAP-AKA [RFC4187]によって定義されています。たとえば、サーバーがそれらを認識できるように、仮名と高速再認証のユーザー名を構築する必要があります。一例として、仮名は、先頭の \"7\"文字（ASCII 37 16進数）で始まり、高速再認証ユーザー名は \"8\"で始めることができます（ASCII 38 16進数）。 EAP-AKAのみを実装するサーバーは、これらの先行文字を認識できないことに注意してください。 [RFC4187]のセクション4.1.4に従って、そのようなサーバーはEAP-REQUEST / AKA-IDメッセージを介してIDを再要求し、EAP-AKAと関連IDが予想されるピアに明らかになります。"
    },
    {
      "indent": 0,
      "text": "3.1. AT_KDF_INPUT",
      "section_title": true,
      "ja": "3.1. at_kdf_input."
    },
    {
      "indent": 3,
      "text": "The format of the AT_KDF_INPUT attribute is shown below.",
      "ja": "AT_KDF_INPUT属性のフォーマットを以下に示します。"
    },
    {
      "indent": 6,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n| AT_KDF_INPUT  | Length        | Actual Network Name Length    |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                                                               |\n.                        Network Name                           .\n.                                                               .\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The fields are as follows:",
      "ja": "フィールドは次のとおりです。"
    },
    {
      "indent": 3,
      "text": "AT_KDF_INPUT This is set to 23.",
      "ja": "AT_KDF_INPUTこれは23に設定されています。"
    },
    {
      "indent": 3,
      "text": "Length The length of the attribute, calculated as defined in [RFC4187], Section 8.1.",
      "ja": "長さ属性の長さは、[RFC4187]、セクション8.1で定義されているように計算されます。"
    },
    {
      "indent": 3,
      "text": "Actual Network Name Length This is a 2-byte actual length field, needed due to the requirement that the previous field is expressed in multiples of 4 bytes per the usual EAP-AKA rules. The Actual Network Name Length field provides the length of the network name in bytes.",
      "ja": "実際のネットワーク名の長さこれは、以前のフィールドが通常のEAP-AKAルールごとに4バイトの倍数で表現されるという要件のために必要な2バイトの実際の長さフィールドです。実際のネットワーク名の長さフィールドには、ネットワーク名の長さがバイト単位で表示されます。"
    },
    {
      "indent": 3,
      "text": "Network Name This field contains the network name of the access network for which the authentication is being performed. The name does not include any terminating null characters. Because the length of the entire attribute must be a multiple of 4 bytes, the sender pads the name with 1, 2, or 3 bytes of all zero bits when necessary.",
      "ja": "ネットワーク名このフィールドには、認証が実行されているアクセスネットワークのネットワーク名が含まれています。名前には終了したヌル文字は含まれません。属性全体の長さは4バイトの倍数でなければならないため、送信者は必要に応じてすべてのゼロビットの1,2、または3バイトの名前をパッドします。"
    },
    {
      "indent": 3,
      "text": "Only the server sends the AT_KDF_INPUT attribute. The value is sent as specified in [TS-3GPP.24.302] for both non-3GPP access networks and for 5G access networks. Per [TS-3GPP.33.402], the server always verifies the authorization of a given access network to use a particular name before sending it to the peer over EAP-AKA'. The value of the AT_KDF_INPUT attribute from the server MUST be non-empty, with a greater than zero length in the Actual Network Name Length field. If the AT_KDF_INPUT attribute is empty, the peer behaves as if AUTN had been incorrect and authentication fails. See Section 3 and Figure 3 of [RFC4187] for an overview of how authentication failures are handled.",
      "ja": "サーバーだけがat_kdf_input属性を送信します。値は、非3GPPアクセスネットワークと5Gアクセスネットワークの両方について[TS-3GPP.24.302]で指定されているように送信されます。[TS-3GPP.33.402]ごとに、サーバーは常に特定の名前を使用して特定の名前を使用してEAP-AKAを介してピアに送信することを確認します。サーバーからのAT_KDF_INPUT属性の値は、実際のネットワーク名の長さフィールドに長さがゼロでない場合は空でない必要があります。AT_KDF_INPUT属性が空の場合、AUTNが正しくないかのようにピアが動作し、認証が失敗します。認証の失敗の処理方法の概要については、[RFC4187]のセクション3と図3を参照してください。"
    },
    {
      "indent": 3,
      "text": "In addition, the peer MAY check the received value against its own understanding of the network name. Upon detecting a discrepancy, the peer either warns the user and continues, or fails the authentication process. More specifically, the peer SHOULD have a configurable policy that it can follow under these circumstances. If the policy indicates that it can continue, the peer SHOULD log a warning message or display it to the user. If the peer chooses to proceed, it MUST use the network name as received in the AT_KDF_INPUT attribute. If the policy indicates that the authentication should fail, the peer behaves as if AUTN had been incorrect and authentication fails.",
      "ja": "さらに、ピアは受信した値をネットワーク名のそれ自身の理解に照らしてチェックすることができます。矛盾を検出すると、ピアはユーザーを警告して継続するか、または認証プロセスに失敗します。より具体的には、ピアには、これらの状況下で従うことができる設定可能なポリシーが必要です。ポリシーが続行できることを示している場合、ピアは警告メッセージを記録したり、ユーザーに表示する必要があります。ピアが続行することを選択した場合は、at_kdf_input属性で受信したネットワーク名を使用する必要があります。認証が失敗したことをポリシーが表示されている場合、PeerはAUTNが正しくないかのように動作し、認証が失敗します。"
    },
    {
      "indent": 3,
      "text": "The Network Name field contains a UTF-8 string. This string MUST be constructed as specified in [TS-3GPP.24.302] for \"Access Network Identity\". The string is structured as fields separated by colons (:). The algorithms and mechanisms to construct the identity string depend on the used access technology.",
      "ja": "[ネットワーク名]フィールドには、UTF-8文字列が含まれています。この文字列は、[ネットワークIDへのアクセス]の[TS-3GPP.24.302]で指定されているとおりに構成する必要があります。文字列は、コロン（:)で区切られたフィールドとして構成されています。識別文字列を構築するためのアルゴリズムとメカニズムは、使用されるアクセス技術によって異なります。"
    },
    {
      "indent": 3,
      "text": "On the network side, the network name construction is a configuration issue in an access network and an authorization check in the authentication server. On the peer, the network name is constructed based on the local observations. For instance, the peer knows which access technology it is using on the link, it can see information in a link-layer beacon, and so on. The construction rules specify how this information maps to an access network name. Typically, the network name consists of the name of the access technology or the name of the access technology followed by some operator identifier that was advertised in a link-layer beacon. In all cases, [TS-3GPP.24.302] is the normative specification for the construction in both the network and peer side. If the peer policy allows running EAP-AKA' over an access technology for which that specification does not provide network name construction rules, the peer SHOULD rely only on the information from the AT_KDF_INPUT attribute and not perform a comparison.",
      "ja": "ネットワーク側では、ネットワーク名構築は、Access Networkの構成問題と認証サーバーの認証確認です。ピアでは、ネットワーク名はローカルの観測値に基づいて構築されます。たとえば、ピアはリンク上でどのアクセス技術を使用しているかを知っています。リンクレイヤービーコンの情報を見ることができます。構築規則は、この情報がアクセスネットワーク名にどのようにマッピングされるかを指定します。通常、ネットワーク名は、アクセステクノロジの名前またはアクセステクノロジの名前とそれに続くリンク層ビーコンでアドバタイズされたオペレータ識別子で構成されています。すべての場合において、[TS-3GPP.24.302]は、ネットワーク側とピア側の両方の構造の規範的仕様です。その仕様がネットワーク名構築規則を提供していないアクセステクノロジを介してピア・AKAを実行できる場合、ピアはAT_KDF_INPUT属性からの情報のみを依存し、比較を実行しないようにしてください。"
    },
    {
      "indent": 3,
      "text": "If a comparison of the locally determined network name and the one received over EAP-AKA' is performed on the peer, it MUST be done as follows. First, each name is broken down to the fields separated by colons. If one of the names has more colons and fields than the other one, the additional fields are ignored. The remaining sequences of fields are compared, and they match only if they are equal character by character. This algorithm allows a prefix match where the peer would be able to match \"\", \"FOO\", and \"FOO:BAR\" against the value \"FOO:BAR\" received from the server. This capability is important in order to allow possible updates to the specifications that dictate how the network names are constructed. For instance, if a peer knows that it is running on access technology \"FOO\", it can use the string \"FOO\" even if the server uses an additional, more accurate description, e.g., \"FOO:BAR\", that contains more information.",
      "ja": "ローカルに決定されたネットワーク名とEAP-AKAを介して受信したものとの比較がピアで実行されている場合は、次のようにして実行する必要があります。まず、各名前はコロンで区切られたフィールドに分割されます。いずれかの名前の1つが他のコロンとフィールドにある場合、追加のフィールドは無視されます。残りのフィールドのシーケンスは比較され、それらは文字で等しい文字である場合にのみ一致します。このアルゴリズムは、ピアがサーバーから受信した値 \"foo：bar\"に対して、ピアが \"\"、 \"foo\"、および \"foo：bar\"を一致させることができるプレフィックス一致を可能にします。この機能は、ネットワーク名の構築方法を指示する仕様の更新を可能にするために重要です。たとえば、ピアがアクセステクノロジ \"foo\"で実行されていることを認識している場合は、サーバーが追加の、より正確な説明、例えば \"foo：bar\"を含む場合でも、文字列 \"foo\"を使用できます。。"
    },
    {
      "indent": 3,
      "text": "The allocation procedures in [TS-3GPP.24.302] ensure that conflicts potentially arising from using the same name in different types of networks are avoided. The specification also has detailed rules about how a client can determine these based on information available to the client, such as the type of protocol used to attach to the network, beacons sent out by the network, and so on. Information that the client cannot directly observe (such as the type or version of the home network) is not used by this algorithm.",
      "ja": "[TS-3GPP.24.302]の割り当て手順は、さまざまな種類のネットワークで同じ名前を使用することから発生する競合が回避されます。この仕様には、ネットワークに添付するプロトコルの種類、ネットワークによって送信されたビーコンなど、クライアントがクライアントが利用できる情報に基づいてクライアントがどのように判断できるかについての詳細な規則もあります。クライアントが直接観察できない情報（ホームネットワークの種類やバージョンなど）はこのアルゴリズムでは使用されません。"
    },
    {
      "indent": 3,
      "text": "The AT_KDF_INPUT attribute MUST be sent and processed as explained above when AT_KDF attribute has the value 1. Future definitions of new AT_KDF values MUST define how this attribute is sent and processed.",
      "ja": "AT_KDF属性が値1の場合、at_kdf_input属性を上記のように送信および処理する必要があります。"
    },
    {
      "indent": 0,
      "text": "3.2. AT_KDF",
      "section_title": true,
      "ja": "3.2. at_kdf."
    },
    {
      "indent": 3,
      "text": "AT_KDF is an attribute that the server uses to reference a specific key derivation function. It offers a negotiation capability that can be useful for future evolution of the key derivation functions.",
      "ja": "AT_KDFは、サーバーが特定のキー導出機能を参照するために使用する属性です。鍵導出機能の将来の進化に役立つことができる交渉機能を提供します。"
    },
    {
      "indent": 3,
      "text": "The format of the AT_KDF attribute is shown below.",
      "ja": "AT_KDF属性の形式を以下に示します。"
    },
    {
      "indent": 6,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n| AT_KDF        | Length        |    Key Derivation Function    |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The fields are as follows:",
      "ja": "フィールドは次のとおりです。"
    },
    {
      "indent": 3,
      "text": "AT_KDF This is set to 24.",
      "ja": "AT_KDFこれは24に設定されています。"
    },
    {
      "indent": 3,
      "text": "Length The length of the attribute, calculated as defined in [RFC4187], Section 8.1. For AT_KDF, the Length field MUST be set to 1.",
      "ja": "長さ属性の長さは、[RFC4187]、セクション8.1で定義されているように計算されます。AT_KDFの場合、長さフィールドは1に設定する必要があります。"
    },
    {
      "indent": 3,
      "text": "Key Derivation Function An enumerated value representing the key derivation function that the server (or peer) wishes to use. Value 1 represents the default key derivation function for EAP-AKA', i.e., employing CK' and IK' as defined in Section 3.3.",
      "ja": "キー派生機能サーバ（またはピア）が使用したいキーの導出関数を表す列挙値。値1は、セクション3.3で定義されているEAP-AKA '、すなわちCK'およびIK 'を採用するためのデフォルトのキー導出関数を表す。"
    },
    {
      "indent": 3,
      "text": "Servers MUST send one or more AT_KDF attributes in the EAP-Request/ AKA'-Challenge message. These attributes represent the desired functions ordered by preference, the most preferred function being the first attribute.",
      "ja": "サーバーは、EAP-Request / Aka'-Challengeメッセージに1つ以上のAT_KDF属性を送信する必要があります。これらの属性は、優先によって順序付けられた望ましい関数を表し、最も優先関数は最初の属性です。"
    },
    {
      "indent": 3,
      "text": "Upon receiving a set of these attributes, if the peer supports and is willing to use the key derivation function indicated by the first attribute, the function is taken into use without any further negotiation. However, if the peer does not support this function or is unwilling to use it, it does not process the received EAP-Request/ AKA'-Challenge in any way except by responding with the EAP-Response/ AKA'-Challenge message that contains only one attribute, AT_KDF with the value set to the selected alternative. If there is no suitable alternative, the peer behaves as if AUTN had been incorrect and authentication fails (see Figure 3 of [RFC4187]). The peer fails the authentication also if there are any duplicate values within the list of AT_KDF attributes (except where the duplication is due to a request to change the key derivation function; see below for further information).",
      "ja": "これらの属性のセットを受信すると、ピアが最初の属性によって示されるキー導出関数を使用することを望んでいる場合、その関数はそれ以上のネゴシエーションなしで使用されます。ただし、ピアがこの機能をサポートしていないか、使用したくない場合は、受信したEAP-REQUEST / AKAのチャレンジは、EAP-Response / Aka'-Challengeメッセージを含むこと以外は、受信したEAP-REQUEST / AKAのチャレンジを処理しません。値が選択された代替手段に設定されている属性at_kdfだけ。適切な代替手段がない場合、ピアはAUTNが正しくないかのように動作し、認証が失敗した場合（[RFC4187]の図3参照）。AT_KDF属性のリスト内に重複した値がある場合は、ピアは認証に失敗します（重複がキー導出機能の変更要求が原因である場合を除きます。詳細については下記参照）。"
    },
    {
      "indent": 3,
      "text": "Upon receiving an EAP-Response/AKA'-Challenge with AT_KDF from the peer, the server checks that the suggested AT_KDF value was one of the alternatives in its offer. The first AT_KDF value in the message from the server is not a valid alternative since the peer should have accepted it without further negotiation. If the peer has replied with the first AT_KDF value, the server behaves as if AT_MAC of the response had been incorrect and fails the authentication. For an overview of the failed authentication process in the server side, see Section 3 and Figure 2 of [RFC4187]. Otherwise, the server re-sends the EAP-Response/AKA'-Challenge message, but adds the selected alternative to the beginning of the list of AT_KDF attributes and retains the entire list following it. Note that this means that the selected alternative appears twice in the set of AT_KDF values. Responding to the peer's request to change the key derivation function is the only legal situation where such duplication may occur.",
      "ja": "ピアからAT_KDFを使用してEAP-Response / AKAのチャレンジを受信すると、サーバーは推奨されるAT_KDF値がそのオファーの代替案の1つであることを確認します。サーバーからのメッセージ内の最初のAT_KDF値は、ピアがそれ以上のネゴシエーションなしにそれを受け入れたため、有効な代替手段ではありません。ピアが最初のAT_KDF値に応答した場合、サーバーは応答のAT_MACが正しくないかのように動作し、認証に失敗します。サーバー側の認証プロセスの失敗の概要については、[RFC4187]のセクション3と図2を参照してください。それ以外の場合、サーバーはEAP-Response / Aka'-Challengeメッセージを再送信しますが、選択した代替案をAT_KDF属性のリストの先頭に追加し、それに続くリスト全体を保持します。これは、選択された代替案がAT_KDF値のセットで2回表示されることを意味します。ピアの要求に応答して、キーの派生機能を変更することは、そのような重複が発生する可能性がある唯一の法的状況です。"
    },
    {
      "indent": 3,
      "text": "When the peer receives the new EAP-Request/AKA'-Challenge message, it MUST check that the requested change, and only the requested change, occurred in the list of AT_KDF attributes. If so, it continues with processing the received EAP-Request/AKA'-Challenge as specified in [RFC4187] and Section 3.1 of this document. If not, it behaves as if AT_MAC had been incorrect and fails the authentication. If the peer receives multiple EAP-Request/AKA'-Challenge messages with differing AT_KDF attributes without having requested negotiation, the peer MUST behave as if AT_MAC had been incorrect and fail the authentication.",
      "ja": "ピアが新しいEAP-REQUEST / AKAのチャレンジメッセージを受信すると、要求された変更がat_kdf属性のリストで発生したことを確認する必要があります。もしそうなら、このドキュメントの[RFC4187]およびセクション3.1で指定されたように、受信したEAP-REQUEST / AKA'-Challengeを処理し続けます。そうでない場合は、AT_MACが正しくないかのように動作し、認証に失敗します。リクエストしたネゴシエーションを受けていなくても、ピアがAT_KDF属性が異なる複数のEAP-REQUEST / AKAのチャレンジメッセージを受信した場合、AT_MACが正しくなかったかのようにピアを動作させる必要があります。"
    },
    {
      "indent": 3,
      "text": "Note that the peer may also request sequence number resynchronization [RFC4187]. This happens after AT_KDF negotiation has already completed. That is, the EAP-Request/AKA'-Challenge and, possibly, the EAP-Response/AKA'-Challenge messages are exchanged first to determine a mutually acceptable key derivation function, and only then is the possible AKA'-Synchronization-Failure message sent. The AKA'-Synchronization-Failure message is sent as a response to the newly received EAP-Request/AKA'-Challenge, which is the last message of the AT_KDF negotiation. Note that if the first proposed KDF is acceptable, then the first EAP-Request/AKA'-Challenge message is also the last message. The AKA'-Synchronization-Failure message MUST contain the AUTS parameter as specified in [RFC4187] and a copy the AT_KDF attributes as they appeared in the last message of the AT_KDF negotiation. If the AT_KDF attributes are found to differ from their earlier values, the peer and server MUST behave as if AT_MAC had been incorrect and fail the authentication.",
      "ja": "ピアはシーケンス番号の再同期を要求することもできます[RFC4187]。これは、AT_KDFネゴシエーションがすでに完了した後に発生します。つまり、EAP要求/ AKAのチャレンジ、およびおそらく、EAP応答/ AKAのチャレンジメッセージは、最初に相互に許容される鍵導出関数を決定するために交換され、それだけのAKAの同期障害が可能です。送信されたメッセージAKAの同期障害メッセージは、新しく受信したEAP-Request / Aka'-Challengeに対する応答として送信されます。これは、AT_KDFネゴシエーションの最後のメッセージです。最初の提案されたKDFが許容できる場合、最初のEAP-REQUEST / AKAのチャレンジメッセージも最後のメッセージであることに注意してください。 AKAの同期障害メッセージには、[RFC4187]で指定されているAUTSパラメータとAT_KDFネゴシエーションの最後のメッセージに表示されているAT_KDF属性のコピーが含まれている必要があります。 AT_KDF属性が以前の値と異なる場合は、PeerとServerは、AT_MACが正しくないかのように動作し、認証に失敗した場合があります。"
    },
    {
      "indent": 0,
      "text": "3.3. Key Derivation",
      "section_title": true,
      "ja": "3.3. キー派生"
    },
    {
      "indent": 3,
      "text": "Both the peer and server MUST derive the keys as follows.",
      "ja": "ピアとサーバーの両方が次のようにキーを導き出す必要があります。"
    },
    {
      "indent": 3,
      "text": "AT_KDF parameter has the value 1 In this case, MK is derived and used as follows:",
      "ja": "at_kdfパラメータは値1を持ちます。この場合、Mkは次のように導き出されて使用されます。"
    },
    {
      "indent": 10,
      "text": "MK = PRF'(IK'|CK',\"EAP-AKA'\"|Identity)\nK_encr = MK[0..127]\nK_aut  = MK[128..383]\nK_re   = MK[384..639]\nMSK    = MK[640..1151]\nEMSK   = MK[1152..1663]",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "Here [n..m] denotes the substring from bit n to m, including bits n and m. PRF' is a new pseudorandom function specified in Section 3.4. The first 1664 bits from its output are used for K_encr (encryption key, 128 bits), K_aut (authentication key, 256 bits), K_re (re-authentication key, 256 bits), MSK (Master Session Key, 512 bits), and EMSK (Extended Master Session Key, 512 bits). These keys are used by the subsequent EAP-AKA' process. K_encr is used by the AT_ENCR_DATA attribute, and K_aut by the AT_MAC attribute. K_re is used later in this section. MSK and EMSK are outputs from a successful EAP method run [RFC3748].",
      "ja": "ここで、[n..m]は、ビットnとmのビットnとmを含む部分文字列を表す。PRF 'はセクション3.4で指定された新しい疑似andom関数です。出力から最初の1664ビットは、K_ENCR（暗号化キー、128ビット）、K_AUT（認証キー、256ビット）、K_RE（再認証キー、256ビット）、MSK（マスターセッションキー、512ビット）に使用されます。EMSK（拡張マスターセッションキー、512ビット）。これらのキーは後続のEAP-AKAプロセスによって使用されます。K_encrは、AT_ENCR_DATA属性によって、at_mac属性によってK_AUTによって使用されます。このセクションでは後でK_REが使用されています。MSKとEMSKは、EAPメソッド実行[RFC3748]からの出力です。"
    },
    {
      "indent": 6,
      "text": "IK' and CK' are derived as specified in [TS-3GPP.33.402]. The functions that derive IK' and CK' take the following parameters: CK and IK produced by the AKA algorithm, and value of the Network Name field comes from the AT_KDF_INPUT attribute (without length or padding).",
      "ja": "IK 'とCK'は[TS-3GPP.33.402]に指定されているとおりに派生しています。IK 'とCK'を導出する関数は、AKAアルゴリズムによって生成されたCKとIK、およびネットワーク名フィールドの値は、at_kdf_input属性（長さまたはパディングなし）から来ています。"
    },
    {
      "indent": 6,
      "text": "The value \"EAP-AKA'\" is an eight-characters-long ASCII string. It is used as is, without any trailing NUL characters.",
      "ja": "値 \"EAP-AKA '\"は8文字のASCII文字列です。それは末尾のNUL文字なしで、そのまま使用されます。"
    },
    {
      "indent": 6,
      "text": "Identity is the peer identity as specified in Section 7 of [RFC4187] and in Section 5.3.2 of in this document for the 5G cases.",
      "ja": "IDは、[RFC4187]のセクション7のセクション7と5Gの場合は、このドキュメントのセクション5.3.2で指定されているピアIDです。"
    },
    {
      "indent": 6,
      "text": "When the server creates an AKA challenge and corresponding AUTN, CK, CK', IK, and IK' values, it MUST set the Authentication Management Field (AMF) separation bit to 1 in the AKA algorithm [TS-3GPP.33.102]. Similarly, the peer MUST check that the AMF separation bit is set to 1. If the bit is not set to 1, the peer behaves as if the AUTN had been incorrect and fails the authentication.",
      "ja": "サーバーがAKAチャレンジと対応するAUTN、CK、CK '、IK、およびIK'の値を作成すると、AKAアルゴリズム[TS-3GP.33.102]で認証管理フィールド（AMF）の分離ビットを1に設定する必要があります。同様に、ピアはAMF分離ビットが1に設定されていることを確認しなければなりません。ビットが1に設定されていない場合、ピアはAUTNが正しくないかのように動作し、認証に失敗します。"
    },
    {
      "indent": 6,
      "text": "On fast re-authentication, the following keys are calculated:",
      "ja": "高速再認証では、次のキーが計算されます。"
    },
    {
      "indent": 10,
      "text": "MK = PRF'(K_re,\"EAP-AKA' re-auth\"|Identity|counter|NONCE_S) MSK = MK[0..511] EMSK = MK[512..1023]",
      "ja": "MK = PRF '（K_RE、 \"EAP-AKA' Re-Auth\" | ID | CORNATION | NONCE_S）MSK = MK [0..511] EMSK = MK [512..1023]"
    },
    {
      "indent": 6,
      "text": "MSK and EMSK are the resulting 512-bit keys, taking the first 1024 bits from the result of PRF'. Note that K_encr and K_aut are not re-derived on fast re-authentication. K_re is the re-authentication key from the preceding full authentication and stays unchanged over any fast re-authentication(s) that may happen based on it. The value \"EAP-AKA' re-auth\" is a sixteen-characters-long ASCII string, again represented without any trailing NUL characters. Identity is the fast re-authentication identity, counter is the value from the AT_COUNTER attribute, NONCE_S is the nonce value from the AT_NONCE_S attribute, all as specified in Section 7 of [RFC4187]. To prevent the use of compromised keys in other places, it is forbidden to change the network name when going from the full to the fast re-authentication process. The peer SHOULD NOT attempt fast re-authentication when it knows that the network name in the current access network is different from the one in the initial, full authentication. Upon seeing a re-authentication request with a changed network name, the server SHOULD behave as if the re-authentication identifier had been unrecognized, and fall back to full authentication. The server observes the change in the name by comparing where the fast re-authentication and full authentication EAP transactions were received at the Authentication, Authorization, and Accounting (AAA) protocol level.",
      "ja": "MSKとEMSKは、PRFの結果から最初の1024ビットをとる512ビットキーです。 k_encrとk_autは高速再認証で再派生しません。 K_REは、前の全認証からの再認証キーで、それに基づいて発生する可能性がある高速再認証にわたって変更されずに留まります。値 \"EAP-AKA 'RE-AUTH\"は16文字のASCII文字列です。 IDは高速再認証IDです。カウンタはat_counter属性からの値です.Nonce_sは、[RFC4187]のセクション7で指定されているAT_NONCE_S属性からのNonce値です。他の場所で侵害されたキーの使用を防ぐために、フル再認証プロセスから高速再認証プロセスへ行くときにネットワーク名を変更することは禁止されています。現在のアクセスネットワーク内のネットワーク名が初期認証の1つと異なることを知っている場合、ピアは速い再認証を試みてはいけません。変更されたネットワーク名を使用して再認証要求を確認すると、サーバーは再認識されなかったかのように動作し、完全認証に戻ります。サーバーは、認証、承認、および会計（AAA）プロトコルレベルで、高速再認証とフル認証EAPトランザクションが受信された場所を比較することによって、名前の変更を監視します。"
    },
    {
      "indent": 3,
      "text": "AT_KDF has any other value Future variations of key derivation functions may be defined, and they will be represented by new values of AT_KDF. If the peer does not recognize the value, it cannot calculate the keys and behaves as explained in Section 3.2.",
      "ja": "AT_KDFには、将来の鍵導出機能の将来のバリエーションが定義されている可能性があり、それらはAT_KDFの新しい値で表されます。ピアが値を認識しない場合は、キーを計算できず、セクション3.2で説明されているように動作します。"
    },
    {
      "indent": 3,
      "text": "AT_KDF is missing The peer behaves as if the AUTN had been incorrect and MUST fail the authentication.",
      "ja": "AT_KDFが見つからないと、AUTNが正しくないかのようにピアが動作し、認証に失敗する必要があります。"
    },
    {
      "indent": 3,
      "text": "If the peer supports a given key derivation function but is unwilling to perform it for policy reasons, it refuses to calculate the keys and behaves as explained in Section 3.2.",
      "ja": "ピアが与えられたキー導出関数をサポートしているが、ポリシー上の理由から実行不要である場合は、セクション3.2で説明されているようにキーを計算して動作することを拒否します。"
    },
    {
      "indent": 0,
      "text": "3.4. Hash Functions",
      "section_title": true,
      "ja": "3.4. ハッシュ関数"
    },
    {
      "indent": 3,
      "text": "EAP-AKA' uses SHA-256 / HMAC-SHA-256, not SHA-1 / HMAC-SHA-1 (see [FIPS.180-4] and [RFC2104]) as in EAP-AKA. This requires a change to the pseudorandom function (PRF) as well as the AT_MAC and AT_CHECKCODE attributes.",
      "ja": "EAP-AKA 'は、EAP-AKAのようにSHA-1 / HMAC-SHA-1ではなくSHA-256 / HMAC-SHA-256（[FIPS.180-4]、[RFC2104]を参照）を使用しています。これには、asudorandom関数（PRF）とAT_MACおよびAT_CHECKCODE属性との変更が必要です。"
    },
    {
      "indent": 0,
      "text": "3.4.1. PRF'",
      "section_title": true,
      "ja": "3.4.1. PRF '"
    },
    {
      "indent": 3,
      "text": "The PRF' construction is the same one IKEv2 uses (see Section 2.13 of [RFC7296]; the definition of this function has not changed since [RFC4306], which was referenced by [RFC5448]). The function takes two arguments. K is a 256-bit value and S is a byte string of arbitrary length. PRF' is defined as follows:",
      "ja": "PRFの構造は同じIKEV2の使用です（[RFC7296]のセクション2.13を参照してください。[RFC5448]によって参照されていた[RFC4306]以降、この関数の定義は変更されていません。関数は2つの引数を取ります。kは256ビット値、sは任意の長さのバイト文字列です。PRF 'は次のように定義されています。"
    },
    {
      "indent": 3,
      "text": "PRF'(K,S) = T1 | T2 | T3 | T4 | ...",
      "ja": "PRF '（k、s）= t1 |T2 |T3 |T4 |..."
    },
    {
      "indent": 6,
      "text": "where: T1 = HMAC-SHA-256 (K, S | 0x01) T2 = HMAC-SHA-256 (K, T1 | S | 0x02) T3 = HMAC-SHA-256 (K, T2 | S | 0x03) T4 = HMAC-SHA-256 (K, T3 | S | 0x04) ...",
      "ja": "ここで、T1 = HMAC-SHA-256（k、s | 0x01）T2 = HMAC-SHA-256（K、T1 | 0x02）T3 = HMAC-SHA-256（K、T2 | S | 0x03）T4 =HMAC-SHA-256（K、T3 | S | 0x04）..."
    },
    {
      "indent": 3,
      "text": "PRF' produces as many bits of output as is needed. HMAC-SHA-256 is the application of HMAC [RFC2104] to SHA-256.",
      "ja": "PRF 'は必要なと同じくらい多くのビットの出力を生成します。HMAC-SHA-256は、HMAC [RFC2104]のSHA-256への応用です。"
    },
    {
      "indent": 0,
      "text": "3.4.2. AT_MAC",
      "section_title": true,
      "ja": "3.4.2. at_mac."
    },
    {
      "indent": 3,
      "text": "When used within EAP-AKA', the AT_MAC attribute is changed as follows. The MAC algorithm is HMAC-SHA-256-128, a keyed hash value. The HMAC-SHA-256-128 value is obtained from the 32-byte HMAC-SHA-256 value by truncating the output to the first 16 bytes. Hence, the length of the MAC is 16 bytes.",
      "ja": "EAP-AKA '内で使用すると、AT_MAC属性は次のように変更されます。MACアルゴリズムは、キー付きハッシュ値であるHMAC-SHA-256-128です。HMAC-SHA-256-128値は、出力を最初の16バイトに切り捨てることによって32バイトのHMAC-SHA-256値から取得されます。したがって、MACの長さは16バイトです。"
    },
    {
      "indent": 3,
      "text": "Otherwise, the use of AT_MAC in EAP-AKA' follows Section 10.15 of [RFC4187].",
      "ja": "それ以外の場合は、EAP-AKAのAT_MACの使用は[RFC4187]のセクション10.15に続きます。"
    },
    {
      "indent": 0,
      "text": "3.4.3. AT_CHECKCODE",
      "section_title": true,
      "ja": "3.4.3. at_checkCode."
    },
    {
      "indent": 3,
      "text": "When used within EAP-AKA', the AT_CHECKCODE attribute is changed as follows. First, a 32-byte value is needed to accommodate a 256-bit hash output:",
      "ja": "EAP-AKA '内で使用すると、AT_CHECKCODE属性は次のように変更されます。まず、256ビットハッシュ出力に対応するために32バイトの値が必要です。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n| AT_CHECKCODE  | Length        |           Reserved            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                                                               |\n|                     Checkcode (0 or 32 bytes)                 |\n|                                                               |\n|                                                               |\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Second, the checkcode is a hash value, calculated with SHA-256 [FIPS.180-4], over the data specified in Section 10.13 of [RFC4187].",
      "ja": "第二に、CheckCodeは、[RFC4187]のセクション10.13で指定されたデータに対して、SHA-256 [FIPS.180-4]で計算されたハッシュ値です。"
    },
    {
      "indent": 0,
      "text": "3.5. Summary of Attributes for EAP-AKA'",
      "section_title": true,
      "ja": "3.5. EAP-AKAの属性の概要"
    },
    {
      "indent": 3,
      "text": "Table 1 identifies which attributes may be found in which kinds of messages, and in what quantity.",
      "ja": "表1は、どの属性がどの種類のメッセージで見つかったか、およびどの属性を示している可能性があります。"
    },
    {
      "indent": 3,
      "text": "Messages are denoted with numbers as follows:",
      "ja": "メッセージは次のように番号で示されます。"
    },
    {
      "indent": 3,
      "text": "1 EAP-Request/AKA-Identity",
      "ja": "1 EAP-REQUEST / AKA-ID"
    },
    {
      "indent": 3,
      "text": "2 EAP-Response/AKA-Identity",
      "ja": "2 EAP応答/ AKA-ID"
    },
    {
      "indent": 3,
      "text": "3 EAP-Request/AKA-Challenge",
      "ja": "3 EAP-REQUEST / AKAチャレンジ"
    },
    {
      "indent": 3,
      "text": "4 EAP-Response/AKA-Challenge",
      "ja": "4 EAP対応/ AKAチャレンジ"
    },
    {
      "indent": 3,
      "text": "5 EAP-Request/AKA-Notification",
      "ja": "5 EAP-REQUEST / AKA通知"
    },
    {
      "indent": 3,
      "text": "6 EAP-Response/AKA-Notification",
      "ja": "6 EAP応答/赤目通知"
    },
    {
      "indent": 3,
      "text": "7 EAP-Response/AKA-Client-Error",
      "ja": "7 EAPレスポンス/ AKAクライアントエラー"
    },
    {
      "indent": 3,
      "text": "8 EAP-Request/AKA-Reauthentication",
      "ja": "8 EAP-REQUEST / AKA-REAUTHENTICATIONS"
    },
    {
      "indent": 3,
      "text": "9 EAP-Response/AKA-Reauthentication",
      "ja": "9 EAP応答/赤血再認証"
    },
    {
      "indent": 3,
      "text": "10 EAP-Response/AKA-Authentication-Reject",
      "ja": "10 EAP対応/ AKA認証拒否"
    },
    {
      "indent": 3,
      "text": "11 EAP-Response/AKA-Synchronization-Failure",
      "ja": "11 EAP応答/ AKA同期障害"
    },
    {
      "indent": 3,
      "text": "The column denoted with \"E\" indicates whether the attribute is a nested attribute that MUST be included within AT_ENCR_DATA.",
      "ja": "「e」で示される列は、属性がAT_ENCR_DATA内に含まれなければならないネストされた属性であるかどうかを示します。"
    },
    {
      "indent": 3,
      "text": "In addition, the numbered columns indicate the quantity of the attribute within the message as follows:",
      "ja": "さらに、番号付き列は、メッセージ内の属性の数量を次のように示しています。"
    },
    {
      "indent": 3,
      "text": "\"0\" Indicates that the attribute MUST NOT be included in the message.",
      "ja": "\"0\"は、属性がメッセージに含まれていないことを示します。"
    },
    {
      "indent": 3,
      "text": "\"1\" Indicates that the attribute MUST be included in the message.",
      "ja": "\"1\"は属性がメッセージに含める必要があることを示します。"
    },
    {
      "indent": 3,
      "text": "\"0-1\" Indicates that the attribute is sometimes included in the message",
      "ja": "\"0-1\"属性がメッセージに含まれることがあることを示します"
    },
    {
      "indent": 3,
      "text": "\"0+\" Indicates that zero or more copies of the attribute MAY be included in the message.",
      "ja": "「0」は、属性の0個以上のコピーをメッセージに含めることができることを示す。"
    },
    {
      "indent": 3,
      "text": "\"1+\" Indicates that there MUST be at least one attribute in the message but more than one MAY be included in the message.",
      "ja": "「1」は、メッセージ内に少なくとも1つの属性がなければならないが、メッセージに複数を含めることができることを示す。"
    },
    {
      "indent": 3,
      "text": "\"0*\" Indicates that the attribute is not included in the message in cases specified in this document, but MAY be included in the future versions of the protocol.",
      "ja": "「0 *」は、この文書で指定された場合に属性がメッセージに含まれていないことを示しますが、将来のプロトコルのバージョンに含まれている可能性があります。"
    },
    {
      "indent": 3,
      "text": "The attribute table is shown below. The table is largely the same as in the EAP-AKA attribute table ([RFC4187], Section 10.1), but changes how many times AT_MAC may appear in an EAP-Response/AKA'-Challenge message as it does not appear there when AT_KDF has to be sent from the peer to the server. The table also adds the AT_KDF and AT_KDF_INPUT attributes.",
      "ja": "属性テーブルを以下に示します。この表は、EAP-AKA属性テーブル（[RFC4187]、セクション10.1）とほとんど同じですが、AT_KDFのときに表示されないように、AT_MACがEAP-Response / Aka'-Challengeメッセージに何回表示されるかを変更します。ピアからサーバーに送信する必要があります。この表は、at_kdfとat_kdf_input属性を追加します。"
    },
    {
      "indent": 3,
      "text": "+======================+===+===+===+===+===+===+=+====+=====+==+==+=+\n| Attribute            |1  |2  |3  |4  |5  |6  |7|8   | 9   |10|11|E|\n+======================+===+===+===+===+===+===+=+====+=====+==+==+=+\n| AT_PERMANENT_ID_REQ  |0-1|0  |0  |0  |0  |0  |0|0   | 0   |0 |0 |N|\n+----------------------+---+---+---+---+---+---+-+----+-----+--+--+-+\n| AT_ANY_ID_REQ        |0-1|0  |0  |0  |0  |0  |0|0   | 0   |0 |0 |N|\n+----------------------+---+---+---+---+---+---+-+----+-----+--+--+-+\n| AT_FULLAUTH_ID_REQ   |0-1|0  |0  |0  |0  |0  |0|0   | 0   |0 |0 |N|\n+----------------------+---+---+---+---+---+---+-+----+-----+--+--+-+\n| AT_IDENTITY          |0  |0-1|0  |0  |0  |0  |0|0   | 0   |0 |0 |N|\n+----------------------+---+---+---+---+---+---+-+----+-----+--+--+-+\n| AT_RAND              |0  |0  |1  |0  |0  |0  |0|0   | 0   |0 |0 |N|\n+----------------------+---+---+---+---+---+---+-+----+-----+--+--+-+\n| AT_AUTN              |0  |0  |1  |0  |0  |0  |0|0   | 0   |0 |0 |N|\n+----------------------+---+---+---+---+---+---+-+----+-----+--+--+-+\n| AT_RES               |0  |0  |0  |1  |0  |0  |0|0   | 0   |0 |0 |N|\n+----------------------+---+---+---+---+---+---+-+----+-----+--+--+-+\n| AT_AUTS              |0  |0  |0  |0  |0  |0  |0|0   | 0   |0 |1 |N|\n+----------------------+---+---+---+---+---+---+-+----+-----+--+--+-+\n| AT_NEXT_PSEUDONYM    |0  |0  |0-1|0  |0  |0  |0|0   | 0   |0 |0 |Y|\n+----------------------+---+---+---+---+---+---+-+----+-----+--+--+-+\n| AT_NEXT_REAUTH_ID    |0  |0  |0-1|0  |0  |0  |0|0-1 | 0   |0 |0 |Y|\n+----------------------+---+---+---+---+---+---+-+----+-----+--+--+-+\n| AT_IV                |0  |0  |0-1|0* |0-1|0-1|0|1   | 1   |0 |0 |N|\n+----------------------+---+---+---+---+---+---+-+----+-----+--+--+-+\n| AT_ENCR_DATA         |0  |0  |0-1|0* |0-1|0-1|0|1   | 1   |0 |0 |N|\n+----------------------+---+---+---+---+---+---+-+----+-----+--+--+-+\n| AT_PADDING           |0  |0  |0-1|0* |0-1|0-1|0|0-1 | 0-1 |0 |0 |Y|\n+----------------------+---+---+---+---+---+---+-+----+-----+--+--+-+\n| AT_CHECKCODE         |0  |0  |0-1|0-1|0  |0  |0|0-1 | 0-1 |0 |0 |N|\n+----------------------+---+---+---+---+---+---+-+----+-----+--+--+-+\n| AT_RESULT_IND        |0  |0  |0-1|0-1|0  |0  |0|0-1 | 0-1 |0 |0 |N|\n+----------------------+---+---+---+---+---+---+-+----+-----+--+--+-+\n| AT_MAC               |0  |0  |1  |0-1|0-1|0-1|0|1   | 1   |0 |0 |N|\n+----------------------+---+---+---+---+---+---+-+----+-----+--+--+-+\n| AT_COUNTER           |0  |0  |0  |0  |0-1|0-1|0|1   | 1   |0 |0 |Y|\n+----------------------+---+---+---+---+---+---+-+----+-----+--+--+-+\n| AT_COUNTER_TOO_SMALL |0  |0  |0  |0  |0  |0  |0|0   | 0-1 |0 |0 |Y|\n+----------------------+---+---+---+---+---+---+-+----+-----+--+--+-+\n| AT_NONCE_S           |0  |0  |0  |0  |0  |0  |0|1   | 0   |0 |0 |Y|\n+----------------------+---+---+---+---+---+---+-+----+-----+--+--+-+\n| AT_NOTIFICATION      |0  |0  |0  |0  |1  |0  |0|0   | 0   |0 |0 |N|\n+----------------------+---+---+---+---+---+---+-+----+-----+--+--+-+\n| AT_CLIENT_ERROR_CODE |0  |0  |0  |0  |0  |0  |1|0   | 0   |0 |0 |N|\n+----------------------+---+---+---+---+---+---+-+----+-----+--+--+-+\n| AT_KDF               |0  |0  |1+ |0+ |0  |0  |0|0   | 0   |0 |1+|N|\n+----------------------+---+---+---+---+---+---+-+----+-----+--+--+-+\n| AT_KDF_INPUT         |0  |0  |1  |0  |0  |0  |0|0   | 0   |0 |0 |N|\n+----------------------+---+---+---+---+---+---+-+----+-----+--+--+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 24,
      "text": "Table 1: The Attribute Table",
      "ja": "表1：属性テーブル"
    },
    {
      "indent": 0,
      "text": "4. Bidding Down Prevention for EAP-AKA",
      "section_title": true,
      "ja": "4. EAP-AKAのための入札停止防止"
    },
    {
      "indent": 3,
      "text": "As discussed in [RFC3748], negotiation of methods within EAP is insecure. That is, a man-in-the-middle attacker may force the endpoints to use a method that is not the strongest that they both support. This is a problem, as we expect EAP-AKA and EAP-AKA' to be negotiated via EAP.",
      "ja": "[RFC3748]で説明したように、EAP内のメソッドのネゴシエーションは安全です。すなわち、中間攻撃者は、エンドポイントに、両方のサポートが最も強くはない方法を使用することができます。これは、EAP-AKAとEAP-AKA 'がEAPを介してネゴシエートされることを期待しているため、問題です。"
    },
    {
      "indent": 3,
      "text": "In order to prevent such attacks, this RFC specifies a mechanism for EAP-AKA that allows the endpoints to securely discover the capabilities of each other. This mechanism comes in the form of the AT_BIDDING attribute. This allows both endpoints to communicate their desire and support for EAP-AKA' when exchanging EAP-AKA messages. This attribute is not included in EAP-AKA' messages. It is only included in EAP-AKA messages, which are protected with the AT_MAC attribute. This approach is based on the assumption that EAP-AKA' is always preferable (see Section 7). If during the EAP-AKA authentication process it is discovered that both endpoints would have been able to use EAP-AKA', the authentication process SHOULD be aborted, as a bidding down attack may have happened.",
      "ja": "このような攻撃を防ぐために、このRFCはエンドポイントが互いの機能を安全に発見できるようにするEAP-AKAのメカニズムを指定します。このメカニズムは、at_bidding属性の形式です。これにより、EAP-AKAメッセージを交換するときに、両方のエンドポイントはEAP-AKAの要求とサポートを伝達することができます。この属性はEAP-AKAのメッセージには含まれていません。AT_MAC属性で保護されているEAP-AKAメッセージにのみ含まれています。このアプローチは、EAP-AKA 'が常に好ましいという仮定に基づいています（セクション7を参照）。EAP-AKA認証プロセス中に両方のエンドポイントがEAP-AKAを使用できることが発見された場合、入札ダウン攻撃が発生した可能性があるため、認証プロセスは中止されるべきです。"
    },
    {
      "indent": 3,
      "text": "The format of the AT_BIDDING attribute is shown below.",
      "ja": "at_bidding属性のフォーマットを以下に示します。"
    },
    {
      "indent": 6,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n| AT_BIDDING    | Length        |D|          Reserved           |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The fields are as follows:",
      "ja": "フィールドは次のとおりです。"
    },
    {
      "indent": 3,
      "text": "AT_BIDDING This is set to 136.",
      "ja": "at_biddingこれは136に設定されています。"
    },
    {
      "indent": 3,
      "text": "Length The length of the attribute, calculated as defined in [RFC4187], Section 8.1. For AT_BIDDING, the Length MUST be set to 1.",
      "ja": "長さ属性の長さは、[RFC4187]、セクション8.1で定義されているように計算されます。at_biddingの場合、長さは1に設定する必要があります。"
    },
    {
      "indent": 3,
      "text": "D This bit is set to 1 if the sender supports EAP-AKA', is willing to use it, and prefers it over EAP-AKA. Otherwise, it should be set to zero.",
      "ja": "dこのビットは、送信者がEAP-AKAをサポートしている場合は1に設定されていますが、それを使用しても構わないと思っています。それ以外の場合は、ゼロに設定する必要があります。"
    },
    {
      "indent": 3,
      "text": "Reserved This field MUST be set to zero when sent and ignored on receipt.",
      "ja": "予約済みこのフィールドは、送信時に送信され、受信時に無視されたときにゼロに設定する必要があります。"
    },
    {
      "indent": 3,
      "text": "The server sends this attribute in the EAP-Request/AKA-Challenge message. If the peer supports EAP-AKA', it compares the received value to its own capabilities. If it turns out that both the server and peer would have been able to use EAP-AKA' and preferred it over EAP-AKA, the peer behaves as if AUTN had been incorrect and fails the authentication (see Figure 3 of [RFC4187]). A peer not supporting EAP-AKA' will simply ignore this attribute. In all cases, the attribute is protected by the integrity mechanisms of EAP-AKA, so it cannot be removed by a man-in-the-middle attacker.",
      "ja": "サーバーはこの属性をEAP-Request / AKAチャレンジメッセージに送信します。ピアがEAP-AKA 'をサポートしている場合、それは受信した値をそれ自身の機能と比較します。サーバーとピアの両方がEAP-AKAを使用してEAP-AKAを介して推奨されていることが判明した場合、PeerはAUTNが正しくないかのように動作し、認証に失敗します（[RFC4187]の図3を参照）。。EAP-AKAをサポートしていないピアは、単にこの属性を無視します。すべての場合において、属性はEAP-AKAの整合性メカニズムによって保護されているため、中間攻撃者によって削除することはできません。"
    },
    {
      "indent": 3,
      "text": "Note that we assume (Section 7) that EAP-AKA' is always stronger than EAP-AKA. As a result, this specification does not provide protection against bidding \"down\" attacks in the other direction, i.e., attackers forcing the endpoints to use EAP-AKA'.",
      "ja": "EAP-AKA 'がEAP-AKAよりも常に強いと仮定する（セクション7）。結果として、この仕様は、他の方向、すなわちEAP  -  AKAを使用するためにエンドポイントを強制する攻撃者に「ダウン」攻撃を入札することに対する保護を提供しない。"
    },
    {
      "indent": 0,
      "text": "4.1. Summary of Attributes for EAP-AKA",
      "section_title": true,
      "ja": "4.1. EAP-AKAの属性の概要"
    },
    {
      "indent": 3,
      "text": "The appearance of the AT_BIDDING attribute in EAP-AKA exchanges is shown below, using the notation from Section 3.5:",
      "ja": "EAP-AKA交換におけるAT_BIDDING属性の外観は、3.5項からの表記を使用して、以下に示されています。"
    },
    {
      "indent": 5,
      "text": "+============+===+===+===+===+===+===+===+===+===+====+====+===+\n| Attribute  | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9 | 10 | 11 | E |\n+============+===+===+===+===+===+===+===+===+===+====+====+===+\n| AT_BIDDING | 0 | 0 | 1 | 0 | 0 | 0 | 0 | 0 | 0 | 0  | 0  | N |\n+------------+---+---+---+---+---+---+---+---+---+----+----+---+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 17,
      "text": "Table 2: AT_BIDDING Attribute Appearance",
      "ja": "表2：at_bidding属性の外観"
    },
    {
      "indent": 0,
      "text": "5. Peer Identities",
      "section_title": true,
      "ja": "5. ピアアイデンティティ"
    },
    {
      "indent": 3,
      "text": "EAP-AKA' peer identities are as specified in [RFC4187], Section 4.1, with the addition of some requirements specified in this section.",
      "ja": "EAP-AKAのピアIDは、[RFC4187]、セクション4.1で指定されているとおりです。"
    },
    {
      "indent": 3,
      "text": "EAP-AKA' includes optional identity privacy support that can be used to hide the cleartext permanent identity and thereby make the subscriber's EAP exchanges untraceable to eavesdroppers. EAP-AKA' can also use the privacy-friendly identifiers specified for 5G networks.",
      "ja": "EAP-AKA 'には、クリアテキストの永続的アイデンティティを隠すために使用できるオプションのIDプライバシーサポートを含み、それによって加入者のEAPの交換を盗聴者に追いやらせることができます。EAP-AKA 'は、5Gネットワーズに指定されているプライバシーに優しい識別子を使用できます。"
    },
    {
      "indent": 3,
      "text": "The permanent identity is usually based on the IMSI. Exposing the IMSI is undesirable because, as a permanent identity, it is easily trackable. In addition, since IMSIs may be used in other contexts as well, there would be additional opportunities for such tracking.",
      "ja": "恒久的なアイデンティティは通常IMSIに基づいています。IMSIを露光することは、恒久的なアイデンティティとして、それが容易に追跡可能であるため、望ましくない。さらに、IMSIは他の文脈でも使用され得るので、そのような追跡のための追加の機会があるでしょう。"
    },
    {
      "indent": 3,
      "text": "In EAP-AKA', identity privacy is based on temporary usernames or pseudonym usernames. These are similar to, but separate from, the Temporary Mobile Subscriber Identities (TMSI) that are used on cellular networks.",
      "ja": "EAP-AKA 'では、Identity Privacyは一時的なユーザー名またはPSeudonのユーザー名に基づいています。これらは、セルラーネットワークで使用される一時的なモバイル加入者ID（TMSI）と似ています。"
    },
    {
      "indent": 0,
      "text": "5.1. Username Types in EAP-AKA' Identities",
      "section_title": true,
      "ja": "5.1. EAP-AKAのアイデンティティのユーザー名型"
    },
    {
      "indent": 3,
      "text": "Section 4.1.1.3 of [RFC4187] specifies that there are three types of usernames: permanent, pseudonym, and fast re-authentication usernames. This specification extends this definition as follows. There are four types of usernames:",
      "ja": "[RFC4187]のセクション4.1.1.3 [RFC4187]は、永続的な、仮名、および高速再認証のユーザー名の3種類のユーザー名があることを指定します。この仕様は次のようにこの定義を拡張します。ユーザー名には4種類あります。"
    },
    {
      "indent": 3,
      "text": "(1) Regular usernames. These are external names given to EAP-AKA' peers. The regular usernames are further subdivided into to categories:",
      "ja": "(1) 通常のユーザー名これらはEAP-AKAのピアに与えられた外部名です。通常のユーザー名はさらにカテゴリに分類されています。"
    },
    {
      "indent": 8,
      "text": "(a) Permanent usernames, for instance, IMSI-based usernames.",
      "ja": "(a) 例えば、IMSIベースのユーザ名については、恒久的なユーザ名。"
    },
    {
      "indent": 8,
      "text": "(b) Privacy-friendly temporary usernames, for instance, 5G GUTI (5G Globally Unique Temporary Identifier) or 5G privacy identifiers (see Section 5.3.2) such as SUCI (Subscription Concealed Identifier).",
      "ja": "(b) プライバシーにやさしい一時的なユーザー名、たとえば、5G GUTI（5Gグローバルに固有の一時識別子）または5Gプライバシー識別子（Suci（Subscription ConceAred Identifier）を参照）。"
    },
    {
      "indent": 3,
      "text": "(2) EAP-AKA' pseudonym usernames. For example, 2s7ah6n9q@example.com might be a valid pseudonym identity. In this example, 2s7ah6n9q is the pseudonym username.",
      "ja": "(2) EAP-AKAの仮説ユーザー名。たとえば、2S7AH6N9Q@example.comは有効な仮名IDである可能性があります。この例では、2S7AH6N9Qはpseudonym usernameです。"
    },
    {
      "indent": 3,
      "text": "(3) EAP-AKA' fast re-authentication usernames. For example, 43953754@example.com might be a valid fast re-authentication identity and 43953754 the fast re-authentication username.",
      "ja": "(3) EAP-AKAの高速再認証ユーザ名。たとえば、43953754@example.comは有効な高速再認証IDと43953754で、高速再認証ユーザー名である可能性があります。"
    },
    {
      "indent": 3,
      "text": "The permanent, privacy-friendly temporary, and pseudonym usernames are only used with full authentication, and fast re-authentication usernames only with fast re-authentication. Unlike permanent usernames and pseudonym usernames, privacy-friendly temporary usernames and fast re-authentication usernames are one-time identifiers, which are not reused across EAP exchanges.",
      "ja": "恒久的なプライバシーにやさしい一時的な一時的な、および仮名のユーザー名は、フル認証でのみ使用され、高速再認証でのみ高速再認証ユーザー名が使用されます。恒久的なユーザ名と仮名のユーザ名とは異なり、プライバシーに優しい一時的なユーザ名と高速再認証ユーザ名は1時間識別子であり、これはEAP交換機で再利用されません。"
    },
    {
      "indent": 0,
      "text": "5.2. Generating Pseudonyms and Fast Re-Authentication Identities",
      "section_title": true,
      "ja": "5.2. 擬似文字と高速再認証IDの生成"
    },
    {
      "indent": 3,
      "text": "This section provides some additional guidance to implementations for producing secure pseudonyms and fast re-authentication identities. It does not impact backwards compatibility because each server consumes only the identities that it generates itself. However, adherence to the guidance will provide better security.",
      "ja": "このセクションでは、安全な仮名と高速再認証アイデンティティを作成するための実装に対する追加のガイダンスを提供します。各サーバーはそれがそれ自身を生成するIDだけを消費するため、後方互換性に影響を与えません。しかし、ガイダンスへの遵守はより良いセキュリティを提供します。"
    },
    {
      "indent": 3,
      "text": "As specified by [RFC4187], Section 4.1.1.7, pseudonym usernames and fast re-authentication identities are generated by the EAP server in an implementation-dependent manner. RFC 4187 provides some general requirements on how these identities are transported, how they map to the NAI syntax, how they are distinguished from each other, and so on.",
      "ja": "[RFC4187]、セクション4.1.1.7で指定されているように、Pseudonymのユーザー名と高速再認証IDは、実装に依存してEAPサーバーによって生成されます。RFC 4187は、これらのアイデンティティがどのように転送されるか、それらがNAIの構文にどのようにマッピングされるかについての一般的な要件を提供します。"
    },
    {
      "indent": 3,
      "text": "However, to enhance privacy, some additional requirements need to be applied.",
      "ja": "ただし、プライバシーを強化するために、追加の要件をいくつか適用する必要があります。"
    },
    {
      "indent": 3,
      "text": "The pseudonym usernames and fast re-authentication identities MUST be generated in a cryptographically secure way so that it is computationally infeasible for an attacker to differentiate two identities belonging to the same user from two identities belonging to different users. This can be achieved, for instance, by using random or pseudorandom identifiers such as random byte strings or ciphertexts. See also [RFC4086] for guidance on random number generation.",
      "ja": "PSeudonymのユーザー名と高速再認証IDは、暗号的に安全な方法で生成されなければなりませんので、攻撃者が異なるユーザーに属する2つの識別情報と同じユーザーに属する2つの識別を区別することができます。これは、例えば、ランダムバイト文字列または暗号文などのランダムまたは擬似乱数識別子を使用することによって達成することができる。乱数生成に関するガイダンスについては、「RFC4086」も参照してください。"
    },
    {
      "indent": 3,
      "text": "Note that the pseudonym and fast re-authentication usernames also MUST NOT include substrings that can be used to relate the username to a particular entity or a particular permanent identity. For instance, the usernames cannot include any subscriber-identifying part of an IMSI or other permanent identifier. Similarly, no part of the username can be formed by a fixed mapping that stays the same across multiple different pseudonyms or fast re-authentication identities for the same subscriber.",
      "ja": "仮名および高速再認証のユーザ名もまた、ユーザ名を特定のエンティティまたは特定の永続的アイデンティティに関連付けるために使用できる部分文字列を含み込まれてはならないことに注意してください。例えば、ユーザ名は、IMSIまたは他の永久識別子の加入者識別部分を含めることはできない。同様に、ユーザ名の一部は、同じ加入者に対して複数の異なる仮名または高速再認証IDにまたがって同じになる固定マッピングによって形成することができる。"
    },
    {
      "indent": 3,
      "text": "When the identifier used to identify a subscriber in an EAP-AKA' authentication exchange is a privacy-friendly identifier that is used only once, the EAP-AKA' peer MUST NOT use a pseudonym provided in that authentication exchange in subsequent exchanges more than once. To ensure that this does not happen, the EAP-AKA' server MAY decline to provide a pseudonym in such authentication exchanges. An important case where such privacy-friendly identifiers are used is in 5G networks (see Section 5.3).",
      "ja": "EAP-AKAの認証Exchangeでサブスクライバを識別するために使用される識別子が1回だけ使用されているプライバシーに優しい識別子である場合、EAP-AKAのピアは、その後の交換に複数回交換しているという認証交換で提供されてはいけません。。これが起こらないことを確認するために、EAP-AKAのサーバーはそのような認証交換に疑似値を提供することができます。そのようなプライバシーにやさしい識別子が使用される重要な場合は、5Gネットワーティングです（セクション5.3を参照）。"
    },
    {
      "indent": 0,
      "text": "5.3. Identifier Usage in 5G",
      "section_title": true,
      "ja": "5.3. 5gの識別子の使用"
    },
    {
      "indent": 3,
      "text": "In EAP-AKA', the peer identity may be communicated to the server in one of three ways:",
      "ja": "EAP-AKA 'では、ピアアイデンティティは3つの方法のいずれかでサーバーに伝達される可能性があります。"
    },
    {
      "indent": 3,
      "text": "* As a part of link-layer establishment procedures, externally to EAP.",
      "ja": "* リンクレイヤ確立手順の一部として、EAPの外部から。"
    },
    {
      "indent": 3,
      "text": "* With the EAP-Response/Identity message in the beginning of the EAP exchange, but before the selection of EAP-AKA'.",
      "ja": "* EAP-AKAの選択前に、EAP-Response / IdentityメッセージがEAP-AKAの選択前に。"
    },
    {
      "indent": 3,
      "text": "* Transmitted from the peer to the server using EAP-AKA' messages instead of EAP-Response/Identity. In this case, the server includes an identity-requesting attribute (AT_ANY_ID_REQ, AT_FULLAUTH_ID_REQ, or AT_PERMANENT_ID_REQ) in the EAP-Request/ AKA-Identity message, and the peer includes the AT_IDENTITY attribute, which contains the peer's identity, in the EAP-Response/AKA-Identity message.",
      "ja": "* EAP-Response / Identityの代わりにEAP-AKA 'メッセージを使用してピアからサーバーに送信されます。この場合、サーバは、EAP要求/ AKA IDメッセージ内の識別要求属性（at_any_id_req、at_fullauth_id_req、またはat_permanent_id_req）を含み、ピアにはat_identity属性が入力され、これにはピアの識別情報が入ります。/ AKA-IDメッセージ。"
    },
    {
      "indent": 3,
      "text": "The identity carried above may be a permanent identity, privacy-friendly identity, pseudonym identity, or fast re-authentication identity as defined in Section 5.1.",
      "ja": "上記のアイデンティティは、セクション5.1で定義されているように、恒久的なアイデンティティ、プライバシーに優しいID、仮名ID、または高速再認証IDです。"
    },
    {
      "indent": 3,
      "text": "5G supports the concept of privacy identifiers, and it is important for interoperability that the right type of identifier is used.",
      "ja": "5Gはプライバシー識別子の概念をサポートしており、相互運用性にとっては、正しいタイプの識別子が使用されていることが重要です。"
    },
    {
      "indent": 3,
      "text": "5G defines the SUbscription Permanent Identifier (SUPI) and SUbscription Concealed Identifier (SUCI) [TS-3GPP.23.501] [TS-3GPP.33.501] [TS-3GPP.23.003]. SUPI is globally unique and allocated to each subscriber. However, it is only used internally in the 5G network and is privacy sensitive. The SUCI is a privacy-preserving identifier containing the concealed SUPI, using public key cryptography to encrypt the SUPI.",
      "ja": "5Gは購読永久識別子（SUPI）とサブスクリプション秘匿識別子（SUCI）[TS-3GPP.23.501] [TS-3GPP.33.501] [TS-3GPP.23.003]を定義します。SUPIはグローバルにユニークで、各加入者に割り当てられています。ただし、5Gネットワークでの内部的にのみ使用され、プライバシーに敏感です。SUCIは、SUPIを暗号化するために公開鍵暗号を使用して、隠されたSUPIを含むプライバシー保存識別子です。"
    },
    {
      "indent": 3,
      "text": "Given the choice between these two types of identifiers, EAP-AKA' ensures interoperability as follows:",
      "ja": "これら2つのタイプの識別子間の選択を考えると、EAP-AKA 'は次のように相互運用性を保証します。"
    },
    {
      "indent": 3,
      "text": "* Where identifiers are used within EAP-AKA' (such as key derivation) determine the exact values of the identity to be used, to avoid ambiguity (see Section 5.3.1).",
      "ja": "* 識別子がEAP-AKA内（キー導出など）内で使用されている場合は、あいまいさを避けるために使用するIDの正確な値を決定します（5.3.1項を参照）。"
    },
    {
      "indent": 3,
      "text": "* Where identifiers are carried within EAP-AKA' packets (such as in the AT_IDENTITY attribute) determine which identifiers should be filled in (see Section 5.3.2).",
      "ja": "* 識別子がEAP-AKAのパケット内（at_identity属性など）内で運ばれる場合は、どの識別子を入力する必要があるかを決定します（セクション5.3.2を参照）。"
    },
    {
      "indent": 3,
      "text": "In 5G, the normal mode of operation is that identifiers are only transmitted outside EAP. However, in a system involving terminals from many generations and several connectivity options via 5G and other mechanisms, implementations and the EAP-AKA' specification need to prepare for many different situations, including sometimes having to communicate identities within EAP.",
      "ja": "5Gでは、通常の動作モードは識別子がEAP外部に送信されるだけであることです。ただし、多くの世代からのターミナルを含むシステムでは、5Gやその他のメカニズムと他のメカニズム、およびEAP-AKAの仕様は、EAP内でIDを通信する必要があるさまざまな状況に準備する必要があります。"
    },
    {
      "indent": 3,
      "text": "The following sections clarify which identifiers are used and how.",
      "ja": "次のセクションでは、どの識別子が使用されているか、およびどのようにしています。"
    },
    {
      "indent": 0,
      "text": "5.3.1. Key Derivation",
      "section_title": true,
      "ja": "5.3.1. キー派生"
    },
    {
      "indent": 3,
      "text": "In EAP-AKA', the peer identity is used in the key derivation formula found in Section 3.3.",
      "ja": "EAP-AKA 'では、ピア識別情報はセクション3.3で見つかったキー導出式で使用されます。"
    },
    {
      "indent": 3,
      "text": "The identity needs to be represented in exactly the correct format for the key derivation formula to produce correct results.",
      "ja": "正しい結果を生み出すために、鍵導出式の正確に正しい形式で表す必要があります。"
    },
    {
      "indent": 3,
      "text": "If the AT_KDF_INPUT parameter contains the prefix \"5G:\", the AT_KDF parameter has the value 1, and this authentication is not a fast re-authentication, then the peer identity used in the key derivation MUST be as specified in Annex F.3 of [TS-3GPP.33.501] and Clause 2.2 of [TS-3GPP.23.003]. This is in contrast to [RFC5448], which uses the identity as communicated in EAP and represented as a NAI. Also, in contrast to [RFC5448], in 5G EAP-AKA' does not use the \"0\" nor the \"6\" prefix in front of the identifier.",
      "ja": "at_kdf_inputパラメータに接頭辞 \"5g：\"が含まれている場合、at_kdfパラメータは値1を持ち、この認証は高速再認証ではありません。鍵導出で使用されているピア識別情報は、の附属書F.3で指定されている必要があります。[TS-3GPP.33.501]および[TS-3GPP.23.003]の条項2.2。これは[RFC5448]とは対照的です。これはEAPで通信され、NAIとして表されているIDを使用します。また、[RFC5448]とは対照的に、識別子の前に「0」も「6」の接頭辞を使用しない。"
    },
    {
      "indent": 3,
      "text": "For an example of the format of the identity, see Clause 2.2 of [TS-3GPP.23.003].",
      "ja": "IDの形式の例については、[TS-3GPP.23.003]の2.2項を参照してください。"
    },
    {
      "indent": 3,
      "text": "In all other cases, the following applies:",
      "ja": "他のすべての場合では、次のような適用が適用されます。"
    },
    {
      "indent": 9,
      "text": "The identity used in the key derivation formula MUST be exactly the one sent in the EAP-AKA' AT_IDENTITY attribute, if one was sent, regardless of the kind of identity that it may have been. If no AT_IDENTITY was sent, the identity MUST be exactly the one sent in the generic EAP Identity exchange, if one was made.",
      "ja": "鍵導出式で使用されている身元は、それがあった可能性がある可能性のある種類の種類に関係なく、EAP-AKA 'at_identity属性で送信されたものでなければなりません。AT_IDENTITYが送信されなかった場合、IDは汎用EAP ID Exchangeで送信されたものでなければなりません。"
    },
    {
      "indent": 9,
      "text": "If no identity was communicated inside EAP, then the identity is the one communicated outside EAP in link-layer messaging.",
      "ja": "EAP内でIDが通信されなかった場合、IDはリンクレイヤメッセージングのEAPの1つのEAPである。"
    },
    {
      "indent": 9,
      "text": "In this case, the used identity MUST be the identity most recently communicated by the peer to the network, again regardless of what type of identity it may have been.",
      "ja": "この場合、使用されているアイデンティティは、どのタイプのアイデンティティに関係なく、再びネットワークからネットワークへの最後に通信されているアイデンティティでなければなりません。"
    },
    {
      "indent": 0,
      "text": "5.3.2. EAP Identity Response and EAP-AKA' AT_IDENTITY Attribute",
      "section_title": true,
      "ja": "5.3.2. EAP ID応答とEAP-AKA 'at_identity属性"
    },
    {
      "indent": 3,
      "text": "The EAP authentication option is only available in 5G when the new 5G core network is also in use. However, in other networks, an EAP-AKA' peer may be connecting to other types of networks and existing equipment.",
      "ja": "EAP認証オプションは、新しい5Gコアネットワークが使用されている場合にのみ使用可能です。ただし、他のネットワークでは、EAP-AKAのピアは他の種類のネットワークや既存の機器に接続している可能性があります。"
    },
    {
      "indent": 3,
      "text": "When the EAP server is in a 5G network, the 5G procedures for EAP-AKA' apply. [TS-3GPP.33.501] specifies when the EAP server is in a 5G network.",
      "ja": "EAPサーバが5Gネットワーネットワーク内にある場合、EAP-AKAの5Gプロシージャが適用されます。[TS-3GPP.33.501] EAPサーバーが5Gネットワークにあるかを指定します。"
    },
    {
      "indent": 9,
      "text": "Note: Currently, the following conditions are specified: when the EAP peer uses the 5G Non-Access Stratum (NAS) protocol [TS-3GPP.24.501] or when the EAP peer attaches to a network that advertises 5G connectivity without NAS [TS-3GPP.23.501]. Possible future conditions may also be specified by 3GPP.",
      "ja": "注意：現在、次の条件が指定されています.EAPピアが5G非アクセスストラート（NAS）プロトコル（TS-3GPP.24.501]を使用する場合、またはEAPピアがNASなしで5G接続をアドバタイズするネットワークに接続されている場合[TS-3gpp.23.501]。可能な将来の条件は3GPPによっても指定されてもよい。"
    },
    {
      "indent": 3,
      "text": "When the 5G procedures for EAP-AKA' apply, EAP identity exchanges are generally not used as the identity is already made available on previous link-layer exchanges.",
      "ja": "EAP-AKA 'の5G手順が適用されると、EAP ID交換は一般に、識別情報が既に前回のリンク層の交換で利用可能にされています。"
    },
    {
      "indent": 3,
      "text": "In this situation, the EAP Identity Response and EAP-AKA' AT_IDENTITY attribute are handled as specified in Annex F.2 of [TS-3GPP.33.501].",
      "ja": "この状況では、EAP ID応答とEAP-AKA 'at_identity属性は[TS-3GPP.33.501]の附属書F.2で指定されているとおりに処理されます。"
    },
    {
      "indent": 3,
      "text": "When used in EAP-AKA', the format of the SUCI MUST be as specified in [TS-3GPP.23.003], Section 28.7.3, with the semantics defined in [TS-3GPP.23.003], Section 2.2B. Also, in contrast to [RFC5448], in 5G EAP-AKA' does not use the \"0\" nor the \"6\" prefix in front of the identifier.",
      "ja": "EAP-AKA 'で使用する場合、SUCIのフォーマットは[TS-3GPP.23.003]、28.7.3項で指定されている必要があります。セクション2.2B。また、[RFC5448]とは対照的に、識別子の前に「0」も「6」の接頭辞を使用しない。"
    },
    {
      "indent": 3,
      "text": "For an example of an IMSI in NAI format, see [TS-3GPP.23.003], Section 28.7.3.",
      "ja": "NAIフォーマットのIMSIの例については、[TS-3GPP.23.003]、セクション28.7.3を参照してください。"
    },
    {
      "indent": 3,
      "text": "Otherwise, the peer SHOULD employ an IMSI, SUPI, or NAI [RFC7542] as it is configured to use.",
      "ja": "それ以外の場合、ピアは使用するように構成されているときにIMSI、SUPI、またはNAI [RFC7542]を使用する必要があります。"
    },
    {
      "indent": 0,
      "text": "6. Exported Parameters",
      "section_title": true,
      "ja": "6. エクスポートされたパラメータ"
    },
    {
      "indent": 3,
      "text": "When not using fast re-authentication, the EAP-AKA' Session-Id is the concatenation of the EAP-AKA' Type value (0x32, one byte) with the contents of the RAND field from the AT_RAND attribute followed by the contents of the AUTN field in the AT_AUTN attribute:",
      "ja": "高速再認証を使用しない場合、EAP-AKA 'session-idは、AT_RAND属性からRANDフィールドの内容を持つEAP-AKAのタイプ値（0x32、1バイト）の連結です。AT_AUTN属性のAUTNフィールド："
    },
    {
      "indent": 9,
      "text": "Session-Id = 0x32 || RAND || AUTN",
      "ja": "セッションID = 0x32 ||Rand ||aut"
    },
    {
      "indent": 3,
      "text": "When using fast re-authentication, the EAP-AKA' Session-Id is the concatenation of the EAP-AKA' Type value (0x32) with the contents of the NONCE_S field from the AT_NONCE_S attribute followed by the contents of the MAC field from the AT_MAC attribute from the EAP-Request/AKA-Reauthentication:",
      "ja": "高速再認証を使用する場合、EAP-AKA 'session-idは、AT_NONCE_S属性からNonce_sフィールドの内容を持つEAP-AKAのタイプ値（0x32）の連結と、次のようにしてからMACフィールドの内容が続きます。AT_MAC属性EAP-REQUEST / AKA-REAUTHENTICATION："
    },
    {
      "indent": 9,
      "text": "Session-Id = 0x32 || NONCE_S || MAC",
      "ja": "セッションID = 0x32 ||Nonce_s ||マック"
    },
    {
      "indent": 3,
      "text": "The Peer-Id is the contents of the Identity field from the AT_IDENTITY attribute, using only the Actual Identity Length bytes from the beginning. Note that the contents are used as they are transmitted, regardless of whether the transmitted identity was a permanent, pseudonym, or fast EAP re-authentication identity. If no AT_IDENTITY attribute was exchanged, the exported Peer-Id is the identity provided from the EAP Identity Response packet. If no EAP Identity Response was provided either, the exported Peer-Id is the null string (zero length).",
      "ja": "Peer-IDは、最初から実際のID長バイトのみを使用して、at_identity属性からのIDフィールドの内容です。送信されたアイデンティティが永続的な、仮名、または高速のEAP再認証IDであるかどうかにかかわらず、コンテンツは送信されているために使用されます。at_identity属性が交換されなかった場合、エクスポートされたPeer-IDはEAP ID応答パケットから提供されたIDです。EAP ID応答が提供されていない場合、エクスポートされたピアIDはヌル文字列（ゼロ長）です。"
    },
    {
      "indent": 3,
      "text": "The Server-Id is the null string (zero length).",
      "ja": "server-idはヌル文字列（ゼロ長）です。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "ja": "7. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "A summary of the security properties of EAP-AKA' follows. These properties are very similar to those in EAP-AKA. We assume that HMAC SHA-256 is at least as secure as HMAC SHA-1 (see also [RFC6194]). This is called the SHA-256 assumption in the remainder of this section. Under this assumption, EAP-AKA' is at least as secure as EAP-AKA.",
      "ja": "EAP-AKAのセキュリティプロパティの概要は次のとおりです。これらのプロパティはEAP-AKAのものと非常によく似ています。HMAC SHA-256が少なくともHMAC SHA-1と同じくらい安全であると仮定します（[RFC6194も参照）。これは、このセクションの残りの部分のSHA-256の仮定と呼ばれます。この仮定の下では、EAP-AKA 'は少なくともEAP-AKAと同じくらい安全です。"
    },
    {
      "indent": 3,
      "text": "If the AT_KDF attribute has value 1, then the security properties of EAP-AKA' are as follows:",
      "ja": "at_kdf属性が値1の場合、EAP-AKA 'のセキュリティプロパティは次のとおりです。"
    },
    {
      "indent": 3,
      "text": "Protected ciphersuite negotiation EAP-AKA' has no ciphersuite negotiation mechanisms. It does have a negotiation mechanism for selecting the key derivation functions. This mechanism is secure against bidding down attacks from EAP-AKA' to EAP-AKA. The negotiation mechanism allows changing the offered key derivation function, but the change is visible in the final EAP-Request/AKA'-Challenge message that the server sends to the peer. This message is authenticated via the AT_MAC attribute, and carries both the chosen alternative and the initially offered list. The peer refuses to accept a change it did not initiate. As a result, both parties are aware that a change is being made and what the original offer was.",
      "ja": "Protected CiphersuiteネゴシエーションEAP-AKA 'には、暗号型ネゴシエーションメカニズムがありません。鍵導出機能を選択するための交渉メカニズムがあります。このメカニズムは、EAP-AKA 'からEAP-AKAへの攻撃を入札することに対して安全です。ネゴシエーションメカニズムは、提供された鍵導出機能を変更することを可能にしますが、変更はサーバーがピアに送信する最終的なEAP-Request / AKA'-Challengeメッセージに表示されます。このメッセージはAT_MAC属性を介して認証され、選択されたオルタナティブリストと最初に提供されたリストの両方を伝送します。ピアは開始されなかった変更を受け入れることを拒否します。その結果、両当事者は変更が行われていて、元のオファーが何であるかを認識しています。"
    },
    {
      "indent": 6,
      "text": "Per assumptions in Section 4, there is no protection against bidding down attacks from EAP-AKA to EAP-AKA' should EAP-AKA' somehow be considered less secure some day than EAP-AKA. Such protection was not provided in RFC 5448 implementations and consequently neither does this specification provide it. If such support is needed, it would have to be added as a separate new feature.",
      "ja": "セクション4の仮定ごとに、EAP-AKAからEAP-AKAへの攻撃を入札することに対する保護はありません。そのような保護はRFC 5448の実装では提供されず、その結果、この仕様はそれを提供していません。そのようなサポートが必要な場合は、別の新機能として追加する必要があります。"
    },
    {
      "indent": 6,
      "text": "In general, it is expected that the current negotiation capabilities in EAP-AKA' are sufficient for some types of extensions, including adding Perfect Forward Secrecy [EMU-AKA-PFS] and perhaps others. However, some larger changes may require a new EAP method type, which is how EAP-AKA' itself happened. One example of such change would be the introduction of new algorithms.",
      "ja": "一般に、完璧な前方秘密[EMU-AKA-PFS]とおそらく他のものを追加するなど、EAP-AKAの現在のネゴシエーション能力は、ある種の拡張に十分であると予想されます。ただし、いくつかの大きな変更には新しいEAPメソッドタイプが必要な場合があります。これは、EAP-AKA '自体が起こった方法です。そのような変更の一例は、新しいアルゴリズムの導入です。"
    },
    {
      "indent": 3,
      "text": "Mutual authentication Under the SHA-256 assumption, the properties of EAP-AKA' are at least as good as those of EAP-AKA in this respect. Refer to [RFC4187], Section 12, for further details.",
      "ja": "SHA-256の仮定の下では、EAP-AKAの特性は少なくともこの点でEAP-AKAのものと同じくらい良好です。詳細については、[RFC4187]、セクション12を参照してください。"
    },
    {
      "indent": 3,
      "text": "Integrity protection Under the SHA-256 assumption, the properties of EAP-AKA' are at least as good (most likely better) as those of EAP-AKA in this respect. Refer to [RFC4187], Section 12, for further details. The only difference is that a stronger hash algorithm and keyed MAC, SHA-256 / HMAC-SHA-256, is used instead of SHA-1 / HMAC-SHA-1.",
      "ja": "SHA-256の仮定の下での完全性保護EAP-AKA 'の特性は、この点でEAP-AKAのものとして少なくとも良好（最も優れている）です。詳細については、[RFC4187]、セクション12を参照してください。唯一の違いは、SHA-1 / HMAC-SHA-1の代わりに、より強いハッシュアルゴリズムとキー付きMAC、SHA-256 / HMAC-SHA-256が使用されていることです。"
    },
    {
      "indent": 3,
      "text": "Replay protection Under the SHA-256 assumption, the properties of EAP-AKA' are at least as good as those of EAP-AKA in this respect. Refer to [RFC4187], Section 12, for further details.",
      "ja": "SHA-256の仮定の下での再生保護EAP-AKA 'の特性は、この点でEAP-AKAのプロパティと同じくらい良いです。詳細については、[RFC4187]、セクション12を参照してください。"
    },
    {
      "indent": 3,
      "text": "Confidentiality The properties of EAP-AKA' are exactly the same as those of EAP-AKA in this respect. Refer to [RFC4187], Section 12, for further details.",
      "ja": "機密性EAP-AKA 'のプロパティは、この点でEAP-AKAのプロパティとまったく同じです。詳細については、[RFC4187]、セクション12を参照してください。"
    },
    {
      "indent": 3,
      "text": "Key derivation EAP-AKA' supports key derivation with an effective key strength against brute-force attacks equal to the minimum of the length of the derived keys and the length of the AKA base key, i.e., 128 bits or more. The key hierarchy is specified in Section 3.3.",
      "ja": "キー派生EAP-AKA 'は、派生キーの長さの最小値と、AKAベースキーの長さ、すなわち128ビット以上の長さに等しいブルートフォース攻撃に対する効果的なキー強度をサポートしています。キー階層はセクション3.3で指定されています。"
    },
    {
      "indent": 6,
      "text": "The Transient EAP Keys used to protect EAP-AKA packets (K_encr, K_aut, K_re), the MSK, and the EMSK are cryptographically separate. If we make the assumption that SHA-256 behaves as a pseudorandom function, an attacker is incapable of deriving any non-trivial information about any of these keys based on the other keys. An attacker also cannot calculate the pre-shared secret from IK, CK, IK', CK', K_encr, K_aut, K_re, MSK, or EMSK by any practically feasible means.",
      "ja": "EAP-AKAパケット（K_ENCR、K_AUT、K_RE）、MSK、およびEMSKを保護するために使用される一時的なEAPキーは暗号的に分離されています。SHA-256が疑似ランダム関数として振る舞うと仮定すると、他のキーに基づいてこれらのキーのいずれかについての非些細な情報を導き出すことができません。攻撃者はまた、事実上実現可能な手段によって、IK、CK、IK '、CK'、K_ENCR、K_AUT、K_RE、MSK、またはEMSKから事前共有秘密を計算することもできません。"
    },
    {
      "indent": 6,
      "text": "EAP-AKA' adds an additional layer of key derivation functions within itself to protect against the use of compromised keys. This is discussed further in Section 7.4.",
      "ja": "EAP-AKA 'は、侵入先のキーの使用から保護するために、それ自体内に追加の派生関数の追加層を追加します。これについてはセクション7.4でさらに説明します。"
    },
    {
      "indent": 6,
      "text": "EAP-AKA' uses a pseudorandom function modeled after the one used in IKEv2 [RFC7296] together with SHA-256.",
      "ja": "EAP-AKA 'は、SHA-256とともにIKEV2 [RFC7296]で使用されたものの後にモデル化された疑似ランダム関数を使用します。"
    },
    {
      "indent": 3,
      "text": "Key strength See above.",
      "ja": "主な強さは上を見てください。"
    },
    {
      "indent": 3,
      "text": "Dictionary attack resistance Under the SHA-256 assumption, the properties of EAP-AKA' are at least as good as those of EAP-AKA in this respect. Refer to [RFC4187], Section 12, for further details.",
      "ja": "SHA-256の仮定の下での辞書攻撃抵抗、EAP-AKAの特性は少なくともこの点でEAP-AKAのものと同じくらい良いです。詳細については、[RFC4187]、セクション12を参照してください。"
    },
    {
      "indent": 3,
      "text": "Fast reconnect Under the SHA-256 assumption, the properties of EAP-AKA' are at least as good as those of EAP-AKA in this respect. Refer to [RFC4187], Section 12, for further details. Note that implementations MUST prevent performing a fast reconnect across method types.",
      "ja": "SHA-256の仮定の下で速い再接続EAP-AKA 'の特性は、この点に関して少なくともEAP-AKAのものと同じくらい良好です。詳細については、[RFC4187]、セクション12を参照してください。メソッドタイプ間で高速再接続を実行するのを防ぐ必要があります。"
    },
    {
      "indent": 3,
      "text": "Cryptographic binding Note that this term refers to a very specific form of binding, something that is performed between two layers of authentication. It is not the same as the binding to a particular network name. The properties of EAP-AKA' are exactly the same as those of EAP-AKA in this respect, i.e., as it is not a tunnel method, this property is not applicable to it. Refer to [RFC4187], Section 12, for further details.",
      "ja": "暗号化バインディングこの用語は、非常に具体的な形式のバインディングを指し、2つの認証の間で実行されるものです。特定のネットワーク名へのバインディングと同じではありません。EAP-AKA 'のプロパティは、この点で、すなわちトンネル方式ではないので、このプロパティはそれには適用されない。詳細については、[RFC4187]、セクション12を参照してください。"
    },
    {
      "indent": 3,
      "text": "Session independence The properties of EAP-AKA' are exactly the same as those of EAP-AKA in this respect. Refer to [RFC4187], Section 12, for further details.",
      "ja": "セッションの独立性EAP-AKA 'のプロパティは、この点でEAP-AKAのプロパティとまったく同じです。詳細については、[RFC4187]、セクション12を参照してください。"
    },
    {
      "indent": 3,
      "text": "Fragmentation The properties of EAP-AKA' are exactly the same as those of EAP-AKA in this respect. Refer to [RFC4187], Section 12, for further details.",
      "ja": "断片化EAP-AKA 'のプロパティは、この点でEAP-AKAのプロパティとまったく同じです。詳細については、[RFC4187]、セクション12を参照してください。"
    },
    {
      "indent": 3,
      "text": "Channel binding EAP-AKA', like EAP-AKA, does not provide channel bindings as they're defined in [RFC3748] and [RFC5247]. New skippable attributes can be used to add channel binding support in the future, if required.",
      "ja": "EAP-AKAのようなチャネルバインディングEAP-AKA 'は、[RFC3748]と[RFC5247]で定義されているようにチャネルバインディングを提供しません。必要に応じて、新しいスキップ可能な属性を使用して、将来チャネルバインディングサポートを追加できます。"
    },
    {
      "indent": 6,
      "text": "However, including the Network Name field in the AKA' algorithms (which are also used for other purposes than EAP-AKA') provides a form of cryptographic separation between different network names, which resembles channel bindings. However, the network name does not typically identify the EAP (pass-through) authenticator. See Section 7.4 for more discussion.",
      "ja": "しかしながら、AKAのアルゴリズム内のネットワーク名フィールドを含む（これはEAP  -  AKAよりも他の目的にも使用される）は、チャネルバインディングに似た異なるネットワーク名間の暗号分離の形式を提供する。ただし、ネットワーク名は通常EAP（パススルー）オーセンティケータを識別しません。詳細については7.4節をご覧ください。"
    },
    {
      "indent": 0,
      "text": "7.1. Privacy",
      "section_title": true,
      "ja": "7.1. プライバシー"
    },
    {
      "indent": 3,
      "text": "[RFC6973] suggests that the privacy considerations of IETF protocols be documented.",
      "ja": "[RFC6973] IETFプロトコルのプライバシーに関する考慮事項を文書化することを示唆しています。"
    },
    {
      "indent": 3,
      "text": "The confidentiality properties of EAP-AKA' itself have been discussed above under \"Confidentiality\" (Section 7).",
      "ja": "EAP-AKA '自体の機密保持特性は、「機密性」の下で上述した（セクション7）。"
    },
    {
      "indent": 3,
      "text": "EAP-AKA' uses several different types of identifiers to identify the authenticating peer. It is strongly RECOMMENDED to use the privacy-friendly temporary or hidden identifiers, i.e., the 5G GUTI or SUCI, pseudonym usernames, and fast re-authentication usernames. The use of permanent identifiers such as the IMSI or SUPI may lead to an ability to track the peer and/or user associated with the peer. The use of permanent identifiers such as the IMSI or SUPI is strongly NOT RECOMMENDED.",
      "ja": "EAP-AKA 'は、認証ピアを識別するためにいくつかの異なるタイプの識別子を使用します。プライバシーにやさしい一時的または隠れた識別子、すなわち5G GutiまたはSuci、Pseudon onewhernames、および高速再認証のユーザ名を使用することを強くお勧めします。IMSIまたはSUPIなどの恒久的な識別子の使用は、ピアに関連付けられたピアおよび/またはユーザを追跡する能力をもたらし得る。IMSIやSUPIなどの恒久的な識別子の使用は強くお勧めできません。"
    },
    {
      "indent": 3,
      "text": "As discussed in Section 5.3, when authenticating to a 5G network, only the SUCI identifier is normally used. The use of EAP-AKA' pseudonyms in this situation is at best limited because the SUCI already provides a stronger mechanism. In fact, reusing the same pseudonym multiple times will result in a tracking opportunity for observers that see the pseudonym pass by. To avoid this, the peer and server need to follow the guidelines given in Section 5.2.",
      "ja": "セクション5.3で説明されているように、5Gネットワーネットワークへの認証時には、SUCI識別子のみが通常使用されます。この状況でのEAP-AKAの仮名の使用は、SUCIがすでにより強いメカニズムを提供するため、最も限られています。実際、同じ仮名を複数回再利用すると、仮名が通過する観察者のトラッキングの機会があります。これを回避するために、ピアとサーバーはセクション5.2に記載されているガイドラインに従う必要があります。"
    },
    {
      "indent": 3,
      "text": "When authenticating to a 5G network, per Section 5.3.1, both the EAP-AKA' peer and server need to employ the permanent identifier SUPI as an input to key derivation. However, this use of the SUPI is only internal. As such, the SUPI need not be communicated in EAP messages. Therefore, SUPI MUST NOT be communicated in EAP-AKA' when authenticating to a 5G network.",
      "ja": "セクション5.3.1ごとに5Gネットワーションを認証する場合、EAP-AKAのピアとサーバーの両方が永久識別子SUPIをキー導出への入力として使用する必要があります。ただし、このSUPIの使用は内部のみです。そのため、SUPIはEAPメッセージに通信する必要はありません。したがって、5Gネットワークに認証するときに、SUPIをEAP-AKAに通信してはいけません。"
    },
    {
      "indent": 3,
      "text": "While the use of SUCI in 5G networks generally provides identity privacy, this is not true if the null-scheme encryption is used to construct the SUCI (see [TS-3GPP.33.501], Annex C). The use of this scheme makes the use of SUCI equivalent to the use of SUPI or IMSI. The use of the null scheme is NOT RECOMMENDED where identity privacy is important.",
      "ja": "5Gネットワーク内のSUCIの使用は一般にIDのプライバシーを提供しますが、NULL-Scheme暗号化がSUCIを構築するために使用されている場合、これは当てはまりません（[TS-3GPP.33.501]、Annex C）。この方式の使用は、SUPIまたはIMSIの使用と同等のSUCIを使用する。NULLスキームの使用は、IDのプライバシーが重要な場合にはお勧めできません。"
    },
    {
      "indent": 3,
      "text": "The use of fast re-authentication identities when authenticating to a 5G network does not have the same problems as the use of pseudonyms, as long as the 5G authentication server generates the fast re-authentication identifiers in a proper manner specified in Section 5.2.",
      "ja": "5G認証サーバがセクション5.2で指定された適切な方法で高速再認証識別子を生成する限り、5Gネットワ様式のネットワークの使用時の高速再認証IDの使用は、仮想再認証識別子を生成する限り、仮想認証識別情報を使用しません。"
    },
    {
      "indent": 3,
      "text": "Outside 5G, the peer can freely choose between the use of permanent, pseudonym, or fast re-authentication identifiers:",
      "ja": "5G以外では、ピアは永続的な、仮名、または高速再認証識別子の使用から自由に選択できます。"
    },
    {
      "indent": 3,
      "text": "* A peer that has not yet performed any EAP-AKA' exchanges does not typically have a pseudonym available. If the peer does not have a pseudonym available, then the privacy mechanism cannot be used, and the permanent identity will have to be sent in the clear.",
      "ja": "* まだEAP-AKAの交換を実行していないピアは、通常は疑似値を持っていません。ピアに擬似文字が使用可能な場合は、プライバシーメカニズムを使用できず、恒久的なアイデンティティを明確に送信する必要があります。"
    },
    {
      "indent": 6,
      "text": "The terminal SHOULD store the pseudonym in nonvolatile memory so that it can be maintained across reboots. An active attacker that impersonates the network may use the AT_PERMANENT_ID_REQ attribute ([RFC4187], Section 4.1.2) to learn the subscriber's IMSI. However, as discussed in [RFC4187], Section 4.1.2, the terminal can refuse to send the cleartext permanent identity if it believes that the network should be able to recognize the pseudonym.",
      "ja": "端末は、再起動後に維持できるように、偽系を不揮発性メモリに保存する必要があります。ネットワークを偽装するアクティブな攻撃者は、at_permanent_id_req属性（[RFC4187]、セクション4.1.2）を使用して、加入者のIMSIを学ぶことができます。ただし、[RFC4187]、セクション4.1.2で説明したように、端末は、ネットワークが仮名を認識できるようにすることができると考えている場合は、クリアテキストの恒久的なアイデンティティを送信することを拒否できます。"
    },
    {
      "indent": 3,
      "text": "* When pseudonyms and fast re-authentication identities are used, the peer relies on the properly created identifiers by the server.",
      "ja": "* 擬似文字字と高速再認証IDが使用されている場合、ピアはサーバーによって適切に作成された識別子に依存しています。"
    },
    {
      "indent": 6,
      "text": "It is essential that an attacker cannot link a privacy-friendly identifier to the user in any way or determine that two identifiers belong to the same user as outlined in Section 5.2. The pseudonym usernames and fast re-authentication identities MUST NOT be used for other purposes (e.g., in other protocols).",
      "ja": "攻撃者がどのような方法でもプライバシーに優しい識別子をユーザーにリンクできないか、2つの識別子がセクション5.2で概説されていると同じユーザーに属していると判断することが重要です。異音のユーザ名と高速再認証IDは、他の目的に使用してはいけません（たとえば、他のプロトコルで）。"
    },
    {
      "indent": 3,
      "text": "If the peer and server cannot guarantee that SUCI can be used or that pseudonyms will be available, generated properly, and maintained reliably, and identity privacy is required, then additional protection from an external security mechanism such as tunneled EAP methods like Tunneled Transport Layer Security (TTLS) [RFC5281] or Tunnel Extensible Authentication Protocol (TEAP) [RFC7170] may be used. The benefits and the security considerations of using an external security mechanism with EAP-AKA are beyond the scope of this document.",
      "ja": "ピアとサーバーがSUCIを使用できること、または疑似文字が正しく、正しく生成され、確実に生成され、IDのプライバシーが必要になることを保証できない場合、およびIDのプライバシーが必要です。（TTLS）[RFC5281]またはトンネル拡張認証プロトコル（TEAP）[RFC7170]を使用できます。EAP-AKAを使用して外部セキュリティメカニズムを使用することの利点とセキュリティ上の考慮事項は、この文書の範囲を超えています。"
    },
    {
      "indent": 3,
      "text": "Finally, as with other EAP methods, even when privacy-friendly identifiers or EAP tunneling is used, typically the domain part of an identifier (e.g., the home operator) is visible to external parties.",
      "ja": "最後に、他のEAPメソッドと同様に、プライバシーにやさしい識別子またはEAPトンネリングが使用されていても、通常は識別子のドメイン部分（例えば、ホームオペレーター）は外部の当事者から見えます。"
    },
    {
      "indent": 0,
      "text": "7.2. Discovered Vulnerabilities",
      "section_title": true,
      "ja": "7.2. 発見された脆弱性"
    },
    {
      "indent": 3,
      "text": "There have been no published attacks that violate the primary secrecy or authentication properties defined for Authentication and Key Agreement (AKA) under the originally assumed trust model. The same is true of EAP-AKA'.",
      "ja": "最初に想定されている信頼モデルの下で、認証および主要契約（AKA）に定義されている主要な秘密または認証プロパティに違反する公開攻撃はありません。同じことがEAP-AKAの本当です。"
    },
    {
      "indent": 3,
      "text": "However, there have been attacks when a different trust model is in use, with characteristics not originally provided by the design, or when participants in the protocol leak information to outsiders on purpose, and there have been some privacy-related attacks.",
      "ja": "ただし、別の信頼モデルが使用中の攻撃が発生している場合、デザインによってもともと提供されていない特性があり、プロトコルリーク情報の参加者が意図的に部外者に情報を投入し、いくつかのプライバシー関連の攻撃がありました。"
    },
    {
      "indent": 3,
      "text": "For instance, the original AKA protocol does not prevent an insider supplying keys to a third party, e.g., as described by Mjølsnes and Tsay in [MT2012] where a serving network lets an authentication run succeed, but then it misuses the session keys to send traffic on the authenticated user's behalf. This particular attack is not different from any on-path entity (such as a router) pretending to send traffic, but the general issue of insider attacks can be a problem, particularly in a large group of collaborating operators.",
      "ja": "例えば、元のAKAプロトコルは、例えばMjølsnesおよびTsayの記述されたように、サービスネットワークが認証実行を実行できるようになったが、その後セッションキーを送信することを誤解することを妨げる。認証されたユーザーに代わってトラフィック。この特定の攻撃は、トラフィックを送信するふりをしているふりをしていますが、インサイダー攻撃の一般的な問題は、特に大規模なコラボレーション・オペレーターで問題になる可能性があります。"
    },
    {
      "indent": 3,
      "text": "Another class of attacks is the use of tunneling of traffic from one place to another, e.g., as done by Zhang and Fang in [ZF2005] to leverage security policy differences between different operator networks, for instance. To gain something in such an attack, the attacker needs to trick the user into believing it is in another location. If policies between locations differ, for instance, if payload traffic is not required to be encrypted in some location, the attacker may trick the user into opening a vulnerability. As an authentication mechanism, EAP-AKA' is not directly affected by most of these attacks. EAP-AKA' network name binding can also help alleviate some of the attacks. In any case, it is recommended that EAP-AKA' configuration not be dependent on the location of request origin, unless the location information can be cryptographically confirmed, e.g., with the network name binding.",
      "ja": "別のクラスの攻撃は、例えば、[ZF2005]のZhangとFangによって行われるように、ある場所から別の場所へのトラフィックのトンネリングの使用、例えば異なるオペレータネットワーク間のセキュリティポリシーの違いを活用することです。そのような攻撃で何かを得るためには、攻撃者はそれが別の場所にあると信じるとユーザーをトリックする必要があります。たとえば、位置の間のポリシーが異なる場合、ペイロードトラフィックがある場所で暗号化されていない場合、攻撃者はユーザーを脆弱性を開くようにトリックすることがあります。認証メカニズムとして、EAP-AKA 'はこれらの攻撃のほとんどの影響を受けません。EAP-AKAのネットワーク名バインディングは、いくつかの攻撃を軽減するのに役立ちます。いずれにせよ、位置情報が暗号的に確認されていても、例えばネットワーク名のバインディングを用いない限り、EAP  -  AKA '構成は要求元の位置に依存しないことを推奨する。"
    },
    {
      "indent": 3,
      "text": "Zhang and Fang also looked at denial-of-service attacks [ZF2005]. A serving network may request large numbers of authentication runs for a particular subscriber from a home network. While the resynchronization process can help recover from this, eventually it is possible to exhaust the sequence number space and render the subscriber's card unusable. This attack is possible for both original AKA and EAP-AKA'. However, it requires the collaboration of a serving network in an attack. It is recommended that EAP-AKA' implementations provide the means to track, detect, and limit excessive authentication attempts to combat this problem.",
      "ja": "ZhangとFangはまた、サービス拒否攻撃[ZF2005]を見ました。サービングネットワークは、ホームネットワークから特定の加入者に対して多数の認証実行を要求することができる。再同期プロセスはこれから回復するのに役立ちますが、最終的にはシーケンス番号スペースを使い果たし、加入者のカードを使用できなくなります。この攻撃は、オリジナルのAKAとEAP-AKAの両方で可能です。ただし、攻撃でサービングネットワークのコラボレーションが必要です。EAP-AKAの実装は、この問題と戦うための過度の認証試行を追跡、検出、および制限するための手段を提供することをお勧めします。"
    },
    {
      "indent": 3,
      "text": "There have also been attacks related to the use of AKA without the generated session keys (e.g., [BT2013]). Some of those attacks relate to the use of HTTP Digest AKAv1 [RFC3310], which was originally vulnerable to man-in-the-middle attacks. This has since been corrected in [RFC4169]. The EAP-AKA' protocol uses session keys and provides channel binding, and as such, it is resistant to the above attacks except where the protocol participants leak information to outsiders.",
      "ja": "生成されたセッションキーを持たないAKAの使用に関連する攻撃もありました（例えば[BT2013]）。これらの攻撃の中には、http Digest AKAV1 [RFC3310]の使用に関連しており、これはもともと中間攻撃にも脆弱でした。これ以降、[RFC4169]で修正されています。EAP-AKAのプロトコルはセッションキーを使用し、チャネルバインディングを提供します。そのため、プロトコル参加者が部外者に情報を漏らす場所を除き、上記の攻撃に耐性があります。"
    },
    {
      "indent": 3,
      "text": "Basin, et al. [Basin2018] have performed formal analysis and concluded that the AKA protocol would have benefited from additional security requirements such as key confirmation.",
      "ja": "流域ら。[洗面台2018]は正式な分析を行い、AKAプロトコルがキー確認などの追加のセキュリティ要件から恩恵を受けていたと結論付けました。"
    },
    {
      "indent": 3,
      "text": "In the context of pervasive monitoring revelations, there were also reports of compromised long-term pre-shared keys used in SIM and AKA [Heist2015]. While no protocol can survive the theft of key material associated with its credentials, there are some things that alleviate the impacts in such situations. These are discussed further in Section 7.3.",
      "ja": "普及監視啓示の文脈では、SIMとAKAで使用される長期前の事前共有キーの報告もありました[Heist2015]。その資格情報に関連する重要な資料の盗難を守ることはできませんが、そのような状況での影響を軽減するものがいくつかあります。これらはセクション7.3でさらに説明されています。"
    },
    {
      "indent": 3,
      "text": "Arapinis, et al. [Arapinis2012] describe an attack that uses the AKA resynchronization protocol to attempt to detect whether a particular subscriber is in a given area. This attack depends on the attacker setting up a false base station in the given area and on the subscriber performing at least one authentication between the time the attack is set up and run.",
      "ja": "Arapinisら。[ARAPINIS2012] AKA再同期プロトコルを使用して特定の加入者が特定のエリアにあるかどうかを検出しようとする攻撃を説明します。この攻撃は、与えられた領域内の誤った基地局を設定し、加入者に攻撃が設定されて実行された時間の間に少なくとも1つの認証を実行します。"
    },
    {
      "indent": 3,
      "text": "Borgaonkar, et al. discovered that the AKA resynchronization protocol may also be used to predict the authentication frequency of a subscriber if a non-time-based sequence number (SQN) generation scheme is used [Borgaonkar2018]. The attacker can force the reuse of the keystream that is used to protect the SQN in the AKA resynchronization protocol. The attacker then guesses the authentication frequency based on the lowest bits of two XORed SQNs. The researchers' concern was that the authentication frequency would reveal some information about the phone usage behavior, e.g., number of phone calls made or number of SMS messages sent. There are a number of possible triggers for authentication, so such an information leak is not direct, but it can be a concern. The impact of the attack differs depending on whether the SQN generation scheme that is used is time-based or not.",
      "ja": "Borgaonkarら。AKA再同期プロトコルを使用して、非時間ベースのシーケンス番号（SQN）生成方式が使用されている場合には、加入者の認証頻度を予測することができることを発見した[Borgaonkar2018]。攻撃者は、AKA再同期プロトコルでSQNを保護するために使用されるキーストリームの再利用を強制することができます。その後、攻撃者は、2つのXORED SQNの最下位ビットに基づいて認証頻度を推測します。研究者の関心事は、認証頻度は、電話の使用行動に関する情報、例えば、送信された電話の数または送信されたSMSメッセージの数に関するいくつかの情報を明らかにすることでした。認証には多くの可能なトリガーがありますので、このような情報漏洩は直接的ではありませんが、それは懸念される可能性があります。攻撃の影響は、使用されるSQN生成方式が時間ベースかどうかによって異なります。"
    },
    {
      "indent": 3,
      "text": "Similar attacks are possible outside AKA in the cellular paging protocols where the attacker can simply send application-layer data, send short messages, or make phone calls to the intended victim and observe the air interface (e.g., [Kune2012] and [Shaik2016]). Hussain, et al. demonstrated a slightly more sophisticated version of the attack that exploits the fact that the 4G paging protocol uses the IMSI to calculate the paging timeslot [Hussain2019]. As this attack is outside AKA, it does not impact EAP-AKA'.",
      "ja": "攻撃者がアプリケーションレイヤデータを単純に送信したり、短いメッセージを送信したり、意図した被害者に電話をかけたり、エアインタフェースを守ったりすることができ、エアインタフェースを監視したりすることができるセルラーページングプロトコルでは、AKAの外部で同様の攻撃が可能です。。Hussainら。4GページングプロトコルがIMSIを使用してページングタイムスロット[Hussain2019]を計算するという事実を活用する攻撃のわずかに洗練されたバージョンを実証しました。この攻撃はAKAの外にあるので、それはEAP-AKAに影響を与えません。"
    },
    {
      "indent": 3,
      "text": "Finally, bad implementations of EAP-AKA' may not produce pseudonym usernames or fast re-authentication identities in a manner that is sufficiently secure. While it is not a problem with the protocol itself, following the recommendations in Section 5.2 can mitigate this concern.",
      "ja": "最後に、EAP-AKAの不正な実装は、十分に安全な方法で、異義語のユーザー名または高速再認証IDを生成しない可能性があります。プロトコル自体の問題ではないが、セクション5.2の推奨事項に従ってこの懸念を軽減することができます。"
    },
    {
      "indent": 0,
      "text": "7.3. Pervasive Monitoring",
      "section_title": true,
      "ja": "7.3. 普及監視"
    },
    {
      "indent": 3,
      "text": "As required by [RFC7258], work on IETF protocols needs to consider the effects of pervasive monitoring and mitigate them when possible.",
      "ja": "[RFC7258]に必要に応じて、IETFプロトコルの作業は、普及監視の効果を考慮し、可能であればそれらを軽減する必要があります。"
    },
    {
      "indent": 3,
      "text": "As described in Section 7.2, after the publication of RFC 5448, new information has come to light regarding the use of pervasive monitoring techniques against many security technologies, including AKA-based authentication.",
      "ja": "7.2節に記載されているように、RFC 5448の出版後、AKAベースの認証を含む多くのセキュリティ技術に対する広汎監視技術の使用に関して新しい情報が明らかになりました。"
    },
    {
      "indent": 3,
      "text": "For AKA, these attacks relate to theft of the long-term, shared-secret key material stored on the cards. Such attacks are conceivable, for instance, during the manufacturing process of cards, through coercion of the card manufacturers, or during the transfer of cards and associated information to an operator. Since the publication of reports about such attacks, manufacturing and provisioning processes have gained much scrutiny and have improved.",
      "ja": "AKAの場合、これらの攻撃はカードに保存されている長期的な共有秘密鍵素材の盗難に関連しています。そのような攻撃は、例えば、カードの製造プロセス中、カード製造業者の強制、またはカードの転送の間に、および関連情報をオペレータに伝達する間に考えられる。そのような攻撃に関する報告書の出版物は、製造およびプロビジョニングプロセスが多くの精査を受けて改善された。"
    },
    {
      "indent": 3,
      "text": "In particular, it is crucial that manufacturers limit access to the secret information and the cards only to necessary systems and personnel. It is also crucial that secure mechanisms be used to store and communicate the secrets between the manufacturer and the operator that adopts those cards for their customers.",
      "ja": "特に、製造業者が秘密情報とカードとのアクセスを必要なシステムや担当者に限定することが重要です。安全なメカニズムはまた、製造業者とそれらのカードを採用しているオペレータの間の秘密を保管し伝達するために使用されることも重要です。"
    },
    {
      "indent": 3,
      "text": "Beyond these operational considerations, there are also technical means to improve resistance to these attacks. One approach is to provide Perfect Forward Secrecy (PFS). This would prevent any passive attacks merely based on the long-term secrets and observation of traffic. Such a mechanism can be defined as a backwards-compatible extension of EAP-AKA' and is pursued separately from this specification [EMU-AKA-PFS]. Alternatively, EAP-AKA' authentication can be run inside a PFS-capable, tunneled authentication method. In any case, the use of some PFS-capable mechanism is recommended.",
      "ja": "これらの運用上の考慮事項を超えて、これらの攻撃に対する耐性を向上させるための技術的手段もあります。1つのアプローチは完全な前方秘密（PFS）を提供することです。これにより、単に長期の秘密とトラフィックの観察に基づく受動的な攻撃を防ぐでしょう。そのようなメカニズムは、EAP-AKAの後方互換性のある拡張として定義することができ、この仕様[EMU-AKA-PFS]とは別に追求されます。あるいは、EAP-AKAの認証は、PFS対応のトンネル認証方法内で実行できます。いずれにせよ、いくつかのPFS対応メカニズムを使用することをお勧めします。"
    },
    {
      "indent": 0,
      "text": "7.4. Security Properties of Binding Network Names",
      "section_title": true,
      "ja": "7.4. バインディングネットワーク名のセキュリティプロパティ"
    },
    {
      "indent": 3,
      "text": "The ability of EAP-AKA' to bind the network name into the used keys provides some additional protection against key leakage to inappropriate parties. The keys used in the protocol are specific to a particular network name. If key leakage occurs due to an accident, access node compromise, or another attack, the leaked keys are only useful when providing access with that name. For instance, a malicious access point cannot claim to be network Y if it has stolen keys from network X. Obviously, if an access point is compromised, the malicious node can still represent the compromised node. As a result, neither EAP-AKA' nor any other extension can prevent such attacks; however, the binding to a particular name limits the attacker's choices, allows better tracking of attacks, makes it possible to identify compromised networks, and applies good cryptographic hygiene.",
      "ja": "EAP-AKA 'の能力は、ネットワーク名を使用済みキーにバインドする機能により、不適切な当事者への主要な漏洩に対するいくつかの追加の保護があります。プロトコルで使用されているキーは、特定のネットワーク名に固有のものです。事故、アクセスノードの侵害、または別の攻撃により重要な漏洩が発生した場合、リークされたキーはその名前にアクセスするときにのみ役立ちます。例えば、悪意のあるアクセスポイントは、ネットワークXからのキーを盗まれた場合、ネットワークYであると主張することはできません。その結果、EAP-AKA 'も他の延長もそのような攻撃を防ぐことはできません。ただし、特定の名前へのバインディングは攻撃者の選択を制限し、攻撃の改善を可能にし、侵入先のネットワークを特定することを可能にし、優れた暗号化衛生を適用します。"
    },
    {
      "indent": 3,
      "text": "The server receives the EAP transaction from a given access network, and verifies that the claim from the access network corresponds to the name that this access network should be using. It becomes impossible for an access network to claim over AAA that it is another access network. In addition, if the peer checks that the information it has received locally over the network-access link-layer matches with the information the server has given it via EAP-AKA', it becomes impossible for the access network to tell one story to the AAA network and another one to the peer. These checks prevent some \"lying NAS\" (Network Access Server) attacks. For instance, a roaming partner, R, might claim that it is the home network H in an effort to lure peers to connect to itself. Such an attack would be beneficial for the roaming partner if it can attract more users, and damaging for the users if their access costs in R are higher than those in other alternative networks, such as H.",
      "ja": "サーバーは特定のアクセスネットワークからEAPトランザクションを受信し、アクセスネットワークのクレームがこのアクセスネットワークを使用している必要があるという名前に対応することを確認します。アクセスネットワークが、それが別のアクセスネットワークであることをAAAにわたって請求することは不可能になる。さらに、ピアがネットワークアクセスリンクレイヤを介してローカルに受信した情報がEAP-AKAを介してそれを与えた情報と一致した情報が一致したことを確認すると、アクセスネットワークが1つのストーリーに伝えることは不可能になります。AAAネットワークともう1つはピアに。これらのチェックは、いくつかの「横にあるNAS」（ネットワークアクセスサーバ）攻撃を防ぎます。例えば、ローミングパートナーRは、それ自体に接続するためのピアをルアー化するためにホームネットワークHであると主張するかもしれません。そのような攻撃は、より多くのユーザーを引き付けることができ、RのアクセスコストがH.のような他の代替ネットワークのものよりも高い場合には、ローミングパートナーにとって有益です。"
    },
    {
      "indent": 3,
      "text": "Any attacker who gets hold of the keys CK and IK, produced by the AKA algorithm, can compute the keys CK' and IK' and, hence, the Master Key (MK) according to the rules in Section 3.3. The attacker could then act as a lying NAS. In 3GPP systems in general, the keys CK and IK have been distributed to, for instance, nodes in a visited access network where they may be vulnerable. In order to reduce this risk, the AKA algorithm MUST be computed with the AMF separation bit set to 1, and the peer MUST check that this is indeed the case whenever it runs EAP-AKA'. Furthermore, [TS-3GPP.33.402] requires that no CK or IK keys computed in this way ever leave the home subscriber system.",
      "ja": "AKAアルゴリズムによって生成されたキーCKとIKを保持する攻撃者は、キーCK 'とIK'を計算することができ、したがって、セクション3.3の規則に従ってマスターキー（MK）を計算できます。その後、攻撃者は横にあるNASとして機能することができました。一般に、3GPPシステムにおいて、キーCKおよびIKは、例えば訪問されたアクセスネットワーク内のノードに分散されており、それらは脆弱な場合がある。このリスクを低減するためには、AKAアルゴリズムはAMF分離ビットを1に設定して計算する必要があり、ピアはこれが実際にEAP-AKAを実行するときはいつでもそうであることを確認しなければなりません。さらに、[TS-3GPP.33.402]は、このようにしてCKキーまたはIKキーを計算しないことを要求する必要があります。"
    },
    {
      "indent": 3,
      "text": "The additional security benefits obtained from the binding depend obviously on the way names are assigned to different access networks. This is specified in [TS-3GPP.24.302]. See also [TS-3GPP.23.003]. Ideally, the names allow separating each different access technology, each different access network, and each different NAS within a domain. If this is not possible, the full benefits may not be achieved. For instance, if the names identify just an access technology, use of compromised keys in a different technology can be prevented, but it is not possible to prevent their use by other domains or devices using the same technology.",
      "ja": "バインディングから得られた追加のセキュリティ上の利点は、明らかに名前が異なるアクセスネットワークに割り当てられている方法に依存します。これは[TS-3GPP.24.302]で指定します。[TS-3GPP.23.003]も参照してください。理想的には、名前は、各異なるアクセス技術、各々のアクセスネットワーク、およびドメイン内の各々のNAを分離することを可能にする。これが不可能な場合は、完全な利点が達成されない場合があります。たとえば、名前がアクセス技術だけを識別している場合は、異なる技術で侵入されたキーの使用を防ぐことができますが、同じテクノロジを使用して他のドメインまたはデバイスによる使用を防ぐことはできません。"
    },
    {
      "indent": 0,
      "text": "8. IANA Considerations",
      "section_title": true,
      "ja": "8. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has updated the \"Extensible Authentication Protocol (EAP) Registry\" and the \"EAP-AKA and EAP-SIM Parameters\" registry so that entries that pointed to RFC 5448 now point to this RFC instead.",
      "ja": "IANAは、RFC 5448を指すエントリが代わりにこのRFCを指すように、「拡張認証プロトコル（EAP）レジストリ」と「EAP-AKAおよびEAP-SIMパラメータ」レジストリを更新しました。"
    },
    {
      "indent": 0,
      "text": "8.1. Type Value",
      "section_title": true,
      "ja": "8.1. タイプ値"
    },
    {
      "indent": 3,
      "text": "IANA has updated the reference for EAP-AKA' (0x32) in the \"Method Types\" subregistry under the \"Extensible Authentication Protocol (EAP) Registry\" to point to this document. Per Section 6.2 of [RFC3748], this allocation can be made with Specification Required [RFC8126].",
      "ja": "IANAは、この文書を指すように、「EAPTENSIBLE認証プロトコル（EAP）レジストリ」に基づく「メソッドTypes」サブレイストのEAP-AKA '（0x32）の参照を更新しました。[RFC3748]のセクション6.2あたり、この割り当ては必要な仕様で行うことができます[RFC8126]。"
    },
    {
      "indent": 0,
      "text": "8.2. Attribute Type Values",
      "section_title": true,
      "ja": "8.2. 属性タイプ値"
    },
    {
      "indent": 3,
      "text": "EAP-AKA' shares its attribute space and subtypes with EAP-SIM [RFC4186] and EAP-AKA [RFC4187]. No new registries are needed.",
      "ja": "EAP-AKA 'は、その属性スペースとサブタイプとEAP-SIM [RFC4186]とEAP-AKA [RFC4187]を持つサブタイプを共有しています。新しいレジストリは必要ありません。"
    },
    {
      "indent": 3,
      "text": "IANA has updated the reference for AT_KDF_INPUT (23) and AT_KDF (24) in the \"Attribute Types (Non-Skippable Attributes 0-127)\" subregistry under the \"EAP-AKA and EAP-SIM Parameters\" registry to point to this document. AT_KDF_INPUT and AT_KDF are defined in Sections 3.1 and 3.2, respectively, of this document.",
      "ja": "IANAは、このドキュメントを指すように、「EAP-AKAおよびEAP-SIMパラメータ」レジストリの下で、「属性タイプ（非スキップ可能な属性0-127）」サブレイストのAT_KDF_INPUT（23）およびAT_KDF（24）の参照を更新しました。AT_KDF_INPUTおよびAT_KDFは、このドキュメントのセクション3.1および3.2で定義されています。"
    },
    {
      "indent": 3,
      "text": "IANA has also updated the reference for AT_BIDDING (136) in the \"Attribute Types (Skippable Attributes 128-255)\" subregistry of the \"EAP-AKA and EAP-SIM Parameters\" registry to point to this document. AT_BIDDING is defined in Section 4.",
      "ja": "IANAは、このドキュメントを指すように、「EAP-AKAおよびEAP-SIMパラメータ」レジストリの「属性タイプ（Skippable Attributes 128-255）」サブリッツのAT_BIDDING（136）の参照を更新しました。at_biddingはセクション4で定義されています。"
    },
    {
      "indent": 0,
      "text": "8.3. Key Derivation Function Namespace",
      "section_title": true,
      "ja": "8.3. キー派生関数名前空間"
    },
    {
      "indent": 3,
      "text": "IANA has updated the reference for the \"EAP-AKA' AT_KDF Key Derivation Function Values\" subregistry to point to this document. This subregistry appears under the \"EAP-AKA and EAP-SIM Parameters\" registry. The references for following entries have also been updated to point to this document. New values can be created through the Specification Required policy [RFC8126].",
      "ja": "この文書を指すために、IANAは「EAP-AKA 'AT_KDFキー派生関数値値」サブレジストの参照を更新しました。このサブレジストは、「EAP-AKAおよびEAP-SIMパラメータ」レジストリの下に表示されます。以下のエントリの参照もこの文書を指すように更新されています。必要なポリシー[RFC8126]を介して新しい値を作成できます。"
    },
    {
      "indent": 15,
      "text": "+=======+=======================+===========+\n| Value | Description           | Reference |\n+=======+=======================+===========+\n| 0     | Reserved              | RFC 9048  |\n+-------+-----------------------+-----------+\n| 1     | EAP-AKA' with CK'/IK' | RFC 9048  |\n+-------+-----------------------+-----------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 18,
      "text": "Table 3: EAP-AKA' AT_KDF Key Derivation Function Values",
      "ja": "表3：EAP-AKA 'AT_KDFキー派生関数値"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "ja": "9. 参考文献"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "ja": "9.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[FIPS.180-4] National Institute of Standards and Technology, \"Secure Hash Standard\", FIPS PUB 180-4, DOI 10.6028/NIST.FIPS.180-4, August 2015, <https://nvlpubs.nist.gov/nistpubs/FIPS/ NIST.FIPS.180-4.pdf>.",
      "ja": "[FIPS.180-4]国立標準技術研究所、「セキュアハッシュスタンダード」、FIPS PUB 180-4、DOI 10.6028 / NIST.FIPS.180-4、<https：//nvlpubs.nist.gov/ nistpubs / fips / nist.fips.180-4.pdf>。"
    },
    {
      "indent": 3,
      "text": "[RFC2104] Krawczyk, H., Bellare, M., and R. Canetti, \"HMAC: Keyed-Hashing for Message Authentication\", RFC 2104, DOI 10.17487/RFC2104, February 1997, <https://www.rfc-editor.org/info/rfc2104>.",
      "ja": "[RFC2104] Krawczyk、H.、Belleare、M.、およびR. Canetti、 \"HMAC：メッセージ認証のための鍵付きハッシング\"、RFC 2104、DOI 10.17487 / RFC2104、1997年2月、<https：//www.rfc-編集者.org / info / rfc2104>。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <https://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119] BRADNER、S、「RFCで使用するためのキーワード」、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<https：//www.rfc-editor.org/info/RFC2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC3748] Aboba, B., Blunk, L., Vollbrecht, J., Carlson, J., and H. Levkowetz, Ed., \"Extensible Authentication Protocol (EAP)\", RFC 3748, DOI 10.17487/RFC3748, June 2004, <https://www.rfc-editor.org/info/rfc3748>.",
      "ja": "[RFC3748] Aboba、B.、Blunk、L.、Vollbrecht、J.、Carlson、J.、およびH. Levkowetz、ED。、「拡張認証プロトコル（EAP）」、RFC 3748、DOI 10.17487 / RFC3748、2004年6月<https：//www.rfc-editor.org/info/rfc3748>。"
    },
    {
      "indent": 3,
      "text": "[RFC4187] Arkko, J. and H. Haverinen, \"Extensible Authentication Protocol Method for 3rd Generation Authentication and Key Agreement (EAP-AKA)\", RFC 4187, DOI 10.17487/RFC4187, January 2006, <https://www.rfc-editor.org/info/rfc4187>.",
      "ja": "[RFC4187] Arkko、J.およびH. HAVERINEN、「3世代認証のための拡張認証プロトコル方法（EAP-AKA）」、RFC 4187、DOI 10.17487 / RFC4187、2006年1月、<https：//www.rfc-editor.org/info/rfc4187>。"
    },
    {
      "indent": 3,
      "text": "[RFC7542] DeKok, A., \"The Network Access Identifier\", RFC 7542, DOI 10.17487/RFC7542, May 2015, <https://www.rfc-editor.org/info/rfc7542>.",
      "ja": "[RFC7542] Dekok、A。、「ネットワークアクセス識別子」、RFC 7542、DOI 10.17487 / RFC7542、<https：//www.rfc-editor.org/info/rfc7542>。"
    },
    {
      "indent": 3,
      "text": "[RFC8126] Cotton, M., Leiba, B., and T. Narten, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 8126, DOI 10.17487/RFC8126, June 2017, <https://www.rfc-editor.org/info/rfc8126>.",
      "ja": "[RFC8126]コットン、M.、Leiba、B.およびT.Narten、「RFCSのIANAに関する考察のためのガイドライン」、BCP 26、RFC 8126、DOI 10.17487 / RFC8126、2017年6月、<https：// www.rfc-editor.org / info / rfc8126>。"
    },
    {
      "indent": 3,
      "text": "[RFC8174] Leiba, B., \"Ambiguity of Uppercase vs Lowercase in RFC 2119 Key Words\", BCP 14, RFC 8174, DOI 10.17487/RFC8174, May 2017, <https://www.rfc-editor.org/info/rfc8174>.",
      "ja": "[RFC8174] Leiba、B.、RFC 2119キーワードの「大文字の曖昧さ」、BCP 14、RFC 8174、DOI 10.17487 / RFC8174、2017年5月、<https：//www.rfc-editor.org/info/RFC8174>。"
    },
    {
      "indent": 3,
      "text": "[TS-3GPP.23.003] 3GPP, \"3rd Generation Partnership Project; Technical Specification Group Core Network and Terminals; Numbering, addressing and identification (Release 16)\", Version 16.7.0, 3GPP Technical Specification 23.003, June 2021.",
      "ja": "[TS-3GPP.23.003] 3GPP、「第3世代パートナーシッププロジェクト。技術仕様グループコアネットワークと端末;番号付け、アドレス指定、識別（リリース16） \"、バージョン16.7.0、3GPP技術仕様23.003、2021年6月。"
    },
    {
      "indent": 3,
      "text": "[TS-3GPP.23.501] 3GPP, \"3rd Generation Partnership Project; Technical Specification Group Services and System Aspects; System architecture for the 5G System (5GS); (Release 16)\", Version 16.9.0, 3GPP Technical Specification 23.501, June 2021.",
      "ja": "[TS-3GPP.23.501] 3GPP、「第3世代パートナーシッププロジェクト;技術仕様グループサービスとシステム面; 5Gシステム（5GS）のためのシステムアーキテクチャ;（リリース16） \"、バージョン16.9.0、3GPP技術仕様23.501、6月2021。"
    },
    {
      "indent": 3,
      "text": "[TS-3GPP.24.302] 3GPP, \"3rd Generation Partnership Project; Technical Specification Group Core Network and Terminals; Access to the 3GPP Evolved Packet Core (EPC) via non-3GPP access networks; Stage 3; (Release 16)\", Version 16.4.0, 3GPP Technical Specification 24.302, July 2020.",
      "ja": "[TS-3GPP.24.302] 3GPP、「第3世代パートナーシッププロジェクト。技術仕様グループコアネットワークと端末; 3GPP Evolved Packet Core（EPC）に非3GPPアクセスネットワークを介してアクセスします。ステージ3;（リリース16） \"、バージョン2020年7月24.302,3GPPテクニカル仕様24.302。"
    },
    {
      "indent": 3,
      "text": "[TS-3GPP.24.501] 3GPP, \"3rd Generation Partnership Project; Technical Specification Group Core Network and Terminals; Non-Access-Stratum (NAS) protocol for 5G System (5GS); Stage 3; (Release 16)\", Version 16.9.0, 3GPP Draft Technical Specification 24.501, June 2021.",
      "ja": "[TS-3GPP.24.501] 3GPP、「第3世代パートナーシッププロジェクト。技術仕様グループコアネットワークと端末; 5Gシステム（5GS）の非アクセス層（NAS）プロトコル;ステージ3;（リリース16） \"、バージョン16.9.0、3GPPドラフト技術仕様24.501、2021年6月。"
    },
    {
      "indent": 3,
      "text": "[TS-3GPP.33.102] 3GPP, \"3rd Generation Partnership Project; Technical Specification Group Services and System Aspects; 3G Security; Security architecture (Release 16)\", Version 16.0.0, 3GPP Technical Specification 33.102, July 2020.",
      "ja": "[TS-3GPP.33.102] 3GPP、「第3世代パートナーシッププロジェクト。技術仕様グループサービスおよびシステムの側面; 3Gセキュリティ; 3Gセキュリティアーキテクチャ（リリース16）」、バージョン16.0.0、3GPPテクニカル仕様33.102、2020年7月。"
    },
    {
      "indent": 3,
      "text": "[TS-3GPP.33.402] 3GPP, \"3GPP System Architecture Evolution (SAE); Security aspects of non-3GPP accesses (Release 16)\", Version 16.0.0, 3GPP Technical Specification 33.402, July 2020.",
      "ja": "[TS-3GPP.33.402] 3GPP、「3GPPシステムアーキテクチャ進化（SAE）; 3GPPアクセス（リリース16）のセキュリティ面（リリース16）、3GPPテクニカル仕様33.402、2020年7月。"
    },
    {
      "indent": 3,
      "text": "[TS-3GPP.33.501] 3GPP, \"3rd Generation Partnership Project; Technical Specification Group Services and System Aspects; 3G Security; Security architecture and procedures for 5G System (Release 16)\", Version 16.7.1, 3GPP Technical Specification 33.501, July 2021.",
      "ja": "[TS-3GPP.33.501] 3GPP、「第3世代パートナーシッププロジェクト;技術仕様グループサービスとシステム面; 3Gセキュリティ; 5Gシステム（リリース16）のセキュリティアーキテクチャと手順、バージョン16.7.1、3GPP技術仕様33.501、7月2021。"
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "ja": "9.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[Arapinis2012] Arapinis, M., Mancini, L., Ritter, E., Ryan, M., Golde, N., Redon, R., and R. Borgaonkar, \"New Privacy Issues in Mobile Telephony: Fix and Verification\", in CCS '12: Proceedings of the 2012 ACM Conference on Computer and Communications Security, Raleigh, North Carolina, USA, DOI 10.1145/2382196.2382221, October 2012, <https://doi.org/10.1145/2382196.2382221>.",
      "ja": "[Arapinis2012] Arapinis、M.、Mancini、L.、Ritter、E.、Ryan、M.、Golde、N.、Redon、R.、およびR.Borgaonkar、「携帯電話の新規プライバシー問題：修正・検証」、CCS '12で：2012年10月、DOI 10.1145 / 2382196.23822222,2012、<https：//doi.org/10.1145/2382196.2382221>。"
    },
    {
      "indent": 3,
      "text": "[Basin2018] Basin, D., Dreier, J., Hirschi, L., Radomirović, S., Sasse, R., and V. Stettler, \"A Formal Analysis of 5G Authentication\", arXiv:1806.10360, DOI 10.1145/3243734.3243846, August 2018, <https://doi.org/10.1145/3243734.3243846>.",
      "ja": "[洗面台2018]盆地、D.、Draier、J.、Hirschi、L.、Radomirović、S.、Sasse、R.、およびV.Stettler、「5G認証の正式な分析」、ARXIV：1806.10360、DOI 10.1145 / 3243734.32438462018年8月、<https://doi.org/10.1145/3243734.3243846>。"
    },
    {
      "indent": 3,
      "text": "[Borgaonkar2018] Borgaonkar, R., Hirschi, L., Park, S., and A. Shaik, \"New Privacy Threat on 3G, 4G, and Upcoming 5G AKA Protocols\", in IACR Cryptology ePrint Archive, 2018.",
      "ja": "[Borgaonkar2018] Borgaonkar、R.、Hirschi、L.、Park、S.、およびA. Shaik、IACR暗号化Eprint Archive、2018年。"
    },
    {
      "indent": 3,
      "text": "[BT2013] Beekman, J. G. and C. Thompson, \"Breaking Cell Phone Authentication: Vulnerabilities in AKA, IMS and Android\", in 7th USENIX Workshop on Offensive Technologies, WOOT '13, August 2013.",
      "ja": "[BT2013] Beekman、J.G.およびC.Thompson、「携帯電話認証：Aka、IMSおよびAndroidの脆弱性」、攻撃技術に関する7番目のユースニックスワークショップ、2013年8月、WOOT '13。"
    },
    {
      "indent": 3,
      "text": "[EMU-AKA-PFS] Arkko, J., Norrman, K., and V. Torvinen, \"Perfect-Forward Secrecy for the Extensible Authentication Protocol Method for Authentication and Key Agreement (EAP-AKA' PFS)\", Work in Progress, Internet-Draft, draft-ietf-emu-aka-pfs-05, 30 October 2020, <https://datatracker.ietf.org/doc/html/ draft-ietf-emu-aka-pfs-05>.",
      "ja": "[Emu-AKA-PFS] Arkko、J.、Norrman、K.、およびV.Torvinen、「認証および主な契約のための拡張認証プロトコル方法のための完璧な秘密（EAP-AKA」PFS）」、進行中の作業、インターネットドラフト、ドラフト -  IETF-EMU-AKA-PFS-05,2020、<https://datatracker.ietf.org/doc/html/ romft-ietf-emu-aka-pfs-05>。"
    },
    {
      "indent": 3,
      "text": "[FIPS.180-1] National Institute of Standards and Technology, \"Secure Hash Standard\", FIPS PUB 180-1, DOI 10.6028/NIST.FIPS.180-1, April 1995, <https://csrc.nist.gov/publications/detail/fips/180/1/ archive/1995-04-17>.",
      "ja": "[FIPS.180-1]国立標準技術研究所、「セキュアハッシュスタンダード」、FIPS PUB 180-1、DOI 10.6028 / NIST.FIPS.180-1、<https：//csrc.nist.gov/出版物/詳細/ FIPS / 180/1 / archive / 1995-04-17>。"
    },
    {
      "indent": 3,
      "text": "[FIPS.180-2] National Institute of Standards and Technology, \"Secure Hash Standard\", FIPS PUB 180-2, August 2002, <https://csrc.nist.gov/publications/detail/fips/180/2/ archive/2002-08-01>.",
      "ja": "[FIPS.180-2]国立標準技術研究所、「セキュアハッシュスタンダード」、FIPS PUB 180-2、2002年8月2日、<https：//csrc.nist.gov/publications/detail/fips/180/2/アーカイブ/ 2002-08-01>。"
    },
    {
      "indent": 3,
      "text": "[Heist2015] Scahill, J. and J. Begley, \"How Spies Stole the Keys to the Encryption Castle\", February 2015, <https://firstlook.org/theintercept/2015/02/19/great-sim-heist/>.",
      "ja": "[Heist2015] Scahill、J.およびJ. Begley、2015年2月、2015年2月、<https://firstlook.org/theintps://firstlook.org/theintercept/2015/02/19/great-sim-heist/>。"
    },
    {
      "indent": 3,
      "text": "[Hussain2019] Hussain, S., Echeverria, M., Chowdhury, O., Li, N., and E. Bertino, \"Privacy Attacks to the 4G and 5G Cellular Paging Protocols Using Side Channel Information\", in the proceedings of NDSS '19, held 24-27 February, 2019, San Diego, California, 2019.",
      "ja": "[Hussain2019] Hussain、S.、Echeverria、M.、Chowdhury、O.、Li、N.、E.Bertino、NDSSの議事録の「サイドチャネル情報を使用した4Gおよび5Gセルラページングプロトコルへのプライバシー攻撃」'19、2019年2月24日27日、サンディエゴ、カリフォルニア、2019年。"
    },
    {
      "indent": 3,
      "text": "[Kune2012] Kune, D., Koelndorfer, J., Hopper, N., and Y. Kim, \"Location Leaks on the GSM Air Interface\", in the proceedings of NDSS '12, held 5-8 February, 2012, San Diego, California, 2012.",
      "ja": "[Kune2012] Kune、D.、Koelndorfer、J.、Hopper、N.、およびY. Kim、NDSS '12の議事録、2012年2月5日から8日、サン2012年カリフォルニア州ディエゴ。"
    },
    {
      "indent": 3,
      "text": "[MT2012] Mjølsnes, S. F. and J-K. Tsay, \"A Vulnerability in the UMTS and LTE Authentication and Key Agreement Protocols\", in Computer Network Security, Proceedings of the 6th International Conference on Mathematical Methods, Models and Architectures for Computer Network Security, Lecture Notes in Computer Science, Vol. 7531, pp. 65-76, DOI 10.1007/978-3-642-33704-8_6, October 2012, <https://doi.org/10.1007/978-3-642-33704-8_6>.",
      "ja": "[MT2012]Mjølsnes、S。F.およびJ-K。「UMTSおよびLTE認証および主意契約プロトコルの疑問」、コンピュータネットワークセキュリティ、第6回国際化学会議、コンピュータネットワークセキュリティのためのモデルおよびアーキテクチャ、コンピュータサイエンスの講演については、Vol。7531、PP。65-76、DOI 10.1007 / 978-3-642-33704-8_6、2012年10月、<https：//doi.org/10.1007/978-3-642-33704-8_6>。"
    },
    {
      "indent": 3,
      "text": "[RFC3310] Niemi, A., Arkko, J., and V. Torvinen, \"Hypertext Transfer Protocol (HTTP) Digest Authentication Using Authentication and Key Agreement (AKA)\", RFC 3310, DOI 10.17487/RFC3310, September 2002, <https://www.rfc-editor.org/info/rfc3310>.",
      "ja": "[RFC3310] Niemi、A.、Arkko、J.およびV.Torvinen、認証およびキー契約を使用した「ハイパーテキスト転送プロトコル（HTTP）ダイジェスト認証（AKA）、RFC 3310、DOI 10.17487 / RFC3310、2002年9月、<HTTPS//www.rfc-editor.org/info/rfc3310>。"
    },
    {
      "indent": 3,
      "text": "[RFC4086] Eastlake 3rd, D., Schiller, J., and S. Crocker, \"Randomness Requirements for Security\", BCP 106, RFC 4086, DOI 10.17487/RFC4086, June 2005, <https://www.rfc-editor.org/info/rfc4086>.",
      "ja": "[RFC4086]イーストレイク3RD、D.、Schiller、J.、S. Crocker、「セキュリティのためのランダム性要件」、BCP 106、RFC 4086、DOI 10.17487 / RFC4086、2005年6月、<https：//www.rfc-編集者.ORG / INFO / RFC4086>。"
    },
    {
      "indent": 3,
      "text": "[RFC4169] Torvinen, V., Arkko, J., and M. Naslund, \"Hypertext Transfer Protocol (HTTP) Digest Authentication Using Authentication and Key Agreement (AKA) Version-2\", RFC 4169, DOI 10.17487/RFC4169, November 2005, <https://www.rfc-editor.org/info/rfc4169>.",
      "ja": "[RFC4169] Torvinen、V.、Arkko、J.、M. Naslund、認証およびキー契約を使用した「Hypertext Transfer Protocol（HTTP）ダイジェスト認証（AKA）バージョン2 \"、RFC 4169、DOI 10.17487 / RFC4169、2005年11月<https://www.rfc-editor.org/info/rfc4169>。"
    },
    {
      "indent": 3,
      "text": "[RFC4186] Haverinen, H., Ed. and J. Salowey, Ed., \"Extensible Authentication Protocol Method for Global System for Mobile Communications (GSM) Subscriber Identity Modules (EAP-SIM)\", RFC 4186, DOI 10.17487/RFC4186, January 2006, <https://www.rfc-editor.org/info/rfc4186>.",
      "ja": "[RFC4186] Haverinen、H.、ED。J.Salowey、ED。、「モバイル通信（GSM）加入者識別モジュール（EAP-SIM）」、RFC 4186、DOI 10.17487 / RFC4186、<https：// www。rfc-editor.org/info/rfc4186>。"
    },
    {
      "indent": 3,
      "text": "[RFC4284] Adrangi, F., Lortz, V., Bari, F., and P. Eronen, \"Identity Selection Hints for the Extensible Authentication Protocol (EAP)\", RFC 4284, DOI 10.17487/RFC4284, January 2006, <https://www.rfc-editor.org/info/rfc4284>.",
      "ja": "[RFC4284] Adrangi、F.、Lortz、V.、Bari、F.、およびP. Eronen、「拡張認証プロトコル（EAP）」、RFC 4284、DOI 10.17487 / RFC4284、2006年1月、<HTTPS//www.rfc-editor.org/info/rfc4284>。"
    },
    {
      "indent": 3,
      "text": "[RFC4306] Kaufman, C., Ed., \"Internet Key Exchange (IKEv2) Protocol\", RFC 4306, DOI 10.17487/RFC4306, December 2005, <https://www.rfc-editor.org/info/rfc4306>.",
      "ja": "[RFC4306] Kaufman、C。、「インターネット鍵交換（IKEV2）プロトコル」、RFC 4306、DOI 10.17487 / RFC4306、2005年12月、<https：//www.rfc-editor.org/info/rfc4306>。"
    },
    {
      "indent": 3,
      "text": "[RFC5113] Arkko, J., Aboba, B., Korhonen, J., Ed., and F. Bari, \"Network Discovery and Selection Problem\", RFC 5113, DOI 10.17487/RFC5113, January 2008, <https://www.rfc-editor.org/info/rfc5113>.",
      "ja": "[RFC5113] Arkko、J.、Aboba、B.、Korhonen、J.、Ed。、およびF. Bari、「ネットワーク発見および選択問題」、RFC 5113、DOI 10.17487 / RFC 5113、2008年1月、<https：//www.rfc-editor.org/info/rfc5113>。"
    },
    {
      "indent": 3,
      "text": "[RFC5247] Aboba, B., Simon, D., and P. Eronen, \"Extensible Authentication Protocol (EAP) Key Management Framework\", RFC 5247, DOI 10.17487/RFC5247, August 2008, <https://www.rfc-editor.org/info/rfc5247>.",
      "ja": "[RFC5247] Aboba、B.、Simon、D.、およびP.Eronen、「拡張認証プロトコル（EAP）キー管理フレームワーク」、RFC 5247、DOI 10.17487 / RFC5247、2008年8月、<https：//www.rfc-editor.org/info/rfc5247>。"
    },
    {
      "indent": 3,
      "text": "[RFC5281] Funk, P. and S. Blake-Wilson, \"Extensible Authentication Protocol Tunneled Transport Layer Security Authenticated Protocol Version 0 (EAP-TTLSv0)\", RFC 5281, DOI 10.17487/RFC5281, August 2008, <https://www.rfc-editor.org/info/rfc5281>.",
      "ja": "[RFC5281] FUNK、P.およびS.BLAKE-WILSON、「拡張認証プロトコルトンネルトランスポート層セキュリティ認証プロトコルバージョン0（EAP-TTLSV0）」、RFC 5281、DOI 10.17487 / RFC5281、2008年8月、<HTTPS：// WWW.rfc-editor.org / info / rfc5281>。"
    },
    {
      "indent": 3,
      "text": "[RFC5448] Arkko, J., Lehtovirta, V., and P. Eronen, \"Improved Extensible Authentication Protocol Method for 3rd Generation Authentication and Key Agreement (EAP-AKA')\", RFC 5448, DOI 10.17487/RFC5448, May 2009, <https://www.rfc-editor.org/info/rfc5448>.",
      "ja": "[RFC5448] Arkko、J.、Lehtovirta、V.およびP. Eronen、「3世代認証および主意契約のための拡張認証プロトコル方法の改善（EAP-AKA '）」、RFC 5448、DOI 10.17487 / RFC 5448、2009年5月、<https://www.rfc-editor.org/info/rfc5448>。"
    },
    {
      "indent": 3,
      "text": "[RFC6194] Polk, T., Chen, L., Turner, S., and P. Hoffman, \"Security Considerations for the SHA-0 and SHA-1 Message-Digest Algorithms\", RFC 6194, DOI 10.17487/RFC6194, March 2011, <https://www.rfc-editor.org/info/rfc6194>.",
      "ja": "[RFC6194] Polk、T.、Chen、L.、Turner、S.、およびP.Hoffman、「SHA-0およびSHA-1メッセージ - ダイジェストアルゴリズムのセキュリティ上の考慮事項」、RFC 6194、DOI 10.17487 / RFC6194、3月2011年、<https://www.rfc-editor.org/info/rfc6194>。"
    },
    {
      "indent": 3,
      "text": "[RFC6973] Cooper, A., Tschofenig, H., Aboba, B., Peterson, J., Morris, J., Hansen, M., and R. Smith, \"Privacy Considerations for Internet Protocols\", RFC 6973, DOI 10.17487/RFC6973, July 2013, <https://www.rfc-editor.org/info/rfc6973>.",
      "ja": "[RFC6973] Cooper、A.、Tschofenig、H.、Aboba、B.、Peterson、J.、Morris、J.、Hansen、M.、R. Smith、「インターネットプロトコルに関するプライバシーに関する考察」、RFC 6973、DOI2017487 / RFC6973、2013年7月、<https：//www.rfc-editor.org/info/rfc6973>。"
    },
    {
      "indent": 3,
      "text": "[RFC7170] Zhou, H., Cam-Winget, N., Salowey, J., and S. Hanna, \"Tunnel Extensible Authentication Protocol (TEAP) Version 1\", RFC 7170, DOI 10.17487/RFC7170, May 2014, <https://www.rfc-editor.org/info/rfc7170>.",
      "ja": "[RFC7170] Zhou、H.、Cam-Winget、N.、Salowey、J.、およびS.Hanna、 \"Tunnel Extensible認証プロトコル（Teap）バージョン1\"、RFC 7170、DOI 10.17487 / RFC7170、2014年5月、<HTTPS///www.rfc-editor.org/info/rfc7170>。"
    },
    {
      "indent": 3,
      "text": "[RFC7258] Farrell, S. and H. Tschofenig, \"Pervasive Monitoring Is an Attack\", BCP 188, RFC 7258, DOI 10.17487/RFC7258, May 2014, <https://www.rfc-editor.org/info/rfc7258>.",
      "ja": "[RFC7258] Farrell、S.およびH.Schofenig、「Pervasive Monitoringは攻撃である」、BCP 188、RFC 7258、DOI 10.17487 / RFC7258、2014年5月、<https：//www.rfc-editor.org/info/rfc7258>。"
    },
    {
      "indent": 3,
      "text": "[RFC7296] Kaufman, C., Hoffman, P., Nir, Y., Eronen, P., and T. Kivinen, \"Internet Key Exchange Protocol Version 2 (IKEv2)\", STD 79, RFC 7296, DOI 10.17487/RFC7296, October 2014, <https://www.rfc-editor.org/info/rfc7296>.",
      "ja": "[RFC7296] Kaufman、C.、Hoffman、P.、NIR、Y.、ERONEN、P.、およびT.Kivinen、「インターネットキー交換プロトコル版2（IKEV2）」、STD 79、RFC 7296、DOI 10.17487 / RFC72962014年10月、<https://www.rfc-editor.org/info/rfc7296>。"
    },
    {
      "indent": 3,
      "text": "[Shaik2016] Shaik, A., Seifert, J., Borgaonkar, R., Asokan, N., and V. Niemi, \"Practical attacks against Privacy and Availability in 4G/LTE Mobile Communication Systems\", in the proceedings of NDSS '16 held 21-24 February, 2016, San Diego, California, 2012.",
      "ja": "[Shaik2016] Shaik、A.、Seifert、J.、Borgaonkar、R.、Asokan、N.およびV.Niemi、NDSSの議事録の「4G / LTEモバイル通信システムにおけるプライバシーと可用性に対する実用的攻撃」2016年2月21日、2012年2月21日、サンディエゴ、2012年2月21日。"
    },
    {
      "indent": 3,
      "text": "[TS-3GPP.35.208] 3GPP, \"3rd Generation Partnership Project; Technical Specification Group Services and System Aspects; 3G Security; Specification of the MILENAGE Algorithm Set: An example algorithm set for the 3GPP authentication and key generation functions f1, f1*, f2, f3, f4, f5 and f5*; Document 4: Design Conformance Test Data (Release 14)\", Version 16.0.0, 3GPP Technical Specification 35.208, July 2020.",
      "ja": "[TS-3GPP.35.208] 3GPP、「第3世代パートナーシッププロジェクト」技術仕様グループサービスおよびシステムの側面; 3Gセキュリティ;ミレネルアルゴリズムセットの仕様：3GPP認証とキー生成関数f1、f1 *のためのアルゴリズムの例F2、F3、F4、F5、F5 *;文書4：設計適合テストデータ（リリース14） \"、バージョン16.0.0、3GPPテクニカル仕様35.208、2020年7月。"
    },
    {
      "indent": 3,
      "text": "[ZF2005] Zhang, M. and Y. Fang, \"Security analysis and enhancements of 3GPP authentication and key agreement protocol\", IEEE Transactions on Wireless Communications, Vol. 4, No. 2, DOI 10.1109/TWC.2004.842941, March 2005, <https://doi.org/10.1109/TWC.2004.842941>.",
      "ja": "[ZF2005] Zhang、M.およびY. Fang、 \"3GPP認証およびキー契約プロトコルの強化\"、無線通信、Vol。4、No.2、DOI 10.1109 / TWC.2004.842941、2005年3月、<https：//doi.org/10.1109/twc.2004.842941>。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Changes from RFC 5448",
      "section_title": true,
      "ja": "付録A. RFC 5448からの変更"
    },
    {
      "indent": 3,
      "text": "The change from RFC 5448 was to refer to a newer version of [TS-3GPP.24.302]. This RFC includes an updated definition of the Network Name field to include 5G.",
      "ja": "RFC 5448からの変更は、[TS-3GPP.24.302]の新しいバージョンを参照することでした。このRFCには、5Gを含むネットワーク名フィールドの更新された定義が含まれています。"
    },
    {
      "indent": 3,
      "text": "Identifier usage for 5G has been specified in Section 5.3. Also, the requirements for generating pseudonym usernames and fast re-authentication identities have been updated from the original definition in RFC 5448, which referenced RFC 4187. See Section 5.",
      "ja": "5Gの識別子使用量はセクション5.3で指定されています。また、Pseudonymのユーザ名と高速再認証IDを生成するための要件は、RFC 4187を参照しているRFC 5448の元の定義から更新されています。セクション5を参照してください。"
    },
    {
      "indent": 3,
      "text": "Exported parameters for EAP-AKA' have been defined in Section 6, as required by [RFC5247], including the definition of those parameters for both full authentication and fast re-authentication.",
      "ja": "EAP-AKAのエクスポートされたパラメータは、[RFC5247]が[RFC5247]が必要に応じて、[RFC5247]では、フル認証と高速再認証の両方のパラメータの定義を含む。"
    },
    {
      "indent": 3,
      "text": "The security, privacy, and pervasive monitoring considerations have been updated or added. See Section 7.",
      "ja": "セキュリティ、プライバシー、および普及の監視に関する考慮事項が更新または追加されました。セクション7を参照してください。"
    },
    {
      "indent": 3,
      "text": "The references to [RFC2119], [RFC4306], [RFC7296], [FIPS.180-1] and [FIPS.180-2] have been updated to their most recent versions, and language in this document has been changed accordingly. However, these are merely reference updates to newer specifications; the actual protocol functions are the same as defined in the earlier RFCs.",
      "ja": "[RFC2119]、[RFC4306]、[RFC7296]、[FIPS.180-1]、[FIPS.180-2]への参照は、最新のバージョンに更新されており、この文書の言語はそれに応じて変更されました。ただし、これらは単に新しい仕様への参照更新です。実際のプロトコル機能は、以前のRFCで定義されているものと同じです。"
    },
    {
      "indent": 3,
      "text": "Similarly, references to all 3GPP technical specifications have been updated to their 5G versions (Release 16) or otherwise most recent version when there has not been a 5G-related update.",
      "ja": "同様に、すべての3GPP技術仕様への参照は、5G関連の更新があったことがない場合に、5Gバージョン（リリース16）またはその他の最新バージョンに更新されています。"
    },
    {
      "indent": 3,
      "text": "Finally, a number of clarifications have been made, including a summary of where attributes may appear.",
      "ja": "最後に、属性がどこで現れるかの要約を含む、いくつかの説明がなされてきた。"
    },
    {
      "indent": 0,
      "text": "Appendix B. Changes to RFC 4187",
      "section_title": true,
      "ja": "付録B. RFC 4187への変更"
    },
    {
      "indent": 3,
      "text": "In addition to specifying EAP-AKA', this document also mandates a change to another EAP method -- EAP-AKA that was defined in RFC 4187. This change was already mandated in RFC 5448 but repeated here to ensure that the latest EAP-AKA' specification contains the instructions about the necessary bidding down prevention feature in EAP-AKA as well.",
      "ja": "EAP-AKAを指定することに加えて、この文書はまた、RFC 4187で定義されていた他のEAPメソッド -  EAP-AKAへの変更を義務付けています。この変更はRFC 5448ではすでに義務付けられていますが、最新のEAP-AKAが確実にするためにここで繰り返されていました。'仕様には、EAP-AKAの必要な入札停止防止機能についての指示も含まれています。"
    },
    {
      "indent": 3,
      "text": "The changes to RFC 4187 relate only to the bidding down prevention support defined in Section 4. In particular, this document does not change how the Master Key (MK) is calculated or any other aspect of EAP-AKA. The provisions in this specification for EAP-AKA' do not apply to EAP-AKA, outside of Section 4.",
      "ja": "RFC 4187への変更は、セクション4で定義されている入札停止支援のみに関連しています。特に、この文書は、マスターキー（MK）の計算方法、またはEAP-AKAの他の側面を変更しません。EAP-AKAのこの仕様の規定は、セクション4以外のEAP-AKAには適用されません。"
    },
    {
      "indent": 0,
      "text": "Appendix C. Importance of Explicit Negotiation",
      "section_title": true,
      "ja": "付録C.明示的な交渉の重要性"
    },
    {
      "indent": 3,
      "text": "Choosing between the traditional and revised AKA key derivation functions is easy when their use is unambiguously tied to a particular radio access network, e.g., Long Term Evolution (LTE) as defined by 3GPP or evolved High Rate Packet Data (eHRPD) as defined by 3GPP2. There is no possibility for interoperability problems if this radio access network is always used in conjunction with new protocols that cannot be mixed with the old ones; clients will always know whether they are connecting to the old or new system.",
      "ja": "従来のAKA鍵導出機能を選択すると、3GPP2で定義されている3GPPまたは進化した高速パケットデータ（EHRPD）で定義された特定の無線アクセスネットワーク、例えば3GPPまたは進化した高速パケットデータ（EHRPD）のような長期進化（LTE）のような長期進化（LTE）が明確に関連付けられている場合は簡単です。。この無線アクセスネットワークが常に古いものと混合できない新しいプロトコルと組み合わせて使用されている場合、相互運用性の問題の可能性はありません。クライアントは常に、それらが古いまたは新しいシステムに接続しているかどうかを知っています。"
    },
    {
      "indent": 3,
      "text": "However, using the new key derivation functions over EAP introduces several degrees of separation, making the choice of the correct key derivation functions much harder. Many different types of networks employ EAP. Most of these networks have no means to carry any information about what is expected from the authentication process. EAP itself is severely limited in carrying any additional information, as noted in [RFC4284] and [RFC5113]. Even if these networks or EAP were extended to carry additional information, it would not affect millions of deployed access networks and clients attaching to them.",
      "ja": "ただし、EAPを介して新しいキー導出機能を使用すると、数度の分離が発生し、正しい鍵導出機能を選択できます。さまざまな種類のネットワークがEAPを使用しています。これらのネットワークのほとんどは、認証プロセスから予想されるものに関する情報を持つ手段はありません。[RFC4284]と[RFC5113]に記載されているように、EAP自体は追加情報を搬送する際に厳しく制限されています。これらのネットワークまたはEAPが追加情報を伝送するために拡張されていても、それはそれらに添付されている何百万もの展開されたアクセスネットワークとクライアントには影響しません。"
    },
    {
      "indent": 3,
      "text": "Simply changing the key derivation functions that EAP-AKA [RFC4187] uses would cause interoperability problems with all of the existing implementations. Perhaps it would be possible to employ strict separation into domain names that should be used by the new clients and networks. Only these new devices would then employ the new key derivation function. While this can be made to work for specific cases, it would be an extremely brittle mechanism, ripe to result in problems whenever client configuration, routing of authentication requests, or server configuration does not match expectations. It also does not help to assume that the EAP client and server are running a particular release of 3GPP network specifications. Network vendors often provide features from future releases early or do not provide all features of the current release. And obviously, there are many EAP and even some EAP-AKA implementations that are not bundled with the 3GPP network offerings. In general, these approaches are expected to lead to hard-to-diagnose problems and increased support calls.",
      "ja": "EAP-AKA [RFC4187]が使用する鍵導出機能を変更すると、既存の実装のすべてで相互運用性の問題が発生します。おそらく、新しいクライアントやネットワークによって使用されるべきドメイン名に厳密な分離を採用することが可能でしょう。その後、これらの新しいデバイスだけが新しいキーの派生機能を採用します。これは特定のケースのために作業するように作ることができますが、それは非常に脆いメカニズム、クライアントの構成、認証要求のルーティング、またはサーバー構成が期待に一致しないときに問題を引き起こす熟したメカニズムです。また、EAPクライアントとサーバーが3GPPネットワーク仕様の特定のリリースを実行していると仮定するのには役立ちません。ネットワークベンダはしばしば将来のリリースからの機能を早期に提供するか、現在のリリースのすべての機能を提供していません。そして明らかに、3GPPネットワーク製品にバンドルされていないEAPとさえもたくさんあります。一般に、これらのアプローチは問題のある問題やサポートコールの増加につながると予想されます。"
    },
    {
      "indent": 0,
      "text": "Appendix D. Test Vectors",
      "section_title": true,
      "ja": "付録D.テストベクトル"
    },
    {
      "indent": 3,
      "text": "Test vectors are provided below for four different cases. The test vectors may be useful for testing implementations. In the first two cases, we employ the MILENAGE algorithm and the algorithm configuration parameters (the subscriber key K and operator algorithm variant configuration value OP) from test set 19 in [TS-3GPP.35.208].",
      "ja": "テストベクトルは、4つの異なるケースについて以下に提供されます。テストベクトルは実装をテストするのに役立ちます。最初の2つのケースでは、[TS-3GPP.35.208]のテストセット19からのMERENAGEアルゴリズムとアルゴリズム構成パラメータ（加入者鍵Kおよびオペレータアルゴリズムのバリアント構成値OP）を使用します。"
    },
    {
      "indent": 3,
      "text": "The last two cases use artificial values as the output of AKA, which are useful only for testing the computation of values within EAP-AKA', not AKA itself.",
      "ja": "最後の2つのケースは、AKA自体ではなく、EAP-AKA内の値の計算をテストするのに役立つ、AKAの出力として人工値を使用します。"
    },
    {
      "indent": 3,
      "text": "Case 1",
      "ja": "ケース1"
    },
    {
      "indent": 6,
      "text": "The parameters for the AKA run are as follows:",
      "ja": "AKA実行のパラメータは次のとおりです。"
    },
    {
      "indent": 9,
      "text": "Identity: \"0555444333222111\"",
      "ja": "アイデンティティ： \"055544433322211\""
    },
    {
      "indent": 9,
      "text": "Network name: \"WLAN\"",
      "ja": "ネットワーク名： \"WLAN\""
    },
    {
      "indent": 9,
      "text": "RAND: 81e9 2b6c 0ee0 e12e bceb a8d9 2a99 dfa5",
      "ja": "RAND：81E9 2B6C 0EE0 E12E BCEB A8D9 2A99 DFA5"
    },
    {
      "indent": 9,
      "text": "AUTN: bb52 e91c 747a c3ab 2a5c 23d1 5ee3 51d5",
      "ja": "AUTN：BB52 E91C 747A C3AB 2A5C 23D1 5EE3 51D5"
    },
    {
      "indent": 9,
      "text": "IK: 9744 871a d32b f9bb d1dd 5ce5 4e3e 2e5a",
      "ja": "IK：9744 871A D32B F9BB D1DD 5CE5 4E3E 2E5A"
    },
    {
      "indent": 9,
      "text": "CK: 5349 fbe0 9864 9f94 8f5d 2e97 3a81 c00f",
      "ja": "CK：5349 FBE0 9864 9F94 8F5D 2E97 3A81 C00F"
    },
    {
      "indent": 9,
      "text": "RES: 28d7 b0f2 a2ec 3de5",
      "ja": "RES：28D7 B0F2 A2EC 3DE5"
    },
    {
      "indent": 6,
      "text": "Then the derived keys are generated as follows:",
      "ja": "その後、派生キーは次のように生成されます。"
    },
    {
      "indent": 9,
      "text": "CK': 0093 962d 0dd8 4aa5 684b 045c 9edf fa04",
      "ja": "CK '：0093 962D 0dd8 4aa 5 684b 045c 9edf FA04"
    },
    {
      "indent": 9,
      "text": "IK': ccfc 230c a74f cc96 c0a5 d611 64f5 a76c",
      "ja": "IK '：CCFC 230C A74F CC96 C0A5 D611 64F5 A76C"
    },
    {
      "indent": 9,
      "text": "K_encr: 766f a0a6 c317 174b 812d 52fb cd11 a179",
      "ja": "K_encr：766F A0A6 C317 174B 812D 52FB CD11 A179"
    },
    {
      "indent": 9,
      "text": "K_aut: 0842 ea72 2ff6 835b fa20 3249 9fc3 ec23 c2f0 e388 b4f0 7543 ffc6 77f1 696d 71ea",
      "ja": "K_AUT：0842 EA72 2FF6 835B FA20 3249 9FC3 EC23 C2F0 E388 B4F0 7543 FFC6 77F1 696D 71ea"
    },
    {
      "indent": 9,
      "text": "K_re: cf83 aa8b c7e0 aced 892a cc98 e76a 9b20 95b5 58c7 795c 7094 715c b339 3aa7 d17a",
      "ja": "K_RE：CF83 AA8B C7E0 ACED 892A CC98 E76A 9B20 95B5 58C7 795C 7094 715C B339 3AA7 D17A"
    },
    {
      "indent": 9,
      "text": "MSK: 67c4 2d9a a56c 1b79 e295 e345 9fc3 d187 d42b e0bf 818d 3070 e362 c5e9 67a4 d544 e8ec fe19 358a b303 9aff 03b7 c930 588c 055b abee 58a0 2650 b067 ec4e 9347 c75a",
      "ja": "MSK：67C4 2D9A A56C 1B79 E295 E345 9FC3 D187 D42B E0BF 818D 3070 E362 C5E9 67A4 D544 E8EC FE19 358A B303 9AFF 03B7 C930 588C 055B ABEE 58A0 2650 B067 EC4E 9347 C75A"
    },
    {
      "indent": 9,
      "text": "EMSK: f861 703c d775 590e 16c7 679e a387 4ada 8663 11de 2907 64d7 60cf 76df 647e a01c 313f 6992 4bdd 7650 ca9b ac14 1ea0 75c4 ef9e 8029 c0e2 90cd bad5 638b 63bc 23fb",
      "ja": "EMSK：F861 703C D775 590E 16C7 679E A387 4ADA 8663 11DE 2907 647E A01C 313F 6992 4BDD 7650 CA9B AC14 1EA0 75C4 EF9E 8029 C0E2 90CD BAD5 638B 63BC 23FB"
    },
    {
      "indent": 3,
      "text": "Case 2",
      "ja": "ケース2"
    },
    {
      "indent": 6,
      "text": "The parameters for the AKA run are as follows:",
      "ja": "AKA実行のパラメータは次のとおりです。"
    },
    {
      "indent": 9,
      "text": "Identity: \"0555444333222111\"",
      "ja": "アイデンティティ： \"055544433322211\""
    },
    {
      "indent": 9,
      "text": "Network name: \"HRPD\"",
      "ja": "ネットワーク名： \"hrpd\""
    },
    {
      "indent": 9,
      "text": "RAND: 81e9 2b6c 0ee0 e12e bceb a8d9 2a99 dfa5",
      "ja": "RAND：81E9 2B6C 0EE0 E12E BCEB A8D9 2A99 DFA5"
    },
    {
      "indent": 9,
      "text": "AUTN: bb52 e91c 747a c3ab 2a5c 23d1 5ee3 51d5",
      "ja": "AUTN：BB52 E91C 747A C3AB 2A5C 23D1 5EE3 51D5"
    },
    {
      "indent": 9,
      "text": "IK: 9744 871a d32b f9bb d1dd 5ce5 4e3e 2e5a",
      "ja": "IK：9744 871A D32B F9BB D1DD 5CE5 4E3E 2E5A"
    },
    {
      "indent": 9,
      "text": "CK: 5349 fbe0 9864 9f94 8f5d 2e97 3a81 c00f",
      "ja": "CK：5349 FBE0 9864 9F94 8F5D 2E97 3A81 C00F"
    },
    {
      "indent": 9,
      "text": "RES: 28d7 b0f2 a2ec 3de5",
      "ja": "RES：28D7 B0F2 A2EC 3DE5"
    },
    {
      "indent": 6,
      "text": "Then the derived keys are generated as follows:",
      "ja": "その後、派生キーは次のように生成されます。"
    },
    {
      "indent": 9,
      "text": "CK': 3820 f027 7fa5 f777 32b1 fb1d 90c1 a0da",
      "ja": "CK '：3820 F027 7FA5 F777 32B1 FB1D 90C1 A0DA"
    },
    {
      "indent": 9,
      "text": "IK': db94 a0ab 557e f6c9 ab48 619c a05b 9a9f",
      "ja": "IK '：DB94 A0AB 557E F6C9 AB48 619C A05B 9A9F"
    },
    {
      "indent": 9,
      "text": "K_encr: 05ad 73ac 915f ce89 ac77 e152 0d82 187b",
      "ja": "K_ENCR：05AD 73AC 915F CE89 AC77 E152 0D82 187B"
    },
    {
      "indent": 9,
      "text": "K_aut: 5b4a caef 62c6 ebb8 882b 2f3d 534c 4b35 2773 37a0 0184 f20f f25d 224c 04be 2afd",
      "ja": "K_AUT：5B4A CAEF 62C6 EBB8 882B 2F3D 534C 4B35 2773 37A0 0184 F20F F25D 224C 04BE 2AFD"
    },
    {
      "indent": 9,
      "text": "K_re: 3f90 bf5c 6e5e f325 ff04 eb5e f653 9fa8 cca8 3981 94fb d00b e425 b3f4 0dba 10ac",
      "ja": "K_RE：3F90 BF5C 6E5E F325 FF04 EB5E F653 9FA8 CCA8 3981 94FB D00B E425 B3F4 0DBA 10ac"
    },
    {
      "indent": 9,
      "text": "MSK: 87b3 2157 0117 cd6c 95ab 6c43 6fb5 073f f15c f855 05d2 bc5b b735 5fc2 1ea8 a757 57e8 f86a 2b13 8002 e057 5291 3bb4 3b82 f868 a961 17e9 1a2d 95f5 2667 7d57 2900",
      "ja": "MSK：87B3 2157 0117 CD6C 95AB 6C43 6FB5 073F F15C F855 05D2 1EA8 A757 57J8 F86A 2B13 8002 E057 5291 3BB4 3B82 F868 A961 17E9 1A2D 95F5 2667 7D57 2900"
    },
    {
      "indent": 9,
      "text": "EMSK: c891 d5f2 0f14 8a10 0755 3e2d ea55 5c9c b672 e967 5f4a 66b4 bafa 0273 79f9 3aee 539a 5979 d0a0 042b 9d2a e28b ed3b 17a3 1dc8 ab75 072b 80bd 0c1d a612 466e 402c",
      "ja": "EMSK：C891 D5F2 0F14 8A10 0755 3E2D EA55 5C9C B672 E967 5F4A 66B4 BAFA 0273 79F9 D0A0 042B 9D2A E28B ED3B 17A3 1DC8 AB75 072B 80BD 0C1D A612 466E 402C"
    },
    {
      "indent": 3,
      "text": "Case 3",
      "ja": "ケース3"
    },
    {
      "indent": 6,
      "text": "The parameters for the AKA run are as follows:",
      "ja": "AKA実行のパラメータは次のとおりです。"
    },
    {
      "indent": 9,
      "text": "Identity: \"0555444333222111\"",
      "ja": "アイデンティティ： \"055544433322211\""
    },
    {
      "indent": 9,
      "text": "Network name: \"WLAN\"",
      "ja": "ネットワーク名： \"WLAN\""
    },
    {
      "indent": 9,
      "text": "RAND: e0e0 e0e0 e0e0 e0e0 e0e0 e0e0 e0e0 e0e0",
      "ja": "RAND：E0E0 E0E0 E0E0 E0E0 E0E0 E0E0 E0E0 E0E0"
    },
    {
      "indent": 9,
      "text": "AUTN: a0a0 a0a0 a0a0 a0a0 a0a0 a0a0 a0a0 a0a0",
      "ja": "AUTN：A0A0 A0A0 A0A0 A0A0 A0A0 A0A0 A0A0 A0A0"
    },
    {
      "indent": 9,
      "text": "IK: b0b0 b0b0 b0b0 b0b0 b0b0 b0b0 b0b0 b0b0",
      "ja": "IK：B0B0 B0B0 B0B0 B0B0 B0B0 B0B0 B0B0 B0B0"
    },
    {
      "indent": 9,
      "text": "CK: c0c0 c0c0 c0c0 c0c0 c0c0 c0c0 c0c0 c0c0",
      "ja": "CK：C0C0 C0C0 C0C0 C0C0 C0C0 C0C0 C0C0 C0C0"
    },
    {
      "indent": 9,
      "text": "RES: d0d0 d0d0 d0d0 d0d0 d0d0 d0d0 d0d0 d0d0",
      "ja": "RES：D0D0 D0D0 D0D0 D0D0 D0D0 D0D0 D0D0 D0D0"
    },
    {
      "indent": 6,
      "text": "Then the derived keys are generated as follows:",
      "ja": "その後、派生キーは次のように生成されます。"
    },
    {
      "indent": 9,
      "text": "CK': cd4c 8e5c 68f5 7dd1 d7d7 dfd0 c538 e577",
      "ja": "CK '：CD4C 8E5C 68F5 7DD1 D7D7 DFD0 C538 E577"
    },
    {
      "indent": 9,
      "text": "IK': 3ece 6b70 5dbb f7df c459 a112 80c6 5524",
      "ja": "IK '：3ECE 6B70 5DBB F7DF C459 A112 80C6 5524"
    },
    {
      "indent": 9,
      "text": "K_encr: 897d 302f a284 7416 488c 28e2 0dcb 7be4",
      "ja": "K_encr：897D 302F A284 7416 488C 28E2 0DCB 7BE4"
    },
    {
      "indent": 9,
      "text": "K_aut: c407 00e7 7224 83ae 3dc7 139e b0b8 8bb5 58cb 3081 eccd 057f 9207 d128 6ee7 dd53",
      "ja": "K_AUT：C407 00J7 7224 83AE 3DC7 139E B0B8 8BB5 58CB 3081 ECCD 057F 9207 D128 6E7 DD53"
    },
    {
      "indent": 9,
      "text": "K_re: 0a59 1a22 dd8b 5b1c f29e 3d50 8c91 dbbd b4ae e230 5189 2c42 b6a2 de66 ea50 4473",
      "ja": "K_RE：0A59 1A22 DD8B 5B1C F29E 3D50 8C91 DBBD B4AE E230 5189 2C42 B6A2 DE66 EA50 4473"
    },
    {
      "indent": 9,
      "text": "MSK: 9f7d ca9e 37bb 2202 9ed9 86e7 cd09 d4a7 0d1a c76d 9553 5c5c ac40 a750 4699 bb89 61a2 9ef6 f3e9 0f18 3de5 861a d1be dc81 ce99 1639 1b40 1aa0 06c9 8785 a575 6df7",
      "ja": "MSK：9F7D CA9E 37BB 2202 9ED9 86E7 CD09 D4A7 0D1A C76D 9553 5C5C AC40 A750 4699 BB89 61A2 9EF6 F3E9 0F18 3DE5 861A D1BE DC81 CE99 1639 1B40 1AA0 06C9 8785 A575 6DF7"
    },
    {
      "indent": 9,
      "text": "EMSK: 724d e00b db9e 5681 87be 3fe7 4611 4557 d501 8779 537e e37f 4d3c 6c73 8cb9 7b9d c651 bc19 bfad c344 ffe2 b52c a78b d831 6b51 dacc 5f2b 1440 cb95 1552 1cc7 ba23",
      "ja": "EMSK：724D E00B DB9E 5681 87 BE 3FE7 4611 4557 D501 8779 537J 47F 4D3C 6C73 8CB9 7B9D C651 BC19 BFAD C344 FFE2 B52C A78B D831 6B51 DACC 5F2B 1440 CB95 1552 1CC7 BA23"
    },
    {
      "indent": 3,
      "text": "Case 4",
      "ja": "ケース4"
    },
    {
      "indent": 6,
      "text": "The parameters for the AKA run are as follows:",
      "ja": "AKA実行のパラメータは次のとおりです。"
    },
    {
      "indent": 9,
      "text": "Identity: \"0555444333222111\"",
      "ja": "アイデンティティ： \"055544433322211\""
    },
    {
      "indent": 9,
      "text": "Network name: \"HRPD\"",
      "ja": "ネットワーク名： \"hrpd\""
    },
    {
      "indent": 9,
      "text": "RAND: e0e0 e0e0 e0e0 e0e0 e0e0 e0e0 e0e0 e0e0",
      "ja": "RAND：E0E0 E0E0 E0E0 E0E0 E0E0 E0E0 E0E0 E0E0"
    },
    {
      "indent": 9,
      "text": "AUTN: a0a0 a0a0 a0a0 a0a0 a0a0 a0a0 a0a0 a0a0",
      "ja": "AUTN：A0A0 A0A0 A0A0 A0A0 A0A0 A0A0 A0A0 A0A0"
    },
    {
      "indent": 9,
      "text": "IK: b0b0 b0b0 b0b0 b0b0 b0b0 b0b0 b0b0 b0b0",
      "ja": "IK：B0B0 B0B0 B0B0 B0B0 B0B0 B0B0 B0B0 B0B0"
    },
    {
      "indent": 9,
      "text": "CK: c0c0 c0c0 c0c0 c0c0 c0c0 c0c0 c0c0 c0c0",
      "ja": "CK：C0C0 C0C0 C0C0 C0C0 C0C0 C0C0 C0C0 C0C0"
    },
    {
      "indent": 9,
      "text": "RES: d0d0 d0d0 d0d0 d0d0 d0d0 d0d0 d0d0 d0d0",
      "ja": "RES：D0D0 D0D0 D0D0 D0D0 D0D0 D0D0 D0D0 D0D0"
    },
    {
      "indent": 6,
      "text": "Then the derived keys are generated as follows:",
      "ja": "その後、派生キーは次のように生成されます。"
    },
    {
      "indent": 9,
      "text": "CK': 8310 a71c e6f7 5488 9613 da8f 64d5 fb46",
      "ja": "CK '：8310 A71C E6F7 5488 9613 DA8F 64D5 FB46"
    },
    {
      "indent": 9,
      "text": "IK': 5adf 1436 0ae8 3819 2db2 3f6f cb7f 8c76",
      "ja": "IK '：5ADF 1436 0aE8 3819 2DB2 3F6F CB7F 8C76"
    },
    {
      "indent": 9,
      "text": "K_encr: 745e 7439 ba23 8f50 fcac 4d15 d47c d1d9",
      "ja": "K_encr：745E 7439 BA23 8F50 FCAC 4D15 D47C D1D9"
    },
    {
      "indent": 9,
      "text": "K_aut: 3e1d 2aa4 e677 025c fd86 2a4b e183 61a1 3a64 5765 5714 63df 833a 9759 e809 9879",
      "ja": "K_AUT：3E1D 2AA4 E677 025C FD86 2A4B E183 61A1 3A64 5765 5714 63DF 833A 9759 E809 9879"
    },
    {
      "indent": 9,
      "text": "K_re: 99da 835e 2ae8 2462 576f e651 6fad 1f80 2f0f a119 1655 dd0a 273d a96d 04e0 fcd3",
      "ja": "K_RE：99DA 835E 2AJ8 2462 576F E651 6FAD 1F80 2F0F A119 1655 DD0A 273D A96D 04E0 FCD3"
    },
    {
      "indent": 9,
      "text": "MSK: c6d3 a6e0 ceea 951e b20d 74f3 2c30 61d0 680a 04b0 b086 ee87 00ac e3e0 b95f a026 83c2 87be ee44 4322 94ff 98af 26d2 cc78 3bac e75c 4b0a f7fd feb5 511b a8e4 cbd0",
      "ja": "MSK：C6D3 A6E0 CEA 951E B20D 74F3 2C30 61D0 680A 04B0 B086 EE87 00AC E3E0 B95F A026 83C2 87BE EE44 4322 94FF 98AF 26D2 CC78 3BAC E75C 4B0A F7FD FEB5 511B A8E4 CBD0"
    },
    {
      "indent": 9,
      "text": "EMSK: 7fb5 6813 838a dafa 99d1 40c2 f198 f6da cebf b6af ee44 4961 1054 02b5 08c7 f363 352c b291 9644 b504 63e6 a693 5415 0147 ae09 cbc5 4b8a 651d 8787 a689 3ed8 536d",
      "ja": "EMSK：7FB5 6813 838A DAFA 99D1 40C2 F198 F6DA CEBF B6AF EE44 4961 1054 02B5 08 C7 F363 352 C B291 9644 B504 63J6 A093 5415 0147 AE09 CBC5 4B8A 651D 8787 A689 3ED8 536D"
    },
    {
      "indent": 0,
      "text": "Acknowledgments",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Guenther Horn, Joe Salowey, Mats Naslund, Adrian Escott, Brian Rosenberg, Laksminath Dondeti, Ahmad Muhanna, Stefan Rommer, Miguel Garcia, Jan Kall, Ankur Agarwal, Jouni Malinen, John Mattsson, Jesus De Gregorio, Brian Weis, Russ Housley, Alfred Hoenes, Anand Palanigounder, Michael Richardson, Roman Danyliw, Dan Romascanu, Kyle Rose, Benjamin Kaduk, Alissa Cooper, Erik Kline, Murray Kucherawy, Robert Wilton, Warren Kumari, Andreas Kunz, Marcus Wong, Kalle Jarvinen, Daniel Migault, and Mohit Sethi for their in-depth reviews and interesting discussions in this problem space.",
      "ja": "著者らは、Guenther Horn、Joe Salowey、Mats Naslund、Adrian Salowey、Brian Rosenberg、Laksminath Dondeti、Ahmad Muhanna、Stefan Rommer、Miguel Garcia、Jan Kall、Ankur Agarwal、John Mattsson、Jesus de Gregorio、Jesus De Gregorio、BrianRuss Palanignoud、アナンド・パラニガニー・マイケル・リチャードソン、ラン・ダニーリー、マイケル・リチャードソン、ダン・ロマスコ語、Kyle Rose、Alissa Cooper、Alika Cooper、Robert Wilton、Warran Kumari、Andreas Kunz、Marcus Wong、Kalle Jarvinen、Daniel Migaute、そしてこの問題のあるスペースでの詳細なレビューと興味深い議論のためのMohit Sethi。"
    },
    {
      "indent": 0,
      "text": "Contributors",
      "ja": "貢献者"
    },
    {
      "indent": 3,
      "text": "The test vectors in Appendix D were provided by Yogendra Pal and Jouni Malinen, based on two independent implementations of this specification.",
      "ja": "付録Dのテストベクトルは、この仕様の2つの独立した実装に基づいて、Yogendra PalとJouni Malinenによって提供されました。"
    },
    {
      "indent": 3,
      "text": "Jouni Malinen provided suggested text for Section 6. John Mattsson provided much of the text for Section 7.1. Karl Norrman was the source of much of the information in Section 7.2.",
      "ja": "Jouni Malinenは、セクション6のための推奨されるテキストを提供しました.John Mattssonはセクション7.1のためのテキストの多くを提供しました。Karl Norrmanはセクション7.2の情報の多くの情報の源でした。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者の住所"
    },
    {
      "indent": 3,
      "text": "Jari Arkko Ericsson FI-02420 Jorvas Finland",
      "ja": "Jari Arkko Ericsson FI-02420 Jorvas Finland"
    },
    {
      "indent": 3,
      "text": "Email: jari.arkko@piuha.net",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Vesa Lehtovirta Ericsson FI-02420 Jorvas Finland",
      "ja": "Vesa Lehtovirta Ericsson FI-02420 Jorvas Finland"
    },
    {
      "indent": 3,
      "text": "Email: vesa.lehtovirta@ericsson.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Vesa Torvinen Ericsson FI-02420 Jorvas Finland",
      "ja": "Vesa Torvinen Ericsson FI-02420 Jorvas Finland"
    },
    {
      "indent": 3,
      "text": "Email: vesa.torvinen@ericsson.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Pasi Eronen Independent Finland",
      "ja": "Pasi Eronen独立フィンランド"
    },
    {
      "indent": 3,
      "text": "Email: pe@iki.fi",
      "raw": true,
      "ja": ""
    }
  ]
}