{
  "title": {
    "text": "RFC 9805 - Deprecation of the IPv6 Router Alert Option for New Protocols",
    "ja": "RFC 9805 - 新しいプロトコルのIPv6ルーターアラートオプションの廃止"
  },
  "number": 9805,
  "created_at": "2025-07-06 23:24:06.046992+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         R. Bonica\nRequest for Comments: 9805                              Juniper Networks\nUpdates: 2711                                                  June 2025\nCategory: Standards Track                                               \nISSN: 2070-1721",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Deprecation of the IPv6 Router Alert Option for New Protocols",
      "section_title": true,
      "ja": "新しいプロトコルのIPv6ルーターアラートオプションの廃止"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "section_title": true,
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document deprecates the IPv6 Router Alert option. Protocols that use the IPv6 Router Alert option may continue to do so, even in future versions. However, new protocols that are standardized in the future must not use the IPv6 Router Alert option.",
      "ja": "このドキュメントは、IPv6ルーターアラートオプションを廃止します。IPv6ルーターアラートオプションを使用するプロトコルは、将来のバージョンであっても引き続きそうすることができます。ただし、将来標準化された新しいプロトコルは、IPv6ルーターアラートオプションを使用してはなりません。"
    },
    {
      "indent": 3,
      "text": "This document updates RFC 2711.",
      "ja": "このドキュメントは、RFC 2711を更新します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "section_title": true,
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準トラックドキュメントです。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 7841.",
      "ja": "このドキュメントは、インターネットエンジニアリングタスクフォース（IETF）の製品です。IETFコミュニティのコンセンサスを表しています。公開レビューを受けており、インターネットエンジニアリングステアリンググループ（IESG）からの出版が承認されています。インターネット標準の詳細については、RFC 7841のセクション2で入手できます。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at https://www.rfc-editor.org/info/rfc9805.",
      "ja": "このドキュメントの現在のステータス、任意のERRATA、およびそのフィードバックを提供する方法に関する情報は、https://www.rfc-editor.org/info/rfc9805で取得できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "section_title": true,
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2025 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（c）2025 IETF Trustおよび文書著者として特定された人。無断転載を禁じます。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (https://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Revised BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Revised BSD License.",
      "ja": "このドキュメントは、BCP 78およびIETFドキュメント（https://trustee.ietf.org/license-info）に関連するIETF Trustの法的規定の対象となります。この文書に関するあなたの権利と制限を説明するので、これらの文書を注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、セクション4.Eで説明されている法的規定のセクション4.Eで説明されており、改訂されたBSDライセンスで説明されている保証なしで提供されるように、改訂されたBSDライセンステキストを含める必要があります。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "section_title": true,
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction\n2.  Requirements Language\n3.  Issues Associated with the IPv6 Router Alert Option\n4.  Deprecation of the IPv6 Router Alert Option\n5.  Future Work\n6.  Security Considerations\n7.  IANA Considerations\n8.  References\n  8.1.  Normative References\n  8.2.  Informative References\nAppendix A.  Protocols That Use the IPv6 Router Alert Option\nAcknowledgements\nAuthor's Address",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "In IPv6 [RFC8200], optional internet-layer information is encoded in separate headers that may be placed between the IPv6 header and the upper-layer header in a packet. There is a small number of such extension headers, each one identified by a distinct Next Header value.",
      "ja": "IPv6 [RFC8200]では、オプションのインターネットレイヤー情報は、IPv6ヘッダーとパケットの上層ヘッダーの間に配置できる別々のヘッダーでエンコードされています。このような拡張ヘッダーは少数あり、それぞれが明確な次のヘッダー値によって識別されます。"
    },
    {
      "indent": 3,
      "text": "One of these extension headers is called the Hop-by-Hop Options header. The Hop-by-Hop Options header is used to carry optional information that may be examined and processed by every node along a packet's delivery path.",
      "ja": "これらの拡張ヘッダーの1つは、ホップバイホップオプションヘッダーと呼ばれます。ホップバイホップオプションヘッダーは、パケットの配信パスに沿ってすべてのノードによって検査および処理される可能性のあるオプションの情報を運ぶために使用されます。"
    },
    {
      "indent": 3,
      "text": "The Hop-by-Hop Options header can carry one or more options. Among these is the IPv6 Router Alert option [RFC2711].",
      "ja": "ホップバイホップオプションヘッダーには、1つ以上のオプションが搭載できます。これらの中には、IPv6ルーターアラートオプション[RFC2711]があります。"
    },
    {
      "indent": 3,
      "text": "The IPv6 Router Alert option provides a mechanism whereby routers can know when to intercept datagrams not addressed to them without having to extensively examine every datagram. The semantic of the IPv6 Router Alert option is that \"routers should examine this datagram more closely\". Excluding this option tells the router that there is no need to examine this datagram more closely.",
      "ja": "IPv6ルーターアラートオプションは、すべてのデータグラムを広範囲に調査することなく、ルーターがそれらに宛てられていないデータグラムをいつインターセプトするかを知ることができるメカニズムを提供します。IPv6ルーターアラートオプションのセマンティックは、「ルーターがこのデータグラムをより詳細に調べる必要がある」ということです。このオプションを除くと、このデータグラムをより詳細に調べる必要がないことをルーターに指示します。"
    },
    {
      "indent": 3,
      "text": "As explained below, the IPv6 Router Alert option introduces many issues.",
      "ja": "以下で説明するように、IPv6ルーターアラートオプションは多くの問題を導入します。"
    },
    {
      "indent": 3,
      "text": "This document updates [RFC2711]. Implementers of protocols that continue to use the IPv6 Router Alert option can continue to reference [RFC2711] for IPv6 Router Alert option details.",
      "ja": "このドキュメントは[RFC2711]を更新します。IPv6ルーターアラートオプションを引き続き使用し続けるプロトコルの実装者は、IPv6ルーターアラートオプションの詳細を[RFC2711]を参照し続けることができます。"
    },
    {
      "indent": 0,
      "text": "2. Requirements Language",
      "section_title": true,
      "ja": "2. 要件言語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14 [RFC2119] [RFC8174] when, and only when, they appear in all capitals, as shown here.",
      "ja": "このドキュメント内のキーワード「MUST」、「MUST NOT」、「REQUIRED」、「SHALL」、「SHALL NOT」、「SHOULD」、「SHOULD NOT」、「RECOMMENDED」、「NOT RECOMMENDED」、「MAY」、および「OPTIONAL」は、ここに示すようにすべて大文字で表示されている場合にのみ、BCP 14 [RFC2119] [RFC8174] で説明されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "3. Issues Associated with the IPv6 Router Alert Option",
      "section_title": true,
      "ja": "3. IPv6ルーターアラートオプションに関連する問題"
    },
    {
      "indent": 3,
      "text": "[RFC6398] identifies security considerations associated with the IPv6 Router Alert option. In a nutshell, the IP Router Alert Option does not provide a universal mechanism to accurately and reliably distinguish between IP Router Alert packets of interest and unwanted IP Router Alerts. This creates a security concern because, short of appropriate router-implementation-specific mechanisms, the router's control plane is at risk of being flooded by unwanted traffic.",
      "ja": "[RFC6398]は、IPv6ルーターアラートオプションに関連するセキュリティ上の考慮事項を特定します。一言で言えば、IPルーターアラートオプションは、関心のあるIPルーターアラートパケットと不要なIPルーターアラートを正確かつ確実に区別するための普遍的なメカニズムを提供しません。これは、適切なルーターを実装する特異的メカニズムを除いて、ルーターのコントロールプレーンが望ましくないトラフィックに浸水するリスクがあるため、セキュリティ上の懸念を生み出します。"
    },
    {
      "indent": 12,
      "text": "NOTE: Many routers maintain separation between forwarding and control plane hardware. The forwarding plane is implemented on high-performance Application-Specific Integrated Circuits (ASICs) and Network Processors (NPs), while the control plane is implemented on general-purpose processors. Given this difference, the control plane is more susceptible to a Denial-of-Service (DoS) attack than the forwarding plane.",
      "ja": "注：多くのルーターは、転送とコントロールプレーンのハードウェアの分離を維持しています。転送面は、高性能アプリケーション固有の統合回路（ASIC）およびネットワークプロセッサ（NP）に実装され、コントロールプレーンは汎用プロセッサに実装されます。この違いを考えると、コントロールプレーンは、転送面よりもサービス拒否（DOS）攻撃の影響を受けやすくなります。"
    },
    {
      "indent": 3,
      "text": "[RFC6192] demonstrates how a network operator can deploy Access Control Lists (ACLs) that protect the control plane from DoS attacks. These ACLs are effective and efficient when they select packets based upon information that can be found in a fixed position. However, they become less effective and less efficient when they must parse a Hop-by-Hop Options header, searching for the IPv6 Router Alert option.",
      "ja": "[RFC6192]は、ネットワークオペレーターがDOS攻撃からコントロールプレーンを保護するアクセス制御リスト（ACL）を展開する方法を示しています。これらのACLは、固定位置で見つけることができる情報に基づいてパケットを選択する場合、効果的かつ効率的です。ただし、IPv6ルーターアラートオプションを検索して、ホップバイホップオプションヘッダーを解析する必要がある場合、効果が低下し、効率が低下します。"
    },
    {
      "indent": 3,
      "text": "Network operators can address the security considerations raised in [RFC6398] by:",
      "ja": "ネットワークオペレーターは、[RFC6398]で提起されたセキュリティ上の考慮事項に次のことに対処できます。"
    },
    {
      "indent": 6,
      "text": "* Deploying the operationally complex and computationally expensive ACLs described in [RFC6192].",
      "ja": "* [RFC6192]で説明されている動作的に複雑で計算上の高価なACLを展開します。"
    },
    {
      "indent": 6,
      "text": "* Configuring their routers to ignore the IPv6 Router Alert option.",
      "ja": "* IPv6ルーターアラートオプションを無視するようにルーターを構成します。"
    },
    {
      "indent": 6,
      "text": "* Dropping or severely rate limiting packets that contain the Hop-by-Hop Options header at the network edge.",
      "ja": "* ネットワークエッジにホップバイホップオプションヘッダーを含む制限パケットをドロップするか、重度に評価します。"
    },
    {
      "indent": 3,
      "text": "These options become less viable as protocol designers continue to design protocols that use the IPv6 Router Alert option.",
      "ja": "これらのオプションは、Protocol DesignersがIPv6ルーターアラートオプションを使用するプロトコルを設計し続けているため、実行可能になりません。"
    },
    {
      "indent": 3,
      "text": "[RFC9673] seeks to eliminate hop-by-hop processing on the control plane. However, because of its unique function, the IPv6 Router Alert option is granted an exception to this rule. One approach would be to deprecate the IPv6 Router Alert option, because current usage beyond the local network appears to be limited and packets containing Hop-by-Hop options are frequently dropped. Deprecation would allow current implementations to continue using it, but its use could be phased out over time.",
      "ja": "[RFC9673]は、コントロールプレーンのホップバイホップ処理を排除しようとしています。ただし、そのユニークな機能のため、IPv6ルーターアラートオプションには、このルールの例外が付与されます。1つのアプローチは、ローカルネットワークを超えた現在の使用が制限されており、ホップバイホップオプションを含むパケットが頻繁にドロップされるため、IPv6ルーターアラートオプションを非難することです。非難により、現在の実装はそれを使用し続けることができますが、その使用は時間とともに段階的に廃止される可能性があります。"
    },
    {
      "indent": 0,
      "text": "4. Deprecation of the IPv6 Router Alert Option",
      "section_title": true,
      "ja": "4. IPv6ルーターアラートオプションの廃止"
    },
    {
      "indent": 3,
      "text": "This document deprecates the IPv6 Router Alert option. Protocols that use the IPv6 Router Alert option MAY continue to do so, even in future versions. However, new protocols that are standardized in the future MUST NOT use the IPv6 Router Alert option. Appendix A contains an exhaustive list of protocols that MAY continue to use the IPv6 Router Alert option.",
      "ja": "このドキュメントは、IPv6ルーターアラートオプションを廃止します。IPv6ルーターアラートオプションを使用するプロトコルは、将来のバージョンであっても引き続きそうすることができます。ただし、将来標準化された新しいプロトコルは、IPv6ルーターアラートオプションを使用してはなりません。付録Aには、IPv6ルーターアラートオプションを引き続き使用できるプロトコルの徹底的なリストが含まれています。"
    },
    {
      "indent": 3,
      "text": "This document updates [RFC2711].",
      "ja": "このドキュメントは[RFC2711]を更新します。"
    },
    {
      "indent": 0,
      "text": "5. Future Work",
      "section_title": true,
      "ja": "5. 将来の仕事"
    },
    {
      "indent": 3,
      "text": "A number of protocols use the IPv6 Router Alert option; these are listed in Appendix A. The only protocols in Appendix A that have widespread deployment are Multicast Listener Discovery Version 2 (MLDv2) [RFC9777] and Multicast Router Discovery (MRD) [RFC4286]. The other protocols either have limited deployment, are experimental, or have no known implementation.",
      "ja": "多くのプロトコルがIPv6ルーターアラートオプションを使用しています。これらは付録Aにリストされています。付録Aの唯一のプロトコルは、広範囲にわたる展開があります。マルチキャストリスナーディスカバリーバージョン2（MLDV2）[RFC9777]およびマルチキャストルーターディスカバリー（MRD）[RFC4286]です。他のプロトコルは、展開が限られているか、実験的であるか、または既知の実装がありません。"
    },
    {
      "indent": 3,
      "text": "It is left for future work to develop new versions of MLDv2 and MRD that do not rely on the IPv6 Router Alert option. That task is out of scope for this document.",
      "ja": "IPv6ルーターアラートオプションに依存していないMLDV2とMRDの新しいバージョンを開発するために、将来の作業が残されています。このタスクは、このドキュメントの範囲外です。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "This document mitigates all security considerations associated with the IPv6 Router Alert option. These security considerations can be found in [RFC2711], [RFC6192], and [RFC6398].",
      "ja": "このドキュメントは、IPv6ルーターアラートオプションに関連するすべてのセキュリティに関する考慮事項を軽減します。これらのセキュリティ上の考慮事項は、[RFC2711]、[RFC6192]、および[RFC6398]に記載されています。"
    },
    {
      "indent": 0,
      "text": "7. IANA Considerations",
      "section_title": true,
      "ja": "7. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has marked the IPv6 Router Alert option as \"DEPRECATED for New Protocols\" in the \"Destination Options and Hop-by-Hop Options\" registry <https://www.iana.org/assignments/ipv6-parameters> and added this document as a reference.",
      "ja": "IANAは、「宛先オプションとホップバイホップオプション」レジストリの「新しいプロトコルに廃止された」としてIPv6ルーターアラートオプションをマークしました<https://www.iana.org/assignments/ipv6-parameters>そしてこのドキュメントを参照として追加しました。"
    },
    {
      "indent": 3,
      "text": "IANA has also made a note in the \"IPv6 Router Alert Option Values\" registry <https://www.iana.org/assignments/ipv6-routeralert-values> stating that the registry is closed for allocations and added a reference to this document. The experimental codepoints in this registry have been changed to \"Reserved\" (i.e., they are no longer available for experimentation).",
      "ja": "IANAはまた、「IPv6ルーターアラートオプション値」レジストリ<https://www.iana.org/assignments/ipv6-routeralert-values>のメモを作成しました。レジストリが割り当てのために閉じられ、このドキュメントへの参照を追加したことを示しています。このレジストリの実験的コードポイントは、「予約済み」に変更されました（つまり、実験には利用できなくなりました）。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8. 参考文献"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "ja": "8.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC2119]  Bradner, S., \"Key words for use in RFCs to Indicate\n           Requirement Levels\", BCP 14, RFC 2119,\n           DOI 10.17487/RFC2119, March 1997,\n           <https://www.rfc-editor.org/info/rfc2119>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC2711]  Partridge, C. and A. Jackson, \"IPv6 Router Alert Option\",\n           RFC 2711, DOI 10.17487/RFC2711, October 1999,\n           <https://www.rfc-editor.org/info/rfc2711>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC6398]  Le Faucheur, F., Ed., \"IP Router Alert Considerations and\n           Usage\", BCP 168, RFC 6398, DOI 10.17487/RFC6398, October\n           2011, <https://www.rfc-editor.org/info/rfc6398>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC8174]  Leiba, B., \"Ambiguity of Uppercase vs Lowercase in RFC\n           2119 Key Words\", BCP 14, RFC 8174, DOI 10.17487/RFC8174,\n           May 2017, <https://www.rfc-editor.org/info/rfc8174>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC8200]  Deering, S. and R. Hinden, \"Internet Protocol, Version 6\n           (IPv6) Specification\", STD 86, RFC 8200,\n           DOI 10.17487/RFC8200, July 2017,\n           <https://www.rfc-editor.org/info/rfc8200>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC9673]  Hinden, R. and G. Fairhurst, \"IPv6 Hop-by-Hop Options\n           Processing Procedures\", RFC 9673, DOI 10.17487/RFC9673,\n           October 2024, <https://www.rfc-editor.org/info/rfc9673>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "ja": "8.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[RFC1633]  Braden, R., Clark, D., and S. Shenker, \"Integrated\n           Services in the Internet Architecture: an Overview\",\n           RFC 1633, DOI 10.17487/RFC1633, June 1994,\n           <https://www.rfc-editor.org/info/rfc1633>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC3031]  Rosen, E., Viswanathan, A., and R. Callon, \"Multiprotocol\n           Label Switching Architecture\", RFC 3031,\n           DOI 10.17487/RFC3031, January 2001,\n           <https://www.rfc-editor.org/info/rfc3031>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC3175]  Baker, F., Iturralde, C., Le Faucheur, F., and B. Davie,\n           \"Aggregation of RSVP for IPv4 and IPv6 Reservations\",\n           RFC 3175, DOI 10.17487/RFC3175, September 2001,\n           <https://www.rfc-editor.org/info/rfc3175>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC3208]  Speakman, T., Crowcroft, J., Gemmell, J., Farinacci, D.,\n           Lin, S., Leshchiner, D., Luby, M., Montgomery, T., Rizzo,\n           L., Tweedly, A., Bhaskar, N., Edmonstone, R.,\n           Sumanasekera, R., and L. Vicisano, \"PGM Reliable Transport\n           Protocol Specification\", RFC 3208, DOI 10.17487/RFC3208,\n           December 2001, <https://www.rfc-editor.org/info/rfc3208>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC4080]  Hancock, R., Karagiannis, G., Loughney, J., and S. Van den\n           Bosch, \"Next Steps in Signaling (NSIS): Framework\",\n           RFC 4080, DOI 10.17487/RFC4080, June 2005,\n           <https://www.rfc-editor.org/info/rfc4080>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC4286]  Haberman, B. and J. Martin, \"Multicast Router Discovery\",\n           RFC 4286, DOI 10.17487/RFC4286, December 2005,\n           <https://www.rfc-editor.org/info/rfc4286>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC5946]  Le Faucheur, F., Manner, J., Narayanan, A., Guillou, A.,\n           and H. Malik, \"Resource Reservation Protocol (RSVP)\n           Extensions for Path-Triggered RSVP Receiver Proxy\",\n           RFC 5946, DOI 10.17487/RFC5946, October 2010,\n           <https://www.rfc-editor.org/info/rfc5946>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC5971]  Schulzrinne, H. and R. Hancock, \"GIST: General Internet\n           Signalling Transport\", RFC 5971, DOI 10.17487/RFC5971,\n           October 2010, <https://www.rfc-editor.org/info/rfc5971>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC5979]  Shen, C., Schulzrinne, H., Lee, S., and J. Bang, \"NSIS\n           Operation over IP Tunnels\", RFC 5979,\n           DOI 10.17487/RFC5979, March 2011,\n           <https://www.rfc-editor.org/info/rfc5979>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC6016]  Davie, B., Le Faucheur, F., and A. Narayanan, \"Support for\n           the Resource Reservation Protocol (RSVP) in Layer 3 VPNs\",\n           RFC 6016, DOI 10.17487/RFC6016, October 2010,\n           <https://www.rfc-editor.org/info/rfc6016>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC6192]  Dugal, D., Pignataro, C., and R. Dunn, \"Protecting the\n           Router Control Plane\", RFC 6192, DOI 10.17487/RFC6192,\n           March 2011, <https://www.rfc-editor.org/info/rfc6192>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC6401]  Le Faucheur, F., Polk, J., and K. Carlberg, \"RSVP\n           Extensions for Admission Priority\", RFC 6401,\n           DOI 10.17487/RFC6401, October 2011,\n           <https://www.rfc-editor.org/info/rfc6401>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC7506]  Raza, K., Akiya, N., and C. Pignataro, \"IPv6 Router Alert\n           Option for MPLS Operations, Administration, and\n           Maintenance (OAM)\", RFC 7506, DOI 10.17487/RFC7506, April\n           2015, <https://www.rfc-editor.org/info/rfc7506>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC8029]  Kompella, K., Swallow, G., Pignataro, C., Ed., Kumar, N.,\n           Aldrin, S., and M. Chen, \"Detecting Multiprotocol Label\n           Switched (MPLS) Data-Plane Failures\", RFC 8029,\n           DOI 10.17487/RFC8029, March 2017,\n           <https://www.rfc-editor.org/info/rfc8029>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC9570]  Kompella, K., Bonica, R., and G. Mirsky, Ed., \"Deprecating\n           the Use of Router Alert in LSP Ping\", RFC 9570,\n           DOI 10.17487/RFC9570, May 2024,\n           <https://www.rfc-editor.org/info/rfc9570>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "[RFC9777]  Haberman, B., Ed., \"Multicast Listener Discovery Version 2\n           (MLDv2) for IPv6\", STD 101, RFC 9777,\n           DOI 10.17487/RFC9777, March 2025,\n           <https://www.rfc-editor.org/info/rfc9777>.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Appendix A. Protocols That Use the IPv6 Router Alert Option",
      "section_title": true,
      "ja": "付録A. IPv6ルーターアラートオプションを使用するプロトコル"
    },
    {
      "indent": 3,
      "text": "Table 1 contains an exhaustive list of protocols that use the IPv6 Router Alert option. There are no known IPv6 implementations of MPLS Ping. Neither Integrated Services (Intserv) nor Next Steps in Signaling (NSIS) are widely deployed. All NSIS protocols are experimental. Pragmatic Generic Multicast (PGM) is experimental, and there are no known IPv6 implementations.",
      "ja": "表1には、IPv6ルーターアラートオプションを使用するプロトコルの徹底的なリストが含まれています。MPLS pingのIPv6実装は既知のものはありません。統合サービス（INTSERV）も、シグナリングの次のステップ（NSIS）も広く展開されていません。すべてのNSISプロトコルは実験的です。実用的なジェネリックマルチキャスト（PGM）は実験的であり、既知のIPv6実装はありません。"
    },
    {
      "indent": 3,
      "text": "+=================+=============================+==================+\n| Protocol        | References                  | Application      |\n+=================+=============================+==================+\n| Multicast       | [RFC9777]                   | IPv6 Multicast   |\n| Listener        |                             |                  |\n| Discovery       |                             |                  |\n| Version 2       |                             |                  |\n| (MLDv2)         |                             |                  |\n+-----------------+-----------------------------+------------------+\n| Multicast       | [RFC4286]                   | IPv6 Multicast   |\n| Router          |                             |                  |\n| Discovery (MRD) |                             |                  |\n+-----------------+-----------------------------+------------------+\n| Pragmatic       | [RFC3208]                   | IPv6 Multicast   |\n| General         |                             |                  |\n| Multicast (PGM) |                             |                  |\n+-----------------+-----------------------------+------------------+\n| MPLS Ping (Use  | [RFC7506][RFC8029][RFC9570] | MPLS Operations, |\n| of the IPv6     |                             | Administration,  |\n| Router Alert    |                             | and Maintenance  |\n| option is       |                             | (OAM)            |\n| deprecated)     |                             |                  |\n+-----------------+-----------------------------+------------------+\n| Resource        | [RFC3175] [RFC5946]         | Integrated       |\n| Reservation     | [RFC6016] [RFC6401]         | Services         |\n| Protocol        |                             | (Intserv)        |\n| (RSVP): Both    |                             | [RFC1633] and    |\n| IPv4 and IPv6   |                             | Multiprotocol    |\n| implementations |                             | Label Switching  |\n|                 |                             | (MPLS) [RFC3031] |\n+-----------------+-----------------------------+------------------+\n| Next Steps in   | [RFC5979] [RFC5971]         | NSIS [RFC4080]   |\n| Signaling       |                             |                  |\n| (NSIS)          |                             |                  |\n+-----------------+-----------------------------+------------------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 9,
      "text": "Table 1: Protocols That Use the IPv6 Router Alert Option",
      "ja": "表1：IPv6ルーターアラートオプションを使用するプロトコル"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "section_title": true,
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Thanks to Zafar Ali, Brian Carpenter, Toerless Eckert, David Farmer, Adrian Farrel, Bob Hinden, and Jen Linkova for their reviews of this document.",
      "ja": "Zafar Ali、Brian Carpenter、Toerless Eckert、David Farmer、Adrian Farrel、Bob Hinden、Jen Linkovaに感謝します。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "section_title": true,
      "ja": "著者の連絡先"
    },
    {
      "indent": 3,
      "text": "Ron Bonica\nJuniper Networks\nUnited States of America\nEmail: rbonica@juniper.net",
      "raw": true,
      "ja": ""
    }
  ]
}