{
  "title": {
    "text": "RFC 9224 - Finding the Authoritative Registration Data Access Protocol (RDAP) Service",
    "ja": "RFC 9224 - 権限登録データアクセスプロトコル（RDAP）サービスの検索"
  },
  "number": 9224,
  "created_at": "2022-04-05 02:59:57.608175+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                       M. Blanchet\nRequest for Comments: 9224                                      Viagenie\nSTD: 95                                                       March 2022\nObsoletes: 7484\nCategory: Standards Track\nISSN: 2070-1721",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Finding the Authoritative Registration Data Access Protocol (RDAP) Service",
      "ja": "権限登録データアクセスプロトコル（RDAP）サービスの検索"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document specifies a method to find which Registration Data Access Protocol (RDAP) server is authoritative to answer queries for a requested scope, such as domain names, IP addresses, or Autonomous System numbers. This document obsoletes RFC 7484.",
      "ja": "このドキュメントは、どの登録データアクセスプロトコル（RDAP）サーバが、ドメイン名、IPアドレス、および自律システム番号など、要求されたスコープのクエリに応答する権限を持つ方法を指定します。この文書はRFC 7484を廃止します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これはインターネット規格のトラック文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 7841.",
      "ja": "この文書はインターネットエンジニアリングタスクフォース（IETF）の製品です。IETFコミュニティのコンセンサスを表します。それはパブリックレビューを受け、インターネットエンジニアリングステアリンググループ（IESG）による出版の承認を受けました。インターネット規格に関する詳細情報は、RFC 7841のセクション2で利用できます。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at https://www.rfc-editor.org/info/rfc9224.",
      "ja": "この文書の現在のステータス、任意のエラータ、およびフィードバックを提供する方法は、https://www.rfc-editor.org/info/frfc9224で入手できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2022 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（c）2022 IETF信頼と文書の著者として識別された人。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (https://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Revised BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Revised BSD License.",
      "ja": "この文書は、この文書の公開日に有効なIETF文書（https://trustee.ietf.org/License-Info）に関するBCP 78およびIETF信頼の法的規定の対象となります。この文書に関してあなたの権利と制限を説明するので、これらの文書をよくレビューしてください。この文書から抽出されたコードコンポーネントには、信託法定規定のセクション4。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction\n2.  Conventions Used in This Document\n3.  Structure of the RDAP Bootstrap Service Registries\n4.  Bootstrap Service Registry for Domain Name Space\n5.  Bootstrap Service Registries for Internet Numbers\n  5.1.  Bootstrap Service Registry for IPv4 Address Space\n  5.2.  Bootstrap Service Registry for IPv6 Address Space\n  5.3.  Bootstrap Service Registry for AS Number Space\n6.  Entity\n7.  Non-existent Entries or RDAP URL Values\n8.  Deployment and Implementation Considerations\n9.  Limitations\n10. Formal Definition\n  10.1.  Imported JSON Terms\n  10.2.  Registry Syntax\n11. Security Considerations\n12. IANA Considerations\n  12.1.  Bootstrap Service Registry for IPv4 Address Space\n  12.2.  Bootstrap Service Registry for IPv6 Address Space\n  12.3.  Bootstrap Service Registry for AS Number Space\n  12.4.  Bootstrap Service Registry for Domain Name Space\n13. References\n  13.1.  Normative References\n  13.2.  Informative References\nAppendix A.  Changes since RFC 7484\nAcknowledgements\nAuthor's Address",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "Querying and retrieving registration data from registries are defined in the Registration Data Access Protocol (RDAP) [RFC7480] [RFC7481] [RFC9082] [RFC9083]. These documents do not specify where to send the queries. This document specifies a method to find which server is authoritative to answer queries for the requested scope.",
      "ja": "レジストリからの登録データの問い合わせと取得は、登録データアクセスプロトコル（RFC7480] [RFC7481] [RFC9082] [RFC9083]で定義されています。これらの文書は、クエリを送信する場所を指定しません。このドキュメントは、要求されたスコープのクエリに応答する権限があるかを見つけるためのメソッドを指定します。"
    },
    {
      "indent": 3,
      "text": "Top-Level Domains (TLDs), Autonomous System (AS) numbers, and network blocks are delegated by IANA to Internet registries such as TLD registries and Regional Internet Registries (RIRs) that then issue further delegations and maintain information about them. Thus, the bootstrap information needed by RDAP clients is best generated from data and processes already maintained by IANA; the relevant registries already exist at [ipv4reg], [ipv6reg], [asreg], and [domainreg]. This document obsoletes [RFC7484].",
      "ja": "最上位のドメイン（TLDS）、自律システム（AS）番号、およびネットワークブロックは、TLDレジストリや地域インターネットレジストリ（RIRS）などのインターネットレジストリ（RIRS）などのIANAによって委任され、次にさらなる代理人を発行し、それらに関する情報を維持しています。したがって、RDAPクライアントに必要なブートストラップ情報は、IANAによって既に維持されているデータやプロセスから最適です。関連レジストリは、[IPv4Reg]、[IPv6reg]、[ASREG]、および[DomainReg]にすでに存在しています。この文書は廃止されました[RFC7484]。"
    },
    {
      "indent": 3,
      "text": "Per this document, IANA has created new registries based on a JSON format specified in this document, herein named RDAP Bootstrap Service Registries. These new registries are based on the existing entries of the above-mentioned registries. An RDAP client fetches the RDAP Bootstrap Service Registries, extracts the data, and then performs a match with the query data to find the authoritative registration data server and appropriate query base URL.",
      "ja": "このドキュメントによると、IANAはこのドキュメントで指定されているJSON形式に基づいて新しいレジストリを作成しました。ここでは、ここではRDAP Bootstrap Service Registriesという名前です。これらの新しいレジストリは、上記のレジストリの既存のエントリに基づいています。RDAPクライアントはRDAPブートストラップサービスレジストリを取得し、データを抽出してから、照会データとの一致を実行して、正式な登録データサーバーと適切なクエリベースURLを見つけます。"
    },
    {
      "indent": 0,
      "text": "2. Conventions Used in This Document",
      "section_title": true,
      "ja": "2. この文書で使用されている規約"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14 [RFC2119] [RFC8174] when, and only when, they appear in all capitals, as shown here.",
      "ja": "この文書のキーワード \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", および \"OPTIONAL\" はBCP 14 [RFC2119] [RFC8174]で説明されているように、すべて大文字の場合にのみ解釈されます。"
    },
    {
      "indent": 0,
      "text": "3. Structure of the RDAP Bootstrap Service Registries",
      "section_title": true,
      "ja": "3. RDAPブートストラップサービスレジストリの構造"
    },
    {
      "indent": 3,
      "text": "The RDAP Bootstrap Service Registries, as specified in Section 12 below, have been made available as JSON [RFC8259] objects, which can be retrieved via HTTP from locations specified by IANA. The JSON object for each registry contains a series of members containing metadata about the registry such as a version identifier, a timestamp of the publication date of the registry, and a description. Additionally, a \"services\" member contains the registry items themselves, as an array. Each item of the array contains a second-level array, with two elements, each of them being a third-level array.",
      "ja": "下記のセクション12で指定されているRDAPブートストラップサービスレジストリは、JSON [RFC8259]オブジェクトとして利用可能になりました。これは、IANAで指定された場所からHTTPを介して取得できます。各レジストリのJSONオブジェクトには、バージョン識別子などのレジストリに関するメタデータ、レジストリのパブリケーション日のタイムスタンプ、および説明が含まれています。さらに、「サービス」メンバーには、レジストリアイテム自体が配列として含まれています。配列の各項目には、2つの要素を持つ2レベルの配列が含まれており、それらのそれぞれは3レベルの配列です。"
    },
    {
      "indent": 3,
      "text": "Each element of the Services Array is a second-level array with two elements: in order, an Entry Array and a Service URL Array.",
      "ja": "Services Arrayの各要素は、2つの要素を持つ2レベルの配列です。順に、エントリ配列とサービスURL配列です。"
    },
    {
      "indent": 3,
      "text": "The Entry Array contains all entries that have the same set of base RDAP URLs. The Service URL Array contains the list of base RDAP URLs usable for the entries found in the Entry Array. Elements within these two arrays are not ordered in any way.",
      "ja": "エントリ配列には、同じベースRDAP URLのセットを持つすべてのエントリが含まれています。サービスURL配列には、エントリ配列にあるエントリに使用可能な基本RDAP URLのリストが含まれています。これら2つのアレイ内の要素は任意の方法で順序付けられていません。"
    },
    {
      "indent": 3,
      "text": "An example structure of the JSON output of an RDAP Bootstrap Service Registry is illustrated:",
      "ja": "RDAPブートストラップサービスレジストリのJSON出力の構造例が示されています。"
    },
    {
      "indent": 3,
      "text": "{\n    \"version\": \"1.0\",\n    \"publication\": \"YYYY-MM-DDTHH:MM:SSZ\",\n    \"description\": \"Some text\",\n    \"services\": [\n      [\n        [\"entry1\", \"entry2\", \"entry3\"],\n        [\n          \"https://registry.example.com/myrdap/\",\n          \"http://registry.example.com/myrdap/\"\n        ]\n      ],\n      [\n        [\"entry4\"],\n        [\n          \"https://example.org/\"\n        ]\n      ]\n    ]\n}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The formal syntax is described in Section 10.",
      "ja": "正式な構文は、セクション10で説明されています。"
    },
    {
      "indent": 3,
      "text": "The \"version\" corresponds to the format version of the registry. This specification defines version \"1.0\".",
      "ja": "「バージョン」は、レジストリのフォーマットバージョンに対応しています。この仕様はバージョン \"1.0\"を定義します。"
    },
    {
      "indent": 3,
      "text": "The syntax of the \"publication\" value conforms to the Internet date/ time format [RFC3339]. The value is the latest update date of the registry by IANA.",
      "ja": "「出版物」の構文は、インターネットの日付/時刻形式[RFC3339]に準拠しています。値はIANAによるレジストリの最新更新日です。"
    },
    {
      "indent": 3,
      "text": "The optional \"description\" string can contain a comment regarding the content of the bootstrap object.",
      "ja": "オプションの「説明」文字列には、ブートストラップオブジェクトの内容に関するコメントを含めることができます。"
    },
    {
      "indent": 3,
      "text": "Per [RFC7258], in each array of base RDAP URLs, the secure versions of the transport protocol SHOULD be preferred and tried first. For example, if the base RDAP URLs array contains both HTTPS and HTTP URLs, the bootstrap client SHOULD try the HTTPS version first.",
      "ja": "[RFC7258]（RFC7258]、ベースRDAP URLの各配列では、トランスポートプロトコルの安全なバージョンが優先され、最初に試してみる必要があります。たとえば、ベースRDAP URLの配列にHTTPSとHTTP URLの両方が含まれている場合、BootStrapクライアントは最初にHTTPSバージョンを試す必要があります。"
    },
    {
      "indent": 3,
      "text": "Base RDAP URLs MUST have a trailing \"/\" character because they are concatenated to the various segments defined in [RFC9082].",
      "ja": "基本RDAP URLは、[RFC9082]で定義されているさまざまなセグメントに連結されているため、末尾の「/」文字が必要です。"
    },
    {
      "indent": 3,
      "text": "JSON names MUST follow the format recommendations of Section 6 of [RFC7480]. Any unrecognized JSON object properties or values MUST be ignored by implementations.",
      "ja": "JSON名は[RFC7480]のセクション6のフォーマット推奨に従う必要があります。認識されていないJSONオブジェクトプロパティまたは値は、実装によって無視される必要があります。"
    },
    {
      "indent": 3,
      "text": "Internationalized Domain Name labels used as entries or base RDAP URLs in the registries defined in this document MUST be only represented using their A-label form as defined in [RFC5890].",
      "ja": "この文書で定義されているレジストリ内のエントリまたはベースRDAP URLとして使用される国際化ドメイン名ラベルは、[RFC5890]で定義されているA-Labelフォームを使用して表現されている必要があります。"
    },
    {
      "indent": 3,
      "text": "All Domain Name labels used as entries or base RDAP URLs in the registries defined in this document MUST be only represented in lowercase.",
      "ja": "この文書で定義されているレジストリ内のエントリまたはベースRDAP URLとして使用されるすべてのドメイン名ラベルは、小文字でのみ表現されている必要があります。"
    },
    {
      "indent": 0,
      "text": "4. Bootstrap Service Registry for Domain Name Space",
      "section_title": true,
      "ja": "4. ドメイン名スペースのブートストラップサービスレジストリ"
    },
    {
      "indent": 3,
      "text": "The JSON output of this registry contains domain label entries attached to the root, grouped by base RDAP URLs, as shown in this example.",
      "ja": "このレジストリのJSON出力には、この例に示すように、基本RDAP URLによってグループ化されたルートに接続されているドメインラベルエントリが含まれています。"
    },
    {
      "indent": 3,
      "text": "{\n    \"version\": \"1.0\",\n    \"publication\": \"2024-01-07T10:11:12Z\",\n    \"description\": \"Some text\",\n    \"services\": [\n      [\n        [\"net\", \"com\"],\n        [\n          \"https://registry.example.com/myrdap/\"\n        ]\n      ],\n      [\n        [\"org\", \"mytld\"],\n        [\n          \"https://example.org/\"\n        ]\n      ],\n      [\n        [\"xn--zckzah\"],\n        [\n          \"https://example.net/rdap/xn--zckzah/\",\n          \"http://example.net/rdap/xn--zckzah/\"\n        ]\n      ]\n    ]\n}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The domain name's authoritative registration data service is found by doing the label-wise longest match of the target domain name with the domain values in the Entry Arrays in the IANA \"Bootstrap Service Registry for Domain Name Space\". The match is done per label, from right to left. If the longest match results in multiple entries, then those entries are considered equivalent. The values contained in the Service URL Array of the matching second-level array are the valid base RDAP URLs as described in [RFC9082].",
      "ja": "ドメイン名の権限登録データサービスは、ターゲットドメイン名のラベル別最長の一致を、IANAの「ブートストラップサービスレジストリのドメイン名スペース」レジストリのエントリ配列内のドメイン値とします。試合はラベルごとに右から左へ行われます。最長一致が複数のエントリをもたらす場合、それらのエントリは同等と見なされます。一致する第2レベルの配列のサービスURL配列に含まれる値は、[RFC9082]に記載されているように有効な基本RDAP URLです。"
    },
    {
      "indent": 3,
      "text": "For example, a domain RDAP query for a.b.example.com matches the com entry in one of the arrays of the registry. The base RDAP URL for this query is then taken from the second element of the array, which is an array of base RDAP URLs valid for this entry. The client chooses one of the base URLs from this array; in this example, it chooses the only one available, \"https://registry.example.com/ myrdap/\". The segment specified in [RFC9082] is then appended to the base URL to complete the query. The complete query is then \"https://registry.example.com/myrdap/domain/a.b.example.com\".",
      "ja": "たとえば、a.b.example.comのドメインRDAPクエリは、レジストリの配列の1つのCOMエントリと一致します。このクエリの基本RDAP URLは、このエントリに有効な基本RDAP URLの配列である配列の2番目の要素から取得されます。クライアントはこの配列からのベースURLの1つを選択します。この例では、利用可能な唯一の「https：//registry.example.com/ myrdap /」を選択します。[RFC9082]で指定されたセグメントをベースURLに追加してクエリを完了します。その後、完全なクエリは \"https://registry.example.com/myrdap/domain/a.b.example.com\"です。"
    },
    {
      "indent": 3,
      "text": "If a domain RDAP query for a.b.example.com matches both com and example.com entries in the registry, then the longest match applies and the example.com entry is used by the client.",
      "ja": "a.b.example.comのドメインRDAPクエリがレジストリ内のCOMとexample.comの両方のエントリと一致する場合、最長一致は適用され、example.comエントリはクライアントによって使用されます。"
    },
    {
      "indent": 3,
      "text": "If the registry contains entries such as com and goodexample.com, then a domain RDAP query for example.com only matches the com entry because matching is done on a per-label basis.",
      "ja": "レジストリにCOMおよびGoodeXample.comなどのエントリが含まれている場合、example.comのドメインRDAPクエリは、ラベルごとにマッチングが行われるため、COMエントリと一致します。"
    },
    {
      "indent": 3,
      "text": "The entry for the root of the domain name space is specified as \"\".",
      "ja": "ドメイン名スペースのルートのエントリは \"\"として指定されます。"
    },
    {
      "indent": 0,
      "text": "5. Bootstrap Service Registries for Internet Numbers",
      "section_title": true,
      "ja": "5. インターネット番号のブートストラップサービスレジストリ"
    },
    {
      "indent": 3,
      "text": "This section discusses IPv4 and IPv6 address space and Autonomous System numbers.",
      "ja": "このセクションでは、IPv4とIPv6アドレス・スペースと自律型システム番号について説明します。"
    },
    {
      "indent": 3,
      "text": "For IP address space, the authoritative registration data service is found by doing a longest match of the target address with the values of the arrays in the corresponding RDAP Bootstrap Service Registry for Address Space. The longest match is done the same way as in packet forwarding: the addresses are converted in binary form and then the binary strings are compared to find the longest match up to the specified prefix length. The values contained in the second element of the array are the base RDAP URLs as described in [RFC9082]. The longest match method enables covering prefixes of a larger address space pointing to one base RDAP URL while more specific prefixes within the covering prefix are being served by another base RDAP URL.",
      "ja": "IPアドレス空間の場合、正式な登録データサービスは、対応するRDAP Bootstrap Serviceレジストリ内のターゲットアドレスの最長一致をアドレス・スペースのために対応するRDAPブートストラップ・サービス・レジストリにすることによって見つけられます。最長一致はパケット転送と同じ方法で行われます。アドレスはバイナリ形式で変換され、次にバイナリ文字列が比較され、指定されたプレフィックス長まで最長一致が見つかります。配列の2番目の要素に含まれる値は、[RFC9082]に記載されているようにベースRDAP URLです。最長一致メソッドは、1つの基本RDAP URLを指すより大きなアドレス・スペースの接頭辞をカバーすることを可能にし、カバー・プレフィックス内のより具体的な接頭辞は別の基本RDAP URLによって提供されています。"
    },
    {
      "indent": 0,
      "text": "5.1. Bootstrap Service Registry for IPv4 Address Space",
      "section_title": true,
      "ja": "5.1. IPv4アドレス・スペース用のブートストラップ・サービス・レジストリ"
    },
    {
      "indent": 3,
      "text": "The JSON output of this registry contains IPv4 prefix entries, specified in Classless Inter-domain Routing (CIDR) format [RFC4632] and grouped by RDAP URLs, as shown in this example.",
      "ja": "このレジストリのJSON出力には、この例に示すように、クラスレス間ドメイン間ルーティング（CIDR）フォーマット[RFC4632]で指定され、RDAP URLによってグループ化されたIPv4プレフィックスエントリが含まれています。"
    },
    {
      "indent": 3,
      "text": "{\n    \"version\": \"1.0\",\n    \"publication\": \"2024-01-07T10:11:12Z\",\n    \"description\": \"RDAP Bootstrap file for example registries.\",\n    \"services\": [\n      [\n        [\"198.51.100.0/24\", \"192.0.0.0/8\"],\n        [\n          \"https://rir1.example.com/myrdap/\"\n        ]\n      ],\n      [\n        [\"203.0.113.0/24\", \"192.0.2.0/24\"],\n        [\n          \"https://example.org/\"\n        ]\n      ],\n      [\n        [\"203.0.113.0/28\"],\n        [\n          \"https://example.net/rdaprir2/\",\n          \"http://example.net/rdaprir2/\"\n        ]\n      ]\n    ]\n}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "For example, a query for \"192.0.2.1/25\" matches the \"192.0.0.0/8\" entry and the \"192.0.2.0/24\" entry in the example registry above. The latter is chosen by the client because it is the longest match. The base RDAP URL for this query is then taken from the second element of the array, which is an array of base RDAP URLs valid for this entry. The client chooses one of the base URLs from this array; in this example, it chooses the only one available, \"https://example.org/\". The {resource} specified in [RFC9082] is then appended to the base URL to complete the query. The complete query is then \"https://example.org/ip/192.0.2.1/25\".",
      "ja": "たとえば、 \"192.2.1 / 25\"のクエリは、上記の例のレジストリの \"192.0.0.0/8\"エントリと \"192.0.2.0/24\"エントリと一致します。後者はクライアントによって選択されます。これは最長一致です。このクエリの基本RDAP URLは、このエントリに有効な基本RDAP URLの配列である配列の2番目の要素から取得されます。クライアントはこの配列からのベースURLの1つを選択します。この例では、利用可能な「https://example.org/」のみを選択します。[RFC9082]で指定された{Resource}がベースURLに追加されてクエリを完了します。完全なクエリは \"https://example.org/ip/192.0.2.1 / 25\"です。"
    },
    {
      "indent": 0,
      "text": "5.2. Bootstrap Service Registry for IPv6 Address Space",
      "section_title": true,
      "ja": "5.2. IPv6アドレス・スペース用のブートストラップ・サービス・レジストリ"
    },
    {
      "indent": 3,
      "text": "The JSON output of this registry contains IPv6 prefix entries, using [RFC5952] text representation of the address prefixes format, grouped by base RDAP URLs, as shown in this example.",
      "ja": "このレジストリのJSON出力には、この例に示すように、[RFC5952]アドレスプレフィックス形式のテキスト表現を使用して、IPv6プレフィックスエントリが含まれています。"
    },
    {
      "indent": 3,
      "text": "{\n    \"version\": \"1.0\",\n    \"publication\": \"2024-01-07T10:11:12Z\",\n    \"description\": \"RDAP Bootstrap file for example registries.\",\n    \"services\": [\n      [\n        [\"2001:db8::/34\"],\n        [\n          \"https://rir2.example.com/myrdap/\"\n        ]\n      ],\n      [\n        [\"2001:db8:4000::/36\", \"2001:db8:ffff::/48\"],\n        [\n          \"https://example.org/\"\n        ]\n      ],\n      [\n        [\"2001:db8:1000::/36\"],\n        [\n          \"https://example.net/rdaprir2/\",\n          \"http://example.net/rdaprir2/\"\n        ]\n      ]\n    ]\n}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "For example, a query for \"2001:db8:1000::/48\" matches the \"2001:db8::/34\" entry and the \"2001:db8:1000::/36\" entry in the example registry above. The latter is chosen by the client because it is the longest match. The base RDAP URL for this query is then taken from the second element of the array, which is an array of base RDAP URLs valid for this entry. The client chooses one of the base URLs from this array; in this example, it chooses \"https://example.net/rdaprir2/\" because it's the secure version of the protocol. The segment specified in [RFC9082] is then appended to the base URL to complete the query. The complete query is therefore \"https://example.net/rdaprir2/ip/2001:db8:1000::/48\". If the target RDAP server does not answer, the client can then use another URL prefix from the array.",
      "ja": "たとえば、 \"2001：DB8：1000 :: / 48\"のクエリは、上記の例レジストリの \"2001：DB8 :: / 34\"エントリと \"2001：DB8：1000 :: / 36\"エントリと一致します。後者はクライアントによって選択されます。これは最長一致です。このクエリの基本RDAP URLは、このエントリに有効な基本RDAP URLの配列である配列の2番目の要素から取得されます。クライアントはこの配列からのベースURLの1つを選択します。この例では、それはプロトコルの安全なバージョンであるため、 \"https://example.net/rdaprir2/\"を選択します。[RFC9082]で指定されたセグメントをベースURLに追加してクエリを完了します。したがって、完全なクエリは \"https://example.net/rdaprir2/ip/2001:db8:1000：/ 48\"です。ターゲットRDAPサーバーが回答しない場合、クライアントは配列から別のURLプレフィックスを使用できます。"
    },
    {
      "indent": 0,
      "text": "5.3. Bootstrap Service Registry for AS Number Space",
      "section_title": true,
      "ja": "5.3. AS番号スペースのブートストラップサービスレジストリ"
    },
    {
      "indent": 3,
      "text": "The JSON output of this registry contains entries for AS number ranges, grouped by base RDAP URLs, as shown in this example. The Entry Array is an array containing the list of AS number ranges served by the base RDAP URLs found in the second element. Each element of the array contains two AS numbers represented in decimal format, separated by a hyphen, that represents the range of AS numbers between the two AS numbers (inclusive), where values are in increasing order (e.g., 100-200, not 200-100). A single AS number is represented as a range of two identical AS numbers. AS numbers are represented as 'asplain' as defined in [RFC5396]. Ranges MUST NOT overlap.",
      "ja": "このレジストリのJSON出力には、この例に示すように、基本RDAP URLによってグループ化された数の範囲のエントリが含まれています。エントリ配列は、2番目の要素にあるベースRDAP URLによってサービスされるAS番号範囲のリストを含む配列です。アレイの各要素には、ハイフンで区切られた10進形式で表され、ハイフンで区切られた2つの数字が含まれています。-100）。単一の数字は、数字と同じ範囲として表されます。[RFC5396]で定義されている「ASPLAIN」として番号を表すとおりです。範囲は重ならないでください。"
    },
    {
      "indent": 3,
      "text": "{\n    \"version\": \"1.0\",\n    \"publication\": \"2024-01-07T10:11:12Z\",\n    \"description\": \"RDAP Bootstrap file for example registries.\",\n    \"services\": [\n      [\n        [\"64496-64496\"],\n        [\n          \"https://rir3.example.com/myrdap/\"\n        ]\n      ],\n      [\n        [\"64497-64510\", \"65536-65551\"],\n        [\n          \"https://example.org/\"\n        ]\n      ],\n      [\n        [\"64512-65534\"],\n        [\n          \"http://example.net/rdaprir2/\",\n          \"https://example.net/rdaprir2/\"\n        ]\n      ]\n    ]\n}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "For example, a query for AS 65411 matches the 64512-65534 entry in the example registry above. The base RDAP URL for this query is then taken from the second element of the array, which is an array of base RDAP URLs valid for this entry. The client chooses one of the base URLs from this array; in this example, it chooses \"https://example.net/rdaprir2/\". The segment specified in [RFC9082] is then appended to the base URL to complete the query. The complete query is, therefore, \"https://example.net/rdaprir2/autnum/65411\". If the server does not answer, the client can then use another URL prefix from the array.",
      "ja": "たとえば、AS 65411のクエリは、上記の例レジストリの64512-65534エントリと一致します。このクエリの基本RDAP URLは、このエントリに有効な基本RDAP URLの配列である配列の2番目の要素から取得されます。クライアントはこの配列からのベースURLの1つを選択します。この例では、 \"https://example.net/rdaprir2/\"を選択します。[RFC9082]で指定されたセグメントをベースURLに追加してクエリを完了します。完全なクエリは、「https://example.net/rdaprir2/autnum/65411」です。サーバーが回答しない場合、クライアントは配列から別のURLプレフィックスを使用できます。"
    },
    {
      "indent": 0,
      "text": "6. Entity",
      "section_title": true,
      "ja": "6. 実在物"
    },
    {
      "indent": 3,
      "text": "Entities (such as contacts, registrants, or registrars) can be queried by handle as described in [RFC9082]. Since there is no global name space for entities, this document does not describe how to find the authoritative RDAP server for entities. However, it is possible that, if the entity identifier was received from a previous query, the same RDAP server could be queried for that entity, or the entity identifier itself is a fully qualified URL that can be queried. The mechanism described in [RFC8521] MAY also be used.",
      "ja": "エンティティ（連絡先、登録者、またはレジストラなど）は[RFC9082]に記載されているようにハンドルで照会できます。エンティティのグローバルネームスペースがないため、このドキュメントでは、権限のあるRDAPサーバーをエンティティに対して見つける方法は説明しません。ただし、エンティティ識別子が以前のクエリから受信された場合、そのエンティティに対して同じRDAPサーバーを照会することも、エンティティ識別子自体は照会できる完全修飾URLです。[RFC8521]に記載されているメカニズムも使用できます。"
    },
    {
      "indent": 0,
      "text": "7. Non-existent Entries or RDAP URL Values",
      "section_title": true,
      "ja": "7. 存在しないエントリまたはRDAP URL値"
    },
    {
      "indent": 3,
      "text": "The registries may not contain the requested value. In these cases, there is no known RDAP server for that requested value, and the client SHOULD provide an appropriate error message to the user.",
      "ja": "レジストリに要求された値が含まれていない可能性があります。このような場合、その要求された値に対して既知のRDAPサーバーはありません。クライアントはユーザーに適切なエラーメッセージを提供する必要があります。"
    },
    {
      "indent": 0,
      "text": "8. Deployment and Implementation Considerations",
      "section_title": true,
      "ja": "8. 展開と実装に関する考慮事項"
    },
    {
      "indent": 3,
      "text": "This method relies on the fact that RDAP clients are fetching the IANA registries to then find the servers locally. Clients SHOULD NOT fetch the registry on every RDAP request. Clients SHOULD cache the registry, but use underlying protocol signaling, such as the HTTP Expires header field [RFC7234], to identify when it is time to refresh the cached registry.",
      "ja": "このメソッドは、RDAPクライアントがIANAレジストリをフェッチしてサーバーをローカルに見つけているという事実に依存しています。クライアントはすべてのRDAP要求でレジストリを取得しないでください。クライアントはレジストリをキャッシュする必要がありますが、「HTTP Expiresヘッダーフィールド[RFC7234]などの基礎となるプロトコルシグナリングを使用して、キャッシュされたレジストリをリフレッシュする時刻を識別します。"
    },
    {
      "indent": 3,
      "text": "Some authorities of registration data may work together on sharing their information for a common service, including mutual redirection [REDIRECT-RDAP].",
      "ja": "登録データのいくつかの当局は、相互リダイレクト[Redirect-RDAP]を含む、共通のサービスに関する情報を共有することで協力することがあります。"
    },
    {
      "indent": 3,
      "text": "When a new object is allocated, such as a new AS range, a new TLD, or a new IP address range, there is no guarantee that this new object will have an entry in the corresponding bootstrap RDAP registry, since the setup of the RDAP server for this new entry may become live and registered later. Therefore, the clients should expect that even if an object, such as TLD, IP address range, or AS range is allocated, the existence of the entry in the corresponding bootstrap registry is not guaranteed.",
      "ja": "新しいオブジェクト、新しいTLD、または新しいIPアドレス範囲など、新しいオブジェクトが割り当てられている場合、RDAPの設定以降、この新しいオブジェクトに対応するブートストラップRDAPレジストリにエントリがあるという保証はありません。この新規エントリのサーバーは、後でライブで登録される可能性があります。したがって、クライアントは、TLD、IPアドレス範囲などのオブジェクト、または範囲が割り当てられている場合でも、対応するブートストラップレジストリ内のエントリの存在が保証されていないと予想する必要があります。"
    },
    {
      "indent": 0,
      "text": "9. Limitations",
      "section_title": true,
      "ja": "9. 制限事項"
    },
    {
      "indent": 3,
      "text": "This method does not provide a direct way to find authoritative RDAP servers for any other objects than the ones described in this document. In particular, the following objects are not bootstrapped with the method described in this document:",
      "ja": "このメソッドは、このドキュメントで説明されているものよりも、他のオブジェクトに対して正式なRDAPサーバーを見つけるための直接的な方法を提供しません。特に、次のオブジェクトはこのドキュメントで説明されている方法でブートストラップされていません。"
    },
    {
      "indent": 3,
      "text": "* entities",
      "ja": "* エンティティ"
    },
    {
      "indent": 3,
      "text": "* queries using search patterns that do not contain a terminating string that matches some entries in the registries",
      "ja": "* レジストリ内の一部のエントリと一致する終了文字列を含まない検索パターンを使用してクエリ"
    },
    {
      "indent": 3,
      "text": "* nameservers",
      "ja": "* ネームサーバー"
    },
    {
      "indent": 3,
      "text": "* help",
      "ja": "* ヘルプ"
    },
    {
      "indent": 0,
      "text": "10. Formal Definition",
      "section_title": true,
      "ja": "10. 正式な定義"
    },
    {
      "indent": 3,
      "text": "This section is the formal definition of the registries. The structure of JSON objects and arrays using a set of primitive elements is defined in [RFC8259]. Those elements are used to describe the JSON structure of the registries.",
      "ja": "このセクションはレジストリの正式な定義です。一連のプリミティブ要素を使用したJSONオブジェクトとアレイの構造が[RFC8259]で定義されています。これらの要素は、レジストリのJSON構造を説明するために使用されます。"
    },
    {
      "indent": 0,
      "text": "10.1. Imported JSON Terms",
      "section_title": true,
      "ja": "10.1. 輸入されたJSON用語"
    },
    {
      "indent": 3,
      "text": "OBJECT: a JSON object, defined in Section 4 of [RFC8259]",
      "ja": "オブジェクト：[RFC8259]のセクション4で定義されているJSONオブジェクト"
    },
    {
      "indent": 3,
      "text": "MEMBER: a member of a JSON object, defined in Section 4 of [RFC8259]",
      "ja": "メンバー：[RFC8259]のセクション4で定義されているJSONオブジェクトのメンバー"
    },
    {
      "indent": 3,
      "text": "MEMBER-NAME: the name of a MEMBER, defined as a \"string\" in Section 4 of [RFC8259]",
      "ja": "メンバー名：[RFC8259]のセクション4の「文字列」として定義されているメンバーの名前。"
    },
    {
      "indent": 3,
      "text": "MEMBER-VALUE: the value of a MEMBER, defined as a \"value\" in Section 4 of [RFC8259]",
      "ja": "メンバー値：[RFC8259]のセクション4の「値」として定義されているメンバーの値"
    },
    {
      "indent": 3,
      "text": "ARRAY: an array, defined in Section 5 of [RFC8259]",
      "ja": "配列：[RFC8259]のセクション5で定義された配列"
    },
    {
      "indent": 3,
      "text": "ARRAY-VALUE: an element of an ARRAY, defined in Section 5 of [RFC8259]",
      "ja": "array-value：[RFC8259]のセクション5で定義されている配列の要素"
    },
    {
      "indent": 3,
      "text": "STRING: a \"string\", as defined in Section 7 of [RFC8259]",
      "ja": "文字列：[RFC8259]のセクション7で定義されているように、「文字列」"
    },
    {
      "indent": 0,
      "text": "10.2. Registry Syntax",
      "section_title": true,
      "ja": "10.2. レジストリ構文"
    },
    {
      "indent": 3,
      "text": "Using the above terms for the JSON structures, the syntax of a registry is defined as follows:",
      "ja": "上記の用語を使用して、JSON構造体を使用して、レジストリの構文は次のように定義されています。"
    },
    {
      "indent": 3,
      "text": "rdap-bootstrap-registry: an OBJECT containing a MEMBER version and a MEMBER publication, an optional MEMBER description, and a MEMBER services-list",
      "ja": "rdap-bootstrap-registry：メンバーバージョンとメンバーパブリケーション、オプションのメンバーの説明、およびメンバーサービスリストを含むオブジェクト"
    },
    {
      "indent": 3,
      "text": "version: a MEMBER with MEMBER-NAME \"version\" and MEMBER-VALUE a STRING",
      "ja": "バージョン：メンバー名 \"version\"を持つメンバーとメンバー値A文字列"
    },
    {
      "indent": 3,
      "text": "publication: a MEMBER with MEMBER-NAME \"publication\" and MEMBER-VALUE a STRING",
      "ja": "出版物：メンバー名「出版物」とメンバー値A文字列を持つメンバー"
    },
    {
      "indent": 3,
      "text": "description: a MEMBER with MEMBER-NAME \"description\" and MEMBER-VALUE a STRING",
      "ja": "説明：メンバー名 \"description\"とmember-value about ange aメンバー"
    },
    {
      "indent": 3,
      "text": "services-list: a MEMBER with MEMBER-NAME \"services\" and MEMBER-VALUE a services-array",
      "ja": "services-list：メンバー名 \"Services\"とメンバー値Aサービスアレイを持つメンバー"
    },
    {
      "indent": 3,
      "text": "services-array: an ARRAY, where each ARRAY-VALUE is a service",
      "ja": "services-array：各配列値がサービスである配列。"
    },
    {
      "indent": 3,
      "text": "service: an ARRAY of 2 elements, where the first ARRAY-VALUE is an entry-list and the second ARRAY-VALUE is a service-uri-list",
      "ja": "サービス：最初の配列値がエントリリストで、2番目の配列値がservice-uri-listである2つの要素の配列。"
    },
    {
      "indent": 3,
      "text": "entry-list: an ARRAY, where each ARRAY-VALUE is an entry",
      "ja": "entry-list：各配列値がエントリである配列。"
    },
    {
      "indent": 3,
      "text": "entry: a STRING",
      "ja": "エントリ：文字列"
    },
    {
      "indent": 3,
      "text": "service-uri-list: an ARRAY, where each ARRAY-VALUE is a service-uri",
      "ja": "service-uri-list：各配列値がservice-uriである配列。"
    },
    {
      "indent": 3,
      "text": "service-uri: a STRING",
      "ja": "Service-Uri：文字列"
    },
    {
      "indent": 0,
      "text": "11. Security Considerations",
      "section_title": true,
      "ja": "11. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "By providing a bootstrap method to find RDAP servers, this document helps to ensure that the end users will get the RDAP data from an authoritative source instead of from rogue sources. The method has the same security properties as the RDAP protocols themselves. The transport used to access the registries uses TLS [RFC8446].",
      "ja": "RDAPサーバーを見つけるためにブートストラップ方法を提供することで、このドキュメントでは、エンドユーザーが不正なソースからの代わりに権限のあるソースからRDAPデータを取得するのに役立ちます。このメソッドは、RDAPプロトコル自体と同じセキュリティプロパティを持ちます。レジストリにアクセスするために使用されるトランスポートはTLS [RFC8446]を使用しています。"
    },
    {
      "indent": 3,
      "text": "Additional considerations on using RDAP are described in [RFC7481].",
      "ja": "RDAPを使用することに関するさらなる考慮事項は[RFC7481]に記載されています。"
    },
    {
      "indent": 0,
      "text": "12. IANA Considerations",
      "section_title": true,
      "ja": "12. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has created the RDAP Bootstrap Services Registries listed below and made them available as JSON objects. The contents of these registries are described in Sections 3, 4, and 5, with the formal syntax specified in Section 10. The registries MUST be accessible only through HTTPS (TLS [RFC8446]) transport.",
      "ja": "IANAは下記のRDAPブートストラップサービスレジストリを作成し、それらをJSONオブジェクトとして利用可能にしました。これらのレジストリの内容は、セクション3,4,5、および5で説明されており、セクション10で指定された正式な構文で説明されています。レジストリは、HTTPS（TLS [RFC8446]）トランスポートを介してのみアクセス可能でなければなりません。"
    },
    {
      "indent": 3,
      "text": "The process for adding or updating entries in these registries differs from the normal IANA registry processes: these registries are generated from the data, processes, and policies maintained by IANA in their allocation registries ([ipv4reg], [ipv6reg], [asreg], and [domainreg]), with the addition of new RDAP server information.",
      "ja": "これらのレジストリのエントリを追加または更新するためのプロセスは、通常のIANAレジストリプロセスとは異なります。これらのレジストリは、その割り当てレジストリのIANAによって維持されているデータ、プロセス、およびポリシーから生成されます（[IPv4REG]、[IPv6REG]、[ASREG]、新しいRDAPサーバー情報を追加して、[DomainReg]）。"
    },
    {
      "indent": 3,
      "text": "IANA updates RDAP Bootstrap Services Registries entries from the allocation registries as those registries are updated.",
      "ja": "IANAアップデートRDAP Bootstrap Servicesこれらのレジストリが更新されると、割り当てレジストリからエントリをレジストリします。"
    },
    {
      "indent": 3,
      "text": "This document does not change any policies related to the allocation registries; IANA has provided a mechanism for collecting the RDAP server information.",
      "ja": "この文書は、割り当てレジストリに関連するポリシーを変更しません。IANAはRDAPサーバー情報を収集するためのメカニズムを提供しました。"
    },
    {
      "indent": 3,
      "text": "IANA has created a new top-level category on the Protocol Registries page: <https://www.iana.org/protocols>. The group is called \"Registration Data Access Protocol (RDAP)\". Each of the RDAP Bootstrap Services Registries has been made available for on-demand download in the JSON format by the general public, and that registry's URI is listed directly on the Protocol Registries page.",
      "ja": "IANAは、プロトコルレジストリページに新しいトップレベルのカテゴリを作成しました。<https：//www.iana.org/protocols>グループは「登録データアクセスプロトコル（RDAP）」と呼ばれます。RDAPブートストラップ・サービス・レジストリーの各々は、一般の人々によってJSON形式でオンデマンドダウンロードで利用可能にされており、レジストリのURIはProtocol Registriesページに直接リストされています。"
    },
    {
      "indent": 3,
      "text": "Other normal registries will be added to this group by other documents, but the reason the URIs for these registries are clearly listed on the main page is to make those URIs obvious to implementers -- these are registries that will be accessed by software, as well as by humans using them for reference information.",
      "ja": "他の文書によって他の通常のレジストリがこのグループに追加されますが、これらのレジストリのURIがメインページに明確にリストされている理由は、それらのURIを実装者に明確にすることです。これらはソフトウェアによってもアクセスされるレジストリです。参考情報のためにそれらを使用している人間によって。"
    },
    {
      "indent": 3,
      "text": "Because these registries will be accessed by software, the download demand for the RDAP Bootstrap Services Registries may be unusually high compared to normal IANA registries. The technical infrastructure by which registries are published has been put in place by IANA to support the load. Since the publication of [RFC7484], no issues have been reported regarding the load or the service.",
      "ja": "これらのレジストリはソフトウェアによってアクセスされるため、RDAPブートストラップサービスレジストリのダウンロード需要は、通常のIANAレジストリと比較して異常に高い可能性があります。登録品が発行された技術インフラは、荷重を支えるためにIANAによって所定の位置に置かれています。[RFC7484]の出版物以降、負荷やサービスに関して問題は報告されていません。"
    },
    {
      "indent": 3,
      "text": "As discussed in Section 8, software that accesses these registries will depend on the HTTP Expires header field to limit their query rate. It is, therefore, important for that header field to be properly set to provide timely information as the registries change, while maintaining a reasonable load on the IANA servers.",
      "ja": "セクション8で説明したように、これらのレジストリにアクセスするソフトウェアは、Query Rateを制限するためにHTTP Expiresヘッダーフィールドに依存します。したがって、IANAサーバに合理的な負荷を維持しながら、そのヘッダフィールドに適切に設定されるように適切に設定されることは重要である。"
    },
    {
      "indent": 3,
      "text": "The HTTP Content-Type returned to clients accessing these JSON-formatted registries MUST be \"application/json\", as defined in [RFC8259].",
      "ja": "[RFC8259]で定義されているように、これらのJSON形式のレジストリにアクセスしたクライアントに返されるHTTP CONTENT-TYPEは、 \"Application / JSON\"でなければなりません。"
    },
    {
      "indent": 3,
      "text": "Because of how information in the RDAP Bootstrap Services Registries is grouped and formatted, the registry entries may not be sortable. It is, therefore, not required or expected that the entries be ordered in any way.",
      "ja": "RDAP BootStrap Services Registriesの情報がグループ化されフォーマットされているため、レジストリエントリはソート可能ではありません。したがって、エントリが何らかの方法で注文されることは必須または期待されていません。"
    },
    {
      "indent": 0,
      "text": "12.1. Bootstrap Service Registry for IPv4 Address Space",
      "section_title": true,
      "ja": "12.1. IPv4アドレス・スペース用のブートストラップ・サービス・レジストリ"
    },
    {
      "indent": 3,
      "text": "Entries in this registry contain at least the following:",
      "ja": "このレジストリのエントリには、少なくとも次のようなものが含まれています。"
    },
    {
      "indent": 3,
      "text": "* a CIDR [RFC4632] specification of the network block being registered",
      "ja": "* CIDR [RFC4632]登録されているネットワークブロックの指定"
    },
    {
      "indent": 3,
      "text": "* one or more URLs that provide the RDAP service regarding this registration",
      "ja": "* この登録に関するRDAPサービスを提供する1つ以上のURL"
    },
    {
      "indent": 0,
      "text": "12.2. Bootstrap Service Registry for IPv6 Address Space",
      "section_title": true,
      "ja": "12.2. IPv6アドレス・スペース用のブートストラップ・サービス・レジストリ"
    },
    {
      "indent": 3,
      "text": "Entries in this registry contain at least the following:",
      "ja": "このレジストリのエントリには、少なくとも次のようなものが含まれています。"
    },
    {
      "indent": 3,
      "text": "* an IPv6 prefix [RFC5952] specification of the network block being registered",
      "ja": "* IPv6プレフィックス[RFC5952]登録されているネットワークブロックの指定"
    },
    {
      "indent": 3,
      "text": "* one or more URLs that provide the RDAP service regarding this registration",
      "ja": "* この登録に関するRDAPサービスを提供する1つ以上のURL"
    },
    {
      "indent": 0,
      "text": "12.3. Bootstrap Service Registry for AS Number Space",
      "section_title": true,
      "ja": "12.3. AS番号スペースのブートストラップサービスレジストリ"
    },
    {
      "indent": 3,
      "text": "Entries in this registry contain at least the following:",
      "ja": "このレジストリのエントリには、少なくとも次のようなものが含まれています。"
    },
    {
      "indent": 3,
      "text": "* a range of Autonomous System numbers being registered",
      "ja": "* 登録されている自律システム番号の範囲"
    },
    {
      "indent": 3,
      "text": "* one or more URLs that provide the RDAP service regarding this registration",
      "ja": "* この登録に関するRDAPサービスを提供する1つ以上のURL"
    },
    {
      "indent": 0,
      "text": "12.4. Bootstrap Service Registry for Domain Name Space",
      "section_title": true,
      "ja": "12.4. ドメイン名スペースのブートストラップサービスレジストリ"
    },
    {
      "indent": 3,
      "text": "Entries in this registry contain at least the following:",
      "ja": "このレジストリのエントリには、少なくとも次のようなものが含まれています。"
    },
    {
      "indent": 3,
      "text": "* a domain name attached to the root being registered",
      "ja": "* 登録されているルートに添付されているドメイン名"
    },
    {
      "indent": 3,
      "text": "* one or more URLs that provide the RDAP service regarding this registration",
      "ja": "* この登録に関するRDAPサービスを提供する1つ以上のURL"
    },
    {
      "indent": 0,
      "text": "13. References",
      "section_title": true,
      "ja": "13. 参考文献"
    },
    {
      "indent": 0,
      "text": "13.1. Normative References",
      "section_title": true,
      "ja": "13.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <https://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119] BRADNER、S、「RFCで使用するためのキーワード」、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<https：//www.rfc-editor.org/info/RFC2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC3339] Klyne, G. and C. Newman, \"Date and Time on the Internet: Timestamps\", RFC 3339, DOI 10.17487/RFC3339, July 2002, <https://www.rfc-editor.org/info/rfc3339>.",
      "ja": "[RFC3339] Klyne、G.およびC. Newman、「インターネット上の日時：Timestamps」、RFC 3339、DOI 10.17487 / RFC3339、2002年7月、<https：//www.rfc-editor.org/info/rfc3339>。"
    },
    {
      "indent": 3,
      "text": "[RFC4632] Fuller, V. and T. Li, \"Classless Inter-domain Routing (CIDR): The Internet Address Assignment and Aggregation Plan\", BCP 122, RFC 4632, DOI 10.17487/RFC4632, August 2006, <https://www.rfc-editor.org/info/rfc4632>.",
      "ja": "[RFC4632] Fuller、V.およびT.LI、「クラスレスドメイン間ルーティング（CIDR）：インターネットアドレス割り当てと集約計画」、BCP 122、RFC 4632、DOI 10.17487 / RFC4632、2006年8月、<https：//www.rfc-editor.org/info/rfc4632>。"
    },
    {
      "indent": 3,
      "text": "[RFC5396] Huston, G. and G. Michaelson, \"Textual Representation of Autonomous System (AS) Numbers\", RFC 5396, DOI 10.17487/RFC5396, December 2008, <https://www.rfc-editor.org/info/rfc5396>.",
      "ja": "[RFC5396] Huston、G.およびG. Michaelson、「自律システムのテキスト表現」、RFC 5396、DOI 10.17487 / RFC5396、2008年12月、<https：//www.rfc-editor.org/info/RFC5396>。"
    },
    {
      "indent": 3,
      "text": "[RFC5890] Klensin, J., \"Internationalized Domain Names for Applications (IDNA): Definitions and Document Framework\", RFC 5890, DOI 10.17487/RFC5890, August 2010, <https://www.rfc-editor.org/info/rfc5890>.",
      "ja": "[RFC5890] Klensin、J。、「アプリケーションのための国際化されたドメイン名（IDNA）：定義と文書のフレームワーク」、RFC 5890、DOI 10.17487 / RFC5890、2010年8月、<https://www.rfc-editor.org/info/RFC5890>。"
    },
    {
      "indent": 3,
      "text": "[RFC5952] Kawamura, S. and M. Kawashima, \"A Recommendation for IPv6 Address Text Representation\", RFC 5952, DOI 10.17487/RFC5952, August 2010, <https://www.rfc-editor.org/info/rfc5952>.",
      "ja": "[RFC5952]川村、S.およびM。川島、「IPv6アドレステキスト表現の推奨事項」、RFC 5952、DOI 10.17487 / RFC5952、2010年8月、<https：//www.rfc-editor.org/info/rfc5952>。"
    },
    {
      "indent": 3,
      "text": "[RFC7258] Farrell, S. and H. Tschofenig, \"Pervasive Monitoring Is an Attack\", BCP 188, RFC 7258, DOI 10.17487/RFC7258, May 2014, <https://www.rfc-editor.org/info/rfc7258>.",
      "ja": "[RFC7258] Farrell、S.およびH.Schofenig、「Pervasive Monitoringは攻撃である」、BCP 188、RFC 7258、DOI 10.17487 / RFC7258、2014年5月、<https：//www.rfc-editor.org/info/rfc7258>。"
    },
    {
      "indent": 3,
      "text": "[RFC7480] Newton, A., Ellacott, B., and N. Kong, \"HTTP Usage in the Registration Data Access Protocol (RDAP)\", STD 95, RFC 7480, DOI 10.17487/RFC7480, March 2015, <https://www.rfc-editor.org/info/rfc7480>.",
      "ja": "[RFC7480]ニュートン、A.、Ellacott、B.およびN.Kong、「登録データアクセスプロトコル（RDAP）」、STD 95、RFC 7480、DOI 10.17487 / RFC7480、2015年3月、<https：//www.rfc-editor.org/info/rfc7480>。"
    },
    {
      "indent": 3,
      "text": "[RFC8174] Leiba, B., \"Ambiguity of Uppercase vs Lowercase in RFC 2119 Key Words\", BCP 14, RFC 8174, DOI 10.17487/RFC8174, May 2017, <https://www.rfc-editor.org/info/rfc8174>.",
      "ja": "[RFC8174] Leiba、B.、RFC 2119キーワードの「大文字の曖昧さ」、BCP 14、RFC 8174、DOI 10.17487 / RFC8174、2017年5月、<https：//www.rfc-editor.org/info/RFC8174>。"
    },
    {
      "indent": 3,
      "text": "[RFC8259] Bray, T., Ed., \"The JavaScript Object Notation (JSON) Data Interchange Format\", STD 90, RFC 8259, DOI 10.17487/RFC8259, December 2017, <https://www.rfc-editor.org/info/rfc8259>.",
      "ja": "[RFC8259] Bray、T.、「JavaScriptオブジェクト表記（JSON）データ交換フォーマット」、STD 90、RFC 8259、DOI 10.17487 / RFC8259、2017年12月、<https://www.rfc-editor.org/ info / rfc8259>。"
    },
    {
      "indent": 0,
      "text": "13.2. Informative References",
      "section_title": true,
      "ja": "13.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[asreg] IANA, \"Autonomous System (AS) Numbers\", <https://www.iana.org/assignments/as-numbers>.",
      "ja": "[ASREG] IANA、「自律システム（AS）番号」、<https：//www.iana.org/ashignments/as-numbers>。"
    },
    {
      "indent": 3,
      "text": "[domainreg] IANA, \"Root Zone Database\", <https://www.iana.org/domains/root/db>.",
      "ja": "[DomainReg] IANA、「ルートゾーンデータベース」、<https://www.iana.org/domains/root/db>。"
    },
    {
      "indent": 3,
      "text": "[ipv4reg] IANA, \"IANA IPv4 Address Space Registry\", <https://www.iana.org/assignments/ipv4-address-space>.",
      "ja": "[IPv4REG] IANA、「IANA IPv4 Address Space Registry」、<https://www.iana.org/ashignments/ipv4-address-space>。"
    },
    {
      "indent": 3,
      "text": "[ipv6reg] IANA, \"IPv6 Global Unicast Address Assignments\", <https://www.iana.org/assignments/ipv6-unicast-address-assignments>.",
      "ja": "[IPv6reg] IANA、「IPV6グローバルユニキャストアドレス割り当て」、<https：//www.iana.org/ashignments/ipv6-unicast-Address-Assignments>。"
    },
    {
      "indent": 3,
      "text": "[REDIRECT-RDAP] Martinez, C.M., Ed., Zhou, L., Ed., and G. Rada, \"Redirection Service for Registration Data Access Protocol\", Work in Progress, Internet-Draft, draft-ietf-weirds-redirects-04, July 2014, <https://datatracker.ietf.org/doc/html/draft-ietf-weirds-redirects-04>.",
      "ja": "[リダイレクトRDAP]マルティネス、CM、ED。、Zhou、L.、ED。、およびG。RADA、「登録データアクセスプロトコルのためのリダイレクトサービス」、進行中の作業、インターネットドラフト、ドラフトIETF-WEIRDS-DRIDirects-04、2014年7月、<https://datatracker.ietf.org/doc/html/draft-ietf-weirds-redirests-04>。"
    },
    {
      "indent": 3,
      "text": "[RFC7071] Borenstein, N. and M. Kucherawy, \"A Media Type for Reputation Interchange\", RFC 7071, DOI 10.17487/RFC7071, November 2013, <https://www.rfc-editor.org/info/rfc7071>.",
      "ja": "[RFC7071] Borenstein、N.およびM.Kucherawy、「評判交換のためのメディアタイプ」、RFC 7071、DOI 10.17487 / RFC7071、2013年11月、<https：//www.rfc-editor.org/info/rfc7071>。"
    },
    {
      "indent": 3,
      "text": "[RFC7234] Fielding, R., Ed., Nottingham, M., Ed., and J. Reschke, Ed., \"Hypertext Transfer Protocol (HTTP/1.1): Caching\", RFC 7234, DOI 10.17487/RFC7234, June 2014, <https://www.rfc-editor.org/info/rfc7234>.",
      "ja": "[RFC7234]フィールド、R.、ED。、ノッティンガム、M、ED。、J.Reschke、ED。、「ハイパーテキスト転送プロトコル（HTTP / 1.1）：キャッシング」、RFC 7234、DOI 10.17487 / RFC7234、2014年6月、<https://www.rfc-editor.org/info/rfc7234>。"
    },
    {
      "indent": 3,
      "text": "[RFC7481] Hollenbeck, S. and N. Kong, \"Security Services for the Registration Data Access Protocol (RDAP)\", STD 95, RFC 7481, DOI 10.17487/RFC7481, March 2015, <https://www.rfc-editor.org/info/rfc7481>.",
      "ja": "[RFC7481] Hollenbeck、S.およびN.Kong、「登録データアクセスプロトコルのためのセキュリティサービス（RDAP）」、STD 95、RFC 7481、DOI 10.17487 / RFC7481、2015年3月、<https：//www.rfc-編集者.ORG / INFO / RFC7481>。"
    },
    {
      "indent": 3,
      "text": "[RFC7484] Blanchet, M., \"Finding the Authoritative Registration Data (RDAP) Service\", RFC 7484, DOI 10.17487/RFC7484, March 2015, <https://www.rfc-editor.org/info/rfc7484>.",
      "ja": "[RFC7484] Blanchet、M。、「信頼できる登録データ（RDAP）サービスの検索」、RFC 7484、DOI 10.17487 / RFC7484、2015年3月、<https：//www.rfc-editor.org/info/rfc7484>。"
    },
    {
      "indent": 3,
      "text": "[RFC8446] Rescorla, E., \"The Transport Layer Security (TLS) Protocol Version 1.3\", RFC 8446, DOI 10.17487/RFC8446, August 2018, <https://www.rfc-editor.org/info/rfc8446>.",
      "ja": "[RFC8446] RESCORLA、E。、「トランスポート層セキュリティ（TLS）プロトコルバージョン1.3」、RFC 8446、DOI 10.17487 / RFC8446、<https：//www.rfc-editor.org/info/rfc8446>。"
    },
    {
      "indent": 3,
      "text": "[RFC8521] Hollenbeck, S. and A. Newton, \"Registration Data Access Protocol (RDAP) Object Tagging\", BCP 221, RFC 8521, DOI 10.17487/RFC8521, November 2018, <https://www.rfc-editor.org/info/rfc8521>.",
      "ja": "[RFC8521] Hollenbeck、S.およびA.ニュートン、「登録データアクセスプロトコル（RDAP）オブジェクトタグ付け」、BCP 221、RFC 8521、DOI 10.17487 / RFC8521、2018年11月、<https：//www.rfc-editor.org/ info / rfc8521>。"
    },
    {
      "indent": 3,
      "text": "[RFC9082] Hollenbeck, S. and A. Newton, \"Registration Data Access Protocol (RDAP) Query Format\", STD 95, RFC 9082, DOI 10.17487/RFC9082, June 2021, <https://www.rfc-editor.org/info/rfc9082>.",
      "ja": "[RFC9082] Hollenbeck、S.およびA.ニュートン、「登録データアクセスプロトコル（RDAP）クエリフォーマット」、STD 95、RFC 9082、DOI 10.17487 / RFC9082、2021年6月、<https：//www.rfc-editor.org/ info / rfc9082>。"
    },
    {
      "indent": 3,
      "text": "[RFC9083] Hollenbeck, S. and A. Newton, \"JSON Responses for the Registration Data Access Protocol (RDAP)\", STD 95, RFC 9083, DOI 10.17487/RFC9083, June 2021, <https://www.rfc-editor.org/info/rfc9083>.",
      "ja": "[RFC9083] Hollenbeck、S.およびA.ニュートン、「登録データアクセスプロトコル（RDAP）」、STD 95、RFC 9083、DOI 10.17487 / RFC9083、6月2021年6月、<https：///www.rfc-編集者.ORG / INFO / RFC9083>。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Changes since RFC 7484",
      "section_title": true,
      "ja": "付録A. RFC 7484以降の変更"
    },
    {
      "indent": 3,
      "text": "There are no substantive changes except for minor clarifications. This update is primarily to meet the requirements for moving to an Internet Standard.",
      "ja": "マイナーな説明を除いて実質的な変更はありません。このアップデートは主にインターネット規格に移行するための要件を満たすためのものです。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "The WEIRDS Working Group had multiple discussions on this topic, including a session during IETF 84, where various methods such as in-DNS and others were debated. The idea of using IANA registries was discovered by the author during discussions with his colleagues as well as by a comment from Andy Newton. All the people involved in these discussions are herein acknowledged. Linlin Zhou, Jean-Philippe Dionne, John Levine, Kim Davies, Ernie Dainow, Scott Hollenbeck, Arturo Servin, Andy Newton, Murray Kucherawy, Tom Harrison, Naoki Kambe, Alexander Mayrhofer, Edward Lewis, Pete Resnick, Alessandro Vesely, Bert Greevenbosch, Barry Leiba, Jari Arkko, Kathleen Moriaty, Stephen Farrell, Richard Barnes, and Jean-Francois Tremblay provided input and suggestions to the first version of this document.",
      "ja": "奇妙なワーキンググループは、IETF 84の間のセッションを含む、このトピックに関する複数の議論を行っており、DNSなどのさまざまな方法が議論されていました。IANA Registriesを使用するという考えは、彼の同僚との議論の間に、そしてAndy Newtonからのコメントによって著者によって発見されました。これらの議論に関わるすべての人々は、本明細書に承認されている。Linlin Zhou、Jean-Philippe Dionne、John Levine、Kim Davies、Ernie Dainow、Scott Hollenbeck、Arturo Servin、Andy Newton、Murray Kucherawy、Tom Harrison、Alexander Mayrhofer、Edwardle Mayrhofer、Alexander Mayrhofer、アレッサンドロ、Bert Grevenbosch、Barry Leiba、Jari Arkko、Kathleen Moriaty、Stephen Farrell、Richard Barnes、Jean-Francois Tremblayがこの文書の最初のバージョンへの入力と提案を提供しました。"
    },
    {
      "indent": 3,
      "text": "Guillaume Leclanche was a coauthor of this document for some revisions; his support is therein acknowledged and greatly appreciated. The section on formal definition was inspired by Section 6.2 of [RFC7071]. This new version [This document] received comments and suggestions from Gavin Brown, Patrick Mevzek, John Levine, Jasdip Singh, George Michaelson, Scott Hollenbeck, Russ Housley, Joel Halpern, Lars Eggert, Benjamin Kaduk, Scott Kelly, Éric Vyncke, John Scudder, Erik Kline, and Robert Wilton. Errata for RFC 7484 were submitted by Pieter Vandepitte and were applied to this document.",
      "ja": "Guillaume Leclancheはいくつかの改訂のためにこの文書の共著者でした。彼の支持はその中に認められて大いに感謝しています。正式な定義に関するセクションは[RFC7071]のセクション6.2に触発されました。この新しいバージョン[このドキュメント] Gavin Brown、Patrick Mevzek、John Levine、Jasdip Singh、Jasdip Singh、Jasdip Singh、Jasdip Singh、Jasdip Singh、Russ Hollenbeck、Joel Halpern、Lars Halpern、Lars Halpern、Scott Kelly、Ersckydder、John Scudder、エリックKline、Robert Wilton。RFC 7484の正誤表は、Pieter Vandepitteによって提出され、この文書に適用されました。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "作者の住所"
    },
    {
      "indent": 3,
      "text": "Marc Blanchet Viagenie 246 Aberdeen Quebec QC G1R 2E1 Canada Email: Marc.Blanchet@viagenie.ca URI: https://viagenie.ca",
      "ja": "Marc Blanchet Viagenie 246 Aberdeen Quebec QC G1R 2E1カナダメール：MARC.BLANCHET@VIAGENIE.ca URI：https：//viagenie.ca"
    }
  ]
}