{
  "title": {
    "text": "RFC 9229 - IPv4 Routes with an IPv6 Next Hop in the Babel Routing Protocol (RFC 9229)",
    "ja": "RFC 9229 - IPv4を備えたIPv4ルーティングバベルルーティングプロトコル（RFC 9229）の次のホップ"
  },
  "number": 9229,
  "created_at": "2022-05-08 03:00:03.016774+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                     J. Chroboczek\nRequest for Comments: 9229                     IRIF, University of Paris\nCategory: Experimental                                          May 2022\nISSN: 2070-1721",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "IPv4 Routes with an IPv6 Next Hop in the Babel Routing Protocol",
      "ja": "IPv4を備えたIPv4ルートバベルルーティングプロトコルの次のホップ"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document defines an extension to the Babel routing protocol that allows announcing routes to an IPv4 prefix with an IPv6 next hop, which makes it possible for IPv4 traffic to flow through interfaces that have not been assigned an IPv4 address.",
      "ja": "このドキュメントでは、IPv6 Next HopでIPv4プレフィックスへのルートをアナウンスすることを可能にするBABELルーティングプロトコルの拡張機能を定義します。これにより、IPv4アドレスが割り当てられていないインターフェイスを通るIPv4トラフィックが可能になります。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for examination, experimental implementation, and evaluation.",
      "ja": "このドキュメントは、インターネット標準の追跡仕様ではありません。試験、実験的実装、および評価のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document defines an Experimental Protocol for the Internet community. This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are candidates for any level of Internet Standard; see Section 2 of RFC 7841.",
      "ja": "このドキュメントは、インターネットコミュニティの実験プロトコルを定義しています。このドキュメントは、インターネットエンジニアリングタスクフォース（IETF）の製品です。IETFコミュニティのコンセンサスを表しています。公開レビューを受けており、インターネットエンジニアリングステアリンググループ（IESG）からの出版が承認されています。IESGによって承認されたすべてのドキュメントが、インターネット標準のあらゆるレベルの候補者であるわけではありません。RFC 7841のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at https://www.rfc-editor.org/info/rfc9229.",
      "ja": "このドキュメントの現在のステータス、任意のERRATA、およびそのフィードバックを提供する方法に関する情報は、https：//www.rfc-editor.org/info/rfc9229で取得できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2022 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（c）2022 IETF Trustおよび文書著者として特定された人。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (https://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Revised BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Revised BSD License.",
      "ja": "このドキュメントは、BCP 78およびIETFドキュメント（https://trustee.ietf.org/license-info）に関連するIETF Trustの法的規定の対象となります。この文書に関するあなたの権利と制限を説明するので、これらの文書を注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、セクション4.Eで説明されている法的規定のセクション4.Eで説明されており、修正されたBSDライセンスで説明されているように保証なしで提供される修正されたBSDライセンステキストを含める必要があります。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction\n  1.1.  Specification of Requirements\n2.  Protocol Operation\n  2.1.  Announcing v4-via-v6 Routes\n  2.2.  Receiving v4-via-v6 Routes\n  2.3.  Route and Seqno Requests\n  2.4.  Other TLVs\n3.  ICMPv4 and PMTU Discovery\n4.  Protocol Encoding\n  4.1.  Prefix Encoding\n  4.2.  Changes to Existing TLVs\n5.  Backwards Compatibility\n6.  IANA Considerations\n7.  Security Considerations\n8.  References\n  8.1.  Normative References\n  8.2.  Informative References\nAcknowledgments\nAuthor's Address",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The role of a routing protocol is to build a routing table, a data structure that maps network prefixes in a given family (IPv4 or IPv6) to next hops, which are (at least conceptually) pairs of an outgoing interface and a neighbour's network address. For example:",
      "ja": "ルーティングプロトコルの役割は、ルーティングテーブルを構築することです。これは、特定のファミリー（IPv4またはIPv6）のネットワークプレフィックスをマップするデータ構造を構築することです。。例えば："
    },
    {
      "indent": 9,
      "text": "    destination                      next hop\n2001:db8:0:1::/64               eth0, fe80::1234:5678\n203.0.113.0/24                  eth0, 192.0.2.1",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "When a packet is routed according to a given routing table entry, the forwarding plane typically uses a neighbour discovery protocol (the Neighbour Discovery (ND) protocol [RFC4861] in the case of IPv6 and the Address Resolution Protocol (ARP) [RFC0826] in the case of IPv4) to map the next-hop address to a link-layer address (a \"Media Access Control (MAC) address\"), which is then used to construct the link-layer frames that encapsulate forwarded packets.",
      "ja": "特定のルーティングテーブルエントリに従ってパケットがルーティングされると、転送面は通常、IPv6およびアドレス解像度プロトコル（ARP）[RFC0826]の場合、Neighbor Discovery Protocol（Neighbor Discovery（ND）プロトコル[RFC4861]を使用します。IPv4の場合）次のホップアドレスをリンク層アドレス（「メディアアクセス制御（MAC）アドレス」）にマッピングします。これは、転送されたパケットをカプセル化するリンク層フレームを構築するために使用されます。"
    },
    {
      "indent": 3,
      "text": "It is apparent from the description above that there is no fundamental reason why the destination prefix and the next-hop address should be in the same address family: there is nothing preventing an IPv6 packet from being routed through a next hop with an IPv4 address (in which case the next hop's MAC address will be obtained using ARP) or, conversely, an IPv4 packet from being routed through a next hop with an IPv6 address. (In fact, it is even possible to store link-layer addresses directly in the next-hop entry of the routing table, which is commonly done in networks using the OSI protocol suite).",
      "ja": "上記の説明から、宛先のプレフィックスとネクストホップアドレスが同じアドレスファミリにある必要がある基本的な理由はないことは明らかです。IPv6パケットがIPv4アドレスを使用して次のホップでルーティングされるのを妨げるものは何もありません（その場合、次のホップのMACアドレスは、ARPを使用して取得されます）、または逆に、IPv6アドレスを使用して次のホップを介してルーティングされてからIPv4パケットが取得されます。（実際、OSIプロトコルスイートを使用してネットワークで一般的に行われるルーティングテーブルの次のホップエントリにリンクレイヤーアドレスを直接保存することも可能です）。"
    },
    {
      "indent": 3,
      "text": "The case of routing IPv4 packets through an IPv6 next hop is particularly interesting, since it makes it possible to build networks that have no IPv4 addresses except at the edges and still provide IPv4 connectivity to edge hosts. In addition, since an IPv6 next hop can use a link-local address that is autonomously configured, the use of such routes enables a mode of operation where the network core has no statically assigned IP addresses of either family, which significantly reduces the amount of manual configuration required. (See also [RFC7404] for a discussion of the issues involved with such an approach.)",
      "ja": "IPv6の次のホップを介してIPv4パケットをルーティングする場合は特に興味深いものです。これは、エッジを除くIPv4アドレスがないネットワークを構築し、エッジホストにIPv4接続を提供することを可能にするためです。さらに、IPv6 Next Hopは自律的に構成されているリンクローカルアドレスを使用できるため、そのようなルートを使用すると、ネットワークコアにどちらの家族のIPアドレスが静的に割り当てられていない操作モードが可能になり、これにより大幅に減少します。手動構成が必要です。（このようなアプローチに関連する問題の議論については、[RFC7404]も参照してください。）"
    },
    {
      "indent": 3,
      "text": "We call a route towards an IPv4 prefix that uses an IPv6 next hop a \"v4-via-v6\" route. This document describes an extension that allows the Babel routing protocol [RFC8966] to announce v4-via-v6 routes across interfaces that have no IPv4 addresses assigned but are capable of forwarding IPv4 traffic. Section 3 describes procedures that ensure that all routers can originate ICMPv4 packets, even if they have not been assigned any IPv4 addresses.",
      "ja": "IPv6の次のホップを「V4-Via-V6」ルートを使用するIPv4プレフィックスに向かってルートを呼び出します。このドキュメントでは、BABELルーティングプロトコル[RFC8966]が、IPv4アドレスが割り当てられていないがIPv4トラフィックを転送できるインターフェイス間のV4-VIA-V6ルートを発表できる拡張機能を説明しています。セクション3では、IPv4アドレスが割り当てられていない場合でも、すべてのルーターがICMPV4パケットを発信できることを保証する手順について説明します。"
    },
    {
      "indent": 3,
      "text": "The extension described in this document is inspired by a previously defined extension to BGP [RFC5549].",
      "ja": "このドキュメントで説明されている拡張機能は、以前に定義されたBGP [RFC5549]の拡張に触発されています。"
    },
    {
      "indent": 0,
      "text": "1.1. Specification of Requirements",
      "section_title": true,
      "ja": "1.1. 要件の仕様"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14 [RFC2119] [RFC8174] when, and only when, they appear in all capitals, as shown here.",
      "ja": "この文書のキーワード \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", および \"OPTIONAL\" はBCP 14 [RFC2119] [RFC8174]で説明されているように、すべて大文字の場合にのみ解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. Protocol Operation",
      "section_title": true,
      "ja": "2. プロトコル操作"
    },
    {
      "indent": 3,
      "text": "The Babel protocol fully supports dual-stack operation: all data that represent a neighbour address or a network prefix are tagged by an Address Encoding (AE), a small integer that identifies the address family (IPv4 or IPv6) of the address of prefix and describes how it is encoded. This extension defines a new AE, called \"v4-via-v6\", which has the same format as the existing AE for IPv4 addresses (AE 1). This new AE is only allowed in TLVs that carry network prefixes: TLVs that carry an IPv6 neighbour address use one of the normal encodings for IPv6 addresses.",
      "ja": "BABELプロトコルはデュアルスタック操作を完全にサポートしています。近隣アドレスまたはネットワークプレフィックスを表すすべてのデータは、プレフィックスのアドレスのアドレスファミリ（IPv4またはIPv6）を識別する小さな整数と、アドレスエンコード（AE）によってタグ付けされます。エンコードの方法について説明します。この拡張は、「V4-Via-V6」と呼ばれる新しいAEを定義します。これは、IPv4アドレスの既存のAEと同じ形式（AE 1）です。この新しいAEは、ネットワークプレフィックスを搭載するTLVでのみ許可されています。IPv6ネイバーアドレスを運ぶTLVは、IPv6アドレスの通常のエンコーディングの1つを使用します。"
    },
    {
      "indent": 0,
      "text": "2.1. Announcing v4-via-v6 Routes",
      "section_title": true,
      "ja": "2.1. V4-VIA-V6ルートの発表"
    },
    {
      "indent": 3,
      "text": "A Babel node can use a v4-via-v6 announcement to announce an IPv4 route over an interface that has no assigned IPv4 address. In order to do so, it first establishes an IPv6 next-hop address in the usual manner (either by sending the Babel packet over IPv6, or by including a Next Hop TLV containing an IPv6 address and using AE 2 or 3); it then sends an Update, with AE equal to 4 (v4-via-v6) containing the IPv4 prefix being announced.",
      "ja": "BABELノードは、V4-VIA-V6アナウンスを使用して、IPv4アドレスが割り当てられていないインターフェイスを介してIPv4ルートを発表できます。そうするために、最初にIPv6 Next-Hopアドレスを通常の方法で確立します（IPv6を介してBabelパケットを送信するか、IPv6アドレスを含む次のホップTLVを含めてAE 2または3を使用することにより）。次に、IPv4プレフィックスを含む4（V4-VIA-V6）に等しいAEを発表したアップデートを送信します。"
    },
    {
      "indent": 3,
      "text": "If the outgoing interface has been assigned an IPv4 address, then, in the interest of maximising compatibility with existing routers, the sender SHOULD prefer an ordinary IPv4 announcement; even in that case, however, it MAY send a v4-via-v6 announcement. A node SHOULD NOT send both ordinary IPv4 and v4-via-v6 announcements for the same prefix over a single interface (if the update is sent to a multicast address) or to a single neighbour (if sent to a unicast address), since doing that provides no benefit while doubling the amount of routing traffic.",
      "ja": "発信インターフェイスにIPv4アドレスが割り当てられている場合、既存のルーターとの互換性を最大化するために、送信者は通常のIPv4アナウンスを好む必要があります。ただし、その場合でも、V4-VIA-V6の発表を送信する場合があります。ノードは、単一のインターフェイス（更新がマルチキャストアドレスに送信された場合）または単一の隣の（ユニキャストアドレスに送信された場合）で同じプレフィックスの通常のIPv4とV4-VIA-V6の両方のアナウンスを送信しないでください。それは、ルーティングトラフィックの量を2倍にしながら利益を提供しません。"
    },
    {
      "indent": 3,
      "text": "Updates with infinite metric are retractions: they indicate that a previously announced route is no longer available. Retractions do not require a next hop; therefore, there is no difference between v4-via-v6 retractions and ordinary retractions. A node MAY send IPv4 retractions only, or it MAY send v4-via-v6 retractions on interfaces that have not been assigned an IPv4 address.",
      "ja": "無限メトリックを使用した更新は撤回です。以前に発表されたルートが使用できなくなったことを示しています。撤回は次のホップを必要としません。したがって、V4-VIA-V6の撤回と通常の撤回の間に違いはありません。ノードは、IPv4格納のみを送信する場合があります。または、IPv4アドレスが割り当てられていないインターフェイスでV4-Via-V6リトラクションを送信する場合があります。"
    },
    {
      "indent": 0,
      "text": "2.2. Receiving v4-via-v6 Routes",
      "section_title": true,
      "ja": "2.2. V4-VIA-V6ルートを受信します"
    },
    {
      "indent": 3,
      "text": "Upon reception of an Update TLV with AE equal to 4 (v4-via-v6) and finite metric, a Babel node computes the IPv6 next hop, as described in Section 4.6.9 of [RFC8966]. If no IPv6 next hop exists, then the Update MUST be ignored. If an IPv6 next hop exists, then the node MAY acquire the route being announced, as described in Section 3.5.3 of [RFC8966]; the parameters of the route are as follows:",
      "ja": "AEが4（V4-VIA-V6）と有限メトリックに等しい更新TLVを受信すると、BABELノードは[RFC8966]のセクション4.6.9で説明されているように、IPv6次のホップを計算します。IPv6の次のホップが存在しない場合、更新は無視する必要があります。IPv6の次のホップが存在する場合、[RFC8966]のセクション3.5.3で説明されているように、ノードは発表されるルートを取得できます。ルートのパラメーターは次のとおりです。"
    },
    {
      "indent": 3,
      "text": "* The prefix, plen, router-id, seqno, and metric MUST be computed as for an IPv4 route, as described in Section 4.6.9 of [RFC8966].",
      "ja": "* [RFC8966]のセクション4.6.9で説明されているように、IPv4ルートのように、プレフィックス、プレン、ルーター-ID、SEQNO、およびメトリックを計算する必要があります。"
    },
    {
      "indent": 3,
      "text": "* The next hop MUST be computed as for an IPv6 route, as described in Section 4.6.9 of [RFC8966]. It is taken from the last preceding Next Hop TLV with an AE field equal to 2 or 3; if no such entry exists and if the Update TLV has been sent in a Babel packet carried over IPv6, then the next hop is the network-layer source address of the packet.",
      "ja": "* [RFC8966]のセクション4.6.9で説明されているように、次のホップはIPv6ルートのように計算する必要があります。これは、2または3に等しいAEフィールドを持つ最後の次のホップTLVから取られます。そのようなエントリが存在しない場合、および更新TLVがIPv6に搭載されたBabelパケットで送信された場合、次のホップはパケットのネットワークレイヤーソースアドレスです。"
    },
    {
      "indent": 3,
      "text": "An Update TLV with a v4-via-v6 AE and metric equal to infinity is a retraction: it announces that a previously available route is being retracted. In that case, no next hop is necessary, and the retraction is treated as described in Section 4.6.9 of [RFC8966].",
      "ja": "V4-VIA-V6 AEとInfinityに等しいメトリックを備えた更新TLVは、撤回です。以前に利用可能なルートが撤回されていることを発表します。その場合、次のホップは必要ありません。また、[RFC8966]のセクション4.6.9で説明されているように、収縮は扱われます。"
    },
    {
      "indent": 3,
      "text": "As usual, a node MAY ignore the update, e.g., due to filtering (see Appendix C of [RFC8966]). If a node cannot install v4-via-v6 routes, e.g., due to hardware or software limitations, then routes to an IPv4 prefix with an IPv6 next hop MUST NOT be selected.",
      "ja": "いつものように、ノードは、たとえばフィルタリングのために更新を無視する場合があります（[RFC8966]の付録Cを参照）。ノードがV4-VIA-V6ルートをインストールできない場合、たとえば、ハードウェアまたはソフトウェアの制限により、IPv6次のホップを使用してIPv4プレフィックスへのルートを選択する必要はありません。"
    },
    {
      "indent": 0,
      "text": "2.3. Route and Seqno Requests",
      "section_title": true,
      "ja": "2.3. ルートとseqnoリクエスト"
    },
    {
      "indent": 3,
      "text": "Route and seqno requests are used to request an update for a given prefix. Since they are not related to a specific next hop, there is no semantic difference between IPv4 and v4-via-v6 requests. Therefore, a node SHOULD NOT send requests of either kind with the AE field being set to 4 (v4-via-v6); instead, it SHOULD request IPv4 updates by sending requests with the AE field being set to 1 (IPv4).",
      "ja": "ルートとSEQNOのリクエストは、特定のプレフィックスの更新をリクエストするために使用されます。それらは特定の次のホップとは関係がないため、IPv4とV4-Via-V6リクエストの間にセマンティックな違いはありません。したがって、ノードはどちらの種類のリクエストを送信しても、AEフィールドが4（V4-VIA-V6）に設定されています。代わりに、AEフィールドが1（IPv4）に設定されているリクエストを送信して、IPv4の更新を要求する必要があります。"
    },
    {
      "indent": 3,
      "text": "When receiving requests, AEs 1 (IPv4) and 4 (v4-via-v6) MUST be treated in the same manner: the receiver processes the request as described in Section 3.8 of [RFC8966]. If an Update is sent, then it MAY be an ordinary IPv4 announcement (AE = 1) or a v4-via-v6 announcement (AE = 4), as described in Section 2.1, irrespective of which AE was used in the request.",
      "ja": "リクエストを受信する場合、AES 1（IPV4）および4（V4-VIA-V6）は同じ方法で扱わなければなりません。[RFC8966]のセクション3.8で説明されているように、受信機は要求を処理します。更新が送信された場合、それは、セクション2.1で説明されているように、通常のIPv4アナウンス（AE = 1）またはV4-VIA-V6アナウンス（AE = 4）である可能性があります。"
    },
    {
      "indent": 3,
      "text": "When receiving a request with AE 0 (wildcard), the receiver SHOULD send a full route dump, as described in Section 3.8.1.1 of [RFC8966]. Any IPv4 routes contained in the route dump may use either AE 1 (IPv4) or AE 4 (v4-via-v6), as described Section 2.1.",
      "ja": "AE 0（WildCard）でリクエストを受信する場合、[RFC8966]のセクション3.8.1.1で説明されているように、レシーバーは完全なルートダンプを送信する必要があります。ルートダンプに含まれるIPv4ルートは、セクション2.1のように、AE 1（IPv4）またはAE 4（V4-VIA-V6）のいずれかを使用できます。"
    },
    {
      "indent": 0,
      "text": "2.4. Other TLVs",
      "section_title": true,
      "ja": "2.4. 他のTLV"
    },
    {
      "indent": 3,
      "text": "The only other TLVs defined by [RFC8966] that carry an AE field are Next Hop and IHU. Next Hop and IHU TLVs MUST NOT carry the AE 4 (v4- via-v6).",
      "ja": "AEフィールドを運ぶ[RFC8966]で定義された他の唯一のTLVは、次のホップとIHUです。次のホップとIHU TLVSは、AE 4（V4- Via-V6）を携帯してはなりません。"
    },
    {
      "indent": 0,
      "text": "3. ICMPv4 and PMTU Discovery",
      "section_title": true,
      "ja": "3. ICMPV4およびPMTU発見"
    },
    {
      "indent": 3,
      "text": "The Internet Control Message Protocol (ICMPv4, or simply ICMP) [RFC0792] is a protocol related to IPv4 that is primarily used to carry diagnostic and debugging information. ICMPv4 packets may be originated by end hosts (e.g., the \"destination unreachable, port unreachable\" ICMPv4 packet), but they may also be originated by intermediate routers (e.g., most other kinds of \"destination unreachable\" packets).",
      "ja": "インターネット制御メッセージプロトコル（ICMPV4、または単にICMP）[RFC0792]は、主に診断情報とデバッグ情報を運ぶために使用されるIPv4に関連するプロトコルです。ICMPV4パケットは、エンドホスト（例：「到達不能、到達不可能な宛先」ICMPV4パケットなど）によって発信される場合がありますが、中間ルーター（例えば、他のほとんどの種類の「到達不可能な」パケットなど）によっても発生する場合があります。"
    },
    {
      "indent": 3,
      "text": "Some protocols deployed in the Internet rely on ICMPv4 packets sent by intermediate routers. Most notably, Path MTU Discovery (PMTUD) [RFC1191] is an algorithm executed by end hosts to discover the maximum packet size that a route is able to carry. While there exist variants of PMTUD that are purely end-to-end [RFC4821], the variant most commonly deployed in the Internet has a hard dependency on ICMPv4 packets originated by intermediate routers: if intermediate routers are unable to send ICMPv4 packets, PMTUD may lead to persistent blackholing of IPv4 traffic.",
      "ja": "インターネットに展開されている一部のプロトコルは、中間ルーターによって送信されるICMPV4パケットに依存しています。最も注目すべきは、Path MTU Discovery（PMTUD）[RFC1191]は、エンドホストによって実行されたアルゴリズムであり、ルートが運ぶことができる最大パケットサイズを発見します。純粋にエンドツーエンド[RFC4821]であるPMTUDのバリエーションは存在しますが、インターネットに最も一般的に展開されるバリアントは、中間ルーターによって由来するICMPV4パケットに激しく依存しています。IPv4トラフィックの持続的なブラックホールにつながります。"
    },
    {
      "indent": 3,
      "text": "Due to this kind of dependency, every Babel router that is able to forward IPv4 traffic MUST be able originate ICMPv4 traffic. Since the extension described in this document enables routers to forward IPv4 traffic received over an interface that has not been assigned an IPv4 address, a router implementing this extension MUST be able to originate ICMPv4 packets even when the outgoing interface has not been assigned an IPv4 address.",
      "ja": "この種の依存関係により、IPv4トラフィックを転送できるすべてのBabelルーターは、ICMPV4トラフィックを発信できる必要があります。このドキュメントで説明されている拡張機能により、ルーターはIPv4アドレスが割り当てられていないインターフェイスを介して受信したIPv4トラフィックを転送できるため、この拡張機能を実装するルーターは、発信インターフェイスにIPv4アドレスが割り当てられていない場合でもICMPV4パケットを発信できる必要があります。。"
    },
    {
      "indent": 3,
      "text": "In such a situation, if a Babel router has an interface that has been assigned an IPv4 address (other than a loopback address) or if an IPv4 address has been assigned to the router itself (to the \"loopback interface\"), then that IPv4 address may be used as the source of originated ICMPv4 packets. If no IPv4 address is available, a Babel router could use the experimental mechanism described in Requirement R-22 of Section 4.8 of [RFC7600], which consists of using the dummy address 192.0.0.8 as the source address of originated ICMPv4 packets. Note, however, that using the same address on multiple routers may hamper debugging and fault isolation, e.g., when using the \"traceroute\" utility.",
      "ja": "このような状況では、BabelルーターにIPv4アドレスが割り当てられたインターフェイス（ループバックアドレス以外）がある場合、またはIPv4アドレスがルーター自体（「ループバックインターフェイス」）に割り当てられている場合、そのIPv4アドレスは、発信されたICMPV4パケットのソースとして使用できます。IPv4アドレスが利用できない場合、BABELルーターは、[RFC7600]のセクション4.8の要件R-22で説明されている実験メカニズムを使用できます。ただし、複数のルーターで同じアドレスを使用すると、「Traceroute」ユーティリティを使用する場合、デバッグと障害の分離を妨げる可能性があることに注意してください。"
    },
    {
      "indent": 0,
      "text": "4. Protocol Encoding",
      "section_title": true,
      "ja": "4. プロトコルエンコーディング"
    },
    {
      "indent": 3,
      "text": "This extension defines the v4-via-v6 AE, whose value is 4. This AE is solely used to tag network prefixes and MUST NOT be used to tag neighbour addresses, e.g., in Next Hop or IHU TLVs.",
      "ja": "この拡張機能は、値が4であるV4-Via-V6 AEを定義します。このAEは、ネットワークプレフィックスのタグのみに使用され、次のホップまたはIHU TLVで隣接アドレスをタグ付けするために使用してはなりません。"
    },
    {
      "indent": 3,
      "text": "This extension defines no new TLVs or sub-TLVs.",
      "ja": "この拡張機能は、新しいTLVまたはサブTLVを定義しません。"
    },
    {
      "indent": 0,
      "text": "4.1. Prefix Encoding",
      "section_title": true,
      "ja": "4.1. プレフィックスエンコーディング"
    },
    {
      "indent": 3,
      "text": "Network prefixes tagged with AE 4 (v4-via-v6) MUST be encoded and decoded just like prefixes tagged with AE 1 (IPv4), as described in Section 4.1.5 of [RFC8966].",
      "ja": "AE 4（V4-VIA-V6）でタグ付けされたネットワークプレフィックスは、[RFC8966]のセクション4.1.5で説明されているように、AE 1（IPv4）でタグ付けされたプレフィックスと同じようにエンコードおよびデコードする必要があります。"
    },
    {
      "indent": 3,
      "text": "A new compression state for AE 4 (v4-via-v6) distinct from that of AE 1 (IPv4) is introduced and MUST be used for address compression of prefixes tagged with AE 4, as described in Sections 4.5 and 4.6.9 of [RFC8966]",
      "ja": "AE 1（IPv4）のそれとは異なるAE 4（V4-VIA-V6）の新しい圧縮状態が導入されており、[AE 4でタグ付けされたプレフィックスのアドレス指定にも使用する必要があります。RFC8966]"
    },
    {
      "indent": 0,
      "text": "4.2. Changes to Existing TLVs",
      "section_title": true,
      "ja": "4.2. 既存のTLVの変更"
    },
    {
      "indent": 3,
      "text": "The following TLVs MAY be tagged with AE 4 (v4-via-v6):",
      "ja": "次のTLVには、AE 4（V4-VIA-V6）がタグ付けされる場合があります。"
    },
    {
      "indent": 3,
      "text": "* Update (Type = 8)",
      "ja": "* 更新（type = 8）"
    },
    {
      "indent": 3,
      "text": "* Route Request (Type = 9)",
      "ja": "* ルートリクエスト（タイプ= 9）"
    },
    {
      "indent": 3,
      "text": "* Seqno Request (Type = 10)",
      "ja": "* seqnoリクエスト（タイプ= 10）"
    },
    {
      "indent": 3,
      "text": "As AE 4 (v4-via-v6) is suitable only for network prefixes, IHU (Type = 5) and Next Hop (Type = 7) TLVs are never sent with AE 4. Such (incorrect) TLVs MUST be ignored upon reception.",
      "ja": "AE 4（V4-VIA-V6）はネットワークプレフィックスにのみ適しているため、IHU（Type = 5）および次のホップ（Type = 7）TLVはAE 4で送信されません。"
    },
    {
      "indent": 0,
      "text": "4.2.1. Update",
      "section_title": true,
      "ja": "4.2.1. アップデート"
    },
    {
      "indent": 3,
      "text": "An Update (Type = 8) TLV with AE 4 (v4-via-v6) is constructed as described in Section 4.6.9 of [RFC8966] for AE 1 (IPv4), with the following specificities:",
      "ja": "AE 4（V4-VIA-V6）の更新（Type = 8）TLVは、AE 1（IPv4）の[RFC8966]のセクション4.6.9で説明されているように構築され、次の特異性があります。"
    },
    {
      "indent": 3,
      "text": "* The Prefix field is constructed according to Section 4.1.",
      "ja": "* プレフィックスフィールドは、セクション4.1に従って構築されます。"
    },
    {
      "indent": 3,
      "text": "* The Next Hop field is built and parsed as described in Sections 2.1 and 2.2.",
      "ja": "* 次のホップフィールドは、セクション2.1および2.2で説明されているように構築および解析されます。"
    },
    {
      "indent": 0,
      "text": "4.2.2. Requests",
      "section_title": true,
      "ja": "4.2.2. リクエスト"
    },
    {
      "indent": 3,
      "text": "When tagged with the AE 4 (v4-via-v6), Route Request and Seqno Request TLVs MUST be constructed and decoded as described in Section 4.6 of [RFC8966], and the network prefixes contained within them MUST be decoded as described in Section 4.1 (see also Section 2.3).",
      "ja": "AE 4（V4-VIA-V6）でタグ付けされた場合、ルートリクエストとSEQNO要求TLVを構築およびデコードする必要があります[RFC8966]のセクション4.6で説明し、それらに含まれるネットワークのプレフィックスはセクション4.11で説明されているようにデコードする必要があります。（セクション2.3も参照）。"
    },
    {
      "indent": 0,
      "text": "5. Backwards Compatibility",
      "section_title": true,
      "ja": "5. 後方互換性"
    },
    {
      "indent": 3,
      "text": "This protocol extension adds no new TLVs or sub-TLVs.",
      "ja": "このプロトコル拡張は、新しいTLVまたはサブTLVを追加しません。"
    },
    {
      "indent": 3,
      "text": "This protocol extension uses a new AE. As discussed in Appendix D of [RFC8966] and specified in the same document, implementations that do not understand the present extension will silently ignore the various TLVs that use this new AE. As a result, incompatible versions will ignore v4-via-v6 routes. They will also ignore requests with AE 4 (v4-via-v6), which, as stated in Section 2.3, are not recommended.",
      "ja": "このプロトコル拡張は、新しいAEを使用します。[RFC8966]の付録Dで説明し、同じドキュメントで指定されているように、現在の拡張機能を理解していない実装は、この新しいAEを使用するさまざまなTLVを静かに無視します。その結果、互換性のないバージョンでは、V4-VIA-V6ルートが無視されます。また、AE 4（V4-VIA-V6）のリクエストも無視します。これは、セクション2.3で述べられているように、推奨されません。"
    },
    {
      "indent": 3,
      "text": "Using a new AE introduces a new compression state, which is used to parse the network prefixes. As this compression state is separate from the states of other AEs, it will not interfere with the compression state of unextended nodes.",
      "ja": "新しいAEを使用すると、ネットワークのプレフィックスを解析するために使用される新しい圧縮状態が導入されます。この圧縮状態は他のAEの状態とは分離されているため、拡張されたノードの圧縮状態を妨害しません。"
    },
    {
      "indent": 3,
      "text": "This extension reuses the next-hop state from AEs 2 and 3 (IPv6) but makes no changes to the way in which it is updated. Therefore, it causes no compatibility issues.",
      "ja": "この拡張機能は、AES 2および3（IPv6）から次のホップ状態を再利用しますが、更新された方法に変更を加えません。したがって、互換性の問題はありません。"
    },
    {
      "indent": 3,
      "text": "As mentioned in Section 2.1, ordinary IPv4 announcements are preferred to v4-via-v6 announcements when the outgoing interface has an assigned IPv4 address; doing otherwise would prevent routers that do not implement this extension from learning the route being announced.",
      "ja": "セクション2.1で述べたように、発信インターフェイスにIPv4アドレスが割り当てられている場合、通常のIPv4アナウンスはV4-VIA-V6の発表よりも優先されます。そうでない場合は、この拡張機能を実装していないルーターが発表されているルートの学習を防ぐことができません。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has allocated value 4 in the \"Babel Address Encodings\" registry as follows:",
      "ja": "IANAは、次のように「バベルアドレスエンコーディング」レジストリに値4を割り当てました。"
    },
    {
      "indent": 22,
      "text": "+====+===========+===========+\n| AE | Name      | Reference |\n+====+===========+===========+\n| 4  | v4-via-v6 | RFC 9229  |\n+----+-----------+-----------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 33,
      "text": "Table 1",
      "ja": "表1"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "ja": "7. セキュリティ上の考慮事項"
    },
    {
      "indent": 3,
      "text": "The extension defined in this document does not fundamentally change the security properties of the Babel protocol. However, by allowing IPv4 routes to be propagated across routers that have not been assigned IPv4 addresses, it might invalidate the assumptions made by network administrators, which could conceivably lead to security issues.",
      "ja": "このドキュメントで定義されている拡張機能は、Babelプロトコルのセキュリティプロパティを根本的に変更しません。ただし、IPv4アドレスが割り当てられていないルーター間でIPv4ルートを伝播できるようにすることにより、ネットワーク管理者が作成した仮定を無効にする可能性があり、セキュリティ問題につながる可能性があります。"
    },
    {
      "indent": 3,
      "text": "For example, if an island of IPv4-only hosts is separated from the IPv4 Internet by routers that have not been assigned IPv4 addresses, a network administrator might reasonably assume that the IPv4-only hosts are unreachable from the IPv4 Internet. This assumption is broken if the intermediary routers implement the extension described in this document, which might expose the IPv4-only hosts to traffic from the IPv4 Internet. If this is undesirable, the flow of IPv4 traffic must be restricted by the use of suitable filtering rules (see Appendix C of [RFC8966]) together with matching packet filters in the data plane.",
      "ja": "たとえば、IPv4のみのホストの島がIPv4アドレスを割り当てられていないルーターによってIPv4インターネットから分離されている場合、ネットワーク管理者はIPv4のみのホストがIPv4インターネットから到達不可能であると合理的に想定する場合があります。この仮定は、中間ルーターがこのドキュメントで説明されている拡張機能を実装した場合に壊れます。これにより、IPv4のみのホストがIPv4インターネットからのトラフィックに公開される可能性があります。これが望ましくない場合、IPv4トラフィックのフローは、適切なフィルタリングルール（[RFC8966]の付録Cを参照）を使用して、データプレーンの一致するパケットフィルターを制限する必要があります。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8. 参考文献"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "ja": "8.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC0792] Postel, J., \"Internet Control Message Protocol\", STD 5, RFC 792, DOI 10.17487/RFC0792, September 1981, <https://www.rfc-editor.org/info/rfc792>.",
      "ja": "[RFC0792] POSTEL、J。、「インターネットコントロールメッセージプロトコル」、STD 5、RFC 792、DOI 10.17487/RFC0792、1981年9月、<https://www.rfc-editor.org/info/rfc792>。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <https://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119] Bradner、S。、「要件レベルを示すためにRFCで使用するためのキーワード」、BCP 14、RFC 2119、DOI 10.17487/RFC2119、1997年3月、<https://www.rfc-editor.org/info/RFC2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC8174] Leiba, B., \"Ambiguity of Uppercase vs Lowercase in RFC 2119 Key Words\", BCP 14, RFC 8174, DOI 10.17487/RFC8174, May 2017, <https://www.rfc-editor.org/info/rfc8174>.",
      "ja": "[RFC8174] Leiba、B。、「RFC 2119キーワードの大文字と小文字のあいまいさ」、BCP 14、RFC 8174、DOI 10.17487/RFC8174、2017年5月、<https：//www.rfc-editor.org/info/RFC8174>。"
    },
    {
      "indent": 3,
      "text": "[RFC8966] Chroboczek, J. and D. Schinazi, \"The Babel Routing Protocol\", RFC 8966, DOI 10.17487/RFC8966, January 2021, <https://www.rfc-editor.org/info/rfc8966>.",
      "ja": "[RFC8966] Chroboczek、J。およびD. Schinazi、「The Babel Routing Protocol」、RFC 8966、DOI 10.17487/RFC8966、2021年1月、<https://www.rfc-editor.org/info/rfc8966>"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "ja": "8.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[RFC0826] Plummer, D., \"An Ethernet Address Resolution Protocol: Or Converting Network Protocol Addresses to 48.bit Ethernet Address for Transmission on Ethernet Hardware\", STD 37, RFC 826, DOI 10.17487/RFC0826, November 1982, <https://www.rfc-editor.org/info/rfc826>.",
      "ja": "[RFC0826] Plummer、D。、「イーサネットアドレス解像度プロトコル：またはネットワークプロトコルアドレスをイーサネットハードウェア上の送信のための48.ビットイーサネットアドレスに変換する」、STD 37、RFC 826、DOI 10.17487/RFC0826、1982年11月、<https：<https：//www.rfc-editor.org/info/rfc826>。"
    },
    {
      "indent": 3,
      "text": "[RFC1191] Mogul, J. and S. Deering, \"Path MTU discovery\", RFC 1191, DOI 10.17487/RFC1191, November 1990, <https://www.rfc-editor.org/info/rfc1191>.",
      "ja": "[RFC1191] Mogul、J。およびS. Deering、「Path MTU Discovery」、RFC 1191、DOI 10.17487/RFC1191、1990年11月、<https://www.rfc-editor.org/info/rfc1191>。"
    },
    {
      "indent": 3,
      "text": "[RFC4821] Mathis, M. and J. Heffner, \"Packetization Layer Path MTU Discovery\", RFC 4821, DOI 10.17487/RFC4821, March 2007, <https://www.rfc-editor.org/info/rfc4821>.",
      "ja": "[RFC4821] Mathis、M。およびJ. Heffner、「Packetization Layer Path MTU Discovery」、RFC 4821、DOI 10.17487/RFC4821、2007年3月、<https://www.rfc-editor.org/info/rfc4821>。"
    },
    {
      "indent": 3,
      "text": "[RFC4861] Narten, T., Nordmark, E., Simpson, W., and H. Soliman, \"Neighbor Discovery for IP version 6 (IPv6)\", RFC 4861, DOI 10.17487/RFC4861, September 2007, <https://www.rfc-editor.org/info/rfc4861>.",
      "ja": "[RFC4861] Narten、T.、Nordmark、E.、Simpson、W。、およびH. Soliman、「IPバージョン6（IPv6）の近隣発見」、RFC 4861、DOI 10.17487/RFC4861、2007年9月、<https：/<https：//www.rfc-editor.org/info/rfc4861>。"
    },
    {
      "indent": 3,
      "text": "[RFC5549] Le Faucheur, F. and E. Rosen, \"Advertising IPv4 Network Layer Reachability Information with an IPv6 Next Hop\", RFC 5549, DOI 10.17487/RFC5549, May 2009, <https://www.rfc-editor.org/info/rfc5549>.",
      "ja": "[RFC5549] Le Faucheur、F。およびE. Rosen、「IPv4ネクターの到達可能性情報の広告IPv6 Next Hop」、RFC 5549、DOI 10.17487/RFC5549、2009年5月、<https：//www.rfc-editor.org/info/rfc5549>。"
    },
    {
      "indent": 3,
      "text": "[RFC7404] Behringer, M. and E. Vyncke, \"Using Only Link-Local Addressing inside an IPv6 Network\", RFC 7404, DOI 10.17487/RFC7404, November 2014, <https://www.rfc-editor.org/info/rfc7404>.",
      "ja": "[RFC7404] Behringer、M。およびE. Vyncke、「IPv6ネットワーク内でのリンクローカルアドレスのみを使用」、RFC 7404、DOI 10.17487/RFC7404、2014年11月、<https://www.rfc-editor.org/info/RFC7404>。"
    },
    {
      "indent": 3,
      "text": "[RFC7600] Despres, R., Jiang, S., Ed., Penno, R., Lee, Y., Chen, G., and M. Chen, \"IPv4 Residual Deployment via IPv6 - A Stateless Solution (4rd)\", RFC 7600, DOI 10.17487/RFC7600, July 2015, <https://www.rfc-editor.org/info/rfc7600>.",
      "ja": "[RFC7600] Despres、R.、Jiang、S.、Ed。、Penno、R.、Lee、Y.、Chen、G。、およびM. Chen、「IPv6を介したIPv4残差展開 - ステートレスソリューション（4番目）」、RFC 7600、DOI 10.17487/RFC7600、2015年7月、<https://www.rfc-editor.org/info/rfc7600>。"
    },
    {
      "indent": 0,
      "text": "Acknowledgments",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "This protocol extension was originally designed, described, and implemented in collaboration with Theophile Bastian. Margaret Cullen pointed out the issues with ICMP and helped coin the phrase \"v4-via-v6\". The author is also indebted to Donald Eastlake, Toke Høiland-Jørgensen, David Schinazi, and Donald Sharp.",
      "ja": "このプロトコル拡張は、もともとTheophile Bastianと協力して設計、説明、および実装されました。マーガレット・カレンは、ICMPの問題を指摘し、「V4-Via-V6」というフレーズのコインを支援しました。著者はまた、ドナルド・イーストレイク、トーク・ホイランド・ヨルゲンセン、デビッド・シナジ、ドナルド・シャープにも感謝しています。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者の住所"
    },
    {
      "indent": 3,
      "text": "Juliusz Chroboczek IRIF, University of Paris Case 7014 75205 Paris Cedex 13 France Email: jch@irif.fr",
      "ja": "Juliusz Chroboczek Irif、パリ大学ケース7014 75205 Paris Cedex 13フランスメール：jch@irif.fr"
    }
  ]
}