{
  "title": {
    "text": "RFC 7020 - The Internet Numbers Registry System",
    "ja": "RFC 7020 - インターネット番号レジストリシステム"
  },
  "number": 7020,
  "created_at": "2019-10-27 17:30:51.915479+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                        R. Housley\nRequest for Comments: 7020                                Vigil Security\nObsoletes: 2050                                                J. Curran\nCategory: Informational                                             ARIN\nISSN: 2070-1721                                                G. Huston\n                                                                   APNIC\n                                                               D. Conrad\n                                                        Virtualized, LLC\n                                                             August 2013",
      "raw": true
    },
    {
      "indent": 18,
      "text": "The Internet Numbers Registry System",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document provides information about the current Internet Numbers Registry System used in the distribution of globally unique Internet Protocol (IP) address space and autonomous system (AS) numbers.",
      "ja": "この文書では、グローバルにユニークなインターネット・プロトコル（IP）アドレス空間と自律システム（AS）番号の配布に使用される現在のインターネット番号のレジストリシステムについての情報を提供します。"
    },
    {
      "indent": 3,
      "text": "This document also provides information about the processes for further evolution of the Internet Numbers Registry System.",
      "ja": "この文書は、インターネット番号のレジストリシステムのさらなる進化のためのプロセスに関する情報を提供します。"
    },
    {
      "indent": 3,
      "text": "This document replaces RFC 2050.",
      "ja": "この文書は、RFC 2050に置き換えられます。"
    },
    {
      "indent": 3,
      "text": "This document does not propose any changes to the current Internet Numbers Registry System. Rather, it documents the Internet Numbers Registry System as it works today.",
      "ja": "このドキュメントは、現在のインターネット番号レジストリシステムへの変更を提案していません。それが今日の作品としてむしろ、それはインターネット番号レジストリシステムについて説明します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 IESGによって承認されていないすべての文書がインターネットStandardのどんなレベルの候補です。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7020.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7020で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2013 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2013 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . . . 2\n2.  Goals . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 3\n3.  Internet Numbers Registry System Structure  . . . . . . . . . . 3\n4.  Internet Numbers Registry Technical Considerations  . . . . . . 5\n5.  Internet Numbers Registry Evolution . . . . . . . . . . . . . . 5\n6.  Summary of Changes since RFC 2050 . . . . . . . . . . . . . . . 6\n7.  Security Considerations . . . . . . . . . . . . . . . . . . . . 6\n8.  Acknowledgements  . . . . . . . . . . . . . . . . . . . . . . . 7\n9.  References  . . . . . . . . . . . . . . . . . . . . . . . . . . 7\n  9.1.  Normative References  . . . . . . . . . . . . . . . . . . . 7\n  9.2.  Informative References  . . . . . . . . . . . . . . . . . . 8",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "The administrative structures of the Internet Numbers Registry System described in this document are largely the result of the interaction of operational practices, existing routing technology, number resource assignments that have occurred over time, and network architectural history. Further discussion and analysis of these interactions are outside the scope of this document.",
      "ja": "このドキュメントで説明するインターネット番号のレジストリシステムの管理構造は、時間、およびネットワークアーキテクチャの歴史上で起こったルーティング技術、番号リソースの割り当てを既存の、主に業務慣行の相互作用の結果です。これらの相互作用のさらなる議論と分析は、この文書の範囲外です。"
    },
    {
      "indent": 3,
      "text": "This document provides information about the current Internet Numbers Registry System used in the distribution of globally unique Internet Protocol (IP) address space and autonomous system (AS) numbers. It also describes the processes used for further evolution of the Internet Numbers Registry System. This document does not propose any changes to the current operation of this system.",
      "ja": "この文書では、グローバルにユニークなインターネット・プロトコル（IP）アドレス空間と自律システム（AS）番号の配布に使用される現在のインターネット番号のレジストリシステムについての情報を提供します。また、インターネット番号のレジストリシステムのさらなる進化のために使用されるプロセスを説明します。この文書では、このシステムの現在の動作への変更を提案していません。"
    },
    {
      "indent": 3,
      "text": "This document replaces RFC 2050. Since the publication of RFC 2050, the Internet Numbers Registry System has changed significantly. This document describes the present Internet Numbers Registry System.",
      "ja": "この文書は、RFC 2050の出版以来RFC 2050を置き換える、インターネット番号のレジストリシステムが大幅に変更されました。この文書では、現在、インターネット番号のレジストリシステムについて説明します。"
    },
    {
      "indent": 0,
      "text": "2. Goals",
      "section_title": true,
      "ja": "2.目標"
    },
    {
      "indent": 3,
      "text": "Internet number resources are currently distributed according to the following (non-exclusive) goals:",
      "ja": "インターネット番号リソースは、現在、以下の（非排他的）目的に応じて配分されています。"
    },
    {
      "indent": 3,
      "text": "1) Allocation Pool Management: Due to the fixed lengths of IP addresses and AS numbers, the pools from which these resources are allocated are finite. As such, allocations must be made in accordance with the operational needs of those running the networks that make use of these number resources and by taking into consideration pool limitations at the time of allocation.",
      "ja": "1）割当てプール管理：原因IPアドレスの数字などの固定長に、これらのリソースが割り当てられるからプールが有限です。そのため、割り当てはこれらの数の資源を活用したネットワークを実行しているそれらの運用上のニーズに合わせてと割り当ての際に考慮プールの制限を考慮することによってなされなければなりません。"
    },
    {
      "indent": 3,
      "text": "2) Hierarchical Allocation: Given current routing technology, the distribution of IP addresses in a hierarchical manner increases the likelihood of continued scaling of the Internet's routing system. As such, it is currently a goal to allocate IP addresses in such a way that permits aggregation of these addresses into a minimum number of routing announcements. However, whether IP addresses are actually announced to the Internet and the manner of their advertisement into the Internet's routing system are operational considerations outside the scope of the Internet Numbers Registry System.",
      "ja": "2）階層割当：与えられた現在のルーティング技術、階層的にIPアドレスの配布は、インターネットのルーティングシステムの継続的な拡大縮小の可能性が高くなります。このように、現在のルーティングアナウンスメントの最小数にこれらのアドレスの集約を可能にするような方法でIPアドレスを割り当てるための目標です。しかし、IPアドレスは、実際のインターネットとインターネットのルーティングシステムへのそれらの広告のやり方に発表されているかどうか、インターネット番号のレジストリシステムの範囲外の運用の考慮事項があります。"
    },
    {
      "indent": 3,
      "text": "3) Registration Accuracy: A core requirement of the Internet Numbers Registry System is to maintain a registry of allocations to ensure uniqueness and to provide accurate registration information of those allocations in order to meet a variety of operational requirements. Uniqueness ensures that IP addresses and AS numbers are not allocated to more than one party at the same time.",
      "ja": "3）登録精度：インターネット番号のレジストリシステムのコア要件は、一意性を保証するために、運用要件の多様性を満たすために、それらの配分の正確な登録情報を提供するために、割り当てのレジストリを維持することです。一意性は、IPアドレスとAS番号は同時に複数のパーティに割り当てられていないことを保証します。"
    },
    {
      "indent": 3,
      "text": "These goals may sometimes conflict with each other or with the interests of individual end users, Internet service providers, or other number resource consumers. Careful analysis, judgment, and cooperation among registry system providers and consumers at all levels via community-developed policies are necessary to find appropriate compromises to facilitate Internet operations.",
      "ja": "これらの目標は、時には互いにまたは個々のエンドユーザー、インターネットサービスプロバイダ、または他の数のリソース消費者の利益と競合する可能性があります。慎重に分析、判断力、およびコミュニティ開発政策を経由してすべてのレベルでのレジストリシステムの提供者と消費者間の協力は、インターネットの操作を容易にするための適切な妥協点を見つけることが必要です。"
    },
    {
      "indent": 0,
      "text": "3. Internet Numbers Registry System Structure",
      "section_title": true,
      "ja": "3.インターネット番号レジストリのシステム構成"
    },
    {
      "indent": 3,
      "text": "The Internet Registry (IR) hierarchy was established to provide for the allocation of IP addresses and AS numbers with consideration to the above goals. This hierarchy is rooted in the Internet Assigned Numbers Authority (IANA) address allocation function, which serves a set of \"Regional Internet Registries\" (RIRs); the RIRs then serve a set of \"Local Internet Registries\" (LIRs) and other customers. LIRs in turn serve their respective number resource consumers (which may be themselves, their customers, \"sub-LIRs\", etc.)",
      "ja": "インターネットレジストリ（IR）の階層は、IPアドレスの割り当てのためにと、上記の目標を考慮したAS番号を提供するために設立されました。この階層は、「地域インターネットレジストリ」（のRIR）のセットを提供していIANA（Internet Assigned Numbers Authority）のアドレス割り当て機能に根ざしています。 RIRはその後、「ローカルインターネットレジストリ」（のLIR）と他の顧客のセットを提供しています。ターン中のLIRは（など自分自身、顧客、「サブのLIR」、であるかもしれない）、それぞれの数のリソース消費者にサービスを提供します"
    },
    {
      "indent": 3,
      "text": "IETF",
      "ja": "IETF"
    },
    {
      "indent": 6,
      "text": "The IETF specifies the underlying technical facilities and constraints of Internet numbers administered by the Internet Numbers Registry System. These specifications are aimed at enabling and protecting the long-term viability of the Internet, and adjustments to those specifications are made over time as circumstances warrant. The IETF has also reserved portions of the Internet number spaces and identifiers for future needs.",
      "ja": "IETFは、インターネット番号のレジストリシステムによって管理インターネット番号の基本的な技術設備と制約を指定します。これらの仕様は、インターネットの長期生存率を可能にし、保護することを目的としている、そしてそれらの仕様の調整は、状況に応じて時間をかけて作られています。 IETFはまた、将来のニーズのためのインターネットの番号空間の一部と識別子を予約しました。"
    },
    {
      "indent": 3,
      "text": "IANA",
      "ja": "IANA"
    },
    {
      "indent": 6,
      "text": "The Internet Assigned Numbers Authority (IANA) is a role, not an organization. For the Internet Numbers Registry System, the IANA role manages the top of the IP address and AS number allocation hierarchies. The Internet Corporation for Assigned Names and Numbers (ICANN) currently fulfills the IANA role in accordance with the IETF-ICANN \"Memorandum of Understanding Concerning Technical Work of the Internet Assigned Numbers Authority\", which was signed and ratified in March 2000 [RFC2860]. In addition, ICANN performs the IANA services related to the IP address space and AS numbers according to global number resource policies that have been developed by the community and formalized under a Memorandum of Understanding between ICANN and the Regional Internet Registries [ASOMOU] and documented in [ICANNv4], [ICANNv6], and [ICANNASN].",
      "ja": "IANA（Internet Assigned Numbers Authority）は役割ではなく、組織です。インターネット番号レジストリのシステムについては、IANAの役割は、IPアドレスの数と配分階層ASトップを管理します。割り当てられた名前と番号のためのインターネットコーポレーション（ICANN）は、現在、2000年3月に署名し、批准された、[RFC2860] IETF-ICANN「インターネット割り当て番号機関の技術的な仕事に関する覚書」に従い、IANAの役割を果たしています。また、ICANNは、コミュニティによって開発され、ICANNと地域インターネットレジストリの間の覚書の下で正式に[ASOMOU]とに記載されているグローバルな数のリソースポリシーに応じてIPアドレス空間に関連するIANAサービスを実行し、AS番号[ICANNv4]、[ICANNv6]、および[ICANNASN]。"
    },
    {
      "indent": 3,
      "text": "Regional IRs",
      "ja": "地域IR"
    },
    {
      "indent": 6,
      "text": "In order to promote distribution of the Internet number resource registration function, RFC 1366 proposed delegating responsibility to regional bodies. (Note: RFC 1366 was replaced by RFC 1466, which was replaced by RFC 2050.) These bodies became known as the Regional Internet Registries (RIRs). The RIRs operate in continent-sized geopolitical regions. Currently, there are five RIRs: AfriNIC serving Africa, APNIC serving parts of Asia and the Pacific region, ARIN serving North America and parts of the Caribbean, LACNIC serving Latin America and parts of the Caribbean, and RIPE NCC serving Europe, parts of Asia and the Middle East. The RIRs were established in a bottom-up fashion via a global policy process that has been documented as the ICANN \"Internet Consensus Policy 2\" [ICP-2], which details the principles and criteria for establishment of Regional Internet Registries. The RIRs also conduct regional number policy development used in the administration of the number resources for which they are responsible.",
      "ja": "インターネット番号リソース登録機能の分布を促進するために、RFC 1366は、地域団体への責任を委譲提案しました。 （注：RFC 1366は、RFC 2050に置き換えられましたRFC 1466に置き換えられた）これらの団体は、地域インターネットレジストリ（RIRが）として知られるようになりました。 RIRは大陸サイズの地政学的領域で動作します。現在、5つのRIRはありますAfriNICは、APNICは、ヨーロッパを提供し、北米、ラテンアメリカとカリブ海諸国の一部、およびRIPE NCCにサービスを提供カリブ海、LACNICの部品を提供し、アジア太平洋地域、ARINの部品を提供し、アジアの一部をアフリカにサービスを提供します中東。 RIRは地域インターネットレジストリの確立のための原則と基準の詳細をICANN「インターネットコンセンサスポリシー2」[ICP-2]として報告されているグローバルポリシープロセスを介してボトムアップ方式で確立されました。 RIRはまた、彼らが担当している数のリソースの管理に使用される地域の数ポリシーの開発を行っています。"
    },
    {
      "indent": 3,
      "text": "Local IRs",
      "ja": "ローカルIR"
    },
    {
      "indent": 6,
      "text": "Local Internet Registries (LIRs) are established through a relationship with the body from which they received their addresses, typically the RIR that serves the region in which they operate, a parent LIR, or other number-allocating entity. In cases where LIRs span multiple regions, those LIRs have established relationships with multiple RIRs. LIRs perform IP address allocation services for their customers, typically ISPs, end users, or child LIRs (also known as \"sub-LIRs\").",
      "ja": "ローカルインターネットレジストリ（のLIR）は、彼らのアドレス、典型的には、それらが動作する領域を提供していRIR、親LIR、または他の数割り当てエンティティを受け、そこから身体との関係を介して確立されます。 LIRは、複数の領域にまたがる場合には、これらのLIRは、複数のRIRとの関係を確立しています。 LIRは、通常のISP、エンドユーザー、または（また、「サブのLIR」として知られている）子のLIR、彼らの顧客のためにIPアドレス割り当てサービスを行います。"
    },
    {
      "indent": 0,
      "text": "4. Internet Numbers Registry Technical Considerations",
      "section_title": true,
      "ja": "4.インターネット番号レジストリ技術的考察"
    },
    {
      "indent": 3,
      "text": "As a result of the system of technical standards and guidelines established by the IETF as well as historical and operational constraints, there have been technical considerations regarding the services provided by the Internet Numbers Registry System as it evolved. These technical considerations have included:",
      "ja": "IETFで定める技術上の基準とガイドラインのシステムだけでなく、歴史的、運用制約の結果として、それが進化して、インターネット番号レジストリのシステムが提供するサービスに関する技術的な考慮事項がありました。これらの技術的な考慮事項が含まれています："
    },
    {
      "indent": 3,
      "text": "1) Reverse DNS: In situations where reverse DNS was used, the policies and practices of the Internet Numbers Registry System have included consideration of the technical and operational requirements posed by reverse DNS zone delegation [RFC5855].",
      "ja": "1）リバースDNS：DNS逆を使用した状況では、インターネット番号のレジストリシステムの方針や慣行が逆引きDNSゾーンの委任[RFC5855]によってもたらされる技術的および運用上の要件を考慮が含まれています。"
    },
    {
      "indent": 3,
      "text": "2) Public WHOIS: The policies and practices of the Internet Numbers Registry System have included consideration of the technical and operational requirements for supporting WHOIS services [RFC3013] [RFC3912].",
      "ja": "2）公共のWHOIS：インターネット番号のレジストリシステムの方針や慣行はWHOISサービスをサポートするための技術的および運用上の要件を考慮[RFC3013] [RFC3912]を含んでいます。"
    },
    {
      "indent": 3,
      "text": "As the Internet and the Internet Numbers Registry System continue to evolve, it may be necessary for the Internet community to examine these and related technical and operational considerations and how best to meet them. This evolution is discussed in the next section.",
      "ja": "インターネットとインターネット番号レジストリのシステムが進化し続けている、それはインターネットコミュニティは、これらと関連する技術と運用の配慮を検討するために必要があるかもしれないとどのように最高のそれらを満たすために。この進化は、次のセクションで説明されています。"
    },
    {
      "indent": 0,
      "text": "5. Internet Numbers Registry Evolution",
      "section_title": true,
      "ja": "5.インターネット番号レジストリの進化"
    },
    {
      "indent": 3,
      "text": "Over the years, the Internet Numbers Registry System has developed mechanisms by which the structures, policies, and processes of the Internet Numbers Registry System itself can evolve to meet the changing demands of the global Internet community. Further evolution of the Internet Numbers Registry System is expected to occur in an open, transparent, and broad multi-stakeholder manner.",
      "ja": "長年にわたり、インターネット番号のレジストリシステムは、構造、ポリシー、およびインターネット番号レジストリシステム自体のプロセスがグローバルなインターネットコミュニティの変化するニーズを満たすために進化させることが可能な仕組みを開発しました。インターネット番号レジストリシステムのさらなる進化は、オープン透明性、および幅広いマルチステークホルダー的に発生することが予想されます。"
    },
    {
      "indent": 3,
      "text": "Per the delineation of responsibility for Internet address policy issues specified in the IETF/IAB/ICANN MOU [RFC2860], discussions regarding the evolution of the Internet Numbers Registry System structure, policy, and processes are to take place within the ICANN framework and will respect ICANN's core values [ICANNBL]. These core",
      "ja": "IETF / IAB / ICANN MOU [RFC2860]で指定されたインターネットアドレス政策課題に対する責任の描写あたり、インターネット番号のレジストリシステム構成、ポリシー、およびプロセスの進化に関する議論がICANNの枠組みの中で場所を取るためにあり、尊重しますICANNのコアバリュー[ICANNBL]。これらのコア"
    },
    {
      "indent": 3,
      "text": "values encourage broad, informed participation reflecting the functional, geographic, and cultural diversity of the Internet at all levels of policy development and decision making, as well as the delegation of coordination functions and recognition of the policy roles of other responsible entities that reflect the interests of affected parties. The discussions regarding Internet Numbers Registry evolution must also continue to consider the overall Internet address architecture and technical goals referenced in this document.",
      "ja": "値が幅広い、通知ポリシーの策定と意思決定のすべてのレベルでのインターネットの、機能的、地理的、文化的多様性を反映しての参加だけでなく、調整機能や興味を反映し、他の責任のエンティティの政策の役割の認識の委任を奨励します影響を受けた当事者の。インターネット番号レジストリ進化に関する議論は、全体的なインターネットアドレスアーキテクチャと、このドキュメントで参照技術的な目標を考慮し続けなければなりません。"
    },
    {
      "indent": 3,
      "text": "The foregoing does not alter the IETF's continued responsibility for the non-policy aspects of Internet addressing such as the architectural definition of IP address and AS number spaces and specification of associated technical goals and constraints in their application, assignment of specialized address blocks, and experimental technical assignments as documented in RFC 2860. In addition, in the cases where the IETF sets technical recommendations for protocols, practices, or services that are directly related to IP address space or AS numbers, such recommendations must be taken into consideration in Internet Numbers Registry System policy discussions regardless of venue.",
      "ja": "上記は、IPアドレスの建築定義などを扱うインターネットの非政策の側面のためと数のスペースとその応用における関連する技術的な目標と制約の仕様、専門のアドレスブロックの割り当て、および実験AS IETFの継続的な責任は変更されません。また、RFC 2860に記載されているように技術的な割り当ては、IETFがプロトコル、慣行、またはIPアドレス空間へまたは数字として直接関連しているサービスのための技術的な提言を設定例では、このような勧告は、インターネット番号のレジストリに考慮されなければなりませんかかわらず、会場のシステム政策議論。"
    },
    {
      "indent": 1,
      "text": "6. Summary of Changes since",
      "section_title": true,
      "ja": "変更の概要6.以来、"
    },
    {
      "indent": 3,
      "text": "Since RFC 2050 was published, the Internet and the Internet Numbers Registry System have undergone significant change. This document describes the Internet Numbers Registry System as it presently exists and omits policy and operational procedures that have been superseded by ICANN and RIR policy since the publication of RFC 2050.",
      "ja": "RFC 2050が公開されたので、インターネットおよびインターネット番号レジストリのシステムは大きな変化を遂げてきました。それが現在存在し、政策やRFC 2050の出版以来、ICANNとRIRのポリシーに取って代わられている操作手順を省略すると、この文書は、インターネット番号のレジストリシステムについて説明します。"
    },
    {
      "indent": 3,
      "text": "One particular change of note is that RFC 2050 defined an appeal process and included:",
      "ja": "ノートの一つの特定の変更は、RFC 2050は控訴プロセスを定義し、含まれていることです。"
    },
    {
      "indent": 6,
      "text": "If necessary, after exhausting all other avenues, the appeal may be forwarded to IANA for a final decision. Each registry must, as part of their policy, document and specify how to appeal a registry assignment decision.",
      "ja": "必要であれば、他のすべての道を排出した後、控訴は、最終的な意思決定のためにIANAに転送することができます。各レジストリは、その政策の一環として、文書化し、レジストリの割り当て決定をアピールする方法を指定する必要があります。"
    },
    {
      "indent": 3,
      "text": "The RIRs have developed consensus-based policies for appeals, and over time, they have become accepted by the respective RIR communities. As a result, the ability to further appeal to IANA is no longer appropriate.",
      "ja": "RIRは控訴のためのコンセンサスベースのポリシーを開発している、と時間をかけて、彼らはそれぞれのRIRのコミュニティによって受け入れられるようになりました。その結果、さらにIANAにアピールする能力はもはや適切ではありません。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "ja": "7.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "It is generally recognized that accuracy and public availability of Internet registry data is often an essential component in researching and resolving security and operational issues on the Internet.",
      "ja": "一般的に精度とインターネットレジストリデータの公開可用性は、多くの場合、インターネット上のセキュリティや運用上の問題を調査し、解決に不可欠な要素であることが認識されています。"
    },
    {
      "indent": 0,
      "text": "8. Acknowledgements",
      "section_title": true,
      "ja": "8.謝辞"
    },
    {
      "indent": 3,
      "text": "Several people have made comments on draft versions of this document. The authors would like to thank Randy Bush, Brian Carpenter, Daniel Karrenberg, Olaf Kolkman, Scott Bradner, Leslie Daigle, Adiel Akplogan, Mark Kosters, Elise Gerich, and SM for their constructive feedback and comments. Additionally, we are indebted to the authors of RFC 1466 and RFC 2050 for their earlier contributions in this area.",
      "ja": "いくつかの人々は、この文書の草案についてのコメントをしました。著者は、彼らの建設的なフィードバックやコメントのためにランディブッシュ、ブライアン・カーペンター、ダニエルKarrenberg、オラフKolkman、スコット・ブラッドナー、レスリーDaigle氏、Adiel Akplogan、マーク・Kosters、エリーゼGerich、およびSMに感謝したいと思います。さらに、我々はこの分野での以前の貢献のためのRFC 1466およびRFC 2050の作者にお世話になっています。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "ja": "9.参考文献"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "ja": "9.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[ASOMOU] Published by ICANN, \"ICANN Address Supporting Organization (ASO) MoU\", October 2004, <http://archive.icann.org/en/aso/aso-mou-29oct04.htm>.",
      "ja": "[ASOMOU] ICANNによって公開された、 \"組織（ASO）覚書を支えるICANNアドレス\"、2004年10月、<http://archive.icann.org/en/aso/aso-mou-29oct04.htm>。"
    },
    {
      "indent": 3,
      "text": "[ICANNASN] Ratified by ICANN, \"Internet Assigned Numbers Authority (IANA) Policy for Allocation of ASN Blocks to Regional Internet Registries\", September 2010, <http://www.icann.org/en/resources/policy/global-addressing/global-policy-asn-blocks-21sep10-en.htm>.",
      "ja": "[ICANNASN] ICANNが批准し、 \"IANA（Internet Assigned Numbers Authority）の地域インターネットレジストリへのASNブロックの割り当てのための政策\"、2010年9月、<http://www.icann.org/en/resources/policy/global-addressing /global-policy-asn-blocks-21sep10-en.htm>。"
    },
    {
      "indent": 3,
      "text": "[ICANNBL] ICANN, \"Bylaws for Internet Corporation for Assigned Names and Numbers\", December 2012, <http://www.icann.org/en/about/governance/bylaws>.",
      "ja": "[ICANNBL] ICANN、 \"割り当てられた名前と番号のためのインターネット・コーポレーションのための細則\"、2012年12月、<http://www.icann.org/en/about/governance/bylaws>。"
    },
    {
      "indent": 3,
      "text": "[ICANNv4] Ratified by ICANN, \"Global Policy for Post Exhaustion IPv4 Allocation Mechanisms by the IANA\", May 2012, <http://www.icann.org/en/resources/policy/ global-addressing/allocation-ipv4-post-exhaustion>.",
      "ja": "[ICANNv4] ICANNが批准し、2012年5月、 \"IANAによってポスト枯渇IPv4の割り当てメカニズムのためのグローバルポリシー\"、<http://www.icann.org/en/resources/policy/グローバルアドレッシング/割り当て-IPv4のポスト-exhaustion>。"
    },
    {
      "indent": 3,
      "text": "[ICANNv6] Ratified by ICANN, \"Internet Assigned Numbers Authority (IANA) Policy For Allocation of IPv6 Blocks to Regional Internet Registries\", September 2006, <http://www.icann.org/en/resources/policy/ global-addressing/allocation-ipv6-rirs>.",
      "ja": "[ICANNv6] ICANN、 \"地域インターネットレジストリへのIPv6ブロックの割り当てについてはIANA（Internet Assigned Numbers Authority）の方針\"、2006年9月、<http://www.icann.org/en/resources/policy/グローバル・アドレッシングによって批准/割り当て-のipv6-のRIR>。"
    },
    {
      "indent": 3,
      "text": "[ICP-2] ICANN, \"ICP-2: Criteria for Establishment of New Regional Internet Registries\", July 2001, <http://www.icann.org/icp/icp-2.htm>.",
      "ja": "[ICP-2] ICANN、 \"ICP-2：新しい地域インターネットレジストリの設立のための基準\"、2001年7月、<http://www.icann.org/icp/icp-2.htm>。"
    },
    {
      "indent": 3,
      "text": "[RFC2860] Carpenter, B., Baker, F., and M. Roberts, \"Memorandum of Understanding Concerning the Technical Work of the Internet Assigned Numbers Authority\", RFC 2860, June 2000.",
      "ja": "[RFC2860]大工、B.、ベイカー、F.、およびM.ロバーツ、RFC 2860、2000年6月「インターネット割り当て番号機関の技術的な仕事に関する覚書」。"
    },
    {
      "indent": 3,
      "text": "[RFC3013] Killalea, T., \"Recommended Internet Service Provider Security Services and Procedures\", BCP 46, RFC 3013, November 2000.",
      "ja": "[RFC3013] Killalea、T.、 \"推奨インターネットサービスプロバイダのセキュリティサービスと手続き\"、BCP 46、RFC 3013、2000年11月。"
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "ja": "9.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC3912] Daigle, L., \"WHOIS Protocol Specification\", RFC 3912, September 2004.",
      "ja": "[RFC3912] Daigle氏、L.、 \"WHOISプロトコル仕様\"、RFC 3912、2004年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC5855] Abley, J. and T. Manderson, \"Nameservers for IPv4 and IPv6 Reverse Zones\", BCP 155, RFC 5855, May 2010.",
      "ja": "[RFC5855] Abley、J.及びT. Manderson、 \"IPv4およびIPv6リバースゾーンのネームサーバ\"、BCP 155、RFC 5855、2010年5月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Russ Housley Vigil Security, LLC 918 Spring Knoll Drive Herndon, VA 20170 USA",
      "ja": "ラスHousleyビジルセキュリティ、LLC 918春小山Driveハーンドン、VA 20170 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 703 435 1775 EMail: housley@vigilsec.com",
      "ja": "電話：+1 703 435 1775 Eメール：housley@vigilsec.com"
    },
    {
      "indent": 3,
      "text": "John Curran American Registry for Internet Numbers (ARIN) 3635 Concorde Parkway Chantilly, VA 20151-1125 USA",
      "ja": "インターネット番号のためのジョン・カランアメリカのレジストリ（ARIN）3635コンコルドパークウェイチャンティリー、VA 20151から1125 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 703 227 9845 EMail: jcurran@arin.net",
      "ja": "電話：+1 703 227 9845 Eメール：jcurran@arin.net"
    },
    {
      "indent": 3,
      "text": "Geoff Huston Asia Pacific Network Information Centre (APNIC) 6 Cordelia St South Brisbane, QLD 4101 Australia",
      "ja": "ジェフ・ヒューストンアジア太平洋ネットワークインフォメーションセンター（APNIC）6コーデリアセントサウスブリスベン、QLD 4101オーストラリア"
    },
    {
      "indent": 3,
      "text": "Phone: +61 7 3858 3100 EMail: gih@apnic.net",
      "ja": "電話：+61 7 3858 3100 Eメール：gih@apnic.net"
    },
    {
      "indent": 3,
      "text": "David Conrad Virtualized, LLC 2310 Homestead Road, C1#204 Los Altos, CA 94024 USA",
      "ja": "デヴィッド・コンラッド仮想化、LLC 2310ホームステッド道路、C1第204位ロスアルトス、CA 94024 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 650 397 6102 EMail: drc@virtualized.org",
      "ja": "電話：+1 650 397 6102 Eメール：drc@virtualized.org"
    }
  ]
}