{
  "title": {
    "text": "RFC 7060 - Using LDP Multipoint Extensions on Targeted LDP Sessions",
    "ja": "RFC 7060 - ターゲットLDPセッションにLDPマルチ拡張機能を使用します"
  },
  "number": 7060,
  "created_at": "2019-10-28 06:20:20.521170+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                      M. Napierala\nRequest for Comments: 7060                                          AT&T\nCategory: Standards Track                                       E. Rosen\nISSN: 2070-1721                                             IJ. Wijnands\n                                                     Cisco Systems, Inc.\n                                                           November 2013",
      "raw": true
    },
    {
      "indent": 8,
      "text": "Using LDP Multipoint Extensions on Targeted LDP Sessions",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "Label Distribution Protocol (LDP) can be used to set up Point-to-Multipoint (P2MP) and Multipoint-to-Multipoint (MP2MP) Label Switched Paths. However, the specification for the Multipoint Extensions to LDP presupposes that the two endpoints of an LDP session are directly connected. The LDP base specification allows for the case where the two endpoints of an LDP session are not directly connected; such a session is known as a \"Targeted LDP\" session. This document provides the specification for using the LDP Multipoint Extensions over a Targeted LDP session.",
      "ja": "ラベル配布プロトコル（LDP）は、ポイント・ツー・マルチポイント（P2MP）を設定するために使用することができ、多対多（MP2MP）ラベルは、パスの交換しました。しかし、自民党へのマルチポイント機能拡張のための仕様では、LDPセッションの2つのエンドポイントが直接接続されていることを前提としています。 LDPベースの仕様では、LDPセッションの2つのエンドポイントが直接接続されていない場合を可能にします。そのようなセッションは「ターゲットLDP」セッションとして知られています。この文書では、ターゲットLDPセッションでLDPマルチ拡張機能を使用するための仕様を提供します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7060.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7060で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2013 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2013 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Targeted mLDP and the Upstream LSR ..............................3\n   2.1. Selecting the Upstream LSR .................................3\n   2.2. Sending Data from U to D ...................................4\n3. Applicability of Targeted mLDP ..................................4\n4. LDP Capabilities ................................................5\n5. Targeted mLDP with Unicast Replication ..........................5\n6. Targeted mLDP with Multicast Tunneling ..........................6\n7. Security Considerations .........................................8\n8. Acknowledgments .................................................8\n9. Normative References ............................................8",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "Label Distribution Protocol (LDP) extensions for setting up Point-to-Multipoint (P2MP) Label Switched Paths (LSPs) and Multipoint-to-Multipoint (MP2MP) LSPs are specified in [mLDP]. This set of extensions is generally known as \"Multipoint LDP\" (mLDP).",
      "ja": "ラベル配布プロトコル（LDP）ポイントツーマルチポイント（P2MP）ラベル（LSPを）パスを交換し、多対多（MP2MP）のLSPは、[MLDP]で指定されている設定用の拡張機能。拡張子のこのセットは、一般に「マルチLDP」（MLDP）として知られています。"
    },
    {
      "indent": 3,
      "text": "A pair of Label Switched Routers (LSRs) that are the endpoints of an LDP session are considered to be \"LDP peers\". When a pair of LDP peers are \"directly connected\" (e.g., they are connected by a layer 2 medium or are otherwise considered to be neighbors by the network's interior routing protocol), the LDP session is said to be a \"directly connected\" LDP session. When the pair of LDP peers are not directly connected, the session between them is said to be a \"Targeted\" LDP session.",
      "ja": "ラベルのペアは、LDPセッションのエンドポイントは、「LDPピアを」と見なされているルータ（LSRの）を交換しました。 LDPピアのペアが「直接接続」されている場合（例えば、それらはレイヤ2の媒体によって接続されているか、そうでなければネットワークの内部ルーティングプロトコルによって隣人であると考えられる）、LDPセッションは、「直接接続」LDPであると言われていますセッション。 LDPピアのペアが直接接続されていない場合は、それらの間のセッションは、「ターゲット」LDPセッションと言われています。"
    },
    {
      "indent": 3,
      "text": "The base specification for mLDP does not explicitly cover the case where the LDP multipoint extensions are used over a Targeted LDP session. This document provides that specification.",
      "ja": "MLDPのための基本仕様は、明示的に自民党のマルチポイント機能拡張は、ターゲットLDPセッションで使用されている場合をカバーしていません。この文書では、その仕様を提供します。"
    },
    {
      "indent": 3,
      "text": "We will use the term \"Multipoint\" to mean \"either P2MP or MP2MP\".",
      "ja": "私たちは、「どちらかP2MPまたはMP2MP」を意味する用語「マルチポイント」を使用します。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. Targeted mLDP and the Upstream LSR",
      "section_title": true,
      "ja": "2.対象MLDPと上流LSR"
    },
    {
      "indent": 0,
      "text": "2.1. Selecting the Upstream LSR",
      "section_title": true,
      "ja": "2.1。上流LSRの選択"
    },
    {
      "indent": 3,
      "text": "In mLDP, a multipoint LSP (MP-LSP) has a unique identifier that is an ordered pair of the form <root, opaque value>. The first element of the ordered pair is the IP address of the MP-LSP's \"root node\". The second element of the ordered pair is an identifier that is unique in the context of the root node.",
      "ja": "MLDPにおいて、マルチLSP（MP-LSP）がフォーム<根、不透明な値>の順序対である一意の識別子を有しています。順序対の最初の要素は、MP-LSPの「ルートノード」のIPアドレスです。順序付けられた対の第2の要素はルートノードのコンテキストにおいて一意である識別子です。"
    },
    {
      "indent": 3,
      "text": "If LSR D is setting up the MP-LSP <R, X>, D must determine the \"upstream LSR\" for <R, X>. In [mLDP], the upstream LSR for <R, X>, U, is defined to be the \"next hop\" on D's path to R, and \"next hop\" is tacitly assumed to mean \"IGP next hop\". It is thus assumed that there is a direct LDP session between D and U. In this specification, we extend the notion of \"upstream LSR\" to cover the following cases:",
      "ja": "LSR DはMP-LSP <R、X>を設定されている場合、Dは<R、X>のための \"上流LSR\" を決定しなければなりません。 【MLDP]において、<R、X>、U、アップストリームLSRが暗黙「IGPネクストホップ」を意味するものとするRにDのパス上の「次のホップ」、および「ネクストホップ」であると定義されます。このように、本明細書ではDとUの間の直接的なLDPセッションが存在すると仮定される、我々は、以下の場合をカバーするために、「上流LSR」の概念を拡張します。"
    },
    {
      "indent": 6,
      "text": "- U is the \"BGP next hop\" on D's path to R, where U and D are not necessarily IGP neighbors, and where there is a Targeted LDP session between U and D. In this case, we allow D to select U as the \"upstream LSR\" for <R,X>.",
      "ja": " -  Uは、UとDは必ずしもIGP近隣ではなく、この場合、UとDとの間のターゲットLDPセッションがある場合、我々はDのようにUを選択することを可能にするR、にDのパスの「BGPネクストホップ」であります<R、X>のための \"上流LSR\"。"
    },
    {
      "indent": 6,
      "text": "- If the \"next-hop interface\" on D's path to R is an RSVP Traffic Engineering (RSVP-TE) P2P tunnel whose remote endpoint is U, and if there is known to be an RSVP-TE P2P tunnel from U to D, and if there is a Targeted LDP session between U and D, then we allow D to select U as the \"upstream LSR\" for <R,X>. This is useful when D and U are part of a network area that is fully meshed via RSVP-TE P2P tunnels.",
      "ja": " -  RにDのパスの「ネクストホップインタフェース」は、そのリモートエンドポイントUであるRSVPトラフィックエンジニアリング（RSVP-TE）P2Pトンネルの場合、及びDのUからRSVP-TE P2Pトンネルであることが知られている場合、 UとDとの間のターゲットLDPセッションが存在する場合、我々は、Dは<R、X>のための「上流LSR」としてUを選択することを可能にします。 D及びUが完全にRSVP-TE P2Pトンネルを介して噛合されたネットワーク領域の一部である場合に有用です。"
    },
    {
      "indent": 3,
      "text": "The particular method used to select an \"upstream LSR\" is determined by the Service Provider (SP) and must be made known a priori (i.e., by provisioning) to all the LSRs involved.",
      "ja": "「上流LSR」を選択するために使用される特定の方法は、サービスプロバイダ（SP）によって決定され、関係するすべてのLSRに（すなわち、プロビジョニングによって）、先験的に知らせなければなりません。"
    },
    {
      "indent": 3,
      "text": "Other methods than the two specified above MAY be used; however, the specification of other methods is outside the scope of this document.",
      "ja": "上記指定された2つ以上の他の方法を使用することができます。しかし、他の方法の仕様は、この文書の範囲外です。"
    },
    {
      "indent": 0,
      "text": "2.2. Sending Data from U to D",
      "section_title": true,
      "ja": "2.2。 UからDへのデータ送信"
    },
    {
      "indent": 3,
      "text": "By using Targeted mLDP, we can construct an MP-LSP <R,X> containing an LSR U, where U has one or more downstream LSR neighbors (D1, ..., Dn) to which it is not directly connected. In order for a data packet to travel along this MP-LSP, U must have some way of transmitting the packet to D1, ..., Dn. We will cover two methods of transmission:",
      "ja": "ターゲットMLDPを用いることにより、我々は、Uは、それが直接接続されていないために、1つのまたは複数のダウンストリームLSRネイバー（D1、...、DN）を有するLSR Uを含むMP-LSP <R、X>を構築することができます。このMP-LSPに沿って移動するデータパケットのためには、Uは、D1、...、DNにパケットを送信するいくつかの方法を持っている必要があります。私たちは、トランスミッションの2つのメソッドをカバーします。"
    },
    {
      "indent": 6,
      "text": "- Unicast Replication",
      "ja": " - ユニキャストレプリケーション"
    },
    {
      "indent": 9,
      "text": "In this method, U creates n copies of the packet and unicasts each copy to exactly one of D1, ..., Dn.",
      "ja": "この方法では、Uは、パケットのn個のコピーを作成し、D1の正確に一つに各コピーをユニキャスト...、DNが。"
    },
    {
      "indent": 6,
      "text": "- Multicast Tunneling",
      "ja": " - マルチキャストトンネリング"
    },
    {
      "indent": 9,
      "text": "In this method, U becomes the root node of a multicast tunnel, with D1, ..., Dn as leaf nodes. When a packet traveling along the MP-LSP <R,X> arrives at U, U transmits it through the multicast tunnel, and as a result it arrives at D1, ..., Dn.",
      "ja": "この方法では、Uは、リーフ・ノードとしてD1、...、DNに、マルチキャストトンネルのルートノードとなります。 MP-LSP <R、X>に沿って移動するパケットがUに到達したとき、Uは、マルチキャストトンネルを介して送信し、その結果として、それはD1、...、Dnとに到達します。"
    },
    {
      "indent": 9,
      "text": "When this method is used, it may be desirable to carry traffic of multiple MP-LSPs through a single multicast tunnel. We specify procedures that allow for the proper demultiplexing of the MP-LSPs at the leaf nodes of the multicast tunnel. We do not assume that all the leaf nodes of the tunnel are on all the MP-LSPs traveling through the tunnel; thus, some of the tunnel leaf nodes may need to discard some of the packets received through the tunnel. For example, suppose MP-LSP <R1,X1> contains node U with downstream LSRs D1 and D2, while MP-LSP <R2,X2> contains node U with downstream LSRs D2 and D3. Suppose also that there is a multicast tunnel with U as root and with D1, D2, and D3 as leaf nodes. U can aggregate both MP-LSPs in this one tunnel. However, D1 will have to discard packets that are traveling on <R2,X1>, while D3 will have to discard packets that are traveling on <R1,X2>.",
      "ja": "この方法を用いる場合には、単一のマルチキャストトンネルを介して複数のMP-LSPのトラフィックを伝送することが望ましい場合があります。我々は、マルチキャストトンネルのリーフノードにおけるMP-LSPの適切な分離を可能にする手順を指定します。私たちは、トンネルのすべてのリーフノードがトンネルを通過するすべてのMP-のLSP上にあることを想定していません。従って、トンネルリーフノードの一部は、トンネルを介して受信したパケットの一部を廃棄する必要があるかもしれません。 MP-LSPながら、例えば、MP-LSP <R1、X1>下流のLSR D1とD2とノードUが含まれていると仮定し、<R2、X2>下流のLSR D2とD3とノードUを含んでいます。リーフノードとして根等のD1、D2、及びD3とUとのマルチキャストトンネルがあることも仮定する。 Uは、この1つのトンネルの両方MP-LSPを集約することができます。 D3は<R1、X2>を走行しているパケットを廃棄しなければならないしながらしかし、D1は、<R2、X1>を走行しているパケットを廃棄しなければなりません。"
    },
    {
      "indent": 0,
      "text": "3. Applicability of Targeted mLDP",
      "section_title": true,
      "ja": "ターゲティングさMLDPの3の適用"
    },
    {
      "indent": 3,
      "text": "When LSR D is setting up MP-LSP <R,X>, it MUST NOT use Targeted mLDP unless D implements a procedure that can select an LSR U that is a Targeted mLDP peer of D as the \"upstream LSR\" for <R,X>. See Section 2.1.",
      "ja": "LSR DはMP-LSP <R、X>を設定したときDは<Rに対する「上流LSR」としてDの標的MLDPピアであるLSR Uを選択することができる手順を実装していない限り、それは、ターゲットMLDPを使用してはいけませんX>。 2.1節を参照してください。"
    },
    {
      "indent": 3,
      "text": "Whether D uses Targeted mLDP when this condition holds is determined by provisioning or by other methods that are outside the scope of this specification.",
      "ja": "この条件が成立した場合、DはMLDPを標的使用するかどうかは、プロビジョニングによって、または本明細書の範囲外である他の方法によって決定されます。"
    },
    {
      "indent": 3,
      "text": "When Targeted mLDP is used, the choice between unicast replication and multicast tunneling is determined by provisioning or by other methods that are outside the scope of this specification. It is presupposed that all nodes will have a priori knowledge of whether to use unicast replication or to use multicast tunneling. If the latter, it is presupposed that all nodes will have a priori knowledge of the type of multicast tunneling to use.",
      "ja": "標的MLDPを使用する場合、ユニキャスト複製およびマルチキャストトンネルの間の選択は、プロビジョニングによって、または本明細書の範囲外である他の方法によって決定されます。すべてのノードがユニキャスト複製を使用するかどうかの事前知識を持っていますかマルチキャストトンネリングを使用することを前提としています。後者の場合、全てのノードが使用するマルチキャストトンネルのタイプの先験的な知識を有するであろうことが想定されます。"
    },
    {
      "indent": 0,
      "text": "4. LDP Capabilities",
      "section_title": true,
      "ja": "4. LDP機能"
    },
    {
      "indent": 3,
      "text": "Per [mLDP], any LSR that needs to set up an MP-LSP must support the procedures of [LDP-CAP], and in particular must send and receive the P2MP Capability and/or the MP2MP Capability. This specification does not define any new capabilities; the advertisement of the P2MP and/or MP2MP Capabilities on a Targeted LDP session means that the advertising LSR is capable of following the procedures set forth in this document.",
      "ja": "MP-LSPは、[LDP-CAP]の手順をサポートする必要があり、特にP2MP能力及び/又はMP2MP能力を送受信しなければならない設定する必要がある任意のLSR、[MLDP]あたり。この仕様は、新しい機能を定義しません。ターゲットLDPセッションのP2MPおよび/またはMP2MP能力の広告は、広告LSRは、この文書に記載された手順を、以下のことが可能であることを意味しています。"
    },
    {
      "indent": 3,
      "text": "Some of the procedures described in this document require the use of upstream-assigned labels [LDP-UP]. In order to use upstream-assigned labels as part of Targeted mLDP, an LSR must advertise the LDP Upstream-Assigned Label Capability [LDP-UP] on the Targeted LDP session.",
      "ja": "この文書に記載された手順の一部は、上流割り当てられたラベル[LDP-UP]の使用を必要とします。標的MLDPの一部として上流割り当てられたラベルを使用するために、LSRは、LDP上流割り当てられたラベル能力ターゲットLDPセッションの[LDP-UP]を宣伝しなければなりません。"
    },
    {
      "indent": 0,
      "text": "5. Targeted mLDP with Unicast Replication",
      "section_title": true,
      "ja": "ユニキャスト複製5.ターゲットMLDP"
    },
    {
      "indent": 3,
      "text": "When unicast replication is used, the mLDP procedures are exactly the same as described in [mLDP], with the following exception. If LSR D is setting up MP-LSP <R,X>, its \"upstream LSR\" is selected according to the procedures of Section 2.1, and is not necessarily the \"IGP next hop\" on D's path to R.",
      "ja": "ユニキャスト複製を使用する場合、以下の例外を除いて、[MLDP]に記載されているように、MLDP手順は全く同じです。 LSR DはMP-LSP <R、X>の設定されている場合は、その「上流LSR」は、セクション2.1の手順に従って選択され、必ずしもRにDのパスの「IGPネクストホップ」ではありません"
    },
    {
      "indent": 3,
      "text": "Suppose that LSRs D1 and D2 are both setting up the P2MP MP-LSP <R,X>, and that LSR U is the upstream LSR on each of their paths to R. D1 and D2 each binds a label to <R,X> and each uses a Label Mapping message to inform U of the label binding. Suppose D1 has assigned label L1 to <R,X> and D2 has assigned label L2 to <R,X>. (Note that L1 and L2 could have the same value or different values; D1 and D2 do not coordinate their label assignments.) When U has a packet to transmit on the MP-LSP <R,X>, it makes a copy of the packet, pushes on label L1, and unicasts the resulting packet to D1. It also makes a second copy of the packet, pushes on label L2, and then unicasts the resulting packet to D2.",
      "ja": "LSRのD1とD2の両方P2MP MP-LSP <R、X>を設定していると仮定し、LSR UはR. D1及びD2へのパスのそれぞれに上流のLSRであることをそれぞれが<R、X>にラベルを結合しますそれぞれが結合ラベルのUに通知するラベルマッピングメッセージを使用しています。 D1は<R、X>から<R、X>及びD2が割り当てられたラベルL2にラベルL1を割り当てたと仮定する。 （L1およびL2が同じ値または異なる値を有することができることに注意してください。D1及びD2は、それらのラベルの割り当てを調整していない）Uが、MP-LSP <R、X>に送信するパケットを有する場合、それはのコピーを作成しますパケットは、ラベルL1にプッシュし、そしてD1に結果のパケットをユニキャストします。また、パケットの2番目のコピーを作るラベルL2にプッシュし、その後、D2への結果のパケットをユニキャストします。"
    },
    {
      "indent": 3,
      "text": "This procedure also works when the MP-LSP <R,X> is an MP2MP LSP. Suppose that in addition to labels L1 and L2 described above, U has assigned label L3 for <R,X> traffic received from D1 and label L4 for <R,X> traffic received from D2. When U processes a packet with label",
      "ja": "MP-LSP <R、Xは> MP2MP LSPである場合、この手順は、動作します。標識L1及びL2に加えて<R、X>トラフィックがD2から受信<R、X>トラフィックのためD1とラベルL4から受信するためのUラベルL3を割り当てられた、上記と仮定する。 Uは、ラベル付きパケットを処理するとき"
    },
    {
      "indent": 3,
      "text": "L3 at the top of its label stack, it knows the packet is from D1, so U sends a unicast copy of the packet to D2, after swapping L3 for L2. U does not send a copy back to D1.",
      "ja": "L3は、そのラベルスタックの最上部に、そのパケットがD1からであることを知っているので、Uは、L2のためにL3を交換した後、D2にパケットのユニキャストコピーを送信します。 Uは、D1に戻ってコピーを送信しません。"
    },
    {
      "indent": 3,
      "text": "Note that all labels used in this procedure are downstream-assigned labels.",
      "ja": "この手順で使用するすべてのラベルが下流割り当てられたラベルであることに注意してください。"
    },
    {
      "indent": 3,
      "text": "The method of unicast is a local matter, outside the scope of this specification. The only requirement is that D1 will receive the copy of the packet carrying label L1 and that D1 will process the packet by looking up label L1. (And similarly, D2 must receive the copy of the packet carrying label L2 and must process the packet by looking up label L2.)",
      "ja": "ユニキャストの方法は、本明細書の範囲外で、ローカルの問題です。唯一の要件は、D1は、ラベルL1を運ぶパケットのコピーを受信し、D1は、ラベルL1を調べることにより、パケットを処理することになるということです。 （同様に、D2は、ラベルL2を運ぶパケットのコピーを受信しなければならないし、ラベルL2を検索してパケットを処理する必要があります。）"
    },
    {
      "indent": 3,
      "text": "Note that if the method of unicast is MPLS, U will need to push another label on each copy of the packet before transmitting it. This label needs to ensure that delivery of the packet to the appropriate LSR, D1 or D2. Use of penultimate-hop popping for that label is perfectly legitimate.",
      "ja": "ユニキャストの方法がMPLSであれば、Uはそれを送信する前にパケットの各コピーに別のラベルをプッシュする必要があることに注意してください。このラベルは、適切なLSR、D1またはD2へのパケットの配信を保証する必要があります。そのラベルに飛び出る最後から二番目のホップの使用は完全に正当なものです。"
    },
    {
      "indent": 0,
      "text": "6. Targeted mLDP with Multicast Tunneling",
      "section_title": true,
      "ja": "マルチキャストトンネリング6.ターゲットMLDP"
    },
    {
      "indent": 3,
      "text": "Suppose that LSRs D1 and D2 are both setting up MP-LSP <R,X> and that LSR U is the upstream LSR on each of their paths to R. Since multicast tunneling is being used, when U has a packet to send on this MP-LSP, it does not necessarily send two copies, one to D1 and one to D2. It may send only one copy of the packet, which will get replicated somewhere downstream in the multicast tunnel. Therefore, the label that gets bound to the MP-LSP must be an upstream-assigned label assigned by U. This requires a change from the procedures of [mLDP]. D1 and D2 do not send Label Mapping messages to U; instead, they send Label Request messages to U, following the procedures of Section 4 of [LDP-UP], asking U to assign a label to the MP-LSP <R,X>. U responds with a Label Mapping message containing an upstream-assigned label L (using the procedures specified in [LDP-UP]). As part of the same Label Mapping message, U also sends an Interface TLV (as specified in [LDP-UP]) identifying the multicast tunnel in which data on the MP-LSP will be carried. When U transmits a packet on this tunnel, it first pushes on the upstream-assigned label L and then pushes on the label that corresponds to the multicast tunnel.",
      "ja": "LSRのD1およびD2の両方がMP-LSP <R、X>の設定およびUはこれに送信するパケットを有する場合、マルチキャストトンネリングが使用されているので、LSR UはR.へのパスのそれぞれに上流のLSRであるとされていると仮定するMP-LSP、それは必ずしも二つのコピー、D1に1とD2に1を送信しません。これは、マルチキャストトンネルのどこかに下流複製されますパケットのコピーを1つだけ送信してもよいです。したがって、MP-LSPに結合されますラベルは、これは[MLDP]の手順から変更を必要とU.によって割り当てられたアップストリームに割り当てられたラベルでなければなりません。 D1およびD2は、Uにラベルマッピングメッセージを送信しません。その代わり、それらは、MP-LSP <R、X>にラベルを割り当てるためにUを求め、[LDP-UP]のセクション4の手順に従って、Uにラベル要求メッセージを送信します。 Uは、（[LDP-UP]で指定された手順を使用して）上流に割り当てられたラベルLを含むLabel Mappingメッセージで応答します。同じLabel Mappingメッセージの一部として、Uはまた、MP-LSP上のデータが実施されるマルチキャストトンネルを識別する（[LDP-UP]で指定されるように）インタフェースTLVを送信します。 Uがこのトンネルにパケットを送信する場合、それは第一上流割り当てられたラベルL上にプッシュし、次にマルチキャストトンネルに対応するラベルに押します。"
    },
    {
      "indent": 3,
      "text": "If the numerical value L of the upstream-assigned label is the value 3, defined in [LDP] and [RFC3032] as \"Implicit NULL\", then the specified multicast tunnel will carry only the specified MP-LSP. That is, aggregation of multiple MP-LSPs into a single multicast tunnel is not being done. In this case, no upstream-assigned label is pushed onto a packet that is transmitted through the multicast tunnel.",
      "ja": "上流割り当てられたラベルの数値Lが[LDP]で定義された値3、および「暗黙的NULL」として[RFC3032]である場合には、指定されたマルチキャストトンネルは、指定されたMP-LSPを伝送します。すなわち、単一のマルチキャストトンネルに複数のMP-LSPの凝集が行われていない、です。この場合、無上流割り当てられたラベルは、マルチキャストトンネルを介して送信されるパケットにプッシュされます。"
    },
    {
      "indent": 3,
      "text": "Various types of multicast tunnel may be used. The choice of tunnel type is determined by provisioning, or by some other method that is outside the scope of this document. [LDP-UP] specifies encodings allowing U to identify an mLDP MP-LSP, and RSVP-TE P2MP LSP, as well as other types of multicast tunnel.",
      "ja": "マルチキャストトンネルの様々なタイプを使用することができます。トンネル型の選択は、プロビジョニングによって、または本文書の範囲外であるいくつかの他の方法によって決定されます。 [LDP-UP] MLDP MP-LSPを識別し、RSVP-TE P2MP LSPのためにUを可能にエンコーディング、ならびにマルチキャストトンネルの他のタイプを指定します。"
    },
    {
      "indent": 3,
      "text": "Procedures for tunneling MP2MP LSPs through P2MP or MP2MP LSPs are outside the scope of this document.",
      "ja": "P2MP又はMP2MP LSPを介しMP2MP LSPをトンネリングするための手順は、この文書の範囲外です。"
    },
    {
      "indent": 3,
      "text": "If the multicast tunnel is an mLDP MP-LSP or an RSVP-TE P2MP LSP, when U transmits a packet on the MP-LSP <R,X>, the upstream-assigned label L will be the second label in the label stack. Penultimate-hop popping MUST NOT be done, because the top label provides the context in which the second label is to be interpreted. See [RFC5331].",
      "ja": "マルチキャストトンネルはMLDP MP-LSPまたはRSVP-TE P2MP LSPである場合にUがMP-LSP <R、X>にパケットを送信する場合、上流割り当てられたラベルLをラベルスタックに第二の標識であろう。トップラベルが第二ラベルが解釈されるべきコンテキストを提供するため、最後から二番目のホップのポッピングは、してはいけません。 [RFC5331]を参照してください。"
    },
    {
      "indent": 3,
      "text": "When LSR U uses these procedures to inform LSR D that a particular MP-LSP is being carried in a particular multicast tunnel, U and D MUST take appropriate steps to ensure that the packets U sends into this tunnel will be received by D. The exact steps to take depend on the tunnel type. As long as U is D's upstream LSR for any MP-LSP that has been assigned to this tunnel, D must remain joined to the tunnel.",
      "ja": "LSR Uが特定のMP-LSPは、特定のマルチキャストトンネルで搬送されていることLSR Dに知らせるために、これらの手順を使用している場合、UとDは、Uが、このトンネルに送信するパケットが正確D.ザによって受信されることを保証するために適切な措置を取らなければなりません実行する手順は、トンネルタイプによって異なります。限り、Uがこのトンネルに割り当てられている任意のMP-LSPのためのDの上流側LSRであるように、Dは、トンネルに接合されたままでなければなりません。"
    },
    {
      "indent": 3,
      "text": "Note that U MAY assign the same multicast tunnel for multiple different MP-LSPs. However, U MUST assign a distinct upstream-assigned label to each MP-LSP. This allows the packets traveling through the tunnel to be demultiplexed into the proper MP-LSPs.",
      "ja": "Uは、複数の異なるMP-LSPのための同一のマルチキャストトンネルを割り当てることができることに留意されたいです。ただし、Uは各MP-LSPに異なる上流割り当てられたラベルを割り当てる必要があります。このトンネルを通って移動するパケットは適切なMP-のLSPに分離することを可能にします。"
    },
    {
      "indent": 3,
      "text": "If U has an MP-LSP <R1,X1> with downstream LSRs D1 and D2, and an MP-LSP <R2,X2> with downstream LSRs D2 and D3, U may assign both MP-LSPs to the same multicast tunnel. In this case, D3 will receive packets traveling on <R1,X1>. However, the upstream-assigned label carried by those packets will not be recognized by D3, hence D3 will discard those packets. Similarly, D1 will discard the <R2,X2> packets.",
      "ja": "Uは、下流のLSR D2とD3と下流のLSR D1およびD2、およびMP-LSP <R2、X2>とMP-LSP <R1、X1>を持っている場合、Uは、同一のマルチキャストトンネルの両方MP-LSPを割り当てることができます。この場合、D3は<R1、X1>に移動するパケットを受信します。しかし、これらのパケットによって運ば上流割り当てられたラベルは、それゆえD3は、これらのパケットを廃棄する、D3によって認識されません。同様に、D1は<R2、X2>パケットを廃棄します。"
    },
    {
      "indent": 3,
      "text": "This document does not specify any rules for deciding whether to aggregate two or more MP-LSPs into a single multicast tunnel. Such rules are outside the scope of this document.",
      "ja": "この文書では、単一のマルチキャストトンネルに二つ以上のMP-LSPを集約するかどうかを決定するための任意のルールを指定していません。このようなルールは、この文書の範囲外です。"
    },
    {
      "indent": 3,
      "text": "Except for the procedures explicitly detailed in this document, the procedures of [mLDP] and [LDP-UP] apply unchanged.",
      "ja": "このドキュメントで明示的に詳細な手順を除いて、[MLDP]の手順と[LDP-UP]はそのまま適用されます。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "ja": "7.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document raises no new security considerations beyond those discussed in [LDP], [LDP-UP], and [RFC5331].",
      "ja": "この文書では、[LDP]、[LDP-UP]、および[RFC5331]で説明したものを超えてまったく新しいセキュリティの考慮事項を提起しません。"
    },
    {
      "indent": 0,
      "text": "8. Acknowledgments",
      "section_title": true,
      "ja": "8.謝辞"
    },
    {
      "indent": 3,
      "text": "The authors wish to thank Lizhong Jin and Lizhen Bin for their comments.",
      "ja": "作者は彼らのコメントのためにLizhongジンとLizhenビンに感謝したいです。"
    },
    {
      "indent": 0,
      "text": "9. Normative References",
      "section_title": true,
      "ja": "9.引用規格"
    },
    {
      "indent": 3,
      "text": "[LDP] Andersson, L., Ed., Minei, I., Ed., and B. Thomas, Ed., \"LDP Specification\", RFC 5036, October 2007.",
      "ja": "[LDP]アンデション、L.、エド。、Minei、I.、エド。、およびB.トーマス、エド。、 \"LDP仕様\"、RFC 5036、2007年10月。"
    },
    {
      "indent": 3,
      "text": "[LDP-CAP] Thomas, B., Raza, K., Aggarwal, S., Aggarwal, R., and JL. Le Roux, \"LDP Capabilities\", RFC 5561, July 2009.",
      "ja": "[LDP-CAP]トーマス、B.、ラザ、K.、アガルワル、S.、アガルワル、R.、およびJL。ル・ルー、 \"LDP機能\"、RFC 5561、2009年7月。"
    },
    {
      "indent": 3,
      "text": "[mLDP] Wijnands, IJ., Ed., Minei, I., Ed., Kompella, K., and B. Thomas, \"Label Distribution Protocol Extensions for Point-to-Multipoint and Multipoint-to-Multipoint Label Switched Paths\", RFC 6388, November 2011.",
      "ja": "[MLDP] Wijnands、IJ。、エド。、Minei、I.、エド。、Kompella、K.、およびB.トーマス、「ポイント・ツー・マルチポイントおよびマルチポイント・ツー・マルチポイントラベルは、パスのスイッチのためのラベル配布プロトコルの拡張機能」 、RFC 6388、2011年11月。"
    },
    {
      "indent": 3,
      "text": "[LDP-UP] Aggarwal, R. and JL. Le Roux, \"MPLS Upstream Label Assignment for LDP\", RFC 6389, November 2011.",
      "ja": "[LDP-UP]アガルワル、R.およびJL。ル・ルー、 \"LDPのためのMPLS上流のラベルの割り当て\"、RFC 6389、2011年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3032] Rosen, E., Tappan, D., Fedorkow, G., Rekhter, Y., Farinacci, D., Li, T., and A. Conta, \"MPLS Label Stack Encoding\", RFC 3032, January 2001.",
      "ja": "[RFC3032]ローゼン、E.、タッパン、D.、Fedorkow、G.、Rekhter、Y.、ファリナッチ、D.、李、T.、およびA.コンタ、 \"MPLSラベルスタックエンコーディング\"、RFC 3032、2001年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC5331] Aggarwal, R., Rekhter, Y., and E. Rosen, \"MPLS Upstream Label Assignment and Context-Specific Label Space\", RFC 5331, August 2008.",
      "ja": "[RFC5331]アガルワル、R.、Rekhter、Y.、およびE.ローゼン、 \"MPLS上流ラベルの割り当てとコンテキスト固有のラベルスペース\"、RFC 5331、2008年8月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Maria Napierala AT&T Labs 200 Laurel Avenue Middletown, NJ 07748 USA",
      "ja": "マリアNapierala AT＆T Labsの200ローレルアベニューミドルタウン、NJ 07748 USA"
    },
    {
      "indent": 3,
      "text": "EMail: mnapierala@att.com",
      "ja": "メールアドレス：mnapierala@att.com"
    },
    {
      "indent": 3,
      "text": "Eric C. Rosen Cisco Systems, Inc. 1414 Massachusetts Avenue Boxborough, MA, 01719 USA",
      "ja": "エリックC.ローゼンシスコシステムズ株式会社1414年マサチューセッツアベニューボックスボロー、MA、01719 USA"
    },
    {
      "indent": 3,
      "text": "EMail: erosen@cisco.com",
      "ja": "メールアドレス：erosen@cisco.com"
    },
    {
      "indent": 3,
      "text": "IJsbrand Wijnands Cisco Systems, Inc. De kleetlaan 6a Diegem 1831 Belgium",
      "ja": "IJsbrand Wijnandsシスコシステムズ株式会社Kleetlaan 6aはディーゲム1831ベルギー"
    },
    {
      "indent": 3,
      "text": "EMail: ice@cisco.com",
      "ja": "メールアドレス：ice@cisco.com"
    }
  ]
}