{
  "title": {
    "text": "RFC 8514 - Internet Message Access Protocol (IMAP) - SAVEDATE Extension",
    "ja": "RFC 8514 - インターネットメッセージアクセスプロトコル（IMAP） -  SAVEDATE拡張"
  },
  "number": 8514,
  "created_at": "2019-10-29 15:22:20.791902+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                          S. Bosch\nRequest for Comments: 8514                               Open Xchange Oy\nCategory: Standards Track                                   January 2019\nISSN: 2070-1721",
      "raw": true
    },
    {
      "indent": 6,
      "text": "Internet Message Access Protocol (IMAP) - SAVEDATE Extension",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document adds a new capability called \"SAVEDATE\" to the Internet Message Access Protocol (IMAP). It defines a new IMAP message attribute called \"save date\" that, unlike the existing \"internal date\" attribute, always indicates the moment at which the message was saved in its current mailbox. The SAVEDATE capability extends the FETCH command with the means to retrieve the save date attribute and extends the SEARCH command to allow using the save date attribute in searching criteria.",
      "ja": "このドキュメントは、インターネットメッセージアクセスプロトコル（IMAP）に「SAVEDATE」と呼ばれる新しい機能が追加されます。これは、既存の「内部日付」属性とは異なり、常にメッセージは、現在のメールボックスに保存された瞬間を示し、「日付を救う」と呼ばれる新しいIMAPメッセージ属性を定義します。 SAVEDATE機能は、日付を保存する属性を取得するための手段とFETCHコマンドを拡張し、基準を検索する際に保存日付属性を使用できるように、検索コマンドを拡張します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 7841.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 7841のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at https://www.rfc-editor.org/info/rfc8514.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttps://www.rfc-editor.org/info/rfc8514で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2019 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2019 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (https://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（https://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2\n2.  Conventions Used in This Document . . . . . . . . . . . . . .   3\n3.  Save Date Message Attribute . . . . . . . . . . . . . . . . .   3\n4.  IMAP Protocol Changes . . . . . . . . . . . . . . . . . . . .   4\n  4.1.  CAPABILITY Identification . . . . . . . . . . . . . . . .   4\n  4.2.  FETCH Command and Response Extensions . . . . . . . . . .   4\n  4.3.  SEARCH Command Extension  . . . . . . . . . . . . . . . .   4\n5.  Formal Syntax . . . . . . . . . . . . . . . . . . . . . . . .   5\n6.  Security Considerations . . . . . . . . . . . . . . . . . . .   5\n7.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   6\n8.  Normative References  . . . . . . . . . . . . . . . . . . . .   6\nAcknowledgements  . . . . . . . . . . . . . . . . . . . . . . . .   7\nAuthor's Address  . . . . . . . . . . . . . . . . . . . . . . . .   7",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "This document extends the Internet Message Access Protocol (IMAP) [IMAP4rev1] with a new capability called \"SAVEDATE\". This capability adds a new IMAP message attribute called \"save date\". The save date is the date and time at which a message was saved in the mailbox in which it currently resides. The save date is similar to the existing \"internal date\" attribute in that it is set at the time of delivery. However, the internal date attribute can be set to an arbitrary value for messages delivered to the mailbox using the APPEND command and is usually copied from the source message for messages delivered using the COPY command. In contrast, the save date attribute is always set to the current date and time at the moment the message is saved in the mailbox, irrespective of how the message is delivered and from where it originates.",
      "ja": "この文書は、 \"SAVEDATE\" と呼ばれる新しい機能でIMAP（Internet Message Access Protocol）の[のIMAP4rev1]を拡張します。この機能は、「保存日付」と呼ばれる新しいIMAPメッセージ属性を追加します。保存した日付は、メッセージが、それが現在置かれているメールボックスに保存された日付と時刻です。保存した日付は、既存の「内部日付」それは配達の時に設定されていることで属性に似ています。しかし、内部日付属性は、APPENDコマンドを使用してメールボックスに配信されるメッセージのための任意の値に設定することができ、通常、COPYコマンドを使用して配信されたメッセージのソースメッセージからコピーされます。これとは対照的に、保存日時属性は常にメッセージが配信される方法にかかわらず、メッセージがメールボックスに保存されている現時点では、現在の日付と時刻に設定され、それが由来するところから。"
    },
    {
      "indent": 3,
      "text": "The save date attribute is useful for implementing automated removal of messages from a mailbox after a configured amount of time. For that application, it is necessary to know when the message was saved in the mailbox, which cannot be reliably determined using the internal date attribute.",
      "ja": "日付を保存する属性が設定時間後にメールボックスからメッセージを自動削除を実行するために有用です。そのアプリケーションの場合は、メッセージが確実に内部日付属性を使用して決定することができないメールボックスに保存された時に知っておく必要があります。"
    },
    {
      "indent": 3,
      "text": "For example, a common client usage pattern is to move deleted messages to a Trash mailbox. These messages are considered \"deleted\" at the time they are moved to the Trash mailbox. In an effort to limit the size of the Trash mailbox, a client may subsequently desire to permanently remove (expunge) all messages in that Trash mailbox deleted before a certain time (e.g., a configurable expiration interval). In that case, the internal date attribute cannot be used since it likely refers to the time at which the message was originally received. The proper time comparison attribute should instead be the time at which the message was saved to the Trash mailbox. Similar usage patterns can be observed for archiving solutions.",
      "ja": "例えば、一般的なクライアントの使用パターンは、ゴミ箱のメールボックスに削除されたメッセージを移動することです。これらのメッセージは、それらはゴミ箱のメールボックスに移動されている時に「削除」と考えられています。ゴミ箱のメールボックスのサイズを制限する目的で、クライアントはその後永久に一定時間（例えば、設定可能な有効期間）前に削除そのゴミ箱メールボックス内のすべてのメッセージを削除（抹消）することを望むかもしれません。それはおそらく、メッセージが最初に受信した時刻を意味するので、その場合には、内部日付属性を使用することができません。適切な時間比較属性ではなく、メッセージがゴミ箱のメールボックスに保存された時刻でなければなりません。同様の使用パターンはアーカイブソリューションのために観察することができます。"
    },
    {
      "indent": 3,
      "text": "The SAVEDATE capability extends the FETCH command and response to allow retrieving the date and time at which a message was saved. Also, the SAVEDATE capability extends the SEARCH command to allow searching messages with criteria based on when they were saved in the mailbox.",
      "ja": "SAVEDATE機能は、メッセージが保存された日付と時刻を取得できるように、FETCHコマンドとレスポンスを拡張します。また、SAVEDATE機能は、それらがメールボックスに保存されたときに基づいた基準でメッセージを検索できるようにSEARCHコマンドを拡張します。"
    },
    {
      "indent": 0,
      "text": "2. Conventions Used in This Document",
      "section_title": true,
      "ja": "この文書で使用される2.表記"
    },
    {
      "indent": 3,
      "text": "In examples, \"C:\" indicates lines sent by a client that is connected to a server. \"S:\" indicates lines sent by the server to the client.",
      "ja": "実施例では、「C：」はサーバに接続されているクライアントから送信されたラインを示します。 「S：」はサーバからクライアントに送られた行を示します。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14 [KEYWORDS] [KEYWORDS-UPD] when, and only when, they appear in all capitals, as shown here.",
      "ja": "キーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、 \"SHALL\"、 \"SHOULD\"、 \"ないもの\"、 \"推奨\" \"ない（SHOULD NOT）\"、 \"MAY\"、 \"推奨NOT\"、および「OPTIONAL BCP 14に記載されているように「この文書の[KEYWORDS] [KEYWORDS-UPD]際に解釈されるべきであり、そしてここに示されているように、それらは、すべて大文字で表示された場合にのみ。"
    },
    {
      "indent": 0,
      "text": "3. Save Date Message Attribute",
      "section_title": true,
      "ja": "3. [保存日付のメッセージ属性"
    },
    {
      "indent": 3,
      "text": "The save date message attribute is the date and time at which the message was saved in the mailbox it is now located in. Unlike the internal date message attribute defined by [IMAP4rev1], this date and time value cannot be set arbitrarily when a message is delivered by the IMAP APPEND command. Also, when a message is delivered to the mailbox by the IMAP COPY command [IMAP4rev1] or the IMAP MOVE command [IMAP-MOVE], the save date attribute is not copied from the source message. Instead, the current date and time at which the message is delivered to a mailbox MUST be used to set the save date attribute. Once calculated, the save date attribute MUST NOT change as long as the message is contained within the same mailbox.",
      "ja": "日付メッセージの属性を保存するメッセージが、それが今に位置しているメールボックスに保存された日付と時刻です。メッセージがあるときに[IMAP4rev1の]、この日付と時刻の値によって定義された内部日付メッセージ属性が任意に設定することができないとは異なりIMAPのAPPENDコマンドで配信。メッセージはIMAPのCOPYコマンド[IMAP4rev1の]またはIMAPのMOVEコマンド[IMAP-MOVE]でメールボックスに配信されたときも、保存した日付属性はソースメッセージからコピーされません。代わりに、メッセージがメールボックスに配信された現在の日付と時刻が日付を保存し、属性を設定するために使用しなければなりません。計算したら、保存した日付属性がある限り、メッセージが同じメールボックス内に含まれるように変更してはなりません。"
    },
    {
      "indent": 3,
      "text": "This means that when the message is copied to another mailbox, the save date of the message in the source mailbox remains unaffected; only the new copy of the message gets a new save date. Consequently, when the message is moved to another mailbox, either using the MOVE command or a command sequence involving the COPY command [IMAP-MOVE], the message always gets a new save date in the destination mailbox.",
      "ja": "これは、メッセージが別のメールボックスにコピーされたときに、元のメールボックス内のメッセージの保存日付が影響を受けないままであることを意味します。メッセージのみの新しいコピーは、新しい保存日付を取得します。メッセージはMOVEコマンドまたはCOPYコマンド[IMAP-MOVE]を含むコマンド・シーケンスのいずれかを使用して、別のメールボックスに移動されたときにその結果、メッセージは常に先のメールボックスに新しい保存した日付を取得します。"
    },
    {
      "indent": 3,
      "text": "For some specific mailboxes, the underlying storage may not support the save date attribute. The handling of this situation is described in detail in the next section for each involved IMAP command.",
      "ja": "いくつかの特定のメールボックスのために、基礎となるストレージが保存日付属性をサポートしていないかもしれません。このような状況の処理は、各関与するIMAPコマンドの次のセクションで詳細に記載されています。"
    },
    {
      "indent": 0,
      "text": "4. IMAP Protocol Changes",
      "section_title": true,
      "ja": "4. IMAPプロトコルの変更"
    },
    {
      "indent": 0,
      "text": "4.1. CAPABILITY Identification",
      "section_title": true,
      "ja": "4.1。能力特定"
    },
    {
      "indent": 3,
      "text": "IMAP servers that support this extension MUST include \"SAVEDATE\" in the response list to the CAPABILITY command.",
      "ja": "この拡張をサポートするIMAPサーバは、CAPABILITYコマンドに応答リストで「SAVEDATE」を含まなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.2. FETCH Command and Response Extensions",
      "section_title": true,
      "ja": "4.2。コマンドと応答の拡張をFETCH"
    },
    {
      "indent": 3,
      "text": "This extension defines one new data item for the FETCH command:",
      "ja": "この拡張は、FETCHコマンドのための1つの新しいデータ項目を定義します。"
    },
    {
      "indent": 3,
      "text": "SAVEDATE The save date of the message.",
      "ja": "SAVEDATEザ・メッセージの日付を保存します。"
    },
    {
      "indent": 3,
      "text": "This extension defines one new data item for the FETCH response:",
      "ja": "この拡張は、FETCH応答のための1つの新しいデータ項目を定義します。"
    },
    {
      "indent": 3,
      "text": "SAVEDATE A string representing the save date of the message. However, if the underlying mailbox storage does not support the save date message attribute, the value returned for the SAVEDATE item is always NIL, rather than a string.",
      "ja": "メッセージの保存日付を表す文字列をSAVEDATE。基盤となるメールボックスの保存は、保存日付メッセージ属性をサポートしていない場合は、値がSAVEDATE項目に対して返される文字列ではなく、常にNILです。"
    },
    {
      "indent": 3,
      "text": "Example:",
      "ja": "例："
    },
    {
      "indent": 9,
      "text": "C: A101 FETCH 998 (SAVEDATE)\nS: * 998 FETCH (SAVEDATE \"01-Jan-2015 18:50:53 +0100\")\nS: A101 OK Fetch completed.",
      "raw": true
    },
    {
      "indent": 0,
      "text": "4.3. SEARCH Command Extension",
      "section_title": true,
      "ja": "4.3。検索コマンドの拡張"
    },
    {
      "indent": 3,
      "text": "This extension defines four new search keys for the SEARCH command:",
      "ja": "この拡張は、検索コマンドのための4つの新しい検索キーを定義します。"
    },
    {
      "indent": 3,
      "text": "SAVEDBEFORE <date> Messages whose save date (disregarding time and timezone) is earlier than the specified date.",
      "ja": "SAVEDBEFOREその日付を保存する（時刻とタイムゾーンを無視して）指定した日付よりも前である<日時>メッセージ。"
    },
    {
      "indent": 3,
      "text": "SAVEDON <date> Messages whose save date (disregarding time and timezone) is within the specified date.",
      "ja": "その日付を保存（時刻とタイムゾーンを無視して）指定した日付の範囲内であるSAVEDON <日時>メッセージ。"
    },
    {
      "indent": 3,
      "text": "SAVEDSINCE <date> Messages whose save date (disregarding time and timezone) is within or later than the specified date.",
      "ja": "SAVEDSINCEその日付を保存する（時刻とタイムゾーンを無視）内以降の指定した日付より<日時>メッセージ。"
    },
    {
      "indent": 3,
      "text": "SAVEDATESUPPORTED Matches all messages in the mailbox when the underlying storage of that mailbox supports the save date attribute. Conversely, it matches no messages in the mailbox when the save date attribute is not supported.",
      "ja": "そのメールボックスの基盤となるストレージが保存日付属性をサポートしているときSAVEDATESUPPORTEDは、メールボックス内のすべてのメッセージにマッチします。保存日付属性がサポートされていない場合は逆に、それは、メールボックスにメッセージと一致しません。"
    },
    {
      "indent": 3,
      "text": "When the underlying storage of a mailbox does not support the save date attribute, the SAVEDBEFORE, SAVEDON, and SAVEDSINCE search keys MUST use the internal date attribute instead. In the context of the IMAP Multimailbox SEARCH Extension [MULTISEARCH], this fallback behavior MUST apply to each mailbox individually, meaning that only the mailboxes that lack support for the save date attribute use the internal date attribute instead.",
      "ja": "メールボックスの基盤となるストレージが保存日付属性をサポートしていない場合は、SAVEDBEFORE、SAVEDON、およびSAVEDSINCEの検索キーではなく、内部の日付属性を使用しなければなりません。 IMAP Multimailbox SEARCH拡張[MULTISEARCH]の文脈では、このフォールバック動作は保存日付のサポートが不足しているメールボックスだけではなく、内部の日付属性を使用する属性つまり、個々のメールボックスに適用する必要があります。"
    },
    {
      "indent": 3,
      "text": "Example:",
      "ja": "例："
    },
    {
      "indent": 9,
      "text": "C: A102 SEARCH SAVEDON 28-Dec-2014\nS: * SEARCH 993 994\nS: A102 OK Search completed.\nC: A103 SEARCH SAVEDSINCE 28-Dec-2014\nS: * SEARCH 993 994 995 996 997 998 999 1000 1001\nS: A103 OK Search completed.",
      "raw": true
    },
    {
      "indent": 0,
      "text": "5. Formal Syntax",
      "section_title": true,
      "ja": "5.正式な構文"
    },
    {
      "indent": 3,
      "text": "The following syntax specification augments the grammar specified in [IMAP4rev1]. It uses the Augmented Backus-Naur Form (ABNF) notation as specified in [ABNF]. Elements not defined here are taken from [IMAP4rev1].",
      "ja": "次の構文仕様は[IMAP4rev1の]で指定された文法を強化します。これは、[ABNF]で指定された拡張バッカス・ナウアフォーム（ABNF）の表記を使用します。ここで定義されていない要素は[IMAP4rev1の]から取得されます。"
    },
    {
      "indent": 3,
      "text": "capability =/ \"SAVEDATE\"",
      "ja": "機能= / \"SAVEDATE\""
    },
    {
      "indent": 3,
      "text": "fetch-att =/ \"SAVEDATE\"",
      "ja": "フェッチ-ATT = / \"SAVEDATE\""
    },
    {
      "indent": 3,
      "text": "msg-att-static =/ \"SAVEDATE\" SP (date-time / nil)",
      "ja": "MSG-ATT-静的= / \"SAVEDATE\" SP（日時/ NIL）"
    },
    {
      "indent": 3,
      "text": "search-key =/ \"SAVEDBEFORE\" SP date / \"SAVEDON\" SP date / \"SAVEDSINCE\" SP date / \"SAVEDATESUPPORTED\"",
      "ja": "検索キー= / \"SAVEDBEFORE\" SP日付/ \"SAVEDON\" SP日付/ \"SAVEDSINCE\" SP日付/ \"SAVEDATESUPPORTED\""
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "There are no known additional security issues with this extension beyond those described in the base protocol described in [IMAP4rev1].",
      "ja": "[IMAP4rev1の]で説明した基本プロトコルに記載されているものを超え、この拡張子を持つ既知の追加のセキュリティ上の問題はありません。"
    },
    {
      "indent": 0,
      "text": "7. IANA Considerations",
      "section_title": true,
      "ja": "7. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has added \"SAVEDATE\" to the \"IMAP Capabilities\" registry located at <https://www.iana.org/assignments/imap-capabilities>.",
      "ja": "IANAは、<https://www.iana.org/assignments/imap-capabilities>にある「IMAP機能」レジストリに「SAVEDATE」を追加しました。"
    },
    {
      "indent": 0,
      "text": "8. Normative References",
      "section_title": true,
      "ja": "8.引用規格"
    },
    {
      "indent": 3,
      "text": "[ABNF] Crocker, D. and P. Overell, \"Augmented BNF for Syntax Specifications: ABNF\", STD 68, RFC 5234, DOI 10.17487/RFC5234, January 2008, <https://www.rfc-editor.org/rfc/rfc5234>.",
      "ja": "[ABNF] \"構文仕様のための増大しているBNF：ABNF\" クロッカー、D.とP. Overell、STD 68、RFC 5234、DOI 10.17487 / RFC5234、2008年1月、<https://www.rfc-editor.org/rfc / RFC5234>。"
    },
    {
      "indent": 3,
      "text": "[IMAP-MOVE] Gulbrandsen, A. and N. Freed, \"Internet Message Access Protocol (IMAP) - MOVE Extension\", RFC 6851, DOI 10.17487/RFC6851, January 2013, <https://www.rfc-editor.org/rfc/rfc6851>.",
      "ja": "[IMAP-MOVE] Gulbrandsenの、A.及びN.解放された、 \"インターネットメッセージアクセスプロトコル（IMAP） -  MOVE拡張\"、RFC 6851、DOI 10.17487 / RFC6851、2013年1月、<https://www.rfc-editor.org / RFC / rfc6851>。"
    },
    {
      "indent": 3,
      "text": "[IMAP4rev1] Crispin, M., \"INTERNET MESSAGE ACCESS PROTOCOL - VERSION 4rev1\", RFC 3501, DOI 10.17487/RFC3501, March 2003, <https://www.rfc-editor.org/rfc/rfc3501>.",
      "ja": "[IMAP4rev1の]クリスピン、M.、 \"インターネットメッセージアクセスプロトコル - バージョン4rev1\"、RFC 3501、DOI 10.17487 / RFC3501、2003年3月、<https://www.rfc-editor.org/rfc/rfc3501>。"
    },
    {
      "indent": 3,
      "text": "[KEYWORDS] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <https://www.rfc-editor.org/rfc/rfc2119>.",
      "ja": "[キーワード]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<https://www.rfc-editor.org/rfc/ RFC2119>。"
    },
    {
      "indent": 3,
      "text": "[KEYWORDS-UPD] Leiba, B., \"Ambiguity of Uppercase vs Lowercase in RFC 2119 Key Words\", BCP 14, RFC 8174, DOI 10.17487/RFC8174, May 2017, <https://www.rfc-editor.org/info/rfc8174>.",
      "ja": "[KEYWORDS-UPD] Leiba、B.、 \"RFC 2119個のキーワードに小文字VS大文字の曖昧さ\"、BCP 14、RFC 8174、DOI 10.17487 / RFC8174、2017年5月、<https://www.rfc-editor.org/情報/ rfc8174>。"
    },
    {
      "indent": 3,
      "text": "[MULTISEARCH] Leiba, B. and A. Melnikov, \"IMAP4 Multimailbox SEARCH Extension\", RFC 7377, DOI 10.17487/RFC7377, October 2014, <https://www.rfc-editor.org/info/rfc7377>.",
      "ja": "[MULTISEARCH] Leiba、B.とA.メルニコフ、 \"IMAP4 Multimailbox SEARCH拡張\"、RFC 7377、DOI 10.17487 / RFC7377、2014年10月、<https://www.rfc-editor.org/info/rfc7377>。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Thanks to Bron Gondwana, Alexey Melnikov, Timo Sirainen, and Michael Slusarz for reviews and suggestions.",
      "ja": "レビューや提案のためのブロンゴンドワナ、アレクセイ・メルニコフ、ティモ・シレーヌン、そしてマイケルSlusarzに感謝します。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Stephan Bosch Open Xchange Oy Lars Sonckin kaari 12 Espoo 02600 Finland",
      "ja": "オープンksacenja聖ラース・ステファンbasacha sankina karai 1 SPO 02600フィンランド"
    },
    {
      "indent": 3,
      "text": "Email: stephan.bosch@open-xchange.com",
      "ja": "メール：stephan.bosch@open-xchange.com"
    }
  ]
}