{
  "title": {
    "text": "RFC 8538 - Notification Message Support for BGP Graceful Restart",
    "ja": "RFC 8538 - BGPグレースフルリスタートのための通知メッセージのサポート"
  },
  "number": 8538,
  "created_at": "2019-10-29 20:35:13.259574+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                          K. Patel\nRequest for Comments: 8538                                        Arrcus\nUpdates: 4724                                                R. Fernando\nCategory: Standards Track                                  Cisco Systems\nISSN: 2070-1721                                               J. Scudder\n                                                                 J. Haas\n                                                        Juniper Networks\n                                                              March 2019",
      "raw": true
    },
    {
      "indent": 9,
      "text": "Notification Message Support for BGP Graceful Restart",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "The BGP Graceful Restart mechanism defined in RFC 4724 limits the usage of BGP Graceful Restart to BGP messages other than BGP NOTIFICATION messages. This document updates RFC 4724 by defining an extension that permits the Graceful Restart procedures to be performed when the BGP speaker receives a BGP NOTIFICATION message or the Hold Time expires. This document also defines a new subcode for BGP Cease NOTIFICATION messages; this new subcode requests a full session restart instead of a Graceful Restart.",
      "ja": "RFC 4724で定義されたBGPグレースフルリスタート機構は、BGP通知メッセージ以外のBGPメッセージのBGPグレースフルリスタートの使用を制限します。 BGPスピーカは、BGP通知メッセージを受信するか、ホールド時間が満了したときに実行されるグレースフルリスタート手順を可能にする拡張機能を定義することにより、この文書の更新RFC 4724。また、このドキュメントでは、BGPシーズ通知メッセージのための新たなサブコードを定義します。この新しいサブコードではなく、グレースフルリスタートのフルセッションの再起動を要求します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 7841.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 7841のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at https://www.rfc-editor.org/info/rfc8538.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttps://www.rfc-editor.org/info/rfc8538で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2019 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2019 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (https://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（https://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   3\n  1.1.  Requirements Language . . . . . . . . . . . . . . . . . .   3\n2.  Modifications to BGP Graceful Restart Capability  . . . . . .   3\n3.  BGP Hard Reset Subcode  . . . . . . . . . . . . . . . . . . .   4\n  3.1.  Sending a Hard Reset  . . . . . . . . . . . . . . . . . .   4\n  3.2.  Receiving a Hard Reset  . . . . . . . . . . . . . . . . .   4\n4.  Operation . . . . . . . . . . . . . . . . . . . . . . . . . .   5\n  4.1.  Rules for the Receiving Speaker . . . . . . . . . . . . .   6\n5.  Use of Hard Reset . . . . . . . . . . . . . . . . . . . . . .   7\n  5.1.  When to Send a Hard Reset . . . . . . . . . . . . . . . .   7\n  5.2.  Interaction with Other Specifications . . . . . . . . . .   7\n6.  Management Considerations . . . . . . . . . . . . . . . . . .   8\n7.  Operational Considerations  . . . . . . . . . . . . . . . . .   8\n8.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   8\n9.  Security Considerations . . . . . . . . . . . . . . . . . . .   9\n10. References  . . . . . . . . . . . . . . . . . . . . . . . . .   9\n  10.1.  Normative References . . . . . . . . . . . . . . . . . .   9\n  10.2.  Informative References . . . . . . . . . . . . . . . . .   9\nAcknowledgements  . . . . . . . . . . . . . . . . . . . . . . . .  10\nAuthors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  10",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "For many classes of errors, BGP must send a NOTIFICATION message and reset the peering session to handle the error condition. The BGP Graceful Restart mechanism defined in [RFC4724] requires that normal BGP procedures defined in [RFC4271] be followed when a NOTIFICATION message is sent or received. This document defines an extension to BGP Graceful Restart that permits the Graceful Restart procedures to be performed when the BGP speaker receives a NOTIFICATION message or the Hold Time expires. This permits the BGP speaker to avoid flapping reachability and continue forwarding while the BGP speaker restarts the session to handle errors detected in BGP.",
      "ja": "エラーの多くのクラスでは、BGPは、通知メッセージを送信し、エラー条件を処理するためのピアリングセッションをリセットする必要があります。 [RFC4724]で定義されたBGPグレースフルリスタート機構は、通知メッセージが送信または受信されたときに[RFC4271]で定義された通常のBGP手順に従うことが必要です。この文書は、BGPスピーカは、通知メッセージを受信するか、ホールド時間が満了したときに実行されるグレースフルリスタート手順を可能にするBGPグレースフルリスタートの拡張を定義します。これは、フラッピング到達可能性を回避し、BGPスピーカは、BGPで検出されたエラーを処理するためのセッションを再開しながら、転送を継続するBGPスピーカが可能になります。"
    },
    {
      "indent": 3,
      "text": "At a high level, this document can be summed up as follows. When a BGP session is reset, both speakers operate as \"Receiving Speakers\" according to [RFC4724], meaning they retain each other's routes. This is also true for HOLDTIME expiration. The functionality can be defeated by sending a BGP Cease NOTIFICATION message with the Hard Reset subcode. If a Hard Reset is used, a full session reset is performed.",
      "ja": "次のようにハイレベルでは、この文書をまとめることができます。 BGPセッションがリセットされると、両方のスピーカーは、彼らが互いのルートを維持する意味、[RFC4724]によると「受信スピーカー」として動作します。これはHOLDTIMEの有効期限についても同様です。機能は、ハードリセットサブコードとのBGPシーズ通知メッセージを送信することにより無効にすることができます。ハードリセットを使用する場合、フルセッションのリセットが行われます。"
    },
    {
      "indent": 0,
      "text": "1.1. Requirements Language",
      "section_title": true,
      "ja": "1.1。要件言語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14 [RFC2119] [RFC8174] when, and only when, they appear in all capitals, as shown here.",
      "ja": "キーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、 \"SHALL\"、 \"SHOULD\"、 \"ないもの\"、 \"推奨\" \"ない（SHOULD NOT）\"、 \"MAY\"、 \"推奨NOT\"、および「OPTIONAL BCP 14に記載されているように「この文書に解釈されるべきである[RFC2119]、[RFC8174]と、ここで示されるように、それらは、すべて大文字で表示された場合にのみ。"
    },
    {
      "indent": 0,
      "text": "2. Modifications to BGP Graceful Restart Capability",
      "section_title": true,
      "ja": "BGPグレースフルリスタート機能2.変更"
    },
    {
      "indent": 3,
      "text": "The BGP Graceful Restart Capability is augmented to signal the Graceful Restart support for BGP NOTIFICATION messages. The Restart Flags field is augmented as follows (following the diagram in Section 3 of [RFC4724]).",
      "ja": "BGPグレースフルリスタート機能は、BGP通知メッセージのためのグレースフルリスタートのサポートを通知するために強化されています。 （[RFC4724]のセクション3のダイアグラム以下）以下のように再起動フラグフィールドが拡張されています。"
    },
    {
      "indent": 3,
      "text": "Restart Flags:",
      "ja": "フラグを再起動します。"
    },
    {
      "indent": 9,
      "text": "This field contains bit flags relating to restart.",
      "ja": "このフィールドは、再起動するように関連するビットフラグが含まれています。"
    },
    {
      "indent": 15,
      "text": " 0 1 2 3\n+-+-+-+-+\n|R|N|   |\n+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The most significant bit is defined in [RFC4724] as the Restart State (\"R\") bit.",
      "ja": "最上位ビットは、再起動状態（「R」）ビットとして[RFC4724]で定義されています。"
    },
    {
      "indent": 3,
      "text": "The second most significant bit is defined in this document as the Graceful Notification (\"N\") bit. It is used to indicate Graceful Restart support for BGP NOTIFICATION messages. A BGP speaker indicates support for the procedures in this document by advertising a Graceful Restart Capability with its \"N\" bit set (value 1).",
      "ja": "第二の最上位ビットは、正常な通知（「N」）ビットとしてこの文書で定義されています。 BGP通知メッセージのためのグレースフルリスタートのサポートを示すために使用されます。 BGPスピーカは、その「N」ビットのセット（値1）とグレースフルリスタート機能を広告することによって、この文書に記載されている手順のサポートを示しています。"
    },
    {
      "indent": 3,
      "text": "If a BGP speaker that previously advertised a given set of Graceful Restart parameters opens a new session with a different set of parameters, these new parameters apply once the session has transitioned into ESTABLISHED state.",
      "ja": "以前にグレースフルリスタートパラメータの与えられたセットを宣伝BGPスピーカは、パラメータの異なるセットを使って、新しいセッションを開いた場合、セッションが確立状態に遷移した後は、これらの新しいパラメータが適用されます。"
    },
    {
      "indent": 0,
      "text": "3. BGP Hard Reset Subcode",
      "section_title": true,
      "ja": "3. BGPハードリセットサブコード"
    },
    {
      "indent": 3,
      "text": "This document defines a new subcode for BGP Cease NOTIFICATION messages, called the Hard Reset subcode. The value of this subcode is discussed in Section 8. In this document, a BGP Cease NOTIFICATION message with the Hard Reset subcode is referred to as a \"Hard Reset message\" or simply as a \"Hard Reset\".",
      "ja": "この文書では、BGPシーズ通知メッセージのための新たなサブコードを定義して、ハードリセットサブコードと呼ばれます。このサブコードの値は、この文書では、セクション8に記載されている、ハードリセットサブコードとBGPシーズ通知メッセージは、「ハードリセットメッセージ」として、または単に「ハードリセット」と呼ばれます。"
    },
    {
      "indent": 3,
      "text": "When the \"N\" bit has been exchanged by two peers, NOTIFICATION messages other than Hard Reset messages are referred to as \"Graceful\", since such messages invoke Graceful Restart semantics.",
      "ja": "「N」ビットは、2つのピアによって交換されたときにそのようなメッセージは、グレースフルリスタートセマンティクスを呼び出すため、ハードリセットメッセージ以外の通知メッセージは、「優雅」と呼ばれます。"
    },
    {
      "indent": 0,
      "text": "3.1. Sending a Hard Reset",
      "section_title": true,
      "ja": "3.1。ハードリセットを送信"
    },
    {
      "indent": 3,
      "text": "When the \"N\" bit has been exchanged, a Hard Reset message is used to indicate to the peer that the session is to be fully terminated.",
      "ja": "「N」ビットが交換された場合、ハードリセットメッセージは、セッションが完全に終了するピアに示すために使用されます。"
    },
    {
      "indent": 3,
      "text": "When sending a Hard Reset, the data portion of the NOTIFICATION message is encoded as follows:",
      "ja": "ハードリセットを送信する際に次のように、通知メッセージのデータ部分が符号化されます。"
    },
    {
      "indent": 7,
      "text": "+--------+--------+--------\n| ErrCode| Subcode| Data\n+--------+--------+--------",
      "raw": true
    },
    {
      "indent": 3,
      "text": "ErrCode is a BGP Error Code (as documented in the IANA \"BGP Error (Notification) Codes\" registry) that indicates the reason for the Hard Reset. Subcode is a BGP Error Subcode (as documented in the IANA \"BGP Error Subcodes\" registry) as appropriate for the ErrCode. Similarly, Data is as appropriate for the ErrCode and Subcode. In short, the Hard Reset encapsulates another NOTIFICATION message in its data portion.",
      "ja": "ハードリセットの理由を示す（IANA「BGPエラー（通知）コード」レジストリに記載されているように）ERRCODEは、BGPのエラーコードです。サブコードはERRCODEに応じて（IANA「BGPエラーサブコード」レジストリに記述されているように）BGPのエラーサブコードです。同様に、データはERRCODEとサブコード用として適切です。要するに、ハードリセットは、そのデータ部分に別の通知メッセージをカプセル化します。"
    },
    {
      "indent": 0,
      "text": "3.2. Receiving a Hard Reset",
      "section_title": true,
      "ja": "3.2。ハードリセットを受けます"
    },
    {
      "indent": 3,
      "text": "Whenever a BGP speaker receives a Hard Reset, the speaker MUST terminate the BGP session following the standard procedures in [RFC4271].",
      "ja": "BGPスピーカは、ハードリセットを受信するたびに、スピーカーは、[RFC4271]で標準的な手順以下のBGPセッションを終えなければなりません。"
    },
    {
      "indent": 0,
      "text": "4. Operation",
      "section_title": true,
      "ja": "4.操作"
    },
    {
      "indent": 3,
      "text": "A BGP speaker that is willing to receive and send BGP NOTIFICATION messages according to the procedures of this document MUST advertise the \"N\" bit using the Graceful Restart Capability as defined in [RFC4724].",
      "ja": "[RFC4724]で定義されるように、このドキュメントの手順に従ってBGP通知メッセージを受信し、送信しても構わないと思っているBGPスピーカは、グレースフルリスタート機能を使用して、「N」ビットをアドバタイズしなければなりません。"
    },
    {
      "indent": 3,
      "text": "When such a BGP speaker has received the \"N\" bit from its peer, and receives from that peer a BGP NOTIFICATION message other than a Hard Reset, it MUST follow the rules for the Receiving Speaker mentioned in Section 4.1. The BGP speaker generating the BGP NOTIFICATION message MUST also follow the rules for the Receiving Speaker.",
      "ja": "そのようなBGPスピーカは、そのピアから「N」ビットを受信し、そのハードリセット以外のBGP通知メッセージをピアから受信したとき、それはセクション4.1で述べた受信スピーカーのための規則に従わなければなりません。 BGP通知メッセージを生成するBGPスピーカはまた、受信スピーカーのための規則に従わなければなりません。"
    },
    {
      "indent": 3,
      "text": "When a BGP speaker resets its session due to a HOLDTIME expiry, it should generate the relevant BGP NOTIFICATION message as mentioned in [RFC4271] but subsequently MUST follow the rules for the Receiving Speaker mentioned in Section 4.1.",
      "ja": "BGPスピーカが原因HOLDTIME期限切れにそのセッションをリセットする場合は、[RFC4271]で述べたように、関連するBGP通知メッセージを生成する必要がありますが、その後、4.1節で述べた受信スピーカーのための規則に従わなければなりません。"
    },
    {
      "indent": 3,
      "text": "A BGP speaker SHOULD NOT send a Hard Reset to a peer from which it has not received the \"N\" bit. We note, however, that if it did so, the effect would be as desired in any case because, according to [RFC4271] and [RFC4724], any NOTIFICATION message, whether recognized or not, results in a session reset. Thus, the only negative effect to be expected from sending the Hard Reset to a peer that hasn't advertised compliance to this specification would be that the peer would be unable to properly log the associated information.",
      "ja": "BGPスピーカは、それが「N」ビットを受信して​​いない元のピアにハードリセットを送るべきではありません。我々は、セッションのリセットに結果を認識しているか否か、[RFC4271]及び[RFC4724]、任意NOTIFICATIONメッセージに応じて、それはそのようにした場合、効果がASためいずれの場合に望まれることは、留意されたいです。したがって、この仕様に準拠をアドバタイズしていないピアにハードリセットを送信から予想される唯一の負の効果は、ピアが適切に関連する情報をログすることができないことであろう。"
    },
    {
      "indent": 3,
      "text": "Once the session is re-established, both BGP speakers SHOULD set their Forwarding State bit to 1. If the Forwarding State bit is not set, then, according to the procedures in Section 4.2 of [RFC4724], the relevant routes will be flushed, defeating the goals of this specification.",
      "ja": "セッションが再確立されると、両方のBGPスピーカはフォワーディング状態ビットが設定されていない場合、その後、[RFC4724]のセクション4.2の手順に従って、関連するルートは、フラッシュされる1への転送状態ビットを設定すべきですこの仕様の目標を撃破。"
    },
    {
      "indent": 0,
      "text": "4.1. Rules for the Receiving Speaker",
      "section_title": true,
      "ja": "4.1。受信スピーカーのルール"
    },
    {
      "indent": 3,
      "text": "Section 4.2 of [RFC4724] defines rules for the Receiving Speaker. This document modifies those rules as follows:",
      "ja": "[RFC4724]のセクション4.2は、受信スピーカーのための規則を定義します。次のようにこの文書では、これらのルールを変更します。"
    },
    {
      "indent": 3,
      "text": "The sentence \"To deal with possible consecutive restarts, a route (from the peer) previously marked as stale MUST be deleted\" only applies when the \"N\" bit has not been exchanged with the peer:",
      "ja": "「可能な連続的な再起動に対処するために、以前に失効としてマーク（ピアから）経路を削除する必要があります」文は、「N」ビットは、ピアと交換されていない場合に適用されます。"
    },
    {
      "indent": 3,
      "text": "OLD: When the Receiving Speaker detects termination of the TCP session for a BGP session with a peer that has advertised the Graceful Restart Capability, it MUST retain the routes received from the peer for all the address families that were previously received in the Graceful Restart Capability and MUST mark them as stale routing information. To deal with possible consecutive restarts, a route (from the peer) previously marked as stale MUST be deleted. The router MUST NOT differentiate between stale and other routing information during forwarding.",
      "ja": "OLD：受信スピーカーは、グレースフルリスタート機能をアドバタイズしたピアとのBGPセッションのためのTCPセッションの終了を検出すると、それは以前にグレースフルリスタート機能で受信したすべてのアドレスファミリのためのピアから受信したルートを保有しなければなりませんそして古いルーティング情報としてそれらをマークする必要があります。可能な連続的な再起動に対処するために、以前に失効としてマーク（ピアから）経路を削除する必要があります。ルータは、転送中に古いと他のルーティング情報を区別してはなりません。"
    },
    {
      "indent": 3,
      "text": "NEW: When the Receiving Speaker detects termination of the TCP session for a BGP session with a peer that has advertised the Graceful Restart Capability, it MUST retain the routes received from the peer for all the address families that were previously received in the Graceful Restart Capability and MUST mark them as stale routing information. The router MUST NOT differentiate between stale and other routing information during forwarding. If the \"N\" bit has not been exchanged with the peer, then to deal with possible consecutive restarts, a route (from the peer) previously marked as stale MUST be deleted.",
      "ja": "NEW：受信スピーカーは、グレースフルリスタート機能をアドバタイズしたピアとのBGPセッションのためのTCPセッションの終了を検出すると、それは以前にグレースフルリスタート機能で受信したすべてのアドレスファミリのためのピアから受信したルートを保有しなければなりませんそして古いルーティング情報としてそれらをマークする必要があります。ルータは、転送中に古いと他のルーティング情報を区別してはなりません。 「N」ビットは、ピアと交換されていない場合には、可能な連続再起動に対処するために、以前に失効としてマーク（ピアから）経路を削除する必要があります。"
    },
    {
      "indent": 3,
      "text": "The stale timer is given a formal name and made mandatory:",
      "ja": "古いタイマーは、正式名称を与え、義務化されています。"
    },
    {
      "indent": 3,
      "text": "OLD: To put an upper bound on the amount of time a router retains the stale routes, an implementation MAY support a (configurable) timer that imposes this upper bound.",
      "ja": "OLD：時間の量に上限を配置するには、ルータが古いルートを保持し、実装は、この上限を課して（設定可能）タイマーをサポートするかもしれません。"
    },
    {
      "indent": 3,
      "text": "NEW: To put an upper bound on the amount of time a router retains the stale routes, an implementation MUST support a (configurable) timer, called the \"stale timer\", that imposes this upper bound. A suggested default value for the stale timer is 180 seconds. An implementation MAY provide the option to disable the timer (i.e., to provide an infinite retention time) but MUST NOT do so by default.",
      "ja": "NEWは：ルータが古いルートを保持し、実装が（設定可能）タイマーをサポートしなければならない時間の量に上限を配置するには、この上限を課し「古いタイマー」と呼ばれます。古いタイマーの推奨デフォルト値は180秒です。実装は、タイマーを無効にするオプションを提供してもよい（MAY）（すなわち、無限の保持時間を提供するために）が、デフォルトではそうはなりません。"
    },
    {
      "indent": 0,
      "text": "5. Use of Hard Reset",
      "section_title": true,
      "ja": "ハードリセットの5."
    },
    {
      "indent": 0,
      "text": "5.1. When to Send a Hard Reset",
      "section_title": true,
      "ja": "5.1。ハードリセットを送信するとき"
    },
    {
      "indent": 3,
      "text": "Although when to send a Hard Reset is an implementation-specific decision, we offer some advice. Many Cease NOTIFICATION subcodes represent permanent or long-term, rather than transient, session termination. Because of this, it's appropriate to use Hard Reset with them. As of publication of this document, subcodes 1-9 have been defined for Cease. The following table lists each of these subcodes along with suggested behavior.",
      "ja": "ハードリセットを送信するときが実装固有の決定で、我々はいくつかのアドバイスを提供します。多くのシーズ通知サブコードは、恒久的または長期的ではなく、過渡、セッションの終了を表します。このため、それは彼らとハードリセットを使用するのが適切です。本書の出版の時点では、サブコード1-9は、シーズのために定義されています。次の表は、提案行動と一緒にこれらのサブコードのそれぞれを示しています。"
    },
    {
      "indent": 3,
      "text": "+-------+------------------------------------+----------------------+\n| Value |                Name                |  Suggested Behavior  |\n+-------+------------------------------------+----------------------+\n|   1   | Maximum Number of Prefixes Reached |      Hard Reset      |\n|   2   |      Administrative Shutdown       |      Hard Reset      |\n|   3   |         Peer De-configured         |      Hard Reset      |\n|   4   |        Administrative Reset        | Provide user control |\n|   5   |        Connection Rejected         |    Graceful Cease    |\n|   6   |     Other Configuration Change     |    Graceful Cease    |\n|   7   |  Connection Collision Resolution   |    Graceful Cease    |\n|   8   |          Out of Resources          |    Graceful Cease    |\n|   9   |             Hard Reset             |      Hard Reset      |\n+-------+------------------------------------+----------------------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "These suggestions are only that -- suggestions, not requirements. It's the nature of BGP implementations that the mapping of internal states to BGP NOTIFICATION codes and subcodes is not always perfect. The guiding principle for the implementor should be that if there is no realistic hope that forwarding can continue or that the session will be re-established within the deadline, Hard Reset should be used.",
      "ja": "提案ではなく、要件 - これらの提案は、それだけです。これは、BGP通知コードとサブコードの内部状態のマッピングは常に完璧ではないBGP実装の本質です。実装のための指針となる原則は、転送が継続するか、セッションが期限内に再確立されることができることを現実的な希望がない場合は、ハードリセットを使用することでなければなりません。"
    },
    {
      "indent": 3,
      "text": "For all NOTIFICATION codes other than Cease, use of Hard Reset does not appear to be indicated.",
      "ja": "シーズ以外のすべての通知コードの場合、ハードリセットの使用が示されているように見えません。"
    },
    {
      "indent": 0,
      "text": "5.2. Interaction with Other Specifications",
      "section_title": true,
      "ja": "5.2。その他の仕様との相互作用"
    },
    {
      "indent": 3,
      "text": "\"BGP Administrative Shutdown Communication\" [RFC8203] specifies use of the data portion of the Administrative Shutdown or Administrative Reset subcodes to convey a short message. When [RFC8203] is used in conjunction with Hard Reset, the subcode of the outermost Cease MUST be Hard Reset, with the Administrative Shutdown or Administrative Reset subcodes encapsulated within. The encapsulated message MUST subsequently be processed according to [RFC8203].",
      "ja": "「BGP管理シャットダウン通信」[RFC8203]は、ショートメッセージを伝達する管理シャットダウンまたは管理リセットサブコードのデータ部分の使用を指定します。 [RFC8203]はハードリセットと組み合わせて使用​​される場合、最も外側のシーズのサブコード内に封入管理シャットダウンまたは管理リセットサブコードと、ハードリセットする必要があります。カプセル化されたメッセージは、その後、[RFC8203]に従って処理されなければなりません。"
    },
    {
      "indent": 0,
      "text": "6. Management Considerations",
      "section_title": true,
      "ja": "6.管理に関する注意事項"
    },
    {
      "indent": 3,
      "text": "When reporting a Hard Reset to network management, the error code and subcode reported MUST be Cease and Hard Reset, respectively. If the network management layer in use permits it, the information carried in the Data portion SHOULD be reported as well.",
      "ja": "管理をネットワークにハードリセットを報告する際、報告されたエラーコードとサブコードは、それぞれ、中止し、ハードリセットする必要があります。使用中のネットワーク管理層がそれを許可する場合、データ部に搬送される情報は、同様に報告してください。"
    },
    {
      "indent": 0,
      "text": "7. Operational Considerations",
      "section_title": true,
      "ja": "7.運用に関する注意事項"
    },
    {
      "indent": 3,
      "text": "Note that long (or infinite) retention time may cause operational issues and should be enabled with care.",
      "ja": "長い（または無限）の保持時間は、運用上の問題を引き起こす可能性があり、注意して有効にする必要があることに注意してください。"
    },
    {
      "indent": 0,
      "text": "8. IANA Considerations",
      "section_title": true,
      "ja": "8. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has assigned subcode 9 (\"Hard Reset\") in the \"BGP Cease NOTIFICATION message subcodes\" registry.",
      "ja": "IANAは、「BGP通知メッセージのサブコードを停止」レジストリにサブコード9（「ハードリセット」）を割り当てています。"
    },
    {
      "indent": 3,
      "text": "IANA has created a sub-registry called \"BGP Graceful Restart Flags\" under the \"Border Gateway Protocol (BGP) Parameters\" registry. The registration procedure is Standards Action [RFC8126]; this document and [RFC4724] are listed as references. The initial values are as follows:",
      "ja": "IANAは、「ボーダーゲートウェイプロトコル（BGP）のパラメータ」レジストリの下に「BGPグレースフルリスタートフラグ」と呼ばれるサブレジストリを作成しました。登録手続きは、標準アクション[RFC8126]です。このドキュメントと[RFC4724]は参照として記載されています。次のように初期値は次のとおりです。"
    },
    {
      "indent": 9,
      "text": "+--------------+---------------+------------+-----------+\n| Bit Position |      Name     | Short Name | Reference |\n+--------------+---------------+------------+-----------+\n|      0       | Restart State |     R      |  RFC 4724 |\n|      1       |  Notification |     N      |  RFC 8538 |\n|     2-3      |   Unassigned  |            |           |\n+--------------+---------------+------------+-----------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "IANA has created a sub-registry called \"BGP Graceful Restart Flags for Address Family\" under the \"Border Gateway Protocol (BGP) Parameters\" registry. The registration procedure is Standards Action; this document and [RFC4724] are listed as references. The initial values are as follows:",
      "ja": "IANAは、「ボーダーゲートウェイプロトコル（BGP）のパラメータ」レジストリの下に「アドレスファミリのBGPグレースフルリスタートフラグ」と呼ばれるサブレジストリを作成しました。登録手続きは、標準アクションです。このドキュメントと[RFC4724]は参照として記載されています。次のように初期値は次のとおりです。"
    },
    {
      "indent": 7,
      "text": "+--------------+------------------+------------+-----------+\n| Bit Position |       Name       | Short Name | Reference |\n+--------------+------------------+------------+-----------+\n|      0       | Forwarding State |     F      |  RFC 4724 |\n|     1-7      |    Unassigned    |            |           |\n+--------------+------------------+------------+-----------+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "9. Security Considerations",
      "section_title": true,
      "ja": "9.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "This specification doesn't change the basic security model inherent in [RFC4724], with the exception that the protection against repeated resets is relaxed. To mitigate the consequent risk that an attacker could use repeated session resets to prevent stale routes from ever being deleted, we make the stale timer mandatory (in practice, it is already ubiquitous). To the extent [RFC4724] might be said to help defend against denials of service by making the control plane more resilient, this extension may modestly increase that resilience; however, there are enough confounding and deployment-specific factors that no general claims can be made.",
      "ja": "この仕様は、繰り返しリセットに対する保護が緩和されていることを除いて、[RFC4724]に固有の基本的なセキュリティモデルを変更しません。攻撃者はこれまでに削除されるの古いルートを防ぐために、繰り返しセッションのリセットを使用することができ、その結果としてリスクを軽減するために、我々は、（実際に、それはすでにユビキタスである）古いタイマーが必須となります。程度に[RFC4724]は、制御プレーンは、より弾力ことによりサービスの拒否を防御に役立つと言われるかもしれない、この拡張は控えめその弾力性を増加させることができます。しかし、一般的な主張がなされていないことができ、十分な交絡と展開固有の要因があります。"
    },
    {
      "indent": 0,
      "text": "10. References",
      "section_title": true,
      "ja": "10.参考文献"
    },
    {
      "indent": 0,
      "text": "10.1. Normative References",
      "section_title": true,
      "ja": "10.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <https://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<https://www.rfc-editor.org/info/ RFC2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC4271] Rekhter, Y., Ed., Li, T., Ed., and S. Hares, Ed., \"A Border Gateway Protocol 4 (BGP-4)\", RFC 4271, DOI 10.17487/RFC4271, January 2006, <https://www.rfc-editor.org/info/rfc4271>.",
      "ja": "[RFC4271] Rekhter、Y.、エド。、李、T.、エド。、およびS.野兎、編、 \"ボーダーゲートウェイプロトコル4（BGP-4）\"、RFC 4271、DOI 10.17487 / RFC4271、2006年1月、<https://www.rfc-editor.org/info/rfc4271>。"
    },
    {
      "indent": 3,
      "text": "[RFC4724] Sangli, S., Chen, E., Fernando, R., Scudder, J., and Y. Rekhter, \"Graceful Restart Mechanism for BGP\", RFC 4724, DOI 10.17487/RFC4724, January 2007, <https://www.rfc-editor.org/info/rfc4724>.",
      "ja": "[RFC4724]サングリ、S.、チェン、E.、フェルナンド、R.、スカダー、J.、およびY. Rekhter、 \"BGPのためのグレースフルリスタート機構\"、RFC 4724、DOI 10.17487 / RFC4724、2007年1月、<HTTPS： //www.rfc-editor.org/info/rfc4724>。"
    },
    {
      "indent": 3,
      "text": "[RFC8174] Leiba, B., \"Ambiguity of Uppercase vs Lowercase in RFC 2119 Key Words\", BCP 14, RFC 8174, DOI 10.17487/RFC8174, May 2017, <https://www.rfc-editor.org/info/rfc8174>.",
      "ja": "[RFC8174] Leiba、B.、 \"RFC 2119個のキーワードに小文字VS大文字の曖昧さ\"、BCP 14、RFC 8174、DOI 10.17487 / RFC8174、2017年5月、<https://www.rfc-editor.org/info/ rfc8174>。"
    },
    {
      "indent": 3,
      "text": "[RFC8203] Snijders, J., Heitz, J., and J. Scudder, \"BGP Administrative Shutdown Communication\", RFC 8203, DOI 10.17487/RFC8203, July 2017, <https://www.rfc-editor.org/info/rfc8203>.",
      "ja": "[RFC8203] Snijdersの、J.、ハイツ、J.、およびJ.スカダー、 \"BGP管理シャットダウンコミュニケーション\"、RFC 8203、DOI 10.17487 / RFC8203、2017年7月、<https://www.rfc-editor.org/info / rfc8203>。"
    },
    {
      "indent": 0,
      "text": "10.2. Informative References",
      "section_title": true,
      "ja": "10.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC8126] Cotton, M., Leiba, B., and T. Narten, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 8126, DOI 10.17487/RFC8126, June 2017, <https://www.rfc-editor.org/info/rfc8126>.",
      "ja": "[RFC8126]綿、M.、Leiba、B.、およびT. Narten氏、 \"RFCsにIANA問題部に書くためのガイドライン\"、BCP 26、RFC 8126、DOI 10.17487 / RFC8126、2017年6月、<https：//でWWW .rfc-editor.org /情報/ rfc8126>。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Jim Uttaro for the suggestion. The authors would also like to thank Emmanuel Baccelli, Bruno Decraene, Chris Hall, Warren Kumari, Paul Mattes, Robert Raszuk, and Alvaro Retana for their reviews and comments.",
      "ja": "著者は提案のためにジムUttaroに感謝したいと思います。著者はまた、彼らのレビューとコメントのためにエマニュエルBaccelli、ブルーノDecraene、クリス・ホール、ウォーレン・クマリ、ポール・マッテス、ロバートRaszuk、そしてアルバロRetanaに感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Keyur Patel Arrcus",
      "ja": "Keyurパテルrarkyusa"
    },
    {
      "indent": 3,
      "text": "Email: keyur@arrcus.com",
      "ja": "メール：keyur@arrcus.com"
    },
    {
      "indent": 3,
      "text": "Rex Fernando Cisco Systems 170 W. Tasman Drive San Jose, CA 95134 United States of America",
      "ja": "レックスフェルナンドシスコシステムズ170 W.タスマン・ドライブサンノゼ、CAアメリカの95134米国"
    },
    {
      "indent": 3,
      "text": "Email: rex@cisco.com",
      "ja": "メール：rex@cisco.com"
    },
    {
      "indent": 3,
      "text": "John Scudder Juniper Networks 1194 N. Mathilda Ave Sunnyvale, CA 94089 United States of America",
      "ja": "ジョン・スカダージュニパーネットワークスの1194 N.マチルダアベニューアメリカのカリフォルニア州サニーベール94089米国"
    },
    {
      "indent": 3,
      "text": "Email: jgs@juniper.net",
      "ja": "メール：jgs@juniper.net"
    },
    {
      "indent": 3,
      "text": "Jeff Haas Juniper Networks 1194 N. Mathilda Ave Sunnyvale, CA 94089 United States of America",
      "ja": "ジェフ・ハースジュニパーネットワークスの1194 N.マチルダアベニューアメリカのカリフォルニア州サニーベール94089米国"
    },
    {
      "indent": 3,
      "text": "Email: jhaas@juniper.net",
      "ja": "メール：jhaas@juniper.net"
    }
  ]
}