{
  "title": {
    "text": "RFC 5689 - Extended MKCOL for Web Distributed Authoring and Versioning (WebDAV)",
    "ja": "RFC 5689 - Web分散オーサリングとバージョン管理（WebDAV）の拡張MKCOL"
  },
  "number": 5689,
  "created_at": "2019-10-27 13:25:52.830637+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                           C. Daboo\nRequest for Comments: 5689                                    Apple Inc.\nUpdates: 4791, 4918                                       September 2009\nCategory: Standards Track",
      "raw": true
    },
    {
      "indent": 2,
      "text": "Extended MKCOL for Web Distributed Authoring and Versioning (WebDAV)",
      "ja": "Web分散オーサリングとバージョン管理（WebDAV）の拡張MKCOL"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This specification extends the Web Distributed Authoring and Versioning (WebDAV) MKCOL (Make Collection) method to allow collections of arbitrary resourcetype to be created and to allow properties to be set at the same time.",
      "ja": "この仕様は、Web分散オーサリングとバージョン管理（WebDAV）MKCOL任意resourcetypeののコレクションを作成することを可能にするとプロパティを同時に設定することができるようにする（コレクションを作る）メソッドを拡張します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2009 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2009 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクション4.eに記載されており、BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 3,
      "text": "This document may contain material from IETF Documents or IETF Contributions published or made publicly available before November 10, 2008. The person(s) controlling the copyright in some of this material may not have granted the IETF Trust the right to allow modifications of such material outside the IETF Standards Process. Without obtaining an adequate license from the person(s) controlling the copyright in such materials, this document may not be modified outside the IETF Standards Process, and derivative works of it may not be created outside the IETF Standards Process, except to format it for publication as an RFC or to translate it into languages other than English.",
      "ja": "この材料の一部がIETFトラストにこのような材料の変更を許可する権利を与えられていない可能性がありますにこの文書は、2008年、IETFドキュメントまたは11月10日以前に発行または公開さIETF貢献から著作権を支配する者（複数可）材料を含んでいてもよいですIETF標準化プロセスの外。そのような材料の著作権を管理者（単数または複数）から適切なライセンスを取得することなく、この文書は、IETF標準化過程の外側修正されないかもしれません、そして、それの派生物は、IETF標準化過程の外側に作成されない場合があり、それをフォーマットする以外出版RFCとして、英語以外の言語に翻訳します。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  3\n2.  Conventions Used in This Document  . . . . . . . . . . . . . .  3\n3.  WebDAV Extended MKCOL  . . . . . . . . . . . . . . . . . . . .  4\n  3.1.  Extended MKCOL Support . . . . . . . . . . . . . . . . . .  5\n    3.1.1.  Example: Using OPTIONS for the Discovery of\n            Support for Extended MKCOL . . . . . . . . . . . . . .  5\n  3.2.  Status Codes . . . . . . . . . . . . . . . . . . . . . . .  5\n  3.3.  Additional Precondition for Extended MKCOL . . . . . . . .  5\n  3.4.  Example: Successful Extended MKCOL Request . . . . . . . .  6\n  3.5.  Example: Unsuccessful Extended MKCOL Request . . . . . . .  6\n4.  Using Extended MKCOL as an Alternative for MKxxx Methods . . .  8\n  4.1.  MKCALENDAR Alternative . . . . . . . . . . . . . . . . . .  8\n    4.1.1.  Example: Using MKCOL Instead of MKCALENDAR . . . . . .  8\n5.  XML Element Definitions  . . . . . . . . . . . . . . . . . . . 10\n  5.1.  mkcol XML Element  . . . . . . . . . . . . . . . . . . . . 10\n  5.2.  mkcol-response XML Element . . . . . . . . . . . . . . . . 10\n6.  Security Considerations  . . . . . . . . . . . . . . . . . . . 11\n7.  Acknowledgments  . . . . . . . . . . . . . . . . . . . . . . . 11\n8.  Normative References . . . . . . . . . . . . . . . . . . . . . 11",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "WebDAV [RFC4918] defines the HTTP [RFC2616] method MKCOL. This method is used to create WebDAV collections on the server. However, several WebDAV-based specifications (e.g., CalDAV [RFC4791]) define \"special\" collections -- ones that are identified by additional values in the DAV:resourcetype property assigned to the collection resource or by other means. These \"special\" collections are created by new methods (e.g., MKCALENDAR). The addition of a new MKxxx method for each new \"special\" collection adds to server complexity and is detrimental to overall reliability due to the need to make sure intermediaries are aware of these methods.",
      "ja": "WebDAVの[RFC4918]はHTTP [RFC2616]メソッドMKCOLを定義します。このメソッドは、サーバー上のWebDAVコレクションを作成するために使用されます。 resourcetypeのプロパティコレクションリソースにまたは他の手段によって割り当てられた：DAVに追加の値によって識別されるもの - しかし、いくつかのWebDAVベースの仕様（例えば、のCalDAVは、[RFC4791]）は、「特別な」コレクションを定義します。これらの「特別な」コレクションは、新たな方法（例えば、MKCALENDAR）によって作成されます。それぞれの新しい「特別な」コレクションの新しいMKxxx方法の追加が原因必ず仲介業者は、これらの方法を知っているようにする必要があるため、サーバの複雑にし、全体的な信頼性に有害です。"
    },
    {
      "indent": 3,
      "text": "This specification defines an extension to the WebDAV MKCOL method that adds a request body allowing a client to specify WebDAV properties to be set on the newly created collection or resource. In particular, the DAV:resourcetype property can be used to create a \"special\" collection; alternatively, other properties can be used to create a \"special\" resource. This avoids the need to invent new MKxxx methods.",
      "ja": "この仕様は、クライアントが新たに作成されたコレクションまたはリソースに設定するのWebDAVプロパティを指定できるようにリクエストボディを追加するWebDAVのMKCOLメソッドに拡張を定義します。具体的には、DAV：resourcetypeのプロパティは、「特別な」コレクションを作成するために使用することができます。代わりに、他のプロパティは、「特別な」リソースを作成するために使用することができます。これは、新しいMKxxx方法を考案する必要がありません。"
    },
    {
      "indent": 0,
      "text": "2. Conventions Used in This Document",
      "section_title": true,
      "ja": "この文書で使用される2.表記"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 3,
      "text": "This document uses XML DTD fragments (Section 3.2 of [W3C.REC-xml-20081126]) as a purely notational convention. WebDAV request and response bodies cannot be validated by a DTD due to the specific extensibility rules defined in Section 17 of [RFC4918] and due to the fact that all XML elements defined by this specification use the XML namespace name \"DAV:\". In particular:",
      "ja": "この文書では、純粋な表記規則として（[W3C.REC-XML-20081126]のセクション3.2）XML DTDの断片を使用しています。 WebDAVの要求と応答体が原因[RFC4918]のセクション17で定義された特定の拡張ルールに起因し、この仕様で定義されたすべてのXML要素は、XML名前空間名「DAV：」を使用しているという事実にDTDで検証することはできません。特に："
    },
    {
      "indent": 3,
      "text": "1. Element names use the \"DAV:\" namespace.",
      "section_title": true,
      "ja": "名前空間：1.要素名は「DAV」を使用します。"
    },
    {
      "indent": 3,
      "text": "2. Element ordering is irrelevant unless explicitly stated.",
      "section_title": true,
      "ja": "明示的に述べない限り、2要素の順序は関係ありません。"
    },
    {
      "indent": 3,
      "text": "3. Extension elements (elements not already defined as valid child elements) may be added anywhere, except when explicitly stated otherwise.",
      "ja": "3.拡張要素（すでに有効な子要素として定義されていない要素が）特に明記する場合を除いて、どこにでも追加することができます。"
    },
    {
      "indent": 3,
      "text": "4. Extension attributes (attributes not already defined as valid for this element) may be added anywhere, except when explicitly stated otherwise.",
      "ja": "4.拡張属性が（すでにこの要素に対して有効と定義されていない属性）特に明記する場合を除いて、どこにでも追加することができます。"
    },
    {
      "indent": 3,
      "text": "When an XML element type in the \"DAV:\" namespace is referenced in this document outside of the context of an XML fragment, the string \"DAV:\" will be prefixed to the element type.",
      "ja": "XML要素タイプが「DAV：」名前空間は、XMLフラグメントのコンテキストの外側この文書で参照され、文字列「DAVは、」要素タイプに前置されます。"
    },
    {
      "indent": 3,
      "text": "This document inherits, and sometimes extends, DTD productions from Section 14 of [RFC4918].",
      "ja": "この文書は、継承、及び時々延び、[RFC4918]のセクション14からDTD制作。"
    },
    {
      "indent": 0,
      "text": "3. WebDAV Extended MKCOL",
      "section_title": true,
      "ja": "3. WebDAVの拡張MKCOL"
    },
    {
      "indent": 3,
      "text": "The WebDAV MKCOL request is extended to allow the inclusion of a request body. The request body is an XML document containing a single DAV:mkcol XML element as the root element. The Content-Type request header MUST be set appropriately for an XML body (e.g., set to \"text/xml\" or \"application/xml\"). XML-typed bodies for an MKCOL request that do not have DAV:mkcol as the root element are reserved for future usage.",
      "ja": "WebDAVのMKCOL要求は、リクエストボディの包含を可能にするように拡張されます。ルート要素としてMKCOL XML要素：リクエストボディは、単一のDAVを含むXML文書です。 Content-Typeの要求ヘッダ（例えば、「text / xmlで」または「アプリケーション/ XML」に設定される）XML本体用に適切に設定しなければなりません。ルート要素は、将来の使用のために予約されているようMKCOL：DAVを持っていないMKCOL要求のためのXML型指定された団体。"
    },
    {
      "indent": 3,
      "text": "One or more DAV:set XML elements may be included in the DAV:mkcol XML element to allow setting properties on the collection as it is created. In particular, to create a collection of a particular type, the DAV:resourcetype XML element MUST be included in a DAV:set XML element and MUST specify the expected resource type elements for the new resource, which MUST include the DAV:collection element that needs to be present for any WebDAV collection.",
      "ja": "一つ以上のDAV：それが作成されると、コレクションにプロパティを設定できるようにMKCOL XML要素：設定XML要素は、DAVに含めることができます。具体的には、特定のタイプのコレクション、DAV作成する：resourcetypeのXML要素をDAVに含まれなければならない：XML要素を設定し、DAVを含まなければなりません新しいリソースの予想リソースタイプの要素を指定する必要がありますコレクション要素その任意のWebDAVコレクションのために存在する必要があります。"
    },
    {
      "indent": 3,
      "text": "As per the PROPPATCH method (Section 9.2 of [RFC4918]), servers MUST process any DAV:set instructions in document order (an exception to the normal rule that ordering is irrelevant). If any one instruction fails to execute successfully, all instructions MUST fail (i.e., either all succeed or all fail). Thus, if any error occurs during processing, all executed instructions MUST be undone and a proper error result returned. Failure to set a property value on the collection MUST result in a failure of the overall MKCOL request -- i.e., the collection is not created.",
      "ja": "PROPPATCH方法（[RFC4918]のセクション9.2）に従って、サーバは、任意のDAVを処理しなければなりません。文書順（順序は無関係である通常の規則の例外）で設定された命令。いずれかの命令が正常に実行に失敗した場合は、すべての命令は（すなわち、いずれかのすべての成功またはすべて失敗）失敗しなければなりません。任意の処理中にエラーが発生した場合従って、全て実行された命令を元に戻すと、適切なエラー結果を返さなければなりません。コレクションにプロパティ値を設定しないと、全体的なMKCOL要求の失敗をもたらさなければなりません - すなわち、コレクションが作成されません。"
    },
    {
      "indent": 3,
      "text": "The response to an extended MKCOL request MUST be an XML document containing a single DAV:mkcol-response XML element, which MUST contain DAV:propstat XML elements with the status of each property when the request fails due to a failure to set one or more of the properties specified in the request body. The server MAY return a response body in the case where the request is successful, indicating success for setting each property specified in the request body. When an empty response body is returned with a success request status code, the client can assume that all properties were set.",
      "ja": "リクエストは、1つまたは複数を設定するための故障による失敗したときに各プロパティの状態でpropstat XML要素：DAVを含まなければならないMKCOL応答XML要素：拡張MKCOL要求に対する応答は、単一のDAVを含むXML文書でなければなりませんリクエストボディで指定されたプロパティの。サーバがリクエストボディで指定された各プロパティを設定するための成功を示す、要求が成功した場合のレスポンスボディを返す場合があります。空のレスポンスボディが成功要求のステータスコードを返されると、クライアントは、すべてのプロパティが設定されたと仮定することができます。"
    },
    {
      "indent": 3,
      "text": "In all other respects, the behavior of the extended MKCOL request follows that of the standard MKCOL request.",
      "ja": "他のすべての点では、拡張されたMKCOL要求の挙動は標準MKCOL要求のそれに従います。"
    },
    {
      "indent": 0,
      "text": "3.1. Extended MKCOL Support",
      "section_title": true,
      "ja": "3.1。拡張MKCOLサポート"
    },
    {
      "indent": 3,
      "text": "A server supporting the features described in this document MUST include \"extended-mkcol\" as a field in the DAV response header from an OPTIONS request on any URI that supports use of the extended MKCOL method.",
      "ja": "この文書で説明する機能をサポートしているサーバは、拡張MKCOLメソッドの使用をサポートする任意のURIにOPTIONS要求からDAVレスポンスヘッダ内のフィールドとして、「拡張MKCOL」を含まなければなりません。"
    },
    {
      "indent": 0,
      "text": "3.1.1. Example: Using OPTIONS for the Discovery of Support for Extended MKCOL",
      "ja": "3.1.1。例：拡張MKCOLのサポートの発見のためのオプションを使用して"
    },
    {
      "indent": 3,
      "text": ">> Request <<",
      "ja": ">>リクエスト<<"
    },
    {
      "indent": 3,
      "text": "OPTIONS /addressbooks/users/ HTTP/1.1 Host: addressbook.example.com",
      "ja": "OPTIONS /アドレス帳/ユーザー/ HTTP / 1.1ホスト：addressbook.example.com"
    },
    {
      "indent": 3,
      "text": ">> Response <<",
      "ja": ">>回答<<"
    },
    {
      "indent": 3,
      "text": "HTTP/1.1 200 OK Allow: OPTIONS, GET, HEAD, POST, PUT, DELETE, TRACE, COPY, MOVE Allow: MKCOL, PROPFIND, PROPPATCH, LOCK, UNLOCK, REPORT, ACL DAV: 1, 2, 3, access-control, extended-mkcol Date: Sat, 11 Nov 2006 09:32:12 GMT Content-Length: 0",
      "ja": "HTTP / 1.1 200 OKを許可：OPTIONS、GET、HEAD、POST、PUT、DELETE、TRACE、COPY、MOVEを許可：MKCOL、PROPFIND、PROPPATCH、LOCKを、UNLO​​CK、REPORT、ACL DAV：1、2、3、アクセス制御を、拡張MKCOL日：土、2006年11月11日9時32分12秒GMTのコンテンツの長さ：0"
    },
    {
      "indent": 0,
      "text": "3.2. Status Codes",
      "section_title": true,
      "ja": "3.2。ステータスコード"
    },
    {
      "indent": 3,
      "text": "As per Section 9.3.1 of [RFC4918].",
      "ja": "[RFC4918]のセクション9.3.1あたりとして。"
    },
    {
      "indent": 0,
      "text": "3.3. Additional Precondition for Extended MKCOL",
      "section_title": true,
      "ja": "3.3。拡張MKCOLのための追加の前提条件"
    },
    {
      "indent": 3,
      "text": "WebDAV ([RFC4918], Section 16) defines preconditions and postconditions for request behavior. This specification adds the following precondition for the extended MKCOL request.",
      "ja": "WebDAVの（[RFC4918]、セクション16）は、要求の動作のための前提条件および事後条件を定義します。この仕様は、拡張MKCOL要求のために、次の前提条件が追加されます。"
    },
    {
      "indent": 3,
      "text": "Name: valid-resourcetype",
      "ja": "名前：有効-resourcetypeの"
    },
    {
      "indent": 3,
      "text": "Namespace: DAV:",
      "ja": "名前空間：DAV："
    },
    {
      "indent": 3,
      "text": "Use with: Typically 403 (Forbidden)",
      "ja": "使用します。通常は403（禁止）"
    },
    {
      "indent": 3,
      "text": "Purpose: (precondition) -- The server MUST support the specified resourcetype value for the specified collection.",
      "ja": "目的：（前提条件） - サーバーは、指定されたコレクションのために指定されたresourcetypeの値をサポートしなければなりません。"
    },
    {
      "indent": 0,
      "text": "3.4. Example: Successful Extended MKCOL Request",
      "section_title": true,
      "ja": "3.4。例：成功した拡張MKCOLリクエスト"
    },
    {
      "indent": 3,
      "text": "This example shows how the extended MKCOL request is used to create a collection of a fictitious type \"special-resource\". The response body is empty as the request completed successfully.",
      "ja": "この例では、拡張MKCOL要求は架空のタイプ「特殊リソース」のコレクションを作成するために使用される方法を示しています。要求が正常に完了してレスポンスボディは空です。"
    },
    {
      "indent": 3,
      "text": ">> Request <<",
      "ja": ">>リクエスト<<"
    },
    {
      "indent": 3,
      "text": "MKCOL /home/special/ HTTP/1.1 Host: special.example.com Content-Type: application/xml; charset=\"utf-8\" Content-Length: xxxx",
      "ja": "MKCOL /ホーム/特別/ HTTP / 1.1ホスト：special.example.comのContent-Type：アプリケーション/ xmlの; charset = \"UTF-8\" をコンテンツの長さ：XXXX"
    },
    {
      "indent": 3,
      "text": "<?xml version=\"1.0\" encoding=\"utf-8\" ?> <D:mkcol xmlns:D=\"DAV:\" xmlns:E=\"http://example.com/ns/\"> <D:set> <D:prop> <D:resourcetype> <D:collection/> <E:special-resource/> </D:resourcetype> <D:displayname>Special Resource</D:displayname> </D:prop> </D:set> </D:mkcol>",
      "ja": "<？xml version = \"1.0\" エンコード= \"UTF-8\"？> <D：MKCOL用のxmlns：D = \"DAV：\" のxmlns：E = \"http://example.com/ns/\"> <D：セット> <D：小道具> <D：resourcetypeの> <D：コレクション/> <E：特殊リソース/> </ D：resourcetypeの> <D：のDisplayName>特殊リソース</ D：表示名> </ D：小道具> </ D：セット> </ D：MKCOL>"
    },
    {
      "indent": 3,
      "text": ">> Response <<",
      "ja": ">>回答<<"
    },
    {
      "indent": 3,
      "text": "HTTP/1.1 201 Created Cache-Control: no-cache Date: Sat, 11 Nov 2006 09:32:12 GMT",
      "ja": "HTTP / 1.1 201作成されたのCache-Control：キャッシュなし日付：土、2006年11月11日午前9時32分12秒GMT"
    },
    {
      "indent": 0,
      "text": "3.5. Example: Unsuccessful Extended MKCOL Request",
      "section_title": true,
      "ja": "3.5。例：失敗した拡張MKCOLリクエスト"
    },
    {
      "indent": 3,
      "text": "This example shows an attempt to use the extended MKCOL request to create a collection of a fictitious type \"special-resource\", which is not actually supported by the server. The response body shows that an error occurred specifically with the DAV:resourcetype property.",
      "ja": "この例では、実際には、サーバーでサポートされていない架空のタイプ「特殊資源」、のコレクションを作成するには、拡張MKCOL要求を使用しようとする試みを示しています。 resourcetypeのプロパティ：レスポンスボディは、エラーがDAVと特異的に発生したことを示しています。"
    },
    {
      "indent": 3,
      "text": ">> Request <<",
      "ja": ">>リクエスト<<"
    },
    {
      "indent": 3,
      "text": "MKCOL /home/special/ HTTP/1.1 Host: special.example.com Content-Type: application/xml; charset=\"utf-8\" Content-Length: xxxx",
      "ja": "MKCOL /ホーム/特別/ HTTP / 1.1ホスト：special.example.comのContent-Type：アプリケーション/ xmlの; charset = \"UTF-8\" をコンテンツの長さ：XXXX"
    },
    {
      "indent": 3,
      "text": "<?xml version=\"1.0\" encoding=\"utf-8\" ?> <D:mkcol xmlns:D=\"DAV:\" xmlns:E=\"http://example.com/ns/\"> <D:set> <D:prop> <D:resourcetype> <D:collection/> <E:special-resource/> </D:resourcetype> <D:displayname>Special Resource</D:displayname> </D:prop> </D:set> </D:mkcol>",
      "ja": "<？xml version = \"1.0\" エンコード= \"UTF-8\"？> <D：MKCOL用のxmlns：D = \"DAV：\" のxmlns：E = \"http://example.com/ns/\"> <D：セット> <D：小道具> <D：resourcetypeの> <D：コレクション/> <E：特殊リソース/> </ D：resourcetypeの> <D：のDisplayName>特殊リソース</ D：表示名> </ D：小道具> </ D：セット> </ D：MKCOL>"
    },
    {
      "indent": 3,
      "text": ">> Response <<",
      "ja": ">>回答<<"
    },
    {
      "indent": 3,
      "text": "HTTP/1.1 403 Forbidden Cache-Control: no-cache Date: Sat, 11 Nov 2006 09:32:12 GMT Content-Type: application/xml; charset=\"utf-8\" Content-Length: xxxx",
      "ja": "HTTP / 1.1 403禁止のCache-Control：キャッシュなし日付：土、2006年11月11日午前9時32分12秒GMTのコンテンツタイプ：アプリケーション/ xmlの; charset = \"UTF-8\" をコンテンツの長さ：XXXX"
    },
    {
      "indent": 3,
      "text": "<?xml version=\"1.0\" encoding=\"utf-8\" ?> <D:mkcol-response xmlns:D=\"DAV:\"> <D:propstat> <D:prop> <D:resourcetype/> </D:prop> <D:status>HTTP/1.1 403 Forbidden</D:status> <D:error><D:valid-resourcetype /></D:error> <D:responsedescription>Resource type is not supported by this server</D:responsedescription> </D:propstat> <D:propstat> <D:prop> <D:displayname/> </D:prop> <D:status>HTTP/1.1 424 Failed Dependency</D:status> </D:propstat> </D:mkcol-response>",
      "ja": "<？xml version = \"1.0\" エンコード= \"UTF-8\"？> <D：MKCOL応答のxmlns：D = \"DAV：\"> <D：propstat> <D：プロペラ> <D：resourcetypeの/> </ D：小道具> <D：状態禁断> HTTP / 1.1 403 </ D：状態> <D：エラー> <D：有効-resourcetypeの/> </ D：エラー> <D：responsedescription>リソースの種類はによってサポートされていません。このサーバー</ D：responsedescription> </ D：propstat> <D：propstat> <D：小道具> <D：DisplayNameに/> </ D：小道具> <D：状態> HTTP / 1.1 424失敗した依存</ D ：ステータス> </ D：propstat> </ D：MKCOL応答>"
    },
    {
      "indent": 0,
      "text": "4. Using Extended MKCOL as an Alternative for MKxxx Methods",
      "section_title": true,
      "ja": "4. MKxxx方法のための代替として拡張MKCOLを使用して"
    },
    {
      "indent": 3,
      "text": "One of the goals of this extension is to eliminate the need for other extensions to define their own variant of MKCOL to create the special collections they need. This extension can be used as an alternative to existing MKxxx methods in other extensions as detailed below. If a server supports this extension and the other extension listed, then the server MUST support use of the extended MKCOL method to achieve the same result as the MKxxx method of the other extension.",
      "ja": "この拡張の目標の一つは、彼らが必要とする特別なコレクションを作成するMKCOLの独自のバリアントを定義する他の拡張機能の必要性を排除することです。この拡張は、以下に詳述するように、他の拡張機能の既存MKxxx方法の代替として使用することができます。サーバーは、この拡張子と記載されている他の拡張機能をサポートしている場合、サーバは、他の拡張のMKxxx方法と同じ結果を達成するために、拡張MKCOLメソッドの使用をサポートしなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.1. MKCALENDAR Alternative",
      "section_title": true,
      "ja": "4.1。 MKCALENDARオルタナティブ"
    },
    {
      "indent": 3,
      "text": "CalDAV defines the MKCALENDAR method to create a calendar collection as well as to set properties during creation (Section 5.3.1 of [RFC4791]).",
      "ja": "CalDAVカレンダーコレクションを作成するだけでなく、作成（[RFC4791]のセクション5.3.1）の間にプロパティを設定するMKCALENDARメソッドを定義します。"
    },
    {
      "indent": 3,
      "text": "The extended MKCOL method can be used instead by specifying both DAV: collection and CALDAV:calendar-collection XML elements in the DAV: resourcetype property, set during the extended MKCOL request.",
      "ja": "コレクションとのCalDAV：DAVのカレンダー収集XML要素：resourcetypeのプロパティ、拡張MKCOL要求時に設定拡張MKCOL方法はDAVの両方を指定することにより、代わりに使用することができます。"
    },
    {
      "indent": 0,
      "text": "4.1.1. Example: Using MKCOL Instead of MKCALENDAR",
      "section_title": true,
      "ja": "4.1.1。例：MKCOLを使用する代わりにMKCALENDAR"
    },
    {
      "indent": 3,
      "text": "The first example below shows an MKCALENDAR request containing a CALDAV:mkcalendar XML element in the request body and returning a CALDAV:mkcalendar-response XML element in the response body.",
      "ja": "リクエストボディにmkcalendar XML要素とのCalDAV返す：応答体においてmkcalendar応答XML要素を第一の例は、以下のCalDAVを含むMKCALENDAR要求を示しています。"
    },
    {
      "indent": 3,
      "text": ">> MKCALENDAR Request <<",
      "ja": ">> MKCALENDARリクエスト<<"
    },
    {
      "indent": 3,
      "text": "MKCALENDAR /home/lisa/calendars/events/ HTTP/1.1 Host: calendar.example.com Content-Type: application/xml; charset=\"utf-8\" Content-Length: xxxx",
      "ja": "MKCALENDAR /ホーム/リサ/カレンダー/イベント/ HTTP / 1.1ホスト：calendar.example.comのContent-Type：アプリケーション/ xmlの; charset = \"UTF-8\" をコンテンツの長さ：XXXX"
    },
    {
      "indent": 3,
      "text": "<?xml version=\"1.0\" encoding=\"utf-8\" ?> <C:mkcalendar xmlns:D=\"DAV:\" xmlns:C=\"urn:ietf:params:xml:ns:caldav\"> <D:set> <D:prop> <D:displayname>Lisa's Events</D:displayname> </D:prop> </D:set> </C:mkcalendar>",
      "ja": "<？xml version = \"1.0\" エンコード= \"UTF-8\"？> <C：mkcalendar用のxmlns：D = \"DAV：\" のxmlns：C = \"URN：IETF：paramsは：XML：NS：のCalDAV\"> <D：設定> <D：小道具> <D：のDisplayName>リサのイベント</ D：表示名> </ D：小道具> </ D：設定> </ C：mk​​calendar>"
    },
    {
      "indent": 3,
      "text": ">> MKCALENDAR Response <<",
      "ja": ">> MKCALENDARレスポンス<<"
    },
    {
      "indent": 3,
      "text": "HTTP/1.1 201 Created Cache-Control: no-cache Date: Sat, 11 Nov 2006 09:32:12 GMT Content-Type: application/xml; charset=\"utf-8\" Content-Length: xxxx",
      "ja": "HTTP / 1.1 201作成されたのCache-Control：キャッシュなし日付：土、2006年11月11日午前9時32分12秒GMTのコンテンツタイプ：アプリケーション/ xmlの; charset = \"UTF-8\" をコンテンツの長さ：XXXX"
    },
    {
      "indent": 3,
      "text": "<?xml version=\"1.0\" encoding=\"utf-8\" ?> <C:mkcalendar-response xmlns:D=\"DAV:\" xmlns:C=\"urn:ietf:params:xml:ns:caldav\"> <D:propstat> <D:prop> <D:displayname/> </D:prop> <D:status>HTTP/1.1 200 OK</D:status> </D:propstat> </C:mkcalendar-response>",
      "ja": "<？xml version = \"1.0\" エンコード= \"UTF-8\"？> <C：mkcalendar応答のxmlns：D = \"DAV：\" のxmlns：C = \"URN：IETF：paramsは：XML：NS：のCalDAV\"> < D：propstat> <D：プロペラ> <D：表示名/> </ D：プロペラ> <D：ステータス> HTTP / 1.1 200 OK </ D：状態> </ D：propstat> </ C：mk​​calendar応答>"
    },
    {
      "indent": 3,
      "text": "The second example shows the equivalent extended MKCOL request with the same request and response XML elements.",
      "ja": "第二の例では、同じ要求および応答XML要素と同等の拡張MKCOL要求を示しています。"
    },
    {
      "indent": 3,
      "text": ">> MKCOL Request <<",
      "ja": ">> MKCOLリクエスト<<"
    },
    {
      "indent": 3,
      "text": "MKCOL /home/lisa/calendars/events/ HTTP/1.1 Host: calendar.example.com Content-Type: application/xml; charset=\"utf-8\" Content-Length: xxxx",
      "ja": "MKCOL /ホーム/リサ/カレンダー/イベント/ HTTP / 1.1ホスト：calendar.example.comのContent-Type：アプリケーション/ xmlの; charset = \"UTF-8\" をコンテンツの長さ：XXXX"
    },
    {
      "indent": 3,
      "text": "<?xml version=\"1.0\" encoding=\"utf-8\" ?> <D:mkcol xmlns:D=\"DAV:\" xmlns:C=\"urn:ietf:params:xml:ns:caldav\"> <D:set> <D:prop> <D:resourcetype> <D:collection/> <C:calendar/> </D:resourcetype> <D:displayname>Lisa's Events</D:displayname> </D:prop> </D:set> </D:mkcol>",
      "ja": "<？xml version = \"1.0\" エンコード= \"UTF-8\"？> <D：MKCOL用のxmlns：D = \"DAV：\" のxmlns：C = \"URN：IETF：paramsは：XML：NS：のCalDAV\"> <D：小道具> <D：resourcetypeの> <D：コレクション/> <C：カレンダー/> </ D：resourcetypeの> <D：のDisplayName>リサのイベント</ D：表示名> </ D：小道具> <> <Dセット/ D：セット> </ D：MKCOL>"
    },
    {
      "indent": 3,
      "text": ">> MKCOL Response <<",
      "ja": ">> MKCOLレスポンス<<"
    },
    {
      "indent": 3,
      "text": "HTTP/1.1 201 Created Cache-Control: no-cache Date: Sat, 11 Nov 2006 09:32:12 GMT Content-Type: application/xml; charset=\"utf-8\" Content-Length: xxxx",
      "ja": "HTTP / 1.1 201作成されたのCache-Control：キャッシュなし日付：土、2006年11月11日午前9時32分12秒GMTのコンテンツタイプ：アプリケーション/ xmlの; charset = \"UTF-8\" をコンテンツの長さ：XXXX"
    },
    {
      "indent": 3,
      "text": "<?xml version=\"1.0\" encoding=\"utf-8\" ?> <D:mkcol-response xmlns:D=\"DAV:\" xmlns:C=\"urn:ietf:params:xml:ns:caldav\"> <D:propstat> <D:prop> <D:resourcetype/> <D:displayname/> </D:prop> <D:status>HTTP/1.1 200 OK</D:status> </D:propstat> </D:mkcol-response>",
      "ja": "<？xml version = \"1.0\" エンコード= \"UTF-8\"？> <D：MKCOL応答のxmlns：D = \"DAV：\" のxmlns：C = \"URN：IETF：paramsは：XML：NS：のCalDAV\"> < D：propstat> <D：プロペラ> <D：resourcetypeの/> <D：表示名/> </ D：プロペラ> <D：ステータス> HTTP / 1.1 200 OK </ D：状態> </ D：propstat> < / D：MKCOL応答>"
    },
    {
      "indent": 0,
      "text": "5. XML Element Definitions",
      "section_title": true,
      "ja": "5. XML要素の定義"
    },
    {
      "indent": 0,
      "text": "5.1. mkcol XML Element",
      "section_title": true,
      "ja": "5.1。 MKCOL XML要素"
    },
    {
      "indent": 3,
      "text": "Name: mkcol",
      "ja": "名前：MKCOL"
    },
    {
      "indent": 3,
      "text": "Namespace: DAV:",
      "ja": "名前空間：DAV："
    },
    {
      "indent": 3,
      "text": "Purpose: Used in a request to specify properties to be set in an extended MKCOL request, as well as any additional information needed when creating the resource.",
      "ja": "目的：拡張MKCOL要求だけでなく、リソースを作成するときに必要な追加情報に設定するプロパティを指定する要求で使用されます。"
    },
    {
      "indent": 3,
      "text": "Description: This XML element is a container for the information required to modify the properties on a collection resource as it is created in an extended MKCOL request.",
      "ja": "説明：このXML要素は、それが拡張MKCOL要求で作成されるコレクションリソースのプロパティを変更するために必要な情報のコンテナです。"
    },
    {
      "indent": 3,
      "text": "Definition:",
      "ja": "定義："
    },
    {
      "indent": 7,
      "text": "<!ELEMENT mkcol (set+)>",
      "ja": "<！ELEMENTのMKCOL（セット+）>"
    },
    {
      "indent": 0,
      "text": "5.2. mkcol-response XML Element",
      "section_title": true,
      "ja": "5.2。 MKCOL応答XML要素"
    },
    {
      "indent": 3,
      "text": "Name: mkcol-response",
      "ja": "名前：MKCOL応答"
    },
    {
      "indent": 3,
      "text": "Namespace: DAV:",
      "ja": "名前空間：DAV："
    },
    {
      "indent": 3,
      "text": "Purpose: Used in a response to indicate the status of properties that were set or failed to be set during an extended MKCOL request.",
      "ja": "目的：拡張MKCOL要求時に設定されるように設定したか失敗したされたプロパティの状態を示す応答で使用されます。"
    },
    {
      "indent": 3,
      "text": "Description: This XML element is a container for the information returned about a resource that has been created in an extended MKCOL request.",
      "ja": "説明：このXML要素は、拡張MKCOL要求で作成されたリソースについて返される情報のコンテナです。"
    },
    {
      "indent": 3,
      "text": "Definition:",
      "ja": "定義："
    },
    {
      "indent": 7,
      "text": "<!ELEMENT mkcol-response (propstat+)>",
      "ja": "<！ELEMENTのMKCOL応答（propstat +）>"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "This extension does not introduce any new security concerns beyond those already described in HTTP [RFC2616] and WebDAV [RFC4918].",
      "ja": "この拡張は、すでにHTTP [RFC2616]とWebDAV [RFC4918]に記載されたものを越えた新たなセキュリティ上の懸念を導入していません。"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgments",
      "section_title": true,
      "ja": "7.謝辞"
    },
    {
      "indent": 3,
      "text": "Thanks to Bernard Desruisseaux, Mike Douglass, Alexey Melnikov, Julian Reschke, and Simon Vaillancourt.",
      "ja": "バーナードDesruisseaux、マイク・ダグラス、アレクセイ・メルニコフ、ジュリアンReschke、そしてサイモンVaillancourtに感謝します。"
    },
    {
      "indent": 0,
      "text": "8. Normative References",
      "section_title": true,
      "ja": "8.引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2616] Fielding, R., Gettys, J., Mogul, J., Frystyk, H., Masinter, L., Leach, P., and T. Berners-Lee, \"Hypertext Transfer Protocol -- HTTP/1.1\", RFC 2616, June 1999.",
      "ja": "[RFC2616]フィールディング、R.、ゲティス、J.、モーグル、J.、Frystyk、H.、Masinter、L.、リーチ、P.、およびT.バーナーズ - リー、 \"ハイパーテキスト転送プロトコル -  HTTP / 1.1\" 、RFC 2616、1999年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC4791] Daboo, C., Desruisseaux, B., and L. Dusseault, \"Calendaring Extensions to WebDAV (CalDAV)\", RFC 4791, March 2007.",
      "ja": "[RFC4791] Daboo、C.、Desruisseaux、B.、およびL. Dusseault、 \"WebDAVの（のCalDAV）にカレンダー拡張機能\"、RFC 4791、2007年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC4918] Dusseault, L., \"HTTP Extensions for Web Distributed Authoring and Versioning (WebDAV)\", RFC 4918, June 2007.",
      "ja": "[RFC4918] Dusseault、L.、RFC 4918、2007年6月 \"Web分散オーサリングとバージョン管理（WebDAV）のためのHTTP拡張機能\"。"
    },
    {
      "indent": 3,
      "text": "[W3C.REC-xml-20081126] Maler, E., Yergeau, F., Paoli, J., Bray, T., and C. Sperberg-McQueen, \"Extensible Markup Language (XML) 1.0 (Fifth Edition)\", World Wide Web Consortium Recommendation REC-xml-20081126, November 2008, <http://www.w3.org/TR/2008/REC-xml-20081126>.",
      "ja": "[W3C.REC-XML-20081126] MALER、E.、Yergeau、F.、パオリ、J.、ブレイ、T.、およびC. Sperberg-マックイーン、 \"拡張マークアップ言語（XML）1.0（第5版）\"、 World Wide Web Consortium（W3C）の勧告REC-XML-20081126、2008年11月、<http://www.w3.org/TR/2008/REC-xml-20081126>。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Cyrus Daboo Apple Inc. 1 Infinite Loop Cupertino, CA 95014 USA",
      "ja": "サイラスDabooされたApple Inc. 1無限ループクパチーノ、CA 95014 USA"
    },
    {
      "indent": 3,
      "text": "EMail: cyrus@daboo.name URI: http://www.apple.com/",
      "ja": "電子メール：cyrus@daboo.name URI：http://www.apple.com/"
    }
  ]
}