{
  "title": {
    "text": "RFC 4606 - Generalized Multi-Protocol Label Switching (GMPLS) Extensions for Synchronous Optical Network (SONET) and Synchronous Digital Hierarchy (SDH) Control",
    "ja": "RFC 4606 - 同期光ネットワーク（SONET）および同期デジタル階層（SDH）コントロールのための（GMPLS）の拡張機能を切り替える一般マルチプロトコルラベル"
  },
  "number": 4606,
  "created_at": "2019-10-23 22:26:20.572095+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                          E. Mannie\nRequest for Comments: 4606                                      Perceval\nObsoletes: 3946                                         D. Papadimitriou\nCategory: Standards Track                                        Alcatel\n                                                             August 2006",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Generalized Multi-Protocol Label Switching (GMPLS) Extensions for Synchronous Optical Network (SONET) and Synchronous Digital Hierarchy (SDH) Control",
      "ja": "同期光ネットワーク（SONET）および同期デジタル階層（SDH）コントロールのための（GMPLS）の拡張機能を切り替える一般マルチプロトコルラベル"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution cof this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモCOF配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2006).",
      "ja": "著作権（C）インターネット協会（2006）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document provides minor clarification to RFC 3946.",
      "ja": "この文書は、RFC 3946にマイナーな明確化を提供します。"
    },
    {
      "indent": 3,
      "text": "This document is a companion to the Generalized Multi-protocol Label Switching (GMPLS) signaling. It defines the Synchronous Optical Network (SONET)/Synchronous Digital Hierarchy (SDH) technology-specific information needed when GMPLS signaling is used.",
      "ja": "この文書では、一般のマルチプロトコルラベルスイッチング（GMPLS）シグナリングへの仲間です。これは、GMPLSシグナリングを使用する場合に必要な同期光ネットワーク（SONET）/同期デジタル階層（SDH）技術固有の情報を定義します。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. SONET and SDH Traffic Parameters ................................3\n   2.1. SONET/SDH Traffic Parameters ...............................3\n   2.2. RSVP-TE Details ............................................9\n   2.3. CR-LDP Details ............................................10\n3. SONET and SDH Labels ...........................................11\n4. Acknowledgements ...............................................16\n5. Security Considerations ........................................16\n6. IANA Considerations ............................................16\nContributors ......................................................17\nAppendix 1. Signal Type Values Extension for VC-3 .................20\nAnnex 1. Examples .................................................20\nNormative References ..............................................23",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "As described in [RFC3945], Generalized MPLS (GMPLS) extends MPLS from supporting packet (Packet Switching Capable, or PSC) interfaces and switching to include support of four new classes of interfaces and switching: Layer-2 Switch Capable (L2SC), Time-Division Multiplex (TDM), Lambda Switch Capable (LSC) and Fiber-Switch Capable (FSC). A functional description of the extensions to MPLS signaling needed to support the new classes of interfaces and switching is provided in [RFC3471]. [RFC3473] describes RSVP-TE-specific formats and mechanisms needed to support all five classes of interfaces, and CR-LDP extensions can be found in [RFC3472].",
      "ja": "時間、可能なレイヤ2スイッチ（L2SC）：[RFC3945]に記載されているように、一般化されたMPLS（GMPLS）はインターフェース（パケットができる、またはPSCをスイッチング）とインタフェースと切替の4つの新しいクラスのサポートを含むようにパケット交換をサポートしているから、MPLSを拡張します-Division多重（TDM）、ラムダ対応スイッチ（LSC）とファイバスイッチ対応（FSC）。インターフェイスと切り替えの新しいクラスをサポートするために必要なMPLSシグナリングの拡張機能の機能説明は、[RFC3471]に提供されます。 [RFC3473]はインターフェイスのすべての5つのクラスをサポートするために必要なRSVP-TE固有の形式およびメカニズムを説明し、CR-LDPの拡張は、[RFC3472]に見出すことができます。"
    },
    {
      "indent": 3,
      "text": "This document presents details that are specific to Synchronous Optical Network (SONET)/Synchronous Digital Hierarchy (SDH). Per [RFC3471], SONET/SDH-specific parameters are carried in the signaling protocol in traffic parameter specific objects.",
      "ja": "この文書では、同期光ネットワーク（SONET）/同期デジタル階層（SDH）に固有の詳細を提示します。 [RFC3471]あたり、SONET / SDH固有のパラメータは、トラフィックパラメータの特定のオブジェクトにおけるシグナリングプロトコルで運ばれます。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 3,
      "text": "Moreover, the reader is assumed to be familiar with the terminology in American National Standards Institute (ANSI) [T1.105] and ITU-T [G.707], as well as with that in [RFC3471], [RFC3472], and [RFC3473]. The following abbreviations are used in this document:",
      "ja": "また、読者は、米国規格協会（ANSI）[T1.105]とITU-T [G.707]における用語に精通して、ならびに[RFC3471]のもので、[RFC3472]であると仮定され、そして[RFC3473]。次の略語はこの資料で使用されます："
    },
    {
      "indent": 3,
      "text": "DCC: Data Communications Channel. LOVC: Lower-Order Virtual Container HOVC: Higher-Order Virtual Container MS: Multiplex Section. MSOH: Multiplex Section overhead. POH: Path overhead. RS: Regenerator Section. RSOH: Regenerator Section overhead. SDH: Synchronous digital hierarchy. SOH: Section overhead. SONET: Synchronous Optical Network. SPE: Synchronous Payload Envelope. STM(-N): Synchronous Transport Module (-N) (SDH). STS(-N): Synchronous Transport Signal-Level N (SONET). VC-n: Virtual Container-n (SDH). VTn: Virtual Tributary-n (SONET).",
      "ja": "DCC：データ通信チャネル。 LOVC：下位仮想コンテナHOVC：高次仮想コンテナMS：多重化セクション。 MSOH：多重化セクションオーバーヘッド。 POH：パス・オーバーヘッド。 RS：リジェネレータセクション。 RSOH：再生器セクションオーバーヘッド。 SDH：同期デジタル階層。 SOH：セクションオーバーヘッド。 SONET：同期光ネットワーク。 SPE：同期ペイロードエンベロープ。 STM（-N）：同期転送モジュール（-N）（SDH）。 STS（-N）：同期転送信号レベルN（SONET）。 VC-N：仮想コンテナ-N（SDH）。 VTN：仮想トリビュタリ-N（SONET）。"
    },
    {
      "indent": 0,
      "text": "2. SONET and SDH Traffic Parameters",
      "section_title": true,
      "ja": "2. SONETとSDHトラフィックパラメータ"
    },
    {
      "indent": 3,
      "text": "This section defines the GMPLS traffic parameters for SONET/SDH. The protocol-specific formats, for the SONET/SDH-specific RSVP-TE objects and CR-LDP TLVs, are described in Sections 2.2 and 2.3, respectively.",
      "ja": "このセクションでは、SONET / SDHのためのGMPLSトラフィックパラメータを定義します。プロトコル固有のフォーマット、SONET / SDH特異RSVP-TEオブジェクトやCR-LDPのTLVのために、それぞれ、セクション2.2および2.3に記載されています。"
    },
    {
      "indent": 3,
      "text": "These traffic parameters specify a base set of capabilities for SONET ANSI [T1.105] and SDH ITU-T [G.707], such as concatenation and transparency. Other documents may further enhance this set of capabilities in the future. For instance, signaling for SDH over PDH ITU-T G.832 or sub-STM-0 ITU-T G.708 interfaces could be defined.",
      "ja": "これらのトラフィックパラメータは、連結及び透明性、SONET ANSI [T1.105]とSDH ITU-T [G.707]のための機能の基本セットを指定します。他の文書は、さらに将来的には機能のこのセットを高めることができます。例えば、オーバーPDH ITU-T G.832またはサブSTM-0 ITU-T G.708のインタフェースが定義することができるSDHのためのシグナリング。"
    },
    {
      "indent": 3,
      "text": "The traffic parameters defined hereafter (see Section 2.1) MUST be used when the label is encoded as SUKLM as defined in this memo (see Section 3). They MUST also be used when requesting one of Section/RS or Line/MS overhead transparent STS-1/STM-0, STS-3*N/STM-N (N=1, 4, 16, 64, 256) signals.",
      "ja": "このメモで定義されるようにラベルがSUKLMとして符号化される場合、以下の定義されたトラフィックパラメータ（セクション2.1を参照）（第3章を参照）を使用しなければなりません。セクション/ RS又はライン/ MSオーバーヘッド透明STS-1 / STM-0、STS-3 * N / STM-N（N = 1、4、16、64、256）信号の一つ要求するときにも使用されなければなりません。"
    },
    {
      "indent": 3,
      "text": "The traffic parameters and label encoding defined in [RFC3471], Section 3.2, MUST be used for fully transparent STS-1/STM-0, STS-3*N/STM-N (N=1, 4, 16, 64, 256) signal requests. A fully transparent signal is one for which all overhead is left unmodified by intermediate nodes; i.e., when all defined Transparency (T) bits would be set if the traffic parameters defined in Section 2.1 were used.",
      "ja": "[RFC3471]で定義されたトラフィックパラメータとラベルエンコーディング、セクション3.2は、完全に透明STS-1 / STM-0、STS-3 * N / STM-N（N = 1、4、16、64、256のために使用しなければなりません）信号を要求。完全に透明な信号は、すべてのオーバーヘッドが中間ノードにより修飾されていない残っているものです。即ち、セクション2.1で定義されたトラフィックパラメータが使用された場合、すべての定義された透明度（T）ビットが設定される場合。"
    },
    {
      "indent": 0,
      "text": "2.1. SONET/SDH Traffic Parameters",
      "section_title": true,
      "ja": "2.1。 SONET / SDHトラフィックパラメータ"
    },
    {
      "indent": 3,
      "text": "The traffic parameters for SONET/SDH are organized as follows:",
      "ja": "次のようにSONET / SDHのためのトラフィックパラメータが編成されています。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|  Signal Type  |      RCC      |              NCC              |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|              NVC              |        Multiplier (MT)        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                       Transparency (T)                        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                           Profile (P)                         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Annex 1 lists examples of SONET and SDH signal coding.",
      "ja": "SONETおよびSDH信号コーディングの附属書1つのリストの例。"
    },
    {
      "indent": 3,
      "text": "o) Signal Type (ST): 8 bits",
      "ja": "o）の信号タイプ（ST）：8ビット"
    },
    {
      "indent": 3,
      "text": "This field indicates the type of Elementary Signal that constitutes the requested Label Switched Path (LSP). Several transforms can be applied successively on the Elementary Signal to build the Final Signal actually being requested for the LSP.",
      "ja": "このフィールドは、要求されたラベルスイッチパス（LSP）を構成する基本信号の種類を示します。いくつかの変換は、実際にLSPのために要求されて最終信号を構築するために基本信号に連続的に適用することができます。"
    },
    {
      "indent": 3,
      "text": "Each transform application is optional and must be ignored if zero, except the Multiplier (MT), which cannot be zero and is ignored if equal to one.",
      "ja": "それぞれのアプリケーションはオプションであり、ゼロであれば、ゼロにすることはできず、1に等しい場合は無視される乗数（MT）、を除いて、無視されなければならない変換します。"
    },
    {
      "indent": 3,
      "text": "Transforms must be applied strictly in the following order:",
      "ja": "変換は、次の順序で厳密に適用する必要があります。"
    },
    {
      "indent": 3,
      "text": "- First, contiguous concatenation (by using the RCC and NCC fields) can be optionally applied on the Elementary Signal, resulting in a contiguously concatenated signal.",
      "ja": " - まず、（RCCとNCCのフィールドを使用して）連続連結は、必要に応じて連続連結信号が得られ、基本信号に適用することができます。"
    },
    {
      "indent": 3,
      "text": "- Second, virtual concatenation (by using the NVC field) can be optionally applied on the Elementary Signal, resulting in a virtually concatenated signal.",
      "ja": " - 第二に、（NVCフィールドを使用して）仮想連結は、必要に応じて仮想連結信号が得られ、基本信号に適用することができます。"
    },
    {
      "indent": 3,
      "text": "- Third, some transparency (by using the Transparency field) can be optionally specified when a frame is requested as signal rather than an SPE- or VC-based signal.",
      "ja": " - フレームを信号ではなくSPE-またはVCベース信号として要求されたときに第三に、（透明度フィールドを使用して）、いくつかの透明度は、任意に指定することができます。"
    },
    {
      "indent": 3,
      "text": "- Fourth, a multiplication (by using the Multiplier field) can be optionally applied directly on the Elementary Signal, on the contiguously concatenated signal obtained from the first phase, on the virtually concatenated signal obtained from the second phase, or on these signals combined with some transparency.",
      "ja": " - 第四に、（Multiplierフィールドを使用して）乗算は必要に応じて第二の相から得られた事実上連結信号に、第一段階から得られた連続連結信号に、基本信号に直接適用、またはこれらの信号に組み合わせることができますいくつかの透明度。"
    },
    {
      "indent": 3,
      "text": "Permitted Signal Type values for SONET/SDH are",
      "ja": "SONET / SDHのための許可信号タイプの値は、"
    },
    {
      "indent": 3,
      "text": "Value  Type (Elementary Signal)\n-----  ------------------------\n  1     VT1.5  SPE / VC-11\n  2     VT2    SPE / VC-12\n  3     VT3    SPE\n  4     VT6    SPE / VC-2\n  5     STS-1  SPE / VC-3\n  6     STS-3c SPE / VC-4\n  7     STS-1      / STM-0   (only when transparency is requested)\n  8     STS-3      / STM-1   (only when transparency is requested)\n  9     STS-12     / STM-4   (only when transparency is requested)\n  10    STS-48     / STM-16  (only when transparency is requested)\n  11    STS-192    / STM-64  (only when transparency is requested)\n  12    STS-768    / STM-256 (only when transparency is requested)",
      "raw": true
    },
    {
      "indent": 3,
      "text": "A dedicated signal type is assigned to a SONET STS-3c SPE instead of being coded as a contiguous concatenation of three STS-1 SPEs. This is done in order to provide easy interworking between SONET and SDH signaling.",
      "ja": "専用の信号タイプは代わりに3つのSTS-1 SPEの連続連結として符号化されるのSONET STS-3cとのSPEに割り当てられます。これは、SONETとSDHのシグナル伝達の間に簡単なインターワーキングを提供するために行われます。"
    },
    {
      "indent": 3,
      "text": "Appendix 1 adds one signal type (optional) to the above values.",
      "ja": "付録1は、上記の値に1つの信号タイプ（オプション）を追加します。"
    },
    {
      "indent": 3,
      "text": "o) Requested Contiguous Concatenation (RCC): 8 bits",
      "ja": "O）要求連続連結（RCC）：8ビット"
    },
    {
      "indent": 3,
      "text": "This field is used to request the optional SONET/SDH contiguous concatenation of the Elementary Signal.",
      "ja": "このフィールドは、基本信号の任意SONET / SDHの連続連結を要求するために使用されます。"
    },
    {
      "indent": 3,
      "text": "This field is a vector of flags. Each flag indicates the support of a particular type of contiguous concatenation. Several flags can be set at the same time to indicate a choice.",
      "ja": "このフィールドは、フラグのベクトルです。各フラグは、連続連結の特定のタイプのサポートを示しています。いくつかのフラグは、選択肢を示すために、同時に設定することができます。"
    },
    {
      "indent": 3,
      "text": "These flags allow an upstream node to indicate to a downstream node the different types of contiguous concatenation that it supports. However, the downstream node decides which one to use according to its own rules.",
      "ja": "これらのフラグは、上流ノードは、下流ノードにそれがサポート連続連結の種類を示すことを可能にします。しかし、下流ノードは、独自のルールに従って使用するかを決定します。"
    },
    {
      "indent": 3,
      "text": "A downstream node receiving simultaneously more than one flag chooses a particular type of contiguous concatenation, if any is supported, and according to criteria that are out of this document's scope. A downstream node that doesn't support any of the concatenation types indicated by the field must refuse the LSP request. In particular, it must refuse the LSP request if it doesn't support contiguous concatenation at all.",
      "ja": "同時に複数のフラグを受信した下流ノードは、いずれかがサポートされている場合、連続した連結の特定のタイプを選択し、この文書の範囲外である基準に従って。フィールドによって示される連結型のいずれかをサポートしていない下流ノードは、LSPの要求を拒否しなければなりません。それがすべてで連続した連結をサポートしていない場合は特に、それはLSP要求を拒否しなければなりません。"
    },
    {
      "indent": 3,
      "text": "When several flags have been set, the upstream node retrieves the (single) type of contiguous concatenation the downstream node has selected by looking at the position indicated by the first label and the number of labels as returned by the downstream node (see also Section 3).",
      "ja": "いくつかのフラグが設定されている場合、上流ノードが隣接連結の（単一）タイプを取得する下流ノードは、下流ノードから返される最初のラベルとラベルの数によって示される位置を見て選択した（セクション3を参照してください）。"
    },
    {
      "indent": 3,
      "text": "The entire field is set to zero to indicate that no contiguous concatenation is requested at all (default value). A non-zero field indicates that some contiguous concatenation is requested.",
      "ja": "フィールド全体を全く連続連結がすべての（デフォルト値）で要求されていないことを示すためにゼロに設定されています。ゼロ以外のフィールドは、いくつかの連続した連結が要求されていることを示しています。"
    },
    {
      "indent": 3,
      "text": "The following flag is defined:",
      "ja": "以下のフラグが定義されています。"
    },
    {
      "indent": 6,
      "text": "Flag 1 (bit 1): Standard contiguous concatenation.",
      "ja": "フラグ1（ビット1）：標準の連続連結。"
    },
    {
      "indent": 3,
      "text": "Flag 1 indicates that the standard SONET/SDH contiguous concatenation, as defined in [T1.105]/[G.707], is supported. Note that bit 1 is the low-order bit. Other flags are reserved for extensions; if not used, they must be set to zero when sent and should be ignored when received.",
      "ja": "フラグ1は、標準的なSONET / SDHの連続連結は、[T1.105] / [G.707]で定義されるように、サポートされていることを示しています。そのビット1が下位ビットであることに注意してください。他のフラグは、拡張のために予約されています。使用されていない場合は送信され、受信時に無視されなければならないとき、彼らはゼロに設定する必要があります。"
    },
    {
      "indent": 3,
      "text": "See note 1 in the section on the NCC about the SONET contiguous concatenation of STS-1 SPEs when the number of components is a multiple of three.",
      "ja": "部品の数が3の倍数である場合STS-1 SPEのSONET連続連結約NCCのセクションで注記1を参照。"
    },
    {
      "indent": 3,
      "text": "o) Number of Contiguous Components (NCC): 16 bits",
      "ja": "連続成分のO）の数（NCC）：16ビット"
    },
    {
      "indent": 3,
      "text": "This field indicates the number of identical SONET SPEs/SDH VCs (i.e., Elementary Signal) that are requested to be concatenated, as specified in the RCC field.",
      "ja": "このフィールドは、同一のSPE SONET / SDHのVCの数を示す（すなわち、基本信号）RCCフィールドで指定されるように、連結されるように要求されています。"
    },
    {
      "indent": 3,
      "text": "Note 1: When a SONET STS-Nc SPE with N=3*X is requested, the Elementary Signal to be used must always be an STS-3c_SPE signal type, and the value of NCC must always be equal to X. This allows facilitating the interworking between SONET and SDH. In particular, it means that the contiguous concatenation of three STS-1 SPEs cannot be requested, as according to this specification this type of signal must be coded using the STS-3c SPE signal type.",
      "ja": "注1：N = 3 * X要求され、基本信号とSONET STS-NcのSPEが常にSTS-3c_SPE信号タイプである必要があり、使用すると、NCCの値は常にXに等しくなければならない場合にはこれは容易に可能SONETとSDH間のインターワーキング。特に、本明細書によれば、信号のこのタイプは、STS-3cのSPE信号タイプを使用して符号化されなければならないように3 STS-1 SPEの連続連結を、要求することができないことを意味します。"
    },
    {
      "indent": 3,
      "text": "Note 2: When a transparent STS-N/STM-N signal is requested that is limited to a single contiguously concatenated STS-Nc_SPE/VC-4-Nc, the signal type must be STS-N/STM-N, RCC with flag 1, NCC set to 1.",
      "ja": "注2：透明なSTS-N / STM-N信号は、単一の連続連結STS-Nc_SPE / VC-4-NCに限定されるように要求された場合、信号の種類がフラグをSTS-N / STM-N、RCCでなければなりません1、NCCは1に設定しました。"
    },
    {
      "indent": 3,
      "text": "The NCC value must be consistent with the type of contiguous concatenation being requested in the RCC field. In particular, this field is irrelevant if no contiguous concatenation is requested (RCC = 0). In that case, it must be set to zero when sent and should be ignored when received. A RCC value different from 0 implies a number of contiguous components greater than or equal to 1.",
      "ja": "NCCの値は、RCCの分野で要求される連続連結のタイプと一致しなければなりません。何個の連続連結が（RCC = 0）が要求されていない場合は特に、このフィールドは無関係です。その場合には、送信され、受信時に無視されなければならないときにゼロに設定する必要があります。 0とは異なるRCC値が1以上の連続する構成要素の数を意味しています。"
    },
    {
      "indent": 3,
      "text": "Note 3: Following these rules, when a VC-4 signal is requested, the RCC and the NCC values SHOULD be set to 0, whereas for an STS-3c SPE signal, the RCC and the NCC values SHOULD be set 1. However, if local conditions allow, since the setting of the RCC and NCC values is locally driven, the requesting upstream node MAY set the RCC and NCC values to either SDH or SONET settings without impacting the function. Moreover, the downstream node SHOULD accept the requested values if local conditions allow. If these values cannot be supported, the receiver downstream node SHOULD generate a PathErr/NOTIFICATION message (see Sections 2.2 and 2.3, respectively).",
      "ja": "注3：STS-3cはSPE信号に対して、RCCとNCCの値はしかし1に設定されるべきであるのに対し、これらの規則に従って、VC-4信号が要求されたとき、RCCとNCCの値は、0に設定されてくださいローカル条件が許せばRCCとNCC値の設定が局所的に駆動されるので、要求上流のノードは、機能に影響を与えることなく、SDHまたはSONETのいずれかの設定にRCCとNCC値を設定してもよいです。ローカル条件が許せばまた、下流ノードは、要求された値を受け入れるべきです。これらの値はサポートできない場合、受信機下流ノード（それぞれ、セクション2.2および2.3を参照）のPathErr /通知メッセージを生成する必要があります。"
    },
    {
      "indent": 3,
      "text": "o) Number of Virtual Components (NVC): 16 bits",
      "ja": "仮想コンポーネントのO）の数（NVC）：16ビット"
    },
    {
      "indent": 3,
      "text": "This field indicates the number of signals that are requested to be virtually concatenated. These signals are all of the same type by definition. They are Elementary Signal SPEs/VCs for which signal types are defined in this document; i.e., VT1.5_SPE/VC-11,",
      "ja": "このフィールドは、仮想連結されるように要求される信号の数を示します。これらの信号は、定義により、同じタイプのすべてのです。彼らは、信号の種類は、この文書で定義されている小学校の信号のSPE / VCです。即ち、VT1.5_SPE / VC-11、"
    },
    {
      "indent": 3,
      "text": "VT2_SPE/VC-12, VT3_SPE, VT6_SPE/VC-2, STS-1_SPE/VC-3, or STS-3c_SPE/VC-4.",
      "ja": "VT2_SPE / VC-12、VT3_SPE、VT6_SPE / VC-2、STS-1_SPE / VC-3、またはSTS-3c_SPE / VC-4。"
    },
    {
      "indent": 3,
      "text": "This field is set to 0 (default value) to indicate that no virtual concatenation is requested.",
      "ja": "このフィールドは、何の仮想連結が要求されていないことを示すために0（デフォルト値）に設定されています。"
    },
    {
      "indent": 3,
      "text": "o) Multiplier (MT): 16 bits",
      "ja": "O）乗算器（MT）：16ビット"
    },
    {
      "indent": 3,
      "text": "This field indicates the number of identical signals that are requested for the LSP; i.e., that form the Final Signal. These signals can be identical Elementary Signals, identical contiguously concatenated signals, or identical virtually concatenated signals. Note that all of these signals thus belong to the same LSP.",
      "ja": "このフィールドは、LSPのために要求された同一の信号の数を示します。すなわち、最終的な信号を形成します。これらの信号は、同じ基本信号、同一の連続連結信号、または同一の仮想連結信号であってもよいです。これらの信号の全ては、このように同じLSPに属していることに注意してください。"
    },
    {
      "indent": 3,
      "text": "The distinction between the components of multiple virtually concatenated signals is done via the order of the labels that are specified in the signaling. The first set of labels must describe the first component (set of individual signals belonging to the first virtual concatenated signal), the second set must describe the second component (set of individual signals belonging to the second virtual concatenated signal), and so on.",
      "ja": "複数の仮想連結信号の成分との間の区別は、シグナリングで指定されたラベルの順序を介して行われます。ラベルの第1のセットは第一の成分（第一の仮想連結信号に属する個々の信号のセット）を記述する必要があり、第二の組は2番目の成分（第2の仮想連結信号に属する個々の信号のセット）を記述し、しなければなりません。"
    },
    {
      "indent": 3,
      "text": "This field is set to one (default value) to indicate that exactly one instance of a signal is being requested. Intermediate and egress nodes MUST verify that the node itself and the interfaces on which the LSP will be established can support the requested multiplier value. If the requested values cannot be supported, the receiver node MUST generate a PathErr/NOTIFICATION message (see Sections 2.2 and 2.3, respectively).",
      "ja": "このフィールドは、信号のうちの正確に1つのインスタンスが要求されていることを示すために1（デフォルト値）に設定されています。中間及び出口ノードがLSPが確立されているノード自体とインタフェースが要求された乗算値をサポートできることを確認しなければなりません。要求された値がサポートできない場合、受信ノードは、（それぞれ、セクション2.2および2.3を参照）のPathErr /通知メッセージを生成しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Zero is an invalid value. If a zero is received, the node MUST generate a PathErr/NOTIFICATION message (see Sections 2.2 and 2.3, respectively).",
      "ja": "ゼロは無効な値です。ゼロを受信した場合、ノードが（それぞれ、セクション2.2および2.3を参照）のPathErr /通知メッセージを生成しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Note 1: When a transparent STS-N/STM-N signal is requested that is limited to a single contiguously concatenated STS-Nc-SPE/VC-4-Nc, the multiplier field MUST be equal to 1 (only valid value).",
      "ja": "注1：透明なSTS-N / STM-N信号は、単一の連続連結STS-NC-SPE / VC-4-NCに限定されるように要求された場合、乗算フィールドが1（唯一の有効な値）に等しくなければなりません。"
    },
    {
      "indent": 3,
      "text": "o) Transparency (T): 32 bits",
      "ja": "O）透明（T）：32ビット"
    },
    {
      "indent": 3,
      "text": "This field is a vector of flags that indicates the type of transparency being requested. Several flags can be combined to provide different types of transparency. Not all combinations are necessarily valid. The default value for this field is zero, i.e., no transparency is requested.",
      "ja": "このフィールドは、要求されている透明のタイプを示すフラグのベクトルです。いくつかのフラグは、透明性の異なる種類を提供するために組み合わせることができます。組み合わせの全てが必ずしも有効です。このフィールドのデフォルト値は、すなわち、何の透明性が要求されていない、ゼロです。"
    },
    {
      "indent": 3,
      "text": "Transparency, as defined from the point of view of this signaling specification, is only applicable to the fields in the SONET/SDH frame overheads. In the SONET case, these are the fields in the Section Overhead (SOH) and the Line Overhead (LOH). In the SDH case, these are the fields in the Regenerator Section Overhead (RSOH), the Multiplex Section overhead (MSOH), and the pointer fields between the two. With SONET, the pointer fields are part of the LOH.",
      "ja": "透明性は、このシグナリング仕様の観点から定義されるように、SONET / SDHフレームのオーバーヘッドのフィールドにのみ適用されます。 SONETの場合、これらは、セクションオーバーヘッド（SOH）とラインオーバーヘッド（LOH）のフィールドです。 SDHの場合、これらは、中継セクションオーバヘッド（RSOH）のフィールド、多重セクションオーバヘッド（MSOH）、両者のポインタ・フィールドです。 SONETでは、ポインタフィールドは、LOHの一部です。"
    },
    {
      "indent": 3,
      "text": "Note also that transparency is only applicable when the following signal types are used: STS-1/STM-0, STS-3/STM-1, STS-12/STM-4, STS-48/STM-16, STS-192/STM-64, and STS-768/STM-256. At least one transparency type must be specified when such a signal type is requested.",
      "ja": "次の信号タイプが使用されるときメモはまた、透明性のみ適用され：STS-1 / STM-0、STS-3 / STM-1、STS-12 / STM-4、STS-48 / STM-16、STS-192 / STM-64、およびSTS-768 / STM-256。そのような信号の種類が要求されたときに少なくとも一つの透明タイプを指定する必要があります。"
    },
    {
      "indent": 3,
      "text": "Transparency indicates precisely which fields in these overheads must be delivered unmodified at the other end of the LSP. An ingress Label Switching Router (LSR) requesting transparency will pass these overhead fields that must be delivered to the egress LSR without any change. From the ingress and egress LSRs point of views, these fields must be seen as being unmodified.",
      "ja": "透明度は、LSPの他端に修飾されていない配信されなければならない正確れるこれらのオーバーヘッドのフィールドを示しています。ルータ（LSR）を要求する透明性の入口ラベルスイッチングは、そのまま出口LSRに送達されなければならないこれらのオーバーヘッドのフィールドを渡します。ビューの入口および出口LSRの点から、これらのフィールドは未修飾であると見なければなりません。"
    },
    {
      "indent": 3,
      "text": "Transparency is applied not at the interfaces with the initiating and terminating LSRs but only between intermediate LSRs. The transparency field is used to request an LSP that supports the requested transparency type; it may also be used to set up the transparency process to be applied at each intermediate LSR.",
      "ja": "透明度は、開始と終了のLSRとだけ中間のLSRとの界面にない適用されます。透明度のフィールドが要求された透明性の種類をサポートしているLSPを要求するために使用されます。また、各中間LSRに適用される透明度プロセスを設定するために使用することができます。"
    },
    {
      "indent": 3,
      "text": "The different transparency flags are as follows:",
      "ja": "次のように異なる透明度フラグは次のとおりです。"
    },
    {
      "indent": 6,
      "text": "Flag 1 (bit 1): Section/Regenerator Section layer Flag 2 (bit 2): Line/Multiplex Section layer",
      "ja": "フラグ1（ビット1）：セクション/ジェネレータセクション層フラグ2（ビット2）：ライン/多重セクション層"
    },
    {
      "indent": 3,
      "text": "where bit 1 is the low-order bit. Other flags are reserved; they should be set to zero when sent and ignored when received. A flag is set to one to indicate that the corresponding transparency is requested.",
      "ja": "ビット1は最下位ビットです。他のフラグは予約されています。彼らが送信されたときにゼロに設定し、受信時に無視されなければなりません。フラグは、対応する透明性が要求されていることを示すために1に設定されています。"
    },
    {
      "indent": 3,
      "text": "Intermediate and egress nodes MUST verify that the node itself and the interfaces on which the LSP will be established can support the requested transparency. If the requested flags cannot be supported, the receiver node MUST generate a PathErr/NOTIFICATION message (see Sections 2.2 and 2.3, respectively).",
      "ja": "中間および出力ノードはノード自体とLSPが確立されたインタフェースが要求された透明度をサポートできることを確認しなければなりません。要求されたフラグがサポートできない場合、受信ノードは、（それぞれ、セクション2.2および2.3を参照）のPathErr /通知メッセージを生成しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Section/Regenerator Section layer transparency means that the entire frames must be delivered unmodified. This implies that pointers cannot be adjusted. When Section/Regenerator Section layer transparency is used all other flags MUST be ignored.",
      "ja": "セクション/ジェネレータセクション層の透明度は、全フレームが未修飾送達されなければならないことを意味します。これは、ポインタを調整することができないことを意味します。セクション/リジェネレータセクション層の透明度が使用されている場合は他のすべてのフラグは無視しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Line/Multiplex Section layer transparency means that the LOH/MSOH must be delivered unmodified. This implies that pointers cannot be adjusted.",
      "ja": "ライン/多重化セクション層の透明性がLOH / MSOHをそのまま配信しなければならないことを意味しています。これは、ポインタを調整することができないことを意味します。"
    },
    {
      "indent": 3,
      "text": "o) Profile (P): 32 bits",
      "ja": "O）プロフィール（P）：32ビット"
    },
    {
      "indent": 3,
      "text": "This field is intended to indicate particular capabilities that must be supported for the LSP; for example, monitoring capabilities.",
      "ja": "このフィールドは、LSPのためにサポートされている必要があり、特定の能力を示すことを意図しています。例えば、監視機能。"
    },
    {
      "indent": 3,
      "text": "No standard profile is currently defined, and this field SHOULD be set to zero when transmitted and ignored when received.",
      "ja": "標準的なプロファイルが現在定義されていない、受信した場合、このフィールドは、送信されたときにゼロに設定され、無視されるべきです。"
    },
    {
      "indent": 3,
      "text": "In the future, TLV-based extensions may be created.",
      "ja": "将来的には、TLVベースの拡張機能を作成することができます。"
    },
    {
      "indent": 0,
      "text": "2.2. RSVP-TE Details",
      "section_title": true,
      "ja": "2.2。 RSVP-TE詳細"
    },
    {
      "indent": 3,
      "text": "For RSVP-TE, the SONET/SDH traffic parameters are carried in the SONET/SDH SENDER_TSPEC and FLOWSPEC objects. The same format is used both for the SENDER_TSPEC object and for FLOWSPEC objects. The content of the objects is defined above, in Section 2.1. The objects have the following class and type for SONET ANSI T1.105 and SDH ITU-T G.707:",
      "ja": "RSVP-TEのために、SONET / SDHのトラフィックパラメータは、SONET / SDH SENDER_TSPECおよびFLOWSPECオブジェクトで運ばれます。同じフォーマットは、SENDER_TSPECオブジェクトのとFLOWSPECオブジェクトの両方に使用されます。オブジェクトの内容は、セクション2.1で、上記で定義されています。オブジェクトは、SONET ANSI T1.105とSDH ITU-T G.707のための次のクラスおよびタイプを有します。"
    },
    {
      "indent": 6,
      "text": "SONET/SDH SENDER_TSPEC object: Class = 12, C-Type = 4 SONET/SDH FLOWSPEC object: Class = 9, C-Type = 4",
      "ja": "SONET / SDH SENDER_TSPECオブジェクト：クラス= 12、C-タイプ= 4 SONET / SDH FLOWSPECオブジェクト：クラス= 9、C-タイプ= 4"
    },
    {
      "indent": 3,
      "text": "There is no Adspec associated with the SONET/SDH SENDER_TSPEC. Either the Adspec is omitted, or an int-serv Adspec with the Default General Characterization Parameters and Guaranteed Service fragment is used; see [RFC2210].",
      "ja": "SONET / SDH SENDER_TSPECに関連付けられADSPECはありません。どちらのADSPECは省略されている、またはデフォルトの一般的な特性評価パラメータと保証サービスフラグメントとINT-SERV ADSPECが使用されます。 [RFC2210]を参照してください。"
    },
    {
      "indent": 3,
      "text": "For a particular sender in a session, the contents of the FLOWSPEC object received in a Resv message SHOULD be identical to the contents of the SENDER_TSPEC object received in the corresponding Path message. If the objects do not match, a ResvErr message with a \"Traffic Control Error/Bad Flowspec value\" error SHOULD be generated.",
      "ja": "セッション中に特定の送信者のために、Resvメッセージで受信FLOWSPECオブジェクトの内容は、対応するPathメッセージで受信SENDER_TSPECオブジェクトの内容と同一であるべきです。オブジェクトが一致しない場合は、「トラフィック制御誤差/​​バート・フロースペック値」エラーでResvErrメッセージが生成されるべきです。"
    },
    {
      "indent": 3,
      "text": "Intermediate and egress nodes MUST verify that the node itself and the interfaces on which the LSP will be established can support the requested Signal Type, RCC, NCC, NVC and Multiplier (as defined in Section 2.1). If the requested value(s) can not be supported, the receiver node MUST generate a PathErr message with a \"Traffic Control Error/ Service unsupported\" indication (see [RFC2205]).",
      "ja": "中間及び出口ノード（セクション2.1で定義されるように）ノード自体とLSPが確立されているインターフェイスは、要求信号タイプ、RCC、NCC、NVCと乗算器をサポートできることを確認しなければなりません。要求された値（S）をサポートすることができない場合、受信ノードは、「トラフィック制御誤差/​​サービスサポートされていない」表示（[RFC2205]を参照）とのPathErrメッセージを生成しなければなりません。"
    },
    {
      "indent": 3,
      "text": "In addition, if the MT field is received with a zero value, the node MUST generate a PathErr message with a \"Traffic Control Error/Bad Tspec value\" indication (see [RFC2205]).",
      "ja": "MTフィールドがゼロ値と受信した場合に加えて、ノードは、表示を「トラフィック制御誤差/​​不良のTSPEC値」とのPathErrメッセージを発生させなければなりません（[RFC2205]を参照）。"
    },
    {
      "indent": 3,
      "text": "Intermediate nodes MUST also verify that the node itself and the interfaces on which the LSP will be established can support the requested Transparency (as defined in Section 2.1). If the requested value(s) cannot be supported, the receiver node MUST generate a PathErr message with a \"Traffic Control Error/Service unsupported\" indication (see [RFC2205]).",
      "ja": "中間ノードは、（セクション2.1で定義されるように）ノード自体とLSPが確立されたインタフェースが要求された透明度をサポートできることを確認しなければなりません。要求された値（S）をサポートすることができない場合、受信ノードは、「トラフィック制御誤差/​​サービスサポートされていない」表示（[RFC2205]を参照）とのPathErrメッセージを生成しなければなりません。"
    },
    {
      "indent": 0,
      "text": "2.3. CR-LDP Details",
      "section_title": true,
      "ja": "2.3。 CR-LDP詳細"
    },
    {
      "indent": 3,
      "text": "For CR-LDP, the SONET/SDH traffic parameters are carried in the SONET/SDH Traffic Parameters TLV. The content of the TLV is defined above, in Section 2.1. The header of the TLV has the following format:",
      "ja": "CR-LDPのために、SONET / SDHトラフィックパラメータは、SONET / SDHトラフィックパラメータTLVで運ばれます。 TLVの含有量は、2.1節で、上記で定義されています。 TLVのヘッダは、次の形式を有します。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|U|F|          Type             |      Length                   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The type field for the SONET/SDH Traffic Parameters TLV is 0x0838.",
      "ja": "SONET / SDHトラフィックパラメータTLVのためのタイプフィールドは0x0838です。"
    },
    {
      "indent": 3,
      "text": "Intermediate and egress nodes MUST verify that the node itself and the interfaces on which the LSP will be established can support the requested Signal Type, RCC, NCC, NVC, and Multiplier (as defined in Section 2.1). If the requested value(s) cannot be supported, the receiver node MUST generate a NOTIFICATION message with a \"Resource Unavailable\" status code (see [RFC3212]).",
      "ja": "中間と出口ノードはノード自体こととLSPが確立されているインターフェイスは、要求信号タイプ、RCC、NCC、NVC、および（セクション2.1で定義されるような）乗算器をサポートすることができることを確認しなければなりません。要求された値（S）をサポートすることができない場合、受信ノードは、「リソース使用不可」の状態コードと通知メッセージを生成する必要があります（[RFC3212]を参照）。"
    },
    {
      "indent": 3,
      "text": "In addition, if the MT field is received with a zero value, the node MUST generate a NOTIFICATION message with a \"Resource Unavailable\" status code (see [RFC3212]).",
      "ja": "MTフィールドがゼロ値と受信した場合に加えて、ノードは、「リソース使用不可」の状態コードと通知メッセージを生成する必要があります（[RFC3212]を参照）。"
    },
    {
      "indent": 3,
      "text": "Intermediate nodes MUST also verify that the node itself and the interfaces on which the LSP will be established can support the requested Transparency (as defined in Section 2.1). If the requested value(s) cannot be supported, the receiver node MUST generate a NOTIFICATION message with a \"Resource Unavailable\" status code (see [RFC3212]).",
      "ja": "中間ノードは、（セクション2.1で定義されるように）ノード自体とLSPが確立されたインタフェースが要求された透明度をサポートできることを確認しなければなりません。要求された値（S）をサポートすることができない場合、受信ノードは、「リソース使用不可」の状態コードと通知メッセージを生成する必要があります（[RFC3212]を参照）。"
    },
    {
      "indent": 0,
      "text": "3. SONET and SDH Labels",
      "section_title": true,
      "ja": "3. SONETとSDHラベル"
    },
    {
      "indent": 3,
      "text": "SONET and SDH each define a multiplexing structure. Both structures are trees whose roots are, respectively, an STS-N or an STM-N and whose leaves are the signals that can be transported via the time-slots and switched between time-slots within an ingress port and time-slots within an egress port; i.e., a VTx SPE, an STS-x SPE, or a VC-x. A SONET/SDH label will identify the exact position (i.e., first time-slot) of a particular VTx SPE, STS-x SPE, or VC-x signal in a multiplexing structure. SONET and SDH labels are carried in the Generalized Label per [RFC3473] and [RFC3472].",
      "ja": "SONETおよびSDHは、各多重化構造を定義します。両方の構造は、その根は、それぞれ、STS-NまたはSTM-Nと、その葉タイムスロットを介して輸送され、内部に入口ポートとタイムスロット内でタイムスロット間で切り替えることができる信号である木であります出力ポート;即ち、VTX SPE、STS-X SPE、またはVC-X。 SONET / SDHのラベルは、多重構造の特定のVTX SPE、STS-X SPE、またはVC-X信号の正確な位置（即ち、第1の時間スロット）を特定します。 SONETとSDHラベルは[RFC3473]及び[RFC3472]あたりの一般ラベルで運ばれます。"
    },
    {
      "indent": 3,
      "text": "Note that by time-slots we mean the time-slots as they appear logically and sequentially in the multiplex, not as they appear after any possible interleaving.",
      "ja": "彼らはすべての可能なインタリーブ後に表示されていないとして、多重に論理的に順次表示されるタイムスロットで、我々はタイムスロットを意味することに注意してください。"
    },
    {
      "indent": 3,
      "text": "These multiplexing structures will be used as naming trees to create unique multiplex entry names or labels. The same format of label is used for SONET and SDH. As explained in [RFC3471], a label does not identify the \"class\" to which the label belongs. This is implicitly determined by the link on which the label is used.",
      "ja": "これらの多重構造は、ユニークなマルチプレックスエントリ名やラベルを作成するために木を命名として使用されます。ラベルの同じフォーマットはSONETとSDHのために使用されています。 [RFC3471]で説明したように、ラベルは、ラベルが属する「クラス」を識別しません。これは、暗黙的にラベルが使用されているリンクによって決定されます。"
    },
    {
      "indent": 3,
      "text": "In case of signal concatenation or multiplication, a list of labels can appear in the Label field of a Generalized Label.",
      "ja": "信号連結または乗算の場合には、ラベルのリストは、一般ラベルのラベルフィールドに表示されます。"
    },
    {
      "indent": 3,
      "text": "In case of contiguous concatenation, only one label appears in the Label field. This unique label is encoded as a single 32-bit label value (as defined in this section) of the Generalized Label object (Class-Num = 16, C-Type = 2)/TLV (0x0825). This label identifies the lowest time-slot occupied by the contiguously concatenated signal. By lowest time-slot, we mean the one having the lowest label (value) when compared as an integer value; i.e., the time-slot occupied by the first component signal of the concatenated signal encountered descending the tree.",
      "ja": "連続した連結の場合は、1つのラベルだけは、ラベルフィールドに表示されます。このユニークなラベルは、一般化ラベルオブジェクト（クラス民= 16、C-タイプ= 2）/ TLV（0x0825）から（このセクションで定義されるように）単一の32ビットのラベル値として符号化されます。このラベルは、連続連結信号によって占有される最小のタイムスロットを識別する。最小タイムスロットによって、我々は、整数値として比較した場合、最低のラベル（値）を有するものを意味します。すなわち、連結信号の第一成分信号によって占有されるタイムスロットは、ツリーを下降遭遇しました。"
    },
    {
      "indent": 3,
      "text": "In case of virtual concatenation, the explicit ordered list of all labels in the concatenation is given. This ordered list of labels is encoded as a sequence of 32-bit label values (as defined in this section) of the Generalized Label object (Class-Num = 16, C-Type = 2)/TLV (0x0825). Each label indicates the first time-slot occupied by a component of the virtually concatenated signal. The order of the labels must reflect the order of the payloads to concatenate (not the physical order of time-slots). The above representation limits virtual concatenation to remain within a single (component) link; it imposes, as such, a restriction compared to the ANSI [T1.105]/ ITU-T [G.707] recommendations. The standard definition for virtual concatenation allows each virtual concatenation components to travel over diverse paths. Within GMPLS, virtual concatenation components must travel over the same (component) link if they are part of the same LSP. This is due to the way that labels are bound to a (component) link. Note, however, that the routing of components on different paths is indeed equivalent to establishing different LSPs, each one having its own route. Several LSPs can be initiated and terminated between the same nodes, and their corresponding components can then be associated together (i.e., virtually concatenated).",
      "ja": "仮想連結の場合、連結のすべてのラベルの明示的な順序付きリストが与えられています。ラベルのこの順序付けられたリストは、一般ラベルオブジェクトの（このセクションで定義されるように）32ビットのラベル値のシーケンスとして符号化される（クラス民= 16、C-タイプ= 2）/ TLV（0x0825）。各ラベルは、仮想連結信号の成分によって占有される第1の時間スロットを示しています。ラベルの順序は、連結するペイロードの順序（ないタイムスロットの物理的な順序）を反映しなければなりません。上記の表現は、単一の（コンポーネント）リンク内に留まるためにバーチャルコンカチネーションを制限します。それは、例えば、ANSI [T1.105] / ITU-T [G.707]勧告に比べ制限を課します。バーチャルコンカチネーションのための標準的な定義は、各仮想連結要素は、多様な経路上を移動することを可能にします。それらが同じLSPの一部である場合GMPLS内、バーチャルコンカチネーションの構成要素は同じ（コンポーネント）リンクを介して移動しなければなりません。これは、ラベルが（コンポーネント）リンクにバインドされている方法によるものです。異なるパス上のコンポーネントのルーティングは、それぞれが独自の経路を有する異なるLSPを確立する確かに等価であること、しかし、注意してください。いくつかのLSPは開始と同じノード間で終了し、それらの対応する構成要素は、その後（すなわち、仮想連結）を一緒に関連付けることができることができます。"
    },
    {
      "indent": 3,
      "text": "In case of multiplication (i.e., using the multiplier transform), the explicit ordered list of all labels that take part in the Final Signal is given. This ordered list of labels is encoded as a sequence of 32-bit label values (as defined in this section) of the Generalized Label object (Class-Num = 16, C-Type = 2)/TLV (0x0825). In case of multiplication of virtually concatenated signals, the explicit ordered list of the set of labels that take part in the Final Signal is given. The first set of labels indicates the time-slots occupied by the first virtually concatenated signal, the second set of labels indicates the time-slots occupied by the second virtually concatenated signal, and so on. The above representation limits multiplication to remain within a single (component) link.",
      "ja": "乗算の場合（つまり、乗数を使用して変換）、最終的な信号に参加するすべてのラベルの明示的な順序付きリストが指定されています。ラベルのこの順序付けられたリストは、一般ラベルオブジェクトの（このセクションで定義されるように）32ビットのラベル値のシーケンスとして符号化される（クラス民= 16、C-タイプ= 2）/ TLV（0x0825）。仮想連結信号の乗算の場合には、最終的な信号に参加するラベルのセットの明示的な順序付きリストが与えられています。ラベルの第1のセットは第一の仮想連結信号によって占有されるタイムスロットを示し、ラベルの第二のセットは2番目の仮想連結信号によって占有されるタイムスロットを示し、。上記の表現は、単一の（コンポーネント）リンク内に留まるために乗算を制限します。"
    },
    {
      "indent": 3,
      "text": "The format of the label for SONET and/or SDH TDM-LSR link is",
      "ja": "SONETおよび/またはSDH TDM-LSRリンクのラベルのフォーマットは、"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|               S               |   U   |   K   |   L   |   M   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "This is an extension of the numbering scheme defined in [G.707], Sections 7.3.7 through 7.3.13; i.e., the (K, L, M) numbering. Note that the higher order numbering scheme defined in [G.707], Sections 7.3.1 through 7.3.6, is not used here.",
      "ja": "これは、7.3.13スルー[G.707]で定義された番号付け方式の拡張、セクション7.3.7です。すなわち、（K、L、M）の番号。 [G.707]で定義された高次のナンバリングスキームは、セクション7.3.1 7.3.6を通して、ここで使用されていないことに留意されたいです。"
    },
    {
      "indent": 3,
      "text": "Each letter indicates a possible branch number starting at the parent node in the multiplex structure. Branches are considered as being numbered in increasing order, starting from the top of the multiplexing structure. The numbering starts at 1; zero is used to indicate a non-significant or ignored field.",
      "ja": "各文字は、多重構造の親ノードから始まる可能分岐数を示しています。分岐は、多重構造の先頭から、昇順に番号付けされていると考えられています。番号は1から始まります。ゼロは非有意または無視フィールドを示すために使用されます。"
    },
    {
      "indent": 3,
      "text": "When a field is not significant or ignored in a particular context, it MUST be set to zero when transmitted and ignored when received.",
      "ja": "フィールドは、特定の文脈において重要または無視されない場合に送信される場合、それはゼロに設定しなければならなくて、受信時に無視します。"
    },
    {
      "indent": 3,
      "text": "When a hierarchy of SONET/SDH LSPs is used, a higher-order LSP with a given bandwidth can be used to carry lower-order LSPs. Remember that a higher-order LSP is established through a SONET/SDH higher-order path layer network, and a lower-order LSP through a SONET/SDH lower-order path layer network (see also ITU-T G.803, Section 3, for the",
      "ja": "SONET / SDH LSPの階層が使用される場合、所定の帯域幅を持つ高次LSPは下位LSPを運ぶために使用することができます。高次LSPがSONET / SDH下位パスレイヤネットワークを介してSONET / SDH高次パスレイヤネットワーク、及び下位LSPを介して確立されることを思い出してください（また、ITU-T G. 803、第3章を参照の、 のために"
    },
    {
      "indent": 3,
      "text": "corresponding definitions). In this context, the higher-order SONET/SDH LSP behaves as a \"virtual link\" with a given bandwidth (e.g., VC-3); it may also be used as a Forwarding Adjacency. A lower-order SONET/SDH LSP can be established through that higher-order LSP. Since a label is local to a (virtual) link, the highest part of that label (i.e., the S, U, and K fields) is non-significant and is set to zero; i.e., the label is \"0,0,0,L,M\". Similarly, if the structure of the lower-order LSP is unknown or not relevant, the lowest part of that label (i.e., the L and M fields) is non-significant and is set to zero; i.e., the label is \"S,U,K,0,0\".",
      "ja": "対応する定義）。この文脈において、高次SONET / SDH LSPは、与えられた帯域幅（例えば、VC-3）を有する「仮想リンク」として振る舞います。それはまた、転送隣接として使用することもできます。下位SONET / SDH LSPは、その高次LSPを介して確立することができます。ラベルは、（仮想の）リンクに対してローカルであるため、そのラベルの最も高い部分（すなわち、S、U、及びKフィールド）非有意であり、ゼロに設定されています。すなわち、ラベルは \"0,0,0、L、M\" です。下位の構造は、LSPが不明または関連しない場合には同様に、そのラベルの最下部（すなわち、L及びMフィールド）非有意であり、ゼロに設定されています。すなわち、ラベルは \"S、U、K、0,0\" です。"
    },
    {
      "indent": 3,
      "text": "For instance, a VC-3 LSP can be used to carry lower-order LSPs. In that case, the labels allocated between the two ends of the VC-3 LSP for the lower-order LSPs will have S, U, and K set to zero (i.e., non-significant) while L and M will be used to indicate the signal allocated in that VC-3.",
      "ja": "例えば、VC-3 LSPは下位LSPを運ぶために使用することができます。その場合には、下位のLSPのためのVC-3 LSPの両端間に割り当てられたラベルは、S、U、およびKはLとMを示すために使用されながらゼロ（すなわち、非有意）に設定されます信号は、VC-3に割り当てられました。"
    },
    {
      "indent": 3,
      "text": "In case of tunneling, such as VC-4 containing VC-3 containing VC-12/VC-11, where the SUKLM structure is not adequate to represent the full signal structure, a hierarchical approach must be used; i.e., per layer network signaling.",
      "ja": "そのようなVC-4を含むVC-3 VC-12 / VC-11を含む、SUKLM構造は、完全な信号構造を表現するのに十分ではないようなトンネリングの場合には、階層的なアプローチが使用されなければなりません。すなわち、レイヤネットワークシグナリングあたり。"
    },
    {
      "indent": 3,
      "text": "The possible values of S, U, K, L, and M are defined as follows:",
      "ja": "次のようにS、U、K、L、及びMの可能な値が定義されています。"
    },
    {
      "indent": 3,
      "text": "1. S=1->N is the index of a particular STS-3/AUG-1 inside an STS-N/STM-N multiplex. S is only significant for SONET STS-N (N>1) and SDH STM-N (N>0). S must be 0 and ignored for STS-1 and STM-0.",
      "ja": "1. S = 1-> Nは、STS-N / STM-Nの多重内部の特定のSTS-3/8月-1のインデックスです。 Sは、SONET STS-N（N> 1）とSDH STM-N（N> 0）に対してのみ有意です。 Sは、STS-1およびSTM-0のため0と無視しなければなりません。"
    },
    {
      "indent": 3,
      "text": "2. U=1->3 is the index of a particular STS-1_SPE/VC-3 within an STS-3/AUG-1. U is only significant for SONET STS-N (N>1) and SDH STM-N (N>0). U must be 0 and ignored for STS-1 and STM-0.",
      "ja": "2. U = 1-> 3は、STS-3/8月-1内の特定のSTS-1_SPE / VC-3の指標です。 Uは、SONET STS-N（N> 1）とSDH STM-N（N> 0）に対してのみ有意です。 Uは、STS-1およびSTM-0のため0と無視しなければなりません。"
    },
    {
      "indent": 3,
      "text": "3. K=1->3 is the index of a particular TUG-3 within a VC-4. K is only significant for an SDH VC-4 structured in TUG-3s. K must be 0 and ignored in all other cases.",
      "ja": "3. K = 1-> 3 VC-4内の特定のTUG-3の指標です。 Kは、SDH VC-4のTUG-で構造化のためにのみ重要です。 Kは0で、他のすべての例では無視しなければなりません。"
    },
    {
      "indent": 3,
      "text": "4. L=1->7 is the index of a particular VT_Group/TUG-2 within an STS-1_SPE/TUG-3 or VC-3. L must be 0 and ignored in all other cases.",
      "ja": "4. L = 1->図7は、STS-1_SPE / TUG-3またはVC-3内の特定VT_Group / TUG-2のインデックスです。 Lは0で、他のすべての例では無視しなければなりません。"
    },
    {
      "indent": 3,
      "text": "5. M is the index of a particular VT1.5_SPE/VC-11, VT2_SPE/VC-12, or VT3_SPE within a VT_Group/TUG-2. M=1->2 indicates a specific VT3 SPE inside the corresponding VT Group; these values MUST NOT be used for SDH, since there is no equivalent of VT3 with SDH. M=3->5 indicates a specific VT2_SPE/VC-12 inside the corresponding VT_Group/TUG-2. M=6->9 indicates a specific VT1.5_SPE/VC-11 inside the corresponding VT_Group/TUG-2.",
      "ja": "5. MはVT_Group / TUG-2内の特定VT1.5_SPE / VC-11の指標、VT2_SPE / VC-12、又はVT3_SPEあります。 M = 1-> 2は、対応するVTグループ内の特定VT3 SPEを示します。 SDHとVT3のない等価ではありませんので、これらの値は、SDHのために使用してはいけません。 M = 3->図5は、対応するVT_Group / TUG-2内の特定VT2_SPE / VC-12を示しています。 M = 6>図9は、対応するVT_Group / TUG-2内の特定VT1.5_SPE / VC-11を示しています。"
    },
    {
      "indent": 3,
      "text": "Note that a label always has to be interpreted according the SONET/SDH traffic parameters; i.e., a label by itself does not allow knowing which signal is being requested (a label is context sensitive).",
      "ja": "ラベルは常にSONET / SDHトラフィックパラメータに従って解釈されなければならないことに留意されたいです。すなわち、それ自体によってラベルが要求されている信号を知ることはできません（ラベルはコンテキスト依存です）。"
    },
    {
      "indent": 3,
      "text": "The label format defined in this section, referred to as SUKLM, MUST be used for any SONET/SDH signal requests that are not transparent; i.e., when all Transparency (T) bits defined in Section 2.1 are set to zero. Any transparent STS-1/STM-0/STS-3*N/STM-N (N=1, 4, 16, 64, 256) signal request MUST use a label format as defined in [RFC3471].",
      "ja": "SUKLMと称されるこのセクションで定義されたラベルフォーマットは、透明ではない任意のSONET / SDH信号の要求のために使用されなければなりません。即ち、セクション2.1で定義されたすべての透明度（T）ビットがゼロに設定されている場合。 [RFC3471]で定義されるような任意の透明なSTS-1 / STM-0 / STS-3 * N / STM-N（N = 1、4、16、64、256）信号要求は、ラベルフォーマットを使用しなければなりません。"
    },
    {
      "indent": 3,
      "text": "The S encoding is summarized in the following table:",
      "ja": "Sエンコーディングを以下の表に要約されます。"
    },
    {
      "indent": 3,
      "text": " S    SDH                     SONET\n------------------------------------------------\n 0    other                   other\n 1    1st AUG-1               1st STS-3\n 2    2nd AUG-1               2nd STS-3\n 3    3rd AUG-1               3rd STS-3\n 4    4rd AUG-1               4rd STS-3\n :    :                       :\n N    Nth AUG-1               Nth STS-3",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The U encoding is summarized in the following table:",
      "ja": "U符号化は以下の表に要約されます。"
    },
    {
      "indent": 3,
      "text": " U    SDH AUG-1               SONET STS-3\n-------------------------------------------------\n 0    other                   other\n 1    1st VC-3                1st STS-1 SPE\n 2    2nd VC-3                2nd STS-1 SPE\n 3    3rd VC-3                3rd STS-1 SPE",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The K encoding is summarized in the following table:",
      "ja": "K符号化は以下の表に要約されます。"
    },
    {
      "indent": 3,
      "text": " K    SDH VC-4\n---------------\n 0    other\n 1    1st TUG-3\n 2    2nd TUG-3\n 3    3rd TUG-3",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The L encoding is summarized in the following table:",
      "ja": "Lのエンコーディングを以下の表に要約されます。"
    },
    {
      "indent": 3,
      "text": " L    SDH TUG-3    SDH VC-3    SONET STS-1 SPE\n-------------------------------------------------\n 0    other        other       other\n 1    1st TUG-2    1st TUG-2   1st VTG\n 2    2nd TUG-2    2nd TUG-2   2nd VTG\n 3    3rd TUG-2    3rd TUG-2   3rd VTG\n 4    4th TUG-2    4th TUG-2   4th VTG\n 5    5th TUG-2    5th TUG-2   5th VTG\n 6    6th TUG-2    6th TUG-2   6th VTG\n 7    7th TUG-2    7th TUG-2   7th VTG",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The M encoding is summarized in the following table:",
      "ja": "Mエンコーディングを以下の表に要約されます。"
    },
    {
      "indent": 3,
      "text": " M    SDH TUG-2                 SONET VTG\n-------------------------------------------------\n 0    other                     other\n 1    -                         1st VT3 SPE\n 2    -                         2nd VT3 SPE\n 3    1st VC-12                 1st VT2 SPE\n 4    2nd VC-12                 2nd VT2 SPE\n 5    3rd VC-12                 3rd VT2 SPE\n 6    1st VC-11                 1st VT1.5 SPE\n 7    2nd VC-11                 2nd VT1.5 SPE\n 8    3rd VC-11                 3rd VT1.5 SPE\n 9    4th VC-11                 4th VT1.5 SPE",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Examples of Labels",
      "ja": "ラベルの例"
    },
    {
      "indent": 3,
      "text": "Example 1: the label for the STS-3c_SPE/VC-4 in the Sth STS-3/AUG-1 is: S>0, U=0, K=0, L=0, M=0.",
      "ja": "実施例1：SthをSTS-3/8月-1 STS-3c_SPE / VC-4のための標識である：S> 0、U = 0、K = 0、L = 0、M = 0。"
    },
    {
      "indent": 3,
      "text": "Example 2: the label for the VC-3 within the Kth-1 TUG-3 within the VC-4 in the Sth AUG-1 is: S>0, U=0, K>0, L=0, M=0.",
      "ja": "実施例2：s番目の8月-1におけるVC-4内の第K-1 TUG-3内のVC-3のための標識である：S> 0、U = 0、K> 0、L = 0、M = 0 。"
    },
    {
      "indent": 3,
      "text": "Example 3: the label for the Uth-1 STS-1_SPE/VC-3 within the Sth STS-3/AUG-1 is: S>0, U>0, K=0, L=0, M=0.",
      "ja": "実施例3：SthをSTS-3/8月1以内U番目-1 STS-1_SPE / VC-3のラベルがある：S> 0、U> 0、K = 0、L = 0、M = 0。"
    },
    {
      "indent": 3,
      "text": "Example 4: the label for the VT6/VC-2 in the Lth-1 VT Group/TUG-2 in the Uth-1 STS-1_SPE/VC-3 within the Sth STS-3/AUG-1 is: S>0, U>0, K=0, L>0, M=0.",
      "ja": "実施例4：SthをSTS-3/8月1以内U番目-1 STS-1_SPE / VC-3における第L-1 VTグループ/ TUG-2におけるVT6 / VC-2の標識である：S> 0 、U> 0、K = 0、L> 0、M = 0。"
    },
    {
      "indent": 3,
      "text": "Example 5: the label for the 3rd VT1.5_SPE/VC-11 in the Lth-1 VT Group/TUG-2 within the Uth-1 STS-1_SPE/VC-3 within the Sth STS-3/AUG-1 is: S>0, U>0, K=0, L>0, M=8.",
      "ja": "実施例5：SthをSTS-3/8月1以内U番目-1 STS-1_SPE / VC-3内の第L-1 VTグループ/ TUG-2における第3 VT1.5_SPE / VC-11のラベルです。 S> 0、U> 0、K = 0、L> 0、M = 8。"
    },
    {
      "indent": 3,
      "text": "Example 6: the label for the STS-12c SPE/VC-4-4c which uses the 9th STS-3/AUG-1 as its first timeslot is: S=9, U=0, K=0, L=0, M=0.",
      "ja": "実施例6：その最初のタイムスロットとして9 STS-3/8月-1を使用してSTS-12cはSPE / VC-4-4Cためのラベルである：S = 9、U = 0、K = 0、L = 0、 M = 0。"
    },
    {
      "indent": 3,
      "text": "In case of contiguous concatenation, the label that is used is the lowest label (value) of the contiguously concatenated signal, as explained before. The higher part of the label indicates where the signal starts, and the lowest part is not significant.",
      "ja": "前に説明したように連続した連結の場合には、使用される標識は、連続連結信号の最下位ラベル（値）です。信号が始まるラベルの高い部分を示し、最も低い部分は重要ではありません。"
    },
    {
      "indent": 3,
      "text": "In case of STM-0/STS-1, the values of S, U, and K must be equal to zero, according to the field coding rules. For instance, when a VC-3 in an STM-0 is requested, the label is S=0, U=0, K=0, L=0, M=0. When a VC-11 in a VC-3 in an STM-0 is requested, the label is S=0, U=0, K=0, L>0, M=6..9.",
      "ja": "STM-0 / STS-1の場合には、Sの値は、U、及びKは、フィールド符号化規則に従って、ゼロに等しくなければなりません。例えば、VC-3 STM-0には、要求されたときに、ラベルがS = 0、U = 0、K = 0、L = 0、M = 0です。 VC-11、VC-3におけるSTM-0においては、要求された場合、ラベルはS = 0であり、U = 0、K = 0、L> 0、M = 6..9。"
    },
    {
      "indent": 3,
      "text": "Note: when a Section/RS or Line/MS transparent STS-1/STM-0/ STS-3*N/STM-N (N=1, 4, 16, 64, 256) signal is requested, the SUKLM label format and encoding is not applicable, and the label encoding MUST follow the rules defined in [RFC3471], Section 3.2.",
      "ja": "注：ときセクション/ RS又はライン/ MSは、透明なSTS-1 / STM-0 / STS-3 * N / STM-N（N = 1、4、16、64、256）信号が要求され、SUKLMラベルフォーマット符号化は適用されない、とラベルエンコーディングは、セクション3.2 [RFC3471]で定義されたルールに従わなければなりません。"
    },
    {
      "indent": 0,
      "text": "4. Acknowledgements",
      "section_title": true,
      "ja": "4.謝辞"
    },
    {
      "indent": 3,
      "text": "Valuable comments and input were received from the CCAMP mailing list, where outstanding discussions took place.",
      "ja": "貴重なコメント入力は優れた議論が行われたCCAMPメーリングリストから受け取りました。"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Richard Rabbat for his valuable input, which lead to this revision.",
      "ja": "著者は、この改正につながる貴重な入力のためのリチャードRabbatに感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "This document introduces no new security considerations to either [RFC3473] or [RFC3472]. GMPLS security is described in Section 11 of [RFC3471] and refers to [RFC3209] for RSVP-TE and to [RFC3212] for CR-LDP.",
      "ja": "この文書では、[RFC3473]か[RFC3472]のいずれかにどんな新しいセキュリティ問題も紹介しません。 GMPLSセキュリティは、[RFC3471]のセクション11に記載され、RSVP-TEのため及びCR-LDPのために[RFC3212]と[RFC3209]を指します。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "Three values defined by IANA for RFC 3946 now apply to this document.",
      "ja": "RFC 3946のためにIANAによって定義された3つの値が今、この文書に適用されます。"
    },
    {
      "indent": 3,
      "text": "Two RSVP C-Types in registry: http://www.iana.org/assignments/rsvp-parameters",
      "ja": "レジストリ内の二つのRSVP-Cタイプ：http://www.iana.org/assignments/rsvp-parameters"
    },
    {
      "indent": 3,
      "text": "- A SONET/SDH SENDER_TSPEC object: Class = 12, C-Type = 4 (see Section 2.2).",
      "ja": " -  SONET / SDH SENDER_TSPECオブジェクト：クラス= 12、C-タイプ= 4（2.2節を参照）。"
    },
    {
      "indent": 3,
      "text": "- A SONET/SDH FLOWSPEC object: Class = 9, C-Type = 4 (see Section 2.2).",
      "ja": " -  SONET / SDH FLOWSPECオブジェクト：クラス= 9、C-タイプ= 4（2.2節を参照）。"
    },
    {
      "indent": 3,
      "text": "One LDP TLV Type in registry: http://www.iana.org/assignments/ldp-namespaces",
      "ja": "レジストリ内の一つLDP TLVタイプ：http://www.iana.org/assignments/ldp-namespaces"
    },
    {
      "indent": 3,
      "text": "- A type field for the SONET/SDH Traffic Parameters TLV (see Section 2.3).",
      "ja": " -  SONET / SDHトラフィックパラメータTLVのタイプ・フィールド（2.3節を参照してください）。"
    },
    {
      "indent": 0,
      "text": "Contributors",
      "ja": "協力者"
    },
    {
      "indent": 3,
      "text": "Contributors are listed in alphabetical order:",
      "ja": "寄稿者はアルファベット順にリストされています。"
    },
    {
      "indent": 3,
      "text": "Stefan Ansorge (Alcatel) Lorenzstrasse 10 70435 Stuttgart, Germany EMail: stefan.ansorge@alcatel.de",
      "ja": "ステファンAnsorge（アルカテル）Lorenzstrasse 10 70435シュトゥットガルト、ドイツのEメール：stefan.ansorge@alcatel.de"
    },
    {
      "indent": 3,
      "text": "Peter Ashwood-Smith (Nortel) PO. Box 3511 Station C, Ottawa, ON K1Y 4H7, Canada EMail:petera@nortelnetworks.com",
      "ja": "ピーター・アッシュウッド・スミス（ノーテル）PO。ボックス3511 K1Y 4H7 ON駅C、オタワ、カナダEメール：petera@nortelnetworks.com"
    },
    {
      "indent": 3,
      "text": "Ayan Banerjee (Calient) 5853 Rue Ferrari San Jose, CA 95138, USA EMail: abanerjee@calient.net",
      "ja": "アヤンバネルジー（カリエンテ）5853ルーフェラーリカリフォルニア州サンノゼ95138、USA Eメール：banerjee@calient.net"
    },
    {
      "indent": 3,
      "text": "Lou Berger (Movaz) 7926 Jones Branch Drive McLean, VA 22102, USA EMail: lberger@movaz.com",
      "ja": "ルー・バーガー（Movaz）7926・ジョーンズ支店ドライブマクリーン、VA 22102、USA Eメール：lberger@movaz.com"
    },
    {
      "indent": 3,
      "text": "Greg Bernstein (Ciena) 10480 Ridgeview Court Cupertino, CA 94014, USA EMail: greg@ciena.com",
      "ja": "グレッグ・バーンスタイン（シエナ）10480 Ridgeview裁判所クパチーノ、CA 94014、USA Eメール：greg@ciena.com"
    },
    {
      "indent": 3,
      "text": "Angela Chiu (Celion) One Sheila Drive, Suite 2 Tinton Falls, NJ 07724-2658 EMail: angela.chiu@celion.com",
      "ja": "アンジェラ・チウ（Celion）ワンシーラ・ドライブ、スイート2ティントンフォールズ、NJ 07724から2658 Eメール：angela.chiu@celion.com"
    },
    {
      "indent": 3,
      "text": "John Drake (Calient) 5853 Rue Ferrari San Jose, CA 95138, USA EMail: jdrake@calient.net",
      "ja": "ジョン・ドレイク（カリエンテ）5853ルーフェラーリカリフォルニア州サンノゼ95138、USA Eメール：dreke@calient.net"
    },
    {
      "indent": 3,
      "text": "Yanhe Fan (Axiowave) 100 Nickerson Road Marlborough, MA 01752, USA EMail: yfan@axiowave.com",
      "ja": "Yanheファン（Axiowave）100ニッカーソン道路マールボロ、MA 01752、USA Eメール：yfan@axiowave.com"
    },
    {
      "indent": 3,
      "text": "Michele Fontana (Alcatel) Via Trento 30, I-20059 Vimercate, Italy EMail: michele.fontana@alcatel.it",
      "ja": "トレント30、I-20059ヴィメルカーテ、イタリアの電子メールを介してミケーレフォンタナ（アルカテル）：michele.fontana@alcatel.it"
    },
    {
      "indent": 3,
      "text": "Gert Grammel (Alcatel) Lorenzstrasse, 10 70435 Stuttgart, Germany EMail: gert.grammel@alcatel.de",
      "ja": "ゲルトGrammel（アルカテル）ローレンツシュトラーセ10 70435シュトゥットガルト、ドイツEメール：gert.grammel@alcatel.de"
    },
    {
      "indent": 3,
      "text": "Juergen Heiles (Siemens) Hofmannstr. 51 D-81379 Munich, Germany EMail: juergen.heiles@siemens.com",
      "ja": "ユルゲンハイレス（シーメンス）Hofmannstr。 51 D-81379ミュンヘン、ドイツEメール：juergen.heiles@siemens.com"
    },
    {
      "indent": 3,
      "text": "Suresh Katukam (Cisco) 1450 N. McDowell Blvd, Petaluma, CA 94954-6515, USA EMail: suresh.katukam@cisco.com",
      "ja": "スレシュKatukam（シスコ）1450 N.マクダウェルブルバード、ペタルマ、CA 94954から6515、USA Eメール：suresh.katukam@cisco.com"
    },
    {
      "indent": 3,
      "text": "Kireeti Kompella (Juniper) 1194 N. Mathilda Ave. Sunnyvale, CA 94089, USA EMail: kireeti@juniper.net",
      "ja": "Kireeti Kompella（ジュニパー）1194 N.マチルダアベニュー。サニーベール、CA 94089、USA Eメール：kireeti@juniper.net"
    },
    {
      "indent": 3,
      "text": "Jonathan P. Lang (Calient) 25 Castilian Goleta, CA 93117, USA EMail: jplang@calient.net",
      "ja": "ジョナサンP.ラング（カリエンテ）カスティリャ25ゴレタ、CA 93117、USA Eメール：jplang@calient.net"
    },
    {
      "indent": 3,
      "text": "Fong Liaw (Solas Research) EMail: fongliaw@yahoo.com",
      "ja": "フォンLiaw（ソラスリサーチ）メール：fongliaw@yahoo.com"
    },
    {
      "indent": 3,
      "text": "Zhi-Wei Lin (Lucent) 101 Crawfords Corner Rd Holmdel, NJ 07733-3030, USA EMail: zwlin@lucent.com",
      "ja": "ZのHi-魏林（ルーセント）101クロフォードはコーナーRDホルムデル、ニュージャージー州07733から3030、USAのメールです：lucent.com @森"
    },
    {
      "indent": 3,
      "text": "Ben Mack-Crane (Tellabs) EMail: ben.mack-crane@tellabs.com",
      "ja": "ベン・マック・クレーン（テラブス）メール：ben.mack-crane@tellabs.com"
    },
    {
      "indent": 3,
      "text": "Dimitrios Pendarakis (Tellium) 2 Crescent Place, P.O. Box 901 Oceanport, NJ 07757-0901, USA EMail: dpendarakis@tellium.com",
      "ja": "ディミトリオスPendarakis（Tellium）2クレセントプレイス、P.O.ボックス901 Oceanport、NJ 07757から0901、USA Eメール：dpendarakis@tellium.com"
    },
    {
      "indent": 3,
      "text": "Mike Raftelis (White Rock) 18111 Preston Road Dallas, TX 75252, USA",
      "ja": "マイク・Raftelis（ホワイトロック）18111プレストンロードダラス、TX 75252、USA"
    },
    {
      "indent": 3,
      "text": "Bala Rajagopalan (Tellium) 2 Crescent Place, P.O. Box 901 Oceanport, NJ 07757-0901, USA EMail: braja@tellium.com",
      "ja": "バラRajagopalan（Tellium）2クレセントプレイス、P.O.ボックス901 Oceanport、NJ 07757から0901、USA Eメール：braja@tellium.com"
    },
    {
      "indent": 3,
      "text": "Yakov Rekhter (Juniper) 1194 N. Mathilda Ave. Sunnyvale, CA 94089, USA EMail: yakov@juniper.net",
      "ja": "ヤコフ・レックター（ジュニパー）1194 N.マチルダアベニュー。サニーベール、CA 94089、USA Eメール：yakov@juniper.net"
    },
    {
      "indent": 3,
      "text": "Debanjan Saha (Tellium) 2 Crescent Place, P.O. Box 901 Oceanport, NJ 07757-0901, USA EMail: dsaha@tellium.com",
      "ja": "Debanjanサハ（Tellium）2クレセントプレイス、P.O.ボックス901 Oceanport、NJ 07757から0901、USA Eメール：dsaha@tellium.com"
    },
    {
      "indent": 3,
      "text": "Vishal Sharma (Metanoia) 335 Elan Village Lane San Jose, CA 95134, USA EMail: vsharma87@yahoo.com",
      "ja": "ヴィシャル・シャルマ（Metanoia）335エラン村レーンサンノゼ、CA 95134、USA Eメール：vsharma87@yahoo.com"
    },
    {
      "indent": 3,
      "text": "George Swallow (Cisco) 250 Apollo Drive Chelmsford, MA 01824, USA EMail: swallow@cisco.com",
      "ja": "ジョージスワロー（シスコ）250アポロドライブチェルムズフォード、MA 01824、USA Eメール：swallow@cisco.com"
    },
    {
      "indent": 3,
      "text": "Z. Bo Tang (Tellium) 2 Crescent Place, P.O. Box 901 Oceanport, NJ 07757-0901, USA EMail: btang@tellium.com",
      "ja": "Z.ボー唐（Tellium）2クレセントプレイス、P.O.ボックス901 Oceanport、NJ 07757から0901、USA Eメール：btang@tellium.com"
    },
    {
      "indent": 3,
      "text": "Eve Varma (Lucent) 101 Crawfords Corner Rd Holmdel, NJ 07733-3030, USA EMail: evarma@lucent.com",
      "ja": "イブヴァルマ（ルーセント）101 CrawfordsコーナーRdのホルムデル、NJ 07733から3030、USA Eメール：evarma@lucent.com"
    },
    {
      "indent": 3,
      "text": "Yangguang Xu (Lucent) 21-2A41, 1600 Osgood Street North Andover, MA 01845, USA EMail: xuyg@lucent.com",
      "ja": "陽光徐（ルーセント）21-2A41、1600オスグッド・ストリートノースアンドーヴァー、MA 01845、USA Eメール：xuyg@lucent.com"
    },
    {
      "indent": 0,
      "text": "Appendix 1. Signal Type Values Extension for VC-3",
      "ja": "VC-3付録1.信号タイプ値拡張"
    },
    {
      "indent": 3,
      "text": "This appendix defines the following optional additional Signal Type value for the Signal Type field of Section 2.1:",
      "ja": "この付録では、セクション2.1の信号タイプのフィールドに、次のオプションの追加信号タイプの値を定義します。"
    },
    {
      "indent": 3,
      "text": "Value         Type\n-----  ---------------------\n 20     \"VC-3 via AU-3 at the end\"",
      "raw": true
    },
    {
      "indent": 3,
      "text": "According to the ITU-T [G.707] recommendation, a VC-3 in the TU-3/TUG-3/VC-4/AU-4 branch of the SDH multiplex cannot be structured in TUG-2s; however, a VC-3 in the AU-3 branch can be. In addition, a VC-3 could be switched between the two branches, if required.",
      "ja": "ITU-T [G.707]勧告によれば、SDH多重のTU-3 / TUG-3 / VC-4 / AU-4分岐におけるVC-3 TUG-2Sで構成することができません。しかし、VC-3 AU-3のブランチでは、することができます。必要に応じて加えて、VC-3は、二つの枝の間で切り替えることができます。"
    },
    {
      "indent": 3,
      "text": "A VC-3 circuit could be terminated on an ingress interface of an LSR (e.g., forming a VC-3 forwarding adjacency). This LSR could then want to demultiplex this VC-3 and switch internal low-order LSPs. For implementation reasons, this could be only possible if the LSR receives the VC-3 in the AU-3 branch. For example, for an LSR not able to switch internally from a TU-3 branch to an AU-3 branch on its incoming interface before demultiplexing and then switching the content with its switch fabric.",
      "ja": "VC-3回路（例えば、VC-3フォワーディング隣接を形成する）LSRの入力インターフェイスで終端することができます。このLSRは、このVC-3を分離し、内部下位LSPを切り替えたいことができます。 LSRは、AU-3のブランチにおけるVC-3を受信した場合、実装上の理由から、これが唯一の可能性である可能性があります。逆多重化し、そのスイッチファブリックでコンテンツを切り替える前に、その着信インターフェイス上のAU-3ブランチにTU-3ブランチから内部に切り替える例えば、LSRのためにできません。"
    },
    {
      "indent": 3,
      "text": "In that case, it is useful to indicate that the VC-3 LSP must be terminated at the end in the AU-3 branch instead of the TU-3 branch.",
      "ja": "その場合には、VC-3 LSPの代わりにTU-3枝のAU-3支店で終わりで終了しなければならないことを示すために有用です。"
    },
    {
      "indent": 3,
      "text": "This is achieved by using the \"VC-3 via AU-3 at the end\" signal type. This information can be used, for instance, by the penultimate LSR to switch an incoming VC-3 received in any branch to the AU-3 branch on the outgoing interface to the destination LSR.",
      "ja": "これは、信号種別「終了時にAU-3を介してVC-3」を使用することによって達成されます。この情報は、着信VC-3先LSRへの発信インターフェイス上のAU-3分岐のいずれかのブランチで受信を切り替えるために、例えば、最後から二番目のLSRによって、使用することができます。"
    },
    {
      "indent": 3,
      "text": "The \"VC-3 via AU-3 at the end\" signal type does not imply that the VC-3 must be switched via the AU-3 branch at some other places in the network. The VC-3 signal type just indicates that a VC-3 in any branch is suitable.",
      "ja": "「VC-3 AU-3を経由して最後に」信号タイプは、VC-3は、ネットワーク内の他の場所でAU-3の分岐を経て切り替えなければならないことを意味するものではありません。 VC-3信号タイプは、単にVC-3の任意のブランチでは適切であることを示しています。"
    },
    {
      "indent": 0,
      "text": "Annex 1. Examples",
      "ja": "附属書1例"
    },
    {
      "indent": 3,
      "text": "This annex defines examples of SONET and SDH signal coding. The objective is to help the reader to understand how the traffic parameter coding works and not to give examples of typical SONET or SDH signals.",
      "ja": "この附属書は、SONETおよびSDH信号の符号化の例を定義します。目的は、トラフィックパラメータ作品をコーディングし、典型的なSONETまたはSDH信号の例を与えない方法を理解するために読者を支援することです。"
    },
    {
      "indent": 3,
      "text": "As stated above, signal types are Elementary Signals to which successive concatenation, multiplication, and transparency transforms can be applied to obtain Final Signals.",
      "ja": "上述したように、信号タイプは、連続連結、乗算、及び透明度変換が最終信号を得るために適用可能な基本信号です。"
    },
    {
      "indent": 3,
      "text": "1. A VC-4 signal is formed by the application of RCC with value 0, NCC with value 0, NVC with value 0, MT with value 1, and T with value 0 to a VC-4 Elementary Signal.",
      "ja": "1. A VC-4信号は値0を有するRCCの適用によって形成される、NCC値0と値0とのNVC、MT値1、及びTとVC-4小学校信号に値0を持ちます。"
    },
    {
      "indent": 3,
      "text": "2. A VC-4-7v signal is formed by the application of RCC with value 0, NCC with value 0, NVC with value 7 (virtual concatenation of 7 components), MT with value 1, and T with value 0 to a VC-4 Elementary Signal.",
      "ja": "2. A VC-4-7v信号が値0を有するRCCの適用によって形成される、値0を有するNCC、値7を持つNVC（7つの成分のバーチャルコンカチネーション）、MT値1、及びTと値0とのVCに-4小学校信号。"
    },
    {
      "indent": 3,
      "text": "3. A VC-4-16c signal is formed by the application of RCC with value 1 (standard contiguous concatenation), NCC with value 16, NVC with value 0, MT with value 1, and T with value 0 to a VC-4 Elementary Signal.",
      "ja": "3. A VC-4-16c信号は、VC-4の値0と値1と、MT値0と値16、NVCと値1（標準の連続連結）、NCCとRCCの塗布により形成され、そしてTれます小学校信号。"
    },
    {
      "indent": 3,
      "text": "4. An STM-16 signal with Multiplex Section layer transparency is formed by the application of RCC with value 0, NCC with value 0, NVC with value 0, MT with value 1, and T with flag 2 to an STM-16 Elementary Signal.",
      "ja": "多重セクション層の透明性を有する4アンSTM-16信号は値0で、NVC値0で、NCC値0とRCCの適用によって形成される、フラグ2と値1、及びTとSTM-16小学校信号にMT 。"
    },
    {
      "indent": 3,
      "text": "5. An STM-4 signal with Multiplex Section layer transparency is formed by the application of RCC with value 0, NCC with value 0, NVC with value 0, MT with value 1, and T with flag 2 applied to an STM-4 Elementary Signal.",
      "ja": "多重セクション層の透明5.アンSTM-4信号が値0で、NVC値0で、NCC値0とRCCの適用によって形成される、MTは、フラグ2と値1、及びTとSTM-4小学校に適用しました信号。"
    },
    {
      "indent": 3,
      "text": "6. An STM-256 signal with Multiplex Section layer transparency is formed by the application of RCC with value 0, NCC with value 0, NVC with value 0, MT with value 1, and T with flag 2 applied to an STM-256 Elementary Signal.",
      "ja": "多重セクション層の透明性を有する6アンSTM-256信号が値0で、NVC値0で、NCC値0とRCCの適用によって形成される、MTは、フラグ2と値1、及びTとSTM-256小学校に適用しました信号。"
    },
    {
      "indent": 3,
      "text": "7. An STS-1 SPE signal is formed by the application of RCC with value 0, NCC with value 0, NVC with value 0, MT with value 1, and T with value 0 to an STS-1 SPE Elementary Signal.",
      "ja": "STS-1 SPE基本信号に値0と値1、及びT 7.アンSTS-1 SPE信号は値0を有するRCCの適用によって形成される、値0を有するNCC、NVC値0と、MT。"
    },
    {
      "indent": 3,
      "text": "8. An STS-3c SPE signal is formed by the application of RCC with value 1 (standard contiguous concatenation), NCC with value 1, NVC with value 0, MT with value 1, and T with value 0 to an STS-3c SPE Elementary Signal.",
      "ja": "8.アンSTS-3cはSPE信号は値1（標準の連続連結）とRCCの適用によって形成され、値1を有するNCC、値0とNVC、MT値1、及びTと値0とのSTS-3cはSPEに小学校信号。"
    },
    {
      "indent": 3,
      "text": "9. An STS-48c SPE signal is formed by the application of RCC with value 1 (standard contiguous concatenation), NCC with value 16, NVC with value 0, MT with value 1, and T with value 0 to an STS-3c SPE Elementary Signal.",
      "ja": "9.アンSTS-48CのSPE信号は、STS-3cはSPEに値0と値1と、MT値0と値16、NVCと値1（標準の連続連結）、NCCとRCCの塗布により形成され、そしてTれます小学校信号。"
    },
    {
      "indent": 3,
      "text": "10. An STS-1-3v SPE signal is formed by the application of RCC with value 0, NVC with value 3 (virtual concatenation of 3 components), MT with value 1, and T with value 0 to an STS-1 SPE Elementary Signal.",
      "ja": "10.アンSTS-1-3v SPE信号は、STS-1 SPE小学校、NVC値3（3つの成分のバーチャルコンカチネーション）と、MT値0と値1、及びTとを値0とRCCの塗布により形成されます信号。"
    },
    {
      "indent": 3,
      "text": "11. An STS-3c-9v SPE signal is formed by the application of RCC with value 1, NCC with value 1, NVC with value 9 (virtual concatenation of 9 STS-3c), MT with value 1, and T with value 0 to an STS-3c SPE Elementary Signal.",
      "ja": "11.アンSTS-3C-9VのSPE信号は値1と、NCC値1とRCCの塗布によって形成される、NVC値0と値1とMT、およびT値9（9 ST​​S-3cのバーチャルコンカチネーション）とSTS-3cのSPE小学校の信号へ。"
    },
    {
      "indent": 3,
      "text": "12. An STS-12 signal with Section layer (full) transparency is formed by the application of RCC with value 0, NCC with value 0, NVC with value 0, MT with value 1, and T with flag 1 to an STS-12 Elementary Signal.",
      "ja": "STS-12にフラグ1で値1、及びTと値0のセクション層（フル）透明性が値0を有するRCCの適用によって形成される、NCC、値0とNVC、MT 12.アンSTS-12信号小学校信号。"
    },
    {
      "indent": 3,
      "text": "13. A 3 x STS-768c SPE signal is formed by the application of RCC with value 1, NCC with value 256, NVC with value 0, MT with value 3, and T with value 0 to an STS-3c SPE Elementary Signal.",
      "ja": "13. A 3×STS-768cのSPE信号は、STS-3cのSPE素信号に値0と値3と値0、MTと値256、NVCと値1、NCCとRCCの塗布により形成され、そしてTれます。"
    },
    {
      "indent": 3,
      "text": "14. A 5 x VC-4-13v composed signal is formed by the application of RCC with value 0, NVC with value 13, MT with value 5, and T with value 0 to a VC-4 Elementary Signal.",
      "ja": "14. A 5×VC-4-13vなる信号が値0とRCCの適用によって形成される、NVC値13と、MT値5、およびTとVC-4小学校信号に値0を持ちます。"
    },
    {
      "indent": 3,
      "text": "The encoding of these examples is summarized in the following table:",
      "ja": "これらの例の符号化は、以下の表に要約されます。"
    },
    {
      "indent": 3,
      "text": "Signal                     ST   RCC   NCC   NVC   MT   T\n--------------------------------------------------------\nVC-4                        6     0     0     0    1   0\nVC-4-7v                     6     0     0     7    1   0\nVC-4-16c                    6     1    16     0    1   0\nSTM-16 MS transparent      10     0     0     0    1   2\nSTM-4 MS transparent        9     0     0     0    1   2\nSTM-256 MS transparent     12     0     0     0    1   2\nSTS-1 SPE                   5     0     0     0    1   0\nSTS-3c SPE                  6     1     1     0    1   0\nSTS-48c SPE                 6     1    16     0    1   0\nSTS-1-3v SPE                5     0     0     3    1   0\nSTS-3c-9v SPE               6     1     1     9    1   0\nSTS-12 Section transparent  9     0     0     0    1   1\n3 x STS-768c SPE            6     1   256     0    3   0\n5 x VC-4-13v                6     0     0    13    5   0",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Normative References",
      "ja": "引用規格"
    },
    {
      "indent": 3,
      "text": "[G.707] ITU-T Recommendation G.707, \"Network Node Interface for the Synchronous Digital Hierarchy\", October 2000.",
      "ja": "[G.707] ITU-T勧告G.707、 \"同期デジタル階層のためのネットワークノードインタフェース\"、2000年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2205] Braden, R., Zhang, L., Berson, S., Herzog, S., and S. Jamin, \"Resource ReSerVation Protocol (RSVP) -- Version 1 Functional Specification\", RFC 2205, September 1997.",
      "ja": "[RFC2205]ブレーデン、R.、チャン、L.、Berson氏、S.、ハーツォグ、S.、およびS.ヤミン、 \"リソース予約プロトコル（RSVP） - バージョン1の機能的な仕様\"、RFC 2205、1997年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC2210] Wroclawski, J., \"The Use of RSVP with IETF Integrated Services\", RFC 2210, September 1997.",
      "ja": "[RFC2210] Wroclawski、J.、RFC 2210、1997年9月 \"IETF統合サービスとRSVPの使用\"。"
    },
    {
      "indent": 3,
      "text": "[RFC3209] Awduche, D., Berger, L., Gan, D., Li, T., Srinivasan, V., and G. Swallow, \"RSVP-TE: Extensions to RSVP for LSP Tunnels\", RFC 3209, December 2001.",
      "ja": "[RFC3209] Awduche、D.、バーガー、L.、ガン、D.、李、T.、スリニヴァサン、V.、およびG.ツバメ、 \"RSVP-TE：LSPトンネルのためのRSVPの拡張\"、RFC 3209年12月2001。"
    },
    {
      "indent": 3,
      "text": "[RFC3212] Jamoussi, B., Andersson, L., Callon, R., Dantu, R., Wu, L., Doolan, P., Worster, T., Feldman, N., Fredette, A., Girish, M., Gray, E., Heinanen, J., Kilty, T., and A. Malis, \"Constraint-Based LSP Setup using LDP\", RFC 3212, January 2002.",
      "ja": "[RFC3212] Jamoussi、B.、アンダーソン、L.、Callon、R.、Dantu、R.、ウー、L.、Doolan、P.、Worster、T.、フェルドマン、N.、Fredette、A.、Girish、 M.、グレー、E.、Heinanen、J.、Kilty、T.、およびA. Malis、 \"LDPを使用して、制約ベースLSPセットアップ\"、RFC 3212、2002年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC3471] Berger, L., \"Generalized Multi-Protocol Label Switching (GMPLS) Signaling Functional Description\", RFC 3471, January 2003.",
      "ja": "[RFC3471]バーガー、L.、 \"一般化されたマルチプロトコルラベルスイッチング（GMPLS）機能説明シグナリング\"、RFC 3471、2003年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC3472] Ashwood-Smith, P. and L. Berger, \"Generalized Multi-Protocol Label Switching (GMPLS) Signaling Constraint-based Routed Label Distribution Protocol (CR-LDP) Extensions\", RFC 3472, January 2003.",
      "ja": "[RFC3472]アッシュウッド・スミス、P。およびL.バーガー、 \"一般化マルチプロトコルラベルスイッチング（GMPLS）シグナリング制約ベースルーティングのラベル配布プロトコル（CR-LDP）の拡張\"、RFC 3472、2003年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC3473] Berger, L., \"Generalized Multi-Protocol Label Switching (GMPLS) Signaling Resource ReserVation Protocol-Traffic Engineering (RSVP-TE) Extensions\", RFC 3473, January 2003.",
      "ja": "[RFC3473]バーガー、L.、 \"一般化マルチプロトコルラベルスイッチング（GMPLS）シグナリング資源予約プロトコル - トラフィックエンジニアリング（RSVP-TE）を拡張\"、RFC 3473、2003年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC3945] Mannie, E., \"Generalized Multi-Protocol Label Switching (GMPLS) Architecture\", RFC 3945, October 2004.",
      "ja": "[RFC3945]マニー、E.、 \"一般化マルチプロトコルラベルスイッチング（GMPLS）アーキテクチャ\"、RFC 3945、2004年10月。"
    },
    {
      "indent": 3,
      "text": "[T1.105] \"Synchronous Optical Network (SONET): Basic Description Including Multiplex Structure, Rates, and Formats\", ANSI T1.105, October 2000.",
      "ja": "[T1.105] \"同期光ネットワーク（SONET）：多重構造、料金、およびフォーマットを含む基本的な説明\"、ANSI T1.105、2000年10月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Eric Mannie Perceval Rue Tenbosch, 9 1000 Brussels Belgium",
      "ja": "エリック・マニーパーシヴァルルーテンボス、9千ブリュッセルベルギー"
    },
    {
      "indent": 3,
      "text": "Phone: +32-2-6409194 EMail: eric.mannie@perceval.net",
      "ja": "電話：+ 32-2-6409194 Eメール：eric.mannie@perceval.net"
    },
    {
      "indent": 3,
      "text": "Dimitri Papadimitriou Alcatel Copernicuslaan 50 B-2018 Antwerpen, Belgium",
      "ja": "ディミトリPapadimitriouアルカテルKopernikoslaan 50 B-2018アントワープ、Velgiom"
    },
    {
      "indent": 3,
      "text": "Phone: +32 3 240-8491 EMail: dimitri.papadimitriou@alcatel.be",
      "ja": "電話：+32 3 240-8491 Eメール：dimitri.papadimitriou@alcatel.be"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2006).",
      "ja": "著作権（C）インターネット協会（2006）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "この文書では、BCP 78に含まれる権利と許可と制限の適用を受けており、その中の記載を除いて、作者は彼らのすべての権利を保有します。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とCONTRIBUTOR「そのまま」、ORGANIZATION HE / SHEが表すまたはインターネットソサエティおよびインターネット・エンジニアリング・タスク・フォース放棄すべての保証、明示または、（もしあれば）後援ISに設けられています。黙示、情報の利用は、特定の目的に対する権利または商品性または適合性の黙示の保証を侵害しない任意の保証含むがこれらに限定されません。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、本書またはそのような権限下で、ライセンスがたりないかもしれない程度に記載された技術の実装や使用に関係すると主張される可能性があります任意の知的財産権やその他の権利の有効性または範囲に関していかなる位置を取りません利用可能です。またそれは、それがどのような権利を確認する独自の取り組みを行ったことを示すものでもありません。 RFC文書の権利に関する手続きの情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IPRの開示のコピーが利用できるようにIETF事務局とライセンスの保証に行われた、または本仕様の実装者または利用者がそのような所有権の使用のための一般的なライセンスまたは許可を取得するために作られた試みの結果を得ることができますhttp://www.ietf.org/iprのIETFのオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、その注意にこの標準を実装するために必要とされる技術をカバーすることができる任意の著作権、特許または特許出願、またはその他の所有権を持ってすべての利害関係者を招待します。 ietf-ipr@ietf.orgのIETFに情報を記述してください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "了承"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is provided by the IETF Administrative Support Activity (IASA).",
      "ja": "RFCエディタ機能のための資金は、IETF管理サポート活動（IASA）によって提供されます。"
    }
  ]
}