{
  "title": {
    "text": "RFC 2749 - COPS usage for RSVP",
    "ja": "RFC 2749 - RSVP用COPS使い方"
  },
  "number": 2749,
  "created_at": "2019-10-29 18:20:26.672141+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                    S . Herzog, Ed.\nRequest for Comments: 2749                                     IPHighway\nCategory: Standards Track                                       J. Boyle\n                                                                  Level3\n                                                                R. Cohen\n                                                                   Cisco\n                                                               D. Durham\n                                                                   Intel\n                                                                R. Rajan\n                                                                    AT&T\n                                                               A. Sastry\n                                                                   Cisco\n                                                            January 2000",
      "raw": true
    },
    {
      "indent": 26,
      "text": "COPS usage for RSVP",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2000). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2000）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document describes usage directives for supporting COPS policy services in RSVP environments.",
      "ja": "この文書では、RSVP環境でCOPSポリシーサービスをサポートするための使用方法のディレクティブについて説明します。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1 Introduction....................................................2\n2 RSVP values for COPS objects....................................2\n2.1  Common Header, client-type...................................2\n2.2  Context Object (Context).....................................3\n2.3  Client Specific Information (ClientSI).......................4\n2.4  Decision Object (Decision)...................................4\n3 Operation of COPS for RSVP PEPs.................................6\n3.1  RSVP flows...................................................6\n3.2  Expected Associations for RSVP Requests......................6\n3.3  RSVP's Capacity Admission Control: Commit and Delete.........7\n3.4  Policy Control Over PathTear and ResvTear....................7",
      "raw": true
    },
    {
      "indent": 3,
      "text": "3.5  PEP Caching COPS Decisions...................................7\n3.6  Using Multiple Context Flags in a single query...............8\n3.7  RSVP Error Reporting.........................................9\n4 Security Considerations.........................................9\n5 Illustrative Examples, Using COPS for RSVP......................9\n5.1  Unicast Flow Example.........................................9\n5.2  Shared Multicast Flows......................................11\n6 References.....................................................14\n7 Author Information and Acknowledgments.........................15\n8 Full Copyright Statement.......................................17",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1 Introduction",
      "ja": "1はじめに"
    },
    {
      "indent": 3,
      "text": "The Common Open Policy Service (COPS) protocol is a query response protocol used to exchange policy information between a network policy server and a set of clients [COPS]. COPS is being developed within the RSVP Admission Policy Working Group (RAP WG) of the IETF, primarily for use as a mechanism for providing policy-based admission control over requests for network resources [RAP].",
      "ja": "共通オープンポリシーサービス（COPS）プロトコルは、ネットワークポリシーサーバとクライアントのセット[COPS]の間のポリシー情報を交換するために使用されるクエリ応答プロトコルです。 COPSは、[RAP]は、主にネットワークリソースに対する要求オーバーポリシーベースのアドミッション制御を提供するためのメカニズムとして使用するために、IETFのRSVPアドミッションポリシーワーキンググループ（WG RAP）の中で開発されています。"
    },
    {
      "indent": 3,
      "text": "This document is based on and assumes prior knowledge of the RAP framework [RAP] and the basic COPS [COPS] protocol. It provides specific usage directives for using COPS in outsourcing policy control decisions by RSVP clients (PEPs) to policy servers (PDPs).",
      "ja": "この文書は、に基づいてRAPフレームワーク[RAP]と基本COPS [COPS]プロトコルの事前知識を前提としています。これは、ポリシーサーバ（のPDP）へのRSVPクライアント（のPEP）により、アウトソーシングポリシー制御の決定にCOPSを使用するための具体的な使用のディレクティブを提供します。"
    },
    {
      "indent": 3,
      "text": "Given the COPS protocol design, RSVP directives are mainly limited to RSVP applicability, interoperability and usage guidelines, as well as client specific examples.",
      "ja": "COPSプロトコルの設計を考えると、RSVPディレクティブは、適用性、そして相互運用ガイドラインの使用と同様に、クライアントの具体例をRSVPに主に限定されています。"
    },
    {
      "indent": 0,
      "text": "2 RSVP values for COPS objects",
      "ja": "COPSオブジェクトの2つのRSVP値"
    },
    {
      "indent": 3,
      "text": "The usage of several COPS objects is affected when used with the RSVP client type. This section describes these objects and their usage.",
      "ja": "RSVPのクライアントタイプで使用する場合、いくつかのCOPSオブジェクトの使用が影響を受けています。このセクションでは、これらのオブジェクトとその使用方法について説明します。"
    },
    {
      "indent": 0,
      "text": "2.1 Common Header, client-type",
      "section_title": true,
      "ja": "2.1共通ヘッダ、クライアント型"
    },
    {
      "indent": 3,
      "text": "RSVP is COPS client-type 1",
      "ja": "RSVPはCOPSクライアントタイプ1であります"
    },
    {
      "indent": 0,
      "text": "2.2 Context Object (Context)",
      "section_title": true,
      "ja": "2.2コンテキストオブジェクト（コンテキスト）"
    },
    {
      "indent": 3,
      "text": "The semantics of the Context object for RSVP is as follows:",
      "ja": "次のようにRSVPのためのContextオブジェクトの意味は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "R-Type (Request Type Flag)",
      "ja": "Rタイプ（要求タイプフラグ）"
    },
    {
      "indent": 3,
      "text": "Incoming-Message request",
      "ja": "着信メッセージ要求"
    },
    {
      "indent": 9,
      "text": "This context is used when the PEP receives an incoming RSVP\nmessage. The PDP may decide to accept or reject the incoming\nmessage and may also apply other decision objects to it. If the\nincoming message is rejected, RSVP should treat it as if it\nnever arrived.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Resource-Allocation request",
      "ja": "リソース割り当て要求"
    },
    {
      "indent": 9,
      "text": "This context is used when the PEP is about to commit local\nresources to an RSVP flow (admission control). This context\napplies to Resv messages only. The decision whether to commit\nlocal resources is made for the merge of all reservations\nassociated with an RSVP flow (which have arrived on a\nparticular interface, potentially from several RSVP Next-Hops).",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Outgoing-Message request (forwarding an outgoing RSVP message)",
      "ja": "出射メッセージ要求（発信RSVPメッセージを転送します）"
    },
    {
      "indent": 9,
      "text": "This context is used when the PEP is about to forward an\noutgoing RSVP message. The PDP may decide to allow or deny the\noutgoing message, as well as provide an outgoing policy data\nobject.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "M-Type (Message Type)",
      "ja": "M-タイプ（メッセージタイプ）"
    },
    {
      "indent": 3,
      "text": "The M-Type field in the Context Object identifies the applicable RSVP message type. M-Type values are identical to the values used in the \"msg type\" field in the RSVP header [RSVP].",
      "ja": "ContextオブジェクトのM-Typeフィールドは、該当するRSVPメッセージタイプを識別する。 M型の値は、RSVPヘッダ[RSVP]の「MSGタイプ」フィールドに使用される値と同一です。"
    },
    {
      "indent": 3,
      "text": "The following RSVP message types are supported in COPS:",
      "ja": "次のRSVPメッセージタイプがCOPSでサポートされています。"
    },
    {
      "indent": 3,
      "text": "Path Resv PathErr ResvErr",
      "ja": "パスのResvたPathErr ResvErr"
    },
    {
      "indent": 3,
      "text": "Other message types such as PathTear, ResvTear, and Resv Confirm are not supported. The list of supported message types can only be extended in later versions of RSVP and/or later version of this document.",
      "ja": "このようPathTear、たResvTear、およびのResv確認などの他のメッセージタイプがサポートされていません。サポートされているメッセージ・タイプのリストは、RSVPおよび/またはこの文書の新しいバージョンのそれ以降のバージョンに拡張することができます。"
    },
    {
      "indent": 0,
      "text": "2.3 Client Specific Information (ClientSI)",
      "section_title": true,
      "ja": "2.3クライアント固有の情報（ClientSI）"
    },
    {
      "indent": 3,
      "text": "All objects that were received in an RSVP message are encapsulated inside the Client Specific Information Object (Signaled ClientSI) sent from the PEP to the remote PDP (see Section 3.1. on multiple flows packed in a single RSVP message).",
      "ja": "RSVPメッセージで受信されたすべてのオブジェクトは、リモートPDPにPEPから送られるクライアント固有の情報オブジェクト（ClientSI合図）の内部に封入されている（セクション3.1を参照。単一のRSVPメッセージにパック複数のフローに）。"
    },
    {
      "indent": 3,
      "text": "The PEP and PDP share RSVP state, and the PDP is assumed to implement the same RSVP functional specification as the PEP. In the case where a PDP detects the absence of objects required by [RSVP] it should return an <Error> in the Decision message indicating \"Mandatory client-specific info missing\". If, on the other hand, the PDP detects the absence of optional RSVP objects that are needed to approve the Request against current policies, the PDP should return a negative <Decision>.",
      "ja": "PEPとPDP共有RSVP状態、及びPDPはPEPと同じRSVP機能仕様を実装するために想定されます。 PDPは、[RSVP]で必要なオブジェクトが存在しないことを検出した場合には、「必須クライアント固有の情報が欠落している」を示す決定メッセージに<エラー>を返さなければなりません。一方、PDPは、現在のポリシーに対する要求を承認するために必要なオプションのRSVPオブジェクトの不在を検知した場合、PDPは、負の<決定>を返す必要があります。"
    },
    {
      "indent": 3,
      "text": "Unlike the Incoming and Outgoing contexts, \"Resource Allocation\" is not always directly associated with a specific RSVP message. In a multicast session, it may represent the merging of multiple incoming reservations. Therefore, the ClientSI object should specifically contain the SESSION and STYLE objects along with the merged FLOWSPEC, FILTERSPEC list, and SCOPE object (whenever relevant).",
      "ja": "着信および発信の状況とは異なり、「リソースの割り当ては、」常に直接、特定のRSVPメッセージに関連付けられていません。マルチキャストセッションでは、複数の受信予約のマージを表すことができます。したがって、ClientSIオブジェクトは、具体的にマージFLOWSPEC、FILTERSPECリストと共にSESSIONとスタイルオブジェクトを含むべきであり、SCOPEオブジェクト（たびに関連します）。"
    },
    {
      "indent": 0,
      "text": "2.4 Decision Object (Decision)",
      "section_title": true,
      "ja": "2.4判定対象（決定）"
    },
    {
      "indent": 3,
      "text": "COPS provides the PDP with flexible controls over the PEP using RSVP's response to messages. While accepting an RSVP message, PDPs may provide preemption priority, trigger warnings, replace RSVP objects, and much more, using Decision Commands, Flags, and Objects.",
      "ja": "COPSメッセージにRSVPの応答を用いてPEPを柔軟にコントロールとPDPを提供します。 RSVPメッセージを受け入れながら、PDPは決定コマンド、フラグ、およびオブジェクトを使用して、プリエンプションの優先順位を提供し、警告をトリガし、RSVPオブジェクトを交換し、より多くのことがあります。"
    },
    {
      "indent": 3,
      "text": "DECISION COMMANDS",
      "ja": "DECISIONコマンド"
    },
    {
      "indent": 3,
      "text": "Only two commands apply to RSVP",
      "ja": "唯一の2つのコマンドはRSVPに適用されます"
    },
    {
      "indent": 3,
      "text": "Install",
      "ja": "インストール"
    },
    {
      "indent": 5,
      "text": "Positive Response: Accept/Allow/Admit an RSVP message or local resource allocation.",
      "ja": "肯定的な反応：受け入れる/許可/ RSVPメッセージまたはローカルリソース割り当てを認めます。"
    },
    {
      "indent": 3,
      "text": "Remove",
      "ja": "削除する"
    },
    {
      "indent": 5,
      "text": "Negative Response: Deny/Reject/Remove an RSVP message or local resource allocation.",
      "ja": "負の応答：/拒否/拒否RSVPメッセージまたはローカルリソースの割り当てを削除します。"
    },
    {
      "indent": 3,
      "text": "DECISION FLAGS",
      "ja": "DECISIONのFLAGS"
    },
    {
      "indent": 3,
      "text": "The only decision flag that applies to RSVP:",
      "ja": "RSVPにのみ適用され、判定フラグ："
    },
    {
      "indent": 3,
      "text": "Trigger Error",
      "ja": "トリガーエラー"
    },
    {
      "indent": 5,
      "text": "If this flag is set, RSVP should schedule a PathErr, in response to a Path message, or a ResvErr (in response of a Resv message).",
      "ja": "このフラグが設定されている場合、RSVPは、Pathメッセージ、または（Resvメッセージの応答で）ResvErrに応答して、のPathErrをスケジュールすべきです。"
    },
    {
      "indent": 3,
      "text": "STATELESS POLICY DATA",
      "ja": "STATELESSポリシーデータ"
    },
    {
      "indent": 3,
      "text": "This object may include one or more policy elements (as specified for the RSVP Policy Data object [RSVP-EXT]) which are assumed to be well understood by the client's LPDP. The PEP should consider these as an addition to the decision already received from the PDP (it can only add, but cannot override it).",
      "ja": "ウェルクライアントのLPDPによって理解されるものとする（RSVPポリシーデータオブジェクト[RSVP-EXT]に指定されるように）、このオブジェクトは、1つまたは複数のポリシー要素を含むことができます。 PEPはすでにPDPから受け取った意思決定に加え、これらを考慮する必要があります（それだけで追加することができますが、それをオーバーライドすることはできません）。"
    },
    {
      "indent": 3,
      "text": "For example, given Policy Elements that specify a flow's preemption priority, these elements may be included in an incoming Resv message or may be provided by the PDP responding to a query.",
      "ja": "例えば、フローの先取り優先順位を指定してポリシーの要素を考えると、これらの要素は、着信Resvメッセージに含まれてもよいし、クエリに応答PDPによって提供されてもよいです。"
    },
    {
      "indent": 3,
      "text": "Stateless objects must be well understood, but not necessarily supported by all PEPs. For example, assuming a standard policy element for preemption priority, it is perfectly legitimate for some PEPs not to support such preemption and to ignore it. The PDP must be careful when using such objects. In particular, it must be prepared for these objects to be ignored by PEPs.",
      "ja": "ステートレスオブジェクトはよく理解したが、必ずしも全てのPEPによってサポートされていないする必要があります。例えば、先取り優先順位のための標準的なポリシー要素を仮定し、そのようなプリエンプションをサポートするために、それを無視することなく、いくつかのPEPのために完全に正当なものです。このようなオブジェクトを使用する際にPDPは、注意しなければなりません。特に、のPEPによって無視されるように、これらのオブジェクトのために準備する必要があります。"
    },
    {
      "indent": 3,
      "text": "Stateless Policy Data may be returned in decisions and apply individually to each of the contexts flagged in REQ messages. When applied to Incoming, it is assumed to have been received as a POLICY_DATA object in the incoming message. When applied to Resource Allocation it is assumed to have been received on all merged incoming messages. Last, when applied to outgoing messages it is assumed to have been received in all messages contributing to the outgoing message.",
      "ja": "ステートレスポリシーデータは、意思決定に戻り、REQメッセージにフラグが付けられたコンテキストのそれぞれに個別に適用することができます。着信に適用されるとき、着信メッセージでPOLICY_DATAオブジェクトとして受信されたと仮定されます。アロケーションをリソースに適用する場合には、すべてのマージされた受信メッセージに受信されているものとします。送信メッセージに適用されたときに最後には、発信メッセージに貢献するすべてのメッセージで受信されているものとします。"
    },
    {
      "indent": 3,
      "text": "REPLACEMENT DATA",
      "ja": "置換データ"
    },
    {
      "indent": 3,
      "text": "The Replacement object may contain multiple RSVP objects to be replaced (from the original RSVP request). Typical replacement is performed on the \"Forward Outgoing\" request (for instance, replacing outgoing Policy Data), but is not limited, and can also be performed on other contexts (such as \"Resources-Allocation Request\"). In other cases, replacement of the RSVP FlowSpec object may be useful for controlling resources across a trusted zone (with policy ignorant nodes (PINs). Currently, RSVP clients are only required to allow replacement of three objects: POLICY_DATA, ERROR_SPEC, and FLOWSPEC, but could optionally support replacement of other objects.",
      "ja": "代替オブジェクトは、（元のRSVP要求から）交換する複数のRSVPオブジェクトを含んでいてもよいです。典型的な置換は、（発信ポリシーデータを交換する、例えば）「転送発信」の要求に対して行われるが、限定されるものではなく、（例えば、「リソース割り当て要求」など）、他のコンテキストで実行することができます。他の例では、RSVPたFlowSpecオブジェクトの交換は、政策無知ノード（ピン）と（信頼ゾーン間でリソースを制御するために有用である可能性がある現在、RSVPクライアントのみ3つのオブジェクトを交換できるようにする必要があります。、POLICY_DATA、ERROR_SPEC、およびFLOWSPECをしかし、他のオブジェクトのサポートの交換をオプションがあります。"
    },
    {
      "indent": 3,
      "text": "RSVP object replacement is performed in the following manner:",
      "ja": "RSVPオブジェクトの交換は、以下のように行われます。"
    },
    {
      "indent": 3,
      "text": "If no Replacement Data decision appears in a decision message, all signaled objects are processed as if the PDP was not there. When an object of a certain C-Num appears, it replaces ALL the instances of C-Num objects in the RSVP message. If it appears empty (with a length of 4) it simply removes all instances of C-Num objects without adding anything.",
      "ja": "無置換データの決定は、決定メッセージに表示されない場合はPDPがなかったかのように、すべての合図のオブジェクトが処理されます。特定のC-民のオブジェクトが表示されたら、それは、RSVPメッセージにC-民オブジェクトのすべてのインスタンスを置換します。それは（4の長さで）空の表示された場合には、単に何かを追加することなく、C-ヌムオブジェクトのすべてのインスタンスを削除します。"
    },
    {
      "indent": 0,
      "text": "3 Operation of COPS for RSVP PEPs",
      "ja": "RSVPののPEPのためのCOPSの3操作"
    },
    {
      "indent": 0,
      "text": "3.1 RSVP flows",
      "section_title": true,
      "ja": "3.1 RSVPフロー"
    },
    {
      "indent": 3,
      "text": "Policy Control is performed per RSVP flow, which is defined by the atomic unit of an RSVP reservation (TC reservation). Reservation styles may also impact the definition of flows; a set of senders which are considered as a single flow for WF reservation are considered as a set of individual flows when FF style is used.",
      "ja": "ポリシー制御は、RSVP予約（TC予約）の原子単位で定義されているRSVPフローごとに行われます。予約スタイルはまた、フローの定義に影響を与えてもよいです。 WFの予約のための単一の流れとして考えられている送信者の組は、FFスタイルが使用されている個々のフローの集合として考えられています。"
    },
    {
      "indent": 3,
      "text": "Multiple FF flows may be packed into a single Resv message. A packed message must be unpacked where a separate request is issued for each of the packed flows as if they were individual RSVP messages. Each COPS Request should include the associated POLICY_DATA objects, which are, by default, all POLICY_DATA objects in the packed message. Sophisticated PEPs, capable of looking inside policy objects, may examine the POLICY_DATA or SCOPE object to narrow down the list of associated flows (as an optimization).",
      "ja": "複数FFフローは、単一のResvメッセージにパックすることができます。彼らは、個々のRSVPメッセージであるかのように別々の要求が詰まっフローごとに発行された場所パックのメッセージが展開する必要があります。各COPS要求が詰まったメッセージで、デフォルトでは関連するPOLICY_DATAオブジェクト、すべてのPOLICY_DATAオブジェクトを含める必要があります。ポリシー・オブジェクト内を調べ可能な洗練のPEPは、（最適化のような）関連するフローのリストを絞り込むためPOLICY_DATAまたはSCOPEオブジェクトを調べることができます。"
    },
    {
      "indent": 3,
      "text": "Please note that the rules governing Packed RSVP message apply equally to the Incoming as well as the Outgoing REQ context.",
      "ja": "パックドRSVPメッセージを管理するルールが着信と同様に発信REQコンテキストにも同様に適用されますのでご注意ください。"
    },
    {
      "indent": 0,
      "text": "3.2 Expected Associations for RSVP Requests",
      "section_title": true,
      "ja": "RSVP要求の3.2期待協会"
    },
    {
      "indent": 3,
      "text": "When making a policy decision, the PDP may consider both Resv as well as its matching Path state (associated state). State association is straightforward in the common unicast case since the RSVP flow includes one Path state and one Resv state. In multicast cases this correspondence may be more complicated, as the match may be many-to-many. The COPS protocol assumes that the PDP is RSVP knowledgeable and capable of determining these associations based on the contents of the Client REQ message and especially the ClientSI object.",
      "ja": "ポリシー決定を行うとき、PDPはのResvならびにそのマッチングパスの状態（関連する状態）の両方を考慮することができます。 RSVPフローは一つのパス状態と一つのResv状態を含むので、状態の関連付けは、共通ユニキャストの場合に簡単です。一致が多対多であってもよいように、マルチキャストの場合において、この対応関係は、より複雑であってもよいです。 COPSプロトコルは、PDPがRSVP知識とクライアントREQメッセージ及び特にClientSIオブジェクトの内容に基づいて、これらの関連付けを決定することが可能であることを前提としています。"
    },
    {
      "indent": 3,
      "text": "For example, the PDP should be able to recognize activation and deactivation of RSVP blockade state following discrete events like the arrival of a ResvErr message (activate the blockade state) as well as the change in the outgoing Resv message.",
      "ja": "例えば、PDPは、ResvErrメッセージ（遮断状態を活性化する）、ならびに発信Resvメッセージの変化の到着など離散イベント以下RSVP遮断状態のアクティブ化および非アクティブ化を認識することができなければなりません。"
    },
    {
      "indent": 0,
      "text": "3.3 RSVP's Capacity Admission Control: Commit and Delete",
      "section_title": true,
      "ja": "3.3 RSVPの容量アドミッションコントロール：コミットおよび削除"
    },
    {
      "indent": 3,
      "text": "In RSVP, the admission of a new reservation requires both an administrative approval (policy control) and capacity admission control. After being approved by both, and after the reservation was successfully installed, the PEP notifies the remote PDP by sending a report message specifying the Commit type. The Commit type report message signals when billing should effectively begin and performing heavier delayed operations (e.g., debiting a credit card) is permissible by the PDP.",
      "ja": "RSVPでは、新しい予約の入場料は、管理者の承認（ポリシー制御）と容量アドミッション制御の両方が必要です。両方によって承認された後、予約が正常にインストールされた後、PEPは、コミットのタイプを指定してレポートメッセージを送信することにより、リモートPDPに通知します。課金が有効開始し（クレジットカードの引き落とし例えば、）より重い遅延操作を実行する必要があるときタイプレポートメッセージ信号をコミットPDPによって許容されます。"
    },
    {
      "indent": 3,
      "text": "If, instead, a PDP approved reservation fails admission due to lack of resources, the PEP must issue a no-commit report and fold back and send an updated request to its previous state (previously installed reservation). If no state was previously installed, the PEP should issue a delete (DRQ).",
      "ja": "代わりに、PDP承認予約はリソース不足のため入場を失敗した場合、PEPは無コミット報告書を発行し、フォールドバックと以前の状態（以前にインストールした予約）に更新要求を送信する必要があります。何の状態が以前にインストールされなかった場合は、PEPは、削除（DRQ）を発行する必要があります。"
    },
    {
      "indent": 0,
      "text": "3.4 Policy Control Over PathTear and ResvTear",
      "section_title": true,
      "ja": "3.4ポリシー統制PathTearとたResvTear"
    },
    {
      "indent": 3,
      "text": "PathTear and ResvTear messages are not controlled by this policy architecture. This relies on two assumptions: First, that MD-5 authentication verifies that the Tear is received from the same node that sent the initial reservation, and second, that it is functionally equivalent to that node holding off refreshes for this reservation. When a ResvTear or PathTear is received at the PEP, all affected states installed on the PDP should either be deleted or updated by the PEP.",
      "ja": "PathTearとたResvTearメッセージは、このポリシーアーキテクチャによって制御されていません。これは、2つの仮定に依存している：まず、MD-5認証が涙は、それがそのノードは、この予約のリフレッシュをオフに保持すると機能的に同等であることを、同じ初期の予約を送信したノード、及び第二から受信されたことを検証します。たResvTearかPathTearがP​​EPで受信されると、PDPにインストールされているすべての影響を受ける状態がPEPによって削除または更新されなければならないのいずれか。"
    },
    {
      "indent": 0,
      "text": "3.5 PEP Caching COPS Decisions",
      "section_title": true,
      "ja": "3.5 PEPキャッシュCOPS決定"
    },
    {
      "indent": 3,
      "text": "Because COPS is a stateful protocol, refreshes for RSVP Path and Resv messages need not be constantly sent to the remote PDP. Once a decision has been returned for a request, the PEP can cache that decision and apply it to future refreshes. When the PEP detects a change in the corresponding Resv or Path message, it should update the PDP with the new request-state. PEPs may continue to use the cached state until receiving the PDP response. This case is very different from initial admission of a flow; given that valid credentials and authentication have already been established, the relatively long RSVP refresh period, and the short PEP-PDP response time, the tradeoff between expedient updates and attack prevention leans toward expediency. However, this is really a PEP choice, and is irrelevant to PDPs.",
      "ja": "COPSは、ステートフルなプロトコルであるため、RSVPのパスのために更新され、RESVメッセージは、常にリモートPDPに送る必要はありません。決定は、要求に対して返された後、PEPは、その決定をキャッシュし、将来のリフレッシュに適用することができます。 PEPは、対応のResvまたはPathメッセージの変化を検出すると、それは新しい要求状態を有するPDPを更新しなければなりません。 PEPは、PDPの応答を受信するまで、キャッシュされた状態を継続して使用することがあります。この場合は、フローの最初の入場料とは非常に異なっています。有効な資格情報と認証は、すでに確立されていることを考えると、比較的長いRSVPリフレッシュ期間、及び短いPEP-PDPの応答時間は、都合の更新と攻撃の防止との間のトレードオフは、便宜に向かって傾いています。しかし、これは本当にPEPの選択である、とのPDPとは無関係です。"
    },
    {
      "indent": 3,
      "text": "If the connection is lost between the PEP and the PDP, the cached RSVP state may be retained for the RSVP timeout period to be used for previously admitted flows (but cannot be applied to new or updated state). If the connection can not be reestablished with the PDP or a backup PDP after the timeout period, the PEP is expected to purge all its cached decisions. Without applicable cached decision, the PEP must either reject the flow or resort to its LPDP (if available) for decisions.",
      "ja": "接続は、PEPとPDPの間に失われた場合、キャッシュされたRSVP状態が以前に許可されたフローのために使用されるRSVPタイムアウト期間のために保持することができる（ただし、新規または更新された状態に適用することはできません）。接続がタイムアウト期間の後にPDPやバックアップPDPを再確立することができない場合は、PEPは、そのすべてのキャッシュされた意思決定をパージすることが期待されます。該当するキャッシュされた意思決定がなければ、PEPは、フローを拒否しなければならないのいずれかまたは意思決定のためにそのLPDP（利用可能な場合）に頼ります。"
    },
    {
      "indent": 3,
      "text": "Once a connection is reestablished to a new (or the original) PDP the PDP may issue a SSQ request. In this case, the PEP must reissue requests that correspond to the current RSVP state (as if all the state has been updated recently). It should also include in its LPDPDecision the current (cached) decision regarding each such state.",
      "ja": "接続が新しい（または元）に再確立されると、PDP PDPはSSQ要求を発行することができます。 （すべての状態が最近更新されたかのように）この場合、PEPは、現在のRSVP状態に対応して要求を再発行する必要があります。また、そのLPDPDecisionに、このような各状態に関する現在の（キャッシュ）の決定を含むべきです。"
    },
    {
      "indent": 0,
      "text": "3.6 Using Multiple Context Flags in a single query",
      "section_title": true,
      "ja": "3.6つのクエリにマルチコンテキストフラグを使用して"
    },
    {
      "indent": 3,
      "text": "RSVP is a store-and-forward control protocol where messages are processed in three distinctive steps (input, resource allocation, and output). Each step requires a separate policy decision as indicated by context flags (see Section 2.2). In many cases, setting multiple context flags for bundling two or three operations together in one request may significantly optimize protocol operations.",
      "ja": "RSVPメッセージは、3つの特徴的な手順（入力、リソース割り当て、および出力）で処理され、ストア・アンド・フォワード制御プロトコルです。各ステップは、コンテキスト・フラグ（セクション2.2を参照）によって示されるように別個のポリシー決定を必要とします。多くの場合、大幅プロトコル動作を最適化することができる1つの要求に2つのまたは3つの操作を束ねるための複数のコンテキスト・フラグを設定します。"
    },
    {
      "indent": 3,
      "text": "The following rules apply for setting multiple Context flags:",
      "ja": "次のルールは、複数のコンテキストフラグを設定するために適用されます。"
    },
    {
      "indent": 3,
      "text": "a. Multiple context flags can be set only in two generic cases, which represent a substantial portion of expected COPS transactions, and can be guaranteed not to cause ambiguity.",
      "ja": "A。マルチコンテキストフラグが予想されるCOPS取引のかなりの部分を占めるだけに2つの一般的な例を、設定することができ、かつ曖昧さを引き起こすことがないことを保証することができます。"
    },
    {
      "indent": 6,
      "text": "Unicast FF:",
      "ja": "ユニキャストFF："
    },
    {
      "indent": 14,
      "text": "[Incoming + Allocation + Outgoing]",
      "ja": "[着信+割当+発信]"
    },
    {
      "indent": 6,
      "text": "Multicast with only one Resv message received on the interface",
      "ja": "唯一のResvメッセージでマルチキャストインターフェイスで受信しました"
    },
    {
      "indent": 14,
      "text": "[Incoming + Allocation]",
      "ja": "[着信+割当]"
    },
    {
      "indent": 3,
      "text": "b. Context events are ordered by time since every message must first be processed as Incoming, then as Resource allocation and only then as Outgoing. When multiple context flags are set, all ClientSI objects included in the request are assumed to be processed according to the latest flag. This rule applies both to the request (REQ) context as well as to the decision (DEC) context.",
      "ja": "B。コンテキストイベントは、すべてのメッセージが最初[リソース配分として、着信として処理だけにして発信などしなければならないので、時間によって順序付けされています。マルチコンテキスト・フラグが設定されている場合、リクエストに含まれる全てClientSIオブジェクトが最新フラグに従って処理されているものとします。このルールは、要求（REQ）のコンテキストにだけでなく、意思決定（DEC）コンテキストの両方に適用されます。"
    },
    {
      "indent": 6,
      "text": "For example, when combining Incoming + Allocation for an incoming Resv message, the flowspec included in the ClientSI would be the one corresponding to the Resource-Allocation context (TC).",
      "ja": "受信Resvメッセージの着信+割当てを組み合わせる場合、例えば、フロースペックはClientSIに含まれるリソース割り当てのコンテキスト（TC）に対応するものであろう。"
    },
    {
      "indent": 3,
      "text": "c. Each decision is bound to a context object, which determines which portion of the request context it applies to. When individual decisions apply to different sub-groups of the context, the PDP should send each group of decision objects encapsulated by the context flags object with the context flags applicable to these objects set (see the examples in Section 5).",
      "ja": "C。各決定は、それが適用される要求コンテキストの部分を判断するコンテキストオブジェクトにバインドされています。個々の決定は、コンテキストの異なるサブグループに適用すると、PDPは、フラグがセットこれらのオブジェクト（第5の例を参照）に適用可能なコンテキスト・フラグを持つオブジェクトコンテキストによってカプセル化された決定対象の各グループを送信しなければなりません。"
    },
    {
      "indent": 0,
      "text": "3.7 RSVP Error Reporting",
      "section_title": true,
      "ja": "3.7 RSVPエラー報告"
    },
    {
      "indent": 3,
      "text": "RSVP uses the ERROR_SPEC object in PathErr and ResvErr messages to report policy errors. While the contents of the ERROR_SPEC object are defined in [RSVP,RSVP-EXT], the PDP is in the best position to provide its contents (sub-codes). This is performed in the following manner: First, the PEP (RSVP) queries the PDP before sending a PathErr or ResvErr, and then the PDP returns the constructed ERROR_SPEC in the Replacement Data Decision Object.",
      "ja": "RSVPは、政策の誤りを報告するためのPathErrとResvErrメッセージにERROR_SPECオブジェクトを使用しています。 ERROR_SPECオブジェクトの内容は[RSVP、RSVP-EXT]で定義されているが、PDPは、その内容（サブコード）を提供するための最良の位置にあります。これは以下のように行われる：まず、PEP（RSVP）は、のPathErr又はResvErrを送信する前に、PDPを照会し、その後、PDPは、置換データ判定対象で構築ERROR_SPECを返します。"
    },
    {
      "indent": 0,
      "text": "4 Security Considerations",
      "ja": "4つのセキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document relies on COPS for its signaling and its security. Please refer to section \"Security Considerations\" in [COPS].",
      "ja": "この文書では、そのシグナルとそのセキュリティのためのCOPSに依存しています。 [COPS]セクション「セキュリティの考慮事項」を参照してください。"
    },
    {
      "indent": 3,
      "text": "Security for RSVP messages is provided by inter-router MD5 authentication [MD5], assuming a chain-of-trust model. A likely deployment scenario calls for PEPs to be deployed only at the network edge (boundary nodes) while the core of the network (backbone) consists of PIN nodes. In this scenario MD5 trust (authentication) is established between boundary (non-neighboring) PEPs. Such trust can be achieved through internal signing (integrity) of the Policy Data object itself, which is left unmodified as it passes through PIN nodes (see [RSVP-EXT]).",
      "ja": "RSVPメッセージのセキュリティは、チェーン・オブ・信頼モデルを仮定し、ルータ間のMD5認証[MD5]で提供されます。ネットワーク（バックボーン）のコアはPINノードで構成しながらのPEPにのみ、ネットワークエッジ（境界ノード）で展開するための可能性の展開シナリオは、コール。このシナリオではMD5の信頼（認証）が境界（非隣接）のPEPとの間に確立されます。そのような信頼は、それがPINノードを通過するように修飾されていないままであるポリシーデータオブジェクト自体の内部署名（整合性）を介して達成することができる（[RSVP-EXT]を参照）。"
    },
    {
      "indent": 0,
      "text": "5 Illustrative Examples, Using COPS for RSVP",
      "ja": "RSVP用COPSを用いて5の例示的な実施例、"
    },
    {
      "indent": 3,
      "text": "This section details both typical unicast and multicast scenarios.",
      "ja": "このセクションの詳細の両方典型的なユニキャストおよびマルチキャストのシナリオ。"
    },
    {
      "indent": 0,
      "text": "5.1 Unicast Flow Example",
      "section_title": true,
      "ja": "5.1ユニキャストフローの例"
    },
    {
      "indent": 3,
      "text": "This section details the steps in using COPS for controlling a Unicast RSVP flow. It details the contents of the COPS messages with respect to Figure 1.",
      "ja": "このセクションでは、ユニキャストRSVPフローを制御するためのCOPSを使用する際の手順について詳しく説明します。これは、図1に関してCOPSメッセージの内容を詳しく説明します。"
    },
    {
      "indent": 9,
      "text": "                   PEP (router)\n               +-----------------+\n               |                 |\nR1 ------------+if1           if2+------------ S1\n               |                 |\n               +-----------------+",
      "raw": true
    },
    {
      "indent": 11,
      "text": "Figure 1: Unicast Example: a single PEP view",
      "ja": "図1：ユニキャスト例：単一PEPビュー"
    },
    {
      "indent": 3,
      "text": "The PEP router has two interfaces (if1, if2). Sender S1 sends to receiver R1.",
      "ja": "PEPルータは、二つのインタフェース（IF1、IF2）を有しています。送信者S1は、受信機R1に送信します。"
    },
    {
      "indent": 3,
      "text": "A Path message arrives from S1:",
      "ja": "PathメッセージがS1から到着します："
    },
    {
      "indent": 7,
      "text": "PEP --> PDP   REQ := <Handle A> <Context: in & out, Path>\n                     <In-Interface if2> <Out-Interface if1>\n                     <ClientSI: all objects in Path message>",
      "raw": true
    },
    {
      "indent": 7,
      "text": "PDP --> PEP DEC := <Handle A> <Context: in & out, Path> <Decision: Command, Install>",
      "ja": "PDP  - > PEP 12月：>コマンド、インストールしてください：イン＆アウト、パス> <意思決定：= <> <コンテキストハンドル"
    },
    {
      "indent": 3,
      "text": "A Resv message arrives from R1:",
      "ja": "Resvメッセージは、R1から到着します："
    },
    {
      "indent": 7,
      "text": "PEP --> PDP   REQ := <Handle B>\n                     <Context: in & allocation & out, Resv>\n                     <In-Interface if1> <Out-Interface if2>\n                     <ClientSI: all objects in Resv message>",
      "raw": true
    },
    {
      "indent": 7,
      "text": "PDP --> PEP DEC := <Handle B> <Context: in, Resv> <Decision: command, Install> <Context: allocation, Resv> <Decision: command, Install> <Decision: Stateless, Priority=7> <Context: out, Resv> <Decision: command, Install> <Decision: replacement, POLICY-DATA1>",
      "ja": "PDPは、 - > PEP 12月：=は、<B> <コンテキストハンドル：、のResv> <決定において：割当て、のResv> <決定：コマンド、インストール> <決定：ステートレス、優先度= 7> <コマンド> <コンテキストをインストールコンテキスト：アウト、のResv> <意思決定：交換、POLICY-DATA1>：コマンド、> <意思決定をインストールします。"
    },
    {
      "indent": 7,
      "text": "PEP --> PDP RPT := <Handle B> <Report type: commit>",
      "ja": "PEP  - > PDP RPT：= <ハンドルB> <レポート種別：コミット>"
    },
    {
      "indent": 3,
      "text": "Notice that the Decision was split because of the need to specify different decision objects for different context flags.",
      "ja": "決定が異なるため、コンテキストフラグの異なる意思決定のオブジェクトを指定する必要の分割されたことに注意してください。"
    },
    {
      "indent": 3,
      "text": "Time Passes, the PDP changes its decision:",
      "ja": "時間が経過し、PDPは、その決定を変更します。"
    },
    {
      "indent": 7,
      "text": "PDP --> PEP   DEC := <Handle B>\n                     <Context: allocation, Resv>\n                     <Decision: command, Install>\n                     <Decision: Stateless, Priority=3>",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Because the priority is too low, the PEP preempts the flow:",
      "ja": "優先度が低すぎるので、PEPは、流れを先取り："
    },
    {
      "indent": 7,
      "text": "PEP --> PDP   DRQ := <Handle B>\n                     <Reason Code: Preempted>",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Time Passes, the sender S1 ceases to send Path messages:",
      "ja": "時間が経過し、送信者S1は、Pathメッセージを送信することなくなりました。"
    },
    {
      "indent": 7,
      "text": "PEP --> PDP   DRQ := <Handle A>\n                     <Reason: Timeout>",
      "raw": true
    },
    {
      "indent": 0,
      "text": "5.2 Shared Multicast Flows",
      "section_title": true,
      "ja": "5.2共有マルチキャストフロー"
    },
    {
      "indent": 3,
      "text": "This section details the steps in using COPS for controlling a multicast RSVP flow. It details the contents of the COPS messages with respect to Figure 2.",
      "ja": "このセクションでは、マルチキャストRSVPフローを制御するためのCOPSを使用する際の手順について詳しく説明します。これは、図2に関してCOPSメッセージの内容を詳しく説明します。"
    },
    {
      "indent": 10,
      "text": "                   PEP (router)\n               +-----------------+\n               |                 |\nR1-------------+ if1         if3 +--------- S1\n               |                 |\nR2----+        |                 |\n      |        |                 |\n      +--------+ if2         if4 +--------- S2\n      |        |                 |\nR3----+        +-----------------+",
      "raw": true
    },
    {
      "indent": 11,
      "text": "Figure 2: Multicast example: a single PEP view",
      "ja": "図2：マルチキャスト例：単一PEPビュー"
    },
    {
      "indent": 3,
      "text": "Figure 2 shows an RSVP PEP (router) which has two senders (S1, S2) and three receivers (R1, R2, R3) for the same multicast session. Interface if2 is connected to a shared media. In this example, we assume that the multicast membership is already in place. No previous RSVP messages were received, and the first to arrive is a Path message on interface if3 from sender S1:",
      "ja": "図2は、2つの送信者（S1、S2）と同じマルチキャストセッションのための3つの受信機（R1、R2、R3）を有するRSVPのPEP（ルータ）を示します。インタフェースIF2は、共有メディアに接続されています。この例では、マルチキャストメンバーシップがすでに適所にあることを前提としています。以前のRSVPメッセージが受信されなかった、そして到着する最初は、送信者S1からインターフェイスIF3にPathメッセージです。"
    },
    {
      "indent": 7,
      "text": "PEP --> PDP   REQ := <Handle A> <Context: in, Path>\n                     <In-interface if3>\n                     <ClientSI: all objects in incoming Path>",
      "raw": true
    },
    {
      "indent": 7,
      "text": "PDP --> PEP DEC := <Handle A> <Context: in, Path> <Decision: command, Install>",
      "ja": "PDP  - > PEP 12月：= <> <コンテキストハンドル：、パス> <意思決定に：コマンド、インストールしてください>"
    },
    {
      "indent": 3,
      "text": "The PEP consults its forwarding table, and finds two outgoing interface for the path (if1, if2). The exchange below is for interface if1, another exchange would likewise be completed for if2 using the new handle B2.",
      "ja": "PEPは、その転送テーブルを調べ、パス（IF1、IF2）のための2つの出力インターフェースを見出します。以下の交換は、インターフェースIF1のために、別の交換は同様に、新たなハンドルB2を使用してIF2のために完了されるだろうさ。"
    },
    {
      "indent": 7,
      "text": "PEP --> PDP   REQ := <Handle B1> <Context: out, Path>\n                     <Out-interface if1>\n                     <clientSI: all objects in outgoing Path>",
      "raw": true
    },
    {
      "indent": 7,
      "text": "PDP --> PEP DEC := <Handle B1> <Context: out, Path> <Decision: command, Install> <Decision: Replacement, POLICY-DATA1>",
      "ja": "PDP  - > PEP 12月：= <ハンドルB1> <コンテキスト：アウト、パス> <意思決定：コマンド、インストールしてください> <意思決定：交換、POLICY-DATA1>"
    },
    {
      "indent": 3,
      "text": "Here, the PDP decided to allow the forwarding of the Path message and provided the appropriate policy-data object for interface if1.",
      "ja": "ここで、PDPは、Pathメッセージの転送を可能にすることを決めたとインターフェースIF1のための適切なポリシー・データ・オブジェクトを提供しました。"
    },
    {
      "indent": 3,
      "text": "Next, a WF Resv message from receiver R2 arrives on interface if2.",
      "ja": "次に、受信機R2からWF Resvメッセージは、インタフェースIF2上に到達します。"
    },
    {
      "indent": 7,
      "text": "PEP --> PDP   REQ := <Handle C> <Context: in & allocation, Resv>\n                     <In-interface if2>\n                     <ClientSI: all objects in Resv message\n                      including RSpec1 >",
      "raw": true
    },
    {
      "indent": 7,
      "text": "PDP --> PEP DEC := <Handle C> <Context: in, Resv> <Decision: command, Install> <Context: allocation, Resv> <Decision: command, Install> <Decision: Stateless, priority=5>",
      "ja": "PDP  - > PEP 12月：= <C> <コンテキストハンドル：コマンド、インストール> <コンテキスト：割当て、のResv> <決定：、のResv> <決定にコマンド> <決定をインストール：ステートレス、優先度= 5>"
    },
    {
      "indent": 7,
      "text": "PEP --> PDP RPT := <handle C> <Commit>",
      "ja": "PEP  - > PDP RPT：= <ハンドルC> <コミット>"
    },
    {
      "indent": 3,
      "text": "Here, the PDP approves the reservation and assigned it preemption priority of 5. The PEP responded with a commit report.",
      "ja": "ここで、PDPは予約を承認し、PEPがコミットレポートで応答し、それを5の先取優先順位を割り当てます。"
    },
    {
      "indent": 3,
      "text": "The PEP needs to forward the Resv message upstream toward S1:",
      "ja": "PEPは、S1に向かって上流のResvメッセージを転送する必要があります。"
    },
    {
      "indent": 7,
      "text": "PEP --> PDP   REQ := <Handle E> <Context: out, Resv>\n                     <out-interface if3>\n                     <Client info: all objects in outgoing Resv>",
      "raw": true
    },
    {
      "indent": 7,
      "text": "PDP --> PEP DEC := <Handle E> <Context: out, Resv> <Decision: command, Install> <Decision: replacement, POLICY-DATA2>",
      "ja": "PDP  - > PEP 12月：アウト、のResv> <意思決定：：= <E> <コンテキストハンドルのコマンドを、> <意思決定をインストールします交換、POLICY-DATA2>"
    },
    {
      "indent": 3,
      "text": "Note: The Context object is part of this DEC message even though it may look redundant since the REQ specified only one context flag.",
      "ja": "注：コンテキストオブジェクトは、REQが一つだけコンテキストフラグを指定したので、冗長に見える場合であっても、このDECメッセージの一部です。"
    },
    {
      "indent": 3,
      "text": "Next, a new WF Resv message from receiver R3 arrives on interface if2 with a higher RSpec (Rspec2). Given two reservations arrived on if2, it cannot perform a request with multiple context flags, and must issue them separately.",
      "ja": "次に、受信機R3から新しいWF Resvメッセージは、より高いRSpecの（Rspec2）とのインタフェースIF2上に到達します。 2件の予約がIF2に到着考えると、それは、マルチコンテキストフラグで要求を実行することはできませんし、それらを別々に発行する必要があります。"
    },
    {
      "indent": 3,
      "text": "The PEP re-issues an updated handle C REQ with a new context object <Context: in , Resv>, and receives a DEC for handle C.",
      "ja": "PEPの再発行新しいコンテキストオブジェクトを使用して更新されたハンドルCのREQ <コンテキスト：のResv、中>、およびハンドルC.のために12月を受け取ります"
    },
    {
      "indent": 7,
      "text": "PEP --> PDP   REQ := <Handle F> <Context: in , Resv>\n                     <In-interface if2>\n                     <ClientSI: all objects in Resv message\n                      including RSpec2 >",
      "raw": true
    },
    {
      "indent": 7,
      "text": "PDP --> PEP DEC := <Handle F> <Context: in , Resv> <Decision: command, Install>",
      "ja": "PDP  - > PEP 12月：= <F> <コンテキストハンドル：、のResv> <意思決定に：コマンド、インストールしてください>"
    },
    {
      "indent": 7,
      "text": "PEP --> PDP REQ := <Handle G> <Context: allocation, Resv> <In-interface if2> <ClientSI: all objects in merged Resv including RSpec2 >",
      "ja": "PEP  - > PDP REQ：= <G> <コンテキストハンドル：割当て、のResv> <インインタフェースIF2> <ClientSI：RSpec2含むマージのResv内のすべてのオブジェクト>"
    },
    {
      "indent": 7,
      "text": "PDP --> PEP DEC := <Handle G> <Context: allocation, Resv> <Decision: command, Install> <Decision: Stateless, Priority=5>",
      "ja": "PDP  - > PEP 12月：割当て、のResv> <決定：= <G> <コンテキストハンドルコマンドを、> <決定をインストール：ステートレス、優先度= 5>"
    },
    {
      "indent": 7,
      "text": "PEP --> PDP RPT := <handle G> <Commit>",
      "ja": "PEP  - > PDP RPT：= <> <コミットG>ハンドル"
    },
    {
      "indent": 3,
      "text": "Given the change in incoming reservations, the PEP needs to forward a new outgoing Resv message upstream toward S1. This repeats exactly the previous interaction of Handle E, except that the ClientSI objects now reflect the merging of two reservations.",
      "ja": "入ってくるの予約の変化を考えると、PEPはS1に向かって上流に新しい送信Resvメッセージを転送する必要があります。これはClientSIオブジェクトは現在2つの予約のマージを反映していることを除いて、正確にハンドルEの前の相互作用を繰り返します。"
    },
    {
      "indent": 3,
      "text": "If an ResvErr arrives from S1, the PEP maps it to R3 only (because it has a higher flowspec: Rspec2) the following takes place:",
      "ja": "以下は、場所取りますResvErrはS1から到着した場合、PEPは（Rspec2それが高いフロースペックを持っているので）のみR3にマップします："
    },
    {
      "indent": 7,
      "text": "PEP --> PDP   REQ := <Handle H> <Context: in, ResvErr>\n                     <In-interface if3>\n                     <ClientSI: all objects in incoming ResvErr>",
      "raw": true
    },
    {
      "indent": 7,
      "text": "PDP --> PEP DEC := <Handle H> <Context: in, ResvErr> <Decision: command, Install>",
      "ja": "PDP  - > PEP 12月：= <H> <コンテキストハンドル：、ResvErrに> <決定：コマンド、インストール>"
    },
    {
      "indent": 7,
      "text": "PEP --> PDP REQ := <Handle I> <Context: out, ResvErr> <Out-interface if2> <ClientSI: all objects in outgoing ResvErr>",
      "ja": "PEP  - > PDP REQ：アウト、ResvErr> <アウト・インターフェースIF2> <ClientSI：：送信ResvErr内のすべてのオブジェクト> = <I> <コンテキストハンドル"
    },
    {
      "indent": 7,
      "text": "PDP --> PEP DEC := <Handle I> <Context: out, ResvErr> <Decision: command, Install> <Decision: Replacement, POLICY-DATA3>",
      "ja": "PDP  - > PEP 12月：= <ハンドルI> <コンテキスト：アウト、ResvErr> <意思決定：コマンド、インストールしてください> <意思決定：交換、POLICY-DATA3>"
    },
    {
      "indent": 3,
      "text": "When S2 joins the session by sending a Path message, incoming and outgoing Path requests are issued for the new Path. A new outgoing Resv request would be sent to S2.",
      "ja": "S2は、Pathメッセージを送信することにより、セッションに参加すると、着信および発信パスの要求は、新しいパスのために発行されています。新しい出たResv要求がS2に送信されます。"
    },
    {
      "indent": 0,
      "text": "6 References",
      "ja": "6つの参考文献"
    },
    {
      "indent": 3,
      "text": "[RSVP-EXT] Herzog, S., \"RSVP Extensions for Policy Control\", RFC 2750, January 2000.",
      "ja": "[RSVP-EXT]ヘルツォーク、S.、 \"ポリシー制御のためのRSVP拡張機能\"、RFC 2750、2000年1月。"
    },
    {
      "indent": 3,
      "text": "[RAP] Yavatkar, R., Pendarakis, D. and R. Guerin, \"A Framework for Policy Based Admission Control\", RFC 2753, January 2000.",
      "ja": "[RAP] Yavatkar、R.、Pendarakis、D.とR.ゲラン、 \"ポリシーベースのアドミッション制御のためのフレームワーク\"、RFC 2753、2000年1月。"
    },
    {
      "indent": 3,
      "text": "[COPS] Boyle, J., Cohen, R., Durham, D., Herzog, S., Raja, R. and A. Sastry, \"The COPS (Common Open Policy Service) Protocol\", RFC 2748, January 2000.",
      "ja": "[COPS]ボイル、J.、コーエン、R.、ダーラム、D.、ヘルツォーク、S.、ラジャ、R.とA. Sastry、 \"COPS（コモンオープンポリシーサービス）プロトコル\"、RFC 2748、2000年1月。"
    },
    {
      "indent": 3,
      "text": "[RSVP] Braden, R., Zhang, L., Berson, S., Herzog, S. and S. Jamin, \"Resource ReSerVation Protocol (RSVP) - Functional Specification\", RFC 2205, September 1997.",
      "ja": "[RSVP]ブレーデン、R.、チャン、L.、Berson氏、S.、ハーツォグ、S.、およびS.ヤミン、 \"リソース予約プロトコル（RSVP） - 機能的な仕様\"、RFC 2205、1997年9月。"
    },
    {
      "indent": 0,
      "text": "7 Author Information and Acknowledgments",
      "ja": "7著者の情報と謝辞"
    },
    {
      "indent": 3,
      "text": "Special thanks to Andrew Smith and Timothy O'Malley our WG Chairs, Fred Baker, Laura Cunningham, Russell Fenger, Roch Guerin, Ping Pan, and Raj Yavatkar, for their valuable contributions.",
      "ja": "彼らの貴重な貢献のためのアンドリュー・スミスとティモシーオマリー私たちのWGの議長、フレッド・ベイカー、ローラ・カニンガム、ラッセルFenger、ロッホゲラン、Pingのパン、そしてラジYavatkarに感謝、。"
    },
    {
      "indent": 3,
      "text": "Jim Boyle Level 3 Communications 1025 Eldorado Boulevard Broomfield, CO 80021",
      "ja": "ジム・ボイルレベル3コミュニケーションズ1025エルドラド大通りブルームフィールド、CO 80021"
    },
    {
      "indent": 3,
      "text": "Phone: 720.888.1192 EMail: jboyle@Level3.net",
      "ja": "電話：720.888.1192 Eメール：jboyle@Level3.net"
    },
    {
      "indent": 3,
      "text": "Ron Cohen CISCO Systems 4 Maskit St. Herzeliya Pituach 46766 Israel",
      "ja": "ロン・コーエンシスコシステムズ4 MaskitセントHerzeliya Pituach 46766イスラエル"
    },
    {
      "indent": 3,
      "text": "Phone: 972.9.9700064 EMail: ronc@cisco.com",
      "ja": "電話：972.9.9700064 Eメール：ronc@cisco.com"
    },
    {
      "indent": 3,
      "text": "David Durham Intel 2111 NE 25th Avenue Hillsboro, OR 97124",
      "ja": "デビッド・ダーラムインテル2111 NE 25日アベニューヒルズボロ、OR 97124"
    },
    {
      "indent": 3,
      "text": "Phone: 503.264.6232 EMail: David.Durham@intel.com",
      "ja": "電話：503.264.6232 Eメール：David.Durham@intel.com"
    },
    {
      "indent": 3,
      "text": "Raju Rajan AT&T Labs Research 180 Park Ave., P.O. Box 971 Florham Park, NJ 07932",
      "ja": "ラジュラジャンAT＆T Labsの研究180パークアベニュー、P。ボックス971フローラムパーク、NJ 07932"
    },
    {
      "indent": 3,
      "text": "Phone: 973.360.7229 EMail: raju@research.att.com",
      "ja": "電話：973.360.7229 Eメール：raju@research.att.com"
    },
    {
      "indent": 3,
      "text": "Shai Herzog IPHighway, Inc. 55 New York Avenue Framingham, MA 01701",
      "ja": "シャイヘルツォークIPHighway社55ニューヨーク・アベニューフラミンガム、MA 01701"
    },
    {
      "indent": 3,
      "text": "Phone: 508.620.1141 EMail: herzog@iphighway.com",
      "ja": "電話：508.620.1141 Eメール：herzog@iphighway.com"
    },
    {
      "indent": 3,
      "text": "Arun Sastry Cisco Systems 4 The Square Stockley Park Uxbridge, Middlesex UB11 1BN UK",
      "ja": "アルンSastryシスコシステムズ4スクエアストックリーパークアクスブリッジ、ミドルUB11 1BN英国"
    },
    {
      "indent": 3,
      "text": "Phone: +44-208-756-8693 EMail: asastry@cisco.com",
      "ja": "電話：+ 44-208-756-8693電子メール：asastry@cisco.com"
    },
    {
      "indent": 0,
      "text": "8 Full Copyright Statement",
      "ja": "8フル著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2000). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2000）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "了承"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}