{
  "title": {
    "text": "RFC 6813 - The Network Endpoint Assessment (NEA) Asokan Attack Analysis",
    "ja": "RFC 6813 - ネットワークエンドポイントアセスメント（NEA）Asokan攻撃解析"
  },
  "number": 6813,
  "created_at": "2019-10-31 07:00:37.881660+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                        J. Salowey\nRequest for Comments: 6813                                 Cisco Systems\nCategory: Informational                                         S. Hanna\nISSN: 2070-1721                                         Juniper Networks\n                                                           December 2012",
      "raw": true
    },
    {
      "indent": 6,
      "text": "The Network Endpoint Assessment (NEA) Asokan Attack Analysis",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "The Network Endpoint Assessment (NEA) protocols are subject to a subtle forwarding attack that has become known as the NEA Asokan Attack. This document describes the attack and countermeasures that may be mounted.",
      "ja": "ネットワークエンドポイントアセスメント（NEA）プロトコルは、NEA Asokan攻撃として知られるようになった微妙な転送攻撃の対象となっています。この文書では、装着することができる攻撃と対策について説明します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 IESGによって承認されていないすべての文書がインターネットStandardのどんなレベルの候補です。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6813.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6813で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2012 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2012 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. NEA Asokan Attack Explained .....................................2\n3. Lying Endpoints .................................................4\n4. Countermeasures against the NEA Asokan Attack ...................4\n   4.1. Identity Binding ...........................................4\n   4.2. Cryptographic Binding ......................................5\n        4.2.1. Binding Options .....................................5\n5. Conclusions .....................................................6\n6. Security Considerations .........................................6\n7. Informative References ..........................................7\n8. Acknowledgments .................................................7",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "The Network Endpoint Assessment (NEA) [2] protocols are subject to a subtle forwarding attack that has become known as the NEA Asokan Attack. This document describes the attack and countermeasures that may be mounted. The Posture Transport (PT) protocols developed by the NEA working group, PT-TLS [5] and PT-EAP [6], include mechanisms that can provide cryptographic-binding and identity-binding countermeasures.",
      "ja": "ネットワークエンドポイントの評価（NEA）は、[2]のプロトコルは、NEA Asokan攻撃として知られるようになっている微妙転送攻撃の対象となっています。この文書では、装着することができる攻撃と対策について説明します。 NEAワーキンググループによって開発された姿勢トランス（PT）プロトコルは、PT-TLS [5]及びPT-EAPは、[6]、結合暗号化およびアイデンティティ結合対策を提供することができる機構を含みます。"
    },
    {
      "indent": 0,
      "text": "2. NEA Asokan Attack Explained",
      "section_title": true,
      "ja": "2. NEWアショクAttakk Explainet"
    },
    {
      "indent": 3,
      "text": "The NEA Asokan Attack is a variation on an attack described in a 2002 paper written by Asokan, Niemi, and Nyberg [1]. Figure 1 depicts one version of the original Asokan attack. This attack involves tricking an authorized user into authenticating to a decoy Authentication, Authorization, and Accounting (AAA) server, which forwards the authentication protocol from one tunnel to another, tricking the real AAA server into believing these messages originated from the attacker-controlled machine. As a result, the real AAA server grants access to the attacker-controlled machine.",
      "ja": "NEA Asokan攻撃はAsokan、ニエミ、およびニベルグ[1]によって書かれた2002年の論文に記載攻撃のバリエーションです。図1は、元のAsokan攻撃の一の変形を示します。この攻撃は、デコイ認証、認可、および別のトンネルから認証プロトコルを転送アカウンティング（AAA）サーバへの認証に許可されたユーザをだまし含む、これらのメッセージを信じるように実際のAAAサーバをだましする攻撃者制御装置から発信さ。その結果、実際のAAAサーバの助成金は、攻撃者が制御マシンにアクセスします。"
    },
    {
      "indent": 3,
      "text": "                         +-------------+ ========== +----------+\n                         |   Attacker  |-AuthProto--|AAA Server|\n                         +-------------+ ========== +----------+\n                                |\n                            AuthProto\n                                |\n+--------------+ ========== +----------------+\n|AuthorizedUser|-AuthProto--|Decoy AAA Server|\n+--------------+ ========== +----------------+",
      "raw": true
    },
    {
      "indent": 14,
      "text": "Figure 1: One Example of Original Asokan Attack",
      "ja": "図1：オリジナルAsokan攻撃の一例"
    },
    {
      "indent": 3,
      "text": "As described in the NEA Overview [2], the NEA Reference Model is composed of several nested protocols. The Posture Attribute (PA) protocol is nested in the Posture Broker (PB) protocol, which is nested in the PT protocol. When used together successfully, these protocols allow an NEA Server to assess the security posture of an endpoint. The NEA Server may use this information to decide whether network access should be granted, or it may use this information for other purposes.",
      "ja": "NEAの概要〔2〕に記載されているように、NEA参照モデルは、いくつかのネストされたプロトコルで構成されています。姿勢属性（PA）プロトコルがPTプロトコルにネストされている姿勢ブローカー（PB）プロトコルにネストされています。首尾よく一緒に使用する場合、これらのプロトコルは、NEA Serverはエンドポイントのセキュリティ状態を評価することができます。 NEA Serverは、ネットワークアクセスが許可されるべきかどうかを決定するために、この情報を使用することができ、またはそれは他の目的のために、この情報を使用することができます。"
    },
    {
      "indent": 3,
      "text": "Figure 2 illustrates an NEA Asokan Attack. The attacker wants to trick GoodServer into believing that DirtyEndpoint has good security posture. This might allow, for example, the attacker to bring an infected machine onto a network and infect others. To accomplish this goal, the attacker forwards PA messages from CleanEndpoint through BadServer to DirtyEndpoint, which sends them on to GoodServer. GoodServer is tricked into thinking that the PA messages came from DirtyEndpoint and therefore considers DirtyEndpoint to be clean.",
      "ja": "図2は、NEA Asokan攻撃を示しています。攻撃者は、DirtyEndpointは、優れたセキュリティ姿勢を持っていることを信じるようにGoodServerをだましたいと考えています。これは、例えば、攻撃者がネットワーク上に感染したマシンを持参し、他の人に感染することができる場合があります。この目標を達成するために、攻撃者はGoodServerの上でそれらを送信しDirtyEndpointにBadServerを通じてCleanEndpointからPAメッセージを転送します。 GoodServerはPAメッセージがDirtyEndpointから来たので、DirtyEndpointがきれいであると考えていることを考えることにだまされています。"
    },
    {
      "indent": 3,
      "text": "                         +-------------+ ========== +----------+\n                         |DirtyEndpoint|-----PA-----|GoodServer|\n                         +-------------+ ========== +----------+\n                                |\n                               PA\n                                |\n+-------------+ ========== +---------+\n|CleanEndpoint|-----PA-----|BadServer|\n+-------------+ ========== +---------+",
      "raw": true
    },
    {
      "indent": 24,
      "text": "Figure 2: NEA Asokan Attack",
      "ja": "Figyre 2：NEWアショクAttakk"
    },
    {
      "indent": 3,
      "text": "Countermeasures against an NEA Asokan Attack are described in Section 4.",
      "ja": "NEA Asokan攻撃に対する対策はセクション4で説明されています。"
    },
    {
      "indent": 0,
      "text": "3. Lying Endpoints",
      "section_title": true,
      "ja": "3.横たわるエンドポイント"
    },
    {
      "indent": 3,
      "text": "Some may argue that there are other attacks against NEA systems that are simpler than the Asokan attack, such as lying endpoint attacks. That is true. It's easy for an endpoint to simply lie about its posture. But, there are defenses against lying endpoint attacks, such as using an External Measurement Agent (EMA).",
      "ja": "いくつかは、そのような嘘のエンドポイント攻撃などAsokan攻撃よりも簡単ですNEAシステムに対する他の攻撃は、あると主張していることがあります。それは本当です。エンドポイントは、単にその姿勢偽ることは簡単です。しかし、そのような外部測定エージェント（EMA）を使用したとして横たわっているエンドポイントの攻撃に対する防御があります。"
    },
    {
      "indent": 3,
      "text": "An EMA is hardware, software, or firmware that is especially secure, hard to compromise, and designed to accurately report on endpoint configuration. The EMA observes and reports on critical aspects of endpoint posture, such as which security-relevant firmware and software have been loaded.",
      "ja": "EMAは特に妥協するのは難しい、安全で、かつ正確にエンドポイントの設定に報告するように設計されたハードウェア、ソフトウェア、またはファームウェアです。 EMAは、観察し、セキュリティ関連のファームウェアおよびソフトウェアがロードされているかなど、エンドポイントの姿勢の重要な側面に関するレポート。"
    },
    {
      "indent": 3,
      "text": "When an EMA is used for NEA, the PA messages that reliably and securely establish endpoint posture are exchanged between the EMA itself and a Posture Validator on the NEA Server. The Posture Collector on the endpoint and any other intermediaries between the EMA and the Posture Validator on the NEA Server are not trusted. They just pass messages along as untrusted intermediaries.",
      "ja": "EMAは、NEAのために使用されている場合は、確実かつ安全にエンドポイントの姿勢を確立PAメッセージは、EMA自体とNEA Server上のPosture Validatorの間で交換されています。エンドポイントとEMAとNEA Server上のPosture Validatorの間に、他の仲介の姿勢コレクターは、信頼されていません。彼らは同じように、信頼できない仲介に沿ってメッセージを渡します。"
    },
    {
      "indent": 3,
      "text": "To ensure that the EMA's messages are accurately conveyed to the Posture Validator, even if the Posture Collector or other intermediaries have been compromised, these PA messages must provide integrity protection, replay protection, and source authentication between the EMA and the Posture Validator. Confidentiality protection is not needed, at least with respect to the software on the endpoint, but integrity protection should include protection against message deletion and session truncation. Organizations that have developed EMAs have typically developed remote attestation protocols that provide these properties (e.g., the Trusted Computing Group's (TCG's) Platform Trust Service (PTS) Protocol Binding to IF-M [7]). While the development of lying endpoint detection technologies is out of scope for NEA, these technologies must be supported by the NEA protocols. Therefore, the NEA protocols must support countermeasures against the NEA Asokan Attack.",
      "ja": "EMAのメッセージが正確に姿勢コレクタまたは他の仲介業者が侵害された場合でも、姿勢バリに搬送されることを保証するために、これらのPAメッセージは、EMAとのPosture Validatorの間の整合性の保護、再生保護、およびソース認証を提供する必要があります。機密性の保護は、少なくともエンドポイント上のソフトウェアに関して、必要とされていませんが、完全性保護は、メッセージの削除やセッションの切り捨てに対する保護を含める必要があります。 EMAを開発している組織は、典型的には、これらの特性を提供するリモート認証プロトコルを開発した（例えば、IF-Mへの結合トラステッドコンピューティンググループの（TCGの）プラットフォームトラスト・サービス（PTS）プロトコル[7]）。終点検出技術を嘘の開発がNEAの範囲外ですが、これらの技術は、NEAプロトコルによってサポートされなければなりません。そのため、NEAプロトコルはNEA Asokan攻撃対策をサポートしている必要があります。"
    },
    {
      "indent": 0,
      "text": "4. Countermeasures against the NEA Asokan Attack",
      "section_title": true,
      "ja": "各NEWアショクAttakkに対する4 Kountermiasyres"
    },
    {
      "indent": 0,
      "text": "4.1. Identity Binding",
      "section_title": true,
      "ja": "4.1。アイデンティティバインディング"
    },
    {
      "indent": 3,
      "text": "One way to mitigate the Asokan attack is to bind the identities used in tunnel establishment into a cryptographic exchange at the PA layer. While this can go a long way to preventing the attack, it does not bind the exchange to a specific TLS exchange, which is desirable. In addition, there is no standard way to extract an identity from a TLS session, which could make implementation difficult.",
      "ja": "Asokan攻撃を軽減するための一つの方法は、PA層で暗号為替へのトンネルの確立に使用されるアイデンティティをバインドすることです。これは、攻撃を防ぐことへの長い道を行くことができますが、それは望ましい特定のTLS交換に交換を結合しません。また、実装が困難になる可能性がある、TLSセッションからIDを抽出する標準的な方法はありません。"
    },
    {
      "indent": 0,
      "text": "4.2. Cryptographic Binding",
      "section_title": true,
      "ja": "4.2。暗号バインディング"
    },
    {
      "indent": 3,
      "text": "Another way to thwart the NEA Asokan Attack is for the PA exchange to be cryptographically bound to the PT exchange and to any keying material or privileges granted as a result of these two exchanges. This allows the NEA Server to ensure that the PA messages pertain to the same endpoint as the party terminating the PT exchange and that no other party gains any access or advantage from this exchange.",
      "ja": "NEA Asokan攻撃を阻止する別の方法は、暗号PT交換にこれら二つの交換の結果として付与された鍵素材や権限にバインドするためのPAの交換のためです。これはPAメッセージはパーティーがこの交換からのアクセスや利点をPT交換を終了していない他の党の利益と同じエンドポイントに関係することを確認するために、NEAサーバーを可能にします。"
    },
    {
      "indent": 0,
      "text": "4.2.1. Binding Options",
      "section_title": true,
      "ja": "4.2.1。バインドのオプション"
    },
    {
      "indent": 3,
      "text": "This section discusses binding protocol solution options and provides analysis. Since PT-TLS and PT-EAP involve TLS, this document focuses on TLS-based solutions that can work with either transport.",
      "ja": "このセクションでは、バインディングのプロトコル・ソリューションのオプションについて説明し、分析を提供します。 PT-TLSおよびPT-EAPはTLSを必要とするので、この文書では、トランスポートのいずれかで動作することができTLSベースのソリューションに焦点を当てています。"
    },
    {
      "indent": 0,
      "text": "4.2.1.1. Information from the TLS Tunnel",
      "section_title": true,
      "ja": "4.2.1.1。 TLSトンネルからの情報"
    },
    {
      "indent": 3,
      "text": "The TLS handshake establishes a cryptographic state between the TLS client and TLS server. There are several mechanisms that can be used to export information derived from this state. The client and server independently include this information in calculations to bind the instance of the tunnel into the PA protocol.",
      "ja": "TLSハンドシェイクは、TLSクライアントおよびTLSサーバ間の暗号化状態を確立します。この状態から得られる情報をエクスポートするために使用することができ、いくつかのメカニズムがあります。クライアントとサーバは、独立してPAプロトコルにトンネルのインスタンスを結合するために計算にこの情報を含みます。"
    },
    {
      "indent": 3,
      "text": "Keying Material Export - RFC 5705 [8] defines Keying Material Exporters for TLS that allow additional secret key material to be extracted from the TLS master secret.",
      "ja": "鍵材料輸出 -  RFC 5705 [8]追加の秘密鍵材料がTLSマスターシークレットから抽出されることを可能にするTLSの鍵材料輸出を規定します。"
    },
    {
      "indent": 3,
      "text": "tls-unique Channel Binding Data - RFC 5929 [9] defines several quantities that can be extracted from the TLS session to bind the TLS session to other protocols. The tls-unique binding consists of data extracted from the TLS handshake finished message.",
      "ja": "TLS固有のデータのバインド・チャネル -  RFC 5929 [9]他のプロトコルにTLSセッションを結合するためにTLSセッションから抽出することができるいくつかの量を規定します。 TLS固有の結合は、TLSハンドシェイク終了メッセージから抽出されたデータから構成されています。"
    },
    {
      "indent": 0,
      "text": "4.2.1.2. TLS Cipher Suites",
      "section_title": true,
      "ja": "4.2.1.2。 TLS暗号スイート"
    },
    {
      "indent": 3,
      "text": "In order to eliminate the possibility of a man-in-the-middle attack and thwart the Asokan attack when using the keying material export binding export mechanism, it is important that neither TLS endpoint be in sole control of the TLS pre-master secret. Cipher suites based on key transport, such as RSA cipher suites, do not meet this requirement; instead, Diffie-Hellman Cipher Suites, such as RSA-DHE, are required when this mechanism is employed.",
      "ja": "輸出メカニズムを結合鍵材料の輸出を使用した場合man-in-the-middle攻撃の可能性を排除し、Asokan攻撃を阻止するためには、TLSエンドポイントでもないが、TLSプレマスターの秘密の唯一のコントロールであることが重要です。こうしたRSA暗号スイートなどの主要交通機関に基づく暗号スイートは、この要件を満たしていません。この機構を用いる場合に代えて、そのようなRSA-DHEとしてディフィー・ヘルマン暗号スイートは、必要とされます。"
    },
    {
      "indent": 0,
      "text": "4.2.1.3. Using Additional Key Material from TLS",
      "section_title": true,
      "ja": "4.2.1.3。 TLSから追加のキーマテリアルを使用"
    },
    {
      "indent": 3,
      "text": "In some cases, key material is extracted from the TLS tunnel and used to derive ciphering keys used in another protocol. For example, EAP-TLS [10] uses key material extracted from TLS in lower-layer ciphering. In this case, the extracted keys must not be under the control of a single party, so the considerations in the previous section are important.",
      "ja": "いくつかのケースでは、鍵材料は、TLSトンネルから抽出し、別のプロトコルで使用される暗号化鍵を導出するために使用されます。例えば、EAP-TLS [10]下層の暗号化にTLSから抽出された鍵材料を使用します。前節の配慮が重要であるので、この場合には、抽出されたキーは、単一の当事者の管理下にあってはなりません。"
    },
    {
      "indent": 0,
      "text": "4.2.1.4. EMA Assumptions",
      "section_title": true,
      "ja": "4.2.1.4。 EMAの仮定"
    },
    {
      "indent": 3,
      "text": "The EMA needs to obtain the binding data from the TLS exchange and prove knowledge of the binding data in an exchange that has integrity protection, source authentication, and replay protection.",
      "ja": "EMAは、TLS交換からデータバインディングを取得し、完全性保護、ソース認証、および再生保護を持っていると引き換えに、結合データの知識を証明する必要があります。"
    },
    {
      "indent": 0,
      "text": "5. Conclusions",
      "section_title": true,
      "ja": "5。結論"
    },
    {
      "indent": 3,
      "text": "The recommendations for addressing the NEA Asokan Attack are as follows:",
      "ja": "次のようにNEA Asokan攻撃に対処するための推奨事項は、次のとおりです。"
    },
    {
      "indent": 3,
      "text": "1. Protocols should make use of cryptographic binding; in addition, binding identities of the tunnel endpoints in the EMA may be useful.",
      "ja": "1.プロトコルは、暗号バインディングを利用する必要があります。加えて、EMAにトンネルエンドポイントのIDを結合することに有用であり得ます。"
    },
    {
      "indent": 3,
      "text": "2. In particular, L2 and L3 TLS-based PT transports (e.g., PT-TLS and PT-EAP) should use the same cryptographic binding mechanism.",
      "ja": "特に、L2及びL3 TLSベースPTトランスポート（例えば、PT-TLSおよびPT-EAP）2.同一の暗号化バインド機構を使用する必要があります。"
    },
    {
      "indent": 3,
      "text": "3. The preferred approach is to use the tls-unique channel binding data from [9]. The tls-unique value will be made available to the EMA that will use it. This approach can utilize any TLS cipher suite based on a strong cipher algorithm.",
      "ja": "3.好ましい手法[9]からTLS固有チャネル結合データを使用することです。 TLS-ユニークな値は、それを使用しますEMAに利用できるようになります。このアプローチは、強力な暗号化アルゴリズムに基づいて、任意のTLS暗号スイートを利用することができます。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document is primarily concerned with analyzing and proposing countermeasures for the NEA Asokan Attack. That does not mean that it covers all the possible attacks against the NEA protocols or against the NEA Reference Model. For a broader security analysis, see the Security Considerations section of the NEA Overview [2], PA-TNC [3], PB-TNC [4], PT-TLS [5], and PT-EAP [6].",
      "ja": "この文書では、分析し、NEA Asokan攻撃のための対策を提案して、主に懸念しています。つまり、NEAプロトコルに対するまたはNEA参照モデルに対するすべての攻撃の可能性をカバーすることを意味するものではありません。より広範なセキュリティ分析のために、NEA概要のセキュリティ考慮事項を参照してください[2]、PA-TNC [3]、PB-TNC [4]、PT-TLS [5]、およびPT-EAP [6]。"
    },
    {
      "indent": 0,
      "text": "7. Informative References",
      "section_title": true,
      "ja": "7.参考文献"
    },
    {
      "indent": 3,
      "text": "[1] Asokan, N., Niemi, V., and K. Nyberg, \"Man-in-the-Middle Attacks in Tunneled Authentication Protocols\", Nokia Research Center, Finland, Nov. 11, 2002, http://eprint.iacr.org/2002/163.pdf.",
      "ja": "[1] Asokan、N.、ニエミ、V.、およびK.ニベルグ、 \"トンネルされた認証プロトコルでman-in-the-middle攻撃\"、ノキア・リサーチ・センター、フィンランド、2002年11月11日は、http：//イープリント.iacr.org / 2002 / 163.pdf。"
    },
    {
      "indent": 3,
      "text": "[2] Sangster, P., Khosravi, H., Mani, M., Narayan, K., and J. Tardo, \"Network Endpoint Assessment (NEA): Overview and Requirements\", RFC 5209, June 2008.",
      "ja": "[2]サングスター、P.、Khosravi、H.、マニ、M.、ナラヤン、K.、およびJ. Tardo、 \"ネットワークエンドポイントの評価（NEA）：概要および要件\"、RFC 5209、2008年6月。"
    },
    {
      "indent": 3,
      "text": "[3] Sangster, P. and K. Narayan, \"PA-TNC: A Posture Attribute (PA) Protocol Compatible with Trusted Network Connect (TNC)\", RFC 5792, March 2010.",
      "ja": "[3]サングスター、P.とK.ナラヤンを、 \"PA-TNC：トラステッドネットワーク接続（TNC）に対応姿勢属性（PA）プロトコル\"、RFC 5792、2010年3月。"
    },
    {
      "indent": 3,
      "text": "[4] Sahita, R., Hanna, S., Hurst, R., and K. Narayan, \"PB-TNC: A Posture Broker (PB) Protocol Compatible with Trusted Network Connect (TNC)\", RFC 5793, March 2010.",
      "ja": "[4] Sahita、R.、ハンナ、S.、ハースト、R.、およびK.ナラヤン、 \"PB-TNC：トラステッドネットワークコネクト（TNC）に対応姿勢ブローカー（PB）プロトコル\"、RFC 5793、2010年3月。"
    },
    {
      "indent": 3,
      "text": "[5] Sangster, P., N. Cam-Winget, and J. Salowey, \"PT-TLS: A TCP-based Posture Transport (PT) Protocol\", Work in Progress, October 2012.",
      "ja": "[5]サングスター、P.、N.カムウィンゲット、およびJ. Salowey、 \"PT-TLS：TCPベースの姿勢トランス（PT）プロトコル\"、進歩、2012年10月に働いています。"
    },
    {
      "indent": 3,
      "text": "[6] Cam-Winget, N. and P. Sangster, \"PT-EAP: Posture Transport (PT) Protocol For EAP Tunnel Methods\", Work in Progress, July 2012.",
      "ja": "[6]カム・ウィンゲット、N.およびP.サングスター、 \"PT-EAP：EAPトンネルのメソッドの姿勢トランスポート（PT）議定書\"、進歩、2012年7月での作業。"
    },
    {
      "indent": 3,
      "text": "[7] Trusted Computing Group, \"TCG Attestation PTS Protocol: Binding to TNC IF-M\", Version 1.0, Revision 27, August 2011.",
      "ja": "[7]コンピューティング・グループ、信頼された \"TCG証明PTSプロトコル：TNC IF-Mへの結合\"、バージョン1.0、改訂27、2011年8月。"
    },
    {
      "indent": 3,
      "text": "[8] Rescorla, E., \"Keying Material Exporters for Transport Layer Security (TLS)\", RFC 5705, March 2010.",
      "ja": "[8]レスコラ、E.、RFC 5705 \"トランスポート層セキュリティ（TLS）のための鍵材料輸出\"、2010年3月。"
    },
    {
      "indent": 3,
      "text": "[9] Altman, J., Williams, N., and L. Zhu, \"Channel Bindings for TLS\", RFC 5929, July 2010.",
      "ja": "[9]アルトマン、J.、ウィリアムズ、N.、およびL.朱、 \"TLSのチャネルバインディング\"、RFC 5929、2010年7月。"
    },
    {
      "indent": 3,
      "text": "[10] Simon, D., Aboba, B., and R. Hurst, \"The EAP-TLS Authentication Protocol\", RFC 5216, March 2008.",
      "ja": "[10]サイモン、D.、Aboba、B.、およびR.ハースト、 \"EAP-TLS認証プロトコル\"、RFC 5216、2008年3月。"
    },
    {
      "indent": 0,
      "text": "8. Acknowledgments",
      "section_title": true,
      "ja": "8.謝辞"
    },
    {
      "indent": 3,
      "text": "The members of the NEA Asokan Design Team were critical to the development of this document: Nancy Cam-Winget, Steve Hanna, Joe Salowey, and Paul Sangster.",
      "ja": "ナンシーカム・ウィンゲット、スティーブ・ハンナ、ジョーSalowey、そしてポール・サングスター：NEA Asokan設計チームのメンバーは、この文書の発展にとって非常に重要でした。"
    },
    {
      "indent": 3,
      "text": "The authors would also like to recognize N. Asokan, Valtteri Niemi, and Kaisa Nyberg who published the original paper on this type of attack and Pasi Eronen who extended this attack to NEA protocols.",
      "ja": "著者らはまた、NEAプロトコルにこの攻撃を延長攻撃とパシEronenのこのタイプにオリジナルの論文を発表しN. Asokan、Valtteriニエミ、およびカイサ・ニーバーグを認識したいと思います。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Joseph Salowey Cisco Systems, Inc. 2901 3rd. Ave Seattle, WA 98121 USA EMail: jsalowey@cisco.com",
      "ja": "ジョセフSaloweyシスコ・システムズ・インク2901年第3回。アベニューシアトル、WA 98121 USA電子メール：jsalowey@cisco.com"
    },
    {
      "indent": 3,
      "text": "Steve Hanna Juniper Networks, Inc. 79 Parsons Street Brighton, MA 02135 USA EMail: shanna@juniper.net",
      "ja": "スティーブ・ハンナジュニパーネットワークス社79パーソンズ・ストリートブライトン、MA 02135 USA Eメール：shanna@juniper.net"
    }
  ]
}