{
  "title": {
    "text": "RFC 5918 - Label Distribution Protocol (LDP) 'Typed Wildcard' Forward Equivalence Class (FEC)",
    "ja": "RFC 5918 - ラベル配布プロトコル（LDP）「型付きワイルドカード」フォワード等価クラス（FEC）"
  },
  "number": 5918,
  "created_at": "2019-10-30 16:36:07.041571+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                          R. Asati\nRequest for Comments: 5918                                 Cisco Systems\nCategory: Standards Track                                       I. Minei\nISSN: 2070-1721                                         Juniper Networks\n                                                               B. Thomas\n                                                             August 2010",
      "raw": true
    },
    {
      "indent": 11,
      "text": "Label Distribution Protocol (LDP) 'Typed Wildcard'\n         Forward Equivalence Class (FEC)",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "The Label Distribution Protocol (LDP) specification for the Wildcard Forward Equivalence Class (FEC) element has several limitations. This document addresses those limitations by defining a Typed Wildcard FEC Element and associated procedures. In addition, it defines a new LDP capability to address backward compatibility.",
      "ja": "ワイルドカードフォワード等価クラス（FEC）要素のラベル配布プロトコル（LDP）仕様は、いくつかの制限があります。この文書では、型指定されたワイルドカードFEC要素とそれに関連する手順を定義することによって、これらの制限に対処しています。また、それは、下位互換性に対処するための新たな自民党の機能を定義します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc5918.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc5918で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2010 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2010 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 3,
      "text": "This document may contain material from IETF Documents or IETF Contributions published or made publicly available before November 10, 2008. The person(s) controlling the copyright in some of this material may not have granted the IETF Trust the right to allow modifications of such material outside the IETF Standards Process. Without obtaining an adequate license from the person(s) controlling the copyright in such materials, this document may not be modified outside the IETF Standards Process, and derivative works of it may not be created outside the IETF Standards Process, except to format it for publication as an RFC or to translate it into languages other than English.",
      "ja": "この材料の一部がIETFトラストにこのような材料の変更を許可する権利を与えられていない可能性がありますにこの文書は、2008年、IETFドキュメントまたは11月10日以前に発行または公開さIETF貢献から著作権を支配する者（複数可）材料を含んでいてもよいですIETF標準化プロセスの外。そのような材料の著作権を管理者（単数または複数）から適切なライセンスを取得することなく、この文書は、IETF標準化過程の外側修正されないかもしれません、そして、それの派生物は、IETF標準化過程の外側に作成されない場合があり、それをフォーマットする以外出版RFCとして、英語以外の言語に翻訳します。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n2. Specification Language ..........................................4\n3. The Typed Wildcard FEC Element ..................................4\n4. Procedures for the Typed Wildcard FEC Element ...................5\n5. Typed Wildcard FEC Capability ...................................6\n6. Typed Wildcard FEC Element for Prefix FEC Element ...............7\n7. Typed Wildcard FEC Element for Host and Wildcard FEC Elements ...8\n8. IANA Considerations .............................................8\n9. Security Considerations .........................................8\n10. Acknowledgments ................................................9\n11. References .....................................................9\n   11.1. Normative References ......................................9\n   11.2. Informative References ....................................9",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "LDP [RFC5036] distributes labels for Forwarding Equivalence Classes (FECs). LDP uses FEC TLVs in LDP messages to specify FECs. An LDP FEC TLV includes one or more FEC elements. A FEC element includes a FEC type and an optional type-dependent value.",
      "ja": "LDP [RFC5036]は転送等価クラス（のFEC）のラベルを配布します。自民党はのFECを指定するには、LDPメッセージにFEC TLVを使用しています。 LDP FEC TLVは、一つ以上のFEC要素を含んでいます。 FEC要素は、FECタイプおよびオプションのタイプに依存する値を含みます。"
    },
    {
      "indent": 3,
      "text": "RFC 5036 specifies two FEC types (Prefix and Wildcard), and other documents specify additional FEC types; e.g., see [RFC4447] and [MLDP].",
      "ja": "RFC 5036には、2種類のFEC（プレフィックスとワイルドカード）を指定し、他の文書には、追加のFECのタイプを指定します。例えば、[RFC4447]を参照し、[MLDP]。"
    },
    {
      "indent": 3,
      "text": "As specified by RFC 5036, the Wildcard FEC Element refers to all FECs relative to an optional constraint. The only constraint RFC 5036 specifies is one that limits the scope of the Wildcard FEC Element to \"all FECs bound to a given label\".",
      "ja": "RFC 5036で指定されるように、ワイルドカードFEC要素は、オプションの制約のすべてのFEC相対指します。 RFC 5036が指定する唯一の制約は、ワイルドカードFEC要素の範囲を「与えられたラベルにバインドされたすべてのFECを」制限です。"
    },
    {
      "indent": 3,
      "text": "The RFC 5036 specification of the Wildcard FEC Element has the following deficiencies that limit its utility:",
      "ja": "ワイルドカードFEC要素のRFC 5036仕様は、その有用性を制限し、次の欠点があります。"
    },
    {
      "indent": 3,
      "text": "1) The Wildcard FEC Element is untyped. There are situations where it would be useful to be able to refer to all FECs of a given type (as another constraint).",
      "ja": "1）ワイルドカードFEC要素が型なしです。 （別の制約として）指定されたタイプのすべてのFECを参照することができることは有用であろう状況があります。"
    },
    {
      "indent": 3,
      "text": "2) Use of the Wildcard FEC Element is limited to Label Withdraw and Label Release messages only. There are situations where it would be useful to have a Wildcard FEC Element, with type constraint, in Label Request messages.",
      "ja": "2）ワイルドカードFEC要素の使用は撤回とだけラベル解放メッセージ標識に限定されます。ラベル要求メッセージに、型制約で、ワイルドカードFEC要素を持つことが有用であろう状況があります。"
    },
    {
      "indent": 3,
      "text": "This document:",
      "ja": "このドキュメント："
    },
    {
      "indent": 6,
      "text": "- addresses the above limitations by defining a Typed Wildcard FEC Element and procedures for its use.",
      "ja": " - その使用のために型指定されたワイルドカードFEC要素および手順を定義することによって、上記の制限に対処します。"
    },
    {
      "indent": 6,
      "text": "- specifies use of the LDP capability mechanism [RFC5561] at session establishment time for informing a peer that an LDP speaker is capable of handling the Typed Wildcard FEC.",
      "ja": " -  LDPスピーカ入力したワイルドカードFECを処理することができるピアに通知するためのセッション確立時にLDP能力メカニズム[RFC5561]を使用することを指定します。"
    },
    {
      "indent": 6,
      "text": "- specifies use of the Typed Wildcard FEC Element in a Label Request message.",
      "ja": " - ラベル要求メッセージに入力されたワイルドカードFEC要素の使用を指定します。"
    },
    {
      "indent": 6,
      "text": "- specifies the Typed Wildcard FEC Element for the Prefix FEC Element specified by RFC 5036.",
      "ja": " -  RFC 5036で指定されたプレフィックスFEC要素のために型指定されたワイルドカードFEC要素を指定します。"
    },
    {
      "indent": 3,
      "text": "Note that this document does not change procedures specified for the LDP Wildcard FEC Element by RFC 5036.",
      "ja": "この文書はRFC 5036でLDPワイルドカードFEC要素に対して指定された手順を変更しないことに注意してください。"
    },
    {
      "indent": 0,
      "text": "2. Specification Language",
      "section_title": true,
      "ja": "2.仕様言語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 3,
      "text": "LDP - Label Distribution Protocol",
      "ja": "LDP  - ラベル配布プロトコル"
    },
    {
      "indent": 3,
      "text": "FEC - Forwarding Equivalence Class",
      "ja": "FEC  - 転送等価クラス"
    },
    {
      "indent": 3,
      "text": "TLV - Type Length Value",
      "ja": "TLV  - タイプ長さ値"
    },
    {
      "indent": 3,
      "text": "LSR - Label Switching Router",
      "ja": "LSR  - ラベルスイッチングルータ"
    },
    {
      "indent": 0,
      "text": "3. The Typed Wildcard FEC Element",
      "section_title": true,
      "ja": "3.型付きワイルドカードFEC要素"
    },
    {
      "indent": 3,
      "text": "The Typed Wildcard FEC Element refers to all FECs of the specified type that meet the constraint. It specifies a 'FEC Element Type' and an optional constraint, which is intended to provide additional information.",
      "ja": "型指定されたワイルドカードFEC要素は、制約を満たす指定されたタイプのすべてのFECを指します。それはFEC要素型 'と追加情報を提供することを目的とオプションの制約を指定します。"
    },
    {
      "indent": 3,
      "text": "The format of the Typed Wildcard FEC Element is:",
      "ja": "型指定されたワイルドカードFEC要素の形式は次のとおりです。"
    },
    {
      "indent": 6,
      "text": "0                   1                   2                   3\n0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n| Typed (0x05)  | FEC Element   | Len FEC Type  |               |\n| Wildcard      | Type          | Info          |               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+               |\n|                                                               |\n~          Additional FEC Type-specific Information             ~\n|                  (Optional)                                   |\n|                                               +-+-+-+-+-+-+-+-+\n|                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 23,
      "text": "Figure 1: Typed Wildcard FEC Element",
      "ja": "図1：型指定されたワイルドカードFEC要素"
    },
    {
      "indent": 3,
      "text": "Where:",
      "ja": "どこ："
    },
    {
      "indent": 6,
      "text": "Typed Wildcard: One-octet FEC Element Type (0x05).",
      "ja": "型指定されたワイルドカード：1オクテットFEC要素タイプ（0×05）。"
    },
    {
      "indent": 6,
      "text": "FEC Element Type: One-octet FEC Element Type that specifies the FEC Element Type to be wildcarded. Please see Section 3.4.1 of RFC 5036.",
      "ja": "FEC要素タイプ：ワイルドカードされるFEC要素の型を指定する1オクテットFEC要素タイプ。 RFC 5036のセクション3.4.1を参照してください。"
    },
    {
      "indent": 12,
      "text": "Any (future) document specifying a new FEC Element Type (not\ndefined in RFC 5036) should prescribe whether typed\nwildcarding is needed for that FEC Element Type.",
      "raw": true
    },
    {
      "indent": 6,
      "text": "Len FEC Type Info: One octet that specifies the length in octets of the FEC Type Specific information field. It MUST be set to 0 if there is no Additional FEC Type-specific Information.",
      "ja": "レンFECタイプ情報：FECタイプ固有の情報フィールドのオクテットの長さを指定する1つのオクテット。追加のFECタイプ固有の情報が存在しない場合は0に設定しなければなりません。"
    },
    {
      "indent": 6,
      "text": "Additional FEC Type-specific Information (Optional): Additional information that is specific to the FEC Element Type and that is required to fully specify the Typed Wildcard. If this field is absent, then all FECs of the specified FEC Type would be matched.",
      "ja": "追加のFECタイプ固有の情報（オプション）：追加情報FEC要素タイプに特有のものであり、それは完全に型指定されたワイルドカードを指定する必要があります。このフィールドが存在しない場合は、指定されたFECタイプのすべてのFECを一致させるでしょう。"
    },
    {
      "indent": 12,
      "text": "Any (future) document specifying Typed wildcarding for any\nFEC Element Type should also specify the length and format\nof Additional FEC Type Specific Information, if included.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "This document specifies one FEC Element Type instance (e.g., Prefix FEC) for the 'Typed Wildcard FEC Element' in Section 6.",
      "ja": "この文書では、第6章の「型付きワイルドカードFEC要素」のために（例えば、プレフィックスFEC）1つのFEC要素タイプのインスタンスを指定します。"
    },
    {
      "indent": 0,
      "text": "4. Procedures for the Typed Wildcard FEC Element",
      "section_title": true,
      "ja": "型指定されたワイルドカードFEC要素4.手順"
    },
    {
      "indent": 3,
      "text": "When a FEC TLV contains a Typed Wildcard FEC Element, the Typed Wildcard FEC Element MUST be the only FEC Element in the TLV. If an LDP speaker receives a FEC TLV containing a Typed Wildcard FEC Element and any other FEC elements, then the LDP speaker should ignore the other FEC elements and continue processing as if the message only contains the Typed Wildcard FEC Element.",
      "ja": "FEC TLVは、型指定されたワイルドカードFEC要素が含まれている場合は、型指定されたワイルドカードFEC要素は、TLVで唯一のFEC要素でなければなりません。 LDPスピーカ入力したワイルドカードFEC要素と他のFEC要素を含むFEC TLVを受信した場合、LDPスピーカーは他のFEC要素を無視し、メッセージのみ型付きワイルドカードFEC要素が含まれているかのように処理を継続すべきです。"
    },
    {
      "indent": 3,
      "text": "An LDP implementation that supports the Typed Wildcard FEC Element MUST support its use in Label Request, Label Withdraw, and Label Release messages.",
      "ja": "型指定されたワイルドカードFEC要素をサポートしている自民党の実装では、ラベル要求での使用をサポートしてラベル撤回、およびリリースメッセージにラベルを付ける必要があります。"
    },
    {
      "indent": 3,
      "text": "An LDP implementation that supports the Typed Wildcard FEC Element MUST support it for every FEC Element Type defined in [RFC5036].",
      "ja": "型指定されたワイルドカードFEC要素をサポートしている自民党の実装は、[RFC5036]で定義されたすべてのFEC要素タイプのためにそれをサポートしなければなりません。"
    },
    {
      "indent": 3,
      "text": "Receipt of a Label Request message with a FEC TLV containing a Typed Wildcard FEC Element is interpreted as a request to send one or more Label Mappings for all FECs of the type specified by the FEC Element Type field in the Typed Wildcard FEC Element encoding.",
      "ja": "型付きワイルドカードFEC元素を含むFEC TLVとラベル要求メッセージの受信は、型付きワイルドカードFEC要素符号化にFEC要素タイプフィールドによって指定されたタイプのすべてのFECための1つ以上のラベルマッピングを送信するための要求として解釈されます。"
    },
    {
      "indent": 3,
      "text": "An LDP implementation that supports the Typed Wildcard FEC Element MUST support the following constraints whenever a Typed Wildcard FEC appears in a Label Withdraw or Label Release message:",
      "ja": "型付きワイルドカードFECが撤回またはラベル解放メッセージラベルに表示されたときに型指定されたワイルドカードFEC要素をサポートしている自民党の実装では、次の制約をサポートする必要があります。"
    },
    {
      "indent": 3,
      "text": "1) If the message carries an optional Label TLV, the Typed Wildcard FEC Element refers to all FECs of the specified FEC type bound to the specified label.",
      "ja": "メッセージは、オプションのラベルTLVを運ぶ場合は1）、型付きワイルドカードFEC要素は、指定されたラベルに結合した指定されたFECタイプの全てのFECを指します。"
    },
    {
      "indent": 3,
      "text": "2) If the message has no Label TLV, the Typed Wildcard FEC Element refers to all FECs of the specified FEC type.",
      "ja": "メッセージはラベルなしTLVを持たない場合は2）、型付きワイルドカードFEC要素は、指定されたFECタイプの全てのFECを指します。"
    },
    {
      "indent": 3,
      "text": "Backwards compatibility with a router not supporting the Typed Wildcard FEC element is ensured by the FEC procedures defined in RFC 5036. Quoting from RFC 5036:",
      "ja": "下位ルータは型付きワイルドカードFEC要素をサポートしていないとの互換性は、RFC 5036から引用RFC 5036で定義されたFEC手順によって保証されます。"
    },
    {
      "indent": 6,
      "text": "If it [an LSR] encounters a FEC Element type it cannot decode, it SHOULD stop decoding the FEC TLV, abort processing the message containing the TLV, and send an \"Unknown FEC\" Notification message to its LDP peer signaling an error.",
      "ja": "それは[LSR]は、それがデコードできないFEC要素タイプに遭遇した場合、それは、FEC TLVを復号停止TLVを含むメッセージを処理中止し、エラーをシグナリングそのLDPピアに「不明FEC」通知メッセージを送信するべきです。"
    },
    {
      "indent": 3,
      "text": "A router receiving a FEC TLV containing a Typed Wildcard FEC element for either a FEC Element Type that it doesn't support or for a FEC Element Type that doesn't support the use of wildcarding, MUST stop decoding the FEC TLV, abort processing the message containing the TLV, and send an \"Unknown FEC\" Notification message to its LDP peer to signal an error.",
      "ja": "それはサポートしていないか、またはワイルドカードの使用をサポートしていないFEC要素タイプの、FEC TLVをデコード停止しなければならないのいずれかFEC要素タイプをそのための型付きワイルドカードFEC元素を含むFEC TLVを受信したルータは、処理をアボートTLVを含むメッセージ、およびエラーを通知するために、そのLDPピアに「不明FEC」通知メッセージを送信します。"
    },
    {
      "indent": 3,
      "text": "A router receiving a FEC TLV containing a Typed Wildcard FEC element MAY also leverage mechanisms defined in [RFC5919] (say, if it had zero label binding for the requested FEC type, etc.).",
      "ja": "型付きワイルドカードFEC元素を含むFEC TLVを受信したルータは、（それが要求されたFECタイプ、等に結合ゼロラベルを有する場合、例えば）[RFC5919]で定義され、またレバレッジ機構。"
    },
    {
      "indent": 0,
      "text": "5. Typed Wildcard FEC Capability",
      "section_title": true,
      "ja": "5.型付きワイルドカードFEC能力"
    },
    {
      "indent": 3,
      "text": "As noted above, RFC 5036 FEC procedures provide for backward compatibility with an LSR not supporting the Typed Wildcard FEC Element. However, they don't provide means for an LSR that wishes to use the Typed Wildcard FEC Element to determine whether a peer supports it other than to send a message that uses the FEC Element and to wait and see how the peer responds.",
      "ja": "上述したように、RFC 5036 FEC手順は、LSRが入力ワイルドカードFEC素子を支持しないとの下位互換性を提供します。しかし、彼らはピアが、それは他のFEC要素を使用してメッセージを送信すると、待って、ピアがどのように応答するかを見るためよりも、サポートしているかどうかを判断するために型指定されたワイルドカードFEC要素を使用することを希望するLSRのための手段を提供していません。"
    },
    {
      "indent": 3,
      "text": "An LDP speaker that supports the Typed Wildcard FEC Element MUST inform its peers of the support by including a Typed Wildcard FEC Element Capability Parameter [RFC5561] in its Initialization messages only.",
      "ja": "型指定されたワイルドカードFEC要素をサポートしている自民党のスピーカーはその初期化メッセージに入力されたワイルドカードFEC要素の能力パラメータ[RFC5561]を含むことにより、支援のピアに通知しなければなりません。"
    },
    {
      "indent": 3,
      "text": "The Capability Parameter for the Typed Wildcard FEC capability is a TLV with the following format:",
      "ja": "型付きワイルドカードFEC機能のための能力パラメータは、次の形式のTLVです。"
    },
    {
      "indent": 6,
      "text": "0                   1                   2                   3\n0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|U|F|Typed WCard FEC Cap(0x050B)|            Length             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|S| Reserved    |\n+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 18,
      "text": "Figure 2: Typed Wildcard FEC Capability Format",
      "ja": "図2：型指定されたワイルドカードFEC能力のフォーマット"
    },
    {
      "indent": 3,
      "text": "Where:",
      "ja": "どこ："
    },
    {
      "indent": 6,
      "text": "U and F bits: MUST be 1 and 0, respectively, as per Section 3 of LDP Capabilities [RFC5561].",
      "ja": "U及びFビット：LDP機能[RFC5561]のセクション3に従って、それぞれ1と0でなければなりません。"
    },
    {
      "indent": 6,
      "text": "Typed WCard FEC Cap: 0x050B",
      "ja": "型付きWCard FECキャップ：0x050B"
    },
    {
      "indent": 6,
      "text": "Length: Two octets. It MUST be set to 0x0001.",
      "ja": "長さ：2つのオクテット。これは、0x0001のに設定しなければなりません。"
    },
    {
      "indent": 6,
      "text": "S-bit: MUST be 1 (indicates that capability is being advertised).",
      "ja": "Sビット：1でなければなりません（機能がアドバタイズされていることを示します）。"
    },
    {
      "indent": 0,
      "text": "6. Typed Wildcard FEC Element for Prefix FEC Element",
      "section_title": true,
      "ja": "プレフィックスFEC要素6.型付きワイルドカードFEC要素"
    },
    {
      "indent": 3,
      "text": "RFC 5036 defines the Prefix FEC Element, but it does not specify a Typed Wildcard for it. This section specifies the Typed Wildcard FEC Element for Prefix FEC Elements.",
      "ja": "RFC 5036は、プレフィックスFEC要素を定義し、それはそれのために型指定されたワイルドカードを指定していません。このセクションでは、プレフィックスFEC要素のために型指定されたワイルドカードFEC要素を指定します。"
    },
    {
      "indent": 3,
      "text": "The format of the Prefix FEC Typed Wildcard FEC Element (\"Prefix FEC Wildcard\" for short), based on Figure 1, is:",
      "ja": "図1に基づいて、プレフィックスFEC型付きワイルドカードFEC要素（略して「プレフィックスFECワイルドカード」）のフォーマットは、次のとおりです。"
    },
    {
      "indent": 6,
      "text": "0                   1                   2                   3\n0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n| Typed Wcard   | Type = Prefix |   Len = 2     |  Address...   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n| ...Family     |\n+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 11,
      "text": "Figure 3: Format of Prefix FEC Element Using Typed Wildcard",
      "ja": "図3：型付きワイルドカードを使用してプレフィックスFEC要素のフォーマット"
    },
    {
      "indent": 3,
      "text": "Where:",
      "ja": "どこ："
    },
    {
      "indent": 6,
      "text": "FEC Element Type: \"Prefix\" FEC Element (0x02, per RFC 5036).",
      "ja": "FEC要素タイプ： \"接頭辞\"（RFC 5036あたり0x02の）FEC要素。"
    },
    {
      "indent": 6,
      "text": "Len FEC Type Info: Two octets. It MUST be set to 0x0002.",
      "ja": "レンFECタイプ情報：2つのオクテット。これは、0×0002に設定しなければなりません。"
    },
    {
      "indent": 6,
      "text": "Address Family: Two-octet quantity containing a value from the \"ADDRESS FAMILY NUMBERS\" registry on http://www.iana.org.",
      "ja": "家族アドレス：http://www.iana.orgの「アドレスファミリー番号」レジストリから値を含む2つのオクテットの数。"
    },
    {
      "indent": 3,
      "text": "The procedures described in Section 4 apply to the Prefix FEC Wildcard processing.",
      "ja": "セクション4に記載された手順は、プレフィックスFECワイルドカード処理に適用されます。"
    },
    {
      "indent": 0,
      "text": "7. Typed Wildcard FEC Element for Host and Wildcard FEC Elements",
      "section_title": true,
      "ja": "7.ホストの型付きワイルドカードFEC要素とワイルドカードFEC要素"
    },
    {
      "indent": 3,
      "text": "There is no need to specify Typed Wildcard FEC Elements for the Host FEC Element specified by [RFC3036], nor for the Wildcard FEC Element specified by RFC 5036. The [RFC3036] Host FEC Element has been removed from RFC 5036, and the Wildcard FEC Element is untyped by definition.",
      "ja": "そこ[RFC3036]で指定されたホストFEC要素のために型指定されたワイルドカードFEC要素を指定する必要がなく、またワイルドカードFEC要素については、RFC 5036で指定された[RFC3036]ホストFEC要素は、RFC 5036、およびワイルドカードFECから削除されました要素は、定義上型なしです。"
    },
    {
      "indent": 3,
      "text": "In other words, the 'FEC Element Type' field in 'Typed Wildcard FEC Element' MUST NOT be either 0x01 or 0x03.",
      "ja": "言い換えれば、「型指定されたワイルドカードFEC要素」で「FEC要素タイプ」フィールドは0×01または0x03のどちらかにすることはできません。"
    },
    {
      "indent": 0,
      "text": "8. IANA Considerations",
      "section_title": true,
      "ja": "8. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document introduces a new LDP FEC Element Type and a new LDP Capability, both of which have been assigned by IANA.",
      "ja": "この文書は、新しいLDP FEC要素タイプと新しいLDP機能を紹介し、IANAによって割り当てられているどちらも。"
    },
    {
      "indent": 6,
      "text": "IANA has assigned a 'Typed Wildcard FEC Element' code point (0x05) from the LDP FEC Type Name Space. [RFC5036] partitions the FEC Type Name Space into 3 regions: IETF Consensus region, First Come First Served region, and Private Use region. The code point 0x05 is from the IETF Consensus range.",
      "ja": "IANAは、LDP FECタイプネームスペースから「型付きワイルドカードFEC要素」コード・ポイント（0×05）を割り当てました。 [RFC5036]は3つの領域にFECタイプネームスペースを仕切る：IETFコンセンサス領域、まず最初に添え地域、およびプライベート使用領域を、是非。コードポイント0x05のはIETFコンセンサス範囲です。"
    },
    {
      "indent": 6,
      "text": "IANA has assigned a 'Typed Wildcard FEC Capability' code point (0x050B) from the TLV Type name space. [RFC5036] partitions the TLV TYPE name space into 3 regions: IETF Consensus region, Vendor Private Use region, and Experimental Use region. The code point 0x050B is from the IETF Consensus range.",
      "ja": "IANAは、TLVタイプのネームスペースから「型指定されたワイルドカードFEC能力」コード・ポイント（0x050B）が割り当てられています。 IETFコンセンサス領域、ベンダーのプライベート使用領域、および実験的使用の地域：[RFC5036]は3つの領域にTLV TYPE名前空間を仕切ります。コードポイント0x050BはIETFコンセンサス範囲です。"
    },
    {
      "indent": 0,
      "text": "9. Security Considerations",
      "section_title": true,
      "ja": "9.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "No security considerations beyond those that apply to the base LDP specification [RFC5036] and that are further described in [RFC5920] apply to use of the Typed Wildcard FEC Elements as described in this document.",
      "ja": "さらに、[RFC5920]に記載されてはセキュリティベースLDP仕様[RFC5036]に適用されるもの以外の考慮事項とは、この文書に記載されているように型付きワイルドカードFEC要素を使用するために適用されません。"
    },
    {
      "indent": 3,
      "text": "One could deduce that the security exposure is reduced by this document, since an LDP speaker using the Typed Wildcard FEC Element could use a single message to request, withdraw, or release all the label mappings of a particular type (a particular Address Family Identifier (AFI), for example), whereas an LDP speaker using the Wildcard FEC Element, as defined in the base LDP specification [RFC5036], could use a single message to request, withdraw, or release all the label mappings of all types (all AFIs, for example).",
      "ja": "型指定されたワイルドカードFEC要素を使用してLDPのスピーカーは、要求する単一のメッセージを使用して撤回する、または特定の型（特定のアドレスファミリ識別子（のすべてのラベルのマッピングを解除する可能性があるので一つは、セキュリティの暴露が、この文書で減少していることを推測することができ例えばAFI）は、）、ワイルドカードFEC素子を用いたLDPスピーカーに対し、ベースLDP仕様[RFC5036]で定義されるように、（すべてのAFISを要求撤回、またはすべてのタイプのすべてのラベルのマッピングを解放するために単一のメッセージを使用することができます、 例えば）。"
    },
    {
      "indent": 0,
      "text": "10. Acknowledgments",
      "section_title": true,
      "ja": "10.謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Yakov Rekhter for suggesting that the limitations of the Wildcard FEC be addressed. Also, thanks to Adrian Farrel, Kamran Raza, and Richard L. Barnes for extensive review of this document.",
      "ja": "著者は、ワイルドカードFECの制限に対処することを示唆しているためヤコフ・レックターに感謝したいと思います。また、この文書の大規模な見直しのためのエードリアンファレル、カムランラザ、そしてリチャード・L.バーンズのおかげ。"
    },
    {
      "indent": 0,
      "text": "11. References",
      "section_title": true,
      "ja": "11.参考文献"
    },
    {
      "indent": 0,
      "text": "11.1. Normative References",
      "section_title": true,
      "ja": "11.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC5036] Andersson, L., Ed., Minei, I., Ed., and B. Thomas, Ed., \"LDP Specification\", RFC 5036, October 2007.",
      "ja": "[RFC5036]アンデション、L.、エド。、Minei、I.、エド。、およびB.トーマス、エド。、 \"LDP仕様\"、RFC 5036、2007年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC5561] Thomas, B., Raza, K., Aggarwal, S., Aggarwal, R., and JL. Le Roux, \"LDP Capabilities\", RFC 5561, July 2009.",
      "ja": "[RFC5561]トーマス、B.、ラザ、K.、アガルワル、S.、アガルワル、R.、およびJL。ル・ルー、 \"LDP機能\"、RFC 5561、2009年7月。"
    },
    {
      "indent": 0,
      "text": "11.2. Informative References",
      "section_title": true,
      "ja": "11.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC3036] Andersson, L., Doolan, P., Feldman, N., Fredette, A., and B. Thomas, \"LDP Specification\", RFC 3036, January 2001.",
      "ja": "[RFC3036]アンデション、L.、Doolan、P.、フェルドマン、N.、Fredette、A.、およびB.トーマス、 \"LDP仕様\"、RFC 3036、2001年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC4447] Martini, L., Ed., Rosen, E., El-Aawar, N., Smith, T., and G. Heron, \"Pseudowire Setup and Maintenance Using the Label Distribution Protocol (LDP)\", RFC 4447, April 2006.",
      "ja": "[RFC4447]、RFC 4447マティーニ、L.、エド。、ローゼン、E.、エルAawar、N.、スミス、T.、およびG.サギ、 \"ラベル配布プロトコル（LDP）を使用して疑似回線の設定とメンテナンス\" 、2006年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC5919] Asati, R., Mohapatra, P., Minei, I., and B. Thomas, \"Signaling LDP Label Advertisement Completion\", RFC 5919, August 2010.",
      "ja": "[RFC5919] Asati、R.、Mohapatra、P.、Minei、I.、およびB.トーマス、 \"シグナリングLDPラベル広告完了\"、RFC 5919、2010年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC5920] Fang, L., Ed., \"Security Framework for MPLS and GMPLS Networks\", RFC 5920, July 2010.",
      "ja": "[RFC5920]牙、L.、エド。、 \"MPLSおよびGMPLSネットワークのセキュリティフレームワーク\"、RFC 5920、2010年7月。"
    },
    {
      "indent": 3,
      "text": "[MLDP] Minei, I., Ed., Kompella, K., Wijnands, I., Ed., and B. Thomas, \"Label Distribution Protocol Extensions for Point-to-Multipoint and Multipoint-to-Multipoint Label Switched Paths\", Work in Progress, July 2010.",
      "ja": "[MLDP] Minei、I.、エド。、Kompella、K.、Wijnands、I.、エド。、およびB.トーマス、「ラベル配布プロトコルの拡張ポイント・ツー・マルチポイントおよびマルチポイント・ツー・マルチポイントラベルは、パスの交換しました」 、進捗状況、2010年7月に作業。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Rajiv Asati Cisco Systems 7025-6 Kit Creek Rd. Research Triangle Park, NC 27709-4987 EMail: rajiva@cisco.com",
      "ja": "ラジブAsatiシスコシステムズ7025から6キットクリークRdを。リサーチトライアングルパーク、NC 27709-4987 Eメール：rajiva@cisco.com"
    },
    {
      "indent": 3,
      "text": "Ina Minei Juniper Networks 1194 North Mathilda Ave. Sunnyvale, CA 94089 EMail: ina@juniper.net",
      "ja": "伊那Mineiジュニパーネットワークスの1194北マチルダアベニュー。サニーベール、CA 94089 Eメール：ina@juniper.net"
    },
    {
      "indent": 3,
      "text": "Bob Thomas EMail: bobthomas@alum.mit.edu",
      "ja": "ボブトーマスEメール：bobthomas@alum.mit.edu"
    }
  ]
}