{
  "title": {
    "text": "RFC 7221 - Handling of Internet-Drafts by IETF Working Groups",
    "ja": "RFC 7221 - IETFワーキンググループによるインターネットドラフトの取り扱い"
  },
  "number": 7221,
  "created_at": "2019-10-30 07:15:48.490243+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         A. Farrel\nRequest for Comments: 7221                              Juniper Networks\nCategory: Informational                                  D. Crocker, Ed.\nISSN: 2070-1721                              Brandenburg InternetWorking\n                                                              April 2014",
      "raw": true
    },
    {
      "indent": 11,
      "text": "Handling of Internet-Drafts by IETF Working Groups",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "The productive output of an IETF working group is documents, as mandated by the working group's charter. When a working group is ready to develop a particular document, the most common mechanism is for it to \"adopt\" an existing document as a starting point. The document that a working group adopts and then develops further is based on initial input at varying levels of maturity. An initial working group draft might be a document already in wide use, or it might be a blank sheet, wholly created by the working group, or it might represent any level of maturity in between. This document discusses how a working group typically handles the formal documents that it targets for publication.",
      "ja": "ワーキンググループの憲章によって義務付けられIETFワーキンググループの生産出力は、文書です。ワーキンググループは、特定の文書を開発する準備ができているとき、それは出発点として、既存の文書を「採用」するために、最も一般的なメカニズムです。ワーキンググループが採用し、さらに開発文書は成熟度の様々なレベルで初期入力に基づいています。最初のワーキンググループの草案はすでに広く使用中の文書である場合もあれば、完全にワーキンググループによって作成された白紙、あるかもしれない、またはそれは、間に成熟の任意のレベルを表しているかもしれません。この文書では、ワーキンググループは、一般的に、それは出版のためにターゲット正式な文書を処理する方法を説明します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 IESGによって承認されていないすべての文書がインターネットStandardのどんなレベルの候補です。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7221.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7221で取得することができます。"
    },
    {
      "indent": 3,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2014 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2014 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n   1.1. What Is a WG Draft? ........................................3\n   1.2. Working Group Authority and Consensus ......................4\n   1.3. Questions Considered in This Document ......................5\n2. Adoption Sequence ...............................................6\n   2.1. Common Steps ...............................................6\n   2.2. Criteria for Adoption ......................................6\n3. Authors/Editors .................................................8\n4. Document History and Stability ..................................8\n5. Some Issues for Consideration ..................................10\n   5.1. Individual I-Ds under WG Care .............................10\n   5.2. WG Drafts Can Become Individual Drafts ....................11\n   5.3. Competing Drafts ..........................................11\n6. Security Considerations ........................................13\n7. Acknowledgements ...............................................13\n8. Informative References .........................................13",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "The productive output of an IETF working group (WG) is documents, as mandated by the working group's charter. Working groups develop these documents based on initial input at varying levels of maturity. An initial working group draft might be a document already in wide use, or it might be a blank sheet, wholly created by the working group, or it might represent any level of maturity in between. This document discusses how a working group typically handles the formal documents that it targets for publication. The discussion applies only to the IETF and does not cover IRTF groups, where practices vary widely.",
      "ja": "ワーキンググループの憲章によって義務付けられIETFワーキンググループ（WG）の生産出力は、文書です。ワーキンググループは、成熟度のさまざまなレベルでの最初の入力に基づいて、これらの文書を開発します。最初のワーキンググループの草案はすでに広く使用中の文書である場合もあれば、完全にワーキンググループによって作成された白紙、あるかもしれない、またはそれは、間に成熟の任意のレベルを表しているかもしれません。この文書では、ワーキンググループは、一般的に、それは出版のためにターゲット正式な文書を処理する方法を説明します。議論はIETFに適用され、実践が大きく異なるIRTFグループを、カバーしていません。"
    },
    {
      "indent": 3,
      "text": "Within the general constraints of formal IETF process and the specific constraints of a working group's charter, there can be considerable freedom in the adoption and development of drafts. As with most IETF activities, the ultimate arbiter of such choices is working group agreement, within the constraints of its charter. As with most working group management, this agreement might be explicit or implicit, depending upon the efficiencies that the group deems appropriate.",
      "ja": "正式なIETFプロセスの一般的な制約やワーキンググループの憲章の具体的な制約の中で、ドラフトの採用と開発にかなりの自由があることができます。ほとんどのIETF活動と同じように、このような選択肢の究極アービタはその憲章の制約の中で、グループの合意を進めています。ほとんどのワーキンググループの管理と同様に、この契約は、グループが適切と判断効率に応じて、明示的または暗黙的かもしれません。"
    },
    {
      "indent": 3,
      "text": "NOTE: This document is intentionally non-normative. It is meant as a guide to common practice, rather than as a formal definition of what is permissible.",
      "ja": "注：このドキュメントでは、意図的に非規範的です。これは、一般的な慣行へのガイドとしてではなく、許されるものの正式な定義として意図されています。"
    },
    {
      "indent": 0,
      "text": "1.1. What Is a WG Draft?",
      "section_title": true,
      "ja": "1.1。 WGドラフトとは何ですか？"
    },
    {
      "indent": 3,
      "text": "Working group drafts are documents that are subject to IETF working group revision control, with advancement for publication as an RFC requiring rough consensus in the working group and then in the broader IETF. Creation or adoption of a draft by a working group -- as well as substantive changes to the document -- need to represent working group rough consensus.",
      "ja": "ワーキンググループのドラフトは、IETFが広いIETFにおけるその後ラフワーキンググループでコンセンサスとを必要とするRFCとして公開の進歩とともに、グループリビジョン管理作業の対象となる文書です。だけでなく、文書への実質的な変更 -   - ワーキンググループラフコンセンサスを表現する必要性ワーキンググループによる草案の作成や採用。"
    },
    {
      "indent": 3,
      "text": "Documents under development in the IETF community are distributed as Internet-Drafts (I-Ds) [RFC2026] [ID-Info]. Working groups use this mechanism for producing their official output, per Section 7.2 of [RFC2418] and Section 6.3 of [Tao]. The common convention for identifying an I-D formally under the ownership of a working group is by the inclusion of \"ietf\" in the second field of the I-D filename and the working group name in the third field, per Section 7 of [ID-Guidelines]. That is:",
      "ja": "IETFコミュニティで開発中のドキュメントはインターネットドラフト（I-DS）[RFC2026] [ID-情報]として配布されています。ワーキンググループは、[RFC2418]のセクション7.2と[タオ]の6.3節ごとに、彼らの公式の出力を生成するために、このメカニズムを使用しています。ワーキンググループの所有権の下で正式にIDを識別するための一般的な規則は、[ID-ガイドライン]のセクション7当たり、第3フィールドにIDファイル名とワーキンググループ名の2番目のフィールドに「IETF」を含めることによります。あれは："
    },
    {
      "indent": 26,
      "text": "draft-ietf-<wgname>-...",
      "ja": "ドラフト-ietf- <wgname> -..."
    },
    {
      "indent": 3,
      "text": "In contrast, individual submissions are drafts being created and pursued outside of a working group, although a working group might choose to adopt the draft later, as discussed below. Anyone is free to create an individual submission at any time. Such documents are typically distinguished through the use of the author/editor's last name, in the style of:",
      "ja": "これとは対照的に、個々の提出は、以下に述べるようにワーキンググループは、後で案を採択することを選択するかもしれませんが、ワーキンググループの外に作成され、追求されているドラフトです。誰もがいつでも、個々の提出を自由に作成することができます。このような文書は、通常のスタイルで、著者/編集者の姓を使用して区別されています。"
    },
    {
      "indent": 27,
      "text": "draft-<lastname>-...",
      "ja": "draft- <姓> -..."
    },
    {
      "indent": 3,
      "text": "(Also see Section 5.1 for an elaboration on this naming.)",
      "ja": "（また、この命名の精緻化のためのセクション5.1を参照してください。）"
    },
    {
      "indent": 3,
      "text": "Responsibility for direct revision of a working group I-D is assigned to its editors and authors. See Section 3 for discussion about their selection and role.",
      "ja": "ワーキンググループI-Dの直接の改正のための責任は、その編集者と著者に割り当てられています。その選択と役割についての議論のための第3節を参照してください。"
    },
    {
      "indent": 0,
      "text": "1.2. Working Group Authority and Consensus",
      "section_title": true,
      "ja": "1.2。ワーキンググループ権限と合意"
    },
    {
      "indent": 3,
      "text": "A premise of the IETF is that, within a working group, it is the working group itself that has final authority over the content of its documents, within the constraints of the working group's charter. No individual has special authority for the content. The Chairs assign document authors/editors and can formulate design teams, but the content of working group documents is always, ultimately, subject to working group approval. Approval is described in terms of the IETF's \"rough consensus\" construct, which is the prime example of the IETF's preference for pragmatics over niceties. Unanimous agreement is always desirable, but more approximate (rough) agreement will suffice, as long as it is clear and strong.",
      "ja": "IETFの前提は、ワーキンググループ内で、それはワーキンググループの憲章の制約の中で、その文書の内容を超える最終的な権限を持っているワーキンググループ自体である、ということです。いいえ、個々のコンテンツのための特別な権限を持っていません。議長は、文書の作成者/編集者を割り当て、設計チームを策定することができますが、ワーキンググループの文書の内容は、最終的には、常にグループの承認を作業の対象となります。承認は細かい点以上の語用論のためのIETFの好みの典型的な例であるIETFの「ラフコンセンサス」コンストラクトの用語で記述されています。全会一致の合意は、常に望ましいですが、よりおおよそ（ラフ）合意は、それが明確で強いよう、十分であろう。"
    },
    {
      "indent": 3,
      "text": "Other than for selection of document authors/editors, as discussed in Section 3, working group decision-making about document management is subject to normal IETF rough consensus rules. Useful descriptions of this process for a working group are in Section 3.3 of [RFC2418] and Section 4.2 of [Tao]. Discussion of the nature of rough consensus can be found in [Consensus].",
      "ja": "集団決定の文書管理に関するワーキング、第3節で述べたように、文書の作成者/編集者の選択のため以外には、通常のIETFラフコンセンサス規則の対象となります。ワーキンググループのためのこの方法の有用な説明は[RFC2418]と[タオ]のセクション4.2のセクション3.3です。ラフコンセンサスの本質の議論は[合意]で見つけることができます。"
    },
    {
      "indent": 3,
      "text": "In terms of the IETF's formal rough consensus processes, the working group explicitly develops, modifies, reviews, and approves document content, according to overt rough consensus. For difficult topics and/or difficult working group dynamics, this laborious process really is essential. Its diligence validates progress at each step along the way. However, working groups often handle simpler matters more simply, such as allowing a Chair to assert the likely agreement and then merely call for objections. Ultimately, the mode of working group decision-making is determined by the comfort and engagement of the working group with the way the decisions are being made.",
      "ja": "IETFの正式なラフコンセンサスプロセスの観点では、ワーキンググループは、明示的に明白な荒いコンセンサスによると、修正、レビューを開発し、文書の内容を承認します。困難なトピックおよび/または困難な作業グループダイナミクスに関しては、この骨の折れるプロセスが本当に必要不可欠です。その勤勉さは、道に沿ってステップごとに進捗状況を検証します。しかし、ワーキンググループは、多くの場合、議長は、おそらく契約を主張して、単に反対のために呼び出すことができるよう、より簡単にシンプルな事項を扱います。最終的には、ワーキンググループの意思決定のモードは、決定が行われている方法で、快適さとワーキンググループの係合によって決定されます。"
    },
    {
      "indent": 3,
      "text": "At times, a document author/editor can appear to have considerable authority over content, but this is (merely) for efficiency. That is, the Chairs can permit authors and editors to proceed with an implied (default) working group agreement, as long as the working group is comfortable with that mode. Of course, the benefit in the mode is efficiency, but its risk is failure to retain or verify actual consensus among the working group participants. When a working group is operating in the mode of active, direct author/ editor content development, an easy validation method is simply to have Chairs query the working group when a new document version appears, asking for comments and concerns.",
      "ja": "時には、文書作成者/編集者はコンテンツの上にかなりの権限を持っているように見えることができますが、これは効率のために（単に）です。それは、議長は限りワーキング・グループは、そのモードに慣れていると、暗黙の（デフォルト）ワーキンググループの合意を進めることを著者と編集を許可することができ、あります。もちろん、モードの利点は効率ですが、そのリスクは、ワーキンググループ参加者の間で実際のコンセンサスを保持または検証の失敗です。ワーキンググループがアクティブ、直接著者/編集者、コンテンツ開発のモードで動作している場合は、簡単な検証方法は、新しいドキュメントバージョンは、コメントや懸念を求めて、表示されたとき、議長は、ワーキンググループを照会持っているだけです。"
    },
    {
      "indent": 3,
      "text": "In general, when it is not completely obvious what the opinion of the working group is, Working Group Chairs can poll the working group to find out. As with any other consensus question, the form in which it is asked can make a difference. In particular, a general 'yes/no' question often is not as helpful as asking supporters and detractors of a draft -- or of the decision under consideration -- to provide their reasons, not merely their preferences. In effect, this treats the matter of consensus as an ongoing discussion. Ideally, the discussion can produce changes in the document or in participant views, or both.",
      "ja": "ワーキンググループの意見が何であるかを完全に明らかでないとき、一般的には、作業部会の議長は、見つけるためにワーキンググループをポーリングすることができます。他のコンセンサス質問と同じように、それが聞かれたフォームは違いを作ることができます。具体的には、一般的には、「はい/いいえ」の質問は、多くの場合、ドラフトのサポーターと中傷を尋ねるほど有用ではないではありません - または検討中の意思決定の - だけではなく、自分の好みを自分の理由を提供します。実際に、これは現在進行中の議論とコンセンサスの問題を扱います。理想的には、議論は、文書内または参加者ビューの変更、またはその両方を生成することができます。"
    },
    {
      "indent": 0,
      "text": "1.3. Questions Considered in This Document",
      "section_title": true,
      "ja": "1.3。この文書に記載されていると考えられ質問"
    },
    {
      "indent": 3,
      "text": "The purpose of this document is to discuss the criteria and sequence typically followed when adopting and developing a formal IETF working group document. Therefore, this document considers the following questions that are particularly relevant to Working Group Chairs who are charged with running the process:",
      "ja": "このドキュメントの目的は、正式なIETFワーキンググループ文書を採用して開発する場合、一般的に続くの基準と順序を議論することです。したがって、この文書は、プロセスの実行に充電されている作業部会の議長に特に関連する以下の質問を検討します："
    },
    {
      "indent": 3,
      "text": "* How do Working Group Chairs decide which drafts to adopt and when?",
      "ja": "*どのように作業部会の議長は、時に採用し、ために立案している決めるのですか？"
    },
    {
      "indent": 3,
      "text": "* Is it necessary to poll the working group explicitly, and what does a working group poll look like?",
      "ja": "*明示的にワーキンググループをポーリングすることが必要であり、何のようなワーキンググループの世論調査を見ていますか？"
    },
    {
      "indent": 3,
      "text": "* How do Working Group Chairs make the decision?",
      "ja": "*どのように作業部会の議長は、決定を下すのですか？"
    },
    {
      "indent": 3,
      "text": "* What are the process steps the working group will choose to use, for an I-D to become a WG I-D?",
      "ja": "*プロセスがワーキング・グループは、WG I-DになるためのI-Dのために、使用することを選択します手順は何ですか？"
    },
    {
      "indent": 3,
      "text": "* Are there any special cases?",
      "ja": "*特別なケースがありますか？"
    },
    {
      "indent": 3,
      "text": "* Can a document be created as a WG I-D from scratch?",
      "ja": "*文書は最初からWG I-Dとして作成することはできますか？"
    },
    {
      "indent": 3,
      "text": "* How can competing drafts be handled?",
      "ja": "*どのように競合するのドラフトを扱うことができますか？"
    },
    {
      "indent": 3,
      "text": "* Can an individual I-D be under the care of a WG?",
      "ja": "*個々のI-Dは、WGの世話の下にすることはできますか？"
    },
    {
      "indent": 3,
      "text": "* Can a WG I-D become an individual I-D?",
      "ja": "* WG I-Dは、個々のI-Dになることはできますか？"
    },
    {
      "indent": 0,
      "text": "2. Adoption Sequence",
      "section_title": true,
      "ja": "2.採用シーケンス"
    },
    {
      "indent": 0,
      "text": "2.1. Common Steps",
      "section_title": true,
      "ja": "2.1。一般的な手順"
    },
    {
      "indent": 3,
      "text": "When there is interest in adopting a document as a new working group document, the Chairs often:",
      "ja": "とき、多くの場合、新しいワーキンググループ文書として議長を文書を採用に関心があります："
    },
    {
      "indent": 3,
      "text": "1. Remind current draft owners that they are transferring change control for the document to the IETF. (This is a particularly significant point for a document covered by proprietary interests, because it typically entails a negotiation between the current owners and the IETF, including a formal agreement.)",
      "ja": "1.彼らはIETFへの文書の変更制御を転送している現在のドラフトの所有者を思い出させます。 （それは通常、正式な契約を含め、現在の所有者とIETFとの交渉を伴うので、これは、独自の利益でカバー文書のために特に重要なポイントです。）"
    },
    {
      "indent": 3,
      "text": "2. Check for known IPR that needs to be disclosed, using some technique like those described in [RFC6702].",
      "ja": "[RFC6702]に記載されているもののようないくつかの技術を使用して、開示される必要がある既知のIPR 2.確認。"
    },
    {
      "indent": 3,
      "text": "3. Obtain working group rough consensus.",
      "section_title": true,
      "ja": "3.ワーキンググループラフコンセンサスを取得します。"
    },
    {
      "indent": 3,
      "text": "4. Choose document editors.",
      "section_title": true,
      "ja": "4.文書エディタを選択してください。"
    },
    {
      "indent": 3,
      "text": "5. Instruct authors to post the WG I-D.",
      "section_title": true,
      "ja": "5. WG I-Dを投稿する著者に指示します。"
    },
    {
      "indent": 3,
      "text": "6. Approve posting [Approval].",
      "section_title": true,
      "ja": "6. [承認]投稿承認。"
    },
    {
      "indent": 3,
      "text": "7. Ensure that the non-working group version of the draft is marked as being replaced by this working group version.",
      "ja": "7.ドラフトの非ワーキンググループのバージョンは、このワーキンググループのバージョンに置き換えされているとマークされていることを確認してください。"
    },
    {
      "indent": 3,
      "text": "8. Encourage everyone to enjoy the ensuing working group discussion...",
      "ja": "8.その後のワーキンググループディスカッションを楽しむために皆を奨励します..."
    },
    {
      "indent": 0,
      "text": "2.2. Criteria for Adoption",
      "section_title": true,
      "ja": "2.2。養子縁組のための基準"
    },
    {
      "indent": 3,
      "text": "No formal specification for working group 'adoption' of a draft exists; the current document is meant to provide a description of common activities for this, but again note that it is not normative.",
      "ja": "存在草案のワーキンググループ「養子縁組」の正式な仕様ありません。現在のドキュメントは、このための一般的な活動の説明を提供するが、やはりそれは規範的ではないことに注意することは意味しています。"
    },
    {
      "indent": 3,
      "text": "There are some basic considerations when deciding to adopt a draft:",
      "ja": "草案を採択することを決定するいくつかの基本的な考慮事項があります。"
    },
    {
      "indent": 3,
      "text": "* Is there a charter milestone that explicitly calls for such a document?",
      "ja": "*明示的な文書を要求チャーターマイルストーンはありますか？"
    },
    {
      "indent": 3,
      "text": "* Is the topic of the I-D within scope for the working group?",
      "ja": "*ワーキンググループの範囲内でのI-Dの話題ですか？"
    },
    {
      "indent": 3,
      "text": "* Is the purpose of the draft sufficiently clear?",
      "ja": "*ドラフトの目的は十分に明確ですか？"
    },
    {
      "indent": 3,
      "text": "* Does the document provide an acceptable platform for continued effort by the working group?",
      "ja": "*文書はワーキンググループによって継続的な努力のために許容可能なプラットフォームを提供していますか？"
    },
    {
      "indent": 3,
      "text": "* What are the process or technical objections to adoption of the draft?",
      "ja": "*ドラフトの採用プロセスや技術的な反論は何ですか？"
    },
    {
      "indent": 3,
      "text": "* Is the draft likely to be completed in a timely manner?",
      "ja": "*ドラフトは、適時に完了する可能性が高いですか？"
    },
    {
      "indent": 3,
      "text": "* Does the intended status of the document seem reasonable to the working group?",
      "ja": "*ドキュメントの意図した状態がワーキンググループに合理的なように見えるのか？"
    },
    {
      "indent": 3,
      "text": "* If not already in scope, is a simple modification to the charter feasible and warranted?",
      "ja": "*範囲内でない場合はすでには、実現可能な、保証憲章に簡単な変更のですか？"
    },
    {
      "indent": 3,
      "text": "* Does the draft carry known intellectual property rights issues?",
      "ja": "*ドラフトでは知られている知的財産権の問題を運ぶのか？"
    },
    {
      "indent": 3,
      "text": "* Is there strong working group support for working on the draft?",
      "ja": "*ドラフトでの作業のための強力なワーキンググループのサポートはありますか？"
    },
    {
      "indent": 3,
      "text": "Adoption has some basic pragmatics:",
      "ja": "養子縁組は、いくつかの基本的な語用論があります。"
    },
    {
      "indent": 6,
      "text": "Rough consensus: Working group agreement to adopt is not required to be unanimous [RFC2418].",
      "ja": "ラフコンセンサス：採用するワーキンググループの合意が全会一致[RFC2418]である必要はありません。"
    },
    {
      "indent": 6,
      "text": "Initial, not final: The writing quality is not required to be \"ready for publication\", although writing quality can be a problem and does need explicit attention; although not mandatory, it is good practice to check whether a new working group draft passes [IDNITS].",
      "ja": "最終的に、初期ません：品質を書くことが問題になることができ、明示的に注意が必要なんが、書き込み品質は、「出版の準備」である必要はありません。必須ではないが、新しいワーキンググループのドラフトは[IDNITS]渡すかどうかを確認することをお勧めします。"
    },
    {
      "indent": 6,
      "text": "Adoption, not approval: The document is not required to already contain a complete and/or sufficient solution, although of course this can be helpful. Equally, adoption by a working group does not guarantee publication of the document as an RFC.",
      "ja": "養子縁組ではなく、承認は：もちろん、これは役に立つことができますが、文書は、すでに完全なおよび/または十分な解決策が含まれてする必要はありません。同様に、ワーキンググループによる採用はRFCとして文書の公表を保証するものではありません。"
    },
    {
      "indent": 6,
      "text": "Group, not Chairs: Concerning the draft, the position of the Working Group Chairs has no special authority, except to assess working group consensus.",
      "ja": "グループではなく、議長：ワーキンググループのコンセンサスを評価するため以外のドラフトについては、ワーキンググループの議長の位置は、特別な権限を持っていません。"
    },
    {
      "indent": 3,
      "text": "REMINDER: Once a working group adopts a draft, the document is owned by the working group and can be changed however the working group decides, within the bounds of IETF process and the working group charter. Absent explicit agreement, adopting a document does not automatically mean that the working group has agreed to all of its content. So a working group (or its charter) might explicitly dictate the basis for retaining, removing, or modifying some or all of a draft's content, technical details, or the like. However, in the absence of such constraints, it is worth having the adoption process include a sub-process of gathering working group concerns about the existing draft and flagging them explicitly.",
      "ja": "REMINDER：ワーキンググループが草案を採用すると、文書はワーキンググループによって所有され、IETFプロセスの境界とワーキンググループ憲章の中に、しかし、ワーキンググループを決定し変更することができます。不在の明示的な合意は、文書を採用すると、自動的にワーキンググループは、その内容の全てに同意したことを意味するものではありません。だから、ワーキンググループ（またはその憲章）は、明示的に、保持、削除、またはドラフトの内容の一部またはすべてを変更するための基礎、技術的な詳細などを指示することがあります。しかし、そのような制約が存在しない場合には、採用プロセスを持つ価値がある既存の草案に関するワーキンググループの懸念を収集し、それらを明示的に低迷するサブプロセスが含まれます。"
    },
    {
      "indent": 0,
      "text": "3. Authors/Editors",
      "section_title": true,
      "ja": "3.著者/編集者"
    },
    {
      "indent": 3,
      "text": "Document authors/editors are chosen by the Working Group Chairs. Document editors are described in Section 6.3 of [RFC2418]. Authors and editors are described in [RFC-Auth-Ed].",
      "ja": "ドキュメントの作成者/編集者は、作業部会の議長が選ばれています。ドキュメントエディタは、[RFC2418]のセクション6.3に記載されています。著者と編集者は、[RFC-AUTH-エド]に記載されています。"
    },
    {
      "indent": 3,
      "text": "NOTE: In this document, the terms 'author' and 'editor' are meant interchangeably. Within the IETF, the distinction between an 'author' and an 'editor' is, at best, subjective. A simplistic rule of thumb is that editors tend to do the mechanics of incorporating working group detail, whereas authors tend to create the detail, subject to working group approval. That is, one role is more active with the content, and the other is more passive. It is a responsibility of the Working Group Chairs to ensure that document authors make modifications in accord with working group rough consensus. Authors/editors are solely chosen by the Chairs -- although the views of the working group should be considered -- and are subject to replacement for a variety of reasons, as the Chairs see fit.",
      "ja": "注：この文書では、用語「著者」と「エディタ」が同義的に意図されています。 IETF内では、「著者」と「編集者」の区別は最高の状態で、主観的、です。親指の単純なルールは、著者がグループの承認を作業の対象、詳細を作成する傾向があるのに対し、編集者は、ワーキンググループ詳細を組み込む仕組みを行う傾向があることです。つまり、1つの役割は、コンテンツと、より積極的であり、他方はより受動的です。その文書の作成者が作業グループラフコンセンサスと一致して修正を行うことを確認するために作業部会の議長の責任です。ワーキンググループの意見が考慮されるべきである -   - 著者/編集者はもっぱら議長が選ばれ、議長が合うように、さまざまな理由での交換の対象となります。"
    },
    {
      "indent": 3,
      "text": "For existing documents that are being adopted by a working group, there is a special challenge in the selection of document editors. Because the document has already had editors, the question \"Are the same people appropriate for continuing the task?\" is asked. Sometimes the answer is yes, but this is not automatic. The process within an IETF working group can be quite different from the process that created previous versions. This well might make it appropriate to select one or more new editors, either as additions to the editor team or as primary pen-holders (effectively reclassifying the previous team as coauthors).",
      "ja": "ワーキンググループによって採用されている既存の文書の場合、文書の編集者の選択に特別な課題があります。文書がすでに編集者があったので、質問は「作業を継続するための適切な同じ人いますか？」頼まれます。時々、答えはイエスですが、これは自動ではありません。 IETFワーキンググループ内のプロセスは、以前のバージョンを作成したプロセスとは大きく異なる場合があります。このほかには、（効果的に共著者として、以前のチームを再分類）、エディタのチームへの追加として、またはプライマリペンホルダーとしてのいずれか1つ以上の新しい編集者を、選択することが適切になるかもしれません。"
    },
    {
      "indent": 3,
      "text": "If the original editors are to continue in their role, the Chairs might want to ensure that the editors understand IETF working group process; it is likely to be quite different from the process that developed earlier versions of the document. If additional or new editors are assigned, the transition can be discussed, including its reasons; this is best done as soon as possible.",
      "ja": "元編集者が自分の役割を継続している場合は、議長は、エディタがIETFワーキンググループのプロセスを理解していることを確認したい場合があります。ドキュメントの以前のバージョンを開発したプロセスとは全く異なる可能性があります。追加または新しいエディタが割り当てられている場合、遷移は、その理由を含め、議論することができます。これは最高できるだけ早く実行されます。"
    },
    {
      "indent": 0,
      "text": "4. Document History and Stability",
      "section_title": true,
      "ja": "4.ドキュメント履歴と安定性"
    },
    {
      "indent": 3,
      "text": "Working group charters sometimes specify an initial set of existing documents to use as a basis of the working group's activities. That 'basis' can vary considerably, from simple input to working group discussion, all the way to an advanced draft adopted by the working group and subject only to minimal changes. The role of a document should be explicitly stated in the charter.",
      "ja": "ワーキンググループのチャーターは時々ワーキンググループの活動のベースとして使用する既存の文書の最初のセットを指定します。その「基礎」は、単純な入力からグループディスカッション、最小限の変更にワーキンググループと被写体によって採用先進ドラフトまでずっと作業にかなり変化することができます。文書の役割が明確憲章に明記されなければなりません。"
    },
    {
      "indent": 3,
      "text": "Within the scope of its charter, a working group is free to create new documents. It is not required that all drafts start as the effort of an individual. Of course, the criteria for brand new documents are likely to be the same as for those imported into the working group, with the additional and obvious requirement that the Working Group Chairs will need to appoint authors/editors before any work can progress. Note that, from time to time, a working group will form a design team to produce the first version of a working group draft. Design teams are discussed in Section 6.5 of [RFC2418].",
      "ja": "その憲章の範囲内で、ワーキンググループは、新しい文書を作成して自由です。すべてのドラフトは、個々の取り組みとして開始することを必要とされていません。もちろん、ブランドの新しいドキュメントの基準は、作業部会の議長は、すべての作業が進行する前に、著者/編集者を任命する必要があります追加し、明らかな要件で、ワーキンググループにインポートたものと同じである可能性が高いです。なお、随時、ワーキンググループは、ワーキンググループのドラフトの最初のバージョンを生成するために、設計チームを形成します。設計チームは、[RFC2418]のセクション6.5で議論されています。"
    },
    {
      "indent": 3,
      "text": "Work that is brought to the IETF has different levels of completeness and maturity, and different timings for having achieved those levels. When the IETF charters a group and includes existing material, the charter can cast the role of that material in very different ways. It can treat it as:",
      "ja": "IETFにもたらされる仕事はそれらのレベルを達成したため、完全と成熟度の異なるレベル、および異なるタイミングがあります。 IETFは、グループをチャーターして、既存の材料を含む場合には、チャーターは非常に異なる方法でその材料の役割をキャストすることができます。それはそれとして扱うことができます。"
    },
    {
      "indent": 3,
      "text": "* no more than a set of ideas, to be used or ignored;",
      "ja": "*、使用または無視するアイデアの集合を超えません。"
    },
    {
      "indent": 3,
      "text": "* a basic design, with all of the actual details still fluid;",
      "ja": "*まだ流体の実際のすべての詳細と基本設計、。"
    },
    {
      "indent": 3,
      "text": "* a rough draft, subject to extensive revision;",
      "ja": "*大規模な改訂を受け草稿、。"
    },
    {
      "indent": 3,
      "text": "* a solid specification that merely needs review, refinement, and maybe enhancement;",
      "ja": "*単に見直し、改善、そしておそらく強化を必要とする固体仕様。"
    },
    {
      "indent": 3,
      "text": "* a deployed technology that is best served by trying to protect its installed base, but with some tolerance for changes that affect interoperability;",
      "ja": "最高のが、相互運用性に影響する変更のためのいくつかの許容範囲と、そのインストールベースを保護しようとすることで提供しています*展開技術。"
    },
    {
      "indent": 3,
      "text": "* a deployed technology for which protecting the installed base is essential, including retention of core interoperability.",
      "ja": "*インストールベースを保護対象の展開技術は、コアの相互運用性の保持を含め、必要不可欠です。"
    },
    {
      "indent": 3,
      "text": "These suggest a wide range of possible constraints on working group effort. Technology is brought to the IETF at different points of maturity along its life cycle, and the nature of the technology can have widely varying utility in developing an Internet standard.",
      "ja": "これらは、グループの努力を作業で可能な制約の広い範囲を示唆しています。テクノロジーは、そのライフサイクルに沿って、満期の異なるポイントでIETFにもたらされ、そして技術の性質は、インターネット標準の開発に広く様々な有用性を持つことができます。"
    },
    {
      "indent": 3,
      "text": "When technology is brand new, with at most some prototypes done as proofs of concept, then significant changes to the specification will not necessarily add much to the development and deployment costs. However, when the technology is already part of a mature and extensive operational deployment, any changes that are incompatible are likely to be problematic for that market and can hinder adoption of the changes overall. For example, immediately after the development investment is made -- and especially when there has been considerable initial deployment but there is still room for quite a bit more -- the installed and potential base might not take kindly to disruptive standards work that undermines their recent investment.",
      "ja": "技術は、概念実証として行わ高々いくつかのプロトタイプで、真新しいある場合、その仕様に大幅な変更は、必ずしも開発と展開費に多くを追加しません。技術はすでに成熟しており、豊富な業務展開の一部である場合ただし、互換性のない変更は、その市場のための問題である可能性が高いと全体的な変化の採用を妨げることができます。かなり初期の展開があったが、それでもかなり多くの余地がある場合は特に、および -   - 設置し、潜在的なベースは彼らの最近の損なう破壊的な標準化作業に親切にならないことがありますたとえば、開発投資が行われた直後投資。"
    },
    {
      "indent": 3,
      "text": "Conversely, even a deployed technology with a solid base might be inappropriate to deploy at Internet scale, and while a document specifying such a technology might serve as a good starting point on which to base a new specification, undermining of the deployed base might be completely appropriate.",
      "ja": "逆に、固体塩基でも展開技術は、インターネット規模で展開することが不適切である可能性があり、そのような技術を指定文書が新しい仕様の基礎となる良好な出発点として役立つかもしれないが、配備ベースの弱体化は、完全であるかもしれません適切な。"
    },
    {
      "indent": 3,
      "text": "In reflecting upon the basis for adopting an existing draft and the way it will be used by the working group, it is important to consider the document's place in its life cycle, the needs of any installed base, and the applicability of the draft's technology, when deciding on the constraints to impose on document development. It will all depend on the constraints of the charter and the analysis of the working group.",
      "ja": "既存のドラフトとそれがワーキンググループによって使用される方法を採用するための基盤上に反映して、それがそのライフサイクル中に文書の場所を考慮することが重要である、任意のインストールベースのニーズ、およびドラフトの技術の適用性、文書の開発に課す制約を決定する際に。これは、すべてのチャーターやワーキンググループの分析の制約に依存します。"
    },
    {
      "indent": 0,
      "text": "5. Some Issues for Consideration",
      "section_title": true,
      "ja": "5.検討のためのいくつかの問題は、"
    },
    {
      "indent": 0,
      "text": "5.1. Individual I-Ds under WG Care",
      "section_title": true,
      "ja": "5.1。 WGケアの下で、個々のI-DS"
    },
    {
      "indent": 3,
      "text": "Sometimes, a working group facilitates a draft but does not own it or formally adopt it. These are \"individual\" drafts [Individual].",
      "ja": "時には、ワーキンググループは、ドラフトを促進するが、それを所有しているか、または正式にそれを採用していません。これらは、「個人」の草稿[個別]です。"
    },
    {
      "indent": 3,
      "text": "As noted in Section 1.1 and reinforced in [ID-Guidelines], the convention for identifying an I-D formally under the ownership of a working group is by following the naming convention:",
      "ja": "セクション1.1で述べたと[ID-ガイドライン]に補強されるように、ワーキンググループの所有権の下で正式にIDを識別するための規則は、命名規則に従うことです。"
    },
    {
      "indent": 26,
      "text": "draft-ietf-<wgname>-...",
      "ja": "ドラフト-ietf- <wgname> -..."
    },
    {
      "indent": 3,
      "text": "By contrast, documents that are still under the control of their authors are known as \"individual\" I-Ds. When these documents are intended for consideration by a specific working group, the convention is that the document uses the naming convention as follows, where the second element is the last name of one of the principal authors.",
      "ja": "これとは対照的に、その作者の制御下に残っている文書は、「個々の」I-DSとして知られています。これらの文書は、特定のワーキンググループによる検討のために意図されている場合には、規則では、次のように2番目の要素は主要な著者の一人の最後の名前である文書は、命名規則を使用していることです。"
    },
    {
      "indent": 23,
      "text": "draft-<lastname>-<wgname>...",
      "ja": "draft- <姓>  -  <wgname> ..."
    },
    {
      "indent": 3,
      "text": "Having the working group name following the personal name allows tools to associate these drafts with the working group, even though the filename identifies them as the work of individuals.",
      "ja": "個人名以下のワーキンググループ名を持つことは、ファイル名は、個人の仕事としてそれらを識別していても、ツールがワーキンググループでこれらのドラフトを関連付けることができます。"
    },
    {
      "indent": 3,
      "text": "The working group can choose to apply any of its normal, internal working group process management mechanisms to an individual I-D. However, matters of ownership, working group final approval, and the like are all subject to negotiation amongst the document authors, working group, and Area Directors.",
      "ja": "ワーキンググループは、個々のI-Dにその通常、内部ワーキンググループのプロセス管理メカニズムのいずれかを適用することを選択することができます。しかし、所有権の問題、グループ最終承認作業などは、すべての文書の作成者の間で交渉、ワーキンググループ、および地域取締役の対象となっています。"
    },
    {
      "indent": 3,
      "text": "This is a rare situation, and Working Group Chairs can be assured that the Area Directors will want to understand why the document could not be adopted and owned by the working group.",
      "ja": "これはまれな状況で、作業部会の議長は、エリアの取締役は文書はワーキンググループが採用して所有することができなかった理由を理解したいと思うことを保証することができます。"
    },
    {
      "indent": 0,
      "text": "5.2. WG Drafts Can Become Individual Drafts",
      "section_title": true,
      "ja": "5.2。 WG下書きは、個々の下書きになることができます"
    },
    {
      "indent": 3,
      "text": "A working group is not obligated to retain documents it has adopted. Sometimes working group efforts conclude that a draft is no longer appropriate for working group effort. If a working group drops a draft, then anyone is permitted to pursue it as an Individual or Independent Submission, subject to the document's existing copyright constraints.",
      "ja": "ワーキンググループは、それが採用している文書を保持する義務を負いません。時には、ワーキンググループの努力はドラフトはもはやグループの努力を作業に適していると結論付けていません。ワーキンググループは草案をドロップした場合、誰もが、ドキュメントの既存の著作権の制約を受ける個人または独立服従、としてそれを追求することが許可されています。"
    },
    {
      "indent": 0,
      "text": "5.3. Competing Drafts",
      "section_title": true,
      "ja": "5.3。競合下書き"
    },
    {
      "indent": 3,
      "text": "Engineering for interesting topics often produces competing, interesting proposals. The reasons can be technical aesthetics, engineering trade-offs, architectural differences, company economics, and the like. Although it is far more comfortable to entertain only one proposal, a working group is free to pursue more than one. Often this is necessary until a clear preference develops. Sometimes, multiple versions are formally published, absent consensus among the alternatives.",
      "ja": "興味深いトピックのためのエンジニアリングは、多くの場合、競合、興味深い提案を生成します。理由は技術的な美学、エンジニアリングのトレードオフ、建築の違い、企業の経済学などとすることができます。それが唯一の提案を楽しませるために、はるかに快適ですが、ワーキンググループは、1つ以上のものを追求して自由です。明確な好みが発達するまで、多くの場合、これは必要です。時には、複数のバージョンが正式に、選択肢の中不在の合意を発表しています。"
    },
    {
      "indent": 3,
      "text": "It is appealing to ask authors of competing proposals to find a way to merge their work. Where it makes sense to do this, it can produce a single, strong specification. The detailed discussions to merge are often better held in a design team than amidst the dynamics of an open working group mailing list. The working group has ultimate authority over any decisions, but it is not required that it be involved in all the discussions.",
      "ja": "自分の仕事をマージする方法を見つけるために、競合提案の作成者に依頼する魅力的です。それがこれを行うには理にかなっている場合、これは、単一の強力な仕様を生成することができます。詳細な議論は、多くの場合、より良いオープンワーキンググループのメーリングリストのダイナミクスに囲まよりデザインチームで開催されているマージします。ワーキンググループは、任意の意思決定に対する最終的な権限を持っていますが、それは、すべての議論に関与することを必要とされていません。"
    },
    {
      "indent": 3,
      "text": "On the other hand, some differences cannot be resolved, and attempting a merge can produce a weaker result. An example of this problem of conflicting design goals is discussed in [Heli-Sub], noting:",
      "ja": "一方、いくつかの相違点は解決できない、とマージをしようとすると、弱い結果を生成することができます。競合する設計目標のこの問題の例は注目[ヘリ-SUB]に記載されています。"
    },
    {
      "indent": 6,
      "text": "\"Helicopters are great, and so are submarines. The problem is that if you try to build one vehicle to perform two fundamentally different jobs, you're going to get a vehicle that does neither job well.\"",
      "ja": "「ヘリコプターは偉大であるので、潜水艦がある。問題は、次の2つの根本的に異なるジョブを実行するために、1台の車両を構築しようとした場合、あなたは良くもない仕事をして車を取得するつもりだということです。」"
    },
    {
      "indent": 3,
      "text": "Various management efforts can facilitate the handling of competing proposals. Some examples include:",
      "ja": "様々な経営努力は、競合する提案の取り扱いを容易にすることができます。いくつかの例は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "* Developing a requirements document that is independent of specific proposals; this can highlight features that are deemed essential and distinguish them from features that are of secondary importance, and can facilitate a discussion about features without reference to specific proposals.",
      "ja": "*具体的な提案とは独立した要件文書を開発します。このことは必須であるとみなされる特徴を強調し、二次的に重要である特徴からそれらを区別し、具体的な提案を参照することなく機能についての議論を容易にすることができることができます。"
    },
    {
      "indent": 3,
      "text": "* Developing a comparison table of the proposals; this can aid understanding of their differences.",
      "ja": "*提案の比較表を開発します。これは、その違いの理解を助けることができます。"
    },
    {
      "indent": 3,
      "text": "* Discussing the relative importance and effects of having one proposal, versus multiple; this can focus people's efforts at compromise and encourage a willingness to choose a single proposal.",
      "ja": "*相対的な重要性と、複数対1つの提案を、持っていることの影響を議論します。これは妥協では、人々の努力を集中し、単一の提案を選択する意欲を促すことができます。"
    },
    {
      "indent": 3,
      "text": "The problem of competing drafts can be particularly painful when it arises in either of two circumstances:",
      "ja": "それは2つの状況のいずれかで発生した場合、競合ドラフトの問題は、特に痛みを伴うことができます。"
    },
    {
      "indent": 3,
      "text": "* If a second proposal appears as a new draft, just as the Chairs were ready to poll the working group on adoption of the draft containing the first proposal, then the authors of the first proposal could feel affronted. It does not follow that the second draft was written to be difficult or derail the first: it might even include better ideas. So it is best not to disregard it. However, automatically asking the authors to merge their work will not necessarily produce a more solid solution and will not guarantee faster progress. This situation will be a judgement call in each case, and it might help to ask the working group for their opinion: shall the working group adopt one document as a starting point and fold in the ideas from the second under the control of consensus, or shall the working group wait until the authors of both documents have reached agreement?",
      "ja": "*第2の提案は、新しい下書きとして表示された場合は、議長は、最初の提案を含む案の採択にワーキンググループをポーリングする準備ができていたと同じように、最初の提案の著者はaffronted感じることができました。それはさらに良いアイデアが含まれる場合があります。第二案が困難であるか、または最初に頓挫するために書かれたことに従っていません。だから、それを無視することが最善ではありません。しかし、自動的に自分の仕事をマージする著者を尋ねることは、必ずしも多くの固溶体を生成しませんし、より高速な進歩を保証するものではありません。この状況は、それぞれの場合における審判の判定となり、それが自分の意見のためにワーキンググループを尋ねるために役立つかもしれない：ワーキンググループは、出発点として、一つの文書を採択し、コンセンサスの制御下で、第二のアイデアに折るもの、または両方の文書の作成者が合意に達したまで、ワーキンググループは待つもの？"
    },
    {
      "indent": 3,
      "text": "* If the working group has already adopted an I-D on a specific topic, the posting of a new individual I-D on the same topic could be seen as an attack on the working group processes or decisions. However, posting an I-D is often a good way to put new ideas into concrete form, for public consideration and discussion. The Working Group Chairs will want to encourage the working group to consider the new proposal. Shall it be adopted and entirely replace the current working group draft? Shall the new ideas be incorporated into the work of the working group through the normal editorial process? Shall the working group adopt a second competing solution? Or shall the new draft be rejected and not adopted by the working group?",
      "ja": "ワーキンググループは、すでに特定のトピックに関するI-Dを採用している場合は*、同じトピックに関する新しい個々のI-Dの投稿は、ワーキンググループのプロセスや意思決定への攻撃として見ることができます。しかし、I-Dを掲示することは、多くの場合、公共の検討と議論のために、具体的な形に新しいアイデアを置くための良い方法です。ワーキンググループの議長は、新たな提案を検討するワーキンググループを奨励することになるでしょう。それを採用し、完全に現在のワーキンググループの草案を交換されなければなりませんか？新しいアイデアは、通常の編集プロセスを通じてワーキンググループの作業に組み込まれなければなりませんか？ワーキンググループは、第二の競合ソリューションを採用しましょうか？それとも新しい案は拒否し、ワーキンググループによって採用されていないされなければなりませんか？"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "Beyond the credibility of the IETF, this document raises no security concerns.",
      "ja": "IETFの信頼性を超えて、この文書には、セキュリティ上の懸念を提起していません。"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgements",
      "section_title": true,
      "ja": "7.謝辞"
    },
    {
      "indent": 3,
      "text": "This document was developed from an IETF tutorial given by A. Farrel at an IETF Working Group Chairs lunch [Farrel-Chairs]. L. Anderson contributed useful comments.",
      "ja": "この文書は、IETFワーキンググループの議長ランチ[ファレル議長]でA.ファレルによって与えられたIETFのチュートリアルから開発されました。 L.アンダーソンは有益なコメントを貢献しました。"
    },
    {
      "indent": 0,
      "text": "8. Informative References",
      "section_title": true,
      "ja": "8.参考文献"
    },
    {
      "indent": 3,
      "text": "[Approval] IETF, \"IETF Internet-Draft Initial Version Approval Tracker\", (IETF Datatracker), <https://datatracker.ietf.org/ cgi-bin/wg/wg_init_rev_approval.cgi>.",
      "ja": "[承認] IETF、 \"IETFインターネットドラフト初期バージョンから承認トラッカー\"、（IETF Datatracker）、<https://datatracker.ietf.org/のcgi-binに/ WG / wg_init_rev_approval.cgi>。"
    },
    {
      "indent": 3,
      "text": "[Consensus] Resnick, P., \"On Consensus and Humming in the IETF\", Work in Progress, April 2014.",
      "ja": "「IETFでのコンセンサスとハミングについて」[合意]レズニック、P.、進行中、仕事、2014年4月。"
    },
    {
      "indent": 3,
      "text": "[Farrel-Chairs] Farrel, A., \"What is a Working Group ID (and when to adopt one)\", (IETF 78 WG chairs lunch Material), July 2010, <http://wiki.tools.ietf.org/group/edu/wiki/IETF78#>.",
      "ja": "[ファレル議長]ファレル、A.、（IETF 78 WGは、ランチ材質の議長を務める）、2010年7月、<http://wiki.tools.ietf.org \"何がワーキンググループID（および1を採用する）です\" /グループ/ EDU /ウィキ/ IETF78＃>。"
    },
    {
      "indent": 3,
      "text": "[Heli-Sub] Rose, M., \"On Helicopters and Submarines\", ACM Queue - Instant Messaging, Vol. 1, Issue 8, Page 10, <http://dl.acm.org/ft_gateway.cfm?id=966726>.",
      "ja": "\"ヘリコプターと潜水艦について\" [ヘリ-SUB]ローズ、M.、ACMキュー - インスタントメッセージング、巻。 1、8号、10頁<http://dl.acm.org/ft_gateway.cfm?id=966726>。"
    },
    {
      "indent": 3,
      "text": "[ID-Guidelines] Housley, R., Ed., \"Guidelines to Authors of Internet-Drafts\", December 2010, <http://www.ietf.org/ietf-ftp/1id-guidelines.txt>.",
      "ja": "[ID-ガイドライン] Housley氏、R.、エド。、 \"インターネットドラフトの著者へのガイドライン\"、2010年12月、<http://www.ietf.org/ietf-ftp/1id-guidelines.txt>。"
    },
    {
      "indent": 3,
      "text": "[ID-Info] Wijnen, B., Ed., \"Checklist for Internet-Drafts (IDs) submitted for RFC publication\", May 2009, <https://www.ietf.org/id-info/checklist.html>.",
      "ja": "[ID-情報] Wijnenの、B.、エド。、 \"インターネットドラフト（IDS）のためのチェックリストRFCの出版のために提出\"、2009年5月、<https://www.ietf.org/id-info/checklist.html> 。"
    },
    {
      "indent": 3,
      "text": "[IDNITS] IETF, \"IDNITS Tool\", 2013, <https://tools.ietf.org/tools/idnits/>.",
      "ja": "[IDNITS] IETF、 \"IDNITSツール\"、2013年、<https://tools.ietf.org/tools/idnits/>。"
    },
    {
      "indent": 3,
      "text": "[Individual] IESG, \"Guidance on Area Director Sponsoring of Documents\", March 2007, <http://www.ietf.org/iesg/statement/ ad-sponsoring-docs.html>.",
      "ja": "[個別] IESG、 \"ドキュメントのエリアディレクタースポンサの適用指針\"、2007年3月、<http://www.ietf.org/iesg/statement/広告スポンサー-docs.html>。"
    },
    {
      "indent": 3,
      "text": "[RFC-Auth-Ed] RFC Editor, \"RFC Editorial Guidelines and Procedures -- Author Overload\", 2014, <http://www.rfc-editor.org/policy.html#policy.authlist>.",
      "ja": "[RFC-AUTH-エド] RFC編集者、 \"RFC編集ガイドラインと手順 - 著者の過負荷\"、2014年、<http://www.rfc-editor.org/policy.html#policy.authlist>。"
    },
    {
      "indent": 3,
      "text": "[RFC2026] Bradner, S., \"The Internet Standards Process -- Revision 3\", BCP 9, RFC 2026, October 1996.",
      "ja": "[RFC2026]ブラドナーの、S.、 \"インターネット標準化プロセス - リビジョン3\"、BCP 9、RFC 2026、1996年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC2418] Bradner, S., \"IETF Working Group Guidelines and Procedures\", BCP 25, RFC 2418, September 1998.",
      "ja": "[RFC2418]ブラドナーの、S.、 \"IETFワーキンググループガイドラインと手順\"、BCP 25、RFC 2418、1998年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC6702] Polk, T. and P. Saint-Andre, \"Promoting Compliance with Intellectual Property Rights (IPR) Disclosure Rules\", RFC 6702, August 2012.",
      "ja": "[RFC6702]ポーク、T.、およびP.サンアンドレ、 \"知的財産権の遵守（IPR）開示規則の推進\"、RFC 6702、2012年8月。"
    },
    {
      "indent": 3,
      "text": "[Tao] Hoffman, P., Ed., \"The Tao of IETF - A Novice's Guide to the Internet Engineering Task Force\", 2012, <http://www.ietf.org/tao.html>.",
      "ja": "[タオ]ホフマン、P.、エド、「IETFのタオ - インターネットエンジニアリングタスクフォースへの初心者ガイド」。2012年、<http://www.ietf.org/tao.html>。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Adrian Farrel Juniper Networks",
      "ja": "エードリアンファレルジュニパーネットワークス"
    },
    {
      "indent": 3,
      "text": "EMail: adrian@olddog.co.uk",
      "ja": "メールアドレス：adrian@olddog.co.uk"
    },
    {
      "indent": 3,
      "text": "Dave Crocker (editor) Brandenburg InternetWorking 675 Spruce Drive Sunnyvale, CA 94086 USA",
      "ja": "デイブ・クロッカー（エディタ）ブランデンブルクインターネットワーキング675スプルースドライブサニーベール、CA 94086 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1.408.246.8253 EMail: dcrocker@bbiw.net",
      "ja": "電話：+1.408.246.8253電子メール：dcrocker@bbiw.net"
    }
  ]
}